[
  {
    "SurahNumber": "32",
    "AyahNumber": "1",
    "NoteID": "3628",
    "Body": "See n. 25 to ii. 1, and Introduction to S. xxx."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "2",
    "NoteID": "3629",
    "Body": "By the time of the holy Prophet the earlier Books of\\n\\t\\t\\t\\tRevelation had been corrupted, by human ignorance or\\n\\t\\t\\t\\tselfishness or fraud, or misinterpreted, or lost\\n\\t\\t\\t\\taltogether. There were sects violently disputing with\\n\\t\\t\\t\\teach other as to their true meaning. Such doubts had to\\n\\t\\t\\t\\tbe set at rest, and they were set at rest by the\\n\\t\\t\\t\\trevelation of the Qur-an. The Quranic inspiration came\\n\\t\\t\\t\\tdirect from Allah, the Lord of the Worlds, and did not\\n\\t\\t\\t\\tconsist merely of human conjectures or a reconstructed\\n\\t\\t\\t\\tphilosophy, in which there is always room for doubt or\\n\\t\\t\\t\\tdispute. Cf. also ii. 2."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "3",
    "NoteID": "3630",
    "Body": "The force of \"or\" (am in Arabic) is that the only\\n\\t\\t\\t\\talternative to the acceptance of the Book as a divine\\n\\t\\t\\t\\trevelation is the supposition that it was a forgery by\\n\\t\\t\\t\\tthe holy Prophet. But the supposition is absurd on the\\n\\t\\t\\t\\tface of it: because (1) the Quraish, his critics, knew\\n\\t\\t\\t\\thim to be an honest and truthful man; (2) he was\\n\\t\\t\\t\\tunlettered, and such a Book would have been beyond his\\n\\t\\t\\t\\tpowers as a simple unlettered Arab, unless Allah inspired\\n\\t\\t\\t\\tit; and (3) there was a definite reason for its coming as\\n\\t\\t\\t\\tit did, because the Arabs had received no Messenger\\n\\t\\t\\t\\tbefore him and Allah has sent Messengers to every nation."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "3",
    "NoteID": "3631",
    "Body": "The Arabs very much needed guidance for themselves, and\\n\\t\\t\\t\\tthe advent of a World Prophet through them was what might\\n\\t\\t\\t\\thave been expected in view of the past course of Allah's\\n\\t\\t\\t\\tRevelations."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "4",
    "NoteID": "3632",
    "Body": "Six Days: See n. 1031 to vii. 54. The \"Day\" does not mean\\n\\t\\t\\t\\ta day as we reckon it, viz., one apparent course of the\\n\\t\\t\\t\\tsun round the earth, for it refers to conditions which\\n\\t\\t\\t\\tbegan before the earth and the sun were created. In verse\\n\\t\\t\\t\\t5 below, a Day is compared to a thousand years of our\\n\\t\\t\\t\\treckoning, and in lxx. 4 to 50,000 years. These figures\\n\\t\\t\\t\\t\"as we reckon\" have no relation to \"timeless Time\", and\\n\\t\\t\\t\\tmust be taken to mean very long Periods, or Ages, or\\n\\t\\t\\t\\tAeons. See further xli. 9-12, and notes."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "4",
    "NoteID": "3633",
    "Body": "Cf. x. 3. n. 1386. Allah created the World as we see it\\n\\t\\t\\t\\tin six great Stages. But after the initial creation, He\\n\\t\\t\\t\\tis still in authority and directs and controls all\\n\\t\\t\\t\\taffairs. He has not delegated His powers to others, and\\n\\t\\t\\t\\tHimself retired. Also see vii. 54."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "5",
    "NoteID": "3634",
    "Body": "How could the immense mystery of Time behind our ideas of\\n\\t\\t\\t\\tit be enforced on our minds better? Our Day may be a\\n\\t\\t\\t\\tthousand or fifty thousand years, and our years in\\n\\t\\t\\t\\tproportion. In the immense Past was Allah's act of\\n\\t\\t\\t\\tcreation: it still continues, for He guides, rules, and\\n\\t\\t\\t\\tcontrols all affairs: and in the immense Future all\\n\\t\\t\\t\\taffairs will go up to Him, for He will be the Judge, and\\n\\t\\t\\t\\tHis restoration of all values will be as in a Day or an\\n\\t\\t\\t\\tHour or the Twinkling of an eye; and yet to our ideas it\\n\\t\\t\\t\\twill be as a thousand years!"
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "6",
    "NoteID": "3635",
    "Body": "Allah's attributes, then, may be summed up with reference\\n\\t\\t\\t\\tto Knowledge, Power, and Mercy. Where our knowledge is\\n\\t\\t\\t\\tpartial and uncertain, His is complete and certain. Where\\n\\t\\t\\t\\tour power often falls short of the carrying out of our\\n\\t\\t\\t\\twill, or needs the help of Time, His is complete and\\n\\t\\t\\t\\tconterminous with His Will. Where our mercy seems to be\\n\\t\\t\\t\\tbounded by or opposed to justice, His is absolute and\\n\\t\\t\\t\\tunconditioned."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "7",
    "NoteID": "3636",
    "Body": "Allah's creation in itself is good: it is beautiful, in\\n\\t\\t\\t\\tproper proportions, and adapted for the functions it has\\n\\t\\t\\t\\tto perform. There is no evil or disorder in it. Such evil\\n\\t\\t\\t\\tor disorder as creeps in is due to man's will (as far as\\n\\t\\t\\t\\tthe world of man is concerned), and spiritual Teaching is\\n\\t\\t\\t\\tdirected to train and cure that will and bring it into\\n\\t\\t\\t\\tconformity with the Universal Order and Plan."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "7",
    "NoteID": "3637",
    "Body": "Man is asked to contemplate his own humble beginning. His\\n\\t\\t\\t\\tmaterial body (apart from life) is a piece of earth or\\n\\t\\t\\t\\tclay, which is another term for primeval matter. Matter\\n\\t\\t\\t\\tis therefore the first stage, but even matter was not\\n\\t\\t\\t\\tself-created. It was created by Allah."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "8",
    "NoteID": "3638",
    "Body": "Then comes life and the reproduction of life. We are\\n\\t\\t\\t\\tstill looking at the purely physical aspect, but it is\\n\\t\\t\\t\\tnow a stage higher; it is an animal. Its reproduction is\\n\\t\\t\\t\\tthrough the sperm or semen, which is a quintessence of\\n\\t\\t\\t\\tevery part of the body of man. Yet it issues from the\\n\\t\\t\\t\\tsame part of his body as the urine, and is therefore\\n\\t\\t\\t\\tdespicable in man's sight. It is a living cell or cells,\\n\\t\\t\\t\\tsumming up so much ancestral life-history. Cf. xxiii. 12,\\n\\t\\t\\t\\tand n. 2872."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "9",
    "NoteID": "3639",
    "Body": "The third stage is indicated by \"fashioned him in due\\n\\t\\t\\t\\tproportion\". Cf. xv. 29. After fertilisation of ovum by\\n\\t\\t\\t\\tthe sperm, an individual life comes into existence, and\\n\\t\\t\\t\\tit is gradually fashioned into shape, its limbs are\\n\\t\\t\\t\\tformed; its animal life begins to function; all the\\n\\t\\t\\t\\tbeautiful adaptations come into play. The fourth stage\\n\\t\\t\\t\\there mentioned is that of distinctive Man, into whom\\n\\t\\t\\t\\tAllah's spirit is breathed. Then he rises higher than\\n\\t\\t\\t\\tanimals."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "9",
    "NoteID": "3640",
    "Body": "As a complete man he gets the higher faculties. The five\\n\\t\\t\\t\\tanimal senses I understand to be included in the third\\n\\t\\t\\t\\tstage. But in the fourth stage he rises higher, and is\\n\\t\\t\\t\\taddressed in the second person, \"you,\" instead of the\\n\\t\\t\\t\\tthird person \"him\". He has now the spiritual counterpart\\n\\t\\t\\t\\tof hearing (i.e., the capacity of hearing Allah's\\n\\t\\t\\t\\tMessage) and seeing (i.e., the inner vision), and feeling\\n\\t\\t\\t\\tthe nobler heights of love and understanding the bearings\\n\\t\\t\\t\\tof the inner life (both typified by the Heart). Yet with\\n\\t\\t\\t\\tall these gifts, what thanks does unregenerate or\\n\\t\\t\\t\\tcorrupted man give to Allah?"
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "10",
    "NoteID": "3641",
    "Body": "Cf. xiii. 5. It has been the cry of Materialists and\\n\\t\\t\\t\\tSceptics through the ages not only to bound their horizon\\n\\t\\t\\t\\twith this brief life, but to deny dogmatically that there\\n\\t\\t\\t\\tcan be a future life. Though this is against the\\n\\t\\t\\t\\tprofessed principles of Sceptics, in practice they take\\n\\t\\t\\t\\tup that attitude. Here \"they\" refers to those \"who give\\n\\t\\t\\t\\tlittle thanks\" to Allah, mentioned in the last verse. The\\n\\t\\t\\t\\targument used against them is: if Allah can produce such\\n\\t\\t\\t\\ta wonderful creation the first time, why can He not make\\n\\t\\t\\t\\tit again? That points to the possibility: our own general\\n\\t\\t\\t\\tinner hope and expectation of a future life, coupled with\\n\\t\\t\\t\\tFaith in Allah's work, is the ground of our certainty."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "11",
    "NoteID": "3642",
    "Body": "If death is certain, as it is, and this life by itself in\\n\\t\\t\\t\\tno way satisfies our instincts and expectations, we may\\n\\t\\t\\t\\tbe sure that the agency which separates our soul from our\\n\\t\\t\\t\\tbody will bring us into the new world. If we believe in a\\n\\t\\t\\t\\tsoul at all-the very foundation of Religion-we must\\n\\t\\t\\t\\tbelieve in a Future, without which the soul has no\\n\\t\\t\\t\\tmeaning."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "12",
    "NoteID": "3643",
    "Body": "In life on the new plane, there will be no room for\\n\\t\\t\\t\\tdeception or self-deception. The most hardened sinner\\n\\t\\t\\t\\twill see the truth and the justice of the Day of Account.\\n\\t\\t\\t\\tHe will wish he could be sent back, but it will be too\\n\\t\\t\\t\\tlate. The world as we know it will have already passed\\n\\t\\t\\t\\taway."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "13",
    "NoteID": "3644",
    "Body": "Could evil have been avoided? Certainly everything is in\\n\\t\\t\\t\\tAllah's power. If it had been His Will and Plan, He could\\n\\t\\t\\t\\thave created a world in which there would have been no\\n\\t\\t\\t\\tchoice or will in any of His creatures. But that was not\\n\\t\\t\\t\\tHis Will and Plan. In the world as we see it, man has a\\n\\t\\t\\t\\tcertain amount of choice and free-will. That being so, He\\n\\t\\t\\t\\thas provided Signs and means of instruction for man, in\\n\\t\\t\\t\\torder that man's will may be straight and pure. A\\n\\t\\t\\t\\tnecessary corollary will be Punishment for the infraction\\n\\t\\t\\t\\tof His Law. That Punishment must come to pass, for\\n\\t\\t\\t\\tAllah's Word is true and must be fulfilled."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "13",
    "NoteID": "3645",
    "Body": "Cf. xi. 119. n. 1623, and vii. 18, and see last note.\\n\\t\\t\\t\\tJinns are the evil spirits that tempt men, and the men\\n\\t\\t\\t\\twho will suffer punishment will be those who have\\n\\t\\t\\t\\tsuccumbed to their temptations."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "14",
    "NoteID": "3646",
    "Body": "\"Forgot\": Cf. n. 1029 to vii. 51. \"Forget\" is here in the\\n\\t\\t\\t\\tsense of \"to ignore deliberately, to reject with scorn\".\\n\\t\\t\\t\\tIn the sense of mistake or defect of knowledge it is\\n\\t\\t\\t\\tinapplicable to the All-Perfect Being, for we are\\n\\t\\t\\t\\texpressly told: \"My Lord never errs, nor forgets\": xx.\\n\\t\\t\\t\\t52."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "15",
    "NoteID": "3647",
    "Body": "\"In adoration\": Sujjadan, or in a posture of prostration,\\n\\t\\t\\t\\texpressive of deep humility and faith. This is the\\n\\t\\t\\t\\tkeyword of the Sura, which bears the title of Sajda. All\\n\\t\\t\\t\\tthe Signs of Allah lead our thoughts upwards towards Him,\\n\\t\\t\\t\\tand when they are expounded, our attitude should be one\\n\\t\\t\\t\\tof humble gratitude to Allah. At this passage it is usual\\n\\t\\t\\t\\tto make a prostration."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "16",
    "NoteID": "3648",
    "Body": "Men and women \"breathless with adoration\" shun soft,\\n\\t\\t\\t\\tcomfortable beds, and luxurious sleep. Their limbs are\\n\\t\\t\\t\\tbetter exercised in offices of devotion and prayer,\\n\\t\\t\\t\\tespecially by night. Commentators specially refer this to\\n\\t\\t\\t\\tPrayers called Tahajjud, which are offered after midnight\\n\\t\\t\\t\\tin the small hours of the morning."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "16",
    "NoteID": "3649",
    "Body": "In Fear and Hope: in spiritual fear lest their dedication\\n\\t\\t\\t\\tto Allah should not be sufficiently worthy to be\\n\\t\\t\\t\\taccepted, and a spiritual longing or hope that their\\n\\t\\t\\t\\tshortcomings will be overlooked by the Mercy of Allah.\\n\\t\\t\\t\\tAnd their adoration is not shown only in Prayer, but also\\n\\t\\t\\t\\tin practical Service and Charity, out of whatever gifts\\n\\t\\t\\t\\tthey may have received from Allah."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "17",
    "NoteID": "3650",
    "Body": "Delights of the eye: an idiom for that which pleases most\\n\\t\\t\\t\\tand gives most satisfaction. In our present state we can\\n\\t\\t\\t\\tscarcely imagine the real Bliss that will come to us in\\n\\t\\t\\t\\tthe Future."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "18",
    "NoteID": "3651",
    "Body": "The Future of the two classes-the Blessed and the\\n\\t\\t\\t\\tWicked-is described in verses 19-22."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "19",
    "NoteID": "3652",
    "Body": "A home brings before our minds a picture of peace and\\n\\t\\t\\t\\thappiness. When to it are added honour and hospitality,\\n\\t\\t\\t\\tit adds further to the idea of happiness."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "20",
    "NoteID": "3653",
    "Body": "Cf. xxii. 22. Just as the gardens is the type of Bliss,\\n\\t\\t\\t\\tso is the Fire the type of Penalty and suffering. There\\n\\t\\t\\t\\twill be no getting away from it. What will be the\\n\\t\\t\\t\\tthoughts of those who had earned it? \"We used to reject\\n\\t\\t\\t\\tthe idea of the Consequences as a mere chimera: and now\\n\\t\\t\\t\\twe find it to be true!\" What will be their feelings then?\\n\\t\\t\\t\\tHow will they like it!"
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "21",
    "NoteID": "3654",
    "Body": "The final Penalty is to come in the Hereafter. There is\\n\\t\\t\\t\\tno doubt about it. But before it comes, a minor Penalty\\n\\t\\t\\t\\tcomes in this very life. It may be in some kind of\\n\\t\\t\\t\\tmisfortune, or it may be in the pangs of a tortured\\n\\t\\t\\t\\tconscience or secret sorrow. But this minor Penalty may\\n\\t\\t\\t\\tbe really a mercy, as it gives them a chance of\\n\\t\\t\\t\\trepentance and amendment."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "22",
    "NoteID": "3655",
    "Body": "The worst and most hardened sinner is the man to whom\\n\\t\\t\\t\\tAllah's Signs are actually brought home and who yet\\n\\t\\t\\t\\tprefers Evil and turns away from the Light of Allah. The\\n\\t\\t\\t\\tSigns may be in the words and guidance of a great Teacher\\n\\t\\t\\t\\tor in some minor sorrow or warning, which he disregards\\n\\t\\t\\t\\twith contumely. Or it may be in a catastrophic blow to\\n\\t\\t\\t\\this conscience, which should open his eyes, but from\\n\\t\\t\\t\\twhich he deliberately refuses to profit. The penalty-the\\n\\t\\t\\t\\tNemesis-must necessarily come eventually."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "23",
    "NoteID": "3656",
    "Body": "\"The Book\" is not here coextensive with Revelation. Moses\\n\\t\\t\\t\\thad, revealed to him, a Law, a shari'at, which was to\\n\\t\\t\\t\\tguide his people in all the practical affairs of their\\n\\t\\t\\t\\tlife. Jesus, after him, was also inspired by Allah: but\\n\\t\\t\\t\\this Injil or Gospel contained only general principles and\\n\\t\\t\\t\\tnot a Code or shari'at. The holy Prophet was the next one\\n\\t\\t\\t\\tto have a shari'at or \"Book\" in that sense: for the\\n\\t\\t\\t\\tQur-an contains both a Code and general principles. This\\n\\t\\t\\t\\tSura is a Makkan Sura. The Code came later in Madinah.\\n\\t\\t\\t\\tBut he is given the assurance that he will also have a\\n\\t\\t\\t\\tCode, to supersede the earlier Law, and complete the\\n\\t\\t\\t\\tRevelation of Allah."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "23",
    "NoteID": "3657",
    "Body": "\"Its reaching (thee)\" : liqa-i-hi. Commentators differ as\\n\\t\\t\\t\\tto the construction of the pronoun hi, which may be\\n\\t\\t\\t\\ttranslated either \"its\" or \"his\". I construe it to refer\\n\\t\\t\\t\\tto \"the Book\", as that gives the most natural meaning, as\\n\\t\\t\\t\\texplained in the last note."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "24",
    "NoteID": "3658",
    "Body": "The series of Judges, Prophets, and Kings in Israel\\n\\t\\t\\t\\tcontinued to give good guidance, in accordance with\\n\\t\\t\\t\\tAllah's Law, as long as the people continued in Faith and\\n\\t\\t\\t\\tConstancy (persevering patience). When that condition\\n\\t\\t\\t\\tceased, Allah's grace was withdrawn, and the people broke\\n\\t\\t\\t\\tup into wrangling sects and practically suffered national\\n\\t\\t\\t\\tannihilation."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "25",
    "NoteID": "3659",
    "Body": "These wrangles and disputes among them will continue\\n\\t\\t\\t\\tuntil the Day of Judgment, but meantime a new Ummat (that\\n\\t\\t\\t\\tof Islam) will arise and take its place, with a universal\\n\\t\\t\\t\\tand unified Message for mankind."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "26",
    "NoteID": "3660",
    "Body": "If a nation gone astray could only learn from the history\\n\\t\\t\\t\\tof earlier nations that were destroyed for their evil!\\n\\t\\t\\t\\tTheir could sec vestiges of them in their daily goings to\\n\\t\\t\\t\\tand fro: the Jews could see vestiges of the Philistines,\\n\\t\\t\\t\\tAmalekites, etc. in Palestine, and the pagan Arabs, of\\n\\t\\t\\t\\tthe 'Ad and Thamud in Arabia."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "26",
    "NoteID": "3661",
    "Body": "\"Listen\": i.e., listen to the warnings conveyed in\\n\\t\\t\\t\\tAllah's Signs. Notice how naturally the transition is\\n\\t\\t\\t\\teffected from the physical to the spiritual-from the\\n\\t\\t\\t\\truined physical vestiges of ungodly nations on this earth\\n\\t\\t\\t\\tto the more intangible Signs conveyed by History and\\n\\t\\t\\t\\tRevelation. Here the sense of Hearing is mentioned, both\\n\\t\\t\\t\\tin its physical and its metaphysical or spiritual aspect.\\n\\t\\t\\t\\tIn the next verse the sense of Sight is mentioned in both\\n\\t\\t\\t\\taspects."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "27",
    "NoteID": "3662",
    "Body": "Again, as in the last verse, there is an easy transition\\n\\t\\t\\t\\tfrom the physical to the spiritual. In physical nature\\n\\t\\t\\t\\tthere may be parched soil, which is to all intents and\\n\\t\\t\\t\\tpurposes dead. Allah sends rain, and the dead soil is\\n\\t\\t\\t\\tconverted into living land producing rich crops of fodder\\n\\t\\t\\t\\tand corn, nuts and fruits, to satisfy the hunger of man\\n\\t\\t\\t\\tand beast. So in the spiritual world. The dead man is\\n\\t\\t\\t\\trevivified by Allah's grace and mercy, through His\\n\\t\\t\\t\\tRevelation. He becomes not only an asset to himself but\\n\\t\\t\\t\\tto his dependents and those around him."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "27",
    "NoteID": "3663",
    "Body": "The verse begins with \"do they not see?\" (a wa lam\\n\\t\\t\\t\\tyarau), a physical act. It ends with \"have they not the\\n\\t\\t\\t\\tvision?\" (afa la yabsirun), a matter of spiritual\\n\\t\\t\\t\\tinsight. This is parallel to the two kinds of \"hearing\"\\n\\t\\t\\t\\tor \"listening\", explained in n. 3661 above."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "28",
    "NoteID": "3664",
    "Body": "The Unbelievers may say: \"If all this which you say is\\n\\t\\t\\t\\ttrue, tell us when this final decision between right and\\n\\t\\t\\t\\twrong will come about.\" The answer is: \"If you mean that\\n\\t\\t\\t\\tyou will postpone your repentance and reform till then,\\n\\t\\t\\t\\tit will be no use: it will be too late for repentance,\\n\\t\\t\\t\\tand no respite will be granted then: this is the Respite,\\n\\t\\t\\t\\tand this is your chance.\""
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "30",
    "NoteID": "3665",
    "Body": "Read vi. 158 and n. 984 as a commentary on this. There it\\n\\t\\t\\t\\tis said to the Unbelievers: \"Wait ye: we too are\\n\\t\\t\\t\\twaiting.\" Here the Righteous one is told: \"Wait (thou):\\n\\t\\t\\t\\tthey too are waiting.\" The reversal of the order is\\n\\t\\t\\t\\tappropriate: in each case the person (or persons)\\n\\t\\t\\t\\taddressed is mentioned first. Cf. also vii. 71."
  }
]
