[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "10",
        "bookName": "Eclipses",
        "bookNameArabic": "كتاب الكسوف",
        "hadiths": [
            {
                "hadithNo": "2089",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Aishah said: \"The sun was eclipsed at the time of the Messenger of Allah (s.a.w), and the Messenger of Allah (s.a.W) stood up and prayed, and stood for a very long time. Then he bowed and bowed for a very long time. Then he raised his head and stood for a very long time, but it was shorter than the first time. Then he bowed and bowed for a very long time, but it was shorter than the first time. Then he prostrated. Then he stood up and stood for a long time, but it was shorter than the first time. Then he bowed and bowed for a long time, but it was shorter than the first time. Then he raised his head and stood for a long time, but it was shorter than the first time. Then he bowed and bowed for a long time, but it was shorter than the first time. Then he prostrated. Then the Messenger of Allah (s.a.w) finished (the prayer) and the eclipse had ended. Then he addressed the people, praising and glorifying Allah, then he said: 'The sun and the moon are two of the signs of Allah, and they do not become eclipsed for the death or birth of anyone. If you see that, then say the Takbir and offer supplication to Allah, pray and give charity. O Ummah of Muhammad! There is no one who is more jealous than Allah of His male or female slave commits Zina. O Ummah of Muhammad! If you knew what I know, you would laugh little and weep much. Have I not conveyed (the message)?\"'",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ خَسَفَتِ الشَّمْسُ فِى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَامَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يُصَلِّى فَأَطَالَ الْقِيَامَ جِدًّا ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ جِدًّا ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِيَامَ جِدًّا وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ جِدًّا وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ رَفَعَ رَأْسَهُ فَقَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ انْصَرَفَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَقَدْ تَجَلَّتِ الشَّمْسُ فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ « إِنَّ الشَّمْسَ وَالْقَمَرَ مِنْ آيَاتِ اللَّهِ وَإِنَّهُمَا لاَ يَنْخَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَكَبِّرُوا وَادْعُوا اللَّهَ وَصَلُّوا وَتَصَدَّقُوا يَا أُمَّةَ مُحَمَّدٍ إِنْ مِنْ أَحَدٍ أَغْيَرَ مِنَ اللَّهِ أَنْ يَزْنِىَ عَبْدُهُ أَوْ تَزْنِىَ أَمَتُهُ يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَبَكَيْتُمْ كَثِيرًا وَلَضَحِكْتُمْ قَلِيلاً أَلاَ هَلْ بَلَّغْتُ ». وَفِى رِوَايَةِ مَالِكٍ « إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ »."
            },
            {
                "hadithNo": "2090",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Hisham bin 'Urwah with this chain (a similar Hadith as no. 2089), and he added: \"Then he said: 'The sun and the moon are two of the signs of Allah.\" And he also added: \"Then he raised his hands and said: \"O Allah, have I conveyed (the message)?\"'",
                "hadithArabic": "حَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الإِسْنَادِ وَزَادَ ثُمَّ قَالَ « أَمَّا بَعْدُ فَإِنَّ الشَّمْسَ وَالْقَمَرَ مِنْ آيَاتِ اللَّهِ ». وَزَادَ أَيْضًا ثُمَّ رَفَعَ يَدَيْهِ فَقَالَ « اللَّهُمَّ هَلْ بَلَّغْتُ »."
            },
            {
                "hadithNo": "2091",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Aishah, the wife of the Prophet (s.a.w), said: \"The sun was eclipsed during the lifetime of the Messenger of Allah (s.a.w), The Messenger of Allah (s.a.w) went out to the Masjid and stood and said the Takbir, and the people formed rows behind him. The Messenger of Allah (s.a.w) recited for a long time, then he said the Takbir and bowed for a long time. Then he raised his head and said: 'Sami' Allahu liman hamidah; rabbana lakal-hamd (Allah hears those who praise Him; our Lord, to You be praise.)' Then he stood and recited for a long time, but it was shorter than the first time. Then he said the Takbir and bowed for a long time, but it was shorter than the first time. Then he said: 'Sami' Allahu liman hamidah; rabbana lakal-hamd (Allah hears those who praise Him; our Lord, to You be praise.)' Then he prostrated - Abu At-Tahir (one of the narrators) did not say: \"then he prostrated\" - \"then he did likewise in the second Rak'ah, until he had completed four bowings and four prostrations, and the eclipse ended before he finished the prayer. Then he stood and addressed the people. He praised Allah as He deserves to be praised, then he said: 'The sun and the moon are two of the signs of Allah, and they do not become eclipsed for the death or birth of anyone. If you see that, then hasten to pray.' He also said: 'Pray until Allah grants you relief.' And the Messenger of Allah (s.a.w) said: 'While I was standing, I saw everything that you have been promised; I even saw myself wanting to take a bunch of grapes from Paradise when you saw me stepping forward. And I saw Hell, parts of it consuming other parts, when you saw me moving backwards. And I saw therein 'Amr bin Luhayy, who is the one who established the custom of As-Sa'ib.\"' The narration of Abu At-Tahir ends with the words, \"then hasten to pray,\" and he did not mention what comes after that.",
                "hadithArabic": "حَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنِى ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ ح وَحَدَّثَنِى أَبُو الطَّاهِرِ وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِىُّ قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنِ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِى عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- قَالَتْ خَسَفَتِ الشَّمْسُ فِى حَيَاةِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَخَرَجَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِلَى الْمَسْجِدِ فَقَامَ وَكَبَّرَ وَصَفَّ النَّاسُ وَرَاءَهُ فَاقْتَرَأَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- قِرَاءَةً طَوِيلَةً ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلاً ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ « سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ». ثُمَّ قَامَ فَاقْتَرَأَ قِرَاءَةً طَوِيلَةً هِىَ أَدْنَى مِنَ الْقِرَاءَةِ الأُولَى ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلاً هُوَ أَدْنَى مِنَ الرُّكُوعِ الأَوَّلِ ثُمَّ قَالَ « سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ». ثُمَّ سَجَدَ - وَلَمْ يَذْكُرْ أَبُو الطَّاهِرِ ثُمَّ سَجَدَ - ثُمَّ فَعَلَ فِى الرَّكْعَةِ الأُخْرَى مِثْلَ ذَلِكَ حَتَّى اسْتَكْمَلَ أَرْبَعَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ وَانْجَلَتِ الشَّمْسُ قَبْلَ أَنْ يَنْصَرِفَ ثُمَّ قَامَ فَخَطَبَ النَّاسَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ « إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهَا فَافْزَعُوا لِلصَّلاَةِ ». وَقَالَ أَيْضًا « فَصَلُّوا حَتَّى يُفَرِّجَ اللَّهُ عَنْكُمْ ». وَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « رَأَيْتُ فِى مَقَامِى هَذَا كُلَّ شَىْءٍ وُعِدْتُمْ حَتَّى لَقَدْ رَأَيْتُنِى أُرِيدُ أَنْ آخُذَ قِطْفًا مِنَ الْجَنَّةِ حِينَ رَأَيْتُمُونِى جَعَلْتُ أُقَدِّمُ - وَقَالَ الْمُرَادِىُّ أَتَقَدَّمُ - وَلَقَدْ رَأَيْتُ جَهَنَّمَ يَحْطِمُ بَعْضُهَا بَعْضًا حِينَ رَأَيْتُمُونِى تَأَخَّرْتُ وَرَأَيْتُ فِيهَا ابْنَ لُحَىٍّ وَهُوَ الَّذِى سَيَّبَ السَّوَائِبَ ». وَانْتَهَى حَدِيثُ أَبِى الطَّاهِرِ عِنْدَ قَوْلِهِ « فَافْزَعُوا لِلصَّلاَةِ ». وَلَمْ يَذْكُرْ مَا بَعْدَهُ."
            },
            {
                "hadithNo": "2092",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Aishah that the sun was eclipsed at the time of the Messenger of Allah (s.a.w). He sent a caller calling: \"The prayer is being assembled\", and they gathered, and he went forward and said the Takbir, and prayed with four bowings and four prostrations in two Rak'ah.",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِىُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ قَالَ الأَوْزَاعِىُّ أَبُو عَمْرٍو وَغَيْرُهُ سَمِعْتُ ابْنَ شِهَابٍ الزُّهْرِىَّ يُخْبِرُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ الشَّمْسَ خَسَفَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَبَعَثَ مُنَادِيًا « الصَّلاَةَ جَامِعَةً ». فَاجْتَمَعُوا وَتَقَدَّمَ فَكَبَّرَ. وَصَلَّى أَرْبَعَ رَكَعَاتٍ فِى رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ."
            },
            {
                "hadithNo": "2093",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Aishah that the Prophet (s.a.w) recited out loud in the eclipse prayer, and he prayed with four bowings and four prostrations in two Rak'ah.",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ أَنَّهُ سَمِعَ ابْنَ شِهَابٍ يُخْبِرُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- جَهَرَ فِى صَلاَةِ الْخُسُوفِ بِقِرَاءَتِهِ فَصَلَّى أَرْبَعَ رَكَعَاتٍ فِى رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ."
            },
            {
                "hadithNo": "2094",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Prophet (s.a.w) prayed with four bowings and four prostrations in two Rak'ah.",
                "hadithArabic": "قَالَ الزُّهْرِىُّ وَأَخْبَرَنِى كَثِيرُ بْنُ عَبَّاسٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهُ صَلَّى أَرْبَعَ رَكَعَاتٍ فِى رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ."
            },
            {
                "hadithNo": "2095",
                "chapterNo": "1",
                "hadithEnglish": "Ibn 'Abbas used to narrate a narration similar to that of 'Urwah from 'Aishah concerning the prayer of the Messenger of Allah (s.a.w) on the day when the sun was eclipsed.",
                "hadithArabic": "وَحَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ الزُّبَيْدِىُّ عَنِ الزُّهْرِىِّ قَالَ كَانَ كَثِيرُ بْنُ عَبَّاسٍ يُحَدِّثُ أَنَّ ابْنَ عَبَّاسٍ كَانَ يُحَدِّثُ عَنْ صَلاَةِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- يَوْمَ كَسَفَتِ الشَّمْسُ بِمِثْلِ مَا حَدَّثَ عُرْوَةُ عَنْ عَائِشَةَ."
            },
            {
                "hadithNo": "2096",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Ata': 'Ubaid bin 'Umair said: 'One whom I regard as truthful' - I think he meant 'Aishah - 'told me that the sun was eclipsed at the time of the Messenger of Allah (s.a.w) and he stood for a very long time: \"He stood then he bowed, then he stood, then he bowed, then he stood, then he bowed; two Rak'ah with three bowings and four prostrations. When he finished, the eclipse had ended. When he bowed he said: ''Allahu akbar,\" and when he raised his head he said: \"Sami' Allahu liman hamidah (Allah hears those who praise Him).\" Then he stood and praised and glorified Allah, then he said: \"The sun and the moon do not become eclipsed for the death or birth of anyone. Rather they are signs of Allah with which Allah creates fear in His slaves, so if you see them being eclipsed, remember Allah until the eclipse is over.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ عَطَاءً يَقُولُ سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُ حَدَّثَنِى مَنْ أُصَدِّقُ - حَسِبْتُهُ يُرِيدُ عَائِشَةَ - أَنَّ الشَّمْسَ انْكَسَفَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَامَ قِيَامًا شَدِيدًا يَقُومُ قَائِمًا ثُمَّ يَرْكَعُ ثُمَّ يَقُومُ ثُمَّ يَرْكَعُ ثُمَّ يَقُومُ ثُمَّ يَرْكَعُ رَكْعَتَيْنِ فِى ثَلاَثِ رَكَعَاتٍ وَأَرْبَعِ سَجَدَاتٍ فَانْصَرَفَ وَقَدْ تَجَلَّتِ الشَّمْسُ وَكَانَ إِذَا رَكَعَ قَالَ « اللَّهُ أَكْبَرُ ». ثُمَّ يَرْكَعُ وَإِذَا رَفَعَ رَأْسَهُ قَالَ « سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ». فَقَامَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ « إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَكْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ وَلَكِنَّهُمَا مِنْ آيَاتِ اللَّهِ يُخَوِّفُ اللَّهُ بِهِمَا عِبَادَهُ فَإِذَا رَأَيْتُمْ كُسُوفًا فَاذْكُرُوا اللَّهَ حَتَّى يَنْجَلِيَا »."
            },
            {
                "hadithNo": "2097",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Aishah that the Messenger of Allah (s.a.w) prayed with six bowings and four prostrations.",
                "hadithArabic": "وَحَدَّثَنِى أَبُو غَسَّانَ الْمِسْمَعِىُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالاَ حَدَّثَنَا مُعَاذٌ - وَهُوَ ابْنُ هِشَامٍ - حَدَّثَنِى أَبِى عَنْ قَتَادَةَ عَنْ عَطَاءِ بْنِ أَبِى رَبَاحٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ أَنَّ نَبِىَّ اللَّهِ -صلى الله عليه وسلم- صَلَّى سِتَّ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ."
            },
            {
                "hadithNo": "2098",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Amrah that a Jewish woman came to 'Aishah to beg from her. She said: \"May Allah grant you refuge from the punishment of the grave.\" 'Aishah said: \"I said: 'O Messenger of Allah, will the people be punished in their graves?\"' 'Amrah (one of the narrators) said: \"'Aishah said: 'The Messenger of Allah (s.a.w) said: \"I seek refuge with Allah.\" Then the Messenger of Allah (s.a.w) rode that morning and the sun was eclipsed.\"' 'Aishah said: \"I went out with some other women behind the apartments in the Masjid, and the Messenger of Allah (s.a.w) came from his ride, and went to his prayer-place where he used to pray. He stood and the people stood behind him.\" 'Aishah said: \"He stood for a long time, then he bowed, and remained bowing for a long time, then he raised his head and stood for a long time that was shorter than the first time. Then he bowed for a long time that was shorter than the first time. Then he raised his head and the eclipse had ended. He said: 'I saw you being put to trial in the grave like the tribulation of the Dajjal.\"' 'Amrah said: \"I heard 'Aishah say: 'I used to hear the Messenger of Allah (s.a.w) after that, seeking refuge with Allah from the punishment of Hell and the punishment of the grave.\"'",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِىُّ حَدَّثَنَا سُلَيْمَانُ - يَعْنِى ابْنَ بِلاَلٍ - عَنْ يَحْيَى عَنْ عَمْرَةَ أَنَّ يَهُودِيَّةً أَتَتْ عَائِشَةَ تَسْأَلُهَا فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ. قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ يُعَذَّبُ النَّاسُ فِى الْقُبُورِ قَالَتْ عَمْرَةُ فَقَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- عَائِذًا بِاللَّهِ ثُمَّ رَكِبَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- ذَاتَ غَدَاةٍ مَرْكَبًا فَخَسَفَتِ الشَّمْسُ. قَالَتْ عَائِشَةُ فَخَرَجْتُ فِى نِسْوَةٍ بَيْنَ ظَهْرَىِ الْحُجَرِ فِى الْمَسْجِدِ فَأَتَى رَسُولُ اللَّهِ -صلى الله عليه وسلم- مِنْ مَرْكَبِهِ حَتَّى انْتَهَى إِلَى مُصَلاَّهُ الَّذِى كَانَ يُصَلِّى فِيهِ فَقَامَ وَقَامَ النَّاسُ وَرَاءَهُ - قَالَتْ عَائِشَةُ - فَقَامَ قِيَامًا طَوِيلاً ثُمَّ رَكَعَ فَرَكَعَ رُكُوعًا طَوِيلاً ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَرَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ ذَلِكَ الرُّكُوعِ ثُمَّ رَفَعَ وَقَدْ تَجَلَّتِ الشَّمْسُ فَقَالَ « إِنِّى قَدْ رَأَيْتُكُمْ تُفْتَنُونَ فِى الْقُبُورِ كَفِتْنَةِ الدَّجَّالِ ». قَالَتْ عَمْرَةُ فَسَمِعْتُ عَائِشَةَ تَقُولُ فَكُنْتُ أَسْمَعُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- بَعْدَ ذَلِكَ يَتَعَوَّذُ مِنْ عَذَابِ النَّارِ وَعَذَابِ الْقَبْرِ."
            },
            {
                "hadithNo": "2099",
                "chapterNo": "2",
                "hadithEnglish": "A Hadith similar to that of Sulaiman bin Bilal (no. 1098) was narrated from Yahya bin Sa'eed with this chain.",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ ح وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ جَمِيعًا عَنْ يَحْيَى بْنِ سَعِيدٍ فِى هَذَا الإِسْنَادِ بِمِثْلِ مَعْنَى حَدِيثِ سُلَيْمَانَ بْنِ بِلاَلٍ."
            },
            {
                "hadithNo": "2100",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"The sun was eclipsed at the time of the Messenger of Allah (s.a.w) on a very hot day. The Messenger of Allah (s.a.w) led his Companions in prayer, and he stood for such a long time that they began to fall down. Then he bowed for a long time, then he raised his head and stood for a long time, then he bowed for a long time, then he raised his head and stood for a long time, then he prostrated twice, then he stood up and did the same again. There were four bowings and four prostrations. Then he said: 'Everything that you are going to enter was shown to me. Paradise was shown to me, and if I had wanted to take a bunch of grapes from it, I could have' - or 'I tried to take a bunch of grapes from it, but my arm couldn't reach. And Hell was shown to me, and I saw therein a woman from the Children of Israel who was being punished because of a cat that belonged to her; she tied it up and did not feed it, nor did she let it eat from the vermin of the earth. And I saw Abu Thumamah 'Amr bin Malik dragging his intestines in Hell. They used to say that the sun and moon only became eclipsed because of the death of a great man, but they are two of the signs of Allah that He has shown to you, so when they become eclipsed, pray until it is over.\"'",
                "hadithArabic": "وَحَدَّثَنِى يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِىُّ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ عَنْ هِشَامٍ الدَّسْتَوَائِىِّ قَالَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فِى يَوْمٍ شَدِيدِ الْحَرِّ فَصَلَّى رَسُولُ اللَّهِ -صلى الله عليه وسلم- بِأَصْحَابِهِ فَأَطَالَ الْقِيَامَ حَتَّى جَعَلُوا يَخِرُّونَ ثُمَّ رَكَعَ فَأَطَالَ ثُمَّ رَفَعَ فَأَطَالَ ثُمَّ رَكَعَ فَأَطَالَ ثُمَّ رَفَعَ فَأَطَالَ ثُمَّ سَجَدَ سَجْدَتَيْنِ ثُمَّ قَامَ فَصَنَعَ نَحْوًا مِنْ ذَاكَ فَكَانَتْ أَرْبَعَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ ثُمَّ قَالَ « إِنَّهُ عُرِضَ عَلَىَّ كُلُّ شَىْءٍ تُولَجُونَهُ فَعُرِضَتْ عَلَىَّ الْجَنَّةُ حَتَّى لَوْ تَنَاوَلْتُ مِنْهَا قِطْفًا أَخَذْتُهُ - أَوْ قَالَ تَنَاوَلْتُ مِنْهَا قِطْفًا - فَقَصُرَتْ يَدِى عَنْهُ وَعُرِضَتْ عَلَىَّ النَّارُ فَرَأَيْتُ فِيهَا امْرَأَةً مِنْ بَنِى إِسْرَائِيلَ تُعَذَّبُ فِى هِرَّةٍ لَهَا رَبَطَتْهَا فَلَمْ تُطْعِمْهَا وَلَمْ تَدَعْهَا تَأْكُلُ مِنْ خَشَاشِ الأَرْضِ وَرَأَيْتُ أَبَا ثُمَامَةَ عَمْرَو بْنَ مَالِكٍ يَجُرُّ قُصْبَهُ فِى النَّارِ. وَإِنَّهُمْ كَانُوا يَقُولُونَ إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَخْسِفَانِ إِلاَّ لِمَوْتِ عَظِيمٍ وَإِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ يُرِيكُمُوهُمَا فَإِذَا خَسَفَا فَصَلُّوا حَتَّى تَنْجَلِىَ »."
            },
            {
                "hadithNo": "2101",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as no. 2100) was narrated from Hishiim with this chain, but he said: \"I saw in Hell a tall, black, Himyari woman,\" and he did not say: \"from the Children of Israel.\"",
                "hadithArabic": "وَحَدَّثَنِيهِ أَبُو غَسَّانَ الْمِسْمَعِىُّ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ عَنْ هِشَامٍ بِهَذَا الإِسْنَادِ مِثْلَهُ إِلاَّ أَنَّهُ قَالَ « وَرَأَيْتُ فِى النَّارِ امْرَأَةً حِمْيَرِيَّةً سَوْدَاءَ طَوِيلَةً ». وَلَمْ يَقُلْ « مِنْ بَنِى إِسْرَائِيلَ »."
            },
            {
                "hadithNo": "2102",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Jabir said: \"The sun was eclipsed during the time of the Messenger of Allah (s.a.w) on the day when Ibrahim, the son of the Messenger of Allah (s.a.w), died, and the people said: 'It has become eclipsed because of the death of Ibrahim.' The Messenger of Allah (s.a.w) stood up and led the people in praying six Rak'ah with four prostrations. He started by saying the Takbir, then he recited for a long time, then he bowed for almost as long as he had stood, then he raised his head from bowing and recited for a shorter time than the first time. Then he bowed for almost as long as he had stood, then he raised his head from bowing, and recited for a shorter time than the second time. Then he bowed for almost as long as he had stood, then he raised his head from bowing. Then he went down in prostration and prostrated twice. Then he stood up and performed three more Rak'ah, in which each Rak'ah was shorter than the one that came before it, and the bowing was similar in length to the prostration. Then he moved backwards and the rows behind him also moved backwards, until we could go no further\" - Abu Bakr (one of the narrators) said: \"until he reached the women.\" - \"Then he moved forward and the people moved forward with him, until he was standing back in his place, and he completed the prayer as it should be completed and the sun had become bright. Then he said: 'O people, the sun and the moon are two of the signs of Allah and they do not become eclipsed for the death of anyone among the people' - Abu Bakr said: 'for the death of any human being.' - 'If you see anything of that nature, then pray until it is over. There is nothing that you have been promised but I saw it during this prayer of mine. Hell was brought and that is when you saw me moving backwards for fear that its flames might touch me. I saw therein the owner of the curved staff, dragging his intestines in the Fire; he used to steal from the pilgrims with his curved staff, and if he was discovered he would say: \"It got caught on my curved staff,\" but if he was not noticed then he would take it. And I saw therein the woman who had a cat which she tied up and did not feed, and she did not let it eat from the vermin of the earth, until it died of starvation. Then Paradise was brought to me, and that is when you saw me move forward until I was back in my place. I stretched out my hand and I wanted to pick some of its fruits so that you could see them, then I thought that I should not do that. And there is nothing that you have been promised but I saw it during this prayer of mine.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ - وَتَقَارَبَا فِى اللَّفْظِ - قَالَ حَدَّثَنَا أَبِى حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ انْكَسَفَتِ الشَّمْسُ فِى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- يَوْمَ مَاتَ إِبْرَاهِيمُ ابْنُ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ النَّاسُ إِنَّمَا انْكَسَفَتْ لِمَوْتِ إِبْرَاهِيمَ. فَقَامَ النَّبِىُّ -صلى الله عليه وسلم- فَصَلَّى بِالنَّاسِ سِتَّ رَكَعَاتٍ بِأَرْبَعِ سَجَدَاتٍ بَدَأَ فَكَبَّرَ ثُمَّ قَرَأَ فَأَطَالَ الْقِرَاءَةَ ثُمَّ رَكَعَ نَحْوًا مِمَّا قَامَ ثُمَّ رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ فَقَرَأَ قِرَاءَةً دُونَ الْقِرَاءَةِ الأُولَى ثُمَّ رَكَعَ نَحْوًا مِمَّا قَامَ ثُمَّ رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ فَقَرَأَ قِرَاءَةً دُونَ الْقِرَاءَةِ الثَّانِيَةِ ثُمَّ رَكَعَ نَحْوًا مِمَّا قَامَ ثُمَّ رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ ثُمَّ انْحَدَرَ بِالسُّجُودِ فَسَجَدَ سَجْدَتَيْنِ ثُمَّ قَامَ فَرَكَعَ أَيْضًا ثَلاَثَ رَكَعَاتٍ لَيْسَ فِيهَا رَكْعَةٌ إِلاَّ الَّتِى قَبْلَهَا أَطْوَلُ مِنَ الَّتِى بَعْدَهَا وَرُكُوعُهُ نَحْوًا مِنْ سُجُودِهِ ثُمَّ تَأَخَّرَ وَتَأَخَّرَتِ الصُّفُوفُ خَلْفَهُ حَتَّى انْتَهَيْنَا - وَقَالَ أَبُو بَكْرٍ حَتَّى انْتَهَى إِلَى النِّسَاءِ - ثُمَّ تَقَدَّمَ وَتَقَدَّمَ النَّاسُ مَعَهُ حَتَّى قَامَ فِى مَقَامِهِ فَانْصَرَفَ حِينَ انْصَرَفَ وَقَدْ آضَتِ الشَّمْسُ فَقَالَ « يَا أَيُّهَا النَّاسُ إِنَّمَا الشَّمْسُ وَالْقَمَرُ آيَتَانِ مِنْ آيَاتِ اللَّهِ وَإِنَّهُمَا لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنَ النَّاسِ - وَقَالَ أَبُو بَكْرٍ لِمَوْتِ بَشَرٍ - فَإِذَا رَأَيْتُمْ شَيْئًا مِنْ ذَلِكَ فَصَلُّوا حَتَّى تَنْجَلِىَ مَا مِنْ شَىْءٍ تُوعَدُونَهُ إِلاَّ قَدْ رَأَيْتُهُ فِى صَلاَتِى هَذِهِ لَقَدْ جِىءَ بِالنَّارِ وَذَلِكُمْ حِينَ رَأَيْتُمُونِى تَأَخَّرْتُ مَخَافَةَ أَنْ يُصِيبَنِى مِنْ لَفْحِهَا وَحَتَّى رَأَيْتُ فِيهَا صَاحِبَ الْمِحْجَنِ يَجُرُّ قُصْبَهُ فِى النَّارِ كَانَ يَسْرِقُ الْحَاجَّ بِمِحْجَنِهِ فَإِنْ فُطِنَ لَهُ قَالَ إِنَّمَا تَعَلَّقَ بِمِحْجَنِى. وَإِنْ غُفِلَ عَنْهُ ذَهَبَ بِهِ وَحَتَّى رَأَيْتُ فِيهَا صَاحِبَةَ الْهِرَّةِ الَّتِى رَبَطَتْهَا فَلَمْ تُطْعِمْهَا وَلَمْ تَدَعْهَا تَأْكُلُ مِنْ خَشَاشِ الأَرْضِ حَتَّى مَاتَتْ جُوعًا ثُمَّ جِىءَ بِالْجَنَّةِ وَذَلِكُمْ حِينَ رَأَيْتُمُونِى تَقَدَّمْتُ حَتَّى قُمْتُ فِى مَقَامِى وَلَقَدْ مَدَدْتُ يَدِى وَأَنَا أُرِيدُ أَنْ أَتَنَاوَلَ مِنْ ثَمَرِهَا لِتَنْظُرُوا إِلَيْهِ ثُمَّ بَدَا لِى أَنْ لاَ أَفْعَلَ فَمَا مِنْ شَىْءٍ تُوعَدُونَهُ إِلاَّ قَدْ رَأَيْتُهُ فِى صَلاَتِى هَذِهِ »."
            },
            {
                "hadithNo": "2103",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Asma' said: \"The sun was eclipsed at the time of the Messenger of Allah (s.a.w) and I entered upon 'Aishah and found her praying. I said: 'Why are the people praying? And she gestured towards the sky with her head.' I said: 'Is it a sign?' She said: 'Yes.' The Messenger of Allah (s.a.w) stood for a very long time, until I was about to faint. I took hold of a vessel of water that was by my side and started to pour it over my head or my face. No sooner had the Messenger of Allah (s.a.w) finished praying but the sun became clear. The Messenger of Allah (s.a.w) addressed the people, praising and glorifying Allah, then he said: 'There is nothing that I had not seen before but I saw it during this standing of mine, even Paradise and Hell. It was revealed to me that you will be tested in your graves with something close to - or like - the tribulation of the Dajjal.\"' - \"I (the narrator) do not know which one Asma' said.\" - \"'Someone will come to one of you and will say: \"What do you know about this man?\" The believer, or, the one who has certain faith\"' - I do not know which one Asma' said - \"'will say: \"He is Muhammad, he is the Messenger of Allah; he came to us with clear signs and guidance, and we responded and obeyed, three times.\" Then it will be said to him: \"Sleep, for we knew that you believed in him. Sleep the sleep of the righteous.\" As for the hypocrite or the doubter\"' - I do not know which one Asma' said - \"'he will say: \"I do not know, I heard the people saying something so I said it.'\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِىُّ حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ عَنْ فَاطِمَةَ عَنْ أَسْمَاءَ قَالَتْ خَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَدَخَلْتُ عَلَى عَائِشَةَ وَهِىَ تُصَلِّى فَقُلْتُ مَا شَأْنُ النَّاسِ يُصَلُّونَ فَأَشَارَتْ بِرَأْسِهَا إِلَى السَّمَاءِ فَقُلْتُ آيَةٌ قَالَتْ نَعَمْ. فَأَطَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- الْقِيَامَ جِدًّا حَتَّى تَجَلاَّنِى الْغَشْىُ فَأَخَذْتُ قِرْبَةً مِنْ مَاءٍ إِلَى جَنْبِى فَجَعَلْتُ أَصُبُّ عَلَى رَأْسِى أَوْ عَلَى وَجْهِى مِنَ الْمَاءِ - قَالَتْ - فَانْصَرَفَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَقَدْ تَجَلَّتِ الشَّمْسُ فَخَطَبَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ « أَمَّا بَعْدُ مَا مِنْ شَىْءٍ لَمْ أَكُنْ رَأَيْتُهُ إِلاَّ قَدْ رَأَيْتُهُ فِى مَقَامِى هَذَا حَتَّى الْجَنَّةَ وَالنَّارَ وَإِنَّهُ قَدْ أُوحِىَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِى الْقُبُورِ قَرِيبًا أَوْ مِثْلَ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ - لاَ أَدْرِى أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ - فَيُؤْتَى أَحَدُكُمْ فَيُقَالُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ أَوِ الْمُوقِنُ - لاَ أَدْرِى أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ - فَيَقُولُ هُوَ مُحَمَّدٌ هُوَ رَسُولُ اللَّهِ جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى فَأَجَبْنَا وَأَطَعْنَا. ثَلاَثَ مِرَارٍ فَيُقَالُ لَهُ نَمْ قَدْ كُنَّا نَعْلَمُ إِنَّكَ لَتُؤْمِنُ بِهِ فَنَمْ صَالِحًا وَأَمَّا الْمُنَافِقُ أَوِ الْمُرْتَابُ - لاَ أَدْرِى أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ - فَيَقُولُ لاَ أَدْرِى سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُ »."
            },
            {
                "hadithNo": "2104",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Asma' said: \"I came to 'Aishah and the people were standing, and she was praying. I said: 'What is the matter with the people?...'\" a Hadith similar to that of Ibn Numair from Hisham (no. 2103).",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ فَاطِمَةَ عَنْ أَسْمَاءَ قَالَتْ أَتَيْتُ عَائِشَةَ فَإِذَا النَّاسُ قِيَامٌ وَإِذَا هِىَ تُصَلِّى فَقُلْتُ مَا شَأْنُ النَّاسِ وَاقْتَصَّ الْحَدِيثَ بِنَحْوِ حَدِيثِ ابْنِ نُمَيْرٍ عَنْ هِشَامٍ."
            },
            {
                "hadithNo": "2105",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that 'Urwah said: \"Do not say: 'Kasafat Ash-Shams,' rather say: 'Khasafat Ash-Shams.\"'",
                "hadithArabic": "أَخْبَرَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِىِّ عَنْ عُرْوَةَ قَالَ لاَ تَقُلْ كَسَفَتِ الشَّمْسُ وَلَكِنْ قُلْ خَسَفَتِ الشَّمْسُ."
            },
            {
                "hadithNo": "2106",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Asma' bint Abi Bakr said: \"The Prophet (s.a.w) was perturbed one day\" - meaning, the day on which the sun was eclipsed - \"and he picked up a woman's chemise until he was given his own Rida'. Then he stood and led the people in prayer, standing for a long time, such that if a person came who did not realize that the Prophet (s.a.w) had bowed he would not think that he had bowed, because of this long standing.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِىُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا ابْنُ جُرَيْجٍ حَدَّثَنِى مَنْصُورُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِى بَكْرٍ أَنَّهَا قَالَتْ فَزِعَ النَّبِىُّ -صلى الله عليه وسلم- يَوْمًا - قَالَتْ تَعْنِى يَوْمَ كَسَفَتِ الشَّمْسُ - فَأَخَذَ دِرْعًا حَتَّى أُدْرِكَ بِرِدَائِهِ فَقَامَ لِلنَّاسِ قِيَامًا طَوِيلاً لَوْ أَنَّ إِنْسَانًا أَتَى لَمْ يَشْعُرْ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- رَكَعَ مَا حَدَّثَ أَنَّهُ رَكَعَ مِنْ طُولِ الْقِيَامِ."
            },
            {
                "hadithNo": "2107",
                "chapterNo": "3",
                "hadithEnglish": "Ibn Juraij narrated a similar report (as no. 2106) with this chain, and he said: \"(He stood) for a long time, standing and bowing.\" And he added: \"And I started looking at a woman who was older than me, and at another who was more sick than I.\"",
                "hadithArabic": "وَحَدَّثَنِى سَعِيدُ بْنُ يَحْيَى الأُمَوِىُّ حَدَّثَنِى أَبِى حَدَّثَنَا ابْنُ جُرَيْجٍ بِهَذَا الإِسْنَادِ مِثْلَهُ وَقَالَ قِيَامًا طَوِيلاً يَقُومُ ثُمَّ يَرْكَعُ وَزَادَ فَجَعَلْتُ أَنْظُرُ إِلَى الْمَرْأَةِ أَسَنَّ مِنِّى وَإِلَى الأُخْرَى هِىَ أَسْقَمُ مِنِّى."
            },
            {
                "hadithNo": "2108",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Asma' bint Abi Bakr said: \"The sun was eclipsed at the time of the Messenger of Allah (s.a.w) and he was perturbed, and he put on a woman's chemise by mistake until his own Rida' was brought to him.\" She said: \"I relieved myself, then I came to the Masjid and I saw the Messenger of Allah (s.a.w) standing, so I stood with him, and he stood for so long that I wanted to sit down. Then I looked at a weak woman and I said: 'This one is weaker than I. I will remain standing.' Then he bowed and bowed for a long time, then he raised his head and stood for a long time, such that if a man came, he would think that he had not bowed.\"",
                "hadithArabic": "وَحَدَّثَنِى أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِىُّ حَدَّثَنَا حَبَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا مَنْصُورٌ عَنْ أُمِّهِ عَنْ أَسْمَاءَ بِنْتِ أَبِى بَكْرٍ قَالَتْ كَسَفَتِ الشَّمْسُ عَلَى عَهْدِ النَّبِىِّ -صلى الله عليه وسلم- فَفَزِعَ فَأَخْطَأَ بِدِرْعٍ حَتَّى أُدْرِكَ بِرِدَائِهِ بَعْدَ ذَلِكَ قَالَتْ فَقَضَيْتُ حَاجَتِى ثُمَّ جِئْتُ وَدَخَلْتُ الْمَسْجِدَ فَرَأَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَائِمًا فَقُمْتُ مَعَهُ فَأَطَالَ الْقِيَامَ حَتَّى رَأَيْتُنِى أُرِيدُ أَنْ أَجْلِسَ ثُمَّ أَلْتَفِتُ إِلَى الْمَرْأَةِ الضَّعِيفَةِ فَأَقُولُ هَذِهِ أَضْعَفُ مِنِّى. فَأَقُومُ فَرَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِيَامَ حَتَّى لَوْ أَنَّ رَجُلاً جَاءَ خُيِّلَ إِلَيْهِ أَنَّهُ لَمْ يَرْكَعْ."
            },
            {
                "hadithNo": "2109",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: \"The sun was eclipsed at the time of the Messenger of Allah (s.a.w), and the Messenger of Allah (s.a.w) prayed and the people with him. He stood for a long time, almost as long as it takes to recite Surat Al-Baqarah. Then he bowed for a long time, then he raised his head and stood for a long time that was shorter than the first time. Then he bowed for a long time, that was shorter than the first time, then he prostrated, then he raised his head and stood for a long time, which was shorter than the first time. Then he bowed for a long time which was shorter than the first time. Then he raised his head and stood for a long time, which was shorter than the first time. Then he bowed for a long time which was shorter than the first time. Then he prostrated, then no sooner had he finished, but the sun became clear. He said: 'The sun and the moon are two of the signs of Allah; they do not become eclipsed for the death or birth of anyone. If you see that, then remember Allah.' They said: 'O Messenger of Allah, we saw you reaching out to take something when you were standing, then we saw you refrain.' He said: 'I saw Paradise, and I reached out to take a bunch of grapes from it. If I had taken it, you would have eaten from it for as long as this world remained. And I saw Hell, and I have never seen anything like what I have seen today. I saw that most of its people are women.' They said: 'Why is that, O Messenger of Allah?' He said: 'Because of their ungratefulness.' It was said: 'Are they ungrateful to Allah?' He said: 'They are ungrateful to their husbands, and they are ungrateful for kind treatment. If you treat one of them kindly for a lifetime, then she sees something from you, she says: I have never seen anything good from you!\"'",
                "hadithArabic": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ حَدَّثَنِى زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنِ ابْنِ عَبَّاسٍ قَالَ انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَصَلَّى رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَالنَّاسُ مَعَهُ فَقَامَ قِيَامًا طَوِيلاً قَدْرَ نَحْوِ سُورَةِ الْبَقَرَةِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ قَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ الرُّكُوعِ الأَوَّلِ ثُمَّ سَجَدَ ثُمَّ انْصَرَفَ وَقَدِ انْجَلَتِ الشَّمْسُ فَقَالَ « إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَاذْكُرُوا اللَّهَ ». قَالُوا يَا رَسُولَ اللَّهِ رَأَيْنَاكَ تَنَاوَلْتَ شَيْئًا فِى مَقَامِكَ هَذَا ثُمَّ رَأَيْنَاكَ كَفَفْتَ. فَقَالَ « إِنِّى رَأَيْتُ الْجَنَّةَ فَتَنَاوَلْتُ مِنْهَا عُنْقُودًا وَلَوْ أَخَذْتُهُ لأَكَلْتُمْ مِنْهُ مَا بَقِيَتِ الدُّنْيَا وَرَأَيْتُ النَّارَ فَلَمْ أَرَ كَالْيَوْمِ مَنْظَرًا قَطُّ وَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ ». قَالُوا بِمَ يَا رَسُولَ اللَّهِ قَالَ « بِكُفْرِهِنَّ ». قِيلَ أَيَكْفُرْنَ بِاللَّهِ قَالَ « بِكُفْرِ الْعَشِيرِ وَبِكُفْرِ الإِحْسَانِ لَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ »."
            },
            {
                "hadithNo": "2110",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as no. 2109) was narrated from Zaid bin Aslam with this chain, except that he said: \"Then we saw you moving backwards.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا إِسْحَاقُ - يَعْنِى ابْنَ عِيسَى - أَخْبَرَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ فِى هَذَا الإِسْنَادِ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ ثُمَّ رَأَيْنَاكَ تَكَعْكَعْتَ."
            },
            {
                "hadithNo": "2111",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah (s.a.w) prayed with eight bowings and four prostrations when the sun was eclipsed.\" A similar report was also narrated from 'Ali.",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ عَنْ سُفْيَانَ عَنْ حَبِيبٍ عَنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ قَالَ صَلَّى رَسُولُ اللَّهِ -صلى الله عليه وسلم- حِينَ كَسَفَتِ الشَّمْسُ ثَمَانَ رَكَعَاتٍ فِى أَرْبَعِ سَجَدَاتٍ. وَعَنْ عَلِىٍّ مِثْلُ ذَلِكَ."
            },
            {
                "hadithNo": "2112",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Prophet (s.a.w) prayed during an eclipse. He recited then he bowed, then he recited then he bowed, then he recited then he bowed, then he recited then he bowed, then he prostrated. He said: \"And the second Rak'ah was the same.\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَأَبُو بَكْرِ بْنُ خَلاَّدٍ كِلاَهُمَا عَنْ يَحْيَى الْقَطَّانِ - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى - عَنْ سُفْيَانَ قَالَ حَدَّثَنَا حَبِيبٌ عَنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهُ صَلَّى فِى كُسُوفٍ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ سَجَدَ. قَالَ وَالأُخْرَى مِثْلُهَا."
            },
            {
                "hadithNo": "2113",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Abdullah bin 'Amr bin Al-'As said: \"When the sun was eclipsed at the time of the Messenger of Allah (s.a.w), the call went out: 'As-salatu jami'ah (the prayer is being assembled).' The Messenger of Allah (s.a.w) bowed twice in one Rak'ah, then he stood up and bowed twice in one Rak'ah, then the sun became clear.'' 'Aishah said: \"I never bowed or prostrated for a longer time than that.\"",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو مُعَاوِيَةَ - وَهُوَ شَيْبَانُ النَّحْوِىُّ - عَنْ يَحْيَى عَنْ أَبِى سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِىُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمٍ عَنْ يَحْيَى بْنِ أَبِى كَثِيرٍ قَالَ أَخْبَرَنِى أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ خَبَرِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّهُ قَالَ لَمَّا انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- نُودِىَ بِ الصَّلاَةَ جَامِعَةً } فَرَكَعَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- رَكْعَتَيْنِ فِى سَجْدَةٍ ثُمَّ قَامَ فَرَكَعَ رَكْعَتَيْنِ فِى سَجْدَةٍ ثُمَّ جُلِّىَ عَنِ الشَّمْسِ فَقَالَتْ عَائِشَةُ مَا رَكَعْتُ رُكُوعًا قَطُّ وَلاَ سَجَدْتُ سُجُودًا قَطُّ كَانَ أَطْوَلَ مِنْهُ."
            },
            {
                "hadithNo": "2114",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Abu Mas'ud Al-Ansari said: \"The Messenger of Allah (s.a.w) said: 'The sun and the moon are two of the signs of Allah by means of which Allah creates fear in His slaves. They do not become eclipsed for the death of any person. If you see anything happen to them, then pray and call upon Allah until you are relieved of that.\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ إِسْمَاعِيلَ عَنْ قَيْسِ بْنِ أَبِى حَازِمٍ عَنْ أَبِى مَسْعُودٍ الأَنْصَارِىِّ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ يُخَوِّفُ اللَّهُ بِهِمَا عِبَادَهُ وَإِنَّهُمَا لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنَ النَّاسِ فَإِذَا رَأَيْتُمْ مِنْهَا شَيْئًا فَصَلُّوا وَادْعُوا اللَّهَ حَتَّى يُكْشَفَ مَا بِكُمْ »."
            },
            {
                "hadithNo": "2115",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Mas'ud that the Messenger of Allah (s.a.w) said: \"The sun and the moon do not become eclipsed for the death of any person, rather they are two of the signs of Allah, so if you see that then get up and pray.\"",
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِىُّ وَيَحْيَى بْنُ حَبِيبٍ قَالاَ حَدَّثَنَا مُعْتَمِرٌ عَنْ إِسْمَاعِيلَ عَنْ قَيْسٍ عَنْ أَبِى مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « إِنَّ الشَّمْسَ وَالْقَمَرَ لَيْسَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنَ النَّاسِ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ فَإِذَا رَأَيْتُمُوهُ فَقُومُوا فَصَلُّوا »."
            },
            {
                "hadithNo": "2116",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Isma'il with this chain. In the Hadith of Sufyan and Waki' (it says): \"The sun was eclipsed on the day that Ibrahim died, and the people said: 'It has been eclipsed because of the death of Ibrahim.\"'",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ وَأَبُو أُسَامَةَ وَابْنُ نُمَيْرٍ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ وَوَكِيعٌ ح وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ وَمَرْوَانُ كُلُّهُمْ عَنْ إِسْمَاعِيلَ بِهَذَا الإِسْنَادِ.\r\nوَفِى حَدِيثِ سُفْيَانَ وَوَكِيعٍ انْكَسَفَتِ الشَّمْسُ يَوْمَ مَاتَ إِبْرَاهِيمُ فَقَالَ النَّاسُ انْكَسَفَتْ لِمَوْتِ إِبْرَاهِيمَ."
            },
            {
                "hadithNo": "2117",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Abu Musa said: \"The sun was eclipsed at the time of the Prophet (s.a.w), and he got up in a state of anxiety, thinking that it was the Hour. He came to the Masjid and started to pray, standing, bowing and prostrating for the longest time that I ever saw him do so in any prayer. Then he said: 'These signs that Allah has sent do not occur for the death or birth of anyone, rather Allah sends them to cause fear in His slaves. If you see any of them, then hasten to remember Him, call upon Him and ask Him for forgiveness.\"' According to the report of Ibn Al-'Ala': The sun was eclipsed and he said: \"Causing fear in His slaves.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو عَامِرٍ الأَشْعَرِىُّ عَبْدُ اللَّهِ بْنُ بَرَّادٍ وَمُحَمَّدُ بْنُ الْعَلاَءِ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِى بُرْدَةَ عَنْ أَبِى مُوسَى قَالَ خَسَفَتِ الشَّمْسُ فِى زَمَنِ النَّبِىِّ -صلى الله عليه وسلم- فَقَامَ فَزِعًا يَخْشَى أَنْ تَكُونَ السَّاعَةُ حَتَّى أَتَى الْمَسْجِدَ فَقَامَ يُصَلِّى بِأَطْوَلِ قِيَامٍ وَرُكُوعٍ وَسُجُودٍ مَا رَأَيْتُهُ يَفْعَلُهُ فِى صَلاَةٍ قَطُّ ثُمَّ قَالَ « إِنَّ هَذِهِ الآيَاتِ الَّتِى يُرْسِلُ اللَّهُ لاَ تَكُونُ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ وَلَكِنَّ اللَّهَ يُرْسِلُهَا يُخَوِّفُ بِهَا عِبَادَهُ فَإِذَا رَأَيْتُمْ مِنْهَا شَيْئًا فَافْزَعُوا إِلَى ذِكْرِهِ وَدُعَائِهِ وَاسْتِغْفَارِهِ ». وَفِى رِوَايَةِ ابْنِ الْعَلاَءِ كَسَفَتِ الشَّمْسُ وَقَالَ « يُخَوِّفُ عِبَادَهُ »."
            },
            {
                "hadithNo": "2118",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Abdur-Rahman bin Samurah said: \"While I was shooting my arrows during the time of the Messenger of Allah (s.a.w), the sun was eclipsed. I threw them aside and said: 'I will go and see what has happened to the Messenger of Allah (s.a.w) during this eclipse of the sun today.' I came to him and found him raising his hands - supplicating, saying the Takbir, praising Allah and proclaiming that there is none worthy of worship but Him - until the sun became clear, and he recited two Surah and bowed twice.\"",
                "hadithArabic": "وَحَدَّثَنِى عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِىُّ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا الْجُرَيْرِىُّ عَنْ أَبِى الْعَلاَءِ حَيَّانَ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ بَيْنَمَا أَنَا أَرْمِى بِأَسْهُمِى فِى حَيَاةِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- إِذِ انْكَسَفَتِ الشَّمْسُ فَنَبَذْتُهُنَّ وَقُلْتُ لأَنْظُرَنَّ إِلَى مَا يَحْدُثُ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- فِى انْكِسَافِ الشَّمْسِ الْيَوْمَ فَانْتَهَيْتُ إِلَيْهِ وَهُوَ رَافِعٌ يَدَيْهِ يَدْعُو وَيُكَبِّرُ وَيَحْمَدُ وَيُهَلِّلُ حَتَّى جُلِّىَ عَنِ الشَّمْسِ فَقَرَأَ سُورَتَيْنِ وَرَكَعَ رَكْعَتَيْنِ."
            },
            {
                "hadithNo": "2119",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Abdur-Rahman bin Samurah, who was one of the Companions of the Messenger of Allah (s.a.w), said: \"I was shooting my arrows in Al-Madinah at the time of the Messenger of Allah (s.a.w) when the sun was eclipsed. I came to him and he was standing in prayer, raising his hands - glorifying Allah, praising Him, proclaiming that there is none worthy of worship but Him, proclaiming His greatness, and calling upon Him - until the eclipse ended. When it ended, he recited two Surah and prayed two Rak'ah.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى عَنِ الْجُرَيْرِىِّ عَنْ حَيَّانَ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ - وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- - قَالَ كُنْتُ أَرْتَمِى بِأَسْهُمٍ لِى بِالْمَدِينَةِ فِى حَيَاةِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- إِذْ كَسَفَتِ الشَّمْسُ فَنَبَذْتُهَا فَقُلْتُ وَاللَّهِ لأَنْظُرَنَّ إِلَى مَا حَدَثَ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- فِى كُسُوفِ الشَّمْسِ قَالَ فَأَتَيْتُهُ وَهُوَ قَائِمٌ فِى الصَّلاَةِ رَافِعٌ يَدَيْهِ فَجَعَلَ يُسَبِّحُ وَيَحْمَدُ وَيُهَلِّلُ وَيُكَبِّرُ وَيَدْعُو حَتَّى حُسِرَ عَنْهَا. قَالَ فَلَمَّا حُسِرَ عَنْهَا قَرَأَ سُورَتَيْنِ وَصَلَّى رَكْعَتَيْنِ."
            },
            {
                "hadithNo": "2120",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Abdur-Rahman bin Samurah said: \"While I was shooting my arrows at the time of the Messenger of Allah (s.a.w), the sun was eclipsed...\" then he mentioned a similar Hadith (as no. 2119).",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سَالِمُ بْنُ نُوحٍ أَخْبَرَنَا الْجُرَيْرِىُّ عَنْ حَيَّانَ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ بَيْنَمَا أَنَا أَتَرَمَّى بِأَسْهُمٍ لِى عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- إِذْ خَسَفَتِ الشَّمْسُ. ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمَا."
            },
            {
                "hadithNo": "2121",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from 'Abdullah bin 'Umar that he used to narrate that the Messenger of Allah (s.a.w) said: \"The sun and the moon do not become eclipsed for the death or birth of anyone, rather they are among the signs of Allah, so when you see them then pray.\"",
                "hadithArabic": "وَحَدَّثَنِى هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى عَمْرُو بْنُ الْحَارِثِ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ حَدَّثَهُ عَنْ أَبِيهِ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِى بَكْرٍ الصِّدِّيقِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ كَانَ يُخْبِرُ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- أَنَّهُ قَالَ « إِنَّ الشَّمْسَ وَالْقَمَرَ لاَ يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ وَلَكِنَّهُمَا آيَةٌ مِنْ آيَاتِ اللَّهِ فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا »."
            },
            {
                "hadithNo": "2122",
                "chapterNo": "4",
                "hadithEnglish": "Al-Mughirah bin Shu'bah said: \"The sun was eclipsed at the time of the Messenger of Allah (s.a.w) on the day that Ibrahim died. The Messenger of Allah (s.a.w) said: 'The sun and the moon are two of the signs of Allah and do not become eclipsed for the death or birth of anyone. If you see them then call upon Allah and pray until it is over.\"'",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالاَ حَدَّثَنَا مُصْعَبٌ - وَهُوَ ابْنُ الْمِقْدَامِ - حَدَّثَنَا زَائِدَةُ حَدَّثَنَا زِيَادُ بْنُ عِلاَقَةَ - وَفِى رِوَايَةِ أَبِى بَكْرٍ قَالَ قَالَ زِيَادُ بْنُ عِلاَقَةَ - سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ يَقُولُ انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- يَوْمَ مَاتَ إِبْرَاهِيمُ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لاَ يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلاَ لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَادْعُوا اللَّهَ وَصَلُّوا حَتَّى يَنْكَشِفَ »."
            }
        ]
    }
]