[
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "1",
    "sectionHeading": "Freeing a Share Held in a Slave",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Abdullah ibn Umar that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace,said, \"If a man frees his share of a slave and has\\n\\t\\t\\t\\tenough money to cover the full price of the slave justly\\n\\t\\t\\t\\tevaluated for him, he must buy out his partners so that\\n\\t\\t\\t\\tthe slave is completely freed. If he doesn't have the\\n\\t\\t\\t\\tmoney, he partially frees him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed-on way of doing things\\n\\t\\t\\t\\tamong us in the case of slave whose master makes a\\n\\t\\t\\t\\tbequest to free part of him - a third, a fourth, a half,\\n\\t\\t\\t\\tor any share after his death, is that only the portion of\\n\\t\\t\\t\\thim is freed that his master has named. This is because\\n\\t\\t\\t\\tthe freeing of that portion is only obliged to take place\\n\\t\\t\\t\\tafter the death of the master because the master has the\\n\\t\\t\\t\\toption to withdraw the bequest as long as he lives. When\\n\\t\\t\\t\\tthe slave is freed from his master, the master is a\\n\\t\\t\\t\\ttestator and the testator only has access to free what he\\n\\t\\t\\t\\tcan take from his property, being the third of the\\n\\t\\t\\t\\tproperty he is allowed to bequeath, and the rest of the\\n\\t\\t\\t\\tslave is not free because the man's property has gone out\\n\\t\\t\\t\\tof his hands. How can the rest of the slave which belongs\\n\\t\\t\\t\\tto other people be free when they did not initiate the\\n\\t\\t\\t\\tsetting free and did not confirm it and they do not have\\n\\t\\t\\t\\tthe wala' established for them? Only the deceased could\\n\\t\\t\\t\\tdo that. He was the one who freed him and the one for\\n\\t\\t\\t\\twhom the wala' was confirmed. That is not to be borne by\\n\\t\\t\\t\\tanother's property unless he bequeaths within the third\\n\\t\\t\\t\\tof his property what remains of a lave to be freed. That\\n\\t\\t\\t\\tis a request against his partners and inheritors and the\\n\\t\\t\\t\\tpartners must not refuse the slave that when it is within\\n\\t\\t\\t\\tthe third of the dead man's property because there is no\\n\\t\\t\\t\\tharm in that to the inheritors.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a man frees a third of his slave while he\\n\\t\\t\\t\\tis critically ill, he must complete the emancipation so\\n\\t\\t\\t\\tall of him is free from him, if it is within the third of\\n\\t\\t\\t\\this property that he has access to, because he is not\\n\\t\\t\\t\\ttreated in the same way as a man who frees a third of a\\n\\t\\t\\t\\tslave after his death, because had the one who freed a\\n\\t\\t\\t\\tthird of his slave after his death lived, he could have\\n\\t\\t\\t\\tcancelled it and the slave's being set free would be of\\n\\t\\t\\t\\tno effect. The master who made the freeing of the third\\n\\t\\t\\t\\tof the slave irrevocable in his illness, would still have\\n\\t\\t\\t\\tto free all of him if he lived. If he died, the slave\\n\\t\\t\\t\\twould be set free within the third of the bequest. That\\n\\t\\t\\t\\tis because the command of the deceased is permissible in\\n\\t\\t\\t\\this third as the command of the healthy is permissible in\\n\\t\\t\\t\\tall his property.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "2",
    "sectionHeading": "Making Conditions when Freeing a Slave",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"A master who frees a slave of his and\\n\\t\\t\\t\\tsettles his emancipation so that his testimony is\\n\\t\\t\\t\\tpermitted, his inviolability complete, and his right to\\n\\t\\t\\t\\tinherit confirmed, cannot impose stipulations on him like\\n\\t\\t\\t\\twhat he imposes on a slave about property or service, nor\\n\\t\\t\\t\\tget him to do anything of slavery, because the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"If a man frees his share of a slave and has enough money\\n\\t\\t\\t\\tto cover the full price of the slave justly evaluated for\\n\\t\\t\\t\\thim, he must give his partners their shares so the slave\\n\\t\\t\\t\\tis completely free.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik commented, \"If he owns the slave completely, it is\\n\\t\\t\\t\\tmore proper to free him completely and not mingle any\\n\\t\\t\\t\\tslavery with it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "3",
    "sectionHeading": "People who Free Slaves and Own No Other Property",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said and somebody else\\n\\t\\t\\t\\tfrom al-Hasan ibn Abi al-Hasan al-Basri and from Muhammad\\n\\t\\t\\t\\tibn Sirin that a man in the time of the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, freed six\\n\\t\\t\\t\\tof his slaves while he was dying. The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, drew lots\\n\\t\\t\\t\\tbetween them and freed a third of those slaves.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added that he had heard that the man did not have\\n\\t\\t\\t\\tany property other than them.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "4",
    "sectionHeading": "People who Free Slaves and Own No Other Property",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Rabia ibn Abi Abd ar-Rahman that\\n\\t\\t\\t\\ta man in the time of Aban ibn Uthman's amirate freed all\\n\\t\\t\\t\\tof his slaves and did not have other property than them.\\n\\t\\t\\t\\tAban ibn Uthman took charge of the slaves and they were\\n\\t\\t\\t\\tdivided into three groups. Then he drew lots on the basis\\n\\t\\t\\t\\tthat which ever group drew the dead man's arrow would be\\n\\t\\t\\t\\tfree. The arrow fell to one of the thirds, and that third\\n\\t\\t\\t\\twas freed.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "5",
    "sectionHeading": "Judgement on the Property of Slaves when Set Free",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard Ibn Shihab say, \"The\\n\\t\\t\\t\\tprecedent of the sunna is that when a slave is freed, his\\n\\t\\t\\t\\tproperty follows him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"One thing which makes clear that the\\n\\t\\t\\t\\tproperty of a slave follows him when he is freed is that\\n\\t\\t\\t\\twhen the contract (mukatab) is written for his freedom,\\n\\t\\t\\t\\this property follows him even if he did not stipulate it.\\n\\t\\t\\t\\tThat is because the bond of kitaba is the bond of wala'\\n\\t\\t\\t\\twhen it is complete. The property of a slave and a\\n\\t\\t\\t\\tmukatab is not treated in the same way as any children\\n\\t\\t\\t\\tthey may have. Their children are only treated in the\\n\\t\\t\\t\\tsame way as their own slaves, not in the same way as\\n\\t\\t\\t\\ttheir property. This is because the sunna, in which there\\n\\t\\t\\t\\tis no dispute, is that when a slave is freed, his\\n\\t\\t\\t\\tproperty follows him and his children do not follow him,\\n\\t\\t\\t\\tand when a mukatab writes the contract for his freedom,\\n\\t\\t\\t\\this property follows him and his children do not follow\\n\\t\\t\\t\\thim.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"One thing which makes that clear is that\\n\\t\\t\\t\\twhen a slave or a mukatab are bankrupt, their property is\\n\\t\\t\\t\\ttaken but the mothers of their children and their\\n\\t\\t\\t\\tchildren are not taken because they are not their\\n\\t\\t\\t\\tproperty.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Another thing which makes it clear is that\\n\\t\\t\\t\\twhen a slave is sold and the person who buys him\\n\\t\\t\\t\\tstipulates the inclusions of his property, his children\\n\\t\\t\\t\\tare not included in his property.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Another thing which makes it clear is that\\n\\t\\t\\t\\twhen a slave does injure some one, he and his property\\n\\t\\t\\t\\tare taken, and his children are not taken.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "6",
    "sectionHeading": "Freeing Slaves who are Umm Walad and a General Chapter on Freeing",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Abdullah ibn Umar that\\n\\t\\t\\t\\tUmar ibn al-Khattab said, \"If a slave-girl gives birth to\\n\\t\\t\\t\\ta child by her master, he must not sell her, give her\\n\\t\\t\\t\\taway, or bequeath her. He enjoys her and when he dies she\\n\\t\\t\\t\\tis free .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "7",
    "sectionHeading": "Freeing Slaves who are Umm Walad and a General Chapter on Freeing",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that a slave-girl\\n\\t\\t\\t\\tcame to Umar ibn al-Khattab (who had been beaten by her\\n\\t\\t\\t\\tmaster with a red hot iron) and he set her free.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed-on way of doing things\\n\\t\\t\\t\\tamong us is that a man is not permitted to be freed while\\n\\t\\t\\t\\the has a debt against him which exceeds his property. A\\n\\t\\t\\t\\tboy is not allowed to be set free until he has reached\\n\\t\\t\\t\\tpuberty. The young person whose affairs are managed\\n\\t\\t\\t\\tcannot set free in his property, even when he reaches\\n\\t\\t\\t\\tpuberty, until he manages his property.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "8",
    "sectionHeading": "Slaves Permitted to be Freed when a Slave must be Freed by Obligation",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Hilal ibn Usama from Ata ibn\\n\\t\\t\\t\\tYasar that Umar ibn al-Hakam said, \"I went to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and said, 'Messenger of Allah, a slave girl of\\n\\t\\t\\t\\tmine was tending my sheep. I came to her and one of the\\n\\t\\t\\t\\tsheep was lost. I asked her about it and she said that a\\n\\t\\t\\t\\twolf had eaten it, so I became angry and I am one of the\\n\\t\\t\\t\\tchildren of Adam, so I struck her on the face. As it\\n\\t\\t\\t\\thappens, I have to set a slave free, shall I free her?'\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, questioned her, 'Where is Allah?' She said, 'In\\n\\t\\t\\t\\theaven.' He said, 'Who am I?' She said, 'You are the\\n\\t\\t\\t\\tMessenger of Allah.' The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'Free her.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "9",
    "sectionHeading": "Slaves Permitted to be Freed when a Slave must be Freed by Obligation",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Ubaydullah ibn\\n\\t\\t\\t\\tAbdullah ibn Utba ibn Masud that one of the Ansar came to\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, with a black slave-girl of his. He said,\\n\\t\\t\\t\\t\"Messenger of Allah, I must set a slave free who is a\\n\\t\\t\\t\\tmumina. If you think that she is mumina, I will free\\n\\t\\t\\t\\ther.\" The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, questioned her, \"Do you testify that\\n\\t\\t\\t\\tthere is no god but Allah?\" She said, \"Yes.\" \"Do you\\n\\t\\t\\t\\ttestify that Muhammad is the Messenger of Allah?\" She\\n\\t\\t\\t\\tsaid, \"Yes.\" \"Are you certain about the rising after\\n\\t\\t\\t\\tdeath?\" She said, \"Yes.\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Free her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "10",
    "sectionHeading": "Slaves Permitted to be Freed when a Slave must be Freed by Obligation",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that al-Maqburi\\n\\t\\t\\t\\tsaid that Abu Hurayra was asked whether a man who had to\\n\\t\\t\\t\\tfree a slave, could free an illegitimate child to fulfil\\n\\t\\t\\t\\tthat obligation. Abu Hurayra said, \"Yes. That will give\\n\\t\\t\\t\\tsatisfaction for him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "11",
    "sectionHeading": "Slaves Permitted to be Freed when a Slave must be Freed by Obligation",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Fadala ibn\\n\\t\\t\\t\\tUbayd al-Ansari who was one of the companions of the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, was asked whether it was permissible for a man who\\n\\t\\t\\t\\thad to free a slave to free an illegitimate child. He\\n\\t\\t\\t\\tsaid, \"Yes, That will give satisfaction for him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "12",
    "sectionHeading": "Slaves Not Permitted to be Freed when a Slave must be Freed by Obligation",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Abdullah ibn\\n\\t\\t\\t\\tUmar was asked whether a slave could be bought on the\\n\\t\\t\\t\\tspecific condition that it was to be used to fulfil the\\n\\t\\t\\t\\tobligation of freeing a slave, and he said, \"No.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the best of what I have heard on the\\n\\t\\t\\t\\tobligation of freeing slaves. Someone who has to set a\\n\\t\\t\\t\\tslave free because of an obligation on him, may not buy\\n\\t\\t\\t\\tone on the condition that he sets it free because if he\\n\\t\\t\\t\\tdoes that, whatever he buys is not completely a slave\\n\\t\\t\\t\\tbecause he has reduced its price by the condition he has\\n\\t\\t\\t\\tmade of setting it free.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"There is no harm, however, in someone\\n\\t\\t\\t\\tbuying a person expressly to set him free.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The best of what I have heard on the\\n\\t\\t\\t\\tobligation of freeing slaves is that it is not permitted\\n\\t\\t\\t\\tto free a christian or a jew to fulfil it, and one does\\n\\t\\t\\t\\tnot free a mukatab or a mudabbar or an umm walad or a\\n\\t\\t\\t\\tslave to be freed after a certain number of years, or a\\n\\t\\t\\t\\tblind person. There is no harm in freeing a christian,\\n\\t\\t\\t\\tjew, or magian voluntarily, because Allah, the Blessed,\\n\\t\\t\\t\\tthe Exalted, said in His Book, 'either as a favour then\\n\\t\\t\\t\\tor by ransom,' (Sura 47 ayat 4) The favour is setting\\n\\t\\t\\t\\tfree.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for obligations of freeing slaves which\\n\\t\\t\\t\\tAllah has mentioned in the Book, one only frees a mumin\\n\\t\\t\\t\\tslave for them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is like that in feeding poor people for\\n\\t\\t\\t\\tkaffara. One must only feed muslims and one does not feed\\n\\t\\t\\t\\tanyone outside of the deen of Islam.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "13",
    "sectionHeading": "Freeing the Living for the Dead",
    "text": "<p>\\n\\t\\t\\t\\t13 Malik related to me from Abd ar-Rahman ibn Abi Amra\\n\\t\\t\\t\\tal-Ansari that his mother had wanted to make a bequest,\\n\\t\\t\\t\\tbut she delayed until morning and died. She had intended\\n\\t\\t\\t\\tto set someone free, so Abd ar-Rahman said, 'I said to\\n\\t\\t\\t\\tal-Qasim ibn Muhammad, 'Will it help her if I free a\\n\\t\\t\\t\\tslave for her?' Al-Qasim replied, 'Sad ibn Ubada said to\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, 'My mother died, will it help her if I set a slave\\n\\t\\t\\t\\tfree for her?' The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said \"Yes.\" \"'\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "14",
    "sectionHeading": "Freeing the Living for the Dead",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Yahya ibn Said said, ''Abd\\n\\t\\t\\t\\tar-Rahman ibn Abi Bakr died in his sleep, and A'isha, the\\n\\t\\t\\t\\twife of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, set free many slaves for him.\" Malik said, \"This\\n\\t\\t\\t\\tis what I like best of what I have heard on the subject.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "15",
    "sectionHeading": "The Excellence of Freeing Slaves, Freeing Adulteresses and Illegitimate Children",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Hisham ibn Urwa from his father\\n\\t\\t\\t\\tfrom A'isha, the wife of the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, was asked what was\\n\\t\\t\\t\\tthe most excellent kind of slave to free. The Messenger\\n\\t\\t\\t\\tof Allah, May Allah bless him and grant him peace,\\n\\t\\t\\t\\tanswered, \"The most expensive and the most valuable to\\n\\t\\t\\t\\this master.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "16",
    "sectionHeading": "The Excellence of Freeing Slaves, Freeing Adulteresses and Illegitimate Children",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that Abdullah ibn Umar\\n\\t\\t\\t\\tfreed an illegitimate child and its mother.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "17",
    "sectionHeading": "The Right of the One who Sets Free to the Wala'",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Hisham ibn Urwa from his father\\n\\t\\t\\t\\tthat A'isha, the wife of the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Barira came to me and said,\\n\\t\\t\\t\\t'I have written myself as mukatab for my people for nine\\n\\t\\t\\t\\tuqiyas, one uqiya per year, so help me.' A'isha said, 'If\\n\\t\\t\\t\\tyour people agree that I pay it all to them for you, and\\n\\t\\t\\t\\tthat if I pay it, your wala' is mine, then I will do it.'\\n\\t\\t\\t\\tBarira went to her masters and told them that and they\\n\\t\\t\\t\\tdidn't agree. She came back from her masters while the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, was sitting. She said to A'isha, 'I offered that\\n\\t\\t\\t\\tto them and they refused me unless they had the wala'.'\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, heard that and asked her about it A'isha told him\\n\\t\\t\\t\\tand the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, said, 'Take her and stipulate that the wala'\\n\\t\\t\\t\\tis yours, for the wala' is for the one who sets free.' So\\n\\t\\t\\t\\tA'isha did that and then the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, stood up in front of\\n\\t\\t\\t\\tthe people, and praised Allah and gave thanks to Him.\\n\\t\\t\\t\\tThen he said, 'What is wrong with the people who make\\n\\t\\t\\t\\tconditions which are not in the Book of Allah? Any\\n\\t\\t\\t\\tcondition which is not in the Book of Allah is invalid\\n\\t\\t\\t\\teven if it is a hundred conditions. The decree of Allah\\n\\t\\t\\t\\tis truer and the conditions of Allah are firmer, and the\\n\\t\\t\\t\\twala' only belongs to the one who sets free.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "18",
    "sectionHeading": "The Right of the One who Sets Free to the Wala'",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Abdullah ibn Umar that\\n\\t\\t\\t\\tA'isha umm al-muminin wanted to buy a slave-girl and set\\n\\t\\t\\t\\ther free. Her people said, \"We will sell her to you\\n\\t\\t\\t\\tprovided that her wala' is ours.\" She mentioned that to\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and he said, \"Don't let that hinder you, for the\\n\\t\\t\\t\\twala' only belongs to the one who sets free.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "19",
    "sectionHeading": "The Right of the One who Sets Free to the Wala'",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said from Amra bint\\n\\t\\t\\t\\tAbd ar-Rahman that Barira came asking the help of A'isha,\\n\\t\\t\\t\\tumm al-muminin. A'isha said, \"If your masters agree that\\n\\t\\t\\t\\tI pay them your price in one lump sum and set you free I\\n\\t\\t\\t\\twill do it.\" Barira mentioned that to her masters and\\n\\t\\t\\t\\tthey said, \"No, not unless your wala' is ours.\" Yahya ibn\\n\\t\\t\\t\\tSaid added that Amra bint Abd ar-Rahman claimed that\\n\\t\\t\\t\\tA'isha mentioned that to the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, and the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace said, \"Buy\\n\\t\\t\\t\\ther and set her free. The wala' only belongs to the one\\n\\t\\t\\t\\twho sets free.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "20",
    "sectionHeading": "The Right of the One who Sets Free to the Wala'",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Dinar from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade selling or giving away the\\n\\t\\t\\t\\twala'.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that it was not permissible for a slave to buy\\n\\t\\t\\t\\thimself from his master on the provision that he could\\n\\t\\t\\t\\tgive the wala' to whomever he wished as the wala' was for\\n\\t\\t\\t\\tthe one who set him free, and that had a man given\\n\\t\\t\\t\\tpermission to his mawla to give the wala' to whomever he\\n\\t\\t\\t\\twished, that would not have been permitted, because the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, had said, \"The wala' is for the one who sets free.\\n\\t\\t\\t\\t\" The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, forbade selling or giving away the wala'. For\\n\\t\\t\\t\\tif it was permitted to the master to stipulate that for\\n\\t\\t\\t\\thim and to give him permission to give the wala' to\\n\\t\\t\\t\\twhomever he liked, that would be a gift.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "21",
    "sectionHeading": "Slaves Attracting the Wala' When Set Free",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Rabia ibn Abd ar-Rahman that\\n\\t\\t\\t\\taz-Zubayr ibn al-Awwam bought a slave and set him free.\\n\\t\\t\\t\\tThe slave had children by a free woman. When az-Zubayr\\n\\t\\t\\t\\tfreed him, he said, \"They are my mawali.\" The man argued,\\n\\t\\t\\t\\t\"They are the mawali of their mother. Rather, they are\\n\\t\\t\\t\\tour mawali.\" They took the dispute to Uthman ibn Affan,\\n\\t\\t\\t\\tand Uthman gave a judgement that az-Zubayr had their\\n\\t\\t\\t\\twala'.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Said ibn\\n\\t\\t\\t\\tal-Musayyab was asked who had the wala' of the children\\n\\t\\t\\t\\twhom a slave had by a free woman. Said said, \"If their\\n\\t\\t\\t\\tfather dies and he is a slave who was not set free, their\\n\\t\\t\\t\\twala' belongs to the mawali of their mother.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is like the child of a woman who is a\\n\\t\\t\\t\\tmawla who has been divorced by lian; the child is\\n\\t\\t\\t\\tattached to the mawali of his mother and they are his\\n\\t\\t\\t\\tmawali. If he dies, they inherit from him. If he commits\\n\\t\\t\\t\\ta crime, they pay the blood-money for him. If his father\\n\\t\\t\\t\\tacknowledges him, he is given a kinship to him and his\\n\\t\\t\\t\\twala' goes to the mawali of his father. They are his\\n\\t\\t\\t\\theirs, they pay his blood-money and his father is\\n\\t\\t\\t\\tpunished with the hadd-punishment.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is like that with a free-born woman\\n\\t\\t\\t\\tdivorced by lian. If her husband who curses her by lian\\n\\t\\t\\t\\tdoes not acknowledge her child, the child is dealt with\\n\\t\\t\\t\\tin the same way except that the rest of his inheritance\\n\\t\\t\\t\\tafter the inheritance of his mother and his brothers from\\n\\t\\t\\t\\this mother goes to all the muslims as long as he was not\\n\\t\\t\\t\\tgiven kinship to his father. The child of the lian is\\n\\t\\t\\t\\tattached to the patronage of the mawali of his mother\\n\\t\\t\\t\\tuntil his father acknowledges him because he does not\\n\\t\\t\\t\\thave a lineage or paternal relations. If his lineage is\\n\\t\\t\\t\\tconfirmed, it goes to his paternal relations.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed-on way of doing things\\n\\t\\t\\t\\tamong us about a child of a slave by a free woman, while\\n\\t\\t\\t\\tthe father of the slave is free, is that the grandfather\\n\\t\\t\\t\\t(the father of the slave), attracts the wala' of his\\n\\t\\t\\t\\tson's free children by a free woman. They leave their\\n\\t\\t\\t\\tinheritance to him as long as their father is a slave. If\\n\\t\\t\\t\\tthe father becomes free, the wala' returns to his mawali.\\n\\t\\t\\t\\tIf he dies and he is still a slave, the inheritance and\\n\\t\\t\\t\\tthe wala' go to the grandfather. If the slave has two\\n\\t\\t\\t\\tfree sons, and one of them dies while the father is still\\n\\t\\t\\t\\ta slave, the grandfather, the father of the father,\\n\\t\\t\\t\\tattracts the wala' and the inheritance.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a slave-girl who was set free while she\\n\\t\\t\\t\\twas pregnant and her husband was a slave and then her\\n\\t\\t\\t\\thusband became free before she gave birth, or after she\\n\\t\\t\\t\\tgave birth. He said, \"The wala' of what is in her womb\\n\\t\\t\\t\\tgoes to the person who set the mother free because\\n\\t\\t\\t\\tslavery touched the child before the mother was set free.\\n\\t\\t\\t\\tIt is not treated in the same way as a child conceived by\\n\\t\\t\\t\\tits mother after she has been set free because the wala'\\n\\t\\t\\t\\tof such a child, is attracted by the father when he is\\n\\t\\t\\t\\tset free.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a slave asked his master's permission\\n\\t\\t\\t\\tto free a slave of his and his master gave permission,\\n\\t\\t\\t\\tthe wala' of the freed slave went to the master of his\\n\\t\\t\\t\\tmaster, and his wala' did not return to the master who\\n\\t\\t\\t\\thad set him free, even if he were to become free\\n\\t\\t\\t\\thimself.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "22",
    "sectionHeading": "The Inheritance of the Wala'",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Abi Bakr ibn\\n\\t\\t\\t\\tMuhammad ibn Amr ibn Hazm from Abd al-Malik ibn Abi Bakr\\n\\t\\t\\t\\tibn Abd ar-Rahman ibn al-Harith ibn Hisham that his\\n\\t\\t\\t\\tfather told him that al-Asi ibn Hisham had died and left\\n\\t\\t\\t\\tthree sons, two by one wife and one by another wife. One\\n\\t\\t\\t\\tof the two with the same mother died and left property\\n\\t\\t\\t\\tand mawali. His full brother inherited his property and\\n\\t\\t\\t\\tthe wala' of his mawali. Then he also died, and left as\\n\\t\\t\\t\\theirs his son and his paternal half brother. His son\\n\\t\\t\\t\\tsaid, \"I obtain what my father inherited of property and\\n\\t\\t\\t\\tthe wala' of the mawali.\" His brother said, \"It is not\\n\\t\\t\\t\\tlike that. You obtain the property. As for the wala' of\\n\\t\\t\\t\\tthe mawali, it is not so. Do you think that had it been\\n\\t\\t\\t\\tmy first brother who died today, I would not have\\n\\t\\t\\t\\tinherited from him?\" They argued and went to Uthman ibn\\n\\t\\t\\t\\tAffan. He gave a judgement that the brother had the wala'\\n\\t\\t\\t\\tof the mawali.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "23",
    "sectionHeading": "The Inheritance of the Wala'",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Abi Bakr ibn Hazm\\n\\t\\t\\t\\tthat his father told him that he was sitting with Aban\\n\\t\\t\\t\\tibn Uthman, and an argument was brought to him between\\n\\t\\t\\t\\tsome people from the Juhayna tribe and some people from\\n\\t\\t\\t\\tthe Banu al-Harith ibn al-Khazraj. A woman of the Juhayna\\n\\t\\t\\t\\ttribe was married to a man from the Banu al-Harith ibn\\n\\t\\t\\t\\tal-Khazraj, called Ibrahim ibn Kulayb. She died and left\\n\\t\\t\\t\\tproperty and mawali, and her son and husband inherited\\n\\t\\t\\t\\tthem from her. Then her son died and his heirs said, \"We\\n\\t\\t\\t\\thave the wala' of the mawali. Her son obtained them.\"\\n\\t\\t\\t\\tThose of the Juhayna said, \"It is not like that. They are\\n\\t\\t\\t\\tthe mawali of our female associate. When her child died,\\n\\t\\t\\t\\twe have their wala' and we inherit them.\" Aban ibn Uthman\\n\\t\\t\\t\\tgave a judgement that the people from the Juhayna tribe\\n\\t\\t\\t\\tdid indeed have the wala' of the mawali.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "24",
    "sectionHeading": "The Inheritance of the Wala'",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Said ibn\\n\\t\\t\\t\\tal-Musayyab spoke about a man who died and left three\\n\\t\\t\\t\\tsons and left mawali whom he had freed. Then two of his\\n\\t\\t\\t\\tsons died and left children. He said, \"The third\\n\\t\\t\\t\\tremaining son inherits the mawali. When he dies, his\\n\\t\\t\\t\\tchildren and the children of his brothers share equally\\n\\t\\t\\t\\tin the wala' of the mawali.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "38",
    "hadithNumber": "25",
    "sectionHeading": "The Inheritance of Slaves Set Free and the Wala' of Jews and Christians Who Set Slaves Free",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had asked Ibn Shihab about a\\n\\t\\t\\t\\tslave who was released. He said, \"He gives his wala' to\\n\\t\\t\\t\\twhomever he likes. If he dies and has not given his wala'\\n\\t\\t\\t\\tto anyone, his inheritance goes to the muslims and his\\n\\t\\t\\t\\tblood-money is paid by them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The best of what has been heard about a\\n\\t\\t\\t\\tslave who is released is that no one gets his wala', and\\n\\t\\t\\t\\this inheritance goes to the muslims, and they pay his\\n\\t\\t\\t\\tblood-money.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that when the slave of a jew or christian\\n\\t\\t\\t\\tbecame muslim and he was freed before being sold, the\\n\\t\\t\\t\\twala' of the freed slave went to the muslims. If the jew\\n\\t\\t\\t\\tor christian became muslim afterwards, the wala' did not\\n\\t\\t\\t\\trevert to him. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"However, if a jew or christian frees a slave\\n\\t\\t\\t\\tfrom their own deen, and then the freed one becomes\\n\\t\\t\\t\\tmuslim before the jew or christian who freed him becomes\\n\\t\\t\\t\\tmuslim and then the one who freed him has become muslim,\\n\\t\\t\\t\\this wala' reverts to him because the wala' was confirmed\\n\\t\\t\\t\\tfor him on the day he freed him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that the muslim child of a jew or christian\\n\\t\\t\\t\\tinherited the mawali of his jewish or christian father\\n\\t\\t\\t\\twhen the freed mawla became muslim before the one who\\n\\t\\t\\t\\tfreed him became muslim. If the freed one was already\\n\\t\\t\\t\\tmuslim when he was freed, the muslim children of the\\n\\t\\t\\t\\tchristian or jew had nothing of the wala' of a muslim\\n\\t\\t\\t\\tslave because the jew and the christian did not have the\\n\\t\\t\\t\\twala'. The wala' of a muslim slave went to the community\\n\\t\\t\\t\\tof muslims.\\n\\t\\t\\t</p>"
  }
]
