[
  {
    "SurahNumber": "49",
    "AyahNumber": "1",
    "NoteID": "4919",
    "Body": "Several shades of meaning are implied: (1) do not make\\n\\t\\t\\t\\tyourselves conspicuous in word or deed when in the\\n\\t\\t\\t\\tpresence of Allah (e.g. in a Mosque, or at Prayers or\\n\\t\\t\\t\\treligious assemblies): (2) do not anticipate in word or\\n\\t\\t\\t\\tdeed what your Leader (Allah's Messenger) may say or do;\\n\\t\\t\\t\\t(3) do not be impatient, trying to hasten things before\\n\\t\\t\\t\\tthe time is ripe, of which the best Judge is Allah, Who\\n\\t\\t\\t\\tspeaks through His Messenger. Be reverent in all things,\\n\\t\\t\\t\\tas in the presence of Allah: for He hears and sees all\\n\\t\\t\\t\\tthings. (4) Look to the Qur-an and the Sunnah of the\\n\\t\\t\\t\\tProphet (peace be on him) for guidance and let nothing\\n\\t\\t\\t\\telse take precedence of them."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "2",
    "NoteID": "4920",
    "Body": "It is bad manners to talk loudly before your Leader. Some\\n\\t\\t\\t\\till-mannered people so raise their voices as to drown the\\n\\t\\t\\t\\tvoice of their Leader, in conversation or in Council."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "2",
    "NoteID": "4921",
    "Body": "Such rudeness may even destroy the value of such services\\n\\t\\t\\t\\tas they may otherwise have been able to render, and all\\n\\t\\t\\t\\tthis without their even realising the harm they were\\n\\t\\t\\t\\tdoing to the Cause."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "3",
    "NoteID": "4922",
    "Body": "The essence of good manners arises from the heart. The\\n\\t\\t\\t\\tman who really and sincerely respects his Leader has true\\n\\t\\t\\t\\tpiety in his heart, just as the man who does the opposite\\n\\t\\t\\t\\tmay undo the work of years by weakening the Leader's\\n\\t\\t\\t\\tauthority."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "4",
    "NoteID": "4923",
    "Body": "To shout aloud to your Leader from outside his Apartments\\n\\t\\t\\t\\tshows disrespect both for his person, his time, and his\\n\\t\\t\\t\\tengagements. Only ignorant fools would be guilty of such\\n\\t\\t\\t\\tunseemly behaviour. It is more seemly for them to wait\\n\\t\\t\\t\\tand bide their time until he is free to come out and\\n\\t\\t\\t\\tattend to them. But, with the Messenger of Allah, much is\\n\\t\\t\\t\\tforgiven that is due to lack of knowledge and\\n\\t\\t\\t\\tunderstanding. In an earthly Court, ignorance of the Law\\n\\t\\t\\t\\texcuseth no man. If a man behaved in that way to the\\n\\t\\t\\t\\tGeneral of an army or the Governor of a Province, not to\\n\\t\\t\\t\\tspeak of an earthly King, he would be laid hands on by\\n\\t\\t\\t\\tthe Guard, and could never gain the access he desires."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "6",
    "NoteID": "4924",
    "Body": "All tittle-tattle or reports-especially if emanating from\\n\\t\\t\\t\\tpersons you do not know-are to be tested, and the truth\\n\\t\\t\\t\\tascertained. If they were believed and passed on, much\\n\\t\\t\\t\\tharm may be done, of which you may have cause afterwards\\n\\t\\t\\t\\tto repent heartily. Scandal or slander of all kinds is\\n\\t\\t\\t\\there condemned."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "7",
    "NoteID": "4925",
    "Body": "The messenger of Allah, if he consults his friends and\\n\\t\\t\\t\\tassociates, should not be expected to follow their advice\\n\\t\\t\\t\\tin all matters. The judgment and responsibility are his:\\n\\t\\t\\t\\the sees farther than the rest, and he is not swayed by\\n\\t\\t\\t\\tpersonal feeling as others may be."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "7",
    "NoteID": "4926",
    "Body": "Fortunate indeed was the generation among whom the\\n\\t\\t\\t\\tProphet of Allah walked in his daily life. His example\\n\\t\\t\\t\\twas inspiring. Their inner Faith was dear to them; it was\\n\\t\\t\\t\\ta thing to be proud of in their innermost hearts; and\\n\\t\\t\\t\\tthey loved discipline, obedience, and righteousness. No\\n\\t\\t\\t\\twonder all their other disadvantages were neutralised,\\n\\t\\t\\t\\tand they went from strength to strength. Nothing but the\\n\\t\\t\\t\\tGrace of Allah could have brought about such a result."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "9",
    "NoteID": "4927",
    "Body": "Individual quarrels are easier to compose than group\\n\\t\\t\\t\\tquarrels, or, in the modern world, national quarrels. But\\n\\t\\t\\t\\tthe collective community of Islam should be supreme over\\n\\t\\t\\t\\tgroups or nations. It would be expected to act justly and\\n\\t\\t\\t\\ttry to compose the quarrel, for peace is better than\\n\\t\\t\\t\\tfighting. But if one party is determined to be the\\n\\t\\t\\t\\taggressor, the whole force of the community is brought to\\n\\t\\t\\t\\tbear on it. The essential condition of course is that\\n\\t\\t\\t\\tthere should be perfect fairness and justice and respect\\n\\t\\t\\t\\tfor the highest principles; for Islam takes account of\\n\\t\\t\\t\\tevery just and legitimate interest without separating\\n\\t\\t\\t\\tspiritual from temporal matters. The League of Nations\\n\\t\\t\\t\\tfailed because these essentials were absent and today the\\n\\t\\t\\t\\tUnited Nations fails for the same reason."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "10",
    "NoteID": "4928",
    "Body": "The enforcement of the Muslim Brotherhood is the greatest\\n\\t\\t\\t\\tsocial ideal of Islam. On it was based the Prophet's\\n\\t\\t\\t\\tSermon at his last pilgrimage, and Islam cannot be\\n\\t\\t\\t\\tcompletely realised until this ideal is achieved."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "11",
    "NoteID": "4929",
    "Body": "Mutual ridicule ceases to be fun when there is arrogance\\n\\t\\t\\t\\tor selfishness or malice behind it. We may laugh with\\n\\t\\t\\t\\tpeople, to share in the happiness of life: we must never\\n\\t\\t\\t\\tlaugh at people in contempt or ridicule. In many things\\n\\t\\t\\t\\tthey may be better than ourselves!"
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "11",
    "NoteID": "4930",
    "Body": "Defamation may consist in speaking ill of others by the\\n\\t\\t\\t\\tspoken or written word, or in acting in such a way as to\\n\\t\\t\\t\\tsuggest a charge against some person whom we are not in a\\n\\t\\t\\t\\tposition to judge. A cutting, biting remark or taunt of\\n\\t\\t\\t\\tsarcasm is included in the word lamaza. An offensive\\n\\t\\t\\t\\tnickname may amount to defamation, but in any case there\\n\\t\\t\\t\\tis no point in using offensive nicknames, or names that\\n\\t\\t\\t\\tsuggest some real or fancied defect. They ill accord with\\n\\t\\t\\t\\tthe serious purpose which Muslims should have in life.\\n\\t\\t\\t\\tFor example, even if a man is lame, it is wrong to\\n\\t\\t\\t\\taddress him as \"O lame one!\" It causes him pain, and it\\n\\t\\t\\t\\tis bad manners. So in the case of the rude remark, \"the\\n\\t\\t\\t\\tblack man\"."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "12",
    "NoteID": "4931",
    "Body": "Most kinds of suspicion are baseless and to be avoided,\\n\\t\\t\\t\\tand some are crimes in themselves: for they do cruel\\n\\t\\t\\t\\tinjustice to innocent men and women. Spying, or enquiring\\n\\t\\t\\t\\ttoo curiously into other people's affairs, means either\\n\\t\\t\\t\\tidle curiosity, and is therefore futile, or suspicion\\n\\t\\t\\t\\tcarried a stage further, which almost amounts to sin.\\n\\t\\t\\t\\tBack-biting also is a brood of the same genus. It may be\\n\\t\\t\\t\\teither futile but all the same mischievous, or it may be\\n\\t\\t\\t\\tpoisoned with malice, in which case it is a sin added to\\n\\t\\t\\t\\tsin."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "12",
    "NoteID": "4932",
    "Body": "No one would like even to think of such an abomination as\\n\\t\\t\\t\\teating the flesh of his brother. But when the brother is\\n\\t\\t\\t\\tdead, and the flesh is carrion, abomination is added to\\n\\t\\t\\t\\tabomination. In the same way we are asked to refrain from\\n\\t\\t\\t\\thurting people's feelings when they are present; how much\\n\\t\\t\\t\\tworse is it when we say things, true or false, when they\\n\\t\\t\\t\\tare absent!"
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "13",
    "NoteID": "4933",
    "Body": "This is addressed to all mankind and not only to the\\n\\t\\t\\t\\tMuslim brotherhood, though it is understood that in a\\n\\t\\t\\t\\tperfected world the two would be synonymous. As it is,\\n\\t\\t\\t\\tmankind is descended from one pair of parents. Their\\n\\t\\t\\t\\ttribes, races, and nations are convenient labels by which\\n\\t\\t\\t\\twe may know certain differing characteristics. Before\\n\\t\\t\\t\\tAllah they are all one, and he gets most honour who is\\n\\t\\t\\t\\tmost righteous."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "14",
    "NoteID": "4934",
    "Body": "The desert Arabs were somewhat shaky in their faith.\\n\\t\\t\\t\\tTheir hearts and minds were petty, and they thought of\\n\\t\\t\\t\\tpetty things, while Islam requires the complete\\n\\t\\t\\t\\tsubmission of one's being to Allah. See next verse. Some\\n\\t\\t\\t\\tof the failings of the desert Arabs are described in\\n\\t\\t\\t\\txlviii. 11-15. But the reference here is said to be to\\n\\t\\t\\t\\tthe Banu Asad, who came to profess Islam in order to get\\n\\t\\t\\t\\tcharity during a famine."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "14",
    "NoteID": "4935",
    "Body": "'This is what ye ought to prove if your faith has any\\n\\t\\t\\t\\tmeaning, but ye only say it with your tongues.'"
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "16",
    "NoteID": "4936",
    "Body": "'You say (or perhaps even think) that you are Muslims,\\n\\t\\t\\t\\tbut where are the fruits of your Faith? Allah knows the\\n\\t\\t\\t\\tinnermost motives and secrets of your heart, and you\\n\\t\\t\\t\\tcannot deceive Him by attaching a certain label to\\n\\t\\t\\t\\tyourselves'. Alas! that this answer to the desert Arabs\\n\\t\\t\\t\\tis true of so many others in our own times!"
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "17",
    "NoteID": "4937",
    "Body": "Islam in itself is a precious privilege. By accepting it\\n\\t\\t\\t\\twe confer no favour on its preacher or on any community.\\n\\t\\t\\t\\tIf the acceptance is from the heart, it is a great favour\\n\\t\\t\\t\\tdone to those who accept, that the Light of Allah has\\n\\t\\t\\t\\tentered their hearts and they have received guidance."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "18",
    "NoteID": "4938",
    "Body": "This does not mean that we should seek petty motives in\\n\\t\\t\\t\\tnewcomers into the House of Islam, That would indeed be\\n\\t\\t\\t\\thabouring suspicions or allowing curiosity to spy out\\n\\t\\t\\t\\tmotives, which would be a crime under xlix. 12. We should\\n\\t\\t\\t\\tbe true, sincere, and devoted ourselves, and leave the\\n\\t\\t\\t\\tcase of others to Allah, from Whose eyes nothing is\\n\\t\\t\\t\\thidden."
  }
]
