[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/031001",
        "Body":  "Alif.Lam.Mim."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/031010",
        "Body":  "He hath created the heavens without supports that ye can see, and\n\t\t\thath cast into the earth firm hills, so that it quake not with\n\t\t\tyou; and He hath dispersed therein all kinds of beasts. And We\n\t\t\tsend down water from the sky and We cause (plants) of every\n\t\t\tgoodly kind to grow therein."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/031011",
        "Body":  "This is the Creation of Allah. Now show me that which those (ye\n\t\t\tworship) beside Him have created. Nay, but the wrongdoers are in\n\t\t\terror manifest!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/031012",
        "Body":  "And verily We gave Luqman wisdom, saying: Give thanks unto Allah;\n\t\t\tand whosoever giveth thanks, he giveth thanks for (the good of)\n\t\t\this soul. And whosoever refuseth--Lo! Allah is Absolute, Owner of\n\t\t\tPraise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/031013",
        "Body":  "And (remember) when Luqman said unto his son, when he was\n\t\t\texhorting him: O my dear son! Ascribe no partners unto Allah. Lo!\n\t\t\tto ascribe partners (unto Him) is a tremendous wrong--"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/031014",
        "Body":  "And We have enjoined upon man concerning his parents. His mother\n\t\t\tbeareth him in weakness upon weakness, and his weaning is in two\n\t\t\tyears. Give thanks unto Me and unto thy parents. Unto Me is the\n\t\t\tjourneying."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/031015",
        "Body":  "But if they strive with thee to make thee ascribe unto Me as\n\t\t\tpartner that of which thou hast no knowledge, then obey them not.\n\t\t\tConsort with them in the world kindly, and follow the path of him\n\t\t\twho repenteth unto Me. Then unto Me will be your return, and I\n\t\t\tshall tell you what ye used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/031016",
        "Body":  "O my dear son! Lo! though it be but the weight of a grain of\n\t\t\tmustard seed, and though it be in a rock, or in the heavens, or\n\t\t\tin the earth, Allah will bring it forth.   Allah is Subtile,\n\t\t\tAware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/031017",
        "Body":  "O my dear son! Establish worship and enjoin kindness and forbid\n\t\t\tiniquity, and persevere whatever may befall thee. Lo! that is of\n\t\t\tthe steadfast heart of things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/031018",
        "Body":  "Turn not thy cheek in scorn toward folk, nor walk with pertness\n\t\t\tthe land. Lo! Allah loveth not each braggart boaster."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/031019",
        "Body":  "Be modest in thy bearing and subdue thy voice. Lo! in harshest of\n\t\t\tall voices is the voice of the ass."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/031002",
        "Body":  "These are revelations of the wise Scripture,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/031020",
        "Body":  "See ye not how Allah hath made serviceable unto you whatsoever is\n\t\t\tin the skies and whatsoever is in the earth and hath loaded you\n\t\t\twith His favors both without and within? Yet of mankind is he who\n\t\t\tdisputeth concerning Allah, without knowledge or guidance or a\n\t\t\tScripture giving light."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/031021",
        "Body":  "And if it be said unto them: Follow that which Allah hath\n\t\t\trevealed, they say: Nay, but we follow that wherein we found our\n\t\t\tfathers. What! Even though the devil were inviting them unto the\n\t\t\tdoom of flame?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/031022",
        "Body":  "Whosoever surrendereth his purpose to Allah while doing good, he\n\t\t\tverily hath grasped the firm hand-hold. Unto Allah belongeth the\n\t\t\tsequel of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/031023",
        "Body":  "And whosoever disbelieveth, let not his disbelief afflict thee (O\n\t\t\tMuhammad). Unto Us is their return, and We shall tell them what\n\t\t\tthey did. Lo! Allah is Aware of what is in the breasts (of men)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/031024",
        "Body":  "We give them comfort for a little, and then We drive them to a\n\t\t\theavy doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/031025",
        "Body":  "If thou shouldst ask them: Who created the heavens and the earth?\n\t\t\tthey would answer: Allah. Say: Praise be to Allah! But most of\n\t\t\tthem know not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/031026",
        "Body":  "Unto Allah belongeth whatsoever is in the heavens and the earth.\n\t\t\tAllah, He is the Absolute, the Owner of Praise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/031027",
        "Body":  "And if all the trees in the earth were pens, and the sea, with\n\t\t\tseven more seas to help it, (were ink), the words of Allah could\n\t\t\tnot be exhausted. Allah is Mighty, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/031028",
        "Body":  "Your creation and your raising (from the dead) are only as (the\n\t\t\tcreation and the raising of) a single soul. Lo! Allah is Hearer,\n\t\t\tKnower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/031029",
        "Body":  "Hast thou not seen how Allah causeth the night to pass into the\n\t\t\tday and causeth the day to pass into the night, and hath subdued\n\t\t\tthe sun and the moon (to do their work), each running unto an\n\t\t\tappointed term; and that Allah is Informed of what ye do?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/031003",
        "Body":  "A guidance and a mercy for the good,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/031030",
        "Body":  "That (is so) because Allah, He is the True, and that which they\n\t\t\tinvoke beside Him is the False, and because Allah, He is the\n\t\t\tSublime, the Great."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/031031",
        "Body":  "Hast thou not seen how the ships glide on the sea by Allah\u0027s\n\t\t\tgrace, that He may show you of His wonders? Lo! therein indeed\n\t\t\tare portents for every steadfast, grateful (heart)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/031032",
        "Body":  "And if a wave enshroudeth them like awnings, they cry unto Allah,\n\t\t\tmaking their faith pure for Him only. But when He bringeth them\n\t\t\tsafe to land, some of them compromise. None denieth Our signs\n\t\t\tsave every traitor ingrate."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/031033",
        "Body":  "O mankind! Keep your duty to your Lord and fear a Day when the\n\t\t\tparent will not be able to avail the child in aught, nor the\n\t\t\tchild to avail the parent. Lo! Allah\u0027s promise is the very truth.\n\t\t\tLet not the life of the world beguile you, nor let the deceiver\n\t\t\tbeguile you, in regard to Allah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/031034",
        "Body":  "Lo! Allah! With Him is knowledge of the Hour. He sendeth down the\n\t\t\train, and knoweth that which is in the wombs. No soul knoweth\n\t\t\twhat it will earn tomorrow, and no soul knoweth in what land it\n\t\t\twill die. Lo! Allah is Knower, Aware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/031004",
        "Body":  "Those who establish worship and pay the poor due and have sure\n\t\t\tfaith in the Hereafter."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/031005",
        "Body":  "Such have guidance from their Lord. Such are the successful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/031006",
        "Body":  "And of mankind is he who payeth for mere pastime of discourse,\n\t\t\tthat he may mislead from Allah\u0027s way without knowledge, and\n\t\t\tmaketh it the butt of mockery. For such there is a shameful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/031007",
        "Body":  "And when Our revelations are recited unto him he turneth away in\n\t\t\this pride as if he heard them not, as if there were a deafness in\n\t\t\this ears. So give him tidings of a painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/031008",
        "Body":  "Lo! those who believe and do good works, for them are gardens of\n\t\t\tdelight,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "31",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/031009",
        "Body":  "Wherein they will abide. It is a promise of Allah in truth. He is\n\t\t\tthe Mighty, the Wise."
    }
]
