[
  {
    "SurahNumber": "61",
    "AyahNumber": "1",
    "Text": "All that is in the heavens and the earth glorifies Allah. He is\\n\\t\\t\\tthe All-Mighty, the All-Wise."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "2",
    "Text": "O believers! Why do you say something which you don't do?"
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "3",
    "Text": "It is very hateful in the sight of Allah that you say something\\n\\t\\t\\twhich you don't do."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "4",
    "Text": "Indeed Allah loves those who fight for His Cause in battle array\\n\\t\\t\\tas if they were a solid wall."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "5",
    "Text": "Remember what Musa (Moses) said to his people: \"O my people! Why\\n\\t\\t\\tdo you vex me while you know that I am the Rasool of Allah\\n\\t\\t\\ttowards you?\" But inspite of this when they adopted perverseness,\\n\\t\\t\\tAllah let their hearts be perverted. Allah does not guide those\\n\\t\\t\\twho are transgressors."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "6",
    "Text": "And remember when Isa (Jesus) the son of Maryam said: \"O children\\n\\t\\t\\tof Israel! I am the Rasool of Allah towards you, confirming the\\n\\t\\t\\tTorah which came before me, and to give you good news of a Rasool\\n\\t\\t\\tthat will come after me whose name shall be Ahmed (another name\\n\\t\\t\\tof Muhammad, meaning 'The praised one').\" But when he (Muhammad)\\n\\t\\t\\tcame to them with clear signs, they said \"This is plain magic.\""
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "7",
    "Text": "Who could be more wrong than the one who invents falsehoods\\n\\t\\t\\tagainst Allah while he is being called towards Islam? Allah does\\n\\t\\t\\tnot guide those who are wrongdoers."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "8",
    "Text": "They seek to extinguish the Light of Allah with their mouths, but\\n\\t\\t\\tAllah will perfect His Light, much as the unbelievers may dislike\\n\\t\\t\\tit."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "9",
    "Text": "It is He Who has sent His Rasool with the guidance and the\\n\\t\\t\\treligion of truth so that he may proclaim it over all religions,\\n\\t\\t\\tmuch as the Mushrikin may dislike it."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "10",
    "Text": "O believers! Should I tell you of a bargain that will save you\\n\\t\\t\\tfrom a painful punishment?"
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "11",
    "Text": "It is to believe in Allah and His Rasool and strive your utmost\\n\\t\\t\\tin the cause of Allah with your wealth and your persons. That is\\n\\t\\t\\tbest for you, if you but knew it."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "12",
    "Text": "He will forgive you your sins and admit you to gardens beneath\\n\\t\\t\\twhich rivers flow, and will lodge you in beautiful mansions in\\n\\t\\t\\tthe gardens of Eden, which will be a supreme achievement."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "13",
    "Text": "And yet another blessing which you love: help from Allah and a\\n\\t\\t\\tspeedy victory. So O Prophet, give this good news to the\\n\\t\\t\\tbelievers."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "14",
    "Text": "O believers! Be the helpers of Allah, just as Isa (Jesus) the son\\n\\t\\t\\tof Maryam said to his disciples: \"Who will be my helper in the\\n\\t\\t\\tcause of Allah?\" And the disciples responded: \"We will be your\\n\\t\\t\\thelpers in the cause of Allah.\" Then a group from the children of\\n\\t\\t\\tIsrael believed in him (Isa) and another group disbelieved. We\\n\\t\\t\\taided the believers against their enemies, so they became\\n\\t\\t\\tvictorious."
  }
]
