[
  {
    "BookCode": "AMH",
    "VolumeNumber": "55",
    "hadithNumber": "1",
    "sectionHeading": "About the Oath of Allegiance",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Dinar that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"When we took an oath of allegiance with\\n\\t\\t\\t\\thim to hear and obey, the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said to us, 'In what you\\n\\t\\t\\t\\tare able.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "55",
    "hadithNumber": "2",
    "sectionHeading": "About the Oath of Allegiance",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Muhammad ibn al-Munkadir that\\n\\t\\t\\t\\tUmayma bint Ruqayqa said, \"I went to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, with the\\n\\t\\t\\t\\twomen who took an oath of allegiance with him in Islam.\\n\\t\\t\\t\\tThey said, 'Messenger of Allah! We take a pledge with you\\n\\t\\t\\t\\tnot to associate anything with Allah, not to steal, not\\n\\t\\t\\t\\tto commit adultery, not to kill our children, nor to\\n\\t\\t\\t\\tproduce any lie that we have devised between our hands\\n\\t\\t\\t\\tand feet, and not to disobey you in what is known.' The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'In what you can do and are able.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tUmayma continued, \"They said, 'Allah and His Messenger\\n\\t\\t\\t\\tare more merciful to us than ourselves. Come, let us give\\n\\t\\t\\t\\tour hands to you, Messenger of Allah!' The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, 'I\\n\\t\\t\\t\\tdo not shake hands with women. My word to a hundred women\\n\\t\\t\\t\\tis like my word to one woman.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "55",
    "hadithNumber": "3",
    "sectionHeading": "About the Oath of Allegiance",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Dinar that Abdullah\\n\\t\\t\\t\\tibn Umar wrote to Abd al-Malik ibn Marwan, making an oath\\n\\t\\t\\t\\tof allegiance. He wrote, \"In the name of Allah, the\\n\\t\\t\\t\\tMerciful, the Compassionate. To the slave of Allah, Abd\\n\\t\\t\\t\\tal-Malik, the amir al-muminin, Peace be upon you. I\\n\\t\\t\\t\\tpraise Allah to you. There is no god but Him. I\\n\\t\\t\\t\\tacknowledge your right to my hearing and my obedience\\n\\t\\t\\t\\taccording to the sunna of Allah and the sunna of His\\n\\t\\t\\t\\tProphet, in what I am able.\"\\n\\t\\t\\t</p>"
  }
]
