[
  {
    "SurahNumber": "52",
    "AyahNumber": "1",
    "NoteID": "5037",
    "Body": "The adjuration is by five things which we shall presently\\n\\t\\t\\t\\texplain. An appeal is made to these five Signs in verses\\n\\t\\t\\t\\t1 to 6, and the certainty of future events is asserted in\\n\\t\\t\\t\\tthe most emphatic terms in verses 7 to 28, in three\\n\\t\\t\\t\\tparts, viz., the coming of judgment and the passing away\\n\\t\\t\\t\\tof this phenomenal world (verses 7-10); the future ill\\n\\t\\t\\t\\tconsequences of ill-deeds done (verses 11-16); and future\\n\\t\\t\\t\\tattainment of bliss and complete realisation of Allah's\\n\\t\\t\\t\\tlove and mercy (verses 17-28)."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "2",
    "NoteID": "5038",
    "Body": "See last note. The five Signs to which appeal is made\\n\\t\\t\\t\\tare: (1) the Mount (of Revelation), verse 1; (2) the Book\\n\\t\\t\\t\\tInscribed, verses 2-3; (3) The Much-frequented House,\\n\\t\\t\\t\\tverse 4; (4) the Canopy Raised High, verse 5; and (5) the\\n\\t\\t\\t\\tOcean filled with Swell, verse 6. Let us examine these in\\n\\t\\t\\t\\tdetail. Each of them has a figurative meaning. (1) The\\n\\t\\t\\t\\tMount is the sublime world of Revelation. In the case of\\n\\t\\t\\t\\tMoses it is typified by Mount Sinai: Cf. xcv. 2, where it\\n\\t\\t\\t\\tis mentioned in juxtaposition to the sacred territory of\\n\\t\\t\\t\\tMakkah, xcv. 3. In the case of Jesus it is the Mount of\\n\\t\\t\\t\\tOlives: Cf. xcv. 1, and also Matt. xxiv. 3-51, where\\n\\t\\t\\t\\tJesus made his striking pronouncement about the Judgment\\n\\t\\t\\t\\tto come. In the case of Muhammad it is the Mountain of\\n\\t\\t\\t\\tLight, where he first received the revelation: Cf. n. 11\\n\\t\\t\\t\\t(2). The Book Inscribed is Allah's Eternal word. When it\\n\\t\\t\\t\\tbecomes Revelation to man, it is figured forth as\\n\\t\\t\\t\\tsomething \"inscribed\", reduced to writing; and as it is\\n\\t\\t\\t\\tmade clear to the intelligence of man, it is further\\n\\t\\t\\t\\tdescribed as \"in a parchment unfolded\", that is, spread\\n\\t\\t\\t\\tout so that everyone who has the will can seek its\\n\\t\\t\\t\\tguidance."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "4",
    "NoteID": "5039",
    "Body": "See the last two notes. (3) \"The much-frequented House is\\n\\t\\t\\t\\tusually understood to mean the Ka'ba, which the holy\\n\\t\\t\\t\\tProphet purified and re-dedicated to true worship."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "5",
    "NoteID": "5040",
    "Body": "(4) \"The Canopy Raised High\" is the canopy of heaven, to\\n\\t\\t\\t\\twhose height or sublimity no limit can be assigned by the\\n\\t\\t\\t\\tmind of man."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "6",
    "NoteID": "5041",
    "Body": "(5) The Ocean-the vast, limitless, all encircling Ocean.\\n\\t\\t\\t\\tIt is expressed to be masjur, full of a mighty swell,\\n\\t\\t\\t\\tboiling over, poured forth all over the earth, as if\\n\\t\\t\\t\\toverwhelming all landmarks; Cf. lxxxi. 6: a fitting\\n\\t\\t\\t\\tdescription of the final disappearance of our temporal\\n\\t\\t\\t\\tworld in the supreme establishment of the judgment."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "6",
    "NoteID": "5042",
    "Body": "This completes the five Signs by which man may know for\\n\\t\\t\\t\\tcertain of the Judgment to come. Note that they are in a\\n\\t\\t\\t\\tdescending order: the highest, or most remote from man's\\n\\t\\t\\t\\tconsciousness, being mentioned first, and that nearest to\\n\\t\\t\\t\\tman's consciousness being mentioned last. The truth of\\n\\t\\t\\t\\tRevelation; its embodiment in a Prophet's Message given\\n\\t\\t\\t\\tin human language; the universal appeal of divine\\n\\t\\t\\t\\tworship; the starry world above; and the encircling\\n\\t\\t\\t\\tOcean, full of life and motion below,-all are evidences\\n\\t\\t\\t\\tthat the Day of Allah will finally come, and nothing can\\n\\t\\t\\t\\tavert it."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "9",
    "NoteID": "5043",
    "Body": "The Day of Judgment is typified by two figures. (1) \"The\\n\\t\\t\\t\\tfirmament will be in dreadful commotion.\" The heavens as\\n\\t\\t\\t\\twe see them suggest to us peace and tranquillity, and the\\n\\t\\t\\t\\tpower of fixed laws which all the heavenly bodies obey.\\n\\t\\t\\t\\tThis will all be shaken in the rise of the new world. Cf.\\n\\t\\t\\t\\tMatt. xxiv. 29: \"Immediately after the tribulation of\\n\\t\\t\\t\\tthose days...the powers of the heavens shall be shaken.\"\\n\\t\\t\\t\\tFor (2) see next note."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "10",
    "NoteID": "5044",
    "Body": "(2) The mountains are a type of firmness and stability.\\n\\t\\t\\t\\tBut things that we think of as firm and stable in this\\n\\t\\t\\t\\tmaterial life will be shaken to pieces, and will be no\\n\\t\\t\\t\\tmore substantial than a mirage in a desert. Cf. lxxviii.\\n\\t\\t\\t\\t20."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "11",
    "NoteID": "5045",
    "Body": "That Day will be a Day of Woe to the wrong doers\\n\\t\\t\\t\\tdescribed in two aspects, the rebels against Allah and\\n\\t\\t\\t\\tAllah's Truth, just as it will be a Day of Joy and\\n\\t\\t\\t\\tThanksgiving to the Righteous, who are described in three\\n\\t\\t\\t\\taspects in verses 17 to 28. The rebels are here described\\n\\t\\t\\t\\tas being those who openly defied Truth and plunged into\\n\\t\\t\\t\\twrong-doing, or who trifled with truth, who jested with\\n\\t\\t\\t\\tserious matters, who had not the courage to plunge openly\\n\\t\\t\\t\\tinto wrong-doing but who secretly took profit out of it,\\n\\t\\t\\t\\twho wasted their life in doubts and petty quibbles. It is\\n\\t\\t\\t\\tdifficult to say which attitude did more harm to\\n\\t\\t\\t\\tthemselves and to others. Both are aspects of deep-seated\\n\\t\\t\\t\\trebellion. But the mercy of Allah was open to all if they\\n\\t\\t\\t\\thad repented and amended their lives."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "14",
    "NoteID": "5046",
    "Body": "In face of the Realities, it will be borne in on them how\\n\\t\\t\\t\\twrong it was for them in this life to deny or forget that\\n\\t\\t\\t\\tevery wicked thought or deed had its own retributive\\n\\t\\t\\t\\tchain of consequences."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "15",
    "NoteID": "5047",
    "Body": "Perhaps they had said that the Hereafter was a fake, mere\\n\\t\\t\\t\\told wives' tales! If they had given serious thought to\\n\\t\\t\\t\\tthe Signs of Allah, they would have been saved from that\\n\\t\\t\\t\\tserious spiritual blindness: then they will see that the\\n\\t\\t\\t\\tfault was their own, and that the warnings of the\\n\\t\\t\\t\\tmessengers of Truth were nothing but pure Truth."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "16",
    "NoteID": "5048",
    "Body": "At that stage they will have no justification for anger\\n\\t\\t\\t\\tor impatience; for their whole position will have been\\n\\t\\t\\t\\tdue to their own conduct and their rejection of Allah's\\n\\t\\t\\t\\tGrace. Nor will there be time then for patience or\\n\\t\\t\\t\\trepentance, for their period of probation will then have\\n\\t\\t\\t\\tbeen over."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "17",
    "NoteID": "5049",
    "Body": "The Righteous will be in Bliss far beyond their merits:\\n\\t\\t\\t\\ttheir sins and faults will be forgiven by the grace of\\n\\t\\t\\t\\tAllah, which will save them from the penalties which they\\n\\t\\t\\t\\tmay have incurred from human frailty. It will be their\\n\\t\\t\\t\\town effort or striving which will win them Allah's grace:\\n\\t\\t\\t\\tsee verse 19 below. But the fruits will be greater than\\n\\t\\t\\t\\tthey could strictly have carned."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "19",
    "NoteID": "5050",
    "Body": "The bliss of the Righteous is described in three aspects:\\n\\t\\t\\t\\t(1) their individual bliss, verses 17-20: (2) their\\n\\t\\t\\t\\tsocial bliss, verses 21-24; and (3) their satisfaction in\\n\\t\\t\\t\\tthe dissipation of past shadows, and their full\\n\\t\\t\\t\\tunderstanding of the goodness of Allah, verses 25-28."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "19",
    "NoteID": "5051",
    "Body": "Individual satisfaction is expressed in three types or\\n\\t\\t\\t\\tfigures of speech. (1) eating and drinking (2) couches of\\n\\t\\t\\t\\tdignity, and (3) the joy of individual companionship. But\\n\\t\\t\\t\\tthe eating and drinking will be free of all drawbacks,\\n\\t\\t\\t\\tsuch as excess, aftereffects and satiety: here there will\\n\\t\\t\\t\\tbe pure health, profit, and enjoyment. So about the other\\n\\t\\t\\t\\ttwo: see the notes following. Cf. with this the\\n\\t\\t\\t\\tdescription of heaven in xxxvii 40-49: while the general\\n\\t\\t\\t\\taccount is the same, special phases are brought out in\\n\\t\\t\\t\\tthe two passages to correspond with the context."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "20",
    "NoteID": "5052",
    "Body": "Every one will have a couch of dignity, but it does not\\n\\t\\t\\t\\tfollow that the dignity will be the same. Every one's\\n\\t\\t\\t\\tPersonality will be purified but it will not be merged\\n\\t\\t\\t\\tinto one general sameness."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "20",
    "NoteID": "5053",
    "Body": "Cf. xliv. 54, and notes 4728 and 4729, where the meaning\\n\\t\\t\\t\\tof Hur is fully explained. This is the special sharing of\\n\\t\\t\\t\\tindividual Bliss one with another. The next verse refers\\n\\t\\t\\t\\tto the general social satisfaction shared with all whom\\n\\t\\t\\t\\twe loved in this earthly life."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "21",
    "NoteID": "5054",
    "Body": "Zurriyat: literally, progeny, offspring, family; applied\\n\\t\\t\\t\\tby extension to mean all near and dear ones. Love is\\n\\t\\t\\t\\tunselfish, and works not merely, or chiefly, for Self,\\n\\t\\t\\t\\tbut for others; provided the others have Faith and\\n\\t\\t\\t\\trespond according to their capacities or degrees, they\\n\\t\\t\\t\\twill be joined together. Even though on individual merits\\n\\t\\t\\t\\ttheir rank might be less."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "21",
    "NoteID": "5055",
    "Body": "As already explained in the last note, though the love\\n\\t\\t\\t\\tpoured out by Prophets, ancestors, descendants, friends,\\n\\t\\t\\t\\tor good men and women, will secure for their loved ones\\n\\t\\t\\t\\tthe enjoyment of their society, it is an indispensable\\n\\t\\t\\t\\tcondition that the loved ones should also, according to\\n\\t\\t\\t\\ttheir lights, have shown their faith and their goodness\\n\\t\\t\\t\\tin deeds. Each individual is responsible for his conduct.\\n\\t\\t\\t\\tIn the kingdom of heaven there is no boasting of\\n\\t\\t\\t\\tancestors or friends. But it is part of the satisfaction\\n\\t\\t\\t\\tof the good ones who poured out their love that those who\\n\\t\\t\\t\\twere in any way worthy to receive their love should also\\n\\t\\t\\t\\tbe admitted to their society, and this satisfaction shall\\n\\t\\t\\t\\tin no way be diminished to them."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "22",
    "NoteID": "5056",
    "Body": "That is, their eternal Punishment in the Hereafter, as\r\\n\\t\\t\\t\\twell as any punishment that may come to them in this\r\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "23",
    "NoteID": "5057",
    "Body": "Drinking or loving cups, in our life on this earth, are\\n\\t\\t\\t\\tapt to be misused in two ways: (1) they may be occasions\\n\\t\\t\\t\\tfor mere frivolity or the wasting of time; (2) they may\\n\\t\\t\\t\\tlead to evil thoughts, evil suggestions, evil talk, or\\n\\t\\t\\t\\tevil deeds."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "24",
    "NoteID": "5058",
    "Body": "Maknun: well-guarded, kept close, concealed from\\n\\t\\t\\t\\texposure: the beautiful nacreous lustre of Pearls is\\n\\t\\t\\t\\tdisfigured by exposure to gases, vapours, or acids; when\\n\\t\\t\\t\\tnot actually in use they are best kept in closed caskets,\\n\\t\\t\\t\\tguarded from deteriorating agencies."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "25",
    "NoteID": "5059",
    "Body": "The third-and the highest-stage of Bliss, after\\n\\t\\t\\t\\tindividual Bliss and social Bliss, is the satisfaction of\\n\\t\\t\\t\\tlooking to the Past without its shadows and realising to\\n\\t\\t\\t\\tthe full in the Present the goodness of Allah. See n.\\n\\t\\t\\t\\t5050. This, again, is shared in mutual converse and\\n\\t\\t\\t\\tconfidence."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "26",
    "NoteID": "5060",
    "Body": "A man may be good, and may with limits have found\\n\\t\\t\\t\\tgoodness in his own spiritual life, but may have\\n\\t\\t\\t\\tanxieties about his family or friends whom he loves. All\\n\\t\\t\\t\\tsuch shadows are removed in heaven by the Grace of Allah,\\n\\t\\t\\t\\tand he is free to dwell on it in his confidential\\n\\t\\t\\t\\tconverse with other men similarly circumstanced."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "27",
    "NoteID": "5061",
    "Body": "\"Us\" includes the good man or woman and all whom he or\\n\\t\\t\\t\\tshe cared for. This would be an ever-expanding circle,\\n\\t\\t\\t\\tuntil it includes all mankind through Teachers like the\\n\\t\\t\\t\\tChosen One."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "28",
    "NoteID": "5062",
    "Body": "'Before this, we called upon Him, in faith that He is\\n\\t\\t\\t\\tgood: now we know in our inmost souls that He is indeed\\n\\t\\t\\t\\tgood-the Beneficent, the Merciful.' This is the climax of\\n\\t\\t\\t\\tthe description of Heaven."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "29",
    "NoteID": "5063",
    "Body": "The greatest of the Prophets was called a soothsayer,\\n\\t\\t\\t\\ti.e., one who tells fortunes by divination, or a madman\\n\\t\\t\\t\\tpossessed of some evil spirit, or a poet singing spiteful\\n\\t\\t\\t\\tsatires. Much more may lesser men be called by such names\\n\\t\\t\\t\\tbecause they proclaim the Truth. They should go on in\\n\\t\\t\\t\\tspite of it all."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "30",
    "NoteID": "5064",
    "Body": "If a spiteful poet foretells evil calamities for men, men\\n\\t\\t\\t\\tcan afford to laugh at him, hoping that time will bring\\n\\t\\t\\t\\tabout its revenge, and spite will come to an evil end.\\n\\t\\t\\t\\tFor the various meanings of Raib, see n. 1884 to xiv. 9.\\n\\t\\t\\t\\tSome Commentators suggest Death as the Calamity hatched\\n\\t\\t\\t\\tby Time."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "31",
    "NoteID": "5065",
    "Body": "Cf. ix. 52. If the wicked wait or look for some calamity\\n\\t\\t\\t\\tto befall the Prophet, the Prophet can with far more\\n\\t\\t\\t\\tjustice await the decision of the issue between him and\\n\\t\\t\\t\\this persecutors. For he stands for right, and Allah will\\n\\t\\t\\t\\tsupport the right."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "32",
    "NoteID": "5066",
    "Body": "It may be that the persecutors of Truth are ignorant, and\\n\\t\\t\\t\\ttheir deficient faculties of understanding mislead them,\\n\\t\\t\\t\\tbut it is more often the case that they are perverse\\n\\t\\t\\t\\trebels against the law of Allah, defending their own\\n\\t\\t\\t\\tselfish interests, and preventing those whom they\\n\\t\\t\\t\\toppress, from getting justice."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "32",
    "NoteID": "5067",
    "Body": "Cf. li. 53."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "33",
    "NoteID": "5068",
    "Body": "As an alternative to the charges of being a soothsayer or\\n\\t\\t\\t\\ta madman or a disgruntled poet, there is the charge of a\\n\\t\\t\\t\\tforger or fabricator applied to the prophet of Allah when\\n\\t\\t\\t\\the produces his Message. This implies that there can be\\n\\t\\t\\t\\tno revelation or inspiration from Allah. Such an attitude\\n\\t\\t\\t\\tnegatives Faith altogether. But if this is so, can they\\n\\t\\t\\t\\tproduce a work of man that can compare with the inspired\\n\\t\\t\\t\\tWord of Allah? They cannot. Cf. n. 37-39, and xvii. 88."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "35",
    "NoteID": "5069",
    "Body": "\"Were they created of nothing?\" Three possible\\n\\t\\t\\t\\talternative meanings are suggested by the Commentators,\\n\\t\\t\\t\\taccording to the meaning we give to the Arabic\\n\\t\\t\\t\\tpreposition min=of, by, with, for. (1) 'Were they created\\n\\t\\t\\t\\tby nothing? Did they come into existence of themselves?\\n\\t\\t\\t\\tWas it a mere chance that they came into being? (2) Were\\n\\t\\t\\t\\tthey created as men out of nothing? Was there not a\\n\\t\\t\\t\\twonderful seed, from which their material growth can be\\n\\t\\t\\t\\ttraced, as the handiwork of a wise and wonderful Creator?\\n\\t\\t\\t\\tMust they not then seek His Will? (3) Were they created\\n\\t\\t\\t\\tfor nothing, to no purpose? If they were created for a\\n\\t\\t\\t\\tpurpose, must they not try to learn that purpose by\\n\\t\\t\\t\\tunderstanding Allah's Revelation?"
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "36",
    "NoteID": "5070",
    "Body": "They obviously did not create the wonders of the starry\\n\\t\\t\\t\\theavens and the fruitful globe of the earth. But they can\\n\\t\\t\\t\\tassign no definite cause to explain it, as they have no\\n\\t\\t\\t\\tfirm belief on the subject themselves."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "37",
    "NoteID": "5071",
    "Body": "Cf. vi. 50, and n. 867. The Treasures of Allah's\\n\\t\\t\\t\\tKnowledge are infinite. But the doubters and unbelievers\\n\\t\\t\\t\\thave no access to them, much less can the doubters and\\n\\t\\t\\t\\tunbelievers manage the wonders of this world. Must they\\n\\t\\t\\t\\tnot therefore seek grace and revelation from Allah?"
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "38",
    "NoteID": "5072",
    "Body": "Cf. vi. 35: a reference to the Pagan belief that by means\\n\\t\\t\\t\\tof a material ladder a man might climb up to heaven and\\n\\t\\t\\t\\tlearn its secrets!"
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "39",
    "NoteID": "5073",
    "Body": "Cf. xvi. 57-59, and n. 2082. To the gospel of Unity it is\\n\\t\\t\\t\\trepugnant to assign begotten sons or daughters to Allah.\\n\\t\\t\\t\\tBut the Arab superstition about angels being the\\n\\t\\t\\t\\tdaughters of Allah was particularly blasphemous as the\\n\\t\\t\\t\\tPagan Arabs hated to have daughters themselves and\\n\\t\\t\\t\\tconsidered it a mark of humiliation!"
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "40",
    "NoteID": "5074",
    "Body": "The prophets of Allah ask for no reward to preach the\\n\\t\\t\\t\\tMessage of Allah and direct men to the right Path. Why\\n\\t\\t\\t\\tthen do men shun them and persecute those who seek to\\n\\t\\t\\t\\tbring blessings to them?"
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "41",
    "NoteID": "5075",
    "Body": "The Unseen is a subject of Revelation, though it works\\n\\t\\t\\t\\tthrough the common everyday life of man. The men who\\n\\t\\t\\t\\treject Revelation simply because it is outside their own\\n\\t\\t\\t\\texperience ought on the contrary to try to learn about it\\n\\t\\t\\t\\tand seek to understand it."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "42",
    "NoteID": "5076",
    "Body": "Shallow men who plot against Good are themselves the\\n\\t\\t\\t\\twilling victims of insidious plots laid by Evil."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "43",
    "NoteID": "5077",
    "Body": "This is the final and decisive question: Is there really\\n\\t\\t\\t\\tany god other than Allah the One True God? Every argument\\n\\t\\t\\t\\tpoints to the negative. A series of questions has been\\n\\t\\t\\t\\tasked above pointing to the negative of the superstitions\\n\\t\\t\\t\\tof the godless. The gospel of Unity, Revelation, and the\\n\\t\\t\\t\\tHereafter has thus been preached by a searching\\n\\t\\t\\t\\texamination of the position of the Unbelievers. And the\\n\\t\\t\\t\\tSura ends with an exhortation to leave alone those who\\n\\t\\t\\t\\twill not believe because they wish not to believe, and to\\n\\t\\t\\t\\tlet Time work out the web and pattern of Allah's Plan."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "44",
    "NoteID": "5078",
    "Body": "In xxvi. 187, Shu'aib, the Prophet of Allah, is\\n\\t\\t\\t\\tchallenged by the Companions of the Wood \"to cause a\\n\\t\\t\\t\\tpiece of the sky to fall on us, if thou art truthful.\"\\n\\t\\t\\t\\tSuch a challenge, in some form or other, is addressed to\\n\\t\\t\\t\\tall prophets of Allah. It is mere defiance. It has no\\n\\t\\t\\t\\tmeaning. If a piece of the sky were to fall on them, it\\n\\t\\t\\t\\twould not convince them, for they would only say: \"These\\n\\t\\t\\t\\tare only clouds gathered in heaps.\" They do not wish to\\n\\t\\t\\t\\tbelieve. Otherwise there are ample Signs and Evidences of\\n\\t\\t\\t\\tAllah's Plan in Creation and in man's own heart."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "45",
    "NoteID": "5079",
    "Body": "That is, the Day of Judgment. Cf. xxxix. 68, and n. 4343."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "47",
    "NoteID": "5080",
    "Body": "The final Judgment is for all. But in addition,\\n\\t\\t\\t\\twrong-doers have to fear a retribution or punishment in\\n\\t\\t\\t\\tthis very life, an open punishment through external\\n\\t\\t\\t\\tevents, or at least the bitter pangs of conscience\\n\\t\\t\\t\\twithin."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "48",
    "NoteID": "5081",
    "Body": "The messenger of Allah must strive his utmost to proclaim\\n\\t\\t\\t\\tthe Message of Allah: as for results, it is not for him\\n\\t\\t\\t\\tto command them. He must wait patiently, in the knowledge\\n\\t\\t\\t\\tthat he is not forgotten by Allah, but is constantly\\n\\t\\t\\t\\tunder Allah's eyes,-under His loving care and protection.\\n\\t\\t\\t\\tAnd he must glorify Allah's name, as he is a\\n\\t\\t\\t\\tstandard-bearer of Allah's Truth."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "48",
    "NoteID": "5082",
    "Body": "The translators and Commentators nearly all understand\\n\\t\\t\\t\\ttaqumu in the sense of rising up from sleep. But the\\n\\t\\t\\t\\trendering I have given is consistent with Quranic usage.\\n\\t\\t\\t\\tIn xxvi. 218, we have the same two words hina taqumu,\\n\\t\\t\\t\\tmeaning \"standing forth (in prayer)\". In lvii. 25, we\\n\\t\\t\\t\\thave \"li-yaqum an-nasu bil-qisti\", which obviously means\\n\\t\\t\\t\\t\"that men may stand forth in justice,\" i.e., do all their\\n\\t\\t\\t\\tbusiness in justice. In lxxviii. 38, we have yaqumu used\\n\\t\\t\\t\\tfor the angels standing forth in ranks. On my rendering\\n\\t\\t\\t\\tthe meaning will be: 'celebrate Allah's praises when you\\n\\t\\t\\t\\tstand forth in prayer, or at all times when you go about\\n\\t\\t\\t\\tyour business; but also for part of the night and at\\n\\t\\t\\t\\tearly dawn when worldly life is at a standstill.'"
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "49",
    "NoteID": "5083",
    "Body": "It is not necessary to understand this for any particular\\n\\t\\t\\t\\tcanonical prayers. It is good to spend a part of the\\n\\t\\t\\t\\tnight in prayer and praise: Cf. lxxiii. 6. And the Dawn\\n\\t\\t\\t\\tis a daily recurring miracle, full of spiritual\\n\\t\\t\\t\\tinfluences and \"testimony\": Cf. xvii. 78-79."
  },
  {
    "SurahNumber": "52",
    "AyahNumber": "49",
    "NoteID": "5084",
    "Body": "Idbar-un-nujum: the setting of the stars: the glorious\\n\\t\\t\\t\\thour of early dawn. In cxiii. 1, we seek Allah's\\n\\t\\t\\t\\tprotection as \"Lord of the Dawn\"."
  }
]
