[
  {
    "SurahNumber": "51",
    "AyahNumber": "1",
    "NoteID": "4986",
    "Body": "Four things are mentioned in verses 1 to 4 as evidences\\n\\t\\t\\t\\tor types of the certainty and unity of a Truth described\\n\\t\\t\\t\\tin verses 5-6. What these things are is described by\\n\\t\\t\\t\\tcertain adjectival participles, the noun understood being\\n\\t\\t\\t\\tusually taken to be \"Winds\": the word for Wind (Rih)\\n\\t\\t\\t\\tbeing feminine in Arabic. Some Commentators however\\n\\t\\t\\t\\tunderstand other nouns as being implied. e.g., angels in\\n\\t\\t\\t\\tall four verses, or different things in each of the four\\n\\t\\t\\t\\tverses. Whatever these things are, their different modes\\n\\t\\t\\t\\tof working are evidence of the power and goodness of\\n\\t\\t\\t\\tAllah, the Unity of His Plan, and the certainty of Good\\n\\t\\t\\t\\tand Evil reaching their own destined ends, when Judgment\\n\\t\\t\\t\\tand Justice will have given each one his due."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "1",
    "NoteID": "4987",
    "Body": "Winds may blow strong, and scatter particles of dust far\\n\\t\\t\\t\\tand wide; but they do not diminish by one jot the\\n\\t\\t\\t\\tsubstance of Allah's material creation; on the contrary\\n\\t\\t\\t\\tthey help to readjust things. They reshape the\\n\\t\\t\\t\\tconfiguration of the earth; in the vegetable kingdom they\\n\\t\\t\\t\\tcarry seeds about and plant new seeds in old soils; in\\n\\t\\t\\t\\tthe region of air they produce mighty changes in\\n\\t\\t\\t\\ttemperature and pressure that affect animal and vegetable\\n\\t\\t\\t\\tlife; they carry the moisture of equatorial Africa to the\\n\\t\\t\\t\\tparched plains of India; and so on. Yet they are just one\\n\\t\\t\\t\\tlittle agency showing Allah's working in the material\\n\\t\\t\\t\\tworld. So in the spiritual world. Revelation works mighty\\n\\t\\t\\t\\tchanges; it may be resisted, but the resistance will be\\n\\t\\t\\t\\tswept away; it ever points to the one Great Final Event,\\n\\t\\t\\t\\t\"to which the whole Creation moves\"."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "2",
    "NoteID": "4988",
    "Body": "The things that lift and bear away heavy weights may be\\n\\t\\t\\t\\tthe Winds that carry the heavy rain-clouds or that sweep\\n\\t\\t\\t\\toff every resistance from their path, or it may be the\\n\\t\\t\\t\\theavy moisture-laden clouds themselves. So works\\n\\t\\t\\t\\tRevelation: it lifts and sweeps away the burdens of\\n\\t\\t\\t\\tcustom, superstition, or man's inertia, and ever leads\\n\\t\\t\\t\\tonwards to the destined End."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "3",
    "NoteID": "4989",
    "Body": "These may be Winds that fill the sails of ships with\\n\\t\\t\\t\\tgentle and favourable breezes, that carry men and\\n\\t\\t\\t\\tmerchandise to their destinations. Or they may be the\\n\\t\\t\\t\\tships themselves, whose smooth motion through the waters\\n\\t\\t\\t\\tis described in many places, by the verb jara, \"to flow\",\\n\\t\\t\\t\\te.g., cf. ii. 164."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "4",
    "NoteID": "4990",
    "Body": "These may be Winds (or other agencies) that distribute\\n\\t\\t\\t\\tand apportion moisture or rain or atmospheric pressure or\\n\\t\\t\\t\\tother blessings of Allah, -not haphazard but by fixed\\n\\t\\t\\t\\tlaws, i. e., according to the Command of their Lord. So\\n\\t\\t\\t\\twith Revelation. Its blessings are distributed all round,\\n\\t\\t\\t\\tand it produces its marvellous effects sometimes in the\\n\\t\\t\\t\\tmost unlikely places and ways."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "5",
    "NoteID": "4991",
    "Body": "That which ye are promised: the Promise of Allah about\\n\\t\\t\\t\\tMercy and Forgiveness to the Penitent, and Justice and\\n\\t\\t\\t\\tPenalty to the Rebellious, the promise of the Hereafter:\\n\\t\\t\\t\\tthe promise that all does not end here, but that there is\\n\\t\\t\\t\\ta truer and more lasting world to come, for which this is\\n\\t\\t\\t\\tbut a preparation."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "6",
    "NoteID": "4992",
    "Body": "Din=the giving to each person his precise and just due;\\n\\t\\t\\t\\tthis is implied in Judgment and Justice. All the\\n\\t\\t\\t\\tinequalities of this Life are to be redressed."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "7",
    "NoteID": "4993",
    "Body": "The study of the numerous regular orbits of the planets\\n\\t\\t\\t\\tand irregularly regular orbits of comets, and the various\\n\\t\\t\\t\\tmotions, visible or invisible, of the fixed stars or\\n\\t\\t\\t\\trevolving stars, form in themselves a network of\\n\\t\\t\\t\\tknowledge or science, of a highly technical nature; the\\n\\t\\t\\t\\thighest astronomy or mathematics can only barely reach\\n\\t\\t\\t\\tits fringe. But these have all a fixed Plan and Purpose\\n\\t\\t\\t\\tunder Allah's Dispensation. In them variety leads to\\n\\t\\t\\t\\tUnity. In contrast look at the confused medley of\\n\\t\\t\\t\\tdoctrines, views, and dicta put forward by the Sceptics,\\n\\t\\t\\t\\tas described in the next verse."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "8",
    "NoteID": "4994",
    "Body": "Qaul=saying, word, theory, doctrine. Mukhtalif\\n\\t\\t\\t\\t=differing, various, inconsistent with itself,\\n\\t\\t\\t\\tdiscordant. No theory or doctrine based on a denial of a\\n\\t\\t\\t\\tHereafter can be consistent with spiritual facts as we\\n\\t\\t\\t\\tknow them, or with Allah's Goodness, Justice, and Mercy."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "9",
    "NoteID": "4995",
    "Body": "Some Commentators draw from this a rigid doctrine of\\n\\t\\t\\t\\tCalvinistic Predestination or Determinism, which I do not\\n\\t\\t\\t\\tthink is fairly deducible from the words. \"Ufika\" should\\n\\t\\t\\t\\tI think be translated \"will be or would be deluded\",\\n\\t\\t\\t\\tmeaning \"have the wish or desire to be\", and not \"must\\n\\t\\t\\t\\tnecessarily be deluded by eternal predestination\". The\\n\\t\\t\\t\\tword occurs in many places in the Qur-an: e.g. Cf. v. 78,\\n\\t\\t\\t\\tor ix. 30."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "11",
    "NoteID": "4996",
    "Body": "They are in great spiritual danger: yet they care not."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "14",
    "NoteID": "4997",
    "Body": "They used to say scoffingly, \"if there is to be\\n\\t\\t\\t\\tpunishment for our sins, let it come at once!\" When it\\n\\t\\t\\t\\tcomes, they will know what a terrible thing it is! Cf.\\n\\t\\t\\t\\txxvi. 204, n. 3230."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "15",
    "NoteID": "4998",
    "Body": "Gardens and Springs are the two most frequent examples\\n\\t\\t\\t\\tfor the highest satisfaction and bliss."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "17",
    "NoteID": "4999",
    "Body": "They were engaged most of the night in worship and in the\\n\\t\\t\\t\\tplanning of good deeds. They preferred activity to\\n\\t\\t\\t\\tidleness, the service of Allah and His creatures to the\\n\\t\\t\\t\\tindulgence of Self."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "18",
    "NoteID": "5000",
    "Body": "They were up early before dawn, ready for their\\n\\t\\t\\t\\tdevotions. The praying for Forgiveness and Mercy does not\\n\\t\\t\\t\\tnecessarily imply that they had committed fresh sins.\\n\\t\\t\\t\\tIndeed they began the day with such devotions, showing\\n\\t\\t\\t\\ttheir great humility before Allah and their anxious care\\n\\t\\t\\t\\tfor others, for whom they prayed as much as for\\n\\t\\t\\t\\tthemselves. See the last sentence of n. 21 to i. 5."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "19",
    "NoteID": "5001",
    "Body": "True charity remembers not only those in need who ask,\\n\\t\\t\\t\\tbut also those who are prevented by some reason from\\n\\t\\t\\t\\tasking. The man of true charity seeks out the latter.\\n\\t\\t\\t\\tThere may be various reasons which prevent a man from\\n\\t\\t\\t\\tasking for help: (1) he may be ashamed to ask, or his\\n\\t\\t\\t\\tsense of honour may prevent him from asking; (2) he may\\n\\t\\t\\t\\tbe so engrossed in some great ideal that he may not think\\n\\t\\t\\t\\tof asking; (3) he may even not know that he is in need,\\n\\t\\t\\t\\t(4) he may not know that you possess the things that can\\n\\t\\t\\t\\tsupply his needs; and (5) he may be a dumb and helpless\\n\\t\\t\\t\\tcreature, whether a human being or a dumb animal, or any\\n\\t\\t\\t\\tcreature within your ken or power. Charity in the higher\\n\\t\\t\\t\\tsense includes all help, from one better endowed to one\\n\\t\\t\\t\\tless well endowed. Cf. n. 179 to ii. 177; also ii.\\n\\t\\t\\t\\t273-274, and notes 322 and 323."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "21",
    "NoteID": "5002",
    "Body": "The Signs and Evidence of Allah are in all nature and\\n\\t\\t\\t\\twithin the body and soul of man, if man has but the\\n\\t\\t\\t\\tspiritual eyes to see. Cf. xli. 53."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "22",
    "NoteID": "5003",
    "Body": "\"Sustenance\", here as elsewhere, includes physical\\n\\t\\t\\t\\tsustenance, as well as spiritual sustenance. Similarly\\n\\t\\t\\t\\theaven or sky has both the physical and the spiritual\\n\\t\\t\\t\\tmeaning. The physical sustenance grows from rain from the\\n\\t\\t\\t\\tsky; the spiritual sustenance comes from divine aid,\\n\\t\\t\\t\\tgrace, and mercy, and includes the Good News and the\\n\\t\\t\\t\\tWarning which come from Revelation about the Hereafter."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "23",
    "NoteID": "5004",
    "Body": "Attention having been called to the Signs or Evidences of\\n\\t\\t\\t\\tAllah's working on the earth, within ourselves, and in\\n\\t\\t\\t\\tthe heavens, in verses 20-22, an appeal is made to our\\n\\t\\t\\t\\town inner conscience, in the name of the Lord of heaven\\n\\t\\t\\t\\tand earth, to acknowledge and act up to the truth of\\n\\t\\t\\t\\tRevelation, and turn to the spiritual Realities. For they\\n\\t\\t\\t\\tare as real as our own conscious and self-intelligent\\n\\t\\t\\t\\texistence, on which is based all our knowledge. As a\\n\\t\\t\\t\\tphilosopher (Descartes) has said: \"I think; therefore I\\n\\t\\t\\t\\tam.\""
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "24",
    "NoteID": "5005",
    "Body": "Cf. xi. 69-73 and notes, where further details of the\\n\\t\\t\\t\\tstory will be found. Cf. also xv. 51-56."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "25",
    "NoteID": "5006",
    "Body": "They were angels, who appeared suddenly before him at his\\n\\t\\t\\t\\ttent-door in the guise of men, and saluted him with the\\n\\t\\t\\t\\tsalutation of peace. He returned the salutation, but\\n\\t\\t\\t\\tfelt, from their appearance and their manner, that they\\n\\t\\t\\t\\twere unusual, not ordinary, strangers."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "25",
    "NoteID": "5007",
    "Body": "Munkar: unknown, uncommon, unusual, not customary, (hence\\n\\t\\t\\t\\tby derived meaning, not applicable here, not fair or\\n\\t\\t\\t\\tjust); opposite in both primary and secondary meanings to\\n\\t\\t\\t\\tmaraf, well-known, usual, customary, just. Cf. xv. 62."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "26",
    "NoteID": "5008",
    "Body": "They seemed unusual strangers, but he said nothing and\\n\\t\\t\\t\\tquietly proceeded to perform the rites of hospitality. He\\n\\t\\t\\t\\tbrought a roast fatted calf and placed it before them to\\n\\t\\t\\t\\teat. But the strangers did not eat (xi. 70). This\\n\\t\\t\\t\\tdisconcerted him. According to the laws of hospitality, a\\n\\t\\t\\t\\tstranger under your roof is under your protection, but if\\n\\t\\t\\t\\the refuses to eat, he refuses your hospitality and keeps\\n\\t\\t\\t\\thimself free from any ties of guest and host. \"What were\\n\\t\\t\\t\\ttheir designs?\" thought Abraham, and he felt some\\n\\t\\t\\t\\tdistrust. But they were angels and could not eat. They\\n\\t\\t\\t\\tdeclared themselves, and announced the birth to Abraham\\n\\t\\t\\t\\tof a son endowed with wisdom,-in other words that Abraham\\n\\t\\t\\t\\twas to be the head of a long line of Prophets! (xv. 53)."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "29",
    "NoteID": "5009",
    "Body": "Abraham's wife Sarah was old and barren. This news seemed\\n\\t\\t\\t\\tto her too good to be true. She came forward, clamoured\\n\\t\\t\\t\\t(xi. 71), struck her forehead with her hands, indicative\\n\\t\\t\\t\\tof her amusement and incredulity as \"a barren old woman\":\\n\\t\\t\\t\\txi. 72."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "30",
    "NoteID": "5010",
    "Body": "The angels said: \"What may sound improbable to human\\n\\t\\t\\t\\tbeings will yet come to pass if Allah commands. And Allah\\n\\t\\t\\t\\tthy Lord has spoken. So shall it be. For all His promises\\n\\t\\t\\t\\tare full of wisdom and knowledge.\" So the angels on that\\n\\t\\t\\t\\toccasion. But the application is for all time and to all\\n\\t\\t\\t\\thuman affairs. Never despair. However much Truth may be\\n\\t\\t\\t\\tin the shade, it will shine with full splendour. And the\\n\\t\\t\\t\\tJudgment will come, when good will come to its own!"
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "33",
    "NoteID": "5011",
    "Body": "Cf. xi. 82, and n. 1052 to vii. 84. The angels' errand of\\n\\t\\t\\t\\tmercy to Abraham (to announce the succession of godly men\\n\\t\\t\\t\\tin his line) was coupled with their errand of justice and\\n\\t\\t\\t\\tpunishment to the people of Lut, the people of Sodom and\\n\\t\\t\\t\\tGomorrah, who were deep in the most abominable and\\n\\t\\t\\t\\tunnatural sins. So Allah's Mercy and Justice go hand in\\n\\t\\t\\t\\thand in all human affairs. Faith has nothing to fear, and\\n\\t\\t\\t\\twickedness has only to turn and repent, to obtain Allah's\\n\\t\\t\\t\\tMercy."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "34",
    "NoteID": "5012",
    "Body": "Cf. xi. 83, and n. 1580. Every crime has its due\\n\\t\\t\\t\\tpunishment as marked out in the decrees of Allah."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "35",
    "NoteID": "5013",
    "Body": "The only just or righteous persons found in Sodom and\\n\\t\\t\\t\\tGomorrah (Cities of the Plain by the Dead Sea) were in\\n\\t\\t\\t\\tthe house of Lut, who was the Prophet sent to call them\\n\\t\\t\\t\\tto repentance. He and his believing family and adherents\\n\\t\\t\\t\\twere told to leave in due time, and the wicked were\\n\\t\\t\\t\\tdestroyed in a shower of brimstone."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "36",
    "NoteID": "5014",
    "Body": "That was the house of Lut; and even there, his wife had\\n\\t\\t\\t\\tno faith: she disobeyed the Command and perished: xi. 81,\\n\\t\\t\\t\\tn. 1577."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "37",
    "NoteID": "5015",
    "Body": "The Grievous Chastisement: that is, the Final Judgment.\\n\\t\\t\\t\\tThe destruction of Sodom and Gomorrah in this life is\\n\\t\\t\\t\\ttaken as the type of the Final Judgment. The vestiges can\\n\\t\\t\\t\\tbe seen-as a Sign and a Warning-in the sulphury plain\\n\\t\\t\\t\\tround the Dead Sea: Cf. xv. 79."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "38",
    "NoteID": "5016",
    "Body": "Cf. xliv. 17-31. The story of Moses and Pharaoh is here\\n\\t\\t\\t\\tjust referred to. The points emphasized here are: (1)\\n\\t\\t\\t\\tthat Moses had manifest authority, yet Pharaoh doubted;\\n\\t\\t\\t\\t(2) that Pharaoh's reliance was on his Chiefs and his\\n\\t\\t\\t\\tforces, but they could not help when his doom came; and\\n\\t\\t\\t\\t(3) that in the most extraordinary and incredible ways\\n\\t\\t\\t\\t(judged by ordinary human standards), his arrogance and\\n\\t\\t\\t\\this reliance on his Chiefs and forces was his undoing."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "40",
    "NoteID": "5017",
    "Body": "The ungodly Egyptians were all destroyed, but the chief\\n\\t\\t\\t\\tblame lay on Pharaoh for misleading them. Pharaoh's\\n\\t\\t\\t\\tpunishment was just. He could not blame any one else. And\\n\\t\\t\\t\\tcertainly no one can blame the course of Allah's Justice,\\n\\t\\t\\t\\tfor Allah was patient, and gave him many chances to\\n\\t\\t\\t\\trepent."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "41",
    "NoteID": "5018",
    "Body": "Cf. xlvi. 21-26. The point here is that the 'Ad were a\\n\\t\\t\\t\\tgifted people: Allah had given them talents and material\\n\\t\\t\\t\\twealth: but when they defied Allah, they and all their\\n\\t\\t\\t\\tbelongings were destroyed in a night, by a hurricane\\n\\t\\t\\t\\twhich they thought was bringing them the rain to which\\n\\t\\t\\t\\tthey were looking forward. How marvellously Allah's\\n\\t\\t\\t\\tProvidence works, to help the good and destroy the\\n\\t\\t\\t\\twicked!"
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "43",
    "NoteID": "5019",
    "Body": "See the story of the Thamud and their prophet Salih in\\n\\t\\t\\t\\tvii. 73-79. Here the point is the suddenness of their\\n\\t\\t\\t\\tpunishment and its unexpected nature."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "43",
    "NoteID": "5020",
    "Body": "Salih their prophet gave them three days' clear warning\\n\\t\\t\\t\\tfor repentance (xi. 65). But they heeded him not. On the\\n\\t\\t\\t\\tcontrary they flouted him and continued in their evil\\n\\t\\t\\t\\tcourses."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "44",
    "NoteID": "5021",
    "Body": "They had already defied the order to preserve the\\n\\t\\t\\t\\tShe-camel, which was a sign from Allah. See xi. 64-65 and\\n\\t\\t\\t\\tn. 1560. They continued to flout the warnings of the\\n\\t\\t\\t\\tprophet until the earthquake came on them with a stunning\\n\\t\\t\\t\\tnoise and buried them where they were: vii. 78; and xi.\\n\\t\\t\\t\\t67."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "44",
    "NoteID": "5022",
    "Body": "Sa'iqat: a stunning sound like that of thunder and\\n\\t\\t\\t\\tlightning (ii. 55); such a sound often accompanies an\\n\\t\\t\\t\\tearthquake (see xli. 17, n. 4485, and vii. 78 and n.\\n\\t\\t\\t\\t1047)."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "45",
    "NoteID": "5023",
    "Body": "They were swept off in the earthquake."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "46",
    "NoteID": "5024",
    "Body": "The generation of Noah was swept away in the Flood for\\n\\t\\t\\t\\ttheir sins: vii. 59-64. The point is that such a Flood\\n\\t\\t\\t\\tseemed so unlikely to them that they thought Noah was\\n\\t\\t\\t\\t\"wandering in his mind\" when he delivered Allah's\\n\\t\\t\\t\\tMessage: vii. 60."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "47",
    "NoteID": "5025",
    "Body": "If you do not wish to go back to the wonderful things in\\n\\t\\t\\t\\tthe past, which show the power and goodness of Allah, and\\n\\t\\t\\t\\tHis justice supreme over all wrong-doing, look at the\\n\\t\\t\\t\\twonderful things unfolding themselves before your very\\n\\t\\t\\t\\teyes! (1) The space in the heavens above! Who can\\n\\t\\t\\t\\tcomprehend it but He Who made it and sustains it? (2) The\\n\\t\\t\\t\\tglobe of the earth under your feet! How great its expanse\\n\\t\\t\\t\\tseems over sea and land, and spread out for you like a\\n\\t\\t\\t\\twonderful carpet or bed of rest! (3) All things are in\\n\\t\\t\\t\\ttwos: sex in plants and animals, by which one individual\\n\\t\\t\\t\\tis complementary to another; in the subtle forces of\\n\\t\\t\\t\\tnature, Day and Night, positive and negative electricity,\\n\\t\\t\\t\\tforces of attraction and repulsion: and numerous other\\n\\t\\t\\t\\topposites, each fulfilling its purpose, and contribution\\n\\t\\t\\t\\tto the working of Allah's Universe: and in the moral and\\n\\t\\t\\t\\tspiritual world, Love and Aversion, Mercy and Justice,\\n\\t\\t\\t\\tStriving and Rest, and so on;-all fulfilling their\\n\\t\\t\\t\\tfunctions according to the Artistry and wonderful Purpose\\n\\t\\t\\t\\tof Allah. Everything has its counterpart, or pair, or\\n\\t\\t\\t\\tcomplement. Allah alone is One, with none like Him, or\\n\\t\\t\\t\\tneeded to complement Him. These are noble things to\\n\\t\\t\\t\\tcontemplate. And they lead us to a true understanding of\\n\\t\\t\\t\\tAllah's Purpose and Message."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "49",
    "NoteID": "5026",
    "Body": "See (3) in the last note. Cf. xxxvi. 36, n. 3981."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "50",
    "NoteID": "5027",
    "Body": "If you understand Nature and yourselves aright, you will\\n\\t\\t\\t\\tknow that Allah is the Truth, and you will fly at once to\\n\\t\\t\\t\\tHim. This is the teaching which the Prophet of Allah has\\n\\t\\t\\t\\tcome to give you, in clear terms and openly to all."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "51",
    "NoteID": "5028",
    "Body": "Verses 50 and 51, ending with the same clause to\\n\\t\\t\\t\\temphasize the connection between the two, should be read\\n\\t\\t\\t\\ttogether. The Prophet's mission was (and is): (1) to show\\n\\t\\t\\t\\tus the urgent need for repentance; and (2) to wean us\\n\\t\\t\\t\\tfrom the precipice of false worship. The one convinces us\\n\\t\\t\\t\\tof sin and opens the door to the Mercy of Allah; the\\n\\t\\t\\t\\tother cures us of the madness of paying court to idle or\\n\\t\\t\\t\\tworthless objects of desire; for in the worship of Allah,\\n\\t\\t\\t\\tthe One True God is included the best service to\\n\\t\\t\\t\\tourselves and our fellow-creatures. If fully understood,\\n\\t\\t\\t\\tthis sums up the whole duty of man: for it leads us by\\n\\t\\t\\t\\tthe right Path to the love of Allah and the love of man\\n\\t\\t\\t\\tand of all creatures."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "52",
    "NoteID": "5029",
    "Body": "They said this of Moses: li. 39. And they said this of\\n\\t\\t\\t\\tthe holy Prophet: xxxviii. 4; xliv. 14."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "53",
    "NoteID": "5030",
    "Body": "There is a tradition of Evil as there is a tradition of\\n\\t\\t\\t\\tGood. The ways of Evil in dealing with the teachers of\\n\\t\\t\\t\\tTruth are similar in all ages. But such evil traditions\\n\\t\\t\\t\\twould have no effect, were it not that the generation\\n\\t\\t\\t\\tfollowing them is itself ungodly, \"transgressing beyond\\n\\t\\t\\t\\tbounds.\""
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "54",
    "NoteID": "5031",
    "Body": "When the Prophet freely proclaims his Message, it is not\\n\\t\\t\\t\\this fault if obstinate wickedness refuses to listen. He\\n\\t\\t\\t\\tcan leave them alone, but he should continue to teach for\\n\\t\\t\\t\\tthe benefit of those who have Faith."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "56",
    "NoteID": "5032",
    "Body": "Creation is not for idle sport or play: xxi. 16. Allah\\n\\t\\t\\t\\thas a serious Purpose behind it, which, in our imperfect\\n\\t\\t\\t\\tstate, we can only express by saying that each creature\\n\\t\\t\\t\\tis given the chance of development and progress towards\\n\\t\\t\\t\\tthe Goal, which is Allah. Allah is the source and centre\\n\\t\\t\\t\\tof all power and all goodness, and our progress depends\\n\\t\\t\\t\\tupon our putting ourselves into accord with His Will.\\n\\t\\t\\t\\tThis is His service. It is not of any benefit to Him: see\\n\\t\\t\\t\\tthe next two verses: it is for our own benefit."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "57",
    "NoteID": "5033",
    "Body": "Sustenance: in both the literal and the figurative sense;\\n\\t\\t\\t\\tso also \"Freed Me\" at the end of the verse. Allah is\\n\\t\\t\\t\\tindependent of all needs. It is therefore absurd to\\n\\t\\t\\t\\tsuppose that He should require any Sustenance, and still\\n\\t\\t\\t\\tmore absurd to suppose that we can feed Him! The gifts,\\n\\t\\t\\t\\tthe Sustenance, the goodness, all come from His side."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "58",
    "NoteID": "5034",
    "Body": "Allah commands all power; therefore any power we seek\\n\\t\\t\\t\\tmust be from Him. And His power is steadfast, the same\\n\\t\\t\\t\\tto-day as yesterday, and for ever. Therefore His help is\\n\\t\\t\\t\\talways sure."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "59",
    "NoteID": "5035",
    "Body": "Each generation, that acts like any of its predecessors,\\n\\t\\t\\t\\tmust meet a similar fate. If the wicked came to an evil\\n\\t\\t\\t\\tend in the past, the same results will follow in the\\n\\t\\t\\t\\tpresent and the future. The punishment will come suddenly\\n\\t\\t\\t\\tenough: let them not in mockery ask that it should be\\n\\t\\t\\t\\thastened."
  },
  {
    "SurahNumber": "51",
    "AyahNumber": "60",
    "NoteID": "5036",
    "Body": "That is, their eternal Punishment in the Hereafter, as\\n\\t\\t\\t\\twell as any punishment that may come to them in this\\n\\t\\t\\t\\tlife."
  }
]
