[
  {
    "SurahNumber": "38",
    "AyahNumber": "1",
    "Text": "Suad."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "2",
    "Text": "And by the Qur'an which is full of admonition! Surely the\\n\\t\\t\\tunbelievers are in sheer arrogance and perverseness."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "3",
    "Text": "How many generations have We destroyed before them? When their\\n\\t\\t\\tdoom approached, they all cried out for mercy, but it was no\\n\\t\\t\\tlonger the time to be saved."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "4",
    "Text": "They wonder that a Warner has come to them from among themselves,\\n\\t\\t\\tand the disbelievers say: \"He is a sorcerer telling lies!"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "5",
    "Text": "Does he claim that there is only One God in place of all other\\n\\t\\t\\tgods? Surely this is a strange thing.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "6",
    "Text": "Their leaders go about saying: \"Pay no heed, stand firm in the\\n\\t\\t\\tservice of your gods; this slogan of One God is designed against\\n\\t\\t\\tyou."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "7",
    "Text": "We have not heard such a thing from anyone of the people of\\n\\t\\t\\tlatter days (Jews and Christians): it is nothing but a\\n\\t\\t\\tfabrication."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "8",
    "Text": "Is he the only fit person among us to whom the admonition is\\n\\t\\t\\trevealed?\" But in fact they doubt My admonition, for they have\\n\\t\\t\\tnot yet tasted My punishment."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "9",
    "Text": "Do they have the treasures of the mercy of your Rabb, the\\n\\t\\t\\tAll-Mighty, the Munificent One."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "10",
    "Text": "Or do they have sovereignty over the heavens and the earth and\\n\\t\\t\\tall that lies between them? If so, let them ascend by any means\\n\\t\\t\\tto be in a position of dictating Allah according to their wishes."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "11",
    "Text": "Their faction is no more than an army who will be beaten right\\n\\t\\t\\there."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "12",
    "Text": "Before them the people of Nuh, `Ad and Fir'on, the man of spikes,\\n\\t\\t\\tdenied their Rasools,"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "13",
    "Text": "So did Thamud, the people of Lut and those of Aiykah (the people\\n\\t\\t\\tof Median) - all divided themselves into factions;"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "14",
    "Text": "all charged their Rasools as liars, so just was my torment of\\n\\t\\t\\tannihilating them."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "15",
    "Text": "These people also await nothing but a single mighty Blast - the\\n\\t\\t\\tone which none may retard."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "16",
    "Text": "They say: \"Our Rabb, hasten our doom for us before the Day of\\n\\t\\t\\tReckoning.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "17",
    "Text": "O Prophet, have patience at what they say, and remember Our\\n\\t\\t\\tservant Dawood, the man of strength, who was frequent in turning\\n\\t\\t\\tto Allah for guidance."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "18",
    "Text": "We made the mountains join him in Our praises at evening and the\\n\\t\\t\\tsunrise."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "19",
    "Text": "And the birds, too, with all their flocks, join in singing with\\n\\t\\t\\thim."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "20",
    "Text": "We strengthened his kingdom and gave him wisdom and sound\\n\\t\\t\\tjudgment in speech and decision."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "21",
    "Text": "Have you heard the story of the two litigants who made an entry\\n\\t\\t\\tinto his private chamber through climbing over the wall?"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "22",
    "Text": "When they entered in upon Dawood and he became terrified. They\\n\\t\\t\\tsaid: \"Have no fear, we are two litigants, one of whom has\\n\\t\\t\\twronged the other. Judge rightly between us and do not be unjust,\\n\\t\\t\\tand guide us to the Right Way."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "23",
    "Text": "This man is my brother; he has ninety nine ewes while I have only\\n\\t\\t\\tone ewe. Yet he says: `Turn her over to me' and he has the means\\n\\t\\t\\tto prevail against me in what he says.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "24",
    "Text": "Dawood said: \"He has certainly wronged you in seeking to add your\\n\\t\\t\\tewe to his flock: in fact many partners are unjust to one\\n\\t\\t\\tanother; except those who believe and do good deeds, and they are\\n\\t\\t\\tfew indeed.\" - While he said this, Dawood realized that We had\\n\\t\\t\\ttested him ( Dawood had shown desire to one of his officers to\\n\\t\\t\\tdivorce his wife so that he could marry her even though he\\n\\t\\t\\talready had 99 wives). So he sought forgiveness of his Rabb and\\n\\t\\t\\tfell down on his knees and turned to Allah in repentance."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "25",
    "Text": "So We forgave his error. He will enjoy a place of nearness with\\n\\t\\t\\tUs and an excellent abode!"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "26",
    "Text": "We said: \"O Dawood! We have made you a vicegerent in the earth,\\n\\t\\t\\tso rule among the people with justice and do not follow your own\\n\\t\\t\\tdesires lest they mislead you from the Way of Allah. As for those\\n\\t\\t\\twho go astray from the Way of Allah, they shall surely have a\\n\\t\\t\\tsevere punishment because of forgetting the Day of Reckoning."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "27",
    "Text": "We have not created the heaven and the earth and all that lies\\n\\t\\t\\tbetween them in vain. That is the fancy of the unbelievers. Such\\n\\t\\t\\tdisbelievers should be aware of the hellfire."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "28",
    "Text": "Should We treat those who believe and do good deeds like those\\n\\t\\t\\twho create mischief in the earth? Should We treat the righteous\\n\\t\\t\\tlike the sinners?"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "29",
    "Text": "-- This Book (Al-Qur'an) which We have sent down to you (O\\n\\t\\t\\tMuhammad) is highly blessed, so that they may ponder upon its\\n\\t\\t\\tverses and the men of understanding may learn a lesson from it."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "30",
    "Text": "To Dawood We gave Sulaiman (Solomon), an excellent devotee! Who\\n\\t\\t\\twas frequent in returning to Us."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "31",
    "Text": "Worthy of mention is the incident when, one evening,\\n\\t\\t\\texcellent-bred steeds to be used in Jihad, were presented before\\n\\t\\t\\thim;"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "32",
    "Text": "and he said: \"Surely I have adopted the love of these good things\\n\\t\\t\\twith a view to glorify my Rabb.\" In testing race of the steeds,\\n\\t\\t\\twhen they disappeared from sight,"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "33",
    "Text": "he commanded: \"Bring them back to me.\" Then he began to pass his\\n\\t\\t\\thand over their legs and necks with affection."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "34",
    "Text": "Behold, We also put Sulaiman to test and placed a mere body on\\n\\t\\t\\this throne, then he turned to Us in repentance,"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "35",
    "Text": "and said \"O Rabb! Forgive me and grant me a kingdom similar of\\n\\t\\t\\twhich may not be given to anyone after me. Surely You are the\\n\\t\\t\\treal Giver.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "36",
    "Text": "We accepted his prayer and subjected to him the wind, which blew\\n\\t\\t\\tgently in whichever direction he wanted;"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "37",
    "Text": "and the shaitans (Jinns) including all kind of builders, divers"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "38",
    "Text": "and others fettered in chains."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "39",
    "Text": "We said to him: \"This is Our gift: you may give or withhold to\\n\\t\\t\\twhomever you want, without any accountability.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "40",
    "Text": "Surely he has a place of nearness to Us and will have an\\n\\t\\t\\texcellent place of final abode."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "41",
    "Text": "Mention Our devotee Ayub (Job), when he called upon his Rabb\\n\\t\\t\\tsaying: \"Shaitan has afflicted me with distress and suffering,\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "42",
    "Text": "and We asked him: \"Strike your foot on the ground. A cool spring\\n\\t\\t\\twill gush forth. Wash and drink to refresh yourself.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "43",
    "Text": "And We restored to him his family and many more with them as a\\n\\t\\t\\tgrace from Ourselves and a reminder for the people of\\n\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "44",
    "Text": "Then, to fulfill his oath of giving his wife one hundred strikes\\n\\t\\t\\twhich he made during his sickness, We said: \"Take a bunch of\\n\\t\\t\\ttwigs and strike with it and do not break your oath.\" Certainly\\n\\t\\t\\tWe found him full of patience. He was an excellent devotee, who\\n\\t\\t\\tturned to Us over and over again."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "45",
    "Text": "And mention Our devotees Ibrahim (Abraham), Ishaq (Isaac) and\\n\\t\\t\\tYa'qoob (Jacob): men of power and vision."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "46",
    "Text": "Surely We chose them for their special quality of keeping in mind\\n\\t\\t\\tthe abode of hereafter."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "47",
    "Text": "Certainly they are with Us; among the best chosen."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "48",
    "Text": "Also mention Isma'il, Al-Yas'a (Elisha) and Zul-Kifl; all of them\\n\\t\\t\\twere among the best."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "49",
    "Text": "This Qur'an is but a reminder. Surely the righteous shall return\\n\\t\\t\\tto an excellent resort."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "50",
    "Text": "The Gardens of Eden, whose gates shall be wide open to receive\\n\\t\\t\\tthem."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "51",
    "Text": "They shall recline there, calling for abundant fruit and\\n\\t\\t\\tdelicious drinks;"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "52",
    "Text": "and beside them there shall be bashful virgin companions of equal\\n\\t\\t\\tage."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "53",
    "Text": "These are the things which you are being promised on the Day of\\n\\t\\t\\tReckoning;"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "54",
    "Text": "this will be Our provision which will never finish."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "55",
    "Text": "Such will it be the reward for the righteous. But for the\\n\\t\\t\\trebellious there will be an evil resort"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "56",
    "Text": "- hell, that is! In which they will burn - the worst abode."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "57",
    "Text": "Such will it be the reward for the wrongdoers. So they will taste\\n\\t\\t\\tscalding water, festering blood (pus)"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "58",
    "Text": "and other things of the same sort."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "59",
    "Text": "It will be said to the ringleaders; \"Here are your troops being\\n\\t\\t\\tthrown headlong with you. They are not welcomed here; for they\\n\\t\\t\\tare going to burn in the hellfire."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "60",
    "Text": "The followers shall say to their miss guided leaders: \"But you!\\n\\t\\t\\tThere is no welcome for you either! It was you who have brought\\n\\t\\t\\tus to this end. Such an evil abode.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "61",
    "Text": "Then they will pray: \"Our Rabb, inflict on those who brought this\\n\\t\\t\\tfate upon us double punishment in the fire.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "62",
    "Text": "Then they will say to one another: \"But why do we not see those\\n\\t\\t\\twhom we deemed wicked"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "63",
    "Text": "and whom we use to ridicule? Or have our eyesight failed to\\n\\t\\t\\tnotice them?\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "64",
    "Text": "Surely, this is the very truth: the people in the hellfire will\\n\\t\\t\\targue just like that."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "65",
    "Text": "O Prophet, tell them: \"My mission is only as a Warner; there is\\n\\t\\t\\tno divinity except Allah, the One, the Irresistible,"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "66",
    "Text": "the Rabb of the heavens and the earth and all that lies between\\n\\t\\t\\tthem, the Almighty, the Forgiver.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "67",
    "Text": "Say: \"This is a supreme message:"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "68",
    "Text": "yet you pay no heed to it.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "69",
    "Text": "Also say: \"I have no knowledge of that time when the exalted\\n\\t\\t\\tchiefs disputed among themselves."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "70",
    "Text": "I am informed about all this through a revelation because I am\\n\\t\\t\\tassigned the mission of a plain Warner.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "71",
    "Text": "Behold when your Rabb said to the angels: \"I am about to create a\\n\\t\\t\\tman from clay:"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "72",
    "Text": "then when I have fashioned him and breathed of My spirit into\\n\\t\\t\\thim, kneel down and prostrate yourselves before him.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "73",
    "Text": "Accordingly all the angels prostrated themselves,"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "74",
    "Text": "except Iblees; he acted arrogantly and became one of the\\n\\t\\t\\tdisbelievers."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "75",
    "Text": "Allah said: \"O Iblees! What prevented you from prostrating\\n\\t\\t\\tyourself to the one whom I have created with My own hands? Are\\n\\t\\t\\tyou too arrogant, or do you think that you are one of the exalted\\n\\t\\t\\tones?\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "76",
    "Text": "Iblees said: \"I am better than him: You created me from fire and\\n\\t\\t\\tcreated him from clay.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "77",
    "Text": "Allah said: \"Get out of here: for you are accursed,"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "78",
    "Text": "and My curse shall be on you till the Day of Judgement.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "79",
    "Text": "Iblees said: \"O Rabb! Then give me respite till the Day of\\n\\t\\t\\tResurrection.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "80",
    "Text": "Allah said: \"Well, you are given respite"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "81",
    "Text": "till the Day of Appointed Time.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "82",
    "Text": "Iblees said: \"I swear by Your Honor, I will mislead them all"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "83",
    "Text": "except your chosen sincere devotees among them.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "84",
    "Text": "Allah said: \"Fair enough and now what I am going to say is also\\n\\t\\t\\tfair:"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "85",
    "Text": "that I will fill hell with you and all of those who follow you\\n\\t\\t\\tamong them.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "86",
    "Text": "O Prophet, tell them: \"I do not ask you any recompense for\\n\\t\\t\\tconveying this Message, nor do I pretend to be what I am not."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "87",
    "Text": "This Qur'an is nothing but a Reminder to all the Worlds;"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "88",
    "Text": "and before long, you will certainly know its truth.\""
  }
]
