[
  {
    "SurahNumber": "61",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "Lit., \"Why do you say what you do not do?\" In the first\\n\\t\\t\\t\\tinstance, this may be an allusion to such of the\\n\\t\\t\\t\\tProphet's Companions as had retreated in disorder from\\n\\t\\t\\t\\ttheir battle stations at Uhud (see surah {3}, note [90])\\n\\t\\t\\t\\tdespite their previous assertions that they were ready to\\n\\t\\t\\t\\tlay down their lives in the cause of God and His Apostle.\\n\\t\\t\\t\\tIn a wider sense, the passage is addressed to all those\\n\\t\\t\\t\\twho claim that they are willing to live up to anything\\n\\t\\t\\t\\tthat the divine writ declares to be desirable, and then\\n\\t\\t\\t\\tfall short of this determination."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "4",
    "NoteID": "2",
    "Body": "I.e., in unison, with their deeds corresponding to their\\n\\t\\t\\t\\tassertions of faith. This moral necessity is further\\n\\t\\t\\t\\tillustrated - by its opposite - in the subsequent\\n\\t\\t\\t\\treference to Moses and the recalcitrant among his\\n\\t\\t\\t\\tfollowers."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "Sc., \"by admitting that I speak in the name of God, and\\n\\t\\t\\t\\tacting contrary to this your assertion\": an allusion to\\n\\t\\t\\t\\tthe many instances of the contrariness and rebelliousness\\n\\t\\t\\t\\tof the children of Israel evident from their own\\n\\t\\t\\t\\tscriptures."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "Thus, persistence in wrong actions is bound to react on\\n\\t\\t\\t\\tman's beliefs as well. As regards God's \"letting their\\n\\t\\t\\t\\thearts swerve from the truth\", see surah {14}, note [4].\\n\\t\\t\\t\\tCf. also the oft-recurring reference to God's \"sealing\" a\\n\\t\\t\\t\\tsinner's heart explained in note [7] on  2:7 ."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "Lit., \"whatever there is between my hands\" - a phrase\\n\\t\\t\\t\\texplained in surah {3}, note [3]."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "This prediction is supported by several references in the\\n\\t\\t\\t\\tGospel of St. John to the Parakletos (usually rendered as\\n\\t\\t\\t\\t\"Comforter\") who was to come after Jesus. This\\n\\t\\t\\t\\tdesignation is almost certainly a corruption of\\n\\t\\t\\t\\tPeriklytos (\"the Much-Praised\"), an exact Greek\\n\\t\\t\\t\\ttranslation of the Aramaic term or name Mawhamana. (It is\\n\\t\\t\\t\\tto be borne in mind that Aramaic was the language used in\\n\\t\\t\\t\\tPalestine at the time of, and for some centuries after,\\n\\t\\t\\t\\tJesus, and was thus undoubtedly the language in which the\\n\\t\\t\\t\\toriginal - now lost - texts of the Gospels were\\n\\t\\t\\t\\tcomposed.) In view of the phonetic closeness of\\n\\t\\t\\t\\tPeriklytos and Parakletos it is easy to understand how\\n\\t\\t\\t\\tthe translator - or, more probably, a later scribe -\\n\\t\\t\\t\\tconfused these two expressions. It is significant that\\n\\t\\t\\t\\tboth the Aramaic Mawhamana and the Greek Periklytos have\\n\\t\\t\\t\\tthe same meaning as the two names of the Last Prophet,\\n\\t\\t\\t\\tMuhammad and Ahmad, both of which are derived from the\\n\\t\\t\\t\\tverb hamida (\"he praised\") and the noun hamd (\"praise\").\\n\\t\\t\\t\\tAn even more unequivocal prediction of the advent of the\\n\\t\\t\\t\\tProphet Muhammad - mentioned by name, in its Arabic form\\n\\t\\t\\t\\t- is said to be forthcoming from the so-called Gospel of\\n\\t\\t\\t\\tSt. Barnabas, which, though now regarded as apocryphal,\\n\\t\\t\\t\\twas accepted as authentic and was read in the churches\\n\\t\\t\\t\\tuntil the year 496 of the Christian era, when it was\\n\\t\\t\\t\\tbanned as \"heretical\" by a decree of Pope Gelasius.\\n\\t\\t\\t\\tHowever, since the original text of that Gospel is not\\n\\t\\t\\t\\tavailable (having come down to us only in an Italian\\n\\t\\t\\t\\ttranslation dating from the late sixteenth century), its\\n\\t\\t\\t\\tauthenticity cannot be established with certainty."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "6",
    "NoteID": "7",
    "Body": "I.e., to the later followers of the Bible."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "6",
    "NoteID": "8",
    "Body": "Alluding to the Qur'an (see {74:24-25} and the\\n\\t\\t\\t\\tcorresponding note [12])."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "8",
    "NoteID": "9",
    "Body": "Lit., \"with their mouths\" - i.e., by describing God's\\n\\t\\t\\t\\tmessage as \"nothing but spellbinding eloquence\" on the\\n\\t\\t\\t\\tpart of Muhammad."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "9",
    "NoteID": "10",
    "Body": "Cf  3:19  - \"the only [true] religion in the sight of God\\n\\t\\t\\t\\tis [man's] self-surrender unto Him\"."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "10",
    "NoteID": "11",
    "Body": "Cf.  9:111  - \"God has bought of the believers their\\n\\t\\t\\t\\tlives and their possessions, promising them paradise in\\n\\t\\t\\t\\treturn\" - which explains the metaphor of a \"bargain\"\\n\\t\\t\\t\\t(tijarah). My interpolation, between brackets, of the\\n\\t\\t\\t\\tphrase \"in this world and in the life to come\" is\\n\\t\\t\\t\\tjustified by the subsequent verses {12} and {13}, one of\\n\\t\\t\\t\\twhich relates to the hereafter, and the other to this\\n\\t\\t\\t\\tworld."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "12",
    "NoteID": "12",
    "Body": "For this rendering of 'adn, see note [45] on  38:50 ."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "13",
    "NoteID": "13",
    "Body": "Some of the commentators see in this promise of victory a\\n\\t\\t\\t\\tprediction of actual, warlike conquests by the Muslims.\\n\\t\\t\\t\\tIt is, however, much more probable that it relates to a\\n\\t\\t\\t\\tspiritual victory of the Qur'anic message, and its spread\\n\\t\\t\\t\\tamong people who had not previously understood it."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "14",
    "NoteID": "14",
    "Body": "For this rendering of al-hawariyyun, see surah {3}, note\\n\\t\\t\\t\\t[42]."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "14",
    "NoteID": "15",
    "Body": "I.e., some of them recognized him as a prophet - and,\\n\\t\\t\\t\\ttherefore, as no more than a created, human being -\\n\\t\\t\\t\\twhereas others denied this truth in the course of time by\\n\\t\\t\\t\\tregarding him as \"the son of God\" - and, therefore, as\\n\\t\\t\\t\\t\"God incarnate\" - while still others rejected him and his\\n\\t\\t\\t\\tmessage altogether. The fact that the earliest followers\\n\\t\\t\\t\\tof Jesus regarded him as purely human is evident from the\\n\\t\\t\\t\\tmany theological controversies which persisted during the\\n\\t\\t\\t\\tfirst three or four centuries of the Christian era. Thus,\\n\\t\\t\\t\\tsome renowned theologians, like Theodotus of Byzantium,\\n\\t\\t\\t\\twho lived towards the end of the second century, and his\\n\\t\\t\\t\\tfollowers - among them Paul of Samosata, Bishop of\\n\\t\\t\\t\\tAntioch in the year 260 - maintained that the \"sonship of\\n\\t\\t\\t\\tGod\" mentioned in the then-existing texts of the Gospels\\n\\t\\t\\t\\twas purely symbolic, denoting no more than that Jesus was\\n\\t\\t\\t\\ta human being exalted by God. The originally widespread\\n\\t\\t\\t\\tteachings of Bishop Arius (280-326) centred in the\\n\\t\\t\\t\\tconcept of Jesus as a mortal man chosen by God for a\\n\\t\\t\\t\\tspecific task, and in the concept of God as absolutely\\n\\t\\t\\t\\tOne, unknowable, and separate from every created being;\\n\\t\\t\\t\\tthis doctrine, however, was ultimately condemned by the\\n\\t\\t\\t\\tCouncils of Nicaea (325) and Constantinople (381), and\\n\\t\\t\\t\\tgradually ceased to have any influence on the Christian\\n\\t\\t\\t\\tmasses."
  },
  {
    "SurahNumber": "61",
    "AyahNumber": "14",
    "NoteID": "16",
    "Body": "I.e., all who truly believe in Jesus as God's Apostle\\n\\t\\t\\t\\tand, thus, as a forerunner of the Last Prophet, Muhammad,\\n\\t\\t\\t\\twhose message confirms and expands the true message of\\n\\t\\t\\t\\tJesus."
  }
]
