[
  {
    "SurahNumber": "57",
    "AyahNumber": "1",
    "Text": "All that is in the heavens and the earth glorifies Allah, and He\\n\\t\\t\\tis the All-Mighty, the All-Wise."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "2",
    "Text": "To Him belongs the kingdom of the heavens and the earth; it is He\\n\\t\\t\\tWho gives life and causes death; and He has power over all\\n\\t\\t\\tthings."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "3",
    "Text": "He is the First and the Last, the Evident and the Immanent, and\\n\\t\\t\\tHe has the knowledge of all things."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "4",
    "Text": "It is He Who created the heavens and the earth in six periods,\\n\\t\\t\\tthen firmly established Himself on the throne of authority. He\\n\\t\\t\\tknows all that enters the earth and all that emerges from it, all\\n\\t\\t\\tthat comes down from Heaven and all that ascends to it; and He is\\n\\t\\t\\twith you wherever you are. Allah is aware of all your actions."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "5",
    "Text": "To Him belongs the kingdom of the heavens and the earth, and all\\n\\t\\t\\taffairs go back to Allah for decision."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "6",
    "Text": "He causes the night to pass into the day and the day to pass into\\n\\t\\t\\tthe night, and He has knowledge of the inmost secrets of your\\n\\t\\t\\thearts."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "7",
    "Text": "Believe in Allah and His Rasool and spend in charity out of what\\n\\t\\t\\tyou have been made the inheritors of, for those of you who\\n\\t\\t\\tbelieve and spend in charity shall be richly rewarded."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "8",
    "Text": "What is the matter with you that you do not believe in Allah,\\n\\t\\t\\twhereas the Rasool is inviting you to believe in your Rabb, Who\\n\\t\\t\\thas indeed taken your covenant, if you are true men of faith?"
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "9",
    "Text": "He it is Who sends clear revelations to His servant, so that he\\n\\t\\t\\tmay lead you from the depths of darkness into the light. Surely\\n\\t\\t\\tAllah is Most Kind and Most Merciful to you."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "10",
    "Text": "What is the matter with you that you do not spend in the Way of\\n\\t\\t\\tAllah, whereas to Allah belongs the inheritance of the heavens\\n\\t\\t\\tand the earth? Those of you who spent and fought in the Cause of\\n\\t\\t\\tAllah before the victory, shall receive higher ranks of honor\\n\\t\\t\\tthan the others who spent and fought thereafter. Yet Allah has\\n\\t\\t\\tpromised you all a good reward, and Allah is aware of all your\\n\\t\\t\\tactions."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "11",
    "Text": "Who is the one that will give to Allah a goodly loan, so that He\\n\\t\\t\\tmay increase it manifold to his credit and give him a liberal\\n\\t\\t\\treward besides it."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "12",
    "Text": "On the Day of Judgement you shall see the true believing men and\\n\\t\\t\\tthe believing women, with their light shining before them and on\\n\\t\\t\\ttheir right hands, and it will be said to them: \"Rejoice today,\\n\\t\\t\\tyou shall enter the gardens beneath which rivers flow, in which\\n\\t\\t\\tyou shall live forever, and that is the highest achievement.\""
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "13",
    "Text": "On that Day the hypocrite men and hypocrite women will say to the\\n\\t\\t\\ttrue believers: \"Wait for us, that we may borrow some of your\\n\\t\\t\\tlight.\" But they will be told: \"Go away! Seek your light\\n\\t\\t\\telsewhere.\" So a wall with a gate shall be set up between them.\\n\\t\\t\\tInside there shall be mercy, and outside all along there shall be\\n\\t\\t\\tpunishment of hell."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "14",
    "Text": "They will call out the believers, saying: \"Were we not on your\\n\\t\\t\\tside?\" \"Yes,\" they will reply, \"but you led yourselves into\\n\\t\\t\\ttemptation, you wavered, you doubted, and were deceived by your\\n\\t\\t\\tvain desires until Allah's command came, while the arch-deceiver\\n\\t\\t\\t(shaitan) deceived you concerning Allah till the last moment.\""
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "15",
    "Text": "They will be told, \"Today no ransom shall be accepted from you,\\n\\t\\t\\tor from the unbelievers. Your abode is the fire: which you have\\n\\t\\t\\tjustly earned, and it is an evil refuge.\""
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "16",
    "Text": "Has not the time arrived for the believers to submit with fervent\\n\\t\\t\\thearts to Allah's warning and to the truth He has revealed, so\\n\\t\\t\\tthat they may not become like those who were given the Book\\n\\t\\t\\tbefore this, even though their term was prolonged for them but\\n\\t\\t\\ttheir hearts became hardened? Today most among them are\\n\\t\\t\\ttransgressors."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "17",
    "Text": "You should know that Allah restores the earth to life after its\\n\\t\\t\\tdeath. We have spelled out Our revelations for you, so that you\\n\\t\\t\\tmay understand."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "18",
    "Text": "Surely the charitable men and the charitable women, and those who\\n\\t\\t\\tgive a goodly loan to Allah, shall be repaid manifold, and also\\n\\t\\t\\tbe given a liberal reward besides it."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "19",
    "Text": "Those who believe in Allah and His Rasool, they are the truthful\\n\\t\\t\\tand the true witnesses in the sight of their Rabb; they shall\\n\\t\\t\\thave their reward and their light. But those who disbelieve and\\n\\t\\t\\treject Our revelations; they shall be the inmates of hellfire."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "20",
    "Text": "You should know that the life of this world is only play and\\n\\t\\t\\tamusement, a show and boasting among yourselves, a quest for\\n\\t\\t\\tgreater riches and more children. Its similitude is that of\\n\\t\\t\\tvegetation that flourish after rain: the growth of which delights\\n\\t\\t\\tthe tillers, then it withers and you see it turn yellow, soon it\\n\\t\\t\\tbecomes dry and crumbles away. In the hereafter there will be\\n\\t\\t\\teither severe punishment or forgiveness from Allah and His good\\n\\t\\t\\tpleasure. The life of this world is nothing but an illusion."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "21",
    "Text": "Therefore, hastenly strive for the forgiveness of your Rabb and\\n\\t\\t\\tfor the paradise which is as vast as the heaven and the earth,\\n\\t\\t\\tprepared for those who believe in Allah and His Rasools. Such is\\n\\t\\t\\tthe grace of Allah, which He bestows on whom He pleases, and\\n\\t\\t\\tAllah is the Owner of mighty grace."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "22",
    "Text": "No affliction can happen on earth nor to your souls, which is not\\n\\t\\t\\trecorded in a Book, before We bring it into existence; surely\\n\\t\\t\\tthat is easy for Allah."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "23",
    "Text": "This is done so that you may not grieve for the things that you\\n\\t\\t\\tmiss, or be overjoyed at what you gain; for Allah does not love\\n\\t\\t\\tany vainglorious boaster,"
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "24",
    "Text": "nor those who, being stingy themselves, enjoin others to be\\n\\t\\t\\tstingy also. He that gives no heed should know that Allah is free\\n\\t\\t\\tof all needs, worthy of all praises."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "25",
    "Text": "Surely We sent Our Rasools with clear signs, and sent down with\\n\\t\\t\\tthem the Book and the Scales of Justice, so that men may conduct\\n\\t\\t\\tthemselves with fairness. We also sent down Iron, with its mighty\\n\\t\\t\\tstrength and diverse uses for mankind, so that Allah may know\\n\\t\\t\\tthose who will help Him, though unseen, and help His Rasools.\\n\\t\\t\\tSurely Allah is All-Powerful, All-Mighty."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "26",
    "Text": "We sent Nuh (Noah) and Ibrahim (Abraham), and bestowed among\\n\\t\\t\\ttheir descendants Prophethood and the Book. Some of them adopted\\n\\t\\t\\tthe right guidance, but most of them were transgressors."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "27",
    "Text": "After them We sent other Rasools, one after the other, and\\n\\t\\t\\tfollowed them with Isa (Jesus) the son of Maryam. We gave him The\\n\\t\\t\\tInjeel (Gospel), and put compassion and mercy into the hearts of\\n\\t\\t\\this followers. As for monasticism, they instituted it themselves\\n\\t\\t\\t- for We did not enjoin it on them - in order to seek the good\\n\\t\\t\\tpleasure of Allah, but they did not observe it as it should have\\n\\t\\t\\tbeen observed. Yet We rewarded those among them who were true\\n\\t\\t\\tbelievers, but most of them are transgressors."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "28",
    "Text": "O believers! Fear Allah and believe in His Rasool (Muhammad,\\n\\t\\t\\tpeace be upon him). He will grant you a double share of His\\n\\t\\t\\tmercy, provide for you a light to walk with and forgive you your\\n\\t\\t\\tsins. Allah is Oft-Forgiving, Most Merciful."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "29",
    "Text": "You should adopt this way so that the people of the Book may know\\n\\t\\t\\tthat they do not have the sole right to the grace of Allah, and\\n\\t\\t\\tthat His grace is entirely in His own hands, which He bestows on\\n\\t\\t\\twhomever He wills: and Allah is the Owner of mighty grace."
  }
]
