[
  {
    "SurahNumber": "90",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "Lit., \"while thou art dwelling in this land\". The\\n\\t\\t\\t\\tclassical commentators give to the term balad the\\n\\t\\t\\t\\tconnotation of \"city\", and maintain that the phrase hadha\\n\\t\\t\\t\\t'l-balad (\"this city\") signifies Mecca, and that the\\n\\t\\t\\t\\tpronoun \"thou\" in the second verse refers to Muhammad.\\n\\t\\t\\t\\tAlthough this interpretation is plausible in view of the\\n\\t\\t\\t\\tfact that the sacredness of Mecca is repeatedly stressed\\n\\t\\t\\t\\tin the Qur'an, the sequence - as well as the tenor of the\\n\\t\\t\\t\\twhole surah - seems to warrant a wider, more general\\n\\t\\t\\t\\tinterpretation. In my opinion, the words hadha 'l-balad\\n\\t\\t\\t\\tdenote \"this land of man\", i.e., the earth (which latter\\n\\t\\t\\t\\tterm is, according to all philologists, one of the\\n\\t\\t\\t\\tprimary meanings of balad). Consequently, the \"thou\" in\\n\\t\\t\\t\\tverse {2} relates to man in general, and that which is\\n\\t\\t\\t\\tmetaphorically \"called to witness\" is his earthly\\n\\t\\t\\t\\tenvironment."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Lit., \"the begetter and that which he has begotten\".\\n\\t\\t\\t\\tAccording to Tabari's convincing explanation, this phrase\\n\\t\\t\\t\\tsignifies \"every parent and all their offspring\" - i.e.,\\n\\t\\t\\t\\tthe human race from its beginning to its end. (The\\n\\t\\t\\t\\tmasculine form al-walid denotes, of course, both male and\\n\\t\\t\\t\\tfemale parents.)"
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "The term kabad, comprising the concepts of \"pain\",\\n\\t\\t\\t\\t\"distress\", \"hardship\", \"toil\", \"trial\" etc., can be\\n\\t\\t\\t\\trendered only by a compound expression like the one\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "6",
    "NoteID": "4",
    "Body": "Implying that his resources - and, therefore, his\\n\\t\\t\\t\\tpossibilities - are inexhaustible. We must remember that\\n\\t\\t\\t\\tthe term \"man\" is used here in the sense of \"human race\":\\n\\t\\t\\t\\thence, the above boast is a metonym for the widespread\\n\\t\\t\\t\\tbelief - characteristic of all periods of religious\\n\\t\\t\\t\\tdecadence - that there are no limits to the power to\\n\\t\\t\\t\\twhich man may aspire, and that, therefore, his worldly\\n\\t\\t\\t\\t\"interests\" are the only criteria of right and wrong."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "I.e., \"Does he think that he is responsible to none but\\n\\t\\t\\t\\thimself?\""
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "9",
    "NoteID": "6",
    "Body": "I.e., to recognize and to voice the truth of God's\\n\\t\\t\\t\\texistence or, at least, to ask for guidance."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "13",
    "NoteID": "7",
    "Body": "Thus 'Ikrimah, as quoted by Baghawi; also Razi.\\n\\t\\t\\t\\tAlternatively, the phrase fakk raqabah may be rendered as\\n\\t\\t\\t\\t\"the freeing of a human being from bondage\" (cf. note\\n\\t\\t\\t\\t[146] on  2:177 ), with the latter term covering all\\n\\t\\t\\t\\tthose forms of subjugation and exploitation - social,\\n\\t\\t\\t\\teconomic or political which can be rightly described as\\n\\t\\t\\t\\t\"slavery\"."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "18",
    "NoteID": "8",
    "Body": "Lit., \"people (ashab) of the right side\",: see note [25]\\n\\t\\t\\t\\ton  74:39 ."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "20",
    "NoteID": "9",
    "Body": "I.e., the fires of despair in the life to come \"rising\\n\\t\\t\\t\\tover the [sinners'] hearts\" and \"closing in upon them\":\\n\\t\\t\\t\\tcf. {104:6-8} and the corresponding note [5]. The phrase\\n\\t\\t\\t\\trendered by me as \"such as have lost themselves in evil\"\\n\\t\\t\\t\\treads, literally, \"people of the left side\\n\\t\\t\\t\\t(al-mash'amah)\"."
  }
]
