[
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "1",
    "sectionHeading": "The Prohibition against Relieving Oneself Facing the Qibla",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha that Rafiibn Ishaq, a mawla of the family\\n\\t\\t\\t\\tof ash-Shifa who was known as the mawla of Abu Talha,\\n\\t\\t\\t\\theard Abu Ayyub al-Ansari, one of the companions of the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, while he was in Egypt, \"By Allah! I don't\\n\\t\\t\\t\\tknow how to deal with these lavatories.\" The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"When you go to defecate or urinate, do not expose your\\n\\t\\t\\t\\tgenitals towards the qibla, and do not put your back to\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "2",
    "sectionHeading": "The Prohibition against Relieving Oneself Facing the Qibla",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from one of the Ansar that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade defecating or urinating while facing the\\n\\t\\t\\t\\tqibla.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t14.2 Permission to Face the Qibla when Urinating or\\n\\t\\t\\t\\tDefecating\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "3",
    "sectionHeading": "Permission to Face the Qibla when Urinating or Defecating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Yahya ibn Habban from his paternal uncle,\\n\\t\\t\\t\\tWasi ibn Habban, that Abdullah ibn Umar said, \"People\\n\\t\\t\\t\\tsay, 'When you sit to relieve yourself, do not face the\\n\\t\\t\\t\\tqibla or the Bayt al-Maqdis.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah continued, \"I went upon top of a house of ours\\n\\t\\t\\t\\tand saw the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, (squatting) on two unfired bricks facing\\n\\t\\t\\t\\tthe Bayt al-Maqdis, relieving himself.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Umar added, \"Perhaps you are one of those who pray\\n\\t\\t\\t\\tfolded on their haunches.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWasi replied, \"I don't know, by Allah!\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that he meant som one who, when he prostrated,\\n\\t\\t\\t\\tkept his body close to the ground.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "4",
    "sectionHeading": "The Prohibition against Spitting towards the Qibla",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, saw spittle on the wall of the qibla\\n\\t\\t\\t\\tand scraped it off. Then he went up to the people and\\n\\t\\t\\t\\tsaid, \"Do not spit in front of you when you are praying,\\n\\t\\t\\t\\tbecause Allah, the Blessed and Exalted, is in front of\\n\\t\\t\\t\\tyou when you pray.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "5",
    "sectionHeading": "The Prohibition against Spitting towards the Qibla",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from A'isha, the wife of the Prophet, mayAllah\\n\\t\\t\\t\\tbless him and grant him peace, that the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, saw spittle, or\\n\\t\\t\\t\\tmucus or phlegm, on the wall of the qibla and scraped it\\n\\t\\t\\t\\toff.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "6",
    "sectionHeading": "The Prohibition against Spitting towards the Qibla",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tthat Abdullah ibn Umar said, \"On one occasion when the\\n\\t\\t\\t\\tpeople were praying subhat Quba a man came to them and\\n\\t\\t\\t\\tsaid, 'A piece of Qur'an was sent down to the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, last\\n\\t\\t\\t\\tnight, and he was ordered to face the Kaba, so face it.'\\n\\t\\t\\t\\tThey had been facing ash-Sham, so they turned round and\\n\\t\\t\\t\\tfaced the Kaba.''\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "7",
    "sectionHeading": "The Prohibition against Spitting towards the Qibla",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, prayed towards the\\n\\t\\t\\t\\tBaytal-Maqdis for sixteen months after arriving in\\n\\t\\t\\t\\tMadina. Then the qibla was moved, two months before the\\n\\t\\t\\t\\tbattle of Badr. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "8",
    "sectionHeading": "The Prohibition against Spitting towards the Qibla",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Umar ibn\\n\\t\\t\\t\\tal-Khattab said, \"Any direction that is between east and\\n\\t\\t\\t\\twest can be taken as a qibla if the person praying is\\n\\t\\t\\t\\tface-on to the House.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "9",
    "sectionHeading": "Concerning the Mosque of the Prophet, may Allah Bless Him and Grant Him Peace",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Rabah and\\n\\t\\t\\t\\tUbaydullah ibn Abi Abdullah Salman al-Agharr from Abu\\n\\t\\t\\t\\tHurayra that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"A prayer in this mosque of\\n\\t\\t\\t\\tmine is better than a thousand prayers in any other\\n\\t\\t\\t\\tmosque, except the Masjid al-Haram (in Makka).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "10",
    "sectionHeading": "Concerning the Mosque of the Prophet, may Allah Bless Him and Grant Him Peace",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Khubayb ibn Abd\\n\\t\\t\\t\\tar-Rahman from Hafs ibn Asim from Abu Hurayra or from Abu\\n\\t\\t\\t\\tSaid al-Khudri that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"What is between my\\n\\t\\t\\t\\thouse and my mimbar is one of the meadows of the Garden,\\n\\t\\t\\t\\tand my mimbar is on my watering-place (al-Hawd).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "11",
    "sectionHeading": "Concerning the Mosque of the Prophet, may Allah Bless Him and Grant Him Peace",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tfrom Abbad ibn Tamim from Abdullah ibn Zayd al-Mazini\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"What is between my house and my\\n\\t\\t\\t\\tmimbar is one of the meadows of the Garden.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "12",
    "sectionHeading": "Concerning Women Going Out to the Mosque",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar said, \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, 'Do not forbid\\n\\t\\t\\t\\tthe female slaves of Allah from (going into) the mosques\\n\\t\\t\\t\\tof Allah.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "13",
    "sectionHeading": "Concerning Women Going Out to the Mosque",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard from\\n\\t\\t\\t\\tBusr ibn Said that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"None of you women\\n\\t\\t\\t\\tshould use perfume when you are present at the isha\\n\\t\\t\\t\\tprayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "14",
    "sectionHeading": "Concerning Women Going Out to the Mosque",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAtika bint Zayd ibn Amr ibn Nufayl, the wife of Umar ibn\\n\\t\\t\\t\\tal-Khattab, used to ask Umar ibn al-Khattab for\\n\\t\\t\\t\\tpermission to go to the mosque. He would keep silent, so\\n\\t\\t\\t\\tshe would say, \"By Allah, I will go out, unless you\\n\\t\\t\\t\\tforbid me,\" and he would not forbid her.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "14",
    "hadithNumber": "15",
    "sectionHeading": "Concerning Women Going Out to the Mosque",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAmra bint Abd ar-Rahman that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"If the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, had seen what women do now, he would have\\n\\t\\t\\t\\tforbidden them to go into the mosques,\\tjust as the women\\n\\t\\t\\t\\tof the Bani Israil were forbidden.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya ibn Said said that he asked Amra, \"Were the women\\n\\t\\t\\t\\tof the Bani Israil forbidden to go into the mosques?\" and\\n\\t\\t\\t\\tshe said, \"Yes.\"\\n\\t\\t\\t</p>"
  }
]
