[
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "1",
    "Text": "&#7716;&acirc;-M&#297;m."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "2",
    "Text": "&rsquo;A&#297;n-S&#297;n-Q&atilde;f."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "3",
    "Text": "And so you &#761;O Prophet&#762; are sent revelation, just like those before you, by Allah&mdash;the Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "4",
    "Text": "To Him belongs whatever is in the heavens and whatever is on the earth. And He is the Most High, the Greatest."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "5",
    "Text": "The heavens&nbsp;nearly burst, one above the other, &#761;in awe of Him&#762;. And the angels glorify the praises of their Lord, and seek forgiveness for those on earth. Surely Allah alone is the All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "6",
    "Text": "As for those who take other protectors besides Him, Allah is Watchful over them. And you &#761;O Prophet&#762; are not a keeper over them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "7",
    "Text": "And so We have revealed to you a Quran in Arabic, so you may warn the Mother of Cities<span class='fn' foot_note=29781>1</span>&nbsp;and everyone around it, and warn of the Day of Gathering&mdash;about which there is no doubt&mdash;&#761;when&#762; a group will be in Paradise and another in the Blaze."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "8",
    "Text": "Had Allah willed, He could have easily made all &#761;humanity&#762; into a single community &#761;of believers&#762;. But He admits into His mercy whoever He wills. And the wrongdoers will have no protector or helper."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "9",
    "Text": "How can they take protectors besides Him? Allah alone is the Protector. He &#761;alone&#762; gives life to the dead. And He &#761;alone&#762; is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "10",
    "Text": "&#761;Say to the believers, O &nbsp;Prophet,&#762; &ldquo;Whatever you may differ about, its judgment rests with Allah. That is Allah&mdash;my Lord. In Him I put my trust, and to Him I &#761;always&#762; turn.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "11",
    "Text": "&#761;He is&#762; the Originator of the heavens and the earth. He has made for you spouses from among yourselves, and &#761;made&#762; mates for cattle &#761;as well&#762;&mdash;multiplying you &#761;both&#762;. There is nothing like Him, for He &#761;alone&#762; is the All-Hearing, All-Seeing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "12",
    "Text": "To Him belong the keys &#761;of the treasuries&#762; of the heavens and the earth. He gives abundant or limited provisions to whoever He wills. Indeed, He has &#761;perfect&#762; knowledge of all things."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "13",
    "Text": "He has ordained for you &#761;believers&#762; the Way which He decreed for Noah, and what We have revealed to you &#761;O Prophet&#762; and what We decreed for Abraham, Moses, and Jesus,<span class='fn' foot_note=29782>1</span>&nbsp;&#761;commanding:&#762; &ldquo;Uphold the faith, and make no divisions in it.&rdquo; What you call the polytheists to is unbearable for them. Allah chooses for Himself whoever He wills, and guides to Himself whoever turns &#761;to Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "14",
    "Text": "They did not split &#761;into sects&#762; out of mutual envy until knowledge came to them.<span class='fn' foot_note=29783>1</span>&nbsp;Had it not been for a prior decree from your Lord for an appointed term,<span class='fn' foot_note=29784>2</span>&nbsp;the matter would have certainly been settled between them &#761;at once&#762;. And surely those who were made to inherit the Scripture<span class='fn' foot_note=29785>3</span>&nbsp;after them are truly in alarming doubt about this &#761;Quran&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "15",
    "Text": "Because of that, you &#761;O Prophet&#762; will invite &#761;all&#762;. Be steadfast as you are commanded, and do not follow their desires. And say, &ldquo;I believe in every Scripture Allah has revealed. And I am commanded to judge fairly among you. Allah is our Lord and your Lord. We will be accountable for our deeds and you for yours. There is no &#761;need for&#762; contention between us. Allah will gather us together &#761;for judgment&#762;. And to Him is the final return.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "16",
    "Text": "As for those who dispute about Allah after He is &#761;already&#762; acknowledged &#761;by many&#762;, their argument is futile in the sight of their Lord. Upon them is wrath, and they will suffer a severe punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "17",
    "Text": "It is Allah Who has revealed the Book with the truth and the balance &#761;of justice&#762;. You never know, perhaps the Hour is near."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "18",
    "Text": "Those who disbelieve in it &#761;ask to&#762; hasten it &#761;mockingly&#762;. But the believers are fearful of it, knowing that it is the truth. Surely those who dispute about the Hour have gone far astray."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "19",
    "Text": "Allah is Ever Kind to His servants. He provides &#761;abundantly&#762; to whoever He wills. And He is the All-Powerful, Almighty."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "20",
    "Text": "Whoever desires the harvest of the Hereafter, We will increase their harvest. And whoever desires &#761;only&#762; the harvest of this world, We will give them some of it, but they will have no share in the Hereafter."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "21",
    "Text": "Or do they have associate-gods who have ordained for them some &#761;polytheistic&#762; beliefs, which Allah has not authorized? Had it not been for &#761;prior&#762; decree on Judgment, the matter would have certainly been settled between them &#761;at once&#762;. And surely the wrongdoers will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "22",
    "Text": "You will see the wrongdoers fearful &#761;of the punishment&#762; for what they committed but it will be inevitable for them, whereas those who believe and do good will be in the lush Gardens of Paradise. They will have whatever they desire from their Lord. That is &#761;truly&#762; the greatest bounty."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "23",
    "Text": "That &#761;reward&#762; is the good news which Allah gives to His servants who believe and do good. Say, &#761;O Prophet,&#762; &ldquo;I do not ask you for a reward for this &#761;message&#762;&mdash;only honour for &#761;our&#762; kinship.&rdquo;<span class='fn' foot_note=29786>1</span>&nbsp;Whoever earns a good deed, We will increase it in goodness for them. Surely Allah is All-Forgiving, Most Appreciative."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "24",
    "Text": "Or do they say, &ldquo;He has fabricated a lie about Allah!&rdquo;? &#761;If you had,&#762; Allah would have sealed your heart, if He willed. And Allah wipes out falsehood and establishes the truth by His Words. He certainly knows best what is &#761;hidden&#762; in the heart."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "25",
    "Text": "He is the One Who accepts repentance from His servants and pardons &#761;their&#762; sins. And He knows whatever you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "26",
    "Text": "He responds to those who believe and do good, and increases their reward out of His grace. As for the disbelievers, they will suffer a severe punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "27",
    "Text": "Had Allah given abundant provisions to &#761;all&#762; His servants, they would have certainly transgressed throughout the land. But He sends down whatever He wills in perfect measure. He is truly All-Aware, All-Seeing of His servants."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "28",
    "Text": "He is the One Who sends down rain after people have given up hope, spreading out His mercy. He is the Guardian, the Praiseworthy."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "29",
    "Text": "And among His signs is the creation of the heavens and the earth, and all living beings He dispersed throughout both. And He is Most Capable of bringing all together whenever He wills."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "30",
    "Text": "Whatever affliction befalls you is because of what your own hands have committed. And He pardons much."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "31",
    "Text": "You can never escape &#761;Him&#762; on earth, nor do you have any protector or helper besides Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "32",
    "Text": "And among His signs are the ships like mountains &#761;sailing&#762; in the sea."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "33",
    "Text": "If He wills, He can calm the wind, leaving the ships motionless on the water. Surely in this are signs for whoever is steadfast, grateful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "34",
    "Text": "Or He can wreck the ships for what the people have committed&mdash;though He forgives much&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "35",
    "Text": "so those who dispute about Our signs may know that they have no refuge."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "36",
    "Text": "Whatever &#761;pleasure&#762; you have been given is &#761;no more than a fleeting&#762; enjoyment of this worldly life. But what is with Allah is far better and more lasting for those who believe and put their trust in their Lord;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "37",
    "Text": "who avoid major sins and shameful deeds, and forgive when angered;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "38",
    "Text": "who respond to their Lord, establish prayer, conduct their affairs by mutual consultation, and donate from what We have provided for them;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "39",
    "Text": "and who enforce justice when wronged."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "40",
    "Text": "The reward of an evil deed is its equivalent. But whoever pardons and seeks reconciliation, then their reward is with Allah. He certainly does not like the wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "41",
    "Text": "There is no blame on those who enforce justice after being wronged."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "42",
    "Text": "Blame is only on those who wrong people and transgress in the land unjustly. It is they who will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "43",
    "Text": "And whoever endures patiently and forgives&mdash;surely this is a resolve to aspire to."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "44",
    "Text": "And whoever Allah leaves to stray will have no guide after Him. You will see the wrongdoers, when they face the torment, pleading, &ldquo;Is there any way back &#761;to the world&#762;?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "45",
    "Text": "And you will see them exposed to the Fire, fully humbled out of disgrace, stealing glances &#761;at it&#762;. And the believers will say, &ldquo;The &#761;true&#762; losers are those who have lost themselves and their families on Judgment Day.&rdquo; The wrongdoers will certainly be in everlasting torment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "46",
    "Text": "They will have no protectors to help them against Allah. And whoever Allah leaves to stray, for them there is no way."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "47",
    "Text": "Respond to your Lord before the coming of a Day from Allah that cannot be averted. There will be no refuge for you then, nor &#761;grounds for&#762; denial &#761;of sins&#762;.<span class='fn' foot_note=29787>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "48",
    "Text": "But if they turn away, We have not sent you &#761;O Prophet&#762; as a keeper over them. Your duty is only to deliver &#761;the message&#762;. And indeed, when We let someone taste a mercy from Us, they become prideful &#761;because&#762; of it. But when afflicted with evil because of what their hands have done, then one becomes totally ungrateful.<span class='fn' foot_note=29788>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "49",
    "Text": "To Allah &#761;alone&#762; belongs the kingdom of the heavens and the earth. He creates whatever He wills. He blesses whoever He wills with daughters, and blesses whoever He wills with sons,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "50",
    "Text": "or grants both, sons and daughters, &#761;to whoever He wills&#762;, and leaves whoever He wills infertile. He is indeed All-Knowing, Most Capable."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "51",
    "Text": "It is not &#761;possible&#762; for a human being to have Allah communicate with them, except through inspiration, or from behind a veil, or by sending a messenger-angel to reveal whatever He wills by His permission. He is surely Most High, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "52",
    "Text": "And so We have sent to you &#761;O Prophet&#762; a revelation by Our command. You did not know of &#761;this&#762; Book and faith &#761;before&#762;. But We have made it a light, by which We guide whoever We will of Our servants. And you are truly leading &#761;all&#762; to the Straight Path&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "42",
    "AyahNumber": "53",
    "Text": "the Path of Allah, to Whom belongs whatever is in the heavens and whatever is on the earth. Surely to Allah all matters will return &#761;for judgment&#762;."
  }
]
