[
  {
    "SurahNumber": "5",
    "AyahNumber": "1",
    "Text": "O believers! Fulfil your contract obligations.\\t   All\\n\\t\\t\\tfour-legged animals from livestock are lawful to you other than\\n\\t\\t\\tthose which are hereby announced. However do not violate the\\n\\t\\t\\tprohibition of hunting while you are in Ihram (Hajj dress).\\n\\t\\t\\tIndeed Allah orders whatever He pleases."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "2",
    "Text": "O believers! Do not violate the sanctity of the Symbols of Allah:\\n\\t\\t\\tthe Sacred Month , the animals brought for sacrifice, the\\n\\t\\t\\tgarlands that mark such animals, and those people visiting the\\n\\t\\t\\tSacred House (Ka'bah) to seek the grace and good pleasure of\\n\\t\\t\\ttheir Rabb. When you put off your Ihram (pilgrimage is over) then\\n\\t\\t\\tyou are allowed to hunt. Let not the hatred of some people - who\\n\\t\\t\\tonce hindered you from the Sacred Mosque - incite you to commit\\n\\t\\t\\ttransgression. Cooperate with one another in righteousness and\\n\\t\\t\\tpiety, and do not cooperate in sin and transgression. Have fear\\n\\t\\t\\tof Allah. Allah is stern in punishment."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "3",
    "Text": "You are forbidden to eat the meat of any animal that dies by\\n\\t\\t\\titself (dead body), blood, the flesh of swine (pork) and that on\\n\\t\\t\\twhich any name other than Allah has been invoked; also that which\\n\\t\\t\\tis strangled to death , killed by a violent blow, killed by a\\n\\t\\t\\theadlong fall and of those beaten or gored to death; and that\\n\\t\\t\\twhich has been partly eaten by a wild animal unless you are able\\n\\t\\t\\tto slaughter it before its death; also that which is sacrificed\\n\\t\\t\\ton altars or is divided by raffling of arrows. All these are\\n\\t\\t\\tsinful acts. Today the unbelievers have given up all their hope\\n\\t\\t\\tof vanquishing your religion. Have no fear of them, fear Me.\\n\\t\\t\\tToday I have perfected your religion for you, completed my favor\\n\\t\\t\\tupon you and approved Al-Islam as a Deen (way of life for you).\\n\\t\\t\\tAnyone who is compelled by hunger to eat what is forbidden, not\\n\\t\\t\\tintending to commit sin, will find Allah Forgiving, Merciful."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "4",
    "Text": "They ask you what food is lawful for them, say: All good clean\\n\\t\\t\\tthings are lawful for you, as well as what you have taught your\\n\\t\\t\\thunting birds and beasts to catch, trained by you with the\\n\\t\\t\\tknowledge given to you by Allah. Eat what they catch and hold for\\n\\t\\t\\tyou, however, pronounce the name of Allah over it. Have fear of\\n\\t\\t\\tAllah. Allah is swift in settling the accounts."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "5",
    "Text": "Today all good clean things have been made lawful for you; and\\n\\t\\t\\tthe food of the People of the Book is also made lawful for you\\n\\t\\t\\tand your food is made lawful for them. Likewise, marriage with\\n\\t\\t\\tchaste free believing women and also chaste women among the\\n\\t\\t\\tPeople who were given the Book before you is made lawful for you,\\n\\t\\t\\tprovided that you give them their dowries and desire chastity,\\n\\t\\t\\tneither committing fornication nor taking them as mistresses.\\n\\t\\t\\tAnyone who commits Kufr with Iman (rejects faith), all his good\\n\\t\\t\\tdeeds will be in vain and in the Hereafter he will be one of the\\n\\t\\t\\tlosers."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "6",
    "Text": "O believers! When you rise up for Salah (prayer), wash your faces\\n\\t\\t\\tand your hands as far as the elbows, wipe your heads with wet\\n\\t\\t\\thands and wash your feet to the ankles. If you had an emission of\\n\\t\\t\\tsemen, then take a full bath. However, if you are sick or on a\\n\\t\\t\\tjourney or you have used the toilet or you had intercourse with\\n\\t\\t\\tyour women (your wife) and you do not find any water then resort\\n\\t\\t\\tto Tayammum - find clean soil and rub your faces and hands with\\n\\t\\t\\tit. Allah does not wish to burden you; He only wishes to purify\\n\\t\\t\\tyou and to perfect His favor upon you, so that you may be\\n\\t\\t\\tthankful."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "7",
    "Text": "Remember Allah's favor to you and the covenant which He ratified\\n\\t\\t\\twith you when you said: \"We hear and we obey.\" Have fear of\\n\\t\\t\\tAllah; surely Allah knows the secrets of your hearts."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "8",
    "Text": "O believers! Be steadfast for the sake of Allah and bear true\\n\\t\\t\\twitness and let not the enmity of a people incite you to do\\n\\t\\t\\tinjustice; do justice; that is nearer to piety. Fear Allah,\\n\\t\\t\\tsurely Allah is fully aware of all your actions."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "9",
    "Text": "Allah has promised those who believe and do righteous deeds,\\n\\t\\t\\tforgiveness and mighty reward."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "10",
    "Text": "As for those who reject faith and deny Our revelations, they will\\n\\t\\t\\tbe the companions of hellfire."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "11",
    "Text": "O believers! Also remember Allah's favor which He recently\\n\\t\\t\\tbestowed upon you when He restrained the hands of those who\\n\\t\\t\\tsought to harm you (Jewish plan to kill the Prophet and eminent\\n\\t\\t\\tcompanions through an invitation to a dinner which Allah informed\\n\\t\\t\\thim not to attend). Have fear of Allah; and in Allah let the\\n\\t\\t\\tbelievers put their trust."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "12",
    "Text": "Allah did in fact make a covenant with the Children of Israel and\\n\\t\\t\\tappointed twelve chieftains from among them and said: \"I am with\\n\\t\\t\\tyou; if you establish Salah (prayers) pay Zakah, believe in My\\n\\t\\t\\tRasools, support them and give a generous loan to Allah (spend in\\n\\t\\t\\tcharity), I will certainly forgive you your sins and admit you to\\n\\t\\t\\tgardens beneath which the rivers flow. However, if any one of\\n\\t\\t\\tyou, after this, violates this covenant, he will indeed go astray\\n\\t\\t\\tfrom the Right Way.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "13",
    "Text": "Even after that, they broke their covenant; as a result, We laid\\n\\t\\t\\ton them Our curse and hardened their hearts. They tempered with\\n\\t\\t\\twords out of their context and neglected much of what they were\\n\\t\\t\\tenjoined. You will always find most of them deceitful except for\\n\\t\\t\\ta few of them. Yet forgive them and overlook their misdeeds.\\n\\t\\t\\tAllah loves those who are kind to others."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "14",
    "Text": "Likewise We also made a covenant with those who call themselves\\n\\t\\t\\tChristians, but they too have neglected much of what they were\\n\\t\\t\\tenjoined. As a result, We stirred among them enmity and hatred,\\n\\t\\t\\twhich will last till the Day of Resurrection and soon Allah will\\n\\t\\t\\tinform them all of what they have done."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "15",
    "Text": "O people of the Book (Jews and Christians)! Now Our Rasool has\\n\\t\\t\\tcome to you to reveal much of what you have concealed from the\\n\\t\\t\\tHoly Books and to pass over much which is no longer necessary.\\n\\t\\t\\tThere has come to you from Allah a new Light and a clear Book,"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "16",
    "Text": "with which Allah will guide to the ways of peace all those who\\n\\t\\t\\tseek His good pleasure and bring them out of the depth of\\n\\t\\t\\tdarkness into the light of His grace and guide them to the Right\\n\\t\\t\\tWay."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "17",
    "Text": "Indeed those have committed Kufr (rejected faith) who said, \"God\\n\\t\\t\\tis the Messiah, son of Maryam.\" O Muhammad, ask them, \"Who has\\n\\t\\t\\tthe power to prevent Allah if He chose to destroy the Messiah the\\n\\t\\t\\tson of Maryam, his mother and all that is in the earth? Allah has\\n\\t\\t\\tthe sovereignty over the heavens and the earth and all that is\\n\\t\\t\\tbetween them. He creates what He pleases and has power over\\n\\t\\t\\teverything\"."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "18",
    "Text": "The Jews and the Christians say: \"We are the children of Allah\\n\\t\\t\\tand His beloved ones.\" Ask them, \"Why then does He punish you for\\n\\t\\t\\tyour sins? Nay! In fact you are human beings like others which He\\n\\t\\t\\thas created. He forgives whom He pleases and He punishes whom He\\n\\t\\t\\tpleases. To Allah belongs the sovereignty of the heavens and the\\n\\t\\t\\tearth and all that is between them, and to Him is the final\\n\\t\\t\\trefuge.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "19",
    "Text": "O people of the Book! Indeed Our Rasool has now come to you\\n\\t\\t\\tmaking clear to you the teaching of the Right Way, after a long\\n\\t\\t\\tbreak in the series of the Rasools, so that you may not be able\\n\\t\\t\\tto say, \"No one has come to give us good news or to warn us.\" Now\\n\\t\\t\\tsomeone has come to give you good news and warn you so listen to\\n\\t\\t\\thim. Allah has power over everything."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "20",
    "Text": "Ponder upon the incident when Musa said to his people: \"O my\\n\\t\\t\\tpeople! Remember the favors which Allah has bestowed upon you. He\\n\\t\\t\\thas raised Prophets from among you, made you kings and gave you\\n\\t\\t\\tthat which had not been given to anyone in the worlds.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "21",
    "Text": "\"O my people! Enter the holy land which Allah has assigned for\\n\\t\\t\\tyou. Do not turn back, because if you do, you will become\\n\\t\\t\\tlosers.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "22",
    "Text": "They said: \"O Musa! A nation of giants live in there, we will not\\n\\t\\t\\tset our foot in it until they leave. As soon as they leave we\\n\\t\\t\\twill be ready to enter.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "23",
    "Text": "Thereupon two Allah-fearing men upon whom Allah had bestowed His\\n\\t\\t\\tGrace said: \"Attack directly at the city gate, once you enter it,\\n\\t\\t\\tyou will surely be victorious. Put your trust in Allah if you are\\n\\t\\t\\treally believers.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "24",
    "Text": "They replied, \"O Musa! We will never enter it so long as they\\n\\t\\t\\tremain therein. Therefore, both you and your Rabb should go and\\n\\t\\t\\tfight, we will stay here.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "25",
    "Text": "Hearing this Musa prayed, \"O my Rabb! I have no control over\\n\\t\\t\\tanyone except myself and my brother. Please, set us apart from\\n\\t\\t\\tthese disobedient people.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "26",
    "Text": "Allah responded, \"Very well, they are forbidden this land for\\n\\t\\t\\tforty years, during this time they will wander homeless on the\\n\\t\\t\\tearth, so do not grieve for these disobedient people.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "27",
    "Text": "Recite to them in all truth the story of Adam's two sons: How\\n\\t\\t\\teach offered a sacrifice, and how the offering of one was\\n\\t\\t\\taccepted while that of the other was not. The latter said: \"I\\n\\t\\t\\twill kill you.\" The former replied: \"Allah only accepts the\\n\\t\\t\\tsacrifice from the righteous."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "28",
    "Text": "Even if you stretch your hand to kill me, I shall not stretch my\\n\\t\\t\\thand to slay you, for I fear Allah, the Rabb of the worlds."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "29",
    "Text": "I intend to let you bear the burden of my sins as well as yours\\n\\t\\t\\tand thus become an inmate of the Fire which is the reward for\\n\\t\\t\\twrongdoers.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "30",
    "Text": "The latter's soul prompted him to kill his brother; he killed him\\n\\t\\t\\tand thus became one of the losers."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "31",
    "Text": "(He carried around the dead body of his brother and did not know\\n\\t\\t\\twhat to do with it.) Then Allah sent a raven, which dug the\\n\\t\\t\\tground to show him how to bury the dead body of his brother.\\n\\t\\t\\t\"Alas!\" He cried, \"I failed even to be like this raven to find\\n\\t\\t\\tsome way to dispose of the dead body of my brother!\" So he became\\n\\t\\t\\tfull of regrets."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "32",
    "Text": "On account of that incident, We ordained for the Children of\\n\\t\\t\\tIsrael that whoever kills a person, except as a punishment for\\n\\t\\t\\tmurder or mischief in the land, it will be written in his book of\\n\\t\\t\\tdeeds as if he had killed all the human beings on the surface of\\n\\t\\t\\tthe Earth and whoever will save a life shall be regarded as if he\\n\\t\\t\\tgave life to all the human beings on the surface of the Earth.\\n\\t\\t\\tYet, even though Our Rasools came to them one after the other\\n\\t\\t\\twith clear revelations, it was not long before, many of them\\n\\t\\t\\tcommitted excesses in the land."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "33",
    "Text": "The punishment for those who wage war against Allah and His\\n\\t\\t\\tRasool and strive to create mischief in the land is death or\\n\\t\\t\\tcrucifixion or the cutting off their hands and feet from opposite\\n\\t\\t\\tsides or exile from the land based on the gravity of their\\n\\t\\t\\toffense. This will be their humiliation in this world and in the\\n\\t\\t\\tHereafter they will have grievous punishment,"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "34",
    "Text": "except those who repent before you apprehend them, in such a\\n\\t\\t\\tcase, you should know that Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "35",
    "Text": "O believers! Fear Allah and seek the means to be closer to Him\\n\\t\\t\\tand make Jihad (struggle) in His Way so that you may be\\n\\t\\t\\tsuccessful."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "36",
    "Text": "As for those who are unbelievers, if they have everything that\\n\\t\\t\\tthe earth contains or twice as much to offer as a ransom to\\n\\t\\t\\tredeem themselves from the punishment of the Day of Resurrection,\\n\\t\\t\\tit will not be accepted from them and they shall have a painful\\n\\t\\t\\tpunishment."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "37",
    "Text": "They will desire to get out of the fire but will not be able to\\n\\t\\t\\tdo so and they shall have an everlasting punishment."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "38",
    "Text": "Male or female, whoever is guilty of theft, cut off the hand\\n\\t\\t\\t(that was used in theft) of either of them as a punishment for\\n\\t\\t\\ttheir crime. This is exemplary punishment ordained by Allah.\\n\\t\\t\\tAllah is Mighty, Wise."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "39",
    "Text": "But whoever repents after committing the crime and reforms his\\n\\t\\t\\tconduct, Allah will surely turn to him with forgiveness. Allah is\\n\\t\\t\\tForgiving, Merciful."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "40",
    "Text": "Don't you know that Allah has sovereignty over the heavens and\\n\\t\\t\\tthe earth? He may punish whom He pleases and forgive whom He\\n\\t\\t\\tpleases. Allah has power over everything."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "41",
    "Text": "O Rasool! Do not grieve for those who plunge headlong into\\n\\t\\t\\tunbelief; those who say with their tongues: We believe, but have\\n\\t\\t\\tno faith in their hearts; and do not grieve for those Jews, who\\n\\t\\t\\tlisten to lies and spy for other people who had never come to\\n\\t\\t\\tyou. They tamper with the words of Allah and take them out of\\n\\t\\t\\ttheir context and say: \"If you are given such and such\\n\\t\\t\\tcommandment, accept it; but if it is other than this, reject it.\"\\n\\t\\t\\tIf Allah intends to put anyone to trial, you have no authority in\\n\\t\\t\\tthe least to save him from Allah. Such people are those whose\\n\\t\\t\\thearts Allah does not desire to purify; they will have\\n\\t\\t\\thumiliation in this world and a grievous punishment in the\\n\\t\\t\\tHereafter."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "42",
    "Text": "That is because they listen to falsehood and eat what is\\n\\t\\t\\tforbidden. Therefore, if they come to you with their cases, you\\n\\t\\t\\tmay judge between them or refuse to do so. Even if you refuse,\\n\\t\\t\\tthey will not be able to harm you the least, but if you do act as\\n\\t\\t\\ta judge, judge between them with fairness, for Allah loves those\\n\\t\\t\\twho judge with fairness."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "43",
    "Text": "But why do they come to you for judgement when they have the\\n\\t\\t\\tTaurat which contains Allah's commandments? Yet they turn back\\n\\t\\t\\tafter that. In fact, they are not true believers."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "44",
    "Text": "Indeed We revealed the Taurat to Moses, in which there is\\n\\t\\t\\tguidance and light: By its laws, all the Prophets, who were\\n\\t\\t\\tMuslims, judged those who call themselves Jews and so did the\\n\\t\\t\\trabbis and jurists of law. They were entrusted the protection of\\n\\t\\t\\tAllah's Book and they themselves were witnesses. Have no fear of\\n\\t\\t\\tpeople; fear Me, and do not sell My revelations for a petty\\n\\t\\t\\tprice: those who do not judge by the law which Allah has\\n\\t\\t\\trevealed, are indeed kafirs (unbelievers)."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "45",
    "Text": "We ordained in Taurat for them: \"A life for a life, an eye for an\\n\\t\\t\\teye, a nose for a nose, an ear for an ear, a tooth for a tooth\\n\\t\\t\\tand for a wound an equal retaliation.\" But if anyone remits the\\n\\t\\t\\tretaliation by way of charity it will be an act of atonement for\\n\\t\\t\\thim; those who do not judge by the law which Allah has revealed,\\n\\t\\t\\tthey are the wrongdoers."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "46",
    "Text": "Then in the footsteps of those Prophets, We sent Isa (Jesus) the\\n\\t\\t\\tson of Maryam (Mary) confirming whatever remained intact from the\\n\\t\\t\\tTaurat in his time, and gave him the Injeel (Gospel) wherein was\\n\\t\\t\\tguidance and light, corroborating what was revealed in the\\n\\t\\t\\tTaurat; a guidance and an admonition to those who fear Allah."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "47",
    "Text": "Therefore, let the people who follow the Injeel (Gospel) judge by\\n\\t\\t\\tthe Law which Allah has revealed therein; those who do not judge\\n\\t\\t\\tby the Law which Allah has revealed, they are the transgressors."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "48",
    "Text": "To you, O Muhammad, We have revealed this Book with the truth. It\\n\\t\\t\\tconfirms whatever has remained intact in the scriptures which\\n\\t\\t\\tcame before it and also to safeguard it. Therefore, judge between\\n\\t\\t\\tpeople according to Allah's revelations and do not yield to their\\n\\t\\t\\tvain desires diverging from the truth which has come to you. We\\n\\t\\t\\thave ordained a law and a Way of life for each of you. If Allah\\n\\t\\t\\twanted He could have made all of you a single nation. But He\\n\\t\\t\\twilled otherwise in order to test you in what He has given you;\\n\\t\\t\\ttherefore try to excel one another in good deeds. Ultimately you\\n\\t\\t\\tall shall return to Allah; then He will show you the truth of\\n\\t\\t\\tthose matters in which you dispute."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "49",
    "Text": "So, O Muhammad, pronounce judgement among them according to the\\n\\t\\t\\tlaw which Allah has revealed and do not follow their vain\\n\\t\\t\\tdesires, and beware of them lest they tempt you away from a part\\n\\t\\t\\tof that which Allah has revealed to you. If they reject your\\n\\t\\t\\tjudgement, then know that it is Allah's wish to scourge them for\\n\\t\\t\\tsome of their sins. In fact most of the people are transgressors."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "50",
    "Text": "By rejecting the Divine Law do they wish to be judged by the laws\\n\\t\\t\\tof ignorance? Who is a better Judge than Allah for those who\\n\\t\\t\\tbelieve in Him?"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "51",
    "Text": "O believers! Take neither Jews nor Christians as your protecting\\n\\t\\t\\tfriends: they are only protecting friends of one another. Whoever\\n\\t\\t\\tof you disobeys this commandment will be counted as one of them.\\n\\t\\t\\tSurely Allah does not guide the wrongdoers."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "52",
    "Text": "You see that those who have the disease of hypocrisy in their\\n\\t\\t\\thearts move around in their camp saying: \"We fear lest a turn of\\n\\t\\t\\tfortune strike us.\" But soon when Allah gives you victory or a\\n\\t\\t\\tdecision according to His will, they will regret for what they\\n\\t\\t\\tare hiding in their hearts."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "53",
    "Text": "At that time the believers will say: \"Are these the same people\\n\\t\\t\\twho solemnly swore by Allah that they would stand beside you?\" As\\n\\t\\t\\ta result all their deeds will be voided and they will become\\n\\t\\t\\tlosers."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "54",
    "Text": "O believers! Whoever among you renounce Islam let him do so; soon\\n\\t\\t\\tAllah will replace them with others whom He will love and they\\n\\t\\t\\twill love Him, who will be humble towards the believers, mighty\\n\\t\\t\\tagainst the unbelievers, striving hard in the way of Allah, and\\n\\t\\t\\twill have no fear of reproach from any critic. Now this is the\\n\\t\\t\\tgrace of Allah which He bestows on whom He pleases. Allah has\\n\\t\\t\\tboundless knowledge."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "55",
    "Text": "Your real protecting friends are Allah, His Rasool, and the\\n\\t\\t\\tfellow believers - the ones who establish Salah, pay Zakah and\\n\\t\\t\\tbow down humbly before Allah."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "56",
    "Text": "Whoever makes Allah, His Rasool and the fellow believers his\\n\\t\\t\\tprotecting friends, must know that Allah's party will surely be\\n\\t\\t\\tvictorious."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "57",
    "Text": "O believers! Do not make your protecting friends those, from\\n\\t\\t\\tamong the people who were given the Book before you and the\\n\\t\\t\\tunbelievers, who have made your religion a mockery or pastime,\\n\\t\\t\\tfear Allah if you are true believers."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "58",
    "Text": "When you call for Salah (prayers) they make it as an object of\\n\\t\\t\\tmockery and pastime; this is because they are a people devoid of\\n\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "59",
    "Text": "Tell them: \"O people of the Book! What makes you against us other\\n\\t\\t\\tthan that we believe in Allah and in what has been revealed to us\\n\\t\\t\\tand what was revealed before? The fact is that most of you are\\n\\t\\t\\trebellious transgressors.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "60",
    "Text": "Ask them: \"Should I tell you of those who will have even worse\\n\\t\\t\\tthan this in retribution from Allah? They are those whom Allah\\n\\t\\t\\thas cursed; who have incurred His wrath; some of whom were turned\\n\\t\\t\\tinto apes and pigs; who worshipped Taghut (forces of Shaitan);\\n\\t\\t\\tthese are worse in rank and far more astray from the Right Way.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "61",
    "Text": "When they come to you they say: \"We believe\". But in fact,\\n\\t\\t\\tunbelievers they came and unbelievers they depart. Allah knows\\n\\t\\t\\tfully well what they hide in their hearts."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "62",
    "Text": "You will see many of them try to beat each other in sin and\\n\\t\\t\\trancor, and they consume what is unlawful. Evil indeed is what\\n\\t\\t\\tthey do."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "63",
    "Text": "Why don't their Rabbis and the Jurists of laws forbid them from\\n\\t\\t\\tuttering sinful words and eating unlawful things? Evil indeed are\\n\\t\\t\\ttheir deeds."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "64",
    "Text": "The Jews say: Allah's hand is tied up! - Nay! Their own hands\\n\\t\\t\\twill be tied up and they will be cursed for what they utter. Both\\n\\t\\t\\tof His hands are free; However, He spends as He pleases. The fact\\n\\t\\t\\tis that the revelations that have come to you from Allah will\\n\\t\\t\\tsurely make many of them increase in their wickedness and\\n\\t\\t\\tunbelief. We have stirred among them enmity and hatred till the\\n\\t\\t\\tDay of Resurrection. Every time they kindle the fire of war,\\n\\t\\t\\tAllah extinguishes it. Now they are striving to spread mischief\\n\\t\\t\\tin the land. Allah does not love those who do mischief."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "65",
    "Text": "If instead of this rebellious attitude the people of the Book had\\n\\t\\t\\tbelieved and become Godfearing, We would certainly have removed\\n\\t\\t\\ttheir iniquities and admitted them to the gardens of Bliss\\n\\t\\t\\t(Paradise)."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "66",
    "Text": "If they would have observed the Laws of Taurat and the Injeel\\n\\t\\t\\t(Gospel) and other Revelations which were sent to them from their\\n\\t\\t\\tRabb, they would have certainly enjoyed abundance from above and\\n\\t\\t\\tfrom beneath. Though there are some among them on the moderate\\n\\t\\t\\tcourse; but most of them do nothing but evil."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "67",
    "Text": "O Rasool! Deliver the message which has been revealed to you from\\n\\t\\t\\tyour Rabb, and if you do not, you are not doing justice to your\\n\\t\\t\\tmission. Allah will protect you from the mischief of the people.\\n\\t\\t\\tRest assured that Allah will not let the unbelievers succeed\\n\\t\\t\\tagainst you."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "68",
    "Text": "Tell them: O people of the Book! You have no ground to stand on\\n\\t\\t\\tunless you observe the Taurat (Torah), Injeel (Gospel) and other\\n\\t\\t\\trevelations that have come to you from your Rabb. This revelation\\n\\t\\t\\t(The Qur'an) which has come to you from your Rabb will surely\\n\\t\\t\\tincrease the rebellion and disbelief of many of them but you\\n\\t\\t\\tshould not grieve for the disbelievers."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "69",
    "Text": "Rest assured that the believers (Muslims), the Jews, the Sabians\\n\\t\\t\\tand the Christians - whoever believes in Allah and the Last Day\\n\\t\\t\\tand does righteous deeds - will have nothing to fear or to\\n\\t\\t\\tregret."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "70",
    "Text": "Certainly We took a covenant from the Children of Israel and sent\\n\\t\\t\\tthem Rasools. Whenever there came to them a Rasool with a message\\n\\t\\t\\tthat did not suit their fancies, either they called him an\\n\\t\\t\\timpostor or they put him to death."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "71",
    "Text": "They thought no affliction would follow; so they acted blind and\\n\\t\\t\\tdeaf. Yet Allah, in extreme mercy, accepted their repentance, but\\n\\t\\t\\tagain many acted blind and deaf towards the message of Allah.\\n\\t\\t\\tAllah is observant of their actions."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "72",
    "Text": "Certainly they have disbelieved who say: \"Allah is Christ the son\\n\\t\\t\\tof Maryam (Mary).\" While Christ himself said: \"O children of\\n\\t\\t\\tIsrael! Worship Allah, my Rabb and your Rabb.\" Whoever commits\\n\\t\\t\\tshirk (joins partners with Allah), Allah will deny him the\\n\\t\\t\\tparadise, and the hellfire will be his home. There will be no\\n\\t\\t\\thelper for the wrongdoers."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "73",
    "Text": "Certainly they are unbelievers who say: \"Allah is one of three in\\n\\t\\t\\ta Trinity.\" There is no god except One Allah. If they do not stop\\n\\t\\t\\tsaying what they say, a painful punishment will befall the\\n\\t\\t\\tdisbelievers among them."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "74",
    "Text": "Will they not then turn to Allah and seek His forgiveness? Allah\\n\\t\\t\\tis Forgiving, Merciful."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "75",
    "Text": "Christ, the son of Maryam, was no more than a Rasool; many\\n\\t\\t\\tRasools had already passed away before him. His mother was a\\n\\t\\t\\ttruthful woman; they both ate earthly food like other human\\n\\t\\t\\tbeings. See how the Revelations are made clear to them to know\\n\\t\\t\\treality; yet see how they ignore the truth!"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "76",
    "Text": "Ask them: \"Would you worship besides Allah someone who can\\n\\t\\t\\tneither harm nor benefit you? While Allah is He who hears all and\\n\\t\\t\\tknows all.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "77",
    "Text": "Tell them: \"O people of the Book! Do not transgress the bounds of\\n\\t\\t\\ttruth in your religion, and do not yield to the fancies of those\\n\\t\\t\\tpeople who went astray before you, They misled many others and\\n\\t\\t\\thave themselves strayed away from The Right Way."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "78",
    "Text": "Those who disbelieved from among the Children of Israel were\\n\\t\\t\\tcursed by the tongue of Dawood (David) and Isa (Jesus) the son of\\n\\t\\t\\tMaryam (Mary): because they disobeyed and committed excesses."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "79",
    "Text": "They would not forbid one another from committing iniquities;\\n\\t\\t\\tevil indeed were their deeds."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "80",
    "Text": "As you can see many of them are taking the side of the\\n\\t\\t\\tunbelievers. Evil is that, which their souls have sent forth for\\n\\t\\t\\tthem for the Hereafter. Because they have incurred the wrath of\\n\\t\\t\\tAllah, so in punishment, they are going to live forever."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "81",
    "Text": "Had they believed in Allah, in the Prophet, and in what was\\n\\t\\t\\trevealed to him, they would have never taken unbelievers as their\\n\\t\\t\\tprotecting friends instead of believers, but most of them are\\n\\t\\t\\trebellious transgressors."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "82",
    "Text": "You will find the most violent in enmity to the believers are the\\n\\t\\t\\tJews and the mushrikin (pagan Arabs); and nearest in affection to\\n\\t\\t\\tthe believers are those who say: \"We are Christians.\" That is\\n\\t\\t\\tbecause among them there are men that are priests and monks, who\\n\\t\\t\\tdo not behave arrogantly."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "83",
    "Text": "When they (monks and priests) listen to that which is revealed to\\n\\t\\t\\tthe Rasool, you can see their eyes filled with tears, because\\n\\t\\t\\tthey recognize the truth. They say: \"Our Rabb! We believe,\\n\\t\\t\\ttherefore, write us down among the witnesses of truth."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "84",
    "Text": "Why should not we believe in Allah and the truth which has come\\n\\t\\t\\tto us? Why should we not hope that our Rabb will admit us to the\\n\\t\\t\\tcompany of the righteous?\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "85",
    "Text": "And for their prayer Allah has rewarded them with gardens beneath\\n\\t\\t\\twhich the rivers flow to live therein forever. Such is the\\n\\t\\t\\trecompense of the righteous (who do good to others)."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "86",
    "Text": "As for those who reject and deny Our revelations, they shall\\n\\t\\t\\tbecome the inmates of hellfire."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "87",
    "Text": "O believers! Do not make unlawful those wholesome things which\\n\\t\\t\\tAllah has made lawful for you. Do not transgress; Allah does not\\n\\t\\t\\tlove the transgressors."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "88",
    "Text": "Eat of the lawful and wholesome things which Allah has provided\\n\\t\\t\\tfor you. Fear Allah, in Whom you believe."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "89",
    "Text": "Allah will not call you to account for what is inadvertent in\\n\\t\\t\\tyour oaths. But He will hold you accountable for that which you\\n\\t\\t\\tsolemnly swear. The penalty for a broken oath is to feed ten\\n\\t\\t\\tindigent persons with such food as you normally provide to your\\n\\t\\t\\town family, or to clothe ten needy people, or to free one slave.\\n\\t\\t\\tThe one who cannot afford any of these must fast three days. This\\n\\t\\t\\tis the expiation for breaking your oaths. Therefore, be mindful\\n\\t\\t\\tof your oaths. Thus Allah makes clear to you His revelations that\\n\\t\\t\\tyou may be thankful."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "90",
    "Text": "O believers! Intoxicants and gambling (games of chance),\\n\\t\\t\\tdedication to stones (paying tribute to idols) and division by\\n\\t\\t\\tarrows (lottery) are the filthy works of Shaitan. Get away from\\n\\t\\t\\tthem, so that you may prosper."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "91",
    "Text": "Shaitan desires to stir up enmity and hatred between you with\\n\\t\\t\\tintoxicants and gambling and to prevent you from the remembrance\\n\\t\\t\\tof Allah and from Salah (prayers). Will you not abstain?"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "92",
    "Text": "Obey Allah and obey the Rasool and abstain from these things. If\\n\\t\\t\\tyou do not, then you should know that Our Rasool's duty is only\\n\\t\\t\\tto pass on My message clearly."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "93",
    "Text": "There is no blame on those who believe and do good deeds for what\\n\\t\\t\\tthey ate in the past, provided they abstain from those things\\n\\t\\t\\twhich have been made unlawful, then remain steadfast in their\\n\\t\\t\\tbelief and do righteous deeds, then abstain themselves from\\n\\t\\t\\twhatever they are forbidden and believe in Divine Law, and then\\n\\t\\t\\tfear Allah and do good deeds. For Allah loves those who do good\\n\\t\\t\\tdeeds."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "94",
    "Text": "O believers! Allah will put you to trial by making game (that\\n\\t\\t\\twhich is to be hunted) well within the reach of your hands and\\n\\t\\t\\tyour spears, in order to see who fears Him, though unseen. There\\n\\t\\t\\tshall, therefore, be a painful punishment for those who\\n\\t\\t\\ttransgress after this warning."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "95",
    "Text": "O believers! Do not kill game while you are in Ihram (pilgrim\\n\\t\\t\\tgarb). If anyone kills game intentionally, he will have to pay a\\n\\t\\t\\tpenalty through an offering brought to the Ka'bah of a domestic\\n\\t\\t\\tanimal equivalent to the one which was killed as determined by\\n\\t\\t\\ttwo just men among you; or as an expiation, either feed a few\\n\\t\\t\\tindigent or fast their equivalent days, so that he may taste the\\n\\t\\t\\tevil consequences of what he did. Allah has forgiven what\\n\\t\\t\\thappened in the past; but if anyone repeats it now, Allah will\\n\\t\\t\\tinflict retribution on him. Allah is Mighty, Capable of\\n\\t\\t\\tRetribution."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "96",
    "Text": "Game of the sea and its use as food is lawful for you and the\\n\\t\\t\\tseafarers, but the game of the land is forbidden as long as you\\n\\t\\t\\tare in Ihram (pilgrim garb). Have fear of Allah to whom you shall\\n\\t\\t\\tall be assembled."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "97",
    "Text": "Allah has made the Ka'bah of the Sacred House an eternal value\\n\\t\\t\\tfor mankind, and so are the Sacred Months, the animal offerings,\\n\\t\\t\\tand the animals which are collared as a mark of dedication; so\\n\\t\\t\\tyou must know that Allah has knowledge of what is in the heavens\\n\\t\\t\\tand in the earth and that Allah is well aware of everything."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "98",
    "Text": "You should also know that Allah is stern in Retribution, and that\\n\\t\\t\\tAllah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "99",
    "Text": "The only duty of the Rasool is to pass on My Message. Allah knows\\n\\t\\t\\tall what you reveal and what you conceal."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "100",
    "Text": "Tell them, \"Bad and good are not equal, even though the abundance\\n\\t\\t\\tof the bad may dazzle you; so fear Allah, O people of\\n\\t\\t\\tunderstanding, that you may prosper!\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "101",
    "Text": "O believers! Do not ask questions about things that if revealed\\n\\t\\t\\tto you, may cause you trouble. But if you ask a question about\\n\\t\\t\\tsomething when the Qur'an is being revealed, it will be made\\n\\t\\t\\tknown to you. Allah has forgiven you what you did to date, Allah\\n\\t\\t\\tis Forgiving, Forbearing."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "102",
    "Text": "Some people before you did ask such questions and later lost\\n\\t\\t\\ttheir faith because of those very things."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "103",
    "Text": "Allah did not institute superstitions like those of a slit-ear\\n\\t\\t\\tshe-camel or a she-camel let loose for free pasture or idol\\n\\t\\t\\tsacrifices for twin-births in animals or stallion-camels freed\\n\\t\\t\\tfrom work; this lie is invented by the unbelievers against Allah,\\n\\t\\t\\tand most of them lack understanding."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "104",
    "Text": "When it is said to them: \"Come to what Allah has revealed and\\n\\t\\t\\tcome to the Rasool.\" They reply: \"Sufficient for us are the ways\\n\\t\\t\\ton which we found our forefathers.\" What! Even though their\\n\\t\\t\\tforefathers knew nothing and were not rightly guided?"
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "105",
    "Text": "O believers! You are accountable for none but for yourselves;\\n\\t\\t\\tanyone who has gone astray cannot harm you if you are on the\\n\\t\\t\\tRight Way. To Allah you shall all return and He will let you know\\n\\t\\t\\tthe truth of all that you did."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "106",
    "Text": "O believers! When death approaches any one of you, let two just\\n\\t\\t\\tmen from among yourselves act as witnesses at the time of making\\n\\t\\t\\tyour last will; or from the non-Muslims if you are travelling\\n\\t\\t\\tthrough the land and the calamity of death overtakes you. If you\\n\\t\\t\\tdoubt their honesty, detain them after prayer and let them both\\n\\t\\t\\tswear by Allah: \"We will not sell our testimony for any price,\\n\\t\\t\\teven to a relative, and we will not hide the testimony which we\\n\\t\\t\\twill be giving for the sake of Allah; for we shall be sinners if\\n\\t\\t\\twe do so.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "107",
    "Text": "Then, if it becomes known that those two were guilty of the sin\\n\\t\\t\\tof perjury, then let two others better qualified witnesses from\\n\\t\\t\\tamong those who were deprived of their right come forward and\\n\\t\\t\\ttestify upon oath, \"By Allah, our testimony is truer than theirs.\\n\\t\\t\\tWe have not transgressed in our testimony; for we should be\\n\\t\\t\\twrongdoers if we did so.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "108",
    "Text": "By this procedure, it is more likely that they will bear true\\n\\t\\t\\twitness or at least fear that their oaths could be contradicted\\n\\t\\t\\tby subsequent oaths. Have fear of Allah and listen; Allah does\\n\\t\\t\\tnot guide to those who are disobedient transgressors."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "109",
    "Text": "On the Day of Resurrection when Allah gathers the Rasools and\\n\\t\\t\\tasks: \"What response were you given from your addressees?\" They\\n\\t\\t\\twill say: \"We have no knowledge, only You have all the knowledge\\n\\t\\t\\tof the unseen.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "110",
    "Text": "Then Allah will ask: \"O Isa (Jesus) son of Maryam (Mary)! Recall\\n\\t\\t\\tmy favor upon you and to your mother, how I strengthened you with\\n\\t\\t\\tthe Holy Spirit, so you could speak to the people in cradle and\\n\\t\\t\\tin old age, how I taught you the Book, Wisdom, the Taurat (Torah)\\n\\t\\t\\tand the Injeel (Gospel). How you were able to make the figure of\\n\\t\\t\\ta bird out of a clay, by My permission, how you breathed into it\\n\\t\\t\\tand changed it into a real bird, by My permission. How you could\\n\\t\\t\\theal the born-blind and the lepers by My permission. How you\\n\\t\\t\\tcould bring the dead body back to life by My permission. How I\\n\\t\\t\\tprotected you from the violence of the Children of Israel when\\n\\t\\t\\tyou came to them with clear signs and the unbelievers among them\\n\\t\\t\\tsaid: \"This is nothing but a clear sorcery.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "111",
    "Text": "Remember when I inspired the disciples to have faith in Me and My\\n\\t\\t\\tRasool and they said: 'We believe and bear witness that we have\\n\\t\\t\\tbecome Muslims.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "112",
    "Text": "How when the disciples asked: \"O Isa son of Maryam! Can your Rabb\\n\\t\\t\\tsend down to us from heaven a table spread with food?\" And you\\n\\t\\t\\tsaid: \"Have fear of Allah if you are true believers.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "113",
    "Text": "They said: \"We only wish to eat thereof to satisfy our hearts and\\n\\t\\t\\tto know that you have indeed told us the truth, and that we bear\\n\\t\\t\\twitness to it.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "114",
    "Text": "Isa the son of Maryam said: \"O Allah, our Rabb! Send us from\\n\\t\\t\\theaven a table spread with food that it may mark a feast, one of\\n\\t\\t\\ta kind for those before us and for those after us, as a sign from\\n\\t\\t\\tYou; and provide us our sustenance, You are the best Sustainer.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "115",
    "Text": "Allah responded: \"I shall send it down to you, but if any of you\\n\\t\\t\\tdisbelieve after that, I shall punish him with a torment which I\\n\\t\\t\\thave never inflicted on anyone in the worlds.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "116",
    "Text": "After reminding him of these favors, Allah will say: \"O Isa\\n\\t\\t\\t(Jesus) son of Maryam (Marry), Did you ever say to the people,\\n\\t\\t\\t\"worship me and my mother as gods beside Allah?\" He will answer:\\n\\t\\t\\t\"Glory to You! How could I say what I had no right to say? If I\\n\\t\\t\\thad ever said so, you would have certainly known it. You know\\n\\t\\t\\twhat is in my heart, but I know not what is in Yours; for You\\n\\t\\t\\thave full knowledge of all the unseen."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "117",
    "Text": "I never said anything other than what You commanded me to say,\\n\\t\\t\\tthat is to worship Allah, Who is my Rabb and your Rabb. I was a\\n\\t\\t\\twitness over them as long as I remained among them; but when You\\n\\t\\t\\tcalled me off, You were the Watcher over them and You are a\\n\\t\\t\\tWitness to everything."
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "118",
    "Text": "If You punish them, they surely are Your servants; and if You\\n\\t\\t\\tforgive them, You are Mighty, Wise.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "119",
    "Text": "Allah will say: \"This is the day on which the truthful will\\n\\t\\t\\tprofit from their truth; they shall have gardens beneath which\\n\\t\\t\\trivers flow to live therein forever. Allah is well-pleased with\\n\\t\\t\\tthem and they are pleased with Him. This is the mighty\\n\\t\\t\\tachievement.\""
  },
  {
    "SurahNumber": "5",
    "AyahNumber": "120",
    "Text": "To Allah belongs the sovereignty of the heavens and the earth and\\n\\t\\t\\tall that is therein, and He has power over everything."
  }
]
