[
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "1",
    "sectionHeading": "Asking Permission to Enter ",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Safwan ibn Sulaym from Ata ibn\\n\\t\\t\\t\\tYasar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, was questioned by a man who said,\\n\\t\\t\\t\\t\"Messenger of Allah, shall I ask permission of my mother\\n\\t\\t\\t\\tto enter?\" He said, \"Yes \" The man said, \"I live with her\\n\\t\\t\\t\\tin the house\". The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said \"Ask her permission.\" The\\n\\t\\t\\t\\tman said, \"I am her servant.\" The Messenger of Allah. may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Ask her\\n\\t\\t\\t\\tpermission. Do you want to see her naked?\" He said, \"No.\"\\n\\t\\t\\t\\tHe said, \"Then ask her permission.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "2",
    "sectionHeading": "Asking Permission to Enter ",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from a reliable source of his from\\n\\t\\t\\t\\tBukayr ibn Abdullah ibn al-Ashajj from Basr ibn Said from\\n\\t\\t\\t\\tAbu Said al-Khudri that Abu Musa al-Ashari said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'One asks permission three times. If you are\\n\\t\\t\\t\\tgiven permission, then enter. If not, go away.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "3",
    "sectionHeading": "Asking Permission to Enter ",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Rabia ibn Abi Abd ar-Rahman from\\n\\t\\t\\t\\tanother of the ulama of that time that Abu Musa al-Ashari\\n\\t\\t\\t\\tcame and asked permission from Umar ibn al-Khattab to\\n\\t\\t\\t\\tenter. He asked permission three times, and then went\\n\\t\\t\\t\\taway Umar ibn al-Khattab sent after him and said, \"What's\\n\\t\\t\\t\\twrong with you? Why didn't you come in?\" Abu Musa said,\\n\\t\\t\\t\\t\"I heard the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, say, 'Ask permission to enter three\\n\\t\\t\\t\\ttimes. If you are given permission, then enter. If not,\\n\\t\\t\\t\\tgo away.' ''Umar said, \"Who can confirm this? If you do\\n\\t\\t\\t\\tnot bring me someone to confirm it, I will do\\n\\t\\t\\t\\tsuch-and-such to you.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Musa went out until he came to an assembly in the\\n\\t\\t\\t\\tmosque which was called the Majlis-al-Ansar. He said, \"I\\n\\t\\t\\t\\ttold Umar ibn al-Khattab that I heard the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, say, 'Ask\\n\\t\\t\\t\\tpermission three times. If you are given permission, then\\n\\t\\t\\t\\tenter. If not, go away.' Umar said, 'If you do not bring\\n\\t\\t\\t\\tme someone who can confirm it, I will do such-and-such to\\n\\t\\t\\t\\tyou'. If any of you have heard that, let him come with\\n\\t\\t\\t\\tme.' \" They said to Abu Said al-Khudri, \"Go with him\".\\n\\t\\t\\t\\tAbu Said was the youngest of them. He went with him and\\n\\t\\t\\t\\ttold Umar ibn al-Khattab about that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tUmar ibn al-Khattab said to Abu Musa, \"I did not suspect\\n\\t\\t\\t\\tyou, but I feared lest people forge sayings of the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "4",
    "sectionHeading": "Blessing the Person who Sneezes",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Abi Bakr from his\\n\\t\\t\\t\\tfather that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"If a man sneezes, invoke a\\n\\t\\t\\t\\tblessing on him. Then if he sneezes, invoke a blessing on\\n\\t\\t\\t\\thim. Then if he sneezes, invoke a blessing on him. Then\\n\\t\\t\\t\\tif he sneezes, say, 'You have a cold'.\" Abdullah ibn Abi\\n\\t\\t\\t\\tBakr said, \"I don't know whether it was after the third\\n\\t\\t\\t\\tor fourth.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "5",
    "sectionHeading": "Blessing the Person who Sneezes",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that when Abdullah ibn Umar\\n\\t\\t\\t\\tsneezed and someone said to him, \"May Allah have mercy on\\n\\t\\t\\t\\tyou,\" (Yarhamuka'llah), he said, \"May Allah have mercy on\\n\\t\\t\\t\\tus and you, and forgive us and you.\" (Yarhamuna'llah wa\\n\\t\\t\\t\\tyaghfirlana wa lakum).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "6",
    "sectionHeading": "Pictures and Images",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ishaq ibn Abdullah ibn Abi Talha\\n\\t\\t\\t\\tthat Rafi ibn Ishaq, the mawla of ash-Shifa informed him\\n\\t\\t\\t\\tthat he and Abdullah ibn Abi Talha had gone to visit Abu\\n\\t\\t\\t\\tSaid al-Khudri while he was ill. Abu Said said to them,\\n\\t\\t\\t\\t\"The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, informed us, 'The angels do not enter a house\\n\\t\\t\\t\\twhich contains pictures or images.' \" Ishaq was not sure\\n\\t\\t\\t\\twhich of them Abu Said said.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "7",
    "sectionHeading": "Pictures and Images",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abu'n-Nasr that Ubaydullah ibn\\n\\t\\t\\t\\tAbdullah ibn Utba ibn Masud went to visit Abu Talha\\n\\t\\t\\t\\tal-Ansari when he was ill. He said, \"I found Sahl ibn\\n\\t\\t\\t\\tHunayf with him. Abu Talha summoned a man and removed a\\n\\t\\t\\t\\trug which was under him. Sahl ibn Hunayf said to him,\\n\\t\\t\\t\\t'Why did you remove it?' He said, 'Because there were\\n\\t\\t\\t\\tpictures on it, and the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said what you know about\\n\\t\\t\\t\\tthem.' Sahl replied, 'Didn't the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, say, \"except for\\n\\t\\t\\t\\tmarkings on a garment?\"' (A rug was considered a\\n\\t\\t\\t\\tgarment). He said, 'Yes, but it is more pleasing to\\n\\t\\t\\t\\tmyself.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "8",
    "sectionHeading": "Pictures and Images",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from al-Qasim ibn Muhammad\\n\\t\\t\\t\\tfrom A'isha, the wife of the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, that she bought a cushion which had\\n\\t\\t\\t\\tpictures on it. When the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, saw it, he stopped at the\\n\\t\\t\\t\\tdoor and did not enter. She recognised disapproval on his\\n\\t\\t\\t\\tface and said, \"Messenger of Allah, I turn in repentance\\n\\t\\t\\t\\tto Allah and His Messenger. What have I done wrong?\" The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"What is the meaning of this cushion?\" She\\n\\t\\t\\t\\tsaid, \"I bought it for you to sit and recline on.\" The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Those who make such pictures will be\\n\\t\\t\\t\\tpunished on the Day of Rising. It will be said to them,\\n\\t\\t\\t\\t'Bring to life what you have created'. Then he said, 'The\\n\\t\\t\\t\\tangels do not enter a house in which there are pictures.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "9",
    "sectionHeading": "Eating Lizards",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abd ar-Rahman ibn Abdullah ibn\\n\\t\\t\\t\\tAbd ar-Rahman ibn Abi Sasaca that Sulayman ibn Yasar\\n\\t\\t\\t\\tsaid, \"The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, entered the house of Maimuna bint\\n\\t\\t\\t\\tal-Harith and there was a lizard in which there were eggs\\n\\t\\t\\t\\tto eat. Abdullah ibn Abbas and Khalid ibn al-Walid were\\n\\t\\t\\t\\twith him. He said, 'From where did you get this?' She\\n\\t\\t\\t\\treplied, 'My sister, Huzayla bint al-Harith, gave it to\\n\\t\\t\\t\\tme.' He then told Abdullah ibn Abbas and Khalid to eat.\\n\\t\\t\\t\\tThey said, 'Won't you eat, Messenger of Allah?' He said,\\n\\t\\t\\t\\t'There are those who visit me from Allah.' Maimuna said,\\n\\t\\t\\t\\t'Messenger of Allah, shall we give you some milk to drink\\n\\t\\t\\t\\twhich we have?' He said, 'Yes.' When he drank, he said,\\n\\t\\t\\t\\t'From where did you get this?' She said, 'My sister,\\n\\t\\t\\t\\tHuzayla gave it to me.' The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'Do you see your\\n\\t\\t\\t\\tslave-girl whom you asked me for permission to free? Give\\n\\t\\t\\t\\ther to your sister and bring her to your maternal\\n\\t\\t\\t\\trelatives to take care of her. That is better for you.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "10",
    "sectionHeading": "Eating Lizards",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Abu Umama ibn\\n\\t\\t\\t\\tSahl ibn Hunayf from Abdullah ibn Abbas that Khalid ibn\\n\\t\\t\\t\\tal-Walid ibn al-Mughira entered the house of Maimuna, the\\n\\t\\t\\t\\twife of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, with the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, and he was brought a roasted lizard.\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, stretched his hand toward it. One of the women who\\n\\t\\t\\t\\twas in Maimuna's house said, \"Tell the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, what he\\n\\t\\t\\t\\tmeans to eat.\" Someone said, \"It is a lizard, Messenger\\n\\t\\t\\t\\tof Allah.\" He withdrew his hand. Khalid said, \"Is it\\n\\t\\t\\t\\tharam, Messenger of Allah?\" He said, \"No, but there were\\n\\t\\t\\t\\tnone in my people's land, and I find that I dislike\\n\\t\\t\\t\\tthem.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tKhalid added, \"I chewed and ate it while the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\tlooking.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "11",
    "sectionHeading": "Eating Lizards",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Dinar from Abdullah\\n\\t\\t\\t\\tibn Umar that a man called the Messenger of Allah and\\n\\t\\t\\t\\tsaid, \"Messenger of Allah, what do you think about\\n\\t\\t\\t\\tlizards?\" The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"I do not eat them, and I do not\\n\\t\\t\\t\\tforbid them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "12",
    "sectionHeading": "Concerning Dogs",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yazid ibn Khusayfa that as-Sa'ib\\n\\t\\t\\t\\tibn Yazid informed him that he heard Sufyan ibn Abi\\n\\t\\t\\t\\tZuhayr who was from the Azd Shanua tribe and among the\\n\\t\\t\\t\\tcompanions of the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, speaking with some people who were\\n\\t\\t\\t\\twith him at the door of the mosque. He said, \"I heard the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, 'If anyone acquires a dog which he does not\\n\\t\\t\\t\\tuse as a sheepdog or for hunting, a qirat will be\\n\\t\\t\\t\\tdeducted from the reward of his good deeds each day.' \"\\n\\t\\t\\t\\tHe was asked, \"Did you hear this from the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace?\" He said,\\n\\t\\t\\t\\t\"Yes, by the Lord of this mosque.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "13",
    "sectionHeading": "Concerning Dogs",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Abdullah ibn Umar that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Whoever acquires a dog other than a\\n\\t\\t\\t\\tsheepdog or hunting dog, will have two qirats deducted\\n\\t\\t\\t\\tfrom the reward of his good actions every day.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Abdullah ibn Umar that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, ordered dogs to be killed.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "15",
    "sectionHeading": "Concerning Sheep",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abu'z-Zinad from al-Araj from\\n\\t\\t\\t\\tAbu Hurayra that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"The head of kufr is\\n\\t\\t\\t\\ttowards the east. Boasting and price is among people who\\n\\t\\t\\t\\thave horses and camels. The loud-voiced people are the\\n\\t\\t\\t\\tpeople of tents (the Bedouins). Tranquillity is with the\\n\\t\\t\\t\\tpeople who have sheep.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "16",
    "sectionHeading": "Concerning Sheep",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abd ar-Rahman ibn Abd ar-Rahman\\n\\t\\t\\t\\tibn Sasaca from his father that Abu Said al-Khudri said\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"It will soon happen that the best\\n\\t\\t\\t\\tproperty of a muslim will be sheep which he takes to the\\n\\t\\t\\t\\tpeaks of the mountains and the valleys, fleeing with his\\n\\t\\t\\t\\tdeen from trials.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "17",
    "sectionHeading": "Concerning Sheep",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Ibn Umar that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"No one should milk someone else's cow\\n\\t\\t\\t\\twithout his permission. Would any of you like someone to\\n\\t\\t\\t\\tcome to his apartment, break into his larder, and take\\n\\t\\t\\t\\this food? The udders of cows guard their food for their\\n\\t\\t\\t\\towners, so no one should milk someone else's cow without\\n\\t\\t\\t\\this permission.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "18",
    "sectionHeading": "Concerning Sheep",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"There is no Prophet who has not herded sheep,\" and\\n\\t\\t\\t\\tsomeone asked, \"You as well, Messenger of Allah?\" He\\n\\t\\t\\t\\tsaid, \"Myself as well.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "19",
    "sectionHeading": "Mice Falling into Clarified Butter, and giving Precedence to Food over the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that one time as Ibn Umar\\n\\t\\t\\t\\twas served his evening meal, he heard the recitation of\\n\\t\\t\\t\\tthe Imam while he was in his house and he did not hurry\\n\\t\\t\\t\\tfrom his food until he had finished what he needed.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "20",
    "sectionHeading": "Mice Falling into Clarified Butter, and giving Precedence to Food over the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Ubaydullah ibn\\n\\t\\t\\t\\tAbdullah ibn Utba ibn Masud from Abdullah ibn Abbas from\\n\\t\\t\\t\\tMaimuna, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, was asked about a mouse\\n\\t\\t\\t\\tfalling into clarified butter. He said, \"Remove it and\\n\\t\\t\\t\\tthrow away what is around it \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "21",
    "sectionHeading": "Guarding against Ill Luck",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abu Hazim ibn Dinar from Sahl\\n\\t\\t\\t\\tibn Sad as-Saidi that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"If it exists, it is\\n\\t\\t\\t\\tin a horse, a woman, and a house,\" meaning ill luck.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "22",
    "sectionHeading": "Guarding against Ill Luck",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Malik from Ibn Shihab from Hamza\\n\\t\\t\\t\\tand Salim the sons of Abdullah ibn Umar from Abdullah ibn\\n\\t\\t\\t\\tUmar that the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"Ill luck is in a house, a woman\\n\\t\\t\\t\\tand a horse.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "23",
    "sectionHeading": "Guarding against Ill Luck",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Yahya ibn Said said, \"A woman\\n\\t\\t\\t\\tcame to the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and said, 'Messenger of Allah, we moved\\n\\t\\t\\t\\tinto a house when our number was great and our wealth was\\n\\t\\t\\t\\tabundant. Now our number has dwindled and the wealth has\\n\\t\\t\\t\\tgone.' The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, 'Leave it as blameworthy.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "24",
    "sectionHeading": "Names that are Disliked ",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, asked about a milk camel about to be milked, \"Who\\n\\t\\t\\t\\tmilks this camel?\" A man stood up. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"What is your name?\" The man said, \"Murra (bitterness).\"\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said to him, \"Sit down.\" Then he said, \"Who milks\\n\\t\\t\\t\\tthis one?\" A man stood up and the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"What is your\\n\\t\\t\\t\\tname?\" He said, \"Harb (war).\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Sit down.\"\\n\\t\\t\\t\\tThen he said, \"Who milks this camel?\" A man stood up, and\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said to him, \"What is your name?\" The man said,\\n\\t\\t\\t\\t''Yaish (he lives).\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said to him, \"Milk!\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "25",
    "sectionHeading": "Names that are Disliked ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Yahya ibn Said that Umar ibn\\n\\t\\t\\t\\tal-Khattab asked a man what his name was. He said, \"Jamra\\n\\t\\t\\t\\t(live coal).\" \"The son of who?\" He said, \"Ibn Shihab\\n\\t\\t\\t\\t(meteor, flame).\" \"From whom?\" He said, \"From al-Huraqa\\n\\t\\t\\t\\t(burning).\" \"Where do you live?\" He said, \"At Harrat\\n\\t\\t\\t\\tan-Nar (lava field of the fire). \"At which one of them?\"\\n\\t\\t\\t\\tHe said, \"At Dhati Ladha (one with flames).\" Umar said,\\n\\t\\t\\t\\t\"Go and look at your family - they have been burned.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya added, \"It was as Umar ibn al-Khattab, may Allah be\\n\\t\\t\\t\\tpleased with him, said.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "26",
    "sectionHeading": "Cupping and the Reward of the Cupper",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Humayd at-Tawil that Anas ibn\\n\\t\\t\\t\\tMalik said, \"The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, was cupped. Abu Tayba cupped him,\\n\\t\\t\\t\\tand the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, ordered him to be given a sa of dates and\\n\\t\\t\\t\\tordered his family to lessen what he paid them for his\\n\\t\\t\\t\\tkitaba or kharaj.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "27",
    "sectionHeading": "Cupping and the Reward of the Cupper",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, \"If\\n\\t\\t\\t\\tthere is a remedy that will reach the disease, then\\n\\t\\t\\t\\tcupping will reach it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "28",
    "sectionHeading": "Cupping and the Reward of the Cupper",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Ibn Muhayyisa\\n\\t\\t\\t\\tal-Ansari, one of the Banu Haritha, that he asked\\n\\t\\t\\t\\tpermission from the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, to give payment for cupping, and\\n\\t\\t\\t\\the forbade him to do it. He continued to ask and seek his\\n\\t\\t\\t\\tpermission until he said, \"Feed the ones who drive your\\n\\t\\t\\t\\twater-carrying camels,\" meaning \"your slaves.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "29",
    "sectionHeading": "Concerning the East",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Dinar that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"I saw the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, pointing at the east and\\n\\t\\t\\t\\tsaying, 'The cause of dissension is here. The cause of\\n\\t\\t\\t\\tdissension is here, from where the helpers of shaytan\\n\\t\\t\\t\\tarise.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "30",
    "sectionHeading": "Concerning the East",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard that Umar ibn\\n\\t\\t\\t\\tal-Khattab wanted to go to Iraq, and Kabal-Ahbar said to\\n\\t\\t\\t\\thim, \"Do not go there, amir al-muminin. There is\\n\\t\\t\\t\\tnine-tenths of sorcery there and it is the place of the\\n\\t\\t\\t\\trebellious jinn and the disease which the doctors are\\n\\t\\t\\t\\tunable to cure.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "31",
    "sectionHeading": "Killing Snakes and what is Said about them",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Abu Lubaba that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade killing snakes which were in the houses.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "32",
    "sectionHeading": "Killing Snakes and what is Said about them",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Sa'iba, the female\\n\\t\\t\\t\\tmawla of A'isha, that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade killing the snakes\\n\\t\\t\\t\\twhich were in the houses except those with two white\\n\\t\\t\\t\\tstripes on their back and the short ones. They made one\\n\\t\\t\\t\\tgo blind and caused miscarriages in women.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "33",
    "sectionHeading": "Killing Snakes and what is Said about them",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Safiyy, the mawla of Ibn Aflah\\n\\t\\t\\t\\tthat Abu's-Saib, the mawla of Hisham ibn Zuhra said, \"I\\n\\t\\t\\t\\twent to Abu Said al-Khudri and found him praying. I sat\\n\\t\\t\\t\\tto wait for him until he finished the prayer. I heard a\\n\\t\\t\\t\\tmovement under a bed in his room, and it was a snake. I\\n\\t\\t\\t\\tstood up to kill it, and Abu Said gestured to me to sit.\\n\\t\\t\\t\\tWhen he was finished he pointed to a room in the house\\n\\t\\t\\t\\tand said, 'Do you see this room?' I said, 'Yes.' He said,\\n\\t\\t\\t\\t'There was a young boy in it who had just got married. He\\n\\t\\t\\t\\twent out with the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, to al-Khandaq, (the ditch which the\\n\\t\\t\\t\\tmuslims dug in the 5th year of the Hijra to defend Madina\\n\\t\\t\\t\\tagainst the Quraysh and their allies).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWhen he was there, the youth came and asked his\\n\\t\\t\\t\\tpermission, saying, \"Messenger of Allah. Give me\\n\\t\\t\\t\\tpermission to return to my family.\" The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, gave him\\n\\t\\t\\t\\tpermission and said, \"Take your weapons with you, for I\\n\\t\\t\\t\\tfear the Banu Quraydha tribe. They may harm you.\" The\\n\\t\\t\\t\\tyouth went to his family and found his wife standing\\n\\t\\t\\t\\tbetween the two doors. He lifted his spear to stab her as\\n\\t\\t\\t\\tjealousy had been aroused in him. She said, \"Don't be\\n\\t\\t\\t\\thasty until you go in and see what is in your house.\" He\\n\\t\\t\\t\\tentered and found a snake coiled up on his bed. He\\n\\t\\t\\t\\ttransfixed it with his spear and then went out with it\\n\\t\\t\\t\\tand pitched it into the house. The snake stirred on the\\n\\t\\t\\t\\tend of the spear and the youth fell dead. No one knew\\n\\t\\t\\t\\twhich of them died first, the snake or the youth. That\\n\\t\\t\\t\\twas mentioned to the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and he said, \"There are jinn in\\n\\t\\t\\t\\tMadina who have become muslim. When you see one of them,\\n\\t\\t\\t\\tcall out to it for three days. If it appears after that,\\n\\t\\t\\t\\tthen kill it, for it is a shaytan.\" \"'\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "34",
    "sectionHeading": "What to Say on Journeys",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard that when the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, set\\n\\t\\t\\t\\tfoot in the stirrup intending to travel, he would say,\\n\\t\\t\\t\\t\"In the name of Allah. O Allah! You are my companion in\\n\\t\\t\\t\\tthe journey and the Khalifa of my family. O Allah! Spread\\n\\t\\t\\t\\tout the earth for us and make the journey easy for us. O\\n\\t\\t\\t\\tAllah! I seek refuge with You from the hardship of the\\n\\t\\t\\t\\tjourney and from returning to sorrow and a distressing\\n\\t\\t\\t\\tsight regarding property and family.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik related to me from a reliable source of his from\\n\\t\\t\\t\\tYaqub ibn Abdullah al-Ashajj from Bushr ibn Said from Sad\\n\\t\\t\\t\\tibn Abi Waqqas from Khawla bint Hakim that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Whoever dismounts to rest in a place should say, 'I seek\\n\\t\\t\\t\\trefuge with the complete words of Allah from the evil of\\n\\t\\t\\t\\twhat he created,' (audhu bi kalimati-llahi at-tammati min\\n\\t\\t\\t\\tsharri ma khalaqa), and nothing will harm him until he\\n\\t\\t\\t\\tremounts.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "35",
    "sectionHeading": "Travelling Alone in the case of Men and Women",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abd ar-Rahman ibn Harmala from\\n\\t\\t\\t\\tAmr ibn Shuayb from his father from his father that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"One rider is a shaytan. Two riders are two\\n\\t\\t\\t\\tshaytans, and three are a riding-party.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "36",
    "sectionHeading": "Travelling Alone in the case of Men and Women",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abd ar-Rahman ibn Harmala that\\n\\t\\t\\t\\tSaid ibn al-Musayyab heard the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, say, \"Shaytan\\n\\t\\t\\t\\tconcerns himself with one and two. When there are three,\\n\\t\\t\\t\\the does not concern himself with them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "37",
    "sectionHeading": "Travelling Alone in the case of Men and Women",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Said ibn Abi Said al-Maqburi\\n\\t\\t\\t\\tfrom Abu Hurayra that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"It is not halal for\\n\\t\\t\\t\\ta woman who believes in Allah and the Last Day to travel\\n\\t\\t\\t\\tthe distance of a day and night without a man who is her\\n\\t\\t\\t\\tmahram.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "38",
    "sectionHeading": "How to Behave on Journeys",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abu Ubayd, the mawla of Sulayman\\n\\t\\t\\t\\tibn Abd al-Malik from Khalid ibn Madan who attributed it\\n\\t\\t\\t\\tto the Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\t\"Allah, the Blessed and Exalted is kind and loves\\n\\t\\t\\t\\tkindness. He is pleased with it and helps you with it as\\n\\t\\t\\t\\tlong as it is not misplaced. When you ride dumb beasts,\\n\\t\\t\\t\\tstop them in their stopping places, and quicken their\\n\\t\\t\\t\\tpace when the land is barren. Travel by night, because\\n\\t\\t\\t\\tthe land is travelled faster at night than it is during\\n\\t\\t\\t\\tthe day. Beware of pitching tents on the road, for it is\\n\\t\\t\\t\\tthe path of animals and the abode of snakes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "39",
    "sectionHeading": "How to Behave on Journeys",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Sumayy, the mawla of Abu Bakr\\n\\t\\t\\t\\tfrom Abu Salih from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Travelling is a portion of the torment. It denies you\\n\\t\\t\\t\\tyour sleep, food, and drink. When you have accomplished\\n\\t\\t\\t\\tyour purpose, you should hurry back to your family.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "40",
    "sectionHeading": "The Command to be Kind to Slaves",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard that Abu Hurayra said\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"A slave has his food and clothing\\n\\t\\t\\t\\tin the normal manner, and he is only obliged to do such\\n\\t\\t\\t\\twork as he is capable of doing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "41",
    "sectionHeading": "The Command to be Kind to Slaves",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard that Umar ibn\\n\\t\\t\\t\\tal-Khattab went to the villages every Saturday. If he\\n\\t\\t\\t\\tfound a slave doing work which he was not capable of\\n\\t\\t\\t\\tdoing, he lightened it for him.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "42",
    "sectionHeading": "The Command to be Kind to Slaves",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from his paternal uncle, Abu Suhayl\\n\\t\\t\\t\\tibn Malik, that his father heard Uthman ibn Affan say in\\n\\t\\t\\t\\ta khutba, \"Do not oblige the slave-girl to earn money\\n\\t\\t\\t\\tunless she has a skill. When you oblige her to do that,\\n\\t\\t\\t\\tshe will earn money by prostitution. Do not oblige the\\n\\t\\t\\t\\tchild to earn money. If he does not find it, he will\\n\\t\\t\\t\\tsteal. Have integrity since Allah has integrity with you,\\n\\t\\t\\t\\tand you must feed them good food.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "43",
    "sectionHeading": "The Slave and his Reward",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Abdullah ibn Umar that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"When a slave gives good counsel to his\\n\\t\\t\\t\\tmaster and worships Allah correctly, he has his reward\\n\\t\\t\\t\\ttwice over. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "54",
    "hadithNumber": "44",
    "sectionHeading": "The Slave and his Reward",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard that Umar ibn\\n\\t\\t\\t\\tal-Khattab saw a female slave belonging to Abdullah ibn\\n\\t\\t\\t\\tUmar ibn al-Khattab. She was dressed up in silks. He went\\n\\t\\t\\t\\tto his daughter Hafsa and said, \"Didn't I see your\\n\\t\\t\\t\\tbrother's slave-girl dressed up in silks walking among\\n\\t\\t\\t\\tthe people and causing trouble?\" Umar disapproved of\\n\\t\\t\\t\\tthat.\\n\\t\\t\\t</p>"
  }
]
