[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/046001",
        "Body":  "Ha. Mim."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/046010",
        "Body":  "Bethink you: If it is from Allah and ye disbelieve therein, and a\n\t\t\twitness of the Children of Israel hath already testified to the\n\t\t\tlike thereof and hath believed, and ye are too proud (what plight\n\t\t\tis yours)? Lo! Allah, guideth not wrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/046011",
        "Body":  "And those who disbelieve say of those who believe: If it had been\n\t\t\t(any) good, they would not have been before us in attaining it.\n\t\t\tAnd since they will not be guided by it, they say: This is an\n\t\t\tancient lie;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/046012",
        "Body":  "When before it there was the Scripture of Moses, an example and a\n\t\t\tmercy; and this is a confirming Scripture in the Arabic language,\n\t\t\tthat it may warn those who do wrong and bring good tidings for\n\t\t\tthe righteous."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/046013",
        "Body":  "Lo! those who say: our Lord is Allah, and thereafter walk aright,\n\t\t\tthere shall no fear come upon them neither shall they grieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/046014",
        "Body":  "Such are rightful owners of the Garden, immortal thereafter as a\n\t\t\treward for what they used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/046015",
        "Body":  "And We have commended unto man kindness toward parents. His\n\t\t\tmother beareth him with reluctance, and bringeth him forth with\n\t\t\treluctance, and the bearing of him and the weaning of him is\n\t\t\tthirty months, till, when he attaineth full strength and reacheth\n\t\t\tforty years, he saith: My Lord! Arouse me that I may give thanks\n\t\t\tfor the favor wherewith Thou hast favored me and my parents, and\n\t\t\tthat I may do right acceptable unto Thee. And be gracious unto me\n\t\t\tIn the matter of my seed. Lo! I have turned unto Thee repentant,\n\t\t\tand lo! I am of those who surrender (unto Thee)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/046016",
        "Body":  "Those are they from whom We accept the best of what they do, and\n\t\t\toverlook their evil deeds. (They are) among the owners of the\n\t\t\tGarden. This is the true promise which they were promised (in the\n\t\t\tworld)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/046017",
        "Body":  "And whoso saith unto his parents: Fie upon you both! Do ye\n\t\t\tthreaten me that I shall be brought forth (again) when\n\t\t\tgenerations before me have passed away? And they twain cry unto\n\t\t\tAllah for help (and say): Woe unto thee! Believe! Lo! the promise\n\t\t\tof Allah is true. But he saith: This is naught save fables of the\n\t\t\tmen of old:"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/046018",
        "Body":  "Such are those on whom the Word concerning nations of the Jinn\n\t\t\tand mankind which have passed away before them hath effect. Lo!\n\t\t\tthey are the losers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/046019",
        "Body":  "And for all there will be ranks from what they do, that He may\n\t\t\tpay them for their deeds! and they will not be wronged."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/046002",
        "Body":  "The revelation of the Scripture from Allah the Mighty, the Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/046020",
        "Body":  "And on the day when those who disbelieve are exposed to the Fire\n\t\t\t(it will be said): Ye squandered your good things in the life of\n\t\t\tthe world and sought comfort therein. Now this day ye are\n\t\t\trewarded with the doom of ignominy because ye were disdainful in\n\t\t\tthe land without a right and because ye used to transgress."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/046021",
        "Body":  "And make mention (O Muhammad) of the brother of Aad when he\n\t\t\twarned his folk among the wind curved sand hills and verily\n\t\t\twarners came and went before and after him saying: Serve none but\n\t\t\tAllah. Lo! I fear for you the doom of a tremendous Day."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/046022",
        "Body":  "They said; Hast come to turn us away from our gods? Then bring\n\t\t\tupon us that wherewith thou threatenest us, if thou art of the\n\t\t\ttruthful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/046023",
        "Body":  "He said: The knowledge is with Allah only. I convey unto you that\n\t\t\twherewith I have been sent, but I see you are a folk that know\n\t\t\tnot."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/046024",
        "Body":  "Then when they beheld it a dense cloud coming toward their\n\t\t\tvalleys, they said; Here is a cloud bringing us rain. Nay, but it\n\t\t\tis that which ye did seek to hasten, a wind wherein is painful\n\t\t\ttorment,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/046025",
        "Body":  "Destroying all things by commandment of its Lord. And morning\n\t\t\tfound them so that naught could be seen save their dwellings.\n\t\t\tThus do We reward the guilty folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/046026",
        "Body":  "And verily We bad empowered them with that where with We have not\n\t\t\tempowered you, and had assigned them ears and eyes and hearts;\n\t\t\tbut their ears and eyes and hearts availed them naught since they\n\t\t\tdenied the revelations of Allah; and what they used to mock\n\t\t\tbefell them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/046027",
        "Body":  "And verily We have destroyed townships round about you, and\n\t\t\tdisplayed (for them) Our revelation, that haply they might\n\t\t\treturn."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/046028",
        "Body":  "Then why did those whom they had chosen for gods as a way of\n\t\t\tapproach (unto Allah) not help them? Nay, but they did fail them\n\t\t\tutterly. And (all) that was their lie, and what they used to\n\t\t\tinvent."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/046029",
        "Body":  "And when We inclined toward thee (Muhammad) certain of the Jinn,\n\t\t\twho wished to hear the Qur\u0027an and, when they were in its\n\t\t\tpresence, said: Give ear! and, when it was finished, turned back\n\t\t\tto their people, warning."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/046003",
        "Body":  "We created not the heavens and the earth and all that is between\n\t\t\tthem save with truth, and for a term appointed. But those who\n\t\t\tdisbelieve turn away from that whereof they are warned."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/046030",
        "Body":  "They said: O our people! Lo! we have heard a Scripture which hath\n\t\t\tbeen revealed after Moses, confirming that which was before it,\n\t\t\tguiding unto the truth and a right road."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/046031",
        "Body":  "O our people! respond to Allah\u0027s summoner and believe in Him. He\n\t\t\twill forgive you some of your sins and guard you from a painful\n\t\t\tdoom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/046032",
        "Body":  "And whoso respondeth not to Allah\u0027s summoner he can nowise escape\n\t\t\tin the earth, and ye (can find) no protecting friends instead of\n\t\t\tHim. Such are in error manifest."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/046033",
        "Body":  "Have they not seen that Allah, Who created the heavens and the\n\t\t\tearth and was not wearied by their creation, is Able to give life\n\t\t\tto the dead? Aye, He verily is Able to do all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/046034",
        "Body":  "And on the day when those who disbelieve are exposed to the Fire\n\t\t\t(they will be asked): Is not this real? They will say: Yea, by\n\t\t\tour Lord. He will say: Then taste the doom for that ye\n\t\t\tdisbelieved.\t     ."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/046035",
        "Body":  "Then have patience (O Muhammad) even as the stout of heart among\n\t\t\tthe messengers (of old) had patience, and seek not to hasten on\n\t\t\tthe doom for them. On the day when they see that which they are\n\t\t\tpromised (it will seem to them) as though they had tarried but an\n\t\t\thour of daylight. A clear message. Shall any be destroyed save\n\t\t\tevil living folk?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/046004",
        "Body":  "Say (unto them, O Muhammad): Have ye thought on all that ye\n\t\t\tinvoke beside Allah? Show me what they have created of the earth.\n\t\t\tOr have they any Portion the heavens? Bring me a Scripture before\n\t\t\tthis (Scripture), or some vestige of knowledge (in support of\n\t\t\twhat ye say), if ye are truthful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/046005",
        "Body":  "And who is further astray than those who, instead of Allah, pray\n\t\t\tunto such as hear not their prayer until the Day of Resurrection,\n\t\t\tand are unconscious of their prayer,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/046006",
        "Body":  "And when mankind are gathered (to the Judgment) will become\n\t\t\tenemies for them, and will become deniers of having been\n\t\t\tworshipped."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/046007",
        "Body":  "And when Our clear revelations are recited unto them, who\n\t\t\tdisbelieve say of the Truth when it reacheth them: This is mere\n\t\t\tmagic."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/046008",
        "Body":  "Or say they: He hath invented it? Say (O Muhammad): If I have\n\t\t\tinvented it, still ye have no power to support me against Allah.\n\t\t\tHe is best aware of what ye say among yourselves concerning it.\n\t\t\tHe sufficeth for a witness between me and you And He is the\n\t\t\tForgiving, the Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "46",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/046009",
        "Body":  "Say: I am no new thing among the messengers (of Allah), nor know\n\t\t\tI what will be done with me or with you. I do but follow that\n\t\t\twhich is inspired in me, and I am but a plain warner."
    }
]
