[
  {
    "SurahNumber": "24",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "I.e., \"the injunctions whereof We have made self-evident\\n\\t\\t\\t\\tby virtue of their wording\": thus, according to Bukhari\\n\\t\\t\\t\\t(Kitab at-Tafsir), 'Abd Allah ibn 'Abbas explains the\\n\\t\\t\\t\\texpression faradnaha in this context (cf. Fath al-Bari\\n\\t\\t\\t\\tVIII, 361). The same explanation, also on the authority\\n\\t\\t\\t\\tof Ibn 'Abbas is advanced by Tabari. It would seem that\\n\\t\\t\\t\\tthe special stress on God’s having laid down this surah\\n\\t\\t\\t\\t\"in plain terms\" is connected with the gravity of the\\n\\t\\t\\t\\tinjunctions spelt out in the sequence: in other words, it\\n\\t\\t\\t\\timplies a solemn warning against any attempt at widening\\n\\t\\t\\t\\tor re-defining those injunctions by means of deductions,\\n\\t\\t\\t\\tinferences or any other considerations unconnected with\\n\\t\\t\\t\\tthe plain wording of the Qur'an."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "The term zina signifies voluntary sexual intercourse\\n\\t\\t\\t\\tbetween a man and a woman not married to one another,\\n\\t\\t\\t\\tirrespective of whether one or both of them are married\\n\\t\\t\\t\\tto other persons or not: hence, it does not - in contrast\\n\\t\\t\\t\\twith the usage prevalent in most Western languages -\\n\\t\\t\\t\\tdifferentiate between the concepts of \"adultery\" (i.e.,\\n\\t\\t\\t\\tsexual intercourse of a married man with a woman other\\n\\t\\t\\t\\tthan his wife, or of a married woman with a man other\\n\\t\\t\\t\\tthan her husband) and \"fornication\" (i.e., sexual\\n\\t\\t\\t\\tintercourse between two unmarried persons). For the sake\\n\\t\\t\\t\\tof simplicity I am rendering zina throughout as\\n\\t\\t\\t\\t\"adultery\", and the person guilty of it as \"adulterer\" or\\n\\t\\t\\t\\t\"adulteress\", respectively."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "The number of those to be present has been deliberately\\n\\t\\t\\t\\tleft unspecified, thus indicating that while the\\n\\t\\t\\t\\tpunishment must be given publicity, it need not be made a\\n\\t\\t\\t\\t\"public spectacle\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "The term mushrik (fem. mushrikah), which normally\\n\\t\\t\\t\\tsignifies a person who associates in his or her mind all\\n\\t\\t\\t\\tmanner of imaginary deities or forces with God, or who\\n\\t\\t\\t\\tbelieves that any created being has a share in His\\n\\t\\t\\t\\tqualities or powers, is here evidently used in the widest\\n\\t\\t\\t\\tmetaphorical sense of this term, denoting one who accords\\n\\t\\t\\t\\tto his or her desires a supremacy which is due to God\\n\\t\\t\\t\\talone, and thus blasphemes against the principles of\\n\\t\\t\\t\\tethics and morality enjoined by Him. The particle aw\\n\\t\\t\\t\\t(lit., \"or\") which connects the word mushrikah with the\\n\\t\\t\\t\\tpreceding word zaniyah (\"adulteress\") has in this context\\n\\t\\t\\t\\t- as well as in the next clause, where both these terms\\n\\t\\t\\t\\tappear in their masculine form - an amplifying,\\n\\t\\t\\t\\texplanatory value equivalent to the expression \"in other\\n\\t\\t\\t\\twords\" or \"that is\", similar to the use of this particle\\n\\t\\t\\t\\tin  23:6 . For a further elucidation of the above\\n\\t\\t\\t\\tpassage, see next note."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "3",
    "NoteID": "5",
    "Body": "Some of the commentators understand this passage in the\\n\\t\\t\\t\\tsense of an injunction: \"The adulterer shall not marry\\n\\t\\t\\t\\tany but an adulteress or a mushrikah; and as for the\\n\\t\\t\\t\\tadulteress, none shall marry her but an adulterer or a\\n\\t\\t\\t\\tmushrik.\" This interpretation is objectionable on several\\n\\t\\t\\t\\tcounts: firstly, the Qur'an does not ever countenance the\\n\\t\\t\\t\\tmarriage of a believer, however great a sin he or she may\\n\\t\\t\\t\\thave committed, with an unbeliever (in the most\\n\\t\\t\\t\\tpejorative sense of this term) secondly, it is a\\n\\t\\t\\t\\tfundamental principle of Islamic Law that once a crime\\n\\t\\t\\t\\thas been expiated by the transgressor's undergoing the\\n\\t\\t\\t\\tordained legal punishment (in this case, a hundred\\n\\t\\t\\t\\tstripes), it must be regarded, insofar as the society is\\n\\t\\t\\t\\tconcerned, as atoned for and done with; and, lastly, the\\n\\t\\t\\t\\tconstruction of the above passage is clearly that of a\\n\\t\\t\\t\\tstatement of fact (Razi), and cannot be interpreted as an\\n\\t\\t\\t\\tinjunction. On the other hand, since adultery is an\\n\\t\\t\\t\\tillicit sexual union, the verb yankihu, which appears\\n\\t\\t\\t\\ttwice in this passage, cannot have the customary,\\n\\t\\t\\t\\tspecific meaning of \"he marries\" but must, rather, be\\n\\t\\t\\t\\tunderstood in its general sense - applicable to both\\n\\t\\t\\t\\tlawful and unlawful sexual intercourse - namely, \"he\\n\\t\\t\\t\\tcouples with\". It is in this sense that the great\\n\\t\\t\\t\\tcommentator Abu Muslim (as quoted by Razi) explains the\\n\\t\\t\\t\\tabove verse, which stresses the fact that both partners\\n\\t\\t\\t\\tare equally guilty inasmuch as they commit their sin\\n\\t\\t\\t\\tconsciously - implying that neither of them can excuse\\n\\t\\t\\t\\thimself or herself on the ground of having been merely\\n\\t\\t\\t\\t\"seduced\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "4",
    "NoteID": "6",
    "Body": "The term muhsanat denotes literally \"women who are\\n\\t\\t\\t\\tfortified [against unchastity]\", i.e., by marriage and or\\n\\t\\t\\t\\tfaith and self-respect, implying that, from a legal point\\n\\t\\t\\t\\tof view, every woman must be considered chaste unless a\\n\\t\\t\\t\\tconclusive proof to the contrary is produced. (This\\n\\t\\t\\t\\tpassage relates to women other than the accuser's own\\n\\t\\t\\t\\twife, for in the latter case - as shown in verses {6-9} -\\n\\t\\t\\t\\tthe law of evidence and the consequences are different."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "4",
    "NoteID": "7",
    "Body": "By obvious implication, this injunction applies also to\\n\\t\\t\\t\\tcases where a woman accuses a man of illicit sexual\\n\\t\\t\\t\\tintercourse, and is subsequently unable to prove her\\n\\t\\t\\t\\taccusation legally. The severity of the punishment to be\\n\\t\\t\\t\\tmeted out in such cases, as well as the requirement of\\n\\t\\t\\t\\tfour witnesses - instead of the two that Islamic Law\\n\\t\\t\\t\\tregards as sufficient in all other criminal and civil\\n\\t\\t\\t\\tsuits - is based on the imperative necessity of\\n\\t\\t\\t\\tpreventing slander and off-hand accusations. As laid down\\n\\t\\t\\t\\tin several authentic sayings of the Prophet, the evidence\\n\\t\\t\\t\\tof the four witnesses must be direct, and not merely\\n\\t\\t\\t\\tcircumstantial: in other words, it is not sufficient for\\n\\t\\t\\t\\tthem to have witnessed a situation which made it evident\\n\\t\\t\\t\\tthat sexual intercourse was taking or had taken place:\\n\\t\\t\\t\\tthey must have witnessed the sexual act as such, and must\\n\\t\\t\\t\\tbe able to prove this to the entire satisfaction of the\\n\\t\\t\\t\\tjudicial authority (Razi, summing up the views of the\\n\\t\\t\\t\\tgreatest exponents of Islamic Law). Since such a complete\\n\\t\\t\\t\\tevidence is extremely difficult, if not impossible, to\\n\\t\\t\\t\\tobtain, it is obvious that the purpose of the above\\n\\t\\t\\t\\tQur'anic injunction is to preclude, in practice, all\\n\\t\\t\\t\\tthird-party accusations relating to illicit sexual\\n\\t\\t\\t\\tintercourse - for, \"man has been created weak\" ({4: 28})\\n\\t\\t\\t\\t- and to make a proof of adultery dependent on a\\n\\t\\t\\t\\tvoluntary, faith-inspired confession of the guilty\\n\\t\\t\\t\\tparties themselves."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "5",
    "NoteID": "8",
    "Body": "I.e., who publicly withdraw their accusation after having\\n\\t\\t\\t\\tsuffered the punishment of flogging - which, being a\\n\\t\\t\\t\\tlegal right of the wrongly accused person, cannot be\\n\\t\\t\\t\\tobviated by mere repentance and admission of guilt. Thus,\\n\\t\\t\\t\\tthe above-mentioned exemption relates only to the\\n\\t\\t\\t\\tinterdict on giving testimony and not to the punishment\\n\\t\\t\\t\\tby flogging."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "6",
    "NoteID": "9",
    "Body": "Lit., \"then the testimony of any of these shall be four\\n\\t\\t\\t\\ttestimonies [or \"solemn affirmations\"] before God\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "9",
    "NoteID": "10",
    "Body": "Thus, the husband's accusation is to be regarded as\\n\\t\\t\\t\\tproven if the wife refuses to take an oath to the\\n\\t\\t\\t\\tcontrary, and disproved if she solemnly sets her word\\n\\t\\t\\t\\tagainst his. Inasmuch as this procedure, which is called\\n\\t\\t\\t\\tli'an (\"oath of condemnation\"), leaves the question of\\n\\t\\t\\t\\tguilt legally undecided, both parties are absolved of all\\n\\t\\t\\t\\tthe legal consequences otherwise attending upon adultery\\n\\t\\t\\t\\t- resp. an unproven accusation of adultery - the only\\n\\t\\t\\t\\tconsequence being a mandatory divorce."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "10",
    "NoteID": "11",
    "Body": "This sentence, which introduces the section dealing with\\n\\t\\t\\t\\tthe condemnation of all unfounded or unproven accusations\\n\\t\\t\\t\\tof unchastity - as well as the similar sentence which\\n\\t\\t\\t\\tcloses it in verse {20} - is deliberately left\\n\\t\\t\\t\\tincomplete, leaving it to man to imagine what would have\\n\\t\\t\\t\\thappened to individual lives and to society if God had\\n\\t\\t\\t\\tnot ordained all the above-mentioned legal and moral\\n\\t\\t\\t\\tsafeguards against possibly false accusations, or if He\\n\\t\\t\\t\\thad made a proof of adultery dependent on mere\\n\\t\\t\\t\\tcircumstantial evidence. This idea is further elaborated\\n\\t\\t\\t\\tin verses {14-15}."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "11",
    "NoteID": "12",
    "Body": "Lit., \"those who brought forth the lie (al-ifk, here\\n\\t\\t\\t\\tdenoting a false accusation of unchastity) are a numerous\\n\\t\\t\\t\\tgroup ('usbah) among you\". The term 'usbah signifies any\\n\\t\\t\\t\\tgroup of people, of indeterminate number, banded together\\n\\t\\t\\t\\tfor a particular purpose (Taj al-'Arus).-According to all\\n\\t\\t\\t\\tthe commentators, the passage comprising verses {11-20}\\n\\t\\t\\t\\trelates to an incident which occurred on the Prophet's\\n\\t\\t\\t\\treturn from the campaign against the tribe of Mustaliq in\\n\\t\\t\\t\\tthe year 5 H. The Prophet's wife 'A'ishah, who had\\n\\t\\t\\t\\taccompanied him on that expedition, was inadvertently\\n\\t\\t\\t\\tleft behind when the Muslims struck camp before dawn.\\n\\t\\t\\t\\tAfter having spent several hours alone, she was found by\\n\\t\\t\\t\\tone of the Prophet's Companions, who led her to the next\\n\\t\\t\\t\\thalting-place of the army. This incident gave rise to\\n\\t\\t\\t\\tmalicious insinuations of misconduct on the part of\\n\\t\\t\\t\\t'A'ishah; but these rumours were short-lived, and her\\n\\t\\t\\t\\tinnocence was established beyond all doubt. - As is the\\n\\t\\t\\t\\tcase with all Qur'anic allusions to historical events,\\n\\t\\t\\t\\tthis one, too, is primarily meant to bring out an ethical\\n\\t\\t\\t\\tproposition valid for all times and all social\\n\\t\\t\\t\\tcircumstances: and this is the reason why the grammatical\\n\\t\\t\\t\\tconstruction of the above passage is such that the\\n\\t\\t\\t\\tpast-tense verbs occuring in verses {11-16} can be - and,\\n\\t\\t\\t\\tI believe, should be - understood as denoting the present\\n\\t\\t\\t\\ttense."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "11",
    "NoteID": "13",
    "Body": "I.e., in the sight of God: for, the unhappiness caused by\\n\\t\\t\\t\\tunjust persecution confers - as does every undeserved and\\n\\t\\t\\t\\tpatiently borne suffering - a spiritual merit on the\\n\\t\\t\\t\\tperson thus afflicted. Cf. the saying of the Prophet,\\n\\t\\t\\t\\tquoted by Bukhari and Muslim: \"Whenever a believer is\\n\\t\\t\\t\\tstricken with any hardship, or pain, or anxiety, or\\n\\t\\t\\t\\tsorrow, or harm, or distress - even if it be a thorn that\\n\\t\\t\\t\\thas hurt him - God redeems thereby some of his failings.\""
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "11",
    "NoteID": "14",
    "Body": "I.e., by stressing, in a legally and morally inadmissible\\n\\t\\t\\t\\tmanner, certain \"circumstantial\" details or aspects of\\n\\t\\t\\t\\tthe case in order to make the slanderous, unfounded\\n\\t\\t\\t\\tallegation more believable."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "12",
    "NoteID": "15",
    "Body": "Lit., \"whenever you hear it\" - the pronoun \"you\"\\n\\t\\t\\t\\tindicating here the community as a whole."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "13",
    "NoteID": "16",
    "Body": "This interpolation is necessary in view of the fact that\\n\\t\\t\\t\\tthe believers spoken of in the preceding verse are\\n\\t\\t\\t\\tblamed, not for making the false accusation, but for not\\n\\t\\t\\t\\tgiving it the lie."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "13",
    "NoteID": "17",
    "Body": "Lit., \"in support thereof\" ('alayhi)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "14",
    "NoteID": "18",
    "Body": "Sc., \"yourselves and your whole society\". With this and\\n\\t\\t\\t\\tthe next verse the discourse returns to, and elaborates,\\n\\t\\t\\t\\tthe idea touched upon in verse {10} and explained in note\\n\\t\\t\\t\\t[11]."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "16",
    "NoteID": "19",
    "Body": "The interjection subhanaka (\"O Thou who art limitless in\\n\\t\\t\\t\\tThy glory\") stresses here the believer's moral duty to\\n\\t\\t\\t\\tbethink himself of God whenever he is tempted to listen\\n\\t\\t\\t\\tto, or to repeat, a calumny (since every such rumour must\\n\\t\\t\\t\\tbe considered a calumny unless its truth is legally\\n\\t\\t\\t\\tproved)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "19",
    "NoteID": "20",
    "Body": "The term fahishah signifies anything that is morally\\n\\t\\t\\t\\treprehensible or abominable: hence, \"immoral conduct\" in\\n\\t\\t\\t\\tthe widest sense of this expression. In the above context\\n\\t\\t\\t\\tit refers to unfounded or unproven allegations of immoral\\n\\t\\t\\t\\tconduct, in other words, \"foul slander\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "19",
    "NoteID": "21",
    "Body": "I.e., the legal punishment as stipulated in verse {4} of\\n\\t\\t\\t\\tthis surah."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "19",
    "NoteID": "22",
    "Body": "This Qur'anic warning against slander and, by obvious\\n\\t\\t\\t\\timplication, against any attempt at seeking out other\\n\\t\\t\\t\\tpeople’s faults finds a clear echo in several\\n\\t\\t\\t\\twell-authenticated sayings of the Prophet: \"Beware of all\\n\\t\\t\\t\\tguesswork [about one another], for, behold, all [such]\\n\\t\\t\\t\\tguesswork is most deceptive (akdhab al-hadith); and do\\n\\t\\t\\t\\tnot spy upon one another, and do not try to bare [other\\n\\t\\t\\t\\tpeople’s] failings\" (Muwatta’; almost identical versions\\n\\t\\t\\t\\tof this Tradition have been quoted by Bukhari, Muslim and\\n\\t\\t\\t\\tAbu Da’ud); \"Do not hurt those who have surrendered\\n\\t\\t\\t\\tthemselves to God (al-muslimin), and do not impute evil\\n\\t\\t\\t\\tto them, and do not try to uncover their nakedness [i.e.,\\n\\t\\t\\t\\ttheir faults]: for, behold, if anyone tries to uncover\\n\\t\\t\\t\\this brother’s nakedness, God will uncover his own\\n\\t\\t\\t\\tnakedness [on the Day of Judgment]\" (Tirmidhi); and,\\n\\t\\t\\t\\t\"Never does a believer draw a veil over the nakedness of\\n\\t\\t\\t\\tanother believer without God’s drawing a veil over his\\n\\t\\t\\t\\town nakedness on Resurrection Day\" (Bukhari). All these\\n\\t\\t\\t\\tinjunctions have received their seal, as it were, in the\\n\\t\\t\\t\\tQur'anic exhortation: \"Avoid most guesswork [about one\\n\\t\\t\\t\\tanother] - for, behold, some of [such] guesswork is [in\\n\\t\\t\\t\\titself] a sin\" ( 49:12 )."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "20",
    "NoteID": "23",
    "Body": "See verse {10} of this surah and the corresponding note\\n\\t\\t\\t\\t[11]."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "21",
    "NoteID": "24",
    "Body": "In this context, the term al-munkar has apparently the\\n\\t\\t\\t\\tsame meaning as in  16:90  (explained in the\\n\\t\\t\\t\\tcorresponding note [109]) since, as the sequence shows,\\n\\t\\t\\t\\tit clearly relates to the unreasonable self-righteousness\\n\\t\\t\\t\\tof so many people who \"follow Satan’s footsteps\" by\\n\\t\\t\\t\\timputing moral failings to others and forgetting that it\\n\\t\\t\\t\\tis only due to God’s grace that man, in his inborn\\n\\t\\t\\t\\tweakness, can ever remain pure."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "22",
    "NoteID": "25",
    "Body": "Or: \"Swear that [henceforth] they would not help [lit.,\\n\\t\\t\\t\\t\"give to\"] .. .\", etc. Both these meanings - \"he swore\\n\\t\\t\\t\\t[that]\" and \"he became remiss [in]\" - are attributable to\\n\\t\\t\\t\\tthe verb ala, which appears in the above sentence in the\\n\\t\\t\\t\\tform ya’tal. My rendering is based on the interpretation\\n\\t\\t\\t\\tgiven to this verb by the great philologist Abu Ubayd\\n\\t\\t\\t\\tal-Qasim al-Harawi (cf. Lane I, 84)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "22",
    "NoteID": "26",
    "Body": "For an explanation of this rendering of the designation\\n\\t\\t\\t\\tal-muhajirun (or, in other places, alladhina hajaru). see\\n\\t\\t\\t\\tsurah {2}, note [203]."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "22",
    "NoteID": "27",
    "Body": "It is generally assumed that this verse refers to Abu\\n\\t\\t\\t\\tBakr, who swore that he would never again help his poor\\n\\t\\t\\t\\trelative, the muhajir Mistah (whom he used to support\\n\\t\\t\\t\\tuntil then) after the latter had taken part in slandering\\n\\t\\t\\t\\tAbu Bakr's daughter, 'A'ishah (see note [12] above).\\n\\t\\t\\t\\tThere is no doubt that this assumption of the\\n\\t\\t\\t\\tcommentators is well-founded, but there is also no doubt\\n\\t\\t\\t\\tthat the ethical purport of the above verse is timeless\\n\\t\\t\\t\\tand, therefore, independent of the fact or facts with\\n\\t\\t\\t\\twhich it appears to be historically linked. (This view\\n\\t\\t\\t\\tfinds additional support in the use of the plural form\\n\\t\\t\\t\\tthroughout the above passage.) The call to \"pardon and\\n\\t\\t\\t\\tforbear\" is fully consonant with the Qur'anic principle\\n\\t\\t\\t\\tof countering evil with good (see  13:22  and the\\n\\t\\t\\t\\tcorresponding note [44])."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "23",
    "NoteID": "28",
    "Body": "According to Razi, the absence of repentance is\\n\\t\\t\\t\\tincontrovertibly implied in the condemnation expressed in\\n\\t\\t\\t\\tthe sequence, since the Qur'an makes it clear in many\\n\\t\\t\\t\\tplaces that God always accepts a sinner's sincere\\n\\t\\t\\t\\trepentance."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "23",
    "NoteID": "29",
    "Body": "Lit., \"chaste, unmindful [or \"careless\"] believing\\n\\t\\t\\t\\twomen\", i.e., virtuous women who thoughtlessly expose\\n\\t\\t\\t\\tthemselves to situations on which a slanderous\\n\\t\\t\\t\\tconstruction may be put."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "25",
    "NoteID": "30",
    "Body": "Regarding the double meaning (\"manifest\" and\\n\\t\\t\\t\\t\"manifesting\") inherent in the adjective mubin, see note\\n\\t\\t\\t\\t[2] on  12:1 ; for my rendering of God's attribute\\n\\t\\t\\t\\tal-haqq as \"the Ultimate Truth\", see note [99] on\\n\\t\\t\\t\\t 20:114 . In this particular instance, the active form of\\n\\t\\t\\t\\tmubin (\"manifesting\") apparently relates to God's\\n\\t\\t\\t\\trevelation, on Judgement Day, of the true nature of man's\\n\\t\\t\\t\\tactions and, thus, of the enormity of the sin to which\\n\\t\\t\\t\\tthis passage refers."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "26",
    "NoteID": "31",
    "Body": "Lit., \"innocent of all that they [i.e., the slanderers]\\n\\t\\t\\t\\tmay say\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "26",
    "NoteID": "32",
    "Body": "See note [5] on  8:4 . The reference, in this context, to\\n\\t\\t\\t\\tGod's \"forgiveness of sins\" (maghfirah) is obviously\\n\\t\\t\\t\\tmeant to stress the innate weakness of man's nature,\\n\\t\\t\\t\\twhich makes him prone to sinning, however good and pure\\n\\t\\t\\t\\the may be (cf.  4:28 )."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "27",
    "NoteID": "33",
    "Body": "This categorical prohibition connects with the preceding\\n\\t\\t\\t\\tpassages inasmuch as it serves as an additional\\n\\t\\t\\t\\tprotection of individuals against possible slander. In\\n\\t\\t\\t\\tits wider purport, it postulates the inviolability of\\n\\t\\t\\t\\teach person's home and private life. (For the\\n\\t\\t\\t\\tsocio-political implications of this principle, see State\\n\\t\\t\\t\\tand Government in Islam, pp. 84 ff.)"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "28",
    "NoteID": "34",
    "Body": "I.e., by the rightful owner or caretaker."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "29",
    "NoteID": "35",
    "Body": "Lit., \"uninhabited houses wherein there are things of use\\n\\t\\t\\t\\t(mata') for you\". In the consensus of all the\\n\\t\\t\\t\\tauthorities, including the Companions of the Prophet,\\n\\t\\t\\t\\tthis relates to buildings or premises of a more or less\\n\\t\\t\\t\\tpublic nature, like inns, shops, administrative offices,\\n\\t\\t\\t\\tpublic baths, etc., as well as to ancient ruins."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "30",
    "NoteID": "36",
    "Body": "Lit., \"to restrain [something] of their gaze and to guard\\n\\t\\t\\t\\ttheir private parts\". The latter expression may be\\n\\t\\t\\t\\tunderstood both in the literal sense of \"covering one's\\n\\t\\t\\t\\tprivate parts\" - i.e., modesty in dress - as well as in\\n\\t\\t\\t\\tthe metonymical sense of \"restraining one's sexual\\n\\t\\t\\t\\turges\", i.e., restricting them to what is lawful, namely,\\n\\t\\t\\t\\tmarital intercourse (cf. {23:5-6}). The rendering adopted\\n\\t\\t\\t\\tby me in this instance allows for both interpretations.\\n\\t\\t\\t\\tThe \"lowering of one's gaze\", too, relates both to\\n\\t\\t\\t\\tphysical and to emotional modesty (Razi)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "31",
    "NoteID": "37",
    "Body": "My interpolation of the word \"decently\" reflects the\\n\\t\\t\\t\\tinterpretation of the phrase illa ma zahara minha by\\n\\t\\t\\t\\tseveral of the earliest Islamic scholars, and\\n\\t\\t\\t\\tparticularly by Al-Qiffal (quoted by Razi), as \"that\\n\\t\\t\\t\\twhich a human being may openly show in accordance with\\n\\t\\t\\t\\tprevailing custom (al-'adab al-jariyah)\". Although the\\n\\t\\t\\t\\ttraditional exponents of Islamic Law have for centuries\\n\\t\\t\\t\\tbeen inclined to restrict the definition of \"what may\\n\\t\\t\\t\\t[decently] be apparent\" to a woman's face, hands and\\n\\t\\t\\t\\tfeet - and sometimes even less than that - we may safely\\n\\t\\t\\t\\tassume that the meaning of illa ma zahara minha is much\\n\\t\\t\\t\\twider, and that the deliberate vagueness of this phrase\\n\\t\\t\\t\\tis meant to allow for all the time-bound changes that are\\n\\t\\t\\t\\tnecessary for man's moral and social growth. The pivotal\\n\\t\\t\\t\\tclause in the above injunction is the demand, addressed\\n\\t\\t\\t\\tin identical terms to men as well as to women, to \"lower\\n\\t\\t\\t\\ttheir gaze and be mindful of their chastity\": and this\\n\\t\\t\\t\\tdetermines the extent of what, at any given time, may\\n\\t\\t\\t\\tlegitimately - i.e., in consonance with the Qur'anic\\n\\t\\t\\t\\tprinciples of social morality - be considered \"decent\" or\\n\\t\\t\\t\\t\"indecent\" in a person's outward appearance."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "31",
    "NoteID": "38",
    "Body": "The noun khimar (of which khumur is the plural) denotes\\n\\t\\t\\t\\tthe head-covering customarily used by Arabian women\\n\\t\\t\\t\\tbefore and after the advent of Islam. According to most\\n\\t\\t\\t\\tof the classical commentators, it was worn in pre-Islamic\\n\\t\\t\\t\\ttimes more or less as an ornament and was let down\\n\\t\\t\\t\\tloosely over the wearer's back; and since, in accordance\\n\\t\\t\\t\\twith the fashion prevalent at the time, the upper part of\\n\\t\\t\\t\\ta woman's tunic had a wide opening in the front, her\\n\\t\\t\\t\\tbreasts were left bare. Hence, the injunction to cover\\n\\t\\t\\t\\tthe bosom by means of a khimar (a term so familiar to the\\n\\t\\t\\t\\tcontemporaries of the Prophet) does not necessarily\\n\\t\\t\\t\\trelate to the use of khimar as such but is, rather, meant\\n\\t\\t\\t\\tto make it clear that a woman's breasts are not included\\n\\t\\t\\t\\tin the concept of \"what may decently be apparent\" of her\\n\\t\\t\\t\\tbody and should not, therefore, be displayed."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "31",
    "NoteID": "39",
    "Body": "I.e., very old men. The preceding phrase \"those whom they\\n\\t\\t\\t\\trightfully possess\" (lit., \"whom their right hands\\n\\t\\t\\t\\tpossess\") denotes slaves; but see also note [78]."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "31",
    "NoteID": "40",
    "Body": "Lit., \"so that those of their charms which they keep\\n\\t\\t\\t\\thidden may become known\". The phrase yadribna\\n\\t\\t\\t\\tbi-arjulihinna is idiomatically similar to the phrase\\n\\t\\t\\t\\tdaraba bi-yadayhi mishyatihi, \"he swung his arms in\\n\\t\\t\\t\\twalking\" (quoted in this context in Taj al-'Arus), and\\n\\t\\t\\t\\talludes to a deliberately provocative gait."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "31",
    "NoteID": "41",
    "Body": "The implication of this general call to repentance is\\n\\t\\t\\t\\tthat since \"man has been created weak\" ( 4:28 ), no one\\n\\t\\t\\t\\tis ever free of faults and temptations - so much so that\\n\\t\\t\\t\\teven the Prophet used to say, \"Verily, I turn unto Him in\\n\\t\\t\\t\\trepentance a hundred times every day\" (Ibn Hanbal,\\n\\t\\t\\t\\tBukhari and Bayhaqi, all of them on the authority of 'Abd\\n\\t\\t\\t\\tAllah ibn'Umar)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "32",
    "NoteID": "42",
    "Body": "I.e., from among the free members of the community, as is\\n\\t\\t\\t\\tevident from the subsequent juxtaposition with slaves.\\n\\t\\t\\t\\t(As most of the classical commentators point out, this is\\n\\t\\t\\t\\tnot an injunction but a recommendation to the community\\n\\t\\t\\t\\tas a whole: hence my interpolation of the words \"you\\n\\t\\t\\t\\tought to\".) The term ayyim - of which ayama is the plural\\n\\t\\t\\t\\t- signifies a person of either sex who has no spouse,\\n\\t\\t\\t\\tirrespective of whether he or she has never been married\\n\\t\\t\\t\\tor is divorced or widowed. Thus, the above verse\\n\\t\\t\\t\\texpresses the idea - reiterated in many authentic sayings\\n\\t\\t\\t\\tof the Prophet - that, from both the ethical and the\\n\\t\\t\\t\\tsocial points of view, the married state is infinitely\\n\\t\\t\\t\\tpreferable to celibacy."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "32",
    "NoteID": "43",
    "Body": "The term as-salihin connotes here both moral and physical\\n\\t\\t\\t\\tfitness for marriage: i.e., the attainment of bodily and\\n\\t\\t\\t\\tmental maturity as well as mutual affection between the\\n\\t\\t\\t\\tman and the woman concerned. As in  4:25 , the above\\n\\t\\t\\t\\tverse rules out all forms of concubinage and postulates\\n\\t\\t\\t\\tmarriage as the only basis of lawful sexual relations\\n\\t\\t\\t\\tbetween a man and his female slave."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "44",
    "Body": "I.e., because of poverty, or because they cannot find a\\n\\t\\t\\t\\tsuitable mate, or for any other personal reason."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "45",
    "Body": "Lit., \"whom your right hands possess\", i.e., male or\\n\\t\\t\\t\\tfemale slaves."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "46",
    "Body": "The noun kitab is, in this context, an equivalent of\\n\\t\\t\\t\\tkitabah or makatabah (lit., \"mutual agreement in\\n\\t\\t\\t\\twriting\"), a juridical term signifying a \"deed of\\n\\t\\t\\t\\tfreedom\" or \"of manumission\" executed on the basis of an\\n\\t\\t\\t\\tagreement between a slave and his or her owner, to the\\n\\t\\t\\t\\teffect that the slave undertakes to purchase his or her\\n\\t\\t\\t\\tfreedom for an equitable sum of money payable in\\n\\t\\t\\t\\tinstalments before or after the manumission, or,\\n\\t\\t\\t\\talternatively, by rendering a clearly specified service\\n\\t\\t\\t\\tor services to his or her owner. With this end in view,\\n\\t\\t\\t\\tthe slave is legally entitled to engage in any\\n\\t\\t\\t\\tlegitimate, gainful work or to obtain the necessary sum\\n\\t\\t\\t\\tof money by any other lawful means (e.g., through a loan\\n\\t\\t\\t\\tor a gift from a third person). In view of the imperative\\n\\t\\t\\t\\tform of the verb katibuhum (\"write it out for them\"), the\\n\\t\\t\\t\\tdeed of manumission cannot be refused by the owner, the\\n\\t\\t\\t\\tonly pre-condition being an evidence - to be established,\\n\\t\\t\\t\\tif necessary, by an unbiased arbiter or arbiters - of\\n\\t\\t\\t\\tthe slave's good character and ability to fulfil his or\\n\\t\\t\\t\\ther contractual obligations. The stipulation that such a\\n\\t\\t\\t\\tdeed of manumission may not be refused, and the\\n\\t\\t\\t\\testablishment of precise juridical directives to this\\n\\t\\t\\t\\tend, clearly indicates that Islamic Law has from its very\\n\\t\\t\\t\\tbeginning aimed at an abolition of slavery as a social\\n\\t\\t\\t\\tinstitution, and that its prohibition in modern times\\n\\t\\t\\t\\tconstitutes no more than a final implementation of that\\n\\t\\t\\t\\taim. (See also next note, as well as note [146] on\\n\\t\\t\\t\\t 2:177 .)"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "47",
    "Body": "According to all the authorities, this relates (a) to a\\n\\t\\t\\t\\tmoral obligation on the part of the owner to promote the\\n\\t\\t\\t\\tslave's efforts to obtain the necessary revenues by\\n\\t\\t\\t\\thelping him or her to achieve an independent economic\\n\\t\\t\\t\\tstatus and/or by remitting part of the agreed - upon\\n\\t\\t\\t\\tcompensation, and (b) to the obligation of the state\\n\\t\\t\\t\\ttreasury (bayt al-mal) to finance the freeing of slaves\\n\\t\\t\\t\\tin accordance with the Qur'anic principle - enunciated in\\n\\t\\t\\t\\t 9:60  - that the revenues obtained through the\\n\\t\\t\\t\\tobligatory tax called zakah are to be utilized, among\\n\\t\\t\\t\\tother purposes, \"for the freeing of human beings from\\n\\t\\t\\t\\tbondage\" (fi 'r-riqab, an expression explained in surah\\n\\t\\t\\t\\t{2}, note [146]). Hence, Zamakhshari holds that the above\\n\\t\\t\\t\\tclause is addressed not merely to persons owning slaves\\n\\t\\t\\t\\tbut to the community as a whole. - The expression \"the\\n\\t\\t\\t\\twealth of God\" contains an allusion to the principle that\\n\\t\\t\\t\\t\"God has bought of the believers their lives and their\\n\\t\\t\\t\\tpossessions, promising them paradise in return\" ({9:\\n\\t\\t\\t\\t111}) - implying that all of man's possessions are vested\\n\\t\\t\\t\\tin God, and that man is entitled to no more than their\\n\\t\\t\\t\\tusufruct."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "48",
    "Body": "Lit., \"so that you might seek out\" or \"endeavour to\\n\\t\\t\\t\\tattain to\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "33",
    "NoteID": "49",
    "Body": "Lit., \"if they desire protection against unchastity\\n\\t\\t\\t\\t(tahassun)\", i.e., through marriage (cf. the expression\\n\\t\\t\\t\\tmuhsanat as used in  4:24 ). Most of the classical\\n\\t\\t\\t\\tcommentators are of the opinion that the term fatayat\\n\\t\\t\\t\\t(\"maidens\") denotes here \"slave girls\": an assumption\\n\\t\\t\\t\\twhich is fully warranted by the context.  Hence, the\\n\\t\\t\\t\\tabove verse reiterates the prohibition of concubinage by\\n\\t\\t\\t\\texplicitly describing it as \"whoredom\" (bigha')."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "50",
    "Body": "The particle ka (\"as if\" or \"as it were\") prefixed to a\\n\\t\\t\\t\\tnoun is called kaf at-tashbih (\"the letter kaf pointing\\n\\t\\t\\t\\tto a resemblance [of one thing to another]\" or\\n\\t\\t\\t\\t\"indicating a metaphor\"). In the above context it alludes\\n\\t\\t\\t\\tto the impossibility of defining God even by means of a\\n\\t\\t\\t\\tmetaphor or a parable - for, since \"there is nothing like\\n\\t\\t\\t\\tunto Him\" ( 42:11 ), there is also \"nothing that could be\\n\\t\\t\\t\\tcompared with Him\" ( 112:4 ). Hence, the parable of \"the\\n\\t\\t\\t\\tlight of God\" is not meant to express His reality - which\\n\\t\\t\\t\\tis inconceivable to any created being and, therefore,\\n\\t\\t\\t\\tinexpressible in any human language - but only to allude\\n\\t\\t\\t\\tto the illumination which He, who is the Ultimate Truth,\\n\\t\\t\\t\\tbestows upon the mind and the feelings of all who are\\n\\t\\t\\t\\twilling to be guided. Tabari, Baghawi and Ibn Kathir\\n\\t\\t\\t\\tquote Ibn 'Abbas and Ibn Mas'ud as saying in this\\n\\t\\t\\t\\tcontext: \"It is the parable of His light in the heart of\\n\\t\\t\\t\\ta believer.\""
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "51",
    "Body": "The \"lamp\" is the revelation which God grants to His\\n\\t\\t\\t\\tprophets and which is reflected in the believer's heart -\\n\\t\\t\\t\\tthe \"niche\" of the above parable (Ubayy ibn Ka'b, as\\n\\t\\t\\t\\tquoted by Tabari) - after being received and consciously\\n\\t\\t\\t\\tgrasped by his reason (\"the glass [shining brightly] like\\n\\t\\t\\t\\ta radiant star\"): for it is through reason alone that\\n\\t\\t\\t\\ttrue faith can find its way into the heart of man."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "52",
    "Body": "It would seem that this is an allusion to the organic\\n\\t\\t\\t\\tcontinuity of all divine revelation which, starting like\\n\\t\\t\\t\\ta tree from one \"root\" or proposition - the statement of\\n\\t\\t\\t\\tGod's existence and uniqueness - grows steadily\\n\\t\\t\\t\\tthroughout man's spiritual history, branching out into a\\n\\t\\t\\t\\tsplendid variety of religious experience, thus endlessly\\n\\t\\t\\t\\twidening the range of man's perception of the truth. The\\n\\t\\t\\t\\tassociation of this concept with the olive-tree\\n\\t\\t\\t\\tapparently arises from the fact that this particular kind\\n\\t\\t\\t\\tof tree is characteristic of the lands in which most of\\n\\t\\t\\t\\tthe prophetic precursors of the Qur'anic message lived,\\n\\t\\t\\t\\tnamely, the lands to the east of the mediterranean: but\\n\\t\\t\\t\\tsince all true revelation flows from the Infinite Being,\\n\\t\\t\\t\\tit is \"neither of the east nor of the west\" - and\\n\\t\\t\\t\\tespecially so the revelation of the Qur'an, which, being\\n\\t\\t\\t\\taddressed to all mankind, is universal in its goal as\\n\\t\\t\\t\\twell."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "53",
    "Body": "The essence of the Qur'anic message is described\\n\\t\\t\\t\\telsewhere as \"clear [in itself] and clearly showing the\\n\\t\\t\\t\\ttruth\" (cf. note [2] on  12:1 ); and it is, I believe,\\n\\t\\t\\t\\tthis aspect of the Qur'an that the above sentence alludes\\n\\t\\t\\t\\tto. Its message gives light because it proceeds from God;\\n\\t\\t\\t\\tbut it \"would well-nigh give light [of itself] even\\n\\t\\t\\t\\tthough fire had not touched it\": i.e., even though one\\n\\t\\t\\t\\tmay be unaware that it has been \"touched by the fire\" of\\n\\t\\t\\t\\tdivine revelation, its inner consistency, truth and\\n\\t\\t\\t\\twisdom ought to be self-evident to anyone who approaches\\n\\t\\t\\t\\tit in the light of his reason and without prejudice."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "54",
    "Body": "Although most of the commentators read the above phrase\\n\\t\\t\\t\\tin the sense of \"God guides unto His light whomever He\\n\\t\\t\\t\\twills\", Zamakhshari gives it the sense adopted in my\\n\\t\\t\\t\\trendering (both being syntactically permissible)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "35",
    "NoteID": "55",
    "Body": "I.e., because of their complexity, certain truths can be\\n\\t\\t\\t\\tconveyed to man only by means of parables or allegories:\\n\\t\\t\\t\\tsee notes [5] and [8] on  3:7 ."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "36",
    "NoteID": "56",
    "Body": "Lit., \"and [ordained] that His name ...\", etc.: implying,\\n\\t\\t\\t\\tas the sequence shows, that the spiritual purpose of\\n\\t\\t\\t\\tthose houses of worship is fulfilled only by some, and\\n\\t\\t\\t\\tnot all, of the people who are wont to congregate in them\\n\\t\\t\\t\\tout of habit."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "37",
    "NoteID": "57",
    "Body": "Lit., \"bargaining\" or \"selling\" or \"buying and selling\"\\n\\t\\t\\t\\t(bay') - a metonym for anything that might bring worldly\\n\\t\\t\\t\\tgain."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "37",
    "NoteID": "58",
    "Body": "For this rendering of the term zakah, see surah {2}, note\\n\\t\\t\\t\\t[34]."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "39",
    "NoteID": "59",
    "Body": "I.e., he is bound to realize on Judgment Day that all his\\n\\t\\t\\t\\tsupposedly \"good\" deeds have been rendered worthless by\\n\\t\\t\\t\\this deliberate refusal to listen to the voice of truth\\n\\t\\t\\t\\t(Zamakhshari and Razi)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "40",
    "NoteID": "60",
    "Body": "I.e., their bad deeds, as contrasted with their good\\n\\t\\t\\t\\tdeeds, which in the preceding verse have been likened to\\n\\t\\t\\t\\ta mirage."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "40",
    "NoteID": "61",
    "Body": "Lit., \"one above another\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "41",
    "NoteID": "62",
    "Body": "Cf.  17:44  and the corresponalng note [53]."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "45",
    "NoteID": "63",
    "Body": "See note [39] on  21:30 . The term dabbah denotes every\\n\\t\\t\\t\\tcorporeal being endowed with both life and spontaneous\\n\\t\\t\\t\\tmovement; hence, in its widest sense, it comprises the\\n\\t\\t\\t\\tentire animal world, including man."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "46",
    "NoteID": "64",
    "Body": "Or: \"God guides whomever He wills onto a straight way\".\\n\\t\\t\\t\\tThe rendering adopted by me in this instance seems\\n\\t\\t\\t\\tpreferable in view of the preceding, intensive stress on\\n\\t\\t\\t\\tthe evidence, forthcoming from all nature, of God's\\n\\t\\t\\t\\tcreative, planning activity and the appeal to \"all who\\n\\t\\t\\t\\thave eyes to see\" to let themselves be guided by this\\n\\t\\t\\t\\toverwhelming evidence."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "48",
    "NoteID": "65",
    "Body": "I.e., in order that the divine writ - which is implied in\\n\\t\\t\\t\\tthe preceding expression \"God and His Apostle\" - might\\n\\t\\t\\t\\tdetermine their ethical values and, consequently, their\\n\\t\\t\\t\\tsocial behaviour."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "49",
    "NoteID": "66",
    "Body": "Lit., \"if the truth happens to be with them, they come to\\n\\t\\t\\t\\tit willingly\": cf. {4:60-61} and the corresponding notes,\\n\\t\\t\\t\\tespecially note [80]."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "50",
    "NoteID": "67",
    "Body": "I.e., by depriving them of what they choose to regard as\\n\\t\\t\\t\\t\"legitimate\" liberties and enjoyments, or by supposedly\\n\\t\\t\\t\\tpreventing them from \"keeping up with the times\". As in\\n\\t\\t\\t\\tverses {47} and {48} (as well as in verse {51} below) the\\n\\t\\t\\t\\texpression \"God and His Apostle\" is here a synonym for\\n\\t\\t\\t\\tthe divine writ revealed to the Apostle."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "51",
    "NoteID": "68",
    "Body": "Lit., \"The only saying of the believers... is that they\\n\\t\\t\\t\\tsay\"- i.e., without any mental reservation. The term qawl\\n\\t\\t\\t\\t(lit., \"saying\") has here the sense of a genuine\\n\\t\\t\\t\\tspiritual \"response\" in contrast to the mere lip-service\\n\\t\\t\\t\\talluded to in verse {47} above."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "53",
    "NoteID": "69",
    "Body": "This is an allusion to the ephemeral, self-deceiving\\n\\t\\t\\t\\tenthusiasms of the half-hearted and their supposed\\n\\t\\t\\t\\treadiness for \"self-sacrifice\", contrasting with their\\n\\t\\t\\t\\tobvious reluctance to live up to the message of the\\n\\t\\t\\t\\tQur'an in their day-to-day concerns."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "53",
    "NoteID": "70",
    "Body": "This elliptic phrase alludes to the principle -\\n\\t\\t\\t\\trepeatedly stressed in the Qur'an- that God does not\\n\\t\\t\\t\\tburden man with more than he can easily bear."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "55",
    "NoteID": "71",
    "Body": "Lit., \"cause them to be successors on earth\" - i.e., enable\\n\\t\\t\\t\\tthem to achieve, in their turn power and security and,\\n\\t\\t\\t\\tthus, the capability to satisfy their worldly needs. This\\n\\t\\t\\t\\tQur'anic reference to God's \"promise\" contains an oblique\\n\\t\\t\\t\\tallusion to the God-willed natural law which invariably\\n\\t\\t\\t\\tmakes the rise and fall of nations dependent on their\\n\\t\\t\\t\\tmoral qualities."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "55",
    "NoteID": "72",
    "Body": "Cf.  5:3 - \"I have willed that self-surrender unto Me\\n\\t\\t\\t\\t(al-Islam) shall be your religion\". Its \"firm\\n\\t\\t\\t\\testablishment\" (tamkin) relates to the strengthening of\\n\\t\\t\\t\\tthe believers' faith as well as to the growth of its\\n\\t\\t\\t\\tmoral influence in the world."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "55",
    "NoteID": "73",
    "Body": "Lit., \"exchange for them, after their fear [or \"danger\"],\\n\\t\\t\\t\\tsecurity\". It is to be noted that the term amn signifies\\n\\t\\t\\t\\tnot merely outward, physical security but also - and,\\n\\t\\t\\t\\tindeed, originally - \"freedom from fear\" (Taj al-'Arus).\\n\\t\\t\\t\\thence, the above clause implies not only a promise of\\n\\t\\t\\t\\tcommunal security after an initial period of weakness and\\n\\t\\t\\t\\tdanger (which, as history tells us, overshadows the\\n\\t\\t\\t\\tbeginnings of every genuine religious movement), but also\\n\\t\\t\\t\\tthe promise of an individual sense of inner security -\\n\\t\\t\\t\\tthat absence of all fear of the Unknown which\\n\\t\\t\\t\\tcharacterizes a true believer. (See next note.)"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "55",
    "NoteID": "74",
    "Body": "I.e., the believer's freedom from fear is a direct\\n\\t\\t\\t\\toutcome of his intellectual and emotional refusal to\\n\\t\\t\\t\\tattribute to anyone or anything but God the power to\\n\\t\\t\\t\\tshape his destiny."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "56",
    "NoteID": "75",
    "Body": "The specific mention of the \"purifying dues\" (az-zakah)\\n\\t\\t\\t\\tin this context is meant to stress the element of\\n\\t\\t\\t\\tunselfishness as an integral aspect of true faith.\\n\\t\\t\\t\\tAccording to Zamakhshari, the above verse connects with,\\n\\t\\t\\t\\tand concludes, verse {54}."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "57",
    "NoteID": "76",
    "Body": "For an explanation of the above sentence and the words\\n\\t\\t\\t\\tinterpolated by me, see note [39] on a similar phrase in\\n\\t\\t\\t\\t 11:20 ."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "58",
    "NoteID": "77",
    "Body": "In pursuance of the Qur'anic principle that the social\\n\\t\\t\\t\\tand individual - as well as the spiritual and\\n\\t\\t\\t\\tmaterial - aspects of human life form one indivisible whole\\n\\t\\t\\t\\tand cannot, therefore, be dealt with independently of one\\n\\t\\t\\t\\tanother, the discourse returns to the consideration of\\n\\t\\t\\t\\tsome of the rules of healthy social behaviour enunciated\\n\\t\\t\\t\\tin the earlier parts of this surah. The following passage\\n\\t\\t\\t\\ttakes up and elaborates the theme of the individual's\\n\\t\\t\\t\\tright to privacy, already touched upon in verses {27-29}\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "58",
    "NoteID": "78",
    "Body": "Lit., \"whom your right hands possess\" - a phrase which,\\n\\t\\t\\t\\tprimarily and as a rule, denotes male and female slaves.\\n\\t\\t\\t\\tSince, however, the institution of slavery is envisaged\\n\\t\\t\\t\\tin the Qur'an as a mere historic phenomenon that must in\\n\\t\\t\\t\\ttime be abolished (cf. notes [46] and [47] on verse {33}\\n\\t\\t\\t\\tof this surah, as well as note [146] on  2:177 ), the\\n\\t\\t\\t\\tabove expression may also be understood as referring, in\\n\\t\\t\\t\\tgeneral, to one's close dependents and to domestic\\n\\t\\t\\t\\tservants of either sex. Alternatively, the phrase ma\\n\\t\\t\\t\\tmalakat aymanukum may denote, in this context, \"those\\n\\t\\t\\t\\twhom you rightfully possess through wedlock\", i.e., wives\\n\\t\\t\\t\\tand husbands (cf.  4:24  and the corresponding note\\n\\t\\t\\t\\t[26])."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "58",
    "NoteID": "79",
    "Body": "I.e., all children, irrespective of whether they are\\n\\t\\t\\t\\trelated to one or not."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "58",
    "NoteID": "80",
    "Body": "The term zahirah (lit., \"midday\" or, occasionally, \"heat\\n\\t\\t\\t\\tof midday\"), which occurs in the Qur'an only in this one\\n\\t\\t\\t\\tinstance, may have been used metonymically in the sense\\n\\t\\t\\t\\tof \"day-time\" as contrasted with the time after the\\n\\t\\t\\t\\tprayer of nightfall and before the prayer of daybreak:\\n\\t\\t\\t\\thence my tentative rendering as \"middle of the day\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "58",
    "NoteID": "81",
    "Body": "Lit., \"three [periods] of nakedness (thalath 'awrat) for\\n\\t\\t\\t\\tyou\". This phrase is to be understood both literally and\\n\\t\\t\\t\\tfiguratively. Primarily, the term 'awrah signifies those\\n\\t\\t\\t\\tparts of a mature person’s body which cannot in decency\\n\\t\\t\\t\\tbe exposed to any but one’s wife or husband or, in case\\n\\t\\t\\t\\tof illness, one’s physician. In its tropical sense, it is\\n\\t\\t\\t\\talso used to denote spiritual \"nakedness\", as well as\\n\\t\\t\\t\\tsituations and circumstances in which a person is\\n\\t\\t\\t\\tentitled to absolute privacy. The number \"three\" used\\n\\t\\t\\t\\ttwice in this context is not, of course, enumerative or\\n\\t\\t\\t\\texclusive, but is obviously meant to stress the recurrent\\n\\t\\t\\t\\tnature of the occasions on which even the most familiar\\n\\t\\t\\t\\tmembers of the household, including husbands, wives and\\n\\t\\t\\t\\tchildren, must respect that privacy."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "59",
    "NoteID": "82",
    "Body": "Lit., \"have asked it\": a reference to the injunction laid\\n\\t\\t\\t\\tdown in verses {27-28} above. My interpolation, between\\n\\t\\t\\t\\tbrackets, of the phrase \"who have reached maturity\" is\\n\\t\\t\\t\\tbased on Zamakhshari's interpretation of the words \"those\\n\\t\\t\\t\\tbefore them\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "60",
    "NoteID": "83",
    "Body": "This conjunction is, I believe, meant to indicate that\\n\\t\\t\\t\\tthe verse which it introduces is connected with certain\\n\\t\\t\\t\\tpreviously revealed passages, namely, verse {31} above\\n\\t\\t\\t\\tand  33:59 , both of which allude to the principle of\\n\\t\\t\\t\\tmodesty to be observed by Muslim women in the matter of\\n\\t\\t\\t\\tdress: hence, it must be regarded as a separate\\n\\t\\t\\t\\t\"section\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "60",
    "NoteID": "84",
    "Body": "Lit., \"who do not desire [or \"hope for\"] sexual\\n\\t\\t\\t\\tintercourse\" - the latter evidently being the meaning of\\n\\t\\t\\t\\tnikah in this context. Although this noun, as well as the\\n\\t\\t\\t\\tverb from which it is derived, is almost always used in\\n\\t\\t\\t\\tthe Qur'an in the sense of \"marriage\" or \"marrying\",\\n\\t\\t\\t\\tthere are undoubtedly exceptions from this general rule:\\n\\t\\t\\t\\tfor instance, the manner in which the verbal form yankihu\\n\\t\\t\\t\\tis used in verse {3} of this surah (see the corresponding\\n\\t\\t\\t\\tnote [5] above). These exceptions confirm the view held\\n\\t\\t\\t\\tby some philologists of great renown, e.g., Al-Jawhari or\\n\\t\\t\\t\\tAl-Azhari (the latter quoted in the Lisan al-'Arab), to\\n\\t\\t\\t\\tthe effect that \"in the speech of the Arabs, the original\\n\\t\\t\\t\\tmeaning of nikah is sexual intercourse (al-wat')\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "61",
    "NoteID": "85",
    "Body": "The whole of verse {61} is construed in so highly\\n\\t\\t\\t\\telliptic a form that disagreements as to its purport have\\n\\t\\t\\t\\talways been unavoidable. However, if all the explanations\\n\\t\\t\\t\\toffered by the early commentators are taken into\\n\\t\\t\\t\\tconsideration, we find that their common denominator is\\n\\t\\t\\t\\tthe view that the innermost purport of this passage is a\\n\\t\\t\\t\\tstress on the brotherhood of all believers, expressed in\\n\\t\\t\\t\\ta call to mutual charity, compassion and good-fellowship\\n\\t\\t\\t\\tand, hence, the avoidance of all unnecessary formalities\\n\\t\\t\\t\\tin their mutual relations."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "61",
    "NoteID": "86",
    "Body": "In the consensus of all the authorities, the expression\\n\\t\\t\\t\\t\"your houses\" implies in this context also \"your\\n\\t\\t\\t\\tchildren's houses\", since all that belongs to a person\\n\\t\\t\\t\\tmay be said to belong, morally, to his parents as well."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "61",
    "NoteID": "87",
    "Body": "I.e., \"for which you are responsible\"."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "62",
    "NoteID": "88",
    "Body": "Lit., \"a uniting [or \"collective\"] matter\" (amr jami').\\n\\t\\t\\t\\tThe personal pronoun in \"with him\" relates to the Apostle\\n\\t\\t\\t\\tand, by analogy, to every legitimate leader (imam) of the\\n\\t\\t\\t\\tMuslim community acting in accordance with the spirit of\\n\\t\\t\\t\\tthe Qur'an and the Prophet's life-example."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "62",
    "NoteID": "89",
    "Body": "I.e., his permission to abstain, for valid reasons, from\\n\\t\\t\\t\\tparticipating in a course of action or a policy agreed\\n\\t\\t\\t\\tupon by the majority of the community ('amma ijtama'u\\n\\t\\t\\t\\tlahu min al-amr: Tabari). In a logical development of\\n\\t\\t\\t\\tthis principle we arrive at something like the concept of\\n\\t\\t\\t\\ta \"loyal opposition\", which implies the possibility of\\n\\t\\t\\t\\tdissent on a particular point of communal or state policy\\n\\t\\t\\t\\tcombined with absolute loyalty to the common cause. (But\\n\\t\\t\\t\\tsee also note [91].)"
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "62",
    "NoteID": "90",
    "Body": "I.e., after weighing the reasons advanced by the\\n\\t\\t\\t\\tindividual or the individuals concerned against the\\n\\t\\t\\t\\tinterests of the society as a whole."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "62",
    "NoteID": "91",
    "Body": "The statement that \"God is much-forgiving\" obviously\\n\\t\\t\\t\\timplies that an avoidance of \"asking leave\" to abstain\\n\\t\\t\\t\\tfrom participation in an agreed-upon course of action is,\\n\\t\\t\\t\\tunder all circumstances, morally preferable\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "63",
    "NoteID": "92",
    "Body": "I.e., his summons to God's message in general, spoken of\\n\\t\\t\\t\\tin verses {46-54} above, as well as to a particular\\n\\t\\t\\t\\tcourse of communal action, referred to in verse {62}.\\n\\t\\t\\t\\tAlternatively, \"the Apostle's summons\" may, in this\\n\\t\\t\\t\\tcontext, be synonymous with the Qur'an itself."
  },
  {
    "SurahNumber": "24",
    "AyahNumber": "64",
    "NoteID": "93",
    "Body": "Lit., \"well does He know upon what you are\": i.e., \"what\\n\\t\\t\\t\\tyour beliefs are and what moral principles govern your\\n\\t\\t\\t\\tattitudes and actions\"."
  }
]
