[
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "Text": "O Prophet! If you and the believers divorce your wives, divorce\\n\\t\\t\\tthem at the end of their prescribed periods, and count their\\n\\t\\t\\tprescribed periods accurately. Fear Allah, your Rabb. Do not\\n\\t\\t\\texpel them from their homes during their waiting period, nor they\\n\\t\\t\\tthemselves should leave, unless they have committed an open\\n\\t\\t\\tlewdness. These are limits set by Allah; he that transgresses the\\n\\t\\t\\tlimits of Allah will wrong his own soul. You never know, Allah\\n\\t\\t\\tmay, thereafter, bring about some new situation of\\n\\t\\t\\treconciliation."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "2",
    "Text": "Then when their waiting period ends, either keep them honorably\\n\\t\\t\\tor part with them in an honorable way. Call to witness two honest\\n\\t\\t\\tpersons among you, and O witnesses, bear witness equitably for\\n\\t\\t\\tthe sake of Allah. This advise is being given to all who believe\\n\\t\\t\\tin Allah and the last Day. He that fears Allah may be provided a\\n\\t\\t\\tway out by Him,"
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "3",
    "Text": "and given sustenance from the sources he could never imagine: for\\n\\t\\t\\tAllah is all sufficient for the person who puts his trust in Him.\\n\\t\\t\\tSurely Allah brings about what He pleases, and Allah has set a\\n\\t\\t\\tmeasure for all things."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "4",
    "Text": "If you have any doubt concerning those of your wives who have\\n\\t\\t\\tceased menstruating, then you should know that their waiting\\n\\t\\t\\tperiod will be three months, and the same will apply to those who\\n\\t\\t\\thave no menstruation due to young age or a disease. As for those\\n\\t\\t\\twho are pregnant, their waiting period will end with delivery.\\n\\t\\t\\tAllah will ease the hardship of those who fear Him."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "5",
    "Text": "This is the command of Allah which He has sent down to you. He\\n\\t\\t\\tthat fears Allah, will have his sins removed and his reward\\n\\t\\t\\tenlarged."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "6",
    "Text": "Let those women, during their waiting period ('Iddat), live where\\n\\t\\t\\tyou yourselves live according to your means. You shall not harass\\n\\t\\t\\tthem so as to make life intolerable for them. If they are\\n\\t\\t\\tpregnant, maintain them until their delivery: and if, after that,\\n\\t\\t\\tthey suckle your offspring, compensate them and settle the matter\\n\\t\\t\\tof compensation with mutual consultation and in all fairness. But\\n\\t\\t\\tif you cannot bear with each other then let another woman suckle\\n\\t\\t\\tthe baby for you."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "7",
    "Text": "Let the rich man give according to his means, and the poor man\\n\\t\\t\\tgive according to what Allah has given him. Allah does not charge\\n\\t\\t\\ta man with more than He has given him; soon Allah may bring ease\\n\\t\\t\\tafter hardship."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "8",
    "Text": "How many townships have rebelled against the commandments of\\n\\t\\t\\ttheir Rabb and His Rasools! Stern was Our reckoning with them and\\n\\t\\t\\texemplary was Our punishment."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "9",
    "Text": "So they tasted the fruit of their misdeeds, and the fruit of\\n\\t\\t\\ttheir misdeeds was perdition."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "10",
    "Text": "Allah has prepared for them a severe punishment in the Hereafter.\\n\\t\\t\\tTherefore, fear Allah! O men of understanding and faith. Allah\\n\\t\\t\\thas indeed sent down to you an admonition;"
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "11",
    "Text": "a Rasool reciting to you the revelations of Allah containing\\n\\t\\t\\tclear guidance, so that he may lead the believers who do good\\n\\t\\t\\tdeeds from the darkness to the light. He that believes in Allah\\n\\t\\t\\tand does good deeds, shall be admitted to gardens beneath which\\n\\t\\t\\trivers flow, to live therein forever; and Allah has prepared an\\n\\t\\t\\texcellent provision for them."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "12",
    "Text": "It is Allah Who has created seven heavens, and earths as many.\\n\\t\\t\\tHis commandment descends through them, this is being explained to\\n\\t\\t\\tyou, so that you may know that Allah has power over all things,\\n\\t\\t\\tand that Allah encompasses all things in His knowledge."
  }
]
