[
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "1",
    "sectionHeading": "Wudu from the Evil Eye",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Muhammad ibn Abi\\n\\t\\t\\t\\tUmama ibn Sahl ibn Hunayf heard his father say, \"My\\n\\t\\t\\t\\tfather, Sahl ibn Hunayf did a ghusl at al-Kharrar. He\\n\\t\\t\\t\\tremoved the jubbah he had on while Amir ibn Rabia was\\n\\t\\t\\t\\twatching, and Sahl was a man with beautiful white skin.\\n\\t\\t\\t\\tAmir said to him, 'I have never seen anything like what I\\n\\t\\t\\t\\thave seen today, not even the skin of a virgin.' Sahl\\n\\t\\t\\t\\tfell ill on the spot, and his condition grew worse.\\n\\t\\t\\t\\tSomebody went to the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and told him that Sahl was ill,\\n\\t\\t\\t\\tand could not go with him. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, came to him, and\\n\\t\\t\\t\\tSahl told him what had happened with Amir. The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'Why does one of you kill his brother? Why did you not\\n\\t\\t\\t\\tsay, \"May Allah bless you?\" (ta baraka-llah) The evil eye\\n\\t\\t\\t\\tis true. Do wudu from it.' Amir did wudu from it and Sahl\\n\\t\\t\\t\\twent with the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and there was nothing wrong with him.\" \\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "2",
    "sectionHeading": "Wudu from the Evil Eye",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab that Abu Umama ibn\\n\\t\\t\\t\\tSahl ibn Hunayf said, ''Amir ibn Rabia saw Sahl ibn\\n\\t\\t\\t\\tHunayf doing a ghusl and said, 'I have not seen the like\\n\\t\\t\\t\\tof what I see today, not even the skin of a maiden who\\n\\t\\t\\t\\thas never been out of doors.' Sahl fell to the ground.\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, was approached and it was said, 'Messenger of\\n\\t\\t\\t\\tAllah, can you do anything about Sahl ibn Hunayf? By\\n\\t\\t\\t\\tAllah, he can not raise his head.' He said, 'Do you\\n\\t\\t\\t\\tsuspect anyone of it?' They said, 'We suspect Amir ibn\\n\\t\\t\\t\\tRabia.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe continued, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, summoned Amir and was furious\\n\\t\\t\\t\\twith him and said, 'Why does one of you kill his brother?\\n\\t\\t\\t\\tWhy did you not say, \"May Allah bless you?\" Do ghusl for\\n\\t\\t\\t\\tit.' Amir washed his face, hands, elbows, knees, the end\\n\\t\\t\\t\\tof his feet, and inside his lower garment in a vessel.\\n\\t\\t\\t\\tThen he poured it over him, and Sahl went off with the\\n\\t\\t\\t\\tpeople, and there was nothing wrong with him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "3",
    "sectionHeading": "Guarding from the Evil Eye.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Humayd ibn Qays\\n\\t\\t\\t\\tal-Makki said, \"A man came to the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, with the two sons of\\n\\t\\t\\t\\tJafar ibn Abi Talib. He said to their nursemaid, 'Why do\\n\\t\\t\\t\\tI see them so thin?' Their nursemaid said, 'Messenger of\\n\\t\\t\\t\\tAllah, the evil eye goes quickly to them. Nothing stops\\n\\t\\t\\t\\tus from asking someone to make talismans (using ayats of\\n\\t\\t\\t\\tQur'an) for them, except that we do not know what of that\\n\\t\\t\\t\\twould agree with you.' The Messenger of ,Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'Make talismans for\\n\\t\\t\\t\\tthem. Had anything been able to precede the decree, the\\n\\t\\t\\t\\tevil eye would precede it.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "4",
    "sectionHeading": "Guarding from the Evil Eye.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSulayman ibn Yasar that Urwa ibn az-Zubayr told him that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, entered the house of Umm Salama, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace. There\\n\\t\\t\\t\\twas a child weeping in the house, and they told him that\\n\\t\\t\\t\\tit was from the evil eye. Urwa said, \"The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'Why do you not find someone to make a talisman to\\n\\t\\t\\t\\tprotect it from the evil eye?' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "5",
    "sectionHeading": "The Reward of the Invalid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"When the slave is\\n\\t\\t\\t\\till, Allah ta'ala sends two angels to him.\" He said,\\n\\t\\t\\t\\t\"They look at what he says to his visitors. If he praises\\n\\t\\t\\t\\tAllah and lauds Him, when they come to him, they take\\n\\t\\t\\t\\tthat up to Allah, the Mighty, the Majestic, and He knows\\n\\t\\t\\t\\tbest, and He says, 'If I make my slave die, I will make\\n\\t\\t\\t\\thim enter the Garden. If I heal him, I will replace his\\n\\t\\t\\t\\tflesh with better flesh and his blood with better blood\\n\\t\\t\\t\\tand I will efface his evil actions.'\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "6",
    "sectionHeading": "The Reward of the Invalid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Khusayfa\\n\\t\\t\\t\\tthat Urwa ibn az-Zubayr said that he heard A'isha, the\\n\\t\\t\\t\\twife of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, \"The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, 'When a mumin is afflicted by\\n\\t\\t\\t\\tsomething, even a thorn, it removes (or effaces) his\\n\\t\\t\\t\\twrong actions.' \" Yazid did not know which of them Urwa\\n\\t\\t\\t\\tsaid.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "7",
    "sectionHeading": "The Reward of the Invalid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Muhammad ibn Abdullah\\n\\t\\t\\t\\tibn Abi Sasaca said that he heard Abu'l-Hubab Said ibn\\n\\t\\t\\t\\tYasar say that he had heard Abu Hurayra say, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'Allah afflicts the one for whom He desires\\n\\t\\t\\t\\tgood.'\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "8",
    "sectionHeading": "The Reward of the Invalid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tdeath came to a man in the time of the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace. A man\\n\\t\\t\\t\\tsaid, \"He was fortunate,\" as he had died without being\\n\\t\\t\\t\\ttried by illness. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Alas for you, what will\\n\\t\\t\\t\\tlet you know that if Allah had tried him with illness, He\\n\\t\\t\\t\\twould have wiped out his wrong actions.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "9",
    "sectionHeading": "Seeking Refuge and Talismans in Illness",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Khusayfa\\n\\t\\t\\t\\tthat Amr ibn Abdullah ibn Kab as-Salami told him that\\n\\t\\t\\t\\tNafi ibn Jubayr told him that Uthman ibn Abi al-As came\\n\\t\\t\\t\\tto the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace. Uthman said that he had a pain which was\\n\\t\\t\\t\\tenough to kill him. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Rub it with your\\n\\t\\t\\t\\tright hand seven times and say, 'I take refuge with the\\n\\t\\t\\t\\tmight of Allah and His power from the evil of what I\\n\\t\\t\\t\\tfeel.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tUthman added, \"I said that, and Allah removed what I had.\\n\\t\\t\\t\\tI still command my family and others to say it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "10",
    "sectionHeading": "Seeking Refuge and Talismans in Illness",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr from A'isha that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, when he had a\\n\\t\\t\\t\\tcomplaint, would recite the last three suras of Qur'an,\\n\\t\\t\\t\\tover himself and blow. She said, \"When his pain was\\n\\t\\t\\t\\tgreat, I would recite it over him and wipe him with his\\n\\t\\t\\t\\tright hand hoping for its blessing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "11",
    "sectionHeading": "Seeking Refuge and Talismans in Illness",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAmra bint Abd ar-Rahman that Abu Bakr as-Siddiq visited\\n\\t\\t\\t\\tA'isha while she had a complaint and a jewish woman was\\n\\t\\t\\t\\twriting a talisman for her. Abu Bakr said, \"Write it for\\n\\t\\t\\t\\ther from the Book of Allah.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "12",
    "sectionHeading": "Treating the Invalid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that a\\n\\t\\t\\t\\tman received a wound in the time of the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace. The blood\\n\\t\\t\\t\\tclotted in the wound and the man called two men from the\\n\\t\\t\\t\\tBanu Ammar tribe. They looked at it and claimed that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said to them, \"Which of you is the better doctor?\"\\n\\t\\t\\t\\tThey said, \"Is there any good in medicine, Messenger of\\n\\t\\t\\t\\tAllah?\" Zayd claimed that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The one who\\n\\t\\t\\t\\tsent down the disease sent down the remedy.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "13",
    "sectionHeading": "Treating the Invalid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"I heard that Sad ibn Zurara cauterized himself because\\n\\t\\t\\t\\tof a pain in the throat accompanied by blood and he\\n\\t\\t\\t\\tdied.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "14",
    "sectionHeading": "Treating the Invalid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar cauterized for the palsy and he had a talisman\\n\\t\\t\\t\\tmade for a scorpion sting.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "15",
    "sectionHeading": "Washing with Water for a Fever",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\tFatima bint al-Mundhir that whenever a woman who had a\\n\\t\\t\\t\\tfever, was brought to Asma bint Abi Bakr, she made dua\\n\\t\\t\\t\\tfor her and took water and poured it inside her collar.\\n\\t\\t\\t\\tShe said, \"The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, ordered us to cool it with water.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "16",
    "sectionHeading": "Washing with Water for a Fever",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Fever is from the\\n\\t\\t\\t\\tvehemence of the heat of Jahannam, so cool it with\\n\\t\\t\\t\\twater.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Ibn Umar that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Fever is from the vehemence of the heat of\\n\\t\\t\\t\\tJahannam, so put it out with water.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "17",
    "sectionHeading": "Visiting the Invalid and the Evil Omen",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard from\\n\\t\\t\\t\\tJabir ibn Abdullah that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"When a man visits\\n\\t\\t\\t\\tan invalid, he plunges into mercy to the extent that when\\n\\t\\t\\t\\the sits with him, it settles in him,\" or the like of\\n\\t\\t\\t\\tthat.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "50",
    "hadithNumber": "18",
    "sectionHeading": "Visiting the Invalid and the Evil Omen",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard from\\n\\t\\t\\t\\tBukayr ibn Abdullah ibn al-Ashajj from Ibn Atiya that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"There is no contagion, no hama and no\\n\\t\\t\\t\\tserpent in a hungry belly. However, the possessor of sick\\n\\t\\t\\t\\tlivestock must not stop at the same place as the\\n\\t\\t\\t\\tpossessor of healthy livestock, but the possessor of\\n\\t\\t\\t\\thealthy livestock may stop wherever he wishes.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThey said, \"Messenger of Allah, Why is that?\" The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"It is harmful.\"\\n\\t\\t\\t</p>"
  }
]
