[
  {
    "SurahNumber": "25",
    "AyahNumber": "1",
    "NoteID": "3052",
    "Body": "Tabaraka: the root meaning is \"increase\" or \"abundance\".\\n\\t\\t\\t\\tHere that aspect of Allah's dealing with His creatures is\\n\\t\\t\\t\\temphasised, which shows His abundant goodness to all His\\n\\t\\t\\t\\tcreatures, in that He sent the Revelation of His Will,\\n\\t\\t\\t\\tnot only in the unlimited Book of Nature, but in a\\n\\t\\t\\t\\tdefinite Book in human language, which gives clear\\n\\t\\t\\t\\tdirections and admonitions to all. The English word\\n\\t\\t\\t\\t\"blessed\" hardly conveys that meaning, but I can find no\\n\\t\\t\\t\\tother without departing far from established usage. To\\n\\t\\t\\t\\temphasise the meaning I have explained, I have translated\\n\\t\\t\\t\\t\"Blessed is...\" but \"Blessed be...\" is also admissible,\\n\\t\\t\\t\\tas it brings out another shade of meaning, that we praise\\n\\t\\t\\t\\tand bless His holy name."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "1",
    "NoteID": "3053",
    "Body": "That by which we can judge clearly between right and\\n\\t\\t\\t\\twrong. Here the reference is to the Qur-an, which has\\n\\t\\t\\t\\talready been symbolised by light. This symbol is\\n\\t\\t\\t\\tcontinued here, and many contrasts are shown, in the\\n\\t\\t\\t\\tmidst of which we can distinguish between the true and\\n\\t\\t\\t\\tthe false by Allah's Light, especially the contrast\\n\\t\\t\\t\\tbetween righteousness and sin."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "1",
    "NoteID": "3054",
    "Body": "The pronoun in yakuna may refer either to Furqan (the\\n\\t\\t\\t\\tCriterion) or to 'Abd (the holy Prophet). In either case\\n\\t\\t\\t\\tthe ultimate meaning is the same. The Qur-an is the\\n\\t\\t\\t\\tstanding Criterion for judgment between right and wrong."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "2",
    "NoteID": "3055",
    "Body": "The majesty of Allah and His independence of all wants or\\n\\t\\t\\t\\thelp are mentioned to show how exceedingly great is His\\n\\t\\t\\t\\tgoodness in revealing His Will to us."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "3",
    "NoteID": "3056",
    "Body": "This is the first great distinction taught by the\\n\\t\\t\\t\\tCriterion; to know the attributes of the true God, as\\n\\t\\t\\t\\tagainst the false fancies of men."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "4",
    "NoteID": "3057",
    "Body": "Ifk, which I have translated a \"lie\" may be distinguished\\n\\t\\t\\t\\tfrom zur at the end of this verse, translated\\n\\t\\t\\t\\t\"falsehood\". The \"lie\" which the enemies attributed to\\n\\t\\t\\t\\tthe holy Prophet of Allah was supposed to be something\\n\\t\\t\\t\\twhich did not exist in reality, but was invented by him\\n\\t\\t\\t\\twith the aid of other people: the implication was that\\n\\t\\t\\t\\t(1) the Revelation was not a revelation but a forgery,\\n\\t\\t\\t\\tand that (2) the things revealed e.g. the news of the\\n\\t\\t\\t\\tHereafter, the Resurrection, the Judgment, the Bliss of\\n\\t\\t\\t\\tthe Righteous and the sufferings of the Evil, were\\n\\t\\t\\t\\tfanciful and had no basis in fact. Delusion is also\\n\\t\\t\\t\\tsuggested. The reply is that, so far from that being the\\n\\t\\t\\t\\tcase, the facts were true and the charges were false\\n\\t\\t\\t\\t(zar),-the falsehood being due to the habits of iniquity\\n\\t\\t\\t\\tfor which the Misbelievers' whole mental and spiritual\\n\\t\\t\\t\\tattitude was responsible."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "5",
    "NoteID": "3058",
    "Body": "In their misguided arrogance they say: 'We have heard\\n\\t\\t\\t\\tsuch things before; they are pretty tales which have come\\n\\t\\t\\t\\tdown from ancient times; they are good for amusement, but\\n\\t\\t\\t\\twho takes them seriously?' When the beauty and power of\\n\\t\\t\\t\\tthe Revelation are pointed out, and its miracle as coming\\n\\t\\t\\t\\tfrom an unlearned man, they again hint at other men who\\n\\t\\t\\t\\twrote them, though they could not produce any one who\\n\\t\\t\\t\\tcould write anything like it."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "6",
    "NoteID": "3059",
    "Body": "The answer is that the Qur-an teaches spiritual knowledge\\n\\t\\t\\t\\tof what is ordinarily hidden from men's sight, and such\\n\\t\\t\\t\\tknowledge can only come from Allah, to Whom alone is\\n\\t\\t\\t\\tknown the secret of the whole Creation. In spite of man's\\n\\t\\t\\t\\tsin and shortcomings, He forgives, and He sends His most\\n\\t\\t\\t\\tprecious gift, i.e., the revelation of His Will."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "7",
    "NoteID": "3060",
    "Body": "This is another objection: 'He is only a man like us: why\\n\\t\\t\\t\\tis not an angel sent down, if not by himself, at least\\n\\t\\t\\t\\twith him?' The answer is: angels would be of no use to\\n\\t\\t\\t\\tmen as Messengers, as they and men would not understand\\n\\t\\t\\t\\teach other, and if angels came, it might cause more\\n\\t\\t\\t\\tconfusion and wonder than understanding in men's minds.\\n\\t\\t\\t\\tCf. xxi. 7-8; xxvii, 94-95. The office of an angel is\\n\\t\\t\\t\\tdifferent. A teacher for mankind is one who shares their\\n\\t\\t\\t\\tnature, mingles in their life, is acquainted with their\\n\\t\\t\\t\\tdoings, and sympathises with their joys and sorrows."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "8",
    "NoteID": "3061",
    "Body": "Literally, 'that he may eat out of it'. As shown in n.\\n\\t\\t\\t\\t776 to v. 69, akala (to eat) has a comrpehensive meaning,\\n\\t\\t\\t\\timplying enjoyment of all kinds. Here the garden itself\\n\\t\\t\\t\\tstands for a type of the amenities of life: its fruits\\n\\t\\t\\t\\twould be available for eating, its coolness for rest and\\n\\t\\t\\t\\trefreshment, its waters and its landscape for aesthetic\\n\\t\\t\\t\\tdelight."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "8",
    "NoteID": "3062",
    "Body": "Cf. xvii. 47. This speech, of the wicked or the ungodly,\\n\\t\\t\\t\\tis meant to be even more bitter than that of the\\n\\t\\t\\t\\tMisbelievers. It makes out the Prophet to be a demented\\n\\t\\t\\t\\tfool!"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "9",
    "NoteID": "3063",
    "Body": "The charges the enemies made against the Messenger of\\n\\t\\t\\t\\tAllah recoiled on those who made them. The Messenger was\\n\\t\\t\\t\\tvindicated, and went from strength to strength, for\\n\\t\\t\\t\\tAllah's Truth will always prevail. The men who perversely\\n\\t\\t\\t\\tleave the way of truth, righteousness, and sincerity,\\n\\t\\t\\t\\thave not only missed the Way, but on account of their\\n\\t\\t\\t\\tperversity they will never be able to find any way by\\n\\t\\t\\t\\twhich they can get back to Truth."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "10",
    "NoteID": "3064",
    "Body": "Cf. above, xxv. 1. The reminiscent phrase shows that the\\n\\t\\t\\t\\tfirst argument, about the Revelation and Prophethood, is\\n\\t\\t\\t\\tcompleted, and we now pass on to the contrast, the fate\\n\\t\\t\\t\\tof the rejecters of both."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "10",
    "NoteID": "3065",
    "Body": "See the last note."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "11",
    "NoteID": "3066",
    "Body": "Denying the Hour of Judgment means denying the power of\\n\\t\\t\\t\\tJustice and Truth to triumph; it means asserting the\\n\\t\\t\\t\\tdominion of Evil. But Allah himself will punish them, as\\n\\t\\t\\t\\tshown in the following verses."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "12",
    "NoteID": "3067",
    "Body": "For zafir, a deep emission of breath or a sigh, see n.\\n\\t\\t\\t\\t1607 to xi. 106. Here the Fire is personified. It is\\n\\t\\t\\t\\traging with hunger and fury, and as soon as it sees them\\n\\t\\t\\t\\tfrom ever so far, it emits a sigh of desire. Till then\\n\\t\\t\\t\\tthey had not realised their full danger. Now, just as\\n\\t\\t\\t\\ttheir heart begins to tremble with terror, they are bound\\n\\t\\t\\t\\ttogether-like with like,-and cast into the roaring\\n\\t\\t\\t\\tflames!"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "13",
    "NoteID": "3068",
    "Body": "Anything-total annihilation-would be better than the\\n\\t\\t\\t\\tanguish they will suffer. But no annihilation will be\\n\\t\\t\\t\\tgranted to them. One destruction will not be enough to\\n\\t\\t\\t\\twipe out the intensity of their anguish. They will have\\n\\t\\t\\t\\tto ask for many destructions, but they will not get them!"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "15",
    "NoteID": "3069",
    "Body": "Shifting the scene back to this life, they may fairly be\\n\\t\\t\\t\\tasked: \"Here is the result of the two courses of conduct:\\n\\t\\t\\t\\twhich do you prefer?\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "15",
    "NoteID": "3070",
    "Body": "To the righteous, the final Bliss will in one sense be a\\n\\t\\t\\t\\treward. But the word \"reward\" does not truly represent\\n\\t\\t\\t\\tfacts, for two reasons: (1) the Bliss will be greater\\n\\t\\t\\t\\tthan they deserved; and (2) righteousness is its own\\n\\t\\t\\t\\treward. The best way of expressing the result would be to\\n\\t\\t\\t\\tsay that their highest Wish will now have been attained;\\n\\t\\t\\t\\tthe goal will have been reached; they will be in Allah's\\n\\t\\t\\t\\tPresence. That is salvation in the highest."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "16",
    "NoteID": "3071",
    "Body": "That is the sort of thing-to be prayed for from Allah\\n\\t\\t\\t\\twhich he has made binding upon Himself and not ephemeral\\n\\t\\t\\t\\tthings, even though they may be good. And that is the\\n\\t\\t\\t\\tsort of thing that Allah has promised and undertaken to\\n\\t\\t\\t\\tgive."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "17",
    "NoteID": "3072",
    "Body": "The question is as in a Court of Justice, to convince\\n\\t\\t\\t\\tthose who stand arraigned."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "18",
    "NoteID": "3073",
    "Body": "The creatures of Allah who were worshipped will prove\\n\\t\\t\\t\\tthat they never asked for worship : on the contrary they\\n\\t\\t\\t\\tthemselves worshipped Allah and sought the protection of\\n\\t\\t\\t\\tAllah and of none but Allah. Cf. xlvi. 5-6. They will go\\n\\t\\t\\t\\tfurther and show that the false worshippers added\\n\\t\\t\\t\\tingratitude to their other sins: for Allah bestowed\\n\\t\\t\\t\\tabundance on them, and they blasphemed against Allah.\\n\\t\\t\\t\\tThey were indeed \"worthless and destroyed\", for the word\\n\\t\\t\\t\\tbar bears both significations."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "19",
    "NoteID": "3074",
    "Body": "The argument is as in a court of justice. If the false\\n\\t\\t\\t\\tworshippers plead that they were misled by those whom\\n\\t\\t\\t\\tthey falsely worshipped, the latter will be confronted\\n\\t\\t\\t\\twith them and will prove that plea to be false. No help\\n\\t\\t\\t\\tcan be got from them, and the penalty cannot then be\\n\\t\\t\\t\\taverted. After all these things are thus explained in\\n\\t\\t\\t\\tdetail beforehand, all ungodly men should repent and tum\\n\\t\\t\\t\\tto Allah. False worship is here indentified with sin, for\\n\\t\\t\\t\\tsin is disobedience to Allah, and arises from a wrong\\n\\t\\t\\t\\tappreciation of Allah's attributes and His goodness to\\n\\t\\t\\t\\tHis creatures. The sinful man refuses, in his conduct, to\\n\\t\\t\\t\\tserve Allah: he serves other things than Allah."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "20",
    "NoteID": "3075",
    "Body": "Cf. above, xxv. 7."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "20",
    "NoteID": "3076",
    "Body": "In Allah's universal Plan, each unit or thing serves a\\n\\t\\t\\t\\tpurpose. If some are rich, the poor should not envy them:\\n\\t\\t\\t\\tit may be that the rich man's proximity is itself a trial\\n\\t\\t\\t\\tof their virtue. If some are poor, the righteous rich\\n\\t\\t\\t\\tshould not despise or neglect them: it may be that their\\n\\t\\t\\t\\tcoming within their sight is a trial for the real feeling\\n\\t\\t\\t\\tof charity or brotherly love in the rich. If A is\\n\\t\\t\\t\\tbad-tempered or persecutes or ill-uses B, it may be an\\n\\t\\t\\t\\topportunity for B to show his patience or humility or his\\n\\t\\t\\t\\tfaith in the ultimate prevalence of justice and truth.\\n\\t\\t\\t\\tWhatever our experiences with other human beings may be,\\n\\t\\t\\t\\twe must make them subserve the ends of our spiritual\\n\\t\\t\\t\\timprovement and perhaps theirs also."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "21",
    "NoteID": "3077",
    "Body": "The blasphemers who have given up all Faith and laugh at\\n\\t\\t\\t\\tthe Hereafter: nothing is sacred to them: their arrogance\\n\\t\\t\\t\\tand insolence are beyond all bounds."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "21",
    "NoteID": "3078",
    "Body": "Cf. ii. 55. The Israelites in the time of Moses demanded\\n\\t\\t\\t\\tto see Allah. But they were struck with thunder and\\n\\t\\t\\t\\tlightning even as they looked on. Indeed death would have\\n\\t\\t\\t\\tbeen their fate, had it not been for the mercy of Allah."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "22",
    "NoteID": "3079",
    "Body": "They will not be allowed to enjoy any of the felicity or\\n\\t\\t\\t\\tpeace which will be the normal state of the new world of\\n\\t\\t\\t\\tReality. Their own past will stand as a barrier to shut\\n\\t\\t\\t\\tthem off ."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "23",
    "NoteID": "3080",
    "Body": "The false hopes they built on in this life, and the deeds\\n\\t\\t\\t\\tdid under the shadow of such false hopes will be\\n\\t\\t\\t\\tdissipated as if they were dust flying about in the wind.\\n\\t\\t\\t\\tThey will have no value whatever."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "24",
    "NoteID": "3081",
    "Body": "The barrier which will shut out the evil ones will not\\n\\t\\t\\t\\texist for the righteous, who will have an abode of bliss\\n\\t\\t\\t\\tand repose, for they will be in the Garden of bliss."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "25",
    "NoteID": "3082",
    "Body": "It will be a new world, and the way to describe it must\\n\\t\\t\\t\\tnecessarily draw upon our present experience of the\\n\\t\\t\\t\\tfinest things in nature. The sky, which now appears\\n\\t\\t\\t\\tremote and unpeopled will be rent asunder. There will\\n\\t\\t\\t\\tappear clouds of glory-angels and spiritual Lights of all\\n\\t\\t\\t\\tgrades and ranks-and the true majesty and goodness of\\n\\t\\t\\t\\tAllah will be visible as it should be in reality, and as\\n\\t\\t\\t\\tit is not now, on account of \"our muddy vesture of\\n\\t\\t\\t\\tdecay\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "26",
    "NoteID": "3083",
    "Body": "See last note."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "27",
    "NoteID": "3084",
    "Body": "The words are general, and for us the interest is in a\\n\\t\\t\\t\\tgeneral sense. A man who actually receives the Truth and\\n\\t\\t\\t\\tis on the right path is all the more culpable if he is\\n\\t\\t\\t\\tdiverted from that path by the machinations of a worldly\\n\\t\\t\\t\\tfriend. The particular person whom some Commentators\\n\\t\\t\\t\\tmention in this connection was one 'Uqba who received the\\n\\t\\t\\t\\tlight of Islam, but was misled afterwards by a worldly\\n\\t\\t\\t\\tfriend into apostasy and blasphemy. He came to an evil\\n\\t\\t\\t\\tend afterwards."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "29",
    "NoteID": "3085",
    "Body": "The seductive wiles of the Satan are merely meant for\\n\\t\\t\\t\\tsnares. There is fraud and treachery in them. The\\n\\t\\t\\t\\tdeceived ones are left in the lurch after the way of\\n\\t\\t\\t\\tescape is made impossible for them."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "30",
    "NoteID": "3086",
    "Body": "\"My people\" are of course the unbelieving Quraish. They\\n\\t\\t\\t\\ttreated the Qur-an with neglect, i.e., something to be\\n\\t\\t\\t\\tdiscarded. But they were only a handful of people whose\\n\\t\\t\\t\\tvested interests were touched by the beneficent reforms\\n\\t\\t\\t\\tinitiated by Islam. They soon passed away, and all\\n\\t\\t\\t\\tArabic-speaking or Arabic-understanding people have\\n\\t\\t\\t\\tconsidered the Qur-an as a treasury of Truths expressed\\n\\t\\t\\t\\tin the most beautiful possible language, with a meaning\\n\\t\\t\\t\\tthat grows deeper with research."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "31",
    "NoteID": "3087",
    "Body": "It is the nature of sin to be hostile to truth and\\n\\t\\t\\t\\trighteousness, but such hostility will not harm the\\n\\t\\t\\t\\trighteous and need cause no misgiving because Allah will\\n\\t\\t\\t\\tguide and help those who work in His cause. And what\\n\\t\\t\\t\\tcould he better or more effective than His guidance and\\n\\t\\t\\t\\thelp?"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "32",
    "NoteID": "3088",
    "Body": "Three reasons are given for the gradual revelation of the\\n\\t\\t\\t\\tQur-an. (1) \"To strengthen thy heart\": the tremendous\\n\\t\\t\\t\\ttask of winning the Arab nation, and, through them, the\\n\\t\\t\\t\\twhole world, to Islam, required superhuman patience,\\n\\t\\t\\t\\tconstancy, and firmness, and these qualities were\\n\\t\\t\\t\\tstrengthened by the gradual promulgation of solutions to\\n\\t\\t\\t\\teach difficulty as it arose. (2) \"Slow, well-arranged\\n\\t\\t\\t\\tstages\": though the stages were gradual, as the occasion\\n\\t\\t\\t\\tdemanded from time to time, in the course of twenty-three\\n\\t\\t\\t\\tyears, the whole emerged, when completed, as a\\n\\t\\t\\t\\twell-arranged scheme of spiritual instruction, as we have\\n\\t\\t\\t\\tseen in following the arrangement of the Suras. (3)\\n\\t\\t\\t\\tQuestions put and answers given: see next note."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "33",
    "NoteID": "3089",
    "Body": "Divine knowledge is a fathomless ocean. But glimpses of\\n\\t\\t\\t\\tit can be obtained by any individuals sincerely searching\\n\\t\\t\\t\\tfor the Truth. Their progress will be in grades. If they\\n\\t\\t\\t\\task questions, and answers are then furnished to them,\\n\\t\\t\\t\\tthey are more likely to apprehend the Truth, as they have\\n\\t\\t\\t\\talready explored the part of the territory in which they\\n\\t\\t\\t\\tare interested. In the same way, when concrete questions\\n\\t\\t\\t\\tarise by the logic of events, and they are answered not\\n\\t\\t\\t\\tonly for the occasion, but from a general stand-point,\\n\\t\\t\\t\\tthe teaching has a far greater chance of penetrating the\\n\\t\\t\\t\\thuman intelligence and taking shape in practical conduct.\\n\\t\\t\\t\\tAnd this is the usual way of instruction in the Qur-an."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "34",
    "NoteID": "3090",
    "Body": "That is, in ignominy."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "34",
    "NoteID": "3091",
    "Body": "This verse may be compared and contrasted with xxv. 24\\n\\t\\t\\t\\tabove. Here the argument is rounded off about the\\n\\t\\t\\t\\tdistinction between the Good and Evil in their final\\n\\t\\t\\t\\tDestiny. The Good are to have \"the fairest of places for\\n\\t\\t\\t\\trepose\", and in contrast, the Evil are, \"as to Path, most\\n\\t\\t\\t\\tastray\". They have no repose, and their wanderings lead\\n\\t\\t\\t\\tnowhere."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "35",
    "NoteID": "3092",
    "Body": "Cf. xx. 29, and the whole passage there, which is merely\\n\\t\\t\\t\\treferred to here, to show how previous Prophets were\\n\\t\\t\\t\\ttreated, but how they stuck fast to the Criterion given,\\n\\t\\t\\t\\tto distinguish between Good and Evil."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "37",
    "NoteID": "3093",
    "Body": "The stories of Noah, of the prophets of 'Ad and Thamud\\n\\t\\t\\t\\t(and of other prophets), in the reactions of their\\n\\t\\t\\t\\tcommunities to their teaching are told in xxvi. 105-159,\\n\\t\\t\\t\\tbelow. Here they are just mentioned to illustrate how\\n\\t\\t\\t\\tlittle respect past ages had for their prophets and\\n\\t\\t\\t\\tteachers of Truth. But Allah's Truth did not suffer: it\\n\\t\\t\\t\\twas the blind rejecters of spiritual Truth who were wiped\\n\\t\\t\\t\\tout."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "38",
    "NoteID": "3094",
    "Body": "Commentators are not clear as to who the \"Companions of\\n\\t\\t\\t\\tthe Rass\" were. The root meaning of \"rass\" is an old well\\n\\t\\t\\t\\tor shallow water-pit. Another root connects it with the\\n\\t\\t\\t\\tburial of the dead. But it is probably the name of a town\\n\\t\\t\\t\\tor place. The \"Companions of the Rass\" may well have been\\n\\t\\t\\t\\tthe people of Shu'aib, as they are here mentioned with\\n\\t\\t\\t\\tthe 'Ad, the Thamud, and Lot's people, and the people of\\n\\t\\t\\t\\tShu'aib are mentioned in a similar connection in xxvi.\\n\\t\\t\\t\\t176-190 and in xi. 84-95. Shu'aib was the prophet of the\\n\\t\\t\\t\\tMadyan people in the north-west of Arabia, where many old\\n\\t\\t\\t\\twells are found. There is however an oasis town al-Rass\\n\\t\\t\\t\\tin the district of Qasim in Middle Najd, about\\n\\t\\t\\t\\tthirty-five miles south-west of the town of 'Unaiza,\\n\\t\\t\\t\\treputed to be the central point of the Arabian Peninsula,\\n\\t\\t\\t\\tand situated midway between Makkah and Basra. See\\n\\t\\t\\t\\tDoughty's Arabia Deserts, thin-paper one-volume edition,\\n\\t\\t\\t\\tLondon 1926, 11, 435 and Map, Lat. 26*N., and Long. 43*E."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "40",
    "NoteID": "3095",
    "Body": "This refers to Lut's story and the destruction of Sodom\\n\\t\\t\\t\\tand Gomorrah, the wicked cities of the plain near the\\n\\t\\t\\t\\tDead Sea, by a shower of brimstone. The site lies on the\\n\\t\\t\\t\\thighway between Arabia and Syria. Cf. xv. 74, 76, and n.\\n\\t\\t\\t\\t1998."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "42",
    "NoteID": "3096",
    "Body": "\"Path\" (Sabil) is almost equivalent here to conduct, way\\n\\t\\t\\t\\tof life."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "43",
    "NoteID": "3097",
    "Body": "The man who worships his own passions or impulses or\\n\\t\\t\\t\\tdesires is the most hopeless to teach or lead or guide.\\n\\t\\t\\t\\tIf it were anything else the matter with him, the Prophet\\n\\t\\t\\t\\tcould argue with him. But Reason cannot prevail over\\n\\t\\t\\t\\tblind passion. It is vain to hope that such a man could\\n\\t\\t\\t\\tbe led, until his mad desires are killed. No one could\\n\\t\\t\\t\\tundertake any responsibility for him, for he obeys no law\\n\\t\\t\\t\\tand follows no advice. He is worse than brute beasts,\\n\\t\\t\\t\\twhich may not understand, but at least follow the\\n\\t\\t\\t\\twholesome instincts implanted in them by Allah. The\\n\\t\\t\\t\\tlawless man has killed his instincts and is unwilling to\\n\\t\\t\\t\\tsubmit to guidance."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "45",
    "NoteID": "3098",
    "Body": "We saw in xxiv. 35 that Allah is the Light of the heavens\\n\\t\\t\\t\\tand the earth. We have now another sublime passage, in\\n\\t\\t\\t\\twhich we are asked to contemplate the Glory of Allah by a\\n\\t\\t\\t\\tparable of the subtle play of Light and Shade in Allah's\\n\\t\\t\\t\\tcreation."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "45",
    "NoteID": "3099",
    "Body": "In our artificial life and surroundings we fail to see\\n\\t\\t\\t\\tsome of the finest mysteries of Light and Shade. We\\n\\t\\t\\t\\tpraise, and rightly, the wonderful colors of sunset. We\\n\\t\\t\\t\\tsee, particularly in climates more northerly than that of\\n\\t\\t\\t\\tIndia, the subtle play of Light and Shade in the\\n\\t\\t\\t\\ttwilights succeeding sunsets. If we were as assiduous in\\n\\t\\t\\t\\tseeing sunrises and the play of Light and Shade preceding\\n\\t\\t\\t\\tthem, we should see phenomena even more impressive, as\\n\\t\\t\\t\\tthe early moming seems to us more holy than any other\\n\\t\\t\\t\\ttime in the twenty-four hours of the sun's daily journey.\\n\\t\\t\\t\\tThere is first the false dawn, with its curious uncertain\\n\\t\\t\\t\\tlight and the curious long uncertain shadows which it\\n\\t\\t\\t\\tcasts. Then there are the streaks of black in the East,\\n\\t\\t\\t\\tsucceeded by the true dawn, with its delicate tones of\\n\\t\\t\\t\\tcolours and light and shade. The light of this true or\\n\\t\\t\\t\\tfalse Dawn is not given by the direct rays of the sun. In\\n\\t\\t\\t\\ta sense it is not light, but the shadows or reflections\\n\\t\\t\\t\\tof light. And they gradually merge into actual sunrise,\\n\\t\\t\\t\\twith its more substantial or more defined shadows, which\\n\\t\\t\\t\\twe can definitely connect with the sun."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "45",
    "NoteID": "3100",
    "Body": "The morning shadows are long but more definite, and their\\n\\t\\t\\t\\tlength and direction are seen to be guided by the sun.\\n\\t\\t\\t\\tBut they change insensibly every second or fraction of a\\n\\t\\t\\t\\tsecond."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "46",
    "NoteID": "3101",
    "Body": "As the sun rises higher and higher, the shadows contract.\\n\\t\\t\\t\\tIn regions where the sun gets actually to the zenith at\\n\\t\\t\\t\\tnoon, there is no shadow left at that time. Where does it\\n\\t\\t\\t\\tgo to? It was but a shadow cast by a substance and it\\n\\t\\t\\t\\tgets absorbed by the substance which produced it."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "46",
    "NoteID": "3102",
    "Body": "The shadows are constantly in a state of flux; so are all\\n\\t\\t\\t\\tthings in Creation, all things we see or covet in this\\n\\t\\t\\t\\tlife. Allah, if He wills, can give some of them greater\\n\\t\\t\\t\\tfixity or comparative stability."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "47",
    "NoteID": "3103",
    "Body": "It is still the contrast between Light and Shade; but the\\n\\t\\t\\t\\tshade of Night is as a Robe to cover and screen us and\\n\\t\\t\\t\\tgive us Repose from activity; and the Light of Day is for\\n\\t\\t\\t\\tstriving, work, activity. Or again, the Night is like\\n\\t\\t\\t\\tDeath, our temporary Death before Judgment, the time\\n\\t\\t\\t\\tduring which our senses are as sealed in Sleep; and the\\n\\t\\t\\t\\tDay is like the renewal of Life at the Resurrection."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "48",
    "NoteID": "3104",
    "Body": "Cf. vii. 57. The Winds are heralds of Joy, ushering in\\n\\t\\t\\t\\tRain, which is one form of Allah's Mercy. Again, the\\n\\t\\t\\t\\tsymbolism presents a fresh point of view. Heat (which is\\n\\t\\t\\t\\tconnected with light) sets up currents in the atmosphere,\\n\\t\\t\\t\\tbesides sucking up moisture from the seas, and\\n\\t\\t\\t\\tdistributing it by means of Winds over wide surfaces of\\n\\t\\t\\t\\tthe earth. In the physical world we know the beneficent\\n\\t\\t\\t\\taction of heat on life, and by contrast, we also know how\\n\\t\\t\\t\\tintolerable high temperatures may become, and how the\\n\\t\\t\\t\\tcloud-bearing Winds come as welcome heralds of rain."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "48",
    "NoteID": "3105",
    "Body": "Rain water (in pure air) is not only pure water distilled\\n\\t\\t\\t\\tin air and sky, but it is the best purifying and\\n\\t\\t\\t\\tsanitating agent on the largest scale known to US."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "49",
    "NoteID": "3106",
    "Body": "The whole cycle of water,-sea, clouds, rain or hail or\\n\\t\\t\\t\\tsnow, rivers, and sea again,-is a remarkable illustration\\n\\t\\t\\t\\tof the processes of nature making Allah's providence\\n\\t\\t\\t\\tvisible to us. The salts of the sea sanitate and purify\\n\\t\\t\\t\\tall the filth that pours into it. Water action, in the\\n\\t\\t\\t\\tform of rain, frost, glaciers, rivers, lakes, etc., is\\n\\t\\t\\t\\tresponsible for the building up and configuration of the\\n\\t\\t\\t\\tcrust of the earth, and is the chief agent in physical\\n\\t\\t\\t\\tgeography. A parched desert quickly comes to life under\\n\\t\\t\\t\\tthe action of water. All drinking water, whether derived\\n\\t\\t\\t\\tfrom rivers, canals, lakes, reservoirs, springs, wells,\\n\\t\\t\\t\\tor water-works of any kind, are ultimately traceable to\\n\\t\\t\\t\\train. The connection of life with water is intimate. The\\n\\t\\t\\t\\tphysical basis of life itself, protoplasm, is in great\\n\\t\\t\\t\\tpart water; see xxv. 54 below."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "50",
    "NoteID": "3107",
    "Body": "The water is distributed all over the world, in order\\n\\t\\t\\t\\tthat all life may receive its support according to its\\n\\t\\t\\t\\tneeds. In xxv. 48-50, we have the argument of contrasts\\n\\t\\t\\t\\tstated in another way. Water is life, and is made\\n\\t\\t\\t\\tavailable to sustain life all over the world; this is a\\n\\t\\t\\t\\tphysical fact which all can see. But water is also the\\n\\t\\t\\t\\tsymbol of spiritual life, whose sustaining principle is\\n\\t\\t\\t\\tthe Will of Allah as made known to us through Revelation.\\n\\t\\t\\t\\tIt sometimes comes to us in our inward or spiritual\\n\\t\\t\\t\\tstorms. Many violent unsettlements of the spirit are but\\n\\t\\t\\t\\theralds of the refreshing showers of spiritual\\n\\t\\t\\t\\tunderstanding that come in their wake. They purify our\\n\\t\\t\\t\\tsouls, and produce spiritual Life even where there was a\\n\\t\\t\\t\\tparched spiritual desert before. They continue to sustain\\n\\t\\t\\t\\tus in our normal spiritual Life out of the reservoirs of\\n\\t\\t\\t\\tAllah's Revelation, which are open to all, and well\\n\\t\\t\\t\\tdistributed in time and space. The universality of\\n\\t\\t\\t\\tdistribution is again referred to in the following verse."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "50",
    "NoteID": "3108",
    "Body": "In contrast to Allah's abounding Mercy is man's base\\n\\t\\t\\t\\tingratitude."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "51",
    "NoteID": "3109",
    "Body": "Allah's Message has been distributed to all nations. If\\n\\t\\t\\t\\tit had been necessary, a Prophet could have been sent to\\n\\t\\t\\t\\tevery town and village. But Allah's Plan is different. He\\n\\t\\t\\t\\thas sent His Light to every heart, through His Signs in\\n\\t\\t\\t\\tman's conscience, in Nature, and in Revelation."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "52",
    "NoteID": "3110",
    "Body": "The distribution of Allah's Signs being universal, the\\n\\t\\t\\t\\tProphet of Allah pays no heed to carping critics who\\n\\t\\t\\t\\treject Faith. He wages the biggest Jihad of all, with the\\n\\t\\t\\t\\tweapon of Allah's Revelation."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "53",
    "NoteID": "3111",
    "Body": "Maraja: literally, let free or let loose cattle for\\n\\t\\t\\t\\tgrazing. Bahrain: two seas, or two bodies of flowing\\n\\t\\t\\t\\twater; for bahr is applied both to the salt sea and to\\n\\t\\t\\t\\trivers. In the world taken as a whole, there are two\\n\\t\\t\\t\\tbodies of water, viz.,: (1) the great salt Ocean, and (2)\\n\\t\\t\\t\\tthe bodies of sweet water fed by rain, whether they are\\n\\t\\t\\t\\trivers, lakes or underground springs: their source in\\n\\t\\t\\t\\train makes them one, and their drainage, whether\\n\\t\\t\\t\\tabove-ground or underground, eventually to the Ocean,\\n\\t\\t\\t\\talso makes them one. They are free to mingle, and in a\\n\\t\\t\\t\\tsense they do mingle, for there is a regular water-cycle:\\n\\t\\t\\t\\tsee n. 3106 above: and the rivers flow constantly to the\\n\\t\\t\\t\\tsea, and tidal rivers get sea-water for several miles up\\n\\t\\t\\t\\ttheir estuaries at high tide. Yet in spite of all this,\\n\\t\\t\\t\\tthe laws of gravitation are like a barrier or partition\\n\\t\\t\\t\\tset by Allah, by which the two bodies of water as a whole\\n\\t\\t\\t\\tare always kept apart and distinct. In the case of rivers\\n\\t\\t\\t\\tcarrying large quantities of water to the sea, like the\\n\\t\\t\\t\\tMississippi or the Yangtse-Kiang, the river-water with\\n\\t\\t\\t\\tits silt remains distinct from sea-water for a long\\n\\t\\t\\t\\tdistance out at sea. But the wonderful Sign is that the\\n\\t\\t\\t\\ttwo bodies of water, though they pass through each other,\\n\\t\\t\\t\\tremain distinct bodies, with their distinct functions."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "53",
    "NoteID": "3112",
    "Body": "In Allah's overall scheme of things, bodies of salt and\\n\\t\\t\\t\\tsweet water, which are adjoining and yet separate, have\\n\\t\\t\\t\\tsignificant functions. Weaving a harmonious fabric out of\\n\\t\\t\\t\\tthese different fibres shows both Allah's power and\\n\\t\\t\\t\\twisdom. Incidentally, this verse points to a fact which\\n\\t\\t\\t\\thas only recently been discovered by science. This fact\\n\\t\\t\\t\\trelates to the oceans of the world: they meet and yet\\n\\t\\t\\t\\teach remains separate for Allah has placed \"a barrier, a\\n\\t\\t\\t\\tpartition\" between them."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "54",
    "NoteID": "3113",
    "Body": "The basis of all living matter in the physical world,\\n\\t\\t\\t\\tprotoplasm, is water: Cf. xxiv. 45 and xxi. 30, and notes\\n\\t\\t\\t\\tthereon."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "54",
    "NoteID": "3114",
    "Body": "Water is a fluid, unstable thing: yet from it arises the\\n\\t\\t\\t\\thighest form of life known to us, in this world, man. And\\n\\t\\t\\t\\tman has not only the functions and characteristics of the\\n\\t\\t\\t\\tnoblest animals, but his abstract relationships are also\\n\\t\\t\\t\\ttypical of his highest nature. He can trace lineage and\\n\\t\\t\\t\\tpedigree, and thus remember and commemorate a long line\\n\\t\\t\\t\\tof ancestors, to whom he is bound by ties of piety, which\\n\\t\\t\\t\\tno mere animals can do. Further, there is the union in\\n\\t\\t\\t\\tmarriage: it is not only like the physical union of\\n\\t\\t\\t\\tanimals, but it gives rise to relationships arising out\\n\\t\\t\\t\\tof the sexes of individuals who were not otherwise\\n\\t\\t\\t\\trelated to each other. These are physical and social\\n\\t\\t\\t\\tfacts."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "55",
    "NoteID": "3115",
    "Body": "Here is the highest contrast of all-material things which\\n\\t\\t\\t\\tare inert, and Allah, Whose goodness and power are\\n\\t\\t\\t\\tsupreme; Faith and Unfaith, meriting glad tidings and\\n\\t\\t\\t\\tadmonition; the selfish man who is self-centred, and the\\n\\t\\t\\t\\tman of God, who works for others without reward."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "58",
    "NoteID": "3116",
    "Body": "Allah knows our faults better than we or anyone else. It\\n\\t\\t\\t\\tis no use hiding anything from Him. We must put our trust\\n\\t\\t\\t\\tcompletely in Him. His care is for all, and He is Allah\\n\\t\\t\\t\\tMost Gracious."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "59",
    "NoteID": "3117",
    "Body": "Cf. vii. 54 and n. 1031."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "59",
    "NoteID": "3118",
    "Body": "See n. 1386 to x. 3."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "59",
    "NoteID": "3119",
    "Body": "The argument is about the question, in whom shall we put\\n\\t\\t\\t\\tour trust? Worldly men put their trust in wordly things:\\n\\t\\t\\t\\tthe righteous man only in Allah. The true distinction\\n\\t\\t\\t\\twill be quite clear from a ray of divine knowledge. If\\n\\t\\t\\t\\tyou do not see it all clearly, ask of those who possess\\n\\t\\t\\t\\tsuch knowledge."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "60",
    "NoteID": "3120",
    "Body": "Those who have no spiritual Light cannot understand this\\n\\t\\t\\t\\tprecept about putting all our trust in Allah. It seems to\\n\\t\\t\\t\\tthem foolish. They have no faith, or but a superficial\\n\\t\\t\\t\\tfaith. They may possibly take the name of Allah on their\\n\\t\\t\\t\\tlips, but they cannot understand the full significance of\\n\\t\\t\\t\\tHis title of Rahman (Most Gracious). Perhaps they are\\n\\t\\t\\t\\tafraid on account of their sins; perhaps they do not see\\n\\t\\t\\t\\thow unbounded is the mercy of Allah. Such men are\\n\\t\\t\\t\\tcontrasted against the true servants of Allah, who are\\n\\t\\t\\t\\tdescribed below in xxv. 63-75."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "61",
    "NoteID": "3121",
    "Body": "The glorious Lamp of the skies is the Sun; and next to\\n\\t\\t\\t\\thim is the Moon, which gives borrowed light. The\\n\\t\\t\\t\\tConstellations of course include the Signs of the Zodiac,\\n\\t\\t\\t\\twhich mark the path of the planets in the heavens."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "62",
    "NoteID": "3122",
    "Body": "The scenes of the phenomenal world are Signs of the\\n\\t\\t\\t\\tSelf-Revelation of Allah, for those who understand and\\n\\t\\t\\t\\twho have the will to merge their wills in His. This they\\n\\t\\t\\t\\tdo (1) by praising Him, which means understanding\\n\\t\\t\\t\\tsomething of His nature, and (2) by gratitude to Him,\\n\\t\\t\\t\\twhich means carrying out His Will, and doing good to\\n\\t\\t\\t\\ttheir fellow-creatures. These two attitudes of mind and\\n\\t\\t\\t\\theart give rise to various consequences in their lives,\\n\\t\\t\\t\\twhich are detailed in the following verse."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "63",
    "NoteID": "3123",
    "Body": "Ignorant: in a moral sense. Address: in the aggressive\\n\\t\\t\\t\\tsense. Their humility is shown in two ways: (1) to those\\n\\t\\t\\t\\tin real search of knowledge, they give such knowledge as\\n\\t\\t\\t\\tthey have and as the recipients can assimilate; (2) to\\n\\t\\t\\t\\tthose who merely dispute, they do not speak harshly, but\\n\\t\\t\\t\\tsay \"Peace!\", as much as to say, \"May it be well with\\n\\t\\t\\t\\tyou, may you repent and be better\"; or \"May Allah give me\\n\\t\\t\\t\\tpeace from such wrangling\"; or \"Peace, and Good-bye; let\\n\\t\\t\\t\\tme leave you!\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "64",
    "NoteID": "3124",
    "Body": "Humble prayer brings them nearer to Allah."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "65",
    "NoteID": "3125",
    "Body": "This is a prayer of humility: such a person relies, not\\n\\t\\t\\t\\ton any good works which he may have done, but on the\\n\\t\\t\\t\\tGrace and Mercy of Allah; and he shows a lively sense of\\n\\t\\t\\t\\tthe Day of Judgment, when every action will weigh for or\\n\\t\\t\\t\\tagainst a soul."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "66",
    "NoteID": "3126",
    "Body": "The misery which results from sin is not only grievous to\\n\\t\\t\\t\\tlive in (\"an abode\") but also grievous \"to rest in\" or\\n\\t\\t\\t\\t\"to stand in\", if it be only for a short time."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "67",
    "NoteID": "3127",
    "Body": "In ordinary spending this is a wise rule. But even in\\n\\t\\t\\t\\tcharity, in which we give of our best, it is not expected\\n\\t\\t\\t\\tthat we should be extravagant, i.e., that we should\\n\\t\\t\\t\\teither do it for show, to impress other people, or do it\\n\\t\\t\\t\\tthoughtlessly, which would be the case if we \"rob Peter\\n\\t\\t\\t\\tto pay Paul\". We should certainly not be niggardly, but\\n\\t\\t\\t\\twe should remember everyone's rights, including our own,\\n\\t\\t\\t\\tand strike a perfectly just balance between them."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "68",
    "NoteID": "3128",
    "Body": "Here three things are expressly condemned: (1) false\\n\\t\\t\\t\\tworship, which is a crime against Allah; (2) the taking\\n\\t\\t\\t\\tof life, which is a crime against our fellow-creatures;\\n\\t\\t\\t\\tand (3) fornication, which is a crime against our\\n\\t\\t\\t\\tself-respect, against ourselves. Every crime is against\\n\\t\\t\\t\\tAllah, His creatures, and ourselves, but some may be\\n\\t\\t\\t\\tviewed more in relation to one than to another. The\\n\\t\\t\\t\\tprohibition against taking life is qualified: \"except for\\n\\t\\t\\t\\tjust cause,\": e.g., in judicial punishment for murder, or\\n\\t\\t\\t\\tin self-preservation, which may include not only\\n\\t\\t\\t\\tself-defence in the legal sense, but also the clearing\\n\\t\\t\\t\\tout of pests, and the provision of meat under conditions\\n\\t\\t\\t\\tof Halal.- see n. 698 to v. 5. After this comes a long\\n\\t\\t\\t\\tparenthesis, which ends with verse 71 below."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "69",
    "NoteID": "3129",
    "Body": "The three crimes just mentioned are specially detestable\\n\\t\\t\\t\\tand infamous, and as ignominy will be added to other\\n\\t\\t\\t\\tpunishments, the penalty will be double that of ordinary\\n\\t\\t\\t\\tpunishment."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "70",
    "NoteID": "3130",
    "Body": "But even in the case of great crimes, if there is true\\n\\t\\t\\t\\trepentance as tested by a changed fife in conduct,\\n\\t\\t\\t\\tAllah's Mercy is available, and it will transform the\\n\\t\\t\\t\\trepentant's nature from evil to good."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "72",
    "NoteID": "3131",
    "Body": "Witness no falsehood has two significations, both implied\\n\\t\\t\\t\\tin this passage: (1) those who give no evidence that is\\n\\t\\t\\t\\tfalse; and (2) those who do not assist at anything which\\n\\t\\t\\t\\timplies fraud or falsehood."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "72",
    "NoteID": "3132",
    "Body": "There is not only condemnation of positive falsehood or\\n\\t\\t\\t\\tof being mixed up with things implying falsehood; but\\n\\t\\t\\t\\tfutilities-vain random talk, unedifying jokes, useless\\n\\t\\t\\t\\tshow, etc.-are all condemned. If a good man finds himself\\n\\t\\t\\t\\tin such an affair, he must withdraw from it in an\\n\\t\\t\\t\\thonourable, dignified way, not in a fussy arrogant way."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "73",
    "NoteID": "3133",
    "Body": "Kharra may mean: to fall down, to snore, to droop down as\\n\\t\\t\\t\\tif the person were bored or inattentive, or did not wish\\n\\t\\t\\t\\tto see or hear or pay attention."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "74",
    "NoteID": "3134",
    "Body": "We must also pray for the maintenance of Allah's Law\\n\\t\\t\\t\\tafter us, through our wives and descendants: in our eyes\\n\\t\\t\\t\\tthey should not be mere accidents or play-things, but a\\n\\t\\t\\t\\treal comfort and fulfilment of our spiritual longings.\\n\\t\\t\\t\\tPerhaps, through them, as well through ourselves, we may,\\n\\t\\t\\t\\tby Allah's grace, be able to give a lead for truth and\\n\\t\\t\\t\\trighteousness."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "74",
    "NoteID": "3135",
    "Body": "Let us recapitulate the virtues of the true servants of\\n\\t\\t\\t\\tAllah: (1) they are humble and forbearing to those below\\n\\t\\t\\t\\tthem in spiritual worth; (2) they are constantly, by\\n\\t\\t\\t\\tadoration, in touch with Allah; (3) they always remember\\n\\t\\t\\t\\tthe Judgment in the Hereafter; (4) they are moderate in\\n\\t\\t\\t\\tall things; (5) they avoid treason to Allah, to their\\n\\t\\t\\t\\tfellow-creatures, and to themselves; (6) they give a wide\\n\\t\\t\\t\\tberth not only to falsehood but to futility; (7) they pay\\n\\t\\t\\t\\tattention, both in mind and manner, to the Signs of their\\n\\t\\t\\t\\tLord; (8) their ambition is to bring up their families in\\n\\t\\t\\t\\trighteousness and to lead in all good. A fine code of\\n\\t\\t\\t\\tindividual and social ethics, a ladder of spiritual\\n\\t\\t\\t\\tdevelopment, open to all."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "77",
    "NoteID": "3136",
    "Body": "Let not the wicked think that it causes Allah any\\n\\t\\t\\t\\tannoyance or uneasiness if they do not serve or worship\\n\\t\\t\\t\\tHim. He is high above all needs. But He turns in His\\n\\t\\t\\t\\tMercy to all who call on Him. For those who arrogantly\\n\\t\\t\\t\\treject Him, the evil consequences of their rejection are\\n\\t\\t\\t\\tinevitable, and must soon come to pass."
  }
]
