[
  {
    "SurahNumber": "32",
    "AyahNumber": "1",
    "Text": "Alif Lam M'im."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "2",
    "Text": "This Book (Al-Qur'an), which contains no doubt, is revealed by\\n\\t\\t\\tthe Rabb of the worlds."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "3",
    "Text": "Do the people say: \"He (Muhammad) has forged it?\" Nay! It is the\\n\\t\\t\\tTruth from your Rabb, so that you may warn a people to whom no\\n\\t\\t\\tWarner has come before you: so that they may receive guidance."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "4",
    "Text": "It is Allah Who has created the heavens, the earth and all that\\n\\t\\t\\tis between them in six periods, then firmly established Himself\\n\\t\\t\\ton the Throne of Authority. You have no guardian or intercessor\\n\\t\\t\\tbesides Him. Will you not then take heed?"
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "5",
    "Text": "He plans all affairs from the heavens to the earth: then each\\n\\t\\t\\taffair ascends to Him (takes place) in a time period which, to\\n\\t\\t\\tyour calculations, is one thousand years."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "6",
    "Text": "Such is He, the Knower of all the hidden and the open, the\\n\\t\\t\\tAlmighty, the Merciful."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "7",
    "Text": "It is He Who has given the best form to everything that He has\\n\\t\\t\\tcreated. He originated the creation of man from clay;"
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "8",
    "Text": "then automated the creation of his progeny by an extract of a\\n\\t\\t\\tdespicable water;"
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "9",
    "Text": "then He fashioned him in due proportion and breathed into him of\\n\\t\\t\\tHis spirit. He gave you ears, eyes and heart; yet you are seldom\\n\\t\\t\\tthankful."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "10",
    "Text": "They say: \"What! Once we are lost in the earth, shall we be\\n\\t\\t\\tcreated afresh?\" Nay! They deny the fact that they will ever meet\\n\\t\\t\\ttheir Rabb."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "11",
    "Text": "Say: \"The angel of death (Izra'il) is assigned for you will carry\\n\\t\\t\\toff your souls and bring you back to your Rabb.\""
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "12",
    "Text": "If only you could visualize when the criminals will hang their\\n\\t\\t\\theads before their Rabb saying: \"Our Rabb! We have seen and we\\n\\t\\t\\thave heard; please send us back to the world and we will do good\\n\\t\\t\\tdeeds: we are now convinced.\""
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "13",
    "Text": "In response to that, it will be said: \"Had We so willed, We could\\n\\t\\t\\thave given every soul its guidance. But My word which I had said\\n\\t\\t\\thas been fulfilled, that I shall fill hell with jinns and men all\\n\\t\\t\\ttogether.\""
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "14",
    "Text": "Now taste the reward for your forgetting the meeting of this Day\\n\\t\\t\\t- We too have forgotten you now - taste the everlasting\\n\\t\\t\\tpunishment in consequence of your misdeeds.\""
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "15",
    "Text": "Only those people believe in Our revelations, who, when they are\\n\\t\\t\\treminded of them, prostrate themselves in adoration and celebrate\\n\\t\\t\\tthe praises of their Rabb and are not puffed up with pride."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "16",
    "Text": "Who forsake their beds and invoke their Rabb with fear and hope;\\n\\t\\t\\tand they spend in charity out of the sustenance which We have\\n\\t\\t\\tgiven them."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "17",
    "Text": "No one knows what delights of the eye have been kept hidden for\\n\\t\\t\\tthem as a reward for their good deeds."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "18",
    "Text": "Can he who is a believer be like the one who is a transgressor?\\n\\t\\t\\tOf course, they are not alike."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "19",
    "Text": "As for those who believe and do good deeds, they shall be awarded\\n\\t\\t\\tthe gardens of paradise as a reward of their labors."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "20",
    "Text": "But those who transgress shall be cast into the fire. Whenever\\n\\t\\t\\tthey try to escape from it, they shall be pushed back into it,\\n\\t\\t\\tand it will be said to them: \"Taste the punishment of the fire\\n\\t\\t\\twhich you used to deny.\""
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "21",
    "Text": "We shall certainly make them taste the lighter torment in this\\n\\t\\t\\tlife before the greater punishment of the hereafter, so that they\\n\\t\\t\\tmay return to the Right Way."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "22",
    "Text": "Who could be more unjust than the one who is reminded of the\\n\\t\\t\\trevelations of his Rabb and he turns away from them? Surely We\\n\\t\\t\\tshall take vengeance on such criminals."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "23",
    "Text": "We gave the Book to Musa - so be not in doubt for receiving this\\n\\t\\t\\tBook which meets the same criteria - and We made it a guide for\\n\\t\\t\\tthe Children of Israel."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "24",
    "Text": "When they showed patience, We appointed from among them leaders\\n\\t\\t\\tgiving guidance under Our command so long as they continued to\\n\\t\\t\\thave faith in Our revelations."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "25",
    "Text": "Surely your Rabb will decide between them, on the Day of\\n\\t\\t\\tResurrection, concerning those matters wherein they differ among\\n\\t\\t\\tthemselves."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "26",
    "Text": "Do they not learn a lesson from the historical events of how many\\n\\t\\t\\tgenerations We have destroyed before them in whose\\n\\t\\t\\tdwelling-places they move about? Surely there are signs in this.\\n\\t\\t\\tDo they not listen?"
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "27",
    "Text": "Do they not see how We drive the rain to the parched lands and\\n\\t\\t\\ttherefrom bring forth crops of which they and their cattle eat?\\n\\t\\t\\tHave they no vision?"
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "28",
    "Text": "Still they say: \"When will this judgement take place, if you are\\n\\t\\t\\ttelling the truth?\""
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "29",
    "Text": "Tell them: \"On the Day of Judgement it will be of no benefit to\\n\\t\\t\\tthe unbelievers even if they believe, since at that time they\\n\\t\\t\\twill not be granted a respite\"."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "30",
    "Text": "Therefore, pay no heed to them, and wait as they are waiting."
  }
]
