[
  {
    "SurahNumber": "43",
    "AyahNumber": "1",
    "NoteID": "4604",
    "Body": "Abbreviated Letters: see Introduction to S. xi."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "3",
    "NoteID": "4605",
    "Body": "Cf. xlii. 7, n. 4533."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "4",
    "NoteID": "4606",
    "Body": "Cf. iii. 7, n. 347: and xiii. 39, n. 1864. The Mother of\\n\\t\\t\\t\\tthe Book, the Foundation of Revelation, the Preserved\\n\\t\\t\\t\\tTablet (Lauh Mahfuz. lxxxv. 22), is the core or essence\\n\\t\\t\\t\\tof revelation, the original principle or fountain-head of\\n\\t\\t\\t\\tAllah's Eternal and Universal Law. From this\\n\\t\\t\\t\\tfountain-head are derived all streams of knowledge and\\n\\t\\t\\t\\twisdom, that flow through Time and feed the intelligence\\n\\t\\t\\t\\tof created minds. The Mother of the Book is in Allah's\\n\\t\\t\\t\\town Presence, and its dignity and wisdom are more than\\n\\t\\t\\t\\tall we can think of."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "5",
    "NoteID": "4607",
    "Body": "In vouchsafing Revelation, what an inestimable Mercy has\\n\\t\\t\\t\\tAllah conferred on mankind! Yet so many deluded souls are\\n\\t\\t\\t\\tungrateful, and ignore or oppose its teaching. If it were\\n\\t\\t\\t\\tnot for His attributes of Forgiveness and Forbearing He\\n\\t\\t\\t\\twould be justified in withdrawing that Light, but He\\n\\t\\t\\t\\tcontinues to shed it, that all who will may come and be\\n\\t\\t\\t\\tblessed by it."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "6",
    "NoteID": "4608",
    "Body": "In spite of, or because of, man's obstinate and\\n\\t\\t\\t\\trebellious nature, Allah sent prophet after prophet to\\n\\t\\t\\t\\tthe peoples of old, but there was among them always a\\n\\t\\t\\t\\tparty that ridiculed them and treated Allah's Signs as\\n\\t\\t\\t\\tnaught."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "8",
    "NoteID": "4609",
    "Body": "The result of rebellion was destruction. And the pagan\\n\\t\\t\\t\\tMakkan generation contemporary with the Prophet are\\n\\t\\t\\t\\treminded that the peoples of old who were destroyed were,\\n\\t\\t\\t\\tmany of them, more powerful than they, and that they, in\\n\\t\\t\\t\\tdisobeying Allah's Law, were inviting the same fate for\\n\\t\\t\\t\\tthemselves. The events of the past have become examples\\n\\t\\t\\t\\tfor the present and the future."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "9",
    "NoteID": "4610",
    "Body": "Cf. xxix. 61 and n. 3493; and xxxi. 25 and n. 3613. This\\n\\t\\t\\t\\tclass of men acknowledge Allah's Power and Allah's\\n\\t\\t\\t\\tKnowledge or Wisdom, but do not realise Allah's infinite\\n\\t\\t\\t\\tMercy and care for His creatures."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "9",
    "NoteID": "4611",
    "Body": "Note the beautiful rhetorical figure of speech here. The\\n\\t\\t\\t\\treply of the inconsistent men who do not follow Allah's\\n\\t\\t\\t\\tLaw is turned against themselves. When they acknowledge\\n\\t\\t\\t\\tAllah's Power and Knowledge, their speech is interrupted,\\n\\t\\t\\t\\tand the concomitant qualities of Allah's Mercy and care\\n\\t\\t\\t\\tof His creatures, with pointed reference to the\\n\\t\\t\\t\\tinconsistent ones themselves, is set out in eloquent\\n\\t\\t\\t\\tterms, as completing what they themselves had said, and\\n\\t\\t\\t\\tthe right course of conduct is pointed out to them\\n\\t\\t\\t\\t(verses 10-14)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "10",
    "NoteID": "4612",
    "Body": "See last note."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "10",
    "NoteID": "4613",
    "Body": "Cf. xx. 53 and n. 2576. Mihad, a carpet or bed spread\\n\\t\\t\\t\\tout, implies not only freedom of movement but rest also.\\n\\t\\t\\t\\tThe 'roads and channels' carry out the idea of\\n\\t\\t\\t\\tcommunications and include land routes, sea routes, and\\n\\t\\t\\t\\tairways."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "11",
    "NoteID": "4614",
    "Body": "In due measure: i.e., according to needs, as measured by\\n\\t\\t\\t\\tlocal as well as universal considerations. This applies\\n\\t\\t\\t\\tto normal rainfall: floods and droughts are abnormal\\n\\t\\t\\t\\tconditions, and may be called unusual manifestations of\\n\\t\\t\\t\\tHis power, fulfilling some special purpose that we may or\\n\\t\\t\\t\\tmay not understand."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "11",
    "NoteID": "4615",
    "Body": "The clause 'And We raise...(from the dead)' is\\n\\t\\t\\t\\tparenthetical. Cf. xxxv. 9, n. 3881. Note the transition\\n\\t\\t\\t\\tfrom the third to the first person, to mark the\\n\\t\\t\\t\\tResurrection as a special act of Allah as distinguished\\n\\t\\t\\t\\tfrom the ordinary processes of nature ordained by Allah."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "12",
    "NoteID": "4616",
    "Body": "Cf. n. 2578 to xx. 53. Also see xxxvi. 36, n. 3981."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "12",
    "NoteID": "4617",
    "Body": "By analogy all means of transport, including horses,\\n\\t\\t\\t\\tcamels, ships, steamers, railways, aeroplanes, airships,\\n\\t\\t\\t\\tetc. The domestication of animals as well as the\\n\\t\\t\\t\\tinvention of mechanical means of transport require a\\n\\t\\t\\t\\tskill and ingenuity in man, which are referred to Allah\\n\\t\\t\\t\\tas His gifts or endowments to man."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "13",
    "NoteID": "4618",
    "Body": "See last note. People of understanding attribute all good\\n\\t\\t\\t\\tto its true and original source viz.: Allah."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "14",
    "NoteID": "4619",
    "Body": "Men of understanding, every time they take a journey on\\n\\t\\t\\t\\tearth, are reminded of that more momentous journey which\\n\\t\\t\\t\\tthey are taking on the back of Time to Eternity. Have\\n\\t\\t\\t\\tthey tamed Time to their lawful use, or do they allow\\n\\t\\t\\t\\tTime to run away with them wildly to where they know not?\\n\\t\\t\\t\\tTheir goal is Allah, and their thoughts are ever with\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "15",
    "NoteID": "4620",
    "Body": "As a contrast to the men of true understanding are the\\n\\t\\t\\t\\tungrateful blasphemous creatures, who offer a share to\\n\\t\\t\\t\\tothers besides Allah! They imagine sons and daughters to\\n\\t\\t\\t\\tAllah, and forget the true lesson of the whole of\\n\\t\\t\\t\\tCreation, which points to the Unity of Allah. This theme\\n\\t\\t\\t\\tis further developed in the following Section."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "16",
    "NoteID": "4621",
    "Body": "To imagine goddesses (female gods) or mothers or\\n\\t\\t\\t\\tdaughters to Allah was particularly blasphemous in the\\n\\t\\t\\t\\tmouths of people who held the female sex in contempt.\\n\\t\\t\\t\\tSuch were the pagan Arabs, and such (it is to be feared)\\n\\t\\t\\t\\tare some of the moderns. They wince when a daughter is\\n\\t\\t\\t\\tborn to them and hanker after sons. With that mentality,\\n\\t\\t\\t\\thow can they attribute daughters to Allah?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "17",
    "NoteID": "4622",
    "Body": "Cf. xvi. 57-59 and notes. With scathing irony it is\\n\\t\\t\\t\\tpointed out that what they hate and are ashamed of for\\n\\t\\t\\t\\tthemselves they attribute to Allah!"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "18",
    "NoteID": "4623",
    "Body": "The softer sex is usually brought up among trinkets and\\n\\t\\t\\t\\tornaments, and, on account of the retiring modesty which\\n\\t\\t\\t\\tfor the sex is a virtue, is unable to stand up boldly in\\n\\t\\t\\t\\ta fight and give clear indications of the will to win. Is\\n\\t\\t\\t\\tthat sort of quality to be associated with Allah?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "19",
    "NoteID": "4624",
    "Body": "Angels for grace and purity may be compared to the most\\n\\t\\t\\t\\tgraceful and the purest forms we know. But it is wrong to\\n\\t\\t\\t\\tattribute sex to them. They are servants and messengers\\n\\t\\t\\t\\tof Allah and so far from being rivals seeking worship,\\n\\t\\t\\t\\tare always engaged in devotion and service. If any\\n\\t\\t\\t\\tpersons invent blasphemies about Allah, such blasphemies\\n\\t\\t\\t\\twill form a big blot in their Book of Deeds, and they\\n\\t\\t\\t\\twill be called to account for them."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "20",
    "NoteID": "4625",
    "Body": "Worsted in argument they resort to a dishonest sarcasm.\\n\\t\\t\\t\\t'We worship these deities: if Allah does not wish us to\\n\\t\\t\\t\\tdo so, why does He not prevent us?' In throwing the\\n\\t\\t\\t\\tresponsibility on Allah, they ignore the limited\\n\\t\\t\\t\\tfree-will on which their whole life is based. They are\\n\\t\\t\\t\\treally playing with truth. They are arguing against their\\n\\t\\t\\t\\town knowledge. They have no authority in any scripture,\\n\\t\\t\\t\\tand indeed they are so slippery that they hold fast to no\\n\\t\\t\\t\\tscripture at all."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "20",
    "NoteID": "4626",
    "Body": "Cf. vi. 116."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "22",
    "NoteID": "4627",
    "Body": "Then comes the argument about ancestral custom, which was\\n\\t\\t\\t\\trepudiated by Abraham (see verses 26-28 below). Indeed a\\n\\t\\t\\t\\tgood reply to ancestral custom in the case of the Arabs\\n\\t\\t\\t\\twas the example of Abraham, the True in Faith, for\\n\\t\\t\\t\\tAbraham was the common ancestor of the Arabs and the\\n\\t\\t\\t\\tIsraelites."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "23",
    "NoteID": "4628",
    "Body": "It is some privileged position, and not ancestral custom,\\n\\t\\t\\t\\twhich is really at the bottom of much falsehood and\\n\\t\\t\\t\\thypocrisy in the world. This has been again and again in\\n\\t\\t\\t\\treligious history."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "24",
    "NoteID": "4629",
    "Body": "The Warner or messenger pointed out the merits and the\\n\\t\\t\\t\\ttruth of his teaching, and how superior it was to what\\n\\t\\t\\t\\tthey called their ancestral customs. But they denied his\\n\\t\\t\\t\\tmission itself or the validity of any such mission. In\\n\\t\\t\\t\\tother words they did not believe in inspiration or\\n\\t\\t\\t\\trevelation, and went on in their evil ways, with the\\n\\t\\t\\t\\tinevitable result that they brought themselves to\\n\\t\\t\\t\\tdestruction."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "26",
    "NoteID": "4630",
    "Body": "The plea of ancestral ways is refuted by the example of\\n\\t\\t\\t\\tAbraham, in two ways: (1) he gave up the ancestral cults\\n\\t\\t\\t\\tfollowed by his father and people, and followed the true\\n\\t\\t\\t\\tWay, even at some sacrifice to himself; and (2) he was an\\n\\t\\t\\t\\tancestor of the Arabs, and if the Arabs stood on\\n\\t\\t\\t\\tancestral ways, why should they not follow their good\\n\\t\\t\\t\\tancestor Abraham, rather than their bad ancestors who\\n\\t\\t\\t\\tfell into evil? See n. 4627 above. The incident in\\n\\t\\t\\t\\tAbraham's story referred to here will be found in xxi.\\n\\t\\t\\t\\t51-70."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "28",
    "NoteID": "4631",
    "Body": "A Word: i.e., the Gospel of Unity, viz.: \"I worship only\\n\\t\\t\\t\\tHim who originated me\", as in verse 27. This was his\\n\\t\\t\\t\\tteaching, and this was his legacy to those who followed\\n\\t\\t\\t\\thim. He hoped that they would keep it sacred, and uphold\\n\\t\\t\\t\\tthe standard of Unity. Cf. xxxvii. 108-1 1 1."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "29",
    "NoteID": "4632",
    "Body": "Note the first person singular, as showing Allah's\\n\\t\\t\\t\\tpersonal solicitude and care for the descendants of\\n\\t\\t\\t\\tAbraham in both branches. The context here refers to the\\n\\t\\t\\t\\tprosperity enjoyed by Makkah and the Makkans until they\\n\\t\\t\\t\\trejected the truth of Islam when it was preached in their\\n\\t\\t\\t\\tmidst by a messenger whose Message was as clear as the\\n\\t\\t\\t\\tlight of the sun."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "30",
    "NoteID": "4633",
    "Body": "When the pagan Makkans could not understand the wonderful\\n\\t\\t\\t\\tpower and authority with which the holy Prophet preached,\\n\\t\\t\\t\\tthey called his God given influence sorcery!"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "31",
    "NoteID": "4634",
    "Body": "The world judges by its own low standards. From a worldly\\n\\t\\t\\t\\tpoint of view, the holy Prophet was poor and an orphan.\\n\\t\\t\\t\\tWhy, they thought, should he be so richly endowed in\\n\\t\\t\\t\\tspiritual knowledge and power? If such a gift had to come\\n\\t\\t\\t\\tto a man among them, it was the right (they foolishly\\n\\t\\t\\t\\tsaid) of one of the chiefs in either the sacred city of\\n\\t\\t\\t\\tMakkah, or the fertile garden-city of Taif!"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "32",
    "NoteID": "4635",
    "Body": "That is, spiritual gifts, those connected with\\n\\t\\t\\t\\tRevelation. What audacity or folly in them to claim to\\n\\t\\t\\t\\tdivide or distribute them among themselves? They may\\n\\t\\t\\t\\tthink they are distributing the good things of this world\\n\\t\\t\\t\\tamong themselves. In a sense that may be true, even here,\\n\\t\\t\\t\\ttheir own power and initiative are very limited. Even\\n\\t\\t\\t\\there it is Allah's Will on which all depends. In His\\n\\t\\t\\t\\twisdom Allah allows some to grow in power or riches, and\\n\\t\\t\\t\\tcommand work from others, and various relative gradations\\n\\t\\t\\t\\tare established. Men scramble for these good things of\\n\\t\\t\\t\\tthis world, but they are of no value compared to the\\n\\t\\t\\t\\tspiritual gifts."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "33",
    "NoteID": "4636",
    "Body": "So little value is attached in the spiritual world to\\n\\t\\t\\t\\tsilver or gold, or worldly ranks or adornments, that they\\n\\t\\t\\t\\twould freely be at the disposal of everyone who denied or\\n\\t\\t\\t\\tblasphemed Allah, were it not that in that case there\\n\\t\\t\\t\\twould be too great temptation placed in the way of men,\\n\\t\\t\\t\\tfor they might all scramble to sell their spiritual life\\n\\t\\t\\t\\tfor wealth! They might have silver roofs and stair-ways,\\n\\t\\t\\t\\tsilver doors and thrones, and all kinds of adornments of\\n\\t\\t\\t\\tgold. But Allah does not allow too great a temptation to\\n\\t\\t\\t\\tbe placed in the path of men. He distributes these things\\n\\t\\t\\t\\tdifferently, some to unjust men, and some to just men, in\\n\\t\\t\\t\\tvarious degrees, so that the possession of these is no\\n\\t\\t\\t\\ttest either of an unjust or a just life. His wisdom\\n\\t\\t\\t\\tsearches out motives far more subtle and delicate than\\n\\t\\t\\t\\tany we are even aware of."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "35",
    "NoteID": "4637",
    "Body": "Adornments of gold: the keyword to this Sura. All false\\n\\t\\t\\t\\tglitter and adornments of this world are as naught. They\\n\\t\\t\\t\\tmore often hinder than help."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "36",
    "NoteID": "4638",
    "Body": "If men deliberately put away the remembrance of Allah\\n\\t\\t\\t\\tfrom their minds, the natural consequence, under Allah's\\n\\t\\t\\t\\tdecree, is that they join on with evil. Like consorts\\n\\t\\t\\t\\twith like. We can generalise evil in the abstract, but it\\n\\t\\t\\t\\ttakes concrete shape in our life-companions."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "37",
    "NoteID": "4639",
    "Body": "The downward course in evil is rapid. But the most tragic\\n\\t\\t\\t\\tconsequence is that evil persuades its victims to believe\\n\\t\\t\\t\\tthat they are pursuing good. They think evil to be their\\n\\t\\t\\t\\tgood. They go deeper and deeper into the mire, and become\\n\\t\\t\\t\\tmore and more callous. \"Them\" and \"they\" represent the\\n\\t\\t\\t\\tgeneric plural of anyone who \"withdraws himself\\n\\t\\t\\t\\tfrom...Allah\" (see last verse)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "38",
    "NoteID": "4640",
    "Body": "If ever the presence of Allah is felt, or at the time of\\n\\t\\t\\t\\tJudgment, a glimmering of truth comes to the deceived\\n\\t\\t\\t\\tsoul, and it cries to its evil companion in its agony,\\n\\t\\t\\t\\t\"Would that I had never come across thee! Would that we\\n\\t\\t\\t\\twere separated poles apart!\" But it cannot shake off\\n\\t\\t\\t\\tevil. By deliberate choice it had put itself in its\\n\\t\\t\\t\\tsnare."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "38",
    "NoteID": "4641",
    "Body": "Distance of East and West: literally, 'distance of the\\n\\t\\t\\t\\ttwo Easts'. Most Commentators understand in this sense,\\n\\t\\t\\t\\tbut some construe the phrase as meaning the distance of\\n\\t\\t\\t\\tthe extreme points of the rising of the sun, between the\\n\\t\\t\\t\\tsummer solstice and the winter solstice. Cf. n. 4034 to\\n\\t\\t\\t\\txxxvii. 5. A good equivalent idiom in English would be\\n\\t\\t\\t\\t\"poles apart\", for they could never meet."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "39",
    "NoteID": "4642",
    "Body": "All partners in evil will certainly share in the\\n\\t\\t\\t\\tpunishment, but that is no consolation to any individual\\n\\t\\t\\t\\tsoul. Evil desires the evil of others, but that does not\\n\\t\\t\\t\\tdiminish its own torment, or get rid of the personal\\n\\t\\t\\t\\tresponsibility of each individual soul."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "40",
    "NoteID": "4643",
    "Body": "Cf. xxx. 52-53. The evil go headlong into sin, and sink\\n\\t\\t\\t\\tdeeper and deeper until their spiritual faculties are\\n\\t\\t\\t\\tdeadened, and no outside help can bring them back.\\n\\t\\t\\t\\tAllah's grace they have rejected."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "40",
    "NoteID": "4644",
    "Body": "There is hope for a person who wanders in quest of truth,\\n\\t\\t\\t\\tand even for one who wanders through mistake or by\\n\\t\\t\\t\\tweakness of will. But there is none for one who, by\\n\\t\\t\\t\\tdeliberate choice, plunges into \"manifest error\", i.e.,\\n\\t\\t\\t\\terror which any one can see."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "41",
    "NoteID": "4645",
    "Body": "Cf. viii. 30: \"how the Unbelievers plotted against thee,\\n\\t\\t\\t\\tto keep thee in bonds, or slay thee, or get thee out (of\\n\\t\\t\\t\\tthy home)\". They were always plotting against the holy\\n\\t\\t\\t\\tProphet in his Makkan period. But even if their plots had\\n\\t\\t\\t\\tsucceeded against human beings, they could not defeat\\n\\t\\t\\t\\tAllah's Plan, nor escape the just punishment of their\\n\\t\\t\\t\\tdeeds. Cf. also x. 46, and n. 1438."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "43",
    "NoteID": "4646",
    "Body": "Let the wicked rage, say what they like, or do their\\n\\t\\t\\t\\tworst: the prophet of Allah is encouraged to go forward\\n\\t\\t\\t\\tsteadfastly in the Light given him, for he is on a Path\\n\\t\\t\\t\\tthat leads straight to Allah."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "44",
    "NoteID": "4647",
    "Body": "Zikrun: Message, Remembrance, Cause of remembrance,\\n\\t\\t\\t\\tMemorial. Title for remembrance to posterity. Thus two\\n\\t\\t\\t\\tmeanings emerge, not necessarily mutually exclusive. (1)\\n\\t\\t\\t\\tThe Qur-an brings a Message of Truth and Guidance to the\\n\\t\\t\\t\\tProphet, and his people; (2) the revelation of the Qur-an\\n\\t\\t\\t\\traises the rank of the Prophet, and the people among\\n\\t\\t\\t\\twhom, and in whose language, it was promulgated, making\\n\\t\\t\\t\\tthem worthy of remembrance in the world's history for all\\n\\t\\t\\t\\ttime. But the honour also carried its responsibilities.\\n\\t\\t\\t\\tAll who hear it must give an account of how far they\\n\\t\\t\\t\\tprofit by it spiritually."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "45",
    "NoteID": "4648",
    "Body": "That is, by examining their Message, and asking the\\n\\t\\t\\t\\tlearned among their real followers. It will be found that\\n\\t\\t\\t\\tno Religion really teaches the worship of other than\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "46",
    "NoteID": "4649",
    "Body": "For the story of Moses in detail, see vii. 103-137, but\\n\\t\\t\\t\\tespecially vii. 104, 130- 136."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "47",
    "NoteID": "4650",
    "Body": "For the mockery of Moses and his Signs see xvii. 101;\\n\\t\\t\\t\\talso below, xliii. 49, 52-53."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "48",
    "NoteID": "4651",
    "Body": "Moses showed them nine Clear Signs: see n. 1091 to vii.\\n\\t\\t\\t\\t133; also xvii. 101. Each one of them in its own setting\\n\\t\\t\\t\\tand circumstances was greater than any of its \"Sister\"\\n\\t\\t\\t\\tSigns. The object was if possible to reclaim as many\\n\\t\\t\\t\\tEgyptians as possible from their defiance of Allah."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "49",
    "NoteID": "4652",
    "Body": "This speech is half a mockery, and half a ruse. In spite\\n\\t\\t\\t\\tof their unbelief, they had fear in their minds, and in\\n\\t\\t\\t\\torder to stop the plagues, one after another, they\\n\\t\\t\\t\\tpromised to obey Allah, and when the particular plague\\n\\t\\t\\t\\twas removed, they again became obdurate. See vii.\\n\\t\\t\\t\\t133-135."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "51",
    "NoteID": "4653",
    "Body": "The waw here in Arabic is the Waw haliya: the abundant\\n\\t\\t\\t\\tstreams from the Nile flowing beneath his palace being\\n\\t\\t\\t\\tevidence of his power, prosperity, and sovereignty. The\\n\\t\\t\\t\\tNile made (and makes) Egypt, and the myth of the god\\n\\t\\t\\t\\tOsiris was a compound of the myths of the Nile and the\\n\\t\\t\\t\\tsun. The Pharaoh, therefore, as commanding the Nile,\\n\\t\\t\\t\\tcommanded the gods who personified Egypt. He boasted of\\n\\t\\t\\t\\twater, and he perished in water,-a fitting punishment!"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "52",
    "NoteID": "4654",
    "Body": "Being a despised Israelite in any case, and having\\n\\t\\t\\t\\tfurther an impediment in his speech. See xx. 27, and\\n\\t\\t\\t\\tnotes 2552-53."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "53",
    "NoteID": "4655",
    "Body": "Gold bracelets and gold chains were possibly among the\\n\\t\\t\\t\\tinsignia of royalty. In any case they betokened wealth,\\n\\t\\t\\t\\tand the materialists judge a man's worth by his wealth\\n\\t\\t\\t\\tand his following and equipage. So Pharaoh wanted to see\\n\\t\\t\\t\\tMoses, if he had any position in the spiritual kingdom,\\n\\t\\t\\t\\tinvested with gold bracelets, and followed by a great\\n\\t\\t\\t\\ttrain of angels as his Knight-companions! The same kind\\n\\t\\t\\t\\tof proofs were demanded by the materialist Quraish of our\\n\\t\\t\\t\\tholy Prophet. These were puerilities, but such\\n\\t\\t\\t\\tpuerilities go down with the crowd. Barring a few\\n\\t\\t\\t\\tEgyptians who believed in Allah and in the Message of\\n\\t\\t\\t\\tMoses, the rest of Pharaoh's entourage followed Pharaoh\\n\\t\\t\\t\\tin his pursuit of revenge, and were drowned in the Red\\n\\t\\t\\t\\tSea."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "55",
    "NoteID": "4656",
    "Body": "Allah is patient, and gives many and many opportunities\\n\\t\\t\\t\\tto the most hardened sinners for repentance. But at\\n\\t\\t\\t\\tlength comes a time when His justice is provoked, and the\\n\\t\\t\\t\\tinevitable punishment follows."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "55",
    "NoteID": "4657",
    "Body": "Cf. vii. 136."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "56",
    "NoteID": "4658",
    "Body": "Pharaoh and his hosts were blotted out, and became as a\\n\\t\\t\\t\\ttale of the past. Their story is an instructive warning\\n\\t\\t\\t\\tand example to future generations."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "57",
    "NoteID": "4659",
    "Body": "Jesus was a man, and a prophet to the Children of Israel,\\n\\t\\t\\t\\t\"though his own received him not.\" Some of the churches\\n\\t\\t\\t\\tthat were founded after him worshipped him as \"God\" and\\n\\t\\t\\t\\tas \"the son of God\", as do the Trinitarian churches to\\n\\t\\t\\t\\tthe present day. The orthodox churches did so in the time\\n\\t\\t\\t\\tof the holy Prophet. When the doctrine of Unity was\\n\\t\\t\\t\\trenewed, and the false worship of others besides Allah\\n\\t\\t\\t\\twas strictly prohibited, all false gods were condemned,\\n\\t\\t\\t\\te.g., at xxi. 98. The pagan Arabs looked upon Jesus as\\n\\t\\t\\t\\tbeing in the same category as their false gods, and could\\n\\t\\t\\t\\tnot see why a foreign cult, or a foreign god, as they\\n\\t\\t\\t\\tviewed him, should be considered better than their own\\n\\t\\t\\t\\tgods or idols. There was no substance in this, but mere\\n\\t\\t\\t\\tmockery, and verbal quibbling. Jesus was one of the\\n\\t\\t\\t\\tgreater prophets: he was not a god, nor was he\\n\\t\\t\\t\\tresponsible for the quibbling subtleties of the\\n\\t\\t\\t\\tAthanasian Creed."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "59",
    "NoteID": "4660",
    "Body": "A reference to the limited mission of the prophet Jesus,\\n\\t\\t\\t\\twhose Gospel to the Jews only survives in uncertain\\n\\t\\t\\t\\tfragmentary forms."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "60",
    "NoteID": "4661",
    "Body": "If it were said that the birth of Jesus without a father\\n\\t\\t\\t\\tsets him above other prophets, the creation of angels\\n\\t\\t\\t\\twithout either father or mother would set them still\\n\\t\\t\\t\\thigher, especially as angels do not eat and drink and are\\n\\t\\t\\t\\tnot subject to physical laws. But angels are not higher."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "61",
    "NoteID": "4662",
    "Body": "This is understood to refer to the second coming of Jesus\\n\\t\\t\\t\\tin the Last Days before the Resurrection, when he will\\n\\t\\t\\t\\tdestroy the false doctrines that pass under his name, and\\n\\t\\t\\t\\tprepare the way for the universal acceptance of Islam,\\n\\t\\t\\t\\tthe Gospel of Unity and Peace, the Straight Way of the\\n\\t\\t\\t\\tQur-an."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "63",
    "NoteID": "4663",
    "Body": "True wisdom consists in understanding the unity of the\\n\\t\\t\\t\\tDivine purpose and the Unity of the Divine Personality.\\n\\t\\t\\t\\tThe man Jesus came to reconcile the jarring sects in\\n\\t\\t\\t\\tIsrael, and his true teaching was just the same as that\\n\\t\\t\\t\\twhich was expounded in a wider form by Islam. He did not\\n\\t\\t\\t\\tclaim to be God: why should not the Christians follow the\\n\\t\\t\\t\\tdoctrine of Unity rather than what has become their\\n\\t\\t\\t\\tancestral and traditional custom?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "64",
    "NoteID": "4664",
    "Body": "In verses 26-28 an appeal is made to the pagan Arabs,\\n\\t\\t\\t\\tthat Islam is their own religion, the religion of Abraham\\n\\t\\t\\t\\ttheir ancestor; in verses 46-54, an appeal is made to the\\n\\t\\t\\t\\tJews that Islam is the same religion as was taught by\\n\\t\\t\\t\\tMoses, and that they should not allow their leaders to\\n\\t\\t\\t\\tmake fools of them; in verses 57-65 an appeal is made to\\n\\t\\t\\t\\tthe Christians that Islam is the same religion as was\\n\\t\\t\\t\\ttaught by Jesus, and that they should give up their\\n\\t\\t\\t\\tsectarian attitude and follow the universal religion,\\n\\t\\t\\t\\twhich shows the Straight Way."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "66",
    "NoteID": "4665",
    "Body": "Cf. xii. 107. What is there to wait for? The Hour of\\n\\t\\t\\t\\tJudgment may come at any moment. It will come all of a\\n\\t\\t\\t\\tsudden before they realise that it is on them. They\\n\\t\\t\\t\\tshould make up their minds to give up misleading\\n\\t\\t\\t\\tdisputations and come to the Straight Path."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "67",
    "NoteID": "4666",
    "Body": "The hatred and spite, which are associated with evil,\\n\\t\\t\\t\\twill be felt with peculiar intensity in that period of\\n\\t\\t\\t\\tagony. That itself would be a punishment, from which the\\n\\t\\t\\t\\trighteous will be free. The righteous will have passed\\n\\t\\t\\t\\tall perils of falling into wrong frames of mind."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "68",
    "NoteID": "4667",
    "Body": "The devotion and service to Allah result in the soul\\n\\t\\t\\t\\tbeing made free from all fear and sorrow, as regards the\\n\\t\\t\\t\\tpast, present, and future, if we may take an anology from\\n\\t\\t\\t\\tTime for a timeless state. Such devotion and service are\\n\\t\\t\\t\\tshown by (1) believing in Allah's Signs, which means\\n\\t\\t\\t\\tunderstanding and accepting His Will, and (2) by merging\\n\\t\\t\\t\\tour will completely in His universal Will, which means\\n\\t\\t\\t\\tbeing in tune with the Infinite, and acting in all things\\n\\t\\t\\t\\tto further His Kingdom."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "70",
    "NoteID": "4668",
    "Body": "The Garden is the type of all that is beautiful to eye,\\n\\t\\t\\t\\tmind, and soul, all that is restful and in tune, a\\n\\t\\t\\t\\tcomplete state of bliss, such as we can scarcely conceive\\n\\t\\t\\t\\tof in this troubled world. Several metaphors indicate how\\n\\t\\t\\t\\twe can try to picture that bliss to ourselves in \"this\\n\\t\\t\\t\\tmuddy vesture of decay.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "71",
    "NoteID": "4669",
    "Body": "We shall have all our near and dear ones (\"wives\") with\\n\\t\\t\\t\\tus: perfected Love will not be content with Self, but\\n\\t\\t\\t\\tlike a note of music will find its melody in communion\\n\\t\\t\\t\\twith the others. The richest and most beautiful vessels\\n\\t\\t\\t\\twill minister to our purified desires, and give complete\\n\\t\\t\\t\\tand eternal satisfaction to our souls in every way."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "72",
    "NoteID": "4670",
    "Body": "We shall be there, not as strangers, or temporary guests,\\n\\t\\t\\t\\tbut as heirs,-made heirs in eternity because of the good\\n\\t\\t\\t\\tlives we had led on earth."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "73",
    "NoteID": "4671",
    "Body": "The \"fruit\" here links on with the last words in the last\\n\\t\\t\\t\\tverse (72), \"ye are made heirs for your (good) deeds (in\\n\\t\\t\\t\\tlife)\"."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "73",
    "NoteID": "4672",
    "Body": "\"Shall eat\". But the word akala is used in many places in\\n\\t\\t\\t\\tthe comprehensive sense of \"enjoy\", \"have satisfaction\".\\n\\t\\t\\t\\tFor example, see n. 776 to v. 69. Cf. also vii. 19 and n.\\n\\t\\t\\t\\t1004."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "76",
    "NoteID": "4673",
    "Body": "The wrong-doers suffer not because Allah is unjust or\\n\\t\\t\\t\\tcruel, nor as a deterrent to others, for the probationary\\n\\t\\t\\t\\tperiod will then have passed, but because their evil\\n\\t\\t\\t\\tdeeds must bear their inevitable fruit. Allah's Grace was\\n\\t\\t\\t\\tever ready to offer opportunities for Repentance and\\n\\t\\t\\t\\tForgiveness. But they rejected them. They were unjust to\\n\\t\\t\\t\\tthemselves. This is complementary to the doctrine of\\n\\t\\t\\t\\tworks and their fruits, as explained in n. 4671 above."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "77",
    "NoteID": "4674",
    "Body": "Malik: The name of the Angel in charge of Hell."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "77",
    "NoteID": "4675",
    "Body": "Cf. xx. 74. Annihilation is better than agony. But\\n\\t\\t\\t\\twrong-doers cannot destroy the \"fruits\" of their actions,\\n\\t\\t\\t\\tby asking for annihilation."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "78",
    "NoteID": "4676",
    "Body": "We come back now to the Present,-primarily to the time\\n\\t\\t\\t\\twhen Islam was being preached in Makkah, but by analogy\\n\\t\\t\\t\\tthe present time or any time. Truth is often bitter to\\n\\t\\t\\t\\tthe taste of those who live on Falsehoods, and Shams and\\n\\t\\t\\t\\tprofit by them. They hate the Truth, and plot against it.\\n\\t\\t\\t\\tBut will they succeed? See next verse and note."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "79",
    "NoteID": "4677",
    "Body": "Men cannot settle the high affairs of the universe. If\\n\\t\\t\\t\\tthey plot against the Truth, the Truth will destroy them,\\n\\t\\t\\t\\tjust as, if they accept the Truth, the Truth will make\\n\\t\\t\\t\\tthem free. It is Allah Who disposes of affairs."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "80",
    "NoteID": "4678",
    "Body": "However secretly men may plot, everything is known to\\n\\t\\t\\t\\tAllah. His Recording Angels are by, at all times and in\\n\\t\\t\\t\\tall places, to prepare a Record of their Deeds for their\\n\\t\\t\\t\\town conviction when the time comes for Judgment."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "81",
    "NoteID": "4679",
    "Body": "The prophet of Allah does not object to true worship in\\n\\t\\t\\t\\tany form. But it must be true: it must not\\n\\t\\t\\t\\tsuperstitiously attribute derogatory things to Allah, or\\n\\t\\t\\t\\tfoster false ideas."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "82",
    "NoteID": "4680",
    "Body": "Cf. vii. 54 and n. 1032. All Power, Authority, Knowledge,\\n\\t\\t\\t\\tand Truth are with Allah. He neither begets nor is\\n\\t\\t\\t\\tbegotten. Glory to Him!"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "83",
    "NoteID": "4681",
    "Body": "That Day of theirs: they had their Day on earth; they\\n\\t\\t\\t\\twill have a different sort of Day in the Hereafter,\\n\\t\\t\\t\\taccording to the promise of Allah about the Resurrection\\n\\t\\t\\t\\tand Judgment, or perhaps about Retribution in this very\\n\\t\\t\\t\\tlife! So leave them to play about with their fancies and\\n\\t\\t\\t\\tvanities. Truth must eventually prevail!"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "85",
    "NoteID": "4682",
    "Body": "We glorify Allah, and we call His name blessed, because\\n\\t\\t\\t\\tHe has not only supreme power and authority, but because\\n\\t\\t\\t\\twe shall return to Him and see \"the Light of His\\n\\t\\t\\t\\tCountenance\" (xxx. 38)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "86",
    "NoteID": "4683",
    "Body": "While idols and false gods have no power of intercession,\\n\\t\\t\\t\\tpersons like Jesus, who is falsely worshipped by his\\n\\t\\t\\t\\tmisguided followers, but who himself preached the Gospel\\n\\t\\t\\t\\tof Unity with full understanding will have the power of\\n\\t\\t\\t\\tintercession."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "87",
    "NoteID": "4684",
    "Body": "Cf. xxxi. 25, and n. 3613-1 and xxxix. 38, and n. 4299."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "88",
    "NoteID": "4685",
    "Body": "Commentators are divided in opinion as to the\\n\\t\\t\\t\\tconstruction. The best opinion is that which I have\\n\\t\\t\\t\\tadopted, referring back qilihi as a genitive governed by\\n\\t\\t\\t\\t'ilm in verse 85."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "88",
    "NoteID": "4686",
    "Body": "The Prophet was much troubled in mind by the Unfaith of\\n\\t\\t\\t\\tthe Quraish: xviii. 6. He is here told to leave them\\n\\t\\t\\t\\talone for a time, for the Truth must soon prevail."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "89",
    "NoteID": "4687",
    "Body": "Cf. xxv. 63, and n. 3123."
  }
]
