[
  {
    "SurahNumber": "36",
    "AyahNumber": "1",
    "Text": "Ya Sin."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "2",
    "Text": "I swear by the Qur'an which is full of Wisdom"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "3",
    "Text": "that you are indeed one of the Rasools who are sent"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "4",
    "Text": "on a Straight Way."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "5",
    "Text": "This Qur'an is revealed by the Almighty, the Merciful."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "6",
    "Text": "So that you may warn a people whose forefathers were not warned,\\n\\t\\t\\thence they are unaware."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "7",
    "Text": "In fact the Word has been proved true against most of them who\\n\\t\\t\\tare arrogant; so they do not believe."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "8",
    "Text": "Since they have chosen to neglect Our revelations, therefore, We\\n\\t\\t\\thave put yokes round their necks right up to their chins so their\\n\\t\\t\\theads are raised up,"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "9",
    "Text": "and We have put a barrier in front of them and a barrier behind\\n\\t\\t\\tthem, and then We have covered them over so they cannot see."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "10",
    "Text": "It is the same for them whether you warn them or warn them not,\\n\\t\\t\\tthey will not believe."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "11",
    "Text": "You can only warn those who follow the reminder and fears the\\n\\t\\t\\tCompassionate (Allah), though they cannot see Him. To such people\\n\\t\\t\\tgive good news of forgiveness and a generous reward."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "12",
    "Text": "Surely We shall resurrect the dead, We are recording all that\\n\\t\\t\\tthey are sending ahead and that they are leaving behind. We have\\n\\t\\t\\trecorded everything in an open ledger."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "13",
    "Text": "Narrate to them the example of the people of a certain town to\\n\\t\\t\\twhom the Rasools came."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "14",
    "Text": "At first We sent to them two Rasools, but when they rejected both\\n\\t\\t\\tWe strengthened them with a third and they all said: \"Surely we\\n\\t\\t\\thave been sent to you as Rasools.\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "15",
    "Text": "But the people replied: \"You are but humans like us. The\\n\\t\\t\\tCompassionate (Allah) has revealed nothing; you are surely\\n\\t\\t\\tlying.\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "16",
    "Text": "They said: \"Our Rabb knows that we have indeed been sent as\\n\\t\\t\\tRasools towards you"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "17",
    "Text": "and our only duty is to convey His message plainly.\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "18",
    "Text": "The people replied: \"We regard you as an evil omen for us.\\n\\t\\t\\tDesist, or we will either stone you or you will receive from us a\\n\\t\\t\\tpainful punishment.\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "19",
    "Text": "They said: \"Your evil omens lies within yourselves. Do you say\\n\\t\\t\\tthis because you are being admonished? Indeed you are a nation of\\n\\t\\t\\ttransgressors.\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "20",
    "Text": "In the meantime a man came running from the remote part of the\\n\\t\\t\\tCity and said: \"O my people! Follow these Rasools."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "21",
    "Text": "Follow the ones who ask no reward of you and are rightly guided."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "22",
    "Text": "It would not be justifiable on my part if I do not worship Him\\n\\t\\t\\tWho has created me and to Whom you shall be brought back."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "23",
    "Text": "Should I take other gods besides Him? If the Compassionate\\n\\t\\t\\t(Allah) should intend to harm me, their intercession will avail\\n\\t\\t\\tme nothing, nor will they be able to save me."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "24",
    "Text": "If I do so, I would indeed be in manifest error."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "25",
    "Text": "Surely I believe in your Rabb, so listen to me\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "26",
    "Text": "Consequently they killed that man and it was said to him: \"Enter\\n\\t\\t\\tparadise.\" He exclaimed: \"Would that my people knew that what I\\n\\t\\t\\tknow!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "27",
    "Text": "How my Rabb has granted me forgiveness and included me among the\\n\\t\\t\\thonored ones.\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "28",
    "Text": "After that We did not send any army against his people from\\n\\t\\t\\theaven, nor was it necessary to do so."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "29",
    "Text": "It was nothing but a single blast and they all became extinct."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "30",
    "Text": "Alas for My bondsmen! Whenever there came to them a Rasool they\\n\\t\\t\\tmocked at him."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "31",
    "Text": "Do they not see how many generations We have destroyed before\\n\\t\\t\\tthem who will never return to them?"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "32",
    "Text": "While each one of them will be brought before Us on the Day of\\n\\t\\t\\tJudgment."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "33",
    "Text": "The dead land may serve as a sign for them; We give it life and\\n\\t\\t\\tproduce from it grain for them, which they eat."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "34",
    "Text": "We also produce from it gardens with date-palms and vines, and We\\n\\t\\t\\tcause springs to gush forth from it."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "35",
    "Text": "So that they may enjoy the fruits thereof. It was not their hands\\n\\t\\t\\tthat made all this; should they not then give thanks?"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "36",
    "Text": "Glory be to Allah Who created all things in pairs: the plants of\\n\\t\\t\\tthe earth, mankind themselves and other living things which they\\n\\t\\t\\tdo not know."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "37",
    "Text": "Another sign for them is the night; when We withdraw the daylight\\n\\t\\t\\tfrom it, and behold they are in darkness."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "38",
    "Text": "The sun runs its course, this course is pre-estimated for it by\\n\\t\\t\\tthe Almighty, the All-Knowing."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "39",
    "Text": "As for the moon, We have designed phases for it till it again\\n\\t\\t\\tbecomes like an old dry palm branch."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "40",
    "Text": "Neither it is possible for the sun to overtake the moon, nor for\\n\\t\\t\\tthe night to outstrip the day: each floats along in its own\\n\\t\\t\\torbit."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "41",
    "Text": "Another sign for them is how We carried their race through the\\n\\t\\t\\tflood in the laden ark;"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "42",
    "Text": "and similar vessels We have made for them on which they ride."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "43",
    "Text": "If We want, We can drown them; and they will have no helper to\\n\\t\\t\\tsave them, nor can they be rescued,"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "44",
    "Text": "except through Our mercy and unless We prolong their lives for a\\n\\t\\t\\twhile."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "45",
    "Text": "When it is said to them: \"Have fear of that which is before you\\n\\t\\t\\tand that which is behind you, so that you may receive mercy,\"\\n\\t\\t\\tthey pay no heed."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "46",
    "Text": "Whenever any sign from the revelations of their Rabb comes to\\n\\t\\t\\tthem, they turn away from it."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "47",
    "Text": "Whenever they are asked: \"Spend out of what Allah has given you.\"\\n\\t\\t\\tThe disbelievers say to the believers: \"Should we feed those whom\\n\\t\\t\\tAllah can feed Himself if He so chooses? You are quite obviously\\n\\t\\t\\tin error!\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "48",
    "Text": "Further, they say: \"When will this promise of resurrection come\\n\\t\\t\\tto pass, if what you say is true?\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "49",
    "Text": "In fact what they are waiting for is a single blast, which will\\n\\t\\t\\tseize them while they are yet disputing among themselves in their\\n\\t\\t\\tworldly affairs."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "50",
    "Text": "Then neither they will be able to make a will, nor be able to\\n\\t\\t\\treturn to their families."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "51",
    "Text": "Then a trumpet shall be blown and, behold, they will rise up from\\n\\t\\t\\ttheir graves and hasten to their Rabb."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "52",
    "Text": "They will say: \"Oh, Woe to us! Who has raised us up from our\\n\\t\\t\\tgraves? They will be told: \"This is what the Compassionate\\n\\t\\t\\t(Allah) had promised and true was the word of the Rasools.\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "53",
    "Text": "It will be no more than a single blast, and then they will all be\\n\\t\\t\\tgathered before Us."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "54",
    "Text": "On that Day no soul will suffer the least injustice and you shall\\n\\t\\t\\tbe rewarded according to your deeds."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "55",
    "Text": "Surely, on that Day, the residents of paradise will be busy with\\n\\t\\t\\ttheir joy;"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "56",
    "Text": "they and their spouses will be in shady groves reclining on soft\\n\\t\\t\\tcouches."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "57",
    "Text": "They will have all kinds of fruit and they will get whatever they\\n\\t\\t\\tcall for;"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "58",
    "Text": "they will be greeted with the word \"Salaam (Peace)\" from the Lord\\n\\t\\t\\tof Mercy (Allah)."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "59",
    "Text": "While to the sinners He will say: \"Get aside today, you\\n\\t\\t\\tcriminals!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "60",
    "Text": "Did I not enjoin you, O children of Adam, not to worship Shaitan,\\n\\t\\t\\twho is your open enemy,"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "61",
    "Text": "and that you should worship Me which is the Right Way?"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "62",
    "Text": "Yet, inspite of this, he (Shaitan) has led a great number of you\\n\\t\\t\\tastray. Had you no common sense?"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "63",
    "Text": "This is the hell, of which you were repeatedly warned."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "64",
    "Text": "Now! Enter in it this Day because you persistently rejected the\\n\\t\\t\\ttruth.\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "65",
    "Text": "On that Day, We shall seal their mouths while their hands will\\n\\t\\t\\tspeak to Us and their feet will bear witness to all their\\n\\t\\t\\tmisdeeds."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "66",
    "Text": "Had it been Our Will, We could surely have blotted out their\\n\\t\\t\\teyes; and let them run about groping for the way, then how could\\n\\t\\t\\tthey see?"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "67",
    "Text": "And had it been Our Will, We could have nailed them to the\\n\\t\\t\\tground, then neither could they move forward nor retrace their\\n\\t\\t\\tsteps."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "68",
    "Text": "Those to whom We grant long life, We reverse their nature. Don't\\n\\t\\t\\tthey understand anything from this?"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "69",
    "Text": "We have not taught him (Muhammad) poetry, nor does it behove him.\\n\\t\\t\\tThis is nothing but a reminder and a plain Qur'an"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "70",
    "Text": "to warn those who are alive and to establish the charge against\\n\\t\\t\\tthe disbelievers."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "71",
    "Text": "Do they not see that among the other things which Our hands have\\n\\t\\t\\tfashioned, We have created cattle which are under their\\n\\t\\t\\tdomination?"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "72",
    "Text": "We have subjected these animals to them, that they may ride on\\n\\t\\t\\tsome and eat the flesh of others,"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "73",
    "Text": "in them there are other advantages and drinks (milk) for them.\\n\\t\\t\\tShould they not then be grateful?"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "74",
    "Text": "Yet they have taken other gods besides Allah hoping to get their\\n\\t\\t\\thelp."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "75",
    "Text": "But they do not have the ability to help them yet their\\n\\t\\t\\tworshippers stand like warriors ready to defend them."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "76",
    "Text": "Let not their words grieve you (O Muhammad). Surely We have\\n\\t\\t\\tknowledge of all that they conceal and all that they reveal."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "77",
    "Text": "Does not man see that We have created him from a sperm? Yet he\\n\\t\\t\\tstands up as an open adversary."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "78",
    "Text": "He starts making comparisons for Us and forgets his own creation.\\n\\t\\t\\tHe says: \"Who will give life to bones that have been decomposed?\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "79",
    "Text": "Tell them: \"He Who has created them for the first time, will give\\n\\t\\t\\tthem life again, He is well-versed in every kind of creation."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "80",
    "Text": "It is He Who produces for you the spark from the green tree to\\n\\t\\t\\tkindle therewith your own fires."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "81",
    "Text": "Does He Who has created the heavens and the earth have no power\\n\\t\\t\\tto create the like thereof?\" Of course He does! He is the skilful\\n\\t\\t\\tCreator."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "82",
    "Text": "Whenever He intends a thing, He needs only to say: \"Be,\" and it\\n\\t\\t\\tis."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "83",
    "Text": "Glory be to Him in Whose hands is the Kingdom of all things; and\\n\\t\\t\\tto Whom you shall all be brought back."
  }
]
