{
    "325": {
        "bookNumber": 2,
        "hadithNumber": 325,
        "enghadithText": "It was narrated from Ibn 'Abbas that one of the wives of the Prophet (ﷺ) performed Ghusl from Janabah, and the Prophet (ﷺ) performed Wudu' with her leftover water. She mentioned that to him and he said:\"Water is not made impure by anything.\" [1] [1] See the following versions",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ سُفْيَانَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ بَعْضَ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اغْتَسَلَتْ مِنَ الْجَنَابَةِ فَتَوَضَّأَ النَّبِيُّ صلى الله عليه وسلم بِفَضْلِهَا فَذَكَرَتْ ذَلِكَ لَهُ فَقَالَ ‏ \"‏ إِنَّ الْمَاءَ لاَ يُنَجِّسُهُ شَىْءٌ ‏\"‏ ‏.‏"
    },
    "326": {
        "bookNumber": 2,
        "hadithNumber": 326,
        "enghadithText": "It was narrated that Abu Sa'eed Al-Khudri said:\"It was said: 'O Messenger of Allah, you perform Wudu' from the well into which the bodies of dogs, menstrual rags and garbage are thrown?' He said: 'Water is pure and it is not made impure by anything",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ كَثِيرٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَعْبٍ الْقُرَظِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قِيلَ يَا رَسُولَ اللَّهِ أَتَتَوَضَّأُ مِنْ بِئْرِ بُضَاعَةَ وَهِيَ بِئْرٌ يُطْرَحُ فِيهَا لُحُومُ الْكِلاَبِ وَالْحِيَضُ وَالنَّتَنُ فَقَالَ ‏ \"‏ الْمَاءُ طَهُورٌ لاَ يُنَجِّسُهُ شَىْءٌ ‏\"‏ ‏.‏"
    },
    "327": {
        "bookNumber": 2,
        "hadithNumber": 327,
        "enghadithText": "It was narrated from Ibn Abi Sa'eed Al-Khudri that his father said:\"I passed by the Prophet (ﷺ) when he was performing Wudu' from the well of Buda'ah. I said: 'Are you performing Wudu' from it when garbage is thrown into it?' He said: 'Water is not made impure by anything",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ، قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ، - وَكَانَ مِنَ الْعَابِدِينَ - عَنْ مُطَرِّفِ بْنِ طَرِيفٍ، عَنْ خَالِدِ بْنِ أَبِي نَوْفٍ، عَنْ سَلِيطٍ، عَنِ ابْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، قَالَ مَرَرْتُ بِالنَّبِيِّ صلى الله عليه وسلم وَهُوَ يَتَوَضَّأُ مِنْ بِئْرِ بُضَاعَةَ فَقُلْتُ أَتَتَوَضَّأُ مِنْهَا وَهِيَ يُطْرَحُ فِيهَا مَا يُكْرَهُ مِنَ النَّتْنِ فَقَالَ ‏ \"‏ الْمَاءُ لاَ يُنَجِّسُهُ شَىْءٌ ‏\"‏ ‏.‏"
    },
    "328": {
        "bookNumber": 2,
        "hadithNumber": 328,
        "enghadithText": "It was narrated from 'Ubaidullah bin 'Abdullah bin 'Umar that his father said:\"The Messenger of Allah (ﷺ) was asked about water and how some animals and carnivorous beasts might drink from it. He said: 'If the water is more than two Qullahs, it will not become filthy",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمَاءِ وَمَا يَنُوبُهُ مِنَ الدَّوَابِّ وَالسِّبَاعِ فَقَالَ ‏ \"‏ إِذَا كَانَ الْمَاءُ قُلَّتَيْنِ لَمْ يَحْمِلِ الْخَبَثَ ‏\"‏ ‏.‏"
    },
    "329": {
        "bookNumber": 2,
        "hadithNumber": 329,
        "enghadithText": "It was narrated from Anas that a Bedouin urinated in the Masjid, and some of the people went after him, but the Messenger of Allah (ﷺ) said:\"Do not restrain him.\" When he had finished he called from a bucket (of water) and poured over it",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ أَعْرَابِيًّا، بَالَ فِي الْمَسْجِدِ فَقَامَ إِلَيْهِ بَعْضُ الْقَوْمِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُزْرِمُوهُ ‏\"‏ ‏.‏ فَلَمَّا فَرَغَ دَعَا بِدَلْوٍ مِنْ مَاءٍ فَصَبَّهُ عَلَيْهِ ‏.‏"
    },
    "330": {
        "bookNumber": 2,
        "hadithNumber": 330,
        "enghadithText": "It was narrated that Abu Hurairah said:\"A Bedouin stood up and urinated in the Masjid, so the people grabbed him. The Messenger of Allah (ﷺ) said to them: 'Leave him alone, and pour a bucket of water over his urine. For you have been sent to make things easy for people, you have not been sent to make things difficult",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، عَنْ عُمَرَ بْنِ عَبْدِ الْوَاحِدِ، عَنِ الأَوْزَاعِيِّ، عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَامَ أَعْرَابِيٌّ فَبَالَ فِي الْمَسْجِدِ فَتَنَاوَلَهُ النَّاسُ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ دَعُوهُ وَأَهْرِيقُوا عَلَى بَوْلِهِ دَلْوًا مِنْ مَاءٍ فَإِنَّمَا بُعِثْتُمْ مُيَسِّرِينَ وَلَمْ تُبْعَثُوا مُعَسِّرِينَ ‏\"‏ ‏.‏"
    },
    "331": {
        "bookNumber": 2,
        "hadithNumber": 331,
        "enghadithText": "Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'None of you should perform Ghusl in standing water while he is Junub",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، عَنْ عَمْرٍو، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ بُكَيْرٍ، أَنَّ أَبَا السَّائِبِ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَغْتَسِلْ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَهُوَ جُنُبٌ ‏\"‏ ‏.‏"
    },
    "332": {
        "bookNumber": 2,
        "hadithNumber": 332,
        "enghadithText": "Abu Hurairah said:\"A man asked the prophet (ﷺ): 'O Messenger of Allah, we travel by sea and we take a little water with us, but if we use it for Wudu', we will go thirsty. Can we perform Wudu' with seawater?' The Messenger of Allah (ﷺ) said: 'Its water is a means of purification and its dead meat is permissible",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ صَفْوَانَ بْنِ سُلَيْمٍ، عَنْ سَعِيدِ بْنِ سَلَمَةَ، أَنَّ الْمُغِيرَةَ بْنَ أَبِي بُرْدَةَ، أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا نَرْكَبُ الْبَحْرَ وَنَحْمِلُ مَعَنَا الْقَلِيلَ مِنَ الْمَاءِ فَإِنْ تَوَضَّأْنَا بِهِ عَطِشْنَا أَفَنَتَوَضَّأُ مِنْ مَاءِ الْبَحْرِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ ‏\"‏ ‏.‏"
    },
    "333": {
        "bookNumber": 2,
        "hadithNumber": 333,
        "enghadithText": "It was narrated that 'Aishah said:\"The Prophet (ﷺ) used to say: 'Allahummaghsil khatayaya bi-ma'ith-thalj wal-barad was naqqi qalbi min al-khataya kama naqayta ath-thawb al-abyad min ad-danas (O Allah, wash away my sins with the water of snow and hail, and cleanse my heart of snow and hail, and cleanse my heart of sin as a white garment is cleansed of filth)",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ اغْسِلْ خَطَايَاىَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ ‏\"‏ ‏.‏"
    },
    "334": {
        "bookNumber": 2,
        "hadithNumber": 334,
        "enghadithText": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) would say: [1] 'Allahummaghsil khatayaya bi-ma'ith-thalj wal-barad (O Allah, wash away my sins with the water of snow and hail).'\" [1] That is at the beginning of Salah as is clear from the remainder of the narration which preceded under No. 60",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَاىَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ ‏\"‏ ‏.‏"
    },
    "335": {
        "bookNumber": 2,
        "hadithNumber": 335,
        "enghadithText": "It was narrated that Abu Hurairah said:\"The Messenger of Allah (ﷺ) said: 'If a dog licks the vessel of any one of you, let him throw (the contents) away and wash it seven times",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي رَزِينٍ، وَأَبِي، صَالِحٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا وَلَغَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيُرِقْهُ ثُمَّ لْيَغْسِلْهُ سَبْعَ مَرَّاتٍ ‏\"‏ ‏.‏"
    },
    "336": {
        "bookNumber": 2,
        "hadithNumber": 336,
        "enghadithText": "It was narrated from 'Abdullah bin Mughaffal that the Messenger of Allah (ﷺ) commanded that dogs be killed, but he made an exception for hunting dogs and sheepdogs and said:\"If a dog licks a vessel then wash it seven times and rub it the eighth time with dust",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - عَنْ شُعْبَةَ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ مُطَرِّفًا، عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ وَرَخَّصَ فِي كَلْبِ الصَّيْدِ وَالْغَنَمِ وَقَالَ ‏ \"‏ إِذَا وَلَغَ الْكَلْبُ فِي الإِنَاءِ فَاغْسِلُوهُ سَبْعَ مَرَّاتٍ وَعَفِّرُوهُ الثَّامِنَةَ بِالتُّرَابِ ‏\"‏ ‏.‏"
    },
    "337": {
        "bookNumber": 2,
        "hadithNumber": 337,
        "enghadithText": "It was narrated that 'Abdullah bin Mughaffal said:\"The Messenger of Allah (ﷺ) commanded that dogs be killed. He said: 'What do they have to do with dogs?' And he granted a concession regarding hunting dogs and sheepdogs. And he said: 'If a dog licks a vessel, wash it seven times, and rub it the eighth time with dust.' Abu Hurairah differed from him and said: 'Rub it one time with dust",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، يَزِيدَ بْنِ حُمَيْدٍ قَالَ سَمِعْتُ مُطَرِّفًا، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَتْلِ الْكِلاَبِ قَالَ ‏\"‏ مَا بَالُهُمْ وَبَالُ الْكِلاَبِ ‏\"‏ ‏.‏ قَالَ وَرَخَّصَ فِي كَلْبِ الصَّيْدِ وَكَلْبِ الْغَنَمِ وَقَالَ ‏\"‏ إِذَا وَلَغَ الْكَلْبُ فِي الإِنَاءِ فَاغْسِلُوهُ سَبْعَ مَرَّاتٍ وَعَفِّرُوا الثَّامِنَةَ بِالتُّرَابِ ‏\"‏ ‏.‏ خَالَفَهُ أَبُو هُرَيْرَةَ فَقَالَ إِحْدَاهُنَّ بِالتُّرَابِ ‏.‏"
    },
    "338": {
        "bookNumber": 2,
        "hadithNumber": 338,
        "enghadithText": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:\"If a dog licks the vessel of any one of you, let him wash it seven times, the first time with dust",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ خِلاَسٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا وَلَغَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعَ مَرَّاتٍ أُولاَهُنَّ بِالتُّرَابِ ‏\"‏ ‏.‏"
    },
    "339": {
        "bookNumber": 2,
        "hadithNumber": 339,
        "enghadithText": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:\"If a dog licks the vessel of any one of you, let him wash it seven times, the first time with dust",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا وَلَغَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعَ مَرَّاتٍ أُولاَهُنَّ بِالتُّرَابِ ‏\"‏ ‏.‏"
    },
    "340": {
        "bookNumber": 2,
        "hadithNumber": 340,
        "enghadithText": "It was narrated from Kabshah bint Ka'ab bin Malik that Abu Qatadah entered upon her, then she narrated the following:\"I poured some water for him for Wudu', and a cat came and drank from it, so he tilted the vessel for it to drink.\" Kabshah said: \"He saw me looking at him and said: 'Are you surprised, O daughter of my brother?' I said: 'Yes.' He said: 'The Messenger of Allah (ﷺ) said: 'They are not impure, rather they are among the males and females (animals) who go around among you",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ حُمَيْدَةَ بِنْتِ عُبَيْدِ بْنِ رِفَاعَةَ، عَنْ كَبْشَةَ بِنْتِ كَعْبِ بْنِ مَالِكٍ، أَنَّ أَبَا قَتَادَةَ، دَخَلَ عَلَيْهَا ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا فَسَكَبْتُ لَهُ وَضُوءًا فَجَاءَتْ هِرَّةٌ فَشَرِبَتْ مِنْهُ فَأَصْغَى لَهَا الإِنَاءَ حَتَّى شَرِبَتْ قَالَتْ كَبْشَةُ فَرَآنِي أَنْظُرُ إِلَيْهِ فَقَالَ أَتَعْجَبِينَ يَا ابْنَةَ أَخِي قُلْتُ نَعَمْ ‏.‏ قَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّهَا لَيْسَتْ بِنَجَسٍ إِنَّمَا هِيَ مِنَ الطَّوَّافِينَ عَلَيْكُمْ وَالطَّوَّافَاتِ ‏\"‏ ‏.‏"
    },
    "341": {
        "bookNumber": 2,
        "hadithNumber": 341,
        "enghadithText": "It was narrated that 'Aishah, may Allah be pleased with her, said:\"While I was menstruating, I would nibble meat from a bone and the Messenger of Allah (ﷺ) would put his mouth where mine has been. And while I was menstruating, I would drink from a vessel and he would put his mouth where mine had been",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، - رضى الله عنها - قَالَتْ كُنْتُ أَتَعَرَّقُ الْعَرْقَ فَيَضَعُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاهُ حَيْثُ وَضَعْتُهُ وَأَنَا حَائِضٌ وَكُنْتُ أَشْرَبُ مِنَ الإِنَاءِ فَيَضَعُ فَاهُ حَيْثُ وَضَعْتُ وَأَنَا حَائِضٌ ‏.‏"
    },
    "342": {
        "bookNumber": 2,
        "hadithNumber": 342,
        "enghadithText": "It was narrated that Ibn 'Umar said:\"Men and women used to perform Wudu' together during the time of the Messenger of Allah (ﷺ)",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مَعْنٌ، قَالَ حَدَّثَنَا مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ الرِّجَالُ وَالنِّسَاءُ يَتَوَضَّئُونَ فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم جَمِيعًا ‏.‏"
    },
    "343": {
        "bookNumber": 2,
        "hadithNumber": 343,
        "enghadithText": "It was narrated from Al-Hakam bin 'Amr that the Messenger of Allah (ﷺ) forbade a man from performing Wudu' with the leftovers of a woman's (water for) Wudu",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ الأَحْوَلِ، قَالَ سَمِعْتُ أَبَا حَاجِبٍ، - قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَاسْمُهُ سَوَادَةُ بْنُ عَاصِمٍ - عَنِ الْحَكَمِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يَتَوَضَّأَ الرَّجُلُ بِفَضْلِ وَضُوءِ الْمَرْأَةِ ‏.‏"
    },
    "344": {
        "bookNumber": 2,
        "hadithNumber": 344,
        "enghadithText": "It was narrated from 'Aishah that she used to perform Ghusl with the Messenger of Allah (ﷺ) from a single vessel",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تَغْتَسِلُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الإِنَاءِ الْوَاحِدِ ‏.‏"
    },
    "345": {
        "bookNumber": 2,
        "hadithNumber": 345,
        "enghadithText": "It was narrated that 'Abdullah bin Jabr said:\"I heard Anas bin Malik say: 'The Messenger of Allah (ﷺ) used to perform Wudu' with a Makkuk (cup) and Ghusl with five Makkuks (cups)",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ جَبْرٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَوَضَّأُ بِمَكُّوكٍ وَيَغْتَسِلُ بِخَمْسَةِ مَكَاكِيَّ ‏.‏"
    },
    "346": {
        "bookNumber": 2,
        "hadithNumber": 346,
        "enghadithText": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) used to perform Ghusl with a Mudd and Ghusl with approximately a Sa",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ الْكُوفِيُّ، قَالَ حَدَّثَنَا عَبْدَةُ، - يَعْنِي ابْنَ سُلَيْمَانَ - عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَتَوَضَّأُ بِمُدٍّ وَيَغْتَسِلُ بِنَحْوِ الصَّاعِ ‏.‏"
    },
    "347": {
        "bookNumber": 2,
        "hadithNumber": 347,
        "enghadithText": "It was narrated that 'Aishah said:\"The Messenger of Allah (ﷺ) used to perform Ghusl with a Mudd and Ghusl with a Sa",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، قَالَ حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَوَضَّأُ بِالْمُدِّ وَيَغْتَسِلُ بِالصَّاعِ ‏.‏"
    }
}