{
    "3939": {
        "bookNumber": 36,
        "hadithNumber": 3939,
        "enghadithText": "It was narrated that Anas said:\"The Messenger of Allah said: 'In this world, women and perfume have been made dear to me, and my comfort has been provided in prayer",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Hasan Sahih",
        "arabhadithText": "حَدَّثَنِي الشَّيْخُ الإِمَامُ أَبُو عَبْدِ الرَّحْمَنِ النَّسَائِيُّ، قَالَ أَخْبَرَنَا الْحُسَيْنُ بْنُ عِيسَى الْقُومَسِيُّ، قَالَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا سَلاَّمٌ أَبُو الْمُنْذِرِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ حُبِّبَ إِلَىَّ مِنَ الدُّنْيَا النِّسَاءُ وَالطِّيبُ وَجُعِلَ قُرَّةُ عَيْنِي فِي الصَّلاَةِ ‏\"‏ ‏.‏"
    },
    "3940": {
        "bookNumber": 36,
        "hadithNumber": 3940,
        "enghadithText": "It was narrated that Anas said:\"The Messenger of Allah said: 'Women and perfume have been made dear to me, but my comfort has been provided in prayer",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَلِيُّ بْنُ مُسْلِمٍ الطُّوسِيُّ، قَالَ حَدَّثَنَا سَيَّارٌ، قَالَ حَدَّثَنَا جَعْفَرٌ، قَالَ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ حُبِّبَ إِلَىَّ النِّسَاءُ وَالطِّيبُ وَجُعِلَتْ قُرَّةُ عَيْنِي فِي الصَّلاَةِ ‏\"‏ ‏.‏"
    },
    "3941": {
        "bookNumber": 36,
        "hadithNumber": 3941,
        "enghadithText": "It was narrated that Anas bin Malik said:\"Nothing was dearer to the Messenger of Allah after women than horses",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Daif",
        "arabhadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ لَمْ يَكُنْ شَىْءٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بَعْدَ النِّسَاءِ مِنَ الْخَيْلِ ‏.‏"
    },
    "3942": {
        "bookNumber": 36,
        "hadithNumber": 3942,
        "enghadithText": "It was narrated from Abu Hurairah that the Prophet said:\"Whoever has two wives and is inclined to favor one of them over the other, he will come on the Day of Resurrection with half of his body leaning",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا هَمَّامٌ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ كَانَ لَهُ امْرَأَتَانِ يَمِيلُ لإِحْدَاهُمَا عَلَى الأُخْرَى جَاءَ يَوْمَ الْقِيَامَةِ أَحَدُ شِقَّيْهِ مَائِلٌ ‏\"‏ ‏.‏"
    },
    "3943": {
        "bookNumber": 36,
        "hadithNumber": 3943,
        "enghadithText": "It was narrated that 'Aishah said:\"The Messenger of Allah used to divide his time equally among his wives then he would say: 'O Allah, this is what I have done with regard to that over which I have control, so do not blame me for that over which You have control and I do not.'\" Hammad bin Zaid narrated it in Mursal form",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Daif",
        "arabhadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْسِمُ بَيْنَ نِسَائِهِ ثُمَّ يَعْدِلُ ثُمَّ يَقُولُ ‏ \"‏ اللَّهُمَّ هَذَا فِعْلِي فِيمَا أَمْلِكُ فَلاَ تَلُمْنِي فِيمَا تَمْلِكُ وَلاَ أَمْلِكُ ‏\"‏ ‏.‏ أَرْسَلَهُ حَمَّادُ بْنُ زَيْدٍ ‏.‏"
    },
    "3944": {
        "bookNumber": 36,
        "hadithNumber": 3944,
        "enghadithText": "Aishah said:\"The wives of the Prophet sent Fatimah, the daughter of the Messenger of Allah, to the Messenger of Allah. She asked permission to enter when he was lying with me under my cover. He gave her permission to enter, and she said: 'O Messenger of Allah, your wives have sent me to you to ask you to be equitable with regard to the matter of the daughter of Abu Quhafah.' I ('Aishah) kept quiet and the Messenger of Allah said to her: 'O my daughter! Do you not love the one whom I love?' She said: 'Yes.' He said: 'Then love this one.' Fatimah stood up when she heard this and left the Messenger of Allah, and went back to the wives of the Prophet. She told them what she had said, and what he had said to her. They said to her: 'We do not think that you have been of any avail to us. Go back to the Messenger of Allah and say to him: Your wives are urging you to be equitable with regard to the matter of the daughter of Abu Quhafah.' Fatimah said: 'No, by Allah; I will never speak to him about her again.'\" 'Aishah said: \"So the wives of the Prophet sent Zainab bint Jahsh to the Messenger of Allah; she was one who was somewhat equal to me in rank in the eyes of the Messenger of Allah. And I have never seen a woman who was better in religious commitment than Zainab, more fearing of Allah, more honest in speech, more dutiful in upholding the ties of kinship, more generous in giving charity, and devoted in giving of herself in acts of charity, by means of which she sought to draw closer to Allah. But she was quick-tempered; however, she was also quick to calm down. She asked permission to enter upon the Messenger of Allah when he was with 'Aishah under her cover, in the same situation as when Fatimah had entered. The Messenger of Allah gave her permission to enter and she said: 'O Messenger of Allah, your wives have sent me to ask you to be equitable with regard to the matter of the daughter of Abu Quhafah.' Then she verbally abused me at length, and I was watching the Messenger of Allah to see if he would allow me to respond. Zainab went on until I realized that the Messenger of Allah would not disapprove if I responded. Then I spoke back to her in such a way, until I silenced her. Then the Messenger of Allah said: 'She is the daughter of Abu Bakr",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّ عَائِشَةَ، قَالَتْ أَرْسَلَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَاسْتَأْذَنَتْ عَلَيْهِ وَهُوَ مُضْطَجِعٌ مَعِي فِي مِرْطِي فَأَذِنَ لَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَزْوَاجَكَ أَرْسَلْنَنِي إِلَيْكَ يَسْأَلْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ ‏.‏ وَأَنَا سَاكِتَةٌ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَىْ بُنَيَّةُ أَلَسْتِ تُحِبِّينَ مَنْ أُحِبُّ ‏\"‏ ‏.‏ قَالَتْ بَلَى ‏.‏ قَالَ ‏\"‏ فَأَحِبِّي هَذِهِ ‏\"‏ ‏.‏ فَقَامَتْ فَاطِمَةُ حِينَ سَمِعَتْ ذَلِكَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَجَعَتْ إِلَى أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَتْهُنَّ بِالَّذِي قَالَتْ وَالَّذِي قَالَ لَهَا فَقُلْنَ لَهَا مَا نَرَاكِ أَغْنَيْتِ عَنَّا مِنْ شَىْءٍ فَارْجِعِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُولِي لَهُ إِنَّ أَزْوَاجَكَ يَنْشُدْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ ‏.‏ قَالَتْ فَاطِمَةُ لاَ وَاللَّهِ لاَ أُكَلِّمُهُ فِيهَا أَبَدًا ‏.‏ قَالَتْ عَائِشَةُ فَأَرْسَلَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم زَيْنَبَ بِنْتَ جَحْشٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهِيَ الَّتِي كَانَتْ تُسَامِينِي مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم فِي الْمَنْزِلَةِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَمْ أَرَ امْرَأَةً قَطُّ خَيْرًا فِي الدِّينِ مِنْ زَيْنَبَ وَأَتْقَى لِلَّهِ عَزَّ وَجَلَّ وَأَصْدَقَ حَدِيثًا وَأَوْصَلَ لِلرَّحِمِ وَأَعْظَمَ صَدَقَةً وَأَشَدَّ ابْتِذَالاً لِنَفْسِهَا فِي الْعَمَلِ الَّذِي تَصَدَّقُ بِهِ وَتَقَرَّبُ بِهِ مَا عَدَا سَوْرَةً مِنْ حِدَّةٍ كَانَتْ فِيهَا تُسْرِعُ مِنْهَا الْفَيْأَةَ فَاسْتَأْذَنَتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَرَسُولُ اللَّهِ صلى الله عليه وسلم مَعَ عَائِشَةَ فِي مِرْطِهَا عَلَى الْحَالِ الَّتِي كَانَتْ دَخَلَتْ فَاطِمَةُ عَلَيْهَا فَأَذِنَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَزْوَاجَكَ أَرْسَلْنَنِي يَسْأَلْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ وَوَقَعَتْ بِي فَاسْتَطَالَتْ وَأَنَا أَرْقُبُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَرْقُبُ طَرْفَهُ هَلْ أَذِنَ لِي فِيهَا فَلَمْ تَبْرَحْ زَيْنَبُ حَتَّى عَرَفْتُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لاَ يَكْرَهُ أَنْ أَنْتَصِرَ فَلَمَّا وَقَعْتُ بِهَا لَمْ أَنْشَبْهَا بِشَىْءٍ حَتَّى أَنْحَيْتُ عَلَيْهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّهَا ابْنَةُ أَبِي بَكْرٍ ‏\"‏ ‏.‏"
    },
    "3945": {
        "bookNumber": 36,
        "hadithNumber": 3945,
        "enghadithText": "It was narrated that 'Aishah mentioned a similar report and said:\"The wives of the Prophet sent Zainab and she asked him permission to enter and she entered.\" And she said something similar. Ma'mar contradicted the two of them; he reported it from Az-Zuhri, from 'Urwah, from 'Aishah",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih Isnaad",
        "arabhadithText": "أَخْبَرَنِي عِمْرَانُ بْنُ بَكَّارٍ الْحِمْصِيُّ، قَالَ حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَنْبَأَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّ عَائِشَةَ، قَالَتْ فَذَكَرَتْ نَحْوَهُ وَقَالَتْ أَرْسَلَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم زَيْنَبَ فَاسْتَأْذَنَتْ فَأَذِنَ لَهَا فَدَخَلَتْ فَقَالَتْ نَحْوَهُ ‏.‏ خَالَفَهُمَا مَعْمَرٌ رَوَاهُ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ ‏.‏"
    },
    "3946": {
        "bookNumber": 36,
        "hadithNumber": 3946,
        "enghadithText": "It was narrated that 'Aishah said:\"The wives of the Prophet got together and sent Fatimah to the Prophet. They told her to say: 'Your wives'\" -and he (the narrator) said something to the effect that they are urging you to be equitable with regard to the matter of the daughter of Abu Quhafah. She said: \"So she entered upon the Prophet when he was with 'Aishah under her cover. She said to him: 'Your wives have sent me and they are urging you to be equitable with regard to the matter of the daughter of Abu Quhafah.' The Prophet said to her: 'Do you love me?' She said: 'Yes.' He said: 'Then love her.' So she went back to them and told them what he said. They said to her: 'You did not do anything; go back to him.' She said: 'By Allah, I will never go back (and speak to him) about her again.' She was truly the daughter of the Messenger of Allah. So they sent Zainab bint Jahsh.\" 'Aishah said: \"She was somewhat my equal among the wives of the Prophet. She said: 'Your wives have sent me to urge you to be equitable with regard to the matter of the daughter of Abu Quhafa.' Then she swooped on me and abused me, and I started watching the Prophet to see if he would give me permission to respond to her. She insulted me and I started to think that he would not disapprove if I responded to her. So I insulted her and I soon silenced her. Then the Prophet said to her: 'She is the daughter of Abu Bakr.'\" 'Aishah said: \"And I never saw any woman who was better, more generous in giving charity, more keen to uphold the ties of kinship, and more generous in giving of herself in everything by means of which she could draw closer to Allah than Zainab. But she had a quick temper; however, she was also quick to calm down",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih Isnaad",
        "arabhadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ النَّيْسَابُورِيُّ الثِّقَةُ الْمَأْمُونُ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتِ اجْتَمَعْنَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم فَأَرْسَلْنَ فَاطِمَةَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْنَ لَهَا إِنَّ نِسَاءَكَ وَذَكَرَ كَلِمَةً مَعْنَاهَا يَنْشُدْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ ‏.‏ قَالَتْ فَدَخَلَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ مَعَ عَائِشَةَ فِي مِرْطِهَا فَقَالَتْ لَهُ إِنَّ نِسَاءَكَ أَرْسَلْنَنِي وَهُنَّ يَنْشُدْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ ‏.‏ فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَتُحِبِّينِي ‏\"‏ ‏.‏ قَالَتْ نَعَمْ قَالَ ‏\"‏ فَأَحِبِّيهَا ‏\"‏ ‏.‏ قَالَتْ فَرَجَعَتْ إِلَيْهِنَّ فَأَخْبَرَتْهُنَّ مَا قَالَ فَقُلْنَ لَهَا إِنَّكِ لَمْ تَصْنَعِي شَيْئًا فَارْجِعِي إِلَيْهِ ‏.‏ فَقَالَتْ وَاللَّهِ لاَ أَرْجِعُ إِلَيْهِ فِيهَا أَبَدًا ‏.‏ وَكَانَتِ ابْنَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَقًّا فَأَرْسَلْنَ زَيْنَبَ بِنْتَ جَحْشٍ قَالَتْ عَائِشَةُ وَهِيَ الَّتِي كَانَتْ تُسَامِينِي مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ أَزْوَاجُكَ أَرْسَلْنَنِي وَهُنَّ يَنْشُدْنَكَ الْعَدْلَ فِي ابْنَةِ أَبِي قُحَافَةَ ‏.‏ ثُمَّ أَقْبَلَتْ عَلَىَّ تَشْتِمُنِي فَجَعَلْتُ أُرَاقِبُ النَّبِيَّ صلى الله عليه وسلم وَأَنْظُرُ طَرْفَهُ هَلْ يَأْذَنُ لِي مِنْ أَنْ أَنْتَصِرَ مِنْهَا - قَالَتْ - فَشَتَمَتْنِي حَتَّى ظَنَنْتُ أَنَّهُ لاَ يَكْرَهُ أَنْ أَنْتَصِرَ مِنْهَا فَاسْتَقْبَلْتُهَا فَلَمْ أَلْبَثْ أَنْ أَفْحَمْتُهَا فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهَا ابْنَةُ أَبِي بَكْرٍ ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ فَلَمْ أَرَ امْرَأَةً خَيْرًا وَلاَ أَكْثَرَ صَدَقَةً وَلاَ أَوْصَلَ لِلرَّحِمِ وَأَبْذَلَ لِنَفْسِهَا فِي كُلِّ شَىْءٍ يُتَقَرَّبُ بِهِ إِلَى اللَّهِ تَعَالَى مِنْ زَيْنَبَ مَا عَدَا سَوْرَةً مِنْ حِدَّةٍ كَانَتْ فِيهَا تُوشِكُ مِنْهَا الْفَيأَةَ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ الَّذِي قَبْلَهُ ‏.‏"
    },
    "3947": {
        "bookNumber": 36,
        "hadithNumber": 3947,
        "enghadithText": "It was narrated from Abu Musa that the Prophet said:\"The superiority of 'Aishah to other women is like the superiority of Tharid to other kinds of food",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ الْمُفَضَّلِ - قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، ‏{‏ عَنْ مُرَّةَ، ‏}‏ عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏ ‏.‏"
    },
    "3948": {
        "bookNumber": 36,
        "hadithNumber": 3948,
        "enghadithText": "It was narrated from 'Aishah that the Prophet said:\"The superiority of 'Aishah to other women is like the superiority of Tharid to other kinds of food",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ، قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ ‏\"‏ ‏.‏"
    },
    "3949": {
        "bookNumber": 36,
        "hadithNumber": 3949,
        "enghadithText": "It was narrated that 'Aishah said:\"The Messenger of Allah said: 'O Umm Salamah, do not bother me about 'Aishah, for by Allah, the Revelation has never come to me under the blanket of any of you apart from her",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ إِسْحَاقَ الصَّغَانِيُّ، قَالَ حَدَّثَنَا شَاذَانُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا أُمَّ سَلَمَةَ لاَ تُؤْذِينِي فِي عَائِشَةَ فَإِنَّهُ وَاللَّهِ مَا أَتَانِي الْوَحْىُ فِي لِحَافِ امْرَأَةٍ مِنْكُنَّ إِلاَّ هِيَ ‏\"‏ ‏.‏"
    },
    "3950": {
        "bookNumber": 36,
        "hadithNumber": 3950,
        "enghadithText": "It was narrated from Umm Salamah that the wives of the Prophet asked her to speak to the Prophet and tell him, that the people were trying to bring their gifts to him when it was 'Aishah's day, and to say to him:\"We love good things as much as 'Aishah does.\" So she spoke to him, but he did not reply her. When her turn came again, she spoke to him again, but he did not reply her. They said to her: \"How did he respond?\" She said: \"He did not answer me.\" They said: \"Do not leave him alone until he answers you or you comprehend what he says.\" When her turn came again, she spoke to him and he said: 'Do not bother me about 'Aishah, for the Revelation has never come to me under the blanket of any of you apart from the blanket of 'Aishah",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ، عَنْ عَبْدَةَ، عَنْ هِشَامٍ، عَنْ عَوْفِ بْنِ الْحَارِثِ، عَنْ رُمَيْثَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ نِسَاءَ النَّبِيِّ، صلى الله عليه وسلم كَلَّمْنَهَا أَنْ تُكَلِّمَ النَّبِيَّ صلى الله عليه وسلم أَنَّ النَّاسَ كَانُوا يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ وَتَقُولُ لَهُ إِنَّا نُحِبُّ الْخَيْرَ كَمَا تُحِبُّ عَائِشَةَ فَكَلَّمَتْهُ فَلَمْ يُجِبْهَا فَلَمَّا دَارَ عَلَيْهَا كَلَّمَتْهُ أَيْضًا فَلَمْ يُجِبْهَا وَقُلْنَ مَا رَدَّ عَلَيْكِ قَالَتْ لَمْ يُجِبْنِي ‏.‏ قُلْنَ لاَ تَدَعِيهِ حَتَّى يَرُدَّ عَلَيْكِ أَوْ تَنْظُرِينَ مَا يَقُولُ ‏.‏ فَلَمَّا دَارَ عَلَيْهَا كَلَّمَتْهُ فَقَالَ ‏ \"‏ لاَ تُؤْذِينِي فِي عَائِشَةَ فَإِنَّهُ لَمْ يَنْزِلْ عَلَىَّ الْوَحْىُ وَأَنَا فِي لِحَافِ امْرَأَةٍ مِنْكُنَّ إِلاَّ فِي لِحَافِ عَائِشَةَ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَانِ الْحَدِيثَانِ صَحِيحَانِ عَنْ عَبْدَةَ ‏.‏"
    },
    "3951": {
        "bookNumber": 36,
        "hadithNumber": 3951,
        "enghadithText": "It was narrated that 'Aishah said:\"The people used to try to bring their gifts (to the Prophet) on 'Aishah's day, hoping thereby to earn the pleasure of the Messenger of Allah",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّاسُ يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ يَبْتَغُونَ بِذَلِكَ مَرْضَاةَ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏"
    },
    "3952": {
        "bookNumber": 36,
        "hadithNumber": 3952,
        "enghadithText": "It was narrated that 'Aishah said:\"Allah sent Revelation to the Prophet when I was with him, so I got up and closed the door between him and I. When it was taken off him, he said to me: 'O 'Aishah, Jibril sends greetings of Salam to you",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Daif Isnaad",
        "arabhadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ آدَمَ، عَنْ عَبْدَةَ، عَنْ هِشَامٍ، عَنْ صَالِحِ بْنِ رَبِيعَةَ بْنِ هُدَيْرٍ، عَنْ عَائِشَةَ، قَالَتْ أَوْحَى اللَّهُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَأَنَا مَعَهُ فَقُمْتُ فَأَجَفْتُ الْبَابَ بَيْنِي وَبَيْنَهُ فَلَمَّا رُفِّهَ عَنْهُ قَالَ لِي ‏ \"‏ يَا عَائِشَةُ إِنَّ جِبْرِيلَ يُقْرِئُكِ السَّلاَمَ ‏\"‏ ‏.‏"
    },
    "3953": {
        "bookNumber": 36,
        "hadithNumber": 3953,
        "enghadithText": "It was narrated from 'Aishah that the Prophet said to her:\"Jibril sends greetings of Salam to you.\" She said: \"And upon him be peace and the mercy of Allah and His blessings; you see what we do not",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهَا ‏ \"‏ إِنَّ جِبْرِيلَ يَقْرَأُ عَلَيْكِ السَّلاَمَ ‏\"‏ ‏.‏ قَالَتْ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ تَرَى مَا لاَ نَرَى ‏.‏"
    },
    "3954": {
        "bookNumber": 36,
        "hadithNumber": 3954,
        "enghadithText": "It was narrated that 'Aishah said:\"The Messenger of Allah said: 'O 'Aishah, this is Jibril and he is sending greetings of Salam to you.'\" The same",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، قَالَ أَنْبَأَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ يَا عَائِشَةُ هَذَا جِبْرِيلُ وَهُوَ يَقْرَأُ عَلَيْكِ السَّلاَمَ ‏\"‏ ‏.‏ مِثْلَهُ سَوَاءٌ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا الصَّوَابُ وَالَّذِي قَبْلَهُ خَطَأٌ ‏.‏"
    },
    "3955": {
        "bookNumber": 36,
        "hadithNumber": 3955,
        "enghadithText": "Anas said:\"The Prophet was with one of the Mothers of the Believers when another one sent a wooden bowl in which was some food. She struck the hand of the Prophet and the bowl fell and broke. The Prophet picked up the two pieces and put them together, then he started to gather up the food and said: 'Your mother got jealous; eat.' So they ate. He waited until she brought the wooden bowl that was in her house, then he gave the sound bowl to the messenger and left the broken bowl in the house of the one who had broken it",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا حُمَيْدٌ، قَالَ حَدَّثَنَا أَنَسٌ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم عِنْدَ إِحْدَى أُمَّهَاتِ الْمُؤْمِنِينَ فَأَرْسَلَتْ أُخْرَى بِقَصْعَةٍ فِيهَا طَعَامٌ فَضَرَبَتْ يَدَ الرَّسُولِ فَسَقَطَتِ الْقَصْعَةُ فَانْكَسَرَتْ فَأَخَذَ النَّبِيُّ صلى الله عليه وسلم الْكِسْرَتَيْنِ فَضَمَّ إِحْدَاهُمَا إِلَى الأُخْرَى فَجَعَلَ يَجْمَعُ فِيهَا الطَّعَامَ وَيَقُولُ ‏ \"‏ غَارَتْ أُمُّكُمْ كُلُوا ‏\"‏ ‏.‏ فَأَكَلُوا فَأَمْسَكَ حَتَّى جَاءَتْ بِقَصْعَتِهَا الَّتِي فِي بَيْتِهَا فَدَفَعَ الْقَصْعَةَ الصَّحِيحَةَ إِلَى الرَّسُولِ وَتَرَكَ الْمَكْسُورَةَ فِي بَيْتِ الَّتِي كَسَرَتْهَا ‏.‏"
    },
    "3956": {
        "bookNumber": 36,
        "hadithNumber": 3956,
        "enghadithText": "It was narrated from Umm Salamah that she brought some food in a dish of hers to the Messenger of Allah and his Companions, then 'Aishah came, wrapped up in a garment, with a stone pestle and broke the dish. The Prophet gathered the broken pieces of the dish and said:\"Eat; your mother got jealous,\" twice. Then the Messenger of Allah took the dish of 'Aishah and sent it to Umm Salamah and he gave the dish of Umm Salamah to 'Aishah",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَسَدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أُمِّ سَلَمَةَ، أَنَّهَا - يَعْنِي - أَتَتْ بِطَعَامٍ فِي صَحْفَةٍ لَهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَصْحَابِهِ فَجَاءَتْ عَائِشَةُ مُتَّزِرَةً بِكِسَاءٍ وَمَعَهَا فِهْرٌ فَفَلَقَتْ بِهِ الصَّحْفَةَ فَجَمَعَ النَّبِيُّ صلى الله عليه وسلم بَيْنَ فِلْقَتَىِ الصَّحْفَةِ وَيَقُولُ ‏ \"‏ كُلُوا غَارَتْ أُمُّكُمْ ‏\"‏ ‏.‏ مَرَّتَيْنِ ثُمَّ أَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَحْفَةَ عَائِشَةَ فَبَعَثَ بِهَا إِلَى أُمِّ سَلَمَةَ وَأَعْطَى صَحْفَةَ أُمِّ سَلَمَةَ عَائِشَةَ ‏.‏"
    },
    "3957": {
        "bookNumber": 36,
        "hadithNumber": 3957,
        "enghadithText": "It was narrated that 'Aishah said:\"I never saw any woman who made food like Safiyyah. She sent a dish to the Prophet in which was some food, and I could not keep myself from breaking it. I asked the Prophet what the expiation was for that, and he said: 'A dish like that dish, and food like that food",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Daif",
        "arabhadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ فُلَيْتٍ، عَنْ جَسْرَةَ بِنْتِ دِجَاجَةَ، عَنْ عَائِشَةَ، قَالَتْ مَا رَأَيْتُ صَانِعَةَ طَعَامٍ مِثْلَ صَفِيَّةَ أَهْدَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم إِنَاءً فِيهِ طَعَامٌ فَمَا مَلَكْتُ نَفْسِي أَنْ كَسَرْتُهُ فَسَأَلْتُ النَّبِيَّ صلى الله عليه وسلم عَنْ كَفَّارَتِهِ فَقَالَ ‏ \"‏ إِنَاءٌ كَإِنَاءٍ وَطَعَامٌ كَطَعَامٍ ‏\"‏ ‏.‏"
    },
    "3958": {
        "bookNumber": 36,
        "hadithNumber": 3958,
        "enghadithText": "Aishah said that the Messenger of Allah used to stay with Zainab bint Jahsh and drink honey at her house. Hafsah and I agreed that if the Prophet entered upon either of us, she would say:\"I perceive the smell of Maghafir (a nasty-smelling gum) on you; have you eaten Maghafir?\" He came in to one of them, and she said that to him. He said: \"No, rather I drank honey at the house of Zainab bint Jahsh, but I will never do it again.\" Then the following was revealed: 'O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you.' 'If you two turn in repentance to Allah, (it will be better for you)' about 'Aishah and Hafsah, 'And (remember) when the Prophet disclosed a matter in confidence to one of his wives' refers to him saying: \"No, rather I drank honey",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، أَنَّهُ سَمِعَ عُبَيْدَ بْنَ عُمَيْرٍ، يَقُولُ سَمِعْتُ عَائِشَةَ، تَزْعُمُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَمْكُثُ عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ فَيَشْرَبُ عِنْدَهَا عَسَلاً فَتَوَاصَيْتُ أَنَا وَحَفْصَةُ أَنَّ أَيَّتَنَا دَخَلَ عَلَيْهَا النَّبِيُّ صلى الله عليه وسلم فَلْتَقُلْ إِنِّي أَجِدُ مِنْكَ رِيحَ مَغَافِيرَ أَكَلْتَ مَغَافِيرَ فَدَخَلَ عَلَى إِحْدَاهُمَا فَقَالَتْ ذَلِكَ لَهُ فَقَالَ ‏\"‏ لاَ بَلْ شَرِبْتُ عَسَلاً عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ وَلَنْ أَعُودَ لَهُ ‏\"‏ ‏.‏ فَنَزَلَتْ ‏{‏ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ‏}‏ ‏{‏ إِنْ تَتُوبَا إِلَى اللَّهِ ‏}‏ لِعَائِشَةَ وَحَفْصَةَ ‏{‏ وَإِذْ أَسَرَّ النَّبِيُّ إِلَى بَعْضِ أَزْوَاجِهِ حَدِيثًا ‏}‏ لِقَوْلِهِ ‏\"‏ بَلْ شَرِبْتُ عَسَلاً ‏\"‏ ‏.‏"
    },
    "3959": {
        "bookNumber": 36,
        "hadithNumber": 3959,
        "enghadithText": "It was narrated from Anas, that the Messenger of Allah had a female slave with whom he had intercourse, but 'Aishah and Hafsah would not leave him alone until he said that she was forbidden for him. Then Allah, the Mighty and Sublime, revealed:\"O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you.' until the end of the Verse",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih Isnaad",
        "arabhadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يُونُسَ بْنِ مُحَمَّدٍ، حَرَمِيٌّ - هُوَ لَقَبُهُ - قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَتْ لَهُ أَمَةٌ يَطَؤُهَا فَلَمْ تَزَلْ بِهِ عَائِشَةُ وَحَفْصَةُ حَتَّى حَرَّمَهَا عَلَى نَفْسِهِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏"
    },
    "3960": {
        "bookNumber": 36,
        "hadithNumber": 3960,
        "enghadithText": "It was narrated from 'Ubadah bin Al-Walid bin 'Ubadah bin As-Samit that 'Aishah said:\"I looked for the Messenger of Allah and I put my hand on his hair.\" He said: \"Your Shaitan has come to you.\" I said: \"Don't you have a Shaitan?\" He said: \"Yes, but Allah helped me with him, so he submitted",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih Isnaad",
        "arabhadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى، - هُوَ ابْنُ سَعِيدٍ الأَنْصَارِيُّ - عَنْ عُبَادَةَ بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ عَائِشَةَ، قَالَتِ الْتَمَسْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَدْخَلْتُ يَدِي فى شَعْرِهِ فَقَالَ ‏\"‏ قَدْ جَاءَكِ شَيْطَانُكِ ‏\"‏ ‏.‏ فَقُلْتُ أَمَا لَكَ شَيْطَانٌ فَقَالَ ‏\"‏ بَلَى وَلَكِنَّ اللَّهَ أَعَانَنِي عَلَيْهِ فَأَسْلَمَ ‏\"‏ ‏.‏"
    },
    "3961": {
        "bookNumber": 36,
        "hadithNumber": 3961,
        "enghadithText": "It was narrated that 'Aishah said:\"I noticed that the Messenger of Allah was not there one night, and I thought that he had gone to one of his other wives, so I reached out for him, and found him bowing or prostrating, and saying: 'Subhanaka wa bi hamdika la ilaha illa anta (Glory and praise be to You, there is none worthy of worship but You).' I said: 'May my father and mother be sacrificed for you; you were doing one thing, and I was thinking of something else",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِقْسَمِيُّ، عَنْ حَجَّاجٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ فَقَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَظَنَنْتُ أَنَّهُ ذَهَبَ إِلَى بَعْضِ نِسَائِهِ فَتَجَسَّسْتُهُ فَإِذَا هُوَ رَاكِعٌ أَوْ سَاجِدٌ يَقُولُ ‏ \"‏ سُبْحَانَكَ وَبِحَمْدِكَ لاَ إِلَهَ إِلاَّ أَنْتَ ‏\"‏ ‏.‏ فَقُلْتُ بِأَبِي وَأُمِّي إِنَّكَ لَفِي شَأْنٍ وَإِنِّي لَفِي شَأْنٍ آخَرَ ‏.‏"
    },
    "3962": {
        "bookNumber": 36,
        "hadithNumber": 3962,
        "enghadithText": "Aishah said:\"I noticed that the Messenger of Allah was not there one night, and I thought that he had gone to one of his other wives. I looked for him then I came back, and there he was, bowing or prostrating and saying: 'Subhanaka wa bi hamdika la ilaha illa anta (Glory and praise be to You, there is none worthy of worship but You).' I said: 'May my father and mother be sacrificed for you; you were doing one thing and I was thinking of something else",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، ‏{‏ عَنْ عَطَاءٍ، ‏}‏ قَالَ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ عَائِشَةَ، قَالَتِ افْتَقَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَظَنَنْتُ أَنَّهُ ذَهَبَ إِلَى بَعْضِ نِسَائِهِ فَتَجَسَّسْتُ ثُمَّ رَجَعْتُ فَإِذَا هُوَ رَاكِعٌ أَوْ سَاجِدٌ يَقُولُ ‏ \"‏ سُبْحَانَكَ وَبِحَمْدِكَ لاَ إِلَهَ إِلاَّ أَنْتَ ‏\"‏ ‏.‏ فَقُلْتُ بِأَبِي وَأُمِّي إِنَّكَ لَفِي شَأْنٍ وَإِنِّي لَفِي آخَرَ ‏.‏"
    },
    "3963": {
        "bookNumber": 36,
        "hadithNumber": 3963,
        "enghadithText": "Aishah said:\"Shall I not tell you about the Prophet and I?\" We said: \"Yes.\" She said: \"When it was my night, he came in, placed his shoes by his feet, lay down his Rida' (upper garment), and spread his Izar (lower garment) on his bed. As soon as he thought that I had gone to sleep, he put his shoes on slowly and picked up his Rida' slowly. Then he opened the door slowly, went out and shut it slowly. I put my garment over my head, covered myself and put on my Izar (lower garment), and I set out after him until he came to Al-Baqi', raised his hands three times and stood there for a long time. Then he left and I left, he hurried and I hurried, he ran and I ran, and I got there before him and entered (the house). I had only just laid down when he came in and said: 'O 'Aishah, why are you out of breath?' (one of the reporters) Sulaiman said: I thought he (Ibn Wahb) said: 'short of breath.' He said: 'Either you tell me or the All-Aware, All-Knowing will tell me.' I said: 'O Messenger of Allah, may my father and mother be sacrificed for you;' and I told him the story. He said: 'You were the black shape I saw in front of me?' I said: 'Yes.'\" She said: \"He gave me a shove in the chest that hurt me and said: 'You thought that Allah and His Messenger would be unfair to you.' She said: 'Whatever people conceal, Allah, the Mighty and Sublime, knows it.' He said: 'Yes.' He said: 'Jibril came to me when you saw (me leave) but he did not enter upon you because you have taken off your garments. So he called me but he concealed himself from you, and I answered him but I concealed it from you. I thought that you had gone to sleep and I did not want to wake you and I was afraid that you would feel lonely. He told me to go to Al-Baqi' and pray for forgiveness for them.'\" Hajjaj bin Muhammad contradicted him (Ibn Wahb), he said: \"From Ibn Juraij, from Ibn Abi Mulaikah, from Muhammad bin Qais",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ، أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ قَيْسٍ، يَقُولُ سَمِعْتُ عَائِشَةَ، تَقُولُ أَلاَ أُحَدِّثُكُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم وَعَنِّي قُلْنَا بَلَى ‏.‏ قَالَتْ لَمَّا كَانَتْ لَيْلَتِي انْقَلَبَ فَوَضَعَ نَعْلَيْهِ عِنْدَ رِجْلَيْهِ وَوَضَعَ رِدَاءَهُ وَبَسَطَ إِزَارَهُ عَلَى فِرَاشِهِ وَلَمْ يَلْبَثْ إِلاَّ رَيْثَمَا ظَنَّ أَنِّي قَدْ رَقَدْتُ ثُمَّ انْتَعَلَ رُوَيْدًا وَأَخَذَ رِدَاءَهُ رُوَيْدًا ثُمَّ فَتَحَ الْبَابَ رُوَيْدًا وَخَرَجَ وَأَجَافَهُ رُوَيْدًا وَجَعَلْتُ دِرْعِي فِي رَأْسِي فَاخْتَمَرْتُ وَتَقَنَّعْتُ إِزَارِي وَانْطَلَقْتُ فِي إِثْرِهِ حَتَّى جَاءَ الْبَقِيعَ فَرَفَعَ يَدَيْهِ ثَلاَثَ مَرَّاتٍ وَأَطَالَ الْقِيَامَ ثُمَّ انْحَرَفَ وَانْحَرَفْتُ فَأَسْرَعَ فَأَسْرَعْتُ فَهَرْوَلَ فَهَرْوَلْتُ فَأَحْضَرَ فَأَحْضَرْتُ وَسَبَقْتُهُ فَدَخَلْتُ وَلَيْسَ إِلاَّ أَنِ اضْطَجَعْتُ فَدَخَلَ فَقَالَ ‏\"‏ مَا لَكِ يَا عَائِشُ رَابِيَةً ‏\"‏ ‏.‏ قَالَ سُلَيْمَانُ حَسِبْتُهُ قَالَ حَشْيَا قَالَ ‏\"‏ لَتُخْبِرِنِّي أَوْ لَيُخْبِرَنِّي اللَّطِيفُ الْخَبِيرُ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي فَأَخْبَرْتُهُ الْخَبَرَ قَالَ ‏\"‏ أَنْتِ السَّوَادُ الَّذِي رَأَيْتُ أَمَامِي ‏\"‏ ‏.‏ قُلْتُ نَعَمْ - قَالَتْ - فَلَهَدَنِي لَهْدَةً فِي صَدْرِي أَوْجَعَتْنِي ‏.‏ قَالَ ‏\"‏ أَظَنَنْتِ أَنْ يَحِيفَ اللَّهُ عَلَيْكِ وَرَسُولُهُ ‏\"‏ ‏.‏ قَالَتْ مَهْمَا يَكْتُمِ النَّاسُ فَقَدْ عَلِمَهُ اللَّهُ عَزَّ وَجَلَّ ‏.‏ قَالَ ‏\"‏ نَعَمْ - قَالَ - فَإِنَّ جِبْرِيلَ عَلَيْهِ السَّلاَمُ أَتَانِي حِينَ رَأَيْتِ وَلَمْ يَكُنْ يَدْخُلُ عَلَيْكِ وَقَدْ وَضَعْتِ ثِيَابَكِ فَنَادَانِي فَأَخْفَى مِنْكِ فَأَجَبْتُهُ وَأَخْفَيْتُهُ مِنْكِ وَظَنَنْتُ أَنَّكِ قَدْ رَقَدْتِ فَكَرِهْتُ أَنْ أُوقِظَكِ وَخَشِيتُ أَنْ تَسْتَوْحِشِي فَأَمَرَنِي أَنْ آتِيَ أَهْلَ الْبَقِيعِ فَأَسْتَغْفِرَ لَهُمْ ‏\"‏ ‏.‏ خَالَفَهُ حَجَّاجُ بْنُ مُحَمَّدٍ فَقَالَ عَنِ ابْنِ جُرَيْجٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ مُحَمَّدِ بْنِ قَيْسٍ ‏.‏"
    },
    "3964": {
        "bookNumber": 36,
        "hadithNumber": 3964,
        "enghadithText": "Aishah said:\"Shall I not tell you about the Prophet and I?\" We said: \"Yes.\" She said: \"When it was my night when he\" -meaning the Prophet- \"was with me, he came in, placed his shoes by his feet, lay down his Rida' (upper garment), and spread the edge of his Izar (lower garment) on his bed. As soon as he thought that I had gone to sleep, he put his shoes on slowly, and picked up his Rida' slowly. Then he opened the door slowly, went out and shut it slowly. I put my garment over my head, covered myself and put on my Izar (lower garment), and I set out after him until he came to Al-Baqi', raised his hands three times and stood there for a long time. Then he left and I left, he hurried and I hurried, he ran and I ran, and I got there before him and entered (the house). I had only just laid down when he came in and said: 'O 'Aishah, why are you out of breath?' She said: 'No.' He said: 'Either you tell me or Allah, the All-Aware, All-Knowing, will tell me.' I said: 'O Messenger of Allah, may my father and mother be sacrificed for you;' and I told him the story. He said: 'You were the black shape I saw in front of me?' I said: 'Yes.'\" She said: \"He gave me a shove in the chest that hurt me and said: 'You thought that Allah and His Messenger would be unfair to you.' She said: 'Whatever people conceal, Allah knows it.' He said: 'Yes.' He said: 'Jibril came to me when you saw (me leave) but he did not enter upon you because you have taken off your garments. So he called me but he concealed himself from you, and I answered him, but I concealed it from you. I thought that you had gone to sleep and I did not want to wake you, and I was afraid that you would feel lonely. He told me to go to Al-Baqi' and pray for forgiveness for them.'\" 'Asim reported it from 'Abdullah bin 'Amir, from 'Aishah, with a wording different from this",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا يُوسُفُ بْنُ سَعِيدِ بْنِ مُسْلَّمٍ الْمِصِّيصِيُّ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ قَيْسِ بْنِ مَخْرَمَةَ، يَقُولُ سَمِعْتُ عَائِشَةَ، تُحَدِّثُ قَالَتْ أَلاَ أُحَدِّثُكُمْ عَنِّي وَعَنِ النَّبِيِّ صلى الله عليه وسلم قُلْنَا بَلَى ‏.‏ قَالَتْ لَمَّا كَانَتْ لَيْلَتِي الَّتِي هُوَ عِنْدِي تَعْنِي النَّبِيَّ صلى الله عليه وسلم انْقَلَبَ فَوَضَعَ نَعْلَيْهِ عِنْدَ رِجْلَيْهِ وَوَضَعَ رِدَاءَهُ وَبَسَطَ طَرَفَ إِزَارِهِ عَلَى فِرَاشِهِ فَلَمْ يَلْبَثْ إِلاَّ رَيْثَمَا ظَنَّ أَنِّي قَدْ رَقَدْتُ ثُمَّ انْتَعَلَ رُوَيْدًا وَأَخَذَ رِدَاءَهُ رُوَيْدًا ثُمَّ فَتَحَ الْبَابَ رُوَيْدًا وَخَرَجَ وَأَجَافَهُ رُوَيْدًا وَجَعَلْتُ دِرْعِي فِي رَأْسِي وَاخْتَمَرْتُ وَتَقَنَّعْتُ إِزَارِي فَانْطَلَقْتُ فِي إِثْرِهِ حَتَّى جَاءَ الْبَقِيعَ فَرَفَعَ يَدَيْهِ ثَلاَثَ مَرَّاتٍ وَأَطَالَ الْقِيَامَ ثُمَّ انْحَرَفَ فَانْحَرَفْتُ فَأَسْرَعَ فَأَسْرَعْتُ فَهَرْوَلَ فَهَرْوَلْتُ فَأَحْضَرَ فَأَحْضَرْتُ وَسَبَقْتُهُ فَدَخَلْتُ فَلَيْسَ إِلاَّ أَنِ اضْطَجَعْتُ فَدَخَلَ فَقَالَ ‏\"‏ مَا لَكِ يَا عَائِشَةُ حَشْيَا رَابِيَةً ‏\"‏ ‏.‏ قَالَتْ لاَ ‏.‏ قَالَ ‏\"‏ لَتُخْبِرِنِّي أَوْ لَيُخْبِرَنِّي اللَّطِيفُ الْخَبِيرُ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي فَأَخْبَرْتُهُ الْخَبَرَ ‏.‏ قَالَ ‏\"‏ فَأَنْتِ السَّوَادُ الَّذِي رَأَيْتُهُ أَمَامِي ‏\"‏ ‏.‏ قَالَتْ نَعَمْ - قَالَتْ - فَلَهَدَنِي فِي صَدْرِي لَهْدَةً أَوْجَعَتْنِي ثُمَّ قَالَ ‏\"‏ أَظَنَنْتِ أَنْ يَحِيفَ اللَّهُ عَلَيْكِ وَرَسُولُهُ ‏\"‏ ‏.‏ قَالَتْ مَهْمَا يَكْتُمِ النَّاسُ فَقَدْ عَلِمَهُ اللَّهُ ‏.‏ قَالَ ‏\"‏ نَعَمْ - قَالَ - فَإِنَّ جِبْرِيلَ عَلَيْهِ السَّلاَمُ أَتَانِي حِينَ رَأَيْتِ وَلَمْ يَكُنْ يَدْخُلُ عَلَيْكِ وَقَدْ وَضَعْتِ ثِيَابَكِ فَنَادَانِي فَأَخْفَى مِنْكِ فَأَجَبْتُهُ فَأَخْفَيْتُ مِنْكِ فَظَنَنْتُ أَنْ قَدْ رَقَدْتِ وَخَشِيتُ أَنْ تَسْتَوْحِشِي فَأَمَرَنِي أَنْ آتِيَ أَهْلَ الْبَقِيعِ فَأَسْتَغْفِرَ لَهُمْ ‏\"‏ ‏.‏ رَوَاهُ عَاصِمٌ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ عَنْ عَائِشَةَ عَلَى غَيْرِ هَذَا اللَّفْظِ ‏.‏"
    },
    "3965": {
        "bookNumber": 36,
        "hadithNumber": 3965,
        "enghadithText": "It was narrated that 'Aishah said:\"I noticed that he was not there one night\" and he quoted the rest of the Hadith",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا شَرِيكٌ، عَنْ عَاصِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ عَائِشَةَ، قَالَتْ فَقَدْتُهُ مِنَ اللَّيْلِ وَسَاقَ الْحَدِيثَ ‏.‏"
    }
}