{
    "4212": {
        "bookNumber": 40,
        "hadithNumber": 4212,
        "enghadithText": "It was narrated from 'Amr bin Shuaib, from his fahther, that his grandfather said:\"The messenger of Allah was asked about the 'Aqiqah and he said: \"Allah, the mighty and sublime, does not like Al-Uquq' as if he disliked the word (Al-Aqiqah). He said to the Messenger of Allah: 'But one of us may offer a sacrifice when a child is born to him.' He said: 'Whoever wants to offer a sacrifice for his child, let him do so, for a boy; two sheep, Mukafaatan, (of equal age), and for a girl, one.' (One of the narrators) Dawud said: 'I asked Ziad bin Aslam about the word Mukafaatan and he said: 'Two similar sheep that are slaughtered together",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Hasan Sahih",
        "arabhadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْعَقِيقَةِ فَقَالَ ‏\"‏ لاَ يُحِبُّ اللَّهُ عَزَّ وَجَلَّ الْعُقُوقَ ‏\"‏ ‏.‏ وَكَأَنَّهُ كَرِهَ الاِسْمَ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّمَا نَسْأَلُكَ أَحَدُنَا يُولَدُ لَهُ ‏.‏ قَالَ ‏\"‏ مَنْ أَحَبَّ أَنْ يَنْسُكَ عَنْ وَلَدِهِ فَلْيَنْسُكْ عَنْهُ عَنِ الْغُلاَمِ شَاتَانِ مُكَافَأَتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ ‏\"‏ ‏.‏ قَالَ دَاوُدُ سَأَلْتُ زَيْدَ بْنَ أَسْلَمَ عَنِ الْمُكَافَأَتَانِ قَالَ الشَّاتَانِ الْمُشَبَّهَتَانِ تُذْبَحَانِ جَمِيعًا ‏.‏"
    },
    "4213": {
        "bookNumber": 40,
        "hadithNumber": 4213,
        "enghadithText": "It was narrated from 'Abdullah bin Buraidah, from his father, that:the Messenger of Allah offered the 'Aqiqah for Al-Hasan and Al-Husain",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ، عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَقَّ عَنِ الْحَسَنِ وَالْحُسَيْنِ ‏.‏"
    },
    "4214": {
        "bookNumber": 40,
        "hadithNumber": 4214,
        "enghadithText": "It was narrated from Salman bin 'Amir Ad-Dabbi that the Messenger of Allah said:\"For a boy there shoud be an 'Aqiqah, so shed blood for him, and remove the harm from him",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا أَيُّوبُ، وَحَبِيبٌ، وَيُونُسُ، وَقَتَادَةُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فِي الْغُلاَمِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الأَذَى ‏\"‏ ‏.‏"
    },
    "4215": {
        "bookNumber": 40,
        "hadithNumber": 4215,
        "enghadithText": "it was narrated from Um Kurz that the Messenger of Allah said:\"for a boy two sheep, Mukafaatan (of equal age), and for a girl, one sheep",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ قَيْسِ بْنِ سَعْدٍ، عَنْ عَطَاءٍ، وَطَاوُسٍ، وَمُجَاهِدٍ، عَنْ أُمِّ كُرْزٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ فِي الْغُلاَمِ شَاتَانِ مُكَافَأَتَانِ وَفِي الْجَارِيَةِ شَاةٌ ‏\"‏ ‏.‏"
    },
    "4216": {
        "bookNumber": 40,
        "hadithNumber": 4216,
        "enghadithText": "It was narrated from Umm Kurz that the Messenger of Allah said:\"For a boy two sheep, Mukafaatan (of equal age), and for a girl, one sheep",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ عَمْرٌو عَنْ عَطَاءٍ، عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ، عَنْ أُمِّ كُرْزٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ عَنِ الْغُلاَمِ شَاتَانِ مُكَافَأَتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ ‏\"‏ ‏.‏"
    },
    "4217": {
        "bookNumber": 40,
        "hadithNumber": 4217,
        "enghadithText": "It was narrated that umm Kurz said:\"I came to the Prophet and asked him about the sacrificial meat. I heard him say: 'For a boy, two sheep, and for a girl, one sheep, and it does not matter if they are male or female",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ، - وَهُوَ ابْنُ أَبِي يَزِيدَ - عَنْ سِبَاعِ بْنِ ثَابِتٍ، عَنْ أُمِّ كُرْزٍ، قَالَتْ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم بِالْحُدَيْبِيَةِ أَسْأَلُهُ عَنْ لُحُومِ الْهَدْىِ فَسَمِعْتُهُ يَقُولُ ‏ \"‏ عَلَى الْغُلاَمِ شَاتَانِ وَعَلَى الْجَارِيَةِ شَاةٌ لاَ يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا ‏\"‏ ‏.‏"
    },
    "4218": {
        "bookNumber": 40,
        "hadithNumber": 4218,
        "enghadithText": "It was narrated from Umma Kurz that the Messenger of Allah said:\"For a boy, two sheep, and or a girl, one sheep, and it does not matter if they are male or female",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ، عَنْ سِبَاعِ بْنِ ثَابِتٍ، عَنْ أُمِّ كُرْزٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ عَنِ الْغُلاَمِ شَاتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ لاَ يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا ‏\"‏ ‏.‏"
    },
    "4219": {
        "bookNumber": 40,
        "hadithNumber": 4219,
        "enghadithText": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah offered an 'Aqiqah for Al-Hasan and Al-Husain, may Allah be please with them, two rams for each",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، - هُوَ ابْنُ طَهْمَانَ - عَنِ الْحَجَّاجِ بْنِ الْحَجَّاجِ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ عَقَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحَسَنِ وَالْحُسَيْنِ رضى الله عنهما بِكَبْشَيْنِ كَبْشَيْنِ ‏.‏"
    },
    "4220": {
        "bookNumber": 40,
        "hadithNumber": 4220,
        "enghadithText": "It was narrated from Qatadah, from Al-Hasan, from Samurh bin Jundab that the Messenger of Allah said:\"Every boy is in pledge for his 'Aqiqah, so slaughter (the animal) for him on the seventh day, and shave his head, and a name",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - عَنْ سَعِيدٍ، أَنْبَأَنَا قَتَادَةُ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كُلُّ غُلاَمٍ رَهِينٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ وَيُحْلَقُ رَأْسُهُ وَيُسَمَّى ‏\"‏ ‏.‏"
    },
    "4221": {
        "bookNumber": 40,
        "hadithNumber": 4221,
        "enghadithText": "It was narrated from Habib bin Ash-Shahid:\"Muhammad bin Sirin said to me: 'Ask Al-Hasan (Al-Basri) from whom he heard this Hadith about the 'Aqiqah.' I asked him about that and he said: 'I heard it from Samurh",
        "gradeName": "Abu Ghuddah",
        "gradeValue": "Sahih",
        "arabhadithText": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، قَالَ لِي مُحَمَّدُ بْنُ سِيرِينَ سَلِ الْحَسَنَ مِمَّنْ سَمِعَ حَدِيثَهُ، فِي الْعَقِيقَةِ ‏.‏ فَسَأَلْتُهُ عَنْ ذَلِكَ، فَقَالَ سَمِعْتُهُ مِنْ، سَمُرَةَ ‏.‏"
    }
}