[
  {
    "SurahNumber": "114",
    "AyahNumber": "1",
    "NoteID": "6307",
    "Body": "The previous Sura pointed to the necessity of seeking\\n\\t\\t\\t\\tAllah's protection against external factors which might\\n\\t\\t\\t\\taffect an individual. Here the need of protection from\\n\\t\\t\\t\\tinternal factors, mankind being viewed as a whole, is\\n\\t\\t\\t\\tpointed out. For this reason the threefold relation in\\n\\t\\t\\t\\twhich man stands to Allah is mentioned, as explained in\\n\\t\\t\\t\\tthe next note."
  },
  {
    "SurahNumber": "114",
    "AyahNumber": "1",
    "NoteID": "6308",
    "Body": "Man's relation to Allah may be viewed in three aspects:\\n\\t\\t\\t\\t(1) Allah is his Lord, Maker, and Cherisher; Allah\\n\\t\\t\\t\\tsustains him and cares for him; He provides him with all\\n\\t\\t\\t\\tthe means for his growth and development, and for his\\n\\t\\t\\t\\tprotection against evil; (2) Allah is his king or ruler;\\n\\t\\t\\t\\tmore than any earthly king, Allah has authority to guide\\n\\t\\t\\t\\tman's conduct, and lead him to ways which will make for\\n\\t\\t\\t\\this welfare; and He has given him laws; and (3) Allah is\\n\\t\\t\\t\\tHe to Whom mankind must return, to give an account of all\\n\\t\\t\\t\\ttheir deeds in this life (ii. 156); Allah will be the\\n\\t\\t\\t\\tJudge; He is the goal of the Hereafter, and the only\\n\\t\\t\\t\\tBeing entitied to man's worship at any time. From all\\n\\t\\t\\t\\tthese aspects man could and should seek Allah's\\n\\t\\t\\t\\tprotection against evil."
  },
  {
    "SurahNumber": "114",
    "AyahNumber": "4",
    "NoteID": "6309",
    "Body": "Evil insinuates itself in all sorts of insidious ways\\n\\t\\t\\t\\tfrom within so as to sap man's will, which was given to\\n\\t\\t\\t\\tman by Allah. This power of evil may be Satan, or evil\\n\\t\\t\\t\\tmen or the evil inclinations within man's own will: for\\n\\t\\t\\t\\tthere are \"evil ones among men and Jinns, inspiring each\\n\\t\\t\\t\\tother with flowery discourses by way of deception\" (vi.\\n\\t\\t\\t\\t112). They secretly whisper evil and then withdraw, to\\n\\t\\t\\t\\tmake their net the more subtle and alluring."
  },
  {
    "SurahNumber": "114",
    "AyahNumber": "6",
    "NoteID": "6310",
    "Body": "This last clause amplifies the description of the sources\\n\\t\\t\\t\\tfrom which the whisper of evil may emanate: they may be\\n\\t\\t\\t\\tmen whom you may see or invisible spirits of evil working\\n\\t\\t\\t\\twithin. See last note. So long as we put ourselves in\\n\\t\\t\\t\\tAllah's protection, and trust in Allah, evil cannot\\n\\t\\t\\t\\treally touch us in our essential and inner life."
  }
]
