[
  {
    "SurahNumber": "17",
    "AyahNumber": "1",
    "Text": "Glory be to Him Who took His devotee (Muhammad) one night from\\n\\t\\t\\tMasjid-al-Haram (in Makkah) to Masjid-al-Aqsa (in Jerusalem),\\n\\t\\t\\twhose vicinity We have blessed, so that We may show him some of\\n\\t\\t\\tOur signs: surely He is the One Who is the Hearer, the Observer."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "2",
    "Text": "We gave Musa (Moses) the Book and made it a guide for the\\n\\t\\t\\tChildren of Israel, saying: \"Do not take any other protector\\n\\t\\t\\tbesides Me."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "3",
    "Text": "You are the descendents of those whom We carried in the Ark with\\n\\t\\t\\tNuh, and he was indeed a grateful devotee.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "4",
    "Text": "Besides this We forewarned the Children of Israel in their Holy\\n\\t\\t\\tBook that you will do mischief in the land twice through becoming\\n\\t\\t\\tarrogant transgressors and each time you will be punished."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "5",
    "Text": "When the promise for the first of the two fore warnings came to\\n\\t\\t\\tbe fulfilled, We sent against you Our servants (the Assyrians)\\n\\t\\t\\twho gave you a terrible warfare: so they rampaged through your\\n\\t\\t\\thomes to carry out the punishment of which you were forewarned."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "6",
    "Text": "Then after this, We afforded you an opportunity to overpower them\\n\\t\\t\\tand helped you with wealth and sons and granted you more\\n\\t\\t\\tmanpower."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "7",
    "Text": "If you did good, it was to your own benefit; but if you did evil,\\n\\t\\t\\tit proved to be bad for your own selves. Then, when the promise\\n\\t\\t\\tfor your second forewarning came to be fulfilled, We sent another\\n\\t\\t\\tarmy (the Romans) to disfigure your faces and to enter your\\n\\t\\t\\tTemple as the former entered it before, and they utterly\\n\\t\\t\\tdestroyed all that they laid their hands on."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "8",
    "Text": "Now your Rabb may again be merciful to you; but if you repeat the\\n\\t\\t\\tsame behavior, We will repeat the punishment, and in the\\n\\t\\t\\thereafter, We have made hell a prison for such unbelievers."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "9",
    "Text": "Surely this Qur'an guides to the Way which is perfectly straight\\n\\t\\t\\tand gives the good news to the believers who do good that they\\n\\t\\t\\tshall have a magnificent reward;"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "10",
    "Text": "and at the same time it gives warnings to those who do not\\n\\t\\t\\tbelieve in the hereafter, that We have prepared for them a\\n\\t\\t\\tpainful punishment."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "11",
    "Text": "Yet man prays for evil as fervently as he ought to pray for good,\\n\\t\\t\\tand mankind is ever hasty."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "12",
    "Text": "We have made the night and the day as two signs. We enshrouded\\n\\t\\t\\tthe night with darkness and gave light to the day, to enable you\\n\\t\\t\\tto seek the bounty of your Rabb, and that you may compute the\\n\\t\\t\\tyears and count the numbers. Thus, We have set forth all things\\n\\t\\t\\tin detail."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "13",
    "Text": "We have fastened the fate of every man to his own neck, and on\\n\\t\\t\\tthe Day of Judgment We shall bring out for him a book spread wide\\n\\t\\t\\topen,"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "14",
    "Text": "saying: \"Here is your book of deeds: read it. Today you yourself\\n\\t\\t\\tare sufficient to take your own account.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "15",
    "Text": "He that seeks guidance, shall be guided to his own advantage, but\\n\\t\\t\\the that goes astray does so to his own loss. No bearer shall bear\\n\\t\\t\\tthe burden of another on the Day of Judgement. And during your\\n\\t\\t\\tworldly life, We do not inflict punishment until We send forth a\\n\\t\\t\\tRasool to make truth distinct from falsehood."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "16",
    "Text": "Whenever We have intended to destroy a town, it was because We\\n\\t\\t\\tsent Our commandments to its people who were leading easy lives\\n\\t\\t\\tbut they showed disobedience; as a result Our judgement was\\n\\t\\t\\tpassed, and We razed that city to the ground."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "17",
    "Text": "How many generations have We destroyed since Nuh's time?\\n\\t\\t\\tSufficient is your Rabb to note and see the sins of His servants."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "18",
    "Text": "He that desires the transitory things of this life, We readily\\n\\t\\t\\tgrant him such things as We please to whomsoever We want, then We\\n\\t\\t\\tcondemn him to hell, where he will burn, disgraced and rejected."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "19",
    "Text": "He that desires the life of the hereafter and strives for it as\\n\\t\\t\\tbest as he can provided he is a Believer, the endeavor of every\\n\\t\\t\\tsuch person will be accepted."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "20",
    "Text": "We bestowed on all - these as well those - out of the bounties of\\n\\t\\t\\tyour Rabb; the bounties of your Rabb are not confined."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "21",
    "Text": "See how We have exalted some over others, and certainly the\\n\\t\\t\\thereafter is more exalted and greater in excellence."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "22",
    "Text": "Do not associate another deity with Allah, lest you sit back,\\n\\t\\t\\tcondemned, forsaken."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "23",
    "Text": "Your Rabb has decreed to you that: You shall worship none but\\n\\t\\t\\tHim, and you shall be kind to your parents; if one or both of\\n\\t\\t\\tthem live to their old age in your lifetime, you shall not say to\\n\\t\\t\\tthem any word of contempt nor repel them and you shall address\\n\\t\\t\\tthem in kind words."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "24",
    "Text": "You shall lower to them your wings of humility and pray: \"O Rabb!\\n\\t\\t\\tBestow on them Your blessings just as they cherished me when I\\n\\t\\t\\twas a little child.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "25",
    "Text": "Your Rabb knows best what is in your hearts. If you do good\\n\\t\\t\\tdeeds, certainly He is most forgiving to those who turn to Him in\\n\\t\\t\\trepentance."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "26",
    "Text": "You shall give to your relatives their due and to the needy and\\n\\t\\t\\tto the wayfarers. You shall not be a spendthrift"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "27",
    "Text": "- as spendthrifts are the brethren of shaitan and shaitan is ever\\n\\t\\t\\tungrateful to His Rabb."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "28",
    "Text": "You shall speak courteously to needy persons if you are waiting\\n\\t\\t\\tfor your Rabb's bounty and you lack the means to assist them."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "29",
    "Text": "You shall neither tie your hands to your neck (be miserly) nor\\n\\t\\t\\tstretch them forth to their utmost reach (be prodigal), lest you\\n\\t\\t\\tsit back, blameworthy, destitute."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "30",
    "Text": "Surely your Rabb gives abundantly to whom He pleases and\\n\\t\\t\\tsparingly to whom He wills, for He is aware of the condition of\\n\\t\\t\\tHis servants and observes them closely."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "31",
    "Text": "You shall not kill your children for fear of want, for it is We\\n\\t\\t\\tWho provide sustenance for them as well as for you; surely\\n\\t\\t\\tkilling them is a great blunder."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "32",
    "Text": "You shall not commit adultery; surely it is a shameful deed and\\n\\t\\t\\tan evil way (opening the door to other evils)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "33",
    "Text": "You shall not kill anyone whom Allah has forbidden, except for\\n\\t\\t\\tjust cause under the law. If anyone is killed unjustly, We have\\n\\t\\t\\tgranted the right of retribution to his heir, but let him not\\n\\t\\t\\tcarry his vengeance too far in killing the culprit through taking\\n\\t\\t\\tthe law in his own hands, as he is supported by the law."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "34",
    "Text": "You shall not go near the property of an orphan, except with the\\n\\t\\t\\tgood intention of improving it, until he attains his maturity.\\n\\t\\t\\tYou shall fulfill your pledges; surely you shall be held\\n\\t\\t\\taccountable for your pledges."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "35",
    "Text": "You shall give full measure, when you measure, and weigh with\\n\\t\\t\\teven scale; this is the best way and will prove to be the best in\\n\\t\\t\\tthe end."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "36",
    "Text": "You shall not follow anyone blindly in those matters of which you\\n\\t\\t\\thave no knowledge, surely the use of your ears and the eyes and\\n\\t\\t\\tthe heart - all of these, shall be questioned on the Day of\\n\\t\\t\\tJudgement."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "37",
    "Text": "You shall not walk arrogantly on the earth, for you can neither\\n\\t\\t\\trend the earth asunder nor attain the height of the mountains."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "38",
    "Text": "All these and their evil aspects are hateful in the sight of your\\n\\t\\t\\tRabb."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "39",
    "Text": "This is but a part of the wisdom which your Rabb has revealed to\\n\\t\\t\\tyou. Do not associate other deities as object of worship, lest\\n\\t\\t\\tyou should be cast into hell, blameworthy rejected."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "40",
    "Text": "What! Has your Rabb preferred to give you sons and adopted angels\\n\\t\\t\\tas daughters for Himself? Certainly you are uttering a monstrous\\n\\t\\t\\tstatement."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "41",
    "Text": "We have explained things in various ways in this Qur'an so that\\n\\t\\t\\tthey may receive admonition, yet it has only added to their\\n\\t\\t\\taversion."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "42",
    "Text": "Tell them: If there were other gods besides Him as the mushrikin\\n\\t\\t\\tsay, they would have certainly tried to find a way to dethrone\\n\\t\\t\\tthe Master of the Throne."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "43",
    "Text": "Glory be to Him! He is far above the things that they say about\\n\\t\\t\\tHim."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "44",
    "Text": "The seven heavens, the earth and all beings therein declare His\\n\\t\\t\\tglory. There is not a single thing but glorifies Him with His\\n\\t\\t\\tpraise, but you do not understand their hymns of His glory. The\\n\\t\\t\\tfact is that He is very Forbearing, Forgiving."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "45",
    "Text": "When you recite the Qur'an, We put a hidden barrier between you\\n\\t\\t\\tand those who do not believe in the hereafter."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "46",
    "Text": "We cast a veil upon their hearts and make them hard of hearing,\\n\\t\\t\\tso they do not comprehend it. When in the Qur'an you mention His\\n\\t\\t\\tOneness, they turn their backs in disgust."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "47",
    "Text": "We are quite aware what they really wish to hear when they listen\\n\\t\\t\\tto you, and what they say when they converse in private. These\\n\\t\\t\\twrongdoers say to one another: \"The man you follow is surely\\n\\t\\t\\tbewitched\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "48",
    "Text": "See what sort of examples they make up about you! They have\\n\\t\\t\\tsurely gone astray and cannot find the Right Way."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "49",
    "Text": "They say: \"What! When we are reduced to bones and dust, shall we\\n\\t\\t\\treally be raised up again into a new creation?\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "50",
    "Text": "Tell them: \"(Yes, most certainly you shall be brought back to\\n\\t\\t\\tlife), even if you be stones or iron"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "51",
    "Text": "or even something harder than this that you may think of.\" Then\\n\\t\\t\\tthey will ask: \"Who will restore us?\" Say: \"The One Who created\\n\\t\\t\\tyou the first time.\" Then they will shake their heads at you and\\n\\t\\t\\task: \"Well, when will this be?\" Say, \"It may be quite soon!"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "52",
    "Text": "It will be on the Day when He will call you and you will raise up\\n\\t\\t\\tin response to it, with His praise, and you will think that you\\n\\t\\t\\tremained in the state of death but a little while.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "53",
    "Text": "Tell My servants that they should speak only what is the best.\\n\\t\\t\\tSurely shaitan stirs up trouble among them. The fact is that\\n\\t\\t\\tshaitan is an open enemy to mankind."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "54",
    "Text": "Your Rabb is fully aware of your circumstances. He may be\\n\\t\\t\\tmerciful to you if He wants, or He may punish you if He pleases.\\n\\t\\t\\tO Prophet, We have not sent you to be their guardian."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "55",
    "Text": "Your Rabb is fully aware of all that is in the heavens and in the\\n\\t\\t\\tearth. We have exalted some prophets above the others and gave\\n\\t\\t\\tZaboor (the Psalms) to Dawood."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "56",
    "Text": "Say: \"Pray if you will to those whom you assert besides Him; they\\n\\t\\t\\thave neither the power to relieve you from any distress nor to\\n\\t\\t\\tchange it.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "57",
    "Text": "Those to whom they pray, themselves seek the means of access to\\n\\t\\t\\ttheir Rabb - trying as to who can be more near - they hope for\\n\\t\\t\\tHis Mercy and fear His punishment, for the punishment of your\\n\\t\\t\\tRabb is terrible indeed."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "58",
    "Text": "There is not a town but We shall destroy it before the Day of\\n\\t\\t\\tResurrection or punish it with a severe punishment; this fact has\\n\\t\\t\\tbeen recorded in the Eternal Record."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "59",
    "Text": "We refrain from sending signs (miracles) only because the men of\\n\\t\\t\\tformer generations treated them as false. For example, We sent\\n\\t\\t\\tthe she-camel to the people of Thamud - a manifest sign - but\\n\\t\\t\\tthey laid violent hands on her. We send the signs only by way of\\n\\t\\t\\twarning, and if people reject the sign after receiving it, they\\n\\t\\t\\tare doomed."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "60",
    "Text": "Remember, O Muhammad! We told you that your Rabb encompasses\\n\\t\\t\\tmankind. We have made the Vision which We showed you, and the\\n\\t\\t\\tcursed tree of Zaqqum which is mentioned in the Qur'an, a test\\n\\t\\t\\tfor these people of Makkah. We are giving them warning to be\\n\\t\\t\\tfearful but it only increases their inordinate transgression."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "61",
    "Text": "Recall the occasion when We said to the angels: \"Prostrate\\n\\t\\t\\tyourselves before Adam.\" They all prostrated except Iblees\\n\\t\\t\\t(Shaitan), who replied: \"Should I prostrate to the one whom You\\n\\t\\t\\thave created from clay?\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "62",
    "Text": "Then he asked: \"Tell me, is this the one whom You have honored\\n\\t\\t\\tabove me? If You give me respite till the Day of Resurrection, I\\n\\t\\t\\twill certainly uproot all but a few of his descendants.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "63",
    "Text": "Allah said: \"Go away! Hell is your reward, and the reward of\\n\\t\\t\\tthose who follow you, an ample reward it shall be."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "64",
    "Text": "You may try to allure whomsoever you can with your seductive\\n\\t\\t\\tvoice, muster against them all your cavalry and infantry, be\\n\\t\\t\\ttheir partner in their riches and their children, and promise\\n\\t\\t\\tthem what you will - the promises of shaitan are nothing but\\n\\t\\t\\tdeception"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "65",
    "Text": "- as for My servants, you shall have no authority over them. Your\\n\\t\\t\\tRabb is sufficient as their Guardian.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "66",
    "Text": "Your Rabb is the One Who drives your ships across the ocean, so\\n\\t\\t\\tthat you may seek His bounty; indeed He is ever Merciful to you."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "67",
    "Text": "Whenever any adversity strikes you at sea, all those to whom you\\n\\t\\t\\tpray besides Him forsake you except He; yet when He brings you\\n\\t\\t\\tsafe to the land, you turn your backs upon Him. Indeed, man is\\n\\t\\t\\tever ungrateful."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "68",
    "Text": "Are you confident that He will not cave in the land beneath you,\\n\\t\\t\\tor let loose a deadly tornado upon you? Then you may not find\\n\\t\\t\\tanyone to protect you."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "69",
    "Text": "Or, are you confident that when again you go back to sea He will\\n\\t\\t\\tnot smite you with a violent tempest and drown you for your\\n\\t\\t\\tthanklessness? If that happens, then you will not find anyone who\\n\\t\\t\\tcan question Us regarding this end of yours."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "70",
    "Text": "It is Our favor that We have honored the children of Adam,\\n\\t\\t\\tblessed them with conveyances on land and sea, provided them with\\n\\t\\t\\tgood and pure things and exalted them above many of Our\\n\\t\\t\\tcreatures."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "71",
    "Text": "Just imagine the scene of that Day when We shall call every\\n\\t\\t\\tcommunity with their respective Imams (leaders): then those who\\n\\t\\t\\twill be given their 'book of deeds' in their right hand will read\\n\\t\\t\\tit with pleasure and they will not be wronged in the least."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "72",
    "Text": "But those who have played blind in this world will be blind in\\n\\t\\t\\tthe hereafter, rather worse than blind in finding the Way to\\n\\t\\t\\tSalvation."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "73",
    "Text": "O Muhammad! These people have tried to entice you from Our\\n\\t\\t\\trevelations, hoping that you might fabricate something in Our\\n\\t\\t\\tname. Had you done that, they would have made you their friend."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "74",
    "Text": "Had We not strengthened your faith, you might have made some\\n\\t\\t\\tcompromise with them."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "75",
    "Text": "In such a case We would have given you double punishment in this\\n\\t\\t\\tlife and in the life hereafter. Then you would have found no\\n\\t\\t\\thelper against Our wrath."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "76",
    "Text": "They almost scare you off the land, to expel you from it. If they\\n\\t\\t\\tdo so, they will not be able to stay here much longer after you."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "77",
    "Text": "This has always been Our Sunnah (course of action) with regards\\n\\t\\t\\tto those Rasools whom We sent before you, and you will find no\\n\\t\\t\\tchange in Our Sunnah (course of action)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "78",
    "Text": "Establish Salah from the decline of the sun till the darkness of\\n\\t\\t\\tthe night (Zuhr, Asr, Maghrib and Isha) and read at Fajr (dawn);\\n\\t\\t\\tfor the reading at Fajr is witnessed (by the angels)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "79",
    "Text": "During a part of the night, pray Tahajjud, an additional prayer\\n\\t\\t\\tfor you (O Muhammad), very soon your Rabb may exalt you to\\n\\t\\t\\t'Maqam-e-Mahmood' (a station of great glory)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "80",
    "Text": "During the prayer say: \"Rabb! Make my entrance, the entrance with\\n\\t\\t\\ttruth and make my exit, the exit with truth and grant me a\\n\\t\\t\\tsupporting authority from your presence;\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "81",
    "Text": "and declare, \"The Truth has come and falsehood has vanished, for\\n\\t\\t\\tfalsehood by its nature is bound to perish.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "82",
    "Text": "We have revealed the Qur'an which is a healing and a mercy to the\\n\\t\\t\\tbelievers, while to the wrongdoers it adds nothing but loss."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "83",
    "Text": "Man is a strange creature: when We bestow Our favors on man, he\\n\\t\\t\\tturns his back and drifts off to one side (instead of coming to\\n\\t\\t\\tUs) and whenever evil touches him, he gives himself up to\\n\\t\\t\\tdespair."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "84",
    "Text": "O Prophet say to them: \"Everyone acts according to his own\\n\\t\\t\\tdisposition; but only your Rabb knows best who is on the Right\\n\\t\\t\\tWay.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "85",
    "Text": "They put you questions about Ar-Ruh (the Spirit). Tell them: \"The\\n\\t\\t\\tSpirit is at my Rabb's command and I am not given any knowledge\\n\\t\\t\\tof it but a little.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "86",
    "Text": "If We want, We can definitely take away all that which We have\\n\\t\\t\\trevealed to you: then you will find none to help you in getting\\n\\t\\t\\tit back from Us."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "87",
    "Text": "But your Rabb has blessed you with this knowledge; surely His\\n\\t\\t\\tgoodness to you has been great indeed."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "88",
    "Text": "Declare: \"Even if all human beings and Jinns combined their\\n\\t\\t\\tresources to produce the like of this Qur'an, they would never be\\n\\t\\t\\table to compose the like thereof, even if they backed up each\\n\\t\\t\\tother as best as they could.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "89",
    "Text": "In this Qur'an We have used different methods to make the people\\n\\t\\t\\tunderstand the Message, yet the majority of them persist in\\n\\t\\t\\tunbelief."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "90",
    "Text": "They say: \"We will not believe in you until you cause a spring to\\n\\t\\t\\tgush forth from the earth for us,"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "91",
    "Text": "or until a garden of date-palms and grapes be created for you and\\n\\t\\t\\tyou cause rivers to flow in it;"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "92",
    "Text": "or until you cause the sky to fall upon us in pieces as you have\\n\\t\\t\\tthreatened us; or you bring Allah and the angels before us face\\n\\t\\t\\tto face,"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "93",
    "Text": "or a house made with gold comes into being for you; or you ascend\\n\\t\\t\\tto the sky - we shall not even believe in your ascendance until\\n\\t\\t\\tyou bring down to us a book that we can read.\" O Muhammad, tell\\n\\t\\t\\tthem: \"Glory be to my Rabb! Have I ever claimed to be anything\\n\\t\\t\\tmore than a human Rasool?\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "94",
    "Text": "Nothing prevented people from belief when guidance came to them\\n\\t\\t\\texcept the excuse: \"What! Has Allah sent a man like us to be a\\n\\t\\t\\tRasool?\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "95",
    "Text": "O Muhammad, tell them: \"Had there been in the earth angels\\n\\t\\t\\twalking about as settlers, We would certainly have sent down to\\n\\t\\t\\tthem an angel from heaven as a Rasool.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "96",
    "Text": "Say: \"Sufficient is Allah as a witness between me and you. He is\\n\\t\\t\\tthe One Who is Aware and Observant of His servants.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "97",
    "Text": "Those whom Allah guides are rightly guided; and those whom He\\n\\t\\t\\tlets go astray, shall find no protector besides Him. On the Day\\n\\t\\t\\tof Judgment We shall gather them all, prone on their faces,\\n\\t\\t\\tblind, dumb and deaf. Hell shall be their abode: whenever its\\n\\t\\t\\tflames die down, We will rekindle for them the fierceness of the\\n\\t\\t\\tfire."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "98",
    "Text": "Thus shall they be rewarded: because they rejected Our\\n\\t\\t\\trevelations and said: \"When we are reduced to bones and decayed\\n\\t\\t\\tparticles, shall we really be raised to life in a new creation?\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "99",
    "Text": "Can they not see that Allah Who has created the heavens and the\\n\\t\\t\\tearth has power to create the people like them? He has set a\\n\\t\\t\\tdeadline for their lives, there is no doubt about it: yet the\\n\\t\\t\\twrongdoers refuse to do anything except deny."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "100",
    "Text": "Say to them: \"Even if you had all the treasures of my Rabb's\\n\\t\\t\\tblessings at your disposal, you would still hold them back for\\n\\t\\t\\tfear of spending. Man is ever so stingy!\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "101",
    "Text": "To Musa (Moses) We gave nine clear signs. Ask the Children of\\n\\t\\t\\tIsrael how, when he came to them and Fir'on told him: \"O Musa! I\\n\\t\\t\\tthink that you are bewitched\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "102",
    "Text": "Musa replied: \"You know it very well that no one except the Rabb\\n\\t\\t\\tof the heavens and the earth has sent down these signs as\\n\\t\\t\\teye-openers, and O Fir'on (Pharaoh), surely I think that you are\\n\\t\\t\\tdoomed.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "103",
    "Text": "So Fir'on resolved to remove Musa and the Israelites from the\\n\\t\\t\\tface of the earth, but We drowned him and all who were with him."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "104",
    "Text": "Thereafter We said to the Children of Israel: \"Settle down in the\\n\\t\\t\\tland and when the promise of the hereafter comes to be fulfilled,\\n\\t\\t\\tWe shall assemble you all together.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "105",
    "Text": "We have revealed the Qur'an in Truth, and with the Truth it has\\n\\t\\t\\tcome down: and O Muhammad, We have sent you only to give good\\n\\t\\t\\tnews to the believers and to warn the unbelievers."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "106",
    "Text": "We have divided the Qur'an into sections so that you may recite\\n\\t\\t\\tto the people with deliberation, and We have sent it down in\\n\\t\\t\\tgradual revelations to suit particular occasions."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "107",
    "Text": "Say: \"Whether you believe in it or not, it is true that those who\\n\\t\\t\\twere endowed with knowledge before its revelation prostrate\\n\\t\\t\\tthemselves when it is recited"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "108",
    "Text": "and say, 'Glory be to our Rabb! Our Rabb's promise has been\\n\\t\\t\\tfulfilled.'"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "109",
    "Text": "They fall down upon their faces, weeping as they listen, and this\\n\\t\\t\\tincreases their reverence.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "110",
    "Text": "O Prophet, say to them: \"Whether you call Him Allah or call Him\\n\\t\\t\\tRahman; it is all the same by whichever name you call Him because\\n\\t\\t\\tfor Him are all the Finest names. Offer your Salah neither in too\\n\\t\\t\\tloud a voice nor in too low a voice but seek a middle course"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "111",
    "Text": "and say: \"Praise be to Allah, the One Who has begotten no son and\\n\\t\\t\\tWho has no partner in His Kingdom; nor He is helpless to need a\\n\\t\\t\\tprotector, and glorify His greatness in the best possible way.\""
  }
]
