[
  {
    "SurahNumber": "66",
    "AyahNumber": "1",
    "Text": "O Prophet! Why do you make something unlawful, which Allah has\\n\\t\\t\\tmade lawful to you in seeking to please your wives? Allah is\\n\\t\\t\\tForgiving, Merciful."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "2",
    "Text": "Allah has already given you absolution from such oaths. Allah is\\n\\t\\t\\tyour Master and He is the Knowledgeable, the Wise."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "3",
    "Text": "When the Prophet confined a secret to one of his wives, she\\n\\t\\t\\tdisclosed this secret to another and Allah informed him about it,\\n\\t\\t\\tthe Prophet made known to the said wife a part of it and avoided\\n\\t\\t\\tmentioning the rest. So when he told her about this disclosure,\\n\\t\\t\\tshe asked: \"Who told you this?\" He replied: \"I was informed by\\n\\t\\t\\tHim Who is All-Knowing, All-Aware.\""
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "4",
    "Text": "If you both (Hafsah and Aeysha) turn in repentance to Allah - for\\n\\t\\t\\tyour hearts have sinned - you shall be pardoned; and if you back\\n\\t\\t\\tup each other against him (the Prophet), then you should know\\n\\t\\t\\tthat his protectors are Allah, Gabriel and all righteous\\n\\t\\t\\tbelievers, furthermore the angels too are his supporters."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "5",
    "Text": "It may well be that, if he divorce you all, his Rabb will give\\n\\t\\t\\thim in your place better wives than yourselves, submissive,\\n\\t\\t\\tfaithful, obedient, penitent, worshippers and keepers of fasting;\\n\\t\\t\\tbe they previously married or virgins."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "6",
    "Text": "O believers! Save yourselves and your families from hellfire,\\n\\t\\t\\twhose fuel is men and stones; in the charge of fierce and mighty\\n\\t\\t\\tangels who never disobey Allah's command and who promptly do what\\n\\t\\t\\tthey are commanded to do."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "7",
    "Text": "They will say to the unbelievers: \"O unbelievers! Make no excuses\\n\\t\\t\\tfor yourselves this Day. You are being rewarded according to your\\n\\t\\t\\tdeeds.\""
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "8",
    "Text": "O believers! Turn to Allah in sincere repentance. It may well be\\n\\t\\t\\tthat your Rabb will remove from you your sins and admit you to\\n\\t\\t\\tgardens beneath which rivers flow. On that Day Allah will not\\n\\t\\t\\thumiliate the Prophet and those who believe with him. Their light\\n\\t\\t\\twill shine in front of them and on their right, and they will\\n\\t\\t\\tsay: \"Our Rabb! Perfect our light for us and grant us\\n\\t\\t\\tforgiveness, for You have power over all things.\""
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "9",
    "Text": "O Prophet! Make Jihad (struggle including war) against the\\n\\t\\t\\tunbelievers and the hypocrites and deal sternly with them. Hell\\n\\t\\t\\tshall be their home, and that is an evil abode!"
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "10",
    "Text": "Allah has set an example to the unbelievers in the wife of Nuh\\n\\t\\t\\t(Noah) and the wife of Lut (Lot). They were married to two of Our\\n\\t\\t\\trighteous servants, but they betrayed them. In no way could their\\n\\t\\t\\thusbands protect them from Allah. Both of them were told: \"Enter\\n\\t\\t\\tthe fire, along with those who enter.\""
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "11",
    "Text": "And for the believers Allah has set an example in the wife of\\n\\t\\t\\tFir'on (Pharaoh), who said: \"My Rabb! Build for me a house as a\\n\\t\\t\\tspecial favor from You in paradise, deliver me from Fir'on and\\n\\t\\t\\this misdeeds, and save me from the wicked nation.\""
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "12",
    "Text": "Another example is in the life of Maryam, the daughter of `Imran,\\n\\t\\t\\twho guarded her chastity, and into whose womb We breathed of Our\\n\\t\\t\\tspirit, who testified to the words of her Rabb, and His\\n\\t\\t\\tscriptures, and was one of the obedient."
  }
]
