[
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "1",
    "Text": "Whatever is in the heavens and whatever is on the earth glorifies Allah. For He is the Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "2",
    "Text": "He is the One Who expelled the disbelievers of the People of the Book from their homes for &#761;their&#762; first banishment &#761;ever&#762;. You never thought they would go. And they thought their strongholds would put them out of Allah&rsquo;s reach. But &#761;the decree of&#762; Allah came upon them from where they never expected. And He cast horror into their hearts so they destroyed their houses with their own hands and the hands of the believers.<span class='fn' foot_note=29963>1</span>&nbsp;So take a lesson &#761;from this&#762;, O &nbsp;people of insight!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "3",
    "Text": "Had Allah not decreed exile for them, He would have certainly punished them in this world. And in the Hereafter they will suffer the punishment of the Fire."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "4",
    "Text": "This is because they defied Allah and His Messenger. And whoever defies Allah, then Allah is truly severe in punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "5",
    "Text": "Whatever palm trees you &#761;believers&#762; cut down or left standing intact, it was &#761;all&#762; by Allah&rsquo;s Will, so that He might disgrace the rebellious.<span class='fn' foot_note=29964>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "6",
    "Text": "As for the gains Allah has turned over to His Messenger from them&mdash;you did not &#761;even&#762; spur on any horse or camel for such gains. But Allah gives authority to His messengers over whoever He wills. For Allah is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "7",
    "Text": "As for gains granted by Allah to His Messenger from the people of &#761;other&#762; lands, they are for Allah and the Messenger, his close relatives, orphans, the poor, and &#761;needy&#762; travellers so that wealth may not merely circulate among your rich. Whatever the Messenger gives you, take it. And whatever he forbids you from, leave it. And fear Allah. Surely Allah is severe in punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "8",
    "Text": "&#761;Some of the gains will be&#762; for poor emigrants who were driven out of their homes and wealth, seeking Allah&rsquo;s bounty and pleasure, and standing up for Allah and His Messenger. They are the ones true in faith."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "9",
    "Text": "As for those who had settled in the city and &#761;embraced&#762; the faith before &#761;the arrival of&#762; the emigrants, they love whoever immigrates to them, never having a desire in their hearts for whatever &#761;of the gains&#762; is given to the emigrants. They give &#761;the emigrants&#762; preference over themselves even though they may be in need. And whoever is saved from the selfishness of their own souls, it is they who are &#761;truly&#762; successful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "10",
    "Text": "And those who come after them will pray, &ldquo;Our Lord! Forgive us and our fellow believers who preceded us in faith, and do not allow bitterness into our hearts towards those who believe. Our Lord! Indeed, You are Ever Gracious, Most Merciful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "11",
    "Text": "Have you &#761;O Prophet&#762; not seen the hypocrites who say to their fellow disbelievers from the People of the Book,<span class='fn' foot_note=29965>1</span>&nbsp;&ldquo;If you are expelled, we will certainly leave with you, and We will never obey anyone against you. And if you are fought against, we will surely help you.&rdquo;? But Allah bears witness that they are truly liars."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "12",
    "Text": "Indeed, if they are expelled, the hypocrites will never leave with them. And if they are fought against, the hypocrites will never help them. And even if the hypocrites did so, they would certainly flee, then the disbelievers would be left with no help."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "13",
    "Text": "Indeed, there is more fear in their hearts for you &#761;believers&#762; than for Allah. That is because they are a people who do not comprehend."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "14",
    "Text": "Even united, they would not &#761;dare&#762; fight against you except &#761;from&#762; within fortified strongholds or from behind walls. Their malice for each other is intense: you think they are united, yet their hearts are divided. That is because they are a people with no &#761;real&#762; understanding."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "15",
    "Text": "They are &#761;both just&#762; like those who recently went down before them:<span class='fn' foot_note=29966>1</span>&nbsp;they tasted the evil consequences of their doings. And they will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "16",
    "Text": "&#761;They are&#762; like Satan when he lures someone to disbelieve. Then after they have done so, he will say &#761;on Judgment Day&#762;, &ldquo;I have absolutely nothing to do with you. I truly fear Allah&mdash;the Lord of all worlds.&rdquo;<span class='fn' foot_note=29967>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "17",
    "Text": "So they will both end up in the Fire, staying there forever. That is the reward of the wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "18",
    "Text": "O believers! Be mindful of Allah and let every soul look to what &#761;deeds&#762; it has sent forth for tomorrow.<span class='fn' foot_note=29968>1</span>&nbsp;And fear Allah, &#761;for&#762; certainly Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "19",
    "Text": "And do not be like those who forgot Allah, so He made them forget themselves. It is they who are &#761;truly&#762; rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "20",
    "Text": "The residents of the Fire cannot be equal to the residents of Paradise. &#761;Only&#762; the residents of Paradise will be successful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "21",
    "Text": "Had We sent down this Quran upon a mountain, you would have certainly seen it humbled and torn apart in awe of Allah. We set forth such comparisons for people, &#761;so&#762; perhaps they may reflect.<span class='fn' foot_note=29969>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "22",
    "Text": "He is Allah&mdash;there is no god &#761;worthy of worship&#762; except Him: Knower of the seen and unseen. He is the Most Compassionate, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "23",
    "Text": "He is Allah&mdash;there is no god except Him: the King, the Most Holy, the All-Perfect, the Source of Serenity, the Watcher &#761;of all&#762;, the Almighty, the Supreme in Might,<span class='fn' foot_note=29970>1</span>&nbsp;the Majestic. Glorified is Allah far above what they associate with Him &#761;in worship&#762;!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "59",
    "AyahNumber": "24",
    "Text": "He is Allah: the Creator, the Inventor, the Shaper. He &#761;alone&#762; has the Most Beautiful Names. Whatever is in the heavens and the earth &#761;constantly&#762; glorifies Him. And He is the Almighty, All-Wise."
  }
]
