[
  {
    "SurahNumber": "101",
    "AyahNumber": "1",
    "NoteID": "6251",
    "Body": "The Day of Noise and Clamour is the Day of Judgment, when\\n\\t\\t\\t\\tthe whole of the present order of things will be\\n\\t\\t\\t\\toverthrown with a tremendous convulsion. Cf. n. 6235 to\\n\\t\\t\\t\\txcix. 1, and n. 6096 to lxxxviii. All our present\\n\\t\\t\\t\\tlandmarks will be lost. It will be a stunning experience\\n\\t\\t\\t\\tto begin with, but it will inaugurate a new world of true\\n\\t\\t\\t\\tand permanent values, in which every human deed will have\\n\\t\\t\\t\\tits true and just consequences, as if weighed in the\\n\\t\\t\\t\\tbalance. See verses 6-11 below."
  },
  {
    "SurahNumber": "101",
    "AyahNumber": "4",
    "NoteID": "6252",
    "Body": "Moths are frail light things. To see them scattered about\\n\\t\\t\\t\\tin a violent storm gives some idea of the confusion,\\n\\t\\t\\t\\tdistress, and helplessness in which men will be at first\\n\\t\\t\\t\\toverwhelmed on the Day of Account. Old memories will be\\n\\t\\t\\t\\tlike a book almost blotted out. New hopes will be vague\\n\\t\\t\\t\\tin a new world just rising on the horizon. But it will be\\n\\t\\t\\t\\ta perfectly just world, and no good action will be lost\\n\\t\\t\\t\\tand no evil one but will have its compensating value\\n\\t\\t\\t\\testimated."
  },
  {
    "SurahNumber": "101",
    "AyahNumber": "5",
    "NoteID": "6253",
    "Body": "Cf. n. 5682 to lxx 9. The mountains are solid things,\\n\\t\\t\\t\\twhich seem as if nothing could move them. But in that\\n\\t\\t\\t\\ttremendous cataclysm they will be scattered about like\\n\\t\\t\\t\\tflakes of leased or carded wool. This is a metaphor to\\n\\t\\t\\t\\tshow that what we consider very substantial in this life\\n\\t\\t\\t\\twill be as an airy nothing in the next world."
  },
  {
    "SurahNumber": "101",
    "AyahNumber": "6",
    "NoteID": "6254",
    "Body": "The Good Deeds will be weighed and appraised. This\\n\\t\\t\\t\\tappraisement will be of the nicest and justest kind: for\\n\\t\\t\\t\\tit will take into account motives, temptations,\\n\\t\\t\\t\\tprovocations, surrounding conditions, antecedents,\\n\\t\\t\\t\\tsubsequent amends, and all possible connected\\n\\t\\t\\t\\tcircumstances. Against them, presumably, will be deeds of\\n\\t\\t\\t\\tthe opposite kind, appraised in the same way. If the good\\n\\t\\t\\t\\tpredominates, the judgment will be in the man's favour,\\n\\t\\t\\t\\tand he will be ushered into a life of good pleasure and\\n\\t\\t\\t\\tsatisfaction. This will of course be on another plane."
  },
  {
    "SurahNumber": "101",
    "AyahNumber": "7",
    "NoteID": "6255",
    "Body": "Cf. xcviii. 8, and n. 6233, but perhaps the Bliss is not\\n\\t\\t\\t\\tof the same grade for all men. In every case it is bliss,\\n\\t\\t\\t\\tbut bliss suited to the particular nature of the\\n\\t\\t\\t\\tindividual concerned."
  },
  {
    "SurahNumber": "101",
    "AyahNumber": "9",
    "NoteID": "6256",
    "Body": "Just as grades of bliss are indicated for the righteous,\\n\\t\\t\\t\\tso apparently we are to understand grades of punishment\\n\\t\\t\\t\\tsuited to the sins of the individual sinners concerned."
  }
]
