[
  {
    "SurahNumber": "4",
    "AyahNumber": "1",
    "NoteID": "504",
    "Body": "Nafs may mean: (1) soul; (2) self; (3) person, living\\n\\t\\t\\t\\tperson; (4) will, good pleasure, as in iv. 4 below.\\n\\t\\t\\t\\tMinha: I follow the construction suggested by Imam Razn.\\n\\t\\t\\t\\tThe particle min would then suggest here a species, a\\n\\t\\t\\t\\tnature, a similarity. The pronoun ha refers of course to\\n\\t\\t\\t\\tNafs."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "1",
    "NoteID": "505",
    "Body": "All our mutual rights and duties are referred to Allah.\\n\\t\\t\\t\\tWe are His creatures: His Will is the standard and\\n\\t\\t\\t\\tmeasure of Allah; and our duties are measured by our\\n\\t\\t\\t\\tconformity with His Will. \"Our wills are ours, to make\\n\\t\\t\\t\\tthem Thine,\" says Tennyson (In Memoriam). Among ourselves\\n\\t\\t\\t\\t(human beings) our mutual rights and duties arise out of\\n\\t\\t\\t\\tAllah's Law, the sense of Right that is implanted in us\\n\\t\\t\\t\\tby Him."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "1",
    "NoteID": "506",
    "Body": "Among the most wonderful mysteries of our nature is that\\n\\t\\t\\t\\tof sex. The unregenerate male is apt, in the pride of his\\n\\t\\t\\t\\tphysical strength, to forget the all-important part which\\n\\t\\t\\t\\tthe female plays in his very existence, and in all the\\n\\t\\t\\t\\tsocial relationships that arise in our collective human\\n\\t\\t\\t\\tlives. The mother that bore us must ever have our\\n\\t\\t\\t\\treverence. The wife, through whom we enter parentage,\\n\\t\\t\\t\\tmust have our reverence. Sex, which governs so much of\\n\\t\\t\\t\\tour physical life, and has so much influence on our\\n\\t\\t\\t\\temotional and higher nature, deserves-not our fear, or\\n\\t\\t\\t\\tour contempt, or our amused indulgence, but-our reverence\\n\\t\\t\\t\\tin the highest sense of the term. With this fitting\\n\\t\\t\\t\\tintroduction we enter on a discussion of women, orphans,\\n\\t\\t\\t\\tand family relationships."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "2",
    "NoteID": "507",
    "Body": "Justice to orphans is enjoined, and three things are\\n\\t\\t\\t\\tparticularly mentioned as temptations in the way of a\\n\\t\\t\\t\\tguardian: (I) He must not postpone restoring all his\\n\\t\\t\\t\\tward's property when the time comes; subject to iv. S\\n\\t\\t\\t\\tbelow. (2) If there is a list of property, it is not\\n\\t\\t\\t\\tenough that that list should be technically followed: the\\n\\t\\t\\t\\tproperty restored must be of equal value to the property\\n\\t\\t\\t\\treceived: the same principle applies where there is no\\n\\t\\t\\t\\tlist. (3) If property is managed together, or where\\n\\t\\t\\t\\tperishable goods must necessarily be consumed, the\\n\\t\\t\\t\\tstrictest probity is necessary when the separation takes\\n\\t\\t\\t\\tplace, and this is insisted on. See also ii. 220 and\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "3",
    "NoteID": "508",
    "Body": "Notice the conditional clause about orphans, introducing\\n\\t\\t\\t\\tthe rules about marriage. This reminds us of the\\n\\t\\t\\t\\timmediate occasion of the promulgation of this verse. It\\n\\t\\t\\t\\twas after Uhud, when the Muslim community was left with\\n\\t\\t\\t\\tmany orphans and widows and some captives of war. Their\\n\\t\\t\\t\\ttreatment was to be governed by principles of the\\n\\t\\t\\t\\tgreatest humanity and equity. The occasion is past, but\\n\\t\\t\\t\\tthe principles remain. Marry the orphans if you are quite\\n\\t\\t\\t\\tsure that you will in that way protect their interests\\n\\t\\t\\t\\tand their property, with perfect justice to them and to\\n\\t\\t\\t\\tyour own dependents if you have any. If not, make other\\n\\t\\t\\t\\tarrangements for the orphans."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "5",
    "NoteID": "510",
    "Body": "This applies to orphans, but the wording is perfectly\\n\\t\\t\\t\\tgeneral, and defines principles like those of Chancery in\\n\\t\\t\\t\\tEnglish Law and the Court of Wards in Indian Law.\\n\\t\\t\\t\\tProperty has not only its rights but also its\\n\\t\\t\\t\\tresponsibilities. The owner may not do just what he likes\\n\\t\\t\\t\\tabsolutely; his right is limited by the good of his\\n\\t\\t\\t\\tfamily of which he is a member, and if he is incapable of\\n\\t\\t\\t\\tunderstanding it, his control should be removed. This\\n\\t\\t\\t\\tdoes not mean that he is harshly dealt with. On the\\n\\t\\t\\t\\tcontrary his interest must be protected, and he must be\\n\\t\\t\\t\\ttreated with special kindness because of his incapacity."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "5",
    "NoteID": "511",
    "Body": "Your property: Ultimately all property belongs to Allah,\\n\\t\\t\\t\\tand is intended for the support of his close relations.\\n\\t\\t\\t\\tIt is held in trust by a particular individual. If he is\\n\\t\\t\\t\\tincapable, he is put aside but gently and with kindness.\\n\\t\\t\\t\\tWhile his incapacity remains, the duties and\\n\\t\\t\\t\\tresponsibilities devolve on his guardian even more\\n\\t\\t\\t\\tstrictly than in the case of the original owner: for he\\n\\t\\t\\t\\tmay not take any of the profits for himself unless he is\\n\\t\\t\\t\\tpoor, and in that case his remuneration for his trouble\\n\\t\\t\\t\\tmust be on a scale that is no more than just and\\n\\t\\t\\t\\treasonable."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "6",
    "NoteID": "512",
    "Body": "The age of marriage is the age when they reach their\\n\\t\\t\\t\\tmajority."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "6",
    "NoteID": "513",
    "Body": "It is good to take human witnesses when you faithfully\\n\\t\\t\\t\\tdischarge your trust; but remember that, however fully\\n\\t\\t\\t\\tyou satisfy your fellow-men when you give your account to\\n\\t\\t\\t\\tthem, there is a stricter account due from you to Allah.\\n\\t\\t\\t\\tIf you are righteous in Allah's eyes, you must follow\\n\\t\\t\\t\\tthese stricter standards."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "7",
    "NoteID": "514",
    "Body": "I have resisted the temptation to translate \"next to\\n\\t\\t\\t\\tkin,\" as this phrase has a technical meaning in Indian\\n\\t\\t\\t\\tLaw, referring to certain kinds of heirs, whereas here\\n\\t\\t\\t\\tthe people meant are those whose inheritance is to be\\n\\t\\t\\t\\tdivided. The shares are specified. Here the general\\n\\t\\t\\t\\tprinciples are laid down that females inherit as well as\\n\\t\\t\\t\\tmales, and that relatives who have no legal shares,\\n\\t\\t\\t\\torphans, and indigent people are not to be treated\\n\\t\\t\\t\\tharshly, if present at the division."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "9",
    "NoteID": "515",
    "Body": "It is a touching argument addressed to those who have to\\n\\t\\t\\t\\tdivide an estate. 'How anxious would you be if you had\\n\\t\\t\\t\\tleft a helpless family behind? If others do so, help and\\n\\t\\t\\t\\tbe kind'."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "11",
    "NoteID": "516",
    "Body": "The principles of inheritance law are laid down in broad\\n\\t\\t\\t\\toutline in the Qur-an; the precise details have been\\n\\t\\t\\t\\tworked out on the basis of the Prophet's practice and\\n\\t\\t\\t\\tthat of his Companions, and by interpretation and\\n\\t\\t\\t\\tanalogy. Muslim jurists have collected a vast amount of\\n\\t\\t\\t\\tlearning on this subject, and this body of law is enough\\n\\t\\t\\t\\tby itself to form the subject of life-long study. Here we\\n\\t\\t\\t\\tshall deal only with the broad principles to be gathered\\n\\t\\t\\t\\tfrom the Text, as interpreted by the Jurists. (1) The\\n\\t\\t\\t\\tpower of testamentary disposition extends over only\\n\\t\\t\\t\\tone-third of the Property; the remaining two-thirds are\\n\\t\\t\\t\\tdistributed among heirs as laid down. (2) All\\n\\t\\t\\t\\tdistribution takes place after the legacies and debts\\n\\t\\t\\t\\t(including funeral expenses) have first been paid. (3)\\n\\t\\t\\t\\tLegacies cannot be left to any of the heirs included in\\n\\t\\t\\t\\tthe scheme of distribution; or it will amount to\\n\\t\\t\\t\\tupsetting the shares and undue preference of one heir to\\n\\t\\t\\t\\tanother. (4) Generally, but not always, the male takes a\\n\\t\\t\\t\\tshare double that of a female in his own category."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "11",
    "NoteID": "517",
    "Body": "At first sight, the Arabic words seem to mean: \"if more\\n\\t\\t\\t\\tthan two daughters.\" But the alternative in the next\\n\\t\\t\\t\\tclause is: \"if only one daughter.\" Logically, therefore,\\n\\t\\t\\t\\tthe first clause must mean: \"if daughters, two or more.\"\\n\\t\\t\\t\\tThis is the general interpretation, and is confirmed by\\n\\t\\t\\t\\tthe supplementary provision in iv. 176 at the end of the\\n\\t\\t\\t\\tSura, which should be read along with this."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "11",
    "NoteID": "518",
    "Body": "This verse deals with the portions allotted to (a)\\n\\t\\t\\t\\tchildren, and (b) parents. The next verse deals with the\\n\\t\\t\\t\\tportions allotted to (c) husband or wife of the deceased,\\n\\t\\t\\t\\tand (d) collaterals. The children's shares are fixed, but\\n\\t\\t\\t\\ttheir amount will depend upon what goes to the parents.\\n\\t\\t\\t\\tIf both parents are living, and there are also children,\\n\\t\\t\\t\\tboth father and mother take a sixth each: if only one\\n\\t\\t\\t\\tparent is living, he or she takes his or her sixth; and\\n\\t\\t\\t\\tthe rest goes to the children. If the parents are living,\\n\\t\\t\\t\\tand there is no child or other heir, the mother gets a\\n\\t\\t\\t\\tthird (and the father the remaining two-thirds); if there\\n\\t\\t\\t\\tare no children, but there are brothers or sisters (this\\n\\t\\t\\t\\tis interpreted strictly in the plural), the mother has a\\n\\t\\t\\t\\tsixth, and the father apparently the residue, as the\\n\\t\\t\\t\\tfather excludes collaterals. This is far from being an\\n\\t\\t\\t\\texhaustive statement, but it establishes the proposition\\n\\t\\t\\t\\tthat children and parents have always some share if they\\n\\t\\t\\t\\tsurvive, but their shares are affected by the existence\\n\\t\\t\\t\\tand number of the heirs in these categories."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "12",
    "NoteID": "519",
    "Body": "The husband takes a half of his deceased wife's property\\n\\t\\t\\t\\tif she leaves no child, the rest going to residuaries; if\\n\\t\\t\\t\\tshe leaves a child, the husband gets only a fourth.\\n\\t\\t\\t\\tFollowing the rule that the female share is generally\\n\\t\\t\\t\\thalf the male share, the widow gets a fourth of her\\n\\t\\t\\t\\tdeceased husband's property, if he leaves no children,\\n\\t\\t\\t\\tand an eighth if he leaves children. If there are more\\n\\t\\t\\t\\twidows than one, their collective share is a fourth or an\\n\\t\\t\\t\\teighth as the case may be; inter se they divide equally."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "12",
    "NoteID": "520",
    "Body": "The word in Arabic is kalalat, which is so construed\\n\\t\\t\\t\\tusually. But it was nowhere defined authoritatively in\\n\\t\\t\\t\\tthe lifetime of the Messenger. This was one of the three\\n\\t\\t\\t\\tterms about which Hadhrat Umar wished that the Messenger\\n\\t\\t\\t\\thad defined them in his lifetime, the other two being the\\n\\t\\t\\t\\tshare of grandfather, and riba (usury). On the accepted\\n\\t\\t\\t\\tdefinition, we are concerned with the inheritance of a\\n\\t\\t\\t\\tperson who has left no descendant or ascendant (however\\n\\t\\t\\t\\tdistant), but only collaterals, with or without a widow\\n\\t\\t\\t\\tor widower. If there is a widow or widower surviving, she\\n\\t\\t\\t\\tor he takes the share as already defined, before the\\n\\t\\t\\t\\tcollaterals come in."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "12",
    "NoteID": "521",
    "Body": "A \"brother or sister\" is here interpreted to mean a\\n\\t\\t\\t\\tuterine brother or sister, i.e., a brother or sister by\\n\\t\\t\\t\\tthe same mother but not by the same father, as the case\\n\\t\\t\\t\\tof full brothers and sisters or brothers and sisters by\\n\\t\\t\\t\\tthe same father but different mothers is understood to be\\n\\t\\t\\t\\tdealt with later, in the last verse of this Sura. The\\n\\t\\t\\t\\tuterine brother or sister, if only one survives, takes a\\n\\t\\t\\t\\tsixth; if more than one survive, they take a third\\n\\t\\t\\t\\tcollectively, and divide among themselves; this on the\\n\\t\\t\\t\\tsupposition that there are no descendants or ascendants,\\n\\t\\t\\t\\thowever remote. There may, however, be a widow or widower\\n\\t\\t\\t\\tsurviving: she or he takes her or his share, as already\\n\\t\\t\\t\\tspecified. The shares of collaterals generally are\\n\\t\\t\\t\\tcalculated on a complicated system which cannot be\\n\\t\\t\\t\\tdescribed in a brief note. For these, and the rules about\\n\\t\\t\\t\\tResiduaries ('Asaba) reference should be made to special\\n\\t\\t\\t\\tlegal treatises."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "12",
    "NoteID": "522",
    "Body": "Debts (in which funeral expenses take first rank) and\\n\\t\\t\\t\\tlegacies are the first charge on the estate of a deceased\\n\\t\\t\\t\\tperson, before distribution takes place. But equity and\\n\\t\\t\\t\\tfair dealing should be observed in all matters, so that\\n\\t\\t\\t\\tno one's interests are prejudiced. Thus funeral expenses\\n\\t\\t\\t\\tshould be reasonable; debts must be genuine and not\\n\\t\\t\\t\\treckless debts; and the shares must be calculated with\\n\\t\\t\\t\\tfairness.  A) Cf. xliv. 57, n. 4733."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "15",
    "NoteID": "523",
    "Body": "Most commentators understand this to refer to adultery or\\n\\t\\t\\t\\tfornication; in that case they consider that the\\n\\t\\t\\t\\tpunishment was altered by the later verse, xxiv. 2."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "15",
    "NoteID": "524",
    "Body": "To protect the honor of women, stricter evidence is\\n\\t\\t\\t\\trequired, i.e., the evidence of four instead of the usual\\n\\t\\t\\t\\ttwo witnesses. It is the same for adultery (see xxiv.\\n\\t\\t\\t\\t4.)."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "15",
    "NoteID": "525",
    "Body": "Keep them in prison until some definite order is\\n\\t\\t\\t\\treceived. Those who take the crime to be adultery or\\n\\t\\t\\t\\tfornication construe this definite order (\"some other\\n\\t\\t\\t\\tway\") to mean some definite pronouncement by the Prophet\\n\\t\\t\\t\\tunder inspiration; this was the punishment of flogging\\n\\t\\t\\t\\tunder xxiv. 2, for fornication, and stoning to death\\n\\t\\t\\t\\tunder the Prophet's directives for adultery."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "18",
    "NoteID": "526",
    "Body": "Note the fine touch. A sin may be fashionable, and people\\n\\t\\t\\t\\tmay sin together without compunction. When one of them is\\n\\t\\t\\t\\tfaced with Death, he repents, but that sort of repentance\\n\\t\\t\\t\\tis no good."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "13",
    "NoteID": "527",
    "Body": "Among many nations, including Arabs in the Days of\\n\\t\\t\\t\\tIgnorance, a step-son or brother took possession of a\\n\\t\\t\\t\\tdead man's widow or widows along with his goods and\\n\\t\\t\\t\\tchattels. This shameful custom is forbidden. See also iv.\\n\\t\\t\\t\\t22 below."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "19",
    "NoteID": "527",
    "Body": "Among many nations, including Arabs in the Days of\\n\\t\\t\\t\\tIgnorance, a step-son or brother took possession of a\\n\\t\\t\\t\\tdead man's widow or widows along with his goods and\\n\\t\\t\\t\\tchattels. This shameful custom is forbidden. See also iv.\\n\\t\\t\\t\\t22 below."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "19",
    "NoteID": "528",
    "Body": "Another trick, to detract from the freedom of married\\n\\t\\t\\t\\twomen was to treat them badly and force them to sue for a\\n\\t\\t\\t\\tKhul'a divorce (see ii. 229, n. 258) or its equivalent in\\n\\t\\t\\t\\tpre-lslamic custom, when the dower could be claimed back.\\n\\t\\t\\t\\tThis is also forbidden. Or the harshness may be exercised\\n\\t\\t\\t\\tin another way: a divorced woman may be prevented by\\n\\t\\t\\t\\tthose who have control of her, from remarrying unless she\\n\\t\\t\\t\\tremits her dower. All kinds of harshness are forbidden."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "20",
    "NoteID": "529",
    "Body": "Treasure: Qintar = a Talent of gold: see iii. 14, first\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "22",
    "NoteID": "530",
    "Body": "See above: iv. 19, n. 527."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "23",
    "NoteID": "531",
    "Body": "This Table of Prohibited Degrees agrees in the main with\\n\\t\\t\\t\\twhat is usually accepted among all nations, except in\\n\\t\\t\\t\\tminor details. It begins in the last verse (with father's\\n\\t\\t\\t\\twidows or divorcees). The scheme is drawn up on the\\n\\t\\t\\t\\tassumption that the person who proposes to marry is a\\n\\t\\t\\t\\tman: if it is a woman, the same scheme will apply,\\n\\t\\t\\t\\tmutatis mutandis: it will read: \"your fathers, sons,\\n\\t\\t\\t\\tbrothers,\" etc.; or you can always read it from the\\n\\t\\t\\t\\thusband's view of relationship, as there must always be a\\n\\t\\t\\t\\thusband in a marriage."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "23",
    "NoteID": "532",
    "Body": "\"Mother\" includes grandmother (through the father or\\n\\t\\t\\t\\tmother), great grandmother, etc.; \"daughter\" includes\\n\\t\\t\\t\\tgrand-daughter (through son or daughter), greatgrand\\n\\t\\t\\t\\tdaughter, etc.; \"sister,\" includes full-sister and\\n\\t\\t\\t\\thalf-sister. \"Father's sister\" includes grandfather's\\n\\t\\t\\t\\tsister, etc., and \"mother's sister\" includes\\n\\t\\t\\t\\tgrandmother's sister, etc."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "23",
    "NoteID": "533",
    "Body": "\"Fosterage\" or milk-relationships play an important part\\n\\t\\t\\t\\tin Muslim Law, and count like blood-relationships: it\\n\\t\\t\\t\\twould therefore seem that not only foster-mothers and\\n\\t\\t\\t\\tfoster-sisters, but foster-mother's sister, etc., all\\n\\t\\t\\t\\tcome within the prohibited degrees."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "23",
    "NoteID": "534",
    "Body": "It is generally held that \"under your guardianship\" is a\\n\\t\\t\\t\\tdescription, not a condition."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "23",
    "NoteID": "535",
    "Body": "\"Sons\" includes grandsons."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "23",
    "NoteID": "536",
    "Body": "The bar against two sisters in marriage together applies\\n\\t\\t\\t\\tto aunt and niece together, but not to deceased wife's\\n\\t\\t\\t\\tsister."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "24",
    "NoteID": "537",
    "Body": "Whom your right hands possess: i.e., captives."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "24",
    "NoteID": "538",
    "Body": "After defining the prohibited degrees, the verse proceeds\\n\\t\\t\\t\\tto say that women other than those specified may be\\n\\t\\t\\t\\tsought in marriage, but even so, not from motives of\\n\\t\\t\\t\\tlust, but in order to promote chastity between the sexes.\\n\\t\\t\\t\\tMarriage in the original Arabic is here described by a\\n\\t\\t\\t\\tword which suggests a fortress (hisn): marriage is,\\n\\t\\t\\t\\ttherefore, the fortress of chastity."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "3",
    "NoteID": "539",
    "Body": "As the woman in marriage surrenders her person, so the\\n\\t\\t\\t\\tman also must surrender at least some of his property\\n\\t\\t\\t\\taccording to his means. And this gives rise to the law of\\n\\t\\t\\t\\tDower. A minimum dower is prescribed, but it is not\\n\\t\\t\\t\\tnecessary to stick to the minimum, and in the new\\n\\t\\t\\t\\trelationship created, the parties are recommended to act\\n\\t\\t\\t\\ttowards each other with the greatest confidence and\\n\\t\\t\\t\\tliberality."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "24",
    "NoteID": "539",
    "Body": "As the woman in marriage surrenders her person, so the\\n\\t\\t\\t\\tman also must surrender at least some of his property\\n\\t\\t\\t\\taccording to his means. And this gives rise to the law of\\n\\t\\t\\t\\tDower. A minimum dower is prescribed, but it is not\\n\\t\\t\\t\\tnecessary to stick to the minimum, and in the new\\n\\t\\t\\t\\trelationship created, the parties are recommended to act\\n\\t\\t\\t\\ttowards each other with the greatest confidence and\\n\\t\\t\\t\\tliberality."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "25",
    "NoteID": "540",
    "Body": "That is, captives taken in a Jihad: If you seek such a\\n\\t\\t\\t\\tperson in marriage, do it from no base motives. Safeguard\\n\\t\\t\\t\\tyour faith, and see that she too does believe. In that\\n\\t\\t\\t\\tcase, after all, she is of the human brotherhood, and her\\n\\t\\t\\t\\tcondition is accidental and redeemable. If the slave bore\\n\\t\\t\\t\\ta child to her master, she would become free."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "29",
    "NoteID": "541",
    "Body": "Let me paraphrase this verse, for there is profound\\n\\t\\t\\t\\tmeaning in it. (1) All your property you hold in trust,\\n\\t\\t\\t\\twhether it is in your name, or belongs to the community,\\n\\t\\t\\t\\tor to people over whom you have control. To waste is\\n\\t\\t\\t\\twrong. (2) In ii. 188 the same phrase occurred, to\\n\\t\\t\\t\\tcaution us against greed. Here it occurs, to encourage us\\n\\t\\t\\t\\tto increase property by economic use (traffic and trade),\\n\\t\\t\\t\\trecalling Christ's parable of the Talents (Matt. xxv.\\n\\t\\t\\t\\t14-30), where the servants who had increased their\\n\\t\\t\\t\\tmaster's wealth were promoted and the servant who had\\n\\t\\t\\t\\thoarded was cast into darkness. (3) We are warned that\\n\\t\\t\\t\\tour waste may mean our own destruction (\"nor kill or\\n\\t\\t\\t\\tdestroy yourselves.\") But there is a more general meaning\\n\\t\\t\\t\\talso: we must be careful of our own and other people's\\n\\t\\t\\t\\tlives. We must commit no violence. This is the opposite\\n\\t\\t\\t\\tof \"trade and traffic by mutual good-will.\" (4) Our\\n\\t\\t\\t\\tviolence to our own brethren is particularly\\n\\t\\t\\t\\tpreposterous, seeing that Allah has loved and showered\\n\\t\\t\\t\\tHis mercies on us and all His creatures."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "32",
    "NoteID": "542",
    "Body": "Men and women have gifts from Allah-some greater than\\n\\t\\t\\t\\tothers. They seem unequal, but we are assured that Allah\\n\\t\\t\\t\\thas allotted them by a scheme by which people receive\\n\\t\\t\\t\\twhat they earn. If this does not appear clear in our\\n\\t\\t\\t\\tsight, let us remember that we have no full knowledge but\\n\\t\\t\\t\\tAllah has. We must not be jealous if other people have\\n\\t\\t\\t\\tmore than we have-in wealth or position or strength or\\n\\t\\t\\t\\thonour or talent or happiness. Probably things are\\n\\t\\t\\t\\tequalized in the aggregate or in the long run, or equated\\n\\t\\t\\t\\tto needs and merits on a scale which we cannot appraise.\\n\\t\\t\\t\\tIf we want more, instead of being jealous or covetous, we\\n\\t\\t\\t\\tshould pray to Allah and place before Him our needs.\\n\\t\\t\\t\\tThough He knows all, and has no need of our prayer, our\\n\\t\\t\\t\\tprayer may reveal to ourselves our shortcomings and\\n\\t\\t\\t\\tenable us to deserve more of Allah's bounty or make\\n\\t\\t\\t\\tourselves fit for it."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "33",
    "NoteID": "543",
    "Body": "Mawali, plural of Maula; from the root wala, to be near\\n\\t\\t\\t\\tin place or relationship, to follow, Maula may therefore\\n\\t\\t\\t\\tmean: (1) nearly related, (2) heir, (3) sharer or\\n\\t\\t\\t\\tpartner; these three meanings are implied here; (4)\\n\\t\\t\\t\\tneighbour, or friend, or protector, or client (xliv. 44);\\n\\t\\t\\t\\t(5) lord or master (xvi. 76)."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "33",
    "NoteID": "544",
    "Body": "When the emigration took place from Makkah to Madinah,\\n\\t\\t\\t\\tbonds and links of brotherhood were established between\\n\\t\\t\\t\\tthe Emigrants and the Helpers, and they shared in each\\n\\t\\t\\t\\tother's inheritance. Later, when the Community was\\n\\t\\t\\t\\tsolidly established, and relations with those left behind\\n\\t\\t\\t\\tin Makkah were resumed, the rights of blood-relations in\\n\\t\\t\\t\\tMakkah, and the Helper-brethren in Madinah were both\\n\\t\\t\\t\\tsafeguarded. This is the particular meaning. The more\\n\\t\\t\\t\\tgeneral meaning is similar; respect your ties of blood,\\n\\t\\t\\t\\tof neighbourhood, and of friendly compacts and\\n\\t\\t\\t\\tunderstandings. Be just to all."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "135",
    "NoteID": "544",
    "Body": "When the emigration took place from Makkah to Madinah,\\n\\t\\t\\t\\tbonds and links of brotherhood were established between\\n\\t\\t\\t\\tthe Emigrants and the Helpers, and they shared in each\\n\\t\\t\\t\\tother's inheritance. Later, when the Community was\\n\\t\\t\\t\\tsolidly established, and relations with those left behind\\n\\t\\t\\t\\tin Makkah were resumed, the rights of blood-relations in\\n\\t\\t\\t\\tMakkah, and the Helper-brethren in Madinah were both\\n\\t\\t\\t\\tsafeguarded. This is the particular meaning. The more\\n\\t\\t\\t\\tgeneral meaning is similar; respect your ties of blood,\\n\\t\\t\\t\\tof neighbourhood, and of friendly compacts and\\n\\t\\t\\t\\tunderstandings. Be just to all."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "34",
    "NoteID": "545",
    "Body": "Qawwam: one who stands firm in another's business,\\n\\t\\t\\t\\tprotects his interests, and looks after his affairs- or\\n\\t\\t\\t\\tit may be, standing firm in his own business, managing\\n\\t\\t\\t\\taffairs, with a steady purpose. Cf. iv. 135."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "34",
    "NoteID": "546",
    "Body": "Or the sentence may be rendered: \"and protect (the\\n\\t\\t\\t\\thusband's interests) in his absence, as Allah has\\n\\t\\t\\t\\tprotected them.\" If we take the rendering as in the text,\\n\\t\\t\\t\\tthe meaning is: the good wife is obedient and harmonious\\n\\t\\t\\t\\tin her husband's presence, and in his absence guards his\\n\\t\\t\\t\\treputation and property and her own virtue, as ordained\\n\\t\\t\\t\\tby Allah. If we take the rendering as in the note, we\\n\\t\\t\\t\\treach the same result in a different way: the good wife,\\n\\t\\t\\t\\tin her husband's absence, remembering how Allah has given\\n\\t\\t\\t\\ther a sheltered position, does everything to justify that\\n\\t\\t\\t\\tposition by guarding her own virtue and his reputation\\n\\t\\t\\t\\tand property."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "34",
    "NoteID": "547",
    "Body": "In case of family jars four steps are mentioned, to be\\n\\t\\t\\t\\ttaken in that order: (1) perhaps verbal advice or\\n\\t\\t\\t\\tadmonition may be sufficient; (2) if not, sex relations\\n\\t\\t\\t\\tmay be suspended; (3) if this is not sufficient, some\\n\\t\\t\\t\\tslight physical correction may be administered: but Imam\\n\\t\\t\\t\\tShafii considers this inadvisable, though permissible,\\n\\t\\t\\t\\tand all authorities are unanimous in deprecating any sort\\n\\t\\t\\t\\tof cruelty, even of the nagging kind, as mentioned in the\\n\\t\\t\\t\\tnext clause; (4) if all this fails, a family council is\\n\\t\\t\\t\\trecommended in iv. 35 below."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "34",
    "NoteID": "548",
    "Body": "Temper, nagging, sarcasm, speaking at each other in other\\n\\t\\t\\t\\tpeople's presence, reverting to past faults which should\\n\\t\\t\\t\\tbe forgiven and forgotten,-all this is forbidden. And the\\n\\t\\t\\t\\treason given is characteristic of Islam. You must live\\n\\t\\t\\t\\tall your life as in the presence of Allah, Who is high\\n\\t\\t\\t\\tabove us, but Who watches over us. How petty and\\n\\t\\t\\t\\tcontemptible will our little squabbles appear in His\\n\\t\\t\\t\\tpresence!"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "35",
    "NoteID": "549",
    "Body": "An excellent plan for settling family disputes, without\\n\\t\\t\\t\\ttoo much publicity or mud-throwing, or resort to the\\n\\t\\t\\t\\tchicaneries of the law. The Latin countries recognise\\n\\t\\t\\t\\tthis plan in their legal systems. It is a pity that\\n\\t\\t\\t\\tMuslims do not resort to it universally, as they should.\\n\\t\\t\\t\\tThe arbiters from each family would know the\\n\\t\\t\\t\\tidiosyncracies of both parties, and would be able, with\\n\\t\\t\\t\\tAllah's help to effect a real reconciliation."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "36",
    "NoteID": "550",
    "Body": "The essence of Islam is to serve Allah and do good to\\n\\t\\t\\t\\tyour fellow-creatures. This is wider and more\\n\\t\\t\\t\\tcomprehensive than \"Love God and love your neighbour\".\\n\\t\\t\\t\\tFor it includes duties to animals as our\\n\\t\\t\\t\\tfellow-creatures, and emphasises practical service rather\\n\\t\\t\\t\\tthan sentiment."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "36",
    "NoteID": "551",
    "Body": "Neighbours who are near: that is, in local situation as\\n\\t\\t\\t\\twell as intimate relationships, just as neighbours who\\n\\t\\t\\t\\tare strangers includes those whom we do not know or who\\n\\t\\t\\t\\tlive away from us."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "36",
    "NoteID": "552",
    "Body": "The Companion by your side may be your intimate friends\\n\\t\\t\\t\\tand associates, just as the way-farer you meet may be a\\n\\t\\t\\t\\tcasual acquaintance on your travels. This last is much\\n\\t\\t\\t\\twider than the \"stranger within your gate.\""
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "36",
    "NoteID": "553",
    "Body": "What your right hands possess: For the meaning of the\\n\\t\\t\\t\\tphrase see n. 537 above."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "36",
    "NoteID": "554",
    "Body": "Real deeds of service and kindness proceed, not from\\n\\t\\t\\t\\tshowing off or from a superior sort of condescension (cf.\\n\\t\\t\\t\\t\"White Man's Burden\"), but from a frank recognition of\\n\\t\\t\\t\\tour own humility and the real claims, before Allah, of\\n\\t\\t\\t\\tall our fellow-creatures. For in our mutual needs we are\\n\\t\\t\\t\\tequal before Allah, or perhaps the best of us (as the\\n\\t\\t\\t\\tworld sees us) may be worse than the worst of us (from\\n\\t\\t\\t\\tthe same point of view)."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "37",
    "NoteID": "555",
    "Body": "Arrogance is one reason why our deeds of love and\\n\\t\\t\\t\\tkindness do not thrive. Another is niggardliness or\\n\\t\\t\\t\\tselfishness. Allah does not love either the one or the\\n\\t\\t\\t\\tother, for they both proceed from want of love of Allah,\\n\\t\\t\\t\\tor faith in Allah. Niggardly is the worldly wise man who\\n\\t\\t\\t\\tnot only refuses to spend himself in service, but by\\n\\t\\t\\t\\texample and precept prevents others from doing so, as\\n\\t\\t\\t\\totherwise he would be made odious by comparison, before\\n\\t\\t\\t\\this fellow-creatures. So he either makes a virtue of his\\n\\t\\t\\t\\tcaution, or hides the gifts which have been given\\n\\t\\t\\t\\thim-wealth, position, talent, etc."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "37",
    "NoteID": "556",
    "Body": "Note how the punishment fits the crime. The niggard holds\\n\\t\\t\\t\\tother people in contempt, and in doing so, becomes\\n\\t\\t\\t\\thimself contemptible."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "38",
    "NoteID": "557",
    "Body": "A fault opposed to niggardliness, and equally opposed to\\n\\t\\t\\t\\ttrue Charity, is to spend lavishly to be seen of men. It\\n\\t\\t\\t\\tis mere hypocrisy: there is no love in it, either for\\n\\t\\t\\t\\tAllah or for man."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "39",
    "NoteID": "558",
    "Body": "Sustenance: physical, intellectual, spiritual-everything\\n\\t\\t\\t\\tpertaining to life and growth. Our being is from Allah,\\n\\t\\t\\t\\tand we must therefore spend ourselves freely for Allah.\\n\\t\\t\\t\\tHow can it be a burden? It is merely a response to the\\n\\t\\t\\t\\tdemand of our own healthy nature."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "40",
    "NoteID": "559",
    "Body": "Any little good of our own comes from the purity of our\\n\\t\\t\\t\\theart. Its results in the world are doubled and\\n\\t\\t\\t\\tmultiplied by Allah's grace and mercy; but an even\\n\\t\\t\\t\\tgreater reward comes from Him: His good pleasure, which\\n\\t\\t\\t\\tbrings us nearer to Him."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "41",
    "NoteID": "560",
    "Body": "Each Prophet and Leader is a witness for his People and\\n\\t\\t\\t\\this contemporaries-for those who accept Allah, and\\n\\t\\t\\t\\tagainst those who reject Him."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "42",
    "NoteID": "561",
    "Body": "Those who reject Allah's message will wish, when their\\n\\t\\t\\t\\teyes are opened, that they were reduced to dust, for\\n\\t\\t\\t\\texistence itself will be agony to them. They might like\\n\\t\\t\\t\\tto hide in the dust, but nothing is hidden from Allah.\\n\\t\\t\\t\\tAll their past will stand out clear before Him."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "43",
    "NoteID": "562",
    "Body": "The reference is either to a state of intoxication or to\\n\\t\\t\\t\\ta dazed state of mind on account of drowsiness or some\\n\\t\\t\\t\\tother cause. Or perhaps both are implied. Before the\\n\\t\\t\\t\\tprohibition of intoxicants altogether was promulgated, it\\n\\t\\t\\t\\twas at least unbecoming that people should come to\\n\\t\\t\\t\\tprayers in such a state. For prayers it is only right\\n\\t\\t\\t\\tthat we should collect our whole minds and approach Allah\\n\\t\\t\\t\\tin a spirit of reverence."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "43",
    "NoteID": "563",
    "Body": "The strictest cleanliness and purity of mind and body are\\n\\t\\t\\t\\trequired, especially at the time of prayer. But there are\\n\\t\\t\\t\\tcircumstances when water for ablutions is not easily\\n\\t\\t\\t\\tobtainable, especially in the dry conditions of Arabia,\\n\\t\\t\\t\\tand then washing with dry sand or clean earth is\\n\\t\\t\\t\\trecommended. Four such circumstances are mentioned: the\\n\\t\\t\\t\\ttwo last when washing is specially required; the two\\n\\t\\t\\t\\tfirst when washing may be necessary, but it may not be\\n\\t\\t\\t\\teasy to get water. For a man, when he is ill, cannot walk\\n\\t\\t\\t\\tout far to get water, and a man on a journey has no full\\n\\t\\t\\t\\tcontrol over his supplies. In all four cases, where water\\n\\t\\t\\t\\tcannot be got, cleaning with dry sand or dry earth is\\n\\t\\t\\t\\trecommended. This is called Tayammum."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "44",
    "NoteID": "564",
    "Body": "Cf. iii. 23 and n. 366."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "46",
    "NoteID": "565",
    "Body": "See ii. 93, n. 98. A trick of the Jews was to twist words\\n\\t\\t\\t\\tand expressions, so as to ridicule the most solemn\\n\\t\\t\\t\\tteachings of Faith. Where they should have said, \"We hear\\n\\t\\t\\t\\tand we obey,\" they said aloud, \"We hear,\" and whispered,\\n\\t\\t\\t\\t\"We disobey.\" Where they should have said respectfully,\\n\\t\\t\\t\\t\"We hear,\" they added in a whisper, \"May you not hear,\"\\n\\t\\t\\t\\tby way of ridicule. Where they claimed the attention of\\n\\t\\t\\t\\tthe Prophet, they used an ambiguous word apparently\\n\\t\\t\\t\\tharmless, but in their intention disrespectful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "46",
    "NoteID": "566",
    "Body": "See ii. 104, n. 106. \"Raina\" if used respectfully in the\\n\\t\\t\\t\\tArabic way, would have meant \"Please attend to us.\" With\\n\\t\\t\\t\\ta twist of their tongue, they suggested an insulting\\n\\t\\t\\t\\tmeaning, such as \"O thou that takest us to pasture!\" or\\n\\t\\t\\t\\tin Hebrew, \"Our bad one!\""
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "47",
    "NoteID": "567",
    "Body": "Literally, \"before We obliterate some features (or faces)\\n\\t\\t\\t\\tand turn them front to back (or back to front)\": an\\n\\t\\t\\t\\tArabic idiom, which must be translated freely to yield\\n\\t\\t\\t\\tits proper meaning in English. The face is the chief\\n\\t\\t\\t\\texpression of a man's own real essence; it is also the\\n\\t\\t\\t\\tindex of his fame and estimation. The People of the Book\\n\\t\\t\\t\\thad been specially favoured by Allah with revelations. If\\n\\t\\t\\t\\tthey proved themselves unworthy, they lost their \"face\".\\n\\t\\t\\t\\tTheir eminence would, owing to their own conduct, be\\n\\t\\t\\t\\tturned into degradation. Others would take their place.\\n\\t\\t\\t\\tThe first shall be last and the last shall be first:\\n\\t\\t\\t\\tMatt. xix. 30."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "47",
    "NoteID": "568",
    "Body": "Cf. ii. 65 and n. 79."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "48",
    "NoteID": "569",
    "Body": "Just as in an earthly kingdom the worst crime is that of\\n\\t\\t\\t\\ttreason, as it cuts at the very existence of the State,\\n\\t\\t\\t\\tso in the Divine Kingdom, the unforgivable sin is that of\\n\\t\\t\\t\\tcontumacious treason against Allah by putting up Allah's\\n\\t\\t\\t\\tcreatures in rivalry against Him. This is rebellion\\n\\t\\t\\t\\tagainst the Creator. It is what Plato would call the \"lie\\n\\t\\t\\t\\tin the soul.\" But even here, if the rebellion is through\\n\\t\\t\\t\\tignorance, and is followed by sincere repentance and\\n\\t\\t\\t\\tamendment, Allah's Mercy is always open (iv. 17)."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "49",
    "NoteID": "570",
    "Body": "The sanctimonious or self-sanctified people are the\\n\\t\\t\\t\\tfarthest from sanctity or purity, which can only proceed\\n\\t\\t\\t\\tfrom Allah. They cannot play with Allah's Truth and yet\\n\\t\\t\\t\\tgo on claiming to be guided and purified or justified by\\n\\t\\t\\t\\tAllah. Their falsehood in itself condemns them: no\\n\\t\\t\\t\\tfurther proof is needed of their selfishness and evil."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "49",
    "NoteID": "571",
    "Body": "Literally, the small skin in the groove of a date stone,\\n\\t\\t\\t\\ta thing of no value; fatil."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "51",
    "NoteID": "572",
    "Body": "Cf. iii. 23 and n. 366. The phrase also occurs in iv. 44."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "51",
    "NoteID": "573",
    "Body": "The word I have translated Sorcery is jibt, which may\\n\\t\\t\\t\\tmean divination, sorcery, magic, or any false object of\\n\\t\\t\\t\\tbelief or worship, such as an idol. The word I have\\n\\t\\t\\t\\ttranslated Evil (here and in ii. 256) is Taguit, which\\n\\t\\t\\t\\tmeans the evil one, the one who exceeds all bounds,\\n\\t\\t\\t\\tSatan: or it may refer to some idol worshipped by the\\n\\t\\t\\t\\tPagan Arabs, with whom the Jews of Madinah were\\n\\t\\t\\t\\tintriguing against the Holy Prophet. The Jews had taken\\n\\t\\t\\t\\tmuch to sorcery, magic, divination, and such\\n\\t\\t\\t\\tsuperstitions."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "52",
    "NoteID": "574",
    "Body": "The Jews were then seeking the aid of the Makkan Pagans\\n\\t\\t\\t\\tagainst Muhammad, but far from getting any help from\\n\\t\\t\\t\\tthem, they and the Pagans were both overthrown. That was\\n\\t\\t\\t\\tthe immediate occasion, but the words have a perfectly\\n\\t\\t\\t\\tgeneral-a universal-meaning."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "53",
    "NoteID": "575",
    "Body": "The word I have translated farthing is naqir, the groove\\n\\t\\t\\t\\tin a date stone, a thing of no value whatever.\\n\\t\\t\\t\\tClose-fistedness and envy are among the worst forms of\\n\\t\\t\\t\\tselfishness, and appear specially incongruous in people\\n\\t\\t\\t\\tof power, authority, or influence, from whom is expected\\n\\t\\t\\t\\tgenerosity in giving and generosity in seeing other\\n\\t\\t\\t\\tpeople's prosperity or happiness."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "54",
    "NoteID": "576",
    "Body": "Such as the kingdoms of David and Solomon, for they had\\n\\t\\t\\t\\tinternational fame."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "55",
    "NoteID": "577",
    "Body": "Cf. iv. 97, viii. 37, ix. 95, ixx. 68."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "57",
    "NoteID": "578",
    "Body": "Cf. ii. 25 and n. 44."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "57",
    "NoteID": "579",
    "Body": "The Garden is contrasted with the Fire: the shade is\\n\\t\\t\\t\\tcontrasted with the roasting, Evil grows with what it\\n\\t\\t\\t\\tfeeds on. So goodness and felicity grow with their\\n\\t\\t\\t\\tpractice."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "59",
    "NoteID": "580",
    "Body": "Ulu-l-amr = those charged with authority or\\n\\t\\t\\t\\tresponsibility or decision, or the settlement of affairs.\\n\\t\\t\\t\\tAll ultimate authority rests in Allah. Prophets of Allah\\n\\t\\t\\t\\tderive their authority from Him. As Islam makes no sharp\\n\\t\\t\\t\\tdivision between sacred and secular affairs, it expects\\n\\t\\t\\t\\tgovernments to be imbued with righteousness. Likewise\\n\\t\\t\\t\\tIslam expects Muslims to respect the authority of such\\n\\t\\t\\t\\tgovernment for otherwise there can be no order or\\n\\t\\t\\t\\tdiscipline."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "60",
    "NoteID": "581",
    "Body": "The immediate reference was to the Hypocrites (Munafiqin)\\n\\t\\t\\t\\tof Madinah but the words are general, and the evil of\\n\\t\\t\\t\\thypocrisy has to be dealt with in all ages. The type of\\n\\t\\t\\t\\tthese men is what is called Mr. Facing-both-ways in\\n\\t\\t\\t\\tBunyan's \"Pilgrim's Progress.\" Such men declare that they\\n\\t\\t\\t\\tare always with the Right, but calmly intrigue with Evil\\n\\t\\t\\t\\tand Injustice, and even make Injustice their judge if\\n\\t\\t\\t\\ttheir personal interests are served in that way."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "63",
    "NoteID": "582",
    "Body": "How should hypocrites be treated? To take them into your\\n\\t\\t\\t\\tconfidence would of course be foolish. To wage\\n\\t\\t\\t\\tunrelenting war against them may destroy the hope of\\n\\t\\t\\t\\treforming them and purging them of their hypocrisy. The\\n\\t\\t\\t\\tProphet of Allah keeps clear of their wiles, but at the\\n\\t\\t\\t\\tsame time, does not hesitate to show them the error of\\n\\t\\t\\t\\ttheir ways, nor to put in a word in season, to penetrate\\n\\t\\t\\t\\ttheir hearts and win them back to Allah."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "65",
    "NoteID": "583",
    "Body": "The test of true Faith is not mere lip profession, but\\n\\t\\t\\t\\tbringing all our doubts and disputes to the one in whom\\n\\t\\t\\t\\twe profess faith. Further, when a decision is given we\\n\\t\\t\\t\\tare not only to accept it, but find in our inmost souls\\n\\t\\t\\t\\tno difficulty and no resistance, but on the contrary a\\n\\t\\t\\t\\tjoyful acceptance springing from the conviction of our\\n\\t\\t\\t\\town faith."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "66",
    "NoteID": "584",
    "Body": "The highest in faith willingly sacrifice their lives,\\n\\t\\t\\t\\ttheir homes, and all that they hold dearest, in the cause\\n\\t\\t\\t\\tof Allah. Those whose faith is not so strong are expected\\n\\t\\t\\t\\tat least to do what a loyal member of any society does,\\n\\t\\t\\t\\tsubmit his doubts and disputes to the head of the society\\n\\t\\t\\t\\tand cheerfully accept his decision and submit to it. The\\n\\t\\t\\t\\tcontrast is between the Hypocrites who will not even do\\n\\t\\t\\t\\tthis, and the really devoted men and women who would\\n\\t\\t\\t\\tvoluntarily sacrifice their lives."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "68",
    "NoteID": "585",
    "Body": "Four advantages of obedience to Allah are mentioned, in\\n\\t\\t\\t\\tthe order in which they will appeal to the beginner in\\n\\t\\t\\t\\tfaith: (1) his own benefit (\"best for them\"): (2)\\n\\t\\t\\t\\tstrengthening of his faith, as he becomes more and more\\n\\t\\t\\t\\tat home in the world of faith: (3) reward from Allah's\\n\\t\\t\\t\\town Presence, such intense conviction that no further\\n\\t\\t\\t\\targuments are needed: (4) the Straight Way, in which\\n\\t\\t\\t\\tthere is no doubt or difficulty whatever in our practical\\n\\t\\t\\t\\tconduct."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "69",
    "NoteID": "586",
    "Body": "A passage of the deepest devotional meaning. Even the\\n\\t\\t\\t\\thumblest man who accepts Faith and does good becomes an\\n\\t\\t\\t\\taccepted member of a great and beautiful company in the\\n\\t\\t\\t\\tHereafter. It is a company which lives perpetually in the\\n\\t\\t\\t\\tsunshine of God's Grace. (This passage partly illustrates\\n\\t\\t\\t\\tQ. i. 5). It is a glorious hierarchy, of which four\\n\\t\\t\\t\\tgrades are specified: (1) The highest is that of the\\n\\t\\t\\t\\tProphets or Apostles, who get plenary inspiration from\\n\\t\\t\\t\\tGod, and who teach mankind by example and precept. That\\n\\t\\t\\t\\trank in Islam is held by Muhammand Al-Mustafa. (2) The\\n\\t\\t\\t\\tnext are those whose badge is sincerity and truth: they\\n\\t\\t\\t\\tlove and support the truth with their person, their\\n\\t\\t\\t\\tmeans, their influence, and all that is theirs. That rank\\n\\t\\t\\t\\twas held by the special Companions of Muhammad, among\\n\\t\\t\\t\\twhom the type was that of Hadhrat Abu Bakr As-Siddiq. (3)\\n\\t\\t\\t\\tThe next are the noble army of Witnesses, who testify to\\n\\t\\t\\t\\tthe truth. The testimony may be by martyrdom, Or it may\\n\\t\\t\\t\\tbe by the tongue of the true Preacher or the pen of the\\n\\t\\t\\t\\tdevoted scholar, or the life of the man devoted to\\n\\t\\t\\t\\tservice, (4) Lastly, there is the large company of\\n\\t\\t\\t\\tRighteous people, the ordinary folk who do their ordinary\\n\\t\\t\\t\\tbusiness, but always in a righteous Way."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "70",
    "NoteID": "587",
    "Body": "If a generous General gives the private soldier the\\n\\t\\t\\t\\tprivilege of sitting with his comrades and officers, high\\n\\t\\t\\t\\tand low, in one common Brotherhood, people may perhaps\\n\\t\\t\\t\\twonder: how may this be? If we are admitted to that\\n\\t\\t\\t\\tCompany, we want to know no more. It is enough to us that\\n\\t\\t\\t\\tAllah knows our humility and our unworthiness, and with\\n\\t\\t\\t\\tHis full knowledge admits us to that glorious Company!"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "71",
    "NoteID": "588",
    "Body": "No fight should be undertaken without due preparations\\n\\t\\t\\t\\tand precautions. When these are taken, we must go boldly\\n\\t\\t\\t\\tforward. \"Go forth\" is therefore repeated for emphasis.\\n\\t\\t\\t\\tBut we must go forth in a collective spirit, and not in a\\n\\t\\t\\t\\tselfish spirit-either in small parties or all together,\\n\\t\\t\\t\\tas our Leader determines. We must not tarry like the\\n\\t\\t\\t\\tdoubter in the next two verses."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "72",
    "NoteID": "589",
    "Body": "The doubter detaches himself in thought and action from\\n\\t\\t\\t\\tthe community. If the general body has a reverse, he\\n\\t\\t\\t\\tblesses Allah that he was not among them, instead of\\n\\t\\t\\t\\tbeing ashamed of himself for desertion. If the general\\n\\t\\t\\t\\tbody wins a success, he does not rejoice for the common\\n\\t\\t\\t\\tcause, but only regrets for himself that he was not there\\n\\t\\t\\t\\tto share in the glory and the gains!"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "73",
    "NoteID": "590",
    "Body": "Just a selfish man's thought. Such men are far from being\\n\\t\\t\\t\\ta source of strength to their community. They are no use\\n\\t\\t\\t\\tin a fight, and the next verse by implication discards\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "74",
    "NoteID": "591",
    "Body": "It is not every one,-least of all, poltroons and\\n\\t\\t\\t\\tfaint-hearted persons-who is fit to fight in the cause of\\n\\t\\t\\t\\tAllah. To do so is a privilege, and those who understand\\n\\t\\t\\t\\tthe privilege are prepared to sacrifice all their\\n\\t\\t\\t\\tinterests in this life, and this life itself; for they\\n\\t\\t\\t\\tknow that it is the sacrifice of something fleeting and\\n\\t\\t\\t\\tof little value, for the sake of something everlasting,\\n\\t\\t\\t\\tand of immense value. Whether (in appearance) they win or\\n\\t\\t\\t\\tlose, in reality they win the prize for which they are\\n\\t\\t\\t\\tfighting,-viz., honour and glory in the sight of Allah.\\n\\t\\t\\t\\tNote that the only alternatives here are Death or\\n\\t\\t\\t\\tVictory! The true fighter knows no defeat."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "75",
    "NoteID": "592",
    "Body": "Mustadh'af = one reckoned weak, and therefore ill-treated\\n\\t\\t\\t\\tand oppressed. Cf. iv. 98, and vii. 150."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "75",
    "NoteID": "593",
    "Body": "Even from the human point of view the cause of Allah is\\n\\t\\t\\t\\tthe cause of justice, the cause of the oppressed. In the\\n\\t\\t\\t\\tgreat persecution, before Makkah was won again, what\\n\\t\\t\\t\\tsorrows, threats, tortures, and oppressions, were\\n\\t\\t\\t\\tsuffered by those whose faith was unshaken? Muhammad's\\n\\t\\t\\t\\tlife and that of his adherents was threatened: they were\\n\\t\\t\\t\\tmocked, assaulted, insulted and beaten; those within the\\n\\t\\t\\t\\tpower of the enemy were put into chains and cast into\\n\\t\\t\\t\\tprison; others were boycotted, and shut out of trade,\\n\\t\\t\\t\\tbusiness, and social intercourse; they could not even buy\\n\\t\\t\\t\\tthe food they wanted, or perform their religious duties.\\n\\t\\t\\t\\tThe persecution was redoubled for the believing slaves,\\n\\t\\t\\t\\twomen, and children after the Hijrat. Their cry for a\\n\\t\\t\\t\\tprotector, and helper from Allah was answered when\\n\\t\\t\\t\\tMuhammad the Chosen One brought freedom and peace to\\n\\t\\t\\t\\tMakkah again."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "76",
    "NoteID": "594",
    "Body": "Auliyaa plural of wali, friend, supporter, protector,\\n\\t\\t\\t\\tpatron; from the same root as maula, for which see iv.\\n\\t\\t\\t\\t33, n. 543."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "77",
    "NoteID": "595",
    "Body": "Before the command for fighting was issued there were\\n\\t\\t\\t\\tsome who were impatient, and could scarcely be held back.\\n\\t\\t\\t\\tThey wanted fighting from human motives,- pugnacity,\\n\\t\\t\\t\\thatred against their enemies, the gaining of personal\\n\\t\\t\\t\\tends. Fighting from such motives is wrong at all times.\\n\\t\\t\\t\\tWhen the testing time came, and they had to fight, not\\n\\t\\t\\t\\tfor their own hand, but for a Sacred Cause, in which\\n\\t\\t\\t\\tthere was much suffering and little personal gain, the\\n\\t\\t\\t\\tHypocrites held back and were afraid."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "77",
    "NoteID": "596",
    "Body": "\"Our natural term of life,\" they would say, \"is short\\n\\t\\t\\t\\tenough; why should we jeopardize it by fighting in which\\n\\t\\t\\t\\tthere is no personal gain?\" The answer is begun in this\\n\\t\\t\\t\\tverse and continued in the next. Briefly, the answer is:\\n\\t\\t\\t\\t(1) in any case the pleasures of this world are short;\\n\\t\\t\\t\\tthis life is fleeting; the first thing for a righteous\\n\\t\\t\\t\\tman to do is to emancipate himself from its obsessions;\\n\\t\\t\\t\\t(2) to do your duty is to do right; therefore turn your\\n\\t\\t\\t\\tattention mainly to duty; (3) when duty calls for\\n\\t\\t\\t\\tself-sacrifice, be sure that Allah's call is never\\n\\t\\t\\t\\tunjust, and never such as to exceed your capacity; and\\n\\t\\t\\t\\t(4) if you fear death, you will not by fear escape death;\\n\\t\\t\\t\\tit will find you out wherever you are; why not face it\\n\\t\\t\\t\\tboldly when duty calls?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "78",
    "NoteID": "597",
    "Body": "The Hypocrites were inconsistent, and in this reflect\\n\\t\\t\\t\\tunregenerate mankind. If a disaster happens, due to their\\n\\t\\t\\t\\town folly, they blame somebody else; but if they are\\n\\t\\t\\t\\tfortunate, they claim reflected credit by pretending that\\n\\t\\t\\t\\tHeaven has favoured them because of their own superior\\n\\t\\t\\t\\tmerits. The modern critic discards even this pretence,\\n\\t\\t\\t\\teliminates Heaven altogether, and claims all credit\\n\\t\\t\\t\\tdirect to himself, unless he brings in blind Chance, but\\n\\t\\t\\t\\tthat he does mostly to \"explain\" misfortune. If we look\\n\\t\\t\\t\\tto the ultimate Cause of all things, all things come from\\n\\t\\t\\t\\tAllah. But if we look to the proximate cause of things,\\n\\t\\t\\t\\tour own merit is so small, that we can hardly claim\\n\\t\\t\\t\\tcredit for good ourselves with any fairness. In Allah's\\n\\t\\t\\t\\thand is all good: iii.26. On the other hand, the\\n\\t\\t\\t\\tproximate cause of our evil is due to some wrong in our\\n\\t\\t\\t\\town inner selves; for never are we dealt with unjustly in\\n\\t\\t\\t\\tthe very least: iv. 77."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "79",
    "NoteID": "598",
    "Body": "To blame a man of God for our misfortunes is doubly\\n\\t\\t\\t\\tunjust. For he comes to save us from misfortune, and it\\n\\t\\t\\t\\tis because we flout him or pay no heed to him, that our\\n\\t\\t\\t\\town rebellion, brings its own punishment. If we realise\\n\\t\\t\\t\\tthis truth we shall be saved from two sins: (1) the sin\\n\\t\\t\\t\\tof injustice to Allah's Messengers, who come for our\\n\\t\\t\\t\\tgood, and not for our harm: (2) the sin of not realising\\n\\t\\t\\t\\tour own shortcomings or rebellion, and thus living in\\n\\t\\t\\t\\tspiritual darkness. If the Message is from Allah, that\\n\\t\\t\\t\\tcarries its own authority: \"enough is Allah for a\\n\\t\\t\\t\\twitness.\""
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "80",
    "NoteID": "599",
    "Body": "The Messenger was sent to preach, guide, instruct, and\\n\\t\\t\\t\\tshow the Way,-not to drive people to good. That is not\\n\\t\\t\\t\\tAllah's Plan, which trains the human Will. The\\n\\t\\t\\t\\tMessenger's duty is therefore to convey the Message of\\n\\t\\t\\t\\tAllah, in all the ways of persuasion that are open to\\n\\t\\t\\t\\thim. If men perversely disobey that Message, they are not\\n\\t\\t\\t\\tdisobeying him but they are disobeying Allah. In the same\\n\\t\\t\\t\\tway those who obey the Message are obeying Allah. They\\n\\t\\t\\t\\tare not obliging the Messenger: they are merely doing\\n\\t\\t\\t\\ttheir duty."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "81",
    "NoteID": "600",
    "Body": "If we trust people who are not true, they are more likely\\n\\t\\t\\t\\tto hinder than to help. But Allah is All-good as well as\\n\\t\\t\\t\\tAll-powerful, and all our affairs are best entrusted to\\n\\t\\t\\t\\tHis care. He is the best Guardian of all interests.\\n\\t\\t\\t\\tTherefore we should not trust the lip professions of\\n\\t\\t\\t\\tHypocrites, but trust in Allah. Nor should our confidence\\n\\t\\t\\t\\tin Allah be shaken by any secret plots that enemies hatch\\n\\t\\t\\t\\tagainst us. We should take all human precautions against\\n\\t\\t\\t\\tthem, but having done so, we should put our trust in\\n\\t\\t\\t\\tAllah, Who knows the inner working of events better than\\n\\t\\t\\t\\tany human mind can conceive."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "82",
    "NoteID": "601",
    "Body": "The unity of the Qur-an is admittedly greater than that\\n\\t\\t\\t\\tof any other sacred book. And yet how can we account for\\n\\t\\t\\t\\tit except through the unity of Allah's purpose and\\n\\t\\t\\t\\tdesign? From a mere human point of view, we should have\\n\\t\\t\\t\\texpected much discrepancy, because (1) the Messenger who\\n\\t\\t\\t\\tpromulgated it was not a learned man or philosopher, (2)\\n\\t\\t\\t\\tit was promulgated at various times and in various\\n\\t\\t\\t\\tcircumstances, and (3) it is addressed to all grades of\\n\\t\\t\\t\\tmankind. Yet, when properly understood, its various\\n\\t\\t\\t\\tpieces fit together well even when arranged without any\\n\\t\\t\\t\\tregard to chronological order. There was just the One\\n\\t\\t\\t\\tInspirer and the One Inspired."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "83",
    "NoteID": "602",
    "Body": "In times of war or public panic, thoughtless repetition\\n\\t\\t\\t\\tof gossip is rightly restrained by all effective States.\\n\\t\\t\\t\\tIf false, such news may cause needless alarm: if true, it\\n\\t\\t\\t\\tmay frighten the timid and cause some misgiving even to\\n\\t\\t\\t\\tthe bravest, because the counterpart of it-the\\n\\t\\t\\t\\tpreparations made to meet the danger-is not known.\\n\\t\\t\\t\\tThoughtless news, true or false, may also encourage the\\n\\t\\t\\t\\tenemy. The proper course is quietly to hand all news\\n\\t\\t\\t\\tdirect to those who are in a position to investigate it.\\n\\t\\t\\t\\tThey can then sift it and take suitable measures to\\n\\t\\t\\t\\tcheckmate the enemy. Not to do so, but to deal with news\\n\\t\\t\\t\\teither thoughtlessly or maliciously is to fall directly\\n\\t\\t\\t\\tinto the snares of evil."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "84",
    "NoteID": "603",
    "Body": "The courage of Muhammad was as notable as his wisdom, his\\n\\t\\t\\t\\tgentleness, and his trust in Allah. Facing fearful odds,\\n\\t\\t\\t\\the often stood alone, and took the whole responsibility\\n\\t\\t\\t\\ton himself. But his example and visible trust in Allah\\n\\t\\t\\t\\tinspired and roused the Muslims, and also-speaking purely\\n\\t\\t\\t\\tfrom a human point of view-restrained the fury of his\\n\\t\\t\\t\\tenemies. When we consider that he was Allah's inspired\\n\\t\\t\\t\\tMessenger to carry out His Plan, we can see that nothing\\n\\t\\t\\t\\tcan resist that Plan. If the enemy happens to have\\n\\t\\t\\t\\tstrength, power, or resources, Allah's strength, power,\\n\\t\\t\\t\\tand resources are infinitely greater. If the enemy is\\n\\t\\t\\t\\tmeditating punishment on the righteous for their\\n\\t\\t\\t\\trighteousness. Allah's punishment for such wickedness\\n\\t\\t\\t\\twill be infinitely greater and more effective."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "85",
    "NoteID": "604",
    "Body": "In this fleeting world's chances Allah's providence and\\n\\t\\t\\t\\tjustice may not always appear plain to our eyes. But we\\n\\t\\t\\t\\tare asked to believe that if we help and support a good\\n\\t\\t\\t\\tcause, we share in all its credit and in its eventual\\n\\t\\t\\t\\tvictory. And conversely, we cannot support a bad cause\\n\\t\\t\\t\\twithout sharing in all its evil consequences. If\\n\\t\\t\\t\\tappearances seem against this faith, let us not be\\n\\t\\t\\t\\tdeceived by appearances. For Allah has power over all\\n\\t\\t\\t\\tthings."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "86",
    "NoteID": "605",
    "Body": "The necessary correlative to the command to fight in a\\n\\t\\t\\t\\tgood cause is the command to cultivate sweetness and\\n\\t\\t\\t\\tcordiality in our manners at all times. For fighting is\\n\\t\\t\\t\\tan exceptional necessity while the sweetness of daily\\n\\t\\t\\t\\thuman intercourse is a normal need. Further, we give\\n\\t\\t\\t\\tkindness and courtesy without asking, and return it if\\n\\t\\t\\t\\tpossible in even better terms than we received, or at\\n\\t\\t\\t\\tleast in equally courteous terms. For we arc all\\n\\t\\t\\t\\tcreatures of One God, and shall be brought together\\n\\t\\t\\t\\tbefore Him."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "88",
    "NoteID": "606",
    "Body": "When the desertion of the Hypocrites at Uhud nearly\\n\\t\\t\\t\\tcaused a disaster to the Muslim cause there was great\\n\\t\\t\\t\\tfeeling among the Muslims of Madinah against them. One\\n\\t\\t\\t\\tparty wanted to put them to the sword: another to leave\\n\\t\\t\\t\\tthem alone. The actual policy pursued avoided both\\n\\t\\t\\t\\textremes, and was determined by these verses. It was\\n\\t\\t\\t\\tclear that they were a danger to the Muslim community if\\n\\t\\t\\t\\tthey were admitted into its counsels, and in any case\\n\\t\\t\\t\\tthey were a source of demoralisation. But while every\\n\\t\\t\\t\\tcaution was used, no extreme measures were taken against\\n\\t\\t\\t\\tthem. On the contrary, they were given a chance of making\\n\\t\\t\\t\\tgood. If they made a sacrifice for the cause (\"flee from\\n\\t\\t\\t\\twhat is forbidden,\" see next verse), their conduct purged\\n\\t\\t\\t\\ttheir previous cowardice, and their sincerity entitled\\n\\t\\t\\t\\tthem to be taken back. But if they deserted the Muslim\\n\\t\\t\\t\\tcommunity again, they were treated as enemies, with the\\n\\t\\t\\t\\tadditional penalty of desertion which is enforced by all\\n\\t\\t\\t\\tnations actually at war. Even so, a humane exception was\\n\\t\\t\\t\\tmade in the two cases specified in iv. 90."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "89",
    "NoteID": "607",
    "Body": "Flee: the verbal form which the noun hijrat is derived.\\n\\t\\t\\t\\tBukhari interprets this rightly as fleeing from all that\\n\\t\\t\\t\\tis forbidden. This would include hijrat in the technical\\n\\t\\t\\t\\tsense of leaving a place in which the practice of\\n\\t\\t\\t\\treligion is not allowed. But it is more general. In time\\n\\t\\t\\t\\tof war, if a man is willing to submit to discipline and\\n\\t\\t\\t\\trefrain from infringing orders issued, he has proved his\\n\\t\\t\\t\\tfidelity and may be treated as a member of the community\\n\\t\\t\\t\\tat war. On the other hand if he by false pretences comes\\n\\t\\t\\t\\tinto the inner counsels merely to betray them, he may\\n\\t\\t\\t\\trightly be treated as a traitor or deserter and be\\n\\t\\t\\t\\tpunished for his treason or desertion; or if he escapes,\\n\\t\\t\\t\\the can be treated as an enemy and is entitied to no\\n\\t\\t\\t\\tmercy. He is worse than an enemy: he has claimed to be of\\n\\t\\t\\t\\tyou in order to spy on you, and been all the time helping\\n\\t\\t\\t\\tthe enemy."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "90",
    "NoteID": "608",
    "Body": "Except: the exception refers to \"seize them and slay\\n\\t\\t\\t\\tthem\", the death penalty for repeated desertion. Even\\n\\t\\t\\t\\tafter such desertion, exemption is granted in two cases.\\n\\t\\t\\t\\tOne is where the deserter took asylum with a tribe with\\n\\t\\t\\t\\twhom there was a treaty of peace and amity. Presumably\\n\\t\\t\\t\\tsuch a tribe (even though outside the pale of Islam)\\n\\t\\t\\t\\tmight be trusted to keep the man from fighting against\\n\\t\\t\\t\\tthe forces of Islam-in the modern phrase, to disarm him\\n\\t\\t\\t\\tand render him harmless. The second case for exemption is\\n\\t\\t\\t\\twhere the man from his own heart desires never to take up\\n\\t\\t\\t\\tarms against Islam, though he does not wish to join the\\n\\t\\t\\t\\tforces of Islam, to fight against a hostile tribe\\n\\t\\t\\t\\t(perhaps his own) fighting against Islam. But he must\\n\\t\\t\\t\\tmake a real approach, giving guarantees of his sincerity.\\n\\t\\t\\t\\tIn the modern phrase he would be \"on parole\". But this\\n\\t\\t\\t\\tprovision is much milder than that in modern military\\n\\t\\t\\t\\tcodes, which grant the privilege only to enemy prisoners,\\n\\t\\t\\t\\tnot to those who have deserted from the army granting\\n\\t\\t\\t\\tthem parole. The Hypocrites were in that position, but\\n\\t\\t\\t\\thumanity as well as policy treated them with great\\n\\t\\t\\t\\tleniency."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "91",
    "NoteID": "610",
    "Body": "As opposed to the two classes of deserters to whom\\n\\t\\t\\t\\tclemency may be shown, there is a class which is\\n\\t\\t\\t\\ttreacherous and dangerous and cannot be left alone. They\\n\\t\\t\\t\\ttry to win your confidence, and are all the time in the\\n\\t\\t\\t\\tconfidence of the enemy. Every time they get a chance,\\n\\t\\t\\t\\tthey succumb to the temptation of double-dealing. The\\n\\t\\t\\t\\tbest way of dealing with them is to treat them as open\\n\\t\\t\\t\\tenemies. Keep them not in your midst. If they give you\\n\\t\\t\\t\\tguarantees of peace and do not actually fight against\\n\\t\\t\\t\\tyou, well and good. If not, they are deserters actively\\n\\t\\t\\t\\tfighting in the ranks of the enemy. They have openly\\n\\t\\t\\t\\tgiven you proof, and you can fairly seize and slay them\\n\\t\\t\\t\\tin war as deserters and enemies."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "92",
    "NoteID": "611",
    "Body": "Life is absolutely sacred in the Islamic Brotherhood. But\\n\\t\\t\\t\\tmistakes will sometimes happen, as did happen in the\\n\\t\\t\\t\\tmelee at Uhud, when some Muslims were killed (being\\n\\t\\t\\t\\tmistaken for the enemy) by Muslims. There was no guilty\\n\\t\\t\\t\\tintention: therefore there was no murder. But all the\\n\\t\\t\\t\\tsame, the family of the deceased was entitled to\\n\\t\\t\\t\\tcompensation unless they freely remitted it, and in\\n\\t\\t\\t\\taddition it was provided that the unfortunate man who\\n\\t\\t\\t\\tmade the mistake should free a believing slave. Thus a\\n\\t\\t\\t\\tdeplorable mistake was made the occasion for winning the\\n\\t\\t\\t\\tliberty of a slave who was a Believer, for Islam\\n\\t\\t\\t\\tdiscountenances slavery. The compensation could only be\\n\\t\\t\\t\\tpaid if the deceased belonged to a Muslim society or to\\n\\t\\t\\t\\tsome people at peace with the Muslim society. Obviously\\n\\t\\t\\t\\tit could not be paid if, though the deceased was a\\n\\t\\t\\t\\tBeliever, his people were at war with the Muslim society:\\n\\t\\t\\t\\teven if his people could be reached, it is not fair to\\n\\t\\t\\t\\tincrease the resources of the enemy. If the deceased was\\n\\t\\t\\t\\thimself an enemy at war, obviously the laws of war\\n\\t\\t\\t\\tjustify his being killed in warfare unless he\\n\\t\\t\\t\\tsurrendered. If the man who took life unintentionally has\\n\\t\\t\\t\\tno means from which to free a believing slave or to give\\n\\t\\t\\t\\tcompensation, he must still by an act of strict\\n\\t\\t\\t\\tself-denial (fasting for two whole months running) show\\n\\t\\t\\t\\tthat he is cognizant of the grave nature of the deed he\\n\\t\\t\\t\\thas done and sincerely repentant. I take this to apply to\\n\\t\\t\\t\\tall three cases mentioned: that is, where a Believer\\n\\t\\t\\t\\tkilled a Believer unintentionally and the deceased (1)\\n\\t\\t\\t\\tbelonged to the same community as you, or (2) belonged to\\n\\t\\t\\t\\ta community at war with you, or (3) belonged to a\\n\\t\\t\\t\\tcommunity in alliance with you."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "93",
    "NoteID": "612",
    "Body": "What is mentioned here is the punishment in the\\n\\t\\t\\t\\tHereafter. The legal consequences, enforceable by human\\n\\t\\t\\t\\tsociety, are mentioned in ii. 178, under the rules of\\n\\t\\t\\t\\tQisas. That is, a life should be taken for a life\\n\\t\\t\\t\\tdestroyed, but this should be on a scale of equality: a\\n\\t\\t\\t\\tsingle murder should not commit a whole tribe to a\\n\\t\\t\\t\\tperpetual blood-feud, as in the days of ignorance. But if\\n\\t\\t\\t\\tthe heirs of the man slain accept reasonable\\n\\t\\t\\t\\tcompensation, this should be accepted, and the taking of\\n\\t\\t\\t\\ta life for a life should be put a stop to. This course\\n\\t\\t\\t\\tleads to the saving of life, and is commanded to men of\\n\\t\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "94",
    "NoteID": "613",
    "Body": "Go abroad: dharaba = to travel, to go for jihad, or for\\n\\t\\t\\t\\thonest trade or other service, which if done with pure\\n\\t\\t\\t\\tmotives, counts as service in the cause of Allah. The\\n\\t\\t\\t\\timmediate occasion was in connection with jihad, but the\\n\\t\\t\\t\\twords are general, and can be applied to similar\\n\\t\\t\\t\\tcircumstances. In war (or in peace) we are apt to catch\\n\\t\\t\\t\\tsome worldly advantage by pluming ourselves on our\\n\\t\\t\\t\\tsuperiority in Faith. In war perhaps we want to gain\\n\\t\\t\\t\\tglory or booty by killing a supposed enemy. This is\\n\\t\\t\\t\\twrong. The righteous man, if he is really out in Allah's\\n\\t\\t\\t\\tservice, has more abundant and richer gifts to think of\\n\\t\\t\\t\\tin the Hereafter."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "95",
    "NoteID": "614",
    "Body": "Allah's goodness is promised to all people of Faith. But\\n\\t\\t\\t\\tthere are degrees among men and women of Faith. There are\\n\\t\\t\\t\\tpeople with natural inertia: they do the minimum that is\\n\\t\\t\\t\\trequired of them, but no more. There are people who are\\n\\t\\t\\t\\tweak in will: they are easily frightened. There are\\n\\t\\t\\t\\tpeople who are so strong in will and so firm in faith\\n\\t\\t\\t\\tthat they are determined to conquer every obstacle,\\n\\t\\t\\t\\twhether in their own physical or other infirmities or in\\n\\t\\t\\t\\tthe external world around them. In a time of jihad, when\\n\\t\\t\\t\\tpeople give their all, and even their lives, for the\\n\\t\\t\\t\\tcommon cause, they must be accounted more glorious than\\n\\t\\t\\t\\tthose who sit at home, even though they have good will to\\n\\t\\t\\t\\tthe cause and carry out minor duties in aid. The special\\n\\t\\t\\t\\treward of such self-sacrifice is special forgiveness and\\n\\t\\t\\t\\tmercy, as proceeding from the direct approbation and love\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "97",
    "NoteID": "615",
    "Body": "The immediate occasion for this passage was the question\\n\\t\\t\\t\\tof migration (hijrat) from places where Islam was being\\n\\t\\t\\t\\tpersecuted and suppressed. Obviously the duty of Muslims\\n\\t\\t\\t\\twas to leave such places, even if it involved forsaking\\n\\t\\t\\t\\ttheir homes, and join and strengthen the Muslim community\\n\\t\\t\\t\\tamong whom they could live in peace and with whom they\\n\\t\\t\\t\\tcould help in fighting the evils around them. But the\\n\\t\\t\\t\\tmeaning is wider. Islam does not say: \"Resist not evil.\"\\n\\t\\t\\t\\tOn the contrary it requires a constant, unceasing\\n\\t\\t\\t\\tstruggle against evil. For such struggle it may be\\n\\t\\t\\t\\tnecessary to forsake home and unite and organise and join\\n\\t\\t\\t\\tour brethren in assaulting and overthrowing the fortress\\n\\t\\t\\t\\tof evil. For the Muslim's duty is not only to enjoin good\\n\\t\\t\\t\\tbut to prohibit evil. To make our assault we must be\\n\\t\\t\\t\\tprepared to put ourselves in a position from which such\\n\\t\\t\\t\\tassault would be possible, and Allah's earth is spacious\\n\\t\\t\\t\\tenough for the purpose. \"Position\" includes not only\\n\\t\\t\\t\\tlocal position, but moral and material position. For\\n\\t\\t\\t\\texample, we must shun evil company where we cannot put it\\n\\t\\t\\t\\tdown, but organise a position from which we can put it\\n\\t\\t\\t\\tdown."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "98",
    "NoteID": "616",
    "Body": "If through physical, mental, or moral incapacity, we are\\n\\t\\t\\t\\tunable to fight the good fight, we must nevertheless\\n\\t\\t\\t\\tguard ourselves from it. Allah's gracious Mercy will\\n\\t\\t\\t\\trecognise and forgive our weakness if it is real\\n\\t\\t\\t\\tweakness, and not merely an excuse."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "101",
    "NoteID": "617",
    "Body": "Verse 101 gives permission to shorten four Rakat prayers\\n\\t\\t\\t\\twhen people are on a journey: verses 102-104 deal with\\n\\t\\t\\t\\tcases when they are in danger at war, in face of the\\n\\t\\t\\t\\tenemy. The shortening of prayers in both cases is further\\n\\t\\t\\t\\tgoverned as to details by the practice of the Messenger\\n\\t\\t\\t\\tand his Companions. As to journeys, two questions arise:\\n\\t\\t\\t\\t(1) what constitutes a journey for this purpose? (2) is\\n\\t\\t\\t\\tthe fear of an attack an essential condition for the\\n\\t\\t\\t\\tshortening of the prayers? As to (1), it is best to leave\\n\\t\\t\\t\\tthe matter to discretion, having regard to all the\\n\\t\\t\\t\\tcircumstances of the journey, as in the case of the\\n\\t\\t\\t\\tjourneys which excuse a fast: see ii. 184, n. 190. The\\n\\t\\t\\t\\ttext leaves it to discretion. As to (2), the practice of\\n\\t\\t\\t\\tthe Prophet shows that danger is not an essential\\n\\t\\t\\t\\tcondition; it is merely mentioned as a possible incident.\\n\\t\\t\\t\\tThe Messenger usually shortened the prayers from four\\n\\t\\t\\t\\tRakats to two Rakats in Zuhr (midday prayer), 'Asr\\n\\t\\t\\t\\t(afternoon prayer) and Ishaa (night prayer): the other\\n\\t\\t\\t\\ttwo are in any case short, Fajr (morning prayer) having\\n\\t\\t\\t\\ttwo Rakats and Magrib (evening prayer) having three."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "102",
    "NoteID": "618",
    "Body": "The congregational prayer in danger in face of the enemy\\n\\t\\t\\t\\trests on the principle that the congregation should be\\n\\t\\t\\t\\tdivided into two parties; one party prays while the other\\n\\t\\t\\t\\twatches the enemy, and then the second party comes up to\\n\\t\\t\\t\\tprayers while the first falls back to face the enemy;\\n\\t\\t\\t\\teither party does only one or two Rakats, or about half\\n\\t\\t\\t\\tthe congregational prayer; every precaution is taken to\\n\\t\\t\\t\\tprevent a rush by the enemy; even while at prayers armour\\n\\t\\t\\t\\tand arms need not be put off except when rain is likely\\n\\t\\t\\t\\tto cause inconvenience to the wearer and damage to the\\n\\t\\t\\t\\tarms, or when illness or fatigue causes the wearer's\\n\\t\\t\\t\\tstrength to fail. Details can be varied according to\\n\\t\\t\\t\\tcircumstances, as was actually done by the Prophet at\\n\\t\\t\\t\\tdifferent times."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "103",
    "NoteID": "619",
    "Body": "It means: \"when ye have finished congregational prayers.\"\\n\\t\\t\\t\\tIt allows you to remember Allah individually in any\\n\\t\\t\\t\\tposture possible during the danger. But when the danger\\n\\t\\t\\t\\tis past, the full prayers should be offered at the stated\\n\\t\\t\\t\\ttimes."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "104",
    "NoteID": "620",
    "Body": "Religion should be a source of strength and not of\\n\\t\\t\\t\\tweakness in all our affairs. If we have to struggle hard\\n\\t\\t\\t\\tand suffer hardships, those without faith have to do the\\n\\t\\t\\t\\tsame, with this difference, that the man of Faith is full\\n\\t\\t\\t\\tof hope in Allah, whereas the man without Faith has\\n\\t\\t\\t\\tnothing to sustain him."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "105",
    "NoteID": "621",
    "Body": "The Commentators explain this passage with reference to\\n\\t\\t\\t\\tthe case of Taima ibn Ubairaq, who was nominally a Muslim\\n\\t\\t\\t\\tbut really a Hypocrite, and given to all sorts of wicked\\n\\t\\t\\t\\tdeeds. He was suspected of having stolen a set of armour,\\n\\t\\t\\t\\tand when the trial was hot, he planted the stolen\\n\\t\\t\\t\\tproperty into the house of a Jew, where it was found. The\\n\\t\\t\\t\\tJew denied the charge and accused Taima, but the\\n\\t\\t\\t\\tsympathies of the Muslim community were with Taima on\\n\\t\\t\\t\\taccount of his nominal profession of Islam. The case was\\n\\t\\t\\t\\tbrought to the Prophet, who acquitted the Jew according\\n\\t\\t\\t\\tto the strict principle of justice, as \"guided by Allah.\"\\n\\t\\t\\t\\tAttempts were made to prejudice him and deceive him into\\n\\t\\t\\t\\tusing his authority to favour Taima. When Taima realized\\n\\t\\t\\t\\tthat his punishment was imminent he fled and turned\\n\\t\\t\\t\\tapostate. The general lesson is that the righteous man is\\n\\t\\t\\t\\tfaced with all sorts of subtle wiles; the wicked will try\\n\\t\\t\\t\\tto appeal to his highest sympathies and most honourable\\n\\t\\t\\t\\tmotives to deceive him and use him as an instrument for\\n\\t\\t\\t\\tdefeating justice. He should be careful and cautious, and\\n\\t\\t\\t\\tseek the help of Allah for protection against deception\\n\\t\\t\\t\\tand for firmness in dealing the strictest justice without\\n\\t\\t\\t\\tfear or favour. To do otherwise is to betray a sacred\\n\\t\\t\\t\\ttrust; the trustee must defeat all attempts made to\\n\\t\\t\\t\\tmislead him."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "107",
    "NoteID": "622",
    "Body": "Our souls are a sort of trust with us. We have to guard\\n\\t\\t\\t\\tthem against all temptation. Those who surrender to crime\\n\\t\\t\\t\\tor evil, betray that trust. We are warned against being\\n\\t\\t\\t\\tdeceived into taking their part, induced either by\\n\\t\\t\\t\\tplausible appearances, or by such incentives to\\n\\t\\t\\t\\tpartiality as that they belong to our own people or that\\n\\t\\t\\t\\tsome link connects them with us, whereas when we are out\\n\\t\\t\\t\\tto do justice, we must not allow any irrelevant\\n\\t\\t\\t\\tconsiderations to sway us."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "108",
    "NoteID": "623",
    "Body": "The plots of sinners are known fully to Allah, and He can\\n\\t\\t\\t\\tfully circumvent them if necessary, according to the\\n\\t\\t\\t\\tfulness of His wisdom. The word used is: Compass them\\n\\t\\t\\t\\tround.- Muhit: not only does Allah know all about it, but\\n\\t\\t\\t\\tHe is all round it: if in His wisdom He allows it, it is\\n\\t\\t\\t\\tnot because He has not complete control over it, but\\n\\t\\t\\t\\tbecause, having it as it were enclosed in a complete\\n\\t\\t\\t\\tcircle. He can use it to further His own Plan. Even out\\n\\t\\t\\t\\tof evil He can bring good."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "111",
    "NoteID": "624",
    "Body": "Kasaba = to earn, to gain, to work for something\\n\\t\\t\\t\\tvaluable, to lay up a provision for the future life. We\\n\\t\\t\\t\\tdo a day's labour to earn our livelihood: so in a\\n\\t\\t\\t\\tspiritual sense, whatever good or evil we do in this\\n\\t\\t\\t\\tlife, earns us good or evil in the life to come. In\\n\\t\\t\\t\\tverses 110-112 three cases are considered: (1) if we do\\n\\t\\t\\t\\till and repent, Allah will forgive; (2) if we do ill and\\n\\t\\t\\t\\tdo not repent: thinking that we can hide it, we are\\n\\t\\t\\t\\twrong; nothing is hidden from Allah, and we shall suffer\\n\\t\\t\\t\\tthe full consequences in the life to come, for we can\\n\\t\\t\\t\\tnever evade our personal responsibility: (3) if we do\\n\\t\\t\\t\\till, great or small, and impute it to another, our\\n\\t\\t\\t\\toriginal responsibility for the ill remains, but we add\\n\\t\\t\\t\\tto it something else; for we tie round our necks the\\n\\t\\t\\t\\tguilt of falsehood, which converts even our minor fault\\n\\t\\t\\t\\tinto a great sin, and in any case brands us even in this\\n\\t\\t\\t\\tlife with shame and ignominy."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "114",
    "NoteID": "625",
    "Body": "Usually secrecy is for evil ends, or from questionable\\n\\t\\t\\t\\tmotives, or because the person seeking secrecy is ashamed\\n\\t\\t\\t\\tof himself and knows that if his acts or motives became\\n\\t\\t\\t\\tknown, he would make himself odious. Islam therefore\\n\\t\\t\\t\\tdisapproves of secrecy and loves and enjoins openness in\\n\\t\\t\\t\\tall consultations and doings. But there are three things\\n\\t\\t\\t\\tin which secrecy is permissible, and indeed laudable,\\n\\t\\t\\t\\tprovided the motive be purely unselfish, to earn \"the\\n\\t\\t\\t\\tgood pleasure of Allah\": (1) if you are doing a deed of\\n\\t\\t\\t\\tcharity or beneficence, whether in giving material things\\n\\t\\t\\t\\tor in helping in moral, intellectual, or spiritual\\n\\t\\t\\t\\tmatters; here publicity may not be agreeable to the\\n\\t\\t\\t\\trecipient of your beneficence, and you have to think of\\n\\t\\t\\t\\this feelings; (2) where an unpleasant act of justice or\\n\\t\\t\\t\\tcorrection has to be done; this should be done, but there\\n\\t\\t\\t\\tis no virtue in publishing it abroad and causing\\n\\t\\t\\t\\thumiliation to some parties or adding to their\\n\\t\\t\\t\\thumiliation by publicity; (3) where there is a delicate\\n\\t\\t\\t\\tquestion of conciliating parties to a quarrel; they may\\n\\t\\t\\t\\tbe very touchy about publicity but quite amenable to the\\n\\t\\t\\t\\tinfluence of a man acting in private."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "126",
    "NoteID": "625",
    "Body": "Usually secrecy is for evil ends, or from questionable\\n\\t\\t\\t\\tmotives, or because the person seeking secrecy is ashamed\\n\\t\\t\\t\\tof himself and knows that if his acts or motives became\\n\\t\\t\\t\\tknown, he would make himself odious. Islam therefore\\n\\t\\t\\t\\tdisapproves of secrecy and loves and enjoins openness in\\n\\t\\t\\t\\tall consultations and doings. But there are three things\\n\\t\\t\\t\\tin which secrecy is permissible, and indeed laudable,\\n\\t\\t\\t\\tprovided the motive be purely unselfish, to earn \"the\\n\\t\\t\\t\\tgood pleasure of Allah\": (1) if you are doing a deed of\\n\\t\\t\\t\\tcharity or beneficence, whether in giving material things\\n\\t\\t\\t\\tor in helping in moral, intellectual, or spiritual\\n\\t\\t\\t\\tmatters; here publicity may not be agreeable to the\\n\\t\\t\\t\\trecipient of your beneficence, and you have to think of\\n\\t\\t\\t\\this feelings; (2) where an unpleasant act of justice or\\n\\t\\t\\t\\tcorrection has to be done; this should be done, but there\\n\\t\\t\\t\\tis no virtue in publishing it abroad and causing\\n\\t\\t\\t\\thumiliation to some parties or adding to their\\n\\t\\t\\t\\thumiliation by publicity; (3) where there is a delicate\\n\\t\\t\\t\\tquestion of conciliating parties to a quarrel; they may\\n\\t\\t\\t\\tbe very touchy about publicity but quite amenable to the\\n\\t\\t\\t\\tinfluence of a man acting in private."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "116",
    "NoteID": "626",
    "Body": "Cf. iv. 48 and n. 569. Blasphemy in the spiritual kingdom\\n\\t\\t\\t\\tis like treason in the political kingdom."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "117",
    "NoteID": "627",
    "Body": "The unity, power, and goodness of Allah are so manifest\\n\\t\\t\\t\\tin nature and in the human mind when it is in accord with\\n\\t\\t\\t\\tthe universal spirit, that only the most abject\\n\\t\\t\\t\\tperversion can account for the sin of religious treason.\\n\\t\\t\\t\\tThat sin arises from perverted ideas of sex or perverted\\n\\t\\t\\t\\tideas of self. The perversion of sex is to suppose that\\n\\t\\t\\t\\tsex rules in religious matters. From it arise such\\n\\t\\t\\t\\thorrible creations of the imagination as Kali, the\\n\\t\\t\\t\\tblood-thirsty goddess of India, or Hecate, the goddess of\\n\\t\\t\\t\\trevenge and hate in Greek mythology. Even in beautiful\\n\\t\\t\\t\\tforms like Saraswati (the goddess of learning) or Minerva\\n\\t\\t\\t\\t(the virgin goddess of sport and arts), to say nothing of\\n\\t\\t\\t\\tVenus (the goddess of carnal pleasures), the emphasis\\n\\t\\t\\t\\tlaid on sex destroys a right view of religious nature.\\n\\t\\t\\t\\tPerverted ideas of self are typified in the story of\\n\\t\\t\\t\\tSatan, who was so puffed up with arrogance that he\\n\\t\\t\\t\\tdisobeyed Allah, and Allah cursed him. Both these\\n\\t\\t\\t\\tperversions, if allowed lodgment, completely ruin our\\n\\t\\t\\t\\treligious nature and deface Allah's handiwork. Hence it\\n\\t\\t\\t\\tis not merely an outer sin but one that corrupts us\\n\\t\\t\\t\\tthrough and through."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "118",
    "NoteID": "628",
    "Body": "Satan obtained Allah's permission to tempt man, and this\\n\\t\\t\\t\\twas implied in such free-will as was granted to man by\\n\\t\\t\\t\\tAllah. Satan's boast is that the portion of mankind\\n\\t\\t\\t\\tseduced by him will be so corrupted in their nature that\\n\\t\\t\\t\\tthey will bear a sort of brand that will mark them off as\\n\\t\\t\\t\\this own; or that they will be like a portion assigned to\\n\\t\\t\\t\\thimself."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "119",
    "NoteID": "629",
    "Body": "Satan's deceptions are with false desires, false\\n\\t\\t\\t\\tsuperstitions, and false fears."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "119",
    "NoteID": "630",
    "Body": "Slitting the ears of cattle is just one instance of the\\n\\t\\t\\t\\tsuperstitions to which men become slaves when they run\\n\\t\\t\\t\\tafter false gods. Astrology, magic, and vain beliefs in\\n\\t\\t\\t\\tthings that do not exist lead men away from Allah, the\\n\\t\\t\\t\\tone true God."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "119",
    "NoteID": "631",
    "Body": "To deface the (fair) nature created by Allah; there is\\n\\t\\t\\t\\tboth a physical and a spiritual meaning. We see many\\n\\t\\t\\t\\tkinds of defacements practised on men and animals,\\n\\t\\t\\t\\tagainst their true nature as created by Allah, partly on\\n\\t\\t\\t\\taccount of superstition, partly on account of\\n\\t\\t\\t\\tselfishness. Spiritually the case is even worse. How many\\n\\t\\t\\t\\tnatures are dwarfed or starved and turned from their\\n\\t\\t\\t\\toriginal instincts by cruel superstitions or customs?\\n\\t\\t\\t\\tAllah created man pure: Satan defaces the image."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "123",
    "NoteID": "632",
    "Body": "Personal responsibility is again and again insisted on as\\n\\t\\t\\t\\tthe key-note of Islam. In this are implied faith and\\n\\t\\t\\t\\tright conduct. Faith is not an external thing: it begins\\n\\t\\t\\t\\twith an act of will, but if true and sincere, it affects\\n\\t\\t\\t\\tthe whole being, and leads to right conduct. In this it\\n\\t\\t\\t\\tis distinguished from the kind of faith which promises\\n\\t\\t\\t\\tsalvation because some one else in whom you are asked to\\n\\t\\t\\t\\tbelieve has borne away the sins of men, or the kind of\\n\\t\\t\\t\\tfaith which says that because you are born of a certain\\n\\t\\t\\t\\trace (\"Children of Abraham\") or a certain caste, you are\\n\\t\\t\\t\\tprivileged, and your conduct will be judged by a\\n\\t\\t\\t\\tdifferent standard from that of other men. Whatever you\\n\\t\\t\\t\\tare, if you do evil, you must suffer the consequences,\\n\\t\\t\\t\\tunless Allah's Mercy comes to your help."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "124",
    "NoteID": "633",
    "Body": "Naqir = the groove in a date-stone, a thing of no value\\n\\t\\t\\t\\twhatever. Cf. n. 575 to iv. 53."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "147",
    "NoteID": "633",
    "Body": "Naqir = the groove in a date-stone, a thing of no value\\n\\t\\t\\t\\twhatever. Cf. n. 575 to iv. 53."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "125",
    "NoteID": "634",
    "Body": "Abraham is distinguished in Muslim theology with the\\n\\t\\t\\t\\ttitle of \"Friend of Allah\". This does not of course mean\\n\\t\\t\\t\\tthat he was anything more than a mortal. But his faith\\n\\t\\t\\t\\twas pure and true, and his conduct was firm and righteous\\n\\t\\t\\t\\tin all circumstances. He was the fountainhead of the\\n\\t\\t\\t\\tpresent monotheistic tradition, the Patriarch of the\\n\\t\\t\\t\\tprophetic line, and is revered alike by Jews, Christians\\n\\t\\t\\t\\tand Muslims."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "127",
    "NoteID": "636",
    "Body": "Again and again is it impressed on the community of Islam\\n\\t\\t\\t\\tto be just in their dealings with women, orphans,\\n\\t\\t\\t\\tchildren, and all whose weakness requires special\\n\\t\\t\\t\\tconsideration. The law about widows and orphans,\\n\\t\\t\\t\\tinheritance, dower, and marriage had already been\\n\\t\\t\\t\\tdeclared in iv. 2-35 and further instructions are now\\n\\t\\t\\t\\tgiven on a further reference. It was not right that\\n\\t\\t\\t\\tanyone should take advantage of their helpless position\\n\\t\\t\\t\\tto deprive them of dower or of their portion in\\n\\t\\t\\t\\tinheritance."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "127",
    "NoteID": "637",
    "Body": "Cf. iv. 75. n. 592. Both widows and orphans are to be\\n\\t\\t\\t\\thelped because they are ordinarily weak, ill-treated, and\\n\\t\\t\\t\\toppressed. In communities which base their civil rights\\n\\t\\t\\t\\ton brute strength, the weaker go to the wall, and public\\n\\t\\t\\t\\topinion expects nothing else. In Nietzsche's philosophy\\n\\t\\t\\t\\tof the Superman that doctrine is stressed strongly, and\\n\\t\\t\\t\\tsome of the militarist nations in our own time seem\\n\\t\\t\\t\\tinclined to support this reversion to our primitive\\n\\t\\t\\t\\tinstincts. Even in modern democracies of the saner sort,\\n\\t\\t\\t\\twe are often told that it is the fate of minorities to\\n\\t\\t\\t\\tsuffer; strength of numbers here becomes the passport to\\n\\t\\t\\t\\tpower and privilege. Islam, while upholding sane manly\\n\\t\\t\\t\\tviews in general, enjoins the most solicitous care for\\n\\t\\t\\t\\tthe weak and oppressed in every way-in rights of\\n\\t\\t\\t\\tproperty, in social rights, and in the right to\\n\\t\\t\\t\\topportunities of development. Spiritual strength or\\n\\t\\t\\t\\tweakness does not necessarily go with physical or\\n\\t\\t\\t\\tnumerical strength."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "128",
    "NoteID": "638",
    "Body": "To protect the woman's economic interests, various rules\\n\\t\\t\\t\\tare prescribed for dower in marriage. But the sanctity of\\n\\t\\t\\t\\tmarriage itself is greater than any economic interests.\\n\\t\\t\\t\\tDivorce is, of all things permitted, most hateful to\\n\\t\\t\\t\\tAllah. Therefore if a breach between husband and wife can\\n\\t\\t\\t\\tbe prevented by some economic consideration, it is better\\n\\t\\t\\t\\tto make that concession than to imperil the future of the\\n\\t\\t\\t\\twife, the children, and probably the husband also. Such\\n\\t\\t\\t\\tconcessions are permissible, in view of the love of\\n\\t\\t\\t\\twealth ingrained in unregenerate man, but a\\n\\t\\t\\t\\trecommendation is made that we should practise\\n\\t\\t\\t\\tself-restraint, and do what we can to come to an amicable\\n\\t\\t\\t\\tsettlement without any economic sacrifice on the part of\\n\\t\\t\\t\\tthe woman."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "129",
    "NoteID": "639",
    "Body": "In this material world there are two principle causes of\\n\\t\\t\\t\\tdivision between man and wife, money and \"the other\\n\\t\\t\\t\\twoman\" or \"the other man\". Money was dealt with in the\\n\\t\\t\\t\\tlast verse. Here is the case of \"the other woman\".\\n\\t\\t\\t\\tLegally more than one wife (up to four) are permissible\\n\\t\\t\\t\\ton the condition that the man can be fair and just to\\n\\t\\t\\t\\tall."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "131",
    "NoteID": "640",
    "Body": "Notice the refrain: \"To Allah belong all things in the\\n\\t\\t\\t\\theavens and on earth\": repeated three times, each time\\n\\t\\t\\t\\twith a new application. In the first instance it follows\\n\\t\\t\\t\\tthe statement of Allah's universal providence and love.\\n\\t\\t\\t\\tIf two persons, in spite of every sincere desire to love\\n\\t\\t\\t\\tand comfort each other, fail to achieve that end, and\\n\\t\\t\\t\\thave to separate, Allah's all-reaching bounty never\\n\\t\\t\\t\\tfails, for He is the Lord of all things. In the second\\n\\t\\t\\t\\tinstance it is connected with Allah's Self-existence,\\n\\t\\t\\t\\tSelf-excellence, and independence of all creatures: all\\n\\t\\t\\t\\tHis commands are for our good, and they are given to all\\n\\t\\t\\t\\tHis creatures, according to their capacities. In the\\n\\t\\t\\t\\tthird instance, it is connected with His universal power;\\n\\t\\t\\t\\tfor He could destroy any individual or nation and create\\n\\t\\t\\t\\ta new one without any loss to Himself; but He gives a\\n\\t\\t\\t\\tchance to all again and again, and even rewards them\\n\\t\\t\\t\\tbeyond their own ambitions."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "131",
    "NoteID": "641",
    "Body": "Allah's existence is absolute existence. It does not\\n\\t\\t\\t\\tdepend on any other person or any other thing. And it is\\n\\t\\t\\t\\tworthy of all praise, for it is all-good and comprises\\n\\t\\t\\t\\tevery possible excellence. It is necessary to stress this\\n\\t\\t\\t\\tpoint in order to show that the moral law for man is not\\n\\t\\t\\t\\ta mere matter of transcendental commands, but really\\n\\t\\t\\t\\trests on the essential needs of mankind itself. If\\n\\t\\t\\t\\ttherefore such schools of thought as Behaviourism proved\\n\\t\\t\\t\\ttheir theories up to the hilt, they do not affect the\\n\\t\\t\\t\\tposition of Islam in the least. The highest ethical\\n\\t\\t\\t\\tstandards are enjoined by Islam, not as dogmatic\\n\\t\\t\\t\\timperatives, but because they can be shown to follow from\\n\\t\\t\\t\\tthe needs of man's nature and the results of man's\\n\\t\\t\\t\\texperience."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "132",
    "NoteID": "642",
    "Body": "This refers to the next verse. He does not need us, but\\n\\t\\t\\t\\twe need Him. Our hopes, our happiness, our success centre\\n\\t\\t\\t\\tin Him; but He is Self-sufficient. He has the power to\\n\\t\\t\\t\\tsupersede us, but His goodness is ever seeking to give us\\n\\t\\t\\t\\tevery chance in this world as well as in the Hereafter."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "134",
    "NoteID": "643",
    "Body": "Man in this life can only see up to the horizon of this\\n\\t\\t\\t\\tlife. The highest rewards which his wishes or ambitions\\n\\t\\t\\t\\tcan conceive of are conceived in the terms of this life.\\n\\t\\t\\t\\tBut Allah can give him not only these but something\\n\\t\\t\\t\\tinfinitely higher, the rewards of the Hereafter, which it\\n\\t\\t\\t\\tdid not even enter his heart to ask for or his\\n\\t\\t\\t\\timagination to conceive."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "135",
    "NoteID": "645",
    "Body": "Some people may be inclined to favour the rich, because\\n\\t\\t\\t\\tthey expect something from them. Some people may be\\n\\t\\t\\t\\tinclined to favour the poor because they are generally\\n\\t\\t\\t\\thelpless. Partiality in either case is wrong. Be just,\\n\\t\\t\\t\\twithout fear of favour. Both the rich and the poor are\\n\\t\\t\\t\\tunder Allah's protection as far as their legitimate\\n\\t\\t\\t\\tinterests are concerned, but they cannot expect to be\\n\\t\\t\\t\\tfavoured at the expense of others. And He can protect\\n\\t\\t\\t\\ttheir interests far better than any man."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "136",
    "NoteID": "646",
    "Body": "If your belief is by habit or birth or the example of\\n\\t\\t\\t\\tthose you love or respect or admire, make that belief\\n\\t\\t\\t\\tmore specific and personal to yourself. We must not only\\n\\t\\t\\t\\thave faith, but realise that faith in our inmost being.\\n\\t\\t\\t\\tThe chief objects of our Faith are Allah, His Messenger,\\n\\t\\t\\t\\tand His Revelations. To all these we must give a home in\\n\\t\\t\\t\\tour hearts. The angels we do not see and realise as we\\n\\t\\t\\t\\trealise Allah, who is nearer to us than the vehicle of\\n\\t\\t\\t\\tour life-blood, and the Day of Judgment is for our future\\n\\t\\t\\t\\texperience, but we must not deny them, or we cut off a\\n\\t\\t\\t\\tpart of our religious view."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "137",
    "NoteID": "647",
    "Body": "Those who go on changing sides again and again can have\\n\\t\\t\\t\\tno real Faith at any time. Their motives are mere worldy\\n\\t\\t\\t\\tdouble-dealing. How can they expect Allah's grace or\\n\\t\\t\\t\\tforgiveness? Here is a clear warning against those who\\n\\t\\t\\t\\tmake their religion a mere matter of worldly convenience.\\n\\t\\t\\t\\tTrue religion goes far deeper. It transforms the very\\n\\t\\t\\t\\tnature of man. After that transformation it is as\\n\\t\\t\\t\\timpossible for him to change as it is for light to become\\n\\t\\t\\t\\tdarkness."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "139",
    "NoteID": "648",
    "Body": "If the motive is some advantage, some honour,-the\\n\\t\\t\\t\\tfountain of all good is Allah. How can it really be\\n\\t\\t\\t\\texpected from those who deny Faith? And if there is some\\n\\t\\t\\t\\tshow of worldly honour, what is it worth against the\\n\\t\\t\\t\\tcontempt they earn in the next world?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "140",
    "NoteID": "649",
    "Body": "Cf. vi. 68, an earlier and Makkan verse. Where we see or\\n\\t\\t\\t\\thear Truth held in light esteem, we ought to make our\\n\\t\\t\\t\\tprotest and withdraw from such company, not out of\\n\\t\\t\\t\\tarrogance, as if we thought ourselves superior to other\\n\\t\\t\\t\\tpeople, but out of real humility, lest our own nature be\\n\\t\\t\\t\\tcorrupted in such society. But it is possible that our\\n\\t\\t\\t\\tprotest or our sincere remonstrance may change the theme\\n\\t\\t\\t\\tof discourse. In that case we have done good to those who\\n\\t\\t\\t\\twere inclined to hold Truth in light esteem, for we have\\n\\t\\t\\t\\tsaved them for ridiculing Truth."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "143",
    "NoteID": "651",
    "Body": "If we choose evil deliberately and double our guilt by\\n\\t\\t\\t\\tfraud and deception, we do not deceive Allah, but we\\n\\t\\t\\t\\tdeceive ourselves. We deprive ourselves of the Grace of\\n\\t\\t\\t\\tAllah, and are left straying away from the Path. In that\\n\\t\\t\\t\\tcondition who can guide us or show us the Way? Our true\\n\\t\\t\\t\\tand right instincts become blunted: our fraud makes us\\n\\t\\t\\t\\tunstable in character; when our fellow-men find out our\\n\\t\\t\\t\\tfraud, any advantages we may have gained by the fraud are\\n\\t\\t\\t\\tlost; and we become truly distracted in mind."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "146",
    "NoteID": "652",
    "Body": "Even Hypocrites can obtain forgiveness, on four\\n\\t\\t\\t\\tconditions: (1) sincere repentance, which purifies their\\n\\t\\t\\t\\tmind; (2) amendment of their conduct, which purifies\\n\\t\\t\\t\\ttheir outer life; (3) steadfastness and devotion to\\n\\t\\t\\t\\tAllah, which strengthens their faith and protects them\\n\\t\\t\\t\\tfrom the assaults of evil, and (4) sincerity in their\\n\\t\\t\\t\\treligion, or their whole inner being, which brings them\\n\\t\\t\\t\\tas full members into the goodly Fellowship of Faith."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "148",
    "NoteID": "654",
    "Body": "We can make a public scandal of evil in many ways. (1) It\\n\\t\\t\\t\\tmay be idle sensation-mongering: it often leads to more\\n\\t\\t\\t\\tevil by imitation, as where criminal deeds are glorified\\n\\t\\t\\t\\tin a cinema, or talked about shamelessly in a novel or\\n\\t\\t\\t\\tdrama. (2) It may be malicious gossip of a foolish,\\n\\t\\t\\t\\tpersonal kind: it does no good, but it hurts people's\\n\\t\\t\\t\\tfeelings. (3) It may be malevolent slander or libel: it\\n\\t\\t\\t\\tis intended deliberately to cause harm to people's\\n\\t\\t\\t\\treputation or injure them in other ways, and is rightly\\n\\t\\t\\t\\tpunishable under all laws. (4) It may be a public rebuke\\n\\t\\t\\t\\tor correction or remonstrance, without malice. (1), (2)\\n\\t\\t\\t\\tand (3) are absolutely forbidden. (4) may be by a person\\n\\t\\t\\t\\tin authority; in which case the exception applies, for\\n\\t\\t\\t\\tall wrong or injustice must be corrected openly, to\\n\\t\\t\\t\\tprevent its recurrence. Or (4) may be a person not vested\\n\\t\\t\\t\\twith authority, but acting either from motives of public\\n\\t\\t\\t\\tspirit, or in order to help some one who has been\\n\\t\\t\\t\\twronged; here again the exception will apply. But if the\\n\\t\\t\\t\\tmotive is different, the exception does not apply. (4)\\n\\t\\t\\t\\twould also include a public complaint by a person who has\\n\\t\\t\\t\\tsuffered a wrong; he has every right to seek public\\n\\t\\t\\t\\tredress."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "149",
    "NoteID": "655",
    "Body": "Qadir.- The root qadara not only implies power, ability,\\n\\t\\t\\t\\tstrength, but two other ideas which it is difficult to\\n\\t\\t\\t\\tconvey in a single word, viz., the act and power of\\n\\t\\t\\t\\testimating the true value of a thing or persons, as in\\n\\t\\t\\t\\tvi. 91; and the act and power of regulating something so\\n\\t\\t\\t\\tas to bring it into correspondence with something.\\n\\t\\t\\t\\t\"Judgment of values\" I think sums up these finer shades\\n\\t\\t\\t\\tof meaning. Allah forgives what is wrong and is able\\n\\t\\t\\t\\tfully to appreciate and judge of the value of our good\\n\\t\\t\\t\\tdeeds whether we publish them or conceal them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "150",
    "NoteID": "656",
    "Body": "Unbelief takes various forms. Three are mentioned here:\\n\\t\\t\\t\\t(1) denial of Allah and His revelation to mankind through\\n\\t\\t\\t\\tinspired men; (2) a sort of nominal belief in Allah and\\n\\t\\t\\t\\tHis Prophets, but one which is partial, and mixed up with\\n\\t\\t\\t\\tracial pride, which does not allow of the recognition of\\n\\t\\t\\t\\tany Messengers beyond those of a particular race; and (3)\\n\\t\\t\\t\\ta nominal belief in universal revelation, but so hedged\\n\\t\\t\\t\\tround with peculiar doctrines of exclusive salvation,\\n\\t\\t\\t\\tthat it practically approaches to a denial of Allah's\\n\\t\\t\\t\\tuniversal love for all mankind and all Creation. All\\n\\t\\t\\t\\tthree amount to Unbelief, for they really deny Allah's\\n\\t\\t\\t\\tuniversal love and care."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "153",
    "NoteID": "657",
    "Body": "Cf. ii. 55, for the thunder and lightning which affected\\n\\t\\t\\t\\tthose who were presumptuous enough to ask that they\\n\\t\\t\\t\\tshould see Allah face to face, and ii. 51, and n. 66, for\\n\\t\\t\\t\\tthe worship of the golden calf. The lesson is that it is\\n\\t\\t\\t\\tpresumptuous on the part of man to judge of spiritual\\n\\t\\t\\t\\tthings in terms of material things, or to ask to see\\n\\t\\t\\t\\tAllah with their material eyes when Allah is above\\n\\t\\t\\t\\tmaterial forms and is independent of time and space."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "154",
    "NoteID": "658",
    "Body": "In this verse there is a recapitulation of three salient\\n\\t\\t\\t\\tincidents of Jewish refractoriness already referred to in\\n\\t\\t\\t\\tthe second Sura: viz., (1) the Covenant under the\\n\\t\\t\\t\\ttowering height of Sinai, ii. 63: (2) their arrogance\\n\\t\\t\\t\\twhere they were commanded humility in entering a town,\\n\\t\\t\\t\\tii. 58: and (3) their transgression of the Sabbath, ii.\\n\\t\\t\\t\\t65."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "155",
    "NoteID": "659",
    "Body": "In verses 155, 156, 157, 160 (latter half), and 161 with\\n\\t\\t\\t\\tparenthetical clauses including those in verses 158-159,\\n\\t\\t\\t\\tand 160 (first half), there is a catalogue of the\\n\\t\\t\\t\\tiniquities of which the Jews were guilty, and for these\\n\\t\\t\\t\\tiniquities we must understand some such words as: \"They\\n\\t\\t\\t\\tare under divine displeasure.\" Each clause of the\\n\\t\\t\\t\\tindictment I have indicated by prefixing the word \"that.\""
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "155",
    "NoteID": "660",
    "Body": "Cf. iii. 21, and nn. 363 and 364."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "155",
    "NoteID": "661",
    "Body": "Cf. ii. 88, and n. 92, where the full meaning is\\n\\t\\t\\t\\texplained. Note the crescendo (heightening effect) in the\\n\\t\\t\\t\\targument. Their iniquities were: (1) that they broke\\n\\t\\t\\t\\ttheir Covenant: (2) that they rejected Allah's guidance\\n\\t\\t\\t\\tas conveyed in His signs; (3) that they killed Allah's\\n\\t\\t\\t\\tMessengers and incurred a double guilt, viz., that of\\n\\t\\t\\t\\tmurder and that of a deliberate defiance of Allah's law;\\n\\t\\t\\t\\tand (4) that they imagined themselves arrogantly\\n\\t\\t\\t\\tself-sufficient, which means a blasphemous closing of\\n\\t\\t\\t\\ttheir hearts forever against the admission of Allah's\\n\\t\\t\\t\\tgrace. Then begins another series of iniquities from a\\n\\t\\t\\t\\tdifferent point of view: (1) that they rejected Faith:\\n\\t\\t\\t\\t(2) that they made false charges against a saintly woman\\n\\t\\t\\t\\tlike Mary, who was chosen by Allah to be the mother of\\n\\t\\t\\t\\tJesus; (3) that they boasted of having killed Jesus when\\n\\t\\t\\t\\tthey were victims of their own self-hallucination: (4)\\n\\t\\t\\t\\tthat they hindered people from Allah's way: and (5) that\\n\\t\\t\\t\\tby means of usury and fraud they oppressed their\\n\\t\\t\\t\\tfellow-men."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "156",
    "NoteID": "662",
    "Body": "The false charge against Mary was that she was unchaste.\\n\\t\\t\\t\\tCf. xix. 27-28. Such a charge is bad enough to make\\n\\t\\t\\t\\tagainst any woman, but to make it against Mary, the\\n\\t\\t\\t\\tmother of Jesus, was to bring into ridicule Allah's power\\n\\t\\t\\t\\titself. Islam is specially strong in guarding the\\n\\t\\t\\t\\treputation of women. Slanderers of women are bound to\\n\\t\\t\\t\\tbring four witnesses in support of their accusations, and\\n\\t\\t\\t\\tif they fail to produce four witnesses, they are to be\\n\\t\\t\\t\\tflogged with eighty stripes and debarred from being\\n\\t\\t\\t\\tcompetent witnesses: xxiv. 4."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "157",
    "NoteID": "663",
    "Body": "The end of the life of Jesus on earth is as much involved\\n\\t\\t\\t\\tin mystery as his birth, and indeed the greater part of\\n\\t\\t\\t\\this private life, except the three main years of his\\n\\t\\t\\t\\tministry. It is not profitable to discuss the many doubts\\n\\t\\t\\t\\tand conjectures among the early Christian sects and among\\n\\t\\t\\t\\tMuslim theologians. The Orthodox Christian Churches make\\n\\t\\t\\t\\tit a cardinal point of their doctrine that his life was\\n\\t\\t\\t\\ttaken on the Cross, that he died and was buried, that on\\n\\t\\t\\t\\tthe third day he rose in the body with his wounds intact,\\n\\t\\t\\t\\tand walked about and conversed, and ate with his\\n\\t\\t\\t\\tdisciples, and was afterwards taken up bodily to heaven.\\n\\t\\t\\t\\tThis is necessary for the theological doctrine of blood\\n\\t\\t\\t\\tsacrifice and vicarious atonement for sins, which is\\n\\t\\t\\t\\trejected by Islam. But some of the early Christian sects\\n\\t\\t\\t\\tdid not believe that Christ was killed on the Cross. The\\n\\t\\t\\t\\tBasilidans believed that some one else was substituted\\n\\t\\t\\t\\tfor him. The Docetae held that Christ never had a real\\n\\t\\t\\t\\tphysical or natural body, but only an apparent or phantom\\n\\t\\t\\t\\tbody, and that his Crucifixion was only apparent, not\\n\\t\\t\\t\\treal. The Marcionite Gospel (about A.D. 138) denied that\\n\\t\\t\\t\\tJesus was born, and merely said that he appeared in human\\n\\t\\t\\t\\tform. The Gospel of St. Barnabas supported the theory of\\n\\t\\t\\t\\tsubstitution on the Cross. The Quranic teaching is that\\n\\t\\t\\t\\tChrist was not crucified nor killed by the Jews,\\n\\t\\t\\t\\tnotwithstanding certain apparent circumstances which\\n\\t\\t\\t\\tproduced that illusion in the minds of some of his\\n\\t\\t\\t\\tenemies: that disputations, doubts, and conjectures on\\n\\t\\t\\t\\tsuch matters are vain; and that he was taken up to Allah\\n\\t\\t\\t\\t(see next verse and note)."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "158",
    "NoteID": "664",
    "Body": "There is difference of opinion as to the exact\\n\\t\\t\\t\\tinterpretation of this verse. The words are: The Jews did\\n\\t\\t\\t\\tnot kill Jesus, but Allah raised him up (rafa'u) to\\n\\t\\t\\t\\tHimself. One school holds that Jesus did not die the\\n\\t\\t\\t\\tusual human death, but still lives in the body in heaven,\\n\\t\\t\\t\\twhich is the generally accepted Muslim view."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "159",
    "NoteID": "665",
    "Body": "Before his death: Interpreters are not agreed as to the\\n\\t\\t\\t\\texact meaning. Those who hold that Jesus did not die\\n\\t\\t\\t\\trefer the pronoun \"his\" to Jesus. They say that Jesus is\\n\\t\\t\\t\\tstill living in the body and that he will appear just\\n\\t\\t\\t\\tbefore the Final Day, after the coming of the Mahdi, when\\n\\t\\t\\t\\tthe world will be purified of sin and unbelief. There\\n\\t\\t\\t\\twill be a final death before the final Resurrection, but\\n\\t\\t\\t\\tall will have believed before that final death. Others\\n\\t\\t\\t\\tthink that \"his\" is better referred to \"none of the\\n\\t\\t\\t\\tPeople of the Book\", and that the emphatic form \"must\\n\\t\\t\\t\\tbelieve\" (la-yu' minanna) denotes more a question of duty\\n\\t\\t\\t\\tthan of fact."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "159",
    "NoteID": "666",
    "Body": "Cf. iv. 41"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "160",
    "NoteID": "667",
    "Body": "Cf. vi. 146. The ceremonial law of the Jews forbade the\\n\\t\\t\\t\\teating of the flesh of the camel, rabbit and hare\\n\\t\\t\\t\\t(Leviticus xi. 4-6), and the fat of oxen, sheep, and\\n\\t\\t\\t\\tgoats (Leviticus vii. 23), and was in other respects very\\n\\t\\t\\t\\tstrict."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "163",
    "NoteID": "668",
    "Body": "First we have a general statement: that inspiration was\\n\\t\\t\\t\\tsent to many Messengers, and the inspiration was of the\\n\\t\\t\\t\\tsame kind as that sent to the Prophet Muhammmad, for\\n\\t\\t\\t\\tAllah's Message is one. Note that what is spoken of here\\n\\t\\t\\t\\tis Inspiration, not necessarily a Book. Every nation or\\n\\t\\t\\t\\tgroup of people had a messenger: x. 47. Some of these\\n\\t\\t\\t\\tmessengers have been mentioned by name in the Qur-an, and\\n\\t\\t\\t\\tsome not: iv. 164."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "163",
    "NoteID": "669",
    "Body": "Cf. ii. 136 and iii. 84. The list here given is in three\\n\\t\\t\\t\\tgroups. (1) The first group, Abraham's family, is the\\n\\t\\t\\t\\tsame as in ii. 136, (where see the note) and in iii. 84.\\n\\t\\t\\t\\t(2) Then we have the prophets Jesus, Job and Jonah, who\\n\\t\\t\\t\\tsymbolise patience and perseverance. (3) Then we have\\n\\t\\t\\t\\tAaron the priest and Solomon the King, both great\\n\\t\\t\\t\\tfigures, but each subordinate to another primary figure,\\n\\t\\t\\t\\tviz., Moses (mentioned in the next verse) and David\\n\\t\\t\\t\\t(mentioned at the end of this verse). David's distinction\\n\\t\\t\\t\\twas the Psalms, some of which are still extant. Though\\n\\t\\t\\t\\ttheir present form is different from the original and\\n\\t\\t\\t\\tthey do undoubtedly include Pslams not written by David,\\n\\t\\t\\t\\tthe collection contains much devotional poetry of a high\\n\\t\\t\\t\\torder."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "164",
    "NoteID": "670",
    "Body": "Allah spoke to Moses on Mount Sinai. Hence the title of\\n\\t\\t\\t\\tMoses in Muslim theology: Kalim-ullah: the one to whom\\n\\t\\t\\t\\tAllah spoke."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "165",
    "NoteID": "671",
    "Body": "Every prophet proclaims Allah's goodness to the righteous\\n\\t\\t\\t\\tand forgiveness to those who repent, (good news), and the\\n\\t\\t\\t\\tWrath to come for those who reject Faith and live in\\n\\t\\t\\t\\tiniquity (warning). Their mission of warning is a prelude\\n\\t\\t\\t\\tand complement to their mission of good news. No one can\\n\\t\\t\\t\\tthen say that he or she did not know."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "166",
    "NoteID": "672",
    "Body": "Inspiration, though it is clothed in human language, and\\n\\t\\t\\t\\tshaped to the personality of the inspired one, proceeds\\n\\t\\t\\t\\tfrom the knowledge of Allah."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "169",
    "NoteID": "673",
    "Body": "Easy-not in the sense that Allah takes any pleasure in\\n\\t\\t\\t\\tany of His creatures going astray. The contrary is the\\n\\t\\t\\t\\tcase: for Allah's Grace recognises all good in us to such\\n\\t\\t\\t\\tan extent that it is compared to gratitude in iv. 147:\\n\\t\\t\\t\\tsee n. 653. We must understand easy in the sense that\\n\\t\\t\\t\\tAllah is Supreme in knowledge and power; if any forces of\\n\\t\\t\\t\\trebellion foolishly think that they can evade punishment,\\n\\t\\t\\t\\tthey are mistaken. Punishment comes as a matter of\\n\\t\\t\\t\\tcourse. It is not a matter of difficulty or exertion on\\n\\t\\t\\t\\tthe part of Allah."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "170",
    "NoteID": "674",
    "Body": "Allah's solicitude for us is for our own good, not\\n\\t\\t\\t\\tbecause He gets any advantage from it. For He is\\n\\t\\t\\t\\tindependent of all things, and everything declares His\\n\\t\\t\\t\\tglory and praise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "171",
    "NoteID": "675",
    "Body": "Just as a foolish servant may go wrong by excess of zeal\\n\\t\\t\\t\\tfor his master, so in religion people's excesses may lead\\n\\t\\t\\t\\tthem to blasphemy or a spirit the very opposite of\\n\\t\\t\\t\\treligion. The Jewish excesses in the direction of\\n\\t\\t\\t\\tformalism, racialism, exclusiveness, and rejection of\\n\\t\\t\\t\\tChrist Jesus have been denounced in many places. Here the\\n\\t\\t\\t\\tChristian attitude is condemned, which raises Jesus to an\\n\\t\\t\\t\\tequality with Allah: in some cases venerates Mary almost\\n\\t\\t\\t\\tto idolatry: attributes a physical son to Allah: and\\n\\t\\t\\t\\tinvents the doctrine of the Trinity, opposed to all\\n\\t\\t\\t\\treason, which according to the Athanasian Creed, unless a\\n\\t\\t\\t\\tman believes, he is doomed to hell for ever. Let our\\n\\t\\t\\t\\tMuslims also beware lest they fall into excesses either\\n\\t\\t\\t\\tin doctrine or in formalism."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "171",
    "NoteID": "676",
    "Body": "Christ's attributes are mentioned: (1) that he was the\\n\\t\\t\\t\\tson of a woman, Mary, and therefore a man; (2) but a\\n\\t\\t\\t\\tmessenger, a man with a mission from Allah, and therefore\\n\\t\\t\\t\\tentitied to honour; (3) a Word bestowed on Mary, for he\\n\\t\\t\\t\\twas created by Allah's word \"Be\" (kun), and he was: iii.\\n\\t\\t\\t\\t59; (4) a spirit proceeding from Allah, but not Allah:\\n\\t\\t\\t\\this life and his mission were more limited than in the\\n\\t\\t\\t\\tcase of some other Messengers, though we must pay equal\\n\\t\\t\\t\\thonour to him as a Prophet of Allah. The doctrines of\\n\\t\\t\\t\\tTrinity, equality with Allah, and sonship, are repudiated\\n\\t\\t\\t\\tas blasphemies. Allah is independent of all needs and has\\n\\t\\t\\t\\tno need of a son to manage His affairs. The Gospel of\\n\\t\\t\\t\\tJohn (whoever wrote it) has put in a great deal of\\n\\t\\t\\t\\tAlexandrian and Gnostic mysticism round the doctrine of\\n\\t\\t\\t\\tthe Word (Greek, Logos), but it is simply explained here."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "172",
    "NoteID": "677",
    "Body": "Christ often watched and prayed, as a humble worshipper\\n\\t\\t\\t\\tof Allah; and his agony in the Garden of Gethsemane was\\n\\t\\t\\t\\tfull of human dignity, suffering, and self- humiliation\\n\\t\\t\\t\\t(see Matt. xxvi. 36-45)."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "172",
    "NoteID": "678",
    "Body": "The disdainful and the arrogant are the crew of Satan,\\n\\t\\t\\t\\twho will be gathered together before the Supreme Throne\\n\\t\\t\\t\\tfor punishment."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "174",
    "NoteID": "678",
    "Body": "The disdainful and the arrogant are the crew of Satan,\\n\\t\\t\\t\\twho will be gathered together before the Supreme Throne\\n\\t\\t\\t\\tfor punishment."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "175",
    "NoteID": "680",
    "Body": "The Mercy and Grace are expressed here as specially\\n\\t\\t\\t\\tbestowed by Him."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "176",
    "NoteID": "681",
    "Body": "This verse supplements the rule of inheritance of the\\n\\t\\t\\t\\testate of a deceased person who has left as heir neither\\n\\t\\t\\t\\ta descendant nor an ascendant. We shall call such a\\n\\t\\t\\t\\tperson A, who may be either a male or a female. In iv. 12\\n\\t\\t\\t\\t(second half), A's case was considered where he had left\\n\\t\\t\\t\\tuterine brothers or sisters. Here A's case is considered\\n\\t\\t\\t\\twhere he has left brothers and or sisters by the father's\\n\\t\\t\\t\\tside, whether the mother was the same or not. \"Brothers\"\\n\\t\\t\\t\\tand \"sisters\" in this verse must be construed to be such\\n\\t\\t\\t\\tbrothers and sisters. For the sake of clearness, I have\\n\\t\\t\\t\\texpanded the terse language of the original in the\\n\\t\\t\\t\\ttranslation. Let me explain it more concretely in this\\n\\t\\t\\t\\tnote. A, and \"brother\" and \"sister\" being strictly\\n\\t\\t\\t\\tdefined as above, we proceed to consider how A's\\n\\t\\t\\t\\tinheritance would be divided. If A left a widow or\\n\\t\\t\\t\\twidower, the widow's or widower's share would first be\\n\\t\\t\\t\\tcalculated as in the first half of iv. 12; if A left no\\n\\t\\t\\t\\tspouse, this calculation would not be necessary. Then if\\n\\t\\t\\t\\tA left a single \"sister,\" she would have a half share,\\n\\t\\t\\t\\tthe remaining half (in so for as it, or a part of it,\\n\\t\\t\\t\\tdoes not fall to a spouse, if any) going to remoter\\n\\t\\t\\t\\theirs: if a single \"brother,\" he would have the whole\\n\\t\\t\\t\\t(subject to the spouse's right if there is a spouse); if\\n\\t\\t\\t\\tmore than one \"brother,\" they divide the whole (subject\\n\\t\\t\\t\\tto etc.). If A left two or more \"sisters,\" they get\\n\\t\\t\\t\\tbetween them two-thirds, subject to the spouse's right,\\n\\t\\t\\t\\tif any. If A left a \"brother\" and \"sister,\" or \"brothers\"\\n\\t\\t\\t\\tand \"sisters,\" they divide on the basis that each\\n\\t\\t\\t\\t\"brother's\" share is twice that of the \"sister\" (subject\\n\\t\\t\\t\\tto, etc.). In all cases debts, funeral expenses, and\\n\\t\\t\\t\\tlegacies (to the amount allowed) have priority as in n.\\n\\t\\t\\t\\t522."
  }
]
