[
  {
    "SurahNumber": "55",
    "AyahNumber": "2",
    "NoteID": "5172",
    "Body": "The Revelation comes from Allah Most Gracious, and it is\\n\\t\\t\\t\\tone of the greatest Signs of His grace and favour. He is\\n\\t\\t\\t\\tthe source of all Light, and His light is diffused\\n\\t\\t\\t\\tthroughout the universe."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "4",
    "NoteID": "5173",
    "Body": "Bayan: intelligent speech: power of expression: capacity\\n\\t\\t\\t\\tto understand clearly the relations of things and to\\n\\t\\t\\t\\texplain them. Allah has given this to man, and besides\\n\\t\\t\\t\\tthis revelation in man's own heart, has aided him with\\n\\t\\t\\t\\trevelation in nature and revelation through prophets and\\n\\t\\t\\t\\tmessengers."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "5",
    "NoteID": "5174",
    "Body": "In the great astronomical universe there are exact\\n\\t\\t\\t\\tmathematical laws, which bear witness to Allah's Wisdom\\n\\t\\t\\t\\tand also to His favours to His creatures; for we all\\n\\t\\t\\t\\tprofit by the heat and light, the seasons, and the\\n\\t\\t\\t\\tnumerous changes in the tides and the atmosphere, on\\n\\t\\t\\t\\twhich the constitution of our globe and the maintenance\\n\\t\\t\\t\\tof life depend."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "6",
    "NoteID": "5175",
    "Body": "Najm: may mean stars collectively, or herbs collectively:\\n\\t\\t\\t\\tperhaps both meanings are implied."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "6",
    "NoteID": "5176",
    "Body": "All nature adores Allah. Cf. xxii. 18, and n. 2790; xiii.\\n\\t\\t\\t\\t15; and xvi. 48-49."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "7",
    "NoteID": "5177",
    "Body": "The \"balance of justice\" in this verse is connected with\\n\\t\\t\\t\\t\"the Balance\" in the next two verses, that men may act\\n\\t\\t\\t\\tjustly to each other and observe due balance in all their\\n\\t\\t\\t\\tactions, following the golden mean and not transgressing\\n\\t\\t\\t\\tdue bounds in anything. But the Balance is also connected\\n\\t\\t\\t\\tfiguratively with the heavens above in three symbols: (1)\\n\\t\\t\\t\\tJustice is a heavenly virtue: (2) the heavens themselves\\n\\t\\t\\t\\tare sustained by mathematical balance; and (3) the\\n\\t\\t\\t\\tconstellation Libra (the Balance) is entered by the sun\\n\\t\\t\\t\\tat the middle of the zodiacal year."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "9",
    "NoteID": "5178",
    "Body": "To be taken both literally and figuratively. A man should\\n\\t\\t\\t\\tbe honest and straight in every daily matter, such as\\n\\t\\t\\t\\tweighing out things which he is selling: and he should be\\n\\t\\t\\t\\tstraight, just and honest, in all the highest dealings,\\n\\t\\t\\t\\tnot only with other people, but with himself and in his\\n\\t\\t\\t\\tobedience to Allah's Law. Not many do either the one or\\n\\t\\t\\t\\tthe other when they have an opportunity of deceit.\\n\\t\\t\\t\\tJustice is the central virtue, and the avoidance of both\\n\\t\\t\\t\\texcess and defect in conduct keeps the human world\\n\\t\\t\\t\\tbalanced just as the heavenly world is kept balanced by\\n\\t\\t\\t\\tmathematical order."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "10",
    "NoteID": "5179",
    "Body": "How can Allah's favours be counted? Look at the earth\\n\\t\\t\\t\\talone. Life and the conditions here are mutually balanced\\n\\t\\t\\t\\tfor Allah's creatures. The vegetable world produces fruit\\n\\t\\t\\t\\tof various kinds and corn or grain of various kinds for\\n\\t\\t\\t\\thuman food. The grain harvest yields with it fodder for\\n\\t\\t\\t\\tanimals in the shape of leaves and straw, as well as food\\n\\t\\t\\t\\tfor men in the shape of grain. The plants not only supply\\n\\t\\t\\t\\tfood but sweet-smelling herbs and flowers. Raihan is the\\n\\t\\t\\t\\tsweet basil, but is here used in the generic sense, for\\n\\t\\t\\t\\tagreeable produce in the vegetable world, to match the\\n\\t\\t\\t\\tuseful produce already mentioned."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "13",
    "NoteID": "5180",
    "Body": "Both the pronoun \"your\" and the verb \"will ye deny\" are\\n\\t\\t\\t\\tin the Arabic in the Dual Number. The whole Sura is a\\n\\t\\t\\t\\tsymphony of Duality, which leads up to Unity, as\\n\\t\\t\\t\\texplained in the Introduction. All creation is in pairs:\\n\\t\\t\\t\\tli. 49, and notes 5025-26; xxxvi. 36, n. 3981. Justice is\\n\\t\\t\\t\\tthe conciliation of two opposites to unity, the\\n\\t\\t\\t\\tsettlement of the unending feud between Right and Wrong.\\n\\t\\t\\t\\tThe things and concepts mentioned in this Sura are in\\n\\t\\t\\t\\tpairs: man and outer nature; sun and moon; herbs and\\n\\t\\t\\t\\ttrees; heaven and earth; fruit and corn; human food and\\n\\t\\t\\t\\tfodder for cattle; things nourishing and things\\n\\t\\t\\t\\tsweet-smelling; and so on throughout the Sura. Then there\\n\\t\\t\\t\\tis man and Jinn, for which see n. 5182 below. \"Will ye\\n\\t\\t\\t\\tdeny?\" that is, fail to acknowledge either in word or\\n\\t\\t\\t\\tthought or in your conduct. If you misuse Allah's gifts\\n\\t\\t\\t\\tor ignore them, that is equivalent to ingratitude or\\n\\t\\t\\t\\tdenial or refusal to profit by Allah's infinite Grace."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "14",
    "NoteID": "5181",
    "Body": "See n. 1966 to xv. 26. The creation of men and Jinns is\\n\\t\\t\\t\\tcontrasted. Man was made of sounding clay, dry and\\n\\t\\t\\t\\tbrittle like pottery. The Jinn (see next note) was made\\n\\t\\t\\t\\tfrom a clear flame of fire. Yet each has capacities and\\n\\t\\t\\t\\tpossibilities which only Allah's Grace bestows on them.\\n\\t\\t\\t\\tHow can they deny Allah's favours?"
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "15",
    "NoteID": "5182",
    "Body": "For the meaning of Jinn, see n. 929 to vi. 100. They are\\n\\t\\t\\t\\tspirits, and therefore subtle like a flame of fire. Their\\n\\t\\t\\t\\tbeing free from smoke implies that they are free from\\n\\t\\t\\t\\tgrossness, for smoke is the grosser accompaniment of\\n\\t\\t\\t\\tfire."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "16",
    "NoteID": "5183",
    "Body": "Part of the idea of this refrain will be found in xvi.\\n\\t\\t\\t\\t71, 72; xl. 81; and liii. 55 (where see n. 5122)."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "17",
    "NoteID": "5184",
    "Body": "The two Easts are the two extreme points where the sun\\n\\t\\t\\t\\trises during the year, and includes all the points\\n\\t\\t\\t\\tbetween. Similarly the two Wests include the two extreme\\n\\t\\t\\t\\tpoints of the sun's setting and all the points between.\\n\\t\\t\\t\\tThe Dual Number fits with the general atmosphere of\\n\\t\\t\\t\\tDuality in this Sura. Allah is Lord of every region of\\n\\t\\t\\t\\tthe earth and sky, and He scatters His bounties\\n\\t\\t\\t\\teverywhere. See also n. 4641 to xliii. 38, and n. 4034 to\\n\\t\\t\\t\\txxxvii. 5."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "19",
    "NoteID": "5185",
    "Body": "See xxv. 53, and n. 3111, where it is explained how the\\n\\t\\t\\t\\ttwo bodies of water, salt and sweet, meet together, yet\\n\\t\\t\\t\\tkeep separate, as if there was a barrier or partition\\n\\t\\t\\t\\tbetween them. This is also one of the favours of Allah.\\n\\t\\t\\t\\tSea-water is a sanitating agent, while fresh water is\\n\\t\\t\\t\\tsweet and palatable to drink."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "22",
    "NoteID": "5186",
    "Body": "Pearls are produced by the oyster and coral by the polyp,\\n\\t\\t\\t\\ta minute marine creature, which, working in millions, has\\n\\t\\t\\t\\tby its secretions produced the reefs, islands, and banks\\n\\t\\t\\t\\tin and on both sides of the Red Sea and in other parts of\\n\\t\\t\\t\\tthe world. The pearl has a translucent lustre, usually\\n\\t\\t\\t\\twhite, but sometimes pink or black. Coral is usually\\n\\t\\t\\t\\topaque, red or pink, but often white, and is seen in\\n\\t\\t\\t\\tbeautiful branching or cup-like shapes as visitors to\\n\\t\\t\\t\\tPort Sudan will recall. Both are used as gems and stand\\n\\t\\t\\t\\there for gems generally. Mineral gems, such as agate and\\n\\t\\t\\t\\tcornelian, are found in river-beds. Pearl oysters are\\n\\t\\t\\t\\talso found in some rivers."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "24",
    "NoteID": "5187",
    "Body": "The ships-sailing ships and steamers, and by extension of\\n\\t\\t\\t\\tanalogy, aeroplanes and airships majestically navigating\\n\\t\\t\\t\\tthe air-are made by man, but the intelligence and science\\n\\t\\t\\t\\twhich made them possible are given by man's Creator; and\\n\\t\\t\\t\\ttherefore the Ships also are the gifts of Allah."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "24",
    "NoteID": "5188",
    "Body": "Lofty as mountains: both in respect of the high sails, or\\n\\t\\t\\t\\tmasts, and in respect of the height to which the top of\\n\\t\\t\\t\\tthe ship towers above the surface of the sea. The 'Queen\\n\\t\\t\\t\\tMary'-the biggest ship afloat in 1936-has a height, from\\n\\t\\t\\t\\tthe keel to the top of the superstructure, of 135 ft. and\\n\\t\\t\\t\\tfrom keel to the mast-head, of 234 ft."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "27",
    "NoteID": "5189",
    "Body": "The most magnificent works of man-such as they are-are\\n\\t\\t\\t\\tbut fleeting. Ships, Empires, the Wonders of Science and\\n\\t\\t\\t\\tArt, the splendours of human glory or intellect, will all\\n\\t\\t\\t\\tpass away. The most magnificent objects in outer\\n\\t\\t\\t\\tNature-the mountains and valleys, the sun and moon, the\\n\\t\\t\\t\\tConstellation Orion and the star Sirius-will also pass\\n\\t\\t\\t\\taway in their appointed time. But the only One that will\\n\\t\\t\\t\\tendure for ever is the \"Face\" of Allah."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "27",
    "NoteID": "5190",
    "Body": "Ikram; two ideas are prominent in the word, (1) the idea\\n\\t\\t\\t\\tof generosity, as proceeding from the person whose\\n\\t\\t\\t\\tattribute it is, and (2) the idea of honour, as given by\\n\\t\\t\\t\\tothers to the person whose attribute it is. Both these\\n\\t\\t\\t\\tideas are summed up in \"nobility\". To make the meaning\\n\\t\\t\\t\\tquite clear, I have employed in the translation the two\\n\\t\\t\\t\\twords \"Bounty and Honour\" for the single word Ikram. The\\n\\t\\t\\t\\tsame attributes recur in the last verse of this Sura. In\\n\\t\\t\\t\\tthe Fact of Allah's Eternity is the Hope of our Future."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "29",
    "NoteID": "5191",
    "Body": "Every single creature depends on Allah for its needs: of\\n\\t\\t\\t\\tall of them the Cherisher and Sustainer is Allah. Seek\\n\\t\\t\\t\\t(its needs): does not necessarily mean 'seek them in\\n\\t\\t\\t\\twords': what is meant is the dependence: the allusion is\\n\\t\\t\\t\\tto the Source of supply."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "29",
    "NoteID": "5192",
    "Body": "Shan: state, splendour; aim, work, business, momentous\\n\\t\\t\\t\\taffair. Allah's is still the directing hand in all\\n\\t\\t\\t\\taffairs. He does not sit apart, careless of mankind or of\\n\\t\\t\\t\\tany of His creatures. But His working shows new Splendour\\n\\t\\t\\t\\tevery day, every hour, every moment."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "31",
    "NoteID": "5193",
    "Body": "Thaqal: weight, something weighty, something weighed with\\n\\t\\t\\t\\tsomething else. The two thaqals are Jinns and men who are\\n\\t\\t\\t\\tburdened with responsibility or, as some commentators\\n\\t\\t\\t\\thold, with sin. They are both before Allah, and the\\n\\t\\t\\t\\taffairs of both are conducted under His Command. If there\\n\\t\\t\\t\\tare inequalities or apparent disturbances of balance,\\n\\t\\t\\t\\tthat is only for a season. Allah gives to both good and\\n\\t\\t\\t\\tevil men a chance in this period of probation; but this\\n\\t\\t\\t\\tperiod will soon be over, and Judgment will be\\n\\t\\t\\t\\testablished. To give you this chance, this probation,\\n\\t\\t\\t\\tthis warning, is itself a favour, by which you should\\n\\t\\t\\t\\tprofit, and for which you should be grateful."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "33",
    "NoteID": "5194",
    "Body": "Cf. vi. 130, where the Jinns and men are addressed\\n\\t\\t\\t\\tcollectively. That whole passage, vi. 130-134, should be\\n\\t\\t\\t\\tread as a commentary on this verse. 'If you think that\\n\\t\\t\\t\\tbecause you do things in secret, or because some of your\\n\\t\\t\\t\\tsins do not seem to meet their inevitable punishment or\\n\\t\\t\\t\\tsome of your good deeds seem to go unnoticed, do not be\\n\\t\\t\\t\\tdeceived. Judgment will soon come. You cannot possibly\\n\\t\\t\\t\\tescape out of the zones in which your lives have been\\n\\t\\t\\t\\tcast, without authority from Allah. Be grateful to Allah\\n\\t\\t\\t\\tfor the chances He has given you'. \"All that hath been\\n\\t\\t\\t\\tpromised unto you will come to pass: nor can ye frustrate\\n\\t\\t\\t\\tit in the least bit\" (vi. 134)."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "34",
    "NoteID": "5195",
    "Body": "Note how gradually we have been led up in the Argument.\\n\\t\\t\\t\\t'The Signs of Allah are all about you, in revelation, in\\n\\t\\t\\t\\tyour intelligence, and in nature around you. Your\\n\\t\\t\\t\\tcreation; the light and heat typified by the sun in all\\n\\t\\t\\t\\tdirections; the cycle of waters in the physical earth and\\n\\t\\t\\t\\tof Knowledge in the world of Intelligence; the help and\\n\\t\\t\\t\\tcherishing care of Allah Himself;-all these things should\\n\\t\\t\\t\\tteach you the Truth and warn you about the Future, which\\n\\t\\t\\t\\tis more particularly referred to in the remainder of the\\n\\t\\t\\t\\tSura."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "35",
    "NoteID": "5196",
    "Body": "The Dual is with reference to the two worlds explained\\n\\t\\t\\t\\tabove in n. 5193."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "35",
    "NoteID": "5197",
    "Body": "We now come to the terrors of the Judgment on the evil\\n\\t\\t\\t\\tones."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "36",
    "NoteID": "5198",
    "Body": "Here and in some of the verses that follow, (verses 40,\\n\\t\\t\\t\\t42, and 45 below), the refrain applies with an ironical\\n\\t\\t\\t\\tmeaning. It is as if it was said: 'You used to laugh at\\n\\t\\t\\t\\tRevelation, and at the warnings which were given for your\\n\\t\\t\\t\\town benefit in order to draw you to repentance and\\n\\t\\t\\t\\tAllah's Mercy; what do you find now? Is not all that was\\n\\t\\t\\t\\tsaid to you true?' To reject Allah's Law is in itself to\\n\\t\\t\\t\\tdeny Allah's Mercies."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "37",
    "NoteID": "5199",
    "Body": "Melting away like grease or ointment. The red colour will\\n\\t\\t\\t\\tbe due to the flames and the heat. The whole of the world\\n\\t\\t\\t\\tas we know it now will dissolve."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "39",
    "NoteID": "5200",
    "Body": "This does not of course mean that they will not be called\\n\\t\\t\\t\\tto account for their sin. They will certainly be called\\n\\t\\t\\t\\tto account for all their deeds: xv. 92. The meaning of\\n\\t\\t\\t\\tthis whole passage is that their personal responsibility\\n\\t\\t\\t\\twill be enforced. But their own tongues and hands and\\n\\t\\t\\t\\tfeet will bear witness against them as to their actions:\\n\\t\\t\\t\\txxiv. 24. Every man will bear marks on his person,\\n\\t\\t\\t\\tshowing his classification in the Final Account: vii 48.\\n\\t\\t\\t\\tAfter these Marks are affixed, everyone's position and\\n\\t\\t\\t\\tstatus in the Final Account will be known to everyone. As\\n\\t\\t\\t\\tto the Judge on the Throne of Judgment, He will of course\\n\\t\\t\\t\\tknow all before Judgment is set up. But to give every\\n\\t\\t\\t\\tchance to the accused, his record will be produced and\\n\\t\\t\\t\\tshown to him (lxix. 19, 25, xviii. 49), and he will be\\n\\t\\t\\t\\tgiven a chance to plead (vii. 53), but if a sinner, he\\n\\t\\t\\t\\twill be in confusion (xxviii. 66)."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "41",
    "NoteID": "5201",
    "Body": "By their Marks: see last note."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "43",
    "NoteID": "5202",
    "Body": "It will then become too real to them. \"Oh! that this too,\\n\\t\\t\\t\\ttoo solid flesh would melt\", as Hamlet said to his\\n\\t\\t\\t\\tQueen-Mother (Hamlet, i. 2. 129)."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "44",
    "NoteID": "5203",
    "Body": "They will apparently have no rest. The fire will burn but\\n\\t\\t\\t\\tnot consume them, and their drink will be only boiling\\n\\t\\t\\t\\twater."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "46",
    "NoteID": "5204",
    "Body": "The reference to the Punishment of Sin having been\\n\\t\\t\\t\\tdismissed in a few short lines, we now come to a\\n\\t\\t\\t\\tdescription of the state of the Blessed."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "46",
    "NoteID": "5205",
    "Body": "Here two Gardens are mentioned, and indeed four, counting\\n\\t\\t\\t\\tthe other two mentioned in lv. 62-76. Opinions are\\n\\t\\t\\t\\tdivided about this, but the best opinion is that the two\\n\\t\\t\\t\\tmentioned in verses 46-61 are for the degree of those\\n\\t\\t\\t\\tNearest to Allah (Muqarrabun), and those in verses 62-76\\n\\t\\t\\t\\tfor the Companions of the Right Hand: Why two for each?\\n\\t\\t\\t\\tThe Duality is to express variety, and the whole scheme\\n\\t\\t\\t\\tof the Sura runs in twos. There will be no dulness of\\n\\t\\t\\t\\tuniformity: as our minds can conceive it now, there will\\n\\t\\t\\t\\tbe freshness in change, but it will be from Bliss to\\n\\t\\t\\t\\tBliss, and there will be Unity."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "50",
    "NoteID": "5206",
    "Body": "Two Springs, for the same reasons as there will be two\\n\\t\\t\\t\\tGardens. See last note."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "52",
    "NoteID": "5207",
    "Body": "The Duality of Fruits is for the same reason as the\\n\\t\\t\\t\\tDuality of the Gardens. See n. 5205."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "54",
    "NoteID": "5208",
    "Body": "The toil and fatigue of this life will be over: Cf. xxxv.\\n\\t\\t\\t\\t35."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "56",
    "NoteID": "5209",
    "Body": "See notes 4728-29 to xliv. 54."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "56",
    "NoteID": "5210",
    "Body": "Cf. xxxvii. 48 and n. 4064. Their purity is the feature\\n\\t\\t\\t\\thereby chiefly emphasised."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "58",
    "NoteID": "5211",
    "Body": "Delicate pink, with reference to their complexions and\\n\\t\\t\\t\\ttheir beauty of form. The gems also indicate their worth\\n\\t\\t\\t\\tand dignity."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "60",
    "NoteID": "5212",
    "Body": "This is the summing up of all the description used to\\n\\t\\t\\t\\texpress the Fruit of Goodness or Good. But the fullest\\n\\t\\t\\t\\texpression can only be given in abstract terms: \"Is there\\n\\t\\t\\t\\tany reward for Good-other than Good?\" Can anything\\n\\t\\t\\t\\texpress it better?"
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "62",
    "NoteID": "5213",
    "Body": "See n. 5205 above."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "64",
    "NoteID": "5214",
    "Body": "\"Dark-green in colour\": these Gardens will also be\\n\\t\\t\\t\\tfruitful and flourishing, and watered plentifully; but\\n\\t\\t\\t\\ttheir aspect and characteristics will be different,\\n\\t\\t\\t\\tcorresponding to the subjective differences in the ideas\\n\\t\\t\\t\\tof Bliss among those who would respectively enjoy, the\\n\\t\\t\\t\\ttwo sets of Gardens."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "66",
    "NoteID": "5215",
    "Body": "In comparison with the Springs in the other two Gardens,\\n\\t\\t\\t\\tdescribed in lv. 50 above, these Springs would seem to\\n\\t\\t\\t\\tirrigate crops of vegetables and fruits requiring a\\n\\t\\t\\t\\tconstant supply of abundant water."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "68",
    "NoteID": "5216",
    "Body": "See last note. Cf. also with Iv. 52 above, where \"fruits\\n\\t\\t\\t\\tof every kind\" are mentioned."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "70",
    "NoteID": "5217",
    "Body": "See n. 5209 above. Goodness and Beauty are specially\\n\\t\\t\\t\\tfeminine attributes."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "72",
    "NoteID": "5218",
    "Body": "Maqsurat here is the passive participle of the same verb\\n\\t\\t\\t\\tas the active participle Qasirat in Iv. 56, xxxvii. 48\\n\\t\\t\\t\\tand xxxviii. 52. As I have translated Qasirat by the\\n\\t\\t\\t\\tphrase \"restraining (their glances)\", I think I am right\\n\\t\\t\\t\\tin translating the passive Maqsurat by \"restrained (as to\\n\\t\\t\\t\\ttheir glances)\". This is the only place in the Qur-an\\n\\t\\t\\t\\twhere the passive form occurs."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "72",
    "NoteID": "5219",
    "Body": "The Pavilions seem to add dignity to their status. In the\\n\\t\\t\\t\\tother Gardens (Iv. 58), the description \"like rubies and\\n\\t\\t\\t\\tcorals\" is perhaps an indication of higher dignity."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "76",
    "NoteID": "5220",
    "Body": "Cf. the parallel words for the other two Gardens, in lv.\\n\\t\\t\\t\\t54 above, which suggest perhaps a higher dignity. Rafraf\\n\\t\\t\\t\\tis usually translated by Cushions or Pillows, and I have\\n\\t\\t\\t\\tfollowed this meaning in view of the word \"reclining\".\\n\\t\\t\\t\\tBut another interpretation is \"Meadows\", in view of the\\n\\t\\t\\t\\tadjective \"green\"-'abqari: carpets richly figured and\\n\\t\\t\\t\\tdyed, and skillfully worked."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "78",
    "NoteID": "5221",
    "Body": "Cf. lv. 27 and n. 5190. This minor echo completes the\\n\\t\\t\\t\\tsymmetry of the two leading Ideas of this Sura,-the\\n\\t\\t\\t\\tBounty and Majesty of Allah, and the Duty of man to make\\n\\t\\t\\t\\thimself worthy of nearness to Allah."
  }
]
