[
  {
    "SurahNumber": "55",
    "AyahNumber": "4",
    "NoteID": "1",
    "Body": "The term al-bayan - denoting \"the means whereby a thing\\n\\t\\t\\t\\tis [intellectually] circumscribed and made clear\"\\n\\t\\t\\t\\t(Raghib) - applies to both thought and speech inasmuch as\\n\\t\\t\\t\\tit comprises the faculty of making a thing or an idea\\n\\t\\t\\t\\tapparent to the mind and conceptually distinct from other\\n\\t\\t\\t\\tthings or ideas, as well as the power to express this\\n\\t\\t\\t\\tcognition clearly in spoken or written language (Taj\\n\\t\\t\\t\\tal-'Arus): hence, in the above context, \"articulate\\n\\t\\t\\t\\tthought and speech\", recalling the \"knowledge of all the\\n\\t\\t\\t\\tnames\" (i.e., the faculty of conceptual thinking) with\\n\\t\\t\\t\\twhich man is endowed (see  2:31  and the corresponding\\n\\t\\t\\t\\tnote [23])."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "5",
    "NoteID": "2",
    "Body": "Lit., \"according to a definite reckoning\"."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "7",
    "NoteID": "3",
    "Body": "The noun mizan, usually denoting a \"balance\", has here\\n\\t\\t\\t\\tthe more general connotation of \"measure\" or \"measuring\"\\n\\t\\t\\t\\tby any means whatsoever (Zamakhshari), in both the\\n\\t\\t\\t\\tconcrete and abstract senses of the word. (Cf. also the\\n\\t\\t\\t\\tparabolic use of the term mizan in  42:17  and  57:25 .)"
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "13",
    "NoteID": "4",
    "Body": "The majority of the classical commentators interpret the\\n\\t\\t\\t\\tdual form of address appearing in this phrase - rabbikuma\\n\\t\\t\\t\\t(\"the Sustainer of you two\") and tukadhdhiban (\"do you\\n\\t\\t\\t\\t[or \"can you\"] two disavow\") - as relating to the worlds\\n\\t\\t\\t\\tof men and of the \"invisible beings\" (jinn - see Appendix\\n\\t\\t\\t\\tIII); but the most obvious explanation (mentioned, among\\n\\t\\t\\t\\tothers, by Razi) is that it refers to the two categories\\n\\t\\t\\t\\tof human beings, men and women, to both of whom the\\n\\t\\t\\t\\tQur'an is addressed. The plural noun ala', rendered by me\\n\\t\\t\\t\\tas \"powers\", signifies literally \"blessings\" or\\n\\t\\t\\t\\t\"bounties\"; but as the above refrain, which is repeated\\n\\t\\t\\t\\tmany times in this surah, bears not only on the bounties\\n\\t\\t\\t\\twhich God bestows on His creation but, more generally, on\\n\\t\\t\\t\\tall manifestations of His creativeness and might, some of\\n\\t\\t\\t\\tthe earliest commentators - e.g., Ibn Zayd, as quoted by\\n\\t\\t\\t\\tTabari - regard the term ala', in this context, as\\n\\t\\t\\t\\tsynonymous with qudrah (\"power\" or \"powers\")."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "14",
    "NoteID": "5",
    "Body": "See  15:26  and the corresponding note [24]."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "15",
    "NoteID": "6",
    "Body": "Cf.  15:27  - \"the fire of scorching winds (nar\\n\\t\\t\\t\\tas-samum)\" - thus stressing their non-corporeal origin\\n\\t\\t\\t\\tand composition. The significance of the term jinn\\n\\t\\t\\t\\t(\"invisible beings\") has been touched upon briefly in\\n\\t\\t\\t\\tnote [86] on  6:100  and note [67] on  37:158 ; for a\\n\\t\\t\\t\\tmore detailed explanation, see Appendix III."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "17",
    "NoteID": "7",
    "Body": "I.e., of the extreme points of sunrise and sunset in\\n\\t\\t\\t\\tsummer and in winter (see  37:5  and  70:40 ), including\\n\\t\\t\\t\\t\"all that is between them\": a metonym for God's being the\\n\\t\\t\\t\\tUltimate Cause of the orbital movement within the\\n\\t\\t\\t\\tuniverse."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "20",
    "NoteID": "8",
    "Body": "See  25:53  and the corresponding notes [41] and [42]."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "24",
    "NoteID": "9",
    "Body": "Lit., \"in the sea like mountains\". The reference to ships\\n\\t\\t\\t\\tas \"belonging to God\" is meant to stress the God-given\\n\\t\\t\\t\\tnature of man's intelligence and inventiveness - a\\n\\t\\t\\t\\treflection of God's creative powers - which expresses\\n\\t\\t\\t\\titself in all that man is able to produce. (See also\\n\\t\\t\\t\\t{42:32-34} and the corresponding notes.)"
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "26",
    "NoteID": "10",
    "Body": "Lit., \"Everyone who is upon it\", i.e., on earth and/or,\\n\\t\\t\\t\\taccording to Ibn Kathir, in the heavens - since the\\n\\t\\t\\t\\tpronoun in 'alayha apparently relates to the whole\\n\\t\\t\\t\\tuniverse."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "27",
    "NoteID": "11",
    "Body": "Lit., \"face\", or \"countenance\", a term used metonymically\\n\\t\\t\\t\\tin classical Arabic to denote the \"self\" or \"whole being\"\\n\\t\\t\\t\\tof a person - in this case, the essential Being, or\\n\\t\\t\\t\\tReality, of God. Cf. also  28:88 , \"Everything is bound\\n\\t\\t\\t\\tto perish, save His [eternal] Self\"."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "29",
    "NoteID": "12",
    "Body": "Lit., \"Him does ask [or \"of Him does beg\"] whoever\\n\\t\\t\\t\\tis...\", etc.: i.e., all depend on Him for their safety\\n\\t\\t\\t\\tand sustenance."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "31",
    "NoteID": "13",
    "Body": "Lit., \"We shall apply Ourselves to you\"."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "31",
    "NoteID": "14",
    "Body": "I.e., \"you sin-laden men and women\" (see note [4] above).\\n\\t\\t\\t\\tAccording to an interpretation quoted by Razi the\\n\\t\\t\\t\\tdesignation thaqalan (the dual form of thaqal, \"a thing\\n\\t\\t\\t\\tof weight\") signifies that both these categories of human\\n\\t\\t\\t\\tbeings are liable to, and therefore burdened with,\\n\\t\\t\\t\\tsinning."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "33",
    "NoteID": "15",
    "Body": "For an explanation of this rendering of ma'shar al-jinn\\n\\t\\t\\t\\twa-'l-ins, see note [112] on the first paragraph of\\n\\t\\t\\t\\t 6:128 ."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "33",
    "NoteID": "16",
    "Body": "I.e., in order to escape God's judgment and chastisement."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "33",
    "NoteID": "17",
    "Body": "I.e., \"unless He wills to reprieve you\": cf. the last\\n\\t\\t\\t\\tparagraph of  6:128  and the corresponding note [114]."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "37",
    "NoteID": "18",
    "Body": "This is one of several legitimate interpretations of the\\n\\t\\t\\t\\tterm dihan (see Tabari); another is \"freshly tanned [or\\n\\t\\t\\t\\t\"red\"] leather\" synonymous with adim (Zamakhshari); and\\n\\t\\t\\t\\tyet another, \"dregs of olive-oil\" (Raghib). All these\\n\\t\\t\\t\\tinterpretations have one idea in common - namely, the\\n\\t\\t\\t\\tsudden and surprising change (or changes) of colour to\\n\\t\\t\\t\\twhich the sky will be subject at the Last Hour."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "39",
    "NoteID": "19",
    "Body": "I.e., the sinners \"will find all that they ever wrought\\n\\t\\t\\t\\t[now] facing them\" ( 18:49 ), and \"their own tongues and\\n\\t\\t\\t\\thands and feet will bear witness against them by\\n\\t\\t\\t\\t[recalling] all that they did\" ( 24:24 )."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "41",
    "NoteID": "20",
    "Body": "This is an allusion to their utter humiliation and\\n\\t\\t\\t\\tdisgrace. When the ancient Arabs wanted to stress\\n\\t\\t\\t\\tsomeone's subjection to another person, they would say,\\n\\t\\t\\t\\t\"His forelock is in the hand of so-and-so.\" (See also\\n\\t\\t\\t\\t{96:15-16} and the corresponding note [8].)"
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "44",
    "NoteID": "21",
    "Body": "For my rendering of hamim as \"burning despair\", see note\\n\\t\\t\\t\\t[62] on the last sentence of  6:70 . The allegorical\\n\\t\\t\\t\\tnature of all Qur'anic descriptions of \"rewards\" and\\n\\t\\t\\t\\t\"punishments\" in the hereafter is clearly hinted at in\\n\\t\\t\\t\\tthe phrasing of the above verse, which speaks of the\\n\\t\\t\\t\\tsinners' \"wandering to and fro\" between hell and burning\\n\\t\\t\\t\\tdespair (baynaha wa-bayna hamim) - i.e., tossed between\\n\\t\\t\\t\\tfactual suffering and the despair of vain regrets."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "46",
    "NoteID": "22",
    "Body": "I.e., two kinds of paradise, to be experienced\\n\\t\\t\\t\\tsimultaneously. Various interpretations are advanced on\\n\\t\\t\\t\\tthis score by the classical commentators: e.g., \"a\\n\\t\\t\\t\\tparadise for their doing of good deeds, and another\\n\\t\\t\\t\\tparadise for their avoidance of sins\" (Zamakhshari); or a\\n\\t\\t\\t\\tparadise that \"will comprise both spiritual and physical\\n\\t\\t\\t\\tjoys, [so that it will seem] as if it were two paradises\"\\n\\t\\t\\t\\t(Razi). Finally, one might conclude that the pointed\\n\\t\\t\\t\\treference to the \"two gardens\" of paradise contains -\\n\\t\\t\\t\\tlike the preceding reference to the sinners' \"wandering\\n\\t\\t\\t\\tbetween hell and burning despair\" - a pointed allusion to\\n\\t\\t\\t\\tthe allegorical character of all descriptions of the life\\n\\t\\t\\t\\tto come, as well as to the inexpressible intensity (or\\n\\t\\t\\t\\tmultiplication) of all imaginable and unimaginable\\n\\t\\t\\t\\tsensations in that afterlife. The subsequent descriptions\\n\\t\\t\\t\\tof the joys of paradise must be understood in the same\\n\\t\\t\\t\\tsymbolic light."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "48",
    "NoteID": "23",
    "Body": "According to Tabari, the noun fann (lit., \"mode\" or\\n\\t\\t\\t\\t\"manner\") is in this case synonymous with lawn (\"colour\"\\n\\t\\t\\t\\tor \"hue\"). Afnan is a double plural, and hence denotes\\n\\t\\t\\t\\t\"many hues\"; and since - as pointed out in the Taj\\n\\t\\t\\t\\tal-'Arus - one of the several accepted meanings of fann\\n\\t\\t\\t\\tis \"a wonderful thing\", afnan can also be understood as\\n\\t\\t\\t\\t\"many wonderful things\". The rendering adopted by me\\n\\t\\t\\t\\tcombines both these interpretations. - As regards the\\n\\t\\t\\t\\tindescribable nature of what is termed \"paradise\", see\\n\\t\\t\\t\\t 32:17  and the corresponding note [15]."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "50",
    "NoteID": "24",
    "Body": "The \"two springs\" of paradise call to mind the \"two seas\"\\n\\t\\t\\t\\tspoken of in {18:60-61}, which, according to Baydawi,\\n\\t\\t\\t\\tsymbolize the two sources or streams of knowledge\\n\\t\\t\\t\\taccessible to man: the one obtained through the\\n\\t\\t\\t\\tobservation and intellectual analysis of external\\n\\t\\t\\t\\tphenomena ('ilm az-zahir), and the other through inward,\\n\\t\\t\\t\\tmystic insight ('ilm al-batin)."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "52",
    "NoteID": "25",
    "Body": "Zamakhshari: \"a kind that is known and a kind that is\\n\\t\\t\\t\\tstrange (gharib)\" - i.e., cognitions or sensations that\\n\\t\\t\\t\\tare imaginable on the basis of our experiences in the\\n\\t\\t\\t\\tpresent life, and such as are, as yet, unimaginable to\\n\\t\\t\\t\\tus, and can, therefore, be only hinted at by means of\\n\\t\\t\\t\\tsymbols or allegories. Regarding the concept of\\n\\t\\t\\t\\t\"allegory\" as such, see  3:7  and the corresponding note\\n\\t\\t\\t\\t[8]."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "54",
    "NoteID": "26",
    "Body": "Cf.  18:31  and the corresponding note [41]. The\\n\\t\\t\\t\\t\"reclining upon carpets\" (or \"upon couches\" in  18:31 )\\n\\t\\t\\t\\tis a symbol of utter restfulness and peace of mind. The\\n\\t\\t\\t\\tmention of the \"carpets\" of paradise being lined with\\n\\t\\t\\t\\trich brocade is perhaps meant to convey the idea that -\\n\\t\\t\\t\\tjust as the lining of a carpet is, as a rule, invisible -\\n\\t\\t\\t\\tthe beauty of paradise has nothing to do with outward\\n\\t\\t\\t\\tshow, being of an inner, spiritual nature (Razi). This\\n\\t\\t\\t\\tconcept appears already in an earlier interpretation,\\n\\t\\t\\t\\tquoted by Zamakhshari, according to which the \"carpets\"\\n\\t\\t\\t\\tspoken of here consist of light."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "56",
    "NoteID": "27",
    "Body": "See {56:35-36} and the corresponding note [14]. As\\n\\t\\t\\t\\tregards the expression qasirat at-tarf (lit., \"such as\\n\\t\\t\\t\\trestrain their gaze\"), see note [46] on  38:52 , the\\n\\t\\t\\t\\tearliest Qur'anic instance of this expression."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "62",
    "NoteID": "28",
    "Body": "Most of the commentators assume - not very convincingly -\\n\\t\\t\\t\\tthat the \"two other gardens\" are those to which believers\\n\\t\\t\\t\\tof lesser merit will attain. As against this weak and\\n\\t\\t\\t\\tsomewhat arbitrary interpretation, it seems to me that\\n\\t\\t\\t\\tthe juxtaposition of \"two other gardens\" with the \"two\"\\n\\t\\t\\t\\tpreviously mentioned is meant to convey the idea of\\n\\t\\t\\t\\tinfinity in connection with the concept of paradise as\\n\\t\\t\\t\\tsuch: gardens beyond gardens beyond gardens in an endless\\n\\t\\t\\t\\tvista, slightly varying in description, but all of them\\n\\t\\t\\t\\tsymbols of supreme bliss."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "64",
    "NoteID": "29",
    "Body": "I.e., by reason of abundant watering (Taj al-'Arus). It\\n\\t\\t\\t\\tis to be noted that the adjective \"green\" is often used\\n\\t\\t\\t\\tin the Qur'an to indicate ever-fresh life: e.g., the\\n\\t\\t\\t\\t\"green garments\" which the inmates of paradise will wear\\n\\t\\t\\t\\t( 18:31  and  6:21 ), or the \"green meadows\" upon which\\n\\t\\t\\t\\tthey will recline (cf. verse {76} of the present surah)."
  },
  {
    "SurahNumber": "55",
    "AyahNumber": "72",
    "NoteID": "30",
    "Body": "For this rendering of the plural noun hur (which is both\\n\\t\\t\\t\\tmasculine and feminine), see note [8] on  56:22 , the\\n\\t\\t\\t\\tearliest occurrence of this term in the Qur'an; also note\\n\\t\\t\\t\\t[13] on  56:34 ."
  }
]
