[
  {
    "SurahNumber": "1",
    "AyahNumber": "1",
    "NoteID": "19",
    "Body": "The Arabic words \"Rahman\" and \"Rahim\" translated \"Most\\n\\t\\t\\t\\tGracious\" and \"Most Merciful\" are both intensive forms\\n\\t\\t\\t\\treferring to different aspects of God's attribute of\\n\\t\\t\\t\\tMercy.\\tThe Arabic intensive is more suited to express\\n\\t\\t\\t\\tGod's attributes than the superlative degree in English. \\n\\t\\t\\t\\tThe latter implies a comparison with other beings, or\\n\\t\\t\\t\\twith other times or places, while there is no being like\\n\\t\\t\\t\\tunto God, and He is independent of Time and Place.  Mercy\\n\\t\\t\\t\\tmay imply pity, long-suffering, patience, and\\n\\t\\t\\t\\tforgiveness, all of which the sinner needs and God Most\\n\\t\\t\\t\\tMerciful bestows in abundant measure.  But there is a\\n\\t\\t\\t\\tMercy that goes before even the need arises, the Grace\\n\\t\\t\\t\\twhich is ever watchful, and flows from God Most Gracious\\n\\t\\t\\t\\tto all His creatures, protecting the, preserving them,\\n\\t\\t\\t\\tguiding them, and leading them to clearer light and\\n\\t\\t\\t\\thigher life.  For this reason the attribute Rahman (Most\\n\\t\\t\\t\\tGracious) is not applied to any but God, but the\\n\\t\\t\\t\\tattribute Rahim (Merciful), is a general term, and may\\n\\t\\t\\t\\talso be applied to Men.  To make us contemplate these\\n\\t\\t\\t\\tboundless gifts of God, the formula:  \"In the name of God\\n\\t\\t\\t\\tMost Gracious, Most Merciful\": is placed before every\\n\\t\\t\\t\\tSura of the Qur-an (except the ninth), and repeated at\\n\\t\\t\\t\\tthe beginning of every act by the Muslim who dedicates\\n\\t\\t\\t\\this life to God, and whose hope is in His Mercy."
  },
  {
    "SurahNumber": "1",
    "AyahNumber": "2",
    "NoteID": "20",
    "Body": "The Arabic word Rabb, usually translated Lord, has also\\n\\t\\t\\t\\tthe meaning of cherishing, sustaining, bringing to\\n\\t\\t\\t\\tmaturity.  God cares for all the worlds He has created."
  },
  {
    "SurahNumber": "1",
    "AyahNumber": "5",
    "NoteID": "21",
    "Body": "On realizing in our souls God's love and care, His grace\\n\\t\\t\\t\\tand mercy, and His power and justice (as Ruler of the Day\\n\\t\\t\\t\\tof Judgment), the immediate result is that we bend in the\\n\\t\\t\\t\\tact of worship, and see both our shortcomings and His\\n\\t\\t\\t\\tall-sufficient power.  The emphatic form means that not\\n\\t\\t\\t\\tonly do we reach the position of worshipping God and\\n\\t\\t\\t\\tasking for His help, but we worship Him alone and ask for\\n\\t\\t\\t\\tHis aid only.  For there is none other than He worthy of\\n\\t\\t\\t\\tour devotion and able to help us.  The plural \"we\"\\n\\t\\t\\t\\tindicates that we associate ourselves with all who seek\\n\\t\\t\\t\\tGod, thus strengthening ourselves and strengthening them\\n\\t\\t\\t\\tin a fellowship of faith."
  },
  {
    "SurahNumber": "1",
    "AyahNumber": "6",
    "NoteID": "22",
    "Body": "If we translate by the English word \"guide,\" we shall\\n\\t\\t\\t\\thave to say:  \"Guide us to and in the straight Way.\"  For\\n\\t\\t\\t\\twe many be wandering aimlessly, and the first step is to\\n\\t\\t\\t\\tfind the Way; and the second need is to keep in the Way: \\n\\t\\t\\t\\tour own wisdom may fail in either case.  The straight Way\\n\\t\\t\\t\\tis often the narrow Way, or the steep Way, which many\\n\\t\\t\\t\\tpeople shun (xc.11).  By the world's perversity the\\n\\t\\t\\t\\tstraight Way is sometimes stigmatized and the crooked Way\\n\\t\\t\\t\\tpraised.  How are we to judge?\\tWe must ask for God's\\n\\t\\t\\t\\tguidance.  With a little spiritual insight we shall see\\n\\t\\t\\t\\twhich are the people who walk in the light of God's\\n\\t\\t\\t\\tgrace, and which are those that walk in the darkness of\\n\\t\\t\\t\\tWrath.\\tThis also would help our judgment."
  },
  {
    "SurahNumber": "1",
    "AyahNumber": "7",
    "NoteID": "23",
    "Body": "Note that the words relating to Grace are connected\\n\\t\\t\\t\\tactively with God; those relating to Wrath are\\n\\t\\t\\t\\timpersonal.  In the one case God's Mercy encompasses us\\n\\t\\t\\t\\tbeyond our deserts.  In the other case our own actions\\n\\t\\t\\t\\tare responsible for the Wrath, the negative of Grace,\\n\\t\\t\\t\\tPeace, or Harmony."
  },
  {
    "SurahNumber": "1",
    "AyahNumber": "7",
    "NoteID": "24",
    "Body": "Are there two categories? - those who are in the darkness\\n\\t\\t\\t\\tof Wrath and those who stray?  The first are those who\\n\\t\\t\\t\\tdeliberately break God's law; the second those who stray\\n\\t\\t\\t\\tout of carelessness or negligence.  Both are responsible\\n\\t\\t\\t\\tfor their own acts or omissions.  In opposition to both\\n\\t\\t\\t\\tare the people who are in the light of God's Grace:  for\\n\\t\\t\\t\\tHis Grace not only protects them from active wrong (if\\n\\t\\t\\t\\tthey will only submit their will to Him) but also from\\n\\t\\t\\t\\tstraying into paths of temptation or carelessness.  The\\n\\t\\t\\t\\tnegative gair should be construed as applying not to the\\n\\t\\t\\t\\tway, but as describing men protected from two dangers by\\n\\t\\t\\t\\tGod's Grace."
  }
]
