[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/002001",
        "Body":  "A.L.M. \u003cspan class=\u0027fn\u0027\u003e25\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/002010",
        "Body":  "In their hearts is a disease; and Allah has increased their\n\t\t\tdisease and grievous is the penalty they (incur) because they are\n\t\t\tfalse (to themselves). \u003cspan class=\u0027fn\u0027\u003e34\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "100",
        "Recitation":  "Alafasy_128kbps/002100",
        "Body":  "Is it not (the case) that every time they make a Covenant some\n\t\t\tparty among them throw it aside? - Nay most of them are\n\t\t\tfaithless."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "101",
        "Recitation":  "Alafasy_128kbps/002101",
        "Body":  "And when came to them an Apostle from Allah confirming what was\n\t\t\twith them a party of the people of the Book threw away the Book\n\t\t\tof Allah behind their backs as if (it had been something) they\n\t\t\tdid not know! \u003cspan class=\u0027fn\u0027\u003e102\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "102",
        "Recitation":  "Alafasy_128kbps/002102",
        "Body":  "They followed what the evil ones gave out (falsely) against the\n\t\t\tpower of Solomon; the blasphemers were not Solomon but the evil\n\t\t\tones teaching men magic and such things as came down at Babylon\n\t\t\tto the angels Harut and Marut.\tBut neither of these taught\n\t\t\tanyone (such things) without saying: \"We are only for trial so do\n\t\t\tnot blaspheme.\" They learned from them the means to sow discord\n\t\t\tbetween man and wife. But they could not thus harm anyone except\n\t\t\tby Allah\u0027s permission.\tAnd they learned what harmed them not\n\t\t\twhat profited them.  And they knew that the buyers of (magic)\n\t\t\twould have no share in the happiness of the Hereafter.\tAnd vile\n\t\t\twas the price for which they did sell their souls if they but\n\t\t\tknew! \u003cspan class=\u0027fn\u0027\u003e103\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e104\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e105\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "103",
        "Recitation":  "Alafasy_128kbps/002103",
        "Body":  "If they had kept their faith and guarded themselves from evil far\n\t\t\tbetter had been the reward from their Lord if they but knew!"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "104",
        "Recitation":  "Alafasy_128kbps/002104",
        "Body":  "O ye of Faith! say not (to the Apostle) words of ambiguous import\n\t\t\tbut words of respect; and hearken (to him); to those without\n\t\t\tfaith is a grievous punishment. \u003cspan class=\u0027fn\u0027\u003e105\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "105",
        "Recitation":  "Alafasy_128kbps/002105",
        "Body":  "It is never the wish of those without faith among the people of\n\t\t\tthe Book nor of the Pagans that anything good should come down to\n\t\t\tyou from your Lord.  But Allah will choose for His special Mercy\n\t\t\twhom He will for Allah is Lord of grace abounding."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "106",
        "Recitation":  "Alafasy_128kbps/002106",
        "Body":  "None of Our revelations do We abrogate or cause to be forgotten\n\t\t\tbut We substitute something better or similar; knowest thou not\n\t\t\tthat Allah hath power over all things? \u003cspan class=\u0027fn\u0027\u003e107\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "107",
        "Recitation":  "Alafasy_128kbps/002107",
        "Body":  "Knowest thou not that to Allah belongeth the dominion of the\n\t\t\theavens and the earth! And besides Him ye have neither patron nor\n\t\t\thelper."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "108",
        "Recitation":  "Alafasy_128kbps/002108",
        "Body":  "Would ye question your Apostle as Moses was questioned of old? \n\t\t\tBut whoever changeth from faith to unbelief hath strayed without\n\t\t\tdoubt from the even way. \u003cspan class=\u0027fn\u0027\u003e108\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e109\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "109",
        "Recitation":  "Alafasy_128kbps/002109",
        "Body":  "Quite a number of the people of the Book wish they could turn you\n\t\t\t(people) back to infidelity after ye have believed from selfish\n\t\t\tenvy after the truth hath become manifest unto them; but forgive\n\t\t\tand overlook till Allah accomplish His purpose; for Allah hath\n\t\t\tpower over all things. \u003cspan class=\u0027fn\u0027\u003e110\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e111\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e112\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/002011",
        "Body":  "When it is said to them: \"Make not mischief on the earth\" they\n\t\t\tsay: \"Why we only want to make peace!\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "110",
        "Recitation":  "Alafasy_128kbps/002110",
        "Body":  "And be steadfast in prayer and regular in charity: and whatever\n\t\t\tgood ye send forth for your souls before you ye shall find it\n\t\t\twith Allah; for Allah sees well all that ye do. \u003cspan class=\u0027fn\u0027\u003e113\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "111",
        "Recitation":  "Alafasy_128kbps/002111",
        "Body":  "And they say: \"None shall enter paradise unless he be a Jew or a\n\t\t\tChristian.\"  Those are their (vain) desires.  Say: \"Produce your\n\t\t\tproof if ye are truthful.\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "112",
        "Recitation":  "Alafasy_128kbps/002112",
        "Body":  "Nay whoever submits his whole self to Allah and is a doer of good\n\t\t\the will get his reward with his Lord; on such shall be no fear\n\t\t\tnor shall they grieve. \u003cspan class=\u0027fn\u0027\u003e114\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e115\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "113",
        "Recitation":  "Alafasy_128kbps/002113",
        "Body":  "The Jews say: \"The Christians have naught (to stand) upon\"; and\n\t\t\tthe Christians say: \"The Jews have naught (to stand) upon.\"  Yet\n\t\t\tthey (profess to) study the (same) Book.  Like unto their word is\n\t\t\twhat those say who know not but Allah will judge between them in\n\t\t\ttheir quarrel on the Day of Judgment. \u003cspan class=\u0027fn\u0027\u003e116\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "114",
        "Recitation":  "Alafasy_128kbps/002114",
        "Body":  "And who is more unjust than he who forbids that in places for the\n\t\t\tworship of Allah Allah\u0027s name should be celebrated?  Whose zeal\n\t\t\tis (in fact) to ruin them?  It was not fitting that such should\n\t\t\tthemselves enter them except in fear.  For them there is nothing\n\t\t\tbut disgrace in this world and in the world to come an exceeding\n\t\t\ttorment. \u003cspan class=\u0027fn\u0027\u003e117\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "115",
        "Recitation":  "Alafasy_128kbps/002115",
        "Body":  "To Allah belong the East and the West; whithersoever ye turn\n\t\t\tthere is the presence of Allah.  For Allah is All-Pervading\n\t\t\tAll-Knowing. \u003cspan class=\u0027fn\u0027\u003e118\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "116",
        "Recitation":  "Alafasy_128kbps/002116",
        "Body":  "They say: \"Allah hath begotten a son\"; Glory be to Him.  Nay to\n\t\t\tHim belongs all that is in the heavens and on earth; everything\n\t\t\trenders worship to Him. \u003cspan class=\u0027fn\u0027\u003e119\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "117",
        "Recitation":  "Alafasy_128kbps/002117",
        "Body":  "To Him is due the primal origin of the heavens and the earth;\n\t\t\twhen He decreeth a matter He saith to it: \"Be\"; and it is.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e120\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "118",
        "Recitation":  "Alafasy_128kbps/002118",
        "Body":  "Say those without knowledge: \"Why speaketh not Allah unto Us? Or\n\t\t\twhy cometh not unto Us a sign?\" So said the people before them\n\t\t\twords of similar import.  Their hearts are alike.  We have indeed\n\t\t\tmade clear the signs unto any people who hold firmly to faith (in\n\t\t\ttheir hearts)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "119",
        "Recitation":  "Alafasy_128kbps/002119",
        "Body":  "Verily We have sent thee in truth as a bearer of glad tidings and\n\t\t\ta warner.  But of thee no question shall be asked of Companions\n\t\t\tof the blazing fire."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/002012",
        "Body":  "Of a surety they are the ones who make mischief but they realize\n\t\t\t(it) not. \u003cspan class=\u0027fn\u0027\u003e35\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "120",
        "Recitation":  "Alafasy_128kbps/002120",
        "Body":  "Never will the Jews or the Christians be satisfied with thee\n\t\t\tunless thou follow their form of religion.  Say: \"The guidance of\n\t\t\tAllah that is the (only) guidance.\"  Wert thou to follow their\n\t\t\tdesires after the knowledge which hath reached thee then wouldst\n\t\t\tthou find neither protector nor helper against Allah."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "121",
        "Recitation":  "Alafasy_128kbps/002121",
        "Body":  "Those to whom We have sent the book study it as it should be\n\t\t\tstudied; they are the ones that believe therein; those who reject\n\t\t\tfaith therein the loss is their own."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "122",
        "Recitation":  "Alafasy_128kbps/002122",
        "Body":  "O Children of Israel! call to mind the special favor which I\n\t\t\tbestowed upon you and that I preferred you to all others (for my\n\t\t\tmessage)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "123",
        "Recitation":  "Alafasy_128kbps/002123",
        "Body":  "Then guard yourselves against a day when one soul shall not avail\n\t\t\tanother nor shall compensation be accepted from her nor shall\n\t\t\tintercession profit her nor shall anyone be helped (from\n\t\t\toutside). \u003cspan class=\u0027fn\u0027\u003e122\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "124",
        "Recitation":  "Alafasy_128kbps/002124",
        "Body":  "And remember that Abraham was tried by his Lord with certain\n\t\t\tcommands which he fulfilled; He said: \"I will make thee an Imam\n\t\t\tto the nations.\" He pleaded: \"And also (Imams) from my\n\t\t\toffspring!\"  He answered: \"But my promise is not within the reach\n\t\t\tof evil-doers.\" \u003cspan class=\u0027fn\u0027\u003e123\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "125",
        "Recitation":  "Alafasy_128kbps/002125",
        "Body":  "Remember We made the house a place of assembly for men and a\n\t\t\tplace of safety; and take ye the station of Abraham as a place of\n\t\t\tprayer; and We covenanted with Abraham and Isma`il that they\n\t\t\tshould sanctify My House for those who compass it round or use it\n\t\t\tas a retreat or bow or prostrate themselves (therein in prayer).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e125\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e126\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "126",
        "Recitation":  "Alafasy_128kbps/002126",
        "Body":  "And remember Abraham said: \"My Lord make this a City of Peace and\n\t\t\tfeed its people with fruits such of them as believe in Allah and\n\t\t\tthe Last Day.\"\tHe said: \"(Yea) and such as reject faith for a\n\t\t\twhile will I grant them their pleasure but will soon drive them\n\t\t\tto the torment of fire an evil destination (indeed)!\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e127\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e128\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "127",
        "Recitation":  "Alafasy_128kbps/002127",
        "Body":  "And remember Abraham and Isma`il raised the foundations of the\n\t\t\tHouse (with this prayer): \"Our Lord! accept (this service) from\n\t\t\tus for thou art the All-Hearing the All-Knowing."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "128",
        "Recitation":  "Alafasy_128kbps/002128",
        "Body":  "\"Our Lord! make of us Muslims bowing to Thy (Will) and of our\n\t\t\tprogeny a people Muslim bowing to Thy (Will) and show us our\n\t\t\tplaces for the celebration of (due) rites; and turn unto us (in\n\t\t\tmercy); for Thou art the Oft-Returning Most-Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "129",
        "Recitation":  "Alafasy_128kbps/002129",
        "Body":  "\"Our Lord! send amongst them an Apostle of their own who shall\n\t\t\trehearse Thy Signs to them and instruct them in Scripture and\n\t\t\tWisdom and sanctify them; for Thou art the Exalted in Might the\n\t\t\tWise.\" \u003cspan class=\u0027fn\u0027\u003e129\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/002013",
        "Body":  "When it is said to them: \"Believe as the others believe\" they\n\t\t\tsay: \"Shall we believe as the fools believe?\" nay of a surety\n\t\t\tthey are the fools buy they do not know. \u003cspan class=\u0027fn\u0027\u003e36\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "130",
        "Recitation":  "Alafasy_128kbps/002130",
        "Body":  "And who turns away from the religion of Abraham but such as\n\t\t\tdebase their souls with folly?\tHim We chose and rendered pure in\n\t\t\tthis world: and he will be in the Hereafter in the ranks of the\n\t\t\trighteous. \u003cspan class=\u0027fn\u0027\u003e130\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "131",
        "Recitation":  "Alafasy_128kbps/002131",
        "Body":  "Behold! his Lord said to him: \"Bow (thy will to me)\"  He said: \"I\n\t\t\tbow (my will) to the Lord and Cherisher of the universe.\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "132",
        "Recitation":  "Alafasy_128kbps/002132",
        "Body":  "And this was the legacy that Abraham left to his sons and so did\n\t\t\tJacob; \"O my sons! Allah hath chosen the faith for you; then die\n\t\t\tnot except in the faith of Islam.\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "133",
        "Recitation":  "Alafasy_128kbps/002133",
        "Body":  "Were ye witnesses when death appeared before Jacob?  Behold he\n\t\t\tsaid to his sons: \"What will ye worship after me?\"  They said:\n\t\t\t\"We shall worship thy Allah and the Allah of thy fathers of\n\t\t\tAbraham Isma`il and Isaac the one (true) Allah to Him we bow (in\n\t\t\tIslam).\" \u003cspan class=\u0027fn\u0027\u003e131\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e132\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "134",
        "Recitation":  "Alafasy_128kbps/002134",
        "Body":  "That was a People that hath passed away.  They shall reap the\n\t\t\tfruit of what they did and ye of what ye do! of their merits\n\t\t\tthere is no question in your case! \u003cspan class=\u0027fn\u0027\u003e133\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "135",
        "Recitation":  "Alafasy_128kbps/002135",
        "Body":  "They say: \"Become Jews or Christians if ye would be guided (to\n\t\t\tsalvation).\"  Say thou: \"Nay! (I would rather) the religion of\n\t\t\tAbraham the true and he joined not gods with Allah.\" \u003cspan class=\u0027fn\u0027\u003e134\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "136",
        "Recitation":  "Alafasy_128kbps/002136",
        "Body":  "Say ye: \"We believe in Allah and the revelation given to us and\n\t\t\tto Abraham Isma`il Isaac Jacob and the Tribes and that given to\n\t\t\tMoses and Jesus and that given to (all) Prophets from their Lord\n\t\t\twe make no difference between one and another of them and we bow\n\t\t\tto Allah (in Islam).\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "137",
        "Recitation":  "Alafasy_128kbps/002137",
        "Body":  "So if they believe as ye believe they are indeed on the right\n\t\t\tpath; but if they turn back it is they who are in schism; but\n\t\t\tAllah will suffice thee as against them and He is the All-Hearing\n\t\t\tthe All- Knowing. \u003cspan class=\u0027fn\u0027\u003e136\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "138",
        "Recitation":  "Alafasy_128kbps/002138",
        "Body":  "(Our religion is) the baptism of Allah; and who can baptize\n\t\t\tbetter than Allah? and it is He whom we worship. \u003cspan class=\u0027fn\u0027\u003e137\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "139",
        "Recitation":  "Alafasy_128kbps/002139",
        "Body":  "Say: Will ye dispute with us about Allah seeing that He is our\n\t\t\tLord and your Lord; that we are responsible for our doings and ye\n\t\t\tfor yours; and that we are sincere (in our faith) in Him?"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/002014",
        "Body":  "When they meet those who believe they say: \"We believe\" but when\n\t\t\tthey are alone with their evil ones they say: \"We are really with\n\t\t\tyou we (were) only jesting.\" \u003cspan class=\u0027fn\u0027\u003e37\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "140",
        "Recitation":  "Alafasy_128kbps/002140",
        "Body":  "Or do ye say that Abraham Isma`il Isaac Jacob and the Tribes were\n\t\t\tJews or Christians?  Say: Do ye know better than Allah?  Ah! who\n\t\t\tis more unjust than those who conceal the testimony they have\n\t\t\tfrom Allah?  But Allah is not unmindful of what ye do!\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e138\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "141",
        "Recitation":  "Alafasy_128kbps/002141",
        "Body":  "That was a people that hath passed away.  They shall reap the\n\t\t\tfruit of what they did and ye of what ye do! Of their merits\n\t\t\tthere is no question in your case. \u003cspan class=\u0027fn\u0027\u003e139\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "142",
        "Recitation":  "Alafasy_128kbps/002142",
        "Body":  "The fools among the people will say: \"What hath turned them from\n\t\t\tthe Qiblah to which they were used?\"  Say: To Allah belong both\n\t\t\tEast and West; He guideth whom He will to a Way that is straight.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e140\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e141\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "143",
        "Recitation":  "Alafasy_128kbps/002143",
        "Body":  "Thus have We made of you an Ummah justly balanced that ye might\n\t\t\tbe witnesses over the nations and the Apostle a witness over\n\t\t\tyourselves; and We appointed the Qiblah to which thou wast used\n\t\t\tonly to test those who followed the Apostle from those who would\n\t\t\tturn on their heels (from the faith).  Indeed it was (a change)\n\t\t\tmomentous except to those guided by Allah.  And never would Allah\n\t\t\tmake your faith of no effect.  For Allah is to all people most\n\t\t\tsurely full of kindness Most Merciful. \u003cspan class=\u0027fn\u0027\u003e142\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e143\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e144\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e145\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e146\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "144",
        "Recitation":  "Alafasy_128kbps/002144",
        "Body":  "We see the turning of thy face (for guidance) to the heavens; now\n\t\t\tshall We turn thee to a Qiblah that shall please thee.\tTurn then\n\t\t\tthy face in the direction of the Sacred Mosque; wherever ye are\n\t\t\tturn your faces in that direction.  The people of the book know\n\t\t\twell that that is the truth from their Lord nor is Allah\n\t\t\tunmindful of what they do. \u003cspan class=\u0027fn\u0027\u003e147\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e148\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e149\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "145",
        "Recitation":  "Alafasy_128kbps/002145",
        "Body":  "Even if thou wert to bring to the people of the Book all the\n\t\t\tsigns (together) they would not follow thy Qiblah; nor art thou\n\t\t\tgoing to follow their Qiblah; nor indeed will they follow each\n\t\t\tother\u0027s Qiblah. If thou after the knowledge hath reached thee\n\t\t\twert to follow their (vain) desires then wert thou indeed\n\t\t\t(clearly) in the wrong. \u003cspan class=\u0027fn\u0027\u003e150\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "146",
        "Recitation":  "Alafasy_128kbps/002146",
        "Body":  "The people of the Book know this as they know their own sons; but\n\t\t\tsome of them conceal the truth which they themselves know.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e151\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "147",
        "Recitation":  "Alafasy_128kbps/002147",
        "Body":  "The truth is from thy Lord so be not at all in doubt.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e154\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "148",
        "Recitation":  "Alafasy_128kbps/002148",
        "Body":  "To each is a goal to which Allah turns him; then strive together\n\t\t\t(as in a race) toward all that is good.  Wheresoever ye are Allah\n\t\t\twill bring you together.  For Allah hath power over all things.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e153\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "149",
        "Recitation":  "Alafasy_128kbps/002149",
        "Body":  "From whencesoever thou startest forth turn thy face in the\n\t\t\tdirection of the Sacred Mosque; that is indeed the truth from thy\n\t\t\tLord.  And Allah is not unmindful of what ye do. \u003cspan class=\u0027fn\u0027\u003e154\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/002015",
        "Body":  "Allah will throw back their mockery on them and give them rope in\n\t\t\ttheir trespasses; so they will wander like blind ones (to and\n\t\t\tfro)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "150",
        "Recitation":  "Alafasy_128kbps/002150",
        "Body":  "So from whencesoever thou startest forth turn thy face in the\n\t\t\tdirection of the Sacred Mosque; among wheresoever ye are turn\n\t\t\tyour face thither that there be no ground of dispute against you\n\t\t\tamong the people except those of them that are bent on\n\t\t\twickedness; so fear them not but fear Me; and that I may complete\n\t\t\tMy favors on you and ye may (consent to) be guided."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "151",
        "Recitation":  "Alafasy_128kbps/002151",
        "Body":  "A similar (favor have ye already received) in that We have sent\n\t\t\tamong you an Apostle of your own rehearsing to you Our signs and\n\t\t\tsanctifying you and instructing you in Scripture and wisdom and\n\t\t\tin new Knowledge. \u003cspan class=\u0027fn\u0027\u003e155\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "152",
        "Recitation":  "Alafasy_128kbps/002152",
        "Body":  "Then do ye remember Me; I will remember you.  Be grateful to Me\n\t\t\tand reject not faith. \u003cspan class=\u0027fn\u0027\u003e156\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "153",
        "Recitation":  "Alafasy_128kbps/002153",
        "Body":  "O ye who believe! seek help with patient perseverance and prayer:\n\t\t\tfor Allah is with those who patiently persevere. \u003cspan class=\u0027fn\u0027\u003e157\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "154",
        "Recitation":  "Alafasy_128kbps/002154",
        "Body":  "And say not of those who are slain in the way of Allah: \"They are\n\t\t\tdead.\" Nay they are living though ye perceive (it) not.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e158\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "155",
        "Recitation":  "Alafasy_128kbps/002155",
        "Body":  "Be sure We shall test you with something of fear and hunger some\n\t\t\tloss in goods or lives or the fruits (of your toil) but give glad\n\t\t\ttidings to those who patiently persevere. \u003cspan class=\u0027fn\u0027\u003e159\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "156",
        "Recitation":  "Alafasy_128kbps/002156",
        "Body":  "Who say when afflicted with calamity: \"To Allah we belong and to\n\t\t\tHim is our return.\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "157",
        "Recitation":  "Alafasy_128kbps/002157",
        "Body":  "They are those on whom (descend) blessings from Allah and Mercy\n\t\t\tand they are the ones that receive guidance."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "158",
        "Recitation":  "Alafasy_128kbps/002158",
        "Body":  "Behold! Safa and Marwa are among the Symbols of Allah.\tSo if\n\t\t\tthose who visit the house in the season or at other times should\n\t\t\tcompass them round it is no sin in them.  And if anyone obeyeth\n\t\t\this own impulse to good be sure that Allah is He Who recogniseth\n\t\t\tand knoweth. \u003cspan class=\u0027fn\u0027\u003e160\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e161\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e162\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "159",
        "Recitation":  "Alafasy_128kbps/002159",
        "Body":  "Those who conceal the clear (Signs) We have sent down and the\n\t\t\tguidance after We have made it clear for the people in the book\n\t\t\ton them shall be Allah\u0027s curse and the curse of those entitled to\n\t\t\tcurse. \u003cspan class=\u0027fn\u0027\u003e163\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/002016",
        "Body":  "These are they who have bartered guidance for error: but their\n\t\t\ttraffic is profitless and they have lost true direction."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "160",
        "Recitation":  "Alafasy_128kbps/002160",
        "Body":  "Except those who repent and make amends and openly declare (the\n\t\t\ttruth) to them I turn; for I am Oft-Returning Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "161",
        "Recitation":  "Alafasy_128kbps/002161",
        "Body":  "Those who reject faith and die rejecting on them is Allah\u0027s curse\n\t\t\tand the curse of angels and of all mankind."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "162",
        "Recitation":  "Alafasy_128kbps/002162",
        "Body":  "They will abide therein: Their penalty will not be lightened nor\n\t\t\twill respite be their (lot). \u003cspan class=\u0027fn\u0027\u003e164\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "163",
        "Recitation":  "Alafasy_128kbps/002163",
        "Body":  "And your Allah is one Allah; there is no god but He Most Gracious\n\t\t\tMost Merciful. \u003cspan class=\u0027fn\u0027\u003e165\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "164",
        "Recitation":  "Alafasy_128kbps/002164",
        "Body":  "Behold! In the creation of the heavens and the earth; in the\n\t\t\talternation of the night and the day; in the sailing of the ships\n\t\t\tthrough the ocean for the profit of mankind; in the rain which\n\t\t\tAllah sends down from the skies and the life which He gives\n\t\t\ttherewith to an earth that is dead; in the beasts of all kinds\n\t\t\tthat He scatters through the earth; in the change of the winds\n\t\t\tand the clouds which they trail like their slaves between the sky\n\t\t\tand the earth; (here) indeed are signs for a people that are\n\t\t\twise. \u003cspan class=\u0027fn\u0027\u003e166\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "165",
        "Recitation":  "Alafasy_128kbps/002165",
        "Body":  "Yet there are men who take (for worship) others besides Allah as\n\t\t\tequal (with Allah); they love them as they should love Allah. \n\t\t\tBut those of faith are overflowing in their love for Allah.  If\n\t\t\tonly the unrighteous could see behold they would see the penalty\n\t\t\tthat to Allah belongs all power and Allah will strongly enforce\n\t\t\tthe penalty. \u003cspan class=\u0027fn\u0027\u003e167\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "166",
        "Recitation":  "Alafasy_128kbps/002166",
        "Body":  "Then would those who are followed clear themselves of those who\n\t\t\tfollow (them); they would see the penalty and all relations\n\t\t\tbetween them would be cut off."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "167",
        "Recitation":  "Alafasy_128kbps/002167",
        "Body":  "And those who followed would say: \"If only we had one more chance\n\t\t\twe would clear ourselves of them as they have cleared themselves\n\t\t\tof us.\" Thus will Allah show them (the fruits of) their deeds as\n\t\t\t(nothing but) regrets nor will there be a way for them out of the\n\t\t\tfire. \u003cspan class=\u0027fn\u0027\u003e168\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "168",
        "Recitation":  "Alafasy_128kbps/002168",
        "Body":  "O ye people! eat of what is on earth lawful and good; and do not\n\t\t\tfollow the footsteps of the evil one for he is to you an avowed\n\t\t\tenemy. \u003cspan class=\u0027fn\u0027\u003e169\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "169",
        "Recitation":  "Alafasy_128kbps/002169",
        "Body":  "For he commands you what is evil and shameful and that ye should\n\t\t\tsay of Allah that of which ye have no knowledge."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/002017",
        "Body":  "Their similitude is that of a man who kindled a fire; when it\n\t\t\tlighted all around him Allah took away their light and left them\n\t\t\tin utter darkness so they could not see. \u003cspan class=\u0027fn\u0027\u003e38\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "170",
        "Recitation":  "Alafasy_128kbps/002170",
        "Body":  "When it is said to them: \"Follow what Allah hath revealed\" they\n\t\t\tsay: \"Nay! we shall follow the ways of our fathers.\"  What! even\n\t\t\tthough their fathers were void of wisdom and guidance?"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "171",
        "Recitation":  "Alafasy_128kbps/002171",
        "Body":  "The parable of those who reject faith is as if one were to shout\n\t\t\tlike a goat-herd to things that listen to nothing but calls and\n\t\t\tcries; deaf dumb and blind they are void of wisdom. \u003cspan class=\u0027fn\u0027\u003e170\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e171\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "172",
        "Recitation":  "Alafasy_128kbps/002172",
        "Body":  "O ye who believe! eat of the good things that We have provided\n\t\t\tfor you and be grateful to Allah if it is Him ye worship.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e172\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "173",
        "Recitation":  "Alafasy_128kbps/002173",
        "Body":  "He hath only forbidden you dead meat and blood and the flesh of\n\t\t\tswine and that on which any other name hath been invoked besides\n\t\t\tthat of Allah but if one is forced by necessity without wilful\n\t\t\tdisobedience nor transgressing due limits then is he guiltless. \n\t\t\tFor Allah is Oft-Forgiving Most Merciful. \u003cspan class=\u0027fn\u0027\u003e173\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e174\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "174",
        "Recitation":  "Alafasy_128kbps/002174",
        "Body":  "Those who conceal Allah\u0027s revelations in the Book and purchase\n\t\t\tfor them a miserable profit they swallow into themselves naught\n\t\t\tbut fire; Allah will not address them on the Day of Resurrection\n\t\t\tnor purify them; grievous will be their penalty . \u003cspan class=\u0027fn\u0027\u003e175\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "175",
        "Recitation":  "Alafasy_128kbps/002175",
        "Body":  "They are the ones who buy error in place of guidance and torment\n\t\t\tin place of forgiveness.  Ah! what boldness (they show) for the\n\t\t\tFire!"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "176",
        "Recitation":  "Alafasy_128kbps/002176",
        "Body":  "(Their doom is) because Allah sent down the Book in truth but\n\t\t\tthose who seek causes of dispute in the Book are in a schism far\n\t\t\t(from the purpose). \u003cspan class=\u0027fn\u0027\u003e176\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "177",
        "Recitation":  "Alafasy_128kbps/002177",
        "Body":  "It is not righteousness that ye turn your faces toward East or\n\t\t\tWest; but it is righteousness to believe in Allah and the Last\n\t\t\tDay and the Angels and the Book and the Messengers; to spend of\n\t\t\tyour substance out of love for Him for your kin for orphans for\n\t\t\tthe needy for the wayfarer for those who ask and for the ransom\n\t\t\tof slaves; to be steadfast in prayer and practice regular\n\t\t\tcharity; to fulfil the contracts which ye have made; and to be\n\t\t\tfirm and patient in pain (or suffering) and adversity and\n\t\t\tthroughout all periods of panic.  Such are the people of truth\n\t\t\tthe Allah-fearing. \u003cspan class=\u0027fn\u0027\u003e177\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e178\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e179\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e180\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e181\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "178",
        "Recitation":  "Alafasy_128kbps/002178",
        "Body":  "O ye who believe! the law of equality is prescribed to you in\n\t\t\tcases of murder; the free for the free the slave for the slave\n\t\t\tthe woman for the woman.  But if any remission is made by the\n\t\t\tbrother of the slain then grant any reasonable demand and\n\t\t\tcompensate him with handsome gratitude; this is a concession and\n\t\t\ta Mercy from your Lord.  After this whoever exceeds the limits\n\t\t\tshall be in grave penalty. \u003cspan class=\u0027fn\u0027\u003e182\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e183\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e184\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e185\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "179",
        "Recitation":  "Alafasy_128kbps/002179",
        "Body":  "In the law of equality there is (saving of) life to you O ye men\n\t\t\tof understanding! that ye may restrain yourselves."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/002018",
        "Body":  "Deaf dumb and blind they will not return (to the path)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "180",
        "Recitation":  "Alafasy_128kbps/002180",
        "Body":  "It is prescribed when death approaches any of you if he leave any\n\t\t\tgoods that he make a bequest to parents and next of kin according\n\t\t\tto reasonable usage; this is due from the Allah-fearing.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e186\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "181",
        "Recitation":  "Alafasy_128kbps/002181",
        "Body":  "If anyone changes the bequest after hearing it the guilt shall be\n\t\t\ton those who make the change.  For Allah hears and knows all\n\t\t\tthings."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "182",
        "Recitation":  "Alafasy_128kbps/002182",
        "Body":  "But if anyone fears partiality or wrong-doing on the part of the\n\t\t\ttestator and makes peace between (the parties concerned) there is\n\t\t\tno wrong in him; for Allah is Oft-Forgiving Most Merciful.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e187\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "183",
        "Recitation":  "Alafasy_128kbps/002183",
        "Body":  "O ye who believe! fasting is prescribed to you as it was\n\t\t\tprescribed to those before you that ye may (learn)\n\t\t\tself-restraint. \u003cspan class=\u0027fn\u0027\u003e188\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "184",
        "Recitation":  "Alafasy_128kbps/002184",
        "Body":  "(Fasting) for a fixed number of days; but if any of you is ill or\n\t\t\ton a journey the prescribed number (should be made up) from days\n\t\t\tlater. For those who can do it (with hardship) is a ransom the\n\t\t\tfeeding of one that is indigent.  But he that will give more of\n\t\t\this own free will it is better for him and it is better for you\n\t\t\tthat ye fast if ye only knew. \u003cspan class=\u0027fn\u0027\u003e189\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e190\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e191\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "185",
        "Recitation":  "Alafasy_128kbps/002185",
        "Body":  "Ramadan is the (month) in which was sent down the Qur\u0027an as a\n\t\t\tguide to mankind also clear (Signs) for guidance and judgment\n\t\t\t(between right and wrong).  So everyone of you who is present (at\n\t\t\this home) during that month should spend it in fasting but if\n\t\t\tanyone is ill or on a journey the prescribed period (should be\n\t\t\tmade up) by days later.  Allah intends every facility for you He\n\t\t\tdoes not want to put you to difficulties.  (He wants you) to\n\t\t\tcomplete the prescribed period and to glorify Him in that He has\n\t\t\tguided you; and perchance ye shall be grateful. \u003cspan class=\u0027fn\u0027\u003e192\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e193\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "186",
        "Recitation":  "Alafasy_128kbps/002186",
        "Body":  "When my servants ask thee concerning Me I am indeed close (to\n\t\t\tthem); I listen to the prayer of every suppliant when he calleth\n\t\t\ton Me; let them also with a will listen to My call and believe in\n\t\t\tMe; that they may walk in the right way. \u003cspan class=\u0027fn\u0027\u003e194\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "187",
        "Recitation":  "Alafasy_128kbps/002187",
        "Body":  "Permitted to you on the night of the fasts is the approach to\n\t\t\tyour wives.  They are your garments.  And ye are their garments. \n\t\t\tAllah knoweth what ye used to do secretly among yourselves; but\n\t\t\tHe turned to you and forgave you; so now associate with them and\n\t\t\tseek what Allah hath ordained for you and eat and drink until the\n\t\t\twhite thread of dawn appear to you distinct from its black\n\t\t\tthread; then complete your fast till the night appears; but do\n\t\t\tnot associate with your wives while ye are in retreat in the\n\t\t\tmosques.  Those are limits (set by) Allah; approach not nigh\n\t\t\tthereto.  Thus doth Allah make clear His signs to men that they\n\t\t\tmay learn self-restraint. \u003cspan class=\u0027fn\u0027\u003e195\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e196\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e197\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e198\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e199\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e200\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "188",
        "Recitation":  "Alafasy_128kbps/002188",
        "Body":  "And do not eat up your property among yourselves for vanities nor\n\t\t\tuse it as bait for the judges with intent that ye may eat up\n\t\t\twrongfully and knowingly a little of (other) people\u0027s property.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e201\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "189",
        "Recitation":  "Alafasy_128kbps/002189",
        "Body":  "They ask thee concerning the new moons.  Say: they are but signs\n\t\t\tto mark fixed periods of time in (the affairs of) men and for\n\t\t\tpilgrimage.  It is no virtue if ye enter your houses from the\n\t\t\tback; it is virtue if ye fear Allah.  Enter houses through the\n\t\t\tproper doors and fear Allah that ye may prosper. \u003cspan class=\u0027fn\u0027\u003e202\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e203\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/002019",
        "Body":  "Or (another similitude) is that of a rain-laden cloud from the\n\t\t\tsky; in it are zones of darkness and thunder and lightning they\n\t\t\tpress their fingers in their ears to keep out the stunning\n\t\t\tthunder-clap the while they are in terror of death.  But Allah is\n\t\t\tever round the rejecters of Faith! \u003cspan class=\u0027fn\u0027\u003e39\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "190",
        "Recitation":  "Alafasy_128kbps/002190",
        "Body":  "Fight in the cause of Allah those who fight you but do not\n\t\t\ttransgress limits; for Allah loveth not transgressors.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e204\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "191",
        "Recitation":  "Alafasy_128kbps/002191",
        "Body":  "And slay them wherever ye catch them and turn them out from where\n\t\t\tthey have turned you out; for tumult and oppression are worse\n\t\t\tthan slaughter; but fight them not at the Sacred Mosque unless\n\t\t\tthey (first) fight you there; but if they fight you slay them. \n\t\t\tSuch is the reward of those who suppress faith. \u003cspan class=\u0027fn\u0027\u003e205\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e206\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "192",
        "Recitation":  "Alafasy_128kbps/002192",
        "Body":  "But if they cease Allah is Oft-Forgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "193",
        "Recitation":  "Alafasy_128kbps/002193",
        "Body":  "And fight them on until there is no more tumult or oppression and\n\t\t\tthere prevail justice and faith in Allah; but if they cease let\n\t\t\tthere be no hostility except to those who practice oppression.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e207\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e208\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "194",
        "Recitation":  "Alafasy_128kbps/002194",
        "Body":  "The prohibited month for the prohibited month and so for all\n\t\t\tthings prohibited there is the law of equality.  If then anyone\n\t\t\ttransgresses the prohibition against you transgress ye likewise\n\t\t\tagainst him.  But fear Allah and know that Allah is with those\n\t\t\twho restrain themselves. \u003cspan class=\u0027fn\u0027\u003e209\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e210\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "195",
        "Recitation":  "Alafasy_128kbps/002195",
        "Body":  "And spend of your substance in the cause of Allah and make not\n\t\t\tyour own hands contribute to your destruction but do good; for\n\t\t\tAllah loveth those who do good. \u003cspan class=\u0027fn\u0027\u003e211\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "196",
        "Recitation":  "Alafasy_128kbps/002196",
        "Body":  "And complete the Hajj or `Umra in the service of Allah.  But if\n\t\t\tye are prevented (from completing it) send an offering for\n\t\t\tsacrifice such as ye may find and do not shave your heads until\n\t\t\tthe offering reaches the place of sacrifice.  And if any of you\n\t\t\tis ill or has an ailment in his scalp (necessitating shaving) (he\n\t\t\tshould) in compensation either fast or feed the poor or offer\n\t\t\tsacrifice; and when ye are in peaceful conditions (again) if\n\t\t\tanyone wishes to continue the \u0027Umra on to the Hajj he must make\n\t\t\tan offering such as he can afford it he should fast three days\n\t\t\tduring the Hajj and seven days on his return making ten days in\n\t\t\tall.  This is for those whose household is not in (the precincts\n\t\t\tof) the Sacred Mosque.\tAnd fear Allah and know that Allah is\n\t\t\tstrict in punishment. \u003cspan class=\u0027fn\u0027\u003e212\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e213\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e214\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e215\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e216\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "197",
        "Recitation":  "Alafasy_128kbps/002197",
        "Body":  "For Hajj are the months well known.  If anyone undertakes that\n\t\t\tduty therein let there be no obscenity nor wickedness nor\n\t\t\twrangling in the Hajj.\tAnd whatever good ye do (be sure) Allah\n\t\t\tknoweth it.  And take a provision (with you) for the journey but\n\t\t\tthe best of provisions is right conduct.  So fear Me O ye that\n\t\t\tare wise.! \u003cspan class=\u0027fn\u0027\u003e217\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e218\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "198",
        "Recitation":  "Alafasy_128kbps/002198",
        "Body":  "It is no crime in you if ye seek of the bounty of your Lord\n\t\t\t(during Pilgrimage).  Then when ye pour down from (Mount) Arafat\n\t\t\tcelebrate the praises of Allah at the Sacred Monument and\n\t\t\tcelebrate His praises as He has directed you even though before\n\t\t\tthis ye went astray. \u003cspan class=\u0027fn\u0027\u003e219\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e220\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e221\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "199",
        "Recitation":  "Alafasy_128kbps/002199",
        "Body":  "Then pass on at a quick pace from the place whence it is usual\n\t\t\tfor the multitude so to do and ask for Allah\u0027s forgiveness.  For\n\t\t\tAllah is Oft Forgiving Most Merciful. \u003cspan class=\u0027fn\u0027\u003e222\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/002002",
        "Body":  "This is the Book; in it is guidance sure without doubt to those\n\t\t\twho fear Allah. \u003cspan class=\u0027fn\u0027\u003e26\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/002020",
        "Body":  "The lightning all but snatches away their sight; every time the\n\t\t\tlight (helps) them they walk therein and when the darkness grows\n\t\t\ton them they stand still.  And if Allah willed He could take away\n\t\t\ttheir faculty of hearing and seeing; for Allah hath power over\n\t\t\tall things."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "200",
        "Recitation":  "Alafasy_128kbps/002200",
        "Body":  "So when ye have accomplished your holy rites celebrate the\n\t\t\tpraises of Allah as ye used to celebrate the praises of your\n\t\t\tfathers yea with far more heart and soul.  There are men who say:\n\t\t\t\"Our Lord! give us (thy bounties) in this world!\" but they will\n\t\t\thave no portion in the hereafter. \u003cspan class=\u0027fn\u0027\u003e223\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e224\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "201",
        "Recitation":  "Alafasy_128kbps/002201",
        "Body":  "And there are men who say: \"Our Lord! give us good in this world\n\t\t\tand good in the Hereafter and defend us from the torment on the\n\t\t\tfire!\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "202",
        "Recitation":  "Alafasy_128kbps/002202",
        "Body":  "To these will be allotted what they have earned and Allah is\n\t\t\tquick in account. \u003cspan class=\u0027fn\u0027\u003e225\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "203",
        "Recitation":  "Alafasy_128kbps/002203",
        "Body":  "Celebrate the praises of Allah during the Appointed Days but if\n\t\t\tanyone hastens to leave in two days there is no blame on him and\n\t\t\tif anyone stays on there is no blame on him if his aim is to do\n\t\t\tright.\tThen fear Allah and know that ye will surely be gathered\n\t\t\tunto Him. \u003cspan class=\u0027fn\u0027\u003e226\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "204",
        "Recitation":  "Alafasy_128kbps/002204",
        "Body":  "There is the type of man whose speech about this world\u0027s life may\n\t\t\tdazzle thee and he calls Allah to witness about what is in his\n\t\t\theart; yet is he the most contentious of enemies. \u003cspan class=\u0027fn\u0027\u003e227\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "205",
        "Recitation":  "Alafasy_128kbps/002205",
        "Body":  "When he turns his back his aim everywhere is to spread mischief\n\t\t\tthrough the earth and destroy crops and cattle.  But Allah loveth\n\t\t\tnot mischief."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "206",
        "Recitation":  "Alafasy_128kbps/002206",
        "Body":  "When it is said to him \"Fear Allah\" he is led by arrogance to\n\t\t\t(more) crime.  Enough for him is Hell; an evil bed indeed (to lie\n\t\t\ton)! \u003cspan class=\u0027fn\u0027\u003e228\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "207",
        "Recitation":  "Alafasy_128kbps/002207",
        "Body":  "And there is the type of man who gives his life to earn the\n\t\t\tpleasure of Allah; and Allah is full of kindness to (His)\n\t\t\tdevotees. \u003cspan class=\u0027fn\u0027\u003e229\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "208",
        "Recitation":  "Alafasy_128kbps/002208",
        "Body":  "O ye who believe! enter into Islam whole-heartedly; and follow\n\t\t\tnot the footsteps of the Evil One; for he is to you an avowed\n\t\t\tenemy."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "209",
        "Recitation":  "Alafasy_128kbps/002209",
        "Body":  "If ye backslide after the clear (signs) have come to you then\n\t\t\tknow that Allah is Exalted in Power Wise. \u003cspan class=\u0027fn\u0027\u003e230\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/002021",
        "Body":  "O ye people! adore your Guardian-Lord who created you and those\n\t\t\twho came before you that ye may have the chance to learn\n\t\t\trighteousness. \u003cspan class=\u0027fn\u0027\u003e40\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "210",
        "Recitation":  "Alafasy_128kbps/002210",
        "Body":  "Will they wait until Allah comes to them in canopies of clouds\n\t\t\twith angels (in His train) and the question is (thus) settled? \n\t\t\tBut to Allah do all questions go back (for decision).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e231\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "211",
        "Recitation":  "Alafasy_128kbps/002211",
        "Body":  "Ask the Children of Israel how many Clear (Signs) We have sent\n\t\t\tthem. But if anyone after Allah\u0027s favor has come to him\n\t\t\tsubstitutes (something else) Allah is strict in punishment.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e232\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e233\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "212",
        "Recitation":  "Alafasy_128kbps/002212",
        "Body":  "The life of this world is alluring to those who reject faith and\n\t\t\tthey scoff at those who believe.  But the righteous will be above\n\t\t\tthem on the Day of Resurrection; for Allah bestows His abundance\n\t\t\twithout measures on whom He will. \u003cspan class=\u0027fn\u0027\u003e234\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "213",
        "Recitation":  "Alafasy_128kbps/002213",
        "Body":  "Mankind was one single nation and Allah sent Messengers with glad\n\t\t\ttidings and warnings; and with them He sent the Book in truth to\n\t\t\tjudge between people in matters wherein they differed; but the\n\t\t\tPeople of the Book after the clear Signs came to them did not\n\t\t\tdiffer among themselves except through selfish contumacy.  Allah\n\t\t\tby His Grace guided the believers to the truth concerning that\n\t\t\twherein they differed. For Allah guides whom He will to a path\n\t\t\tthat is straight."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "214",
        "Recitation":  "Alafasy_128kbps/002214",
        "Body":  "Or do ye think that ye shall enter the Garden (of Bliss) without\n\t\t\tsuch (trials) as came to those who passed away before you?  They\n\t\t\tencountered suffering and adversity and were so shaken in spirit\n\t\t\tthat even the Apostle and those of faith who were with him cried:\n\t\t\t\"When (will come) the help of Allah?\"  Ah! verily the help of\n\t\t\tAllah is (always) near!"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "215",
        "Recitation":  "Alafasy_128kbps/002215",
        "Body":  "They ask thee what they should spend (in charity).  Say: Whatever\n\t\t\tye spend that is good is for parents and kindred and orphans and\n\t\t\tthose in want and for wayfarers.  And whatever ye do that is good\n\t\t\tAllah knoweth it well. \u003cspan class=\u0027fn\u0027\u003e235\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "216",
        "Recitation":  "Alafasy_128kbps/002216",
        "Body":  "Fighting is prescribed for you and ye dislike it.  But it is\n\t\t\tpossible that ye dislike a thing which is good for you and that\n\t\t\tye love a thing which is bad for you.  But Allah knoweth and ye\n\t\t\tknow not. \u003cspan class=\u0027fn\u0027\u003e236\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "217",
        "Recitation":  "Alafasy_128kbps/002217",
        "Body":  "They ask thee concerning fighting in the Prohibited Month.  Say:\n\t\t\t\"Fighting therein is a grave (offence); but graver is it in the\n\t\t\tsight of Allah to prevent access to the path of Allah to deny Him\n\t\t\tto prevent access to the Sacred Mosque and drive out its members.\n\t\t\t Tumult and oppression are worse than slaughter.  Nor will they\n\t\t\tcease fighting you until they turn you back from your faith if\n\t\t\tthey can.  And if any of you turn back from their faith and die\n\t\t\tin unbelief their works will bear no fruit in this life and in\n\t\t\tthe Hereafter; they will be Companions of the Fire and will abide\n\t\t\ttherein. \u003cspan class=\u0027fn\u0027\u003e237\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e238\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e239\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "218",
        "Recitation":  "Alafasy_128kbps/002218",
        "Body":  "Those who believed and those who suffered exile and fought (and\n\t\t\tstrove and struggled) in the path of Allah they have the hope of\n\t\t\tthe Mercy of Allah; and Allah is Oft-Forgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "219",
        "Recitation":  "Alafasy_128kbps/002219",
        "Body":  "They ask thee concerning wine and gambling.  Say: \"In them is\n\t\t\tgreat sin and some profit for men; but the sin is greater than\n\t\t\tthe profit.\" They ask thee how much they are to spend; say: \"What\n\t\t\tis beyond your needs.\"\tThus doth Allah make clear to you His\n\t\t\tSigns: in order that ye may consider. \u003cspan class=\u0027fn\u0027\u003e240\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e241\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e242\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/002022",
        "Body":  "Who has made the earth your couch and the heaven your canopy; and\n\t\t\tsent down rain from the heavens; and brought forth therewith\n\t\t\tfruits for your sustenance; then set not up rivals unto Allah\n\t\t\twhen ye know (the truth). \u003cspan class=\u0027fn\u0027\u003e41\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "220",
        "Recitation":  "Alafasy_128kbps/002220",
        "Body":  "(Their bearings) on this life and the Hereafter.  They ask thee\n\t\t\tconcerning orphans.  Say: \"The best thing to do is what is for\n\t\t\ttheir good; if ye mix their affairs with yours they are your\n\t\t\tbrethren; but Allah knows the man who means mischief from the man\n\t\t\twho means good.  And if Allah had wished He could have put you\n\t\t\tinto difficulties: He is indeed Exalted in Power Wise.\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e243\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "221",
        "Recitation":  "Alafasy_128kbps/002221",
        "Body":  "Do not marry unbelieving women (idolaters) until they believe; a\n\t\t\tslave woman who believes is better than an unbelieving woman even\n\t\t\tthough she allure you.\tNor marry (your girls) to unbelievers\n\t\t\tuntil they believe: a man slave who believes is better than un\n\t\t\tunbeliever even though he allure you.  Unbelievers do (but)\n\t\t\tbeckon you to the fire.  But Allah beckons by His grace to the\n\t\t\tGarden (of Bliss) and forgiveness and makes His Signs clear to\n\t\t\tmankind: that they may celebrate His praise. \u003cspan class=\u0027fn\u0027\u003e246\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "222",
        "Recitation":  "Alafasy_128kbps/002222",
        "Body":  "They ask thee concerning women\u0027s courses.  Say: They are a hurt\n\t\t\tand a pollution; so keep away from women in their courses and do\n\t\t\tnot approach them until they are clean.  But when they have\n\t\t\tpurified themselves ye may approach them in any manner time or\n\t\t\tplace ordained for you by Allah.  For Allah loves those who turn\n\t\t\tto Him constantly and He loves those who keep themselves pure and\n\t\t\tclean. \u003cspan class=\u0027fn\u0027\u003e247\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e248\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "223",
        "Recitation":  "Alafasy_128kbps/002223",
        "Body":  "Your wives are as a tilth unto you; so approach your tilth when\n\t\t\tor how ye will.  But do some good act for your souls beforehand;\n\t\t\tand fear Allah and know that ye are to meet Him (in the\n\t\t\tHereafter) and give (these) good tidings to those who believe.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e249\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e250\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "224",
        "Recitation":  "Alafasy_128kbps/002224",
        "Body":  "And make not Allah\u0027s (name) an excuse in your oaths against doing\n\t\t\tgood or acting rightly or making peace between persons; for Allah\n\t\t\tis one who heareth and knoweth all things. \u003cspan class=\u0027fn\u0027\u003e251\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "225",
        "Recitation":  "Alafasy_128kbps/002225",
        "Body":  "Allah will not call you to account for thoughtlessness in your\n\t\t\toaths but for the intention in your hearts; and He is\n\t\t\tOft-Forgiving Most Forbearing. \u003cspan class=\u0027fn\u0027\u003e252\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "226",
        "Recitation":  "Alafasy_128kbps/002226",
        "Body":  "For those who take an oath for abstention from their wives a\n\t\t\twaiting for four months is ordained; if then they return Allah is\n\t\t\tOft-Forgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "227",
        "Recitation":  "Alafasy_128kbps/002227",
        "Body":  "But if their intention is firm for divorce Allah heareth and\n\t\t\tknoweth all things. \u003cspan class=\u0027fn\u0027\u003e253\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "228",
        "Recitation":  "Alafasy_128kbps/002228",
        "Body":  "Divorced women shall wait concerning themselves for three monthly\n\t\t\tperiods nor is it lawful for them to hide what Allah hath created\n\t\t\tin their wombs if they have faith in Allah and the Last Day.  And\n\t\t\ttheir husbands have the better right to take them back in that\n\t\t\tperiod if they wish for reconciliation.  And women shall have\n\t\t\trights similar to the rights against them according to what is\n\t\t\tequitable; but men have a degree (of advantage) over them and\n\t\t\tAllah is Exalted in Power Wise. \u003cspan class=\u0027fn\u0027\u003e254\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e255\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "229",
        "Recitation":  "Alafasy_128kbps/002229",
        "Body":  "A divorce is only permissible twice: after that the parties\n\t\t\tshould either hold together on equitable terms or separate with\n\t\t\tkindness.  It is not lawful for you (men) to take back any of\n\t\t\tyour gifts (from your wives) except when both parties fear that\n\t\t\tthey would be unable to keep the limits ordained by Allah.  If ye\n\t\t\t(judges) do indeed fear that they would be unable to keep the\n\t\t\tlimits ordained by Allah there is no blame on either of them if\n\t\t\tshe give something for her freedom. These are the limits ordained\n\t\t\tby Allah; so do not transgress them.  If any do transgress the\n\t\t\tlimits ordained by Allah such persons wrong (themselves as well\n\t\t\tas others). \u003cspan class=\u0027fn\u0027\u003e256\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e257\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e258\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e259\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/002023",
        "Body":  "And if ye are in doubt as to what We have revealed from time to\n\t\t\ttime to Our servant then produce a Surah like thereunto; and call\n\t\t\tyour witnesses or helpers (if there are any) besides Allah if\n\t\t\tyour (doubts) are true. \u003cspan class=\u0027fn\u0027\u003e42\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "230",
        "Recitation":  "Alafasy_128kbps/002230",
        "Body":  "So if a husband divorces his wife (irrevocably) he cannot after\n\t\t\tthat remarry her until after she has married another husband and\n\t\t\the has divorced her.  In that case there is no blame on either of\n\t\t\tthem if they reunite provided they feel that they can keep the\n\t\t\tlimits ordained by Allah.  Such are the limits ordained by Allah\n\t\t\twhich He makes plain to those who understand. \u003cspan class=\u0027fn\u0027\u003e260\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "231",
        "Recitation":  "Alafasy_128kbps/002231",
        "Body":  "When ye divorce women and they fulfil the term of their (`Iddat)\n\t\t\teither take them back on equitable terms or set them free on\n\t\t\tequitable terms; but do not take them back to injure them or to\n\t\t\ttake undue advantage; if anyone does that He wrongs his own soul.\n\t\t\t Do not treat Allah\u0027s Signs as a jest but solemnly rehearse\n\t\t\tAllah\u0027s favors on you and the fact that He sent down to you the\n\t\t\tBook and Wisdom for your instruction.  And fear Allah and know\n\t\t\tthat Allah is well acquainted with all things. \u003cspan class=\u0027fn\u0027\u003e261\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e262\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e263\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e264\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "232",
        "Recitation":  "Alafasy_128kbps/002232",
        "Body":  "When ye divorce women and they fulfil the term of their (`Iddat)\n\t\t\tdo not prevent them from marrying their (former) husbands if they\n\t\t\tmutually agree on equitable terms.  This instruction is for all\n\t\t\tamongst you who believe in Allah and the Last Day.  That is (the\n\t\t\tcourse making for) most virtue and purity amongst you and Allah\n\t\t\tknows and ye know not. \u003cspan class=\u0027fn\u0027\u003e265\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "233",
        "Recitation":  "Alafasy_128kbps/002233",
        "Body":  "The mothers shall give suck to their offspring for two whole\n\t\t\tyears if the father desires to complete the term.  But he shall\n\t\t\tbear the cost of their food and clothing on equitable terms.  No\n\t\t\tsoul shall have a burden laid on it greater than it can bear.  No\n\t\t\tmother shall be treated unfairly on account of her child nor\n\t\t\tfather on account of his child.  An heir shall be chargeable in\n\t\t\tthe same way if they both decide on weaning by mutual consent and\n\t\t\tafter due consultation there is no blame on them.  If ye decide\n\t\t\ton a foster-mother for your offspring there is no blame on you\n\t\t\tprovided ye pay (the mother) what ye offered on equitable terms. \n\t\t\tBut fear Allah and know that Allah sees well what ye do.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e266\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "234",
        "Recitation":  "Alafasy_128kbps/002234",
        "Body":  "If any of you die and leave widows behind they shall wait\n\t\t\tconcerning themselves four months and ten days: when they have\n\t\t\tfulfilled their term there is no blame on you if they dispose of\n\t\t\tthemselves in a just and reasonable manner.  And Allah is well\n\t\t\tacquainted with what ye do. \u003cspan class=\u0027fn\u0027\u003e267\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "235",
        "Recitation":  "Alafasy_128kbps/002235",
        "Body":  "There is no blame on you if ye make an offer of betrothal or hold\n\t\t\tit in your hearts.  Allah knows that ye cherish them in your\n\t\t\thearts: but do not make a secret contract with them except in\n\t\t\tterms honorable nor resolve on the tie of marriage till the term\n\t\t\tprescribed is fulfilled. And know that Allah knoweth what is in\n\t\t\tyour hearts and take heed of Him; and know that Allah is Oft\n\t\t\tForgiving Most Forbearing. \u003cspan class=\u0027fn\u0027\u003e268\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "236",
        "Recitation":  "Alafasy_128kbps/002236",
        "Body":  "There is no blame on you if ye divorce women before consummation\n\t\t\tor the fixation of their dower; but bestow on them (a suitable\n\t\t\tgift) the wealthy according to his means and the poor according\n\t\t\tto his means; a gift of a reasonable amount is due from those who\n\t\t\twish to do the right thing."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "237",
        "Recitation":  "Alafasy_128kbps/002237",
        "Body":  "And if ye divorce them before consummation but after the fixation\n\t\t\tof a dower for them then the half of the dower (is due to them)\n\t\t\tunless they remit it.  Or (the man\u0027s half) is remitted by him in\n\t\t\twhose hands is the marriage tie; and the remission (of the man\u0027s\n\t\t\thalf) is the nearest to righteousness.\tAnd do not forget\n\t\t\tliberality between yourselves.\tFor Allah sees well all that ye\n\t\t\tdo. \u003cspan class=\u0027fn\u0027\u003e269\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e270\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "238",
        "Recitation":  "Alafasy_128kbps/002238",
        "Body":  "Guard strictly your (habit of) prayers especially the middle\n\t\t\tprayer and stand before Allah in a devout (frame of mind).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e271\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "239",
        "Recitation":  "Alafasy_128kbps/002239",
        "Body":  "If ye fear (an enemy) pray on foot or riding (as may be most\n\t\t\tconvenient) but when ye are in security celebrate Allah\u0027s praises\n\t\t\tin the manner He has taught you which ye knew not (before).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e272\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/002024",
        "Body":  "But if ye cannot and of a surety ye cannot then fear the fire\n\t\t\twhose fuel is Men and Stones which is prepared for those who\n\t\t\treject Faith. \u003cspan class=\u0027fn\u0027\u003e43\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "240",
        "Recitation":  "Alafasy_128kbps/002240",
        "Body":  "Those of you who die and leave widows should bequeath for their\n\t\t\twidows a year\u0027s maintenance and residence; but if they leave (the\n\t\t\tresidence) there is no blame on you for what they do with\n\t\t\tthemselves provided it is reasonable and Allah is Exalted in\n\t\t\tPower Wise. \u003cspan class=\u0027fn\u0027\u003e273\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "241",
        "Recitation":  "Alafasy_128kbps/002241",
        "Body":  "For divorced women maintenance (should be provided) on a\n\t\t\treasonable (scale).  This is a duty on the righteous."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "242",
        "Recitation":  "Alafasy_128kbps/002242",
        "Body":  "Thus doth Allah make clear His Signs to you: in order that ye may\n\t\t\tunderstand."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "243",
        "Recitation":  "Alafasy_128kbps/002243",
        "Body":  "Didst thou not turn thy vision to those who abandoned their homes\n\t\t\tthough they were thousands (in number) for fear of death?  Allah\n\t\t\tsaid to them: \"Die.\"  Then He restored them to life.  For Allah\n\t\t\tis full of bounty to mankind but most of them are ungrateful.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e274\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "244",
        "Recitation":  "Alafasy_128kbps/002244",
        "Body":  "Then fight in the cause of Allah and know that Allah heareth and\n\t\t\tknoweth all things. \u003cspan class=\u0027fn\u0027\u003e275\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "245",
        "Recitation":  "Alafasy_128kbps/002245",
        "Body":  "Who is he that will loan to Allah a beautiful loan which Allah\n\t\t\twill double unto his credit and multiply many times?  It is Allah\n\t\t\tthat giveth (you) want or plenty and to Him shall be your return.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e276\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "246",
        "Recitation":  "Alafasy_128kbps/002246",
        "Body":  "Hast thou not turned thy vision to the chiefs of the children of\n\t\t\tIsrael after (the time of) Moses?  They said to a Prophet (that\n\t\t\twas) among them: \"Appoint for us a king that we may fight in the\n\t\t\tcause of Allah.\" He said: \"Is it not possible if ye were\n\t\t\tcommanded to fight that ye will not fight?\"  They said: \"How\n\t\t\tcould we refuse to fight in the cause of Allah seeing that we\n\t\t\twere turned out of our homes and our families?\" But when they\n\t\t\twere commanded to fight they turned back except a small band\n\t\t\tamong them.  But Allah has full knowledge of those who do wrong.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e277\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e278\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e279\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "247",
        "Recitation":  "Alafasy_128kbps/002247",
        "Body":  "Their Prophet said to them: \"Allah hath appointed Talut as king\n\t\t\tover you.\"  They say: \"How can he exercise authority over us when\n\t\t\twe are better fitted than he to exercise authority and he is not\n\t\t\teven gifted with wealth in abundance?\"\tHe said: \"Allah hath\n\t\t\tchosen him above you and hath gifted him abundantly with\n\t\t\tknowledge and bodily prowess; Allah granteth His authority to\n\t\t\twhom He pleaseth.  Allah careth for all and He knoweth all\n\t\t\tthings.\" \u003cspan class=\u0027fn\u0027\u003e280\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "248",
        "Recitation":  "Alafasy_128kbps/002248",
        "Body":  "And (further) their Prophet said to them: \"A sign of his\n\t\t\tauthority is that there shall come to you the Ark of the Covenant\n\t\t\twith (an assurance) therein of security from your Lord and the\n\t\t\trelics left by the family of Moses and the family of Aaron\n\t\t\tcarried by angels.  In this is a Symbol for you if ye indeed have\n\t\t\tfaith.\" \u003cspan class=\u0027fn\u0027\u003e281\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e282\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e283\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "249",
        "Recitation":  "Alafasy_128kbps/002249",
        "Body":  "When Talut set forth with the armies he said: \"Allah will test\n\t\t\tyou at the stream; if any drinks of its water he goes not with my\n\t\t\tarmy; only those who taste not of it go with me; a mere sip out\n\t\t\tof the hand is excused.\"  But they all drank of it except a few. \n\t\t\tWhen they crossed the river he and the faithful ones with him\n\t\t\tthey said: \"This day we cannot cope with Goliath and his forces.\"\n\t\t\t But those who were convinced that they must meet Allah said:\n\t\t\t\"How oft by Allah\u0027s will hath a small force vanquished a big one?\n\t\t\t Allah is with those who steadfastly persevere.\" \u003cspan class=\u0027fn\u0027\u003e284\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e285\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/002025",
        "Body":  "But give glad tidings to those who believe and work righteousness\n\t\t\tthat their portion is Gardens beneath which rivers flow.  Every\n\t\t\ttime they are fed with fruits therefrom they say: \"Why this is\n\t\t\twhat we were fed with before\" for they are given things in\n\t\t\tsimilitude; and they have therein companions (pure and holy); and\n\t\t\tthey abide therein (for ever). \u003cspan class=\u0027fn\u0027\u003e44\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "250",
        "Recitation":  "Alafasy_128kbps/002250",
        "Body":  "When they advanced to meet Goliath and his forces they prayed:\n\t\t\t\"Our Lord! pour out constancy on us and make our steps firm; help\n\t\t\tus against those that reject faith.\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "251",
        "Recitation":  "Alafasy_128kbps/002251",
        "Body":  "By Allah\u0027s will they routed them: and David slew Goliath; and\n\t\t\tAllah gave him power and wisdom and taught him whatever (else) He\n\t\t\twilled.  And did not Allah check one set of people by means of\n\t\t\tanother the earth would indeed be full of mischief but Allah is\n\t\t\tfull of bounty to all the worlds. \u003cspan class=\u0027fn\u0027\u003e286\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e287\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e283\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "252",
        "Recitation":  "Alafasy_128kbps/002252",
        "Body":  "These are the signs of Allah; We rehearse them to thee in truth:\n\t\t\tverily thou art one of the apostles."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "253",
        "Recitation":  "Alafasy_128kbps/002253",
        "Body":  "Those apostles We endowed with gifts some above others: to one of\n\t\t\tthem Allah spoke; others He raised to degrees (of honor); to\n\t\t\tJesus the son of Mary We gave clear (Signs) and strengthened him\n\t\t\twith the Holy Spirit.  If Allah had so willed succeeding\n\t\t\tgenerations would not have fought among each other after clear\n\t\t\t(Signs) had come to them but they (chose) to wrangle some\n\t\t\tbelieving and others rejecting.  If Allah had so willed they\n\t\t\twould not have fought each other; but Allah fulfilleth His plan.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e289\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e290\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e291\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e292\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e293\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "254",
        "Recitation":  "Alafasy_128kbps/002254",
        "Body":  "O ye who believe! spend out of (the bounties) We have provided\n\t\t\tfor you before the day comes when no bargaining (will avail) nor\n\t\t\tfriendship nor intercession.  Those who reject faith they are the\n\t\t\twrong-doers. \u003cspan class=\u0027fn\u0027\u003e294\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e295\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "255",
        "Recitation":  "Alafasy_128kbps/002255",
        "Body":  "Allah! there is no Allah but He the living the Self-subsisting\n\t\t\tEternal. No slumber can seize him nor sleep.  His are all things\n\t\t\tin the heavens and on earth.  Who is there can intercede in His\n\t\t\tpresence except as He permitteth?  He knoweth what (appeareth to\n\t\t\this creatures as) before or after or behind them.  Nor shall they\n\t\t\tcompass aught of his knowledge except as He willeth.  His throne\n\t\t\tdoth extend over the heavens and the earth and He feeleth no\n\t\t\tfatigue in guarding and preserving them.  For He is the Most High\n\t\t\tthe Supreme (in glory). \u003cspan class=\u0027fn\u0027\u003e296\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e297\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e298\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e259\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "256",
        "Recitation":  "Alafasy_128kbps/002256",
        "Body":  "Let there be no compulsion in religion.  Truth stands out clear\n\t\t\tfrom error; whoever rejects evil and believes in Allah hath\n\t\t\tgrasped the most trustworthy hand-hold that never breaks.  And\n\t\t\tAllah heareth and knoweth all things. \u003cspan class=\u0027fn\u0027\u003e300\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e301\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "257",
        "Recitation":  "Alafasy_128kbps/002257",
        "Body":  "Allah is the Protector of those who have faith: from the depths\n\t\t\tof darkness He will lead them forth into light.  Of those who\n\t\t\treject faith the patrons are the Evil Ones: from light they will\n\t\t\tlead them forth into the depths of darkness.  They will be\n\t\t\tcompanions of the fire to dwell therein (for ever)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "258",
        "Recitation":  "Alafasy_128kbps/002258",
        "Body":  "Hast thou not turned thy vision to one who disputed with Abraham\n\t\t\tabout his Lord because Allah had granted him power?  Abraham\n\t\t\tsaid: \"My Lord is He Who Giveth life and death.\"  He said: \"I\n\t\t\tgive life and death.\" Said Abraham: \"but it is Allah that causeth\n\t\t\tthe sun to rise from the East do thou then cause him to rise from\n\t\t\tthe West.\"  Thus was he confounded who (in arrogance) rejected\n\t\t\tfaith.\tNor doth Allah give guidance to a people unjust.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e302\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e303\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "259",
        "Recitation":  "Alafasy_128kbps/002259",
        "Body":  "Or (take) the similitude of one who passed by a hamlet all in\n\t\t\truins to its roofs.  He said: \"Oh! how shall Allah bring it\n\t\t\t(ever) to life after (this) its death?\"  But Allah caused him to\n\t\t\tdie for a hundred years then raised him up (again).  He said:\n\t\t\t\"How long didst thou tarry (thus)?\"  He said: \"(perhaps) a day or\n\t\t\tpart of a day.\"  He said: \"Nay thou hast tarried thus a hundred\n\t\t\tyears; but look at thy food and thy drink; they show no signs of\n\t\t\tage; and look at thy donkey: and that We may make of thee a Sign\n\t\t\tunto the people look further at the bones how We bring them\n\t\t\ttogether and clothe them with flesh!  When this was shown clearly\n\t\t\tto him he said: \"I know that Allah hath power over all things.\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e304\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e305\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/002026",
        "Body":  "Allah disdains not to use the similitude of things lowest as well\n\t\t\tas highest.  Those who believe know that it is truth from their\n\t\t\tLord; but those who reject Faith say: \"What means Allah by this\n\t\t\tsimilitude?\" By it He causes many to stray and many He leads into\n\t\t\tthe right path but He causes not to stray except those who\n\t\t\tforsake (the path). \u003cspan class=\u0027fn\u0027\u003e45\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "260",
        "Recitation":  "Alafasy_128kbps/002260",
        "Body":  "Behold! Abraham said: \"My Lord! show me how thou givest life to\n\t\t\tthe dead.  He said: \"Dost thou not then believe?\"  He said: \"Yea!\n\t\t\tbut to satisfy my own understanding.\"  He said: \"Take four birds;\n\t\t\ttame them to turn to thee; put a portion of them on every hill\n\t\t\tand call to them; they will come to thee (flying) with speed. \n\t\t\tThen know that Allah is Exalted in Power Wise.\" \u003cspan class=\u0027fn\u0027\u003e306\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e307\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e308\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "261",
        "Recitation":  "Alafasy_128kbps/002261",
        "Body":  "The parable of those who spend their substance in the way of\n\t\t\tAllah is that of a grain of corn: it groweth seven ears and each\n\t\t\tear hath a hundred grains.  Allah giveth manifold increase to\n\t\t\twhom He pleaseth; and Allah careth for all and He knoweth all\n\t\t\tthings."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "262",
        "Recitation":  "Alafasy_128kbps/002262",
        "Body":  "Those who spend their substance in the cause of Allah and follow\n\t\t\tnot up their gifts with reminders of their generosity or with\n\t\t\tinjury for them their reward is with their Lord; on them shall be\n\t\t\tno fear nor shall they grieve."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "263",
        "Recitation":  "Alafasy_128kbps/002263",
        "Body":  "Kind words and the covering of faults are better than charity\r\n\t\t\tfollowed by injury.  Allah is free of all wants and he is Most\r\n\t\t\tForbearing. \u003cspan class=\u0027fn\u0027\u003e309\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "264",
        "Recitation":  "Alafasy_128kbps/002264",
        "Body":  "O ye who believe! cancel not your charity by reminders of your\n\t\t\tgenerosity or by injury like those who spend their substance to\n\t\t\tbe seen of men but believe neither in Allah nor in the last day. \n\t\t\tThey are in Parable like a hard barren rock on which is a little\n\t\t\tsoil; on it falls heavy rain which leaves it (just) a bare stone.\n\t\t\t They will be able to do nothing with aught they have earned. \n\t\t\tAnd Allah guideth not those who reject faith. \u003cspan class=\u0027fn\u0027\u003e310\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "265",
        "Recitation":  "Alafasy_128kbps/002265",
        "Body":  "And the likeness of those who spend their substance seeking to\n\t\t\tplease Allah and to strengthen their souls is as a garden high\n\t\t\tand fertile: heavy rain falls on it but makes it yield a double\n\t\t\tincrease of harvest and if it receives not heavy rain light\n\t\t\tmoisture sufficeth it.\tAllah seeth well whatever ye do.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e311\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "266",
        "Recitation":  "Alafasy_128kbps/002266",
        "Body":  "Does any of you wish that he should have a garden with date-palms\n\t\t\tand vines and streams flowing underneath and all kinds of fruit\n\t\t\twhile he is stricken with old age and his children are not strong\n\t\t\t(enough to look after themselves) that it should be caught in a\n\t\t\twhirlwind with fire therein and be burnt up?  Thus doth Allah\n\t\t\tmake clear to you (His) signs; that ye may consider. \u003cspan class=\u0027fn\u0027\u003e312\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e313\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "267",
        "Recitation":  "Alafasy_128kbps/002267",
        "Body":  "O ye who believe! give of the good things which ye have\n\t\t\t(honorably) earned and of the fruits of the earth which We have\n\t\t\tproduced for you and do not even aim at getting anything which is\n\t\t\tbad in order that out of it ye may give away something when ye\n\t\t\tyourselves would not receive it except with closed eyes.  And\n\t\t\tknow that Allah is free of all wants and worthy of all praise.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e314\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e315\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e316\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e317\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "268",
        "Recitation":  "Alafasy_128kbps/002268",
        "Body":  "The Evil One threatens you with poverty and bids you to conduct\n\t\t\tunseemly.  Allah promiseth you His forgiveness and bounties and\n\t\t\tAllah careth for all and He knoweth all things. \u003cspan class=\u0027fn\u0027\u003e318\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "269",
        "Recitation":  "Alafasy_128kbps/002269",
        "Body":  "He granteth wisdom to whom He pleaseth; and he to whom wisdom is\n\t\t\tgranted receiveth indeed a benefit overflowing; but none will\n\t\t\tgrasp the message but men of understanding."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/002027",
        "Body":  "Those who break Allah\u0027s Covenant after it is ratified and who\n\t\t\tsunder what Allah has ordered to be joined and do mischief on\n\t\t\tearth: These cause loss (only) to themselves."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "270",
        "Recitation":  "Alafasy_128kbps/002270",
        "Body":  "And whatever ye spend in charity or devotion be sure Allah knows\n\t\t\tit all.  But the wrong-doers have no helpers."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "271",
        "Recitation":  "Alafasy_128kbps/002271",
        "Body":  "If ye disclose (acts of) charity even so it is well but if ye\n\t\t\tconceal them and make them reach those (really) in need that is\n\t\t\tbest for you: it will remove from you some of your (stains of)\n\t\t\tevil.  And Allah is well acquainted with what ye do. \u003cspan class=\u0027fn\u0027\u003e319\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "272",
        "Recitation":  "Alafasy_128kbps/002272",
        "Body":  "It is not required of thee (O Apostles) to set them on the right\n\t\t\tpath but Allah sets on the right path whom He pleaseth.  Whatever\n\t\t\tof good ye give benefits your own souls and ye shall only do so\n\t\t\tseeking the \"Face\" of Allah.  Whatever good ye give, shall be\n\t\t\trendered back to you and ye shall not be dealt with unjustly.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e320\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e321\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "273",
        "Recitation":  "Alafasy_128kbps/002273",
        "Body":  "(Charity is) for those in need who in Allah\u0027s cause are\n\t\t\trestricted (from travel) and cannot move about in the land\n\t\t\tseeking (for trade or work).  The ignorant man thinks because of\n\t\t\ttheir modesty that they are free from want.  Thou shalt know them\n\t\t\tby their (unfailing) mark: they beg not importunately from all\n\t\t\tand sundry.  And whatever of good ye give be assured Allah\n\t\t\tknoweth it well. \u003cspan class=\u0027fn\u0027\u003e322\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "274",
        "Recitation":  "Alafasy_128kbps/002274",
        "Body":  "Those who (in charity) spend of their goods by night and by day\n\t\t\tin secret and in public have their reward with their Lord: on\n\t\t\tthem shall be no fear nor shall they grieve. \u003cspan class=\u0027fn\u0027\u003e323\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "275",
        "Recitation":  "Alafasy_128kbps/002275",
        "Body":  "Those who devour usury will not stand except as stands one whom\n\t\t\tthe Evil One by his touch hath driven to madness.  That is\n\t\t\tbecause they say: \"Trade is like usury but Allah hath permitted\n\t\t\ttrade and forbidden usury.  Those who after receiving direction\n\t\t\tfrom their Lord desist shall be pardoned for the past; their case\n\t\t\tis for Allah (to judge); but those who repeat (the offence) are\n\t\t\tcompanions of the fire: they will abide therein (for ever).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e324\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e325\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e326\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "276",
        "Recitation":  "Alafasy_128kbps/002276",
        "Body":  "Allah will deprive usury of all blessing but will give increase\n\t\t\tfor deeds of charity: for He loveth not creatures ungrateful and\n\t\t\twicked."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "277",
        "Recitation":  "Alafasy_128kbps/002277",
        "Body":  "Those who believe and do deeds of righteousness and establish\n\t\t\tregular prayers and regular charity will have their reward with\n\t\t\ttheir Lord: on them shall be no fear nor shall they grieve.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e327\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "278",
        "Recitation":  "Alafasy_128kbps/002278",
        "Body":  "O ye who believe! fear Allah and give up what remains of your\n\t\t\tdemand for usury if ye are indeed believers."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "279",
        "Recitation":  "Alafasy_128kbps/002279",
        "Body":  "If ye do it not take notice of war from Allah and his Apostle:\n\t\t\tbut if ye turn back ye shall have your capital sums; deal not\n\t\t\tunjustly and ye shall not be dealt with unjustly. \u003cspan class=\u0027fn\u0027\u003e328\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/002028",
        "Body":  "How can ye reject the faith in Allah?  Seeing that ye were\n\t\t\twithout life and He gave you life; then will He cause you to die\n\t\t\tand will again bring you to life; and again to Him will ye\n\t\t\treturn. \u003cspan class=\u0027fn\u0027\u003e46\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "280",
        "Recitation":  "Alafasy_128kbps/002280",
        "Body":  "If the debtor is in a difficulty grant him time till it is easy\n\t\t\tfor him to repay.  But if ye remit if by way of charity that is\n\t\t\tbest for you if ye only knew."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "281",
        "Recitation":  "Alafasy_128kbps/002281",
        "Body":  "And fear the day when ye shall be brought back to Allah.  Then\n\t\t\tshall every soul be paid what it earned and none shall be dealt\n\t\t\twith unjustly."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "282",
        "Recitation":  "Alafasy_128kbps/002282",
        "Body":  "O ye who believe! when ye deal with each other in transactions\n\t\t\tinvolving future obligations in a fixed period of time reduce\n\t\t\tthem to writing.  Let a scribe write down faithfully as between\n\t\t\tthe parties: let not the scribe refuse to write as Allah has\n\t\t\ttaught him so let him write.  Let him who incurs the liability\n\t\t\tdictate but let him fear his Lord Allah and not diminish aught of\n\t\t\twhat he owes.  If the party liable is mentally deficient or weak\n\t\t\tor unable himself to dictate let his guardian dictate faithfully.\n\t\t\t And get two witnesses out of your own men and if there are not\n\t\t\ttwo men then a man and two women such as ye choose for witnesses\n\t\t\tso that if one of them errs the other can remind her.  The\n\t\t\twitnesses should not refuse when they are called on (for\n\t\t\tevidence).  Disdain not to reduce to writing (your contract) for\n\t\t\ta future period whether it be small or big: it is juster in the\n\t\t\tsight of Allah more suitable as evidence and more convenient to\n\t\t\tprevent doubts among yourselves; but if it be a transaction which\n\t\t\tye carry out on the spot among yourselves there is no blame on\n\t\t\tyou if ye reduce it not to writing.  But take witnesses whenever\n\t\t\tye make a commercial contract; and let neither scribe nor witness\n\t\t\tsuffer harm.  If ye do (such harm) it would be wickedness in you.\n\t\t\t So fear Allah; for it is Allah that teaches you.  And Allah is\n\t\t\twell acquainted with all things. \u003cspan class=\u0027fn\u0027\u003e329\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e330\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e331\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e332\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e333\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "283",
        "Recitation":  "Alafasy_128kbps/002283",
        "Body":  "If ye are on a journey and cannot find a scribe a pledge with\n\t\t\tpossession (may serve the purpose).  And if one of you deposits a\n\t\t\tthing on trust with another let the trustee (faithfully)\n\t\t\tdischarge his trust and let him fear his Lord.\tConceal not\n\t\t\tevidence; for whoever conceals it his heart is tainted with sin. \n\t\t\tAnd Allah knoweth all that ye do. \u003cspan class=\u0027fn\u0027\u003e334\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e335\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e336\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "284",
        "Recitation":  "Alafasy_128kbps/002284",
        "Body":  "To Allah belongeth all that is in the heavens and on earth. \n\t\t\tWhether ye show what is in your minds or conceal it Allah calleth\n\t\t\tyou to account for it.\tHe forgiveth whom He pleaseth and\n\t\t\tpunisheth whom He pleaseth.  For Allah hath power over all\n\t\t\tthings."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "285",
        "Recitation":  "Alafasy_128kbps/002285",
        "Body":  "The Apostle believeth in what hath been revealed to him from his\n\t\t\tLord as do the men of faith.  Each one (of them) believeth in\n\t\t\tAllah His angels His books and His Apostles \"We make no\n\t\t\tdistinction (they say) between one and another of His Apostles.\" \n\t\t\tAnd they say: \"We hear and we obey; (We seek) Thy forgiveness Our\n\t\t\tLord and to Thee is the end of all journeys.\" \u003cspan class=\u0027fn\u0027\u003e337\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e338\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e339\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "286",
        "Recitation":  "Alafasy_128kbps/002286",
        "Body":  "On no soul doth Allah place a burden greater than it can bear. \n\t\t\tIt gets every good that it earns and it suffers every ill that it\n\t\t\tearns. (Pray): \"Our Lord! condemn us not if we forget or fall\n\t\t\tinto error; our Lord! Lay not on us a burden like that which Thou\n\t\t\tdidst lay on those before us; Our Lord! lay not on us a burden\n\t\t\tgreater than we have strength to bear.\tBlot out our sins and\n\t\t\tgrant us forgiveness.  Have mercy on us.  Thou art our Protector;\n\t\t\thelp us against those who stand against faith.\" \u003cspan class=\u0027fn\u0027\u003e340\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e341\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e342\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/002029",
        "Body":  "It is He who hath created for you all things that are on earth;\n\t\t\tmoreover His design comprehended the heavens for He gave order\n\t\t\tand perfection to the seven firmaments; and of all things he hath\n\t\t\tperfect knowledge."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/002003",
        "Body":  "Who believe in the Unseen are steadfast in prayer and spend out\n\t\t\tof what We have provided for them. \u003cspan class=\u0027fn\u0027\u003e27\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/002030",
        "Body":  "Behold thy Lord said to the angels: \"I will create a vicegerent\n\t\t\ton earth.\"  They said \"Wilt thou place therein one who will make\n\t\t\tmischief therein and shed blood?  Whilst we do celebrate Thy\n\t\t\tpraises and glorify Thy holy (name)?\"  He said: \"I know what ye\n\t\t\tknow not.\" \u003cspan class=\u0027fn\u0027\u003e47\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/002031",
        "Body":  "And He taught Adam the nature of all things; then He placed them\n\t\t\tbefore the angels and said: \"Tell Me the nature of these if ye\n\t\t\tare right.\" \u003cspan class=\u0027fn\u0027\u003e48\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/002032",
        "Body":  "They said: \"Glory to Thee of knowledge we have none save that\n\t\t\tThou hast taught us: in truth it is Thou who art perfect in\n\t\t\tknowledge and wisdom.\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/002033",
        "Body":  "He said: \"O Adam! tell them their natures.\"  When he had told\n\t\t\tthem Allah said: \"Did I not tell you that I know the secrets of\n\t\t\theaven and earth and I know what ye reveal and what ye conceal?\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/002034",
        "Body":  "And behold We said to the angels: \"Bow down to Adam\"; and they\n\t\t\tbowed down not so Iblis he refused and was haughty he was of\n\t\t\tthose who reject Faith. \u003cspan class=\u0027fn\u0027\u003e49\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/002035",
        "Body":  "We said: \"O Adam! dwell thou and thy wife in the garden and eat\n\t\t\tof the bountiful things therein as (where and when) ye will but\n\t\t\tapproach not this tree or ye run into harm and transgression.\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e50\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e51\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/002036",
        "Body":  "Then did Satan make them slip from the (garden) and get them out\n\t\t\tof the state (of felicity) in which they had been.  We said: \"Get\n\t\t\tye down all (ye people) with enmity between yourselves.  On earth\n\t\t\twill be your dwelling place and your means of livelihood for a\n\t\t\ttime.\" \u003cspan class=\u0027fn\u0027\u003e52\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e53\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e54\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/002037",
        "Body":  "Then learnt Adam from his Lord words of inspiration and his Lord\n\t\t\tturned toward him; for He is Oft-Returning Most Merciful.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e55\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/002038",
        "Body":  "We said: \"Get ye down all from here; and if as is sure there\n\t\t\tcomes to you guidance from Me\" whosoever follows My guidance on\n\t\t\tthem shall be no fear nor shall they grieve. \u003cspan class=\u0027fn\u0027\u003e56\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/002039",
        "Body":  "\"But those who reject Faith and belie Our Signs they shall be\n\t\t\tCompanions of the Fire; they shall abide therein.\" \u003cspan class=\u0027fn\u0027\u003e57\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/002004",
        "Body":  "And who believe in the Revelation sent to thee and sent before\n\t\t\tthy time and (in their hearts) have the assurance of the\n\t\t\tHereafter. \u003cspan class=\u0027fn\u0027\u003e28\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/002040",
        "Body":  "O children of Israel! call to mind the (special) favor which I\n\t\t\tbestowed upon you and fulfil your covenant with Me as I fulfil My\n\t\t\tcovenant with you and fear none but Me. \u003cspan class=\u0027fn\u0027\u003e58\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/002041",
        "Body":  "And believe in what I reveal confirming the revelation which is\n\t\t\twith you and be not the first to reject faith therein nor sell My\n\t\t\tSigns for a small price: and fear Me and Me alone. \u003cspan class=\u0027fn\u0027\u003e59\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/002042",
        "Body":  "And cover not Truth with falsehood nor conceal the Truth when ye\n\t\t\tknow (what it is)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/002043",
        "Body":  "And be steadfast in prayer; practice regular charity; and bow\n\t\t\tdown your heads with those who bow down (in worship). \u003cspan class=\u0027fn\u0027\u003e60\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/002044",
        "Body":  "Do ye enjoin right conduct on the people and forget (to practice\n\t\t\tit) yourselves and yet ye study the Scripture?\tWill ye not\n\t\t\tunderstand?"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/002045",
        "Body":  "Nay seek (Allah\u0027s) help with patient perseverance and prayer: it\n\t\t\tis indeed hard except to those who bring a lowly spirit.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e61\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/002046",
        "Body":  "Who bear in mind the certainty that they are to meet their Lord\n\t\t\tand that they are to return to Him."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/002047",
        "Body":  "O children of Israel! call to mind the (special) favor which I\n\t\t\tbestowed upon You and that I preferred you to all others (for My\n\t\t\tmessage). \u003cspan class=\u0027fn\u0027\u003e62\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/002048",
        "Body":  "Then guard yourselves against a day when one soul shall not avail\n\t\t\tanother nor shall intercession be accepted for her nor shall\n\t\t\tcompensation be taken from her nor shall anyone be helped (from\n\t\t\toutside). \u003cspan class=\u0027fn\u0027\u003e63\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/002049",
        "Body":  "And remember We delivered you from the people of Pharaoh: they\n\t\t\tset you hard tasks and punishments slaughtered your sons and let\n\t\t\tyour womenfolk live; therein was a tremendous trial from your\n\t\t\tLord. \u003cspan class=\u0027fn\u0027\u003e64\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/002005",
        "Body":  "They are on (true) guidance from their Lord and it is these who\n\t\t\twill prosper. \u003cspan class=\u0027fn\u0027\u003e29\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/002050",
        "Body":  "And remember We divided the sea for you and saved you and drowned\n\t\t\tPharaoh\u0027s people within your very sight. \u003cspan class=\u0027fn\u0027\u003e65\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/002051",
        "Body":  "And remember We appointed forty nights for Moses and in his\n\t\t\tabsence you took the calf (for worship) and ye did grievous\n\t\t\twrong. \u003cspan class=\u0027fn\u0027\u003e66\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/002052",
        "Body":  "Even then We did forgive you; there was a chance for you to be\n\t\t\tgrateful. \u003cspan class=\u0027fn\u0027\u003e67\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/002053",
        "Body":  "And remember We gave Moses the Scripture and the criterion\n\t\t\t(between right and wrong) there was a chance for you to be guided\n\t\t\taright. \u003cspan class=\u0027fn\u0027\u003e68\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/002054",
        "Body":  "And remember Moses said to his people: \"O my people! Ye have\n\t\t\tindeed wronged yourselves by your worship of the calf so turn (in\n\t\t\trepentance) to your Maker and slay yourselves (the wrong-doers);\n\t\t\tthat will be better for you in the sight of your Maker.\"  Then He\n\t\t\tturned toward you (in forgiveness); for He is Oft-returning Most\n\t\t\tMerciful. \u003cspan class=\u0027fn\u0027\u003e69\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/002055",
        "Body":  "And remember ye said: \"O Moses! we shall never believe in thee\n\t\t\tuntil we see Allah manifestly\" but ye were dazed with thunder and\n\t\t\tlightning even as ye looked on. \u003cspan class=\u0027fn\u0027\u003e70\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/002056",
        "Body":  "Then We raised you up after your death; ye had the chance to be\n\t\t\tgrateful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/002057",
        "Body":  "And We gave You the shade of clouds and sent down to you manna\n\t\t\tand quails saying: \"Eat of the good things We have provided for\n\t\t\tyou\"; (but they rebelled); to Us they did no harm but they harmed\n\t\t\ttheir own souls. \u003cspan class=\u0027fn\u0027\u003e71\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/002058",
        "Body":  "And remember We said: \"Enter this town and eat of the plenty\n\t\t\ttherein as ye wish; but enter the gate with humility in posture\n\t\t\tand in words and We shall forgive you your faults and increase\n\t\t\t(the portion of) those who do good.\" \u003cspan class=\u0027fn\u0027\u003e72\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/002059",
        "Body":  "But the transgressors changed the word from that which had been\n\t\t\tgiven them; so We sent on the transgressors a plague from heaven\n\t\t\tfor that they infringed (our command) repeatedly."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/002006",
        "Body":  "As to those who reject Faith it is the same to them whether thou\n\t\t\twarn them or do not warn them; they will not believe. \u003cspan class=\u0027fn\u0027\u003e30\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/002060",
        "Body":  "And remember Moses prayed for water for his people; We said:\n\t\t\t\"Strike the rock with thy staff.\" Then gushed forth therefrom\n\t\t\ttwelve springs. Each group knew its own place for water.  So eat\n\t\t\tand drink of the sustenance provided by Allah and do no evil nor\n\t\t\tmischief on the (face of the) earth. \u003cspan class=\u0027fn\u0027\u003e73\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/002061",
        "Body":  "And remember ye said: \"O Moses! we cannot endure one kind of food\n\t\t\t(always); so beseech thy Lord for us to produce for us of what\n\t\t\tthe earth groweth its pot-herbs and cucumbers its garlic lentils\n\t\t\tand onions.\"  He said: \"will ye exchange the better for the\n\t\t\tworse?\tGo ye down to any town and ye shall find what ye want!\"\n\t\t\tThey were covered with humiliation and misery; they drew on\n\t\t\tthemselves the wrath of Allah. This because they went on\n\t\t\trejecting the signs of Allah and slaying His messengers without\n\t\t\tjust cause.  This because They rebelled and went on\n\t\t\ttransgressing. \u003cspan class=\u0027fn\u0027\u003e74\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e75\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/002062",
        "Body":  "Those who believe (in the Qur\u0027an) and those who follow the Jewish\n\t\t\t(Scriptures) and the Christians and the Sabians and who believe\n\t\t\tin Allah and the last day and work righteousness shall have their\n\t\t\treward with their Lord; on them shall be no fear nor shall they\n\t\t\tgrieve. \u003cspan class=\u0027fn\u0027\u003e76\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e77\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/002063",
        "Body":  "And remember We took your covenant and We raised above you (the\n\t\t\ttowering height) of Mount (Sinai) (saying): \"Hold firmly to what\n\t\t\tWe have given you and bring (ever) to remembrance what is therein\n\t\t\tperchance ye may fear Allah.\" \u003cspan class=\u0027fn\u0027\u003e78\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/002064",
        "Body":  "But ye turned back thereafter had it not been for the Grace and\n\t\t\tMercy of Allah to you ye had surely been among the lost."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/002065",
        "Body":  "And well ye knew those amongst you who transgressed in the matter\n\t\t\tof the Sabbath; We said to them: \"Be ye apes despised and\n\t\t\trejected.\" \u003cspan class=\u0027fn\u0027\u003e79\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/002066",
        "Body":  "So We made it an example to their own time and to their posterity\n\t\t\tand a lesson to those who fear Allah."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/002067",
        "Body":  "And remember Moses said to his people: \"Allah commands that ye\n\t\t\tsacrifice a heifer.\"  They said: \"Makest thou a laughing-stock of\n\t\t\tus?\" He said: \"Allah save me from being an ignorant (fool)!\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e80\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/002068",
        "Body":  "They said: \"Beseech on our behalf thy Lord to make plain to us\n\t\t\twhat (heifer) it is! He said: \"He says: The heifer should be\n\t\t\tneither too old nor too young but of middling age; now do what ye\n\t\t\tare commanded!."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/002069",
        "Body":  "They said: \"Beseech on our behalf thy Lord to make plain to us\n\t\t\ther color.\"  He said: \" He says a fawn-colored heifer pure and\n\t\t\trich in tone the admiration of beholders!\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/002007",
        "Body":  "Allah hath set a seal on their hearts and on their hearing and on\n\t\t\ttheir eyes is a veil; great is the penalty they (incur).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e31\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e32\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/002070",
        "Body":  "They said \"Beseech on our behalf thy Lord to make plain to us\n\t\t\twhat she is to us are all heifers alike; we wish indeed for\n\t\t\tguidance if Allah wills.\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/002071",
        "Body":  "He said: \"He says a heifer not trained to till the soil or water\n\t\t\tthe fields; sound and without blemish.\"  They said: \"Now hast\n\t\t\tthou brought the truth.\" Then they offered her in sacrifice but\n\t\t\tnot with good-will."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/002072",
        "Body":  "Remember ye slew a man and fell into a dispute among yourselves\n\t\t\tas to the crime but Allah was to bring forth what ye did hide.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e81\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/002073",
        "Body":  "So We said: \"Strike the (body) with a piece of the (heifer).\" \n\t\t\tThus Allah bringeth the dead to life and showeth you His Signs\n\t\t\tperchance ye may understand."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/002074",
        "Body":  "Thenceforth were your hearts hardened; they became like a rock\n\t\t\tand even worse in hardness.  For among rocks there are some from\n\t\t\twhich rivers gush forth; others there are which when split\n\t\t\tasunder send forth water; and others which sink for fear of\n\t\t\tAllah.\tAnd Allah is not unmindful of what ye do. \u003cspan class=\u0027fn\u0027\u003e82\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/002075",
        "Body":  "Can ye (O ye men of Faith) entertain the hope that they will\n\t\t\tbelieve in you?  Seeing that a party of them heard the word of\n\t\t\tAllah and perverted it knowingly after they understood it."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/002076",
        "Body":  "Behold! when they meet the men of Faith they say: \"We believe\"\n\t\t\tbut when they meet each other in private they say: \"Shall you\n\t\t\ttell them what Allah hath revealed to you that they may engage\n\t\t\tyou in argument about it before your Lord?\"  Do ye not understand\n\t\t\t(their aim)? \u003cspan class=\u0027fn\u0027\u003e83\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/002077",
        "Body":  "Know they not that Allah knoweth what they conceal and what they\n\t\t\treveal?"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/002078",
        "Body":  "And there are among them illiterates who know not the Book but\n\t\t\t(see therein their own) desires and they do nothing but\n\t\t\tconjecture. \u003cspan class=\u0027fn\u0027\u003e84\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/002079",
        "Body":  "Then woe to those who write the Book with their own hands and\n\t\t\tthen say: \"This is from Allah\" to traffic with it for a miserable\n\t\t\tprice! Woe to them for what their hands do write and for the gain\n\t\t\tthey make thereby."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/002008",
        "Body":  "Of the people there are some who say: \"We believe in Allah and\n\t\t\tthe Last Day\" but they do not (really) believe. \u003cspan class=\u0027fn\u0027\u003e33\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/002080",
        "Body":  "And they say: \"The fire shall not touch us but for a few numbered\n\t\t\tdays\"; Say: \"Have ye taken a promise from Allah for He never\n\t\t\tbreaks His promise?  Or is it that ye say of Allah what ye do not\n\t\t\tknow?\" \u003cspan class=\u0027fn\u0027\u003e85\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/002081",
        "Body":  "Nay those who seek gain in Evil and are girt round by their sins\n\t\t\tthey are Companions of the Fire therein shall they abide (for\n\t\t\tever). \u003cspan class=\u0027fn\u0027\u003e86\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/002082",
        "Body":  "But those who have faith and work righteousness they are\n\t\t\tCompanions of the Garden therein shall they abide (for ever)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/002083",
        "Body":  "And remember We took a covenant from the children of Israel (to\n\t\t\tthis effect): worship none but Allah; treat with kindness your\n\t\t\tparents and kindred and orphans and those in need; speak fair to\n\t\t\tthe people; be steadfast in prayer; and practice regular charity.\n\t\t\t Then did ye turn back except a few among you and ye backslide\n\t\t\t(even now). \u003cspan class=\u0027fn\u0027\u003e87\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/002084",
        "Body":  "And remember We took your Covenant (to this effect): shed no\n\t\t\tblood amongst you nor turn out your own people from your homes;\n\t\t\tand this ye solemnly ratified and to this ye can bear witness.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e88\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/002085",
        "Body":  "After this it is ye the same people who slay among yourselves and\n\t\t\tbanish a party of you from their homes; assist (their enemies)\n\t\t\tagainst them in guilt and rancor; and if they come to you as\n\t\t\tcaptives ye ransom them though it was not lawful for you to\n\t\t\tbanish them.  Then is it only a part of the Book that ye believe\n\t\t\tin and do ye reject the rest?  But what is the reward for those\n\t\t\tamong you who behave like this but disgrace in this life?  and on\n\t\t\tthe Day of Judgment they shall be consigned to the most grievous\n\t\t\tpenalty.  For Allah is not unmindful of what ye do. \u003cspan class=\u0027fn\u0027\u003e89\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/002086",
        "Body":  "These are the people who buy the life of this world at the price\n\t\t\tof the Hereafter; their penalty shall not be lightened nor shall\n\t\t\tthey be helped."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/002087",
        "Body":  "We gave Moses the Book and followed him up with a succession of\n\t\t\tApostles; We gave Jesus the son of Mary clear (Signs) and\n\t\t\tstrengthened him with the holy spirit.\tIs it that whenever there\n\t\t\tcomes to you an Apostle with what ye yourselves desire not ye are\n\t\t\tpuffed up with pride?  Some ye called impostors and others ye\n\t\t\tslay! \u003cspan class=\u0027fn\u0027\u003e89\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e90\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e91\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/002088",
        "Body":  "They say \"Our hearts are the wrappings (which preserve Allah\u0027s\n\t\t\tword we need no more).\"  Nay Allah\u0027s curse is on them for their\n\t\t\tblasphemy; little is it they believe. \u003cspan class=\u0027fn\u0027\u003e92\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e93\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "89",
        "Recitation":  "Alafasy_128kbps/002089",
        "Body":  "And when there comes to them a Book from Allah confirming what is\n\t\t\twith them although from of old they had prayed for victory\n\t\t\tagainst those without faith when there comes to them that which\n\t\t\tthey (should) have recognized they refused to believe in it; but\n\t\t\tthe curse of Allah is on those without Faith. \u003cspan class=\u0027fn\u0027\u003e94\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/002009",
        "Body":  "Fain would they deceive Allah and those who believe but they only\n\t\t\tdeceive themselves and realize (it) not!"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "90",
        "Recitation":  "Alafasy_128kbps/002090",
        "Body":  "Miserable is the price for which they have sold their souls in\n\t\t\tthat they deny (the revelation) which Allah has sent down in\n\t\t\tinsolent envy that Allah of His Grace should send it to any of\n\t\t\tHis servants He pleases; thus have they drawn on themselves wrath\n\t\t\tupon wrath.  And humiliating is the punishment of those who\n\t\t\treject Faith. \u003cspan class=\u0027fn\u0027\u003e95\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "91",
        "Recitation":  "Alafasy_128kbps/002091",
        "Body":  "When it is said to them: \"believe in what Allah hath sent down\"\n\t\t\tthey say \"We believe in what was sent down to us\"; yet they\n\t\t\treject all besides even if it be truth confirming what is with\n\t\t\tthem.  Say: \"Why then have ye slain the prophets of Allah in\n\t\t\ttimes gone by if ye did indeed believe?\" \u003cspan class=\u0027fn\u0027\u003e96\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "92",
        "Recitation":  "Alafasy_128kbps/002092",
        "Body":  "There came to you Moses with clear (Signs); yet ye worshipped the\n\t\t\tCalf (even) after that and ye did behave wrongfully."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "93",
        "Recitation":  "Alafasy_128kbps/002093",
        "Body":  "And remember We took your Covenant and We raised above you (the\n\t\t\ttowering height) of Mount (Sinai) (saying): \"Hold firmly to what\n\t\t\tWe have given you and hearken (to the Law)\"; they said: \"We hear\n\t\t\tand we disobey\"; and they had to drink into their hearts (of the\n\t\t\ttaint) of the calf because of their faithlessness.  Say: \"Vile\n\t\t\tindeed are the behests of your faith if ye have any faith!\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e97\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e98\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e99\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "94",
        "Recitation":  "Alafasy_128kbps/002094",
        "Body":  "Say: \"If the last Home with Allah be for you specially and not\n\t\t\tfor anyone else then seek ye for death if ye are sincere.\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "95",
        "Recitation":  "Alafasy_128kbps/002095",
        "Body":  "But they will never seek for death on account of the (sins) which\n\t\t\ttheir hands have sent on before them.  And Allah is well\n\t\t\tacquainted with the wrong-doers. \u003cspan class=\u0027fn\u0027\u003e100\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "96",
        "Recitation":  "Alafasy_128kbps/002096",
        "Body":  "Thou wilt indeed find them of all people most greedy of life even\n\t\t\tmore than the idolaters; each one of them wishes he could be\n\t\t\tgiven a life of a thousand years; but the grant of such life will\n\t\t\tnot save him from (due) punishment for Allah sees well all that\n\t\t\tthey do."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "97",
        "Recitation":  "Alafasy_128kbps/002097",
        "Body":  "Say: Whoever is an enemy to Gabriel for he brings down the\n\t\t\t(revelation) to thy heart by Allah\u0027s will a confirmation of what\n\t\t\twent before and guidance and glad tidings for those who believe.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e101\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "98",
        "Recitation":  "Alafasy_128kbps/002098",
        "Body":  "Whoever is an enemy to Allah and His angels and apostles to\n\t\t\tGabriel and Michael Lo! Allah is an enemy to those who reject\n\t\t\tfaith."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "2",
        "AyahNumber":  "99",
        "Recitation":  "Alafasy_128kbps/002099",
        "Body":  "We have sent down to thee manifest signs (ayat); and none reject\n\t\t\tthem but those who are perverse."
    }
]
