[
  {
    "SurahNumber": "6",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Both \"darkness\" and \"light\" are used here in their\\n\\t\\t\\t\\tspiritual connotation. As always in the Qur'an,\\n\\t\\t\\t\\t\"darkness\" is spoken of in the plural (zulumat) in order\\n\\t\\t\\t\\tto stress its intensity, and is best translated as \"deep\\n\\t\\t\\t\\tdarkness\" or \"depths of darkness\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "Lit., \"and a term is stated with Him\" - i.e., known to\\n\\t\\t\\t\\tHim alone (Manar VII, 298). Some of the authorities are\\n\\t\\t\\t\\tof the opinion that the \"term\" refers to the end of the\\n\\t\\t\\t\\tworld and the subsequent resurrection, while others\\n\\t\\t\\t\\trelate it to individual human lives. Other commentators,\\n\\t\\t\\t\\tagain, see in the first mention of this word a reference\\n\\t\\t\\t\\tto individual lives, and in the second, to the Day of\\n\\t\\t\\t\\tResurrection; according to this latter interpretation,\\n\\t\\t\\t\\tthe concluding phrase might be rendered thus: \"and there\\n\\t\\t\\t\\tis [another] term...\", etc. However, in view of several\\n\\t\\t\\t\\tother occurrences of the expression ajal musamma in the\\n\\t\\t\\t\\tQur'an, it is best rendered here as \"a term set [by Him]\"\\n\\t\\t\\t\\tor \"known [to Him]\", i.e., relating both to individual\\n\\t\\t\\t\\tlives and to the world as a whole."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "Lit., \"there has not come unto them a message of their\\n\\t\\t\\t\\tSustainer's messages without that they turned their backs\\n\\t\\t\\t\\tupon it\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "Lit., \"there will come to them information about that\\n\\t\\t\\t\\twhich they used to mock at\" or \"deride\" - i.e., the\\n\\t\\t\\t\\tcontinuation of life after death, in particular, and the\\n\\t\\t\\t\\tQur'anic message, in general."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "Lit., \"a generation of others after them\". However, in\\n\\t\\t\\t\\tQur'anic usage, the term qarn does not always denote \"a\\n\\t\\t\\t\\tgeneration\", but - rather more frequently - \"an epoch\",\\n\\t\\t\\t\\tor \"people belonging to one particular epoch\", as well as\\n\\t\\t\\t\\t\"a civilization\" in the historical sense of this word."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "I.e., Judgment Day would have come - for it is only then\\n\\t\\t\\t\\tthat the forces described as angels will manifest\\n\\t\\t\\t\\tthemselves to man in their true form and become\\n\\t\\t\\t\\tcomprehensible to him. (Cf. a similar passage in\\n\\t\\t\\t\\t 2:210 .)"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "Lit., \"if We had made him an angel\" - with the pronoun\\n\\t\\t\\t\\tobviously referring to the bearer of God's message\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "Lit., \"We would have made confusing to them that which\\n\\t\\t\\t\\tthey are making confused\". Since it is impossible for man\\n\\t\\t\\t\\tto perceive angels as they really are, the hypothetical\\n\\t\\t\\t\\tangelic message-bearer would have to assume the shape of\\n\\t\\t\\t\\ta human being - and so their demand for a direct\\n\\t\\t\\t\\t\"verification\" of the message would have remained\\n\\t\\t\\t\\tunfulfilled, and their self-caused confusion unresolved."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "10",
    "NoteID": "9",
    "Body": "Lit., \"that which they were wont to deride enfolded those\\n\\t\\t\\t\\twho scoffed at them\" (i.e., at the apostles): the meaning\\n\\t\\t\\t\\tbeing that a derisive rejection of spiritual truths\\n\\t\\t\\t\\tinexorably rebounds on the scoffers and has not only a\\n\\t\\t\\t\\tdisastrous effect on their individual lives after death\\n\\t\\t\\t\\tbut also - if persisted in by the majority within a\\n\\t\\t\\t\\tcommunity - destroys the moral basis of their society\\n\\t\\t\\t\\tand, thus, their earthly happiness and sometimes even\\n\\t\\t\\t\\ttheir physical existence."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "12",
    "NoteID": "10",
    "Body": "The expression \"God has willed upon Himself as a law\"\\n\\t\\t\\t\\t(kataba 'ala nafsihi) occurs in the Qur'an only twice -\\n\\t\\t\\t\\there and in verse {54} of this surah - and in both\\n\\t\\t\\t\\tinstances with reference to His grace and mercy (rahmah);\\n\\t\\t\\t\\tnone of the other divine attributes has been similarly\\n\\t\\t\\t\\tdescribed. This exceptional quality of God's grace and\\n\\t\\t\\t\\tmercy is further stressed in  7:156  - \"My grace\\n\\t\\t\\t\\toverspreads everything\" - and finds an echo in the\\n\\t\\t\\t\\tauthentic Tradition in which, according to the Prophet,\\n\\t\\t\\t\\tGod says of Himself, \"Verily, My grace and mercy\\n\\t\\t\\t\\toutstrips My wrath\" (Bukhari and Muslim)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "14",
    "NoteID": "11",
    "Body": "Lit., \"when it is He who feeds [others] and is not fed\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "14",
    "NoteID": "12",
    "Body": "Lit., \"and be thou not\" - an elliptic reference to the\\n\\t\\t\\t\\twords in which this commandment has been expressed."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "19",
    "NoteID": "13",
    "Body": "Lit., \"I am clear of that which you associate [with\\n\\t\\t\\t\\tHim].\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "20",
    "NoteID": "14",
    "Body": "I.e., the truth of God's transcendental uniqueness and\\n\\t\\t\\t\\toneness, which is stressed in all authentic scriptures."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "22",
    "NoteID": "15",
    "Body": "Lit., \"those [God-]partners of yours whom you supposed\\n\\t\\t\\t\\t[to exist]\". Whenever the term shuraka' (pl. of sharik)\\n\\t\\t\\t\\tis used in the Qur'an with reference to beliefs, it\\n\\t\\t\\t\\tinvariably denotes real or imaginary beings or forces to\\n\\t\\t\\t\\twhom one ascribes a share in God's divinity:\\n\\t\\t\\t\\tconsequently, this concept - and its utter condemnation\\n\\t\\t\\t\\tin Islam - relates not merely to the worship of false\\n\\t\\t\\t\\tdeities but also to the attribution of semi-divine\\n\\t\\t\\t\\tqualities and powers to saints (in the liturgical sense\\n\\t\\t\\t\\tof this word), as well as to abstract notions like\\n\\t\\t\\t\\twealth, social status, power, nationality, etc., to which\\n\\t\\t\\t\\tmen so often ascribe an objective influence on human\\n\\t\\t\\t\\tdestinies."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "23",
    "NoteID": "16",
    "Body": "This refers to beliefs which undoubtedly imply shirk\\n\\t\\t\\t\\t(\"the ascribing of divinity or divine qualities to beings\\n\\t\\t\\t\\tor forces other than God\") in the objective sense of this\\n\\t\\t\\t\\tconcept, but which the person concerned does not\\n\\t\\t\\t\\tsubjectively visualize as denying God's oneness (Razi):\\n\\t\\t\\t\\tfor instance, the mystical dogma of the \"Trinity\" which,\\n\\t\\t\\t\\tin the Christian view, does not conflict with the\\n\\t\\t\\t\\tprinciple of God's oneness inasmuch as it is supposed to\\n\\t\\t\\t\\texpress a \"threefold aspect\" of the One Deity, or the\\n\\t\\t\\t\\tattribution of divine or semi-divine qualities to saints\\n\\t\\t\\t\\tas supposed \"mediators\" between man and God, and so\\n\\t\\t\\t\\tforth. All such beliefs are, of course, emphatically\\n\\t\\t\\t\\trejected by the Qur'an."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "24",
    "NoteID": "17",
    "Body": "I.e., by allowing themselves to think, in their lifetime,\\n\\t\\t\\t\\tthat their beliefs did not offend against the principle\\n\\t\\t\\t\\tof God's oneness (Razi). But see also  10:28  and the\\n\\t\\t\\t\\tcorresponding notes [45] and [46]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "25",
    "NoteID": "18",
    "Body": "Regarding the problem of God's \"causing\" this spiritual\\n\\t\\t\\t\\tblindness and deafness, see  2:7  and the corresponding\\n\\t\\t\\t\\tnote, as well as note [4] on  14:4 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "28",
    "NoteID": "19",
    "Body": "I.e., their longing for a \"second chance\" is not dictated\\n\\t\\t\\t\\tby love of truth for its own sake but rather, by their\\n\\t\\t\\t\\tdread of the evil consequences of their doings; and\\n\\t\\t\\t\\t\"faith is useless unless it is desired for its own sake\"\\n\\t\\t\\t\\t(Razi)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "30",
    "NoteID": "20",
    "Body": "Lit., \"the suffering [or \"chastisement\"] because of\" or\\n\\t\\t\\t\\t\"in consequence of\". The particle bi-ma expresses here a\\n\\t\\t\\t\\tcausal connection between the denial of the truth and the\\n\\t\\t\\t\\tsubsequent suffering, and is best rendered as above."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "31",
    "NoteID": "21",
    "Body": "Lit., \"their burdens\". My use of the words \"the burden of\\n\\t\\t\\t\\ttheir sins\" rests on the interpretation given by Ibn\\n\\t\\t\\t\\t'Abbas, as quoted by Razi."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "33",
    "NoteID": "22",
    "Body": "Lit., \"what they say\" - i.e., about life after death\\n\\t\\t\\t\\t(which they regard as a \"fable\") in particular, and about\\n\\t\\t\\t\\tthe Qur'anic message in general."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "34",
    "NoteID": "23",
    "Body": "Lit., \"some of the information concerning the apostles\\n\\t\\t\\t\\thas already come to thee\": a reference to the fact that\\n\\t\\t\\t\\tonly a few of the earlier prophets and their histories\\n\\t\\t\\t\\thave been specifically mentioned in the Qur'an (always in\\n\\t\\t\\t\\tconnection with a particular moral lesson), while the\\n\\t\\t\\t\\tgreat majority of them are only alluded to in a general\\n\\t\\t\\t\\tmanner, in support of the divine statement that no\\n\\t\\t\\t\\tcommunity or civilization has been left without prophetic\\n\\t\\t\\t\\tguidance."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "35",
    "NoteID": "24",
    "Body": "Lit., \"that they\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "35",
    "NoteID": "25",
    "Body": "Lit., \"to seek out an opening in the earth or a ladder to\\n\\t\\t\\t\\theaven\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "35",
    "NoteID": "26",
    "Body": "Lit., \"be not, therefore, of the ignorant\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "36",
    "NoteID": "27",
    "Body": "Lit., \"they shall be returned\". Most of the classical\\n\\t\\t\\t\\tcommentators (e.g., Tabari, Zamakhshari, Razi, as well as\\n\\t\\t\\t\\tthe earlier authorities whom they quote) interpret this\\n\\t\\t\\t\\tverse in the metaphorical sense in which it has been\\n\\t\\t\\t\\trendered by me. As is so often the case with Qur'anic\\n\\t\\t\\t\\tdiction, its elliptical meaning can only be brought out\\n\\t\\t\\t\\tby means of interpolations."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "37",
    "NoteID": "28",
    "Body": "I.e., on Muhammad, to demonstrate that he is really a\\n\\t\\t\\t\\tbearer of God's message."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "37",
    "NoteID": "29",
    "Body": "Lit., \"most of them do not know\", i.e., that God\\n\\t\\t\\t\\tmanifests Himself always - as the next verse points out -\\n\\t\\t\\t\\tthrough the ever-recurring miracle of His creation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "38",
    "NoteID": "30",
    "Body": "Lit., \"but they are [God's] creatures (umam)\". The word\\n\\t\\t\\t\\tummah (of which umam is the plural) primarily denotes a\\n\\t\\t\\t\\tgroup of living beings having certain characteristics or\\n\\t\\t\\t\\tcircumstances in common. Thus, it is often synonymous\\n\\t\\t\\t\\twith \"community\", \"people\", \"nation\", \"genus\"\\n\\t\\t\\t\\t\"generation\", and so forth. Inasmuch as every such\\n\\t\\t\\t\\tgrouping is characterized by the basic fact that its\\n\\t\\t\\t\\tconstituents (whether human or animal) are endowed with\\n\\t\\t\\t\\tlife, the term ummah sometimes signifies \"[God's]\\n\\t\\t\\t\\tcreatures\" (Lisan al-'Arab, with particular reference to\\n\\t\\t\\t\\tthis very Qur'an-verse; also Lane I, 90). Thus, the\\n\\t\\t\\t\\tmeaning of the above passage is this: Man can detect\\n\\t\\t\\t\\tGod's \"signs\" or \"miracles\" in all the life-phenomena\\n\\t\\t\\t\\tthat surround him, and should, therefore, try to observe\\n\\t\\t\\t\\tthem with a view to better understanding \"God's way\"\\n\\t\\t\\t\\t(sunnat Allah) - which is the Qur'anic term for what we\\n\\t\\t\\t\\tcall \"laws of nature\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "38",
    "NoteID": "31",
    "Body": "The particle thumma is mostly used as a conjunction\\n\\t\\t\\t\\tindicating a sequence in time or order (\"then\",\\n\\t\\t\\t\\t\"thereafter\" or \"thereupon\"), and occasionally also as a\\n\\t\\t\\t\\tsimple conjunction equivalent to \"and\". But in yet\\n\\t\\t\\t\\tanother usage - of which there are frequent instances in\\n\\t\\t\\t\\tthe Qur'an as well as in pre-Islamic Arabian poetry -\\n\\t\\t\\t\\tthumma has the significance of a repetitive stress,\\n\\t\\t\\t\\talluding to something that has already been stated and is\\n\\t\\t\\t\\tnow again emphasized. This particular usage of thumma is\\n\\t\\t\\t\\tbest rendered by the words \"and once again\", followed by\\n\\t\\t\\t\\ta colon."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "39",
    "NoteID": "32",
    "Body": "See note [4] on  14:4 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "44",
    "NoteID": "33",
    "Body": "I.e., to test them by happiness after the test by misery."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "44",
    "NoteID": "34",
    "Body": "The verb ablasa signifies \"he despaired of all hope\" or\\n\\t\\t\\t\\t\"became broken in spirit\". (For the linguistic connection\\n\\t\\t\\t\\tof this word with the name of Iblis, the Fallen Angel,\\n\\t\\t\\t\\tsee surah {7}, note [10].)"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "45",
    "NoteID": "35",
    "Body": "Lit., \"cut off\". The above passage illustrates a\\n\\t\\t\\t\\tphenomenon well known in history: namely, the inevitable\\n\\t\\t\\t\\tsocial and moral disintegration of communities which have\\n\\t\\t\\t\\tlost sight of spiritual truths."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "47",
    "NoteID": "36",
    "Body": "Lit., \"Can you see yourselves\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "47",
    "NoteID": "37",
    "Body": "I.e., the righteous will never be really \"destroyed\" -\\n\\t\\t\\t\\tfor, even if they should suffer physical destruction,\\n\\t\\t\\t\\tthey are bound to attain to spiritual bliss and cannot,\\n\\t\\t\\t\\ttherefore, be said to have been \"destroyed\" like the\\n\\t\\t\\t\\tevildoers, who, by their actions, lose their happiness\\n\\t\\t\\t\\tboth in this world and in the life to come (Razi)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "50",
    "NoteID": "38",
    "Body": "This denial on the part of the Prophet of any claim to\\n\\t\\t\\t\\tsupernatural powers refers, primarily, to the demand of\\n\\t\\t\\t\\tthe unbelievers mentioned in verse {37} that he should\\n\\t\\t\\t\\tprove his prophetic mission by causing a \"miraculous\\n\\t\\t\\t\\tsign\" to be bestowed on him. Beyond this specific\\n\\t\\t\\t\\treference, however, the above passage is meant to prevent\\n\\t\\t\\t\\tany deification of the Prophet and to make it clear that\\n\\t\\t\\t\\the - like all other prophets before him - was but a\\n\\t\\t\\t\\tmortal human being, a servant whom God had chosen to\\n\\t\\t\\t\\tconvey His message to mankind. See also  7:188 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "50",
    "NoteID": "39",
    "Body": "I.e., \"Can those who remain blind and deaf to God's\\n\\t\\t\\t\\tmessages find their way through life equally well as\\n\\t\\t\\t\\tthose who have achieved a spiritual vision and guidance\\n\\t\\t\\t\\tthrough God's revelation?\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "51",
    "NoteID": "40",
    "Body": "It is obvious from the context that this verse refers to\\n\\t\\t\\t\\tfollowers of earlier scriptures - such as the Jews and\\n\\t\\t\\t\\tthe Christians - who share with the followers of the\\n\\t\\t\\t\\tQur'an the belief in life after death (Zamakhshari), as\\n\\t\\t\\t\\twell as to agnostics who, without having definite beliefs\\n\\t\\t\\t\\ton this point, admit the possibility of life after death."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "52",
    "NoteID": "41",
    "Body": "According to Traditions, this and the next verse were\\n\\t\\t\\t\\trevealed when, several years before the Muslims' exodus\\n\\t\\t\\t\\tto Medina, some of the pagan chieftains at Mecca\\n\\t\\t\\t\\texpressed their willingness to consider accepting Islam\\n\\t\\t\\t\\ton the condition that the Prophet would dissociate\\n\\t\\t\\t\\thimself from the former slaves and other \"lowly\" persons\\n\\t\\t\\t\\tamong his followers - a demand which the Prophet, of\\n\\t\\t\\t\\tcourse, rejected. This historical reference does not,\\n\\t\\t\\t\\thowever, provide a full explanation of the above passage.\\n\\t\\t\\t\\tIn accordance with the Qur'anic method, allusions to\\n\\t\\t\\t\\thistorical events - whether relating to contemporary\\n\\t\\t\\t\\toccurrences or to earlier times - are always made with a\\n\\t\\t\\t\\tview to expressing ethical teachings of a permanent\\n\\t\\t\\t\\tnature; and the passage under consideration is no\\n\\t\\t\\t\\texception in this respect. As the wording shows, it\\n\\t\\t\\t\\trelates not to \"lowly\" followers of Islam but to people\\n\\t\\t\\t\\twho, while not being Muslims in the current sense of this\\n\\t\\t\\t\\tword, believe in God and are always (\"at morn and\\n\\t\\t\\t\\tevening\") \"seeking His countenance\" (i.e., His grace and\\n\\t\\t\\t\\tacceptance): and thus, verses {52-53} connect logically\\n\\t\\t\\t\\twith verse {51}. Although primarily addressed to the\\n\\t\\t\\t\\tProphet, the exhortation voiced in this passage is\\n\\t\\t\\t\\tdirected to all followers of the Qur'an: they are\\n\\t\\t\\t\\tenjoined not to repulse anyone who believes in God - even\\n\\t\\t\\t\\tthough his beliefs may not fully answer to the demands of\\n\\t\\t\\t\\tthe Qur'an - but, on the contrary, to try to help him by\\n\\t\\t\\t\\tmeans of a patient explanation of the Qur'anic teachings."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "52",
    "NoteID": "42",
    "Body": "I.e., for whatever in their beliefs or actions does not\\n\\t\\t\\t\\tcoincide with the teachings of the Qur'an, and\\n\\t\\t\\t\\tvice-versa. In other words, all are accountable to God\\n\\t\\t\\t\\talone."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "52",
    "NoteID": "43",
    "Body": "Lit., \"so that thou shouldst repulse them and thus be of\\n\\t\\t\\t\\tthe evildoers\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "53",
    "NoteID": "44",
    "Body": "I.e., by endowing man with the power of reasoning and\\n\\t\\t\\t\\tthus, indirectly, giving rise to a multiplicity of\\n\\t\\t\\t\\tfaiths."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "53",
    "NoteID": "45",
    "Body": "Lit., \"Is it those upon whom God has bestowed His favour\\n\\t\\t\\t\\tfrom among us (min baynina)?\" As mentioned by\\n\\t\\t\\t\\tZamakhshari, the expression min baynina is here\\n\\t\\t\\t\\tequivalent to min dunina, which, in this context, may\\n\\t\\t\\t\\tsuitably be rendered as \"in preference to us\". This would\\n\\t\\t\\t\\tseem to be an allusion to the sarcastic incredulity with\\n\\t\\t\\t\\twhich, as a rule, non-Muslims receive the claim of the\\n\\t\\t\\t\\tMuslims that the Qur'an is the final formulation of God's\\n\\t\\t\\t\\tmessage to man. The \"trial\" referred to above consists in\\n\\t\\t\\t\\tthe unwillingness of people of other faiths to accept\\n\\t\\t\\t\\tthis claim as valid, and so to renounce the prejudice\\n\\t\\t\\t\\tagainst Islam to which their cultural and historical\\n\\t\\t\\t\\tenvironment has made them, consciously or subconsciously,\\n\\t\\t\\t\\tpredisposed."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "54",
    "NoteID": "46",
    "Body": "See note [10] above. Regarding the word salam, which has\\n\\t\\t\\t\\tbeen translated here as \"peace\", see surah {5}, note\\n\\t\\t\\t\\t[29]. The \"peace\" referred to in the above expression -\\n\\t\\t\\t\\twhich occurs many times in the Qur'an and has become the\\n\\t\\t\\t\\tstandard form of Muslim greeting - has a spiritual\\n\\t\\t\\t\\tconnotation comprising the concepts of ethical soundness,\\n\\t\\t\\t\\tsecurity from all that is evil and, therefore, freedom\\n\\t\\t\\t\\tfrom all moral conflict and disquiet."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "57",
    "NoteID": "47",
    "Body": "Lit., \"not with me is that which you would hasten\": a\\n\\t\\t\\t\\treference to the sarcastic demand of the unbelievers,\\n\\t\\t\\t\\tmentioned in  8:32 , that God should chastise them\\n\\t\\t\\t\\tforthwith in proof of the Prophet's claim to be His\\n\\t\\t\\t\\tmessage-bearer."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "58",
    "NoteID": "48",
    "Body": "I.e., \"you would have been convinced that I am really a\\n\\t\\t\\t\\tbearer of God's message\" - the implication being that a\\n\\t\\t\\t\\tconviction based solely on a \"miraculous\" proof would\\n\\t\\t\\t\\thave no spiritual value."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "59",
    "NoteID": "49",
    "Body": "Lit., \"fresh or dry\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "60",
    "NoteID": "50",
    "Body": "For a full explanation of the verb tawaffa - lit., \"he\\n\\t\\t\\t\\ttook [something] in full\" - see note [44] on  39:42 ,\\n\\t\\t\\t\\twhich is the earliest instance of its use in the Qur'an."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "60",
    "NoteID": "51",
    "Body": "Lit., \"therein\" - referring to the daytime. The polarity\\n\\t\\t\\t\\tof sleep and wakefulness contains an allusion to life and\\n\\t\\t\\t\\tdeath cf. {78:9-11}."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "61",
    "NoteID": "52",
    "Body": "Lit., \"sends forth guardians over you\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "62",
    "NoteID": "53",
    "Body": "Lit., \"brought back [or \"referred\"] to God\" - i.e.,\\n\\t\\t\\t\\tplaced before Him for judgment."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "63",
    "NoteID": "54",
    "Body": "Lit., \"the darknesses\" or \"the deep darkness\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "65",
    "NoteID": "55",
    "Body": "I.e., from any direction or by any means whatsoever."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "65",
    "NoteID": "56",
    "Body": "Or: \"the violence of one against another\" - inner\\n\\t\\t\\t\\tdisintegration, fear, violence and tyranny being the\\n\\t\\t\\t\\tinevitable consequences of a society's departure from\\n\\t\\t\\t\\tspiritual truths."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "66",
    "NoteID": "57",
    "Body": "I.e., the unbelieving compatriots of the Prophet and, by\\n\\t\\t\\t\\timplication, all who deny the truth."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "68",
    "NoteID": "58",
    "Body": "Lit., \"until they immerse themselves in talk other than\\n\\t\\t\\t\\tthis\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "69",
    "NoteID": "59",
    "Body": "This is a paraphrase of the elliptic expression wa-lakin\\n\\t\\t\\t\\tdhikra (\"however, an admonition\")."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "70",
    "NoteID": "60",
    "Body": "The phrase attakhadhu dinahum la'iban wa-lahwan can be\\n\\t\\t\\t\\tunderstood in either of two ways: (l) \"they have made\\n\\t\\t\\t\\ttheir religion [an object of] play and fun\", or (2) \"they\\n\\t\\t\\t\\thave made play and fun [or \"passing delights\"] their\\n\\t\\t\\t\\treligion\" - i.e., the main goal of their lives. To my\\n\\t\\t\\t\\tmind, the latter reading is definitely preferable\\n\\t\\t\\t\\tinasmuch as it brings out the fact that many of those who\\n\\t\\t\\t\\tare \"beguiled by the life of this world\" devote\\n\\t\\t\\t\\tthemselves to the pursuit of what the Qur'an describes as\\n\\t\\t\\t\\t\"passing delights\" - including the pleasures which money\\n\\t\\t\\t\\tand power can provide - with something akin to religious\\n\\t\\t\\t\\tfervour: an attitude of mind which causes them to lose\\n\\t\\t\\t\\tsight of all spiritual and moral values."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "70",
    "NoteID": "61",
    "Body": "Lit., \"though he might [try to] ransom himself with all\\n\\t\\t\\t\\transom\" - i.e., though he might proffer, after\\n\\t\\t\\t\\tresurrection, any atonement whatever for his past sins."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "70",
    "NoteID": "62",
    "Body": "Among the various meanings attributable to the word hamim\\n\\t\\t\\t\\tare the concepts of intense heat as well as of painful\\n\\t\\t\\t\\tcold (Qamus, Taj al-'Arus). In the eschatology of the\\n\\t\\t\\t\\tQur'an it invariably refers to the suffering of the\\n\\t\\t\\t\\tsinners in the life to come, and since all Qur'anic\\n\\t\\t\\t\\treferences to life after death are, necessarily,\\n\\t\\t\\t\\tallegorical, the term hamim may be rendered as \"burning\\n\\t\\t\\t\\tdespair\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "71",
    "NoteID": "63",
    "Body": "Lit., \"whom the satans have enticed with lusts on earth,\\n\\t\\t\\t\\t[rendering him] bewildered, [while] he has companions who\\n\\t\\t\\t\\tcall him unto guidance\". See in this connection note [10]\\n\\t\\t\\t\\ton  2:14 , as well as note [31] on  14:22  and note [16]\\n\\t\\t\\t\\ton  15:17 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "73",
    "NoteID": "64",
    "Body": "See surah {10}, note [11]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "73",
    "NoteID": "65",
    "Body": "The term ash-shahadah (lit., \"that which is [or \"can be\"] witnessed\") is used in this and similar contexts as the exact antithesis of al-ghayb (\"that which is beyond the reach of a created being's perception\"). Thus, it circumscribes those aspects of reality which can be sensually or conceptually grasped by a created being."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "74",
    "NoteID": "66",
    "Body": "The subsequent passage (verses {74} ff.) continues, by way\r\\n\\t\\t\\t\\tof narrative, the exposition of God's oneness and\r\\n\\t\\t\\t\\tuniqueness. - In the Bible, the name of Abraham's father\r\\n\\t\\t\\t\\tis given not as Azar but as Terah (the Tarah or Tarakh of\r\\n\\t\\t\\t\\tthe early Muslim genealogists). However, he seems to have\r\\n\\t\\t\\t\\tbeen known by other names (or designations) as well, all\r\\n\\t\\t\\t\\tof them obscure as to origin and meaning. Thus, in\r\\n\\t\\t\\t\\tvarious Talmudic stories he is called Zarah, while\r\\n\\t\\t\\t\\tEusebius Pamphili (the ecclesiastical historian who lived\r\\n\\t\\t\\t\\ttowards the end of the third and the beginning of the\r\\n\\t\\t\\t\\tfourth century of the Christian era) gives his name as\r\\n\\t\\t\\t\\tAthar. Although neither the Talmud nor Eusebius can be\r\\n\\t\\t\\t\\tregarded as authorities for the purposes of a\r\\n\\t\\t\\t\\tQur'an-commentary, it is not impossible that the\r\\n\\t\\t\\t\\tdesignation Azar (which occurs in the Qur'an only once)\r\\n\\t\\t\\t\\tis the pre-Islamic, Arabicized form of Athar or Zarah."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "80",
    "NoteID": "67",
    "Body": "Lit., \"unless my Sustainer wills a thing\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "83",
    "NoteID": "68",
    "Body": "The description of Abraham's reasoning as God's own\\n\\t\\t\\t\\targument implies that it was divinely inspired, and is\\n\\t\\t\\t\\ttherefore valid for the followers of the Qur'an as well."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "83",
    "NoteID": "69",
    "Body": "This is evidently an allusion to Abraham's gradual grasp\\n\\t\\t\\t\\tof the truth, symbolized by his intuitive progress from\\n\\t\\t\\t\\tan adoration of celestial bodies - stars, moon and sun -\\n\\t\\t\\t\\tto a full realization of God's transcendental,\\n\\t\\t\\t\\tall-embracing existence. Alternatively, the expression\\n\\t\\t\\t\\t\"by degrees\" may be taken to mean \"by many degrees\",\\n\\t\\t\\t\\tsignifying the great spiritual dignity to which this\\n\\t\\t\\t\\tforerunner of a long line of prophets was ultimately\\n\\t\\t\\t\\traised see  4:125 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "86",
    "NoteID": "70",
    "Body": "Although Lot was not a \"descendant\" of Abraham since he\\n\\t\\t\\t\\twas his brother's son, his name is included here for two\\n\\t\\t\\t\\treasons: firstly, because he followed Abraham from his\\n\\t\\t\\t\\tearliest youth as a son follows his father, and,\\n\\t\\t\\t\\tsecondly, because in ancient Arabian usage a paternal\\n\\t\\t\\t\\tuncle is often described as \"father\" and, conversely, a\\n\\t\\t\\t\\tnephew as \"son\".- For the Hebrew prophets Elijah (Ilyas)\\n\\t\\t\\t\\tand Elisha (Al-Yasa'), see note [48] on  37:123 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "89",
    "NoteID": "71",
    "Body": "Lit., \"if these deny them\" - i.e., the manifestations of\\n\\t\\t\\t\\tGod's oneness and of the revelation of His will through\\n\\t\\t\\t\\tthe prophets."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "91",
    "NoteID": "72",
    "Body": "Lit., \"which you make into\": but it should be remembered\\n\\t\\t\\t\\tthat the verb ja'lahu has also the abstract meaning of\\n\\t\\t\\t\\t\"he considered it to be\" or \"regarded it as\" or \"treated\\n\\t\\t\\t\\tit as\" (Jawhari, Raghib, et al.): a significance often\\n\\t\\t\\t\\tmet with in the Qur'an."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "91",
    "NoteID": "73",
    "Body": "This passage is obviously addressed to those followers of\\n\\t\\t\\t\\tthe Bible who pay lip-service to its sacred character as\\n\\t\\t\\t\\ta revealed scripture but, in reality, treat it as \"mere\\n\\t\\t\\t\\tleaves of paper\" - that is, as something that is of\\n\\t\\t\\t\\tlittle consequence to their own conduct: for, although\\n\\t\\t\\t\\tthey pretend to admire the moral truths which it\\n\\t\\t\\t\\tcontains, they conceal from themselves the fact that\\n\\t\\t\\t\\ttheir own lives have remained empty of those truths."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "92",
    "NoteID": "74",
    "Body": "See surah {3}, note [3]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "92",
    "NoteID": "75",
    "Body": "\"The foremost of all cities\" (lit., \"the mother of all\\n\\t\\t\\t\\ttowns\") is an epithet applied in the Qur'an to Mecca\\n\\t\\t\\t\\tbecause it is the place where the first temple ever\\n\\t\\t\\t\\tdedicated to the One God was built cf.  3:96  and\\n\\t\\t\\t\\tsubsequently became the qiblah (direction of prayer) of\\n\\t\\t\\t\\tall believers. The expression \"all who dwell around it\"\\n\\t\\t\\t\\tdenotes all mankind (Tabari, on the authority of Ibn\\n\\t\\t\\t\\t'Abbas; Razi)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "93",
    "NoteID": "76",
    "Body": "In this context, the \"lie\" would seem to refer to the\\n\\t\\t\\t\\tdenial, spoken of in verse {91}, of the fact of divine\\n\\t\\t\\t\\trevelation as such."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "93",
    "NoteID": "77",
    "Body": "Implying, in a sarcastic manner, that the purported\\n\\t\\t\\t\\trevelation has in reality been composed by a human being\\n\\t\\t\\t\\tand that, therefore, the like of it can be produced by\\n\\t\\t\\t\\tother men."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "94",
    "NoteID": "78",
    "Body": "Lit., \"whom you supposed to be [God's] partners with\\n\\t\\t\\t\\tregard to you\" - i.e., being able, in result of their\\n\\t\\t\\t\\talleged \"share in God's divinity\", to protect or help\\n\\t\\t\\t\\tyou. See note [15] on verse {22} of this surah."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "94",
    "NoteID": "79",
    "Body": "Lit., \"all that you were wont to assert [or \"to suppose\"]\\n\\t\\t\\t\\thas gone away from you\" - i.e., all the imaginary\\n\\t\\t\\t\\tintercessors or mediators between man and God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "95",
    "NoteID": "80",
    "Body": "See surah {5}, note [90]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "96",
    "NoteID": "81",
    "Body": "Lit., \"to be [according to] a definite reckoning\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "98",
    "NoteID": "82",
    "Body": "See surah {4}, note [1]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "98",
    "NoteID": "83",
    "Body": "The commentators differ widely as to the meaning of the\\n\\t\\t\\t\\tterms mustaqarr and mustawda' in this context. However,\\n\\t\\t\\t\\ttaking into account the primary meaning of mustaqarr as\\n\\t\\t\\t\\t\"the limit of a course\" - i.e., the point at which a\\n\\t\\t\\t\\tthing reaches its fulfilment or end - and of mustawda' as\\n\\t\\t\\t\\t\"a place of consignment\" or \"repository\", we arrive at\\n\\t\\t\\t\\tthe rendering adopted by me above. This rendering finds,\\n\\t\\t\\t\\tmoreover, strong support in  11:6 , where God is spoken\\n\\t\\t\\t\\tof as providing sustenance for every living being and\\n\\t\\t\\t\\tknowing \"its time-limit [on earth] and its resting-place\\n\\t\\t\\t\\t[after death]\" (mustaqarraha wa-mustawda'aha), as well as\\n\\t\\t\\t\\tin verse {67} of the present surah, where mustaqarr is\\n\\t\\t\\t\\tused in the sense of \"a term set for the fulfilment [of\\n\\t\\t\\t\\tGod's tiding]\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "99",
    "NoteID": "84",
    "Body": "In contrast with its sequence, which is governed by the\\n\\t\\t\\t\\tpresent tense, the whole of the above sentence is\\n\\t\\t\\t\\texpressed in the past tense - thus indicating, obliquely,\\n\\t\\t\\t\\tthe original, basic aspect of God's creating life \"out of\\n\\t\\t\\t\\twater\". cf.  21:30  and the corresponding note [39]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "99",
    "NoteID": "85",
    "Body": "I.e., all so alike in the basic principles of their life\\n\\t\\t\\t\\tand growth, and yet so different in physiology,\\n\\t\\t\\t\\tappearance and taste."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "100",
    "NoteID": "86",
    "Body": "The plural noun jinn (popularly, but incorrectly, taken\\n\\t\\t\\t\\tto denote \"genii\" or \"demons\") is derived from the verb\\n\\t\\t\\t\\tjanna, \"he was [or \"became\"] concealed\" or \"veiled from\\n\\t\\t\\t\\tsight\", thus, the veiling darkness of night is called\\n\\t\\t\\t\\tjinn (Jawhari). According to Arab philologists, the term\\n\\t\\t\\t\\tjinn signifies, primarily, \"beings that are concealed\\n\\t\\t\\t\\tfrom [man's] senses\" (Qamus, Lisan al-'Arab, Raghib), and\\n\\t\\t\\t\\tis thus applicable to all kinds of invisible beings or\\n\\t\\t\\t\\tforces. For a further discussion of this term and of its\\n\\t\\t\\t\\twider implications, see Appendix III."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "100",
    "NoteID": "87",
    "Body": "Lit., \"they have invented for Him [or \"falsely attributed\\n\\t\\t\\t\\tto Him\"] sons and daughters without [having any]\\n\\t\\t\\t\\tknowledge\": a reference to the beliefs of the pre-Islamic\\n\\t\\t\\t\\tArabs who regarded the angels as \"God's daughters\" (a\\n\\t\\t\\t\\tdesignation which they also applied to certain of their\\n\\t\\t\\t\\tgoddesses), as well as to the Christian view of Jesus as\\n\\t\\t\\t\\t\"the son of God\". See also  19:92  and the corresponding\\n\\t\\t\\t\\tnote [77]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "100",
    "NoteID": "88",
    "Body": "I.e., utterly remote is He from all imperfection and from\r\\n\\t\\t\\t\\tthe incompleteness which is implied in the concept of\r\\n\\t\\t\\t\\thaving progeny. The very concept of \"definition\" implies\r\\n\\t\\t\\t\\tthe possibility of a comparison or correlation of an\r\\n\\t\\t\\t\\tobject with other objects; God, however, is unique, there\r\\n\\t\\t\\t\\tbeing \"nothing like unto Him\" ( 42:11 ) and, therefore,\r\\n\\t\\t\\t\\t\"nothing that could be compared with Him\" ( 112:4 ) - with\r\\n\\t\\t\\t\\tthe result that any attempt at defining Him or His\r\\n\\t\\t\\t\\t\"attributes\" is a logical impossibility and, from the\r\\n\\t\\t\\t\\tethical point of view, a sin. The fact that He is\r\\n\\t\\t\\t\\tundefinable makes it clear that the \"attributes\" (sifat)\r\\n\\t\\t\\t\\tof God mentioned in the Qur'an do not circumscribe His\r\\n\\t\\t\\t\\treality but, rather, the perceptible effect of His\r\\n\\t\\t\\t\\tactivity on and within the universe created by Him."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "103",
    "NoteID": "89",
    "Body": "The term latif denotes something that is extremely subtle\r\\n\\t\\t\\t\\tin quality, and therefore intangible and unfathomable.\r\\n\\t\\t\\t\\tWhenever this term occurs in the Qur'an with reference to\r\\n\\t\\t\\t\\tGod in conjunction with the adjective khabir\r\\n\\t\\t\\t\\t(\"all-aware\"), it is invariably used to express the idea\r\\n\\t\\t\\t\\tof His inaccessibility to human perception, imagination\r\\n\\t\\t\\t\\tor comprehension, as contrasted with His Own\r\\n\\t\\t\\t\\tall-awareness (see, apart from the above verse, also\r\\n\\t\\t\\t\\t 22:63 ,  31:16 ,  33:34  and  67:14 . In the two\r\\n\\t\\t\\t\\tinstances where the combination of latif and khabir\r\\n\\t\\t\\t\\tcarries the definite article al ( 6:103  and  67:14 ), the\r\\n\\t\\t\\t\\texpression huwa 'l-latif has the meaning of \"He alone is\r\\n\\t\\t\\t\\tunfathomable\" - implying that this quality of His is\r\\n\\t\\t\\t\\tunique and absolute."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "105",
    "NoteID": "90",
    "Body": "Lit., \"thou hast learned [it well]\" - i.e., God's\\n\\t\\t\\t\\tmessage."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "107",
    "NoteID": "91",
    "Body": "I.e., no mortal has it in his power to cause another\\n\\t\\t\\t\\tperson to believe unless God graces that person with His\\n\\t\\t\\t\\tguidance."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "108",
    "NoteID": "92",
    "Body": "This prohibition of reviling anything that other people\\n\\t\\t\\t\\thold sacred - even in contravention of the principle of\\n\\t\\t\\t\\tGod's oneness - is expressed in the plural and is,\\n\\t\\t\\t\\ttherefore, addressed to all believers. Thus, while\\n\\t\\t\\t\\tMuslims are expected to argue against the false beliefs\\n\\t\\t\\t\\tof others, they are not allowed to abuse the objects of\\n\\t\\t\\t\\tthose beliefs and to hurt thereby the feelings of their\\n\\t\\t\\t\\terring fellow-men."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "108",
    "NoteID": "93",
    "Body": "Lit., \"thus goodly have We made ...\", etc., implying that\\n\\t\\t\\t\\tit is in the nature of man to regard the beliefs which\\n\\t\\t\\t\\thave been implanted in him from childhood, and which he\\n\\t\\t\\t\\tnow shares with his social environment, as the only true\\n\\t\\t\\t\\tand possible ones - with the result that a polemic\\n\\t\\t\\t\\tagainst those beliefs often tends to provoke a hostile\\n\\t\\t\\t\\tpsychological reaction."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "109",
    "NoteID": "94",
    "Body": "Lit.. \"Miracles are only with God.\" It is to be noted\\n\\t\\t\\t\\tthat the Qur'anic term ayah denotes not only a \"miracle\"\\n\\t\\t\\t\\t(in the sense of a happening that goes beyond the usual -\\n\\t\\t\\t\\tthat is, commonly observable - course of nature), but\\n\\t\\t\\t\\talso a \"sign\" or \"message\": and the last-mentioned\\n\\t\\t\\t\\tsignificance is the one which is by far the most\\n\\t\\t\\t\\tfrequently met with in the Qur'an. Thus, what is commonly\\n\\t\\t\\t\\tdescribed as a \"miracle\" constitutes, in fact, an unusual\\n\\t\\t\\t\\tmessage from God, indicating - sometimes in a symbolic\\n\\t\\t\\t\\tmanner - a spiritual truth which would otherwise have\\n\\t\\t\\t\\tremained hidden from man's intellect. But even such\\n\\t\\t\\t\\textraordinary, \"miraculous\" messages cannot be regarded\\n\\t\\t\\t\\tas \"supernatural\": for the so-called \"laws of nature\" are\\n\\t\\t\\t\\tonly a perceptible manifestation of \"God's way\" (sunnat\\n\\t\\t\\t\\tAllah) in respect of His creation - and, consequently,\\n\\t\\t\\t\\teverything that exists and happens, or could conceivably\\n\\t\\t\\t\\texist or happen, is \"natural\" in the innermost sense of\\n\\t\\t\\t\\tthis word irrespective of whether it conforms to the\\n\\t\\t\\t\\tordinary course of events or goes beyond it. Now since\\n\\t\\t\\t\\tthe extraordinary messages referred to manifest\\n\\t\\t\\t\\tthemselves, as a rule, through the instrumentality of\\n\\t\\t\\t\\tthose specially gifted and divinely elected personalities\\n\\t\\t\\t\\tknown as \"prophets\", these are sometimes spoken of as\\n\\t\\t\\t\\t\"performing miracles\" - a misconception which the Qur'an\\n\\t\\t\\t\\tremoves by the words, \"Miracles are in the power of God\\n\\t\\t\\t\\talone\". (See also  17:59  and the corresponding note\\n\\t\\t\\t\\t[71].)"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "110",
    "NoteID": "95",
    "Body": "I.e., so long as they remain blind to the truth in\r\\n\\t\\t\\t\\tconsequence of their unwillingness to acknowledge it -\r\\n\\t\\t\\t\\tand this in accordance with the law of cause and effect\r\\n\\t\\t\\t\\twhich God has imposed on His creation (see surah {2}, note\r\\n\\t\\t\\t\\t[7])."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "111",
    "NoteID": "96",
    "Body": "Sc., of the fact that there is life after death."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "111",
    "NoteID": "97",
    "Body": "See note [95] above."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "112",
    "NoteID": "98",
    "Body": "Lit., \"embellished speech\" or \"varnished falsehood\" (Lane\r\\n\\t\\t\\t\\tIII, 1223) \"by way of delusion\" - i.e., half-truths which\r\\n\\t\\t\\t\\tentice man by their deceptive attractiveness and cause\r\\n\\t\\t\\t\\thim to overlook all real spiritual values (see also\r\\n\\t\\t\\t\\t{25:30-31}). - Regarding my rendering of jinn as\r\\n\\t\\t\\t\\t\"invisible beings\", see note [86] above and Appendix III.\r\\n\\t\\t\\t\\tThe term shayatin (lit., \"satans\"), on the other hand, is\r\\n\\t\\t\\t\\toften used in the Qur'an in the sense of evil forces\r\\n\\t\\t\\t\\tinherent in man as well as in the spiritual world (cf.\r\\n\\t\\t\\t\\t 2:14 , and the corresponding note). According to several\r\\n\\t\\t\\t\\twell-authenticated Traditions, quoted by Tabari, the\r\\n\\t\\t\\t\\tProphet was asked, \"Are there satans from among men?\" -\r\\n\\t\\t\\t\\tand he replied, \"Yes, and they are more evil than the\r\\n\\t\\t\\t\\tsatans from among the invisible beings (al-jinn).\" Thus,\r\\n\\t\\t\\t\\tthe meaning of the above verse is that every prophet has\r\\n\\t\\t\\t\\thad to contend against the spiritual - and often physical\r\\n\\t\\t\\t\\t- enmity of the evil ones who, for whatever reason,\r\\n\\t\\t\\t\\trefuse to listen to the voice of truth and try to lead\r\\n\\t\\t\\t\\tothers astray."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "114",
    "NoteID": "99",
    "Body": "Lit., \"to seek a judge other than God\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "114",
    "NoteID": "100",
    "Body": "The expression mufassalan could also be rendered as \"in a\\n\\t\\t\\t\\tmanner that brings out the distinction (fasl) between\\n\\t\\t\\t\\ttruth and falsehood\" (Zamakhshari). The use of the plural\\n\\t\\t\\t\\t\"you\" indicates that the divine writ is addressed to all\\n\\t\\t\\t\\twho may come to know it."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "114",
    "NoteID": "101",
    "Body": "See  2:146 , and the corresponding note. The pronoun \"it\"\\n\\t\\t\\t\\tmay refer either to the earlier divine writ - the Bible -\\n\\t\\t\\t\\tand to its prediction of the advent of a prophet\\n\\t\\t\\t\\tdescended from Abraham, or, more probably, to the Qur'an:\\n\\t\\t\\t\\tin which case it must be rendered as \"this one, too\". In\\n\\t\\t\\t\\teither case, the above phrase seems to allude to the\\n\\t\\t\\t\\tinstinctive (perhaps only subconscious) awareness of some\\n\\t\\t\\t\\tof the followers of the Bible that the Qur'an is, in\\n\\t\\t\\t\\ttruth, an outcome of divine revelation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "115",
    "NoteID": "102",
    "Body": "When related to God, the term kalimah (lit., \"word\") is\\n\\t\\t\\t\\toften used in the Qur'an in the sense of \"promise\". In\\n\\t\\t\\t\\tthis instance it obviously refers to the Biblical promise\\n\\t\\t\\t\\t(Deuteronomy xviii, 15 and 18) that God would raise up a\\n\\t\\t\\t\\tprophet \"like unto Moses\" among the Arabs see surah {2},\\n\\t\\t\\t\\tnote [33]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "116",
    "NoteID": "103",
    "Body": "I.e., regarding the true nature of human life and its\\n\\t\\t\\t\\tultimate destiny, the problem of revelation, the\\n\\t\\t\\t\\trelationship between God and man, the meaning of good and\\n\\t\\t\\t\\tevil, etc. Apart from leading man astray from spiritual\\n\\t\\t\\t\\ttruths, such guesswork gives rise to the arbitrary rules\\n\\t\\t\\t\\tof conduct and self-imposed inhibitions to which the\\n\\t\\t\\t\\tQur'an alludes, by way of example, in verses {118} and\\n\\t\\t\\t\\t{119}."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "118",
    "NoteID": "104",
    "Body": "The purpose of this and the following verse is not, as\\n\\t\\t\\t\\tmight appear at first glance, a repetition of\\n\\t\\t\\t\\talready-promulgated food laws but, rather, a reminder\\n\\t\\t\\t\\tthat the observance of such laws should not be made an\\n\\t\\t\\t\\tend in itself and an object of ritual: and this is the\\n\\t\\t\\t\\treason why these two verses have been placed in the midst\\n\\t\\t\\t\\tof a discourse on God's transcendental unity and the ways\\n\\t\\t\\t\\tof man's faith. The \"errant views\" spoken of in verse\\n\\t\\t\\t\\t{119} are such as lay stress on artificial rituals and\\n\\t\\t\\t\\ttaboos rather than on spiritual values."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "120",
    "NoteID": "105",
    "Body": "This injunction connects with verse {118}, thus: \"Eat,\\n\\t\\t\\t\\tthen, of that over which God's name has been pronounced\\n\\t\\t\\t\\t..., but abstain from sinning\" - i.e., \"do not go beyond\\n\\t\\t\\t\\tthat which God has made lawful to you\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "121",
    "NoteID": "106",
    "Body": "Lit., \"the satans whisper unto those who are near to them\\n\\t\\t\\t\\t(ila awliya'ihim)\". For my above rendering of shayatin as\\n\\t\\t\\t\\t\"evil impulses\", see note [10] on  2:14  and note [31] on\\n\\t\\t\\t\\t 14:22 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "121",
    "NoteID": "107",
    "Body": "I.e., \"your own evil impulses are trying to draw you into\\n\\t\\t\\t\\targument as to what does and what does not constitute a\\n\\t\\t\\t\\tsin in order to make you lose sight of God's clear\\n\\t\\t\\t\\tordinances in this respect; and if you follow their\\n\\t\\t\\t\\tarbitrary, deceptive reasoning, you will elevate them, as\\n\\t\\t\\t\\tit were, to the position of moral law-givers, and thus\\n\\t\\t\\t\\tascribe to them a right that belongs to God alone.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "122",
    "NoteID": "108",
    "Body": "Lit., \"whereby he walks among men\". All the commentators\\n\\t\\t\\t\\tagree in that the expression \"he who was dead\" is\\n\\t\\t\\t\\tmetaphorical, and that it refers to people who become\\n\\t\\t\\t\\tspiritually alive through faith and are thereupon able to\\n\\t\\t\\t\\tpursue their way through life unerringly."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "123",
    "NoteID": "109",
    "Body": "Because the consciousness of their importance makes them\\n\\t\\t\\t\\tmore or less impervious to criticism, the \"great ones\"\\n\\t\\t\\t\\tare, as a rule, rather less inclined than other people to\\n\\t\\t\\t\\tquestion the moral aspects of their own behaviour: and\\n\\t\\t\\t\\tthe resulting self-righteousness only too often causes\\n\\t\\t\\t\\tthem to commit grave misdeeds."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "124",
    "NoteID": "110",
    "Body": "I.e., direct revelation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "126",
    "NoteID": "111",
    "Body": "Lit., \"and this thy Sustainer's way is straight\" - i.e.,\\n\\t\\t\\t\\tunchanging in its application of the law of cause and\\n\\t\\t\\t\\teffect to man's inner life as well. - The term rijs\\n\\t\\t\\t\\toccurring in the preceding sentence, and rendered by me\\n\\t\\t\\t\\tas \"horror\", signifies anything that is intrinsically\\n\\t\\t\\t\\tloathsome, horrible or abominable; in this case, it would\\n\\t\\t\\t\\tseem to denote that awesome feeling of utter futility\\n\\t\\t\\t\\twhich, sooner or later, overcomes everyone who does not\\n\\t\\t\\t\\tbelieve that life has meaning and purpose."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "128",
    "NoteID": "112",
    "Body": "According to most of the commentators, the invisible\\n\\t\\t\\t\\tbeings (al-jinn) referred to here are the \"evil forces\"\\n\\t\\t\\t\\t(shayatin) among them, such as are spoken of in verse\\n\\t\\t\\t\\t{112} of this surah. It is generally assumed that these\\n\\t\\t\\t\\tvery beings or forces are addressed here; but the primary\\n\\t\\t\\t\\tmeaning of the term ma'shar appearing in this context\\n\\t\\t\\t\\twarrants, in my opinion, a different conclusion. It is\\n\\t\\t\\t\\ttrue that this term is often used to denote a group or\\n\\t\\t\\t\\tcommunity or genus of sentient beings which have certain\\n\\t\\t\\t\\tcharacteristics in common: a conventional - and\\n\\t\\t\\t\\tundoubtedly justifiable - use based on the verb\\n\\t\\t\\t\\t'asharahu, \"he consorted [or \"was on intimate terms\"]\\n\\t\\t\\t\\twith him\" or \"lived in close communion with him\". But it\\n\\t\\t\\t\\tis precisely this verbal origin of the term ma'shar which\\n\\t\\t\\t\\tgives us a clue as to what is really meant here. Since,\\n\\t\\t\\t\\tin its primary significance, a person's ma'shar denotes\\n\\t\\t\\t\\tthose who are on intimate terms or in close communion\\n\\t\\t\\t\\twith him (cf. Lisan al-'Arab: \"A man's ma'shar is his\\n\\t\\t\\t\\tfamily\"), we may well assume that it has a similar\\n\\t\\t\\t\\tsignificance in the above Qur'anic phrase. Thus, to my\\n\\t\\t\\t\\tmind, the allocution ya ma'shar al-jinn does not denote,\\n\\t\\t\\t\\t\"O you community of [evil] invisible beings\" but, rather,\\n\\t\\t\\t\\t\"O you who are [or \"have lived\"] in close communion with\\n\\t\\t\\t\\t[evil] invisible beings\": in other words, it is addressed\\n\\t\\t\\t\\tto the misguided human beings who have been seduced by\\n\\t\\t\\t\\t\"glittering half-truths meant to delude the mind\" {verse\\n\\t\\t\\t\\t112}. This interpretation is reinforced by the words,\\n\\t\\t\\t\\t\"Have there not come unto you apostles from among\\n\\t\\t\\t\\tyourselves\", occurring in verse {130} below: for the\\n\\t\\t\\t\\tQur'an speaks always only of apostles who belonged to the\\n\\t\\t\\t\\thuman race, and never of apostles from among the jinn.\\n\\t\\t\\t\\t(As regards the wide significance of this latter term,\\n\\t\\t\\t\\tsee Appendix III.)"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "128",
    "NoteID": "113",
    "Body": "I.e., close to the evil invisible beings. It is to be\\n\\t\\t\\t\\tremembered that the primary meaning of wali (of which\\n\\t\\t\\t\\tawliya' is the plural) is \"one who is close [to\\n\\t\\t\\t\\tanother]\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "128",
    "NoteID": "114",
    "Body": "I.e., unless He graces them with His mercy (see verse\\n\\t\\t\\t\\t{12} of this surah, and the corresponding note). Some of\\n\\t\\t\\t\\tthe great Muslim theologians conclude from the above and\\n\\t\\t\\t\\tfrom the similar phrase occurring in  11:107  (as well as\\n\\t\\t\\t\\tfrom several well-authenticated sayings of the Prophet)\\n\\t\\t\\t\\tthat - contrary to the bliss of paradise, which will be\\n\\t\\t\\t\\tof unlimited duration - the suffering of the sinners in\\n\\t\\t\\t\\tthe life to come will be limited by God's mercy. (See in\\n\\t\\t\\t\\tthis connection the hadith quoted in note [10] on\\n\\t\\t\\t\\t 40:12 .)"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "129",
    "NoteID": "115",
    "Body": "Lit., \"to be close to one another\", or \"get hold of one\\n\\t\\t\\t\\tanother\". The expression \"in this manner\" (kadhalika),\\n\\t\\t\\t\\twhich introduces the above sentence, is an obvious\\n\\t\\t\\t\\tallusion to the manner in which the evil ones \"whisper\\n\\t\\t\\t\\tunto one another glittering half-truths meant to delude\\n\\t\\t\\t\\tthe mind\" verse {112} of this surah."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "131",
    "NoteID": "116",
    "Body": "Lit., \"communities\". The term qaryah (lit., \"town\",\\n\\t\\t\\t\\t\"village\" or \"land\") denotes also the people of a town or\\n\\t\\t\\t\\tland - in short, a \"community\" - and it is in this sense\\n\\t\\t\\t\\tthat this term is mostly, though not always, used in the\\n\\t\\t\\t\\tQur'an."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "132",
    "NoteID": "117",
    "Body": "Lit., \"all shall have grades out of what they did\", i.e.,\\n\\t\\t\\t\\tconsciously - since God does not take people to task for\\n\\t\\t\\t\\tany wrong they may have committed unless it was done in\\n\\t\\t\\t\\tconscious contravention of a moral law already made clear\\n\\t\\t\\t\\tto them by the prophets."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "135",
    "NoteID": "118",
    "Body": "Lit., \"to whom the [happy] end of the abode shall\\n\\t\\t\\t\\tbelong\". The term \"abode\" (dar) is used in the Qur'an\\n\\t\\t\\t\\twith reference to both the life of this world (dar\\n\\t\\t\\t\\tad-dunya) and the life to come (dar al-akhirah). Most of\\n\\t\\t\\t\\tthe commentators are of the opinion that it refers here\\n\\t\\t\\t\\tto the life to come; Zamakhshari, however, relates it to\\n\\t\\t\\t\\tlife on earth. Since either of these interpretations is\\n\\t\\t\\t\\tagreeable with the text, I have chosen the above\\n\\t\\t\\t\\trendering which comprises both."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "136",
    "NoteID": "119",
    "Body": "Falsely - because everything that exists belongs, in the\\n\\t\\t\\t\\tlast resort, to God alone."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "136",
    "NoteID": "120",
    "Body": "Lit., \"for our [God-]partners\" - i.e., \"those whom we\\n\\t\\t\\t\\tconsider to be associated with God\". For an explanation\\n\\t\\t\\t\\tof the term sharik, see note [15] on verse {22} of this\\n\\t\\t\\t\\tsurah. The pre-Islamic Arabs used to dedicate a part of\\n\\t\\t\\t\\ttheir agricultural produce and cattle to some of their\\n\\t\\t\\t\\tdeities, and a part to God, whom they regarded as one -\\n\\t\\t\\t\\talbeit the greatest - of them. In consonance, however,\\n\\t\\t\\t\\twith the method of the Qur'an, the above verse does not\\n\\t\\t\\t\\tallude merely to this historical aspect of pre-Islamic\\n\\t\\t\\t\\tArabian life but has a wider, more general implication as\\n\\t\\t\\t\\twell: that is, it refers not only to the apportioning of\\n\\t\\t\\t\\tdevotional \"shares\" between God and the imaginary\\n\\t\\t\\t\\tdeities, but also to the attribution of any share in His\\n\\t\\t\\t\\tcreative powers to anyone or anything beside Him."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "136",
    "NoteID": "121",
    "Body": "I.e., the fact that they assign a \"share\" of their\\n\\t\\t\\t\\tdevotions to God does not strengthen their belief in Him\\n\\t\\t\\t\\tbut, rather, implies a negation of His transcendental\\n\\t\\t\\t\\tuniqueness and, thus, makes them more and more dependent\\n\\t\\t\\t\\ton imaginary divine or semi-divine \"mediators\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "137",
    "NoteID": "122",
    "Body": "Lit., \"their [God-]partners make\". As pointed out by\\n\\t\\t\\t\\tRazi, some early commentators were of the opinion that\\n\\t\\t\\t\\tthe expression shuraka'uhum (lit., \"their associates\")\\n\\t\\t\\t\\tdenotes here the \"evil beings\" or \"forces\" (shayatin)\\n\\t\\t\\t\\tfrom among men and jinn referred to in verses {112},\\n\\t\\t\\t\\t{121}, {128} and {130} of this surah. It seems to me,\\n\\t\\t\\t\\thowever, that what is meant here - as in the preceding\\n\\t\\t\\t\\tverse - is the belief in the existence of anything that\\n\\t\\t\\t\\tcould be \"associated\" with God; hence my rendering of the\\n\\t\\t\\t\\tabove phrase as \"their belief in beings or powers that\\n\\t\\t\\t\\tare supposed...\", etc."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "137",
    "NoteID": "123",
    "Body": "This is a reference to the custom prevalent among the\\n\\t\\t\\t\\tpre-Islamic Arabs of burying alive some of their unwanted\\n\\t\\t\\t\\tchildren, mainly girls, and also to the occasional\\n\\t\\t\\t\\toffering of a boy-child in sacrifice to one or another of\\n\\t\\t\\t\\ttheir idols (Zamakhshari). Apart from this historical\\n\\t\\t\\t\\treference, the above Qur'an-verse seems to point out, by\\n\\t\\t\\t\\timplication, the psychological fact that an attribution\\n\\t\\t\\t\\tof divinity to anyone or anything but God brings with it\\n\\t\\t\\t\\tan ever-growing dependence on all kinds of imaginary\\n\\t\\t\\t\\tpowers which must be \"propitiated\" by formal and often\\n\\t\\t\\t\\tabsurd and cruel rites: and this, in turn, leads to the\\n\\t\\t\\t\\tloss of all spiritual freedom and to moral\\n\\t\\t\\t\\tself-destruction."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "137",
    "NoteID": "124",
    "Body": "I.e., He allows them to behave as they do because He\\n\\t\\t\\t\\twants them to make use of their reason and of the free\\n\\t\\t\\t\\twill with which He has endowed man."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "138",
    "NoteID": "125",
    "Body": "The pre-Islamic Arabs falsely claimed that these taboos\\n\\t\\t\\t\\twere ordained by God, as is made clear in the last part\\n\\t\\t\\t\\tof this verse. One of these supposed, arbitrary\\n\\t\\t\\t\\t\"ordinances\" laid down that only the priests of the\\n\\t\\t\\t\\tparticular idol and some men belonging to the tribe could\\n\\t\\t\\t\\teat the flesh of such dedicated animals, while women were\\n\\t\\t\\t\\tnot allowed to do so (Zamakhshari)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "138",
    "NoteID": "126",
    "Body": "I.e., while sacrificing them to their idols (see also\\n\\t\\t\\t\\t 5:103  and the corresponding note). It would seem from\\n\\t\\t\\t\\tthis allusion that, as a rule, the pagan Arabs did\\n\\t\\t\\t\\tpronounce the name of God - whom they regarded as the\\n\\t\\t\\t\\tsupreme deity - over the animals which they slaughtered;\\n\\t\\t\\t\\tin the abovementioned exceptional cases, however, they\\n\\t\\t\\t\\trefrained from doing so in the belief that God Himself\\n\\t\\t\\t\\thad forbidden it."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "141",
    "NoteID": "127",
    "Body": "This is the generally-accepted explanation of the term\\n\\t\\t\\t\\tma'rushat and ghayr ma'rushat (lit., \"those which are and\\n\\t\\t\\t\\tthose which are not provided with trellises\"). The\\n\\t\\t\\t\\tmention of \"gardens\" serves here to illustrate the\\n\\t\\t\\t\\tdoctrine that everything living and growing - like\\n\\t\\t\\t\\teverything else in the universe - owes its existence to\\n\\t\\t\\t\\tGod alone, and that it is, therefore, blasphemous to\\n\\t\\t\\t\\tconnect it causally or devotionally with any other power,\\n\\t\\t\\t\\tbe it real or imaginary."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "141",
    "NoteID": "128",
    "Body": "See note [85] on verse {99} of this surah."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "142",
    "NoteID": "129",
    "Body": "I.e., by superstitiously declaring as forbidden what God\\n\\t\\t\\t\\thas made lawful to man. All the references to pre-Islamic\\n\\t\\t\\t\\ttaboos given in verses {138-140} as well as {142-144} are\\n\\t\\t\\t\\tmeant to stress the lawfulness of any food (and, by\\n\\t\\t\\t\\timplication, of any other physical enjoyment) which God\\n\\t\\t\\t\\thas not expressly forbidden through revelation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "143",
    "NoteID": "130",
    "Body": "Lit., \"eight [in] pairs - of sheep two and of goats two\"\\n\\t\\t\\t\\t(the two other pairs are mentioned in the next verse).\\n\\t\\t\\t\\tThis is an outstanding example of the ellipticism often\\n\\t\\t\\t\\temployed in the Qur'an: a mode of expression which cannot\\n\\t\\t\\t\\tbe correctly rendered in any other language without the\\n\\t\\t\\t\\tuse of explanatory interpolations. The term zawj denotes\\n\\t\\t\\t\\ta pair of things as well as each of the two constituents\\n\\t\\t\\t\\tof a pair: hence my rendering of thamaniyat azwaj (lit.,\\n\\t\\t\\t\\t\"eight [in] pairs\") as \"four kinds of cattle of either\\n\\t\\t\\t\\tsex\". The particular superstition to which this and the\\n\\t\\t\\t\\tnext verse refer is probably identical with the one\\n\\t\\t\\t\\tmentioned in  5:103 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "143",
    "NoteID": "131",
    "Body": "Lit., \"tell me with knowledge\" - i.e., not on the basis\\n\\t\\t\\t\\tof guesswork but of knowledge acquired through authentic\\n\\t\\t\\t\\trevelation. The preceding and subsequent ironical\\n\\t\\t\\t\\tquestions are meant to bring out the vagueness and\\n\\t\\t\\t\\tinconsistency which characterizes all such superstitious,\\n\\t\\t\\t\\tself-imposed prohibitions."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "144",
    "NoteID": "132",
    "Body": "Lit., \"and of camels two, and of bovine cattle two\" -\\n\\t\\t\\t\\tthus completing the enumeration of the \"eight kinds\\n\\t\\t\\t\\t[i.e., four pairs] of cattle\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "144",
    "NoteID": "133",
    "Body": "Lit., \"[thus] to lead people astray\". However, the\\n\\t\\t\\t\\tconjunction li prefixed to the verb yudill (\"he leads\\n\\t\\t\\t\\tastray\") does not denote here - as is usually the case -\\n\\t\\t\\t\\tan intent (\"in order that\") but, rather, a logical sequel\\n\\t\\t\\t\\t(\"and thus...\"): a use which is described by the\\n\\t\\t\\t\\tgrammarians as lam al-'aqibah, \"the letter lam signifying\\n\\t\\t\\t\\ta causal sequence\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "145",
    "NoteID": "134",
    "Body": "Lit., \"forbidden to an eater to eat thereof\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "145",
    "NoteID": "135",
    "Body": "Lit., \"a sinful deed\" (fisq) - here signifying an\\n\\t\\t\\t\\tidolatrous offering."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "145",
    "NoteID": "136",
    "Body": "Cf.  2:173  and  5:3 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "146",
    "NoteID": "137",
    "Body": "The construction of the above sentence makes it clear\\n\\t\\t\\t\\tthat this prohibition was imposed specifically on the\\n\\t\\t\\t\\tJews, to the exclusion of believers of later times\\n\\t\\t\\t\\t(Razi)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "146",
    "NoteID": "138",
    "Body": "Cf. Leviticus vii, 23 (where, however, \"all manner\" of\\n\\t\\t\\t\\tfat of ox, sheep or goat is declared forbidden)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "146",
    "NoteID": "139",
    "Body": "See  3:93 ."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "147",
    "NoteID": "140",
    "Body": "I.e., regarding the Qur'anic statement in verse {145}\\n\\t\\t\\t\\tthat God forbids only a few, clearly-defined categories\\n\\t\\t\\t\\tof food. The pronoun \"they\" refers to the Jews as well as\\n\\t\\t\\t\\tto the pagan Arabs spoken of in the preceding verses -\\n\\t\\t\\t\\tboth of whom claim that God has imposed on man various\\n\\t\\t\\t\\tcomplicated restrictions in the matter of food. According\\n\\t\\t\\t\\tto the Qur'an, the Jews are wrong in their claim inasmuch\\n\\t\\t\\t\\tas they overlook the fact that the severe Mosaic food\\n\\t\\t\\t\\tlaws were a punishment for their past misdeeds see  3:93 \\n\\t\\t\\t\\tand, therefore, intended for them alone; and the pagan\\n\\t\\t\\t\\tArabs are wrong because their taboos have no divine basis\\n\\t\\t\\t\\twhatsoever and are due to mere superstition."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "148",
    "NoteID": "141",
    "Body": "I.e., the truth that God has endowed man with the ability\\n\\t\\t\\t\\tto choose between right and wrong. The above verse\\n\\t\\t\\t\\tconstitutes a categorical rejection of the doctrine of\\n\\t\\t\\t\\t\"predestination\" in the commonly-accepted sense of this\\n\\t\\t\\t\\tterm."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "148",
    "NoteID": "142",
    "Body": "I.e., knowledge regarding \"predestination\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "149",
    "NoteID": "143",
    "Body": "In other words, the real relationship between God's\\n\\t\\t\\t\\tknowledge of the future (and therefore the ineluctability\\n\\t\\t\\t\\tof what is to happen in the future) on the one side, and\\n\\t\\t\\t\\tman's free will, on the other - two propositions which,\\n\\t\\t\\t\\ton the face of it, seem to contradict one another - is\\n\\t\\t\\t\\tbeyond man's comprehension; but since both are postulated\\n\\t\\t\\t\\tby God, both must be true. The very concept of \"God\"\\n\\t\\t\\t\\tpresupposes His omniscience; and the very concept of\\n\\t\\t\\t\\tmorality and moral responsibility presupposes free will\\n\\t\\t\\t\\ton man's part. Had God so willed, every human being would\\n\\t\\t\\t\\thave been forced to live righteously; but this would have\\n\\t\\t\\t\\tamounted to depriving man of his free will, and morality\\n\\t\\t\\t\\tof all its meaning."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "150",
    "NoteID": "144",
    "Body": "A reference to the arbitrary prohibitions mentioned in\\n\\t\\t\\t\\tthe preceding passages."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "150",
    "NoteID": "145",
    "Body": "Lit., \"make [others] equal to their Sustainer\": i.e.,\\n\\t\\t\\t\\tattribute divine or almost-divine qualities to certain\\n\\t\\t\\t\\till-defined natural powers - e.g., believe in\\n\\t\\t\\t\\t\"spontaneous\" creative evolution, or in a \"self-created\"\\n\\t\\t\\t\\tuniverse, or in a mysterious, impersonal elan vital that\\n\\t\\t\\t\\tsupposedly underlies all existence, etc."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "151",
    "NoteID": "146",
    "Body": "In the consensus of all the commentators, the phrase\\n\\t\\t\\t\\tinterpolated by me between brackets is clearly implied in\\n\\t\\t\\t\\tthe above commandment, since it is mentioned among the\\n\\t\\t\\t\\tthings which God has forbidden - and being good towards\\n\\t\\t\\t\\tone's parents is not only not forbidden but, on the\\n\\t\\t\\t\\tcontrary, enjoined over and over in the Qur'an."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "151",
    "NoteID": "147",
    "Body": "This may possibly refer to abortions dictated by economic\\n\\t\\t\\t\\tconsiderations."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "151",
    "NoteID": "148",
    "Body": "Sc., \"and not resort to brute force whenever your private\\n\\t\\t\\t\\tinterests are involved\". The expression \"otherwise than\\n\\t\\t\\t\\tin [the pursuit of] justice\" refers to the execution of a\\n\\t\\t\\t\\tlegal punishment or to killing in a just - that is,\\n\\t\\t\\t\\tdefensive - war, or to individual, legitimate\\n\\t\\t\\t\\tself-defence."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "152",
    "NoteID": "149",
    "Body": "I.e., after the orphan in one's charge has come of age,\\n\\t\\t\\t\\tthe former guardian may \"touch\" his property, legally, by\\n\\t\\t\\t\\tborrowing from it or otherwise utilizing it with the\\n\\t\\t\\t\\towner's consent. The phrase rendered by me as \"save to\\n\\t\\t\\t\\timprove it\" reads, literally, \"in a manner that is best\",\\n\\t\\t\\t\\twhich implies the intent of bettering it."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "152",
    "NoteID": "150",
    "Body": "This refers metonymically to all dealings between men and\\n\\t\\t\\t\\tnot only to commercial transactions: hence my\\n\\t\\t\\t\\tinterpolation of \"in all your dealings\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "152",
    "NoteID": "151",
    "Body": "The meaning is that God does not expect man to behave\\n\\t\\t\\t\\twith \"mathematical\" equity - which, in view of the many\\n\\t\\t\\t\\tintangible factors involved, is rarely attainable in\\n\\t\\t\\t\\thuman dealings - but expects him to do his best towards\\n\\t\\t\\t\\tachieving this ideal."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "152",
    "NoteID": "152",
    "Body": "According to Razi, the phrase \"when you voice an opinion\"\\n\\t\\t\\t\\t(lit., \"when you speak\") applies to expressing an opinion\\n\\t\\t\\t\\ton any subject, whether it concerns one personally or\\n\\t\\t\\t\\tnot; but the subsequent reference to one's \"near of kin\"\\n\\t\\t\\t\\tmakes it probable that the above injunction relates, in\\n\\t\\t\\t\\tparticular, to the giving of evidence in cases under\\n\\t\\t\\t\\tdispute."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "152",
    "NoteID": "153",
    "Body": "See surah {2}, note [19]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "153",
    "NoteID": "154",
    "Body": "Lit., \"to become scattered\"."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "154",
    "NoteID": "155",
    "Body": "See note [31] on the last paragraph of verse {38} of this\\n\\t\\t\\t\\tsurah. In this instance, the stress implied in the use of\\n\\t\\t\\t\\tthumma seems to point to verse {91} of this surah."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "154",
    "NoteID": "156",
    "Body": "I.e., everything that they needed by way of laws and\\n\\t\\t\\t\\tinjunctions appropriate to their time and the stage of\\n\\t\\t\\t\\ttheir development (Razi). See in this connection the\\n\\t\\t\\t\\tphrase, \"Unto every one of you have We appointed a\\n\\t\\t\\t\\t[different] law and way of life\", occurring in  5:48 ,\\n\\t\\t\\t\\tand the corresponding note [66]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "156",
    "NoteID": "157",
    "Body": "I.e., to the Jews and the Christians, who were the only\\n\\t\\t\\t\\ttwo communities known to the Arabs as possessing revealed\\n\\t\\t\\t\\tscriptures."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "157",
    "NoteID": "158",
    "Body": "Although this passage refers, in the first instance, to\\n\\t\\t\\t\\tthe Arabian contemporaries of the Prophet, its message is\\n\\t\\t\\t\\tnot restricted to them but relates to all people, at all\\n\\t\\t\\t\\ttimes, who refuse to believe in revelation unless they\\n\\t\\t\\t\\tthemselves are its direct recipients."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "158",
    "NoteID": "159",
    "Body": "I.e., the signs announcing the Day of Judgment."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "158",
    "NoteID": "160",
    "Body": "Lit., \"or [did not] earn good in his faith\": thus, faith\\n\\t\\t\\t\\twithout good works is here declared to be equivalent to\\n\\t\\t\\t\\thaving no faith at all (Zamakhshari)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "159",
    "NoteID": "161",
    "Body": "A reference, primarily, to the Jews and the Christians,\r\\n\\t\\t\\t\\twho have departed from the fundamental religious\r\\n\\t\\t\\t\\tprinciples which they had originally shared in their\r\\n\\t\\t\\t\\tentirety, and have gone different ways in respect of\r\\n\\t\\t\\t\\tdoctrine and ethics (cf.  3:105 ). Beyond this \"primary\"\r\\n\\t\\t\\t\\treference, however, the above verse connects logically\r\\n\\t\\t\\t\\twith verse {153} above, \"this is the way leading straight\r\\n\\t\\t\\t\\tunto Me: follow it, then, and follow not other ways, lest\r\\n\\t\\t\\t\\tthey cause you to deviate from His way\" - and thus\r\\n\\t\\t\\t\\trelates prophetically to the followers of the Qur'an as\r\\n\\t\\t\\t\\twell: in other words it expresses a condemnation of all\r\\n\\t\\t\\t\\tsectarianism arising out of people's intolerant,\r\\n\\t\\t\\t\\tmutually-exclusive claims to being \"the only true\r\\n\\t\\t\\t\\texponents\" of the Qur'anic teachings. Thus, when asked\r\\n\\t\\t\\t\\tabout the implications of this verse, the Prophet's\r\\n\\t\\t\\t\\tCompanion Abu Hurayrah is reported to have answered \"It\r\\n\\t\\t\\t\\thas been revealed with reference to this [our] community\"\r\\n\\t\\t\\t\\t(Tabari)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "160",
    "NoteID": "162",
    "Body": "Lit., \"and they shall not be wronged\". See in this\\n\\t\\t\\t\\tconnection the statement that God \"has willed upon\\n\\t\\t\\t\\tHimself the law of grace and mercy\", occurring in verse\\n\\t\\t\\t\\t{12} of this surah, and the corresponding note [10]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "164",
    "NoteID": "163",
    "Body": "This statement - which is also found in  17:15 ,  35:18 ,\\n\\t\\t\\t\\t 39:7  and  53:38  - constitutes a categorical rejection\\n\\t\\t\\t\\tof the Christian doctrines of \"original sin\" and\\n\\t\\t\\t\\t\"vicarious atonement\". For the wider ethical implications\\n\\t\\t\\t\\tof this statement, {see 53:38}, where it occurs for the\\n\\t\\t\\t\\tfirst time in the chronological order of revelation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "164",
    "NoteID": "164",
    "Body": "See surah {2}, note [95]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "165",
    "NoteID": "165",
    "Body": "See 2.30, and the corresponding note [22]."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "165",
    "NoteID": "166",
    "Body": "I.e., by way of character, strength, knowledge, social position, wealth, etc."
  }
]
