[
  {
    "SurahNumber": "98",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "I.e., idol-worshippers or animists (in the\\n\\t\\t\\t\\tanthropological sense of this word) who have never had\\n\\t\\t\\t\\tany revealed scripture to fall back upon."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "This aggregate connotation is inherent in the adjective\\n\\t\\t\\t\\tqayyimah as used here (Razi). - The above passage has\\n\\t\\t\\t\\tcaused some difficulties to the classical commentators on\\n\\t\\t\\t\\taccount of the participle munfakkin occurring in the\\n\\t\\t\\t\\tfirst verse. It is generally assumed that this\\n\\t\\t\\t\\tparticiple, in combination with the phrase lam yakun at\\n\\t\\t\\t\\tthe beginning of the verse, denotes \"they did not [or\\n\\t\\t\\t\\t\"could not\"] give up\" or \"separate themselves from\" -\\n\\t\\t\\t\\ti.e., supposedly, from their erroneous beliefs - \"until\\n\\t\\t\\t\\tthere came to them the evidence of the truth\" in the\\n\\t\\t\\t\\tperson of the Prophet Muhammad and in the revelation of\\n\\t\\t\\t\\tthe Qur'an: implying that after the evidence came, they\\n\\t\\t\\t\\tdid give up those false beliefs. This assumption is,\\n\\t\\t\\t\\thowever, deficient on two counts: firstly, it is\\n\\t\\t\\t\\twell-known that not all of the erring ones from among the\\n\\t\\t\\t\\tahl al-kitab and the mushrikin accepted the message of\\n\\t\\t\\t\\tthe Qur'an when it was conveyed to them; and, secondly,\\n\\t\\t\\t\\tthe ahl al-kitab are spoken of in verse {4} as having\\n\\t\\t\\t\\t\"broken their unity [of faith]\" - i.e., offended against\\n\\t\\t\\t\\tthe fundamental principles of that faith - after \"the\\n\\t\\t\\t\\tevidence of the truth\" had come to them. This apparent\\n\\t\\t\\t\\tcontradiction has been convincingly resolved by no less\\n\\t\\t\\t\\tan authority than Ibn Taymiyyah (see Tafsir Sitt Suwar,\\n\\t\\t\\t\\tpp. 391 ff.); and it is his interpretation that I have\\n\\t\\t\\t\\tfollowed in my rendering of the above three verses.\\n\\t\\t\\t\\tAccording to Ibn Taymiyyah, the pivotal phrase lam yakun\\n\\t\\t\\t\\tmunfakkin does not denote \"they did not give up\" or\\n\\t\\t\\t\\t\"separate themselves from\", but, rather, \"they are not\\n\\t\\t\\t\\tabandoned\" - i.e., condemned by God - unless and until\\n\\t\\t\\t\\tthey have been shown the right way by a God-sent prophet,\\n\\t\\t\\t\\tand thereupon have consciously refused to follow it: and\\n\\t\\t\\t\\tthis is in accord with repeated statements in the Qur'an\\n\\t\\t\\t\\tto the effect that God does not take anyone to task for\\n\\t\\t\\t\\twrong beliefs and wrong actions unless the true meaning\\n\\t\\t\\t\\tof right and wrong has previously been made clear to him\\n\\t\\t\\t\\t(cf. {6:131-132} and the second paragraph of  17:15 , as\\n\\t\\t\\t\\twell as the corresponding notes). Hence, the above\\n\\t\\t\\t\\treference to \"the evidence of the truth\" does not relate\\n\\t\\t\\t\\tonly to the Qur'an and the Prophet Muhammad but to all\\n\\t\\t\\t\\tthe earlier prophets and revelations as well (cf.  42:13 \\n\\t\\t\\t\\tand the corresponding notes [12-14]- just as the\\n\\t\\t\\t\\t\"ordinances of ever-true soundness and clarity\" (spelled\\n\\t\\t\\t\\tout in verse {5} below) are common to all God-inspired\\n\\t\\t\\t\\tmessages, of which the Qur'an is the final, most perfect\\n\\t\\t\\t\\texpression."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "This definition is general, comprising the followers of\\n\\t\\t\\t\\tall religious teachings revealed before the advent of the\\n\\t\\t\\t\\tProphet Muhammad (Ibn Kathir), and not - as some\\n\\t\\t\\t\\tcommentators assume - only the Jews and the Christians.\\n\\t\\t\\t\\t(See also notes [12] and [13] on  3:19 .)"
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "I.e., most of them strayed from the teachings of the\\n\\t\\t\\t\\tprophets sent to them, all of whom had preached the same\\n\\t\\t\\t\\tfundamental truths (see next verse and note {6} below)."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "For this rendering of hunafa' (sing. hanif), see surah\\n\\t\\t\\t\\t{2}, note [110]."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "5",
    "NoteID": "6",
    "Body": "Since the term zakah has here obviously a wider meaning\\n\\t\\t\\t\\tthan the obligatory tax incumbent on Muslims (which, as\\n\\t\\t\\t\\tits name indicates, is meant to purify their income and\\n\\t\\t\\t\\ttheir possessions from the taint of selfishness), I am\\n\\t\\t\\t\\trendering the above phrase in the more general sense of\\n\\t\\t\\t\\t\"spending in [i.e., practicing] charity\"."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "5",
    "NoteID": "7",
    "Body": "As regards the connotation of \"moral law\" in the term\\n\\t\\t\\t\\tdin, see note [3] on  109:6;  the qualifying noun\\n\\t\\t\\t\\tal-qayyimah (in the genitive case) has here the same\\n\\t\\t\\t\\tmeaning as the adjective qayyimah at the end of verse\\n\\t\\t\\t\\t{3}. The above definition of moral law outlines, in a\\n\\t\\t\\t\\tcondensed form, all the basic demands of true religion: a\\n\\t\\t\\t\\tcognition of God's oneness and uniqueness and,\\n\\t\\t\\t\\timplicitly, of man's responsibility to Him; a\\n\\t\\t\\t\\tturning-away from all false concepts, values and dubious\\n\\t\\t\\t\\tbeliefs, all over-estimation of oneself, and all\\n\\t\\t\\t\\tsuperstition; and finally, kindness and charity towards\\n\\t\\t\\t\\tall of God's creatures."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "6",
    "NoteID": "8",
    "Body": "Namely, the self-evident principles formulated in the\\n\\t\\t\\t\\tpreceding verse as the beginning and the end of all moral\\n\\t\\t\\t\\tlaw."
  }
]
