[
  {
    "SurahNumber": "10",
    "AyahNumber": "1",
    "NoteID": "1381",
    "Body": "For the Abbreviated Letters generally see Appendix I."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "1",
    "NoteID": "1382",
    "Body": "Ayat = Signs, or Verses of the Qur-an. Here both meanings\\n\\t\\t\\t\\tare to be understood. Each verse is a nugget of wisdom.\\n\\t\\t\\t\\tAnd in the verses immediately following, e.g., x. 3-6,\\n\\t\\t\\t\\texamples are given of the wonders of Allah's material\\n\\t\\t\\t\\tCreation. If the starry heavens impress us with their\\n\\t\\t\\t\\tsublimity as signs of Allah's wisdom and power, how much\\n\\t\\t\\t\\tmore wonderful is it that He should speak to lowly man\\n\\t\\t\\t\\tthrough His Messengers, in man's language, so that he can\\n\\t\\t\\t\\tunderstand?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "2",
    "NoteID": "1383",
    "Body": "Is it not still more wonderful that the inspired man\\n\\t\\t\\t\\tshould be one of ourselves? The Arabs had known Muhammad\\n\\t\\t\\t\\tin other relations and conditions, and when the mighty\\n\\t\\t\\t\\tMessage came through his mouth-the message of Wisdom and\\n\\t\\t\\t\\tPower, such as no man could speak as from himself, least\\n\\t\\t\\t\\tof all a man not instructed in human learning,-they could\\n\\t\\t\\t\\tonly in their wonder attribute it to magic and sorcery.\\n\\t\\t\\t\\tThey failed to understand that magic and sorcery were\\n\\t\\t\\t\\tprojections of their own mind, while here was solid,\\n\\t\\t\\t\\tenduring Truth from Allah!"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "2",
    "NoteID": "1384",
    "Body": "Allah's Message was and is not all smooth and agreeable.\\n\\t\\t\\t\\tThe first thing is to convince us of our wrong-doing, and\\n\\t\\t\\t\\twarn us of our danger. If we have Faith, we then learn\\n\\t\\t\\t\\twhat a high rank we obtain in the sight of Allah.\\n\\t\\t\\t\\tAccording to another view the word \"qadama\" here refers\\n\\t\\t\\t\\tto the fact that the acts of a person precede him to his\\n\\t\\t\\t\\tLord. The word sidq qualifies these acts with sincerity\\n\\t\\t\\t\\tand genuineness."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "3",
    "NoteID": "1385",
    "Body": "See note 1031 to vii. 54."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "3",
    "NoteID": "1386",
    "Body": "Istawa, with the preposition ila after it, means He\\n\\t\\t\\t\\tturned to or He directed Himself by His will to as in\\n\\t\\t\\t\\tii-29. With the preposition 'ala after it, as here and in\\n\\t\\t\\t\\tvii. 54 and elsewhere, the meaning seems to be \"to mount\\n\\t\\t\\t\\tor ascend,\" and to be firmly established, to sit firm and\\n\\t\\t\\t\\tunshaken, beyond question. \"The Throne represents many\\n\\t\\t\\t\\tideas: e.g., (1) that God is high above all His Creation;\\n\\t\\t\\t\\t(2) that He regulates and governs it, as a king does,\\n\\t\\t\\t\\twhose authority is unquestionably recognised; (3) that He\\n\\t\\t\\t\\tis not, therefore, like the gods of Greece, and paganism,\\n\\t\\t\\t\\twho were imagined to be in a world apart, careless of\\n\\t\\t\\t\\tmankind, or jealous of mankind, but on the contrary. He\\n\\t\\t\\t\\t(4) disposes of their affairs and all affairs\\n\\t\\t\\t\\tcontinuously and with justice; (5) that the authority of\\n\\t\\t\\t\\tHis prophets, ministers, and messengers is derived from\\n\\t\\t\\t\\tHim, and such intercession as they can make is by His\\n\\t\\t\\t\\twill and permission."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "3",
    "NoteID": "1387",
    "Body": "Cf. vi. 80."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "4",
    "NoteID": "1388",
    "Body": "Haqq: true, right, for just ends, in right proportions,\\n\\t\\t\\t\\tsure and certain: all these ideas are implied."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "4",
    "NoteID": "1389",
    "Body": "Cf. n. 120 to ii. 117. Allah's creation is not a simple\\n\\t\\t\\t\\tact, once done and finished with. It is continuous, and\\n\\t\\t\\t\\tthere are many stages, not the least important of which\\n\\t\\t\\t\\tis the Hereafter, when the fruits of our life will be\\n\\t\\t\\t\\tachieved."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "4",
    "NoteID": "1390",
    "Body": "Hamim: boiling fluid: it is associated as in xxxviii. 57,\\n\\t\\t\\t\\twith gassaq, a dark, murky, or intensely cold fluid; both\\n\\t\\t\\t\\tindicative of the grievous penalty that results from\\n\\t\\t\\t\\trebellion against Allah."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "5",
    "NoteID": "1391",
    "Body": "The fitting epithet for the sun is dhiaa, \"splendour and\\n\\t\\t\\t\\tglory of brightness\", and for the moon is \"a light\" (of\\n\\t\\t\\t\\tbeauty), the cool light that illuminates and helps in the\\n\\t\\t\\t\\tdarkness of the night. But the sun and moon also measure\\n\\t\\t\\t\\ttime. The simplest observation can keep pace with the\\n\\t\\t\\t\\ttrue lunar months and lunar years, which are all that is\\n\\t\\t\\t\\trequired by a pastoral people. For agriculture solar\\n\\t\\t\\t\\tyears are required, as they indicate the changes of the\\n\\t\\t\\t\\tseasons, but ordinary solar years are never exact; even\\n\\t\\t\\t\\tthe solar year of 365 1/4 days requires correction by\\n\\t\\t\\t\\tadvanced astronomical calculation."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "5",
    "NoteID": "1392",
    "Body": "Everything in Allah's creation has use and purpose, and\\n\\t\\t\\t\\tfits into a Design. It is true in every sense of the word\\n\\t\\t\\t\\tand it is good and just. It is not merely a matter of\\n\\t\\t\\t\\tsport or freak (xxi. 16). Though so varied, it proclaims\\n\\t\\t\\t\\tAllah's Unity; though a limited free-will is granted to\\n\\t\\t\\t\\tcreatures, the results of evil (which is rebellion) are\\n\\t\\t\\t\\tneutralised and harmony is restored. Cf. iii. 191."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "5",
    "NoteID": "1393",
    "Body": "Cf. ix. I 1."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "6",
    "NoteID": "1394",
    "Body": "Cf. ii. 164."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "7",
    "NoteID": "1395",
    "Body": "Those who fall from Grace are described by three\\n\\t\\t\\t\\tepithets: (1) the meeting with Allah is not the object of\\n\\t\\t\\t\\ttheir hope and earnest desire, but something else, viz.\\n\\t\\t\\t\\t(2) the material good of this world, which not only\\n\\t\\t\\t\\tattracts them but apparently gives them complete\\n\\t\\t\\t\\tsatisfaction, so that there is no glow of the Future in\\n\\t\\t\\t\\ttheir horizon, and (3) they are deaf and dead to the\\n\\t\\t\\t\\tresounding and living Message of Allah, (1) and (2) refer\\n\\t\\t\\t\\tto the extinction of Faith in them, and (3) to their\\n\\t\\t\\t\\tfailing a prey to the evils of this world in their\\n\\t\\t\\t\\tconduct. They are contrasted in x. 9 with the Faith and\\n\\t\\t\\t\\tthe Righteousness of those who accept Grace."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "9",
    "NoteID": "1396",
    "Body": "Their Faith is the cause as well as the instrument of\\n\\t\\t\\t\\ttheir Guidance,-the Kindly Light which leads them as well\\n\\t\\t\\t\\tas the Joy which fills their Soul."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "10",
    "NoteID": "1397",
    "Body": "A beautiful piece of spiritual melody! They sing and\\n\\t\\t\\t\\tshout with joy, but their joy is in the Glory of Allah!\\n\\t\\t\\t\\tThe greetings they receive and the greetings they give\\n\\t\\t\\t\\tare of Peace and Harmony! From first to last they realise\\n\\t\\t\\t\\tthat it is Allah Who cherished them and made them grow,\\n\\t\\t\\t\\tand His rays are their Light."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "11",
    "NoteID": "1398",
    "Body": "Those who have no hope for the Future grasp at any\\n\\t\\t\\t\\ttemporary advantage, and in their blindness even\\n\\t\\t\\t\\tmockingly ask for immediate punishment for their sins\\n\\t\\t\\t\\t(viii. 32), thus vainly challenging Allah, in Whom they\\n\\t\\t\\t\\tdo not believe. If the beneficent Allah were to take them\\n\\t\\t\\t\\tat their word, they would have no chance at all. Their\\n\\t\\t\\t\\tdoom would be sealed. But even the respite they get they\\n\\t\\t\\t\\tuse badly. They merely wander about distractedly like\\n\\t\\t\\t\\tblind men, to and fro. Cf. ii. 15."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "12",
    "NoteID": "1399",
    "Body": "Not only do men fail to use their respite: even those who\\n\\t\\t\\t\\thave a superficial belief in Allah call on Him in their\\n\\t\\t\\t\\ttrouble but forget Him when He has relieved their\\n\\t\\t\\t\\ttrouble. Their Faith is not strong enough to make them\\n\\t\\t\\t\\trealise that all good proceeds from Allah. But in moments\\n\\t\\t\\t\\tof trouble they use every position, literally and\\n\\t\\t\\t\\tfiguratively, to appeal to Him."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "12",
    "NoteID": "1400",
    "Body": "Those without Faith are selfish, and are so wrapped up in\\n\\t\\t\\t\\tthemselves that they think every good that comes to them\\n\\t\\t\\t\\tis due to their own merits or cleverness. That is itself\\n\\t\\t\\t\\ta cause of their undoing. They do not see their own\\n\\t\\t\\t\\tfaults."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "14",
    "NoteID": "1401",
    "Body": "This is addressed to the Quraish in the first instance,\\n\\t\\t\\t\\tfor they had succeeded to the 'Ad and the Thamud\\n\\t\\t\\t\\theritage. But the application is universal, and was true\\n\\t\\t\\t\\tto the 'Abbasi Empire in the time of Harun-ar-Rashid, or\\n\\t\\t\\t\\tthe Muslim Empire in Spain or the Turkish Empire in its\\n\\t\\t\\t\\tpalmiest days, and indeed, to the Muslims and non-Muslims\\n\\t\\t\\t\\tof our own days."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "15",
    "NoteID": "1402",
    "Body": "Reading: in the Arabic, the word is \"Qur-an\", which may\\n\\t\\t\\t\\tmean Reading or in the special sense, the Qur-an. The\\n\\t\\t\\t\\tduty of Allah's Messenger is to deliver Allah's Message\\n\\t\\t\\t\\tas it is revealed to him, whether it please or displease\\n\\t\\t\\t\\tthose who hear it. Selfish men want to read their own\\n\\t\\t\\t\\tdesires or fancies into religious precepts, and thus they\\n\\t\\t\\t\\tare often willing to use Religion for their own ends.\\n\\t\\t\\t\\tMost of the corruptions of Religion are due to this\\n\\t\\t\\t\\tcause. But Religion is not to be so prostituted."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "16",
    "NoteID": "1403",
    "Body": "It is in Allah's Plan that He should reveal Himself in\\n\\t\\t\\t\\tcertain ways to His creatures, and His Messengers are the\\n\\t\\t\\t\\tinstruments that carry out His will. It is in itself\\n\\t\\t\\t\\tgracious Mercy that He should thus make His Will known.\\n\\t\\t\\t\\tWe should be grateful for His guidance instead of carping\\n\\t\\t\\t\\tat it."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "16",
    "NoteID": "1404",
    "Body": "Muhammad Al-Musafa had lived his whole life of purity and\\n\\t\\t\\t\\tvirtue amongst his people, and they knew and Mustafa\\n\\t\\t\\t\\tacknowledged it before he received his mission. They knew\\n\\t\\t\\t\\the loved his nation and was loyal to it. Why should they\\n\\t\\t\\t\\tturn against him when he had to point out under\\n\\t\\t\\t\\tinspiration all their sins and wrong-doing? It was for\\n\\t\\t\\t\\ttheir own good. And he had to plead again and again with\\n\\t\\t\\t\\tthem: \"Will you not understand, and see what a glorious\\n\\t\\t\\t\\tprivilege it is for you to receive true guidance from\\n\\t\\t\\t\\tAllah?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "18",
    "NoteID": "1405",
    "Body": "When we shut our eyes to Allah's glory and goodness, and\\n\\t\\t\\t\\tgo after false gods, we give some plausible excuse to\\n\\t\\t\\t\\tourselves, such as that they will intercede for us. But\\n\\t\\t\\t\\thow can stocks and stones intercede for us? And how can\\n\\t\\t\\t\\tmen intercede for us, when they themselves have need of\\n\\t\\t\\t\\tAllah's Mercy? Even the best and noblest cannot intercede\\n\\t\\t\\t\\tas of right, but only with His permission (x. 3). To\\n\\t\\t\\t\\tpretend that there are other powers than Allah is to\\n\\t\\t\\t\\tinvent lies and to teach Allah. There is nothing in\\n\\t\\t\\t\\theaven or earth that He does not know, and there is no\\n\\t\\t\\t\\tother like unto Him."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "19",
    "NoteID": "1406",
    "Body": "Cf. ii 213. All mankind was created one, and Allah's\\n\\t\\t\\t\\tMessage to mankind is in essence one, the Message of\\n\\t\\t\\t\\tUnity and Truth. But as selfishness and egotism got hold\\n\\t\\t\\t\\tof man, certain differences sprang up between\\n\\t\\t\\t\\tindividuals, races, and nations, and in His infinite\\n\\t\\t\\t\\tMercy He sent them messengers and messages to suit their\\n\\t\\t\\t\\tvarying mentality, to test them by His gifts, and stir\\n\\t\\t\\t\\tthem up to emulation in virtue and piety (v. 48)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "19",
    "NoteID": "1407",
    "Body": "Cf. vi. 115. ix 40, and iv. 171. \"Word\" is the Decree of\\n\\t\\t\\t\\tAllah, the expression of His Universal Will or Wisdom in\\n\\t\\t\\t\\ta particular case. When men began to diverge from one\\n\\t\\t\\t\\tanother (see last note), Allah made their very\\n\\t\\t\\t\\tdifferences subserve the higher ends by increasing their\\n\\t\\t\\t\\temulation in virtue and piety, and thus pointing back to\\n\\t\\t\\t\\tthe ultimate Unity and Reality."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "20",
    "NoteID": "1408",
    "Body": "Their demand for a Sign is disingenuous. All nature and\\n\\t\\t\\t\\trevelation furnishes them with incontestable Signs. What\\n\\t\\t\\t\\tthey want is the Book of the Unseen opened out to them\\n\\t\\t\\t\\tlike the physical leaves of a book. But they forget that\\n\\t\\t\\t\\ta physical Book is on a wholly different plane from\\n\\t\\t\\t\\tAllah's Mysteries, and that their physical natures cannot\\n\\t\\t\\t\\tapprehend the mysteries. They must wait. Truth will also\\n\\t\\t\\t\\twait. But the waiting in the two cases is in quite\\n\\t\\t\\t\\tdifferent senses. Cf. vi. 158 and ix. 52."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "21",
    "NoteID": "1409",
    "Body": "Man turns his thoughts in adversity to Allah. But as soon\\n\\t\\t\\t\\tas the trouble is past, he not only forgets Him but\\n\\t\\t\\t\\tactually strives against His cause. But such people are\\n\\t\\t\\t\\tpoor ignorant creatures, not realising that the Universal\\n\\t\\t\\t\\tPlan of Allah is swifter to stop their petty plans, and\\n\\t\\t\\t\\tthat though they fail, the record of them remains\\n\\t\\t\\t\\teternally against them."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "22",
    "NoteID": "1410",
    "Body": "All the great inventions and discoveries on which man\\n\\t\\t\\t\\tprides himself are the fruit of that genius and talent\\n\\t\\t\\t\\twhich Allah has freely given of His grace. But the spirit\\n\\t\\t\\t\\tof man remains petty, as is illustrated by the parable\\n\\t\\t\\t\\tfrom the sea. How the heart of man rejoices when the ship\\n\\t\\t\\t\\tgoes smoothly with favourable winds! How in adversity it\\n\\t\\t\\t\\tturns, in terror and helplessness, to Allah, and makes\\n\\t\\t\\t\\tvows for deliverance! and how those vows are disregarded\\n\\t\\t\\t\\tas soon as the danger is past! Cf. vi. 63."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "23",
    "NoteID": "1411",
    "Body": "In our insolence and pride we do not see how small and\\n\\t\\t\\t\\tephemeral is that part of us which is mortal. We shall\\n\\t\\t\\t\\tsee it at last when we appear before our Judge. In the\\n\\t\\t\\t\\tmeantime our ridiculous pretensions only hurt ourselves."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "24",
    "NoteID": "1412",
    "Body": "Another beautiful Parable, explaining the nature of our\\n\\t\\t\\t\\tpresent life. The rain comes down in drops and mingles\\n\\t\\t\\t\\twith the earth. Through it, by Allah's matchless\\n\\t\\t\\t\\tartistry, the womb of the earth is made fruitful. All\\n\\t\\t\\t\\tkinds of good, useful, and beautiful grains, vegetables,\\n\\t\\t\\t\\tand fruits are produced for men and animals. The earth is\\n\\t\\t\\t\\tcovered in its bravery of green and gold and all kinds of\\n\\t\\t\\t\\tcolours. Perhaps the \"owner\" takes all the credit to\\n\\t\\t\\t\\thimself, and thinks that this will last eternally. A\\n\\t\\t\\t\\thailstorm or a blast, a frost or a volcanic eruption,\\n\\t\\t\\t\\tcomes and destroys it, or it may be even normally, that\\n\\t\\t\\t\\tthe time of harvest comes, and the fields and orchards\\n\\t\\t\\t\\tare stripped bare by some blight or disease. Where is the\\n\\t\\t\\t\\tbeauty and bravery of yesterday? All that is left is dust\\n\\t\\t\\t\\tand ashes! What more can we get from this physical\\n\\t\\t\\t\\tmaterial life?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "25",
    "NoteID": "1413",
    "Body": "In contrast with the ephemeral and uncertain pleasures of\\n\\t\\t\\t\\tthis material life, there is a higher life to which Allah\\n\\t\\t\\t\\tis always calling. It is called the Home of Peace. For\\n\\t\\t\\t\\tthere is no fear, nor disappointment nor sorrow there.\\n\\t\\t\\t\\tAnd all are called, and those will be chosen who have\\n\\t\\t\\t\\tsought, not material advantages, but the Good Pleasure of\\n\\t\\t\\t\\tAllah. Salam, Peace, is from the same root as Islam, the\\n\\t\\t\\t\\tReligion of Unity and Harmony."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "26",
    "NoteID": "1414",
    "Body": "The reward of the righteous will be far more than in\\n\\t\\t\\t\\tproportion to their merits. For they will have the\\n\\t\\t\\t\\tsupreme bliss of being near to Allah, and \"seeing His\\n\\t\\t\\t\\tface\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "26",
    "NoteID": "1415",
    "Body": "The face is the symbol of the Personality, the inner and\\n\\t\\t\\t\\treal Self, which is the antithesis of the outer and\\n\\t\\t\\t\\tephemeral Self. It will be illuminated with Allah's\\n\\t\\t\\t\\tLight, behind which is no shadow or darkness. All its old\\n\\t\\t\\t\\tshortcomings will be blotted out, with their sense of\\n\\t\\t\\t\\tshame, for there will be Perfection, as in Allah's sight."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "27",
    "NoteID": "1416",
    "Body": "Note that the evil reward is for those who have \"earned\"\\n\\t\\t\\t\\tevil, i.e., brought it on themselves by the deliberate\\n\\t\\t\\t\\tchoice of evil. Further, in the justice of Allah, they\\n\\t\\t\\t\\twill be requited with evil similar to, and not greater in\\n\\t\\t\\t\\tquantity or intensity, than the evil they had\\n\\t\\t\\t\\tdone,-unlike the good, who, in Allah's generosity, get a\\n\\t\\t\\t\\treward far greater than anything they have earned or\\n\\t\\t\\t\\tcould possibly earn."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "27",
    "NoteID": "1417",
    "Body": "Night is the negation of Light and metaphorically of joy\\n\\t\\t\\t\\tand felicity. The intensive is indicated by \"the depth of\\n\\t\\t\\t\\tthe darkness of Night.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "28",
    "NoteID": "1418",
    "Body": "The false gods are not real: they are only the figments\\n\\t\\t\\t\\tof the imaginations of those who indulged in the false\\n\\t\\t\\t\\tworship. But the prophets or great or good men whose\\n\\t\\t\\t\\tnames were vainly taken in competition with the name of\\n\\t\\t\\t\\tAllah, and the personified Ideas or Idols treated in the\\n\\t\\t\\t\\tsame way would themselves protest against their names\\n\\t\\t\\t\\tbeing used in that way, and show that the worship was\\n\\t\\t\\t\\tpaid not to them, but to the ignorance or superstition or\\n\\t\\t\\t\\tselfish lusts of the false worshippers."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "29",
    "NoteID": "1419",
    "Body": "See last note. They did not even know that they were\\n\\t\\t\\t\\tbeing falsely worshipped in that way."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "30",
    "NoteID": "1420",
    "Body": "Cf. ii. 95, where the verb used is qaddama. The verb\\n\\t\\t\\t\\taslafa, used here, is nearly synonymous."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "30",
    "NoteID": "1421",
    "Body": "Instead of their false ideas helping them, they will\\n\\t\\t\\t\\tdesert them and leave them in the lurch. Cf. vi. 24."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "31",
    "NoteID": "1422",
    "Body": "Sustenance may be understood in the sense of all the\\n\\t\\t\\t\\tprovision necessary for maintaining physical life as well\\n\\t\\t\\t\\tas mental and spiritual development and well-being.\\n\\t\\t\\t\\tExamples of the former are light and rain from heaven and\\n\\t\\t\\t\\tthe produce of the earth and facilities of movement on\\n\\t\\t\\t\\tland and sea and in air. Examples of the latter are the\\n\\t\\t\\t\\tmoral and spiritual influences that come from our\\n\\t\\t\\t\\tfellow-men, and from the great Teachers and Prophets."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "31",
    "NoteID": "1423",
    "Body": "Just two of our ordinary faculties, hearing and sight,\\n\\t\\t\\t\\tare mentioned, as examples of the rest. All the gifts of\\n\\t\\t\\t\\tAllah, physical and spiritual, are enjoyed and\\n\\t\\t\\t\\tincorporated by us by means of the faculties and\\n\\t\\t\\t\\tcapacities with which He has endowed us."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "31",
    "NoteID": "1424",
    "Body": "Cf. iii. 27 and n. 371; vi. 95 and n. 920; and xxx. 19."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "31",
    "NoteID": "1425",
    "Body": "This is the general summing-up of the argument. The\\n\\t\\t\\t\\tgovernment of the whole Creation and its maintenance and\\n\\t\\t\\t\\tsustenance is in the hands of Allah. How futile then\\n\\t\\t\\t\\twould it be to neglect His true worship and go after\\n\\t\\t\\t\\tfalse gods?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "32",
    "NoteID": "1426",
    "Body": "The wonderful handiwork and wisdom of Allah having been\\n\\t\\t\\t\\treferred to, as the real Truth, as against the false\\n\\t\\t\\t\\tworship and false gods that men set up, it follows that\\n\\t\\t\\t\\tto disregard the Truth must lead us into woeful wrong,\\n\\t\\t\\t\\tnot only in our beliefs but in our conduct. We shall err\\n\\t\\t\\t\\tand stray and be lost. How then can we turn away from the\\n\\t\\t\\t\\tTruth?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "33",
    "NoteID": "1427",
    "Body": "Disobedience to Allah brings its own terrible\\n\\t\\t\\t\\tconsequences on ourselves. The Law, the Word, the Decree,\\n\\t\\t\\t\\tof Allah must be fulfilled. If we go to false gods, our\\n\\t\\t\\t\\tFaith will be dimmed, and then extinguished. Our\\n\\t\\t\\t\\tspiritual faculties will be dead."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "34",
    "NoteID": "1428",
    "Body": "The argument is now turned in another direction. The\\n\\t\\t\\t\\tfalse gods can neither create out of nothing nor sustain\\n\\t\\t\\t\\tthe creative energy which maintains the world. Nor can\\n\\t\\t\\t\\tthey give any guidance which can be of use for the future\\n\\t\\t\\t\\tdestiny of mankind: on the contrary they themselves\\n\\t\\t\\t\\t(assuming they were men who were deified) stand in need\\n\\t\\t\\t\\tof such guidance. Why then follow vain fancies, instead\\n\\t\\t\\t\\tof going to the source of all knowledge, truth, and\\n\\t\\t\\t\\tguidance, and worship, serve, and obey Allah, the One\\n\\t\\t\\t\\tTrue God?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "37",
    "NoteID": "1429",
    "Body": "The Book: Cf. iii. 23 and n. 366. Allah's revelation\\n\\t\\t\\t\\tthroughout the ages is one. The Qur-an confirms, fulfils,\\n\\t\\t\\t\\tcompletes, and further explains the one true revelation,\\n\\t\\t\\t\\twhich has been sent by the One True God in all ages."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "38",
    "NoteID": "1430",
    "Body": "Cf. ii. 23 and n. 42."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "39",
    "NoteID": "1431",
    "Body": "Taawil: elucidation, explanation, final fulfilment, Cf.\\n\\t\\t\\t\\tvii. 53, The Message of Allah not only gives us rules for\\n\\t\\t\\t\\tour every-day conduct, but speaks of high matters of\\n\\t\\t\\t\\treligious significance, which require elucidation in two\\n\\t\\t\\t\\tways: (1) by experience from the actual facts of life,\\n\\t\\t\\t\\tand (2) by the final fulfilment of the hopes and warnings\\n\\t\\t\\t\\twhich we now take on trust through our Faith. The\\n\\t\\t\\t\\tUnbelievers reject Allah's Message simply because they\\n\\t\\t\\t\\tcannot understand it and without giving it even a chance\\n\\t\\t\\t\\tof elucidation in any of these ways."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "39",
    "NoteID": "1432",
    "Body": "Wrong-doers always came to grief ultimately. The true\\n\\t\\t\\t\\tcourse of history shows it from a broad standpoint. But\\n\\t\\t\\t\\tthey are so headstrong that they prejudge issues in their\\n\\t\\t\\t\\tignorance before they are decided."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "41",
    "NoteID": "1433",
    "Body": "When the Prophet of Allah is rejected and charged with\\n\\t\\t\\t\\tfalsehood, he does not give up his work, but continues to\\n\\t\\t\\t\\tteach and preach his Message. He can well say to those\\n\\t\\t\\t\\twho interfere with him: \"Mind your own business:\\n\\t\\t\\t\\tsupposing your charge against me is true, you incur no\\n\\t\\t\\t\\tresponsibility: I have to answer for it before Allah: and\\n\\t\\t\\t\\tif I do my duty and deliver my Message, your rejection\\n\\t\\t\\t\\tdoes not make me liable for your wrong-doing: you will\\n\\t\\t\\t\\thave to answer before Allah.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "42",
    "NoteID": "1434",
    "Body": "Cf. vi. 25, 36, 39 and notes. Hypocrites go to hear and\\n\\t\\t\\t\\tsee some great Teacher, but they get no profit out of it\\n\\t\\t\\t\\tbecause they are not sincerely seeking the truth. They\\n\\t\\t\\t\\tare like the blind, or the deaf, or the imbeciles. It is\\n\\t\\t\\t\\timpossible to guide them, because they have not the will\\n\\t\\t\\t\\tto be guided."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "44",
    "NoteID": "1435",
    "Body": "Allah cannot be blamed for man's evil, nor will He deal\\n\\t\\t\\t\\tunjustly with man. He has given him faculties and means\\n\\t\\t\\t\\tof guidance. If man goes wrong, it is because he wrongs\\n\\t\\t\\t\\thimself."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "45",
    "NoteID": "1436",
    "Body": "In eternity our life on this earth will look as if it had\\n\\t\\t\\t\\tbeen just a little part of our little day, and so also\\n\\t\\t\\t\\twill appear any interval between our death and the call\\n\\t\\t\\t\\tto Judgment."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "45",
    "NoteID": "1437",
    "Body": "We shall retain some perception of our mutual relations\\n\\t\\t\\t\\ton earth, so that the righteous judgment which will be\\n\\t\\t\\t\\tpronounced will be intelligible to us, and we shall be\\n\\t\\t\\t\\tconvinced of its righteousness."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "46",
    "NoteID": "1438",
    "Body": "The Prophet is assured that the end of evil is evil, just\\n\\t\\t\\t\\tas the end of good is good. Whether this result is made\\n\\t\\t\\t\\tplain before his very eyes in his own life-time or\\n\\t\\t\\t\\tafterwards, makes no difference. The wicked should not\\n\\t\\t\\t\\trejoice if they are given rope and seem to have the upper\\n\\t\\t\\t\\thand for a time, nor should the righteous lose heart: for\\n\\t\\t\\t\\tAllah's promise is sure and must come to pass. And in any\\n\\t\\t\\t\\tcase, the scales can only be partially, if at all,\\n\\t\\t\\t\\tadjusted in this life. There is the final and complete\\n\\t\\t\\t\\tadjustment on the Day of Judgment. Allah is All-Knowing,\\n\\t\\t\\t\\tand all truth will be before Him."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "47",
    "NoteID": "1439",
    "Body": "Every people or generation or nation had its Message or\\n\\t\\t\\t\\tMessenger: Allah revealed Himself to it in some way or\\n\\t\\t\\t\\tanother. If that Messenger was ignored or rejected, or\\n\\t\\t\\t\\this Message was twisted or misused, the Day of Reckoning\\n\\t\\t\\t\\twill come, when perfect justice will be done and the\\n\\t\\t\\t\\twhole Truth revealed. The Unbelievers mockingly say: \"If\\n\\t\\t\\t\\tthat is true, pray tell us when that Day will come!\" The\\n\\t\\t\\t\\tanswer of the Messenger is: \"It will come in good time:\\n\\t\\t\\t\\tno one can either hasten or retard it. If you want me\\n\\t\\t\\t\\tthen to save you or if you fear that I shall harm you for\\n\\t\\t\\t\\tyour treatment of me, know that this matter is in the\\n\\t\\t\\t\\thands of Allah alone, Who will do perfect justice. Even\\n\\t\\t\\t\\tin regard to myself, any harm or good that befalls me is\\n\\t\\t\\t\\tby the command and in the power of Allah\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "49",
    "NoteID": "1440",
    "Body": "Cf. vii. 188."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "49",
    "NoteID": "1441",
    "Body": "This repeats vii. 34, but the significance is different\\n\\t\\t\\t\\tin the two contexts. Here the reply is to the\\n\\t\\t\\t\\tUnbelievers' mocking incredulity (see n. 1439) as to\\n\\t\\t\\t\\twhether there is such a thing as a Hereafter: they\\n\\t\\t\\t\\tsuggest to the Prophet of Allah that if his claim to\\n\\t\\t\\t\\tinspiration from Allah is true, he should get them\\n\\t\\t\\t\\tpunished at once for rejecting him. In vii. 34 the\\n\\t\\t\\t\\treference is to the punishment of iniquity as described\\n\\t\\t\\t\\tin vii. 33: sin is not necessarily punished at once:\\n\\t\\t\\t\\tevery People or generation gets a chance-, when their\\n\\t\\t\\t\\tterm is fulfilled, the final adjustment is made."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "50",
    "NoteID": "1442",
    "Body": "The mockery of Unbelievers will be turned into panic when\\n\\t\\t\\t\\tthe wrath of Allah descends on them. It may do so\\n\\t\\t\\t\\tsuddenly, by night or by day, when they ]cast expect it.\\n\\t\\t\\t\\tWill they then say of any bit of it: \"Let it be\\n\\t\\t\\t\\thastened\"?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "52",
    "NoteID": "1443",
    "Body": "This will be the final doom, and they will themselves\\n\\t\\t\\t\\thave brought it on themselves! The psychology of the\\n\\t\\t\\t\\tUnbelievers is here analysed and exposed. This particular\\n\\t\\t\\t\\targument begins at x. 47 and ends at x. 53. It begins\\n\\t\\t\\t\\twith the general statement that every People has had due\\n\\t\\t\\t\\twarning and explanation by means of a Prophet specially\\n\\t\\t\\t\\tsent to them: that Prophet will be a relevant witness at\\n\\t\\t\\t\\tthe final Judgment, when the matter will be judged in\\n\\t\\t\\t\\tperfect equity. Then follows a dialogue. The Unbelievers\\n\\t\\t\\t\\tmock and say, \"Why not bring on the Punishment now?\" The\\n\\t\\t\\t\\treply to the Unbelievers is, \"It will come in Allah's\\n\\t\\t\\t\\tgood time\". The Believers are told to watch and see how\\n\\t\\t\\t\\tthe sinners would take it if the Punishment were to come\\n\\t\\t\\t\\tat once. Would they not think it too sudden? When it\\n\\t\\t\\t\\tactually comes, their panic will be indescribable. \"Is\\n\\t\\t\\t\\tthat true?\" say the Unbelievers. \"It is the very truth,\"\\n\\t\\t\\t\\tis the answer, \"and nothing can ward it off\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "54",
    "NoteID": "1444",
    "Body": "Cf. iii. 91."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "54",
    "NoteID": "1445",
    "Body": "Declare their repentance: the verb in the original is\\n\\t\\t\\t\\tasarru, which may mean either \"declare\" or \"reveal\" or\\n\\t\\t\\t\\telse \"conceal\" or \"hide\". The classical Commentators are\\n\\t\\t\\t\\tdivided as to the meaning to be adopted here. If the\\n\\t\\t\\t\\tfirst, which I prefer, the sense would be: \"When the\\n\\t\\t\\t\\tPenalty stares the sinners in the face, they would give\\n\\t\\t\\t\\tanything to escape it, and they would even openly declare\\n\\t\\t\\t\\ttheir repentance, which would be a source of shame and\\n\\t\\t\\t\\tignominy to them.\" If the latter meaning be taken, the\\n\\t\\t\\t\\tsense would be: \"They would give anything to escape the\\n\\t\\t\\t\\tPenalty; but the hardest thing of all for them is frankly\\n\\t\\t\\t\\tto confess and repent, and so they conceal their sense of\\n\\t\\t\\t\\tshame and ignominy.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "57",
    "NoteID": "1446",
    "Body": "Those who do wrong have a disease in their hearts, which\\n\\t\\t\\t\\twill cause their spiritual death. Allah in His Mercy\\n\\t\\t\\t\\tdeclares His Will to them, which should direct their\\n\\t\\t\\t\\tlives and provide a healing for their spiritual disease.\\n\\t\\t\\t\\tIf they accept Faith, the remedy acts; they find\\n\\t\\t\\t\\tthemselves in right guidance and receive Allah's\\n\\t\\t\\t\\tforgiveness and mercy. Surely those are far better gifts\\n\\t\\t\\t\\tthan material advantages, wealth, or possessions."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "59",
    "NoteID": "1447",
    "Body": "\"Sustenance\" is to be taken in both the literal and the\\n\\t\\t\\t\\tmetaphorical sense. In the literal sense, what fine and\\n\\t\\t\\t\\tvaried things Allah has provided for us on land and in\\n\\t\\t\\t\\tsea and air, in the vegetable, animal, and mineral\\n\\t\\t\\t\\tkingdoms? Yet narrow minds put artificial barriers\\n\\t\\t\\t\\tagainst their use. In the metaphorical sense, what\\n\\t\\t\\t\\tenchanting fields of knowledge and spiritual endeavour\\n\\t\\t\\t\\tare provided in our individual and social lives? And who\\n\\t\\t\\t\\tis to say that some are lawful and others forbidden?\\n\\t\\t\\t\\tSupposing they were so in special circumstances, it is\\n\\t\\t\\t\\tnot right to attribute artificial restrictions of that\\n\\t\\t\\t\\tkind to Allah and falsely erect religious sanctions\\n\\t\\t\\t\\tagainst them."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "60",
    "NoteID": "1448",
    "Body": "People who lie in Religion or invent false gods, or false\\n\\t\\t\\t\\tworship,-have they any idea of the Day of Judgment, when\\n\\t\\t\\t\\tthey will be called to account, and will have to answer\\n\\t\\t\\t\\tfor their deeds?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "60",
    "NoteID": "1449",
    "Body": "Allah is most kind, and gracious, and generous with His\\n\\t\\t\\t\\tgifts of all kinds, material and spiritual. But men do\\n\\t\\t\\t\\tnot understand, and arc ungrateful in forgetting the\\n\\t\\t\\t\\tGiver of all and setting up false objects of worship and\\n\\t\\t\\t\\tfalse standards of pride."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "61",
    "NoteID": "1450",
    "Body": "There is nothing that men can do but Allah is a witness\\n\\t\\t\\t\\tto it. We may be deeply engrossed in some particular\\n\\t\\t\\t\\tthing and for the time being be quite unconscious of\\n\\t\\t\\t\\tother things. But Allah's knowledge not only comprehends\\n\\t\\t\\t\\tall things, but has all things actively before it.\\n\\t\\t\\t\\tNothing is hidden from Him. And His knowledge has another\\n\\t\\t\\t\\tquality which human knowledge has not. Human knowledge is\\n\\t\\t\\t\\tsubject to time, and is obliterated by time. Allah's\\n\\t\\t\\t\\tknowledge is like a Record and endures forever. And His\\n\\t\\t\\t\\tRecord has a further quality which human records have\\n\\t\\t\\t\\tnot. The most permanent human record may be quite\\n\\t\\t\\t\\tintelligible to those who make it but may be ambiguous to\\n\\t\\t\\t\\tothers and may become unintelligible with the progress of\\n\\t\\t\\t\\ttime, as happens almost invariably to the most enduring\\n\\t\\t\\t\\tinscriptions from very ancient times: but in Allah's\\n\\t\\t\\t\\t\"Record\" or knowledge there is no ambiguity, for it is\\n\\t\\t\\t\\tindependent of time, or place. This is the force of Mubin\\n\\t\\t\\t\\t(\"clear\") here."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "62",
    "NoteID": "1451",
    "Body": "Allah's all-embracing knowledge and constant watchful\\n\\t\\t\\t\\tcare over all His creatures, may be a source of fear to\\n\\t\\t\\t\\tsinners, but there is no fear for those whom He honours\\n\\t\\t\\t\\twith His love and friendship,-neither in this world nor\\n\\t\\t\\t\\tin the world to come."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "65",
    "NoteID": "1452",
    "Body": "Sometimes the words of the unrighteous or their revilings\\n\\t\\t\\t\\thurt or grieve the righteous man, but there is no\\n\\t\\t\\t\\toccasion for either anger or sorrow: they have no power\\n\\t\\t\\t\\tand they can do no real dishonour, for all power and\\n\\t\\t\\t\\thonour are from Allah."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "66",
    "NoteID": "1453",
    "Body": "All creatures are subject to Allah. If, therefore, any\\n\\t\\t\\t\\tfalse worship is set up, the false gods-so called\\n\\t\\t\\t\\t\"partners\"-are merely creatures of imagination or false\\n\\t\\t\\t\\tinventions."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "67",
    "NoteID": "1454",
    "Body": "Our physical life-and our higher life in so far as it is\\n\\t\\t\\t\\tlinked with the physical-is sustained by the alternation\\n\\t\\t\\t\\tof rest and activity, and the fit environment for this\\n\\t\\t\\t\\talternation is the succession of Nights and Days in our\\n\\t\\t\\t\\tphysical world. The Day makes the things \"visible to us-\"\\n\\t\\t\\t\\ta beautiful symbol, not only of the physical work for\\n\\t\\t\\t\\twhich we go about by day, but of the higher activities\\n\\t\\t\\t\\twhich are fitly associated with seeing, perception and\\n\\t\\t\\t\\tenquiry. Intuition (insight) is a little out of that\\n\\t\\t\\t\\tcircle because that may come by night, when our other\\n\\t\\t\\t\\tfaculties are resting."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "69",
    "NoteID": "1455",
    "Body": "In Quranic language \"prosperity\" refers both to our\\n\\t\\t\\t\\tevery-day life and to the higher life within us,-to the\\n\\t\\t\\t\\tPresent and the Future,-health and strength,\\n\\t\\t\\t\\topportunities and resources, a spirit of contentment, and\\n\\t\\t\\t\\tthe power of influencing others. Here there seems to be\\n\\t\\t\\t\\tan extra touch of meaning. A liar not only deprives\\n\\t\\t\\t\\thimself of prosperity in all senses, but his \"lie\" itself\\n\\t\\t\\t\\tagainst Allah will not succeed: it will and must be found\\n\\t\\t\\t\\tout."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "71",
    "NoteID": "1456",
    "Body": "The reference to Noah's story here is only incidental, to\\n\\t\\t\\t\\tillustrate a special point. The fuller story will be\\n\\t\\t\\t\\tfound in xi. 25-48, and in many other passages, e.g.,\\n\\t\\t\\t\\tvii. 59-64, xxiii 23-32, xxvi, 105-122, and xxxvii,\\n\\t\\t\\t\\t75-82. At each place there is a special point in the\\n\\t\\t\\t\\tcontext. The special point here is that Noah's very life\\n\\t\\t\\t\\tand preaching among his wicked people was a cause of\\n\\t\\t\\t\\toffence to them. But he feared nothing, trusted in Allah,\\n\\t\\t\\t\\tdelivered his message, and was saved from the Flood."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "71",
    "NoteID": "1457",
    "Body": "Firm in his sense of Truth from Allah. Noah plainly told\\n\\t\\t\\t\\this people to condemn him to death if they liked, openly\\n\\t\\t\\t\\tand in concert, so that he should at least know who would\\n\\t\\t\\t\\tlisten to his Message and who would not. He wanted them\\n\\t\\t\\t\\tto be frank and direct, for he feared nothing."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "72",
    "NoteID": "1458",
    "Body": "The Prophet of Allah preaches for the good of his people.\\n\\t\\t\\t\\tBut he claims no reward from them, but on the contrary is\\n\\t\\t\\t\\treviled, persecuted, banished, and often slain."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "73",
    "NoteID": "1459",
    "Body": "Cf. vii. 64."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "74",
    "NoteID": "1460",
    "Body": "I understand the meaning to be that there is a sort of\\n\\t\\t\\t\\tspiritual an influence descending from generation to\\n\\t\\t\\t\\tgeneration, among the Unbelievers as among the men of\\n\\t\\t\\t\\tFaith. In history we find the same problems in many\\n\\t\\t\\t\\tages,-denial of Allah's grace, defiance of Allah's law,\\n\\t\\t\\t\\trejection of Allah's Message. These influences cause the\\n\\t\\t\\t\\thearts of the contumacious to be sealed and impervious to\\n\\t\\t\\t\\tthe Truth. Cf. ii. 7 and notes. What they do is to\\n\\t\\t\\t\\tprejudge the issues even before the Prophet explains\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "75",
    "NoteID": "1461",
    "Body": "The story of Moses, Aaron, and Pharaoh is fully told in\\n\\t\\t\\t\\tvii. 103-137, and there are references to it in many\\n\\t\\t\\t\\tplaces in the Qur-an. The incidental reference here is to\\n\\t\\t\\t\\tillustrate a special point, viz., that the wicked are\\n\\t\\t\\t\\tarrogant and bound up in their sin, and prefer deception\\n\\t\\t\\t\\tto Truth: they do not hesitate to charge the men of\\n\\t\\t\\t\\tAllah, who work unselfishly for them, with mean motives,\\n\\t\\t\\t\\tsuch as would actuate them in similar circumstances!"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "77",
    "NoteID": "1462",
    "Body": "Sorcery is the very opposite of Truth,-being deception of\\n\\t\\t\\t\\tplausible shows by the powers of evil. But these cannot\\n\\t\\t\\t\\tsucceed or last permanently, and Truth must ultimately\\n\\t\\t\\t\\tprevail."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "78",
    "NoteID": "1463",
    "Body": "Notice how they attribute evil motives to the men of\\n\\t\\t\\t\\tAllah, motives of ambition and lust of power, which the\\n\\t\\t\\t\\tmen of Allah had been sent expressly to put down. The\\n\\t\\t\\t\\tsame device was used against Al-Mustafa."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "81",
    "NoteID": "1464",
    "Body": "When they threw their rods, the rods became snakes by a\\n\\t\\t\\t\\ttrick of sorcery, but Moses's miracles were greater than\\n\\t\\t\\t\\tany tricks of sorcery, and had real Truth behind them."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "82",
    "NoteID": "1465",
    "Body": "Allah's Words or Commands have real power, while\\n\\t\\t\\t\\tSorcerers' tricks only seem wonderful by deceiving the\\n\\t\\t\\t\\teye."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "83",
    "NoteID": "1466",
    "Body": "The pronoun \"his\" in \"his People\" is taken by some\\n\\t\\t\\t\\tCommentators to refer to Pharaoh. The Majority Of\\n\\t\\t\\t\\tPharaoh's people refused to believe at the time, but the\\n\\t\\t\\t\\tsorcerers believed (vii. 120), and so did Pharaoh's wife\\n\\t\\t\\t\\t(lxvi. 11), and ultimately Pharaoh himself, though too\\n\\t\\t\\t\\tlate (x. 90). If we took \"his\" to refer to Moses, it\\n\\t\\t\\t\\twould mean that the Israelites were hard-hearted and\\n\\t\\t\\t\\tgrumbled (vii. 129) even when they were being delivered\\n\\t\\t\\t\\tfrom Egypt, and only a few of them had any real faith in\\n\\t\\t\\t\\tAllah's providence and the working of His Law, and they\\n\\t\\t\\t\\tfeared Pharaoh even more than they feared Allah."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "85",
    "NoteID": "1467",
    "Body": "A trial for those who practise oppression: the various\\n\\t\\t\\t\\tmeanings of Fitnat have been explained in n. 1198 to\\n\\t\\t\\t\\tviii. 25. The prayer is that the righteous people, being\\n\\t\\t\\t\\tweak, should be saved from being used as objects of\\n\\t\\t\\t\\toppression or punishment at the hands of powerful\\n\\t\\t\\t\\tenemies. Weakness tempts Power to practise oppression,\\n\\t\\t\\t\\tand is thus an occasion of trial for the oppressors."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "87",
    "NoteID": "1468",
    "Body": "This instruction, we may suppose, was given when the\\n\\t\\t\\t\\tsorcerers were brought to faith, and some of the\\n\\t\\t\\t\\tEgyptians believed. Moses was for a little while to\\n\\t\\t\\t\\tremain in Egypt, so that his Message should have time to\\n\\t\\t\\t\\twork, before the Israelites were led out of Egypt. They\\n\\t\\t\\t\\twere to make their houses into places of prayer (Qibla),\\n\\t\\t\\t\\tas Pharaoh would not probably allow them to set up public\\n\\t\\t\\t\\tplaces of prayer, and they were now to be only sojourners\\n\\t\\t\\t\\tin Egypt. These were the glad tidings (the Gospel) of\\n\\t\\t\\t\\tIslam, which was preached under Noah, Abraham, Moses, and\\n\\t\\t\\t\\tJesus, and completed under Muhammad."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "88",
    "NoteID": "1469",
    "Body": "Moses's prayer, in which Aaron joined, for he was always\\n\\t\\t\\t\\twith him, may be paraphrased thus: \"O Allah! we\\n\\t\\t\\t\\tunderstand that the glitter and the wealth of the\\n\\t\\t\\t\\tEgyptians are not to be envied. They are but the\\n\\t\\t\\t\\tephemeral goods of this life. They are a disadvantage, in\\n\\t\\t\\t\\tthat in their pride of possessions the Egyptians mislead\\n\\t\\t\\t\\tthemselves and others. Let their pride be their undoing!\\n\\t\\t\\t\\tTurn their wealth into bitterness and their hearts into\\n\\t\\t\\t\\thardness, for they reject Thee, and they will not believe\\n\\t\\t\\t\\tuntil they actually see the Punishment of their sins!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "88",
    "NoteID": "1470",
    "Body": "A terrible curse! Let their wealth and splendour become\\n\\t\\t\\t\\tso defaced in their features, that instead of being\\n\\t\\t\\t\\tobjects of desire, they become objects of loathing! The\\n\\t\\t\\t\\theart is the seat of affections and joy: let it be so\\n\\t\\t\\t\\thardened by their unbelief that it becomes the seat of\\n\\t\\t\\t\\thatred and grief! It is when they see the Penalty that\\n\\t\\t\\t\\tthey will believe!"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "89",
    "NoteID": "1471",
    "Body": "Be not dazzled by their splendour, but stand out straight\\n\\t\\t\\t\\tfor Truth, for that is your salvation! Addressed in form\\n\\t\\t\\t\\tto Moses and Aaron, in substance it is addressed to the\\n\\t\\t\\t\\tIsraelites,"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "90",
    "NoteID": "1472",
    "Body": "Notice the swiftness of the action in the narrative. The\\n\\t\\t\\t\\texecution of poetic justice could not have been described\\n\\t\\t\\t\\tin fewer words."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "90",
    "NoteID": "1473",
    "Body": "That is, in the One True God. This was death-bed\\n\\t\\t\\t\\trepentance, and even so it was forced by the terror of\\n\\t\\t\\t\\tthe catastrophe. So it was not accepted (cf. iv. 18) in\\n\\t\\t\\t\\tits entirety. Only the body was saved from the sea, and\\n\\t\\t\\t\\tpresumably, according to Egyptian custom, it was embalmed\\n\\t\\t\\t\\tand the mummy was given due rites of the dead. But the\\n\\t\\t\\t\\tstory commemorated forever Allah's working, in mercy for\\n\\t\\t\\t\\tHis people, and in just punishment of oppressors."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "93",
    "NoteID": "1474",
    "Body": "After many wanderings the Israelites were settled in the\\n\\t\\t\\t\\tland of Canaan, described as \"a land flowing with milk\\n\\t\\t\\t\\tand honey\" (Exod. iii. 8). They had a prosperous land;\\n\\t\\t\\t\\tand they were supplied with spiritual sustenance by men\\n\\t\\t\\t\\tsent to deliver Allah's Message. They should have known\\n\\t\\t\\t\\tbetter than to fall into disputes and schisms, but they\\n\\t\\t\\t\\tdid so. This was all the more inexcusable considering\\n\\t\\t\\t\\twhat bounties they had received from Allah. The schisms\\n\\t\\t\\t\\tarose from selfish arrogance, and Allah will judge\\n\\t\\t\\t\\tbetween them on the Day of Judgment."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "94",
    "NoteID": "1475",
    "Body": "Allah's Truth is all one, and even in different forms men\\n\\t\\t\\t\\tsincere in Religion recognise the oneness. So sincere\\n\\t\\t\\t\\tJews like 'Abdullah ibn Salam, and sincere Christians\\n\\t\\t\\t\\tlike Waraqa or the Nestorian monk Bahira, were ready to\\n\\t\\t\\t\\trecognise the mission of Muhammad Al-Mustafa. \"The Book\"\\n\\t\\t\\t\\tin this connection is Revelation generally, including\\n\\t\\t\\t\\tpre-Islamic revelations."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "94",
    "NoteID": "1476",
    "Body": "Cf. iii. 60 and n. 399."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "96",
    "NoteID": "1477",
    "Body": "Allah has given frequent warnings against Evil and want\\n\\t\\t\\t\\tof Faith in all ages, through Signs and through\\n\\t\\t\\t\\tinspiration,-the latter (\"the Word\") being even more\\n\\t\\t\\t\\tdirect and personal than the former. Those who did not\\n\\t\\t\\t\\theed the warning found to their cost that it was true,\\n\\t\\t\\t\\tand they perished. Such contumacy in the rejection of\\n\\t\\t\\t\\tTruth only yields when the actual penalty is in sight.\\n\\t\\t\\t\\tBelief then is induced by irresistible facts: it is not\\n\\t\\t\\t\\tefficacious as Faith, as was proved against Pharaoh, See\\n\\t\\t\\t\\tx. 90 and n. 1473."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "98",
    "NoteID": "1478",
    "Body": "Allah in His infinite Mercy points out the contumacy of\\n\\t\\t\\t\\tSin as a warning, and the exceptional case of Nineveth\\n\\t\\t\\t\\tand its Prophet Jonah is alluded to. The story of Jonah\\n\\t\\t\\t\\tis told in xxxvii. 139-148, which would be an appropriate\\n\\t\\t\\t\\tplace for further comments. Here it is sufficient to note\\n\\t\\t\\t\\tthat Nineveth was a very ancient town which is now no\\n\\t\\t\\t\\tlonger on the map. Its site is believed to be marked by\\n\\t\\t\\t\\tthe two mounds on the left bank of the Tigris, opposite\\n\\t\\t\\t\\tthe flourishing city of Mosul on the right bank, about\\n\\t\\t\\t\\t230 miles north-north-west of Bagdad. One of the mounds\\n\\t\\t\\t\\tbears the name of \"the Tomb of Nabi Yunus.\" Archeologists\\n\\t\\t\\t\\thave not yet fully explored its antiquities. But it is\\n\\t\\t\\t\\tclear that it was a very old Sumerian town, perhaps older\\n\\t\\t\\t\\tthan 3500 B.C. It became the capital of Assyria. The\\n\\t\\t\\t\\tfirst Assyrian Empire under Shalmaneser I, about 1300\\n\\t\\t\\t\\tB.C., became the supreme power in Western Asia. Babylon,\\n\\t\\t\\t\\twhose tributary Assyria had formerly been, now became\\n\\t\\t\\t\\ttributary to Assyria. The second Assyrian Empire arose\\n\\t\\t\\t\\tabout 745 B.C., and Sennacherib (705-681 B.C.) beautified\\n\\t\\t\\t\\tthe town with many Public Works. It was destroyed by the\\n\\t\\t\\t\\tScythians (so-called Medes) in 612 B.C. If the date of\\n\\t\\t\\t\\tJonah were assumed to be about 800 B.C., it would be\\n\\t\\t\\t\\tbetween the First and the Second Assyrian Empire; when\\n\\t\\t\\t\\tthe City was nearly destroyed for its sins, but on\\n\\t\\t\\t\\taccount of its repentance was given a new lease of\\n\\t\\t\\t\\tglorious life in the Second Empire."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "98",
    "NoteID": "1479",
    "Body": "The point of the allusion here may be thus explained.\\n\\t\\t\\t\\tNineveh was a great and glorious City. But it became,\\n\\t\\t\\t\\tlike Babylon, a city of sin. Allah sent the prophet Yunus\\n\\t\\t\\t\\t(Jonah) to warn it. Full of iniquities though it was, it\\n\\t\\t\\t\\tlistened to the warning, perhaps in the person of a few\\n\\t\\t\\t\\tjust men. For their sakes, the All-Merciful Allah spared\\n\\t\\t\\t\\tit, and gave it a new lease of glorious life. According\\n\\t\\t\\t\\tto the chronology in the last note the new lease would be\\n\\t\\t\\t\\tfor about two centuries, after which it perished\\n\\t\\t\\t\\tcompletely for its sins and abominations. Note that its\\n\\t\\t\\t\\tnew lease of life was for its collective life as a City,\\n\\t\\t\\t\\tthe life of the Present, i.e., of this World. It does not\\n\\t\\t\\t\\tmean that individual sinners escaped the spiritual\\n\\t\\t\\t\\tconsequences of their sin, unless they individually\\n\\t\\t\\t\\trepented and obtained Allah's mercy and forgiveness."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "99",
    "NoteID": "1480",
    "Body": "If it had been Allah's Plan or Will not to grant the\\n\\t\\t\\t\\tlimited Free-will that He has granted to man, His\\n\\t\\t\\t\\tomnipotence could have made all mankind alike: all would\\n\\t\\t\\t\\tthen have had Faith, but that Faith would have reflected\\n\\t\\t\\t\\tno merit on them. In the actual world as it is, man has\\n\\t\\t\\t\\tbeen endowed with various faculties and capacities, so\\n\\t\\t\\t\\tthat he should strive and explore, and bring himself into\\n\\t\\t\\t\\tharmony with Allah's Will. Hence Faith becomes a moral\\n\\t\\t\\t\\tachievement, and to resist Faith becomes a sin. As a\\n\\t\\t\\t\\tcomplementary proposition, men of Faith must not be\\n\\t\\t\\t\\timpatient or angry if they have to contend against\\n\\t\\t\\t\\tUnfaith, and most important of all, they must guard\\n\\t\\t\\t\\tagainst the temptation of forcing Faith, i.e., imposing\\n\\t\\t\\t\\tit on others by physical compulsion. Forced faith is no\\n\\t\\t\\t\\tfaith. They should strive."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "100",
    "NoteID": "1481",
    "Body": "To creatures endued with Will, Faith comes out of an\\n\\t\\t\\t\\tactive use of that Will. But we must not be so arrogant\\n\\t\\t\\t\\tas to suppose that that is enough. At best man is weak,\\n\\t\\t\\t\\tand is in need of Allah's grace and help. If we sincerely\\n\\t\\t\\t\\twish to understand, He will help our Faith; but if not,\\n\\t\\t\\t\\tour doubts and difficulties will only be increased. This\\n\\t\\t\\t\\tfollows as a necessary consequence, and in Quranic\\n\\t\\t\\t\\tlanguage all consequences are ascribed to Allah."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "100",
    "NoteID": "1482",
    "Body": "Rijs (from rajisa, yarjasu, or rajusa, yarjusu) has\\n\\t\\t\\t\\tvarious meanings: e.g., (1) filth, impurity, uncleanness,\\n\\t\\t\\t\\tabomination, as in ix. 95; (2) hence, filthy deeds, foul\\n\\t\\t\\t\\tconduct, crime, abomination, thus shading off into (1),\\n\\t\\t\\t\\tas in v. 90; (3) hence punishment for crime, penalty, as\\n\\t\\t\\t\\tin vi. 125; (4) a form of such punishment, viz., doubt,\\n\\t\\t\\t\\tobscurity, or unsettlement of mind, anger, indignation,\\n\\t\\t\\t\\tas in ix. 125, and here, but perhaps the idea of\\n\\t\\t\\t\\tpunishment is also implied here."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "101",
    "NoteID": "1483",
    "Body": "If Faith results from an active exertion of our spiritual\\n\\t\\t\\t\\tfaculties or understanding, it follows that if we let\\n\\t\\t\\t\\tthese die, Allah's Signs in His Creation or in the spoken\\n\\t\\t\\t\\tWord which comes by inspiration through the mouths of His\\n\\t\\t\\t\\tMessengers will not reach us any more than music reaches\\n\\t\\t\\t\\ta deaf man."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "102",
    "NoteID": "1484",
    "Body": "Cf. x. 20 and n. 1408. The argument about Allah's\\n\\t\\t\\t\\trevelation of Himself to man was begun in those early\\n\\t\\t\\t\\tsections of this Sura and is being now rounded off\\n\\t\\t\\t\\ttowards the end of this Sura with the same formula."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "104",
    "NoteID": "1485",
    "Body": "Other people may hesitate, or doubt, or wonder. But the\\n\\t\\t\\t\\trighteous man has no doubt in his own mind, and he\\n\\t\\t\\t\\tdeclares his Faith clearly and unambiguously to all, as\\n\\t\\t\\t\\tdid Al-Mustafa."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "104",
    "NoteID": "1486",
    "Body": "The worship of the One and True God is not a fancy\\n\\t\\t\\t\\tworship, to be arrived at merely by reasoning and\\n\\t\\t\\t\\tphilosophy. It touches the vital issues of life and\\n\\t\\t\\t\\tdeath-which are in His hands and His alone."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "104",
    "NoteID": "1487",
    "Body": "Nor is the worship of One God an invention of the\\n\\t\\t\\t\\tProphet. It comes as a direct command through him and to\\n\\t\\t\\t\\tall."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "104",
    "NoteID": "1488",
    "Body": "Individual Faith is good, but it is completed and\\n\\t\\t\\t\\tstrengthened by joining or forming a Righteous Society,\\n\\t\\t\\t\\tin which the individual can develop and expand. Islam was\\n\\t\\t\\t\\tnever a religion of monks and anchorites. It laid great\\n\\t\\t\\t\\tstress on social duties, which in many ways test and\\n\\t\\t\\t\\ttrain the individual's character."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "107",
    "NoteID": "1489",
    "Body": "Allah is Oft-Forgiving, Most Merciful. Even when we\\n\\t\\t\\t\\tsuffer under trials and tribulations, it is for our good,\\n\\t\\t\\t\\tand no one can remove them except He, when, in His Plan,\\n\\t\\t\\t\\tHe sees it to be best for all concerned. On the other\\n\\t\\t\\t\\thand, there is no power that can intercept His blessings\\n\\t\\t\\t\\tand favours, and His bounty flows freely when we are\\n\\t\\t\\t\\tworthy, and often when we are not worthy of it."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "108",
    "NoteID": "1490",
    "Body": "The Furqan, the Criterion between right and wrong, has\\n\\t\\t\\t\\tbeen sent to us from Allah. If we accept guidance, it is\\n\\t\\t\\t\\tnot as if we confer favours on those who bring us\\n\\t\\t\\t\\tguidance. They suffer unselfishly for us, in order that\\n\\t\\t\\t\\twe may be guided for our own good. On the other hand, if\\n\\t\\t\\t\\twe reject it, it is our own loss. We have a certain\\n\\t\\t\\t\\tamount of free-will, and the responsibility is ours and\\n\\t\\t\\t\\tcannot be shifted to the Prophets sent by Allah."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "109",
    "NoteID": "1491",
    "Body": "When, in spite of all the efforts of the Prophets of\\n\\t\\t\\t\\tAllah, people do not accept Truth, and evil seems to\\n\\t\\t\\t\\tflourish for a time, we must wait and be patient, but at\\n\\t\\t\\t\\tthe same time we must not give up hope or persevering\\n\\t\\t\\t\\teffort. For thus only can we carry out our part in the\\n\\t\\t\\t\\tPlan of Allah."
  }
]
