[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "47",
        "bookName": "Book of Knowledge",
        "bookNameArabic": "كتاب العلم",
        "hadiths": [
            {
                "hadithNo": "6775",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Aishah said: \"The Messenger of Allah (s.a.w) recited: 'It is He Who has sent down to you the Book (this Qur'an). In it are Verses that are entirely clear, they are the foundations of the Book; and others not entirely clear. So as for those in whose hearts there is a deviation (from the truth) they follow that which is not entirely clear thereof, seeking Al-Fitnah, and seeking for its hidden meanings, but none knows its hidden meanings save Allah. And those who are firmly grounded in knowledge say: We believe in it; the whole of it (clear and unclear Verses) are from our Lord. And none receive admonition except men of understanding.\" The Messenger of Allah (s.a.w) said: 'If you see those who follow that which is not entirely clear in it, those are the ones whom Allah mentioned, so beware of them.\"'",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ ، حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ التُّسْتَرِيُّ ، عَنْ عَبْدِ اللهِ بْنِ أَبِي مُلَيْكَةَ ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ ، عَنْ عَائِشَةَ ، قَالَتْ : تَلاَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : {هُوَ الَّذِي أَنْزَلَ عَلَيْكَ الْكِتَابَ مِنْهُ آيَاتٌ مُحْكَمَاتٌ هُنَّ أُمُّ الْكِتَابِ وَأُخَرُ مُتَشَابِهَاتٌ ، فَأَمَّا الَّذِينَ فِي قُلُوبِهِمْ زَيْغٌ فَيَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ ابْتِغَاءَ الْفِتْنَةِ وَابْتِغَاءَ تَأْوِيلِهِ ، وَمَا يَعْلَمُ تَأْوِيلَهُ إِلاَّ اللَّهُ ، وَالرَّاسِخُونَ فِي الْعِلْمِ يَقُولُونَ آمَنَّا بِهِ كُلٌّ مِنْ عِنْدِ رَبِّنَا ، وَمَا يَذَّكَّرُ إِلاَّ أُولُو الأَلْبَابِ} قَالَتْ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِذَا رَأَيْتُمُ الَّذِينَ يَتَّبِعُونَ مَا تَشَابَهَ مِنْهُ ، فَأُولَئِكَ الَّذِينَ سَمَّى اللَّهُ فَاحْذَرُوهُمْ."
            },
            {
                "hadithNo": "6776",
                "chapterNo": "1",
                "hadithEnglish": "Abu 'Imran Al-Jawni said: 'Abdullah bin Rabah Al-Ansari wrote to me (saying) that 'Abdullah bin 'Amr said: \"I went to the Messenger of Allah (s.a.w) one day, and he heard the voices of two men arguing about a Verse (of the Qur'an). The Messenger of Allah (s.a.w) came out to them, and signs of anger could be seen on his face. He said: 'Those who came before you were only doomed because they argued about the Book.'\"",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ ، قَالَ : كَتَبَ إِلَيَّ عَبْدُ اللهِ بْنُ رَبَاحٍ الأَنْصَارِيُّ أَنَّ عَبْدَ اللهِ بْنَ عَمْرٍو ، قَالَ: هَجَّرْتُ إِلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا ، قَالَ: فَسَمِعَ أَصْوَاتَ رَجُلَيْنِ اخْتَلَفَا فِي آيَةٍ ، فَخَرَجَ عَلَيْنَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، يُعْرَفُ فِي وَجْهِهِ الْغَضَبُ ، فَقَالَ: إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِاخْتِلاَفِهِمْ فِي الْكِتَابِ."
            },
            {
                "hadithNo": "6777",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Jundab bin 'Abdullah Al-Bajali said: \"The Messenger of Allah (s.a.w) said: 'Read Qur'an (together) so long as your hearts are united, then when you begin to argue (about the meaning), then stop and disperse.\"'",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا أَبُو قُدَامَةَ الْحَارِثُ بْنُ عُبَيْدٍ ، عَنْ أَبِي عِمْرَانَ ، عَنْ جُنْدَبِ بْنِ عَبْدِ اللهِ الْبَجَلِيِّ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اقْرَؤُوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ ، فَإِذَا اخْتَلَفْتُمْ فِيهِ فَقُومُوا."
            },
            {
                "hadithNo": "6778",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Jundab, meaning, bin 'Abdullah, that the Messenger of Allah (s.a.w) said: \"Read Qur'an (together) so long as your hearts are united, then when you begin to argue (about the meaning), then stop and disperse.\"",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ ، أَخْبَرَنَا عَبْدُ الصَّمَدِ ، حَدَّثَنَا هَمَّامٌ ، حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ ، عَنْ جُنْدَبٍ ، يَعْنِي ابْنَ عَبْدِ اللهِ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: اقْرَؤُوا الْقُرْآنَ مَا ائْتَلَفَتْ عَلَيْهِ قُلُوبُكُمْ ، فَإِذَا اخْتَلَفْتُمْ فَقُومُوا."
            },
            {
                "hadithNo": "6779",
                "chapterNo": "1",
                "hadithEnglish": "Abu 'Imran said: Jundab said to us - while we were young men in Al-Kufah - \"The Messenger of Allah (s.a.w) said: 'Read Qur'an ...'\" a similar Hadith (as no. 6778).",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ ، حَدَّثَنَا حَبَّانُ ، حَدَّثَنَا أَبَانُ ، حَدَّثَنَا أَبُو عِمْرَانَ ، قَالَ: قَالَ لَنَا جُنْدَبٌ وَنَحْنُ غِلْمَانٌ بِالْكُوفَةِ ، قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : اقْرَؤُوا الْقُرْآنَ بِمِثْلِ حَدِيثِهِمَا."
            },
            {
                "hadithNo": "6780",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Aishah said: \"The Messenger of Allah (s.a.w) said: 'The most hated of men to Allah is the one who is argumentative and is harsh in arguing.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا وَكِيعٌ ، عَنِ ابْنِ جُرَيْجٍ ، عَنِ ابْنِ أَبِي مُلَيْكَةَ ، عَنْ عَائِشَةَ ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أَبْغَضَ الرِّجَالِ إِلَى اللهِ الأَلَدُّ الْخَصِمُ."
            },
            {
                "hadithNo": "6781",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Sa'eed Al-Khudri said: \"The Messenger of Allah (s.a.w) said: 'You will certainly follow the ways (and halaits) of those who came before you, handspan by handspan, cubit by cubit, until even if they entered a lizard's hole, you would follow them.' We said: 'O Messenger of Allah, the Jews and the Christians?' He said: 'Who else?\"'",
                "hadithArabic": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ ، حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ ، عَنْ عَطَاءِ بْنِ يَسَارٍ ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لَتَتَّبِعُنَّ سَنَنَ الَّذِينَ مِنْ قَبْلِكُمْ ، شِبْرًا بِشِبْرٍ وَذِرَاعًا بِذِرَاعٍ ، حَتَّى لَوْ دَخَلُوا فِي جُحْرِ ضَبٍّ لاَتَّبَعْتُمُوهُمْ قُلْنَا: يَا رَسُولَ اللهِ ، آلْيَهُودَ وَالنَّصَارَى ؟ قَالَ: فَمَنْ ؟."
            },
            {
                "hadithNo": "6782",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as Hadith no. 6781) was narrated from Zaid bin Aslam with this chain of narrators.",
                "hadithArabic": "وَحَدَّثَنَا عِدَّةٌ مِنْ أَصْحَابِنَا ، عَنْ سَعِيدِ بْنِ أَبِي مَرْيَمَ ، أَخْبَرَنَا أَبُو غَسَّانَ وَهُوَ مُحَمَّدُ بْنُ مُطَرِّفٍ ، عَنْ زَيْدِ بْنِ أَسْلَمَ ، بِهَذَا الإِسْنَادِ ، نَحْوَهُ."
            },
            {
                "hadithNo": "6783",
                "chapterNo": "3",
                "hadithEnglish": "Zaid bin Aslam narrated from 'Ata' bin Yasar, and he mentioned a similar Hadith (as no. 6781).",
                "hadithArabic": "قَالَ أَبُو إِسْحَاقَ إِبْرَاهِيمُ بْنُ مُحَمَّدٍ: حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا أَبُو غَسَّانَ، حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، وَذَكَرَ الْحَدِيثَ نَحْوَهُ."
            },
            {
                "hadithNo": "6784",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Abdullah said: \"The Messenger of Allah (s.a.w) said: 'Those who go to extremes are doomed.\"' He said it three times.",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ ، وَيَحْيَى بْنُ سَعِيدٍ ، عَنِ ابْنِ جُرَيْجٍ ، عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ ، عَنْ طَلْقِ بْنِ حَبِيبٍ ، عَنِ الأَحْنَفِ بْنِ قَيْسٍ ، عَنْ عَبْدِ اللهِ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: هَلَكَ الْمُتَنَطِّعُونَ قَالَهَا ثَلاَثًا."
            },
            {
                "hadithNo": "6785",
                "chapterNo": "5",
                "hadithEnglish": "Anas bin Malik said: \"The Messenger of Allah (s.a.w) said: 'Among the portents of the Hour is that knowledge will be taken away, ignorance will prevail, wine will be drunk, and Zina will become widespread.\"'",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ ، حَدَّثَنَا عَبْدُ الْوَارِثِ ، حَدَّثَنَا أَبُو التَّيَّاحِ ، حَدَّثَنِى أَنَسُ بْنُ مَالِكٍ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ ، وَيَثْبُتَ الْجَهْلُ ، وَيُشْرَبَ الْخَمْرُ ، وَيَظْهَرَ الزِّنَا."
            },
            {
                "hadithNo": "6786",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Anas bin Malik said: \"Shall I not tell you a Hadith that I heard from the Messenger of Allah (s.a.w) which no one who heard it will narrate to you after me?  '(He (s.a.w) said :) Among the portents of the Hour is that knowledge will be taken away and ignorance will prevail, Zina will become widespread and wine will be drunk. Men will leave (will be less in numbers) and women will be left, until there will be one man to look after fifty women.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، وَابْنُ بَشَّارٍ ، قَالاَ : حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، سَمِعْتَ قَتَادَةَ ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ: أَلاَ أُحَدِّثُكُمْ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لاَ يُحَدِّثُكُمْ أَحَدٌ بَعْدِي سَمِعَهُ مِنْهُ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ ، وَيَظْهَرَ الْجَهْلُ ، وَيَفْشُوَ الزِّنَا ، وَيُشْرَبَ الْخَمْرُ ، وَيَذْهَبَ الرِّجَالُ ، وَتَبْقَى النِّسَاءُ حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً قَيِّمٌ وَاحِدٌ."
            },
            {
                "hadithNo": "6787",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Anas bin Malik from the Prophet (s.a.w) (a Hadith similar to no. 6786). In the Hadith of Abu Bishr and 'Abdah it says: No one will narrate to you after me; \"I heard the Messenger of Allah (s.a.w) say ...\" and he mentioned a similar report.",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ (ح) وَحَدَّثَنَا أَبُو كُرَيْبٍ ، حَدَّثَنَا عَبْدَةُ وَأَبُو أُسَامَةَ ، كُلُّهُمْ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ ، عَنْ قَتَادَةَ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. وَفِي حَدِيثِ ابْنِ بِشْرٍ وَعَبْدَةَ : لاَ يُحَدِّثُكُمُوهُ أَحَدٌ بَعْدِي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَ ، بِمِثْلِهِ."
            },
            {
                "hadithNo": "6788",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Wa'il said: I was sitting with 'Abdullah and Abu Musa, and they said: The Messenger of Allah (s.a.w) said: \"Before the Hour comes there will be days during which knowledge will be taken away, and ignorance will appear, and there will be a lot of Harj, and Harj means killing.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ ، حَدَّثَنَا وَكِيعٌ ، وَأَبِي ، قَالاَ : حَدَّثَنَا الأَعْمَشُ (ح) وحَدَّثَنِي أَبُو سَعِيدٍ الأَشَجُّ ، وَاللَّفْظُ لَهُ ، حَدَّثَنَا وَكِيعٌ ، حَدَّثَنَا الأَعْمَشُ ، عَنْ أَبِي وَائِلٍ ، قَالَ : كُنْتُ جَالِسًا مَعَ عَبْدِ اللهِ وَأَبِي مُوسَى فَقَالاَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِنَّ بَيْنَ يَدَيِ السَّاعَةِ أَيَّامًا يُرْفَعُ فِيهَا الْعِلْمُ ، وَيَنْزِلُ فِيهَا الْجَهْلُ ، وَيَكْثُرُ فِيهَا الْهَرْجُ وَالْهَرْجُ الْقَتْلُ."
            },
            {
                "hadithNo": "6789",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Shaqiq said: \"I was sitting with 'Abdullah and Abu Musa, and they were talking to one another. They said: 'The Messenger of Allah (s.a.w) said:\"' A Hadith like that of Waki' and Ibn Numair (no. 6788).",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ ، حَدَّثَنَا أَبُو النَّضْرِ ، حَدَّثَنَا عُبَيْدُ اللهِ الأَشْجَعِيُّ ، عَنْ سُفْيَانَ ، عَنِ الأَعْمَشِ ، عَنْ أَبِي وَائِلٍ ، عَنْ عَبْدِ اللهِ وَأَبِي مُوسَى الأَشْعَرِيِّ ، قَالاَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (ح) وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا ، حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ ، عَنْ زَائِدَةَ ، عَنْ سُلَيْمَانَ ، عَنْ شَقِيقٍ قَالَ : كُنْتُ جَالِسًا مَعَ عَبْدِ اللهِ وَأَبِي مُوسَى ، وَهُمَا يَتَحَدَّثَانِ ، فَقَالاَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ... بِمِثْلِ حَدِيثِ وَكِيعٍ وَابْنِ نُمَيْرٍ."
            },
            {
                "hadithNo": "6790",
                "chapterNo": "5",
                "hadithEnglish": "A similar report (as Hadith no. 6788) was narrated from Abu Musa, from the Prophet (s.a.w).",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَأَبُو كُرَيْبٍ ، وَابْنُ نُمَيْرٍ ، وَإِسْحَاقُ الْحَنْظَلِيُّ ، جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ ، عَنِ الأَعْمَشِ ، عَنْ شَقِيقٍ ، عَنْ أَبِي مُوسَى ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، بِمِثْلِهِ."
            },
            {
                "hadithNo": "6791",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Wa'il said: \"I was sitting with 'Abdullah and Abu Musa, and they were talking to one another, and Abu Musa said: 'The Messenger of Allah (s.a.w) said:\"' a similar report (as Hadith no. 6789).",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا جَرِيرٌ ، عَنِ الأَعْمَشِ ، عَنْ أَبِي وَائِلٍ ، قَالَ: إِنِّي لَجَالِسٌ مَعَ عَبْدِ اللهِ وَأَبِي مُوسَى وَهُمَا يَتَحَدَّثَانِ ، فَقَالَ أَبُو مُوسَى: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: بِمِثْلِهِ."
            },
            {
                "hadithNo": "6792",
                "chapterNo": "5",
                "hadithEnglish": "Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Time will pass quickly, and knowledge will be taken away, and tribulations will appear, and miserliness will be put (in people's hearts), and there will be a lot of Harj.' They said: 'What is Harj?' He said: 'Killing.\"'",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى ، أَخْبَرَنَا ابْنُ وَهْبٍ ، أَخْبَرَنِي يُونُسُ ، عَنِ ابْنِ شِهَابٍ ، حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ ، أَنَّ أَبَا هُرَيْرَةَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : يَتَقَارَبُ الزَّمَانُ ، وَيُقْبَضُ الْعِلْمُ ، وَتَظْهَرُ الْفِتَنُ ، وَيُلْقَى الشُّحُّ ، وَيَكْثُرُ الْهَرْجُ قَالُوا: وَمَا الْهَرْجُ؟ قَالَ: الْقَتْلُ."
            },
            {
                "hadithNo": "6793",
                "chapterNo": "5",
                "hadithEnglish": "Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Time will pass quickly and knowledge will be taken away.'\" Then he mentioned a similar Hadith (as no. 6792).",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ ، أَخْبَرَنَا أَبُو الْيَمَانِ ، أَخْبَرَنَا شُعَيْبٌ ، عَنِ الزُّهْرِيِّ ، حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الزُّهْرِيُّ ، أَنَّ أَبَا هُرَيْرَةَ قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : يَتَقَارَبُ الزَّمَانُ ، وَيُقْبَضُ الْعِلْمُ ... ، ثُمَّ ذَكَرَ مِثْلَهُ."
            },
            {
                "hadithNo": "6794",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Time will pass quickly and knowledge will be taken away.\" Then he mentioned a similar Hadith (as no. 6792).",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَبْدُ الأَعْلَى ، عَنْ مَعْمَرٍ ، عَنِ الزُّهْرِيِّ ، عَنْ سَعِيدٍ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: يَتَقَارَبُ الزَّمَانُ ، وَيَنْقُصُ الْعِلْمُ ... ، ثُمَّ ذَكَرَ مِثْلَ حَدِيثِهِمَا."
            },
            {
                "hadithNo": "6795",
                "chapterNo": "5",
                "hadithEnglish": "A Hadith like that of Az-Zuhri from Humaid from Abu Hurairah was narrated from the Prophet (s.a.w) ' but they (the sub narrators) did not mention (the words) \"miserliness will be put (in people's hearts)\".",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ ، قَالُوا : حَدَّثَنَا إِسْمَاعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ ، عَنِ الْعَلاَءِ ، عَنْ أَبِيهِ ، عَنْ أَبِي هُرَيْرَةَ (ح) وَحَدَّثَنَا ابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ وَعَمْرٌو النَّاقِدُ ، قَالُوا : حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ ، عَنْ حَنْظَلَةَ ، عَنْ سَالِمٍ ، عَنْ أَبِي هُرَيْرَةَ (ح)وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، حَدَّثَنَا مَعْمَرٌ ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ ، عَنْ أَبِي هُرَيْرَةَ (ح) وحَدَّثَنِي أَبُو الطَّاهِرِ ، أَخْبَرَنَا ابْنُ وَهْبٍ ، عَنْ عَمْرِو بْنِ الْحَارِثِ ، عَنْ أَبِي يُونُسَ ، عَنْ أَبِي هُرَيْرَةَ ، كُلُّهُمْ قَالَ : عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ... بِمِثْلِ حَدِيثِ الزُّهْرِيِّ ، عَنْ حُمَيْدٍ ، عَنْ أَبِي هُرَيْرَةَ ، غَيْرَ أَنَّهُمْ لَمْ يَذْكُرُوا وَيُلْقَى الشُّحُّ."
            },
            {
                "hadithNo": "6796",
                "chapterNo": "5",
                "hadithEnglish": "'Abdullah bin 'Amr bin Al-'As said: \"I heard the Messenger of Allah (s.a.w) say: 'Allah will not take away knowledge by snatching it away from the people. Rather, He will take away knowledge by taking away the scholars until, when there is no scholar left, people will turn to ignorant leaders who will be asked questions and will issue Fatawa (rulings) without knowledge. They will go astray and lead others astray.\"'",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا جَرِيرٌ ، عَنْ هِشَامِ بْنِ عُرْوَةَ ، عَنْ أَبِيهِ ، سَمِعْتَ عَبْدَ اللهِ بْنَ عَمْرِو بْنِ الْعَاصِ ، يَقُولُ : سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، يَقُولُ : إِنَّ اللَّهَ لاَ يَقْبِضُ الْعِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنَ النَّاسِ ، وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ ، حَتَّى إِذَا لَمْ يَتْرُكْ عَالِمًا ، اتَّخَذَ النَّاسُ رُؤُوسًا جُهَّالاً ، فَسُئِلُوا فَأَفْتَوْا بِغَيْرِ عِلْمٍ ، فَضَلُّوا وَأَضَلُّوا."
            },
            {
                "hadithNo": "6797",
                "chapterNo": "5",
                "hadithEnglish": "A Hadith like that of Jarir (no. 6796) was narrated from 'Abdullah bin 'Amr from the Prophet (s.a.w). In the Hadith of 'Umar bin 'Ali it adds: \"Then I met 'Abdullah bin 'Amr at the beginning of the year, and I asked him, and he repeated the Hadith as he had narrated it. He said: 'I heard the Messenger of Allah (s.a.w) say...\"",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ ، حَدَّثَنَا حَمَّادٌ ، يَعْنِي ابْنَ زَيْدٍ (ح) وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا عَبَّادُ بْنُ عَبَّادٍ وَأَبُو مُعَاوِيَةَ (ح) وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ ، قَالاَ : حَدَّثَنَا وَكِيعٌ (ح) وَحَدَّثَنَا أَبُو كُرَيْبٍ ، حَدَّثَنَا ابْنُ إِدْرِيسَ وَأَبُو أُسَامَةَ وَابْنُ نُمَيْرٍ وَعَبْدَةُ (ح) وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ ، حَدَّثَنَا سُفْيَانُ (ح) وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ (ح) وحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ ، قَالَ : حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ (ح) وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ : أَخْبَرَنَا شُعْبَةُ بْنُ الْحَجَّاجِ ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ ، عَنْ أَبِيهِ ، عَنْ عَبْدِ اللهِ بْنِ عَمْرٍو ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ... بِمِثْلِ حَدِيثِ جَرِيرٍ. وَزَادَ فِي حَدِيثِ عُمَرَ بْنِ عَلِيٍّ ، ثُمَّ لَقِيتُ عَبْدَ اللهِ بْنَ عَمْرٍو عَلَى رَأْسِ الْحَوْلِ ، فَسَأَلْتُهُ فَرَدَّ عَلَيْنَا الْحَدِيثَ كَمَا حَدَّثَ ، قَالَ : سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ."
            },
            {
                "hadithNo": "6798",
                "chapterNo": "5",
                "hadithEnglish": "A Hadith like that of Hisham bin 'Urwah (no. 6797) was narrated from 'Abdullah bin 'Amr from the Prophet (s.a.w).",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، حَدَّثَنَا عَبْدُ اللهِ بْنُ حُمْرَانَ ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ ، أَخْبَرَنِي أَبِي جَعْفَرٌ ، عَنْ عُمَرَ بْنِ الْحَكَمِ ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ... بِمِثْلِ حَدِيثِ هِشَامِ بْنِ عُرْوَةَ."
            },
            {
                "hadithNo": "6799",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that 'Urwah bin Az-Zubair said: \"Aishah said to me: 'O son of my sister, I have heard that 'Abdullah bin 'Amr will pass by us en route to Hajj. Go to him and ask him, for he acquired a great deal of knowledge from the Prophet (s.a.w).\"' He said: \"I met him, and asked him about things that he remembered about the Messenger of Allah (s.a.w).\" 'Urwah said: \"Among the things that he mentioned was that the Prophet (s.a.w) said: 'Allah will not snatch knowledge away from the people. Rather He will take away the scholars, and knowledge will be taken away with them, and there will be left among the people ignorant leaders who will issue Fatawa to them without _knowledge; they will go astray and lead others astray.\"' 'Urwah said: \"When I narrated that to 'Aishah, she could not believe it and found it strange. She said: 'Did he tell you that he heard the Prophet (s.a.w) say that?\"' \r\n'Urwah said: \"The following year, she said to me: 'Ibn 'Amr has come; go and meet him and talk to him until you ask him about the Hadith that he told you concerning knowledge.'\" He said: \"So I met him and asked him, and he told it to me as he had told me the first time.\" 'Urwah said: \"When I told her that, she said: 'I do not think but he has told the truth. I think that he has neither added anything nor taken anything away.'\"",
                "hadithArabic": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ ، حَدَّثَنِي أَبُو شُرَيْحٍ ، أَنَّ أَبَا الأَسْوَدِ ، حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ ، قَالَ : قَالَتْ لِي عَائِشَةُ : يَا ابْنَ أُخْتِي بَلَغَنِي أَنَّ عَبْدَ اللهِ بْنَ عَمْرٍو ، مَارٌّ بِنَا إِلَى الْحَجِّ ، فَالْقَهُ فَسَائِلْهُ ، فَإِنَّهُ قَدْ حَمَلَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِلْمًا كَثِيرًا ، قَالَ : فَلَقِيتُهُ فَسَاءَلْتُهُ عَنْ أَشْيَاءَ يَذْكُرُهَا عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. قَالَ عُرْوَةُ : فَكَانَ فِيمَا ذَكَرَ ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : إِنَّ اللَّهَ لاَ يَنْتَزِعُ الْعِلْمَ مِنَ النَّاسِ انْتِزَاعًا ، وَلَكِنْ يَقْبِضُ الْعُلَمَاءَ فَيَرْفَعُ الْعِلْمَ مَعَهُمْ ، وَيُبْقِي فِي النَّاسِ رُؤُوسًا جُهَّالاً ، يُفْتُونَهُمْ بِغَيْرِ عِلْمٍ ، فَيَضِلُّونَ وَيُضِلُّونَ.\r\nقَالَ عُرْوَةُ : فَلَمَّا حَدَّثْتُ عَائِشَةَ بِذَلِكَ ، أَعْظَمَتْ ذَلِكَ وَأَنْكَرَتْهُ ، قَالَتْ : أَحَدَّثَكَ أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هَذَا ؟\r\nقَالَ عُرْوَةُ : حَتَّى إِذَا كَانَ قَابِلٌ قَالَتْ لَهُ : إِنَّ ابْنَ عَمْرٍو قَدْ قَدِمَ ، فَالْقَهُ ، ثُمَّ فَاتِحْهُ حَتَّى تَسْأَلَهُ عَنِ الْحَدِيثِ الَّذِي ذَكَرَهُ لَكَ فِي الْعِلْمِ ، قَالَ : فَلَقِيتُهُ فَسَاءَلْتُهُ ، فَذَكَرَهُ لِي نَحْوَ مَا حَدَّثَنِي بِهِ ، فِي مَرَّتِهِ الأُولَى. قَالَ عُرْوَةُ : فَلَمَّا أَخْبَرْتُهَا بِذَلِكَ ، قَالَتْ : مَا أَحْسَبُهُ إِلاَّ قَدْ صَدَقَ ، أَرَاهُ لَمْ يَزِدْ فِيهِ شَيْئًا وَلَمْ يَنْقُصْ."
            },
            {
                "hadithNo": "6800",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Jarir bin 'Abdullah said: \"Some Bedouins came to the Messenger of Allah (s.a.w) wearing woolen garments, and he saw their bad condition and that they were in need, so he urged the people to give in charity, but they were so slow that (his disapproval) could be seen in his face. \"Then an Ansari man brought a purse of silver, then another came, then they came one after another, until signs of happiness could be seen in his face. The Messenger of Allah (s.a.w) said: 'Whoever starts a good practice in Islam that is followed after he is gone, there will be written for him a reward like that of those who do it, without that detracting from their reward in the slightest. Whoever starts a bad practice in Islam that is followed after he is gone, there will be written for him a burden of sin like that of those who do it, without that detracting from their burden in the slightest.\"'",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ ، حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ ، عَنِ الأَعْمَشِ ، عَنْ مُوسَى بْنِ عَبْدِ اللهِ بْنِ يَزِيدَ ، وَأَبِي الضُّحَى ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ الْعَبْسِيِّ ، عَنْ جَرِيرِ بْنِ عَبْدِ اللهِ ، قَالَ : جَاءَ نَاسٌ مِنَ الأَعْرَابِ إِلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِمِ الصُّوفُ فَرَأَى سُوءَ حَالِهِمْ قَدْ أَصَابَتْهُمْ حَاجَةٌ ، فَحَثَّ النَّاسَ عَلَى الصَّدَقَةِ ، فَأَبْطَؤُوا عَنْهُ حَتَّى رُئِيَ ذَلِكَ فِي وَجْهِهِ. قَالَ : ثُمَّ إِنَّ رَجُلاً مِنَ الأَنْصَارِ جَاءَ بِصُرَّةٍ مِنْ وَرِقٍ ، ثُمَّ جَاءَ آخَرُ ، ثُمَّ تَتَابَعُوا حَتَّى عُرِفَ السُّرُورُ فِي وَجْهِهِ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : مَنْ سَنَّ فِي الإِسْلاَمِ سُنَّةً حَسَنَةً ، فَعُمِلَ بِهَا بَعْدَهُ ، كُتِبَ لَهُ مِثْلُ أَجْرِ مَنْ عَمِلَ بِهَا ، وَلاَ يَنْقُصُ مِنْ أُجُورِهِمْ شَيْءٌ ، وَمَنْ سَنَّ فِي الإِسْلاَمِ سُنَّةً سَيِّئَةً ، فَعُمِلَ بِهَا بَعْدَهُ ، كُتِبَ عَلَيْهِ مِثْلُ وِزْرِ مَنْ عَمِلَ بِهَا ، وَلاَ يَنْقُصُ مِنْ أَوْزَارِهِمْ شَيْءٌ."
            },
            {
                "hadithNo": "6801",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Jarir said: \"The Messenger of Allah (s.a.w) delivered a Khutbah and urged people to give charity\" – a Hadith like that of Jarir (no. 6800).",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَأَبُو كُرَيْبٍ جَمِيعًا ، عَنْ أَبِي مُعَاوِيَةَ ، عَنِ الأَعْمَشِ ، عَنْ مُسْلِمٍ ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ ، عَنْ جَرِيرٍ ، قَالَ : خَطَبَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَحَثَّ عَلَى الصَّدَقَةِ ، بِمَعْنَى حَدِيثِ جَرِيرٍ."
            },
            {
                "hadithNo": "6802",
                "chapterNo": "6",
                "hadithEnglish": "Jarir bin 'Abdullah said: \"The Messenger of Allah (s.a.w) said: 'No one starts a good practice that is followed after he is gone...\"' then he mentioned the Hadith in full (as no. 6800).",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ ، حَدَّثَنَا يَحْيَى ، يَعْنِي ابْنَ سَعِيدٍ ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي إِسْمَاعِيلَ ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ هِلاَلٍ الْعَبْسِيُّ ، قَالَ: قَالَ جَرِيرُ بْنُ عَبْدِ اللهِ ، قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : لاَ يَسُنُّ عَبْدٌ سُنَّةً صَالِحَةً يُعْمَلُ بِهَا بَعْدَهُ ...، ثُمَّ ذَكَرَ تَمَامَ الْحَدِيثِ."
            },
            {
                "hadithNo": "6803",
                "chapterNo": "6",
                "hadithEnglish": "This Hadith was narrated from Al-Mundhir bin Jarir, from his father, from the Prophet (s.a.w) (a narration similar to no. 6800).",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ ، وَأَبُو كَامِلٍ ، وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الأُمَوِيُّ ، قَالُوا : حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ ، عَنِ الْمُنْذِرِ بْنِ جَرِيرٍ ، عَنْ أَبِيهِ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (ح) وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ (ح) وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا أَبُو أُسَامَةَ (ح) وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ ، حَدَّثَنَا أَبِي ، قَالُوا : حَدَّثَنَا شُعْبَةُ ، عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ ، عَنِ الْمُنْذِرِ بْنِ جَرِيرٍ ، عَنْ أَبِيهِ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ."
            },
            {
                "hadithNo": "6804",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"Whoever calls others to guidance will have a reward like that of those who follow it, without that detracting from their reward in the slightest. And whoever calls others to misguidance will have a burden of sin like that of those who follow it, without it detracting from their burden in the slightest.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ ، وَقُتَيْبَةُ بْنُ سَعِيدٍ ، وَابْنُ حُجْرٍ ، قَالُوا: حَدَّثَنَا إِسْمَاعِيلُ يَعْنُونَ ابْنَ جَعْفَرٍ ، عَنِ الْعَلاَءِ ، عَنْ أَبِيهِ ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: مَنْ دَعَا إِلَى هُدًى، كَانَ لَهُ مِنَ الأَجْرِ مِثْلُ أُجُورِ مَنْ تَبِعَهُ، لاَ يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا، وَمَنْ دَعَا إِلَى ضَلاَلَةٍ ، كَانَ عَلَيْهِ مِنَ الإِثْمِ مِثْلُ آثَامِ مَنْ تَبِعَهُ ، لاَ يَنْقُصُ ذَلِكَ مِنْ آثَامِهِمْ شَيْئًا."
            }
        ]
    }
]