[
  {
    "SurahNumber": "72",
    "AyahNumber": "1",
    "NoteID": "5727",
    "Body": "Cf. xlvi. 29-32, n. 4809. The Jinns had evidently heard\\n\\t\\t\\t\\tof previous revelations, that of Moses (xlvi. 30), and\\n\\t\\t\\t\\tthe error of Trinitarian Christianity (lxxii. 3). The\\n\\t\\t\\t\\tcommunity from which they come have all sorts of good and\\n\\t\\t\\t\\tbad persons, but they are determined to preach the good\\n\\t\\t\\t\\tMessage of Unity which they have heard and believed in."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "1",
    "NoteID": "5728",
    "Body": "For Jinns, see n. 929 to vi. 100."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "1",
    "NoteID": "5729",
    "Body": "The Holy Qur-an would be to them a wonderful Recital-both\\n\\t\\t\\t\\tin subject-matter and in the circumstance that it had\\n\\t\\t\\t\\tcome in Arabia among a pagan and ignorant nation."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "3",
    "NoteID": "5730",
    "Body": "They abjure paganism and also the doctrine of a son\\n\\t\\t\\t\\tbegotten by Allah, which would also imply a wife of whom\\n\\t\\t\\t\\the was begotten. Cf. vi. 101."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "5",
    "NoteID": "5731",
    "Body": "No one ought to entertain false notions about Allah. For\\n\\t\\t\\t\\tby joining false gods in our ideas of worship, we degrade\\n\\t\\t\\t\\tour conception of ourselves and the duty we owe to our\\n\\t\\t\\t\\tCreator and Cherisher, to Whom we have to give a final\\n\\t\\t\\t\\taccount of life and conduct. If we worship idols or\\n\\t\\t\\t\\theavenly bodies, or human beings, or any creatures, or\\n\\t\\t\\t\\tfalse fancies born of self or foolish abstractions, or\\n\\t\\t\\t\\tthe lusts and desires of our own hearts, we are not only\\n\\t\\t\\t\\tdoing violence to Truth, but we are causing discord in\\n\\t\\t\\t\\tthe harmony of the world."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "6",
    "NoteID": "5732",
    "Body": "If human beings think that by a resort to some spirits\\n\\t\\t\\t\\tthey can shelter themselves from the struggles and\\n\\t\\t\\t\\tactualities of their own lives, they are sadly mistaken.\\n\\t\\t\\t\\tThey must \"dree their own weird\", as the Scots would say.\\n\\t\\t\\t\\tIt is folly to try to escape from the duties which they\\n\\t\\t\\t\\tcan understand in their own natural surroundings, or to\\n\\t\\t\\t\\ttry to avoid the consequences of their own acts. Only\\n\\t\\t\\t\\tsuch persons do so as do not realise that they will\\n\\t\\t\\t\\tultimately have to answer at the Judgment-Seat of Allah,\\n\\t\\t\\t\\twhose first outpost is in their own conscience."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "8",
    "NoteID": "5733",
    "Body": "See notes 1951, 1953, and 1954 to xv. 17-18. See also n.\\n\\t\\t\\t\\t5562 to lxvii. 5. The speakers here have repented of sin\\n\\t\\t\\t\\tand evil; but they recognise that there are evil ones\\n\\t\\t\\t\\tamong them, who love stealth and prying, but their dark\\n\\t\\t\\t\\tplots will be defeated by vigilant guardians of the\\n\\t\\t\\t\\tRight, whose repulse of the attacks of evil is figured by\\n\\t\\t\\t\\tthe shafts of meteoric light in the heavens."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "9",
    "NoteID": "5734",
    "Body": "What is the force of \"now\"? It refers to the early Makkan\\n\\t\\t\\t\\tperiod of Revelation. It means that whatever excuse there\\n\\t\\t\\t\\tmay have been before, for people to try to seek out the\\n\\t\\t\\t\\thidden truths of the Unseen World through jinns, there\\n\\t\\t\\t\\twas none now, as the perspicuous Qur-an had restored the\\n\\t\\t\\t\\tMessage of Unity and cleared religion of all the cobwebs,\\n\\t\\t\\t\\tmysteries, and falsehoods with which priestcraft and\\n\\t\\t\\t\\tpious fraud had overlaid it. The result is that such\\n\\t\\t\\t\\tseekers after false hidden knowledge will find themselves\\n\\t\\t\\t\\tconfronted now by the flaming fire, which, like the\\n\\t\\t\\t\\tshafts of meteoric light (see note), will lie in wait for\\n\\t\\t\\t\\tand nip such priestcraft and black magic in the bud."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "10",
    "NoteID": "5735",
    "Body": "To these jinns this gospel is yet new, and appears like a\\n\\t\\t\\t\\tflaming sword which destroys falsehood while it protects\\n\\t\\t\\t\\tTruth. They frankly confess that they do not clearly\\n\\t\\t\\t\\tunderstand whether on the whole it will be a mercy to\\n\\t\\t\\t\\tmankind or a punishment for mankind forsaking the paths\\n\\t\\t\\t\\tof Allah. But they rightly feel that it must be a\\n\\t\\t\\t\\tblessing if all seek right Guidance."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "12",
    "NoteID": "5736",
    "Body": "See last note. In any case, they know that Allah's Truth\\n\\t\\t\\t\\tand Allah's Plan must prevail, and no one can frusrate\\n\\t\\t\\t\\tAllah's purpose; or escape from it. Why not then bring\\n\\t\\t\\t\\ttheir will into conformity with it, and find Peace, as\\n\\t\\t\\t\\tthey have found, by the acceptance of Faith?"
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "13",
    "NoteID": "5737",
    "Body": "Possibly, from this world's standards, it may be that a\\n\\t\\t\\t\\tbeliever suffers for his Faith. He may be laughed at,\\n\\t\\t\\t\\tpersecuted, and actually hurt, \"in mind, body, or\\n\\t\\t\\t\\testate\". But he is not perturbed. He takes it all\\n\\t\\t\\t\\tcheerfully, because he knows that when his full account\\n\\t\\t\\t\\tis made up-real gain against apparent loss,-he is a\\n\\t\\t\\t\\tgainer rather than a loser. And his Faith tells him that\\n\\t\\t\\t\\tAllah is a just God, and will never allow him to suffer\\n\\t\\t\\t\\tany injustice, or permit the account of his merit to\\n\\t\\t\\t\\tappear one whit shorter than it is."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "14",
    "NoteID": "5738",
    "Body": "Any one who responds to true Guidance, and submits his\\n\\t\\t\\t\\twill to Allah, finds that he makes rapid progress in the\\n\\t\\t\\t\\tpath of right conduct and right life. He gets more and\\n\\t\\t\\t\\tmore assurance that his destination is the Garden of\\n\\t\\t\\t\\tBliss."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "15",
    "NoteID": "5739",
    "Body": "An unjust life carries its own condemnation. It does no\\n\\t\\t\\t\\tgood to itself or to any one else. It bears no fruit. It\\n\\t\\t\\t\\tbecomes merely fuel for the Fire of Punishment."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "16",
    "NoteID": "5740",
    "Body": "Rain: literally, water: stands for all kinds of\\n\\t\\t\\t\\tblessings, material, moral, and spiritual. All blessings\\n\\t\\t\\t\\tcome by way of trial: the more we have, the more is\\n\\t\\t\\t\\texpected of us. A man of gifts, talents, or insight is\\n\\t\\t\\t\\texpected to show a higher standard of love and\\n\\t\\t\\t\\tunselfishness than one less gifted, just as a rich man is\\n\\t\\t\\t\\texpected to give more in charity than a poor man."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "17",
    "NoteID": "5741",
    "Body": "To remember Allah is to realise His presence, acknowledge\\n\\t\\t\\t\\tIiis Goodness, and accept His guidance. If we fail to do\\n\\t\\t\\t\\tso, by deliberately turning away, He will withdraw His\\n\\t\\t\\t\\tGrace, and that will be a severe Penalty indeed."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "18",
    "NoteID": "5742",
    "Body": "This is a Makkan Sura, and Masjid must be understood, not\\n\\t\\t\\t\\tin the later technical sense of a Mosque, but in the root\\n\\t\\t\\t\\tmeaning, of any place, or occasion of worship or humble\\n\\t\\t\\t\\tprostration in the service of Allah, or any limbs or\\n\\t\\t\\t\\tfaculties or accessories used in such worship, e.g.,\\n\\t\\t\\t\\thands and feet, lips and voice, understanding or\\n\\t\\t\\t\\torganisation. A number of meanings therefore follow. (1)\\n\\t\\t\\t\\tNo place of worship whatever should be used for the\\n\\t\\t\\t\\tworship of any other but Allah the true God. The Ka'ba\\n\\t\\t\\t\\twas then full of idols, but the idols and their votaries\\n\\t\\t\\t\\twere usurpers. (2) Worship should not be mixed up with\\n\\t\\t\\t\\tvain objects, but should be reserved for the sincere\\n\\t\\t\\t\\tservice of Allah. (3) All our gifts are for Allah's\\n\\t\\t\\t\\tservice, which includes the service of His creatures, and\\n\\t\\t\\t\\tnot for our vainglory."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "19",
    "NoteID": "5743",
    "Body": "The Devotee of Allah: the holy Prophet Muhammad."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "19",
    "NoteID": "5744",
    "Body": "They. The immediate reference was to the Pagan Quraish\\n\\t\\t\\t\\twho were then in possession of the Ka'ba and who put all\\n\\t\\t\\t\\tsorts of obstacles and indignities in the way of the holy\\n\\t\\t\\t\\tProphet for preaching the One True God and denouncing\\n\\t\\t\\t\\tidol-worship. They used to surround him and mob him and\\n\\t\\t\\t\\tto treat him as if he was guilty of some dreadful crime.\\n\\t\\t\\t\\tBut the wider application refers to the habit of the\\n\\t\\t\\t\\tworld to make a marked man of any who diverges from the\\n\\t\\t\\t\\tbeaten paths of their favourite sins and who pleads\\n\\t\\t\\t\\tearnestly for the cause of Truth and righteousness. They\\n\\t\\t\\t\\tridicule him; they surround him with jeers and obloquy;\\n\\t\\t\\t\\tand they try to make the physical condition of his life\\n\\t\\t\\t\\tas difficult for him as possible."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "21",
    "NoteID": "5745",
    "Body": "'Do not suppose that I am going to harm you individually\\n\\t\\t\\t\\tor socially; the very opposite is my wish; but I cannot\\n\\t\\t\\t\\tforce you to right conduct; that must depend upon the\\n\\t\\t\\t\\tpurification of your own faith and will'."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "22",
    "NoteID": "5746",
    "Body": "'My mission is from Allah. I cannot choose but obey. He\\n\\t\\t\\t\\thas charged me to deliver the Message, and if I were to\\n\\t\\t\\t\\tdisobey him, I would myself be worthy of His punishment,\\n\\t\\t\\t\\tand no one can save me. From every kind of trouble and\\n\\t\\t\\t\\tdifficulty my only refuge is in Him. I must proclaim His\\n\\t\\t\\t\\tMessage: otherwise I am false to the mission He has\\n\\t\\t\\t\\tentrusted to me.'"
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "24",
    "NoteID": "5747",
    "Body": "When the Hereafter arrives, and true values are restored,\\n\\t\\t\\t\\tthey will see clearly that the Promise of Allah was true,\\n\\t\\t\\t\\tand that death on this earth was not the end of all\\n\\t\\t\\t\\tthings. Then they will see that those who were accounted\\n\\t\\t\\t\\tweak on this earth will, in the realm of Reality, be the\\n\\t\\t\\t\\tstrong ones; those who seemed to have no following here\\n\\t\\t\\t\\twill have, there, all the great and true ones with them,\\n\\t\\t\\t\\tto help them and welcome them to their own ranks."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "25",
    "NoteID": "5748",
    "Body": "The coming of Judgment is certain. But the exact time,\\n\\t\\t\\t\\trelatively to our standards on this earth, no one can\\n\\t\\t\\t\\ttell. Allah alone knows it. Even a Prophet of Allah, as\\n\\t\\t\\t\\tsuch, does not know the Mysteries of the Unseen World,\\n\\t\\t\\t\\texcept in so far as they have been revealed to him by\\n\\t\\t\\t\\tAllah's Revelation. Cf. vi. 50, and notes 867-68."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "26",
    "NoteID": "5749",
    "Body": "The Unseen has two aspects. The relative Unseen is so\\n\\t\\t\\t\\twith reference to a particular person, because of the\\n\\t\\t\\t\\tintervention of Time, Space, or particular circumstances.\\n\\t\\t\\t\\tFor example, I cannot see to-day a house which I saw last\\n\\t\\t\\t\\tyear, because it has since been pulled down. Or I cannot\\n\\t\\t\\t\\tin Lahore see the \"Gateway of India\" in Bombay, although\\n\\t\\t\\t\\tany one in Bombay can see it. Or I cannot see the\\n\\t\\t\\t\\tsatellites of Jupiter with the naked eye, though I can\\n\\t\\t\\t\\tthrough a telescope. But the Absolute Unseen, the\\n\\t\\t\\t\\tAbsolute Mystery, is something which no creature can know\\n\\t\\t\\t\\tor see, except in so far as Allah reveals it to him. And\\n\\t\\t\\t\\tAllah reveals such things to the extent that is good for\\n\\t\\t\\t\\tmen, through His chosen messengers, among whom the\\n\\t\\t\\t\\tgreatest is Muhammad. The exact time of the Hour of\\n\\t\\t\\t\\tJudgment has not been so shown, because we must not wait\\n\\t\\t\\t\\tfor it, but live as if it is to be at this minute. See\\n\\t\\t\\t\\tlast note and next note, and the references there."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "27",
    "NoteID": "5750",
    "Body": "Cf. iii. 179, and n. 482. See also last note."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "27",
    "NoteID": "5751",
    "Body": "Revelation is not a mechanical or material thing. It has\\n\\t\\t\\t\\tto be safeguarded from being distorted or corrupted by\\n\\t\\t\\t\\tignorance, selfishness, or the powers of evil. How can\\n\\t\\t\\t\\tits precious and subtle worth and the spiritual\\n\\t\\t\\t\\tsafeguards against its misuse by human folly or the\\n\\t\\t\\t\\tperversity of evil be expressed in plain human words? We\\n\\t\\t\\t\\tcan imagine a very great treasure, which has to be\\n\\t\\t\\t\\ttransmitted. To guard it against evilly-disposed persons,\\n\\t\\t\\t\\ta strong escort is required, to march in front and\\n\\t\\t\\t\\tbehind, so as to protect it from all sides. When it\\n\\t\\t\\t\\treaches its destination, the escort presents its\\n\\t\\t\\t\\tcredentials and an Invoice showing the Treasure being\\n\\t\\t\\t\\ttransmitted. Then the destined receiver knows that it has\\n\\t\\t\\t\\tcome intact and feels satisfied. So about spiritual\\n\\t\\t\\t\\tRevelation. The Prophet recognises the credentials and\\n\\t\\t\\t\\tchecks the contents on the tablets of his own heart and\\n\\t\\t\\t\\tinsight. He has then no doubt that it is a true Message\\n\\t\\t\\t\\tfrom Allah, and that those who bring it are the true\\n\\t\\t\\t\\tmessengers \"of their Lord\". A) They: the band of\\n\\t\\t\\t\\twatchers. In \"he may know\" it is better to construe \"he\"\\n\\t\\t\\t\\tto refer to the prophet who receives the Message from the\\n\\t\\t\\t\\t\"watchers\"."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "28",
    "NoteID": "5752",
    "Body": "Ahata: surrounds, encompasses, encloses, guards on all\\n\\t\\t\\t\\tsides, keeps under his own possession and control, and\\n\\t\\t\\t\\tdoes not allow to be corrupted or debased. See last note\\n\\t\\t\\t\\tbut one."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "28",
    "NoteID": "5753",
    "Body": "In the spiritual Kingdom,-as indeed, in all\\n\\t\\t\\t\\tthings,-Allah's knowledge, wisdom, and Plan comprehend\\n\\t\\t\\t\\tall things, great and small. There is nothing which we\\n\\t\\t\\t\\tdo, nothing which happens that is outside His account."
  }
]
