[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/004001",
        "Body":  "O mankind! reverence your Guardian-Lord Who created you from a\n\t\t\tsingle person created of like nature his mate and from them twain\n\t\t\tscattered (like seeds) countless men and women; reverence Allah\n\t\t\tthrough Whom ye demand your mutual (rights) and (reverence) the\n\t\t\twombs (that bore you): for Allah ever watches over you.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e504\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e505\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e506\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/004010",
        "Body":  "Those who unjustly eat up the property of orphans eat up a fire\n\t\t\tinto their own bodies: they will soon be enduring a blazing fire!"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "100",
        "Recitation":  "Alafasy_128kbps/004100",
        "Body":  "He who forsakes his home in the cause of Allah finds in the earth\n\t\t\tmany a refuge wide and spacious: should he die as a refugee from\n\t\t\thome for Allah and his Apostle his reward becomes due and sure\n\t\t\twith Allah: and Allah is Oft-Forgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "101",
        "Recitation":  "Alafasy_128kbps/004101",
        "Body":  "When ye travel through the earth there is no blame on you if ye\n\t\t\tshorten your prayers for fear the unbelievers may attack you: for\n\t\t\tthe unbelievers are unto you open enemies. \u003cspan class=\u0027fn\u0027\u003e617\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "102",
        "Recitation":  "Alafasy_128kbps/004102",
        "Body":  "When thou (O Apostle) art with them and standest to lead them in\n\t\t\tprayer let one party of them stand up (in prayer) with thee\n\t\t\ttaking their arms with them: when they finish their prostrations\n\t\t\tlet them take their positions in the rear and let the other party\n\t\t\tcome up which hath not yet prayed and let them pray with thee\n\t\t\ttaking all precautions and bearing arms: the unbelievers wish if\n\t\t\tye were negligent of your arms and your baggage to assault you in\n\t\t\ta single rush but there is no blame on you if ye put away your\n\t\t\tarms because of the inconvenience of rain or because ye are ill;\n\t\t\tbut take (every) precaution for yourselves.  For the unbelievers\n\t\t\tAllah hath prepared a humiliating punishment. \u003cspan class=\u0027fn\u0027\u003e618\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "103",
        "Recitation":  "Alafasy_128kbps/004103",
        "Body":  "When ye pass (congregational) prayers celebrate Allah\u0027s praises\n\t\t\tstanding sitting down or lying down on your sides; but when ye\n\t\t\tare free from danger set up regular prayers: for such prayers are\n\t\t\tenjoined on believers at stated times. \u003cspan class=\u0027fn\u0027\u003e619\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "104",
        "Recitation":  "Alafasy_128kbps/004104",
        "Body":  "And slacken not in following up the enemy: if ye are suffering\n\t\t\thardships they are suffering similar hardships; but ye have hope\n\t\t\tfrom Allah while they have none.  And Allah is full of knowledge\n\t\t\tand wisdom. \u003cspan class=\u0027fn\u0027\u003e620\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "105",
        "Recitation":  "Alafasy_128kbps/004105",
        "Body":  "We have sent down to thee the Book in truth that thou mightest\n\t\t\tjudge between men as guided by Allah: so be not (used) as an\n\t\t\tadvocate by those who betray their trust. \u003cspan class=\u0027fn\u0027\u003e621\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "106",
        "Recitation":  "Alafasy_128kbps/004106",
        "Body":  "But seek the forgiveness of Allah; for Allah is Oft-Forgiving\n\t\t\tMost Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "107",
        "Recitation":  "Alafasy_128kbps/004107",
        "Body":  "Contend not on behalf of such as betray their own souls: for\n\t\t\tAllah loveth not one given to perfidy and crime. \u003cspan class=\u0027fn\u0027\u003e622\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "108",
        "Recitation":  "Alafasy_128kbps/004108",
        "Body":  "They may hide (their crimes) from men but they cannot hide (them)\n\t\t\tfrom Allah seeing that He is in their midst when they plot by\n\t\t\tnight in words that He cannot approve: and Allah doth compass\n\t\t\tround all that they do. \u003cspan class=\u0027fn\u0027\u003e623\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "109",
        "Recitation":  "Alafasy_128kbps/004109",
        "Body":  "Ah! these are the sort of men on whose behalf ye may contend in\n\t\t\tthis world; but who will contend with Allah on their behalf on\n\t\t\tthe Day of Judgment or who will carry their affairs through?"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/004011",
        "Body":  "Allah (thus) directs you as regards your children\u0027s\n\t\t\t(inheritance): to the male a portion equal to that of two\n\t\t\tfemales: if only daughters two or more their share is two-thirds\n\t\t\tof the inheritance; if only one her share is a half.  For parents\n\t\t\ta sixth share of the inheritance to each if the deceased left\n\t\t\tchildren; if no children and the parents are the (only) heirs the\n\t\t\tmother has a third; if the deceased left brothers (or sisters)\n\t\t\tthe mother has a sixth.  (The distribution in all cases is) after\n\t\t\tthe payment of legacies and debts. Ye know not whether your\n\t\t\tparents or your children are nearest to you in benefit.  These\n\t\t\tare settled portions ordained by Allah and Allah is All-Knowing\n\t\t\tAll-Wise. \u003cspan class=\u0027fn\u0027\u003e516\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e517\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e518\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "110",
        "Recitation":  "Alafasy_128kbps/004110",
        "Body":  "If anyone does evil or wrongs his own soul but afterwards seeks\n\t\t\tAllah\u0027s forgiveness he will find Allah Oft-Forgiving Most\n\t\t\tMerciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "111",
        "Recitation":  "Alafasy_128kbps/004111",
        "Body":  "And if anyone earns sin he earns it against his own soul: for\n\t\t\tAllah is full of knowledge and wisdom. \u003cspan class=\u0027fn\u0027\u003e624\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "112",
        "Recitation":  "Alafasy_128kbps/004112",
        "Body":  "But if anyone earns a fault or a sin and throws it on to one that\n\t\t\tis innocent He carries (on himself) (both) a falsehood and a\n\t\t\tflagrant sin."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "113",
        "Recitation":  "Alafasy_128kbps/004113",
        "Body":  "But for the Grace of Allah to thee and His Mercy a party of them\n\t\t\twould certainly have plotted to lead thee astray.  But (in fact)\n\t\t\tthey will only lead their own souls astray and to thee they can\n\t\t\tdo no harm in the least.  For Allah hath sent down to thee the\n\t\t\tBook and wisdom and taught thee what thou knewest not (before);\n\t\t\tand great is the grace of Allah unto thee."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "114",
        "Recitation":  "Alafasy_128kbps/004114",
        "Body":  "In most of their secret talks there is no good: but if one\n\t\t\texhorts to a deed of charity or justice or conciliation between\n\t\t\tmen (secrecy is permissible): to him who does this seeking the\n\t\t\tgood pleasure of Allah We shall soon give a reward of the highest\n\t\t\t(value). \u003cspan class=\u0027fn\u0027\u003e625\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "115",
        "Recitation":  "Alafasy_128kbps/004115",
        "Body":  "If anyone contends with the Apostle even after guidance has been\n\t\t\tplainly conveyed to him and follows a path other than that\n\t\t\tbecoming to men of faith We shall leave him in the path he has\n\t\t\tchosen and land him in Hell--what an evil refuge!"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "116",
        "Recitation":  "Alafasy_128kbps/004116",
        "Body":  "Allah forgiveth not (the sin of) joining other gods with Him: but\n\t\t\tHe forgiveth whom He pleaseth other sins than this: one who joins\n\t\t\tother gods with Allah hath strayed far far away (from the right).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e626\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "117",
        "Recitation":  "Alafasy_128kbps/004117",
        "Body":  "(The pagans) leaving Him call but upon female deities: they call\n\t\t\tbut upon Satan the persistent rebel! \u003cspan class=\u0027fn\u0027\u003e627\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "118",
        "Recitation":  "Alafasy_128kbps/004118",
        "Body":  "Allah did curse him but he said: \"I will take of Thy servants a\n\t\t\tportion marked off. \u003cspan class=\u0027fn\u0027\u003e628\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "119",
        "Recitation":  "Alafasy_128kbps/004119",
        "Body":  "\"I will mislead them and I will create in them false desires; I\n\t\t\twill order them to slit the ears of cattle and to deface the\n\t\t\t(fair) nature created by Allah.\"  Whoever forsaking Allah takes\n\t\t\tSatan for a friend hath of a surety suffered a loss that is\n\t\t\tmanifest. \u003cspan class=\u0027fn\u0027\u003e629\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e630\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e631\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/004012",
        "Body":  "In what your wives leave your share is a half if they leave no\n\t\t\tchild; but if they leave a child ye get a fourth; after payment\n\t\t\tof legacies and debts.\tIn what ye leave their share is a fourth\n\t\t\tif ye leave no child; but if ye leave a child they get an eighth;\n\t\t\tafter payment of legacies and debts.  If the man or woman whose\n\t\t\tinheritance is in question has left neither ascendants nor\n\t\t\tdescendants but has left a brother or a sister each one of the\n\t\t\ttwo gets a sixth; but if more than two they share in a third;\n\t\t\tafter payment of legacies and debts; so that no loss is caused\n\t\t\t(to anyone).  Thus is it ordained by Allah and Allah is\n\t\t\tAll-Knowing Most Forbearing. \u003cspan class=\u0027fn\u0027\u003e519\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e520\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e521\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e522\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "120",
        "Recitation":  "Alafasy_128kbps/004120",
        "Body":  "Satan makes them promises and creates in them false desires; but\n\t\t\tSatan\u0027s promises are nothing but deception."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "121",
        "Recitation":  "Alafasy_128kbps/004121",
        "Body":  "They (his dupes) will have their dwelling in hell and from it\n\t\t\tthey will find no way of escape."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "122",
        "Recitation":  "Alafasy_128kbps/004122",
        "Body":  "But those who believe and do deeds of righteousness We shall soon\n\t\t\tadmit them to gardens with rivers flowing beneath to dwell\n\t\t\ttherein for ever.  Allah\u0027s promise is the truth and whose word\n\t\t\tcan be truer than Allah\u0027s?"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "123",
        "Recitation":  "Alafasy_128kbps/004123",
        "Body":  "Not your desires nor those of the people of the Book (can\n\t\t\tprevail): whoever works evil will be requited accordingly.  Nor\n\t\t\twill he find besides Allah any protector or helper. \u003cspan class=\u0027fn\u0027\u003e632\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "124",
        "Recitation":  "Alafasy_128kbps/004124",
        "Body":  "If any do deeds of righteousness be they male or female and have\n\t\t\tfaith they will enter heaven and not the least injustice will be\n\t\t\tdone to them. \u003cspan class=\u0027fn\u0027\u003e633\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "125",
        "Recitation":  "Alafasy_128kbps/004125",
        "Body":  "Who can be better in religion than one who submits his whole self\n\t\t\tto Allah does good and follows the way of Abraham the true in\n\t\t\tfaith?\tFor Allah did take Abraham for a friend. \u003cspan class=\u0027fn\u0027\u003e634\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "126",
        "Recitation":  "Alafasy_128kbps/004126",
        "Body":  "But to Allah belong all things in the heavens and on earth: and\n\t\t\tHe it is that encompasseth all things. \u003cspan class=\u0027fn\u0027\u003e625\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "127",
        "Recitation":  "Alafasy_128kbps/004127",
        "Body":  "They ask thy instruction concerning the women.\tSay: Allah doth\n\t\t\tinstruct you about them: and (remember) what hath been rehearsed\n\t\t\tunto you in the Book concerning the orphans of women to whom ye\n\t\t\tgive not the portions prescribed and yet whom ye desire to marry\n\t\t\tas also concerning the children who are weak and oppressed: that\n\t\t\tye stand firm for justice to orphans.  There is not a good deed\n\t\t\twhich ye do but Allah is well-acquainted therewith. \u003cspan class=\u0027fn\u0027\u003e636\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e637\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "128",
        "Recitation":  "Alafasy_128kbps/004128",
        "Body":  "If a wife fears cruelty or desertion on her husband\u0027s part there\n\t\t\tis no blame on them if they arrange an amicable settlement\n\t\t\tbetween themselves; and such settlement is best; even though\n\t\t\tmen\u0027s souls are swayed by greed.  But if ye do good and practice\n\t\t\tself-restraint Allah is well-acquainted with all that ye do.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e638\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "129",
        "Recitation":  "Alafasy_128kbps/004129",
        "Body":  "Ye are never able to be fair and just as between women even if it\n\t\t\tis your ardent desire: but turn not away (from a woman)\n\t\t\taltogether so as to leave her (as it were) hanging (in the air). \n\t\t\tIf ye come to a friendly understanding and practice\n\t\t\tself-restraint Allah is Oft-Forgiving Most Merciful. \u003cspan class=\u0027fn\u0027\u003e639\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/004013",
        "Body":  "Those are limits set by Allah: those who obey Allah and His\n\t\t\tApostle will be admitted to Gardens with rivers flowing beneath\n\t\t\tto abide therein (for ever) and that will be the Supreme\n\t\t\tachievement. \u003cspan class=\u0027fn\u0027\u003e527\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "130",
        "Recitation":  "Alafasy_128kbps/004130",
        "Body":  "But if they disagree (and must part) Allah will provide abundance\n\t\t\tfor all from His all-reaching bounty: for Allah is He that careth\n\t\t\tfor all and is Wise."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "131",
        "Recitation":  "Alafasy_128kbps/004131",
        "Body":  "To Allah belong all things in the heavens and on earth.  Verily\n\t\t\tWe have directed the people of the Book before you and you (O\n\t\t\tMuslims) to fear Allah.  But if ye deny Him lo! unto Allah belong\n\t\t\tall things in the heavens and on earth and Allah is free of all\n\t\t\twants worthy of all praise. \u003cspan class=\u0027fn\u0027\u003e640\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e641\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "132",
        "Recitation":  "Alafasy_128kbps/004132",
        "Body":  "Yea unto Allah belong all things in the heavens and on earth and\n\t\t\tenough is Allah to carry through all affairs. \u003cspan class=\u0027fn\u0027\u003e642\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "133",
        "Recitation":  "Alafasy_128kbps/004133",
        "Body":  "If it were His will He could destroy you O mankind and create\n\t\t\tanother race: for He hath power this to do."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "134",
        "Recitation":  "Alafasy_128kbps/004134",
        "Body":  "If anyone desires a reward in this life in Allah\u0027s (gift) is the\n\t\t\treward (both) of this life and of the Hereafter: for Allah is He\n\t\t\tthat heareth and seeth (all things). \u003cspan class=\u0027fn\u0027\u003e643\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "135",
        "Recitation":  "Alafasy_128kbps/004135",
        "Body":  "O ye who believe! stand out firmly for justice as witnesses to\n\t\t\tAllah even as against yourselves or your parents or your kin and\n\t\t\twhether it be (against) rich or poor: for Allah can best protect\n\t\t\tboth.  Follow not the lusts (of your hearts) lest ye swerve and\n\t\t\tif ye distort (justice) or decline to do justice verily Allah is\n\t\t\twell-acquainted with all that ye do. \u003cspan class=\u0027fn\u0027\u003e544\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e645\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "136",
        "Recitation":  "Alafasy_128kbps/004136",
        "Body":  "O ye who believe! believe in Allah and his Apostle and the\n\t\t\tscripture which He hath sent to His Apostle and the scripture\n\t\t\twhich He sent to those before (him).  And who denieth Allah His\n\t\t\tangels His Books His Apostles and the Day of Judgment hath gone\n\t\t\tfar far astray. \u003cspan class=\u0027fn\u0027\u003e646\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "137",
        "Recitation":  "Alafasy_128kbps/004137",
        "Body":  "Those who believe then reject faith then believe (again) and\n\t\t\t(again) reject faith and go on increasing in unbelief Allah will\n\t\t\tnot forgive them nor guide them on the way. \u003cspan class=\u0027fn\u0027\u003e647\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "138",
        "Recitation":  "Alafasy_128kbps/004138",
        "Body":  "To the hypocrites give the glad tidings that there is for them\n\t\t\t(but) a grievous penalty."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "139",
        "Recitation":  "Alafasy_128kbps/004139",
        "Body":  "Yea to those who take for friends unbelievers rather than\n\t\t\tbelievers: is it honor they seek among them?  Nay all honor is\n\t\t\twith Allah. \u003cspan class=\u0027fn\u0027\u003e648\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/004014",
        "Body":  "But those who disobey Allah and His Apostle and transgress His\n\t\t\tlimits will be admitted to a fire to abide therein: and they\n\t\t\tshall have a humiliating punishment."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "140",
        "Recitation":  "Alafasy_128kbps/004140",
        "Body":  "Already has He sent you word in the Book that when ye hear the\n\t\t\tsigns of Allah held in defiance and ridicule ye are not to sit\n\t\t\twith them unless they turn to a different theme: if ye did ye\n\t\t\twould be like them.  For Allah will collect the Hypocrites and\n\t\t\tthose who defy faith all in hell. \u003cspan class=\u0027fn\u0027\u003e649\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "141",
        "Recitation":  "Alafasy_128kbps/004141",
        "Body":  "(These are) the ones who wait and watch about you: if ye do gain\n\t\t\ta victory from Allah they say: \"Were we not with you?\"\tBut if\n\t\t\tthe unbelievers gain a success they say (to them): \"Did we not\n\t\t\tgain an advantage over you and did we not guard you from the\n\t\t\tbelievers?\"  But Allah will judge betwixt you on the Day of\n\t\t\tJudgment.  And never will Allah grant to the unbelievers a way\n\t\t\t(to triumph) over the believers."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "142",
        "Recitation":  "Alafasy_128kbps/004142",
        "Body":  "The Hypocrites they think they are over-reaching Allah but He\n\t\t\twill over-reach them: when they stand up to prayer they stand\n\t\t\twithout earnestness to be seen of men but little do they hold\n\t\t\tAllah in remembrance."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "143",
        "Recitation":  "Alafasy_128kbps/004143",
        "Body":  "(They are) distracted in mind even in the midst of it being\n\t\t\t(sincerely) for neither one group nor for another.  Whom Allah\n\t\t\tleaves straying never wilt thou find for him the way.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e651\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "144",
        "Recitation":  "Alafasy_128kbps/004144",
        "Body":  "O ye who believe! take not for friends unbelievers rather than\n\t\t\tbelievers: do ye wish to offer Allah an open proof against\n\t\t\tyourselves?."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "145",
        "Recitation":  "Alafasy_128kbps/004145",
        "Body":  "The hypocrites will be in the lowest depths of the fire: no\n\t\t\thelper wilt thou find for them."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "146",
        "Recitation":  "Alafasy_128kbps/004146",
        "Body":  "Except for those who repent mend (their life) hold fast to Allah\n\t\t\tand purify their religion as in Allah\u0027s sight: if so they will be\n\t\t\t(numbered) with the believers.\tAnd soon will Allah grant to the\n\t\t\tbelievers a reward of immense value. \u003cspan class=\u0027fn\u0027\u003e652\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "147",
        "Recitation":  "Alafasy_128kbps/004147",
        "Body":  "What can Allah gain by your punishment if ye are grateful and ye\n\t\t\tbelieve?  Nay it is Allah that recogniseth (all good) and knoweth\n\t\t\tall things. \u003cspan class=\u0027fn\u0027\u003e633\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "148",
        "Recitation":  "Alafasy_128kbps/004148",
        "Body":  "Allah loveth not that evil should be noised abroad in public\n\t\t\tspeech except where injustice hath been done; for Allah is He who\n\t\t\theareth and knoweth all things. \u003cspan class=\u0027fn\u0027\u003e654\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "149",
        "Recitation":  "Alafasy_128kbps/004149",
        "Body":  "Whether ye publish a good deed or conceal it or cover evil with\n\t\t\tpardon verily Allah doth blot out (sins) and hath power (in the\n\t\t\tjudgment of values). \u003cspan class=\u0027fn\u0027\u003e655\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/004015",
        "Body":  "If any of your women are guilty of lewdness take the evidence of\n\t\t\tfour (reliable) witnesses from amongst you against them; and if\n\t\t\tthey testify confine them to houses until death do claim them or\n\t\t\tAllah ordain for them some (other) way. \u003cspan class=\u0027fn\u0027\u003e523\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e524\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e525\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "150",
        "Recitation":  "Alafasy_128kbps/004150",
        "Body":  "Those who deny Allah and his Apostles and (those who) wish to\n\t\t\tseparate Allah from His Apostles saying: \"We believe in some but\n\t\t\treject others\": and (those who) wish to take a course midway.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e656\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "151",
        "Recitation":  "Alafasy_128kbps/004151",
        "Body":  "They are in truth (equally) unbelievers; and We have prepared for\n\t\t\tunbelievers a humiliating punishment."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "152",
        "Recitation":  "Alafasy_128kbps/004152",
        "Body":  "To those who believe in Allah and His Apostles and make no\n\t\t\tdistinction between any of the Apostles We shall soon give their\n\t\t\t(due) rewards: for Allah is Oft-Forgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "153",
        "Recitation":  "Alafasy_128kbps/004153",
        "Body":  "The people of the Book ask thee to cause a book to descend to\n\t\t\tthem from heaven: indeed they asked Moses for an even greater\n\t\t\t(miracle) for they said: \"Show us Allah in public\" but they were\n\t\t\tdazed for their presumption with thunder and lightning.  Yet they\n\t\t\tworshipped the calf even after clear signs had come to them; even\n\t\t\tso We forgave them; and gave Moses manifest proofs of authority.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e657\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "154",
        "Recitation":  "Alafasy_128kbps/004154",
        "Body":  "And for their Covenant We raised over them (the towering height)\n\t\t\tof Mount (Sinai); and (on another occasion) We said: \"Enter the\n\t\t\tgate with humility\"; and (once again) We commanded them:\n\t\t\t\"Transgress not in the matter of the Sabbath.\"\tAnd We took from\n\t\t\tthem a solemn Covenant. \u003cspan class=\u0027fn\u0027\u003e658\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "155",
        "Recitation":  "Alafasy_128kbps/004155",
        "Body":  "(They have incurred divine displeasure): in that they broke their\n\t\t\tCovenant: that they rejected the Signs of Allah; that they slew\n\t\t\tthe Messengers in defiance of right; that they said \"Our hearts\n\t\t\tare the wrappings (which preserve Allah\u0027s Word; we need no\n\t\t\tmore)\"; nay Allah hath set the seal on their hearts for their\n\t\t\tblasphemy and little is it they believe. \u003cspan class=\u0027fn\u0027\u003e659\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e660\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e661\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "156",
        "Recitation":  "Alafasy_128kbps/004156",
        "Body":  "That they rejected faith: that they uttered against Mary a grave\n\t\t\tfalse charge. \u003cspan class=\u0027fn\u0027\u003e662\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "157",
        "Recitation":  "Alafasy_128kbps/004157",
        "Body":  "That they said (in boast) \"We killed Christ Jesus the son of Mary\n\t\t\tthe Apostle of Allah\"; but they killed him not nor crucified him\n\t\t\tbut so it was made to appear to them and those who differ therein\n\t\t\tare full of doubts with no (certain) knowledge but only\n\t\t\tconjecture to follow for of a surety they killed him not.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e663\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "158",
        "Recitation":  "Alafasy_128kbps/004158",
        "Body":  "Nay Allah raised him up unto Himself; and Allah is Exalted in\n\t\t\tPower Wise. \u003cspan class=\u0027fn\u0027\u003e664\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "159",
        "Recitation":  "Alafasy_128kbps/004159",
        "Body":  "And there is none of the People of the Book but must believe in\n\t\t\thim before his death; and on the Day of Judgment He will be a\n\t\t\twitness against them. \u003cspan class=\u0027fn\u0027\u003e665\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e666\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/004016",
        "Body":  "If two men among you are guilty of lewdness punish them both.  If\n\t\t\tthey repent and amend leave them alone; for Allah is\n\t\t\tOft-returning Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "160",
        "Recitation":  "Alafasy_128kbps/004160",
        "Body":  "For the iniquity of the Jews We made unlawful for them certain\n\t\t\t(foods) good and wholesome which had been lawful for them; in\n\t\t\tthat they hindered many from Allah\u0027s way. \u003cspan class=\u0027fn\u0027\u003e667\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "161",
        "Recitation":  "Alafasy_128kbps/004161",
        "Body":  "That they took usury (interest) though they were forbidden; and\n\t\t\tthat they devoured men\u0027s substance wrongfully; We have prepared\n\t\t\tfor those among them who reject faith a grievous punishment."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "162",
        "Recitation":  "Alafasy_128kbps/004162",
        "Body":  "But those among them who are well-grounded in knowledge and the\n\t\t\tbelievers believe in what hath been revealed to thee; and\n\t\t\t(especially) those who establish regular prayer and practice\n\t\t\tregular charity and believe in Allah and in the Last Day: to them\n\t\t\tshall We soon give a great reward."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "163",
        "Recitation":  "Alafasy_128kbps/004163",
        "Body":  "We have sent thee inspiration as We sent it to Noah and the\n\t\t\tMessengers after him; We sent inspiration to Abraham Ismail Isaac\n\t\t\tJacob and the Tribes to Jesus Job Jonah Aaron and Solomon and to\n\t\t\tDavid We gave the Psalms. \u003cspan class=\u0027fn\u0027\u003e668\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e669\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "164",
        "Recitation":  "Alafasy_128kbps/004164",
        "Body":  "Of some Apostles We have already told thee the story; of others\n\t\t\tWe have not; and to Moses Allah spoke direct. \u003cspan class=\u0027fn\u0027\u003e670\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "165",
        "Recitation":  "Alafasy_128kbps/004165",
        "Body":  "Apostles who gave good news as well as warning that mankind after\n\t\t\t(the coming) of the Apostles should have no plea against Allah:\n\t\t\tfor Allah is Exalted in Power Wise. \u003cspan class=\u0027fn\u0027\u003e671\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "166",
        "Recitation":  "Alafasy_128kbps/004166",
        "Body":  "But Allah beareth witness that what He hath sent unto thee He\n\t\t\thath sent from His (Own) Knowledge and the angels bear witness:\n\t\t\tbut enough is Allah for a Witness. \u003cspan class=\u0027fn\u0027\u003e672\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "167",
        "Recitation":  "Alafasy_128kbps/004167",
        "Body":  "Those who reject faith and keep off (men) from the way of Allah\n\t\t\thave verily strayed far far away from the path."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "168",
        "Recitation":  "Alafasy_128kbps/004168",
        "Body":  "Those who reject faith and do wrong Allah will not forgive them\n\t\t\tnor guide them to any way."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "169",
        "Recitation":  "Alafasy_128kbps/004169",
        "Body":  "Except the way of Hell to dwell therein for ever: and this to\n\t\t\tAllah is easy. \u003cspan class=\u0027fn\u0027\u003e673\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/004017",
        "Body":  "Allah accepts the repentance of those who do evil in ignorance\n\t\t\tand repent soon afterwards; to them will Allah turn in mercy; for\n\t\t\tAllah is full of knowledge and wisdom."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "170",
        "Recitation":  "Alafasy_128kbps/004170",
        "Body":  "O mankind! the Apostle hath come to you in truth from Allah:\n\t\t\tbelieve in him: it is best for you.  But if ye reject faith to\n\t\t\tAllah belong all things in the heavens and on earth: and Allah is\n\t\t\tAll-Knowing All-Wise. \u003cspan class=\u0027fn\u0027\u003e674\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "171",
        "Recitation":  "Alafasy_128kbps/004171",
        "Body":  "O people of the Book! commit no excesses in your religion: nor\n\t\t\tsay of Allah aught but truth.  Christ Jesus the son of Mary was\n\t\t\t(no more than) an Apostle of Allah and His Word which He bestowed\n\t\t\ton Mary and a Spirit proceeding from Him: so believe in Allah and\n\t\t\tHis Apostles.  Say not \"Trinity\": desist: it will be better for\n\t\t\tyou: for Allah is One Allah: glory be to him: (for Exalted is He)\n\t\t\tabove having a son.  To Him belong all things in the heavens and\n\t\t\ton earth.  And enough is Allah as a Disposer of affairs.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e675\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e676\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "172",
        "Recitation":  "Alafasy_128kbps/004172",
        "Body":  "Christ disdaineth not to serve and worship Allah nor do the\n\t\t\tangels those nearest (to Allah): those who disdain His worship\n\t\t\tand are arrogant He will gather them all together unto himself to\n\t\t\t(answer). \u003cspan class=\u0027fn\u0027\u003e677\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e678\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "173",
        "Recitation":  "Alafasy_128kbps/004173",
        "Body":  "But those who believe and do deeds of righteousness He will give\n\t\t\ttheir (due) rewards and more out of His bounty: but those who are\n\t\t\tdisdainful and arrogant He will punish with a grievous penalty;\n\t\t\tnor will they find besides Allah any to protect or help them."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "174",
        "Recitation":  "Alafasy_128kbps/004174",
        "Body":  "O mankind! verily there hath come to you a convincing proof from\n\t\t\tyour Lord: for We have sent unto you a light (that is) manifest.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e678\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "175",
        "Recitation":  "Alafasy_128kbps/004175",
        "Body":  "Then those who believe in Allah and hold fast to Him soon will He\n\t\t\tadmit them to Mercy and Grace from Him and guide them to Himself\n\t\t\tby a straight Way. \u003cspan class=\u0027fn\u0027\u003e680\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "176",
        "Recitation":  "Alafasy_128kbps/004176",
        "Body":  "They ask thee for a legal decision.  Say: Allah directs (thus)\n\t\t\tabout those who leave no descendants or ascendants as heirs.  If\n\t\t\tit is a man that dies leaving a sister but no child she shall\n\t\t\thave half the inheritance: if (such a deceased was) a woman who\n\t\t\tleft no child her brother takes her inheritance: if there are two\n\t\t\tsisters they shall have two-thirds of the inheritance (between\n\t\t\tthem): if there are brothers and sisters (they share) the male\n\t\t\thaving twice the share of the female.  Thus doth Allah make clear\n\t\t\tto you (His law) lest ye err. And Allah hath knowledge of all\n\t\t\tthings. \u003cspan class=\u0027fn\u0027\u003e681\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/004018",
        "Body":  "Of no effect is the repentance of those who continue to do evil\n\t\t\tuntil death faces one of them and he says \"Now have I repented\n\t\t\tindeed\"; nor of those who die rejecting faith: for them have We\n\t\t\tprepared a punishment most grievous. \u003cspan class=\u0027fn\u0027\u003e526\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/004019",
        "Body":  "O ye who believe! ye are forbidden to inherit women against their\n\t\t\twill.  Nor should ye treat them with harshness that ye may take\n\t\t\taway part of the dower ye have given them except where they have\n\t\t\tbeen guilty of open lewdness; on the contrary live with them on a\n\t\t\tfooting of kindness and equity.  If ye take a dislike to them it\n\t\t\tmay be that ye dislike a thing and Allah brings about through it\n\t\t\ta great deal of good. \u003cspan class=\u0027fn\u0027\u003e527\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e528\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/004002",
        "Body":  "To orphans restore their property (when they reach their age) nor\n\t\t\tsubstitute (your) worthless things for (their) good ones; and\n\t\t\tdevour not their substance (by mixing it up) with your own.  For\n\t\t\tthis is indeed a great sin. \u003cspan class=\u0027fn\u0027\u003e507\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/004020",
        "Body":  "But if ye decide to take one wife in place of another even if ye\n\t\t\thad given the latter a whole treasure for dower take not the\n\t\t\tleast bit of it back: would ye take it by slander and a manifest\n\t\t\twrong? \u003cspan class=\u0027fn\u0027\u003e529\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/004021",
        "Body":  "And how could ye take it when ye have gone in unto each other and\n\t\t\tthey have taken from you a solemn covenant?"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/004022",
        "Body":  "And marry not women whom your fathers married except what is\n\t\t\tpast: it was shameful and odious an abominable custom indeed.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e530\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/004023",
        "Body":  "Prohibited to you (for marriage) are: your mother daughters\n\t\t\tsisters father\u0027s sisters mother\u0027s sisters; brother\u0027s daughters\n\t\t\tsister\u0027s daughters foster-mothers (who gave you suck)\n\t\t\tfoster-sisters; your wives\u0027 mothers; your step-daughters under\n\t\t\tyour guardianship born of your wives to whom ye have gone in no\n\t\t\tprohibition if ye have not gone in; (those who have been) wives\n\t\t\tof your sons proceeding from your loins; and two sisters in\n\t\t\twedlock at one and the same time except for what is past; for\n\t\t\tAllah is Oft-Forgiving Most Merciful. \u003cspan class=\u0027fn\u0027\u003e531\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e532\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e533\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e534\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e535\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e536\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/004024",
        "Body":  "Also (prohibited are) women already married except those whom\n\t\t\tyour right hands possess.  Thus hath Allah ordained\n\t\t\t(prohibitions) against you: except for these all others are\n\t\t\tlawful provided ye seek (them in marriage) with gifts from your\n\t\t\tproperty desiring chastity not lust.  Seeing that ye derive\n\t\t\tbenefit from them give them their dowers (at least) as\n\t\t\tprescribed; but if after a dower is prescribed ye agree mutually\n\t\t\t(to vary it) there is no blame on you and Allah is All-Knowing\n\t\t\tAll-Wise. \u003cspan class=\u0027fn\u0027\u003e537\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e538\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e539\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/004025",
        "Body":  "If any of you have not the means wherewith to wed free believing\n\t\t\twomen they may wed believing girls from among those whom your\n\t\t\tright hands possess: and Allah hath full knowledge about your\n\t\t\tfaith.\tYe are one from another: wed them with the leave of their\n\t\t\towners and give them their dowers according to what is\n\t\t\treasonable: they should be chaste not lustful nor taking\n\t\t\tparamours: when they are taken in wedlock if they fall into shame\n\t\t\ttheir punishment is half that for free women.  This (permission)\n\t\t\tis for those among you who fear sin; but it is better for you\n\t\t\tthat ye practice self-restraint: and Allah is Oft-forgiving Most\n\t\t\tMerciful. \u003cspan class=\u0027fn\u0027\u003e540\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/004026",
        "Body":  "Allah doth wish to make clear to you and to show you the\n\t\t\tordinances of those before you; and (He doth wish to) turn to you\n\t\t\t(in Mercy): and Allah is All-Knowing All-Wise."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/004027",
        "Body":  "Allah doth wish to turn to you but the wish of those who follow\n\t\t\ttheir lusts is that ye should turn away (from Him) far far away."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/004028",
        "Body":  "Allah doth wish to lighten your (difficulties): for man was\n\t\t\tcreated weak (in flesh)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/004029",
        "Body":  "O ye who believe! eat not up your property among yourselves in\n\t\t\tvanities: but let there be amongst you traffic and trade by\n\t\t\tmutual good-will: nor kill (or destroy) yourselves: for verily\n\t\t\tAllah hath been to you Most Merciful. \u003cspan class=\u0027fn\u0027\u003e541\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/004003",
        "Body":  "If ye fear that ye shall not be able to deal justly with the\n\t\t\torphans marry women of your choice two or three or four; but if\n\t\t\tye fear that ye shall not be able to deal justly (with them) then\n\t\t\tonly one or (a captive) that your right hands possess.\tThat will\n\t\t\tbe more suitable to prevent you from doing injustice.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e508\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e539\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/004030",
        "Body":  "If any do that in rancor and injustice soon shall We cast them\n\t\t\tinto the fire: and easy it is for Allah."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/004031",
        "Body":  "If ye (but) eschew the most heinous of the things which ye are\n\t\t\tforbidden to do We shall expel out of you all the evil in you and\n\t\t\tadmit you to a Gate of great honor."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/004032",
        "Body":  "And in no wise covet those things in which Allah hath bestowed\n\t\t\this gifts more freely on some of you than on others: to men is\n\t\t\tallotted what they earn and to women what they earn: but ask\n\t\t\tAllah of His bounty: for Allah hath full knowledge of all things.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e542\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/004033",
        "Body":  "To (benefit) everyone We have appointed sharers and heirs to\n\t\t\tproperty left by parents and relatives.  To those also to whom\n\t\t\tyour right hand was pledged give their due portion: for truly\n\t\t\tAllah is Witness to all things. \u003cspan class=\u0027fn\u0027\u003e543\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e544\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/004034",
        "Body":  "Men are the protectors and maintainers of women because Allah has\n\t\t\tgiven the one more (strength) than the other and because they\n\t\t\tsupport them from their means.\tTherefore the righteous women are\n\t\t\tdevoutly obedient and guard in (the husband\u0027s) absence what Allah\n\t\t\twould have them guard.\tAs to those women on whose part ye fear\n\t\t\tdisloyalty and ill-conduct admonish them (first) (next) refuse to\n\t\t\tshare their beds (and last) beat them (lightly); but if they\n\t\t\treturn to obedience seek not against them means (of annoyance):\n\t\t\tfor Allah is Most High Great (above you all). \u003cspan class=\u0027fn\u0027\u003e545\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e546\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e547\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e548\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/004035",
        "Body":  "If ye fear a breach between them twain appoint (two) arbiters one\n\t\t\tfrom his family and the other from hers; if they wish for peace\n\t\t\tAllah will cause their reconciliation: for Allah hath full\n\t\t\tknowledge and is acquainted with all things. \u003cspan class=\u0027fn\u0027\u003e549\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/004036",
        "Body":  "Serve Allah and join not any partners with Him: and do good to\n\t\t\tparents kinsfolk orphans those in need neighbors who are near\n\t\t\tneighbors who are strangers the companion by your side the\n\t\t\tway-farer (ye meet) and what your right hands possess: for Allah\n\t\t\tloveth not the arrogant the vainglorious; \u003cspan class=\u0027fn\u0027\u003e550\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e551\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e552\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e553\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e554\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/004037",
        "Body":  "(Nor) those who are niggardly or enjoin niggardliness on others\n\t\t\tor hide the bounties which Allah hath bestowed on them; for We\n\t\t\thave prepared for those who resist faith a punishment that steeps\n\t\t\tthem in contempt. \u003cspan class=\u0027fn\u0027\u003e555\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e556\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/004038",
        "Body":  "(Nor) those who spend of their substance to be seen of men but\n\t\t\thave no faith in Allah and the Last Day: if any take the Evil One\n\t\t\tfor their intimate what a dreadful intimate he is! \u003cspan class=\u0027fn\u0027\u003e557\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/004039",
        "Body":  "And what burden were it on them if they had faith in Allah and in\n\t\t\tthe Last Day and they spent out of what Allah hath given them for\n\t\t\tsustenance?  For Allah hath full Knowledge of them. \u003cspan class=\u0027fn\u0027\u003e558\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/004004",
        "Body":  "And give the women (on marriage) their dower as a free gift; but\n\t\t\tif they of their own good pleasure remit any part of it to you\n\t\t\ttake it and enjoy it with right good cheer."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/004040",
        "Body":  "Allah is never unjust in the least degree: if there is any good\n\t\t\t(done) He doubleth it and giveth from His own presence a great\n\t\t\treward. \u003cspan class=\u0027fn\u0027\u003e559\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/004041",
        "Body":  "How then if We brought from each people a witness and We brought\n\t\t\tthee as a witness against these people! \u003cspan class=\u0027fn\u0027\u003e560\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/004042",
        "Body":  "On that day those who reject faith and disobey the Apostle will\n\t\t\twish that the earth were made one with them: but never will they\n\t\t\thide a single fact from Allah! \u003cspan class=\u0027fn\u0027\u003e561\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/004043",
        "Body":  "O ye who believe! approach not prayers with a mind befogged until\n\t\t\tye can understand all that ye say nor in a state of ceremonial\n\t\t\timpurity (except when travelling on the road) until after washing\n\t\t\tyour whole body if ye are ill or on a journey or one of you\n\t\t\tcometh from offices of nature or ye have been in contact with\n\t\t\twomen and ye find no water then take for yourselves clean sand or\n\t\t\tearth and rub therewith your faces and hands.  For Allah doth\n\t\t\tblot out sins and forgive again and again. \u003cspan class=\u0027fn\u0027\u003e562\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e563\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/004044",
        "Body":  "Hast thou not turned thy vision to those who were given a portion\n\t\t\tof the Book?  They traffic in error and wish that ye should lose\n\t\t\tthe right path. \u003cspan class=\u0027fn\u0027\u003e564\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/004045",
        "Body":  "But Allah hath full knowledge of your enemies: Allah is enough\n\t\t\tfor a protector and Allah is enough for a Helper."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/004046",
        "Body":  "Of the Jews there are those who displace words from their (right)\n\t\t\tplaces and say: \"We hear and we disobey\"; and \"Hear what is not\n\t\t\theard\": and \"Ra`ina\"; with a twist of their tongues and a slander\n\t\t\tto faith.  If only they had said: \"We hear and we obey\"; and \"Do\n\t\t\thear\"; and \"Do look at us\": it would have been better for them\n\t\t\tand more proper; but Allah hath cursed them for their unbelief;\n\t\t\tand but few of them will believe. \u003cspan class=\u0027fn\u0027\u003e565\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e566\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/004047",
        "Body":  "O ye people of the Book! believe in what We have (now) revealed\n\t\t\tconfirming what was (already) with you before We change the face\n\t\t\tand fame of some (of you) beyond all recognition and turn them\n\t\t\thindwards or curse them as We cursed the Sabbath-breakers: for\n\t\t\tthe decision of Allah must be carried out. \u003cspan class=\u0027fn\u0027\u003e567\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e568\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/004048",
        "Body":  "Allah forgiveth not that partners should be set up with him; but\n\t\t\tHe forgiveth anything else to whom He pleaseth; to set up\n\t\t\tpartners with Allah is to devise a sin most heinous indeed.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e569\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/004049",
        "Body":  "Hast thou not turned thy vision to those who claim sanctity for\n\t\t\tthemselves?  Nay but Allah doth sanctify whom He pleaseth but\n\t\t\tnever will they fail to receive justice in the least little\n\t\t\tthing. \u003cspan class=\u0027fn\u0027\u003e570\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e571\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/004005",
        "Body":  "To those weak of understanding make not over your property which\n\t\t\tAllah hath made a means of support for you but feed and clothe\n\t\t\tthem therewith and speak to them words of kindness and justice.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e510\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e511\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/004050",
        "Body":  "Behold! how they invent a lie against Allah! but that by itself\n\t\t\tis a manifest sin!"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/004051",
        "Body":  "Hast thou not turned thy vision to those who were given a portion\n\t\t\tof the Book?  They believe in sorcery and evil and say to the\n\t\t\tunbelievers that they are better guided in the (right) way than\n\t\t\tthe believers! \u003cspan class=\u0027fn\u0027\u003e572\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e573\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/004052",
        "Body":  "They are (men) whom Allah hath cursed: and those whom Allah hath\n\t\t\tcursed thou wilt find have no one to help. \u003cspan class=\u0027fn\u0027\u003e574\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/004053",
        "Body":  "Have they a share in dominion or power?  Behold they give not a\n\t\t\tfarthing to their fellow-men! \u003cspan class=\u0027fn\u0027\u003e575\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/004054",
        "Body":  "Or do they envy mankind for what Allah hath given them of His\n\t\t\tbounty? But We had already given the people of Abraham the Book\n\t\t\tand Wisdom and conferred upon them a great kingdom. \u003cspan class=\u0027fn\u0027\u003e576\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/004055",
        "Body":  "Some of them believed and some of them averted their faces from\n\t\t\thim: and enough is hell for a burning fire. \u003cspan class=\u0027fn\u0027\u003e577\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/004056",
        "Body":  "Those who reject Our Signs We shall soon cast into the fire: as\n\t\t\toften as their skins are roasted through We shall change them for\n\t\t\tfresh skins that they may taste the penalty: for Allah is Exalted\n\t\t\tin Power Wise."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/004057",
        "Body":  "But those who believe and do deeds of righteousness We shall soon\n\t\t\tadmit to gardens with rivers flowing beneath their eternal home:\n\t\t\ttherein shall they have companions pure and holy: We shall admit\n\t\t\tthem to shades cool and ever deepening. \u003cspan class=\u0027fn\u0027\u003e578\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e579\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/004058",
        "Body":  "Allah doth command you to render back your trusts to those to\n\t\t\twhom they are due; and when ye judge between man and man that ye\n\t\t\tjudge with justice: verily how excellent is the teaching which He\n\t\t\tgiveth you! for Allah is He who heareth and seeth all things."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/004059",
        "Body":  "O ye who believe! obey Allah and obey the Apostle and those\n\t\t\tcharged with authority among you.  If ye differ in anything among\n\t\t\tyourselves refer it to Allah and His Apostle if ye do believe in\n\t\t\tAllah and the Last Day: that is best and most suitable for final\n\t\t\tdetermination. \u003cspan class=\u0027fn\u0027\u003e580\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/004006",
        "Body":  "Make trial of orphans until they reach the age of marriage; if\n\t\t\tthen ye find sound judgment in them release their property to\n\t\t\tthem; but consume it not wastefully nor in haste against their\n\t\t\tgrowing up.  If the guardian is well-off let him claim no\n\t\t\tremuneration but if he is poor let him have for himself what is\n\t\t\tjust and reasonable.  When ye release their property to them take\n\t\t\twitnesses in their presence: but all-sufficient is Allah in\n\t\t\ttaking account. \u003cspan class=\u0027fn\u0027\u003e512\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e513\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/004060",
        "Body":  "Hast thou not turned thy vision to those who declare that they\n\t\t\tbelieve in the revelations that have come to thee and to those\n\t\t\tbefore thee? Their (real) wish is to resort together for judgment\n\t\t\t(in their disputes) to the Evil One though they were ordered to\n\t\t\treject him. But Satan\u0027s wish is to lead them astray far away\n\t\t\t(from the Right). \u003cspan class=\u0027fn\u0027\u003e581\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/004061",
        "Body":  "When it is said to them: \"Come to what Allah hath revealed and to\n\t\t\tthe Apostle\": thou seest the Hypocrites avert their faces from\n\t\t\tthee in disgust."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/004062",
        "Body":  "How then when they are seized by misfortune because of the deeds\n\t\t\twhich their hands have sent forth?  Then they come to thee\n\t\t\tswearing by Allah: \"We meant no more than good-will and\n\t\t\tconciliation!\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/004063",
        "Body":  "Those men Allah knows what is in their hearts; so keep clear of\n\t\t\tthem but admonish them and speak to them a word to reach their\n\t\t\tvery souls. \u003cspan class=\u0027fn\u0027\u003e582\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/004064",
        "Body":  "We sent not an Apostle but to be obeyed in accordance with the\n\t\t\twill of Allah.\tIf they had only when they were unjust to\n\t\t\tthemselves come unto thee and asked Allah\u0027s forgiveness and the\n\t\t\tApostle had asked forgiveness for them they would have found\n\t\t\tAllah indeed Oft-Returning most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/004065",
        "Body":  "But no by thy Lord they can have no (real) Faith until they make\n\t\t\tthee judge in all disputes between them and find in their souls\n\t\t\tno resistance against thy decisions but accept them with the\n\t\t\tfullest conviction. \u003cspan class=\u0027fn\u0027\u003e583\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/004066",
        "Body":  "If We had ordered them to sacrifice their lives or to leave their\n\t\t\thomes very few of them would have done it: but if they had done\n\t\t\twhat they were (actually) told it would have been best for them\n\t\t\tand would have gone farthest to strengthen their (faith).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e584\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/004067",
        "Body":  "And We should then have given them from Our Presence a great\n\t\t\treward."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/004068",
        "Body":  "And We should have shown them the Straight Way. \u003cspan class=\u0027fn\u0027\u003e585\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/004069",
        "Body":  "All who obey Allah and the Apostle are in the company of those on\n\t\t\twhom is the Grace of Allah of the Prophets (who teach) the\n\t\t\tsincere (lovers of truth) the witnesses (who testify) and the\n\t\t\trighteous (who do good): ah! what a beautiful fellowship!\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e586\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/004007",
        "Body":  "From what is left by parents and those nearest related there is a\n\t\t\tshare for men and a share for women whether the property be small\n\t\t\tor large a determinate share. \u003cspan class=\u0027fn\u0027\u003e514\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/004070",
        "Body":  "Such is the Bounty from Allah: and sufficient is it that Allah\n\t\t\tknoweth all. \u003cspan class=\u0027fn\u0027\u003e587\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/004071",
        "Body":  "O ye who believe! take your precautions and either go forth in\n\t\t\tparties or go forth all together. \u003cspan class=\u0027fn\u0027\u003e588\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/004072",
        "Body":  "There are certainly among you men who would tarry behind: if a\n\t\t\tmisfortune befalls you,  They say: \"Allah did favor us in that we\n\t\t\twere not present among them.\" \u003cspan class=\u0027fn\u0027\u003e589\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/004073",
        "Body":  "But if good fortune comes to you from Allah they would be sure to\n\t\t\tsay as if there had never been ties of affection between you and\n\t\t\tthem \"Oh! I wish I had been with them; a fine thing should I then\n\t\t\thave made of it!\" \u003cspan class=\u0027fn\u0027\u003e590\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/004074",
        "Body":  "Let those fight in the cause of Allah who sell the life of this\n\t\t\tworld for the Hereafter. To him who fighteth in the cause of\n\t\t\tAllah whether he is slain or gets victory soon shall We give him\n\t\t\ta reward of great (value). \u003cspan class=\u0027fn\u0027\u003e591\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/004075",
        "Body":  "And why should ye not fight in the cause of Allah and of those\n\t\t\twho being weak are ill-treated (and oppressed)?  Men women and\n\t\t\tchildren whose cry is: \"Our Lord! rescue us from this town whose\n\t\t\tpeople are oppressors; and raise for us from Thee one who will\n\t\t\tprotect; and raise for us from Thee one who will help!\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e592\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e593\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/004076",
        "Body":  "Those who believe fight in the cause of Allah and those who\n\t\t\treject faith fight in the cause of evil: so fight ye against the\n\t\t\tfriends of Satan: feeble indeed is the cunning of Satan.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e594\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/004077",
        "Body":  "Hast thou not turned thy vision to those who were told to hold\n\t\t\tback their hands (from fight) but establish regular prayers and\n\t\t\tspend in regular charity?  When (at length) the order for\n\t\t\tfighting was issued to them behold! a section of them feared men\n\t\t\tas or even more than they should have feared Allah: they say:\n\t\t\t\"Our Lord! why hast Thou ordered us to fight?  Wouldst Thou not\n\t\t\tgrant us respite to our (natural) term near (enough)?\"\tSay:\n\t\t\t\"Short is the enjoyment of this world: the Hereafter is the best\n\t\t\tfor those who do right: never will ye be dealt with unjustly in\n\t\t\tthe very least! \u003cspan class=\u0027fn\u0027\u003e595\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e596\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/004078",
        "Body":  "\"Wherever ye are death will find you out even if ye are in towers\n\t\t\tbuilt up strong and high!\"  If some good befalls them they say\n\t\t\t\"This is from Allah\"; but if evil they say \"this is from thee\" (O\n\t\t\tProphet). Say: \"All things are from Allah.  But what hath come to\n\t\t\tthese people that they fail to understand a single fact?\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e597\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/004079",
        "Body":  "Whatever good (O man!) happens to thee is from Allah; but\n\t\t\twhatever evil happens to thee is from thy (own) soul.  And We\n\t\t\thave sent thee as an Apostle to (instruct) mankind: and enough is\n\t\t\tAllah for a witness. \u003cspan class=\u0027fn\u0027\u003e598\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/004008",
        "Body":  "But if at the time of division other relatives of orphans or poor\n\t\t\tare present feed them out of the (property) and speak to them\n\t\t\twords of kindness and justice."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/004080",
        "Body":  "He who obeys the Apostle obeys Allah: but if any turn away We\n\t\t\thave not sent thee to watch over their (evil deeds). \u003cspan class=\u0027fn\u0027\u003e599\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/004081",
        "Body":  "They have \"Obedience\" on their lips; but when they leave thee a\n\t\t\tsection of them meditate all night on things very different from\n\t\t\twhat thou tellest them but Allah records their nightly (plots):\n\t\t\tso keep clear of them and put thy trust in Allah; and enough is\n\t\t\tAllah as a Disposer of affairs. \u003cspan class=\u0027fn\u0027\u003e600\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/004082",
        "Body":  "Do they not consider the Qur\u0027an (with care)?  Had it been from\n\t\t\tother than Allah they would surely have found therein much\n\t\t\tdiscrepancy. \u003cspan class=\u0027fn\u0027\u003e601\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/004083",
        "Body":  "When there comes to them some matter touching (public) safety or\n\t\t\tfear they divulge it.  If they had only referred it to the\n\t\t\tApostle or to those charged with authority among them the proper\n\t\t\tinvestigators would have tested it from them (direct).\tWere it\n\t\t\tnot for the Grace and Mercy of Allah unto you all but a few of\n\t\t\tyou would have fallen into the clutches of Satan. \u003cspan class=\u0027fn\u0027\u003e602\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/004084",
        "Body":  "Then fight in Allah\u0027s cause thou art held responsible only for\n\t\t\tthyself and rouse the believers.  It may be that Allah will\n\t\t\trestrain the fury of the unbelievers: for Allah is the strongest\n\t\t\tin might and in punishment. \u003cspan class=\u0027fn\u0027\u003e603\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/004085",
        "Body":  "Whoever recommends and helps a good cause becomes a partner\n\t\t\ttherein: and whoever recommends and helps an evil cause shares in\n\t\t\tits burden: and Allah hath power over all things. \u003cspan class=\u0027fn\u0027\u003e604\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/004086",
        "Body":  "When a (courteous) greeting is offered you meet it with a\n\t\t\tgreeting still more courteous (at least) of equal courtesy. \n\t\t\tAllah takes careful account of all things. \u003cspan class=\u0027fn\u0027\u003e605\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/004087",
        "Body":  "Allah! there is no god but He: of a surety He will gather you\n\t\t\ttogether against the Day of Judgment about which there is no\n\t\t\tdoubt.\tAnd whose word can be truer than Allah\u0027s?"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/004088",
        "Body":  "Why should ye be divided into two parties about the hypocrites? \n\t\t\tAllah hath upset them for their (evil) deeds.  Would ye guide\n\t\t\tthose whom Allah hath thrown out of the way?  For those whom\n\t\t\tAllah hath thrown out of the way never shalt thou find the way.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e606\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "89",
        "Recitation":  "Alafasy_128kbps/004089",
        "Body":  "They but wish that ye should reject faith as they do and thus be\n\t\t\ton the same footing (as they): but take not friends from their\n\t\t\tranks until they flee in the way of Allah (from what is\n\t\t\tforbidden).  But if they turn renegades seize them and slay them\n\t\t\twherever ye find them; and (in any case) take no friends or\n\t\t\thelpers from their ranks. \u003cspan class=\u0027fn\u0027\u003e607\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/004009",
        "Body":  "Let those (disposing of an estate) have the same fear in their\n\t\t\tminds as they would have for their own if they had left a\n\t\t\thelpless family behind: let them fear Allah and speak words of\n\t\t\tappropriate (comfort). \u003cspan class=\u0027fn\u0027\u003e515\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "90",
        "Recitation":  "Alafasy_128kbps/004090",
        "Body":  "Except those who join a group between whom and you there is a\n\t\t\ttreaty (of peace) or those who approach you with hearts\n\t\t\trestraining them from fighting you as well as fighting their own\n\t\t\tpeople.  If Allah had pleased He could have given them power over\n\t\t\tyou and they would have fought you: therefore if they withdraw\n\t\t\tfrom you but fight you not and (instead) send you (guarantees of)\n\t\t\tpeace then Allah hath opened no way for you (to war against\n\t\t\tthem). \u003cspan class=\u0027fn\u0027\u003e608\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e608\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "91",
        "Recitation":  "Alafasy_128kbps/004091",
        "Body":  "Others you will find that wish to gain your confidence as well as\n\t\t\tthat of their people: every time they are sent back to temptation\n\t\t\tthey succumb thereto: if they withdraw not from you nor give you\n\t\t\t(guarantees) of peace besides restraining their hands seize them\n\t\t\tand slay them.\tWherever ye get them: in their case We have\n\t\t\tprovided you with a clear argument against them. \u003cspan class=\u0027fn\u0027\u003e610\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "92",
        "Recitation":  "Alafasy_128kbps/004092",
        "Body":  "Never should a believer kill a believer; but (if it so happens)\n\t\t\tby mistake (compensation is due): if one (so) kills a believer it\n\t\t\tis ordained that he should free a believing slave and pay\n\t\t\tcompensation to the deceased\u0027s family unless they remit it\n\t\t\tfreely.  If the deceased belonged to a people at war with you and\n\t\t\the was a believer the freeing of a believing slave (is enough). \n\t\t\tIf he belonged to a people with whom ye have a treaty of mutual\n\t\t\talliance compensation should be paid to his family and a\n\t\t\tbelieving slave be freed.  For those who find this beyond their\n\t\t\tmeans (is prescribed) a fast for two months running: by way of\n\t\t\trepentance to Allah: for Allah hath all knowledge and all wisdom.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e611\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "93",
        "Recitation":  "Alafasy_128kbps/004093",
        "Body":  "If a man kills a believer intentionally his recompense is Hell to\n\t\t\tabide therein (for ever): and the wrath and the curse of Allah\n\t\t\tare upon him and a dreadful penalty is prepared for him.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e612\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "94",
        "Recitation":  "Alafasy_128kbps/004094",
        "Body":  "O ye who believe! when ye go abroad in the cause of Allah\n\t\t\tinvestigate carefully and say not to anyone who offers you a\n\t\t\tsalutation: \"Thou art none of a believer!\"  Coveting the\n\t\t\tperishable goods of this life: with Allah are profits and spoils\n\t\t\tabundant.  Even thus were ye yourselves before till Allah\n\t\t\tconferred on you His favors: therefore carefully investigate for\n\t\t\tAllah is well aware of all that ye do. \u003cspan class=\u0027fn\u0027\u003e613\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "95",
        "Recitation":  "Alafasy_128kbps/004095",
        "Body":  "Not equal are those believers who sit (at home) and receive no\n\t\t\thurt and those who strive and fight in the cause of Allah with\n\t\t\ttheir goods and their persons.\tAllah hath granted a grade higher\n\t\t\tto those who strive and fight with their goods and persons than\n\t\t\tto those who sit (at home): unto all (in faith) hath Allah\n\t\t\tpromised good: but those who strive and fight hath He\n\t\t\tdistinguished above those who sit (at home) by a special\n\t\t\treward.-- \u003cspan class=\u0027fn\u0027\u003e614\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "96",
        "Recitation":  "Alafasy_128kbps/004096",
        "Body":  "Ranks specially bestowed by Him and Forgiveness and Mercy.  For\n\t\t\tAllah is Oft-Forgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "97",
        "Recitation":  "Alafasy_128kbps/004097",
        "Body":  "When angels take the souls of those who die in sin against their\n\t\t\tsouls they say: \"In what (plight) were ye?\"  They reply: \"Weak\n\t\t\tand oppressed were we in the earth.\"  They say: \"Was not the\n\t\t\tearth of Allah spacious enough for you to move yourselves away\n\t\t\t(from evil)?\"  Such men will find their abode in Hell what an\n\t\t\tevil refuge! \u003cspan class=\u0027fn\u0027\u003e615\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "98",
        "Recitation":  "Alafasy_128kbps/004098",
        "Body":  "Except those who are (really) weak and oppressed men women and\n\t\t\tchildren who have no means in their power nor (a guide-post) to\n\t\t\tdirect their way. \u003cspan class=\u0027fn\u0027\u003e616\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "4",
        "AyahNumber":  "99",
        "Recitation":  "Alafasy_128kbps/004099",
        "Body":  "For these there is hope that Allah will forgive: for Allah doth\n\t\t\tblot out (sins) and forgive again and again."
    }
]
