[
  {
    "SurahNumber": "92",
    "AyahNumber": "3",
    "NoteID": "1",
    "Body": "Lit., \"Consider that which has created [or \"creates\"] the\\n\\t\\t\\t\\tmale and the female\", i.e., the elements which are\\n\\t\\t\\t\\tresponsible for the differentiation between male and\\n\\t\\t\\t\\tfemale. This, together with the symbolism of night and\\n\\t\\t\\t\\tday, darkness and light, is an allusion - similar to the\\n\\t\\t\\t\\tfirst ten verses of the preceding surah - to the polarity\\n\\t\\t\\t\\tevident in all nature and, hence, to the dichotomy\\n\\t\\t\\t\\t(spoken of in the next verse) which characterises man's\\n\\t\\t\\t\\taims and motives."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "4",
    "NoteID": "2",
    "Body": "I.e., at good and bad ends (cf. note [6] on  91:8 ) -\\n\\t\\t\\t\\tsc., \"and so the consequences of your doings are, of\\n\\t\\t\\t\\tnecessity, divergent\"."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "6",
    "NoteID": "3",
    "Body": "I.e., in moral values independent of time and social\\n\\t\\t\\t\\tcircumstance and, hence, in the absolute validity of what\\n\\t\\t\\t\\tmay be described as \"the moral imperative\"."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "See note [6] on  87:8 ."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "8",
    "NoteID": "5",
    "Body": "Cf.{96:6-7}."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "11",
    "NoteID": "6",
    "Body": "Or (as a statement): \"of no avail will be to him his\\n\\t\\t\\t\\twealth when he...\", etc."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "13",
    "NoteID": "7",
    "Body": "This statement is meant to stress the fact that man's\\n\\t\\t\\t\\tlife in this world and in the hereafter are but two\\n\\t\\t\\t\\tstages of one continuous entity."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "19",
    "NoteID": "8",
    "Body": "Lit., \"no one having with him any favour to be repaid\".\\n\\t\\t\\t\\tIn its widest sense, projected towards the future, the\\n\\t\\t\\t\\tphrase implies also the expectation of a reward."
  }
]
