[
  {
    "SurahNumber": "13",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "Although some commentators are of the opinion that the\\n\\t\\t\\t\\tterm kitab (\"divine writ\" or \"revelation\") refers here to\\n\\t\\t\\t\\tthis particular surah, Ibn'Abbas states emphatically that\\n\\t\\t\\t\\tit denotes the Qur'an as a whole (Baghawi)."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "1",
    "NoteID": "3",
    "Body": "This passage connects with the concluding verses\\n\\t\\t\\t\\t(102-111) of the preceding surah, and particularly with\\n\\t\\t\\t\\tverse {103}, all of which stress the divine origin of the\\n\\t\\t\\t\\tQur'an."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "2",
    "NoteID": "4",
    "Body": "For an explanation of this phrase, see surah {7}, note\\n\\t\\t\\t\\t[43]. As regards the \"raising of the heavens without any\\n\\t\\t\\t\\tsupports\" visible to man, it should be borne in mind that\\n\\t\\t\\t\\tthe noun sama' denotes, primarily, \"something that is\\n\\t\\t\\t\\tabove [another thing]\", and is used - mostly in its\\n\\t\\t\\t\\tplural form samawat - to describe (a) the visible skies\\n\\t\\t\\t\\t(as well as, occasionally, the clouds), (b) the cosmic\\n\\t\\t\\t\\tspace in which the stars, the solar systems (including\\n\\t\\t\\t\\tour own) and the galaxies pursue their course. and (c)\\n\\t\\t\\t\\tthe abstract concept of the forces emanating from God\\n\\t\\t\\t\\t(since He is, in the metonymical sense of this word,\\n\\t\\t\\t\\t\"above\" all that exists]. To my mind, it is the second of\\n\\t\\t\\t\\tthese three meanings of samawat to which the above verse\\n\\t\\t\\t\\trefers: namely, to the spatial universe in which all\\n\\t\\t\\t\\taggregations of matter - be they planets, stars, nebulae\\n\\t\\t\\t\\tor galaxies - are, as it were, \"suspended\" in space\\n\\t\\t\\t\\twithin a system of unceasing motion determined by\\n\\t\\t\\t\\tcentrifugal forces and mutual, gravitational attraction."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "2",
    "NoteID": "5",
    "Body": "This may refer either to the end of the world as we know\\n\\t\\t\\t\\tit - thus indicating the finality of all creation - or,\\n\\t\\t\\t\\taccording to 'Abd Allah ibn 'Abbas (as quoted by Baghawi\\n\\t\\t\\t\\tand Razi), to the \"mansions\" or stages through which the\\n\\t\\t\\t\\tsun and the moon, like all other celestial bodies, move\\n\\t\\t\\t\\tin time as well as in space."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "2",
    "NoteID": "6",
    "Body": "I.e., \"so that you might realize that He who has created\\n\\t\\t\\t\\tthe universe and governs all that exists is equally able\\n\\t\\t\\t\\tto resurrect the dead, and to judge you in the life to\\n\\t\\t\\t\\tcome in accordance with what you did when you were alive\\n\\t\\t\\t\\ton earth\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "3",
    "NoteID": "7",
    "Body": "Lit., \"and out of all [kinds of] fruits He made thereon\\n\\t\\t\\t\\t[i.e., on earth] pairs (zawjayn ithnayn)\". The term zawj\\n\\t\\t\\t\\tdenotes, according to the context, either \"a pair\" or\\n\\t\\t\\t\\t\"one of a pair\". Whenever the dual form zawjan is\\n\\t\\t\\t\\tfollowed by the additional numerical definition ithnan\\n\\t\\t\\t\\t(\"two\"), it invariably signifies \"a pair comprising both\\n\\t\\t\\t\\tsexes\". Thus, the above phrase states that there are two\\n\\t\\t\\t\\tsexes to every kind of plant: a statement fully in accord\\n\\t\\t\\t\\twith botanical science. (Usually. the male and female\\n\\t\\t\\t\\torgans of reproduction exist together in one and the same\\n\\t\\t\\t\\tflower of a particular plant, e.g., cotton;\\n\\t\\t\\t\\talternatively, they are placed in separate flowers of one\\n\\t\\t\\t\\tand the same plant, e.g., in most of the cucurbitaceae;\\n\\t\\t\\t\\tand, in some rare cases, e.g., the date-palm, in entirely\\n\\t\\t\\t\\tseparate, uni-sexual plants of the same species.)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "4",
    "NoteID": "8",
    "Body": "I.e., regarding the nature of the soil, fertility and\\n\\t\\t\\t\\tkind of vegetation. The necessity of this\\n\\t\\t\\t\\tinterpolation - which, in the consensus of all\\n\\t\\t\\t\\tcommentators, conveys the meaning of the above phrase -\\n\\t\\t\\t\\tbecomes apparent from the subsequent clauses."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "4",
    "NoteID": "9",
    "Body": "Lit., \"non-clustered\" (ghayr sinwan) - i.e., each tree\\n\\t\\t\\t\\thaving separate roots."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "4",
    "NoteID": "10",
    "Body": "Cf.  6:99  and {141}, where a similar stress is laid on\\n\\t\\t\\t\\tthe multiformity of plants - and their varying\\n\\t\\t\\t\\tbeneficence to man and animal - as some of the signs of\\n\\t\\t\\t\\tGod's purposeful, creative activity."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "5",
    "NoteID": "11",
    "Body": "I.e., while it is amazing that one can refuse to believe\\n\\t\\t\\t\\tin God despite all the evidence, accessible to human\\n\\t\\t\\t\\tobservation, of the existence of a definite purpose in\\n\\t\\t\\t\\tall life-phenomena, and thus of the existence of a\\n\\t\\t\\t\\tconscious Creative Power, it is no less amazing to see\\n\\t\\t\\t\\tpeople who, while vaguely believing in God, can yet\\n\\t\\t\\t\\trefuse to believe in individual resurrection: for, if God\\n\\t\\t\\t\\thas created the universe and the phenomenon of life as\\n\\t\\t\\t\\tsuch, He obviously has the power to re-create life - and\\n\\t\\t\\t\\tits requisite physical vehicle - in a new act of\\n\\t\\t\\t\\tcreation."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "5",
    "NoteID": "12",
    "Body": "By denying the possibility of resurrection, they\\n\\t\\t\\t\\timplicitly deny God's almightiness, and thus, in effect,\\n\\t\\t\\t\\tHis reality."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "5",
    "NoteID": "13",
    "Body": "A metaphor of man's wilful self-abandonment to false\\n\\t\\t\\t\\tvalues and evil ways, and of the resulting enslavement of\\n\\t\\t\\t\\tthe spirit (cf. Zamakhshari, Razi, Baydawi). See also\\n\\t\\t\\t\\tsurah {34}, note [44]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "6",
    "NoteID": "14",
    "Body": "Lit., \"they ask thee to hasten the evil before the good\":\\n\\t\\t\\t\\ti.e., instead of willingly accepting the guidance offered\\n\\t\\t\\t\\tthem by the Prophet, they mockingly challenge him to\\n\\t\\t\\t\\tbring about the exemplary punishment with which,\\n\\t\\t\\t\\taccording to him, God threatens them. (For a fuller\\n\\t\\t\\t\\texplanation of this \"challenge\", referred to here and in\\n\\t\\t\\t\\tseveral other places in the Qur'an, see {6:57-58} and\\n\\t\\t\\t\\t 8:32 , as well as the corresponding notes.)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "6",
    "NoteID": "15",
    "Body": "Cf. the first sentence of  10:11  and the corresponding\\n\\t\\t\\t\\tnote [17]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "7",
    "NoteID": "16",
    "Body": "I.e., to prove that he (Muhammad) is really a prophet\\n\\t\\t\\t\\tinspired by God. But the Qur'an makes it clear in several\\n\\t\\t\\t\\tplaces (e.g.,  6:7  and {111}, {10:96-97} or  13:31 )\\n\\t\\t\\t\\tthat even a miracle would not convince those who are\\n\\t\\t\\t\\t\"bent on denying the truth\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "7",
    "NoteID": "17",
    "Body": "According to the classical commentators, this sentence\\n\\t\\t\\t\\tlends itself to several interpretations: (1) \"Thou art\\n\\t\\t\\t\\tonly a warner; and every nation has had a guide like thee\\n\\t\\t\\t\\t(i.e., a prophet)\" - which would be in consonance with\\n\\t\\t\\t\\tthe Qur'anic doctrine of the continuity of prophetic\\n\\t\\t\\t\\tguidance; or (2) \"Thou art only a warner - but [at the\\n\\t\\t\\t\\tsame time] also a guide unto all people\" - which would\\n\\t\\t\\t\\tstress the universality of the Qur'anic message as\\n\\t\\t\\t\\tcontrasted with the time-bound and ethnically limited\\n\\t\\t\\t\\tmissions of the earlier prophets; or (3) \"Thou art only a\\n\\t\\t\\t\\twarner bound to do no more than deliver the message\\n\\t\\t\\t\\tentrusted to thee, while it is God alone who can truly\\n\\t\\t\\t\\tguide men's hearts towards faith\". Since the last of the\\n\\t\\t\\t\\tabove three interpretations is the most plausible and\\n\\t\\t\\t\\thas, moreover the support of 'Abd Allah ibn'Abbas, Sa'id\\n\\t\\t\\t\\tibn Jubayr, Mujahid and Ad-Dahhak, I have adopted it in\\n\\t\\t\\t\\tmy rendering. According to Zamakhshari, this\\n\\t\\t\\t\\tinterpretation is further strengthened by the subsequent\\n\\t\\t\\t\\treference to God's omniscience."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "8",
    "NoteID": "18",
    "Body": "The term untha denotes any female being, whether human or\\n\\t\\t\\t\\tanimal. The \"falling short\" may refer either to a\\n\\t\\t\\t\\tshortening of the usual period of gestation (e.g., to\\n\\t\\t\\t\\tseven months in human beings) or to a falling short of\\n\\t\\t\\t\\tthe completion of pregnancy, i.e., a miscarriage; it is\\n\\t\\t\\t\\tto be noted that the noun ghayd signifies \"an abortive\\n\\t\\t\\t\\tfoetus\" (Taj al-'Arus), i.e., in human beings, a foetus\\n\\t\\t\\t\\tless than seven months old. The \"increase\", on the other\\n\\t\\t\\t\\thand, may mean either the completion of gestation or its\\n\\t\\t\\t\\tbeing in excess of the average period (as, for instance,\\n\\t\\t\\t\\tthe occasional lengthening of human pregnancy from the\\n\\t\\t\\t\\tusual period of about 280 days to 305 or, according to\\n\\t\\t\\t\\tsome medical authorities, even 307 days). In addition to\\n\\t\\t\\t\\tthis, God's knowledge of \"what any female bears [in her\\n\\t\\t\\t\\twomb]\" obviously relates also to the sex of the unborn\\n\\t\\t\\t\\tembryo as well as to the number of offspring involved in\\n\\t\\t\\t\\tone pregnancy. - As the sequence shows, this reference to\\n\\t\\t\\t\\tthe mysteries of gestation, fully known only to God, is\\n\\t\\t\\t\\tmeant to bring out the idea that He who knows what is in\\n\\t\\t\\t\\tthe wombs knows also the innermost disposition of every\\n\\t\\t\\t\\thuman being and the direction in which that human being\\n\\t\\t\\t\\twill develop."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "8",
    "NoteID": "19",
    "Body": "Lit., \"according to a measure\" (bi-miqdar) - i.e., in\\n\\t\\t\\t\\taccordance with the particular purpose for which it has\\n\\t\\t\\t\\tbeen created, the exigencies of its existence and the\\n\\t\\t\\t\\trole which it is destined to play within God's plan of\\n\\t\\t\\t\\tcreation."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "9",
    "NoteID": "20",
    "Body": "See surah {6}, note [65]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "9",
    "NoteID": "21",
    "Body": "God's attribute al-muta'al, which occurs in the Qur'an\\n\\t\\t\\t\\tonly in this one instance, denotes His infinite\\n\\t\\t\\t\\texaltedness above anything existing or potential; also,\\n\\t\\t\\t\\taccording to Zamakhshari, above anything that could be\\n\\t\\t\\t\\tcircumscribed by human definitions. (See in this\\n\\t\\t\\t\\tconnection the last sentence of  6:100  and the\\n\\t\\t\\t\\tcorresponding note [88].)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "10",
    "NoteID": "22",
    "Body": "The term qawl denotes, primarily, \"a saying\" or \"an\\n\\t\\t\\t\\tutterance\", but it is also used tropically in the sense\\n\\t\\t\\t\\tof \"an idea\", irrespective of whether it is expressed in\\n\\t\\t\\t\\tactual words (as a statement an assertion, a formulated\\n\\t\\t\\t\\tdoctrine, etc.) or merely conceived in the mind (e.g., an\\n\\t\\t\\t\\topinion, a view, or a connected set of ideas). Since in\\n\\t\\t\\t\\tthe above verse this term obviously refers to unspoken\\n\\t\\t\\t\\tthoughts, I have rendered it accordingly."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "10",
    "NoteID": "23",
    "Body": "Lit., \"and goes forth by day\" - i.e., commits evil deeds\\n\\t\\t\\t\\topenly (Ibn 'Abbas, as quoted by Baghawi and Razi). In\\n\\t\\t\\t\\tthe Arabic construction, the sentence reads thus: \"All\\n\\t\\t\\t\\talike [to Him] is he from among you who conceals his\\n\\t\\t\\t\\tthought (al-qawl) and he who brings it into the open, as\\n\\t\\t\\t\\twell as he who...,\" etc."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "11",
    "NoteID": "24",
    "Body": "Lit., \"from between his hands and from behind him\". As in\\n\\t\\t\\t\\t 2:255 , the expression \"between his hands\" denotes\\n\\t\\t\\t\\t\"something that is perceivable by him\" or \"evident to\\n\\t\\t\\t\\thim\", while that which is \"behind him\" is a metonym for\\n\\t\\t\\t\\tsomething \"beyond his ken\" or \"hidden from him\". See also\\n\\t\\t\\t\\tnext note."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "11",
    "NoteID": "25",
    "Body": "Lit., \"from God's command (amr)\". The rendering of the\\n\\t\\t\\t\\tabove passage hinges on the meaning given to the term\\n\\t\\t\\t\\tmu'aqqibat - a double plural of mu'aqqib, which signifies\\n\\t\\t\\t\\t\"something that comes immediately after another thing\" or\\n\\t\\t\\t\\t\"succeeds another thing without interruption\". Most of\\n\\t\\t\\t\\tthe classical commentators understand by mu'aqqibat\\n\\t\\t\\t\\t\"hosts of angels\", i.e., the recording angels who attend\\n\\t\\t\\t\\ton every human being, succeeding one another without\\n\\t\\t\\t\\tinterruption. Consequently, they interpret the phrase min\\n\\t\\t\\t\\tbayni yadayhi wa-min khalfihi as meaning \"ranged before\\n\\t\\t\\t\\thim and behind him\", i.e., surrounding man from all\\n\\t\\t\\t\\tsides; and they explain the words \"from God's command\" as\\n\\t\\t\\t\\tbeing here synonymous with \"by God's command\", and take\\n\\t\\t\\t\\tthem to refer to the angels or to their function of\\n\\t\\t\\t\\tguardianship. However, this interpretation has by no\\n\\t\\t\\t\\tmeans the support of all the commentators. Some of the\\n\\t\\t\\t\\tearliest ones assume that the term mu'aqqibat refers to\\n\\t\\t\\t\\tall manner of worldly forces or concepts on which man so\\n\\t\\t\\t\\toften relies in the mistaken belief that they might help\\n\\t\\t\\t\\thim to achieve his aims independently of God's will: and\\n\\t\\t\\t\\tthis is the meaning given to this elliptic passage by the\\n\\t\\t\\t\\tfamous commentator Abu Muslim al-Isfahani, as quoted by\\n\\t\\t\\t\\tRazi. Explaining verse {10} and the first part of verse\\n\\t\\t\\t\\t{11}, he says: \"All alike are, in God's knowledge, deeds\\n\\t\\t\\t\\tdone secretly or openly, as well as he who hides in the\\n\\t\\t\\t\\tdarkness of night and he who walks [boldly] in the light\\n\\t\\t\\t\\tof day...: for he that resorts to the [cover of] night\\n\\t\\t\\t\\tcan never elude God's will (amr), just as he [cannot]\\n\\t\\t\\t\\tthat walks in the light of day, surrounded by hosts of\\n\\t\\t\\t\\thelpers (mu'aqqibat) - that is, guards and aids - meant\\n\\t\\t\\t\\tto protect him: [for] those guards of his cannot save him\\n\\t\\t\\t\\tfrom [the will of] God.\" It is on this convincing\\n\\t\\t\\t\\tinterpretation that I have based my rendering. The\\n\\t\\t\\t\\tworldly \"guards and aids\" on which a sinner relies may be\\n\\t\\t\\t\\ttangible (like wealth, progeny, etc.) or intangible (like\\n\\t\\t\\t\\tpersonal power, high social standing, or the belief in\\n\\t\\t\\t\\tone's \"luck\"): and this explains the phrase \"both such as\\n\\t\\t\\t\\tcan be perceived by him and such as are hidden from him\"\\n\\t\\t\\t\\t(see preceding note)."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "11",
    "NoteID": "26",
    "Body": "Lit., \"that which is in themselves\". This statement has\\n\\t\\t\\t\\tboth a positive and a negative connotation: i.e., God\\n\\t\\t\\t\\tdoes not withdraw His blessings from men unless their\\n\\t\\t\\t\\tinner selves become depraved (cf.  8:53 ), just as He\\n\\t\\t\\t\\tdoes not bestow His blessings upon wilful sinners until\\n\\t\\t\\t\\tthey change their inner disposition and become worthy of\\n\\t\\t\\t\\tHis grace. In its wider sense, this is an illustration of\\n\\t\\t\\t\\tthe divine law of cause and effect (sunnat Allah) which\\n\\t\\t\\t\\tdominates the lives of both individuals and communities,\\n\\t\\t\\t\\tand makes the rise and fall of civilizations dependent on\\n\\t\\t\\t\\tpeople's moral qualities and the changes in \"their inner\\n\\t\\t\\t\\tselves\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "12",
    "NoteID": "27",
    "Body": "I.e., hope of rain, which in the Qur'an frequently\\n\\t\\t\\t\\tsymbolizes faith and spiritual life. With this verse, the\\n\\t\\t\\t\\tdiscourse returns to the theme enunciated at the\\n\\t\\t\\t\\tbeginning of this surah (verses {2-4}): namely, to the\\n\\t\\t\\t\\tevidence of a consciously devised plan and purpose\\n\\t\\t\\t\\tinherent in all nature and, thus, of the existence of\\n\\t\\t\\t\\tGod."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "13",
    "NoteID": "28",
    "Body": "I.e., about His transcendental existence or the quality\\n\\t\\t\\t\\tof His Being."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "13",
    "NoteID": "29",
    "Body": "According to Raghib, the expression shadid al-mihal\\n\\t\\t\\t\\t(which occurs in the Qur'an only in this one place)\\n\\t\\t\\t\\tsignifies \"powerful in contriving, in a manner hidden\\n\\t\\t\\t\\tfrom man, that wherein wisdom lies\"; hence my rendering."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "14",
    "NoteID": "30",
    "Body": "Lit., \"His is the call [or \"invocation\"] of the truth\";\\n\\t\\t\\t\\tor, possibly, \"to Him [alone] is due all true\\n\\t\\t\\t\\tinvocation\". It should, however, be remembered that the\\n\\t\\t\\t\\tterm al-haqq (\"the Truth\") is one of the Qur'anic\\n\\t\\t\\t\\tattributes of God, signifying the Ultimate Reality or\\n\\t\\t\\t\\tPrimal Cause of all that exists (the Urgrund in German\\n\\t\\t\\t\\tphilosophical terminology): consequently, the expression\\n\\t\\t\\t\\tda'wat al-haqq may be understood in the sense of \"prayer\\n\\t\\t\\t\\tdirected towards Him who is the Ultimate Reality\",\\n\\t\\t\\t\\timplying - as the sequence clearly states - that the\\n\\t\\t\\t\\tinvocation of any other being, power or principle is eo\\n\\t\\t\\t\\tipso wrong and futile."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "14",
    "NoteID": "31",
    "Body": "Or: \"side by side with God\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "14",
    "NoteID": "32",
    "Body": "Lit., \"his two palms\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "15",
    "NoteID": "33",
    "Body": "The expression yasjud (\"prostrates himself\" or \"prostrate\\n\\t\\t\\t\\tthemselves\") is a metonym for complete submission to His\\n\\t\\t\\t\\twill (Zamakhshari), that is, to the natural laws decreed\\n\\t\\t\\t\\tby Him with regard to everything that exists. According\\n\\t\\t\\t\\tto most of the classical commentators, those who submit\\n\\t\\t\\t\\tto God willingly (i.e., consciously) are the angels and\\n\\t\\t\\t\\tthe believers, whereas the deniers of the truth, who are\\n\\t\\t\\t\\t\"not willing\" to submit to Him, are nevertheless, without\\n\\t\\t\\t\\tbeing conscious of it, subject to His will. However, in\\n\\t\\t\\t\\tview of the subsequent reference to \"shadows\" it is\\n\\t\\t\\t\\tlogical to assume that the relative pronoun man relates\\n\\t\\t\\t\\tin this context not merely to conscious beings but also\\n\\t\\t\\t\\tto all other physical objects, whether animate or\\n\\t\\t\\t\\tinanimate - i.e., to \"all things and beings that are in\\n\\t\\t\\t\\tthe heavens and on earth\". (See also {16:48-49} and\\n\\t\\t\\t\\t 22:18 .)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "15",
    "NoteID": "34",
    "Body": "I.e., the varying lengths of the shadow projected by any\\n\\t\\t\\t\\tmaterial object depend on the position of the sun in\\n\\t\\t\\t\\trelation to the earth; and since the earth's rotation\\n\\t\\t\\t\\taround the sun is - as everything else in the universe - an\\n\\t\\t\\t\\toutcome of God's creative will, the greater length of a\\n\\t\\t\\t\\tshadow in the morning and evening and its contraction\\n\\t\\t\\t\\ttowards noon visibly expresses the shadow's subjection to\\n\\t\\t\\t\\tHim."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "16",
    "NoteID": "35",
    "Body": "Lit., \"do they assign to God partners...\", etc. - i.e.,\\n\\t\\t\\t\\tbeings that supposedly have a share in God's divinity\\n\\t\\t\\t\\tand/or His creative power. (See also surah {6}, note\\n\\t\\t\\t\\t[15].)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "16",
    "NoteID": "36",
    "Body": "Although the term khalq (\"creation\" or \"act of creation\")\\n\\t\\t\\t\\tis often used metaphorically with reference to human\\n\\t\\t\\t\\tachievements, there is an intrinsic difference between\\n\\t\\t\\t\\tthe \"creation\" of an artist, a poet or a philosopher, and\\n\\t\\t\\t\\tthe act of creation as attributed to God: for whereas the\\n\\t\\t\\t\\thuman \"creator\" produces his work out of already-existing\\n\\t\\t\\t\\telements and does no more than bring those elements\\n\\t\\t\\t\\ttogether in a (possibly) new combination, God alone has\\n\\t\\t\\t\\tthe power to create in the true sense of the word - that\\n\\t\\t\\t\\tis, to bring into being something that did not exist,\\n\\t\\t\\t\\teither in its entirety or in its components, before this\\n\\t\\t\\t\\tparticular act of creation (cf.  2:117 -\"when He wills a\\n\\t\\t\\t\\tthing to be, He but says unto it, 'Be'- and it is\"). This\\n\\t\\t\\t\\tis the significance of the allusion, in the above verse,\\n\\t\\t\\t\\tto the erroneous belief that any other power or being\\n\\t\\t\\t\\tcould ever have \"created the iike of what He creates\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "17",
    "NoteID": "37",
    "Body": "The interpolation of the adjective \"once-dry\" before\\n\\t\\t\\t\\t\"river-beds\" (awdiyah) is necessitated by the absence of\\n\\t\\t\\t\\tthe definite article al before this noun. According to\\n\\t\\t\\t\\tZamakhshari, this indicates that only some of the\\n\\t\\t\\t\\triver-beds are streaming with water while others, not\\n\\t\\t\\t\\taffected by this particular rainfall, remain dry. It is\\n\\t\\t\\t\\tto be borne in mind that the term wad (or wadi in popular\\n\\t\\t\\t\\tparlance) denotes, primarily, a \"water-course\" or\\n\\t\\t\\t\\t\"river-bed\" which is normally dry and carries water only\\n\\t\\t\\t\\tafter copious rainfalls; it is only by extension that\\n\\t\\t\\t\\tthis term is sometimes applied to an actual river."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "17",
    "NoteID": "38",
    "Body": "Sc., \"while the water beneath remains clear\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "18",
    "NoteID": "39",
    "Body": "This rendering is based on Zamakhshari's interpretation\\n\\t\\t\\t\\tof the above passage. According to other commentators,\\n\\t\\t\\t\\tthe beginning of verse {18} is independent of the last\\n\\t\\t\\t\\tsentence of the preceding verse, and is a new sentence,\\n\\t\\t\\t\\treading thus: \"For those who have responded to their\\n\\t\\t\\t\\tSustainer there is the ultimate good (al-husna) [in\\n\\t\\t\\t\\tstore; but as for those who did not respond to Him...\",\\n\\t\\t\\t\\tetc. In my opinion, Zamakhshari's reading - in which the\\n\\t\\t\\t\\texpression al-husna is regarded as an adjective\\n\\t\\t\\t\\tqualifying the believers' response - is preferable\\n\\t\\t\\t\\tinasmuch as it fully justifies the repetition of the\\n\\t\\t\\t\\treference to \"God's parables\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "18",
    "NoteID": "40",
    "Body": "Lit., \"and the like of it with it\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "18",
    "NoteID": "41",
    "Body": "Cf.  3:91  and the corresponding note [71]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "20",
    "NoteID": "42",
    "Body": "The \"covenant\" is, in this context, a general term\\n\\t\\t\\t\\tembracing the spiritual obligations arising from one's\\n\\t\\t\\t\\tfaith in God and the moral and social obligations,\\n\\t\\t\\t\\tresulting from that faith, towards one's fellow-men\\n\\t\\t\\t\\t(Zamakhshari); see in this connection the first sentence\\n\\t\\t\\t\\tof  5:1  (where the term 'aqd is used) and the\\n\\t\\t\\t\\tcorresponding note [1]. As regards my rendering of 'ahd\\n\\t\\t\\t\\tAllah as \"bond with God\", see surah {2}, note [19]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "21",
    "NoteID": "43",
    "Body": "This refers to all ties arising from human relationships\\n\\t\\t\\t\\t- e.g., the bonds of family, responsibility for orphans\\n\\t\\t\\t\\tand the poor, the mutual rights and duties of neighbours\\n\\t\\t\\t\\t- as well as the spiritual and practical bonds which\\n\\t\\t\\t\\tought to exist between all who belong to the brotherhood\\n\\t\\t\\t\\tof Islam (cf.  8:75  and the corresponding notes). In its\\n\\t\\t\\t\\twidest sense, the phrase \"what God has bidden to be\\n\\t\\t\\t\\tjoined\" applies to the spiritual obligation, on the part\\n\\t\\t\\t\\tof man, to remain conscious of the unity of purpose\\n\\t\\t\\t\\tunderlying all of God's creation, and hence - according\\n\\t\\t\\t\\tto Razi - man's moral duty to treat all living beings\\n\\t\\t\\t\\twith love and compassion."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "22",
    "NoteID": "44",
    "Body": "Some of the commentators take this to mean that \"if they\\n\\t\\t\\t\\thave committed a sin, they repel it [i.e., its effect] by\\n\\t\\t\\t\\trepentance\" (Ibn Kaysan, as quoted by Zamakhshari), while\\n\\t\\t\\t\\tothers think that the \"repelling\" connotes the doing of a\\n\\t\\t\\t\\tgood deed in atonement of a - presumably unintentional -\\n\\t\\t\\t\\tbad deed (Razi), or that it refers to endeavours to set\\n\\t\\t\\t\\tevil situations to rights by word or deed (an alternative\\n\\t\\t\\t\\tinterpretation mentioned by Zamakhshari). But the great\\n\\t\\t\\t\\tmajority of the classical commentators hold that the\\n\\t\\t\\t\\tmeaning is \"they repay evil with good\"; thus Al-Hasan\\n\\t\\t\\t\\tal-Basri (as quoted by Baghawi, Zamakhshari and Razi):\\n\\t\\t\\t\\t\"When they are deprived [of anything], they give; and\\n\\t\\t\\t\\twhen they are wronged, they forgive.\" Tabari's\\n\\t\\t\\t\\texplanation is very similar: \"They repel the evil done to\\n\\t\\t\\t\\tthem by doing good to those who did it\"; and \"they do not\\n\\t\\t\\t\\trepay evil with evil, but repel it by [doing] good\". See\\n\\t\\t\\t\\talso {41:34-36}."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "22",
    "NoteID": "45",
    "Body": "Lit., \"For them there will be the end-result [or\\n\\t\\t\\t\\t\"fulfilment\"] of the [ultimate] abode\". The noun 'uqba is\\n\\t\\t\\t\\tregarded by almost all the philological authorities as\\n\\t\\t\\t\\tsynonymous with 'aqibah (\"consequence\" or \"end\" or\\n\\t\\t\\t\\t\"end-result\"; hence also \"recompense\" and, tropically,\\n\\t\\t\\t\\t\"destiny\" or \"fulfilment\"). The term ad-dar stands for\\n\\t\\t\\t\\tad-dar al-akhirah, \"the ultimate abode\", i.e., life in\\n\\t\\t\\t\\tthe hereafter."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "23",
    "NoteID": "46",
    "Body": "As I have pointed out in several places, the term zawj\\n\\t\\t\\t\\tdenotes \"a pair\" or \"a couple\" as well as each of the\\n\\t\\t\\t\\tcomponents of a couple - i.e., with reference to human\\n\\t\\t\\t\\tcouples, \"a spouse\": hence it signifies either \"husband\"\\n\\t\\t\\t\\tor \"wife\". Similarly, the term aba' (lit., \"fathers\" or\\n\\t\\t\\t\\t\"forefathers\") usually denotes both fathers and mothers,\\n\\t\\t\\t\\ti.e., \"parents\"; and this is, according to Zamakhshari,\\n\\t\\t\\t\\tthe meaning in this instance. - As regards the expression\\n\\t\\t\\t\\t'adn, rendered by me as \"perpetual bliss\". see note on\\n\\t\\t\\t\\t[38:50]. the earliest instance of the Qur'anic use of\\n\\t\\t\\t\\tthis term."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "25",
    "NoteID": "47",
    "Body": "Lit., \"after its establishment (mithaq)\". For a full\\n\\t\\t\\t\\texplanation of the expression \"bond with God\" and of my\\n\\t\\t\\t\\tinterpolation, between brackets, of the words \"in their\\n\\t\\t\\t\\tnature\", see surah {2}, note [19]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "25",
    "NoteID": "48",
    "Body": "The Qur'anic term la'nah - usually but inexactly\\n\\t\\t\\t\\ttranslated as \"curse\" (and popularly used in this sense\\n\\t\\t\\t\\tin post-classical Arabic parlance) - denotes \"banishment\"\\n\\t\\t\\t\\tor \"alienation\" (ib'ad), i.e., from all that is good\\n\\t\\t\\t\\t(Lisan al-'Arab). Whenever it is attributed in the Qur'an\\n\\t\\t\\t\\tto God with reference to a sinner, it signifies the\\n\\t\\t\\t\\tlatter's \"exclusion from God's grace\" or his \"rejection\\n\\t\\t\\t\\tby God\". In the present context, this meaning is\\n\\t\\t\\t\\treinforced by the subsequent reference to \"a most evil\\n\\t\\t\\t\\tfate\" (lit., \"abode\") in afterlife. - For an explanation\\n\\t\\t\\t\\tof the phrase \"what God has bidden to be joined\", see\\n\\t\\t\\t\\tnote [43] above."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "27",
    "NoteID": "49",
    "Body": "See verse {7} of this surah and the corresponding note\\n\\t\\t\\t\\t[16]. The repetition of this question at this place\\n\\t\\t\\t\\tpoints to its connection with the reference to \"those who\\n\\t\\t\\t\\tbreak their bond with God after it has been established\\n\\t\\t\\t\\t[in their nature]\" in verse {25} above (elucidated in\\n\\t\\t\\t\\tnote [19] on  2:27 ). The abandonment of their original,\\n\\t\\t\\t\\tinnate faculty to realize the existence of God and their\\n\\t\\t\\t\\town dependence on His guidance - caused by their utter\\n\\t\\t\\t\\timmersion in the passing pleasures of this world's life -\\n\\t\\t\\t\\tmakes it impossible for \"those who are bent on denying\\n\\t\\t\\t\\tthe truth\" to sense the breath of the divine in the\\n\\t\\t\\t\\tmessage propounded to them by Muhammad: and so they\\n\\t\\t\\t\\trefuse to accept it as true unless it is supported by an\\n\\t\\t\\t\\toutward \"miracle\". (See in this connection note [94] on\\n\\t\\t\\t\\t 6:109 .)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "27",
    "NoteID": "50",
    "Body": "Or: \"God lets go astray whomever He wills\". Regarding the\\n\\t\\t\\t\\trendering adopted by me, see surah {14}, note [4]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "30",
    "NoteID": "51",
    "Body": "Most of the commentators explain the \"thus\" or \"thus it\\n\\t\\t\\t\\tis\" (kadhalika) as referring to the earlier prophets,\\n\\t\\t\\t\\tnamely, \"Thus, [or \"in like manner\"] as We sent prophets\\n\\t\\t\\t\\tbefore thee, O Muhammad, We have now sent thee...\", etc.\\n\\t\\t\\t\\tIt seems to me, however, that this speculative\\n\\t\\t\\t\\tinterpolation is unnecessary, and that the adverb \"thus\"\\n\\t\\t\\t\\tconnects directly with the preceding statement that God\\n\\t\\t\\t\\t\"guides unto Himself all who turn unto Him\": in other\\n\\t\\t\\t\\twords, the \"thus\" qualifies Muhammad's mission as an\\n\\t\\t\\t\\tinstrument of God's guidance. (This is, apparently, how\\n\\t\\t\\t\\tTabari understands the above phrase.)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "30",
    "NoteID": "52",
    "Body": "Lit., \"before whom [other] communities have passed away\":\\n\\t\\t\\t\\tan indirect reference to the continuity of prophetic\\n\\t\\t\\t\\trevelation before and up to the time of the Last Prophet\\n\\t\\t\\t\\tMuhammad (Zamakhshari, Razi). The interpolation of the\\n\\t\\t\\t\\twords \"of unbelievers\" is based on Ibn Kathir's\\n\\t\\t\\t\\tcommentary on this verse, whereas my rendering of\\n\\t\\t\\t\\tarsalnaka (lit., \"We have sent thee\") as \"We have raised\\n\\t\\t\\t\\tthee as Our Apostle\" is necessitated, in English, by the\\n\\t\\t\\t\\tsubsequent preposition \"amidst\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "30",
    "NoteID": "53",
    "Body": "I.e., by refusing to acknowledge His existence, or by\\n\\t\\t\\t\\trejecting His guidance, or by ascribing divine qualities\\n\\t\\t\\t\\tto other beings or forces side by side with Him."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "31",
    "NoteID": "54",
    "Body": "The sentence added by me between brackets corresponds to\\n\\t\\t\\t\\tthe interpretation given to the above passage by Tabari\\n\\t\\t\\t\\tand also by Az-Zajjaj (as quoted by Razi and - without\\n\\t\\t\\t\\tthe mention of Az-Zajjaj by name - by Baghawi and\\n\\t\\t\\t\\tZamakhshari as well); cf. {6:109-111}."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "31",
    "NoteID": "55",
    "Body": "Lit., \"God's alone is all [power of] command\": i.e., no\\n\\t\\t\\t\\t\"miraculous sign\" can ever convince those whose hearts\\n\\t\\t\\t\\tGod has \"sealed\" in consequence of their \"breaking their\\n\\t\\t\\t\\tbond with Him\" (see surah {2}, notes [7] and [19])."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "31",
    "NoteID": "56",
    "Body": "The meaning is that God grants man the freedom to choose\\n\\t\\t\\t\\tbetween right and wrong: \"He guides unto Himself all who\\n\\t\\t\\t\\tturn unto Him\" (verse {27} above) and \"are true to their\\n\\t\\t\\t\\tbond with God\" (verse {20}); on the other hand, He\\n\\t\\t\\t\\twithholds His guidance from \"the iniquitous, who break\\n\\t\\t\\t\\ttheir bond with God\" ({2:26-27}). See also the last\\n\\t\\t\\t\\tsentence of  6:149  and the corresponding note [143]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "31",
    "NoteID": "57",
    "Body": "Lit., \"a sudden calamity (qari'ah) will not cease (la\\n\\t\\t\\t\\tyazal) to befall them or to alight close to their home\".\\n\\t\\t\\t\\tHowever, since this phrase connotes repetition and\\n\\t\\t\\t\\tcontinuity, the singular form of the noun qari'ah has\\n\\t\\t\\t\\there obviously a cumulative sense - namely, an unceasing\\n\\t\\t\\t\\tsuccession of social catastrophes, fratricidal wars and\\n\\t\\t\\t\\tmutual deprivations which, in consequence of their\\n\\t\\t\\t\\tdeliberate disregard of all spiritual values, will\\n\\t\\t\\t\\tdirectly befall \"those who are bent on denying the truth\"\\n\\t\\t\\t\\t(alladhina kafaru), or will, indirectly, cause them to\\n\\t\\t\\t\\tsuffer by affecting their whole organic environment: and\\n\\t\\t\\t\\tthis, to my mind, is the meaning of the phrase \"or will\\n\\t\\t\\t\\talight close to their homes\". (Cf. in this connection\\n\\t\\t\\t\\t 5:33  and the corresponding notes, especially note\\n\\t\\t\\t\\t[45].)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "33",
    "NoteID": "58",
    "Body": "The term nafs has here apparently the general meaning of\\n\\t\\t\\t\\t\"soul\" or \"living being\", applying both to humans and\\n\\t\\t\\t\\tanimals."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "33",
    "NoteID": "59",
    "Body": "Lit., \"what it has acquired\" - i.e., according to the\\n\\t\\t\\t\\texigencies of its life, and - in the case of a human\\n\\t\\t\\t\\tbeing - according to his or her moral deserts as well."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "33",
    "NoteID": "60",
    "Body": "Lit., \"Name them!\" Most of the commentators explain this\\n\\t\\t\\t\\tphrase as an expression of utter contempt for those\\n\\t\\t\\t\\tallegedly \"divine\" beings: i.e., \"they are so unreal and\\n\\t\\t\\t\\tmeaningless as not to deserve even a name\". It is also\\n\\t\\t\\t\\tconceivable that we have here an echo of the statement,\\n\\t\\t\\t\\tto be found in  7:71 ,  12:40  and  53:23 , to the effect\\n\\t\\t\\t\\tthat those false objects of worship are but \"[empty]\\n\\t\\t\\t\\tnames which you have invented\". However, in view of the\\n\\t\\t\\t\\tnext sentence - which refers to God's omniscience and is\\n\\t\\t\\t\\tsimilar to  10:18 , where imaginary \"intercessors\" are\\n\\t\\t\\t\\texplicitly mentioned - it is possible to interpret the\\n\\t\\t\\t\\tabove phrase still more precisely, viz., \"Call them\\n\\t\\t\\t\\t'divine intercessors', if you so like: but...\", etc.\\n\\t\\t\\t\\t(According to Zamakhshari, the particle am, which usually\\n\\t\\t\\t\\tdenotes \"or\", stands here for bal, \"nay, but\" or simply\\n\\t\\t\\t\\t\"but\".)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "33",
    "NoteID": "61",
    "Body": "Lit., \"or [do you say this] in the outward appearance\\n\\t\\t\\t\\t(bi-zahir) of a saying\". Cf. the second part of  10:18 \\n\\t\\t\\t\\t(preceded by a reference to deified \"intercessors\") and\\n\\t\\t\\t\\tthe corresponding note [27]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "33",
    "NoteID": "62",
    "Body": "Lit., \"their cunning [or \"artful\"] device (makr)\": but\\n\\t\\t\\t\\tsince, as Tabari points out, this term relates here\\n\\t\\t\\t\\tmainly to conscious shirk (\"the attribution of divine\\n\\t\\t\\t\\tqualities to aught but God\") and, hence, to false\\n\\t\\t\\t\\treligious ideas in general, it can be suitably rendered\\n\\t\\t\\t\\tas above."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "33",
    "NoteID": "63",
    "Body": "See surah {7}, note [152], and surah {14}, note [4]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "34",
    "NoteID": "64",
    "Body": "See the last paragraph of verse {31} and note [57] above."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "35",
    "NoteID": "65",
    "Body": "This rendering (and the interpolation of the words \"is\\n\\t\\t\\t\\tthat of a garden\") reproduces literally the\\n\\t\\t\\t\\tinterpretation given to the above passage by Az-Zajjaj,\\n\\t\\t\\t\\tas quoted by Zamakhshari and - in an abbreviated form -\\n\\t\\t\\t\\tby Razi; according to Zamakhshari, this passage serves\\n\\t\\t\\t\\t\"as a parabolic illustration, by means of something which\\n\\t\\t\\t\\twe know from our experience, of something that is beyond\\n\\t\\t\\t\\tthe reach of our perception\" (tamthilan li-ma ghaba 'anna\\n\\t\\t\\t\\tbi-ma nushahid). As in the similar (but wider) reference\\n\\t\\t\\t\\tto \"the parable of paradise\" in  47:15 , we are here\\n\\t\\t\\t\\treminded that the Qur'anic descriptions of what awaits\\n\\t\\t\\t\\tman after resurrection are, of necessity, metaphorical,\\n\\t\\t\\t\\tsince the human mind cannot conceive of anything that is\\n\\t\\t\\t\\t- both in its elements and its totality - entirely\\n\\t\\t\\t\\tdifferent from anything that can be experienced in this\\n\\t\\t\\t\\tworld. (See in this connection Appendix I.)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "35",
    "NoteID": "66",
    "Body": "I.e., its gift of happiness. Regarding this metaphorical\\n\\t\\t\\t\\tmeaning of zill (\"shade\"). see the last clause of  4:57 \\n\\t\\t\\t\\tand the corresponding note [74]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "35",
    "NoteID": "67",
    "Body": "For my rendering of 'uqba, in this context, as \"destiny\"\\n\\t\\t\\t\\tsee note [45] above."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "36",
    "NoteID": "68",
    "Body": "Sc., \"and who believe in it\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "36",
    "NoteID": "69",
    "Body": "I.e., because it offers them guidance in this world and\\n\\t\\t\\t\\tholds out to them the promise of ultimate happiness in\\n\\t\\t\\t\\tthe life to come."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "36",
    "NoteID": "70",
    "Body": "I.e., while admitting that the Qur'an contains much that\\n\\t\\t\\t\\tcoincides with the spiritual concepts taught by their own\\n\\t\\t\\t\\treligions. The designation ahzab (lit., \"parties\" or\\n\\t\\t\\t\\t\"sects\", sing. hizb) connotes here the followers of other\\n\\t\\t\\t\\treligions or creeds (Tabari and Razi)."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "36",
    "NoteID": "71",
    "Body": "The particle \"only\" (innama) at the beginning of this\\n\\t\\t\\t\\tsentence \"clearly shows that there is [in Islam] no\\n\\t\\t\\t\\tobligation, no ordinance and no prohibition that is not\\n\\t\\t\\t\\tconnected with this [principle]\" (Razi)."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "37",
    "NoteID": "72",
    "Body": "Lit., \"as an Arabic ordinance (hukm)\": i.e., so as to\\n\\t\\t\\t\\tenable the Arabian Prophet to propound it to the people\\n\\t\\t\\t\\tof his immediate environment and, through them, to the\\n\\t\\t\\t\\twhole world. Cf. in this connection  14:4 , where it is\\n\\t\\t\\t\\tstated that every one of God's prophets was entrusted\\n\\t\\t\\t\\twith a message \"in his own people's tongue, so that he\\n\\t\\t\\t\\tmight make [the truth] clear unto them\". That the message\\n\\t\\t\\t\\tof the Qur'an is universal, and not restricted to the\\n\\t\\t\\t\\tArabs alone, is brought out clearly in many places, e.g.,\\n\\t\\t\\t\\tin  7:158 , \"Say [O Prophet]: 'O mankind! Verily, I am an\\n\\t\\t\\t\\tapostle of God to all of you.'\""
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "37",
    "NoteID": "73",
    "Body": "Lit., \"follow their likes and dislikes (ahwahum)\" - i.e.,\\n\\t\\t\\t\\tby compromising with the followers of other creeds who,\\n\\t\\t\\t\\twhile accepting some of the fundamental verities of the\\n\\t\\t\\t\\tQur'an, are unwilling to accept the whole of it."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "38",
    "NoteID": "74",
    "Body": "I.e., they were mortals like all other men, and were not\\n\\t\\t\\t\\tendowed with any \"supernatural\" qualities. This is a\\n\\t\\t\\t\\trejoinder to those who refuse to accept a divine message\\n\\t\\t\\t\\tas true on the grounds of its having been conveyed to\\n\\t\\t\\t\\tmankind by an \"ordinary mortal\". (Cf.  25:7 , where the\\n\\t\\t\\t\\tunbelievers are speaking derisively of Muhammad as an\\n\\t\\t\\t\\tapostle \"who eats food [like all other mortals] and goes\\n\\t\\t\\t\\tabout in the market-places\", and the many references to\\n\\t\\t\\t\\ttheir incredulous wondering that God should have chosen\\n\\t\\t\\t\\tas His prophet \"a man from among themselves\".) In\\n\\t\\t\\t\\taddition to this, the above verse stresses, by\\n\\t\\t\\t\\timplication, the positive value of man's natural,\\n\\t\\t\\t\\tphysical life - summarized, as it were, in the expression\\n\\t\\t\\t\\t\"wives and offspring\" - and the rejection of exaggerated\\n\\t\\t\\t\\tasceticism and self-mortification as an allegedly\\n\\t\\t\\t\\tdesirable \"way to God\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "38",
    "NoteID": "75",
    "Body": "Lit., \"by God's leave\". Cf.  6:109  - \"Miracles are in\\n\\t\\t\\t\\tthe power of God alone\" - and the corresponding note\\n\\t\\t\\t\\t[94]. In the present context, this is an answer to those\\n\\t\\t\\t\\twho refuse to believe in Muhammad's message unless \"a\\n\\t\\t\\t\\tmiraculous sign\" is bestowed upon him."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "38",
    "NoteID": "76",
    "Body": "Or: \"a divine writ\" (kitab). See  5:48  - \"Unto every one\\n\\t\\t\\t\\tof you have We appointed a [different] law and way of\\n\\t\\t\\t\\tlife\" - and the corresponding note [66], which explains\\n\\t\\t\\t\\tthe succession of divine messages culminating in, and\\n\\t\\t\\t\\tending with, the revelation of the Qur'an. This\\n\\t\\t\\t\\tinterpretation of the above phrase - adopted, among\\n\\t\\t\\t\\tothers, by Ibn Kathir - connects it plausibly with the\\n\\t\\t\\t\\tpreceding mention of the apostles who came before\\n\\t\\t\\t\\tMuhammad, and with the subsequent reference to the\\n\\t\\t\\t\\tsupersession of the earlier divine messages by that of\\n\\t\\t\\t\\tthe Qur'an. Apart from this, the statement that every age\\n\\t\\t\\t\\thad a revelation suited to the particular needs of the\\n\\t\\t\\t\\ttime and the people concerned (Zamakhshari) constitutes\\n\\t\\t\\t\\tan answer to the objection, often raised by followers of\\n\\t\\t\\t\\tother creeds, that the message of the Qur'an differs in\\n\\t\\t\\t\\tmany respects from the earlier divine revelations (Razi)."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "39",
    "NoteID": "77",
    "Body": "I.e., He is the fountainhead or source (asl) of all\\n\\t\\t\\t\\trevelation. - As regards the preceding reference to the\\n\\t\\t\\t\\tabrogation of earlier divine dispensations and their\\n\\t\\t\\t\\tsupersession by later ones - ending with the final\\n\\t\\t\\t\\trevelation, the Qur'an - see  2:106  and the\\n\\t\\t\\t\\tcorresponding note [87]. (According to Qatadah, as quoted\\n\\t\\t\\t\\tby Tabari and Ibn Kathir, the passage under consideration\\n\\t\\t\\t\\thas the same purport as  2:106 .)"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "40",
    "NoteID": "78",
    "Body": "I.e., the calamities which, according to the last\\n\\t\\t\\t\\tparagraph of verse {31} above, are in store for \"those\\n\\t\\t\\t\\twho are bent on denying the truth\" (alladhina kafaru)."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "41",
    "NoteID": "79",
    "Body": "Lit., \"that\"."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "41",
    "NoteID": "80",
    "Body": "Or: \"curtailing it from [all] its sides\" (min atrafiha) -\\n\\t\\t\\t\\tdepending on whether one understands by atraf the \"sides\"\\n\\t\\t\\t\\tor \"extremities\" or \"outlying parts\" (of a concrete body\\n\\t\\t\\t\\tor land) or, alternatively, the \"outstanding men\" - i.e.,\\n\\t\\t\\t\\tthe great leaders, scholars and thinkers (Taj al-'Arus) -\\n\\t\\t\\t\\tand \"the best of the [earth's] inhabitants and fruits\"\\n\\t\\t\\t\\t(ibid). Many commentators, taking the primary meaning of\\n\\t\\t\\t\\tatraf, are of the opinion that the above sentence relates\\n\\t\\t\\t\\tto the struggle between the early Muslim community at\\n\\t\\t\\t\\tMedina and the pagans of Mecca, and interpret it thus:\\n\\t\\t\\t\\t\"Do they [i.e., the pagans of Mecca] not see that we are\\n\\t\\t\\t\\tvisiting [with Our punishment] the land [held by them],\\n\\t\\t\\t\\tgradually curtailing it from [all] its sides?\" - which\\n\\t\\t\\t\\twould imply a prophecy of the gradual conquest of all\\n\\t\\t\\t\\tArabia by the Muslims. Other commentators, however,\\n\\t\\t\\t\\tprefer the secondary meaning of atraf and - without\\n\\t\\t\\t\\tdenying its relevance to the early history of Islam -\\n\\t\\t\\t\\tinterpret this passage in a more general sense, similar\\n\\t\\t\\t\\tto the rendering adopted by me. Thus, for instance, Razi:\\n\\t\\t\\t\\t\"Have they [i.e., the deniers of the truth] never yet\\n\\t\\t\\t\\tseen the turns of fortune (ikhtilafat) that take place in\\n\\t\\t\\t\\tthis world - destruction after prosperity, death after\\n\\t\\t\\t\\tlife, humiliation after glory, deficiency after\\n\\t\\t\\t\\tperfection?... Hence, what makes those deniers of the\\n\\t\\t\\t\\ttruth so sure that God will not render them abject after\\n\\t\\t\\t\\tthey had been mighty, and subjected [by others] after\\n\\t\\t\\t\\tthey had been rulers?\" Thus, in its widest sense, the\\n\\t\\t\\t\\tphrase \"gradually depriving it of all that is best in it\"\\n\\t\\t\\t\\tmay be taken to relate not merely to physical and social\\n\\t\\t\\t\\tcatastrophes but also to the loss of all ethical values -\\n\\t\\t\\t\\tand, thus, to the loss of all worldly power - which\\n\\t\\t\\t\\t\"those who are bent on denying the truth\" are bound to\\n\\t\\t\\t\\tsuffer in the end."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "42",
    "NoteID": "81",
    "Body": "Lit., \"did scheme\"-an expression which in this context\\n\\t\\t\\t\\tapparently refers to blasphemous ideas and attitudes."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "42",
    "NoteID": "82",
    "Body": "Lit., \"earns\" - i.e., of good and evil."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "42",
    "NoteID": "83",
    "Body": "For an explanation of this rendering of 'uqba 'd-dar\\n\\t\\t\\t\\t(which is here synonymous with 'aqibat ad-dar), see surah\\n\\t\\t\\t\\t{6}, note [118]."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "43",
    "NoteID": "84",
    "Body": "Lit., \"and anyone who possesses (man 'indahu) knowledge\\n\\t\\t\\t\\tof the revelation\" - implying that a true understanding\\n\\t\\t\\t\\tof the Qur'an unavoidably leads one to the conviction\\n\\t\\t\\t\\tthat it has been revealed by God."
  }
]
