[
  {
    "SurahNumber": "58",
    "AyahNumber": "1",
    "Text": "Allah has indeed heard the words of the woman (Khawlah daughter\\n\\t\\t\\tof Tha'labah, who had been divorced by calling her: ''You are to\\n\\t\\t\\tme like my mother\" which was acceptable practice for divorce\\n\\t\\t\\tamong pagan Arabs), who pleaded with you against her husband and\\n\\t\\t\\tmade her complaint to Allah, and Allah has heard what you said to\\n\\t\\t\\teach other. Allah hears all and sees all."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "2",
    "Text": "Those of you who divorce their wives by Zihar (calling them to be\\n\\t\\t\\tlike their mothers) should know that they are not their mothers.\\n\\t\\t\\tTheir mothers are only those who gave birth to them. Surely the\\n\\t\\t\\twords they utter are absurd and false. Allah could punish them\\n\\t\\t\\tfor this but He forgave them, surely Allah is All-Pardoning,\\n\\t\\t\\tAll-Forgiving."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "3",
    "Text": "Those who divorce their wives by Zihar, then wish to retract the\\n\\t\\t\\twords they uttered, shall have to free a slave before they touch\\n\\t\\t\\teach other. This is enjoined as a penalty for doing so. Allah is\\n\\t\\t\\twell-aware of all your actions."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "4",
    "Text": "He that has no slave, shall fast two consecutive months before\\n\\t\\t\\tthey touch each other. He that cannot fast, shall feed sixty poor\\n\\t\\t\\tpeople. This is enjoined so that you may have faith in Allah and\\n\\t\\t\\tHis Rasool. These are the limits set by Allah, and the violators\\n\\t\\t\\tshall have a painful punishment."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "5",
    "Text": "Those who resist Allah and His Rasool, shall be humiliated as\\n\\t\\t\\twere those before them. We have sent down clear revelations; the\\n\\t\\t\\tdisbelievers shall have a humiliating punishment."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "6",
    "Text": "On the Day of Judgement Allah will raise them all back to life,\\n\\t\\t\\tthen inform them about what they have done. Allah has kept full\\n\\t\\t\\trecord of their deeds even though they may have forgotten, for\\n\\t\\t\\tAllah is a witness over all things."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "7",
    "Text": "Are you not aware that Allah knows all that is in the heavens and\\n\\t\\t\\tin the earth? It cannot be that three persons converse in secret\\n\\t\\t\\tand He is not the fourth of them; or five persons converse in\\n\\t\\t\\tsecret and He is not sixth of them; whether fewer or more,\\n\\t\\t\\twherever they may be, He is with them. Then on the Day of\\n\\t\\t\\tResurrection He will inform them of what they have done, surely\\n\\t\\t\\tAllah has knowledge of all things."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "8",
    "Text": "Have you not seen those who, though forbidden to hold secret\\n\\t\\t\\tcounsels, persistently do what was forbidden? They hold secret\\n\\t\\t\\tcounsels among themselves for sin, hostility and disobedience to\\n\\t\\t\\tthe Rasool. Yet when they come to you, they greet you in words\\n\\t\\t\\twhich Allah does not greet you with, and say to themselves: \"Why\\n\\t\\t\\tdoes Allah not punish us for what we say?\" Hell is enough for\\n\\t\\t\\tthem, they shall burn in its flames, what an evil destination!"
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "9",
    "Text": "O believers! When you confer together in private, do not talk\\n\\t\\t\\tabout sin and hostility and disobedience to the Rasool; but to\\n\\t\\t\\tcounsel about virtue and piety, and fear Allah, before whom you\\n\\t\\t\\tshall be brought together."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "10",
    "Text": "Conspiring in secret is the work of shaitan, who means to vex the\\n\\t\\t\\tbelievers; but he cannot harm them at all except as Allah\\n\\t\\t\\tpermits; so in Allah let the believers put their trust."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "11",
    "Text": "O believers! When you are asked to make room in your meetings,\\n\\t\\t\\tmake room, Allah will make room for you in the Hereafter. And if\\n\\t\\t\\tyou are told to rise up, then rise up: Allah will raise to higher\\n\\t\\t\\tranks those of you who have faith and knowledge. Allah is aware\\n\\t\\t\\tof all your actions."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "12",
    "Text": "O believers! When you want to consult the Rasool in private,\\n\\t\\t\\toffer something in charity before your consultation, that is best\\n\\t\\t\\tand purest for you. But if you lack the means, know that Allah is\\n\\t\\t\\tOft-Forgiving, Most Merciful."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "13",
    "Text": "Do you hesitate to give out in charity before your private\\n\\t\\t\\tconsultation with him? If you cannot afford it - Allah will\\n\\t\\t\\tforgive you - so establish Salah and pay Zakah, and obey Allah\\n\\t\\t\\tand His Rasool. Allah is well aware of all your actions."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "14",
    "Text": "Have you not seen the ones who have befriended those people who\\n\\t\\t\\tare under the wrath of Allah? They are neither on your side nor\\n\\t\\t\\tyet on theirs and they knowingly swear to falsehood."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "15",
    "Text": "Allah has prepared for them a severe punishment; evil indeed is\\n\\t\\t\\twhat they are doing."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "16",
    "Text": "They use their oaths as shields, and debar others from the Way of\\n\\t\\t\\tAllah. They shall have a humiliating punishment."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "17",
    "Text": "Neither their riches nor their sons shall avail them anything\\n\\t\\t\\tagainst Allah. They shall be the inmates of hell and live there\\n\\t\\t\\tforever."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "18",
    "Text": "On the Day when Allah will raise them all to life, they will\\n\\t\\t\\tswear to Him as they now swear to you, thinking that their oaths\\n\\t\\t\\twill help them. By no means! Surely they are the liars."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "19",
    "Text": "Shaitan has gained possession of them, and caused them to forget\\n\\t\\t\\tAllah's warning. They are the party of shaitan. Beware! Surely it\\n\\t\\t\\tis the party of shaitan that shall be the loser."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "20",
    "Text": "Those who resist Allah and His Rasool will be among the most\\n\\t\\t\\thumiliated."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "21",
    "Text": "Allah has decreed: \"It is I and My Rasools who will most\\n\\t\\t\\tcertainly prevail.\" Surely Allah is All-Powerful, All-Mighty."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "22",
    "Text": "You will never find any people who believe in Allah and the last\\n\\t\\t\\tDay on friendly terms with those who oppose Allah and His Rasool,\\n\\t\\t\\teven though they be their fathers, their sons, their brothers or\\n\\t\\t\\ttheir relatives. It is they in whose hearts Allah has inscribed\\n\\t\\t\\tfaith and has strengthened them with a spirit of His own. He will\\n\\t\\t\\tadmit them to gardens beneath which rivers flow, to live therein\\n\\t\\t\\tforever. Allah will be well pleased with them, and they will be\\n\\t\\t\\twell pleased with Him. They are the party of Allah. Beware!\\n\\t\\t\\tSurely it is the party of Allah that will be successful."
  }
]
