[
  {
    "SurahNumber": "21",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Lit., \"and yet in [their] heedlessness they are obstinate\\n\\t\\t\\t\\t(mu'ridun)\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "Lit., \"while they are playing\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "See next note."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "As regards my occasional rendering of sihr (lit.,\\n\\t\\t\\t\\t\"sorcery\" or \"magic\") as \"spellbinding eloquence\", see\\n\\t\\t\\t\\t 74:24 , where this term occurs for the first time in the\\n\\t\\t\\t\\tchronology of Qur'anic revelation. - By rejecting the\\n\\t\\t\\t\\tmessage of the Qur'an on the specious plea that Muhammad\\n\\t\\t\\t\\tis but a human being endowed with \"spellbinding\\n\\t\\t\\t\\teloquence\", the opponents of the Qur'anic doctrine in\\n\\t\\t\\t\\treality \"conceal their innermost thoughts\": for, their\\n\\t\\t\\t\\trejection is due not so much to any pertinent criticism\\n\\t\\t\\t\\tof this doctrine as, rather, to their instinctive,\\n\\t\\t\\t\\tdeep-set unwillingness to submit to the moral and\\n\\t\\t\\t\\tspiritual discipline which an acceptance of the Prophet's\\n\\t\\t\\t\\tcall would entail."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "According to the earliest scholars of Medina and Basrah,\\n\\t\\t\\t\\tas well as some of the scholars of Kufah, this word is\\n\\t\\t\\t\\tspelt qul, as an imperative (\"Say\"), whereas some of the\\n\\t\\t\\t\\tMeccan scholars and the majority of those of Kufah read\\n\\t\\t\\t\\tit as aala (\"He [i.e., the Prophet] said\"). In the\\n\\t\\t\\t\\tearliest copies of the Qur'an the spelling was apparently\\n\\t\\t\\t\\tconfined, in this instance, to the consonants q-l: hence\\n\\t\\t\\t\\tthe possibility of reading it either as qul or as qala.\\n\\t\\t\\t\\tHowever, as Tabari points out, both these readings have\\n\\t\\t\\t\\tthe same meaning and are, therefore, equally valid, \"for,\\n\\t\\t\\t\\twhen God bade Muhammad to say this, he [undoubtedly] said\\n\\t\\t\\t\\tit....Hence, in whichever way this word is read, the\\n\\t\\t\\t\\treader is correct (musib as-sawab) in his reading.\" Among\\n\\t\\t\\t\\tthe classical commentators, Baghawi and Baydawi\\n\\t\\t\\t\\texplicitly use the spelling qul, while Zamakhshari's\\n\\t\\t\\t\\tshort remark that \"it has also been read as qala\" seems\\n\\t\\t\\t\\tto indicate his own preference for the imperative qul."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "5",
    "NoteID": "6",
    "Body": "Lit., \"confusing medleys (adghath) of dreams\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "6",
    "NoteID": "7",
    "Body": "Lit., \"before them\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "6",
    "NoteID": "8",
    "Body": "The downfall of those communities of old - frequently\\n\\t\\t\\t\\treferred to in the Qur'an - was invariably due to the\\n\\t\\t\\t\\tfact that they had been resolved to ignore all spiritual\\n\\t\\t\\t\\ttruths which militated against their own, materialistic\\n\\t\\t\\t\\tconcept of life: is it, then (so the Qur'anic argument\\n\\t\\t\\t\\tgoes), reasonable to expect that the opponents of the\\n\\t\\t\\t\\tProphet Muhammad, who are similarly motivated, would be\\n\\t\\t\\t\\tmore willing to consider his message on its merits?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "7",
    "NoteID": "9",
    "Body": "Lit., \"followers of the reminder\"-i.e., of the Bible,\\n\\t\\t\\t\\twhich in its original, uncorrupted form represented one\\n\\t\\t\\t\\tof God's \"reminders\" to man."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "8",
    "NoteID": "10",
    "Body": "Lit., \"neither did We fashion them [i.e., those apostles]\\n\\t\\t\\t\\tas bodies that ate no food\", implying a denial of any\\n\\t\\t\\t\\tsupernatural quality in the prophets entrusted with God's\\n\\t\\t\\t\\tmessage (cf.  5:75 ,  13:38  and  25:20 , as well as the\\n\\t\\t\\t\\tcorresponding notes). The above is an answer to the\\n\\t\\t\\t\\tunbelievers' objection to Muhammad's prophethood\\n\\t\\t\\t\\texpressed in verse {3} of this surah."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "9",
    "NoteID": "11",
    "Body": "I.e., their believing followers."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "9",
    "NoteID": "12",
    "Body": "As regards my rendering of al-musrifun as \"those who had\\n\\t\\t\\t\\twasted their own selves\", see note [21] on the last\\n\\t\\t\\t\\tsentence of {10: 12}."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "10",
    "NoteID": "13",
    "Body": "The term dhikr, which primarily denotes a \"reminder\" or a\\n\\t\\t\\t\\t\"remembrance\", or, as Raghib defines it, the \"presence\\n\\t\\t\\t\\t[of something] in the mind\", has also the meaning of\\n\\t\\t\\t\\t\"that by which one is remembered\", i.e., with praise - in\\n\\t\\t\\t\\tother words, \"renown\" or \"fame\" - and, tropically,\\n\\t\\t\\t\\t\"honour\", \"eminence\" or \"dignity\". Hence, the above\\n\\t\\t\\t\\tphrase contains, apart from the concept of a \"reminder\",\\n\\t\\t\\t\\tan indirect allusion to the dignity and happiness to\\n\\t\\t\\t\\twhich man may attain by following the spiritual and\\n\\t\\t\\t\\tsocial precepts laid down in the Qur'an. By rendering the\\n\\t\\t\\t\\texpression dhikrukum as \"all that you ought to bear in\\n\\t\\t\\t\\tmind\", I have tried to bring out all these meanings."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "11",
    "NoteID": "14",
    "Body": "Lit., \"after it\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "13",
    "NoteID": "15",
    "Body": "For an explanation of the phrase ma utriftum fihi, see\\n\\t\\t\\t\\tsurah {11}, note [147]."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "13",
    "NoteID": "16",
    "Body": "The Qur'an does not say whose words these are, but the\\n\\t\\t\\t\\ttenor of this passage indicates, I believe, that it is\\n\\t\\t\\t\\tthe scornful, self-accusing voice of the sinnirs' own\\n\\t\\t\\t\\tconscience: hence my interpolation, between brackets, at\\n\\t\\t\\t\\tthe beginning of this verse."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "14",
    "NoteID": "17",
    "Body": "Lit., \"They said\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "16",
    "NoteID": "18",
    "Body": "Lit., \"playing\" or \"playfully\", i.e., without meaning and\\n\\t\\t\\t\\tpurpose: see note [11] on  10:5 ."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "17",
    "NoteID": "19",
    "Body": "Lit., \"if We had [ever] willed to do so\": meaning that,\\n\\t\\t\\t\\thad God ever willed to \"indulge in a pastime\" (which,\\n\\t\\t\\t\\tbeing almighty and self-sufficient, He has no need to\\n\\t\\t\\t\\tdo), He could have found it within His Own Self, without\\n\\t\\t\\t\\tany necessity to create a universe which would embody His\\n\\t\\t\\t\\thypothetical - and logically inconceivable - will to\\n\\t\\t\\t\\t\"please Himself\", and would thus represent a\\n\\t\\t\\t\\t\"projection\", as it were, of His Own Being. In the\\n\\t\\t\\t\\telliptic manner of the Qur'an, the above passage amounts\\n\\t\\t\\t\\tto a statement of God's transcendence."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "18",
    "NoteID": "20",
    "Body": "I.e., the truth of God's transcendence against the false\\n\\t\\t\\t\\tidea of His existential immanence in, or co-existence\\n\\t\\t\\t\\twith, the created universe."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "18",
    "NoteID": "21",
    "Body": "The obvious fact that everything in the created universe\\n\\t\\t\\t\\tis finite and perishable effectively refutes the claim\\n\\t\\t\\t\\tthat it could be a \"projection\" of the Creator, who is\\n\\t\\t\\t\\tinfinite and eternal."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "18",
    "NoteID": "22",
    "Body": "Lit.. \"for all that you attribute to God bv way of\\n\\t\\t\\t\\tdescription\" or \"of definition\" (cf. the last sentence of\\n\\t\\t\\t\\t6:100 and the corresponding note 88) - implying that the\\n\\t\\t\\t\\tidea of God's \"immanence\" in His creation is equivalent\\n\\t\\t\\t\\tto an attempt to define His Being."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "19",
    "NoteID": "23",
    "Body": "According to the classical commentators, this refers to\\n\\t\\t\\t\\tthe angels; but it is possible to understand the\\n\\t\\t\\t\\texpression \"those who are with Him\" in a wider sense,\\n\\t\\t\\t\\tcomprising not only the angels but also all human beings\\n\\t\\t\\t\\twho are truly God-conscious and wholly dedicated to Him.\\n\\t\\t\\t\\tIn either case, their \"being with Him\" is a metaphorical\\n\\t\\t\\t\\tindication of their spiritual eminence and place of\\n\\t\\t\\t\\thonour in God's sight, and does not bear any spatial\\n\\t\\t\\t\\tconnotation of \"nearness\" (Zamakhshari and Razl):\\n\\t\\t\\t\\tobviously so, because God is limitless in space as well\\n\\t\\t\\t\\tas in time. (See also  40:7  and the corresponding note\\n\\t\\t\\t\\t[4].)"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "21",
    "NoteID": "24",
    "Body": "As stressed by Zamakhshari, the particle am which\\n\\t\\t\\t\\tintroduces this sentence has not, as is so often the\\n\\t\\t\\t\\tcase, an interrogative sense (\"is it that...\"), but is\\n\\t\\t\\t\\tused here in the sense of bal, which in this instance may\\n\\t\\t\\t\\tbe rendered as \"and yet\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "21",
    "NoteID": "25",
    "Body": "Lit., \"they have taken unto themselves deities from the\\n\\t\\t\\t\\tearth\", i.e., from among the things or beings found on\\n\\t\\t\\t\\tearth: an expression which alludes to all manner of false\\n\\t\\t\\t\\tobjects of worship - idols of every description, forces\\n\\t\\t\\t\\tof nature, deified human beings. and. finally, abstract\\n\\t\\t\\t\\tconcepts such as wealth, power, etc."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "22",
    "NoteID": "26",
    "Body": "Lit., \"in those two [realms]\", alluding to the first\\n\\t\\t\\t\\tclause of verse {19} above."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "22",
    "NoteID": "27",
    "Body": "Lit., \"the Sustainer (rabb) of the awesome throne of\\n\\t\\t\\t\\talmightiness\". (For this rendering of al-'arsh, see note\\n\\t\\t\\t\\t[43] on  7:54 ."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "22",
    "NoteID": "28",
    "Body": "Cf. last sentence of verse {18} and the corresponding\\n\\t\\t\\t\\tnote [22], as well as note [88] on {6 :100}."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "24",
    "NoteID": "29",
    "Body": "See note [24] above."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "24",
    "NoteID": "30",
    "Body": "Lit., \"produce your evidence\", i.e., for the existence of\\n\\t\\t\\t\\tdeities other than God, as well as for the intellectual\\n\\t\\t\\t\\tand moral justification of worshipping anything but Him."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "24",
    "NoteID": "31",
    "Body": "I.e., the earlier prophets, the purport of whose messages\\n\\t\\t\\t\\twas always the stress on the oneness of God."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "24",
    "NoteID": "32",
    "Body": "In other words, most people's obstinate refusal to\\n\\t\\t\\t\\tconsider a reasonable proposition on its merits is often\\n\\t\\t\\t\\tdue to no more than the simple fact that it is not\\n\\t\\t\\t\\tfamiliar to them."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "26",
    "NoteID": "33",
    "Body": "I.e., utterly remote from the imperfection implied in the\\n\\t\\t\\t\\tconcept of \"offspring\": see note [77] on  19:92 ."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "26",
    "NoteID": "34",
    "Body": "This alludes to prophets like Jesus, whom the Christians\\n\\t\\t\\t\\tregard as \"the son of God\", as well as to the angels,\\n\\t\\t\\t\\twhom the pre-Islamic Arabs considered to be \"God's\\n\\t\\t\\t\\tdaughters\" (since they were conceived of as females)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "27",
    "NoteID": "35",
    "Body": "Lit., \"they do not precede Him in speech\" - meaning that\\n\\t\\t\\t\\tthey proclaim only what He has revealed to them and\\n\\t\\t\\t\\tbidden them to proclaim."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "28",
    "NoteID": "36",
    "Body": "See note [247] on  2:255 ."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "28",
    "NoteID": "37",
    "Body": "Cf.  19:87  and  20:109 . Regarding the problem of\\n\\t\\t\\t\\t\"intercession\" as such, see note [7] on  10:3 ."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "30",
    "NoteID": "38",
    "Body": "It is, as a rule, futile to make an explanation of the\\n\\t\\t\\t\\tQur'an dependent on \"scientific findings\" which may\\n\\t\\t\\t\\tappear true today, but may equally well be disproved\\n\\t\\t\\t\\ttomorrow by new findings. Nevertheless, the above\\n\\t\\t\\t\\tunmistakable reference to the unitary origin of the\\n\\t\\t\\t\\tuniverse - metonymically described in the Qur'an as \"the\\n\\t\\t\\t\\theavens and the earth\" - strikingly anticipates the view\\n\\t\\t\\t\\tof almost all modern astrophysicists that this universe\\n\\t\\t\\t\\thas originated as one entity from one single element,\\n\\t\\t\\t\\tnamely, hydrogen, which became subsequently consolidated\\n\\t\\t\\t\\tthrough gravity and then separated into individual\\n\\t\\t\\t\\tnebulae, galaxies and solar systems, with further\\n\\t\\t\\t\\tindividual parts progressively breaking away to form new\\n\\t\\t\\t\\tentities in the shape of stars, planets and the latters'\\n\\t\\t\\t\\tsatellites. (Regarding the Qur'anic reference to the\\n\\t\\t\\t\\tphenomenon described by the trem \"expanding universe\",\\n\\t\\t\\t\\tsee  51:47  and the correesponding note [31].)"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "30",
    "NoteID": "39",
    "Body": "The statement that God \"made out of water every living\\n\\t\\t\\t\\tthing\" expresses most concisely a truth that is nowadays\\n\\t\\t\\t\\tuniversally accepted by science. It has a threefold\\n\\t\\t\\t\\tmeaning: (1) Water - and, specifically, the sea - was the\\n\\t\\t\\t\\tenvironment within which the prototype of all living\\n\\t\\t\\t\\tmatter originated; (2) among all the innumerable-existing\\n\\t\\t\\t\\tor conceivable-liquids, only water has the peculiar\\n\\t\\t\\t\\tproperties necessary for the emergence and development of\\n\\t\\t\\t\\tlife; and (3) the protoplasm, which is the physical basis\\n\\t\\t\\t\\tof every living cell -whether in plants or in animals-\\n\\t\\t\\t\\tand represents the only form of matter in which the\\n\\t\\t\\t\\tphenomenon of life are manifested, consists\\n\\t\\t\\t\\toverwhelmingly of water and is, thus, utterly dependent\\n\\t\\t\\t\\ton it.\\tread together with the preceding statement, which\\n\\t\\t\\t\\talludes to the unitary origin of the physical universe,\\n\\t\\t\\t\\tthe emrgence of life from and within equally unitary\\n\\t\\t\\t\\telement points to the existence of a unitary plan\\n\\t\\t\\t\\tunderlying all creation and, hence, to the xistence and\\n\\t\\t\\t\\toneness of the Creator.  this accent on the oneness of\\n\\t\\t\\t\\tGod and the unity of His creation is taken up again in\\n\\t\\t\\t\\tverse {92} below."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "31",
    "NoteID": "40",
    "Body": "See  16:15  and the corresponding note [11]."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "32",
    "NoteID": "41",
    "Body": "See note [4] on the first sentence of  13:2 , which seems\\n\\t\\t\\t\\tto have a similar meaning."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "34",
    "NoteID": "42",
    "Body": "This relates to the objection of the unbelievers,\\n\\t\\t\\t\\tmentioned in verse {3} of this surah, that Muhammad is\\n\\t\\t\\t\\t\"but a mortal like yourselves\", and connects also with\\n\\t\\t\\t\\tverses {7-8}, which stress that all of God's apostles\\n\\t\\t\\t\\twere but mortal men (cf. {3: 144})."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "34",
    "NoteID": "43",
    "Body": "The obvious implication is, \"and so We shall not grant it\\n\\t\\t\\t\\tunto thee, either\". Cf. {39: 30}-\"thou art bound to die\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "34",
    "NoteID": "44",
    "Body": "Lit., \"but if, then, thou shouldst die, will they live\\n\\t\\t\\t\\tforever?\"-implying an assumption on their part that they\\n\\t\\t\\t\\twould not be called to account on death and resurrection."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "35",
    "NoteID": "45",
    "Body": "Lit., \"you shall be brought back\", i.e., for judgment."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "36",
    "NoteID": "46",
    "Body": "Lit., \"see thee\": but since this verb has here obviously\\n\\t\\t\\t\\tan abstract meaning, relating to the message propounded\\n\\t\\t\\t\\tby the Prophet, it is best rendered as above."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "36",
    "NoteID": "47",
    "Body": "Sc., \"and dares to deny their reality although he is a\\n\\t\\t\\t\\tmere mortal like ourselves?\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "36",
    "NoteID": "48",
    "Body": "I.e., although they resent any aspersion cast on whatever\\n\\t\\t\\t\\tthings or forces they unthinkingly worship, they refuse\\n\\t\\t\\t\\tto acknowledge God's planning will manifested in every\\n\\t\\t\\t\\taspect of His creation."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "37",
    "NoteID": "49",
    "Body": "Lit., \"is created out of haste\" - i.e., he is by nature\\n\\t\\t\\t\\timbued with impatience: cf. last sentence of  17:11 . In\\n\\t\\t\\t\\tthe present context this refers to man's impatience\\n\\t\\t\\t\\tregarding things to come: in this case - as is obvious\\n\\t\\t\\t\\tfrom the sequence - his hasty refusal to believe in God's\\n\\t\\t\\t\\tcoming judgement."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "37",
    "NoteID": "50",
    "Body": "Cf. {16: 1} -\"God's judgment is [bound to] come: do not,\\n\\t\\t\\t\\tthen, call for its speedy advent!\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "38",
    "NoteID": "51",
    "Body": "The Qur'anic answer to this question is given in  7:187 ."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "41",
    "NoteID": "52",
    "Body": "See  6:10  (which has exactly the same wording) and the\\n\\t\\t\\t\\tcorresponding note [9]."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "42",
    "NoteID": "53",
    "Body": "The reference to God, in this context, as \"the Most\\n\\t\\t\\t\\tGracious\" (ar-rahman) is meant to bring out the fact that\\n\\t\\t\\t\\tHe - and He alone - is the protector of all creation."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "44",
    "NoteID": "54",
    "Body": "Lit., \"until their lives ('umur) grew long\"-i.e., until\\n\\t\\t\\t\\tthey grew accustomed to the thought that their prosperity\\n\\t\\t\\t\\twould last forever (Zamakhshari)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "44",
    "NoteID": "55",
    "Body": "For an explanation, see the identical phrase in  13:41 \\n\\t\\t\\t\\tand the corresponding notes [79] and [80]."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "45",
    "NoteID": "56",
    "Body": "Lit., \"whenever they are warned\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "48",
    "NoteID": "57",
    "Body": "See note [38] on  2:53 . The reference to the revelation\\n\\t\\t\\t\\tbestowed on the earlier prophets as \"the standard by\\n\\t\\t\\t\\twhich to discern the true from the false\" (al-furqan) has\\n\\t\\t\\t\\there a twofold implication: firstly, it alludes to the\\n\\t\\t\\t\\tQur’anic doctrine - explained in note [5] on  2:4  - of\\n\\t\\t\\t\\tthe historical continuity in all divine revelation, and,\\n\\t\\t\\t\\tsecondly, it stresses the fact that revelation - and\\n\\t\\t\\t\\trevelation alone - provides an absolute criterion of all\\n\\t\\t\\t\\tmoral valuation. Since the Mosaic dispensation as such\\n\\t\\t\\t\\twas binding on the children of Israel alone and remained\\n\\t\\t\\t\\tvalid only within a particular historical and cultural\\n\\t\\t\\t\\tcontext, the term al-furqan relates here not to the\\n\\t\\t\\t\\tMosaic Law as such, but to the fundamental ethical truths\\n\\t\\t\\t\\tcontained in the Torah and common to all divine\\n\\t\\t\\t\\trevelations."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "49",
    "NoteID": "58",
    "Body": "For an explanation of the above rendering of the\\n\\t\\t\\t\\texpression bi’l-ghayb, see note [3] on  2:3 ."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "51",
    "NoteID": "59",
    "Body": "The possessive pronoun \"his\" affixed to the noun rushd\\n\\t\\t\\t\\t(which, in this context, has the meaning of\\n\\t\\t\\t\\t\"consciousness of what is right\") emphasizes the highly\\n\\t\\t\\t\\tpersonal, intellectual quality of Abraham's progressive\\n\\t\\t\\t\\trealization of God's almightiness and uniqueness (cf.\\n\\t\\t\\t\\t{6:74-79} as well as note [69] on  6:83 ); while the\\n\\t\\t\\t\\texpression min qabl -rendered by me as \"long before [the\\n\\t\\t\\t\\ttime of Moses]\" - stresses, once again, the element of\\n\\t\\t\\t\\tcontinuity in man's religious insight and experience."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "58",
    "NoteID": "60",
    "Body": "Sc., \"for an explanation of what had happened\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "64",
    "NoteID": "61",
    "Body": "Lit., \"they turned to [or \"upon\"] themselves\", i.e.,\\n\\t\\t\\t\\tblaming one another."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "64",
    "NoteID": "62",
    "Body": "I.e., \"you are doing wrong to Abraham by rashly\\n\\t\\t\\t\\tsuspecting him\" (Tabari)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "65",
    "NoteID": "63",
    "Body": "Lit., \"they were turned upside down upon their heads\": an\\n\\t\\t\\t\\tidiomatic phrase denoting a \"mental somersault\" - in this\\n\\t\\t\\t\\tcase, a sudden reversal of their readiness to exonerate\\n\\t\\t\\t\\tAbraham and a return to their former suspicion."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "69",
    "NoteID": "64",
    "Body": "Nowhere does the Qur'an state that Abraham was actually,\\n\\t\\t\\t\\tbodily thrown into the fire and miraculously kept alive\\n\\t\\t\\t\\tin it: on the contrary, the phrase \"God saved him from\\n\\t\\t\\t\\tthe fire\" occurring in  29:24  points, rather, to the\\n\\t\\t\\t\\tfact of his not having been thrown into it. On the other\\n\\t\\t\\t\\thand, the many elaborate (and conflicting) stories with\\n\\t\\t\\t\\twhich the classical commentators have embroidered their\\n\\t\\t\\t\\tinterpretation of the above verse can invariably be\\n\\t\\t\\t\\ttraced back to Talmudic legends and may, therefore, be\\n\\t\\t\\t\\tdisregarded. What the Qur'an gives us here, as well as in\\n\\t\\t\\t\\t 29:24  and  37:97 , is apparently an allegorical\\n\\t\\t\\t\\tallusion to the fire of persecution which Abraham had to\\n\\t\\t\\t\\tsuffer and which, by dint of its intensity, was to become\\n\\t\\t\\t\\tin his later life a source of spiritual strength and\\n\\t\\t\\t\\tinner peace (salam). Regarding the deeper implications of\\n\\t\\t\\t\\tthe term salam, see note [29] on  5:16 ."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "70",
    "NoteID": "65",
    "Body": "Inasmuch as Abraham forsook - as shown in the next verse\\n\\t\\t\\t\\t- his homeland, and thus abandoned his people to their\\n\\t\\t\\t\\tspiritual ignorance."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "71",
    "NoteID": "66",
    "Body": "Lit., \"for all the worlds\" or \"for all people\": i.e.,\\n\\t\\t\\t\\tPalestine, which subsequently became the homeland of a\\n\\t\\t\\t\\tlong line of prophets. (Abraham's native place - and the\\n\\t\\t\\t\\tscene of his early struggles against polytheism - was Ur\\n\\t\\t\\t\\tin Mesopotamia.)"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "72",
    "NoteID": "67",
    "Body": "I.e., in addition (nafilatan) to his eldest son Ishmael\\n\\t\\t\\t\\t(Isma'll) who had been born years before Isaac."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "74",
    "NoteID": "68",
    "Body": "For the story of Lot, see {7:80-84}, {11:77-83} and\\n\\t\\t\\t\\t{15:58-76}."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "76",
    "NoteID": "69",
    "Body": "I.e., the Deluge. The story of Noah is mentioned several\\n\\t\\t\\t\\ttimes in the Qur'an, and particularly in {11:25-48}.\\n\\t\\t\\t\\tRegarding the Deluge itself, see surah {7}, note [47]."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "78",
    "NoteID": "70",
    "Body": "For an elucidation of the story - or, rather, legend - to\\n\\t\\t\\t\\twhich the above verse alludes, we must rely exclusively\\n\\t\\t\\t\\ton the Companions of the Prophet, since neither the\\n\\t\\t\\t\\tQur'an nor any authentic saying of the Prophet speels it\\n\\t\\t\\t\\tout to us. However, the fact that a good many Companions\\n\\t\\t\\t\\tand their immediate successors (tabi'un) fully agreed on\\n\\t\\t\\t\\tthe substance of the story, differing only in one or two\\n\\t\\t\\t\\tinsignificant details' seems to indicate that at that\\n\\t\\t\\t\\tperiod it was already well-established in ancient Arabian\\n\\t\\t\\t\\ttradition (cf. note [77] below). According to this story,\\n\\t\\t\\t\\ta flock of sheep strayed at night into a neighbouring\\n\\t\\t\\t\\tfield and destroyed its crop.  The case was brought\\n\\t\\t\\t\\tbefore King David for judicial decision. On finding that\\n\\t\\t\\t\\tthe incident was due to the negligence of the owner of\\n\\t\\t\\t\\tthe sheep, David awarded the whole flock - the value of\\n\\t\\t\\t\\twhich corresponded roughly to the extent of the damage -\\n\\t\\t\\t\\tas an indemnity to the owner of the field.  David's young\\n\\t\\t\\t\\tson, Solomon, regarded this judgement as too severe,\\n\\t\\t\\t\\tinasmuch as the sheep represented the defendant's\\n\\t\\t\\t\\tcapital, whereas the damage was of a transitory nature,\\n\\t\\t\\t\\tinvolving no more than the loss of one year's crop, i.e.,\\n\\t\\t\\t\\tof income.  He therefore suggested to his father that the\\n\\t\\t\\t\\tjudgement should be altered: the owner of the field\\n\\t\\t\\t\\tshould have the temporary possession and usufruct of the\\n\\t\\t\\t\\tsheep (sheep, wool, new-born lambs, etc.), while their\\n\\t\\t\\t\\towner should tend the damaged field until it was restored\\n\\t\\t\\t\\tto its former productivity, whereupon both the field and\\n\\t\\t\\t\\tthe flock of sheep would revert to their erstwhile\\n\\t\\t\\t\\towners; in this way the plaintiff would be fully\\n\\t\\t\\t\\tcompensated for his loss without depriving the defendant\\n\\t\\t\\t\\tof his substance.  David realized taht his son'd solution\\n\\t\\t\\t\\tof the case was better than his own, and passed judgement\\n\\t\\t\\t\\taccordingly; but since he, no less than Solomon, had been\\n\\t\\t\\t\\tinspired by a deep sense of justice, God - in the words\\n\\t\\t\\t\\tof the Qur'an - \"bore witness to their judgement\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "79",
    "NoteID": "71",
    "Body": "I.e., the fact that Solomon's judgment was more profound\\n\\t\\t\\t\\tdid not disprove the intrinsic justice of David's\\n\\t\\t\\t\\toriginal judgment or deprive it of its merit."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "79",
    "NoteID": "72",
    "Body": "Lit., \"We compelled\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "79",
    "NoteID": "73",
    "Body": "A reference to the Psalms of David, which call upon all\\n\\t\\t\\t\\tnature to extol the glory of God - similar to the\\n\\t\\t\\t\\tQur'anic verses, \"The seven heavens extol His limitless\\n\\t\\t\\t\\tglory, and the earth, and all that they contain\"\\n\\t\\t\\t\\t( 17:44 ), or \"All that is in the heavens and on earth\\n\\t\\t\\t\\textols God's limitless glory\" ( 57:1 )."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "80",
    "NoteID": "74",
    "Body": "The noun labus is synonymous with libas or libs,\\n\\t\\t\\t\\tsignifying \"a garment\" or \"garments\" (Qamus, Lisan\\n\\t\\t\\t\\tal-'Arab). But since this term has occasionally been used\\n\\t\\t\\t\\tby pre-Islamic Arabs in the sense of \"mail\" or \"coats of\\n\\t\\t\\t\\tmail\" (ibid.), the classical commentators assume that it\\n\\t\\t\\t\\thas this meaning in the above context as well; and in\\n\\t\\t\\t\\tthis they rely on the - otherwise unsupported - statement\\n\\t\\t\\t\\tof the tabi'i Qatadah to the effect that \"David was the\\n\\t\\t\\t\\tfirst to make chain mail\" (Tabari). Accordingly, they\\n\\t\\t\\t\\tunderstand the term ba's which occurs at the end of the\\n\\t\\t\\t\\tsentence in its secondary sense of \"war\" or \"warlike\\n\\t\\t\\t\\tviolence\", and interpret the relevant part of the verse\\n\\t\\t\\t\\tthus: \"We taught him how to make coats of mail for you,\\n\\t\\t\\t\\tso that they might fortify you against your [mutual acts\\n\\t\\t\\t\\tof] violence\", or \"against [the effects of] your warlike\\n\\t\\t\\t\\tviolence\". One should, however, bear in mind that ba's\\n\\t\\t\\t\\tsignifies also \"harm\", \"misfortune\", \"distress\", etc., as\\n\\t\\t\\t\\twell as \"danger\"; hence it denotes, it its widest sense,\\n\\t\\t\\t\\tanything that causes distress or fear (Taj al-'Arus). If\\n\\t\\t\\t\\twe adopt this last meaning, the term labus may be\\n\\t\\t\\t\\tunderstood in its primary significance of \"garment\" - in\\n\\t\\t\\t\\tthis case, the metaphorical \"garment of\\n\\t\\t\\t\\tGod-consciousness\" (libas at-taqwa) of which the Qur'an\\n\\t\\t\\t\\tspeaks in  7:26 . Rendered in this sense, the above verse\\n\\t\\t\\t\\texpresses the idea that the Almighty taught David how to\\n\\t\\t\\t\\timbue his followers with that deep God-consciousness\\n\\t\\t\\t\\twhich frees men from all spiritual distress and all\\n\\t\\t\\t\\tfears, whether it be fear of one another or the\\n\\t\\t\\t\\tsubconscious fear of the Unknown. The concluding\\n\\t\\t\\t\\trhetorical question, \"but are you grateful [for this\\n\\t\\t\\t\\tboon]?\" implies that, as a rule, man does not fully\\n\\t\\t\\t\\trealize - and, hence, is not really grateful for- the\\n\\t\\t\\t\\tspiritual bounty thus offered him by God."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "81",
    "NoteID": "75",
    "Body": "This is apparently an allusion to the fleets of sailing\\n\\t\\t\\t\\tships which brought untold riches to Palestine (\"the land\\n\\t\\t\\t\\twhich We had blessed\") and made Solomon’s wealth\\n\\t\\t\\t\\tproverbial."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "82",
    "NoteID": "76",
    "Body": "My rendering, in this particular context, of shayatin\\n\\t\\t\\t\\t(lit., \"satans\") as \"rebellious forces\" is based on the\\n\\t\\t\\t\\ttropical use of the term shaytan in the sense of anything\\n\\t\\t\\t\\t\"rebellious\", \"inordinately proud\" or \"insolent\" (cf.\\n\\t\\t\\t\\tLane IV, 1552)-in this case, possibly a reference to\\n\\t\\t\\t\\tsubdued and enslaved enemies or, more probably, to\\n\\t\\t\\t\\t\"rebellious\" forces of nature which Solomon was able to\\n\\t\\t\\t\\ttame and utilize; however, see also next note."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "82",
    "NoteID": "77",
    "Body": "In this as well as in several other passages relating to\\n\\t\\t\\t\\tSolomon, the Qur'an alludes to the many poetic legends\\n\\t\\t\\t\\twhich were associated with his name since early antiquity\\n\\t\\t\\t\\tand had become part and parcel of Judaeo-Christian and\\n\\t\\t\\t\\tArabian lore long before the advent of Islam. Although it\\n\\t\\t\\t\\tis undoubtedly possible to interpret such passages in a\\n\\t\\t\\t\\t\"rationalistic\" manner, I do not think that this is\\n\\t\\t\\t\\treally necessary. Because they were so deeply ingrained\\n\\t\\t\\t\\tin the imagination of the people to whom the Qur'an\\n\\t\\t\\t\\taddressed itself in the first instance, these legendary\\n\\t\\t\\t\\taccounts of Solomon's wisdom and magic powers had\\n\\t\\t\\t\\tacquired a cultural reality of their own and were,\\n\\t\\t\\t\\ttherefore, eminently suited to serve as a medium for the\\n\\t\\t\\t\\tparabolic exposition of certain ethical truths with which\\n\\t\\t\\t\\tthis book is concerned: and so, without denying or\\n\\t\\t\\t\\tconfirming their mythical character, the Qur'an uses them\\n\\t\\t\\t\\tas a foil for the idea that God is the ultimate source of\\n\\t\\t\\t\\tall human power and glory, and that all achievements of\\n\\t\\t\\t\\thuman ingenuity, even though they may sometimes border on\\n\\t\\t\\t\\tthe miraculous, are but an expression of His\\n\\t\\t\\t\\ttranscendental creativity."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "83",
    "NoteID": "78",
    "Body": "The story of Job (Ayyub in Arabic), describing his\\n\\t\\t\\t\\terstwhile happiness and prosperity, his subsequent trials\\n\\t\\t\\t\\tand tribulations, the loss of all his children and his\\n\\t\\t\\t\\tproperty, his own loathsome illness and utter despair\\n\\t\\t\\t\\tand, finally, God's reward of his patience in adversity,\\n\\t\\t\\t\\tis given in full in the Old Testament (The Book of Job).\\n\\t\\t\\t\\tThis Biblical, highly philosophical epic is most probably\\n\\t\\t\\t\\ta Hebrew translation or paraphrase - still evident in the\\n\\t\\t\\t\\tlanguage employed-of an ancient Naba-taean (i.e.,\\n\\t\\t\\t\\tNorth-Arabian) poem, for \"Job, the author of the finest\\n\\t\\t\\t\\tpiece of poetry that the ancient Semitic world produced,\\n\\t\\t\\t\\twas an Arab, not a Jew, as the form of his name (Iyyob)\\n\\t\\t\\t\\tand the scene of his book, North Arabia, indicate\"\\n\\t\\t\\t\\t(Philip K. Hitti, History of the Arabs, London 1937, pp.\\n\\t\\t\\t\\t42-43). Since God \"spoke\" to him, Job ranks in the Qur'an\\n\\t\\t\\t\\tamong the prophets, personifying the supreme virtue of\\n\\t\\t\\t\\tpatience in adversity (sabr)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "84",
    "NoteID": "79",
    "Body": "Lit., \"his family\" - i.e., new children in place of those\\n\\t\\t\\t\\twho had died."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "85",
    "NoteID": "80",
    "Body": "See surah {19}, note [41]."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "85",
    "NoteID": "81",
    "Body": "Lit., \"and him of the pledge\". The expression dhu 'l-kifl\\n\\t\\t\\t\\tis derived from the verb kafala - and especially the form\\n\\t\\t\\t\\ttakaffala - which signifies \"he became responsible [for\\n\\t\\t\\t\\tsomething or someone]\" or pledged himself [to do\\n\\t\\t\\t\\tsomething]\". Although the classical commentators consider\\n\\t\\t\\t\\tdhu 'l kifl to be the peithet or the proper name of a\\n\\t\\t\\t\\tparticular prophet - whom they variously, more or less at\\n\\t\\t\\t\\trandm, identify with Elijah or Joshua or Zachariah or\\n\\t\\t\\t\\tEzekiel - I fail to see any reason whatever for such\\n\\t\\t\\t\\tattempts at \"identification\", the more so since we have\\n\\t\\t\\t\\tnot a single authentic hadith which would mention, or\\n\\t\\t\\t\\teven distantly allude to, a prophet by this name.  I am,\\n\\t\\t\\t\\ttherefore, of the opinion that we have here (as in the\\n\\t\\t\\t\\tidentical expression in  38:48 ) a generic term applying\\n\\t\\t\\t\\tto every one of the prophets, inasmuch as each of them\\n\\t\\t\\t\\tpledged himself unreservedly to God and accepted the\\n\\t\\t\\t\\tresponsibility for delivering His message to man."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "87",
    "NoteID": "82",
    "Body": "I.e., the Prophet Jonah, who is said to have been\\n\\t\\t\\t\\tswallowed by a \"great fish\", as mentioned in {37: 139}\\n\\t\\t\\t\\tff. and more fully narrated in the Old Testament (The\\n\\t\\t\\t\\tBook of Jonah)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "87",
    "NoteID": "83",
    "Body": "According to the Biblical account (which more or less\\n\\t\\t\\t\\tagrees with the Qur'anic references to his story), Jonah\\n\\t\\t\\t\\twas a prophet sent to the people of Nineveh, the capital\\n\\t\\t\\t\\tof Assyria. At first his preaching was disregarded by his\\n\\t\\t\\t\\tpeople, and he left them in anger, thus abandoning the\\n\\t\\t\\t\\tmission entrusted to him by God; in the words of the\\n\\t\\t\\t\\tQur'an ({37: 140}), \"he fled like a runaway slave\". The\\n\\t\\t\\t\\tallegory of his temporary punishment and his subsequent\\n\\t\\t\\t\\trescue and redemption is referred to elsewhere in the\\n\\t\\t\\t\\tQur'an (i.e., in {37:139-148}) and explained in the\\n\\t\\t\\t\\tcorresponding notes. It is to that punishment, repentance\\n\\t\\t\\t\\tand salvation that the present and the next verse allude.\\n\\t\\t\\t\\t(The redemption of Jonah's people is mentioned in  10:98 \\n\\t\\t\\t\\tand {37:147-148}.)"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "87",
    "NoteID": "84",
    "Body": "Lit., \"I was among the wrongdoers\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "89",
    "NoteID": "85",
    "Body": "Lit., \"Thou art the best of inheritors\" - a phrase\\n\\t\\t\\t\\texplained in note [22] on  15:23 . The words interpolated\\n\\t\\t\\t\\tby me between brackets correspond to Zamakhshari's and\\n\\t\\t\\t\\tRazi's interpretation of this phrase. For more detailed\\n\\t\\t\\t\\treferences to Zachariah, father of John the Baptist, see\\n\\t\\t\\t\\t 3:37  ff. and  19:2  ff."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "90",
    "NoteID": "86",
    "Body": "Lit., \"for We had made his wife fit for him\", i.e., after\\n\\t\\t\\t\\ther previous barrenness."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "91",
    "NoteID": "87",
    "Body": "This allegorical expression, used here with reference to\\n\\t\\t\\t\\tMary's conception of Jesus, has been widely - and\\n\\t\\t\\t\\terroneously - interpreted as relating specifically to his\\n\\t\\t\\t\\tbirth. As a matter of fact, the Qur'an uses the same\\n\\t\\t\\t\\texpression in three other places with reference to the\\n\\t\\t\\t\\tcreation of man in general - namely in {15 :29} and\\n\\t\\t\\t\\t 38:72 , \"when I have formed him... and breathed into him\\n\\t\\t\\t\\tof My spirit\"; and in  32:9 , \"and thereupon He forms\\n\\t\\t\\t\\t[lit., \"formed\"] him fully and breathes [lit.,\\n\\t\\t\\t\\t\"breathed\"] into him of His spirit\". In particular, the\\n\\t\\t\\t\\tpassage of which the last-quoted phrase is a part (i.e.,\\n\\t\\t\\t\\t{32:7-9}) makes it abundantly and explicitly clear that\\n\\t\\t\\t\\tGod \"breathes of His spirit\" into every human being.\\n\\t\\t\\t\\tCommenting on the verse under consideration, Zamakhshari\\n\\t\\t\\t\\tstates that \"the breathing of the spirit [of God] into a\\n\\t\\t\\t\\tbody signifies the endowing it with life\": an explanation\\n\\t\\t\\t\\twith which Razi concurs. (In this connection, see also\\n\\t\\t\\t\\tnote [181] on  4:171 .) As for the description of Mary as\\n\\t\\t\\t\\tallati ahsanat farjaha, idiomatically denoting \"one who\\n\\t\\t\\t\\tguarded her chastity\" (lit., \"her private parts\"), it is\\n\\t\\t\\t\\tto be borne in mind that the term ihsan - lit., \"[one's]\\n\\t\\t\\t\\tbeing fortified [against any danger or evil]\" - has the\\n\\t\\t\\t\\ttropical meaning of \"abstinence from what is unlawful or\\n\\t\\t\\t\\treprehensible\" (Tarj al-'Arus), and especially from\\n\\t\\t\\t\\tillicit sexual intercourse, and is applied to a man as\\n\\t\\t\\t\\twell as a woman: thus, for instance, the terms muhsan and\\n\\t\\t\\t\\tmuhsanah are used elsewhere in the Qur'an to describe,\\n\\t\\t\\t\\trespectively, a man or a woman who is \"fortified [by\\n\\t\\t\\t\\tmarriage] against unchastity\". Hence, the expression\\n\\t\\t\\t\\tallati ahsanat farjaha, occurring in the above verse as\\n\\t\\t\\t\\twell as in {66: 12} with reference to Mary, is but meant\\n\\t\\t\\t\\tto stress her outstanding chastity and complete\\n\\t\\t\\t\\tabstinence, in thought as well as in deed, from anything\\n\\t\\t\\t\\tunlawful or morally reprehensible: in other words, a\\n\\t\\t\\t\\trejection of the calumny (referred to in  4:156  and\\n\\t\\t\\t\\tobliquely alluded to in {19:27-28}) that the birth of\\n\\t\\t\\t\\tJesus was the result of an \"illicit union\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "91",
    "NoteID": "88",
    "Body": "For my rendering of the term ayah as \"symbol\", see surah\\n\\t\\t\\t\\t{17}, note [2], and surah {19}, note [16]."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "92",
    "NoteID": "89",
    "Body": "After calling to mind, in verses {48-91}, some of the\\n\\t\\t\\t\\tearlier prophets, all of whom stressed the oneness and\\n\\t\\t\\t\\tuniqueness of God, the discourse returns to that\\n\\t\\t\\t\\tprinciple of oneness as it ought to be reflected in the\\n\\t\\t\\t\\tunity of all who believe in Him. (See {23: 51} ff.)"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "93",
    "NoteID": "90",
    "Body": "This is the meaning of the idiomatic phrase, taqatta'u\\n\\t\\t\\t\\tamrahum baynahum. As Zamakhshari points out, the sudden\\n\\t\\t\\t\\tturn of the discourse from the second person plural to\\n\\t\\t\\t\\tthe third person is indicative of God's severe\\n\\t\\t\\t\\tdisapproval-His \"turning away\", as it were, from those\\n\\t\\t\\t\\twho are or were guilty of breaking the believers' unity.\\n\\t\\t\\t\\t(See also  23:53  and the corresponding note [30].)"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "94",
    "NoteID": "91",
    "Body": "I.e., even a breach of religious unity may not be\\n\\t\\t\\t\\tunforgivable so long as it does not involve a worship of\\n\\t\\t\\t\\tfalse deities or false moral values (cf. verses {98-99}\\n\\t\\t\\t\\tbelow): this is the meaning of the stress, in this\\n\\t\\t\\t\\tcontext, on man's being \"a believer withal\" -an echo of\\n\\t\\t\\t\\tthe principle clearly spelt out in  2:62  and several\\n\\t\\t\\t\\tother Qur'anic passages."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "95",
    "NoteID": "92",
    "Body": "Lit., \"an inviolable law (haram) upon ...\", expressing\\n\\t\\t\\t\\tthe impossibility of conceiving anything to the contrary\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "95",
    "NoteID": "93",
    "Body": "I.e., whenever God consigns a community to destruction,\\n\\t\\t\\t\\tHe does it not because of its people's occasional lapses\\n\\t\\t\\t\\tbut only because of their irremediable, conscious\\n\\t\\t\\t\\tunwillingness to forsake their sinful ways."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "96",
    "NoteID": "94",
    "Body": "I.e., until the Day of Resurrection, heralded by the\\n\\t\\t\\t\\tallegorical break-through of \"Gog and Magog\" (see surah\\n\\t\\t\\t\\t{18}, note [100], especially the last sentence): for it\\n\\t\\t\\t\\tis on that Day that even the most hardened sinner will at\\n\\t\\t\\t\\tlast realize his guilt and be filled with belated\\n\\t\\t\\t\\tremorse.-The term hadab literally denotes \"raised ground\"\\n\\t\\t\\t\\tor \"elevation\", but the expression min kulli hadabin is\\n\\t\\t\\t\\tused here idiomatically, signifying \"from all directions\"\\n\\t\\t\\t\\tor \"from every corner [of the earth]\": an allusion to the\\n\\t\\t\\t\\tirresistible nature of the social and cultural\\n\\t\\t\\t\\tcatastrophes which will overwhelm mankind before the\\n\\t\\t\\t\\tcoming of the Last Hour."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "97",
    "NoteID": "95",
    "Body": "I.e., deliberately and without any excuse, since all the\\n\\t\\t\\t\\tprophets had warned man of the Day of Resurrection and\\n\\t\\t\\t\\tJudgment: cf. {14:44-45}. The words \"bent on\"\\n\\t\\t\\t\\tinterpolated by me within brackets indicate intent,\\n\\t\\t\\t\\tsimilar to the preceding expression alladhina kafaru,\\n\\t\\t\\t\\t\"those who were bent on denying the truth\" (see also note\\n\\t\\t\\t\\t[6] on  2:6 )."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "98",
    "NoteID": "96",
    "Body": "Lit., \"you are bound to reach it\". The expression \"all\\n\\t\\t\\t\\tthat you have worshipped instead of God\" comprises not\\n\\t\\t\\t\\tmerely all false religious imagery but also all false\\n\\t\\t\\t\\tethical values endowed with quasi-divine sanctity, all of\\n\\t\\t\\t\\twhich are but \"the fuel of hell\"."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "100",
    "NoteID": "97",
    "Body": "Thus, spiritual \"deafness\" in the life to come will be\\n\\t\\t\\t\\tthe inexorable consequence of one's having remained deaf,\\n\\t\\t\\t\\tin this world, to the voice of truth, just as \"blindness\"\\n\\t\\t\\t\\tand oblivion will be part of the suffering of all who\\n\\t\\t\\t\\thave been spiritually blind to the truth (cf.\\n\\t\\t\\t\\t{20:124-126})."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "101",
    "NoteID": "98",
    "Body": "I.e., those who have been promised paradise on account of\\n\\t\\t\\t\\ttheir faith and their good deeds. 99  See in this\\n\\t\\t\\t\\tconnection  14:48  and the corresponding note [63]."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "105",
    "NoteID": "100",
    "Body": "Lit., \"after the reminder (adh-dhikr)\". For the deeper\\n\\t\\t\\t\\timplications of the Qur'anic term dhikr, see note [13] on\\n\\t\\t\\t\\tverse {10} of this surah."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "105",
    "NoteID": "101",
    "Body": "Zabur (lit., \"scripture\" or \"book\") is a generic term\\n\\t\\t\\t\\tdenoting any \"book of wisdom\": hence, any and all of the\\n\\t\\t\\t\\tdivine scriptures revealed by God to the prophets\\n\\t\\t\\t\\t(Tabari). The statement that \"My righteous servants shall\\n\\t\\t\\t\\tinherit the earth\" is obviously an echo of the promise,\\n\\t\\t\\t\\t\"You are bound to rise high if you are [truly] believers\"\\n\\t\\t\\t\\t({3: 139}) - the implication being that it is only\\n\\t\\t\\t\\tthrough faith in God and righteous behaviour on earth\\n\\t\\t\\t\\tthat man can reach the heights envisaged for him by his\\n\\t\\t\\t\\tCreator's grace."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "107",
    "NoteID": "102",
    "Body": "I.e., towards all mankind. For an elucidation of this\\n\\t\\t\\t\\tfundamental principle underlying the message of the\\n\\t\\t\\t\\tQur'an, see  7:158  and the corresponding note [126]. The\\n\\t\\t\\t\\tuniversality of the Qur'anic revelation arises from three\\n\\t\\t\\t\\tfactors: firstly, its appeal to all mankind irrespective\\n\\t\\t\\t\\tof descent, race or cultural environment; secondly, the\\n\\t\\t\\t\\tfact that it appeals exclusively to man's reason and,\\n\\t\\t\\t\\thence, does not postulate any dogma that could be\\n\\t\\t\\t\\taccepted on the basis of blind faith alone; and, finally,\\n\\t\\t\\t\\tthe fact that - contrary to all other sacred scriptures\\n\\t\\t\\t\\tknown to history - the Qur'an has remained entirely\\n\\t\\t\\t\\tunchanged in its wording ever since its revelation\\n\\t\\t\\t\\tfourteen centuries ago and will, because it is so widely\\n\\t\\t\\t\\trecorded, forever remain so in accordance with the divine\\n\\t\\t\\t\\tpromise, \"it is We who shall truly guard it [from all\\n\\t\\t\\t\\tcorruption]\" (cf.  15:9  and the corresponding note\\n\\t\\t\\t\\t[10]). It is by virtue of these three factors that the\\n\\t\\t\\t\\tQur'an represents the final stage of all divine\\n\\t\\t\\t\\trevelation, and that the Prophet through whom it has been\\n\\t\\t\\t\\tconveyed to mankind is stated to have been the last (in\\n\\t\\t\\t\\tQur'anic terminology, \"the seal\") of all prophets (cf.\\n\\t\\t\\t\\t 33:40 )."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "108",
    "NoteID": "103",
    "Body": "Cf. the first sentence of verse {45} of this surah. This\\n\\t\\t\\t\\tstress on divine revelation as the only source of the\\n\\t\\t\\t\\tProphet's knowledge referred to in the sequence is\\n\\t\\t\\t\\texpressed, in Arabic, by means of the restrictive\\n\\t\\t\\t\\tparticle innama."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "109",
    "NoteID": "104",
    "Body": "The expression 'ala sawa (lit., \"in an equitable manner\")\\n\\t\\t\\t\\tcomprises in this context two distinct concepts: that of\\n\\t\\t\\t\\tfairness as regards the clarity and unambiguity of the\\n\\t\\t\\t\\tabove announcement, as well as of equality, implying that\\n\\t\\t\\t\\tit is being made to all human beings alike; hence my\\n\\t\\t\\t\\tcomposite rendering of this phrase."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "111",
    "NoteID": "105",
    "Body": "Lit., \"enjoyment [of life] for a while\": i.e., a chance,\\n\\t\\t\\t\\tmercifully granted by God, to attain to"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "112",
    "NoteID": "106",
    "Body": "See note [5] on verse {4} of this surah."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "112",
    "NoteID": "107",
    "Body": "Lit., \"against {'ala) all that you attribute [to Him] by\\n\\t\\t\\t\\tway of description\" or \"of definition\" (see note [88] on\\n\\t\\t\\t\\tthe last sentence of  6:100 ): implying that only God's\\n\\t\\t\\t\\tgrace can save man from the blasphemous attempts -\\n\\t\\t\\t\\tprompted by his inherent weakness - to bring God \"closer\"\\n\\t\\t\\t\\tto his own, human understanding by means of\\n\\t\\t\\t\\thumanly-conceived \"definitions\" of Him who is\\n\\t\\t\\t\\ttranscendent, infinite and unfathomable."
  }
]
