[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/060001",
        "Body":  "O ye who believe! Choose not My enemy and your enemy for friends.\n\t\t\tDo ye give them friendship when they disbelieve in that truth\n\t\t\twhich hath come unto you, driving out the messenger and you\n\t\t\tbecause ye believe in Allah, your Lord? If ye have come forth to\n\t\t\tstrive in My way and seeking My good pleasure, (show them not\n\t\t\tfriendship). Do ye show friendship unto them in secret, when I am\n\t\t\tbest Aware of what ye hide and what ye proclaim? And whosoever\n\t\t\tdoeth it among you, be verily hath strayed from the right way."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/060010",
        "Body":  "O ye who believe! When believing women come unto you as\n\t\t\tfugitives, examine them. Allah is best aware of their faith.\n\t\t\tThen, if ye know them for true believers, send them not back unto\n\t\t\tthe disbelievers. They are not lawful for the disbelievers, nor\n\t\t\tare the disbelievers lawful for them. And give the disbelievers\n\t\t\tthat which they have spent (upon them). And it is no sin for you\n\t\t\tto marry such women when ye have given them their dues. And hold\n\t\t\tnot to the ties of disbelieving women; and ask for (the return\n\t\t\tof) that which ye have spent; and let the disbelievers ask for\n\t\t\tthat which they have spent. That is the judgment of Allah. He\n\t\t\tjudgeth between you. Allah is Knower, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/060011",
        "Body":  "And if any of your wives have gone from you unto the disbelievers\n\t\t\tand afterward ye have your turn (of triumph), then give unto\n\t\t\tthose whose wives have gone the like of that which they have\n\t\t\tspent, and keep your duty to Allah in whom ye are believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/060012",
        "Body":  "O Prophet! If believing women come unto thee, taking oath of\n\t\t\tallegiance unto thee that they will ascribe nothing as partner\n\t\t\tunto Allah, and will neither steal nor commit adultery nor kill\n\t\t\ttheir children, nor produce any lie that they have devised\n\t\t\tbetween their hands and feet, nor disobey thee in what is right,\n\t\t\tthen accept their allegiance and ask Allah to forgive them. Lo!\n\t\t\tAllah is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/060013",
        "Body":  "O ye who believe! Be not friendly with a folk with whom Allah is\n\t\t\twroth, (a folk) who have despaired of the Hereafter as the\n\t\t\tdisbelievers despair of those who are in the graves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/060002",
        "Body":  "If they have the upper hand of you, they will be your foes, and\n\t\t\twill stretch out their hands and their tongues toward you with\n\t\t\tevil (intent), and they long for you to disbelieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/060003",
        "Body":  "Your ties of kindred and your children will avail you naught upon\n\t\t\tthe Day of Resurrection. He will part you. Allah is Seer of what\n\t\t\tye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/060004",
        "Body":  "There is a goodly pattern for you in Abraham and those with him,\n\t\t\twhen they told their folk: Lo! we are guiltless of you and all\n\t\t\tthat ye worship beside Allah. We have done with you. And there\n\t\t\thath arisen between us and you hostility and hate for ever until\n\t\t\tye believe in Allah only --save that which Abraham promised his\n\t\t\tfather (when he said): I will ask forgiveness for thee, though I\n\t\t\town nothing for thee from Allah Our Lord! In Thee we put our\n\t\t\ttrust, and unto Thee we turn repentant, and unto Thee is the\n\t\t\tjourneying."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/060005",
        "Body":  "Our Lord! Make us not a prey for those who disbelieve, and\n\t\t\tforgive us, our Lord! Lo! Thou, only Thou, art the Mighty, the\n\t\t\tWise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/060006",
        "Body":  "Verily ye have in them a goodly pattern for everyone who looketh\n\t\t\tto Allah and the Last Day. And whosoever may turn away, lo! still\n\t\t\tAllah, He is the Absolute, the Owner of Praise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/060007",
        "Body":  "It may be that Allah will ordain love between you and those of\n\t\t\tthem with whom ye are at enmity. Allah is Mighty, and Allah is\n\t\t\tForgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/060008",
        "Body":  "Allah forbiddeth you not those who warred not against you on\n\t\t\taccount of religion and drove you not out from your homes, that\n\t\t\tye should show them kindness and deal justly with them. Lo! Allah\n\t\t\tloveth the just dealers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "60",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/060009",
        "Body":  "Allah forbiddeth you only those who warred against you on account\n\t\t\tof religion and have driven you out from your homes and helped to\n\t\t\tdrive you out, that ye make friends of them. Whosoever maketh\n\t\t\tfriends of them--(All) such are wrong doers."
    }
]
