[
  {
    "SurahNumber": "76",
    "AyahNumber": "1",
    "NoteID": "5830",
    "Body": "The undoubted fact is mentioned in the form of a\\n\\t\\t\\t\\tquestion, to get the assent of man. It is certain that\\n\\t\\t\\t\\tthe physical world existed long before man was ever heard\\n\\t\\t\\t\\tof or mentioned, as geological records prove. It is also\\n\\t\\t\\t\\ttrue that the world existed long before man came on the\\n\\t\\t\\t\\tscene: see ii. 30-31. Man is here taken in a generic\\n\\t\\t\\t\\tsense."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "1",
    "NoteID": "5831",
    "Body": "Dahr is Time as a whole, or for a long period."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "2",
    "NoteID": "5832",
    "Body": "Mingled: the female ovum has to be fertilised with the\\n\\t\\t\\t\\tmale sperm before a new animal can be born. Man as an\\n\\t\\t\\t\\tanimal has this humble origin. But he has been given the\\n\\t\\t\\t\\tgift of certain faculties of receiving instruction\\n\\t\\t\\t\\t(typified by Hearing) and of intellectual and spiritual\\n\\t\\t\\t\\tinsight (typified by Sight). His life has therefore a\\n\\t\\t\\t\\tmeaning: with a certain amount of free-will, he is to be\\n\\t\\t\\t\\tvicegerent on earth (ii. 30). But he must be trained and\\n\\t\\t\\t\\ttried, and that is the whole problem of human life."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "3",
    "NoteID": "5833",
    "Body": "Besides the gift of the faculties, Man has been shown the\\n\\t\\t\\t\\tWay by means of Revelation, through men of the highest\\n\\t\\t\\t\\tspiritual standing. If he is grateful, he will accept\\n\\t\\t\\t\\tGuidance, be of the Righteous, and join the company of\\n\\t\\t\\t\\tthe Blessed. If not, he puts chains round himself, thus\\n\\t\\t\\t\\tburdening himself with sin, and gets into the Blazing\\n\\t\\t\\t\\tFire of Punishment. See next verse. His choice rests on\\n\\t\\t\\t\\this will."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "4",
    "NoteID": "5834",
    "Body": "Cf. xiii. 5; xxxiv. 33 and xl. 71."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "5",
    "NoteID": "5835",
    "Body": "Kafur is literally Comphor. It is a fountain in the\\n\\t\\t\\t\\tRealms of Bliss. It is a seasoning added to the Cup of\\n\\t\\t\\t\\tpure, beatific Wine, which causes no intoxication (lvi.\\n\\t\\t\\t\\t18- 19), but stands for all that is wholesome, agreeable,\\n\\t\\t\\t\\tand refreshing. Camphor is cool and refreshing, and is\\n\\t\\t\\t\\tgiven as a soothing tonic in Eastern medicine. In minute\\n\\t\\t\\t\\tdoses its odour and flavour are also agreeable."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "7",
    "NoteID": "5836",
    "Body": "They: i.e., the Righteous: they are known in the present\\n\\t\\t\\t\\tlife by the virtues described in verses 7-10, and in the\\n\\t\\t\\t\\tlife of the Hereafter they will enjoy the Bliss described\\n\\t\\t\\t\\tin verses 11-22."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "7",
    "NoteID": "5837",
    "Body": "Cf. xxii. 29. The vows must be vows of spiritual service,\\n\\t\\t\\t\\twhich of course includes service to humanity, such as is\\n\\t\\t\\t\\tmentioned in the next verse. They are Devotees of Allah,\\n\\t\\t\\t\\tand they must perform all vows and contracts (v. I and n.\\n\\t\\t\\t\\t682). Vows of the Pagan sort, savouring of a sort of\\n\\t\\t\\t\\t\"bribe\" to the Deity, are not approved."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "7",
    "NoteID": "5838",
    "Body": "That is, they prepare for the Judgment to come, where the\\n\\t\\t\\t\\teffects of Sin will not be transitory but far-reaching."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "8",
    "NoteID": "5839",
    "Body": "The captive: when taken literally, it refers to the old\\n\\t\\t\\t\\tstate of things when captives of war had to earn their\\n\\t\\t\\t\\town food, or their own redemption; even ordinary\\n\\t\\t\\t\\tprisoners in jail for criminal offences often starved\\n\\t\\t\\t\\tunless food was provided for them by private friends or\\n\\t\\t\\t\\tfrom their own earnings."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "9",
    "NoteID": "5840",
    "Body": "These words need not be actually uttered. They express\\n\\t\\t\\t\\tthe true motives of pious and unpretentious Charity."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "10",
    "NoteID": "5841",
    "Body": "It is a Day of Distress for sin and evil. But the truly\\n\\t\\t\\t\\trighteous are not self- righteous. They have the fear of\\n\\t\\t\\t\\tAllah in their minds: they know they are human, and they\\n\\t\\t\\t\\tfear lest they should be found wanting in the sight of\\n\\t\\t\\t\\tAllah. But Allah in His Mercy gives them a bountiful\\n\\t\\t\\t\\tReward."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "11",
    "NoteID": "5842",
    "Body": "Cf. lxxv. 22-23."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "12",
    "NoteID": "5843",
    "Body": "Cf. xxii. 23."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "13",
    "NoteID": "5844",
    "Body": "Cf. xviii. 31."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "13",
    "NoteID": "5845",
    "Body": "The sun and the moon as we know them will be no longer\\n\\t\\t\\t\\tthere. It will be a new world on a different plane. But\\n\\t\\t\\t\\tto give us an idea of comfort we recall the excessive\\n\\t\\t\\t\\theat of the sun especially in tropical climates, and the\\n\\t\\t\\t\\texcessive cold of the moon especially in northern\\n\\t\\t\\t\\tclimates, and we negative them both. That is, the\\n\\t\\t\\t\\ttemperature will be just that delightful one that is most\\n\\t\\t\\t\\tagreeable to our sensations as we know them now. The moon\\n\\t\\t\\t\\tis not mentioned, but Zamharir (excessive cold) is\\n\\t\\t\\t\\tsometimes used for the moon."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "14",
    "NoteID": "5846",
    "Body": "Without sun and moon there will of course be no shade in\\n\\t\\t\\t\\tthe literal sense of the word. But for full comfort,\\n\\t\\t\\t\\tthere will be sheltering shade for rest and change from\\n\\t\\t\\t\\twhatever light there be."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "15",
    "NoteID": "5847",
    "Body": "Cf. xliii. 71, where \"dishes and goblets of gold\" are\\n\\t\\t\\t\\tmentioned. The idea conveyed is that of rarity,\\n\\t\\t\\t\\tpreciousness, and spotless splendour."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "16",
    "NoteID": "5848",
    "Body": "That is, silver polished and white, and shining like\\n\\t\\t\\t\\tcrystal."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "17",
    "NoteID": "5849",
    "Body": "Cf. above, lxxvi. 5-6, and n. 5835, where the Cup of\\n\\t\\t\\t\\tKafur (Camphor) was mentioned for coolness and\\n\\t\\t\\t\\trefreshment to the Righteous, who had just passed the\\n\\t\\t\\t\\tgreat Event of Judgment. The second stage is described in\\n\\t\\t\\t\\tverses 12-14, when they enter the Garden in Garments of\\n\\t\\t\\t\\tSilk, and find that their former humility in the\\n\\t\\t\\t\\tprobationary life is rewarded with high honour in the new\\n\\t\\t\\t\\tworld they have entered. The third stage is in verses\\n\\t\\t\\t\\t15-21, where they settle down in Bliss, with Garments of\\n\\t\\t\\t\\tfine silk and heavy brocades, with Ornaments and Jewels,\\n\\t\\t\\t\\twith an ordered Feast of set service, and the Cup of\\n\\t\\t\\t\\tZanjabil. This word literally means Ginger. In Eastern\\n\\t\\t\\t\\tmedicine Ginger is administered to give warmth to the\\n\\t\\t\\t\\tbody and zest to the taste; this is appropriate for the\\n\\t\\t\\t\\tRoyal Feast which is now figured forth."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "18",
    "NoteID": "5850",
    "Body": "Salsabil: A fountain in Paradise."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "19",
    "NoteID": "5851",
    "Body": "Cf. lvi. 17 and n. 5231."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "19",
    "NoteID": "5852",
    "Body": "Pearls for beauty and splendour: scattered, because they\\n\\t\\t\\t\\tare moving to and fro."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "21",
    "NoteID": "5853",
    "Body": "Cf. xviii. 31. The bracelets are there said to be of\\n\\t\\t\\t\\tgold."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "21",
    "NoteID": "5854",
    "Body": "This would seem to be the culmination of the honour which\\n\\t\\t\\t\\tthe Blessed receive at the Royal and Divine Banquet. The\\n\\t\\t\\t\\twords in the next verse express the sort of speech which\\n\\t\\t\\t\\twill make the Guest a denizen of Heaven."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "23",
    "NoteID": "5855",
    "Body": "The Qur-an was being revealed stage by stage as the\\n\\t\\t\\t\\toccasion demanded and at the date of this Sura it was\\n\\t\\t\\t\\tstill one of the earlier stages. Persecution, abuse, and\\n\\t\\t\\t\\tfalse charges were being levelled against the man of\\n\\t\\t\\t\\tAllah, but he is bidden to stand firm and do his duty. In\\n\\t\\t\\t\\ta minor degree this applies to all of us who suffer in\\n\\t\\t\\t\\tthe cause of Truth."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "25",
    "NoteID": "5856",
    "Body": "Three methods of Prayer and Devotion are mentioned: (1)\\n\\t\\t\\t\\tto remember and celebrate the holy name of Allah always;\\n\\t\\t\\t\\t(2) to spend a part of the night in humble prostration;\\n\\t\\t\\t\\tand (3) to glorify Him in the long hours of a weary night\\n\\t\\t\\t\\tof waiting and watching. As to (1), \"morning and evening\"\\n\\t\\t\\t\\tmeans all the waking hours of our life, but in the\\n\\t\\t\\t\\tspecial hours of morning and evening the physical world\\n\\t\\t\\t\\twithout us, and the inner world within us, combine to\\n\\t\\t\\t\\tmake us specially receptive of spiritual influences. The\\n\\t\\t\\t\\t\"name\" of Allah includes His attributes, as a locked\\n\\t\\t\\t\\tgolden casket might include priceless jewels. Any one may\\n\\t\\t\\t\\tcarry the casket, even though he may not be worthy to\\n\\t\\t\\t\\thandle the jewels. If he carries the casket, he is in\\n\\t\\t\\t\\tpotential possession of the jewels, and he hopes some\\n\\t\\t\\t\\ttime to get the key which opens the jewels to him. So the\\n\\t\\t\\t\\ttyro, who celebrates the holy name of Allah, hopes some\\n\\t\\t\\t\\tday to see the \"Face\" of Allah and be blessed with the\\n\\t\\t\\t\\tprivilege of proximity to His Person. For (2) and (3) see\\n\\t\\t\\t\\tnext note."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "26",
    "NoteID": "5857",
    "Body": "See last note. (2) Humble prostration to Allah means some\\n\\t\\t\\t\\tvisible mode of dedication. That is best done at night,\\n\\t\\t\\t\\twhen the soul, free from worldly occupations, is alone\\n\\t\\t\\t\\twith its God. (3) The weary hours of a long night are no\\n\\t\\t\\t\\tlonger weary, but become full of meaning when we join in\\n\\t\\t\\t\\tconcert with the whole Creation, which glorifies Allah:\\n\\t\\t\\t\\tlvii. 1."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "27",
    "NoteID": "5858",
    "Body": "Fleeting life: Cf. lxxv. 20. They: the immediate\\n\\t\\t\\t\\treference was to the Pagan Quraish: the general reference\\n\\t\\t\\t\\tis to the Unbelievers of all ages. They reject, or at\\n\\t\\t\\t\\tleast put away the thought of, a Hereafter, a Day that\\n\\t\\t\\t\\twill be hard, for the easy pleasures of a fleeting life."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "28",
    "NoteID": "5859",
    "Body": "Allah has not only created men, but 'made their frame\\n\\t\\t\\t\\tstrong\", i.e., given them the power and strength to\\n\\t\\t\\t\\twithstand the temptations of Evil and stand firmly in the\\n\\t\\t\\t\\tPath of Right,"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "28",
    "NoteID": "5860",
    "Body": "If, in spite of Allah's loving care, any particular men\\n\\t\\t\\t\\tor group of men, misuse their powers or wilfully disobey\\n\\t\\t\\t\\tAllah's Law, Allah will set them aside, and substitute\\n\\t\\t\\t\\tothers in their place, with like powers. Allah's gifts\\n\\t\\t\\t\\tare free, but let no one think that he can monopolise\\n\\t\\t\\t\\tthem or misuse them without being called to answer for\\n\\t\\t\\t\\tthe trust. And the man of Allah must not be discouraged\\n\\t\\t\\t\\tby the whole world being at some moment completely\\n\\t\\t\\t\\tagainst him. Allah can in a moment make a complete\\n\\t\\t\\t\\tchange. Either the same men that fought against him will\\n\\t\\t\\t\\tbe his zealous adherents, Or another generation will\\n\\t\\t\\t\\tspring up, which will carry the flag of Righteousness to\\n\\t\\t\\t\\tvictory. Allah's Will and Plan work in their own good\\n\\t\\t\\t\\ttime."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "30",
    "NoteID": "5861",
    "Body": "Man in himself is weak; he must seek Allah's Grace;\\n\\t\\t\\t\\twithout it he can do nothing; with it he can do all, For\\n\\t\\t\\t\\tAllah knows all things, and His wisdom comprehends the\\n\\t\\t\\t\\tgood of all."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "31",
    "NoteID": "5862",
    "Body": "That is according to His just and wise Plan. If the will\\n\\t\\t\\t\\tis right, it obtains Allah's Grace and Mercy. If the will\\n\\t\\t\\t\\tof man rejects Allah, man must suffer the Penalty."
  }
]
