[
  {
    "SurahNumber": "17",
    "AyahNumber": "1",
    "NoteID": "2166",
    "Body": "The reference is to the Isra' for which see the\\n\\t\\t\\t\\tIntroduction to this Sura."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "1",
    "NoteID": "2167",
    "Body": "Masjid is a place of prayer: here it refers to the Ka'ba\\n\\t\\t\\t\\tat Makkah. It had not yet been cleared of its idols and\\n\\t\\t\\t\\trededicated exclusively to the One True God. It was\\n\\t\\t\\t\\tsymbolical of the new Message which was being given to\\n\\t\\t\\t\\tmankind."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "1",
    "NoteID": "2168",
    "Body": "The Farthest Mosque must refer to the site of the Temple\\n\\t\\t\\t\\tof Solomon in Jerusalem on the hill of Moriah, at or near\\n\\t\\t\\t\\twhich stands the Dome of the Rock, called also the Mosque\\n\\t\\t\\t\\tof Hadhrat 'Umar. This and the Mosque known as the\\n\\t\\t\\t\\tFarthest Mosque (Masjid-ul-Aqsa) were completed by the\\n\\t\\t\\t\\tAmir 'Abd-ul-Malik in A.H. 68. Farthest, because it was\\n\\t\\t\\t\\tthe place of worship farthest west which was known to the\\n\\t\\t\\t\\tArabs in the time of the holy Prophet: it was a sacred\\n\\t\\t\\t\\tplace to both Jews and Christians, but the Christians\\n\\t\\t\\t\\tthen had the upper hand, as it was included in the\\n\\t\\t\\t\\tByzantine (Roman) Empire, which maintained a Patriarch at\\n\\t\\t\\t\\tJerusalem. The chief dates in connection with the Temple\\n\\t\\t\\t\\tare: it was finished by Solomon about B.C. 1004;\\n\\t\\t\\t\\tdestroyed by the Babylonians under Nebuchadnezzar about\\n\\t\\t\\t\\t586 B.C.; rebuilt under Ezra and Nehemiah about 515 B.C.;\\n\\t\\t\\t\\tturned into a heathen idol-temple by one of Alexander's\\n\\t\\t\\t\\tsuccessors, Antiochus Epiphanes, 167 B.C.; restored by\\n\\t\\t\\t\\tHerod, B.C. 17 to A.D. 29; and completely razed to the\\n\\t\\t\\t\\tground by the Emperor Titus in A.D. 70. These ups and\\n\\t\\t\\t\\tdowns are among the greater Signs in religious history."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "1",
    "NoteID": "2169",
    "Body": "Allah's knowledge comprehends all things, without any\\n\\t\\t\\t\\tcurtain of Time or any separation of Space. He can\\n\\t\\t\\t\\ttherefore see and hear all things, and the Mi'raj was a\\n\\t\\t\\t\\treflection of this knowledge. In this and the subsequent\\n\\t\\t\\t\\tverses, the reference to Allah is generally in the first\\n\\t\\t\\t\\tperson and plural. But in the first and the last clause\\n\\t\\t\\t\\tof this verse it is in the third person singular: \"Glory\\n\\t\\t\\t\\tto Allah, Who did take His Servant...\"; \"He is the\\n\\t\\t\\t\\tOne...\". In each of these two instances, the clause\\n\\t\\t\\t\\texpresses the point of view of Allah's creatures, who\\n\\t\\t\\t\\tglorify Him, and whose hearing and seeing are ordinarily\\n\\t\\t\\t\\tso limited that they can do nothing but glorify Him when\\n\\t\\t\\t\\tone of His creatures is raised up to hear and see the\\n\\t\\t\\t\\tSigns. It is they who glorify Him."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "2",
    "NoteID": "2170",
    "Body": "The Book: the revelation that was given to Moses. It was\\n\\t\\t\\t\\tthere clearly laid down that those who followed Moses\\n\\t\\t\\t\\tmust consider Allah as the Only God. \"Thou shalt have no\\n\\t\\t\\t\\tother gods before me; thou shalt not make unto thee any\\n\\t\\t\\t\\tgraven image...thou shalt not bow down thyself to them\\n\\t\\t\\t\\tnor serve them: for I the Lord thy God am a jealous God\\n\\t\\t\\t\\t.... ;\" etc.(Exod. xx. 3-5). These are the words of the\\n\\t\\t\\t\\tEnglish Bible. As a matter of fact the spirit of the\\n\\t\\t\\t\\tMosaic teaching went further. It referred all things to\\n\\t\\t\\t\\tthe Providence of Allah: Allah is the Disposer of all\\n\\t\\t\\t\\taffairs, and we are to look to none but Him. This is\\n\\t\\t\\t\\tIslam, and the Mi'raj showed that it was the teaching of\\n\\t\\t\\t\\tAllah from the most ancient times, and yet it was\\n\\t\\t\\t\\tviolated by the very people who claimed to be its\\n\\t\\t\\t\\tcustodians."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "2",
    "NoteID": "2171",
    "Body": "Note the transition from \"We\" in the first clause to \"Me\"\\n\\t\\t\\t\\tin the second clause. The first clause refers to the\\n\\t\\t\\t\\tmajesty of Allah as the Heavenly King; the second clause\\n\\t\\t\\t\\trefers to His personal interest in all our affairs."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "3",
    "NoteID": "2172",
    "Body": "After the Deluge of the time of Noah the only descendants\\n\\t\\t\\t\\tof Noah were those who were saved in the Ark with him.\\n\\t\\t\\t\\tThey had special reason to celebrate the praises of\\n\\t\\t\\t\\tAllah. But they relapsed into idolatry, sin, and\\n\\t\\t\\t\\tabominations. They are reminded of the true and sincere\\n\\t\\t\\t\\tdevotion of Noah himself, as contrasted with the\\n\\t\\t\\t\\tunworthiness of Noah's descendants, especially the\\n\\t\\t\\t\\tChildren of Israel."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "4",
    "NoteID": "2173",
    "Body": "The Book is the revelation given to the Children of\\n\\t\\t\\t\\tIsrael. Here it seems to refer to the burning words of\\n\\t\\t\\t\\tProphets like Isaiah. For example, see Isaiah, chap.\\n\\t\\t\\t\\txxiv. or Isaiah v. 20-30, or Isaiah iii. 16-26."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "4",
    "NoteID": "2174",
    "Body": "What are the two occasions referred to? It may be that\\n\\t\\t\\t\\t\"twice\" is a figure of speech for \"more than once\",\\n\\t\\t\\t\\t\"often\". Or it may be that the two occasions refer to (1)\\n\\t\\t\\t\\tthe destruction of the Temple by the Babylonian\\n\\t\\t\\t\\tNebuchadnezzar in 586 B.C., when the Jews were carried\\n\\t\\t\\t\\toff into captivity, and (2) the destruction of Jerusalem\\n\\t\\t\\t\\tby Titus in A.D. 70, after which the Temple was never\\n\\t\\t\\t\\tre-built. See n. 2168 above. On both occasions it was a\\n\\t\\t\\t\\tjudgment of Allah for the sins of the Jews, their\\n\\t\\t\\t\\tbackslidings, and their arrogance."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "5",
    "NoteID": "2175",
    "Body": "A good description of the war-like Nebuchadnezzar and his\\n\\t\\t\\t\\tBabylonians. They were servants of Allah in the sense\\n\\t\\t\\t\\tthat they were instruments through which the wrath of\\n\\t\\t\\t\\tAllah was poured out on the Jews, for they penetrated\\n\\t\\t\\t\\tthrough their lands, their Temple, and their homes, and\\n\\t\\t\\t\\tcarried away the Jews, men and women, into captivity. As\\n\\t\\t\\t\\tregards \"the daughters of Zion\" see the scathing\\n\\t\\t\\t\\tcondemnation in Isaiah, iii. 16-26."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "6",
    "NoteID": "2176",
    "Body": "The return of the Jews from the Captivity was about 520\\n\\t\\t\\t\\tB.C. They started life afresh. They rebuilt their Temple.\\n\\t\\t\\t\\tThey carried out various reforms and built up a new\\n\\t\\t\\t\\tJudaism in connection with Ezra. See appendix 11\\n\\t\\t\\t\\tfollowing S. v. For a time they prospered. Meanwhile\\n\\t\\t\\t\\ttheir old oppressors the Babylonians had been absorbed by\\n\\t\\t\\t\\tPersia. Subsequently Persia was absorbed in Alexander's\\n\\t\\t\\t\\tEmpire. The whole of western Asia was Hellenized, and the\\n\\t\\t\\t\\tnew school of Jews was Hellenized also, and had a strong\\n\\t\\t\\t\\tcentre in Alexandria. But their footing in Palestine\\n\\t\\t\\t\\tcontinued, and under the Asmonaean Dynasty (B.C. 167-63),\\n\\t\\t\\t\\tthey had a national revival, and the names of the Makkah\\n\\t\\t\\t\\tbees are remembered as those of heroes. Another dynasty,\\n\\t\\t\\t\\tthat of the Idummans, (B.C. 63 to B.C. 4), to which Herod\\n\\t\\t\\t\\tbelonged, also enjoyed some semi-independent power. The\\n\\t\\t\\t\\tsceptre of Syria (including Palestine) passed to the\\n\\t\\t\\t\\tRomans in B.C. 65, and Jewish feudatory Kings held power\\n\\t\\t\\t\\tunder them. But the Jews again showed a stiff-necked\\n\\t\\t\\t\\tresistance to Allah's Messenger in the time of Jesus, and\\n\\t\\t\\t\\tthe inevitable doom followed in the complete and final\\n\\t\\t\\t\\tdestruction of the Temple under Titus in 70 A.D."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "7",
    "NoteID": "2177",
    "Body": "This is a parenthetical sentence. If anyone follows\\n\\t\\t\\t\\tAllah's Law, the benefit goes to himself: he does not\\n\\t\\t\\t\\tbestow a favour on anyone else. Similarly evil brings its\\n\\t\\t\\t\\town recompense on the doer of evil."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "7",
    "NoteID": "2178",
    "Body": "The second doom was due to the rejection of the Message\\n\\t\\t\\t\\tof Jesus. \"To disfigure your faces\" means to destroy any\\n\\t\\t\\t\\tcredit or power you may have got: the face shows the\\n\\t\\t\\t\\tpersonality of the man."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "7",
    "NoteID": "2179",
    "Body": "Titus's destruction of Jerusalem in 70 A.D. was complete.\\n\\t\\t\\t\\tHe was a son of the Roman Emperor Vespasian, and at the\\n\\t\\t\\t\\tdate of the destruction of Jerusalem, had the title of\\n\\t\\t\\t\\tCaesar as heir to throne. He ruled as Roman Emperor from\\n\\t\\t\\t\\t79 to 81 A.D."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "7",
    "NoteID": "2180",
    "Body": "Merivale in his Romans Under the Empire gives a graphic\\n\\t\\t\\t\\taccount of the siege and final destruction (ed. 1890,\\n\\t\\t\\t\\tvii. 221-255). The population of Jerusalem was then\\n\\t\\t\\t\\t200,000. According to the Latin historian Tacitus it was\\n\\t\\t\\t\\tas much as 600,000. There was a famine and there were\\n\\t\\t\\t\\tmassacres. There was much fanaticism. The judgment of\\n\\t\\t\\t\\tMerivale is: \"They\" (the Jews) \"were judicially abandoned\\n\\t\\t\\t\\tto their own passions and the punishment which naturally\\n\\t\\t\\t\\tawaited them\". (vii. 221)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "8",
    "NoteID": "2181",
    "Body": "Now we come to the time of our holy Prophet. In spite of\\n\\t\\t\\t\\tall the past, the Jews could still have obtained Allah's\\n\\t\\t\\t\\tforgiveness if they had not obstinately rejected the\\n\\t\\t\\t\\tgreatest of the Prophets also. If they were to continue\\n\\t\\t\\t\\tin their sins, Allah's punishment would also continue to\\n\\t\\t\\t\\tvisit them."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "8",
    "NoteID": "2182",
    "Body": "There is such a thing as disgrace in this life, but the\\n\\t\\t\\t\\tfinal disgrace is in the Hereafter, and that will be\\n\\t\\t\\t\\tirretrievable."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "9",
    "NoteID": "2183",
    "Body": "The instability and crookedness of the Jewish soul having\\n\\t\\t\\t\\tbeen mentioned, the healing balm which should have cured\\n\\t\\t\\t\\tit is now pointed out. The Message of the Qur-an is for\\n\\t\\t\\t\\tall. Those who have Faith and show that Faith in their\\n\\t\\t\\t\\tconduct must reap their spiritual reward. But those who\\n\\t\\t\\t\\treject Faith cannot escape punishment. Apart from what is\\n\\t\\t\\t\\tpast, apart from questions of national or racial history,\\n\\t\\t\\t\\tthere is a Hope,-and a Danger- for every soul."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "11",
    "NoteID": "2184",
    "Body": "Man in his ignorance or haste mistakes evil for good, and\\n\\t\\t\\t\\tdesires what he should not have. The wise and instructed\\n\\t\\t\\t\\tsoul has patience and does not put its own desires above\\n\\t\\t\\t\\tthe wisdom of Allah. He receives with contentment the\\n\\t\\t\\t\\tfavours of Allah, and prays to be rightly guided in his\\n\\t\\t\\t\\tdesires and petitions."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "12",
    "NoteID": "2185",
    "Body": "If we were to cry when it is night, we shall look foolish\\n\\t\\t\\t\\twhen it is day; for the night is but a preparation for\\n\\t\\t\\t\\tthe day: perhaps, as the last verse says, we pray for the\\n\\t\\t\\t\\tday when we want rest for the night. Both are Signs from\\n\\t\\t\\t\\tAllah. Darkness and light stand for ignorance and\\n\\t\\t\\t\\tknowledge. \"Where ignorance is bliss, its folly to be\\n\\t\\t\\t\\twise.\" Darkness and light may also stand for shadow and\\n\\t\\t\\t\\tsunshine, sorrow and joy: both may be for our\\n\\t\\t\\t\\tdevelopment."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "12",
    "NoteID": "2186",
    "Body": "By the physical light we see physical facts. And this\\n\\t\\t\\t\\tphysical gift of Allah is good for us in two ways: (1) we\\n\\t\\t\\t\\tcan arrange for our livelihood, or we can attain the\\n\\t\\t\\t\\tknowledge of the physical sciences and gain some control\\n\\t\\t\\t\\tover the physical forces of nature; and (2) the daily\\n\\t\\t\\t\\trising and setting of the sun gives us the computation of\\n\\t\\t\\t\\tdays and years, for the physical natural year is the\\n\\t\\t\\t\\tsolar year."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "13",
    "NoteID": "2187",
    "Body": "Fate: Tair, literally a bird, hence an omen, an evil\\n\\t\\t\\t\\tomen, fate. Cf. xxxvi. 19. The Arabs, like the ancient\\n\\t\\t\\t\\tRomans, sought to read the mysteries of human fate from\\n\\t\\t\\t\\tthe flight of birds. And many of us in our own day seek\\n\\t\\t\\t\\tto read our future fortunes by similar superstitions. We\\n\\t\\t\\t\\tread in the previous verse that there are Signs of Allah,\\n\\t\\t\\t\\tbut they are not meant to subserve the vulgar purpose of\\n\\t\\t\\t\\tdisclosing our future destiny in a worldly sense. They\\n\\t\\t\\t\\tare meant for quite other purposes, as we have explained.\\n\\t\\t\\t\\tOur real fate does not depend upon birds or omens or\\n\\t\\t\\t\\tstars. It depends on our deeds; good or evil, and they\\n\\t\\t\\t\\thang round our necks."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "13",
    "NoteID": "2188",
    "Body": "These deeds, good or evil, will be embodied in a scroll\\n\\t\\t\\t\\twhich will be quite open to us in the light of the Day of\\n\\t\\t\\t\\tJudgment, however much we may affect to be ignorant of it\\n\\t\\t\\t\\tnow or waste our energies in prying into mysteries that\\n\\t\\t\\t\\tdo not concern us."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "14",
    "NoteID": "2189",
    "Body": "Our true accusers are our own deeds. Why not look to them\\n\\t\\t\\t\\tinstead of vainly prying into something superstitious\\n\\t\\t\\t\\twhich we call a book of fortune or a book of omens?"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "15",
    "NoteID": "2190",
    "Body": "The doctrine of personal responsibility is insisted on,\\n\\t\\t\\t\\tand the basis of ethics is shown to be our own good or\\n\\t\\t\\t\\tevil as furthering or obstructing our highest\\n\\t\\t\\t\\tdevelopment."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "15",
    "NoteID": "2191",
    "Body": "The doctrine of vicarious atonement is condemned.\\n\\t\\t\\t\\tSalvation for the wicked cannot be attained by the\\n\\t\\t\\t\\tpunishment of the innocent. One man cannot bear the\\n\\t\\t\\t\\tburden of another: that would be unjust. Every man must\\n\\t\\t\\t\\tbear his own personal responsibility. Cf. vi. 164. But\\n\\t\\t\\t\\tAllah never visits His wrath on anyone until due warning\\n\\t\\t\\t\\tis conveyed to him through an accredited messenger."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "16",
    "NoteID": "2192",
    "Body": "Allah's Mercy gives every chance to the wicked to repent.\\n\\t\\t\\t\\tWhen wickedness gets so rampant that punishment becomes\\n\\t\\t\\t\\tinevitable, even then Allah's Mercy and Justice act\\n\\t\\t\\t\\ttogether. Those who are highly gifted from Allah-it may\\n\\t\\t\\t\\tbe with wealth or position, or it may be with talents and\\n\\t\\t\\t\\topportunities-are expected to understand and obey. They\\n\\t\\t\\t\\tare given a definite order and warning. If they still\\n\\t\\t\\t\\ttransgress there is no further room for argument. They\\n\\t\\t\\t\\tcannot plead that they were ignorant. The command of the\\n\\t\\t\\t\\tLord is proved against them, and its application is\\n\\t\\t\\t\\tcalled for beyond doubt. Then it is that their punishment\\n\\t\\t\\t\\tis completed."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "16",
    "NoteID": "2193",
    "Body": "Qaul here has the sense of word, order, law, charge\\n\\t\\t\\t\\tframed against one under a definite law."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "17",
    "NoteID": "2194",
    "Body": "Noah's Flood is taken as a new starting point in history.\\n\\t\\t\\t\\tBut even after that hundreds of empires, towns, and\\n\\t\\t\\t\\tgenerations have perished for their wickedness."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "17",
    "NoteID": "2195",
    "Body": "Let not the wicked think, because they are given a lease\\n\\t\\t\\t\\tof life and luxury for a time, that their wickedness has\\n\\t\\t\\t\\tescaped notice. Allah notes and sees all things, both\\n\\t\\t\\t\\topen and secret. He knows the hidden motives and thoughts\\n\\t\\t\\t\\tof men, and He has no need of any other evidence. His\\n\\t\\t\\t\\tknowledge and sight are all-sufficient."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "18",
    "NoteID": "2196",
    "Body": "An explanation is now given of how it is that prosperity\\n\\t\\t\\t\\tsometimes seems to attend the wicked. The explanation is\\n\\t\\t\\t\\tthreefold: (1) the transitory things of this life are\\n\\t\\t\\t\\tworth little in the eternal scheme of things; (2) even\\n\\t\\t\\t\\tthey are provided, not just because their recipients wish\\n\\t\\t\\t\\tfor them, but according to a definite Plan of Allah; and\\n\\t\\t\\t\\t(3) in the end there is for the wicked the eternal Misery\\n\\t\\t\\t\\tand deprivation of grace,-the Hell which is worse than\\n\\t\\t\\t\\tdestruction in the terms of this world."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "18",
    "NoteID": "2197",
    "Body": "All the pride and insolence will then be brought low. The\\n\\t\\t\\t\\tdisgrace and the exclusion from the \"sight of the Face of\\n\\t\\t\\t\\tAllah\" will by themselves be punishments of which the\\n\\t\\t\\t\\tmagnitude cannot be measured in the terms of our present\\n\\t\\t\\t\\tmaterial life."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "19",
    "NoteID": "2198",
    "Body": "This is in contrast to the last verse. Those who wish for\\n\\t\\t\\t\\tmere earthly good sometimes get it and misuse it. Those\\n\\t\\t\\t\\twhose eyes are fixed on the Hereafter, they too share in\\n\\t\\t\\t\\ttheir Lord's bounty provided they fulfil the conditions\\n\\t\\t\\t\\texplained in the next note; but their wishes and\\n\\t\\t\\t\\tendeavours are more acceptable in the sight of Allah."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "19",
    "NoteID": "2199",
    "Body": "A mere wish for moral and spiritual good is not enough.\\n\\t\\t\\t\\tIt must be backed up by hard endeavour and supported by a\\n\\t\\t\\t\\tlively Faith. On those conditions the wishes are accepted\\n\\t\\t\\t\\tby Allah."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "20",
    "NoteID": "2200",
    "Body": "Allah's favours are showered on all,-the just and the\\n\\t\\t\\t\\tunjust, the deserving and the undeserving. But there is a\\n\\t\\t\\t\\tdifference as explained in the last two verses."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "21",
    "NoteID": "2201",
    "Body": "Nor should man suppose that all gifts are of equal value.\\n\\t\\t\\t\\tThe spiritual ones rank far higher in dignity and real\\n\\t\\t\\t\\tworth than the transitory ones. Therefore it is\\n\\t\\t\\t\\taltogether wrong to compare the worldly prosperity of a\\n\\t\\t\\t\\twicked man with the apparent want of it to a man of\\n\\t\\t\\t\\tspiritual worth. There is no comparison between them when\\n\\t\\t\\t\\tmeasured by right standards."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "22",
    "NoteID": "2202",
    "Body": "The seeming inequality of gifts to men might make\\n\\t\\t\\t\\tshort-sighted men impugn the impartiality of Allah. But\\n\\t\\t\\t\\tthe fault lies with such men's own want of knowledge and\\n\\t\\t\\t\\twant of Faith. There is no excuse for them to seek other\\n\\t\\t\\t\\tobjects of worship than Allah. For there is none worthy\\n\\t\\t\\t\\tof worship except Allah."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "22",
    "NoteID": "2203",
    "Body": "If foolish men turn to false objects of worship, they\\n\\t\\t\\t\\twill not only be disappointed, but they will lose the\\n\\t\\t\\t\\trespect of their own fellow-men, and spiritually they\\n\\t\\t\\t\\twill be reduced to destitution. All their talents and\\n\\t\\t\\t\\ttheir works will be of no avail."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "23",
    "NoteID": "2204",
    "Body": "The spiritual and moral duties are now brought into\\n\\t\\t\\t\\tjuxtaposition. We are to worship none but Allah, because\\n\\t\\t\\t\\tnone but Allah is worthy of worship, not because \"the\\n\\t\\t\\t\\tLord thy God is a jealous God, visiting the iniquity of\\n\\t\\t\\t\\tthe fathers upon the children unto the third and fourth\\n\\t\\t\\t\\tgeneration of them that hate Me\" (Exod. xx. 5). Note that\\n\\t\\t\\t\\tthe act of worship may be collective as well as\\n\\t\\t\\t\\tindividual; hence the plural ta'buda. The kindness to\\n\\t\\t\\t\\tparents is an individual act of piety; hence the singular\\n\\t\\t\\t\\ttaqul, qul, etc."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "24",
    "NoteID": "2205",
    "Body": "Cf. xv. 88 and n. 2011. The metaphor is that of a\\n\\t\\t\\t\\thigh-flying bird which lowers her wing out of tenderness\\n\\t\\t\\t\\tto her offspring. There is a double aptness. (1) When the\\n\\t\\t\\t\\tparent was strong and the child was helpless, parental\\n\\t\\t\\t\\taffection was showered on the child: when the child grows\\n\\t\\t\\t\\tup and is strong, and the parent is helpless, can he do\\n\\t\\t\\t\\tless than bestow similar tender care on the parent? (2)\\n\\t\\t\\t\\tBut more: he must approach the matter with gentle\\n\\t\\t\\t\\thumility: for does not parental love, remind him of the\\n\\t\\t\\t\\tgreat love with which Allah cherishes His creatures?\\n\\t\\t\\t\\tThere is something here more than simple human gratitude;\\n\\t\\t\\t\\tit goes up into the highest spiritual region."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "24",
    "NoteID": "2206",
    "Body": "Note that we are asked to honour our father and mother,\\n\\t\\t\\t\\tnot \"that thy days may be long upon the land which the\\n\\t\\t\\t\\tLord thy God giveth thee\" (Exod. xx. 12), but upon much\\n\\t\\t\\t\\thigher and more universal grounds, such as befit a\\n\\t\\t\\t\\tperfected revelation. In the first place, not merely\\n\\t\\t\\t\\trespect, but cherishing kindness, and humility to\\n\\t\\t\\t\\tparents, are commanded. In the second place, this command\\n\\t\\t\\t\\tis bracketed with the command to worship the One True\\n\\t\\t\\t\\tGod. Parental love should be to us a type of divine love:\\n\\t\\t\\t\\tnothing that we can do can ever really compensate for\\n\\t\\t\\t\\tthat which we have received. In the third place (see next\\n\\t\\t\\t\\tverse) our spiritual advancement is tested by this: we\\n\\t\\t\\t\\tcannot expect Allah's forgiveness if we are rude or\\n\\t\\t\\t\\tunkind to those who unselfishly brought us up."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "25",
    "NoteID": "2207",
    "Body": "It is the heart, and its hidden and secret motives, by\\n\\t\\t\\t\\twhich we are judged: for Allah knows them all."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "26",
    "NoteID": "2208",
    "Body": "In the Jewish Decalogue, which was given to a primitive\\n\\t\\t\\t\\tand hard-hearted people, this refinement of Kindness,-to\\n\\t\\t\\t\\tthose in want and to wayfarers (i.e., total strangers\\n\\t\\t\\t\\twhom you come across) finds no place. Nor was there much\\n\\t\\t\\t\\tdanger of their wasting their substance out of\\n\\t\\t\\t\\texuberance. Even the command \"to honour thy father and\\n\\t\\t\\t\\tmother\" comes after the ceremonial observance of the\\n\\t\\t\\t\\tSabbath. With us, the worship of Allah is linked up with\\n\\t\\t\\t\\tkindness-to parents, kindred, those in want, those who\\n\\t\\t\\t\\tare far from their homes though they may be total\\n\\t\\t\\t\\tstrangers to us. It is not mere verbal kindness. They\\n\\t\\t\\t\\thave certain rights which must be fulfilled."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "26",
    "NoteID": "2209",
    "Body": "All charity , kindness, and help are conditioned by our\\n\\t\\t\\t\\town resources. There is no merit if we merely spend out\\n\\t\\t\\t\\tof bravado or for idle show. How many families are ruined\\n\\t\\t\\t\\tby extravagant expenses at weddings, funerals, etc., or\\n\\t\\t\\t\\t(as they may call it) to \"oblige friends or relatives\",\\n\\t\\t\\t\\tor to give to able-bodied beggars? To no one was this\\n\\t\\t\\t\\tcommand more necessary than it is to Muslims of the\\n\\t\\t\\t\\tpresent day."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "27",
    "NoteID": "2210",
    "Body": "Spendthrifts are not merely fools. They are of the same\\n\\t\\t\\t\\tfamily as the Satans. And the Satan himself-fell by his\\n\\t\\t\\t\\tingratitude to Allah. So those who misuse or squander\\n\\t\\t\\t\\tAllah's gifts are also ungrateful to Allah."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "28",
    "NoteID": "2211",
    "Body": "You may have to \"turn away\" from people for two reasons.\\n\\t\\t\\t\\t(1) You may not have the wherewithal with which to\\n\\t\\t\\t\\tentertain them and give them their rights; or (2) you may\\n\\t\\t\\t\\thave to give them a wide berth because their thoughts are\\n\\t\\t\\t\\tnot as your thoughts. In either case there is no need to\\n\\t\\t\\t\\tspeak harshly to them. Your words should be those of\\n\\t\\t\\t\\t\"easy kindness\", i.e., the sort of kindness (not merely\\n\\t\\t\\t\\tfrigid politeness) which flows from pity and\\n\\t\\t\\t\\tunderstanding and smooths over unnecessary difficulties\\n\\t\\t\\t\\tin human intercourse."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "29",
    "NoteID": "2212",
    "Body": "Cf. the phrase for niggardliness in v. 64. We are not to\\n\\t\\t\\t\\tbe so lavish as to make ourselves destitute and incur the\\n\\t\\t\\t\\tjust censure of wise men, nor is it becoming to keep back\\n\\t\\t\\t\\tour resources from the just needs of those who have a\\n\\t\\t\\t\\tright to our help. Even strangers have such a right, as\\n\\t\\t\\t\\twe saw in xvii. 26 above. But we must keep a just measure\\n\\t\\t\\t\\tbetween our capacity and other people's needs."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "30",
    "NoteID": "2213",
    "Body": "If a foolish spendthrift pretends that his generosity,\\n\\t\\t\\t\\teven if it ruins himself, is good for other people, he is\\n\\t\\t\\t\\treminded that Allah will take care of all. He knows every\\n\\t\\t\\t\\tone's true needs and cares for them. He gives in\\n\\t\\t\\t\\tabundance to some, but in all cases He gives in just\\n\\t\\t\\t\\tmeasure. Who are we to pretend to greater generosity?"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "31",
    "NoteID": "2214",
    "Body": "The Arabs were addicted to female infanticide. In a\\n\\t\\t\\t\\tsociety perpetually at war a son was a source of strength\\n\\t\\t\\t\\twhereas a daughter was a source of weakness. Even now\\n\\t\\t\\t\\tinfanticide is not unknown in other countries for\\n\\t\\t\\t\\teconomic reasons. This crime against children's lives is\\n\\t\\t\\t\\there characterised as one of the greatest of sins."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "32",
    "NoteID": "2215",
    "Body": "Adultery is not only shameful in itself and inconsistent\\n\\t\\t\\t\\twith any self-respect or respect for others, but it opens\\n\\t\\t\\t\\tthe road to many evils. It destroys the basis of the\\n\\t\\t\\t\\tfamily: it works against the interests of children born\\n\\t\\t\\t\\tor to be born; it may cause murders and feuds and loss of\\n\\t\\t\\t\\treputation and property, and also loosen permanently the\\n\\t\\t\\t\\tbonds of society. Not only should it be avoided as a sin,\\n\\t\\t\\t\\tbut any approach or temptation to it should be avoided."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "33",
    "NoteID": "2216",
    "Body": "On the subject of Qisas see ii. 178 and the notes\\n\\t\\t\\t\\tthereto. Under the strict limitations there laid down, a\\n\\t\\t\\t\\tIife may be taken for a life. The heir is given the right\\n\\t\\t\\t\\tto demand the life; but he must not exceed due bounds,\\n\\t\\t\\t\\tbecause he is helped by the Law. Some Commentators\\n\\t\\t\\t\\tunderstand \"he\" in \"he is helped (by the Law)\" to refer\\n\\t\\t\\t\\tto the heir of the person against whom Qisas is sought.\\n\\t\\t\\t\\tHe too will be helped by the Law, if the heir of the\\n\\t\\t\\t\\tfirst slain exceeds the bounds of Law."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "34",
    "NoteID": "2217",
    "Body": "Cf. vi. 152, and other passages relating to orphans,\\n\\t\\t\\t\\te.g., ii. 220. If an orphan's property is touched at all,\\n\\t\\t\\t\\tit should be to improve it, or to give him something\\n\\t\\t\\t\\tbetter than he had before,-never to take a personal\\n\\t\\t\\t\\tadvantage for the benefit of the guardian. A bargain that\\n\\t\\t\\t\\tmay be quite fair as between two independent persons\\n\\t\\t\\t\\twould be, under this verse, unfair as between a guardian\\n\\t\\t\\t\\tand his orphan ward until the latter attains the full age\\n\\t\\t\\t\\tof understanding."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "34",
    "NoteID": "2218",
    "Body": "Ashuddahu means the age when the orphan reaches his full\\n\\t\\t\\t\\tmaturity of strength and understanding, say between the\\n\\t\\t\\t\\tages of 18 and 30. The age of legal maturity may be 18\\n\\t\\t\\t\\t(as for certain purposes in India) or 21 (as in England).\\n\\t\\t\\t\\tFor certain purposes in Muslim law it may be less than\\n\\t\\t\\t\\t18. In the orphan's interest a much stricter standard is\\n\\t\\t\\t\\trequired in his case."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "34",
    "NoteID": "2219",
    "Body": "The definite article al has here a generic meaning, and\\n\\t\\t\\t\\tis best translated by \"every\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "34",
    "NoteID": "2220",
    "Body": "From the context the engagements referred to would relate\\n\\t\\t\\t\\tto beneficial contracts connected with the orphan's\\n\\t\\t\\t\\tproperty or promises or undertakings given by the\\n\\t\\t\\t\\tguardian or implied in the terms of his appointment. But\\n\\t\\t\\t\\tthe words are general and may be interpreted in the\\n\\t\\t\\t\\tgeneral sense. Note that this sentence does not occur in\\n\\t\\t\\t\\tthe similar passage in vi. 152, where there was a\\n\\t\\t\\t\\tdiscussion of social laws: it is appropriate here, where\\n\\t\\t\\t\\tthe discussion is about the guardian's personal and\\n\\t\\t\\t\\tindividual responsibility."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "35",
    "NoteID": "2221",
    "Body": "Giving just measure and weight is not only right in\\n\\t\\t\\t\\titself but is ultimately to the best advantage of the\\n\\t\\t\\t\\tperson who gives it."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "36",
    "NoteID": "2222",
    "Body": "Idle curiosity may lead us to nose into evil, through our\\n\\t\\t\\t\\tignorance that it is evil. We must guard against every\\n\\t\\t\\t\\tsuch danger. We must only hear the things that are known\\n\\t\\t\\t\\tto us to be of good report, and see things that are good\\n\\t\\t\\t\\tand instructive and entertain in our hearts feelings or\\n\\t\\t\\t\\tin our minds ideas that we have reason to expect will be\\n\\t\\t\\t\\tspiritually profitable to us. We shall be called to\\n\\t\\t\\t\\taccount for the exercise of every faculty that has been\\n\\t\\t\\t\\tgiven to us. This goes a little farther than a famous\\n\\t\\t\\t\\tsculpture on a Japanese temple in which three monkeys are\\n\\t\\t\\t\\tshown as putting their hands to their ears, eyes, and\\n\\t\\t\\t\\tmouths, respectively, to show that they were not prepared\\n\\t\\t\\t\\tto hear any evil, or see any evil, or speak any evil.\\n\\t\\t\\t\\tHere idle curiosity is condemned. Futility is to be\\n\\t\\t\\t\\tavoided even if it does not reach the degree of positive\\n\\t\\t\\t\\tevil."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "37",
    "NoteID": "2223",
    "Body": "Insolence, or arrogance, or undue elation at our powers\\n\\t\\t\\t\\tor capacities, is the first step to many evils. Besides,\\n\\t\\t\\t\\tit is unjustified. All our gifts are from Allah."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "39",
    "NoteID": "2224",
    "Body": "The moral law, as expounded in xvii. 23-39 is far in\\n\\t\\t\\t\\tadvance of the bare Decalogue in that it searches out\\n\\t\\t\\t\\tmotives, and draws pointed attention to the weak and\\n\\t\\t\\t\\thelpless if we are to reach any real understanding of\\n\\t\\t\\t\\tAllah. It begins with a mention of the worship of Allah,\\n\\t\\t\\t\\tthe One True God and ends with a similar mention to close\\n\\t\\t\\t\\tthe argument, thus emphasizing the fact that the love of\\n\\t\\t\\t\\tAllah embraces the love of man and practical help of our\\n\\t\\t\\t\\tfellow-creatures."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "39",
    "NoteID": "2225",
    "Body": "\"Blameworthy\" carries us back by reminiscence to xvii.\\n\\t\\t\\t\\t29, between which and this verse there is mention of\\n\\t\\t\\t\\tcrimes committed out of covetousness and a selfish\\n\\t\\t\\t\\tdisregard of other people's rights. \"Rejected\" carries\\n\\t\\t\\t\\tback our reminiscence to xvii. 18, from which to here we\\n\\t\\t\\t\\thave a reference to crimes that lead to deprivation of\\n\\t\\t\\t\\tAllah's grace. The latter is of course wider than the\\n\\t\\t\\t\\tformer. Note how subtly the two streams of thought are\\n\\t\\t\\t\\there conjoined."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "40",
    "NoteID": "2226",
    "Body": "Cf. xvi. 57-59. Insistence on true worship means also\\n\\t\\t\\t\\texclusion of false worship or worship derogatory to\\n\\t\\t\\t\\tAllah. In circles where daughters were despised and even\\n\\t\\t\\t\\ttheir lives had to be protected by special legislation,\\n\\t\\t\\t\\twhat could have been dreadful than ascribing daughters to\\n\\t\\t\\t\\tAllah?"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "41",
    "NoteID": "2227",
    "Body": "Things are explained in the Qur-an from all points of\\n\\t\\t\\t\\tview, individual and national, by means of stories,\\n\\t\\t\\t\\tparables, and figures of speech, and by way of\\n\\t\\t\\t\\tcategorical commands. But those who are evil, instead of\\n\\t\\t\\t\\tprofiting by such instruction, often go farther and\\n\\t\\t\\t\\tfarther away from the Truth."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "42",
    "NoteID": "2228",
    "Body": "There is only One True God. But if, as polytheists say,\\n\\t\\t\\t\\tthere had been subsidiary gods, they would yet have had\\n\\t\\t\\t\\tto submit to the Throne of the Supreme God, and worship\\n\\t\\t\\t\\tHim."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "44",
    "NoteID": "2229",
    "Body": "All Creation, animate and inanimate, sings Allah's\\n\\t\\t\\t\\tpraises and celebrates His glory,-animate, with\\n\\t\\t\\t\\tconsciousness, and inanimate, in the evidence which it\\n\\t\\t\\t\\tfurnishes of the unity and glory of Allah. All Nature\\n\\t\\t\\t\\tbears witness to His power, wisdom, and goodness. It is\\n\\t\\t\\t\\tonly \"ye\", i.e., those who reject the whole trend of your\\n\\t\\t\\t\\tnature and deny Faith simply because ye have been given a\\n\\t\\t\\t\\tlimited amount of choice and free-will,-it is only such\\n\\t\\t\\t\\tas \"ye\" that understand not what every other creature\\n\\t\\t\\t\\tunderstands and proclaims with joy and pride. What must\\n\\t\\t\\t\\tbe your degradation! And yet Allah bears with you and\\n\\t\\t\\t\\tforgives you! Such is His goodness!"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "45",
    "NoteID": "2230",
    "Body": "Veil invisible: Some Commentators understand mastur here\\n\\t\\t\\t\\tas equivalent to satir: a veil that makes invisible, a\\n\\t\\t\\t\\tthick or dark veil. But I think that the meaning of\\n\\t\\t\\t\\tmastur (in the passive voice) as \"hidden or invisible\" is\\n\\t\\t\\t\\tmore consonant with the whole passage. If all nature,\\n\\t\\t\\t\\texternal and within ourselves, declares Allah's glory,\\n\\t\\t\\t\\tthose unfortunate who cut themselves off from their\\n\\t\\t\\t\\tbetter nature are isolated from the true servants of\\n\\t\\t\\t\\tAllah and the revelation of Allah, because (1) they are\\n\\t\\t\\t\\tunfit for being in their company, and (2) because the\\n\\t\\t\\t\\tservants of Allah and the revelation of Allah must be\\n\\t\\t\\t\\tprotected from the pain which blasphemy or rebellion must\\n\\t\\t\\t\\tcause to their unsullied nature. The veil is none the\\n\\t\\t\\t\\tless real even though it is invisible."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "46",
    "NoteID": "2231",
    "Body": "The invisible veil being put against the ungodly on\\n\\t\\t\\t\\taccount of their deliberate rejection of Truth, the\\n\\t\\t\\t\\tresult is that their minds are fogged so that they cannot\\n\\t\\t\\t\\tunderstand and their ears are clogged so that they cannot\\n\\t\\t\\t\\thear. In other words the effects of Evil become\\n\\t\\t\\t\\tcumulative in shutting out Allah's grace."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "47",
    "NoteID": "2232",
    "Body": "See last note. That being so, the only motive for the\\n\\t\\t\\t\\tungodly to listen to Allah's Truth is to scoff at it\\n\\t\\t\\t\\tinstead of to be instructed by it. They may make a show\\n\\t\\t\\t\\tof listening, but when they meet together in private,\\n\\t\\t\\t\\tthey show themselves in their true colours. Cf. ii. 14.\\n\\t\\t\\t\\tThey cannot help seeing that there is singular charm and\\n\\t\\t\\t\\tattractiveness in Allah's Word, and that it consoles,\\n\\t\\t\\t\\thelps, and elevates many people who receive it in the\\n\\t\\t\\t\\tright spirit. So they pretend that they are superior to\\n\\t\\t\\t\\tsuch people and laugh at them for listening to some one\\n\\t\\t\\t\\twho is only under the influence of something which they\\n\\t\\t\\t\\tcall magic!"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "48",
    "NoteID": "2233",
    "Body": "Note that the word used is \"Sabilan\" \"a way\", not \"the\\n\\t\\t\\t\\tway\". In going astray they have lost the way; but never\\n\\t\\t\\t\\tcan they find any means of getting back to that way, or\\n\\t\\t\\t\\tof justifying themselves or making good their wicked\\n\\t\\t\\t\\tsimiles."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "49",
    "NoteID": "2234",
    "Body": "They do not realise that Allah Who created them once out\\n\\t\\t\\t\\tof nothing can create them again, with memories of their\\n\\t\\t\\t\\tpast, in order to render to Him an account of how they\\n\\t\\t\\t\\tused or misused the talents and opportunities which they\\n\\t\\t\\t\\twere given. If it is to be a new Creation, what then?\\n\\t\\t\\t\\tBones and dust or ashes may yet retain something of the\\n\\t\\t\\t\\tpersonality which was enshrined in them. But even if they\\n\\t\\t\\t\\twere reduced to stones or iron or anything which their\\n\\t\\t\\t\\tminds can conceive of as being most unlike them, yet\\n\\t\\t\\t\\tthere is nothing impossible to Allah! He has clearly sent\\n\\t\\t\\t\\ta Message that we shall have to render an account of\\n\\t\\t\\t\\tourselves, and His Message is necessarily true."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "51",
    "NoteID": "2235",
    "Body": "The sceptic shifts his ground when he is cornered in\\n\\t\\t\\t\\targument. It is no longer tenable for him to say that it\\n\\t\\t\\t\\tcannot happen or that there is no one who can bring him\\n\\t\\t\\t\\tback to life and memory. He now gets shaky, and says,\\n\\t\\t\\t\\t\"Well, when is that going to happen?\" The actual time no\\n\\t\\t\\t\\tman can tell. Indeed that event will be on a plane in\\n\\t\\t\\t\\twhich there will be no Time. Our relative ideas of time\\n\\t\\t\\t\\tand place will have been completely overthrown, and it\\n\\t\\t\\t\\twill appear to us then, not that it has been postponed\\n\\t\\t\\t\\ttoo long, but that it has come too soon! See the next\\n\\t\\t\\t\\tverse and note."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "52",
    "NoteID": "2236",
    "Body": "It may be that this verse should not be in the inverted\\n\\t\\t\\t\\tcommas governed by the verb \"say\", in the last clause of\\n\\t\\t\\t\\tthe last verse. In that case, the answer to the sceptic\\n\\t\\t\\t\\twould be finished in the last verse, and this verse would\\n\\t\\t\\t\\tbe a general statement applying also to the righteous,\\n\\t\\t\\t\\twho will rise up celebrating the praises of Allah. But on\\n\\t\\t\\t\\tthe whole, I think it is better to take this verse as\\n\\t\\t\\t\\tpart of the answer to the sceptic referred to in the last\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "52",
    "NoteID": "2237",
    "Body": "Whatever may have been your spiritual blindness in this\\n\\t\\t\\t\\tlife, the \"new creation\" will have opened your eyes to\\n\\t\\t\\t\\tthe Truth. No one will any longer be in any delusion as\\n\\t\\t\\t\\tregards the Reality of Allah, and will be forced, by\\n\\t\\t\\t\\ttheir new circumstances, to recognise the Truth and sing\\n\\t\\t\\t\\tAllah's praises. And all will be surprised at the\\n\\t\\t\\t\\tseemingly short flight of time since they had their\\n\\t\\t\\t\\tlittle ephemeral life on this earth. They will now\\n\\t\\t\\t\\tappraise its true worth."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "53",
    "NoteID": "2238",
    "Body": "This command refers to two situations. (1) Even to your\\n\\t\\t\\t\\tenemies and the enemies of Allah you should speak fair:\\n\\t\\t\\t\\twho are you to judge others? Judgment belongs to Allah\\n\\t\\t\\t\\talone, for He knows you (i.e., all mankind) best, and\\n\\t\\t\\t\\tyour personal knowledge is at best imperfect. And Satan\\n\\t\\t\\t\\tis always trying to divide mankind. (2) Amongst\\n\\t\\t\\t\\tyourselves, also you should not entertain suspicions, but\\n\\t\\t\\t\\tspeak politely according to the best standards of human\\n\\t\\t\\t\\tspeech. A false or unkind word may destroy all your\\n\\t\\t\\t\\tefforts at building up unity, because the forces of\\n\\t\\t\\t\\tdisruption are more numerous than the forces of unity."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "54",
    "NoteID": "2239",
    "Body": "Man should never for a single moment entertain a thought\\n\\t\\t\\t\\tthat would imply that he was wiser than Allah. Allah's\\n\\t\\t\\t\\tknowledge is all-embracing. If He grants mercy to some\\n\\t\\t\\t\\tthat you consider wicked or punishment to some that you\\n\\t\\t\\t\\tconsider righteous, it is your knowledge or your\\n\\t\\t\\t\\tdeductions that are at fault, not Allah's righteous Plan.\\n\\t\\t\\t\\tEven Prophets of Allah are not sent to arrange or dispose\\n\\t\\t\\t\\tof men's affairs, but only to teach Allah's Message. How\\n\\t\\t\\t\\tmuch less can ordinary men presume to judge other men?\\n\\t\\t\\t\\tThe Mashiyat-Will and Plan of Allah-is above all human\\n\\t\\t\\t\\twisdom."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "55",
    "NoteID": "2240",
    "Body": "Not only are we not to judge other ordinary men and carp\\n\\t\\t\\t\\tat them. We are not to set up false standards for judging\\n\\t\\t\\t\\tthe Prophets of Allah. If one was born of the unlearned\\n\\t\\t\\t\\tArab race, he yet was a mercy to all the worlds. If one\\n\\t\\t\\t\\tspoke to Allah as Kalimullah or another's life began with\\n\\t\\t\\t\\ta miracle; it does not imply superiority. It only means\\n\\t\\t\\t\\tthat Allah's wisdom is more profound than we can fathom."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "55",
    "NoteID": "2241",
    "Body": "The gifts with which the prophets came may themselves\\n\\t\\t\\t\\ttake different forms, according to the needs of the world\\n\\t\\t\\t\\tand the times in which they lived, as judged by the\\n\\t\\t\\t\\twisdom of Allah. A striking example here given is the\\n\\t\\t\\t\\tgift of David over others. David was given the Zabur, the\\n\\t\\t\\t\\tPsalter or Psalms, intended to be for the worship of\\n\\t\\t\\t\\tAllah and the celebration of Allah's praise. For the Book\\n\\t\\t\\t\\tof Psalms, see the last part of n. 669 to iv. 163, where\\n\\t\\t\\t\\texactly the same words are used about David."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "56",
    "NoteID": "2242",
    "Body": "Men's suspicions of each or of the prophets have been\\n\\t\\t\\t\\tcondemned in the previous verses. We now have the\\n\\t\\t\\t\\tstrongest condemnation of all, that of imagining any\\n\\t\\t\\t\\tother being as being equal or in the same category with\\n\\t\\t\\t\\tOne true God. Allah has all power: they have no power.\\n\\t\\t\\t\\tThey cannot remove men's troubles. They cannot even\\n\\t\\t\\t\\tmitigate or change them so as to afford the least relief.\\n\\t\\t\\t\\tWhy indulge in false worship?"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "57",
    "NoteID": "2243",
    "Body": "Where men or heroes, or prophets or angels are\\n\\t\\t\\t\\tworshipped, the worship is futile; because (1) even if\\n\\t\\t\\t\\tthey are good and holy, and ever so near to Allah, yet\\n\\t\\t\\t\\tthe nearest of them have need to seek means of access to\\n\\t\\t\\t\\tAllah, and they do seek such means, viz.: the hope of\\n\\t\\t\\t\\tAllah's Grace; (2) though by their very nature it is\\n\\t\\t\\t\\timpossible for us to suppose that they will incur the\\n\\t\\t\\t\\tWrath of Allah, yet they are but creatures and are\\n\\t\\t\\t\\tsubject to the law of personal responsibility."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "58",
    "NoteID": "2244",
    "Body": "These verses are a commentary on the last clause of the\\n\\t\\t\\t\\tlast verse. \"The Wrath of thy Lord is something to take\\n\\t\\t\\t\\theed of.\" The godless thoughtlessly challenge Allah's\\n\\t\\t\\t\\tWrath, but do they realise its nature? Even the best of\\n\\t\\t\\t\\tus must be moved with terror when we think of its\\n\\t\\t\\t\\tconsequences, were it not for His unbounded Mercy. Those\\n\\t\\t\\t\\twho deny the Hereafter fail to realise its terrible\\n\\t\\t\\t\\tPortents. They ask for Portents and Miracles now, but do\\n\\t\\t\\t\\tthey realise that their coming means destruction and\\n\\t\\t\\t\\tmisery to those who reject faith? They will come soon\\n\\t\\t\\t\\tenough. The whole world will be convulsed before the Day\\n\\t\\t\\t\\tof Judgment. The part of the wise is to prepare for it."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "59",
    "NoteID": "2245",
    "Body": "Past generations treated Signs and Portents with contempt\\n\\t\\t\\t\\tor rebellion, and brought about their own undoing. It is\\n\\t\\t\\t\\tonly Allah's Mercy that gives them Grace for a time and\\n\\t\\t\\t\\tprevents the coming of those Portents and Punishments\\n\\t\\t\\t\\twhich would overwhelm them if they were put to their\\n\\t\\t\\t\\ttrial at once."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "59",
    "NoteID": "2246",
    "Body": "An example is cited from the story of Thamud. A wonderful\\n\\t\\t\\t\\tShe-camel was sent among them as a Portent and a Symbol.\\n\\t\\t\\t\\tIn their wickedness they hamstrung her. So instead of her\\n\\t\\t\\t\\treclaiming them she was a cause of their destruction, as\\n\\t\\t\\t\\ttheir sin and rebellion were laid bare. For the story of\\n\\t\\t\\t\\tthe She-camel and the references to the passages in which\\n\\t\\t\\t\\tshe is mentioned, see n. 1044 to vii. 73."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "59",
    "NoteID": "2247",
    "Body": "Signs, Miracles, and Portents are sent by Allah as a\\n\\t\\t\\t\\twarning, to strike terror into the hearts of evil-doers\\n\\t\\t\\t\\tand reclaim them to the right path. I have discussed Fear\\n\\t\\t\\t\\tas a motive for reclaiming certain kinds of hard hearts,\\n\\t\\t\\t\\tin my note 82 to ii. 74. But some hearts are so hard that\\n\\t\\t\\t\\teven this motive does not work. As they have a limited\\n\\t\\t\\t\\tfree-will given by Allah, they are to that extent free to\\n\\t\\t\\t\\tchoose. But when they actually choose evil, Allah in His\\n\\t\\t\\t\\tinfinite Mercy delays their punishment and removes the\\n\\t\\t\\t\\toccasion for their immediate self-destruction by\\n\\t\\t\\t\\twithholding the Signs which might make them transgress\\n\\t\\t\\t\\tall the more and compass their total destruction."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "60",
    "NoteID": "2248",
    "Body": "The reference may be to lxxii. 28, probably an earlier\\n\\t\\t\\t\\tMakkan revelation. But the argument is independent of\\n\\t\\t\\t\\ttime. This verse falls naturally into three divisions.\\n\\t\\t\\t\\tWarnings and Portents and Signs are sent or not sent\\n\\t\\t\\t\\taccording to Allah's All-Wise Plan of Mercy and Justice,\\n\\t\\t\\t\\tthis is in no wise inconsistent with the apparent freedom\\n\\t\\t\\t\\tgiven to the wicked: because (1) in any case Allah is all\\n\\t\\t\\t\\tround all His creatures, and His delay as a Sign of Mercy\\n\\t\\t\\t\\tin no way diminishes His power; (2) the Visions of Truth\\n\\t\\t\\t\\tvouchsafed to Prophets of Allah are themselves Signs by\\n\\t\\t\\t\\twhich they can warn the ungodly; and (3) sometimes it is\\n\\t\\t\\t\\tmore merciful to give them time by not immediately\\n\\t\\t\\t\\tbringing the matter to judgment."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "60",
    "NoteID": "2249",
    "Body": "Some Commentators take this as referring to the Mi'raj\\n\\t\\t\\t\\t(xvii. 1) and others to other visions. Such visions are\\n\\t\\t\\t\\tmiracles, and become a stumbling block to unbelievers.\\n\\t\\t\\t\\tThey are an encouragement to men of faith. Thus they are\\n\\t\\t\\t\\t\"a trial for men\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "60",
    "NoteID": "2250",
    "Body": "The tree Zaqqum, a bitter and pungent tree described as\\n\\t\\t\\t\\tgrowing at the bottom of Hell, a type of all that is\\n\\t\\t\\t\\tdisagreeable. See xxxvii. 62-65; xliv. 43-46; and lvi.\\n\\t\\t\\t\\t52. All these are Suras chronologically earlier than this\\n\\t\\t\\t\\tSura. The application of the name to a tree of the\\n\\t\\t\\t\\tmyrobalan kind in the region of Jericho is, I think, of\\n\\t\\t\\t\\tpost-Quranic date. It is a trial for wrong-doers. See\\n\\t\\t\\t\\txxxvii. 63 and n. 4073."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "61",
    "NoteID": "2251",
    "Body": "Cf. vii. 11-18, which deals, as is the case here, with\\n\\t\\t\\t\\tthe temptation of the individual human soul, while ii.\\n\\t\\t\\t\\t30-38 deals with the collective race of man through Adam.\\n\\t\\t\\t\\tArrogance, jealousy, spite, and hatred are the\\n\\t\\t\\t\\tingredients in the story of Iblis."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "62",
    "NoteID": "2252",
    "Body": "The power of Evil (Satan) over man is due to man's\\n\\t\\t\\t\\tlimited free-will. In other words man hands himself to\\n\\t\\t\\t\\tEvil. As to those who loyally worship and serve Allah,\\n\\t\\t\\t\\tEvil has no power over them. This is expressly mentioned\\n\\t\\t\\t\\tin verse 65 below, and in other places."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "63",
    "NoteID": "2253",
    "Body": "The power of Evil is summarily dismissed, but not without\\n\\t\\t\\t\\ta clear warning. \"Do thy worst; if any of them misuse\\n\\t\\t\\t\\ttheir limited free-will and deliberately follow thee,\\n\\t\\t\\t\\tthey must take the consequences with thee; all of you\\n\\t\\t\\t\\tmust answer according to your personal responsibility.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "64",
    "NoteID": "2254",
    "Body": "\"Do thy worst; but ye are both warned that that path\\n\\t\\t\\t\\tleads to destruction.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "64",
    "NoteID": "2255",
    "Body": "Evil has many snares for mankind. The one that is put in\\n\\t\\t\\t\\tthe foreground is the voice,-the seductive personal\\n\\t\\t\\t\\tappeal, that \"makes the worse appear the better part\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "64",
    "NoteID": "2256",
    "Body": "The forcible assault of Evil is next mentioned under the\\n\\t\\t\\t\\tmetaphor of cavalry and infantry. It is when cajolery and\\n\\t\\t\\t\\ttempting fair-seeming seem to fail that an attack is made\\n\\t\\t\\t\\tin force with weapons of violence, of all kinds, like the\\n\\t\\t\\t\\tdifferent arms in an organised army."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "64",
    "NoteID": "2257",
    "Body": "If the first assaults are resisted. Evil has other\\n\\t\\t\\t\\tweapons in its armoury. Tangible fruits are dangled\\n\\t\\t\\t\\tbefore the eyes, ill-gotten gains and children of sin,\\n\\t\\t\\t\\tthat follow from certain very alluring methods of\\n\\t\\t\\t\\tindulgence in passions. Or it may be children dedicated\\n\\t\\t\\t\\tto sin or worldly gains, etc. And then there are all\\n\\t\\t\\t\\tkinds of promises for the future."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "64",
    "NoteID": "2258",
    "Body": "This is a parenthetical clause inserted to show up what\\n\\t\\t\\t\\tthe promises of the Satan are worth."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "65",
    "NoteID": "2259",
    "Body": "This verse should be read along with the two preceding\\n\\t\\t\\t\\tones to complete their meaning. Evil has no power except\\n\\t\\t\\t\\tover those who yield to its solicitations."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "65",
    "NoteID": "2260",
    "Body": "As Evil has no authority over the sincere servants of\\n\\t\\t\\t\\tAllah, they should put their trust completely in Him. For\\n\\t\\t\\t\\tHe is All-Sufficient to carry out their affairs, and by\\n\\t\\t\\t\\tHis grace, to save them from all harm and danger."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "66",
    "NoteID": "2261",
    "Body": "This illustration of the sea, and the skill with which,\\n\\t\\t\\t\\tby Allah's grace, men pass through it with ease in order\\n\\t\\t\\t\\tto earn material gains by commerce, social gains by human\\n\\t\\t\\t\\tintercourse, and spiritual gains by knowledge, is\\n\\t\\t\\t\\tfrequently used to enforce Allah's goodness to man. Cf.\\n\\t\\t\\t\\tii. 164."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "67",
    "NoteID": "2262",
    "Body": "Against Allah's gracious gifts and mercies is contrasted\\n\\t\\t\\t\\tman's ingratitude. In danger he remembers Allah, the One\\n\\t\\t\\t\\tTrue God, but relapses into his own fancies when the\\n\\t\\t\\t\\tdanger is past. Cf. also x. 22-23."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "68",
    "NoteID": "2263",
    "Body": "Man is safe neither on land nor at sea except by the\\n\\t\\t\\t\\tgrace and mercy of Allah. How forcibly this is brought\\n\\t\\t\\t\\thome to us by the Quetta earthquake of 31st May 1935,\\n\\t\\t\\t\\twhen tens of thousands of men, women, and children,\\n\\t\\t\\t\\tperished in a few moments, by night, buried in debris!\\n\\t\\t\\t\\tThe stories of violent destructive tornadoes in such\\n\\t\\t\\t\\tareas as the southern United States are equally\\n\\t\\t\\t\\timpressive. The destruction is so sudden that the victims\\n\\t\\t\\t\\thave no time to arrange anything. They are simply wiped\\n\\t\\t\\t\\tout."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "69",
    "NoteID": "2264",
    "Body": "If a man flees from the Wrath of Allah, there is no place\\n\\t\\t\\t\\tsecure for him. He may flee from sea to land, and back\\n\\t\\t\\t\\tagain from land to sea. But his life depends on the\\n\\t\\t\\t\\tDisposer of all affairs. He may go again and again to\\n\\t\\t\\t\\tsea, and perhaps finally end by being drowned."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "70",
    "NoteID": "2265",
    "Body": "The distinction and honour conferred by Allah on man are\\n\\t\\t\\t\\trecounted in order to enforce the corresponding duties\\n\\t\\t\\t\\tand responsibilities of man. He is raised to a position\\n\\t\\t\\t\\tof honour above the brute creation: he has been granted\\n\\t\\t\\t\\ttalents by which he can transport himself from place to\\n\\t\\t\\t\\tplace by land, sea, and now by air: all the means for the\\n\\t\\t\\t\\tsustenance and growth of every part of his nature are\\n\\t\\t\\t\\tprovided by Allah; and his spiritual faculties (the\\n\\t\\t\\t\\tgreatest gift of Allah) raise him above the greater part\\n\\t\\t\\t\\tof Allah's Creation. Should he not then realise his noble\\n\\t\\t\\t\\tdestiny and prepare for his real life in the Hereafter?"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "71",
    "NoteID": "2266",
    "Body": "I have discussed the various meanings of Imam in ii. 124,\\n\\t\\t\\t\\tn. 124. What is the meaning here? The Commentators are\\n\\t\\t\\t\\tdivided. Some understand the meaning to be that each\\n\\t\\t\\t\\tPeople or Group will appear with its Leader, who will\\n\\t\\t\\t\\tbear witness to its virtues or sins: Cf. xvi. 84. Another\\n\\t\\t\\t\\tview is that the Imam is their revelation, their Book. A\\n\\t\\t\\t\\tthird is that the Imam is the record of deeds spoken of\\n\\t\\t\\t\\tin the next clause. I prefer the first."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "71",
    "NoteID": "2267",
    "Body": "Literally, by the value of a fatil, a small skin in the\\n\\t\\t\\t\\tcleft of a date-stone: this has no value."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "72",
    "NoteID": "2268",
    "Body": "On the Judgment Day the children of light will receive\\n\\t\\t\\t\\tand peruse their record, and will render joyful thanks to\\n\\t\\t\\t\\tAllah for His Mercies. What of the children of darkness?\\n\\t\\t\\t\\tThey had already been blind in this world's life, and\\n\\t\\t\\t\\tthey will not receive the light of Allah's Countenance\\n\\t\\t\\t\\tthen. On the contrary they will find that the longer the\\n\\t\\t\\t\\ttime they have travelled, the farther away they have gone\\n\\t\\t\\t\\tfrom the Path. Notice the association of ideas-blindness,\\n\\t\\t\\t\\tnot seeing the light, going farther and farther away from\\n\\t\\t\\t\\tthe true Path."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "73",
    "NoteID": "2269",
    "Body": "It happens with men of Allah, and it happened with the\\n\\t\\t\\t\\tholy Prophet, that they are tempted by the world with\\n\\t\\t\\t\\tmany things which appeal to the world generally, if they\\n\\t\\t\\t\\twould make some small concession in their favour. The\\n\\t\\t\\t\\t\"small concession\" may hold the key of the position, and\\n\\t\\t\\t\\tneutralise the whole teaching sent by Allah. If the\\n\\t\\t\\t\\tProphet had accepted wealth and position among the\\n\\t\\t\\t\\tQuraish and \"only respected\" their idols! The Quraish\\n\\t\\t\\t\\twould have taken him into their inner circle! A dishonest\\n\\t\\t\\t\\tliar like Musailama would have jumped at the opportunity\\n\\t\\t\\t\\tand been hailed as a friend and associate and made much\\n\\t\\t\\t\\tof. But Prophets of Allah are made of sterner stuff. They\\n\\t\\t\\t\\tare given special strength to resist all plausible\\n\\t\\t\\t\\tdeception."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "74",
    "NoteID": "2270",
    "Body": "From a purely human point of view it may seem policy to\\n\\t\\t\\t\\tmake a small \"concession\" to men's weakness in order to\\n\\t\\t\\t\\tfulfil a divine mission. But the divine Messenger is\\n\\t\\t\\t\\tgiven special strength to resist such temptations."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "75",
    "NoteID": "2271",
    "Body": "If such a thing was possible for a true Messenger of\\n\\t\\t\\t\\tAllah, viz.: a compromise with evil and a dereliction of\\n\\t\\t\\t\\this mission, he would be no exception to the law of\\n\\t\\t\\t\\tpersonal responsibility. Indeed, as the power and the\\n\\t\\t\\t\\tresponsibility were greater, the punishment would have\\n\\t\\t\\t\\tbeen greater too. It would have been double,-an exposure\\n\\t\\t\\t\\tin this life and the usual punishment in or after death\\n\\t\\t\\t\\tfor a desertion of Truth."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "75",
    "NoteID": "2272",
    "Body": "The motive held out by the world for a compromise with\\n\\t\\t\\t\\tTruth is itself fallacious. The motive is that the\\n\\t\\t\\t\\tcompromise may bring influence, position, and\\n\\t\\t\\t\\topportunity, if not wealth and the other good things of\\n\\t\\t\\t\\tlife. But these themselves (if attained) would be of no\\n\\t\\t\\t\\tuse or help if pitted against the command of Allah."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "76",
    "NoteID": "2273",
    "Body": "As happened in the case of the holy Prophet, the enemies\\n\\t\\t\\t\\ttry to frighten the Prophet of Allah away from their\\n\\t\\t\\t\\tmidst, so that, once away, they could expel him and keep\\n\\t\\t\\t\\thim out. But they are counting without the Plan of Allah.\\n\\t\\t\\t\\tIf they persecute the righteous, they dig their own\\n\\t\\t\\t\\tgraves!"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "77",
    "NoteID": "2274",
    "Body": "This was no new thing in history. Allah protects His own,\\n\\t\\t\\t\\tand the ungodly cannot long enjoy the fruits of their\\n\\t\\t\\t\\tunrighteousness even if their punishment be delayed a\\n\\t\\t\\t\\tlittle while."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "78",
    "NoteID": "2275",
    "Body": "The Commentators understand here the command for the five\\n\\t\\t\\t\\tdaily canonical prayers, viz.: the four from the\\n\\t\\t\\t\\tdeclination of the sun from the zenith to the fullest\\n\\t\\t\\t\\tdarkness of the night, and the early morning prayer,\\n\\t\\t\\t\\tFajr, which is usually accompanied by a reading of the\\n\\t\\t\\t\\tholy Qur-an. The four afternoon prayers are: Zuhr,\\n\\t\\t\\t\\timmediately after the sun begins to decline in the\\n\\t\\t\\t\\tafternoon; 'Asr, in the late afternoon; Magrib,\\n\\t\\t\\t\\timmediately after sunset; and Isha, after the glow of\\n\\t\\t\\t\\tsunset has disappeared and the full darkness of the night\\n\\t\\t\\t\\thas set in. There is difference of opinion as to the\\n\\t\\t\\t\\tmeaning of particular words and phrases, but none as to\\n\\t\\t\\t\\tthe general effect of the passage."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "78",
    "NoteID": "2276",
    "Body": "The morning prayer is specially singled out for separate\\n\\t\\t\\t\\tmention, because the morning is a \"peaceful hour\" and\\n\\t\\t\\t\\tspecial influences act on the soul awaking from the\\n\\t\\t\\t\\tnight's rest. Special testimony is borne to the prayers\\n\\t\\t\\t\\tof this hour by the angelic host."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "79",
    "NoteID": "2277",
    "Body": "This is held to be addressed specially to the holy\\n\\t\\t\\t\\tProphet who usually prayed more than the five canonical\\n\\t\\t\\t\\tprayers. The Tahajjud was a prayer after midnight, in the\\n\\t\\t\\t\\tsmall watches of the morning."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "79",
    "NoteID": "2278",
    "Body": "To the Prophet was to be assigned in the Hereafter the\\n\\t\\t\\t\\thighest Post of Honour and Glory-the Maqam Mahmud,\\n\\t\\t\\t\\timplying his excellence above all other Prophets. The\\n\\t\\t\\t\\timmediate reference may be to the hope that the Makkan\\n\\t\\t\\t\\tpersecution will soon be over and the glorious work in\\n\\t\\t\\t\\tMadinah will begin."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "80",
    "NoteID": "2279",
    "Body": "The entry and exit here referred to may be interpreted in\\n\\t\\t\\t\\tfour senses: (1) entry into death and exit at the\\n\\t\\t\\t\\tresurrection: for the righteous, who have purified their\\n\\t\\t\\t\\tsouls by prayer (last verse) and spiritual teaching from\\n\\t\\t\\t\\tthe Qur-an (next verse), there is on each occasion a\\n\\t\\t\\t\\tfuller and fuller realisation and enjoyment of truth and\\n\\t\\t\\t\\thonour: for those who are estranged from Allah, the\\n\\t\\t\\t\\teffect is the opposite: the truth becomes bitter and\\n\\t\\t\\t\\tthere is ignominy and exposure instead of honour: (2)\\n\\t\\t\\t\\tentry for the holy Prophet into the new life at Madinah,\\n\\t\\t\\t\\twhich was still in the womb of futurity, and exit from\\n\\t\\t\\t\\tthe life of persecution and the milieu of falsehood,\\n\\t\\t\\t\\twhich surrounded him in his native city of Makkah still\\n\\t\\t\\t\\tgiven up to idolatry: (3) referring to the impending\\n\\t\\t\\t\\tHijrat again, the prayer may mean, \"Let it be from pure\\n\\t\\t\\t\\tmotives of truth and spiritual honour, and not from\\n\\t\\t\\t\\tmotives of anger against the city of Makkah or its\\n\\t\\t\\t\\tpersecutors, or of ambition or worldly power from the\\n\\t\\t\\t\\tcity of Madinah, which was ready to lay everything at the\\n\\t\\t\\t\\tProphet's feet\": (4) generally, entry and exit at every\\n\\t\\t\\t\\tstage of life."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "80",
    "NoteID": "2280",
    "Body": "All prayer must be for Allah's aid and authority. However\\n\\t\\t\\t\\tmuch we may plan, our success must depend on His aid.\\n\\t\\t\\t\\tHowever nobler our motives, we have no right to imperil\\n\\t\\t\\t\\tany lives unless there is authority in the Word of Allah.\\n\\t\\t\\t\\tThe Prophet only acts on Allah's commission and\\n\\t\\t\\t\\tinspiration."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "81",
    "NoteID": "2281",
    "Body": "From its nature falsehood must perish, for it is the\\n\\t\\t\\t\\topposite of Truth, and Truth must ever prevail."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "82",
    "NoteID": "2282",
    "Body": "In Allah's revelation there is healing for our broken\\n\\t\\t\\t\\tspirits, hope for our spiritual future, and joy in the\\n\\t\\t\\t\\tforgiveness of our sins. All who work in faith will share\\n\\t\\t\\t\\tin these privileges. It is only the rebels against\\n\\t\\t\\t\\tAllah's Law who will suffer loss. The more they will\\n\\t\\t\\t\\toppose Truth, the deeper down will they go into the\\n\\t\\t\\t\\tmire-the state of sin and Wrath, which is worse than\\n\\t\\t\\t\\tdestruction."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "83",
    "NoteID": "2283",
    "Body": "Truth saves us from two extremes: when we are happy, we\\n\\t\\t\\t\\tare saved from being puffed up, for we realise that\\n\\t\\t\\t\\teverything comes from Allah; and when we suffer\\n\\t\\t\\t\\tmisfortunes, we are not in despair, for we know that\\n\\t\\t\\t\\tAllah is our sure refuge and help."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "84",
    "NoteID": "2284",
    "Body": "If the wicked go their own ways, there is nothing to\\n\\t\\t\\t\\tdiscourage us. It is their nature. We must seek and hold\\n\\t\\t\\t\\tfast to true guidance."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "85",
    "NoteID": "2285",
    "Body": "What is the nature of inspiration? Who brings it? Can it\\n\\t\\t\\t\\task its Bringer questions? Can we ask anything which we\\n\\t\\t\\t\\twish? These are the sort of questions always asked when\\n\\t\\t\\t\\tinspiration is called in question. The answer is given\\n\\t\\t\\t\\there. Inspiration is one of those high experiences which\\n\\t\\t\\t\\tcannot be explained in the terms of our everyday human\\n\\t\\t\\t\\texperience. It is spiritual. The Spirit (Gabriel) does\\n\\t\\t\\t\\tnot come of his own will. He comes by the command of\\n\\t\\t\\t\\tAllah, and reveals what Allah commands him to reveal. Of\\n\\t\\t\\t\\tthe sum-total of true divine knowledge what a small part\\n\\t\\t\\t\\tit is that ordinary mortals can understand! They can be\\n\\t\\t\\t\\tonly given that which they can understand, however dimly.\\n\\t\\t\\t\\tWe are not in a position to ask anything that we wish. If\\n\\t\\t\\t\\twe did so, it would only make us look foolish, for the\\n\\t\\t\\t\\tguidance comes from Allah's Wisdom, not from our worldly\\n\\t\\t\\t\\tknowledge."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "86",
    "NoteID": "2286",
    "Body": "Even the spiritual knowledge that comes to us comes\\n\\t\\t\\t\\tbecause of the favour and mercy of Allah. If He were to\\n\\t\\t\\t\\twithhold it, who can call Him in question?"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "87",
    "NoteID": "2287",
    "Body": "In that case the only one who can plead for us is the\\n\\t\\t\\t\\tMercy of Allah. We can interpret the phrase in its widest\\n\\t\\t\\t\\tabstract sense, as well as in the concrete sense of the\\n\\t\\t\\t\\ttitle which is applied to the holy Prophet Muhammad, the\\n\\t\\t\\t\\tMercy of Allah. Thus we come from the abstract question\\n\\t\\t\\t\\tto the concrete question of the Qur-an, which is referred\\n\\t\\t\\t\\tto by name in the verses that follow."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "88",
    "NoteID": "2288",
    "Body": "For the meaning of \"Jinns\", see n. 929 to vi. 100."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "88",
    "NoteID": "2289",
    "Body": "The proof of the Qur-an is in its own beauty and nature,\\n\\t\\t\\t\\tand the circumstances in which it was promulgated. The\\n\\t\\t\\t\\tworld is challenged to produce a Book like it and has not\\n\\t\\t\\t\\tproduced one. It is the only revealed Book whose text\\n\\t\\t\\t\\tstands pure and uncorrupted today. Cf., for a similar\\n\\t\\t\\t\\tchallenge, ii. 23, x. 38, and xi. 13."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "89",
    "NoteID": "2290",
    "Body": "In the Qur-an everything is explained in detail from\\n\\t\\t\\t\\tvarious points of view, by commands, similitudes,\\n\\t\\t\\t\\texamples, stories, parables, etc. It does not merely\\n\\t\\t\\t\\tnarrate stories or lay down vague abstract propositions.\\n\\t\\t\\t\\tIt gives every detailed help in outward and inner life."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "89",
    "NoteID": "2291",
    "Body": "One form in which it can be received with ingratitude is\\n\\t\\t\\t\\tto pay verbal tributes to it but not study it as it ought\\n\\t\\t\\t\\tto be studied (ii. 121, haqqa tilawatihi), or to disobey\\n\\t\\t\\t\\tits precepts or standards."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "90",
    "NoteID": "2292",
    "Body": "Cf. ii. 60."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "91",
    "NoteID": "2293",
    "Body": "This ill-assorted and crude jumble of the sort of\\n\\t\\t\\t\\tmiracles which the Unbelievers wanted is in very\\n\\t\\t\\t\\tappropriate contrast to the sober and reasoned argument\\n\\t\\t\\t\\twhich has begun in the last sentence of verse 93 and\\n\\t\\t\\t\\tcontinued in sections 11 and 12, which close this Sura.\\n\\t\\t\\t\\tIt is throughout reminiscent of the materialistic\\n\\t\\t\\t\\timagination of Jewish sceptics, which was mainly\\n\\t\\t\\t\\tresponsible for the fall of the Jewish nation (see verse\\n\\t\\t\\t\\t104 below). For a thirsty people sojourning in a dry\\n\\t\\t\\t\\tland, the finding of a spring of water as in the story of\\n\\t\\t\\t\\tMoses or of the well of Zamzam is an appropriate miracle.\\n\\t\\t\\t\\tBut miracles are not for faithless crowds to gape at. A\\n\\t\\t\\t\\tbeautiful well-watered Garden is a symbol of Felicity:\\n\\t\\t\\t\\tbut a sceptic cannot order Allah to produce it for his\\n\\t\\t\\t\\tpleasure. The same may be said about a house adorned with\\n\\t\\t\\t\\tgold, except that its symbolism is even more\\n\\t\\t\\t\\tmaterialistic. The fall of the sky or producing Allah\\n\\t\\t\\t\\tface to face or climbing to the skies by a ladder, or\\n\\t\\t\\t\\tbringing down a book of parchment which men could handle,\\n\\t\\t\\t\\tare all irreverent suggestions that make no distinction\\n\\t\\t\\t\\tbetween spiritual and material things."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "92",
    "NoteID": "2294",
    "Body": "Contrast the sublime passages like the beginning with\\n\\t\\t\\t\\tlxxxii. 1 or that in xxv. 25, where the final breaking up\\n\\t\\t\\t\\tof the firmaments as we know them is referred to in the\\n\\t\\t\\t\\tworld's catastrophe, with the ridiculous demand that it\\n\\t\\t\\t\\tshould be done for the sport of the sceptics!"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "92",
    "NoteID": "2295",
    "Body": "Cf. ii 55 and iv. 153 about the desire of the Israelites\\n\\t\\t\\t\\tto see Allah face to face; and vi. 8-9, about angels\\n\\t\\t\\t\\tcoming down to convince men."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "93",
    "NoteID": "2296",
    "Body": "Cf. vi. 35 about a ladder to the skies."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "93",
    "NoteID": "2297",
    "Body": "Cf. vi. 7 for the foolish idea of materialistic sceptics\\n\\t\\t\\t\\tthat a spiritual revelation could come down from the\\n\\t\\t\\t\\theavens on a piece of parchment that they can touch."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "93",
    "NoteID": "2298",
    "Body": "A prophet or messenger of Allah is a man at the command\\n\\t\\t\\t\\tof Allah, and not to satisfy the disingenuous whims and\\n\\t\\t\\t\\tfancies of Unbelievers. Miracles greater than any that\\n\\t\\t\\t\\ttheir foolish fancies could devise were before them. The\\n\\t\\t\\t\\tQur-an was such a miracle, and it is a standing miracle\\n\\t\\t\\t\\tthat lasts through the ages. Why did they not believe?\\n\\t\\t\\t\\tThe real reason was spite and jealousy like that of\\n\\t\\t\\t\\tIblis. See next verse."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "94",
    "NoteID": "2299",
    "Body": "When a man is raised to honour and dignity, his sincere\\n\\t\\t\\t\\tbrothers rejoice, for it is an honour that reflects its\\n\\t\\t\\t\\tglory on them. But those with evil in their hearts are\\n\\t\\t\\t\\tjealous like their prototype Iblis, (xvii. 61, n. 2251).\\n\\t\\t\\t\\tTo such men the mere fact that their own brother receives\\n\\t\\t\\t\\tthe grace of Allah is enough to turn them against that\\n\\t\\t\\t\\tbrother. Any other reasons they may devise are mere\\n\\t\\t\\t\\tmake-believe."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "95",
    "NoteID": "2300",
    "Body": "The argument is that if angels inhabited this earth, an\\n\\t\\t\\t\\tangel from heaven could be sent down as a messenger to\\n\\t\\t\\t\\tthem, as they could mutually understand each other, and\\n\\t\\t\\t\\tthe Message of Allah could be explained without\\n\\t\\t\\t\\tdifficulty. But the earth is inhabited by men, and the\\n\\t\\t\\t\\tmen themselves are divided into races, or groups, or\\n\\t\\t\\t\\tnations. To each Group is sent a prophet from among their\\n\\t\\t\\t\\tbrethren: to 'Ad, their brother Hud (xi. 50); to Thamud,\\n\\t\\t\\t\\ttheir brother Salih (xi. 61): and so on. As a matter of\\n\\t\\t\\t\\tfact, with wicked men, constituted as they are, the\\n\\t\\t\\t\\tappearance of an angel causes disturbance and an unseemly\\n\\t\\t\\t\\triot, as in the case of the angels that came to Lot (xi.\\n\\t\\t\\t\\t77-80). In any case they cannot carry out an effective\\n\\t\\t\\t\\tmission among men (vi. 8-9)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "96",
    "NoteID": "2301",
    "Body": "'If you want a real witness, it is not these sorts of\\n\\t\\t\\t\\tfancy miracles, but the witness of the true ever-living\\n\\t\\t\\t\\tGod. Purify your hearts, and ask Him in true contrition\\n\\t\\t\\t\\tand repentance, and He will guide you and show you the\\n\\t\\t\\t\\tWay'."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "97",
    "NoteID": "2302",
    "Body": "'All your insincere subtleties are of no use. The only\\n\\t\\t\\t\\treal guidance is the guidance of Allah. If you do not\\n\\t\\t\\t\\tseek His grace, you will be lost. Besides Him, there is\\n\\t\\t\\t\\tno true friend or protector'."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "97",
    "NoteID": "2303",
    "Body": "'If you still persist in your evil ways, what is to be\\n\\t\\t\\t\\tyour evil end? You will become more and more identified\\n\\t\\t\\t\\twith the Company of Evil. You will come to shame and\\n\\t\\t\\t\\tignominy, like men thrown down prone on their faces. You\\n\\t\\t\\t\\twill lose the use of all the faculties of judgment with\\n\\t\\t\\t\\twhich Allah has endowed you. Instead of seeing, you will\\n\\t\\t\\t\\tbe blind to Allah's Signs. Instead of having the power of\\n\\t\\t\\t\\tseeking Him in prayer and rejoicing in His grace, you\\n\\t\\t\\t\\twill be dumb. Instead of hearing the harmony and music of\\n\\t\\t\\t\\tthe spheres, as typified in the pure and harmonious lives\\n\\t\\t\\t\\tof men, you will hear nothing or only hear dull or\\n\\t\\t\\t\\tconfused sounds like deaf men. The scorching fire of your\\n\\t\\t\\t\\tpunishment will not grow less, but grow more fierce as\\n\\t\\t\\t\\tyou go deeper into Hell'."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "98",
    "NoteID": "2304",
    "Body": "This phrase is repeated from xvii. 49. The reminiscence\\n\\t\\t\\t\\trounds off the argument. After certain moral precepts to\\n\\t\\t\\t\\twhich Faith was linked, we have had a discussion of\\n\\t\\t\\t\\tUnfaith. Its various motives have been analysed, and its\\n\\t\\t\\t\\tpenalties have been allegorically shadowed forth. After\\n\\t\\t\\t\\tthis, the example of Pharaoh is held as a type of Unfaith\\n\\t\\t\\t\\tin the next section, and the Sura closed with an\\n\\t\\t\\t\\texhortation to faith and a declaration of the glory of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "99",
    "NoteID": "2305",
    "Body": "Allah, Who created all that is in the heavens and on\\n\\t\\t\\t\\tearth, has surely the power to revive the life of\\n\\t\\t\\t\\tindividual souls after their bodies have perished,-and\\n\\t\\t\\t\\trevive them with memories of their past life and for a\\n\\t\\t\\t\\tcontinuation of their spiritual history. Only He has\\n\\t\\t\\t\\tfixed a term for each stage of our existence, which we\\n\\t\\t\\t\\tcan neither prolong nor shorten."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "99",
    "NoteID": "2306",
    "Body": "This phrase carries us back to xvii. 89, after we began\\n\\t\\t\\t\\tthe argument about the real motives for the rejection of\\n\\t\\t\\t\\tthe Qur-an by sceptics. The argument is now closed in a\\n\\t\\t\\t\\tsort of minor circle within the major circle sketched in\\n\\t\\t\\t\\tn. 2304 above."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "100",
    "NoteID": "2307",
    "Body": "A fresh argument is now addressed to those who would\\n\\t\\t\\t\\tconfine Allah's revelations to a limited circle of men,\\n\\t\\t\\t\\tsuch as they themselves belonged to. The immediate\\n\\t\\t\\t\\treference was to the Jews, who could not understand how\\n\\t\\t\\t\\tany Gentiles could receive revelations and guidance even\\n\\t\\t\\t\\tsuperior to what they considered their own birth-right.\\n\\t\\t\\t\\tBut the tendency is widespread in the human race. A\\n\\t\\t\\t\\tparticular race, or caste, or a particular kind of\\n\\t\\t\\t\\tculture, claims to be the custodian of Allah's Message,\\n\\t\\t\\t\\twhereas it is universal. Allah's Mercy is universal, and\\n\\t\\t\\t\\tHe scatters the priceless Treasures of His Mercy\\n\\t\\t\\t\\tbroadcast among His creatures. They are not exhausted by\\n\\t\\t\\t\\tspending. It is only the misers who hoard their wealth\\n\\t\\t\\t\\tfor fear it should be used up by spending. 'Are you\\n\\t\\t\\t\\tspiritual misers going to keep back Allah's holy Message\\n\\t\\t\\t\\tfrom the multitude? Is that the reason why you deny the\\n\\t\\t\\t\\tadvent of the new Teacher, who comes as a Mercy to all\\n\\t\\t\\t\\tmen-to all Creation?'"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "101",
    "NoteID": "2308",
    "Body": "Nine Clear Signs: see vii. 133, n. 1091. The story of\\n\\t\\t\\t\\tPharaoh (or a phase of it) is here told with a view to\\n\\t\\t\\t\\texhibiting the decline of a soul on account of pride in\\n\\t\\t\\t\\toutward power and dignity."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "101",
    "NoteID": "2309",
    "Body": "To them: i.e., to Pharaoh, as sitting in his Council,\\n\\t\\t\\t\\twith the Chiefs of his people. Cf. vii. 103. The whole\\n\\t\\t\\t\\tscene is described in some detail from the point of view\\n\\t\\t\\t\\tof nations or Ummats in vii. 103-133."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "101",
    "NoteID": "2310",
    "Body": "At a different and later stage in the scene, Pharaoh's\\n\\t\\t\\t\\tChiefs call Moses a \"sorcerer well-versed\" (vii. 109).\\n\\t\\t\\t\\tHere Moses, who had come with the Nine Signs but had not\\n\\t\\t\\t\\tyet shown them, is reproached with being the object of\\n\\t\\t\\t\\tsorcery: he is practically told that he is mad!"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "102",
    "NoteID": "2311",
    "Body": "We can well suppose Moses to ask Pharaoh to recall all\\n\\t\\t\\t\\tthe past history of Moses, for Moses had been brought up\\n\\t\\t\\t\\tin Pharaoh's palace in all the learning of the Egyptians.\\n\\t\\t\\t\\tHe could not therefore be mad, or a simpleton worked on\\n\\t\\t\\t\\tby Egyptian magic. What he was going to show was\\n\\t\\t\\t\\tsomething far greater; it was not the deceptive magic of\\n\\t\\t\\t\\tPharaoh's sorcerers, but true Signs that came from Allah,\\n\\t\\t\\t\\tthe Lord of all power. They were to open the eyes of his\\n\\t\\t\\t\\tpeople, and if Pharaoh resisted faith. Moses warns him\\n\\t\\t\\t\\tthat Pharaoh in that case was doomed to destruction. This\\n\\t\\t\\t\\tis the course of the soul that sinks down by Pride!"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "103",
    "NoteID": "2312",
    "Body": "Pharaoh on this tries various subterfuges and plans for\\n\\t\\t\\t\\tremoving not only Moses but all his people by doing away\\n\\t\\t\\t\\twith them. The detailed story is not told here but may be\\n\\t\\t\\t\\tread in S. vii. But Allah's Wrath descended on Pharaoh\\n\\t\\t\\t\\tand those who were with him in body and mind. The\\n\\t\\t\\t\\tEgyptians who repented were subject to Pharaoh's wrath\\n\\t\\t\\t\\tbut were saved from the Wrath of Allah (vii. 121-126)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "104",
    "NoteID": "2313",
    "Body": "The Israelites were taken to the Promised Land in\\n\\t\\t\\t\\tPalestine, and they established their own kingdom there,\\n\\t\\t\\t\\tbut they forfeited Allah's favour by their sins and\\n\\t\\t\\t\\tbackslidings and will have to answer like all souls by\\n\\t\\t\\t\\tthe law of personal responsibility at the Day of\\n\\t\\t\\t\\tJudgment."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "104",
    "NoteID": "2314",
    "Body": "The second of the warnings: the first was probably that\\n\\t\\t\\t\\tmentioned above, in xvii. 5 and the second that mentioned\\n\\t\\t\\t\\tin xvii. 7 (middle). When this second warning due to the\\n\\t\\t\\t\\trejection of Jesus came to pass, the Jews were gathered\\n\\t\\t\\t\\ttogether in a mingled crowd. Some Commentators understand\\n\\t\\t\\t\\tthe second warning to be the Day of Judgment, the Promise\\n\\t\\t\\t\\tof the Hereafter."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "105",
    "NoteID": "2315",
    "Body": "The Qur-an was sent down by Allah in Truth: it was not\\n\\t\\t\\t\\tforged by any mortal. It has descended in Truth: it was\\n\\t\\t\\t\\tnot and has not been falsified or corrupted in the\\n\\t\\t\\t\\tprocess of being communicated to mankind."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "105",
    "NoteID": "2316",
    "Body": "The part of the Prophet was that of a Messenger: he was\\n\\t\\t\\t\\tnot responsible if the ungodly rejected it. He fulfilled\\n\\t\\t\\t\\this mission in promulgating and explaining it and leaving\\n\\t\\t\\t\\tit as a legacy to the world."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "106",
    "NoteID": "2317",
    "Body": "The marvel is that these parts, revealed at different\\n\\t\\t\\t\\ttimes and in different circumstances, should fit together\\n\\t\\t\\t\\tso closely and consistently as they do. All revelation is\\n\\t\\t\\t\\tprogressive. The previous revelations were also\\n\\t\\t\\t\\tprogressive. Each of them marked a stage in the world's\\n\\t\\t\\t\\tspiritual history. Man's mind does not take in more than\\n\\t\\t\\t\\this spiritual state will have prepared him, for Allah's\\n\\t\\t\\t\\trevelation comes as a light to illuminate our\\n\\t\\t\\t\\tdifficulties and show us the way in actual situations\\n\\t\\t\\t\\tthat arise."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "107",
    "NoteID": "2318",
    "Body": "No one's belief or unbelief affects the beauty or\\n\\t\\t\\t\\tgrandeur of Allah's revelation. But those endowed with\\n\\t\\t\\t\\tspiritual knowledge or insight know at once when they\\n\\t\\t\\t\\thear Allah's holy Word, and fall down and adore Allah.\\n\\t\\t\\t\\tThose endowed with knowledge include those who had\\n\\t\\t\\t\\treceived previous revelations and had kept themselves\\n\\t\\t\\t\\tfree from corrupt ideas."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "108",
    "NoteID": "2319",
    "Body": "Those who had received previous revelations find in the\\n\\t\\t\\t\\tQur-an and in the Messenger who brought it, the promise\\n\\t\\t\\t\\tof Allah fulfilled. Those who were spiritually prepared\\n\\t\\t\\t\\tfor it found in the same way the satisfaction of their\\n\\t\\t\\t\\tspiritual yearnings: to them, also, Allah's promise was\\n\\t\\t\\t\\tsent to be fulfilled."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "109",
    "NoteID": "2320",
    "Body": "A feeling of earnest humility comes to the man who\\n\\t\\t\\t\\trealises how, in spite of his own unworthiness, he is\\n\\t\\t\\t\\tbrought, by Allah's Mercy, into touch with the most\\n\\t\\t\\t\\tsublime Truths. Such a man is touched with the deepest\\n\\t\\t\\t\\temotion, which finds its outlet in tears."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "110",
    "NoteID": "2321",
    "Body": "Cf. vii. 180. Rahman describes one of the attributes of\\n\\t\\t\\t\\tAllah,-His grace and Mercy which come to the sinner even\\n\\t\\t\\t\\tbefore he feels conscious of the need of it,-the\\n\\t\\t\\t\\tpreventive Grace which saves Allah's servants from sin.\\n\\t\\t\\t\\tSee n. 19 to i. 1. Allah can be invoked, either by His\\n\\t\\t\\t\\tsimple name, which includes all attributes, or by one of\\n\\t\\t\\t\\tthe names implying the attributes by which we try to\\n\\t\\t\\t\\texplain His nature to our limited understanding. The\\n\\t\\t\\t\\tattribute of Mercy in Rahman was particularly repugnant\\n\\t\\t\\t\\tto the Pagan Arabs (see xxv. 60, and xxi. 36): that is\\n\\t\\t\\t\\twhy special stress is laid on it in the Qur-an."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "110",
    "NoteID": "2322",
    "Body": "These Beautiful Names of Allah are many. The hadith\\n\\t\\t\\t\\trelated by Tirmizi, accepted by some as authentic,\\n\\t\\t\\t\\tmentions 99 names of Allah. Qadhi Muhammad Sulaiman has\\n\\t\\t\\t\\tpublished an Urdu monograph on the subject, published by\\n\\t\\t\\t\\tthe Daftar Rahmatun-lil- 'Alamin Patiala, 1930. Those who\\n\\t\\t\\t\\twish to see a poetic Commentary on the names in the form\\n\\t\\t\\t\\tof stories in English may consult Sir Edwin Arnold's\\n\\t\\t\\t\\tPearls of the Faith. Sir Edwin's stories are of unequal\\n\\t\\t\\t\\tmerit, but a fine example is furnished by No. 4,\\n\\t\\t\\t\\tal-Malik. \"The King\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "110",
    "NoteID": "2323",
    "Body": "Cf. vii. 205. All prayer should be pronounced with\\n\\t\\t\\t\\tearnestness and humility, whether it is congregational\\n\\t\\t\\t\\tprayer or the private outpouring of one's own soul. Such\\n\\t\\t\\t\\tan attitude is not consistent with an over-loud\\n\\t\\t\\t\\tpronunciation of the words, though in public prayers the\\n\\t\\t\\t\\tstandard of permissible loudness is naturally higher than\\n\\t\\t\\t\\tin the case of private prayer. In public prayers, of\\n\\t\\t\\t\\tcourse, the Azan or call to prayer will be in a loud\\n\\t\\t\\t\\tvoice to be heard near and far, but the chants from the\\n\\t\\t\\t\\tSacred Book should be neither so loud as to attract the\\n\\t\\t\\t\\thostile notice of those who do not believe not so low in\\n\\t\\t\\t\\ttone as not to be heard by the whole congregation."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "111",
    "NoteID": "2324",
    "Body": "A first step towards the understanding of Allah's\\n\\t\\t\\t\\tattributes is to clear our mind from superstitions, such\\n\\t\\t\\t\\tas that Allah begot a son, or that He has partners, or\\n\\t\\t\\t\\tthat He is dependent upon other beings to protect Him\\n\\t\\t\\t\\tfrom harm and humiliation. We must realise that He is the\\n\\t\\t\\t\\tOne and Peerless. His greatness and glory are above\\n\\t\\t\\t\\tanything we can conceive: but using our highest spiritual\\n\\t\\t\\t\\tideas, we must declare forth His greatness and glory. The\\n\\t\\t\\t\\tSura began with singing the glory and praises of Allah:\\n\\t\\t\\t\\tit ends on the same note, concluding the argument. The\\n\\t\\t\\t\\tnext Sura takes up the same theme from another point of\\n\\t\\t\\t\\tview, and opens with the same note, \"Praise be to Allah\"."
  }
]
