[
  {
    "SurahNumber": "28",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "For an explanation of the above rendering of the\\n\\t\\t\\t\\tadjective mubin, see note [2] on  12:1 ."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "Lit., \"parties\" or \"sects\" - here undoubtedly referring\\n\\t\\t\\t\\tto the division of people into \"high\" and \"low-born\": a\\n\\t\\t\\t\\tdivision which the Qur'an utterly condemns. The group\\n\\t\\t\\t\\twhich, as mentioned in the next sentence, Pharaoh \"deemed\\n\\t\\t\\t\\tutterly low\" were the Israelites, who had been placed on\\n\\t\\t\\t\\tthe lowest rung of the Egyptian social scale and were\\n\\t\\t\\t\\tdeprived of almost all human rights."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "See note [7]."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "Lit., \"leaders\" or \"exemplars\" (a'immah, sing. imam) - an\\n\\t\\t\\t\\tallusion to the historical fact that the Hebrews were the\\n\\t\\t\\t\\tfirst to accept a monotheistic creed in a clear,\\n\\t\\t\\t\\tunequivocal formulation, and thus became the forerunners\\n\\t\\t\\t\\tof both Christianity and Islam."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "This Haman, who is mentioned several times in the Qur'an\\n\\t\\t\\t\\tas Pharaoh's chief adviser, is not to be confused with\\n\\t\\t\\t\\tthe Persian Haman of the Old Testament (The Book of\\n\\t\\t\\t\\tEsther iii ff.). Most probably, the word \"Haman\" as used\\n\\t\\t\\t\\tin the Qur'an is not a proper name at all but the\\n\\t\\t\\t\\tArabicized echo of the compound designation Ha-Amen given\\n\\t\\t\\t\\tto every high priest of the Egyptian god Amon. Since at\\n\\t\\t\\t\\tthe time in question the cult of Amon was paramount in\\n\\t\\t\\t\\tEgypt, his high priest held a rank second only to that of\\n\\t\\t\\t\\tthe reigning Pharaoh. The assumption that the person\\n\\t\\t\\t\\tspoken of in the Qur'an as Haman was indeed the high\\n\\t\\t\\t\\tpriest of the cult of Amon is strengthened by Pharaoh's\\n\\t\\t\\t\\tdemand (mentioned in verse {38} of this surah as well as\\n\\t\\t\\t\\tin {40:36-37}) that Haman erect for him \"a lofty tower\"\\n\\t\\t\\t\\tfrom which he could \"have a look at [or \"ascend to\"] the\\n\\t\\t\\t\\tgod of Moses\": which may be, among other things, an\\n\\t\\t\\t\\tallusion to the hieratic purpose of the great pyramids of\\n\\t\\t\\t\\tEgypt and to the function of the high priest as their\\n\\t\\t\\t\\tchief architect. (But see also note [37].)"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "6",
    "NoteID": "7",
    "Body": "The Egyptians - obviously remembering the earlier, alien\\n\\t\\t\\t\\tHyksos dynasty that had invaded Egypt and subsequently\\n\\t\\t\\t\\tallied itself with the Hebrews (see surah {12}, note\\n\\t\\t\\t\\t[44]) - feared that the latter might in the future, too,\\n\\t\\t\\t\\tmake common cause with foreign invaders (cf. Exodus i,\\n\\t\\t\\t\\t10): and to protect themselves against this danger, they\\n\\t\\t\\t\\tdecided - as mentioned in several places in the Qur'an as\\n\\t\\t\\t\\twell as in the Bible - to have every male Hebrew child\\n\\t\\t\\t\\tkilled."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "7",
    "NoteID": "8",
    "Body": "Sc., \"and he will be saved\": cf.  20:39 ."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "8",
    "NoteID": "9",
    "Body": "As is evident from the next verse as well as from\\n\\t\\t\\t\\t 66:11 , it was Pharaoh's own wife."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "10",
    "NoteID": "10",
    "Body": "I.e., disclose his true identity in the hope that he\\n\\t\\t\\t\\twould be returned to her."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "10",
    "NoteID": "11",
    "Body": "Lit., \"so that she might be of those who have faith\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "14",
    "NoteID": "12",
    "Body": "This statement, almost entirely identical with  12:22 \\n\\t\\t\\t\\t(where it refers to Joseph), stresses the supreme divine\\n\\t\\t\\t\\tblessing of spiritual consciousness ('ilm in its deepest\\n\\t\\t\\t\\tsignificance) combined with rational thought, as\\n\\t\\t\\t\\texpressed in the concept of hukm, the \"ability to judge\\n\\t\\t\\t\\t[between right and wrong]\". As is evident from  26:20 ,\\n\\t\\t\\t\\tMoses reached this spiritual maturity after the events\\n\\t\\t\\t\\tdescribed in verses {15} ff."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "15",
    "NoteID": "13",
    "Body": "Lit., \"at a time of its people's unawareness\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "15",
    "NoteID": "14",
    "Body": "I.e., of the Hebrews."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "15",
    "NoteID": "15",
    "Body": "Regarding the reference to \"Satan's doing\", see first\\n\\t\\t\\t\\thalf of note [16] on  15:17 . In the present instance,\\n\\t\\t\\t\\tverses {16-17} seem to indicate that it was the\\n\\t\\t\\t\\tIsraelite, and not the Egyptian, who had been in the\\n\\t\\t\\t\\twrong (cf. next note). Apparently, Moses had come to the\\n\\t\\t\\t\\tassistance of the Israelite out of an instinctive sense\\n\\t\\t\\t\\tof racial kinship without regard to the rights and wrongs\\n\\t\\t\\t\\tof the case; but immediately afterwards he realized that\\n\\t\\t\\t\\the had committed a grave sin not only by killing, however\\n\\t\\t\\t\\tinadvertently, an innocent person, but also by basing his\\n\\t\\t\\t\\taction on a mere tribal - or, as we would describe it\\n\\t\\t\\t\\ttoday, racial or national-prejudice. Evidently, this is\\n\\t\\t\\t\\tthe purport of the above Qur'anic segment of the story of\\n\\t\\t\\t\\tMoses. Its moral has been stressed and explained by the\\n\\t\\t\\t\\tProphet on many occasions: cf. his famous saying, \"He is\\n\\t\\t\\t\\tnot of us who proclaims the cause of tribal partisanship\\n\\t\\t\\t\\t('asabiyyah); and he is not of us who fights in the cause\\n\\t\\t\\t\\tof tribal partisanship; and he is not of us who dies in\\n\\t\\t\\t\\tthe cause of tribal partisanship\" (Abu Da'ud, on the\\n\\t\\t\\t\\tauthority of Jubayr ibn Mut'im). When he was asked to\\n\\t\\t\\t\\texplain the meaning of \"tribal partisanship\", the Prophet\\n\\t\\t\\t\\tanswered, \"It means helping thine own people in an unjust\\n\\t\\t\\t\\tcause\" (ibid., on authority of Wathilah ibn al-Aqsa')."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "17",
    "NoteID": "16",
    "Body": "According to Ibn 'Abbas and Muqatil (both of them quoted\\n\\t\\t\\t\\tby Baghawi), \"this is an indication that the Israelite\\n\\t\\t\\t\\twhom Moses had helped was a denier of the truth (kafir)\"\\n\\t\\t\\t\\t- i.e., in the moral sense of this definition. (See also\\n\\t\\t\\t\\tlast sentence of verse {86} of this surah.)"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "18",
    "NoteID": "17",
    "Body": "Sc., \"against another Egyptian\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "18",
    "NoteID": "18",
    "Body": "Lit., \"lost in grievous error\" or \"deviating from what is\\n\\t\\t\\t\\tright\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "19",
    "NoteID": "19",
    "Body": "Sc., \"swayed once again by his feeling of kinship with\\n\\t\\t\\t\\tthe Israelite\", as indicated in the subsequent reference\\n\\t\\t\\t\\tto the Egyptian as \"their [common] enemy\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "22",
    "NoteID": "20",
    "Body": "The inhabitants of Madyan (called Midian in the Bible)\\n\\t\\t\\t\\twere Arabs of the Amorite group. Since they were racially\\n\\t\\t\\t\\tand linguistically closely related to the Hebrews, they\\n\\t\\t\\t\\tcould be counted upon to help Moses in his plight. For\\n\\t\\t\\t\\tthe geographical location of the region of Madyan, see\\n\\t\\t\\t\\tsurah {7}, note [67]."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "23",
    "NoteID": "21",
    "Body": "Lit., \"water\" or \"waters\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "27",
    "NoteID": "22",
    "Body": "Lit., \"one of the righteous.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "29",
    "NoteID": "23",
    "Body": "For an explanation of Moses' wanderings in the desert,\\n\\t\\t\\t\\tsee note [7] on  20:10 ; for that of the allegory of the\\n\\t\\t\\t\\t\"fire\", note [7] on {27:7-8}. - Throughout this work, the\\n\\t\\t\\t\\tnoun at-tur (\"the mountain\") is being rendered as \"Mount\\n\\t\\t\\t\\tSinai\", for it is to this and to no other mountain that\\n\\t\\t\\t\\tthe Qur'an invariably refers in the above term."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "29",
    "NoteID": "24",
    "Body": "Sc., \"as to which way we are to pursue\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "30",
    "NoteID": "25",
    "Body": "As in  19:52  and  20:80 , the reference to the \"right\"\\n\\t\\t\\t\\tside has a connotation of \"blessedness\": see in this\\n\\t\\t\\t\\trespect note [25] on  74:39 . As regards the \"blessed\\n\\t\\t\\t\\tground\", see note [9] on the expression \"twice-hallowed\\n\\t\\t\\t\\tvalley\" in {20: 12}. The \"tree\" referred to in the above\\n\\t\\t\\t\\tverse is obviously identical with the \"burning bush\" of\\n\\t\\t\\t\\tthe Bible (Exodus iii,2)."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "31",
    "NoteID": "26",
    "Body": "The miracle of the staff has, possibly, a symbolic\\n\\t\\t\\t\\tsignificance: see surah {20}, note [14]."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "31",
    "NoteID": "27",
    "Body": "Cf.  27:10  - \"no fear need the message-bearers have in\\n\\t\\t\\t\\tMy Presence\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "32",
    "NoteID": "28",
    "Body": "See note [85] on  7:108 ."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "32",
    "NoteID": "29",
    "Body": "As pointed out by Zamakhshari, the above idiomatic\\n\\t\\t\\t\\tsentence is a metonym recalling a well-known gesture of\\n\\t\\t\\t\\tterror- the involuntary stretching-forth of one's hands\\n\\t\\t\\t\\tor arms when suddenly faced with something terrifying;\\n\\t\\t\\t\\tconversely, the \"holding of one's arm [lit., \"wing\"]\\n\\t\\t\\t\\tclose to oneself\" is expressive of freedom from fear. In\\n\\t\\t\\t\\tthe present instance, the phrase echoes the concluding\\n\\t\\t\\t\\twords of verse {31} \"behold, thou art of those who are\\n\\t\\t\\t\\tsecure [in this world and in the next]\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "32",
    "NoteID": "30",
    "Body": "The \"two signs\" (burhanan) may be understood as Moses'\\n\\t\\t\\t\\tability to remain, by virtue of his certainty of God's\\n\\t\\t\\t\\tomnipresence, forever free of all physical or moral fear,\\n\\t\\t\\t\\tas well as his ability to show that appearance and\\n\\t\\t\\t\\treality are not always identical."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "33",
    "NoteID": "31",
    "Body": "Sc., \"and thus make it impossible for me to accomplish my\\n\\t\\t\\t\\tmission\": for, as regards himself, Moses was henceforth\\n\\t\\t\\t\\tfree of fear."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "34",
    "NoteID": "32",
    "Body": "Cf. {20:27-28] and {26:12-13}, as well as the\\n\\t\\t\\t\\tcorresponding notes."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "35",
    "NoteID": "33",
    "Body": "Lit., \"so that they will not reach you\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "36",
    "NoteID": "34",
    "Body": "See note [12] on  74:24 , which is the earliest Qur'anic\\n\\t\\t\\t\\tinstance of the term sihr in the above connotation."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "37",
    "NoteID": "35",
    "Body": "For an explanation of the above phrase, see surah {6},\\n\\t\\t\\t\\tnote [118]."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "38",
    "NoteID": "36",
    "Body": "In view of the fact that the ancient Egyptians worshipped\\n\\t\\t\\t\\tmany gods, this observation is not to be taken literally;\\n\\t\\t\\t\\tbut since each of the Pharaohs was regarded as an\\n\\t\\t\\t\\tincarnation of the divine principle as such, he claimed -\\n\\t\\t\\t\\tand received - his people's adoration as their \"Lord\\n\\t\\t\\t\\tAll-Highest\" (cf.  79:24 ), combining within himself, as\\n\\t\\t\\t\\tit were, all the qualities attributable to gods."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "38",
    "NoteID": "37",
    "Body": "Or: \"ascend to the god of Moses\". Whichever of the two\\n\\t\\t\\t\\tmeanings is given to the verb ittali'u, Pharaoh's demand\\n\\t\\t\\t\\tfor a \"lofty tower\" is not only an allusion to the\\n\\t\\t\\t\\tbuilding of one of the great pyramids (see note [6]\\n\\t\\t\\t\\tabove), but also a derisory, contemptuous reference to\\n\\t\\t\\t\\tMoses' concept of God as an all-embracing Power,\\n\\t\\t\\t\\tinconceivably high above all that exists."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "39",
    "NoteID": "38",
    "Body": "Lit., \"without [any] truth\" or \"justification\" (bi-ghayr\\n\\t\\t\\t\\tal-haqq)."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "39",
    "NoteID": "39",
    "Body": "Lit., \"and they thought that they would not be brought\\n\\t\\t\\t\\tback to Us\". There is no doubt that the ancient Egyptians\\n\\t\\t\\t\\tdid believe in a life after death, and that this belief\\n\\t\\t\\t\\tincluded the concept of a divine judgment as well. Since,\\n\\t\\t\\t\\thowever, the particular Pharaoh whom Moses confronted is\\n\\t\\t\\t\\tsaid to have behaved with an arrogance opposed to all\\n\\t\\t\\t\\tgood sense, the Qur'an - by implication - likens his\\n\\t\\t\\t\\tattitude to that of a person who does not believe in\\n\\t\\t\\t\\tresurrection and in man's ultimate responsibility before\\n\\t\\t\\t\\tGod: hence my rendering of the conjunctive particle wa at\\n\\t\\t\\t\\tthe beginning of the above clause as \"just as if\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "41",
    "NoteID": "40",
    "Body": "Lit., \"archetypes (a'immah) inviting to the fire\". This\\n\\t\\t\\t\\tis the pivotal sentence of the above fragment of the\\n\\t\\t\\t\\tstory of Moses. Just as verses {15-16} are meant to draw\\n\\t\\t\\t\\tour attention to the sin of tribal or racial prejudice\\n\\t\\t\\t\\t(see note [15]), the present reference to Pharaoh as an\\n\\t\\t\\t\\t\"archetype [of evil]\" points to the fact that false pride\\n\\t\\t\\t\\t(takabbur) and arrogance (istikbar) are truly \"satanic\"\\n\\t\\t\\t\\tattitudes of mind, repeatedly exemplified in the Qur'an\\n\\t\\t\\t\\tby Iblis's symbolic \"revolt\" against God (for the meaning\\n\\t\\t\\t\\tof which see note [26] on  2:34  and note [31] on\\n\\t\\t\\t\\t 15:41 ). Inasmuch as they are intrinsically evil these\\n\\t\\t\\t\\t\"satanic\" impulses lead to evil actions and,\\n\\t\\t\\t\\tconsequently, to a weakening or even a total destruction\\n\\t\\t\\t\\tof man's spiritual potential: which, in its turn, is\\n\\t\\t\\t\\tbound to cause suffering in the hereafter."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "42",
    "NoteID": "41",
    "Body": "I.e., in the pejorative connotation universally given to\\n\\t\\t\\t\\tthe adjective \"pharaonic\". It is to be noted that the\\n\\t\\t\\t\\tterm la'nah, here rendered as \"curse\", primarily denotes\\n\\t\\t\\t\\t\"estrangement\" (ib'ad), i.e., from all that is good and,\\n\\t\\t\\t\\thence, really desirable."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "42",
    "NoteID": "42",
    "Body": "I.e., among those who by their own actions will have\\n\\t\\t\\t\\tremoved themselves from God's grace: a meaning given to\\n\\t\\t\\t\\tthe term maqbuh, in this context, by most of the\\n\\t\\t\\t\\tclassical commentators and philologists (cf. Lisan\\n\\t\\t\\t\\tal-'Arab, Taj al-'Arus, etc.)."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "43",
    "NoteID": "43",
    "Body": "By virtue of its being the first instance of a\\n\\t\\t\\t\\tdivinely-inspired Law, the Torah inaugurated a new phase\\n\\t\\t\\t\\tin mankind's religious history (cf. the reference to the\\n\\t\\t\\t\\tchildren of Israel as \"forerunners in faith\" in verse {5}\\n\\t\\t\\t\\tof this surah)."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "44",
    "NoteID": "44",
    "Body": "Implying that the story of Moses as narrated in the\\n\\t\\t\\t\\tQur'an could not have come to Muhammad's knowledge\\n\\t\\t\\t\\totherwise than through revelation: consequently, the\\n\\t\\t\\t\\tQur'an as such must obviously be a result of divine\\n\\t\\t\\t\\trevelation. - The term al-amr, rendered above as \"the\\n\\t\\t\\t\\tLaw\", is the Arabic equivalent of the Hebrew word torah\\n\\t\\t\\t\\t(\"law\" or \"precept\"), the commonly-accepted title of the\\n\\t\\t\\t\\trevelation granted to Moses."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "45",
    "NoteID": "45",
    "Body": "I.e., \"thou art not the first of Our apostles, O\\n\\t\\t\\t\\tMuhammad: We have sent thee to the people of thy time\\n\\t\\t\\t\\tjust as We sent Shu'ayb to the people of Madyan\"\\n\\t\\t\\t\\t(Ad-Dahhak, as quoted by Razi)."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "46",
    "NoteID": "46",
    "Body": "According to some of the classical commentators, this\\n\\t\\t\\t\\tsecond reference to \"the slope of Mount Sinai\" contains\\n\\t\\t\\t\\tan allusion to the divine assurance mentioned in  7:156 :\\n\\t\\t\\t\\t\"My grace overspreads everything ...\" (Tabari, Razi).\\n\\t\\t\\t\\tThis interpretation is most plausible in view of the\\n\\t\\t\\t\\tsubsequent reference to Muhammad's mission as \"an act of\\n\\t\\t\\t\\tthy Sustainer's grace (rahmah)\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "48",
    "NoteID": "47",
    "Body": "As the Qur'an frequently points out, the basic ethical\\n\\t\\t\\t\\ttruths enunciated in it are the same as those of earlier\\n\\t\\t\\t\\trevelations. It is this very statement which induced the\\n\\t\\t\\t\\topponents of Muhammad - in his own time as well as in\\n\\t\\t\\t\\tlater times - to question the authenticity of the Qur'an:\\n\\t\\t\\t\\t\"If it had really been revealed by God,\" they argue,\\n\\t\\t\\t\\t\"would so many of its propositions, especially its social\\n\\t\\t\\t\\tlaws, differ so radically from the laws promulgated in\\n\\t\\t\\t\\tthat earlier divine writ, the Torah?\" By advancing this\\n\\t\\t\\t\\targument (and quite apart from the question of whether\\n\\t\\t\\t\\tthe text of the Bible as we know it today has or has not\\n\\t\\t\\t\\tbeen corrupted in the course of time), the opponents of\\n\\t\\t\\t\\tMuhammad's message deliberately overlook the fact,\\n\\t\\t\\t\\trepeatedly stressed in the Qur'an, that the earlier\\n\\t\\t\\t\\tsystems of law were conditioned by the spiritual level of\\n\\t\\t\\t\\ta particular people and the exigencies of a particular\\n\\t\\t\\t\\tchapter of human history, and therefore had to be\\n\\t\\t\\t\\tsuperseded by new laws at a higher stage of human\\n\\t\\t\\t\\tdevelopment (see in this connection the second paragraph\\n\\t\\t\\t\\tof  5:48  and the corresponding note [66]). However, as\\n\\t\\t\\t\\tis evident from the immediate sequence - and especially\\n\\t\\t\\t\\tfrom the last sentence of this verse - the above specious\\n\\t\\t\\t\\targument is not meant to uphold the authenticity of the\\n\\t\\t\\t\\tBible as against that of the Qur'an, but, rather, aims at\\n\\t\\t\\t\\tdiscrediting both - and through them, the basic religious\\n\\t\\t\\t\\tpriciple against which the irreligious mind always\\n\\t\\t\\t\\trevolts: namely, the idea of divine revelation and of\\n\\t\\t\\t\\tman's absolute dependence on and responsibilty to God,\\n\\t\\t\\t\\tthe Ultimate Cause of all that exists."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "48",
    "NoteID": "48",
    "Body": "A contemptuous allusion, on the one hand, to\\n\\t\\t\\t\\tOld-Testament predictions of the coming of the Prophet\\n\\t\\t\\t\\tMuhammad 9cf. surah {2}, note [33]), and, on the other,\\n\\t\\t\\t\\tto the oft-repeated Qur'anic statement that this divine\\n\\t\\t\\t\\twrit had been revealed to \"confirm the truth of earlier\\n\\t\\t\\t\\trevelations\". As regards my rendering of the term sihr\\n\\t\\t\\t\\t(lit., \"magic\" or \"sorcery\") as \"delusion\" - and\\n\\t\\t\\t\\toccasionally as \"spellbinding eloquence\" - see note [12]\\n\\t\\t\\t\\ton  74:24 ."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "49",
    "NoteID": "49",
    "Body": "I.e., the Torah and the Qur'an. The Gospel is not\\n\\t\\t\\t\\tmentioned in this context because, as Jesus himself had\\n\\t\\t\\t\\tstressed, his message was based on the Law of Moses, and\\n\\t\\t\\t\\twas not meant to displace the latter."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "50",
    "NoteID": "50",
    "Body": "Lit., \"if they do not respond to thee\", implying that\\n\\t\\t\\t\\tthey are unable to accept the above challenge."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "51",
    "NoteID": "51",
    "Body": "Lit., \"We have caused this word to reach them gradually\":\\n\\t\\t\\t\\tthis meaning is implied in the verbal form wassalna,\\n\\t\\t\\t\\twhich - like the grammatically identical form nazzalna -\\n\\t\\t\\t\\tpoints to the gradual, step-by-step revelation of the\\n\\t\\t\\t\\tQur'an during the twenty-three years of Muhammad's\\n\\t\\t\\t\\tprophetic ministry."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "52",
    "NoteID": "52",
    "Body": "This is both a statement of historical fact - alluding to\\n\\t\\t\\t\\tconversions of Jews and Christians in Muhammad's lifetime\\n\\t\\t\\t\\t- and a prophecy. It must, however, be understood that,\\n\\t\\t\\t\\tin the above context, God's \"vouchsafing\" revelation\\n\\t\\t\\t\\timplies a conscious, sincere acceptance of its teachings\\n\\t\\t\\t\\tby those to whom it has been conveyed: for it is this\\n\\t\\t\\t\\tsincerity that has enabled them - or will enable them-to\\n\\t\\t\\t\\trealize that the Qur'an preaches the same ethical truths\\n\\t\\t\\t\\tas those forthcoming from earlier revelations. (Cf.\\n\\t\\t\\t\\t{26:196-197} and the corresponding notes [83-85].)"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "54",
    "NoteID": "53",
    "Body": "See note [44] on the identical phrase in  13:22 . In the\\n\\t\\t\\t\\tpresent context, the reference to \"patience in adversity\"\\n\\t\\t\\t\\tand \"repelling evil with good\" evidently relates to the\\n\\t\\t\\t\\tloss of erstwhile communal links, social ostracism, and\\n\\t\\t\\t\\tall manner of physical or moral persecution which is so\\n\\t\\t\\t\\toften the lot of persons who accept religious tenets\\n\\t\\t\\t\\tdifferent from those of their own community."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "55",
    "NoteID": "54",
    "Body": "This obviously refers to attempts, based on prejudice, at\\n\\t\\t\\t\\tderiding the spiritual reorientation of the person\\n\\t\\t\\t\\tconcerned."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "56",
    "NoteID": "55",
    "Body": "Or: \"God guides whomever He wills\" - either of these two\\n\\t\\t\\t\\trenderings being syntactically correct. According to\\n\\t\\t\\t\\tseveral extremely well-authenticated Traditions, the\\n\\t\\t\\t\\tabove verse relates to the Prophet's inability to induce\\n\\t\\t\\t\\this dying uncle Abu Talib, whom he loved dearly and who\\n\\t\\t\\t\\thad loved and protected him throughout his life, to\\n\\t\\t\\t\\trenounce the pagan beliefs of his ancestors and to\\n\\t\\t\\t\\tprofess faith in God's oneness. Influenced by Abu Jahl\\n\\t\\t\\t\\tand other Meccan chieftains, Abu Talib died professing,\\n\\t\\t\\t\\tin his own words, \"the creed of 'Abd al-Muttalib\"\\n\\t\\t\\t\\t(Bukhari) or, according to another version (quoted by\\n\\t\\t\\t\\tTabari), \"the creed of my ancestors (al-ashyakh)\".\\n\\t\\t\\t\\tHowever, the Qur'anic statement \"thou canst not guide\\n\\t\\t\\t\\taright everyone whom thou lovest\" has undoubtedly a\\n\\t\\t\\t\\ttimeless import as well: it stresses the inadequacy of\\n\\t\\t\\t\\tall human endeavours to \"convert\" any other person,\\n\\t\\t\\t\\thowever loving and loved, to one's own beliefs, or to\\n\\t\\t\\t\\tprevent him from falling into what one regards as error,\\n\\t\\t\\t\\tunless that person wills to be so guided."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "56",
    "NoteID": "56",
    "Body": "The above rendering of the expression al-muhtadin\\n\\t\\t\\t\\tconforms to the interpretations offered in this context\\n\\t\\t\\t\\tby many classical commentators - e.g., \"those who accept\\n\\t\\t\\t\\tguidance\" (Zamakhshari), \"everyone who in time would find\\n\\t\\t\\t\\tthe right way\" (Razi), \"those who are prepared\\n\\t\\t\\t\\t(musta'iddin) for it\" (Baydawi), \"all who deserve\\n\\t\\t\\t\\tguidance\" (Ibn Kathir), and so forth. Thus, God's\\n\\t\\t\\t\\tguidance is but the final act of His grace with which He\\n\\t\\t\\t\\trewards all who desire to be guided. For a further\\n\\t\\t\\t\\tconsideration of this problem, the reader is referred to\\n\\t\\t\\t\\tZamakhshari's illuminating remarks quoted in note [4] on\\n\\t\\t\\t\\t 14:4 .her with thee, we would be snatched away from our\\n\\t\\t\\t\\tland\" (or \"our soil\")."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "57",
    "NoteID": "57",
    "Body": "Lit., \"If we were to follow the guidance together with\\n\\t\\t\\t\\tthee, we would be snatched away from our land\" (or \"our\\n\\t\\t\\t\\tsoil\"). This passage has obviously a twofold connotation.\\n\\t\\t\\t\\tOn the historical plane, it echoes an objection voiced by\\n\\t\\t\\t\\tmany pagan Meccans to Muhammad's preaching: \"If we were\\n\\t\\t\\t\\tto accept thy call, most of the other tribes would regard\\n\\t\\t\\t\\tthis as a betrayal of our common ancestral beliefs, and\\n\\t\\t\\t\\twould drive us away from our land.\" In a more general,\\n\\t\\t\\t\\ttimeless sense it reflects the hesitation of so many\\n\\t\\t\\t\\tpeople - of whatever period, environment or religious\\n\\t\\t\\t\\tpersuasion - who, while realizing the truth of a new\\n\\t\\t\\t\\tspiritual call, are yet fearful of acknowledging it as\\n\\t\\t\\t\\ttrue lest this acknowledgment cause a total breach\\n\\t\\t\\t\\tbetween them and their community and thus, as it were,\\n\\t\\t\\t\\tcut the ground from under their feet."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "57",
    "NoteID": "58",
    "Body": "Like the preceding expression of fear, this Qur'anic\\n\\t\\t\\t\\tanswer, too, can be understood in two senses. In the\\n\\t\\t\\t\\tlimited, historical sense it is an allusion to Abraham's\\n\\t\\t\\t\\tprayer that the land around the Ka'bah be made secure for\\n\\t\\t\\t\\tall times and its natural barrenness be compensated by\\n\\t\\t\\t\\tfruitful help from outside (cf. {14:35-41}; also\\n\\t\\t\\t\\t 2:126 ), and to God's acceptance of this prayer: thus,\\n\\t\\t\\t\\tthe Prophet's Meccan contemporaries are reminded that\\n\\t\\t\\t\\tthey need not fear to be dispossessed of this holy land\\n\\t\\t\\t\\tso long as they remain righteous and trust in God. In its\\n\\t\\t\\t\\tpurely spiritual connotation, on the other hand, the\\n\\t\\t\\t\\t\"sanctuary secure\" is God's promise - referred to in\\n\\t\\t\\t\\tverse {61} below - that all who have faith in Him and are\\n\\t\\t\\t\\tconscious of their responsibility to Him shall be graced\\n\\t\\t\\t\\twith a sense of inner peace in this world and with\\n\\t\\t\\t\\tenduring bliss in the life to come; and since they are\\n\\t\\t\\t\\tthus to be rewarded with the \"fruits\" of all their good\\n\\t\\t\\t\\tdeeds, \"no fear need they have, and neither shall they\\n\\t\\t\\t\\tgrieve\" (cf.  2:62 ,  3:170 ,  5:69 ,  6:48 ,  7:35 ,\\n\\t\\t\\t\\t 10:62 ,  46:13 ). See also note [59] on  29:67 ."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "58",
    "NoteID": "59",
    "Body": "Lit., \"We are indeed (kunna) the inheritors\". For an\\n\\t\\t\\t\\texplanation of my rendering of this phrase, see note [22]\\n\\t\\t\\t\\ton  15:23 . The above passage stresses the insignificance\\n\\t\\t\\t\\tand brittleness of all worldly \"advantages\" as compared\\n\\t\\t\\t\\twith the imperishable good of divine guidance."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "59",
    "NoteID": "60",
    "Body": "Sc., \"and thus make them aware of the meaning of right\\n\\t\\t\\t\\tand wrong\": cf. {6:130-132} and the corresponding notes\\n\\t\\t\\t\\t[116] and [117]."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "59",
    "NoteID": "61",
    "Body": "Cf. in this connection  11:117  and note [149]. All the\\n\\t\\t\\t\\tthree passages referred to in this as well as the\\n\\t\\t\\t\\tpreceding note (i.e., {6:130-132},  11:117  and  28:59 )\\n\\t\\t\\t\\tare interdependent and must, therefore, be read side by\\n\\t\\t\\t\\tside. The present passage connect with verse {58} above\\n\\t\\t\\t\\tand its reference to \"wanton wealth and ease of life\",\\n\\t\\t\\t\\tfor the sake of which people so often wrong one another."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "61",
    "NoteID": "62",
    "Body": "See second half of note [58]."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "61",
    "NoteID": "63",
    "Body": "Sc., \"for having misused Our gifts and attributed them to\\n\\t\\t\\t\\tpowers other than Us\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "62",
    "NoteID": "64",
    "Body": "Lit., \"those partners of Mine whom you supposed [to\\n\\t\\t\\t\\texist]\": see notes [15] and [16] on {6:22-23}."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "63",
    "NoteID": "65",
    "Body": "I.e., in the very fact of God's calling them to account\\n\\t\\t\\t\\t(cf.  27:82  and the corresponding note [73]). As the\\n\\t\\t\\t\\tsequence shows, the persons thus addressed are the\\n\\t\\t\\t\\t\"leaders of thought\" supposed to have set the community's\\n\\t\\t\\t\\tfaulty standards of social behaviour and moral valuation;\\n\\t\\t\\t\\tand since they are primarily responsible for the wrong\\n\\t\\t\\t\\tdirection which their followers have taken, they will be\\n\\t\\t\\t\\tthe first to suffer in the life to come."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "63",
    "NoteID": "66",
    "Body": "I.e., \"we did not lead them astray out of malice, but\\n\\t\\t\\t\\tsimply because we ourselves had been led astray by our\\n\\t\\t\\t\\tpredecessors\". This \"answer\" is, of course, evasive, but\\n\\t\\t\\t\\tit is quoted here to show that man's attachment to false\\n\\t\\t\\t\\t-but, nevertheless, almost deified - values and concepts\\n\\t\\t\\t\\tbased on stark materialism is, more often than not, a\\n\\t\\t\\t\\tmatter of \"social continuity\": in other words, the\\n\\t\\t\\t\\tvalidity of those materialistic pseudo-values is taken\\n\\t\\t\\t\\tfor granted simply because they are time-honoured, with\\n\\t\\t\\t\\tevery generation blindly subscribing to the views held by\\n\\t\\t\\t\\ttheir forebears. In its deepest sense, this passage - as\\n\\t\\t\\t\\tso many similar ones throughout the Qur'an - points to\\n\\t\\t\\t\\tthe moral inadmissibility of accepting an ethical or\\n\\t\\t\\t\\tintellectual proposition as true on no other grounds than\\n\\t\\t\\t\\tthat it was held to be true by earlier generations."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "63",
    "NoteID": "67",
    "Body": "In other words, they were but wont to worship their own\\n\\t\\t\\t\\tpassions and desires projected onto extraneous beings.\\n\\t\\t\\t\\tSee in this connection  10:28  and the corresponding\\n\\t\\t\\t\\tnotes, especially note [46] also  34:41  and note [52]."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "64",
    "NoteID": "68",
    "Body": "Lit., \"those [God-]partners of yours\": see note [64]\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "64",
    "NoteID": "69",
    "Body": "For this rendering of the phrase law kanu yahtadun, see\\n\\t\\t\\t\\tnote [56] above."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "65",
    "NoteID": "70",
    "Body": "This connects with the first sentence of verse {59},\\n\\t\\t\\t\\twhich has been explained in the corresponding note [60].\\n\\t\\t\\t\\tThe present verse clearly implies that those sinners had\\n\\t\\t\\t\\tnot responded to the guidance offered them by God's\\n\\t\\t\\t\\tapostles. As in many other instances in the Qur'an, God's\\n\\t\\t\\t\\t\"question\" is but meant to stress a moral failure which\\n\\t\\t\\t\\tby now has become obvious to man's self-accusing\\n\\t\\t\\t\\tconscience."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "66",
    "NoteID": "71",
    "Body": "Lit., \"will on that Day have become obscured to them\".\\n\\t\\t\\t\\tThe operative noun anba', which literally denotes\\n\\t\\t\\t\\t\"tidings\", has here the compound meaning of \"arguments\\n\\t\\t\\t\\tand excuses\" (Tabari)."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "66",
    "NoteID": "72",
    "Body": "I.e., they will all be equally confused. For the above\\n\\t\\t\\t\\trendering of la yatasa'alun (lit., \"they will not [be\\n\\t\\t\\t\\table to] ask one another\"), see the explanations of this\\n\\t\\t\\t\\tphrase advanced by Baghawi, Zamakhshari and Baydawi."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "67",
    "NoteID": "73",
    "Body": "I.e., during his life in this world. For an explanation\\n\\t\\t\\t\\tof this stress on repentance-which flows from one's\\n\\t\\t\\t\\trealization of moral failure - see surah {24}, note [41]."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "68",
    "NoteID": "74",
    "Body": "Some of the classical commentators incline to interpret\\n\\t\\t\\t\\tthe ma in the phrase ma kana lahum al-khirah as a\\n\\t\\t\\t\\tparticle of negation and the noun khirah as \"choice\" or\\n\\t\\t\\t\\t\"freedom of choice\", thus giving to this phrase the\\n\\t\\t\\t\\tmeaning of \"He chooses, [but] they [i.e., human beings]\\n\\t\\t\\t\\thave no freedom of choice\". To my mind, however, this\\n\\t\\t\\t\\tinterpretation conflicts not only with the immediately\\n\\t\\t\\t\\tpreceding passages but with the tenor of the Qur'an as a\\n\\t\\t\\t\\twhole, which insists throughout on man's responsibility\\n\\t\\t\\t\\tfor (and, hence, on relative freedom in) choosing between\\n\\t\\t\\t\\tright and wrong - and this side by side with its stress\\n\\t\\t\\t\\ton God's unlimited power to determine the factual course\\n\\t\\t\\t\\tof events. Hence, I prefer to base my rendering on the\\n\\t\\t\\t\\tinterpretation advanced and convincingly argued by\\n\\t\\t\\t\\tTabari, who regards the crucial particle ma not as a\\n\\t\\t\\t\\tnegation but as a relative pronoun synonymous with\\n\\t\\t\\t\\talladhi (\"that which\" or \"whatever\"), and understands the\\n\\t\\t\\t\\tnoun khirah in its primary significance of \"that which is\\n\\t\\t\\t\\tchosen\" or \"preferred\", i.e., because it is considered to\\n\\t\\t\\t\\tbe the best: in another word, as a synonym of khayr.\\n\\t\\t\\t\\tZamakhshari refers to this interpretation with evident\\n\\t\\t\\t\\tapproval (without, however, mentioning Tabari\\n\\t\\t\\t\\tspecifically), and enlarges upon it thus: \"God chooses\\n\\t\\t\\t\\tfor mankind whatever is best (ma hawa khayr) and most\\n\\t\\t\\t\\tbeneficial (aslah) for them, for He knows better than\\n\\t\\t\\t\\tthey themselves do what is good for them.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "70",
    "NoteID": "75",
    "Body": "Or: \"in this first [i.e., present life] as well as in the\\n\\t\\t\\t\\tlife to come\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "71",
    "NoteID": "76",
    "Body": "Lit., \"who [i.e., \"where\"] is a deity . . .\". etc..\\n\\t\\t\\t\\tobviously implying that no such \"deity\" exists."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "72",
    "NoteID": "77",
    "Body": "I.e., \"Will you not recognize the miracle of planned and\\n\\t\\t\\t\\tpurposeful creation?\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "74",
    "NoteID": "78",
    "Body": "I.e., the Day of Resurrection - thus reverting to the\\n\\t\\t\\t\\ttheme enunciated in verses {62-66} above."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "74",
    "NoteID": "79",
    "Body": "This repetition of God's \"question\", already mentioned in\\n\\t\\t\\t\\tverse {62} above, is meant to stress the utter inability\\n\\t\\t\\t\\tof the sinners concerned to justify their erstwhile\\n\\t\\t\\t\\tattitude rationally; hence my interpolation at the\\n\\t\\t\\t\\tbeginning of the next verse."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "75",
    "NoteID": "80",
    "Body": "I.e., the prophets who had appeared at various stages of\\n\\t\\t\\t\\tman's history, and who will now bear witness that they\\n\\t\\t\\t\\thad duly conveyed God's message to the people for whom it\\n\\t\\t\\t\\twas meant."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "75",
    "NoteID": "81",
    "Body": "Lit., \"Produce your evidence\" - i.e., for the possibility\\n\\t\\t\\t\\tof anyone or anything having a share in God's divinity."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "75",
    "NoteID": "82",
    "Body": "I.e., that He is the Ultimate Reality, and that whatever\\n\\t\\t\\t\\tis or could be is an outcome of His will alone."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "75",
    "NoteID": "83",
    "Body": "For the meaning of the phrase ma kanu yaftarun (lit.,\\n\\t\\t\\t\\t\"all that they were wont to invent\" - rendered by me here\\n\\t\\t\\t\\tas well as in  6:24 ,  7:53 ,  10:30 ,  11:21  and\\n\\t\\t\\t\\t 16:87  as \"all their false imagery\"), see surah {11},\\n\\t\\t\\t\\tnote [42]; also note [15] on  6:22 . A specific instance\\n\\t\\t\\t\\tof such \"false imagery\" - the futility of man's relying\\n\\t\\t\\t\\ton his own wealth and worldly power - is illustrated in\\n\\t\\t\\t\\tthe immediately following legend of Qarun (see next\\n\\t\\t\\t\\tnote)."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "76",
    "NoteID": "84",
    "Body": "The structure of the above sentence is meant to show that\\n\\t\\t\\t\\teven a person who had been a follower of one of the\\n\\t\\t\\t\\tgreatest of God's apostles was not above the possibility\\n\\t\\t\\t\\tof sinning under the influence of false pride and\\n\\t\\t\\t\\tself-exaltation - a particular example of the \"false\\n\\t\\t\\t\\timagery\" referred to in the preceding passage. The\\n\\t\\t\\t\\tconventional \"identification\" of Qarun with the Korah of\\n\\t\\t\\t\\tthe Old Testament (Numbers xvi) is neither relevant nor\\n\\t\\t\\t\\twarranted by the Qur'anic text, the more so as the\\n\\t\\t\\t\\tpurport of this legend is a moral lesson and not a\\n\\t\\t\\t\\thistorical narrative.  this, by the way, explains also\\n\\t\\t\\t\\tthe juxtaposition, elsewhere in the Qur'an ( 29:39  and\\n\\t\\t\\t\\t 40:24 ), of Qarun with Pharoah, the arch-sinner."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "76",
    "NoteID": "85",
    "Body": "The term 'usbah denotes a company of ten or more (up to\\n\\t\\t\\t\\tforty) persons; since it is used here metonymically,\\n\\t\\t\\t\\tpointing to the great weight involved, it is best\\n\\t\\t\\t\\trendered as above. - The noun mafatih is a plural of both\\n\\t\\t\\t\\tmiftah or miftah (\"key\") and muftah (\"that which is under\\n\\t\\t\\t\\tlock and key\", i.e., a \"hoard of wealth\" or \"treasure\\n\\t\\t\\t\\tchest\"), which latter meaning is obviously the one\\n\\t\\t\\t\\tintended in the present context."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "77",
    "NoteID": "86",
    "Body": "I.e., by spending in charity and on good causes."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "77",
    "NoteID": "87",
    "Body": "Lit., \"and do not forget . . .\", etc.: a call to\\n\\t\\t\\t\\tgenerosity and, at the same time, to moderation (cf.\\n\\t\\t\\t\\t 2:143 -\"We have willed you to be a community of the\\n\\t\\t\\t\\tmiddle way\")."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "78",
    "NoteID": "88",
    "Body": "I.e., \"as a result of my own experience, shrewdness and\\n\\t\\t\\t\\tability\" (cf.  39:49  and the corresponding note [55])."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "78",
    "NoteID": "89",
    "Body": "Obviously implying that \"such as are lost in sin\"\\n\\t\\t\\t\\t(al-mujrimun) are, as a rule, blind to their own failings\\n\\t\\t\\t\\tand, therefore, not responsive to admonition."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "80",
    "NoteID": "90",
    "Body": "Lit., \"God's reward\", se., \"of spiritual merit\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "81",
    "NoteID": "91",
    "Body": "Lit., \"he had no host whatever to succour him ...\", etc.\\n\\t\\t\\t\\tQarun's being \"swallowed by the earth\" may possibly be a\\n\\t\\t\\t\\tmetaphor of a catastrophic, unforeseen loss - from\\n\\t\\t\\t\\twhatever cause - of  all his worldy goods and, thus, of\\n\\t\\t\\t\\terstwhile grandeur."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "83",
    "NoteID": "92",
    "Body": "This last clause makes it clear that, in order to have\\n\\t\\t\\t\\tspiritual value, man's \"not seeking\" worldly grandeur or\\n\\t\\t\\t\\tself-indulgence in things depraved must be an outcome,\\n\\t\\t\\t\\tnot of indifference or of a lack of opportunity, but\\n\\t\\t\\t\\tsolely of a conscious moral choice."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "84",
    "NoteID": "93",
    "Body": "See note [79] on the identical phrase in  27:89 ."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "84",
    "NoteID": "94",
    "Body": "Cf.  6:160  and the corresponding note [162]."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "85",
    "NoteID": "95",
    "Body": "According to Mujahid (as quoted by Tabari), the phrase\\n\\t\\t\\t\\tfarada 'alayka is almost synonymous with a'taka, \"He gave\\n\\t\\t\\t\\t[it] to thee\". This, however, elucidates only one part of\\n\\t\\t\\t\\tthe above complex expression, which, I believe, has here\\n\\t\\t\\t\\ta meaning similar to that of faradnaha (\"We laid it down\\n\\t\\t\\t\\tin plain terms\") occurring én the first verse of surah\\n\\t\\t\\t\\t{24} (An-Nur) and explained in the corresponding note\\n\\t\\t\\t\\t[1]. In the present context, the particle 'alayka (\"upon\\n\\t\\t\\t\\tthee\"), with its pronominal suffix, gives to the above\\n\\t\\t\\t\\tclause the additional meaning of a moral obligation on\\n\\t\\t\\t\\tthe part of the recipient of the Qur'anic message to\\n\\t\\t\\t\\tconform his or her way of life to its teachings; hence my\\n\\t\\t\\t\\tcompound rendering of the phrase."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "85",
    "NoteID": "96",
    "Body": "The term ma'ad denotes, literally, \"a place [or \"a\\n\\t\\t\\t\\tstate\"] to which one returns\", and, tropically, one's\\n\\t\\t\\t\\t\"ultimate destination\" or \"ultimate condition\", in the\\n\\t\\t\\t\\tpresent context, it is obviously synonymous with \"life in\\n\\t\\t\\t\\tthe hereafter\". This is how most of the classical\\n\\t\\t\\t\\tauthorities interpret the above phrase. But on the vague\\n\\t\\t\\t\\tassumption that this passage is addressed exclusively to\\n\\t\\t\\t\\tthe Prophet, some commentators incline to the view that\\n\\t\\t\\t\\tthe noun has here a specific, purely physical\\n\\t\\t\\t\\tconnotation-\"a place of return\"-allegedly referring to\\n\\t\\t\\t\\tGod's promise to His Apostle (given during or after the\\n\\t\\t\\t\\tlatter's exodus from Mecca to Medina) that one day he\\n\\t\\t\\t\\twould return victoriously to the city of his birth. To my\\n\\t\\t\\t\\tmind, however, the passage has a much deeper meaning,\\n\\t\\t\\t\\tunconnected with any place or specific point in history:\\n\\t\\t\\t\\tit is addressed to every believer, and promises not only\\n\\t\\t\\t\\ta continuation of life after bodily death but also a\\n\\t\\t\\t\\tspiritual rebirth, in this world, to anyone who opens his\\n\\t\\t\\t\\theart to the message of the Qur'an and comes to regard it\\n\\t\\t\\t\\tas binding on himself."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "85",
    "NoteID": "97",
    "Body": "Lit., \"as to who comes with guidance\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "86",
    "NoteID": "98",
    "Body": "Lit., \"hope\" or \"expect\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "87",
    "NoteID": "99",
    "Body": "Lit., \"and\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "88",
    "NoteID": "100",
    "Body": "See {55:26-27} and the corresponding note [11]."
  }
]
