[
  {
    "SurahNumber": "105",
    "AyahNumber": "1",
    "NoteID": "6270",
    "Body": "Seest thou not?-i.e. with thy mental vision. The incident\\n\\t\\t\\t\\thappened in the very year of the holy Prophet's birth,\\n\\t\\t\\t\\tbarely two months before it."
  },
  {
    "SurahNumber": "105",
    "AyahNumber": "1",
    "NoteID": "6271",
    "Body": "These were the troops of Abraha the Abyssinian, who\\n\\t\\t\\t\\tinvaded Makkah with a large army, in which were some\\n\\t\\t\\t\\telephants. See Introduction to this Sura."
  },
  {
    "SurahNumber": "105",
    "AyahNumber": "3",
    "NoteID": "6272",
    "Body": "The miracle consisted in the birds coming in large\\n\\t\\t\\t\\tflights and flinging stones at the army which destroyed\\n\\t\\t\\t\\tthe whole of Abraha's army."
  },
  {
    "SurahNumber": "105",
    "AyahNumber": "4",
    "NoteID": "6273",
    "Body": "Sijjil: see n. 1579 to xi. 82. The word also occurs at\\n\\t\\t\\t\\txv. 74. Stones of baked clay, or hard as baked clay, are\\n\\t\\t\\t\\tpart of the miracle in the story."
  },
  {
    "SurahNumber": "105",
    "AyahNumber": "5",
    "NoteID": "6274",
    "Body": "A field, from which all the corn has been eaten up and\\n\\t\\t\\t\\tonly straw with stalks or stubble is left, is a field\\n\\t\\t\\t\\tdead and useless. And such was the army of Abraha,-dead\\n\\t\\t\\t\\tand useless. Another possible rendering would be: \"like\\n\\t\\t\\t\\teaten straw and stubble found in the dung of animals\".\\n\\t\\t\\t\\tThe meaning would be the same, but much more emphatic."
  },
  {
    "SurahNumber": "105",
    "AyahNumber": "5",
    "NoteID": "6275",
    "Body": "The lesson to be drawn is twofold. For the Pagan Quraish\\n\\t\\t\\t\\tof Makkah it was: Allah will protect His own; if you\\n\\t\\t\\t\\tpersecute the holy Prophet, he is greater than the mere\\n\\t\\t\\t\\tbuilding of the Ka'ba: will not Allah protect him? For\\n\\t\\t\\t\\tmen in all ages it is: 'a man intoxicated with power can\\n\\t\\t\\t\\tprepare armies and material resources against Allah's\\n\\t\\t\\t\\tholy Plan; but such a man's plan will be his own undoing;\\n\\t\\t\\t\\the cannot prevail against Allah'."
  }
]
