[
  {
    "book": [
      {
        "type": "hadith",
        "name": "Nawawi Hadith",
        "bookCode": "NWH",
        "hadiths": [
          {
            "hadithNumber": "42",
            "arabicText": "قَالَ اللهُ تَعَالَى: يَا ابْنَ آدَمَ، إِنَّكَ مَا دَعَوْتَنِي وَرَجَوْتَنِي، غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ وَلاَ أُبَالِي، يَا ابْنَ آدَمَ، لَوْ بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ ثُمَّ اسْتَغْفَرْتَنِي، غَفَرْتُ لَكَ، يَا ابْنَ آدَمَ، إِنَّكَ لَوْ أَتَيْتَنِي بِقُرَابِ الأَرْضِ خَطَايَا، ثُمَّ لَقِيْتَنِي لاَ تُشْرِكُ بِي شَيْئاً، لأَتَيْتُكَ بِقُرَابِهَا مَغْفِرَةً  رَوَاهُ التَّرْمِذِيُّ وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ",
            "text": "From Anas, <em>radiyallahu 'anhu</em>, who said: I heard the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, say:  \"Allah the Almighty has said: 'O son of Adam, so long as you call upon Me, and hope in Me, I shall forgive you for what you have done, and I shall not mind. O son of Adam, were your sins to reach the clouds in the sky and were you then to ask forgiveness of Me, I shall forgive you. O son of Adam, were you to come to Me with an earthful of sins and were you then to face Me, without having associated anything with Me, I shall grant you an earthful of pardon.'\"  [Recorded by Al-Tirmidhi, who said that it is a good and sound <em>hadith</em>]"
          },
		  {
            "hadithNumber": "41",
            "arabicText": "لاَ يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبْعاً لِمَا جِئْتُ بِهِ  حَدِيثٌ حَسَنٌ صَحِيحٌ رَوَيْنَاهُ فِي كِتَابِ الْحُجَّةِ بِإِسْنَادِ صَحِيحٍ",
            "text": "Abu Muhammad 'Abdullah bin Amr bin al-'As, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"None of you (truly) believes until his desire or inclination is in accordance with what I have brought or subservient to what I came with.\"  [A fine and genuine <em>hadith</em> which was related by al-Maqdidsi in his Book of Hujjah]"
          },
          {
            "hadithNumber": "40",
            "arabicText": "أَخَذَ رَسُولُ اللهِ صلی الله عليه و سلم بِمَنْكِبِي فَقَالَ: كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ. وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَقُولُ: إِذَا أَمْسَيْتَ فَلاَ تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلاَ تَنْتَظِرِ الْمَسَاءَ، وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ وَمِنْ حَيَاتِكَ لِمَوْتِكَ  رَوَاهُ الْبُخَارِيُّ",
            "text": "On the authority of Ibn 'Umar, <em>radiyallahu 'anhu</em>, who said: The Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, took me by the shoulder and said:  \"Be in this world as though you were a stranger or a traveler/wayfarer.\" Ibn 'Umar used to say: \"When evening comes, do not expect (to live till) morning, and when morning comes, do not expect (to live till) evening. Take from your health (a preparation) for your illness, and from your life for your death.\"  [Al-Bukhari]"
          },
          {
            "hadithNumber": "39",
            "arabicText": "إِنَّ اللهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ، وَمَا اسْتُكْرِهُوا عَلَيْهِ  حَدِيثٌ حَسَنٌ رَوَاهُ ابْنُ مَاجَه وَالْبَيْهَقِيُّ وَغَيْرُهُمَا",
            "text": "Ibn Abbas, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Truly Allah has for my sake pardoned the mistakes and forgetfulness of my community, and for what they have done under force or duress.\"  [A fine <em>hadith</em> related by Ibn Majah, Al-Baihaqi and others]"
          },
          {
            "hadithNumber": "38",
            "arabicText": "إِنَّ اللهَ تَعَالَى قَالَ: مَنْ عَادَى لِي وَلِيًّا فَقَدْ آذَنْتُهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إِلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إِلَيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ، وَلاَ يَزَالُ عَبْدِي يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ؛ فَإِذَا أَحْبَبْتُهُ كُنْتُ سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لأُعْطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِي لأُعِيذَنَّهُ  رَوَاهُ الْبُخَارِيُّ",
            "text": "Abu Hurairah, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Allah the Almighty has said: 'Whosoever acts with enmity towards a closer servant of Mine (<em>wali</em>), I will indeed declare war against him. Nothing endears My servant to Me than doing of what I have made obligatory upon him to do. And My servant continues to draw nearer to Me with supererogatory (<em>nawafil</em>) prayers so that I shall love him. When I love him, I shall be his hearing with which he shall hear, his sight with which he shall see, his hands with which he shall hold, and his feet with which he shall walk. And if he asks (something) of Me, I shall surely give it to him, and if he takes refuge in Me, I shall certainly grant him it.'\"  [Al-Bukhari]"
          },
          {
            "hadithNumber": "37",
            "arabicText": "إِنَّ اللهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذلِكَ: فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعُمِائَةِ ضِعْفٍ إِلَى أَضْعَافٍ كَثِيرَةٍ، وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ سَيِّئَةً وَاحِدَةً  رَوَاهُ الْبُخَارِيُّ وَمُسْلِمٌ",
            "text": "Ibn Abbas, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, related from his Lord (glorified and exalted be He):  \"Verily Allah has recorded the good deeds and the evil deeds.\" Then he clarified that: \"Whosoever intends to do a good deed but does not do it, Allah records it with Himself as a complete good deed; but if he intends it and does it, Allah records it with Himself as ten good deeds, up to seven hundred times, or more than that. But if he intends to do an evil deed and does not do it, Allah records it with Himself as a complete good deed; but if he intends it and does it, Allah records it down as one single evil deed.\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "36",
            "arabicText": "مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا، نَفَّسَ اللهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ، يَسَّرَ اللهُ عَلَيْهِ فِي الدُّنْيَا وَالآخِرَةِ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللهُ فِي الدُّنْيَا وَالآخِرَةِ، وَاللهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ، وَمَنْ سَلَكَ طَرِيقاً يَلْتَمِسُ فِيْهِ عِلْماً، سَهَّلَ اللهُ لَهُ بِهِ طِرِيقاً إِلَى الْجَنَّةِ، وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللهِ، يَتْلُونَ كِتَابَ اللهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ، إِلاَّ نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ، وَغَشِيَتْهُمُ الرَّحْمَةُ، وَحَفَّتْهُمُ الْمَلاَئِكَةُ، وَذَكَرَهُمُ اللهُ فِيمَنْ عِنْدَهُ، وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ  رَوَاهُ مُسْلِمٌ بِهذَا اللَّفْظِ",
            "text": "It was related on the authority of Abu Hurairah, <em>radiyallahu 'anhu</em>, that the Prophet, <em>sallallahu 'alayhi wasallam</em>, said:  \"Whosoever relieves from a believer some grief pertaining to this world, Allah will relieve from him some grief pertaining to the Hereafter. Whosoever alleviates the difficulties of a needy person who cannot pay his debt, Allah will alleviate his difficulties in both this world and the Hereafter. Whosoever conceals the faults of a Muslim, Allah will conceal his faults in this world and the Hereafter. Allah will aid a servant (of His) so long as the servant aids his brother. Whosoever follows a path to seek knowledge therein, Allah will make easy for him a path to Paradise. No people gather together in one of the houses of Allah, reciting the Book of Allah and studying it among themselves, except that tranquillity descends upon them, mercy covers them, the angels surround them, and Allah makes mention of them amongst those who are in His presence. Whosoever is slowed down by his deeds will not be hastened forward by his lineage.\"  [Muslim]"
          },
          {
            "hadithNumber": "35",
            "arabicText": "لاَ تَحَاسَدُوا، وَلاَ تَنَاجَشُوا، وَلاَ تَبَاغَضُوا، وَلاَ تَدَابَرُوا، وَلاَ يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللهِ إِخْوَاناً، الْمُسْلِمُ أَخُو الْمُسْلِمِ: لاَ يَظْلِمُهُ، وَلاَ يَخْذُلُهُ، وَلاَ يَكْذِبُهُ، وَلاَ يَحْقِرُهُ، التَّقْوَى ههُنَا ـ وَيُشِيرُ إِلَى صَدْرِهِ ثَلاَثَ مَرَّاتٍ ـ بِحَسْبِ امْرِئٍ مِنَ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ، كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ: دَمُهُ، وَمَالُهُ، وَعِرْضُهُ  حَدِيثٌ حَسَنٌ رَوَاهُ الدَّارَقُطْنِي وَغَيْرُهُ",
            "text": "Abu Hurairah, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Do not be envious of one another; do not artificially inflate prices against one another; do not hate one another; do not shun one another; and do not undercut one another in business transactions; and be as fellow-brothers and servants of Allah.  A Muslim is the brother of a Muslim. He neither oppresses him nor humiliates him nor looks down upon him. Piety is here - and he pointed to his chest three times. It is evil enough for a Muslim to hold his brother Muslim in contempt. All things of a Muslim are inviolable for another Muslim: his blood, his property and his honour.\"  [Muslim]"
          },
          {
            "hadithNumber": "34",
            "arabicText": "مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ، وَذلِكَ أَضْعَفُ الإِيْمَان  رَوَاهُ مُسْلِمٌ",
            "text": "On the authority of Abu Sa'id al-Khudri, <em>radiyallahu 'anhu</em>, who said: I heard the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, say:  \"When any one of you sees anything that is disapproved (of by Allah), let him change it with his hand. If he is not able to do so, then let him change it with his tongue. And if he is not able to do so, then let him change it with his heart, though that is the weakest (kind of) faith.\"  [Muslim]"
          },
          {
            "hadithNumber": "33",
            "arabicText": "لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ، لادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ؛ لكِنِ الْبَيِّنَةُ عَلَى الْمُدَّعِي، وَالْيَمينُ عَلَى مَنْ أَنْكَرَ  حَدِيثٌ حَسَنٌ، رَوَاهُ الْبَيْهَقِيُّ وَغَيْرُهُ هكَذَا وَبَعْضُهُ فِي الصَّحِيحَيْنِ",
            "text": "Ibn 'Abbas, <em>radiyallahu 'anhu</em>, said that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Were people to be given according to their claims, some would claim the wealth and blood of others. But the burden of proof is upon the claimant and the taking of an oath is upon the one who denies (the allegation).\"  [An excellent <em>hadith</em> which al-Bayhaqi and others have related. Parts of it is in the two <em>Sahih</em> books (i.e. in Al-Bukhari and Muslim).]"
          },
          {
            "hadithNumber": "32",
            "arabicText": "لاَ ضَرَرَ وَلاَ ضِرَارَ  حَدِيثٌ حَسَنٌ، رَوَاهُ ابْنُ مَاجَه وَالدَّارَقُطْنِيُّ وَغَيْرَهُمَا مُسْنَداً، وَرَوَاهُ مَالَكٌ فِي الْمُوَطَّأ مُرْسَلاً عَنْ عَمْرِو بْنِ يَحْيَ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلی الله عليه و سلم ، فَأَسْقَطَ أَبَا سَعِيدٍ، وَلَهُ طُرُقٌ يُقَوِّي بَعْضُهَا بَعْضً",
            "text": "It was related on the authority of Abu Sa'id Sa'd bin Malik bin Sinan al-Khudri, <em>radiyallahu 'anhu</em>, that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"There should be neither harming nor reciprocating harm.\"  [A excellent <em>hadith</em>  which Ibn Majah, Al-Daraqutni and others related as of sound <em>isnad</em>, but which Malik related in his Muwatta' as of broken isnad, from 'Amr bin Yahya, from his father, from the Prophet, <em>sallallahu 'alayhi wasallam</em>, but dropping (the name of) Abu Sa'id. This <em>hadith</em> has lines of transmission which strengthen one another (so that it may be regarded as of sound <em>isnad</em>).]"
          },
          {
            "hadithNumber": "31",
            "arabicText": "عَنْ أَبِي الْعَبَّاسِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ رَضِيَ اللهُ عَنْهُ قَالَ جَاءَ رَجُلٌ الَى النَّبِيِّ صَلَي اللهُ عَلَيْهِ وَ سَلَمَ فَقَالَ: يَا رَسولَ الله دُلَّنِي عَلَى عَمَلٍ إِذَا عَمِلْتُهُ اَحَبَنِيَ اللهُ وَ اَحَبَنِيَ النَّاسُ فَقَالَ: ازْهَدْ فِي الدُّنْيَا يُحِبَّكَ اللهُ وَ ازْهَدْ فِي مَا عِنْدَ النَّاسِ يُحِبَّكَ النَّاسُ حَدِيثٌ حَسَنٌ رَوَاهُ ابْنُ مَاجَه وَ غَيْرُهُ بِأَسَانِيدَ حَسَنَةٍ",
            "text": "On the authority of Abu al-'Abbas Sahl bin Sa'd al-Sa'idi, <em>radiyallahu 'anhu</em>, who said:  A man came to the Prophet, <em>sallallahu 'alayhi wasallam</em>, and said: \"O Messenger of Allah, direct me to an act which if I do it, [will cause] Allah to love me and people to love me.\" He, <em>sallallahu 'alayhi wasallam</em>, answered: \"Be indifferent to the world and Allah will love you; be indifferent to what people possess and they will love you.\"  [A fine <em>hadith</em> related by Ibn Majah and others with good chains of authorities]"
          },
          {
            "hadithNumber": "30",
            "arabicText": "إِنَّ اللهَ تَعَالَى فَرَضَ فَرَائِضَ فَلاَ تُضَيِّعُوهَا، وَحَدَّ حُدُوداً فَلاَ تَعْتَدُوهَا، وَحَرَّمَ أَشْيَاءَ فَلاَ تَنْتَهِكُوهَا، وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلاَ تَبْحَثُوا عَنْهَا  حَدِيثٌ حَسَنٌ رَوَاهُ الدَّارَقُطْنِي وَغَيْرُهُ",
            "text": "It was narrated on the authority of Abi Tha'labah Al-Khushani Jurthum bin Nashir, <em>radiyallahu 'anhu</em>, that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Verily Allah the Almighty has prescribed the obligatory deeds, so do not neglect them; He has set certain limits, so do not go beyond them; He has forbidden certain things, so do not indulge in them; and He has said nothing about certain things, as an act of mercy to you, not out of forgetfulness, so do not go enquiring into these.\"  [Related by Al-Daraqutni and others - Al-Nawawi said this is a <em>hasan</em> (fine) <em>hadith</em>]"
          },
          {
            "hadithNumber": "29",
            "arabicText": "يَا رَسُلَ اللهِ أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ، وَيُبَاعِدُنِي عَنِ النَّارِ، قَالَ: لَقَدْ سَأَلْتَ عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللهُ تَعَالَى عَلَيْهِ: تَعْبُدُ اللهَ لاَ تُشْرِكُ بِهِ شَيْئًا، وَتُقِيمُ الصَّلاَةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ الْبَيْتَ. ثُمَّ قَالَ: أَلاَ أَدُلُّكَ عَلَى أَبْوَابِ الْخَيرِ: الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِىءُ الْخَطِيئَةَ كَمَا يُطْفِىءُ الْمَاءَ النَّارَ، وَصَلاَةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ، ثُمَّ تَلاَ: تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ حَتَّى بَلَغَ يَعْمَلُونَ. ثُمَّ قَالَ: أَلاَ أُخْبِرُكَ بِرَأْسِ الأَمْرِ وَعَمُودُهُ وَذِرْوَةِ سَنَامِهِ؟ قُلْتُ: بَلَى يَا رَسُولُ اللهِ. قَالَ: رَأْسُ الأَمْرِ الإِسْلاَمُ، وَعَمُودُهُ الصَّلاَةُ، وَذِرْوَةُ سَنَاِمِه الْجِهَادُ. ثُمَّ قَالَ: أَلاَ أُخْبِرُكَ بِمَلاَكِ ذلِكَ كُلِّهِ؟. قُلْتُ: بَلَى يَا رَسُولَ اللهِ، فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْكَ هذَا. قُلْتُ: يَا نَبِيَّ اللهِ، وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟ فَقَالَ: ثَقِلَتْكَ أُمُّكَ يَا مُعَاذُ، وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ ـ أَوْ قَالَ: عَلَى مَنَاخِرِهِمْ ـ إِلاَّ حَصَائِدُ أَلْسِنَتِهِمْ؟  رَوَاهُ التِّرْمِذِيُّ وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ",
            "text": "From Mu'adh bin Jabal, <em>radiyallahu 'anhu</em>, who said: I said:  \"O Messenger of Allah, tell me of a deed which will take me into Paradise and will keep me away from the Hell-fire.\" He said: \"You have asked me about a great matter, yet it is, indeed, an easy matter for him to whom Allah Almighty makes it easy. (It is ) that you worship Allah without associating anything with Him, that you perform the prayers, that you pay the <em>zakat</em>, that you fast during Ramadan, and that you make the pilgrimage to the House.\"  Then he said: \"Shall I not guide you to the gates of goodness? Fasting is a shield; charity extinguishes sin as water extinguishes fire; and a man's prayer in the middle of the night.\" Then he recited: \"Who forsake their beds to cry unto their Lord in fear and hope, and spend of that We have bestowed on them. No soul knoweth what is kept hid for them of joy, as a reward for what they used to do\". [Qu'ran, Surah al-Sajdah (32): Ayah 16-17]  Then he said: \"Shall I not also tell you of the peak of the matter, its pillar, and its topmost part?\" I said: \"Yes, O Messenger of Allah.\" He said: \"The peak of the matter is Islam (submission to Allah), the pillar is prayer; and its topmost part is jihad.\" Then he said: \"And shall I not tell you of the controlling of all that ?\" I said:\" Yes, O Messenger of Allah\". So he took hold of his tongue and said: \"Restrain this.\" I said: \"O Prophet of Allah, will we be held accountable for what we say?\" He said: \"May your mother be bereft of you! Is there anything that topples people on their faces (or he said, on their noses) into the Hell-fire other than the jests of their tongues?\"  [Related by Al-Tirmidhi, who said it was a fine and sound <em>hadith</em>]"
          },
          {
            "hadithNumber": "28",
            "arabicText": "وَعَظَنَا رَسُولُ اللهِ صلی الله عليه و سلم مَوْعِظَةً وَجِلَتْ مِنْهَا الْقُلُوبُ، وَذَرَفَتْ مِنْهَا الْعُيُونُ، فَقُلْنَا: يَا رَسُولَ اللهِ كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ، فَأَوْصِنَا، قَالَ: أُوصِيكُمْ بِتَقْوَى اللهِ عَزَّ وَجَلَّ، وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ، فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلاَفاً كَثِيرًا، فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ، عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ، وَإِيَّاكُمْ وَمُحْدَثَاتِ الأُمُورِ، فَإِنَّ كُلَّ مُحْدَثَةٍ بِدْعَةٌ، وَكُلَّ بِدْعَةٍ ضَلاَلَةٌ، وَكُلَّ ضَلاَلَةٍ فِي النَّارِ  رَوَاهُ أَبُو دَاوُدَ وَالتِّرْمِذِيُّ وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ",
            "text": "It was narrated on the authority of Abu Najih al-Irbad bin Sariyah, <em>radiyallahu 'anhu</em>, who said:  The Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, delivered an admonition that made our hearts fearful and our eyes tearful. We said, \"O Messenger of Allah, it is as if this were a farewell sermon, so advise us.\" He said, \"I enjoin you to have <em>Taqwa</em> of Allah and that you listen and obey, even if a slave is made a ruler over you. He among you who lives long enough will see many differences. So for you is to observe my Sunnah  and the Sunnah of the rightly-principled and rightly-guided successors, holding on to them with your molar teeth. Beware of newly-introduced matters, for every innovation (bid'ah) is a going astray and for every going astray is fire.\"  [Abu Dawud and Al-Tirmidhi, who says it is an authentic <em>hadith</em>]"
          },
          {
            "hadithNumber": "27",
            "arabicText": "الْبِرُّ حُسْنُ الخُلُقِ، وَالإِثْمُ مَا حَاكَ فِي نَفْسِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ  رَوَاهُ مُسْلِمٌ  أَتَيْتُ رَسُولَ اللهِ صلی الله عليه و سلم فَقَالَ: جِئْتَ تَسْأَلُ عَنِ الْبِرِّ؟ قُلْتُ: نَعَمْ، قَالَ: اسْتَفْتِ قَلْبَكَ، الْبِرُّ مَا اطْمَأَنَّتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ، وَالإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ وَإِنْ أَفْتَاكَ النَّاسُ وَأَفْتَوْكَ  حَدِيثٌ حَسَنٌ رَوَيْنَاهُ فِي مُسْنَدَي الإِمَامَيْنِ أَحْمَدَ بْنِ حَنْبَلٍ وَالدَّارِمِيِّ بِإِسْنَادٍ حَسَنٍ",
            "text": "Al-Nawwas bin Sam'an, <em>radiyallahu 'anhu</em>, reported that the Prophet, <em>sallallahu 'alayhi wasallam</em>, said:  \"Righteousness is good character, and sin is that which wavers in your heart and which you do not want people to know about.\"  [Muslim]  According to Wabisah bin Ma'bad, <em>radiyallahu 'anhu</em>, who said:  I came to the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>,  and he said: \"You have come to ask about righteousness ?\" \"Yes,\" I answered. He said: \"Consult your heart. Righteousness is that about which the soul feels tranquil and the heart feels tranquil, and sin is what creates restlessness in the soul and moves to and fro in the breast, even though people give you their opinion (in your favour) and continue to do so.\"  [A good <em>hadith</em> transmitted from the <em>Musnads</em> of the two Imams, Ahmad bin Hanbal and Al-Darimi]"
          },
          {
            "hadithNumber": "26",
            "arabicText": "كُلُّ سُلاَمَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ: تَعْدِلُ بَيْنَ اثْنَينِ صَدَقَةٌ، وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَبِكُلِّ خَطْوَةٍ تَمْشِيهَا إِلَى الصَّلاَةِ صَدَقَةٌ، وَتُمِيطُ الأَذَى عَن الطَّرِيقِ صَدَقَةٌ  رَوَاهُ الْبُخَارِيُّ وَمُسْلِمٌ",
            "text": "Abu Hurairah, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"On every person's joints or small bones (i.e. fingers and toes), there is <em>sadaqah</em> (charity) every day the sun rises. Doing justice between two people is <em>sadaqah</em>; assisting a man to mount his animal, or lifting up his belongings onto it is <em>sadaqah</em>; a good word is <em>sadaqah</em>; every step you take towards prayer is <em>sadaqah</em>; and removing harmful things from pathways is <em>sadaqah</em>.\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "25",
            "arabicText": "يَا رَسُولَ اللهِ، ذَهَبَ أَهْلُ الدُّثُورِ بِالأُجُورِ، يُصَلُّونَ كَمَا نُصَلِّي، وَيَصُومُونَ كَمَا نَصُومُ، وَيَتَصَدَّقُونَ بِفُضُولِ أَمْوَالِهِمْ، قَالَ: أَوَلَيْسَ قَدْ جَعَلَ اللهُ لَكُمْ مَا تَصَدَّقُونَ؟ إِنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً، وَكُلِّ تَكْبِيرَةٍ صَدَقَةً، وَكُلِّ تَحْمِيدَةٍ صَدَقَةً، وَكُلِّ تَهْلِيلَةٍ صَدَقَةً، وَأَمْرٍ بِالْمَعْرُوفِ صَدَقَةً، وَنَهْيٍ عَنْ مُنْكَرٍ صَدَقَةً، وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةً. قَالُوا: يَا رَسُولَ اللهِ أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ؟ قَالَ: أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حرَامٍ، أَكَانَ عَلَيْهِ وِزْرٌ؟ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلاَلِ كَانَ لَهُ أَجْرٌ  رَوَاهُ مُسْلِمٌ",
            "text": "Abu Dharr, <em>radiyallahu 'anhu</em>, reported that some of the Companions of the Messenger of Allah, <em>sallallahu alayhi wasallam</em>, said to him:  \"O Messenger of Allah, the rich have taken away all the rewards. They observe the prayer as we do, and they keep the fasts as we do, and they give <em>sadaqah</em> (charity) from their surplus riches.\" Upon this he (the Prophet) said: \"Has Allah not prescribed for you (a course) by following which you can also do <em>sadaqah</em>? Verily in every <em>tasbih</em> (i.e. saying <em>Subhanallah</em>) there is a <em>sadaqah</em>, every <em>takbir</em> (i.e. saying Allahu Akbar) is a <em>sadaqah</em>, every <em>tahmid</em> (i.e. saying Alhamdulillah) is a <em>sadaqah</em>, every <em>tahlil</em> (i.e. saying Lailaha illallah) is a <em>sadaqah</em>, enjoining of good is a <em>sadaqah</em>, forbidding of evil is a <em>sadaqah</em>, and having sexual intercourse with your wife is a <em>sadaqah</em>. They (the Companions) said: \"O Messenger of Allah, is there reward for him who satisfies his sexual passion among us?\" He said: \"Tell me, if he were to devote it to something forbidden, would it not be a sin on his part? Similarly, if he were to devote it to something lawful, he should have a reward.\"  [Muslim]"
          },
          {
            "hadithNumber": "24",
            "arabicText": "يَا عِبَادِي: إِنِّي حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِي وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّماً فَلاَ تَظَالَمُوا. يَا عِبَادِي: كُلُّكُمْ ضَالٌّ إِلاَّ مَنْ هَدَيْتُهُ فَاسْتَهْدُونِي أَهْدِكُمْ. يَا عِبَادِي: كُلُّكُمْ جَائِعٌ إِلاَّ مَنْ أَطْعَمْتُهُ، فَاسْتَطْعَمُونِي أَطْعِمْكُمْ. يَا عِبَادِي: كُلُّكُمْ عَارٍ إِلاَّ مَنْ كَسَوْتُهُ فَاسْتَكْسُونِي أَكْسُكُمْ. يَا عِبَادِي: إِنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ، وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعاً، فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ. يَا عِبَادِي: إِنَّكُمْ لَنْ تَبْلُغُوا ضُرِّي فَتَضُرُّونِي، وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي. يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئاً. يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئاً. يَا عِبَادِي: لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيْدٍ وَاحِدٍ، فَسَأَلُونِي، فَأَعْطَيْتُ كُلَّ وَاحِدٍ مَسْأَلَتَهُ، مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إِلاَّ كَمَا يَنْقُصُ الْمِخْيَطُ إِذَا أُدْخِلَ الْبَحْرَ. يَا عِبَادِي: إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ، ثُمَّ أُوَفِّيكُمْ إِيَّاهَا، فَمَنْ وَجَدَ خَيْراً فَلْيَحْمَدِ اللهَ، وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلاَ يَلُومَنَّ إِلاَّ نَفْسَهُ  رَوَاهُ مُسْلِمٌ",
            "text": "It was relayed on the authority of Abu Dhar al-Ghifari, <em>radiyallahu 'anhu</em>, that the Prophet, <em>sallallahu alayhi wasallam</em>, said, of what he related from his Lord, magnified and exhalted be He, Who said:  \"O My servants, I have made oppression unlawful for Me and unlawful for you, so do not commit oppression against one another. O My servants, all of you are liable to err except for those whom I guide on the right path, therefore seek guidance from Me so that I should direct you to the right path. O My servants, all of you are hungry (needy) except for those whom I feed, therefore seek food from Me so that I may feed you. O My servants, all of you are naked (need clothes) except for those whom I provide garments, therefore seek clothing from Me so that I should clothe you. O My servants, you sin by night and by day and I am there to pardon your sins, therefore seek forgiveness from Me so that I should grant you pardon. O My servants, you can neither do Me any harm nor can you do Me any good. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of Jinns become as pious as the most pious heart of any one amongst you, it will not add anything to My Power or Kingdom. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of Jinns become as wicked as the most wicked heart of anyone amongst you, it will not decrease anything from My Power or Kingdom. O My servants, even if the first amongst you and the last amongst you and the whole human race of yours and that of Jinns gather together on a sector of land and all ask of Me and if I were to give everyone of them what they asked, that will not in any way decrease what I have any more than a needle decreases what is in the ocean when it is put into it. O My servants, these deeds of yours which I am recording for you I shall reward you for them, so he who finds good should praise Allah and he who finds other than that should not blame anyone but himself.\"  [Muslim]"
          },
          {
            "hadithNumber": "23",
            "arabicText": "الطُّهُورُ شَطْرُ الإِيْمَانِ، وَالْحَمْدُ للهِ تَمْلأُ الْمِيزَانَ، وَسُبْحَانَ اللهِ وَالْحَمْدُ للهِ تَمْلآنِ – أَوْتَمْلأُ – مَا بَيْنَ السَّمَاءِ وَالأَرْضِ، وَالصَّلاَةُ نُورٌ، وَالصَّدَقَةُ بُرْهَانٌ، وَالصَّبْرُ ضِيَاءٌ، وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ، كُلُّ النَّاسِ يَغْدُو فَبَائِعُ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا  رَوَاهُ مُسْلِمٌ",
            "text": "On the authority of Abu Malik al-Harith bin 'Asim al-Ash'ari, <em>radiyallahu 'anhu</em>, who said: The Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Purification is half of <em>iman</em> (faith). Saying 'Al-Hamdulillah'  (Praise be to Allah) fills the scales. Saying '<em>Subhanallah wa al-Hamdulillahi</em>' (Exhalted be Allah and Praise be to Allah) fills the space between the heavens and the earth. Salah  (prayer) is a light. <em>Sadaqah</em> (charity) is a proof. <em>Sabr</em>  (patience) is a shining glory. The Qur'an is an argument either for you or against you. Everybody goes out in the morning and sell themselves, thereby setting themselves free or destroying themselves.\"  [Muslim]"
          },
          {
            "hadithNumber": "22",
            "arabicText": "أَنَّ رَجُلاً سَأَلَ رَسُولَ اللهِ صلی الله عليه و سلم فَقَالَ: أَرَأَيْتَ إِذَا صَلَّيْتُ الْمَكْتُوبَاتَ، وَصُمْتُ رَمَضَانَ، وَأَحْلَلْتُ الْحَلاَلَ، وَحَرَّمْتُ الْحَرَامَ، وَلَمْ أَزِدْ عَلَى ذَلِكَ شَيْئاً، أَأَدْخُلُ الْجَنَّةَ؟ قَالَ: نَعَمْ  رَوَاهُ مُسْلِمٌ",
            "text": "Abu ‘Abdullah Jabir bin ‘Abdullah al-Ansari, <em>radiyallahu 'anhuma</em>, reported that a man questioned the Messenger of Allah, <em>sallallahu ‘alayhi wasallam</em>, saying:  \"Do you see, if I pray the prescribed (prayers), fast during Ramadhan, treat the lawful as permissible and treat the forbidden as prohibited, but do nothing more than that, shall I enter Paradise?\" He (the Prophet, <em>sallallahu ‘alayhi wasallam</em>) answered: \"Yes.\"  [Muslim]"
          },
          {
            "hadithNumber": "21",
            "arabicText": "قُلْتُ: يَا رَسُولَ اللهِ، قُلْ لِي فِي الإِسْلاَمِ قَولاً لاَ أَسْأَلُ عَنْهُ أَحَداً غَيْرَكَ، قَالَ: قُلْ آمَنْتُ بِاللهِ، ثُمَّ اسْتَقِمْ  رَوَاهُ البُخَارِيُّ",
            "text": "On the authority of Abu 'Amr, though others call him Abu 'Amrah Sufyan bin 'Abdullah, <em>radiyallahu 'anhu</em>, who said:  I said: \"O Messenger of Allah, tell me something about Islam which I could not ask anyone about save you.\" He answered: \"Say: 'I believe in Allah', and then stand firm and steadfast.\"  [Muslim]"
          },
          {
            "hadithNumber": "20",
            "arabicText": "إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلاَمِ النُّبُوَّةِ الأُولَى: إِذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ  رَوَاهُ البُخَارِيُّ",
            "text": "Abu Mas'ud 'Uqbah bin 'Amr al-Ansari al-Badri, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Among the things that people have found from the words of the previous prophets was: 'If you feel no shame, then do as you wish.'\"  [Al-Bukhari]"
          },
          {
            "hadithNumber": "19",
            "arabicText": "كنْتُ خَلْفَ النَّبِيَّ ص يَوْماً فَقَالَ لِي يَا غُلاَمُ، إِنِّي أُعَلِّمُكَ كَلِمَاتٍ: احْفَظِ اللهَ يَحْفَظْكَ، احْفَظِ اللهَ تَجِدْهُ تُجَاهَكَ، إِذَا سَأَلْتَ فَاسْأَلِ اللهَ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللهِ، وَاعْلَمْ أَنَّ الأُمَّةَ لَو اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إِلاَّ بِشَيْءٍ قَدْ كَتَبَهُ اللهُ لَكَ، وَإِنْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلاَّ بِشَيْءٍ قَدْ كَتَبَهُ اللهُ عَلَيْكَ، رُفِعَتِ الأَقْلاَمُ وَجَفَّتِ الصُّحُفُ  رَوَاهُ الْتِّرْمِذِيُّ وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ  وَ فِي رِوَايَةٍ غَيرَ التِّرمِذِي  احْفَظِ اللهَ تَجِدْهُ أَمَامَكَ، تَعَرَّفْ إِلَى اللهِ فِي الرَّخَاءِ يَعْرِفْكَ فِي الشِّدَّةِ، وَاعْلَمْ أَنَّ مَا أَخْطَأَكَ لَمْ يَكُنْ لِيُصِيْبَكَ، وَمَا أَصَابَكَ لَمْ يَكُنْ لِيُخْطِئَكَ، وَاعْلَمْ أَنَّ النَّصْرَ مَعَ الصَّبْرِ، وَأَنَّ الْفَرَجَ مَعَ الْكَرْبِ، وَأَنَّ مَعَ الْعُسْرِ يُسْراً",
            "text": "Abu al-‘Abbas ‘Abdullah bin ‘Abbas, <em>radiyallahu 'anhuma</em>, reported: One day I was behind the Prophet, <em>sallallahu ‘alayhi wasallam</em>, and he said to me:  \"O young man, I shall teach you some words [of advice] : Be mindful of Allah, and Allah will protect you. Be mindful of Allah, and you will find Him in front of you. If you (have need to) ask, ask of Allah; and if you seek help, seek help from Allah. Know that even if the Nation (or the whole community) were to gather together to benefit you with something, they would not benefit you with anything except that which Allah has already recorded for you, and that if they gather together to harm you with something, they would not be able to harm you with anything except that which Allah has already recorded against you. The pens have been lifted and the pages have dried.\"  [Al-Tirmidhi relates this and says: It is a good, genuine <em>hadith</em>]  In a version other than that of al-Tirmidhi it reads:  \"..Be mindful of Allah, you will find Him before you. Get to know Allah in prosperity and He will know you in adversity. Know that what has passed you by was not going to befall you; and that what has befallen you was not going to pass you by. And know that victory comes with patience, relief with affliction, and ease with hardship.\""
          },
          {
            "hadithNumber": "18",
            "arabicText": "اتَّقِ اللهَ حَيْثُمَا كُنْتَ، وَأَتْبِعِ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ  رَوَاهُ التِّرْمِذِيُّ وَقَالَ: حَدِيثٌ حَسَنٌ، وَفِي بَعْضِ النُّسَخِ حَسَنٌ صَحِيحٌ",
            "text": "Abu Dhar Jundub bin Junadah and Abu Abdul Rahman Mu’adh bin Jabal, <em>radiyallahu 'anhuma</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Fear Allah wherever you may be; follow up an evil deed with a good one which will wipe (the former) out, and behave good-naturedly towards people.\"  [Al-Tirmidhi relates it, saying: It is a good (<em>hasan</em>) Tradition. In some copies he says: It is a good and genuine (<em>hasan</em> and <em>sahih</em>) <em>hadith</em>.]"
          },
          {
            "hadithNumber": "17",
            "arabicText": "إِنَّ اللهَ كَتَبَ الإِحْسَانَ عَلَى كُلِّ شَيْءٍ: فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدْ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيحَتَهُ  رَوَاهُ وَمُسْلِمٌ",
            "text": "Abu Ya'la Shaddad ibn Aus, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Verily, Allah has enjoined excellence (<em>ihsan</em>) with regard to everything. So, when you kill, kill in a good way; when you slaughter, slaughter in a good way; so everyone of you should sharpen his knife, and let the slaughtered animal die comfortably.\"  [Muslim]"
          },
          {
            "hadithNumber": "16",
            "arabicText": "عـَـن أَبِـي هُـرَيـرَةَ رَضِي الله عَــنـهُ ، ان رَجُــلًا قَـــالَ لِلـنَّـبِيِّ صَلَّى الله عَـلَـيـهِ وَسَـلَّـمَ : أَوصِــنِي . قَالَ : : لاَ تَغْضَبْ، فَرَدَّدَ مِرَاراً، قَالَ: لاَ تَغْضَبْ  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "Abu Hurairah, <em>radiyallahu 'anhu</em>, reported that a man said to the Prophet, <em>sallallahu ‘alayhi wasallam</em>:  \"Advise me! \"The Prophet said, \"Do not become angry and furious.\" The man asked (the same) again and again, and the Prophet said in each case, \"Do not become angry and furious.\"  [Al-Bukhari; Vol. 8 No. 137]"
          },
          {
            "hadithNumber": "15",
            "arabicText": "مَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْراً أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "Abu Hurairah, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Let whosoever believes in Allah and in the Last Day either speak good or be silent. Let whosoever believes in Allah and in the Last Day honour his neighbour. Let whosoever believes in Allah and in the Last Day honour his guest.\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "14",
            "arabicText": "لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بِإِحْدَى ثَلاَثٍ: الثَّيْبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِيْنِهِ الْمُفَارِقُ لِلْجَمَاعَةِ  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "On the authority of Ibn Mas’ud, <em>radiyallahu 'anhu</em>, who said: The Messenger of Allah, <em>sallallahu ‘alayhi wasallam</em>, said:  \"The blood of a man who is a Muslim is not lawful (i.e. cannot be lawfully shed), save if he belongs to one of three (classes): a married man who is an adulterer; life for a life (i.e. for murder); one who is a deserter of his religion, abandoning the community.\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "13",
            "arabicText": "لاَ يُؤْمِنُ أَحَدَكُمْ حَتَّى يُحِبَّ لأَخِيْهِ مَا يُحِبُّ لِنَفْسِهِ  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "Abu Hamzah Anas bin Malik, radiyallahu 'anhu, who was the servant of the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, reported that the Prophet, <em>sallallahu 'alayhi wasallam</em>, said:  \"None of you truly believes (in Allah and in His religion) until he loves for his brother what he loves for himself\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "12",
            "arabicText": "مِنْ حُسْنِ إِسْلاَمِ الْمَرْءِ تَرْكُهُ مَا لاَ يَعْنِيهِ  حَدِيثٌ حَسَنٌ، رَوَاهُ التِّرْمِذِيُّ وَغَيْرَهُ هكَذَا",
            "text": "On the authority of Abu Hurairah, <em>radiyallahu 'anhu</em>, who said : The Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Part of the perfection of someone's Islam is his leaving alone that which does not concern him.\"  [Hadith <em>hasan</em> - Recorded by Tirmidhi]"
          },
          {
            "hadithNumber": "11",
            "arabicText": "دَعْ مَا يَرِيْبُكَ إِلَى مَا لاَ يَرِيبُكَ  رَوَاهُ التِّرْمِذِيُّ وَالنَّسَائِيُّ، وَقَالَ التِّرْمِذِيُّ: حَدِيثٌ حَسَنٌ صَحِيحٌ",
            "text": "On the authority of Abu Muhammad al-Hasan bin Ali bin Abi Taib, the grandson of the Messenger of Allah, <em>sallallahu ëalayhi wasallam</em>, and who is dearest to him, <em>radiyallahu anhuma</em>, who said: ìI committed to memory from the Messenger of Allah, <em>sallallahu alayhi wasallam</em>, (the following words):  \"Leave that about which you are in doubt for that about which you are in no doubt.\"  [Al-Tirmidhi and al-Nasaíi related it, and al-Tirmidhi said: It is a good and genuine <em>hadith</em>]"
          },
          {
            "hadithNumber": "10",
            "arabicText": "إِنَّ اللهَ تَعَالَى طَيِّبٌ لاَ يَقْبَلُ إِلاَّ طَيِّباً، وَإِنَّ اللهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ، فَقَالَ تَعَالَى: يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا وَقَالَ تَعَالَى: يَا أَيُّهَا الَّذِينَ آمَنُواْ كُلُواْ مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ، أَشْعَثَ أَغْبَرَ، يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ: يَا رَبُّ؛ يَارَبُّ؛ وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، وغُذِيَ بِالْحَرَامِ؛ فَأَنّى يُسْتَجَابُ لَهُ  رَوَاهُ مُسْلِمٌ",
            "text": "Abu Hurairah, <em>radiyallahu 'anhu</em>, reported that the Messenger of Allah, <em>sallallahu ‘alayhi wasallam</em>, said:  \"Verily Allah the Exalted is pure. He does not accept but that which is pure. Allah commands the believers with what He commanded the Messengers. Allah the Almighty has said: \"O you Messengers! Eat of the good things and act righteously\" [23:51-53]. And Allah the Almighty also said: \"O you who believe! Eat of the good things that We have provided you with\" [2:167-172]. Then he (the Prophet) mentioned (the case of) the man who, having journeyed far, is disheveled and dusty and who stretches out his hands to the sky (saying): \"O Lord! O Lord!\" (while) his food was unlawful, his drink was unlawful, his clothing was unlawful, and he is nourished with unlawful things, so how can he be answered?\"  [Muslim]"
          },
          {
            "hadithNumber": "9",
            "arabicText": "مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلاَفُهُمْ عَلَى أَنْبِيَائِهِمْ  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "Abu Hurairah 'Abd al-Rahman bin Sakhr, <em>radiyallahu 'anhu</em>, reported: I heard the Messenger of Allah, <em>sallallahu ‘alayhi wasallam</em>, say:  \"Avoid that which I forbid you to do and do that which I command you to do to the best of your capacity. Verily the people before you were destroyed only because of their excessive questioning and their disagreement with their Prophets.\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "8",
            "arabicText": "أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّداً رَسُولُ اللهِ، وَيُقِيمُوا الصَّلاَةَ، وَيُؤْتُوا الزَّكَاةَ، فَإِذَا فَعَلُوا ذلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ، إِلاَّ بِحَقِّ الإِسْلاَمِ، وَحِسَابُهُمْ عَلَى اللهِ تَعَالَى  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "Abdullah bin Omar narrated that the messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"I have been ordered to fight against people until they testify that there is no god but Allah and that Muhammad is the messenger of Allah and until they perform the prayers and pay the <em>zakat</em>, and if they do so they will have gained protection from me for their lives and property, unless [they do acts that are punishable] in accordance with Islam, and their reckoning will be with Allah the Almighty.\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "7",
            "arabicText": "لدِّينُ النَّصِيْحَةُ. قُلْنَا: لِمَنْ؟ قَالَ: لِلّهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ  رَوَاهُ مُسْلِمٌ",
            "text": "On the authority of Tamim Al-Dari that the Prophet, <em>sallallahu 'alayhi wasallam</em>, said:  \"Religion is <em>nasihah</em>.\" We said: \"To whom?\" The Prophet, <em>sallallahu 'alayhi wasallam</em>, said: \"To Allah and His Book, and His messenger, and to the leaders of the Muslims and their common folk.\"  [Muslim]"
          },
          {
            "hadithNumber": "6",
            "arabicText": "إِنَّ الْحَلاَلَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لاَيَعْلَمُهُنَّ كَثِيرٌ مِنَ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ فَقَد اسْتَبْرَأَ لِدِيْنِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَام، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلاَ وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلاَ وَإِنَّ حِمَى اللهِ مَحَارِمُهُ، أَلاَ وَإِنَّ فِي الْجَسَدِ مُضْغَةً، إِذَا صَلُحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلاَ وَهِيَ الْقَلْبُ  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "On the authority of Abu 'Abdullah al-Nu'man bin Bashir, <em>radiyallahu 'anhu</em>, who said: I heard the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, say:  \"Truly, what is lawful is evident, and what is unlawful is evident, and in between the two are matters which are doubtful which many people do not know. He who guards against doubtful things keeps his religion and honour blameless, and he who indulges in doubtful things indulges in fact in unlawful things, just as a shepherd who pastures his flock round a preserve will soon pasture them in it. Beware, every king has a preserve, and the things Allah has declared unlawful are His preserves. Beware, in the body there is a flesh; if it is sound, the whole body is sound, and if it is corrupt, the whole body is corrupt, and behold, it is the heart.\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "5",
            "arabicText": "مَنْ أَحْدَثَ فِي أَمْرِنَا هذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ  رَوَاهُ البُخَارِيُّ  مَنْ عَمِلَ عَمَلاً لَيْسَ عَلَيْهِ أَمْرُناَ فَهُوَ رَدٌّ  رَوَاهُ مُسْلِمٌ",
            "text": "It is narrated on the authority of the Mother of the Believers, Umm 'Abdullah 'Aishah, <em>radiyallahu 'anha</em>, that the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, said:  \"Whosoever introduces into this affair of ours (i.e. into Islam) something that does not belong to it, it is to be rejected.\"  [Al-Bukhari]  \"Whosoever works a work which has for it no command of ours is to be rejected.\"  [Muslim]"
          },
          {
            "hadithNumber": "4",
            "arabicText": "إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِيْنَ يَوْماً نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إِلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيْهِ الرُّوحَ وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٌّ أَوْسَعِيْدٌ. فَوَاللهِ الَّذِي لاَ إِلهَ غَيْرَهُ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ، حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ، حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "Abu 'Abd al-Rahman 'Abdullah bin Mas'ud, <em>radiyallahu 'anhu</em>, reported: The Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, the most truthful, the most trusted, told us:  \"Verily the creation of any one of you takes place when he is assembled in his mother's womb; for forty days he is as a drop of fluid, then it becomes a clot for a similar period. Thereafter, it is a lump looking like it has been chewed for a similar period. Then an angel is sent to him, who breathes the <em>ruh</em> (spirit) into him. This Angel is commanded to write Four decrees: that he writes down his provision (<em>rizq</em>), his life span, his deeds, and whether he will be among the wretched or the blessed.  I swear by Allah - there is no God but He - one of you may perform the deeds of the people of Paradise till there is naught but an arm's length between him and it, when that which has been written will outstrip him so that he performs the deeds of the people of the Hell Fire; one of you may perform the deeds of the people of the Hell Fire, till there is naught but an arm's length between him and it, when that which has been written will overtake him so that he performs the deeds of the people of Paradise and enters therein.\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "3",
            "arabicText": "بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لاَ إلهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّداً رَسُولُ اللهِ، وَإقَامِ الصَّلاَةِ، وَإيْتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "On the authority of Abu 'Abd al-Rahman 'Abdullah bin 'Umar bin al-Khattab, <em>radiyallahu 'anhuma</em>, who said: I heard the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, say:  \"Islam has been built upon five things - on testifying that there is no god save Allah, and that Muhammad is His Messenger; on performing <em>salah</em>; on giving the <em>zakah</em>; on Hajj to the House; and on fasting during Ramadhan.\"  [Al-Bukhari and Muslim]"
          },
          {
            "hadithNumber": "2",
            "arabicText": "بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ الله ص ذَاتَ يَوْمٍ، إذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعْرِ، لا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلا يَعْرِفُهُ مِنَّا أحَدٌ، حَتَّى جَلَسَ إلَى النَّبِيِّ ص، فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ، أخْبِرْنِي عَنْ الإسْلاَمِ. فَقَالَ رَسُولُ اللهِ ص: الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إِلهَ إِلاَ اللهُ وَأَنَّ مُحَمَّداً رَسُولُ اللهِ، وَتُقِيمَ الصَّلاَةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيتَ إِن اسْتَطَعْتَ إِلَيْهِ سَبِيلاً. قَالَ: صَدَقْتَ، فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ. قَالَ: فَأَخْبِرْنِي عَنِ الإِيْمَانِ، قَالَ: أَنْ تُؤْمِنَ بِاللهِ، وَمَلاَئِكَتِهِ، وَكُتُبِهِ، وَرُسُلِهِ، وَالْيَوْمِ الآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ. قَالَ: صَدَقْتَ، قَالَ: فَأَخْبِرْنِي عَنِ الإِحْسَانِ. قَالَ: أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ. قَالَ: فَأَخْبِرْنِي عَنِ  السَّاعَةِ، قَالَ: مَا الْمَسْؤُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ. قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا، قَالَ:  أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ. ثُمَّ انْطَلَقَ فَلَبِثْتُ مَلِيًّا ثُمَّ قَالَ: يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟ قُلْتُ: اللهُ وَرَسُولُهُ أَعْلَمُ، قَالَ: فَإِنَّهُ جِبْرِيْلُ أَتَاكُمْ يُعَلِّمُكُمْ دِيْنَكُمْ  رَوَاهُ مُسْلِمٌ",
            "text": "Also on the authority of 'Umar, <em>radiyallahu 'anhu</em>, who said:  \"While we were one day sitting with the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, there appeared before us a man dressed in extremely white clothes and with very black hair. No traces of journeying were visible on him, and none of us knew him.  He sat down close by the Prophet, <em>sallallahu 'alayhi wasallam</em>, rested his knee against his thighs, and said, O Muhammad! Inform me about Islam.\" Said the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, \"Islam is that you should testify that there is no deity save Allah and that Muhammad is His Messenger, that you should perform <em>salah</em> (ritual prayer), pay the <em>zakah</em>, fast during Ramadan, and perform Hajj (pilgrimage) to the House (the Ka'bah at Makkah), if you can find a way to it (or find the means for making the journey to it).\" Said he (the man), \"You have spoken truly.\"  We were astonished at his thus questioning him and telling him that he was right, but he went on to say, \"Inform me about <em>iman</em> (faith).\" He (the Messenger of Allah) answered, \"It is that you believe in Allah and His angels and His Books and His Messengers and in the Last Day, and in fate (<em>qadar</em>), both in its good and in its evil aspects.\" He said, \"You have spoken truly.\"  Then he (the man) said, \"Inform me about <em>Ihsan</em>.\" He (the Messenger of Allah) answered, \" It is that you should serve Allah as though you could see Him, for though you cannot see Him yet He sees you.\" He said, \"Inform me about the Hour.\" He (the Messenger of Allah) said, \"About that the one questioned knows no more than the questioner.\" So he said, \"Well, inform me about the signs thereof (i.e. of its coming).\" Said he, \"They are that the slave-girl will give birth to her mistress, that you will see the barefooted ones, the naked, the destitute, the herdsmen of the sheep (competing with each other) in raising lofty buildings.\" Thereupon the man went off.  I waited a while, and then he (the Messenger of Allah) said, \"O 'Umar, do you know who that questioner was?\" I replied, \"Allah and His Messenger know better.\" He said, \"That was Jibril. He came to teach you your religion.\"  [Muslim]"
          },
          {
            "hadithNumber": "1",
            "arabicText": "إنَّمَا الأَعْمَالُ بِالنِّياَّتِ وَإنمَّاَ لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْياَ يُصِيْبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْه  رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ",
            "text": "It is narrated on the authority of Amirul Mu'minin, Abu Hafs 'Umar bin al-Khattab, <em>radiyallahu 'anhu</em>, who said: I heard the Messenger of Allah, <em>sallallahu 'alayhi wasallam</em>, say:  \"Actions are (judged) by motives (<em>niyyah</em>), so each man will have what he intended. Thus, he whose migration (<em>hijrah</em>) was to Allah and His Messenger, his migration is to Allah and His Messenger; but he whose migration was for some worldly thing he might gain, or for a wife he might marry, his migration is to that for which he migrated.\"  [Al-Bukhari and Muslim]"
          }
        ]
      }
    ]
  }
]
