[
  {
    "SurahNumber": "45",
    "AyahNumber": "1",
    "NoteID": "4735",
    "Body": "See Introduction to S. xi."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "2",
    "NoteID": "4736",
    "Body": "This verse is the same as xl. 2, except that \"wisdom\" is\\n\\t\\t\\t\\there substituted in the last line for \"knowledge\". This\\n\\t\\t\\t\\tis appropriate, as in this Sura we are dealing with the\\n\\t\\t\\t\\tfolly of those who reject Allah and His Signs, while S.\\n\\t\\t\\t\\txl. dealt with the individual soul's witness to Faith and\\n\\t\\t\\t\\tVirtue."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "3",
    "NoteID": "4737",
    "Body": "Verses 3-5 deal with some of the points in the noble\\n\\t\\t\\t\\targument in ii. 164, but again there are differences on\\n\\t\\t\\t\\taccount of the different context. Note that here the\\n\\t\\t\\t\\targument is divided into three parts, one in each verse.\\n\\t\\t\\t\\t(1) In verse 3 we are dealing with big Signs external to\\n\\t\\t\\t\\tourselves, some of which are far beyond our personal\\n\\t\\t\\t\\texperiences: for them we require Faith: they are Signs\\n\\t\\t\\t\\t\"for those who believe.\" For the other two see the next\\n\\t\\t\\t\\ttwo notes."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "4",
    "NoteID": "4738",
    "Body": "(2) These Signs are in our own nature and in the animals\\n\\t\\t\\t\\twe meet with every day; here we have certainty within\\n\\t\\t\\t\\thuman limits: these are \"for those of assured Faith\"."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "5",
    "NoteID": "4739",
    "Body": "(3) These are our daily experiences from external things,\\n\\t\\t\\t\\tbut they affect us and our lives intimately: here are\\n\\t\\t\\t\\tquestions of deductions \"for those that are wise.\""
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "5",
    "NoteID": "4740",
    "Body": "\"Sustenance\" is almost equivalent here to \"rain\". And\\n\\t\\t\\t\\t\"rain\" itself, and its revival of a dead earth, refer\\n\\t\\t\\t\\tsymbolically to Revelation and its putting new life into\\n\\t\\t\\t\\ta dead soul. Similarly the alternation of Night and Day,\\n\\t\\t\\t\\tand the change of the winds, besides being Signs as\\n\\t\\t\\t\\twonderful phenomena of Nature, refer to spiritual\\n\\t\\t\\t\\tignorance and knowledge, rest and activity, and the\\n\\t\\t\\t\\tconstant beneficent changes that are going on in the\\n\\t\\t\\t\\tworld, making for the spread of the blessing of Allah's\\n\\t\\t\\t\\tRevelation."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "6",
    "NoteID": "4741",
    "Body": "If there are any to whom the Signs from Nature, from\\n\\t\\t\\t\\twithin their own heart and conscience, and from the voice\\n\\t\\t\\t\\tof Revelation, are not enough to convince them, what\\n\\t\\t\\t\\tpossible kind of exposition will they accept?"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "7",
    "NoteID": "4742",
    "Body": "A soul so dead, as described in the last note, is indeed\\n\\t\\t\\t\\twretched. It will resort to falsehoods, in worship, in\\n\\t\\t\\t\\tconduct, and in its attitude towards Allah. It will be\\n\\t\\t\\t\\tobstinate, and pretend to be 'above such things'. It will\\n\\t\\t\\t\\thear the most beautiful Message but not profit by it. The\\n\\t\\t\\t\\tloss or punishment is its own, and grievous it is!"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "9",
    "NoteID": "4743",
    "Body": "Note that in each of the verses 8-11 the Penalty is\\n\\t\\t\\t\\tcharacterised by a certain description, which accords\\n\\t\\t\\t\\twith the crime. (1) In verse 8, the man is arrogant about\\n\\t\\t\\t\\tthe Signs of Allah's love and care all around him, and\\n\\t\\t\\t\\this Penalty is \"grievous\". (2) In verse 9, he ridicules\\n\\t\\t\\t\\tAllah's Signs, and his Penalty is \"humiliating\": he makes\\n\\t\\t\\t\\thimself a ridiculous fool, (3) and (4) are described in\\n\\t\\t\\t\\tthe two following notes."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "10",
    "NoteID": "4744",
    "Body": "(3) In verse 10 the sinner has piled up the good things\\n\\t\\t\\t\\tof this life, and thinks he has got plenty of helpers and\\n\\t\\t\\t\\tprotectors, but all these things are of no use. On the\\n\\t\\t\\t\\tcontrary, his Penalty will be \"tremendous\", to correspond\\n\\t\\t\\t\\twith the great pains which he has taken to multiply the\\n\\t\\t\\t\\tgods of his worship."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "11",
    "NoteID": "4745",
    "Body": "(4) In verse 11, he has flouted and rejected the specific\\n\\t\\t\\t\\tguidance that came to him from the Word of Allah, or from\\n\\t\\t\\t\\tthe admonition of a prophet of Allah. His Penalty is a\\n\\t\\t\\t\\tpenalty of abomination: he earns unspeakable horror and\\n\\t\\t\\t\\tabomination from all the Righteous, and is an unclean\\n\\t\\t\\t\\tobject in the Kingdom of Heaven."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "12",
    "NoteID": "4746",
    "Body": "Cf. xvi. 14 and notes thereon, especially n. 2037. The\\n\\t\\t\\t\\tone encircling ocean of our globe is one of the most\\n\\t\\t\\t\\tsignificant facts in our physical geography. Its salt\\n\\t\\t\\t\\twater is an agent of global sanitation. The salubrious\\n\\t\\t\\t\\teffects of sea-air, with its ozone, are well known to\\n\\t\\t\\t\\teveryone who has recouped his health by its means. Thanks\\n\\t\\t\\t\\tto ships, the sea unites rather than divides:\\n\\t\\t\\t\\tcommunications are, and have always been, more active\\n\\t\\t\\t\\tbetween sea-coast towns than further inland. They thus\\n\\t\\t\\t\\tfurther human intercourse, and help us to seek the\\n\\t\\t\\t\\t\"Bounty of Allah\", not only in a commercial but in an\\n\\t\\t\\t\\tintellectual and spiritual sense. All this is through\\n\\t\\t\\t\\t\"Allah's command\" i.e., by His beneficent ordering of the\\n\\t\\t\\t\\tuniverse, and we should be grateful."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "13",
    "NoteID": "4747",
    "Body": "Cf. xxxi. 20, and n. 3605. The sea was only one example\\n\\t\\t\\t\\tof Allah's cherishing care in making all things in nature\\n\\t\\t\\t\\tavailable for the use of man, through the genius and\\n\\t\\t\\t\\tfaculties which He has given to man. Man should never\\n\\t\\t\\t\\tforget that it is all \"as from Him\", i.e., from Allah."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "14",
    "NoteID": "4748",
    "Body": "Cf. xiv: 5."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "14",
    "NoteID": "4749",
    "Body": "Allah will give due recompense for good or evil according\\n\\t\\t\\t\\tto His own full Knowledge and righteous Plan, and in His\\n\\t\\t\\t\\town good time."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "14",
    "NoteID": "4750",
    "Body": "\"People\" here may be taken to be a group of common\\n\\t\\t\\t\\tcharacteristics, e.g., the righteous in contrast with the\\n\\t\\t\\t\\tunrighteous, the oppressed in contrast with the\\n\\t\\t\\t\\toppressors, and so on."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "15",
    "NoteID": "4751",
    "Body": "Ordinarily good and evil come to their own even in this\\n\\t\\t\\t\\tworld; but in any case there is the final Judgment before\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "16",
    "NoteID": "4752",
    "Body": "The argument here is similar to that in xliv. 32-33 but;\\n\\t\\t\\t\\tit is more particularised here. Israel had the Revelation\\n\\t\\t\\t\\tgiven through Moses, the power of judgment and command\\n\\t\\t\\t\\tthrough the Kingdom of David and Solomon, and numerous\\n\\t\\t\\t\\tprophetic warnings through such men as Isaiah and\\n\\t\\t\\t\\tJeremiah."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "16",
    "NoteID": "4753",
    "Body": "\"Sustenance\". The Mosaic Law laid down rules of diet,\\n\\t\\t\\t\\texcluding things unclean, and it laid down rules for a\\n\\t\\t\\t\\tpure and honourable life. In this way Israel became the\\n\\t\\t\\t\\tstandard-bearer of Allah's law, thus \"favoured above the\\n\\t\\t\\t\\tnations\"."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "17",
    "NoteID": "4754",
    "Body": "Cf. x. 93. The Jews were the more to blame that they fell\\n\\t\\t\\t\\tfrom Grace after all the divine favours which they had\\n\\t\\t\\t\\tenjoyed. Their schisms and differences arose from mutual\\n\\t\\t\\t\\tenvy, which was rebellious insolence against Allah. As\\n\\t\\t\\t\\tthe next verse shows, some of them (not all) rejected the\\n\\t\\t\\t\\tmission of the holy Prophet, also through envy that a\\n\\t\\t\\t\\tProphet had come among the Arabians."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "17",
    "NoteID": "4755",
    "Body": "Cf. ii. 90, and that whole passage, with its notes."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "18",
    "NoteID": "4756",
    "Body": "Shari'at is best translated the \"right Way of Religion\",\\n\\t\\t\\t\\twhich is wider than the mere formal rites and legal\\n\\t\\t\\t\\tprovisions, which mostly came in the Madinah period, long\\n\\t\\t\\t\\tafter this Makkan verse had been revealed."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "19",
    "NoteID": "4757",
    "Body": "That is, in the service of Allah. Ignorant and\\n\\t\\t\\t\\tcontentious men are of no use or service to any Cause.\\n\\t\\t\\t\\tThe more you seek their help, the more do their ignorance\\n\\t\\t\\t\\tand their contentiousness increase their own importance\\n\\t\\t\\t\\tin their own eyes. Evil protects (or thinks it protects)\\n\\t\\t\\t\\tevil: it has really no power of protection at all, for\\n\\t\\t\\t\\titself or for others. The righteous seek the protection\\n\\t\\t\\t\\tof Allah, Who can and will protect them."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "20",
    "NoteID": "4758",
    "Body": "The evidences of Allah's Signs should be clear to all\\n\\t\\t\\t\\tmen: to men of Faith, who accept Allah's Grace, they are\\n\\t\\t\\t\\ta Guide and a Mercy."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "21",
    "NoteID": "4759",
    "Body": "Three meanings can be deduced. (1) The evil ones are not\\n\\t\\t\\t\\tin Allah's sight li ke the righteous ones; neither in\\n\\t\\t\\t\\tlife nor in death are they equal; in life the righteous\\n\\t\\t\\t\\tare guided by Allah and receive His Grace, and after\\n\\t\\t\\t\\tdeath His Mercy, while the others reject His Grace, and\\n\\t\\t\\t\\tafter death receive condemnation. (2) Neither are the two\\n\\t\\t\\t\\tthe same in this life and in the after-life; if the\\n\\t\\t\\t\\twicked flourish here, they will be condemned in the\\n\\t\\t\\t\\tHereafter; if the good are in suffering or sorrow here,\\n\\t\\t\\t\\tthey will receive comfort and consolation in the\\n\\t\\t\\t\\tHereafter. (3) The real life of the righteous is not like\\n\\t\\t\\t\\tthe nominal life of the wicked, which is really death;\\n\\t\\t\\t\\tnor is the physical death of the righteous, which will\\n\\t\\t\\t\\tbring them into etemal life, like the terrible death of\\n\\t\\t\\t\\tthe wicked which will bring them to eternal misery."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "22",
    "NoteID": "4760",
    "Body": "Cf. xliv. 38-39, and n. 4717. The government of the world\\n\\t\\t\\t\\tis so ordered that each soul gets every chance for its\\n\\t\\t\\t\\tfull development, and it reaps the fruit of all its\\n\\t\\t\\t\\tactivities. If it breaks away from Allah's Grace, it\\n\\t\\t\\t\\tsuffers, but no injustice is done to anyone: on the\\n\\t\\t\\t\\tcontrary Allah's Bounty is always beyond man's deserts."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "23",
    "NoteID": "4761",
    "Body": "If a man follows, not the laws of Allah, which are also\\n\\t\\t\\t\\tthe laws of his own pure nature as made by Allah, but the\\n\\t\\t\\t\\tdesires of his own distorted self, as shaped by the\\n\\t\\t\\t\\trebellion of his will, the inevitable consequence will be\\n\\t\\t\\t\\tthe withdrawal of Allah's grace and guidance. All his\\n\\t\\t\\t\\tfaculties will then be debased, and there will be nothing\\n\\t\\t\\t\\tto guide him, unless he turns in repentance again to\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "23",
    "NoteID": "4762",
    "Body": "Cf. ii. 7 and notes."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "24",
    "NoteID": "4763",
    "Body": "Cf. xxiii. 37, and n. 2896. The additional touch here,\\n\\t\\t\\t\\t\"And nothing but Time can destroy us\", suggests the\\n\\t\\t\\t\\tmaterialist philosophy that Matter and Time are eternal\\n\\t\\t\\t\\tbackwards and forwards; and possibly also that though\\n\\t\\t\\t\\teach individual perishes, the race lasts till Time\\n\\t\\t\\t\\tdestroys it. This is not knowledge but conjecture. Why\\n\\t\\t\\t\\tnot accept light from Him Who knows all."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "25",
    "NoteID": "4764",
    "Body": "Cf. xliv. 36. It is no argument to say, \"If there is a\\n\\t\\t\\t\\tfuture life, bring back our forefathers and let us see\\n\\t\\t\\t\\tthem here and now!\" It is not for a man to raise the dead\\n\\t\\t\\t\\twhen and where he pleases. It is for Allah to command.\\n\\t\\t\\t\\tAnd His promise is about the general Resurrection for the\\n\\t\\t\\t\\tDay of Judgment. In His hands are the keys of life and\\n\\t\\t\\t\\tdeath."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "27",
    "NoteID": "4765",
    "Body": "These vain wranglers about the future life and deniers of\\n\\t\\t\\t\\tthe Truth may have a run in this fleeting world; but the\\n\\t\\t\\t\\tmoment the world of Reality is established, they will see\\n\\t\\t\\t\\twhat they now deny. The facts will destroy their fancies,\\n\\t\\t\\t\\tand they themselves will find themselves humiliated and\\n\\t\\t\\t\\tlost, for having deliberately ignored Allah's Signs and\\n\\t\\t\\t\\tacted on opposition to His holy Will."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "28",
    "NoteID": "4766",
    "Body": "Bowing the knee: the key-phrase of the Sura, and its\\n\\t\\t\\t\\ttitle. Cf. xix. 72. Whatever the arrogance of the wicked\\n\\t\\t\\t\\tmay be in this life, whatever exclusive sects and\\n\\t\\t\\t\\tdivisions they may form, in this life, the time will come\\n\\t\\t\\t\\twhen they will humbly submit and bow the knee to the\\n\\t\\t\\t\\tTruth. Before Allah, when their Record is produced, they\\n\\t\\t\\t\\tmust necessarily be dumb."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "29",
    "NoteID": "4767",
    "Body": "Cf. xliii. 80. Nothing misses the Recording Angel, and\\n\\t\\t\\t\\twhatever is said in the Record is true."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "30",
    "NoteID": "4768",
    "Body": "The attainment and satisfaction of all hopes and desires;\\n\\t\\t\\t\\tthe reaching of the final goal of Bliss. Cf. xliv. 57,\\n\\t\\t\\t\\tand n. 47 33."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "32",
    "NoteID": "4769",
    "Body": "There is arrogance as well as untruth in this pretence.\\n\\t\\t\\t\\tThe coming of Judgment has been proclaimed times out of\\n\\t\\t\\t\\tnumber by every prophet of Allah. They cannot dismiss it\\n\\t\\t\\t\\tas a mere idea or superstition. Their object is merely an\\n\\t\\t\\t\\tostentatious and lofty rejection of Faith."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "33",
    "NoteID": "4770",
    "Body": "Cf. xi. 8. Their mockery will be turned against\\n\\t\\t\\t\\tthemselves, for they will be hemmed in by the very\\n\\t\\t\\t\\tRealities which they had ignored or doubted or laughed\\n\\t\\t\\t\\tat."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "34",
    "NoteID": "4771",
    "Body": "Cf. vii. 51 and n. 1029. \"Forget\" is of course\\n\\t\\t\\t\\tmetaphorical for \"deliberately to ignore\"."
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "35",
    "NoteID": "4772",
    "Body": "It is implied that 'you deliberately allowed yourselves\\n\\t\\t\\t\\tto be deceived by the vanities of this world', or 'that\\n\\t\\t\\t\\tyou put yourselves into a position where you were\\n\\t\\t\\t\\tdeceived, for you were expressly warned against Evil.'"
  },
  {
    "SurahNumber": "45",
    "AyahNumber": "36",
    "NoteID": "4773",
    "Body": "The argument having been completed about the fruits of\\n\\t\\t\\t\\tthis life being reaped in the Ma'ad, or the Hereafter,\\n\\t\\t\\t\\twhen perfect balance will be restored and perfect Justice\\n\\t\\t\\t\\twill reign supreme, the Sura closes with praise and glory\\n\\t\\t\\t\\tto Allah, Who is not only Omnipotent but is full of\\n\\t\\t\\t\\tWisdom, and cherishes and cares for all His creation. We\\n\\t\\t\\t\\tbegan with the remembrance of His Revelation and Mercy,\\n\\t\\t\\t\\tand we close with the celebration of His goodness, power,\\n\\t\\t\\t\\tand wisdom. Note how the argument is rounded off by the\\n\\t\\t\\t\\treminiscence of the last clause of the second verse of\\n\\t\\t\\t\\tthis Sura."
  }
]
