[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "35",
        "bookName": "Book of Sacrifices",
        "bookNameArabic": "كتاب الأضاحي",
        "hadiths": [
            {
                "hadithNo": "5064",
                "chapterNo": "1",
                "hadithEnglish": "Jundab bin Sufyan said: \"I was present at ('Eid) Al-Adha with the Messenger of Allah (s.a.w), and no sooner had he finished his prayer, and said the Salam, but he saw the meat of some sacrifices that had been slaughtered before he had finished his prayer. He said: 'Whoever offered his sacrifice before the prayer - or before we prayed - let him offer another one in its stead, and whoever did not yet offer his sacrifice, let him offer it in the Name of Allah.\"'",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ ، حَدَّثَنَا زُهَيْرٌ ، حَدَّثَنَا الأَسْوَدُ بْنُ قَيْسٍ (ح) وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا أَبُو خَيْثَمَةَ ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ ، حَدَّثَنِي جُنْدَبُ بْنُ سُفْيَانَ ، قَالَ: شَهِدْتُ الأَضْحَى مَعَ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَلَمْ يَعْدُ أَنْ صَلَّى وَفَرَغَ مِنْ صَلاَتِهِ سَلَّمَ ، فَإِذَا هُوَ يَرَى لَحْمَ أَضَاحِيَّ قَدْ ذُبِحَتْ قَبْلَ أَنْ يَفْرُغَ مِنْ صَلاَتِهِ ، فَقَالَ: مَنْ كَانَ ذَبَحَ أُضْحِيَّتَهُ قَبْلَ أَنْ يُصَلِّيَ ، أَوْ نُصَلِّيَ ، فَلْيَذْبَحْ مَكَانَهَا أُخْرَى ، وَمَنْ كَانَ لَمْ يَذْبَحْ ، فَلْيَذْبَحْ بِاسْمِ اللَّهِ."
            },
            {
                "hadithNo": "5065",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Jundab bin Sufyan said: \"I was present at ('Eid) Al-Adha with the Messenger of Allah (s.a.w), and when he had finished leading the people in prayer, he looked towards some sheep that had been slaughtered and said: 'Whoever slaughtered (his sacrifice) before the prayer, let him slaughter a sheep in its stead, and whoever has not yet slaughtered (his sacrifice), let him slaughter it in the Name of Allah.\"'",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا أَبُو الأَحْوَصِ سَلاَّمُ بْنُ سُلَيْمٍ ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ ، عَنْ جُنْدَبِ بْنِ سُفْيَانَ ، قَالَ : شَهِدْتُ الأَضْحَى مَعَ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَلَمَّا قَضَى صَلاَتَهُ بِالنَّاسِ نَظَرَ إِلَى غَنَمٍ قَدْ ذُبِحَتْ ، فَقَالَ: مَنْ ذَبَحَ قَبْلَ الصَّلاَةِ ، فَلْيَذْبَحْ شَاةً مَكَانَهَا ، وَمَنْ لَمْ يَكُنْ ذَبَحَ ، فَلْيَذْبَحْ عَلَى اسْمِ اللَّهِ."
            },
            {
                "hadithNo": "5066",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Al-Aswad bin Qais with this chain of narrators, and he said: \"In the Name of Allah,\" like the Hadith of Abul-Ahwas.",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا أَبُو عَوَانَةَ (ح) وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، وَابْنُ أَبِي عُمَرَ ، عَنِ ابْنِ عُيَيْنَةَ ، كِلاَهُمَا عَنِ الأَسْوَدِ بْنِ قَيْسٍ ، بِهَذَا الإِسْنَادِ ، وَقَالاَ : عَلَى اسْمِ اللهِ كَحَدِيثِ أَبِي الأَحْوَصِ."
            },
            {
                "hadithNo": "5067",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Al-Aswad (that he) heard Jundab Al-Bajali say: \"I saw the Messenger of Allah (s.a.w) pray on the day of ('Eid) Al-Adha, then he delivered the Khutbah and said: 'Whoever offered his sacrifice before praying, let him offer another in its stead, and whoever has not offered the sacrifice, let him slaughter it in the Name of Allah.\"'",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا شُعْبَةُ ، عَنِ الأَسْوَدِ ، سَمِعَ جُنْدَبًا الْبَجَلِيَّ ، قَالَ: شَهِدْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ أَضْحًى ، ثُمَّ خَطَبَ ، فَقَالَ: مَنْ كَانَ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ ، فَلْيُعِدْ مَكَانَهَا ، وَمَنْ لَمْ يَكُنْ ذَبَحَ ، فَلْيَذْبَحْ بِاسْمِ اللَّهِ."
            },
            {
                "hadithNo": "5068",
                "chapterNo": "1",
                "hadithEnglish": "Shu'bah narrated a similar report (as no. 5067) with this chain of narrators.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، وَابْنُ بَشَّارٍ ، قَالاَ : حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "5069",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Al-Bara' said: \"My maternal uncle Abu Burdah offered his sacrifice before the prayer, and the Messenger of Allah (s.a.w) said: 'That is just a sheep for meat.' He said: 'O Messenger of Allah, I have a Jadh'ah goat.' He said: 'Offer it as a sacrifice, but that will not suffice for anyone but you.' Then he said: 'Whoever offered the sacrifice before the prayer has only slaughtered it for himself, but whoever offers the sacrifice after the prayer has completed his rituals and done it according to the Sunnah of the Muslims.\"'",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللهِ ، عَنْ مُطَرِّفٍ ، عَنْ عَامِرٍ ، عَنِ الْبَرَاءِ ، قَالَ : ضَحَّى خَالِي أَبُو بُرْدَةَ قَبْلَ الصَّلاَةِ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: تِلْكَ شَاةُ لَحْمٍ ، فَقَالَ: يَا رَسُولَ اللهِ ، إِنَّ عِنْدِي جَذَعَةً مِنَ الْمَعْزِ ، فَقَالَ: ضَحِّ بِهَا ، وَلاَ تَصْلُحُ لِغَيْرِكَ ، ثُمَّ قَالَ: مَنْ ضَحَّى قَبْلَ الصَّلاَةِ ، فَإِنَّمَا ذَبَحَ لِنَفْسِهِ ، وَمَنْ ذَبَحَ بَعْدَ الصَّلاَةِ فَقَدْ تَمَّ نُسُكُهُ ، وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ."
            },
            {
                "hadithNo": "5070",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Al-Bara' bin 'Azib that his maternal uncle Abu Burdah bin Niyar slaughtered (his sacrifice) before the Messenger of Allah (s.a.w) did, and he said: \"O Messenger of Allah, this is a day when meat is not desirable so I hastened to offer my sacrifice in order to feed my family and neighbors and household.\" The Messenger of Allah (s.a.w) said: \"Repeat your sacrifice.\" He said: \"O Messenger of Allah, I have a weanling female goat that is better than two sheep for meat.\" He said: \"It is the best of your sacrifice - but no Jadh'ah will suffice for anyone after you.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا هُشَيْمٌ ، عَنْ دَاوُدَ ، عَنِ الشَّعْبِيِّ ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ، أَنَّ خَالَهُ أَبَا بُرْدَةَ بْنَ نِيَارٍ ، ذَبَحَ قَبْلَ أَنْ يَذْبَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ: يَا رَسُولَ اللهِ ، إِنَّ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ ، وَإِنِّي عَجَّلْتُ نَسِيكَتِي لِأُطْعِمَ أَهْلِي وَجِيرَانِي وَأَهْلَ دَارِي ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَعِدْ نُسُكًا ، فَقَالَ: يَا رَسُولَ اللهِ ، إِنَّ عِنْدِي عَنَاقَ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَيْ لَحْمٍ ، فَقَالَ: هِيَ خَيْرُ نَسِيكَتَيْكَ ، وَلاَ تَجْزِي جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ."
            },
            {
                "hadithNo": "5071",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Al-Bara' bin 'Azib said: \"The Messenger of Allah (s.a.w) addressed us on the Day of Sacrifice and said: 'No one should offer the sacrifice until we have prayed.' My maternal uncle said: 'O Messenger of Alla.h, this is a day when meat is not desirable,\"' and he narrated a Hadith like that of Hushaim (no. 5070).",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ ، عَنْ دَاوُدَ ، عَنِ الشَّعْبِيِّ ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ، قَالَ: خَطَبَنَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ ، فَقَالَ: لاَ يَذْبَحَنَّ أَحَدٌ حَتَّى نُصَلِّيَ ، قَالَ : فَقَالَ خَالِي: يَا رَسُولَ اللهِ ، إِنَّ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ ... ، ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ هُشَيْمٍ."
            },
            {
                "hadithNo": "5072",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Al-Bara' said: \"The Messenger of Allah (s.a.w) said: 'Whoever prays as we do, faces the same Qiblah as we do and offers the same sacrifice as we do, let him not slaughter (his sacrifice) until he has prayed.' My maternal uncle said: 'O Messenger of Allah, I have offered a sacrifice on behalf of a son of mine.' He said: 'That is something that you have hastened to do for your family.' He said: 'I have a sheep that is better than two other sheep.' He said: 'Sacrifice it, for it is the better of the two.\"'",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ (ح) وحَدَّثَنَا ابْنُ نُمَيْرٍ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا زَكَرِيَّا ، عَنْ فِرَاسٍ ، عَنْ عَامِرٍ ، عَنِ الْبَرَاءِ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ صَلَّى صَلاَتَنَا ، وَوَجَّهَ قِبْلَتَنَا ، وَنَسَكَ نُسُكَنَا ، فَلاَ يَذْبَحْ حَتَّى يُصَلِّيَ ، فَقَالَ خَالِي: يَا رَسُولَ اللهِ ، قَدْ نَسَكْتُ عَنِ ابْنٍ لِي ، فَقَالَ: ذَاكَ شَيْءٌ عَجَّلْتَهُ لأَهْلِكَ ، فَقَالَ: إِنَّ عِنْدِي شَاةً خَيْرٌ مِنْ شَاتَيْنِ ، قَالَ: ضَحِّ بِهَا ، فَإِنَّهَا خَيْرُ نَسِيْكَتِهِ."
            },
            {
                "hadithNo": "5073",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Al-Bara' bin 'Azib said: \"The Messenger of Allah (s.a.w) said: 'The first thing with which we begin on this day (the day of 'Eid) of ours is the prayer; we pray, then we go back and offer the sacrifice. Whoever does that has attained our Sunnah, and whoever has already slaughtered (the sacrificial animal), that is just meat that he has given to his family, and there is nothing of the sacrifice in it.' Abu Burdah bin Niyar had already slaughtered (his sacrificial animal) and he said: 'I have a Jadh'ah that is better than a Musinnah.' He (s.a.w) said: 'Slaughter it, but it will not will not suffice for anyone else after you.\"'",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، وَابْنُ بَشَّارٍ ، وَاللَّفْظُ لاِبْنِ الْمُثَنَّى ، قَالاَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ زُبَيْدٍ الإِيَامِيِّ ، عَنِ الشَّعْبِيِّ ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ أَوَّلَ مَا نَبْدَأُ بِهِ فِي يَوْمِنَا هَذَا نُصَلِّي ، ثُمَّ نَرْجِعُ فَنَنْحَرُ ، فَمَنْ فَعَلَ ذَلِكَ ، فَقَدْ أَصَابَ سُنَّتَنَا ، وَمَنْ ذَبَحَ ، فَإِنَّمَا هُوَ لَحْمٌ قَدَّمَهُ لأَهْلِهِ لَيْسَ مِنَ النُّسُكِ فِي شَيْءٍ ، وَكَانَ أَبُو بُرْدَةَ بْنُ نِيَارٍ قَدْ ذَبَحَ ، فَقَالَ: عِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ ، فَقَالَ: اذْبَحْهَا وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ."
            },
            {
                "hadithNo": "5074",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 5073) was narrated from Al-Bara' bin 'Azib, from the Prophet (s.a.w).",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا شُعْبَةُ ، عَنْ زُبَيْدٍ ، سَمِعَ الشَّعْبِيَّ ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ."
            },
            {
                "hadithNo": "5075",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Al-Bara' bin 'Azib said: \"The Messenger of Allah (s.a.w) addressed us on the Day of Sacrifice after the prayer...\" then he mentioned a similar Hadith (as no. 5073).",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، وَهَنَّادُ بْنُ السَّرِيِّ ، قَالاَ : حَدَّثَنَا أَبُو الأَحْوَصِ (ح) وحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ ، جَمِيعًا عَنْ جَرِيرٍ ، كِلاَهُمَا عَنْ مَنْصُورٍ ، عَنِ الشَّعْبِيِّ ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ، قَالَ : خَطَبَنَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بَعْدَ الصَّلاَةِ ... ، ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ."
            },
            {
                "hadithNo": "5076",
                "chapterNo": "1",
                "hadithEnglish": "Al-Bara' bin 'Azib narrated: \"The Messenger of Allah (s.a.w) addressed us on the Day of Sacrifice and said: 'No one should offer the sacrifice until he has prayed.' A man said: 'I have a weanling female goat that is better than two sheep for meat.' He said: \"Sacrifice it, but no Jadh'ah will suffice for anyone after you.\"",
                "hadithArabic": "وحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ ، حَدَّثَنَا أَبُو النُّعْمَانِ عَارِمُ بْنُ الْفَضْلِ ، حَدَّثَنَا عَبْدُ الْوَاحِدِ ، يَعْنِي ابْنَ زِيَادٍ ، حَدَّثَنَا عَاصِمٌ الأَحْوَلُ ، عَنِ الشَّعْبِيِّ ، حَدَّثَنِي الْبَرَاءُ بْنُ عَازِبٍ ، قَالَ: خَطَبَنَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ نَحْرٍ ، فَقَالَ: لاَ يُضَحِّيَنَّ أَحَدٌ حَتَّى يُصَلِّيَ ، قَالَ رَجُلٌ: عِنْدِي عَنَاقُ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَيْ لَحْمٍ ، قَالَ: فَضَحِّ بِهَا ، وَلاَ تَجْزِي جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ."
            },
            {
                "hadithNo": "5077",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Al-Bara' bin 'Azib said: \"Abu Burdah slaughtered (his sacrificial animal) before the prayer, and the Messenger of Allah (s.a.w) said: 'Offer something else in its stead.' He said: 'O Messenger of Allah, I do not have anything but a Jadh'ah\"' - Shu'bah said: \"And I think he said - 'which is better than a Musinnah.\"' The Messenger of Allah (s.a.w) said: \"Offer it in its stead, but it will not suffice for anyone after you.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ ، حَدَّثَنَا مُحَمَّدٌ ، يَعْنِي ابْنَ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ سَلَمَةَ ، عَنْ أَبِي جُحَيْفَةَ ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ ، قَالَ: ذَبَحَ أَبُو بُرْدَةَ قَبْلَ الصَّلاَةِ ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَبْدِلْهَا ، فَقَالَ: يَا رَسُولَ اللهِ ، لَيْسَ عِنْدِي إِلاَّ جَذَعَةٌ ، قَالَ شُعْبَةُ: وَأَظُنُّهُ قَالَ ، وَهِيَ خَيْرٌ مِنْ مُسِنَّةٍ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: اجْعَلْهَا مَكَانَهَا ، وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَ."
            },
            {
                "hadithNo": "5078",
                "chapterNo": "1",
                "hadithEnglish": "Shu'bah narrated it with this chain of narrators (a Hadith similar to no. 5077), but he did not mention the doubt about whether he said: \"It is better than a Musinnah.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى ، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ (ح) وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ ، حَدَّثَنَا شُعْبَةُ ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرِ الشَّكَّ فِي قَوْلِهِ: هِيَ خَيْرٌ مِنْ مُسِنَّةٍ."
            },
            {
                "hadithNo": "5079",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Anas said: \"The Messenger of Allah (s.a.w) said on the Day of Sacrifice: 'Whoever slaughtered (his sacrificial animal) before the prayer, let him repeat it.' A man stood up and said: 'O Messenger of Allah, this is a day on which people want meat, and he mentioned the need of his neighbor - as if the Messenger of Allah ~ agreed with him - and I have a Jadh 'ah that is dearer to me than two sheep for meat, can I slaughter it (as a sacrifice)?' He granted him a concession (allowing him to do that).\" He (the narrator) said: \"I do not know whether that concession applied to others or not.\" He said: \"Then the Messenger of Allah (s.a.w) turned towards two rams and slaughtered them, and the people turned towards some sheep and distributed, or he said; divided them.\"",
                "hadithArabic": "وحَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ ، وَعَمْرٌو النَّاقِدُ ، وَزُهَيْرُ بْنُ حَرْبٍ ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ ، وَاللَّفْظُ لِعَمْرٍو ، قَالَ: حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ ، عَنْ أَيُّوبَ ، عَنْ مُحَمَّدٍ ، عَنْ أَنَسٍ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ: مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلاَةِ فَلْيُعِدْ ، فَقَامَ رَجُلٌ ، فَقَالَ: يَا رَسُولَ اللهِ ، هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ ، وَذَكَرَ هَنَةً مِنْ جِيرَانِهِ ، كَأَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَّقَهُ ، قَالَ: وَعِنْدِي جَذَعَةٌ هِيَ أَحَبُّ إِلَيَّ مِنْ شَاتَيْ لَحْمٍ ، أَفَأَذْبَحُهَا ؟ قَالَ: فَرَخَّصَ لَهُ ، فَقَالَ: لاَ أَدْرِي أَبَلَغَتْ رُخْصَتُهُ مَنْ سِوَاهُ أَمْ لاَ ، قَالَ: وَانْكَفَأَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى كَبْشَيْنِ فَذَبَحَهُمَا ، فَقَامَ النَّاسُ إِلَى غُنَيْمَةٍ فَتَوَزَّعُوهَا ، أَوْ قَالَ : فَتَجَزَّعُوهَا."
            },
            {
                "hadithNo": "5080",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Anas bin Malik that the Messenger of Allah (s.a.w) prayed then delivered the Khutbah, and he ordered those who had slaughtered (their sacrificial animals) before the prayer to repeat (the sacrifice)... then he mentioned a Hadith like that of Ibn 'Ulayyah (no. 5079).",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، حَدَّثَنَا أَيُّوبُ ، وَهِشَامٌ ، عَنْ مُحَمَّدٍ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى ، ثُمَّ خَطَبَ، فَأَمَرَ مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلاَةِ أَنْ يُعِيدَ ذِبْحًا، ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ."
            },
            {
                "hadithNo": "5081",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Anas bin Malik said: The Messenger of Allah (s.a.w) addressed us on the day of ('Eid) Al-Adha and he noticed the smell of meat. He forbade them to slaughter (the sacrifice) and said: \"Whoever has already offered the sacrifice, let him repeat it.\" Then he mentioned a similar Hadith.",
                "hadithArabic": "وحَدَّثَنِي زِيَادُ بْنُ يَحْيَى الْحَسَّانِيُّ ، حَدَّثَنَا حَاتِمٌ ، يَعْنِي ابْنَ وَرْدَانَ ، حَدَّثَنَا أَيُّوبُ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ: خَطَبَنَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أَضْحًى ، قَالَ: فَوَجَدَ رِيحَ لَحْمٍ ، فَنَهَاهُمْ أَنْ يَذْبَحُوا ، قَالَ: مَنْ كَانَ ضَحَّى فَلْيُعِدْ ، ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِهِمَا."
            },
            {
                "hadithNo": "5082",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Jabir said: \"The Messenger of Allah (s.a.w) said: 'Do not slaughter anything but Musinnah, unless it is too difficult for you, in which case slaughter a Jadh'ah.\"",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ ، حَدَّثَنَا زُهَيْرٌ ، حَدَّثَنَا أَبُو الزُّبَيْرِ ، عَنْ جَابِرٍ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: لاَ تَذْبَحُوا إِلاَّ مُسِنَّةً ، إِلاَّ أَنْ يَعْسُرَ عَلَيْكُمْ ، فَتَذْبَحُوا جَذَعَةً مِنَ الضَّأْنِ."
            },
            {
                "hadithNo": "5083",
                "chapterNo": "2",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"The Prophet (s.a.w) led us in prayer on the Day of Nahr in Al-Madinah, and some men went and offered their Nahr, thinking that the Prophet (s.a.w) had offered his Nahr. The Prophet (s.a.w) ordered those who had offered their Nahr before him to repeat it with another Nahr, and not to offer their Nahr until the Prophet (s.a.w) had done so.\"",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ ، أَخْبَرَنَا ابْنُ جُرَيْجٍ ، أَخْبَرَنِي أَبُو الزُّبَيْرِ ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ ، يَقُولُ : صَلَّى بِنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بِالْمَدِينَةِ ، فَتَقَدَّمَ رِجَالٌ فَنَحَرُوا ، وَظَنُّوا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَحَرَ ، فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ نَحَرَ قَبْلَهُ أَنْ يُعِيدَ بِنَحْرٍ آخَرَ ، وَلاَ يَنْحَرُوا حَتَّى يَنْحَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
            },
            {
                "hadithNo": "5084",
                "chapterNo": "2",
                "hadithEnglish": "It ,was narrated from 'Uqbah bin 'Amir that the Messenger of Allah (s.a.w) gave him some sheep to distribute among his Companions as sacrifices, and there a young goat remained. He mentioned it to the Messenger of Allah (s.a.w) and he said: \"Sacrifice it yourself.\"",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا لَيْثٌ (ح) وحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ ، أَخْبَرَنَا اللَّيْثُ ، عَنْ يَزِيدَ بْنِ أَبِى حَبِيبٍ ، عَنْ أَبِي الْخَيْرِ ، عَنْ عُقْبَةَ بْنِ عَامِرٍ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى أَصْحَابِهِ ضَحَايَا ، فَبَقِيَ عَتُودٌ ، فَذَكَرَهُ لِرَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ: ضَحِّ بِهِ أَنْتَ. قَالَ قُتَيْبَةُ : عَلَى صَحَابَتِهِ."
            },
            {
                "hadithNo": "5085",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Uqbah bin 'Amir Al-Juhani said: \"The Messenger of Allah (s.a.w) distributed some sacrificial animals among us, and I got a Jadh'ah. I said: 'O Messenger of Allah, I have got a Jadh'ah.' He said: 'Sacrifice it.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ، عَنْ هِشَامٍ الدَّسْتُوَائِيِّ ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ ، عَنْ بَعْجَةَ الْجُهَنِيِّ ، عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ ، قَالَ: قَسَمَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِينَا ضَحَايَا ، فَأَصَابَنِي جَذَعٌ ، فَقُلْتُ: يَا رَسُولَ اللهِ ، إِنَّهُ أَصَابَنِي جَذَعٌ ، فَقَالَ: ضَحِّ بِهِ."
            },
            {
                "hadithNo": "5086",
                "chapterNo": "2",
                "hadithEnglish": "'Uqbah bin 'Amir narrated that the Messenger of Allah (s.a.w) distributed some sacrificial animals among his Companions... a similar report (as no. 5085).",
                "hadithArabic": "وحَدَّثَنِي عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ ، حَدَّثَنَا يَحْيَى ، يَعْنِي ابْنَ حَسَّانَ ، أَخْبَرَنَا مُعَاوِيَةُ ، وَهُوَ ابْنُ سَلاَّمٍ ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ ، أَخْبَرَنِي بَعْجَةُ بْنُ عَبْدِ اللهِ ، أَنَّ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ ، أَخْبَرَهُ أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَسَمَ ضَحَايَا بَيْنَ أَصْحَابِهِ ، بِمِثْلِ مَعْنَاهُ."
            },
            {
                "hadithNo": "5087",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Anas said: \"The Prophet (s.a.w) sacrificed two horned black and white rams; he slaughtered them with his own hand and said the Name of Allah, and said the Takbir, and he placed his foot on their sides.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ قَتَادَةَ ، عَنْ أَنَسٍ ، قَالَ : ضَحَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ ، ذَبَحَهُمَا بِيَدِهِ ، وَسَمَّى وَكَبَّرَ ، وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَا."
            },
            {
                "hadithNo": "5088",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Anas said: \"The Messenger of Allah (s.a.w) sacrificed two horned black and-white rams. I saw him slaughter them with his own hand, and I saw him placing his foot on their sides, and he said the Name of Allah and he said the Takbir.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا وَكِيعٌ ، عَنْ شُعْبَةَ ، عَنْ قَتَادَةَ ، عَنْ أَنَسٍ ، قَالَ: ضَحَّى رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ ، قَالَ: وَرَأَيْتُهُ يَذْبَحُهُمَا بِيَدِهِ ، وَرَأَيْتُهُ وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهِمَا ، قَالَ: وَسَمَّى وَكَبَّرَ."
            },
            {
                "hadithNo": "5089",
                "chapterNo": "3",
                "hadithEnglish": "Shu'bah narrated: \"Qatadah informed me: 'I heard Anas say: \"The Messenger of Allah (s.a.w) sacrificed...\" a similar report (as no. 5088). He said: \"I (the sub narrator) said: 'Did you hear it from Anas?' He said: 'Yes.\"'",
                "hadithArabic": "وحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ ، حَدَّثَنَا خَالِدٌ ، يَعْنِي ابْنَ الْحَارِثِ ، حَدَّثَنَا شُعْبَةُ ، أَخْبَرَنِي قَتَادَةُ ، قَالَ: سَمِعْتُ أَنَسًا ، يَقُولُ: ضَحَّى رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، بِمِثْلِهِ. قَالَ : قُلْتُ : آنْتَ سَمِعْتَهُ مِنْ أَنَسٍ ؟ قَالَ: نَعَمْ."
            },
            {
                "hadithNo": "5090",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as no. 5088) was narrated from Anas from the Prophet (s.a.w), except that he said: \"And he (s.a.w) said: 'Bismillah, Allahu-Akbar (in the Name of Allah, Allah is most Great).'\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ ، عَنْ سَعِيدٍ ، عَنْ قَتَادَةَ ، عَنْ أَنَسٍ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ ، غَيْرَ أَنَّهُ قَالَ: وَيَقُولُ: بِاسْمِ اللهِ وَاللَّهُ أَكْبَرُ."
            },
            {
                "hadithNo": "5091",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from 'Aishah that the Messenger of Allah (s.a.w) ordered that a horned ram, with black legs, a black belly and black around its eyes, be brought for him to sacrifice it. He said to 'Aishah: \"Bring me the knife.\" Then he said: \"Sharpen it on a stone.\" She did that, then he took it and he took the ram and made it lie down, then he slaughtered it and said: \"In the Name of Allah, O Allah, accept it from Muhammad and the family of Muhammad and from the Ummah of Muhammad.\" Then he sacrificed it.",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ ، حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ ، قَالَ: قَالَ حَيْوَةُ: أَخْبَرَنِي أَبُو صَخْرٍ ، عَنْ يَزِيدَ بْنِ قُسَيْطٍ ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ ، عَنْ عَائِشَةَ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِكَبْشٍ أَقْرَنَ يَطَأُ فِي سَوَادٍ ، وَيَبْرُكُ فِي سَوَادٍ ، وَيَنْظُرُ فِي سَوَادٍ ، فَأُتِيَ بِهِ لِيُضَحِّيَ بِهِ ، فَقَالَ لَهَا: يَا عَائِشَةُ ، هَلُمِّي الْمُدْيَةَ ، ثُمَّ قَالَ: اشْحَذِيهَا بِحَجَرٍ ، فَفَعَلَتْ: ثُمَّ أَخَذَهَا ، وَأَخَذَ الْكَبْشَ فَأَضْجَعَهُ ، ثُمَّ ذَبَحَهُ ، ثُمَّ قَالَ: بِاسْمِ اللهِ ، اللَّهُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ ، وَآلِ مُحَمَّدٍ ، وَمِنْ أُمَّةِ مُحَمَّدٍ ، ثُمَّ ضَحَّى بِهِ."
            },
            {
                "hadithNo": "5092",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Rafi' bin Khadij: \"I said: 'O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives.' He (s.a.w) said: 'Slaughter quickly (with whatever) makes the blood flow, and mention the Name of Allah and eat, but do not use teeth and nails. I will explain to you. As for teeth, they are bones, and as for nails, they are the knives of the Abyssinians.' We acquired some camels and sheep, and one of the camels went out of control, and a man shot it with an arrow and brought it under control. The Messenger of Allah (s.a.w) said: 'These camels have the inclination to behave in a wild manner. If one of them overwhelms you, do the same thing.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ، عَنْ سُفْيَانَ ، حَدَّثَنِي أَبِي ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ ، عَنْ رَافِعِ بْنِ خَدِيجٍ ، قُلْتُ: يَا رَسُولَ اللهِ ، إِنَّا لاَقُو الْعَدُوِّ غَدًا ، وَلَيْسَتْ مَعَنَا مُدًى ، قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَعْجِلْ ، أَوْ أَرْنِي ، مَا أَنْهَرَ الدَّمَ ، وَذُكِرَ اسْمُ اللهِ ، فَكُلْ ، لَيْسَ السِّنَّ ، وَالظُّفُرَ ، وَسَأُحَدِّثُكَ ، أَمَّا السِّنُّ فَعَظْمٌ ، وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ ، قَالَ: وَأَصَبْنَا نَهْبَ إِبِلٍ وَغَنَمٍ ، فَنَدَّ مِنْهَا بَعِيرٌ ، فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ لِهَذِهِ الإِبِلِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ ، فَإِذَا غَلَبَكُمْ مِنْهَا شَيْءٌ فَاصْنَعُوا بِهِ هَكَذَا."
            },
            {
                "hadithNo": "5093",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Rafi' bin Khadij said: \"We were with the Messenger of Allah (s.a.w) at Dhul-Hulaifah in Tihamah, and we acquired some sheep and camels. The people rushed (and slaughtered these animals) and started cooking them in pots, but he (s.a.w) ordered that they be overturned, then he made ten sheep equivalent to one camel...\" and he mentioned the rest of the Hadith like the Hadith of Yahya bin Sa'eed (no. 5092).",
                "hadithArabic": "وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا وَكِيعٌ ، حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ ، عَنْ أَبِيهِ ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ ، عَنْ رَافِعِ بْنِ خَدِيجٍ ، قَالَ: كُنَّا مَعَ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ ، فَأَصَبْنَا غَنَمًا وَإِبِلاً ، فَعَجِلَ الْقَوْمُ فَأَغْلَوْا بِهَا الْقُدُورَ ، فَأَمَرَ بِهَا فَكُفِئَتْ ، ثُمَّ عَدَلَ عَشْرًا مِنَ الْغَنَمِ بِجَزُورٍ ، وَذَكَرَ بَاقِيَ الْحَدِيثِ كَنَحْوِ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ."
            },
            {
                "hadithNo": "5094",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from 'Abayah bin Rifa'ah bin Rafi' bin Khadij that his grandfather said: \"We said: 'O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives, so can we use a piece of reed for slaughtering?\"' He mentioned the same narration (as no. 5092) and he said: \"One of those camels went wild, and we shot it with arrows until we made it fall down.\"",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ ، حَدَّثَنَا سُفْيَانُ ، عَنْ إِسْمَاعِيلَ بْنِ مُسْلِمٍ ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ ، عَنْ عَبَايَةَ ، عَنْ جَدِّهِ رَافِعٍ ، ثُمَّ حَدَّثَنِيهِ عُمَرُ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ ، عَنْ أَبِيهِ ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ ، عَنْ جَدِّهِ ، قَالَ: قُلْنَا: يَا رَسُولَ اللهِ ، إِنَّا لاَقُو الْعَدُوِّ غَدًا ، وَلَيْسَ مَعَنَا مُدًى ، فَنُذَكِّي بِاللِّيطِ ، وَذَكَرَ الْحَدِيثَ بِقِصَّتِهِ ، وَقَالَ: فَنَدَّ عَلَيْنَا بَعِيرٌ مِنْهَا ، فَرَمَيْنَاهُ بِالنَّبْلِ حَتَّى وَهَصْنَاهُ."
            },
            {
                "hadithNo": "5095",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Sa'eed bin Masruq with this chain of narrators, the same Hadith (as no. 5092) until the end. And he said in it: \"We do not have any knives with us, so can we slaughter with reeds?\"",
                "hadithArabic": "وحَدَّثَنِيهِ الْقَاسِمُ بْنُ زَكَرِيَّا ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ ، عَنْ زَائِدَةَ ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ ، بِهَذَا الإِسْنَادِ الْحَدِيثَ إِلَى آخِرِهِ بِتَمَامِهِ ، وَقَالَ فِيهِ: وَلَيْسَتْ مَعَنَا مُدًى ، أَفَنَذْبَحُ بِالْقَصَبِ؟."
            },
            {
                "hadithNo": "5096",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Rafi' bin Khadij that he said: \"O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives,\" and he quoted the same Hadith (as no. 5093), but he did not mention (the words): \"The people rushed (and slaughtered these animals) and started cooking them in pots, but he ordered that they be overturned,\" but he mentioned the rest of the story.",
                "hadithArabic": "وحَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ ، عَنْ رَافِعِ بْنِ خَدِيجٍ ، أَنَّهُ قَالَ: يَا رَسُولَ اللهِ ، إِنَّا لاَقُو الْعَدُوِّ غَدًا وَلَيْسَ مَعَنَا مُدًى ، وَسَاقَ الْحَدِيثَ ، وَلَمْ يَذْكُرْ فَعَجِلَ الْقَوْمُ ، فَأَغْلَوْا بِهَا الْقُدُورَ ، فَأَمَرَ بِهَا فَكُفِئَتْ وَذَكَرَ سَائِرَ الْقِصَّةِ."
            },
            {
                "hadithNo": "5097",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu 'Ubaid said: \"I attended 'Eid with 'Ali bin Abi Talib, and he started with the prayer before the Khutbah. He said: 'The Messenger of Allah (s.a.w) forbade us to eat the meat of our sacrifices after three days.\"'",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ ، حَدَّثَنَا سُفْيَانُ ، حَدَّثَنَا الزُّهْرِيُّ ، عَنْ أَبِي عُبَيْدٍ ، قَالَ: شَهِدْتُ الْعِيدَ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ ، فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ ، وَقَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا أَنْ نَأْكُلَ مِنْ لُحُومِ نُسُكِنَا بَعْدَ ثَلاَثٍ."
            },
            {
                "hadithNo": "5098",
                "chapterNo": "5",
                "hadithEnglish": "Abu 'Ubaid, the freed slave of Ibn Azhar, narrated that he attended 'Eid with 'Umar bin Al-Khattab. He said: \"Then I prayed with 'Ali bin Abi Talib, and he led us in prayer before the Khutbah, then he addressed the people. He said: 'The Messenger of Allah (s.a.w) forbade you to eat the meat of your sacrifices for more than three days, so do not eat it.\"'",
                "hadithArabic": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى ، أَخْبَرَنَا ابْنُ وَهْبٍ ، حَدَّثَنِي يُونُسُ ، عَنِ ابْنِ شِهَابٍ ، حَدَّثَنِي أَبُو عُبَيْدٍ ، مَوْلَى ابْنِ أَزْهَرَ ، أَنَّهُ شَهِدَ الْعِيدَ مَعَ عُمَرَ بْنِ الْخَطَّابِ ، قَالَ: ثُمَّ صَلَّيْتُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ ، قَالَ: فَصَلَّى لَنَا قَبْلَ الْخُطْبَةِ ، ثُمَّ خَطَبَ النَّاسَ ، فَقَالَ: إِنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَاكُمْ أَنْ تَأْكُلُوا لُحُومَ نُسُكِكُمْ فَوْقَ ثَلاَثِ لَيَالٍ ، فَلاَ تَأْكُلُوا."
            },
            {
                "hadithNo": "5099",
                "chapterNo": "5",
                "hadithEnglish": "A similar report (as no. 5098) was narrated from Az-Zuhri, with this chain of narrators.",
                "hadithArabic": "وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ (ح) وحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ ، حَدَّثَنَا أَبِي ، عَنْ صَالِحٍ (ح) وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ ، كُلُّهُمْ عَنِ الزُّهْرِيِّ ، بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "5100",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Prophet (s.a.w) said: \"No one should eat from the meat of the sacrifice for more than three days.\"",
                "hadithArabic": "وحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا لَيْثٌ (ح) وحَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ ، أَخْبَرَنَا اللَّيْثُ ، عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، أَنَّهُ قَالَ: لاَ يَأْكُلْ أَحَدٌ مِنْ لَحْمِ أُضْحِيَّتِهِ فَوْقَ ثَلاَثَةِ أَيَّامٍ."
            },
            {
                "hadithNo": "5101",
                "chapterNo": "5",
                "hadithEnglish": "A Hadith like that of Al-Laith (no. 5100) was narrated from Ibn 'Umar, from the Prophet (s.a.w).",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ، عَنِ ابْنِ جُرَيْجٍ (ح) وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ ، أَخْبَرَنَا الضَّحَّاكُ ، يَعْنِي ابْنَ عُثْمَانَ ، كِلاَهُمَا عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ... بِمِثْلِ حَدِيثِ اللَّيْثِ."
            },
            {
                "hadithNo": "5102",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Messenger of Allah (s.a.w) forbade eating the sacrificial meat after three days. Salim (a narrator) said: \"Ibn 'Umar would not to eat the sacrificial meat for more than three days.\" Ibn Abi 'Umar said: \"after three days.\"",
                "hadithArabic": "وحَدَّثَنَا ابْنُ أَبِي عُمَرَ ، وَعَبْدُ بْنُ حُمَيْدٍ ، قَالَ ابْنُ أَبِي عُمَرَ: حَدَّثَنَا ، وَقَالَ عَبْدٌ : أَخْبَرَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ ، عَنِ الزُّهْرِيِّ ، عَنْ سَالِمٍ ، عَنِ ابْنِ عُمَرَ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ تُؤْكَلَ لُحُومُ الأَضَاحِيِّ بَعْدَ ثَلاَثٍ. قَالَ سَالِمٌ: فَكَانَ ابْنُ عُمَرَ ، لاَ يَأْكُلُ لُحُومَ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ ، وَقَالَ ابْنُ أَبِي عُمَرَ: بَعْدَ ثَلاَثٍ."
            },
            {
                "hadithNo": "5103",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from 'Abdullah bin Abi Bakr that 'Abdullah bin Waqid said: \"The Messenger of Allah (s.a.w) forbade eating the sacrificial meat after three days.\" 'Abdullah bin Abi Bakr said: \"I mentioned that to 'Amrah and she said: 'He spoke the truth. I heard 'Aishah say: \"The poor among the people of the desert came to the towns during 'Eid Al-Adha (seeking help) during the time of the Messenger of Allah (s.a.w), and the Messenger of Allah (s.a.w) said: 'Keep enough for three days, then give what is left in charity.' After that they said: 'O Messenger of Allah, the people are making skins with (the hides of) their sacrifices, and they are putting the fat into them.' The Messenger of Allah (s.a.w) said: 'Why is that?' They said: 'You forbade eating the meat of the sacrificial animals after three days.' He said: 'I only forbade you because of the poor people who came (seeking help). (Now) eat and store and give in charity.\"'",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ ، أَخْبَرَنَا رَوْحٌ ، حَدَّثَنَا مَالِكٌ ، عَنْ عَبْدِ اللهِ بْنِ أَبِي بَكْرٍ ، عَنْ عَبْدِ اللهِ بْنِ وَاقِدٍ ، قَالَ : نَهَى رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلاَثٍ ، قَالَ عَبْدُ اللهِ بْنُ أَبِي بَكْرٍ : فَذَكَرْتُ ذَلِكَ لِعَمْرَةَ ، فَقَالَتْ : صَدَقَ ، سَمِعْتُ عَائِشَةَ ، تَقُولُ : دَفَّ أَهْلُ أَبْيَاتٍ مِنْ أَهْلِ الْبَادِيَةِ حَضْرَةَ الأَضْحَى زَمَنَ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : ادَّخِرُوا ثَلاَثًا ، ثُمَّ تَصَدَّقُوا بِمَا بَقِيَ ، فَلَمَّا كَانَ بَعْدَ ذَلِكَ ، قَالُوا : يَا رَسُولَ اللهِ ، إِنَّ النَّاسَ يَتَّخِذُونَ الأَسْقِيَةَ مِنْ ضَحَايَاهُمْ ، وَيَجْمُلُونَ مِنْهَا الْوَدَكَ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : وَمَا ذَاكَ ؟ قَالُوا : نَهَيْتَ أَنْ تُؤْكَلَ لُحُومُ الضَّحَايَا بَعْدَ ثَلاَثٍ ، فَقَالَ : إِنَّمَا نَهَيْتُكُمْ مِنْ أَجْلِ الدَّافَّةِ الَّتِي دَفَّتْ ، فَكُلُوا وَادَّخِرُوا وَتَصَدَّقُوا."
            },
            {
                "hadithNo": "5104",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Jabir that (in the beginning) the Prophet (s.a.w) forbade eating the sacrificial meat after three days, then after that he said: \"Eat, store (for the journey) and save.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، قَالَ : قَرَأْتُ عَلَى مَالِكٍ ، عَنْ أَبِي الزُّبَيْرِ ، عَنْ جَابِرٍ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، أَنَّهُ نَهَى عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلاَثٍ ، ثُمَّ قَالَ بَعْدُ: كُلُوا ، وَتَزَوَّدُوا ، وَادَّخِرُوا."
            },
            {
                "hadithNo": "5105",
                "chapterNo": "5",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"We not eat the sacrificial meat for more than three days in Mina, then the Messenger of Allah (s.a.w) granted us a concession and said: 'Eat and store (for the journey).\"' I said to 'Ata': \"Did Jabir say: 'Until we came to Al-Madinah?' He said: 'Yes.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ (ح) وحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ ، حَدَّثَنَا ابْنُ عُلَيَّةَ ، كِلاَهُمَا عَنِ ابْنِ جُرَيْجٍ ، عَنْ عَطَاءٍ ، عَنْ جَابِرٍ (ح) وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ ، وَاللَّفْظُ لَهُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ، عَنِ ابْنِ جُرَيْجٍ ، حَدَّثَنَا عَطَاءٌ ، قَالَ: سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللهِ ، يَقُولُ: كُنَّا لاَ نَأْكُلُ مِنْ لُحُومِ بُدْنِنَا فَوْقَ ثَلاَثِ مِنًى ، فَأَرْخَصَ لَنَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ: كُلُوا وَتَزَوَّدُوا.\r\nقُلْتُ لِعَطَاءٍ: قَالَ جَابِرٌ : حَتَّى جِئْنَا الْمَدِينَةَ ؟ قَالَ: نَعَمْ."
            },
            {
                "hadithNo": "5106",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"We would not keep the sacrificial meat for more than three days, then the Messenger of Allah (s.a.w) ordered us to store some of it (for the journey) and to eat from it - i.e., for more than three days.\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ ، عَنْ عُبَيْدِ اللهِ بْنِ عَمْرٍو ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، قَالَ: كُنَّا لاَ نُمْسِكُ لُحُومَ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ ، فَأَمَرَنَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَزَوَّدَ مِنْهَا ، وَنَأْكُلَ مِنْهَا ، يَعْنِي فَوْقَ ثَلاَثٍ."
            },
            {
                "hadithNo": "5107",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Jabir said: \"We used to take it as provisions (on the journey) to Al-Madinah at the time of the Messenger of Allah (s.a.w).\"",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ، عَنْ عَمْرٍو ، عَنْ عَطَاءٍ ، عَنْ جَابِرٍ ، قَالَ: كُنَّا نَتَزَوَّدُهَا إِلَى الْمَدِينَةِ عَلَى عَهْدِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
            },
            {
                "hadithNo": "5108",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Sa'eed Al-Khudri said: \"The Messenger of Allah (s.a.w) said: 'O people of Al-Madinah, do not eat the sacrificial meat for more than three.\"' Ibn Al-Muthanna said: \"Three days.\" They complained to the Messenger of Allah (s.a.w) that they had children and servants, and he said: \"Eat, give to others and save and store it.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَبْدُ الأَعْلَى ، عَنِ الْجُرَيْرِيِّ ، عَنْ أَبِي نَضْرَةَ ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ (ح) وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، حَدَّثَنَا عَبْدُ الأَعْلَى ، حَدَّثَنَا سَعِيدٌ ، عَنْ قَتَادَةَ ، عَنْ أَبِي نَضْرَةَ ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَا أَهْلَ الْمَدِينَةِ ، لاَ تَأْكُلُوا لُحُومَ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ. وقَالَ ابْنُ الْمُثَنَّى: ثَلاَثَةِ أَيَّامٍ. فَشَكَوْا إِلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ لَهُمْ عِيَالاً ، وَحَشَمًا ، وَخَدَمًا ، فَقَالَ: كُلُوا ، وَأَطْعِمُوا ، وَاحْبِسُوا ، أَوْ ادَّخِرُوا.  قَالَ ابْنُ الْمُثَنَّى: شَكَّ عَبْدُ الأَعْلَى."
            },
            {
                "hadithNo": "5109",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Salamah bin Al-Akwa' that the Messenger of Allah (s.a.w) said: \"Whoever among you offers a sacrifice, nothing of it should be left in his house after the third day.\" The following year, they said: \"O Messenger of Allah, shall we do what we did last year?\" He said: \"No, that was a year when people were hard-pressed, and I wanted (the meat) to be distributed among them.\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ ، أَخْبَرَنَا أَبُو عَاصِمٍ ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ ضَحَّى مِنْكُمْ فَلاَ يُصْبِحَنَّ فِي بَيْتِهِ بَعْدَ ثَالِثَةٍ شَيْئًا ، فَلَمَّا كَانَ فِي الْعَامِ الْمُقْبِلِ ، قَالُوا: يَا رَسُولَ اللهِ ، نَفْعَلُ كَمَا فَعَلْنَا عَامَ أَوَّلَ ، فَقَالَ: لاَ ، إِنَّ ذَاكَ عَامٌ كَانَ النَّاسُ فِيهِ بِجَهْدٍ ، فَأَرَدْتُ أَنْ يَفْشُوَ فِيهِمْ."
            },
            {
                "hadithNo": "5110",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Thawban said: \"The Messenger of Allah (s.a.w) slaughtered his sacrifice then he said: 'O Thawban, prepare this meat for us.\"' And he kept giving it to him to eat until he came to Al-Madinah.",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ ، حَدَّثَنَا مَعْنُ بْنُ عِيسَى ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ ، عَنْ أَبِي الزَّاهِرِيَّةِ ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ ، عَنْ ثَوْبَانَ ، قَالَ: ذَبَحَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِيَّتَهُ ، ثُمَّ قَالَ: يَا ثَوْبَانُ ، أَصْلِحْ لَحْمَ هَذِهِ ، فَلَمْ أَزَلْ أُطْعِمُهُ مِنْهَا حَتَّى قَدِمَ الْمَدِينَةَ."
            },
            {
                "hadithNo": "5111",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Mu'awiyah bin Salih, with this chain of narrators (a Hadith similar to no. 5110).",
                "hadithArabic": "وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَابْنُ رَافِعٍ ، قَالاَ : حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ (ح) وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ، كِلاَهُمَا عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ ، بِهَذَا الإِسْنَادِ."
            },
            {
                "hadithNo": "5112",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Thawban, the freed slave of the Messenger of Allah (s.a.w) said: \"The Messenger of Allah (s.a.w) said to me during the Farewell Pilgrimage: 'Prepare this meat.\"' \"So I prepared it and he continued to eat from it until he reached Al-Madinah.\"",
                "hadithArabic": "وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ ، أَخْبَرَنَا أَبُو مُسْهِرٍ ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ ، حَدَّثَنِي الزُّبَيْدِيُّ ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ ، عَنْ أَبِيهِ ، عَنْ ثَوْبَانَ ، مَوْلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ: أَصْلِحْ هَذَا اللَّحْمَ ، قَالَ: فَأَصْلَحْتُهُ ، فَلَمْ يَزَلْ يَأْكُلُ مِنْهُ حَتَّى بَلَغَ الْمَدِينَةَ."
            },
            {
                "hadithNo": "5113",
                "chapterNo": "5",
                "hadithEnglish": "Yahya bin Hamzah narrated with this chain (a Hadith similar to no. 5112), but he did not say: \"During the Farewell Pilgrimage.\"",
                "hadithArabic": "وحَدَّثَنِيهِ عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ ، أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ ، بِهَذَا الإِسْنَادِ ، وَلَمْ يَقُلْ: فِي حَجَّةِ الْوَدَاعِ."
            },
            {
                "hadithNo": "5114",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from 'Abdullah bin Buraidah that his father said: \"The Messenger of Allah (s.a.w.) said: 'I forbade you to visit the graves, but now visit them. And I forbade you to (eat) the sacrificial meat for more than three days, but now keep it as long as you see fit. And I forbade you to drink Nabidh unless it was in skins, but now drink it from any kind of vessel, but do not drink any intoxicant.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَمُحَمَّدُ بْنُ الْمُثَنَّى ، قَالاَ : حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ ، قَالَ أَبُو بَكْرٍ : عَنْ أَبِي سِنَانٍ ، وَقَالَ ابْنُ الْمُثَنَّى : عَنْ ضِرَارِ بْنِ مُرَّةَ ، عَنْ مُحَارِبٍ ، عَنِ ابْنِ بُرَيْدَةَ ، عَنْ أَبِيهِ (ح) وحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ ، حَدَّثَنَا ضِرَارُ بْنُ مُرَّةَ أَبُو سِنَانٍ ، عَنْ مُحَارِبِ بْنِ دِثَارٍ ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ ، عَنْ أَبِيهِ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ ، فَزُورُوهَا ، وَنَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ ، فَأَمْسِكُوا مَا بَدَا لَكُمْ ، وَنَهَيْتُكُمْ عَنِ النَّبِيذِ إِلاَّ فِي سِقَاءٍ ، فَاشْرَبُوا فِي الأَسْقِيَةِ كُلِّهَا ، وَلاَ تَشْرَبُوا مُسْكِرًا."
            },
            {
                "hadithNo": "5115",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Ibn Buraidah, narrating his father, that the Messenger of Allah (s.a.w) said: \"I used to forbid you...\" and he mentioned a Hadith like that of Abu Sinan (no. 5114).",
                "hadithArabic": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ ، حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ ، عَنْ سُفْيَانَ ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ ، عَنِ ابْنِ بُرَيْدَةَ ، عَنْ أَبِيهِ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: كُنْتُ نَهَيْتُكُمْ ، فَذَكَرَ بِمَعْنَى حَدِيثِ أَبِي سِنَانٍ."
            },
            {
                "hadithNo": "5116",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Abu Hurairah said: The Messenger of Allah (s.a.w) said: \"There is no Fara' and no 'Atirah.\" Ibn Rafi' added in his report: \"Fara' refers to the firstborn which they used to sacrifice.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَعَمْرٌو النَّاقِدُ ، وَزُهَيْرُ بْنُ حَرْبٍ ، قَالَ يَحْيَى : أَخْبَرَنَا ، وقَالَ الآخَرُونَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ، عَنِ الزُّهْرِيِّ ، عَنْ سَعِيدٍ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (ح) وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ ، وَعَبْدُ بْنُ حُمَيْدٍ ، قَالَ عَبْدٌ : أَخْبَرَنَا ، وقَالَ ابْنُ رَافِعٍ : حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ ، عَنِ الزُّهْرِيِّ ، عَنِ ابْنِ الْمُسَيَّبِ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : لاَ فَرَعَ ، وَلاَ عَتِيرَةَ.زَادَ ابْنُ رَافِعٍ فِي رِوَايَتِهِ ، وَالْفَرَعُ : أَوَّلُ النِّتَاجِ كَانَ يُنْتَجُ لَهُمْ فَيَذْبَحُونَهُ."
            },
            {
                "hadithNo": "5117",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from Umm Salamah that the Prophet (s.a.w) said: \"When the ten (days of Dhul-Hajjah) begin, and one of you wants to offer a sacrifice, let nothing touch his hair or skin.\" It was said to Sufyan (a sub narrator): \"Some of them do not attribute it to the Prophet  (s.a.w).\" He said: \"But I attribute it to him.\"",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ ، حَدَّثَنَا سُفْيَانُ ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ ، سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ ، يُحَدِّثُ عَنْ أُمِّ سَلَمَةَ ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا دَخَلَتِ الْعَشْرُ ، وَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ ، فَلاَ يَمَسَّ مِنْ شَعَرِهِ وَبَشَرِهِ شَيْئًا.\r\nقِيلَ لِسُفْيَانَ: فَإِنَّ بَعْضَهُمْ لاَ يَرْفَعُهُ ، قَالَ: لَكِنِّي أَرْفَعُهُ."
            },
            {
                "hadithNo": "5118",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from Umm Salamah, attributing it to the Prophet (s.a.w): \"When the first ten days begin, if he has a sacrificial animal that he wants to offer as a sacrifice, let him not remove anything from his hair or trim his nails.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا سُفْيَانُ ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ ، عَنْ أُمِّ سَلَمَةَ ، تَرْفَعُهُ ، قَالَ: إِذَا دَخَلَ الْعَشْرُ وَعِنْدَهُ أُضْحِيَّةٌ يُرِيدُ أَنْ يُضَحِّيَ ، فَلاَ يَأْخُذَنَّ شَعْرًا ، وَلاَ يَقْلِمَنَّ ظُفُرًا."
            },
            {
                "hadithNo": "5119",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from Sa'eed bin Al-Musaiyyab, from Umm Salamah, that the Prophet (s.a.w) said: \"When you see the crescent moon of Dhul-Hajjah, and one of you wants to offer a sacrifice, let him leave his hair and nails alone.\"",
                "hadithArabic": "وحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ ، حَدَّثَنِي يَحْيَى بْنُ كَثِيرٍ الْعَنْبَرِيُّ أَبُو غَسَّانَ ، حَدَّثَنَا شُعْبَةُ ، عَنْ مَالِكِ بْنِ أَنَسٍ ، عَنْ عَمْرِو بْنِ مُسْلِمٍ ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ ، عَنْ أُمِّ سَلَمَةَ ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِذَا رَأَيْتُمْ هِلاَلَ ذِي الْحِجَّةِ ، وَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ ، فَلْيُمْسِكْ عَنْ شَعْرِهِ وَأَظْفَارِهِ."
            },
            {
                "hadithNo": "5120",
                "chapterNo": "7",
                "hadithEnglish": "A similar report (as no. 5119) was narrated from 'Umar or 'Amr bin Muslim, with this chain of narrators.",
                "hadithArabic": "وحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ الْحَكَمِ الْهَاشِمِيُّ ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ مَالِكِ بْنِ أَنَسٍ ، عَنْ عُمَرَ ، أَوْ عَمْرِو بْنِ مُسْلِمٍ ، بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "5121",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that 'Umar bin Muslim bin 'Umarah bin Ukaimah Al-Laithi said: \"I heard Sa'eed bin Al-Musaiyyab say: 'I heard Umm Salamah, the wife of the Prophet (s.a.w), say: \"The Messenger of Allah (s.a.w) said: 'Whoever has an animal to sacrifice, when the crescent moon of Dhul-Hajjah appears, let him not remove anything from his hair or nails, until he has offered his sacrifice.\"'",
                "hadithArabic": "وحَدَّثَنِي عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو اللَّيْثِيُّ ، عَنْ عُمَرَ بْنِ مُسْلِمِ بْنِ عَمَّارِ بْنِ أُكَيْمَةَ اللَّيْثِيِّ ، قَالَ: سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ ، يَقُولُ: سَمِعْتُ أُمَّ سَلَمَةَ ، زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ كَانَ لَهُ ذِبْحٌ يَذْبَحُهُ فَإِذَا أُهِلَّ هِلاَلُ ذِي الْحِجَّةِ ، فَلاَ يَأْخُذَنَّ مِنْ شَعْرِهِ ، وَلاَ مِنْ أَظْفَارِهِ شَيْئًا حَتَّى يُضَحِّيَ."
            },
            {
                "hadithNo": "5122",
                "chapterNo": "7",
                "hadithEnglish": "'Amr bin Muslim bin 'Umarah Al-Laithi said: \"We were in the bath-house just before ('Eid) Al-Adha, and some people removed their pubic hair using a depilatory agent. Some of the people in the bath-house said: 'Sa'eed bin Al-Musaiyyab regards this as Makruh, or he forbids it.' I met Sa'eed bin Al-Musaiyyab and told him about that, and he said: 'O son of my brother, this is a Hadith which has been caused to be forgotten and abandoned, which Umm Salamah narrated to me from the Prophet (s.a.w). She said: \"The Messenger of Allah (s.a.w) said...\" a Hadith like that of Mu'adh from Muhammad bin 'Amr.",
                "hadithArabic": "حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ ، حَدَّثَنَا أَبُو أُسَامَةَ ، حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍ ، وحَدَّثَنَا عَمْرُو بْنُ مُسْلِمِ بْنِ عَمَّارٍ اللَّيْثِيُّ ، قَالَ: كُنَّا فِي الْحَمَّامِ قُبَيْلَ الأَضْحَى ، فَاطَّلَى فِيهِ نَاسٌ ، فَقَالَ بَعْضُ أَهْلِ الْحَمَّامِ: إِنَّ سَعِيدَ بْنَ الْمُسَيَّبِ يَكْرَهُ هَذَا ، أَوْ يَنْهَى عَنْهُ ، فَلَقِيتُ سَعِيدَ بْنَ الْمُسَيَّبِ ، فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ: يَا ابْنَ أَخِي ، هَذَا حَدِيثٌ قَدْ نُسِيَ وَتُرِكَ ، حَدَّثَتْنِي أُمُّ سَلَمَةَ ، زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَتْ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: بِمَعْنَى حَدِيثِ مُعَاذٍ ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو."
            },
            {
                "hadithNo": "5123",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from 'Umar bin Muslim Al-Junda'i that Ibn Al-Musaiyyab told him that Umm Salamah the wife of the Prophet (s.a.w) told him... a Hadith like theirs (no. 5112).",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى ، وَأَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ ابْنِ أَخِي ابْنِ وَهْبٍ ، قَالَا: حَدَّثَنَا عَبْدُ اللهِ بْنُ وَهْبٍ ، أَخْبَرَنِي حَيْوَةُ ، أَخْبَرَنِي خَالِدُ بْنُ يَزِيدَ ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ ، عَنْ عَمْرِو بْنِ مُسْلِمٍ الْجُنْدَعِيِّ ، أَنَّ ابْنَ الْمُسَيَّبِ ، أَخْبَرَهُ أَنَّ أُمَّ سَلَمَةَ ، زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ وَذَكَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِهِمْ."
            },
            {
                "hadithNo": "5124",
                "chapterNo": "8",
                "hadithEnglish": "Abu At-Tufail 'Amir bin Wathilah said: \"I was with 'Ali bin Abi Talib when a man came to him and said: 'What did the Prophet (s.a.w) tell you in secret?' He got angry and said: 'The Prophet (s.a.w) did not tell me anything in secret that he hid from the people, but he told me four things.\"' He said: \"What are they, O Amir Al-Mu'minin?\" He said: \"He (s.a.w) said: 'May Allah curse the one who curses his father, may Allah curse the one who offers a sacrifice to anything other than Allah, may Allah curse the one who gives refuge to a Muhdith, and may Allah curse the one who changes the boundary markers.\"",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ ، وَسُرَيْجُ بْنُ يُونُسَ ، كِلاَهُمَا عَنْ مَرْوَانَ ، قَالَ زُهَيْرٌ: حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ ، حَدَّثَنَا مَنْصُورُ بْنُ حَيَّانَ ، حَدَّثَنَا أَبُو الطُّفَيْلِ عَامِرُ بْنُ وَاثِلَةَ ، قَالَ: كُنْتُ عِنْدَ عَلِيِّ بْنِ أَبِي طَالِبٍ ، فَأَتَاهُ رَجُلٌ ، فَقَالَ: مَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسِرُّ إِلَيْكَ ، قَالَ: فَغَضِبَ ، وَقَالَ: مَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسِرُّ إِلَيَّ شَيْئًا يَكْتُمُهُ النَّاسَ ، غَيْرَ أَنَّهُ قَدْ حَدَّثَنِي بِكَلِمَاتٍ أَرْبَعٍ ، قَالَ: فَقَالَ: مَا هُنَّ يَا أَمِيرَ الْمُؤْمِنِينَ ؟ قَالَ: قَالَ: لَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَهُ ، وَلَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللهِ ، وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا ، وَلَعَنَ اللَّهُ مَنْ غَيَّرَ مَنَارَ الأَرْضِ."
            },
            {
                "hadithNo": "5125",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Abu At-Tufail said: \"We said to 'Ali bin Abi Talib: 'Tell us of something that the Messenger of Allah (s.a.w) told you in secret.' He said: 'He did not tell me anything in secret that he concealed from the people, but I heard him say: \"May Allah curse the one who offers a sacrifice to something other than Allah, may Allah curse the one who gives refuge to a Muhdith, may Allah curse the one who curses his parents and may Allah curse the one who changes the boundary markers.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ سُلَيْمَانُ بْنُ حَيَّانَ ، عَنْ مَنْصُورِ بْنِ حَيَّانَ ، عَنْ أَبِي الطُّفَيْلِ ، قَالَ: قُلْنَا لِعَلِيِّ بْنِ أَبِي طَالِبٍ ، أَخْبِرْنَا بِشَيْءٍ أَسَرَّهُ إِلَيْكَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ: مَا أَسَرَّ إِلَيَّ شَيْئًا كَتَمَهُ النَّاسَ ، وَلَكِنِّي سَمِعْتُهُ يَقُولُ: لَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللهِ ، وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا ، وَلَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَيْهِ ، وَلَعَنَ اللَّهُ مَنْ غَيَّرَ الْمَنَارَ."
            },
            {
                "hadithNo": "5126",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Abu At-Tufail said: \"Ali (bin Abi Talib) was asked: 'Did the Messenger of Allah (s.a.w) tell you anything that was for you only?' He said: 'The Messenger of Allah (s.a.w) did not tell us anything that was for us only, that he did not tell all the people, except that which is in this sheath of my sword.' He took out a document on which it was written: 'May Allah curse the one who offers a sacrifice to anything other than Allah, may Allah curse the one who steals the boundary markers, may Allah curse the one who curses his parents, and may Allah curse the one who gives refuge to a Muhdith.''",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، وَمُحَمَّدُ بْنُ بَشَّارٍ ، وَاللَّفْظُ لاِبْنِ الْمُثَنَّى ، قَالاَ : حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، قَالَ: سَمِعْتُ الْقَاسِمَ بْنَ أَبِي بَزَّةَ ، يُحَدِّثُ عَنْ أَبِي الطُّفَيْلِ ، قَالَ: سُئِلَ عَلِيٌّ ، أَخَصَّكُمْ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ ؟ فَقَالَ: مَا خَصَّنَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ لَمْ يَعُمَّ بِهِ النَّاسَ كَافَّةً ، إِلاَّ مَا كَانَ فِي قِرَابِ سَيْفِي هَذَا ، قَالَ: فَأَخْرَجَ صَحِيفَةً مَكْتُوبٌ فِيهَا: لَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللهِ ، وَلَعَنَ اللَّهُ مَنْ سَرَقَ مَنَارَ الأَرْضِ ، وَلَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَهُ ، وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا."
            }
        ]
    }
]