[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "24",
        "bookName": "Book of Gifts",
        "bookNameArabic": "كتاب الهبات",
        "hadiths": [
            {
                "hadithNo": "4163",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Zaid bin Aslam, from his father, that 'Umar bin Al-Khattab said: \"I donated a fine horse (to be ridden in Jihad) in the cause of Allah, and its owner neglected it. I thought that he would sell it for a cheap price, and I asked the Messenger of Allah (s.a.w) about that. He said: 'Do not buy it, and do not take back your charity, for the one who takes back his charity is like the dog that returns to its vomit.\"",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَ حَمَلْتُ عَلَى فَرَسٍ عَتِيقٍ فِى سَبِيلِ اللَّهِ فَأَضَاعَهُ صَاحِبُهُ فَظَنَنْتُ أَنَّهُ بَائِعُهُ بِرُخْصٍ فَسَأَلْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- عَنْ ذَلِكَ فَقَالَ « لاَ تَبْتَعْهُ وَلاَ تَعُدْ فِى صَدَقَتِكَ فَإِنَّ الْعَائِدَ فِى صَدَقَتِهِ كَالْكَلْبِ يَعُودُ فِى قَيْئِهِ »."
            },
            {
                "hadithNo": "4164",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Malik bin Anas (a Hadith similar to no. 4163) with this chain, and he added: \"Do not buy it even if he gives it to you for a Dirham.\"",
                "hadithArabic": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ - يَعْنِى ابْنَ مَهْدِىٍّ - عَنْ مَالِكِ بْنِ أَنَسٍ بِهَذَا الإِسْنَادِ وَزَادَ « لاَ تَبْتَعْهُ وَإِنْ أَعْطَاكَهُ بِدِرْهَمٍ »."
            },
            {
                "hadithNo": "4165",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Umar that he donated a horse (to be ridden in Jihad) in the cause of Allah, and he found it with its owner who had neglected it. He was of poor means and 'Umar wanted to buy it, so he went to the Messenger of Allah (s.a.w) and told him about that. He said: \"Do not buy it, even if he gives it to you for a Dirham, for the likeness of the one who takes back his charity is that of the dog who returns to his vomit.\"",
                "hadithArabic": "حَدَّثَنِى أُمَيَّةُ بْنُ بِسْطَامَ حَدَّثَنَا يَزِيدُ - يَعْنِى ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ - وَهُوَ ابْنُ الْقَاسِمِ - عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ عَنْ عُمَرَ أَنَّهُ حَمَلَ عَلَى فَرَسٍ فِى سَبِيلِ اللَّهِ فَوَجَدَهُ عِنْدَ صَاحِبِهِ وَقَدْ أَضَاعَهُ وَكَانَ قَلِيلَ الْمَالِ فَأَرَادَ أَنْ يَشْتَرِيَهُ فَأَتَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَذَكَرَ ذَلِكَ لَهُ فَقَالَ « لاَ تَشْتَرِهِ وَإِنْ أُعْطِيتَهُ بِدِرْهَمٍ فَإِنَّ مَثَلَ الْعَائِدِ فِى صَدَقَتِهِ كَمَثَلِ الْكَلْبِ يَعُودُ فِى قَيْئِهِ »."
            },
            {
                "hadithNo": "4166",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn Abi 'Umar that Sufyan narrated from Zaid bin Aslam (a Hadith, similar to no. 4165), but the Hadith of Malik (no. 4163) and Rawh (no. 4165) is more complete and in detail.",
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ زَيْدِ بْنِ أَسْلَمَ بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ حَدِيثَ مَالِكٍ وَرَوْحٍ أَتَمُّ وَأَكْثَرُ."
            },
            {
                "hadithNo": "4167",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn 'Umar that 'Umar bin Al-Khattab donated a horse (to be ridden in Jihad) in the cause of Allah, and he found it offered for sale. He wanted to buy it, and he asked the Messenger of Allah (s.a.w) about that. He said: \"Do not buy it; do not take back your charity.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ حَمَلَ عَلَى فَرَسٍ فِى سَبِيلِ اللَّهِ فَوَجَدَهُ يُبَاعُ فَأَرَادَ أَنْ يَبْتَاعَهُ فَسَأَلَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- عَنْ ذَلِكَ فَقَالَ « لاَ تَبْتَعْهُ وَلاَ تَعُدْ فِى صَدَقَتِكَ »."
            },
            {
                "hadithNo": "4168",
                "chapterNo": "1",
                "hadithEnglish": "A Hadith like that of Malik (no. 4167) was narrated from Ibn 'Umar, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ رُمْحٍ جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ ح وَحَدَّثَنَا الْمُقَدَّمِىُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالاَ حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ كِلاَهُمَا عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمِثْلِ حَدِيثِ مَالِكٍ."
            },
            {
                "hadithNo": "4169",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn 'Umar that 'Umar donated a horse (to be ridden in Jihad) in the cause of Allah, then he saw it being offered for sale and he wanted to buy it. He asked the Prophet (s.a.w). The Messenger of Allah (s.a.w) said: \"Do not take back your charity, O 'Umar.\"",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِى عُمَرَ وَعَبْدُ بْنُ حُمَيْدٍ - وَاللَّفْظُ لِعَبْدٍ - قَالَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ أَنَّ عُمَرَ حَمَلَ عَلَى فَرَسٍ فِى سَبِيلِ اللَّهِ ثُمَّ رَآهَا تُبَاعُ فَأَرَادَ أَنْ يَشْتَرِيَهَا فَسَأَلَ النَّبِىَّ -صلى الله عليه وسلم- فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لاَ تَعُدْ فِى صَدَقَتِكَ يَا عُمَرُ »."
            },
            {
                "hadithNo": "4170",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Prophet (s.a.w) said: \"The likeness of the one who takes back his charity is that of a dog which vomits then returns to its vomit to eat it.\"",
                "hadithArabic": "حَدَّثَنِى إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِىُّ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الأَوْزَاعِىُّ عَنْ أَبِى جَعْفَرٍ مُحَمَّدِ بْنِ عَلِىٍّ عَنِ ابْنِ الْمُسَيَّبِ عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- قَالَ « مَثَلُ الَّذِى يَرْجِعُ فِى صَدَقَتِهِ كَمَثَلِ الْكَلْبِ يَقِىءُ ثُمَّ يَعُودُ فِى قَيْئِهِ فَيَأْكُلُهُ »."
            },
            {
                "hadithNo": "4171",
                "chapterNo": "2",
                "hadithEnglish": "Muhammad bin 'Ali bin Al-Husain mentioned a similar report (as Hadith no. 4170) with this chain.",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنِ الأَوْزَاعِىِّ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَلِىِّ بْنِ الْحُسَيْنِ يَذْكُرُ بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "4172",
                "chapterNo": "2",
                "hadithEnglish": "'Abdur-Rahman bin 'Amr narrated that Muhammad, the son of Fatimah, the daughter of the Messenger of Allah (s.a.w), narrated a similar Hadith (as no. 4170) with this chain.",
                "hadithArabic": "وَحَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَرْبٌ حَدَّثَنَا يَحْيَى - وَهُوَ ابْنُ أَبِى كَثِيرٍ - حَدَّثَنِى عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو أَنَّ مُحَمَّدَ ابْنَ فَاطِمَةَ بِنْتِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- حَدَّثَهُ بِهَذَا الإِسْنَادِ نَحْوَ حَدِيثِهِمْ."
            },
            {
                "hadithNo": "4173",
                "chapterNo": "2",
                "hadithEnglish": "Sa'eed bin Al-Musayyab said: \"I heard Ibn 'Abbas say: 'I heard the Messenger of Allah (s.a.w) say: \"The likeness of the one who gives charity then takes his charity back is that of a dog which vomits, then eats its vomit.\"",
                "hadithArabic": "وَحَدَّثَنِى هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ وَأَحْمَدُ بْنُ عِيسَى قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى عَمْرٌو - وَهُوَ ابْنُ الْحَارِثِ - عَنْ بُكَيْرٍ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « إِنَّمَا مَثَلُ الَّذِى يَتَصَدَّقُ بِصَدَقَةٍ ثُمَّ يَعُودُ فِى صَدَقَتِهِ كَمَثَلِ الْكَلْبِ يَقِىءُ ثُمَّ يَأْكُلُ قَيْأَهُ »."
            },
            {
                "hadithNo": "4174",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Prophet (s.a.w) said: \"The one who takes back his gift is like the one who returns to his vomit.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهُ قَالَ « الْعَائِدُ فِى هِبَتِهِ كَالْعَائِدِ فِى قَيْئِهِ »."
            },
            {
                "hadithNo": "4175",
                "chapterNo": "2",
                "hadithEnglish": "A similar report (as no. 4174) was narrated from Qatadah with this chain.",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِى عَدِىٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "4176",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Messenger of Allah (s.a.w) said: \"The one who takes back his gift is like the dog that vomits then returns to its vomit.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْمَخْزُومِىُّ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنِ ابْنِ عَبَّاسٍ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ « الْعَائِدُ فِى هِبَتِهِ كَالْكَلْبِ يَقِىءُ ثُمَّ يَعُودُ فِى قَيْئِهِ »."
            },
            {
                "hadithNo": "4177",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that An-Nu'man bin Bashir said that his father brought him to the Messenger of Allah (s.a.w) and said: \"I have given this son of mine a slave that belonged to me. The Messenger of Allah (s.a.w) said: 'Have you given a similar gift to all your children?' He said: 'No.' The Messenger of Allah (s.a.w) said: 'Then take it back.'\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ وَعَنْ مُحَمَّدِ بْنِ النُّعْمَانِ بْنِ بَشِيرٍ يُحَدِّثَانِهِ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّهُ قَالَ إِنَّ أَبَاهُ أَتَى بِهِ رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ إِنِّى نَحَلْتُ ابْنِى هَذَا غُلاَمًا كَانَ لِى. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَكُلَّ وَلَدِكَ نَحَلْتَهُ مِثْلَ هَذَا ». فَقَالَ لاَ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « فَارْجِعْهُ »."
            },
            {
                "hadithNo": "4178",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that An-Nu'man bin Bashir said: \"My father brought me to the Messenger of Allah (s.a.w) and said: 'I have given this son of mine a slave.' He said: 'Have you given a gift to all your children?' He said: 'No.' He said: 'Then take him (the slave) back.\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنِ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ وَمُحَمَّدِ بْنِ النُّعْمَانِ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ أَتَى بِى أَبِى إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ إِنِّى نَحَلْتُ ابْنِى هَذَا غُلاَمًا. فَقَالَ « أَكُلَّ بَنِيكَ نَحَلْتَ ». قَالَ لاَ. قَالَ « فَارْدُدْهُ »."
            },
            {
                "hadithNo": "4179",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Az-Zuhri with this chain (a Hadith similar to no. 4178).",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِى عُمَرَ عَنِ ابْنِ عُيَيْنَةَ ح وَحَدَّثَنَا قُتَيْبَةُ وَابْنُ رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ ح وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِى يُونُسُ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كُلُّهُمْ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ. أَمَّا يُونُسُ وَمَعْمَرٌ فَفِى حَدِيثِهِمَا « أَكُلَّ بَنِيكَ ». وَفِى حَدِيثِ اللَّيْثِ وَابْنِ عُيَيْنَةَ « أَكُلَّ وَلَدِكَ ». وَرِوَايَةُ اللَّيْثِ عَنْ مُحَمَّدِ بْنِ النُّعْمَانِ وَحُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ بَشِيرًا جَاءَ بِالنُّعْمَانِ."
            },
            {
                "hadithNo": "4180",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Hisham bin 'Urwah that his father said: \"An-Nu'man bin Bashir told us that his father gave him a slave, and the Prophet (s.a.w) said to him: 'What is this slave?' He said: 'My father gave him to me.' He (s.a.w) said (to my father): 'Did you give to all his brothers what you gave to this one?' He said: 'No.' He said: 'Then take him back.\"'",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ قَالَ حَدَّثَنَا النُّعْمَانُ بْنُ بَشِيرٍ قَالَ وَقَدْ أَعْطَاهُ أَبُوهُ غُلاَمًا فَقَالَ لَهُ النَّبِىُّ -صلى الله عليه وسلم- « مَا هَذَا الْغُلاَمُ ». قَالَ أَعْطَانِيهِ أَبِى. قَالَ « فَكُلَّ إِخْوَتِهِ أَعْطَيْتَهُ كَمَا أَعْطَيْتَ هَذَا ». قَالَ لاَ. قَالَ « فَرُدَّهُ »."
            },
            {
                "hadithNo": "4181",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that An-Nu'man bin Bashir said: \"My father gave me some of his wealth and my mother, 'Amrah bint Rawahah, said: 'I will not approve until you ask the Messenger of Allah (s.a.w) to bear witness.' So my father went to the Prophet (s.a.w) to ask him to bear witness to my gift. The Messenger of Allah (s.a.w) said to him: 'Have you done this for all your children?' He said: 'No.' He said: 'Fear Allah and treat your children fairly.' My father came back and took back the gift.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ حُصَيْنٍ عَنِ الشَّعْبِىِّ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - أَخْبَرَنَا أَبُو الأَحْوَصِ عَنْ حُصَيْنٍ عَنِ الشَّعْبِىِّ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ تَصَدَّقَ عَلَىَّ أَبِى بِبَعْضِ مَالِهِ فَقَالَتْ أُمِّى عَمْرَةُ بِنْتُ رَوَاحَةَ لاَ أَرْضَى حَتَّى تُشْهِدَ رَسُولَ اللَّهِ -صلى الله عليه وسلم-. فَانْطَلَقَ أَبِى إِلَى النَّبِىِّ -صلى الله عليه وسلم- لِيُشْهِدَهُ عَلَى صَدَقَتِى فَقَالَ لَهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَفَعَلْتَ هَذَا بِوَلَدِكَ كُلِّهِمْ ». قَالَ لاَ. قَالَ « اتَّقُوا اللَّهَ وَاعْدِلُوا فِى أَوْلاَدِكُمْ ». فَرَجَعَ أَبِى فَرَدَّ تِلْكَ الصَّدَقَةَ."
            },
            {
                "hadithNo": "4182",
                "chapterNo": "3",
                "hadithEnglish": "An-Nu'man bin Bashir narrated that his mother, the daughter of Rawahah, asked his father to give a gift to her son, and he kept delaying it for a year, then he decided to do that. She said: \"I will not approve until you ask the Messenger of Allah (s.a.w) to bear witness to what you have given to my son.\" So my father took me by the hand, and I was a young boy at that time. He went to the Messenger of Allah (s.a.w) and said: \"O Messenger of Allah, the mother of this boy, the daughter of Rawahah, would like you to bear witness to that which I have given to her son.\" The Messenger of Allah (s.a.w) said: \"O Bashir, do you have any other children?\" He said: \"Yes.\" He said: \"Have you given to all of them like you have given to this one?\" He said: \"No.\" He said: \"Then do not ask me to bear witness for I will not bear witness to injustice.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَلِىُّ بْنُ مُسْهِرٍ عَنْ أَبِى حَيَّانَ عَنِ الشَّعْبِىِّ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا أَبُو حَيَّانَ التَّيْمِىُّ عَنِ الشَّعْبِىِّ حَدَّثَنِى النُّعْمَانُ بْنُ بَشِيرٍ أَنَّ أُمَّهُ بِنْتَ رَوَاحَةَ سَأَلَتْ أَبَاهُ بَعْضَ الْمَوْهِبَةِ مِنْ مَالِهِ لاِبْنِهَا فَالْتَوَى بِهَا سَنَةً ثُمَّ بَدَا لَهُ فَقَالَتْ لاَ أَرْضَى حَتَّى تُشْهِدَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- عَلَى مَا وَهَبْتَ لاِبْنِى. فَأَخَذَ أَبِى بِيَدِى وَأَنَا يَوْمَئِذٍ غُلاَمٌ فَأَتَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمَّ هَذَا بِنْتَ رَوَاحَةَ أَعْجَبَهَا أَنْ أُشْهِدَكَ عَلَى الَّذِى وَهَبْتُ لاِبْنِهَا. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « يَا بَشِيرُ أَلَكَ وَلَدٌ سِوَى هَذَا ». قَالَ نَعَمْ. فَقَالَ « أَكُلَّهُمْ وَهَبْتَ لَهُ مِثْلَ هَذَا ». قَالَ لاَ. قَالَ « فَلاَ تُشْهِدْنِى إِذًا فَإِنِّى لاَ أَشْهَدُ عَلَى جَوْرٍ »."
            },
            {
                "hadithNo": "4183",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from An-Nu'man bin Bashir that the Messenger of Allah (s.a.w) said: \"Do you have any other sons besides him?\" He said: \"Yes.\" He said: \"Have you given to all of them like you have given to this one?\" He said: \"No.\" He said: \"I will not bear witness to injustice.\"",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنِى أَبِى حَدَّثَنَا إِسْمَاعِيلُ عَنِ الشَّعْبِىِّ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « أَلَكَ بَنُونَ سِوَاهُ ». قَالَ نَعَمْ. قَالَ « فَكُلَّهُمْ أَعْطَيْتَ مِثْلَ هَذَا ». قَالَ لاَ. قَالَ « فَلاَ أَشْهَدُ عَلَى جَوْرٍ »."
            },
            {
                "hadithNo": "4184",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from An-Nu'man bin Bashir that the Messenger of Allah (s.a.w) said to his father: \"Do not ask me to bear witness to injustice.\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ عَاصِمٍ الأَحْوَلِ عَنِ الشَّعْبِىِّ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ لأَبِيهِ « لاَ تُشْهِدْنِى عَلَى جَوْرٍ »."
            },
            {
                "hadithNo": "4185",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that An-Nu'man bin Bashir said: \"My father took me to the Messenger of Allah (s.a.w) and said: 'O Messenger of Allah, bear witness that I have given to this son of mine such and such of my wealth.' He said: 'Have you given to all your sons the like of what you have given to An-Nu'man?' He said: 'No.' He said: 'Then ask someone else to bear witness to this.' Then he said: 'Would you not like them all to honor you equally?' He said: 'Of course.' He said: 'Then do not do it.'\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ وَعَبْدُ الأَعْلَى ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَيَعْقُوبُ الدَّوْرَقِىُّ جَمِيعًا عَنِ ابْنِ عُلَيَّةَ - وَاللَّفْظُ لِيَعْقُوبَ - قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنْ دَاوُدَ بْنِ أَبِى هِنْدٍ عَنِ الشَّعْبِىِّ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ انْطَلَقَ بِى أَبِى يَحْمِلُنِى إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ يَا رَسُولَ اللَّهِ اشْهَدْ أَنِّى قَدْ نَحَلْتُ النُّعْمَانَ كَذَا وَكَذَا مِنْ مَالِى. فَقَالَ « أَكُلَّ بَنِيكَ قَدْ نَحَلْتَ مِثْلَ مَا نَحَلْتَ النُّعْمَانَ ». قَالَ لاَ. قَالَ « فَأَشْهِدْ عَلَى هَذَا غَيْرِى - ثُمَّ قَالَ - أَيَسُرُّكَ أَنْ يَكُونُوا إِلَيْكَ فِى الْبِرِّ سَوَاءً ». قَالَ بَلَى. قَالَ « فَلاَ إِذًا »."
            },
            {
                "hadithNo": "4186",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that An-Nu'man bin Bashir said: \"My father gave me a gift, then he brought me to the Messenger of Allah (s.a.w) to bear witness to it. He said: 'Have you given this to all of your children?' He said: 'No.' He said: 'Would you not like them all to honor you as you want this one to?' He said: 'Of course.' He said: 'Then I will not bear witness.\"' Ibn 'Awn said: \"I narrated it to Muhammad and he said: 'I was told that he (s.a.w) said:. \"Treat your children similarly.''",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِىُّ حَدَّثَنَا أَزْهَرُ حَدَّثَنَا ابْنُ عَوْنٍ عَنِ الشَّعْبِىِّ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ نَحَلَنِى أَبِى نُحْلاً ثُمَّ أَتَى بِى إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- لِيُشْهِدَهُ فَقَالَ « أَكُلَّ وَلَدِكَ أَعْطَيْتَهُ هَذَا ». قَالَ لاَ. قَالَ « أَلَيْسَ تُرِيدُ مِنْهُمُ الْبِرَّ مِثْلَ مَا تُرِيدُ مِنْ ذَا ». قَالَ بَلَى. قَالَ « فَإِنِّى لاَ أَشْهَدُ ». قَالَ ابْنُ عَوْنٍ فَحَدَّثْتُ بِهِ مُحَمَّدًا فَقَالَ إِنَّمَا تَحَدَّثْنَا أَنَّهُ قَالَ « قَارِبُوا بَيْنَ أَوْلاَدِكُمْ »."
            },
            {
                "hadithNo": "4187",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Jabir said: \"The wife of Bashir said: 'Give your slave to my son, and ask the Messenger of Allah (s.a.w) to bear witness for me.' So he went to the Messenger of Allah (s.a.w) and said: 'The daughter of so-and-so asked me to give my slave to her son, and she said: \"Ask the Messenger of Allah (s.a.w) to bear witness for me.'\" He said: 'Does he have any brothers?' He said: 'Yes.' He said: 'Have you given to all of them something like that which you have given to him?' He said: 'No.' He said: 'This is not right. I will not bear witness to anything but that which is right and proper.\"'",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَتِ امْرَأَةُ بَشِيرٍ انْحَلِ ابْنِى غُلاَمَكَ وَأَشْهِدْ لِى رَسُولَ اللَّهِ -صلى الله عليه وسلم-. فَأَتَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ إِنَّ ابْنَةَ فُلاَنٍ سَأَلَتْنِى أَنْ أَنْحَلَ ابْنَهَا غُلاَمِى وَقَالَتْ أَشْهِدْ لِى رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « أَلَهُ إِخْوَةٌ ». قَالَ نَعَمْ. قَالَ « أَفَكُلَّهُمْ أَعْطَيْتَ مِثْلَ مَا أَعْطَيْتَهُ ». قَالَ لاَ. قَالَ « فَلَيْسَ يَصْلُحُ هَذَا. وَإِنِّى لاَ أَشْهَدُ إِلاَّ عَلَى حَقٍّ »."
            },
            {
                "hadithNo": "4188",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (s.a.w) said: \"Any man who is given a gift for life, it belongs to him and his heirs. It belongs to the one to whom it is given, and does not go back to the one who gave it, because he has given it in such a way that it is subject to the rules of inheritance.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ عَنْ أَبِى سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « أَيُّمَا رَجُلٍ أُعْمِرَ عُمْرَى لَهُ وَلِعَقِبِهِ فَإِنَّهَا لِلَّذِى أُعْطِيَهَا لاَ تَرْجِعُ إِلَى الَّذِى أَعْطَاهَا لأَنَّهُ أَعْطَى عَطَاءً وَقَعَتْ فِيهِ الْمَوَارِيثُ »."
            },
            {
                "hadithNo": "4189",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"I heard the Messenger of Allah (s.a.w) say: 'Whoever gives a man a gift for life, it belongs to him and his children. His words ended his right to it and it belongs to the one to whom it was given for life and to his heirs.\"' Yahya said at the beginning of his Hadith: \"Any man who is given a gift for life, it belongs to him and his children.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالاَ أَخْبَرَنَا اللَّيْثُ ح وَحَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنِ ابْنِ شِهَابٍ عَنْ أَبِى سَلَمَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « مَنْ أَعْمَرَ رَجُلاً عُمْرَى لَهُ وَلِعَقِبِهِ فَقَدْ قَطَعَ قَوْلُهُ حَقَّهُ فِيهَا وَهِىَ لِمَنْ أُعْمِرَ وَلِعَقِبِهِ ». غَيْرَ أَنَّ يَحْيَى قَالَ فِى أَوَّلِ حَدِيثِهِ « أَيُّمَا رَجُلٍ أُعْمِرَ عُمْرَى فَهِىَ لَهُ وَلِعَقِبِهِ »."
            },
            {
                "hadithNo": "4190",
                "chapterNo": "4",
                "hadithEnglish": "Jabir bin 'Abdullah Al-Ansari narrated that the Messenger of Allah (s.a.w) said: \"Any man who gives a man a gift for life, it belongs to him (the latter) and to his heirs.\" He said: \"I have given it to you and your heirs so long-as any one of you is still alive, then it belongs to the one to whom it was given, and it does not go back to the giver because he has given it in such a way that it is subject to the rules of inheritance.\"",
                "hadithArabic": "حَدَّثَنِى عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ الْعَبْدِىُّ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى ابْنُ شِهَابٍ عَنِ الْعُمْرَى وَسُنَّتِهَا عَنْ حَدِيثِ أَبِى سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِىَّ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « أَيُّمَا رَجُلٍ أَعْمَرَ رَجُلاً عُمْرَى لَهُ وَلِعَقِبِهِ فَقَالَ قَدْ أَعْطَيْتُكَهَا وَعَقِبَكَ مَا بَقِىَ مِنْكُمْ أَحَدٌ. فَإِنَّهَا لِمَنْ أُعْطِيَهَا. وَإِنَّهَا لاَ تَرْجِعُ إِلَى صَاحِبِهَا مِنْ أَجْلِ أَنَّهُ أَعْطَى عَطَاءً وَقَعَتْ فِيهِ الْمَوَارِيثُ »."
            },
            {
                "hadithNo": "4191",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Jabir said: \"The kind of gift for life that the Messenger of Allah (s.a.w) allowed is only when a person says: 'It is for you and your children.' But if he says it is yours as long as you live, then it goes back to its owner.\" Ma'mar said: \"Az-Zuhri used to issue Fatwas to that effect.\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ - وَاللَّفْظُ لِعَبْدٍ - قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ عَنْ أَبِى سَلَمَةَ عَنْ جَابِرٍ قَالَ إِنَّمَا الْعُمْرَى الَّتِى أَجَازَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَنْ يَقُولَ هِىَ لَكَ وَلِعَقِبِكَ. فَأَمَّا إِذَا قَالَ هِىَ لَكَ مَا عِشْتَ. فَإِنَّهَا تَرْجِعُ إِلَى صَاحِبِهَا. قَالَ مَعْمَرٌ وَكَانَ الزُّهْرِىُّ يُفْتِى بِهِ."
            },
            {
                "hadithNo": "4192",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Jabir, who is (Jabir) bin 'Abdullah, that the Messenger of Allah (s.a.w) ruled concerning one who is given a gift for life that it belongs to him and his children, and it belongs to him absolutely, and it is not permissible for the giver to stipulate any conditions or make any exceptions. Abu Salamah said: \"Because he has given it in such a way that it is subject to the rules of inheritance, therefore any conditions that he may stipulate are overruled by the rules of inheritance.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِى فُدَيْكٍ عَنِ ابْنِ أَبِى ذِئْبٍ عَنِ ابْنِ شِهَابٍ عَنْ أَبِى سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرٍ - وَهُوَ ابْنُ عَبْدِ اللَّهِ - أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَضَى فِيمَنْ أُعْمِرَ عُمْرَى لَهُ وَلِعَقِبِهِ فَهِىَ لَهُ بَتْلَةً لاَ يَجُوزُ لِلْمُعْطِى فِيهَا شَرْطٌ وَلاَ ثُنْيَا. قَالَ أَبُو سَلَمَةَ لأَنَّهُ أَعْطَى عَطَاءً وَقَعَتْ فِيهِ الْمَوَارِيثُ فَقَطَعَتِ الْمَوَارِيثُ شَرْطَهُ."
            },
            {
                "hadithNo": "4193",
                "chapterNo": "4",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"The Messenger of Allah (s.a.w) said: 'A gift for life belongs to the one to whom it is given.\"'",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِىُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِى كَثِيرٍ حَدَّثَنِى أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « الْعُمْرَى لِمَنْ وُهِبَتْ لَهُ »."
            },
            {
                "hadithNo": "4194",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah that the Prophet of Allah (s.a.w) said... a similar report (as no. 4194).",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِى أَبِى عَنْ يَحْيَى بْنِ أَبِى كَثِيرٍ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ نَبِىَّ اللَّهِ -صلى الله عليه وسلم- قَالَ بِمِثْلِهِ."
            },
            {
                "hadithNo": "4195",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Jabir who attributed it to the Prophet (s.a.w) (a Hadith similar to no. 4194).",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ يَرْفَعُهُ إِلَى النَّبِىِّ -صلى الله عليه وسلم-."
            },
            {
                "hadithNo": "4196",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Jabir said: \"The Messenger of Allah (s.a.w) said: 'Keep your wealth and do not squander it, for whoever gives a gift for life, it belongs to the one to whom it was given, during his lifetime and after his death, and to his children.\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِى الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَمْسِكُوا عَلَيْكُمْ أَمْوَالَكُمْ وَلاَ تُفْسِدُوهَا فَإِنَّهُ مَنْ أَعْمَرَ عُمْرَى فَهِىَ لِلَّذِى أُعْمِرَهَا حَيًّا وَمَيِّتًا وَلِعَقِبِهِ »."
            },
            {
                "hadithNo": "4197",
                "chapterNo": "4",
                "hadithEnglish": "A Hadith like that of Abu Khaithamah (no. 4196) was narrated from Jabir from the Prophet (s.a.w). In the Hadith of Ayyub it adds: \"The Ansar started to give gifts for life to the Muhajirin, and the Messenger of Allah (s.a.w) said: 'Keep your wealth.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا حَجَّاجُ بْنُ أَبِى عُثْمَانَ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ عَنْ وَكِيعٍ عَنْ سُفْيَانَ ح وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ حَدَّثَنِى أَبِى عَنْ جَدِّى عَنْ أَيُّوبَ كُلُّ هَؤُلاَءِ عَنْ أَبِى الزُّبَيْرِ عَنْ جَابِرٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمَعْنَى حَدِيثِ أَبِى خَيْثَمَةَ وَفِى حَدِيثِ أَيُّوبَ مِنَ الزِّيَادَةِ قَالَ جَعَلَ الأَنْصَارُ يُعْمِرُونَ الْمُهَاجِرِينَ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَمْسِكُوا عَلَيْكُمْ أَمْوَالَكُمْ »."
            },
            {
                "hadithNo": "4198",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Az-Zubair, that Jabir said: \"A woman in Al-Madinah gave a garden of hers as a gift for life to a son of hers, then he died and she died after him, and he left behind a son, but he also had brothers who were the sons of the woman who had given the gift for life. The children of the woman who had given the gift said: 'The garden should come back to us.' But the sons of the one to whom it had been given said: 'No, it belonged to our father in life and in death.' They referred the dispute to Tariq, the freed slave of 'Uthman, and he called Jabir, who bore witness that the Messenger of Allah (s.a.w) had said, that a gift for life belonged to the one to whom it was given. Tariq ruled on that basis, then he wrote to 'Abdul-Malik and told him about that, and he told him of Jabir's testimony. 'Abdul-Malik said: 'Jabir spoke the truth.' So Tariq issued a ruling on that basis, and that garden still belongs to the descendents of the one to whom it was given for life, to this day.\"",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ وَإِسْحَاقُ بْنُ مَنْصُورٍ - وَاللَّفْظُ لاِبْنِ رَافِعٍ - قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ أَعْمَرَتِ امْرَأَةٌ بِالْمَدِينَةِ حَائِطًا لَهَا ابْنًا لَهَا ثُمَّ تُوُفِّىَ وَتُوُفِّيَتْ بَعْدَهُ وَتَرَكَتْ وَلَدًا وَلَهُ إِخْوَةٌ بَنُونَ لِلْمُعْمِرَةِ فَقَالَ وَلَدُ الْمُعْمِرَةِ رَجَعَ الْحَائِطُ إِلَيْنَا وَقَالَ بَنُو الْمُعْمَرِ بَلْ كَانَ لأَبِينَا حَيَاتَهُ وَمَوْتَهُ. فَاخْتَصَمُوا إِلَى طَارِقٍ مَوْلَى عُثْمَانَ فَدَعَا جَابِرًا فَشَهِدَ عَلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- بِالْعُمْرَى لِصَاحِبِهَا فَقَضَى بِذَلِكَ طَارِقٌ ثُمَّ كَتَبَ إِلَى عَبْدِ الْمَلِكِ فَأَخْبَرَهُ ذَلِكَ وَأَخْبَرَهُ بِشَهَادَةِ جَابِرٍ فَقَالَ عَبْدُ الْمَلِكِ صَدَقَ جَابِرٌ. فَأَمْضَى ذَلِكَ طَارِقٌ. فَإِنَّ ذَلِكَ الْحَائِطَ لِبَنِى الْمُعْمَرِ حَتَّى الْيَوْمِ."
            },
            {
                "hadithNo": "4199",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Sulaiman bin Yasar that Tariq ruled that a gift given for life belongs to the heir, because of what Jabir bin 'Abdullah narrated from the Messenger of Allah (s.a.w).",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لأَبِى بَكْرٍ قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّ طَارِقًا قَضَى بِالْعُمْرَى لِلْوَارِثِ لِقَوْلِ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم-."
            },
            {
                "hadithNo": "4200",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah that the Prophet (s.a.w) said: \"A gift for life is permissible.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « الْعُمْرَى جَائِزَةٌ »."
            },
            {
                "hadithNo": "4201",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Jabir that the Prophet (s.a.w) said: \"A gift for life is part of the estate of its owner.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِىُّ حَدَّثَنَا خَالِدٌ - يَعْنِى ابْنَ الْحَارِثِ - حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ عَطَاءٍ عَنْ جَابِرٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهُ قَالَ « الْعُمْرَى مِيرَاثٌ لأَهْلِهَا »."
            },
            {
                "hadithNo": "4202",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"A gift for life is permissible.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنِ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « الْعُمْرَى جَائِزَةٌ »."
            },
            {
                "hadithNo": "4203",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Qatadah (a Hadith similar· to no. 4201) with this chain, except that he said: \"part of the estate of its owner\" or he said, \"permissible.\"",
                "hadithArabic": "وَحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدٌ - يَعْنِى ابْنَ الْحَارِثِ - حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ « مِيرَاثٌ لأَهْلِهَا ». أَوْ قَالَ « جَائِزَةٌ »."
            }
        ]
    }
]