[
  {
    "SurahNumber": "38",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "For an explanation of this rendering of the adjurative\\n\\t\\t\\t\\tparticle wa, see first half of note [23] on  74:32 ."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "1",
    "NoteID": "3",
    "Body": "Or: \"endowed with eminence\" (Zamakhshari), since the term\\n\\t\\t\\t\\tdhikr (lit., \"reminder\" or \"remembrance\") has also the\\n\\t\\t\\t\\tconnotation of \"that which is remembered\", i.e.,\\n\\t\\t\\t\\t\"renown\", \"fame\" and, tropically, \"eminence\". As regards\\n\\t\\t\\t\\tthe rendering preferred by me, see i  1:10 , where the\\n\\t\\t\\t\\tphrase fihi dhikrukum (relating, as above, to the Qur'an)\\n\\t\\t\\t\\thas been translated as \"wherein is found all that you\\n\\t\\t\\t\\tought to bear in mind\", i.e., in order to attain to\\n\\t\\t\\t\\tdignity and happiness."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "2",
    "NoteID": "4",
    "Body": "I.e., they refuse to acknowledge the fact of divine\\n\\t\\t\\t\\trevelation because such an acknowledgment would imply an\\n\\t\\t\\t\\tadmission of man's responsibility to God - and this their\\n\\t\\t\\t\\tfalse pride, manifested in their arrogant belief in man's\\n\\t\\t\\t\\t\"self-sufficiency\", does not allow them to do. The same\\n\\t\\t\\t\\tidea is expressed in  16:22  and, in a more general way,\\n\\t\\t\\t\\tin  2:206 . Cf. also {96:6-7}."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "3",
    "NoteID": "5",
    "Body": "It is to be noted that the term qarn signifies not merely\\n\\t\\t\\t\\ta \"generation\" but also - and quite frequently in the\\n\\t\\t\\t\\tQur'an - \"people belonging to a particular period and\\n\\t\\t\\t\\tenvironment\", i.e., a \"civilization\" in the historical\\n\\t\\t\\t\\tconnotation of this word."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "3",
    "NoteID": "6",
    "Body": "Lit., \"while there was no time for escaping\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "4",
    "NoteID": "7",
    "Body": "Although this passage describes, in the first instance,\\n\\t\\t\\t\\tthe attitude of the pagan Quraysh towards the Prophet, it\\n\\t\\t\\t\\ttouches upon the reluctance of most people, at all times,\\n\\t\\t\\t\\tto recognize \"a man from their own midst\" - i.e., a human\\n\\t\\t\\t\\tbeing like themselves - as God-inspired. (See note [2] on\\n\\t\\t\\t\\t 50:2 .)"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "5",
    "NoteID": "8",
    "Body": "Divorced from its purely historical background, this\\n\\t\\t\\t\\tcriticism acquires a timeless significance, and may be\\n\\t\\t\\t\\tthus paraphrased: \"Does he claim that all creative powers\\n\\t\\t\\t\\tand qualities are inherent exclusively in what he\\n\\t\\t\\t\\tconceives as 'one God'?\" - a paraphrase which illustrates\\n\\t\\t\\t\\tthe tendency of many people to attribute a decisive\\n\\t\\t\\t\\tinfluence on human life - and, hence, a quasi-divine\\n\\t\\t\\t\\tstatus - to a variety of fortuitous phenomena or\\n\\t\\t\\t\\tcircumstances (like wealth, \"luck\", social position,\\n\\t\\t\\t\\tetc.) rather than to acknowledge the overwhelming\\n\\t\\t\\t\\tevidence, in all observable nature, of God's unique\\n\\t\\t\\t\\texistence."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "6",
    "NoteID": "9",
    "Body": "Lit., \"a thing desired\" or \"to be desired\", i.e., a\\n\\t\\t\\t\\tsensible course of action."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "7",
    "NoteID": "10",
    "Body": "I.e., \"in any of the faiths prevalent in our days\": an\\n\\t\\t\\t\\toblique reference to Christianity and its dogma of the\\n\\t\\t\\t\\tTrinity, which contrasts with the Qur'anic concept of\\n\\t\\t\\t\\tGod's oneness and uniqueness, as well as to any other\\n\\t\\t\\t\\tfaith based on the belief in a multiplicity or multiform\\n\\t\\t\\t\\tincarnation of divine powers (e.g., Hinduism with its\\n\\t\\t\\t\\ttriad of Brahma, Vishnu and Shiva)."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "8",
    "NoteID": "11",
    "Body": "Lit., \"that they are in doubt of\": i.e., it is not the\\n\\t\\t\\t\\tpersonality of the Prophet that fills them with distrust,\\n\\t\\t\\t\\tbut, rather, the substance of the message proclaimed by\\n\\t\\t\\t\\thim - and, in particular, his insistence on God's\\n\\t\\t\\t\\tabsolute oneness and uniqueness, which runs counter to\\n\\t\\t\\t\\ttheir habits of thought and social traditions."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "8",
    "NoteID": "12",
    "Body": "Sc., \"on people who refuse to accept the truth\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "9",
    "NoteID": "13",
    "Body": "I.e., \"Do they think that it is for them to decide as to\\n\\t\\t\\t\\twho should and who should not be graced with divine\\n\\t\\t\\t\\trevelation?\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "10",
    "NoteID": "14",
    "Body": "I.e., \"Do they think that human beings are so highly\\n\\t\\t\\t\\tendowed that they are bound to attain, some day, to\\n\\t\\t\\t\\tmastery over the universe and all nature, and thus to\\n\\t\\t\\t\\tGod-like power?\" Cf. in this connection {96:6-8} and the\\n\\t\\t\\t\\tcorresponding note [4]. - As regards my rendering of\\n\\t\\t\\t\\tal-asbab as \"all [conceivable] means\", see note [82] on\\n\\t\\t\\t\\t 18:84 ."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "11",
    "NoteID": "15",
    "Body": "The collective noun jund, which primarily denotes \"a\\n\\t\\t\\t\\thost\" or \"an army\", has also the meaning of \"created\\n\\t\\t\\t\\tbeings\", in this context obviously human beings; in\\n\\t\\t\\t\\tcombination with the particle ma, \"any number of human\\n\\t\\t\\t\\tbeings\". The term hizb (of which ahzab is the plural), on\\n\\t\\t\\t\\tthe other hand, denotes \"a party\" or \"a group of people\\n\\t\\t\\t\\tof the same mind\" or \"people leagued together\", i.e., for\\n\\t\\t\\t\\ta definite purpose."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "12",
    "NoteID": "16",
    "Body": "Lit., \"before them\", i.e., before the people who opposed\\n\\t\\t\\t\\tor oppose Muhammad's message."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "12",
    "NoteID": "17",
    "Body": "In classical Arabic, this ancient bedouin term is used\\n\\t\\t\\t\\tidiomatically as a metonym for \"mighty dominion\" or\\n\\t\\t\\t\\t\"firmness of power\" (Zamakhshari). The number of poles\\n\\t\\t\\t\\tsupporting a bedouin tent is determined by its size, and\\n\\t\\t\\t\\tthe latter has always depended on the status and power of\\n\\t\\t\\t\\tits owner: thus, a mighty chieftain is often alluded to\\n\\t\\t\\t\\tas \"he of many tent-poles\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "15",
    "NoteID": "18",
    "Body": "Sc., \"beyond the term set for it by God\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "16",
    "NoteID": "19",
    "Body": "Cf.  8:32 . This mocking \"demand\" of the unbelievers is\\n\\t\\t\\t\\tmentioned in several other places in the Qur'an."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "18",
    "NoteID": "20",
    "Body": "Lit., \"We compelled\" or \"constrained\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "19",
    "NoteID": "21",
    "Body": "See surah {21}, note [73]."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "21",
    "NoteID": "22",
    "Body": "The story which, according to the oldest sources at our\\n\\t\\t\\t\\tdisposal, is alluded to in verses {21-26} affects the\\n\\t\\t\\t\\tquestion as to whether God's elect, the prophets - all of\\n\\t\\t\\t\\twhom were endowed, like David, with \"wisdom and sagacity\\n\\t\\t\\t\\tin judgment\" - could or could not ever commit a sin: in\\n\\t\\t\\t\\tother words, whether they, too, were originally subject\\n\\t\\t\\t\\tto the weaknesses inherent in human nature as such or\\n\\t\\t\\t\\twere a priori endowed with an essential purity of\\n\\t\\t\\t\\tcharacter which rendered each of them \"incapable of\\n\\t\\t\\t\\tsinning\" (ma'sum). In the form in which it has been\\n\\t\\t\\t\\thanded down from the earliest authorities (including,\\n\\t\\t\\t\\taccording to Tabari and Baghawi, Companions like 'Abd\\n\\t\\t\\t\\tAllah ibn'Abbas and Anas ibn Malik, as well as several of\\n\\t\\t\\t\\tthe most prominent of their immediate successors), the\\n\\t\\t\\t\\tstory contradicts the doctrine - somewhat arbitrarily\\n\\t\\t\\t\\tdeveloped by Muslim theologians in the course of the\\n\\t\\t\\t\\tcenturies - that prophets cannot sin by virtue of their\\n\\t\\t\\t\\tvery nature, and tends to show that their purity and\\n\\t\\t\\t\\tsubsequent sinlessness is a result of inner struggles and\\n\\t\\t\\t\\ttrials and, thus, represents in each case a moral\\n\\t\\t\\t\\tachievement rather than an inborn quality. As narrated in\\n\\t\\t\\t\\tsome detail by Tabari and other early commentators, David\\n\\t\\t\\t\\tfell in love with a beautiful woman whom he accidentally\\n\\t\\t\\t\\tobserved from his roof terrace. On inquiring, he was told\\n\\t\\t\\t\\tthat she was the wife of one of his officers, named\\n\\t\\t\\t\\tUriah. Impelled by his passion, David ordered his\\n\\t\\t\\t\\tfield-commander to place Uriah in a particularly exposed\\n\\t\\t\\t\\tbattle position, where he would be certain to be killed;\\n\\t\\t\\t\\tand as soon as his order was fulfilled and Uriah died,\\n\\t\\t\\t\\tDavid married the widow (who subsequently became the\\n\\t\\t\\t\\tmother of Solomon). This story agrees more or less with\\n\\t\\t\\t\\tthe Old Testament, which gives the woman's name as\\n\\t\\t\\t\\tBath-Sheba (II Samuel xi), barring the Biblical\\n\\t\\t\\t\\tallegation that David committed adultery with her before\\n\\t\\t\\t\\tUriah's death (ibid. xi, 4-5) - an allegation which has\\n\\t\\t\\t\\talways been rejected by Muslims as highly offensive and\\n\\t\\t\\t\\tslanderous: cf. the saying of the fourth Caliph, 'Ali ibn\\n\\t\\t\\t\\tAbi Talib (quoted by Zamakhshari on the authority of\\n\\t\\t\\t\\tSa'id ibn al-Musayyab): \"If anyone should narrate the\\n\\t\\t\\t\\tstory of David in the manner in which the story-tellers\\n\\t\\t\\t\\tnarrate it, I will have him flogged with one hundred and\\n\\t\\t\\t\\tsixty stripes - for this is a [suitable] punishment for\\n\\t\\t\\t\\tslandering prophets\" (thus indirectly recalling the\\n\\t\\t\\t\\tQur'anic ordinance, in  24:4 , which stipulates flogging\\n\\t\\t\\t\\twith eighty stripes for accusing ordinary persons of\\n\\t\\t\\t\\tadultery without legal proof). According to most of the\\n\\t\\t\\t\\tcommentators, the two \"litigants\" who suddenly appeared\\n\\t\\t\\t\\tbefore David were angels sent to bring home to him his\\n\\t\\t\\t\\tsin. It is possible, however, to see in their appearance\\n\\t\\t\\t\\tan allegory of David's own realization of having sinned:\\n\\t\\t\\t\\tvoices of his own conscience which at last \"surmounted\\n\\t\\t\\t\\tthe walls\" of the passion that had blinded him for a\\n\\t\\t\\t\\ttime."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "24",
    "NoteID": "23",
    "Body": "The term khulata' (sing. khalit) denotes, literally,\\n\\t\\t\\t\\t\"people who mix [i.e., are familiar or intimate] with\\n\\t\\t\\t\\tothers or with one another\". In the present instance it\\n\\t\\t\\t\\tevidently alludes to the \"brotherhood\" between the two\\n\\t\\t\\t\\tmysterious litigants, and is therefore best rendered as\\n\\t\\t\\t\\t\"kinsmen\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "24",
    "NoteID": "24",
    "Body": "Sc., \"and that he had failed\" (in the matter of\\n\\t\\t\\t\\tBath-Sheba)."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "27",
    "NoteID": "25",
    "Body": "Cf.  3:191 . The above statement appears in the Qur'an in\\n\\t\\t\\t\\tseveral formulations; see, in particular, note [11] on\\n\\t\\t\\t\\t 10:5 . In the present instance it connects with the\\n\\t\\t\\t\\tmention of the Day of Reckoning in the preceding verse,\\n\\t\\t\\t\\tthus leading organically from a specific aspect of\\n\\t\\t\\t\\tDavid's story to a moral teaching of wider import."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "27",
    "NoteID": "26",
    "Body": "I.e., a deliberate rejection of the belief that the\\n\\t\\t\\t\\tuniverse - and, in particular, human life - is imbued\\n\\t\\t\\t\\twith meaning and purpose leads unavoidably - though\\n\\t\\t\\t\\tsometimes imperceptibly - to a rejection of all moral\\n\\t\\t\\t\\timperatives, to spiritual blindness and, hence, to\\n\\t\\t\\t\\tsuffering in the life to come."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "28",
    "NoteID": "27",
    "Body": "By implication, belief in resurrection, judgment and life\\n\\t\\t\\t\\tafter death is postulated in this passage (verses\\n\\t\\t\\t\\t{27-28}) as a logical corollary - almost a premise - of\\n\\t\\t\\t\\tall belief in God: for, since we see that many righteous\\n\\t\\t\\t\\tpeople suffer all manner of misery and deprivations in\\n\\t\\t\\t\\tthis world, while, on the other hand, many of the wicked\\n\\t\\t\\t\\tand depraved enjoy their lives in peace and affluence, we\\n\\t\\t\\t\\tmust either assume that God does not exist (because the\\n\\t\\t\\t\\tconcept of injustice is incompatible with that of\\n\\t\\t\\t\\tGodhead), or - alternatively - that there is a hereafter\\n\\t\\t\\t\\tin which both the righteous and the unrighteous will\\n\\t\\t\\t\\tharvest in full what they had morally sown during their\\n\\t\\t\\t\\tlives on earth."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "30",
    "NoteID": "28",
    "Body": "I.e., he would always think of God, as illustrated by the\\n\\t\\t\\t\\texample given in the sequence."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "32",
    "NoteID": "29",
    "Body": "Lit., \"because of [or \"out of\"] ('an) the remembrance of\\n\\t\\t\\t\\tmy Sustainer\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "32",
    "NoteID": "30",
    "Body": "This and the preceding interpolation are based on Razi's\\n\\t\\t\\t\\tinterpretation of this passage."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "33",
    "NoteID": "31",
    "Body": "The story of Solomon's love of beautiful horses is meant\\n\\t\\t\\t\\tto show that all true love of God is bound to be\\n\\t\\t\\t\\treflected in one's realization of, and reverence for, the\\n\\t\\t\\t\\tbeauty created by Him."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "34",
    "NoteID": "32",
    "Body": "To explain this verse, some of the commentators advance\\n\\t\\t\\t\\tthe most fantastic stories, almost all of them going back\\n\\t\\t\\t\\tto Talmudic sources. Razi rejects them all, maintaining\\n\\t\\t\\t\\tthat they are unworthy of serious consideration. Instead,\\n\\t\\t\\t\\the plausibly suggests that the \"body\" (jasad) upon\\n\\t\\t\\t\\tSolomon's throne is an allusion to his own body, and -\\n\\t\\t\\t\\tmetonymically - to his kingly power, which was bound to\\n\\t\\t\\t\\tremain \"lifeless\" so long as it was not inspired by\\n\\t\\t\\t\\tGod-willed ethical values. (It is to be borne in mind\\n\\t\\t\\t\\tthat in classical Arabic a person utterly weakened by\\n\\t\\t\\t\\tillness, worry or fear, or devoid of moral values, is\\n\\t\\t\\t\\toften described as \"a body without a soul\".) In other\\n\\t\\t\\t\\twords, Solomon's early trial consisted in his inheriting\\n\\t\\t\\t\\tno more than a kingly position, and it rested upon him to\\n\\t\\t\\t\\tendow that position with spiritual essence and meaning."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "35",
    "NoteID": "33",
    "Body": "I.e., a spiritual kingdom, which could not be inherited\\n\\t\\t\\t\\tby anyone and, hence, would not be exposed to envy or\\n\\t\\t\\t\\tworldly intrigue."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "36",
    "NoteID": "34",
    "Body": "I.e., as a reward for his humility and turning-away from\\n\\t\\t\\t\\tworldly ambitions, implied in the prayer, \"Forgive me my\\n\\t\\t\\t\\tsins\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "36",
    "NoteID": "35",
    "Body": "Cf.  21:81  and the corresponding note [75]. For the\\n\\t\\t\\t\\tmeaning, in general, of the many legends surrounding the\\n\\t\\t\\t\\tperson of Solomon, see note [77] on  21:82 ."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "38",
    "NoteID": "36",
    "Body": "I.e., subdued and, as it were, tamed by him: see note\\n\\t\\t\\t\\t[76] on  21:82 , which explains my rendering, in this\\n\\t\\t\\t\\tcontext, of shayatln as \"rebellious forces\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "41",
    "NoteID": "37",
    "Body": "See note [78] on  21:83 ."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "41",
    "NoteID": "38",
    "Body": "I.e., with life-weariness in consequence of suffering. As\\n\\t\\t\\t\\tsoon as he realizes that God has been testing him, Job\\n\\t\\t\\t\\tperceives that his utter despondency and weariness of\\n\\t\\t\\t\\tlife - eloquently described in the Old Testament (The\\n\\t\\t\\t\\tBook of Job iii) - was but due to what is described as\\n\\t\\t\\t\\t\"Satan's whisperings\": this is the moral to be drawn from\\n\\t\\t\\t\\tthe above evocation of Job's story."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "42",
    "NoteID": "39",
    "Body": "According to the classical commentators, the miraculous\\n\\t\\t\\t\\tappearance of a healing spring heralded the end of Job's\\n\\t\\t\\t\\tsuffering, both physical and mental."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "43",
    "NoteID": "40",
    "Body": "Lit., \"his family\" (cf.  21:84  and the corresponding\\n\\t\\t\\t\\tnote [79])."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "44",
    "NoteID": "41",
    "Body": "In the words of the Bible (The Book of Job ii, 9), at the\\n\\t\\t\\t\\ttime of his seemingly hopeless suffering Job's wife\\n\\t\\t\\t\\treproached her husband for persevering in his faith:\\n\\t\\t\\t\\t\"Doss thou still retain thine integrity? Curse God, and\\n\\t\\t\\t\\tdie.\" According to the classical Qur'an-commentators, Job\\n\\t\\t\\t\\tswore that, if God would restore him to health, he would\\n\\t\\t\\t\\tpunish her blasphemy with a hundred stripes. But when he\\n\\t\\t\\t\\tdid recover, he bitterly regretted his hasty oath, for he\\n\\t\\t\\t\\trealized that his wife's \"blasphemy\" had been an outcome\\n\\t\\t\\t\\tof her love and pity for him; and thereupon he was told\\n\\t\\t\\t\\tin a revelation that he could fulfil his vow in a\\n\\t\\t\\t\\tsymbolic manner by striking her once with \"a bunch of\\n\\t\\t\\t\\tgrass containing a hundred blades or more\". (Cf. 5:89  -\\n\\t\\t\\t\\t'God will not take you to task for oaths which you may\\n\\t\\t\\t\\thave uttered without thought.\")"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "46",
    "NoteID": "42",
    "Body": "Lit., \"of the [final] abode\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "48",
    "NoteID": "43",
    "Body": "Al-Yasa' in Arabic - the Biblical prophet who succeeded\\n\\t\\t\\t\\tElijah (see surah {37}, note [48])."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "48",
    "NoteID": "44",
    "Body": "For an explanation of this rendering of dhu 'l-kifl, see\\n\\t\\t\\t\\tsurah {21}, note [81]."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "50",
    "NoteID": "45",
    "Body": "In all the eleven instances in which the noun 'adn occurs\\n\\t\\t\\t\\tin the Qur'an - and of which the present is the oldest -\\n\\t\\t\\t\\tit is used as a qualifying term for the \"gardens\"\\n\\t\\t\\t\\t(jannat) of paradise. This noun is derived from the verb\\n\\t\\t\\t\\t'adana, which primarily denotes \"he remained [somewhere]\"\\n\\t\\t\\t\\tor \"he kept [to something]\", i.e., permanently: cf. the\\n\\t\\t\\t\\tphrase adantu l-balad (\"I remained for good [or\\n\\t\\t\\t\\t\"settled\"] in the country\"). In Biblical Hebrew - which,\\n\\t\\t\\t\\tafter all, is but a very ancient Arabian dialect - the\\n\\t\\t\\t\\tclosely related noun 'eden has also the additional\\n\\t\\t\\t\\tconnotation of \"delight\", \"pleasure\" or \"bliss\". Hence\\n\\t\\t\\t\\tthe combination of the two concepts in my rendering of\\n\\t\\t\\t\\t'adn as \"perpetual bliss\". As in many other places in the\\n\\t\\t\\t\\tQur'an, this bliss is here allegorized - and thus brought\\n\\t\\t\\t\\tcloser to man's imagination - by means of descriptions\\n\\t\\t\\t\\trecallinc earthly iovs."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "52",
    "NoteID": "46",
    "Body": "Lit., \"such as restrain their gaze\", i.e., are of modest\\n\\t\\t\\t\\tbearing and have eyes only for their mates (Razi). This\\n\\t\\t\\t\\tallegorical reference to the delights of paradise occurs\\n\\t\\t\\t\\tin the Qur'an three times (apart from the above instance,\\n\\t\\t\\t\\twhich is chronologically the earliest, in  37:48  and\\n\\t\\t\\t\\t 55:56  as well). As an allegory, this phrase evidently\\n\\t\\t\\t\\tapplies to the righteous of both sexes, who in the life\\n\\t\\t\\t\\tto come will be rejoined with those whom they loved and\\n\\t\\t\\t\\tby whom they were loved in this world: for, \"God has\\n\\t\\t\\t\\tpromised the believers, both men and women, gardens\\n\\t\\t\\t\\tthrough which running waters flow, therein to abide, and\\n\\t\\t\\t\\tgoodly dwellings in gardens of perpetual bliss\" ( 9:72 );\\n\\t\\t\\t\\tand, \"anyone - be it man or woman - who does [whatever he\\n\\t\\t\\t\\tcan] of good deeds and is a believer withal, shall enter\\n\\t\\t\\t\\tparadise\" ( 4:124 , with similar statements in  16:97 \\n\\t\\t\\t\\tand  40:40 ). Finally, we are told in  36:56  that in\\n\\t\\t\\t\\tthis paradise \"will they and their spouses on couches\\n\\t\\t\\t\\trecline\" - i.e., will find peace and inner fulfilment\\n\\t\\t\\t\\twith and in one another. (For an explanation of the term\\n\\t\\t\\t\\tatrab rendered by me as \"well-matched\", see note [15] on\\n\\t\\t\\t\\t 56:38 .)"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "58",
    "NoteID": "47",
    "Body": "Lit., \"of its kind\": i.e., corresponding in intensity to\\n\\t\\t\\t\\twhat the Qur'an describes as hamim and ghassaq. For my\\n\\t\\t\\t\\trendering of hamim as \"burning despair\", see surah {6},\\n\\t\\t\\t\\tnote [62]. The term ghassaq, on the other hand, is\\n\\t\\t\\t\\tderived from the verb ghasaqa, \"it became dark\" or\\n\\t\\t\\t\\t\"intensely dark\" (Taj al-'Arus); thus, al-ghasiq denotes\\n\\t\\t\\t\\t\"black darkness\" and, tropically, \"the night\" or, rather,\\n\\t\\t\\t\\t\"the black night\". According to some authorities, the\\n\\t\\t\\t\\tform ghassaq signifies \"intense [or \"icy\"] cold\". A\\n\\t\\t\\t\\tcombination of these two meanings gives us the concept of\\n\\t\\t\\t\\tthe \"ice-cold darkness\" of the spirit which, together\\n\\t\\t\\t\\twith \"burning despair\" (hamim), will characterize the\\n\\t\\t\\t\\tsuffering of inveterate sinners in the life to come. All\\n\\t\\t\\t\\tother interpretations of the term ghasseq are purely\\n\\t\\t\\t\\tspeculative and, therefore, irrelevant."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "59",
    "NoteID": "48",
    "Body": "I.e., \"people whom you had seduced, and who thereupon\\n\\t\\t\\t\\tblindly followed you\": an apostrophe stressing the double\\n\\t\\t\\t\\tresponsibility of the seducers."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "59",
    "NoteID": "49",
    "Body": "In Arabic usage, the phrase \"no welcome to them\" or \"to\\n\\t\\t\\t\\tyou\" (la marhaban bihim, resp. bikum) is equivalent to a\\n\\t\\t\\t\\tcurse. In this context - carried on into the next verse -\\n\\t\\t\\t\\tit expresses a mutual disavowal of the seducers and the\\n\\t\\t\\t\\tseduced."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "61",
    "NoteID": "50",
    "Body": "Cf.  7:38  (and the corresponding notes [28] and [29]) as\\n\\t\\t\\t\\twell as {33:67-68}."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "63",
    "NoteID": "51",
    "Body": "I.e., the prophets and the righteous, who - as the Qur'an\\n\\t\\t\\t\\tpoints out in many places - have always been derided by\\n\\t\\t\\t\\tpeople enamoured of the life of this world and,\\n\\t\\t\\t\\ttherefore, averse to all moral exhortation."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "69",
    "NoteID": "52",
    "Body": "For the allegorical contention of the angels (\"the host\\n\\t\\t\\t\\ton high\") against the creation of man, see  2:30  ff. and\\n\\t\\t\\t\\tthe corresponding notes [22-24]. The allegory of man's\\n\\t\\t\\t\\tcreation, of God's command to the angels to \"prostrate\\n\\t\\t\\t\\tthemselves\" before the new creature, and of lblis'\\n\\t\\t\\t\\trefusal to do so appears in the Qur'an six times\\n\\t\\t\\t\\t({2:30-34},  7:11  ff., {15:28-44}, {17:61-65},  18:50 ,\\n\\t\\t\\t\\tand {38:69-85}) each time with an accent on a different\\n\\t\\t\\t\\taspect of this allegory. In the present instance (which\\n\\t\\t\\t\\tis undoubtedly the earliest in the chronology of\\n\\t\\t\\t\\trevelation) it is connected with the statement, in\\n\\t\\t\\t\\t 2:31 , that God \"imparted unto Adam the names of all\\n\\t\\t\\t\\tthings\", i.e., endowed man with the faculty of conceptual\\n\\t\\t\\t\\tthinking (see note [23] on  2:31 ) and, thus, with the\\n\\t\\t\\t\\tability to discern between what is true and what false.\\n\\t\\t\\t\\tSince he possesses this faculty, man has no excuse for\\n\\t\\t\\t\\tnot realizing God's existence and oneness - the \"message\\n\\t\\t\\t\\ttremendous\" referred to in the preceding passage."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "70",
    "NoteID": "53",
    "Body": "Lit., \"otherwise than that I be (illa annama ana) a plain\\n\\t\\t\\t\\twarner\" - i.e., of the prospect of spiritual\\n\\t\\t\\t\\tself-destruction inherent in a wilful disregard of the\\n\\t\\t\\t\\tfact of God's existence and oneness, which is the core of\\n\\t\\t\\t\\tall religious cognition and, hence, of all true\\n\\t\\t\\t\\tprophethood."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "71",
    "NoteID": "54",
    "Body": "For this rendering of idh, see surah {2}, note [21]."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "71",
    "NoteID": "55",
    "Body": "See note [24] on  15:26 ."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "72",
    "NoteID": "56",
    "Body": "See  15:29  and the corresponding note [26]."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "74",
    "NoteID": "57",
    "Body": "See note [26] on  2:34  and note [31] on  15:41 ."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "75",
    "NoteID": "58",
    "Body": "Cf. the metaphorical phrase \"the things which Our hands\\n\\t\\t\\t\\thave wrought\" in  36:71 , explained in the corresponding\\n\\t\\t\\t\\tnote [42]. In the present instance, the stress lies on\\n\\t\\t\\t\\tthe God-willed superiority of man's intellect - which,\\n\\t\\t\\t\\tlike everything else in the universe, is God's\\n\\t\\t\\t\\t\"handiwork\" - over the rest of creation (see note [25] on\\n\\t\\t\\t\\t 2:34 )."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "75",
    "NoteID": "59",
    "Body": "This \"question\" is, of course, only rhetorical, since God\\n\\t\\t\\t\\tis omniscient. The phrase interpolated by me (\"to bow\\n\\t\\t\\t\\tdown before another created being\") reflects Zamakshari's\\n\\t\\t\\t\\tinterpretation of this passage."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "76",
    "NoteID": "60",
    "Body": "I.e., out of something non-corporeal and, therefore (in\\n\\t\\t\\t\\tthe view of Iblis), superior to the \"clay\" out of which\\n\\t\\t\\t\\tman has been created. Inasmuch as \"fire\" is a symbol of\\n\\t\\t\\t\\tpassion, the above \"saying\" of Iblis contains, I believe,\\n\\t\\t\\t\\ta subtle allusion to the Qur'anic concept of the \"satanic\\n\\t\\t\\t\\tforces\" (shayatin) active within man's own heart: forces\\n\\t\\t\\t\\tengendered by uncontrolled passions and love of self,\\n\\t\\t\\t\\tsymbolized by the preceding characterization of Iblis,\\n\\t\\t\\t\\tthe foremost of the shayatin, as \"one of those who think\\n\\t\\t\\t\\tonly of themselves as high\" (min al-'al~n)."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "81",
    "NoteID": "61",
    "Body": "The grant of \"respite\" to Iblis implies that he would\\n\\t\\t\\t\\thave the power to tempt man until the end of time."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "84",
    "NoteID": "62",
    "Body": "Cf.  15:41  - \"This is, with Me, a straight way\" - and\\n\\t\\t\\t\\tthe corresponding note [31]."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "86",
    "NoteID": "63",
    "Body": "The expression mutakallif denotes, primarily, \"a person\\n\\t\\t\\t\\twho takes too much upon himself\", be it in action or in\\n\\t\\t\\t\\tfeeling; hence, a person who pretends to be more than he\\n\\t\\t\\t\\treally is, or to feel what he does not really feel. In\\n\\t\\t\\t\\tthis instance, it indicates the Prophet s disclaimer of\\n\\t\\t\\t\\tany \"supernatural\" status."
  }
]
