[
  {
    "SurahNumber": "57",
    "AyahNumber": "1",
    "NoteID": "5275",
    "Body": "A connecting thought between this and the last Sura, of\\n\\t\\t\\t\\twhich see verse 96. See also paragraph 3 of the\\n\\t\\t\\t\\tIntroduction to S. liii."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "3",
    "NoteID": "5276",
    "Body": "Allah is Evident in so far as there is ample evidence of\\n\\t\\t\\t\\tHis existence and providence all around us. On the other\\n\\t\\t\\t\\thand, Allah is Hidden in so far as intellect cannot grasp\\n\\t\\t\\t\\tHis essence nor can He be seen in the present world. The\\n\\t\\t\\t\\tfollowing tradition in Sahih Muslim is also significant\\n\\t\\t\\t\\tfor an understanding of this verse. The Prophet (peace be\\n\\t\\t\\t\\ton him) said: \"Thou art the First, so that there was\\n\\t\\t\\t\\tnothing before Thee; and Thou art the Last, so that there\\n\\t\\t\\t\\tis nothing after Thee; and Thou art Evident, (or\\n\\t\\t\\t\\tAscendant) so that there is nothing above Thee, and Thou\\n\\t\\t\\t\\tart the the Hidden, the Knower of hidden things, so that\\n\\t\\t\\t\\tthere is nothing hidden from Thee.\""
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "4",
    "NoteID": "5277",
    "Body": "\"In six Days\": see xli. 9-12, and notes; also more\\n\\t\\t\\t\\tbriefly, n. 1031 to vii. 54."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "4",
    "NoteID": "5278",
    "Body": "Cf. x. 3, and n. 1386. It is not that Allah completed His\\n\\t\\t\\t\\tCreation in six days and rested on the seventh day, or\\n\\t\\t\\t\\trests now. Certain external forms of the universe were by\\n\\t\\t\\t\\tAllah's Command completed in six periods of evolution.\\n\\t\\t\\t\\tBut His creative process still goes on, and He is still,\\n\\t\\t\\t\\tand will always be, in full control, knowing all and\\n\\t\\t\\t\\tguiding all affairs."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "4",
    "NoteID": "5279",
    "Body": "Allah watches over man and observes his deeds. His\\n\\t\\t\\t\\tknowledge comprehends all, the earth, heavens, what is in\\n\\t\\t\\t\\tthem or above them or whatever is in between them, comes\\n\\t\\t\\t\\tout of them or goes into them, for \"not a leaf doth fall\\n\\t\\t\\t\\tbut with His knowledge\", and \"there is not a grain in the\\n\\t\\t\\t\\tdarkness (or depths) of the earth, nor anything fresh or\\n\\t\\t\\t\\tdry (green or withered), but is inscribed in a Record\".\\n\\t\\t\\t\\t(vi. 59)."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "5",
    "NoteID": "5280",
    "Body": "See lvii. 2 above, where this phrase referred to Allah's\\n\\t\\t\\t\\tcomplete authority over the whole of the external\\n\\t\\t\\t\\tuniverse: the same phrase now refers to His complete\\n\\t\\t\\t\\tauthority over the abstract world-of thoughts and\\n\\t\\t\\t\\taffairs. Every affair must finally go back to Him,\\n\\t\\t\\t\\twhether it comes out here from Darkness into Light, or\\n\\t\\t\\t\\thides itself from Light into Darkness. Allah's knowledge\\n\\t\\t\\t\\tpenetrates into the imnost recesses of all Hearts."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "7",
    "NoteID": "5281",
    "Body": "Whenever power or wealth or influence or any good thing\\n\\t\\t\\t\\tis transferred from one person or group of persons to\\n\\t\\t\\t\\tanother, it involves added responsibilities to the\\n\\t\\t\\t\\tpersons receiving these advantages. They must be the more\\n\\t\\t\\t\\tzealous in real charity and all good works, for that is a\\n\\t\\t\\t\\tpart of the evidence which they give of their faith and\\n\\t\\t\\t\\tgratitude. And, besides, their good deeds carry their own\\n\\t\\t\\t\\treward."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "8",
    "NoteID": "5282",
    "Body": "A figure of speech implying a far wider meaning than the\\n\\t\\t\\t\\twords express. It is equivalent to saying: \"There is\\n\\t\\t\\t\\tevery reason why ye should believe in Allah\", etc. The\\n\\t\\t\\t\\tsame construction applies to verse 10 below."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "8",
    "NoteID": "5283",
    "Body": "There are two shades of meaning. (1) There is the implied\\n\\t\\t\\t\\tCovenant in a man who accepts the Gospel of Unity that he\\n\\t\\t\\t\\twill bring forth all the fruits of that Gospel, i.e.,\\n\\t\\t\\t\\tbelieve in Allah, and serve Allah and humanity. See n.\\n\\t\\t\\t\\t682 to v. 1. (2) There were at various times express\\n\\t\\t\\t\\tCovenants entered into by the Muslims to serve Allah and\\n\\t\\t\\t\\tbe true to the Prophet, comparable to the Covenants of\\n\\t\\t\\t\\tthe Jewish nation about the Message of Moses; e.g., the\\n\\t\\t\\t\\ttwo Covenants of 'Aqaba (v. 8, and n. 705) and the Pledge\\n\\t\\t\\t\\tof Hudaibiya (xlviii. 10, n. 4877). For the Covenant with\\n\\t\\t\\t\\tIsrael at Mount Sinai, see. ii. 63, n. 78."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "9",
    "NoteID": "5284",
    "Body": "THe holy Prophet Muhammad. The Signs sent to him were:\\n\\t\\t\\t\\t(1) the Ayats of the Qur-an, and (2) his life and work,\\n\\t\\t\\t\\tin which Allah's Plan and Purpose were unfolded."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "10",
    "NoteID": "5285",
    "Body": "\"To Allah belongs the heritage of...\": see n. 485 to iii.\\n\\t\\t\\t\\t180; also n. 988 to vi. 165; and n. 1964 to xv. 23."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "10",
    "NoteID": "5286",
    "Body": "This is usually understood to refer to the Conquest of\\n\\t\\t\\t\\tMakkah, after which the Muslims succeeded to the power\\n\\t\\t\\t\\tand position which the Pagan Quraish had so misused at\\n\\t\\t\\t\\tMakkah. Thereafter the Muslims had the hegemony of\\n\\t\\t\\t\\tArabia, and in a few centuries, for a time, the hegemony\\n\\t\\t\\t\\tof the world. But the words are perfectly general, and we\\n\\t\\t\\t\\tmust understand the general meaning also: that the people\\n\\t\\t\\t\\twho fight and struggle in Allah's Cause and give of their\\n\\t\\t\\t\\tbest to it at any time are worthy of praise: but those\\n\\t\\t\\t\\tare worthy of special distinction who do it when the\\n\\t\\t\\t\\tCause is being persecuted and in most need of assistance,\\n\\t\\t\\t\\tbefore victory comes."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "11",
    "NoteID": "5287",
    "Body": "Cf. ii. 245, n. 276."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "12",
    "NoteID": "5288",
    "Body": "In the Darkness of the Day of Judgment there will be a\\n\\t\\t\\t\\tLight to guide the righteous to their Destination. This\\n\\t\\t\\t\\twill be the Light of their Faith and their Good Works.\\n\\t\\t\\t\\tPerhaps the Light of the Right Hand mentioned here is the\\n\\t\\t\\t\\tLight of their Good Works: for the Blessed will receive\\n\\t\\t\\t\\ttheir Record in their right hand (lxix. 19-24)."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "12",
    "NoteID": "5289",
    "Body": "The highest Achievement, the highest felicity, the\\n\\t\\t\\t\\tattainment of Salvation, the fulfilment of all desires.\\n\\t\\t\\t\\tSee n. 4733 to xliv. 57."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "13",
    "NoteID": "5290",
    "Body": "Watchful preparation in Life, and the light of Faith,\\n\\t\\t\\t\\twhich reflects the divine Light, are matters of personal\\n\\t\\t\\t\\tLife, and cannot be borrowed from another. So, in\\n\\t\\t\\t\\tChrist's parable of the Ten Virgins (Matt. xv. 1-13),\\n\\t\\t\\t\\twhen the foolish ones had let their lamps go out for want\\n\\t\\t\\t\\tof oil, they asked to borrow oil from the wise ones, but\\n\\t\\t\\t\\tthe wise ones answered and said, \"Not so;...but go ye\\n\\t\\t\\t\\trather to them that sell, and buy for yourselves\"."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "13",
    "NoteID": "5291",
    "Body": "The wall will divide the Good from the Evil. But the\\n\\t\\t\\t\\tGateway in it will show that communication will not be\\n\\t\\t\\t\\tcut off. Evil must realise that Good-ie., Mercy and\\n\\t\\t\\t\\tFelicity-had been within its reach, and that the Wrath\\n\\t\\t\\t\\twhich envelops it is due to its own rejection of Mercy."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "14",
    "NoteID": "5292",
    "Body": "The evil will now claim some right of kinship or\\n\\t\\t\\t\\tassociation or proximity with the good in earthly fife;\\n\\t\\t\\t\\tbut in fact they had been arrogant and had selfishly\\n\\t\\t\\t\\tdespised them before. The reply will be: (1) you\\n\\t\\t\\t\\tyourselves chose temptation and evil; (2) when you had\\n\\t\\t\\t\\tpower in your earthly life, you hoped for ruin to the\\n\\t\\t\\t\\tgood, and perhaps plotted for it; (3) you were warned by\\n\\t\\t\\t\\tprophets of Allah, but you doubted Allah's very existence\\n\\t\\t\\t\\tand certainly His Mercy and Justice, and the Hereafter;\\n\\t\\t\\t\\t(4) you followed your own lusts and neglected Reason and\\n\\t\\t\\t\\tTruth; (5) you were given plenty of rope, but you\\n\\t\\t\\t\\tfollowed your mad career, until Judgment came upon you,\\n\\t\\t\\t\\tand now it is too late for repentance."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "14",
    "NoteID": "5293",
    "Body": "The Arch-Deceiver (Satan) deceived you in respect of\\n\\t\\t\\t\\tAllah in many ways: for example, he made you oblivious of\\n\\t\\t\\t\\tAllah's Mercy and loving-kindness; he made you reject His\\n\\t\\t\\t\\tGrace; he made you think that Allah's Justice may not\\n\\t\\t\\t\\tovertake you; etc."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "15",
    "NoteID": "5294",
    "Body": "In personal responsibility there is no room for vicarious\\n\\t\\t\\t\\transom or for ransom by payments of gold or silver or by\\n\\t\\t\\t\\tsacrifice of possessions. Nor can the crime be expiated\\n\\t\\t\\t\\tfor after Judgment. 'You' and 'those who rejected Allah'\\n\\t\\t\\t\\tare two ways of looking at the same persons. 'You are\\n\\t\\t\\t\\trejected because you rejected Allah.'"
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "16",
    "NoteID": "5295",
    "Body": "Humility and the remembrance of Allah and His Message are\\n\\t\\t\\t\\tnever more necessary than in the hour of victory and\\n\\t\\t\\t\\tprosperity."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "16",
    "NoteID": "5296",
    "Body": "The men immediately referred to are the contemporary Jews\\n\\t\\t\\t\\tand Christians. To each of these Ummats was given Allah's\\n\\t\\t\\t\\tRevelation, but as time passed, they corrupted it, became\\n\\t\\t\\t\\tarrogant and hard-hearted, and subverted justice, truth,\\n\\t\\t\\t\\tand the purity of Life. But the general lesson is far\\n\\t\\t\\t\\twider. No one is favoured of Allah except on the score of\\n\\t\\t\\t\\trighteousness. Except on that score, there is no chosen\\n\\t\\t\\t\\tindividual or race. There is no blind good fortune or ill\\n\\t\\t\\t\\tfortune. All happens according to the just laws and will\\n\\t\\t\\t\\tof Allah. But at no time is humility or righteousness\\n\\t\\t\\t\\tmore necessary than in the hour of victory or triumph."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "17",
    "NoteID": "5297",
    "Body": "As the dead earth is revived after the refreshing showers\\n\\t\\t\\t\\tof rain, so is it with the spirit of man, whether as an\\n\\t\\t\\t\\tindividual or a race or Ummat. There is no cause for\\n\\t\\t\\t\\tdespair. Allah's Truth will revive the spiritual\\n\\t\\t\\t\\tfaculties if it is accepted with humility and zeal."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "18",
    "NoteID": "5298",
    "Body": "Cf. lvii. 11; also see ii. 245, n. 276."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "19",
    "NoteID": "5299",
    "Body": "Cf. iv. 69, and n. 586. The four categories there\\n\\t\\t\\t\\tmentioned as constituting the beautiful Company of Faith\\n\\t\\t\\t\\tare: the Prophets who teach, the Sincere Lovers of Truth,\\n\\t\\t\\t\\tthe Martyrs, and the Righteous who do good. Of these, the\\n\\t\\t\\t\\tprophets or messengers have already been mentioned in\\n\\t\\t\\t\\tthis verse. The Righteous who do good are mentioned as\\n\\t\\t\\t\\tthe men and women given over to deeds of charity in verse\\n\\t\\t\\t\\t18."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "19",
    "NoteID": "5300",
    "Body": "The Martyrs (witnesses) are all those who carry the\\n\\t\\t\\t\\tBanner of Truth against all odds and in all positions of\\n\\t\\t\\t\\tdanger, whether by pen or speech, or deed or counsel."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "19",
    "NoteID": "5301",
    "Body": "Note that these two are specially high degrees in the\\n\\t\\t\\t\\tHereafter, just short of Prophethood. For they have not\\n\\t\\t\\t\\tonly their reward in the Hereafter, like those who\\n\\t\\t\\t\\tpractise charity (verse 18 above), but they themselves\\n\\t\\t\\t\\tbecome sources of light and leading."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "20",
    "NoteID": "5302",
    "Body": "Cf. vi. 32, and n. 855. In the present passage the idea\\n\\t\\t\\t\\tis further amplified. In this life people not only play\\n\\t\\t\\t\\tand amuse themselves and each other, but they show off,\\n\\t\\t\\t\\tand boast, and pile up riches and man-power and\\n\\t\\t\\t\\tinfluence, in rivalry with each other."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "20",
    "NoteID": "5303",
    "Body": "Cf. xxxix. 21, and n. 4273. Here the Parable is meant to\\n\\t\\t\\t\\tteach a slightly different lesson. Allah's mercies are\\n\\t\\t\\t\\tfree and open to all, like His rain. But how do men make\\n\\t\\t\\t\\tuse of them? The good men take the real spiritual harvest\\n\\t\\t\\t\\tand store the Spiritual grain. The men who are in love\\n\\t\\t\\t\\twith the ephemeral are delighted with the green of the\\n\\t\\t\\t\\ttares and the grass; but such things give no real\\n\\t\\t\\t\\tnourishment; they soon wither, become dry, and crumble to\\n\\t\\t\\t\\tpieces, like the worldly pleasures and pomps, boasting\\n\\t\\t\\t\\tand tumults, possessions and friends."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "20",
    "NoteID": "5304",
    "Body": "Kuffar is here used in the unusual sense of 'tillers or\\n\\t\\t\\t\\thusbandmen', because they sow the seed and cover it up\\n\\t\\t\\t\\twith soil. But the ordinary meaning, 'Rejecters of\\n\\t\\t\\t\\tTruth', is not absent. The allegory refers to such men."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "20",
    "NoteID": "5305",
    "Body": "Cf. iii. 185, and n. 492. Many of the attractive vanities\\n\\t\\t\\t\\tof this world are but nets set by Satan to deceive man.\\n\\t\\t\\t\\tThe only thing real and lasting is the Good Life lived in\\n\\t\\t\\t\\tthe Light of Allah."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "21",
    "NoteID": "5306",
    "Body": "Cf. iii. 133, and n. 452."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "21",
    "NoteID": "5307",
    "Body": "\"Bestows on whom He pleases.\" That is, such grace and\\n\\t\\t\\t\\tfavour is beyond any one's own merits. It is bestowed by\\n\\t\\t\\t\\tAllah according to His holy Will and Plan, which is just,\\n\\t\\t\\t\\tmerciful, and righteous."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "22",
    "NoteID": "5308",
    "Body": "External disasters or misfortunes may strike people's eye\\n\\t\\t\\t\\tor imagination, but there are worse crisis and\\n\\t\\t\\t\\tmisfortunes in the spiritual world, which are of equal or\\n\\t\\t\\t\\tgreater importance to man's future. All this happens\\n\\t\\t\\t\\taccording to the Will and Plan of Allah. Even where we\\n\\t\\t\\t\\tare allowed the exercise of our own wills, the\\n\\t\\t\\t\\tconsequences that follow are in accordance with the laws\\n\\t\\t\\t\\tand Plan decreed by Allah beforehand."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "22",
    "NoteID": "5309",
    "Body": "For baraa, 'to bring into existence', and other words\\n\\t\\t\\t\\tdenoting Allah's creative energy, see n. 120 to ii. 117;\\n\\t\\t\\t\\tn. 916 to vi. 94; and n. 923 to vi. 98."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "23",
    "NoteID": "5310",
    "Body": "In the external world, what people may consider\\n\\t\\t\\t\\tmisfortune or good fortune may both turn out to be\\n\\t\\t\\t\\tillusory,-in Kipling's words, \"both imposters just the\\n\\t\\t\\t\\tsame\". The righteous man does not grumble if some one\\n\\t\\t\\t\\telse has possessions, nor exult if he has them. He does\\n\\t\\t\\t\\tnot covet and he does not boast. If he has any\\n\\t\\t\\t\\tadvantages, he shares them with other people, as he\\n\\t\\t\\t\\tconsiders them not due to his own merits, but as gifts of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "24",
    "NoteID": "5311",
    "Body": "Neither the Covetous nor the Boasters have any place in\\n\\t\\t\\t\\tthe Good Pleasure of Allah. The Covetous are particularly\\n\\t\\t\\t\\tinsidious, as their avarice and niggardliness not only\\n\\t\\t\\t\\tkeep back the gifts of Allah from men, but their\\n\\t\\t\\t\\tpernicious example dries up the streams of Charity in\\n\\t\\t\\t\\tothers."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "24",
    "NoteID": "5312",
    "Body": "It is Charity in Allah's Way that is specially in view\\n\\t\\t\\t\\there. If people are selfish and withhold their hand, they\\n\\t\\t\\t\\tonly injure themselves. They do not hurt Allah's Cause,\\n\\t\\t\\t\\tfor He is independent of all needs, and He will find\\n\\t\\t\\t\\tother means of assisting His more meagrely-endowed\\n\\t\\t\\t\\tservants; He is worthy of all praise in His care for His\\n\\t\\t\\t\\tcreatures."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "25",
    "NoteID": "5313",
    "Body": "Three things are mentioned as gifts of Allah. In concrete\\n\\t\\t\\t\\tterms they are the Book, the Balance, and Iron, which\\n\\t\\t\\t\\tstand as emblems of three things which hold society\\n\\t\\t\\t\\ttogether, viz. Revelation, which commands Good and\\n\\t\\t\\t\\tforbids Evil; Justice, which gives to each person his\\n\\t\\t\\t\\tdue; and the strong arm of the Law, which maintains\\n\\t\\t\\t\\tsanctions for evil-doers. For Balance, see also xlii. 17,\\n\\t\\t\\t\\tand n. 4550."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "25",
    "NoteID": "5314",
    "Body": "\"Sent down\": anzala: in the sense of revealed to man the\\n\\t\\t\\t\\tuse of certain things, created in him the capacity of\\n\\t\\t\\t\\tunderstanding and using them: cf. xxxix. 6: \"sent down\\n\\t\\t\\t\\tfor you eight head of cattle in pairs\"."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "25",
    "NoteID": "5315",
    "Body": "Iron: the most useful metal known to man. Out of it is\\n\\t\\t\\t\\tmade steel, and from steel and iron are made implements\\n\\t\\t\\t\\tof war, such as swords, spears, guns, etc., as well as\\n\\t\\t\\t\\tinstruments of peace, such as ploughshares, bricklayers'\\n\\t\\t\\t\\ttrowels, architects' and engineers' instruments, etc.\\n\\t\\t\\t\\tIron stands as the emblem of Strength, Power, Discipline,\\n\\t\\t\\t\\tLaw's sanctions, etc. Iron and steel industries have also\\n\\t\\t\\t\\tbeen the foundation of the prosperity and power of modern\\n\\t\\t\\t\\tmanufacturing nations'."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "25",
    "NoteID": "5316",
    "Body": "In xxi. 49, I have translated \"in their most secret\\n\\t\\t\\t\\tthoughts\" for the more literal \"unseen\" (bilgaibi).\\n\\t\\t\\t\\tPerhaps the more literal \"unseen\" may do if understood in\\n\\t\\t\\t\\tthe adverbial sense; as explained in xxxv. 18, n. 3902.\\n\\t\\t\\t\\tThe sincere man will help the Cause, whether he is seen\\n\\t\\t\\t\\tor brought under notice or not."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "25",
    "NoteID": "5317",
    "Body": "To help Allah and His messengers is to help their Cause.\\n\\t\\t\\t\\tIt is to give men an opportunity of striving and fighting\\n\\t\\t\\t\\tfor His Cause and proving their true mettle, for thus is\\n\\t\\t\\t\\ttheir spirit tested. As explained in the next line, Allah\\n\\t\\t\\t\\tin Himself is Full of Strength, Exalted in Power, and\\n\\t\\t\\t\\tAble to enforce His Will, and He has no need of others'\\n\\t\\t\\t\\tassistance."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "26",
    "NoteID": "5319",
    "Body": "Some of them: i.e., of their line, or posterity, or\\n\\t\\t\\t\\tUmmat. When the Book that was given to them became\\n\\t\\t\\t\\tcorrupted, many of them followed their own fancies and\\n\\t\\t\\t\\tbecame transgressors."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "27",
    "NoteID": "5320",
    "Body": "The chief characteristic of the teaching in the Gospels\\n\\t\\t\\t\\tis humility and other-worldliness. The first blessings in\\n\\t\\t\\t\\tthe Sermon on the Mount are on \"the poor in spirit\",\\n\\t\\t\\t\\t\"they that mourn\", and they that are \"meek\" (Matt. v.\\n\\t\\t\\t\\t3-5). Christ's disciples were enjoined to \"take no\\n\\t\\t\\t\\tthought for the morrow\", and told \"Sufficient unto the\\n\\t\\t\\t\\tday is the evil thereof\" (Matt. vi. 34). They were also\\n\\t\\t\\t\\tcommanded \"that ye resist not evil; but whosoever shall\\n\\t\\t\\t\\tsmite thee on thy right cheek, turn to him the other\\n\\t\\t\\t\\talso\" (Matt. v. 39). These are fragmentary presentments\\n\\t\\t\\t\\tof an imperfect philosophy as seen through monastic eyes.\\n\\t\\t\\t\\tIn so far as they represent pity, sympathy with\\n\\t\\t\\t\\tsuffering, and deeds of mercy, they represent the spirit\\n\\t\\t\\t\\tof Christ."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "27",
    "NoteID": "5321",
    "Body": "But Allah's Kingdom requires also courage, resistance to\\n\\t\\t\\t\\tevil, the firmness, law, and discipline which will\\n\\t\\t\\t\\tenforce justice among men. It requires men to mingle with\\n\\t\\t\\t\\tmen, so that they can uphold the standard of Truth,\\n\\t\\t\\t\\tagainst odds if necessary. These were lost sight of in\\n\\t\\t\\t\\tMonasticism, which was not prescribed by Allah."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "27",
    "NoteID": "5322",
    "Body": "Allah certainly requires that men shall renounce the idle\\n\\t\\t\\t\\tpleasures of this world, and turn to the Path which leads\\n\\t\\t\\t\\tto Allah's Good Pleasure. But that does not mean gloomy\\n\\t\\t\\t\\tlives, (\"they that mourn\"), nor perpetual and formal\\n\\t\\t\\t\\tprayers in isolation. Allah's service is done through\\n\\t\\t\\t\\tpure lives in the turmoil of this world. This spirit was\\n\\t\\t\\t\\tlost, or at least not fostered by monastic institutions.\\n\\t\\t\\t\\tOn the contrary a great part of the \"struggle and\\n\\t\\t\\t\\tstriving\" for noble lives was suppressed."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "27",
    "NoteID": "5323",
    "Body": "Many of them lost true Faith, or had their Faith\\n\\t\\t\\t\\tcorrupted by superstitions. But those who continued firm\\n\\t\\t\\t\\tin Faith saw the natural development of Religion in\\n\\t\\t\\t\\tIslam. Their previous belief was not a disadvantage to\\n\\t\\t\\t\\tthem, but helped them, because they kept it free from\\n\\t\\t\\t\\tfalse and selfish prejudices. These are the ones who are\\n\\t\\t\\t\\tfurther addressed at the beginning of verse 28 below."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "27",
    "NoteID": "5324",
    "Body": "The corruptions in the Christian Church, the\\n\\t\\t\\t\\thair-splitting disputes, and mutual strife and hatred of\\n\\t\\t\\t\\tsects had become a scandal by the time that the light of\\n\\t\\t\\t\\tIslam came into the world. The pages of Gibbon's great\\n\\t\\t\\t\\tHistory bear witness. Not only had the religion become\\n\\t\\t\\t\\tvoid of grace, but the lives of the people, priests and\\n\\t\\t\\t\\tlaity, had fallen into great depths of degradation."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "28",
    "NoteID": "5325",
    "Body": "From the context before (see n. 5323 above) and after\\n\\t\\t\\t\\t(see next note), this is held to refer to the Christians\\n\\t\\t\\t\\tand People of the Book who kept their Faith true and\\n\\t\\t\\t\\tundefiled."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "28",
    "NoteID": "5326",
    "Body": "The double portion refers to the past and the future. As\\n\\t\\t\\t\\tnoted in the last note, this passage is addressed to the\\n\\t\\t\\t\\tChristians and the People of the Book, who, when honestly\\n\\t\\t\\t\\tfacing the question of the new Revelation in Islam, find\\n\\t\\t\\t\\tin it the fulfilment of previous revelations, and\\n\\t\\t\\t\\ttherefore believe in Allah's Messenger Muhammad, and walk\\n\\t\\t\\t\\tby the new light. Their previous merits will be duly\\n\\t\\t\\t\\trecognised, and they will be treated on fully equal terms\\n\\t\\t\\t\\tin the new Ummat. This is their double share, not\\n\\t\\t\\t\\tnecessarily more in quantity than that of their brethren\\n\\t\\t\\t\\tin Islam who passed through no other gate, but having a\\n\\t\\t\\t\\ttwofold aspect."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "28",
    "NoteID": "5327",
    "Body": "As this refers to the Christians and the People of the\\n\\t\\t\\t\\tBook, the following saying of Christ in his last days may\\n\\t\\t\\t\\tinterest them: \"Yet a little while is the light with you.\\n\\t\\t\\t\\tWalk while ye have the light, lest darkness come upon\\n\\t\\t\\t\\tyou... While ye have the fight, believe in the light,\\n\\t\\t\\t\\tthat ye may be the children of light. These things spake\\n\\t\\t\\t\\tJesus, and departed, and did hide himself from them\".\\n\\t\\t\\t\\t(John, xii. 35-36). The light of Christ's Gospel soon\\n\\t\\t\\t\\tdeparted; his Church was enveloped in darkness; then came\\n\\t\\t\\t\\tthe fight again, in the fuller light of Islam. And they\\n\\t\\t\\t\\tare asked to believe in the light, and to walk in it. Cf.\\n\\t\\t\\t\\talso lvii. 12. and n. 5288 above."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "28",
    "NoteID": "5328",
    "Body": "Any wrong they may have committed through ignorance or\\n\\t\\t\\t\\tmisconceptions in their previous religion will be\\n\\t\\t\\t\\tforgiven them, as they have seen the new light and walk\\n\\t\\t\\t\\tby it."
  },
  {
    "SurahNumber": "57",
    "AyahNumber": "29",
    "NoteID": "5329",
    "Body": "Let not any race, or people, or community, or group,\\n\\t\\t\\t\\tbelieve that they have exclusive possession of Allah's\\n\\t\\t\\t\\tGrace, or that they can influence its grant or its\\n\\t\\t\\t\\twithholding. Allah's Grace is free, and entirely\\n\\t\\t\\t\\tcontrolled by Him, independently of any priests and\\n\\t\\t\\t\\tpriviledged people. He dispenses it according to His own\\n\\t\\t\\t\\twise and holy Will and Plan; and to His Grace there is no\\n\\t\\t\\t\\tlimit. It is up to Him to bestow His Grace upon whom He\\n\\t\\t\\t\\tlikes. The Qur-an is the final revelation in which He\\n\\t\\t\\t\\tsaid: \"ye are the best Ummah brought forward to mankind.\"\\n\\t\\t\\t\\tSo in order to receive His Grace, one should submit to\\n\\t\\t\\t\\tIslam."
  }
]
