[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/034001",
        "Body":  "Praise be to Allah, unto Whom belongeth whatsoever is in the\n\t\t\theavens and whatsoever is in the earth. His is the praise in the\n\t\t\tHereafter, and He is the Wise, the Aware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/034010",
        "Body":  "And assuredly We gave David grace from Us, (saying): O ye hills\n\t\t\tand birds, echo his psalms of praise! And We made the iron supple\n\t\t\tunto him,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/034011",
        "Body":  "Saying: Make thou long coats of mail and measure the links\n\t\t\t(thereof). And do ye right. Lo! I am Seer of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/034012",
        "Body":  "And unto Solomon (We gave) the wind, whereof the morning course\n\t\t\twas a month\u0027s journey and the evening course a month\u0027s journey,\n\t\t\tand We caused the fount of copper to gush forth for him, and (We\n\t\t\tgave him) certain of the jinn who worked before him by permission\n\t\t\tof his Lord. And such of them as deviated from Our command, them\n\t\t\tWe caused to taste the punishment of flaming fire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/034013",
        "Body":  "They made for him what he willed: synagogues and statues, basins\n\t\t\tlike wells and boilers built into the ground. Give thanks, O\n\t\t\tHouse of David! Few of My bondmen are thankful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/034014",
        "Body":  "And when We decreed death for him, nothing showed his death to\n\t\t\tthem save a creeping creature of the earth which gnawed away his\n\t\t\tstaff. And when he fell the jinn saw clearly how, if they had\n\t\t\tknown the unseen, they would not have continued in despised toil."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/034015",
        "Body":  "There was indeed a sign for Sheba in their dwelling place: Two\n\t\t\tgardens on the right hand and the left (as who should say): Eat\n\t\t\tof the provision of your Lord and render thanks to Him. A fair\n\t\t\tland and an indulgent Lord!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/034016",
        "Body":  "But they were froward, so We sent on them the flood of Arim, and\n\t\t\tin exchange for their two gardens gave them two gardens bearing\n\t\t\tbitter fruit, the tamarisk and here and there a lote tree."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/034017",
        "Body":  "This We awarded them because of their ingratitude. Punish We ever\n\t\t\tany save the ingrates?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/034018",
        "Body":  "And We set, between them and the towns which We had blessed,\n\t\t\ttowns easy to be seen, and We made the stage between them easy,\n\t\t\t(saying): Travel in them safely both by night and day."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/034019",
        "Body":  "But they said: Our Lord! Make the stage between our journeys\n\t\t\tlonger. And they wronged themselves, therefore We made them\n\t\t\tbywords (in the land) and scattered them abroad, a total\n\t\t\tscattering. Lo! herein verily are portents for each steadfast,\n\t\t\tgrateful (heart)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/034002",
        "Body":  "He knoweth that which goeth down into the earth and that which\n\t\t\tcometh forth from it, and that which descendeth from the heaven\n\t\t\tand that which ascendeth into it. He is the Merciful, the\n\t\t\tForgiving."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/034020",
        "Body":  "And Satan indeed found his calculation true concerning them, for\n\t\t\tthey follow him, all save a group of true believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/034021",
        "Body":  "And he had no warrant whatsoever against them, save that We would\n\t\t\tknow him who believeth in the Hereafter from him who is in doubt\n\t\t\tthereof; and thy Lord (O Muhammad) taketh note of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/034022",
        "Body":  "Say (O Muhammad): Call upon those whom ye set up beside Allah!\n\t\t\tThey possess not an atom\u0027s weight either in the heavens or the\n\t\t\tearth, nor have they any share either, nor hath He an auxiliary\n\t\t\tamong them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/034023",
        "Body":  "No intercession availeth with Him save for him whom He\n\t\t\tpermitteth. Yet, when fear is banished from their hearts, they\n\t\t\tsay: What was it that your Lord said? They say: The Truth. And He\n\t\t\tis the Sublime, the Great."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/034024",
        "Body":  "Say: Who giveth you provision from the sky and the earth? Say:\n\t\t\tAllah. Lo! we or you assuredly are rightly guided or in error\n\t\t\tmanifest."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/034025",
        "Body":  "Say: Ye will not be asked of what we committed, nor shall we be\n\t\t\tasked of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/034026",
        "Body":  "Say: Our Lord will bring us all together, then He will judge\n\t\t\tbetween us with truth. He is the All knowing Judge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/034027",
        "Body":  "Say: Show me those whom ye have joined unto Him as partners. Nay\n\t\t\t(ye dare not)! For He is Allah, the Mighty, the Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/034028",
        "Body":  "And We have not sent thee (O Muhammad) save as a bringer of good\n\t\t\ttidings and a warner unto all mankind; but most of mankind know\n\t\t\tnot."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/034029",
        "Body":  "And they say: When is this promise (to be fulfilled) if ye are\n\t\t\ttruthful?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/034003",
        "Body":  "Those who disbelieve say: The Hour will never come unto us. Say :\n\t\t\tNay, by my Lord, but it is coming unto you surely. (He is) the\n\t\t\tKnower of the Unseen. Not an atom\u0027s weight, or less than that or\n\t\t\tgreater, escapeth Him in the heavens or in the earth, but it is\n\t\t\tin a clear Record,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/034030",
        "Body":  "Say (O Muhammad): Yours is the promise of a Day which ye cannot\n\t\t\tpostpone nor hasten by an hour."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/034031",
        "Body":  "And those who disbelieve say: We believe not in this Qur\u0027an nor\n\t\t\tin that which was before it; but oh, if thou couldst see, when\n\t\t\tthe wrong doers are brought up before their Lord, how they cast\n\t\t\tthe blame one to another; how those who were despised (in the\n\t\t\tearth) say unto those who were proud: But for you, we should have\n\t\t\tbeen believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/034032",
        "Body":  "And those who were proud say unto those who were despised: Did we\n\t\t\tdrive you away from the guidance after it had come unto you? Nay,\n\t\t\tbut ye were guilty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/034033",
        "Body":  "Those who were despised say unto those who were proud: Nay but\n\t\t\t(it was your) scheming night and day, when ye commanded us to\n\t\t\tdisbelieve in Allah and set up rivals unto Him. And they are\n\t\t\tfilled with remorse when they behold the doom; and We place\n\t\t\tcarcans on the necks of those who disbelieved. Are they requited\n\t\t\taught save what they did?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/034034",
        "Body":  "And We sent not unto any township a warner, but its pampered ones\n\t\t\tdeclared: Lo! we are disbelievers in that which ye bring unto Us."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/034035",
        "Body":  "And they say: We are more (than you) in wealth and children. We\n\t\t\tare not the punished!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/034036",
        "Body":  "Say (O Muhammad): Lo! my Lord enlargeth the provision for whom He\n\t\t\twill and narroweth it (for whom He will). But most of mankind\n\t\t\tknow not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/034037",
        "Body":  "And it is not your wealth nor your children that will bring you\n\t\t\tnear unto Us, but he who believeth and doeth good (he draweth\n\t\t\tnear). As for such, theirs will be twofold reward for what they\n\t\t\tdid, and they will dwell secure in lofty halls."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/034038",
        "Body":  "And as for those who strive against Our revelations, challenging,\n\t\t\tthey will be brought to the doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/034039",
        "Body":  "Say: Lo! my Lord enlargeth the provision for whom He will of His\n\t\t\tbondmen, and narroweth (it) for him. And whatsoever ye spend (for\n\t\t\tgood) He replaceth it. And He is the Best of Providers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/034004",
        "Body":  "That He may reward those who believe and do good works. For them\n\t\t\tis pardon and a rich provision."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/034040",
        "Body":  "And on the day when He will gather them all together, He will say\n\t\t\tUnto the angels: Did these worship you?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/034041",
        "Body":  "They will say: Be Thou glorified. Thou art our Protector from\n\t\t\tthem! Nay, but they worshipped the jinn; most of them were\n\t\t\tbelievers in them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/034042",
        "Body":  "That day ye will possess no use nor hurt one for another. And We\n\t\t\tshall say unto those who did wrong: Taste the doom of the Fire\n\t\t\twhich ye used to deny."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/034043",
        "Body":  "And if Our revelations are recited unto them in plain terms, they\n\t\t\tsay: This is naught else than a man who would turn you away from\n\t\t\twhat your fathers used to worship; and they say: This is naught\n\t\t\telse than an invented lie. Those who disbelieve say of the truth\n\t\t\twhen it reacheth them: This is naught else than mere magic."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/034044",
        "Body":  "And We have given them no Scriptures which they study, nor sent\n\t\t\tWe unto them, before thee, any warner."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/034045",
        "Body":  "Those before them denied, and these have not attained a tithe of\n\t\t\tthat which We bestowed on them (of old); yet they denied My\n\t\t\tmessengers. How intense then was My abhorrence (of them)!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/034046",
        "Body":  "Say (unto them, O Muhammad): I exhort you unto one thing only:\n\t\t\tthat ye awake, for Allah\u0027s sake, by twos and singly, and then\n\t\t\treflect: There is no madness in your comrade. He is naught else\n\t\t\tthan a warner unto you in face of a terrific doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/034047",
        "Body":  "Say: Whatever reward I might have asked of you is yours. My\n\t\t\treward is the affair of Allah only. He is Witness over all\n\t\t\tthings."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/034048",
        "Body":  "Say: Lo! my Lord hurleth the truth. (He is) the Knower of Things\n\t\t\tHidden."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/034049",
        "Body":  "Say: The Truth hath come, and falsehood showeth not its face and\n\t\t\twill not return."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/034005",
        "Body":  "But those who strive against Our revelations, challenging (Us),\n\t\t\ttheirs will be a painful doom of wrath."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/034050",
        "Body":  "Say: If I err, I err only to my own loss, and if I am rightly\n\t\t\tguided it is because of that which my Lord hath revealed unto me.\n\t\t\tLo! He is Hearer, Nigh."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/034051",
        "Body":  "Couldst thou but see when they are terrified with no escape, and\n\t\t\tare seized from near at hand."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/034052",
        "Body":  "And say: We (now) believe therein. But how can they reach (faith)\n\t\t\tfrom afar off,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/034053",
        "Body":  "When they disbelieved in it of yore. They aim at the unseen from\n\t\t\tafar off."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/034054",
        "Body":  "And a gulf is set between them and that which they desire, as was\n\t\t\tdone for people of their kind of old. Lo! they were in hopeless\n\t\t\tdoubt."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/034006",
        "Body":  "Those who have been given knowledge see that what is revealed\n\t\t\tunto thee from thy Lord is the truth and leadeth unto the path of\n\t\t\tthe Mighty, the Owner of Praise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/034007",
        "Body":  "Those who disbelieve say: Shall we show you a man who will tell\n\t\t\tyou (that) when ye have become dispersed in dust with most\n\t\t\tcomplete dispersal, still, even then, ye will be created anew?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/034008",
        "Body":  "Hath he invented a lie concerning Allah, or is there in him a\n\t\t\tmadness? Nay, but those who disbelieve in the Hereafter are in\n\t\t\ttorment and far error."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "34",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/034009",
        "Body":  "Have they not observed what is before them and what is behind\n\t\t\tthem of the sky and the earth? If We will, We can make the earth\n\t\t\tswallow them, or cause obliteration from the sky to fall on them.\n\t\t\tLo ! herein surely is a portent for every slave who turneth (to\n\t\t\tAllah ) repentant."
    }
]
