[
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "1",
    "sectionHeading": "Animals to Be Avoided as Sacrifices",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Amr ibn al-Harith\\n\\t\\t\\t\\tfrom Ubayd ibn Fayruz from al-Bara ibn Azib that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, was asked what animals should be avoided as\\n\\t\\t\\t\\tsacrifices. He indicated with his hand and said, \"Four.\"\\n\\t\\t\\t\\tAl-Bara pointed with his hand and said, \"My hand is\\n\\t\\t\\t\\tshorter than the hand of the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace. A lame animal whose\\n\\t\\t\\t\\tlameness is evident, a one-eyed animal which is clearly\\n\\t\\t\\t\\tone-eyed, an animal which is clearly ill, and an\\n\\t\\t\\t\\temaciated animal with no fat on it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "2",
    "sectionHeading": "Animals to Be Avoided as Sacrifices",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar would guard against animals and camels which\\n\\t\\t\\t\\twere young or had physical defects as sacrifices.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what I like best of what I have\\n\\t\\t\\t\\theard .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "3",
    "sectionHeading": "Animals Desirable as Sacrifices",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that one time\\n\\t\\t\\t\\tAbdullah ibn Umar wanted to sacrifice an animal at\\n\\t\\t\\t\\tMadina. Nafi said, \"He told me to buy him an excellent\\n\\t\\t\\t\\thorned ram, then to sacrifice it on the Day of Sacrifice\\n\\t\\t\\t\\tin the place where the people prayed.\" Nafi continued, \"I\\n\\t\\t\\t\\tdid so and when the ram was sacrificed, it was carried to\\n\\t\\t\\t\\tAbdullah ibn Umar who shaved his head. He was ill, and\\n\\t\\t\\t\\tdid not attend the Id with the people.\" Nafi added,\\n\\t\\t\\t\\t\"Abdullah ibn Umar used to say, 'Shaving the head is not\\n\\t\\t\\t\\tobligatory for someone who sacrifices an animal.' Ibn\\n\\t\\t\\t\\tUmar would do so however.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "4",
    "sectionHeading": "Prohibition against Sacrificing an Animal Before the Imam Departs",
    "text": "<p>\\n\\t\\t\\t\\tahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tBushayr ibn Yasar that Abu Burda ibn Niyar sacrificed an\\n\\t\\t\\t\\tanimal before the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, sacrificed on the Day of Sacrifice.\\n\\t\\t\\t\\tHe asserted that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, ordered him to sacrifice another\\n\\t\\t\\t\\tanimal, and he, Abu Burda, said, \"What if I can only find\\n\\t\\t\\t\\tan animal less than one year old, Messenger of Allah?\" He\\n\\t\\t\\t\\thad said, \"If you can only find a young animal, then\\n\\t\\t\\t\\tsacrifice it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "5",
    "sectionHeading": "Prohibition against Sacrificing an Animal Before the Imam Departs",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAbbad ibn Tamin that one time Uwaymir ibn Ashqar\\n\\t\\t\\t\\tsacrificed his animal before the prayer on the morning of\\n\\t\\t\\t\\tthe Day of Sacrifice, and he mentioned that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, had\\n\\t\\t\\t\\tordered him to sacrifice another animal.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "6",
    "sectionHeading": "Storing Meat from Sacrificial Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zubayr al-Makki\\n\\t\\t\\t\\tfrom Jabir ibn Abdullah that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbade that the\\n\\t\\t\\t\\tmeat from sacrificial animals be eaten after three days.\\n\\t\\t\\t\\tThen later he said, \"Eat, give sadaqa, provide for\\n\\t\\t\\t\\tyourselves and store up.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "7",
    "sectionHeading": "Storing Meat from Sacrificial Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tthat Abdullah ibn Waqid said, \"The Messengerof Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbade eating the\\n\\t\\t\\t\\tmeat from sacrificial animals after three days.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah ibn Abi Bakr said, \"I mentioned that to Amra\\n\\t\\t\\t\\tbint Abd ar-Rahman, and she affirmed that he had spoken\\n\\t\\t\\t\\tthe truth as she had heard A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, say,\\n\\t\\t\\t\\t'Some people from the desert came at the time of the\\n\\t\\t\\t\\tsacrifice in the time of the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, so the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'Store up for three days, and give what is left over as\\n\\t\\t\\t\\tsadaqa.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe said that afterwards some one said to the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, that\\n\\t\\t\\t\\tpeople had been accustomed to make use of their\\n\\t\\t\\t\\tsacrificial animals, melting the fat and curing the\\n\\t\\t\\t\\tskins. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"What about that?\" They said, \"You\\n\\t\\t\\t\\thave forbidden the meat of sacrificial animals after\\n\\t\\t\\t\\tthree days.\" The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"I only forbade you for the\\n\\t\\t\\t\\tsake of the people who were coming to you. Eat, give\\n\\t\\t\\t\\tsadaqa and store up.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tBy these people, he meant the poor people who were coming\\n\\t\\t\\t\\tto Madina.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "8",
    "sectionHeading": "Storing Meat from Sacrificial Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman that Abu Said alKhudri returned from a journey\\n\\t\\t\\t\\tand his family gave him some meat. He asked whether it\\n\\t\\t\\t\\twas meat from the sacrifice. They replied that it was.\\n\\t\\t\\t\\tAbu Said said, \"Didn't the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbid that?\" They said,\\n\\t\\t\\t\\t\"There has been a new command from the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, since you\\n\\t\\t\\t\\twent away.\" Abu Said went out and made enquiries about it\\n\\t\\t\\t\\tand was told that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, had said,\"I forbade you before\\n\\t\\t\\t\\tto eat meat of the sacrifice after three days, but now\\n\\t\\t\\t\\teat, give sadaqa and store up. I forbade you before to\\n\\t\\t\\t\\tmake nabidh (by soaking raisins or dates in water), but\\n\\t\\t\\t\\tnow make nabidh, but remember every intoxicant is haram\\n\\t\\t\\t\\t.I forbade you to visit graves, but now visit them, and\\n\\t\\t\\t\\tdo not use bad language.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "9",
    "sectionHeading": "Sharing Sacrificial Animals and How Many Share a Cow or Camel",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zubayr al-Makki\\n\\t\\t\\t\\tthat Jabir ibn Abdullah said, \"We sacrificed with the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, in the year of Hudaybiya, a camel between seven\\n\\t\\t\\t\\tpeople, and a cow between seven people.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "10",
    "sectionHeading": "Sharing Sacrificial Animals and How Many Share a Cow or Camel",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Umara ibn Yasar that\\n\\t\\t\\t\\tAta ibn Yasar told him that Abu Ayyub al-Ansari had told\\n\\t\\t\\t\\thim, \"We used to sacrifice one sheep, and a man\\n\\t\\t\\t\\tsacrificed for himself and his family. Then later on\\n\\t\\t\\t\\tpeople began to compete with each other and it became\\n\\t\\t\\t\\tboasting.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The best that I have heard about a single\\n\\t\\t\\t\\tcamel, cow or sheep, is that a man should sacrifice a\\n\\t\\t\\t\\tcamel for himself and his family. He sacrifices a cow or\\n\\t\\t\\t\\tsheep which he owns for his family, and shares with them\\n\\t\\t\\t\\tin it. It is disapproved for a group of people to buy a\\n\\t\\t\\t\\tcamel, cow or sheep, to share for the ritual and\\n\\t\\t\\t\\tsacrifices, each man giving a share of its price, and\\n\\t\\t\\t\\ttaking a share of its meat. We have heard the tradition\\n\\t\\t\\t\\tthat people do not share in the ritual. However, it may\\n\\t\\t\\t\\tbe that the people of one household can share.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "11",
    "sectionHeading": "Sharing Sacrificial Animals and How Many Share a Cow or Camel",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, only sacrificed one camel or one cow for himself\\n\\t\\t\\t\\tand his family.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not know which of them Ibn Shihab\\n\\t\\t\\t\\tsaid.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "12",
    "sectionHeading": "The Sacrificial Animal for the Child in the Womb and Mention of the Days of Sacrifice",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"The sacrifice can be done up to two days\\n\\t\\t\\t\\tafter the Day of Sacrifice.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard the same\\n\\t\\t\\t\\tfrom Ali ibn Abi Talib.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "23",
    "hadithNumber": "13",
    "sectionHeading": "The Sacrificial Animal for the Child in the Womb and Mention of the Days of Sacrifice",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar did not sacrifice for the child in the womb.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sacrifice is sunna, and it is not\\n\\t\\t\\t\\tobligatory. I prefer that anyone who has the price of the\\n\\t\\t\\t\\tanimal should not abandon it.''\\n\\t\\t\\t</p>"
  }
]
