[
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "1",
    "sectionHeading": "How to do Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Amr ibn Yahya\\n\\t\\t\\t\\tal-Mazini that his father once asked Abdullah ibn Zayd\\n\\t\\t\\t\\tibn Asim, who was the grandfather of Amr ibn Yahya\\n\\t\\t\\t\\tal-Mazini and one of the companions of the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, if he\\n\\t\\t\\t\\tcould show him how the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, did wudu. Abdullah ibn\\n\\t\\t\\t\\tZayd ibn Asim agreed to do so and asked for water to do\\n\\t\\t\\t\\twudu. He poured some out on to his hand and washed each\\n\\t\\t\\t\\thand twice and then rinsed his mouth and snuffed water up\\n\\t\\t\\t\\this nose and blew it out three times.Then he washed\\n\\t\\t\\t\\thisface three times and both of his arms up to the elbows\\n\\t\\t\\t\\ttwice. He then wiped his head with both hands, taking his\\n\\t\\t\\t\\thands from hisforehead to the nape of his neck and then\\n\\t\\t\\t\\tbringing them back to where he had begun. Then he washed\\n\\t\\t\\t\\this feet.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "2",
    "sectionHeading": "How to do Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'zZinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"When you do\\n\\t\\t\\t\\twudu, snuff water into your nose and blow it out, and if\\n\\t\\t\\t\\tyou use stones to clean your private parts use an odd\\n\\t\\t\\t\\tnumber.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "3",
    "sectionHeading": "How to do Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Ibn Shihab from Abu Idris\\n\\t\\t\\t\\tal-Khawlani from Abu Hurayra that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"The\\n\\t\\t\\t\\tperson doing wudu should snuff water up his nose and blow\\n\\t\\t\\t\\tit out again.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "4",
    "sectionHeading": "How to do Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that he heard Malik say that there was no harm\\n\\t\\t\\t\\tin washing the mouth and cleaning the nose with only one\\n\\t\\t\\t\\thandful of water.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "5",
    "sectionHeading": "How to do Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Abd\\n\\t\\t\\t\\tar-Rahman ibn Abi Bakr was visiting A'isha, the wife of\\n\\t\\t\\t\\tthe Prophet, may AIIah bless him and grant him peace, on\\n\\t\\t\\t\\tthe day that Sad ibn Abi Waqqas died, and he asked for\\n\\t\\t\\t\\tsome water to do wudu. A'isha said to him, ''Abd\\n\\t\\t\\t\\tar-Rahman! Perform your wudu fully, for I heard the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, 'Woe to the heels in the fire.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "6",
    "sectionHeading": "How to do Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Muhammad\\n\\t\\t\\t\\tibn Talhafrom Uthman ibn Abd ar-Rahman that his father\\n\\t\\t\\t\\trelated to him that he had heard that Umar ibn al-Khattab\\n\\t\\t\\t\\tused to wash what was beneath his waist wrapper with\\n\\t\\t\\t\\twater.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "7",
    "sectionHeading": "How to do Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik was asked what a man should do if,\\n\\t\\t\\t\\twhen he did wudu, he forgot and washed his face before he\\n\\t\\t\\t\\thad rinsed his mouth, or washed his forearms before he\\n\\t\\t\\t\\thad washed his face. He said, \"If someone washes his face\\n\\t\\t\\t\\tbefore rinsing his mouth, he should rinse his mouth and\\n\\t\\t\\t\\tnot wash his face again. If someone washes his forearms\\n\\t\\t\\t\\tbefore his face, however, he should wash his forearms\\n\\t\\t\\t\\tagain so that he has washed them after his face. This is\\n\\t\\t\\t\\tif he is still near the place (of wudu).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "8",
    "sectionHeading": "How to do Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik was asked about what a man should\\n\\t\\t\\t\\tdo if he had forgotten to rinse his mouth and nose until\\n\\t\\t\\t\\the had prayed, and he said, \"He does not have to repeat\\n\\t\\t\\t\\tthe prayer, but should rinse his mouth and nose if he\\n\\t\\t\\t\\twishes to do any more prayers after that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "9",
    "sectionHeading": "The Wudu of a Man who has been Asleep when he Gets Up to Pray",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'zZinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"When you wake\\n\\t\\t\\t\\tup from sleep to pray, wash your hands before you put\\n\\t\\t\\t\\tthem in the wudu water, for you do not know where your\\n\\t\\t\\t\\thands have spent the night.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "10",
    "sectionHeading": "The Wudu of a Man who has been Asleep when he Gets Up to Pray",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tUmar ibn al-Khattab said, \"If you fall asleep Iying down\\n\\t\\t\\t\\tyou must do wudu ( before you pray) . \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tthe ayat \"You who believe! When you rise for prayer wash\\n\\t\\t\\t\\tyour faces, and your arms to the elbows, and wipe over\\n\\t\\t\\t\\tyour heads and your feet up to the ankles,\" refers to\\n\\t\\t\\t\\trising from bed, meaning sleep.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The situation with us is\\n\\t\\t\\t\\tthat one does not have to do wudu for a nose-bleed, or\\n\\t\\t\\t\\tfor blood, or for pus issuing from the body. One only has\\n\\t\\t\\t\\tto do wudu for impurities which issue from the genitals\\n\\t\\t\\t\\tor the anus, or for sleep.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafithat Ibn Umar\\n\\t\\t\\t\\tused to sleep sitting and then would pray without doing\\n\\t\\t\\t\\twudu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "12",
    "sectionHeading": "What is Pure for Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Safwan ibn Sulaym\\n\\t\\t\\t\\tfrom Said ibn Salama of the Bani Azraq from al-Mughira\\n\\t\\t\\t\\tibn Abi Burda of the tribe of Bani Abd ad-Dar that he had\\n\\t\\t\\t\\theard Abu Hurayra speak about a man who came to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and said, \"Messenger of Allah! We travel by sea\\n\\t\\t\\t\\tand we do not carry much fresh water with us so if we do\\n\\t\\t\\t\\twudu with it we go thirsty. Can we do wudu with\\n\\t\\t\\t\\tseawater?\" The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, replied, \"lts water is pure, and its\\n\\t\\t\\t\\tdead creatures are halal.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "13",
    "sectionHeading": "What is Pure for Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha from Humayda bint Abi Ubayda ibn Farwa that\\n\\t\\t\\t\\ther maternal aunt Kabsha bint Kab ibn Malik, who was the\\n\\t\\t\\t\\twife of the son of Abu Qatada al-Ansari, told her that\\n\\t\\t\\t\\tonce Abu Qatada was visiting her and she poured out some\\n\\t\\t\\t\\twater for him to do wudu with. Just then a cat came to\\n\\t\\t\\t\\tdrink from it, so he tilted the vessel towards it to let\\n\\t\\t\\t\\tit drink. Kabsha continued, \"He saw me looking at him and\\n\\t\\t\\t\\tsaid, 'Are you surprised, daughter of my brother?' I\\n\\t\\t\\t\\tsaid, 'Yes.' He replied that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, cats are not\\n\\t\\t\\t\\timpure. They intermingle with you .' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"There is no harm in that\\n\\t\\t\\t\\tunless one sees impurities on the cat's mouth.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "14",
    "sectionHeading": "What is Pure for Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Ibrahim ibn alHarith at-Taymi from Yahya ibn\\n\\t\\t\\t\\tAbd ar-Rahman ibn Hatib that Umar ibn al-Khattab set out\\n\\t\\t\\t\\ton one occasion with a party of riders, one of whom was\\n\\t\\t\\t\\tAmr ibn al-As. They came to a watering place and Amr ibn\\n\\t\\t\\t\\tal-As asked the man who owned it whether wild beasts\\n\\t\\t\\t\\tdrank from it. Umar ibn al-Khattab told the owner of the\\n\\t\\t\\t\\twatering place not to answer, since the people drank\\n\\t\\t\\t\\tafter the wild beasts and the wild beasts drank after\\n\\t\\t\\t\\tthem.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "15",
    "sectionHeading": "What is Pure for Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say that men and their wives used to do\\n\\t\\t\\t\\twudu together in the time of the Messenger of Allah.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "16",
    "sectionHeading": "Things which do not break Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Umara\\n\\t\\t\\t\\tfrom Muhammad ibn Ibrahim that the mother of the son of\\n\\t\\t\\t\\tIbrahim ibn Abd ar-Rahman ibn Awf questioned Umm Salama,\\n\\t\\t\\t\\tthe wife of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, and said, \"I am a woman who wears a long skirt\\n\\t\\t\\t\\tand (sometimes) I walk in dirty places.\" Umm Salama\\n\\t\\t\\t\\treplied, \"The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, 'What follows (i.e. clean places)\\n\\t\\t\\t\\tpurifies it.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "17",
    "sectionHeading": "Things which do not break Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he saw Rabia ibn Abd\\n\\t\\t\\t\\tar-Rahman vomit several times when he was in the mosque\\n\\t\\t\\t\\tand he did not leave, nor did he do wudu before he\\n\\t\\t\\t\\tprayed.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether a man who vomited\\n\\t\\t\\t\\tfood had to do wudu and he said, \"He does not have to do\\n\\t\\t\\t\\twudu, but he should rinse the inside of his mouth and\\n\\t\\t\\t\\twash his mouth out.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "18",
    "sectionHeading": "Things which do not break Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar prepared the body of one of Said ibn Zayd's sons\\n\\t\\t\\t\\tfor burial and carried it and then entered the mosque and\\n\\t\\t\\t\\tprayed without doing wudu.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether it was necessary\\n\\t\\t\\t\\tto do wudu because of regurgitating undigested food and\\n\\t\\t\\t\\the said, \"No, wudu is not necessary, but the mouth should\\n\\t\\t\\t\\tbe rinsed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "19",
    "sectionHeading": "Discontinuing Doing Wudu on Account of Eating Cooked Food",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd Aslam from Ata\\n\\t\\t\\t\\tibn Yasar from Abdullah Abbas that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, ate a\\n\\t\\t\\t\\tshoulder of lamb and then prayed without doing wudu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "20",
    "sectionHeading": "Discontinuing Doing Wudu on Account of Eating Cooked Food",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tBushayr ibn Yasar, the mawla of the Bani Haritha, that\\n\\t\\t\\t\\tSuwayd ibn anNuman told him that he went with the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, on the expedition to Khaybar. When they reached as\\n\\t\\t\\t\\tSuhba, which was near Khaybar, the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, stopped and\\n\\t\\t\\t\\tprayed asr. He asked for provisions but only parched\\n\\t\\t\\t\\tbarley was brought, so he asked for it to be moistened.\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, ate and the people ate with him. Then he got up to\\n\\t\\t\\t\\tdo maghrib and rinsed his mouth out and they rinsed out\\n\\t\\t\\t\\ttheirs. Then he prayed without doing wudu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "21",
    "sectionHeading": "Discontinuing Doing Wudu on Account of Eating Cooked Food",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that both Muhammad ibn\\n\\t\\t\\t\\tal-Munkadir and Safwan ibn Sulaym transmitted to him from\\n\\t\\t\\t\\tMuhammad ibn Ibrahim ibn al-Harith at-Taymi from Rabia\\n\\t\\t\\t\\tibn Abdullah ibn al-Hudayr that he had eaten an evening\\n\\t\\t\\t\\tmeal with Umar ibn al-Khattab who then prayed without\\n\\t\\t\\t\\tdoing wudu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "22",
    "sectionHeading": "Discontinuing Doing Wudu on Account of Eating Cooked Food",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Damra ibn Said\\n\\t\\t\\t\\tal-Mazini from Aban ibn Uthman that Uthman ibn Affan ate\\n\\t\\t\\t\\tbread and meat, rinsed his mouth out, washed his hands\\n\\t\\t\\t\\tand wiped his face with them, and then prayed without\\n\\t\\t\\t\\tdoing wudu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "23",
    "sectionHeading": "Discontinuing Doing Wudu on Account of Eating Cooked Food",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Ali\\n\\t\\t\\t\\tibn Abi Talib and Abdullah ibn Abbas did not do wudu\\n\\t\\t\\t\\tafter eating cooked food.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "24",
    "sectionHeading": "Discontinuing Doing Wudu on Account of Eating Cooked Food",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the asked Abdullah ibn Amir ibn Rabia whether a man who\\n\\t\\t\\t\\tdid wudu for prayer and then ate cooked food had to do\\n\\t\\t\\t\\twudu again. He said, \"I saw my father do that without\\n\\t\\t\\t\\tdoing wudu .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "25",
    "sectionHeading": "Discontinuing Doing Wudu on Account of Eating Cooked Food",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Nuaym Wahb ibn\\n\\t\\t\\t\\tKaysan that he heard Jabir ibn Abdullah al-Ansari saying,\\n\\t\\t\\t\\t\"I saw Abu Bakr as-Siddiq eat meat and then pray without\\n\\t\\t\\t\\tdoing wudu.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "26",
    "sectionHeading": "Discontinuing Doing Wudu on Account of Eating Cooked Food",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn\\n\\t\\t\\t\\tal-Munkadir that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was invited to eat, and some\\n\\t\\t\\t\\tbread and meat was brought to him. He ate some of it, and\\n\\t\\t\\t\\tthen did wudu and prayed. Then more of the same food was\\n\\t\\t\\t\\tbrought and he ate some more and then prayed without\\n\\t\\t\\t\\tdoing wudu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "27",
    "sectionHeading": "Discontinuing Doing Wudu on Account of Eating Cooked Food",
    "text": "<p>\\n\\t\\t\\t\\tIt was related to me from Malik from Musa ibn Uqba from\\n\\t\\t\\t\\tAbd ar-Rahman ibn Yazid al-Ansari that when Anas ibn\\n\\t\\t\\t\\tMalik came back from Iraq, Abu Talha and Ubayy ibn Kab\\n\\t\\t\\t\\tvisited him. He brought them some cooked food and they\\n\\t\\t\\t\\tate, and then Anas got up and did wudu. Abu Talha and\\n\\t\\t\\t\\tUbayy ibn Kab asked, \"What's this, Anas? Is it an Iraqi\\n\\t\\t\\t\\tcustom?\" and Anas said, \"I wish I had not done it.\" (i.e.\\n\\t\\t\\t\\twudu). Abu Talha and Ubayy ibn Kab both got up and prayed\\n\\t\\t\\t\\twithout doing wudu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "28",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was asked about cleaning after\\n\\t\\t\\t\\texcretion. He replied, \"Are any of you unable to find\\n\\t\\t\\t\\tthree stones?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "29",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from al-Ala ibn Abd\\n\\t\\t\\t\\tar-Rahman from his father from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah,  may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, went to the burial grounds and said, \"Peace be\\n\\t\\t\\t\\tupon you, home of a people who believe! We shall be among\\n\\t\\t\\t\\tyou, Allah willing. I wish that I had seen our brothers!\"\\n\\t\\t\\t\\tThe people with him said, \"Messenger of Allah! Are we not\\n\\t\\t\\t\\tyour brothers?\" \"No,\" he said, \"You are my companions.\\n\\t\\t\\t\\tOur brothers are those who have not yet come. And I will\\n\\t\\t\\t\\tprecede them to the Hawd. (The Hawd: the watering place\\n\\t\\t\\t\\tof the Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tfrom which he will give to the people of his community on\\n\\t\\t\\t\\tthe day of rising.)\" They asked him, \"Messenger of Allah!\\n\\t\\t\\t\\tHow will you recognise those of your community who come\\n\\t\\t\\t\\tafter you?\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"Doesn't a man who has horses with white legs\\n\\t\\t\\t\\tand white blazes on their foreheads among totally black\\n\\t\\t\\t\\thorses recognise which ones are his own?\" They said, \"Of\\n\\t\\t\\t\\tcourse, Messenger of Allah.\" He went on, \"Even so will\\n\\t\\t\\t\\tthey come on the day of rising with white marks on their\\n\\t\\t\\t\\tforeheads, hands and feet from wudu, and I will precede\\n\\t\\t\\t\\tthem to the Hawd. Some men will be driven away from the\\n\\t\\t\\t\\tHawd as if they were straying camels and I shall call out\\n\\t\\t\\t\\tto them, 'Will you not come? Will you not come? Will you\\n\\t\\t\\t\\tnot come?' and someone will say, 'They changed things\\n\\t\\t\\t\\tafter you,' so I shall say, 'Then away with them, away\\n\\t\\t\\t\\twith them, away with them!' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "30",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from Humran, the mawla of Uthman ibn Affan,\\n\\t\\t\\t\\tthat Uthman ibn Affan was once sitting on the Maqaid (the\\n\\t\\t\\t\\tbenches surrounding the Madina Mosque, or else a stone\\n\\t\\t\\t\\tnear Uthman ibn Affan's house where he sat to discuss\\n\\t\\t\\t\\twith people), when the muadhdhin came and told him that\\n\\t\\t\\t\\tit was time for the asr prayer. He called for water and\\n\\t\\t\\t\\tdid wudu. Then he said, \"By Allah, I shall tell you\\n\\t\\t\\t\\tsomething which I would not tell you if it were not in\\n\\t\\t\\t\\tthe Book of Allah. I heard the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, say, 'If a man does\\n\\t\\t\\t\\twudu, and makes sure he does it correctly, and then does\\n\\t\\t\\t\\tthe prayer, he will be forgiven everything that he does\\n\\t\\t\\t\\tbetween then and the time when he prays the next prayer.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"I believe he meant this ayat\\n\\t\\t\\t\\t- 'Establish prayer at the two ends of the day and in\\n\\t\\t\\t\\tsome watches of the night. Good actions take away wrong\\n\\t\\t\\t\\tactions. That is a reminder for those who remember.' \"\\n\\t\\t\\t\\t(Sura 11 ayat 114).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "31",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar from Abdullah as-Sanabihi that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"A trusting slave does wudu and as he rinses\\n\\t\\t\\t\\this mouth the wrong actions leave it. As he cleans his\\n\\t\\t\\t\\tnose the wrong actions leave it. As he washes his face,\\n\\t\\t\\t\\tthe wrong actions leave it, even from underneath his\\n\\t\\t\\t\\teyelashes. As he washes his hands the wrong actions leave\\n\\t\\t\\t\\tthem, even from underneath his fingernails. As he wipes\\n\\t\\t\\t\\this head the wrong actions leave it, even from his ears.\\n\\t\\t\\t\\tAnd as he washes his feet the wrong actions leave them,\\n\\t\\t\\t\\teven from underneath the toenails of both his feet.\" He\\n\\t\\t\\t\\tadded, \"Then his walking to the mosque and his prayer are\\n\\t\\t\\t\\tan extra reward for him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "32",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Suhayl ibn Abi Salih\\n\\t\\t\\t\\tfrom his father from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, \"A\\n\\t\\t\\t\\tmuslim slave (or a trusting slave) does wudu and as he\\n\\t\\t\\t\\twashes his face every wrong action he has seen with his\\n\\t\\t\\t\\teyes leaves with the water (or the last drop of water).\\n\\t\\t\\t\\tAs he washes his hands every wrong action he has done\\n\\t\\t\\t\\twith his hands leaves with the water (orthe last drop of\\n\\t\\t\\t\\twater). And as he washes his feet every wrong action his\\n\\t\\t\\t\\tfeet have walked to leaves with the water (or the last\\n\\t\\t\\t\\tdrop of water) so that he comes away purified of wrong\\n\\t\\t\\t\\tactions.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "33",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha that Anas ibn Malik said, \"I saw the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, on one occasion when the asr prayer was at hand .\\n\\t\\t\\t\\tEveryone was looking for water for wudu but no-one could\\n\\t\\t\\t\\tfind any. Then the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, brought some water in a vessel .\\n\\t\\t\\t\\tHe put his hand into the vessel and then he told them all\\n\\t\\t\\t\\tto do wudu from it.\" Anas added, \"I saw water coming out\\n\\t\\t\\t\\tfrom his fingers. Then all of them to the last man did\\n\\t\\t\\t\\twudu.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "34",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nuaym ibn Abdullah\\n\\t\\t\\t\\tal-Madani al-Mujmir that he heard Abu Hurayra say, \"If\\n\\t\\t\\t\\tsomeone does wudu and does it correctly and then goes off\\n\\t\\t\\t\\tintending to do the prayer, then he is in prayer as long\\n\\t\\t\\t\\tas he intends to do the prayer. A good action is written\\n\\t\\t\\t\\tfor every alternate step he makes and a wrong action is\\n\\t\\t\\t\\terased for the second. When you hear the iqama do not\\n\\t\\t\\t\\tlengthen your stride, and the one who has the greatest\\n\\t\\t\\t\\treward is the one whose house is farthest away.\" They\\n\\t\\t\\t\\tsaid, \"Why, Abu Hurayra?\" He replied, \"Because of the\\n\\t\\t\\t\\tgreater number of steps.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "35",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the heard someone ask Said ibn al-Musayyab about washing\\n\\t\\t\\t\\toff excreta with water. Said said, \"That is the way women\\n\\t\\t\\t\\twash.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "36",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"If a dog\\n\\t\\t\\t\\tdrinks from your vessel, wash it seven times.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "37",
    "sectionHeading": "On Wudu inGeneral",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Try to go straight, although you will not\\n\\t\\t\\t\\tbe able to do so. Act, and the best of your actions is\\n\\t\\t\\t\\tthe prayer. And only a mumin is constant in his wudu.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "38",
    "sectionHeading": "Wiping the Head and Ears",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used two fingers to take water to his ears.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "39",
    "sectionHeading": "Wiping the Head and Ears",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tJabir ibn Abdullah al-Ansari was asked about wiping over\\n\\t\\t\\t\\ta turban. He said, \"Not unless you have wiped over your\\n\\t\\t\\t\\thair with water.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "40",
    "sectionHeading": "Wiping the Head and Ears",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\tAbu Urwa ibn az-Zubayr used to take off his turban and\\n\\t\\t\\t\\twipe his head with water.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "41",
    "sectionHeading": "Wiping the Head and Ears",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that she saw\\n\\t\\t\\t\\tSafiyya bint Abi Ubayd, the wife of Abdullah ibn 'Umar,\\n\\t\\t\\t\\ttake off her head-covering and wipe her head with water.\\n\\t\\t\\t\\tNafi was a child at the time.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who did wudu but forgot to\\n\\t\\t\\t\\twipe his head until the water had dried. He said, \"I\\n\\t\\t\\t\\tconsider that he should wipe his head and then repeat the\\n\\t\\t\\t\\tprayer if he has already performed it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who did wudu but forgot to\\n\\t\\t\\t\\twipe his head until the water had dried. He said, \"I\\n\\t\\t\\t\\tconsider that he should wipe his head and then repeat the\\n\\t\\t\\t\\tprayer if he has already performed it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "42",
    "sectionHeading": "Wiping over Leather Socks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abbad\\n\\t\\t\\t\\tibn Ziyad, a descendant of al-Mughira ibn Shuba from his\\n\\t\\t\\t\\tfather from al Mughira ibn Shuba that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, went to\\n\\t\\t\\t\\trelieve himself during the expedition of Tabuk. Mughira\\n\\t\\t\\t\\tsaid, \"I went with him, taking water. Then the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, came\\n\\t\\t\\t\\tback and I poured out the water for him. He washed his\\n\\t\\t\\t\\thands and then went to push his hands out of the sleeves\\n\\t\\t\\t\\tof  his garment, but could not do so because of their\\n\\t\\t\\t\\tnarrowness. So he brought them out from underneath his\\n\\t\\t\\t\\tgarment. Then he washed his arms, wiped his head and\\n\\t\\t\\t\\twiped over his leather socks. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, returned and Abdar\\n\\t\\t\\t\\tRahman ibn Awf was leading the people in prayer, and he\\n\\t\\t\\t\\thad already finished one raka with them. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, prayed\\n\\t\\t\\t\\tthe remaining raka with them to everyone's concern. When\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, finished he said, 'You have acted correctly.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "43",
    "sectionHeading": "Wiping over Leather Socks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Nafi and Abdullah ibn\\n\\t\\t\\t\\tDinar told him that Abdullah ibn Umar arrived at Kufa and\\n\\t\\t\\t\\twent to Sad ibn Abi Waqqas, who was the Amir of Kufa at\\n\\t\\t\\t\\tthat time. Abdullah ibn Umar saw him wiping over his\\n\\t\\t\\t\\tleather socks and disapproved of it. So Sad said to him,\\n\\t\\t\\t\\t\"Ask your father when you get back.\" Abdullah returned\\n\\t\\t\\t\\tbut forgot to ask Umar about the matter until Sad arrived\\n\\t\\t\\t\\tand said, \"Have you asked your father?\" and he said,\\n\\t\\t\\t\\t\"No.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah then asked Umar and Umar replied, \"If your feet\\n\\t\\t\\t\\tare ritually pure when you put them in the leather socks\\n\\t\\t\\t\\tthen you can wipe over the socks.\" Abdullah said ,\"What\\n\\t\\t\\t\\tabout if we have just come from relieving ourselves?\"\\n\\t\\t\\t\\tUmar said, \"Yes, even if you have just come from\\n\\t\\t\\t\\trelieving yourself.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "44",
    "sectionHeading": "Wiping over Leather Socks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar urinated in the market place and then did wudu,\\n\\t\\t\\t\\twashing his face and hands and wiping his head. Then as\\n\\t\\t\\t\\tsoon as he had come into the mosque, he was called to\\n\\t\\t\\t\\tpray over a dead person, so he wiped over his leather\\n\\t\\t\\t\\tsocks and prayed.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "45",
    "sectionHeading": "Wiping over Leather Socks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Said ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Ruqash said, \"I saw Anas ibn Malik come and\\n\\t\\t\\t\\tsquat and urinate.Then water was brought and he did wudu.\\n\\t\\t\\t\\tHe washed his face, then his arms to the elbows, and then\\n\\t\\t\\t\\the wiped his head and wiped over his leather socks. Then\\n\\t\\t\\t\\the came to the mosque and prayed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether a man who did\\n\\t\\t\\t\\twudu for prayerand then put on his leather socks, and\\n\\t\\t\\t\\tthen urinated and took them off and put them back on\\n\\t\\t\\t\\tagain, should begin wudu afresh.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik replied, \"He should take off his socks and wash his\\n\\t\\t\\t\\tfeet. Only someone who puts on leather socks when his\\n\\t\\t\\t\\tfeet are (already) ritually purified by wudu can wipe\\n\\t\\t\\t\\tover them. Someone who puts on leather socks when his\\n\\t\\t\\t\\tfeet are not ritually purified by wudu, should not wipe\\n\\t\\t\\t\\tover them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked about a man who did wudu\\n\\t\\t\\t\\twith his leather socks on and forgot to wipe over them\\n\\t\\t\\t\\tuntil the water was dry and he had prayed, and he said,\\n\\t\\t\\t\\t\"He should wipe over his socks and repeat the prayer but\\n\\t\\t\\t\\tnot repeat wudu.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who washed his feet and put\\n\\t\\t\\t\\ton his leather socks and then started doing wudu, and he\\n\\t\\t\\t\\tsaid, \"He should take off  his socks and do wudu and wash\\n\\t\\t\\t\\this feet.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "46",
    "sectionHeading": "How to Wipe over Leather Socks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\the saw his father wiping over his leather socks. He said,\\n\\t\\t\\t\\t\"When he wiped over his socks he would never do more than\\n\\t\\t\\t\\twipe the tops and he would not wipe the bottoms.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "47",
    "sectionHeading": "How to Wipe over Leather Socks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik had asked Ibn Shihab how\\n\\t\\t\\t\\tto wipe over leather socks. Ibn Shihab had put one hand\\n\\t\\t\\t\\tunder the sock and his other hand above the sock and then\\n\\t\\t\\t\\tpassed them over it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"Out of all that I have heard\\n\\t\\t\\t\\tabout the matter I like what Ibn Shihab said the most.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "48",
    "sectionHeading": "Nose-Bleeds",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar would leave and do wudu if he had a nose-bleed\\n\\t\\t\\t\\tand then return and complete his prayer without saying\\n\\t\\t\\t\\tanything.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "49",
    "sectionHeading": "How to Wipe over Leather Socks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Abbas used to have nose-bleeds and would leave to\\n\\t\\t\\t\\twash off the blood. He would then return and complete his\\n\\t\\t\\t\\tprayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "50",
    "sectionHeading": "How to Wipe over Leather Socks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Abdullah\\n\\t\\t\\t\\tQusayt al-Laythi that he saw Said ibn al-Musayyab having\\n\\t\\t\\t\\ta nose-bleed while praying. He went off to the room of\\n\\t\\t\\t\\tUmm Salama, the wife of the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, and water was brought to him and he\\n\\t\\t\\t\\tdid wudu. He then returned and completed his prayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "51",
    "sectionHeading": "What to Do in the Event of a Nose-Bleed",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Abd ar-Rahman ibn Harmala\\n\\t\\t\\t\\tal-Aslami said,  \"I saw Said ibn al-Musayyab with his\\n\\t\\t\\t\\tnose bleeding and blood poured out of it so that his\\n\\t\\t\\t\\tfingers were all red from the blood coming out of his\\n\\t\\t\\t\\tnose, and he prayed without doing wudu.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "52",
    "sectionHeading": "What to Do in the Event of a Nose-Bleed",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar Rahman ibn\\n\\t\\t\\t\\tal-Mujabbar that he saw Salim ibn Abdullah with blood\\n\\t\\t\\t\\trunning from his nose so that his fingers were all\\n\\t\\t\\t\\tcoloured red. Then he rubbed it and prayed without doing\\n\\t\\t\\t\\twudu.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "53",
    "sectionHeading": "What to Do in the Event of Bleeding from a Wound or a Nose-Bleed",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Hisham ibn Urwa from his father\\n\\t\\t\\t\\tthat al-Miswar ibn Makhrama told him that he had visited\\n\\t\\t\\t\\tUmar ibn al Khattab on the night he was stabbed and had\\n\\t\\t\\t\\twoken him up for the subh prayer and Umar had said,\\n\\t\\t\\t\\t''Yes. Whoever stops doing the prayer will get nothing\\n\\t\\t\\t\\tfrom Islam,\" and he did the prayer with blood pouring\\n\\t\\t\\t\\tfrom his wound.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "54",
    "sectionHeading": "What to Do in the Event of Bleeding from a Wound or a Nose-Bleed",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab was asked, \"What do you say about\\n\\t\\t\\t\\tsomeone who is afflicted by a nose-bleed which does not\\n\\t\\t\\t\\tstop? \"Malik said that Yahya ibn Said said that Said ibn\\n\\t\\t\\t\\tal Musayyab said, \"I say that he should signal with his\\n\\t\\t\\t\\thead.\" (i.e. instead of doing sajda or ruku.)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"That is what I like most out\\n\\t\\t\\t\\tof what I have heard about the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "55",
    "sectionHeading": "Wudu on Account of Prostatic Fluid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Abdullah ibn Ubaydullah, from Sulayman ibn Yasar from\\n\\t\\t\\t\\talMiqdad ibn al-Aswad that Ali ibn Abi Talib told him to\\n\\t\\t\\t\\task the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, what a man should do, who, when close to his\\n\\t\\t\\t\\twife, had a flow of prostatic fluid. Ali explained that\\n\\t\\t\\t\\tthe daughter of the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was living with him then and he\\n\\t\\t\\t\\twas too shy to ask for himself. Al-Miqdad said, \"I asked\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, about it, and he said, 'When you find that, wash\\n\\t\\t\\t\\tyour genitals with water and do wudu as for prayer.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "56",
    "sectionHeading": "Wudu on Account of Prostatic Fluid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Zayd ibn Aslam from his father\\n\\t\\t\\t\\tthat Umar ibn al-Khattab said, \"I find it dropping from\\n\\t\\t\\t\\tme like small beads. When you find that, wash your penis\\n\\t\\t\\t\\tand do wudu as for prayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "57",
    "sectionHeading": "Wudu on Account of Prostatic Fluid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\this father that Jundub, the mawla of Abdullah ibn Ayyash,\\n\\t\\t\\t\\tsaid, \"I asked Abdullah ibn Umar about prostatic fluid\\n\\t\\t\\t\\tand he said, 'When you find it, wash your genitals and do\\n\\t\\t\\t\\twudu as for prayer.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "58",
    "sectionHeading": "Indulgence in Not Having to do Wudu for Prostatic Fluid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the was listening to Said ibn al-Musayyab and a man\\n\\t\\t\\t\\tquestioned him saying, \"I discover a liquid when I am\\n\\t\\t\\t\\tpraying. Should I leave?\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tSaid ibn al-Musayyab said to him, \"Even if it were to\\n\\t\\t\\t\\tflow on my leg I would not leave until I had finished the\\n\\t\\t\\t\\tprayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "59",
    "sectionHeading": "Indulgence in Not Having to do Wudu for Prostatic Fluid",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that as-Salt ibn Zuyayd\\n\\t\\t\\t\\tsaid, \"I asked Sulayman ibn Yasar about a liquid I\\n\\t\\t\\t\\tdiscovered. He said, 'Wash what is under your garments\\n\\t\\t\\t\\twith water and forget about it.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "60",
    "sectionHeading": "Wudu on Account of Touching the Genitals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Muhammad ibn Amr ibn Hazim heard Urwa ibn az-Zubayr\\n\\t\\t\\t\\tsaying, \"I went to see Marwan ibn al-Hakam and we talked\\n\\t\\t\\t\\tabout what you had to do wudu for, and Marwan said, 'You\\n\\t\\t\\t\\thave to do wudu if you touch your penis.' Urwa said, 'I\\n\\t\\t\\t\\tdidn't know that.' Marwan ibn al-Hakam said that Busra\\n\\t\\t\\t\\tbint Safwan had told him that she heard the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, say, 'If\\n\\t\\t\\t\\tany of you touches his penis he should do wudu.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "61",
    "sectionHeading": "Wudu on Account of Touching the Genitals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ismail ibn Muhammad\\n\\t\\t\\t\\tibn Sad ibn Abi Waqqas that Musab ibn Sad ibn Abi Waqqas\\n\\t\\t\\t\\tsaid, \"I was holding the Book for Sad ibn Abi Waqqas and\\n\\t\\t\\t\\tI rubbed myself. Sad said, 'Did you touch your penis?' I\\n\\t\\t\\t\\treplied, 'Yes,' and he said, 'Get up and do wudu.' So I\\n\\t\\t\\t\\tgot up and did wudu and then returned.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "62",
    "sectionHeading": "Wudu on Account of Touching the Genitals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"If you touch your penis you have\\n\\t\\t\\t\\tto do wudu.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "63",
    "sectionHeading": "Wudu on Account of Touching the Genitals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father used to say, \"If any of you touches his penis\\n\\t\\t\\t\\the has to do wudu.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "64",
    "sectionHeading": "Wudu on Account of Touching the Genitals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related from Malik from Ibn Shihab that Salim ibn\\n\\t\\t\\t\\tAbdullah said, \"I saw my father Abdullah ibn Umar, do\\n\\t\\t\\t\\tghusl and then do wudu. I said to him, 'Father, isn't\\n\\t\\t\\t\\tghusl enough for you?' He said, 'Of course, but sometimes\\n\\t\\t\\t\\tI touch my penis, so I do wudu.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "65",
    "sectionHeading": "Wudu on Account of Touching the Genitals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Salim ibn\\n\\t\\t\\t\\t'Abdullah said, \"I was with Abdullah ibn Umar on a\\n\\t\\t\\t\\tjourney and after the sun had risen I saw him do wudu and\\n\\t\\t\\t\\tthen pray. So I said to him, 'This isn't a prayer that\\n\\t\\t\\t\\tyou normally do. 'He said, 'After I had done wudu for the\\n\\t\\t\\t\\tsubh prayer, I touched my genitals. Then I forgot to do\\n\\t\\t\\t\\twudu. So I did wudu again and repeated my prayer.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "66",
    "sectionHeading": "Wudu on Account of a Man Kissing His Wife",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that his father Abdullah ibn Umar used to\\n\\t\\t\\t\\tsay, \"A man's kissing his wife and fondling her with his\\n\\t\\t\\t\\thands are part of intercourse. Someone who kisses his\\n\\t\\t\\t\\twife or fondles her with his hand must do wudu.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "67",
    "sectionHeading": "Wudu on Account of a Man Kissing His Wife",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Masud used to say, \"Wudu is necessary if a\\n\\t\\t\\t\\tman kisses his wife.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "68",
    "sectionHeading": "Wudu on Account of a Man Kissing His Wife",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab used to\\n\\t\\t\\t\\tsay, \"Wudu is necessary if a man kisses his wife.\" Nafi\\n\\t\\t\\t\\tsaid that Malik said, \"That is what I like most out of\\n\\t\\t\\t\\twhat I have heard.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "69",
    "sectionHeading": "How to do Ghusl for Major Ritual Impurity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from A'isha, umm al-muminin, that whenever the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, did ghusl for major ritual impurity, he would\\n\\t\\t\\t\\tbegin by washing his hands, and then do wudu as for\\n\\t\\t\\t\\tprayer. He would then put his fingers in the water and\\n\\t\\t\\t\\trub the roots of his hair with them. Then he would pour\\n\\t\\t\\t\\tas much water as two hands can hold on to his head three\\n\\t\\t\\t\\ttimes, and over the entire surface of his skin.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "70",
    "sectionHeading": "How to do Ghusl for Major Ritual Impurity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr from A'isha, umm al-muminin, that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to do ghusl for major ritual impurity from a\\n\\t\\t\\t\\tvessel which contained a faraq.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "71",
    "sectionHeading": "How to do Ghusl for Major Ritual Impurity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that when\\n\\t\\t\\t\\tAbdullah ibn Umar used to do ghusl for major ritual\\n\\t\\t\\t\\timpurity he would begin by pouring water on his right\\n\\t\\t\\t\\thand and washing it. Then, in order, he would wash his\\n\\t\\t\\t\\tgenitals, rinse his mouth, snuff water in and out of his\\n\\t\\t\\t\\tnose, wash his face and splash his eyes with water. Then\\n\\t\\t\\t\\the would wash his right arm and then his left, and after\\n\\t\\t\\t\\tthat he would wash his head. He would finish by having a\\n\\t\\t\\t\\tcomplete wash and pouring water all over himself.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "72",
    "sectionHeading": "How to do Ghusl for Major Ritual Impurity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tA'isha was asked about how a woman should do ghusl for\\n\\t\\t\\t\\tmajor ritual impurity. She said, \"She should scoop water\\n\\t\\t\\t\\tover her head with both hands three times and rub the\\n\\t\\t\\t\\troots of her hair with her hands.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "73",
    "sectionHeading": "Obligation to Do Ghusl when the Two Circumcised Parts Meet",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab that Umar ibn al-Khattab and Uthman ibn\\n\\t\\t\\t\\tAffan and A'isha, the wife of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, used to say, \"When the\\n\\t\\t\\t\\tcircumcised part touches the circumcised part, ghusl is\\n\\t\\t\\t\\tobligatory.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "74",
    "sectionHeading": "Obligation to Do Ghusl when the Two Circumcised Parts Meet",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Abdullah that Abu Salamaibn Abdar-Rahman ibn\\n\\t\\t\\t\\tAwf related that he had asked A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, what\\n\\t\\t\\t\\tmade ghusl obligatory. She said, \"Do you know what you\\n\\t\\t\\t\\tare like, Abu Salama? You are like a chick when it hears\\n\\t\\t\\t\\tthe cocks crowing and so crows with them. When the\\n\\t\\t\\t\\tcircumcised part passes the circumcised part, ghusl is\\n\\t\\t\\t\\tobligatory.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "75",
    "sectionHeading": "Obligation to Do Ghusl when the Two Circumcised Parts Meet",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSaid ibn al-Musayyab that Abu Musa al-Ashari came to\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and said to her, \"The disagreement of\\n\\t\\t\\t\\tthe companions in a matter which I hate to bring before\\n\\t\\t\\t\\tyou has distressed me.\" She said, \"What is that? You did\\n\\t\\t\\t\\tnot ask your mother about it, so ask me.\" He said, \"A man\\n\\t\\t\\t\\tpenetrates his wife, but becomes listless and does not\\n\\t\\t\\t\\tejaculate. \"She said, \"When the circumcised part passes\\n\\t\\t\\t\\tthe circumcised part ghusl is obligatory.\" Abu Musa\\n\\t\\t\\t\\tadded, \"I shall never ask anyone about this after you.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "76",
    "sectionHeading": "Obligation to Do Ghusl when the Two Circumcised Parts Meet",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAbdullah ibn Kab, the mawla of Uthman ibn Affan that\\n\\t\\t\\t\\tMahmud ibn Labid al-Ansari asked Zayd ibn Thabit about a\\n\\t\\t\\t\\tman who penetrated his wife but became listless and did\\n\\t\\t\\t\\tnot ejaculate. Zayd ibn Thabit said, \"He does ghusl.\"\\n\\t\\t\\t\\tMahmud said to him, \"Ubayy ibn Kab used not to think that\\n\\t\\t\\t\\tghusl was necessary,\" but Zayd ibn Thabit said, \"Ubayy\\n\\t\\t\\t\\tibn Kab drew away from that before he died.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "77",
    "sectionHeading": "Obligation to Do Ghusl when the Two Circumcised Parts Meet",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"When the circumcised part passes\\n\\t\\t\\t\\tthe circumcised part, ghusl is obligatory.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "78",
    "sectionHeading": "Wudu of a Person in a State of Major Ritual Impurity (Janaba)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tthat Abdullah ibn Umar related that Umar ibn al-Khattab\\n\\t\\t\\t\\tmentioned to the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, that he would sometimes become junub\\n\\t\\t\\t\\tin the night. The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said to him, \"Do wudu and wash your\\n\\t\\t\\t\\tpenis, and then sleep.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "79",
    "sectionHeading": "Wudu of a Person in a State of Major Ritual Impurity (Janaba)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, used to say, \"If you\\n\\t\\t\\t\\thave intercourse with your wife and then wish to go to\\n\\t\\t\\t\\tsleep before doing ghusl, do not sleep until you have\\n\\t\\t\\t\\tdone wudu as for prayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "80",
    "sectionHeading": "Wudu of a Person in a State of Major Ritual Impurity (Janaba)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar, if he wished to sleep or eat while junub, would\\n\\t\\t\\t\\twash his face, and his arms to the elbows, and wipe his\\n\\t\\t\\t\\thead. Then he would eat or sleep.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t2.20 The Repetition of the Prayer by a Person in a State\\n\\t\\t\\t\\tof Major Ritual Impurity, his Doing Ghusl, when He has\\n\\t\\t\\t\\tPrayed without Remembering it, and his Washing his\\n\\t\\t\\t\\tGarments.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "81",
    "sectionHeading": "The Repetition of the Prayer by a Person in a State of Major Ritual Impurity, his Doing Ghusl, when He has Prayed without Remembering it, and his Washing his Garments.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ismail ibn Abi Hakim\\n\\t\\t\\t\\tthat Ata ibn Yasar told him that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said the takbir\\n\\t\\t\\t\\tin one of the prayers and then indicated to them with his\\n\\t\\t\\t\\thand to stay in place. He left and then returned with\\n\\t\\t\\t\\ttraces of water on his skin.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "82",
    "sectionHeading": "The Repetition of the Prayer by a Person in a State of Major Ritual Impurity, his Doing Ghusl, when He has Prayed without Remembering it, and his Washing his Garments.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\tZuyayd ibn as-Salt said, \"I went with Umar ibn al-Khattab\\n\\t\\t\\t\\tto Juruf and he looked down and noticed that he had had a\\n\\t\\t\\t\\twet dream and had prayed without doing ghusl. He\\n\\t\\t\\t\\texclaimed, 'By Allah I realise that I have had a wet\\n\\t\\t\\t\\tdream and did not know it and have not done ghusl.' So he\\n\\t\\t\\t\\tdid ghusl and washed off whatever he saw on his garment,\\n\\t\\t\\t\\tand sprinkled with water whatever he did not see.Then he\\n\\t\\t\\t\\tgave the adhan or the iqama and prayed in the\\n\\t\\t\\t\\tmidmorning.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "83",
    "sectionHeading": "The Repetition of the Prayer by a Person in a State of Major Ritual Impurity, his Doing Ghusl, when He has Prayed without Remembering it, and his Washing his Garments.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ismail ibn Abi Hakim\\n\\t\\t\\t\\tfrom Sulayman ibn Yasar that Umar ibn al-Khattab went out\\n\\t\\t\\t\\tearly in the morning to his land in al-Juruf and found\\n\\t\\t\\t\\tsemen on his garment. He said, \"I have been tried with\\n\\t\\t\\t\\twet dreams since I have been entrusted with governing the\\n\\t\\t\\t\\tpeople.\" He did ghusl and washed his garment of what he\\n\\t\\t\\t\\tsaw of the semen, and then prayed after the sun had\\n\\t\\t\\t\\trisen.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "84",
    "sectionHeading": "The Repetition of the Prayer by a Person in a State of Major Ritual Impurity, his Doing Ghusl, when He has Prayed without Remembering it, and his Washing his Garments.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSulayman ibn Yasar that Umar ibn al-Khattab led the\\n\\t\\t\\t\\tpeople in the subh prayer and then went out to his land\\n\\t\\t\\t\\tin Juruf and found semen on his clothes. He said, \"Since\\n\\t\\t\\t\\twe have been eating rich meat our veins have become\\n\\t\\t\\t\\tfulsome.\" He did ghusl, washed the semen from his\\n\\t\\t\\t\\tclothing, and did his prayer again.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "85",
    "sectionHeading": "The Repetition of the Prayer by a Person in a State of Major Ritual Impurity, his Doing Ghusl, when He has Prayed without Remembering it, and his Washing his Garments.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father fromYahyaibn Abd ar-Rahman ibn Ha ib that he\\n\\t\\t\\t\\thad set off for Mumra with Umar ibn al-Khattab in a party\\n\\t\\t\\t\\tof riders, among whom was Amr ibn al-As. Umar ibn\\n\\t\\t\\t\\tal-Khattab dismounted for a rest late at night on a\\n\\t\\t\\t\\tcertain road near a certain oasis. Umar had a wet dream\\n\\t\\t\\t\\twhen it was almost dawn and there was no water among the\\n\\t\\t\\t\\triding party. He rode until he came to some water and\\n\\t\\t\\t\\tthen he began to wash off what he saw of the semen until\\n\\t\\t\\t\\tit had gone. Amr ibn al-As said to him, \"It is morning\\n\\t\\t\\t\\tand there are clothes with us, so allow your garment to\\n\\t\\t\\t\\tbe washed. ''Umar ibn al-Khattab said to him, \"I am\\n\\t\\t\\t\\tsurprised at you, Amr ibn al-As! Even if you could find\\n\\t\\t\\t\\tclothes, would everybody be able to find them? By Allah,\\n\\t\\t\\t\\tif I were to do it, it would become a sunna. No, I wash\\n\\t\\t\\t\\twhat I see, and I sprinkle with water what I do not see.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who found traces of a wet dream\\n\\t\\t\\t\\ton his clothes and did not know when it had occurred and\\n\\t\\t\\t\\tdid not remember anything he had seen in his sleep. He\\n\\t\\t\\t\\tsaid, \"Let the intention of his ghusl be from the time\\n\\t\\t\\t\\twhen he last slept, and if he has prayed since that last\\n\\t\\t\\t\\tsleep he should repeat it. This is because often a man\\n\\t\\t\\t\\thas a wet dream and sees nothing, and often he sees\\n\\t\\t\\t\\tsomething but does not have an emission. But, if he finds\\n\\t\\t\\t\\tliquid on his garment he must do ghusl. This is because\\n\\t\\t\\t\\tUmar repeated what he had prayed after the time he had\\n\\t\\t\\t\\tlast slept and not what was before it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "86",
    "sectionHeading": "Ghusl of a Woman when She Experiences the Same as a Man in Her Sleep",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr that Umm Sulayman said to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, \"Should a\\n\\t\\t\\t\\twoman do ghusl when she experiences the same as a man in\\n\\t\\t\\t\\ther sleep?\" The Messenger of Al lah said to her, \"Yes,\\n\\t\\t\\t\\tshe should do ghusl. \"A'isha said to her, \"Shame on you!\\n\\t\\t\\t\\tDoes a woman see that?\" (i.e. a liquid.) The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\ther, \"May your right hand be full of dust. From where\\n\\t\\t\\t\\tdoes family resemblance come?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "87",
    "sectionHeading": "Ghusl of a Woman when She Experiences the Same as a Man in Her Sleep",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from Zaynab bint Abi Salama that Umm Salama,\\n\\t\\t\\t\\tthe wife of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, said, \"Umm Salama, the wife of Abu Talha\\n\\t\\t\\t\\tal-Ansari, came to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and said, 'Messenger of\\n\\t\\t\\t\\tAllah! Allah is not ashamed of the truth-does a woman\\n\\t\\t\\t\\thave to do ghusl if she has had an erotic dream?' He\\n\\t\\t\\t\\tsaid, 'Yes, if she sees any liquid.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "88",
    "sectionHeading": "Ghusl for Major Ritual Impurity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"There is no harm in doing ghusl\\n\\t\\t\\t\\twith water that has been used by one's wife as long as\\n\\t\\t\\t\\tshe is not menstruating or in a state of major ritual\\n\\t\\t\\t\\timpurity (junub).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "89",
    "sectionHeading": "Ghusl for Major Ritual Impurity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to sweat in a garment while he was junub\\n\\t\\t\\t\\tand then pray with it on.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "90",
    "sectionHeading": "Ghusl for Major Ritual Impurity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that the slave\\n\\t\\t\\t\\tgirls of Abdullah ibn Umar used to wash his feet and\\n\\t\\t\\t\\tbring him a mat of palm leaves while they were\\n\\t\\t\\t\\tmenstruating.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a man who had women and\\n\\t\\t\\t\\tslavegirlscould have intercourse with all of them before\\n\\t\\t\\t\\the did ghusl. He said, \"There is no harm in a man having\\n\\t\\t\\t\\tintercourse with two of his slave girls before he does\\n\\t\\t\\t\\tghusl. It is disapproved of, however, to go to a\\n\\t\\t\\t\\tfreewoman on another's day. There is no harm in making\\n\\t\\t\\t\\tlove first to one slave girl and then to another when one\\n\\t\\t\\t\\tis junub.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who was junub and water was\\n\\t\\t\\t\\tput down for him to do ghusl with.Then he forgot and put\\n\\t\\t\\t\\this finger into it to find out whether it was hot or\\n\\t\\t\\t\\tcold. Malik said, \"If no filth has soiled his fingers, I\\n\\t\\t\\t\\tdo not consider that that makes the water impure.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "91",
    "sectionHeading": "Tayammum",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd arRahman ibn\\n\\t\\t\\t\\tal-Qasim from his father that A'isha umm al-muminin said,\\n\\t\\t\\t\\t\"We went out on a journey with the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, and, when we\\n\\t\\t\\t\\tcame to Bayda' or Dhat al-Jaysh, a necklace of mine\\n\\t\\t\\t\\tbroke. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, stopped to look for it and the people\\n\\t\\t\\t\\tstopped with him. There was no water nearby and the\\n\\t\\t\\t\\tpeople were not carrying any with them, so they came to\\n\\t\\t\\t\\tAbu Bakr as-Siddiq and said, 'Don't you see what A'isha\\n\\t\\t\\t\\thas done? She has made the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and the people stop when\\n\\t\\t\\t\\tthere is no water nearby and they are not carrying any\\n\\t\\t\\t\\twith them.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha continued, \"Abu Bakr came and the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, had\\n\\t\\t\\t\\tfallen asleep with his head on my thigh . Abu Bakr said,\\n\\t\\t\\t\\t'You have made the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and the people stop when there\\n\\t\\t\\t\\tis no water nearby and they are not carrying any with\\n\\t\\t\\t\\tthem ' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe continued, \"Abu Bakr remonstrated with me and said\\n\\t\\t\\t\\twhatever Allah willed him to say, and began to poke me in\\n\\t\\t\\t\\tthe waist. The only thing that stopped me from moving was\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, had his head on my thigh. The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, slept\\n\\t\\t\\t\\tuntil morning found him with no water. Allah, the Blessed\\n\\t\\t\\t\\tand Exalted, sent down the ayat of tayammum and so they\\n\\t\\t\\t\\tdid tayammum. Usayd ibn Hudayr said, 'This is not the\\n\\t\\t\\t\\tfirst baraka from you, O family of Abu Bakr.'\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha added, \"We roused the camel I had been on and\\n\\t\\t\\t\\tfound the necklace under it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a man who did tayammum for one\\n\\t\\t\\t\\tprayer should do tayammum when the time of the next\\n\\t\\t\\t\\tprayer came or whether the first tayammum was enough. He\\n\\t\\t\\t\\tsaid, \"No, he does tayammum for every prayer, because he\\n\\t\\t\\t\\thas to look for water for every prayer. If he looks for\\n\\t\\t\\t\\tit and does not find it then he does tayammum.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a man who did tayammum could lead\\n\\t\\t\\t\\tothers in prayer if they were in wudu. He said, \"I prefer\\n\\t\\t\\t\\tthat someone else should lead them. However, I see no\\n\\t\\t\\t\\tharm in it if he does lead them in prayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said that a man who did tayammum\\n\\t\\t\\t\\tbecause he could not find any water, and then stood and\\n\\t\\t\\t\\tsaid the takbir and entered into the prayer, and then\\n\\t\\t\\t\\tsomeone came with some water, did not stop his prayer but\\n\\t\\t\\t\\tcompleted it with tayammum and did wudu for future\\n\\t\\t\\t\\tprayers.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"Whoever rises for prayer and\\n\\t\\t\\t\\tdoes not find water and so does what Allah has ordered\\n\\t\\t\\t\\thim to do of tayammum has obeyed Allah. Someone who does\\n\\t\\t\\t\\tfind water is neither purer than him nor more perfect in\\n\\t\\t\\t\\tprayer, because both have been commanded and each does as\\n\\t\\t\\t\\tAllah has commanded. What Allah has commanded as far as\\n\\t\\t\\t\\twudu is concerned is for the one who finds water, and\\n\\t\\t\\t\\ttayammum is for the one who does not find water before he\\n\\t\\t\\t\\tenters into the prayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a man who was in a state of major ritual\\n\\t\\t\\t\\timpurity could do tayammum and read his portion of Qur'an\\n\\t\\t\\t\\tand do voluntary prayers as long as he did not find any\\n\\t\\t\\t\\twater. This applied only to circumstances in which it was\\n\\t\\t\\t\\tallowable to pray with tayammum.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "92",
    "sectionHeading": "How to do Tayammum",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar and he were approaching Juruf. When they got to\\n\\t\\t\\t\\tMirbad, Abdullah got down and did tayammum with some good\\n\\t\\t\\t\\tearth. He wiped his face, and his arms to the elbows, and\\n\\t\\t\\t\\tthen prayed.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "93",
    "sectionHeading": "How to do Tayammum",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to do tayammum up to his elbows.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about how tayammum was done and what\\n\\t\\t\\t\\tparts were covered and he said, \"Strike the ground once\\n\\t\\t\\t\\tfor the face and once for the arms and wipe them to the\\n\\t\\t\\t\\telbows.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "94",
    "sectionHeading": "Tayammum of Someone in a State of Major Ritual Impurity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd arRahman ibn\\n\\t\\t\\t\\tHarmala that a man asked Said ibn al-Musayyab about what\\n\\t\\t\\t\\ta man who was junub and had done tayammum should do when\\n\\t\\t\\t\\the came across water. Said said, \"When he comes across\\n\\t\\t\\t\\twater he must do ghusl for what comes after.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about some one who had a wet dream while he\\n\\t\\t\\t\\twas on a journey and there was only enough water for wudu\\n\\t\\t\\t\\tand he was not thirsty and so he did not need to use it\\n\\t\\t\\t\\tfor that, \"Let him wash his genitals, and whatever the\\n\\t\\t\\t\\tsemen has fallen on, with the water and then he does\\n\\t\\t\\t\\ttayammum with good earth as Allah has ordered him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a man who was junub and wished to\\n\\t\\t\\t\\tdo tayammum but could only find salty earth could do\\n\\t\\t\\t\\ttayammum with that earth, and whether it was disapproved\\n\\t\\t\\t\\tof to pray on salty earth. He said, \"There is no harm in\\n\\t\\t\\t\\tpraying on salty earth or in using it to do tayammum,\\n\\t\\t\\t\\tbecause Allah the Blessed and Exalted has said, '...and\\n\\t\\t\\t\\tdo tayammum with good earth.' One is purified by tayammum\\n\\t\\t\\t\\twith everything that is earth, whether it is salty or\\n\\t\\t\\t\\totherwise.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "95",
    "sectionHeading": "What is Permitted a Man from his Wife when She is Menstruating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that a\\n\\t\\t\\t\\tman questioned the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, saying, \"What is permitted me\\n\\t\\t\\t\\tfrom my wife when she is menstruating?\" The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Let her wrap her waist-wrapper round herself tightly,\\n\\t\\t\\t\\tand then what is above that is your concern.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "96",
    "sectionHeading": "What is Permitted a Man from his Wife when She is Menstruating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman that on one occasion A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\tsleeping with the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, in one garment, when suddenly she\\n\\t\\t\\t\\tjumped up sharply. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said to her, \"What's the\\n\\t\\t\\t\\tmatter with you? Are you losing blood?\", meaning\\n\\t\\t\\t\\tmenstruating. She said, \"Yes.\" He said, \"Wrap your\\n\\t\\t\\t\\twaist-wrapper tightly about you, and return to your\\n\\t\\t\\t\\tsleeping-place.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "97",
    "sectionHeading": "What is Permitted a Man from his Wife when She is Menstruating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Ubaydullah\\n\\t\\t\\t\\tibn Abdullah ibn Umar sent a question to A'isha asking\\n\\t\\t\\t\\ther, \"May a man fondle his wife when she is\\n\\t\\t\\t\\tmenstruating?\" She replied, \"Let her wrap her\\n\\t\\t\\t\\twaist-wrapper around her lower part and then he may\\n\\t\\t\\t\\tfondle her if he wishes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "98",
    "sectionHeading": "What is Permitted a Man from his Wife when She is Menstruating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSalim ibn Abdullah and Sulayman ibn Yasar were asked\\n\\t\\t\\t\\twhether the husband of a menstruating woman could have\\n\\t\\t\\t\\tsexual intercourse with her when she saw that she was\\n\\t\\t\\t\\tpure but before she had had a ghusl. They said, \"No, not\\n\\t\\t\\t\\tuntil she has had a ghusl.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "99",
    "sectionHeading": "The Purity of a Menstruating Woman",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from AIqama ibn Abi AIqama\\n\\t\\t\\t\\tthat his mother, the mawla of A'isha, umm al-muminin,\\n\\t\\t\\t\\tsaid, \"Women used to send little boxes to A'isha, umm\\n\\t\\t\\t\\tal-muminin, with a piece of cotton cloth in each one on\\n\\t\\t\\t\\twhich was yellowness from menstrual blood, asking her\\n\\t\\t\\t\\tabout the prayer. She said to them, 'Do not be hasty\\n\\t\\t\\t\\tuntil you see a white discharge.\" By that she meant\\n\\t\\t\\t\\tpurity from menses.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "100",
    "sectionHeading": "The Purity of a Menstruating Woman",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tfrom his paternal aunt from the daughter of Zayd ibn\\n\\t\\t\\t\\tThabit that she had heard that women used to ask for\\n\\t\\t\\t\\tlamps in the middle of the night to check their purity.\\n\\t\\t\\t\\tShe would criticise them for this saying, \"Women never\\n\\t\\t\\t\\tused to do this,\" i.e. in the time of the companions.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "101",
    "sectionHeading": "The Purity of a Menstruating Woman",
    "text": "<p>\\n\\t\\t\\t\\tMalik was asked whether a woman whose period had finished\\n\\t\\t\\t\\tcould do tayammum to purify herself if she could not find\\n\\t\\t\\t\\twaterand he said, \"Yes, because she is like some one in a\\n\\t\\t\\t\\tstate of major ritual impurity, who, if he cannot find\\n\\t\\t\\t\\twater, does tayammum.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "102",
    "sectionHeading": "Menstruation in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said that a pregnant woman who noticed\\n\\t\\t\\t\\tbleeding left off from prayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "103",
    "sectionHeading": "Menstruation in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he asked Ibn Shihab\\n\\t\\t\\t\\tabout a pregnant woman who noticed bleeding. Ibn Shihab\\n\\t\\t\\t\\treplied, \"She refrains from prayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"That is what is done in our\\n\\t\\t\\t\\tcommunity.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "104",
    "sectionHeading": "Menstruation in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"I used to\\n\\t\\t\\t\\tcomb the head of the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, while I was menstruating.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "105",
    "sectionHeading": "Menstruation in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from Fatima bint al-Mundhir ibn az-Zubayr that\\n\\t\\t\\t\\tAsma bint Abu Bakr as-Siddiq said, \"A woman questioned\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, saying, 'If menstrual blood gets onto our clothes\\n\\t\\t\\t\\thow do you think we should deal with it?' The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'If menstrual blood gets onto your clothes you should\\n\\t\\t\\t\\twash them, and sprinkle them with water before you pray\\n\\t\\t\\t\\tin them.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "106",
    "sectionHeading": "Bleeding as if Menstruating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Fatima bint\\n\\t\\t\\t\\tAbu Hubaysh said, 'Messenger of Allah, I never become\\n\\t\\t\\t\\tpure - am I permitted to pray?' The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, 'That is a\\n\\t\\t\\t\\tvein, not menstruation. So when your period approaches,\\n\\t\\t\\t\\tleave off from the prayer, and when its grip leaves, wash\\n\\t\\t\\t\\tthe blood from yourself and pray.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "107",
    "sectionHeading": "Bleeding as if Menstruating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Sulayman\\n\\t\\t\\t\\tibn Yasarfrom Umm Salama, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, that a certain woman\\n\\t\\t\\t\\tin the time of the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, used to bleed profusely, so Umm\\n\\t\\t\\t\\tSalama consulted the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, for her, and he said, \"She\\n\\t\\t\\t\\tshould calculate the number of nights and days a month\\n\\t\\t\\t\\tthat she used to menstruate before it started happening,\\n\\t\\t\\t\\tand she should leave off from prayerfor that much of the\\n\\t\\t\\t\\tmonth. When she has completed that she should do ghusl,\\n\\t\\t\\t\\tbind her private parts with a cloth, and then pray.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "108",
    "sectionHeading": "Bleeding as if Menstruating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from Zaynab bint Abu Salama that she saw\\n\\t\\t\\t\\tZaynab bint Jahsh, the wife of Abd ar-Rahman ibn Awf, and\\n\\t\\t\\t\\tshe used to bleed as if menstruating. She would do ghusl\\n\\t\\t\\t\\tand pray.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "109",
    "sectionHeading": "Bleeding as if Menstruating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr ibn Abd ar-Rahman that al-Qaqa ibn Hakim and\\n\\t\\t\\t\\tZayd ibn Aslam sent him to Said ibn al-Musayyab to ask\\n\\t\\t\\t\\thow a woman who was bleeding as if menstruating should do\\n\\t\\t\\t\\tghusl. Said said, \"She does a ghusl to cover from the end\\n\\t\\t\\t\\tof one period to the end of the next, and does wudu for\\n\\t\\t\\t\\tevery prayer, and if bleeding overtakes her she should\\n\\t\\t\\t\\tbind her private parts.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "110",
    "sectionHeading": "Bleeding as if Menstruating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"A woman who bleeds as if menstruating\\n\\t\\t\\t\\tonly has to do one ghusl, and then after that she does\\n\\t\\t\\t\\twudu for each prayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The position with us is that\\n\\t\\t\\t\\twhen a woman who bleeds as if menstruating starts to do\\n\\t\\t\\t\\tthe prayer again, her husband can have sexual intercourse\\n\\t\\t\\t\\twith her. Similarly, if a woman who has given birth sees\\n\\t\\t\\t\\tblood after she has reached the fullest extent that\\n\\t\\t\\t\\tbleeding normally restrains women, her husband can have\\n\\t\\t\\t\\tsexual intercourse with her and she is in the same\\n\\t\\t\\t\\tposition as a woman who bleeds as if menstruating.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The position with us\\n\\t\\t\\t\\tconcerning a woman who bleeds as if menstruating is\\n\\t\\t\\t\\tfounded on the hadith of Hisham ibn Urwa from his father,\\n\\t\\t\\t\\tand it is what I prefer the most of what I have heard\\n\\t\\t\\t\\tabout the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "111",
    "sectionHeading": "The Urine of an Infant Boy",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"An infant boy\\n\\t\\t\\t\\twas brought to the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and it urinated on him. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, called for some water and rubbed over the urine\\n\\t\\t\\t\\twith it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "112",
    "sectionHeading": "The Urine of an Infant Boy",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud from Umm Qays\\n\\t\\t\\t\\tibn Mihsan that she brought a baby boy of hers who was\\n\\t\\t\\t\\tnot yet eating food to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and he sat it in his arms\\n\\t\\t\\t\\tand it urinated on his garment, so the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, called\\n\\t\\t\\t\\tfor some water and sprinkled over it but did not wash it.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "113",
    "sectionHeading": "Urinating Standing and Otherwise",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"A Bedouin came into the mosque and uncovered his private\\n\\t\\t\\t\\tparts to urinate. The people called out to him and began\\n\\t\\t\\t\\tto raise their voices but the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said ,'Let him be.\\n\\t\\t\\t\\t'So they let him be and he urinated. Then the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tordered a bucketful of water to be brought and it was\\n\\t\\t\\t\\tpoured on the place.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "114",
    "sectionHeading": "Urinating Standing and Otherwise",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to mefrom Malikthat Abdullah ibn Dinar\\n\\t\\t\\t\\tsaid, \"I saw Abdullah ibn Umar urinating while standing.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked if any hadith had come\\n\\t\\t\\t\\tdown about washing the private parts of urine and faeces\\n\\t\\t\\t\\tand he said, \"I have heard that some of those who have\\n\\t\\t\\t\\tpassed away used to wash themselves of faeces. I like to\\n\\t\\t\\t\\twash my private parts of urine.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "115",
    "sectionHeading": "The Tooth-stick (Siwak)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Ibn\\n\\t\\t\\t\\tas-Sabbaq that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said in a jumua, \"Muslims! Allah\\n\\t\\t\\t\\thas made this day a festival day (id) so do ghusl, and it\\n\\t\\t\\t\\twill not harm whoever has perfume to apply some of it,\\n\\t\\t\\t\\tand use a tooth-stick . \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "116",
    "sectionHeading": "The Tooth-stick (Siwak)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Were it not\\n\\t\\t\\t\\tthat I would be overburdening my community I would have\\n\\t\\t\\t\\tordered them to use a tooth-stick.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "2",
    "hadithNumber": "117",
    "sectionHeading": "The Tooth-stick (Siwak)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tHumayd ibn Abdar-Rahman ibn Awf that Abu Hurayra said,\\n\\t\\t\\t\\t\"Were it not that he would be overburdening his community\\n\\t\\t\\t\\the (the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace,) would have ordered them to use a tooth-stick\\n\\t\\t\\t\\twith each wudu.\"\\n\\t\\t\\t</p>"
  }
]
