[
  {
    "SurahNumber": "33",
    "AyahNumber": "1",
    "Text": "O Prophet! Fear Allah and do not obey the unbelievers and the\\n\\t\\t\\thypocrites: certainly Allah is aware and wise."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "2",
    "Text": "Follow that which is revealed to you from your Rabb: for Allah is\\n\\t\\t\\taware of what you do."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "3",
    "Text": "Put your trust in Allah: for Allah is your all-sufficient\\n\\t\\t\\tprotector."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "4",
    "Text": "Allah has not put two hearts in a person's body: nor does He\\n\\t\\t\\tregard your wives whom you divorce through Zihar (divorcing a\\n\\t\\t\\twife saying; from now on you are as my mother, depriving her\\n\\t\\t\\tconjugal rights yet keeping her like a slave nor letting her\\n\\t\\t\\tmarry anyone else) as your mothers: nor does He regard your\\n\\t\\t\\tadopted sons as your sons. These are mere words which you utter\\n\\t\\t\\twith your mouths; but Allah declares the Truth and guides you to\\n\\t\\t\\tthe Right Way."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "5",
    "Text": "Name your adopted sons after their fathers; that is more just in\\n\\t\\t\\tthe sight of Allah, and if you don't know who their fathers are,\\n\\t\\t\\tthen call them as your brothers in faith and your friends. There\\n\\t\\t\\tis no blame on you for an unintentional mistake, but you will be\\n\\t\\t\\theld responsible for what you do with the intention of your\\n\\t\\t\\thearts; Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "6",
    "Text": "The Prophet is closer to the believers than their own selves and\\n\\t\\t\\this wives are as their mothers. Blood relatives have a greater\\n\\t\\t\\tclaim on one another than the other believers and the Muhajirin\\n\\t\\t\\t(early Muslims who migrated from Makkah to Madinah) according to\\n\\t\\t\\tthe Book of Allah: although you are permitted to some good\\n\\t\\t\\t(through leaving bequests) for your friends . This has been\\n\\t\\t\\twritten in the Book of Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "7",
    "Text": "O Muhammad, remember the Covenant which We took from all the\\n\\t\\t\\tProphets - from you as well as from Nuh, Ibrahim, Musa and Isa\\n\\t\\t\\t(Jesus) son of Maryam - We took that solemn Covenant from all of\\n\\t\\t\\tthem,"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "8",
    "Text": "so that He may question the truthful concerning the Truth (that\\n\\t\\t\\tthey were entrusted with): as for the unbelievers, He has\\n\\t\\t\\tprepared a painful punishment."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "9",
    "Text": "O believers! Remember the favor of Allah, which he bestowed on\\n\\t\\t\\tyou, when you were attacked by your enemy's army (during the\\n\\t\\t\\tbattle of Trench/Confederates) and We unleashed against them\\n\\t\\t\\tviolent winds and invisible forces. Allah saw all that you were\\n\\t\\t\\tdoing."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "10",
    "Text": "When the enemy attacked you from above and from below; when your\\n\\t\\t\\teyes were petrified due to fear and your hearts leaped up to your\\n\\t\\t\\tthroats, and you began to entertain all sorts of doubts about\\n\\t\\t\\tAllah,"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "11",
    "Text": "there, the believers were put to test; and were shaken with\\n\\t\\t\\ttremendous shaking."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "12",
    "Text": "Remember, when the hypocrites and those in whose hearts there was\\n\\t\\t\\ta disease were openly saying: \"Allah and His Rasool promised us\\n\\t\\t\\tnothing but delusion!\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "13",
    "Text": "And a party of them said: \"O people of Yathrib (Madinah)! You\\n\\t\\t\\tcannot stand the attack much longer. Go back to your city\". And\\n\\t\\t\\tyet another party of them sought leave of the Prophet saying: \"In\\n\\t\\t\\tfact our houses are insecure,\" whereas they were not insecure.\\n\\t\\t\\tThey intended nothing but to run away from the battlefront."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "14",
    "Text": "Had the city been entered from all sides, and had they been\\n\\t\\t\\tincited to sedition, they would have little hesitation to become\\n\\t\\t\\tpartners in it."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "15",
    "Text": "Even though they had made covenant with Allah not to show their\\n\\t\\t\\tbacks, and the covenant with Allah must surely be answered for."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "16",
    "Text": "Tell them: \"Running away will not do you any good, and if you are\\n\\t\\t\\trunning away from death or being killed, you would enjoy this\\n\\t\\t\\tlife only a little while.\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "17",
    "Text": "Ask them: \"Who can protect you from Allah if He intends to harm\\n\\t\\t\\tyou or who can prevent Him if He intends to show you mercy?\" They\\n\\t\\t\\twill find none besides Allah to protect or help them."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "18",
    "Text": "Allah is well aware of those among you who hold others back and\\n\\t\\t\\tthose who say to their brethren: \"Join us,\" and seldom take part\\n\\t\\t\\tin the fighting themselves."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "19",
    "Text": "They are ever reluctant to assist you. Whenever they are in\\n\\t\\t\\tdanger, they look towards you with their eyes rolling as though\\n\\t\\t\\tthey were at the point of death, but when they are out of danger,\\n\\t\\t\\tthey will come to greet you with their sharp tongues in greed for\\n\\t\\t\\tgain. Such people have no faith. Allah has made all their deeds\\n\\t\\t\\tnull and void, and this is easy for Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "20",
    "Text": "They thought that the confederates would never withdraw. Indeed,\\n\\t\\t\\tif the confederates should come again, they would wish to be\\n\\t\\t\\tamong the beduins and seek news about you from a safe distance;\\n\\t\\t\\tand if they happened to be with you, they would take but a little\\n\\t\\t\\tpart in the fighting."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "21",
    "Text": "You have indeed, in the life of Rasool-Allah, the 'Best Model'\\n\\t\\t\\tfor him whose hope is in Allah and the Day of the Hereafter, and\\n\\t\\t\\twho engages himself much in the remembrance of Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "22",
    "Text": "When the true believers saw the confederate forces they said:\\n\\t\\t\\t\"This is what Allah and His Rasool had promised us: Allah and his\\n\\t\\t\\tRasool were absolutely true.\" This increased them all the more in\\n\\t\\t\\ttheir faith and their zeal in obedience."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "23",
    "Text": "Among the believers there are men who have been true to their\\n\\t\\t\\tcovenant with Allah: of them some have completed their vow\\n\\t\\t\\tthrough sacrificing their lives, and some others are waiting for\\n\\t\\t\\tit, and have not changed their determination in the least."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "24",
    "Text": "All this happens so that Allah may reward the truthful for their\\n\\t\\t\\ttruth and punish the hypocrites or accept their repentance if He\\n\\t\\t\\twills: for Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "25",
    "Text": "Allah turned back the unbelievers; they retreated in their rage\\n\\t\\t\\twithout gaining any advantage, and Allah was sufficient to fight\\n\\t\\t\\ton behalf of the believers; for Allah is All-Powerful,\\n\\t\\t\\tAll-Mighty."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "26",
    "Text": "And brought down, from their fortresses, those people of the Book\\n\\t\\t\\t(The Jews of Bani Qurayzah) who supported the invaders, and cast\\n\\t\\t\\tterror into their hearts. As a result, some of them you slew and\\n\\t\\t\\tsome you took as prisoners."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "27",
    "Text": "Thus He made you heirs of their lands, their houses and their\\n\\t\\t\\tgoods, and also the land (Khayber) on which you had never set\\n\\t\\t\\tyour foot before. Truly, Allah has power over all things."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "28",
    "Text": "O Prophet! Say to your wives: \"If you desire the life of this\\n\\t\\t\\tworld and its glitter, then come, I shall give you of these and\\n\\t\\t\\tlet you go in an honorable way.\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "29",
    "Text": "But if you seek Allah and His Rasool and the home of the\\n\\t\\t\\thereafter, then you should rest assured that Allah has prepared a\\n\\t\\t\\tgreat reward for those of you who are good."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "30",
    "Text": "O wives of the Prophet! If any of you were guilty of open\\n\\t\\t\\tindecency, her punishment will be increased to double and this is\\n\\t\\t\\teasy for Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "31",
    "Text": "JUZ (PART): 22\\t  Those of you (O wives of the Prophet Muhammad)\\n\\t\\t\\twho obey Allah and His Rasool and practice righteousness, shall\\n\\t\\t\\tbe granted double reward, and for them We have prepared a\\n\\t\\t\\tgenerous provision."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "32",
    "Text": "O wives of the Prophet! You are not like the other women: if you\\n\\t\\t\\tfear Allah, then you should not be complaisant while talking to\\n\\t\\t\\tthe men who are not closely related to you, lest the one in whose\\n\\t\\t\\theart is a disease may thereby be encouraged, and speak using\\n\\t\\t\\tsuitable good words."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "33",
    "Text": "Stay in your homes and do not display your finery as women used\\n\\t\\t\\tto do in the days of ignorance (pre-Islamic days); establish\\n\\t\\t\\tSalah, pay Zakah, and obey Allah and His Rasool. O women of the\\n\\t\\t\\thousehold of Rasool, Allah only intends to remove uncleanliness\\n\\t\\t\\tfrom you and to purify you completely."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "34",
    "Text": "Remember the revelations of Allah and wise sayings which are\\n\\t\\t\\trecited in your homes, surely Allah is aware of even the finest\\n\\t\\t\\tmysteries."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "35",
    "Text": "Surely the Muslim men and the Muslim women, the believing men and\\n\\t\\t\\tthe believing women, the devout men and the devout women, the\\n\\t\\t\\ttruthful men and the truthful women, the patient men and the\\n\\t\\t\\tpatient women, the humble men and humble women, the charitable\\n\\t\\t\\tmen and the charitable women, the fasting men and the fasting\\n\\t\\t\\twomen, the men who guard their chastity and the women who guard\\n\\t\\t\\ttheir chastity, and the men who remember Allah much and the women\\n\\t\\t\\twho remember Allah much - for all those, Allah has prepared\\n\\t\\t\\tforgiveness and a great reward."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "36",
    "Text": "It is not fitting for a believing man or a believing woman to\\n\\t\\t\\thave an option in their affairs when a matter has been decided by\\n\\t\\t\\tAllah and His Rasool; and whoever disobeys Allah and His Rasool\\n\\t\\t\\thas indeed strayed into a clearly wrong path."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "Text": "O Prophet, remember when you said to the one (Zaid, Prophet's\\n\\t\\t\\tadopted son) whom Allah as well as you had favored: \"Keep your\\n\\t\\t\\twife in wedlock and fear Allah\". You sought to hide in your heart\\n\\t\\t\\twhat Allah intended to reveal; you were afraid of the people\\n\\t\\t\\twhereas it would have been more appropriate to fear Allah. So\\n\\t\\t\\twhen Zaid divorced his wife, We gave her to you in marriage, so\\n\\t\\t\\tthat there remains no hindrance for the believers to wed the\\n\\t\\t\\twives of their adopted sons if they divorced them. And Allah's\\n\\t\\t\\tCommand had to be carried out."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "38",
    "Text": "There can be no blame attached to the Prophet for doing what is\\n\\t\\t\\tsanctioned for him by Allah. Such has been the way of Allah with\\n\\t\\t\\tthose who have gone before; and the decrees of Allah are\\n\\t\\t\\tpreordained."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "39",
    "Text": "Those who are charged with the mission of conveying the message\\n\\t\\t\\tof Allah are to fear Him, they are supposed to fear none but\\n\\t\\t\\tAllah; for Allah is sufficient to settle their account."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "40",
    "Text": "Muhammad is not the father of any of your men (he is not going to\\n\\t\\t\\tleave any male heirs). He is the Rasool of Allah and the Seal of\\n\\t\\t\\tthe Prophets. Allah has the knowledge of all things."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "41",
    "Text": "O believers! Remember Allah as a frequent remembrance,"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "42",
    "Text": "and glorify Him morning and evening."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "43",
    "Text": "It is He Who sends His blessings on you (believers) and so do His\\n\\t\\t\\tangels, that He may bring you out of darkness into light, for He\\n\\t\\t\\tis Merciful to the believers."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "44",
    "Text": "On the Day of their meeting with Him, their greeting shall be:\\n\\t\\t\\t\"Salaam (peace)!\": and He has prepared for them a generous\\n\\t\\t\\treward."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "45",
    "Text": "O Prophet! Surely We have sent you as a witness, as a bearer of\\n\\t\\t\\tgood news and as a Warner,"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "46",
    "Text": "and to call the people towards Allah by His leave and a lamp\\n\\t\\t\\tspreading light (guidance)."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "47",
    "Text": "Give good news to the believers that they shall have great\\n\\t\\t\\tblessings from Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "48",
    "Text": "Do not obey the unbelievers and the hypocrites, disregard their\\n\\t\\t\\tannoyances and put your trust in Allah; for Allah is sufficient\\n\\t\\t\\tas a disposer of affairs."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "49",
    "Text": "O believers! If you marry believing women and divorce them before\\n\\t\\t\\tthe marriage is consummated, you are not required to observe the\\n\\t\\t\\tIddat (waiting period) which you should count for them, so give\\n\\t\\t\\tthem some present and relieve them gracefully."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "Text": "O Prophet! We have made lawful to you the wives to whom you have\\n\\t\\t\\tgiven their dowers; and those ladies whom your right hands\\n\\t\\t\\tpossess (from the prisoners of war) whom Allah has assigned to\\n\\t\\t\\tyou; and the daughters of your paternal uncles and aunts, and the\\n\\t\\t\\tdaughters of your maternal uncles and aunts, who have migrated\\n\\t\\t\\twith you; and the believing woman who gave herself to the Prophet\\n\\t\\t\\tif the Prophet desires to marry her - this permission is only for\\n\\t\\t\\tyou and not for the other believers; We know what restrictions We\\n\\t\\t\\thave imposed on the other believers concerning their wives and\\n\\t\\t\\tthose whom their right hands possess. We have granted you this\\n\\t\\t\\tprivilege as an exception so that no blame may be attached to\\n\\t\\t\\tyou. Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "51",
    "Text": "You may put off any of your wives you please and take to your bed\\n\\t\\t\\tany of them you please, and there is no blame on you if you call\\n\\t\\t\\tback any of them you had temporarily set aside. This is most\\n\\t\\t\\tproper, so that their eyes may be cooled and they may not grieve,\\n\\t\\t\\tand that they will remain satisfied with what you give them. O\\n\\t\\t\\tbelievers! Allah knows all that is in your hearts; for Allah is\\n\\t\\t\\tAll-Knowing, Most Forbearing."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "52",
    "Text": "It shall be unlawful for you, O Muhammad, to marry more women\\n\\t\\t\\tafter this or to change your present wives with other women,\\n\\t\\t\\tthough their beauty may be pleasing to you, however those ladies\\n\\t\\t\\twhom your right hand possess are an exception. Allah takes\\n\\t\\t\\tcognizance of all things."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "53",
    "Text": "O believers! Do not enter the houses of the Prophet without\\n\\t\\t\\tpermission, nor stay waiting for meal time: but if you are\\n\\t\\t\\tinvited to a meal, enter, and when you have eaten disperse and do\\n\\t\\t\\tnot seek long conversation. Such behavior annoys the Prophet, he\\n\\t\\t\\tfeels shy in asking you to leave, but Allah does not feel shy in\\n\\t\\t\\ttelling the truth. If you have to ask his wives for anything,\\n\\t\\t\\tspeak to them from behind a curtain. This is more chaste for your\\n\\t\\t\\thearts and for theirs. It is not proper for you to annoy the\\n\\t\\t\\tRasool of Allah, nor ever to marry his wives after him; this\\n\\t\\t\\twould be a grievous offence in the sight of Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "54",
    "Text": "Whether you reveal anything or conceal it, surely Allah has full\\n\\t\\t\\tknowledge of all things."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "55",
    "Text": "There is no blame on the ladies if they appear before their\\n\\t\\t\\tfathers, their sons, their brothers, their brothers' sons, their\\n\\t\\t\\tsisters' sons, their familiar women and those whom their right\\n\\t\\t\\thands possess (slaves). O Ladies! Have fear of Allah: for Allah\\n\\t\\t\\tis a witness to all things."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "56",
    "Text": "Indeed Allah and His angels send blessings on the Prophet. O\\n\\t\\t\\tbelievers, call for Allah's blessings on him and salute him with\\n\\t\\t\\tall respect."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "57",
    "Text": "Surely those who annoy Allah and His Rasool, are cursed by Allah\\n\\t\\t\\tin this world and in the hereafter. He has prepared for them a\\n\\t\\t\\thumiliating punishment."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "58",
    "Text": "And those who annoy believing men and believing women, for no\\n\\t\\t\\tfault of theirs, shall bear the guilt of slander and an evident\\n\\t\\t\\tsin."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "59",
    "Text": "O Prophet! Enjoin your wives, daughters and the believing women\\n\\t\\t\\tthat they should draw their outer garments over their persons.\\n\\t\\t\\tThat is more proper, so that they may be recognized and not\\n\\t\\t\\tbothered. Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "60",
    "Text": "If the hypocrites, those in whose hearts is malice and the\\n\\t\\t\\tscandal mongers of Madinah do not desist; We shall rouse you\\n\\t\\t\\tagainst them, and their days in the city - as your neighbors -\\n\\t\\t\\twill be numbered."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "61",
    "Text": "They shall be cursed wherever they are found and they shall be\\n\\t\\t\\tseized and killed mercilessly."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "62",
    "Text": "This has been the Way of Allah regarding such people among those\\n\\t\\t\\twho lived before you, and you will never find any change in the\\n\\t\\t\\tWay of Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "63",
    "Text": "People ask you about the Hour of Doom. Tell them: \"Allah Alone\\n\\t\\t\\thas the knowledge of it. Who knows? It may be that the Hour is\\n\\t\\t\\tnear at hand.\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "64",
    "Text": "Surely Allah has laid a curse on the unbelievers and has prepared\\n\\t\\t\\tfor them a blazing fire;"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "65",
    "Text": "to live therein forever and they shall find no protector or\\n\\t\\t\\thelper."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "66",
    "Text": "That Day, when their faces will roll about in the fire, they will\\n\\t\\t\\tsay: \"Woe to us! Would that we had obeyed Allah and obeyed the\\n\\t\\t\\tRasool.\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "67",
    "Text": "They will further say: \"Our Rabb! We obeyed our chiefs and our\\n\\t\\t\\tgreat ones and they misled us from the Right Way."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "68",
    "Text": "Our Rabb! Give them double punishment and lay on them a mighty\\n\\t\\t\\tcurse.\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "69",
    "Text": "O believers! Be not like those who slandered Musa, but Allah\\n\\t\\t\\tcleared him of what they said - for he was honorable in the sight\\n\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "70",
    "Text": "O believers! Fear Allah and always say the right thing;"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "71",
    "Text": "He will bless your works and forgive your sins - for he that\\n\\t\\t\\tobeys Allah and His Rasool, has indeed achieved the highest\\n\\t\\t\\tachievement."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "72",
    "Text": "The fact is that We offered the Trust ( \"freedom of choice\" and\\n\\t\\t\\tto voluntarily use this option according to the will of Allah) to\\n\\t\\t\\tthe heavens, to the earth and to the mountains, but they refused\\n\\t\\t\\tto undertake it and were afraid, but man undertook it. He was\\n\\t\\t\\tindeed unjust and foolish."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "73",
    "Text": "(The inevitable result of bearing the burden of Allah's Trust is)\\n\\t\\t\\tthat Allah will punish the hypocrite men, the hypocrite women,\\n\\t\\t\\tthe mushrik men and the mushrik women, and that Allah will turn\\n\\t\\t\\tin mercy to the believing men and the believing women: for Allah\\n\\t\\t\\tis Forgiving, Merciful."
  }
]
