[
  {
    "SurahNumber": "62",
    "AyahNumber": "1",
    "NoteID": "5449",
    "Body": "See n. 5408 to lix. 24, where I have explained the\\n\\t\\t\\t\\tdifference in signification between sabbaha and\\n\\t\\t\\t\\tyusabbihu. The latter form is used here, to express an\\n\\t\\t\\t\\tactual fact. 'Everything declares the Praises and Glory\\n\\t\\t\\t\\tof Allah, because Allah's mercies extend to all Ms\\n\\t\\t\\t\\tcreatures: He sends His Revelation for the benefit of the\\n\\t\\t\\t\\tignorant and unlettered as well as for those who have\\n\\t\\t\\t\\tlearning in their midst, especially as the latter are\\n\\t\\t\\t\\tapt, by the very weight of their ponderous learning, to\\n\\t\\t\\t\\tmiss the real point and spirit of Allah's Message.'"
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "1",
    "NoteID": "5450",
    "Body": "See fix. 23, and n. 5402. Here we have two of the divine\\n\\t\\t\\t\\tattributes repeated from lix. 23 and two from the end of\\n\\t\\t\\t\\tlix. 24, implying a reminiscence of all the beautiful\\n\\t\\t\\t\\tdivine attributes mentioned in that passage."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "2",
    "NoteID": "5451",
    "Body": "The Unlettered: as applied to a people, it refers to the\\n\\t\\t\\t\\tArabs, in comparison with the People of the Book, who had\\n\\t\\t\\t\\ta longer tradition of learning, but whose failure is\\n\\t\\t\\t\\treferred to in verse 5 below. As applied to individuals,\\n\\t\\t\\t\\tit means that Allah's Revelation is for the benefit of\\n\\t\\t\\t\\tall men, whether they have worldly learning or not."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "2",
    "NoteID": "5452",
    "Body": "His Signs: Allah's wonderful Signs in His Creation and in\\n\\t\\t\\t\\tHis ordering of the world. It may include the Verses of\\n\\t\\t\\t\\tthe Qur-an, but they are more specifically referred to as\\n\\t\\t\\t\\t\"Book\" in the next line but one."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "2",
    "NoteID": "5453",
    "Body": "Cf. ii. 129, and n. 129. Read again the attributes in the\\n\\t\\t\\t\\tlast verse. Allah is full Sovereign, and therefore cares\\n\\t\\t\\t\\tfor all His subjects, including the meanest and most\\n\\t\\t\\t\\tignorant, and sends His prophets or messengers to them.\\n\\t\\t\\t\\tHe is the Holy One, and therefore purifies and sanctifies\\n\\t\\t\\t\\tthose who were steeped in superstition and wickedness. He\\n\\t\\t\\t\\tis Exalted in Power, and therefore He can confer all\\n\\t\\t\\t\\tthese blessings on the most unlikely people (verse 3),\\n\\t\\t\\t\\tand no one can stay His hand. He is wise, and therefore\\n\\t\\t\\t\\tHe instructs in wisdom, both through written Scriptures,\\n\\t\\t\\t\\tand in other ways, e.g., by means of a knowledge of life\\n\\t\\t\\t\\tand its laws, and an understanding of His wonderful\\n\\t\\t\\t\\tuniverse."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "2",
    "NoteID": "5454",
    "Body": "Previous ignorance or error is no bar to a person or\\n\\t\\t\\t\\tnation receiving the blessings of Allah's revelation,\\n\\t\\t\\t\\tprovided such person or nation has the will to come to\\n\\t\\t\\t\\tAllah and the capacity to bear His Message. For an\\n\\t\\t\\t\\tinstance of incapacity through arrogance, see verse 6\\n\\t\\t\\t\\tbelow."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "3",
    "NoteID": "5455",
    "Body": "Others of them: i.e., others than those among whom the\\n\\t\\t\\t\\tholy Prophet came as a messenger. In other words his\\n\\t\\t\\t\\tMessage is for his Arab people and his non-Arab\\n\\t\\t\\t\\tcontemporaries as well as those who live in other ages,\\n\\t\\t\\t\\tand have no personal contact with him or his Companions."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "4",
    "NoteID": "5456",
    "Body": "That is, according to His wise Will and Plan, and also as\\n\\t\\t\\t\\ta result of His unbounded generosity to all."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "5",
    "NoteID": "5457",
    "Body": "The Children of Israel were chosen as special vehicles\\n\\t\\t\\t\\tfor Allah's Message early in history. When their\\n\\t\\t\\t\\tdescendants corrupted the Message and became guilty of\\n\\t\\t\\t\\tall the abominations against which prophets like Isaiah\\n\\t\\t\\t\\tinveighed with such zeal and fire, they merely became\\n\\t\\t\\t\\tlike beasts of burden that carry learning and wisdom on\\n\\t\\t\\t\\ttheir backs but do not understand or profit by it."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "6",
    "NoteID": "5458",
    "Body": "Of Jewry is a very different thing from following the Law\\n\\t\\t\\t\\tand Will of Allah. An arrogant claim to be a chosen\\n\\t\\t\\t\\tpeople, to be the exclusive possessors of divine\\n\\t\\t\\t\\tteaching, to be exempt from any punishment for breachcs\\n\\t\\t\\t\\tof the divine law, (cf. ii. 88), is presumptuous\\n\\t\\t\\t\\tblasphemy. It may be Judaism, but it is not in the spirit\\n\\t\\t\\t\\tof Moses."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "6",
    "NoteID": "5459",
    "Body": "Cf. ii. 94-96. If they claimed to be special friends of\\n\\t\\t\\t\\tAllah, why do they not eagerly desire death, which would\\n\\t\\t\\t\\tbring them nearer to Allah? But of all people they are\\n\\t\\t\\t\\tthe most tenacious of this life and the good things of\\n\\t\\t\\t\\tthis life! And they know that their grasping selfish\\n\\t\\t\\t\\tlives have run up a score of sin against them, which will\\n\\t\\t\\t\\tmeet its recompense."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "8",
    "NoteID": "5460",
    "Body": "Before Allah's Judgment-Seat, when Judgment is\\n\\t\\t\\t\\testablished, we shall see the full inwardness of all\\n\\t\\t\\t\\tdeeds in this world. The veil of illusion and delusion\\n\\t\\t\\t\\twill be torn off. All our secret motives will be laid\\n\\t\\t\\t\\tbare. The results of all our little plots and plans and\\n\\t\\t\\t\\ttheir reactions on our eternal welfare will be clearly\\n\\t\\t\\t\\tvisible to us. All make-believe will disappear."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "9",
    "NoteID": "5461",
    "Body": "Friday, is primarily the Day of Assembly, the weekly\\n\\t\\t\\t\\tmeeting of the Congregation, when we show our unity by\\n\\t\\t\\t\\tsharing in common public worship, preceded by a Khutba,\\n\\t\\t\\t\\tin which the Imam (or Leader) reviews the week's fife of\\n\\t\\t\\t\\tthe Community and offers advice and exhortation on good\\n\\t\\t\\t\\tliving. Notice the gradations of social contact for\\n\\t\\t\\t\\tMuslims if they followed the wise ordinances of their\\n\\t\\t\\t\\tFaith. (1) Each individual remembers Allah for himself or\\n\\t\\t\\t\\therself five or more times every day in the home or place\\n\\t\\t\\t\\tof business, or local mosque, or open air, as the case\\n\\t\\t\\t\\tmay be. (2) On Friday in every week there is a local\\n\\t\\t\\t\\tmeeting in the central mosque of each local centre,-it\\n\\t\\t\\t\\tmay be a village, or town, or ward of a big city. (3) At\\n\\t\\t\\t\\tthe two 'Ids every year, there is a large local area\\n\\t\\t\\t\\tmeeting in one centre. (4) Once at least in a lifetime,\\n\\t\\t\\t\\twhere possible, a Muslim shares in the vast international\\n\\t\\t\\t\\tassemblage of the world, in the centre of Islam, at the\\n\\t\\t\\t\\tMakkan Pilgrimage. A happy combination of\\n\\t\\t\\t\\tdecentralisation and centralisation, of individual\\n\\t\\t\\t\\tliberty and collective meeting, and contact at various\\n\\t\\t\\t\\tstages or grades. The mechanical part of this ordinance\\n\\t\\t\\t\\tis easy to carry out. Are we carrying out the more\\n\\t\\t\\t\\tdifficult part?-the spirit of unity, brotherhood, mutual\\n\\t\\t\\t\\tconsultation, and collective understanding and action?"
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "9",
    "NoteID": "5462",
    "Body": "The idea behind the Muslim weekly \"Day of Assembly\" is\\n\\t\\t\\t\\tdifferent from that behind the Jewish Sabbath (Saturday)\\n\\t\\t\\t\\tor the Christian Sunday. The Jewish Sabbath is primarily\\n\\t\\t\\t\\ta commemoration of Allah's ending His work and resting on\\n\\t\\t\\t\\tthe seventh day (Gen. ii. 2; Exod. xx. 11): we are taught\\n\\t\\t\\t\\tthat Allah needs no rest, nor does He feel fatigue (ii.\\n\\t\\t\\t\\t255). The Jewish command forbids work on that day but\\n\\t\\t\\t\\tsays nothing about worship or prayer (Exod. xx. 10); our\\n\\t\\t\\t\\tordinance lays chief stress on the remembrance of Allah.\\n\\t\\t\\t\\tJewish formalism went so far as to kill the spirit of the\\n\\t\\t\\t\\tsabbath, and call forth the protest of Jesus: \"the\\n\\t\\t\\t\\tsabbath was made for man, and not man for the sabbath\"\\n\\t\\t\\t\\t(Mark. ii. 27). But the Christian Church, although it has\\n\\t\\t\\t\\tchanged the day from Saturday to Sunday, has inherited\\n\\t\\t\\t\\tthe Jewish spirit: witness the Scottish Sabbath; except\\n\\t\\t\\t\\tin so far as it has been secularised. Our teaching says:\\n\\t\\t\\t\\t'When the time for Jumua Prayer comes, close your\\n\\t\\t\\t\\tbusiness and answer the summons loyally and earnestly,\\n\\t\\t\\t\\tmeet earnestly, pray, consult and learn by social\\n\\t\\t\\t\\tcontact; when the meeting is over, scatter and go about\\n\\t\\t\\t\\tyour business'."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "9",
    "NoteID": "5463",
    "Body": "The immediate and temporal worldly gain may be the\\n\\t\\t\\t\\tultimate and spiritual loss, and vice versa."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "10",
    "NoteID": "5464",
    "Body": "Prosperity is not to be measured by wealth or worldly\\n\\t\\t\\t\\tgains. There is a higher prosperity,-the health of the\\n\\t\\t\\t\\tmind and the spirit."
  },
  {
    "SurahNumber": "62",
    "AyahNumber": "11",
    "NoteID": "5465",
    "Body": "Do not be distracted by the craze for amusement or gain.\\n\\t\\t\\t\\tIf you lead a righteous and sober life, Allah will\\n\\t\\t\\t\\tprovide for you in all senses, better than any provision\\n\\t\\t\\t\\tyou can possibly think of."
  }
]
