[
  {
    "SurahNumber": "23",
    "AyahNumber": "4",
    "NoteID": "1",
    "Body": "Lit., \"working for\" or \"active in behalf of [inner]\\n\\t\\t\\t\\tpurity\", which is the meaning of zakah in this context\\n\\t\\t\\t\\t(Zamakhshari; the same interpretation has been advanced\\n\\t\\t\\t\\tby Abu Muslim)."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "5",
    "NoteID": "2",
    "Body": "Lit., \"who guard their private parts\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "6",
    "NoteID": "3",
    "Body": "Lit., \"or those whom their right hands possess\" (aw ma\\n\\t\\t\\t\\tmalakat aymanuhum). Most of the commentators assume\\n\\t\\t\\t\\tunquestioningly that this relates to female slaves, and\\n\\t\\t\\t\\tthat the particle aw (\"or\") denotes a permissible\\n\\t\\t\\t\\talternative. This conventional interpretation is, in my\\n\\t\\t\\t\\topinion inadmissible inasmuch as it is based on the\\n\\t\\t\\t\\tassumption that sexual intercourse with one's female\\n\\t\\t\\t\\tslave is permitted without marriage: an assumption which\\n\\t\\t\\t\\tis contradicted by the Qur'an itself (see  4:3 , {24},\\n\\t\\t\\t\\t{25} and  24:32 , with the corresponding notes). Nor is\\n\\t\\t\\t\\tthis the only objection to the above-mentioned\\n\\t\\t\\t\\tinterpretation. Since the Qur'an applies the term\\n\\t\\t\\t\\t\"believers\" to men and women alike, and since the term\\n\\t\\t\\t\\tazwaj (\"spouses\"), too, denotes both the male and the\\n\\t\\t\\t\\tfemale partners in marriage, there is no reason for\\n\\t\\t\\t\\tattributing to the phrase aw ma malakat aymanuhum the\\n\\t\\t\\t\\tmeaning of \"their female slaves\"; and since, on the other\\n\\t\\t\\t\\thand, it is out of the question that female and male\\n\\t\\t\\t\\tslaves could have been referred to here, it is obvious\\n\\t\\t\\t\\tthat this phrase does not relate to slaves at all, but\\n\\t\\t\\t\\thas the same meaning as in  4:24 - namely, \"those whom\\n\\t\\t\\t\\tthey rightfully possess through wedlock\" (see note [26]\\n\\t\\t\\t\\ton  4:24 ) - with the significant difference that in the\\n\\t\\t\\t\\tpresent context this expression relates to both husbands\\n\\t\\t\\t\\tand wives, who \"rightfully possess\" one another by virtue\\n\\t\\t\\t\\tof marriage. On the basis of this interpretation, the\\n\\t\\t\\t\\tparticle aw which precedes this clause does not denote an\\n\\t\\t\\t\\talternative (\"or\") but is, rather, in the nature of an\\n\\t\\t\\t\\texplanatory amplification, more or less analgous to the\\n\\t\\t\\t\\tphrase \"in other words\" or \"that is\", thus giving to the\\n\\t\\t\\t\\twhole sentence the meaning, \"...save with their spouses -\\n\\t\\t\\t\\tthat is, those whom they rightfully possess [through\\n\\t\\t\\t\\twedlock]...\", etc. (Cf. a similar construction 25:62 -\\n\\t\\t\\t\\t\"for him who has the will to take thought - that is\\n\\t\\t\\t\\t[lit., \"or\"], has the will to be grateful\".)"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "12",
    "NoteID": "4",
    "Body": "The frequent Qur'anic references to man's being \"created\\n\\t\\t\\t\\tout of clay\" or \"out of dust\" or (as in this instance)\\n\\t\\t\\t\\t\"out of the essence (sulalah) of clay\" point to the fact\\n\\t\\t\\t\\tthat his body is composed of various organic and\\n\\t\\t\\t\\tinorganic substances existing on or in the earth, as well\\n\\t\\t\\t\\tas to the continuous transmutation of those substances,\\n\\t\\t\\t\\tthrough the intake of earth-grown food, into reproductive\\n\\t\\t\\t\\tcells (Razi) - thus stressing man's humble origin, and\\n\\t\\t\\t\\thence the debt of gratitude which he owes to God for\\n\\t\\t\\t\\thaving endowed him with a conscious soul. The past tense\\n\\t\\t\\t\\tin verses {12-14} (lit., \"We have created\", \"We have\\n\\t\\t\\t\\tcaused him to remain\", etc.) emphasizes the fact that all\\n\\t\\t\\t\\tthis has been ordained by God and has been happening\\n\\t\\t\\t\\tagain and again ever since man was brought into being by\\n\\t\\t\\t\\tHim; in the above context, this recurrence is brought out\\n\\t\\t\\t\\tbest by the use of the present tense."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "14",
    "NoteID": "5",
    "Body": "Lit., \"as another creature\", i.e., existing independently\\n\\t\\t\\t\\tof the mother's body."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "14",
    "NoteID": "6",
    "Body": "Lit., \"the best of creators\". As Tabari points out, the\\n\\t\\t\\t\\tArabs apply the designation \"creator\" to every artisan\\n\\t\\t\\t\\t(sani') - a usage also current in European languages with\\n\\t\\t\\t\\treference to the \"creation\" of works of art and\\n\\t\\t\\t\\timagination. Since God is the only Creator in the real,\\n\\t\\t\\t\\tprimary sense of this word, the phrase ahsan al-khaliqin\\n\\t\\t\\t\\tmust be understood in this secondary sense of the term\\n\\t\\t\\t\\tkhaliq (cf. Taj al-'Arus, art. khalaqa)."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "17",
    "NoteID": "7",
    "Body": "Lit., \"seven paths\", which may signify the orbits of the\\n\\t\\t\\t\\tvisible planets or - as the classical commentators assume\\n\\t\\t\\t\\t- the \"seven heavens\" (i.e., cosmic systems) repeatedly\\n\\t\\t\\t\\tspoken of in the Qur'an. In either case, the number\\n\\t\\t\\t\\t\"seven\" is used metonymically, indicating multiplicity.\\n\\t\\t\\t\\tSee in this connection note [20] on  2:29 ."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "20",
    "NoteID": "8",
    "Body": "I.e., the olive-tree, native to the lands around the\\n\\t\\t\\t\\teastern Mediterranean, where so many pre-Qur'anic\\n\\t\\t\\t\\tprophets (here symbolized - because of its sacred\\n\\t\\t\\t\\tassociations - by Mount Sinai) lived and preached."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "21",
    "NoteID": "9",
    "Body": "Lit., \"of them\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "23",
    "NoteID": "10",
    "Body": "Sc., \"who had lost sight of all the multiform evidence of\\n\\t\\t\\t\\tthe Creator's uniqueness and, thus, all gratitude for the\\n\\t\\t\\t\\tinnumerable blessings which He bestows upon man\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "24",
    "NoteID": "11",
    "Body": "Lit., \"in connection with (fi) our early forebears\" - a\\n\\t\\t\\t\\tQur'anic allusion to the fact that people often reject a\\n\\t\\t\\t\\tnew ethical proposition on no better grounds than that it\\n\\t\\t\\t\\tconflicts with their \"inherited\" habits of thought and\\n\\t\\t\\t\\tways of life. Indirectly, this allusion implies a\\n\\t\\t\\t\\tcondemnation of all blind taqlid, i.e., an unthinking\\n\\t\\t\\t\\tacceptance of religious doctrines or assertions which are\\n\\t\\t\\t\\tnot unequivocally supported by divine revelation, the\\n\\t\\t\\t\\texplicit teachings of a prophet, or the evidence of\\n\\t\\t\\t\\tunprejudiced reason."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "27",
    "NoteID": "12",
    "Body": "I.e., \"under Our protection\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "27",
    "NoteID": "13",
    "Body": "Regarding this interpolation, see surah {11}, note [60].\\n\\t\\t\\t\\tFor an explanation of the passage that follows, see\\n\\t\\t\\t\\t 11:40  and the corresponding notes [62-64]. The reason\\n\\t\\t\\t\\tfor the (abbreviated) repetition of Noah's story - given\\n\\t\\t\\t\\tin much greater detail in {11:25-48}- becomes evident\\n\\t\\t\\t\\tfrom verse {29)."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "29",
    "NoteID": "14",
    "Body": "Lit., \"Cause me to alight with a blessed alighting\" -\\n\\t\\t\\t\\ti.e., in a blessed condition of alighting, or at a\\n\\t\\t\\t\\tblessed place of alighting (Tabari); both these meanings\\n\\t\\t\\t\\tare implied in the word \"destination\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "29",
    "NoteID": "15",
    "Body": "Lit., \"the best of all who cause [man] to alight\", i.e.,\\n\\t\\t\\t\\tat his true destination. In this prayer enjoined upon\\n\\t\\t\\t\\tNoah - and, by implication, on every believer - the story\\n\\t\\t\\t\\tof the ark is raised to symbolic significance: it reveals\\n\\t\\t\\t\\titself as a parable of the human soul's longing for\\n\\t\\t\\t\\tdivine illumination, which alone can show man how to save\\n\\t\\t\\t\\thimself and to reach his true destination in the realm of\\n\\t\\t\\t\\tthe spirit as well as in worldly life."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "31",
    "NoteID": "16",
    "Body": "Lit., \"a generation (-qarn) of others\". For a wider\\n\\t\\t\\t\\tmeaning of the term -qarn, see surah {6}, note [5]."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "32",
    "NoteID": "17",
    "Body": "Most of the classical commentators assume that the\\n\\t\\t\\t\\tapostle referred to in verses {32-41} is Hud, the prophet\\n\\t\\t\\t\\tof the tribe of 'Ad (see surah {7}, note [48]). Since,\\n\\t\\t\\t\\thowever, this passage contains elements appearing in the\\n\\t\\t\\t\\tstories of many prophets - including that of the Prophet\\n\\t\\t\\t\\tMuhammad - I am of the opinion that it has a general\\n\\t\\t\\t\\timport: namely, an allusion to all of God's apostles and\\n\\t\\t\\t\\tto the ever-recurring similarity of their experiences."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "33",
    "NoteID": "18",
    "Body": "Thus Tabari interprets the concise but meaningful phrase\\n\\t\\t\\t\\tatrafnahum fi'l-,hayati 'd-dunya. For a fuller\\n\\t\\t\\t\\texplanation of the verb tarifa, see note [147] on\\n\\t\\t\\t\\t 11:116 ."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "40",
    "NoteID": "19",
    "Body": "Lit., \"they will surely become of those who feel\\n\\t\\t\\t\\tremorse\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "41",
    "NoteID": "20",
    "Body": "The expression bi'l-haqq (lit., \"in accordance with\\n\\t\\t\\t\\ttruth\" or \"with justice\") combines in this instance the\\n\\t\\t\\t\\tconcepts of justice, wisdom, reality, inescapability, and\\n\\t\\t\\t\\tconsonance with the exigencies of the case under\\n\\t\\t\\t\\tconsideration (Raghib), and can be only approximately\\n\\t\\t\\t\\trendered in translation."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "42",
    "NoteID": "21",
    "Body": "Lit., \"generations of others\", i.e., new civilizations."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "43",
    "NoteID": "22",
    "Body": "See note [5] on the identical phrase in  15:5 ."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "46",
    "NoteID": "23",
    "Body": "Moses and Aaron are mentioned here by name because their\\n\\t\\t\\t\\tcase was different from that of all other prophets: they\\n\\t\\t\\t\\twere rejected not by their own community but by their\\n\\t\\t\\t\\tcommunity's oppressors."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "48",
    "NoteID": "24",
    "Body": "Lit., \"became of those who were destroyed\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "50",
    "NoteID": "25",
    "Body": "For my rendering of the ayah, in this instance, as\\n\\t\\t\\t\\t\"symbol\", see surah {19}, note [16].  Jesus and his\\n\\t\\t\\t\\tmother Mary are mentioned here specifically because they,\\n\\t\\t\\t\\ttoo, had to suffer persecution and slander at the hands\\n\\t\\t\\t\\tof \"those who were bent on denying the truth\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "50",
    "NoteID": "26",
    "Body": "I.e., in paradise. The expression ma'in signifies\\n\\t\\t\\t\\t\"unsullied springs\" or \"running waters\" (Ibn 'Abbas, as\\n\\t\\t\\t\\tquoted by Tabari; also Lisan al-'Arab and Taj al-'Arus),\\n\\t\\t\\t\\tand thus symbolizes the spiritual purity associated with\\n\\t\\t\\t\\tthe concept of paradise, the \"gardens through which\\n\\t\\t\\t\\trunning waters flow\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "51",
    "NoteID": "27",
    "Body": "This rhetorical apostrophe to all of God's apostles is\\n\\t\\t\\t\\tmeant to stress their humanness and mortality, and thus\\n\\t\\t\\t\\tto refute the argument of the unbelievers that God could\\n\\t\\t\\t\\tnot have chosen \"a mortal like ourselves\" to be His\\n\\t\\t\\t\\tmessage-bearer: an argument which overlooks the fact that\\n\\t\\t\\t\\tonly human beings who themselves \"partake of the good\\n\\t\\t\\t\\tthings of life\" are able to understand the needs and\\n\\t\\t\\t\\tmotives of their fellow-men and, thus, to guide them in\\n\\t\\t\\t\\ttheir spiritual and social concerns."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "52",
    "NoteID": "28",
    "Body": "As in  21:92 , the above verse is addressed to all who\\n\\t\\t\\t\\ttruly believe in God, whatever their historical\\n\\t\\t\\t\\tdenomination. By the preceding reference to all of God's\\n\\t\\t\\t\\tapostles the Qur'an clearly implies that all of them were\\n\\t\\t\\t\\tinspired by, and preached, the same fundamental truths,\\n\\t\\t\\t\\tnotwithstanding all the differences in the ritual or the\\n\\t\\t\\t\\tspecific laws which they propounded in accordance with\\n\\t\\t\\t\\tthe exigencies of the time and the social development of\\n\\t\\t\\t\\ttheir followers. (See notes [66-68] on the second\\n\\t\\t\\t\\tparagraph of  5:48 .)"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "53",
    "NoteID": "29",
    "Body": "Cf.  21:93 ."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "53",
    "NoteID": "30",
    "Body": "Lit.; \"in what they have [themselves]\". In the first\\n\\t\\t\\t\\tinstance, this verse refers to the various religious\\n\\t\\t\\t\\tgroups as such: that is to say, to the followers of one\\n\\t\\t\\t\\tor another of the earlier revelations who, in the course\\n\\t\\t\\t\\tof time, consolidated themselves within different\\n\\t\\t\\t\\t\"denominations\", each of them jealously guarding its own\\n\\t\\t\\t\\tset of tenets, dogmas and rituals and intensely\\n\\t\\t\\t\\tintolerant of all other ways of worship (manasik, see\\n\\t\\t\\t\\t 22:67 ). In the second instance, however, the above\\n\\t\\t\\t\\tcondemnation applies to the breach of unity within each\\n\\t\\t\\t\\tof the established religious groups; and since it applies\\n\\t\\t\\t\\tto the followers of all the prophets, it includes the\\n\\t\\t\\t\\tlatter-day followers of Muhammad as well, and thus\\n\\t\\t\\t\\tconstitutes a prediction and condemnation of the\\n\\t\\t\\t\\tdoctrinal disunity prevailing in the world of Islam in\\n\\t\\t\\t\\tour times -cf. the well-authenticated saying of the\\n\\t\\t\\t\\tProphet quoted by Ibn Hanbal, Abu Da'ud, Tirmidhi, and\\n\\t\\t\\t\\tDarimi: \"The Jews have been split up into seventy-one\\n\\t\\t\\t\\tsects, the Christians into seventy-two sects, whereas my\\n\\t\\t\\t\\tcommunity will be split up into seventy-three sects.\" (It\\n\\t\\t\\t\\tshould be remembered that in classical Arabic usage the\\n\\t\\t\\t\\tnumber \"seventy\" often stands for \"many\" - just as\\n\\t\\t\\t\\t\"seven\" stands for \"several\" or \"various\" - and does not\\n\\t\\t\\t\\tnecessarily denote an actual figure; hence, what the\\n\\t\\t\\t\\tProphet meant to say was that the sects and divisions\\n\\t\\t\\t\\tamong the Muslims of later days would become many, and\\n\\t\\t\\t\\teven more numerous than those among the Jews and the\\n\\t\\t\\t\\tChristians."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "54",
    "NoteID": "31",
    "Body": "I.e., until they themselves realize their error. This\\n\\t\\t\\t\\tsentence is evidently addressed to the last of the\\n\\t\\t\\t\\tapostles, Muhammad, and thus to all who truly follow him."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "56",
    "NoteID": "32",
    "Body": "I.e., \"Do they think that by bestowing on them worldly\\n\\t\\t\\t\\tprosperity God but wants them to vie with one another in\\n\\t\\t\\t\\ttheir race after material goods and comforts, which they\\n\\t\\t\\t\\tmistakenly identify with 'doing good works'?\" Another -\\n\\t\\t\\t\\tlinguistically permissible - rendering of the above two\\n\\t\\t\\t\\tverses would be: \"Do they think that by all the wealth\\n\\t\\t\\t\\tand offspring with which We provide them We [but] hasten\\n\\t\\t\\t\\ton [the coming] to them of all that is good?\" Either of\\n\\t\\t\\t\\tthese two renderings implies, firstly, that worldly\\n\\t\\t\\t\\tprosperity is not the ultimate good, and, secondly, that\\n\\t\\t\\t\\tthe breach of the unity spoken of in the preceding\\n\\t\\t\\t\\tpassage was, more often than not, an outcome of mere\\n\\t\\t\\t\\tworldly greed and of factional striving after power."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "60",
    "NoteID": "33",
    "Body": "This is an allusion to the giving of what one is morally\\n\\t\\t\\t\\tobliged to give, whether it be in charity or in\\n\\t\\t\\t\\tsatisfaction of rightful claims on the part of one's\\n\\t\\t\\t\\tfellow-men, including such intangible \"gifts\" as the\\n\\t\\t\\t\\tdispensing of justice."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "63",
    "NoteID": "34",
    "Body": "This passage obviously connects with the last sentence of\\n\\t\\t\\t\\tverse {56} - \"Nay, but they do not perceive [their\\n\\t\\t\\t\\terror!''-and. hence, refers to the people spoken of in\\n\\t\\t\\t\\tverse {54} as being \"lost in their ignorance\" (fi\\n\\t\\t\\t\\tghamratihim )."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "63",
    "NoteID": "35",
    "Body": "Namely, actions and dogmatic assertions which utterly\\n\\t\\t\\t\\tcontradict the teachings of the very apostles whom they\\n\\t\\t\\t\\tclaim to follow, like ascribing divine qualities to\\n\\t\\t\\t\\tbeings other than God, worshipping saints, or rejecting\\n\\t\\t\\t\\tdivine revelations which do not accord with their own\\n\\t\\t\\t\\tlikes and dislikes or with their customary mode of\\n\\t\\t\\t\\tthinking."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "64",
    "NoteID": "36",
    "Body": "See surah {17}, note [22]. The particular reference, in\\n\\t\\t\\t\\tthis context, to people \"who [at present] are lost in the\\n\\t\\t\\t\\tpursuit of pleasures\" contains an allusion to verse {55}\\n\\t\\t\\t\\tabove (see my explanation in note [32], especially the\\n\\t\\t\\t\\tlast sentence). The \"taking to task through suffering\"\\n\\t\\t\\t\\tspoken of here may refer to the Day of Judgment or - as\\n\\t\\t\\t\\tin  17:16  - to the inevitable social ruin which, in the\\n\\t\\t\\t\\tlong run, wrong beliefs and actions bring with themselves\\n\\t\\t\\t\\tin this world."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "66",
    "NoteID": "37",
    "Body": "This is the meaning implied in the auxiliary verb kanat.\\n\\t\\t\\t\\tpreceded by the particle qad."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "67",
    "NoteID": "38",
    "Body": "Lit., \"as one who keeps awake at night\" (samiran). In\\n\\t\\t\\t\\tcombination with the phrase kuntum...tahjurun, this\\n\\t\\t\\t\\texpression indicates the pursuit of endless, fruitless\\n\\t\\t\\t\\tdiscussions divorced from all reality, or a mere play\\n\\t\\t\\t\\twith words leading nowhere. (See also  31:6  and the\\n\\t\\t\\t\\tcorresponding note [4].)"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "68",
    "NoteID": "39",
    "Body": "Implying that the message of the Qur'an is but a\\n\\t\\t\\t\\tcontinuation of all the divine messages ever revealed to\\n\\t\\t\\t\\tman."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "70",
    "NoteID": "40",
    "Body": "I.e., they hate to admit the truth: the reason being - as\\n\\t\\t\\t\\tthe sequence shows - that the world-view propounded by\\n\\t\\t\\t\\tthe Qur'an is not in accord with their own likes and\\n\\t\\t\\t\\tdislikes or preconceived notions."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "71",
    "NoteID": "41",
    "Body": "I.e., the reality of all creation."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "71",
    "NoteID": "42",
    "Body": "I.e., if the universe - and, especially, human life - had\\n\\t\\t\\t\\tbeen as devoid of meaning and purpose as they imagine,\\n\\t\\t\\t\\tnothing could have endured, and everything would have\\n\\t\\t\\t\\tlong since perished in chaos."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "71",
    "NoteID": "43",
    "Body": "For this rendering of the term dhikr, see note [13] on\\n\\t\\t\\t\\t 21:10 ."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "72",
    "NoteID": "44",
    "Body": "The terms kharj and kharaj which occur in the above verse\\n\\t\\t\\t\\tare more or less synonymous, both of them denoting\\n\\t\\t\\t\\t\"recompense\". According to Zamakhshari, however, there is\\n\\t\\t\\t\\ta slight difference between these two expressions, kharj\\n\\t\\t\\t\\tbeing more restricted in its meaning than kharaj: hence,\\n\\t\\t\\t\\tthe first has been rendered as \"worldly recompense\" and\\n\\t\\t\\t\\tthe second as \"recompense\" without any restrictive\\n\\t\\t\\t\\tdefinition, implying that a recompense from God is\\n\\t\\t\\t\\tunlimited, relating both."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "75",
    "NoteID": "45",
    "Body": "Sc., \"as it inevitably befalls all human beings\": an\\n\\t\\t\\t\\toblique allusion to the fact that human life is never\\n\\t\\t\\t\\tfree from distress."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "76",
    "NoteID": "46",
    "Body": "Lit., \"We took them to task\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "77",
    "NoteID": "47",
    "Body": "Or: \"they will despair of all hope\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "84",
    "NoteID": "48",
    "Body": "Lit., \"and all who are on it\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "86",
    "NoteID": "49",
    "Body": "Lit., \"who is the Sustainer (rabb) of the seven heavens\"-\\n\\t\\t\\t\\tsee note [20] on  2:29 - \"and the Sustainer of the\\n\\t\\t\\t\\tawesome throne of almightiness\": cf.  9:129  as well as\\n\\t\\t\\t\\tnote [43] on  7:54 ."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "89",
    "NoteID": "50",
    "Body": "Sc., \"as to deny the prospect of resurrection\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "90",
    "NoteID": "51",
    "Body": "Lit., \"they are indeed liars\" - i.e., they deceive\\n\\t\\t\\t\\tthemselves by asserting that they believe in God and, at\\n\\t\\t\\t\\tthe same time, rejecting the idea of a life after death,\\n\\t\\t\\t\\twhich - in view of the fact that many wrongdoers prosper\\n\\t\\t\\t\\tin this world while many righteous lead a life of\\n\\t\\t\\t\\tsuffering - is insolubly bound up with the concept of\\n\\t\\t\\t\\tdivine justice. Apart from this, a denial of the\\n\\t\\t\\t\\tpossibility of resurrection implies a doubt as to God’s\\n\\t\\t\\t\\tunlimited power and, thus, of His Godhead in the true\\n\\t\\t\\t\\tsense of this concept. This latter doubt often finds its\\n\\t\\t\\t\\texpression in the mystic belief in a multiplicity of\\n\\t\\t\\t\\tdivine powers: and it is to this erroneous belief that\\n\\t\\t\\t\\tthe next verse alludes."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "91",
    "NoteID": "52",
    "Body": "This allusion to the pre-Islamic Arabian belief in angels\\n\\t\\t\\t\\tas \"God’s daughters\" and the Christian dogma of Jesus’\\n\\t\\t\\t\\t\"sonship of God\" connects with the statement \"they are\\n\\t\\t\\t\\tintent on lying [to themselves]\", which has been\\n\\t\\t\\t\\texplained in the preceding note."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "91",
    "NoteID": "53",
    "Body": "This is how almost all the classical commentators explain\\n\\t\\t\\t\\tthe phrase la-dhahaba bi-ma khalaqa (lit., \"would surely\\n\\t\\t\\t\\thave taken away whatever he had created\"), implying that\\n\\t\\t\\t\\tin such a hypothetical case each of the gods would have\\n\\t\\t\\t\\tbeen concerned only with his own sector of creation, thus\\n\\t\\t\\t\\tcausing complete confusion in the universe."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "91",
    "NoteID": "54",
    "Body": "See note [88] on  6:100 ."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "92",
    "NoteID": "55",
    "Body": "See surah {6}, note [65]."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "93",
    "NoteID": "56",
    "Body": "Lit., \"to show me\" [sc., \"in my lifetime\"]. According to\\n\\t\\t\\t\\tZamakhshari, the combination of the conditional particle\\n\\t\\t\\t\\tin (\"if\") with ma (\"that which\" or \"whatever\") - spelt\\n\\t\\t\\t\\tand pronounced imma - endows the verb turini (lit., \"Thow\\n\\t\\t\\t\\twilt show me\") with the quality of intrinsic necessity -\\n\\t\\t\\t\\tthus: \"If it is inevitable (la budd) that Thou show me\\n\\t\\t\\t\\t[or \"let me witness\"]...\", etc. In translation, this\\n\\t\\t\\t\\tparticular phrasing is best rendered as above, since\\n\\t\\t\\t\\tanything that is God’s will becomes eo ipso inevitable."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "96",
    "NoteID": "57",
    "Body": "See surah {13}, note [44]. In the present context, the\\n\\t\\t\\t\\tevil referred to consists - as the next clause shows - in\\n\\t\\t\\t\\tblasphemous attempts at \"defining\" God (cf. verse {91});\\n\\t\\t\\t\\tbut the ethical principle implied in the above injunction\\n\\t\\t\\t\\tis the same as that expressed in the last clause of\\n\\t\\t\\t\\t 13:22  as well as in  41:34  - namely, that evil must\\n\\t\\t\\t\\tnot be countered with another evil but, rather, repelled\\n\\t\\t\\t\\tby an act of goodness."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "97",
    "NoteID": "58",
    "Body": "Lit., \"of the satans\" or \"satanic forces\": see note [10]\\n\\t\\t\\t\\ton  2:14 ."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "99",
    "NoteID": "59",
    "Body": "Cf. verses {74} and {90} above, with which the present\\n\\t\\t\\t\\tpassage connects."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "99",
    "NoteID": "60",
    "Body": "Most of the commentators regard the plural form of\\n\\t\\t\\t\\taddress in the verb irji'uni (\"let me return\") as an\\n\\t\\t\\t\\texpression of reverence. Since, however, the Qur'an\\n\\t\\t\\t\\toffers no other instance of God's being addressed in the\\n\\t\\t\\t\\tplural (in contrast with the frequent use of the plural\\n\\t\\t\\t\\tin His speaking of Himself), Baydawi suggests - on the\\n\\t\\t\\t\\tstrength of examples from pre-Islamic poetry - that this\\n\\t\\t\\t\\tplural form of address is equivalent to an emphatic\\n\\t\\t\\t\\trepetition of the singular form irji'ni: hence the\\n\\t\\t\\t\\trepetition of this phrase in my rendering."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "100",
    "NoteID": "61",
    "Body": "Lit., \"in respect of that which (fi-ma) I have left\",\\n\\t\\t\\t\\tcomprising both the omission of good and the commission\\n\\t\\t\\t\\tof bad deeds."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "106",
    "NoteID": "62",
    "Body": "Lit., \"we became people who go astray\". This allegorical\\n\\t\\t\\t\\t\"dialogue\" is meant to bring out the futile excuse\\n\\t\\t\\t\\tcharacteristic of so many sinners who attribute their\\n\\t\\t\\t\\tfailings to an abstract \"bad luck\" (which is the meaning\\n\\t\\t\\t\\tof shiqwah in this context); and thus, indirectly, it\\n\\t\\t\\t\\tstresses the element of free will - and, therefore, of\\n\\t\\t\\t\\tresponsibility - in man’s actions and behaviour."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "108",
    "NoteID": "63",
    "Body": "My interpolation of the word \"ignominy\" is based on the\\n\\t\\t\\t\\tfact that this concept is inherent in the verb khasa'a\\n\\t\\t\\t\\t(lit., \"he drove [someone or something] scornfully\\n\\t\\t\\t\\taway\"), and is, therefore, forcefully expressed in the\\n\\t\\t\\t\\timperative ikhsa'u."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "109",
    "NoteID": "64",
    "Body": "Lit., \"the best of those [or \"of all\"] who show mercy\".\\n\\t\\t\\t\\tThe same expression is found in the concluding verse of\\n\\t\\t\\t\\tthis surah."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "110",
    "NoteID": "65",
    "Body": "Lit., \"until they made you forget\":i.e.,\"your scoffing at\\n\\t\\t\\t\\tthem became the cause of your forgetting\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "113",
    "NoteID": "66",
    "Body": "This part of the allegorical \"dialogue\" between God and\\n\\t\\t\\t\\tthe doomed sinners touches (as do several other verses of\\n\\t\\t\\t\\tthe Qur’an) upon the illusory, problematical character of\\n\\t\\t\\t\\t\"time\" as conceived by man, and the comparative\\n\\t\\t\\t\\tirrelevancy of the life of this world within the context\\n\\t\\t\\t\\tof the ultimate - perhaps timeless - reality known only\\n\\t\\t\\t\\tto God. The disappearance, upon resurrection, of man’s\\n\\t\\t\\t\\tearth-bound concept of time is indicated by the helpless\\n\\t\\t\\t\\tanswer, \"ask those who are able to count time\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "115",
    "NoteID": "67",
    "Body": "Lit., \"that you would not be brought back to Us\", i.e.,\\n\\t\\t\\t\\tfor judgment."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "116",
    "NoteID": "68",
    "Body": "See surah {20}, note [99]."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "116",
    "NoteID": "69",
    "Body": "Lit., \"the Sustainer (rabb) of the bountiful throne of\\n\\t\\t\\t\\talmightiness (al-'arsh al-karim)\". See also surah {7},\\n\\t\\t\\t\\tnote [43], for an explanation of my rendering of al-'arsh\\n\\t\\t\\t\\tas \"the throne of [His] almightiness\"."
  }
]
