[
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "1",
    "NoteID": "29162",
    "Text": "  &nbsp;This s&ucirc;rah, which is perceived as a continuation of the previous s&ucirc;rah, begins by openly terminating the peace treaties constantly violated by the pagans. The believers are urged to march forth with the Prophet (&#65018;) for the Battle of Tab&ucirc;k in the summer of 9 A.H./631 C.E. Hypocrites are exposed and their false excuses are refuted. Muslims are reminded of how Allah turned the believers&rsquo; initial defeat into sweeping victory at the Battle of &#7716;unain and how Allah saved His Messenger (&#65018;) from the pagans during his migration to Medina. Allah&rsquo;s acceptance of repentance is echoed throughout the s&ucirc;rah, hence its title.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "2",
    "NoteID": "29163",
    "Text": "   &nbsp; This is the only s&ucirc;rah&nbsp;in the Quran that does not begin with: &ldquo;In the Name of Allah&mdash;the Most Compassionate, Most Merciful.&rdquo; The reason is that this s&ucirc;rah&nbsp;is considered to be a continuation of the previous one, and that it begins with an open termination of treaties not fully respected by the polytheists. Since this constitutes a declaration of war, it would not be fitting to open with the mention of Allah&rsquo;s compassion and mercy.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "3",
    "NoteID": "29164",
    "Text": "  &nbsp;The 10 th &nbsp;of &#11371;ul-&#7716;ijjah, a significant day in the greater pilgrimage (&#7717;ajj). The lesser pilgrimage is known as&nbsp;&rsquo;umrah.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "5",
    "NoteID": "29165",
    "Text": "  &nbsp;i.e., inside or outside the sanctuary of the Sacred House in Mecca.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "7",
    "NoteID": "29166",
    "Text": "  &nbsp;This is known as the Treaty of &#7716;udaibiyah, which was signed by the Prophet (&#65018;) and the pagans of Mecca in 6 A.H./628 C.E., diffusing the tension between Muslims and the Meccans and affirming a 10-year peace truce. The treaty was violated by the Meccans in 8 A.H/630 C.E.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "25",
    "NoteID": "29167",
    "Text": "  &nbsp;After the Muslims&rsquo; victory in Mecca in 8 A.H/630 C.E., almost all Arab tribes pledged allegiance to the Prophet (&#65018;) except some tribes such as Haw&acirc;zin and Thaq&icirc;f. Both tribes decided to attack the Muslims, so the Prophet (&#65018;) led an army of 12 000 soldiers to attack the two tribes. Since that was the largest Muslim army ever mobilized, some Muslims expressed their conviction that such an army could not be defeated. However, on the way to battle, the Muslim army was ambushed and most soldiers fled, except for the Prophet (&#65018;) and a few loyalists. Eventually, the Muslims were re-organized and won a decisive battle.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "26",
    "NoteID": "29168",
    "Text": "   &nbsp; lit., tranquility.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "26",
    "NoteID": "29169",
    "Text": "  &nbsp;i.e., angels.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "27",
    "NoteID": "29170",
    "Text": "  &nbsp;i.e., Allah will accept those who embrace Islam. Almost all of Arabia became Muslim before the death of Prophet Mu&#7717;ammad (&#65018;) in 11 A.H./632 C.E.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "28",
    "NoteID": "29171",
    "Text": "  &nbsp;i.e., impure spiritually because of idolatry, not physically.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "28",
    "NoteID": "29172",
    "Text": "  &nbsp;The 9 th &nbsp;year of the Prophet&rsquo;s migration from Mecca to Medina.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "29",
    "NoteID": "29173",
    "Text": "  &nbsp;To fully understand this verse we need to bear in mind that Quranic verses are of two types. General verses talk about belief in Allah, good manners, and acts of worship. Specific verses, such&nbsp;as this verse, were revealed in regards to particular situations. This s&ucirc;rah&nbsp;came at a time when the pagans of Arabia (and their allies) repeatedly violated treaties they had signed with the Prophet (&#65018;). Muslims had to fight for the survival of their newly established state in Medina. So this verse discusses dealing with those who violated their agreements and attacked the Muslims. Offenders were fought, unless they stopped their aggression. If they chose not to accept Islam, they were obligated to pay Jizya-tax.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "29",
    "NoteID": "29174",
    "Text": "  &nbsp;Taxation systems have existed since ancient times. There are several references in the Old Testament (e.g., Ezra 4:20). In the New Testament, Jesus allows paying taxes to Caesar (Luke 20:25). Under Islamic rule, all individuals had financial obligations&mdash;Muslims paid zak&acirc;h&nbsp;(2.5% of their savings) and non-Muslims (&#11372;imm&icirc;s) were required to pay jizyah&nbsp;(tax for protection from foreign enemies). The jizyah&nbsp;was an average of one dinar (4.25 g of gold) annually. Women, children, the elderly, the clergy, the poor, and those who were unable to work were exempt. Those who opted to join the army were also exempt. Poor &#11372;imm&icirc;s&nbsp;were supported financially by the state. Muslim rulers refunded the jizyah&nbsp;if they failed to protect their non-Muslim subjects.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "31",
    "NoteID": "29175",
    "Text": "  &nbsp;When &rsquo;Adi ibn &#7716;&acirc;tim, a companion of the Prophet (&#65018;), heard this verse, he said, &ldquo;But the Jews and Christians do not worship their rabbis and monks!&rdquo; The Prophet (&#65018;) replied, &ldquo;Do the rabbis and monks not forbid the permissible and permit the forbidden, and they obey them?&rdquo; &rsquo;Adi answered, &ldquo;Yes, they do.&rdquo; The Prophet (&#65018;) concluded, &ldquo;This is how they worship them.&rdquo; Collected by At-Tirmi&#11372;i.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "32",
    "NoteID": "29176",
    "Text": "  &nbsp;i.e., religion of truth.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "36",
    "NoteID": "29177",
    "Text": "  &nbsp;i.e., the Preserved Tablet in which everything is written.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "37",
    "NoteID": "29178",
    "Text": "  &nbsp;The sacred months are the 11 th , 12 th , 1 st , and 7 th &nbsp;of the Islamic calendar. Since the polytheists knew that it was forbidden to fight in the sacred months, they used to transfer the sanctity to other months, say for example, the 3 rd , 4 th , 8 th , and 10 th &nbsp;as long as they maintained the sanctity of any four months throughout the year.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "38",
    "NoteID": "29179",
    "Text": "  &nbsp;The fast pace of the spread of Islam in Arabia in the 7 th &nbsp;century was intimidating to the world&rsquo;s two superpowers of that time: the Romans and Persians. The Prophet (&#65018;) received the news that a Roman army was being mobilized to launch an attack on the newly established Muslim state in Medina, so he announced that he was going to march to Tab&ucirc;k, located over 700 miles to the north, to meet the Romans in the summer of 9 A.H./631 C.E. It was a time of hardship because of the scorching heat, the long distance, and the financial situation of the Muslims. Although the Prophet (&#65018;) was able to mobilize over 30 000 Muslims for battle, many others did not join the army with or without valid excuses. Eventually, the Roman forces were discouraged from fighting and fled to Damascus and other cities under Roman rule. Therefore, the Prophet (&#65018;) returned to Medina with a feeling of triumph. With a new power now emerging in Arabia, many tribes started to switch their alliances from Caesar to the Prophet (&#65018;).   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "29180",
    "Text": "  &nbsp;Abu Bakr A&#7779;-&#7778;idd&icirc;q, Islam&rsquo;s first Caliph and a prominent figure in Islamic history. He accompanied the Prophet (&#65018;) during his emigration from Mecca to Medina after years of persecution at the hands of the Meccan pagans.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "48",
    "NoteID": "29181",
    "Text": "  &nbsp;For example, &rsquo;Abdull&acirc;h ibn Ubai ibn Sal&ucirc;l, a chief hypocrite, marched with the Prophet (&#65018;) for the Battle of U&#7717;ud in the outskirts of Medina, then decided not to join the fight and returned to Medina with his followers who made up around one third of the Muslim army.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "49",
    "NoteID": "29182",
    "Text": "  &nbsp;Another hypocrite by the name of Jadd ibn Qais came to the Prophet (&#65018;) asking to be exempt from joining the army because he had a weakness for women and he was afraid that he would be tempted by Roman women.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "66",
    "NoteID": "29183",
    "Text": "  &nbsp;i.e., those who will repent.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "70",
    "NoteID": "29184",
    "Text": "  &nbsp;The overturned cities of Sodom and Gomorrah.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "74",
    "NoteID": "29185",
    "Text": "  &nbsp;i.e., some of them tried to assassinate the Prophet (&#65018;) on the way back from Tab&ucirc;k.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "100",
    "NoteID": "29186",
    "Text": "  &nbsp;i.e., the early Muslims who emigrated from Mecca to Medina, known as Al-Muh&acirc;jir&ucirc;n.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "100",
    "NoteID": "29187",
    "Text": "  &nbsp;i.e., those from Medina, known as Al-An&#7779;&acirc;r, who accepted Islam and sheltered Muslim emigrants from Mecca.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "101",
    "NoteID": "29188",
    "Text": "  &nbsp;Through disgrace in this world and bad ending of their lives.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "102",
    "NoteID": "29189",
    "Text": "  &nbsp;They have mixed their adherence to Islam with their disobedience to march forth with the Prophet (&#65018;) to Tab&ucirc;k.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "106",
    "NoteID": "29190",
    "Text": "  &nbsp;This verse refers to Ka&rsquo;b ibn M&acirc;lik, Murarah ibn Rabi&rsquo;, and Hil&acirc;l ibn Umaiyah, the three companions who remained in Medina with no excuse, but were honest about what they did. They were boycotted by Muslims for about fifty days until verses 118-119 of this chapter were revealed declaring the acceptance of their repentance.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "107",
    "NoteID": "29191",
    "Text": "  &nbsp;Abu &rsquo;&Acirc;mer Ar-R&acirc;hib was a monk who fought against Muslims at the Battle of Badr. He ordered a group of twelve hypocrites to build a mosque near the Mosque of Qub&acirc;', the first mosque built by Muslims and also where the Prophet (&#65018;) and his companions would pray. The new mosque, commonly referred to as Masjid A&#7693;-&#7692;ir&acirc;r&nbsp;(Mosque of Harm), was intended to attract other hypocrites and reduce the number of Muslims who prayed at Qub&acirc;'. The hypocrites who built the mosque also anticipated the arrival of Abu &rsquo;&Acirc;mer with Roman forces to expel the Prophet (&#65018;) and Muslims out of Medina. Upon a request from these hypocrites, the Prophet (&#65018;) had planned to visit the new mosque once he returned from Tab&ucirc;k, but verses 107-110 of this s&ucirc;rah&nbsp;were revealed, warning the Prophet (&#65018;) against that mosque. According to some narrations, the Prophet (&#65018;) ordered this mosque to be burned down.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "108",
    "NoteID": "29192",
    "Text": "  &nbsp;See&nbsp;footnote for 7:46.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "114",
    "NoteID": "29193",
    "Text": "  &nbsp;Abraham promised to pray for his father&rsquo;s forgiveness in 19:47 and 60:4, but when his father died as a disbeliever he discontinued praying for him.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "117",
    "NoteID": "29194",
    "Text": "  &nbsp;The Prophet (&#65018;) is forgiven for exempting all those who came to him with excuses regardless of their honesty, or for seeking forgiveness for the polytheists.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "125",
    "NoteID": "29195",
    "Text": "  &nbsp;i.e., hypocrites.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "9",
    "AyahNumber": "126",
    "NoteID": "29196",
    "Text": "  &nbsp;Their hypocrisy is exposed over and over again.   "
  }
]
