[
  {
    "SurahNumber": "95",
    "AyahNumber": "1",
    "NoteID": "6194",
    "Body": "The substantive proposition is in verses 4-8, and it is\\n\\t\\t\\t\\tclinched by an appeal to four sacred symbols, viz., the\\n\\t\\t\\t\\tFig, the Olive, Mount Sinai, and the sacred City of\\n\\t\\t\\t\\tMakkah. About the precise interpretation of the first two\\n\\t\\t\\t\\tsymbols, and especially of the symbol of the Fig, there\\n\\t\\t\\t\\tis much difference of opinion. If we take the Fig\\n\\t\\t\\t\\tliterally to refer to the fruit or the tree, it can stand\\n\\t\\t\\t\\tas a symbol of man's destiny in many ways. Under\\n\\t\\t\\t\\tcultivation it can be one of the finest, most delicious,\\n\\t\\t\\t\\tand most wholesome fruits in existence: in its wild\\n\\t\\t\\t\\tstate, it is nothing but tiny seeds, and is insipid, and\\n\\t\\t\\t\\toften full of worms and maggots. So man at his best has a\\n\\t\\t\\t\\tnoble destiny: at his worst, he is \"the lowest of the\\n\\t\\t\\t\\tlow\". Christ is said to have cursed a fig tree for having\\n\\t\\t\\t\\tonly leaves, and not producing fruit (Matt. xxi. 18-20),\\n\\t\\t\\t\\tenforcing the same lesson. There is also a parable of the\\n\\t\\t\\t\\tfig tree in Matt. xxiv. 32-35. See also the parable of\\n\\t\\t\\t\\tthe good and evil figs in Jeremiah, xxiv. 1-10. But see\\n\\t\\t\\t\\tn. 6198 below."
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "1",
    "NoteID": "6195",
    "Body": "For the sacred symbolism of the Olive, see n. 2880 to\\n\\t\\t\\t\\txxiii. 20, and notes 3000- 3002 to xxiv. 35, where the\\n\\t\\t\\t\\tparable of Allah's Light includes a reference to the\\n\\t\\t\\t\\tOlive. But it is possible that the Olive here refers to\\n\\t\\t\\t\\tthe Mount of Olives, just outside the walls of the City\\n\\t\\t\\t\\tof Jerusalem (see n. 5038 to Iii. 2), for this is the\\n\\t\\t\\t\\tscene in the Gospel story (Matt. xxiv. 3-4) of Christ's\\n\\t\\t\\t\\tdescription of the Judgment to come."
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "2",
    "NoteID": "6196",
    "Body": "This was the Mountain on which the Law was given to\\n\\t\\t\\t\\tMoses. See xix. 52, and n. 2504. The Law was given, and\\n\\t\\t\\t\\tthe glory of Allah was made visible. But did Israel\\n\\t\\t\\t\\tfaithfully obey the Law thereafter?"
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "3",
    "NoteID": "6197",
    "Body": "\"This City of security\" is undoubtedly Makkah. Even in\\n\\t\\t\\t\\tPagan times its sacred character was respected, and no\\n\\t\\t\\t\\tfighting was allowed in its territory. But the same City,\\n\\t\\t\\t\\twith all its sacred associations, persecuted the greatest\\n\\t\\t\\t\\tof the Prophets and gave itself up for a time to idolatry\\n\\t\\t\\t\\tand sin, thus presenting the contrast of the best and the\\n\\t\\t\\t\\tworst."
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "3",
    "NoteID": "6198",
    "Body": "Having discussed the four symbols in detail, let us\\n\\t\\t\\t\\tconsider them together. It is clear that they refer to\\n\\t\\t\\t\\tAllah's Light or Revelation, which offers man the highest\\n\\t\\t\\t\\tdestiny if he will follow the Way. Makkah stands for\\n\\t\\t\\t\\tIslam, Sinai for Israel, and the Mount of Olives for\\n\\t\\t\\t\\tChrist's original and pure Message."
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "4",
    "NoteID": "6199",
    "Body": "Taqwim: mould, symmetry, form, nature, constitution.\\n\\t\\t\\t\\tThere is no fault in Allah's creation. To man Allah gave\\n\\t\\t\\t\\tthe purest and best nature, and man's duty is to preserve\\n\\t\\t\\t\\tthe pattern on which Allah has made him: xxx. 30. But by\\n\\t\\t\\t\\tmaking him vicegerent, Allah exalted him in posse even\\n\\t\\t\\t\\thigher than the angels, for the angels had to make\\n\\t\\t\\t\\tobeisance to him (ii. 30-34, and n. 48). But man's\\n\\t\\t\\t\\tposition as vicegerent also gives him will and\\n\\t\\t\\t\\tdiscretion, and if he uses them wrongly he falls even\\n\\t\\t\\t\\tlower than the beasts. See next note."
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "5",
    "NoteID": "6200",
    "Body": "This verse should be read with the next. If man rebels\\n\\t\\t\\t\\tagainst Allah, and follows after evil, he will be abased\\n\\t\\t\\t\\tto the lowest possible position. For Judgment is sure.\\n\\t\\t\\t\\tThose who use their faculties aright and follow Allah's\\n\\t\\t\\t\\tLaw will reach the high and noble destiny intended for\\n\\t\\t\\t\\tthem. That reward will not be temporary, but unfailing."
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "7",
    "NoteID": "6201",
    "Body": "Thee: may refer to the holy Prophet, or to man\\n\\t\\t\\t\\tcollectively. After this: i.e., when it is clearly shown\\n\\t\\t\\t\\tto you that Allah created man true and pure, that He\\n\\t\\t\\t\\tguides him, and that those who rebel and break His law\\n\\t\\t\\t\\twill be punished and brought down in the Hereafter, who\\n\\t\\t\\t\\tcan doubt this, or contradict the Prophet when he gives\\n\\t\\t\\t\\twarning?"
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "8",
    "NoteID": "6202",
    "Body": "Allah is wise and just. Therefore the righteous have\\n\\t\\t\\t\\tnothing to fear, but the evil ones cannot escape\\n\\t\\t\\t\\tpunishment."
  }
]
