[
  {
    "SurahNumber": "50",
    "AyahNumber": "1",
    "NoteID": "4939",
    "Body": "This is an Abbreviated Letter. For Abbreviated Letters\\n\\t\\t\\t\\tgenerally, see Appendix I. This particular Abbreviated\\n\\t\\t\\t\\tLetter Qaf occurs only here as a single letter, and in\\n\\t\\t\\t\\tcombination at the beginning of S. xlii."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "1",
    "NoteID": "4940",
    "Body": "Majid (translated \"Glorious\") is one of the beautiful\\n\\t\\t\\t\\tappellations of the Qur-an. Its glory is that of the\\n\\t\\t\\t\\trising sun: the more it rises on your mental and\\n\\t\\t\\t\\tspiritual horizon, the more you are lost in admiration of\\n\\t\\t\\t\\tits glory. Its meanings are manifest and inexhaustible.\\n\\t\\t\\t\\tThe greater your experience, the more light is your\\n\\t\\t\\t\\tspiritual eye able to bear. And in that glory is a beauty\\n\\t\\t\\t\\tthat none can tell who has not experienced it in his\\n\\t\\t\\t\\tsoul. It is in itself the proof of the mission of the\\n\\t\\t\\t\\tholy Prophet."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "2",
    "NoteID": "4941",
    "Body": "In a sense their wonder is natural: do we wonder at the\\n\\t\\t\\t\\tglorious sun? In another sense it is unnatural: what\\n\\t\\t\\t\\tshould we say of a man who fails to see in broad\\n\\t\\t\\t\\tdaylight?"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "3",
    "NoteID": "4942",
    "Body": "Cf. xxxvii. 16."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "4",
    "NoteID": "4943",
    "Body": "The earth only corrupts and takes away the body when they\\n\\t\\t\\t\\tare dead; it has no power over the soul. The full account\\n\\t\\t\\t\\tof the soul's doings is in Allah's Record."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "5",
    "NoteID": "4944",
    "Body": "If they deny what has been made clear to them, their\\n\\t\\t\\t\\tminds must necessarily get into confusion. All nature\\n\\t\\t\\t\\tdeclares the glory and goodness of Allah. Revelation\\n\\t\\t\\t\\texplains the inequalities of this life and how they will\\n\\t\\t\\t\\tbe redressed in the Hereafter. If they do not accept\\n\\t\\t\\t\\tthis, they are not in a logical position. They cannot\\n\\t\\t\\t\\treconcile the known with the unknown."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "6",
    "NoteID": "4945",
    "Body": "The greatest philosophers have found a difficulty in\\n\\t\\t\\t\\tunderstanding the sceptical position when they\\n\\t\\t\\t\\tcontemplate the wonder and mystery of the skies with all\\n\\t\\t\\t\\tthe countless beautiful stars and planets and light in\\n\\t\\t\\t\\tthem, and laws of order, motion, and symmetry, that\\n\\t\\t\\t\\trespond to the highest mathematical abstractions without\\n\\t\\t\\t\\ta flaw. Can blind Chance give rise to such conditions?"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "7",
    "NoteID": "4946",
    "Body": "Cf. xiii. 3; and xv. 19 and n. 1955. The earth is round,\\n\\t\\t\\t\\tand yet it appears stretched out as a vast expanse, like\\n\\t\\t\\t\\ta carpet kept steady with the weight of the mountains."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "7",
    "NoteID": "4947",
    "Body": "Cf. xxii. 5, and n. 2777. Sex in plants may be hinted at:\\n\\t\\t\\t\\tsee n. 1804 to xiii. 3."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "8",
    "NoteID": "4948",
    "Body": "For all these things go into his very heart and soul. He\\n\\t\\t\\t\\tloves to contemplate them, to remember them for himself\\n\\t\\t\\t\\tas evidence of Allah's goodness and glory, and to mention\\n\\t\\t\\t\\tand proclaim them."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "10",
    "NoteID": "4949",
    "Body": "A beautiful nature passage. How graphic and unforgettable\\n\\t\\t\\t\\tto any one who has seen a spring and summer in an Arabian\\n\\t\\t\\t\\toasis!"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "12",
    "NoteID": "4950",
    "Body": "Just the names of the peoples of Arabian tradition who\\n\\t\\t\\t\\twere punished for their sins are mentioned; their stories\\n\\t\\t\\t\\twill be found elsewhere. For the People of Noah, see xi.\\n\\t\\t\\t\\t25-48 and other passages. For the Companions of the Rass,\\n\\t\\t\\t\\tsee xxv. 38 and n. 3094; for the 'Ad and the Thamud, see\\n\\t\\t\\t\\txxvi. 123-158, and other passages; for Pharaoh and his\\n\\t\\t\\t\\tPeople, see ii. 49-50 and other passages; for the\\n\\t\\t\\t\\tBrethren of Lut, see vii. 80-84, and other passages; for\\n\\t\\t\\t\\tthe Companions of the Wood, see xv. 78-79, and n. 2000;\\n\\t\\t\\t\\tand for the People of Tubba', see xliv. 37 and n. 4715."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "15",
    "NoteID": "4951",
    "Body": "Cf. xlvi. 33, and n. 4912."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "16",
    "NoteID": "4952",
    "Body": "Allah created man, and gave him his limited free-will.\\n\\t\\t\\t\\tAllah knows the inmost desires and motives of man even\\n\\t\\t\\t\\tbetter than man does himself. He is nearer to a man than\\n\\t\\t\\t\\tthe man's own jugular vein. The jugular vein is the big\\n\\t\\t\\t\\ttrunk vein, one on each side of the neck, which brings\\n\\t\\t\\t\\tthe blood back from the head to the heart. The two\\n\\t\\t\\t\\tjugular veins correspond to the two carotid arteries\\n\\t\\t\\t\\twhich carry the blood from the heart to the head. As the\\n\\t\\t\\t\\tblood-stream is the vehicle of life and consciousness,\\n\\t\\t\\t\\tthe phrase \"nearer than the jugular vein\" implies that\\n\\t\\t\\t\\tAllah knows more truly the innermost state of our feeling\\n\\t\\t\\t\\tand consciousness than does our own ego."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "17",
    "NoteID": "4953",
    "Body": "Two angels are constantly by him to note his thoughts,\\n\\t\\t\\t\\twords, and actions. One sits on the right side and notes\\n\\t\\t\\t\\this good deeds and the other on the left, to note his bad\\n\\t\\t\\t\\tdeeds; corresponding to the Companions of the Right and\\n\\t\\t\\t\\tthe Companions of the Left mentioned in lvi. 27 and 41."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "18",
    "NoteID": "4954",
    "Body": "Then each \"word\" spoken is taken down by a guardian\\n\\t\\t\\t\\t(raqib). This has been construed to mean that the\\n\\t\\t\\t\\tguardian only records words, not thoughts which are not\\n\\t\\t\\t\\tuttered. Thoughts may be forgiven if not uttered, and\\n\\t\\t\\t\\tstill more if they do not issue in action. At the stage\\n\\t\\t\\t\\tat which we clothe a thought in words, we have already\\n\\t\\t\\t\\tdone an action. The Recorders mentioned in the last verse\\n\\t\\t\\t\\tmake a complete Record, in order to supply motives and\\n\\t\\t\\t\\tsprings of action, which will affect the degrees or\\n\\t\\t\\t\\tstatus in the Hereafter. The three together, individuals\\n\\t\\t\\t\\tor kinds, make the honourable Recorders, Kiraman Katibin,\\n\\t\\t\\t\\t(plural, not dual number) mentioned in lxxii. 11."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "19",
    "NoteID": "4955",
    "Body": "What is stupor or unconsciousness to this probationary\\n\\t\\t\\t\\tlife will be the opening of the eyes to the next world:\\n\\t\\t\\t\\tfor Death is the Gateway between the two. Once through\\n\\t\\t\\t\\tthat Gateway man will realise how the things which he\\n\\t\\t\\t\\tneglected or looked upon as remote are the intimate\\n\\t\\t\\t\\tRealities, and the things which seemed to loom large in\\n\\t\\t\\t\\this eyes in this world were shadows that have fled. The\\n\\t\\t\\t\\tthings he wanted to avoid are the things that have really\\n\\t\\t\\t\\tcome to pass. Both Good and Evil will realise the Truth\\n\\t\\t\\t\\tnow in its intensity."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "20",
    "NoteID": "4956",
    "Body": "The next stage will be the Judgment, heralded with the\\n\\t\\t\\t\\tblowing of the Trumpet. Every soul will then come forth."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "21",
    "NoteID": "4957",
    "Body": "Several interpretations are possible, leading to the same\\n\\t\\t\\t\\ttruth, that the Judgment will be set up; the Record will\\n\\t\\t\\t\\tbe produced; the good and bad deeds will speak for and\\n\\t\\t\\t\\tagainst; and complete justice will be done, each act\\n\\t\\t\\t\\tleading to its own due fruit. (1) The (angel) to drive\\n\\t\\t\\t\\tand the (angel) to bear witness may be the Recording\\n\\t\\t\\t\\tAngels of the left and the right (verse 17); or (2) it\\n\\t\\t\\t\\tmay not be angels, but the evil deeds will drive like\\n\\t\\t\\t\\ttask-masters, and the good deeds will bear witness for\\n\\t\\t\\t\\tthe soul on trial; or (3) his misused limbs and faculties\\n\\t\\t\\t\\twill drive him to his doom, while his well-used limbs and\\n\\t\\t\\t\\tfaculties will witness for him."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "22",
    "NoteID": "4958",
    "Body": "The clearness of vision will now be even greater: see n.\\n\\t\\t\\t\\t4955 above."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "23",
    "NoteID": "4959",
    "Body": "Qarin: Companion. If we take No. 1 of the constructions\\n\\t\\t\\t\\tsuggested in n. 4957, the Companion will be one of the\\n\\t\\t\\t\\tRecording Angels mentioned above, in verse 21, perhaps\\n\\t\\t\\t\\tthe one that drives; or perhaps the third one mentioned\\n\\t\\t\\t\\tin verse 18, for he has the Record ready with him. If we\\n\\t\\t\\t\\ttake any of the other constructions mentioned in n. 4957,\\n\\t\\t\\t\\tit will be the evil deeds or the misused faculties. In\\n\\t\\t\\t\\tany case it will be the factors on whose testimony his\\n\\t\\t\\t\\tconviction will be based."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "24",
    "NoteID": "4960",
    "Body": "The original for \"throw\", here and in verse 26 below, is\\n\\t\\t\\t\\tin the dual number, which some Commentators explain by\\n\\t\\t\\t\\tsaying that the dual form is used for emphasis, as if the\\n\\t\\t\\t\\tverb (\"throw, throw\") were twice repeated. Examples of\\n\\t\\t\\t\\tthis are found in Arabic. But is it possible that the\\n\\t\\t\\t\\tdual refers to the two angels mentioned in verses 17 and\\n\\t\\t\\t\\t21? In that case the Companion in verse 27 will be the\\n\\t\\t\\t\\tthird one mentioned in verses 18 and 23. In any case the\\n\\t\\t\\t\\tthird one will be the one on whose Record the sentence\\n\\t\\t\\t\\twill be passed."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "27",
    "NoteID": "4961",
    "Body": "See last note. But some people understand by \"Companion\"\\n\\t\\t\\t\\there an evil associate in the world, an evil one who\\n\\t\\t\\t\\tmisled."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "27",
    "NoteID": "4962",
    "Body": "Our Lord. One man speaks: \"I did not\", etc. Yet he uses\\n\\t\\t\\t\\tthe plural pronoun in saying, \"Our Lord\". This is\\n\\t\\t\\t\\tbeautifully appropriate, as he is speaking so as to\\n\\t\\t\\t\\tinclude the person to be judged: as if he were to say.\\n\\t\\t\\t\\t\"Thou art my Lord, or the Lord of us angels or of all\\n\\t\\t\\t\\tCreation, but Thou art his Lord also, for Thou didst\\n\\t\\t\\t\\tcherish him and warn him, and he owed duties to Thee.\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "27",
    "NoteID": "4963",
    "Body": "Neither the Recording Angels nor the misused limbs and\\n\\t\\t\\t\\tfaculties, nor anything else whatever was responsible for\\n\\t\\t\\t\\tthe Evil: it was the personal responsibility of the Doer\\n\\t\\t\\t\\thimself, with his free-will."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "28",
    "NoteID": "4964",
    "Body": "It is suggested that sinners whose Record is black,\\n\\t\\t\\t\\tdriven into a comer, accuse others of misleading them:\\n\\t\\t\\t\\tthe others may be the Recorders, or their faculties or\\n\\t\\t\\t\\topportunities or surroundings or their associates in the\\n\\t\\t\\t\\tworld, or anything but themselves. Such recriminations\\n\\t\\t\\t\\tare not allowed in the Court of Judgment."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "28",
    "NoteID": "4965",
    "Body": "Besides, personal responsibility had already been clearly\\n\\t\\t\\t\\tpreached to them in Allah's Message, and they had been\\n\\t\\t\\t\\twarned of the consequences. \"You\" is in the plural\\n\\t\\t\\t\\tnumber: 'all of you who are before the Judgment-Seat had\\n\\t\\t\\t\\tclear warning of the consequences of your conduct.'"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "29",
    "NoteID": "4966",
    "Body": "\"'Abd\" has two plurals: (1) 'Abid, as here, means all\\n\\t\\t\\t\\tServants of Allah, i.e., all his creatures; (2) 'Ibad has\\n\\t\\t\\t\\tthe further connotation of Servants of Allah, devoted to\\n\\t\\t\\t\\this service; I have translated it in many cases by the\\n\\t\\t\\t\\tword \"devotees\". The Sentence before the Judgment-Seat is\\n\\t\\t\\t\\tpronounced with perfect justice; it does not change, and\\n\\t\\t\\t\\trequires no change; the inevitable consequences of sin\\n\\t\\t\\t\\tmust follow; the time for Mercy is past."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "30",
    "NoteID": "4967",
    "Body": "As the capacity of Reward is unlimited, so is the\\n\\t\\t\\t\\tcapacity of Punishment-unlimited. Hell is personified and\\n\\t\\t\\t\\tasked, \"Art thou sated to the full?\" It replies, \"If\\n\\t\\t\\t\\tthere are more to come, let them come. \" It is not\\n\\t\\t\\t\\tsatisfied."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "31",
    "NoteID": "4968",
    "Body": "In this life, the ideas of the spirit, the accomplishment\\n\\t\\t\\t\\tof the things in our hearts and our hopes, seem to be\\n\\t\\t\\t\\tever so far, seem even to recede as we think we come\\n\\t\\t\\t\\tnearer. Not so in the Hereafter. The fruits of\\n\\t\\t\\t\\trighteousness will no longer be in the distance. They\\n\\t\\t\\t\\twill be realised. They will seem themselves to approach\\n\\t\\t\\t\\tthe Righteous."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "32",
    "NoteID": "4969",
    "Body": "The description of the Righteous is given in four\\n\\t\\t\\t\\tmasterly clauses: (1) those who turned away from Evil in\\n\\t\\t\\t\\tsincere repentance; (2) those whose new life was good and\\n\\t\\t\\t\\trighteous; (3) those who in their innermost hearts and in\\n\\t\\t\\t\\ttheir most secret doings were actuated by Allah-fearing\\n\\t\\t\\t\\tlove, the fear that is akin to love in remembering Allah\\n\\t\\t\\t\\tunder His title of \"Most Gracious\"; and (4) who gave up\\n\\t\\t\\t\\ttheir whole heart and being to Him."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "33",
    "NoteID": "4970",
    "Body": "Cf. xxxvi. 11 and n. 3952; and xxxv. 18, and n. 3902."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "34",
    "NoteID": "4971",
    "Body": "The true meaning of Islam: peace, security, salutation,\\n\\t\\t\\t\\tand accord with Allah's Plan in all Eternity."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "35",
    "NoteID": "4972",
    "Body": "To get all that our purified wishes and desires\\n\\t\\t\\t\\tcomprehend may seem to sum up final Bliss; but there is\\n\\t\\t\\t\\tsomething still wanting, which is supplied by the sight\\n\\t\\t\\t\\tof Allah, the Light of His Countenance."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "36",
    "NoteID": "4973",
    "Body": "While virtue and righteousness will accomplish their\\n\\t\\t\\t\\tfinal goal, what will be the End of Sin? Let the past\\n\\t\\t\\t\\ttell its story. Many powerful and arrogant generations\\n\\t\\t\\t\\twere swept away, to stray in the paths of misery, without\\n\\t\\t\\t\\tany way of escape from the consequences of their sin.\\n\\t\\t\\t\\tThis was already seen in the life of this world. In the\\n\\t\\t\\t\\tworld to come, it will be worse, as already stated in\\n\\t\\t\\t\\tverses 24-26 above."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "37",
    "NoteID": "4974",
    "Body": "As Christ said (Matt. xi. 15), \"he that hath ears to\\n\\t\\t\\t\\thear, let him hear\". These are matters of high moment.\\n\\t\\t\\t\\tMany spiritual lessons can be learnt from these things by\\n\\t\\t\\t\\tany one who has the heart and understanding to apply to\\n\\t\\t\\t\\tAllah's teaching and can give genuine thought to what he\\n\\t\\t\\t\\tsees, as a witness does who has to swear to the facts on\\n\\t\\t\\t\\this oath."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "38",
    "NoteID": "4975",
    "Body": "Allah's creation of the heavens and the earth in long\\n\\t\\t\\t\\tstages or periods of time, as we count time, shows how\\n\\t\\t\\t\\tthings evolve in their own good time. We must therefore\\n\\t\\t\\t\\tbe patient if Good does not seem to come to its own\\n\\t\\t\\t\\taccording to our ideas. Our will should merge itself in\\n\\t\\t\\t\\tAllah's Will, and we should praise Him, realising that He\\n\\t\\t\\t\\tis All-Good, and that all adjustments will be in the\\n\\t\\t\\t\\tHereafter."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "38",
    "NoteID": "4976",
    "Body": "Cf. vii. 54, n. 1031; and xli. 12. n. 4477."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "38",
    "NoteID": "4977",
    "Body": "Cf. xxxv. 35."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "39",
    "NoteID": "4978",
    "Body": "Allah should be remembered at all times. But the best\\n\\t\\t\\t\\ttime for individual adoration is early in the morning\\n\\t\\t\\t\\tbefore sunrise, late in the day before sunset, and a\\n\\t\\t\\t\\tportion of the night, when there is stillness in the air,\\n\\t\\t\\t\\tand man's spirit loves to commune with things spiritual.\\n\\t\\t\\t\\tThose who would connect this with the five canonical\\n\\t\\t\\t\\tprayers, instituted at a later stage in Madinah, would\\n\\t\\t\\t\\ttake the Fajr for the prayer before sunrise, the Zuhr\\n\\t\\t\\t\\tand, the Asr for the afternoon prayers before sunset and\\n\\t\\t\\t\\tthe Magrib and the Ishaa for the night prayers."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "40",
    "NoteID": "4979",
    "Body": "The general meaning of \"after the prostration\" would be\\n\\t\\t\\t\\tthe contemplation and remembrance of Allah after prayers.\\n\\t\\t\\t\\tThose who would connect this passage with the five\\n\\t\\t\\t\\tcanonical prayers understand these further prayers\\n\\t\\t\\t\\t\"following the sujud or prostration to mean the extra or\\n\\t\\t\\t\\tsupernumerary prayers known as nafl."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "41",
    "NoteID": "4980",
    "Body": "The Day of Resurrection, when the Call to the souls to\\n\\t\\t\\t\\tarise and come to the Judgment-Seat will be immediately\\n\\t\\t\\t\\tanswered, and they will all arise and come forth. Cf.\\n\\t\\t\\t\\txxxvi. 49-53, and notes 3997 and 3999."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "41",
    "NoteID": "4981",
    "Body": "In the life of this world it seemed all so remote. In the\\n\\t\\t\\t\\tnew life at the Resurrection it will all be so near; for\\n\\t\\t\\t\\tthere will be neither time nor space as we know them\\n\\t\\t\\t\\there."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "42",
    "NoteID": "4982",
    "Body": "The word \"saihatun\" (mighty Blast) is used for the\\n\\t\\t\\t\\tResurrection (as here) or for the sudden punishment of\\n\\t\\t\\t\\tthe guilty on this earth, as in xi. 67, where see further\\n\\t\\t\\t\\treferences."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "44",
    "NoteID": "4983",
    "Body": "Men will hurry out from all corners of the earth to\\n\\t\\t\\t\\tanswer the call, and the earth itself will be rent\\n\\t\\t\\t\\tasunder. In xxv. 25 the imagery used was the heaven being\\n\\t\\t\\t\\trent asunder, and angels coming out in ranks: see n.\\n\\t\\t\\t\\t3082. Cf. also lxxxiv. 1-4."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "44",
    "NoteID": "4984",
    "Body": "It may seem to our material imaginations a difficult task\\n\\t\\t\\t\\tto collect together the souls of all sorts of men, who\\n\\t\\t\\t\\tdied in all sorts of conditions at different times, but\\n\\t\\t\\t\\tit will be a different kind of world and creation\\n\\t\\t\\t\\taltogether, and to Allah all things are not only possible\\n\\t\\t\\t\\tbut easy."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "45",
    "NoteID": "4985",
    "Body": "People may throw all sorts of doubts about the Judgment\\n\\t\\t\\t\\tand the Hereafter. The Prophet's task is not to force\\n\\t\\t\\t\\tthem to accept anything. His task is to deliver the\\n\\t\\t\\t\\tMessage of the Qur-an, and admonish those who are\\n\\t\\t\\t\\tspiritually fit and ready to receive admonition and to\\n\\t\\t\\t\\tprepare themselves for the new and higher life destined\\n\\t\\t\\t\\tfor man."
  }
]
