[
  {
    "SurahNumber": "6",
    "AyahNumber": "1",
    "NoteID": "834",
    "Body": "Adala has various meanings: (1) to hold something as\\n\\t\\t\\t\\tequal to something else, as here; to balance nicely; (2)\\n\\t\\t\\t\\tto deal justly, as between one party and another,\\n\\t\\t\\t\\txiii.15; (3) to give compensation or reparation, or\\n\\t\\t\\t\\tsomething as equivalent to something else, vi. 70; (4) to\\n\\t\\t\\t\\tturn the balance the right way, to give a right\\n\\t\\t\\t\\tdisposition, to give a just bias or proportion, lxxxii.\\n\\t\\t\\t\\t7; (5) to turn the balance the wrong way, to swerve, to\\n\\t\\t\\t\\tshow bias. iv 135."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "1",
    "NoteID": "835",
    "Body": "The argument is threefold: (1) God created everything you\\n\\t\\t\\t\\tsee and know: how can you then set up any of His own\\n\\t\\t\\t\\tcreatures as equal to Him? (2) He is your own\\n\\t\\t\\t\\tGuardian-Lord; He cherishes and loves you: how can you be\\n\\t\\t\\t\\tso ungrateful as to run after something else? (3)\\n\\t\\t\\t\\tDarkness and Light are to help you to distinguish between\\n\\t\\t\\t\\tthe true from the false: how then can you confound the\\n\\t\\t\\t\\ttrue God with your false ideas and superstitions? There\\n\\t\\t\\t\\tmay also be a repudiation of the Duality of old Persian\\n\\t\\t\\t\\ttheology; Light and Darkness are not conflicting Powers;\\n\\t\\t\\t\\tthey are both creatures of the one true God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "2",
    "NoteID": "836",
    "Body": "After the general argument, the argument comes to man\\n\\t\\t\\t\\tpersonally. Can such a miserable creature, created from\\n\\t\\t\\t\\tclay, put himself in opposition to his Creator? And can\\n\\t\\t\\t\\tman forget or doubt that he is here only for a short term\\n\\t\\t\\t\\tof probation? And then, after a period, comes the Day of\\n\\t\\t\\t\\tAccount before God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "2",
    "NoteID": "837",
    "Body": "This life is a period of probation. The other term leads\\n\\t\\t\\t\\tup to Judgement."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "3",
    "NoteID": "838",
    "Body": "It is folly to suppose that God only reigns in the\\n\\t\\t\\t\\theavens. He also reigns on earth. He knows all our secret\\n\\t\\t\\t\\tthoughts and motives, and the real worth of all that is\\n\\t\\t\\t\\tbehind what we care to show. It is by our deeds that He\\n\\t\\t\\t\\tjudges us; for our deeds, whether good or evi, we shall\\n\\t\\t\\t\\tget due recompense in due time."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "6",
    "NoteID": "839",
    "Body": "Now comes the argument from history, looking backwards\\n\\t\\t\\t\\tand forwards. If we are so short-sighted or arrogant as\\n\\t\\t\\t\\tto suppose that we are firmly established on this earth,\\n\\t\\t\\t\\tsecure in our privileges,we are reminded of much greater\\n\\t\\t\\t\\tnations in the past, who failed in their duty and were\\n\\t\\t\\t\\twiped out. In their fate we must read our own fate, if we\\n\\t\\t\\t\\tfail likewise! But those without faith, instead of facing\\n\\t\\t\\t\\tfacts squarely \"turn away therefrom.\" A) Qirtas, in the\\n\\t\\t\\t\\tApostle's life, could only mean \"parchment,\" which was\\n\\t\\t\\t\\tcommonly used as writing material in Western Asia from\\n\\t\\t\\t\\tthe 2nd century B.C. The word was derived from the Greek,\\n\\t\\t\\t\\tCharles (Cf. Latin, \"Charta\"). Paper, as we know it, made\\n\\t\\t\\t\\tfrom rags, was first used by the Arabs after the conquest\\n\\t\\t\\t\\tof Samarqand in 751 A.D. The Chinese had used it by the\\n\\t\\t\\t\\t2nd century B.C. The Arabs introduced it into Europe; it\\n\\t\\t\\t\\twas used in Greece in the 11th and 12th century, and in\\n\\t\\t\\t\\tSpain through Sicily in the 12th century. The Papyrus,\\n\\t\\t\\t\\tmade from an Egyptian reed, was in Egypt as early as 2500\\n\\t\\t\\t\\tB.C. It gave place to paper in Egypt in the 10th century."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "7",
    "NoteID": "840",
    "Body": "The materialists want to see actual physical material\\n\\t\\t\\t\\tthings before them, but if such a thing came from an\\n\\t\\t\\t\\tunusual source or expressed things they cannot\\n\\t\\t\\t\\tunderstand, they give it some name like magic, or\\n\\t\\t\\t\\tsuperstition, or whatever name is in fashion, and they\\n\\t\\t\\t\\tare not helped at all in attaining faith, because their\\n\\t\\t\\t\\t\"hearts are diseased\" (ii. 10)"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "8",
    "NoteID": "841",
    "Body": "Cf. ii. 210. An angel is a heavenly being, a\\n\\t\\t\\t\\tmanifestation of God's glory, invisible to men who live\\n\\t\\t\\t\\tgross material lives. Such men are given plenty of\\n\\t\\t\\t\\trespite in which to turn in repentance to God and make\\n\\t\\t\\t\\ttheselves worthly of His light. But if their prayer to\\n\\t\\t\\t\\tsee an angel were grated, it would do them no good, for\\n\\t\\t\\t\\tthy would be destroyed as darkness is destroyed by light."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "9",
    "NoteID": "842",
    "Body": "Supposing an angel should appear to their grosser senses,\\n\\t\\t\\t\\the could only do it in human form. In that case their\\n\\t\\t\\t\\tpresent confused notions about spiritual life would be\\n\\t\\t\\t\\tstill more confounded. They would say: \"We wanted to see\\n\\t\\t\\t\\tan angel, and we have only seen a man!\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "10",
    "NoteID": "843",
    "Body": "\"The scoffers were mocked by the thing that they mocked\"\\n\\t\\t\\t\\twould express epigrammatically part of the sense, but not\\n\\t\\t\\t\\tthe whole. \"Hemmed in\" implies that the logic of events\\n\\t\\t\\t\\tturned the tables, and as a man might be besieged and\\n\\t\\t\\t\\tsurrounded by an enemy in war, and would be forced to\\n\\t\\t\\t\\tsurrender, so these mockers will find that events would\\n\\t\\t\\t\\tjustify Truth, not them. The mockers of Jesus, - where\\n\\t\\t\\t\\twere they when Titus detroyed Jerusalem? The mockers who\\n\\t\\t\\t\\tdrove out Muhammad from Mecca, - what was their plight\\n\\t\\t\\t\\twhen Muhammad came back in triumph and they sued for\\n\\t\\t\\t\\tmercy, - and he gave it to them! According to the Latin\\n\\t\\t\\t\\tproverb, Great is Truth, and must prevail."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "12",
    "NoteID": "844",
    "Body": "History, travel, human eperience, all prove the Mercy of\\n\\t\\t\\t\\tGod and the law that without it those who reject Truth\\n\\t\\t\\t\\ttend to lose their own souls and destroy themselves."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "13",
    "NoteID": "845",
    "Body": "Sakan=(1) to dwell; (2) to rest, to be still, to stop\\n\\t\\t\\t\\t(moving), to lurk; (3) to be quiescent, as a letter which\\n\\t\\t\\t\\tis not moved with a vowel. If we imagine Night and Day to\\n\\t\\t\\t\\tbe places, and each to have (dwelling in them) things\\n\\t\\t\\t\\tthat are open and things that are concealed, things that\\n\\t\\t\\t\\tmove and things that are still, things that are sounded\\n\\t\\t\\t\\tand things that are quiescent, we get some ida of the\\n\\t\\t\\t\\timagery implied. The mystery of Time (which seems more\\n\\t\\t\\t\\tabstract than Space) is thus explained and illustrated by\\n\\t\\t\\t\\tthe idea of Place or Space, which also is a notion and\\n\\t\\t\\t\\tnot a concrete thing. But He Who has control of all these\\n\\t\\t\\t\\tthings is the one true God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "13",
    "NoteID": "846",
    "Body": "Throughout this section we have a sort of implied\\n\\t\\t\\t\\tdialogue, of which one part is understood from the other\\n\\t\\t\\t\\tpart, which is expressed. In verse 11, we might have an\\n\\t\\t\\t\\timagery objector saying: \"Why go back to the past?\" The\\n\\t\\t\\t\\tanswer is: \"Well, travel through the world, and see\\n\\t\\t\\t\\twhether it is not true that virtue and godliness exalt a\\n\\t\\t\\t\\tnation, and the opposite are causes of ruin. Both the\\n\\t\\t\\t\\tpast and the present prove this.\" In verse 12 the\\n\\t\\t\\t\\tobjector may say: \"But you speak of God's power?\" The man\\n\\t\\t\\t\\tof God replies: \"Yes, but Mercy is God's own attribute,\\n\\t\\t\\t\\tand knowledge and wisdom beyond what man can conceive.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "14",
    "NoteID": "847",
    "Body": "Feedeth but is not fed: true both literally and\\n\\t\\t\\t\\tfiguratively. To God we owe the satisfaction of all\\n\\t\\t\\t\\tneeds, but He is independent of all needs."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "16",
    "NoteID": "848",
    "Body": "We continue the implied dialogue suggested in n. 846. In\\n\\t\\t\\t\\tverse 14, the objector might say: \"But we have other\\n\\t\\t\\t\\tinterests in life than religion and God.\" \"No,\" says the\\n\\t\\t\\t\\tman of God, \"My Creator is the one and only Power whose\\n\\t\\t\\t\\tprotection I seek; and I strive to be first in the race.\"\\n\\t\\t\\t\\tIn verse 15, the objector suggests: \"enjoy the good\\n\\t\\t\\t\\tthings of this life; it is short.\" The answer is: \"The\\n\\t\\t\\t\\tHereafter is more real to me, and promises the true\\n\\t\\t\\t\\tfulfilment of all desire; happiness or affliction comes\\n\\t\\t\\t\\tnot from the fleeting pettinesses or illusions of this\\n\\t\\t\\t\\tlife, but from the power and wisdom of God.\" In verse 19,\\n\\t\\t\\t\\tthe objector makes his final splash: \"What evidence is\\n\\t\\t\\t\\tthere for all this?\" The reply is: \"I know it is true,\\n\\t\\t\\t\\tfor God's voice is within me, and my living Teacher\\n\\t\\t\\t\\tawakens that voice; and there is the Book of Inspiration.\\n\\t\\t\\t\\tGod is one, and there is none other besides.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "17",
    "NoteID": "849",
    "Body": "The vulgar worship of false gods out of fear that they\\n\\t\\t\\t\\twould harm them or hope that they would confer some\\n\\t\\t\\t\\tbenefit on them. These false gods can do neither. All\\n\\t\\t\\t\\tpower, all goodness is in the hands of the One True God.\\n\\t\\t\\t\\tAll else is pretence or illusion."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "20",
    "NoteID": "850",
    "Body": "Cf. ii. 146 and n. 151. In both passages the pronoun\\n\\t\\t\\t\\ttranslated \"this\" may mean \"him\" and refer to Muhammad\\n\\t\\t\\t\\tthe Apostle of God, as some commentators think."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "23",
    "NoteID": "851",
    "Body": "Fitnat has various meanings, from the root idea of \"to\\n\\t\\t\\t\\ttry , to test, to tempt;\" e.g. (1) a trial or temptation,\\n\\t\\t\\t\\tas in ii. 102; (2) trouble, tumult, oppression,\\n\\t\\t\\t\\tpersecution, as in ii. 191, 193, 217; (3) discord, as in\\n\\t\\t\\t\\tiii. 7; (4) subterfuge, an answer that amounts to a\\n\\t\\t\\t\\tsedition, and excuse founded on a falsehod, as here.\\n\\t\\t\\t\\tOther shades of meaning wll be noticed as they occur.\\n\\t\\t\\t\\tThose who blasphemed God in imagining false gods will now\\n\\t\\t\\t\\tsee the vanity of their imaginations for themselves. What\\n\\t\\t\\t\\tanswer can they give now? In their perverisity they will\\n\\t\\t\\t\\tdeny that they ever entertained the notion of false gods."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "24",
    "NoteID": "852",
    "Body": "The lies whch they used to tell have now \"wandered\" from\\n\\t\\t\\t\\tthe channels which they use to occupy, and left the liars\\n\\t\\t\\t\\tin the lurch. In denying the indubitable fact that they\\n\\t\\t\\t\\ttook false gods, they admit the falsity of their notions\\n\\t\\t\\t\\tand thus are practically convicted out of their own\\n\\t\\t\\t\\tmouths. A) It=The Qur-an."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "28",
    "NoteID": "853",
    "Body": "Their falsity was not due to want of knowledge, but to\\n\\t\\t\\t\\tperversity and selfishness. In their heart was a disease\\n\\t\\t\\t\\t(ii. 10): therefore neither their understanding, nor\\n\\t\\t\\t\\ttheir ears, nor their eyes do their proper work. They\\n\\t\\t\\t\\ttwist what they see, hear, or are taught, and go deeper\\n\\t\\t\\t\\tand deeper into the mire. The deceptions which they used\\n\\t\\t\\t\\tto practise on other people will, before the Seat of\\n\\t\\t\\t\\tJudgement, become clear in their own eyes."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "31",
    "NoteID": "854",
    "Body": "Grievous is the burden of sins which the wicked will bear\\n\\t\\t\\t\\ton their backs when they become conscious of them. Some\\n\\t\\t\\t\\tcommentators personify Sins as ugly Demons riding on the\\n\\t\\t\\t\\tbacks of men, while the men's Good Deeds become the\\n\\t\\t\\t\\tstrong and patient mounts which will carry the men on\\n\\t\\t\\t\\ttheir backs. If the Good Deeds are few and the Sins many,\\n\\t\\t\\t\\tthe man and his Good Deeds will be crushed under the load\\n\\t\\t\\t\\tof the Evil which they carry."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "32",
    "NoteID": "855",
    "Body": "Play and amusement are for preparing our minds for the\\n\\t\\t\\t\\tserious things of life: in themselves they are not\\n\\t\\t\\t\\tserious. So this life is a preparation for the Eternal\\n\\t\\t\\t\\tHome to which we are going, which is far more important\\n\\t\\t\\t\\tthan the ephemeral pleasures which may possibly seduce us\\n\\t\\t\\t\\tin this life."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "35",
    "NoteID": "856",
    "Body": "There were many signs of a divine Mission in the\\n\\t\\t\\t\\tApostle's life and in the Message which he delivered. If\\n\\t\\t\\t\\tthese did not convince the Unbelievers, was it not vain\\n\\t\\t\\t\\tto seek a miraculous Sign from the bowels ofthe earth or\\n\\t\\t\\t\\tby a visible ascent to the skies? If in the Apostle's\\n\\t\\t\\t\\teagerness to get all to accept his Mesage he was hurt at\\n\\t\\t\\t\\ttheir callousness, active opposition, and persecution of\\n\\t\\t\\t\\thim, he is told that a full knowledge of the working of\\n\\t\\t\\t\\tGod`s Plan would convince him that impatience was\\n\\t\\t\\t\\tmisplaced. This was in the days of persecution before the\\n\\t\\t\\t\\tHijrat. The history in Medina and shows how Allah's truth\\n\\t\\t\\t\\twas ultimately and triumphantly vindicated. Who among the\\n\\t\\t\\t\\tsincere devotees of Muhammad can fail to read vi. 33-35\\n\\t\\t\\t\\twithout tears in his eyes?"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "36",
    "NoteID": "857",
    "Body": "There is a double meaning here. (1) If people listen to\\n\\t\\t\\t\\ttruth sincerely and earnestly, they must believe; even if\\n\\t\\t\\t\\tthe spiritual faculty is dead, God will by His grace\\n\\t\\t\\t\\trevive it and they will come to Him, if they really try\\n\\t\\t\\t\\tearnestly to understand. (2) The sincere will believe;\\n\\t\\t\\t\\tbut those whose hearts are dead will not listen, yet they\\n\\t\\t\\t\\tcannot escape being brought to the Judgement Seat before\\n\\t\\t\\t\\thim."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "37",
    "NoteID": "858",
    "Body": "Sins are all around them, but they do not understand. If\\n\\t\\t\\t\\tthey want a particular Sign to suit their gross\\n\\t\\t\\t\\tignorance, they will not be humoured, for they can always\\n\\t\\t\\t\\tpick holes in anything that descends to their level."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "38",
    "NoteID": "859",
    "Body": "\"Animals living on the earth\" include those living in the\\n\\t\\t\\t\\twater, - fishes, reptiles, crustaceans, insects, as well\\n\\t\\t\\t\\tas four-footed beasts. Life on the wing is separately\\n\\t\\t\\t\\tmentioned. \"Tair,\" which is ordinarily translated as\\n\\t\\t\\t\\t\"bird,\" is anything that flies, including mammals like\\n\\t\\t\\t\\tbats. In our pride we may exclude animals from our\\n\\t\\t\\t\\tpurview, but they all live a life, social and individual,\\n\\t\\t\\t\\tlike ourselves, and all life is subject to the Plan and\\n\\t\\t\\t\\tthe Will of God. In vi. 59 we are told that not a leaf\\n\\t\\t\\t\\tfalls but by His Will, and things dry and green are\\n\\t\\t\\t\\trecorded in His Book. In other words they all obey His\\n\\t\\t\\t\\tarchetypal Plan, the Book which is also mentioned here.\\n\\t\\t\\t\\tThey are all answerable in their several degrees to His\\n\\t\\t\\t\\tPlan (\"shall be gathered to their Lord in the end\"). This\\n\\t\\t\\t\\tis not Pantheism: it is ascribing all life, activity, and\\n\\t\\t\\t\\texistence to the Will and Plan of God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "39",
    "NoteID": "860",
    "Body": "The limited free will of man makes a little difference.\\n\\t\\t\\t\\tIf he sees the Signs but shuts his ears to the true\\n\\t\\t\\t\\tMessage, and refuses (like a dumb thing) to speak out the\\n\\t\\t\\t\\tMessage which all Nature proclaims, then according to the\\n\\t\\t\\t\\tPlan ( of his limited free-will) he must suffer and\\n\\t\\t\\t\\twander, just as, in the opposite case, he will receive\\n\\t\\t\\t\\tgrace and salvation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "43",
    "NoteID": "861",
    "Body": "Sorrow and suffering may (if we take them rightly) turn\\n\\t\\t\\t\\tout to be the best gifts of God to us. According to the\\n\\t\\t\\t\\tPsalms (xciv. 12), \"Blessed is the man whom Thou\\n\\t\\t\\t\\tchastenest, O Lord!\" Through suffering we learn humility,\\n\\t\\t\\t\\tthe antidote to many vices and the fountain of many\\n\\t\\t\\t\\tvirtues. But if we take them the wrong way, we grumble\\n\\t\\t\\t\\tand complain: we become faint-hearted; and Satan gets his\\n\\t\\t\\t\\toppurtunity to exploit us by putting forward the alluring\\n\\t\\t\\t\\tpleasures of his Vanity Fair."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "44",
    "NoteID": "862",
    "Body": "Learning the inner truth of ourselves and the world\\n\\t\\t\\t\\tpresupposes a certain advanced stage of sensitiveness and\\n\\t\\t\\t\\tspiritual development. There is a shallower stage, at\\n\\t\\t\\t\\twhich prosperity and the good things of life may teach us\\n\\t\\t\\t\\tsympathy and goodness and cheerfulness like that of Mr.\\n\\t\\t\\t\\tCheeribyles in Dickens. In such cases the Message takes\\n\\t\\t\\t\\troot. But there is another type of character which is\\n\\t\\t\\t\\tpuffed up in prosperity. For them prosperity is a trial\\n\\t\\t\\t\\tor even a punishment from the higher point of view. They\\n\\t\\t\\t\\tgo deeper and deeper into sin, until they are pulled up\\n\\t\\t\\t\\tof a sudden, and then instead of being contrite they\\n\\t\\t\\t\\tmerely become desperate."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "45",
    "NoteID": "863",
    "Body": "God's punishment of wrong-doers is a measure of justice,\\n\\t\\t\\t\\tto protect the true and righteous from their depredations\\n\\t\\t\\t\\tand maintain His righteous decrees. It is an aspect of\\n\\t\\t\\t\\tHis character which is emphasised by the epithet\\n\\t\\t\\t\\t\"Cherisher of the Worlds.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "46",
    "NoteID": "864",
    "Body": "Cf ii. 7 and n."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "47",
    "NoteID": "865",
    "Body": "Suddenly=without warning. Openly=with many warnings, even\\n\\t\\t\\t\\tto the sinners, though they heed them not. As to those\\n\\t\\t\\t\\twho understand and read the signs of God, they could\\n\\t\\t\\t\\talways tell that all wrong-doing must eventually have its\\n\\t\\t\\t\\tpunishment. But it will affect the wrong-doers, not the\\n\\t\\t\\t\\trighteous. It is justice, not revenge."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "48",
    "NoteID": "866",
    "Body": "The Apostles are not sent to cancel man's limited\\n\\t\\t\\t\\tfree-will. They are sent to preach and teach, - to preach\\n\\t\\t\\t\\thope to the repentant (\"good news\"), and to warn the\\n\\t\\t\\t\\trebellious of the Wrath to come."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "50",
    "NoteID": "867",
    "Body": "Literally it might mean that the men of God are not like\\n\\t\\t\\t\\tvulgar soothsayers, who pretend to reveal hidden\\n\\t\\t\\t\\ttreasures, or peer into future, or claim to be something\\n\\t\\t\\t\\tof a different nature from men. But the meaning is wider:\\n\\t\\t\\t\\tThey deal out God's great treasures of truth, but the\\n\\t\\t\\t\\ttreasures are not theirs, but God's; they have greater\\n\\t\\t\\t\\tinsight into the higher things, but that insight is not\\n\\t\\t\\t\\tdue to their own wisdom, but to God's inspiration; they\\n\\t\\t\\t\\tare of the same flesh and blood with us, and the\\n\\t\\t\\t\\tsublimity of their words and teaching arises through\\n\\t\\t\\t\\tGod's grace- to them and to those who hear them."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "50",
    "NoteID": "868",
    "Body": "Therefore compare not the men of God (\"the seeing\") with\\n\\t\\t\\t\\tordinary men (\"the blind\"). The men of God, although they\\n\\t\\t\\t\\tbe but men, have the higher light with them; therefore do\\n\\t\\t\\t\\tnot exact of them petty ephemeral services. Though they\\n\\t\\t\\t\\tare men, they are not as other men, and are entitled to\\n\\t\\t\\t\\treverence."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "51",
    "NoteID": "869",
    "Body": "There are some men - sinners - who yet believe in\\n\\t\\t\\t\\tJudgement; let them be warned of their personal\\n\\t\\t\\t\\tresponsibility to guard against evil; let them not rely\\n\\t\\t\\t\\tupon protectors or intercessors before God; their sins\\n\\t\\t\\t\\tcan only be forgiven by God's own Mercy."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "52",
    "NoteID": "870",
    "Body": "Face: wajh: see ii. 112 and n. 114. \"Face\" is used for\\n\\t\\t\\t\\tGod's Grace or presence, the highest aim of spiritual\\n\\t\\t\\t\\taspiration."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "52",
    "NoteID": "871",
    "Body": "Some of the rich and influential Quraish thought it\\n\\t\\t\\t\\tbeneath their dignity to listen to Muhammad's teaching in\\n\\t\\t\\t\\tcompany with the lowly disciples, who were gathered round\\n\\t\\t\\t\\thim. But he refused to send away these lowly disciples,\\n\\t\\t\\t\\twho were sincere seekers after God. From a worldly point\\n\\t\\t\\t\\tof view they had nothing to gain from Muhammad as he was\\n\\t\\t\\t\\thimself poor and he had nothing to gain from them as they\\n\\t\\t\\t\\thad no influence. But that was no reason for turning them\\n\\t\\t\\t\\taway; indeed their true sincerity entitled them to\\n\\t\\t\\t\\tprecedence over wordly men in the kingdom of God, whose\\n\\t\\t\\t\\tjustice was vindicated in Muhammad's daily life in this\\n\\t\\t\\t\\tas in other things. If their sincerity was in any way\\n\\t\\t\\t\\tdoubtful, it involved no reponsibility for the Preacher."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "53",
    "NoteID": "872",
    "Body": "Pursue the argument of the last note. The influential\\n\\t\\t\\t\\tpeople who were not given precedence over the poor and\\n\\t\\t\\t\\thumble but sincere disciples, were on their trial as to\\n\\t\\t\\t\\ttheir spiritual insight. Their temptation was to say (and\\n\\t\\t\\t\\tthey said it in scorn): \"We are much greater than they:\\n\\t\\t\\t\\thas God then selected these lowly people for His\\n\\t\\t\\t\\tteaching?\" But that was so. And God knew best those who\\n\\t\\t\\t\\twere grateful to Him for His guidance."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "54",
    "NoteID": "873",
    "Body": "The humble who had sincere faith, were not only not sent\\n\\t\\t\\t\\taway to humour the wealthy: they were honoured and were\\n\\t\\t\\t\\tgiven a special salutation, which has become the\\n\\t\\t\\t\\tcharacteristic salutation in Islam: \"Peace be on\\n\\t\\t\\t\\tyou,\"-the word peace, \"salam\" having special affinity\\n\\t\\t\\t\\twith the word \"Islam.\" In words they are given the\\n\\t\\t\\t\\tsalutation; in life they are promised Mercy by the\\n\\t\\t\\t\\tspecial grace of God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "54",
    "NoteID": "874",
    "Body": "Cf. vi 12."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "55",
    "NoteID": "875",
    "Body": "If the way of the sinners (in jealousy and worldly pride)\\n\\t\\t\\t\\tis shown up, and details are given how to honour the\\n\\t\\t\\t\\ttruly sincere, it forms the best illustration of the\\n\\t\\t\\t\\tteaching of God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "56",
    "NoteID": "876",
    "Body": "There are a number of arguments now put forward against\\n\\t\\t\\t\\tthe Meccans who refused to believe in God's Message. Each\\n\\t\\t\\t\\targument is introduced with the word \"Say.\" Here are the\\n\\t\\t\\t\\tfirst four: (1) I have received Light and will follow it;\\n\\t\\t\\t\\t(2) I prefer my Light to your vain desires; (3) Your\\n\\t\\t\\t\\tchallenge-\" if there is a God, why does He not finish the\\n\\t\\t\\t\\tblasphemers at once?\" -it is not for me to take up;\\n\\t\\t\\t\\tpunishment rests with God; (4) If it rested with me, it\\n\\t\\t\\t\\twould be for me to take up your challenge; all I know is\\n\\t\\t\\t\\tthat God is not unaquainted with the existance of folly\\n\\t\\t\\t\\tand wickedness, and many other things besides, that no\\n\\t\\t\\t\\tmortal can know; you can see little glimpses of His Plan,\\n\\t\\t\\t\\tand you can be sure that He will not be tardy in calling\\n\\t\\t\\t\\tyou to account."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "57",
    "NoteID": "877",
    "Body": "What ye would see hastened: what ye, deniers of God, are\\n\\t\\t\\t\\tso impatient about: the punishment which ye mockingly say\\n\\t\\t\\t\\tdoes not come to you. Cf. xiii. 6."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "58",
    "NoteID": "878",
    "Body": "The Messenger of God is not here to settle scores with\\n\\t\\t\\t\\tthe wicked. It is not a matter between them and him. It\\n\\t\\t\\t\\tis a matter between them and God; he is only a warner\\n\\t\\t\\t\\tagainst sin, and a declarer of the gospel of salvation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "59",
    "NoteID": "879",
    "Body": "Mafatih: Plural of either miftah= a key, or maftah= a\\n\\t\\t\\t\\ttreasure. Both meanings are implied, and I have\\n\\t\\t\\t\\taccordingly put both in my translation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "59",
    "NoteID": "880",
    "Body": "This is the mystic Record, the archetypal Plan, the\\n\\t\\t\\t\\tEternal Law, according to which everything seen and\\n\\t\\t\\t\\tunseen is ordered and regulated. There is much mystic\\n\\t\\t\\t\\tdoctrine here, explained by beautiful metaphors and\\n\\t\\t\\t\\tillustrations. The simplest things in Nature are subject\\n\\t\\t\\t\\tto His Law. The fresh and the withered, the living and\\n\\t\\t\\t\\tthe lifeless-nothing is outside the Plan of His Creation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "60",
    "NoteID": "881",
    "Body": "As the rest of His Creation is subject to His Law and\\n\\t\\t\\t\\tPlan, so is man's life in every particular and at every\\n\\t\\t\\t\\tmoment, awake or asleep. The mystery of Sleep-\" the twin\\n\\t\\t\\t\\tbrother of death\" - is called the taking of our soul by\\n\\t\\t\\t\\tHim, with the record of all we have done in our waking\\n\\t\\t\\t\\tmoments, and this record sometimes appears to us in\\n\\t\\t\\t\\tconfused glimpses in dreams. By day we awaken again to\\n\\t\\t\\t\\tour activities, and so it goes on until we fufil the term\\n\\t\\t\\t\\tof our life appointed for this earth. Then comes the\\n\\t\\t\\t\\tother Sleep (death), with the longer record of our Day\\n\\t\\t\\t\\t(Life); and then, in the end comes the Resurrection and\\n\\t\\t\\t\\tJudgment, at which we see everything clearly and not as\\n\\t\\t\\t\\tin dreams, for that is the final Reality."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "61",
    "NoteID": "882",
    "Body": "Guarians: most commentators understand this to mean\\n\\t\\t\\t\\tguardian angels. The idea of guardianship is expressed in\\n\\t\\t\\t\\ta general term. God watches over us and guards us, and\\n\\t\\t\\t\\tprovides all kinds of agencies, material, moral, and\\n\\t\\t\\t\\tspiritual, to help our growth and development, keep us\\n\\t\\t\\t\\tfrom harm, and bring us nearer to our Destiny."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "61",
    "NoteID": "883",
    "Body": "Angel: the word used is rusul, the Sent Ones, -the same\\n\\t\\t\\t\\tword as for human Apostles and Messengers sent by God to\\n\\t\\t\\t\\tteach mankind. The agents who come to take our souls at\\n\\t\\t\\t\\tdeath are accurate in the performance of their duty. They\\n\\t\\t\\t\\tcome neither before nor after their appointed time, nor\\n\\t\\t\\t\\tdo they do it in any manner other than that fixed by the\\n\\t\\t\\t\\tCommand of God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "62",
    "NoteID": "884",
    "Body": "The only Reality: al-haqq, the Truth, the only True One.\\n\\t\\t\\t\\tThe point is that our illusions of the life of this lower\\n\\t\\t\\t\\tworld now vanish, when we are rendered back to God, from\\n\\t\\t\\t\\tWhom we came. And now we find that so far from the\\n\\t\\t\\t\\tresults of our actions being delayed, they follow more\\n\\t\\t\\t\\tswiftly than we can express in terms of Time. Here is the\\n\\t\\t\\t\\tanswer to the taunt of those who were impatient of the\\n\\t\\t\\t\\tworking of God's Plans (vi. 57-58)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "63",
    "NoteID": "885",
    "Body": "In continuation of the four heads of argument refered to\\n\\t\\t\\t\\tin n. 876, we have three more heads here in vi. 63-65:\\n\\t\\t\\t\\t(5) your calling upon Him in times of danger shows that\\n\\t\\t\\t\\tin the depths of your hearts you feel His need; (6) God's\\n\\t\\t\\t\\tProvidence saves you, and yet you ungratefully run after\\n\\t\\t\\t\\tfalse gods; (7) it is not only physical calamitites that\\n\\t\\t\\t\\tyou have to fear; your mutual discords and vengeances are\\n\\t\\t\\t\\teven more destructive, and only faith in God can save you\\n\\t\\t\\t\\tfrom them."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "63",
    "NoteID": "886",
    "Body": "Zulumat: dark recesses, terrrible lurking dangers, as in\\n\\t\\t\\t\\tdeserts or mountains, or forests, or seas."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "63",
    "NoteID": "887",
    "Body": "There are two readings, but they both ultimately yield\\n\\t\\t\\t\\tthe same meaning. (1) Khufyatan= silently, secretly, from\\n\\t\\t\\t\\tthe depth of your inner heart, suggesting unspeakable\\n\\t\\t\\t\\tterror. (2) Khifatan= out of terror or fear or reverence,\\n\\t\\t\\t\\tas in vii. 205."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "65",
    "NoteID": "888",
    "Body": "Calamities from above and below: such as storms and\\n\\t\\t\\t\\tblizzards, torrential rain, ect., or earthquakes, floods,\\n\\t\\t\\t\\tlandslides, etc."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "65",
    "NoteID": "889",
    "Body": "Cf. vi. 46, where this refrain commences the argument now\\n\\t\\t\\t\\tdrawing to a close."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "66",
    "NoteID": "890",
    "Body": "At the date of this revelation, the Apostle's people had\\n\\t\\t\\t\\tas a body not only rejected God's truth, but were\\n\\t\\t\\t\\tpersecuting it. The Apostle's duty was to deliver his\\n\\t\\t\\t\\tMessage, which he did. He was not reponsible for their\\n\\t\\t\\t\\tconduct. But he told them plainly that all warnings from\\n\\t\\t\\t\\tGod had their time limit, as they would soon find out,\\n\\t\\t\\t\\twithin a very few years. For the leaders of the\\n\\t\\t\\t\\tresisitance came to an evil end, and their whole system\\n\\t\\t\\t\\tof fraud and selfishness was destroyed, to make room for\\n\\t\\t\\t\\tthe purer Faith of Islam. Apart from that particular\\n\\t\\t\\t\\tapplication, there is the more general application, for\\n\\t\\t\\t\\tthe present time and for all time."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "68",
    "NoteID": "891",
    "Body": "Cf. iv. 140. If in any gathering truth is ridiculed, we\\n\\t\\t\\t\\tmust not sit in such company. If we find ourselves in it,\\n\\t\\t\\t\\tas soon as we realize it, we must show our disapproval by\\n\\t\\t\\t\\tleaving."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "69",
    "NoteID": "892",
    "Body": "\"Evil to him who evil thinks,\" or evil does. Every man is\\n\\t\\t\\t\\tresponsible for his own conduct. But the righteous have\\n\\t\\t\\t\\ttwo duties: (1) to protect themselves from infection, and\\n\\t\\t\\t\\t(2) to proclaim God's truth, for even in the most\\n\\t\\t\\t\\tunlikely circumstances, it is possible that it may have\\n\\t\\t\\t\\tsome effect."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "70",
    "NoteID": "893",
    "Body": "Cf. vi 32. where we are told that the life of this world\\n\\t\\t\\t\\tis mere play and amusement, and Religion and the\\n\\t\\t\\t\\tHereafter are the serious things that require our\\n\\t\\t\\t\\tattention. Worldly people reverse this because they are\\n\\t\\t\\t\\tdeceived by the allurements of this life. But their own\\n\\t\\t\\t\\tacts will find them out."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "70",
    "NoteID": "894",
    "Body": "We must never forget our own personal responsibility for\\n\\t\\t\\t\\tall we do, or deceive ourselves by the illusion of\\n\\t\\t\\t\\tvicarious atonement."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "71",
    "NoteID": "895",
    "Body": "In continuation of the seven heads of argument refered to\\n\\t\\t\\t\\tin nn. 876 and 885, we have here the final two heads: (8)\\n\\t\\t\\t\\tWho would, after receiving guidance from the living,\\n\\t\\t\\t\\teternal God, turn to lifeless idols? To do so would\\n\\t\\t\\t\\tindeed show that we were made into fools, wandering to a\\n\\t\\t\\t\\tprecipice; (9) therefore accept the only true guidance,\\n\\t\\t\\t\\tthe guidance of God, and obey his Law, for we shall have\\n\\t\\t\\t\\tto answer before His judgment-seat."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "73",
    "NoteID": "896",
    "Body": "The argument mounts up here, leading to the great insight\\n\\t\\t\\t\\tof Abraham the true in faith, who did not stop short at\\n\\t\\t\\t\\tthe wonders of nature, but penetrated \"from nature up to\\n\\t\\t\\t\\tnature's God.\" God not only created the heavens and the\\n\\t\\t\\t\\tearth: with every increase of knowledge we see in what\\n\\t\\t\\t\\ttrue and perfect proportions all Creation is held\\n\\t\\t\\t\\ttogether. Creatures are subject to Time, but the Creator\\n\\t\\t\\t\\tis not; His word is the key that opens the door of\\n\\t\\t\\t\\texistence. It is not only the starting point of\\n\\t\\t\\t\\texistence, but the whole measure and standard of Truth\\n\\t\\t\\t\\tand Right. There may possibly be, to our sight in this\\n\\t\\t\\t\\tgreat world, aberrations of human or other wills, but the\\n\\t\\t\\t\\tmoment the trumpet sounds for the last day, His judgement\\n\\t\\t\\t\\tseat will, with perfect justice, restore the dominion of\\n\\t\\t\\t\\tRight and Reality. For His knowledge and wisdom cover all\\n\\t\\t\\t\\treality."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "75",
    "NoteID": "897",
    "Body": "Now comes the story of Abraham. He lived among the\\n\\t\\t\\t\\tChaldeans, who had great knowledge of the stars and\\n\\t\\t\\t\\theavenly bodies. But he got beyond that physical world,\\n\\t\\t\\t\\tand saw the spiritual world behind. His ancestral idols\\n\\t\\t\\t\\tmeant nothing to him. That was the first step. But God\\n\\t\\t\\t\\ttook him many degrees higher. God showed him with\\n\\t\\t\\t\\tcertitude the spiritual glories behind the magnificent\\n\\t\\t\\t\\tpowers and laws of the physical universe."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "76",
    "NoteID": "898",
    "Body": "This allegory shows stages of Abraham'spiritual\\n\\t\\t\\t\\tenlightenment. It should not be supposed that he\\n\\t\\t\\t\\tliterally worshipped stars or heavenly bodies. Having\\n\\t\\t\\t\\tseen through the folly of ancestral idol worship, he\\n\\t\\t\\t\\tbegan to see the futility of worshipping distant\\n\\t\\t\\t\\tbeautiful things that shine, which the vulgar endue with\\n\\t\\t\\t\\ta power which does not reside in them. A type of such is\\n\\t\\t\\t\\ta star shining in the darkness of thenight. Superstition\\n\\t\\t\\t\\tmight read fortunes in it, but truer knowledge shows that\\n\\t\\t\\t\\tit rises and sets according to laws whose author is God.\\n\\t\\t\\t\\tAnd its light is extinguished in the broader light of\\n\\t\\t\\t\\tday. Its worship is therefore futile. It is not a Power,\\n\\t\\t\\t\\tmuch less the Supreme Power."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "77",
    "NoteID": "899",
    "Body": "Continuing the allegory, the moon, though she looks\\n\\t\\t\\t\\tbigger and brighter than the star, turns out on closer\\n\\t\\t\\t\\tknowledge, not only to set like the star, but to change\\n\\t\\t\\t\\ther shape from hour to hour, and even to depend for her\\n\\t\\t\\t\\tlight on some other body! How deceptive are appearances!\\n\\t\\t\\t\\tThat is not God! At that stage you begin to search for\\n\\t\\t\\t\\tsomething more reliable than appearances to the eye in\\n\\t\\t\\t\\tthe darkness of the night. You ask for guidance from God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "78",
    "NoteID": "900",
    "Body": "The next stage in the allegory is the sun. You are in the\\n\\t\\t\\t\\topen light of Day. Now you have the right clue. You see\\n\\t\\t\\t\\tthe biggest object in the heavens. But is it the biggest?\\n\\t\\t\\t\\tThere are thousands of stars in the universe bigger than\\n\\t\\t\\t\\tthe sun. And every day the sun appears and disappears\\n\\t\\t\\t\\tfrom your sight. Such is not the god who created you and\\n\\t\\t\\t\\tall these wonderful works of His. What folly to worship\\n\\t\\t\\t\\tcreatures, when we might turn to the true God? Let us\\n\\t\\t\\t\\tabjure all these follies and proclaim the one true God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "80",
    "NoteID": "901",
    "Body": "To continue Abraham's allegory: if spiritual\\n\\t\\t\\t\\tenlightenment go so far as to take a man beyond his\\n\\t\\t\\t\\tancestral worship, people will continue to dispute with\\n\\t\\t\\t\\thim. They will frighten him with the dire consequences of\\n\\t\\t\\t\\this dissent. What does he care? He has found the truth.\\n\\t\\t\\t\\tHe is free from superstitious fears, for has he not found\\n\\t\\t\\t\\tthe true God, without Whose Will nothing can happen? On\\n\\t\\t\\t\\tthe contrary he knows that it is the godless who have\\n\\t\\t\\t\\tjust grounds for fear. And he offers admonition to them,\\n\\t\\t\\t\\tand the arguments that should bring them the clearness of\\n\\t\\t\\t\\ttruth instead of the vagueness and mystery of\\n\\t\\t\\t\\tsuperstition, -the security of Faith instead of the\\n\\t\\t\\t\\thaunting fear of those who have no clear guidance."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "83",
    "NoteID": "902",
    "Body": "The spiritual education of Abraham raised him many\\n\\t\\t\\t\\tdegrees above his contemporaries, and he was expected to\\n\\t\\t\\t\\tuse that knowledge and dignity for preaching the truth\\n\\t\\t\\t\\tamong his own people."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "84",
    "NoteID": "903",
    "Body": "We have now a list of eighteen Apostles in four groups,\\n\\t\\t\\t\\tcovering the great Teachers accepted among the three\\n\\t\\t\\t\\tgreat religions based on Moses, Jesus, and Muhammad. The\\n\\t\\t\\t\\tfirst group to be mentioned is that of Abraham, his son\\n\\t\\t\\t\\tIssac, and Isaac's son Jacob. Abraham was the first to\\n\\t\\t\\t\\thave a Book. His Book is mentioned in Q. lxxxvii. 19,\\n\\t\\t\\t\\tthough it is now lost. They were therefore the first to\\n\\t\\t\\t\\treceive Guidance in the sense of a Book."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "84",
    "NoteID": "904",
    "Body": "In the second group, we have the great founders of\\n\\t\\t\\t\\tfamilies, apart from Abraham, viz., Noah of the time of\\n\\t\\t\\t\\tthe Flood; David and Solomon, the real establishers of\\n\\t\\t\\t\\tthe Jewish monarchy; Job, who lived 140 years, saw four\\n\\t\\t\\t\\tgenerations of descendants, and was blessed at the end of\\n\\t\\t\\t\\this life with large pastoral wealth (Job xlii. 16,12);\\n\\t\\t\\t\\tJoseph, who as Minister of State did great things in\\n\\t\\t\\t\\tEgypt and ws the progenitor of two Tribes; and Moses and\\n\\t\\t\\t\\tAaron, the leaders of the Exodus from Egypt. They led\\n\\t\\t\\t\\tactive lives and called \"doers of good.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "85",
    "NoteID": "905",
    "Body": "The third group consists not of men of action, but\\n\\t\\t\\t\\tPreachers of Truth, who led solitary lives. Their epithet\\n\\t\\t\\t\\tis: \"the Righteous.\" They form a connected group round\\n\\t\\t\\t\\tJesus. Zakariya was the father of John the Baptist, the\\n\\t\\t\\t\\tprecursor of Jesus (iii. 37-41); and Jesus referred to\\n\\t\\t\\t\\tJohn the Baptist as Elias, \"this is Elias, which was to\\n\\t\\t\\t\\tcome\" (Matt xi. 14); and Elias is said to have been\\n\\t\\t\\t\\tpresent and talked to Jesus at the Transfiguration on the\\n\\t\\t\\t\\tMount (Matt. xvii. 3). Elias is the same as Elijah."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "86",
    "NoteID": "906",
    "Body": "This is the last group, described as those \"favoured\\n\\t\\t\\t\\tabove the nations.\" It consists of four men who had all\\n\\t\\t\\t\\tgreat misfortunes to contend with, and were concerned in\\n\\t\\t\\t\\tthe clash of nations, but they kept in the path of God,\\n\\t\\t\\t\\tand came through above the clash of nations. Ismail was\\n\\t\\t\\t\\tthe eldest son of Abraham; when he was a baby, he and his\\n\\t\\t\\t\\tmother had nearly died of thirst in the desert round\\n\\t\\t\\t\\tMecca; but they were saved by the well of Zamzam, and\\n\\t\\t\\t\\tbecame the founder of the new Arab nation. Elisha\\n\\t\\t\\t\\t(Al-Yasa) succeeded to the mantle of the Prophet Elijah\\n\\t\\t\\t\\t(same as Elias,see last note); he lived in troublous\\n\\t\\t\\t\\ttimes for both the Jewish kingdoms (of Judah and Isreal);\\n\\t\\t\\t\\tthere were wicked kings, and other nations were pressing\\n\\t\\t\\t\\tin on them; but he performed many miracles, and some\\n\\t\\t\\t\\tcheck was given to the enemies under his advice. The\\n\\t\\t\\t\\tstory of Jonas (Yunus) is well-known: he was swallowed by\\n\\t\\t\\t\\ta fish or whale, but was saved by God's mercy: through\\n\\t\\t\\t\\this preaching, his city (Ninevah) was saved (x. 98). Lot\\n\\t\\t\\t\\twas a contemporary and nephew of Abraham: when the city\\n\\t\\t\\t\\tof Sodom was destroyed for its wickedness, he was saved\\n\\t\\t\\t\\tas a just man (vii. 80-84)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "87",
    "NoteID": "907",
    "Body": "I take verse 87 to refer back to all the four groups just\\n\\t\\t\\t\\tmentioned."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "89",
    "NoteID": "908",
    "Body": "Them, i.e., the Book, and authority and Prophethood. They\\n\\t\\t\\t\\twere taken away from the other People of the Book and\\n\\t\\t\\t\\tentrusted to the holy Apostle Muhammad and his People."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "91",
    "NoteID": "909",
    "Body": "Qadara: to weight, judge, or estimate the value or\\n\\t\\t\\t\\tcapacity of anything; to have power so to do. Cf. Qadir\\n\\t\\t\\t\\tin iv. 149 and n. 655. The Jews who denied the\\n\\t\\t\\t\\tinspiration of Muhammad had a good answer in their own\\n\\t\\t\\t\\tbooks about the inspiration of Moses. To those who do not\\n\\t\\t\\t\\tbelieve in Moses, the answer is more general: is it a\\n\\t\\t\\t\\tjust estimate of God to think either that He has not the\\n\\t\\t\\t\\tpower or the will to guide mankind, seeing that He is\\n\\t\\t\\t\\tOmnipotent and the Source of all good? If you say that\\n\\t\\t\\t\\tguidance comes, not through an inspired book or man, but\\n\\t\\t\\t\\tthrough our general intelligence, we point to the\\n\\t\\t\\t\\tspiritual ignorance of \"you and your ancestors\" the sad\\n\\t\\t\\t\\tspiritual darkness of men and nations high in the\\n\\t\\t\\t\\tintellectual scale."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "91",
    "NoteID": "910",
    "Body": "Cf. v. 47 and n. 750, and v. 49. In those passages\\n\\t\\t\\t\\tGuidance (in practical conduct) is put before Light (or\\n\\t\\t\\t\\tspiritual insight), as they refer to ordinary or average\\n\\t\\t\\t\\tmen. Here Light (or spiritual insight) is put first as\\n\\t\\t\\t\\tthe question is: does God send inspiration?"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "91",
    "NoteID": "911",
    "Body": "The Message to Moses had unity: it was one Book. The\\n\\t\\t\\t\\tpresent Old Testament is a collection of odd books\\n\\t\\t\\t\\t(\"sheets\") of various kinds: see Appendix II. end of S.\\n\\t\\t\\t\\tv. In this way you can make a show, but there is no\\n\\t\\t\\t\\tunity, and much of the spirit is lost or concealed or\\n\\t\\t\\t\\toverlaid. The same applies to the New Testament: see\\n\\t\\t\\t\\tAppendix III, after Appendix II."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "92",
    "NoteID": "912",
    "Body": "Mubarak: blessed, as having received God's blessing;\\n\\t\\t\\t\\tbringer of blessings to others, as having been blessed by\\n\\t\\t\\t\\tGod. God's highest blessing is the Guidance and Light\\n\\t\\t\\t\\twhich the Book brings to us, and which brings us nearer\\n\\t\\t\\t\\tto Him."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "92",
    "NoteID": "913",
    "Body": "Mother of Cities: Mecca, now the Qibla and Centre of\\n\\t\\t\\t\\tIslam. If this verse was (like the greater part of the\\n\\t\\t\\t\\tChapter) revealed in Mecca before the Hijrat, and before\\n\\t\\t\\t\\tMecca was made the Qibla of Islam, Mecca was nonetheless\\n\\t\\t\\t\\tthe Mother of Cities, being traditionally associated with\\n\\t\\t\\t\\tAbraham and with Adam and Eve (see ii. 125, and n. 217 to\\n\\t\\t\\t\\tii. 197). All round Mecca: would mean, the whole world if\\n\\t\\t\\t\\twe look upon Mecca as the centre."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "92",
    "NoteID": "914",
    "Body": "An earnest study of the Qur-an is true worship; so is\\n\\t\\t\\t\\tPrayer, and so are all deeds of goodness and charity."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "93",
    "NoteID": "915",
    "Body": "Yield up your souls: or \"get your souls to come out of\\n\\t\\t\\t\\tyour bodies.\" The wicked, we may suppose, are not anxious\\n\\t\\t\\t\\tto part with the material existence in their bodies for\\n\\t\\t\\t\\tthe \"reward\" which in irony is stated to be there to\\n\\t\\t\\t\\twelcome them."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "94",
    "NoteID": "916",
    "Body": "Some of the various ideas connected with \"creation\" are\\n\\t\\t\\t\\tnoted in n. 120 to ii. 117. In the matter of creation of\\n\\t\\t\\t\\tman there are various processes. If his body was created\\n\\t\\t\\t\\tout of clay, i.e. earthy matter, there was an earlier\\n\\t\\t\\t\\tpreocess of the creation of such earthy matter. Here the\\n\\t\\t\\t\\tbody is left behind, and the soul is being addressed. The\\n\\t\\t\\t\\tsoul underwent various processes of fashioning and\\n\\t\\t\\t\\tadapting to its various functions in its various\\n\\t\\t\\t\\tsurroundings (xxxii. 7-9). But each individual soul, afer\\n\\t\\t\\t\\trelease from the body, comes back as it was created, with\\n\\t\\t\\t\\tnothing more than it history, \"the deeds which it has\\n\\t\\t\\t\\tearned,\" which are really a part of it. Any exterior\\n\\t\\t\\t\\tthings given to help in its development, \"the favours\\n\\t\\t\\t\\twhich We bestowed on you,\" it must necessarily leave\\n\\t\\t\\t\\tbehind, however it may have been proud of them. These\\n\\t\\t\\t\\texterior things may be material things, e.g. wealth,\\n\\t\\t\\t\\tproperty, signs of power, influence and pride such as\\n\\t\\t\\t\\tsons, relatives, and friends, etc., or they may be\\n\\t\\t\\t\\tintangible things, like talents, intellect, social gifts,\\n\\t\\t\\t\\tetc."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "94",
    "NoteID": "917",
    "Body": "The false ideas of intercessors, demi-gods, gods,\\n\\t\\t\\t\\tsaviours, etc., now vanish like unsubstantial visions,\\n\\t\\t\\t\\t\"leaving not a wrack behind.\" Now the soul is face to\\n\\t\\t\\t\\tface with reality. Its personal responsibility is brought\\n\\t\\t\\t\\thome to it."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "95",
    "NoteID": "918",
    "Body": "Another beautiful nature passage, referring to God's\\n\\t\\t\\t\\twonderful artistry in His Creation. In how few and how\\n\\t\\t\\t\\tsimple words, the whole pageant of Creation is placed\\n\\t\\t\\t\\tbefore us. Beginning from our humble animal needs and\\n\\t\\t\\t\\tdependence on the vegetable world, we are asked to\\n\\t\\t\\t\\tcontemplate the interaction of the living and the dead.\\n\\t\\t\\t\\tHere is mystic teaching, referring not only to physical\\n\\t\\t\\t\\tlife but to the higher life above the physical plane,\\n\\t\\t\\t\\t-not only to individual life but to the collective life\\n\\t\\t\\t\\tof nations. Then we take a peep into the daily miracle of\\n\\t\\t\\t\\tmorning, noon, and night, and pass on to the stars that\\n\\t\\t\\t\\tguide the distant mariner. We rise still higher to the\\n\\t\\t\\t\\tmystery of the countless individuals from the one human\\n\\t\\t\\t\\tsoul, -their sojourn and their destiny. So we get back to\\n\\t\\t\\t\\tthe heavens: the description of th luscious fruits which\\n\\t\\t\\t\\tthe \"gentle rain from heaven\" produces, leaves us to\\n\\t\\t\\t\\tcontemplate the spiritual fruits which faith will provide\\n\\t\\t\\t\\tfor us,with the aid of the showers of God's mercy."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "95",
    "NoteID": "919",
    "Body": "The seed-grain and the date-stone are selected as types\\n\\t\\t\\t\\tin the vegetable kingdom, showing how our physical life\\n\\t\\t\\t\\tdepends on it. The fruits mentioned later (in vi 99)\\n\\t\\t\\t\\tstart another allegory which we shall notice later.\\n\\t\\t\\t\\tBotanists will notice that the seed-grain includes the\\n\\t\\t\\t\\tcereals (such as wheat, barley, rice, millet, etc.) which\\n\\t\\t\\t\\tare monocotyledons, as well as the pulses (such as beans,\\n\\t\\t\\t\\tpeas, gram, etc.) and other seeds which are dicotyledons.\\n\\t\\t\\t\\tThese two represent the most important classes of\\n\\t\\t\\t\\tfood-grains, while the date-palm, a monocotyledon,\\n\\t\\t\\t\\trepresents for Arabia both food, fruit, confectionery ,\\n\\t\\t\\t\\tthatch and pillars for houses, shady groves in oases, and\\n\\t\\t\\t\\ta standard measure of wealth and well being. \"Split and\\n\\t\\t\\t\\tsprout\": both ideas are included in the root falaqa, and\\n\\t\\t\\t\\ta third is expressed by the word \"cleave\" in the next\\n\\t\\t\\t\\tverse, for the action of evolving day-break from the\\n\\t\\t\\t\\tdark. I might almost have used the word \"churn,\" familiar\\n\\t\\t\\t\\tto students of Hindu lore in the Hindu allegory of the\\n\\t\\t\\t\\t\"churning of the ocean.\" For vegetables, \"split and\\n\\t\\t\\t\\tsprout\" represents a double process: (1) the seed\\n\\t\\t\\t\\tdivides, and (2) one part shoots up, seeking the light,\\n\\t\\t\\t\\tand forming leaves and the visible parts of the future\\n\\t\\t\\t\\ttree, and the other part digs down into the dark, forming\\n\\t\\t\\t\\tthe roots and seeking just that sustenance from the soil,\\n\\t\\t\\t\\twhich is adapted for the particular plant. This is just\\n\\t\\t\\t\\tone small instance of the \"judgement and ordering\" of\\n\\t\\t\\t\\tGod, referred to in the next verse."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "95",
    "NoteID": "920",
    "Body": "This does not mean that in physical nature there are no\\n\\t\\t\\t\\tlimits between life and non-life, between the organic and\\n\\t\\t\\t\\tthe non-organic. In fact physicists are baffled at the\\n\\t\\t\\t\\tbarrier between them and frankly confess that they cannot\\n\\t\\t\\t\\tsolve the mystery of Life. If there is such a barrier in\\n\\t\\t\\t\\tphysical nature, is it not all the more wonderful that\\n\\t\\t\\t\\tGod can create Life out of nothing? He has but to say,\\n\\t\\t\\t\\t\"Be,\" and it is. He can bring Life from non-Life and\\n\\t\\t\\t\\tannihilate Life. But there are two other senses in which\\n\\t\\t\\t\\twe can contemplate the contrast between the living and\\n\\t\\t\\t\\tthe dead. (1) We have just been speaking of the botanical\\n\\t\\t\\t\\tworld. Take it as a whole, and see the contrast between\\n\\t\\t\\t\\tthe winter of death, the spring of revivification, the\\n\\t\\t\\t\\tsummer of growth, and the autumn of decay, leading back\\n\\t\\t\\t\\tto the death of winter. Here is a cycle of living from\\n\\t\\t\\t\\tdead, and dead from living. (2) Take our spiritual life,\\n\\t\\t\\t\\tindividual or collective. We rise from the darkness of\\n\\t\\t\\t\\tspiritual nothingness to the light of spiritual life. And\\n\\t\\t\\t\\tif we do not follow the spiritual laws, God will take\\n\\t\\t\\t\\taway that life and we shall be again as dead. We may die\\n\\t\\t\\t\\tmany deaths. The keys of life and death are in God's\\n\\t\\t\\t\\thands. Neither Life nor Death are fortuitous things.\\n\\t\\t\\t\\tBehind them both is the Cause of Causes, -and only He."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "96",
    "NoteID": "921",
    "Body": "The night, the day, the sun, the moon, -the great\\n\\t\\t\\t\\tastronomical universe of God. How far, and yet how near\\n\\t\\t\\t\\tto us! God's universe is boundless, and we can barely\\n\\t\\t\\t\\tcomprehend even its relations to us. But this last we\\n\\t\\t\\t\\tmust try to do if we want to be numbered with \"the people\\n\\t\\t\\t\\twho know\". Taqdir: Cf. vi. 91 and n. 909, and iv. 149 and\\n\\t\\t\\t\\tn. 655."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "97",
    "NoteID": "922",
    "Body": "See the last note. At sea, or in the deserts or forests,\\n\\t\\t\\t\\tor \"in fairy scenes forlorn,\" -whenever we sweep over\\n\\t\\t\\t\\twide spaces, it is the stars that act as our guides, just\\n\\t\\t\\t\\tas the sun and moon have already been mentioned as our\\n\\t\\t\\t\\tmeasures of time."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "98",
    "NoteID": "923",
    "Body": "Produced: ansha-a= made you grow, increase, develop,\\n\\t\\t\\t\\treach maturity: another of the processes of creation.\\n\\t\\t\\t\\tThis supplements n. 120 to ii. 916 and n. 916 to vi. 94.\\n\\t\\t\\t\\tIt is one of the wonders of God's Creation, that from one\\n\\t\\t\\t\\tperson we have grown to be so many, and each individual\\n\\t\\t\\t\\thas so many faculties and capacities, and yet we are all\\n\\t\\t\\t\\tone. In the next verse we have the allegory of grapes and\\n\\t\\t\\t\\tother fruits: all grapes may be similar to look at, yet\\n\\t\\t\\t\\teach variety has a distinctive flavour and other\\n\\t\\t\\t\\tdistinctive qualities, and each individual grape may have\\n\\t\\t\\t\\tits own special qualities. So for man."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "98",
    "NoteID": "924",
    "Body": "In the sojourn of this life we must respond to God's hand\\n\\t\\t\\t\\tin fashioning us, by making full use of all our\\n\\t\\t\\t\\tfaculties, and we must get ready for our departure into\\n\\t\\t\\t\\tthe Life that will be eternal."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "99",
    "NoteID": "925",
    "Body": "Our allegory now brings us to maturity, the fruit, the\\n\\t\\t\\t\\tharvest, the vintage. Through the seed we came up from\\n\\t\\t\\t\\tnothingness to life; we lived our daily life of rest and\\n\\t\\t\\t\\twork and passed the mile-stones of time; we had the\\n\\t\\t\\t\\tspiritual experience of traversing through vast spaces in\\n\\t\\t\\t\\tthe spiritual world, guiding our course through the star\\n\\t\\t\\t\\tof Faith; we grew; and now for the harvest or the\\n\\t\\t\\t\\tvintage! How satisfied the grower must be when the golden\\n\\t\\t\\t\\tgrain is harvested in heaps or in vintage gathered! So\\n\\t\\t\\t\\twill man if he has produced the fruits of Faith!"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "99",
    "NoteID": "926",
    "Body": "Each fruit- whether it is grapes, or olives, or\\n\\t\\t\\t\\tpomegranates, -looks alike in its species, and yet each\\n\\t\\t\\t\\tvariety may be different in flavour, consistency, shape,\\n\\t\\t\\t\\tsize, colour, juice or oil contents, proportion of seed\\n\\t\\t\\t\\tto fruit, etc. In each variety, individuals may be\\n\\t\\t\\t\\tdifferent and yet equally valuable!"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "99",
    "NoteID": "927",
    "Body": "And so we finish this wonderful allegory. Search through\\n\\t\\t\\t\\tthe world's literature, and see if you can find another\\n\\t\\t\\t\\tsuch song or hymn, -so fruity in its literary flavour, so\\n\\t\\t\\t\\tprofound in its spiritual meaning!"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "99",
    "NoteID": "928",
    "Body": "There is a refrain in this song, which is subtly varied.\\n\\t\\t\\t\\tIn verse 97 it is: \" We detail our Signs for people who\\n\\t\\t\\t\\tknow.\" Se far we were speaking of the things we see\\n\\t\\t\\t\\taround us every day Knowledge is the appropriate\\n\\t\\t\\t\\tinstrument for these things. In verse 98 we read: \"We\\n\\t\\t\\t\\tdetail Our Signs for people who understand.\"\\n\\t\\t\\t\\tUnderstanding is a highter faculty than knowledge, and is\\n\\t\\t\\t\\tnecessary for seeing the mystery and meaning of this\\n\\t\\t\\t\\tlife. At the end of verse 99 we have: \"In these things\\n\\t\\t\\t\\tthere are Signs for people who believe.\" Here we are\\n\\t\\t\\t\\tspeaking of the real fruits of spiritual Life. For them\\n\\t\\t\\t\\tFaith is necessary, as bringing us nearer to God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "100",
    "NoteID": "929",
    "Body": "Jinns: who are they? In xviii. 50 we are told that Iblis\\n\\t\\t\\t\\twas one of the Jinns, and it is suggested that that was\\n\\t\\t\\t\\twhy he disobeyed the Command of God. But in that passage\\n\\t\\t\\t\\tand other similar passages, we are told that God\\n\\t\\t\\t\\tcommanded the angels to bow down to Adam, and they obeyed\\n\\t\\t\\t\\texcept Iblis. That implies that Iblis had been of the\\n\\t\\t\\t\\tcompany of angels. In many passages Jinns and men are\\n\\t\\t\\t\\tspoken of together. In lv. 14-15, man is stated to have\\n\\t\\t\\t\\tbeen created from clay, while Jinns from a flame of fire.\\n\\t\\t\\t\\tThe root meaning of junna, yujannu, is \"to be covered or\\n\\t\\t\\t\\thidden,\" and janna yajunnu, in the active voice, \"to\\n\\t\\t\\t\\tcover or hide,\" as in vi. 76. Some people say that jinn\\n\\t\\t\\t\\ttherefore means the hidden qualities or capacities in\\n\\t\\t\\t\\tman; others that it means wild or jungle folk hidden in\\n\\t\\t\\t\\tthe hills or forests. I do not wish to be dogmatic, but I\\n\\t\\t\\t\\tthink, from a collation and study of the Quranic\\n\\t\\t\\t\\tpassages, that the meaning is simply \"a spirit,\" or an\\n\\t\\t\\t\\tinvisible or hidden force. In folklore stories and\\n\\t\\t\\t\\tromances like the Arabian Nights they become personified\\n\\t\\t\\t\\tinto fantastic forms, but with them we are not concerned\\n\\t\\t\\t\\there."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "101",
    "NoteID": "930",
    "Body": "Cf. ii. 117, and n. 120."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "103",
    "NoteID": "931",
    "Body": "Latif: fine, subtle, so fine and subtle as to be\\n\\t\\t\\t\\tinvisible to the physical eye; so fine as to be\\n\\t\\t\\t\\timperceptiable to the senses; figuratively, so pure as to\\n\\t\\t\\t\\tbe above the mental or spiritual vision of ordinary men.\\n\\t\\t\\t\\tThe active meaning should also be understood: 'One who\\n\\t\\t\\t\\tunderstands the finest mysteries': Cf. xxii. 63, and n.\\n\\t\\t\\t\\t2844."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "104",
    "NoteID": "932",
    "Body": "I understand \"Say\" to be understood in the beginning of\\n\\t\\t\\t\\tthis verse. The words would then be the words of the\\n\\t\\t\\t\\tApostle, as in fact is suggested in verse 107 below. That\\n\\t\\t\\t\\tis why I have enclosed them in inverted commas."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "105",
    "NoteID": "933",
    "Body": "Cf. vi. 63, and n. 889."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "105",
    "NoteID": "934",
    "Body": "The teaching in the Qur-an explains things by various\\n\\t\\t\\t\\tsymbols, parables, narratives, and appeals to nature.\\n\\t\\t\\t\\tEach time, a new phase of the question is presented to\\n\\t\\t\\t\\tour minds. This is what a diligent and earnest teacher\\n\\t\\t\\t\\twould do, such as was Muhammad Mustafa. Those who were in\\n\\t\\t\\t\\tsearh of knowledge and had thus acquired some knowledge\\n\\t\\t\\t\\tof spiritual things were greatly helped to understand\\n\\t\\t\\t\\tmore clearly the things of which, before the varied\\n\\t\\t\\t\\texplanations, they had only one-sided knowledge."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "107",
    "NoteID": "935",
    "Body": "God's Plan is to use the human will to co-operate in\\n\\t\\t\\t\\tunderstanding Him and His relations to us. This is the\\n\\t\\t\\t\\tanswer to an objector who might say: \"If He is\\n\\t\\t\\t\\tAll-powered, why does sin or evil exist in the world? Can\\n\\t\\t\\t\\tHe not destroy it?\" He can, but His Plan is different,\\n\\t\\t\\t\\tand in any case it is not for a Teacher to force any one\\n\\t\\t\\t\\tto accept the truths which he is inspired to preach and\\n\\t\\t\\t\\tproclaim."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "108",
    "NoteID": "936",
    "Body": "A man's actual personal religion depends upon many\\n\\t\\t\\t\\tthings, -his personal psychology, the background of his\\n\\t\\t\\t\\tlife, his hidden or repressed feelings, tendencies, or\\n\\t\\t\\t\\thistory (which psychoanalysis tries to unravel), his\\n\\t\\t\\t\\thereditary dispositions or antipathies, and all the\\n\\t\\t\\t\\tsubtle influences of his education and his environment.\\n\\t\\t\\t\\tThe task before the man of God is: (1) to use any of\\n\\t\\t\\t\\tthese which can subserve the higher ends, (2) to purify\\n\\t\\t\\t\\tsuch as have been misused, (3) to introduce new ideas and\\n\\t\\t\\t\\tmodes of looking at things, and (4) to combat what is\\n\\t\\t\\t\\twrong and cannot be mended: all for the purpose of\\n\\t\\t\\t\\tleading to the truth and gradually letting in spiritual\\n\\t\\t\\t\\tlight where there was darkness before. If that is not\\n\\t\\t\\t\\tdone with discretion and the skill of a spiritual\\n\\t\\t\\t\\tTeacher, there may be not only a reaction of obstinacy,\\n\\t\\t\\t\\tbut an unseemly show of dishonour to the true God and His\\n\\t\\t\\t\\tTruth, and doubts would spread among the weaker brethren\\n\\t\\t\\t\\twhose faith is shallow and infirm. What happens to\\n\\t\\t\\t\\tindividuals is true collectively of nations or groups of\\n\\t\\t\\t\\tpeople. They think in their self-obsession that their own\\n\\t\\t\\t\\tideas are right. God in His infinite compassion bears\\n\\t\\t\\t\\twith them, and asks those who have purer ideas of faith\\n\\t\\t\\t\\tnot to vilify the weaknesses of their neighbours, lest\\n\\t\\t\\t\\tthe neighbours in their turn vilify the real truth and\\n\\t\\t\\t\\tmake matters even worse than before. In so far as there\\n\\t\\t\\t\\tis active evil, He will deal with it in His own way. Of\\n\\t\\t\\t\\tcourse the righteous man must not hide his light under a\\n\\t\\t\\t\\tbushel, or compromise with evil, or refuse to establish\\n\\t\\t\\t\\tright living where he has the power to do so."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "109",
    "NoteID": "937",
    "Body": "If the Unbelievers are merely obstinate, nothing will\\n\\t\\t\\t\\tconvince them. There is no story more full of miracles\\n\\t\\t\\t\\tthan the story of Jesus. Yet in that same story we are\\n\\t\\t\\t\\ttold that Jesus said: \"A wicked adulterous generation\\n\\t\\t\\t\\tseeketh after a sign; and there shall no sign be given\\n\\t\\t\\t\\tunto it, but the sign of the Prophet Jonas\": Matt. xvi.\\n\\t\\t\\t\\t4. There are Signs given by God every day -understood by\\n\\t\\t\\t\\tthose who believe. A mere insistence upon some particular\\n\\t\\t\\t\\tor special Sign meant mere contumacy and misunderstanding\\n\\t\\t\\t\\tof the spiritual world."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "110",
    "NoteID": "938",
    "Body": "Where there is sheer obstinacy and ridicule of faith, the\\n\\t\\t\\t\\tresult will be that such a sinner's heart will be\\n\\t\\t\\t\\thardened and his eyes will be sealed, so that he cannot\\n\\t\\t\\t\\teven see the things visible to ordinary mortals. The\\n\\t\\t\\t\\tsinner gathers impetus in his descent towards wrong."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "110",
    "NoteID": "939",
    "Body": "Cf. ii. 15. God's grace is always ready to help human\\n\\t\\t\\t\\tweakness or ignorance and to accept repentance and give\\n\\t\\t\\t\\tforgiveness. But where the sinner is in actual rebellion,\\n\\t\\t\\t\\the will be given none, and it will be his own fault if he\\n\\t\\t\\t\\twanders about distractedly, without any certain hope or\\n\\t\\t\\t\\trefuge."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "111",
    "NoteID": "940",
    "Body": "The most stupendous miracles even according to their\\n\\t\\t\\t\\tideas would not have convinced them. If the whole pageant\\n\\t\\t\\t\\tof the spiritual world were brought before them, they\\n\\t\\t\\t\\twould not have believed, because they -of their own\\n\\t\\t\\t\\tchoice and will -refuse knowledge and faith."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "112",
    "NoteID": "941",
    "Body": "What happened in the history of the Holy Prophet happens\\n\\t\\t\\t\\tin the history of all righteous men who have a Message\\n\\t\\t\\t\\tfrom God. The spirit of evil is ever active and uses men\\n\\t\\t\\t\\tto practice deception by means of highly embellished\\n\\t\\t\\t\\twords and plausible excuses and objections. God permits\\n\\t\\t\\t\\tthese things in His Plans. It is not for us to complain.\\n\\t\\t\\t\\tOur faith is tested, and we must stand the test\\n\\t\\t\\t\\tsteadfastly."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "113",
    "NoteID": "942",
    "Body": "People who have no faith in the future destiny of man may\\n\\t\\t\\t\\tlisten to and be taken in by the deceit of evil. If they\\n\\t\\t\\t\\ttake a delight in it, let them. See what they gain by it.\\n\\t\\t\\t\\tTheir gains will be as deceitful as their delight. For\\n\\t\\t\\t\\tthe end of evil must be evil."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "114",
    "NoteID": "943",
    "Body": "The righteous man seeks no other standard of judgement\\n\\t\\t\\t\\tbut God's Will. How can he, when god in His grace has\\n\\t\\t\\t\\texplained His Will in the Qur-an, with details which men\\n\\t\\t\\t\\tof every capacity can understand? The humblest can learn\\n\\t\\t\\t\\tlessons of right conduct in daily life, and the most\\n\\t\\t\\t\\tadvanced can find the highest wisdom in its spiritual\\n\\t\\t\\t\\tteaching, enriched as it is with all kinds of beautiful\\n\\t\\t\\t\\tillustrations from nature and the story of man."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "119",
    "NoteID": "944",
    "Body": "Cf. v. 4. When a clear law has explained what is lawful\\n\\t\\t\\t\\tand unlawful in food, it is wrong to raise fresh scruples\\n\\t\\t\\t\\tand mislead the ignorant."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "122",
    "NoteID": "945",
    "Body": "Here is an allegory of the good man with his divine\\n\\t\\t\\t\\tmission and the evil man with his mission of evil. The\\n\\t\\t\\t\\tformer, before he got his spiritual life, was like one\\n\\t\\t\\t\\tdead. It was God's grace that gave him spiritual life,\\n\\t\\t\\t\\twith a Light by which he could walk and guide his own\\n\\t\\t\\t\\tfootsteps as well as the footsteps of those who are\\n\\t\\t\\t\\twilling to follow God's light. The opposite type is that\\n\\t\\t\\t\\twhich hates God's light, which lives in the depths of\\n\\t\\t\\t\\tdarkness, and which plots and burrows against all that is\\n\\t\\t\\t\\tgood. But the plots of evil recoil on itself, although it\\n\\t\\t\\t\\tthinks that they will hurt the good. Can these two types\\n\\t\\t\\t\\tbe for a moment compared with each other? Perhaps the\\n\\t\\t\\t\\tlead in every centre of population is taken by the men of\\n\\t\\t\\t\\tevil. But the good men should not be discouraged. They\\n\\t\\t\\t\\tshould work in righteousness and fulfil their mission."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "124",
    "NoteID": "946",
    "Body": "Besides the teaching in God's Word, and the teaching in\\n\\t\\t\\t\\tGod's world, of nature and history and human contacts,\\n\\t\\t\\t\\tmany Signs also come to the ungodly, in the shape of\\n\\t\\t\\t\\twarnings or otherwise, which the ungodly either do not\\n\\t\\t\\t\\theed, or deliberately reject. The Signs in the two cases\\n\\t\\t\\t\\tare not the same, and that becomes one of their perverse\\n\\t\\t\\t\\targuments against Faith. But God's working will be\\n\\t\\t\\t\\taccording to His own Will and Plan, and not according to\\n\\t\\t\\t\\tthe wishes whims of the ungodly."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "125",
    "NoteID": "947",
    "Body": "God's Universal Plan is the Qadha wa Qadr, which is so\\n\\t\\t\\t\\tmuch misunderstood. That Plan is unalterable, and that is\\n\\t\\t\\t\\tHis Will. It means that in the spiritual world, there are\\n\\t\\t\\t\\tlaws of justice, mercy, grace, penalty, etc., which work\\n\\t\\t\\t\\tas surely as anything we know. If, then, a man refuses\\n\\t\\t\\t\\tFaith, becomes a rebel, with each step he goes further\\n\\t\\t\\t\\tand further down, and his pace will be accelerated; he\\n\\t\\t\\t\\twill scarcely be able to take spiritual breath, and his\\n\\t\\t\\t\\trecovery, -in spite of God's mercy which he has\\n\\t\\t\\t\\trejected,-will be as difficult as if he had to climb up\\n\\t\\t\\t\\tto the skies. On the other hand, the godly will find,\\n\\t\\t\\t\\twith each step, the next step easier. Jesus expressed\\n\\t\\t\\t\\tthis truth paradoxically: \"He that hath, to him shall be\\n\\t\\t\\t\\tgiven; but he that hath not, from him shall be taken away\\n\\t\\t\\t\\teven that which he hath\": Mark, iv. 25. John (vi 65) make\\n\\t\\t\\t\\tJesus say: \"No man can come unto me, except it were given\\n\\t\\t\\t\\tunto him of my Father.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "128",
    "NoteID": "948",
    "Body": "Cf. vi. 100, n. 929."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "128",
    "NoteID": "949",
    "Body": "I.e., you have misled a great number of human beings."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "128",
    "NoteID": "950",
    "Body": "It is common experience that the forces of evil make an\\n\\t\\t\\t\\talliance with each other, and seem thus to make a profit\\n\\t\\t\\t\\tby their mutual log-rolling. But this is only in this\\n\\t\\t\\t\\tmaterial world. When the limited term expires, their\\n\\t\\t\\t\\tunholy bargains will be exposed, and there will be\\n\\t\\t\\t\\tnothing but regrets."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "128",
    "NoteID": "951",
    "Body": "Eternity and infinity are abstract terms. They have no\\n\\t\\t\\t\\tprecise meaning in our human experience. The\\n\\t\\t\\t\\tqualification, \"except as God willeth,\" makes it more\\n\\t\\t\\t\\tintelligible, as we can form some idea -however\\n\\t\\t\\t\\tinadequate- of a Will and Plan, and we know God by His\\n\\t\\t\\t\\tattribute of Mercy as well as of Justice."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "129",
    "NoteID": "952",
    "Body": "See n. 950 above. Evil consorts with evil because of\\n\\t\\t\\t\\ttheir mutual bargains. But in doing so they save the\\n\\t\\t\\t\\trighteous from further temptation."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "130",
    "NoteID": "953",
    "Body": "\"Apostles from amongst you.\" This is addressed to the\\n\\t\\t\\t\\twhole gathering of men and Jinns. Are the Jinns but\\n\\t\\t\\t\\tdisembodied spirits of evil men?"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "132",
    "NoteID": "954",
    "Body": "On good and evil there are infinite degrees, in our deeds\\n\\t\\t\\t\\tand motives: so will there be degrees in our spiritual\\n\\t\\t\\t\\tposition. For everything is known to God, better than it\\n\\t\\t\\t\\tis to ourselves."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "133",
    "NoteID": "955",
    "Body": "God is not dependent on our prayer or service. It is out\\n\\t\\t\\t\\tof His Mercy that He desires our own good. Any race or\\n\\t\\t\\t\\tpeople to whom He gives chances should understand that\\n\\t\\t\\t\\tits failure does not affect God. He could create others\\n\\t\\t\\t\\tin their place, as He did in times past, and is doing in\\n\\t\\t\\t\\tour own day, if only we had the wit to see it."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "134",
    "NoteID": "956",
    "Body": "Both the good news and the warning which God's apostles\\n\\t\\t\\t\\tcame to give will be fulfilled. Nothing can stop God's\\n\\t\\t\\t\\tUniversal Plan. See n. 947 to vi. 125."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "135",
    "NoteID": "957",
    "Body": "In so far as this is addressed to the Unbelievers it is a\\n\\t\\t\\t\\tchallenge: \"Do your utmost; nothing will deter me from my\\n\\t\\t\\t\\tduty: we shall see who wins in the end.\"  Passing from\\n\\t\\t\\t\\tthe particular occasion, we can understand it in a more\\n\\t\\t\\t\\tgeneral sense, which is true for all time. Let the evil\\n\\t\\t\\t\\tones do their worst. Let those who believe do all they\\n\\t\\t\\t\\tcan, according to their opportunities and abilities. The\\n\\t\\t\\t\\tindividual must do the straight duty that lies before\\n\\t\\t\\t\\thim. In the end God will judge, and His judgement is\\n\\t\\t\\t\\talways true and just."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "136",
    "NoteID": "958",
    "Body": "There is scathing sarcasm here, which some of the\\n\\t\\t\\t\\tCommentators have missed. The Pagans have generally a big\\n\\t\\t\\t\\tPantheon, though above it they have a vague idea of a\\n\\t\\t\\t\\tSupreme God. But the material benefits go to the\\n\\t\\t\\t\\tgodlings, the fancied \"partners\" of God; for they have\\n\\t\\t\\t\\ttemples, priests, dedications, etc., while the true and\\n\\t\\t\\t\\tsupreme God has only lip-worship, or at best a share with\\n\\t\\t\\t\\tnumerous \"partners\". This was so in Arabia also. The\\n\\t\\t\\t\\tshares assigned to the \"partners\", went to the priests\\n\\t\\t\\t\\tand hangers-on of the \"partners\", who were many and\\n\\t\\t\\t\\tclamorous for their rights. The share assigned to God\\n\\t\\t\\t\\twent to the poor, but more probably went to the priests\\n\\t\\t\\t\\twho had the cult of the \"partners\", for the Supreme God\\n\\t\\t\\t\\thad no separate priests of His own. It is also said that\\n\\t\\t\\t\\twhen heaps were thus laid out, if any portion of God's\\n\\t\\t\\t\\theap fell into the heaps of the \"partners\", the priests\\n\\t\\t\\t\\tgreedily and promptly appropriated it, while in the\\n\\t\\t\\t\\tcontrary case, the \"partners\" priests were careful to\\n\\t\\t\\t\\treclaim any portion from what they called \"God's heap\".\\n\\t\\t\\t\\tThe absurdity of the whole thing is ridiculed . God\\n\\t\\t\\t\\tcreated everything: how can He have a share?"
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "137",
    "NoteID": "959",
    "Body": "The false gods and idols -among many nations, including\\n\\t\\t\\t\\tthe Arabs -were supposed to require human sacrifices.\\n\\t\\t\\t\\tOrdinarily such sacrifices are revolting to man, but they\\n\\t\\t\\t\\tare made \"alluring\" -a sacred rite- by Pagan custom,\\n\\t\\t\\t\\twhich falsely arrogates to itself the name of religion.\\n\\t\\t\\t\\tSuch customs, if allowed, would do nothing but destroy\\n\\t\\t\\t\\tthe people who practise them, and make thier religion but\\n\\t\\t\\t\\ta confused bundle of revolting superstitions."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "138",
    "NoteID": "960",
    "Body": "A taboo of certain foods is sometimes a device of the\\n\\t\\t\\t\\tpriesthood to get special things for itself. It has to be\\n\\t\\t\\t\\tenforced by pretending that the prohibition for others is\\n\\t\\t\\t\\tby the Will of God. It is a lie or invention against God.\\n\\t\\t\\t\\tMost superstitions are."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "138",
    "NoteID": "961",
    "Body": "Cattle dedicated to heathen gods may be reserved from all\\n\\t\\t\\t\\tuseful work; in that case they are a dead loss to the\\n\\t\\t\\t\\tcommunity, and they may, besides, do a great deal of\\n\\t\\t\\t\\tdamage to fields and crops."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "138",
    "NoteID": "962",
    "Body": "If meat is killed in the name of heathen gods, it would\\n\\t\\t\\t\\tnaturally not be killed by the solemn rite in God's name,\\n\\t\\t\\t\\tby which alone the killing can be justified for food. See\\n\\t\\t\\t\\tn. 698 to v. 5."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "139",
    "NoteID": "963",
    "Body": "These are further Pagan superstitions about cattle. Some\\n\\t\\t\\t\\thave already been noted in v. 106, which may be consulted\\n\\t\\t\\t\\twith the notes."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "141",
    "NoteID": "964",
    "Body": "Ansha-a: see vi. 98, n. 923."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "141",
    "NoteID": "965",
    "Body": "A beautiful passage, with music to match the meaning. Cf.\\n\\t\\t\\t\\tvi. 99 and notes."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "141",
    "NoteID": "966",
    "Body": "\"Waste not, want not,\" says the English proverb. Here the\\n\\t\\t\\t\\tsame wisdom is preached from a higher motive. See what\\n\\t\\t\\t\\tmagnificent means God provides in nature for the\\n\\t\\t\\t\\tsustenance of all His creatures, because He loves them\\n\\t\\t\\t\\tall. Enjoy them in moderation and be grateful. But commit\\n\\t\\t\\t\\tno excess, and commit no waste: the two things are the\\n\\t\\t\\t\\tsame from different angles of vision. If you do, you take\\n\\t\\t\\t\\taway something from other creatures and God would not\\n\\t\\t\\t\\tlike your selfishness."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "142",
    "NoteID": "967",
    "Body": "Superstition kills true religion. We come back to the\\n\\t\\t\\t\\tArab Pagan superstitions about cattle for food. The horse\\n\\t\\t\\t\\tis not mentioned, because horse flesh was not an article\\n\\t\\t\\t\\tof diet and there were no superstitions about it. Sheep\\n\\t\\t\\t\\tand goats, camels and oxen were the usual sources of\\n\\t\\t\\t\\tmeat. Sheep and goats were not used as beasts of burden,\\n\\t\\t\\t\\tbut camels (of both sexes) were used for carrying\\n\\t\\t\\t\\tburdens, and oxen for the plough, though cows were mainly\\n\\t\\t\\t\\tused for milk and meat. The words \"some for burden and\\n\\t\\t\\t\\tsome for meat\" do not differentiate whole species, except\\n\\t\\t\\t\\tthat they give you the first two and the last two\\n\\t\\t\\t\\tcategories."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "143",
    "NoteID": "968",
    "Body": "The superstitions referred to in vi. 139 and v. 106 are\\n\\t\\t\\t\\tfurther ridiculed in this verse, and the next."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "145",
    "NoteID": "969",
    "Body": "Blood poured forth: as distinguished from blood adhering\\n\\t\\t\\t\\tto flesh, or the liver, or such other internal organs\\n\\t\\t\\t\\tpurifying the blood."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "146",
    "NoteID": "970",
    "Body": "Zufur may mean claw or hoof; it is in the singular\\n\\t\\t\\t\\tnumber; but as no animal has a single claw, and there is\\n\\t\\t\\t\\tno point in a division of claws, we must look to a hoof\\n\\t\\t\\t\\tfor the correct interpretation. In the Jewish Law\\n\\t\\t\\t\\t(Leviticus, xi. 3-6), \"Whatsoever parteth the hoof, and\\n\\t\\t\\t\\tis cloven-footed, and cheweth the cud, among the beasts\"\\n\\t\\t\\t\\twas lawful as food, but the camel, the coney (rabbit),\\n\\t\\t\\t\\tand the hare were not lawful, because they do not \"divide\\n\\t\\t\\t\\tthe hoof\". \"Undivided hoof\" therefore is the correct\\n\\t\\t\\t\\tinterpretation. These three animals, unlawful to the\\n\\t\\t\\t\\tJews, are lawful in Islam. Cf. iv. 160."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "146",
    "NoteID": "971",
    "Body": "In Leviticus (vii. 23) it is laid down that \"ye shall eat\\n\\t\\t\\t\\tno manner of fat, of ox, or of sheep or of goat.\" As\\n\\t\\t\\t\\tregards the exceptions, it is to be noticed that priests\\n\\t\\t\\t\\twere enjoined (Leviticus, vii. 6) to eat of the fat in\\n\\t\\t\\t\\tthe trespass of offering, which was considered holy,\\n\\t\\t\\t\\tviz., \"the rump\" (back and bone) \"and the fat that\\n\\t\\t\\t\\tcovereth the inwards\" (entrails), (Leviticus, vii.3)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "148",
    "NoteID": "972",
    "Body": "As used by the Pagans, the argument is false, for it\\n\\t\\t\\t\\timplies (a) that men have no personal responsibility, (b)\\n\\t\\t\\t\\tthat they are the victims of a Determinism against which\\n\\t\\t\\t\\tthey are helpless, and (c) that they might therefore go\\n\\t\\t\\t\\ton doing just what they liked. It is also inconsistent,\\n\\t\\t\\t\\tfor if (b) is true, (c) cannot be true. Nor is it meant\\n\\t\\t\\t\\tto be taken seriously."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "149",
    "NoteID": "973",
    "Body": "On the other hand, the argument cuts true and deep, as\\n\\t\\t\\t\\tfrom God to His creatures. God is Omnipotent, and can do\\n\\t\\t\\t\\tall that we can conceive. But He, in His Plan, has given\\n\\t\\t\\t\\tman some responsibility, and some choice in order to\\n\\t\\t\\t\\ttrain man's will. If man fails, he is helped in various\\n\\t\\t\\t\\tways by God's mercy and grace. But man cannot go on\\n\\t\\t\\t\\tsinning, and in a state of sin, expect God to be pleased\\n\\t\\t\\t\\twith him (vi. 147)."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "150",
    "NoteID": "974",
    "Body": "The Pagan superstitions were of course baseless, and in\\n\\t\\t\\t\\tmany cases harmful and debasing. If God's name was taken\\n\\t\\t\\t\\tas supporting them, no true man of God could be taken in,\\n\\t\\t\\t\\tor join in support simply because God's name was taken in\\n\\t\\t\\t\\tvain."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "150",
    "NoteID": "975",
    "Body": "Cf. vi. 1. God, who created and who cherishes and cares\\n\\t\\t\\t\\tfor all, should have the first claim on our attention.\\n\\t\\t\\t\\tThose who set up false gods fail to understand God's true\\n\\t\\t\\t\\tgovernance of their own true destiny."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "151",
    "NoteID": "976",
    "Body": "Instead of following Pagan superstitions, and being in\\n\\t\\t\\t\\tconstant terror of imaginary taboos and prohibitions, we\\n\\t\\t\\t\\tshould study the true moral law, whose sanction is God's\\n\\t\\t\\t\\tLaw. The first step is that we should recognise that He\\n\\t\\t\\t\\tis the One and Only Lord and Cherisher. The mention of\\n\\t\\t\\t\\tgoodness to parents immediately afterwards suggests: (1)\\n\\t\\t\\t\\tthat God's love of us and care for us may -on an\\n\\t\\t\\t\\tinfinitely higher plane- be understood by our ideal of\\n\\t\\t\\t\\tparental love, which is purely unselfish; (2) that our\\n\\t\\t\\t\\tfirst duty among our fellow creatures is to our father\\n\\t\\t\\t\\tand mother, whose love leads us to the conception of\\n\\t\\t\\t\\tdivine love. Arising from that is the conception of our\\n\\t\\t\\t\\tconverse duties to our children. God provides sustenance\\n\\t\\t\\t\\t(material and spiritual) not only for us, but for them;\\n\\t\\t\\t\\thence any custom like the Pagan custom of sacrificing\\n\\t\\t\\t\\tchildren of Moloch stands condemned. Then come the moral\\n\\t\\t\\t\\tprohibitions against lewdness and all unseemly acts,\\n\\t\\t\\t\\trelating to sex or otherwise, open or secret. This is\\n\\t\\t\\t\\tfollowed by the prohibition of killing or fighting. All\\n\\t\\t\\t\\tthese things are conformable to our own interests, and\\n\\t\\t\\t\\ttherefore true wisdom from our own point of view."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "151",
    "NoteID": "977",
    "Body": "For the comprhensive word haqq I have used the two words\\n\\t\\t\\t\\t\"justice and law\"; other significations implied are:\\n\\t\\t\\t\\tright, truth, what is becoming, etc. It is not only that\\n\\t\\t\\t\\thuman life is sacred, but all life is sacred. Even in\\n\\t\\t\\t\\tkilling animals for food, a dedicatory formula \"in the\\n\\t\\t\\t\\tname of God\" has to be employed, to make it lawful: see\\n\\t\\t\\t\\tn. 698 to v. 5, and n. 962 to vi. 138."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "152",
    "NoteID": "978",
    "Body": "Cf. v. 1, and n. 682."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "153",
    "NoteID": "979",
    "Body": "Note againe the triple refrain with variations, in vi.\\n\\t\\t\\t\\t151, 152, and 153. In verse 151, we have the moral law,\\n\\t\\t\\t\\twhich it is for our own good to follow: \"Thus doth He\\n\\t\\t\\t\\tcommand you, that ye may learn wisdom.\" In verse 152, we\\n\\t\\t\\t\\thave to deal justly and rightly with others; we are apt\\n\\t\\t\\t\\tto think too much of ourselves and forget others: \"Thus\\n\\t\\t\\t\\tdoth He command you, that ye may remember.\" In verse 153\\n\\t\\t\\t\\tour attention is called to the Straight Way, the Way of\\n\\t\\t\\t\\tGod, the only Way that leads to righteousness: \"Thus doth\\n\\t\\t\\t\\tHe command you, that ye may be righteous.\""
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "154",
    "NoteID": "980",
    "Body": "The revelation to Moses went into the details of people's\\n\\t\\t\\t\\tlives, and thus served as a practical guide to the Jews\\n\\t\\t\\t\\tand after them to the Christians. Admittedly the Message\\n\\t\\t\\t\\tdelivered by Christ dealt with general principles only\\n\\t\\t\\t\\tand in no way with details. The message of Islam as in\\n\\t\\t\\t\\tthe Qur-an is the next complete guide in point of time\\n\\t\\t\\t\\tafter that of Moses."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "156",
    "NoteID": "981",
    "Body": "Because the diligent studies of the earlier People of the\\n\\t\\t\\t\\tBook were in languages foreign to the new People of\\n\\t\\t\\t\\tIslam, or because they were meant for circumstances\\n\\t\\t\\t\\tdifferent from those of the new world after Islam."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "157",
    "NoteID": "982",
    "Body": "The Qur-an and the life and the teaching of Muhammad the\\n\\t\\t\\t\\tApostle of God."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "158",
    "NoteID": "983",
    "Body": "There is no merit in faith in things that you are\\n\\t\\t\\t\\tcompelled to acknowledge when they actually happen. Faith\\n\\t\\t\\t\\tis belief in things which you do not see with your own\\n\\t\\t\\t\\teyes but you understand with your spiritual sense: if\\n\\t\\t\\t\\tyour whole will consents to it, it results in deeds of\\n\\t\\t\\t\\trighteousness, which are the evidence of your faith."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "158",
    "NoteID": "984",
    "Body": "The waiting in the two cases is in quite different\\n\\t\\t\\t\\tsenses: the foolish man without faith is waiting for\\n\\t\\t\\t\\tthings which will not happen, and is surprised by the\\n\\t\\t\\t\\treal things which do happen; the righteous man of faith\\n\\t\\t\\t\\tis waiting for the fruits of righteousness, of which he\\n\\t\\t\\t\\thas an assured hope; in a higher state of spiritual\\n\\t\\t\\t\\televation, even the fruits have no personal meaning to\\n\\t\\t\\t\\thim, for God is to him in all: vi. 162."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "159",
    "NoteID": "985",
    "Body": "Divide their religion: farraqu: i.e., (1) make a\\n\\t\\t\\t\\tdistinction between one part of it and another, take the\\n\\t\\t\\t\\tpart which suits them and reject the rest; or (2) have\\n\\t\\t\\t\\treligion one day of the week and the world the rest of\\n\\t\\t\\t\\tthe six days; or (3) keep \"religion in its right place,\"\\n\\t\\t\\t\\tas if it did not claim to govern the whole life; make a\\n\\t\\t\\t\\tsharp distinction between the secular and the religious;\\n\\t\\t\\t\\tor (4) show a sectarian bias, seek differences in views,\\n\\t\\t\\t\\tso as to break up the unity of Islam."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "160",
    "NoteID": "986",
    "Body": "God is just as well as generous. To the good the reward\\n\\t\\t\\t\\tis multiplied ten times (i.e., far above the merits) on\\n\\t\\t\\t\\taccount of His generosity. To the evil, the punishment is\\n\\t\\t\\t\\tno more than commensurate with their sin, and even so the\\n\\t\\t\\t\\tdoor of mercy is always open to those who sincerely\\n\\t\\t\\t\\trepent and show it by their conduct."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "164",
    "NoteID": "987",
    "Body": "The doctrine of personal responsiblility again. We are\\n\\t\\t\\t\\tfully responsible for our acts ourselves: we cannot\\n\\t\\t\\t\\ttransfer the consequences to someone else. Nor can anyone\\n\\t\\t\\t\\tvicariously atone for our sins. If people have honest\\n\\t\\t\\t\\tdoubts or differences about important questions of\\n\\t\\t\\t\\treligion, they should not start futile disputes. All will\\n\\t\\t\\t\\tbe clear in the end. Our duty here is to maintain unity\\n\\t\\t\\t\\tand discipline, and do the duty that comes to us."
  },
  {
    "SurahNumber": "6",
    "AyahNumber": "165",
    "NoteID": "988",
    "Body": "Cf. ii. 30 and n. where I have translated \"Khalifa\" as\\n\\t\\t\\t\\t\"Vicegerent\", it being god's Plan to make Adam (as\\n\\t\\t\\t\\trepresenting mankind) His vicegerent on earth.\\tAnother\\n\\t\\t\\t\\tidea implied in \"Khalifa\" is that of \"successor, heir, or\\n\\t\\t\\t\\tinheritor,\" i.e., one who has the ultimate ownership\\n\\t\\t\\t\\tafter the present possessors, to whom a life-tenancy has\\n\\t\\t\\t\\tbeen given by the owner, have passed away. In xv. 23\\n\\t\\t\\t\\toccurs the striking word \"heirs\" (warithun) as applied to\\n\\t\\t\\t\\tGod: \"We give life and death, and We are the Heirs (of\\n\\t\\t\\t\\tInheritors).\" The same idea occurs in iii. 180, where see\\n\\t\\t\\t\\tn. 485."
  }
]
