[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/028001",
        "Body":  "Ta.Sin.Mim."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/028010",
        "Body":  "And the heart of the mother of Moses became void, and she would\n\t\t\thave betrayed him if We had not fortified her heart, that she\n\t\t\tmight be of the believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/028011",
        "Body":  "And she said unto his sister: Trace him. So she observed him from\n\t\t\tafar, and they perceived not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/028012",
        "Body":  "And We had before forbidden foster-mothers for him, so she said:\n\t\t\tShall I show you a household who will rear him for you and take\n\t\t\tcare of him?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/028013",
        "Body":  "So We restored him to his mother that she might be comforted and\n\t\t\tnot grieve, and that she might know that the promise of Allah is\n\t\t\ttrue. But most of them know not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/028014",
        "Body":  "And when he reached his full strength and was ripe, We gave him\n\t\t\twisdom and knowledge. Thus do We reward the good."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/028015",
        "Body":  "And he entered the city at a time of carelessness of its folk,\n\t\t\tand he found therein two men fighting, one of his own caste, and\n\t\t\tthe other of his enemies; and he who was of his caste asked him\n\t\t\tfor help against him who was of his enemies. So Moses struck him\n\t\t\twith his fist and killed him. He said: This is of the devil\u0027s\n\t\t\tdoing. Lo! he is an enemy, a mere misleader."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/028016",
        "Body":  "He said: My Lord! Lo! I have wronged my soul, so forgive me. Then\n\t\t\tHe forgave him. Lo! He is the Forgiving, the Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/028017",
        "Body":  "He said: My Lord! Forasmuch as Thou hast favored me, I will\n\t\t\tnevermore be a supporter of the guilty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/028018",
        "Body":  "And morning found him in the city, fearing, vigilant, when\n\t\t\tbehold! he who had appealed to him the day before cried out to\n\t\t\thim for help. Moses said unto him: Lo! thou art indeed a mere\n\t\t\thothead."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/028019",
        "Body":  "And when he would have fallen upon the man who was an enemy unto\n\t\t\tthem both, he said: O Moses! Wouldst thou kill me as thou didst\n\t\t\tkill a person yesterday. Thou wouldst be nothing but a tyrant in\n\t\t\tthe land, thou wouldst not be of the reformers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/028002",
        "Body":  "These are revelations of the Scripture that maketh plain."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/028020",
        "Body":  "And a man came from the uttermost part of the city, running. He\n\t\t\tsaid: O Moses! Lo! the chiefs take counsel against thee to slay\n\t\t\tthee; therefor escape. Lo! I am of those who give thee good\n\t\t\tadvice."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/028021",
        "Body":  "So he escaped from thence, fearing, vigilant. He said: My Lord !\n\t\t\tDeliver me from the wrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/028022",
        "Body":  "And when he turned his face toward Midian, he said: Peradventure\n\t\t\tmy Lord will guide me in the right road."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/028023",
        "Body":  "And when he came unto the water of Midian he found there a whole\n\t\t\ttribe of men, watering. And he found apart from them two women\n\t\t\tkeeping back (their flocks). He said: What aileth you? The two\n\t\t\tsaid: We cannot give (our flocks) to drink till the shepherds\n\t\t\treturn from the water; and our father is a very old man."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/028024",
        "Body":  "So he watered (their flock) for them. Then he turned aside into\n\t\t\tthe shade, and said: My Lord! I am needy of whatever good thou\n\t\t\tsendest down for me."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/028025",
        "Body":  "Then there came unto him one of the two women, walking shyly. She\n\t\t\tsaid: Lo! my father biddeth thee, that he may reward thee with a\n\t\t\tpayment for that thou didst water (the flock) for us. Then, when\n\t\t\the came unto him and told him the (whole) story, he said: Fear\n\t\t\tnot! Thou hast escaped from the wrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/028026",
        "Body":  "One of the two women said: O my father! Hire him! For the best\n\t\t\t(man) that thou canst hire is the strong, the trustworthy."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/028027",
        "Body":  "He said: Lo! I fain would marry thee to one of these two\n\t\t\tdaughters of mine on condition that thou hirest thyself to me for\n\t\t\t(the term of) eight pilgrimages. Then if thou completest ten it\n\t\t\twill be of thine own accord, for I would not make it hard for\n\t\t\tthee. Allah willing, thou wilt find me of the righteous."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/028028",
        "Body":  "He said: That (is settled) between thee and me. Whichever of the\n\t\t\ttwo terms I fulfil, there will be no injustice to me, and Allah\n\t\t\tis Surety over what we say."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/028029",
        "Body":  "Then, when Moses had fulfilled the term, and was traveling with\n\t\t\this housefolk, he saw in the distance a fire and said unto his\n\t\t\thousefolk: Bide ye (here). Lo! I see in the distance a fire;\n\t\t\tperadventure I shall bring you tidings thence, or a brand from\n\t\t\tthe fire that you may warm yourselves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/028003",
        "Body":  "We narrate unto thee (somewhat) of the story of Moses and Pharaoh\n\t\t\twith truth, for folk who believe."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/028030",
        "Body":  "And when he reached it, he was called from the right side of the\n\t\t\tvalley in the blessed field, from the tree: O Moses! Lo! I, even\n\t\t\tI, am Allah, the Lord of the Worlds;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/028031",
        "Body":  "Throw down thy staff. And when he saw it writhing as it had been\n\t\t\ta demon, he turned to flee headlong, (and it was said unto him):\n\t\t\tO Moses! Draw nigh and fear not. Lo! thou art of those who are\n\t\t\tsecure."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/028032",
        "Body":  "Thrust thy hand into the bosom of thy robe, it will come forth\n\t\t\twhite without hurt. And guard thy heart from fear. Then these\n\t\t\tshall be two proofs from your Lord unto Pharaoh and his chiefs:\n\t\t\tLo! they are evil living folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/028033",
        "Body":  "He said: My Lord! Lo! I killed a man among them and I fear that\n\t\t\tthey will kill me."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/028034",
        "Body":  "My brother Aaron is more eloquent then me in speech. Therefor\n\t\t\tsend him with me as a helper to confirm me. Lo! 1 fear that they\n\t\t\twill give the lie to me."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/028035",
        "Body":  "He said: We will strengthen thine arm with thy brother, and We\n\t\t\twill give unto you both power so that they cannot reach you for\n\t\t\tOur portents. Ye twain, and those who follow you, will be the\n\t\t\twinners."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/028036",
        "Body":  "But when Moses came unto them with Our clear tokens, they said:\n\t\t\tThis is naught but invented magic. We never heard of this among\n\t\t\tour fathers of old."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/028037",
        "Body":  "And Moses said: My Lord is best aware of him who bringeth\n\t\t\tguidance from His presence, and whose will be the sequel of the\n\t\t\tHome (of bliss). Lo! wrong-doers will not be successful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/028038",
        "Body":  "And Pharaoh said: O chiefs! I know not that ye have a god other\n\t\t\tthan me, so kindle for me (a fire) , O Haman, to bake the mud;\n\t\t\tand set up for me a lofty tower in order that I may survey the\n\t\t\tgod of Moses; and lo! I deem him of the liars."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/028039",
        "Body":  "And he and his hosts were haughty in the land without right, and\n\t\t\tdeemed that they would never be brought back to Us."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/028004",
        "Body":  "Lo! Pharaoh exalted himself in the earth and made its people\n\t\t\tcastes. A tribe among them he suppressed, killing their sons and\n\t\t\tsparing their women. Lo! he was of those who work corruption."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/028040",
        "Body":  "Therefor We seized him and his hosts, and abandoned them unto the\n\t\t\tsea. Behold the nature of the consequence for evil-doers!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/028041",
        "Body":  "And We made them patterns that invite unto the Fire, and on the\n\t\t\tDay of Resurrection they will not be helped."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/028042",
        "Body":  "And We made a curse to follow them in this world, and on the Day\n\t\t\tof Resurrection they will be among the hateful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/028043",
        "Body":  "And We verily gave the Scripture unto Moses after We had\n\t\t\tdestroyed the generations of old; clear testimonies for mankind,\n\t\t\tand a guidance and a mercy, that haply they might reflect."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/028044",
        "Body":  "And thou (Muhammad) wast not on the western side (of the Mount)\n\t\t\twhen We expounded unto Moses the commandment, and thou wast not\n\t\t\tamong those present;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/028045",
        "Body":  "But We brought forth generations, and their lives dragged on for\n\t\t\tthem. And thou wast not a dweller in Midian, reciting unto them\n\t\t\tOur revelations, but We kept sending (messengers to men)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/028046",
        "Body":  "And thou wast not beside the Mount when We did call; but (the\n\t\t\tknowledge of it is) a mercy from thy Lord that thou mayest warn a\n\t\t\tfolk unto whom no warner came before thee, that haply they may\n\t\t\tgive heed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/028047",
        "Body":  "Otherwise, if disaster should afflict them because of that which\n\t\t\ttheir own hands have sent before (them), they might say: Our\n\t\t\tLord! Why sentest Thou no messenger unto us, that we might have\n\t\t\tfollowed Thy revelations and been of the believers?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/028048",
        "Body":  "But when there came unto them the Truth from Our presence, they\n\t\t\tsaid: Why is he not given the like of what was given unto Moses?\n\t\t\tDid they not disbelieve in that which was given unto Moses of\n\t\t\told? They say: Two magics that support each other; and they say:\n\t\t\tLo! in both we are disbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/028049",
        "Body":  "Say (unto them, O Muhammad): Then bring a Scripture from the\n\t\t\tpresence of Allah that giveth clearer guidance than these two\n\t\t\t(that) I may follow it, if ye are truthful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/028005",
        "Body":  "And We desired to show favor unto those who were oppressed in the\n\t\t\tearth, and to make them examples and to make them the inheritors,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/028050",
        "Body":  "And if they answer thee not, then know that what they follow is\n\t\t\ttheir lusts. And who goeth farther astray than he who followeth\n\t\t\this lust without guidance from Allah. Lo! Allah guideth not\n\t\t\twrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/028051",
        "Body":  "And now verily We have caused the Word to reach them, that haply\n\t\t\tthey may give heed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/028052",
        "Body":  "Those unto whom We gave the Scripture before it, they believe in\n\t\t\tit,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/028053",
        "Body":  "And when it is recited unto them, they say: We believe in it. Lo!\n\t\t\tit is the Truth from our Lord. Lo! even before it we were of\n\t\t\tthose who surrender (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/028054",
        "Body":  "These will be given their reward twice over, because they are\n\t\t\tsteadfast and repel evil with good, and spend of that wherewith\n\t\t\tWe have provided them,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/028055",
        "Body":  "And when they hear vanity they withdraw from it and say: Unto us\n\t\t\tour works and unto you your works. Peace be unto you! We desire\n\t\t\tnot the ignorant."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/028056",
        "Body":  "Lo! thou (O Muhammad) guidest not whom thou lovest, but Allah\n\t\t\tguideth whom He will. And He is best aware of those who walk\n\t\t\taright."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/028057",
        "Body":  "And they say: If we were to follow the Guidance with thee we\n\t\t\tshould be torn out of our land. Have We not established for them\n\t\t\ta sure sanctuary, whereunto the produce of all things is brought\n\t\t\t(in trade), a provision from Our presence? But most of them know\n\t\t\tnot."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/028058",
        "Body":  "And how many a community have We destroyed that was thankless for\n\t\t\tits means of livelihood! And yonder are their dwellings, which\n\t\t\thave not been inhabited after them save a little. And We, even\n\t\t\tWe, were the inheritors."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/028059",
        "Body":  "And never did thy Lord destroy the townships, till He had raised\n\t\t\tup in their mother(town) a messenger reciting unto them Our\n\t\t\trevelations. And never did We destroy the townships unless the\n\t\t\tfolk thereof were evil-doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/028006",
        "Body":  "And to establish them in the earth, and to show Pharaoh and Haman\n\t\t\tand their hosts that which they feared from them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/028060",
        "Body":  "And whatsoever ye have been given is a comfort of the life of the\n\t\t\tworld and an ornament thereof; and that which Allah hath is\n\t\t\tbetter and more lasting. Have ye then no sense?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/028061",
        "Body":  "Is he whom We have promised a fair promise which he will find\n\t\t\t(true) like him whom We suffer to enjoy awhile the comfort of the\n\t\t\tlife of the world, then on the Day of Resurrection he will be of\n\t\t\tthose arraigned?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/028062",
        "Body":  "On the Day when He will call unto them and say: Where are My\n\t\t\tpartners whom ye imagined?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/028063",
        "Body":  "Those concerning whom the Word will have come true will say: Our\n\t\t\tLord! These are they whom we led astray. We led them astray even\n\t\t\tas we ourselves were astray. We declare our innocence before\n\t\t\tThee: us they never worshipped"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/028064",
        "Body":  "And it will be said: Cry unto your (so-called) partners (of\n\t\t\tAllah). And they will cry unto them, and they will give no answer\n\t\t\tunto them, and they will see the Doom. Ah, if they had but been\n\t\t\tguided!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/028065",
        "Body":  "And on the Day when He will call unto them and say: What answer\n\t\t\tgave ye to the messengers?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/028066",
        "Body":  "On that day (all) tidings will be dimmed for them, nor will they\n\t\t\task one of another,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/028067",
        "Body":  "But as for him who shall repent and believe and do right, he\n\t\t\thaply may be one of the successful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/028068",
        "Body":  "Thy Lord bringeth to pass what He willeth and chooseth. They have\n\t\t\tnever any choice. Glorified be Allah and exalted above all that\n\t\t\tthey associate (with Him)!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/028069",
        "Body":  "And thy Lord knoweth what thee breasts conceal, and what they\n\t\t\tpublish."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/028007",
        "Body":  "And We inspired the mother of Moses, saying: Suckle him and, when\n\t\t\tthou fearest for him, then cast him into the river and fear not\n\t\t\tnor grieve. Lo! We shall bring him back unto thee and shall make\n\t\t\thim (one) of Our messengers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/028070",
        "Body":  "And He is Allah; there is no God save Him. His is all praise in\n\t\t\tthe former and the latter (state), and His is the command, and\n\t\t\tunto Him ye will be brought back."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/028071",
        "Body":  "Say: Have ye thought, if Allah made night everlasting for you\n\t\t\ttill the Day of Resurrection, who is a God beside Allah who could\n\t\t\tbring you light? Will ye not then hear?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/028072",
        "Body":  "Say: Have ye thought, if Allah made day everlasting for you till\n\t\t\tthe Day of Resurrection, who is a God beside Allah who could,\n\t\t\tbring you night wherein ye rest? Will ye not then see?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/028073",
        "Body":  "Of His mercy hath He appointed for you night and day that therein\n\t\t\tye may rest, and that ye may seek His bounty, and that haply ye\n\t\t\tmay be thankful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/028074",
        "Body":  "And on the Day when He shall call unto them and say: Where are My\n\t\t\tpartners whom ye pretended?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/028075",
        "Body":  "And We shall take out from every nation a witness and We shall\n\t\t\tsay: Bring your proof. Then they will know that Allah hath the\n\t\t\tTruth, and all that they invented will have failed them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/028076",
        "Body":  "Now Korah was of Moses folk, but he oppressed them and We gave\n\t\t\thim so much treasure that the stores thereof would verily have\n\t\t\tbeen a burden for a troop of mighty men. When his own folk said\n\t\t\tunto him: Exult not; lo! Allah loveth not the exultant;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/028077",
        "Body":  "But seek the abode of the Hereafter in that which Allah hath\n\t\t\tgiven thee and neglect not thy portion of the world, and be thou\n\t\t\tkind even as Allah hath been kind to thee, and seek not\n\t\t\tcorruption in the earth; lo! Allah loveth not corrupters,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/028078",
        "Body":  "He said: I have been given it only on account of knowledge I\n\t\t\tpossess. Knew he not that Allah had destroyed already of the\n\t\t\tgenerations before him men who were mightier than Him in strength\n\t\t\tand greater in respect of following? The guilty are not\n\t\t\tquestioned of their sins."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/028079",
        "Body":  "Then went he forth before his people in his pomp. Those who were\n\t\t\tdesirous of the life of the world said: Ah, would that unto us\n\t\t\thad been given the like of what hath been given unto Korah! Lo!\n\t\t\the is lord of rare good fortune."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/028008",
        "Body":  "And the family of Pharaoh took him up, that he might become for\n\t\t\tthem an enemy and a sorrow. Lo! Pharaoh and Haman and their hosts\n\t\t\twere ever sinning."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/028080",
        "Body":  "But those who had been given knowledge said: Woe unto you! The\n\t\t\treward of Allah for him who believeth and doeth right is better,\n\t\t\tand only the steadfast will obtain it."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/028081",
        "Body":  "So We caused the earth to swallow him and his dwelling place.\n\t\t\tThen he had no host to help him against Allah, nor was he of\n\t\t\tthose who can save themselves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/028082",
        "Body":  "And morning found those who had coveted his place but yesterday\n\t\t\tcrying: Ah, welladay! Allah enlargeth the provision for whom He\n\t\t\twill of His slaves and straiteneth it (for whom He will). If\n\t\t\tAllah had not been gracious unto us He would have caused it to\n\t\t\tswallow us (also). Ah, welladay! the disbelievers never prosper."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/028083",
        "Body":  "As for that Abode of the Hereafter We assign it unto those who\n\t\t\tseek not oppression in the earth, nor yet corruption. The sequel\n\t\t\tis for those who ward off (evil)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/028084",
        "Body":  "Whoso bringeth a good deed, he will have better than the same;\n\t\t\twhile as for him who bringeth an ill deed, those who do ill deeds\n\t\t\twill be requited only what they did."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/028085",
        "Body":  "Lo! He Who hath given thee the Qur\u0027an for a law will surely bring\n\t\t\tthee home again. Say: My Lord is best aware of he who bringeth\n\t\t\tguidance and him who is in error manifest."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/028086",
        "Body":  "Thou hadst no hope that the Scripture would be inspired in thee;\n\t\t\tbut it is a mercy from thy Lord, so never be a helper to the\n\t\t\tdisbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/028087",
        "Body":  "And let them not divert thee from the revelations of Allah after\n\t\t\tthey have been sent down unto thee; but call (mankind) unto thy\n\t\t\tLord, and be not of those who ascribe partners (unto turn)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/028088",
        "Body":  "And cry not unto any other god along with Allah. There is no God\n\t\t\tsave him. Everything will perish save His countenance. His is the\n\t\t\tcommand, and unto Him ye will be brought back."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "28",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/028009",
        "Body":  "And the wife of Pharaoh said: (He will be) a consolation for me\n\t\t\tand for thee. Kill him not. Peradventure he may be of use to us,\n\t\t\tor we may choose him for a son. And they perceived not."
    }
]
