[
  {
    "SurahNumber": "14",
    "AyahNumber": "1",
    "NoteID": "1870",
    "Body": "It is insisted on that every Prophet speaks not from\\n\\t\\t\\t\\thimself but from Allah. His leading into the light is but\\n\\t\\t\\t\\tby the grace and mercy of Allah, not by any power of his\\n\\t\\t\\t\\town, or by any merit of those who hear him."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "1",
    "NoteID": "1871",
    "Body": "In this and the next verse where the sentence is\\n\\t\\t\\t\\tcompleted, three qualities of Allah are mentioned, viz.,\\n\\t\\t\\t\\t(1) His exalted position above all Creation; (2) His\\n\\t\\t\\t\\tgoodness, which entitles Him, and Him alone, to Praise-\\n\\t\\t\\t\\tand (3) His Power in all heaven and earth. Thus He stands\\n\\t\\t\\t\\tin no need of man's worship; His goodness is all for the\\n\\t\\t\\t\\tgood of man (and His creatures); and His control over His\\n\\t\\t\\t\\tcreatures is complete; so He can carry out His Will and\\n\\t\\t\\t\\tPlan."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "2",
    "NoteID": "1872",
    "Body": "See the last note. That being the case, in what a sad\\n\\t\\t\\t\\tplight are those who reject the Faith and Grace offered\\n\\t\\t\\t\\tto them, and draw down on themselves all the terrible\\n\\t\\t\\t\\tconsequences of that rejection,-the Wrath to come!"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "3",
    "NoteID": "1873",
    "Body": "The Unbelievers are here characterised in three ways: (1)\\n\\t\\t\\t\\tthey love this ephemeral life and its vanities more than\\n\\t\\t\\t\\tthe true Life which goes into the Hereafter; (2) they not\\n\\t\\t\\t\\tonly harm themselves but mislead others, (3) their own\\n\\t\\t\\t\\tcrooked minds search for something crooked in Allah's\\n\\t\\t\\t\\tstraight Path (Cf. vii. 45). But in doing so, they go\\n\\t\\t\\t\\tfarther and farther from the Truth."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "4",
    "NoteID": "1874",
    "Body": "If the object of a Message is to make things clear, it\\n\\t\\t\\t\\tmust be delivered in the language current among the\\n\\t\\t\\t\\tpeople to whom the Messenger is sent. Through them it can\\n\\t\\t\\t\\treach all mankind. There is even a wider meaning for\\n\\t\\t\\t\\t\"language\". It is not merely a question of alphabets,\\n\\t\\t\\t\\tletters, or words. Each age or people-or world in a\\n\\t\\t\\t\\tpsychological sense- casts its thoughts in a certain\\n\\t\\t\\t\\tmould or form. Allah's Message-being universal-can be\\n\\t\\t\\t\\texpressed in all moulds and forms, and is equally valid\\n\\t\\t\\t\\tand necessary for all grades of humanity, and must\\n\\t\\t\\t\\ttherefore be explained to each according to his or her\\n\\t\\t\\t\\tcapacity or receptivity. In this respect the Qur-an is\\n\\t\\t\\t\\tmarvellous. It is for the simplest as well as the most\\n\\t\\t\\t\\tadvanced."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "4",
    "NoteID": "1875",
    "Body": "'Whom He pleases'; the usual expression for Mashiyat, the\\n\\t\\t\\t\\tuniversal Will and Plan, which is all-wise and on the\\n\\t\\t\\t\\thighest plane of goodness and righteousness."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "5",
    "NoteID": "1876",
    "Body": "\"The Days of Allah\": the days when Allah's mercy was\\n\\t\\t\\t\\tspecially shown to them. Every day and every hour and\\n\\t\\t\\t\\tminute, Allah's grace flows to us abundantly, but there\\n\\t\\t\\t\\tare special events in personal or national history which\\n\\t\\t\\t\\tmay be commemorated as Red-letter Days. Those to the\\n\\t\\t\\t\\tIsraelites were set out in great detail in ii. 30-61 and\\n\\t\\t\\t\\ton other places."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "5",
    "NoteID": "1877",
    "Body": "Sabbar is the intensive form, and includes all the ideas\\n\\t\\t\\t\\timplied in Sabr (ii. 45 and n. 61, and ii. 153 n. 157) in\\n\\t\\t\\t\\tan intensive degree. Shakur and Shakir have in them the\\n\\t\\t\\t\\tidea of appreciation, recognition, gratitude as shown in\\n\\t\\t\\t\\tdeeds of goodness and righteousness. Both terms are\\n\\t\\t\\t\\tapplied to Allah as well as to men. A slight distinction\\n\\t\\t\\t\\tin shades of meaning may be noted. Shakur implies that\\n\\t\\t\\t\\tthe appreciation is even for the smallest favours and\\n\\t\\t\\t\\tresponse on the other side; it is a mental attitude\\n\\t\\t\\t\\tindependent of specific facts. Shakir implies bigger and\\n\\t\\t\\t\\tmore specific things."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "6",
    "NoteID": "1878",
    "Body": "Cf. ii. 49. The reference back to Israel and Moses serves\\n\\t\\t\\t\\ta double purpose-as an appeal to the People of the Book,\\n\\t\\t\\t\\tand as a reminder to the Quraish of the favour now\\n\\t\\t\\t\\tconferred on them by the coming among them of a greater\\n\\t\\t\\t\\tProphet than Moses."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "7",
    "NoteID": "1879",
    "Body": "The various shades of meaning in Shakara are explained in\\n\\t\\t\\t\\tn. 1877 above. Kafara implies: (1) to reject Faith, as in\\n\\t\\t\\t\\tii. 6 and n. 30; (2) to be ungrateful for mercies and\\n\\t\\t\\t\\tfavours received, as here; (3) to resist Allah or Faith,\\n\\t\\t\\t\\tas in iii. 13; (4) to deny (the Signs of Allah), as in\\n\\t\\t\\t\\tiii. 21, or deny the mission of Messengers, as in xiv. 9.\\n\\t\\t\\t\\tKafir in the most general sense may be translated\\n\\t\\t\\t\\t\"Unbeliever\"."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "8",
    "NoteID": "1880",
    "Body": "Ingratitude not only in feeling or words, but in\\n\\t\\t\\t\\tdisobedience, and wilful rejection and rebellion. If the\\n\\t\\t\\t\\twhole of you band together against Allah, you do not\\n\\t\\t\\t\\tdetract from Allah's power one atom, because, Allah does\\n\\t\\t\\t\\tnot depend upon you for anything, and His goodness and\\n\\t\\t\\t\\trighteousness and praiseworthiness cannot be called in\\n\\t\\t\\t\\tquestion by your contumacy."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "8",
    "NoteID": "1881",
    "Body": "Cf- xxii. 64, xxix. 6, xxv. 15, lxvii. 38."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "9",
    "NoteID": "1882",
    "Body": "Even the names of all the Prophets are not known to men,\\n\\t\\t\\t\\tmuch less the details of their story. If some \"news\" of\\n\\t\\t\\t\\tthem (for the word translated \"story\" may also be\\n\\t\\t\\t\\ttranslated \"news\") reaches us, it is to give us spiritual\\n\\t\\t\\t\\tinstruction for our own lives."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "9",
    "NoteID": "1883",
    "Body": "That is, either that the Unbelievers metaphorically put\\n\\t\\t\\t\\ttheir hands up to the mouths of the Prophets to try to\\n\\t\\t\\t\\tprevent them from proclaiming their Message, or that the\\n\\t\\t\\t\\tUnbelievers put up their fingers to their own mouths, as\\n\\t\\t\\t\\tmuch as to say \"Don't listen to them,\" or bite their own\\n\\t\\t\\t\\tfingers in token of incontinent rage. Whatever\\n\\t\\t\\t\\tconstruction we adopt, the meaning is that they were\\n\\t\\t\\t\\tintolerant of their prophets even as the Quraish were\\n\\t\\t\\t\\tintolerant of Al-Mustafa and did all they could to\\n\\t\\t\\t\\tsuppress Allah's Truth."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "9",
    "NoteID": "1884",
    "Body": "Cf. xi. 62. The distinction between Shakk and raib may be\\n\\t\\t\\t\\tnoted. Shakk is intellectual doubt, a doubt as to fact;\\n\\t\\t\\t\\tis it so, or is it not? Raib is something more than\\n\\t\\t\\t\\tintellectual doubt; a suspicion that there is fraud or\\n\\t\\t\\t\\tdeception; something that upsets your moral belief and\\n\\t\\t\\t\\tcauses a disquiet in your soul. In lii. 30, it is used as\\n\\t\\t\\t\\tequivalent to \"calamity\" or \"disaster\", some punishment\\n\\t\\t\\t\\tor evil. Both kinds of doubts and suspicions are hinted\\n\\t\\t\\t\\tat against Prophets of Allah."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "10",
    "NoteID": "1885",
    "Body": "The Prophets (generally) clear both kinds of doubt. \"You\\n\\t\\t\\t\\tcannot doubt the existence of Allah! Behold His works! We\\n\\t\\t\\t\\tare not speaking for ourselves or deceiving you. We speak\\n\\t\\t\\t\\taccording to the Message of inspiration from Allah.-\\n\\t\\t\\t\\tNotice that the doubters had said to the Prophets, \"Ye\\n\\t\\t\\t\\tinvite us.\" The Prophets say: \"It is Allah Who invites\\n\\t\\t\\t\\tyou, and He does it to save you by His grace, and give\\n\\t\\t\\t\\tyou plenty of time (but not indefinite time) for\\n\\t\\t\\t\\tpenitence and amendment.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "10",
    "NoteID": "1886",
    "Body": "Infidelity is illogical and argues in a circle. If the\\n\\t\\t\\t\\tProphet speaks of Allah, the Unbeliever says, \"You are\\n\\t\\t\\t\\tonly a man!\" \"But I speak from Allah!\" \"Oh well! our\\n\\t\\t\\t\\tancestral ways of worship are good enough for us!\" \"What\\n\\t\\t\\t\\tif they are wrong?\" \"What authority have you for saying\\n\\t\\t\\t\\tso?\" \"The highest authority, that from Allah!\" And so we\\n\\t\\t\\t\\tcome back full circle! Then the wicked rely on violence,\\n\\t\\t\\t\\tbut it recoils on them, and they perish."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "13",
    "NoteID": "1887",
    "Body": "The arguments in a circle were explained in the last\\n\\t\\t\\t\\tnote. But Infidelity looks upon argument merely as an\\n\\t\\t\\t\\tamusement. Its chief weapon is physical force. As its\\n\\t\\t\\t\\tonly belief is in materialism, it thinks that threats of\\n\\t\\t\\t\\tforce will put down the righteous. It offers the choice\\n\\t\\t\\t\\tbetween exile and violence against conformity to its own\\n\\t\\t\\t\\tstandards of evil, which it thinks to be good. But Faith\\n\\t\\t\\t\\tis not to be cowed down by Force. Its source of strength\\n\\t\\t\\t\\tis Allah, and it receives the assurance that violence\\n\\t\\t\\t\\twill perish ultimately by violence, and that Faith and\\n\\t\\t\\t\\tGood must stand and be established. In fact the good must\\n\\t\\t\\t\\tinherit the earth and the evil ones be blotted out."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "14",
    "NoteID": "1888",
    "Body": "\"Fear\" means here \"have present before their minds\\n\\t\\t\\t\\tsomething which should cause fear, so that they should\\n\\t\\t\\t\\tshape their conduct in order to avoid the ill\\n\\t\\t\\t\\tconsequences of wickedness.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "15",
    "NoteID": "1889",
    "Body": "Cf. viii. 19. 1 have assumed that \"they\" in this verse is\\n\\t\\t\\t\\tthe same as \"them\" in the preceding verse, i.e., the\\n\\t\\t\\t\\tungodly. Hoping for victory they forced a decision, and\\n\\t\\t\\t\\tthey got it-against themselves. Or they challenged a\\n\\t\\t\\t\\tpunishment, and it came in good time. Some Commentators\\n\\t\\t\\t\\tconstrue \"they\" here to mean \"the Prophets\": in that case\\n\\t\\t\\t\\tthe verse would mean: \"The Prophets prayed for a victory\\n\\t\\t\\t\\tand decision, and the ungodly were frustrated in their\\n\\t\\t\\t\\tefforts to suppress the Truth.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "15",
    "NoteID": "1890",
    "Body": "Cf. xi. 59."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "17",
    "NoteID": "1891",
    "Body": "A graphic and deterrent picture, from the preaching of\\n\\t\\t\\t\\tthe earlier Prophets, of unrelieved horror of the\\n\\t\\t\\t\\ttorments of Hell. The door of escape by annihilation is\\n\\t\\t\\t\\talso closed to them."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "18",
    "NoteID": "1892",
    "Body": "Note the fullness of the parable. The works of the\\n\\t\\t\\t\\tungodly are in themselves light and unsubstantial like\\n\\t\\t\\t\\tashes; they are the useless rubbish that remains out of\\n\\t\\t\\t\\tthe faculties and opportunities which they have misused\\n\\t\\t\\t\\tby burning them up. Further, the ashes are blown about\\n\\t\\t\\t\\thither and thither by the wind: the ungodly have no\\n\\t\\t\\t\\tcompass, direction, or purpose that can stand. The wind,\\n\\t\\t\\t\\ttoo, which blows on them is no ordinary wind, nor the day\\n\\t\\t\\t\\ton which they seek to enjoy the fruits of their labours\\n\\t\\t\\t\\tan ordinary tranquil day: a furious gale is blowing, for\\n\\t\\t\\t\\tsuch is the Wrath of Allah. They have neither internal\\n\\t\\t\\t\\tpeace nor external gain. In the scattering of the ashes\\n\\t\\t\\t\\tthey lose control even of such things as they might have\\n\\t\\t\\t\\tearned but for their misdeeds. Their whole nature is\\n\\t\\t\\t\\tcontaminated. All their wishes go astray. They are\\n\\t\\t\\t\\tcarried so far, far away from what was in their minds.\\n\\t\\t\\t\\tWhat did they aim at, and what did they achieve?"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "19",
    "NoteID": "1893",
    "Body": "Haqq: Truth, Right, Righteousness, True proportions,\\n\\t\\t\\t\\tReality. Allah's creation is not to be trifled with. It\\n\\t\\t\\t\\tis built on righteousness, and those who do not obey its\\n\\t\\t\\t\\tlaws must give place to others who do. This warning is\\n\\t\\t\\t\\trepeated again and again in history and in revelation.\\n\\t\\t\\t\\tCf. vi. 73."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "20",
    "NoteID": "1894",
    "Body": "'Aziz: great, mighty, excellent, powerful, rare,\\n\\t\\t\\t\\tprecious."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "21",
    "NoteID": "1895",
    "Body": "When the time for judgment comes, there are two kinds of\\n\\t\\t\\t\\tdisillusionment waiting for the ungodly: (1) Those who\\n\\t\\t\\t\\twere misled and failed to see that each soul bears its\\n\\t\\t\\t\\town personal responsibility (ii. 134) and cannot shift it\\n\\t\\t\\t\\ton to others, will turn to those who misled them, in the\\n\\t\\t\\t\\thope that they might intercede for them or do something\\n\\t\\t\\t\\tto help them. They receive a plain answer as in the\\n\\t\\t\\t\\tlatter part of this verse. (2) Those who relied on Satan,\\n\\t\\t\\t\\tHis answer (in xiv. 22 below) is frank, cynical and\\n\\t\\t\\t\\tbrutal."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "21",
    "NoteID": "1896",
    "Body": "Those whose power or specious intelligence or influence\\n\\t\\t\\t\\tmisled them-such as false priests or leaders-will find\\n\\t\\t\\t\\tthemselves in a parlous state. How can they help others?\\n\\t\\t\\t\\tThey themselves failed to profit from Allah's guidance,\\n\\t\\t\\t\\tand they can with some justice retort that they put them\\n\\t\\t\\t\\tin the wrong path as they followed it themselves!"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "22",
    "NoteID": "1897",
    "Body": "After the Judgment, Evil declares itself in its true\\n\\t\\t\\t\\tcolours. Frankly it says: 'I deceived you. The promise of\\n\\t\\t\\t\\tAllah was true, but you believed me rather than Allah. I\\n\\t\\t\\t\\thad no power to force you. I had but to call you, and you\\n\\t\\t\\t\\tcame running after me. You must blame yourselves. Did you\\n\\t\\t\\t\\tthink I was equal with Allah? I know too well that I was\\n\\t\\t\\t\\tnot and never could be. If you did wrong, you must suffer\\n\\t\\t\\t\\tthe Penalty.'"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "22",
    "NoteID": "1898",
    "Body": "See the last note. An alternative interpretation of this\\n\\t\\t\\t\\tsentence may be: \"I had already beforehand rebelled\\n\\t\\t\\t\\tagainst Allah with Whom ye associated me.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "23",
    "NoteID": "1899",
    "Body": "How this contrasts with the misery and the mutual\\n\\t\\t\\t\\tself-recriminations of the ungodly!"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "24",
    "NoteID": "1900",
    "Body": "\"Goodly word\" is usually interpreted as the Divine Word,\\n\\t\\t\\t\\tthe Divine Message, the True Religion. It may also be\\n\\t\\t\\t\\tinterpreted in a more general sense as a word of truth, a\\n\\t\\t\\t\\tword of goodness or kindness, which follows from a true\\n\\t\\t\\t\\tappreciation of Religion. For Religion includes our duty\\n\\t\\t\\t\\tto Allah and our duty to man. The \"evil word\" is opposite\\n\\t\\t\\t\\tto this: false religion, blasphemy, false speech, or\\n\\t\\t\\t\\tpreaching or teaching unkindness and wrong-doing."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "25",
    "NoteID": "1901",
    "Body": "The goodly tree is known for: (1) its beauty; it gives\\n\\t\\t\\t\\tpleasure to all who see it; (2) its stability; it remains\\n\\t\\t\\t\\tfirm and unshaken in storms, because its roots are firmly\\n\\t\\t\\t\\tfixed in the earth; (3) its wide compass; its branches\\n\\t\\t\\t\\treach high, and it catches all the sunshine from heaven,\\n\\t\\t\\t\\tand gives shade to countless birds in its branches and\\n\\t\\t\\t\\tmen and animals beneath it, and (4) its abundant fruit,\\n\\t\\t\\t\\twhich it yields at all times. So is the Good Word. It is\\n\\t\\t\\t\\tas beautiful as it is true. It abides in all the changes\\n\\t\\t\\t\\tand chances of this life, and even beyond (see verse 27\\n\\t\\t\\t\\tbelow); it is never shaken by sorrow or what seems to us\\n\\t\\t\\t\\tcalamity; its roots are deep down in the bed-rock facts\\n\\t\\t\\t\\tof life. Its reach is universal, above, around, below: it\\n\\t\\t\\t\\tis illuminated by the divine light from heaven, and its\\n\\t\\t\\t\\tconsolation reaches countless beings of all grades of\\n\\t\\t\\t\\tlife. Its fruit-the enjoyment of its blessings-is not\\n\\t\\t\\t\\tconfined to one season or one set of circumstances;\\n\\t\\t\\t\\tfurthermore the fortunate man who is the vehicle of that\\n\\t\\t\\t\\tword has no self-pride; he attributes all its goodness,\\n\\t\\t\\t\\tand his act in spreading it, to the Will and Leave of\\n\\t\\t\\t\\tAllah. Cf. the New Testament Parable of the Sower (Matt.\\n\\t\\t\\t\\tiv. 14-20) or of the Mustard-seed (Matt. iv. 30- 32). In\\n\\t\\t\\t\\tthis Parable of the Qur-an there are fewer words and more\\n\\t\\t\\t\\tspiritual meaning, and the emphasis is on more essential\\n\\t\\t\\t\\tthings."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "26",
    "NoteID": "1902",
    "Body": "The evil tree is the opposite of the goodly tree. The\\n\\t\\t\\t\\tparallelism of contrast can be followed out in all the\\n\\t\\t\\t\\tdetails of the last note."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "27",
    "NoteID": "1903",
    "Body": "His Will and Plan may be above comprehension, but will\\n\\t\\t\\t\\tprevail over all things. It is not like the will of man,\\n\\t\\t\\t\\twho may plan good things but is not necessarily able to\\n\\t\\t\\t\\tcarry them out."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "28",
    "NoteID": "1904",
    "Body": "There is a particular and a general meaning. The\\n\\t\\t\\t\\tparticular meaning is understood to be a reference to the\\n\\t\\t\\t\\tMakkan Pagans who turned the House of Allah into a place\\n\\t\\t\\t\\tfor the worship of horrible idols and the practice of\\n\\t\\t\\t\\tunseemly rites and cults. There is no real difficulty in\\n\\t\\t\\t\\taccepting this as part of a late Makkan Sura even without\\n\\t\\t\\t\\tsupposing it to be a prophecy. The Makkan Pagans had\\n\\t\\t\\t\\tturned Religion into a blasphemous superstition, and were\\n\\t\\t\\t\\tmisguiding their people, persecuting the true Messenger\\n\\t\\t\\t\\tof Allah and all who followed his teaching. Their cup of\\n\\t\\t\\t\\tiniquity seemed about full, and they seemed to be heading\\n\\t\\t\\t\\tto perdition, as later events indeed showed to be the\\n\\t\\t\\t\\tcase. The general meaning is also clear. Selfish men,\\n\\t\\t\\t\\twhen they seize power, want worship for themselves or\\n\\t\\t\\t\\ttheir Phantasies, in derogation of the true God. Power,\\n\\t\\t\\t\\twhich should have been an instrument of good, becomes in\\n\\t\\t\\t\\ttheir hands an instrument of evil. They and their people\\n\\t\\t\\t\\trush headlong to perdition. \"These be thy gods, 0\\n\\t\\t\\t\\tIsrael!\" has been a cry repeated again and again in\\n\\t\\t\\t\\thistory, in the face, or at the back, of men of God!"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "31",
    "NoteID": "1905",
    "Body": "Putting ourselves back in the position in which the\\n\\t\\t\\t\\tMuslim community found themselves in Makkah just before\\n\\t\\t\\t\\tthe Hijrat, we can imagine how much encouragement and\\n\\t\\t\\t\\tconsolation they needed from the preaching, the Faith,\\n\\t\\t\\t\\tand the steadfast character of Al-Mustafa. Intolerant\\n\\t\\t\\t\\tpersecution was the order of the day; neither the life\\n\\t\\t\\t\\tnor the property or reputation of the Muslims was safe.\\n\\t\\t\\t\\tThey are asked to find strength and tranquillity in\\n\\t\\t\\t\\tprayer and in helping each other according to their needs\\n\\t\\t\\t\\tand resources."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "31",
    "NoteID": "1906",
    "Body": "Here, as elsewhere, \"Sustenance\" is to be taken in the\\n\\t\\t\\t\\tliteral as well as the metaphorical sense. There were\\n\\t\\t\\t\\tmany among the Muslims who were poor, or slaves, or\\n\\t\\t\\t\\tdepressed, because they were deprived of the means of\\n\\t\\t\\t\\tlivelihood on account of their Faith. They were to be\\n\\t\\t\\t\\tfed, clothed, and sheltered, by those who had means.\\n\\t\\t\\t\\tCharity was to be ordinarily secret, so as to cut out all\\n\\t\\t\\t\\tshow or parade, and perhaps also lest the enemy should\\n\\t\\t\\t\\tdry up those sources by unprincipled violence; but there\\n\\t\\t\\t\\tmust be much that had to be open and organised, so that\\n\\t\\t\\t\\tall the needy could know where to go to be relieved."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "31",
    "NoteID": "1907",
    "Body": "The great Day of Reckoning would be one on which all\\n\\t\\t\\t\\tvalues would be changed. Wealth, as understood in this\\n\\t\\t\\t\\tworld, would no longer count. Should we not therefore use\\n\\t\\t\\t\\tany wealth we have in this life, to give here and receive\\n\\t\\t\\t\\tthere? Bai inlcudes all bargaining,-barter, purchase and\\n\\t\\t\\t\\tsale, etc. In this world, where wealth has some value,\\n\\t\\t\\t\\tlet us spend it and get for ourselves \"treasures in\\n\\t\\t\\t\\theaven.\" In the next life each man will stand on his\\n\\t\\t\\t\\tmerits and personal responsibility. One man cannot help\\n\\t\\t\\t\\tanother. Let us here help each other to become true and\\n\\t\\t\\t\\trighteous, so that our personal account may be favourable\\n\\t\\t\\t\\tthere."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "32",
    "NoteID": "1908",
    "Body": "We must realise that behind all our strength, skill, and\\n\\t\\t\\t\\tintelligence there is the power and goodness of Allah,\\n\\t\\t\\t\\tWho gave us all these things. Man can understand and\\n\\t\\t\\t\\tcontrol the forces of nature so as to bring them to his\\n\\t\\t\\t\\town service: he can only do so, because (1) he has got\\n\\t\\t\\t\\tthese gifts from Allah, and (2) Allah has fixed definite\\n\\t\\t\\t\\tlaws in nature, of which he can take advantage by Allah's\\n\\t\\t\\t\\tcommand and permission. He has been made Vicegerent on\\n\\t\\t\\t\\tearth (ii. 30); Allah commanded the highest creatures to\\n\\t\\t\\t\\tbow down to Adam (ii. 34). Man, by Allah's command, can\\n\\t\\t\\t\\tuse rain to produce food for himself; make ships to sail\\n\\t\\t\\t\\tthe seas; use rivers as highways, and cut canals for\\n\\t\\t\\t\\ttraffic and irrigation. Not only this, but even the\\n\\t\\t\\t\\theavenly bodies can (by Allah's command) contribute to\\n\\t\\t\\t\\this needs (see next verse)."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "33",
    "NoteID": "1909",
    "Body": "The sun gives out heat, which is the source of all life\\n\\t\\t\\t\\tand energy on this planet, and produces the seasons of\\n\\t\\t\\t\\tthe year, by utilising which man can supply his needs,\\n\\t\\t\\t\\tnot only material, but immaterial in the shape of light,\\n\\t\\t\\t\\thealth, and other blessings. The sun and the moon\\n\\t\\t\\t\\ttogether produce tides, and are responsible for\\n\\t\\t\\t\\tatmospheric changes which are of the highest importance\\n\\t\\t\\t\\tin the life of man. The succession of Day and Night is\\n\\t\\t\\t\\tdue to the apparent daily course of the sun through the\\n\\t\\t\\t\\tskies; and the cool light of the moon performs other\\n\\t\\t\\t\\tservices different from those of warm day-light. Because\\n\\t\\t\\t\\tthere are laws here, which man can understand and\\n\\t\\t\\t\\tcalculate, he can use all such things for his own\\n\\t\\t\\t\\tservice, and in that sense the heavenly bodies are\\n\\t\\t\\t\\tthemselves made subject to him by Allah's command."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "34",
    "NoteID": "1910",
    "Body": "Sincere and true prayer in faith is answered by Allah.\\n\\t\\t\\t\\tThus He gives us everything which a wise and benevolent\\n\\t\\t\\t\\tProvidence can give."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "34",
    "NoteID": "1911",
    "Body": "I have tried to render the intensive forms of the Arabic\\n\\t\\t\\t\\tby what I consider their near equivalent here: the phrase\\n\\t\\t\\t\\t\"given up to injustice and ingratitude\" suggests habitual\\n\\t\\t\\t\\tignoring of just values and ingratitude for the\\n\\t\\t\\t\\tinnumerable gifts and favours which Allah has showered on\\n\\t\\t\\t\\tmankind."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "35",
    "NoteID": "1912",
    "Body": "This Prayer of Abraham, the True in Faith, the progenitor\\n\\t\\t\\t\\tof the Semitic peoples and the Prototype of their\\n\\t\\t\\t\\tReligion, is introduced in this place, to illustrate the\\n\\t\\t\\t\\tpoints referred to in the preceding section, xiv. 31-34,\\n\\t\\t\\t\\tviz., how the new Revelation through the Ka'ba bears out\\n\\t\\t\\t\\tthe universal Revelation of Prayer and Charity, Love of\\n\\t\\t\\t\\tAllah and man, Recognition of Allah's handiwork in\\n\\t\\t\\t\\tnature, and Insistence on man's turning away from false\\n\\t\\t\\t\\tworship and ingratitude to Allah. Notice the four\\n\\t\\t\\t\\tdivisions into which it falls: (1) verses 35-36 are\\n\\t\\t\\t\\tspoken by Abraham as on his own behalf (\"O my Lord!\");\\n\\t\\t\\t\\t(2) verses 37-38 are spoken on behalf of his progeny (\"O\\n\\t\\t\\t\\tour Lord!\") but with special reference to the elder\\n\\t\\t\\t\\tbranch, the children of Isma'il; (3) verses 39-40 are\\n\\t\\t\\t\\tagain a personal appeal, but both branches of his family,\\n\\t\\t\\t\\tviz., the sons of Isma'il and Isaac, are expressly\\n\\t\\t\\t\\tmentioned; (4) verse 41 is a Prayer for himself, his\\n\\t\\t\\t\\tparents, and all Believers, typifying that in the\\n\\t\\t\\t\\tuniversality of Islam all nations are to be blessed.\\n\\t\\t\\t\\tJerusalem, for the Mosaic Law and the Gospel of Jesus,\\n\\t\\t\\t\\twas the centre and symbol for the Jewish race, though of\\n\\t\\t\\t\\tcourse all Allah's Truth is universal; Makkah, the centre\\n\\t\\t\\t\\tof the Arab race, was to throw off its tribal character\\n\\t\\t\\t\\tand become universal, in spite of the Makkans themselves."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "35",
    "NoteID": "1913",
    "Body": "Cf. ii. 125-129. Abraham (with Isma'il) built the Ka'ba,\\n\\t\\t\\t\\tand Abraham asks a blessing on his handiwork and\\n\\t\\t\\t\\tforgiveness for such lapses into idolatry as both\\n\\t\\t\\t\\tbranches of his family might fall into."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "37",
    "NoteID": "1914",
    "Body": "The Makkan valley is enclosed by hills on all sides,\\n\\t\\t\\t\\tunlike Madinah, which has level cultivated plains. But\\n\\t\\t\\t\\tjust because of its natural isolation, it is fitted to be\\n\\t\\t\\t\\ta centre for Prayer and Praise."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "37",
    "NoteID": "1915",
    "Body": "Cf. ii. 126, and n. 128. (The \"Fruits\" are there\\n\\t\\t\\t\\texplained). The righteous, though they have to have\\n\\t\\t\\t\\tsustenance, both in a literal and figurative sense,\\n\\t\\t\\t\\trequire also the love and sympathy of their fellow-men."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "38",
    "NoteID": "1916",
    "Body": "In Abraham's prophetic mind was the secret and open\\n\\t\\t\\t\\tenmity or contempt which the Children of Israel were to\\n\\t\\t\\t\\thave for the Children of Isma'il (Arabs). He prays to\\n\\t\\t\\t\\tAllah that they may be united in Islam, as indeed they\\n\\t\\t\\t\\twere, except a small remnant."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "39",
    "NoteID": "1917",
    "Body": "Abraham was 100 years old when Isaac was born (Gen. xxi.\\n\\t\\t\\t\\t5); and as Isma'il was 13 years old when Abraham was 99.\\n\\t\\t\\t\\t(Gen. xvii. 24-25), Isma'il was also a son of his\\n\\t\\t\\t\\tfather's old age, having been born when Abraham was 86\\n\\t\\t\\t\\tyears old. The younger son's progeny developed the Faith\\n\\t\\t\\t\\tof Israel and that of Christ; the elder son's progeny\\n\\t\\t\\t\\tperfected the more universal Faith of Islam, the Faith of\\n\\t\\t\\t\\tAbraham the True."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "40",
    "NoteID": "1918",
    "Body": "Abraham prays for both branches of his family, having a\\n\\t\\t\\t\\twider vision than some of the later Children of Israel."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "41",
    "NoteID": "1919",
    "Body": "Read again n. 1912 above. Having prayed for his progeny,\\n\\t\\t\\t\\tAbraham now prays for Allah's grace on himself, his\\n\\t\\t\\t\\tparents, and the whole Brotherhood of Faith, irrespective\\n\\t\\t\\t\\tof family or race or time, to be perfected in the ideal\\n\\t\\t\\t\\tof Islam."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "41",
    "NoteID": "1920",
    "Body": "For the shades of meaning in the different words for\\n\\t\\t\\t\\tForgiveness, see n. 110 to ii. 109."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "41",
    "NoteID": "1921",
    "Body": "My parents. Abraham's father was an idolater (xliii. 26;\\n\\t\\t\\t\\tvi. 74). Not only that, but he persecuted the Faith of\\n\\t\\t\\t\\tUnity and threatened Abraham with stoning and exile (xix.\\n\\t\\t\\t\\t46); and he and his people cast him into the Fire to be\\n\\t\\t\\t\\tburned (xxi. 52, 68). Yet Abraham's heart was tender, and\\n\\t\\t\\t\\the prayed for forgiveness for his father because of a\\n\\t\\t\\t\\tpromise which he had made (ix. 114), though he renounced\\n\\t\\t\\t\\tthe land of his fathers (Chaldea)."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "41",
    "NoteID": "1922",
    "Body": "At the final Reckoning, all that may seem inequality or\\n\\t\\t\\t\\tinjustice in this world will be redressed. But the merits\\n\\t\\t\\t\\tof the best of us will need Allah's Grace to establish us\\n\\t\\t\\t\\tin that lasting Felicity which is promised to the\\n\\t\\t\\t\\trighteous. And Abraham, as the father of Prophecy, prayed\\n\\t\\t\\t\\tfor all,-for the Universal Faith perfected in Islam."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "43",
    "NoteID": "1923",
    "Body": "A picture of horror. The evil ones, when they realise the\\n\\t\\t\\t\\tsituation, will be dazed; their eyes will stare without\\n\\t\\t\\t\\texpression, and never move back; their necks will be\\n\\t\\t\\t\\toutstretched; their heads uplifted in terror of the\\n\\t\\t\\t\\tJudgment from on High; and their hearts become empty of\\n\\t\\t\\t\\tall hope or intelligence as the physical heart might\\n\\t\\t\\t\\tbecome empty of blood when the circulation stops. In this\\n\\t\\t\\t\\tstate they will press forward to Judgment."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "44",
    "NoteID": "1924",
    "Body": "Zawal = decline from the zenith, as that of the sun,\\n\\t\\t\\t\\tdecline from the highest point reached by a heavenly body\\n\\t\\t\\t\\tin its course through the sky. The ungodly are apt to\\n\\t\\t\\t\\tthink that their power will remain in the ascendant, on\\n\\t\\t\\t\\taccount of some material advantages given them\\n\\t\\t\\t\\ttemporarily by Allah, but they are constantly receiving\\n\\t\\t\\t\\twarnings in history and revelation and from the example\\n\\t\\t\\t\\tof others before them. There is a warning to the\\n\\t\\t\\t\\tcontemporary Pagan Makkans here; but the warning is\\n\\t\\t\\t\\tperfectly general, and for all time."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "48",
    "NoteID": "1925",
    "Body": "\"A new earth and a new heaven\" refers to the entirely\\n\\t\\t\\t\\tchanged conditions at the end of things as we know them.\\n\\t\\t\\t\\tCf. xx. 105-107, xxxix. 67, 69, lxxiii. 14, lxxxii. 1,\\n\\t\\t\\t\\tlxxxiv. 3."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "49",
    "NoteID": "1926",
    "Body": "Cf. xxxvi. 8, Ix. 71, lxix. 30."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "50",
    "NoteID": "1927",
    "Body": "Sirbal,- plural, Sarabil,- a garment or coat of mail,\\n\\t\\t\\t\\tbreast plate; something covering the most vital parts of\\n\\t\\t\\t\\tthe body; like the shirt or the Indian kurta."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "50",
    "NoteID": "1928",
    "Body": "Qatiran: black pitch, a resinous substance exuding from\\n\\t\\t\\t\\tcertain kinds of trees like the terebinth or the pines,\\n\\t\\t\\t\\tor distilled from wood or coal. It catches fire readily.\\n\\t\\t\\t\\tIssuing from the upper garments (Sarabil) the flames soon\\n\\t\\t\\t\\tcover the face, the most expressive part of man's essence\\n\\t\\t\\t\\tor being. The metaphor of fetters (n. 1926) is now\\n\\t\\t\\t\\tchanged to that of pitch, which darkens and sets on fire\\n\\t\\t\\t\\tthe soul of man."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "51",
    "NoteID": "1929",
    "Body": "Its deserts: i.e., according to what it earned by its own\\n\\t\\t\\t\\tacts, good or evil, in its life of probation."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "51",
    "NoteID": "1930",
    "Body": "Swift in calling to account: We can understand this in\\n\\t\\t\\t\\ttwo significations. (1) Let not the wicked think that\\n\\t\\t\\t\\tbecause Allah, out of His infinite grace and mercy,\\n\\t\\t\\t\\tgrants respite, therefore the retribution will be slow in\\n\\t\\t\\t\\tcoming. When the time comes in accordance with Allah's\\n\\t\\t\\t\\tPlan and Wisdom, the retribution will come so swiftly\\n\\t\\t\\t\\tthat the ungodly will be surprised and they will wish\\n\\t\\t\\t\\tthey could get more respite (xiv. 44). (2) On the great\\n\\t\\t\\t\\tDay of Reckoning, let it not be supposed that, because\\n\\t\\t\\t\\tthere will be millions of souls to be judged, there will\\n\\t\\t\\t\\tbe any delay in judgment as in a human tribunal. It will\\n\\t\\t\\t\\tbe a new world and beyond the flight of Time. Or if a\\n\\t\\t\\t\\tmetaphor from time as we conceive it in this world can be\\n\\t\\t\\t\\ttaken, it will all be as it were in the twinkling of an\\n\\t\\t\\t\\teye (xvi. 77)."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "52",
    "NoteID": "1931",
    "Body": "Here is another aspect of the Truth of Unity. Allah being\\n\\t\\t\\t\\tOne, all justice is of one standard, for Truth is one,\\n\\t\\t\\t\\tand we see it as one as soon as the scales of phenomenal\\n\\t\\t\\t\\tdiversity fall from our eyes. The one true Reality then\\n\\t\\t\\t\\temerges. Blessed are those who treasured this Truth in\\n\\t\\t\\t\\ttheir souls already in their life of probation."
  }
]
