[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/024001",
        "Body":  "A Surah which We have sent down and which We have ordained: in it\n\t\t\thave We sent down Clear Signs in order that ye may receive\n\t\t\tadmonition. \u003cspan class=\u0027fn\u0027\u003e2953\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/024010",
        "Body":  "If it were not for Allah\u0027s grace and mercy on you and that Allah\n\t\t\tis Oft-Returning Full of Wisdom (ye would be ruined indeed).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e2961\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/024011",
        "Body":  "Those who brought forward the lie are a body among yourselves:\n\t\t\tthink it not to be an evil to you: on the contrary it is good for\n\t\t\tyou: to every man among them (will come the punishment) of the\n\t\t\tsin that he earned and to him who took on himself the lead among\n\t\t\tthem will be a Penalty grievous. \u003cspan class=\u0027fn\u0027\u003e2962\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2963\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e2964\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/024012",
        "Body":  "Why did not Believers men and women when ye heard of the affair \n\t\t\tput the best construction on it in their own minds and say \"This\n\t\t\t(charge) is an obvious lie\"? \u003cspan class=\u0027fn\u0027\u003e2965\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/024013",
        "Body":  "Why did they not bring four witnesses to prove it? When they have\n\t\t\tnot brought the witnesses such men in the sight of Allah (stand\n\t\t\tforth) themselves as liars! \u003cspan class=\u0027fn\u0027\u003e2966\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/024014",
        "Body":  "Were it not for the grace and mercy of Allah on you in this world\n\t\t\tand the Hereafter a grievous penalty would have seized you in\n\t\t\tthat ye rushed glibly into this affair. \u003cspan class=\u0027fn\u0027\u003e2967\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/024015",
        "Body":  "Behold ye received it on your tongues and said out of your mouths\n\t\t\tthings of which ye had no knowledge; and ye thought it to be a\n\t\t\tlight matter while it was most serious in the sight of Allah.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e2968\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/024016",
        "Body":  "And why did ye not when ye heard it say \"It is not right of us to\n\t\t\tspeak of this: Glory to Allah! this is a most serious slander!\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e2969\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/024017",
        "Body":  "Allah doth admonish you that ye may never repeat such (conduct)\n\t\t\tif ye are (true) Believers."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/024018",
        "Body":  "And Allah makes the Signs plain to you: for Allah is full of\n\t\t\tknowledge and wisdom."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/024019",
        "Body":  "Those who love (to see) scandal published broadcast among the\n\t\t\tBelievers will have a grievous Penalty in this life and in the\n\t\t\tHereafter: Allah knows and ye know not. \u003cspan class=\u0027fn\u0027\u003e2970\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/024002",
        "Body":  "The woman and the man guilty of adultery or fornication flog each\n\t\t\tof them with a hundred stripes: let not compassion move you in\n\t\t\ttheir case in a matter prescribed by Allah if ye believe in Allah\n\t\t\tand the Last Day: and let a party of the Believers witness their\n\t\t\tpunishment. \u003cspan class=\u0027fn\u0027\u003e2954\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2955\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2956\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/024020",
        "Body":  "Were it not for the grace and mercy of Allah on you and that\n\t\t\tAllah is full of kindness and mercy (ye would be ruined indeed).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e2971\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/024021",
        "Body":  "O ye who believe! follow not Satan\u0027s footsteps: if any will\n\t\t\tfollow the footsteps of Satan he will (but) command what is\n\t\t\tshameful and wrong: and were it not for the grace and mercy of\n\t\t\tAllah on you not one of you would ever have been pure: but Allah\n\t\t\tdoth purify whom He pleases: and Allah is One Who hears and knows\n\t\t\t(all things). \u003cspan class=\u0027fn\u0027\u003e2972\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2973\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/024022",
        "Body":  "Let not those among you who are endued with grace and amplitude\n\t\t\tof means resolve by oath against helping their kinsmen those in\n\t\t\twant and those who have left their homes in Allah\u0027s cause: let\n\t\t\tthem forgive and overlook: do you not wish that Allah should\n\t\t\tforgive you? For Allah is Oft-Forgiving Most Merciful.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e2974\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/024023",
        "Body":  "Those who slander chaste women indiscreet but believing are\n\t\t\tcursed in this life and in the Hereafter: for them is a grievous\n\t\t\tPenalty \u003cspan class=\u0027fn\u0027\u003e2975\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/024024",
        "Body":  "On the Day when their tongues their hands and their feet will\n\t\t\tbear witness against them as to their actions. \u003cspan class=\u0027fn\u0027\u003e2976\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/024025",
        "Body":  "On that Day Allah will pay them back (all) their just dues and\n\t\t\tthey will realize that Allah is the (very) Truth that makes all\n\t\t\tthings manifest. \u003cspan class=\u0027fn\u0027\u003e2977\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/024026",
        "Body":  "Women impure are for men impure and men impure are for women\n\t\t\timpure; and women of purity are for men of purity and men of\n\t\t\tpurity are for women of purity: these are not affected by what\n\t\t\tpeople say: for them there is forgiveness and a provision\n\t\t\thonorable. \u003cspan class=\u0027fn\u0027\u003e2978\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2979\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/024027",
        "Body":  "O ye who believe! enter not houses other than your own until ye\n\t\t\thave asked permission and saluted those in them: that is best for\n\t\t\tyou in order that ye may heed (what is seemly). \u003cspan class=\u0027fn\u0027\u003e2980\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/024028",
        "Body":  "If ye find no one in the house enter not until permission is\n\t\t\tgiven to you: if ye are asked to go back go back: that makes for\n\t\t\tgreater purity for yourselves: and Allah knows well all that ye\n\t\t\tdo. \u003cspan class=\u0027fn\u0027\u003e2981\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/024029",
        "Body":  "It is no fault on your part to enter houses not used for living\n\t\t\tin which serve some (other) use for you: and Allah has knowledge\n\t\t\tof what ye reveal and what ye conceal. \u003cspan class=\u0027fn\u0027\u003e2982\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/024003",
        "Body":  "Let no man guilty of adultery or fornication marry any but a\n\t\t\twoman similarly guilty or an Unbeliever nor let any but such a\n\t\t\tman or an Unbeliever marry such a woman: to the Believers such a\n\t\t\tthing is forbidden. \u003cspan class=\u0027fn\u0027\u003e2957\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/024030",
        "Body":  "Say to the believing men that they should lower their gaze and\n\t\t\tguard their modesty: that will make for greater purity for them:\n\t\t\tand Allah is well acquainted with all that they do. \u003cspan class=\u0027fn\u0027\u003e2983\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/024031",
        "Body":  "And say to the believing women that they should lower their gaze\n\t\t\tand guard their modesty; that they should not display their\n\t\t\tbeauty and ornaments except what (must ordinarily) appear\n\t\t\tthereof; that they should draw their veils over their bosoms and\n\t\t\tnot display their beauty except to their husbands their fathers\n\t\t\ttheir husbands\u0027 fathers their sons their husbands\u0027 sons their\n\t\t\tbrothers or their brothers\u0027 sons or their sisters\u0027 sons or their\n\t\t\twomen or the slaves whom their right hands possess or male\n\t\t\tservants free of physical needs or small children who have no\n\t\t\tsense of the shame of sex; and that they should not strike their\n\t\t\tfeet in order to draw attention to their hidden ornaments.  And O\n\t\t\tye Believers! turn ye all together towards Allah that ye may\n\t\t\tattain Bliss. \u003cspan class=\u0027fn\u0027\u003e2984\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2985\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2986\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e2987\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/024032",
        "Body":  "Marry those among you who are single or the virtuous ones among\n\t\t\tyour slaves male or female: if they are in poverty Allah will\n\t\t\tgive them means out of His grace: for Allah encompasseth all and\n\t\t\tHe knoweth all things. \u003cspan class=\u0027fn\u0027\u003e2988\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2989\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/024033",
        "Body":  "Let those who find not the wherewithal for marriage keep\n\t\t\tthemselves chaste until Allah gives them means out of His grace. \n\t\t\tAnd if any of your slaves ask for a deed in writing (to enable\n\t\t\tthem to earn their freedom for a certain sum) give them such a\n\t\t\tdeed if ye know any good in them; yea give them something\n\t\t\tyourselves out of the means which Allah has given to you.  But\n\t\t\tforce not your maids to prostitution when they desire chastity in\n\t\t\torder that ye may make a gain in the goods of this life.  But if\n\t\t\tanyone compels them yet after such compulsion is Allah\n\t\t\tOft-Forgiving Most Merciful (to them). \u003cspan class=\u0027fn\u0027\u003e2990\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e2991\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2992\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2993\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2994\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/024034",
        "Body":  "We have already sent down to you verses making things clear an\n\t\t\tillustration from (the story of) people who passed away before\n\t\t\tyou and an admonition for those who fear (Allah). \u003cspan class=\u0027fn\u0027\u003e2995\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/024035",
        "Body":  "Allah is the Light of the heavens and the earth.  The parable of\n\t\t\tHis Light is as if there were a Niche and within it a lamp: the\n\t\t\tLamp enclosed in Glass: the glass as it were a brilliant star:\n\t\t\tlit from a blessed Tree an Olive neither of the East nor of the\n\t\t\tWest whose Oil is well-nigh luminous though fire scarce touched\n\t\t\tit: Light upon Light! Allah doth guide whom He will to His Light.\n\t\t\tAllah doth set forth Parables for men: and Allah doth know all\n\t\t\tthings. \u003cspan class=\u0027fn\u0027\u003e2996\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2997\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2998\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e2999\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3000\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3001\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3002\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3003\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/024036",
        "Body":  "(Lit is such a light) in houses which Allah hath permitted to be\n\t\t\traised to honor; for the celebration in them of His name: in them\n\t\t\tis He glorified in the mornings and in the evenings (again and\n\t\t\tagain) \u003cspan class=\u0027fn\u0027\u003e3004\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3005\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3006\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/024037",
        "Body":  "By men whom neither traffic nor merchandise can divert from the\n\t\t\tRemembrance of Allah nor from regular Prayer nor from the\n\t\t\tpractice of regular Charity: their (only) fear is for the Day\n\t\t\twhen hearts and eyes will be transformed (in a world wholly new)\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3007\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3008\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/024038",
        "Body":  "That Allah may reward them according to the best of their deeds\n\t\t\tand add even more for them out of His Grace: for Allah doth\n\t\t\tprovide for those whom He will without measure. \u003cspan class=\u0027fn\u0027\u003e3009\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/024039",
        "Body":  "But the Unbelievers their deeds are like a mirage in sandy\n\t\t\tdeserts which the man parched with thirst mistakes for water;\n\t\t\tuntil when he comes up to it he finds it to be nothing: but he\n\t\t\tfinds Allah (ever) with him and Allah will pay him his account:\n\t\t\tand Allah is swift in taking account. \u003cspan class=\u0027fn\u0027\u003e3010\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3011\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3012\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/024004",
        "Body":  "And those who launch a charge against chaste women and produce\n\t\t\tnot four witnesses (to support their allegation) flog them with\n\t\t\teighty stripes: and reject their evidence ever after: for such\n\t\t\tmen are wicked transgressors \u003cspan class=\u0027fn\u0027\u003e2958\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/024040",
        "Body":  "Or (the Unbelievers\u0027 state) is like the depths of darkness in a\n\t\t\tvast deep ocean overwhelmed with billow topped by billow topped\n\t\t\tby (dark) clouds: depths of darkness one above another: if a man\n\t\t\tstretches out his hand he can hardly see it! for any to whom\n\t\t\tAllah giveth not light there is no light! \u003cspan class=\u0027fn\u0027\u003e3013\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3014\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3015\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/024041",
        "Body":  "Seest thou not that it is Allah Whose praises all beings in the\n\t\t\theavens and on earth do celebrate and the birds (of the air) with\n\t\t\twings outspread? Each one knows its own (mode of) prayer and\n\t\t\tpraise.  And Allah knows well all that they do. \u003cspan class=\u0027fn\u0027\u003e3016\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3017\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/024042",
        "Body":  "Yea to Allah belongs the dominion of the heavens and the earth;\n\t\t\tand to Allah is the final goal (of all). \u003cspan class=\u0027fn\u0027\u003e3018\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/024043",
        "Body":  "Seest thou not that Allah makes the clouds move gently then joins\n\t\t\tthem together then makes them into a heap? then wilt thou see\n\t\t\train issue forth from their midst.  And He sends down from the\n\t\t\tsky mountain masses (of clouds) wherein is hail: He strikes\n\t\t\ttherewith whom He pleases and He turns it away fro whom He\n\t\t\tpleases.  The vivid flash of His lightning well-nigh blinds the\n\t\t\tsight. \u003cspan class=\u0027fn\u0027\u003e3019\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/024044",
        "Body":  "It is Allah Who alternates the Night and the Day: verily in these\n\t\t\tthings is an instructive example for those who have vision!\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3020\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/024045",
        "Body":  "And Allah has created every animal from water: of them there are\n\t\t\tsome that creep on their bellies; some that walk on two legs; and\n\t\t\tsome that walk on four.  Allah creates what He wills: for verily\n\t\t\tAllah has power over all things. \u003cspan class=\u0027fn\u0027\u003e3021\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3022\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3023\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/024046",
        "Body":  "We have indeed sent down Signs that make things manifest: and\n\t\t\tAllah guides whom He wills to a way that is straight."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/024047",
        "Body":  "They say \"We believe in Allah and in the Apostle and we obey\":\n\t\t\tbut even after that some of them turn away: they are not (really)\n\t\t\tBelievers. \u003cspan class=\u0027fn\u0027\u003e3024\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/024048",
        "Body":  "When they are summoned to Allah and His Apostle in order that He\n\t\t\tmay judge between them behold some of them decline (to come)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/024049",
        "Body":  "But if the right is on their side they come to him with all\n\t\t\tsubmission. \u003cspan class=\u0027fn\u0027\u003e3025\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/024005",
        "Body":  "Unless they repent thereafter and mend (their conduct): for Allah\n\t\t\tis Oft-Forgiving Most Merciful. \u003cspan class=\u0027fn\u0027\u003e2959\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/024050",
        "Body":  "Is it that there is a disease in their hearts? Or do they doubt\n\t\t\tor are they in fear that Allah and His Apostle will deal unjustly\n\t\t\twith them? Nay it is they themselves who do wrong. \u003cspan class=\u0027fn\u0027\u003e3026\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/024051",
        "Body":  "The answer of the Believers when summoned to Allah and His\n\t\t\tApostle in order that He may judge between them is no other than\n\t\t\tthis: they say \"We hear and we obey\": it is such as these that\n\t\t\twill attain felicity. \u003cspan class=\u0027fn\u0027\u003e3027\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3028\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/024052",
        "Body":  "It is such as obey Allah and His Apostle and fear Allah and do\n\t\t\tright that will win (in the end)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/024053",
        "Body":  "They swear their strongest oaths by Allah that if only thou\n\t\t\twouldst command them they would leave (their homes).  Say: \"Swear\n\t\t\tye not; obedience is (more) reasonable: verily Allah is\n\t\t\twell-acquainted with all that ye do.\" \u003cspan class=\u0027fn\u0027\u003e3029\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/024054",
        "Body":  "Say: \"Obey Allah and obey the Apostle: but if ye turn away he is\n\t\t\tonly responsible for the duty placed on him and ye for that\n\t\t\tplaced on you. If ye obey him ye shall be on right guidance.  The\n\t\t\tApostle\u0027s duty is only to preach the clear (Message).\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3030\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/024055",
        "Body":  "Allah has promised to those among you who believe and work\n\t\t\trighteous deeds that He will of a surety grant them in the land\n\t\t\tinheritance (of power) as He granted it to those before them;\n\t\t\tthat He will establish in authority their religion the one which\n\t\t\tHe has chosen for them; and that He will change (their state)\n\t\t\tafter the fear in which they (lived) to one of security and\n\t\t\tpeace: `They will worship Me (alone) and not associate aught with\n\t\t\tMe.\u0027  If any do reject faith after this they are rebellious and\n\t\t\twicked. \u003cspan class=\u0027fn\u0027\u003e3031\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3032\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/024056",
        "Body":  "So establish regular Prayer and give regular Charity: and obey\n\t\t\tthe Apostle; that ye may receive mercy."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/024057",
        "Body":  "Never think thou that the Unbelievers are going to frustrate\n\t\t\t(Allah\u0027s Plan) on earth: their abode is the Fire and it is indeed\n\t\t\tan evil refuge!"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/024058",
        "Body":  "O ye who believe! let those whom your right hands possess and the\n\t\t\t(children) among you who have not come of age ask your permission\n\t\t\t(before they come to your presence) on three occasions before\n\t\t\tmorning prayer; the while ye doff your clothes for the noonday\n\t\t\theat; and after the late-night prayer: these are your three times\n\t\t\tof undress: outside those times it is not wrong for you or for\n\t\t\tthem to move about attending to each other: thus does Allah make\n\t\t\tclear the Signs to you: for Allah is full of knowledge and\n\t\t\twisdom. \u003cspan class=\u0027fn\u0027\u003e3033\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3034\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3035\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3036\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/024059",
        "Body":  "But when the children among you come of age let them (also) ask\n\t\t\tfor permission as do those senior to them (in age): thus does\n\t\t\tAllah make clear His Signs to you: for Allah is full of knowledge\n\t\t\tand wisdom. \u003cspan class=\u0027fn\u0027\u003e3037\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3038\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3039\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/024006",
        "Body":  "And for those who launch a charge against their spouses and have\n\t\t\t(in support) no evidence but their own their solitary evidence\n\t\t\t(can be received) if they bear witness four times (with an oath)\n\t\t\tby Allah that they are solemnly telling the truth; \u003cspan class=\u0027fn\u0027\u003e2960\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/024060",
        "Body":  "Such elderly women as are past the prospect of marriage there is\n\t\t\tno blame on them if they lay aside their (outer) garments\n\t\t\tprovided they make not a wanton display of their beauty: but it\n\t\t\tis best for them to be modest: and Allah is One Who sees and\n\t\t\tknows all things. \u003cspan class=\u0027fn\u0027\u003e3040\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3041\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/024061",
        "Body":  "it is no fault in the blind nor in one born lame nor in one\n\t\t\tafflicted with illness nor in yourselves that ye should eat in\n\t\t\tyour own houses or those of your fathers or your mothers or your\n\t\t\tbrothers or your sisters or your father\u0027s brothers or your\n\t\t\tfather\u0027s sisters or your mother\u0027s brothers or your mother\u0027s\n\t\t\tsisters or in houses of which the keys are in your possession or\n\t\t\tin the house of a sincere friend of yours: there is no blame on\n\t\t\tyou whether ye eat in company or separately.  But if ye enter\n\t\t\thouses salute each other a greeting or blessing and purity as\n\t\t\tfrom Allah.  Thus does Allah make clear the Signs to you: that ye\n\t\t\tmay understand. \u003cspan class=\u0027fn\u0027\u003e3042\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3043\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3044\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/024062",
        "Body":  "Only those are Believers who believe in Allah and His Apostle:\n\t\t\twhen they are with him on a matter requiring collective action\n\t\t\tthey do not depart until they have asked for his leave: those who\n\t\t\task for thy leave are those who believe in Allah and His Apostle;\n\t\t\tso when they ask for thy leave for some business of theirs give\n\t\t\tleave to those of them whom thou wilt and ask Allah for their\n\t\t\tforgiveness: for Allah is Oft-Forgiving Most Merciful.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3045\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3046\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3047\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/024063",
        "Body":  "Deem not the summons of the Apostle among yourselves like the\n\t\t\tsummons of one of you to another: Allah doth know those of you\n\t\t\twho slip away under shelter of some excuse: then let those beware\n\t\t\twho withstand the Apostle\u0027s order lest some trial befall them or\n\t\t\ta grievous Penalty be inflicted on them. \u003cspan class=\u0027fn\u0027\u003e3048\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3049\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/024064",
        "Body":  "Be quite sure that to Allah doth belong whatever is in the\n\t\t\theavens and on earth.  Well doth He know what ye are intent upon:\n\t\t\tand one day they will be brought back to Him and He will tell\n\t\t\tthem the truth of what they did: for Allah doth know all things.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e3050\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e3051\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/024007",
        "Body":  "And the fifth (oath) (should be) that they solemnly invoke the\n\t\t\tcurse of Allah on themselves if they tell a lie."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/024008",
        "Body":  "But it would avert the punishment from the wife if she bears\n\t\t\twitness four times (with an oath) by Allah that (her husband) is\n\t\t\ttelling a lie;"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "24",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/024009",
        "Body":  "And the fifth (oath) should be that she solemnly invokes the\n\t\t\twrath of Allah on herself if (her accuser) is telling the truth."
    }
]
