[
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "1",
    "sectionHeading": "Stimulation of Desire for Sadaqa",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said from Abu'l-Hubab\\n\\t\\t\\t\\tSaid ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Whoever gives\\n\\t\\t\\t\\tsadaqa from good earning - and Allah only accepts the\\n\\t\\t\\t\\tgood - it is as if he placed it in the palm of the\\n\\t\\t\\t\\tMerciful to raise it, as one of you raises his foal or\\n\\t\\t\\t\\tyoung camel until it is like the mountain \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "2",
    "sectionHeading": "Stimulation of Desire for Sadaqa",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Ishaq ibn Abdullah ibn Abi Talha\\n\\t\\t\\t\\theard Anas ibn Malik say, \"Abu Talha had the greatest\\n\\t\\t\\t\\tamount of property in palm-trees among the Ansar in\\n\\t\\t\\t\\tMadina. The dearest of his properties to him was Bayruha\\n\\t\\t\\t\\twhich was in front of the mosque. The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, used to go into\\n\\t\\t\\t\\tit and drink from the pleasant water which was in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAnas continued, \"When this ayat was sent down 'You will\\n\\t\\t\\t\\tnot obtain rightness of action until you expend of what\\n\\t\\t\\t\\tyou love,' (Sura 2 ayat l76), Abu Talha went to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and said, 'Messenger of Allah! Allah, the Blessed,\\n\\t\\t\\t\\tthe Exalted, has said, \"You will not obtain until you\\n\\t\\t\\t\\texpend of what you love.\" The property which I love the\\n\\t\\t\\t\\tbest is Bayruha. It is sadaqa for Allah. I hope for its\\n\\t\\t\\t\\tgood and for it to be stored up with Allah. Place it\\n\\t\\t\\t\\twherever you wish, Messengerof Allah. ' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, said, 'Well done! That is property which\\n\\t\\t\\t\\tprofits! That is property which profits. I have heard\\n\\t\\t\\t\\twhat you have said about it and I think that you should\\n\\t\\t\\t\\tgive it to your relatives.' Abu Talha said, 'I will do\\n\\t\\t\\t\\tit, Messenger of Allah!' Abu Talha therefore divided it\\n\\t\\t\\t\\tamong his relatives and the children of his paternal\\n\\t\\t\\t\\tuncle.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "3",
    "sectionHeading": "Stimulation of Desire for Sadaqa",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Zayd ibn Aslam that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Give to a beggar even if he comes on a\\n\\t\\t\\t\\thorse.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "4",
    "sectionHeading": "Stimulation of Desire for Sadaqa",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Zayd ibn Aslam from Amr ibn\\n\\t\\t\\t\\tMuadh al-Ashali al-Ansari that his grandmother said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'O trusting women! Let none of you despise\\n\\t\\t\\t\\tgiving to her neighbour even if it is only a roasted\\n\\t\\t\\t\\tsheep's trotter.'\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "5",
    "sectionHeading": "Stimulation of Desire for Sadaqa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that a\\n\\t\\t\\t\\tbeggar asked A'isha, the wife of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, for something while she\\n\\t\\t\\t\\twas fasting and there was only a loaf of bread in her\\n\\t\\t\\t\\thouse. She said to her female mawla, \"Give it to him.\"\\n\\t\\t\\t\\tThe mawla protested, \"You will not have anything to break\\n\\t\\t\\t\\tyour fast with.\" A'isha repeated, \"Give it to him,\" so\\n\\t\\t\\t\\tshe did so. When evening came, the people of a house or a\\n\\t\\t\\t\\tman who did not usually give to them, gave them a sheep\\n\\t\\t\\t\\tand some food to go with it. A'isha, umm al-muminin,\\n\\t\\t\\t\\tcalled her mawla and said, \"Eat from this. This is better\\n\\t\\t\\t\\tthan your loaf of bread.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "6",
    "sectionHeading": "Stimulation of Desire for Sadaqa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"I heard that a\\n\\t\\t\\t\\tbeggar asked for food from A'isha, umm al-muminin, while\\n\\t\\t\\t\\tshe had some grapes. She told some one to take him one\\n\\t\\t\\t\\tgrape. He began to look in amazement. A'isha said, 'Are\\n\\t\\t\\t\\tyou amazed? How many atoms' weights do you see in this\\n\\t\\t\\t\\tgrape?' \" (referring to Sura 99 ayat 7).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "7",
    "sectionHeading": "Refraining from Asking",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Malik from Ibn Shihab from Ata\\n\\t\\t\\t\\tibn Yazid al-Laythi from Abu Said al-Khudri that some\\n\\t\\t\\t\\tpeople of the Ansar asked the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, and he gave to them.\\n\\t\\t\\t\\tThen they asked him again, and he gave to them until he\\n\\t\\t\\t\\tused up what he had. Then he said, \"What wealth I have, I\\n\\t\\t\\t\\twill not hoard from you. Whoever has forbearance, Allah\\n\\t\\t\\t\\twill help him. Whoever tries to be independent, Allah\\n\\t\\t\\t\\twill enrich him. Whoever tries to be patient, Allah will\\n\\t\\t\\t\\tgive him patience, and no one is given a better or vaster\\n\\t\\t\\t\\tgift than patience.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "8",
    "sectionHeading": "Refraining from Asking",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said from the mimbar when mentioning\\n\\t\\t\\t\\tsadaqa and refraining from asking, \"The upper hand is\\n\\t\\t\\t\\tbetter than the lower hand. The upper hand is the one\\n\\t\\t\\t\\twhich expends, and the lower one is the one which asks.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "9",
    "sectionHeading": "Refraining from Asking",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, sent a gift to Umar ibn\\n\\t\\t\\t\\tal-Khattab, and Umar returned it. The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"Why did\\n\\t\\t\\t\\tyou return it?\" He said, \"Messenger of Allah, didn't you\\n\\t\\t\\t\\ttell us that it is better for us not to take anything\\n\\t\\t\\t\\tfrom anyone?\" The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"That is by asking. Provision\\n\\t\\t\\t\\twhich Allah gives you is different from asking.\" Umar ibn\\n\\t\\t\\t\\tal-Khattab said, \"By the One in whose hand my self is, I\\n\\t\\t\\t\\twill not ask anything from anyone, and anything that\\n\\t\\t\\t\\tcomes to me without my asking for it, I will accept.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "10",
    "sectionHeading": "Refraining from Asking",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"By Him in\\n\\t\\t\\t\\twhose hand myself is! To take your rope and gather\\n\\t\\t\\t\\tfirewood on your back is better for you than that you\\n\\t\\t\\t\\tcome to a man to whom Allah has given some of His favour\\n\\t\\t\\t\\tand ask him, so he gives to you or refuses.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "11",
    "sectionHeading": "Refraining from Asking",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that a man of the Banu Asad said, \"My\\n\\t\\t\\t\\tfamily and I dismounted to rest at Baqi. My family said\\n\\t\\t\\t\\tto me, 'Go to the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, and ask him for something that we\\n\\t\\t\\t\\tcan eat,' and they began to mention their need. I went to\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and found that a man was asking for something, and\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, was saying, 'I do not have anything to give you.'\\n\\t\\t\\t\\tThe man turned away from him in anger, saying, 'By my\\n\\t\\t\\t\\tlife! You give to whomever you wish.' The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, 'He\\n\\t\\t\\t\\tis angry with me because I do not have anything to give\\n\\t\\t\\t\\thim. Whoever asks of you while he has an uqiya or its\\n\\t\\t\\t\\tlike, has asked with importunity.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe man continued, \"I said to myself about a camel that\\n\\t\\t\\t\\twe had, 'It is better than an uqiya.' (Malik explained\\n\\t\\t\\t\\tthat an uqiya was forty dirhams.) So I returned and did\\n\\t\\t\\t\\tnot ask him for anything, and the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, sent me barley and\\n\\t\\t\\t\\traisins after that. He gave us from his share until\\n\\t\\t\\t\\tAllah, the Mighty, the Majestic gave us relief.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "12",
    "sectionHeading": "Refraining from Asking",
    "text": "<p>\\n\\t\\t\\t\\tYahya related that Malik heard al-Ala ibn Abd ar-Rahman\\n\\t\\t\\t\\tsay, \"Sadaqa does not decrease property, and Allah only\\n\\t\\t\\t\\tincreases a slave in worth for his restraint, and no\\n\\t\\t\\t\\tslave is humble but that Allah raises him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not know whether this hadith goes back\\n\\t\\t\\t\\tto the Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tor not.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "13",
    "sectionHeading": "What Is Disliked in Sadaqa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Sadaqa to the family of Muhammad is not\\n\\t\\t\\t\\thalal. It is only people's impurities.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "14",
    "sectionHeading": "What Is Disliked in Sadaqa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tfrom his father that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, gave a man from the Banu\\n\\t\\t\\t\\tAbd al-Ashal charge over some sadaqa. When he came to ask\\n\\t\\t\\t\\thim for some camels from the sadaqa, the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was so\\n\\t\\t\\t\\tangry that the anger showed in his face. One way in which\\n\\t\\t\\t\\tanger could be recognised in his face was that his eyes\\n\\t\\t\\t\\tbecame red. Then he said, \"This man has asked me for what\\n\\t\\t\\t\\tis not good for me or him. If I refuse it, I hate to\\n\\t\\t\\t\\trefuse. If I give it to him, I will give him what is not\\n\\t\\t\\t\\tgood for me or him.\" The man said, \"Messenger of Allah! I\\n\\t\\t\\t\\twill never ask you for any of it!\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "58",
    "hadithNumber": "15",
    "sectionHeading": "What Is Disliked in Sadaqa",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\this father said, \"Abdullah ibn al-Arqam said, 'Show me a\\n\\t\\t\\t\\triding-camel which the amir al-muminim can give me to\\n\\t\\t\\t\\tuse.' I said, 'Yes. One of the sadaqa camels.' Abdullah\\n\\t\\t\\t\\tibn al-Arqam said, 'Would you want a stout man on a hot\\n\\t\\t\\t\\tday to wash for you what is under his lower garment and\\n\\t\\t\\t\\tits folds, and then give it to you to drink?' I was angry\\n\\t\\t\\t\\tand said, 'May Allah forgive you! Why do you say such\\n\\t\\t\\t\\tthings to me?' Abdullah ibn al-Arqam said, 'Sadaqa is the\\n\\t\\t\\t\\timpurities of people which they wash off themselves.' \"\\n\\t\\t\\t</p>"
  }
]
