[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "20",
        "bookName": "Book of Manumission",
        "bookNameArabic": "كتاب العتق",
        "hadiths": [
            {
                "hadithNo": "3770",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah (s.a.w) said: 'If a person frees his share of a slave, and has enough money to pay the full price of the slave, a fair price should be worked out for the slave, and his partners should be given their shares. Then he should free the slave, otherwise he has freed only what he has freed.\"'",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ نَافِعٌ عَنِ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ أَعْتَقَ شِرْكًا لَهُ فِى عَبْدٍ فَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ قُوِّمَ عَلَيْهِ قِيمَةَ الْعَدْلِ فَأُعْطِىَ شُرَكَاؤُهُ حِصَصَهُمْ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ »."
            },
            {
                "hadithNo": "3771",
                "chapterNo": "0",
                "hadithEnglish": "A Hadith similar to that of Malik from Nafi' (no. 3770) was narrated from Nafi' from Ibn 'Umar.",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ رُمْحٍ جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ ح وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ ح وَحَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى حَدَّثَنَا عُبَيْدُ اللَّهِ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ ح وَحَدَّثَنِى إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنِ ابْنِ جُرَيْجٍ أَخْبَرَنِى إِسْمَاعِيلُ بْنُ أُمَيَّةَ ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى أُسَامَةُ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِى فُدَيْكٍ عَنِ ابْنِ أَبِى ذِئْبٍ كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ بِمَعْنَى حَدِيثِ مَالِكٍ عَنْ نَافِعٍ."
            },
            {
                "hadithNo": "3772",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Abu Hurairah, that the Prophet (s.a.w) said concerning a slave who is owned by two men, one of whom manumits (his share): \"He is responsible (for manumitting the other share).\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنِ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ فِى الْمَمْلُوكِ بَيْنَ الرَّجُلَيْنِ فَيُعْتِقُ أَحَدُهُمَا قَالَ « يَضْمَنُ »."
            },
            {
                "hadithNo": "3773",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Whoever manumits his share of a slave, let him manumit him completely with his own wealth if he has wealth, and if he does not have wealth, let the slave work for his manumission, without being overburdened.\"",
                "hadithArabic": "وَحَدَّثَنِى عَمْرٌو النَّاقِدُ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنِ ابْنِ أَبِى عَرُوبَةَ عَنْ قَتَادَةَ عَنِ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « مَنْ أَعْتَقَ شِقْصًا لَهُ فِى عَبْدٍ فَخَلاَصُهُ فِى مَالِهِ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتُسْعِىَ الْعَبْدُ غَيْرَ مَشْقُوقٍ عَلَيْهِ »."
            },
            {
                "hadithNo": "3774",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Sa'eed bin Abi 'Arubah with this chain (a Hadith similar to no. 3773), and he added: \"If he does not have any money, a fair price should be worked out for the slave, then let him work for the share that was not manumitted, without him being\r\noverburdened.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ عَلِىُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى - يَعْنِى ابْنَ يُونُسَ - عَنْ سَعِيدِ بْنِ أَبِى عَرُوبَةَ بِهَذَا الإِسْنَادِ وَزَادَ « إِنْ لَمْ يَكُنْ لَهُ مَالٌ قُوِّمَ عَلَيْهِ الْعَبْدُ قِيمَةَ عَدْلٍ ثُمَّ يُسْتَسْعَى فِى نَصِيبِ الَّذِى لَمْ يُعْتِقْ غَيْرَ مَشْقُوقٍ عَلَيْهِ »."
            },
            {
                "hadithNo": "3775",
                "chapterNo": "1",
                "hadithEnglish": "Wahb bin Jarir narrated: \"My father said: 'I heard Qatadah narrate...\"' a Hadith similar to that of Ibn Abi 'Arubah (no. 3774) with this chain, and he mentioned in the Hadith: \"... A fair price should be worked out for him.\"",
                "hadithArabic": "حَدَّثَنِى هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِى قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ بِهَذَا الإِسْنَادِ بِمَعْنَى حَدِيثِ ابْنِ أَبِى عَرُوبَةَ وَذَكَرَ فِى الْحَدِيثِ قُوِّمَ عَلَيْهِ قِيمَةَ عَدْلٍ."
            },
            {
                "hadithNo": "3776",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah that she wanted to buy a slave woman and manumit her, and her masters said: \"We will sell her on condition that the right of inheritance (Al-Wala') remains ours.\" She mentioned that to the Messenger of Allah (s.a.w) and he said: \"Do not let that stop you, for the right of inheritance belongs to the one who manumits (the slave).\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنْ عَائِشَةَ أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِىَ جَارِيَةً تُعْتِقُهَا فَقَالَ أَهْلُهَا نَبِيعُكِهَا عَلَى أَنَّ وَلاَءَهَا لَنَا. فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « لاَ يَمْنَعُكِ ذَلِكَ فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ »."
            },
            {
                "hadithNo": "3777",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Urwah that 'Aishah told him that Barirah came to her seeking her help with her contract of manumission, as she had not paid off anything stipulated in her contract of manumission. 'Aishah said to her: \"Go back to your masters, and if they like, I will pay off your contract of manumission on your behalf, and the right of inheritance (Al-Wala') will be mine, then I will do it.\" Barirah mentioned that to her masters, but they refused and said: \"If she wishes to do that for you, seeking reward with Allah, then let her do it, but the right of inheritance will be ours.\" She ('Aishah) mentioned that to the Messenger of Allah (s.a.w) and the Messenger of Allah (s.a.w) said to her: \"Buy her and manumit her, for the right of inheritance belongs to the one who manumits (the slave).\" Then the Messenger of Allah (s.a.w) stood up and said: \"What is the matter with people who stipulate conditions that are not in the Book of Allah? Whoever stipulates a condition that is not in the Book of Allah has no right, even if he stipulates a hundred times. The conditions stipulated by Allah are more valid and carry more weight.\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ بَرِيرَةَ جَاءَتْ عَائِشَةَ تَسْتَعِينُهَا فِى كِتَابَتِهَا وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا فَقَالَتْ لَهَا عَائِشَةُ ارْجِعِى إِلَى أَهْلِكِ فَإِنْ أَحَبُّوا أَنْ أَقْضِىَ عَنْكِ كِتَابَتَكِ وَيَكُونَ وَلاَؤُكِ لِى. فَعَلْتُ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لأَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ وَيَكُونَ لَنَا وَلاَؤُكِ. فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ لَهَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- « ابْتَاعِى فَأَعْتِقِى. فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ ». ثُمَّ قَامَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « مَا بَالُ أُنَاسٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِى كِتَابِ اللَّهِ مَنِ اشْتَرَطَ شَرْطًا لَيْسَ فِى كِتَابِ اللَّهِ فَلَيْسَ لَهُ وَإِنْ شَرَطَ مِائَةَ مَرَّةٍ شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُ »."
            },
            {
                "hadithNo": "3778",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah, the wife of the Prophet (s.a.w), that she said: \"Barirah came to me and said: 'O 'Aishah, I have made a contract of manumission with my masters, for nine Uqiyahs, one Uqiyah each year...\"' a Hadith like that of Al-Laith (no. 3777). And he added: \"He(s.a.w) said: 'Do not let that stop you; buy her and manumit her.\"' And he (a narrator) said in the Hadith: \"Then the Messenger of Allah (s.a.w) stood up before the people and praised and glorified Allah, then he said: \"To proceed.\"",
                "hadithArabic": "حَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهَا قَالَتْ جَاءَتْ بَرِيرَةُ إِلَىَّ فَقَالَتْ يَا عَائِشَةُ إِنِّى كَاتَبْتُ أَهْلِى عَلَى تِسْعِ أَوَاقٍ فِى كُلِّ عَامٍ أُوقِيَّةٌ. بِمَعْنَى حَدِيثِ اللَّيْثِ وَزَادَ فَقَالَ « لاَ يَمْنَعُكِ ذَلِكِ مِنْهَا ابْتَاعِى وَأَعْتِقِى ». وَقَالَ فِى الْحَدِيثِ ثُمَّ قَامَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فِى النَّاسِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ « أَمَّا بَعْدُ »."
            },
            {
                "hadithNo": "3779",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Aishah said: \"Barirah entered upon me and said: 'My masters have made a contract of manumission for me, in return for nine Uqiyah over (a period of) nine years, one Uqiyah each year; help me.' I said to her: 'If your masters wish, I will prepare it for them in one payment, and I will manumit you, and the right of inheritance will be mine, (only) then I will do it.' She mentioned that to her masters, but they insisted that the right of inheritance would be theirs. She came to me and told me that, and I scolded her. She said: 'Then it is not possible.' The Messenger of Allah  (s.a.w) heard and he asked me, and I told him about that. He said: 'Buy her and manumit her, even if they stipulated that the right of inheritance would be theirs, for the right of inheritance belongs to the one who manumits (the slave).' So I did that. Then the Messenger of Allah (s.a.w) adressed the people in the evening. He praised and glorified Allah as He deserves, then he said: 'What is the matter with people who stipulate conditions that are not in the Book of Allah? There is no condition that is not in the Book of Allah but it is invalid, even if there are one hundred conditions. The Book of Allah is more deserving of being followed and the conditions of Allah are more binding. What is the matter with some men among you who say: \"Manumit so-and-so and the right of inheritance will be mine;\" rather the right of inheritance belongs to the one who manumits (the slave).'\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِىُّ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ أَخْبَرَنِى أَبِى عَنْ عَائِشَةَ قَالَتْ دَخَلَتْ عَلَىَّ بَرِيرَةُ فَقَالَتْ إِنَّ أَهْلِى كَاتَبُونِى عَلَى تِسْعِ أَوَاقٍ فِى تِسْعِ سِنِينَ فِى كُلِّ سَنَةٍ أُوقِيَّةٌ. فَأَعِينِينِى. فَقُلْتُ لَهَا إِنْ شَاءَ أَهْلُكِ أَنْ أَعُدَّهَا لَهُمْ عَدَّةً وَاحِدَةً وَأُعْتِقَكِ وَيَكُونَ الْوَلاَءُ لِى فَعَلْتُ. فَذَكَرَتْ ذَلِكَ لأَهْلِهَا فَأَبَوْا إِلاَّ أَنْ يَكُونَ الْوَلاَءُ لَهُمْ فَأَتَتْنِى فَذَكَرَتْ ذَلِكَ قَالَتْ فَانْتَهَرْتُهَا فَقَالَتْ لاَهَا اللَّهِ إِذَا قَالَتْ. فَسَمِعَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَسَأَلَنِى فَأَخْبَرْتُهُ فَقَالَ « اشْتَرِيهَا وَأَعْتِقِيهَا وَاشْتَرِطِى لَهُمُ الْوَلاَءَ فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ». فَفَعَلْتُ - قَالَتْ - ثُمَّ خَطَبَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- عَشِيَّةً فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ « أَمَّا بَعْدُ فَمَا بَالُ أَقْوَامٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِى كِتَابِ اللَّهِ مَا كَانَ مِنْ شَرْطٍ لَيْسَ فِى كِتَابِ اللَّهِ عَزَّ وَجَلَّ فَهُوَ بَاطِلٌ وَإِنْ كَانَ مِائَةَ شَرْطٍ كِتَابُ اللَّهِ أَحَقُّ وَشَرْطُ اللَّهِ أَوْثَقُ مَا بَالُ رِجَالٍ مِنْكُمْ يَقُولُ أَحَدُهُمْ أَعْتِقْ فُلاَنًا وَالْوَلاَءُ لِى إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ »."
            },
            {
                "hadithNo": "3780",
                "chapterNo": "2",
                "hadithEnglish": "A Hadith similar to that of Abu Usamah (no. 3779) was narrated from Hisham bin 'Urwah with this chain, except that in the Hadith of Jarir it says: \"...Her husband was a slave, and the Messenger of Allah (s.a.w) gave her the choice, and she chose herself. If he had been a free man, he would not have given her the choice.''",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ نُمَيْرٍ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ جَرِيرٍ كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الإِسْنَادِ.\r\nنَحْوَ حَدِيثِ أَبِى أُسَامَةَ غَيْرَ أَنَّ فِى حَدِيثِ جَرِيرٍ قَالَ وَكَانَ زَوْجُهَا عَبْدًا فَخَيَّرَهَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَاخْتَارَتْ نَفْسَهَا وَلَوْ كَانَ حُرًّا لَمْ يُخَيِّرْهَا. وَلَيْسَ فِى حَدِيثِهِمْ « أَمَّا بَعْدُ »."
            },
            {
                "hadithNo": "3781",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Aishah said: \"Three rulings were given concerning Barirah. Her masters wanted to sell her but they stipulated that the right of inheritance would be theirs. I mentioned that to the Prophet (s.a.w) and he said: 'Buy her and manumit her, for the right of inheritance belongs to the one who manumits (the slave).\"' She said: \"Then she was manumitted, and the Messenger of Allah (s.a.w) gave her the choice, and she chose herself. And the people used to give her charity and she would give us gifts. I mentioned that to the Prophet (s.a.w) and he said: 'It is charity for her, but it is a gift for you, so eat it.\"'",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ فِى بَرِيرَةَ ثَلاَثُ قَضِيَّاتٍ أَرَادَ أَهْلُهَا أَنْ يَبِيعُوهَا وَيَشْتَرِطُوا وَلاَءَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِىِّ -صلى الله عليه وسلم- فَقَالَ « اشْتَرِيهَا وَأَعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ». قَالَتْ وَعَتَقَتْ فَخَيَّرَهَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَاخْتَارَتْ نَفْسَهَا.\r\nقَالَتْ وَكَانَ النَّاسُ يَتَصَدَّقُونَ عَلَيْهَا وَتُهْدِى لَنَا. فَذَكَرْتُ ذَلِكَ لِلنَّبِىِّ -صلى الله عليه وسلم- فَقَالَ « هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ لَكُمْ هَدِيَّةٌ فَكُلُوهُ »."
            },
            {
                "hadithNo": "3782",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah that she bought Barirah from some people among the Ansar, and they stipulated that the right of inheritance would be theirs. The Messenger of Allah (s.a.w) said: \"The right of inheritance belongs to the one who bestows the favor (manumits the slave).\" And the Messenger of Allah (s.a.w) gave her the choice, as her husband was a slave. And she gave some meat to 'Aishah as a gift, and the Messenger of Allah (s.a.w) said: \"Why don't you cook some of this meat for us?\" 'Aishah said: \"It was given in charity to Barirah.\" He said: \"It is charity for her and a gift for us.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِىٍّ عَنْ زَائِدَةَ عَنْ سِمَاكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ. أَنَّهَا اشْتَرَتْ بَرِيرَةَ مِنْ أُنَاسٍ مِنَ الأَنْصَارِ. وَاشْتَرَطُوا الْوَلاَءَ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « الْوَلاَءُ لِمَنْ وَلِىَ النِّعْمَةَ ». وَخَيَّرَهَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَكَانَ زَوْجُهَا عَبْدًا وَأَهْدَتْ لِعَائِشَةَ لَحْمًا فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَوْ صَنَعْتُمْ لَنَا مِنْ هَذَا اللَّحْمِ ». قَالَتْ عَائِشَةُ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ. فَقَالَ « هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ »."
            },
            {
                "hadithNo": "3783",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah that she wanted to buy Barirah in order to manumit her, but they (her owners) stipulated conditions about the right of inheritance. She mentioned that to the Messenger of Allah (s.a.w) and he said: \"Buy her and manumit her, for the right of inheritance belongs to the one who manumits (the slave).\" Some meat was given to the Messenger of Allah (s.a.w) as a gift, and they said to the Prophet (s.a.w): \"This was given in charity to Barirah.\" He said: \"It is charity for her but it is a gift for us.\" And she was given the choice. 'Abdur-Rahman (a narrator) said: \"Her husband was a free man.\" Shu'bah said: \"Then I asked him about her husband, and he said: 'I do not know.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ قَالَ سَمِعْتُ الْقَاسِمَ يُحَدِّثُ عَنْ عَائِشَةَ أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِىَ بَرِيرَةَ لِلْعِتْقِ فَاشْتَرَطُوا وَلاَءَهَا فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « اشْتَرِيهَا وَأَعْتِقِيهَا فَإِنَّ الْوَلاَءَ لِمَنْ أَعْتَقَ ». وَأُهْدِىَ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- لَحْمٌ فَقَالُوا لِلنَّبِىِّ -صلى الله عليه وسلم- هَذَا تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ.\r\nفَقَالَ « هُوَ لَهَا صَدَقَةٌ وَهُوَ لَنَا هَدِيَّةٌ ». وَخُيِّرَتْ. فَقَالَ عَبْدُ الرَّحْمَنِ وَكَانَ زَوْجُهَا حُرًّا. قَالَ شُعْبَةُ ثُمَّ سَأَلْتُهُ عَنْ زَوْجِهَا فَقَالَ لاَ أَدْرِى."
            },
            {
                "hadithNo": "3784",
                "chapterNo": "2",
                "hadithEnglish": "Shu'bah narrated a similar report (as no. 3783) with this chain.",
                "hadithArabic": "وَحَدَّثَنَاهُ أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِىُّ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "3785",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Urwah that 'Aishah said: \"The husband of Barirah was a slave.\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ جَمِيعًا عَنْ أَبِى هِشَامٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُغِيرَةُ بْنُ سَلَمَةَ الْمَخْزُومِىُّ وَأَبُو هِشَامٍ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ زَوْجُ بَرِيرَةَ عَبْدًا."
            },
            {
                "hadithNo": "3786",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah, the wife of the Prophet (s.a.w), that she said: \"Three rulings were established concerning Barirah: She was given the choice about her husband when she was manumitted; some meat was given to her and the Messenger of Allah (s.a.w) entered upon me when the earthen pot was on the fire. He called for some food, and some bread, and ordinary condiments were brought to him. He said: 'Do I not see an earthen pot on the fire with meat in it?' They said: 'Yes, O Messenger of Allah; that is meat that was given in charity to Barirah and we did not want to give some to you.' He said: 'It is charity for her but it is a gift from her to us.'\" And the Prophet (s.a.w) said concerning her: 'The right of inheritance belongs to the one who manumits (the slave).'\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى مَالِكُ بْنُ أَنَسٍ عَنْ رَبِيعَةَ بْنِ أَبِى عَبْدِ الرَّحْمَنِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهَا قَالَتْ كَانَ فِى بَرِيرَةَ ثَلاَثُ سُنَنٍ خُيِّرَتْ عَلَى زَوْجِهَا حِينَ عَتَقَتْ وَأُهْدِىَ لَهَا لَحْمٌ فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَالْبُرْمَةُ عَلَى النَّارِ فَدَعَا بِطَعَامٍ فَأُتِىَ بِخُبْزٍ وَأُدُمٍ مِنْ أُدُمِ الْبَيْتِ فَقَالَ « أَلَمْ أَرَ بُرْمَةً عَلَى النَّارِ فِيهَا لَحْمٌ ». فَقَالُوا بَلَى يَا رَسُولَ اللَّهِ ذَلِكَ لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَكَرِهْنَا أَنْ نُطْعِمَكَ مِنْهُ. فَقَالَ « هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ مِنْهَا لَنَا هَدِيَّةٌ ». وَقَالَ النَّبِىُّ -صلى الله عليه وسلم- فِيهَا « إِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ »."
            },
            {
                "hadithNo": "3787",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"'Aishah wanted to buy Barirah and manumit her, but her masters insisted that the right of inheritance should be theirs. She mentioned that to the Messenger of Allah (s.a.w) and he said: 'Do not let that stop you, for the right of inheritance belongs to the one who manumits (the slave).'\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ عَنْ سُلَيْمَانَ بْنِ بِلاَلٍ حَدَّثَنِى سُهَيْلُ بْنُ أَبِى صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ أَرَادَتْ عَائِشَةُ أَنْ تَشْتَرِىَ جَارِيَةً تُعْتِقُهَا فَأَبَى أَهْلُهَا إِلاَّ أَنْ يَكُونَ لَهُمُ الْوَلاَءُ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « لاَ يَمْنَعُكِ ذَلِكِ فَإِنَّمَا الْوَلاَءُ لِمَنْ أَعْتَقَ »."
            },
            {
                "hadithNo": "3788",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Messenger of Allah (s.a.w) forbade selling or giving away the Wala'. Ibrahim said: \"I heard Muslim bin Al-Hajjaj say: 'All people depend on 'Abdullah bin Dinar in this Hadith.'\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- نَهَى عَنْ بَيْعِ الْوَلاَءِ وَعَنْ هِبَتِهِ. قَالَ مُسْلِمٌ النَّاسُ كُلُّهُمْ عِيَالٌ عَلَى عَبْدِ اللَّهِ بْنِ دِينَارٍ فِى هَذَا الْحَدِيثِ."
            },
            {
                "hadithNo": "3789",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as no. 3788) was narrated from 'Abdullah bin Dinar, from Ibn 'Umar, from the Prophet (s.a.w), except that in the Hadith of Ath-Thaqafi from 'Ubaidullah, it mentions selling only and does not mention giving away.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالاَ حَدَّثَنَا ابْنُ عُيَيْنَةَ ح وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا عُبَيْدُ اللَّهِ ح وَحَدَّثَنَا ابْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِى فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ - يَعْنِى ابْنَ عُثْمَانَ - كُلُّ هَؤُلاَءِ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمِثْلِهِ غَيْرَ أَنَّ الثَّقَفِىَّ لَيْسَ فِى حَدِيثِهِ عَنْ عُبَيْدِ اللَّهِ إِلاَّ الْبَيْعُ وَلَمْ يَذْكُرِ الْهِبَةَ."
            },
            {
                "hadithNo": "3790",
                "chapterNo": "4",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"The Prophet (s.a.w) dictated the blood money to be paid by each tribe, then he dictated: 'It is not permissible for a Muslim to become the Mawla of a slave who has been manumitted by a Muslim man, without his permission.' Then I was told that in his Sahifah (a letter), he cursed the on.e who did that.''",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ كَتَبَ النَّبِىُّ -صلى الله عليه وسلم- عَلَى كُلِّ بَطْنٍ عُقُولَهُ ثُمَّ كَتَبَ « أَنَّهُ لاَ يَحِلُّ لِمُسْلِمٍ أَنْ يَتَوَالَى مَوْلَى رَجُلٍ مُسْلِمٍ بِغَيْرِ إِذْنِهِ ». ثُمَّ أُخْبِرْتُ أَنَّهُ لَعَنَ فِى صَحِيفَتِهِ مَنْ فَعَلَ ذَلِكَ."
            },
            {
                "hadithNo": "3791",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"Whoever takes people as Mawla without the permission of the those who set him free, upon him will be the curse of Allah and the Angels, and no Sarf nor 'Adl will be accepted from him.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ - يَعْنِى ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِىَّ - عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « مَنْ تَوَلَّى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ لاَ يُقْبَلُ مِنْهُ عَدْلٌ وَلاَ صَرْفٌ »."
            },
            {
                "hadithNo": "3792",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Whoever takes people as his Mawla without the permission of those who set him free, upon him will be the curse of Allah, the Angels and all the people, and on the Day of Resurrection, no 'Adl nor Sarf will accepted from him.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِىٍّ الْجُعْفِىُّ عَنْ زَائِدَةَ عَنْ سُلَيْمَانَ عَنْ أَبِى صَالِحٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « مَنْ تَوَلَّى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يُقْبَلُ مِنْهُ يَوْمَ الْقِيَامَةِ عَدْلٌ وَلاَ صَرْفٌ »."
            },
            {
                "hadithNo": "3793",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Al-A'mash with this chain (a Hadith similar to no. 3792), except that he said: \"Whoever takes people other than those who set him free as Maw\/a without their permission...\"",
                "hadithArabic": "وَحَدَّثَنِيهِ إِبْرَاهِيمُ بْنُ دِينَارٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا شَيْبَانُ عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ « وَمَنْ وَالَى غَيْرَ مَوَالِيهِ بِغَيْرِ إِذْنِهِمْ »."
            },
            {
                "hadithNo": "3794",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Ibrahim At-Taimi that his father said: '\"Ali bin Abi Talib addressed us and said: 'Whoever claims that we have something that we recite apart from the Book of Allah and this Sahifah' - a document that was hanging from the sheath of his sword - 'is lying. In it are the ages of camels and rulings concerning injuries, and in it the Prophet (s.a.w) said: \"Al-Madinah is sacred, the area between 'Ayr and Thawr. Whoever introduces any Hadith or gives refuge to a Muhdith, upon him will be the curse of Allah, the Angels and all the people, and on the Day of Resurrection Allah will not accept any Sarf nor 'Adl from him. Protection granted by one Muslim is binding upon all of them, and may be given by the humblest of them. Whoever claims to belong to someone other than his father or to belong to someone other than his Mawla, upon him be the curse of Allah, the Angels and all the people, and on the Day of Resurrection Allah will not accept any Sarf nor 'Adl from him.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الأَعْمَشُ عَنْ إِبْرَاهِيمَ التَّيْمِىِّ عَنْ أَبِيهِ قَالَ خَطَبَنَا عَلِىُّ بْنُ أَبِى طَالِبٍ فَقَالَ مَنْ زَعَمَ أَنَّ عِنْدَنَا شَيْئًا نَقْرَأُهُ إِلاَّ كِتَابَ اللَّهِ وَهَذِهِ الصَّحِيفَةَ - قَالَ وَصَحِيفَةٌ مُعَلَّقَةٌ فِى قِرَابِ سَيْفِهِ - فَقَدْ كَذَبَ. فِيهَا أَسْنَانُ الإِبِلِ وَأَشْيَاءُ مِنَ الْجِرَاحَاتِ وَفِيهَا قَالَ النَّبِىُّ -صلى الله عليه وسلم- « الْمَدِينَةُ حَرَمٌ مَا بَيْنَ عَيْرٍ إِلَى ثَوْرٍ فَمَنْ أَحْدَثَ فِيهَا حَدَثًا أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يَقْبَلُ اللَّهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا وَلاَ عَدْلاً وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى بِهَا أَدْنَاهُمْ وَمَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوِ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلاَئِكَةِ وَالنَّاسِ أَجْمَعِينَ لاَ يَقْبَلُ اللَّهُ مِنْهُ يَوْمَ الْقِيَامَةِ صَرْفًا وَلاَ عَدْلاً »."
            },
            {
                "hadithNo": "3795",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Whoever frees a believing slave, Allah will ransom each of his limbs from the Fire for each of his (the slave's) limbs.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِىُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ - وَهُوَ ابْنُ أَبِى هِنْدٍ - حَدَّثَنِى إِسْمَاعِيلُ بْنُ أَبِى حَكِيمٍ عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً أَعْتَقَ اللَّهُ بِكُلِّ إِرْبٍ مِنْهَا إِرْبًا مِنْهُ مِنَ النَّارِ »."
            },
            {
                "hadithNo": "3796",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"Whoever frees a believing slave, Allah will ransom each of his limbs from the Fire for each of his (the slave's) limbs, even his private part for his private part.\"",
                "hadithArabic": "وَحَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ مُطَرِّفٍ أَبِى غَسَّانَ الْمَدَنِىِّ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَلِىِّ بْنِ حُسَيْنٍ عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ عَنْ أَبِى هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ « مَنْ أَعْتَقَ رَقَبَةً أَعْتَقَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهَا عُضْوًا مِنْ أَعْضَائِهِ مِنَ النَّارِ حَتَّى فَرْجَهُ بِفَرْجِهِ »."
            },
            {
                "hadithNo": "3797",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"I heard the Messenger of Allah (s.a.w) say: 'Whoever frees a believing slave, Allah will ransom each of his limbs from the Fire for each of his (the slave's) limbs, until He ransoms his private part for his private part.\"'",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنِ ابْنِ الْهَادِ عَنْ عُمَرَ بْنِ عَلِىِّ بْنِ حُسَيْنٍ عَنْ سَعِيدِ ابْنِ مَرْجَانَةَ عَنْ أَبِى هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً أَعْتَقَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنَ النَّارِ حَتَّى يُعْتِقَ فَرْجَهُ بِفَرْجِهِ »."
            },
            {
                "hadithNo": "3798",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Sa'eed bin Marjanah - the companion of 'Ali bin Husain - who said: \"I heard Abu Hurairah say: 'The Messenger of Allah (s.a.w) said: \"Any Muslim who frees another Muslim, Allah will save each of his limbs from the Fire for each of his (the slave's) limbs.\" He said: \"When I heard this Hadith from Abu Hurairah, I went and mentioned it to 'Ali bin Al-Husain and he manumitted a slave of his for whom Ibn Ja'far was prepared to pay ten thousand Dirham - or one thousand Dinars.\"",
                "hadithArabic": "وَحَدَّثَنِى حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا عَاصِمٌ - وَهُوَ ابْنُ مُحَمَّدٍ الْعُمَرِىُّ - حَدَّثَنَا وَاقِدٌ - يَعْنِى أَخَاهُ - حَدَّثَنِى سَعِيدُ ابْنُ مَرْجَانَةَ - صَاحِبُ عَلِىِّ بْنِ حُسَيْنٍ - قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَيُّمَا امْرِئٍ مُسْلِمٍ أَعْتَقَ امْرَأً مُسْلِمًا اسْتَنْقَذَ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ مِنَ النَّارِ ». قَالَ فَانْطَلَقْتُ حِينَ سَمِعْتُ الْحَدِيثَ مِنْ أَبِى هُرَيْرَةَ فَذَكَرْتُهُ لِعَلِىِّ بْنِ الْحُسَيْنِ فَأَعْتَقَ عَبْدًا لَهُ قَدْ أَعْطَاهُ بِهِ ابْنُ جَعْفَرٍ عَشْرَةَ آلاَفِ دِرْهَمٍ أَوْ أَلْفَ دِينَارٍ."
            },
            {
                "hadithNo": "3799",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'No son can repay his father unless he finds him enslaved and buys him and manumits him.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالاَ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لاَ يَجْزِى وَلَدٌ وَالِدًا إِلاَّ أَنْ يَجِدَهُ مَمْلُوكًا فَيَشْتَرِيَهُ فَيُعْتِقَهُ ». وَفِى رِوَايَةِ ابْنِ أَبِى شَيْبَةَ « وَلَدٌ وَالِدَهُ »."
            },
            {
                "hadithNo": "3800",
                "chapterNo": "6",
                "hadithEnglish": "A similar report (as no. 3799) was narrated from Suhail with this chain.",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنِى عَمْرٌو النَّاقِدُ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِىُّ كُلُّهُمْ عَنْ سُفْيَانَ عَنْ سُهَيْلٍ بِهَذَا الإِسْنَادِ مِثْلَهُ وَقَالُوا « وَلَدٌ وَالِدَهُ »."
            }
        ]
    }
]