[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/013001",
        "Body":  "Alif. Lam. Mim. Ra. These are verses of the Scripture. That which\n\t\t\tis revealed unto thee from thy Lord is the Truth, but most of\n\t\t\tmankind believe not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/013010",
        "Body":  "Alike of you is he who hideth the saying and he who noiseth it\n\t\t\tabroad, he who lurketh in the night and he who goeth freely in\n\t\t\tthe daytime."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/013011",
        "Body":  "For him are angels ranged before him and behind him who guard him\n\t\t\tby Allah\u0027s command. Lo! Allah changeth not the condition of a\n\t\t\tfolk until they (first) change that which is in their hearts; and\n\t\t\tif Allah willeth misfortune for a folk there is none that can\n\t\t\trepel it, nor have they a defender beside Him."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/013012",
        "Body":  "He it is Who showeth you the lightning, a fear and a hope, and\n\t\t\traiseth the heavy clouds."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/013013",
        "Body":  "The thunder hymneth His praise and (so do) the angels for awe of\n\t\t\tHim. He launcheth the thunder bolts and smiteth with them whom He\n\t\t\twill while they dispute (in doubt) concerning Allah, and He is\n\t\t\tmighty in wrath."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/013014",
        "Body":  "Unto Him is the real prayer. Those unto whom they pray beside\n\t\t\tAllah respond to them not at all, save as (if the response to)\n\t\t\tone who stretcheth forth his hands toward water (asking) that it\n\t\t\tmay come unto his mouth, and it will never reach it. The prayer\n\t\t\tof disbelievers goeth (far) astray."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/013015",
        "Body":  "And unto Allah falleth prostrate whosoever is in the heavens and\n\t\t\tthe earth, willingly or unwillingly, as do their shadows in the\n\t\t\tmorning and the evening hours."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/013016",
        "Body":  "Say (O Muhammad): Who is Lord of the heaven and the earth? Say:\n\t\t\tAllah! Say: Take ye then (others) beside Him for protectors,\n\t\t\twhich, even for themselves, have neither benefit nor hurt? Say:\n\t\t\tIs the blind man equal to the seer, or is darkness equal to\n\t\t\tlight? Or assign they unto Allah partners Who created the like of\n\t\t\tHis creation so that the creation (which they made and His\n\t\t\tcreation) seemed alike to them? Say: Allah is the Creator of all\n\t\t\tthings, and He is the One, the Almighty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/013017",
        "Body":  "He sendeth down water from the sky, so that valleys flow\n\t\t\taccording to their measure, and the flood beareth (on its\n\t\t\tsurface) swelling foam from that which they felt in the fire in\n\t\t\torder to make ornaments and tools riseth a foam like unto it thus\n\t\t\tAllah coineth (the similitude of) the true and the false. Then,\n\t\t\tas for the foam, it passeth away as scum upon the banks, while,\n\t\t\tas for that which is of use to mankind, it remaineth in the\n\t\t\tearth. Thus Allah coineth the similitudes."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/013018",
        "Body":  "For those who answered Allah\u0027s call is bliss; and for those who\n\t\t\tanswered not His call, if they had all that is in the earth, and\n\t\t\ttherewith the like thereof, they would proffer it as ransom. Such\n\t\t\twill have a woeful reckoning, and their habitation will be hell,\n\t\t\ta dire abode."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/013019",
        "Body":  "Is he who knoweth that what is revealed unto thee from thy Lord\n\t\t\tis the truth like him who is blind? But only men of understanding\n\t\t\theed;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/013002",
        "Body":  "Allah it is who raised up the heavens without visible supports,\n\t\t\tthen mounted the Throne, and compelled the sun and the moon to be\n\t\t\tof service, each runneth unto an appointed term; He ordereth the\n\t\t\tcourse; He detaileth the revelations, that haply ye may be\n\t\t\tcertain of the meeting with your Lord."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/013020",
        "Body":  "Such as keep the pact of Allah, and break not the covenant;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/013021",
        "Body":  "Such as unite that which Allah hath commanded should be joined,\n\t\t\tand fear their Lord, and dread a woeful reckoning."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/013022",
        "Body":  "Such as persevere in seeking their Lord\u0027s countenance and are\n\t\t\tregular in prayer and spend of that which We bestow upon them\n\t\t\tsecretly and openly, and overcome evil with good. Theirs will be\n\t\t\tthe sequel of the (heavenly) Home."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/013023",
        "Body":  "Gardens of Eden which they enter, along with all who do right of\n\t\t\ttheir fathers and their helpmeets and their seed. The angels\n\t\t\tenter unto them from every gate."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/013024",
        "Body":  "(Saying): Peace be unto you because ye persevered. Ah, passing\n\t\t\tsweet will be the sequel of the (heavenly) Home."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/013025",
        "Body":  "And those who break the covenant of Allah after ratifying it, and\n\t\t\tsever that which Allah hath commanded should be joined, and make\n\t\t\tmischief in the earth: theirs is the curse and theirs the ill\n\t\t\tabode."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/013026",
        "Body":  "Allah enlargeth livelihood for whom He will, and straiteneth (it\n\t\t\tfor whom He will); and they rejoice in the life of the world,\n\t\t\twhereas the life of the world is but brief comfort as compared\n\t\t\twith the Hereafter."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/013027",
        "Body":  "Those who disbelieve say: If only a portent were sent down upon\n\t\t\thim from his Lord! Say: Lo! Allah sendeth whom He will astray,\n\t\t\tand guideth unto Himself all who turn (unto Him),"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/013028",
        "Body":  "Who have believed and whose hearts have rest in the remembrance\n\t\t\tof Allah. Verily in the remembrance of Allah do hearts find rest!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/013029",
        "Body":  "Those who believe and do right: Joy is for them, and bliss\n\t\t\t(their) journey\u0027s end."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/013003",
        "Body":  "And He it is who spread out the earth and placed therein firm\n\t\t\thills and flowing streams, and of all fruits be placed therein\n\t\t\ttwo spouses (male and female). He covereth the night with the\n\t\t\tday. Lo! herein verily are portents for people who take thought."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/013030",
        "Body":  "Thus We send thee (O Muhammad) unto a nation, before whom other\n\t\t\tnations have passed away, that thou mayst recite unto them that\n\t\t\twhich We have inspired in thee, while they are disbelievers in\n\t\t\tthe Beneficent. Say: He is my Lord; there is no God save Him. In\n\t\t\tHim do I put my trust and unto Him is my recourse."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/013031",
        "Body":  "Had it been possible for a Lecture to cause the mountains to\n\t\t\tmove, or the earth to be torn asunder, or the dead to speak,\n\t\t\t(this Quran would have done so). Nay, but Allah\u0027s is the whole\n\t\t\tcommand. Do not those who believe know that, had Allah willed, He\n\t\t\tcould have guided all mankind? As for those who disbelieve,\n\t\t\tdisaster ceaseth not to strike them because of what they do, or\n\t\t\tit dwelleth near their home until the threat of Allah come to\n\t\t\tpass. Lo! Allah faileth not to keep the tryst."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/013032",
        "Body":  "And verily messengers (of Allah) were mocked before thee, but\n\t\t\tlong I bore with those who disbelieved. At length I seized them,\n\t\t\tand how (awful) was My punishment!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/013033",
        "Body":  "Is He Who is aware of the deserts of every soul (as he who is\n\t\t\taware of nothing)? Yet they ascribe unto Allah partners. Say:\n\t\t\tName them. Is it that ye would inform Him of something which He\n\t\t\tknoweth not in the earth? Or is it but a way of speaking? Nay,\n\t\t\tbut their contrivance is made seeming fair for those who\n\t\t\tdisbelieve and they are kept from the right road. He whom Allah\n\t\t\tsendeth astray, for him there is no guide."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/013034",
        "Body":  "For them is torment in the life of the world, and verily the doom\n\t\t\tof the Hereafter is more painful, and they have no defender from\n\t\t\tAllah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/013035",
        "Body":  "A similitude of the Garden which is promised unto those who keep\n\t\t\ttheir duty (to Allah): Underneath it rivers flow; its food is\n\t\t\teverlasting, and its shade; this is the reward of those who keep\n\t\t\ttheir duty, while the reward of disbelievers is the Fire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/013036",
        "Body":  "Those unto whom We gave the Scripture rejoice in that which is\n\t\t\trevealed unto thee. And of the clans there are who deny some of\n\t\t\tit. Say: I am commanded only that I serve Allah and ascribe unto\n\t\t\tHim no partner. Unto Him I cry, and unto Him is my return."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/013037",
        "Body":  "Thus have We revealed it, a decisive utterance in Arabic and if\n\t\t\tthou shouldst follow their desires after that which hath come\n\t\t\tunto thee of knowledge, then truly wouldst thou have from Allah\n\t\t\tno protecting friend nor defender."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/013038",
        "Body":  "And verily We sent messengers (to mankind) before thee, and We\n\t\t\tappointed for them wives and offspring, and it was not (given) to\n\t\t\tany messenger that he should bring a portent save by Allah\u0027s\n\t\t\tleave. For everything there is a time prescribed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/013039",
        "Body":  "Allah effaceth what He will, and establisheth (what He will), and\n\t\t\twith Him is the source of ordinance."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/013004",
        "Body":  "And in the Earth are neighboring tracts, vineyards and ploughed\n\t\t\tlands, and date palms, like and unlike, which are watered with\n\t\t\tone water. And We have made some of them to excel others in\n\t\t\tfruit. Lo! herein verily are portents for people who have sense."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/013040",
        "Body":  "Whether We let thee see something of that which We have promised\n\t\t\tthem, or make thee die (before its happening), thine is but\n\t\t\tconveyance (of the message), Ours the reckoning."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/013041",
        "Body":  "See they not how We visit the land, reducing it of its outlying\n\t\t\tparts? (When) Allah doometh there is none that can postpone His\n\t\t\tdoom, and He is swift at reckoning."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/013042",
        "Body":  "Those who were before them plotted; but all plotting is Allah\u0027s.\n\t\t\tHe knoweth that which each soul earneth. The disbelievers will\n\t\t\tcome to know for whom will be the sequel of the (heavenly) Home."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/013043",
        "Body":  "They who disbelieve say: Thou art no messenger (of Allah). Say:\n\t\t\tAllah, and whosoever hath true knowledge of the Scripture, is\n\t\t\tsufficient witness between me and you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/013005",
        "Body":  "And if thou wonderest, then wondrous is their saying: When we are\n\t\t\tdust, are we then forsooth (to be raised) in a new creation? Such\n\t\t\tare they who disbelieve in their Lord; such have carcans on their\n\t\t\tnecks; such are rightful owners of the Fire, they will abide\n\t\t\ttherein."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/013006",
        "Body":  "And they bid thee hasten on the evil rather than the good, when\n\t\t\texemplary punishments have indeed occurred before them. But lo!\n\t\t\tthy Lord is rich in pardon for mankind despite their wrong, and\n\t\t\tlo! thy Lord is strong in punishment!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/013007",
        "Body":  "Those who disbelieve say: If only some portent were sent down\n\t\t\tupon him from his Lord! Thou art a warner only, and for every\n\t\t\tfolk a guide."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/013008",
        "Body":  "Allah knoweth that which every female beareth and that which the\n\t\t\twombs absorb and that which they grow. And everything with Him is\n\t\t\tmeasured."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "13",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/013009",
        "Body":  "He is the Knower of the invisible and the visible, the Great, the\n\t\t\tHigh Exalted."
    }
]
