[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/006001",
        "Body":  "Praise be to Allah, Who hath created the heavens and the earth,\n\t\t\tand hath appointed darkness and light. Yet those who disbelieve\n\t\t\tascribe rivals unto their Lord."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/006010",
        "Body":  "Messengers (of Allah) have been derided before thee, but that\n\t\t\twhereat they scoffed surrounded such of them as did deride."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "100",
        "Recitation":  "Alafasy_128kbps/006100",
        "Body":  "Yet they ascribe as partners unto Him the jinn, although He did\n\t\t\tcreate them, and impute falsely, without knowledge, sons and\n\t\t\tdaughters unto Him. Glorified be He and high exalted above (all)\n\t\t\tthat they ascribe (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "101",
        "Recitation":  "Alafasy_128kbps/006101",
        "Body":  "The Originator of the heavens and the earth! How can He have a\n\t\t\tchild, when there is for Him no consort, when He created all\n\t\t\tthings and is Aware of all things?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "102",
        "Recitation":  "Alafasy_128kbps/006102",
        "Body":  "Such is Allah, your Lord. There is no God save Him, the Creator\n\t\t\tof all things, so worship Him. And He taketh care of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "103",
        "Recitation":  "Alafasy_128kbps/006103",
        "Body":  "Vision comprehendeth Him not, but He comprehendeth (all) vision.\n\t\t\tHe is the Subtile, the Aware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "104",
        "Recitation":  "Alafasy_128kbps/006104",
        "Body":  "Proofs have come unto you from your Lord, so whoso seeth, it is\n\t\t\tfor his own good, and whoso is blind is blind to his own hurt.\n\t\t\tAnd I am not a keeper over you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "105",
        "Recitation":  "Alafasy_128kbps/006105",
        "Body":  "Thus do We display Our revelations that they may say (unto thee,\n\t\t\tMuhammad): \"Thou hast studied,\" and that We may make (it) clear\n\t\t\tfor people who have knowledge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "106",
        "Recitation":  "Alafasy_128kbps/006106",
        "Body":  "Follow that which is inspired in thee from thy Lord; there is no\n\t\t\tGod save Him; and turn away from the idolaters."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "107",
        "Recitation":  "Alafasy_128kbps/006107",
        "Body":  "Had Allah is willed, they had not been idolatrous. We have not\n\t\t\tset thee as a keeper over them, nor art thou responsible for\n\t\t\tthem."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "108",
        "Recitation":  "Alafasy_128kbps/006108",
        "Body":  "Revile not those unto whom they pray beside Allah lest they\n\t\t\twrongfully revile Allah through ignorance. Thus unto every nation\n\t\t\thave We made their deed seem fair. Then unto their Lord is their\n\t\t\treturn, and He will tell them what they used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "109",
        "Recitation":  "Alafasy_128kbps/006109",
        "Body":  "And they swear a solemn oath by Allah that if there come unto\n\t\t\tthem a portent they will believe therein. Say: Portents are with\n\t\t\tAllah and (so is) that which telleth you that if such came unto\n\t\t\tthem they would not believe."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/006011",
        "Body":  "Say (unto the disbelievers): Travel in the land, and see the\n\t\t\tnature of the consequence for the rejecters!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "110",
        "Recitation":  "Alafasy_128kbps/006110",
        "Body":  "We confound their hearts and their eyes. As they believed not\n\t\t\ttherein at the first, We let them wander blindly on in their\n\t\t\tcontumacy."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "111",
        "Recitation":  "Alafasy_128kbps/006111",
        "Body":  "And though We should send down the angels unto them, and the dead\n\t\t\tshould speak unto them, and We should gather against them all\n\t\t\tthings in array, they would not believe unless Allah so willed.\n\t\t\tHowbeit, most of them are ignorant."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "112",
        "Recitation":  "Alafasy_128kbps/006112",
        "Body":  "Thus have We appointed unto every Prophet an adversary--devils of\n\t\t\thumankind and jinn who inspire in one another plausible discourse\n\t\t\tthrough guile. If thy Lord willed, they would not do so; so leave\n\t\t\tthem alone with their devising;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "113",
        "Recitation":  "Alafasy_128kbps/006113",
        "Body":  "That the hearts of those who believe not in the Hereafter may\n\t\t\tincline thereto, and that they may take pleasure therein, and\n\t\t\tthat they may earn what they are earning."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "114",
        "Recitation":  "Alafasy_128kbps/006114",
        "Body":  "Shall I seek other than Allah for judge, when He it is who hath\n\t\t\trevealed unto you (this) Scripture, fully explained? Those unto\n\t\t\twhom We gave the Scripture (aforetime) know that it is revealed\n\t\t\tfrom thy Lord in truth. So be not thou (O Muhammad) of the\n\t\t\twaverers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "115",
        "Recitation":  "Alafasy_128kbps/006115",
        "Body":  "Perfected is the Word of thy Lord in truth and justice. There is\n\t\t\tnaught that can change His words. He is the Hearer, the Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "116",
        "Recitation":  "Alafasy_128kbps/006116",
        "Body":  "If thou obeyedst most of those on earth they would mislead thee\n\t\t\tfar from Allah\u0027s way. They follow naught but an opinion, and they\n\t\t\tdo but guess."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "117",
        "Recitation":  "Alafasy_128kbps/006117",
        "Body":  "Lo! thy Lord, He knoweth best who erreth from His way; and He\n\t\t\tknoweth best (who are) the rightly guided."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "118",
        "Recitation":  "Alafasy_128kbps/006118",
        "Body":  "Eat of that over which the name of Allah hath been mentioned, if\n\t\t\tye are believers in His revelations."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "119",
        "Recitation":  "Alafasy_128kbps/006119",
        "Body":  "How should ye not eat of that over which the name of Allah hath\n\t\t\tbeen mentioned, when He hath explained unto you that which is\n\t\t\tforbidden unto you, unless ye are compelled thereto. But lo! many\n\t\t\tare led astray by their own lusts through ignorance. Lo! thy\n\t\t\tLord, He is best aware of the transgressors."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/006012",
        "Body":  "Say: Unto whom belongeth whatsoever is in the heavens and the\n\t\t\tearth? Say: Unto Allah. He hath prescribed for Himself mercy,\n\t\t\tthat He may bring you all together to a Day whereof there is no\n\t\t\tdoubt. Those who ruin their own souls will not believe."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "120",
        "Recitation":  "Alafasy_128kbps/006120",
        "Body":  "Forsake the outwardness of sin and the inwardness thereof. Lo!\n\t\t\tthose who garner sin will be awarded that which they have earned."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "121",
        "Recitation":  "Alafasy_128kbps/006121",
        "Body":  "And eat not of that whereon Allah\u0027s name hath not been mentioned,\n\t\t\tfor lo! it is abomination. Lo! the devils do inspire thee minions\n\t\t\tto dispute with you. But if ye obey them, ye will be in truth\n\t\t\tidolaters."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "122",
        "Recitation":  "Alafasy_128kbps/006122",
        "Body":  "Is he who was dead and We have raised him unto life, and set for\n\t\t\thim a light wherein he walketh among men, as him whose similitude\n\t\t\tis in utter darkness whence he cannot emerge? Thus is their\n\t\t\tconduct made fair-seeming for the disbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "123",
        "Recitation":  "Alafasy_128kbps/006123",
        "Body":  "And thus have We made in every city great ones of its wicked\n\t\t\tones, that they should plot therein. They do but plot against\n\t\t\tthemselves, though they perceive not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "124",
        "Recitation":  "Alafasy_128kbps/006124",
        "Body":  "And when a token cometh unto them, they say: We will not believe\n\t\t\ttill we are given that which Allah\u0027s messengers are given. Allah\n\t\t\tknoweth best with whom to place His message. Humiliation from\n\t\t\tAllah and heavy punishment will smite the guilty for their\n\t\t\tscheming."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "125",
        "Recitation":  "Alafasy_128kbps/006125",
        "Body":  "And whomsoever it is Allah\u0027s will to guide, He expandeth his\n\t\t\tbosom unto the Surrender, and whomsoever it is His will to send\n\t\t\tastray, He maketh his bosom close and narrow as if he were\n\t\t\tengaged in sheer ascent. Thus Allah layeth ignominy upon those\n\t\t\twho believe not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "126",
        "Recitation":  "Alafasy_128kbps/006126",
        "Body":  "This is the path of thy Lord, a straight path. We have detailed\n\t\t\tOur revelations for a people who take heed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "127",
        "Recitation":  "Alafasy_128kbps/006127",
        "Body":  "For them is the abode of peace with their Lord. He will be their\n\t\t\tProtecting Friend because of what they used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "128",
        "Recitation":  "Alafasy_128kbps/006128",
        "Body":  "In the day when He will gather them together (He will say): O ye\n\t\t\tassembly of the jinn! Many of humankind did ye seduce. And their\n\t\t\tadherents among humankind will say: Our Lord! We enjoyed one\n\t\t\tanother, but now we have arrived at the appointed term which Thou\n\t\t\tappointedst for us. He will say: Fire is your home. Abide therein\n\t\t\tfor ever, save him whom Allah willeth (to deliver). Lo! thy Lord\n\t\t\tis Wise, Aware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "129",
        "Recitation":  "Alafasy_128kbps/006129",
        "Body":  "Thus We let some of the wrong-doers have power over others\n\t\t\tbecause of what they are wont to earn."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/006013",
        "Body":  "Unto Him belongeth whatsoever resteth in the night and the day.\n\t\t\tHe is the Hearer, the Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "130",
        "Recitation":  "Alafasy_128kbps/006130",
        "Body":  "O ye assembly of the jinn and humankind! Came there not unto you\n\t\t\tmessengers of your own who recounted unto you My tokens and\n\t\t\twarned you of the meeting of this your Day? They will say: We\n\t\t\ttestify against ourselves. And the life of the world beguiled\n\t\t\tthem. And they testify against themselves that they were\n\t\t\tdisbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "131",
        "Recitation":  "Alafasy_128kbps/006131",
        "Body":  "This is because thy Lord destroyeth not the townships arbitrarily\n\t\t\twhile their people are unconscious (of the wrong they do)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "132",
        "Recitation":  "Alafasy_128kbps/006132",
        "Body":  "For all there will be ranks from what they did. Thy Lord is not\n\t\t\tunaware of what they do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "133",
        "Recitation":  "Alafasy_128kbps/006133",
        "Body":  "Thy Lord is the Absolute, the Lord of Mercy. If He will, He can\n\t\t\tremove you and can cause what He will to follow after you, even\n\t\t\tas He raised you from the seed of other folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "134",
        "Recitation":  "Alafasy_128kbps/006134",
        "Body":  "Lo! that which ye are promised will surely come to pass, and ye\n\t\t\tcannot escape."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "135",
        "Recitation":  "Alafasy_128kbps/006135",
        "Body":  "Say (O Muhammad) : O my people! Work according to your power. Lo!\n\t\t\tI too am working. Thus ye will come to know for which of us will\n\t\t\tbe the happy sequel. Lo! the wrong- doers will not be successful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "136",
        "Recitation":  "Alafasy_128kbps/006136",
        "Body":  "They assign unto Allah, of the crops and cattle which He created,\n\t\t\ta portion, and they say: \"This is Allah\u0027s\" in their make believe\n\t\t\t\"and this is for (His) partners in regard to us.\" Thus that which\n\t\t\t(they assign) unto His partners in them reacheth not Allah and\n\t\t\tthat which (they assign) unto Allah goeth to their (so-called)\n\t\t\tpartners. Evil is their ordinance."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "137",
        "Recitation":  "Alafasy_128kbps/006137",
        "Body":  "Thus have their (so-called) partners (of Allah) made the killing\n\t\t\tof their children to seem fair unto many of the idolaters, that\n\t\t\tthey may ruin them and make their faith obscure for them. Had\n\t\t\tAllah willed (it otherwise), they had not done so. So leave them\n\t\t\talone with their devices."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "138",
        "Recitation":  "Alafasy_128kbps/006138",
        "Body":  "And they say: Such cattle and crops are forbidden. No one is to\n\t\t\teat of them save whom We will--in their make believe--cattle\n\t\t\twhose backs are forbidden, cattle over which they mention not the\n\t\t\tname of Allah. (All that is) a lie against Him. He will repay\n\t\t\tthem for that which they invent."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "139",
        "Recitation":  "Alafasy_128kbps/006139",
        "Body":  "And they say: That which is in the bellies of such cattle is\n\t\t\treserved for our males and is forbidden to our wives; but if it\n\t\t\tbe born dead, then they (all) may be partakers thereof. He will\n\t\t\treward them for their attribution (ordinances unto Him). Lo, He\n\t\t\tis Wise, Aware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/006014",
        "Body":  "Say: Shall I choose for a protecting friend other than Allah, the\n\t\t\tOriginator of the heavens and the earth, who feedeth and is never\n\t\t\tfed? Say: I am ordered to be the first to surrender (unto Him) .\n\t\t\tAnd be not thou (O Muhammad) of the idolaters."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "140",
        "Recitation":  "Alafasy_128kbps/006140",
        "Body":  "They are losers who besottedly have slain their children without\n\t\t\tknowledge, and have forbidden that which Allah bestowed upon\n\t\t\tthem, inventing a lie against Allah. They indeed have gone astray\n\t\t\tand are not guided."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "141",
        "Recitation":  "Alafasy_128kbps/006141",
        "Body":  "He it is Who produceth gardens trellised and untrellised, and the\n\t\t\tdate palm, and crops of divers flavor, and the olive and the\n\t\t\tpomegranate, like and unlike. Eat ye of the fruit thereof when it\n\t\t\tfruiteth, and pay the due thereof upon the harvest day, and be\n\t\t\tnot prodigal. Lo! Allah loveth not the prodigals."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "142",
        "Recitation":  "Alafasy_128kbps/006142",
        "Body":  "And of the cattle (He produceth) some for burdens, some for food.\n\t\t\tEat of that which Allah hath bestowed upon you, and follow not\n\t\t\tthe footsteps of the devil, for lo! he is an open foe to you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "143",
        "Recitation":  "Alafasy_128kbps/006143",
        "Body":  "Eight pairs: Of the sheep twain, and of the goats twain. Say:\n\t\t\tHath He forbidden the two males or the two females, or that which\n\t\t\tthe wombs of the two females contain? Expound to me (the case)\n\t\t\twith knowledge, if ye are truthful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "144",
        "Recitation":  "Alafasy_128kbps/006144",
        "Body":  "And of the camels twain and of the oxen twain. Say: Hath He\n\t\t\tforbidden the two males or the two females, or that which the\n\t\t\twombs of the two females contain; or were ye by to witness when\n\t\t\tAllah commanded you (all) this? Then who doth greater wrong than\n\t\t\the who deviseth a lie concerning Allah, that he may lead mankind\n\t\t\tastray without knowledge. Lo! Allah guideth not wrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "145",
        "Recitation":  "Alafasy_128kbps/006145",
        "Body":  "Say: I find not in that which is revealed unto me aught\n\t\t\tprohibited to an eater that he eat thereof, except it be carrion,\n\t\t\tor blood poured forth, or swineflesh for that verily is foul or\n\t\t\tthe abomination which was immolated to the name of other than\n\t\t\tAllah. But whoso is compelled (thereto), neither craving nor\n\t\t\ttransgressing, (for him) lo ! your Lord is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "146",
        "Recitation":  "Alafasy_128kbps/006146",
        "Body":  "Unto those who are Jews We forbade every animal with claws. And\n\t\t\tof the oxen and the sheep forbade We unto them the fat thereof\n\t\t\tsave that upon the backs or the entrails, or that which is mixed\n\t\t\twith the bone. That We awarded them for their rebellion. And lot\n\t\t\tWe verily are Truthful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "147",
        "Recitation":  "Alafasy_128kbps/006147",
        "Body":  "So if they give the lie to thee (Muhammad), say: Your Lord is a\n\t\t\tLord of all embracing mercy, and His wrath will never be\n\t\t\twithdrawn from guilty folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "148",
        "Recitation":  "Alafasy_128kbps/006148",
        "Body":  "They who are idolaters will say: Had Allah willed, we had not\n\t\t\tascribed (unto Him) partners neither had our fathers, nor had we\n\t\t\tforbidden aught. Thus did those who were before them give the lie\n\t\t\t(to Allah\u0027s messengers) till they tasted of the fear of Us. Say:\n\t\t\tHave ye any knowledge that ye can adduce for us? Lo! ye follow\n\t\t\tnaught but an opinion. Lo! ye do but guess."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "149",
        "Recitation":  "Alafasy_128kbps/006149",
        "Body":  "Say--For Allah\u0027s is the final argument--Had He willed He could\n\t\t\tindeed have guided all of you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/006015",
        "Body":  "Say: I fear, if I rebel against my Lord, the retribution of an\n\t\t\tAwful Day."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "150",
        "Recitation":  "Alafasy_128kbps/006150",
        "Body":  "Say: Come, bring your witnesses who can bear witness that Allah\n\t\t\tforbade (all) this. And if they bear witness, do not thou bear\n\t\t\twitness with them. Follow thou not the whims of those who deny\n\t\t\tOur revelations, those who believe not in the Hereafter and deem\n\t\t\t(others) equal with their Lord."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "151",
        "Recitation":  "Alafasy_128kbps/006151",
        "Body":  "Say: Come, I will recite unto you that which your Lord hath made\n\t\t\ta sacred duty for you: that ye ascribe no thing as partner unto\n\t\t\tHim and that ye do good to parents, and that ye slay not your\n\t\t\tchildren because of penury--We provide for you and for them--and\n\t\t\tthat ye draw not nigh to lewd things whether open or concealed.\n\t\t\tAnd that ye slay not the life which Allah hath made sacred, save\n\t\t\tin the course of justice. This He hath commanded you, in order\n\t\t\tthat ye may discern."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "152",
        "Recitation":  "Alafasy_128kbps/006152",
        "Body":  "And approach not the wealth of the orphan save with that which is\n\t\t\tbetter; till he reach maturity. Give full measure and full\n\t\t\tweight, in justice. We task not any soul beyond its scope. And if\n\t\t\tye give your word, do justice thereunto, even though it be\n\t\t\t(against) a kinsman; and fulfil the covenant of Allah. This He\n\t\t\tcommandeth you that haply ye may remember."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "153",
        "Recitation":  "Alafasy_128kbps/006153",
        "Body":  "And (He commandeth you, saying) : This is My straight path, so\n\t\t\tfollow it Follow not other ways, lest ye be parted from His way:\n\t\t\tThis hath He ordained for you, that ye may ward off (evil)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "154",
        "Recitation":  "Alafasy_128kbps/006154",
        "Body":  "Again, We gave the Scripture unto Moses, complete for him who\n\t\t\twould do good, an explanation of all things, a guidance and a\n\t\t\tmercy, that they might believe in the meeting with their Lord."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "155",
        "Recitation":  "Alafasy_128kbps/006155",
        "Body":  "And this is a blessed Scripture which We have revealed. So follow\n\t\t\tit and ward off (evil), that ye may find mercy."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "156",
        "Recitation":  "Alafasy_128kbps/006156",
        "Body":  "Lest ye should say: The Scripture was revealed only to two sects\n\t\t\tbefore us, and we in truth were unaware of what they read;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "157",
        "Recitation":  "Alafasy_128kbps/006157",
        "Body":  "Or lest ye should say: If the Scripture had been revealed unto\n\t\t\tus, we surely had been better guided than are they. Now hath\n\t\t\tthere come unto you a clear proof from your Lord, a guidance and\n\t\t\ta mercy; and who doeth greater wrong than he who denieth the\n\t\t\trevelations of Allah, and turneth away from them? We award unto\n\t\t\tthose who turn away from Our revelations an evil doom because of\n\t\t\ttheir aversion."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "158",
        "Recitation":  "Alafasy_128kbps/006158",
        "Body":  "Wait they, indeed, for nothing less than that the angels should\n\t\t\tcome unto them, or thy Lord should come, or there should come one\n\t\t\tof the portents from thy Lord? In the day when one of the\n\t\t\tportents from they Lord cometh, its belief availeth naught a soul\n\t\t\twhich theretofore believed not, nor in its belief earned good (by\n\t\t\tworks). Say: Wait ye! Lo! We (too) are waiting."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "159",
        "Recitation":  "Alafasy_128kbps/006159",
        "Body":  "Lo! As for those who sunder their religion and become\n\t\t\tschismatics, no concern at all hast thou with them. Their case\n\t\t\twill go to Allah, who then will tell them what they used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/006016",
        "Body":  "He from whom (such retribution) is averted on that day (Allah)\n\t\t\thath in truth had mercy on him. That will be the signal triumph."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "160",
        "Recitation":  "Alafasy_128kbps/006160",
        "Body":  "Whoso bringeth a good deed will receive tenfold the like thereof,\n\t\t\twhile whoso bringeth an ill deed will be awarded but the like\n\t\t\tthereof; and they will not be wronged."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "161",
        "Recitation":  "Alafasy_128kbps/006161",
        "Body":  "Say: Lo! As for me, my Lord hath guided me unto a straight path,\n\t\t\ta right religion, the community of Abraham, the upright, who was\n\t\t\tno idolater."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "162",
        "Recitation":  "Alafasy_128kbps/006162",
        "Body":  "Say: Lo! my worship and, my sacrifice and my living and my dying\n\t\t\tare for Allah, Lord of the Worlds."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "163",
        "Recitation":  "Alafasy_128kbps/006163",
        "Body":  "He hath no partner. This am I commanded, and I am first of those\n\t\t\twho surrender (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "164",
        "Recitation":  "Alafasy_128kbps/006164",
        "Body":  "Say: Shall I seek another than Allah for Lord, when He is Lord of\n\t\t\tall things? Each soul earneth only on its own account, nor doth\n\t\t\tany laden bear another\u0027s load. Then unto your Lord is your return\n\t\t\tand He will tell you that wherein ye differed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "165",
        "Recitation":  "Alafasy_128kbps/006165",
        "Body":  "He it is who hath placed you as viceroys of the earth and hath\n\t\t\texalted some of you in rank above others, that He may try you by\n\t\t\t(the test of) that which He hath given you. Lo! Thy Lord is swift\n\t\t\tin prosecution, and lo! He is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/006017",
        "Body":  "If Allah touch thee with affliction, there is none that can\n\t\t\trelieve therefrom save Him, and if He touch thee with good\n\t\t\tfortune (there is none that can impair it); for He is Able to do\n\t\t\tall things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/006018",
        "Body":  "He is the Omnipotent over His slaves, and He is the Wise, the\n\t\t\tKnower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/006019",
        "Body":  "Say (O Muhammad) : What thing is of most weight in testimony?\n\t\t\tSay: Allah is witness between you and me. And this Qur\u0027an hath\n\t\t\tbeen inspired in me, that I may warn therewith you and whomsoever\n\t\t\tit may reach. Do ye in truth bear witness that there are gods\n\t\t\tbeside Allah? Say: I bear no such witness. Say: He is only One\n\t\t\tGod. Lo! I am innocent of that which ye associate (with Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/006002",
        "Body":  "He it is Who hath created you from clay, and hath decreed a term\n\t\t\tfor you. A term is fixed with Him. Yet still ye doubt!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/006020",
        "Body":  "Those unto whom We gave the Scripture recognize (this Revelation)\n\t\t\tas they recognize their sons. Those who ruin their own souls will\n\t\t\tnot believe."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/006021",
        "Body":  "Who doth greater wrong than he who inventeth a lie against Allah\n\t\t\tand denieth His revelations? Lo! the wrong doers will not be\n\t\t\tsuccessful"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/006022",
        "Body":  "And on the Day We gather them together We shall say unto those\n\t\t\twho ascribed partners (unto Allah): Where are (now) those\n\t\t\tpartners of your make believe?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/006023",
        "Body":  "Then will they have no contention save that they will say: By\n\t\t\tAllah, our Lord, we never were idolaters."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/006024",
        "Body":  "See how they lie against themselves, and (how) the thing which\n\t\t\tthey devised hath failed them!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/006025",
        "Body":  "Of them are some who listen unto thee, but We have placed upon\n\t\t\ttheir hearts veils, lest they should understand, and in their\n\t\t\tears a deafness. If they saw every token they would not believe\n\t\t\ttherein; to the point that, when they come unto thee to argue\n\t\t\twith thee, the disbelievers say: This is naught else than fables\n\t\t\tof the men of old."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/006026",
        "Body":  "And they forbid (men) from it and avoid it, and they ruin none\n\t\t\tsave themselves, though they perceive not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/006027",
        "Body":  "If thou couldst see when they are set before the Fire and say:\n\t\t\tOh, would that we might return! Then would we not deny the\n\t\t\trevelations of our Lord but we would be of the believers!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/006028",
        "Body":  "Nay, but that hath become clear unto them which before they used\n\t\t\tto hide. And if they were sent back they would return unto that\n\t\t\twhich they are forbidden. Lo! they are liars."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/006029",
        "Body":  "And they say: There is naught save our life of the world, and we\n\t\t\tshall not be raised (again)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/006003",
        "Body":  "He is Allah in the heavens and in the earth. He knoweth both your\n\t\t\tsecret and your utterance, and He knoweth what ye earn."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/006030",
        "Body":  "If thou couldst see when they are set before their Lord! He will\n\t\t\tsay: Is not this real? They will say: Yea, verily, by our Lord!\n\t\t\tHe will say: Taste now the retribution for that ye used to\n\t\t\tdisbelieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/006031",
        "Body":  "They indeed are losers who deny their meeting with Allah until,\n\t\t\twhen the hour cometh on them suddenly, they cry: Alas for us,\n\t\t\tthat we neglected it! They bear upon their back their burdens.\n\t\t\tAh, evil is that which they bear!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/006032",
        "Body":  "Naught is the life of the world save a pastime and a sport.\n\t\t\tBetter far is the abode of the Hereafter for those who keep their\n\t\t\tduty (to Allah). Have ye then no sense?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/006033",
        "Body":  "We know well how their talk grieveth thee, though in truth they\n\t\t\tdeny not thee (Muhammad) but evil-doers flout the revelations of\n\t\t\tAllah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/006034",
        "Body":  "Messengers indeed have been denied before thee, and they were\n\t\t\tpatient under the denial and the persecution till Our succour\n\t\t\treached them. There is none to alter the decisions of Allah.\n\t\t\tAlready there hath reached thee (somewhat) of the tidings of the\n\t\t\tmessengers (We sent before)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/006035",
        "Body":  "And if their aversion is grievous unto thee, then, if thou canst,\n\t\t\tseek a way down into the earth or a ladder unto the sky that thou\n\t\t\tmayst bring unto them a portent (to convince them all)! If Allah\n\t\t\twilled, He could have brought them all together to the guidance\n\t\t\tSo be not thou among the foolish ones."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/006036",
        "Body":  "Only those can accept who hear. As for the dead, Allah will raise\n\t\t\tthem up; then unto Him they will be returned."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/006037",
        "Body":  "They say: Why hath no portent been sent down upon him from his\n\t\t\tLord? Say: Lo! Allah is Able to send down a portent. But most of\n\t\t\tthem know not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/006038",
        "Body":  "There is not an animal in the earth, nor a flying creature flying\n\t\t\ton two wings, but they are peoples like unto you. We have\n\t\t\tneglected nothing in the Book (of Our decrees). Then unto their\n\t\t\tLord they will be gathered."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/006039",
        "Body":  "Those who deny our revelations are deaf and dumb in darkness.\n\t\t\tWhom Allah will He sendeth astray, and whom He will He placeth on\n\t\t\ta straight path."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/006004",
        "Body":  "Never came there unto them a revelation of the revelations of\n\t\t\tAllah but they did turn away from it."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/006040",
        "Body":  "Say: Can ye see yourselves, if the punishment of Allah come upon\n\t\t\tyou or the Hour come upon you, calling upon other than Allah? Do\n\t\t\tye then call (for help) to any other than Allah? (Answer that) if\n\t\t\tye are truthful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/006041",
        "Body":  "Nay, but unto Him ye call, and He removeth that because of which\n\t\t\tye call unto Him, if He will, and ye forget whatever partners ye\n\t\t\tascribed unto Him."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/006042",
        "Body":  "We have sent already unto peoples that were before thee, and We\n\t\t\tvisited them with tribulation and adversity, in order that they\n\t\t\tmight grow humble."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/006043",
        "Body":  "If only, when our disaster came on them, they had been humble!\n\t\t\tBut their hearts were hardened and the devil made all that they\n\t\t\tused to do seem fair unto them!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/006044",
        "Body":  "Then, when they forgot that whereof they had been reminded, We\n\t\t\topened unto them the gates of all things till, even as they were\n\t\t\trejoicing in that which they were given, We seized them unawares,\n\t\t\tand lo! they were dumbfounded."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/006045",
        "Body":  "So of the people who did wrong the last remnant was cut off.\n\t\t\tPraise be to Allah, Lord of the Worlds!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/006046",
        "Body":  "Say: Have ye imagined, if Allah should take away your hearing and\n\t\t\tyour sight and seal your hearts, who is the God who could restore\n\t\t\tit to you save Allah? See how We display the revelations unto\n\t\t\tthem? Yet still they turn away."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/006047",
        "Body":  "Say: Can ye see yourselves, if the punishment of Allah come upon\n\t\t\tyou unawares or openly? Would any perish save wrongdoing folk?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/006048",
        "Body":  "We send not the messengers save as bearers of good news and\n\t\t\twarners. Whoso believeth and doeth right, there shall no fear\n\t\t\tcome upon them neither shall they grieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/006049",
        "Body":  "But as for those who deny Our revelations, torment will afflict\n\t\t\tthem for that they used to disobey."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/006005",
        "Body":  "And they denied the truth when it came unto them. But there will\n\t\t\tcome unto them the tidings of that which they used to deride."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/006050",
        "Body":  "Say (O Muhammad, to the disbelievers): I say not unto you (that)\n\t\t\tI possess the treasures of Allah, nor that I have knowledge of\n\t\t\tthe Unseen; and I say not unto you: Lo! I am an angel. I follow\n\t\t\tonly that which is inspired in me. Say: Are the blind man and the\n\t\t\tseer equal? Will ye not then take thought?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/006051",
        "Body":  "Warn hereby those who fear (because they know) that they will be\n\t\t\tgathered unto their Lord, for whom there is no protecting friend\n\t\t\tnor intercessor beside Him, that they may ward off (evil)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/006052",
        "Body":  "Repel not those who call upon their Lord at morn and evening,\n\t\t\tseeking His countenance. Thou art not accountable for them in\n\t\t\taught, nor are they accountable for thee in aught, that thou\n\t\t\tshouldst repel them and be of the wrong-doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/006053",
        "Body":  "And even so do We try some of them by others, that they say: Are\n\t\t\tthese they whom Allah favoureth among us? Is not Allah best aware\n\t\t\tof the thanksgivers?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/006054",
        "Body":  "And when those who believe in Our revelations come unto thee,\n\t\t\tsay: Peace be unto you! Your Lord hath prescribed for Himself\n\t\t\tmercy, that whoso of you doeth evil and repenteth afterward\n\t\t\tthereof and doeth right, (for him) lo! Allah is Forgiving,\n\t\t\tMerciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/006055",
        "Body":  "Thus do We expound the revelations that the way of the\n\t\t\tunrighteous may be manifest."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/006056",
        "Body":  "Say: I am forbidden to worship those on whom ye call instead of\n\t\t\tAllah. Say: I will not follow your desires, for then should I go\n\t\t\tastray and I should not be of the rightly guided."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/006057",
        "Body":  "Say: I am (relying) on clear proof from my Lord, while ye deny\n\t\t\tHim. I have not that for which ye are impatient. The decision is\n\t\t\tfor Allah only. He telleth the truth and He is the Best of\n\t\t\tDeciders."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/006058",
        "Body":  "Say: If I had that for which ye are impatient, then would the\n\t\t\tcase (ere this) have been decided between me and you. Allah is\n\t\t\tbest aware of the wrong doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/006059",
        "Body":  "And with Him are the keys of the invisible. None but He knoweth\n\t\t\tthem. And He knoweth what is in the land and the sea. Not a leaf\n\t\t\tfalleth but He knoweth it, not a grain amid the darkness of the\n\t\t\tearth, naught of wet or dry but (it is noted) in a clear record."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/006006",
        "Body":  "See they not how many a generation We destroyed before them, whom\n\t\t\tWe had established in the earth more firmly than We have\n\t\t\testablished you, and We shed on them abundant showers from the\n\t\t\tsky, and made the rivers flow beneath them. Yet We destroyed them\n\t\t\tfor their sins, and created after them another generation."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/006060",
        "Body":  "He it is Who gathereth you at night and knoweth that which ye\n\t\t\tcommit by day. Then He raiseth you again to life therein, that\n\t\t\tthe term appointed (for you) may be accomplished. And afterward\n\t\t\tunto Him is your return. Then He will proclaim unto you what ye\n\t\t\tused to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/006061",
        "Body":  "He is the Omnipotent over His slaves. He sendeth guardians over\n\t\t\tyou until, when death cometh unto one of you, Our messengers\n\t\t\treceive him, and they neglect not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/006062",
        "Body":  "Then are they restored unto Allah, their Lord, the Just. Surely\n\t\t\tHis is the judgment. And He is the most swift of reckoners."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/006063",
        "Body":  "Say: Who delivereth you from the darkness of the land and the\n\t\t\tsea? Ye call upon Him humbly and in secret, (saying): If we are\n\t\t\tdelivered from this (fear) we truly will be of the thankful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/006064",
        "Body":  "Say: Allah delivereth you from this and from all afflictions. Yet\n\t\t\tye attribute partners unto Him."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/006065",
        "Body":  "Say: He is able to send punishment upon you from above you or\n\t\t\tfrom beneath your feet, or to bewilder you with dissension and\n\t\t\tmake you taste the tyranny one of another. See how We display the\n\t\t\trevelations so that they may understand."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/006066",
        "Body":  "Thy people (O Muhammad) have denied it, though it is the Truth.\n\t\t\tSay: I am not put in charge of you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/006067",
        "Body":  "For every announcement there is a term, and ye will come to know."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/006068",
        "Body":  "And when thou seest those who meddle with Our revelations,\n\t\t\twithdraw from them until they meddle with another topic. And if\n\t\t\tthe devil cause thee to forget, sit not, after the remembrance,\n\t\t\twith the congregation of wrong doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/006069",
        "Body":  "Those who ward off (evil) are not accountable for them in aught,\n\t\t\tbut the Reminder (must be given them) that haply they (too) may\n\t\t\tward off (evil)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/006007",
        "Body":  "Had we sent down unto thee (Muhammad) (actual) writing upon\n\t\t\tparchment, so that they could feel it with their hands, those who\n\t\t\tdisbelieve would have said: This is naught else than mere magic."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/006070",
        "Body":  "And forsake those who take their religion for a pastime and a\n\t\t\tjest, and whom the life of the world beguileth. Remind (mankind)\n\t\t\thereby lest a soul be destroyed by what it earneth. It hath\n\t\t\tbeside Allah no friend nor intercessor, and though it offer every\n\t\t\tcompensation it will not be accepted from it. Those are they who\n\t\t\tperish by their own deserts. For them is drink of boiling water\n\t\t\tand a painful doom, because they disbelieved."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/006071",
        "Body":  "Say: Shall we cry, instead of unto Allah, unto that which neither\n\t\t\tprofiteth us nor hurteth us, and shall we turn back after Allah\n\t\t\thath guided us, like one bewildered whom the devils have\n\t\t\tinfatuated in the earth, who hath companions who invite him to\n\t\t\tthe guidance (saying): Come unto us? Say: Lo! the guidance of\n\t\t\tAllah is Guidance, and we are ordered to surrender to the Lord of\n\t\t\tthe Worlds,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/006072",
        "Body":  "And to establish worship and ward off (evil), and He it is unto\n\t\t\tWhom ye will be gathered."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/006073",
        "Body":  "He it is Who created the heavens and the earth in truth. In that\n\t\t\tday when He saith: Be! it is. His word is the truth, and His will\n\t\t\tbe the Sovereignty on the day when the trumpet is blown. Knower\n\t\t\tof the invisible and the visible, He is the Wise, the Aware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/006074",
        "Body":  "(Remember) when Abraham said unto his father Azar: Takest thou\n\t\t\tidols for gods? Lo! I see thee and thy folk in error manifest."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/006075",
        "Body":  "Thus did We show Abraham the kingdom of the heavens and the earth\n\t\t\tthat he mighty be of those possessing certainty:"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/006076",
        "Body":  "When the night grew dark upon him he beheld a star. He said: This\n\t\t\tis my Lord. But when it set, he said: I love not things that set."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/006077",
        "Body":  "And when he saw the moon uprising, he exclaimed: This my Lord.\n\t\t\tBut when it set, he said: Unless my Lord guide me, I surely shall\n\t\t\tbecome one of the folk who are astray."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/006078",
        "Body":  "And when he saw the sun uprising, he cried: This is my Lord! This\n\t\t\tis greater! And when it, set be exclaimed: O my people! Lo! I am\n\t\t\tfree from all that ye associate (with Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/006079",
        "Body":  "Lo! I have turned my face toward him Who created the heavens and\n\t\t\tthe earth, as one by nature upright, and I am not of the\n\t\t\tidolaters."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/006008",
        "Body":  "They say: Why hath not an angel been sent down unto him? If We\n\t\t\tsent down an angel, then the matter would be judged; no further\n\t\t\ttime would be allowed them (for reflection)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/006080",
        "Body":  "His people argued with him. He said: Dispute ye with me\n\t\t\tconcerning Allah when He hath guided me? I fear not at a]] that\n\t\t\twhich ye set beside Him unless my Lord willeth. My Lord includeth\n\t\t\tall things in His knowledge: Will ye not then remember?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/006081",
        "Body":  "How should I fear that which ye set up beside Him, when ye fear\n\t\t\tnot to set up beside Allah that for which He hath revealed unto\n\t\t\tyou no warrant? `Which of the two factions hath more right to\n\t\t\tsafety?, (Answer me that) if ye have knowledge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/006082",
        "Body":  "Those who believe and obscure not their belief by wrong doing,\n\t\t\ttheirs is safety; and they are rightly guided."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/006083",
        "Body":  "That is Our argument. We gave it unto Abraham against his folk.\n\t\t\tWe raise unto degrees of wisdom whom We will. Lo! thy Lord is\n\t\t\tWise, Aware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/006084",
        "Body":  "And We bestowed upon him Isaac and Jacob; each of them We guided;\n\t\t\tand Noah did We guide aforetime; and of his seed (We guided)\n\t\t\tDavid and Solomon and Job and Joseph and Moses and Aaron. Thus do\n\t\t\tWe reward the good."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/006085",
        "Body":  "And Zachariah and John and Jesus and Elias. Each one (of them)\n\t\t\twas of the righteous."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/006086",
        "Body":  "And Ishmael and Elisha and Jonah and Lot. Each one of them did We\n\t\t\tprefer above (Our) creatures,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/006087",
        "Body":  "With some of their forefathers and thee offspring and thee\n\t\t\tbrethren; and We chose them and guided them unto a straight path:"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/006088",
        "Body":  "Such is the guidance of Allah wherewith He guideth whom He will\n\t\t\tof His bondmen. But if they had set up (for worship ) aught\n\t\t\tbeside Him, (all) that they did would have been vain."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "89",
        "Recitation":  "Alafasy_128kbps/006089",
        "Body":  "Those are they unto whom We gave the Scripture and command and\n\t\t\tprophethood. But if these disbelieve therein, then indeed We\n\t\t\tshall entrust it to a people who will not be disbelievers\n\t\t\ttherein."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/006009",
        "Body":  "Had We appointed an angel (Our messenger), We assuredly had made\n\t\t\thim (as) a man (that he might speak to men); and (thus) obscured\n\t\t\tfor them (the truth) they (now) obscure."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "90",
        "Recitation":  "Alafasy_128kbps/006090",
        "Body":  "Those are they whom Allah guideth, so follow their guidance. Say\n\t\t\t(O Muhammad, unto mankind): I ask of you no fee for it. Lo! it is\n\t\t\tnaught but a Reminder to (His) creatures."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "91",
        "Recitation":  "Alafasy_128kbps/006091",
        "Body":  "And they measure not the power of Allah its true measure when\n\t\t\tthey say: Allah hath naught revealed unto a human being. Say\n\t\t\t(unto the Jews who speak thus): Who revealed the Book which Moses\n\t\t\tbrought, a light and guidance for mankind, which ye have put on\n\t\t\tparchments which ye show, but ye hide much (thereof), and by\n\t\t\twhich ye were taught that which ye knew not yourselves nor (did)\n\t\t\tyour fathers (know it)? Say: Allah. Then leave them to their play\n\t\t\tof cavilling."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "92",
        "Recitation":  "Alafasy_128kbps/006092",
        "Body":  "And this is a blessed Scripture which We have revealed,\n\t\t\tconfirming that which (was revealed) before it, that thou mayst\n\t\t\twarn the Mother of Villages and those around her. Those who\n\t\t\tbelieve in the Hereafter believe herein, and they are careful of\n\t\t\ttheir worship."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "93",
        "Recitation":  "Alafasy_128kbps/006093",
        "Body":  "Who is guilty of more wrong than he who forgeth a lie against\n\t\t\tAllah, or saith : I am inspired, when he is not inspired in\n\t\t\taught; and who saith: I will reveal the like of that which Allah\n\t\t\thath revealed? If thou couldst see, when the wrong doers reach\n\t\t\tthe pangs of death and the angels stretch their hands out,\n\t\t\tsaying: Deliver up your souls. This day ye are awarded doom of\n\t\t\tdegradation for that ye spake concerning Allah other than the\n\t\t\ttruth, and scorned His portents."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "94",
        "Recitation":  "Alafasy_128kbps/006094",
        "Body":  "Now have ye come unto Us solitary as We did create you at the\n\t\t\tfirst, and ye have left behind you all that We bestowed upon you,\n\t\t\tand We behold not with you those your intercessors, of whom ye\n\t\t\tclaimed that they possessed a share in you. Now is the bond\n\t\t\tbetween you severed, and that which ye presumed hath failed you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "95",
        "Recitation":  "Alafasy_128kbps/006095",
        "Body":  "Lo! Allah (it is) who splitteth the grain of corn and the\n\t\t\tdatestone (for sprouting) . He bringeth forth the living from the\n\t\t\tdead, and is the bringer forth of the dead from the living. Such\n\t\t\tis Allah. How then are ye perverted?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "96",
        "Recitation":  "Alafasy_128kbps/006096",
        "Body":  "He is the Cleaver of the Daybreak, and He hath appointed the\n\t\t\tnight for stillness, and the sun and the moon for reckoning. That\n\t\t\tis the measuring of the Mighty, the Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "97",
        "Recitation":  "Alafasy_128kbps/006097",
        "Body":  "And He it is Who hath set for you the stars that ye may guide\n\t\t\tyour course by them amid the darkness of the land and the sea We\n\t\t\thave detailed Our revelations for a people who have knowledge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "98",
        "Recitation":  "Alafasy_128kbps/006098",
        "Body":  "And He it is Who hath produced you from a single being, and (hath\n\t\t\tgiven you) a habitation and a repository. We have detailed Our\n\t\t\trevelations for a people who have understanding."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "6",
        "AyahNumber":  "99",
        "Recitation":  "Alafasy_128kbps/006099",
        "Body":  "He it is Who sendeth down water from the sky, and therewith We\n\t\t\tbring forth buds of every kind; We bring forth the green blade\n\t\t\tfrom which we bring forth the thick clustered grain; and from the\n\t\t\tdate palm, from the pollen thereof, spring pendant bunches; and\n\t\t\t(We bring forth) gardens of grapes, and the olive and the\n\t\t\tpomegranate, alike and unlike. Look upon the fruit thereof, when\n\t\t\tthey bear fruit, and upon its ripening. Lo! herein verily are\n\t\t\tportents for a people who believe."
    }
]
