[
  {
    "SurahNumber": "22",
    "AyahNumber": "1",
    "NoteID": "2770",
    "Body": "The serious issues involved are indicated by showing how\\n\\t\\t\\t\\tterrible the consequences will be for those who disobey\\n\\t\\t\\t\\tAllah's Will. The terror will only be for those who rebel\\n\\t\\t\\t\\tand disobey: the righteous will not suffer from it, but\\n\\t\\t\\t\\ton the contrary will be greeted by angels with joy (xxi.\\n\\t\\t\\t\\t103)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "2",
    "NoteID": "2771",
    "Body": "Three metaphors are used for the extreme terror which the\\n\\t\\t\\t\\tAwful Day will inspire, (1) No mother abandons the baby\\n\\t\\t\\t\\tat her breast in the greatest danger; yet that will\\n\\t\\t\\t\\thappen in this Dreadful Hour. (2) An expectant mother\\n\\t\\t\\t\\tcarries the young life within her with great pride and\\n\\t\\t\\t\\thope: yet the terror will overpower the hope at this\\n\\t\\t\\t\\t\"Hour\", and nature's working will be reversed, (3) Men\\n\\t\\t\\t\\tordinarily retain their self-possession except under\\n\\t\\t\\t\\tintoxication: here, without intoxication, they will be\\n\\t\\t\\t\\tdriven to frenzy with terror."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "4",
    "NoteID": "2772",
    "Body": "Even after the warnings there are men who are such fools\\n\\t\\t\\t\\tas to turn away from Allah who created them and cherishes\\n\\t\\t\\t\\tthem with His love and care; they become outlaws in His\\n\\t\\t\\t\\tKingdom, making friends with satan, which is a rebel in\\n\\t\\t\\t\\tAllah's Kingdom."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "5",
    "NoteID": "2773",
    "Body": "If they really have doubts in their minds about the life\\n\\t\\t\\t\\tafter death, they have only to tum their attention either\\n\\t\\t\\t\\tto their own nature, or to the nature around. How\\n\\t\\t\\t\\twonderful is their own physical growth, from lifeless\\n\\t\\t\\t\\tmatter, to seed, fertilised ovum, foetus, child youth,\\n\\t\\t\\t\\tage, and death! How can they doubt that the Author of all\\n\\t\\t\\t\\tthese wonderful stages in their life here can also give\\n\\t\\t\\t\\tthem another kind of life after the end of this life? Or,\\n\\t\\t\\t\\tif they look at external nature, they see the earth dead\\n\\t\\t\\t\\tand barren and Allah's fertilising showers bring it in to\\n\\t\\t\\t\\tlife, growth and beauty in various forms. The Creator of\\n\\t\\t\\t\\tthis great pageant of Beauty can surely create yet\\n\\t\\t\\t\\tanother and a newer world."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "5",
    "NoteID": "2774",
    "Body": "The stages of man's physical growth from nothing till he\\n\\t\\t\\t\\tcompletes the cycle of this life are described in words\\n\\t\\t\\t\\twhose accuracy, beauty, and comprehensiveness can only be\\n\\t\\t\\t\\tfully understood by biologists. Parallel to the physical\\n\\t\\t\\t\\tgrowth, may be understood man's inner growth, also by\\n\\t\\t\\t\\tstages and by Allah's creative artistry."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "5",
    "NoteID": "2775",
    "Body": "That is, a male or a female child, a fair or an ugly\\n\\t\\t\\t\\tchild, a good or a rebellious child, etc., involving\\n\\t\\t\\t\\tcountless mysteries of genetics and heredity."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "5",
    "NoteID": "2776",
    "Body": "Cf. xvi 70. In that passage the mystery of our life was\\n\\t\\t\\t\\tused to illustrate Allah's abundant mercies and favours\\n\\t\\t\\t\\tto us. Here it is used to illustrate Allah's power in\\n\\t\\t\\t\\tgiving us a future Life of even greater promise."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "5",
    "NoteID": "2777",
    "Body": "A beautiful nature passage so pregnant in meaning that\\n\\t\\t\\t\\tthe earnest student wonders what magic and truth have\\n\\t\\t\\t\\tbeen conveyed in so few words. M.P.'s Egyptian colleague\\n\\t\\t\\t\\tProf. Ghamrawi (see M.P.'s note on this passage) was but\\n\\t\\t\\t\\texpressing the feelings of every careful student of the\\n\\t\\t\\t\\tQur-an. The \"subtlety and wealth of meaning\" are indeed\\n\\t\\t\\t\\tmarvellous."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "6",
    "NoteID": "2778",
    "Body": "All these beautiful and well-articulated pageants of life\\n\\t\\t\\t\\tand nature point to the Reality behind them i.e., Allah.\\n\\t\\t\\t\\tThey will perish, but He is eternal."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "8",
    "NoteID": "2779",
    "Body": "For \"Book of Enlightenment\" see iii. 184 and n. 490. I\\n\\t\\t\\t\\tunderstand \"knowledge\" to mean here their human knowledge\\n\\t\\t\\t\\tor intelligence, \"guidance\" to mean divine guidance, such\\n\\t\\t\\t\\tas comes from Allah or prophets of Allah or a revelation\\n\\t\\t\\t\\tfrom Allah, and the \"Book of Enlightenment\" to mean the\\n\\t\\t\\t\\tfundamental guide to good conduct, the clear rules laid\\n\\t\\t\\t\\tdown in all Dispensations to help men to lead good lives.\\n\\t\\t\\t\\tThe \"Book of Enlightenment\" may mean a revealed Book in\\n\\t\\t\\t\\twhich case \"Guidance\" would refer to divine guidance\\n\\t\\t\\t\\tthrough a prophet of Allah."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "9",
    "NoteID": "2780",
    "Body": "Some Commentators think this refers to Abu Jahl, but the\\n\\t\\t\\t\\twords are perfectly general, and this type of man is\\n\\t\\t\\t\\tcommon in all ages. The same may be said about verse 3\\n\\t\\t\\t\\tabove: Commentators give the immediate reference to one\\n\\t\\t\\t\\tNadhar ibn Harith."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "10",
    "NoteID": "2781",
    "Body": "'What you suffer is the consequence of your own sinful\\n\\t\\t\\t\\tdeeds; Allah is just; He is not unjust in the least to\\n\\t\\t\\t\\tany of His creatures'."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "11",
    "NoteID": "2782",
    "Body": "They are men whose minds are not firm: they will have\\n\\t\\t\\t\\tfaith, if all goes well with them, but as soon as they\\n\\t\\t\\t\\tare tried, they are found wanting. They are a different\\n\\t\\t\\t\\tkind from hypocrites. It is not fraud or double dealing\\n\\t\\t\\t\\tthat is their sin: it is a weak mind, petty standards of\\n\\t\\t\\t\\tjudging right by success, a selfishness that gives\\n\\t\\t\\t\\tnothing but asks for all, a narrow-mindedness that does\\n\\t\\t\\t\\tnot go beyond petty mundane calculations-a \"nicely\\n\\t\\t\\t\\tcalculated less or more\" of the good things of this\\n\\t\\t\\t\\tworld. They fail in both worlds, and their failure in\\n\\t\\t\\t\\tthis world is patent for every on-looker."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "12",
    "NoteID": "2783",
    "Body": "To such minds religion does not mean high endeavour,\\n\\t\\t\\t\\tself-sacrifice for noble ends, the recognition of Allah's\\n\\t\\t\\t\\tinfinite world, but just a small concession to formalism,\\n\\t\\t\\t\\tperhaps a present to an idol (literal or figurative),\\n\\t\\t\\t\\tperhaps attendance at worship if it can be done without\\n\\t\\t\\t\\ttrouble! It is false gods they worship, and the more they\\n\\t\\t\\t\\tworship, the more they stray."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "13",
    "NoteID": "2784",
    "Body": "Such false worship is not always neutral, bringing\\n\\t\\t\\t\\tneither harm nor good. Perhaps the harm comes first, and\\n\\t\\t\\t\\tthere is no help from Allah. Such minds are themselves\\n\\t\\t\\t\\tdemoralised, and render themselves unfit for help!"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "14",
    "NoteID": "2785",
    "Body": "Allah is both true to His promise, and He has power to\\n\\t\\t\\t\\tgive full effect to His Will and Plan."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "15",
    "NoteID": "2786",
    "Body": "There is some difference of opinion as to the\\n\\t\\t\\t\\tinterpretation of this verse. Most Commentators are\\n\\t\\t\\t\\tagreed that the pronoun \"him\" in the second line (\"will\\n\\t\\t\\t\\tnot help him\") refers to the holy Prophet, and that the\\n\\t\\t\\t\\t\"any\" in the first line refers to his enemies, who wished\\n\\t\\t\\t\\tto see him destroyed and removed from the scene of his\\n\\t\\t\\t\\tlabours. Ibn 'Abbas, whom I have followed here, and whom\\n\\t\\t\\t\\ta great number of Commentators follow, construes the\\n\\t\\t\\t\\tlater clauses in the sense given in the text. Freely\\n\\t\\t\\t\\tparaphrased, it means: if the enemies of Allah's\\n\\t\\t\\t\\tMessenger are enraged at his successes, let them fix a\\n\\t\\t\\t\\trope to their ceiling and hang themselves. Samaa is thus\\n\\t\\t\\t\\trendered by the word \"ceiling\". If Samaa is rendered by\\n\\t\\t\\t\\tthe word \"heaven\" (the usual meaning), the paraphrase\\n\\t\\t\\t\\twould be : if the enemies of Allah's Messenger are\\n\\t\\t\\t\\tenraged at the help he gets from heavens, let them\\n\\t\\t\\t\\tstretch a rope to heavens, and see if they can cut off\\n\\t\\t\\t\\tthe help in that way!-in other words, they are fools if\\n\\t\\t\\t\\tthey think they can intercept Allah's help by their petty\\n\\t\\t\\t\\tdevices!"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "16",
    "NoteID": "2787",
    "Body": "Instead of plotting against Allah's Messenger, the\\n\\t\\t\\t\\tunbelievers should observe the Clear Signs which he has\\n\\t\\t\\t\\tbrought, and obey and follow the Guidance which comes\\n\\t\\t\\t\\tfrom Allah according to the Laws which He has fixed by\\n\\t\\t\\t\\tHis holy Will and Plan."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "17",
    "NoteID": "2788",
    "Body": "For Sabians, see n. 76 to ii. 62. They are also referred\\n\\t\\t\\t\\tto in v. 72. In both those passages the Muslims are\\n\\t\\t\\t\\tmentioned with the Jews, Christians, and Sabians, as\\n\\t\\t\\t\\treceiving Allah's protection and mercy. Here, besides the\\n\\t\\t\\t\\tfour religions, there is further mention of Magians and\\n\\t\\t\\t\\tPolytheists: it is not said that they would receive\\n\\t\\t\\t\\tAllah's Mercy, but only that Allah will judge between the\\n\\t\\t\\t\\tvarious forms of faith."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "17",
    "NoteID": "2789",
    "Body": "This is the only place where the Magians (Majas) are\\n\\t\\t\\t\\tmentioned in the Qur-an. 'Their cult is a very ancient\\n\\t\\t\\t\\tone. They consider Fire as the purest and noblest\\n\\t\\t\\t\\telement, and worship it as a fit emblem of Allah. Their\\n\\t\\t\\t\\tlocation was the Persian and Median uplands and the\\n\\t\\t\\t\\tMesopotamian valleys, their religion was reformed by\\n\\t\\t\\t\\tZardusht (date uncertain, about B.C. 600?). Their\\n\\t\\t\\t\\tscripture is the Zend-Avesta, the bible of the Parsis.\\n\\t\\t\\t\\tThey were \"the Wise men of the East\" mentioned in the\\n\\t\\t\\t\\tGospels."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "18",
    "NoteID": "2790",
    "Body": "Cf. xxi. 79, and n. 2733. All created things, animate and\\n\\t\\t\\t\\tinanimate, depend on Allah for their existence, and this\\n\\t\\t\\t\\tdependence can be construed as their Sajda or bowing down\\n\\t\\t\\t\\tin worship. Their very existence proclaims their\\n\\t\\t\\t\\tdependence. How can they be objects of worship? For haqqa\\n\\t\\t\\t\\tin this verse. Cf. xv. 64, n. 1990."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "18",
    "NoteID": "2791",
    "Body": "Cf. xxii, 16. There the argument was that those who work\\n\\t\\t\\t\\tin harmony with Allah's Law and Will will get their\\n\\t\\t\\t\\treward, for Allah always carries out His Plan. Here is\\n\\t\\t\\t\\tthe Parallel argument: those who defy Allah's Will must\\n\\t\\t\\t\\tsuffer pain and disgrace, for Allah is well able to carry\\n\\t\\t\\t\\tout His Will."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "19",
    "NoteID": "2792",
    "Body": "Two antagonists: i.e., parties of antagonists, viz., Men\\n\\t\\t\\t\\tof Faith, who confess their Lord and seek to carry out\\n\\t\\t\\t\\tHis Will, and Men who deny their Lord and defy His Will."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "20",
    "NoteID": "2793",
    "Body": "The punishment, will be all-pervading, not merely\\n\\t\\t\\t\\tsuperficial."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "21",
    "NoteID": "2794",
    "Body": "Read this with the next verse. There will be no escape\\n\\t\\t\\t\\tfrom the final Punishment adjudged after the time of\\n\\t\\t\\t\\trepentance is past."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "23",
    "NoteID": "2795",
    "Body": "In xxii. 14 above, was described the meed of the\\n\\t\\t\\t\\tRighteous as compared with the time-servers and those who\\n\\t\\t\\t\\tworshipped false gods (vv. 10-13): here we have the case\\n\\t\\t\\t\\tof those who were Persecuted, abused, prevented from\\n\\t\\t\\t\\tentering the Ka'ba and deprived of all that makes life\\n\\t\\t\\t\\tsmooth, agreeable, and comfortable. For them the meed is\\n\\t\\t\\t\\tdescribed in a way that negative these afflictions:\\n\\t\\t\\t\\tcostly adornments (as against being stripped of home and\\n\\t\\t\\t\\tproperty), purity of speech (as against the abuse they\\n\\t\\t\\t\\treceived), the Path of the Lord of Praise (as against the\\n\\t\\t\\t\\tfierce and malignant persecution to which they were\\n\\t\\t\\t\\tsubjected)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "25",
    "NoteID": "2796",
    "Body": "All these were enormities of which the Pagan clique in\\n\\t\\t\\t\\tpower in Makkah before and during the Hijrat were guilty."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "26",
    "NoteID": "2797",
    "Body": "The site of Makkah was granted to Abraham (and his son\\n\\t\\t\\t\\tIsmail) for a place of worship that was to be pure\\n\\t\\t\\t\\t(without idols, the worship being paid to Allah, the One\\n\\t\\t\\t\\tTrue God) and universal, without being reserved (like\\n\\t\\t\\t\\tSolomon's Temple of later times) to any one People or\\n\\t\\t\\t\\tRace."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "26",
    "NoteID": "2798",
    "Body": "Cf. ii. 125. Note that here the word qaimin ('who stand\\n\\t\\t\\t\\tup for prayer') occurs in place of 'akifin (who use it as\\n\\t\\t\\t\\ta retreat). In practice the meaning is the same. Those\\n\\t\\t\\t\\twho go for a retreat to the Ka'ba stay there for the time\\n\\t\\t\\t\\tbeing."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "27",
    "NoteID": "2799",
    "Body": "When the Pilgrimage was proclaimed, people came to it for\\n\\t\\t\\t\\tevery quarter, near and far, on foot and mounted. The\\n\\t\\t\\t\\t\"lean camel\" coming after a fatiguing journey through\\n\\t\\t\\t\\tdistant mountain roads typifies the difficulties of\\n\\t\\t\\t\\ttravel, which Pilgrims disregard on account of the\\n\\t\\t\\t\\ttemporal and spiritual benefits referred to in the next\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "28",
    "NoteID": "2800",
    "Body": "There are benefits both for this our material life and\\n\\t\\t\\t\\tfor our spiritual life. Of the former kind are those\\n\\t\\t\\t\\tassociated with social intercourse which furthers trade\\n\\t\\t\\t\\tand increases knowledge. Of the latter kind are the\\n\\t\\t\\t\\topportunities of realising some of our spiritual\\n\\t\\t\\t\\tyearnings in sacred associations that go back to the most\\n\\t\\t\\t\\tancient times. Of both kinds may be considered the\\n\\t\\t\\t\\topportunities which the Pilgrimage provides for\\n\\t\\t\\t\\tstrengthening our international Brotherhood."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "28",
    "NoteID": "2801",
    "Body": "The three special days of Hajj are the 8th, 9th, and 10th\\n\\t\\t\\t\\tof the month of Zul- hijjah, and the two or three\\n\\t\\t\\t\\tsubsequent days of Tashriq: see the rites explained in n.\\n\\t\\t\\t\\t217 to ii. 197. But we may ordinarily include the first\\n\\t\\t\\t\\tten days of Zul-hijjah in the term."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "28",
    "NoteID": "2802",
    "Body": "The great day of commemorative Sacrifice ('Id-ul-Adhha)\\n\\t\\t\\t\\tis the 10th of Zul- hijjah: the meat then killed is meant\\n\\t\\t\\t\\tto be eaten for food and distributed to the poor and\\n\\t\\t\\t\\tneedy."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "29",
    "NoteID": "2803",
    "Body": "Tafath-the superfluous growth on one's body, such as\\n\\t\\t\\t\\tnails, hair, etc., which it is not permitted to remove in\\n\\t\\t\\t\\tIhram. These may be removed on the 10th day, when the\\n\\t\\t\\t\\tHajj is completed: that is the rite of completion."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "29",
    "NoteID": "2804",
    "Body": "The Pilgrimage is completed by the performance of these\\n\\t\\t\\t\\trites. The Pilgrim should carry in mind the purification\\n\\t\\t\\t\\the gained in performing his pilgrimage. Then comes the\\n\\t\\t\\t\\tfinal Tawaf."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "30",
    "NoteID": "2805",
    "Body": "The general food prohibitions will be found in ii. 173,\\n\\t\\t\\t\\tv. 4-5, and vi. 121, 138- 146. They are meant for health\\n\\t\\t\\t\\tand cleanliness, but the worst abominations to shun are\\n\\t\\t\\t\\tthose of false worship and false speech. Here the\\n\\t\\t\\t\\tquestion is about food during Pilgrimage. Lawful meat but\\n\\t\\t\\t\\tnot game is allowed."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "31",
    "NoteID": "2806",
    "Body": "A parable full of meaning. The man who falls from the\\n\\t\\t\\t\\tworship of Allah, The One True God, is like a man who\\n\\t\\t\\t\\tfalls from heaven, His being taken up with false objects\\n\\t\\t\\t\\tof worship is like the failing man being picked up in the\\n\\t\\t\\t\\tair by birds of prey. But the false objects of worship\\n\\t\\t\\t\\tcannot hold him permanently in their grip. A fierce blast\\n\\t\\t\\t\\tof wind-the Wrath of Allah-comes and snatches him away\\n\\t\\t\\t\\tand throws him into a place far, far away from any place\\n\\t\\t\\t\\the could have imagined-into the hell of those who defied\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "32",
    "NoteID": "2807",
    "Body": "Sha'air, symbols, signs, marks by which something is\\n\\t\\t\\t\\tknown to belong to some particular body of men, such as\\n\\t\\t\\t\\tflags. In ii. 158 the word was applied to Safa and Marwa:\\n\\t\\t\\t\\tsee n. 160 there. Here it seems to be applied to the\\n\\t\\t\\t\\trites of sacrifice. Such sacrifice is symbolical: it\\n\\t\\t\\t\\tshould betoken dedication and piety of heart. See below,\\n\\t\\t\\t\\txxii. 37."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "33",
    "NoteID": "2808",
    "Body": "In them: in cattle, or animals offered for sacrifice. It\\n\\t\\t\\t\\tis quite true that they are useful in many ways to man,\\n\\t\\t\\t\\te.g., camels in desert countries are useful as mounts or\\n\\t\\t\\t\\tfor carrying burdens, or for giving milk, and so for\\n\\t\\t\\t\\thorses and oxen: and camels and oxen are also good for\\n\\t\\t\\t\\tmeat, and camel's hair can be woven into cloth; goats and\\n\\t\\t\\t\\tsheep also yield milk and meat, and hair or wool. But if\\n\\t\\t\\t\\tthey are used for sacrifice, they become symbols by which\\n\\t\\t\\t\\tmen show that they are willing to give up some of their\\n\\t\\t\\t\\town benefits for the sake of satisfying the needs of\\n\\t\\t\\t\\ttheir poorer brethren."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "33",
    "NoteID": "2809",
    "Body": "Ila=towards, near. The actual sacrifice is not performed\\n\\t\\t\\t\\tin the Ka'ba, but at Mina, five or six miles off, where\\n\\t\\t\\t\\tthe Pilgrims encamp: see n. 217 to ii 197. Thumma = then,\\n\\t\\t\\t\\tfinally, in the end; i.e., after all the rites have been\\n\\t\\t\\t\\tperformed, Tawaf, Safa and Marwa, and 'Arafat."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "34",
    "NoteID": "2810",
    "Body": "This is the true end of sacrifice, not propitiation of\\n\\t\\t\\t\\thigher powers, for Allah is One, and He does not delight\\n\\t\\t\\t\\tin flesh or blood (xxii. 37), but a symbol of\\n\\t\\t\\t\\tthanksgiving to Allah by sharing meat with fellow-men.\\n\\t\\t\\t\\tThe solemn pronouncement of Allah's name over the\\n\\t\\t\\t\\tsacrifice is an essential part of the rite."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "34",
    "NoteID": "2811",
    "Body": "The good news: i.e. the Message of Allah, that He will\\n\\t\\t\\t\\taccept in us the sacrifice of self for the benefit of our\\n\\t\\t\\t\\tfellow-men."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "35",
    "NoteID": "2812",
    "Body": "Some qualities of Allah's devotees are mentioned here, in\\n\\t\\t\\t\\tascending order: (1) Humility before Allah makes them\\n\\t\\t\\t\\treceptive, and prepares them to listen to Allah's\\n\\t\\t\\t\\tMessage; (2) fear of Allah, which is akin to love,\\n\\t\\t\\t\\ttouches their heart, and penetrates through their inmost\\n\\t\\t\\t\\tbeing; (3) they are not afraid of anything in mortal\\n\\t\\t\\t\\tlife; they take their trials patiently, and they go on in\\n\\t\\t\\t\\ta course of righteousness with constancy; (4) their\\n\\t\\t\\t\\tprayer now is not a matter of form, but a real communion\\n\\t\\t\\t\\twith Allah, with a sense of confidence such as a faithful\\n\\t\\t\\t\\tservant feels in the presence of a kind and loving\\n\\t\\t\\t\\tmaster; and (5) gratitude to Allah, as shown by practical\\n\\t\\t\\t\\tacts of charity to all fellow-creatures."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "36",
    "NoteID": "2813",
    "Body": "See n. 2808 to xxii. 33 above. What was expressed in\\n\\t\\t\\t\\tgeneral terms is applied here more particularly to\\n\\t\\t\\t\\tcamels, the most precious and useful animals of Arabia,\\n\\t\\t\\t\\twhose mode of slaughter for sacrifice is different from\\n\\t\\t\\t\\tthat of smaller animals: the special word for such\\n\\t\\t\\t\\tsacrifice is Nahr (cviii.2)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "36",
    "NoteID": "2814",
    "Body": "There are ethics in begging, as in charity. No approval\\n\\t\\t\\t\\tis given to arrogant and insolent begging, though the\\n\\t\\t\\t\\trelief of distress of all kinds, deserved and undeserved,\\n\\t\\t\\t\\tis included in charity. But those who beg with humility\\n\\t\\t\\t\\tand those who receive gifts with gratitude and\\n\\t\\t\\t\\tcontentment are both mentioned for special attention.\\n\\t\\t\\t\\tCharity should not be given for show, or to get rid of\\n\\t\\t\\t\\timportunate demands. It should find out real needs and\\n\\t\\t\\t\\tmeet them."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "37",
    "NoteID": "2815",
    "Body": "The essence of sacrifice has been explained in n. 2810.\\n\\t\\t\\t\\tNo one should suppose that meat or blood is acceptable to\\n\\t\\t\\t\\tthe One True God. It was a Pagan fancy that Allah could\\n\\t\\t\\t\\tbe appeased by blood sacrifice. But Allah does accept the\\n\\t\\t\\t\\toffering of our hearts, and as a symbol of such offer,\\n\\t\\t\\t\\tsome visible institution is necessary. He has given us\\n\\t\\t\\t\\tpower over the brute creation, and permitted us to eat\\n\\t\\t\\t\\tmeat, but only if we pronounce His name at the solemn act\\n\\t\\t\\t\\tof taking life, for without this solemn invocation, we\\n\\t\\t\\t\\tare apt to forget the sacredness of fife. By the\\n\\t\\t\\t\\tinvocation we are reminded that wanton cruelty is not in\\n\\t\\t\\t\\tour thoughts, but only the need of food. Now if we\\n\\t\\t\\t\\tfurther deny the greater part of the food (some\\n\\t\\t\\t\\ttheologians fix the proportion at three-quarters or\\n\\t\\t\\t\\ttwo-thirds) for the sake of our poorer brethren in solemn\\n\\t\\t\\t\\tassembly in the precincts of the Haram (sacred\\n\\t\\t\\t\\tterritory), our symbolic act finds practical expression\\n\\t\\t\\t\\tin benevolence, and that is the virtue sought to be\\n\\t\\t\\t\\ttaught. We should be grateful to Allah for His guidance\\n\\t\\t\\t\\tin this matter, in which many Peoples have gone wrong,\\n\\t\\t\\t\\tand we should proclaim the true doctrine so that virtue\\n\\t\\t\\t\\tand charity may increase among men."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "39",
    "NoteID": "2816",
    "Body": "Several translators have failed to notice that yuqataluna\\n\\t\\t\\t\\t(in the best-approved texts) is in the passive voice,\\n\\t\\t\\t\\t\"against whom war is made\",-not \"who take arms against\\n\\t\\t\\t\\tthe unbelievers\" as Sale translates it. The clause \"and\\n\\t\\t\\t\\tverily...their aid\" is parenthetical. Verse 40 connects\\n\\t\\t\\t\\ton with \"they are wronged\". The wrong is indicated:\\n\\t\\t\\t\\t'driven by persecution from their home, for no other\\n\\t\\t\\t\\treason than that they worshipped the One True God'. This\\n\\t\\t\\t\\twas the first occasion on which fighting-in\\n\\t\\t\\t\\tself-defence-was permitted. This passage therefore\\n\\t\\t\\t\\tundoubtedly dates from Madinah."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "40",
    "NoteID": "2817",
    "Body": "To allow a righteous people to fight against a ferocious\\n\\t\\t\\t\\tand mischief-loving people was fully justified. But the\\n\\t\\t\\t\\tjustification was far greater here, when the little\\n\\t\\t\\t\\tMuslim community was not only fighting for its own\\n\\t\\t\\t\\texistence against the Makkan Quraish, but for the very\\n\\t\\t\\t\\texistence of the Faith in the One True God. They had as\\n\\t\\t\\t\\tmuch right to be in Makkah and worship in the Ka'ba as\\n\\t\\t\\t\\tthe other Quraish; yet they were exiled for their Faith.\\n\\t\\t\\t\\tIt affected not the faith of one peculiar people. The\\n\\t\\t\\t\\tprinciple involved was that of all worship, Jewish or\\n\\t\\t\\t\\tChristian as well as Muslim, and of all foundations built\\n\\t\\t\\t\\tfor pious uses."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "40",
    "NoteID": "2818",
    "Body": "'Aziz means Exalted in power, rank, dignity;\\n\\t\\t\\t\\tIncomparable; Full of might and majesty; Able to enforce\\n\\t\\t\\t\\tHis Will. The last signification is the one that\\n\\t\\t\\t\\tpredominates here."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "41",
    "NoteID": "2819",
    "Body": "\"Enjoining the right and forbidding the wrong\" is an\\n\\t\\t\\t\\tessential duty of the Muslim Ummah and one of the main\\n\\t\\t\\t\\tpurposes for which it has been raised. (See iii. 104,\\n\\t\\t\\t\\t110; ix. 71, 111-112, xxii, 41)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "42",
    "NoteID": "2820",
    "Body": "It is nothing new if the Prophet of Allah is accused of\\n\\t\\t\\t\\timposture. This was done in all ages; e.g., Noah (vii.\\n\\t\\t\\t\\t64); Hud the prophet of the 'Ad people (vii. 66); Salih\\n\\t\\t\\t\\tthe prophet of the Thamud (vii. 76); Abraham (xxi. 55);\\n\\t\\t\\t\\tLut (vii. 82); Shu'aib the prophet of the Madyan people\\n\\t\\t\\t\\t(vii. 85) and also of the Companions of the Wood (xv.\\n\\t\\t\\t\\t78). The case of Moses is mentioned apart, as his people\\n\\t\\t\\t\\tsurvived to the time of our Prophet and survive to the\\n\\t\\t\\t\\tpresent, and they frequently rebelled against Moses (ii.\\n\\t\\t\\t\\t49-61)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "44",
    "NoteID": "2821",
    "Body": "Were they the same as the Companions of the Wood? See n.\\n\\t\\t\\t\\t2000 to xv. 78."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "44",
    "NoteID": "2822",
    "Body": "My Wrath on them, and the complete reversal of their\\n\\t\\t\\t\\tfortune in consequence."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "45",
    "NoteID": "2823",
    "Body": "The roofs fell in first, and the whole structure, walls\\n\\t\\t\\t\\tand all, came tumbling after, as happens in ruins. The\\n\\t\\t\\t\\tplace was turned upside down."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "45",
    "NoteID": "2824",
    "Body": "In a dry country like Arabia, a well stands as a symbol\\n\\t\\t\\t\\tfor a living, flourishing population, and many\\n\\t\\t\\t\\tplace-names mean \"the well of so-and-so\" e.g., Bir 'Ali,\\n\\t\\t\\t\\ta village just south of Madinah the quality of whose\\n\\t\\t\\t\\tdrinking water is famous, or Abyar Ibn Hassan, a noted\\n\\t\\t\\t\\tstopping place on the road from Makkah to Madinah about\\n\\t\\t\\t\\t92 miles from Madinah."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "46",
    "NoteID": "2825",
    "Body": "The word for \"heart\" in Arabic speech imports both the\\n\\t\\t\\t\\tseat of intelligent faculties and understanding as well\\n\\t\\t\\t\\tas the seat of affections and emotions. Those who reject\\n\\t\\t\\t\\tAllah's Message may have their physical eyes and ears,\\n\\t\\t\\t\\tbut their hearts are blind and deaf. If their faculties\\n\\t\\t\\t\\tof understanding were active, would they not see the\\n\\t\\t\\t\\tSigns of Allah's Providence and Allah's Wrath in nature\\n\\t\\t\\t\\taround them and in the cities and ruins if they travel\\n\\t\\t\\t\\tintelligently?"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "47",
    "NoteID": "2826",
    "Body": "If Allah gives respite, those to whom it is given have a\\n\\t\\t\\t\\treal chance of repentance and amendment. He will not\\n\\t\\t\\t\\tcurtail His promise of respite. But on the other hand He\\n\\t\\t\\t\\thas promised to call everyone to account for his deeds,\\n\\t\\t\\t\\tand this involves justice and punishment for sin. This\\n\\t\\t\\t\\tpromise will also come true. It is foolish to try to\\n\\t\\t\\t\\thasten it. Time with Him is nothing. We keep count of\\n\\t\\t\\t\\ttime for our relative calculations. His existence is\\n\\t\\t\\t\\tabsolute, and not conditioned by Time or Place. What we\\n\\t\\t\\t\\tcall a thousand years may be nothing more than a day or a\\n\\t\\t\\t\\tminute to Him."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "48",
    "NoteID": "2827",
    "Body": "The argument begun in xxii. 45 is now rounded off and\\n\\t\\t\\t\\tclosed."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "49",
    "NoteID": "2828",
    "Body": "It is the Messenger's duty to convey the warning in the\\n\\t\\t\\t\\tclearest terms to the wicked. It is no part of his duty\\n\\t\\t\\t\\tto coerce them or judge them, or bring on the Punishment\\n\\t\\t\\t\\tfor them. That only rests with Allah. But the warning\\n\\t\\t\\t\\titself is full of Mercy: for it gives the highest hope to\\n\\t\\t\\t\\tthe repentant sinner who turns and comes to Allah."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "50",
    "NoteID": "2829",
    "Body": "The \"sustenance\" must be construed in the widest sense,\\n\\t\\t\\t\\tspiritual as well as intellectual and physical. The\\n\\t\\t\\t\\treward of righteousness is far more generous than any\\n\\t\\t\\t\\tmerit there may be in the creature following the Will of\\n\\t\\t\\t\\this Creator."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "51",
    "NoteID": "2830",
    "Body": "It will not be in their power to frustrate Allah's Plan;\\n\\t\\t\\t\\tall they will do is to go further and further down in\\n\\t\\t\\t\\ttheir spiritual state, deeper and deeper in their Hell."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "52",
    "NoteID": "2831",
    "Body": "Prophets and messengers (the distinction is explained in\\n\\t\\t\\t\\tn. 2503 to xix. 51) are but human. Their actions are\\n\\t\\t\\t\\trighteous and their motives pure. But in judging things\\n\\t\\t\\t\\tfrom a human point of view, the suggestion may come to\\n\\t\\t\\t\\ttheir mind (from Satan) that it would be good to have\\n\\t\\t\\t\\tpower or wealth or influence for furthering Allah's\\n\\t\\t\\t\\tcause, or that it may be good to conciliate some faction\\n\\t\\t\\t\\twhich may be irreconcilable. In fact, in Allah's Plan, it\\n\\t\\t\\t\\tmay be the opposite. Allah, in His mercy and inspiration,\\n\\t\\t\\t\\twill cancel any false or vain suggestions of this kind,\\n\\t\\t\\t\\tand confirm and strengthen His own Commands and make\\n\\t\\t\\t\\tknown His Will in His Signs or revelations."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "52",
    "NoteID": "2832",
    "Body": "This clause and the similar clause at the end of the next\\n\\t\\t\\t\\tverse are parenthetical."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "53",
    "NoteID": "2833",
    "Body": "If any suggestion comes to the human mind that is not in\\n\\t\\t\\t\\taccordance with Allah's Will and Plan, it has two\\n\\t\\t\\t\\topposite effects: to evil minds it is a trial and\\n\\t\\t\\t\\ttemptation from the satan but to the mind well-instructed\\n\\t\\t\\t\\tin Faith, it stands self-condemned at once, and becomes a\\n\\t\\t\\t\\tmeans of strengthening the Faith and stimulating\\n\\t\\t\\t\\tredoubled efforts to conform to the Will of Allah."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "53",
    "NoteID": "2834",
    "Body": "Cf. ii. 10. I understand the \"disease in the heart\" to be\\n\\t\\t\\t\\tan earlier state of curse, which leads in an intensified\\n\\t\\t\\t\\tform to a complete \"hardening of the heart\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "54",
    "NoteID": "2835",
    "Body": "The last clause in the last verse was parenthetical.\\n\\t\\t\\t\\tTreat this clause as parallel with the first clause in\\n\\t\\t\\t\\tverse 53, \"that he may make\", etc. Both will then connect\\n\\t\\t\\t\\twith \"Allah will confirm (and establish) His Signs\" in\\n\\t\\t\\t\\tverse 52. See n. 2833 above."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "55",
    "NoteID": "2836",
    "Body": "The penalty of deliberately rejecting Faith is that the\\n\\t\\t\\t\\tperson doing so closes the channels of Mercy that flow\\n\\t\\t\\t\\tfrom Allah. He will always be subject to doubts and\\n\\t\\t\\t\\tsuperstitions, until the time comes when all earthly\\n\\t\\t\\t\\tscales fall from his spiritual eyes. But then there will\\n\\t\\t\\t\\tbe no time for Repentance: it will be too late to profit\\n\\t\\t\\t\\tby the guidance of Allah given through Revelation."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "56",
    "NoteID": "2837",
    "Body": "Such power as Evil has over those who yield to it (xvii.\\n\\t\\t\\t\\t62-64) will then be gone, as the respite granted to Satan\\n\\t\\t\\t\\tbe over, and Allah's Kingdom will be established."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "58",
    "NoteID": "2838",
    "Body": "Rizq: sustenance, provision. I have preferred the latter\\n\\t\\t\\t\\tword here, because after death we can only think of rizq\\n\\t\\t\\t\\tin a large metaphorical sense. i.e., all the provision\\n\\t\\t\\t\\tnecessary to equip the person for a full and happy Future\\n\\t\\t\\t\\tLife, and also, I think, a provision for his dependents\\n\\t\\t\\t\\tand near and dear ones in this life."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "59",
    "NoteID": "2839",
    "Body": "Martyrdom is the sacrifice of life in the service of\\n\\t\\t\\t\\tAllah. Its reward is therefore even greater than that of\\n\\t\\t\\t\\tan ordinarily good life. The martyr's sins are forgiven\\n\\t\\t\\t\\tby the very act of martyrdom, which implies service and\\n\\t\\t\\t\\tself-surrender in the highest sense of the word. Allah\\n\\t\\t\\t\\tknows all his past life but will forbear from calling him\\n\\t\\t\\t\\tto account for things that should strictly come into his\\n\\t\\t\\t\\taccount."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "60",
    "NoteID": "2840",
    "Body": "Ordinarily Muslims are enjoined to bear injuries with\\n\\t\\t\\t\\tpatience and return good for evil (xxiii. 96). But there\\n\\t\\t\\t\\tare occasions when human feelings get the better of our\\n\\t\\t\\t\\twise resolutions, or when, in a state of conflict or war,\\n\\t\\t\\t\\twe return \"as good as we get\". In that case our\\n\\t\\t\\t\\tretaliation is permissible, provided the injury we\\n\\t\\t\\t\\tinflict is not greater than that we receive. After such\\n\\t\\t\\t\\tretaliation we are even, but if the other side again acts\\n\\t\\t\\t\\taggressively and goes beyond all bounds in attacking us,\\n\\t\\t\\t\\twe are entitied to protection from Allah in spite of all\\n\\t\\t\\t\\tour faults; for Allah is One that blots out our sins, and\\n\\t\\t\\t\\tforgives again and again."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "61",
    "NoteID": "2841",
    "Body": "To some it may appear strange or even irreconcilable that\\n\\t\\t\\t\\tAllah should be both Merciful and Just; that He should\\n\\t\\t\\t\\tboth protect His devotees and yet ask for their\\n\\t\\t\\t\\tself-sacrifice-that he should command them to return good\\n\\t\\t\\t\\tfor evil, and yet permit retaliation under certain\\n\\t\\t\\t\\trestrictions. But such thoughts are short-sighted. Do\\n\\t\\t\\t\\tthey not see many inconsistencies in all Life, all\\n\\t\\t\\t\\tNature, and all Creation? Why, even in such simple\\n\\t\\t\\t\\tphenomena as Night and Day, the one merges into the\\n\\t\\t\\t\\tother, and no one can tell when precisely the one begins\\n\\t\\t\\t\\tand the other ends. Yet we can see in a rough sort of way\\n\\t\\t\\t\\tthat the one gives rest and the other activity, that the\\n\\t\\t\\t\\tone reveals the beauties of the starry heavens and the\\n\\t\\t\\t\\tother the splendour of the sun. In countless ways we can\\n\\t\\t\\t\\tsee there the wisdom and the fine artistry of Allah. And\\n\\t\\t\\t\\tthere are subtle nuances and mergings in nature that our\\n\\t\\t\\t\\tintelligence can hardly penetrate. Now human life and\\n\\t\\t\\t\\thuman relations are far more complicated, and it is Allah\\n\\t\\t\\t\\talone Who can see all the subtle distinctions and hear\\n\\t\\t\\t\\tthe cries of all His creatures, in a world which Tennyson\\n\\t\\t\\t\\tdescribed as \"red in tooth and claw\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "62",
    "NoteID": "2842",
    "Body": "The emphatic construction calls attention to the fact\\n\\t\\t\\t\\tthat Allah is the only abiding Reality. All else is like\\n\\t\\t\\t\\tshadows that will pass away."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "62",
    "NoteID": "2843",
    "Body": "See n. 2841 above. Our vain imaginings, groundless\\n\\t\\t\\t\\tdoubts, foolish subtleties, and false worship should all\\n\\t\\t\\t\\tgive place to trust and faith in the one and only\\n\\t\\t\\t\\tReality."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "63",
    "NoteID": "2844",
    "Body": "Latif, as a name of Allah, is as difficult to define in\\n\\t\\t\\t\\twords as the idea it seeks to represent is difficult to\\n\\t\\t\\t\\tgrasp in our minds. It implies: (1) fine, subtle (the\\n\\t\\t\\t\\tbasic meaning); (2) so fine and subtle as to be\\n\\t\\t\\t\\timperceptible to human sight; (3) so pure as to be\\n\\t\\t\\t\\tincomprehensible; (4) with sight so perfect as to see and\\n\\t\\t\\t\\tunderstand the finest subtleties and mysteries; (5) so\\n\\t\\t\\t\\tkind and gracious as to bestow gifts of the most refined\\n\\t\\t\\t\\tkind; extraordinarily gracious and understanding. No. 4\\n\\t\\t\\t\\tis the predominant meaning here and in xii. 100; Nos. 2\\n\\t\\t\\t\\tand 3 in vi. 103; and No.5 in xlii. 19; but every shade\\n\\t\\t\\t\\tof meaning must be borne in mind in each case, as a\\n\\t\\t\\t\\tsubsidiary factor in the spiritual melody."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "64",
    "NoteID": "2845",
    "Body": "Each of the verses xxii. 61-63 mentioned two attributes\\n\\t\\t\\t\\tof Allah with reference to the contents of that verse.\\n\\t\\t\\t\\tThis verse now sums up the whole argument, and the two\\n\\t\\t\\t\\tattributes with which it closes sum up the idea by which\\n\\t\\t\\t\\twe can understand Allah's goodness. Allah's loving\\n\\t\\t\\t\\tkindness and mercies are not like those of human\\n\\t\\t\\t\\tcreatures who all depend upon one another, and often\\n\\t\\t\\t\\texpect some kindness or recognition in return. Allah is\\n\\t\\t\\t\\tabove all wants and depends in no way whatever on His\\n\\t\\t\\t\\tcreatures. His mercies have therefore a special quality,\\n\\t\\t\\t\\twhich we cannot describe except by gratefully singing the\\n\\t\\t\\t\\tpraises of Allah. Cf. ii. 267."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "65",
    "NoteID": "2846",
    "Body": "Land and sea have been made subject to man by Allah's\\n\\t\\t\\t\\tcommand, so that man can develop his life freely on\\n\\t\\t\\t\\tearth."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "65",
    "NoteID": "2847",
    "Body": "Samaa means (1) something high, (2) a roof, a ceiling,\\n\\t\\t\\t\\t(3) the sky, the canopy of heaven. (4) cloud or rain. I\\n\\t\\t\\t\\tunderstand the last meaning here, though most authorities\\n\\t\\t\\t\\tseem to render it by some such words as \"sky\". If we\\n\\t\\t\\t\\tunderstand rain here, we have a complete picture of the\\n\\t\\t\\t\\tthree elements in which man lives-land, air and sea. Rain\\n\\t\\t\\t\\tis also appropriate for mention with Allah's kindness and\\n\\t\\t\\t\\tmercy. He regulates the rain for man's benefit."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "67",
    "NoteID": "2848",
    "Body": "Rites and ceremonies may appear to be an unimportant\\n\\t\\t\\t\\tmatter compared with \"weightier matters of the Law\" and\\n\\t\\t\\t\\twith the higher needs of man's spiritual nature. But they\\n\\t\\t\\t\\tare necessary for social and religious organisation, and\\n\\t\\t\\t\\ttheir effect on the individual himself is not to be\\n\\t\\t\\t\\tdespised. In any case, as they are visible external\\n\\t\\t\\t\\tsymbols, they give rise to the most heated controversies.\\n\\t\\t\\t\\tSuch controversies are to be deprecated. That does not\\n\\t\\t\\t\\tmean that our rites and ceremonies are to be made light\\n\\t\\t\\t\\tof. Those in Islam rest on the highest social and\\n\\t\\t\\t\\treligious needs of man, and if we are convinced that we\\n\\t\\t\\t\\tare on the Right Way, we should invite all to join us,\\n\\t\\t\\t\\twithout entering into controversies about such matters."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "68",
    "NoteID": "2849",
    "Body": "'You are only wrangling about matters about which you\\n\\t\\t\\t\\thave no knowledge nor any deep religious feeling. The\\n\\t\\t\\t\\tsprings of your conduct are all open before Allah, and He\\n\\t\\t\\t\\twill judge you.'"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "69",
    "NoteID": "2850",
    "Body": "'You not only find fault with the very few and simple\\n\\t\\t\\t\\trites and ceremonies in Islam: you, outside Islam, have\\n\\t\\t\\t\\tno rites and ceremonies which you are yourselves agreed\\n\\t\\t\\t\\tupon, either as Christians or as Jews, or one compared\\n\\t\\t\\t\\twith the other.'"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "70",
    "NoteID": "2851",
    "Body": "We human beings can only think of knowledge being\\n\\t\\t\\t\\taccurately and permanently preserved by means of a\\n\\t\\t\\t\\trecord. Allah's knowledge has all the qualities of a\\n\\t\\t\\t\\tperfect record, and it is moreover complete and\\n\\t\\t\\t\\tcomprehensive. This is not difficult for Him from whom\\n\\t\\t\\t\\tflow all knowledge and intelligence."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "71",
    "NoteID": "2852",
    "Body": "When plain common-sense shows the absurdity of false\\n\\t\\t\\t\\tworship, behind which there is neither knowledge,\\n\\t\\t\\t\\tintelligence, nor authority (quite the contrary), who or\\n\\t\\t\\t\\twhat can help the false misguided creatures who dishonour\\n\\t\\t\\t\\tAllah by false worship?"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "72",
    "NoteID": "2853",
    "Body": "Munkar; (1) a refusal to accept something offered; (2) a\\n\\t\\t\\t\\tdenial of something stated or pointed out; (3) a feeling\\n\\t\\t\\t\\tof disapproval or active aversion, or disgust."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "72",
    "NoteID": "2854",
    "Body": "There is irony here. 'You think Allah's revelations and\\n\\t\\t\\t\\tSigns are distasteful to you! There will be something far\\n\\t\\t\\t\\tmore distasteful to you if you do not repent! What do you\\n\\t\\t\\t\\tsay to the inevitable Punishment."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "73",
    "NoteID": "2855",
    "Body": "Both idols and their worshippers are poor, foolish,\\n\\t\\t\\t\\tfeeble creatures!"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "74",
    "NoteID": "2856",
    "Body": "No one can have a true idea of Allah, who descends to the\\n\\t\\t\\t\\tbase forms of false worship. Allah has all power, and He\\n\\t\\t\\t\\tis fully able to carry out every part of His Will and\\n\\t\\t\\t\\tPlan. He is exalted above all in power and dignity. Cf.\\n\\t\\t\\t\\txxii. 40 and n. 2818 for the full meaning of 'Aziz."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "75",
    "NoteID": "2857",
    "Body": "Men are chosen as Messengers to ordinary men; for\\n\\t\\t\\t\\tordinary men will not be able to understand and be in\\n\\t\\t\\t\\tcommunion with beings so refined as angels. But angels\\n\\t\\t\\t\\tare sent as Messengers to Allah's chosen prophets, to\\n\\t\\t\\t\\tconvey the Message from time to time. In either case they\\n\\t\\t\\t\\tare chosen by Allah, are subject to Allah's Will, and\\n\\t\\t\\t\\tshould not be worshipped as gods."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "75",
    "NoteID": "2858",
    "Body": "As Allah regards the humblest of His creatures and hears\\n\\t\\t\\t\\ttheir prayer, He sends men messengers out of their own\\n\\t\\t\\t\\tbrethren (see last note), and to such messengers He\\n\\t\\t\\t\\tcommunicates the highest spiritual Truths through His\\n\\t\\t\\t\\tangels."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "76",
    "NoteID": "2859",
    "Body": "Time, before or behind, may be of some importance to men.\\n\\t\\t\\t\\tThey may dispute as to what was the first Message, and\\n\\t\\t\\t\\twhat is the last Message. To Allah, this question of\\n\\t\\t\\t\\tpriority and posteriority is of no consequence. All\\n\\t\\t\\t\\tquestions go back ultimately to Him and are judged on\\n\\t\\t\\t\\ttheir merits."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "77",
    "NoteID": "2860",
    "Body": "Prosper: in a spiritual sense, both in this life and the\\n\\t\\t\\t\\tHereafter."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "78",
    "NoteID": "2861",
    "Body": "As far as the striving is concerned with Jihad in the\\n\\t\\t\\t\\tnarrow sense, see the limitations in n. 204 to ii. 190\\n\\t\\t\\t\\tand n. 205 to ii. 191. But the words are perfectly\\n\\t\\t\\t\\tgeneral and apply to all true and unselfish striving for\\n\\t\\t\\t\\tspiritual good."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "78",
    "NoteID": "2862",
    "Body": "The Jews were hampered by many restrictions, and their\\n\\t\\t\\t\\treligion was racial. Christianity, as originally\\n\\t\\t\\t\\tpreached, was a hermit religion: \"sell whatsoever thou\\n\\t\\t\\t\\thast\" (Mark x. 21); \"take no thought for the morrow\"\\n\\t\\t\\t\\t(Matt. vi. 34). Islam, as originally preached, gives\\n\\t\\t\\t\\tfreedom and full play to man's faculties of every kind.\\n\\t\\t\\t\\tIt is universal, and claims to date from Adam: father\\n\\t\\t\\t\\tAbraham is mentioned as the great Ancestor of those among\\n\\t\\t\\t\\twhom Islam was first preached (Jews, Christians, and\\n\\t\\t\\t\\tArabs)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "78",
    "NoteID": "2863",
    "Body": "Before: see Abraham's prayer in ii. 128. In this\\n\\t\\t\\t\\trevelation: in this very verse, as well as in other\\n\\t\\t\\t\\tplaces."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "78",
    "NoteID": "2864",
    "Body": "See ii. 143, and notes 143 and 144. As the Prophet is a\\n\\t\\t\\t\\tguide and exemplar among us, so Muslims ought to be\\n\\t\\t\\t\\texemplars amongst mankind. The best witness to Allah's\\n\\t\\t\\t\\tTruth are those who show its light in their lives."
  }
]
