[
  {
    "SurahNumber": "71",
    "AyahNumber": "4",
    "NoteID": "1",
    "Body": "Namely until the end of each person's life - implying\\n\\t\\t\\t\\tthat although they might be forgiven all sins committed\\n\\t\\t\\t\\tbefore their postulated change of heart, they would\\n\\t\\t\\t\\thenceforth, until their death, be held fully accountable\\n\\t\\t\\t\\tfor their behaviour in the light of that new-found faith.\\n\\t\\t\\t\\tCf.  4:18  - \"repentance shall not be accepted from those\\n\\t\\t\\t\\twho do evil deeds until their dying hour and then say,\\n\\t\\t\\t\\t'Behold, I now repent'\"."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "6",
    "NoteID": "2",
    "Body": "Lit., \"has not increased them in anything but flight\"."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "7",
    "NoteID": "3",
    "Body": "For the reason of the above interpolation - which endows\\n\\t\\t\\t\\tthe concept of \"garments\" with a metaphorical meaning -\\n\\t\\t\\t\\tsee note [2] on  74:4 ; cf. also the expression \"garment\\n\\t\\t\\t\\tof God-consciousness\" (libas at-taqwa) in  7:26 ."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "11",
    "NoteID": "4",
    "Body": "Lit.,\"He will let loose the sky over you with abundance\"\\n\\t\\t\\t\\t(but see also note [76] on {ll:52})."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "12",
    "NoteID": "5",
    "Body": "The two last-mentioned blessings are an allusion to the\\n\\t\\t\\t\\tstate of happiness in the hereafter, symbolised in the\\n\\t\\t\\t\\tQur'an as \"gardens through which running waters flow\"."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "13",
    "NoteID": "6",
    "Body": "I.e., \"that you refuse to believe in God\" (Zamakhshari).\\n\\t\\t\\t\\tSome authorities (e.g., Jawhari) give to the above phrase\\n\\t\\t\\t\\tthe meaning, \"that you will not fear God's majesty\",\\n\\t\\t\\t\\twhich, too, implies lack of belief in Him."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "14",
    "NoteID": "7",
    "Body": "I.e., by a process of gradual evolution, in the mother's\\n\\t\\t\\t\\twomb, from a drop of sperm and a fertilised germ-cell\\n\\t\\t\\t\\t(the female ovum), up to the point where the embryo\\n\\t\\t\\t\\tbecomes a new, self-contained human entity (cf. 22:5):\\n\\t\\t\\t\\tall of which points to the existence of a plan and a\\n\\t\\t\\t\\tpurpose and, hence, to the existence of a conscious\\n\\t\\t\\t\\tCreator."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "15",
    "NoteID": "8",
    "Body": "Cf. 67:3  and the corresponding note [2]."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "16",
    "NoteID": "9",
    "Body": "See  10:5 , where the sun is described as \"a [source of]\\n\\t\\t\\t\\tradiant light\" (diya') and the moon as \"light\\n\\t\\t\\t\\t[reflected]\" (nur); both these interpolations are\\n\\t\\t\\t\\texplained in note [10] on  10:5 ."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "17",
    "NoteID": "10",
    "Body": "This phrase has a twofold meaning. In the first instance,\\n\\t\\t\\t\\tit alludes to the evolution of the individual human body\\n\\t\\t\\t\\tout of the same substances - both organic and inorganic -\\n\\t\\t\\t\\tas are found in and on the earth as well: and in this\\n\\t\\t\\t\\tsense it enlarges upon the creation of the human\\n\\t\\t\\t\\tindividual \"in successive stages\" referred to in verse\\n\\t\\t\\t\\t{14} above. Secondly, it alludes to the evolution of the\\n\\t\\t\\t\\thuman species, which, starting from the most primitive\\n\\t\\t\\t\\torganisms living on earth, has gradually ascended to ever\\n\\t\\t\\t\\thigher stages of development until it has finally reached\\n\\t\\t\\t\\tthat complexity of body, mind and soul evident in the\\n\\t\\t\\t\\thuman being."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "18",
    "NoteID": "11",
    "Body": "Lit., \"with a [final] bringing-forth\"."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "20",
    "NoteID": "12",
    "Body": "I.e., \"He has provided you with all facilities for a good\\n\\t\\t\\t\\tlife on earth\" - the unspoken implication being, \"Will\\n\\t\\t\\t\\tyou not, then, acknowledge Him and be grateful to Him?\""
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "21",
    "NoteID": "13",
    "Body": "Lit., \"and have followed him whose wealth and children do\\n\\t\\t\\t\\tnot increase him in aught but loss\": i.e., people whose\\n\\t\\t\\t\\tpropensity and power only enhance their false pride and\\n\\t\\t\\t\\tarrogance, and thus lead them to spiritual ruin. Beyond\\n\\t\\t\\t\\tthis, we have here a subtle allusion to the fact that an\\n\\t\\t\\t\\texclusive devotion to material prosperity must of\\n\\t\\t\\t\\tnecessity, in the long run, destroy all moral values and,\\n\\t\\t\\t\\tthus, the very fabric of society."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "23",
    "NoteID": "14",
    "Body": "As is evident from early sources, these five gods were\\n\\t\\t\\t\\tamong the many worshipped by the pre-lslamic Arabs as\\n\\t\\t\\t\\twell (see the small but extremely valuable work by Hisham\\n\\t\\t\\t\\tibn Muhammad al-Kalbi, Kitab al-Asnam, ed. Ahmad Zaki,\\n\\t\\t\\t\\tCairo 1914). Their cult had probably been introduced into\\n\\t\\t\\t\\tArabia from Syria and Babylonia, where it seems to have\\n\\t\\t\\t\\texisted in earliest antiquity."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "24",
    "NoteID": "15",
    "Body": "Lit., \"increase Thou not the evildoers in aught but in\\n\\t\\t\\t\\tstraying-away\", i.e., from an achievement of their\\n\\t\\t\\t\\tworldly goals (Razi)."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "25",
    "NoteID": "16",
    "Body": "Lit., \"and were made to enter the fire\" - the past tense\\n\\t\\t\\t\\tindicating the inevitability of the suffering yet to come\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "27",
    "NoteID": "17",
    "Body": "Lit., \"to such as are wicked (fajir), stubbornly ingrate\\n\\t\\t\\t\\t(kaffar)\": but since no one - and particularly not a\\n\\t\\t\\t\\tprophet - is ever justified in assuming that the progeny\\n\\t\\t\\t\\tof evildoers must of necessity be evil, it is obvious\\n\\t\\t\\t\\tthat the terms fajir and kaffar are used here\\n\\t\\t\\t\\tmetonymically, denoting qualities or attitudes, and not\\n\\t\\t\\t\\tpersons."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "28",
    "NoteID": "18",
    "Body": "Lit., \"increase Thou not the evildoers in aught but\\n\\t\\t\\t\\tdestruction\" - i.e., destruction of their aims and, thus,\\n\\t\\t\\t\\tof evil as such."
  }
]
