[
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "1",
    "sectionHeading": "Doing Ghusl on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr ibn Abd ar-Rahman, from Abu Salih as-Sammani\\n\\t\\t\\t\\tfrom Abu Hurayra that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"If someone does\\n\\t\\t\\t\\tghusl for major ritual impurity on the day of jumua and\\n\\t\\t\\t\\tthen goes in the first part of the time, it is as if he\\n\\t\\t\\t\\thad offered up a camel. If he goes in the second part of\\n\\t\\t\\t\\tthe time, it is as if he had offered up a cow. If he goes\\n\\t\\t\\t\\tin the third part of the time, it is as if he had offered\\n\\t\\t\\t\\tup a horned ram. If he goes in the fourth part of the\\n\\t\\t\\t\\ttime, it is as if he had offered up a hen. If he goes in\\n\\t\\t\\t\\tthe fifth part of the time, it is as if he had offered up\\n\\t\\t\\t\\tan egg. And when the imam comes out, the angels settle\\n\\t\\t\\t\\tdown listening to the dhikr (remembrance of Allah).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "2",
    "sectionHeading": "Doing Ghusl on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Abi Said\\n\\t\\t\\t\\tal-Maqburi that Abu Hurayra used to say, \"Doing ghusl as\\n\\t\\t\\t\\tprescribed for major ritual impurity is incumbent (wajib)\\n\\t\\t\\t\\ton the day of jumua on every male who has reached\\n\\t\\t\\t\\tpuberty.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "3",
    "sectionHeading": "Doing Ghusl on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Salim\\n\\t\\t\\t\\tibn Abdullah said, \"One of the companions of the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, came into the mosque on the day of jumua and Umar\\n\\t\\t\\t\\tibn al Khattab was already giving the khutba. Umar said,\\n\\t\\t\\t\\t'What (kind of) time is this (to arrive)?'  He said, Amir\\n\\t\\t\\t\\tal-muminin, I returned from the market and heard the call\\n\\t\\t\\t\\tto prayer, so I did no more than do wudu.' Umar said,\\n\\t\\t\\t\\t'You only did wudu as well? You know that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, used\\n\\t\\t\\t\\tto tell people to do ghusl.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "4",
    "sectionHeading": "Doing Ghusl on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Safwan ibn Sulaym\\n\\t\\t\\t\\tfrom Ata ibn Yasar from Abu Said al-Khudri that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Ghusl on the day of jumua is incumbent on\\n\\t\\t\\t\\tevery male who has reached puberty.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "5",
    "sectionHeading": "Doing Ghusl on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Ibn Umar\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"When you come to jumua, do\\n\\t\\t\\t\\tghusl.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not enough for someone to do a ghusl\\n\\t\\t\\t\\ton the day of jumua and intend by it the ghusl for jumua\\n\\t\\t\\t\\tunless he does the ghusl and then sets off. That is\\n\\t\\t\\t\\tbecause the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said in the hadith related by Ibn Umar,\\n\\t\\t\\t\\t'When you come to jumua, do ghusl .' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone does ghusl on the day of jumua\\n\\t\\t\\t\\tand intends by it the ghusl of the day of jumua and then\\n\\t\\t\\t\\tsets out, whether early or late, and does something which\\n\\t\\t\\t\\tbreaks his wudu, he only has to do wudu and his ghusl\\n\\t\\t\\t\\tremains valid for him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "6",
    "sectionHeading": "Paying Atlention when the Imam is Giving the Khutba on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Even saying\\n\\t\\t\\t\\tto your companion 'Listen' while the imam is giving the\\n\\t\\t\\t\\tkhutba on the day of jumua, is to speak foolishly.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "7",
    "sectionHeading": "Paying Atlention when the Imam is Giving the Khutba on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tThalaba ibn Abi Malik al Quradhi informed him that in the\\n\\t\\t\\t\\ttime of Umar ibn al Khattab they used to pray on the day\\n\\t\\t\\t\\tof jumua until Umar came out, and when Umar came out and\\n\\t\\t\\t\\tsat on the mimbar and the muadhdhins called the adhan,\\n\\t\\t\\t\\tthey would sit and talk, and then when the muadhdhins\\n\\t\\t\\t\\twere silent and Umar stood to give the khutba, they would\\n\\t\\t\\t\\tpay attention and no-one would speak .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Shihab said, \"The imam coming out stops prayer and\\n\\t\\t\\t\\this speaking stops conversation.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "8",
    "sectionHeading": "Paying Atlention when the Imam is Giving the Khutba on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah, from Malik ibn Abi Amir that\\n\\t\\t\\t\\tUthman ibn Affan used to say in khutbas, and he would\\n\\t\\t\\t\\tseldom omit it if he was giving the khutba, \"When the\\n\\t\\t\\t\\timam stands delivering the khutba on the day of jumua,\\n\\t\\t\\t\\tlisten and pay attention, for there is the same portion\\n\\t\\t\\t\\tfor someone who pays attention but cannot hear as for\\n\\t\\t\\t\\tsomeone who pays attention and hears. And when the iqama\\n\\t\\t\\t\\tof the prayer is called, straighten your rows and make\\n\\t\\t\\t\\tyour shoulders adjacent to each other, because the\\n\\t\\t\\t\\tstraightening of the rows is part of the completion of\\n\\t\\t\\t\\tthe prayer.\" Then he would not say the takbir until some\\n\\t\\t\\t\\tmen who had been entrusted with straightening the rows\\n\\t\\t\\t\\tcame and told him that they were straight. Then he would\\n\\t\\t\\t\\tsay the takbir.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "9",
    "sectionHeading": "Paying Atlention when the Imam is Giving the Khutba on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar saw two men talking while the imam was giving\\n\\t\\t\\t\\tthe khutba on the day of jumua and he threw pebbles at\\n\\t\\t\\t\\tthem to tell them to be quiet.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "10",
    "sectionHeading": "Paying Atlention when the Imam is Giving the Khutba on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that a\\n\\t\\t\\t\\tman sneezed on the day of jumua while the imam was giving\\n\\t\\t\\t\\tthe khutba, and a man by his side asked Allah to bless\\n\\t\\t\\t\\thim. Said ibn al Musayyab was asked about it and he\\n\\t\\t\\t\\tforbade the man to do what he had done and said, \"Don't\\n\\t\\t\\t\\tdo it again.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "11",
    "sectionHeading": "Paying Atlention when the Imam is Giving the Khutba on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he asked Ibn Shihab\\n\\t\\t\\t\\tabout talking in the jumua after the imam had come down\\n\\t\\t\\t\\tfrom the mimbar but before he had said the takbir. Ibn\\n\\t\\t\\t\\tShihab said, \"There is no harm in that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "12",
    "sectionHeading": "Concerning Someone Who Catches a Raka of the Jumua Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab used to\\n\\t\\t\\t\\tsay, \"Some one who catches a raka of the jumua prayer\\n\\t\\t\\t\\tshould pray another one with it.\" Ibn Shihab said, \"That\\n\\t\\t\\t\\tis the sunna.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I saw the people of knowledge in our city\\n\\t\\t\\t\\tdoing that. That is because the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, 'Whoever\\n\\t\\t\\t\\tcatches a raka of the prayer has caught the prayer.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, concerning some one who was in a crowd on the\\n\\t\\t\\t\\tday of jumua and did the ruku but was not able to go into\\n\\t\\t\\t\\tsajda until the imam had risen or finished his prayer,\\n\\t\\t\\t\\t\"If he is able to do the sajda and has already done the\\n\\t\\t\\t\\truku then he should do the sajda when the people stand\\n\\t\\t\\t\\tup. If he is unable to do thesajda until after the imam\\n\\t\\t\\t\\thas finished the prayer, then I prefer that he begins the\\n\\t\\t\\t\\tprayeragain and does the four rakas of dhuhr.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "13",
    "sectionHeading": "Nose Bleeds on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"Someone who has a nosebleed on the day of\\n\\t\\t\\t\\tjumua while the imam is giving the khutba and he leaves\\n\\t\\t\\t\\tand does not come back until the imam has finished the\\n\\t\\t\\t\\tprayer, should pray four rakas.''\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that someone who prayed a raka with the imam\\n\\t\\t\\t\\ton the day of jumua, then had a nosebleed and left and\\n\\t\\t\\t\\tcame back and the imam had prayed both rakas, should\\n\\t\\t\\t\\tcomplete the prayer with another raka as long as he had\\n\\t\\t\\t\\tnot spoken.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If some one has a nosebleed, or something\\n\\t\\t\\t\\thappens to him and he has no alternative but to leave, he\\n\\t\\t\\t\\tdoes not have to ask permission of the imam if he wants\\n\\t\\t\\t\\tto leave on the day of jumua.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "14",
    "sectionHeading": "Making Haste on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had asked Ibn\\n\\t\\t\\t\\tShihab about the word of Allah, the Majestic, the Mighty,\\n\\t\\t\\t\\t\"O you who accept, when the call is made for the prayer\\n\\t\\t\\t\\ton the day of jumua, make haste to the remembrance of\\n\\t\\t\\t\\tAllah.\"(Sura 62 ayat 9). Ibn Shihab said, ''Umar ibn\\n\\t\\t\\t\\tal-Khattab used to recite, 'When the call is made for the\\n\\t\\t\\t\\tprayer on the day of jumua, go to the remembrance of\\n\\t\\t\\t\\tAllah.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Making haste in the Book of Allah is only\\n\\t\\t\\t\\tdeed and action. Allah the Blessed, the Exalted, says\\n\\t\\t\\t\\t'and when he turns away, he acts in the land' (Sura 2\\n\\t\\t\\t\\tayat 205), and He, the Exalted, said, 'and as for the one\\n\\t\\t\\t\\twho comes to you acting with fear' (Sura 80 ayat 8), and\\n\\t\\t\\t\\tHe said, 'then he turned his back, and acted' (Sura 79\\n\\t\\t\\t\\tayat 22),and He said, 'Your deeds are diverse' \" (Sura 92\\n\\t\\t\\t\\tayat 4). Malik said, \"Thus making haste which Allah\\n\\t\\t\\t\\tmentions in His Book is not running on the feet or\\n\\t\\t\\t\\texertion. It only means deed and actions.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "15",
    "sectionHeading": "The Imam's Stopping Off in a Town on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"If the imam stops off on a journey in a town\\n\\t\\t\\t\\twhere jumua is obligatory and he gives a khutba and takes\\n\\t\\t\\t\\tthe jumua prayer for them, then the people of the town\\n\\t\\t\\t\\tand any other people present do the jumua prayer with\\n\\t\\t\\t\\thim.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the imam gathers people for prayer while\\n\\t\\t\\t\\the is travelling in a town where the jumua prayer is not\\n\\t\\t\\t\\tobligatory, then there is no jumua for him, nor for the\\n\\t\\t\\t\\tpeople of the town, nor for anyone else who joins them\\n\\t\\t\\t\\tfor the prayer in congregation, and the people of the\\n\\t\\t\\t\\ttown and anyone else who is not travelling should\\n\\t\\t\\t\\tcomplete the prayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"A traveller does not have to do jumua \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "16",
    "sectionHeading": "The Special Time in the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, mentioned the day of\\n\\t\\t\\t\\tjumua and said, \"There is a time in it when Allah gives\\n\\t\\t\\t\\tto a muslim slave standing in prayer whatever he asks\\n\\t\\t\\t\\tfor,\" and the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, indicated with his hand how small it\\n\\t\\t\\t\\twas.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "17",
    "sectionHeading": "The Special Time in the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Abdullah\\n\\t\\t\\t\\tibn al-Had from Muhammad ibn Ibrahim ibn al-Harith\\n\\t\\t\\t\\tat-Taymi from Abu Salama ibn Abd ar-Rahman ibn Awf that\\n\\t\\t\\t\\tAbu Hurayra said, \"I went out to at-Tur (Mount Sinai) and\\n\\t\\t\\t\\tmet Kab al Ahbar and sat with him. He related to me\\n\\t\\t\\t\\tthings from the Tawrah and I related to him things from\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace. Among the things I related to him was that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'The best of days on which the sun rises is\\n\\t\\t\\t\\tthe day of jumua. In it Adam was created, and in it he\\n\\t\\t\\t\\tfell from the Garden. In it he was forgiven, and in it he\\n\\t\\t\\t\\tdied. In it the Hour occurs, and every moving thing\\n\\t\\t\\t\\tlistens from morning till sunset in apprehension of the\\n\\t\\t\\t\\tHour except jinn and men. In it is a time when Allah\\n\\t\\t\\t\\tgives toa muslim slave standing in prayer whatever he\\n\\t\\t\\t\\tasks for.' Kab said, 'That is one day in every year.' I\\n\\t\\t\\t\\tsaid, 'No, in every jumua.' Then Kab recited the Tawrah\\n\\t\\t\\t\\tand said, 'The Messenger of Allah has spoken the truth.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Hurayra continued, \"I met Basra ibn Abi Basra\\n\\t\\t\\t\\tal-Ghiffari and he said, 'Where have you come from?' I\\n\\t\\t\\t\\tsaid, 'From at-Tur.' He said, 'If I had seen you before\\n\\t\\t\\t\\tyou left, you would not have gone. I heard the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, say,\\n\\t\\t\\t\\t\"Only make a special journey to three mosques:\\tthe\\n\\t\\t\\t\\tmosque of the Haram (Makka), this mosque (Madina), and\\n\\t\\t\\t\\tthe mosque of Ilya or the Bait al-Maqdis (two names of\\n\\t\\t\\t\\tJerusalem).\" ' \" (He was not sure which expression was\\n\\t\\t\\t\\tused.)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Hurayra continued, \"Then I met Abdullah ibn Salam and\\n\\t\\t\\t\\tI told him that I had sat with Kabal-Ahbar, and I\\n\\t\\t\\t\\tmentioned what I had related to him about the day of\\n\\t\\t\\t\\tjumua, and told him that Kab had said, 'That is one day\\n\\t\\t\\t\\tin every year.' Abdullah ibn Salam said, 'Kab lied,' and\\n\\t\\t\\t\\tI added, 'Kab then recited the Tawrah and said, \"No, it\\n\\t\\t\\t\\tis in every jumua.''  ' Abdullah ibn Salam said, 'Kab\\n\\t\\t\\t\\tspoke the truth. 'Then Abdullah ibn Salam said, 'I know\\n\\t\\t\\t\\twhat time that is.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Hurayra continued, \"I said to him, 'Let me know it -\\n\\t\\t\\t\\tdon't keep it from me.' Abdullah ibn Salam said, 'It is\\n\\t\\t\\t\\tthe last period of time in the dayof jumua.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Hurayra continued, \"I said, 'How can it be the last\\n\\t\\t\\t\\tperiod of time in the day of jumua, when the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, \"a\\n\\t\\t\\t\\tmuslim slave standing in prayer\", and that is a time when\\n\\t\\t\\t\\tthere is no prayer?' Abdullah ibn Salam replied, 'Didn't\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, \"Whoever sits waiting for the prayer is in\\n\\t\\t\\t\\tprayer until he prays?\" \"'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Hurayra added, \"I said, 'Of course.' He said, 'Then\\n\\t\\t\\t\\tit is that.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "18",
    "sectionHeading": "Good Appearance and Not Stepping Over People and Facing the Imam on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the had heard that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"There is nothing wrong in\\n\\t\\t\\t\\twearing two garments which are not work-clothes for\\n\\t\\t\\t\\tjumua.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "19",
    "sectionHeading": "Good Appearance and Not Stepping Over People and Facing the Imam on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar would never go to jumua without wearing oil and\\n\\t\\t\\t\\tperfume except when it was forbidden (i.e. when he was\\n\\t\\t\\t\\tmuhrim).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "20",
    "sectionHeading": "Good Appearance and Not Stepping Over People and Facing the Imam on the Day of Jumua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Abi Bakr ibn Hazm from whoever related it to him that\\n\\t\\t\\t\\tAbu Hurayra used to say, \"It is better for a man to pray\\n\\t\\t\\t\\ton the surface of al Harra (a rocky area in Madina) than\\n\\t\\t\\t\\tfor him to wait until the imam stands to give the khutba\\n\\t\\t\\t\\tand then come and step over people's necks.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna with us is that the people face\\n\\t\\t\\t\\tthe imam on the day of jumua when he intends to give the\\n\\t\\t\\t\\tkhutba, whether they are near the qibla or elsewhere.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "21",
    "sectionHeading": "The Recitation in the Jumua Prayer, the Sitting, and Missing the Prayer Without a Reason",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Damra ibn Said\\n\\t\\t\\t\\tal-Mazini from Ubaydullah ibn Abdullah ibn Utba ibn Masud\\n\\t\\t\\t\\tthat ad-Dahhak ibn Qays asked an-Numan ibn Bashir, \"What\\n\\t\\t\\t\\tdid the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, use to recite on the day of jumua after\\n\\t\\t\\t\\tsuratal-Jumua (Sura 62)?\" He said, \"He used to recite\\n\\t\\t\\t\\tal-Ghashiya (Sura 88).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "22",
    "sectionHeading": "The Recitation in the Jumua Prayer, the Sitting, and Missing the Prayer Without a Reason",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Safwan ibn Sulaym\\n\\t\\t\\t\\tsaid, \"If anyone omits jumua three times without reason\\n\\t\\t\\t\\tor illness, Allah will set a seal on his heart.\" (Malik\\n\\t\\t\\t\\tsaid, \"I don't know if it was from the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, or not.\")\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "5",
    "hadithNumber": "23",
    "sectionHeading": "The Recitation in the Jumua Prayer, the Sitting, and Missing the Prayer Without a Reason",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Jafar ibn Muhammad\\n\\t\\t\\t\\tfrom his father that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, gave two khutbas on the\\n\\t\\t\\t\\tday of jumua and sat down between them.\\n\\t\\t\\t</p>"
  }
]
