[
  {
    "SurahNumber": "43",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "Regarding this rendering of the term mubin, see note [2]\\n\\t\\t\\t\\ton  12:1 ."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "See note [3] on  12:3."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "Cf. last clause of  13:39  - \"with Him ('indahu) is the\\n\\t\\t\\t\\tsource (umm) of all revelation\". The term umm (lit.,\\n\\t\\t\\t\\t\"mother\") has often the idiomatic connotation of \"origin\"\\n\\t\\t\\t\\tor \"source\" (asl), and sometimes - as in  3:7  - of\\n\\t\\t\\t\\t\"essence\". In the present context, only the former\\n\\t\\t\\t\\tmeaning is applicable. See also note [11] on the last\\n\\t\\t\\t\\tverse of surah {85}."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "For this rendering of the term musrif, see note [21] on\\n\\t\\t\\t\\tthe last sentence of  10:12 . The above rhetorical\\n\\t\\t\\t\\tquestion answers itself, of course, in the negative -\\n\\t\\t\\t\\timplying that God never ceases to \"remind\" the sinner\\n\\t\\t\\t\\tthrough His revelations, and always accepts repentance."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "I.e., than the people addressed in verse {5} above."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "See surah {30}, note [45]."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "10",
    "NoteID": "8",
    "Body": "Cf.  20:53 ."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "The grammatical form nazzala implies here recurrence:\\n\\t\\t\\t\\thence, \"again and again\"."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "12",
    "NoteID": "10",
    "Body": "Lit., \"all pairs\". Some commentators regard the term\\n\\t\\t\\t\\tazwaj as synonymous in this context with \"kinds\"\\n\\t\\t\\t\\t(Baghawi, Zamakhshari, Baydawi, Ibn Kathir): i.e., they\\n\\t\\t\\t\\ttake the above phrase to mean no more than that God\\n\\t\\t\\t\\tcreated all kinds of things, beings and phenomena. Others\\n\\t\\t\\t\\t(e.g., Tabari) see in it a reference to the polarity\\n\\t\\t\\t\\tevident in all creation. Ibn'Abbas (as quoted by Razi)\\n\\t\\t\\t\\tsays that it denotes the concept of opposites in general,\\n\\t\\t\\t\\tlike \"sweet and sour, or white and black, or male and\\n\\t\\t\\t\\tfemale\"; to which Razi adds that everything in creation\\n\\t\\t\\t\\thas its complement, \"like high and low, right and left,\\n\\t\\t\\t\\tfront and back, past and future, being and attribute\",\\n\\t\\t\\t\\tetc., whereas God - and He alone - is unique, without\\n\\t\\t\\t\\tanything that could be termed \"opposite\" or \"similar\" or\\n\\t\\t\\t\\t\"complementary\". Hence, the above sentence is an echo of\\n\\t\\t\\t\\tthe statement that \"there is nothing that could be\\n\\t\\t\\t\\tcompared with Him\" ( 112:4 )."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "13",
    "NoteID": "11",
    "Body": "Lit., \"over its backs\" - i.e., according to all classical\\n\\t\\t\\t\\tcommentators, the \"backs\" of the above-mentioned animals\\n\\t\\t\\t\\tand ships alike, the singular form of the pronoun (\"its\")\\n\\t\\t\\t\\trelating to the collective entity comprised in the\\n\\t\\t\\t\\tconcept of \"all whereon you ride\" (ma tarkabun): in other\\n\\t\\t\\t\\twords, \"all that you use or may use by way of transport\".\\n\\t\\t\\t\\tAs regards my rendering of li-tasta'u as \"so that you\\n\\t\\t\\t\\tmight gain mastery\", I should like to point out that the\\n\\t\\t\\t\\tverb istawa (lit., \"he established himself\") has often\\n\\t\\t\\t\\tthe connotation adopted by me: see Jawhari, Raghib and\\n\\t\\t\\t\\tLisan al-'Arab, art. sawa; also Lane IV, 1478."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "15",
    "NoteID": "12",
    "Body": "I.e., despite the fact that most people readily admit\\n\\t\\t\\t\\tthat God has created all that exists (verse {9} above),\\n\\t\\t\\t\\tsome of them tend to forget His uniqueness."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "15",
    "NoteID": "13",
    "Body": "Lit., \"attribute to Him a part out of [some of] His\\n\\t\\t\\t\\tcreatures ('ibad)\": cf.  6:100  and the corresponding\\n\\t\\t\\t\\tnotes. The noun juz' (lit., \"part\") evidently denotes\\n\\t\\t\\t\\there \"a part of Himself\", as implied in the concept of\\n\\t\\t\\t\\t\"offspring\"; hence my rendering. If, on the other hand,\\n\\t\\t\\t\\tjuz' is understood in its literal sense, the above\\n\\t\\t\\t\\tsentence could have (as Razi assumes) a more general\\n\\t\\t\\t\\tmeaning, namely, \"they attribute a part of His divinity\\n\\t\\t\\t\\tto some of the beings created by Him\". However, in view\\n\\t\\t\\t\\tof the sequence, which clearly refers to the blasphemous\\n\\t\\t\\t\\tattribution of \"offspring\" to God, my rendering seems to\\n\\t\\t\\t\\tbe preferable."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "16",
    "NoteID": "14",
    "Body": "It should be remembered that the people thus addressed\\n\\t\\t\\t\\twere the pagan Arabs, who believed that some of their\\n\\t\\t\\t\\tgoddesses, as well as the angels, were \"God's daughters\".\\n\\t\\t\\t\\tIn view of the fact that those pre-Islamic Arabs regarded\\n\\t\\t\\t\\tdaughters as a mere liability and their birth as a\\n\\t\\t\\t\\tdisgrace, this verse is obviously ironical. (Cf. in this\\n\\t\\t\\t\\tconnection {16:57-59}.)"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "17",
    "NoteID": "15",
    "Body": "Lit., \"what he postulates as a likeness of [or \"as likely\\n\\t\\t\\t\\tfor\"] the Most Gracious\": i.e., female offspring, which\\n\\t\\t\\t\\timplies a natural \"likeness\" to its progenitor."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "18",
    "NoteID": "16",
    "Body": "I.e., one who, from the viewpoint of the pre-Islamic\\n\\t\\t\\t\\tArabs, would have no function other than \"embellishing\" a\\n\\t\\t\\t\\tman's life."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "18",
    "NoteID": "17",
    "Body": "Lit., \"he finds himself in an invisible (ghayr mubin)\\n\\t\\t\\t\\tconflict\" - i.e., an inner conflict which he does not\\n\\t\\t\\t\\tquite admit to his consciousness: cf.  16:59  - \"he\\n\\t\\t\\t\\tdebates within himself:] Shall he keep this child despite\\n\\t\\t\\t\\tthe contempt [which he feels for it] - or shall he bury\\n\\t\\t\\t\\tit in the dust?\" (See also, in particular, the\\n\\t\\t\\t\\tcorresponding note [66].)"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "19",
    "NoteID": "18",
    "Body": "Or: \"who are but worshippers [or \"creatures\"] ('ibad ) of\\n\\t\\t\\t\\tthe Most Gracious\" - in either case stressing their\\n\\t\\t\\t\\thaving been created and, hence, not being divine."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "19",
    "NoteID": "19",
    "Body": "Lit., \"their testimony\", i.e., regarding the \"sex\" of the\\n\\t\\t\\t\\tangels, who are spiritual in nature (Razi) and,\\n\\t\\t\\t\\ttherefore, sexless."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "20",
    "NoteID": "20",
    "Body": "I.e., they cannot have any \"knowledge\" of something that\\n\\t\\t\\t\\tis devoid of all reality - because, far from having\\n\\t\\t\\t\\t\"willed\" their sin, God had left it to their free will to\\n\\t\\t\\t\\tmake a moral choice between right and wrong. (See in this\\n\\t\\t\\t\\tconnection surah {6}, note [143].)"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "21",
    "NoteID": "21",
    "Body": "I.e., a revelation which would allow man to worship other\\n\\t\\t\\t\\tbeings beside God, or to attribute \"offspring\" to Him: a\\n\\t\\t\\t\\trhetorical question implying its own negation."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "23",
    "NoteID": "22",
    "Body": "For this rendering of the term mutraf (derived from the\\n\\t\\t\\t\\tverb tarafa), see note [147] on  11:116 ."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "23",
    "NoteID": "23",
    "Body": "Commenting on this passage, Razi says: \"Had there been in\\n\\t\\t\\t\\tthe Qur'an nothing but these verses, they would have\\n\\t\\t\\t\\tsufficed to show the falsity of the principle postulating\\n\\t\\t\\t\\t[a Muslim's] blind, unquestioning adoption of [another\\n\\t\\t\\t\\tperson's] religious opinions (ibtal al -qawl bi't-taqlid\\n\\t\\t\\t\\t): for, God has made it clear [in these verses] that\\n\\t\\t\\t\\tthose deniers of the truth had not arrived at their\\n\\t\\t\\t\\tconvictions by way of reason, and neither on the clear\\n\\t\\t\\t\\tauthority of a revealed text, but solely by blindly\\n\\t\\t\\t\\tadopting the opinions of their forebears and\\n\\t\\t\\t\\tpredecessors; and all this God has mentioned in terms of\\n\\t\\t\\t\\tblame and sharp disparagement.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "24",
    "NoteID": "24",
    "Body": "Whereas in some of the readings of the Qur'an the opening\\n\\t\\t\\t\\tword of this verse is vocalized as an imperative, qul\\n\\t\\t\\t\\t(\"say\"), the reading of Hafs ibn Sulayman al-Asadi - on\\n\\t\\t\\t\\twhich this translation is based - gives the\\n\\t\\t\\t\\tpronounciation qala (\"he said\" or, since it is a repeated\\n\\t\\t\\t\\toccurrence, \"he would say\")."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "26",
    "NoteID": "25",
    "Body": "Namely, the inadmissibility of blindly accepting the\\n\\t\\t\\t\\treligious views s anctioned by mere ancestral tradition\\n\\t\\t\\t\\tand thus prevalent in one's environment, and regarding\\n\\t\\t\\t\\tthem as valid even though they may conflict with one's\\n\\t\\t\\t\\treason and/or divine revelation. Abraham's search after\\n\\t\\t\\t\\ttruth is mentioned several times in the Qur'an, and\\n\\t\\t\\t\\tparticularly in  6:74  ff. and  21:51  ff."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "29",
    "NoteID": "26",
    "Body": "I.e., God did not impose on them any moral obligations\\n\\t\\t\\t\\tbefore making the meaning of right and wrong clear to\\n\\t\\t\\t\\tthem through a revealed message. Primarily, this is an\\n\\t\\t\\t\\tallusion to the pagan contemporaries of the Prophet, and\\n\\t\\t\\t\\tto the prosperity which they had been allowed to enjoy\\n\\t\\t\\t\\tfor a long time (cf.  21:44 ); in its wider sense,\\n\\t\\t\\t\\thowever, this passage implies that God would never call\\n\\t\\t\\t\\tpeople to task for any wrong they may have done so long\\n\\t\\t\\t\\tas they have not been clearly shown how to discriminate\\n\\t\\t\\t\\tbetween good and evil (cf. {6:131-132})."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "30",
    "NoteID": "27",
    "Body": "See note [12] on  74:24 , where this connotation of sihr\\n\\t\\t\\t\\tappears for the first time in the course of Qur'anic\\n\\t\\t\\t\\trevelation."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "31",
    "NoteID": "28",
    "Body": "I.e., Mecca and Ta'if - implying that if it were really a\\n\\t\\t\\t\\tdivine revelation it would have been bestowed on a person\\n\\t\\t\\t\\tof \"great standing\", and not on Muhammad, who had neither\\n\\t\\t\\t\\twealth nor a position of eminence in his native city."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "33",
    "NoteID": "29",
    "Body": "Since \"man has been created weak\" ( 4:28 ), it is almost\\n\\t\\t\\t\\ta \"law of nature\" that whenever he is exposed to the\\n\\t\\t\\t\\tprospect of great wealth he is liable to lose sight of\\n\\t\\t\\t\\tall spiritual and moral considerations, and to become\\n\\t\\t\\t\\tutterly selfish, greedy and ruthless."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "35",
    "NoteID": "30",
    "Body": "The primary meaning of the noun zukhruf is \"gold\"; its\\n\\t\\t\\t\\tapplication to\\t\"ornaments\" or (as in  10:24 ) to \"artful\\n\\t\\t\\t\\tadornment\" is only secondary (Taj al-'Arus)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "36",
    "NoteID": "31",
    "Body": "Lit., \"to him We assign a satan, and he becomes his other\\n\\t\\t\\t\\tself (qarin)\": see note [24] on  41:25 . For the\\n\\t\\t\\t\\tpsychological connotation of the term shaytan as \"evil\\n\\t\\t\\t\\timpulse\", see first half of note [16] on  15:17  as well\\n\\t\\t\\t\\tas note [31] on  14:22 ."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "38",
    "NoteID": "32",
    "Body": "Lit.. \"until\"."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "38",
    "NoteID": "33",
    "Body": "Thus do most of the commentators interpret the above\\n\\t\\t\\t\\tphrase which, literally, reads \"the two easts\"\\n\\t\\t\\t\\t(al-mashriqayn). This interpretation is based on the\\n\\t\\t\\t\\tidiomatic usage, not infrequent in classical Arabic, of\\n\\t\\t\\t\\treferring to two opposites - or two conceptually\\n\\t\\t\\t\\tconnected entities - by giving them the designation of\\n\\t\\t\\t\\tone of them in the dual form: e.g., \"the two moons\",\\n\\t\\t\\t\\tdenoting \"sun and moon\"; \"the two Basrahs\", i.e., Kufah\\n\\t\\t\\t\\tand Basrah; and so forth."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "39",
    "NoteID": "34",
    "Body": "I.e., \"you will not be consoled, as would have been the\\n\\t\\t\\t\\tcase in earthly suffering, by the knowledge that you are\\n\\t\\t\\t\\tnot to suffer alone\" (Zamakhshari, Razi, Baydawi). Since\\n\\t\\t\\t\\tthis address is formulated in the plural and not in the\\n\\t\\t\\t\\tdual, it evidently relates to all sinners who, in their\\n\\t\\t\\t\\tlifetime, were impelled by their own evil impulses -\\n\\t\\t\\t\\ttheir \"other selves\", as it were - to \"remain blind to\\n\\t\\t\\t\\tthe remembrance of God\". In its wider meaning, the above\\n\\t\\t\\t\\tverse implies that all evil deeds, whenever and wherever\\n\\t\\t\\t\\tcommitted, are but links of one chain, one evil\\n\\t\\t\\t\\tineluctably leading to another: cf.  14:49  - \"on that\\n\\t\\t\\t\\tDay thou wilt see those who were lost in sin linked\\n\\t\\t\\t\\ttogether (muqarranin) in fetters\" - a phrase which has\\n\\t\\t\\t\\tbeen explained in my corresponding note [64]. It is\\n\\t\\t\\t\\tnoteworthy that the participle muqarran is derived from\\n\\t\\t\\t\\tthe same verbal root (qarana) as the term qarin (rendered\\n\\t\\t\\t\\tby me in verses {36} and {38} of this surah and in\\n\\t\\t\\t\\t 41:25  as \"other self\"): and this, I believe, is a\\n\\t\\t\\t\\tfurther indication, alluded to in the present  verse, to\\n\\t\\t\\t\\tthe \"togetherness\" of all evil deeds."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "40",
    "NoteID": "35",
    "Body": "This rhetorical question implies a negative answer: cf.\\n\\t\\t\\t\\t 35:22  - \"thou canst not make hear such as are [deaf of\\n\\t\\t\\t\\theart like the dead] in the graves\"."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "44",
    "NoteID": "36",
    "Body": "For the above rendering of dhikr as \"[a source of]\\n\\t\\t\\t\\teminence\", see first half of note [13] on  21:10 ."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "44",
    "NoteID": "37",
    "Body": "The meaning is that on the Day of Judgment all prophets\\n\\t\\t\\t\\twill be asked, metaphorically, as to what response they\\n\\t\\t\\t\\treceived from their people (cf.  5:109 ), and those who\\n\\t\\t\\t\\tprofessed to follow them will be called to account for\\n\\t\\t\\t\\tthe spiritual and social use they made - or did not make\\n\\t\\t\\t\\t- of the revelation conveyed to them: and thus, the\\n\\t\\t\\t\\t\"eminence\" promised to the followers of Muhammad will\\n\\t\\t\\t\\tdepend on their actual behaviour and not on their mere\\n\\t\\t\\t\\tprofession of faith."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "45",
    "NoteID": "38",
    "Body": "I.e.. \"look into the earlier revelations and ask\\n\\t\\t\\t\\tthyself\"."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "46",
    "NoteID": "39",
    "Body": "I.e., in pursuance of the principle, referred to above,\\n\\t\\t\\t\\tthat it is not permissible to worship anyone or anything\\n\\t\\t\\t\\tbut God."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "47",
    "NoteID": "40",
    "Body": "See note [94] on the last sentence of  6:109 ."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "48",
    "NoteID": "41",
    "Body": "The concept of \"returning\" to God implies that the\\n\\t\\t\\t\\tinstinctive ability to perceive His existence is inherent\\n\\t\\t\\t\\tin human nature as such, and that man's \"turning away\"\\n\\t\\t\\t\\tfrom God is only a consequence of spiritual degeneration,\\n\\t\\t\\t\\tand not an original tendency or predisposition: cf.\\n\\t\\t\\t\\t{7:172-173}.  The \"suffering\" ('adhab) mentioned above\\n\\t\\t\\t\\trelates to the plagues with which the recalcitrant\\n\\t\\t\\t\\tEgyptians were struck (see  7:130  ff.)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "51",
    "NoteID": "42",
    "Body": "Lit., \"beneath me\", i.e., \"at my command\": a reference to\\n\\t\\t\\t\\tthe imposing irrigation system originating in the Nile\\n\\t\\t\\t\\tand controlled by royal power."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "52",
    "NoteID": "43",
    "Body": "An allusion to the impediment in speech from which Moses\\n\\t\\t\\t\\tsuffered (cf. {20:27-28} and the corresponding note\\n\\t\\t\\t\\t[17]), or perhaps to the contents of his message, which\\n\\t\\t\\t\\tto Pharaoh appeared unconvincing."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "53",
    "NoteID": "44",
    "Body": "In ancient Egypt, golden armless and necklaces were\\n\\t\\t\\t\\tregarded as princely insignia (cf. Genesis xii, 42), or\\n\\t\\t\\t\\tat least as evidence of high social dignity. This is\\n\\t\\t\\t\\tapparently an echo of the pagan objection to Muhammad,\\n\\t\\t\\t\\tmentioned in verse {31} above: \"Why was not this Qur'an\\n\\t\\t\\t\\tbestowed from on high on some great man of the two\\n\\t\\t\\t\\tcities?\" The same is the case with the subsequent\\n\\t\\t\\t\\treference to the \"absence of angels\"."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "58",
    "NoteID": "45",
    "Body": "Objecting to the Qur'anic condemnation of their\\n\\t\\t\\t\\tidolatrous worship of angels - whom they describe here as\\n\\t\\t\\t\\t\"our deities\" - the pagan Quraysh pointed to the parallel\\n\\t\\t\\t\\tChristian worship of Jesus as \"the son of God\", and even\\n\\t\\t\\t\\tas \"God incarnate\", and argued more or less thus: \"The\\n\\t\\t\\t\\tQur'an states that Jesus was purely human - and yet the\\n\\t\\t\\t\\tChristians, whom the same Qur'an describes as 'followers\\n\\t\\t\\t\\tof earlier revelation' (ahl al-kitab), consider him\\n\\t\\t\\t\\tdivine. Hence, are we not rather justified in our\\n\\t\\t\\t\\tworshipping angels, who are certainly superior to a mere\\n\\t\\t\\t\\thuman being?\" The fallacy inherent in this \"argument\" is\\n\\t\\t\\t\\tdisposed of in the sequence."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "58",
    "NoteID": "46",
    "Body": "Since the Qur'an condemns explicitly, and in many places,\\n\\t\\t\\t\\tthe deification of Jesus by the Christians, this\\n\\t\\t\\t\\tunwarranted deification cannot be used as an argument in\\n\\t\\t\\t\\tfavour of the pagan worship of angels and, thus, against\\n\\t\\t\\t\\tthe Qur'an: in the words of Zamakhshari, such an argument\\n\\t\\t\\t\\tamounts to \"applying a false analogy to a false\\n\\t\\t\\t\\tproposition\" (qiyas batil bi-batil)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "60",
    "NoteID": "47",
    "Body": "Implying not only that Jesus was not a supernatural\\n\\t\\t\\t\\tbeing, but that the angels, too, are mere created beings\\n\\t\\t\\t\\tfinite in their existence - as indicated by the phrase\\n\\t\\t\\t\\t\"succeeding one another\" - and, therefore, utterly\\n\\t\\t\\t\\tremoved from the status of divinity (Baydawi)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "61",
    "NoteID": "48",
    "Body": "Whereas most of the commentators regard the pronoun hu in\\n\\t\\t\\t\\tinnahu as relating to Jesus and, consequently, interpret\\n\\t\\t\\t\\tthe above phrase as \"he is indeed a means to know [i.e.,\\n\\t\\t\\t\\tan indication of the coming of] the Last Hour\", some\\n\\t\\t\\t\\tauthorities - e.g., Qatadah, Al-Hasan al-Basri and Sa'id\\n\\t\\t\\t\\tibn Jubayr (all of them quoted by Tabari, Baghawi and Ibn\\n\\t\\t\\t\\tKathir) - relate the pronoun to the Qur'an, and\\n\\t\\t\\t\\tunderstand the phrase in the sense adopted in my\\n\\t\\t\\t\\trendering. The specific mention of the Last Hour in the\\n\\t\\t\\t\\tabove context is meant to stress man's ultimate\\n\\t\\t\\t\\tresponsibility before the Creator and, therefore, the\\n\\t\\t\\t\\tfact that worship is due to Him alone: and so this\\n\\t\\t\\t\\tparenthetic passage follows logically upon the mention of\\n\\t\\t\\t\\tthe false deification of Jesus."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "63",
    "NoteID": "49",
    "Body": "I.e., with divine revelation."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "63",
    "NoteID": "50",
    "Body": "According to Tabari, the restrictive allusion to \"some of\\n\\t\\t\\t\\tthat . . .\", etc., bears on the realm of faith and morals\\n\\t\\t\\t\\talone, since it was not a part of Jesus' mission to deal\\n\\t\\t\\t\\twith problems of his people's worldly life. This\\n\\t\\t\\t\\tobservation coincides with the image of Jesus forthcoming\\n\\t\\t\\t\\tfrom the (admittedly fragmentary) description of his\\n\\t\\t\\t\\tteachings available to us in the Synoptic Gospels."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "65",
    "NoteID": "51",
    "Body": "Sc., regarding the nature of Jesus and the\\n\\t\\t\\t\\tinadmissibility of worshipping anyone but God: an\\n\\t\\t\\t\\tallusion to subsequent developments in Christianity."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "67",
    "NoteID": "52",
    "Body": "I.e., they will hate one another - those who realize that\\n\\t\\t\\t\\tthey have been led astray by their erstwhile friends, and\\n\\t\\t\\t\\tthe latter, because they see that they will be held\\n\\t\\t\\t\\tresponsible for the sins of those whom they have led\\n\\t\\t\\t\\tastray."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "74",
    "NoteID": "53",
    "Body": "I.e., for an unspecified period: see the last paragraph\\n\\t\\t\\t\\tof  6:128  and the corresponding note [114], as well as\\n\\t\\t\\t\\tthe saying of the Prophet quoted in note [10] on  40:12 ,\\n\\t\\t\\t\\tindicating that - in accordance with the Qur'anic\\n\\t\\t\\t\\tstatement, \"God has willed upon Himself the law of grace\\n\\t\\t\\t\\tand mercy\" ( 6:12  and {54}) - the otherworldly suffering\\n\\t\\t\\t\\tdescribed as \"hell\" will not be of unlimited duration.\\n\\t\\t\\t\\tAmong the theologians who hold this view is Razi, who\\n\\t\\t\\t\\tstresses in his comments on the above passage that the\\n\\t\\t\\t\\texpression \"they shall abide (khalidun) in the suffering\\n\\t\\t\\t\\tof hell\" indicates only an indeterminate duration, but\\n\\t\\t\\t\\t\"does not convey the meaning of perpetuity\" (la yafidu 'd\\n\\t\\t\\t\\t-dawam)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "78",
    "NoteID": "54",
    "Body": "As is evident from verses {81} ff. above, this is a\\n\\t\\t\\t\\treference to the truth of God's oneness and uniqueness,\\n\\t\\t\\t\\twhich those who believe in Jesus as \"the son of God\"\\n\\t\\t\\t\\trefuse, as it were, to acknowledge: thus, the discourse\\n\\t\\t\\t\\treturns here to the question of the \"nature\" of Jesus\\n\\t\\t\\t\\ttouched upon in verses {57-65}."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "79",
    "NoteID": "55",
    "Body": "The verb barama or abrama signifies, literally, \"he\\n\\t\\t\\t\\ttwined\" or \"twisted [something] together\", e.g., the\\n\\t\\t\\t\\tstrands that are to form a rope; or \"he twisted\\n\\t\\t\\t\\t[something] well\" or \"strongly\". Tropically, it connotes\\n\\t\\t\\t\\tthe act of \"establishing\" or \"determining\" a thing, a\\n\\t\\t\\t\\tproposition, a course of events, etc. (Jawhari).\\n\\t\\t\\t\\tAccording to the Lisan a -'Arab, the phrase abrama al-amr\\n\\t\\t\\t\\thas the meaning of \"he determined (ahkama) the case\". In\\n\\t\\t\\t\\tthe present context, the term amr, having no definite\\n\\t\\t\\t\\tarticle, signifies \"anything\" or - in its widest sense -\\n\\t\\t\\t\\t\"anything that should [or \"could\"] be\": and so, taking\\n\\t\\t\\t\\tthe preceding verse into account, we arrive at the\\n\\t\\t\\t\\tmeaning of arbitrarily \"determining what [the truth]\\n\\t\\t\\t\\tshould be\" - i.e., in contradiction to what the Qur'an\\n\\t\\t\\t\\tpostulates as the truth."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "80",
    "NoteID": "56",
    "Body": "This is most probably an allusion to the centuries-long\\n\\t\\t\\t\\tsubtle Christian controversies on the question as to\\n\\t\\t\\t\\twhether or not Jesus was \"the son of God\" and, hence,\\n\\t\\t\\t\\tdivine. These controversies were often influenced by a\\n\\t\\t\\t\\tsubconscious leaning of some of the early Christian\\n\\t\\t\\t\\tthinkers towards ancient, mostly Mithraistic, cults and\\n\\t\\t\\t\\tconcepts which were in the beginning strongly opposed by\\n\\t\\t\\t\\tunitarian theologians, foremost among them Arius,\\n\\t\\t\\t\\tPatriarch of Alexandria (about 280-336 C.E.). However, at\\n\\t\\t\\t\\tthe politically-motivated Council of Nicaea (325 C.E.),\\n\\t\\t\\t\\tthe Arian views - which until then had been shared by the\\n\\t\\t\\t\\toverwhelming majority of articulate Christians - were\\n\\t\\t\\t\\tcondemned as \"heretical\", and the doctrine of Christ's\\n\\t\\t\\t\\tdivinity was officially formulated in the so-called\\n\\t\\t\\t\\tNicene Creed as the basis of Christian beliefs. (See also\\n\\t\\t\\t\\tnote [60] below)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "80",
    "NoteID": "57",
    "Body": "Lit., \"Our messengers\", i.e., angels."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "82",
    "NoteID": "58",
    "Body": "Cf. the last clause of surah {9} and the corresponding\\n\\t\\t\\t\\tnote [171]."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "82",
    "NoteID": "59",
    "Body": "See note [88] on the last sentence of  6:100 ."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "83",
    "NoteID": "60",
    "Body": "Evidently an allusion to the verbal subtleties of the\\n\\t\\t\\t\\tNicene Creed, and particularly the statement, \"Jesus\\n\\t\\t\\t\\tChrist, the Son of God, begotten, not made [i.e., not\\n\\t\\t\\t\\tcreated], by the Father as His only Son, of the same\\n\\t\\t\\t\\tsubstance as the Father, God of God ...\", etc."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "86",
    "NoteID": "61",
    "Body": "A reference to falsely deified saints or prophets and,\\n\\t\\t\\t\\tparticularly (in view of the context), to Jesus."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "86",
    "NoteID": "62",
    "Body": "For an explanation of the Qur'anic concept of\\n\\t\\t\\t\\t\"intercession\", see  10:3  - \"There is none that could\\n\\t\\t\\t\\tintercede with Him unless He grants leave therefor\" -\\n\\t\\t\\t\\tand the corresponding note [7]. - My interpolation, at\\n\\t\\t\\t\\tthe end of the above verse, of the words \"that God is one\\n\\t\\t\\t\\tand unique\" is based on Razi's interpretation of this\\n\\t\\t\\t\\tpassage, implying that a mere oral \"bearing witness to\\n\\t\\t\\t\\tthe truth\" is useless if it is not the outcome of an\\n\\t\\t\\t\\tinner awareness of God's oneness and uniqueness."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "88",
    "NoteID": "63",
    "Body": "Razi (on whose commentary the above interpolation is\\n\\t\\t\\t\\tbased), regards this as a reference to the Prophet\\n\\t\\t\\t\\tMuhammad. It seems, however, that the meaning is wider,\\n\\t\\t\\t\\tembracing every believer, of whatever denomination, who\\n\\t\\t\\t\\tis distressed at the blindness of people who attribute\\n\\t\\t\\t\\tdivinity or divine qualities to any being other than God\\n\\t\\t\\t\\tHimself."
  }
]
