[
  {
    "SurahNumber": "73",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "The expression muzzammil has a meaning similar to that of\\n\\t\\t\\t\\tmuddaththir, which occurs at the beginning of the next\\n\\t\\t\\t\\tsurah: namely, \"one who is covered [with anything]\",\\n\\t\\t\\t\\t\"enwrapped\" or \"enfolded [in anything]\"; and, like that\\n\\t\\t\\t\\tother expression, it may be understood in a concrete,\\n\\t\\t\\t\\tliteral sense - i.e., \"wrapped up in a cloak\" or\\n\\t\\t\\t\\t\"blanket\" - as well as metaphorically, i.e., \"wrapped up\\n\\t\\t\\t\\tin sleep\" or even \"wrapped up in oneself\". Hence, the\\n\\t\\t\\t\\tcommentators differ widely in their interpretations of\\n\\t\\t\\t\\tthe above apostrophe, some of them preferring the literal\\n\\t\\t\\t\\tconnotation, others the metaphorical; but there is no\\n\\t\\t\\t\\tdoubt that irrespective of the linguistic sense in which\\n\\t\\t\\t\\tthe address \"O thou enwrapped one\" is understood, it\\n\\t\\t\\t\\timplies a call to heightened consciousness and deeper\\n\\t\\t\\t\\tspiritual awareness on the part of the Prophet."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Thus Zamakhshari, relating the phrase illa qalilan (\"all\\n\\t\\t\\t\\tbut a small part\" to the subsequent word nisfahu\\n\\t\\t\\t\\t(\"one-half thereof\", i.e., of the night)."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "This, I believe, is the closest possible rendering of the\\n\\t\\t\\t\\tphrase rattil al-qur'ana tartilan. The term tarts\\n\\t\\t\\t\\tprimarily denotes \"the putting [of something] together\\n\\t\\t\\t\\tdistinctly, in a well-arranged manner, and without any\\n\\t\\t\\t\\thaste\" (Jawhari, Baydawi; also Lisan al-'Arab, Qamus).\\n\\t\\t\\t\\tWhen applied to the recitation of a text, it signifies a\\n\\t\\t\\t\\tcalm, measured utterance with thoughtful consideration of\\n\\t\\t\\t\\tthe meaning to be brought out. A somewhat different\\n\\t\\t\\t\\tsignificance attaches to a variant of this phrase in\\n\\t\\t\\t\\t 25:32 , applying to the manner in which the Qur'an was\\n\\t\\t\\t\\trevealed."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "6",
    "NoteID": "4",
    "Body": "Lit., \"are strongest of tread and most upright of\\n\\t\\t\\t\\tspeech\"."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "9",
    "NoteID": "5",
    "Body": "For this rendering of the term wakil, see surah {17},\\n\\t\\t\\t\\tnote [4]."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "11",
    "NoteID": "6",
    "Body": "Cf.  74:11  and the last sentence of the corresponding\\n\\t\\t\\t\\tnote [5]."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "13",
    "NoteID": "7",
    "Body": "Explaining this symbolism of torment in the hereafter,\\n\\t\\t\\t\\tRazi says: \"These four conditions may well be understood\\n\\t\\t\\t\\tas denoting the spiritual consequences [of one's doings\\n\\t\\t\\t\\tin life]. As regards the 'heavy fetters', they are a\\n\\t\\t\\t\\tsymbol of the soul's remaining shackled to its\\n\\t\\t\\t\\t[erstwhile] physical attachments and bodily pleasures...:\\n\\t\\t\\t\\tand now that their realization has become impossible,\\n\\t\\t\\t\\tthose fetters and shackles prevent the [resurrected]\\n\\t\\t\\t\\thuman personality (an-nafs) from attaining to the realm\\n\\t\\t\\t\\tof the spirit and of purity. Subsequently, those\\n\\t\\t\\t\\tspiritual shackles generate spiritual 'fires', inasmuch\\n\\t\\t\\t\\tas one's strong inclination towards bodily concerns,\\n\\t\\t\\t\\ttogether with the impossibility of attaining to them,\\n\\t\\t\\t\\tgive rise, spiritually, to [a sensation of] severe\\n\\t\\t\\t\\tburning...: and this is [the meaning of] 'the blazing\\n\\t\\t\\t\\tfire' (al-jahim). Thereupon [the sinner] tries to swallow\\n\\t\\t\\t\\tthe choking agony of deprivation and the pain of\\n\\t\\t\\t\\tseparation [from the objects of his desire]: and this is\\n\\t\\t\\t\\tthe meaning of the words, 'and food that chokes'. And\\n\\t\\t\\t\\tfinally, because of these circumstances, he remains\\n\\t\\t\\t\\tdeprived of all illumination by the light of God, and of\\n\\t\\t\\t\\tall communion with the blessed ones: and this is the\\n\\t\\t\\t\\tmeaning of the words 'and grievous suffering'....But\\n\\t\\t\\t\\t[withal,] know that I do not claim to have exhausted the\\n\\t\\t\\t\\tmeaning of these [Qur'an-] verses by what I have stated\\n\\t\\t\\t\\t[above]....\""
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "14",
    "NoteID": "8",
    "Body": "See the first part of  14:48 , and the corresponding note\\n\\t\\t\\t\\t[63], as well as note [90] on {20:105-107}."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "15",
    "NoteID": "9",
    "Body": "This is probably the oldest Qur'anic reference to the\\n\\t\\t\\t\\tearlier prophets, to the historic continuity in mankind's\\n\\t\\t\\t\\treligious experience, and, by implication, to the fact\\n\\t\\t\\t\\tthat the Qur'an does not institute a \"new\" faith but\\n\\t\\t\\t\\trepresents only the final, most comprehensive statement\\n\\t\\t\\t\\tof a religious principle as old as mankind itself:\\n\\t\\t\\t\\tnamely, that \"in the sight of God, the only [true]\\n\\t\\t\\t\\treligion is [man's] self-surrender unto Him\"  3:19 , and\\n\\t\\t\\t\\tthat \"if one goes in search of a religion other than\\n\\t\\t\\t\\tself-surrender unto God, it will never be accepted from\\n\\t\\t\\t\\thim\"  3:85 ."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "17",
    "NoteID": "10",
    "Body": "In ancient Arabian usage, a day full of terrifying events\\n\\t\\t\\t\\twas described metaphorically as \"a day on which the locks\\n\\t\\t\\t\\tof children turn grey\"; hence the use of this phrase in\\n\\t\\t\\t\\tthe Qur'an. Its purely metaphorical character is obvious\\n\\t\\t\\t\\tsince, according to the teachings of the Qur'an, children\\n\\t\\t\\t\\tare considered sinless - i.e., not accountable for their\\n\\t\\t\\t\\tdoings - and will, therefore, remain untouched by the\\n\\t\\t\\t\\tordeals and terrors of the Day of Judgment (Razi)."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "11",
    "Body": "Lit, \"of those who are with thee\". With this concluding\\n\\t\\t\\t\\tpassage, the discourse returns to the theme of the\\n\\t\\t\\t\\topening verses, namely, the great spiritual value of\\n\\t\\t\\t\\tpraying at night."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "12",
    "Body": "Lit., \"count it\", i.e., the length of your vigil."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "13",
    "Body": "This reference to \"fighting in God's cause\" has induced\\n\\t\\t\\t\\tmany commentators to assume that the whole of verse {20}\\n\\t\\t\\t\\twas revealed at Medina, that is, years after the rest of\\n\\t\\t\\t\\tthe surah: for, the principle of \"fighting in God's\\n\\t\\t\\t\\tcause\" (jihad) was introduced only after the Prophet's\\n\\t\\t\\t\\thijrah from Mecca to Medina. This assumption must,\\n\\t\\t\\t\\thowever, be dismissed as unwarranted. Although there is\\n\\t\\t\\t\\tno doubt that jihad was first sanctioned during the\\n\\t\\t\\t\\tMedina period, the sentence in question is clearly\\n\\t\\t\\t\\texpressed in the future tense: \"in time there will be\"\\n\\t\\t\\t\\t(sayakun) - and must, therefore, as Ibn Rathir points\\n\\t\\t\\t\\tout, be understood as a prediction of future\\n\\t\\t\\t\\tcircumstances. With all this, the above passage stresses\\n\\t\\t\\t\\tthe necessity of avoiding all exaggeration even in one's\\n\\t\\t\\t\\tdevotions."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "NoteID": "14",
    "Body": "For an explanation of the term zakah - of which the above\\n\\t\\t\\t\\tis the earliest Qur'anic instance see surah {2}, note\\n\\t\\t\\t\\t[34]."
  }
]
