[
  {
    "SurahNumber": "16",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Regarding this allusion to the incredulous inquiry of the\\n\\t\\t\\t\\tunbelievers, see {6:57-58},  8:32  and {10:50-51}, as\\n\\t\\t\\t\\twell as the corresponding notes."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "The term ruh (lit., \"spirit\", \"soul\" or \"breath of life\")\\n\\t\\t\\t\\tis often used in the Qur'an in the sense of \"inspiration\"\\n\\t\\t\\t\\t- and, more particularly, \"divine inspiration\" - since,\\n\\t\\t\\t\\tas Zamakhshari points out in connection with the above\\n\\t\\t\\t\\tverse as well as with the first sentence of  42:52 , \"it\\n\\t\\t\\t\\tgives life to hearts that were [as] dead in their\\n\\t\\t\\t\\tignorance, and has in religion the same function as a\\n\\t\\t\\t\\tsoul has in a body\". A very similar explanation is given\\n\\t\\t\\t\\tby Razi in the same context. The earliest instance in\\n\\t\\t\\t\\twhich the term ruh has been used in this particular sense\\n\\t\\t\\t\\tis  97:4 ."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "I.e., in accordance with a meaning and a purpose known\\n\\t\\t\\t\\tonly to Him. See also  10:5  and, in particular, the\\n\\t\\t\\t\\tcorresponding note [11]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "This repetition of part of verse {1} is meant to stress\\n\\t\\t\\t\\tthe uniqueness of God's creative powers."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "Lit., \"he becomes an open contender in argument\\n\\t\\t\\t\\t(khasim)\". According to Zamakhshari and Razi, the above\\n\\t\\t\\t\\tphrase is liable to two interpretations. In the words of\\n\\t\\t\\t\\tZamakhshari, \"one interpretation is that after having\\n\\t\\t\\t\\tbeen a [mere] drop of sperm, a particle of matter without\\n\\t\\t\\t\\tconsciousness or motion, man becomes highly articulate\\n\\t\\t\\t\\t(mintiq), able to argue on his own [for or against a\\n\\t\\t\\t\\tproposition], courageously facing disputes, and clearly\\n\\t\\t\\t\\tformulating his arguments: [and herein lies] an\\n\\t\\t\\t\\tindication of God's creative power. The other\\n\\t\\t\\t\\t[interpretation] is that man is [prone to become] a\\n\\t\\t\\t\\tcontender in argument against his Sustainer, refusing to\\n\\t\\t\\t\\tacknowledge his [very] Creator.\" Razi, on his part, gives\\n\\t\\t\\t\\this unqualified support to the first of these two\\n\\t\\t\\t\\tinterpretations, \"because the above verses are meant to\\n\\t\\t\\t\\tstress the evidence of the existence of a wise Creator,\\n\\t\\t\\t\\tand not the fact of men's insolence and their proneness\\n\\t\\t\\t\\tto blasphemy and ingratitude\". However, in view of\\n\\t\\t\\t\\t{36:77-78} (revealed at a considerably earlier period), I\\n\\t\\t\\t\\tam of the opinion that the above two interpretations are\\n\\t\\t\\t\\tnot mutually exclusive but, rather, complementary,\\n\\t\\t\\t\\tinasmuch as this passage is meant to bring out man's\\n\\t\\t\\t\\tunique quality as a rational being - a quality that may\\n\\t\\t\\t\\tlead him to great heights of achievement, but may equally\\n\\t\\t\\t\\twell lead him utterly astray: hence my free rendering of\\n\\t\\t\\t\\tthis profound, elliptic phrase."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "The use, in this context, of the term yakhluqu implies\\n\\t\\t\\t\\tthe future tense (\"He will create\") in contrast with the\\n\\t\\t\\t\\tpast tense khalaqa employed in the preceding passages.\\n\\t\\t\\t\\tSince this reference to God's continuing creation comes\\n\\t\\t\\t\\timmediately after a mention of primitive means of\\n\\t\\t\\t\\ttransport (i.e. of animals domesticated by man to this\\n\\t\\t\\t\\tend), it obviously relates to other - as yet unknown -\\n\\t\\t\\t\\tthings of the same category: that is to say, to new means\\n\\t\\t\\t\\tof transport which God unceasingly creates through the\\n\\t\\t\\t\\tinstrumentality of the inventiveness with which He has\\n\\t\\t\\t\\tendowed man's mind (cf.  36:42 ). Inasmuch as every\\n\\t\\t\\t\\tsuccessive stage of human development bears witness to\\n\\t\\t\\t\\tnew, previously undreamt-of inventions in the realm of\\n\\t\\t\\t\\ttransport, the Qur'anic statement that \"He will yet\\n\\t\\t\\t\\tcreate things of which [today] you have no knowledge\" is\\n\\t\\t\\t\\tvalid for every period - past, present and future - of\\n\\t\\t\\t\\tman's history."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "Lit., \"upon God rests the [showing of the] goal of the\\n\\t\\t\\t\\tpath\" - i.e., the establishing of the goals of ethics and\\n\\t\\t\\t\\tmorality implied in the concept of the \"right path\". In\\n\\t\\t\\t\\tfurther analysis of this phrase, the expression \"it rests\\n\\t\\t\\t\\tupon God\" ('ala 'llah) is similar in intent to the\\n\\t\\t\\t\\tstatement in  6:12  and {54} that He \"has willed upon\\n\\t\\t\\t\\tHimself the law of grace and mercy\": in other words, God\\n\\t\\t\\t\\tinvariably shows the right path to everyone who is\\n\\t\\t\\t\\twilling to follow it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "Since the concept of morality is linked with man's\\n\\t\\t\\t\\tGod-given freedom of choice between good and evil, God\\n\\t\\t\\t\\tdoes not \"impose\" His guidance upon man but leaves it to\\n\\t\\t\\t\\thim to accept or reject it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "12",
    "NoteID": "9",
    "Body": "See  14:33  and the corresponding note [46]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "14",
    "NoteID": "10",
    "Body": "Lit., \"thou seest\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "15",
    "NoteID": "11",
    "Body": "This is apparently an allusion to the fact that the\\n\\t\\t\\t\\tmountains owe their rise to the gradual balancing process\\n\\t\\t\\t\\tto which the solid crust of the earth is subject - a\\n\\t\\t\\t\\tprocess which, in its turn, is the result of stresses and\\n\\t\\t\\t\\tdisturbances due to the cooling and hardening,\\n\\t\\t\\t\\tprogressing from the surface towards the centre, of the\\n\\t\\t\\t\\tpresumably molten or perhaps even gaseous matter of which\\n\\t\\t\\t\\tthe earth's interior seems to be composed. It appears\\n\\t\\t\\t\\tthat part of this interior is kept solid only by the\\n\\t\\t\\t\\tenormous pressure of the overlaying material, of which\\n\\t\\t\\t\\tthe mountains are the most vivid evidence: and this\\n\\t\\t\\t\\texplains the Qur'anic reference (in  78:7 ) to mountains\\n\\t\\t\\t\\tas \"pegs\" (awtad), i.e. symbols of the firmness and\\n\\t\\t\\t\\trelative equilibrium which the surface of the earth has\\n\\t\\t\\t\\tgradually achieved in the course of its geological\\n\\t\\t\\t\\thistory. Notwithstanding the fact that this equilibrium\\n\\t\\t\\t\\tis not absolute (as is evidenced by earthquakes and\\n\\t\\t\\t\\tvolcanic eruptions), it is the solidity of the earth's\\n\\t\\t\\t\\tcrust - as contrasted with its possibly fluid but\\n\\t\\t\\t\\tcertainly very unstable interior - which makes life on\\n\\t\\t\\t\\tearth possible: and this, to my mind, is the meaning of\\n\\t\\t\\t\\tthe phrase \"lest it sway with you\" (or \"with them\")\\n\\t\\t\\t\\toccurring in the above verse as well as in  21:31  and\\n\\t\\t\\t\\t 31:10 ."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "16",
    "NoteID": "12",
    "Body": "Lit., \"they find their way\". This passage rounds off the\\n\\t\\t\\t\\tpreceding description of God's favours to man by\\n\\t\\t\\t\\treturning, in a subtle manner, to the theme introduced in\\n\\t\\t\\t\\tverse {4} and alluded to, indirectly, in the last\\n\\t\\t\\t\\tsentence of verse {8} as well as in verse {14}: namely,\\n\\t\\t\\t\\tthe consideration of man's intellectual potential - the\\n\\t\\t\\t\\tgreatest of all the gifts bestowed upon him by God. (See\\n\\t\\t\\t\\tin this connection note [5] above, as well as the\\n\\t\\t\\t\\tallegory of the creation of man enunciated in {2:30-33}.)"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "20",
    "NoteID": "13",
    "Body": "Lit., \"those whom they invoke\": this refers - as is\\n\\t\\t\\t\\tobvious from verse {21} below - to dead saints invested\\n\\t\\t\\t\\tby their followers with divine or semi-divine qualities."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "21",
    "NoteID": "14",
    "Body": "Cf. {7:191-194}."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "22",
    "NoteID": "15",
    "Body": "I.e., they are too arrogant to accept the idea of man's\\n\\t\\t\\t\\tutter dependence on, and responsibility to, a Supreme\\n\\t\\t\\t\\tBeing."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "24",
    "NoteID": "16",
    "Body": "Sc., \"and not divine revelations\" (cf.  8:21 )."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "25",
    "NoteID": "17",
    "Body": "The conjunction li prefixed to the verb yahmilu (\"they\\n\\t\\t\\t\\tshall carry\") has here obviously - as pointed out by Razi\\n\\t\\t\\t\\t- the function of what the grammarians call a lam\\n\\t\\t\\t\\tal-'aqibah, indicating no more than a causal sequence\\n\\t\\t\\t\\t('aqibah); it may be appropriately rendered by means of\\n\\t\\t\\t\\tthe conjunctive particle \"and\" or - as in this context-\\n\\t\\t\\t\\tby the adverb \"hence\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "25",
    "NoteID": "18",
    "Body": "Lit., \"those whom they are leading astray without\\n\\t\\t\\t\\tknowledge\" - i.e., without knowledge or understanding on\\n\\t\\t\\t\\tthe latters' part (Zamakhshari)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "26",
    "NoteID": "19",
    "Body": "Lit., \"schemed\" (makara): i.e., they blasphemed by\\n\\t\\t\\t\\tdescribing the divine revelations as \"fables of ancient\\n\\t\\t\\t\\ttimes\" and by refusing to admit the truth of God's\\n\\t\\t\\t\\texistence or of His oneness and uniqueness."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "26",
    "NoteID": "20",
    "Body": "Lit., \"their building\" (see next note)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "26",
    "NoteID": "21",
    "Body": "This is obviously a metaphor (Razi) describing the utter\\n\\t\\t\\t\\tcollapse of all endeavours - both individual and\\n\\t\\t\\t\\tsocial - rooted in godlessness and false pride."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "27",
    "NoteID": "22",
    "Body": "I.e., finally and utterly - for, \"only on the Day of\\n\\t\\t\\t\\tResurrection will you be requited in full for whatever\\n\\t\\t\\t\\tyou have done\" ( 3:185 ). Since the pronoun \"them\" refers\\n\\t\\t\\t\\tnot only to the earlier sinners mentioned parenthetically\\n\\t\\t\\t\\tin the preceding verse but also to those spoken of in\\n\\t\\t\\t\\tverses {22-25}, I have interpolated the word \"all\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "27",
    "NoteID": "23",
    "Body": "Lit., \"those [alleged] partners of Mine\". Regarding the\\n\\t\\t\\t\\tQur'anic use of the term sharik (pl. shuraka') in\\n\\t\\t\\t\\tconnection with religious beliefs, see surah {6}, note\\n\\t\\t\\t\\t[15]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "27",
    "NoteID": "24",
    "Body": "Or: \"you were wont to contend [against My guidance]\". See\\n\\t\\t\\t\\tin this connection surah {8}, note [16]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "27",
    "NoteID": "25",
    "Body": "I.e., those who had availed themselves of the knowledge\\n\\t\\t\\t\\tof good and evil which God offers to mankind through His\\n\\t\\t\\t\\tprophets."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "28",
    "NoteID": "26",
    "Body": "Cf.  6:23  and the corresponding note, as well as  2:11 ."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "28",
    "NoteID": "27",
    "Body": "Sc., \"and He will judge you on the basis of your\\n\\t\\t\\t\\tmotivation\" - implying that their plea of ignorance is\\n\\t\\t\\t\\trejected in view of the fact that they were offered God's\\n\\t\\t\\t\\tguidance through His revealed messages, which they\\n\\t\\t\\t\\tdeliberately scorned in their false pride and dismissed\\n\\t\\t\\t\\tout of hand as \"fables of ancient times\" (see verses\\n\\t\\t\\t\\t{22-24} above)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "30",
    "NoteID": "28",
    "Body": "This \"good fortune\" (hasanah) does not necessarily\\n\\t\\t\\t\\tsignify, in this context, material benefits but refers,\\n\\t\\t\\t\\trather, to the spiritual satisfaction and the feeling of\\n\\t\\t\\t\\tinner security resulting from genuine God-consciousness."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "33",
    "NoteID": "29",
    "Body": "Lit., \"for the angels to come to them, or for God's\\n\\t\\t\\t\\tjudgment (amr) to come\" - i.e., for the Day of\\n\\t\\t\\t\\tResurrection. The full meaning of this passage is\\n\\t\\t\\t\\tforthcoming from  6:158 , revealed at the same period as\\n\\t\\t\\t\\tthe present surah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "34",
    "NoteID": "30",
    "Body": "See  6:10  and the corresponding note. Similar phrases\\n\\t\\t\\t\\toccur in many places in the Qur'an, always with reference\\n\\t\\t\\t\\tto a derision of divine messages and, particularly, of\\n\\t\\t\\t\\tpredictions relating to God's chastisement of reprobate\\n\\t\\t\\t\\tsinners. As so often, the Qur'an points out here that\\n\\t\\t\\t\\tthis \"chastisement\" or \"suffering\" ('adhab) is but a\\n\\t\\t\\t\\tnatural, unavoidable consequence of deliberate\\n\\t\\t\\t\\twrongdoing: hence, he who becomes guilty of it is, in\\n\\t\\t\\t\\treality, \"doing wrong to himself\" or \"sinning against\\n\\t\\t\\t\\thimself\" inasmuch as he destroys his own spiritual\\n\\t\\t\\t\\tintegrity and must subsequently suffer for it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "35",
    "NoteID": "31",
    "Body": "Lit., \"apart from Him\". See in this connection  6:148 \\n\\t\\t\\t\\tand the corresponding note [141]. (The arbitrary,\\n\\t\\t\\t\\tunwarranted prohibitions and taboos alluded to in that\\n\\t\\t\\t\\tverse as well as in the present one are discussed in\\n\\t\\t\\t\\t{6:136-153} and explained in my notes.) The derision of\\n\\t\\t\\t\\tGod's messages by the deniers of the truth is implied in\\n\\t\\t\\t\\ttheir questioning His grant of free will to man - that is\\n\\t\\t\\t\\tto say, the ability to choose between right and wrong,\\n\\t\\t\\t\\twhich is the basis of all morality."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "35",
    "NoteID": "32",
    "Body": "I.e., the apostles could not force anyone to make the\\n\\t\\t\\t\\tright choice."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "36",
    "NoteID": "33",
    "Body": "Or \"at every period\", since the term ummah has this\\n\\t\\t\\t\\tsignificance as well. In its wider sense, it may also be\\n\\t\\t\\t\\ttaken here to denote \"civilization\", thus comprising a\\n\\t\\t\\t\\thuman groupment as well as a period of time."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "36",
    "NoteID": "34",
    "Body": "For this rendering of the term at-taghut, see surah {2},\\n\\t\\t\\t\\tnote [250]. It is to be borne in mind that, in Qur'anic\\n\\t\\t\\t\\tterminology, \"worship of God\" invariably implies the\\n\\t\\t\\t\\tconcept of man's sense of responsibility before Him:\\n\\t\\t\\t\\thence, the above commandment comprises, in the most\\n\\t\\t\\t\\tconcise formulation imaginable, the sum-total of all\\n\\t\\t\\t\\tethical injunctions and prohibitions, and is the basis\\n\\t\\t\\t\\tand source of all morality as well as the one unchanging\\n\\t\\t\\t\\tmessage inherent in every true religion."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "36",
    "NoteID": "35",
    "Body": "I.e., who availed themselves of the guidance offered by\\n\\t\\t\\t\\tHim to all human beings."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "36",
    "NoteID": "36",
    "Body": "Lit., \"upon whom error came to be inevitably established\\n\\t\\t\\t\\t(haqqa 'alayhi)\" or \"against whom [a verdict of] error\\n\\t\\t\\t\\tbecame inevitable\": i.e., one whose heart \"God has\\n\\t\\t\\t\\tsealed\" in consequence of his persistent, conscious\\n\\t\\t\\t\\trefusal to submit to His guidance (see surah {2}, note\\n\\t\\t\\t\\t[7], as well as surah {14}, note [4])."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "37",
    "NoteID": "37",
    "Body": "See preceding note; also  8:55  and the corresponding\\n\\t\\t\\t\\tnote [58]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "38",
    "NoteID": "38",
    "Body": "Lit., \"And\" - but since this conjunction is obviously\\n\\t\\t\\t\\tmeant to elaborate the preceding statement, it is best\\n\\t\\t\\t\\trendered as above."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "38",
    "NoteID": "39",
    "Body": "This categorical denial of resurrection - implying as it\\n\\t\\t\\t\\tdoes a denial of God's ultimate judgment of good and evil\\n\\t\\t\\t\\t- is characteristic of a mental attitude which refuses to\\n\\t\\t\\t\\tadmit the reality, or even possibility, of anything that\\n\\t\\t\\t\\tlies beyond the range of man's actual or potential\\n\\t\\t\\t\\tobservation. Since such an attitude is an outcome of an\\n\\t\\t\\t\\tintrinsically materialistic outlook on life and the\\n\\t\\t\\t\\t\"false pride\" referred to in verses {22-23} above, it is\\n\\t\\t\\t\\tanti-religious in the deepest sense of this word even if\\n\\t\\t\\t\\tit is accompanied by a vague - because non-consequential\\n\\t\\t\\t\\t- belief in the existence of God."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "39",
    "NoteID": "40",
    "Body": "I.e., in the first instance, the truth of resurrection\\n\\t\\t\\t\\tand judgment as such, and, in general, the final answers\\n\\t\\t\\t\\tto all the metaphysical problems which perplex man during\\n\\t\\t\\t\\this life on earth."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "41",
    "NoteID": "41",
    "Body": "For an explanation of this rendering of alladhlna hajaru,\\n\\t\\t\\t\\tsee surah {2}, note [203], and surah {4} note [124]. That\\n\\t\\t\\t\\tthe \"forsaking of the domain of evil\" has here a purely\\n\\t\\t\\t\\tspiritual connotation is obvious from its juxtaposition\\n\\t\\t\\t\\twith the \"denial of the truth\" referred to in the\\n\\t\\t\\t\\tpreceding verses."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "41",
    "NoteID": "42",
    "Body": "See note [28] above."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "41",
    "NoteID": "43",
    "Body": "The verb 'alima, which primarily denotes \"he knew\", has\\n\\t\\t\\t\\talso the meaning of \"he came to know\", i.e., \"he\\n\\t\\t\\t\\tunderstood\"; and since - as pointed out by Baghawi,\\n\\t\\t\\t\\tZamakhshari and Razi - the pronoun \"they\" in the phrase\\n\\t\\t\\t\\tlaw kanu ya'lamun relates to the deniers of the truth\\n\\t\\t\\t\\tspoken of in the preceding passages, the rendering \"if\\n\\t\\t\\t\\tthey could but understand\" is here clearly indicated -\\n\\t\\t\\t\\tthe more so as it provides a self-evident connection with\\n\\t\\t\\t\\tthe subsequent, objective clause."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "42",
    "NoteID": "44",
    "Body": "I.e., if they could really understand the spiritual\\n\\t\\t\\t\\tmotivation of the believers, they (the deniers of the\\n\\t\\t\\t\\ttruth) would themselves begin to believe."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "43",
    "NoteID": "45",
    "Body": "This passage has a double purport: firstly, it connects\\n\\t\\t\\t\\twith the statement enunciated in verse {36} to the effect\\n\\t\\t\\t\\tthat God's apostles have appeared, at one time or\\n\\t\\t\\t\\tanother, within every civilization, and that,\\n\\t\\t\\t\\tconsequently, no substantial human groupment has ever\\n\\t\\t\\t\\tbeen left without divine guidance; secondly, it answers\\n\\t\\t\\t\\tthe objection frequently raised by unbelievers that\\n\\t\\t\\t\\tMuhammad could not be God's message-bearer since he was\\n\\t\\t\\t\\t\"a mere mortal man\". (As regards the Qur'anic doctrine\\n\\t\\t\\t\\tthat no created being, not even a prophet, has ever been\\n\\t\\t\\t\\tendowed with \"supernatural\" powers or qualities, see\\n\\t\\t\\t\\t 6:50  and  7:188 , as well as the notes relating to\\n\\t\\t\\t\\tthose verses; also note [94] on  6:109 .)"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "43",
    "NoteID": "46",
    "Body": "Lit., \"reminder\" - because every divine message is meant\\n\\t\\t\\t\\tto remind one of the truth. The people to be asked for\\n\\t\\t\\t\\tenlightenment in this respect are apparently the Jews and\\n\\t\\t\\t\\tthe Christians (Tabari, Zamakhshari)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "44",
    "NoteID": "47",
    "Body": "The above sentence is addressed, parenthetically, to all\\n\\t\\t\\t\\twho question the divine origin of the Qur'an on the\\n\\t\\t\\t\\tgrounds mentioned in note [45] above. For an explanation\\n\\t\\t\\t\\tof the term zubur (\"books of divine wisdom\"), see surah\\n\\t\\t\\t\\t{21}, note [101]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "44",
    "NoteID": "48",
    "Body": "Sc., \"through revelation\" - implying that moral values\\n\\t\\t\\t\\tare independent of all time-bound changes and must,\\n\\t\\t\\t\\ttherefore, be regarded as permanent."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "45",
    "NoteID": "49",
    "Body": "To my mind, by \"evil schemes\" are meant here systems of\\n\\t\\t\\t\\tGod-denying philosophy and of perverted morality."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "45",
    "NoteID": "50",
    "Body": "I.e., destroy them utterly."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "46",
    "NoteID": "51",
    "Body": "I.e., in the midst of their habitual occupations. My\\n\\t\\t\\t\\tinterpolation of the word \"suddenly\" is warranted by the\\n\\t\\t\\t\\treference, in the next verse, to the alternative of\\n\\t\\t\\t\\tgradual decay."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "47",
    "NoteID": "52",
    "Body": "One of the meanings of takhawwuf is \"gradual diminution\" or \"decay\" or \"slow destruction\" (Lisan al-'Arab, art. khawafa; thus also Tabari and Zamakhshari); in the above context, the term has obviously both a social and a moral connotation: a gradual disintegration of all ethical values, of power, of civic cohesion, of happiness and, finally, of life itself."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "47",
    "NoteID": "53",
    "Body": "Sc., \"seeing that He offers you guidance through His\\n\\t\\t\\t\\tprophets, and gives you time to reflect and mend your\\n\\t\\t\\t\\tways before you do irreparable harm to yourselves\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "48",
    "NoteID": "54",
    "Body": "In view of the separate mention, in the next verse, of\\n\\t\\t\\t\\tanimals and angels, the \"things\" referred to here\\n\\t\\t\\t\\tapparently denote inanimate objects and perhaps also\\n\\t\\t\\t\\tliving organisms like plants."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "48",
    "NoteID": "55",
    "Body": "Lit., \"and they are utterly lowly\" or \"submissive\". The\\n\\t\\t\\t\\t\"prostration\" referred to in this and the next verse is\\n\\t\\t\\t\\tobviously a symbolism expressing the intrinsic subjection\\n\\t\\t\\t\\tof all created beings and things to God's will. See also\\n\\t\\t\\t\\t 13:15  and the corresponding notes [33] and [34]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "49",
    "NoteID": "56",
    "Body": "I.e., the lowest as well as the highest. The term dabbah\\n\\t\\t\\t\\tdenotes any sentient, corporeal being capable of\\n\\t\\t\\t\\tspontaneous movement, and is contrasted here with the\\n\\t\\t\\t\\tnon\u001ecorporeal, spiritual beings designated as \"angels\"\\n\\t\\t\\t\\t(Razi)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "50",
    "NoteID": "57",
    "Body": "I.e., they must, by virtue of their nature, obey the\\n\\t\\t\\t\\timpulses implanted in them by God and are, therefore,\\n\\t\\t\\t\\tincapable of what is described as \"sinning\". Man,\\n\\t\\t\\t\\thowever, is fundamentally different in this respect. In\\n\\t\\t\\t\\tcontrast with the natural sinlessness of \"every beast\\n\\t\\t\\t\\tthat moves, and the angels\", man is endowed with free\\n\\t\\t\\t\\twill in the moral sense of this term: he can choose\\n\\t\\t\\t\\tbetween right and wrong - and therefore he can, and often\\n\\t\\t\\t\\tdoes, sin. But even while he sins he is subject to the\\n\\t\\t\\t\\tuniversal law of cause and effect instituted by God and\\n\\t\\t\\t\\treferred to in the Qur'an as sunnat Allah (\"God's way\"):\\n\\t\\t\\t\\thence the Qur'anic statement that \"before God prostrate\\n\\t\\t\\t\\tthemselves, willingly or unwillingly, all [things and\\n\\t\\t\\t\\tbeings] that are in the heavens and on earth\" ( 13:15 )."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "51",
    "NoteID": "58",
    "Body": "The double dual in ilahayn ithnayn (\"two deities\") serves\\n\\t\\t\\t\\tto emphasize the prohibition of worshipping \"more than\\n\\t\\t\\t\\tone deity\" - i.e., anything but the One God."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "51",
    "NoteID": "59",
    "Body": "This is a striking example of the fluctuation to which\\n\\t\\t\\t\\tpersonal pronouns are subjected in the Qur'an whenever\\n\\t\\t\\t\\tthey refer to God. As already pointed out in my Foreword,\\n\\t\\t\\t\\tnote [2], as well as in other places, such abrupt changes\\n\\t\\t\\t\\tof pronoun (\"He\", \"I\", \"We\", \"Us\", \"Me\", etc.) indicate\\n\\t\\t\\t\\tthat God is limitless and, therefore, beyond the range of\\n\\t\\t\\t\\tdefinition implied in the use of \"personal\" pronouns."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "53",
    "NoteID": "60",
    "Body": "Cf. {6:40-41}."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "54",
    "NoteID": "61",
    "Body": "Lit., \"associate [other powers] with their Sustainer\":\\n\\t\\t\\t\\ti.e., by attributing the change in their \"luck\" to what\\n\\t\\t\\t\\tthey regard as \"extraneous\" factors and influences, they\\n\\t\\t\\t\\tinvest the latter, as it were, with divine qualities and\\n\\t\\t\\t\\tpowers."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "56",
    "NoteID": "62",
    "Body": "According to most of the classical commentators, this\\n\\t\\t\\t\\trelates to the custom of the pagan Arabs - mentioned in\\n\\t\\t\\t\\t 6:136  - to dedicate a part of their agricultural\\n\\t\\t\\t\\tproduce and cattle to their deities; and because those\\n\\t\\t\\t\\tdeities were mere figments of imagination, they are\\n\\t\\t\\t\\tdescribed here as \"things of which they know nothing\".\\n\\t\\t\\t\\tHowever, as I have pointed out in note [120] on  6:136 ,\\n\\t\\t\\t\\tthe above statement bears a much wider, more general\\n\\t\\t\\t\\tmeaning: it connects directly with the three preceding\\n\\t\\t\\t\\tverses of this surah - namely, with the attribution of a\\n\\t\\t\\t\\tshare (nasib) in God's creativeness - and thus of a\\n\\t\\t\\t\\tdecisive influence on one's life - to \"causes\" or\\n\\t\\t\\t\\t\"powers\" other than Him. This view has also been advanced\\n\\t\\t\\t\\tby Razi (with a specific reference to astrological\\n\\t\\t\\t\\tspeculations) in the concluding sentence of his\\n\\t\\t\\t\\tcommentary on the above verse."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "57",
    "NoteID": "63",
    "Body": "The pre-Islamic Arabs believed that the goddesses Al-Lat,\\n\\t\\t\\t\\tAl-'Uzza and Manat (see note [13] on {53:19-20}), as well\\n\\t\\t\\t\\tas the angels, whom they conceived as females, were\\n\\t\\t\\t\\t\"God's daughters\". As against this, the Qur'an states\\n\\t\\t\\t\\tthat God is utterly remote from every imperfection\\n\\t\\t\\t\\t(subhanahu), complete in Himself, and therefore free from\\n\\t\\t\\t\\tthe incompleteness inherent in the concept of \"progeny\"\\n\\t\\t\\t\\tas an extension of one's own being (cf.  6:100  and the\\n\\t\\t\\t\\tcorresponding notes [87] and [88]). - This parenthetic\\n\\t\\t\\t\\tpassage, comprising verses {57-59}, is explained in note\\n\\t\\t\\t\\t[66] below."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "57",
    "NoteID": "64",
    "Body": "Namely, only male issue, because the pre-lslamic Arabs\\n\\t\\t\\t\\tregarded daughters as no more than a necessary evil."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "58",
    "NoteID": "65",
    "Body": "I.e., a tiding that should have been regarded as a happy\\n\\t\\t\\t\\tone, since the sex of the child ought to make no\\n\\t\\t\\t\\tdifference to parental love."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "59",
    "NoteID": "66",
    "Body": "I.e., either of these alternatives is evil: to keep the\\n\\t\\t\\t\\tchild as an object of perpetual contempt, or to bury it\\n\\t\\t\\t\\talive, as was frequently done by the pagan Arabs. - This\\n\\t\\t\\t\\tpassage, containing as it does an utter condemnation of\\n\\t\\t\\t\\tmen's attitude towards women in pre-Islamic Arabia, has -\\n\\t\\t\\t\\tas is always the case with Qur'anic references to\\n\\t\\t\\t\\thistorical events or customs - a meaning that goes far\\n\\t\\t\\t\\tbeyond this specific social phenomenon and the resulting\\n\\t\\t\\t\\tinfanticide. It would seem that the pivotal point of the\\n\\t\\t\\t\\twhole passage is the sentence, \"for themselves [they\\n\\t\\t\\t\\twould choose, if they could, only] what they desire\":\\n\\t\\t\\t\\tthat is to say, while they are only too ready to\\n\\t\\t\\t\\tassociate with God ideas which are repugnant to\\n\\t\\t\\t\\tthemselves (for instance, female progeny, which they\\n\\t\\t\\t\\tthemselves despise), they are unwilling to accept the\\n\\t\\t\\t\\tconcept of man's ultimate responsibility to Him, because\\n\\t\\t\\t\\tsuch a concept militates against their own hedonistic\\n\\t\\t\\t\\tinclinations by obliging them to impose a moral\\n\\t\\t\\t\\tdiscipline on themselves. And because they rebel against\\n\\t\\t\\t\\tthe idea of ultimate moral responsibility, they\\n\\t\\t\\t\\tinstinctively reject the idea of resurrection and of life\\n\\t\\t\\t\\tafter bodily death; and since they deny, by implication,\\n\\t\\t\\t\\tGod's power to resurrect the dead, they deny His\\n\\t\\t\\t\\tomnipotence and, consequently, begin to \"ascribe\\n\\t\\t\\t\\tdivinity\" - i.e., a genuinely causative function - to all\\n\\t\\t\\t\\tmanner of imaginary forces, beings or influences: and so,\\n\\t\\t\\t\\tby means of a parenthetic reference to pre-Islamic\\n\\t\\t\\t\\tArabian beliefs and customs, the discourse returns full\\n\\t\\t\\t\\tcircle to the concept of God's oneness, uniqueness and\\n\\t\\t\\t\\tomnipotence, around which the whole of the Qur'an\\n\\t\\t\\t\\trevolves."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "60",
    "NoteID": "67",
    "Body": "I.e., inasmuch as they deny, by implication, man's\\n\\t\\t\\t\\tultimate responsibility before God. According to\\n\\t\\t\\t\\tZamakhshari and Razi, the term mathal (lit., \"example\" or\\n\\t\\t\\t\\t\"parable\") has here and in the next clause the\\n\\t\\t\\t\\tconnotation of sifah (\"attribute\")."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "61",
    "NoteID": "68",
    "Body": "Or: \"known [only to Him]\" - i.e., the period of their\\n\\t\\t\\t\\tlives on earth, during which they may reflect and repent."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "61",
    "NoteID": "69",
    "Body": "For my rendering of sa'ah as \"a single moment\", see surah\\n\\t\\t\\t\\t{7}, note [26]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "62",
    "NoteID": "70",
    "Body": "I.e., \"daughters\" (see verses {57-59} above): but this\\n\\t\\t\\t\\talludes also, as Zamakhshari points out, to the\\n\\t\\t\\t\\tassociation with God of imaginary beings which allegedly\\n\\t\\t\\t\\thave a share in His power and thus nullify the concept of\\n\\t\\t\\t\\tHis uniqueness: in other words, while the people spoken\\n\\t\\t\\t\\tof here would hate to see their own legitimate spheres of\\n\\t\\t\\t\\tinfluence encroached upon and curtailed by rivals, they\\n\\t\\t\\t\\tdo not extend the same consideration to their idea of\\n\\t\\t\\t\\tGod."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "62",
    "NoteID": "71",
    "Body": "Lit., \"that theirs is the supreme good (al-husna)\" -\\n\\t\\t\\t\\ti.e., in the sight of God - because they regard their own\\n\\t\\t\\t\\treligious or anti-religious views, in spite of their\\n\\t\\t\\t\\tabsurdity, as good and true. This interpretation of\\n\\t\\t\\t\\tal-husna in the above context (mentioned, among others,\\n\\t\\t\\t\\tby Zamakhshari and Razi) connects logically with the\\n\\t\\t\\t\\tstatement in the next verse that \"Satan had made their\\n\\t\\t\\t\\town doings seem goodly to them\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "62",
    "NoteID": "72",
    "Body": "Lit., \"theirs [or \"their portion\"] will be the fire, and\\n\\t\\t\\t\\tthey will be abandoned\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "63",
    "NoteID": "73",
    "Body": "Or: \"He is their patron [or \"master\"] today\". It should\\n\\t\\t\\t\\tbe borne in mind that the noun wall is derived from the\\n\\t\\t\\t\\tverb waliya, which primarily signifies \"he was [or\\n\\t\\t\\t\\t\"became\"] close [or \"near\", i.e., to someone or\\n\\t\\t\\t\\tsomething]\". It is in this sense that the term wali is\\n\\t\\t\\t\\tused in the Our'an with reference to God's nearness to\\n\\t\\t\\t\\tthe believers (e.g., in  2:257  or  3:68 ), or their\\n\\t\\t\\t\\tnearness to God (see  10:62  and the corresponding note\\n\\t\\t\\t\\t[84]). Similarly, the \"powers of evil\" (at-taghut) are\\n\\t\\t\\t\\tspoken of in  2:257  as being \"near unto those who are\\n\\t\\t\\t\\tbent on denying the truth (alladhina kafaru)\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "65",
    "NoteID": "74",
    "Body": "As so often in the Qur'an, a reference to the spiritual\\n\\t\\t\\t\\tlife engendered by divine revelation is followed here by\\n\\t\\t\\t\\ta reference to the miracle of organic life as another\\n\\t\\t\\t\\tindication of God's creative activity."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "66",
    "NoteID": "75",
    "Body": "Milk - in itself a glandular secretion - is not necessary\\n\\t\\t\\t\\tfor the mother-animal's life (or, as it is here\\n\\t\\t\\t\\tmetonymically described, its \"blood\"); on the other hand,\\n\\t\\t\\t\\tit is not just something that the body eliminates as\\n\\t\\t\\t\\tbeing of no further use to its metabolism: hence it is\\n\\t\\t\\t\\treferred to as a substance \"between that which is to be\\n\\t\\t\\t\\teliminated [from the animal's body] and [its]\\n\\t\\t\\t\\tlife-blood\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "67",
    "NoteID": "76",
    "Body": "The term sakar (lit., \"wine\" or, generically,\\n\\t\\t\\t\\t\"intoxicants\") is contrasted here with rizq hasan\\n\\t\\t\\t\\t(\"wholesome sustenance\"), thus circumscribing both the\\n\\t\\t\\t\\tpositive and the negative properties and effects of\\n\\t\\t\\t\\talcohol. Although this surah was revealed about ten years\\n\\t\\t\\t\\tbefore the Qur'anic prohibition of intoxicants in\\n\\t\\t\\t\\t{5:90-91}, there is no doubt that their moral condemnation\\n\\t\\t\\t\\tis already implied in the above verse (Ibn 'Abbas, as\\n\\t\\t\\t\\tquoted by Tabari; also Razi)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "68",
    "NoteID": "77",
    "Body": "The expression \"He has inspired\" (awha) is meant to bring\\n\\t\\t\\t\\tout the wonderful quality of the instinct which enables\\n\\t\\t\\t\\tthe lowly insect to construct the geometrical masterpiece\\n\\t\\t\\t\\tof a honeycomb out of perfectly-proportioned hexagonal,\\n\\t\\t\\t\\tprismatic wax cells - a structure which is most\\n\\t\\t\\t\\teconomical, and therefore most rational, as regards space\\n\\t\\t\\t\\tand material. Together with the subsequently mentioned\\n\\t\\t\\t\\ttransmutation, in the bee's body, of plant juices into\\n\\t\\t\\t\\thoney, this provides a striking evidence of \"God's ways\"\\n\\t\\t\\t\\tmanifested in all nature."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "69",
    "NoteID": "78",
    "Body": "Lit., \"thy Sustainer's paths\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "70",
    "NoteID": "79",
    "Body": "Lit., \"is reduced to a most abject age, so that he knows\\n\\t\\t\\t\\tnothing after [having had] knowledge\": alluding to the\\n\\t\\t\\t\\torganic curve of man's growth, his acquisition of bodily\\n\\t\\t\\t\\tstrength, intelligence and experience, followed by\\n\\t\\t\\t\\tgradual decay and, in some cases, the utter helplessness\\n\\t\\t\\t\\tof senility, comparable to the helplessness of a new-born\\n\\t\\t\\t\\tchild. See also 22:5."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "71",
    "NoteID": "80",
    "Body": "The phrase \"to share their sustenance with...\", etc.,\\n\\t\\t\\t\\treads, literally, \"to turn over their sustenance to\". The\\n\\t\\t\\t\\texpression \"those whom their right hands possess\" (i.e.,\\n\\t\\t\\t\\t\"those whom they rightfully possess\") may relate either\\n\\t\\t\\t\\tto slaves taken captive in a war in God's cause (see\\n\\t\\t\\t\\tsurah {2}, notes [167] and [168], and surah {8}, note\\n\\t\\t\\t\\t[72]) or, metonymically, to all who are dependent on\\n\\t\\t\\t\\tothers for their livelihood and thus become the latters'\\n\\t\\t\\t\\tresponsibility. The placing of one's dependents on an\\n\\t\\t\\t\\tequal footing with oneself with regard to the basic\\n\\t\\t\\t\\tnecessities of life is a categorical demand of Islam;\\n\\t\\t\\t\\tthus, the Prophet said: \"They are your brethren, these\\n\\t\\t\\t\\tdependents of yours (khawalukum) whom God has placed\\n\\t\\t\\t\\tunder your authority [lit., \"under your hand\"]. Hence,\\n\\t\\t\\t\\twhoso has his brother under his authority shall give him\\n\\t\\t\\t\\tto eat of what he eats himself, and shall clothe him with\\n\\t\\t\\t\\twhat he clothes himself. And do not burden them with\\n\\t\\t\\t\\tanything that may be beyond their strength; but if you\\n\\t\\t\\t\\t[must] burden them, help them yourselves.\" (This\\n\\t\\t\\t\\tauthentic Tradition, recorded by Bukhari in several\\n\\t\\t\\t\\tvariants in his Sahih, appears in the compilations of\\n\\t\\t\\t\\tMuslim, Tirmidhi and Ibn Hanbal as well.) However, men\\n\\t\\t\\t\\toften fail to live up to this consciousness of moral\\n\\t\\t\\t\\tresponsibility: and this failure amounts, as the sequence\\n\\t\\t\\t\\tshows, to a denial of God's blessings and of His\\n\\t\\t\\t\\tunceasing care for all His creatures."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "72",
    "NoteID": "81",
    "Body": "Lit., \"has made [or \"provided\"] for you mates out of\\n\\t\\t\\t\\tyourselves\". The term zawj denotes not only \"a pair\" or\\n\\t\\t\\t\\t\"a couple\" but also - as in this instance - \"one of a\\n\\t\\t\\t\\tpair\" or \"a mate\" of the opposite sex; hence, with\\n\\t\\t\\t\\treference to human beings, the plural azwaj signifies\\n\\t\\t\\t\\tboth \"husbands\" and \"wives\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "72",
    "NoteID": "82",
    "Body": "Lit., \"they\", i.e., those who deny the truth of God's\\n\\t\\t\\t\\texistence and/or oneness."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "73",
    "NoteID": "83",
    "Body": "For the comprehensive meaning embodied in the term rizq,\\n\\t\\t\\t\\tsee the first sentence of note [4] on  2:3 ."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "74",
    "NoteID": "84",
    "Body": "I.e., \"do not blaspheme against God by regarding anyone\\n\\t\\t\\t\\tor anything as comparable with Him, or by trying to\\n\\t\\t\\t\\tdefine Him in any terms whatsoever\" - since \"definition\"\\n\\t\\t\\t\\tis, in the last resort, equivalent to a delimitation of\\n\\t\\t\\t\\tthe qualities of the object thus to be defined in\\n\\t\\t\\t\\trelation to, or in comparison with, another object or\\n\\t\\t\\t\\tobjects: God, however, is \"sublimely exalted above\\n\\t\\t\\t\\tanything that men may devise by way of definition\" (see\\n\\t\\t\\t\\tlast sentence of  6:100 , and the corresponding note\\n\\t\\t\\t\\t[88])."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "75",
    "NoteID": "85",
    "Body": "The obvious answer is that they cannot. The implication\\n\\t\\t\\t\\tis equally clear: if even these two kinds of man cannot\\n\\t\\t\\t\\tbe deemed equal, how could any created being, with its\\n\\t\\t\\t\\tintrinsic, utter dependence on other created beings, or\\n\\t\\t\\t\\tany force of nature conceivable or imaginable by man, be\\n\\t\\t\\t\\tthought of as possessing powers comparable with those of\\n\\t\\t\\t\\tGod, who is almighty, limitless, unconceivable - the\\n\\t\\t\\t\\tself-sufficient fount of all that exists? (This argument\\n\\t\\t\\t\\tis continued and further elaborated in the subsequent\\n\\t\\t\\t\\tparable.)"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "76",
    "NoteID": "86",
    "Body": "The term abkam signifies \"dumb\" both in the literal,\\n\\t\\t\\t\\tphysiological sense and (as in colloquial English) in the\\n\\t\\t\\t\\tsense of being \"unable to speak properly\" on account of\\n\\t\\t\\t\\tintellectual weakness: i.e., \"dull-witted\" or \"stupid\".\\n\\t\\t\\t\\tBoth these meanings are contained in the above Qur'anic\\n\\t\\t\\t\\tdescription."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "76",
    "NoteID": "87",
    "Body": "Or: \"wherever he sends him\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "76",
    "NoteID": "88",
    "Body": "I.e., who is not only wise and righteous but also has the\\n\\t\\t\\t\\tstrength and authority to enjoin a righteous way of\\n\\t\\t\\t\\tliving upon others. Thus, while in the first parable the\\n\\t\\t\\t\\tmain issue is the contrast between freedom and bondage or\\n\\t\\t\\t\\t- more generally - between dependence and independence,\\n\\t\\t\\t\\tin the second parable we are given the antithesis of\\n\\t\\t\\t\\tdumbness and incompetence, on the one hand, and wisdom,\\n\\t\\t\\t\\tjustice and competence, on the other; and in both\\n\\t\\t\\t\\tparables the implication is the same (see note [85]\\n\\t\\t\\t\\tabove)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "77",
    "NoteID": "89",
    "Body": "This passage connects with the second sentence of verse {74} - \"Verily, God knows [all], whereas you have no [real] knowledge.\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "77",
    "NoteID": "90",
    "Body": "As may be inferred from the sequence, the term ghayb -\\n\\t\\t\\t\\trendered here as the \"hidden reality\" - alludes in this\\n\\t\\t\\t\\tcontext to the coming of the Last Hour, the time whereof\\n\\t\\t\\t\\tis known to God alone (Zamakhshari). Parallel with this,\\n\\t\\t\\t\\tit may also relate to God's Own existence, which cannot\\n\\t\\t\\t\\tbe directly established by the testimony of our senses\\n\\t\\t\\t\\t(Baydawi) but, as the Qur'an consistently points out, may\\n\\t\\t\\t\\tbe inferred from the observable effects of His\\n\\t\\t\\t\\tcreativeness."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "77",
    "NoteID": "91",
    "Body": "Lit., \"the case [i.e., the manifestation] of the [Last]\\n\\t\\t\\t\\tHour will be like...\", etc. - implying that it will be\\n\\t\\t\\t\\tcharacterized by utter suddenness and unpredictability,\\n\\t\\t\\t\\tboth of them an outcome of the absence of any\\n\\t\\t\\t\\ttime-interval between God's decreeing it and its\\n\\t\\t\\t\\tmaterialization: and this explains the phrase \"or closer\\n\\t\\t\\t\\tstill\" at the end of the above sentence."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "79",
    "NoteID": "92",
    "Body": "Lit., \"subservient [to God's laws] in the air of the\\n\\t\\t\\t\\tsky\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "80",
    "NoteID": "93",
    "Body": "The term julud (sing. jild) denotes, literally, \"skins\",\\n\\t\\t\\t\\tbut apparently comprises here also the wool which grows\\n\\t\\t\\t\\ton the skins of domesticated animals. It is to be noted\\n\\t\\t\\t\\tthat in Arabian usage the noun bayt (\"house\") signifies\\n\\t\\t\\t\\tnot only a solid building but also a \"tent\" - in brief,\\n\\t\\t\\t\\tevery kind of dwelling, whether permanent or temporary."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "80",
    "NoteID": "94",
    "Body": "Wabar (here given in its plural, awbar) is the soft wool\\n\\t\\t\\t\\tgrowing on the shoulders of camels (\"camel-hair\"), used\\n\\t\\t\\t\\tin the weaving of fine cloths and sometimes also of\\n\\t\\t\\t\\tbedouin tents."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "81",
    "NoteID": "95",
    "Body": "Lit., \"out of that which He has created\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "81",
    "NoteID": "96",
    "Body": "Lit., \"shades (zilal. sing. zill). Metonymically, this\\n\\t\\t\\t\\tterm is occasionally used to describe anything that\\n\\t\\t\\t\\t\"shades\" one in the sense of protecting him; and since\\n\\t\\t\\t\\tthe sequence clearly refers to means of protection, I\\n\\t\\t\\t\\tbelieve that this derivative meaning of zilal is here\\n\\t\\t\\t\\tpreferable to the literal."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "81",
    "NoteID": "97",
    "Body": "According to almost all the classical commentators, the\\n\\t\\t\\t\\tmention of \"heat\" implies here its opposite as well,\\n\\t\\t\\t\\tnamely \"cold\"; hence my interpolation."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "81",
    "NoteID": "98",
    "Body": "According to most of the commentators, the second\\n\\t\\t\\t\\tincidence of the term \"garments\" (sarabil) in this verse\\n\\t\\t\\t\\tis to be understood as \"coats of mail\" or \"armour\", in\\n\\t\\t\\t\\twhich case it would allude to wars and other instances of\\n\\t\\t\\t\\tmutual violence. But although this interpretation cannot\\n\\t\\t\\t\\tbe ruled out, it seems to me that the second mention of\\n\\t\\t\\t\\t\"garments\" can be understood in a much wider sense,\\n\\t\\t\\t\\tperhaps metonymically denoting all manner of \"coverings\"\\n\\t\\t\\t\\t(i.e., devices meant to protect the body) which man may\\n\\t\\t\\t\\tbe constrained to use in dangerous situations of his own\\n\\t\\t\\t\\tmaking: hence the stress on \"your violence\" (ba'sakum)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "83",
    "NoteID": "99",
    "Body": "I.e., although they are aware of the many blessings which\\n\\t\\t\\t\\tman enjoys, they refuse to attribute them to God's\\n\\t\\t\\t\\tcreative activity, thus implicitly denying the truth of\\n\\t\\t\\t\\tHis existence. My rendering of al-kafirun as \"[such as]\\n\\t\\t\\t\\tare given to denying the truth\" is conditioned by the\\n\\t\\t\\t\\tdefinite article al which, in the above construction, is\\n\\t\\t\\t\\tmeant to stress the quality of deliberate intent."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "84",
    "NoteID": "100",
    "Body": "An allusion to the Day of Judgment, when the prophets\\n\\t\\t\\t\\twhom God has called forth within every community - or, in\\n\\t\\t\\t\\tthe wider sense of the term ummah, within every\\n\\t\\t\\t\\tcivilization or cultural period - will symbolically bear\\n\\t\\t\\t\\twitness to the fact that they had delivered God's message\\n\\t\\t\\t\\tto their people and explained to them the meaning of\\n\\t\\t\\t\\tright and wrong, thus depriving them of any subsequent\\n\\t\\t\\t\\texcuse."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "84",
    "NoteID": "101",
    "Body": "According to Zamakhshari, their being \"refused\\n\\t\\t\\t\\tpermission\" to plead is a metonym for their having no\\n\\t\\t\\t\\tvalid argument or excuse to proffer. (Cf. also\\n\\t\\t\\t\\t{77:35-36}.)"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "86",
    "NoteID": "102",
    "Body": "Cf.  6:22  and the corresponding note [15]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "86",
    "NoteID": "103",
    "Body": "The Qur'an states in many places that every sinner who\\n\\t\\t\\t\\tdies without repentance will be endowed on Judgment Day\\n\\t\\t\\t\\twith a clear, objectified vision of his sins, every one\\n\\t\\t\\t\\tof which will have assumed for him the status of an\\n\\t\\t\\t\\tindependent reality bearing witness against him and\\n\\t\\t\\t\\tforcing him to acknowledge his now irremediable guilt. It\\n\\t\\t\\t\\tis to be remembered in this connection that the Qur'an\\n\\t\\t\\t\\tdescribes every act of sinning - whether it be an offence\\n\\t\\t\\t\\tagainst the concept of God's oneness and uniqueness or a\\n\\t\\t\\t\\twrong done to any of His creatures - as, primarily, one's\\n\\t\\t\\t\\t\"wronging oneself\" or \"sinning against oneself\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "86",
    "NoteID": "104",
    "Body": "Cf. {6:23-24} and the corresponding notes [16] and [17]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "89",
    "NoteID": "105",
    "Body": "See note [100] above."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "89",
    "NoteID": "106",
    "Body": "Although the Arabian contemporaries of the Prophet were,\\n\\t\\t\\t\\tnaturally, the first to whom his revelation was conveyed\\n\\t\\t\\t\\t- a fact that gave a particular weight to the manner in\\n\\t\\t\\t\\twhich they responded to it - the Qur'anic message as such\\n\\t\\t\\t\\tis addressed to all mankind (see in this connection, in\\n\\t\\t\\t\\tparticular,  7:158  and  21:107 , as well as the\\n\\t\\t\\t\\tcorresponding notes)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "89",
    "NoteID": "107",
    "Body": "I.e., everything that pertains to the knowledge of good\\n\\t\\t\\t\\tand evil, in both the individual and social senses of\\n\\t\\t\\t\\tthese terms. - Regarding my rendering of nazzalna, it\\n\\t\\t\\t\\tshould be borne in mind that this particular grammatical\\n\\t\\t\\t\\tform is often used in the Qur'an to bring out the fact\\n\\t\\t\\t\\tthat it was revealed gradually (\"step by step\") over a\\n\\t\\t\\t\\tconsiderable period of time, and not in one piece."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "90",
    "NoteID": "108",
    "Body": "Lit., \"the giving to [one's] kinsfolk (dhu'l-qurba)\". The\\n\\t\\t\\t\\tlatter term usually denotes \"relatives\", either by blood\\n\\t\\t\\t\\tor by marriage; but since it occurs here in the context\\n\\t\\t\\t\\tof a comprehensive ethical exhortation, it obviously\\n\\t\\t\\t\\talludes to man's \"kinsfolk\" in the widest sense of the\\n\\t\\t\\t\\tterm, namely, to his \"fellow-men\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "90",
    "NoteID": "109",
    "Body": "The term al-munkar (rendered by me in other places as\\n\\t\\t\\t\\t\"that which is wrong\") has here its original meaning of\\n\\t\\t\\t\\t\"that which the mind [or the moral sense] rejects\",\\n\\t\\t\\t\\trespectively \"ought to reject\". Zamakshari is more\\n\\t\\t\\t\\tspecific, and explains this term as signifying in the\\n\\t\\t\\t\\tabove context \"that which [men's] intellects disown\" or\\n\\t\\t\\t\\t\"declare to be untrue\" (ma tunkiruhu al-'uqul): in other\\n\\t\\t\\t\\twords, all that runs counter to reason and good sense\\n\\t\\t\\t\\t(which, obviously, must not be confused with that which\\n\\t\\t\\t\\tis beyond man's comprehension). This eminently convincing\\n\\t\\t\\t\\texplanation relates not merely to intellectually\\n\\t\\t\\t\\tunacceptable propositions (in the abstract sense of the\\n\\t\\t\\t\\tterm) but also to grossly unreasonable and, therefore,\\n\\t\\t\\t\\treprehensible actions or attitudes and is, thus, fully in\\n\\t\\t\\t\\ttune with the rational approach of the Qur'an to\\n\\t\\t\\t\\tquestions of ethics as well as with its insistence on\\n\\t\\t\\t\\treasonableness and moderation in man's behaviour. Hence\\n\\t\\t\\t\\tmy rendering of al-munkar, in this and in similar\\n\\t\\t\\t\\tinstances, as \"all that runs counter to reason\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "91",
    "NoteID": "110",
    "Body": "Regarding the expression \"bond with God\" ('ahd Allah),\\n\\t\\t\\t\\tsee surah {2}, note [19]. The clause \"whenever you bind\\n\\t\\t\\t\\tyourselves by a pledge\" has a twofold meaning: in the\\n\\t\\t\\t\\tfirst instance (as in  13:20 ) it refers to the\\n\\t\\t\\t\\tspiritual, moral and social obligations arising from\\n\\t\\t\\t\\tone's faith in God; and, secondly, it applies to all\\n\\t\\t\\t\\tpledges or promises given by one person to another - for,\\n\\t\\t\\t\\tas Razi points out, every pledge given by man to man\\n\\t\\t\\t\\trepresents, in its essence, a pledge to God. It is to\\n\\t\\t\\t\\tthis second aspect of man's \"bond with God\" that the\\n\\t\\t\\t\\tsequence refers."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "91",
    "NoteID": "111",
    "Body": "I.e., as distinct from oaths \"uttered without thought\"\\n\\t\\t\\t\\t(see  2:225 )."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "91",
    "NoteID": "112",
    "Body": "Lit., \"and having made God [or \"named God as\"] your\\n\\t\\t\\t\\tguarantor (kafil)\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "92",
    "NoteID": "113",
    "Body": "Lit., \"as a [means of] deception (dakhalan) among\\n\\t\\t\\t\\tyourselves\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "92",
    "NoteID": "114",
    "Body": "Lit., \"because there are people (ummah) more powerful\\n\\t\\t\\t\\tthan [other] people\": relating to declarations and false\\n\\t\\t\\t\\tpromises made out of fear."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "92",
    "NoteID": "115",
    "Body": "As is evident from the preceding passage as well as from\\n\\t\\t\\t\\tthe sequence, the differences alluded to here relate to\\n\\t\\t\\t\\tethical and moral values, regarding the truth and\\n\\t\\t\\t\\trelevance of which people of various communities and\\n\\t\\t\\t\\tpersuasions hold most divergent views. See also surah\\n\\t\\t\\t\\t{2}, note [94]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "93",
    "NoteID": "116",
    "Body": "I.e., bound by mutually agreed-upon moral values. See in\\n\\t\\t\\t\\tthis connection  10:19  and the corresponding notes,\\n\\t\\t\\t\\tespecially note [29]. For an elucidation of the concept\\n\\t\\t\\t\\tof ummah wahidah (\"one single community\") and its further\\n\\t\\t\\t\\timplications, see surah {2}, notes [197] and [198]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "93",
    "NoteID": "117",
    "Body": "Or: \"He lets go astray whomever He wills, and guides\\n\\t\\t\\t\\taright whomever He wills\". Regarding the problem of free\\n\\t\\t\\t\\twill versus predestination, seemingly implied in the\\n\\t\\t\\t\\tconcept of God's \"letting man go [or \"causing him to go\"]\\n\\t\\t\\t\\tastray\" or, alternatively, \"guiding him aright\", see\\n\\t\\t\\t\\tsurah {14}, note [4]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "93",
    "NoteID": "118",
    "Body": "Alluding to the erroneous idea that man's good or evil\\n\\t\\t\\t\\tactions - and therefore also his propensities and\\n\\t\\t\\t\\tresulting attitudes - are \"predetermined\" by God and not\\n\\t\\t\\t\\treally an outcome of free choice, Zamakhshari rounds off\\n\\t\\t\\t\\this views on this problem (quoted by me in surah {14},\\n\\t\\t\\t\\tnote [4]) in these words: \"If [it were true that] God\\n\\t\\t\\t\\tcompels [men] to go astray or, alternatively, to follow His\\n\\t\\t\\t\\tguidance - why should He have postulated their deeds as\\n\\t\\t\\t\\tsomething for which they will be held responsible?\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "94",
    "NoteID": "119",
    "Body": "I.e., \"you will offend against God after having attained\\n\\t\\t\\t\\tto faith\", seeing that - as has been pointed out in note\\n\\t\\t\\t\\t[110] above - every pledge given by man to man is\\n\\t\\t\\t\\tsynonymous with a pledge to God."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "94",
    "NoteID": "120",
    "Body": "I.e., in this world (Tabari, Zamakhshari, Baydawi),\\n\\t\\t\\t\\tinasmuch as the breaking of pledges unavoidably leads to\\n\\t\\t\\t\\ta gradual disappearance of all mutual trust and, thus, to\\n\\t\\t\\t\\tthe decomposition of the social fabric."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "97",
    "NoteID": "121",
    "Body": "This may relate either to life in this world - inasmuch\\n\\t\\t\\t\\tas a true believer invariably finds happiness in his\\n\\t\\t\\t\\tGod-consciousness - or to the happiness which awaits him\\n\\t\\t\\t\\tin the hereafter, or to both."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "98",
    "NoteID": "122",
    "Body": "The present passage (verses {98-105}) evidently connects\\n\\t\\t\\t\\twith the broad ethical exhortation given in verse {90}\\n\\t\\t\\t\\tabove and, thus, with the statement (in verse {89}) that\\n\\t\\t\\t\\tthe Qur'an is meant \"to make everything clear and to\\n\\t\\t\\t\\tprovide guidance and grace and a glad tiding unto all who\\n\\t\\t\\t\\thave surrendered themselves to God\" - which, in its turn,\\n\\t\\t\\t\\timplies that the Qur'an is the ultimate source of all\\n\\t\\t\\t\\tGod-willed ethical and moral values, and thus an\\n\\t\\t\\t\\tunchanging criterion of good and evil. But since man is\\n\\t\\t\\t\\talways, by virtue of his nature, prone to question the\\n\\t\\t\\t\\tvery validity of the moral standards established through\\n\\t\\t\\t\\trevelation, the believer is now called upon to seek,\\n\\t\\t\\t\\twhenever he reads or meditates on this divine writ, God's\\n\\t\\t\\t\\tspiritual aid against the whisperings of what the Qur'an\\n\\t\\t\\t\\tdescribes as \"Satan, the accursed\" - that is, all the\\n\\t\\t\\t\\tevil forces, both within man's own soul and within his\\n\\t\\t\\t\\tsocial environment, which tend to undermine his moral\\n\\t\\t\\t\\tconvictions and to lead him away from God."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "100",
    "NoteID": "123",
    "Body": "Or: \"who make him their master\". Cf. in this connection\\n\\t\\t\\t\\t{14: 22} and the corresponding note [31]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "100",
    "NoteID": "124",
    "Body": "I.e., inasmuch as they pay an almost worshipful reverence\\n\\t\\t\\t\\tto such blandishments as wealth, power, social position,\\n\\t\\t\\t\\tetc."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "101",
    "NoteID": "125",
    "Body": "I.e., by substituting the message of the Qur'an for the\\n\\t\\t\\t\\tearlier dispensations - and not, as some Muslim scholars\\n\\t\\t\\t\\tmaintain, \"abrogating\" one Qur'anic verse and replacing\\n\\t\\t\\t\\tit by another. (Regarding the untenable \"doctrine of\\n\\t\\t\\t\\tabrogation\", in the latter sense, see {2: 106} and the\\n\\t\\t\\t\\tcorresponding note [87]; see also note [35] on {41: 42}.)"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "101",
    "NoteID": "126",
    "Body": "I.e., the gradualness of revelation (implied in the\\n\\t\\t\\t\\tverbal form yunazzil) corresponds to God's plan,\\n\\t\\t\\t\\taccording to which He has gradually unfolded His will to\\n\\t\\t\\t\\tman, substituting one dispensation for another in the\\n\\t\\t\\t\\tmeasure of mankind's intellectual and social development,\\n\\t\\t\\t\\tbringing it to its culmination in the message of the\\n\\t\\t\\t\\tQur'an."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "101",
    "NoteID": "127",
    "Body": "I.e., they do not understand the necessity of a new\\n\\t\\t\\t\\tdispensation and, therefore, do not really understand the\\n\\t\\t\\t\\tQur'an."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "102",
    "NoteID": "128",
    "Body": "As in the three other places in which the expression ruh\\n\\t\\t\\t\\tal-qudus occurs ({2 :87} and {253} and {5: 110}), I am\\n\\t\\t\\t\\trendering it here, too, as \"holy inspiration\" (see surah\\n\\t\\t\\t\\t{2}, note [71]), a term which, to my mind, is a Qur'anic\\n\\t\\t\\t\\tsynonym for \"divine revelation\". However, a literal\\n\\t\\t\\t\\trendering - \"spirit of holiness\" - is also possible if one\\n\\t\\t\\t\\tapplies this term to the angel who communicates God's\\n\\t\\t\\t\\trevelations to the prophets. (See also verse {2} of this\\n\\t\\t\\t\\tsurah and the corresponding note [2].)"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "103",
    "NoteID": "129",
    "Body": "I.e., to Muhammad - thus insinuating that his claim to\\n\\t\\t\\t\\tdivine revelation was false."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "103",
    "NoteID": "130",
    "Body": "Whereas some of the pagan Quraysh regarded the ideas\\n\\t\\t\\t\\texpressed in the Qur'an as \"invented\" by Muhammad, others\\n\\t\\t\\t\\tthought that they must have been imparted to him by a\\n\\t\\t\\t\\tforeigner - perhaps a Christian - who lived in Mecca at that\\n\\t\\t\\t\\ttime, or whom the Prophet was supposed to have\\n\\t\\t\\t\\tencountered at an earlier period of his life. Various\\n\\t\\t\\t\\tconjectures have been advanced - both by early Muslim\\n\\t\\t\\t\\tcommentators and by modern orientalists - as to the\\n\\t\\t\\t\\t\"identity\" of the person or persons whom the suspicious\\n\\t\\t\\t\\tMeccans might have had in mind in this connection but all\\n\\t\\t\\t\\tthese conjectures are purely speculative and, therefore,\\n\\t\\t\\t\\tof no historical value whatever. The suspicion of the\\n\\t\\t\\t\\tpagan Meccans implies no more than the historical fact\\n\\t\\t\\t\\tthat those of the Prophet's opponents who were unwilling\\n\\t\\t\\t\\tto pay him the compliment of having \"invented\" the Qur'an\\n\\t\\t\\t\\t(the profundity of which they were unable to deny)\\n\\t\\t\\t\\tconveniently attributed its authorship - or at least its\\n\\t\\t\\t\\tinspiration - to a mythical non-Arab \"teacher\" of the\\n\\t\\t\\t\\tProphet."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "103",
    "NoteID": "131",
    "Body": "For an explanation of this composite rendering of the\\n\\t\\t\\t\\tdescriptive term mubin, see surah {12}, note [2]. The term is used here to stress the fact that no human being - and certainly no non-Arab - could ever have produced the flawless, exalted Arabic diction in which the Qur'an is expressed."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "105",
    "NoteID": "132",
    "Body": "I.e., the scurrilous allegation referred to in verse\\n\\t\\t\\t\\t{103}. Although this statement alludes,in the first\\n\\t\\t\\t\\tinstance, to the hostile contemporaries of the Prophet,\\n\\t\\t\\t\\tit extends, by obvious implication, to people of all\\n\\t\\t\\t\\ttimes who refuse to believe in the reality of Muhammad's\\n\\t\\t\\t\\trevelations, and try to explain them away as obsessive\\n\\t\\t\\t\\tillusions or even as deliberate fabrications."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "106",
    "NoteID": "133",
    "Body": "Lit., \"except\" - but the Arabic construction of the\\n\\t\\t\\t\\tsentence that follows makes it necessary to render the\\n\\t\\t\\t\\tsimple particle illa in the manner adopted by me (\"and\\n\\t\\t\\t\\tthis, to be sure, does not apply to...\", etc.)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "106",
    "NoteID": "134",
    "Body": "Lit., \"one who is coerced, the while his heart is at rest\\n\\t\\t\\t\\tin [his] faith\". This relates to believers who, under\\n\\t\\t\\t\\ttorture or threat of death, ostensibly \"recant\" in order\\n\\t\\t\\t\\tto save themselves. Although the Qur'an makes it clear in\\n\\t\\t\\t\\tseveral places that martyrdom in the cause of faith is\\n\\t\\t\\t\\thighly meritorious, \"God does not burden any human being\\n\\t\\t\\t\\twith more than he is well able to bear\" (cf.  2:233  and\\n\\t\\t\\t\\t{286},  6:152 ,  7:42 ,  23:62 , and many other Qur'anic\\n\\t\\t\\t\\tstatements to the same effect)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "108",
    "NoteID": "135",
    "Body": "Sc., \"of what is good and what is bad for them\". - For an\\n\\t\\t\\t\\texplanation of God's \"sealing\" the hearts of those who\\n\\t\\t\\t\\tare bent on denying the truth, see  2:7  and the\\n\\t\\t\\t\\tcorresponding note."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "110",
    "NoteID": "136",
    "Body": "For an explanation of the concept of fitnah (appearing\\n\\t\\t\\t\\there in the verbal form futinu) and of my rendering it as\\n\\t\\t\\t\\t\"temptation to evil\", see surah {8}, note [25]. As\\n\\t\\t\\t\\tregards the expression alladhlna hajaru in its spiritual\\n\\t\\t\\t\\tconnotation, see surah {2}, note [203] and surah {4},\\n\\t\\t\\t\\tnote [124]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "112",
    "NoteID": "137",
    "Body": "Lit., \"the garment\" (libas) - idiomatically used in\\n\\t\\t\\t\\tclassical Arabic to describe the utmost degree of\\n\\t\\t\\t\\tmisfortune which \"envelops man like a garment\" (Taj\\n\\t\\t\\t\\tal-'Arus, with specific reference to the above verse)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "112",
    "NoteID": "138",
    "Body": "This parable is meant to show that deliberate ingratitude\\n\\t\\t\\t\\tfor the manifold blessings which God bestows upon man -\\n\\t\\t\\t\\tin other words, a deliberate refusal to submit to His\\n\\t\\t\\t\\tguidance - is bound, in the long run and in the context\\n\\t\\t\\t\\tof aggregate social life, to have disastrous consequences\\n\\t\\t\\t\\tnot only in the hereafter but in this world as well,\\n\\t\\t\\t\\tinasmuch as no society may expect to live in security and\\n\\t\\t\\t\\tease unless it conforms to the ethical and social\\n\\t\\t\\t\\tstandards inherent in the concept of man's \"bond with\\n\\t\\t\\t\\tGod\" (as explained in surah {2}, note [19])."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "114",
    "NoteID": "139",
    "Body": "It is this call to gratitude that provides a connection\\n\\t\\t\\t\\tbetween the present passage and the foregoing parable of\\n\\t\\t\\t\\tthe ungrateful town and, thus, with the opening passages\\n\\t\\t\\t\\t(verses {1-15}) of this surah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "115",
    "NoteID": "140",
    "Body": "It is to be noted that the above two verses are almost\\n\\t\\t\\t\\tidentical with {2:172-173}, and ought, therefore, to be\\n\\t\\t\\t\\tread in conjunction with the whole passage of which those\\n\\t\\t\\t\\ttwo verses form a part - namely, {2:168-173}. Cf. also {6:\\n\\t\\t\\t\\t145}."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "116",
    "NoteID": "141",
    "Body": "Regarding the very important problem of an arbitrary\\n\\t\\t\\t\\tdetermination, based on subjective preferences, of what\\n\\t\\t\\t\\tis to be considered ethically right or wrong, see surah\\n\\t\\t\\t\\t{2}. note [137]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "118",
    "NoteID": "142",
    "Body": "I.e., in {6: 146}, revealed shortly before the present\\n\\t\\t\\t\\tsurah. The conjunctive particle \"And\" at the beginning of\\n\\t\\t\\t\\tthis sentence establishes a connection with the precept\\n\\t\\t\\t\\tlaid down in verse {114}       above, \"partake of all the\\n\\t\\t\\t\\tlawful, good things which God has provided for you as\\n\\t\\t\\t\\tsustenance\": the implication being (as in  6:145 ) that\\n\\t\\t\\t\\tnone of the really good and wholesome things have been\\n\\t\\t\\t\\tforbidden to the believer, and that the many dietary\\n\\t\\t\\t\\tprohibitions and restrictions imposed on the Jews were\\n\\t\\t\\t\\timposed on them alone in punishment of their persistent\\n\\t\\t\\t\\tsinning (cf.  3:93 )."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "119",
    "NoteID": "143",
    "Body": "For this rendering of thumma, see surah {6}, note [31]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "120",
    "NoteID": "144",
    "Body": "This is one of the many meanings of the term ummah and,\\n\\t\\t\\t\\tto my mind, the one most appropriate in the above\\n\\t\\t\\t\\tcontext. - The mention of Abraham at this place contains\\n\\t\\t\\t\\ta subtle allusion to verse {118}, where the Jews are\\n\\t\\t\\t\\tspoken of: for, the latter claim to be \"the chosen\\n\\t\\t\\t\\tpeople\" on account of their descent from Abraham, whereas\\n\\t\\t\\t\\tthe Qur'an consistently rejects all claims to a special\\n\\t\\t\\t\\tstatus by virtue of one's descent. Moreover, the Qur'an\\n\\t\\t\\t\\tstates in many places that whereas this particular\\n\\t\\t\\t\\tancestor of the Hebrews - and, by the way, of most of the\\n\\t\\t\\t\\tArab tribes as well - was a personification of all that\\n\\t\\t\\t\\tis good and upright, so that \"God exalted him with His\\n\\t\\t\\t\\tlove\" ( 4:125 ), his Jewish descendants always tended to\\n\\t\\t\\t\\trebel against God and, thus, \"persistently wronged\\n\\t\\t\\t\\tthemselves\"."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "120",
    "NoteID": "145",
    "Body": "For an explanation of this rendering of the term hanif,\\n\\t\\t\\t\\tsee surah {2}, note [110]."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "123",
    "NoteID": "146",
    "Body": "Lit., \"thereafter\" or \"afterwards\" (thumma): but since\\n\\t\\t\\t\\tthis particle evidently alludes here to the climax of all\\n\\t\\t\\t\\trevelation as manifested in the Qur'an, the above\\n\\t\\t\\t\\trendering seems to be suitable."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "124",
    "NoteID": "147",
    "Body": "I.e., about Abraham. The implication is that the majority\\n\\t\\t\\t\\tof the Jews had deviated from the true creed of Abraham\\n\\t\\t\\t\\t(which is the meaning of the phrase, \"those who came to\\n\\t\\t\\t\\thold divergent views about him\") inasmuch as most of them\\n\\t\\t\\t\\tbecame convinced that they were \"God's chosen people\"\\n\\t\\t\\t\\tsimply because of their physical descent from that great\\n\\t\\t\\t\\tProphet: an assumption which obviously runs counter to every truly religious principle. As the Qur'an repeatedly points out, this spiritual arrogance was punished by God's imposition on the children of Israel - and on them alone - of all manner of severe restrictions and rituals, of which the obligation to refrain from all work and even travel on the Sabbath was one. In its widest implication, this passage is meant to stress the fact that all God-imposed rituals are only a means towards the achievement of spiritual discipline, and never a religious goal in themselves."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "124",
    "NoteID": "148",
    "Body": "I.e., He will judge between those who are convinced of\\n\\t\\t\\t\\ttheir ultimate salvation on the basis of their alleged\\n\\t\\t\\t\\tstatus of \"God's chosen people\", and those who believe in\\n\\t\\t\\t\\tman's individual responsibility before God: and thus the\\n\\t\\t\\t\\tdiscourse returns to the problem of God-consciousness and\\n\\t\\t\\t\\trighteous living."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "125",
    "NoteID": "149",
    "Body": "Cf.  29:46  - \"And do not argue with the followers of\\n\\t\\t\\t\\tearlier revelation otherwise than in the most kindly\\n\\t\\t\\t\\tmanner\". This stress on kindness and tact and, hence, on\\n\\t\\t\\t\\tthe use of reason alone in all religious discussions with\\n\\t\\t\\t\\tadherents of other creeds is fully in tune with the\\n\\t\\t\\t\\tbasic, categorical injunction, \"There shall be no\\n\\t\\t\\t\\tcoercion in matters of faith\" ({2: 256})."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "126",
    "NoteID": "150",
    "Body": "Lit., \"retaliate [or \"respond\"] with the like of what you\\n\\t\\t\\t\\thave been afflicted with\": thus, the believers are\\n\\t\\t\\t\\tadmonished to observe self-restraint while arguing with\\n\\t\\t\\t\\tpeople of another persuasion, and never to offend\\n\\t\\t\\t\\tagainst decency and intellectual equity. Although\\n\\t\\t\\t\\tretaliation in argument is permissible if one's integrity\\n\\t\\t\\t\\tis impeached by an opponent, the sequence makes it clear\\n\\t\\t\\t\\tthat it is morally preferable to renounce it altogether\\n\\t\\t\\t\\tand to bear the unjust attack with patience."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "127",
    "NoteID": "151",
    "Body": "Lit., \"and thy patience in adversity (sabr) is due to [or\\n\\t\\t\\t\\t\"rests with\"] none but God\" - i.e., it must never be\\n\\t\\t\\t\\tallowed to become a source of spiritual arrogance and\\n\\t\\t\\t\\tfalse self-righteousness."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "127",
    "NoteID": "152",
    "Body": "Lit., \"all that they are scheming\", i.e., by inventing\\n\\t\\t\\t\\tfalse and irrelevant arguments against God's messages."
  }
]
