[
  {
    "SurahNumber": "3",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "The gradualness of the Qur'anic revelation is stressed\\n\\t\\t\\t\\there by means of the grammatical form nazzala."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "Most of the commentators are of the opinion that ma bayna\\n\\t\\t\\t\\tyadayhi - lit., \"that which is between its hands\" -\\n\\t\\t\\t\\tdenotes here \"the revelations which came before it\",\\n\\t\\t\\t\\ti.e., before the Qur'an. This interpretation is not,\\n\\t\\t\\t\\thowever, entirely convincing. Although there is not the\\n\\t\\t\\t\\tleast doubt that in this context the pronominal ma refers\\n\\t\\t\\t\\tto earlier revelations, and particularly the Bible (as is\\n\\t\\t\\t\\tevident from the parallel use of the above expression in\\n\\t\\t\\t\\tother Qur'anic passages), the idiomatic phrase ma bayna\\n\\t\\t\\t\\tyadayhi does not, in itself, mean \"that which came before\\n\\t\\t\\t\\tit\" - i.e., in time - but, rather (as pointed out by me\\n\\t\\t\\t\\tin surah {2}, note [247]), \"that which lies open before\\n\\t\\t\\t\\tit\". Since, however, the pronoun \"it\" relates here to the\\n\\t\\t\\t\\tQur'an, the metaphorical expression \"between its hands\"\\n\\t\\t\\t\\tor \"before it\" cannot possibly refer to \"knowledge\" (as\\n\\t\\t\\t\\tit does in  2:255 ), but must obviously refer to an\\n\\t\\t\\t\\tobjective reality with which the Qur'an is \"confronted\":\\n\\t\\t\\t\\tthat is, something that was coexistent in time with the\\n\\t\\t\\t\\trevelation of the Qur'an. Now this, taken together (a)\\n\\t\\t\\t\\twith the fact - frequently stressed in the Qur'an and\\n\\t\\t\\t\\tsince established by objective scholarship - that in the\\n\\t\\t\\t\\tcourse of the millennia the Bible has been subjected to\\n\\t\\t\\t\\tconsiderable and often arbitrary alteration, and (b) with\\n\\t\\t\\t\\tthe fact that many of the laws enunciated in the Qur'an\\n\\t\\t\\t\\tdiffer from the laws of the Bible, brings us forcibly to\\n\\t\\t\\t\\tthe conclusion that the \"confirmation\" of the latter by\\n\\t\\t\\t\\tthe Qur'an can refer only to the basic truths still\\n\\t\\t\\t\\tdiscernible in the Bible, and not to its time-bound\\n\\t\\t\\t\\tlegislation or to its present text - in other words, a\\n\\t\\t\\t\\tconfirmation of whatever was extant of its basic\\n\\t\\t\\t\\tteachings at the time of the revelation of the Qur'an:\\n\\t\\t\\t\\tand it is this that the phrase ma bayna yadayhi expresses\\n\\t\\t\\t\\tin this context as well as in  5:46  and {48} or in\\n\\t\\t\\t\\t 61:6  (where it refers to Jesus' confirming the truth of\\n\\t\\t\\t\\t\"whatever there still remained [i.e., in his lifetime] of\\n\\t\\t\\t\\tthe Torah\")."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "It is to be borne in mind that the Gospel frequently\\n\\t\\t\\t\\tmentioned in the Qur'an is not identical with what is\\n\\t\\t\\t\\tknown today as the Four Gospels, but refers to an\\n\\t\\t\\t\\toriginal, since lost, revelation bestowed upon Jesus and\\n\\t\\t\\t\\tknown to his contemporaries under its Greek name of\\n\\t\\t\\t\\tEvangelion (\"Good Tiding\"), on which the Arabicized form\\n\\t\\t\\t\\tInjil is based. It was probably the source from which the\\n\\t\\t\\t\\tSynoptic Gospels derived much of their material and some\\n\\t\\t\\t\\tof the teachings attributed to Jesus. The fact of its\\n\\t\\t\\t\\thaving been lost and forgotten is alluded to in the\\n\\t\\t\\t\\tQur'an in  5:14 . Regarding my rendering of al-furqan as\\n\\t\\t\\t\\t\"the standard by which to discern the true from the\\n\\t\\t\\t\\tfalse\", see also note [38] on the identical phrase\\n\\t\\t\\t\\toccurring in  2:53 ."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "The above passage may be regarded as a key to the\\n\\t\\t\\t\\tunderstanding of the Qur'an. Tabari identifies the ayat\\n\\t\\t\\t\\tmuhkamat (\"messages that are clear in and by themselves\")\\n\\t\\t\\t\\twith what the philologists and jurists describe as nass -\\n\\t\\t\\t\\tnamely, ordinances or statements which are self-evident\\n\\t\\t\\t\\t(zahir) by virtue of their wording (cf. Lisan al-'Arab,\\n\\t\\t\\t\\tart. nass). Consequently, Tabari regards as ayat muhkamat\\n\\t\\t\\t\\tonly those statements or ordinances of the Qur'an which\\n\\t\\t\\t\\tdo not admit of more than one interpretation (which does\\n\\t\\t\\t\\tnot, of course, preclude differences of opinion regarding\\n\\t\\t\\t\\tthe implications of a particular ayah muhkamah). In my\\n\\t\\t\\t\\topinion, however, it would be too dogmatic to regard any\\n\\t\\t\\t\\tpassage of the Qur'an which does not conform to the above\\n\\t\\t\\t\\tdefinition as mutashabih (\"allegorical\"): for there are\\n\\t\\t\\t\\tmany statements in the Qur'an which are liable to more\\n\\t\\t\\t\\tthan one interpretation but are, nevertheless, not\\n\\t\\t\\t\\tallegorical - just as there are many expressions and\\n\\t\\t\\t\\tpassages which, despite their allegorical formulation,\\n\\t\\t\\t\\treveal to the searching intellect only one possible\\n\\t\\t\\t\\tmeaning. For this reason, the ayat mutashabihat may be\\n\\t\\t\\t\\tdefined as those passages of the Qur'an which are\\n\\t\\t\\t\\texpressed in a figurative manner, with a meaning that is\\n\\t\\t\\t\\tmetaphorically implied but not directly, in so many\\n\\t\\t\\t\\twords, stated. The ayat muhkamat are described as the\\n\\t\\t\\t\\t\"essence of the divine writ\" (umm al-kitab) because they\\n\\t\\t\\t\\tcomprise the fundamental principles underlying its\\n\\t\\t\\t\\tmessage and, in particular, its ethical and social\\n\\t\\t\\t\\tteachings: and it is only on the basis of these clearly\\n\\t\\t\\t\\tenunciated principles that the allegorical passages can\\n\\t\\t\\t\\tbe correctly interpreted. (For a more detailed discussion\\n\\t\\t\\t\\tof symbolism and allegory in the Qur'an, see Appendix I.)"
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "7",
    "NoteID": "6",
    "Body": "Lit., \"that of it\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "The \"confusion\" referred to here is a consequence of\\n\\t\\t\\t\\tinterpreting allegorical passages in an \"arbitrary\\n\\t\\t\\t\\tmanner\" (Zamakhshari)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "7",
    "NoteID": "8",
    "Body": "According to most of the early commentators, this refers\\n\\t\\t\\t\\tto the interpretation of allegorical passages which deal\\n\\t\\t\\t\\twith metaphysical subjects - for instance, God's\\n\\t\\t\\t\\tattributes, the ultimate meaning of time and eternity,\\n\\t\\t\\t\\tthe resurrection of the dead, the Day of Judgment,\\n\\t\\t\\t\\tparadise and hell, the nature of the beings or forces\\n\\t\\t\\t\\tdescribed as angels, and so forth - all of which fall\\n\\t\\t\\t\\twithin the category of al-ghayb, i.e., that sector of\\n\\t\\t\\t\\treality which is beyond the reach of human perception and\\n\\t\\t\\t\\timagination and cannot, therefore, be conveyed to man in\\n\\t\\t\\t\\tother than allegorical terms. This view of the classical\\n\\t\\t\\t\\tcommentators, however, does not seem to take into account\\n\\t\\t\\t\\tthe many Qur'anic passages which do not deal with\\n\\t\\t\\t\\tmetaphysical subjects and yet are, undoubtedly,\\n\\t\\t\\t\\tallegorical in intent and expression. To my mind, one\\n\\t\\t\\t\\tcannot arrive at a correct understanding of the above\\n\\t\\t\\t\\tpassage without paying due attention to the nature and\\n\\t\\t\\t\\tfunction of allegory as such. A true allegory - in\\n\\t\\t\\t\\tcontrast with a mere pictorial paraphrase of something\\n\\t\\t\\t\\tthat could equally well be stated in direct terms - is\\n\\t\\t\\t\\talways meant to express in a figurative manner something\\n\\t\\t\\t\\twhich, because of its complexity, cannot be adequately\\n\\t\\t\\t\\texpressed in direct terms or propositions and, because of\\n\\t\\t\\t\\tthis very complexity, can be grasped only intuitively, as\\n\\t\\t\\t\\ta general mental image, and not as a series of detailed\\n\\t\\t\\t\\t\"statements\": and this seems to be the meaning of the\\n\\t\\t\\t\\tphrase, \"none save God knows its final meaning\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "13",
    "NoteID": "9",
    "Body": "It is generally assumed that this is an allusion to the\\n\\t\\t\\t\\tbattle of Badr, in the third week of Ramadan, 2 H., in\\n\\t\\t\\t\\twhich three hundred and odd poorly-equipped Muslims, led\\n\\t\\t\\t\\tby the Prophet, utterly routed a well-armed Meccan force\\n\\t\\t\\t\\tnumbering nearly one thousand men, seven hundred camels\\n\\t\\t\\t\\tand one hundred horses; it was the first open battle\\n\\t\\t\\t\\tbetween the pagan Quraysh and the young Muslim community\\n\\t\\t\\t\\tof Medina. According to some commentators, however (e.g.,\\n\\t\\t\\t\\tManar III, 234), the above Qur'anic passage has a general\\n\\t\\t\\t\\timport and alludes to an occurrence often witnessed in\\n\\t\\t\\t\\thistory - namely, the victory of a numerically weak and\\n\\t\\t\\t\\till-equipped group of people, filled with a burning\\n\\t\\t\\t\\tbelief in the righteousness of their cause, over a\\n\\t\\t\\t\\tmaterially and numerically superior enemy lacking a\\n\\t\\t\\t\\tsimilar conviction. The fact that in this Qur'an-verse\\n\\t\\t\\t\\tthe believers are spoken of as being faced by an enemy\\n\\t\\t\\t\\t\"twice their number\" (while at the battle of Badr the\\n\\t\\t\\t\\tpagan Quraysh were more than three times the number of\\n\\t\\t\\t\\tthe Muslims) lends great plausibility to this explanation\\n\\t\\t\\t\\t- and particularly so in view of the allusion, in the\\n\\t\\t\\t\\tnext verse, to material riches and worldly power."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "17",
    "NoteID": "10",
    "Body": "The expression bi'l-ashar is usually taken to mean \"at\\n\\t\\t\\t\\tthe times before daybreak\", or simply \"before daybreak\".\\n\\t\\t\\t\\tThis is in agreement with the Prophet's recommendation to\\n\\t\\t\\t\\this followers (forthcoming from several authentic\\n\\t\\t\\t\\tTraditions) to devote the latter part of the night, and\\n\\t\\t\\t\\tparticularly the time shortly before dawn, to intensive\\n\\t\\t\\t\\tprayer. But while the word sahar (also spelled sahr and\\n\\t\\t\\t\\tsuhr), of which ashar is the plural, undoubtedly denotes\\n\\t\\t\\t\\t\"the time before daybreak\", it also signifies - in the\\n\\t\\t\\t\\tspellings sahar and suhr - \"the core of the heart\", \"the\\n\\t\\t\\t\\tinner part of the heart\", or simply \"heart\" (cf. Lisan\\n\\t\\t\\t\\tal-'Arab; also Lane IV, 1316). It seems to me that in the\\n\\t\\t\\t\\tcontext of the above Qur'an-verse - as well as of  51:18 \\n\\t\\t\\t\\t- this latter rendering is preferable to the conventional\\n\\t\\t\\t\\tone: for, although the value of praying before daybreak\\n\\t\\t\\t\\thas undoubtedly been stressed by the Prophet, it is not\\n\\t\\t\\t\\tvery plausible that the Qur'an should have tied the\\n\\t\\t\\t\\tprayer for forgiveness to a particular time of day."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "18",
    "NoteID": "11",
    "Body": "Lit., \"bears witness\" - i.e., through the nature of His creation, which shows plainly that it has been brought into being by a consciously planning Power."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "19",
    "NoteID": "12",
    "Body": "Most of the classical commentators are of the opinion\\n\\t\\t\\t\\tthat the people referred to are the followers of the\\n\\t\\t\\t\\tBible, or of parts of it - i.e., the Jews and the\\n\\t\\t\\t\\tChristians. It is, however, highly probable that this\\n\\t\\t\\t\\tpassage bears a wider import and relates to all\\n\\t\\t\\t\\tcommunities which base their views on a revealed\\n\\t\\t\\t\\tscripture, extant in a partially corrupted form, with\\n\\t\\t\\t\\tparts of it entirely lost."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "19",
    "NoteID": "13",
    "Body": "I.e., all these communities at first subscribed to the\\n\\t\\t\\t\\tdoctrine of God's oneness and held that man's\\n\\t\\t\\t\\tself-surrender to Him (islam in its original connotation)\\n\\t\\t\\t\\tis the essence of all true religion. Their subsequent\\n\\t\\t\\t\\tdivergencies were an outcome of sectarian pride and\\n\\t\\t\\t\\tmutual exclusiveness."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "20",
    "NoteID": "14",
    "Body": "According to Razi, this refers to people who have no\\n\\t\\t\\t\\trevealed scripture of their own."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "21",
    "NoteID": "15",
    "Body": "See surah {2}, note [48]."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "23",
    "NoteID": "16",
    "Body": "Lit., \"decide [all disputes] between them\" - the\\n\\t\\t\\t\\treference being to the Torah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "24",
    "NoteID": "17",
    "Body": "Cf.  2:80 , and the corresponding note."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "24",
    "NoteID": "18",
    "Body": "Lit., \"that which they were wont to invent has deluded\\n\\t\\t\\t\\tthem in their faith\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "28",
    "NoteID": "19",
    "Body": "I.e., in cases where the interests of those \"deniers of\\n\\t\\t\\t\\tthe truth\" clash with the interests of believers (Manar\\n\\t\\t\\t\\tIII, 278). Regarding the deeper implications of the term\\n\\t\\t\\t\\t\"allies\" (awliya'), see  4:139  and the corresponding\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "28",
    "NoteID": "20",
    "Body": "Lit., \"unless you fear from them something that is to be\\n\\t\\t\\t\\tfeared\". Zamakhshari explains this phrase as meaning,\\n\\t\\t\\t\\t\"unless you have reason to fear that they might do\\n\\t\\t\\t\\tsomething which ought to be guarded against\" - obviously\\n\\t\\t\\t\\treferring to situations in which \"those who deny the\\n\\t\\t\\t\\ttruth\" are more powerful than the Muslims, and are\\n\\t\\t\\t\\ttherefore in a position to damage the latter unless they\\n\\t\\t\\t\\tbecome their \"allies\" in a political or moral sense."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "29",
    "NoteID": "21",
    "Body": "Lit., \"breasts\". This is a reference to the real motives\\n\\t\\t\\t\\tunderlying the decision of a Muslim group or power to\\n\\t\\t\\t\\tform an alliance with \"those who deny the truth\" in\\n\\t\\t\\t\\tpreference to, or against the legitimate interests of,\\n\\t\\t\\t\\tother believers."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "34",
    "NoteID": "22",
    "Body": "Lit., \"offspring of one another\" - an allusion not merely\\n\\t\\t\\t\\tto the physical descent of those prophets but also to the\\n\\t\\t\\t\\tfact that all of them were spiritually linked with one\\n\\t\\t\\t\\tanother and believed in one and the same fundamental\\n\\t\\t\\t\\ttruth (Tabari). Thus, the above passage is a logical\\n\\t\\t\\t\\tsequence to verses {31-32}, which make God's approval\\n\\t\\t\\t\\tcontingent upon obedience to His chosen message-bearers.\\n\\t\\t\\t\\tThe names which appear in this sentence circumscribe, by\\n\\t\\t\\t\\timplication, all the prophets mentioned in the Qur'an\\n\\t\\t\\t\\tinasmuch as most of them were descendants of two or more\\n\\t\\t\\t\\tof these patriarchs. The House of 'Imran comprises Moses\\n\\t\\t\\t\\tand Aaron, whose father was 'Imran (the Amram of the\\n\\t\\t\\t\\tBible), and Aaron's descendants, the priestly caste among\\n\\t\\t\\t\\tthe Israelites - thus including John the Baptist, both of\\n\\t\\t\\t\\twhose parents were of the same descent (cf. the\\n\\t\\t\\t\\treference, in Luke i, 5, to John's mother Elisabeth as\\n\\t\\t\\t\\tone \"of the daughters of Aaron\"), as well as Jesus, whose\\n\\t\\t\\t\\tmother Mary - a close relation of John - is spoken of\\n\\t\\t\\t\\telsewhere in the Qur'an ( 19:28 ) as a \"sister of Aaron\":\\n\\t\\t\\t\\tin both cases embodying the ancient Semitic custom of\\n\\t\\t\\t\\tlinking a person's or a people's name with that of an\\n\\t\\t\\t\\tillustrious forebear. The reference to the House of\\n\\t\\t\\t\\t'Imran serves as an introduction to the stories of\\n\\t\\t\\t\\tZachariah, John, Mary, and Jesus."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "34",
    "NoteID": "23",
    "Body": "My joining of this phrase with the following passage is\\n\\t\\t\\t\\tin agreement with the interpretation advanced by Muhammad\\n\\t\\t\\t\\t'Abduh and Rashid Rida' (Manar III, 289)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "36",
    "NoteID": "24",
    "Body": "Lit., \"to her\" - implying that it was a girl."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "36",
    "NoteID": "25",
    "Body": "Lit., \"and the male is not [or \"could not be\"] like the\\n\\t\\t\\t\\tfemale\". Zamakhshari reads these words as forming part of\\n\\t\\t\\t\\tthe parenthetic sentence relating to God's knowledge, and\\n\\t\\t\\t\\texplains them thus: \"The male [child] which she had\\n\\t\\t\\t\\tprayed for could not have been like the female which she\\n\\t\\t\\t\\twas granted\" - which implies that Mary's excellence would\\n\\t\\t\\t\\tgo far beyond any hopes which her mother had ever\\n\\t\\t\\t\\tentertained."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "37",
    "NoteID": "26",
    "Body": "As is evident from verse {44} of this surah, the\\n\\t\\t\\t\\tguardianship of Mary was entrusted to Zachariah - who was\\n\\t\\t\\t\\tnot only her relative but also a priest attached to the\\n\\t\\t\\t\\tTemple - after lots had been drawn to decide which of the\\n\\t\\t\\t\\tpriests should have the responsibility for this girl who,\\n\\t\\t\\t\\tin consequence of her mother's vow, was to be dedicated\\n\\t\\t\\t\\tto Temple service (Tabari)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "37",
    "NoteID": "27",
    "Body": "In spite of all the legends quoted in this connection by\\n\\t\\t\\t\\tmost of the commentators, there is no indication\\n\\t\\t\\t\\twhatsoever either in the Qur'an or in any authentic\\n\\t\\t\\t\\tTradition that these provisions were of a miraculous\\n\\t\\t\\t\\torigin. On the other hand, Tabari quotes a story to the\\n\\t\\t\\t\\teffect that when, in his old age, Zachariah became unable\\n\\t\\t\\t\\tto support Mary by his own means, the community decided\\n\\t\\t\\t\\tto assume this responsibility through another of its\\n\\t\\t\\t\\tmembers, who thereupon provided her daily with food.\\n\\t\\t\\t\\tWhether this story is authentic or not, Mary's answer to\\n\\t\\t\\t\\tZachariah reflects no more and no less than her deep\\n\\t\\t\\t\\tconsciousness of God as the ultimate Provider."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "39",
    "NoteID": "28",
    "Body": "In view of the fact that the expression kalimah if often\r\\n\\t\\t\\t\\tused in the Qur'an to denote an announcement from God, or\r\\n\\t\\t\\t\\ta statement of His will, or His promise (e.g.,  4:171 ,\r\\n\\t\\t\\t\\t 6:34  and {115},  10:64 ,  18:27 , and so forth), we\r\\n\\t\\t\\t\\tmust conclude that in the above passage, too, the \"word\r\\n\\t\\t\\t\\tfrom God\" which would be confirmed by the birth of John\r\\n\\t\\t\\t\\t(described in the Gospels as \"John the Baptist\") refers\r\\n\\t\\t\\t\\tto a divine promise given through revelation: and this,\r\\n\\t\\t\\t\\tindeed, is the interpretation adopted by the famous\r\\n\\t\\t\\t\\tphilologist Abu 'Ubaydah Ma'mar ibn al-Muthanna, who lived\r\\n\\t\\t\\t\\tin the second century H. and devoted most of his labours\r\\n\\t\\t\\t\\tto the study of rare expressions in the Arabic language;\r\\n\\t\\t\\t\\this identification, in the context under discussion, of\r\\n\\t\\t\\t\\tkalimah with kitab (\"revelation\" or \"divine writ\") has\r\\n\\t\\t\\t\\tbeen quoted by Razi in his commentary on this verse and\r\\n\\t\\t\\t\\tis, moreover, agreeable with a similar announcement\r\\n\\t\\t\\t\\tconveyed to Mary regarding the birth of Jesus (see verse\r\\n\\t\\t\\t\\t{45} of this surah)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "41",
    "NoteID": "29",
    "Body": "According to Abu Muslim (quoted with approval by Razi),\\n\\t\\t\\t\\tZachariah was merely enjoined not to speak to anyone\\n\\t\\t\\t\\tduring the period of three days, and not struck dumb as\\n\\t\\t\\t\\tin the New Testament narrative (Luke i, 20-22): thus the\\n\\t\\t\\t\\t\"sign\" was purely spiritual, and was to consist in\\n\\t\\t\\t\\tZachariah's utter self-abandonment to prayer and\\n\\t\\t\\t\\tcontemplation."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "44",
    "NoteID": "30",
    "Body": "This parenthetic passage, addressed to the Prophet, is\\n\\t\\t\\t\\tmeant to stress the fact that the story of Mary, as\\n\\t\\t\\t\\tnarrated in the Qur'an, is a direct outcome of revelation\\n\\t\\t\\t\\tand, therefore, inherently true in spite of all the\\n\\t\\t\\t\\tdifferences between this account and that given in the\\n\\t\\t\\t\\tscriptures regarded by the Christians as authentic\\n\\t\\t\\t\\t(Muhammad 'Abduh in Manar III, 301 f.)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "44",
    "NoteID": "31",
    "Body": "See note [26] above. The phrase rendered above as \"they\\n\\t\\t\\t\\tdrew lots\" reads literally, \"they cast their reeds\" -\\n\\t\\t\\t\\tobviously a reference to an ancient Semitic custom,\\n\\t\\t\\t\\tperhaps similar to the divination by means of blunt\\n\\t\\t\\t\\tarrows practiced by the pre-Islamic Arabs and\\n\\t\\t\\t\\tcomprehensively described in Lane III, 1247. The pronoun\\n\\t\\t\\t\\t\"they\" relates to the priests, of whom Zachariah was one."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "45",
    "NoteID": "32",
    "Body": "Lit., \"whose name shall be 'the Anointed' (al-masih)\".\\n\\t\\t\\t\\tThe designation al-masih is the Arabicized form of the\\n\\t\\t\\t\\tAramaic meshiha which, in turn, is derived from the\\n\\t\\t\\t\\tHebrew mahsiah, \"the anointed\" - a term frequently\\n\\t\\t\\t\\tapplied in the Bible to the Hebrew kings, whose accession\\n\\t\\t\\t\\tto power used to be consecrated by a touch with holy oil\\n\\t\\t\\t\\ttaken from the Temple. This anointment appears to have\\n\\t\\t\\t\\tbeen so important a rite among the Hebrews that the term\\n\\t\\t\\t\\t\"the anointed\" became in the course of time more or less\\n\\t\\t\\t\\tsynonymous with \"king\". Its application to Jesus may have\\n\\t\\t\\t\\tbeen due to the widespread conviction among his\\n\\t\\t\\t\\tcontemporaries (references to which are found in several\\n\\t\\t\\t\\tplaces in the Synoptic Gospels) that he was descended in\\n\\t\\t\\t\\tdirect - and obviously legitimate - line from the royal\\n\\t\\t\\t\\tHouse of David. (It is to be noted that this could not\\n\\t\\t\\t\\thave related to his mother's side, because Mary belonged\\n\\t\\t\\t\\tto the priestly class descending from Aaron, and thus to\\n\\t\\t\\t\\tthe tribe of Levi, while David descended from the tribe\\n\\t\\t\\t\\tof Judah.) Whatever may have been the historical\\n\\t\\t\\t\\tcircumstances, it is evident that the honorific \"the\\n\\t\\t\\t\\tAnointed\" was applied to Jesus in his own lifetime. In\\n\\t\\t\\t\\tthe Greek version of the Gospels - which is undoubtedly\\n\\t\\t\\t\\tbased on a now-lost Aramaic original - this designation\\n\\t\\t\\t\\tis correctly translated as Christos (a noun derived from\\n\\t\\t\\t\\tthe Greek verb chriein, \"to anoint\"): and since it is in\\n\\t\\t\\t\\tthis form - \"the Christ\" - that the designation al-masih\\n\\t\\t\\t\\thas achieved currency in all Western languages, I am\\n\\t\\t\\t\\tusing it throughout in my translation."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "46",
    "NoteID": "33",
    "Body": "A metaphorical allusion to the prophetic wisdom which was\\n\\t\\t\\t\\tto inspire Jesus from a very early age. As regards the\\n\\t\\t\\t\\texpression min al-muqarrabin (\"of those who are drawn\\n\\t\\t\\t\\tnear\", i.e., unto God), see  56:11 , where the most\\n\\t\\t\\t\\texcellent among the inmates of paradise are thus\\n\\t\\t\\t\\tdescribed."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "47",
    "NoteID": "34",
    "Body": "See {19:16-22} and the corresponding notes. In the\\n\\t\\t\\t\\tcontext of the story of Mary in Al 'Imran, the\\n\\t\\t\\t\\tannouncement made to her, as well as the parallel one to\\n\\t\\t\\t\\tZachariah (verses {39-40} above), is meant to stress\\n\\t\\t\\t\\tGod's unlimited power of creation - specifically, in both\\n\\t\\t\\t\\tcases, His power to create the circumstances in which His\\n\\t\\t\\t\\twill is to manifest itself - and thus to bring about any\\n\\t\\t\\t\\tevent, however unexpected or even improbable it might\\n\\t\\t\\t\\tseem at the time of the announcement."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "48",
    "NoteID": "35",
    "Body": "Lit., \"to him\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "49",
    "NoteID": "36",
    "Body": "The passage which follows here - up to the end of verse\\n\\t\\t\\t\\t{51} - may be understood in either of two ways: as part\\n\\t\\t\\t\\tof the announcement made to Mary (implying that he would\\n\\t\\t\\t\\tthus speak in the future) or, alternatively, as a\\n\\t\\t\\t\\tstatement of what, at a later time, he actually did say\\n\\t\\t\\t\\tto the children of Israel. In view of the narrative form\\n\\t\\t\\t\\tadopted in verses {52} ff., the second of these two\\n\\t\\t\\t\\talternatives seems preferable."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "49",
    "NoteID": "37",
    "Body": "Lit., \"[something] like the shape of a bird (tayr); and\\n\\t\\t\\t\\tthen I shall breathe into it, so that it might [or\\n\\t\\t\\t\\t\"whereupon it will\"] become a bird...\". The noun tayr is\\n\\t\\t\\t\\ta plural of ta'ir (\"flying creature\" or \"bird\"), or an\\n\\t\\t\\t\\tinfinitive noun (\"flying\") derived from the verb tara\\n\\t\\t\\t\\t(\"he flew\"). In pre-Islamic usage, as well as in the\\n\\t\\t\\t\\tQur'an, the words ta'ir and tayr often denote \"fortune\"\\n\\t\\t\\t\\tor \"destiny\", whether good or evil (as, for instance, in\\n\\t\\t\\t\\t 7:131 ,  27:47  or  36:19 , and still more clearly in\\n\\t\\t\\t\\t 17:13 ). Many instances of this idiomatic use of tayr\\n\\t\\t\\t\\tand ta'ir are given in all the authoritative Arabic\\n\\t\\t\\t\\tdictionaries; see also Lane V, 1904 f. Thus, in the\\n\\t\\t\\t\\tparabolic manner so beloved by him, Jesus intimated to\\n\\t\\t\\t\\tthe children of Israel that out of the humble clay of\\n\\t\\t\\t\\ttheir lives he would fashion for them the vision of a\\n\\t\\t\\t\\tsoaring destiny, and that this vision, brought to life by\\n\\t\\t\\t\\this God-given inspiration, would become their real\\n\\t\\t\\t\\tdestiny by God's leave and by the strength of their faith\\n\\t\\t\\t\\t(as pointed out at the end of this verse)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "49",
    "NoteID": "38",
    "Body": "It is probable that the \"raising of the dead\" by Jesus is\r\\n\\t\\t\\t\\ta metaphorical description of his giving new life to\r\\n\\t\\t\\t\\tpeople who were spiritually dead; cf.  6:122  - \"Is then\r\\n\\t\\t\\t\\the who was dead [in spirit], and whom We thereupon gave\r\\n\\t\\t\\t\\tlife, and for whom We set up a light whereby he can see\r\\n\\t\\t\\t\\this way among men - [is then he] like unto one [who is\r\\n\\t\\t\\t\\tlost] in darkness deep, out of which he cannot emerge?\"\r\\n\\t\\t\\t\\tIf this interpretation is - as I believe - correct, then\r\\n\\t\\t\\t\\tthe \"healing of the blind and the leper\" has a similar\r\\n\\t\\t\\t\\tsignificance: namely, an inner regeneration of people who\r\\n\\t\\t\\t\\twere spiritually diseased and blind to the truth."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "49",
    "NoteID": "39",
    "Body": "I.e., \"what good things you may partake of in the life of\\n\\t\\t\\t\\tthis world, and what good deeds you should lay up as a\\n\\t\\t\\t\\ttreasure for the life to come\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "50",
    "NoteID": "40",
    "Body": "Lit., \"whatever there is between my hands\": for an\\n\\t\\t\\t\\texplanation, see note [3] on verse {3} of this surah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "52",
    "NoteID": "41",
    "Body": "This relates to a later time, when Jesus was being\\n\\t\\t\\t\\topposed by the majority of his people, and particularly\\n\\t\\t\\t\\tthe Pharisees."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "52",
    "NoteID": "42",
    "Body": "Al-hawariyyun (sing. hawari) is the designation applied\r\\n\\t\\t\\t\\tin the Qur'an to the disciples of Jesus. Many\r\\n\\t\\t\\t\\tinterpretations of this term (derived from hawar,\r\\n\\t\\t\\t\\t\"whiteness\") are given by the commentators, ranging from\r\\n\\t\\t\\t\\t\"one who whitens clothes by washing them\" (because this\r\\n\\t\\t\\t\\twas allegedly the occupation of some of Jesus' disciples)\r\\n\\t\\t\\t\\tto \"one who wears white garments\", or \"one whose heart is\r\\n\\t\\t\\t\\twhite\", i.e., pure (cf. Tabari, Razi, Ibn Kathir). It is,\r\\n\\t\\t\\t\\thowever, most probable - and the evidence provided by the\r\\n\\t\\t\\t\\trecently discovered Dead Sea Scrolls strongly supports\r\\n\\t\\t\\t\\tthis view - that the term hawari was popularly used to\r\\n\\t\\t\\t\\tdenote a member of the Essene Brotherhood, a Jewish\r\\n\\t\\t\\t\\treligious group which existed in Palestine at the time of\r\\n\\t\\t\\t\\tJesus, and to which, possibly, he himself belonged. The\r\\n\\t\\t\\t\\tEssenes were distinguished by their strong insistence on\r\\n\\t\\t\\t\\tmoral purity and unselfish conduct, and always wore white\r\\n\\t\\t\\t\\tgarments as the outward mark of their convictions; and\r\\n\\t\\t\\t\\tthis would satisfactorily explain the name given to them.\r\\n\\t\\t\\t\\tThe fact that the Prophet once said, \"Every prophet has\r\\n\\t\\t\\t\\this hawari\" (Bukhari and Muslim) does not conflict with\r\\n\\t\\t\\t\\tthe above view, since he obviously used this term\r\\n\\t\\t\\t\\tfiguratively, recalling thereby Jesus' \"helpers in God's\r\\n\\t\\t\\t\\tcause\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "53",
    "NoteID": "43",
    "Body": "Lit., \"write us down\" or \"inscribe us\". It must, however,\\n\\t\\t\\t\\tbe borne in mind that the verb kataba means also \"he drew\\n\\t\\t\\t\\ttogether\" or \"brought together\": hence the noun katibah,\\n\\t\\t\\t\\t\"a body of men\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "54",
    "NoteID": "44",
    "Body": "Lit., \"they schemed\" - here referring to those among the\\n\\t\\t\\t\\tJews who refused to acknowledge Jesus as a prophet and\\n\\t\\t\\t\\ttried to destroy him."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "55",
    "NoteID": "45",
    "Body": "This refers to all who revere Jesus (i.e., the\\n\\t\\t\\t\\tChristians, who believe him to be \"the son of God\", and\\n\\t\\t\\t\\tthe Muslims, who regard him as a prophet) as well as to\\n\\t\\t\\t\\tthose who deny him altogether. Regarding God's promise to\\n\\t\\t\\t\\tJesus, \"I shall exalt thee unto Me\", see surah {4}, note\\n\\t\\t\\t\\t[172]."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "58",
    "NoteID": "46",
    "Body": "Lit., \"This We convey unto thee of the messages and of\\n\\t\\t\\t\\tthe wise tiding.\" The expression \"this of the messages\"\\n\\t\\t\\t\\tbears, to my mind, the connotation of one particular\\n\\t\\t\\t\\tmessage - namely, the one which follows immediately after\\n\\t\\t\\t\\tthis sentence."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "59",
    "NoteID": "47",
    "Body": "Lit., \"The parable of Jesus is as the parable of\\n\\t\\t\\t\\tAdam...\", etc. The expression mathal (rendered above as\\n\\t\\t\\t\\t\"nature\") is often metaphorically employed to denote the\\n\\t\\t\\t\\tstate or condition (of a person or a thing), and is in\\n\\t\\t\\t\\tthis sense - as the commentators have pointed out -\\n\\t\\t\\t\\tsynonymous with sifah (the \"quality\" or \"nature\" of a\\n\\t\\t\\t\\tthing). As is evident from the sequence, the above\\n\\t\\t\\t\\tpassage is part of an argument against the Christian\\n\\t\\t\\t\\tdoctrine of the divinity of Jesus. The Qur'an stresses\\n\\t\\t\\t\\there as in many other places, the fact that Jesus, like\\n\\t\\t\\t\\tAdam - by which name, in this context, the whole human\\n\\t\\t\\t\\trace is meant - was only a mortal \"created out of dust\",\\n\\t\\t\\t\\ti.e., out of substances, both organic and inorganic,\\n\\t\\t\\t\\twhich are found in their elementary forms on and in the\\n\\t\\t\\t\\tearth. Cf. also  18:37   22:5 ,  30:20 ,  35:11 ,\\n\\t\\t\\t\\t 40:67 , where the Qur'an speaks of all human beings as\\n\\t\\t\\t\\t\"created out of dust\". That \"Adam\" stands here for the\\n\\t\\t\\t\\thuman race is clearly implied in the use of the present\\n\\t\\t\\t\\ttense in the last word of this sentence."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "61",
    "NoteID": "48",
    "Body": "I.e., regarding the true nature of Jesus. According to\\n\\t\\t\\t\\tall the reliable authorities, verses {59-63} of this\\n\\t\\t\\t\\tsurah were revealed in the year 10 H., on the occasion of\\n\\t\\t\\t\\ta dispute between the Prophet and a deputation of the\\n\\t\\t\\t\\tChristians of Najran who, like all other Christians,\\n\\t\\t\\t\\tmaintained that Jesus was \"the son of God\" and,\\n\\t\\t\\t\\ttherefore, God incarnate. Although they refused the\\n\\t\\t\\t\\t\"trial through prayer\" (mubahalah) proposed to them by\\n\\t\\t\\t\\tthe Prophet, the latter accorded to them a treaty\\n\\t\\t\\t\\tguaranteeing all their civic rights and the free exercise\\n\\t\\t\\t\\tof their religion."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "64",
    "NoteID": "49",
    "Body": "Lit., \"a word [that is] equitable between you and us\".\\n\\t\\t\\t\\tThe term kalimah, primarily meaning \"word\" or\\n\\t\\t\\t\\t\"utterance\", is often used in the philosophical sense of\\n\\t\\t\\t\\t\"proposition\" or \"tenet\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "64",
    "NoteID": "50",
    "Body": "Lit., \"that we shall not take one another for lords\\n\\t\\t\\t\\tbeside God\". Since the personal pronoun \"we\" obviously\\n\\t\\t\\t\\tapplies to human beings, the expression \"one another\"\\n\\t\\t\\t\\tnecessarily bears the same connotation. In its wider\\n\\t\\t\\t\\timplication, the above call is addressed not merely to\\n\\t\\t\\t\\tthe Christians, who attribute divinity to Jesus and\\n\\t\\t\\t\\tcertain aspects of divinity to their saints, but also to\\n\\t\\t\\t\\tthe Jews, who assign a quasi-divine authority to Ezra and\\n\\t\\t\\t\\teven to some of their great Talmudic scholars (cf.\\n\\t\\t\\t\\t{9:30-31})."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "65",
    "NoteID": "51",
    "Body": "I.e., as to whether the principles he followed were those\\n\\t\\t\\t\\tof the Jewish faith, according to which the Torah is\\n\\t\\t\\t\\tconsidered to be the final Law of God, or of the\\n\\t\\t\\t\\tChristian faith, which conflicts with the former in many\\n\\t\\t\\t\\trespects."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "66",
    "NoteID": "52",
    "Body": "I.e., as to what was the true creed of Abraham. \"That\\n\\t\\t\\t\\twhich is known to you\" is an allusion to their knowledge\\n\\t\\t\\t\\tof the obvious fact that many of the teachings based on\\n\\t\\t\\t\\tthe extant versions of the Torah and the Gospels conflict\\n\\t\\t\\t\\twith the teachings of the Qur'an (Razi)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "70",
    "NoteID": "53",
    "Body": "Lit., \"when you [yourselves] bear witness\": an allusion\\n\\t\\t\\t\\tto the Biblical prophecies relating to the coming of the\\n\\t\\t\\t\\tProphet Muhammad."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "72",
    "NoteID": "54",
    "Body": "Most of the commentators, relying on views current among\\n\\t\\t\\t\\tsome of the tabi'un (i.e., the generation that came after\\n\\t\\t\\t\\tthe Companions of the Prophet), understand this passage\\n\\t\\t\\t\\tthus: \"Declare at the beginning of the day your belief in\\n\\t\\t\\t\\twhat has been revealed unto those who believe in\\n\\t\\t\\t\\tMuhammad, and deny the truth [thereof] in its latter\\n\\t\\t\\t\\tpart.\" This rendering would imply that the\\n\\t\\t\\t\\tJudaeo-Christian attempts at confusing the Muslims, to\\n\\t\\t\\t\\twhich the above verse refers, consisted in alternatingly\\n\\t\\t\\t\\tdeclaring belief and disbelief in the Qur'anic message.\\n\\t\\t\\t\\tOn the other hand, the rendering adopted by me (and\\n\\t\\t\\t\\tsupported by Al-Asam, whose interpretation has been\\n\\t\\t\\t\\tquoted by Razi in his commentary on this verse) implies\\n\\t\\t\\t\\tthat some Jews and Christians have been and are hoping to\\n\\t\\t\\t\\tachieve this end by admitting, however reluctantly, that\\n\\t\\t\\t\\tthere may be \"some truth\" in the early Qur'anic\\n\\t\\t\\t\\trevelations (\"that which has been revealed at the\\n\\t\\t\\t\\tbeginning of the day\"), while they categorically reject\\n\\t\\t\\t\\tits later parts inasmuch as they clearly contradict\\n\\t\\t\\t\\tcertain Biblical teachings."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "73",
    "NoteID": "55",
    "Body": "This refers to the Jews and the Christians, who are not\\n\\t\\t\\t\\tprepared to accept the Qur'anic message on the ground\\n\\t\\t\\t\\tthat it conflicts with parts of their own scriptures."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "73",
    "NoteID": "56",
    "Body": "In this context, the term fadl (\"bounty\") is synonymous\\n\\t\\t\\t\\twith the bestowal of divine revelation."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "75",
    "NoteID": "57",
    "Body": "Lit., \"this, because they say\". In Arabic usage, the verb\\n\\t\\t\\t\\tqala (lit., \"he said\") often signifies \"he asserted\" or\\n\\t\\t\\t\\t\"expressed an opinion\". As is evident from many\\n\\t\\t\\t\\tTraditions, the people referred to are the Jews."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "75",
    "NoteID": "58",
    "Body": "I.e., they falsely claim that God Himself has exempted\\n\\t\\t\\t\\tthem from all moral responsibility towards non-Jews\\n\\t\\t\\t\\t(contemptuously described as \"unlettered folk\"), knowing\\n\\t\\t\\t\\twell that their own scriptures provide no basis whatever\\n\\t\\t\\t\\tfor such a claim."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "76",
    "NoteID": "59",
    "Body": "Some of the commentators relate the personal pronoun in\\n\\t\\t\\t\\t'ahdihi to the person or persons concerned, and therefore\\n\\t\\t\\t\\ttake 'ahd as meaning \"promise\" - thus: \"[as for] him who\\n\\t\\t\\t\\tfulfils his promise...\", etc. It is, however, obvious\\n\\t\\t\\t\\tfrom the next verse that the pronoun in 'ahdihi refers to\\n\\t\\t\\t\\tGod; consequently, the phrase must be rendered either as\\n\\t\\t\\t\\t\"those who fulfil their duty towards Him\", or \"those who\\n\\t\\t\\t\\tkeep their bond with Him\" - the latter being, in my\\n\\t\\t\\t\\topinion, preferable. (For the meaning of man's \"bond with\\n\\t\\t\\t\\tGod\", see surah {2}, note [19].)"
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "78",
    "NoteID": "60",
    "Body": "Most of the commentators assume that this refers\\n\\t\\t\\t\\tspecifically to the Jews, whom the Qur'an frequently\\n\\t\\t\\t\\taccuses of having deliberately corrupted the Old\\n\\t\\t\\t\\tTestament. However, since the next two verses clearly\\n\\t\\t\\t\\trelate to Jesus and to the false beliefs of the\\n\\t\\t\\t\\tChristians regarding his nature and mission, we must\\n\\t\\t\\t\\tconclude that both Jews and Christians are referred to in\\n\\t\\t\\t\\tthis passage. For this reason, the term al-kitab, which\\n\\t\\t\\t\\toccurs three times in this sentence, has been rendered\\n\\t\\t\\t\\there as \"the Bible\". - According to Muhammad 'Abduh\\n\\t\\t\\t\\t(Manar III, 345), the above-mentioned distortion of the\\n\\t\\t\\t\\tBible does not necessarily presuppose a corruption of the\\n\\t\\t\\t\\ttext as such: it can also be brought about \"by\\n\\t\\t\\t\\tattributing to an expression a meaning other than the one\\n\\t\\t\\t\\twhich was originally intended\". As an example, 'Abduh\\n\\t\\t\\t\\tquotes the metaphorical use, in the Gospels, of the term\\n\\t\\t\\t\\t\"my Father\" with reference to God - by which term, as is\\n\\t\\t\\t\\tevident from the Lord's Prayer, was obviously meant the\\n\\t\\t\\t\\t\"Father\" - i.e., the Originator and Sustainer - of all\\n\\t\\t\\t\\tmankind. Subsequently, however, some of those who claimed\\n\\t\\t\\t\\tto be followers of Jesus lifted this expression from the\\n\\t\\t\\t\\trealm of metaphor and \"transferred it to the realm of\\n\\t\\t\\t\\tpositive reality with reference to Jesus alone\": and thus\\n\\t\\t\\t\\tthey gave currency to the idea that he was literally \"the\\n\\t\\t\\t\\tson of God\", that is, God incarnate."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "79",
    "NoteID": "61",
    "Body": "This obvious reference to Jesus reads, literally, \"It is\r\\n\\t\\t\\t\\tnot [possible] for a human being that God should grant\r\\n\\t\\t\\t\\thim...and that thereafter he should say...\". Zamakhshari\r\\n\\t\\t\\t\\tregards the term hukm (\"judgment\" or \"sound judgment\")\r\\n\\t\\t\\t\\toccurring in the above sentence as synonymous, in this\r\\n\\t\\t\\t\\tcontext, with hikmah (\"wisdom\")."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "79",
    "NoteID": "62",
    "Body": "According to Sibawayh (as quoted by Razi), a rabbani is\\n\\t\\t\\t\\t\"one who devotes himself exclusively to the endeavour to\\n\\t\\t\\t\\tknow the Sustainer (ar-rabb) and to obey Him\": a\\n\\t\\t\\t\\tconnotation fairly close to the English expression \"a man\\n\\t\\t\\t\\tof God\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "80",
    "NoteID": "63",
    "Body": "I.e., to attribute divine or semi-divine powers to them:\\n\\t\\t\\t\\ta categorical rejection of the adoration of saints and\\n\\t\\t\\t\\tangelic beings."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "81",
    "NoteID": "64",
    "Body": "Lit., \"the solemn pledge of the prophets\". Zamakhshari\\n\\t\\t\\t\\tholds that what is meant here is a pledge taken from the\\n\\t\\t\\t\\tcommunity as a whole: a pledge consisting in their\\n\\t\\t\\t\\tacceptance of the messages conveyed through the prophets."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "81",
    "NoteID": "65",
    "Body": "Lit., \"and I am with you among the witnesses\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "83",
    "NoteID": "66",
    "Body": "Lit., \"[any] other than God's religion\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "83",
    "NoteID": "67",
    "Body": "Lit., \"will be returned\". For an explanation of this\\n\\t\\t\\t\\tsentence, see  13:15  and the corresponding notes."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "84",
    "NoteID": "68",
    "Body": "See  2:136  and the corresponding note [112]."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "86",
    "NoteID": "69",
    "Body": "The people referred to are the Jews and the Christians.\\n\\t\\t\\t\\tTheir acceptance of the Bible, which predicts the coming\\n\\t\\t\\t\\tof the Prophet Muhammad, has made them \"witnesses\" to the\\n\\t\\t\\t\\ttruth of his prophethood. See also verses {70} and {81}\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "90",
    "NoteID": "70",
    "Body": "My interpolation, between brackets, of the words \"of\\n\\t\\t\\t\\tother sins\" is based on Tabari's convincing explanation\\n\\t\\t\\t\\tof this passage."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "91",
    "NoteID": "71",
    "Body": "Lit., \"there shall not be accepted from any of them the\\n\\t\\t\\t\\tearth full of gold, were he to proffer it in ransom\". The\\n\\t\\t\\t\\tmeaning of this sentence is obviously metaphorical; but\\n\\t\\t\\t\\tin view of the mention of \"ransom\", some of the\\n\\t\\t\\t\\tcommentators are of the opinion that what is meant here\\n\\t\\t\\t\\tare otherwise good actions in this world (and, in\\n\\t\\t\\t\\tparticular, efforts and possessions spent for the sake of\\n\\t\\t\\t\\thelping one's fellow-men), on the strength of which such\\n\\t\\t\\t\\tstubborn \"deniers of the truth\" might plead for God's\\n\\t\\t\\t\\tclemency on the Day of Judgment - a plea that would be\\n\\t\\t\\t\\trejected on the ground of their deliberate denial of\\n\\t\\t\\t\\tfundamental truths."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "92",
    "NoteID": "72",
    "Body": "After telling those who deliberately deny the truth that\\n\\t\\t\\t\\teven their benevolent spending of efforts and possessions\\n\\t\\t\\t\\tduring their lifetime will be of no avail to them on the\\n\\t\\t\\t\\tDay of Judgment, the Qur'an reminds the believers that,\\n\\t\\t\\t\\ton the other hand, their faith in God cannot be\\n\\t\\t\\t\\tconsidered complete unless it makes them conscious of the\\n\\t\\t\\t\\tmaterial needs of their fellow-beings (cf.  2:177 )."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "93",
    "NoteID": "73",
    "Body": "Up to this point, most of this surah dealt with the\\n\\t\\t\\t\\tdivine origin of the Qur'an and was meant to establish\\n\\t\\t\\t\\tthe true nature of the mission entrusted to the Prophet -\\n\\t\\t\\t\\tnamely, his call to an acknowledgement of God's oneness\\n\\t\\t\\t\\tand uniqueness. Now, verses {93-97} are devoted to a\\n\\t\\t\\t\\trefutation of two objections on the part of the Jews to\\n\\t\\t\\t\\twhat they consider to be an infringement, by the Qur'an,\\n\\t\\t\\t\\tof Biblical laws, in spite of the oft-repeated Qur'anic\\n\\t\\t\\t\\tclaim that this revelation confirms the truth inherent in\\n\\t\\t\\t\\tthe teachings of the earlier prophets. These two\\n\\t\\t\\t\\tobjections relate to (a) the Qur'anic annulment of\\n\\t\\t\\t\\tcertain dietary injunctions and prohibitions laid down in\\n\\t\\t\\t\\tthe Torah, and (b) the alleged \"substitution\" of Mecca\\n\\t\\t\\t\\tfor Jerusalem as the direction of prayer (qiblah) - see\\n\\t\\t\\t\\tsurah {2}, note [116]. In order to answer the objection\\n\\t\\t\\t\\trelating to Jewish food laws, the Qur'an calls to mind\\n\\t\\t\\t\\tthat originally all wholesome foods were lawful to the\\n\\t\\t\\t\\tchildren of Israel, and that the severe restrictions\\n\\t\\t\\t\\tsubsequently imposed upon them in the Torah were but a\\n\\t\\t\\t\\tpunishment for their sins (cf.  6:146 ), and were,\\n\\t\\t\\t\\ttherefore, never intended for a community that truly\\n\\t\\t\\t\\tsurrenders itself to God. For an answer to the second\\n\\t\\t\\t\\tobjection, see verse {96}."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "94",
    "NoteID": "74",
    "Body": "This is a reference to the unwarranted Jewish belief that\\n\\t\\t\\t\\tthe Mosaic food restrictions were an eternal law decreed\\n\\t\\t\\t\\tby God. As against this claim, the Qur'an stresses that\\n\\t\\t\\t\\tno food restrictions had been imposed before the time of\\n\\t\\t\\t\\tMoses and, secondly, that the restrictions arising from\\n\\t\\t\\t\\tthe Mosaic Law were imposed on the children of Israel\\n\\t\\t\\t\\talone. To claim that they represent an eternal divine law\\n\\t\\t\\t\\tis described here as \"inventing lies about God\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "96",
    "NoteID": "75",
    "Body": "All authorities agree that this name is synonymous with\r\\n\\t\\t\\t\\tMecca (which, correctly transliterated, is spelt Makkah).\r\\n\\t\\t\\t\\tVarious etymologies have been suggested for this very\r\\n\\t\\t\\t\\tancient designation; but the most plausible explanation\r\\n\\t\\t\\t\\tis given by Zamakhshari (and supported by Razi): in some\r\\n\\t\\t\\t\\told Arabic dialects the labial consonants b and m, being\r\\n\\t\\t\\t\\tphonetically close to one another, are occasionally\r\\n\\t\\t\\t\\tinterchangeable. The mention, in this context, of the\r\\n\\t\\t\\t\\tTemple in Mecca - that is, the Ka'bah - arises from the\r\\n\\t\\t\\t\\tfact that it is the direction of prayer (qiblah)\r\\n\\t\\t\\t\\tstipulated in the Qur'an. Since the prototype of the\r\\n\\t\\t\\t\\tKa'bah was built by Abraham and Ishmael (see  2:125  ff.)\r\\n\\t\\t\\t\\t- and is, therefore, much older than the Temple of\r\\n\\t\\t\\t\\tSolomon in Jerusalem - its establishment as the qiblah of\r\\n\\t\\t\\t\\tthe followers of the Quran does not only not imply any\r\\n\\t\\t\\t\\tbreak with the Abrahamic tradition (on which, ultimately,\r\\n\\t\\t\\t\\tthe whole Bible rests), but, on the contrary,\r\\n\\t\\t\\t\\tre-establishes the direct contact with that Patriarch:\r\\n\\t\\t\\t\\tand herein lies the answer to the second of the two\r\\n\\t\\t\\t\\tJewish objections mentioned in note [73] above."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "97",
    "NoteID": "76",
    "Body": "Lit., \"in it [are] clear messages\" - such as the messages\\n\\t\\t\\t\\trelating to God's oneness and uniqueness (symbolized by\\n\\t\\t\\t\\tthe Ka'bah), to the continuity of mankind's religious\\n\\t\\t\\t\\texperience (\"the first Temple set up for mankind\") and,\\n\\t\\t\\t\\tfinally, to the brotherhood of all believers (who,\\n\\t\\t\\t\\twherever they may be, turn their faces in prayer towards\\n\\t\\t\\t\\tthis one focal point)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "97",
    "NoteID": "77",
    "Body": "Or: \"is secure\" - i.e., in the original sense of amn,\\n\\t\\t\\t\\twhich implies \"ease of mind and freedom from fear\" (cf.\\n\\t\\t\\t\\tLane I, 100 f.)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "99",
    "NoteID": "78",
    "Body": "I.e., \"through your own scriptures\" (see note [69] above,\\n\\t\\t\\t\\tas well as note [33] on  2:42 ). This is an allusion to\\n\\t\\t\\t\\tthe attempts of Jews and Christians to \"prove\" that\\n\\t\\t\\t\\tMuhammad had \"borrowed\" the main ideas of the Qur'an from\\n\\t\\t\\t\\tthe Bible and twisted them out of context so as to suit\\n\\t\\t\\t\\this own alleged \"ambitions\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "103",
    "NoteID": "79",
    "Body": "Lit., \"a pit of fire\" - a metaphor of the sufferings\\n\\t\\t\\t\\twhich are the inescapable consequence of spiritual\\n\\t\\t\\t\\tignorance. The reminder of their one-time mutual enmity\\n\\t\\t\\t\\tis an allusion to man's lot on earth (cf.  2:36  and\\n\\t\\t\\t\\t 7:24 ), from which only God's guidance can save him (see\\n\\t\\t\\t\\t{2:37-38})."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "105",
    "NoteID": "80",
    "Body": "I.e., like the followers of the Bible, who became \"Jews\"\\n\\t\\t\\t\\tand \"Christians\" in spite of the fact that their beliefs\\n\\t\\t\\t\\thave a common source and are based on the same spiritual\\n\\t\\t\\t\\ttruths (see also  6:159  and the corresponding note)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "108",
    "NoteID": "81",
    "Body": "Lit., \"to the worlds\". For an explanation of this\\n\\t\\t\\t\\tsentence, see {6:131-132} and note [117]."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "111",
    "NoteID": "82",
    "Body": "As is obvious from the opening sentence of verse {110},\\n\\t\\t\\t\\tthis promise to the followers of the Qur'an is\\n\\t\\t\\t\\tconditional upon their being, or remaining, a community\\n\\t\\t\\t\\tof people who \"enjoin the doing of what is right and\\n\\t\\t\\t\\tforbid the doing of what is wrong, and [truly] believe in\\n\\t\\t\\t\\tGod\"; and - as history has shown - this promise is bound\\n\\t\\t\\t\\tto lapse whenever the Muslims fail to live up to their\\n\\t\\t\\t\\tfaith."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "112",
    "NoteID": "83",
    "Body": "I.e., if they return to the concept of God as the Lord\\n\\t\\t\\t\\tand Sustainer of all mankind, and give up the idea of\\n\\t\\t\\t\\tbeing \"God's chosen people\" which creates a barrier\\n\\t\\t\\t\\tbetween them and all other believers in the One God."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "112",
    "NoteID": "84",
    "Body": "The above passage - as the very similar one in  2:61  -\\n\\t\\t\\t\\trelates specifically to the children of Israel, although\\n\\t\\t\\t\\tthis section as a whole (verses {110-115}) obviously\\n\\t\\t\\t\\trefers to the followers of the Bible in general, that is,\\n\\t\\t\\t\\tto both the Jews and the Christians."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "113",
    "NoteID": "85",
    "Body": "Lit., \"an upright community\": a reference to those among\\n\\t\\t\\t\\tthe followers of the Bible who are truly believers (cf.\\n\\t\\t\\t\\tthe last sentence of verse {110} above) and observe the\\n\\t\\t\\t\\t\"bond with God and with men\" (verse {112})."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "117",
    "NoteID": "86",
    "Body": "In a marginal note connected with his commentary on this\r\\n\\t\\t\\t\\tverse, Zamakhshari explains this parable thus: \"If the\r\\n\\t\\t\\t\\t'tilth' [i.e., the gainful achievement] of those who deny\r\\n\\t\\t\\t\\tthe truth is lost, it is lost in its entirety, with\r\\n\\t\\t\\t\\tnothing remaining to them in this world and in the life\r\\n\\t\\t\\t\\tto come; while, on the other hand, the 'tilth' of a\r\\n\\t\\t\\t\\tbeliever is never lost in its entirety: for even if it is\r\\n\\t\\t\\t\\tseemingly lost, there remains to him the expectation of a\r\\n\\t\\t\\t\\treward, in the life to come, for his patience in\r\\n\\t\\t\\t\\tadversity.\" In other words, the above Qur'anic phrase is\r\\n\\t\\t\\t\\tmeant to stress the completeness of loss of all efforts\r\\n\\t\\t\\t\\tin the case of those who are bent on denying the truth."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "118",
    "NoteID": "87",
    "Body": "Lit., \"from among others than yourselves\". Some of the\\n\\t\\t\\t\\tcommentators incline to the view that this expression\\n\\t\\t\\t\\tcomprises all non-Muslims: but this view obviously\\n\\t\\t\\t\\tconflicts with {60:8-9}, where the believers are\\n\\t\\t\\t\\texpressly allowed to form friendships with such of the\\n\\t\\t\\t\\tnon-believers as are not hostile to them and to their\\n\\t\\t\\t\\tfaith. Moreover, the sequence makes it clear that by\\n\\t\\t\\t\\t\"those who are not of your kind\" are meant only people\\n\\t\\t\\t\\twhose enmity to Islam and its followers has become\\n\\t\\t\\t\\tapparent from their behaviour and their utterances\\n\\t\\t\\t\\t(Tabari). The rendering adopted by me, \"people who are\\n\\t\\t\\t\\tnot of your kind\", implies that their outlook on life is\\n\\t\\t\\t\\tso fundamentally opposed to that of the Muslims that\\n\\t\\t\\t\\tgenuine friendship is entirely out of the question."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "118",
    "NoteID": "88",
    "Body": "Lit., \"they love that which causes you distress\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "119",
    "NoteID": "89",
    "Body": "I.e., including the revelation of the Bible."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "121",
    "NoteID": "90",
    "Body": "This reference to the battle of Uhud, to which many verses of this surah are devoted, connects with the exhortation implied in the preceding verse, \"if you are patient in adversity and conscious of God, their guile cannot harm you at all\". Since this and the subsequent references cannot be fully understood without a knowledge of the historical background, a brief account of the battle would seem to be indicated. In order to avenge their catastrophic defeat at Badr in the second year after the hijrah, the pagan Meccans - supported by several tribes hostile to the Muslims - mustered in the following year an army comprising ten thousand men under the command of Abu Sufyan and marched against Medina. On hearing of their approach, in the month of Shawwal 3 H., the Prophet held a council of war at which the tactics to be adopted were discussed. In view of the overwhelming cavalry forces at the disposal of the enemy, the Prophet himself was of the opinion that the Muslims should give battle from behind the fortifications of Medina and, if need be, fight in its narrow streets and lanes; and his plan was supported by some of the most outstanding among his Companions. However, the majority of the Muslim leaders who participated in the council strongly insisted on going forth and meeting the enemy in the open field. In obedience to the Qur'anic principle that all communal affairs must be transacted on the basis of mutually-agreed decisions (see verse 159 of this surah, as well as 42 : 38), the Prophet sorrowfully gave way to the will of the majority and set out with his followers towards the plain below the mountain of Uhud, a little over three miles from Medina. His army consisted of less than one thousand men; but on the way to Mount Uhud this number was still further reduced by the defection of some three hundred men led by the hypocritical 'Abd Allah ibn Ubayy, who pretended to be convinced that the Muslims did not really intend to fight. Shortly before the battle, two other groups from among the Prophet's forces - namely, the clans of Banu Salamah (of the tribe of Al-Aws) and Banu Harithah (of the tribe of Khazraj) almost lost heart and were about to join the defectors (3 : 122) on the plea that because of their numerical weakness the Muslims must now avoid giving battle; but at the last moment they decided to follow the Prophet. Having less than seven hundred men with him, the Prophet arrayed the bulk of his forces with their backs to the mountain and posted all his archers - numbering fifty - on a nearby hill in order to provide cover against an outflanking manoeuvre by the enemy cavalry; these archers were ordered not to leave their post under any circumstances. In their subsequent, death-defying assault upon the greatly superior forces of the pagan Quraysh, the Muslims gained a decisive advantage over the former and almost routed them. At that moment, however, most of the archers, believing that the battle had been won and fearing lest they lose their share of the spoils, abandoned their covering position and joined the melee around the encampment of the Quraysh. Seizing this opportunity, the bulk of the Meccan cavalry under the command of Khalid ibn al-Walid (who shortly after this battle embraced Islam and later became one of the greatest Muslim generals of all times) veered round in a wide arc and attacked the Muslim forces from the rear. Deprived of the cover of the archers, and caught between two fires, the Muslims retreated in disorder, with the loss of many lives. The Prophet himself and a handful of his most stalwart Companions defended themselves desperately; and the Prophet was seriously injured and fell to the ground. The cry immediately arose, \"The Apostle of God has been killed!\" Many of the Muslims began to flee; some among them were even prepared to throw themselves upon the mercy of the enemy. But a few of the Companions - among them 'Umar ibn al-Khattab and Talhah - called out, \"What good are your lives without him, O believers? Let us die as he has died!\" - and threw themselves with the strength of despair against the Meccans. Their example at once found an echo among the rest of the Muslims, who in the meantime had learnt that the Prophet was alive: they rallied and counter-attacked the enemy, and thus saved the day. But the Muslims were now too exhausted to exploit their chances of victory, and the battle ended in a draw, with the enemy retreating in the direction of Mecca. On the next day the Prophet started in pursuit of them at the head of seventy of his Companions. But when the Muslims reached the place called Hamra' al-Asad, about eight miles south of Medina, it became obvious that the Meccans were in no mood to risk another encounter and were rapidly marching home; and thereupon the tiny Muslim army returned to Medina. "
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "122",
    "NoteID": "91",
    "Body": "I.e., the clans of Banu Salamah and Banu Harithah, who\\n\\t\\t\\t\\thad almost joined the deserters led by 'Abd Allah ibn\\n\\t\\t\\t\\tUbayy (see preceding note)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "123",
    "NoteID": "92",
    "Body": "A reference to the battle of Badr, in 2 H., which is\\n\\t\\t\\t\\tdealt with extensively in surah {8}."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "125",
    "NoteID": "93",
    "Body": "As is evident from the next verse, the Prophet's allusion\\n\\t\\t\\t\\tto God's aiding the believers with thousands of angels\\n\\t\\t\\t\\tsignifies, metaphorically, a strengthening of the\\n\\t\\t\\t\\tbelievers' hearts through spiritual forces coming from\\n\\t\\t\\t\\tGod (Manar IV, 112 ff., and IX, 612 ff.). A very similar\\n\\t\\t\\t\\tannouncement - relating to the battle of Badr - occurs in\\n\\t\\t\\t\\t{8:9-10}, where \"one thousand\" angels are mentioned. As\\n\\t\\t\\t\\tregards these varying numbers (one, three and five\\n\\t\\t\\t\\tthousand), they would seem to indicate the unlimited\\n\\t\\t\\t\\tnature of God's aid to those who are \"patient in\\n\\t\\t\\t\\tadversity and conscious of Him\". It is reasonable to\\n\\t\\t\\t\\tassume that the Prophet thus exhorted his followers\\n\\t\\t\\t\\timmediately before the battle of Uhud, that is, after\\n\\t\\t\\t\\tthree hundred men under the leadership of 'Abd Allah ibn\\n\\t\\t\\t\\tUbayy had deserted him and some of the others \"almost\\n\\t\\t\\t\\tlost heart\" in the face of the greatly superior enemy\\n\\t\\t\\t\\tforces."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "126",
    "NoteID": "94",
    "Body": "According to many commentators (see Manar IV, 112), this\\n\\t\\t\\t\\tinterpolation is justified by the preceding two verses,\\n\\t\\t\\t\\twhich show that it was the Prophet who, under divine\\n\\t\\t\\t\\tinspiration, made this promise to his followers. See also\\n\\t\\t\\t\\t 8:9 , where a similar promise is voiced on the occasion\\n\\t\\t\\t\\tof the battle of Badr."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "127",
    "NoteID": "95",
    "Body": "Lit., \"that He might destroy some...or [so] abase them\".\\n\\t\\t\\t\\tIt is obvious that the particle aw (\"or\") does not, in\\n\\t\\t\\t\\tthis context, denote an alternative but, rather, a\\n\\t\\t\\t\\tspecification (tanwi') - as, for instance, in the phrase\\n\\t\\t\\t\\t\"ten persons were killed or injured\": meaning that some\\n\\t\\t\\t\\tof them were killed and others injured."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "129",
    "NoteID": "96",
    "Body": "As recorded in several authentic Traditions, the Prophet\r\\n\\t\\t\\t\\tinvoked, during the battle of Uhud, God's curse upon the\r\\n\\t\\t\\t\\tleaders of the pagan Quraysh (Bukhari, Tirmidhi, Nasa'i\r\\n\\t\\t\\t\\tand Ahmad ibn Hanbal); and when he lay on the ground\r\\n\\t\\t\\t\\tseverely injured, he exclaimed, \"How could those people\r\\n\\t\\t\\t\\tprosper after having done this to their prophet, who but\r\\n\\t\\t\\t\\tinvites them to [acknowledge] their Sustainer?\" - whereupon\r\\n\\t\\t\\t\\tthe above two verses were revealed (Muslim and Ibn\r\\n\\t\\t\\t\\tHanbal)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "130",
    "NoteID": "97",
    "Body": "For a definition of riba (\"usury\"), see note [35] on\\n\\t\\t\\t\\t 30:39 , the earliest Qur'anic reference to this term. As\\n\\t\\t\\t\\tfor the connection of the above verse with the\\n\\t\\t\\t\\tsubject-matter dealt with in the foregoing, the best\\n\\t\\t\\t\\texplanation is, to my mind, the one offered by Qiffal (as\\n\\t\\t\\t\\tquoted by Razi): Since it was mainly through usurious\\n\\t\\t\\t\\tgains that the pagan Meccans had acquired the wealth\\n\\t\\t\\t\\twhich enabled them to equip their powerful army and\\n\\t\\t\\t\\talmost to defeat the poorly-armed Muslims at Uhud, the\\n\\t\\t\\t\\tlatter might have been tempted to emulate their enemies\\n\\t\\t\\t\\tin this respect; and it was to remove this temptation -\\n\\t\\t\\t\\tfrom them as well as from later generations of believers\\n\\t\\t\\t\\t- that the prohibition of usury was once again stressed\\n\\t\\t\\t\\tthrough revelation."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "137",
    "NoteID": "98",
    "Body": "The word sunnah (of which sunan is the plural) denotes a\\n\\t\\t\\t\\t\"way of life\" or \"conduct\" (hence its application, in\\n\\t\\t\\t\\tIslamic terminology, to the way of life of the Prophet as\\n\\t\\t\\t\\tan example for his followers). In the above passage, the\\n\\t\\t\\t\\tterm sunan refers to the \"conditions (ahwal)\\n\\t\\t\\t\\tcharacteristic of past centuries\" (Razi), in which,\\n\\t\\t\\t\\tdespite all the continuous changes, an ever-recurring\\n\\t\\t\\t\\tpattern can be discerned: a typically Qur'anic reference\\n\\t\\t\\t\\tto the possibility, and necessity, of learning from man's\\n\\t\\t\\t\\tpast experiences."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "139",
    "NoteID": "99",
    "Body": "A reference to the near-disaster at Uhud and the heavy\\n\\t\\t\\t\\tloss of lives (about seventy men) which the Muslims had\\n\\t\\t\\t\\tsuffered."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "140",
    "NoteID": "100",
    "Body": "Lit., \"a wound\" (qarh) or, according to some\\n\\t\\t\\t\\tphilologists, \"pain caused by a wound\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "140",
    "NoteID": "101",
    "Body": "I.e., \"His decision to let some of you die as martyrs in\\n\\t\\t\\t\\tHis cause is not due to love of the sinful enemies who\\n\\t\\t\\t\\toppose you, but to His love for you.\" The term shuhada'\\n\\t\\t\\t\\t(pl. of shahid) denotes \"witnesses\" as well as \"martyrs\".\\n\\t\\t\\t\\tThe rendering adopted by me comprises both the concepts\\n\\t\\t\\t\\tof \"bearing witness to the truth\" and of \"martyrdom\" in\\n\\t\\t\\t\\tGod's cause."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "142",
    "NoteID": "102",
    "Body": "Lit., \"while God has not yet taken cognizance of those of\\n\\t\\t\\t\\tyou who have striven...and those who are patient in\\n\\t\\t\\t\\tadversity\". Since God is all-knowing, His \"not taking\\n\\t\\t\\t\\tcognizance\" implies, of course, that the thing or\\n\\t\\t\\t\\thappening referred to has not come about or is\\n\\t\\t\\t\\tnon-existent (Zamakhshari)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "143",
    "NoteID": "103",
    "Body": "In Zamakhshari's opinion, this is a twofold reproach\\n\\t\\t\\t\\taddressed to the majority of the Companions who took part\\n\\t\\t\\t\\tin the battle of Uhud: firstly, on account of their\\n\\t\\t\\t\\tinsistence, against the Prophet's advice, on giving\\n\\t\\t\\t\\tbattle to the enemy in the open field and thereby\\n\\t\\t\\t\\tunnecessarily courting a deadly danger; and, secondly, on\\n\\t\\t\\t\\taccount of their failure to live up to their faith during\\n\\t\\t\\t\\tthe earlier part of the battle (see note [90] above).\\n\\t\\t\\t\\tThis passage may have yet another, more positive\\n\\t\\t\\t\\timplication: namely, a reference to the lesson which the\\n\\t\\t\\t\\tbelievers should draw from their near-defeat, and a\\n\\t\\t\\t\\treminder of the fact that their future depends on the\\n\\t\\t\\t\\tstrength of their faith in God (cf. verse {139} above)\\n\\t\\t\\t\\tand not on a fleeting desire for self-sacrifice."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "144",
    "NoteID": "104",
    "Body": "This stress on the mortality of the Prophet - and that of\\n\\t\\t\\t\\tall the other prophets who preceded him in time -\\n\\t\\t\\t\\tconnects, in the first instance, with the battle of Uhud\\n\\t\\t\\t\\tand the rumour of his death, which caused many Muslims to\\n\\t\\t\\t\\tabandon the fight and even brought some of them close to\\n\\t\\t\\t\\tapostasy (Tabari; see also note [90] above). In its wider\\n\\t\\t\\t\\timplication, however, the above verse re-states the\\n\\t\\t\\t\\tfundamental Islamic doctrine that adoration is due to God\\n\\t\\t\\t\\talone, and that no human being - not even a prophet - may\\n\\t\\t\\t\\thave any share in it. It was this very passage of the\\n\\t\\t\\t\\tQur'an which Abu Bakr, the first Caliph, recited\\n\\t\\t\\t\\timmediately after the Prophet's death, when many\\n\\t\\t\\t\\tfaint-hearted Muslims thought that Islam itself had come\\n\\t\\t\\t\\tto an end; but as soon as Abu Bakr added, \"Behold,\\n\\t\\t\\t\\twhoever has worshipped Muhammad may know that Muhammad\\n\\t\\t\\t\\thas died; but whoever worships God may know that God is\\n\\t\\t\\t\\tever-living, and never dies\" (Bukhari), all confusion was\\n\\t\\t\\t\\tstilled. - The expression \"turning about on one's heels\"\\n\\t\\t\\t\\tdenotes - according to circumstances - either actual\\n\\t\\t\\t\\tapostasy or a deliberate withdrawal from efforts in the\\n\\t\\t\\t\\tcause of God."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "150",
    "NoteID": "105",
    "Body": "Lit., \"He is the best of all who bring succour\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "151",
    "NoteID": "106",
    "Body": "I.e., something which He never permits. The use of the\\n\\t\\t\\t\\tadverb \"never\" in my rendering is based on the\\n\\t\\t\\t\\tgrammatical form lam yunazzil (lit., \"He has not been\\n\\t\\t\\t\\tsending down\" or \"bestowing from on high\"), which implies\\n\\t\\t\\t\\tcontinuity in time."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "152",
    "NoteID": "107",
    "Body": "Lit., \"when you were destroying them\": a reference to the\\n\\t\\t\\t\\topening stages of the battle of Uhud. Regarding the\\n\\t\\t\\t\\tpromise alluded to, see verses {124-125} of this surah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "152",
    "NoteID": "108",
    "Body": "Lit., \"you disagreed with one another regarding the\\n\\t\\t\\t\\t[Prophet's] command\" - an allusion to the abandonment of\\n\\t\\t\\t\\ttheir post by most of the archers at the moment when it\\n\\t\\t\\t\\tseemed that victory had been won (see note [90] above)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "152",
    "NoteID": "109",
    "Body": "Out of the fifty Muslim archers less than ten remained at\\n\\t\\t\\t\\ttheir post, and were killed by Khalid's cavalry. It is to\\n\\t\\t\\t\\tthem, as well as the few Companions who went on fighting\\n\\t\\t\\t\\tafter the bulk of the Muslims had fled, that the second\\n\\t\\t\\t\\tpart of the above sentence refers."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "152",
    "NoteID": "110",
    "Body": "Lit., \"He turned you away from them\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "153",
    "NoteID": "111",
    "Body": "I.e., the realization of how shamefully they had behaved\\n\\t\\t\\t\\tat Uhud (see note [90] above) would be, in the end, more\\n\\t\\t\\t\\tpainful to them than the loss of victory and the death of\\n\\t\\t\\t\\tso many of their comrades: and this is the meaning of the\\n\\t\\t\\t\\t\"test\" mentioned in the preceding verse."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "154",
    "NoteID": "112",
    "Body": "I.e., those who had remained steadfast throughout the\\n\\t\\t\\t\\tbattle. According to some commentators - in particular\\n\\t\\t\\t\\tRaghib - the term nu'as (lit., \"the drowsiness which\\n\\t\\t\\t\\tprecedes sleep\") is used here metaphorically, and denotes\\n\\t\\t\\t\\t\"inner calm\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "154",
    "NoteID": "113",
    "Body": "I.e., in the matter of victory or defeat. The \"thoughts\\n\\t\\t\\t\\tof pagan ignorance\" is obviously an allusion to the\\n\\t\\t\\t\\tinitial reluctance of those faint-hearted people to admit\\n\\t\\t\\t\\ttheir moral responsibility for what had happened, and to\\n\\t\\t\\t\\ttheir excusing themselves by saying that their failure to\\n\\t\\t\\t\\tlive up to their faith had been \"predestined\". See also\\n\\t\\t\\t\\tsurah {5}, note [71]."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "154",
    "NoteID": "114",
    "Body": "I.e., while it is for God alone to apportion actual\\n\\t\\t\\t\\tsuccess or failure to whomever He wills \"nought shall be\\n\\t\\t\\t\\taccounted unto man but what he is [or \"was\"] striving\\n\\t\\t\\t\\tfor\" ( 53:39 )."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "154",
    "NoteID": "115",
    "Body": "Lit., \"we would not have been killed here\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "154",
    "NoteID": "116",
    "Body": "Lit., \"all that is in your hearts\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "155",
    "NoteID": "117",
    "Body": "This is an illustration of a significant Qur'anic\\n\\t\\t\\t\\tdoctrine, which can be thus summarized: \"Satan's\\n\\t\\t\\t\\tinfluence\" on man is not the primary cause of sin but its\\n\\t\\t\\t\\tfirst consequence: that is to say, a consequence of a\\n\\t\\t\\t\\tperson's own attitude of mind which in moments of moral\\n\\t\\t\\t\\tcrisis induces him to choose the easier, and seemingly\\n\\t\\t\\t\\tmore pleasant, of the alternatives open to him, and thus\\n\\t\\t\\t\\tto become guilty of a sin, whether by commission or\\n\\t\\t\\t\\tomission. Thus, God's \"causing\" a person to commit a sin\\n\\t\\t\\t\\tis conditional upon the existence, in the individual\\n\\t\\t\\t\\tconcerned, of an attitude of mind which makes him prone\\n\\t\\t\\t\\tto commit such a sin: which, in its turn, presupposes\\n\\t\\t\\t\\tman's free will - that is, the ability to make, within\\n\\t\\t\\t\\tcertain limitations, a conscious choice between two or\\n\\t\\t\\t\\tmore possible courses of action."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "156",
    "NoteID": "118",
    "Body": "Lit., \"when they travel on earth\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "156",
    "NoteID": "119",
    "Body": "Lit., \"so that God causes this to be\": but since the\\n\\t\\t\\t\\tparticle li in li-yaj'al is obviously a lam al-'aqibah\\n\\t\\t\\t\\t(i.e., the letter lam denoting a causal sequence), it is\\n\\t\\t\\t\\tbest rendered in this context by the conjunctive particle\\n\\t\\t\\t\\t\"and\", combined with the future tense."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "157",
    "NoteID": "120",
    "Body": "Lit., \"they\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "159",
    "NoteID": "121",
    "Body": "Lit., \"with them\" - i.e., with those of his followers who\\n\\t\\t\\t\\thad failed in their duty before and during the disaster\\n\\t\\t\\t\\tat Uhud. According to all available accounts, the Prophet\\n\\t\\t\\t\\tdid not even reproach any of them for what they had done."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "159",
    "NoteID": "122",
    "Body": "This injunction, implying government by consent and\\n\\t\\t\\t\\tcouncil, must be regarded as one of the fundamental\\n\\t\\t\\t\\tclauses of all Qur'anic legislation relating to\\n\\t\\t\\t\\tstatecraft. The pronoun \"them\" relates to the believers,\\n\\t\\t\\t\\tthat is, to the whole community; while the word al-amr\\n\\t\\t\\t\\toccurring in this context - as well as in the much\\n\\t\\t\\t\\tearlier-revealed phrase amruhum shura baynahum in  42:38 \\n\\t\\t\\t\\t- denotes all affairs of public concern, including state\\n\\t\\t\\t\\tadministration. All authorities agree in that the above\\n\\t\\t\\t\\tordinance, although addressed in the first instance to\\n\\t\\t\\t\\tthe Prophet, is binding on all Muslims and for all times.\\n\\t\\t\\t\\t(For its wider implications see State and Government in\\n\\t\\t\\t\\tIslam, pp. 44 ff.) Some Muslim scholars conclude from the\\n\\t\\t\\t\\twording of this ordinance that the leader of the\\n\\t\\t\\t\\tcommunity, although obliged to take counsel, is\\n\\t\\t\\t\\tnevertheless free to accept or to reject it; but the\\n\\t\\t\\t\\tarbitrariness of this conclusion becomes obvious as soon\\n\\t\\t\\t\\tas we recall that even the Prophet considered himself\\n\\t\\t\\t\\tbound by the decisions of his council (see note [90]\\n\\t\\t\\t\\tabove). Moreover, when he was asked - according to a\\n\\t\\t\\t\\tTradition on the authority of 'Ali ibn Abi Talib - to\\n\\t\\t\\t\\texplain the implications of the word 'azm (\"deciding upon\\n\\t\\t\\t\\ta course of action\") which occurs in the above verse, the\\n\\t\\t\\t\\tProphet replied, \"[It means] taking counsel with\\n\\t\\t\\t\\tknowledgeable people (ahl ar-ra'y) and thereupon\\n\\t\\t\\t\\tfollowing them [therein]\" (see Ibn Kathir's commentary on\\n\\t\\t\\t\\tthis verse)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "161",
    "NoteID": "123",
    "Body": "I.e., by attributing his own opinions to God, and then\\n\\t\\t\\t\\tappealing to the believers to place their trust in Him\\n\\t\\t\\t\\talone. However contrary to reason such deceit may be, it\\n\\t\\t\\t\\tis a common view among non-believers that the Prophet\\n\\t\\t\\t\\thimself \"composed\" the Qur'an and thereupon falsely\\n\\t\\t\\t\\tattributed it to divine revelation."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "162",
    "NoteID": "124",
    "Body": "An allusion, in this case, to the Prophet Muhammad as\\n\\t\\t\\t\\twell as to prophets in general."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "162",
    "NoteID": "125",
    "Body": "I.e., by falsely attributing his own views to God or\\n\\t\\t\\t\\tdistorting His messages by arbitrary interpolations and\\n\\t\\t\\t\\tdeliberate changes in the wording of a revelation - an\\n\\t\\t\\t\\taccusation often levelled in the Qur'an (e.g.,  2:79  and\\n\\t\\t\\t\\t 3:78 ) against the followers of earlier revelations."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "165",
    "NoteID": "126",
    "Body": "I.e., at the battle of Badr, in the year 2 H."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "165",
    "NoteID": "127",
    "Body": "Many of the followers of the Prophet had been convinced\\n\\t\\t\\t\\tthat, whatever the circumstances, God would grant them\\n\\t\\t\\t\\tvictory on account of their faith alone. The bitter\\n\\t\\t\\t\\texperience at Uhud came as a shock to them; and so the\\n\\t\\t\\t\\tQur'an reminds them that this calamity was a consequence\\n\\t\\t\\t\\tof their own doings."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "167",
    "NoteID": "128",
    "Body": "Only a fight in self-defence - in the widest meaning of\\n\\t\\t\\t\\tthis term - can be considered a \"fight in God's cause\"\\n\\t\\t\\t\\t(see {2:190-194}, and the corresponding notes); and,\\n\\t\\t\\t\\tthus, the particle \"or\" between these two phrases is\\n\\t\\t\\t\\talmost synonymous with the expression \"in other words\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "167",
    "NoteID": "129",
    "Body": "This is an allusion to the three hundred men who, on the\r\\n\\t\\t\\t\\tway from Medina to Mount Uhud, forsook the Prophet on the\r\\n\\t\\t\\t\\tspecious plea that he did not really intend to give\r\\n\\t\\t\\t\\tbattle (see note [90] above). But since they knew in\r\\n\\t\\t\\t\\ttheir hearts that it would come to a fight, their\r\\n\\t\\t\\t\\tdefection from God's cause almost amounted to a denial of\r\\n\\t\\t\\t\\tHim (kufr, here rendered as \"apostasy\")."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "172",
    "NoteID": "130",
    "Body": "Lit., \"after injury had afflicted them\". Most of the\\n\\t\\t\\t\\tcommentators assume that this is an allusion to the\\n\\t\\t\\t\\tlosses sustained by the Muslims at the battle of Uhud. It\\n\\t\\t\\t\\tis, however, probable that the implication is much wider,\\n\\t\\t\\t\\tthe more so since this passage connects directly with the\\n\\t\\t\\t\\tpreceding verses which speak, in general terms, of the\\n\\t\\t\\t\\tmartyrs who die in God's cause. There is a distinct\\n\\t\\t\\t\\ttendency on the part of most of the classical\\n\\t\\t\\t\\tcommentators to read minute historical references into\\n\\t\\t\\t\\tmany Qur'anic passages which express ideas of a far wider\\n\\t\\t\\t\\timport and apply to the human condition as such. Verses\\n\\t\\t\\t\\t{172-175} are an instance of this. Some commentators are\\n\\t\\t\\t\\tof the opinion that they refer to the fruitless\\n\\t\\t\\t\\texpedition to Hamra'al-Asad on the day following the\\n\\t\\t\\t\\tbattle of Uhud, while others see in it an allusion to the\\n\\t\\t\\t\\tProphet's expedition, in the following year, known to\\n\\t\\t\\t\\thistory as the \"Little Badr\" (Badr as-Sughra); others,\\n\\t\\t\\t\\tagain, think that verse {172} refers to the former and\\n\\t\\t\\t\\tverses {173-174} to the latter. In view of this obvious\\n\\t\\t\\t\\tlack of unanimity - due to the absence of a really\\n\\t\\t\\t\\tauthoritative support, either in the Qur'an itself or in\\n\\t\\t\\t\\tauthentic Traditions, for any of these speculative\\n\\t\\t\\t\\tassumptions - there is every reason for concluding that\\n\\t\\t\\t\\tthe whole passage under consideration expresses a general\\n\\t\\t\\t\\tmoral, rounding off, as it were, the historical\\n\\t\\t\\t\\treferences to the battle of Uhud and the lessons to be\\n\\t\\t\\t\\tdrawn therefrom."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "173",
    "NoteID": "131",
    "Body": "Lit., \"those to whom people said\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "174",
    "NoteID": "132",
    "Body": "I.e., the moral evil arising out of weakness of faith and\\n\\t\\t\\t\\tloss of courage: an allusion to what happened to many\\n\\t\\t\\t\\tMuslims at Uhud."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "175",
    "NoteID": "133",
    "Body": "I.e., people who \"ally themselves with Satan\" by\\n\\t\\t\\t\\tdeliberately doing wrong."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "176",
    "NoteID": "134",
    "Body": "Lit., \"that He will not assign to them a share\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "178",
    "NoteID": "135",
    "Body": "This is an allusion to the doctrine of natural law (in\\n\\t\\t\\t\\tQur'anic terminology, sunnat Allah, \"God's way\") to which\\n\\t\\t\\t\\tman's inclinations and actions - as well as all other\\n\\t\\t\\t\\thappenings in the universe - are subject. The above verse\\n\\t\\t\\t\\tsays, as it were, \"Since these people are bent on denying\\n\\t\\t\\t\\tthe truth, Our giving them rein [that is, freedom of\\n\\t\\t\\t\\tchoice and time for a reconsideration of their attitude]\\n\\t\\t\\t\\twill not work out for their benefit but will, on the\\n\\t\\t\\t\\tcontrary, cause them to grow in false self-confidence\\n\\t\\t\\t\\tand, thus, in sinfulness.\" As in many similar passages in\\n\\t\\t\\t\\tthe Qur'an, God attributes here their \"growing in\\n\\t\\t\\t\\tsinfulness\" to His own will because it is He who has\\n\\t\\t\\t\\timposed on all His creation the natural law of cause and\\n\\t\\t\\t\\teffect. (See also note [4] on  14:4 .)"
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "179",
    "NoteID": "136",
    "Body": "Some commentators (e.g., Razi) assume that the expression\\n\\t\\t\\t\\tma antum 'alayhi (lit., \"that upon which you are\")\\n\\t\\t\\t\\tdenotes here \"the condition in which you are\" - i.e., the\\n\\t\\t\\t\\tstate of weakness and confusion in which the Muslim\\n\\t\\t\\t\\tcommunity found itself after the battle of Uhud - and\\n\\t\\t\\t\\tthat, therefore, this passage is addressed to the\\n\\t\\t\\t\\tbelievers. This interpretation, however, is not\\n\\t\\t\\t\\tplausible. Apart from the fact that the believers are\\n\\t\\t\\t\\there referred to in the third person. while ma antum\\n\\t\\t\\t\\t'alayhi is in the second person plural, the latter\\n\\t\\t\\t\\texpression denotes almost invariably, both in the Qur'an\\n\\t\\t\\t\\tand in the Traditions, people's mode of life and beliefs.\\n\\t\\t\\t\\tMoreover, we have reliable reports to the effect that Ibn\\n\\t\\t\\t\\t'Abbas, Qatadah, Ad-Dahhak, Muqatil and Al-Kalbi\\n\\t\\t\\t\\tunhesitatingly declared that the people addressed here\\n\\t\\t\\t\\tare \"those who deny the truth\" to whom the preceding\\n\\t\\t\\t\\tpassages refer (see Tabari's and Baghawi's commentaries\\n\\t\\t\\t\\ton this verse). Read in this sense, the above passage\\n\\t\\t\\t\\timplies that the believers would, in time, differ from\\n\\t\\t\\t\\tthe unbelievers not only in their convictions but also in\\n\\t\\t\\t\\ttheir social aims and their manner of living."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "179",
    "NoteID": "137",
    "Body": "I.e., it is through these apostles that God vouchsafes to\\n\\t\\t\\t\\tman a partial glimpse of the reality of which He alone\\n\\t\\t\\t\\thas full knowledge."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "180",
    "NoteID": "138",
    "Body": "This is an allusion to the way of life of the unbelievers\\n\\t\\t\\t\\tmentioned in verse {179} above: a way of life\\n\\t\\t\\t\\tcharacterized by extreme attachment to the material\\n\\t\\t\\t\\tthings of this world - a materialism based on a lack of\\n\\t\\t\\t\\tbelief in anything that transcends the practical problems\\n\\t\\t\\t\\tof life."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "181",
    "NoteID": "139",
    "Body": "According to several authentic Traditions, the Jews of\\n\\t\\t\\t\\tMedina were given to satirizing the phraseology of the\\n\\t\\t\\t\\tQur'an, and especially  2:245  - \"Who is it that will\\n\\t\\t\\t\\toffer up unto God a goodly loan, which He will amply\\n\\t\\t\\t\\trepay, with manifold increase?\""
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "181",
    "NoteID": "140",
    "Body": "Regarding this accusation levelled against the Jews, see\\n\\t\\t\\t\\tsurah {2}, note [48]."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "183",
    "NoteID": "141",
    "Body": "Lit., \"with an offering which the fire consumes\" -in\\n\\t\\t\\t\\tother words, unless he conforms to Mosaic Law, which\\n\\t\\t\\t\\tprescribes burnt offerings as an essential part of divine\\n\\t\\t\\t\\tservices. Although this aspect of the Law had been left\\n\\t\\t\\t\\tin abeyance ever since the destruction of the Second\\n\\t\\t\\t\\tTemple in Jerusalem, the Jews of post-Talmudic times were\\n\\t\\t\\t\\tconvinced that the Messiah promised to them would restore\\n\\t\\t\\t\\tthe Mosaic rites in their entirety; and so they refused\\n\\t\\t\\t\\tto accept as a prophet anyone who did not conform to the\\n\\t\\t\\t\\tLaw of the Torah in every detail."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "183",
    "NoteID": "142",
    "Body": "At the time of the martyrdom of John the Baptist and of\\n\\t\\t\\t\\tZachariah, of Jesus' exclamation, \"O Jerusalem,\\n\\t\\t\\t\\tJerusalem, thou that killest the prophets\" (Matthew\\n\\t\\t\\t\\txxiii, 37), and of the reference of Paul of Tarsus to the\\n\\t\\t\\t\\tJews \"who killed their own prophets\" (I Thessalonians ii,\\n\\t\\t\\t\\t15), the Second Temple was still in existence, and burnt\\n\\t\\t\\t\\tofferings were a daily practice: thus, the refusal of the\\n\\t\\t\\t\\tJews to accept the prophets alluded to, culminating in\\n\\t\\t\\t\\ttheir killing, could not be attributed to those prophets'\\n\\t\\t\\t\\tlack of conformity with Mosaic Law."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "187",
    "NoteID": "143",
    "Body": "This connects with verses {183-184}, where the Jews are\\n\\t\\t\\t\\tspoken of as refusing to accept the message of the\\n\\t\\t\\t\\tQur'an. The implication of verse {187} above is that the\\n\\t\\t\\t\\tadvent of the Prophet Muhammad was predicted in both the\\n\\t\\t\\t\\tOld and New Testaments, and that the followers of the\\n\\t\\t\\t\\tBible had been called upon to spread this prophecy and\\n\\t\\t\\t\\tnot - as they actually have done - to suppress it."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "187",
    "NoteID": "144",
    "Body": "Lit., \"that which they are buying\" - an allusion to the\\n\\t\\t\\t\\tbelief of the Jews that they are \"God's chosen people\",\\n\\t\\t\\t\\tand to the conviction of the Christians that their belief\\n\\t\\t\\t\\tin Jesus' \"vicarious atonement\" automatically assures to\\n\\t\\t\\t\\tthem salvation: the \"bargain\" being, in both cases, an\\n\\t\\t\\t\\tillusion of immunity in the life to come."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "188",
    "NoteID": "145",
    "Body": "I.e., they have not, in spite of all their claims,\\n\\t\\t\\t\\tpreserved the integrity of the Bible and of Abraham's\\n\\t\\t\\t\\tfaith (Razi)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "191",
    "NoteID": "146",
    "Body": "Lit., \"and [lying] on their sides\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "191",
    "NoteID": "147",
    "Body": "Lit., \"in vain\" (batilan): see note[11] on  10:5 ."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "192",
    "NoteID": "148",
    "Body": "I.e., the suffering which a sinner will have to undergo\\n\\t\\t\\t\\tin the life to come will be a consequence of the\\n\\t\\t\\t\\tspiritual disgrace which he has already brought upon\\n\\t\\t\\t\\thimself by his actions in this world."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "193",
    "NoteID": "149",
    "Body": "Lit., \"a caller\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "195",
    "NoteID": "150",
    "Body": "I.e., \"you all are members of one and the same human\\n\\t\\t\\t\\trace, and therefore equal to one another\"."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "195",
    "NoteID": "151",
    "Body": "See surah {2}, note [203], and surah {4}, note [124]."
  }
]
