[
  {
    "SurahNumber": "42",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "I.e., the basic truth propounded in the Qur'anic\\n\\t\\t\\t\\trevelation - some of which are summarized in the sequence\\n\\t\\t\\t\\t- are the same as those revealed to all the earlier\\n\\t\\t\\t\\tprophets."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "I.e., all human beings (as indicated by the relative\\n\\t\\t\\t\\tpronoun man, which always refers to beings endowed with\\n\\t\\t\\t\\tconscious intelligence). The implication is that whereas\\n\\t\\t\\t\\tall humans - whether believers or unbelievers - are\\n\\t\\t\\t\\tliable to err and to sin, God \"is full of forgiveness\\n\\t\\t\\t\\tunto men despite all their evildoing\" ( 13:6 ). See also\\n\\t\\t\\t\\tthe first sentence of  10:11  and the corresponding note\\n\\t\\t\\t\\t[17]."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "Cf.  14:4  - \"never have We sent forth any apostle\\n\\t\\t\\t\\totherwise than [with a message] in his own people's\\n\\t\\t\\t\\ttongue\"; see also note [72] on the first sentence of\\n\\t\\t\\t\\t 13:37 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "I.e., all mankind (Tabari, Baghawi, Razi). As regards the\\n\\t\\t\\t\\tdesignation of Mecca as \"the foremost of all cities\", see\\n\\t\\t\\t\\tnote [75] on the identical phrase in  6:92 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "The implication being, \"but He has not willed it\": see\\n\\t\\t\\t\\tsecond paragraph of  5:48  and the corresponding notes\\n\\t\\t\\t\\t[66] and [67];  16:93  and note [116]; also note [29] on\\n\\t\\t\\t\\t 10:19 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "8",
    "NoteID": "7",
    "Body": "Or: \"He admits whomever He wills unto His grace\" -\\n\\t\\t\\t\\tsimilar to the double meaning inherent in the\\n\\t\\t\\t\\toft-recurring phrase, Allahu yahdi man yasha'u wa-yudillu\\n\\t\\t\\t\\tman yasha'u, which can be understood either as \"God\\n\\t\\t\\t\\tguides whomever He wills and lets go astray whomever He\\n\\t\\t\\t\\twills\", or, alternatively, as \"God guides him that wills\\n\\t\\t\\t\\t[to be guided] and let go astray him that wills [to go\\n\\t\\t\\t\\tastray]\". See, in particular, Zamakhshari's elaborate\\n\\t\\t\\t\\tcomment on this problem quoted in note [4] on the second\\n\\t\\t\\t\\thalf of  14:4 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "10",
    "NoteID": "8",
    "Body": "This, connecting with the first sentence of verse 8\\n\\t\\t\\t\\tabove, evidently relates to problems of faith and\\n\\t\\t\\t\\treligious law (Baghawi, Zamakhshari). The above verse has\\n\\t\\t\\t\\tprovided some of the great exponents of Islamic Law - Ibn\\n\\t\\t\\t\\tHazm among them - with one of the main arguments against\\n\\t\\t\\t\\tthe acceptance of deductions by analogy (qiyas) as a\\n\\t\\t\\t\\tmeans to \"establish\" points of religious law not\\n\\t\\t\\t\\tformulated as such in the nass - i.e., the self-evident\\n\\t\\t\\t\\t(zahir) wording of the Qur'an and, by obvious\\n\\t\\t\\t\\timplication, of the Prophet's commandments. This, as Razi\\n\\t\\t\\t\\tpoints out, is the meaning of the phrase \"on whatever you\\n\\t\\t\\t\\tmay differ, the verdict (hukm) thereon rests with God\".\\n\\t\\t\\t\\t(See in this connection note [120] on  5:101 ; also the\\n\\t\\t\\t\\tsection on \"The Scope of Islamic Law\" in my State and\\n\\t\\t\\t\\tGovernment, pp. 11-15.)"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "See note [81] on  16:72 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "11",
    "NoteID": "10",
    "Body": "The preceding allusion to the God-willed function of sex\\n\\t\\t\\t\\tand, hence, to the polarity and multiplicity evident in\\n\\t\\t\\t\\tall animated nature - man and animal alike - is meant to\\n\\t\\t\\t\\tstress the above statement of the oneness and absolute\\n\\t\\t\\t\\tuniqueness of God. The phrase \"there is nothing like unto\\n\\t\\t\\t\\tHim\" implies that He is fundamentally - and not merely in\\n\\t\\t\\t\\tHis attributes - \"different\" from anything that exists or\\n\\t\\t\\t\\tcould exist, or anything that man can conceive or imagine\\n\\t\\t\\t\\tor define (see note [88] on  6:100 ); and since \"there is\\n\\t\\t\\t\\tnothing that could be compared with Him\" ( 112:4 ), even\\n\\t\\t\\t\\tthe \"how\" of His being \"different\" from everything else\\n\\t\\t\\t\\tis beyond the categories of human thought."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "12",
    "NoteID": "11",
    "Body": "I.e., He knows not only what every human being\\n\\t\\t\\t\\t\"deserves\", but also what is intrinsically - though not\\n\\t\\t\\t\\talways perceptibly - good and necessary in the context of\\n\\t\\t\\t\\tHis plan of creation. Moreover, all that exists belongs\\n\\t\\t\\t\\tto Him alone, and man is allowed no more than the\\n\\t\\t\\t\\tusufruct of what is commonly regarded as \"property\"."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "13",
    "NoteID": "12",
    "Body": "See first paragraph of note [249] on  2:256 . Since, as\\n\\t\\t\\t\\tthe sequence shows, the term din cannot apply in this\\n\\t\\t\\t\\tcontext to \"religion\" in its widest connotation,\\n\\t\\t\\t\\tincluding religious laws - which, by their very nature,\\n\\t\\t\\t\\thave been different in each successive dispensation (cf.\\n\\t\\t\\t\\tnote [66] on  5:48 ) - it obviously denotes here only the\\n\\t\\t\\t\\tethical and spiritual contents of religion, i.e., \"faith\"\\n\\t\\t\\t\\tin its most general sense. With this verse, the discourse\\n\\t\\t\\t\\treturns to the theme sounded at the beginning of this\\n\\t\\t\\t\\tsurah, namely, the unchanging sameness of the spiritual\\n\\t\\t\\t\\tand moral principles underlying all revealed religions."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "13",
    "NoteID": "13",
    "Body": "Lit., \"which We have revealed unto thee\", implying that\\n\\t\\t\\t\\tit was only through revelation that the Prophet Muhammad\\n\\t\\t\\t\\tcame to know \"that which God had enjoined upon Noah\"."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "13",
    "NoteID": "14",
    "Body": "Cf.  3:19  - \"the only [true] religion in the sight of\\n\\t\\t\\t\\tGod is [man's] self-surrender unto Him\"; and  3:85  - \"if\\n\\t\\t\\t\\tone goes in search of a religion other than\\n\\t\\t\\t\\tself-surrender unto God, it will never be accepted from\\n\\t\\t\\t\\thim\". Parallel with this principle, enunciated by all of\\n\\t\\t\\t\\tGod's apostles, is the categorical statement in  21:92 \\n\\t\\t\\t\\tand  23:52  - \"Verily, [O you who believe in Me,] this\\n\\t\\t\\t\\tcommunity of yours is one single community, since I am\\n\\t\\t\\t\\tthe Sustainer of you all\". Most of the great commentators\\n\\t\\t\\t\\t(e.g., Zamakhshari, Razi, Ibn Kathir) understand this as\\n\\t\\t\\t\\tan unequivocal reference to the ecumenical unity of all\\n\\t\\t\\t\\treligions based on belief in the One God, notwithstanding\\n\\t\\t\\t\\tall the differences with regard to \"the [specific]\\n\\t\\t\\t\\tstatutes and practices enjoined for the benefit of the\\n\\t\\t\\t\\tvarious communities in accordance with their [time-bound]\\n\\t\\t\\t\\tconditions ('ala hasab ahwaliha)\", as expressed by\\n\\t\\t\\t\\tZamakhshari in his comments on the verse under\\n\\t\\t\\t\\tdiscussion."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "14",
    "NoteID": "15",
    "Body": "Lit., \"they did not break up their unity until after\\n\\t\\t\\t\\tknowledge had come to them\" - i.e., the knowledge that\\n\\t\\t\\t\\tGod is one, and that the teachings of all of His prophets\\n\\t\\t\\t\\twere essentially the same. Cf.  2:213  and, more\\n\\t\\t\\t\\texplicitly,  23:53 , which comes immediately after the\\n\\t\\t\\t\\tstatement that \"this community of yours is one single\\n\\t\\t\\t\\tcommunity\" (see also note [30] on  23:53 )."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "14",
    "NoteID": "16",
    "Body": "For an explanation of this passage, see note [29] on\\n\\t\\t\\t\\t 10:19 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "14",
    "NoteID": "17",
    "Body": "Lit., \"who have become heirs to the divine writ after\\n\\t\\t\\t\\tthem\": obviously referring to the Bible and its followers\\n\\t\\t\\t\\tin later times."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "14",
    "NoteID": "18",
    "Body": "Lit., \"about it\" - i.e., in doubt as to whether the\\n\\t\\t\\t\\trelevant scripture has really been revealed by God, and,\\n\\t\\t\\t\\tultimately, as to whether there is any truth in the\\n\\t\\t\\t\\tconcept of \"divine revelation\" as such."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "15",
    "NoteID": "19",
    "Body": "I.e., because of this breach of the original unity of\\n\\t\\t\\t\\tmen's faith in the One God."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "15",
    "NoteID": "20",
    "Body": "Lit., \"between you\" - i.e., \"to induce you to be more\\n\\t\\t\\t\\ttolerant of one another\": evidently an allusion to the\\n\\t\\t\\t\\tbitterness which stands in the way of an understanding\\n\\t\\t\\t\\tbetween the various sects and schools of thought in all\\n\\t\\t\\t\\trevealed religions."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "16",
    "NoteID": "21",
    "Body": "I.e., about His attributes and the \"how\" of His Being,\\n\\t\\t\\t\\tall of which is beyond the grasp of the human mind."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "17",
    "NoteID": "22",
    "Body": "The above two interpolations are based on  57:25 , where\\n\\t\\t\\t\\tthe idea underlying this verse has been stated clearly.\\n\\t\\t\\t\\tThe implication is that since God Himself has given man,\\n\\t\\t\\t\\tthrough successive revelations, a standard whereby to\\n\\t\\t\\t\\tdiscern between right and wrong, it is presumptuous and\\n\\t\\t\\t\\tfutile to argue about the nature of His Being and His\\n\\t\\t\\t\\tultimate judgment: hence the reference, in the second\\n\\t\\t\\t\\thalf of this and the next verse, to the Last Hour and,\\n\\t\\t\\t\\tthus, the Day of Judgment."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "18",
    "NoteID": "23",
    "Body": "This is not merely a reference to the sarcastic demand of\\n\\t\\t\\t\\tMuhammad's opponents (mentioned several times in the\\n\\t\\t\\t\\tQur'an) to bring about their \"speedy chastisement\" in\\n\\t\\t\\t\\tproof of his being God's message-bearer, but also an\\n\\t\\t\\t\\toblique allusion to unbelievers of all times who, without\\n\\t\\t\\t\\thaving any \"proof\" either way, categorically reject the\\n\\t\\t\\t\\tidea of resurrection and judgment."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "20",
    "NoteID": "24",
    "Body": "I.e., whereas those who live righteously and turn their\\n\\t\\t\\t\\tendeavours towards spiritual ends are sure to receive in\\n\\t\\t\\t\\tthe hereafter more than they are hoping for, those who\\n\\t\\t\\t\\tstrive exclusively after worldly rewards may - but not\\n\\t\\t\\t\\tnecessarily will - achieve something, and not necessarily\\n\\t\\t\\t\\tall, of their aims, without having any reason to expect\\n\\t\\t\\t\\t\"a share in the blessings\" that await the righteous in\\n\\t\\t\\t\\tthe hereafter."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "21",
    "NoteID": "25",
    "Body": "Lit., \"Is it that they have partners [of God]\" - i.e.,\\n\\t\\t\\t\\t\"do they believe that circumstantial phenomena like\\n\\t\\t\\t\\twealth, power, 'luck', etc., have something divine about\\n\\t\\t\\t\\tthem?\" - the implication being that belief in such\\n\\t\\t\\t\\t\"forces\" is usually at the root of men's pursuance of\\n\\t\\t\\t\\texclusively worldly ends. (For my above explanatory\\n\\t\\t\\t\\trendering of the term shuraka' - lit., \"partners\" or\\n\\t\\t\\t\\t\"associates\" [of God] - see note [15] on  6:22 .)"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "21",
    "NoteID": "26",
    "Body": "I.e., which cause them to abandon themselves with an\\n\\t\\t\\t\\talmost religious fervour to something of which God\\n\\t\\t\\t\\tdisapproves - namely, the striving after purely\\n\\t\\t\\t\\tmaterialistic goals and a corresponding disregard of all\\n\\t\\t\\t\\tspiritual and ethical values. For my rendering of din, in\\n\\t\\t\\t\\tthis context, as \"moral law\", see note [3] on  109:6 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "21",
    "NoteID": "27",
    "Body": "Lit., \"word of decision\", i.e., that His final judgment\\n\\t\\t\\t\\tshall be postponed until the Day of Resurrection (see\\n\\t\\t\\t\\tnext note)."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "21",
    "NoteID": "28",
    "Body": "I.e., God would have made a clear-cut distinction, in\\n\\t\\t\\t\\tthis world, between those who look forward to the\\n\\t\\t\\t\\thereafter and those who care for no more than worldly\\n\\t\\t\\t\\tsuccess, by granting unlimited happiness to the former\\n\\t\\t\\t\\tand causing the latter to suffer: but since it is only in\\n\\t\\t\\t\\tthe hereafter that man's life is to be truly fulfilled,\\n\\t\\t\\t\\tGod has willed to postpone this distinction until then."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "23",
    "NoteID": "29",
    "Body": "Lit., \"love for those who are near (al-qurba)\". Some\\n\\t\\t\\t\\tcommentators take this to mean \"those who are near to\\n\\t\\t\\t\\tme\", i.e., Muhammad's kinsfolk: but quite apart from the\\n\\t\\t\\t\\tobjection that such a \"personal\" demand would conflict\\n\\t\\t\\t\\twith the preceding assurance, \"No reward do I ask of\\n\\t\\t\\t\\tyou\", the deliberate ommission of any possessive pronoun\\n\\t\\t\\t\\tin respect of the term al-qurba indicates that it is not\\n\\t\\t\\t\\tlimited to any personal relationship but, rather, alludes\\n\\t\\t\\t\\tto a relationship common to all human beings: namely, the\\n\\t\\t\\t\\tfellowship of man - a concept which implies the\\n\\t\\t\\t\\tfundamental ethical postulate to care for one another's\\n\\t\\t\\t\\tmaterial and spiritual welfare."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "24",
    "NoteID": "30",
    "Body": "See note [103] on  10:82 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "27",
    "NoteID": "31",
    "Body": "This passage connects with, and elucidates, the statement\\n\\t\\t\\t\\tin the preceding verse that God \"responds unto all who\\n\\t\\t\\t\\tattain to faith and do righteous deeds\" - a statement\\n\\t\\t\\t\\twhich, at first glance, seems to be contrary to the fact\\n\\t\\t\\t\\tthat whereas many wrongdoers prosper and are happy, many\\n\\t\\t\\t\\trighteous people suffer hurt and deprivation. In reply to\\n\\t\\t\\t\\tthis objection, the above verse points elliptically to\\n\\t\\t\\t\\tman's innate \"greed for more and more\" (see  102:1 ),\\n\\t\\t\\t\\twhich often causes him to become \"grossly overweening\\n\\t\\t\\t\\twhenever he believes himself to be self-sufficient\"\\n\\t\\t\\t\\t( 96:6 ). To counteract this tendency, the Qur'an\\n\\t\\t\\t\\tstresses again and again that God's \"response\" to the\\n\\t\\t\\t\\trighteous - as well as to wrongdoers - will become fully\\n\\t\\t\\t\\tevident only in the life to come, and not necessarily in\\n\\t\\t\\t\\tthis world, which, after all, is only the first, short\\n\\t\\t\\t\\tstage of man's existence."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "28",
    "NoteID": "32",
    "Body": "This reference to the symbol of life-giving rain connects\\n\\t\\t\\t\\twith the preceding statement that \"He bestows [His grace]\\n\\t\\t\\t\\tin due measure, as He wills\", and is a preamble, as it\\n\\t\\t\\t\\twere, to the statement in the next verse that all\\n\\t\\t\\t\\tcreation is but a visible \"sign\" or \"revelation\" of God's\\n\\t\\t\\t\\texistence and purposeful activity, as well as of the\\n\\t\\t\\t\\tGod-willed continuation of all life in the hereafter."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "29",
    "NoteID": "33",
    "Body": "Lit., \"in both\". In the Qur'an, the expression \"the\\n\\t\\t\\t\\theavens and the earth\" invariably denotes the universe in\\n\\t\\t\\t\\tits entirety."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "30",
    "NoteID": "34",
    "Body": "This oft-recurring phrase is a Qur'anic metonym for man's\\n\\t\\t\\t\\tdoings and conscious attitudes in this world, meant to\\n\\t\\t\\t\\tbring out the fact that these doings or attitudes are the\\n\\t\\t\\t\\t\"harvest\" of a person's spiritual character and have,\\n\\t\\t\\t\\ttherefore, a definite influence on the quality of his\\n\\t\\t\\t\\tlife in the hereafter. Since the latter is but an organic\\n\\t\\t\\t\\tcontinuation of earthly life, man's subsequent spiritual\\n\\t\\t\\t\\tgrowth and bliss or, alternatively, spiritual darkness\\n\\t\\t\\t\\tand suffering - symbolically circumscribed as God's\\n\\t\\t\\t\\t\"reward\" and \"chastisement\" or \"paradise\" and \"hell\" -\\n\\t\\t\\t\\tdepend on, and are a result of, what one has previously\\n\\t\\t\\t\\t\"earned\"."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "32",
    "NoteID": "35",
    "Body": "As is evident from the sequence, in this instance the\\n\\t\\t\\t\\tterm ayah (lit., \"sign\" or \"[divine] message\") is used in\\n\\t\\t\\t\\tthe sense of \"parable\". (See next note.)"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "34",
    "NoteID": "36",
    "Body": "I.e., because of the evil which they have committed. The\\n\\t\\t\\t\\tabove passage is, I believe, a parabolical allusion to\\n\\t\\t\\t\\tthe three possible alternatives in the life to come:\\n\\t\\t\\t\\tspiritual progress and happiness (symbolized by ships\\n\\t\\t\\t\\tthat sail freely through the sea); spiritual stagnancy\\n\\t\\t\\t\\t(ships that lie motionless on the sea's surface); and\\n\\t\\t\\t\\tspiritual disaster and suffering (summarized in the\\n\\t\\t\\t\\tconcept of perdition). The second of these three\\n\\t\\t\\t\\talternatives seems to point to the condition of those\\n\\t\\t\\t\\t'ala 'l-a'raf spoken of in  7:46  Cf. and explained in\\n\\t\\t\\t\\tthe corresponding note [37]."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "35",
    "NoteID": "37",
    "Body": "For this rendering of yujadilun, see note [25] on\\n\\t\\t\\t\\t 40:35 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "38",
    "NoteID": "38",
    "Body": "This particular qualification of true believers -\\n\\t\\t\\t\\tregarded by the Prophet's Companions as so important that\\n\\t\\t\\t\\tthey always referred to this surah by the key-word\\n\\t\\t\\t\\t\"consultation\" (shura) - has a double import: firstly, it\\n\\t\\t\\t\\tis meant to remind all followers of the Qur'an that they\\n\\t\\t\\t\\tmust remain united within one single community (ummah);\\n\\t\\t\\t\\tand, secondly, it lays down the principle that all their\\n\\t\\t\\t\\tcommunal business must be transacted in mutual\\n\\t\\t\\t\\tconsultation. (For the political implications of this\\n\\t\\t\\t\\tprinciple, see State and Government, pp. 44 ff.)."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "38",
    "NoteID": "39",
    "Body": "See note [4] on  2:3 . Following as it does immediately\\n\\t\\t\\t\\tupon the call to communal unity and consultation, the\\n\\t\\t\\t\\t\"spending on others\" bears here the general connotation\\n\\t\\t\\t\\tof social justice."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "40",
    "NoteID": "40",
    "Body": "Lit., \"is [or \"may be\"] an evil like it\". In other words,\\n\\t\\t\\t\\tsuccessful struggle against tyranny (which latter is the\\n\\t\\t\\t\\tmeaning of the noun baghy in the last sentence of the\\n\\t\\t\\t\\tpreceding verse) often tends to degenerate into a\\n\\t\\t\\t\\tsimilarly tyrannical attitude towards the erstwhile\\n\\t\\t\\t\\toppressors. Hence, most of the classical commentators\\n\\t\\t\\t\\t(e.g., Baghawi, Zamakhshari, Razi, Baydawi) stress the\\n\\t\\t\\t\\tabsolute prohibition of \"going beyond what is right\"\\n\\t\\t\\t\\t(i'tida') when defending oneself against tyranny and\\n\\t\\t\\t\\toppression. (Cf. the passage relating to fighting against\\n\\t\\t\\t\\t\"those who wage war against you\" in  2:190  ff.)"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "40",
    "NoteID": "41",
    "Body": "I.e., in this context, such as succumb to the temptation\\n\\t\\t\\t\\tof indulging in undue acts of revenge against their\\n\\t\\t\\t\\tformer oppressors."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "43",
    "NoteID": "42",
    "Body": "Cf. {41:34-35}, as well as note [44] on  13:22 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "44",
    "NoteID": "43",
    "Body": "See note [4] on  14:4 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "44",
    "NoteID": "44",
    "Body": "Although this is primarily a reference to \"those who\\n\\t\\t\\t\\toppress [other] people and behave outrageously on earth,\\n\\t\\t\\t\\toffending against all right\" (verse {42} above), the\\n\\t\\t\\t\\tmeaning of the term is general, applying to all kinds of\\n\\t\\t\\t\\tdeliberate evildoers."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "44",
    "NoteID": "45",
    "Body": "I.e., a \"second chance\" on earth: cf. {6:27-28}."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "45",
    "NoteID": "46",
    "Body": "The term ahl denotes primarily the \"people\" of one town,\\n\\t\\t\\t\\tcountry or family, as well as the \"fellow-members\" of one\\n\\t\\t\\t\\trace, religion, profession, etc. In its wider,\\n\\t\\t\\t\\tideological sense it is applied to people who have\\n\\t\\t\\t\\tcertain characteristics in common, e.g., ahl al-'ilm\\n\\t\\t\\t\\t(\"people of knowledge\", i.e., scholars), or who follow\\n\\t\\t\\t\\tone and the same persuasion or belief, e.g., ahlal-kitab\\n\\t\\t\\t\\t(\"the followers of [earlier] revelation\"), ahl al-Qur'an\\n\\t\\t\\t\\t(\"the followers of the Qur'an\"), and so forth. Since, as\\n\\t\\t\\t\\thas been pointed out in note"
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "47",
    "NoteID": "47",
    "Body": "Lit., \"from God\"."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "48",
    "NoteID": "48",
    "Body": "This interpolation - necessary for a proper understanding\\n\\t\\t\\t\\tof the context - is based on Razi's convincing\\n\\t\\t\\t\\texplanation of how this passage connects with the\\n\\t\\t\\t\\tpreceding one. Man is, as a rule, absorbed in a pursuit\\n\\t\\t\\t\\tof material goods and comforts, the achievement of which\\n\\t\\t\\t\\the identifies with \"happiness\"; hence, he pays but scant\\n\\t\\t\\t\\tattention to spiritual aims and values, and the more so\\n\\t\\t\\t\\tif he is called upon to abandon his selfish pursuits in\\n\\t\\t\\t\\tfavour of the - to him as yet hypothetical - life in the\\n\\t\\t\\t\\thereafter."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "48",
    "NoteID": "49",
    "Body": "I.e., when God bestows on him a measure of material\\n\\t\\t\\t\\tbenefits, man tends to exult in this \"success\" as such,\\n\\t\\t\\t\\tattributing it exclusively to his own ability and\\n\\t\\t\\t\\tcleverness (cf. the first sentence of  41:50 "
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "48",
    "NoteID": "50",
    "Body": "I.e., instead of remembering his past happiness with\\n\\t\\t\\t\\tgratitude, he calls the very existence of God in\\n\\t\\t\\t\\tquestion, arguing that if God did really exist, He \"could\\n\\t\\t\\t\\tnot possibly have permitted\" so much misfortune and\\n\\t\\t\\t\\tunhappiness to prevail in the world: a fallacious\\n\\t\\t\\t\\targument inasmuch as it does not take the reality of the\\n\\t\\t\\t\\thereafter into account and is, moreover, based on a\\n\\t\\t\\t\\tconcept of God in terms of purely human feelings and\\n\\t\\t\\t\\texpectations."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "50",
    "NoteID": "51",
    "Body": "The purport of this passage is a re-affirmation of the\\n\\t\\t\\t\\tfact that whatever happens to man is an outcome of God's\\n\\t\\t\\t\\tunfathomable will: a fact which is illustrated in the\\n\\t\\t\\t\\tsequence by the most common, recurrent phenomenon in\\n\\t\\t\\t\\tman's life - the unpredictability of male or female\\n\\t\\t\\t\\tbirths, as well as of barrenness: and so, too, God's\\n\\t\\t\\t\\tbestowal of worldly happiness and unhappiness cannot be\\n\\t\\t\\t\\tmeasured or predicted in terms of what man may regard as\\n\\t\\t\\t\\this \"due\"."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "51",
    "NoteID": "52",
    "Body": "This is the primary meaning of wahy, a term which\\n\\t\\t\\t\\tcombines the concepts of suddenness and inner\\n\\t\\t\\t\\tillumination (Raghib); in the usage of the Qur'an, it is\\n\\t\\t\\t\\toften, though by no means always, synonymous with\\n\\t\\t\\t\\t\"revelation\". - The above passage connects with the first\\n\\t\\t\\t\\tparagraph of verse 48, which speaks of the divine message\\n\\t\\t\\t\\tentrusted to the Prophet."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "51",
    "NoteID": "53",
    "Body": "Cf.  53:10 ."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "52",
    "NoteID": "54",
    "Body": "I.e., in all the three ways mentioned in the preceding\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "52",
    "NoteID": "55",
    "Body": "The term ruh (lit., \"spirit\" or \"soul\") has in the Qur'an\\n\\t\\t\\t\\toften the meaning of \"divine inspiration\" (see surah\\n\\t\\t\\t\\t{16}, note [2]). In the present context, it evidently\\n\\t\\t\\t\\tdenotes the contents of the divine inspiration bestowed\\n\\t\\t\\t\\ton the Prophet Muhammad, i.e., the Qur'an (Tabari,\\n\\t\\t\\t\\tZamakhshari, Razi, Ibn Kathir), which is meant to lead\\n\\t\\t\\t\\tman to a more intensive spiritual life: hence my above\\n\\t\\t\\t\\trendering."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "52",
    "NoteID": "56",
    "Body": "I.e., that the very concept of \"faith\" implies man's\\n\\t\\t\\t\\tcomplete self-surrender (islam) to God."
  },
  {
    "SurahNumber": "42",
    "AyahNumber": "53",
    "NoteID": "57",
    "Body": "Lit., \"unto God do all things (al-umur) pursue their\\n\\t\\t\\t\\tcourse\": i.e., all things go back to Him as their source,\\n\\t\\t\\t\\tand from His will depends the course which they take\\n\\t\\t\\t\\t(Baydawi)."
  }
]
