[
  {
    "SurahNumber": "47",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "I.e., whatever good deeds they may do will be so\\n\\t\\t\\t\\tcompletely outweighed by the above-mentioned sin that\\n\\t\\t\\t\\tthey will amount to nothing on the Day of judgment. (But\\n\\t\\t\\t\\tsee also note 9 below.) The above verse connects with the\\n\\t\\t\\t\\tlast sentence of the preceding surah, \"Will, then, any be\\n\\t\\t\\t\\t[really] destroyed save iniquitous folk?\""
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "Lit., \"will set aright their hearts\" or \"their minds\",\\n\\t\\t\\t\\tinasmuch as one of the several meanings of the term teal\\n\\t\\t\\t\\tis the \"heart\" or \"mind\" of man (Jawhari)."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "Lit., \"their parables\" (amthalahum). This, according to\\n\\t\\t\\t\\tsome of the most outstanding commentators, relates to the\\n\\t\\t\\t\\tparabolic expressions in the above three verses: the\\n\\t\\t\\t\\t\"going to waste\" - in consequence of their deliberate\\n\\t\\t\\t\\t\"pursuance of falsehood\" - of the good deeds of those who\\n\\t\\t\\t\\tdeny the truth, as well as the \"effacement of the bad\\n\\t\\t\\t\\tdeeds\" of the true believers in consequence of their\\n\\t\\t\\t\\t\"pursuance of the truth\" (Baghawi, Zamakhshari, Razi,\\n\\t\\t\\t\\tBaydawi). In a broader perspective, this interpretation\\n\\t\\t\\t\\ttakes into account the parabolic nature not only of the\\n\\t\\t\\t\\tabove sentence but also of many other Qur'anic statements\\n\\t\\t\\t\\trelating to men's spiritual conditions and destinies in\\n\\t\\t\\t\\tthis world as well as in the life to come."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "Sc., \"and on barring [others] from the path of God\" -\\n\\t\\t\\t\\tthus connecting with verse {1} and laying down the\\n\\t\\t\\t\\tfundamental condition which alone justifies physical\\n\\t\\t\\t\\twarfare: namely, a defence of the Faith and of freedom\\n\\t\\t\\t\\t(cf. in this connection note [167] on  2:190 ). In other\\n\\t\\t\\t\\twords, when \"those who are bent on denying the truth\" try\\n\\t\\t\\t\\tto deprive the Muslims of their social and political\\n\\t\\t\\t\\tliberty and thus to make it impossible for them to live\\n\\t\\t\\t\\tin accordance with the principles of their faith, a just\\n\\t\\t\\t\\twar (jihad) becomes allowable and, more than that, a\\n\\t\\t\\t\\tduty. The whole of the above verse relates to war\\n\\t\\t\\t\\tactually in progress (cf. note [168] on the first part of\\n\\t\\t\\t\\t 2:191 ); and there is no doubt that it was revealed\\n\\t\\t\\t\\tafter {22:39-40}, the earliest Qur'anic reference to\\n\\t\\t\\t\\tphysical warfare."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "Lit., \"tighten the bond\". According to almost all the\\n\\t\\t\\t\\tcommentators, this expression denotes the taking of\\n\\t\\t\\t\\tprisoners of war. In addition, it may also refer to any\\n\\t\\t\\t\\tsanctions or safeguards which would make it unlikely that\\n\\t\\t\\t\\tthe aggression could be resumed in the foreseeable\\n\\t\\t\\t\\tfuture."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "NoteID": "6",
    "Body": "Lit., \"so that (hatta) the war may lay down its burdens\".\\n\\t\\t\\t\\tThe term \"ransom\" comprises also, in this context, a\\n\\t\\t\\t\\tmutual exchange of prisoners of war (Zamakhshari, quoting\\n\\t\\t\\t\\tan opinion of Imam Ash-Shafi'i )."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "NoteID": "7",
    "Body": "I.e., so as to enable the believers to prove by actual\\n\\t\\t\\t\\tdeeds the depth of their faith and their readiness for\\n\\t\\t\\t\\tself-sacrifice, and to enable the aggressors to realize\\n\\t\\t\\t\\thow wrong they have been, and thus to bring them closer\\n\\t\\t\\t\\tto the truth."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "Namely, the revelation relating to man's moral\\n\\t\\t\\t\\tresponsibility to a Supreme Being."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "9",
    "NoteID": "9",
    "Body": "The particle fa (\"and thus\") at the beginning of this\\n\\t\\t\\t\\tclause connotes a consequence: in other words, it is\\n\\t\\t\\t\\ttheir rejection of the idea of moral  responsibility,\\n\\t\\t\\t\\tinherent in all divine revelation, that deprives the\\n\\t\\t\\t\\tdeeds of \"those who are bent on denying the truth\" - even\\n\\t\\t\\t\\tsuch deeds as might be termed \"good\" - of all moral\\n\\t\\t\\t\\tvalue. This law of inner causality explains fully the\\n\\t\\t\\t\\tphrase \"He will let all their [good] deeds go to waste\"\\n\\t\\t\\t\\toccurring in verses {1} and {8}."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "10",
    "NoteID": "10",
    "Body": "Cf.  6:10  and the corresponding note [9]."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "13",
    "NoteID": "11",
    "Body": "See note [116] on  6:131 . It is said that this verse was\\n\\t\\t\\t\\trevealed on the first night of the Prophet's hijrah from\\n\\t\\t\\t\\tMecca to Medina (Tabari, on the authority of Ibn'Abbas)."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "14",
    "NoteID": "12",
    "Body": "Lit., \"Is, then, one who takes his stand. .. like one..\\n\\t\\t\\t\\t.\", etc."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "NoteID": "13",
    "Body": "My rendering of this verse is based in its entirety on\\n\\t\\t\\t\\tthe grammatical construction given to it by Zamakhshari\\n\\t\\t\\t\\tand supported by Razi. In this construction, the\\n\\t\\t\\t\\tparabolic description of paradise - beginning with the\\n\\t\\t\\t\\tphrase \"wherein there are rivers...\", etc., and ending\\n\\t\\t\\t\\twith the words \"and forgiveness from their Sustainer\" -\\n\\t\\t\\t\\tis a parenthetic passage (jumlah mu’taridah). As for the\\n\\t\\t\\t\\tterm \"parable\" (mathal) itself, it is undoubtedly meant\\n\\t\\t\\t\\tto impress upon those who read or listen to the Qur'an\\n\\t\\t\\t\\tthat its descriptions of life in the hereafter are purely\\n\\t\\t\\t\\tallegorical: see in this connection Zamakhshari's\\n\\t\\t\\t\\texplicit remarks cited in note [65] on  13:35 ."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "NoteID": "14",
    "Body": "Cf. {37:45-47}, especially verse {47}: \"no headiness will\\n\\t\\t\\t\\tthere be in it, and they will not get drunk thereon\"."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "NoteID": "15",
    "Body": "Lit., \"and wherein they [i.e., the God-conscious] will\\n\\t\\t\\t\\thave. . .\", etc."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "NoteID": "16",
    "Body": "This interpolation reproduces literally Zamakhshari's\\n\\t\\t\\t\\texplanation of the above ellipticism."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "NoteID": "17",
    "Body": "Lit., \"exceedingly hot [or \"boiling\"] water\". For an\\n\\t\\t\\t\\texplanation of this metaphor, see note [62] on  6:70 ."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "16",
    "NoteID": "18",
    "Body": "Cf.  6:25  and {10:42-43}."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "16",
    "NoteID": "19",
    "Body": "Lit., \"unto those who have been given knowledge\", sc.,\\n\\t\\t\\t\\t\"of the truth\" or \"of thy message\": i.e., the believers.\\n\\t\\t\\t\\tThe people spoken of in the above are the hypocrites\\n\\t\\t\\t\\tamong the contemporaries of the Prophet as well as all\\n\\t\\t\\t\\tpeople, at all times, who pretend to approach the\\n\\t\\t\\t\\tQur'anic message with a show of \"reverence\" but are in\\n\\t\\t\\t\\ttheir innermost unwilling to admit that there is any\\n\\t\\t\\t\\tsense in it."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "16",
    "NoteID": "20",
    "Body": "I.e., the \"sealing\" of their hearts (for an explanation\\n\\t\\t\\t\\tof which see note [7] on  2:7 ) is a consequence of their\\n\\t\\t\\t\\t\"following but their own lusts\"."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "17",
    "NoteID": "21",
    "Body": "Lit., \"and gives them their God-consciousness\\n\\t\\t\\t\\t(taqwahum)\"."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "18",
    "NoteID": "22",
    "Body": "Lit., \"its indications have already come\": a reference to\\n\\t\\t\\t\\tthe many Qur'anic predictions of its inevitability, as\\n\\t\\t\\t\\twell as to the evidence, accessible to every unprejudiced\\n\\t\\t\\t\\tmind, of the temporal finality of all creation."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "18",
    "NoteID": "23",
    "Body": "I.e., \"of what benefit will be to them, when the Last\\n\\t\\t\\t\\tHour comes, their dawning awareness of having sinned, and\\n\\t\\t\\t\\ttheir belated repentance?\""
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "19",
    "NoteID": "24",
    "Body": "I.e., \"He knows all that you do and all that you fail to\\n\\t\\t\\t\\tdo\"."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "20",
    "NoteID": "25",
    "Body": "I am rendering the term surah here and in the next\\n\\t\\t\\t\\tsentence as \"a revelation\", for whereas there is no surah\\n\\t\\t\\t\\tas such which deals exclusively with questions of war,\\n\\t\\t\\t\\tthere are numerous references to it in various surahs;\\n\\t\\t\\t\\tand this is evidently the meaning of this term in the\\n\\t\\t\\t\\tpresent context as well as in  9:86 . - There is no doubt\\n\\t\\t\\t\\tthat this verse precedes the revelation, in the year 1\\n\\t\\t\\t\\tH., of  22:39 , which states categorically - and for the\\n\\t\\t\\t\\tfirst time - that the believers are allowed to wage war\\n\\t\\t\\t\\twhenever \"war is wrongfully waged\" against them (see in\\n\\t\\t\\t\\tthis connection note [57] on  22:39 )."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "20",
    "NoteID": "26",
    "Body": "This is a reference to {22:39-40}. For an explanation of\\n\\t\\t\\t\\tthe expression muhkamah (\"clear in and by itself\"), see\\n\\t\\t\\t\\tnote [5] on  3:7 . (As in the preceding sentence, the\\n\\t\\t\\t\\tterm surah has been rendered here, exceptionally, as \"a revelation\".)"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "21",
    "NoteID": "27",
    "Body": "I.e., an expression of readiness to fight in His cause:\\n\\t\\t\\t\\twhich is obviously the meaning of qawl ma'ruf in this\\n\\t\\t\\t\\tcontext."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "22",
    "NoteID": "28",
    "Body": "The above interpolations are in tune with the explanation\\n\\t\\t\\t\\tof this passage advanced by almost all of the classical\\n\\t\\t\\t\\tcommentators, who regard this rhetorical \"question\" as an\\n\\t\\t\\t\\tallusion to the chaotic conditions of pre-Islamic Arabia,\\n\\t\\t\\t\\tits senseless internecine wars, and the moral darkness\\n\\t\\t\\t\\tfrom which Islam had freed its followers. Nevertheless,\\n\\t\\t\\t\\tthis verse has, like the whole of the passage of which it\\n\\t\\t\\t\\tforms a part, a timeless import as well."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "23",
    "NoteID": "29",
    "Body": "Cf. the reference to God's \"sealing\" the hearts of\\n\\t\\t\\t\\tstubborn wrongdoers in  2:7 ."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "26",
    "NoteID": "30",
    "Body": "Lit., \"this, because . . .\", etc."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "26",
    "NoteID": "31",
    "Body": "Lit., \"in some [or \"parts of\"] the matter\": i.e.,\\n\\t\\t\\t\\t\"although we cannot agree with you [atheists] as regards\\n\\t\\t\\t\\tyour denial of God, or of resurrection, or of the fact of\\n\\t\\t\\t\\trevelation as such, we do agree with you that Muhammad is\\n\\t\\t\\t\\tan impostor and that the Qur'an is but his invention\"\\n\\t\\t\\t\\t(Razi). By \"those who turn their backs [on this message]\\n\\t\\t\\t\\tafter guidance has been vouchsafed to them\" are meant, in\\n\\t\\t\\t\\tthe first instance, the hypocrites and half-hearted\\n\\t\\t\\t\\tfollowers of Islam at the time of the Prophet who refused\\n\\t\\t\\t\\tto fight in defence of the Faith; in a wider sense,\\n\\t\\t\\t\\thowever, this definition applies to all people, at all\\n\\t\\t\\t\\ttimes, who are impressed by the teachings of the Qur'an\\n\\t\\t\\t\\tbut nevertheless refuse to accept it as God-inspired and,\\n\\t\\t\\t\\ttherefore, morally binding."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "27",
    "NoteID": "32",
    "Body": "See note [55] on  8:50 ."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "28",
    "NoteID": "33",
    "Body": "See first clause of verse {3} of this surah, which speaks\\n\\t\\t\\t\\tof the \"pursuit of falsehood\". In the present instance,\\n\\t\\t\\t\\t\"that which would meet with His goodly acceptance\" is the\\n\\t\\t\\t\\tbeliever's readiness to sacrifice, if necessary, his life\\n\\t\\t\\t\\tin the defence of the Faith."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "29",
    "NoteID": "34",
    "Body": "The noun dighn (of which adghan is the plural) denotes,\\n\\t\\t\\t\\tprimarily, \"rancour\" or \"hate\"; in its wider sense it\\n\\t\\t\\t\\tsignifies a person's \"disposition\", \"inclination\" or\\n\\t\\t\\t\\t\"leaning\", especially in its negative aspects (Jawhari):\\n\\t\\t\\t\\thence, a \"moral defect\" or \"failing\"."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "30",
    "NoteID": "35",
    "Body": "Lit., \"by their marks\": implying, elliptically, that God\\n\\t\\t\\t\\tdoes not grant to anyone a clear insight, as by a visible\\n\\t\\t\\t\\tmark, into another human being's heart or mind."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "30",
    "NoteID": "36",
    "Body": "Lit., \"the tone (lahn) of speech\": indicating that a true\\n\\t\\t\\t\\tbeliever recognizes hypocrisy even without a \"visible\\n\\t\\t\\t\\tmark\" (sima)."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "31",
    "NoteID": "37",
    "Body": "Cf.  3:140 , where the verb 'alama has been rendered in\\n\\t\\t\\t\\tthe same way."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "31",
    "NoteID": "38",
    "Body": "Lit., \"your announcements\" - i.e., all assertions\\n\\t\\t\\t\\trelating to belief. The \"test\" consists in one's\\n\\t\\t\\t\\treadiness to undergo any sacrifice - and, since most of\\n\\t\\t\\t\\tthis surah deals with the problem of a just war (jihad)\\n\\t\\t\\t\\tin God's cause - even the sacrifice of one's life."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "32",
    "NoteID": "39",
    "Body": "For the above rendering of shaqqu, see note [16] on\\n\\t\\t\\t\\t 8:13 . The \"cutting oneself off\" from the Apostle\\n\\t\\t\\t\\tsignifies, of course, a rejection of his message, and, in\\n\\t\\t\\t\\tthis particular context, a refusal to follow the Qur'anic\\n\\t\\t\\t\\tcall to fight in a just cause, i.e., in defence of the\\n\\t\\t\\t\\tFaith or of freedom (see note [167] on  2:190 )."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "35",
    "NoteID": "40",
    "Body": "I.e., even if the fortunes of war go against them, the\\n\\t\\t\\t\\tconsciousness of having fought in the cause of truth and\\n\\t\\t\\t\\tjustice is bound to enhance the inner strength of the\\n\\t\\t\\t\\tbelievers and, thus, to become a source of their future\\n\\t\\t\\t\\tgreatness: cf.  3:139 ."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "36",
    "NoteID": "41",
    "Body": "Although the life of this world is \"but a play and a\\n\\t\\t\\t\\tpassing delight\", God does not want to deprive the\\n\\t\\t\\t\\tbelievers of its rightful enjoyment: and so He expects\\n\\t\\t\\t\\tthem to sacrifice only a small part of their possessions\\n\\t\\t\\t\\tin His cause. This passage evidently foreshadows the\\n\\t\\t\\t\\timposition of the obligatory annual tax called zakah\\n\\t\\t\\t\\t(\"the purifying dues\"), amounting to about 2.5 percent of\\n\\t\\t\\t\\ta Muslims's income and property, as pointed out by most\\n\\t\\t\\t\\tof the classical commentators in connection with the\\n\\t\\t\\t\\tabove verse (hence my interpolation). The proceeds of\\n\\t\\t\\t\\tthis tax are to be utilized in what the Qur'an describes\\n\\t\\t\\t\\tas \"the cause [lit., \"way\"] of God\", i.e., for the\\n\\t\\t\\t\\tdefence and propagation of the Faith and the welfare of\\n\\t\\t\\t\\tthe community; and its spiritual purpose is the\\n\\t\\t\\t\\t\"purification\" of a Muslim's possessions from the blemish\\n\\t\\t\\t\\tof greed and selfishness. (It is to be noted that the\\n\\t\\t\\t\\tpayment of zakah was made obligatory at the very\\n\\t\\t\\t\\tbeginning of the Medina period, that is, at approximately\\n\\t\\t\\t\\tthe same time as the revelation of the present surah.)"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "37",
    "NoteID": "42",
    "Body": "Sc., \"to divest yourselves of all your possessions\"."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "37",
    "NoteID": "43",
    "Body": "For my rendering of adghan as \"moral failings\", see note\\n\\t\\t\\t\\t[37]. In the present context. this term has more or less\\n\\t\\t\\t\\tthe same meaning as the term fujur in  91:8 . The\\n\\t\\t\\t\\timplication is that since \"man has been created weak\"\\n\\t\\t\\t\\t( 4:28 ), the imposition of too great a burden on the\\n\\t\\t\\t\\tbelievers would be self-defeating inasmuch as it might\\n\\t\\t\\t\\tresult not in an increase of faith but, rather, in its\\n\\t\\t\\t\\tdiminution. This passage illustrates the supreme realism\\n\\t\\t\\t\\tof the Qur'an, which takes into account human nature as\\n\\t\\t\\t\\tit is, with all its God-willed complexity and its inner\\n\\t\\t\\t\\tcontradictions, and does not therefore, postulate a\\n\\t\\t\\t\\tpriori an impossible ideal as a norm of human behaviour.\\n\\t\\t\\t\\t(Cf.  91:8 , which speaks of man's personality as \"imbued\\n\\t\\t\\t\\twith moral failings as well as consciousness of God\" - a\\n\\t\\t\\t\\tphrase which is explained in the corresponding note [6].)"
  }
]
