[
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "NULL",
    "sectionHeading": "Inheritance of Descendants",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik, \"The generally agreed\\n\\t\\t\\t\\tupon way of doing things among us and what I have seen\\n\\t\\t\\t\\tthe people of knowledge doing in our city about the fixed\\n\\t\\t\\t\\tshares of inheritance of children from the mother or\\n\\t\\t\\t\\tfather when one or other of them dies is that if they\\n\\t\\t\\t\\tleave male and female children, the male takes the\\n\\t\\t\\t\\tportion of two females. If there are only females, and\\n\\t\\t\\t\\tthere are more than two, they get two thirds of what is\\n\\t\\t\\t\\tleft between them. If there is only one, she gets a half.\\n\\t\\t\\t\\tIf someone shares with the children, who has a fixed\\n\\t\\t\\t\\tshare and there are males among them, the reckoner begins\\n\\t\\t\\t\\twith the ones with fixed shares. What remains after that\\n\\t\\t\\t\\tis divided among the children according to their\\n\\t\\t\\t\\tinheritance.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"When there are no children, grandchildren through sons\\n\\t\\t\\t\\thave the same position as children, so that grandsons are\\n\\t\\t\\t\\tlike sons and grand-daughters are like daughters. They\\n\\t\\t\\t\\tinherit as they inherit and they overshadow as they\\n\\t\\t\\t\\tovershadow. If there are both children and grandchildren\\n\\t\\t\\t\\tthrough sons, and there is a male among the children,\\n\\t\\t\\t\\tthen the grandchildren through sons do not share in the\\n\\t\\t\\t\\tinheritance with him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"If there is no surviving male among the children, and\\n\\t\\t\\t\\tthere are two or more daughters, the granddaughters\\n\\t\\t\\t\\tthrough a son do not share in the inheritance with them\\n\\t\\t\\t\\tunless there is a male who is in the same position as\\n\\t\\t\\t\\tthem in relation to the deceased, or further than them.\\n\\t\\t\\t\\tHis presence gives access to whatever is left over, if\\n\\t\\t\\t\\tany, to whoever is in his position and whoever is above\\n\\t\\t\\t\\thim of the granddaughters through sons. If something is\\n\\t\\t\\t\\tleft over, they divide it among them, and the male takes\\n\\t\\t\\t\\tthe portion of two females. If nothing is left over, they\\n\\t\\t\\t\\thave nothing.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"If the only descendant is a daughter, she takes half,\\n\\t\\t\\t\\tand if there are one or more grand-daughters through a\\n\\t\\t\\t\\tson who are in the same position to the deceased, they\\n\\t\\t\\t\\tshare a sixth. If there is a male in the same position as\\n\\t\\t\\t\\tthe granddaughters through a son in relation to the\\n\\t\\t\\t\\tdeceased, they have no share and no sixth .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"If there is a surplus after the allotting of shares to\\n\\t\\t\\t\\tthe people with fixed shares, the surplus goes to the\\n\\t\\t\\t\\tmale and whoever is in his position and whoever is above\\n\\t\\t\\t\\thim of the female descendants through sons. The male has\\n\\t\\t\\t\\tthe share of two females. The one who is more distant in\\n\\t\\t\\t\\trelationship than grandchildren through sons has nothing.\\n\\t\\t\\t\\tIf there is no surplus, they have nothing. That is\\n\\t\\t\\t\\tbecause Allah, the Blessed, the Exalted, said in His\\n\\t\\t\\t\\tBook, 'Allah charges you about your children that the\\n\\t\\t\\t\\tmale has the like of the portion of two females. If there\\n\\t\\t\\t\\tare more than two women they have two thirds of what is\\n\\t\\t\\t\\tleft. If there is one, she has a half.' (Sura 4 ayat 10)\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "NULL",
    "sectionHeading": "Inheritance of Husbands from Wives and Wives from Husbands",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The inheritance of a husband from a wife\\n\\t\\t\\t\\twhen she leaves no children or grandchildren through sons\\n\\t\\t\\t\\tis a half. If she leaves children or grandchildren\\n\\t\\t\\t\\tthrough sons, male or female, by her present or previous\\n\\t\\t\\t\\thusbands, the husband has a quarter after bequests or\\n\\t\\t\\t\\tdebts. The inheritance of a wife from a husband who does\\n\\t\\t\\t\\tnot leave children or grandchildren through sons is a\\n\\t\\t\\t\\tquarter. If he leaves children or grandchildren through\\n\\t\\t\\t\\tsons, male or female, the wife has an eighth after\\n\\t\\t\\t\\tbequests and debts. That is because Allah, the Blessed,\\n\\t\\t\\t\\tthe Exalted! said in His Book, +You have a half of what\\n\\t\\t\\t\\tyour wives leave if they have no children. If they have\\n\\t\\t\\t\\tchildren, you have a fourth of what they leave after\\n\\t\\t\\t\\tbequests and debts. They have a fourth of what you leave\\n\\t\\t\\t\\tif you have no children. If you have children, they have\\n\\t\\t\\t\\tan eighth after bequests or debts.' \" (Sura4ayat 11).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "NULL",
    "sectionHeading": "Inheritance of Fathers and Mothers from Children",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, -The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us about which there is no dispute and what I have\\n\\t\\t\\t\\tseen the people of knowledge in our city doing is that\\n\\t\\t\\t\\twhen a father inherits from a son or a daughter and the\\n\\t\\t\\t\\tdeceased leaves children, or grandchildren through a son,\\n\\t\\t\\t\\tthe father has a fixed share of one sixth. If the\\n\\t\\t\\t\\tdeceased does leave any children or male grandchildren\\n\\t\\t\\t\\tthrough a son, the apportioning begins with those with\\n\\t\\t\\t\\twhom the father shares in the fixed shares. They are\\n\\t\\t\\t\\tgiven their fixed shares. If a sixth or more is left\\n\\t\\t\\t\\tover, the sixth and what is above it is given to the\\n\\t\\t\\t\\tfather, and if there is less than a sixth left, the\\n\\t\\t\\t\\tfather is given his sixth as a fixed share, (i.e. the\\n\\t\\t\\t\\tother shares are adjusted.)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"The inheritance of a mother from her child, if her son\\n\\t\\t\\t\\tor daughter dies and leaves children or male or female\\n\\t\\t\\t\\tgrandchildren through a son, or leaves two or more full\\n\\t\\t\\t\\tor half siblings is a sixth. If the deceased does not\\n\\t\\t\\t\\tleave any children or grandchildren through a son, or two\\n\\t\\t\\t\\tor more siblings, the mother has a whole third except in\\n\\t\\t\\t\\ttwo cases. One of them is if a man dies and leaves a wife\\n\\t\\t\\t\\tand both parents. The wife has a fourth, the mother a\\n\\t\\t\\t\\tthird of what remains, (which is a fourth of the\\n\\t\\t\\t\\tcapital). The other is if a wife dies and leaves a\\n\\t\\t\\t\\thusband and both parents. The husband gets half, and the\\n\\t\\t\\t\\tmother a third of what remains, (which is a sixth of the\\n\\t\\t\\t\\tcapital). That is because Allah, the Blessed, the\\n\\t\\t\\t\\tExalted, says in His Book, 'His two parents each have a\\n\\t\\t\\t\\tsixth of what he leaves if he has children. If he does\\n\\t\\t\\t\\tnot have children, and his parents inherit from him, his\\n\\t\\t\\t\\tmother has a third. If he has siblings, the mother has a\\n\\t\\t\\t\\tsixth.' (Sura 4 ayat 11). The sunna is that the siblings\\n\\t\\t\\t\\tbe two or more.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "NULL",
    "sectionHeading": "Inheritance of Maternal Half-Siblings",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed upon way of doing\\n\\t\\t\\t\\tthings among us is that maternal half-siblings do not\\n\\t\\t\\t\\tinherit anything when there are children or grandchildren\\n\\t\\t\\t\\tthrough sons, male or female. They do not inherit\\n\\t\\t\\t\\tanything when there is a father or the father's father.\\n\\t\\t\\t\\tThey inherit in what is outside of that. If there is only\\n\\t\\t\\t\\tone male or female, they are given a sixth. If there are\\n\\t\\t\\t\\ttwo, each of them has a sixth. If there are more than\\n\\t\\t\\t\\tthat, they share in a third which is divided among them.\\n\\t\\t\\t\\tThe male has a portion of two females. That is because\\n\\t\\t\\t\\tAllah, the Blessed, the Exalted, says in His Book, 'If a\\n\\t\\t\\t\\tman or woman has no direct heir, and he has a brother or\\n\\t\\t\\t\\tsister, by the mother, each of them has a sixth. If there\\n\\t\\t\\t\\tare more than two, they share equally in a third.' \"\\n\\t\\t\\t\\t(Sura 4 ayat 12).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "NULL",
    "sectionHeading": "Inheritance of Full Siblings",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us is that full siblings do not inherit anything\\n\\t\\t\\t\\twith sons nor anything with grandsons through a son, nor\\n\\t\\t\\t\\tanything with the father. They do inherit with the\\n\\t\\t\\t\\tdaughters and the granddaughters through a son when the\\n\\t\\t\\t\\tdeceased does not leave a paternal grandfather. Any\\n\\t\\t\\t\\tproperty that is left over, they are in it as paternal\\n\\t\\t\\t\\trelations. One begins with the people who are allotted\\n\\t\\t\\t\\tfixed shares. They are given their shares. If there is\\n\\t\\t\\t\\tanything left over after that, it belongs to the full\\n\\t\\t\\t\\tsiblings. They divide it between themselves according to\\n\\t\\t\\t\\tthe Book of Allah, whether they are male or female. The\\n\\t\\t\\t\\tmale has a portion of two females. If there is nothing\\n\\t\\t\\t\\tleft over, they have nothing.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"If the deceased does not leave a father or a paternal\\n\\t\\t\\t\\tgrandfather or children or male or female grandchildren\\n\\t\\t\\t\\tthrough a son, a single full sister gets a half. If there\\n\\t\\t\\t\\tare two or more full sisters, they get two thirds. If\\n\\t\\t\\t\\tthere is a brother with them, sisters, whether one or\\n\\t\\t\\t\\tmore, do not have a fixed share. One begins with whoever\\n\\t\\t\\t\\tshares in the fixed shares. They are given their shares.\\n\\t\\t\\t\\tWhatever remains after that goes to the full siblings.\\n\\t\\t\\t\\tThe male has the portion of two females except in one\\n\\t\\t\\t\\tcase, in which the full siblings have nothing. They share\\n\\t\\t\\t\\tin this case the third of the half-siblings by the\\n\\t\\t\\t\\tmother. That case is when a woman dies and leaves a\\n\\t\\t\\t\\thusband, a mother, half-siblings by her mother, and full\\n\\t\\t\\t\\tsiblings. The husband has a half. The mother has one\\n\\t\\t\\t\\tsixth. The half-siblings by the mother have a third.\\n\\t\\t\\t\\tNothing is left after that, so the full siblings share in\\n\\t\\t\\t\\tthis case with the half-siblings by the mother in their\\n\\t\\t\\t\\tthird. The male has the portion of two females in as much\\n\\t\\t\\t\\tas all of them are siblings of the deceased by the\\n\\t\\t\\t\\tmother. They inherit by the mother. That is because\\n\\t\\t\\t\\tAllah, the Blessed, the Exalted, said in His Book, 'If a\\n\\t\\t\\t\\tman or a woman has no direct heir and he has a brother or\\n\\t\\t\\t\\ta sister, each one of the two gets a sixth. If there are\\n\\t\\t\\t\\tmore than that, they share equally in the third. ' (Sura\\n\\t\\t\\t\\t4 ayat 12) . They therefore share in this case because\\n\\t\\t\\t\\tall of them are siblings of the deceased by the mother.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "NULL",
    "sectionHeading": "Inheritance of Paternal Half-Siblings",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on wayof doing things\\n\\t\\t\\t\\tamong us is that when there are no full siblings with\\n\\t\\t\\t\\tthem, half-siblings by the father take the position of\\n\\t\\t\\t\\tfull siblings. Their males are like the males of the full\\n\\t\\t\\t\\tsiblings, and their females are like their females except\\n\\t\\t\\t\\tin the case where the half-siblings by the mother and the\\n\\t\\t\\t\\tfull siblings share, because they are not offspring of\\n\\t\\t\\t\\tthe mother who joins these.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If there are both full siblings and\\n\\t\\t\\t\\thalf-siblings by the father and there is a male among the\\n\\t\\t\\t\\tfull siblings none of the half-siblings by the father\\n\\t\\t\\t\\thave any inheritance. If there is one or more females in\\n\\t\\t\\t\\tthe full siblings and there is no male with them, the one\\n\\t\\t\\t\\tfull sister gets a half, and the half sister by the\\n\\t\\t\\t\\tfather gets a sixth, completing the two-thirds. If there\\n\\t\\t\\t\\tis a male with the half-sisters by the father, they have\\n\\t\\t\\t\\tno share. The people of fixed shares are given their\\n\\t\\t\\t\\tshares and if there is something left after that it is\\n\\t\\t\\t\\tdivided between the half-siblings by the father. The male\\n\\t\\t\\t\\thas the portion of two females. If there is nothing left\\n\\t\\t\\t\\tover, they get nothing. If the full siblings consist of\\n\\t\\t\\t\\ttwo or more females, they get two-thirds, and the\\n\\t\\t\\t\\thalf-sisters by the father get nothing with them unless\\n\\t\\t\\t\\tthere is a half-brother by the father with them. If there\\n\\t\\t\\t\\tis a half-brother by the father with them, the people of\\n\\t\\t\\t\\tfixed shares are given their shares and if there is\\n\\t\\t\\t\\tsomething left over after that, it is divided between the\\n\\t\\t\\t\\thalf-siblings by the father. The male gets the portion of\\n\\t\\t\\t\\ttwo females. If there is nothing left over, they get\\n\\t\\t\\t\\tnothing. Half-siblings by the mother, full-siblings, and\\n\\t\\t\\t\\thalf-siblings by the father, each have a sixth (when they\\n\\t\\t\\t\\tare onlyone). Two and more share a third. The male has\\n\\t\\t\\t\\tthe same portion as the female. They are in the same\\n\\t\\t\\t\\tposition in it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "1",
    "sectionHeading": "Inheritance of Grandfathers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the had heard that Muawiya ibn Abi Sufyan wrote to Zayd\\n\\t\\t\\t\\tibn Thabit asking him about the grandfather. Zayd ibn\\n\\t\\t\\t\\tThabit wrote to him, \"You have written to me asking me\\n\\t\\t\\t\\tabout the grandfather. Allah knows best. That is part of\\n\\t\\t\\t\\twhat is only determined by the amirs, i.e. the khalifs. I\\n\\t\\t\\t\\twas present with two khalifs before you who gave the\\n\\t\\t\\t\\tgrandfather a half with one sibling, and a third with\\n\\t\\t\\t\\ttwo. If there were more siblings, they did not decrease\\n\\t\\t\\t\\this third.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "2",
    "sectionHeading": "Inheritance of Grandfathers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tQabisa ibn Dhu'ayba that Umar ibn al-Khattab gave the\\n\\t\\t\\t\\tgrandfather \"what people give him today.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "3",
    "sectionHeading": "Inheritance of Grandfathers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSulayman ibn Yasar said, ''Umar ibn al-Khattab, Uthman\\n\\t\\t\\t\\tibn Affan, andZayd ibn Thabit gave the grandfather a\\n\\t\\t\\t\\tthird with full siblings\". Malik said, \"The generally\\n\\t\\t\\t\\tagreed on way of doing things among us and what I have\\n\\t\\t\\t\\tseen the people of knowledge in our city doing is that\\n\\t\\t\\t\\tthe paternal grandfather does not inherit anything at all\\n\\t\\t\\t\\twith the father. He is given a sixth as a fixed share\\n\\t\\t\\t\\twith the son and the grandson through a son. Other than\\n\\t\\t\\t\\tthat, when the deceased does not leave a mother or a\\n\\t\\t\\t\\tpaternal aunt, one begins with whoever has a fixed share,\\n\\t\\t\\t\\tand they are given their shares. If there is a sixth of\\n\\t\\t\\t\\tthe property left over, the grandfather is given a sixth\\n\\t\\t\\t\\tas a fixed share.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When someone shares with the grandfather and\\n\\t\\t\\t\\tthe full siblings in a specified share, one begins with\\n\\t\\t\\t\\twhoever shares with them of the people of fixed shares.\\n\\t\\t\\t\\tThey are given their shares. What is left over after that\\n\\t\\t\\t\\tbelongs to the grandfather and the full siblings. Then\\n\\t\\t\\t\\tone sees which is the more favourable of two alternatives\\n\\t\\t\\t\\tfor the portion of the grandfather. Either a third is\\n\\t\\t\\t\\tallotted to him and the siblings to divide between them,\\n\\t\\t\\t\\tand he gets a share as if he were one of the siblings, or\\n\\t\\t\\t\\telse he takes a sixth from all the capital. Whichever is\\n\\t\\t\\t\\tthe best portion for the grandfather is given to him.\\n\\t\\t\\t\\tWhat is left after that, goes to the full siblings. The\\n\\t\\t\\t\\tmale gets the portion of two females except in one\\n\\t\\t\\t\\tparticular case. The division in this case is different\\n\\t\\t\\t\\tfrom the preceding one. This case is when a woman dies\\n\\t\\t\\t\\tand leaves a husband, mother, full sister and\\n\\t\\t\\t\\tgrandfather. The husband gets a half, the mother gets a\\n\\t\\t\\t\\tthird, the grandfather gets a sixth, and the full sister\\n\\t\\t\\t\\tgets a half. The sixth of the grandfather and the half of\\n\\t\\t\\t\\tthe sister are joined and divided into thirds. The male\\n\\t\\t\\t\\tgets the share of two females. Therefore, the grandfather\\n\\t\\t\\t\\thas two thirds, and the sister has one third.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The inheritance of the half-siblings by the\\n\\t\\t\\t\\tfather with the grandfather when there are no full\\n\\t\\t\\t\\tsiblings with them, is like the inheritance of the full\\n\\t\\t\\t\\tsiblings (in the same situation). The males are the same\\n\\t\\t\\t\\tas their males and the females are the same as their\\n\\t\\t\\t\\tfemales. When there are both full siblings and\\n\\t\\t\\t\\thalf-siblings by the father, the full siblings include in\\n\\t\\t\\t\\ttheir number the number of half-siblings by the father,\\n\\t\\t\\t\\tto limit the inheritance of the grandfather, i.e., if\\n\\t\\t\\t\\tthere was only one full sibling with the grandfather.\\n\\t\\t\\t\\tThey would share, after the allotting of the fixed\\n\\t\\t\\t\\tshares, the remainder of the inheritance between them\\n\\t\\t\\t\\tequally. If there were also two half-siblings by the\\n\\t\\t\\t\\tfather, their number is added to the division of the sum,\\n\\t\\t\\t\\twhich would then be divided four ways. A quarter going to\\n\\t\\t\\t\\tthe grandfather and three-quarters going to the full\\n\\t\\t\\t\\tsiblings who annex the shares technically allotted to the\\n\\t\\t\\t\\thalf-siblings by the father. They do not include the\\n\\t\\t\\t\\tnumber of half-siblings by the mother, because if there\\n\\t\\t\\t\\twere only half-siblings by the father they would not\\n\\t\\t\\t\\tinherit anything with the grandfather and all the capital\\n\\t\\t\\t\\twould belong to the grandfather, and so the siblings\\n\\t\\t\\t\\twould not get anything after the portion of the\\n\\t\\t\\t\\tgrandfather.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"It belongs to the full siblings more than the\\n\\t\\t\\t\\thalf-siblings by the father, and the half-siblings by the\\n\\t\\t\\t\\tfather do not get anything with them unless the full\\n\\t\\t\\t\\tsiblings consist of one sister. If there is one full\\n\\t\\t\\t\\tsister, she includes the grandfather with the\\n\\t\\t\\t\\thalf-siblings by her father in the division, however\\n\\t\\t\\t\\tmany. Whatever remains for her and these half-siblings by\\n\\t\\t\\t\\tthe father goes to her rather than them until she has had\\n\\t\\t\\t\\ther complete share, which is half of the total capital.\\n\\t\\t\\t\\tIf there is surplus beyond half of all the capital in\\n\\t\\t\\t\\twhat she and the half-siblings by the father acquire it\\n\\t\\t\\t\\tgoes to them. The male has the portion of two females. If\\n\\t\\t\\t\\tthere is nothing left over, they get nothing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "4",
    "sectionHeading": "Inheritance of Grandmothers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tUthman ibn Ishaq ibn Kharasha that Qabisa ibn Dhu'ayb\\n\\t\\t\\t\\tsaid, \"A grandmother came to Abu Bakr as-Siddiq and asked\\n\\t\\t\\t\\thim for her inheritance. Abu Bakr said to her, 'You have\\n\\t\\t\\t\\tnothing in the Book of Allah, and I do not know that you\\n\\t\\t\\t\\thave anything in the sunna of the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace. Go away therefore,\\n\\t\\t\\t\\tuntil I have questioned the people.' (i.e.the\\n\\t\\t\\t\\tCompanions). He questioned the people, and al-Mughira ibn\\n\\t\\t\\t\\tShuba said, 'I was present with the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, when he gave the\\n\\t\\t\\t\\tgrandmother a sixth.' Abu Bakr said, 'Was there anybody\\n\\t\\t\\t\\telse with you?' Muhammad ibn Maslama al-Ansari stood up\\n\\t\\t\\t\\tand said the like of what al-Mughira said. Abu Bakr\\n\\t\\t\\t\\tas-Siddiq gave it to her. Then the other grandmother came\\n\\t\\t\\t\\tto Umar ibn al-Khattab and asked him for her inheritance.\\n\\t\\t\\t\\tHe said to her, \"You have nothing in the Book of Allah,\\n\\t\\t\\t\\tand what has been decided is only for other than you, and\\n\\t\\t\\t\\tI am not one to add to the fixed shares, other than that\\n\\t\\t\\t\\tsixth. If there are two of you together, it is between\\n\\t\\t\\t\\tyou. If eitherof you is left alone with it, it is hers.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "5",
    "sectionHeading": "Inheritance of Grandmothers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad said, \"Two grandmothers came to Abu\\n\\t\\t\\t\\tBakr asSiddiq, and he wanted to give the sixth to the one\\n\\t\\t\\t\\twho was from the mother's side, and a man of the Ansar\\n\\t\\t\\t\\tsaid, 'What? Are you omitting the one from whom he would\\n\\t\\t\\t\\tinherit if she died while he was alive?' Abu Bakr divided\\n\\t\\t\\t\\tthe sixth between them.~\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "6",
    "sectionHeading": "Inheritance of Grandmothers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdu Rabbih ibn Said\\n\\t\\t\\t\\tthat Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham\\n\\t\\t\\t\\tonly gave a fixed share to two grandmothers (together).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us in which there is no dispute and which I saw the\\n\\t\\t\\t\\tpeople of knowledge in our city doing, is that the\\n\\t\\t\\t\\tmaternal grandmother does not inherit anything at all\\n\\t\\t\\t\\twith the mother. Outside of that, she is given a sixth as\\n\\t\\t\\t\\ta fixed share. The paternal grandmotherdoes not inherit\\n\\t\\t\\t\\tanything along with the mother or the father. Outside of\\n\\t\\t\\t\\tthat she is given a sixth as a fixed share.\" If both the\\n\\t\\t\\t\\tpaternal grandmother and maternal grandmother are alive,\\n\\t\\t\\t\\tand the deceased does not have a father or mother outside\\n\\t\\t\\t\\tof them, Malik said,.\"I have heard that if the maternal\\n\\t\\t\\t\\tgrandmother is the nearest of the two of them, then she\\n\\t\\t\\t\\thas a sixth instead of the paternal grandmother. If the\\n\\t\\t\\t\\tpaternal grandmother is nearer, or they are in the same\\n\\t\\t\\t\\tposition in relation to the deceased, the sixth is\\n\\t\\t\\t\\tdivided equally between them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"None of the female grand-relations except\\n\\t\\t\\t\\tfor these two has any inheritance because I have heard\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, gave the grandmother inheritance, and\\n\\t\\t\\t\\tthen Abu Bakr asked about that until someone reliable\\n\\t\\t\\t\\trelated from the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, that he had made the grandmother an\\n\\t\\t\\t\\their and given a share to her. Another grandmother came\\n\\t\\t\\t\\tto Umar ibn al-Khattab, and he said, 'I am not one to add\\n\\t\\t\\t\\tto fixed shares. If there are two of you together, it is\\n\\t\\t\\t\\tbetween you. If either of you is left alone with it, it\\n\\t\\t\\t\\tis hers.' \" Malik said, \"We do not know of anyone who\\n\\t\\t\\t\\tmade other than the two grandmothers heirs from the\\n\\t\\t\\t\\tbeginning of Islam to this day.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "7",
    "sectionHeading": "Inheritance of Grandmothers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tUmar ibn al-Khattab asked the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, about someone who\\n\\t\\t\\t\\tdied without parents or offspring, and the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\thim, \"The ayat which was sent down in the summer at the\\n\\t\\t\\t\\tend of the Surat an-Nisa (Sura 4) is enoughfor you.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us, in which there is no dispute, and which I saw\\n\\t\\t\\t\\tthe people of knowledge in our city doing, is that the\\n\\t\\t\\t\\tperson who leaves neither parent or offspring can be of\\n\\t\\t\\t\\ttwo types. As for the kind described in the ayat which\\n\\t\\t\\t\\twas sent down at the beginning of the Surat an-Nisa in\\n\\t\\t\\t\\twhich Allah, the Blessed, the Exalted! said, 'If a man or\\n\\t\\t\\t\\ta woman has no direct heir, but has a brother or a sister\\n\\t\\t\\t\\tby the mother, each of the two has a sixth. If there are\\n\\t\\t\\t\\tmore than that, they share equally in a third.' (Sura 4\\n\\t\\t\\t\\tayat 12) This heirless one does not have heirs among his\\n\\t\\t\\t\\tmother's siblings since there are no children or parents.\\n\\t\\t\\t\\tAs for the other kind described in the ayat which comes\\n\\t\\t\\t\\tat the end of the Surat an-Nisa, Allah, the Blessed, the\\n\\t\\t\\t\\tExalted, said in it, 'They will ask you for a decision.\\n\\t\\t\\t\\tSay, \"Allah gives you a decision about the indirect\\n\\t\\t\\t\\theirs. If a man perishes having no children, but he has a\\n\\t\\t\\t\\tsister, she shall receive a half of what he leaves, and\\n\\t\\t\\t\\the is her heir if she has no children. If there are two\\n\\t\\t\\t\\tsisters, they shall receive two-thirds of what he leaves.\\n\\t\\t\\t\\tIf there are brothers and sisters, the male shall receive\\n\\t\\t\\t\\tthe portion of two females. Allah makes clear to you that\\n\\t\\t\\t\\tyou might not go astray. Allah has knowledge of\\n\\t\\t\\t\\teverything\" ' \" (Sura 4 ayat 176).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If this person without direct heirs\\n\\t\\t\\t\\t(parents) or children has siblings by the father, they\\n\\t\\t\\t\\tinherit with the grandfather from the person without\\n\\t\\t\\t\\tdirect heirs. The grandfather inherits with the siblings\\n\\t\\t\\t\\tbecause he is more entitled to the inheritance than them.\\n\\t\\t\\t\\tThat is because he inherits a sixth with the male\\n\\t\\t\\t\\tchildren of the deceased when the siblings do not inherit\\n\\t\\t\\t\\tanything with the male children of the deceased. How can\\n\\t\\t\\t\\the not be like one of them when he takes a sixth with the\\n\\t\\t\\t\\tchildren of the deceased? How can he not take a third\\n\\t\\t\\t\\twith the siblings while the brother's sons take a third\\n\\t\\t\\t\\twith them? The grandfather is the one who overshadows the\\n\\t\\t\\t\\thalf-siblings by the mother and keeps them from\\n\\t\\t\\t\\tinheriting. He is more entitled to what they have because\\n\\t\\t\\t\\tthey are omitted for his sake. If the grandfather did not\\n\\t\\t\\t\\ttake that third, the half-siblings by the mother would\\n\\t\\t\\t\\ttake it and would take what does not return to the\\n\\t\\t\\t\\thalf-siblings by the father. The half-siblings by the\\n\\t\\t\\t\\tmother are more entitled to that third than the\\n\\t\\t\\t\\thalf-siblings by the father while the grandfather is more\\n\\t\\t\\t\\tentitled to that than the half-siblings by the mother.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "8",
    "sectionHeading": "Paternal Aunts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Abi Bakr\\n\\t\\t\\t\\tibn Muhammad ibn Amribn Hazm that Abdar-Rahman ibn\\n\\t\\t\\t\\tHanthala az-Zurqi was informed by a mawla of Quraysh,who\\n\\t\\t\\t\\tused to be known as Ibn Mursi, that he was sitting with\\n\\t\\t\\t\\tUmar ibn al-Khattab, and when they had prayed dhuhr, he\\n\\t\\t\\t\\tsaid, \"Yarfa! Bring that letter! (a letter which he had\\n\\t\\t\\t\\twritten about the paternal aunt.) We asked about her and\\n\\t\\t\\t\\tasked for information about her.\" Yarfa brought it to\\n\\t\\t\\t\\thim. He called for a small vessel or a drinking-bowl in\\n\\t\\t\\t\\twhich there was water. He erased the letter in it. Then\\n\\t\\t\\t\\the said, \"Had Allah approved of you as an heir, we would\\n\\t\\t\\t\\thave confirmed you. Had Allah approved of you, we would\\n\\t\\t\\t\\thave confirmed you.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "9",
    "sectionHeading": "Paternal Aunts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Muhammad ibn Abi Bakr\\n\\t\\t\\t\\tibn Hazm heard his father say many times, ''Umar ibn\\n\\t\\t\\t\\tal-Khattab used to say, 'It is a wonder that the paternal\\n\\t\\t\\t\\taunt is inherited from and does not inherit.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "9",
    "sectionHeading": "Inheritance of Paternal Relations",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us, in which there is no dispute, and which I saw\\n\\t\\t\\t\\tthe people of knowledge in our city doing, about paternal\\n\\t\\t\\t\\trelations is that full brothers are more entitled to\\n\\t\\t\\t\\tinherit than half-brothers by the father and\\n\\t\\t\\t\\thalf-brothers by the father are more entitled to inherit\\n\\t\\t\\t\\tthan the children of the full brothers. The sons of the\\n\\t\\t\\t\\tfull brothers are more entitled to inherit than the sons\\n\\t\\t\\t\\tof the half-brothers by the father. The sons of the\\n\\t\\t\\t\\thalf-brothers by the father are more entitled to inherit\\n\\t\\t\\t\\tthan the sons of the sons of the full brothers. The sons\\n\\t\\t\\t\\tof the sons of the half-brothers by the father's side are\\n\\t\\t\\t\\tmore entitled to inherit than the paternal uncle, the\\n\\t\\t\\t\\tfull brother of the father. The paternal uncle, the full\\n\\t\\t\\t\\tbrother of the father, is more entitled to inherit than\\n\\t\\t\\t\\tthe paternal uncle, the half-brotherof the father on the\\n\\t\\t\\t\\tfather's side. The paternal uncle, the half-brother of\\n\\t\\t\\t\\tthe father on the father's side is more entitled to\\n\\t\\t\\t\\tinherit than the sons of the paternal uncle, the full\\n\\t\\t\\t\\tbrother of the father. The son of the paternal uncle on\\n\\t\\t\\t\\tthe father's side is more entitled to inherit than the\\n\\t\\t\\t\\tpaternal great uncle, the full brother of the paternal\\n\\t\\t\\t\\tgrandfather.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Everything about which you are questioned\\n\\t\\t\\t\\tconcerning the inheritance of the paternal relations is\\n\\t\\t\\t\\tlike this. Trace the genealogy of the deceased and\\n\\t\\t\\t\\twhoever among the paternal relations contends for\\n\\t\\t\\t\\tinheritance. If you find that one of them reaches the\\n\\t\\t\\t\\tdeceased by a father and none of them except him reaches\\n\\t\\t\\t\\thim by a father, then make his inheritance to the one who\\n\\t\\t\\t\\treaches him by the nearest father, rather than the one\\n\\t\\t\\t\\twho reaches him by what is above that. If you find that\\n\\t\\t\\t\\tthey all reach him by the same father who joins them,\\n\\t\\t\\t\\tthen see who is the nearest of kin. If there is only one\\n\\t\\t\\t\\thalf-brother by the father, give him the inheritance\\n\\t\\t\\t\\trather than more distant paternal relations. If there is\\n\\t\\t\\t\\ta full brother and you find them equally related from a\\n\\t\\t\\t\\tnumber of fathers or to one particular father so that\\n\\t\\t\\t\\tthey all reach the genealogy of the deceased and they are\\n\\t\\t\\t\\tall half-brothers by the father or full brothers, then\\n\\t\\t\\t\\tdivide the inheritance equally among them. If the parent\\n\\t\\t\\t\\tof one of them is an uncle (the full-brother of the\\n\\t\\t\\t\\tfather of the deceased) and whoever is with him is an\\n\\t\\t\\t\\tuncle (the paternal half brother of the father of the\\n\\t\\t\\t\\tdeceased), the inheritance goes to the sons of the full\\n\\t\\t\\t\\tbrother of the father rather than the sons of the\\n\\t\\t\\t\\tpaternal half-brother of the father. That is because\\n\\t\\t\\t\\tAllah, the Blessed, the Exalted, said, 'Those related by\\n\\t\\t\\t\\tblood are nearer to one another in the Book of Allah,\\n\\t\\t\\t\\tsurely Allah has knowledge of everything.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The paternal grandfather, is more entitled\\n\\t\\t\\t\\tto inherit than sons of the full-brother, and more\\n\\t\\t\\t\\tentitled than the uncle, the full brother of the father.\\n\\t\\t\\t\\tThe son of the father's brother is more entitled to\\n\\t\\t\\t\\tinherit from mawali retainers (freed slaves) than the\\n\\t\\t\\t\\tgrandfathers.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "9",
    "sectionHeading": "People who do Not Inherit",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us in which there is no dispute and which I saw the\\n\\t\\t\\t\\tpeople of knowledge in our citydoing, is that the child\\n\\t\\t\\t\\tof the half-sibling by the mother, the paternal\\n\\t\\t\\t\\tgrandfather, the paternal uncle who is the maternal\\n\\t\\t\\t\\thalf-brother of the father, the maternal uncle, the\\n\\t\\t\\t\\tgreat-grandmother who is the mother of the mother's\\n\\t\\t\\t\\tfather, the daughter of the full-brother, the paternal\\n\\t\\t\\t\\taunt, and the maternal aunt do not inherit anything by\\n\\t\\t\\t\\ttheir kinship.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The woman who is the furthest relation of\\n\\t\\t\\t\\tthe deceased of those who were named in this book, does\\n\\t\\t\\t\\tnot inherit anything by her kinship, and women do not\\n\\t\\t\\t\\tinherit anything apart from those that are named in the\\n\\t\\t\\t\\tQur'an. Allah, the Blessed, the Exalted, mentioned in His\\n\\t\\t\\t\\tBook the inheritance ofthe mother from her children, the\\n\\t\\t\\t\\tinheritance of the daughters from their father, the\\n\\t\\t\\t\\tinheritance of the wife from her husband, the inheritance\\n\\t\\t\\t\\tof the full sisters, the inheritance of the half-sisters\\n\\t\\t\\t\\tby the father and the inheritance of the half-sisters by\\n\\t\\t\\t\\tthe mother. The grandmother is made an heir by the\\n\\t\\t\\t\\texample of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, made about her. A woman inherits from a slave she\\n\\t\\t\\t\\tfrees herself because Allah, the Blessed, the Exalted,\\n\\t\\t\\t\\tsaid in His Book, 'They are your brothers in the deen and\\n\\t\\t\\t\\tyour mawali.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "10",
    "sectionHeading": "Inheritance from People of Other Religions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Ali\\n\\t\\t\\t\\tibn Husayn ibn Ali from Umar ibn Uthman ibn Affan from\\n\\t\\t\\t\\tUsama ibn Zayd that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"A muslim does not\\n\\t\\t\\t\\tinherit from a kafir.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "11",
    "sectionHeading": "Inheritance from People of Other Religions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Ali\\n\\t\\t\\t\\tibn Husayn ibn Ali ibn Abi Talib told him that Aqil and\\n\\t\\t\\t\\tTalib inherited from Abu Talib, and Ali did not\\n\\t\\t\\t\\tinheritfrom him. Ali said, \"Because of that, we have\\n\\t\\t\\t\\tgiven up our portion of ash Shab.\" (A house belonging to\\n\\t\\t\\t\\tBanu Hashim).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "12",
    "sectionHeading": "Inheritance from People of Other Religions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSulayman ibn Yasar that Muhammad ibn al-Ashath told him\\n\\t\\t\\t\\tthat he had a christian or jewish paternal aunt who died.\\n\\t\\t\\t\\tMuhammad ibn al-Ashath mentioned that to Umar ibn\\n\\t\\t\\t\\tal-Khattab and said to him, \"Who inherits from her?\" Umar\\n\\t\\t\\t\\tibn al-Khattab said to him, \"The people of her deen\\n\\t\\t\\t\\tinherit from her.\" Then he went to Uthman ibn Affan, and\\n\\t\\t\\t\\tasked him about that. Uthman said to him, \"Do you think\\n\\t\\t\\t\\tthat I have forgotten what Umar ibn al-Khattab said to\\n\\t\\t\\t\\tyou? The people.of her deen inherit from her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "13",
    "sectionHeading": "Inheritance from People of Other Religions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tIsmail ibn Abi Hakim that Umar ibn Abd al-Aziz freed a\\n\\t\\t\\t\\tchristian who then died. Ismail said, ''Umar ibn Abd\\n\\t\\t\\t\\tal-Aziz ordered me to put his property in the bayt\\n\\t\\t\\t\\tal-mal.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "14",
    "sectionHeading": "Inheritance from People of Other Religions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from a reliable source of\\n\\t\\t\\t\\this who had heard Said ibn al-Musayyab say, ''Umar ibn\\n\\t\\t\\t\\tal-Khattab refused to let anyone inherit from the\\n\\t\\t\\t\\tnon-arabs except for one who was born among the arabs.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a pregnant woman comes from the land of\\n\\t\\t\\t\\tthe enemy and gives birth in arab land so that he is her\\n\\t\\t\\t\\t(an arab) child, he inherits from her if she dies, and\\n\\t\\t\\t\\tshe inherits from him if he dies, by the Book of Allah.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us and the sunna in which there is no dispute, and\\n\\t\\t\\t\\twhat I saw the people of knowledge in our city doing, is\\n\\t\\t\\t\\tthat a Muslim does not inherit from a kafir by kinship,\\n\\t\\t\\t\\tclientage (wala'), or maternal relationship, nor does he\\n\\t\\t\\t\\t(the Muslim) overshadow any (of the kafirs) from his\\n\\t\\t\\t\\tinheritance.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Similarly, someone who forgoes his\\n\\t\\t\\t\\tinheritance when he is the chief heir does not overshadow\\n\\t\\t\\t\\tanyone from his inheritance.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "15",
    "sectionHeading": "People Killed in Battle or Otherwise whose Situation in Inheritance is Not Known",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman from more than one of the people of knowledge\\n\\t\\t\\t\\tof that time, that those who were killed on the Day of\\n\\t\\t\\t\\tthe Camel, the Day of Siffin, the Day of al-Harra, and\\n\\t\\t\\t\\tthe Day of Qudayd did not inherit from each other. None\\n\\t\\t\\t\\tof them inherited anything from his companion unless it\\n\\t\\t\\t\\twas known that he had been killed before his companion.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the way of doing things about which\\n\\t\\t\\t\\tthere is no dispute, and which none of the people of\\n\\t\\t\\t\\tknowledge in our city doubt. The procedure with two\\n\\t\\t\\t\\tmutual heirs who are drowned, or killed in another way,\\n\\t\\t\\t\\twhen it is not known which of them died first is the same\\n\\t\\t\\t\\t- neither of them inherits anything from his companion.\\n\\t\\t\\t\\tTheir inheritance goes to whoever remains of their heirs.\\n\\t\\t\\t\\tThey are inherited from by the living.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"No one should inherit from anyone else when\\n\\t\\t\\t\\tthere is doubt, and one should only inherit from the\\n\\t\\t\\t\\tother when there is certainty of knowledge and witnesses.\\n\\t\\t\\t\\tThat is because a man and his mawla whom his father has\\n\\t\\t\\t\\tfreed might die at the same time. The sons of the free\\n\\t\\t\\t\\tman could say, 'Our father inherited from the mawla.'\\n\\t\\t\\t\\tThey should not inherit from the mawla without knowledge\\n\\t\\t\\t\\tor testimony that he died first. The living people most\\n\\t\\t\\t\\tentitled to his wala' inherit from him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Another example is two full brothers who\\n\\t\\t\\t\\tdie. One of them has children and the other does not.\\n\\t\\t\\t\\tThey have a half-brother by their father. It is not known\\n\\t\\t\\t\\twhich of them died first, so the inheritance of the\\n\\t\\t\\t\\tchildless one goes to his half-brother by the father. The\\n\\t\\t\\t\\tchildren of the full-brother get nothing.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Another example is when a paternal aunt and\\n\\t\\t\\t\\tthe son of her brother die, or else the daughter of the\\n\\t\\t\\t\\tbrother and her paternal uncle. It is not known which of\\n\\t\\t\\t\\tthem died first. The paternal uncle does not inherit\\n\\t\\t\\t\\tanything from the daughter of his brother, and the son of\\n\\t\\t\\t\\tthe brother does not inherit anything from his paternal\\n\\t\\t\\t\\taunt.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "27",
    "hadithNumber": "16",
    "sectionHeading": "The Inheritance of the Child of Lian and the Child of Fornication.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUrwa ibn az-Zubayr said about the child of lian and the\\n\\t\\t\\t\\tchild of fornication, that if they died, the mother\\n\\t\\t\\t\\tinherited her right from them according to the Book of\\n\\t\\t\\t\\tAllah, the Mighty, the Majestic! The siblings by the\\n\\t\\t\\t\\tmother had their rights. The rest was inherited by the\\n\\t\\t\\t\\tformer masters of the mother if she was a freed slave. If\\n\\t\\t\\t\\tshe was a free woman by origin, she inherited her due and\\n\\t\\t\\t\\tthe siblings by the mother inherited their due, and the\\n\\t\\t\\t\\trest went to the Muslims.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I heard the same as that from Sulayman ibn\\n\\t\\t\\t\\tYasar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what I saw the people of knowledge\\n\\t\\t\\t\\tin our city doing.\"\\n\\t\\t\\t</p>"
  }
]
