[
  {
    "BookCode": "AMH",
    "VolumeNumber": "33",
    "hadithNumber": "1",
    "sectionHeading": "Sharecropping",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said to the jews of\\n\\t\\t\\t\\tKhaybar on the day of the conquest of Khaybar, \"I confirm\\n\\t\\t\\t\\tyou in it as long as Allah, the Mighty, the Majestic,\\n\\t\\t\\t\\testablishes you in it, provided that the fruits are\\n\\t\\t\\t\\tdivided between us and you.\" Said continued, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to send Abdullah ibn Rawaha, to assess the\\n\\t\\t\\t\\tdivision of the fruit crop between him and them, and he\\n\\t\\t\\t\\twould say, 'If you wish, you can buy it back, and if you\\n\\t\\t\\t\\twish, it is mine.' They would take it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "33",
    "hadithNumber": "2",
    "sectionHeading": "Sharecropping",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Sulayman ibn\\n\\t\\t\\t\\tYasar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, used to send Abdullah ibn Rawaha to\\n\\t\\t\\t\\tKhaybar, to assess the division of the fruit crop between\\n\\t\\t\\t\\thim and the jews of Khaybar.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe jews collected for Abdullah pieces of their women's\\n\\t\\t\\t\\tjewellery and said to him, \"This is yours. Go light on us\\n\\t\\t\\t\\tand don't be exact in the division!\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah ibn Rawaha said, \"O tribe of jews! By Allah! You\\n\\t\\t\\t\\tare among the most hateful to me of Allah's creation, but\\n\\t\\t\\t\\tit does not prompt me to deal unjustly with you. What you\\n\\t\\t\\t\\thave offered as a bribe is forbidden. We will not touch\\n\\t\\t\\t\\tit.\" They said, \"This is what supports the heavens and\\n\\t\\t\\t\\tthe earth.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a share-cropper waters the palms and\\n\\t\\t\\t\\tbetween them there is some uncultivated land, whatever he\\n\\t\\t\\t\\tcultivates in the uncultivated land is his.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the owner of the land makes a condition\\n\\t\\t\\t\\tthat he will cultivate the uncultivated land for himself,\\n\\t\\t\\t\\tthat is not good because the sharecropper does the\\n\\t\\t\\t\\twatering for the owner of the land and so he increases\\n\\t\\t\\t\\tthe owner of the land in property (without any return for\\n\\t\\t\\t\\thimself).\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the owner stipulates that the fruit crop\\n\\t\\t\\t\\tis to be shared between them, there is no harm in that if\\n\\t\\t\\t\\tall the maintenance of the property - seeding, watering\\n\\t\\t\\t\\tand case, etc. - are the concern of the sharecropper.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIf the share-cropper stipulates that the seeds are the\\n\\t\\t\\t\\tresponsibility of the owner of the property - that is not\\n\\t\\t\\t\\tpermitted because he has stipulated an outlay against the\\n\\t\\t\\t\\towner of the property. Share-cropping is conducted on the\\n\\t\\t\\t\\tbasis that all the care and expense is outlayed by the\\n\\t\\t\\t\\tshare-cropper, and the owner of the property is not\\n\\t\\t\\t\\tobliged anything. This is the accepted method of\\n\\t\\t\\t\\tshare-cropping.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a spring which was shared between two\\n\\t\\t\\t\\tmen, and then the water dried up and one of them wanted\\n\\t\\t\\t\\tto work on the spring and the other said, \"I don't have\\n\\t\\t\\t\\tthe means to work on it.\" He said, \"Tell the one who\\n\\t\\t\\t\\twants to work on the spring, 'Work and expend. All the\\n\\t\\t\\t\\twater will be yours. You will have its water until your\\n\\t\\t\\t\\tcompanion brings you half of what you have spent. If he\\n\\t\\t\\t\\tbrings you half of what you have spent, he can take his\\n\\t\\t\\t\\tshare of the water.' The first one is given all the\\n\\t\\t\\t\\twater, because he has spent on it, and if he does not\\n\\t\\t\\t\\treach anything by his work, the other has not incurred\\n\\t\\t\\t\\tany expense.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, -It is not good for a share-cropper not to\\n\\t\\t\\t\\texpend anything but his labour and to be hired for a\\n\\t\\t\\t\\tshare of the fruit while all the expense and work is\\n\\t\\t\\t\\tincurred by the owner of the garden, because the\\n\\t\\t\\t\\tshare-cropper does not know what the exact wage is going\\n\\t\\t\\t\\tto be for his labour, whether it will be little or\\n\\t\\t\\t\\tgreat.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"No-one who lends a qirad or grants a\\n\\t\\t\\t\\tshare-cropping contract, should exempt some of the\\n\\t\\t\\t\\twealth, or some of the trees from his agent, because, by\\n\\t\\t\\t\\tthat, the agent becomes his hired man. He says, 'I will\\n\\t\\t\\t\\tgrant you a share-crop provided that you work for me on\\n\\t\\t\\t\\tsuch-and-such a palm - water it and tend it. I will give\\n\\t\\t\\t\\tyou a qirad for such-and-such money provided that you\\n\\t\\t\\t\\twork for me with ten dinars. They are not part of the\\n\\t\\t\\t\\tqirad I have given you.' That must not be done and it is\\n\\t\\t\\t\\tnot good. This is what is done in our community.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna about what is permitted to an\\n\\t\\t\\t\\towner of a garden in share-cropping is that he can\\n\\t\\t\\t\\tstipulate to the share-cropper the maintenance of walls,\\n\\t\\t\\t\\tcleaning the spring, sweeping the irrigation canals,\\n\\t\\t\\t\\tpollinating the palms, pruning branches, harvesting the\\n\\t\\t\\t\\tfruit and such things, provided that the share-cropper\\n\\t\\t\\t\\thas a share of the fruit fixed by mutual agreement.\\n\\t\\t\\t\\tHowever, the owner cannot stipulate the beginning of new\\n\\t\\t\\t\\twork which the agent will start digging a well, raising\\n\\t\\t\\t\\tthe source of a well, instigating new planting, or\\n\\t\\t\\t\\tbuilding a cistern whose cost is great. That is as if the\\n\\t\\t\\t\\towner of the garden said to a certain man, 'Build me a\\n\\t\\t\\t\\thouse here or dig me a well or make a spring flow for me\\n\\t\\t\\t\\tor do some work for me for half the fruit of this garden\\n\\t\\t\\t\\tof mine,' before the fruit of the garden is sound and it\\n\\t\\t\\t\\tis halal to sell it. This is the sale of fruit before its\\n\\t\\t\\t\\tgood condition is clear. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbade fruit to be\\n\\t\\t\\t\\tsold before its good condition became clear.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the fruits are good and their good\\n\\t\\t\\t\\tcondition is clear and selling them is halal and then the\\n\\t\\t\\t\\towner asks a man to do one of those jobs for him,\\n\\t\\t\\t\\tspecifying the job, for half the fruit of his garden, for\\n\\t\\t\\t\\texample, there is no harm in that. He has hired the man\\n\\t\\t\\t\\tfor something recognised and known. The man has seen it\\n\\t\\t\\t\\tand is satisfied with it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"As for share-cropping, if the garden has no fruit or\\n\\t\\t\\t\\tlittle or bad fruit, he has only that. The labourer is\\n\\t\\t\\t\\tonly hired for a set amount, and hire is only permitted\\n\\t\\t\\t\\ton these terms. Hire is a type of sale. One man buys\\n\\t\\t\\t\\tanother man's work from him. It is not good if\\n\\t\\t\\t\\tuncertainty enters into it because the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, forbade\\n\\t\\t\\t\\tuncertain transactions.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna in share-cropping with us is that\\n\\t\\t\\t\\tit can be practised with any kind of fruit tree, palm,\\n\\t\\t\\t\\tvine, olive tree, pomegranate, peach, and soon. It is\\n\\t\\t\\t\\tpermitted, and there is no harm in it provided that the\\n\\t\\t\\t\\towner of the property has a share of the fruit: a half or\\n\\t\\t\\t\\ta third or a quarter or whatever.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Share-cropping is also permitted in any crop\\n\\t\\t\\t\\twhich emerges from the earth if it is a crop which is\\n\\t\\t\\t\\tpicked, and its owner cannot water, work on it and tend\\n\\t\\t\\t\\tit.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"Share-cropping becomes reprehensible in anything in\\n\\t\\t\\t\\twhich share-cropping is normally permitted if the fruit\\n\\t\\t\\t\\tis sound and the good condition is clear and it is halal\\n\\t\\t\\t\\tto sell it. He must share-crop in it the next year. If a\\n\\t\\t\\t\\tman waters fruit whose good condition is clear and it is\\n\\t\\t\\t\\thalal to sell it, and he picks it for the owner, for a\\n\\t\\t\\t\\tshare of the crop -it is not sharecropping. It is similar\\n\\t\\t\\t\\tto him being paid in dirhams and dinars. Share-cropping\\n\\t\\t\\t\\tis what is between pruning the palms and when the fruit\\n\\t\\t\\t\\tbecomes sound and its sale is halal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If some one makes a share-cropping contract\\n\\t\\t\\t\\tfor fruit trees before the condition becomes clear and\\n\\t\\t\\t\\tits sale is halal, it is share-cropping and is permitted\\n\\t\\t\\t\\t. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Uncultivated land must not be involved in a\\n\\t\\t\\t\\tshare-cropping contract. That is because it is halal for\\n\\t\\t\\t\\tthe owner to rent it for dinars and dirhams or the\\n\\t\\t\\t\\tequivalent for an accepted price.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for a man who gives his uncultivated\\n\\t\\t\\t\\tearth for a third or a fourth of what comes out of it,\\n\\t\\t\\t\\tthat is an uncertain transaction because crops may be\\n\\t\\t\\t\\tscant one time and plentiful another time. It may perish\\n\\t\\t\\t\\tcompletely and the owner of the land will have abandoned\\n\\t\\t\\t\\ta set rent which would have been good for him to rent the\\n\\t\\t\\t\\tland for. He takes an uncertain situation, and does not\\n\\t\\t\\t\\tknow whether or not it will be satisfactory. This is\\n\\t\\t\\t\\tdisapproved. It is like a man having someone travel for\\n\\t\\t\\t\\thim for a set amount, and then saying, 'Shall I give you\\n\\t\\t\\t\\ta tenth of the profit of the journey as your wage?' This\\n\\t\\t\\t\\tis not halal and must not be done.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik summed up,\"A man must not hire out himself or his\\n\\t\\t\\t\\tland or his ship unless for a set amount.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A distinction is made between sharecropping\\n\\t\\t\\t\\tin palms and in cultivated land because the owner of the\\n\\t\\t\\t\\tpalms cannot sell the fruit until its good condition is\\n\\t\\t\\t\\tclear. The owner of the land can rent it when it is\\n\\t\\t\\t\\tuncultivated with nothing on it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community about palms is\\n\\t\\t\\t\\tthat they can also be share-cropped for three and four\\n\\t\\t\\t\\tyears, and less or more than that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what I have heard. Any fruit trees\\n\\t\\t\\t\\tlike that are in the position of palms. Contracts for\\n\\t\\t\\t\\tseveral years are permissible for the sharecropper as\\n\\t\\t\\t\\tthey are permissible in the palms.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about the owner, \"He does not take anything\\n\\t\\t\\t\\tadditional from the share-cropper in the way of gold or\\n\\t\\t\\t\\tsilver or crops which increases him. That is not good.\\n\\t\\t\\t\\tThe share-cropper also must not take from the owner of\\n\\t\\t\\t\\tthe garden anything additional which will increase him of\\n\\t\\t\\t\\tgold, silver, crops or anything. Increase beyond what is\\n\\t\\t\\t\\tstipulated in the contract is not good. It is also not\\n\\t\\t\\t\\tgood for the lender of a qirad to be in this position. If\\n\\t\\t\\t\\tsuch an increase does enter share-cropping or quirad, it\\n\\t\\t\\t\\tbecomes by it hire. It is not good when hire enters it.\\n\\t\\t\\t\\tHire must never occur in a situation which has\\n\\t\\t\\t\\tuncertainty in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who gave land to another man in a\\n\\t\\t\\t\\tshare-cropping contract in which there were palms, vines,\\n\\t\\t\\t\\tor the like of that of fruit trees and there was also\\n\\t\\t\\t\\tuncultivated land in it. He said, \"If the uncultivated\\n\\t\\t\\t\\tland is secondary to the fruit trees, either in\\n\\t\\t\\t\\timportance or in size of land, there is no harm in\\n\\t\\t\\t\\tshare-cropping. That is if the palms take up two-thirds\\n\\t\\t\\t\\tof the land or more, and the uncultivated land is a third\\n\\t\\t\\t\\tor less. This is because when the land that the fruit\\n\\t\\t\\t\\ttrees take up is secondary to the uncultivated land and\\n\\t\\t\\t\\tthe cultivated land in which the palms, vines or the like\\n\\t\\t\\t\\tis a third or less, and the uncultivated land is\\n\\t\\t\\t\\ttwo-thirds or more, it is permitted to rent the land and\\n\\t\\t\\t\\tshare-cropping in it is haram.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"One of the practices of people is to give out\\n\\t\\t\\t\\tsharecropping contracts on property with fruit trees when\\n\\t\\t\\t\\tthere is uncultivated land in it, and to rent land while\\n\\t\\t\\t\\tthere are fruit trees on it, just as a Qur'an or sword\\n\\t\\t\\t\\twhich has some embellishment on it of silver is sold for\\n\\t\\t\\t\\tsilver, or a necklace or ring which have stones and gold\\n\\t\\t\\t\\tin them are sold for dinars. These sales continue to be\\n\\t\\t\\t\\tpermitted. People buy and sell by them. Nothing described\\n\\t\\t\\t\\tor instituted has come on that which if exceeded, makes\\n\\t\\t\\t\\tit haram, and if fallen below makes it halal. What is\\n\\t\\t\\t\\tdone in our community about that is what people practise\\n\\t\\t\\t\\tand permit among themselves. That is, if the gold or\\n\\t\\t\\t\\tsilver is secondary to what it is incorporated in, it is\\n\\t\\t\\t\\tpermitted to sell it. That is, if the value of the blade,\\n\\t\\t\\t\\tthe Qur'an, or the stones is two-thirds or more, and the\\n\\t\\t\\t\\tvalue of the decoration is one-third or less.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "33",
    "hadithNumber": "3",
    "sectionHeading": "The Condition About Slaves in Sharecropping",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The best of what has been\\n\\t\\t\\t\\theard about a sharecropper stipulating on the owner of\\n\\t\\t\\t\\tthe property the inclusion of some slave workers, is that\\n\\t\\t\\t\\tthere is no harm in that if they are workers that come\\n\\t\\t\\t\\twith the property. They are like the property. There is\\n\\t\\t\\t\\tno profit in them for the share-cropper except to lighten\\n\\t\\t\\t\\tsome of his burden. If they did not come with the\\n\\t\\t\\t\\tproperty, his toil would be harder. It is like\\n\\t\\t\\t\\tshare-cropping land with a spring or land with a watering\\n\\t\\t\\t\\ttrough. You will not find anyone who receives the same\\n\\t\\t\\t\\tshare for share-cropping two lands which are equal in\\n\\t\\t\\t\\tproperty and yield, when one property has a constant\\n\\t\\t\\t\\tplentiful spring and the other has a watering trough,\\n\\t\\t\\t\\tbecause of the lightness of working land with a spring,\\n\\t\\t\\t\\tand the hardship of working land with a watering trough.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"That is what is done in our community.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A share-cropper cannot employ workers from\\n\\t\\t\\t\\tthe property in other work, and he cannot make that a\\n\\t\\t\\t\\tstipulation with the one who gives him the share-cropping\\n\\t\\t\\t\\tcontract. Nor is it permitted to one who share-crops to\\n\\t\\t\\t\\tstipulate on the owner of the property inclusion of\\n\\t\\t\\t\\tslaves for use in the garden who are not in it when he\\n\\t\\t\\t\\tmakes the share-cropping contract.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"Nor must the owner of the property stipulate on the one\\n\\t\\t\\t\\twho uses his property for share-cropping that he take any\\n\\t\\t\\t\\tof the slaves of the property and remove him from the\\n\\t\\t\\t\\tproperty. The share-cropping of property is based on the\\n\\t\\t\\t\\tstate which it is currently in.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"If the owner of the property wants to remove one of the\\n\\t\\t\\t\\tslaves of the property, he removes him before the\\n\\t\\t\\t\\tshare-cropping, or if he wants to put someone into the\\n\\t\\t\\t\\tproperty, he does it before the share-cropping. Then he\\n\\t\\t\\t\\tgrants the share-cropping contract after that if he\\n\\t\\t\\t\\twishes. If any of the slaves die or go off or become ill,\\n\\t\\t\\t\\tthe owner of the property must replace them.\"\\n\\t\\t\\t</p>"
  }
]
