[
  {
    "SurahNumber": "44",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "See note [2] on  12:1 ."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "I.e., the night on which the revelation of the Qur'an\\n\\t\\t\\t\\tbegan: see surah {97}."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "The revelation of the Qur'an is but a continuation and,\\n\\t\\t\\t\\tindeed, the climax of all divine revelation which has\\n\\t\\t\\t\\tbeen going on since the very dawn of human consciousness.\\n\\t\\t\\t\\tIts innermost purpose has always been the warning\\n\\t\\t\\t\\textended by God to man not to abandon himself to mere\\n\\t\\t\\t\\tmaterial ambitions and pursuits and, thus, to lose sight\\n\\t\\t\\t\\tof spiritual values."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "Lit., \"was made distinct everything wise\", i.e., \"wisely\"\\n\\t\\t\\t\\tor \"in wisdom\": a metonymical attribution of the\\n\\t\\t\\t\\tadjective \"wise\" - which in reality relates to God, the\\n\\t\\t\\t\\tmaker of that distinction to what has thus been made\\n\\t\\t\\t\\tdistinct (Zamakhshari and Razi). The meaning is that the\\n\\t\\t\\t\\trevelation of the Qur'an, symbolized by that \"blessed\\n\\t\\t\\t\\tnight\" of its beginning, provides man with a standard\\n\\t\\t\\t\\twhereby to discern between good and evil, or between all\\n\\t\\t\\t\\tthat leads to spiritual growth through an ever-deepening\\n\\t\\t\\t\\trealization (ma'rifah) of God's existence, on the one\\n\\t\\t\\t\\thand, and all that results in spiritual blindness and\\n\\t\\t\\t\\tself-destruction, on the other."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "7",
    "NoteID": "6",
    "Body": "Lit., \"if you had but inner certainty\". According to Abu\\n\\t\\t\\t\\tMuslim al-Isfahani (as quoted by Razi), this means, \"you\\n\\t\\t\\t\\twould know it if you would but truly desire inner\\n\\t\\t\\t\\tcertainty and would pray for it\"."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "Lit., \"are toying in doubt\": i.e., their half-hearted\\n\\t\\t\\t\\tadmission of the  possibility that God exists is\\n\\t\\t\\t\\tcompounded of doubt and irony (Zamakhshari) - doubt as to\\n\\t\\t\\t\\tthe proposition of God's existence, and an ironical\\n\\t\\t\\t\\tamusement at the idea of divine revelation."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "14",
    "NoteID": "8",
    "Body": "A reference to the allegation of the Prophet's opponents\\n\\t\\t\\t\\tthat someone else had \"imparted\" to him the ideas\\n\\t\\t\\t\\texpressed in the Qur'an (see  16:103  and the\\n\\t\\t\\t\\tcorresponding notes [129] and [130]), or at least had\\n\\t\\t\\t\\t\"helped\" him to compose it (cf.  25:4  and notes [5] and\\n\\t\\t\\t\\t[6])."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "15",
    "NoteID": "9",
    "Body": "Lit., \"remove\". This is apparently said on the time-level\\n\\t\\t\\t\\tof the present - i.e., before the coming of the Last Hour\\n\\t\\t\\t\\t- so as to give the sinners an opportunity to repent."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "18",
    "NoteID": "10",
    "Body": "Most of the classical commentators (e.g., Tabari,\\n\\t\\t\\t\\tZamakhshari, Razi, Baydawi) point out that this phrase\\n\\t\\t\\t\\tcan be understood in either of two senses, namely: \"Give\\n\\t\\t\\t\\tin unto me, O God's bondmen ('ibad )\", implying a call to\\n\\t\\t\\t\\tthe Egyptians (since all human beings are \"God's\\n\\t\\t\\t\\tbondmen\") to accept the divine message which Moses was\\n\\t\\t\\t\\tabout to convey to them; or, alternatively, \"Give up to\\n\\t\\t\\t\\tme God's servants\", i.e., the children of Israel, who\\n\\t\\t\\t\\twere kept in bondage in Egypt.\\tInasmuch as the\\n\\t\\t\\t\\tvocalization 'ibada is applicable to the vocative as well\\n\\t\\t\\t\\tas the accusative case, either of these two\\n\\t\\t\\t\\tinterpretations is legitimate."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "20",
    "NoteID": "11",
    "Body": "Lit., \"lest you throw stones at me\". It is to be noted\\n\\t\\t\\t\\tthat the verb rajama is used in the physical sense of\\n\\t\\t\\t\\t\"throwing stones\" as well as, metaphorically, in the\\n\\t\\t\\t\\tsense of \"throwing aspersions\" or \"reviling\"."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "24",
    "NoteID": "12",
    "Body": "Or: \"cleft\" - the expression rahwan having both these\\n\\t\\t\\t\\tconnotations (Jawhari, with especial reference to the\\n\\t\\t\\t\\tabove phrase). See also notes [33] and [35] on\\n\\t\\t\\t\\t{26:63-66}."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "29",
    "NoteID": "13",
    "Body": "Sc., \"to repent their sins\"."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "31",
    "NoteID": "14",
    "Body": "For this rendering of the term musrif, see surah {10},\\n\\t\\t\\t\\tnote [21]."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "32",
    "NoteID": "15",
    "Body": "I.e., according to all commentators, above all people of\\n\\t\\t\\t\\ttheir time, because at that time the children of Israel\\n\\t\\t\\t\\twere the only people who worshipped the One God: which is\\n\\t\\t\\t\\tthe reason of the frequent Qur'anic references to the\\n\\t\\t\\t\\tstory of their delivery from bondage. The stress on God's\\n\\t\\t\\t\\thaving \"chosen them knowingly\" alludes to His\\n\\t\\t\\t\\tforeknowledge that in later times they would deteriorate\\n\\t\\t\\t\\tmorally and thus forfeit His grace (Zamakhshari and\\n\\t\\t\\t\\tRazi)."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "33",
    "NoteID": "16",
    "Body": "Lit., \"as would have in them a manifest test\": an\\n\\t\\t\\t\\tallusion to the long line of prophets raised in their\\n\\t\\t\\t\\tmidst, as well as to the freedom and prosperity which\\n\\t\\t\\t\\tthey were to enjoy in the Promised Land. All this\\n\\t\\t\\t\\tpresaged a test of their sincerity with regard to the\\n\\t\\t\\t\\tspiritual principles which in the beginning raised them\\n\\t\\t\\t\\t\"above all other people\" and, thus, of their willingness\\n\\t\\t\\t\\tto act as God's message-bearers to all the world. The\\n\\t\\t\\t\\tformulation of the above sentence implies elliptically\\n\\t\\t\\t\\tthat they did not pass that test inasmuch as they soon\\n\\t\\t\\t\\tforgot the spiritual mission for which they had been\\n\\t\\t\\t\\telected, and began to regard themselves as God's \"chosen\\n\\t\\t\\t\\tpeople\" simply on account of their descent from Abraham:\\n\\t\\t\\t\\ta notion which the Qur'an condemns in many places. Apart\\n\\t\\t\\t\\tfrom this, the majority of the children of Israel very\\n\\t\\t\\t\\tsoon lost their erstwhile conviction that the life in\\n\\t\\t\\t\\tthis world is but the first and not the final stage of\\n\\t\\t\\t\\thuman life, and - as their Biblical history shows -\\n\\t\\t\\t\\tabandoned themselves entirely to the pursuit of material\\n\\t\\t\\t\\tprosperity and power. (See next note.)"
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "34",
    "NoteID": "17",
    "Body": "Although, on the face of it, by \"these people\" the\\n\\t\\t\\t\\tIsraelites are meant, the reference is obviously a\\n\\t\\t\\t\\tgeneral one, applying to all who hold the views expressed\\n\\t\\t\\t\\tin the sequence, and in particular to the pagan\\n\\t\\t\\t\\tcontemporaries of the Prophet Muhammad. Nevertheless,\\n\\t\\t\\t\\tthere is a subtle connection between this passage and the\\n\\t\\t\\t\\tpreceding allusion to the \"test\" with which the children\\n\\t\\t\\t\\tof Israel were to be faced: for it is a historical fact\\n\\t\\t\\t\\tthat up to the time of the destruction of the Second\\n\\t\\t\\t\\tTemple and their dispersion by the Roman emperor Titus,\\n\\t\\t\\t\\tthe priestly aristocracy among the Jews, known as the\\n\\t\\t\\t\\tSadducees, openly denied the concepts of resurrection,\\n\\t\\t\\t\\tdivine judgment and life in the hereafter, and advocated\\n\\t\\t\\t\\ta thoroughly materialistic outlook on life."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "35",
    "NoteID": "18",
    "Body": "I.e., \"it is a final death, with nothing beyond it\"."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "36",
    "NoteID": "19",
    "Body": "I.e., \"bring our forefathers back to life and let them\\n\\t\\t\\t\\tbear witness that there is a hereafter\". This ironic\\n\\t\\t\\t\\tdemand accords with the saying of the unbelievers\\n\\t\\t\\t\\tmentioned in  43:22  and {23}, \"We found our forefathers\\n\\t\\t\\t\\tagreed on what to believe - and, verily, it is in their\\n\\t\\t\\t\\tfootsteps that we find our guidance!\" Thus, in the last\\n\\t\\t\\t\\tresort, the fact that their ancestors did not believe in\\n\\t\\t\\t\\ta hereafter is to them as conclusive an argument against\\n\\t\\t\\t\\tit as the fact that nobody has as yet come back to life\\n\\t\\t\\t\\tto confirm the truth of resurrection."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "37",
    "NoteID": "20",
    "Body": "\"Tubba\" was the title borne by a succession of powerful\\n\\t\\t\\t\\tHimyar kings who ruled for centuries over the whole of\\n\\t\\t\\t\\tSouth Arabia, and were finally overcome by the\\n\\t\\t\\t\\tAbyssinians in the fourth century of the Christian era.\\n\\t\\t\\t\\tThey are mentioned elsewhere in the Qur'an ( 50:14 ) as\\n\\t\\t\\t\\thaving denied the truth of resurrection and God's\\n\\t\\t\\t\\tjudgment."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "38",
    "NoteID": "21",
    "Body": "I.e., without meaning or purpose (cf.  21:16 ) - implying\\n\\t\\t\\t\\tthat if there were no hereafter, man's life on earth\\n\\t\\t\\t\\twould be utterly meaningless, and thus in contradiction\\n\\t\\t\\t\\tto the above as well as the subsequent statement, \"none\\n\\t\\t\\t\\tof all this have We created without [an inner] truth\"."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "39",
    "NoteID": "22",
    "Body": "See note [11] on  10:5 ."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "40",
    "NoteID": "23",
    "Body": "See note [6] on  77:13 ."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "43",
    "NoteID": "24",
    "Body": "See surah {37}, note [22]."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "44",
    "NoteID": "25",
    "Body": "The term al-athim (lit., \"the sinful one\") has here\\n\\t\\t\\t\\tapparently a specific connotation, referring to a wilful\\n\\t\\t\\t\\tdenial of resurrection and of God's judgment: in other\\n\\t\\t\\t\\twords, of all sense and meaning in man's existence."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "46",
    "NoteID": "26",
    "Body": "For this tropical meaning of the term hamim, see surah\\n\\t\\t\\t\\t{6}. note [62]."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "49",
    "NoteID": "27",
    "Body": "Lit., \"for, behold, thou wert . . .\", etc. - thus\\n\\t\\t\\t\\talluding to the sin of arrogance due to disbelief in a\\n\\t\\t\\t\\tcontinuation of life after death and, hence, in man's\\n\\t\\t\\t\\tultimate responsibility to God. (Cf. {96:6-8} \"Verily, man\\n\\t\\t\\t\\tbecomes grossly overweening whenever he believes himself\\n\\t\\t\\t\\tto be self-sufficient\" - and the corresponding note [4].)"
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "50",
    "NoteID": "28",
    "Body": "I.e., the continuation of life after death."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "53",
    "NoteID": "29",
    "Body": "For these particular allegories of life in paradise, see\\n\\t\\t\\t\\tnote [41] on  18:31 ."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "54",
    "NoteID": "30",
    "Body": "For the rendering of hur'in as \"companions pure, most\\n\\t\\t\\t\\tbeautiful of eye\", see surah {56}, notes [8] and [13]. It\\n\\t\\t\\t\\tis to be noted that the noun zawj (lit., \"a pair\" or -\\n\\t\\t\\t\\taccording to the context - \"one of a pair\") applies to\\n\\t\\t\\t\\teither of the two sexes, as does the transitive verb\\n\\t\\t\\t\\tzawaja, \"he paired\" or \"joined\", i.e., one person with\\n\\t\\t\\t\\tanother."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "55",
    "NoteID": "31",
    "Body": "Cf.  43:73 ."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "56",
    "NoteID": "32",
    "Body": "Lit., \"except [or \"beyond\"] the first [i.e., erstwhile]\\n\\t\\t\\t\\tdeath\" (cf. {37:58-59})."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "57",
    "NoteID": "33",
    "Body": "I.e., by His having offered them guidance, of which they\\n\\t\\t\\t\\tavailed themselves: thus, the attainment of ultimate\\n\\t\\t\\t\\tfelicity is the result of an interaction between God and\\n\\t\\t\\t\\tman, and of man's communion with Him."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "58",
    "NoteID": "34",
    "Body": "See note [81] on  19:97 ."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "59",
    "NoteID": "35",
    "Body": "I.e., whether they know it or not, God's will shall be\\n\\t\\t\\t\\tdone."
  }
]
