[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/008001",
        "Body":  "They ask thee (O Muhammad) of the spoils of war. Say: The spoils\n\t\t\tof war belong to Allah and the messenger, so keep your duty to\n\t\t\tAllah, and adjust the matter of your difference, and obey Allah\n\t\t\tand His messenger, if ye are (true) believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/008010",
        "Body":  "Allah appointed it only as good tidings, and that your hearts\n\t\t\tthereby might be at rest. Victory cometh only by the help of\n\t\t\tAllah. Lo! Allah is Mighty, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/008011",
        "Body":  "When he made the slumber fall upon you as a reassurance from Him\n\t\t\tand sent down water from the sky upon you, that thereby He might\n\t\t\tpurify you, and remove from you the fear of Satan, and make\n\t\t\tstrong your hearts and firm (your) feet thereby."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/008012",
        "Body":  "When thy Lord inspired the angels, (saying:) I am with you. So\n\t\t\tmake those who believe stand firm. I will throw fear into the\n\t\t\thearts of those who disbelieve. Then smite the necks and smite of\n\t\t\tthem each finger."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/008013",
        "Body":  "That is because they opposed Allah and His messenger. Whoso\n\t\t\topposeth Allah and His messenger, (for him) lo! Allah is severe\n\t\t\tin punishment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/008014",
        "Body":  "That (is the award), so taste it, and (know) that for\n\t\t\tdisbelievers is the torment of the Fire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/008015",
        "Body":  "O ye who believe, When ye meet those who disbelieve in battle,\n\t\t\tturn not your backs to them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/008016",
        "Body":  "Whoso on that day turneth his back to them, unless maneuvering\n\t\t\tfor battle or intent to join a company, he truly hath incurred\n\t\t\twrath from Allah, and his habitation will be hell, a hapless\n\t\t\tjourney\u0027s end."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/008017",
        "Body":  "Ye (Muslims) slew them not, but Allah slew them. And thou\n\t\t\t(Muhammad) threwest not when thou didst throw, but Allah threw,\n\t\t\tthat He might test the believers by a fair test from Him. Lo!\n\t\t\tAllah is Hearer, Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/008018",
        "Body":  "That (is the case); and (know) that Allah (it is) who maketh weak\n\t\t\tthe plan of disbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/008019",
        "Body":  "(O Qureysh!) If ye sought a judgment, now hath the judgment come\n\t\t\tunto you. And if ye cease (from persecuting the believers) it\n\t\t\twill be better for you, but if ye return (to the attack) We also\n\t\t\tshall return. And your host will avail you naught, however\n\t\t\tnumerous it be, and (know) that Allah is with the believers (in\n\t\t\tHis guidance)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/008002",
        "Body":  "They only are the (true) believers whose hearts feel fear when\n\t\t\tAllah is mentioned, and when the revelations of Allah are recited\n\t\t\tunto them they increase their faith, and who trust in their Lord;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/008020",
        "Body":  "O ye who believe! Obey Allah and His messenger, and turn not away\n\t\t\tfrom him when ye hear (him speak)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/008021",
        "Body":  "Be not as those who say, We hear, and they hear not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/008022",
        "Body":  "Lo! the worst of beasts in Allah\u0027s sight are the deaf, the dumb,\n\t\t\twho have no sense."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/008023",
        "Body":  "Had Allah Known of any good in them He would have made them hear,\n\t\t\tbut had He made them hear they would have turned away, averse."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/008024",
        "Body":  "O ye who believe; Obey Allah, and the messenger when He calleth\n\t\t\tyou to that which quickeneth you, and know that Allah cometh in\n\t\t\tbetween the man and his own heart, and that He it is unto Whom ye\n\t\t\twill be gathered."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/008025",
        "Body":  "And guard yourselves against a chastisement which cannot fall\n\t\t\texclusively on those of you who are wrong-doers, and know that\n\t\t\tAllah is severe in punishment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/008026",
        "Body":  "And remember, when ye were few and reckoned feeble in the land,\n\t\t\tand were in fear lest men should extirpate you, how He gave you\n\t\t\trefuge, and strengthened you with His help, and made provision of\n\t\t\tgood things for you, that haply ye might be thankful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/008027",
        "Body":  "O ye who believe! Betray not Allah and His messenger, nor\n\t\t\tknowingly betray your trusts."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/008028",
        "Body":  "And know that your possessions and your children are a test, and\n\t\t\tthat with Allah is immense reward."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/008029",
        "Body":  "O ye who believe! If ye keep your duty to Allah, He will give you\n\t\t\tdiscrimination (between right and wrong) and will rid you of your\n\t\t\tevil thoughts and deeds, and will forgive you. Allah is of\n\t\t\tinfinite bounty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/008003",
        "Body":  "Who establish worship and spend of that We have bestowed on them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/008030",
        "Body":  "And when those who disbelieve plot against thee (O Muhammad) to\n\t\t\twound thee fatally, or to kill thee or to drive thee forth; they\n\t\t\tplot, but Allah (also) plotteth; and Allah is the best of\n\t\t\tplotters."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/008031",
        "Body":  "And when Our revelations are recited unto them they say: We have\n\t\t\theard. If we wish we can speak the like of this. Lo! this is\n\t\t\tnaught but fables of the men of old."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/008032",
        "Body":  "And when they said: O Allah! If this be indeed the truth from\n\t\t\tThee, then rain down stones on us or bring on us some painful\n\t\t\tdoom!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/008033",
        "Body":  "But Allah would not punish them while thou wast with them, nor\n\t\t\twill He punish them while they seek forgiveness."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/008034",
        "Body":  "What (plea) have they that Allah should not punish them, when\n\t\t\tthey debar (His servants) from the Inviolable Place of Worship,\n\t\t\tthough they are not its fitting guardians. Its fitting guardians\n\t\t\tare those only who keep their duty to Allah. But most of them\n\t\t\tknow not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/008035",
        "Body":  "And their worship at the (holy) House is naught but whistling and\n\t\t\thand clapping. Therefore (it is said unto them): Taste of the\n\t\t\tdoom because ye disbelieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/008036",
        "Body":  "Lo! those who disbelieve spend their wealth in order that they\n\t\t\tmay debar (men) from the way of Allah. They will spend it, then\n\t\t\tit will become an anguish for them, then they will be conquered.\n\t\t\tAnd those who disbelieve will be gathered unto hell,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/008037",
        "Body":  "That Allah may separate the wicked from the good. The wicked will\n\t\t\tHe place piece upon piece, and heap them all together, and\n\t\t\tconsign them unto hell. Such verily are the losers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/008038",
        "Body":  "Tell those who disbelieve that if they cease (from persecution of\n\t\t\tbelievers) that which is past will be forgiven them; but if they\n\t\t\treturn (thereto) then the example of the men of old hath already\n\t\t\tgone (before them, for a warning)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/008039",
        "Body":  "And fight them until persecution is no more, and religion is all\n\t\t\tfor Allah. But if they cease, then lo! Allah is Seer of what they\n\t\t\tdo."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/008004",
        "Body":  "Those are they who are in truth believers. For them are grades\n\t\t\t(of honor) with their Lord, and pardon, and a bountiful\n\t\t\tprovision."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/008040",
        "Body":  "And if they turn away, then know that Allah is your Befriender, a\n\t\t\ttranscendent Patron, a transcendent Helper!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/008041",
        "Body":  "And know that whatever ye take as spoils of war, lo! a fifth\n\t\t\tthereof is for Allah, and for the messenger and for the kinsmen\n\t\t\t(who hath need) and orphans and the needy and the wayfarer; if ye\n\t\t\tbelieve in Allah and that which We revealed unto Our slave on the\n\t\t\tDay of Discrimination, the day when the two armies met. And Allah\n\t\t\tis Able to do all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/008042",
        "Body":  "When ye were on the near bank (of the valley) and they were on\n\t\t\tthe yonder bank, and the caravan was below you (on the coast\n\t\t\tplain). And had ye trysted to meet one another ye surely would\n\t\t\thave failed to keep the tryst, but (it happened, as it did,\n\t\t\twithout the forethought of either of you) that Allah might\n\t\t\tconclude a thing that must be done; that he who perished (on that\n\t\t\tday) might perish by a clear proof (of His sovereignty) and he\n\t\t\twho survived might survive by a clear proof (of His sovereignty).\n\t\t\tLo! Allah in truth is Hearer, Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/008043",
        "Body":  "When Allah showed them unto thee (O Muhammad) in thy dream as few\n\t\t\tin number, and if He had shown them to thee as many, ye (Muslims)\n\t\t\twould have faltered and would have quarrelled over the affair.\n\t\t\tBut Allah saved (you). Lo! He knoweth what is in the breasts (of\n\t\t\tmen)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/008044",
        "Body":  "And when He made you (Muslims), when ye met (them), see them with\n\t\t\tyour eyes as few, and lessened you in their eyes, (it was) that\n\t\t\tAllah might conclude a thing that must be done. Unto Allah all\n\t\t\tthings are brought back."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/008045",
        "Body":  "O ye who believe! When ye meet an army, hold firm and think of\n\t\t\tAllah much, that ye may be successful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/008046",
        "Body":  "And obey Allah and His messenger, and dispute not one with\n\t\t\tanother lest ye falter and your strength depart from you; but be\n\t\t\tsteadfast! Lo! Allah is with the steadfast."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/008047",
        "Body":  "Be not as those who came forth from their dwellings boastfully\n\t\t\tand to be seen of men, and debar (men) from the way of Allah,\n\t\t\twhile Allah is surrounding all they do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/008048",
        "Body":  "And when Satan made their deeds seem fair to them and said: No\n\t\t\tone of mankind can conquer you this day, for I am your protector.\n\t\t\tBut when the armies came in sight of one another, he took flight,\n\t\t\tsaying: Lo! I am guiltless of you. Lo! I see that which ye see\n\t\t\tnot. Lo! I fear Allah. And Allah is severe in punishment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/008049",
        "Body":  "When the hypocrites and those in whose hearts is a disease said:\n\t\t\tTheir religion hath deluded these. Whoso putteth his trust in\n\t\t\tAllah (will find that) lo! Allah is Mighty, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/008005",
        "Body":  "Even as thy Lord caused thee (Muhammad) to go forth from thy home\n\t\t\twith the Truth, and lo! a party of the believers were averse (to\n\t\t\tit),"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/008050",
        "Body":  "If thou couldst see how the angels receive those who disbelieve,\n\t\t\tsmiting their faces and their backs and (saying): Taste the\n\t\t\tpunishment of burning!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/008051",
        "Body":  "This is for that which your own hands have sent before (to the\n\t\t\tJudgment), and (know) that Allah is not a tyrant to His slaves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/008052",
        "Body":  "(Their way is) as the way of Pharaoh\u0027s folk and those before\n\t\t\tthem; they disbelieved the revelations of Allah, and Allah took\n\t\t\tthem in their sins. Lo! Allah is Strong, severe in punishment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/008053",
        "Body":  "That is because Allah never changeth the grace He hath bestowed\n\t\t\ton any people until they first change that which is in their\n\t\t\thearts, and (that is) because Allah is Hearer, Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/008054",
        "Body":  "(Their way is) as the way of Pharoah\u0027s folk and those before\n\t\t\tthem; they denied the revelations of their Lord, so We destroyed\n\t\t\tthem in their sins. And We drowned the folk of Pharaoh. All were\n\t\t\tevil doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/008055",
        "Body":  "Lo! the worst of beasts in Allah\u0027s sight are the ungrateful who\n\t\t\twill not believe;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/008056",
        "Body":  "Those of them with whom thou madest a treaty, and, then at every\n\t\t\topportunity they break their treaty, and they keep not duty (to\n\t\t\tAllah)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/008057",
        "Body":  "If thou comest on them in the war, deal with them so as to strike\n\t\t\tfear in those who are behind them, that haply they may remember."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/008058",
        "Body":  "And if thou fearest treachery from any folk, then throw back to\n\t\t\tthem (their treaty) fairly. Lo! Allah loveth not the treacherous."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/008059",
        "Body":  "And let not those who disbelieve suppose that they can outstrip\n\t\t\t(Allah\u0027s purpose). Lo! they cannot escape."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/008006",
        "Body":  "Disputing with thee of the Truth after it had been made manifest,\n\t\t\tas if they were being driven to death visible."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/008060",
        "Body":  "Make ready for them all thou canst of (armed) force and of horses\n\t\t\ttethered, that thereby ye may dismay the enemy of Allah and your\n\t\t\tenemy, and others beside them whom ye know not. Allah knoweth\n\t\t\tthem. Whatsoever ye spend in the way of Allah it will be repaid\n\t\t\tto you in full, and ye will not be wronged."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/008061",
        "Body":  "And if they incline to peace, incline thou also to it, and trust\n\t\t\tin Allah. Lo! He is the Hearer, the Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/008062",
        "Body":  "And if they would deceive thee, then lo! Allah is sufficient for\n\t\t\tthee. He it is Who supporteth thee with His help and with the\n\t\t\tbelievers,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/008063",
        "Body":  "And (as for the believers) hath attuned their hearts. If thou\n\t\t\thadst spent all that is in the earth thou couldst not have\n\t\t\tattuned their hearts, but Allah hath attuned them. Lo! He is\n\t\t\tMighty, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/008064",
        "Body":  "O Prophet! Allah is sufficient for thee and those who follow thee\n\t\t\tof the believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/008065",
        "Body":  "O Prophet! Exhort the believers to fight. If there be of you\n\t\t\ttwenty steadfast they shall overcome two hundred, and if there be\n\t\t\tof you a hundred steadfast they shall overcome a thousand of\n\t\t\tthose who disbelieve, because they (the disbelievers) are a folk\n\t\t\twithout intelligence."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/008066",
        "Body":  "Now hath Allah lightened your burden, for He knoweth that there\n\t\t\tis weakness in you. So if there be of you a steadfast hundred\n\t\t\tthey shall overcome two hundred, and if there be of you a\n\t\t\tthousand (steadfast) they shall overcome two thousand by\n\t\t\tpermission of Allah. Allah is with the steadfast."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/008067",
        "Body":  "It is not for any Prophet to have captives until he hath made\n\t\t\tslaughter in the land. Ye desire the lure of this world and Allah\n\t\t\tdesireth (for you) the Hereafter, and Allah is Mighty, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/008068",
        "Body":  "Had it not been for an ordinance of Allah which had gone before,\n\t\t\tan awful doom had come upon you on account of what ye took."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/008069",
        "Body":  "Now enjoy what ye have won, as lawful and good, and keep your\n\t\t\tduty to Allah. Lo! Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/008007",
        "Body":  "And when Allah promised you one of the two bands (of the enemy)\n\t\t\tthat it should be yours, and ye longed that other than the armed\n\t\t\tone might be yours. And Allah willed that He should cause the\n\t\t\tTruth to triumph by His words, and cut the root of the\n\t\t\tdisbelievers;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/008070",
        "Body":  "O Prophet, Say unto those captives who are in your hands: If\n\t\t\tAllah knoweth any good in your hearts He will give you better\n\t\t\tthan that which hath been taken from you, and will forgive you.\n\t\t\tLo! Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/008071",
        "Body":  "And if they would betray thee, they betrayed Allah before, and He\n\t\t\tgave (thee) power over them. Allah is knower, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/008072",
        "Body":  "Lo! those who believed and left their homes and strove with their\n\t\t\twealth and their lives for the cause of Allah, and those who took\n\t\t\tthem in and helped them; these are protecting friends one of\n\t\t\tanother. And those who believed but did not leave their homes, ye\n\t\t\thave no duty to protect them till they leave their homes; but if\n\t\t\tthey seek help from you in the matter of religion then it is your\n\t\t\tduty to help (them) except against a folk between whom and you\n\t\t\tthere is a treaty. Allah is Seer of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/008073",
        "Body":  "And those who disbelieve are protectors one of another--If ye do\n\t\t\tnot so, there will be confusion in the land, and great\n\t\t\tcorruption."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/008074",
        "Body":  "Those who believed and left their homes and strove for the cause\n\t\t\tof Allah, and those who took them in and helped them--these are\n\t\t\tthe believers in truth. For them is pardon, and a bountiful\n\t\t\tprovision."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/008075",
        "Body":  "And those who afterwards believed and left their homes and strove\n\t\t\talong with you, they are of you; and those who are akin are\n\t\t\tnearer one to another in the ordinance of Allah. Lo! Allah is\n\t\t\tKnower of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/008008",
        "Body":  "That He might cause the Truth to triumph and bring vanity to\n\t\t\tnaught, however much the guilty might oppose;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "8",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/008009",
        "Body":  "When ye sought help of your Lord and He answered you (saying): I\n\t\t\twill help you with a thousand of the angels, rank on rank."
    }
]
