[
  {
    "SurahNumber": "46",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Regarding the expression \"in accordance with [an inner]\\n\\t\\t\\t\\ttruth\", see note [11] on  10:5 . The reference to the\\n\\t\\t\\t\\t\"term\" set by God to all creation is meant to stress the\\n\\t\\t\\t\\tfact of its finality in time as well as in space, in\\n\\t\\t\\t\\tcontrast with His Own timelessness and infinity."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "Lit., \"from that whereof they have been warned\": i.e.,\\n\\t\\t\\t\\tthey refuse to heed the warning not to attribute divine\\n\\t\\t\\t\\tqualities to any being or force beside God."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "Sc., \"in support of your claim that there are other\\n\\t\\t\\t\\tdivine powers besides God\"."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "Lit., \"will not respond to him till the Day of\\n\\t\\t\\t\\tResurrection\", i.e., never."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "For this symbolic \"enmity\" of all false objects of\\n\\t\\t\\t\\tworship, see note [11] on {lS}."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "Lit.' \"sorcery\": see note [12] on  74:24 , where the term\\n\\t\\t\\t\\tsihr has been used, chronologically, for the first time\\n\\t\\t\\t\\tin the above sense. As in that early instance, the truth\\n\\t\\t\\t\\treferred to here is the message of the Qur'an."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "8",
    "NoteID": "8",
    "Body": "Sc., \"then why should I have invented all this for your\\n\\t\\t\\t\\tsake?\""
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "8",
    "NoteID": "9",
    "Body": "The implication is, \"May God forgive you, and grace you\\n\\t\\t\\t\\twith His guidance\" (Zamakhshari)."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "9",
    "NoteID": "10",
    "Body": "Thus Tabari, Baghawi, Razi, Ibn Kathir, implying - as\\n\\t\\t\\t\\tRazi stresses - \"I am but a human being like all of God's\\n\\t\\t\\t\\tmessage-bearers who preceded me\". Alternatively, the\\n\\t\\t\\t\\tphrase may be rendered as \"I am no innovator among the\\n\\t\\t\\t\\tapostles\" - i.e., \"I am not preaching anything that was\\n\\t\\t\\t\\tnot already preached by all of God's apostles before me\"\\n\\t\\t\\t\\t(Razi and Baydawi): which coincides with the Qur'anic\\n\\t\\t\\t\\tdoctrine of the identity of the ethical teachings\\n\\t\\t\\t\\tpropounded by all of God's prophets."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "9",
    "NoteID": "11",
    "Body": "I.e., \"What will happen to all of us in this world\"\\n\\t\\t\\t\\t(Tabari, quoting with approval this interpretation of\\n\\t\\t\\t\\tAl-Hasan al-Basri), or \"both in this world and in the\\n\\t\\t\\t\\thereafter\" (Baydawi). Either of these two interpretations\\n\\t\\t\\t\\timplies a denial on the Prophet's part of any\\n\\t\\t\\t\\tforeknowledge of the future and, in a wider sense, any\\n\\t\\t\\t\\tknowledge of \"that which is beyond the reach of human\\n\\t\\t\\t\\tperception\" (al-ghayb): cf.  6:50  or  7:188 ."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "10",
    "NoteID": "12",
    "Body": "I.e., a prophet like himself. The \"witness\" spoken of\\n\\t\\t\\t\\there is evidently Moses: cf. the two Biblical passages\\n\\t\\t\\t\\trelating to the advent of the Prophet Muhammad\\n\\t\\t\\t\\t(Deuteronomy xviii, 15 and 18): \"The Lord thy God will\\n\\t\\t\\t\\traise up unto thee a prophet from the midst of thee, of\\n\\t\\t\\t\\tthy brethren, like unto me\"; and \"I will raise them up a\\n\\t\\t\\t\\tprophet from among thy brethren, like unto thee, and will\\n\\t\\t\\t\\tput My words in his mouth.\" (See in this connection note\\n\\t\\t\\t\\t[33] on  2:42 .)"
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "11",
    "NoteID": "13",
    "Body": "Lit., \"towards it\". Almost all of the classical\\n\\t\\t\\t\\tcommentators assume that this refers specifically, to the\\n\\t\\t\\t\\tcontempt with which the pagan Quraysh looked down upon\\n\\t\\t\\t\\tthe early followers of Muhammad, most of whom came from\\n\\t\\t\\t\\tthe poorest, lowliest strata of Meccan society. However,\\n\\t\\t\\t\\tthe abouve \"saying\" has undoubtedly a timeless import\\n\\t\\t\\t\\tinasmuch as the poor and lowly have always been among the\\n\\t\\t\\t\\tfirst to follow a prophet. Moreover, it may also have a\\n\\t\\t\\t\\tbearing on our times as well, inasmuch as the materially\\n\\t\\t\\t\\tpowerful nations, whom their technological progress has\\n\\t\\t\\t\\tblinded to many spiritual verities, are increasingly\\n\\t\\t\\t\\tcontemptuous of the weakness of those civilizations in\\n\\t\\t\\t\\twhich religion still plays an important, albeit largely\\n\\t\\t\\t\\tformalistic, role; and so, not realizing that this very\\n\\t\\t\\t\\tformalism and the ensuing cultural sterility, and not\\n\\t\\t\\t\\treligious faith as such, is the innermost cause of that\\n\\t\\t\\t\\tweakness, they attribute it to the influence of religion\\n\\t\\t\\t\\tper se, saying as it were, \"If religion were any good, we\\n\\t\\t\\t\\twould have been the first in holding on to it\" - thus\\n\\t\\t\\t\\t\"justifying\" their own materialistic attitude and their\\n\\t\\t\\t\\trefusal to be guided by spiritual considerations."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "11",
    "NoteID": "14",
    "Body": "I.e., the concept of divine revelation as such, as is\\n\\t\\t\\t\\tevident from the subsequent reference to the revelation\\n\\t\\t\\t\\tof Moses."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "12",
    "NoteID": "15",
    "Body": "Sc., in its original, uncorrupted form."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "15",
    "NoteID": "16",
    "Body": "Cf.  29:8  and  31:14 . In the present instance, this\\n\\t\\t\\t\\tconnects with the reference to the \"doers of good\" at the\\n\\t\\t\\t\\tend of verse {12} and in verses {13-14}."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "15",
    "NoteID": "17",
    "Body": "See note [14] on  31:14 ."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "15",
    "NoteID": "18",
    "Body": "I.e., the age at which man is supposed to attain to full\\n\\t\\t\\t\\tintellectual and spiritual maturity. It is to be borne in\\n\\t\\t\\t\\tmind that the masculine noun insan (\"man\" or \"human\\n\\t\\t\\t\\tbeing\") appearing in the first sentence of this verse\\n\\t\\t\\t\\tapplies to both sexes alike."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "15",
    "NoteID": "19",
    "Body": "Sc.. \"of whatever sin I may have committed\". See note\\n\\t\\t\\t\\t[41] on the last sentence of  24:31 ."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "16",
    "NoteID": "20",
    "Body": "I.e., \"whom We shall reward in accordance with the best\\n\\t\\t\\t\\tthat they ever did\": cf.  29:7 ."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "17",
    "NoteID": "21",
    "Body": "Sc., \"without any indication that anyone has been or will\\n\\t\\t\\t\\tbe resurrected\". This parabolical \"dialogue\" is not only\\n\\t\\t\\t\\tmeant to illustrate the ever-recurring - and perhaps\\n\\t\\t\\t\\tnatural - conflict between older and younger generations,\\n\\t\\t\\t\\tbut also points to the transmission of religious ideas as\\n\\t\\t\\t\\tthe most important function of parenthood, and thus, in a\\n\\t\\t\\t\\twider sense, as the basic element of all social\\n\\t\\t\\t\\tcontinuity."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "18",
    "NoteID": "22",
    "Body": "See Appendix III."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "19",
    "NoteID": "23",
    "Body": "The particle li prefixed to the subsequent verb is\\n\\t\\t\\t\\tevidently what the  grammarians call a lam al-'aqibah:\\n\\t\\t\\t\\ti.e., not an indication of intent (\"so that\") but simply\\n\\t\\t\\t\\tof a causal sequence, which is best rendered as \"and\",\\n\\t\\t\\t\\t\"and so\", or \"hence\"."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "20",
    "NoteID": "24",
    "Body": "I.e., for having arrogantly, without any objective\\n\\t\\t\\t\\tjustification, asserted that there is no life after\\n\\t\\t\\t\\tdeath."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "21",
    "NoteID": "25",
    "Body": "I.e., the Prophet Hud (see surah {7}, note [48]). The\\n\\t\\t\\t\\tmention of Hud and the tribe of 'Ad connects with the\\n\\t\\t\\t\\tlast sentence of the preceding verse, inasmuch as this\\n\\t\\t\\t\\ttribe \"transgressed all bounds of equity all over their\\n\\t\\t\\t\\tlands\" ( 89:11 )."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "21",
    "NoteID": "26",
    "Body": "Lit., \"from between his hands and from behind him\". This\\n\\t\\t\\t\\tidiomatic phrase (explained in note [247] on  2:255 ) is\\n\\t\\t\\t\\tevidently an allusion to the many warning messages, in\\n\\t\\t\\t\\tHud's own time as well as in the almost forgotten past,\\n\\t\\t\\t\\twhich ought to have made - but did not make - the tribe\\n\\t\\t\\t\\tof 'Ad conscious of how far astray they had gone. We have\\n\\t\\t\\t\\there a subtle, parenthetic reminder that, apart from the\\n\\t\\t\\t\\trevelations which He bestows upon His prophets, God\\n\\t\\t\\t\\toffers His guidance to man through the many signs and\\n\\t\\t\\t\\twarnings apparent in all nature as well as in the\\n\\t\\t\\t\\tchanging conditions of human society."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "24",
    "NoteID": "27",
    "Body": "I.e., when they beheld, without recognizing it as such,\\n\\t\\t\\t\\tthe approach of their doom."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "25",
    "NoteID": "28",
    "Body": "Lit., \"then they became so that .. .\", etc. See {69:6-8},\\n\\t\\t\\t\\tdescribing the sandstorm which destroyed the tribe of 'Ad\\n\\t\\t\\t\\twithout leaving any trace of them."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "26",
    "NoteID": "29",
    "Body": "This relates in the first instance to the pagan\\n\\t\\t\\t\\tcontemporaries of the  Prophet, but applies to later\\n\\t\\t\\t\\tgenerations as well. - The tribe of 'Ad were the\\n\\t\\t\\t\\tunchallenged lords in the vast region in which they lived\\n\\t\\t\\t\\t(cf.  89:8  - \"the like of whom has never been reared in\\n\\t\\t\\t\\tall the land\"). Moreover, the social conditions of their\\n\\t\\t\\t\\ttime were so simple and so free of the many uncertainties\\n\\t\\t\\t\\tand dangers which beset people of higher civilizations\\n\\t\\t\\t\\tthat they could be regarded as more \"securely\\n\\t\\t\\t\\testablished\" on earth than people of later, more complex\\n\\t\\t\\t\\ttimes."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "26",
    "NoteID": "30",
    "Body": "I.e., intellect and feeling, both of which are comprised\\n\\t\\t\\t\\tin the noun fu'ad."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "26",
    "NoteID": "31",
    "Body": "Lit.. \"enfolded\"."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "27",
    "NoteID": "32",
    "Body": "I.e., \"close to you in space as well as in time\". In its\\n\\t\\t\\t\\twider sense, this phrase denotes \"all the rest of the\\n\\t\\t\\t\\tworld\"."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "28",
    "NoteID": "33",
    "Body": "This clause gives the meaning of the expression qurbanan,\\n\\t\\t\\t\\twhich contains an allusion not merely to false deities\\n\\t\\t\\t\\tbut also to the deification of saints,living or dead, who\\n\\t\\t\\t\\tallegedly act as mediators between man and the\\n\\t\\t\\t\\ttranscendental Supreme Being."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "28",
    "NoteID": "34",
    "Body": "Lit., \"that was their lie and all that they were wont to\\n\\t\\t\\t\\tinvent ."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "29",
    "NoteID": "35",
    "Body": "See surah {2}, note [21]. The connection between this\\n\\t\\t\\t\\tpassage and the preceding one apparently lies in the fact\\n\\t\\t\\t\\tthat whereas \"those who are lost in sin\" (of whom the\\n\\t\\t\\t\\ttribe of 'Ad is given as an example) refuse to heed God's\\n\\t\\t\\t\\tmessages, the \"unseen beings\" spoken of in the sequence\\n\\t\\t\\t\\timmediately perceived their truth and accepted them."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "29",
    "NoteID": "36",
    "Body": "The term nafar signifies a group of more than three and\\n\\t\\t\\t\\tup to ten persons. The occurrence mentioned in this\\n\\t\\t\\t\\tpassage - said to have taken place in the small oasis of\\n\\t\\t\\t\\tNakhlah, on the way leading from Mecca to Ta'if (Tabari)\\n\\t\\t\\t\\t- is evidently identical with that described in\\n\\t\\t\\t\\t{72:1-15}; for a tentative explanation, see note [1] on\\n\\t\\t\\t\\t 72:1 ."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "29",
    "NoteID": "37",
    "Body": "Lit., \"as soon as they attended to it\", i.e., to its\\n\\t\\t\\t\\trecitation by the Prophet."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "29",
    "NoteID": "38",
    "Body": "I.e., as preachers of the Qur'anic creed. The expression\\n\\t\\t\\t\\t\"as warners\" connects with the preceding references to\\n\\t\\t\\t\\t\"warning messages\"."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "30",
    "NoteID": "39",
    "Body": "For an explanation of this rendering of the phrase ma\\n\\t\\t\\t\\tbayna yadayhi, see surah {3}, note [3]. - As pointed out\\n\\t\\t\\t\\tin note [1] on  72:1 , this reference to the Qur'an as\\n\\t\\t\\t\\trevealed \"after Moses\", omitting any mention of Jesus,\\n\\t\\t\\t\\tseems to indicate that the speakers were followers of the\\n\\t\\t\\t\\tJewish faith; hence my interpolation of the words \"of the\\n\\t\\t\\t\\tTorah\"."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "32",
    "NoteID": "40",
    "Body": "See note [11] on  72:15 ."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "33",
    "NoteID": "41",
    "Body": "This is apparently an allusion to the Qur'anic doctrine\\n\\t\\t\\t\\tthat God's creative activity is continuous and unending."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "35",
    "NoteID": "42",
    "Body": "I.e., the reality of life after death."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "35",
    "NoteID": "43",
    "Body": "In this parabolic manner the Qur'an points to the\\n\\t\\t\\t\\tillusory concept of \"time\" as experienced by the human\\n\\t\\t\\t\\tmind - a concept which has no bearing on the ultimate\\n\\t\\t\\t\\treality to be unfolded in the hereafter."
  },
  {
    "SurahNumber": "46",
    "AyahNumber": "35",
    "NoteID": "44",
    "Body": "Cf. the last sentence of  6:47  and the corresponding\\n\\t\\t\\t\\tnote [37]."
  }
]
