[
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "1",
    "sectionHeading": "Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman heard Anas ibn Malik say, \"The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was not\\n\\t\\t\\t\\texcessively tall or short. He was not very pallid nor\\n\\t\\t\\t\\tdark. He did not have curly hair or lank hair. Allah\\n\\t\\t\\t\\tcommissioned him at the age of forty. He stayed in Makka\\n\\t\\t\\t\\tten years and at Madina for ten years and Allah the\\n\\t\\t\\t\\tMighty, the Majestic made him die when he was sixty.\\n\\t\\t\\t\\tThere were not twenty white hairs in his hair or beard,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "2",
    "sectionHeading": "Description of Isa ibn Maryam, Peace be upon Him and the Dajjal",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"I dreamt at night that I was\\n\\t\\t\\t\\tat the Kaba, and I saw a dark man like the most handsome\\n\\t\\t\\t\\tof dark men you have ever seen. He had hair reaching to\\n\\t\\t\\t\\tbetween his ears and his shoulders like the most\\n\\t\\t\\t\\texcellent of such hair that you have seen. He had combed\\n\\t\\t\\t\\this hair, and water was dripping from it. He was leaning\\n\\t\\t\\t\\ton two men or on the shoulders of two men doing tawaf\\n\\t\\t\\t\\taround Kaba. I asked, 'Who is this?' It was said,\\n\\t\\t\\t\\t'al-Masih ibn Maryam.' Then we were with a man with wiry\\n\\t\\t\\t\\thair and blind in his right eye, as if it was a floating\\n\\t\\t\\t\\tgrape. I asked 'Who is this?' It was said to me, 'This is\\n\\t\\t\\t\\tal-Masih ad-Dajjal.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "3",
    "sectionHeading": "Sunna of the Fitra",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Abi Said\\n\\t\\t\\t\\tal-Maqburi from his father that Abu Hurayra said, \"There\\n\\t\\t\\t\\tare five things from the fitra: cutting the nails,\\n\\t\\t\\t\\ttrimming the moustache, removing the hair from the\\n\\t\\t\\t\\tarmpit, shaving the pubic region and circumcision.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "4",
    "sectionHeading": "Sunna of the Fitra",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyub said, \"Ibrahim, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, was the first to give hospitality to\\n\\t\\t\\t\\tthe guest and the first person to be circumcised and the\\n\\t\\t\\t\\tfirst person to trim the moustache and the first person\\n\\t\\t\\t\\tto see grey hair. He said, 'O Lord! What is this?' Allah\\n\\t\\t\\t\\tthe Blessed, the Exalted, said, 'It is dignity, Ibrahim.'\\n\\t\\t\\t\\tHe said, 'Lord, increase me in dignity!' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say, \"One takes from\\n\\t\\t\\t\\tthe moustache until the edge of the lip appears, that is\\n\\t\\t\\t\\tthe rim. One does not cut if off completely so that one\\n\\t\\t\\t\\tmutilates oneself.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "5",
    "sectionHeading": "Prohibition against Eating with the Left Hand",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zubayr from\\n\\t\\t\\t\\tJabir ibn Abdullah as-Salami that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, forbade a man to\\n\\t\\t\\t\\teat with his left hand or walk in one sandal or wrap a\\n\\t\\t\\t\\tsingle garment around his drawn-up legs exposing his\\n\\t\\t\\t\\tgenitals.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "6",
    "sectionHeading": "Prohibition against Eating with the Left Hand",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tBakr ibn Ubaydullah ibn Abdullah ibn Umar from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"When you eat, eat with your\\n\\t\\t\\t\\tright hand and drink with your right hand. Shaytan eats\\n\\t\\t\\t\\twith his left hand and drinks with his left hand.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "7",
    "sectionHeading": "The Very Poor",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The very poor\\n\\t\\t\\t\\tare not the people who constantly walk from person to\\n\\t\\t\\t\\tperson and are given one or two morsels, and one or two\\n\\t\\t\\t\\tdates.\" They said, \"Who are the very poor, Messenger of\\n\\t\\t\\t\\tAllah?\" He said, \"People who do not find enough for\\n\\t\\t\\t\\tthemselves and other people are not aware of them to give\\n\\t\\t\\t\\tsadaqa to them, and they do not start begging from other\\n\\t\\t\\t\\tpeople.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "8",
    "sectionHeading": "The Very Poor",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tIbn Bujayd (formerly al-Ansari) from his grandmother that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Give to the very poor, if only a roasted\\n\\t\\t\\t\\thoof.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "9",
    "sectionHeading": "The Intestines of the Kafir ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj that Abu Hurayra said, \"The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, 'The\\n\\t\\t\\t\\tmuslim eats in one intestine, and the kafir eats in\\n\\t\\t\\t\\tseven!' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "10",
    "sectionHeading": "The Intestines of the Kafir ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Suhayl ibn Abi Salih\\n\\t\\t\\t\\tfrom his father from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, gave\\n\\t\\t\\t\\thospitality to a kafir guest. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, ordered a sheep to\\n\\t\\t\\t\\tbe brought for him and it was milked. He drank its milk.\\n\\t\\t\\t\\tThen another came, and he drank it. Then another came and\\n\\t\\t\\t\\the drank it until he had drunk the milk of seven sheep.\\n\\t\\t\\t\\tIn the morning he became muslim, and the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, ordered a\\n\\t\\t\\t\\tsheep for him. It was milked and he drank its milk. Then\\n\\t\\t\\t\\the ordered another for him and he could not finish it.\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"The mumin drinks in one intestine, and the\\n\\t\\t\\t\\tkafir drinks in seven intestines.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "11",
    "sectionHeading": "Prohibition against Drinking from Silver Vessels and Blowing into Drinks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Zayd ibn\\n\\t\\t\\t\\tAbdullah ibn Umar ibn al-Khattab from Abdullah ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Abi Bakras-Siddiq from Umm Salama, the wife\\n\\t\\t\\t\\tof the Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"A person who drinks from a silver\\n\\t\\t\\t\\tvessel brings the fire of Jahannam into his belly.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "12",
    "sectionHeading": "Prohibition against Drinking from Silver Vessels and Blowing into Drinks",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Habib, the\\n\\t\\t\\t\\tmawla of Sad ibn Abi Waqqas that Abu'l-Muthanna al-Juhani\\n\\t\\t\\t\\tsaid, \"I was with Marwan ibn al-Hakam and Abu Said\\n\\t\\t\\t\\tal-Khudri came to him. Marwan ibn al-Hakam said to him,\\n\\t\\t\\t\\t'Have you heard that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade blowing into\\n\\t\\t\\t\\tdrinks?' Abu Said said to him, 'Yes.' A man said to him,\\n\\t\\t\\t\\t'Messenger of Allah, I am not quenched from one breath.'\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said to him, 'Remove the cup from your mouth and\\n\\t\\t\\t\\tthen breathe.' He said, 'Sometimes I see something\\n\\t\\t\\t\\tfloating in it?' He said, 'Then pour it out.'\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "13",
    "sectionHeading": "Drinking while Standing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab and Ali ibn Abi Talib and Uthman ibn\\n\\t\\t\\t\\tAffan drank while standing.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "14",
    "sectionHeading": "Drinking while Standing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tA'isha, umm al-muminin and Sad ibn Abi Waqqas did not see\\n\\t\\t\\t\\tany harm in a man drinking while standing.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "15",
    "sectionHeading": "Drinking while Standing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu Jafar al-Qari\\n\\t\\t\\t\\tsaid, \"I saw Abdullah ibn Umar drink while standing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "16",
    "sectionHeading": "Drinking while Standing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Amir ibn Abdullah ibn\\n\\t\\t\\t\\taz-Zubayr that his father used to drink while standing.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "17",
    "sectionHeading": "The Sunna about Drinking and Passing to the Right",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Anas\\n\\t\\t\\t\\tibn Malik that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was brought some milk which was\\n\\t\\t\\t\\tmixed with well-water. There was a Bedouin at his right\\n\\t\\t\\t\\tside and Abu Bakr as-Siddiq on his left. He drank and\\n\\t\\t\\t\\tthen gave it to the Bedouin and said, \"The right-hand to\\n\\t\\t\\t\\tthe right-hand.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "18",
    "sectionHeading": "The Sunna about Drinking and Passing to the Right",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Hazim ibn Dinar\\n\\t\\t\\t\\tfrom Sahl ibn Sad al-Ansari that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, was brought a\\n\\t\\t\\t\\tdrink and he drank some of it. There was a boy at his\\n\\t\\t\\t\\tright and some old men on his left. He said to the boy,\\n\\t\\t\\t\\t\"Will you give me permission to give it to these people?\"\\n\\t\\t\\t\\tThe boy said, \"No, Messenger of Allah, I will not prefer\\n\\t\\t\\t\\tanyone to get my portion from you.\" He said, \"So the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, placed it in his hand.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "19",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha heard Anas ibn Malik say that Abu Talha had\\n\\t\\t\\t\\tsaid to Umm Sulaym, \"I have just been listening to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and his voice was very weak. I recognised hunger\\n\\t\\t\\t\\tin it, so, do you have anything?\" She replied, \"Yes,\" and\\n\\t\\t\\t\\tbrought out some barley loaves. She took her long head\\n\\t\\t\\t\\tscarf and wrapped up the bread with part of it and put it\\n\\t\\t\\t\\tinto my (Anas's) hand and gave me part of it to wear.\\n\\t\\t\\t\\tThen she sent me to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAnas continued, \"I took it, and I found the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, sitting\\n\\t\\t\\t\\tin the mosque with some people. I watched them. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'Did Abu Talha send you?' I replied, 'Yes.'\\n\\t\\t\\t\\tHe said, 'For food?' I said, 'Yes.' The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\tthose with him, 'Let us go.' He set off and I went among\\n\\t\\t\\t\\tthem until I came to Abu Talha and told him. Abu Talha\\n\\t\\t\\t\\tsaid, +Umm Sulaym! The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, has brought people and we\\n\\t\\t\\t\\thave no food. What shall we give them to eat?' She said,\\n\\t\\t\\t\\t'Allah and His Messenger know best.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAnas continued, \"Abu Talha went out and met the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, and\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, approached with Abu Talha until they entered. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'Come now, Umm Sulaym, what have you got?'\\n\\t\\t\\t\\tShe brought out bread. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, ordered it to be broken\\n\\t\\t\\t\\tinto pieces, and Umm Sulaym squeezed out onto it a\\n\\t\\t\\t\\tcontainer of clarified butter which she had seasoned.\\n\\t\\t\\t\\tThen the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said whatever Allah wished him to say,\\n\\t\\t\\t\\tand said, 'Will you give permission for ten of them to\\n\\t\\t\\t\\tcome in?' He gave them permission, and they ate until\\n\\t\\t\\t\\tthey were full and then left. He said, 'Give permission\\n\\t\\t\\t\\tto ten more.' He gave them permission, and they ate until\\n\\t\\t\\t\\tthey were full and left. Then he said, 'Give permission\\n\\t\\t\\t\\tto ten more.' He gave them permission and they ate until\\n\\t\\t\\t\\tthey were full and left. Then he said, 'Give permission\\n\\t\\t\\t\\tto ten more.' He gave permission and they ate until they\\n\\t\\t\\t\\twere full and left. There were seventy or eighty men.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "20",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The food of\\n\\t\\t\\t\\ttwo is enough for three, and the food of three is enough\\n\\t\\t\\t\\tfor four.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "21",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zubayr al-Makki\\n\\t\\t\\t\\tfrom Jabir ibn Abdullah that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Lock the\\n\\t\\t\\t\\tdoor, tie the waterskin, turn the vessel over or cover\\n\\t\\t\\t\\tit, and put out the lamp. Shaytan does not open a locked\\n\\t\\t\\t\\tdoor or untie a tied knot, or uncover a vessel. A mouse\\n\\t\\t\\t\\tmay set fire to people's houses about them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "22",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Abi Said\\n\\t\\t\\t\\tal-Maqburi from Abu Shurayh al-Kabi that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Whoever believes in Allah and the Last Day should speak\\n\\t\\t\\t\\tgood or be silent. Whoever believes in Allah and the Last\\n\\t\\t\\t\\tDay should be generous to his neighbour. Whoever believes\\n\\t\\t\\t\\tin Allah and the Last Day, should be generous to his\\n\\t\\t\\t\\tguest. His welcome is for a day and a night, and his\\n\\t\\t\\t\\thospitality is for three days. Whatever is more than that\\n\\t\\t\\t\\tis sadaqa. It is not halal for a guest to stay with a man\\n\\t\\t\\t\\tuntil he becomes a burden.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "23",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr from Abu Salih as-Samman from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"A man was walking on a road when he became\\n\\t\\t\\t\\tvery thirsty. He found a well and went into it and drank\\n\\t\\t\\t\\tand came out. There was a dog panting and eating earth\\n\\t\\t\\t\\tout of thirst. The man said, 'This dog has become as\\n\\t\\t\\t\\tthirsty as I was.' He went down into the well and filled\\n\\t\\t\\t\\this shoe and then held it in his mouth until he climbed\\n\\t\\t\\t\\tout and gave the dog water to drink. Allah thanked him\\n\\t\\t\\t\\tfor it and forgave him.\" They said, \"Messenger of Allah,\\n\\t\\t\\t\\tdo we have a reward for taking care of beasts?\" He said,\\n\\t\\t\\t\\t\"There is a reward for every one with a moist liver.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "24",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Wahb ibn Kaysan that\\n\\t\\t\\t\\tJabir ibn Abdullah said, \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, sent a delegation to\\n\\t\\t\\t\\tthe coast. Abu Ubayda ibn al-Jarrah was in command of\\n\\t\\t\\t\\tthem. There were 300 people and I was among them. We went\\n\\t\\t\\t\\tout until we had gone part of the way and our provisions\\n\\t\\t\\t\\twere finished. Abu Ubayda ordered that the provisions of\\n\\t\\t\\t\\tthe army be gathered up and they amounted to two\\n\\t\\t\\t\\tcontainers of dates. He used to give us a little\\n\\t\\t\\t\\tprovision from it each day until it was finished, and we\\n\\t\\t\\t\\tused to have only a single date each. I said, 'What use\\n\\t\\t\\t\\tis one date?' He said, 'We will certainly feel its loss\\n\\t\\t\\t\\twhen they are finished.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tJabir continued, \"Then we reached the sea and there was a\\n\\t\\t\\t\\tfish like a small mountain. The army ate from it for\\n\\t\\t\\t\\teighteen nights. Then Abu Ubayda ordered two ribs from it\\n\\t\\t\\t\\tto be set up. Then he commanded that a camel be ridden\\n\\t\\t\\t\\tunderneath them and it did not touch them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "25",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAmr ibn Sad ibn Muadh from his grandmother that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"O trusting women, none of you must consider\\n\\t\\t\\t\\teven a roasted sheep's trotter too small to give to her\\n\\t\\t\\t\\tneighbour.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "26",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tsaid, \"The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, 'May Allah curse the jews! They\\n\\t\\t\\t\\twere forbidden to eat fat, so they sold it and ate its\\n\\t\\t\\t\\tprice.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "27",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Isa\\n\\t\\t\\t\\tibn Maryam used to say, \"O Banu Israil! You must drink\\n\\t\\t\\t\\tpure water and the green things of the land and barley\\n\\t\\t\\t\\tbread . Beware of wheat bread, for you will not be\\n\\t\\t\\t\\tgrateful enough for it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "28",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, entered the mosque and found Abu Bakr as-Siddiq\\n\\t\\t\\t\\tand Umar ibn al-Khattab there. He questioned them and\\n\\t\\t\\t\\tthey said, \"Hunger has driven us out.\" The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"And hunger has brought me out.\" They went to\\n\\t\\t\\t\\tAbu'l-Haytham ibn at-Tayyihan al-Ansari. He ordered that\\n\\t\\t\\t\\tsome barley that was in the house be prepared and he got\\n\\t\\t\\t\\tup to slaughter a sheep for them. The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"Leave the\\n\\t\\t\\t\\tone with milk.\" He slaughtered a sheep for them and\\n\\t\\t\\t\\tbrought them sweet water and it was hung on a palm-tree.\\n\\t\\t\\t\\tThen they were brought the food and ate it and drank the\\n\\t\\t\\t\\twater. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, recited, \"Then, on that day, you will be\\n\\t\\t\\t\\tasked concerning pleasure.\" (Sura 102 ayat 8).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "29",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tUmar ibn al-Khattab was eating bread with ghee. He\\n\\t\\t\\t\\tsummoned one of the desert people and he began to eat and\\n\\t\\t\\t\\tfollow the grease in the dish with a morsel of bread.\\n\\t\\t\\t\\tUmar said, \"It is as if you were poor.\" He said, \"By\\n\\t\\t\\t\\tAllah. I have not eaten ghee nor have I seen food with it\\n\\t\\t\\t\\tsince such-and-such a time.\" Umar declared, \"I shall not\\n\\t\\t\\t\\teat clarified butter until people are given life again\\n\\t\\t\\t\\tlike they were first given life,\" (i.e. on the Day of\\n\\t\\t\\t\\tRising.)\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "30",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha that Anas ibn Malik said, \"I saw Umar ibn\\n\\t\\t\\t\\tal-Khattab when he was amir al-muminin being given a sa\\n\\t\\t\\t\\tof dates, and he ate all of them, even the inferior\\n\\t\\t\\t\\tones.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tthat Abdullah ibn Umar said, ''Umar ibn al-Khattab was\\n\\t\\t\\t\\tasked about locusts. He said, 'I would like to have a\\n\\t\\t\\t\\tbasket of them, from which we could eat.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "31",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Amr ibn\\n\\t\\t\\t\\tHalhala that Humayd ibn Malik ibn Khu'haym said, \"I was\\n\\t\\t\\t\\tsitting with Abu Hurayra on his land at al-Aqiq. Some\\n\\t\\t\\t\\tpeople rode out from Madina to call upon Abu Hurayra. He\\n\\t\\t\\t\\ttold me to go to his mother, sending his greetings and\\n\\t\\t\\t\\tasking her to prepare some food.\" Humayd continued, \"She\\n\\t\\t\\t\\tset down three loaves on a plate and some oil and salt.\\n\\t\\t\\t\\tThen she put it on my head and I carried it to them. When\\n\\t\\t\\t\\tI set it before them, Abu Hurayra said, 'Allah is\\n\\t\\t\\t\\tgreater' and added, 'Praise be to Allah who has filled us\\n\\t\\t\\t\\twith bread after our food had previously been only water\\n\\t\\t\\t\\tand dates,' as the people did not touch any of the food.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWhen they left, he said, 'O son of my brother, be good to\\n\\t\\t\\t\\tyour sheep and wipe the mucus from them and clean their\\n\\t\\t\\t\\tpen. Pray in their quarter for they are among the animals\\n\\t\\t\\t\\tof the Garden. By He in Whose Hand my self is, a time is\\n\\t\\t\\t\\tabout to come upon people when a small group of sheep\\n\\t\\t\\t\\twill be more beloved to their owner than the house of\\n\\t\\t\\t\\tMarwan . ' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "32",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Nuaym that Wahb\\n\\t\\t\\t\\tibn Kaysan said, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was brought food while his\\n\\t\\t\\t\\tstepson Umar ibn Salama was with him. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\thim, 'Say \"Bismillah,\" and eat what is in front of you.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "33",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat he had heard al-Qasim ibn Muhammad say that a man\\n\\t\\t\\t\\tcame to Abdullah ibn Abbas and said to him, \"I have an\\n\\t\\t\\t\\torphan and he has camels. Can I drink from the camels'\\n\\t\\t\\t\\tmilk?\" Ibn Abbas said, \"If you search for the lost camels\\n\\t\\t\\t\\tof his and treat the camels' mange and fill in the cracks\\n\\t\\t\\t\\tin their water basin and give it water on the day it\\n\\t\\t\\t\\tdrinks, then drink it without doing harm to the suckling\\n\\t\\t\\t\\tcamels by milking them excessively.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "34",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father never brought food or drink, nor even a remedy\\n\\t\\t\\t\\twhich he ate or drank but that he said, \"Praise be to\\n\\t\\t\\t\\tAllah who has guided us and fed us and given us to drink\\n\\t\\t\\t\\tand blessed us. Allah is greater. O Allah! We have found\\n\\t\\t\\t\\tYour blessing with every evil, give us every good in the\\n\\t\\t\\t\\tmorning and evening. We ask You for its completion and\\n\\t\\t\\t\\tits gratitude. There is no good except Your good. There\\n\\t\\t\\t\\tis no god other than You, the God of the salihun and the\\n\\t\\t\\t\\tLord of the Worlds. Praise be to Allah. There is no god\\n\\t\\t\\t\\tbut Allah. What Allah wills. There is no power except in\\n\\t\\t\\t\\tAllah. O Allah! Bless us in what You have provided us\\n\\t\\t\\t\\twith and protect us from the punishment of the Fire!\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAl-hamdu lillahi-lladhi hadana wa at amana wa saqana wa\\n\\t\\t\\t\\tnaamana. Allahu akbar. Allahumma'l fatna nimatik bi-kulli\\n\\t\\t\\t\\tsharr. Fa asbahna minha wa amsayna bi-kulli khayr.\\n\\t\\t\\t\\tNasaluka tamamaha wa shukraha. La khayr illa khayruk. Wa\\n\\t\\t\\t\\tla ilaha ghayruk. Ilaha'-saliheen wa rabba'l-alameen.\\n\\t\\t\\t\\tAl-hamdu lillah. Wa la ilaha illa'llah. Ma sha'Allah. Wa\\n\\t\\t\\t\\tla quwwata illa billah. Allahumma barik lana fima\\n\\t\\t\\t\\trazaqtana. Waqina adhaba'n-nar.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "35",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik was asked, \"Can a woman eat with\\n\\t\\t\\t\\tother than her relative or slave?\" Malik said, \"There is\\n\\t\\t\\t\\tno harm in that if it is in a manner which is accepted\\n\\t\\t\\t\\tfor a woman to eat with men.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A woman sometimes eats with her husband and\\n\\t\\t\\t\\twith others he dines with or with her brother in the same\\n\\t\\t\\t\\tway. It is disapproved of for a woman to be alone with a\\n\\t\\t\\t\\tman when there is no relationship between them by blood,\\n\\t\\t\\t\\tmarriage or suckling that would prevent him marrying\\n\\t\\t\\t\\ther.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "36",
    "sectionHeading": "General Section on Food and Drink",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tUmar ibn al-Khattab said, \"Beware of meat. It has\\n\\t\\t\\t\\taddictiveness like the addictiveness of wine.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tUmar ibn al-Khattab saw Jabir ibn Abdullah carrying some\\n\\t\\t\\t\\tmeat. He said, \"What is this?\" He said, \"Amir al-muminin.\\n\\t\\t\\t\\tWe desired meat and I bought some meat for a dirham.\"\\n\\t\\t\\t\\tUmar said, \"Does one of you want to fill his belly apart\\n\\t\\t\\t\\tfrom his neighbour or nephew? How can you overlook this\\n\\t\\t\\t\\tayat? 'You squandered your good things in the life of\\n\\t\\t\\t\\tthis world and sought comfort in them.' \" (Sura 46 ayat\\n\\t\\t\\t\\t20).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "37",
    "sectionHeading": "Wearing Rings",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom 'Abdullah ibn 'Umar that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, used to wear a gold\\n\\t\\t\\t\\tring. Then the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, stood up and threw it away and said,\\n\\t\\t\\t\\t\"I will never wear it.\" He said, \"So the people threw\\n\\t\\t\\t\\taway their rings.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "38",
    "sectionHeading": "Wearing Rings",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Sadaqa ibn Yasar\\n\\t\\t\\t\\tsaid, \"I asked Said ibn al-Musayyab about wearing a ring.\\n\\t\\t\\t\\tHe said, 'Wear it, and tell people that I gave you that\\n\\t\\t\\t\\tdecision.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "49",
    "hadithNumber": "39",
    "sectionHeading": "Pulling off Necklaces and Bells from the Necks of Camels",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tfrom Abbad ibn Tamim that Abu Bashir al-Ansari told him\\n\\t\\t\\t\\tthat he was with the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, on one of his journeys. He\\n\\t\\t\\t\\trelated, \"The Messenger of Allah,  may Allah bless him\\n\\t\\t\\t\\tand grant him peace, sent a messenger.\" (Abdullah ibn Abi\\n\\t\\t\\t\\tBakr said, (I think that he said it was while the people\\n\\t\\t\\t\\twere in their resting place.) He said, \"Do not let a\\n\\t\\t\\t\\tsingle-string necklace, or any necklace, remain unbroken\\n\\t\\t\\t\\ton the neck of a camel.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"I heard Malik say, 'I think that was because\\n\\t\\t\\t\\tof the evil eye.' ''\\n\\t\\t\\t</p>"
  }
]
