[
  {
    "SurahNumber": "103",
    "AyahNumber": "1",
    "NoteID": "6262",
    "Body": "Al-Asr may mean: (1) Time through the Ages, or long\\n\\t\\t\\t\\tperiods, in which case it comes near to the abstract idea\\n\\t\\t\\t\\tof Time, Dahr; (2) or the late afternoon, from which the\\n\\t\\t\\t\\tAsr canonical prayer takes its name (see n. 271 to ii:\\n\\t\\t\\t\\t238). An appeal is made to Time as one of the creations\\n\\t\\t\\t\\tof Allah, of which everyone knows something but of which\\n\\t\\t\\t\\tno one can fully explain the exact significance. Time\\n\\t\\t\\t\\tsearches out and destroys everything material. No one in\\n\\t\\t\\t\\tsecular literature has expressed the tyranny of\\n\\t\\t\\t\\t\"never-resting Time\" better than Shakespeare in his\\n\\t\\t\\t\\tSonnets. For example, see Sonnets 5 (\"never-resting\\n\\t\\t\\t\\tTime\"), 12 (\"Nothing gainst Time's scythe can make\\n\\t\\t\\t\\tdefence\"), and 64 (\"When I have seen by Time's fell hand\\n\\t\\t\\t\\tdefaced The rich proud cost of outworn buried age\"). If\\n\\t\\t\\t\\twe merely run a race against Time, we shall lose. It is\\n\\t\\t\\t\\tthe spiritual part of us that conquers Time. See verse 3\\n\\t\\t\\t\\tbelow. For the \"afternoon\" idea see next note."
  },
  {
    "SurahNumber": "103",
    "AyahNumber": "2",
    "NoteID": "6263",
    "Body": "If life be considered under the metaphor of a business\\n\\t\\t\\t\\tbargain, man, by merely attending to his material gains,\\n\\t\\t\\t\\twill lose. When he makes up his day's account in the\\n\\t\\t\\t\\tafternoon, it will show a loss. It will only show profit\\n\\t\\t\\t\\tif he has Faith, leads a good life, and contributes to\\n\\t\\t\\t\\tsocial welfare by directing and encouraging other people\\n\\t\\t\\t\\ton the Path of Truth and Constancy."
  },
  {
    "SurahNumber": "103",
    "AyahNumber": "3",
    "NoteID": "6264",
    "Body": "Faith is his armour, which wards off the wounds of the\\n\\t\\t\\t\\tmaterial world; and his righteous life is his positive\\n\\t\\t\\t\\tcontribution to spiritual ascent."
  },
  {
    "SurahNumber": "103",
    "AyahNumber": "3",
    "NoteID": "6265",
    "Body": "If he lived only for himself, he would not fulfil his\\n\\t\\t\\t\\twhole duty. Whatever good he has, especially in moral and\\n\\t\\t\\t\\tspiritual life, he must spread among his brethren, so\\n\\t\\t\\t\\tthat they may see the Truth and stand by it in patient\\n\\t\\t\\t\\thope and unshaken constancy amidst all the storm and\\n\\t\\t\\t\\tstress of outer life. For he and they will then have\\n\\t\\t\\t\\tattained Peace within."
  }
]
