[
  {
    "SurahNumber": "60",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Lit., \"and your enemies\" - implying that people who\\n\\t\\t\\t\\tdeliberately reject God's messages are ipso facto\\n\\t\\t\\t\\tinimical to those who believe in them."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "Historically, this is a reference to the forced\\n\\t\\t\\t\\temigration of the Prophet and his followers from Mecca to\\n\\t\\t\\t\\tMedina. In a more general sense, however, it is an\\n\\t\\t\\t\\tallusion to the potential persecution of believers of all\\n\\t\\t\\t\\ttimes by \"those who are bent on denying the truth\", i.e.,\\n\\t\\t\\t\\tthose who are averse to religious beliefs as such."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "1",
    "NoteID": "3",
    "Body": "As is shown in verses {7-9}, this prohibition of taking\\n\\t\\t\\t\\tunbelievers for friends relates only to such of them as\\n\\t\\t\\t\\tare actively hostile towards the believers (cf.  58:22 \\n\\t\\t\\t\\tand the corresponding note [29])."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "Since the adverb abadan is immediately followed by the\\n\\t\\t\\t\\tparticle hatta (\"until such a time as...\"), it is\\n\\t\\t\\t\\tobviously erroneous to give it the meaning of \"forever\",\\n\\t\\t\\t\\tas has been hitherto done in all translations of the\\n\\t\\t\\t\\tQur'an into Western languages. In view of the original\\n\\t\\t\\t\\tconnotation of the noun abad as \"time\" or \"long time\",\\n\\t\\t\\t\\ti.e., of indefinite duration (Jawhari, Zamakhshari's\\n\\t\\t\\t\\tAsas, Mughni, etc.), abadan is best rendered in the\\n\\t\\t\\t\\tpresent context as \"to last [until]...\", etc."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "Lit., \"Except for\": i.e., an exception from Abraham's\\n\\t\\t\\t\\tstatement, \"between us and you there has arisen enmity\\n\\t\\t\\t\\tand hatred, to last...\", etc. In other words, his filial\\n\\t\\t\\t\\tlove prevented Abraham from including his father in his\\n\\t\\t\\t\\tdeclaration of \"enmity and hatred\", although later -\\n\\t\\t\\t\\tafter his father had died as an idolater - Abraham could\\n\\t\\t\\t\\tnot but disavow him (cf.  9:114 )."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "4",
    "NoteID": "6",
    "Body": "Cf. {19:47-48}."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "5",
    "NoteID": "7",
    "Body": "Lit., \"temptation to evil\" (fitnah): cf.  10:85 , where\\n\\t\\t\\t\\tthe term fitnah has the same meaning as in the present\\n\\t\\t\\t\\tinstance."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "6",
    "NoteID": "8",
    "Body": "As in the similar phrase in  33:21 , this double\\n\\t\\t\\t\\tconnotation is implied in the verb rajawa and all the\\n\\t\\t\\t\\tnoun-forms derived from it."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "8",
    "NoteID": "9",
    "Body": "The expression \"God does not forbid you\" implies in this\\n\\t\\t\\t\\tcontext a positive exhortation (Zamakhshari). See also\\n\\t\\t\\t\\tnote [29] on  58:22 ."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "10",
    "Body": "Lit., \"as emigrants\" (muhajirat). For an explanation of\\n\\t\\t\\t\\tmy rendering this term as above, see surah {2}, note\\n\\t\\t\\t\\t[203]."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "11",
    "Body": "Under the terms of the Truce of Hudaybiyyah, concluded in\\n\\t\\t\\t\\tthe year 6 H. between the Prophet and the pagan Quraysh\\n\\t\\t\\t\\tof Mecca, any Meccan minor or other person under\\n\\t\\t\\t\\tguardianship who went over to the Muslims without the\\n\\t\\t\\t\\tpermission of his or her guardian was to be returned to\\n\\t\\t\\t\\tthe Quraysh (see introductory note to surah {48}). The\\n\\t\\t\\t\\tQuraysh took this stipulation to include also married\\n\\t\\t\\t\\twomen, whom they considered to be under the\\n\\t\\t\\t\\t\"guardianship\" of their husbands. Accordingly, when\\n\\t\\t\\t\\tseveral Meccan women embraced Islam against the will of\\n\\t\\t\\t\\ttheir husbands and fled to Medina, the Quraysh demanded\\n\\t\\t\\t\\ttheir forcible return to Mecca. This the Prophet refused\\n\\t\\t\\t\\ton the grounds that married women did not fall within the\\n\\t\\t\\t\\tcategory of \"persons under guardianship\". However, since\\n\\t\\t\\t\\tthere was always the possibility that some of these women\\n\\t\\t\\t\\thad gone over to the Muslims not for reasons of faith but\\n\\t\\t\\t\\tout of purely worldly considerations, the believers were\\n\\t\\t\\t\\tenjoined to make sure of their sincerity; and so, the\\n\\t\\t\\t\\tProphet asked each of them: \"Swear before God that thou\\n\\t\\t\\t\\tdidst not leave because of hatred of thy husband, or out\\n\\t\\t\\t\\tof a desire to go to another country, or in the hope of\\n\\t\\t\\t\\tattaining to worldly advantages: swear before God that\\n\\t\\t\\t\\tthou didst not leave for any reason save the love of God\\n\\t\\t\\t\\tand His Apostle\" (Tabari). Since God alone knows what is\\n\\t\\t\\t\\tin the heart of a human being, a positive response of the\\n\\t\\t\\t\\twoman concerned was to be regarded as the only humanly\\n\\t\\t\\t\\tattainable - and, therefore, legally sufficient - proof\\n\\t\\t\\t\\tof her sincerity. The fact that God alone is really aware\\n\\t\\t\\t\\tof what is in a human being's heart is incorporated in\\n\\t\\t\\t\\tthe shar'i principle that any adult person's declaration\\n\\t\\t\\t\\tof faith, in the absence of any evidence to the contrary,\\n\\t\\t\\t\\tmakes it mandatory upon the community to accept that\\n\\t\\t\\t\\tperson - whether man or woman - as a Muslim on the basis\\n\\t\\t\\t\\tof this declaration alone."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "12",
    "Body": "Lit., \"to them\". Thus, if a wife embraces Islam while her\\n\\t\\t\\t\\thusband remains outside its pale, the marriage is\\n\\t\\t\\t\\tconsidered, from the Islamic point of view, to have been\\n\\t\\t\\t\\tautomatically annulled."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "13",
    "Body": "Such an annulment is to be subject to the same conditions\\n\\t\\t\\t\\tas a khul' (dissolution of marriage, at the wife's\\n\\t\\t\\t\\tinstance, from her Muslim husband - see note [218] on the\\n\\t\\t\\t\\tsecond paragraph of  2:229 ): that is to say, since the\\n\\t\\t\\t\\tnon-Muslim former husband is presumed to have been\\n\\t\\t\\t\\tinnocent of any breach of his marital obligations as\\n\\t\\t\\t\\tsuch, the wife is to be considered the contract-breaking\\n\\t\\t\\t\\tparty and has, therefore, to refund the dower (mahr)\\n\\t\\t\\t\\twhich she received from him at the time of concluding the\\n\\t\\t\\t\\tmarriage. In case of her inability to do so, the Muslim\\n\\t\\t\\t\\tcommunity is obliged to indemnify the erstwhile husband:\\n\\t\\t\\t\\thence the plural form in the imperative \"you shall\\n\\t\\t\\t\\treturn\" (lit., \"give\")."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "14",
    "Body": "I.e., such of the pagan wives of Muslim converts as\\n\\t\\t\\t\\trefuse to abandon their beliefs and their non-Muslim\\n\\t\\t\\t\\tenvironment, in which case the Muslim husband is to\\n\\t\\t\\t\\tregard the marriage as null and void. As for Muslim wives\\n\\t\\t\\t\\twho, abandoning their husbands, go over to the\\n\\t\\t\\t\\tunbelievers and renounce their faith, see verse {11}."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "15",
    "Body": "Lit., \"and let them demand...\", etc."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "11",
    "NoteID": "16",
    "Body": "Lit., \"and you are thus taking your turn\", i.e., like the\\n\\t\\t\\t\\tunbelievers whose wives have gone over to the Muslims and\\n\\t\\t\\t\\trenounced their erstwhile faith."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "11",
    "NoteID": "17",
    "Body": "Since, as a rule, the unbelievers cannot really be\\n\\t\\t\\t\\texpected to indemnify a husband thus deserted, the Muslim\\n\\t\\t\\t\\tcommunity as a whole is bound to undertake this\\n\\t\\t\\t\\tobligation. As a matter of fact, there were only six such\\n\\t\\t\\t\\tcases of apostasy in the lifetime of the Prophet (all of\\n\\t\\t\\t\\tthem before the conquest of Mecca in 8 H.); and in each\\n\\t\\t\\t\\tcase the Muslim husband was awarded by the communal\\n\\t\\t\\t\\ttreasury, on orders of the Prophet, the equivalent of the\\n\\t\\t\\t\\tdower originally paid by him (Baghawi and Zamakhshari)."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "12",
    "NoteID": "18",
    "Body": "This connects with verse {10} above, and particularly\\n\\t\\t\\t\\twith the words, \"examine them...and if you have thus\\n\\t\\t\\t\\tascertained that they are believers...\", etc. (see note\\n\\t\\t\\t\\t[11]). Thus, after having \"ascertained\" their belief as\\n\\t\\t\\t\\tfar as is humanly possible, the Prophet - or, in later\\n\\t\\t\\t\\ttimes, the head of the Islamic state or community - is\\n\\t\\t\\t\\tempowered to accept their pledge of allegiance (bay'ah),\\n\\t\\t\\t\\twhich concludes, as it were, the \"examination\". It should\\n\\t\\t\\t\\tbe noted that this pledge does not differ essentially\\n\\t\\t\\t\\tfrom that of a male convert."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "12",
    "NoteID": "19",
    "Body": "In this context, according to Razi, the term \"stealing\"\\n\\t\\t\\t\\tcomprises also all acquisition of gains through cheating\\n\\t\\t\\t\\tor other unlawful means."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "12",
    "NoteID": "20",
    "Body": "Sc., \"as the pagan Arabs often did, burying their\\n\\t\\t\\t\\tunwanted female offspring alive\" (see also note [147] on\\n\\t\\t\\t\\t 6:151 )."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "12",
    "NoteID": "21",
    "Body": "Lit., \"between their hands and their feet\": i.e., by\\n\\t\\t\\t\\ttheir own effort, the \"hands\" and \"feet\" symbolizing all\\n\\t\\t\\t\\thuman activity."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "13",
    "NoteID": "22",
    "Body": "Cf.  58:14  and the corresponding note [25], which\\n\\t\\t\\t\\texplains the reference to those \"who would be friends\\n\\t\\t\\t\\twith people whom God has condemned\"."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "13",
    "NoteID": "23",
    "Body": "I.e., only people without any real belief in a life to\\n\\t\\t\\t\\tcome can remain \"neutral\" between right and wrong."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "13",
    "NoteID": "24",
    "Body": "I.e., because they utterly reject the idea of\\n\\t\\t\\t\\tresurrection."
  }
]
