[
  {
    "SurahNumber": "64",
    "AyahNumber": "1",
    "Text": "All that is in the heavens and the earth glorifies Allah. To Him\\n\\t\\t\\tbelongs the kingdom and to Him is due all praise, He has power\\n\\t\\t\\tover all things."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "2",
    "Text": "It is He Who has created you; yet some of you are unbelievers and\\n\\t\\t\\tsome are believers. Allah is observant of all your actions."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "3",
    "Text": "He created the heavens and the earth to manifest the truth. He\\n\\t\\t\\tshaped you and shaped you well, and to Him you shall all return."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "4",
    "Text": "He knows all that is in the heavens and the earth. He knows what\\n\\t\\t\\tyou conceal and what you reveal, and Allah knows what is in your\\n\\t\\t\\tbreast."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "5",
    "Text": "Have you not heard of those who disbelieved before you? So they\\n\\t\\t\\ttasted the evil result of their deeds, and in the Hereafter there\\n\\t\\t\\tshall be a painful punishment for them."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "6",
    "Text": "That is because, when their Rasools came to them with clear\\n\\t\\t\\trevelations, they said: \"Are human beings going to guide us?\" So\\n\\t\\t\\tthey disbelieved and paid no heed. Allah has no need of such\\n\\t\\t\\tpeople. Allah is free of all needs, worthy of all praise."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "7",
    "Text": "The unbelievers claim that they shall not be raised to life\\n\\t\\t\\tagain. Tell them: \"Indeed, by my Rabb, you shall surely be raised\\n\\t\\t\\tto life again! Then you shall be told of all that you have done,\\n\\t\\t\\tand that is easy for Allah.\""
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "8",
    "Text": "Therefore, believe in Allah and His Rasool, and in the Light\\n\\t\\t\\twhich We have revealed. Allah is well aware of all your actions."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "9",
    "Text": "The Day when He will gather you all; will be the Day of Assembly,\\n\\t\\t\\twhich shall be the Day of mutual loss and gain among the people.\\n\\t\\t\\tThose who believe in Allah and do good deeds, He will remove from\\n\\t\\t\\tthem their sins and admit them to gardens beneath which rivers\\n\\t\\t\\tflow, to live therein forever, and that will be the supreme\\n\\t\\t\\tachievement."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "10",
    "Text": "As for those who disbelieved and deny Our revelations, they will\\n\\t\\t\\tbecome the inmates of hell, wherein they shall live forever, and\\n\\t\\t\\tthat is an evil abode."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "11",
    "Text": "No affliction can ever befall except by the leave of Allah. He\\n\\t\\t\\tthat believes in Allah, his heart is guided to the Right Way.\\n\\t\\t\\tAllah has knowledge of all things."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "12",
    "Text": "Obey Allah and obey His Rasool; but if you pay no heed, then you\\n\\t\\t\\tshould know that Our Rasool's responsibility is nothing but to\\n\\t\\t\\tconvey the message plainly."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "13",
    "Text": "Allah! There is no god but Him, therefore, in Allah Alone let the\\n\\t\\t\\tbelievers put their trust."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "14",
    "Text": "O believers! Surely among your wives and your children there are\\n\\t\\t\\tsome who are your enemies: so beware of them. But if you pardon,\\n\\t\\t\\toverlook and forgive their faults, then know that Allah is\\n\\t\\t\\tForgiving, Merciful."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "15",
    "Text": "Your wealth and your children are but a trial. It is Allah with\\n\\t\\t\\tWhom is the greatest reward."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "16",
    "Text": "Therefore, fear Allah as much as you can, listen to His message\\n\\t\\t\\tattentively, be obedient, and be charitable, this is for your own\\n\\t\\t\\tgood. Those who are saved from the covetousness of their own\\n\\t\\t\\tsouls, it is they who are truly successful."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "17",
    "Text": "If you lend to Allah a goodly loan, He will pay you back\\n\\t\\t\\tmanifold, and will forgive you your sins. Allah is Appreciative\\n\\t\\t\\tand Forbearing to those who are grateful."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "18",
    "Text": "He has the knowledge of the unseen and the seen, He is the\\n\\t\\t\\tAll-Mighty, the All-Wise."
  }
]
