[
  {
    "SurahNumber": "19",
    "AyahNumber": "1",
    "NoteID": "2455",
    "Body": "This is the only Sura which begins with these five\\n\\t\\t\\t\\tAbbreviated Letters, K.,H.,Y.,A.,S. For Abbreviated\\n\\t\\t\\t\\tLetters generally, see Appendix 1."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "2",
    "NoteID": "2456",
    "Body": "The Mercy of Allah to Zakriya was shown in many ways: (1)\\n\\t\\t\\t\\tin the acceptance of his prayer; (2) in bestowing a son\\n\\t\\t\\t\\tlike Yahya; and (3) in the love between father and son,\\n\\t\\t\\t\\tin addition to the work which Yahya did as Allah's\\n\\t\\t\\t\\tMessenger for the world. Cf. iii. 38-41 and notes. There\\n\\t\\t\\t\\tthe public ministry was the point stressed; here the\\n\\t\\t\\t\\tbeautiful relations between the son and the father."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "3",
    "NoteID": "2457",
    "Body": "In secret: because he feared that his own family and\\n\\t\\t\\t\\trelatives were going wrong (xix. 5), and he wanted to\\n\\t\\t\\t\\tkeep the lamp of Allah burning bright. He could not very\\n\\t\\t\\t\\twell mention the fear about his colleagues (who were his\\n\\t\\t\\t\\trelations) in public."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "4",
    "NoteID": "2458",
    "Body": "This preface shows the fervent faith of Zakariya.\\n\\t\\t\\t\\tZakariya was a prophet of the Most High Allah. His office\\n\\t\\t\\t\\twas in the Temple, and his relatives were his colleagues.\\n\\t\\t\\t\\tBut he found in them no true spirit of the service of\\n\\t\\t\\t\\tAllah and man. He was filled with anxiety as to who would\\n\\t\\t\\t\\tuphold the godly ideas he had in mind, which were strange\\n\\t\\t\\t\\tto his worldly colleagues."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "5",
    "NoteID": "2459",
    "Body": "His was not merely a desire for a son. If it had been, he\\n\\t\\t\\t\\twould have prayed much earlier in his life, when he was a\\n\\t\\t\\t\\tyoung man. He was too full of true piety to put merely\\n\\t\\t\\t\\tselfish things into his prayers. But here was a public\\n\\t\\t\\t\\tneed, in the service of the Lord."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "6",
    "NoteID": "2460",
    "Body": "It is true that an heir inherits property, but his higher\\n\\t\\t\\t\\tduty is to represent in everything the personality of him\\n\\t\\t\\t\\tfrom whom he inherits. It is doubtful whether Zakariya\\n\\t\\t\\t\\thad any worldly property. But he had character and\\n\\t\\t\\t\\tvirtue, as a man of God, and this he wanted to transmit\\n\\t\\t\\t\\tto his heir as his most precious possession. It was\\n\\t\\t\\t\\talmost the most precious possession of the posterity of\\n\\t\\t\\t\\tJacob. The people around him had fallen away from Allah's\\n\\t\\t\\t\\tMessage. Could his heir, like him, try and renew it?"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "7",
    "NoteID": "2461",
    "Body": "This was John the Baptist, the forerunner of Jesus. In\\n\\t\\t\\t\\taccordance with his father's prayer he, and Jesus for\\n\\t\\t\\t\\twhom he prepared the way, renewed the Message of Allah,\\n\\t\\t\\t\\twhich had been corrupted and lost among the Israelites.\\n\\t\\t\\t\\tThe Arabic form Yahya suggests \"Life\". The Hebrew form is\\n\\t\\t\\t\\tJohanan, which means \"Jehovah has been Gracious\". Cf.\\n\\t\\t\\t\\tHananan in verse 13 below. It does not mean that the name\\n\\t\\t\\t\\twas given for the first time, for we read of a Johanan\\n\\t\\t\\t\\tthe son of Careah in II Kings, xxv. 23, an otherwise\\n\\t\\t\\t\\tobscure man. It means that Allah had, for the first time,\\n\\t\\t\\t\\tcalled one of His elect by that name."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "9",
    "NoteID": "2462",
    "Body": "Who is the \"He\" in this clause? As I have construed it,\\n\\t\\t\\t\\tfollowing the majority of Commentators, it means the\\n\\t\\t\\t\\tangel who brought the message from Allah. Cf. xix. 21\\n\\t\\t\\t\\tbelow. But some Commentators construe it to refer to\\n\\t\\t\\t\\tZakariya. In that case the meaning will be: Zakariya\\n\\t\\t\\t\\tafter a little reflection said (in his wonder) \"So!\",\\n\\t\\t\\t\\ti.e., \"Can it really be so? Can I really have a son in my\\n\\t\\t\\t\\told age?\"  The speech following,\"Thy Lord saith,\" etc.,\\n\\t\\t\\t\\twill then be that of the angel-messenger."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "9",
    "NoteID": "2463",
    "Body": "Every man was nothing just before he was created, i.e.,\\n\\t\\t\\t\\this personality was called into being by Allah. Even if\\n\\t\\t\\t\\tthere are material processes in forming the body, in\\n\\t\\t\\t\\taccordance with the laws of nature, the real creative\\n\\t\\t\\t\\tforce is the power of Allah. But here there is a subtler\\n\\t\\t\\t\\tmeaning. John was the harbinger of Jesus, preparing the\\n\\t\\t\\t\\tway for him; and this sentence also prepares us for the\\n\\t\\t\\t\\tmore wonderful birth of Jesus himself, see verse 21\\n\\t\\t\\t\\tbelow. Everything is possible with Allah."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "10",
    "NoteID": "2464",
    "Body": "The \"Sign\", was in order to convince Zakariya that the\\n\\t\\t\\t\\tLord's promise was true."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "10",
    "NoteID": "2465",
    "Body": "Compare this verse with iii. 41. The variations are\\n\\t\\t\\t\\tinteresting. Here it is \"for three nights\": there it is\\n\\t\\t\\t\\t\"for three days\". The meaning is the same, for a day is a\\n\\t\\t\\t\\tperiod of 24 hours. But the point of view is different in\\n\\t\\t\\t\\teach case. There it was from the point of view of the\\n\\t\\t\\t\\tUmmat or Congregation, among whom he worked by day; here\\n\\t\\t\\t\\tthe point of view is that of his individual soul, which\\n\\t\\t\\t\\tspent the nights in prayer and praise. Notice again that\\n\\t\\t\\t\\tat the end of the next verse, we have here, \"In the\\n\\t\\t\\t\\tmorning and the evening\", and at the end of iii. 41, \"In\\n\\t\\t\\t\\tthe evening and in the morning\"-showing again that the\\n\\t\\t\\t\\tpoint of view is reversed."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "12",
    "NoteID": "2466",
    "Body": "Time passes. The son is born. In this section of the Sura\\n\\t\\t\\t\\tthe centre of interest is Yahya, and the instruction is\\n\\t\\t\\t\\tnow given to him. 'Keep fast hold of Allah's revelation\\n\\t\\t\\t\\twith all your might': for an unbelieving world had either\\n\\t\\t\\t\\tcorrupted or neglected it, and Yahya (John the Baptist)\\n\\t\\t\\t\\twas to prepare the way for, Jesus, who was coming to\\n\\t\\t\\t\\trenew and re-interpret it."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "12",
    "NoteID": "2467",
    "Body": "Hukm, translated Wisdom, implies something more than\\n\\t\\t\\t\\tWisdom; it is the Wisdom or Judgment that is entitied to\\n\\t\\t\\t\\tjudge and command, as in the matter of denouncing sin."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "13",
    "NoteID": "2468",
    "Body": "John the Baptist did not live long. He was imprisoned by\\n\\t\\t\\t\\tHerod, the tetrarch (provincial ruler under the Roman\\n\\t\\t\\t\\tEmpire), whom he had reproved for his sins, and\\n\\t\\t\\t\\teventually beheaded at the instigation of the woman with\\n\\t\\t\\t\\twhom Herod was infatuated. But even in his young life, he\\n\\t\\t\\t\\twas granted (1) wisdom by Allah, for he boldly denounced\\n\\t\\t\\t\\tsin; (2) gentle pity and love for all Allah's creatures,\\n\\t\\t\\t\\tfor he moved among the humble and lowly, and despised\\n\\t\\t\\t\\t\"soft raiment\"; and (3) purity of life, for he renounced\\n\\t\\t\\t\\tthe world and lived in the wilderness. All his work he\\n\\t\\t\\t\\tdid in his youth. These things showed themselves in his\\n\\t\\t\\t\\tconduct, for he was devout, showing love to Allah and to\\n\\t\\t\\t\\tAllah's creatures, and more particularly to his parents\\n\\t\\t\\t\\t(for we are considering that aspect of his life): this\\n\\t\\t\\t\\twas also shown by the fact that he never used violence,\\n\\t\\t\\t\\tfrom an attitude of arrogance, nor entertained a spirit\\n\\t\\t\\t\\tof rebellion against divine Law."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "15",
    "NoteID": "2469",
    "Body": "This is spoken as in the life-time of Yahya. Peace and\\n\\t\\t\\t\\tAllah's Blessings, were on him when he was born; they\\n\\t\\t\\t\\tcontinue when he is about to die an unjust death at the\\n\\t\\t\\t\\thands of a tyrant; and they will be specially manifest at\\n\\t\\t\\t\\tthe Day of Judgment."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "16",
    "NoteID": "2470",
    "Body": "Cf. the story of Mary as related in iii. 42-51. Here the\\n\\t\\t\\t\\twhole theme is different: it is the personal side of the\\n\\t\\t\\t\\texperiences of the worshippers of Allah in relation to\\n\\t\\t\\t\\ttheir families or environment."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "16",
    "NoteID": "2471",
    "Body": "To a private eastern chamber, perhaps in the Temple. She\\n\\t\\t\\t\\twent into privacy, from her people and from people in\\n\\t\\t\\t\\tgeneral, for prayer and devotion. It was in this state of\\n\\t\\t\\t\\tpurity that the angel appeared to her in the shape of a\\n\\t\\t\\t\\tman. She thought it was a man. She was frightened, and\\n\\t\\t\\t\\tshe adjured him not to invade her privacy."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "19",
    "NoteID": "2472",
    "Body": "Allah had destined her to be the mother of the Prophet\\n\\t\\t\\t\\tJesus Christ, and now had come the time when this should\\n\\t\\t\\t\\tbe announced to her."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "21",
    "NoteID": "2473",
    "Body": "The mission of Jesus is announced in two ways (1) he was\\n\\t\\t\\t\\tto be a Sign to men; his wonderful birth and wonderful\\n\\t\\t\\t\\tlife were to turn an ungodly world back to Allah; and (2)\\n\\t\\t\\t\\this mission was similar to that of all prophets of Allah.\\n\\t\\t\\t\\tBut the point here is that the Israelites, to whom Jesus\\n\\t\\t\\t\\twas sent, were a hardened race, for whom the message of\\n\\t\\t\\t\\tJesus was truly a gospel of Mercy."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "21",
    "NoteID": "2474",
    "Body": "For anything that Allah wishes to create, He says \"Be\",\\n\\t\\t\\t\\tand it is (Cf. iii. 47). There is no interval between His\\n\\t\\t\\t\\tdecree and its accomplishment, except such as He imposes\\n\\t\\t\\t\\tby His decree. Time may be only a projection of our own\\n\\t\\t\\t\\tminds in this world of relativity."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "22",
    "NoteID": "2475",
    "Body": "The annunciation and the conception, we may suppose, took\\n\\t\\t\\t\\tplace in Nazareth (of Galilee), say 65 miles north of\\n\\t\\t\\t\\tJerusalem. The delivery took place in Bethlehem about 6\\n\\t\\t\\t\\tmiles south of Jerusalem. It was a remote place, not only\\n\\t\\t\\t\\twith reference to the distance of 71 miles, but because\\n\\t\\t\\t\\tin Bethlehem itself the birth was in an obscure corner\\n\\t\\t\\t\\tunder a palm-tree, from which perhaps the babe was\\n\\t\\t\\t\\tafterwards removed to a manger in a stable."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "23",
    "NoteID": "2476",
    "Body": "She was but human, and suffered the pangs of an expectant\\n\\t\\t\\t\\tmother, with no one to attend on her. The circumstances\\n\\t\\t\\t\\tbeing peculiar, she had got far away from her people."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "25",
    "NoteID": "2477",
    "Body": "Unseen Providence had seen that she should not suffer\\n\\t\\t\\t\\tfrom thirst or from hunger. The rivulet provided her with\\n\\t\\t\\t\\twater also for ablutions."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "26",
    "NoteID": "2478",
    "Body": "Cool thine eye: An idiom for \"comfort thyself and be\\n\\t\\t\\t\\tglad\". The literal meaning should not, however, be lost\\n\\t\\t\\t\\tsight of. She was to cool her eyes (perhaps full of\\n\\t\\t\\t\\ttears) with the fresh water of the rivulet and take\\n\\t\\t\\t\\tcomfort that a remarkable babe had been born to her. She\\n\\t\\t\\t\\twas also to look around, and if any one came near, she\\n\\t\\t\\t\\twas to decline all conversation. It was quite true: she\\n\\t\\t\\t\\twas under a vow, and could not talk to any one."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "26",
    "NoteID": "2479",
    "Body": "She was to decline all conversation with man or woman, on\\n\\t\\t\\t\\tthe plea of a vow to Allah. The \"fast\" here does not mean\\n\\t\\t\\t\\tabstinence literally from eating and drinking. She has\\n\\t\\t\\t\\tjust been advised to eat the dates and drink of the\\n\\t\\t\\t\\tstream. It means abstinence from the ordinary household\\n\\t\\t\\t\\tmeals, and indeed from human intercourse generally."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "27",
    "NoteID": "2480",
    "Body": "The amazement of the people knew no bounds. In any case\\n\\t\\t\\t\\tthey were ready to think the worst of her, as she had\\n\\t\\t\\t\\tdisappeared from her kin for some time. But now she\\n\\t\\t\\t\\tcomes, shamelessly parading a babe in her arms! How she\\n\\t\\t\\t\\thad disgraced the house of Aaron, the fountain of\\n\\t\\t\\t\\tpriesthood! We may suppose that the scene took place in\\n\\t\\t\\t\\tthe Temple in Jerusalem, or in Nazareth."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "28",
    "NoteID": "2481",
    "Body": "Aaron the brother of Moses was the first in the line of\\n\\t\\t\\t\\tIsraelite priesthood. Mary and her cousin Elisabeth\\n\\t\\t\\t\\t(mother of Yahya) came of a priestly family, and were\\n\\t\\t\\t\\ttherefore, \"sisters of Aaron\" or daughters of 'Imran (who\\n\\t\\t\\t\\twas Aaron's father). See n. 375 to iii. 35. Mary is\\n\\t\\t\\t\\treminded of her high lineage and the unexceptionable\\n\\t\\t\\t\\tmorals of her father and mother. How, they said, she had\\n\\t\\t\\t\\tfallen, and disgraced the name of her progenitors!"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "29",
    "NoteID": "2482",
    "Body": "What could Mary do? How could she explain? Would they, in\\n\\t\\t\\t\\ttheir censorious mood, accept her explanation? All she\\n\\t\\t\\t\\tcould do was to point to the child, who, she knew, was no\\n\\t\\t\\t\\tordinary child. And the child came to her rescue. By a\\n\\t\\t\\t\\tmiracle he spoke, defended his mother, and preached-to an\\n\\t\\t\\t\\tunbelieving audience. See iii. 46, and n. 388."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "31",
    "NoteID": "2483",
    "Body": "There is a parallelism throughout the accounts of Jesus\\n\\t\\t\\t\\tand Yahya, with some variations. Both the parallelisms\\n\\t\\t\\t\\tand the variations are interesting. For instance Jesus\\n\\t\\t\\t\\tdeclares at the very outset that he is a servant of\\n\\t\\t\\t\\tAllah, thus negativing the false notion that he was Allah\\n\\t\\t\\t\\tor the son of Allah. The greatness of Yahya is described\\n\\t\\t\\t\\tin xix. 12-13 in terms that are not applied to Jesus, but\\n\\t\\t\\t\\tthe verses xix. 14-15 as applied to Yahya are in almost\\n\\t\\t\\t\\tidentical terms with those applied to Jesus here (xix.\\n\\t\\t\\t\\t32-33). Devotion in Prayer and Charity is a good\\n\\t\\t\\t\\tdescription of Christ at its best, and pity, purity, and\\n\\t\\t\\t\\tdevotion in Yahya are a good description of the ways\\n\\t\\t\\t\\tleading to Prayer and Charity, just as John led to Jesus."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "32",
    "NoteID": "2484",
    "Body": "Overbearing violence is not only unjust and harmful to\\n\\t\\t\\t\\tthose on whom it is practised; it is perhaps even more\\n\\t\\t\\t\\tharmful to the person who practises it, for his soul\\n\\t\\t\\t\\tbecomes turbid, unsettled, and ultimately unhappy and\\n\\t\\t\\t\\twretched,-the state of those in Hell. Here the negative\\n\\t\\t\\t\\tqualities are \"not overbearing or miserable.\" As applied\\n\\t\\t\\t\\tto John they were \"not overbearing or rebellious.\" John\\n\\t\\t\\t\\tbore his punishment from the State without any protest or\\n\\t\\t\\t\\tdrawing back."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "33",
    "NoteID": "2485",
    "Body": "Cf. xix. 15, and n. 2469. Christ was not crucified (iv.\\n\\t\\t\\t\\t157)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "34",
    "NoteID": "2486",
    "Body": "The disputations about the nature of Jesus Christ were\\n\\t\\t\\t\\tvain, but also persistent and sanguinary. The modern\\n\\t\\t\\t\\tChristian churches have thrown them into the background,\\n\\t\\t\\t\\tbut they would do well to abandon irrational dogmas\\n\\t\\t\\t\\taltogether."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "35",
    "NoteID": "2487",
    "Body": "Begetting a son is a physical act depending on the needs\\n\\t\\t\\t\\tof men's animal nature. Allah Most High is independent of\\n\\t\\t\\t\\tall needs, and it is derogatory to Him to attribute such\\n\\t\\t\\t\\tan act to Him. It is merely a relic of pagan and\\n\\t\\t\\t\\tanthropomorphic materialist superstitions."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "36",
    "NoteID": "2488",
    "Body": "As opposed to the crooked superstitions which take refuge\\n\\t\\t\\t\\tin all sorts of metaphysical sophistries to prove three\\n\\t\\t\\t\\tin one and one in three. In the Qur-an there is no\\n\\t\\t\\t\\tcrookedness (xviii. 1). Christ's teaching was simple,\\n\\t\\t\\t\\tlike his life, but the Christians have made it crooked."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "37",
    "NoteID": "2489",
    "Body": "Judgment: the word in the original is Mash-had, which\\n\\t\\t\\t\\timplies many things: (1) the time or place where evidence\\n\\t\\t\\t\\tis taken, as in a Court of Judgment; (2) the time or\\n\\t\\t\\t\\tplace where people are produced (to be judged); and (3)\\n\\t\\t\\t\\tthe occasion for such production for the taking of\\n\\t\\t\\t\\tevidence. A very expressive phrase for the Day of\\n\\t\\t\\t\\tJudgment."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "38",
    "NoteID": "2490",
    "Body": "Cf. 1. 22. and that whole passage, where the Resurrection\\n\\t\\t\\t\\tis described."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "39",
    "NoteID": "2491",
    "Body": "Hasrat: Sighs, sighing, regrets, distress."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "40",
    "NoteID": "2492",
    "Body": "Cf. iii. 180. n. 485; xv. 23 n. 1964, Material property\\n\\t\\t\\t\\tpasses from one to another: when one dies, another\\n\\t\\t\\t\\tinherits it. Allah gives life and death, and all that\\n\\t\\t\\t\\tsurvives after physical death goes back to Allah, the\\n\\t\\t\\t\\toriginal source of all things."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "42",
    "NoteID": "2493",
    "Body": "The reference to Abraham here is in relation to his\\n\\t\\t\\t\\ttender solicitude for his father, who had not received\\n\\t\\t\\t\\tthe light of Unity, and to whom Abraham wanted to be a\\n\\t\\t\\t\\tguide and friend."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "43",
    "NoteID": "2494",
    "Body": "Some are more receptive of Light than others. It is their\\n\\t\\t\\t\\tduty and privilege to guide and point to the right Way."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "43",
    "NoteID": "2495",
    "Body": "Sawiyan-right, smooth, even; complete, perfect; hence the\\n\\t\\t\\t\\tderived meaning: in xix. 10, in full possession of all\\n\\t\\t\\t\\tthe physical senses; in that context, 'not dumb': in xix.\\n\\t\\t\\t\\t17, when the angel appears in the form of a man,\\n\\t\\t\\t\\t'completely like' a man, a man 'in all respects.'"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "44",
    "NoteID": "2496",
    "Body": "The rebellion is all the more heinous and inexcusable,\\n\\t\\t\\t\\tconsidering that Allah is Most Just, Most Merciful, Most\\n\\t\\t\\t\\tGracious."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "45",
    "NoteID": "2497",
    "Body": "To entertain a feeling of friendliness, instead of\\n\\t\\t\\t\\taversion, to Evil, is in itself a degradation of our\\n\\t\\t\\t\\tnature, a Penalty which Allah imposes on our deliberate\\n\\t\\t\\t\\trejection of the Truth. And the friendliness to Evil also\\n\\t\\t\\t\\timplies the sharing of the outlawry of Evil."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "46",
    "NoteID": "2498",
    "Body": "Note the gentle persuasive tone of Abraham in his\\n\\t\\t\\t\\tspeeches in xix. 42-45 (for we may suppose those\\n\\t\\t\\t\\tsentences to sum up a long course of arguments) and in\\n\\t\\t\\t\\txix. 47-48, contrasted with the brusque and repellent\\n\\t\\t\\t\\ttone of the father's reply in this verse. The one was the\\n\\t\\t\\t\\toutcome of the true Light which had come to Abraham from\\n\\t\\t\\t\\tAllah, as the other was the outcome of Pagan arrogance\\n\\t\\t\\t\\tand the worship of brute force. The spiritual lesson from\\n\\t\\t\\t\\tthis episode of Abraham's life may be stated in four\\n\\t\\t\\t\\tpropositions: (1) the pious son is dutiful to his father\\n\\t\\t\\t\\tand wishes him well in all things, material and\\n\\t\\t\\t\\tspiritual, (2) if the father refuses Allah's Light, the\\n\\t\\t\\t\\tson will do his utmost to bring such Light to the father;\\n\\t\\t\\t\\t(3) having received the Light, the son will never\\n\\t\\t\\t\\trenounce that Light, even if he has to forfeit his\\n\\t\\t\\t\\tfather's love and renounce his home; (4) even if the\\n\\t\\t\\t\\tfather repels him and turns him out, his answer will be a\\n\\t\\t\\t\\tsoft answer, full of love and forgiveness on the one\\n\\t\\t\\t\\thand, but firmness on behalf of Truth on the other."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "47",
    "NoteID": "2499",
    "Body": "Cf. ix. 114, where this promise of Abraham to pray for\\n\\t\\t\\t\\this father is referred to, and its limitations pointed\\n\\t\\t\\t\\tout."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "48",
    "NoteID": "2500",
    "Body": "Abraham left his father and the home of his fathers (Ur\\n\\t\\t\\t\\tof the Chaldees) and never returned. He left because he\\n\\t\\t\\t\\twas turned out, and because it was not possible for him\\n\\t\\t\\t\\tto make any compromise with what was false in religion.\\n\\t\\t\\t\\tIn return for abuse, he spoke gentle words. And he\\n\\t\\t\\t\\texpressed his fervent hope that at least he (Abraham)\\n\\t\\t\\t\\twould have Allah's blessing in reply to his prayers. Here\\n\\t\\t\\t\\twas a prefigurement of another Hijrat many centuries\\n\\t\\t\\t\\tlater! In both cases the prayer was abundantly fulfilled."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "49",
    "NoteID": "2501",
    "Body": "Isaac and Isaac's son Jacob are mentioned here as\\n\\t\\t\\t\\tcarrying on one line of Abraham's traditions. The other\\n\\t\\t\\t\\tline was carried on by Isma'il, who is mentioned\\n\\t\\t\\t\\tindependently five verses lower down, as his line got\\n\\t\\t\\t\\tspecial honour in the Holy Prophet of Islam. That is why\\n\\t\\t\\t\\this mention comes after that of Moses. Cf. xxi. 72."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "50",
    "NoteID": "2502",
    "Body": "Abraham and his son and grandson Isaac and Jacob, and\\n\\t\\t\\t\\ttheir line, maintained the banner of Allah's truth for\\n\\t\\t\\t\\tmany generations, and they won deservedly high praise-the\\n\\t\\t\\t\\tpraise of truth-on the tongues of men. Abraham prayed\\n\\t\\t\\t\\tthat he should be praised by the tongue of truth among\\n\\t\\t\\t\\tmen to come in later ages: xxvi. 84. Ordinary praise may\\n\\t\\t\\t\\tmean nothing: it may be due to selfish flattery on the\\n\\t\\t\\t\\tpart of others or artful management by the person\\n\\t\\t\\t\\tpraised. Praise on the tongue of sincere truth is praise\\n\\t\\t\\t\\tindeed!"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "51",
    "NoteID": "2503",
    "Body": "Moses was (1) especially chosen, and therefore prepared\\n\\t\\t\\t\\tand instructed in all the wisdom of the Egyptians, in\\n\\t\\t\\t\\torder that he might free his people from Egyptian\\n\\t\\t\\t\\tbondage; there may also be a reference to Moses's title\\n\\t\\t\\t\\tof Kalimullah, the one to whom Allah spoke without th\\n\\t\\t\\t\\teintervention of angels: see iv. 164, and n. 670; (2) he\\n\\t\\t\\t\\twas a prophet (nabi), in that he received inspiration;\\n\\t\\t\\t\\tand (3) he was a messenger (rasul) in that he had a Book\\n\\t\\t\\t\\tof Revelation, and an Ummat or organised Community, for\\n\\t\\t\\t\\twhich he instituted laws."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "52",
    "NoteID": "2504",
    "Body": "The incident here I think refers to the incidents\\n\\t\\t\\t\\tdescribed more fully in xx. 9-36; a reference may also be\\n\\t\\t\\t\\tmade to Exod. iii. 1-18 and iv. 1-17. The time is when\\n\\t\\t\\t\\tMoses (with his family) was travelling and grazing the\\n\\t\\t\\t\\tflocks of his father-in-law Jethro, just before he got\\n\\t\\t\\t\\this commission from Allah. The place is somewhere near\\n\\t\\t\\t\\tMount Sinai (Jabal Musa). Moses sees a Fire in the\\n\\t\\t\\t\\tdistance, but when he goes there, he hears a voice that\\n\\t\\t\\t\\ttells him it is sacred ground. Allah asked him to put off\\n\\t\\t\\t\\this shoes and to draw near, and when he went near, great\\n\\t\\t\\t\\tmysteries were revealed to him. He was given his\\n\\t\\t\\t\\tcommission, and his brother Aaron was given to him to go\\n\\t\\t\\t\\twith him and aid him. It is after that, that he and Aaron\\n\\t\\t\\t\\twent and faced Pharaoh in Egypt, as narrated in vii.\\n\\t\\t\\t\\t103-144, etc. The right side of the mountain may mean\\n\\t\\t\\t\\tthat Moses heard the voice from the right side of the\\n\\t\\t\\t\\tmountain as he faced it; or it may have the figurative\\n\\t\\t\\t\\tmeaning of \"right\" in Arabic, i.e., the side which was\\n\\t\\t\\t\\tblessed or sacred ground."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "53",
    "NoteID": "2505",
    "Body": "Moses was diffident, and reluctant to go to Pharaoh as he\\n\\t\\t\\t\\thad an impediment in his tongue, and he asked that his\\n\\t\\t\\t\\tbrother Aaron should be associated with him in his\\n\\t\\t\\t\\tmission. Allah in His Mercy granted his request; xx.\\n\\t\\t\\t\\t25-36."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "54",
    "NoteID": "2506",
    "Body": "Isma'il was Az-zabih i.e., the chosen sacrifice for Allah\\n\\t\\t\\t\\tin Muslim tradition. When Abraham told him of the\\n\\t\\t\\t\\tsacrifice, he voluntarily offered himself for it, and\\n\\t\\t\\t\\tnever flinched from his promise, until the sacrifice was\\n\\t\\t\\t\\tredeemed by the substitution of a ram under Allah's\\n\\t\\t\\t\\tcommands. He was the fountain-head of the Arabian Ummat,\\n\\t\\t\\t\\tand in his posterity came the Prophet of Allah. The Ummat\\n\\t\\t\\t\\tand the Book of Islam reflect back the prophethood on\\n\\t\\t\\t\\tIsma'il."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "55",
    "NoteID": "2507",
    "Body": "An acceptable sacrifice: see last note."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "56",
    "NoteID": "2508",
    "Body": "Idris is mentioned twice in the Qur-an, viz.; here and in\\n\\t\\t\\t\\txxi. 85, where he is mentioned among those who patiently\\n\\t\\t\\t\\tpersevered. His identification with the Biblical Enoch,\\n\\t\\t\\t\\twho \"walked with God\" (Gen. v. 21-24), may or may not be\\n\\t\\t\\t\\tcorrect. Nor are we justified in interpreting verse 57\\n\\t\\t\\t\\there as meaning the same thing as in Gen. v. 24 (\"God\\n\\t\\t\\t\\ttook him\"), that he was taken up without passing through\\n\\t\\t\\t\\tthe portals of death. All we are told is that he was a\\n\\t\\t\\t\\tman of truth and sincerity, and a prophet, and that he\\n\\t\\t\\t\\thad a high position among his people. It is this point\\n\\t\\t\\t\\twhich brings him in the series of men just mentioned; he\\n\\t\\t\\t\\tkept himself in touch with his people, and was honoured\\n\\t\\t\\t\\tamong them. Spiritual progress need not cut us off from\\n\\t\\t\\t\\tour people, for we have to help and guide them. He kept\\n\\t\\t\\t\\tto truth and piety in the highest station."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "58",
    "NoteID": "2509",
    "Body": "The earlier generations are grouped into three epochs\\n\\t\\t\\t\\tfrom a religious point of view: (1) from Adam to Noah,\\n\\t\\t\\t\\t(2) from Noah to Abraham, and (3) from Abraham to an\\n\\t\\t\\t\\tindefinite time, say to the time when the Message of\\n\\t\\t\\t\\tAllah was corrupted and the need arose for the final\\n\\t\\t\\t\\tMessenger of Unity and Truth. Israel is another name for\\n\\t\\t\\t\\tJacob."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "58",
    "NoteID": "2510",
    "Body": "The original is in the Aorist tense, implying that the\\n\\t\\t\\t\\t\"Posterity\" alluded to includes not only the messengers\\n\\t\\t\\t\\tbut their worthy followers who are true to Allah and\\n\\t\\t\\t\\tuphold His standard."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "59",
    "NoteID": "2511",
    "Body": "This selfish godless posterity gains the upper hand at\\n\\t\\t\\t\\tcertain times, but even then there is always a minority\\n\\t\\t\\t\\twho see the error of their ways, repent and believe, and\\n\\t\\t\\t\\tlive righteous lives. They are not penalised in the\\n\\t\\t\\t\\tHereafter because they were associated with the ungodly\\n\\t\\t\\t\\tin time. They reap the full reward of their faith and\\n\\t\\t\\t\\trighteousness."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "62",
    "NoteID": "2512",
    "Body": "Salam, translated \"Peace\", has a much wider\\n\\t\\t\\t\\tsignification. It includes (1) a sense of security and\\n\\t\\t\\t\\tpermanence, which is unknown in this life; (2) soundness,\\n\\t\\t\\t\\tfreedom from defects, perfection as in the word salim;\\n\\t\\t\\t\\t(3) preservation, salvation, deliverance, as in the word\\n\\t\\t\\t\\tsallama, (4) salutation, accord with those around us; (5)\\n\\t\\t\\t\\tresignation, in the sense that we are satisfied and not\\n\\t\\t\\t\\tdiscontented; besides (6) the ordinary meaning of Peace,\\n\\t\\t\\t\\ti.e., freedom from any jarring element. All these shades\\n\\t\\t\\t\\tof meaning are implied in the word Islam."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "62",
    "NoteID": "2513",
    "Body": "Rizq: literally sustenance or means of subsistence, the\\n\\t\\t\\t\\tterm covers all the means of perfect satisfaction of body\\n\\t\\t\\t\\tand soul. Morning and evening, i.e., early and late, all\\n\\t\\t\\t\\tthe time, always."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "64",
    "NoteID": "2514",
    "Body": "We are apt to be impatient of the evils we see around us.\\n\\t\\t\\t\\tWe may give of our best service to Allah, and yet see no\\n\\t\\t\\t\\tresults. In our human short-sightedness we may complain\\n\\t\\t\\t\\twithin ourselves. But we must not be impatient. The\\n\\t\\t\\t\\tangels of Grace come not haphazard, but by command of\\n\\t\\t\\t\\tAllah according to His Universal Will and Purpose. Allah\\n\\t\\t\\t\\tdoes not forget. If things are delayed, it is in\\n\\t\\t\\t\\taccordance with a wise providence, which cares for all.\\n\\t\\t\\t\\tOur plain duty is to be patient and constant in His\\n\\t\\t\\t\\tservice."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "65",
    "NoteID": "2515",
    "Body": "The more we taste of the truth and mystery of life, the\\n\\t\\t\\t\\tmore do we realise that there is no one to be mentioned\\n\\t\\t\\t\\tin the same breath as Allah. He is above all names. But\\n\\t\\t\\t\\twhen we think of His beautiful qualities, and picture\\n\\t\\t\\t\\tthem to ourselves by names which give us some idea of\\n\\t\\t\\t\\tHim, we can search the whole wide world of our\\n\\t\\t\\t\\timagination, and we shall not find another to be compared\\n\\t\\t\\t\\twith Him in name or quality. He is the One: praise be to\\n\\t\\t\\t\\tHim!"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "68",
    "NoteID": "2516",
    "Body": "The disbelief in a future life is not merely a\\n\\t\\t\\t\\tphilosophic doubt, but a warped will, a disingenuous\\n\\t\\t\\t\\tobstinacy in face of our inner spiritual instincts and\\n\\t\\t\\t\\texperiences. We were nothing before. Cannot the same\\n\\t\\t\\t\\tAllah, Who created us out of nothing also continue our\\n\\t\\t\\t\\tpersonality? But if we refuse to accept His light and\\n\\t\\t\\t\\tguidance, our state will grow worse and worse. We shall\\n\\t\\t\\t\\tbe deprived of His grace. We shall be herded with satans.\\n\\t\\t\\t\\tIn utter humiliation we shall be faced with all the\\n\\t\\t\\t\\tconsequences of our refusal of Truth."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "68",
    "NoteID": "2517",
    "Body": "Round about Hell: There are many ways leading to evil,\\n\\t\\t\\t\\tand people get to it from all round. Hence the mention of\\n\\t\\t\\t\\tthe seven Gates to Hell: see xv. 44. and n. 1977."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "71",
    "NoteID": "2518",
    "Body": "Three interpretations are possible, (1) The general\\n\\t\\t\\t\\tinterpretation is that every person must pass through or\\n\\t\\t\\t\\tby or over the Fire. Those who have had Taqwa (see. n. 26\\n\\t\\t\\t\\tto ii. 2) will be saved by Allah's Mercy, while\\n\\t\\t\\t\\tunrepentant sinners will suffer the torments in ignominy,\\n\\t\\t\\t\\t(2) If we refer the pronoun \"you\" to those \"in obstinate\\n\\t\\t\\t\\trebellion\" in verse 69 above, both leaders and followers\\n\\t\\t\\t\\tin sin, this verse only applies to the wicked, (3) Some\\n\\t\\t\\t\\trefer this verse to the Bridge over Hell, the Bridge\\n\\t\\t\\t\\tSirat, over which all must pass to their final Destiny.\\n\\t\\t\\t\\tThis Bridge is not mentioned in the Qur-an."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "73",
    "NoteID": "2519",
    "Body": "The Unbelievers may, for a time, make a better show in\\n\\t\\t\\t\\tworldly position, or in people's assemblages where things\\n\\t\\t\\t\\tare judged by the counting of heads. But Truth must\\n\\t\\t\\t\\tprevail even in this world, and ultimately the positions\\n\\t\\t\\t\\tmust be reversed."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "75",
    "NoteID": "2520",
    "Body": "Allah's warning is that every evil deed must have its\\n\\t\\t\\t\\tpunishment, and that there will be a Hereafter, the Day\\n\\t\\t\\t\\tof Judgment, or the Hour, as it is frequently called. The\\n\\t\\t\\t\\tpunishment of evil often begins in this very life. For\\n\\t\\t\\t\\tinstance, over-indulgence and excesses of all kinds bring\\n\\t\\t\\t\\ton their Nemesis quite soon in this very life. But some\\n\\t\\t\\t\\tsubtler forms of selfishness and sin will be punished as\\n\\t\\t\\t\\tevery evil will be punished-in its own good time, as the\\n\\t\\t\\t\\tHour approaches. In either case, the arrogant boasting\\n\\t\\t\\t\\tsinners will realise that their taunt-who is best in\\n\\t\\t\\t\\tposition and in forces? (xix. 73)-is turned against\\n\\t\\t\\t\\tthemselves."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "76",
    "NoteID": "2521",
    "Body": "These lines are the same as in xviii. 46 (second clause),\\n\\t\\t\\t\\t(where see n. 2387), except that the word maradd\\n\\t\\t\\t\\t(eventual returns) is here substituted for amal (hope).\\n\\t\\t\\t\\tThe meaning is practically the same: but \"hope\" is more\\n\\t\\t\\t\\tappropriate in the passage dealing generally with this\\n\\t\\t\\t\\tworld's goods, and \"eventual returns\" in the passage\\n\\t\\t\\t\\tdealing with the sinner's specific investments and\\n\\t\\t\\t\\tcommitments in worldly position and organised cliques."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "77",
    "NoteID": "2522",
    "Body": "Besides the man who boasts of wealth and power in actual\\n\\t\\t\\t\\tpossession, there is a type of man who boasts of getting\\n\\t\\t\\t\\tthem in the future and builds his worldly hopes thereon.\\n\\t\\t\\t\\tIs he sure? He denies Allah, and His goodness and Mercy.\\n\\t\\t\\t\\tBut all good is in the hands of Allah. Can such a man\\n\\t\\t\\t\\tthen bind Allah to bless him when he rejects faith in\\n\\t\\t\\t\\tAllah? Or does he pretend that he has penetrated to the\\n\\t\\t\\t\\tmysteries of the future? For no man can tell what the\\n\\t\\t\\t\\tfuture holds for him."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "79",
    "NoteID": "2523",
    "Body": "Such a man deserves double punishment,-for rejecting\\n\\t\\t\\t\\tAllah, and for his blasphemies with His holy name."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "80",
    "NoteID": "2524",
    "Body": "Literally, \"We shall inherit\", Cf. xix. 40 and n. 2492.\\n\\t\\t\\t\\tEven if the man had property and power, it must go back\\n\\t\\t\\t\\tto the Source of all things, and the man must appear\\n\\t\\t\\t\\tbefore the Judgment-seat, alone and unaccompanied,\\n\\t\\t\\t\\tstripped of all the things from which he expected so\\n\\t\\t\\t\\tmuch!"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "81",
    "NoteID": "2525",
    "Body": "'Izz=exalted rank, glory, power, might, the ability to\\n\\t\\t\\t\\timpose one's will or to carry out one's will."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "82",
    "NoteID": "2526",
    "Body": "Cf. x. 28-30, where the idols deny that they knew\\n\\t\\t\\t\\tanything of their worship, and leave their worshippers in\\n\\t\\t\\t\\tthe lurch; and v. 119, where Jesus denies that he asked\\n\\t\\t\\t\\tfor worship, and leaves his false worshippers to the\\n\\t\\t\\t\\tpunishment of Allah."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "83",
    "NoteID": "2527",
    "Body": "Under the laws instituted by Allah, when evil reaches a\\n\\t\\t\\t\\tcertain stage of rebellion and defiance, it is left to\\n\\t\\t\\t\\tgather momentum and to rush with fury to its own\\n\\t\\t\\t\\tdestruction. It is given a certain amount of respite, as\\n\\t\\t\\t\\ta last chance: but failing repentance, its days are\\n\\t\\t\\t\\tnumbered. The godly therefore should not worry themselves\\n\\t\\t\\t\\tover the apparent worldly success of evil, but should get\\n\\t\\t\\t\\ton with their own duties in a spirit of trust in Allah."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "86",
    "NoteID": "2528",
    "Body": "Note the contrast between the saved and the doomed. The\\n\\t\\t\\t\\tone march with dignity like honoured ones before a king,\\n\\t\\t\\t\\tand the other rush in anguish to their punishment like a\\n\\t\\t\\t\\therd of cattle driven down by thirst to their watering\\n\\t\\t\\t\\tplace. Note the metaphor of the water. They rush madly\\n\\t\\t\\t\\tfor water but are plunged into the Fire!"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "89",
    "NoteID": "2529",
    "Body": "The belief in Allah begetting a son is not a question\\n\\t\\t\\t\\tmerely of words or of speculative thought. It is a\\n\\t\\t\\t\\tstupendous blasphemy against Allah. It lowers Allah to\\n\\t\\t\\t\\tthe level of an animal. If combined with the doctrine of\\n\\t\\t\\t\\tvicarious atonement, it amounts to a negation of Allah's\\n\\t\\t\\t\\tjustice and man's personal responsibility. It is\\n\\t\\t\\t\\tdestructive of all moral and spiritual order, and is\\n\\t\\t\\t\\tcondemned in the strongest possible terms."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "92",
    "NoteID": "2530",
    "Body": "This basic principle was laid down early in the argument\\n\\t\\t\\t\\t(xix. 35). It was illustrated by a reference to the\\n\\t\\t\\t\\tpersonal history of many messengers, including Jesus\\n\\t\\t\\t\\thimself, who behaved justly as men to their kith and kin\\n\\t\\t\\t\\tand humbly served Allah. The evil results of such\\n\\t\\t\\t\\tsuperstitions were pointed out in the case of many\\n\\t\\t\\t\\tprevious generations which went to their ruin by\\n\\t\\t\\t\\tdishonouring Allah. And the argument is now rounded off\\n\\t\\t\\t\\ttowards the close of the Sura."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "94",
    "NoteID": "2531",
    "Body": "Allah has no sons or favourites or parasites, such as we\\n\\t\\t\\t\\tassociate with human beings. On the other hand every\\n\\t\\t\\t\\tcreature of His gets His love, and His cherishing care.\\n\\t\\t\\t\\tEveryone of them, however humble, is individually marked\\n\\t\\t\\t\\tbefore His Throne of Justice and Mercy, and will stand\\n\\t\\t\\t\\tbefore Him on his own deserts."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "96",
    "NoteID": "2532",
    "Body": "His own love, and the love of man's fellow-creatures, in\\n\\t\\t\\t\\tthis world and in the Hereafter. Goodness breeds love and\\n\\t\\t\\t\\tpeace, and sin breeds hatred and contention."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "98",
    "NoteID": "2533",
    "Body": "Cf. xix. 74, from which this sentence is brought up as a\\n\\t\\t\\t\\treminiscence, showing the progress of sin, the Guidance\\n\\t\\t\\t\\twhich Allah gives to the good, the degradation of\\n\\t\\t\\t\\tblasphemy, the respite granted, and the final End, when\\n\\t\\t\\t\\tpersonal responsibility will be enforced."
  }
]
