[
  {
    "BookCode": "AMH",
    "VolumeNumber": "6",
    "hadithNumber": "1",
    "sectionHeading": "Stimulation of the Desire for Prayer in Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr from A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, prayed\\n\\t\\t\\t\\tin the mosque one night and people prayed behind him.\\n\\t\\t\\t\\tThen he prayed the next night and there were more people.\\n\\t\\t\\t\\tThen they gathered on the third or fourth night and the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, did not come out to them. In the morning, he said,\\n\\t\\t\\t\\t\"I saw what you were doing and the only thing that\\n\\t\\t\\t\\tprevented me from coming out to you was that I feared\\n\\t\\t\\t\\tthat it would become obligatory (fard) for you.\" This\\n\\t\\t\\t\\thappened in Ramadan.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "6",
    "hadithNumber": "2",
    "sectionHeading": "Stimulation of the Desire for Prayer in Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tSalama ibn Abd ar-Rahman ibn Awf from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to exhort people to watch the night in prayer\\n\\t\\t\\t\\tin Ramadan but never ordered it definitely. He used to\\n\\t\\t\\t\\tsay, \"Whoever watches the night in prayer in Ramadan with\\n\\t\\t\\t\\ttrust and expectancy, will be forgiven all his previous\\n\\t\\t\\t\\twrong actions.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Shihab said, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, died while that wasstill the\\n\\t\\t\\t\\tcustom, and it continued to be the custom in the\\n\\t\\t\\t\\tkhalifate of Abu Bakr and at the beginning of the\\n\\t\\t\\t\\tkhalifate of Umar ibn al-Khattab.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "6",
    "hadithNumber": "3",
    "sectionHeading": "Watching the Night in Prayer",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Urwa ibn\\n\\t\\t\\t\\taz-Zubayr that Abd ar-Rahman ibn Abd al-Qari said, \"I\\n\\t\\t\\t\\twent out with Umar ibn alKhattab in Ramadan to the mosque\\n\\t\\t\\t\\tand the people there were spread out in groups. Some men\\n\\t\\t\\t\\twere praying by themselves, whilst others were praying in\\n\\t\\t\\t\\tsmall groups. Umar said, 'By Allah! It would be better in\\n\\t\\t\\t\\tmy opinion if these people gathered behind one reciter.'\\n\\t\\t\\t\\tSo he gathered them behind Ubayy ibn Kab. Then I went out\\n\\t\\t\\t\\twith him another night and the people were praying behind\\n\\t\\t\\t\\ttheir Qur'an reciter. Umar said, 'How excellent this new\\n\\t\\t\\t\\tway is, but what you miss while you are asleep is better\\n\\t\\t\\t\\tthan what you watch in prayer.' He meant the end of the\\n\\t\\t\\t\\tnight, and people used to watch the beginning of the\\n\\t\\t\\t\\tnight in prayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "6",
    "hadithNumber": "4",
    "sectionHeading": "Watching the Night in Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Yusuf\\n\\t\\t\\t\\tthat as-Sa'ib ibn Yazid said, \"Umar ibn al-Khattab\\n\\t\\t\\t\\tordered Ubayy ibn Kab and Tamim ad-Dari to watch the\\n\\t\\t\\t\\tnight in prayer with the people for eleven rakas.The\\n\\t\\t\\t\\treciterof the Qur'an would recite the Mi'in (a group of\\n\\t\\t\\t\\tmedium-sized suras) until we would be leaning on our\\n\\t\\t\\t\\tstaffs from having stood so long in prayer. And we would\\n\\t\\t\\t\\tnot leave until the approach of dawn.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "6",
    "hadithNumber": "5",
    "sectionHeading": "Watching the Night in Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yazid ibn Ruman said,\\n\\t\\t\\t\\t\"The people used to watch the night in prayer during\\n\\t\\t\\t\\tRamadan for twenty-three rakas in the time of Umar ibn\\n\\t\\t\\t\\tal-Khattab.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "6",
    "hadithNumber": "6",
    "sectionHeading": "Watching the Night in Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Da'ud ibn al-Husayn\\n\\t\\t\\t\\tthat he heard al-Araj say, \"I never saw the people in\\n\\t\\t\\t\\tRamadan, but that they were cursing the disbelievers.\" He\\n\\t\\t\\t\\tadded, \"The reciter of Qur'an used to recite surat\\n\\t\\t\\t\\tal-Baqara in eight rakas and if he did it in twelve rakas\\n\\t\\t\\t\\tthe people would think that he had made it easy.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "6",
    "hadithNumber": "7",
    "sectionHeading": "Watching the Night in Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tsaid, \"I heard my father say, 'We finished praying in\\n\\t\\t\\t\\tRamadan and the servants hurried with the food, fearing\\n\\t\\t\\t\\tthe approach of dawn.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "6",
    "hadithNumber": "8",
    "sectionHeading": "Watching the Night in Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Dhakwan Abu Amr (a slave belonging to\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, who was freed by her after her death)\\n\\t\\t\\t\\tused tostand in prayer and recite for her in Ramadan.\\n\\t\\t\\t</p>"
  }
]
