[
  {
    "SurahNumber": "58",
    "AyahNumber": "1",
    "NoteID": "5330",
    "Body": "The immediate occasion was what happened to Khaula bint\\n\\t\\t\\t\\tThalaba, wife of Aus son of Samit. Though in Islam, he\\n\\t\\t\\t\\tdivorced her by an old Pagan custom: the formula was\\n\\t\\t\\t\\tknown as Zihar, and consisted of the words \"Thou art to\\n\\t\\t\\t\\tme as the back of my mother\". This was hold by Pagan\\n\\t\\t\\t\\tcustom to imply a divorce and freed the husband from any\\n\\t\\t\\t\\tresponsibility for conjugal duties. Such a custom was in\\n\\t\\t\\t\\tany case degrading to a woman. It was particularly hard\\n\\t\\t\\t\\ton Khaula, for she loved her husband and pleaded that she\\n\\t\\t\\t\\thad little children whom she had no resources herself to\\n\\t\\t\\t\\tsupport. She urged her plea to the Prophet and in prayer\\n\\t\\t\\t\\tto Allah. Her just plea was accepted, and this iniquitous\\n\\t\\t\\t\\tcustom, based on false words, was abolished. See also n.\\n\\t\\t\\t\\t3670 to xxxiii. 4."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "1",
    "NoteID": "5331",
    "Body": "For He is a just God, and will not allow human customs or\\n\\t\\t\\t\\tpretences to trample on the just rights of the weakest of\\n\\t\\t\\t\\tHis creatures."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "2",
    "NoteID": "5332",
    "Body": "See n. 5330 above."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "2",
    "NoteID": "5333",
    "Body": "Such words are false in fact and iniquitous, inasmuch as\\n\\t\\t\\t\\tthey are unfair to the wife and unseemly in decent\\n\\t\\t\\t\\tsociety."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "2",
    "NoteID": "5334",
    "Body": "Cf. iv. 99 and xxii. 60. Were it not that Allah in His\\n\\t\\t\\t\\tMercy makes allowances for our weaknesses and the various\\n\\t\\t\\t\\tgrades of motives that actuate us, such conduct would be\\n\\t\\t\\t\\tinexpiable. But He prescribes expiation as in the next\\n\\t\\t\\t\\tverse, because He wishes to blot out what is wrong and\\n\\t\\t\\t\\tgive us a chance to reform by His forgiveness."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "3",
    "NoteID": "5335",
    "Body": "If Zihar were to be ignored as if the words were never\\n\\t\\t\\t\\tuttered, it would mean that men may foolishly resort to\\n\\t\\t\\t\\tit without penalty. It is therefore recognised in respect\\n\\t\\t\\t\\tof the penalty which the man incurs, but safeguards the\\n\\t\\t\\t\\twoman's rights. She can sue for maintenance for herself.\\n\\t\\t\\t\\tIf it was a hasty act and he repented of it, he could not\\n\\t\\t\\t\\tclaim his conjugal rights until after the performance of\\n\\t\\t\\t\\this penalty as provided below."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "4",
    "NoteID": "5336",
    "Body": "Cf. iv. 92. The penalty is: to get a slave his freedom,\\n\\t\\t\\t\\twhether it is your own slave or you purchase his freedom\\n\\t\\t\\t\\tfrom another; if that is not possible, to fast for two\\n\\t\\t\\t\\tmonths consecutively (in the manner of the Ramadhan\\n\\t\\t\\t\\tfast); if that is not possible, to feed sixty poor. See\\n\\t\\t\\t\\tnext note."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "4",
    "NoteID": "5337",
    "Body": "There is a great deal of learned argument among the\\n\\t\\t\\t\\tjurists as to the precise requirements of Canon Law under\\n\\t\\t\\t\\tthe term \"feeding\" the indigent. For example, it is laid\\n\\t\\t\\t\\tdown that half a Sa' of wheat or a full Sa' of dates or\\n\\t\\t\\t\\ttheir equivalent in money would fulfil the requirements,\\n\\t\\t\\t\\ta Sa' being a measure corresponding roughly to about 9\\n\\t\\t\\t\\tlbs. of wheat in weight. Others hold that a Mudd measure\\n\\t\\t\\t\\tequivalent to about 2 1/4 lbs. would be sufficient. This\\n\\t\\t\\t\\twould certainly be nearer the daily ration of a man. It\\n\\t\\t\\t\\tis better to take the spirit of the text in its plain\\n\\t\\t\\t\\tsimplicity, and say that an indigent man should be given\\n\\t\\t\\t\\tenough to eat for two meals a day. The sixty indigent\\n\\t\\t\\t\\tones fed for a day would be equivalent to a single\\n\\t\\t\\t\\tindividual fed for sixty days, or two for thirty days,\\n\\t\\t\\t\\tand so on. But there is no need to go into minutiae in\\n\\t\\t\\t\\tsuch matters."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "4",
    "NoteID": "5338",
    "Body": "These penalties in the alternative are prescribed, that\\n\\t\\t\\t\\twe may show our repentance and Faith and our renunciation\\n\\t\\t\\t\\tof \"iniquity and falsehood\" (verse 2 above), whatever our\\n\\t\\t\\t\\tcircumstances may be."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "6",
    "NoteID": "5340",
    "Body": "This phrase, \"Allah will tell them of their deeds (or\\n\\t\\t\\t\\ttheir doings or their conduct)\" occurs frequently. See v.\\n\\t\\t\\t\\t51, n. 762; v. 108, n. 811; vi. 60; ix. 94; etc. In this\\n\\t\\t\\t\\tlife there is a certain mist or illusion in our spiritual\\n\\t\\t\\t\\tsight. We see things from different angles and dispute\\n\\t\\t\\t\\tabout them; we hide real motives, and pretend to virtues\\n\\t\\t\\t\\twhich we do not possess; others may attribute such\\n\\t\\t\\t\\tvirtues to us, and we may come to believe it ourselves;\\n\\t\\t\\t\\twe conceive likes and hatreds on insufficient grounds; we\\n\\t\\t\\t\\tforget what we should remember, and remember what we\\n\\t\\t\\t\\tshould forget. Our vision is narrow, and our values are\\n\\t\\t\\t\\tfalse. On the Day of Account all this will be remedied.\\n\\t\\t\\t\\tNot only will true values be restored, but we shall\\n\\t\\t\\t\\tourselves see the inwardness of things in our own lives,\\n\\t\\t\\t\\twhich we never saw before."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "7",
    "NoteID": "5341",
    "Body": "Secrecy is a relative and limited term among ourselves.\\n\\t\\t\\t\\tThere is nothing hidden or unknown to Allah. Usually\\n\\t\\t\\t\\tsecrecy implies fear or distrust, plotting or\\n\\t\\t\\t\\twrong-doing. But all is open before Allah's sight."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "8",
    "NoteID": "5342",
    "Body": "When the Muslim Brotherhood was acquiring strength in\\n\\t\\t\\t\\tMadinah and the forces of disruption were being\\n\\t\\t\\t\\tdiscomfited in open fight against the Messenger of\\n\\t\\t\\t\\tRighteousness, the wicked resorted to duplicity and\\n\\t\\t\\t\\tsecret intrigues, in which the ringleaders were the\\n\\t\\t\\t\\tdisaffected Jews and the Hypocrites, whose machinations\\n\\t\\t\\t\\thave been frequently referred to in the Qur-an. E.g. see\\n\\t\\t\\t\\tii. 8-16; and iv. 142-145."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "8",
    "NoteID": "5343",
    "Body": "The salutation of Allah was (and is) \"Peace!\" But the\\n\\t\\t\\t\\tenemies, who had not the courage to fight openly often\\n\\t\\t\\t\\ttwisted the words, and by using a word like \"Sam\", which\\n\\t\\t\\t\\tmeant \"Death!\" or \"Destruction!\" instead of \"Salam!\"\\n\\t\\t\\t\\t(Peace!), they thought they were secretly venting their\\n\\t\\t\\t\\tspite and yet apparently using a polite form of\\n\\t\\t\\t\\tsalutation. Cf. ii. 106, and n. 107, where another\\n\\t\\t\\t\\tsimilar trick is exposed."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "8",
    "NoteID": "5344",
    "Body": "The enemies derisively enjoyed their trick (see last\\n\\t\\t\\t\\tnote) according to their own perverted mentality. They\\n\\t\\t\\t\\tasked blasphemously, \"Why does not Allah punish us?\" The\\n\\t\\t\\t\\tanswer is given: there is a Punishment, far greater than\\n\\t\\t\\t\\tthey imagine: it will come in good time: it will be the\\n\\t\\t\\t\\tfinal Punishment after Judgment: it is delayed in order\\n\\t\\t\\t\\tto give them a chance of repentance and reformation."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "9",
    "NoteID": "5345",
    "Body": "Ordinarily secrecy implies deeds of darkness, something\\n\\t\\t\\t\\twhich men have to hide; see the next verse. But there are\\n\\t\\t\\t\\tgood deeds which may be concerted and done in secret:\\n\\t\\t\\t\\te.g., charity, or the prevention of mischief, or the\\n\\t\\t\\t\\tdefeat of the dark plots of evil. The determining factor\\n\\t\\t\\t\\tis the motive. Is the man doing some wrong or venting his\\n\\t\\t\\t\\tspite, or trying to disobey a lawful command? Or is he\\n\\t\\t\\t\\tdoing some good, which out of modesty or\\n\\t\\t\\t\\tself-renunciation he does not want known, or is he in a\\n\\t\\t\\t\\trighteous cause defeating the machinations of Evil, which\\n\\t\\t\\t\\tmay involve great sacrifice of himself.?"
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "10",
    "NoteID": "5346",
    "Body": "Evil can harm no one who is good, except in so far as (1)\\n\\t\\t\\t\\tthere is some question of trial in Allah's Universal\\n\\t\\t\\t\\tPlan, or (2) what appears to be harm may be real good.\\n\\t\\t\\t\\tNothing happens without Allah's will and permission. And\\n\\t\\t\\t\\twe must always trust Him, and not our cleverness or any\\n\\t\\t\\t\\tadventitious circumstances that draw us the least bit\\n\\t\\t\\t\\tfrom the path of rectitude."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "11",
    "NoteID": "5347",
    "Body": "Even when a great man or a Leader comes into an Assembly,\\n\\t\\t\\t\\twe are not to press forward without discipline, as it\\n\\t\\t\\t\\tcauses inconvenience to him and detriment to public\\n\\t\\t\\t\\tbusiness. Nor are we to shut out other people who have\\n\\t\\t\\t\\tequal rights to be in the Assembly. We must spread out,\\n\\t\\t\\t\\tfor Allah's earth is spacious, and so are our\\n\\t\\t\\t\\topportunities."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "11",
    "NoteID": "5348",
    "Body": "\"Rise up\" here may imply: 'when the Assembly is\\n\\t\\t\\t\\tdismissed, do not loiter about'."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "11",
    "NoteID": "5349",
    "Body": "Faith makes all people equal in the Kingdom of Allah, as\\n\\t\\t\\t\\tregards the essentials of citizenship in the Kingdom. But\\n\\t\\t\\t\\tthere is leadership, and rank and degree, joined with\\n\\t\\t\\t\\tgreater or less responsibility, and that depends on true\\n\\t\\t\\t\\tknowledge and insight."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "12",
    "NoteID": "5350",
    "Body": "In the Kingdom of Allah all instruction or consultation\\n\\t\\t\\t\\tis open and free. But human nature is weak. And people\\n\\t\\t\\t\\twant special instruction or private consultation with the\\n\\t\\t\\t\\tProphet from one of several motives: (1) they may have,\\n\\t\\t\\t\\tor think they have, a special case, which they are not\\n\\t\\t\\t\\twilling to disclose to their brethren in general; (2)\\n\\t\\t\\t\\tthey may have some sense of delicacy or dignity, which\\n\\t\\t\\t\\tcan only be satisfied by a private interview; (3) they\\n\\t\\t\\t\\tmay even be selfish enough to want to monopolise the\\n\\t\\t\\t\\tProphet's time. These motives are, in an ascending order,\\n\\t\\t\\t\\tworth discouraging; and yet, considering the weakness of\\n\\t\\t\\t\\thuman nature, they cannot be reprobated to the extent of\\n\\t\\t\\t\\tshutting out their victims from chances of improvement.\\n\\t\\t\\t\\tIt is therefore recommended that they spend something in\\n\\t\\t\\t\\tcharity for the good of their poorer brethren before they\\n\\t\\t\\t\\tindulge in such weaknesses."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "12",
    "NoteID": "5351",
    "Body": "The charity is a sort of expiation for their pardonable\\n\\t\\t\\t\\tweakness. Having made some monetary sacrifice for their\\n\\t\\t\\t\\tpoorer brethren they could face them with less shame, and\\n\\t\\t\\t\\tthe charity would direct their attention to the need for\\n\\t\\t\\t\\tpurifying their motives and conduct. At the same time,\\n\\t\\t\\t\\tthis special charity is not made obligatory, lest such\\n\\t\\t\\t\\tpersons should be shut out altogether from chances of the\\n\\t\\t\\t\\thigher teaching on account of their pardonable foibles."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "13",
    "NoteID": "5352",
    "Body": "Note the plural here, Sadaqat, instead of the singular,\\n\\t\\t\\t\\tSadaqat in verse 12 above. While people with the foibles\\n\\t\\t\\t\\tdescribed in n. 5350 may be willing to spend \"something\"\\n\\t\\t\\t\\t(small) in charity for a special consultation\\n\\t\\t\\t\\toccasionally, they may be frightened of spending large\\n\\t\\t\\t\\tsums when their needs for consultation may be numerous.\\n\\t\\t\\t\\tWhat is to be done then? Are they to be shut out\\n\\t\\t\\t\\taltogether? No. They are asked to be punctilious in the\\n\\t\\t\\t\\tdischarge of their normal duties of at least normal\\n\\t\\t\\t\\tregular prayers and regular charity, \"if Allah forgives\\n\\t\\t\\t\\tyou\", i.e., if Allah's Messenger relieves them of further\\n\\t\\t\\t\\tspecial contributions such as those noted in verse 12.\\n\\t\\t\\t\\tThis condition, \"if Allah forgives you\", provides the\\n\\t\\t\\t\\tsafeguard against the abuse of the privilege. The\\n\\t\\t\\t\\tmessenger would know in each case what is best for the\\n\\t\\t\\t\\tindividual and for the community."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "13",
    "NoteID": "5353",
    "Body": "Zakat, was instituted about A.H. 2."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "14",
    "NoteID": "5354",
    "Body": "This refers to the Hypocrites of Madinah who pretended to\\n\\t\\t\\t\\tbe in Islam but intrigued with the Jews. See references\\n\\t\\t\\t\\tas given in n. 5342 above."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "14",
    "NoteID": "5355",
    "Body": "By this time the Jews of Madinah and the Jewish tribes\\n\\t\\t\\t\\taround had become actively hostile to Islam, and were\\n\\t\\t\\t\\tbeing sharply called to account for their treachery."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "14",
    "NoteID": "5356",
    "Body": "They knew that as Muslims their duty was to refrain from\\n\\t\\t\\t\\tthe intrigues of the enemies of Islam and to assist Islam\\n\\t\\t\\t\\tagainst them."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "16",
    "NoteID": "5357",
    "Body": "A false man, by swearing that he is true, makes his\\n\\t\\t\\t\\tfalsehood all the more heinous. He stands in the way of\\n\\t\\t\\t\\tother people accepting Truth. He gives a handle to the\\n\\t\\t\\t\\tcynics and the sceptics."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "17",
    "NoteID": "5358",
    "Body": "They may arrogantly boast of riches of alliances and\\n\\t\\t\\t\\tfollowers in man-power. But what are such worldly\\n\\t\\t\\t\\tadvantages before the Throne of the Disposer of all\\n\\t\\t\\t\\tevents? They must come to utter misery."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "18",
    "NoteID": "5359",
    "Body": "When Judgment is established, and before they the Truth,\\n\\t\\t\\t\\tthey may think (as now) that some oaths or excuses will\\n\\t\\t\\t\\tsave them. But they have not now-much less will they have\\n\\t\\t\\t\\tthen-any footing to stand upon. Falsehood is falsehood,\\n\\t\\t\\t\\tand must perish. They must learn the worthlessness of\\n\\t\\t\\t\\ttheir falsehood."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "19",
    "NoteID": "5360",
    "Body": "Man's original nature as created by Allah is good (xxx.\\n\\t\\t\\t\\t30, and n. 3541). It is because man, in spite of the\\n\\t\\t\\t\\twarnings he has received, allows Evil to get the mastery\\n\\t\\t\\t\\tover him, that man forgets Allah and the divine qualities\\n\\t\\t\\t\\twhich Allah give him. The result of the perversion is\\n\\t\\t\\t\\tthat man becomes a partisan of Evil, and as such dooms\\n\\t\\t\\t\\thimself to perdition."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "20",
    "NoteID": "5361",
    "Body": "There are various degrees of humiliation in the final\\n\\t\\t\\t\\tstate in the next world. But the worst is the humiliation\\n\\t\\t\\t\\tof being numbered among those who ignominiously attempted\\n\\t\\t\\t\\tto resist the Irresistible."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "21",
    "NoteID": "5362",
    "Body": "For the meaning of Aziz, see n. 2818 to xxii. 40."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "22",
    "NoteID": "5363",
    "Body": "If any one believes in Allah and His goodness and\\n\\t\\t\\t\\tjustice, and in the Hereafter, in which all true values\\n\\t\\t\\t\\twill be restored he will never love evil or wrong-doing\\n\\t\\t\\t\\tor rebellion against Allah, even if these things are\\n\\t\\t\\t\\tfound in his nearest kith and kin."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "22",
    "NoteID": "5364",
    "Body": "Faith in Allah is indelibly written on the tablets of\\n\\t\\t\\t\\ttheir hearts and they can never be false to Allah."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "22",
    "NoteID": "5365",
    "Body": "Cf. ii. 87 and 253, where it is said that Allah\\n\\t\\t\\t\\tstrengthened the Prophet Jesus with the holy spirit. Here\\n\\t\\t\\t\\twe learn that all good and righteous men are strengthened\\n\\t\\t\\t\\tby Allah. If anything, the phrase used here is stronger:\\n\\t\\t\\t\\t\"a spirit from Himself\". Whenever any one offers his\\n\\t\\t\\t\\theart in faith and purity to Allah, Allah accepts it,\\n\\t\\t\\t\\tengraves that Faith on the seeker's heart, and further\\n\\t\\t\\t\\tfortifies him with his help which we can no more define\\n\\t\\t\\t\\tadequately than we can define in human language the\\n\\t\\t\\t\\tnature and attributes of Allah."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "22",
    "NoteID": "5366",
    "Body": "Again we have the doctrine of Allah's Good Pleasure as\\n\\t\\t\\t\\tthe highest goal of man, the spiritual heaven which he\\n\\t\\t\\t\\tachieves by a life of purity and faith. He not only\\n\\t\\t\\t\\tattains Allah's Good Pleasure as the crown of his\\n\\t\\t\\t\\tfelicity, but his own nature is so far transformed to the\\n\\t\\t\\t\\tpattern of Allah's original creation that his own good\\n\\t\\t\\t\\tpleasure is in nothing but in Allah's Good Pleasure. The\\n\\t\\t\\t\\tmutual good pleasure shows the heights to which man can\\n\\t\\t\\t\\tattain."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "22",
    "NoteID": "5367",
    "Body": "This is in antithesis to the Party of the Satan,\\n\\t\\t\\t\\tmentioned in verse 19 above. The Party of Evil will\\n\\t\\t\\t\\tperish, but while it has its run in the scheme of the\\n\\t\\t\\t\\tpresent world, the Party of Truth and Reality may be\\n\\t\\t\\t\\trightly called the Party of Allah, even though all\\n\\t\\t\\t\\tCreation is Allah's in another sense."
  }
]
