[
  {
    "SurahNumber": "1",
    "AyahFrom": "0",
    "AyahTo": "NULL",
    "AyahText": "<ayahtext>Introduction</ayahtext>",
    "Text": "<note id=\"0\">\r\\n<H1 CLASS=\"heading-2-western\">Name</H1> <P>This Surah is named Al-Fatihah because of its subject-matter. Fatihah is that which opens a subject or a book or any other thing. In other words, Al-Fatihah is a sort of preface.  </P> <H1 CLASS=\"heading-2-western\">Period of Revelation</H1> <P>It is one of the very earliest Revelations to the Holy Prophet. As a matter of fact, we learn from authentic Traditions that it was the first complete Surah which was revealed to Muhammad (Allah's peace be upon him). Before this, only a few miscellaneous verses were revealed which form parts of `Alaq, Muzzammil, Muddaththir, etc.  </P> <H1 CLASS=\"heading-2-western\">Theme</H1> <P>This Surah is in fact a prayer which Allah has taught to all those who want to make a study of His book. It has been placed at the very beginning of the book to teach this lesson to the reader: if you sincerely want to benefit from the Quran, you should offer this prayer to the Lord of the Universe.  </P> <P>This preface is meant to create a strong desire in the heart of the reader to seek guidance from the Lord of the Universe, Who alone can grant it. Thus Al-Fatihah indirectly teaches that the best thing for a man is to pray for guidance to the straight path, to study the Quran with the mental attitude of a seeker- after-truth and to recognize the fact that the Lord of the Universe is the source of all knowledge. He should, therefore, begin the study of the Quran with a prayer to him for guidance.  </P> <P>From this theme, it becomes clear that the real relation between Al-Fatihah and the Quran is not that of an introduction to a book but that of a prayer and its answer. Al-Fatihah is the prayer from the servant and the Quran is the answer from the Master to his prayer. The servant prays to Allah to show him guidance and the Master places the whole of the Quran before him in answer to his prayer, as if to say, &quot;This is the Guidance you begged from Me.&quot;  </P>\r\\n\\t\\t\\t</note>"
  },
  {
    "SurahNumber": "1",
    "AyahFrom": "1",
    "AyahTo": "3",
    "AyahText": "<ayahtext>\\n<P>\\n<A NAME=\"sdfootnote1anc\"></A><A NAME=\"sdfootnote2anc\"></A><A NAME=\"sdfootnote3anc\"></A><A NAME=\"sdfootnote4anc\"></A><A NAME=\"sdfootnote5anc\"></A> [1-3] In the name of Allah, the Compassionate, the Merciful.<A HREF=\"#sdfootnote1sym\"><SUP>1</SUP></A> Praise is only for Allah,<A HREF=\"#sdfootnote2sym\"><SUP>2</SUP></A> the Lord of the Universe,<A HREF=\"#sdfootnote3sym\"><SUP>3</SUP></A> the All-Compassionate, the All-Merciful,<A HREF=\"#sdfootnote4sym\"><SUP>4</SUP></A> the Master of the Day of Judgment.<A HREF=\"#sdfootnote5sym\"><SUP>5</SUP></A>\\n</P> <P ALIGN=\"RIGHT\"><A NAME=\"_x0000_i1028\"></A></P> <P ALIGN=\"RIGHT\"><A NAME=\"_x0000_i1029\"></A></P> <P ALIGN=\"RIGHT\"><A NAME=\"_x0000_i1030\"></A></P> <P ALIGN=\"RIGHT\"><A NAME=\"_x0000_i1031\"></A></P> \\n\\t\\t\\t</ayahtext>\\n",
    "Text": "<note id=\"1\">\\n<DIV ID=\"sdfootnote1\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote1sym\"></A> <A HREF=\"#sdfootnote1anc\">1</A>Islamic culture requires a man to commence everything with the name of Allah. If this is done consciously and sincerely, it will surely produce three good results. First, it will keep him away from evil, because the very name of Allah will impel him to consider whether he is justified in associating His name with a wrong deed or an evil intention. Secondly, the very mention of the name of Allah will create in him the right attitude of mind and direct him to the right direction. Thirdly,he will receive Allah's help and blessing and will be protected from the temptations of Satan, for Allah turns to a man when he turns to Him.</P> </DIV> \\n<DIV ID=\"sdfootnote2\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote2sym\"></A> <A HREF=\"#sdfootnote2anc\">2</A>It has been stated in the Introduction to this Surah that AI-Fatihah is a prayer. It begins with the praise of Allah to Whom it is addressed in order to teach us the right way of making a supplication. We should not put forward our request bluntly and abruptly without an appropriate introduction. The right way is to acknowledge the excellences and the favors and the high position of the One to Whom we address our prayer. That is why we begin our prayer with the praise of Allah, for He is the perfection of all excellences and .is also our Benefactor. We pay homage to Allah to show that we sincerely acknowledge His excellences and also are grateful to Him for His countless favours. It should also be noted that not only Praise is for Allah but also Praise is only for Allah. This distinction is very important because it cuts at the root of the worship of any of His creation. As none of them is worthy of praise, none is worthy of worship. No man, no angel, no prophet, no so-called god, no star, no idol, in short. none of His creation inherently possesses any good quality. If one has any, it is given by Allah. Hence the Creator of these qualities alone deserves devotion, worship, gratitude, and none of His creation.</P> </DIV> \\n<DIV ID=\"sdfootnote3\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote3sym\"></A> <A HREF=\"#sdfootnote3anc\">3</A>The word Rab which has been translated into `Lord' stands for (a) Master and Owner, (b) Sustainer, Provider and Guardian, (c) Sovereign, Ruler, Administrator and Organizer. Allah is the Lord of the Universe in all these senses.</P> </DIV> \\n<DIV ID=\"sdfootnote4\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote4sym\"></A> <A HREF=\"#sdfootnote4anc\">4</A>Although the Arabic word Rahman itself is in the superlative form and denotes the attributes of beneficence and mercy in the highest degree, even this word fails to express the boundless extent of these attributes of Allah. Hence another word Rahim of the same root has been added to make up for the deficiency.</P> </DIV> \\n<DIV ID=\"sdfootnote5\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote5sym\"></A> <A HREF=\"#sdfootnote5anc\">5</A>After saying that Allah is Beneficent and Merciful, it has immediately been added that He is the Master of the Day of Judgment, so that the qualities of mercy and kindness might not mislead anyone into forgetting that on that Day He will gather together all human beings from the first to the last and require each and every one to give an account of all of one's acts to Him. A Muslim should, therefore, always keep in view the fact that Allah is not only Merciful, but He is also Just. He has, however, full authority to pardon or punish anyone He pleases, for He has complete power over everything. Therefore we should have full conviction that it lies absolutely in His power to make our end happy or sorrowful.</P> </DIV> \\n\\t\\t\\t</note>"
  },
  {
    "SurahNumber": "1",
    "AyahFrom": "4",
    "AyahTo": "7",
    "AyahText": "<ayahtext>\\n<P>\\n<A NAME=\"sdfootnote6anc\"></A><A NAME=\"sdfootnote7anc\"></A><A NAME=\"sdfootnote8anc\"></A><A NAME=\"sdfootnote9anc\"></A><A NAME=\"sdfootnote10anc\"></A> [4-7] Thee alone we worship<A HREF=\"#sdfootnote6sym\"><SUP>6</SUP></A> and to Thee alone we pray for help.<A HREF=\"#sdfootnote7sym\"><SUP>7</SUP></A> Show us the straight way,<A HREF=\"#sdfootnote8sym\"><SUP>8</SUP></A> the way of those whom Thou hast blessed;<A HREF=\"#sdfootnote9sym\"><SUP>9</SUP></A> who have not incurred Thy wrath, nor gone astray.<A HREF=\"#sdfootnote10sym\"><SUP>10</SUP></A>\\n</P> \\n\\t\\t\\t</ayahtext>\\n",
    "Text": "<note id=\"2\">\\n<DIV ID=\"sdfootnote6\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote6sym\"></A> <A HREF=\"#sdfootnote6anc\">6</A>The Arabic word ibadat is used in three senses: (a)worship and devotion, (b) submission and obedience, (c) subjection and servitude. Here it implies all the three, that is, We are Thy worshipers, Thy subjects and Thy slaves and We keep these relations with Thee and Thee alone and &quot;We make none else the object of our worship in all the three senses.&quot;</P> </DIV> \\n<DIV ID=\"sdfootnote7\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote7sym\"></A> <A HREF=\"#sdfootnote7anc\">7</A>It means, We ask for Thy help because we know that Thou art the Lord of the whole Universe and Thou hast all powers and Thou art the Master of every thing. Therefore we turn to Thee for help for the fulfillment of our needs and requirements.</P> </DIV> \\n<DIV ID=\"sdfootnote8\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote8sym\"></A> <A HREF=\"#sdfootnote8anc\">8</A>That is, &quot;Show us that way which may lead us aright in every walk of life and keep us absolutely free from errors and evil consequences and bring us success in the end.&quot; , This is the request which the servant of Allah makes to Him when he begins the study of the Qur'an. He prays to Him to guide him in every walk of life and save him from the labyrinths of doubt and uncertainty, which result from the lack of true knowledge. The servant also requests the Master to show him the right and the straight way of life from among the many by-paths and crooked ways.</P> </DIV> \\n<DIV ID=\"sdfootnote9\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote9sym\"></A> <A HREF=\"#sdfootnote9anc\">9</A>The straight way for which we are praying is the way which has always been followed by the people favored by Thee and which has always brought Thy favors and blessings.</P> </DIV> \\n<DIV ID=\"sdfootnote10\" DIR=\"LTR\"> <P CLASS=\"sdfootnote-western\">\\n<A NAME=\"sdfootnote10sym\"></A> <A HREF=\"#sdfootnote10anc\">10</A>This is to show that the favored people are not those who go astray and incur the wrath of Allah, though apparently they might be enjoying the transitory good things of life. The really favored people are those who receive blessings on account of their righteous living. From this it also becomes clear that by favors are meant those real and permanent rewards, which result from righteous living and from winning the pleasure of Allah, and not those transitory good things of life which have been enjoyed even by the tyrants and worshipers of mammon and which are being enjoyed even today by all sorts of evildoers who have gone astray from the straight way.</P> </DIV> \\n\\t\\t\\t</note>"
  }
]
