[
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "1",
    "Text": "O Prophet! Why do you prohibit &#761;yourself&#762; from what Allah has made lawful to you, seeking to please your wives? And Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "2",
    "Text": "Allah has already ordained for you &#761;believers&#762; the way to absolve yourselves from your oaths.<span class='fn' foot_note=29987>1</span>&nbsp;For Allah is your Guardian. And He is the All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "3",
    "Text": "&#761;Remember&#762; when the Prophet had &#761;once&#762; confided something to one of his wives, then when she disclosed it &#761;to another wife&#762; and Allah made it known to him, he presented &#761;to her&#762; part of what was disclosed and overlooked a part. So when he informed her of it, she exclaimed, &ldquo;Who told you this?&rdquo; He replied, &ldquo;I was informed by the All-Knowing, All-Aware.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "4",
    "Text": "&#761;It will be better&#762; if you &#761;wives&#762; both turn to Allah in repentance, for your hearts have certainly faltered. But if you &#761;continue to&#762; collaborate against him, then &#761;know that&#762; Allah Himself is his Guardian. And Gabriel, the righteous believers, and the angels are &#761;all&#762; his supporters as well."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "5",
    "Text": "Perhaps, if he were to divorce you &#761;all&#762;, his Lord would replace you with better wives who are submissive &#761;to Allah&#762;, faithful &#761;to Him&#762;, devout, repentant, dedicated to worship and fasting&mdash;previously married or virgins."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "6",
    "Text": "O believers! Protect yourselves and your families from a Fire whose fuel is people and stones, overseen by formidable and severe angels, who never disobey whatever Allah orders&mdash;always doing as commanded."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "7",
    "Text": "&#761;The deniers will then be told,&#762; &ldquo;O disbelievers! Make no excuses this Day! You are only rewarded for what you used to do.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "8",
    "Text": "O believers! Turn to Allah in sincere repentance, so your Lord may absolve you of your sins and admit you into Gardens, under which rivers flow, on the Day Allah will not disgrace the Prophet or the believers with him. Their light will shine ahead of them and on their right. They will say, &ldquo;Our Lord! Perfect our light for us, and forgive us. &#761;For&#762; You are truly Most Capable of everything.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "9",
    "Text": "O Prophet! Struggle against the disbelievers and the hypocrites, and be firm with them. Hell will be their home. What an evil destination!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "10",
    "Text": "Allah sets forth an example for the disbelievers: the wife of Noah and the wife of Lot. Each was married to one of Our righteous servants, yet betrayed them.<span class='fn' foot_note=29988>1</span>&nbsp;So their husbands were of no benefit to them against Allah whatsoever. Both were told, &ldquo;Enter the Fire, along with the others!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "11",
    "Text": "And Allah sets forth an example for the believers: the wife of Pharaoh, who prayed, &ldquo;My Lord! Build me a house in Paradise near You, deliver me from Pharaoh and his &#761;evil&#762; doing, and save me from the wrongdoing people.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "66",
    "AyahNumber": "12",
    "Text": "&#761;There is&#762; also &#761;the example of&#762; Mary, the daughter of &rsquo;Imr&acirc;n, who guarded her chastity, so We breathed into her &#761;womb&#762; through Our angel &#761;Gabriel&#762;.<span class='fn' foot_note=29989>1</span>&nbsp;She testified to the words of her Lord and His Scriptures, and was one of the &#761;sincerely&#762; devout."
  }
]
