[
  {
    "SurahNumber": "75",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "By \"calling it to witness\", i.e., by speaking of the Day\\n\\t\\t\\t\\tof Resurrection as if it had already occurred, the above\\n\\t\\t\\t\\tphrase is meant to convey the certainty of its coming."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "Lit., \"the [self-]reproaching soul\": i.e., man's\\n\\t\\t\\t\\tsubconscious awareness of his own shortcomings and\\n\\t\\t\\t\\tfailings."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "9",
    "NoteID": "3",
    "Body": "I.e., in their loss of light, or in the moon's colliding\\n\\t\\t\\t\\twith the sun."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "13",
    "NoteID": "4",
    "Body": "Lit., \"what he has sent ahead and left behind\", i.e.,\\n\\t\\t\\t\\twhatever good and bad deeds he committed or omitted\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "15",
    "NoteID": "5",
    "Body": "Cf.  24:24 ,  36:65  or {41:2-22}."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "16",
    "NoteID": "6",
    "Body": "Lit. \"Move not thy tongue therewith so that thou might\\n\\t\\t\\t\\thasten it\" - the pronoun undoubtedly referring to the\\n\\t\\t\\t\\tcontents of revelation. In order to understand this\\n\\t\\t\\t\\tparenthetic passage (verses {16-19}) more fully, one\\n\\t\\t\\t\\tshould read it side by side with the related passage in\\n\\t\\t\\t\\t 20:114 , together with the corresponding note [101].\\n\\t\\t\\t\\tBoth these passages are in the first instance addressed\\n\\t\\t\\t\\tto the Prophet, who is said to have been afraid that he\\n\\t\\t\\t\\tmight forget some of the revealed words unless he\\n\\t\\t\\t\\trepeated them at the very moment of revelation; but both\\n\\t\\t\\t\\thave also a wider import inasmuch as they apply to every\\n\\t\\t\\t\\tbeliever who reads, listens to or studies the Qur'an. In\\n\\t\\t\\t\\t 20:114  we are told not to draw hasty - and therefore\\n\\t\\t\\t\\tpotentially erroneous - conclusions from isolated verses\\n\\t\\t\\t\\tor statements of the Qur'an, since only the study of the\\n\\t\\t\\t\\twhole of its message can give us a correct insight. The\\n\\t\\t\\t\\tpresent passage, on the other hand, lays stress on the\\n\\t\\t\\t\\tneed to imbibe the divine writ slowly, patiently, to give\\n\\t\\t\\t\\tfull thought to the meaning of every word and phrase, and\\n\\t\\t\\t\\tto avoid the kind of haste which is indistinguishable\\n\\t\\t\\t\\tfrom mechanical glibness, and which, moreover, induces\\n\\t\\t\\t\\tthe person who reads, recites or listens to it to remain\\n\\t\\t\\t\\tsatisfied with the mere beautiful sound of the Qur'anic\\n\\t\\t\\t\\tlanguage without understanding - or even paying adequate\\n\\t\\t\\t\\tattention to - its message."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "17",
    "NoteID": "7",
    "Body": "I.e., \"it is for Us to make thee remember it and to cause\\n\\t\\t\\t\\tit to be read with mind and heart\". As pointed out in the\\n\\t\\t\\t\\tpreceding note, the Qur'an can be understood only if it\\n\\t\\t\\t\\tis read thoughtfully, as one integral whole, and not as a\\n\\t\\t\\t\\tmere collection of moral maxims, stories or disjointed\\n\\t\\t\\t\\tlaws."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "18",
    "NoteID": "8",
    "Body": "Lit., \"follow thou its recitation\", i.e., its message as\\n\\t\\t\\t\\texpressed in words. Since it is God who reveals the\\n\\t\\t\\t\\tQur'an and bestows upon man the ability to understand it,\\n\\t\\t\\t\\tHe attributes its \"recitation\" to Himself."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "19",
    "NoteID": "9",
    "Body": "I.e., if the Qur'an is read \"as it ought to be read\" (see\\n\\t\\t\\t\\tnote [7] above), it becomes - as stressed by Muhammad\\n\\t\\t\\t\\t'Abduh - \"its own best commentary\"."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "27",
    "NoteID": "10",
    "Body": "Lit., \"Who is a wizard [or \"a charmer\"]?\" A similar\\n\\t\\t\\t\\tconstruction is found in  28:71  and {72}."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "29",
    "NoteID": "11",
    "Body": "Lit., \"when shank is wrapped around shank\" - an idiomatic\\n\\t\\t\\t\\tphrase denoting \"the affliction of the present state of\\n\\t\\t\\t\\texistence...combined with that of the final state\" (Lane\\n\\t\\t\\t\\tIV, 1471, quoting both the Qamus and the Taj al-'Arus).\\n\\t\\t\\t\\tAs pointed out by Zamakhshari, the noun saq (lit.,\\n\\t\\t\\t\\t\"shank\") is often used metaphorically in the sense of\\n\\t\\t\\t\\t\"difficulty\", \"hardship\" or \"vehemence\" (shiddah); hence\\n\\t\\t\\t\\tthe well-known phrase, qamat al-harb 'ala saq, \"the war\\n\\t\\t\\t\\tbroke out with vehemence\" (Taj al-'Arus)."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "30",
    "NoteID": "12",
    "Body": "Lit., \"towards thy Sustainer will be the driving\", i.e.,\\n\\t\\t\\t\\twith belated repentance (see next three verses). The\\n\\t\\t\\t\\tphrase rendered above as \"at the time\" reads, literally,\\n\\t\\t\\t\\t\"on that day\"; but the term yawm is often used\\n\\t\\t\\t\\tidiomatically in the sense of \"time\" regardless of its\\n\\t\\t\\t\\tduration."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "31",
    "NoteID": "13",
    "Body": "This interpolation, necessary for a full understanding of\\n\\t\\t\\t\\tthe sequence, is based on {4:17-18}, which has a definite\\n\\t\\t\\t\\tbearing on the above passage."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "33",
    "NoteID": "14",
    "Body": "Lit., \"to his people\": i.e., to the arrogant belief,\\n\\t\\t\\t\\trooted in the materialism of his social environments that\\n\\t\\t\\t\\tman is \"self-sufficient\" and, therefore, not in need of\\n\\t\\t\\t\\tany divine guidance (cf.  96:6 )."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "36",
    "NoteID": "15",
    "Body": "I.e., without being held morally responsible for his\\n\\t\\t\\t\\tdoings."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "38",
    "NoteID": "16",
    "Body": "For this rendering of sawwa, see note [1] on  87:2  and\\n\\t\\t\\t\\tnote [5] on  91:7 . The stress on God's creating man\\n\\t\\t\\t\\tafter he had been a germ-cell is a metonym for His\\n\\t\\t\\t\\tendowing the (originally) lowly organism with what is\\n\\t\\t\\t\\tdescribed as a \"soul\"."
  }
]
