[
  {
    "SurahNumber": "73",
    "AyahNumber": "1",
    "Text": "O Muzzammil (folded in garments - one of the nick names of the\\n\\t\\t\\tProphet Muhammad)!"
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "2",
    "Text": "Stand in prayers at night, but not the whole night,"
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "3",
    "Text": "half of it or a little less,"
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "4",
    "Text": "or a little more; and recite the Qur'an with measured tone."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "5",
    "Text": "Soon We are going to send you a weighty message."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "6",
    "Text": "Surely the getting up at night for prayer is most effective for\\n\\t\\t\\tcontrolling the self and most suitable for reciting the Qur'an as\\n\\t\\t\\twell;"
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "7",
    "Text": "because, during the day you are hard pressed with worldly\\n\\t\\t\\taffairs."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "8",
    "Text": "Remember the name of your Rabb and devote yourself to Him\\n\\t\\t\\texclusively."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "9",
    "Text": "He is the Rabb of the east and the west: there is no god but Him,\\n\\t\\t\\ttherefore, take Him as your Protector."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "10",
    "Text": "Bear patiently with what they say and leave their company in a\\n\\t\\t\\tpolite manner."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "11",
    "Text": "Let me deal with rejecters who are enjoying the comforts of this\\n\\t\\t\\tlife, so put up with them for a while."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "12",
    "Text": "We have in store for them heavy fetters and a blazing fire,"
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "13",
    "Text": "choking food and a painful punishment."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "14",
    "Text": "On the day when the earth with all it's mountains will be in a\\n\\t\\t\\tviolent commotion, and the mountains will crumble into heaps of\\n\\t\\t\\tshifting sand."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "15",
    "Text": "O mankind, We have sent towards you a Rasool, to bear witness for\\n\\t\\t\\tyou or against you, as We sent a Rasool towards Fir'on (Pharaoh)\\n\\t\\t\\tbefore you."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "16",
    "Text": "Fir'on disobeyed Our Rasool; so We seized him with a firm grip."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "17",
    "Text": "If you persist in unbelief, how will you save yourselves on that\\n\\t\\t\\tDay which shall turn the children grey-headed (old),"
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "18",
    "Text": "the heaven shall split asunder, and His promise shall be\\n\\t\\t\\tfulfilled?"
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "19",
    "Text": "Surely this is but a reminder, so let him who wills, take the\\n\\t\\t\\tRight way to His Rabb."
  },
  {
    "SurahNumber": "73",
    "AyahNumber": "20",
    "Text": "Surely your Rabb knows that you stand in prayers nearly two-\\n\\t\\t\\tthirds of the night, and sometimes one-half or one-third of it,\\n\\t\\t\\tso do others among your companions. Allah has the measures of the\\n\\t\\t\\tnight and the day. He knows that you will not be able to keep it\\n\\t\\t\\tup, so He has turned to you in Mercy, therefore, read from the\\n\\t\\t\\tQur'an as much as you easily can. He knows that there may be some\\n\\t\\t\\tsick people among you, and some others who travel through the\\n\\t\\t\\tland to seek Allah's bounty; and yet some others fighting for the\\n\\t\\t\\tcause of Allah. Therefore, read as much of the Qur'an as you\\n\\t\\t\\teasily can. Establish the Salah (five time daily prayers) and pay\\n\\t\\t\\tthe Zakah (poor due), and give to Allah a goodly loan. Whatever\\n\\t\\t\\tgood you will send forth for yourselves, you will find it with\\n\\t\\t\\tAllah, which will be much better and greater in reward. Seek\\n\\t\\t\\tAllah's forgiveness, surely Allah is Oft-Forgiving, Most\\n\\t\\t\\tMerciful."
  }
]
