[
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "1",
    "sectionHeading": "Mention of Iltikaf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr from Amra bint Abd ar-Rahman that A'isha,\\n\\t\\t\\t\\tthe wife of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, said,\"When the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, did itikaf he would bring\\n\\t\\t\\t\\this head near to me and I would comb it. He would only go\\n\\t\\t\\t\\tinto the house to relieve himself.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "2",
    "sectionHeading": "Mention of Iltikaf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Amra\\n\\t\\t\\t\\tbint Abd ar-Rahman that when A'isha was doing itikaf she\\n\\t\\t\\t\\twould only ask after sick people if she was walking and\\n\\t\\t\\t\\tnot if she was standing still.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A person doing itikaf should not carry out\\n\\t\\t\\t\\tobligations of his, nor leave the mosque for them, nor\\n\\t\\t\\t\\tshould he help anyone. He should only leave the mosque to\\n\\t\\t\\t\\trelieve himself. If he were able to go out to do things\\n\\t\\t\\t\\tfor people, visiting the sick, praying over the dead and\\n\\t\\t\\t\\tfollowing funeral processions would be the things with\\n\\t\\t\\t\\tthe most claim on his coming out.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A person doing itikaf is not doing itikaf\\n\\t\\t\\t\\tuntil he avoids what some one doing itikaf should avoid,\\n\\t\\t\\t\\tnamely, visiting the sick, praying over the dead, and\\n\\t\\t\\t\\tentering houses, except to relieve himself.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "3",
    "sectionHeading": "Mention of Iltikaf",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had asked Ibn\\n\\t\\t\\t\\tShihab whether someone doing itikaf could go into a house\\n\\t\\t\\t\\tto relieve himself, and he said, \"Yes, there is no harm\\n\\t\\t\\t\\tin that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The situation that we are all agreed upon\\n\\t\\t\\t\\there is that there is no disapproval of anyone doing\\n\\t\\t\\t\\titikaf in a mosque where jumua is held. The only reason I\\n\\t\\t\\t\\tsee for disapproving of doing itikaf in a mosque where\\n\\t\\t\\t\\tjumua is not held is that the man doing itikaf would have\\n\\t\\t\\t\\tto leave the mosque where he was doing itikaf in order to\\n\\t\\t\\t\\tgo to jumua, or else not go there at all. If, however, he\\n\\t\\t\\t\\tis doing itikaf in a mosque where jumua is not held, and\\n\\t\\t\\t\\the does not have to go to jumua in any other mosque, then\\n\\t\\t\\t\\tI see no harm in him doing itikaf there, because Allah,\\n\\t\\t\\t\\tthe Blessed and Exalted, says, 'While you are doing\\n\\t\\t\\t\\titikaf in mosques,' and refers to all mosques in general,\\n\\t\\t\\t\\twithout specifying any particular kind.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik continued, \"Accordingly, it is permissiblefor a man\\n\\t\\t\\t\\tto do itikaf in a mosque where jumua is not held if he\\n\\t\\t\\t\\tdoes not have to leave it to go to a mosque where jumua\\n\\t\\t\\t\\tis held.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A person doing itikaf should spend the night\\n\\t\\t\\t\\tonly in the mosque where he is doing itikaf, except if\\n\\t\\t\\t\\this tent is in one of the courtyards of the mosque. I\\n\\t\\t\\t\\thave never heard that someone doing itikaf can put up a\\n\\t\\t\\t\\tshelter anywhere except in the mosque itself or in one of\\n\\t\\t\\t\\tthe courtyards of the mosque.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tPart of what shows that he must spend the night in the\\n\\t\\t\\t\\tmosque is the saying of A'isha, 'When the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was doing\\n\\t\\t\\t\\titikaf, he would only go into the house to relieve\\n\\t\\t\\t\\thimself.' Nor should he do itikaf on the roof of the\\n\\t\\t\\t\\tmosque or in the minaret.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The person who is going to do itikaf should\\n\\t\\t\\t\\tenter the place where he wishes to do itikaf before the\\n\\t\\t\\t\\tsun sets on the night when he wishes to begin his itikaf,\\n\\t\\t\\t\\tso that he is ready to begin the itikaf at the beginning\\n\\t\\t\\t\\tof the night when he is going to start his itikaf. A\\n\\t\\t\\t\\tperson doing itikaf should be occupied with his itikaf,\\n\\t\\t\\t\\tand not turn his attention to other things which might\\n\\t\\t\\t\\toccupy him, such as trading or whatever. There is no\\n\\t\\t\\t\\tharm, however, if some one doing itikaf tells some one to\\n\\t\\t\\t\\tdo something for him regarding his estate, or the affairs\\n\\t\\t\\t\\tof  his family, or tells someone to sell some property of\\n\\t\\t\\t\\this, or something else that does not occupy him directly.\\n\\t\\t\\t\\tThere is no harm in him arranging for someone else to do\\n\\t\\t\\t\\tthat for him if it is a simple matter.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have never heard any of the people of\\n\\t\\t\\t\\tknowledge mentioning any modification as far as how to do\\n\\t\\t\\t\\titikaf is concerned. Itikaf is an act of ibada like the\\n\\t\\t\\t\\tprayer, fasting, the hajj, and such like acts, whether\\n\\t\\t\\t\\tthey are obligatory or voluntary. Anyone who begins doing\\n\\t\\t\\t\\tany of these acts should do them according to what has\\n\\t\\t\\t\\tcome down in the sunna. He should not start doing\\n\\t\\t\\t\\tanything in them that the muslims have not done, whether\\n\\t\\t\\t\\tit is a modification that he imposes on others, or one\\n\\t\\t\\t\\tthat he begins doing himself. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, practised itikaf,\\n\\t\\t\\t\\tand the muslims know what the sunna of itikaf is.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Itikaf and jiwar are the same, and Itikaf is\\n\\t\\t\\t\\tthe same for a village-dweller as it is for a nomad.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "4",
    "sectionHeading": "Things Without Which Itikaf is Not Possible",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad and Nafi, the mawla of Abdullah ibn\\n\\t\\t\\t\\tUmar said, \"You cannot do itikaf unless you are fasting,\\n\\t\\t\\t\\tbecause of what Allah, the Blessed and Exalted, says in\\n\\t\\t\\t\\tHis Book, 'And eat and drink until the white thread\\n\\t\\t\\t\\tbecomes clear to you from the black thread of dawn, then\\n\\t\\t\\t\\tcomplete the fast until night-time, and do not have\\n\\t\\t\\t\\tintercourse with them while you are doing itikaf in\\n\\t\\t\\t\\tmosques,' (Sura 2 ayat 187). Allah only mentions itikaf\\n\\t\\t\\t\\ttogether with fasting.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what we go by here.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "5",
    "sectionHeading": "Leaving Itikaf for the Id",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Ziyad ibn Abd ar-Rahman said,\\n\\t\\t\\t\\t\"Malik related to us from Sumayy, the mawla of Abu Bakr\\n\\t\\t\\t\\tibn Abd ar-Rahman, that Abu Bakr ibn Abd ar-Rahman was\\n\\t\\t\\t\\tonce doing itikaf and he would go out to relieve himself\\n\\t\\t\\t\\tin a closed room under a roofed passage in Khalid ibn\\n\\t\\t\\t\\tWalid's house. Otherwise he did not leave his place of\\n\\t\\t\\t\\titikaf until he went to pray at the Id with the muslims.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "6",
    "sectionHeading": "Leaving Itikaf for the Id",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Ziyad from Malik that he saw\\n\\t\\t\\t\\tsome of the people of knowledge who, when they did itikaf\\n\\t\\t\\t\\tin the last ten days of Ramadan, would not go back to\\n\\t\\t\\t\\ttheir families until they had attended the Id al-Fitr\\n\\t\\t\\t\\twith everybody.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tZiyad said that Malik said, \"I heard this from the people\\n\\t\\t\\t\\tof excellence who have passed away, and it is what I like\\n\\t\\t\\t\\tmost out of what I have heard about the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "7",
    "sectionHeading": "Making Up for the Itikaf (Not Done)",
    "text": "<p>\\n\\t\\t\\t\\tZiyad related to me from Malik from Ibn Shihab from Amra\\n\\t\\t\\t\\tbint Abd ar-Rahman from A'isha that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, once\\n\\t\\t\\t\\twanted to do itikaf, and when he went off to the place\\n\\t\\t\\t\\twhere he wanted to do itikaf  he found some tents there,\\n\\t\\t\\t\\twhich were A'isha's tent, Hafsa's tent, and Zaynab's\\n\\t\\t\\t\\ttent. When he saw them he asked about them and someone\\n\\t\\t\\t\\ttold him that they were the tents of A'isha, Hafsa and\\n\\t\\t\\t\\tZaynab. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"Do you think them devout?\" Then\\n\\t\\t\\t\\the left, and did not do itikaf until Shawwal, when he\\n\\t\\t\\t\\tthen did it for ten days.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "8",
    "sectionHeading": "Making Up for the Itikaf (Not Done)",
    "text": "<p>\\n\\t\\t\\t\\tMalik was asked whether someone who went into a mosque to\\n\\t\\t\\t\\tdo itikaf for the last ten days of Ramadan and stayed\\n\\t\\t\\t\\tthere for a day or two but then became ill and left the\\n\\t\\t\\t\\tmosque, had to do itikaf for the number of days that were\\n\\t\\t\\t\\tleft from the ten, or not, and if he did have to do so,\\n\\t\\t\\t\\tthen what month should he do it in, and he replied, \"He\\n\\t\\t\\t\\tshould make up whatever he has to do of the itikaf when\\n\\t\\t\\t\\the recovers, whether in Ramadan or otherwise. I have\\n\\t\\t\\t\\theard that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, once wanted to do itikaf in Ramadan,\\n\\t\\t\\t\\tbut then came back without having done so, and then when\\n\\t\\t\\t\\tRamadan had gone, he did itikaf for ten days in Shawwal.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tSome one who does itikaf voluntarily in Ramadan and some\\n\\t\\t\\t\\tone who has to do itikaf are in the same position\\n\\t\\t\\t\\tregarding what is halal for them and what is haram. I\\n\\t\\t\\t\\thave not heard that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, ever did itikaf other than\\n\\t\\t\\t\\tvoluntarily.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, that if a woman did itikaf and then\\n\\t\\t\\t\\tmenstruated during her itikaf, she went back to her\\n\\t\\t\\t\\thouse, and, when she was pure again she returned to the\\n\\t\\t\\t\\tmosque, at whatever time it was that she became pure. She\\n\\t\\t\\t\\tthen continued her itikaf from where she left off. This\\n\\t\\t\\t\\twas the same situation as with a woman who had to fast\\n\\t\\t\\t\\ttwo consecutive months, and who menstruated and then\\n\\t\\t\\t\\tbecame pure. She then continued the fast from where she\\n\\t\\t\\t\\thad left off and did not delay doing so.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "9",
    "sectionHeading": "Making Up for the Itikaf (Not Done)",
    "text": "<p>\\n\\t\\t\\t\\tZiyad related to me from Malik from Ibn Shihab that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to go to relieve himself in houses.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone doing itikaf should not leave for\\n\\t\\t\\t\\this parents' funeral or for anything else.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "9",
    "sectionHeading": "Marriage in Itikaf",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in someone who is in itikaf\\n\\t\\t\\t\\tentering into a marriage contract as long as there is no\\n\\t\\t\\t\\tphysical relationship. A woman in itikaf may also be\\n\\t\\t\\t\\tbetrothed as long as there is no physical relationship.\\n\\t\\t\\t\\tWhat is haram for someone in itikaf in relation to his\\n\\t\\t\\t\\twomenfolk during the day is haram for him during the\\n\\t\\t\\t\\tnight.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Ziyad said that Malik said, \"It is not\\n\\t\\t\\t\\thalal for a man to have intercourse with his wife while\\n\\t\\t\\t\\the is in itikaf, nor for him to take pleasure in her by\\n\\t\\t\\t\\tkissing her, or whatever. However, I have not heard\\n\\t\\t\\t\\tanyone disapproving of a man, or woman, in itikaf getting\\n\\t\\t\\t\\tmarried as long as there is no physical relationship.\\n\\t\\t\\t\\tMarriage is not disapproved of for someone fasting.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"There is, however, a distinction between the marriage of\\n\\t\\t\\t\\tsomeone in itikaf and that of someone who is muhrim, in\\n\\t\\t\\t\\tthat some one who is muhrim can eat, drink, visit the\\n\\t\\t\\t\\tsick and attend funerals, but cannot put on perfume,\\n\\t\\t\\t\\twhilst a man or woman in itikaf can put on oil and\\n\\t\\t\\t\\tperfume and groom their hair, but cannot attend funerals\\n\\t\\t\\t\\tor pray over the dead or visit the sick. Thus their\\n\\t\\t\\t\\tsituations with regard to marriage are different.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"This is the sunna as it has come down to us regarding\\n\\t\\t\\t\\tmarriage for those who are muhrim, doing itikaf, or\\n\\t\\t\\t\\tfasting.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "10",
    "sectionHeading": "Laylat al-Qadr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Abdullah\\n\\t\\t\\t\\tibn al-Hadi from Muhammad ibn Ibrahim al-Harith at-Taymi\\n\\t\\t\\t\\tfrom Abu Salama ibn Abd ar-Rahman that Abu Said al-Khudri\\n\\t\\t\\t\\tsaid, \"The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, used to do itikaf in the middle ten days\\n\\t\\t\\t\\tof Ramadan. One year he was doing itikaf and then, when\\n\\t\\t\\t\\tit came to the night of the twenty-first, which was the\\n\\t\\t\\t\\tnight before the morning when he would normally have\\n\\t\\t\\t\\tfinished his itikaf, he said, 'Whoever has done i'tikaf\\n\\t\\t\\t\\twith me should continue doing itikaf for the last ten\\n\\t\\t\\t\\tdays. I saw a certain night and then I was made to forget\\n\\t\\t\\t\\tit. I saw myself prostrating the following morning in\\n\\t\\t\\t\\twater and clay. Look for it in the last ten days, and\\n\\t\\t\\t\\tlook for it on the odd days.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Said continued, \"The sky poured with rain that night\\n\\t\\t\\t\\tand the mosque had a roof (made of palm fronds) and the\\n\\t\\t\\t\\tmosque was soaked. With my own eyes I saw the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, leave\\n\\t\\t\\t\\twith traces of water and clay on his forehead and nose,\\n\\t\\t\\t\\tin the morning after the night of the twenty-first.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "11",
    "sectionHeading": "Laylat al-Qadr",
    "text": "<p>\\n\\t\\t\\t\\tZiyad related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Search for Laylat al-Qadr\\n\\t\\t\\t\\tin the last ten days of Ramadan.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "12",
    "sectionHeading": "Laylat al-Qadr",
    "text": "<p>\\n\\t\\t\\t\\tZiyad related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said. \"Search for\\n\\t\\t\\t\\tLaylat al-Qadr in the last seven days.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "13",
    "sectionHeading": "Laylat al-Qadr",
    "text": "<p>\\n\\t\\t\\t\\tZiyad related to me from Malik from Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah, that Abdullah ibn Unays al-Juhani\\n\\t\\t\\t\\tsaid to the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, \"Messenger of Allah, I am a man whose\\n\\t\\t\\t\\thouse is a long way away. Tell me one night so that I can\\n\\t\\t\\t\\tstop my journey for it.\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Stop on the\\n\\t\\t\\t\\ttwenty-third night of Ramadan.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "14",
    "sectionHeading": "Laylat al-Qadr",
    "text": "<p>\\n\\t\\t\\t\\tZiyad related to me from Malik from Humayd at-Tawil that\\n\\t\\t\\t\\t'Anas ibn Malik said, \"The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, came out to us in Ramadan\\n\\t\\t\\t\\tand said, 'I was shown a certain night in Ramadan and\\n\\t\\t\\t\\tthen two men abused each other and it was taken away.\\n\\t\\t\\t\\tLook for it on the ninth and the seventh and the fifth.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "15",
    "sectionHeading": "Laylat al-Qadr",
    "text": "<p>\\n\\t\\t\\t\\tZiyad related to me from Malik from Nafi from Ibn 'Umar\\n\\t\\t\\t\\tthat some of the companions of the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, were shown\\n\\t\\t\\t\\tLaylat al-Qadr in their sleep during the last seven days.\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"I see that your visions agree about the\\n\\t\\t\\t\\tlast seven days, so whoever is searching for it should do\\n\\t\\t\\t\\tso in the last seven days.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "16",
    "sectionHeading": "Laylat al-Qadr",
    "text": "<p>\\n\\t\\t\\t\\tZiyad related to me from Malik that he had heard a man he\\n\\t\\t\\t\\ttrusted of the people of knowledge say, \"The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was shown\\n\\t\\t\\t\\tthe lifespans of the people (who had gone) before him, or\\n\\t\\t\\t\\twhat Allah willed of that, and it was as if the lives of\\n\\t\\t\\t\\tthe people of his community had become too short for them\\n\\t\\t\\t\\tto be able to do as many good actions as others before\\n\\t\\t\\t\\tthem had been able to do with their long lives, so Allah\\n\\t\\t\\t\\tgave him Laylat al-Qadr, which is better than a thousand\\n\\t\\t\\t\\tmonths.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "19",
    "hadithNumber": "17",
    "sectionHeading": "Laylat al-Qadr",
    "text": "<p>\\n\\t\\t\\t\\tZiyad related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab used to say, \"Whoever is present at\\n\\t\\t\\t\\tisha on Laylat al-Qadr has taken his portion from it.\"\\n\\t\\t\\t</p>"
  }
]
