[
  {
    "SurahNumber": "9",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Sc., \"which they (the unbelievers) have deliberately\\n\\t\\t\\t\\tbroken\" (Tabari, Baghawi, Zamakhshari, Razi); see also\\n\\t\\t\\t\\tverse {4}, which relates to such of the unbelievers as\\n\\t\\t\\t\\tremain faithful to their treaty obligations towards the\\n\\t\\t\\t\\tbelievers. The above passage connects with verses {56-58}\\n\\t\\t\\t\\tof the preceding surah (Al-Anfal). The noun bara'ah\\n\\t\\t\\t\\t(derived from the verb bari'a, \"he became free [of\\n\\t\\t\\t\\tsomething]\" or \"quit of having any part [in something]\")\\n\\t\\t\\t\\tsignifies a declaration of being free or quit of any\\n\\t\\t\\t\\tbond, moral or contractual, with the person or persons\\n\\t\\t\\t\\tconcerned (see Lane I, 178); with reference to God - or\\n\\t\\t\\t\\tthe Apostle speaking in God's name - it is best rendered\\n\\t\\t\\t\\tas \"disavowal\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "These words, addressed to the mushrikin (\"those who\\n\\t\\t\\t\\tascribe divinity to aught beside God\") who have\\n\\t\\t\\t\\tdeliberately broken the treaties in force between them\\n\\t\\t\\t\\tand the believers, indicate a cancellation of all treaty\\n\\t\\t\\t\\tobligations on the latters' part. The period of four\\n\\t\\t\\t\\tmonths which is to elapse between this announcement and\\n\\t\\t\\t\\tthe beginning (or resumption) of hostilities is a further\\n\\t\\t\\t\\telaboration of the injunction \"cast it [i.e., the treaty]\\n\\t\\t\\t\\tback at them in an equitable manner\", given in  8:58 \\n\\t\\t\\t\\twith reference to a breach of covenant by hostile\\n\\t\\t\\t\\tunbelievers (see also note [62] on verse {58} of surah\\n\\t\\t\\t\\t{8})."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "There is no unanimity among the commentators as to what\\n\\t\\t\\t\\tis meant by \"the day of the Greatest Pilgrimage\". Most of\\n\\t\\t\\t\\tthem assume that it refers to the pilgrimage in the year\\n\\t\\t\\t\\t9 H., in which the Prophet himself did not participate,\\n\\t\\t\\t\\thaving entrusted Abu Bakr with the office of amir\\n\\t\\t\\t\\tal-hajj. This very fact, however, makes it improbable\\n\\t\\t\\t\\tthat the designation \"the Greatest Pilgrimage\" should\\n\\t\\t\\t\\thave been given in the Qur'an to this particular\\n\\t\\t\\t\\tpilgrimage. On the other hand, there exists a Tradition\\n\\t\\t\\t\\ton the authority of 'Abd Allah ibn 'Umar to the effect\\n\\t\\t\\t\\tthat the Prophet described in these very words the last\\n\\t\\t\\t\\tpilgrimage led by himself in 10 H. and known to history\\n\\t\\t\\t\\tas the Farewell Pilgrimage (Zamakhshari, Razi); one may,\\n\\t\\t\\t\\ttherefore, assume that it is this which is alluded to\\n\\t\\t\\t\\there. If this assumption is correct, it would justify the\\n\\t\\t\\t\\tconclusion that verses {3} and {4} of this surah were\\n\\t\\t\\t\\trevealed during the Farewell Pilgrimage, i.e., shortly\\n\\t\\t\\t\\tbefore the Prophet's death. This might explain the -\\n\\t\\t\\t\\totherwise perplexing - statement, reliably attributed to\\n\\t\\t\\t\\tthe Prophet's Companion Al-Bara' (Bukhari, Kitab\\n\\t\\t\\t\\tat-Tafsir), that At-Tawbah was the last surah revealed to\\n\\t\\t\\t\\tthe Prophet: for, although it is established beyond any\\n\\t\\t\\t\\tdoubt that the surah as a whole was revealed in 9 H. and\\n\\t\\t\\t\\twas followed by several other parts of the Qur'an, e.g.,\\n\\t\\t\\t\\tAl-Ma'idah, it is possible that what Al-Bara' had in mind\\n\\t\\t\\t\\twere only these two key-verses ({3} and {4}) of\\n\\t\\t\\t\\tAt-Tawbah, which conceivably were revealed during the\\n\\t\\t\\t\\tFarewell Pilgrimage."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "I.e., from the cancellation, explained in note [2] above,\\n\\t\\t\\t\\tof the treaties which they have concluded with the\\n\\t\\t\\t\\tbelievers."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "Lit., \"until their term\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "5",
    "NoteID": "6",
    "Body": "According to a pre-Islamic custom prevalent in Arabia,\\n\\t\\t\\t\\tthe months of Muharram, Rajab, Dhu 'l-Qa'dah and Dhu\\n\\t\\t\\t\\t'l-Hiijah were considered \"sacred\" in the sense that all\\n\\t\\t\\t\\ttribal warfare had to cease during those months. It was\\n\\t\\t\\t\\twith a view to preserving these periods of truce and thus\\n\\t\\t\\t\\tto promoting peace among the frequently warring tribes\\n\\t\\t\\t\\tthat the Qur'an did not revoke, but rather confirmed,\\n\\t\\t\\t\\tthis ancient custom. See also  2:194  and {217}."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "5",
    "NoteID": "7",
    "Body": "Read in conjunction with the two preceding verses, as\\n\\t\\t\\t\\twell as with {2:190-194}, the above verse relates to\\n\\t\\t\\t\\twarfare already in progress with people who have become\\n\\t\\t\\t\\tguilty of a breach of treaty obligations and of\\n\\t\\t\\t\\taggression."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "5",
    "NoteID": "8",
    "Body": "I.e., \"do everything that may be necessary and advisable\\n\\t\\t\\t\\tin warfare\". The term marsad denotes \"any place from\\n\\t\\t\\t\\twhich it is possible to perceive the enemy and to observe\\n\\t\\t\\t\\this movements\" (Manar X, 199)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "5",
    "NoteID": "9",
    "Body": "As I have pointed out on more than one occasion, every\\n\\t\\t\\t\\tverse of the Qur'an must be read and interpreted against\\n\\t\\t\\t\\tthe background of the Qur'an as a whole. The above verse,\\n\\t\\t\\t\\twhich speaks of a possible conversion to Islam on the\\n\\t\\t\\t\\tpart of \"those who ascribe divinity to aught beside God\"\\n\\t\\t\\t\\twith whom the believers are at war, must, therefore, be\\n\\t\\t\\t\\tconsidered in conjunction with several fundamental\\n\\t\\t\\t\\tQur'anic ordinances. One of them, \"There shall be no\\n\\t\\t\\t\\tcoercion in matters of faith\" ( 2:256 ), lays down\\n\\t\\t\\t\\tcategorically that any attempt at a forcible conversion\\n\\t\\t\\t\\tof unbelievers is prohibited - which precludes the\\n\\t\\t\\t\\tpossibility of the Muslims' demanding or expecting that a\\n\\t\\t\\t\\tdefeated enemy should embrace Islam as the price of\\n\\t\\t\\t\\timmunity. Secondly, the Qur'an ordains, \"Fight in God's\\n\\t\\t\\t\\tcause against those who wage war against you; but do not\\n\\t\\t\\t\\tcommit aggression, for verily, God does not love\\n\\t\\t\\t\\taggressors\" ( 2:190 ); and, \"if they do not let you be,\\n\\t\\t\\t\\tand do not offer you peace, and do not stay their hands,\\n\\t\\t\\t\\tseize them and slay them whenever you come upon them: and\\n\\t\\t\\t\\tit is against these that We have clearly empowered you\\n\\t\\t\\t\\t[to make war]\" ( 4:91 ). Thus, war is permissible only in\\n\\t\\t\\t\\tself-defence (see surah {2}, notes [167] and [168]), with\\n\\t\\t\\t\\tthe further proviso that \"if they desist - behold, God is\\n\\t\\t\\t\\tmuch-forgiving, a dispenser of grace\" ( 2:192 ), and \"if\\n\\t\\t\\t\\tthey desist, then all hostility shall cease\" ( 2:193 ).\\n\\t\\t\\t\\tNow the enemy's conversion to Islam - expressed in the\\n\\t\\t\\t\\twords, \"if they repent, and take to prayer [lit.,\\n\\t\\t\\t\\t\"establish prayer\"] and render the purifying dues\\n\\t\\t\\t\\t(zakah)\" - is no more than one, and by no means the only,\\n\\t\\t\\t\\tway of their \"desisting from hostility\"; and the\\n\\t\\t\\t\\treference to it in verses {5} and {11} of this surah\\n\\t\\t\\t\\tcertainly does not imply an alternative of \"conversion or\\n\\t\\t\\t\\tdeath\", as some unfriendly critics of Islam choose to\\n\\t\\t\\t\\tassume. Verses {4} and {6} give a further elucidation of\\n\\t\\t\\t\\tthe attitude which the believers are enjoined to adopt\\n\\t\\t\\t\\ttowards such of the unbelievers as are not hostile to\\n\\t\\t\\t\\tthem. (In this connection, see also {60:8-9})."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "6",
    "NoteID": "10",
    "Body": "Lit., \"seeks to become thy neighbour\": a metaphorical\\n\\t\\t\\t\\texpression denoting a demand for protection, based on the\\n\\t\\t\\t\\tancient Arabian custom (strongly affirmed by Islam) of\\n\\t\\t\\t\\thonouring and protecting a neighbour to the best of one's\\n\\t\\t\\t\\tability."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "6",
    "NoteID": "11",
    "Body": "Lit., \"his place of security\" (ma'manahu) - i.e., \"let\\n\\t\\t\\t\\thim rejoin his homeland\" (Razi), which implies that he is\\n\\t\\t\\t\\tfree to accept or not to accept the message of the\\n\\t\\t\\t\\tQur'an: a further re-affirmation of the Qur'anic\\n\\t\\t\\t\\tinjunction that \"there shall be no coercion in matters of\\n\\t\\t\\t\\tfaith\" ( 2:256 )."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "7",
    "NoteID": "12",
    "Body": "Lit., \"have a covenant before [or \"in the sight of\"] God\\n\\t\\t\\t\\tand His Apostle\": i.e., be protected by those who believe\\n\\t\\t\\t\\tin God and His Apostle. The specific reference to the\\n\\t\\t\\t\\tlatter is meant to stress the fact that he speaks and\\n\\t\\t\\t\\tacts in the name of God."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "7",
    "NoteID": "13",
    "Body": "Cf. verse {4} above. The \"covenant\" alluded to is the\\n\\t\\t\\t\\ttruce-agreement concluded in 6 H. at Hudaybiyyah, in the\\n\\t\\t\\t\\tvicinity of Mecca, between the Prophet and the pagan\\n\\t\\t\\t\\tQuraysh, which was (and was obviously intended to remain)\\n\\t\\t\\t\\ta model of the self-restraint and the tolerance expected\\n\\t\\t\\t\\tof true believers with regard to such of the unbelievers\\n\\t\\t\\t\\tas are not openly hostile to them."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "8",
    "NoteID": "14",
    "Body": "This connects with the opening clause of the preceding\\n\\t\\t\\t\\tverse, and relates to the hostile among \"those who\\n\\t\\t\\t\\tascribe divinity to aught beside God\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "8",
    "NoteID": "15",
    "Body": "The term ill signifies any tie that arises from a compact\\n\\t\\t\\t\\tor from blood-relationship, and which imposes on both\\n\\t\\t\\t\\tparties the obligation to protect each other (cf. Lane I,\\n\\t\\t\\t\\t75); the latter implication is expressed in the word\\n\\t\\t\\t\\tdhimmah, which literally denotes a \"covenant of\\n\\t\\t\\t\\tprotection\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "10",
    "NoteID": "16",
    "Body": "Or: \"who are the aggressors\" - the two expressions being,\\n\\t\\t\\t\\tin this context, synonymous."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "11",
    "NoteID": "17",
    "Body": "See note [9] above."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "12",
    "NoteID": "18",
    "Body": "Lit., \"if they break their oaths after their covenant\".\\n\\t\\t\\t\\tThis obviously refers to unbelievers who, without having\\n\\t\\t\\t\\trenounced their own beliefs, have concluded treaties of\\n\\t\\t\\t\\tfriendship with the Muslims. Their subsequent \"breaking\\n\\t\\t\\t\\tof the solemn pledges\" is an allusion to the breach of\\n\\t\\t\\t\\tthe truce of Hudaybiyyah by the pagan Quraysh, which, in\\n\\t\\t\\t\\tturn, led to the conquest of Mecca by the Muslims in the\\n\\t\\t\\t\\tyear 8 H."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "12",
    "NoteID": "19",
    "Body": "The word imam (of which a'immah is the plural) denotes\\n\\t\\t\\t\\tnot merely a \"leader\" but also - and primarily - \"a\\n\\t\\t\\t\\tperson who is an object of imitation by his followers\"\\n\\t\\t\\t\\t(Taj al-'Arus): hence, a \"model\", or \"exemplar\", or\\n\\t\\t\\t\\t\"archetype\". The term kufr, which usually signifies a\\n\\t\\t\\t\\t\"denial of [or \"refusal to acknowledge\"] the truth\", is\\n\\t\\t\\t\\trendered here as \"faithlessness\" because it refers,\\n\\t\\t\\t\\tspecifically, to a deliberate breaking of solemn\\n\\t\\t\\t\\tengagements."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "13",
    "NoteID": "20",
    "Body": "I.e., from Mecca, thus bringing about his and his\\n\\t\\t\\t\\tfollowers' exodus (hijrah) to Medina."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "13",
    "NoteID": "21",
    "Body": "Lit., \"God is more worthy (ahaqq) that you should stand\\n\\t\\t\\t\\tin awe of Him\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "15",
    "NoteID": "22",
    "Body": "This relates to the unbelievers with whom the Muslims are\\n\\t\\t\\t\\tat war: for God may, if He so wills, bring about a change\\n\\t\\t\\t\\tof heart in them and guide them to a realization of the\\n\\t\\t\\t\\ttruth (Baghawi and Zamakhshari; see also Manar X, 236)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "16",
    "NoteID": "23",
    "Body": "Lit., \"left [alone]\", i.e., without being tried by means\\n\\t\\t\\t\\tof suffering and hardship."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "16",
    "NoteID": "24",
    "Body": "Lit., \"while God has not yet taken cognizance of those of\\n\\t\\t\\t\\tyou who have striven hard\". For an explanation of God's\\n\\t\\t\\t\\t\"taking cognizance\", see  3:142  and the corresponding\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "16",
    "NoteID": "25",
    "Body": "Lit., \"without having taken any intimate helper (walijah)\\n\\t\\t\\t\\tother than God and His Apostle and the believers\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "17",
    "NoteID": "26",
    "Body": "In its transitive form, the verb 'amara comprises the\\n\\t\\t\\t\\tmeanings of both visiting and maintaining a place; hence\\n\\t\\t\\t\\tmy rendering of an ya'muru as \"that they should visit or\\n\\t\\t\\t\\ttend\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "17",
    "NoteID": "27",
    "Body": "Some of the commentators conclude from this verse that\\n\\t\\t\\t\\t\"those who ascribe divinity to aught beside God\" are not\\n\\t\\t\\t\\tallowed to enter mosques (\"God's houses of worship\").\\n\\t\\t\\t\\tThis conclusion however, is entirely untenable in view of\\n\\t\\t\\t\\tthe fact that in 9 H. - that is, after the revelation of\\n\\t\\t\\t\\tthis surah - the Prophet himself lodged a deputation of\\n\\t\\t\\t\\tthe pagan Banu Thaqif in the mosque at Medina (Razi).\\n\\t\\t\\t\\tThus, the above verse expresses no more than the moral\\n\\t\\t\\t\\tincongruity of the unbelievers' \"visiting or tending\\n\\t\\t\\t\\tGod's houses of worship\". As regards their exclusion from\\n\\t\\t\\t\\tthe central mosque of Islam at Mecca (\"the Inviolable\\n\\t\\t\\t\\tHouse of Worship\"), see verse {28} of this surah."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "18",
    "NoteID": "28",
    "Body": "Lit., \"it may well be that these will be among the\\n\\t\\t\\t\\tright-guided\". However, according to Abu Muslim (as\\n\\t\\t\\t\\tquoted by Razi), as well as the great grammarian Sibawayh\\n\\t\\t\\t\\t(see Manar X, 253), the word 'asa, usually signifying \"it\\n\\t\\t\\t\\tmay well be\", is here indicative of the hope which the\\n\\t\\t\\t\\tabove-mentioned believers may entertain."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "19",
    "NoteID": "29",
    "Body": "Many commentators see in this verse an allusion to the\\n\\t\\t\\t\\tboast of the pagan Quraysh, before the Muslim conquest of\\n\\t\\t\\t\\tMecca, that they were superior to all other people on\\n\\t\\t\\t\\taccount of their guardianship of the Ka'bah and their\\n\\t\\t\\t\\tproviding water (siqayah) to pilgrims; and on being taken\\n\\t\\t\\t\\tprisoner by the Muslims in the battle of Badr, Al-'Abbas,\\n\\t\\t\\t\\tthe Prophet's uncle, excused on these very grounds his\\n\\t\\t\\t\\tfailure to accompany the Muslims on their exodus from\\n\\t\\t\\t\\tMecca to Medina (Tabari). It is probable, however, that\\n\\t\\t\\t\\tthis verse has yet another, deeper import. According to\\n\\t\\t\\t\\tan authentic Tradition quoted by Muslim, Abu Da'ud and\\n\\t\\t\\t\\tIbn Hibban (as well as by Tabari), one of the Prophet's\\n\\t\\t\\t\\tCompanions stated in the mosque of Medina, \"I would not\\n\\t\\t\\t\\tcare, after having accepted Islam, to do any good deed\\n\\t\\t\\t\\tbeyond providing water to the pilgrims!\" - whereupon\\n\\t\\t\\t\\tanother of the Companions declared, \"Nay, [I would rather\\n\\t\\t\\t\\ttake charge of] the maintenance of the Inviolable House\\n\\t\\t\\t\\tof Worship.\" But yet another Companion declared, \"Nay,\\n\\t\\t\\t\\tstruggle (jihad) in God's cause is far better than what\\n\\t\\t\\t\\tyou have mentioned!\" A short time afterwards the above\\n\\t\\t\\t\\tQur'an-verse was revealed to the Prophet. It would,\\n\\t\\t\\t\\ttherefore, appear that what is meant here is the superior\\n\\t\\t\\t\\tvalue of faith in God and struggle in His cause as\\n\\t\\t\\t\\tcompared with acts which, however meritorious, are\\n\\t\\t\\t\\tconcerned only with outward forms: in brief, the immense\\n\\t\\t\\t\\tsuperiority of real self-surrender to God over mere\\n\\t\\t\\t\\tritual."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "20",
    "NoteID": "30",
    "Body": "See surah {2}, note [203], and surah {4}, note [124]."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "23",
    "NoteID": "31",
    "Body": "The term walayah (\"alliance\" or \"friendship\") is used in\\n\\t\\t\\t\\tthis context in the sense of an alliance against other\\n\\t\\t\\t\\tbelievers, as in  3:28 . (Regarding the wider, spiritual\\n\\t\\t\\t\\timplications of this expression, see surah {4}, note\\n\\t\\t\\t\\t[154].) That it does not refer to \"friendship\" in the\\n\\t\\t\\t\\tsense of normal human affection is obvious from the many\\n\\t\\t\\t\\texhortations in the Qur'an to be good to one's parents\\n\\t\\t\\t\\tand kinsfolk; and, more explicitly, from {60:8-9}, where\\n\\t\\t\\t\\tthe believers are reminded that friendly relations with\\n\\t\\t\\t\\tunbelievers who are not hostile to the Muslim community\\n\\t\\t\\t\\tare permissible, and even desirable. (See also Manar X,\\n\\t\\t\\t\\t269 ff., where a similar interpretation is advanced.)"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "24",
    "NoteID": "32",
    "Body": "Or: \"brings about [the fulfilment of] His command\". This\\n\\t\\t\\t\\tmay be an allusion to the Day of Judgment or - more\\n\\t\\t\\t\\tprobably - to the inevitable degeneration and decline of\\n\\t\\t\\t\\tcommunities which place narrow self-interest above\\n\\t\\t\\t\\tethical values. In particular, this passage rejects the\\n\\t\\t\\t\\ttendency to regard ties of kinship and national\\n\\t\\t\\t\\taffiliation (expressed in the term \"your clan\") as the\\n\\t\\t\\t\\tdecisive factors of social behaviour, and postulates\\n\\t\\t\\t\\tideology (\"God and His Apostle and the struggle in His\\n\\t\\t\\t\\tcause\") as the only valid basis on which a believer's\\n\\t\\t\\t\\tlife - individually and socially - should rest."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "25",
    "NoteID": "33",
    "Body": "The battle of Hunayn, a valley situated on one of the\\n\\t\\t\\t\\troads leading from Mecca to Ta'if, took place in the year\\n\\t\\t\\t\\t8 H., shortly after the conquest of Mecca by the Muslims.\\n\\t\\t\\t\\tThe latters' opponents were the pagan tribes of Hawazin\\n\\t\\t\\t\\t(in whose territory the valley lay) and their allies, the\\n\\t\\t\\t\\tBanu Thaqif. The Muslim army - reinforced by many\\n\\t\\t\\t\\tnewly-converted Meccans - comprised about twelve thousand\\n\\t\\t\\t\\tmen, whereas the Hawazin and Thaqif had only one-third of\\n\\t\\t\\t\\tthat number at their disposal. Relying on their great\\n\\t\\t\\t\\tnumerical superiority, the Muslims were over-confident\\n\\t\\t\\t\\tand, apparently, careless. In the narrow defiles beyond\\n\\t\\t\\t\\tthe oasis of Hunayn they fell into an ambush prepared by\\n\\t\\t\\t\\tthe tribesmen and began to retreat in disorder after\\n\\t\\t\\t\\theavy losses had been inflicted on them by the bedouin\\n\\t\\t\\t\\tarchers. It was only the example of the Prophet and his\\n\\t\\t\\t\\tearly adherents (the Meccan muhajirun and the ansar from\\n\\t\\t\\t\\tMedina) that saved the day and turned the initial rout of\\n\\t\\t\\t\\tthe Muslims into a decisive victory. It is to this battle\\n\\t\\t\\t\\tthat verses {25} and {26} refer, pointing out that true\\n\\t\\t\\t\\tsuccour can come only from God, and that great numbers,\\n\\t\\t\\t\\tties of kinship and worldly wealth are of no avail if\\n\\t\\t\\t\\tthey are \"dearer to you than God and His Apostle and the\\n\\t\\t\\t\\tstruggle in His cause\" (see preceding verse)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "26",
    "NoteID": "34",
    "Body": "I.e., spiritual forces. Cf. {3:124-125} (relating to the\\n\\t\\t\\t\\tbattle of Uhud) and the corresponding note, as well as\\n\\t\\t\\t\\t 8:9  (which refers to the battle of Badr). The spiritual\\n\\t\\t\\t\\tnature of this aid is clearly implied in the phrase,\\n\\t\\t\\t\\t\"forces which you could not\" [or \"did not\"] see\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "27",
    "NoteID": "35",
    "Body": "Lit., \"then, after this\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "27",
    "NoteID": "36",
    "Body": "Most of the commentators (e.g., Tabari, Baghawi.\\n\\t\\t\\t\\tZamakhshari, Ibn Kathir) understand this verse as\\n\\t\\t\\t\\trelating to the unbelievers and having a general import;\\n\\t\\t\\t\\tRazi, however, thinks that it refers to the believers who\\n\\t\\t\\t\\tbehaved badly at the opening stage of the battle of\\n\\t\\t\\t\\tHunayn. In my opinion, the former interpretation is\\n\\t\\t\\t\\tpreferable. (See also last sentence of verse {15} and\\n\\t\\t\\t\\tnote [22] above.)"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "28",
    "NoteID": "37",
    "Body": "The term najas (\"impure\") occurs in the Qur'an only in\\n\\t\\t\\t\\tthis one instance, and carries an exclusively spiritual\\n\\t\\t\\t\\tmeaning (see Manar X, 322ff.). To this day, the bedouin\\n\\t\\t\\t\\tof Central and Eastern Arabia - who, contrary to the\\n\\t\\t\\t\\tmodern town-dwellers, have preserved the purity of the\\n\\t\\t\\t\\tArabic idiom to a high degree - describe a person who is\\n\\t\\t\\t\\timmoral, faithless or wicked as najas. \"The Inviolable\\n\\t\\t\\t\\tHouse of Worship\" (al-masjid al-haram) is, of course, the\\n\\t\\t\\t\\tKa'bah and, by implication, the whole of the territory of\\n\\t\\t\\t\\tMecca: which explains the next sentence."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "28",
    "NoteID": "38",
    "Body": "Lit., \"after this their year\" - i.e., after the year 9\\n\\t\\t\\t\\tH., in which this surah was revealed."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "28",
    "NoteID": "39",
    "Body": "This is an allusion to the apprehension on the part of\\n\\t\\t\\t\\tsome Muslims (and not only at the time of the revelation\\n\\t\\t\\t\\tof this verse) that an exclusion of unbelievers from\\n\\t\\t\\t\\tliving in or visiting Mecca might lead to a loss of its\\n\\t\\t\\t\\tposition as a centre of trade and commerce, and thus to\\n\\t\\t\\t\\tan impoverishment of its inhabitants."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "29",
    "NoteID": "40",
    "Body": "Lit., \"such of those who were vouchsafed revelation\\n\\t\\t\\t\\t[aforetime] as do not believe...\", etc. In accordance\\n\\t\\t\\t\\twith the fundamental principle - observed throughout my\\n\\t\\t\\t\\tinterpretation of the Qur'an - that all of its statements\\n\\t\\t\\t\\tand ordinances are mutually complementary and cannot,\\n\\t\\t\\t\\ttherefore, be correctly understood unless they are\\n\\t\\t\\t\\tconsidered as parts of one integral whole, this verse,\\n\\t\\t\\t\\ttoo must be read in the context of the clear-cut Qur'anic\\n\\t\\t\\t\\trule that war is permitted only in self-defence (see\\n\\t\\t\\t\\t{2:190-194}, and the corresponding notes). In other\\n\\t\\t\\t\\twords, the above injunction to fight is relevant only in\\n\\t\\t\\t\\tthe event of aggression committed against the Muslim\\n\\t\\t\\t\\tcommunity or state, or in the presence of an unmistakable\\n\\t\\t\\t\\tthreat to its security: a view which has been shared by\\n\\t\\t\\t\\tthat great Islamic thinker, Muhammad 'Abduh. Commenting\\n\\t\\t\\t\\ton this verse, he declared: \"Fighting has been made\\n\\t\\t\\t\\tobligatory in Islam only for the sake of defending the\\n\\t\\t\\t\\ttruth and its followers.... All the campaigns of the\\n\\t\\t\\t\\tProphet were defensive in character; and so were the wars\\n\\t\\t\\t\\tundertaken by the Companions in the earliest period [of\\n\\t\\t\\t\\tIslam]\" (Manar X, 332)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "29",
    "NoteID": "41",
    "Body": "This, to my mind, is the key-phrase of the above\\n\\t\\t\\t\\tordinance. The term \"apostle\" is obviously used here in\\n\\t\\t\\t\\tits generic sense and applies to all the prophets on\\n\\t\\t\\t\\twhose teachings the beliefs of the Jews and the\\n\\t\\t\\t\\tChristians are supposed to be based - in particular, to\\n\\t\\t\\t\\tMoses and (in the case of the Christians) to Jesus as\\n\\t\\t\\t\\twell (Manar X, 333 and 337). Since, earlier in this\\n\\t\\t\\t\\tsentence, the people alluded to are accused of so grave a\\n\\t\\t\\t\\tsin as wilfully refusing to believe in God and the Last\\n\\t\\t\\t\\tDay (i.e., in life after death and man's individual\\n\\t\\t\\t\\tresponsibility for his doings on earth), it is\\n\\t\\t\\t\\tinconceivable that they should subsequently be blamed for\\n\\t\\t\\t\\tcomparatively minor offences against their religious law:\\n\\t\\t\\t\\tconsequently, the stress on their \"not forbidding that\\n\\t\\t\\t\\twhich God and His apostle have forbidden\" must refer to\\n\\t\\t\\t\\tsomething which is as grave, or almost as grave, as\\n\\t\\t\\t\\tdisbelief in God. In the context of an ordinance\\n\\t\\t\\t\\tenjoining war against them, this \"something\" can mean\\n\\t\\t\\t\\tonly one thing - namely, unprovoked aggression: for it is\\n\\t\\t\\t\\tthis that has been forbidden by God through all the\\n\\t\\t\\t\\tapostles who were entrusted with conveying His message to\\n\\t\\t\\t\\tman. Thus, the above verse must be understood as a call\\n\\t\\t\\t\\tto the believers to fight against such - and only such -\\n\\t\\t\\t\\tof the nominal followers of earlier revelation as deny\\n\\t\\t\\t\\ttheir own professed beliefs by committing aggression\\n\\t\\t\\t\\tagainst the followers of the Qur'an (cf. Manar X, 338)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "29",
    "NoteID": "42",
    "Body": "See in this connection the statement (in {5:13-14}) that\\n\\t\\t\\t\\tthe Jews and the Christians \"have forgotten much of what\\n\\t\\t\\t\\tthey had been told to bear in mind\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "29",
    "NoteID": "43",
    "Body": "Sc., \"and having become incorporated in the Islamic\\n\\t\\t\\t\\tstate\". The term jizyah, rendered by me as \"exemption\\n\\t\\t\\t\\ttax\", occurs in the Qur'an only once, but its meaning and\\n\\t\\t\\t\\tpurpose have been fully explained in many authentic\\n\\t\\t\\t\\tTraditions. It is intimately bound up with the concept of\\n\\t\\t\\t\\tthe Islamic state as an ideological organization: and\\n\\t\\t\\t\\tthis is a point which must always be borne in mind if the\\n\\t\\t\\t\\treal purport of this tax is to be understood. In the\\n\\t\\t\\t\\tIslamic state, every able-bodied Muslim is obliged to\\n\\t\\t\\t\\ttake up arms in jihad (i.e., in a just war in God's\\n\\t\\t\\t\\tcause) whenever the freedom of his faith or the political\\n\\t\\t\\t\\tsafety of his community is imperilled: in other words,\\n\\t\\t\\t\\tevery able-bodied Muslim is liable to compulsory military\\n\\t\\t\\t\\tservice. Since this is, primarily, a religious obligation\\n\\t\\t\\t\\tnon-Muslim citizens, who do not subscribe to the ideology\\n\\t\\t\\t\\tof Islam, cannot in fairness be expected to assume a\\n\\t\\t\\t\\tsimilar burden. On the other hand, they must be accorded\\n\\t\\t\\t\\tfull protection of all their civic rights and of their\\n\\t\\t\\t\\treligious freedom: and it is in order to compensate the\\n\\t\\t\\t\\tMuslim community for this unequal distribution of civic\\n\\t\\t\\t\\tburdens that a special tax is levied on non-Muslim\\n\\t\\t\\t\\tcitizens (ahl adh-dhimmah, lit., \"covenanted\" [or\\n\\t\\t\\t\\t\"protected\"] people\", i.e., non-Muslims whose safety is\\n\\t\\t\\t\\tstatutorily assured by the Muslim community). Thus,\\n\\t\\t\\t\\tjizyah is no more and no less than an exemption tax in\\n\\t\\t\\t\\tlieu of military service and in compensation for the\\n\\t\\t\\t\\t\"covenant of protection\" (dhimmah) accorded to such\\n\\t\\t\\t\\tcitizens by the Islamic state. (The term itself is\\n\\t\\t\\t\\tderived from the verb jaza \"he rendered [something] as a\\n\\t\\t\\t\\tsatisfaction\", or \"as a compensation [in lieu of\\n\\t\\t\\t\\tsomething else;\" - cf. Lane II, 422.) No fixed rate has\\n\\t\\t\\t\\tbeen set either by the Qur'an or by the Prophet for this\\n\\t\\t\\t\\ttax; but from all available Traditions it is evident that\\n\\t\\t\\t\\tit is to be considerably lower than the tax called zakah\\n\\t\\t\\t\\t(\"the purifying dues\") to which Muslims are liable and\\n\\t\\t\\t\\twhich - because it is a specifically Islamic religious\\n\\t\\t\\t\\tduty - is naturally not to be levied on non-Muslims. Only\\n\\t\\t\\t\\tsuch of the non-Muslim citizens who, if they were\\n\\t\\t\\t\\tMuslims, would be expected to serve in the armed forces\\n\\t\\t\\t\\tof the state are liable to the payment of jizyah,\\n\\t\\t\\t\\tprovided that they can easily afford it. Accordingly, all\\n\\t\\t\\t\\tnon-Muslim citizens whose personal status or condition\\n\\t\\t\\t\\twould automatically free them from the obligation to\\n\\t\\t\\t\\trender military service are statutorily - that is, on the\\n\\t\\t\\t\\tbasis of clear-cut ordinances promulgated by the Prophet\\n\\t\\t\\t\\t- exempted from the payment of jizyah: (a) all women, (b)\\n\\t\\t\\t\\tmales who have not yet reached full maturity, (c) old\\n\\t\\t\\t\\tmen, (d) all sick or crippled men, (e) priests and monks.\\n\\t\\t\\t\\tAll non-Muslim citizens who volunteer for military\\n\\t\\t\\t\\tservice are obviously exempted from the payment of\\n\\t\\t\\t\\tjizyah. My rendering of the expression 'an yad (lit.,\\n\\t\\t\\t\\t\"out of hand\") as \"with a willing hand\", that is, without\\n\\t\\t\\t\\treluctance, is based on one of several explanations\\n\\t\\t\\t\\toffered by Zamakhshari in his commentary on the above\\n\\t\\t\\t\\tverse. Rashid Rida', taking the word yad in its\\n\\t\\t\\t\\tmetaphorical significance of \"power\" or \"ability\",\\n\\t\\t\\t\\trelates the phrase 'an yad to the financial ability of\\n\\t\\t\\t\\tthe person liable to the payment of jizyah (see Manar X,\\n\\t\\t\\t\\t342): an interpretation which is undoubtedly justified in\\n\\t\\t\\t\\tview of the accepted definition of this tax."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "30",
    "NoteID": "44",
    "Body": "This statement is connected with the preceding verse,\r\\n\\t\\t\\t\\twhich speaks of the erring followers of earlier\r\\n\\t\\t\\t\\trevelation. The charge of shirk (\"the ascribing of\r\\n\\t\\t\\t\\tdivinity [or \"divine qualities\"] to aught beside God\") is\r\\n\\t\\t\\t\\tlevelled against both the Jews and the Christians in\r\\n\\t\\t\\t\\tamplification, as it were, of the statement that they \"do\r\\n\\t\\t\\t\\tnot follow the religion of truth [which God has enjoined\r\\n\\t\\t\\t\\tupon them]\". As regards the belief attributed to the Jews\r\\n\\t\\t\\t\\tthat Ezra (or, in the Arabicized form of this name\r\\n\\t\\t\\t\\t'Uzayr) was \"God's son\", it is to be noted that almost\r\\n\\t\\t\\t\\tall classical commentators of the Qur'an agree in that\r\\n\\t\\t\\t\\tonly the Jews of Arabia, and not all Jews, have been thus\r\\n\\t\\t\\t\\taccused. (According to a Tradition on the authority of\r\\n\\t\\t\\t\\tIbn 'Abbas - quoted by Tabari in his commentary on this\r\\n\\t\\t\\t\\tverse - some of the Jews of Medina once said to Muhammad,\r\\n\\t\\t\\t\\t\"How could we follow thee when thou hast forsaken our\r\\n\\t\\t\\t\\tqiblah and dost not consider Ezra a son of God?\") On the\r\\n\\t\\t\\t\\tother hand, Ezra occupies a unique position in the esteem\r\\n\\t\\t\\t\\tof all Jews, and has always been praised by them in the\r\\n\\t\\t\\t\\tmost extravagant terms. It was he who restored and\r\\n\\t\\t\\t\\tcodified the Torah after it had been lost during the\r\\n\\t\\t\\t\\tBabylonian Exile, and \"edited\" it in more or less the\r\\n\\t\\t\\t\\tform which it has today, and thus \"he promoted the\r\\n\\t\\t\\t\\testablishment of an exclusive, legalistic type of\r\\n\\t\\t\\t\\treligion that became dominant in later Judaism\"\r\\n\\t\\t\\t\\t(Encyclopaedia Britannica, 1963, vol. IX, p. 15). Ever\r\\n\\t\\t\\t\\tsince then he has been venerated to such a degree that\r\\n\\t\\t\\t\\this verdicts on the Law of Moses have come to be regarded\r\\n\\t\\t\\t\\tby the Talmudists as being practically equivalent to the\r\\n\\t\\t\\t\\tLaw itself: which, in Qur'anic ideology, amounts to the\r\\n\\t\\t\\t\\tunforgivable sin of shirk, inasmuch as it implies the\r\\n\\t\\t\\t\\televation of a human being to the status of a\r\\n\\t\\t\\t\\tquasi-divine law-giver and the blasphemous attribution to\r\\n\\t\\t\\t\\thim - albeit metaphorically - of the quality of \"sonship\"\r\\n\\t\\t\\t\\tin relation to God. Cf. in this connection Exodus iv,\r\\n\\t\\t\\t\\t22-23 (\"Israel is My son\") or Jeremiah xxxi, 9 (\"I am a\r\\n\\t\\t\\t\\tfather to Israel\"): expressions to which, because of\r\\n\\t\\t\\t\\ttheir idolatrous implications, the Qur'an takes strong\r\\n\\t\\t\\t\\texception."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "30",
    "NoteID": "45",
    "Body": "My interpolation, between brackets, of the words \"they\\n\\t\\t\\t\\tdeserve the imprecation\" is based on Zamakhshari's and\\n\\t\\t\\t\\tRazi's convincing interpretation of this phrase.\\n\\t\\t\\t\\tOriginally, the Arabs used the expression \"may God\\n\\t\\t\\t\\tdestroy him\" in the sense of a direct imprecation; but\\n\\t\\t\\t\\talready in pre-Qur'anic Arabic it had assumed the\\n\\t\\t\\t\\tcharacter of an idiomatic device meant to circumscribe\\n\\t\\t\\t\\tanything that is extremely strange or horrifying: and,\\n\\t\\t\\t\\taccording to many philologists, \"this, rather than its\\n\\t\\t\\t\\tliteral meaning, is the purport [of this phrase] here\"\\n\\t\\t\\t\\t(Manar X, 399)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "30",
    "NoteID": "46",
    "Body": "See surah {5}, note [90]."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "31",
    "NoteID": "47",
    "Body": "Cf.  3:64 ."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "32",
    "NoteID": "48",
    "Body": "Lit., \"with their mouths\" - an allusion to the \"sayings\"\\n\\t\\t\\t\\t(i.e., beliefs) mentioned in verse {30}."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "32",
    "NoteID": "49",
    "Body": "Lit., \"except (illa) that He bring His light to\\n\\t\\t\\t\\tcompletion\", or \"to perfection\". The expression \"for He\\n\\t\\t\\t\\thas willed\" (i.e., contrary to what the erring ones\\n\\t\\t\\t\\twant), is here elliptically implied by means of the\\n\\t\\t\\t\\tparticle illa."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "33",
    "NoteID": "50",
    "Body": "Cf.  3:19  - \"the only [true] religion in the sight of\\n\\t\\t\\t\\tGod is [man's] self-surrender unto Him\". See also {61:\\n\\t\\t\\t\\t8-9}."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "34",
    "NoteID": "51",
    "Body": "Most probably this is, in the first instance, an allusion\\n\\t\\t\\t\\tto the wealth of the Jewish and Christian communities,\\n\\t\\t\\t\\tand their misuse of this wealth. Some of the\\n\\t\\t\\t\\tcommentators, however, are of the opinion that the\\n\\t\\t\\t\\treference is wider, comprising all people, including\\n\\t\\t\\t\\tMuslims, who hoard their wealth without spending anything\\n\\t\\t\\t\\tthereof on righteous causes."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "35",
    "NoteID": "52",
    "Body": "Cf. the parallel allegory, in  3:180 , of the suffering\\n\\t\\t\\t\\twhich will befall the avaricious and the niggardly in the\\n\\t\\t\\t\\tlife to come. Regarding the eschatological implications\\n\\t\\t\\t\\tof this and similar allegories, see Appendix I."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "36",
    "NoteID": "53",
    "Body": "This connects with the subsequent reference to fighting\\n\\t\\t\\t\\tagainst \"those who ascribe divinity to aught beside God\"\\n\\t\\t\\t\\t(see next note). The months spoken of here are lunar\\n\\t\\t\\t\\tmonths, progressively rotating through the seasons of the\\n\\t\\t\\t\\tsolar year (see surah {2}, note [165]). Since reckoning\\n\\t\\t\\t\\tby the easily observable lunar months is more natural\\n\\t\\t\\t\\tthan by the arbitrarily fixed months of the solar year,\\n\\t\\t\\t\\tit is described in this passage as \"the ever-true law\\n\\t\\t\\t\\t(din) [of God]\". The four \"sacred months\" during which\\n\\t\\t\\t\\twarfare was considered blasphemous in pre-Islamic Arabia\\n\\t\\t\\t\\t- a view which has been confirmed by Islam (see note [6]\\n\\t\\t\\t\\tabove) - are Muharram, Rajab, Dhu 'l-Qa'dah and Dhu\\n\\t\\t\\t\\t'l-Hijjah."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "36",
    "NoteID": "54",
    "Body": "In their endeavour to obviate certain disadvantages for\\n\\t\\t\\t\\ttheir trade caused by the seasonal rotation of the lunar\\n\\t\\t\\t\\tmonths, the pagan Arabs used to intercalate a thirteenth\\n\\t\\t\\t\\tmonth in the third, sixth and eighth year of every\\n\\t\\t\\t\\teight-year period, with a view to making the lunar\\n\\t\\t\\t\\tcalendar more or less stationary, and thus roughly\\n\\t\\t\\t\\tcorresponding to the solar year. An acceptance of this\\n\\t\\t\\t\\tunwarranted intercalation by the Muslims would have tied\\n\\t\\t\\t\\tthe Mecca pilgrimage as well as the fast of Ramadan to\\n\\t\\t\\t\\tfixed seasons, and would thus have made, permanently, the\\n\\t\\t\\t\\tperformance of these religious duties either too exacting\\n\\t\\t\\t\\tor too easy, and in either case the believers would have\\n\\t\\t\\t\\tbeen offending against the spiritual purpose underlying\\n\\t\\t\\t\\tthese duties - which is the meaning of the words \"do not\\n\\t\\t\\t\\tsin against yourselves with regard to these [months]\":\\n\\t\\t\\t\\ti.e., by following, without any warrant from God, a\\n\\t\\t\\t\\tcustom devised by \"those who ascribe divinity to aught\\n\\t\\t\\t\\tbeside Him\", to whom the sequence refers."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "36",
    "NoteID": "55",
    "Body": "I.e., \"just as all of them are, as it were, united\\n\\t\\t\\t\\tagainst you in their rejection of the truth, be united\\n\\t\\t\\t\\tagainst them in your readiness for self-sacrifice\". As\\n\\t\\t\\t\\tregards the circumstances in which the Muslims are\\n\\t\\t\\t\\tauthorized to make war against unbelievers, see the\\n\\t\\t\\t\\tearlier parts of this surah, and especially verses\\n\\t\\t\\t\\t{12-13}, as well as {2:190-194}, where the general\\n\\t\\t\\t\\tprinciples relating to war are laid down."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "37",
    "NoteID": "56",
    "Body": "Lit., \"is but an increase in denying the truth (kufr)\".\r\\n\\t\\t\\t\\tThe term nasi', rendered by me as \"intercalation\", may\r\\n\\t\\t\\t\\talso be translated as \"postponement\" - i.e., the\r\\n\\t\\t\\t\\tpostponement of lunar months by means of the periodical\r\\n\\t\\t\\t\\tintercalation of a thirteenth month, as practiced by the\r\\n\\t\\t\\t\\tpre-Islamic Arabs with a view to bringing the traditional\r\\n\\t\\t\\t\\tlunar calendar, for purely worldly reasons, into accord\r\\n\\t\\t\\t\\twith the solar year (see note [54] above). The Qur'an\r\\n\\t\\t\\t\\tdescribes this practice as an additional instance of kufr\r\\n\\t\\t\\t\\tbecause it contravenes God's declared will as regards the\r\\n\\t\\t\\t\\tobservance of the lunar calendar in respect of various\r\\n\\t\\t\\t\\treligious duties (cf. the preceding verse, as well as\r\\n\\t\\t\\t\\t 2:189  and the corresponding note [165])."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "37",
    "NoteID": "57",
    "Body": "An allusion to the arbitrary manner in which the\\n\\t\\t\\t\\tpre-Islamic Arabs intercalated a thirteenth month in the\\n\\t\\t\\t\\tthird, sixth and eighth year of every eight-year period."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "37",
    "NoteID": "58",
    "Body": "By means of the intercalation spoken of above, the pagan\\n\\t\\t\\t\\tArabs did in most years keep the number of months to\\n\\t\\t\\t\\ttwelve; but by divorcing the four \"sacred months\"\\n\\t\\t\\t\\t(Muharram, Rajab, Dhu 'l-Qa'dah and Dhu 'l-Hijjah), from\\n\\t\\t\\t\\ttheir proper lunar context they obviously profaned and\\n\\t\\t\\t\\tperverted the natural law."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "38",
    "NoteID": "59",
    "Body": "I.e., \"you are sluggish in your response, clinging to the\r\\n\\t\\t\\t\\tlife of this world\". This verse - as well as most of this\r\\n\\t\\t\\t\\tsurah from here onward - alludes to the campaign of\r\\n\\t\\t\\t\\tTabuk, in the year 9 H. The immediate reason for this\r\\n\\t\\t\\t\\texpedition was the information which the Prophet received\r\\n\\t\\t\\t\\tto the effect that the Byzantines, made apprehensive by\r\\n\\t\\t\\t\\tthe rapid growth of Islam in Arabia and incited by the\r\\n\\t\\t\\t\\tProphet's enemy Abu 'Amir (see note [142] on verse {107}\r\\n\\t\\t\\t\\tof this surah), were assembling large forces on the\r\\n\\t\\t\\t\\tconfines of the Peninsula with a view to marching against\r\\n\\t\\t\\t\\tMedina and overthrowing the Muslims. To guard against\r\\n\\t\\t\\t\\tsuch an assault, the prophet assembled the strongest\r\\n\\t\\t\\t\\tforce the Muslims were capable of, and set out in the\r\\n\\t\\t\\t\\tmonth of Rajab, 9 H., towards the frontier. On reaching\r\\n\\t\\t\\t\\tTabuk, about half-way between Medina and Damascus, the\r\\n\\t\\t\\t\\tProphet ascertained that the Byzantines were either not\r\\n\\t\\t\\t\\tyet ready to invade Arabia or had entirely given up the\r\\n\\t\\t\\t\\tidea for the time being; and so - in accordance with the\r\\n\\t\\t\\t\\tIslamic principle that war may be waged only in\r\\n\\t\\t\\t\\tself-defence - he returned with his followers to Medina\r\\n\\t\\t\\t\\twithout engaging in hostilities. At the time of the\r\\n\\t\\t\\t\\tpreparation for this expedition, the hypocrites and a\r\\n\\t\\t\\t\\tminority among the believers displayed an extreme\r\\n\\t\\t\\t\\treluctance (referred to in this and the following verses)\r\\n\\t\\t\\t\\tto embark on a war with Byzantium: and it is this\r\\n\\t\\t\\t\\tminority that the above verse reproaches for \"clinging\r\\n\\t\\t\\t\\theavily to the earth\" (Manar X 493)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "60",
    "Body": "Lit., \"him\". i.e., Muhammad."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "61",
    "Body": "Lit., \"the second of two\": an allusion to the Prophet's\\n\\t\\t\\t\\tflight, in the company of Abu Bakr, from Mecca to Medina\\n\\t\\t\\t\\tin the year 622 of the Christian era. The expression \"the\\n\\t\\t\\t\\tsecond of two\" does not imply any order of precedence but\\n\\t\\t\\t\\tis synonymous with \"one of two\": cf. the Prophet's saying\\n\\t\\t\\t\\tto Abu Bakr, on that very occasion, \"What [could], in thy\\n\\t\\t\\t\\topinion, [happen] to two [men] who have God as the third\\n\\t\\t\\t\\twith them?\" (Bukhari, in the chapter Fada'il Ashab\\n\\t\\t\\t\\tan-Nabi.)"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "62",
    "Body": "When the Prophet and Abu Bakr left on their hijrah to\\n\\t\\t\\t\\tMedina, they first hid for three nights in a cave on\\n\\t\\t\\t\\tMount Thawr, in the vicinity of Mecca, where they were\\n\\t\\t\\t\\talmost discovered and apprehended by the pagan Quraysh\\n\\t\\t\\t\\twho were pursuing them (Bukhari, loc. cit.)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "63",
    "Body": "Cf. verse {26} above."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "64",
    "Body": "Lit., \"is the highest\". The expression rendered by me as\\n\\t\\t\\t\\t\"cause\", which occurs twice in this sentence, reads,\\n\\t\\t\\t\\tliterally, \"word\" (kalimah)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "41",
    "NoteID": "65",
    "Body": "Lit., \"lightly or heavily\". The rendering adopted by me\\n\\t\\t\\t\\tcorresponds to the interpretation given to this\\n\\t\\t\\t\\texpression by most of the classical commentators (e.g.,\\n\\t\\t\\t\\tZamakhshari and Razi)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "42",
    "NoteID": "66",
    "Body": "A reference to the unwillingness of some of the Muslims\\n\\t\\t\\t\\tto follow the Prophet's call and to set out on the\\n\\t\\t\\t\\texpedition to the frontier (see last paragraph of note\\n\\t\\t\\t\\t[59] above). A strenuous march of about fourteen days was\\n\\t\\t\\t\\tneeded to reach Tabuk, the goal of this expedition; and\\n\\t\\t\\t\\tthe uncertainty of its outcome, as well as the hardships\\n\\t\\t\\t\\tinvolved, gave rise to all manner of spurious excuses on\\n\\t\\t\\t\\tthe part of the half-hearted believers and hypocrites. As\\n\\t\\t\\t\\tthe next verse shows, the Prophet accepted these excuses\\n\\t\\t\\t\\tin many cases, and allowed the men concerned to remain at\\n\\t\\t\\t\\tMedina."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "43",
    "NoteID": "67",
    "Body": "All the commentators agree in that this phrase, although\\n\\t\\t\\t\\texpressed in the form of an invocation has the meaning of\\n\\t\\t\\t\\ta statement - \"God pardons thee\" or \"has pardoned thee\" -\\n\\t\\t\\t\\tabsolving the Prophet of any moral responsibility for his\\n\\t\\t\\t\\tmistaken, but humanly understandable, acceptance of\\n\\t\\t\\t\\tequivocal pleas on the part of those who wished to be\\n\\t\\t\\t\\texcused from participating in the campaign. To me it\\n\\t\\t\\t\\tseems that this statement of \"absolution\" was primarily\\n\\t\\t\\t\\tintended to free the Prophet from any self-reproach for\\n\\t\\t\\t\\this too-great liberality in this respect. (It should be\\n\\t\\t\\t\\tborne in mind that this part of At-Tawbah was revealed\\n\\t\\t\\t\\tduring or immediately after the expedition.)"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "44",
    "NoteID": "68",
    "Body": "Lit., \"has full knowledge of the God-conscious\\n\\t\\t\\t\\t(bi'l-muttaqin)\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "46",
    "NoteID": "69",
    "Body": "This may refer to the permission granted by the Prophet\\n\\t\\t\\t\\t(see verse {43}) to certain of his followers who, for\\n\\t\\t\\t\\tapparently legitimate reasons, were unable to take part\\n\\t\\t\\t\\tin the campaign (Tabari, Zamakhshari, Razi) - a\\n\\t\\t\\t\\tpermission of which the hypocrites only too readily\\n\\t\\t\\t\\tavailed themselves. As regards God's \"causing\" those\\n\\t\\t\\t\\thypocrites to sin in this way, see  2:7  and the\\n\\t\\t\\t\\tcorresponding note [7], as well as surah {3}, note [117]."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "48",
    "NoteID": "70",
    "Body": "I.e., before the expedition to Tabuk, during which these\\n\\t\\t\\t\\tpassages were revealed."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "49",
    "NoteID": "71",
    "Body": "I.e., at the time when the Prophet was making\\n\\t\\t\\t\\tpreparations for the campaign."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "49",
    "NoteID": "72",
    "Body": "See verses {44} and {45} above. It is to be noted that\\n\\t\\t\\t\\tboth the verbal form la taftinni (rendered by me as \"do\\n\\t\\t\\t\\tnot put me to too hard a test\") and the noun fitnah have\\n\\t\\t\\t\\tthe same root, comprising a great complex of meanings:\\n\\t\\t\\t\\te.g., test, trial, affliction, temptation to evil,\\n\\t\\t\\t\\tseduction, persecution, oppression, discord, civil\\n\\t\\t\\t\\tstrife, etc. ({cf. surah 8, note 25}). Since it is\\n\\t\\t\\t\\timpossible in any language but Arabic to reproduce all\\n\\t\\t\\t\\tthese many shades of meaning in a single expression, the\\n\\t\\t\\t\\trendering of the term fitnah must necessarily vary in\\n\\t\\t\\t\\taccordance with the context in which it is used."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "50",
    "NoteID": "73",
    "Body": "I.e., in the course of the expedition to Tabuk, during\\n\\t\\t\\t\\twhich most of this surah was revealed. One should,\\n\\t\\t\\t\\thowever, bear in mind that these verses have not merely a\\n\\t\\t\\t\\thistorical connotation but, rather, aim at depicting\\n\\t\\t\\t\\thypocrisy as such."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "52",
    "NoteID": "74",
    "Body": "I.e., either victory or martyrdom in God's cause. The\\n\\t\\t\\t\\tverb tarabbasa has usually the connotation of waiting\\n\\t\\t\\t\\twith expectancy, and is, therefore, most suitably\\n\\t\\t\\t\\trendered as \"he hopefully waited\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "52",
    "NoteID": "75",
    "Body": "Sc., in the life to come."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "53",
    "NoteID": "76",
    "Body": "I.e., \"it shall never be acceptable to God\": an allusion\\n\\t\\t\\t\\tto the readiness on the part of many hypocrites to\\n\\t\\t\\t\\tcontribute financially to \"good causes\", ostensibly for\\n\\t\\t\\t\\tthe sake of moral considerations but, in reality, \"only\\n\\t\\t\\t\\tto be seen and praised by men\" (cf.  2:264  and  4:38 )."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "54",
    "NoteID": "77",
    "Body": "Lit., \"nothing prevents their spending from being\\n\\t\\t\\t\\taccepted from them except that...\", etc."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "54",
    "NoteID": "78",
    "Body": "Lit., \"and they do not approach prayer without being\\n\\t\\t\\t\\treluctant\" - i.e., when they participate in acts of\\n\\t\\t\\t\\tworship they do it only for the sake of outward\\n\\t\\t\\t\\tconformity, and not out of inner conviction."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "55",
    "NoteID": "79",
    "Body": "Sc., \"for which sin they will have to suffer in the life\\n\\t\\t\\t\\tto come\". See also  3:178  and  8:28 , and the\\n\\t\\t\\t\\tcorresponding notes."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "57",
    "NoteID": "80",
    "Body": "Thus the Qur'an shows that the innermost cause of all\\n\\t\\t\\t\\thypocrisy is fear - fear of a moral commitment and, at\\n\\t\\t\\t\\tthe same time, fear of an open breach with one's social\\n\\t\\t\\t\\tenvironment. In their overriding, immoral desire for\\n\\t\\t\\t\\tsocial conformity, \"the hypocrites seek to deceive God -\\n\\t\\t\\t\\tthe while it is He who causes them to be deceived [by\\n\\t\\t\\t\\tthemselves]\" ( 4:142 ); and as \"they are oblivious of\\n\\t\\t\\t\\tGod, so He is oblivious of them\" ( 9:67 ). One should\\n\\t\\t\\t\\tnote, in this connection, that the Arabic term munafiq -\\n\\t\\t\\t\\twhich, for want of a better word, is rendered as\\n\\t\\t\\t\\t\"hypocrite\" - applies both to conscious dissemblers bent\\n\\t\\t\\t\\ton deceiving their fellow-men, as well as to people who,\\n\\t\\t\\t\\tout of an inner uncertainty, are deceiving themselves.\\n\\t\\t\\t\\tFor a fuller discussion of this term, see note [7] on\\n\\t\\t\\t\\t 29:11 , which probably represents the earliest instance\\n\\t\\t\\t\\tof its use in the Qur'an."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "58",
    "NoteID": "81",
    "Body": "Since there is no English equivalent for the term sadaqat\\n\\t\\t\\t\\t(sing. sadaqah), I am rendering it here as \"offerings\\n\\t\\t\\t\\tgiven for the sake of God\". This comprises everything\\n\\t\\t\\t\\tthat a believer freely gives to another person, out of\\n\\t\\t\\t\\tlove or compassion, as well as what he is morally or\\n\\t\\t\\t\\tlegally obliged to give, without expecting any worldly\\n\\t\\t\\t\\treturn: that is, charitable gifts and deeds of every\\n\\t\\t\\t\\tdescription (which is the primary meaning of sadaqat -\\n\\t\\t\\t\\te.g., in  2:263  and {264}), as well as the obligatory\\n\\t\\t\\t\\ttax called zakah (\"the purifying dues\", because its\\n\\t\\t\\t\\tpayment purifies, as it were, a person's property from\\n\\t\\t\\t\\tthe taint of selfishness). In the context of the above\\n\\t\\t\\t\\tverse, this term refers to the funds thus collected and\\n\\t\\t\\t\\tadministered by the Muslim community or state. When these\\n\\t\\t\\t\\tfunds are disbursed for the purposes stipulated in verse\\n\\t\\t\\t\\t{60}, they assume once more - this time in relation to\\n\\t\\t\\t\\tthe recipients - the aspect of \"charitable gifts\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "59",
    "NoteID": "82",
    "Body": "Lit., \"what God has given them, and His Apostle\": a\\n\\t\\t\\t\\ttypically Qur'anic construction meant to bring out the\\n\\t\\t\\t\\tfact that the real giver is God, and that the Apostle is\\n\\t\\t\\t\\tHis instrument. Although this passage relates, primarily,\\n\\t\\t\\t\\tto the hypocrites at Medina and the historical situation\\n\\t\\t\\t\\tobtaining at the time of the expedition to Tabuk, the\\n\\t\\t\\t\\timport of these verses goes beyond the historical\\n\\t\\t\\t\\toccasion of their revelation, describing as it does \"the\\n\\t\\t\\t\\tattitude and mentality of hypocrites of all times, and\\n\\t\\t\\t\\teverywhere\" (Manar X, 567). Consequently, we may assume\\n\\t\\t\\t\\tthat the reference, in this context, to \"God's Apostle\"\\n\\t\\t\\t\\tis not confined to the person of the Prophet Muhammad but\\n\\t\\t\\t\\timplies, metonymically, the Law of Islam as revealed\\n\\t\\t\\t\\tthrough him - and, thus, to every government that holds\\n\\t\\t\\t\\tauthority by virtue of that Law and rules in accordance\\n\\t\\t\\t\\twith it."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "60",
    "NoteID": "83",
    "Body": "See note [81] above."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "60",
    "NoteID": "84",
    "Body": "I.e., the officials entrusted with the collection and\\n\\t\\t\\t\\tadministration of zakah funds."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "60",
    "NoteID": "85",
    "Body": "These eight categories circumscribe all the purposes for\\n\\t\\t\\t\\twhich zakah funds may be expended. By \"those whose hearts\\n\\t\\t\\t\\tare to be won over\" are apparently meant such non-Muslims\\n\\t\\t\\t\\tas are close to understanding and, perhaps, accepting\\n\\t\\t\\t\\tIslam, and for whose conversion every effort should be\\n\\t\\t\\t\\tmade, either directly or indirectly (i.e., by means of\\n\\t\\t\\t\\tthe widest possible propagation of the teachings of\\n\\t\\t\\t\\tIslam). As regards the expression fi 'r-riqab (\"for the\\n\\t\\t\\t\\tfreeing of human beings from bondage\"), which relates\\n\\t\\t\\t\\tboth to the ransoming of prisoners of war and to the\\n\\t\\t\\t\\tfreeing of slaves, see surah {2}, note [146]. The term\\n\\t\\t\\t\\tal-gharimun describes people who are overburdened with\\n\\t\\t\\t\\tdebts contracted in good faith, which - through no fault\\n\\t\\t\\t\\tof their own - they are subsequently unable to redeem.\\n\\t\\t\\t\\tThe expression \"in God's cause\" embraces every kind of\\n\\t\\t\\t\\tstruggle in righteous causes, both in war and in peace,\\n\\t\\t\\t\\tincluding expenditure for the propagation of Islam and\\n\\t\\t\\t\\tfor all charitable purposes. Regarding the meaning of ibn\\n\\t\\t\\t\\tas-sabil (\"wayfarer\"), see surah {2}, note [145]."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "61",
    "NoteID": "86",
    "Body": "I.e., \"he believes everything that he hears\". Most of the\\n\\t\\t\\t\\tcommentators assume that the hypocrites were thus\\n\\t\\t\\t\\talluding to the Prophet's alleged propensity to believe\\n\\t\\t\\t\\teverything - good or bad - that he was told about other\\n\\t\\t\\t\\tpeople (cf. Manar X, 600). Since, however, there is no\\n\\t\\t\\t\\thistorical evidence of such a \"propensity\" on his part,\\n\\t\\t\\t\\tit seems to me that what the hypocrites referred to was\\n\\t\\t\\t\\tthe Prophet's readiness to listen to what they - in\\n\\t\\t\\t\\tcommon with many other unbelievers - regarded as mere\\n\\t\\t\\t\\thallucinatory sounds, and to interpret them \"mistakenly\"\\n\\t\\t\\t\\tas revelations. This would explain the statement that\\n\\t\\t\\t\\t\"they malign the Prophet\" - namely, by attributing to him\\n\\t\\t\\t\\tself-deception - and that this saying of theirs \"amounts\\n\\t\\t\\t\\tto a denial of the truth\" (see verse {74} of this surah).\\n\\t\\t\\t\\t- The verb adha signifies primarily \"he molested\" or\\n\\t\\t\\t\\t\"annoyed [another]\", i.e., in a manner not amounting to\\n\\t\\t\\t\\tactual harm (darar). Since in the above context this verb\\n\\t\\t\\t\\tis used in the sense of making a derogatory remark,\\n\\t\\t\\t\\tyu'dhun is best rendered as \"they malign\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "61",
    "NoteID": "87",
    "Body": "I.e., to divine revelation."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "62",
    "NoteID": "88",
    "Body": "Lit., \"the while God and His Apostle are most entitled\\n\\t\\t\\t\\tthat they should seek His pleasure...\", etc. As has been\\n\\t\\t\\t\\tpointed out by many of the commentators (and most\\n\\t\\t\\t\\tsuccinctly by Rashid Rida' in Manar X, 607f.), there is\\n\\t\\t\\t\\tno question of any juxtaposition of God and His Apostle\\n\\t\\t\\t\\tin this phrase. This is made clear by the use of the\\n\\t\\t\\t\\tsingular pronoun in an yurduhu (\"that they should seek\\n\\t\\t\\t\\tHis pleasure\"), which is meant to bring out - in the\\n\\t\\t\\t\\tinimitable elliptic form so characteristic of the Qur'an\\n\\t\\t\\t\\t- the idea that God's pleasure is the only worthwhile\\n\\t\\t\\t\\tgoal of all human endeavour, and that a believer's duty\\n\\t\\t\\t\\tto surrender to the Prophet's guidance is but an outcome\\n\\t\\t\\t\\tof the fact that he is the bearer of God's message to\\n\\t\\t\\t\\tman. Cf. in this connection, \"Whoever pays heed unto the\\n\\t\\t\\t\\tApostle pays heed unto God thereby\" ( 4:80 ), or, \"Say [O\\n\\t\\t\\t\\tProphet]: 'If you love God, follow me, [and] God will\\n\\t\\t\\t\\tlove you'\" ( 3:31 )."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "64",
    "NoteID": "89",
    "Body": "This refers to a particular type of hypocrite: namely, to\\n\\t\\t\\t\\tthe doubter who, not having any real convictions on this\\n\\t\\t\\t\\tscore, leaves the question of God's existence and/or\\n\\t\\t\\t\\tMuhammad's prophethood open (Manar X, 610), but\\n\\t\\t\\t\\tnevertheless, for the sake of worldly advantage, would\\n\\t\\t\\t\\tlike to be regarded as a believer. (Since, obviously, not\\n\\t\\t\\t\\tall hypocrites belong to this category, my interpolation\\n\\t\\t\\t\\tof the words \"some of\" at the beginning of this verse\\n\\t\\t\\t\\twould seem to be justified.) The ambivalent attitude of\\n\\t\\t\\t\\tmind alluded to here implies hypocrisy not merely with\\n\\t\\t\\t\\tregard to one's social environment but also with regard\\n\\t\\t\\t\\tto oneself: an unwillingness - or, rather, fear - on the\\n\\t\\t\\t\\tpart of such people to admit to themselves \"what is\\n\\t\\t\\t\\treally going on in their hearts\" (cf. verses {56-57} and\\n\\t\\t\\t\\tnote [80] above), and the dim realization that this\\n\\t\\t\\t\\tambivalence is only a cover for their desire to escape\\n\\t\\t\\t\\tfrom all spiritual commitment (cf.  2:9  - \"they would\\n\\t\\t\\t\\tdeceive God and those who have attained to faith - the\\n\\t\\t\\t\\twhile they deceive none but themselves\")."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "64",
    "NoteID": "90",
    "Body": "Namely, self-knowledge. The accusation of \"mocking\"\\n\\t\\t\\t\\trefers to their frivolous allusion to the Prophet, \"He is\\n\\t\\t\\t\\tall ear\" (see verse {61} and note [86] above)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "65",
    "NoteID": "91",
    "Body": "Most of the classical commentators assume that this\\n\\t\\t\\t\\trefers to the derisive remarks made by some of the\\n\\t\\t\\t\\thypocrites about the alleged futility of the expedition\\n\\t\\t\\t\\tto Tabuk. In view of the sequence, however, I am of the\\n\\t\\t\\t\\topinion that this is a further reference to those who\\n\\t\\t\\t\\t\"malign the Prophet by saying, 'He is all ear'\" (verse\\n\\t\\t\\t\\t{61}) - i.e., accuse him of self-deception - and thus, by\\n\\t\\t\\t\\timplication, \"mock at God and His messages\" (see next\\n\\t\\t\\t\\tsentence)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "66",
    "NoteID": "92",
    "Body": "See note [89] above."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "66",
    "NoteID": "93",
    "Body": "I.e., consciously persevered in hypocrisy (Zamakhshari).\\n\\t\\t\\t\\tThe above Qur'anic sentence expresses the doctrine that\\n\\t\\t\\t\\tin His final judgment God will take into account all that\\n\\t\\t\\t\\tis in a sinner's heart, and will not indiscriminately\\n\\t\\t\\t\\tcondemn everyone who has been sinning out of weakness or\\n\\t\\t\\t\\tout of an inner inability to resolve his doubts, and not\\n\\t\\t\\t\\tout of a conscious inclination to evil (cf.  4:98  -\\n\\t\\t\\t\\t\"excepted shall be the [truly] helpless - be they men or\\n\\t\\t\\t\\twomen or children - who cannot bring forth any strength\\n\\t\\t\\t\\tand have not been shown [or \"cannot find\"] the right\\n\\t\\t\\t\\tway\")."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "67",
    "NoteID": "94",
    "Body": "I.e., their behaviour is - in its effect, at least - the\\n\\t\\t\\t\\texact opposite of that expected of the believers (cf.\\n\\t\\t\\t\\t 3:104 , {110} and {114};  9:71  and {112}; and  22:41 )."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "67",
    "NoteID": "95",
    "Body": "It is to be borne in mind that this and the following\\n\\t\\t\\t\\tverses refer to the conscious hypocrites spoken of in the\\n\\t\\t\\t\\tlast sentence of the preceding verse, and not to the\\n\\t\\t\\t\\twaverers, whose hypocrisy is an outcome of inner fears\\n\\t\\t\\t\\tand uncertainties."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "69",
    "NoteID": "96",
    "Body": "A reference to the statement, in verse {67}, that\r\\n\\t\\t\\t\\tconscious hypocrites are intrinsically \"all of a kind\" (ba'duhum\r\\n\\t\\t\\t\\tmin ba'd)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "69",
    "NoteID": "97",
    "Body": "Sc., \"and the same will happen to you unless you repent\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "70",
    "NoteID": "98",
    "Body": "I.e., Sodom and Gomorrah, the cities of Lot's people (see\\n\\t\\t\\t\\t{7:80-84} and {11:69-83}). References to the chastisement\\n\\t\\t\\t\\tmeted out to Noah's people as well as to the 'Ad and\\n\\t\\t\\t\\tThamud and the folk of Madyan (the Biblical Midian) are\\n\\t\\t\\t\\tfound in several places in the Qur'an; see, in\\n\\t\\t\\t\\tparticular, {7:59-79} and {85-93}, and the corresponding\\n\\t\\t\\t\\tnotes. The reference to \"Abraham's people\" seems to point\\n\\t\\t\\t\\tto the Babylonians, who rejected the monotheism preached\\n\\t\\t\\t\\tby him, and to the overthrow of their first empire, at\\n\\t\\t\\t\\tabout 1100 B.C., by the Assyrians."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "71",
    "NoteID": "99",
    "Body": "Or: \"are the protectors [or \"friends and protectors\"] of\r\\n\\t\\t\\t\\tone another\". Since, however, the believers are here\r\\n\\t\\t\\t\\tcontrasted with the hypocrites, spoken of in verse {67}\r\\n\\t\\t\\t\\tas being \"all of a kind\", it is preferable to render the\r\\n\\t\\t\\t\\tterm wali (of which awliya' is the plural) in its primary\r\\n\\t\\t\\t\\tmeaning of being near\" or \"close\" to one another."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "72",
    "NoteID": "100",
    "Body": "For an explanation of this rendering of 'adn (akin to the\\n\\t\\t\\t\\tHebrew 'eden, \"delight\" or \"bliss\") see note [45] on\\n\\t\\t\\t\\t 38:50 , where this expression occurs for the first time\\n\\t\\t\\t\\tin the chronological order of Qur'anic revelation."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "73",
    "NoteID": "101",
    "Body": "I.e., \"do not compromise with them in matters of\\n\\t\\t\\t\\tprinciple\". Regarding the meaning of the verb jahada (\"he\\n\\t\\t\\t\\tstrove hard\", i.e., in a righteous cause), see surah {4},\\n\\t\\t\\t\\tnote [122]. The imperative jahid is obviously used here\\n\\t\\t\\t\\tin its spiritual connotation, implying efforts at\\n\\t\\t\\t\\tconvincing both the outspoken unbelievers and the\\n\\t\\t\\t\\twaverers, including the various types of hypocrites\\n\\t\\t\\t\\tspoken of in the preceding passages. Although the\\n\\t\\t\\t\\timperative is addressed in the first instance to the\\n\\t\\t\\t\\tProphet, it is considered to be morally binding on all\\n\\t\\t\\t\\tbelievers."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "74",
    "NoteID": "102",
    "Body": "See the first sentence of verse {61} above, and the\\n\\t\\t\\t\\tcorresponding note [86]. The allegation that the Prophet\\n\\t\\t\\t\\tdeceived himself in the matter of revelation is,\\n\\t\\t\\t\\tnaturally, equivalent to disbelief in the outcome of his\\n\\t\\t\\t\\trevelation, i.e., the Qur'an."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "74",
    "NoteID": "103",
    "Body": "Lit., \"which they were unable to attain to\". The\\n\\t\\t\\t\\tclassical commentators take this as a reference to an\\n\\t\\t\\t\\tabortive plot, on the part of some of the hypocrites, to\\n\\t\\t\\t\\tkill the Prophet during the expedition to Tabuk. However,\\n\\t\\t\\t\\twithout contesting the validity of this historical\\n\\t\\t\\t\\tinterpretation, I believe that the above allusion has a\\n\\t\\t\\t\\tfar deeper meaning - namely, the existential\\n\\t\\t\\t\\timpossibility of one's ever attaining to inner peace\\n\\t\\t\\t\\twithout a positive belief that man's life has meaning and\\n\\t\\t\\t\\tpurpose, either of which can be glimpsed only through the\\n\\t\\t\\t\\trevelations bestowed on those exceptionally gifted and\\n\\t\\t\\t\\treceptive personalities, the prophets. (An indirect\\n\\t\\t\\t\\treference to divine revelation as the only source of this\\n\\t\\t\\t\\tkind of cognition appears in  96:5 , that is, in the\\n\\t\\t\\t\\tearliest Qur'anic passage revealed to the Prophet.) Thus,\\n\\t\\t\\t\\ttorn between their half-hearted desire to \"surrender\\n\\t\\t\\t\\tthemselves to God\" and their unwillingness to accept the\\n\\t\\t\\t\\tdivine guidance offered them by the Prophet, the\\n\\t\\t\\t\\thypocrites \"were aiming at something which was beyond\\n\\t\\t\\t\\ttheir reach\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "74",
    "NoteID": "104",
    "Body": "I.e., by means of the spiritual guidance contained in the\\n\\t\\t\\t\\tQur'an and the material welfare resulting from an\\n\\t\\t\\t\\tadherence to its moral and social principles. The above\\n\\t\\t\\t\\tphrase implies that the reluctance of the hypocrites to\\n\\t\\t\\t\\tpay heed to the Prophet was not due to their finding\\n\\t\\t\\t\\tfault with the Faith as such but, rather, to their lack\\n\\t\\t\\t\\tof gratitude for the spiritual and material benefits\\n\\t\\t\\t\\twhich they had derived from it. (Because of its\\n\\t\\t\\t\\thistorical associations, most of this verse is expressed\\n\\t\\t\\t\\tin the past tense, although its moral import is obviously\\n\\t\\t\\t\\ttimeless.)"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "77",
    "NoteID": "105",
    "Body": "Lit., \"He has caused hypocrisy to become for them\\n\\t\\t\\t\\tconsequence (a'qabahum) in their hearts until the Day on\\n\\t\\t\\t\\twhich they shall meet Him\" (i.e., until their\\n\\t\\t\\t\\tresurrection). Thus, the Qur'an states that it is\\n\\t\\t\\t\\texcessive love of worldly possessions which gives rise,\\n\\t\\t\\t\\tin a certain type of man, to the attitude of mind\\n\\t\\t\\t\\tdescribed as \"hypocrisy\" - and not vice versa (see also\\n\\t\\t\\t\\t 29:11  and the corresponding note [7]). Cf. in this\\n\\t\\t\\t\\tconnection the Prophet's saying, reported by Abu\\n\\t\\t\\t\\tHurayrah: \"The mark (ayah) of the hypocrite is threefold:\\n\\t\\t\\t\\twhen he speaks, he lies; and when he promises, he breaks\\n\\t\\t\\t\\this promise; and when he is trusted, he betrays\"\\n\\t\\t\\t\\t(Bukhari, Muslim, Tirmidhi and Nasa'i; similar\\n\\t\\t\\t\\tTraditions, on the authority of 'Abd Allah ibn 'Amr, are\\n\\t\\t\\t\\tquoted by Bukhari, Muslim, Abu Da'ud, Nasa'i, Ibn Majah\\n\\t\\t\\t\\tand Ibn Hanbal)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "77",
    "NoteID": "106",
    "Body": "I.e., to themselves, trying to find excuses for their\\n\\t\\t\\t\\tbreaking their vow."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "79",
    "NoteID": "107",
    "Body": "Regarding my rendering of sadaqat as \"that which is given\\n\\t\\t\\t\\tfor the sake of God\", see [note 81] above."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "79",
    "NoteID": "108",
    "Body": "There are many authentic Traditions to the effect that\\n\\t\\t\\t\\tthe hypocrites at Medina used to deride the offerings\\n\\t\\t\\t\\twhich the believers brought to the Prophet (as head of\\n\\t\\t\\t\\tthe community and the state) in response to the Qur'anic\\n\\t\\t\\t\\tordinance that they should \"give for the sake of God\".\\n\\t\\t\\t\\tFor instance, the Companion Abu Mas'ud reports: \"[When] a\\n\\t\\t\\t\\tman brought an ample offering, they [i.e., the\\n\\t\\t\\t\\thypocrites] would say, 'He [only] wants to be seen and\\n\\t\\t\\t\\tpraised by men'; and when a man brought an offering of a\\n\\t\\t\\t\\tsmall measure [of dates or grain], they would say, 'God\\n\\t\\t\\t\\tdoes not stand in need of such an offering'\" (Bukhari and\\n\\t\\t\\t\\tMuslim, and many similar versions in other hadith\\n\\t\\t\\t\\tcompilations). The above verse, however, does not allude\\n\\t\\t\\t\\tmerely to these historical incidents but serves to\\n\\t\\t\\t\\tillustrate the mentality of the hypocrite whose own\\n\\t\\t\\t\\tinsincerity colours his view of all other people."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "79",
    "NoteID": "109",
    "Body": "Lit., \"God will scoff at them\": a turn of phrase often\\n\\t\\t\\t\\toccurring in the Qur'an (e.g., in  2:15 ), indicating\\n\\t\\t\\t\\tGod's requital."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "80",
    "NoteID": "110",
    "Body": "I.e., many times. In Arabic usage, the number \"seventy\"\\n\\t\\t\\t\\toften stands for \"many\", just as \"seven\" is a synonym for\\n\\t\\t\\t\\t\"several\" (see Lisan al-'Arab and Taj al-'Arus). It is\\n\\t\\t\\t\\tevident from many authentic Traditions (recorded, among\\n\\t\\t\\t\\tothers, by Bukhari and Muslim) that the Prophet often\\n\\t\\t\\t\\tprayed to God that He pardon his enemies."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "80",
    "NoteID": "111",
    "Body": "I.e., \"those who are so deeply rooted in their iniquity\\n\\t\\t\\t\\tand in their insolent persistence in evildoing\\n\\t\\t\\t\\t(tamarrud)... [that] they have lost all disposition for\\n\\t\\t\\t\\trepentance and belief\" (Manar X, 657)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "81",
    "NoteID": "112",
    "Body": "Lit., \"rejoiced in their sitting [at home]\" - a reference\\n\\t\\t\\t\\tto those who, under one pretext or another, excused\\n\\t\\t\\t\\tthemselves from participating in the expedition to Tabuk\\n\\t\\t\\t\\t(see notes [59] and [66] above). As is evident from the\\n\\t\\t\\t\\tsequence - and clearly stated in many authentic\\n\\t\\t\\t\\tTraditions - one of the excuses advanced was the extreme\\n\\t\\t\\t\\theat of the season."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "82",
    "NoteID": "113",
    "Body": "Lit., \"and let them weep a lot\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "83",
    "NoteID": "114",
    "Body": "Lit., \"if God brings thee back [from the campaign] to a\\n\\t\\t\\t\\tgroup of them\" - i.e., to those hypocrites who remained\\n\\t\\t\\t\\tat home under false pretences."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "83",
    "NoteID": "115",
    "Body": "I.e., with the old men, the women, the children and the\\n\\t\\t\\t\\tsick, who are not able or not expected to go to war\\n\\t\\t\\t\\t(Manar X, 662)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "84",
    "NoteID": "116",
    "Body": "I.e., unless he has repented before his death. It is\r\\n\\t\\t\\t\\treported that when the life-long opponent of the Prophet\r\\n\\t\\t\\t\\tand leader of the hypocrites of Medina,'Abd Allah ibn\r\\n\\t\\t\\t\\tUbayy was dying, he sent his son to the Prophet with the\r\\n\\t\\t\\t\\trequest that the latter give him his (the Prophet's)\r\\n\\t\\t\\t\\tshirt, so that he might be buried in it, and that the\r\\n\\t\\t\\t\\tProphet should pray over him after his death. The Prophet\r\\n\\t\\t\\t\\ttook this request as a sign of Ibn Ubayy's repentance,\r\\n\\t\\t\\t\\tand gave him his shirt and later led the funeral prayers\r\\n\\t\\t\\t\\tover his body. When 'Umar ibn al-Khattab vehemently\r\\n\\t\\t\\t\\tprotested against this clemency towards the man whom all\r\\n\\t\\t\\t\\tthe believers had regarded as \"God's enemy\", the Prophet\r\\n\\t\\t\\t\\tanswered, \"God has granted me a choice in this matter [a\r\\n\\t\\t\\t\\treference to verse {80} of this surah, \"whether thou dost\r\\n\\t\\t\\t\\tpray that they be forgiven or dost not pray...\", etc.],\r\\n\\t\\t\\t\\tand so I shall pray [for him] more than seventy times.\"\r\\n\\t\\t\\t\\tSeveral variants of this Tradition are to be found in\r\\n\\t\\t\\t\\tBukhari, Tirmidhi, Nasa'i, Ibn Hanbal. on the authority\r\\n\\t\\t\\t\\tof Ibn 'Abbas; Bukhari and Muslim, on the authority of\r\\n\\t\\t\\t\\tIbn 'Umar; Muslim, on the authority of Jabir ibn'Abd\r\\n\\t\\t\\t\\tAllah; and in various other hadith compilations. Since\r\\n\\t\\t\\t\\t'Abd Allah ibn Ubayy died some time after the Prophet's\r\\n\\t\\t\\t\\treturn from Tabuk, while verse {84} - like most of this\r\\n\\t\\t\\t\\tsurah - was revealed during the campaign, it is clear\r\\n\\t\\t\\t\\tthat the prohibition expressed in this verse relates only\r\\n\\t\\t\\t\\t(as the sequence shows) to those who \"were bent on\r\\n\\t\\t\\t\\tdenying God and His Apostle, and [who] died in this their\r\\n\\t\\t\\t\\tiniquity\" - that is, to unrepentant sinners."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "84",
    "NoteID": "117",
    "Body": "Lit., \"while they were iniquitous\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "85",
    "NoteID": "118",
    "Body": "Cf.  3:178  and  8:28 , as well as the corresponding\\n\\t\\t\\t\\tnotes. This (almost literal) repetition of {verse 55}\\n\\t\\t\\t\\tabove is meant to stress the psychological importance of\\n\\t\\t\\t\\tthis problem (Zamakhshari) - namely, the insignificance\\n\\t\\t\\t\\tof worldly happiness as compared with spiritual\\n\\t\\t\\t\\trighteousness or the absence of it."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "86",
    "NoteID": "119",
    "Body": "Lit., \"when a surah was bestowed from on high\": the word\\n\\t\\t\\t\\tsurah being here synonymous with \"revealed message\" (see\\n\\t\\t\\t\\tnote [25] on  47:20 )."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "86",
    "NoteID": "120",
    "Body": "I.e., with those who were either not expected to go to\\n\\t\\t\\t\\twar - like women and children - or were handicapped by\\n\\t\\t\\t\\told age or illness."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "87",
    "NoteID": "121",
    "Body": "Cf.  2:7  and the corresponding note, as well as\\n\\t\\t\\t\\t{7:100-101}."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "90",
    "NoteID": "122",
    "Body": "I.e., from participating in the expedition to Tabuk. The\\n\\t\\t\\t\\tterm al-mu'adhdhirun connotes both \"those having a valid\\n\\t\\t\\t\\texcuse ('udhr)\" and \"those offering false excuses\"; it\\n\\t\\t\\t\\tis, therefore, best rendered as \"such as had some excuse\\n\\t\\t\\t\\tto offer\". The specific mention of the a'rab (\"bedouin\")\\n\\t\\t\\t\\tin this and the following passages probably arises from\\n\\t\\t\\t\\tthe fact that their attitude - positive or negative -\\n\\t\\t\\t\\ttowards Islam was of the greatest importance within the\\n\\t\\t\\t\\tcontext of early Muslim history, inasmuch as the message\\n\\t\\t\\t\\tof Muhammad could not obtain a real, lasting foothold in\\n\\t\\t\\t\\tArabia without first securing the allegiance of those\\n\\t\\t\\t\\twarlike nomads and half-nomads, who constituted the great\\n\\t\\t\\t\\tmajority of the Peninsula's population. At the time when\\n\\t\\t\\t\\tthe Prophet was preparing to set out towards Tabuk, many\\n\\t\\t\\t\\tof the already-converted tribesmen were willing to go to\\n\\t\\t\\t\\twar under his leadership (and, in fact, did so), while\\n\\t\\t\\t\\tothers were afraid lest in their absence their\\n\\t\\t\\t\\tencampments, denuded of man-power, be raided by hostile,\\n\\t\\t\\t\\tas yet unconverted tribes (Razi); others, again, were\\n\\t\\t\\t\\tsimply averse to exposing themselves to the hardships of\\n\\t\\t\\t\\ta campaign in distant lands, which did not seem to them\\n\\t\\t\\t\\tto have any bearing on their own, immediate interests."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "90",
    "NoteID": "123",
    "Body": "I.e., without even caring to come to Medina and to excuse\\n\\t\\t\\t\\tthemselves."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "91",
    "NoteID": "124",
    "Body": "I.e., the old and the infirm."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "91",
    "NoteID": "125",
    "Body": "Lit., \"who do not find anything to spend\", i.e., on their\\n\\t\\t\\t\\tequipment. At the time in question a public treasury did\\n\\t\\t\\t\\tnot yet exist, and every participant in a military\\n\\t\\t\\t\\texpedition was expected to provide his own weapons and\\n\\t\\t\\t\\tmounts."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "93",
    "NoteID": "126",
    "Body": "Lit., \"who ask thee for exemption while they are rich\".\\n\\t\\t\\t\\tThe term ghani denotes \"one who is rich\" or \"free from\\n\\t\\t\\t\\twant\" or \"self-sufficient\"; in this context it obviously\\n\\t\\t\\t\\trefers to physical competence in addition to financial\\n\\t\\t\\t\\tmeans: that is, to people who were able-bodied as well as\\n\\t\\t\\t\\tfinancially in a position to equip themselves (cf. verses\\n\\t\\t\\t\\t{86-87} above)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "94",
    "NoteID": "127",
    "Body": "Lit., \"and thereafter you will be brought back unto Him\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "94",
    "NoteID": "128",
    "Body": "See surah {6}, note [65]."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "95",
    "NoteID": "129",
    "Body": "Sc., \"and not punishing them\". As a matter of fact, their\\n\\t\\t\\t\\tfears were unfounded, since, on his return from Tabuk,\\n\\t\\t\\t\\tthe Prophet took no punitive action against any of those\\n\\t\\t\\t\\twho had failed to follow him on his campaign."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "97",
    "NoteID": "130",
    "Body": "The words interpolated by me between brackets at the\\n\\t\\t\\t\\tbeginning of this sentence are based on the\\n\\t\\t\\t\\tinterpretation given by Razi (see also Manar XI, 8),\\n\\t\\t\\t\\tobviously in view of verse {99}, which speaks of\\n\\t\\t\\t\\tbelievers among the bedouin."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "97",
    "NoteID": "131",
    "Body": "Owing to their nomadic way of life and its inherent\\n\\t\\t\\t\\thardship and crudity, the bedouin find it more difficult\\n\\t\\t\\t\\tthan do settled people to be guided by ethical\\n\\t\\t\\t\\timperatives unconnected with their immediate tribal\\n\\t\\t\\t\\tinterests - a difficulty which is still further enhanced\\n\\t\\t\\t\\tby their physical distance from the centres of higher\\n\\t\\t\\t\\tculture and, consequently, their comparative ignorance of\\n\\t\\t\\t\\tmost religious demands. It was for this reason that the\\n\\t\\t\\t\\tProphet often stressed the superiority of a settled mode\\n\\t\\t\\t\\tof life to a nomadic one: cf. his saying, \"He who dwells\\n\\t\\t\\t\\tin the desert (al-badiyah) becomes rough in disposition\",\\n\\t\\t\\t\\trecorded by Tirmidhi, Abu Da'ud, Nasa'i and Ibn Hanbal on\\n\\t\\t\\t\\tthe authority of Ibn 'Abbas, and a similar Tradition, on\\n\\t\\t\\t\\tthe authority of Abu Hurayrah, by Abu Da'ud and Bayhaqi."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "100",
    "NoteID": "132",
    "Body": "In the above context, the term muhajirun - lit.,\\n\\t\\t\\t\\t\"emigrants\", rendered by me as \"those who have forsaken\\n\\t\\t\\t\\tthe domain of evil\" (see surah {2}, note [203], and surah\\n\\t\\t\\t\\t{4}, note [124]) - applies primarily to the Meccan\\n\\t\\t\\t\\tfollowers of the Prophet who migrated (hajaru) from Mecca\\n\\t\\t\\t\\tto Medina - which until then was called Yathrib - at a\\n\\t\\t\\t\\ttime when Mecca was still in the possession of the\\n\\t\\t\\t\\tenemies of Islam, the \"first and foremost\" among them\\n\\t\\t\\t\\twere the earliest emigrants, i.e., those who left Mecca\\n\\t\\t\\t\\tin or before the year 622 of the Christian era (which\\n\\t\\t\\t\\tmarks the beginning of the Islamic hijri era) and in the\\n\\t\\t\\t\\tcourse of the next few years, when the Muslim community\\n\\t\\t\\t\\tat Medina was still in danger of being overrun by the\\n\\t\\t\\t\\tpowerful Quraysh of Mecca. Similarly, the term ansar\\n\\t\\t\\t\\t(lit., \"helpers\") applies here to the early converts from\\n\\t\\t\\t\\tamong the people of Medina who sheltered and succoured\\n\\t\\t\\t\\t(nasaru) their brethren in faith - the \"first and\\n\\t\\t\\t\\tforemost\" among them being those who embraced Islam\\n\\t\\t\\t\\tbefore and shortly after the Prophet's and his\\n\\t\\t\\t\\tCompanions' exodus (hijrah) from Mecca, and particularly\\n\\t\\t\\t\\tthose who did so on the occasion of the two meetings, at\\n\\t\\t\\t\\tAl-'Aqabah near Mecca between the Prophet and deputations\\n\\t\\t\\t\\tof the Yathrib tribes of Al-Aws and Khazraj (a little\\n\\t\\t\\t\\tover a year and a few months, respectively, before the\\n\\t\\t\\t\\tProphet's hijrah). Apart, however, from their purely\\n\\t\\t\\t\\thistorical connotations, both the terms muhajirun and\\n\\t\\t\\t\\tansar bear in the Qur'an a spiritual meaning as well, and\\n\\t\\t\\t\\tare often used to describe those who morally \"forsake the\\n\\t\\t\\t\\tdomain of evil\" and those who \"shelter and succour the\\n\\t\\t\\t\\tFaith\" (see surah {8}, note [78])."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "101",
    "NoteID": "133",
    "Body": "I.e., Medina. Originally, the city bore the name Yathrib;\\n\\t\\t\\t\\tbut after the exodus of the Prophet from Mecca it came to\\n\\t\\t\\t\\tbe known as Madinat an-Nabi (\"the City of the Prophet\")\\n\\t\\t\\t\\tand, eventually, as Al-Madinah (\"The City\" par\\n\\t\\t\\t\\texcellence)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "101",
    "NoteID": "134",
    "Body": "I.e., first through failure in their worldly concerns,\\n\\t\\t\\t\\taccompanied by pangs of conscience and the resulting\\n\\t\\t\\t\\tspiritual distress, and then through a full realization,\\n\\t\\t\\t\\tat the moment of dying, of the unforgivable nature of\\n\\t\\t\\t\\ttheir sin (Manar XI, 19)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "102",
    "NoteID": "135",
    "Body": "I.e., neither believers in the full sense of the word nor\\n\\t\\t\\t\\thypocrites, but half-hearted, confused waverers between\\n\\t\\t\\t\\tright and wrong, or between truth and falsehood."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "102",
    "NoteID": "136",
    "Body": "Lit., \"who have acknowledged their sins [after] having\\n\\t\\t\\t\\tmingled a righteous deed with another that was evil\".\\n\\t\\t\\t\\tAlthough it relates primarily to the vacillating Muslims\\n\\t\\t\\t\\twho refused to participate in the expedition to Tabuk,\\n\\t\\t\\t\\tthis verse alludes, in its wider meaning, to all sinners\\n\\t\\t\\t\\twho - without external prompting - become conscious of\\n\\t\\t\\t\\ttheir wrongdoing and repent of it."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "103",
    "NoteID": "137",
    "Body": "Lit., \"take out of their possessions an offering for the\\n\\t\\t\\t\\tsake of God (sadaqah)\". For the meaning of this term, see\\n\\t\\t\\t\\tnote [81] above. In this context, it primarily denotes\\n\\t\\t\\t\\tthe tax called zakah (\"the purifying dues\") incumbent on\\n\\t\\t\\t\\tevery Muslim enjoying a certain minimum of property\\n\\t\\t\\t\\tand/or income. Since an acceptance of zakah by the head\\n\\t\\t\\t\\tof state (or of the community) amounts to a recognition\\n\\t\\t\\t\\tof the giver as a \"Muslim\" in the Qur'anic sense of this\\n\\t\\t\\t\\tterm, the Prophet refused to accept it from all whose\\n\\t\\t\\t\\tbehaviour had made it obvious that they were hypocrites;\\n\\t\\t\\t\\tthe above verse, however, authorizes him (and, by\\n\\t\\t\\t\\timplication, the authorities of an Islamic state at all\\n\\t\\t\\t\\ttimes) to accept the payment of zakah from those who\\n\\t\\t\\t\\texpress their repentance by deeds as well as by words."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "104",
    "NoteID": "138",
    "Body": "Lit., \"who accepts repentance from His servants\": thus\\n\\t\\t\\t\\tpointing out that no human being, not even the Prophet,\\n\\t\\t\\t\\thas the power to absolve a sinner of his guilt (Manar XI,\\n\\t\\t\\t\\t32). A prophet can do no more than pray to God that He\\n\\t\\t\\t\\tforgive the sinners."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "105",
    "NoteID": "139",
    "Body": "This connects with the injunction in verse {103} above,\\n\\t\\t\\t\\t\"accept that [part] of their possessions which is offered\\n\\t\\t\\t\\tfor the sake of God,...and pray for them\". The stress on\\n\\t\\t\\t\\taction as an integral part of faith is of fundamental\\n\\t\\t\\t\\timportance in the ethics of the Qur'an: cf. the frequent\\n\\t\\t\\t\\tjuxtaposition of the concepts of \"believing\" and \"doing\\n\\t\\t\\t\\tgood works\", and the condemnation of all \"who, while\\n\\t\\t\\t\\tbelieving, wrought no good works\" (see  6:158  and the\\n\\t\\t\\t\\tcorresponding note [160])."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "105",
    "NoteID": "140",
    "Body": "See surah {6}, note [65]."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "106",
    "NoteID": "141",
    "Body": "Lit., \"deferred unto God's decree (amr)\" - i.e., kept in\\n\\t\\t\\t\\tabeyance in anticipation of their future repentance. As\\n\\t\\t\\t\\tin the preceding four verses, the people referred to here\\n\\t\\t\\t\\tare, in the first instance, the waverers who stayed away\\n\\t\\t\\t\\tfrom the campaign of Tabuk, and, by implication, all\\n\\t\\t\\t\\thalf-hearted believers who confusedly hover between right\\n\\t\\t\\t\\tand wrong: with the difference, however, that whereas the\\n\\t\\t\\t\\trepentant sinners spoken of in verses {102-105} are said\\n\\t\\t\\t\\tto have realized their sinfulness spontaneously, the kind\\n\\t\\t\\t\\tof people referred to in verse {106} have not yet reached\\n\\t\\t\\t\\tthe stage of moral self-examination and repentance, with\\n\\t\\t\\t\\tthe result that their cases are \"deferred\" until such a\\n\\t\\t\\t\\ttime as their impulses sway them entirely one way or\\n\\t\\t\\t\\tanother. From a psychological point of view, it is\\n\\t\\t\\t\\tpossible to discern a subtle connection between this\\n\\t\\t\\t\\tverse and {7:46-47}."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "107",
    "NoteID": "142",
    "Body": "Lit., \"who have been warring against God and His Apostle\r\\n\\t\\t\\t\\taforetime\" - i.e., before the expedition to Tabuk. The\r\\n\\t\\t\\t\\thistorical occasion to which this verse refers may be\r\\n\\t\\t\\t\\tthus summarized: Ever since his exodus from Mecca to\r\\n\\t\\t\\t\\tMedina the Prophet was violently opposed by one Abu 'Amir\r\\n\\t\\t\\t\\t(\"The Monk\"), a prominent member of the Khazraj tribe,\r\\n\\t\\t\\t\\twho had embraced Christianity many years earlier and\r\\n\\t\\t\\t\\tenjoyed a considerable reputation among his compatriots\r\\n\\t\\t\\t\\tand among the Christians of Syria. From the very outset\r\\n\\t\\t\\t\\the allied himself with the Prophet's enemies, the Meccan\r\\n\\t\\t\\t\\tQuraysh, and took part on their side in the battle of\r\\n\\t\\t\\t\\tUhud (3 H.). Shortly thereafter he migrated to Syria and\r\\n\\t\\t\\t\\tdid all that he could to induce the Emperor of Byzantium,\r\\n\\t\\t\\t\\tHeraclius, to invade Medina and crush the Muslim\r\\n\\t\\t\\t\\tcommunity once and for all. In Medina itself, Abu 'Amir\r\\n\\t\\t\\t\\thad some secret followers among the members of his tribe,\r\\n\\t\\t\\t\\twith whom he remained in constant correspondence. In the\r\\n\\t\\t\\t\\tyear 9 H. he informed them that Heraclius had agreed to\r\\n\\t\\t\\t\\tsend out an army against Medina, and that large-scale\r\\n\\t\\t\\t\\tpreparations were being made to this effect (which was\r\\n\\t\\t\\t\\tapparently the reason for the Prophet's preventive\r\\n\\t\\t\\t\\texpedition to Tabuk). In order that his followers should\r\\n\\t\\t\\t\\thave a rallying-place in the event of the expected\r\\n\\t\\t\\t\\tinvasion of Medina, Abu 'Amir suggested to his friends\r\\n\\t\\t\\t\\tthat they build a mosque of their own in the village of\r\\n\\t\\t\\t\\tQuba', in the immediate vicinity of Medina (which they\r\\n\\t\\t\\t\\tdid), and thus obviate the necessity of congregating in\r\\n\\t\\t\\t\\tthe mosque which the Prophet himself had built in the\r\\n\\t\\t\\t\\tsame village at the time of his arrival at Medina (see\r\\n\\t\\t\\t\\tnote [145] below). It is this \"rival\" mosque to which the\r\\n\\t\\t\\t\\tabove verse refers. It was demolished at the Prophet's\r\\n\\t\\t\\t\\torders immediately after his return from the Tabuk\r\\n\\t\\t\\t\\texpedition. Abu 'Amir himself died in Syria shortly\r\\n\\t\\t\\t\\tafterwards. (For all the relevant Traditions, see\r\\n\\t\\t\\t\\tTabari's and Ibn Kathir's commentaries on this verse.)"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "107",
    "NoteID": "143",
    "Body": "Although the whole of this verse relates primarily to the\\n\\t\\t\\t\\thistorical occasion explained in the preceding note, it\\n\\t\\t\\t\\thas a definite bearing on all attempts at creating\\n\\t\\t\\t\\tsectarian divisions among Muslims, and is thus a clear\\n\\t\\t\\t\\tamplification of an earlier injunction to this effect\\n\\t\\t\\t\\t(see  6:159  and the corresponding note [161])."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "108",
    "NoteID": "144",
    "Body": "Lit., \"in it\" - sc., \"to pray therein\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "108",
    "NoteID": "145",
    "Body": "Lit., \"Indeed, a house of worship founded...upon\\n\\t\\t\\t\\tGod-consciousness (taqwa) is most deserving...\", etc.\\n\\t\\t\\t\\tSome of the commentators believe that this is a reference\\n\\t\\t\\t\\tto the mosque founded by the Prophet at Quba', a village\\n\\t\\t\\t\\tclose to Medina, on his arrival there in the month of\\n\\t\\t\\t\\tRabi' al-Awwal in the year 1 H., since it was the first\\n\\t\\t\\t\\tmosque ever built by him or his followers. There are,\\n\\t\\t\\t\\thowever, authentic Traditions to the effect that the\\n\\t\\t\\t\\tProphet applied the designation of \"a house of worship\\n\\t\\t\\t\\tfounded on God-consciousness\" to his (later-built) mosque\\n\\t\\t\\t\\tat Medina as well (Muslim, Tirmidhi, Nasa'i, Ibn Hanbal).\\n\\t\\t\\t\\tIt is, therefore, reasonable to assume that it applies to\\n\\t\\t\\t\\tevery mosque sincerely dedicated by its founders to the\\n\\t\\t\\t\\tworship of God: a view which is supported by the next\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "110",
    "NoteID": "146",
    "Body": "Lit., \"unless their hearts are cut into many pieces\" -\\n\\t\\t\\t\\ti.e., until they die. In verses {109-110}, the reference\\n\\t\\t\\t\\tto \"the building which they have built\" is, obviously,\\n\\t\\t\\t\\twidened beyond the preceding allusion to houses of\\n\\t\\t\\t\\tworship, and allegorically circumscribes here all the\\n\\t\\t\\t\\t\"works\" and the behaviour of men."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "112",
    "NoteID": "147",
    "Body": "Most of the commentators attribute to the expression\\n\\t\\t\\t\\tas-sa'ihun (lit., \"those who wander\") the meaning of\\n\\t\\t\\t\\tas-sa'imun, i.e., \"those who fast\", since he who fasts\\n\\t\\t\\t\\tdeprives himself, temporarily, of worldly enjoyments\\n\\t\\t\\t\\tsimilar to one who wanders about the earth (Sufyan ibn\\n\\t\\t\\t\\t'Uyaynah, as quoted by Razi); and they justify this\\n\\t\\t\\t\\tmetaphorical equation of siyahah (\"wandering\") with siyam\\n\\t\\t\\t\\t(\"fasting\") by the fact that several Companions and some\\n\\t\\t\\t\\tof their successors have thus interpreted the term\\n\\t\\t\\t\\tas-sa'ihun in the above context (see Tabari). Other\\n\\t\\t\\t\\tauthorities, however, (e.g., Abu Muslim, as quoted by\\n\\t\\t\\t\\tRazi) prefer the original significance of this term and\\n\\t\\t\\t\\texplain it as more or less synonymous with al-muhajirun\\n\\t\\t\\t\\t(\"those who forsake the domain of evil\"). To my mind, the\\n\\t\\t\\t\\texpression as-sa'ihun is best rendered as \"those who go\\n\\t\\t\\t\\ton and on [seeking God's goodly acceptance]\", thus\\n\\t\\t\\t\\tcombining the literal and metonymical connotations of the\\n\\t\\t\\t\\tterm siyahah."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "113",
    "NoteID": "148",
    "Body": "As is obvious from the sequence, this prohibition relates\\n\\t\\t\\t\\tto the dead among such sinners - i.e., those who have\\n\\t\\t\\t\\tdied without repentance (Zamakhshari, Razi) - and not to\\n\\t\\t\\t\\tthose who are still living: for \"a prayer for forgiveness\\n\\t\\t\\t\\tin respect of a living [sinner]...amounts to asking God\\n\\t\\t\\t\\tthat He grace him with His guidance...and this is\\n\\t\\t\\t\\tpermissible\" (Manar XI, 60)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "114",
    "NoteID": "149",
    "Body": "Abraham's promise to his father is mentioned in\\n\\t\\t\\t\\t{19:47-48} and  60:4 ; for the actual prayer, see\\n\\t\\t\\t\\t{26:86-87}."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "115",
    "NoteID": "150",
    "Body": "Lit., \"it is not for God\" - i.e., it is not compatible\\n\\t\\t\\t\\twith God's omniscience and majesty -\"that He should cause\\n\\t\\t\\t\\tpeople to go astray after He has guided them\". My\\n\\t\\t\\t\\trendering of the phrase \"that He should cause people to\\n\\t\\t\\t\\tgo astray\" as \"condemn people for going astray\" is based\\n\\t\\t\\t\\ton the interpretation given to it by some of the greatest\\n\\t\\t\\t\\tclassical commentators (e.g., Tabari, Razi). As regards\\n\\t\\t\\t\\tthe phrase, \"after He has guided them\", Razi interprets\\n\\t\\t\\t\\tit as meaning \"after He has invited them to the way of\\n\\t\\t\\t\\trectitude (ar-rushd)\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "115",
    "NoteID": "151",
    "Body": "Most of the commentators assume that the people referred\\n\\t\\t\\t\\tto are the believers who, before the revelation of {verse\\n\\t\\t\\t\\t113}, used to pray to God that He grant His forgiveness\\n\\t\\t\\t\\tto their relatives and friends who had died in the state\\n\\t\\t\\t\\tof shirk (\"ascribing divinity to aught beside God\"): in\\n\\t\\t\\t\\tother words, the believers need not fear to be taken to\\n\\t\\t\\t\\ttask for something which they did before the prohibition\\n\\t\\t\\t\\tlaid down in verse {113} was revealed (i.e., \"ere He has\\n\\t\\t\\t\\tmade clear unto them of what they should beware\").\\n\\t\\t\\t\\tHowever, Razi advances also an alternative interpretation\\n\\t\\t\\t\\tof verse {115}, suggesting that it is meant to explain\\n\\t\\t\\t\\tthe severity with which the whole of this surah condemns\\n\\t\\t\\t\\tthe deniers of the truth and the hypocrites who are going\\n\\t\\t\\t\\tastray after God \"has made clear unto them of what they\\n\\t\\t\\t\\tshould beware\". (See in this connection {6:131-132} and\\n\\t\\t\\t\\tthe corresponding notes.) This interpretation is, to my\\n\\t\\t\\t\\tmind, the more plausible of the two, and particularly so\\n\\t\\t\\t\\tin view of the sequence (verse {116})."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "117",
    "NoteID": "152",
    "Body": "See note [132] above."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "117",
    "NoteID": "153",
    "Body": "Lit., \"after the hearts of a group of them had well-nigh\\n\\t\\t\\t\\tswerved [from faith]\": a reference to the believers who -\\n\\t\\t\\t\\twithout valid excuse - failed to respond to the Prophet's\\n\\t\\t\\t\\tcall when he was setting out on the expedition to Tabuk,\\n\\t\\t\\t\\tand who afterwards repented."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "117",
    "NoteID": "154",
    "Body": "See surah {6}, note [31]. According to Zamakhshari and\\n\\t\\t\\t\\tRazi, the particle thumma has here the meaning given in\\n\\t\\t\\t\\tmy rendering, and serves to emphasize the statement that\\n\\t\\t\\t\\t\"God has turned in His mercy unto the Prophet...and all\\n\\t\\t\\t\\tthose who followed him in the hour of distress\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "118",
    "NoteID": "155",
    "Body": "Or: \"had been left behind\", i.e., at the time of the\\n\\t\\t\\t\\texpedition to Tabuk. My rendering of alladhina khullifu\\n\\t\\t\\t\\tas \"those who had fallen prey to corruption\" is based on\\n\\t\\t\\t\\tthe tropical meaning of the verb khalufa or khullifa, \"he\\n\\t\\t\\t\\twas [or \"became\"] altered [for the worse]\", or \"he became\\n\\t\\t\\t\\tcorrupt\" in the moral sense (see Asas, Nihayah, Lisan\\n\\t\\t\\t\\tal-'Arab, Qamus, Taj al-'Arus). This interpretation of\\n\\t\\t\\t\\talladhina khullifu - applying, in the above context, to\\n\\t\\t\\t\\tthose who remained behind under false pretences - has the\\n\\t\\t\\t\\tsupport of some of the most outstanding Arab\\n\\t\\t\\t\\tphilologists, e.g., 'Abd al-Malik al-Asma'i (as quoted by\\n\\t\\t\\t\\tRazi, in his commentary on verse {83} of this surah). -\\n\\t\\t\\t\\tAs regards \"the three who had fallen prey to corruption\",\\n\\t\\t\\t\\tthe clasical commentators assume that it is a reference\\n\\t\\t\\t\\tto three persons - namely, Ka'b ibn Malik, Mararah ibn\\n\\t\\t\\t\\tar-Rabi' and Hilal ibn Umayyah (all of them from among\\n\\t\\t\\t\\tthe ansar) - who abstained from the campaign and were\\n\\t\\t\\t\\tthereafter ostracized by the Prophet and his Companions\\n\\t\\t\\t\\tuntil the revelation of the above verse. But while it is\\n\\t\\t\\t\\thistorically established that these three Companions were\\n\\t\\t\\t\\tindeed among the believers who thus failed in their duty\\n\\t\\t\\t\\t(the relevant Traditions will be found in extenso in\\n\\t\\t\\t\\tTabari's and Ibn Kathir's commentaries on this verse), it\\n\\t\\t\\t\\tseems to me that the context does not warrant such a\\n\\t\\t\\t\\trestriction of its meaning to three particular persons,\\n\\t\\t\\t\\tand that by \"the three\" are meant three groups of erring\\n\\t\\t\\t\\tbelievers: (1) those who had advanced equivocal excuses\\n\\t\\t\\t\\tand were thereupon permitted by the Prophet to remain at\\n\\t\\t\\t\\thome (as has been alluded to in verses {43-46} as well as\\n\\t\\t\\t\\tin the first sentence of verse {90}); (2) those who\\n\\t\\t\\t\\tabsented themselves without permission, but afterwards\\n\\t\\t\\t\\tspontaneously repented their sin (verses {102-105}); and\\n\\t\\t\\t\\t(3) those whose cases were at first \"deferred\" (verse\\n\\t\\t\\t\\t{106}), and who repented shortly after the Prophet's\\n\\t\\t\\t\\treturn from Tabuk (at which time verse {118} was\\n\\t\\t\\t\\trevealed)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "118",
    "NoteID": "156",
    "Body": "In its wider implication - as contrasted with a purely\\n\\t\\t\\t\\thistorical allusion - the above verse relates to all\\n\\t\\t\\t\\tbelievers who temporarily deviate from the right path and\\n\\t\\t\\t\\tthen, after having realized - either spontaneously or in\\n\\t\\t\\t\\tconsequence of outside reprobation - that they had\\n\\t\\t\\t\\t\"fallen prey to corruption\", sincerely repent their sin."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "120",
    "NoteID": "157",
    "Body": "Although this and the following verses relate, on the\\n\\t\\t\\t\\tface of it, to \"the people of the Prophet's City\" (see\\n\\t\\t\\t\\tnote [133] above) and to \"the bedouin who live around\\n\\t\\t\\t\\tthem\", their purport is obviously general, and applies to\\n\\t\\t\\t\\tall believers at all times. The specific reference to\\n\\t\\t\\t\\t\"the Prophet's City\" is due to the fact that it was the\\n\\t\\t\\t\\tplace where the revelation of the Qur'an was completed\\n\\t\\t\\t\\tand Islam came to its full fruition under the Prophet's\\n\\t\\t\\t\\tguidance."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "120",
    "NoteID": "158",
    "Body": "Lit., \"causes wrath to\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "120",
    "NoteID": "159",
    "Body": "Lit., \"[whenever] they get from the enemy whatever they\\n\\t\\t\\t\\tget\" - i.e., victory or death or injury."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "120",
    "NoteID": "160",
    "Body": "In its original construction, this sentence reads thus:\\n\\t\\t\\t\\t\"and neither thirst afflicts them..., nor do they take\\n\\t\\t\\t\\tany step..., nor do they get from the enemy..., without\\n\\t\\t\\t\\tthat a good deed is recorded in their behalf\". The same\\n\\t\\t\\t\\tconstruction is applied to the next verse."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "121",
    "NoteID": "161",
    "Body": "Lit., \"cross a valley\". As Zamakhshari rightly points out\\n\\t\\t\\t\\tin his commentary on this verse, the term wadi (\"valley\"\\n\\t\\t\\t\\tor \"river-bed\") is often used in classical Arabic to\\n\\t\\t\\t\\tdenote \"the earth\" - a usage which even in our days is\\n\\t\\t\\t\\tfamiliar to the bedouin of the Arabian Peninsula,\\n\\t\\t\\t\\tespecially when combined with the verb qata'a (lit., \"he\\n\\t\\t\\t\\tcut\") in its connotation of \"cutting across\" or\\n\\t\\t\\t\\t\"traversing [a distance]\" or \"advancing [on a journey]\".\\n\\t\\t\\t\\tThus, the above Qur'anic phrase may be suitably rendered\\n\\t\\t\\t\\tas \"whenever they move on earth\". (As regards the\\n\\t\\t\\t\\tconstruction of this sentence, see preceding note.)"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "122",
    "NoteID": "162",
    "Body": "Lit., \"admonish their people when they come back to them,\r\\n\\t\\t\\t\\tso that they might be on their guard\". Although the above\r\\n\\t\\t\\t\\tinjunction mentions specifically religious knowledge, it\r\\n\\t\\t\\t\\thas a positive bearing on every kind of knowledge - and\r\\n\\t\\t\\t\\tthis in view of the fact that the Qur'an does not draw\r\\n\\t\\t\\t\\tany dividing-line between the spiritual and the worldly\r\\n\\t\\t\\t\\tconcerns of life but, rather, regards them as different\r\\n\\t\\t\\t\\taspects of one and the same reality. In many of its\r\\n\\t\\t\\t\\tverses, the Qur'an calls upon the believer to observe all\r\\n\\t\\t\\t\\tnature and to discern God's creative activity in its\r\\n\\t\\t\\t\\tmanifold phenomena and \"laws\", as well as to meditate upon\r\\n\\t\\t\\t\\tthe lessons of history with a view to gaining a deeper\r\\n\\t\\t\\t\\tinsight into man's motivations and the innermost springs\r\\n\\t\\t\\t\\tof his behaviour; and, thus, the Qur'an itself is\r\\n\\t\\t\\t\\tcharacterized as addressed to \"those who think\". In\r\\n\\t\\t\\t\\tshort, intellectual activity as such is postulated as a\r\\n\\t\\t\\t\\tvalid way to a better understanding of God's will and -\r\\n\\t\\t\\t\\tif pursued with moral consciousness - as a valid method\r\\n\\t\\t\\t\\tof worshipping God. This Qur'anic principle has been\r\\n\\t\\t\\t\\temphasized in many well-authenticated sayings of the\r\\n\\t\\t\\t\\tProphet, for instance, \"Striving after knowledge is a\r\\n\\t\\t\\t\\tsacred duty (faridah) for every man and woman who has\r\\n\\t\\t\\t\\tsurrendered himself or herself to God (muslim\r\\n\\t\\t\\t\\twa-muslimah)\" (Ibn Majah); or, \"The superiority (fadl) of\r\\n\\t\\t\\t\\ta learned man over a [mere] worshipper [i.e., one who\r\\n\\t\\t\\t\\tmerely prays, fasts, etc.] is like the superiority of the\r\\n\\t\\t\\t\\tfull moon over all the stars\" (Tirmidhi, Abu Da'ud, Ibn\r\\n\\t\\t\\t\\tMajah, Ibn Hanbal, Darimi). Consequently, the obligation\r\\n\\t\\t\\t\\tof the believers to \"devote themselves to acquiring a\r\\n\\t\\t\\t\\tdeeper knowledge of the Faith\" (li-yatafaqqahu fi 'd-din)\r\\n\\t\\t\\t\\tand to impart its results to their fellow-believers\r\\n\\t\\t\\t\\trelates to every branch of knowledge as well as to its\r\\n\\t\\t\\t\\tpractical application."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "123",
    "NoteID": "163",
    "Body": "I.e., uncompromising with regard to ethical principles.\\n\\t\\t\\t\\tFor the general circumstances in which war is permitted,\\n\\t\\t\\t\\tsee {2:190-194},  22:39 , {60:8-9}, and the corresponding\\n\\t\\t\\t\\tnotes, as well as notes [7] and [9] on verse {5} of this\\n\\t\\t\\t\\tsurah. The reference to \"those deniers of the truth who\\n\\t\\t\\t\\tare near you\" may arise from the fact that only \"those\\n\\t\\t\\t\\twho are near\" can be dangerous in a physical sense or,\\n\\t\\t\\t\\talternatively, that - having come from afar - they have\\n\\t\\t\\t\\talready approached the Muslim country with an aggressive\\n\\t\\t\\t\\tintent."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "124",
    "NoteID": "164",
    "Body": "Lit., \"there are among them such as say\". The \"saying\"\\n\\t\\t\\t\\tthat follows is perhaps an oblique, sarcastic reference\\n\\t\\t\\t\\tto  8:2 , which speaks of the believers \"whose faith is\\n\\t\\t\\t\\tstrengthened whenever His messages are conveyed unto\\n\\t\\t\\t\\tthem\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "124",
    "NoteID": "165",
    "Body": "A reference to the promise of paradise expressed in verse\\n\\t\\t\\t\\t{111} above."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "125",
    "NoteID": "166",
    "Body": "Lit., \"it but adds [another] loathsome evil to their\\n\\t\\t\\t\\tloathsome evil\" - i.e., makes them more stubborn in their\\n\\t\\t\\t\\tdenying the truth of God's messages because they are a\\n\\t\\t\\t\\tpriori determined to deny everything that is incompatible\\n\\t\\t\\t\\twith their refusal to admit the existence of anything\\n\\t\\t\\t\\tthat is beyond the reach of human perception (al-ghayb -\\n\\t\\t\\t\\tsee surah {2}, note [3])."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "126",
    "NoteID": "167",
    "Body": "Lit., \"every year once or twice\" - a figure of speech\\n\\t\\t\\t\\tdenoting continuity (Manar XI, 83 f.). The \"test\"\\n\\t\\t\\t\\tconsists in the fact that man has been endowed with\\n\\t\\t\\t\\treason and, therefore, with the ability to choose between\\n\\t\\t\\t\\tright and wrong."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "127",
    "NoteID": "168",
    "Body": "Lit., \"who sees you\" - thus implying that God does not\\n\\t\\t\\t\\texist."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "127",
    "NoteID": "169",
    "Body": "Cf.  8:55 ."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "128",
    "NoteID": "170",
    "Body": "I.e., \"a human being like yourselves, not endowed with\\n\\t\\t\\t\\tany supernatural powers, but only chosen by God to convey\\n\\t\\t\\t\\tHis message to you\". (See note [2] on  50:2 .)"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "129",
    "NoteID": "171",
    "Body": "Lit., \"the Sustainer (rabb) of the awesome throne of\\n\\t\\t\\t\\talmightiness\". For my rendering of al-'arsh as \"the\\n\\t\\t\\t\\tthrone of almightiness\", see note [43] on  7:54 ."
  }
]
