[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/013001",
        "Body":  "Alif Lam Mim Ra. These are the Signs (or Verses) of the Book:\n\t\t\tthat which hath been revealed unto thee from thy Lord is the\n\t\t\tTruth; but most men believe not. \u003cspan class=\u0027fn\u0027\u003e1798\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1799\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/013010",
        "Body":  "It is the same (to Him) whether any of you conceal his speech or\n\t\t\tdeclare it openly; whether he lie hid by night or walk freely by\n\t\t\tday. \u003cspan class=\u0027fn\u0027\u003e1815\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/013011",
        "Body":  "For each (such person) there are (angels) in succession before\n\t\t\tand behind him: they guard him by command of Allah.  Verily never\n\t\t\twill Allah change the condition of a people until they change it\n\t\t\tthemselves (with their own souls). But when (once) Allah willeth\n\t\t\ta people\u0027s punishment there can be no turning it back nor will\n\t\t\tthey find besides Him any to protect. \u003cspan class=\u0027fn\u0027\u003e1816\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1817\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/013012",
        "Body":  "It is He Who doth show you the lightning by way both of fear and\n\t\t\tof hope: it is He Who doth raise up the clouds heavy with\n\t\t\t(fertilizing) rain! \u003cspan class=\u0027fn\u0027\u003e1818\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/013013",
        "Body":  "Nay thunder repeateth His praises and so do the angels with awe:\n\t\t\tHe flingeth the loud-voiced thunderbolts and therewith He\n\t\t\tstriketh whomsoever He will...\tYet these (are the men) who (dare\n\t\t\tto) dispute about Allah with the strength of His power (supreme)!\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1819\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1820\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1821\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/013014",
        "Body":  "For Him (alone) is prayer in Truth: any others that they call\n\t\t\tupon besides Him hear them no more than if they were to stretch\n\t\t\tforth their hands for water to reach their mouth but it reaches\n\t\t\tthem not: for the prayer of those without Faith is nothing but\n\t\t\t(futile) wandering (in the mind). \u003cspan class=\u0027fn\u0027\u003e1822\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1823\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/013015",
        "Body":  "Whatever beings there are in the heavens and the earth do\n\t\t\tprostrate themselves to Allah (acknowledging subjection) with\n\t\t\tgood will or in spite of themselves: so do their shadows in the\n\t\t\tmornings and evenings. \u003cspan class=\u0027fn\u0027\u003e1824\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1825\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1826\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1827\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/013016",
        "Body":  "Say: \"Who is the Lord and Sustainer of the heavens and the\n\t\t\tearth?\" Say: \"It is Allah.\" Say: \"Do ye then take (for worship)\n\t\t\tprotectors other than Him such as have no power either for good\n\t\t\tor for harm to themselves?\" Say: \"Are the blind equal with those\n\t\t\twho see? Or the depths of darkness equal with Light?\" Or do they\n\t\t\tassign to Allah partners who have created (anything) as He has\n\t\t\tcreated so that the creation seemed to them similar? Say: \"Allah\n\t\t\tis the Creator of all things: He is the One the Supreme and\n\t\t\tIrresistible.\" \u003cspan class=\u0027fn\u0027\u003e1828\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1829\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1830\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/013017",
        "Body":  "He sends down water from the skies and the channels flow each\n\t\t\taccording to its measure: but the torrent bears away the foam\n\t\t\tthat mounts up to the surface.\tEven so from that (ore) which\n\t\t\tthey heat in the fire to make ornaments or utensils therewith\n\t\t\tthere is a scum likewise.  Thus doth Allah (by parables) show\n\t\t\tforth Truth and Vanity: for the scum disappears like froth cast\n\t\t\tout; while that which is for the good of mankind remains on the\n\t\t\tearth.\tThus doth Allah set forth parables. \u003cspan class=\u0027fn\u0027\u003e1831\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1832\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/013018",
        "Body":  "For those who respond to their Lord are (all) good things.  But\n\t\t\tthose who respond not to Him even if they had all that is in the\n\t\t\theavens and on earth and as much more (in vain) would they offer\n\t\t\tit for ransom.\tFor them will the reckoning be terrible: their\n\t\t\tabode will be Hell what a bed of misery! \u003cspan class=\u0027fn\u0027\u003e1833\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/013019",
        "Body":  "Is then one who doth know that that which hath been revealed unto\n\t\t\tthese from thy Lord is the Truth like one who is blind? It is\n\t\t\tthose who are endued with understanding that receive admonition\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1834\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/013002",
        "Body":  "Allah is He Who raised the heavens without any pillars that ye\n\t\t\tcan see; is firmly established on the throne (of authority); He\n\t\t\thas subjected the sun and the moon (to His law)! each one runs\n\t\t\t(its course) for a term appointed.  He doth regulate affairs\n\t\t\texplaining the Signs in detail that ye may believe with certainty\n\t\t\tin the meeting with your Lord. \u003cspan class=\u0027fn\u0027\u003e1800\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1801\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1802\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1803\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/013020",
        "Body":  "Those who fulfil the Covenant of Allah and fail not in their\n\t\t\tplighted word;"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/013021",
        "Body":  "Those who join together those things which Allah hath commanded\n\t\t\tto be joined hold their Lord in awe and fear the terrible\n\t\t\treckoning; \u003cspan class=\u0027fn\u0027\u003e1835\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/013022",
        "Body":  "Those who patiently persevere seeking the countenance their Lord;\n\t\t\testablish regular prayers; spend out of (the gifts) We have\n\t\t\tbestowed for their sustenance secretly and openly; and turn off\n\t\t\tEvil with good: for such there is the final attainment of the\n\t\t\t(Eternal) Home \u003cspan class=\u0027fn\u0027\u003e1836\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/013023",
        "Body":  "Gardens of perpetual bliss: they shall enter there as well as the\n\t\t\trighteous among their fathers their spouses and their offspring:\n\t\t\tand angels shall enter unto them from every gate (with the\n\t\t\tsalutation): \u003cspan class=\u0027fn\u0027\u003e1837\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/013024",
        "Body":  "\"Peace unto you for that ye persevered in patience! Now how\n\t\t\texcellent is the final Home!\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/013025",
        "Body":  "But those who break the Covenant of Allah after having plighted\n\t\t\ttheir word thereto and cut asunder those things which Allah has\n\t\t\tcommanded to be joined and work mischief in the land on them is\n\t\t\tthe Curse; for them is the terrible Home! \u003cspan class=\u0027fn\u0027\u003e1838\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1839\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/013026",
        "Body":  "Allah doth enlarge or grant by (strict) measure the Sustenance\n\t\t\t(which He giveth) to whom so He pleaseth.  (The worldly) rejoice\n\t\t\tin the life of this world: but the life of this world is but\n\t\t\tlittle comfort in the Hereafter. \u003cspan class=\u0027fn\u0027\u003e1840\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1841\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/013027",
        "Body":  "The Unbelievers say: \"Why is not a Sign sent down to him from his\n\t\t\tLord?\" Say: \"Truly Allah leaveth to stray whom He will; but He\n\t\t\tguideth to Himself those who turn to Him in penitence\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1842\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/013028",
        "Body":  "\"Those who believe and whose hearts find satisfaction in the\n\t\t\tremembrance of Allah: for without doubt in the remembrance of\n\t\t\tAllah do hearts find satisfaction. \u003cspan class=\u0027fn\u0027\u003e1843\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/013029",
        "Body":  "\"For those who believe and work righteousness is (every)\n\t\t\tblessedness and a beautiful place of (final) return.\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1844\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/013003",
        "Body":  "And it is He Who spread out the earth and set thereon mountains\n\t\t\tstanding firm and (flowing) rivers: and fruit of every kind He\n\t\t\tmade in pairs two and two: He draweth the Night as a veil o\u0027er\n\t\t\tthe Day. Behold verily in these things there are Signs for those\n\t\t\twho consider! \u003cspan class=\u0027fn\u0027\u003e1804\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1805\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/013030",
        "Body":  "Thus have We sent thee amongst a People before whom (long since)\n\t\t\thave (other) Peoples (gone and) passed away; in order that thou\n\t\t\tmightest rehearse unto them what We send down unto thee by\n\t\t\tinspiration; yet do they reject (Him) the Most Gracious! Say: \"He\n\t\t\tis my Lord! There is no god but He! On Him is my trust and to Him\n\t\t\tdo I turn!\" \u003cspan class=\u0027fn\u0027\u003e1845\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1846\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/013031",
        "Body":  "If there were a Qur\u0027an with which mountains were moved or the\n\t\t\tearth were cloven asunder or the dead were made to speak (this\n\t\t\twould be the one!)  But truly the Command is with Allah in\n\t\t\tthings! Do not the Believers know that had Allah (so) willed He\n\t\t\tcould have guided all mankind (to the Right)? But the Unbelievers\n\t\t\tnever will disaster cease to seize them for their (ill) deeds or\n\t\t\tto settle close to their homes until the Promise of Allah come to\n\t\t\tpass for verily Allah will not fail in His promise. \u003cspan class=\u0027fn\u0027\u003e1847\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1848\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/013032",
        "Body":  "Mocked were (many) Apostles before thee: but I granted respite to\n\t\t\tthe Unbelievers and finally I punished them; then how (terrible)\n\t\t\twas My requital! \u003cspan class=\u0027fn\u0027\u003e1849\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1850\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/013033",
        "Body":  "Is then He Who standeth over every soul (and knoweth) all that it\n\t\t\tdoth (like any others)? And yet they ascribe partners to Allah. \n\t\t\tSay: \"But name them! Is it that ye will inform Him of something\n\t\t\tHe knoweth not on earth or is it (just) a show of words?\" Nay! to\n\t\t\tthose who believe not their pretence seems pleasing but they are\n\t\t\tkept back (thereby) from the Path: and those whom Allah leaves to\n\t\t\tstray no one can guide. \u003cspan class=\u0027fn\u0027\u003e1851\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1852\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/013034",
        "Body":  "For them is a Penalty in the life of this world but harder truly\n\t\t\tis the Penalty of the Hereafter; and defender have they none\n\t\t\tagainst Allah. \u003cspan class=\u0027fn\u0027\u003e1853\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/013035",
        "Body":  "The parable of the Garden which the righteous are promised!\n\t\t\tbeneath it flow rivers: perpetual is the enjoyment thereof and\n\t\t\tthe shade therein: such is the End of the Righteous; and the End\n\t\t\tof Unbelievers is the Fire. \u003cspan class=\u0027fn\u0027\u003e1854\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1855\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1856\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/013036",
        "Body":  "Those to whom We have given the Book rejoice at what hath been\n\t\t\trevealed unto thee: but there are among the clans those who\n\t\t\treject a part thereof.\tSay: \"I am commanded to worship Allah and\n\t\t\tnot to join partners with Him.\tUnto Him do I call and unto Him\n\t\t\tis my return.\" \u003cspan class=\u0027fn\u0027\u003e1857\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1858\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/013037",
        "Body":  "Thus have We revealed it to be a judgment of authority in Arabic.\n\t\t\tWert thou to follow their (vain) desires after the knowledge\n\t\t\twhich hath reached thee then wouldst thou find neither protector\n\t\t\tnor defender against Allah. \u003cspan class=\u0027fn\u0027\u003e1859\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1860\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/013038",
        "Body":  "We did send apostles before thee and appointed for them wives and\n\t\t\tchildren: and it was never the part of an apostle to bring a Sign\n\t\t\texcept as Allah permitted (or commanded).  For each period is a\n\t\t\tBook (revealed). \u003cspan class=\u0027fn\u0027\u003e1861\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1862\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1863\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/013039",
        "Body":  "Allah doth blot out or confirm what He pleaseth: with Him is the\n\t\t\tMother of the Book. \u003cspan class=\u0027fn\u0027\u003e1864\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/013004",
        "Body":  "And in the earth are tracts (diverse though) neighboring and\n\t\t\tgardens of vines and fields sown with corn and palm trees growing\n\t\t\tout of single roots or otherwise: watered with the same water yet\n\t\t\tsome of them We make more excellent than others to eat.  Behold\n\t\t\tverily in these things there are Signs for those who understand!\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1806\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1807\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/013040",
        "Body":  "Whether We shall show thee (within thy lifetime) part of what We\n\t\t\tpromised them or take to Ourselves thy soul (before it is all\n\t\t\taccomplished) thy duty is to (make the Message) reach them: it is\n\t\t\tOur part to call them to account."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/013041",
        "Body":  "See they not that We gradually reduce the land (in their control)\n\t\t\tfrom its outlying borders? (Where) Allah commands there is none\n\t\t\tto put back His command: and He is swift in calling to account.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1865\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/013042",
        "Body":  "Those before them did (also) devise plots; but in all things the\n\t\t\tmaster planning is Allah\u0027s.  He knoweth the doings of every soul:\n\t\t\tand soon will the Unbelievers know who gets home in the End.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1866\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/013043",
        "Body":  "The Unbelievers say: \"No apostle art thou.\" Say: \"Enough for a\n\t\t\twitness between me and you is Allah and such as have knowledge of\n\t\t\tthe Book.\" \u003cspan class=\u0027fn\u0027\u003e1867\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1868\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/013005",
        "Body":  "If thou dost marvel (at their want of faith) strange is their\n\t\t\tsaying: \"When we are (actually) dust shall we indeed then be in a\n\t\t\tcreation renewed?\" They are those who deny their Lord! They are\n\t\t\tthose round whose necks will be yokes (of servitude): they will\n\t\t\tbe Companions of the Fire who dwell therein (for aye)!\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1808\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1809\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/013006",
        "Body":  "They ask thee to hasten on the evil in preference to the good:\n\t\t\tyet have come to pass before them (many) exemplary punishments!\n\t\t\tBut verily thy Lord is full of forgiveness for mankind for their\n\t\t\twrongdoing: and verily thy Lord is (also) strict in punishment.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1810\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/013007",
        "Body":  "And the Unbelievers say! \"Why is not a Sign sent down to him from\n\t\t\this Lord?\" But thou art truly a warner and to every people a\n\t\t\tguide. \u003cspan class=\u0027fn\u0027\u003e1811\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e1812\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/013008",
        "Body":  "Allah doth know what every female (womb) doth bear by how much\n\t\t\tthe wombs fall short (of their time or number) or do exceed. \n\t\t\tEvery single thing is before His sight in (due) proportion.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e1813\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "13",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/013009",
        "Body":  "He knoweth the Unseen and that which is open: He is the Great the\n\t\t\tMost High. \u003cspan class=\u0027fn\u0027\u003e1814\u003c/span\u003e"
    }
]
