[
  {
    "SurahNumber": "95",
    "AyahNumber": "3",
    "NoteID": "1",
    "Body": "The \"fig\" and the \"olive\" symbolise, in this context, the\\n\\t\\t\\t\\tlands in which these trees predominate: i.e., the\\n\\t\\t\\t\\tcountries bordering on the eastern part of the\\n\\t\\t\\t\\tMediterranean, especially Palestine and Syria. As it was\\n\\t\\t\\t\\tin these lands that most of the Abrahamic prophets\\n\\t\\t\\t\\tmentioned in the Qur'an lived and preached, these two\\n\\t\\t\\t\\tspecies of tree may be taken as metonyms for the\\n\\t\\t\\t\\treligious teachings voiced by the long line of those\\n\\t\\t\\t\\tGod-inspired men, culminating in the person of the last\\n\\t\\t\\t\\tJudaic prophet, Jesus. \"Mount Sinai\", on the other hand,\\n\\t\\t\\t\\tstresses specifically the apostleship of Moses, inasmuch\\n\\t\\t\\t\\tas the religious law valid before, and up to, the advent\\n\\t\\t\\t\\tof Muhammad - and in its essentials binding on Jesus as\\n\\t\\t\\t\\twell - was revealed to Moses on a mountain of the Sinai\\n\\t\\t\\t\\tDesert. Finally, \"this land secure\" signifies undoubtedly\\n\\t\\t\\t\\t(as is evident from  2:126 ) Mecca, where Muhammad, the\\n\\t\\t\\t\\tLast Prophet, was born and received his divine call.\\n\\t\\t\\t\\tThus, verses {1-3} draw our attention to the fundamental\\n\\t\\t\\t\\tethical unity underlying the teachings - the genuine\\n\\t\\t\\t\\tteachings - of all the three historic phases of\\n\\t\\t\\t\\tmonotheistic religion, metonymically personified by\\n\\t\\t\\t\\tMoses, Jesus and Muhammad. The specific truth to be\\n\\t\\t\\t\\tconsidered here is referred to in the next three verses."
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "4",
    "NoteID": "2",
    "Body": "I.e., endowed with all the positive qualities, physical\\n\\t\\t\\t\\tas well as mental, corresponding to the functions which\\n\\t\\t\\t\\tthis particular creature is meant to perform. The concept\\n\\t\\t\\t\\tof \"the best conformation\" is related to the Qur'anic\\n\\t\\t\\t\\tstatement that everything which God creates, including\\n\\t\\t\\t\\tthe human being or self (nafs), is \"formed in accordance\\n\\t\\t\\t\\twith what it is meant to be\" (see  91:7  and the\\n\\t\\t\\t\\tcorresponding note [5], as well as - in a more general\\n\\t\\t\\t\\tsense -  87:2  and note [1]. This statement does not in\\n\\t\\t\\t\\tany way imply that all human beings have the same \"best\\n\\t\\t\\t\\tconformation\" in respect of their bodily or mental\\n\\t\\t\\t\\tendowments: it implies simply that irrespective of his\\n\\t\\t\\t\\tnatural advantages or disadvantages, each human being is\\n\\t\\t\\t\\tendowed with the ability to make the, for him, best\\n\\t\\t\\t\\tpossible use of his inborn qualities and of the\\n\\t\\t\\t\\tenvironment to which he is exposed. (See in this\\n\\t\\t\\t\\tconnection  30:30  and the corresponding notes,\\n\\t\\t\\t\\tespecially [27] and [28]."
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "This \"reduction to the lowest of low\" is a consequence of\\n\\t\\t\\t\\tman's betrayal - in another word, corruption - of his\\n\\t\\t\\t\\toriginal, positive disposition: that is to say, a\\n\\t\\t\\t\\tconsequence of man's own doings and omissions. Regarding\\n\\t\\t\\t\\tthe attribution, by God, of this \"reduction\" to His Own\\n\\t\\t\\t\\tdoing, see note [7] on  2:7 ."
  },
  {
    "SurahNumber": "95",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "I.e., to the validity of the moral law - which, to my\\n\\t\\t\\t\\tmind, is the meaning of the term din in this context -\\n\\t\\t\\t\\toutlined in the preceding three verses. (For this\\n\\t\\t\\t\\tspecific significance of the concept of din, see note [3]\\n\\t\\t\\t\\ton  109:6 .) The above rhetorical question has this\\n\\t\\t\\t\\timplication: Since the moral law referred to here has\\n\\t\\t\\t\\tbeen stressed in the teachings of all monotheistic\\n\\t\\t\\t\\treligions (cf. verses {1-3} and note [1] above), its\\n\\t\\t\\t\\ttruth ought to be self-evident to any unprejudiced\\n\\t\\t\\t\\tperson; its negation, moreover, amounts to a negation of\\n\\t\\t\\t\\tall freedom of moral choice on man's part and, hence, of\\n\\t\\t\\t\\tjustice on the part of God, who, as the next verse points\\n\\t\\t\\t\\tout, is - by definition - \"the most just of judges\"."
  }
]
