[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "30",
        "bookName": "Book of Judicial Decisions",
        "bookNameArabic": "كتاب الأقضية",
        "hadiths": [
            {
                "hadithNo": "4470",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Prophet (s.a.w) said: \"If people were given on the basis of their claims, people would claim the lives and property of men. Rather the oath should be sworn by the defendant.\"",
                "hadithArabic": "حَدَّثَنِى أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ عَنِ ابْنِ جُرَيْجٍ عَنِ ابْنِ أَبِى مُلَيْكَةَ عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- قَالَ « لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لاَدَّعَى نَاسٌ دِمَاءَ رِجَالٍ وَأَمْوَالَهُمْ وَلَكِنَّ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ »."
            },
            {
                "hadithNo": "4471",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Messenger of Allah (s.a.w) ruled that the oath should be sworn by the defendant.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ نَافِعِ بْنِ عُمَرَ عَنِ ابْنِ أَبِى مُلَيْكَةَ عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَضَى بِالْيَمِينِ عَلَى الْمُدَّعَى عَلَيْهِ."
            },
            {
                "hadithNo": "4472",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Messenger of Allah (s.a.w) judged on the basis of a witness and an oath.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ نَافِعِ بْنِ عُمَرَ عَنِ ابْنِ أَبِى مُلَيْكَةَ عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَضَى بِالْيَمِينِ عَلَى الْمُدَّعَى عَلَيْهِ."
            },
            {
                "hadithNo": "4473",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Umm Salamah said: The Messenger of Allah (s.a.w) said: \"You refer your disputes to me, but one of you may be more eloquent in arguing than the other, and I judge in his favor because of what I hear from him. If I allocate to a person something that is his brother's right, let him not take it, for I have allocated him a piece of Fire.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ زَيْنَبَ بِنْتِ أَبِى سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّكُمْ تَخْتَصِمُونَ إِلَىَّ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ فَأَقْضِى لَهُ عَلَى نَحْوٍ مِمَّا أَسْمَعُ مِنْهُ فَمَنْ قَطَعْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا فَلاَ يَأْخُذْهُ فَإِنَّمَا أَقْطَعُ لَهُ بِهِ قِطْعَةً مِنَ النَّارِ »."
            },
            {
                "hadithNo": "4474",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as no. 4473) was narrated from Hisham with this chain.",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ نُمَيْرٍ كِلاَهُمَا عَنْ هِشَامٍ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "4475",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Umm Salamah, the wife of the Messenger of Allah (s.a.w), that the Messenger of Allah (s.a.w) heard noise of a dispute by the door of his apartment. He went out to them and said: \"I am only human. Disputants come to me and one of them may be more eloquent than the other, so I think that he is telling the truth and I rule in his favor. If I rule in a person's favor concerning the rights of another Muslim, it is no more than a piece of Fire, so let him burden himself with it or forsake it.\"",
                "hadithArabic": "وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ أَخْبَرَنِى عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ زَيْنَبَ بِنْتِ أَبِى سَلَمَةَ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- سَمِعَ جَلَبَةَ خَصْمٍ بِبَابِ حُجْرَتِهِ فَخَرَجَ إِلَيْهِمْ فَقَالَ « إِنَّمَا أَنَا بَشَرٌ وَإِنَّهُ يَأْتِينِى الْخَصْمُ فَلَعَلَّ بَعْضَهُمْ أَنْ يَكُونَ أَبْلَغَ مِنْ بَعْضٍ فَأَحْسِبُ أَنَّهُ صَادِقٌ فَأَقْضِى لَهُ فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ فَإِنَّمَا هِىَ قِطْعَةٌ مِنَ النَّارِ فَلْيَحْمِلْهَا أَوْ يَذَرْهَا »."
            },
            {
                "hadithNo": "4476",
                "chapterNo": "3",
                "hadithEnglish": "A Hadith like that of Yunus (no. 4475) was narrated from Az-Zuhri with this chain. According to the Hadith of Ma'mar: She (i.e., Umm Salamah) said: The Messenger of Allah (s.a.w) heard the sound of a dispute by her door.",
                "hadithArabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِى عَنْ صَالِحٍ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كِلاَهُمَا عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ نَحْوَ حَدِيثِ يُونُسَ. وَفِى حَدِيثِ مَعْمَرٍ قَالَتْ سَمِعَ النَّبِىُّ -صلى الله عليه وسلم- لَجَبَةَ خَصْمٍ بِبَابِ أُمِّ سَلَمَةَ."
            },
            {
                "hadithNo": "4477",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Aishah said: Hind bint 'Utbah, the wife of Abu Sufyan, entered upon the Messenger of Allah (s.a.w) and said: O Messenger of Allah, Abu Sufyan is a stingy man and he does not give me enough maintenance for myself and my children, unless I take from his wealth without his knowledge. Is there any sin on me for that? The Messenger of Allah (s.a.w) said: \"Take from his wealth on a reasonable basis, whatever is sufficient for yourself and your children.\"",
                "hadithArabic": "حَدَّثَنِى عَلِىُّ بْنُ حُجْرٍ السَّعْدِىُّ حَدَّثَنَا عَلِىُّ بْنُ مُسْهِرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ دَخَلَتْ هِنْدٌ بِنْتُ عُتْبَةَ امْرَأَةُ أَبِى سُفْيَانَ عَلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ لاَ يُعْطِينِى مِنَ النَّفَقَةِ مَا يَكْفِينِى وَيَكْفِى بَنِىَّ إِلاَّ مَا أَخَذْتُ مِنْ مَالِهِ بِغَيْرِ عِلْمِهِ. فَهَلْ عَلَىَّ فِى ذَلِكَ مِنْ جُنَاحٍ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « خُذِى مِنْ مَالِهِ بِالْمَعْرُوفِ مَا يَكْفِيكِ وَيَكْفِى بَنِيكِ »."
            },
            {
                "hadithNo": "4478",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Hisham with this chain (a similar Hadith as no. 4477).",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو كُرَيْبٍ كِلاَهُمَا عَنْ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَوَكِيعٍ ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِى فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ - يَعْنِى ابْنَ عُثْمَانَ - كُلُّهُمْ عَنْ هِشَامٍ بِهَذَا الإِسْنَادِ."
            },
            {
                "hadithNo": "4479",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Aishah said: Hind came to the Prophet (s.a.w) and said: O Messenger of Allah, by Allah, there was no household on earth upon whom I would have loved to see Allah bring disgrace more than your household, but now there is no household on earth upon whom I would love to see Allah bring honor more than your household. The Prophet (s.a.w) said: \"And that (love) will increase, by the One in Whose Hand is my soul.\" Then she said: O Messenger of Allah, Abu Sufyan is a niggardly man. Is there any sin on me if I spend on his children from his wealth without his knowledge? The Prophet (s.a.w) said: \"There is no sin on you if you spend on them on a reasonable basis.\"",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ جَاءَتْ هِنْدٌ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا كَانَ عَلَى ظَهْرِ الأَرْضِ أَهْلُ خِبَاءٍ أَحَبَّ إِلَىَّ مِنْ أَنْ يُذِلَّهُمُ اللَّهُ مِنْ أَهْلِ خِبَائِكَ وَمَا عَلَى ظَهْرِ الأَرْضِ أَهْلُ خِبَاءٍ أَحَبَّ إِلَىَّ مِنْ أَنْ يُعِزَّهُمُ اللَّهُ مِنْ أَهْلِ خِبَائِكَ. فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- « وَأَيْضًا وَالَّذِى نَفْسِى بِيَدِهِ ». ثُمَّ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مُمْسِكٌ فَهَلْ عَلَىَّ حَرَجٌ أَنْ أُنْفِقَ عَلَى عِيَالِهِ مِنْ مَالِهِ بِغَيْرِ إِذْنِهِ فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- « لاَ حَرَجَ عَلَيْكِ أَنْ تُنْفِقِى عَلَيْهِمْ بِالْمَعْرُوفِ »."
            },
            {
                "hadithNo": "4480",
                "chapterNo": "4",
                "hadithEnglish": "'Urwah bin Az-Zubair narrated that 'Aishah said: Hind bint 'Utbah bin Rabi'ah came and said: O Messenger of Allah, by Allah there was no household on earth whom I would love to see humiliated more than your household, but now there is no household on earth whom I would love to see honored more than your household. The Messenger of Allah (s.a.w) said: \"And that (love) will increase, by the One in Whose Hand is my soul.\" Then she said: O Messenger of Allah, Abu Sufyan is a niggardly man. Is there any sin on me if I feed our children from what he has? He said: \"No, but do that on a reasonable basis.\"",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ أَخِى الزُّهْرِىِّ عَنْ عَمِّهِ أَخْبَرَنِى عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ قَالَتْ جَاءَتْ هِنْدٌ بِنْتُ عُتْبَةَ بْنِ رَبِيعَةَ فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا كَانَ عَلَى ظَهْرِ الأَرْضِ خِبَاءٌ أَحَبَّ إِلَىَّ مِنْ أَنْ يَذِلُّوا مِنْ أَهْلِ خِبَائِكَ وَمَا أَصْبَحَ الْيَوْمَ عَلَى ظَهْرِ الأَرْضِ خِبَاءٌ أَحَبَّ إِلَىَّ مِنْ أَنْ يَعِزُّوا مِنْ أَهْلِ خِبَائِكَ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « وَأَيْضًا وَالَّذِى نَفْسِى بِيَدِهِ ».\r\nثُمَّ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ مِسِّيكٌ فَهَلْ عَلَىَّ حَرَجٌ مِنْ أَنْ أُطْعِمَ مِنَ الَّذِى لَهُ عِيَالَنَا فَقَالَ لَهَا « لاَ إِلاَّ بِالْمَعْرُوفِ »."
            },
            {
                "hadithNo": "4481",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Hurairah said: The Messenger of Allah (s.a.w) said: \"Allah likes three things for you and dislikes three things for you. He likes for you to worship Him and not associate anything with Him, and to hold fast to the rope of Allah altogether and not be divided; and He dislikes for you to gossip, to ask too much and to waste money.\"",
                "hadithArabic": "حَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّ اللَّهَ يَرْضَى لَكُمْ ثَلاَثًا وَيَكْرَهُ لَكُمْ ثَلاَثًا فَيَرْضَى لَكُمْ أَنْ تَعْبُدُوهُ وَلاَ تُشْرِكُوا بِهِ شَيْئًا وَأَنْ تَعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلاَ تَفَرَّقُوا وَيَكْرَهُ لَكُمْ قِيلَ وَقَالَ وَكَثْرَةَ السُّؤَالِ وَإِضَاعَةَ الْمَالِ »."
            },
            {
                "hadithNo": "4482",
                "chapterNo": "5",
                "hadithEnglish": "A similar report (as no. 4483) was narrated from Suhail with this chain, except that he said: (The Prophet (s.a.w.) said:) He does not like three things for you. And he did not mention: and do not be divided.",
                "hadithArabic": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ سُهَيْلٍ بِهَذَا الإِسْنَادِ. مِثْلَهُ غَيْرَ أَنَّهُ قَالَ وَيَسْخَطُ لَكُمْ ثَلاَثًا. وَلَمْ يَذْكُرْ وَلاَ تَفَرَّقُوا."
            },
            {
                "hadithNo": "4483",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Al-Mughirah bin Shu'bah that the Messenger of Allah (s.a.w) said: \"Allah has forbidden to you disobedience to mothers, burying daughters alive, and withholding the rights of others and asking of them. And He dislikes three things for you: gossip, asking too much and wasting money.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِىُّ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنِ الشَّعْبِىِّ عَنْ وَرَّادٍ مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ « إِنَّ اللَّهَ عَزَّ وَجَلَّ حَرَّمَ عَلَيْكُمْ عُقُوقَ الأُمَّهَاتِ وَوَأْدَ الْبَنَاتِ وَمَنْعًا وَهَاتِ وَكَرِهَ لَكُمْ ثَلاَثًا قِيلَ وَقَالَ وَكَثْرَةَ السُّؤَالِ وَإِضَاعَةَ الْمَالِ »."
            },
            {
                "hadithNo": "4484",
                "chapterNo": "5",
                "hadithEnglish": "A similar report (as no. 4483) was narrated from Mansur with this chain, except that he said: the Messenger of Allah (s.a.w) forbade to you, and he did not say: Allah forbade to you.",
                "hadithArabic": "وَحَدَّثَنِى الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ مَنْصُورٍ بِهَذَا الإِسْنَادِ. مِثْلَهُ. غَيْرَ أَنَّهُ قَالَ وَحَرَّمَ عَلَيْكُمْ رَسُولُ اللَّهِ -صلى الله عليه وسلم-. وَلَمْ يَقُلْ إِنَّ اللَّهَ حَرَّمَ عَلَيْكُمْ."
            },
            {
                "hadithNo": "4485",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Ash-Sha'bi: The scribe of Al-Mughirah bin Shu'bah told me: Mushahwiyah wrote to Al-Mughirah (saying): Write for me something that you heard from the Messenger of Allah (s.a.w). He wrote to him: I heard the Messenger of Allah (s.a.w) say: \"Allah dislikes three things for you: gossip, wasting money and asking too much.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ عَنْ خَالِدٍ الْحَذَّاءِ حَدَّثَنِى ابْنُ أَشْوَعَ عَنِ الشَّعْبِىِّ حَدَّثَنِى كَاتِبُ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ اكْتُبْ إِلَىَّ بِشَىْءٍ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم-. فَكَتَبَ إِلَيْهِ أَنِّى سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « إِنَّ اللَّهَ كَرِهَ لَكُمْ ثَلاَثًا قِيلَ وَقَالَ وَإِضَاعَةَ الْمَالِ وَكَثْرَةَ السُّؤَالِ »."
            },
            {
                "hadithNo": "4486",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Warrad said: Al-Mughirah wrote to Mushahwiyah: I heard the Messenger of Allah (s.a.w) say: \"Allah has forbidden three things and disallowed three things. He has forbidden disobedience to parents, burying daughters alive and withholding the rights of others and asking of them; and He has disallowed three things: gossip, asking too much and wasting money.\"",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِىُّ عَنْ مُحَمَّدِ بْنِ سُوقَةَ أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ الثَّقَفِىُّ عَنْ وَرَّادٍ قَالَ كَتَبَ الْمُغِيرَةُ إِلَى مُعَاوِيَةَ سَلاَمٌ عَلَيْكَ أَمَّا بَعْدُ فَإِنِّى سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « إِنَّ اللَّهَ حَرَّمَ ثَلاَثًا وَنَهَى عَنْ ثَلاَثٍ حَرَّمَ عُقُوقَ الْوَالِدِ وَوَأْدَ الْبَنَاتِ وَلاَ وَهَاتِ.\r\nوَنَهَى عَنْ ثَلاَثٍ قِيلٍ وَقَالٍ وَكَثْرَةِ السُّؤَالِ وَإِضَاعَةِ الْمَالِ »."
            },
            {
                "hadithNo": "4487",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from 'Amr bin Al-'As that he heard the Messenger of Allah (s.a.w) say: \"If a judge passes a judgment, having striven to reach a decision, and he gets it right, he will have two rewards. If he passes a judgment, having striven to reach a decision, and he gets it wrong, he will have one reward.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ أَبِى قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ ثُمَّ أَصَابَ فَلَهُ أَجْرَانِ. وَإِذَا حَكَمَ فَاجْتَهَدَ ثُمَّ أَخْطَأَ فَلَهُ أَجْرٌ »."
            },
            {
                "hadithNo": "4488",
                "chapterNo": "6",
                "hadithEnglish": "A similar report (as no. 4487) was narrated from 'Abdul-'Aziz bin Muhammad, and at the end of the Hadith he added: Yazid said: I narrated this Hadith to Abu Bakr bin Muhammad bin 'Amr bin Hazm, and he said: This is what Abu Salamah narrated to me from Abu Hurairah.",
                "hadithArabic": "وَحَدَّثَنِى إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ أَبِى عُمَرَ كِلاَهُمَا عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ بِهَذَا الإِسْنَادِ مِثْلَهُ وَزَادَ فِى عَقِبِ الْحَدِيثِ قَالَ يَزِيدُ فَحَدَّثْتُ هَذَا الْحَدِيثَ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ فَقَالَ هَكَذَا حَدَّثَنِى أَبُو سَلَمَةَ عَنْ أَبِى هُرَيْرَةَ."
            },
            {
                "hadithNo": "4489",
                "chapterNo": "6",
                "hadithEnglish": "Yazid bin 'Abdullah bin Usamah bin Al-Had Al-Laithi narrated a Hadith like that of 'Abdul-'Aziz bin Muhammad (no. 4488), with both chains.",
                "hadithArabic": "وَحَدَّثَنِى عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِىُّ أَخْبَرَنَا مَرْوَانُ - يَعْنِى ابْنَ مُحَمَّدٍ الدِّمَشْقِىَّ - حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ حَدَّثَنِى يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ اللَّيْثِىُّ بِهَذَا الْحَدِيثِ مِثْلَ رِوَايَةِ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ بِالإِسْنَادَيْنِ جَمِيعًا."
            },
            {
                "hadithNo": "4490",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that 'Abdur-Rahman bin Abi Bakrah said: My father wrote - and I wrote it down for him - to 'Ubaidullah bin Abi Bakrah, who was the Qazi of Sijistan, (telling him): Do not pass judgment between two people when you are angry, for I heard the Messenger of Allah (s.a.w) say: \"No one should pass judgment between two people when he is angry.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِى بَكْرَةَ. قَالَ كَتَبَ أَبِى - وَكَتَبْتُ لَهُ - إِلَى عُبَيْدِ اللَّهِ بْنِ أَبِى بَكْرَةَ وَهُوَ قَاضٍ بِسِجِسْتَانَ أَنْ لاَ تَحْكُمَ بَيْنَ اثْنَيْنِ وَأَنْتَ غَضْبَانُ فَإِنِّى سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « لاَ يَحْكُمْ أَحَدٌ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ »."
            },
            {
                "hadithNo": "4491",
                "chapterNo": "7",
                "hadithEnglish": "A Hadith like that of Abu 'Awanah (no. 4490) was narrated from 'Abdur-Rahman bin Abi Bakrah, from his father, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ ح وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِى كِلاَهُمَا عَنْ شُعْبَةَ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا حُسَيْنُ بْنُ عَلِىٍّ عَنْ زَائِدَةَ كُلُّ هَؤُلاَءِ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِى بَكْرَةَ عَنْ أَبِيهِ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمِثْلِ حَدِيثِ أَبِى عَوَانَةَ."
            },
            {
                "hadithNo": "4492",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that 'Aishah said: The Messenger of Allah (s.a.w) said: \"Whoever introduces something into this matter of ours that is not part of it will have it rejected.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ الصَّبَّاحِ وَعَبْدُ اللَّهِ بْنُ عَوْنٍ الْهِلاَلِىُّ جَمِيعًا عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ قَالَ ابْنُ الصَّبَّاحِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ حَدَّثَنَا أَبِى عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ أَحْدَثَ فِى أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ »."
            },
            {
                "hadithNo": "4493",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Sa'd bin Ibrahim said: I asked Al-Qasim bin Muhammad about a man who had three dwellings and left a will concerning one third of each dwelling. He said: That could all be combined in one dwelling. Then he said: 'Aishah told me that the Messenger of Allah (s.a.w) said: \"Whoever does something that is not in accordance with this matter of ours will have it rejected.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ أَبِى عَامِرٍ قَالَ عَبْدٌ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الزُّهْرِىُّ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ سَأَلْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ عَنْ رَجُلٍ لَهُ ثَلاَثَةُ مَسَاكِنَ فَأَوْصَى بِثُلُثِ كُلِّ مَسْكَنٍ مِنْهَا قَالَ يُجْمَعُ ذَلِكَ كُلُّهُ فِى مَسْكَنٍ وَاحِدٍ ثُمَّ قَالَ أَخْبَرَتْنِى عَائِشَةُ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « مَنْ عَمِلَ عَمَلاً لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ »."
            },
            {
                "hadithNo": "4494",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from Zaid bin Khalid Al-Juhani that the Prophet (s.a.w) said: \"Shall I not tell you of the best of witnesses?\" The one who gives his testimony before being asked for it.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِى بَكْرٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ عَنِ ابْنِ أَبِى عَمْرَةَ الأَنْصَارِىِّ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِىِّ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- قَالَ « أَلاَ أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ الَّذِى يَأْتِى بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا »."
            },
            {
                "hadithNo": "4495",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"There were two women who had their sons with them. The wolf came and took away the son of one of them, and she said to her companion: 'The wolf has taken your son.' The other said: No, it has taken your son. They referred for judgment to Dawud, and he ruled in favor of the elder woman. They went out to Sulaiman, the son of Dawud, and told him about that, and he said: 'Bring me a knife and I will divide him between you.' The younger woman said: 'No, may Allah have mercy on you! He is her son.' So he ruled in favor of the younger woman.\"",
                "hadithArabic": "حَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنِى شَبَابَةُ حَدَّثَنِى وَرْقَاءُ عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « بَيْنَمَا امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا. فَقَالَتْ هَذِهِ لِصَاحِبَتِهَا إِنَّمَا ذَهَبَ بِابْنِكِ أَنْتِ. وَقَالَتِ الأُخْرَى إِنَّمَا ذَهَبَ بِابْنِكِ. فَتَحَاكَمَتَا إِلَى دَاوُدَ فَقَضَى بِهِ لِلْكُبْرَى فَخَرَجَتَا عَلَى سُلَيْمَانَ بْنِ دَاوُدَ عَلَيْهِمَا السَّلاَمُ فَأَخْبَرَتَاهُ فَقَالَ ائْتُونِى بِالسِّكِّينِ أَشُقُّهُ بَيْنَكُمَا.\r\nفَقَالَتِ الصُّغْرَى لاَ يَرْحَمُكَ اللَّهُ هُوَ ابْنُهَا. فَقَضَى بِهِ لِلصُّغْرَى ». قَالَ قَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنْ سَمِعْتُ بِالسِّكِّينِ قَطُّ إِلاَّ يَوْمَئِذٍ مَا كُنَّا نَقُولُ إِلاَّ الْمُدْيَةَ."
            },
            {
                "hadithNo": "4496",
                "chapterNo": "10",
                "hadithEnglish": "A Hadith like that of Warqa' (no. 4495) was narrated from Abu Az-Zinnad with this chain.",
                "hadithArabic": "وَحَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنِى حَفْصٌ - يَعْنِى ابْنَ مَيْسَرَةَ الصَّنْعَانِىَّ - عَنْ مُوسَى بْنِ عُقْبَةَ ح وَحَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا رَوْحٌ - وَهُوَ ابْنُ الْقَاسِمِ - عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ جَمِيعًا عَنْ أَبِى الزِّنَادِ بِهَذَا الإِسْنَادِ مِثْلَ مَعْنَى حَدِيثِ وَرْقَاءَ."
            },
            {
                "hadithNo": "4497",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Hammam bin Munabbih said: This is what Abu Hurairah narrated to us from the Messenger of Allah (s.a.w). He mentioned a number of Ahadith, including the following: The Messenger of Allah (s.a.w) said: \"A man bought some property from another man, and the man who had bought the property found therein a jar full of gold. The one who had bought the property said to him: 'Take your gold from me, for I only bought the land from you, and I did not buy the gold from you.' The one who had sold the land said: 'I sold you the land and whatever is in it.' They referred to another man for judgment and one of them said: 'I have a son.' The other said: 'I have a daughter.' He said: 'Let the son marry the daughter, and spend some of it on yourselves and give some in charity.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « اشْتَرَى رَجُلٌ مِنْ رَجُلٍ عَقَارًا لَهُ فَوَجَدَ الرَّجُلُ الَّذِى اشْتَرَى الْعَقَارَ فِى عَقَارِهِ جَرَّةً فِيهَا ذَهَبٌ فَقَالَ لَهُ الَّذِى اشْتَرَى الْعَقَارَ خُذْ ذَهَبَكَ مِنِّى إِنَّمَا اشْتَرَيْتُ مِنْكَ الأَرْضَ وَلَمْ أَبْتَعْ مِنْكَ الذَّهَبَ. فَقَالَ الَّذِى شَرَى الأَرْضَ إِنَّمَا بِعْتُكَ الأَرْضَ وَمَا فِيهَا - قَالَ - فَتَحَاكَمَا إِلَى رَجُلٍ فَقَالَ الَّذِى تَحَاكَمَا إِلَيْهِ أَلَكُمَا وَلَدٌ فَقَالَ أَحَدُهُمَا لِى غُلاَمٌ وَقَالَ الآخَرُ لِى جَارِيَةٌ. قَالَ أَنْكِحُوا الْغُلاَمَ الْجَارِيَةَ وَأَنْفِقُوا عَلَى أَنْفُسِكُمَا مِنْهُ وَتَصَدَّقَا »."
            }
        ]
    }
]