[
  {
    "SurahNumber": "67",
    "AyahNumber": "1",
    "Text": "Blessed be He in Whose hands is the Kingdom of the universe and\\n\\t\\t\\thas power over all things."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "2",
    "Text": "The One Who created death and life, so that He may put you to\\n\\t\\t\\ttest, to find out which of you is best in deeds: He is the\\n\\t\\t\\tAll-Mighty, the All-Forgiving."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "3",
    "Text": "The One Who created the seven heavens, one above another, you\\n\\t\\t\\twill not see any flaw in the creation of the Compassionate. Look\\n\\t\\t\\tonce again, do you see any flaw?"
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "4",
    "Text": "Then look still another time, yet again your sight will come back\\n\\t\\t\\tbewildered, and feel exhausted."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "5",
    "Text": "We have decorated the heaven of this world with lamps and We made\\n\\t\\t\\tthem as missiles for pelting the shaitans and thus prepared for\\n\\t\\t\\tthem the scourge of flames."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "6",
    "Text": "As for those who disbelieve their Rabb, there will be the\\n\\t\\t\\tpunishment of hell, which is an evil abode."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "7",
    "Text": "When they will be plunged into its fire, they shall hear its\\n\\t\\t\\troaring and boiling"
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "8",
    "Text": "as though bursting with rage. Every time a group is plunged\\n\\t\\t\\ttherein, its guards will ask: \"Did not a Warner come to you?\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "9",
    "Text": "They will answer: \"Yes indeed, a Warner did come to us, but we\\n\\t\\t\\trejected him and said, Allah has revealed nothing - you are\\n\\t\\t\\tmerely in gross error.\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "10",
    "Text": "They will further say: \"Had we only listened or used our\\n\\t\\t\\tintelligence, we would have not been among the inmates of the\\n\\t\\t\\tblazing fire.\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "11",
    "Text": "Thus shall they confess their sin; so away from the mercy of\\n\\t\\t\\tAllah will be the dwellers of hell."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "12",
    "Text": "As for those who fear their Rabb, although they have not seen\\n\\t\\t\\tHim, shall have forgiveness and a great reward."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "13",
    "Text": "Whether you speak in secret or aloud, surely He is aware of all\\n\\t\\t\\tthat is in the breasts."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "14",
    "Text": "Would He not know, Who has created them? He is the Knower of\\n\\t\\t\\tfinest mysteries, and aware of everything."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "15",
    "Text": "It is He Who has made the earth subservient to you, to walk\\n\\t\\t\\tthrough its tracts and eat of His provided sustenance. To Him is\\n\\t\\t\\tthe return at resurrection."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "16",
    "Text": "Do you feel secure that He Who is in heaven, will not cause the\\n\\t\\t\\tearth to cave in beneath you and start shaking suddenly?"
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "17",
    "Text": "Or do you feel secure that He Who is in heaven will not send\\n\\t\\t\\tagainst you a violent tornado, then you shall know how was My\\n\\t\\t\\twarning!"
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "18",
    "Text": "Those who have gone before them likewise disbelieved, then see\\n\\t\\t\\thow terrible was the way I rejected them?"
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "19",
    "Text": "Do they not observe the birds above them spreading their wings\\n\\t\\t\\tand folding them? None could hold them except the Compassionate\\n\\t\\t\\t(Allah), surely it is He Who watches over all things."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "20",
    "Text": "What force is there that can help you besides the Compassionate?\\n\\t\\t\\tIn fact, the unbelievers are suffering from delusion."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "21",
    "Text": "Or who is there that can provide you if He withholds His\\n\\t\\t\\tprovision? Yet, they persist in rebellion and aversion from the\\n\\t\\t\\ttruth."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "22",
    "Text": "Just think, who is rightly guided: he who walks with his face\\n\\t\\t\\tbent down, or he who walks properly on an even path?"
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "23",
    "Text": "Say: \"It is He Who has brought you into being, gave you the\\n\\t\\t\\tfaculties of hearing, seeing, feeling and understanding: yet you\\n\\t\\t\\tare seldom thankful.\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "24",
    "Text": "Say: \"It is He Who has multiplied you in the earth, and before\\n\\t\\t\\tHim you shall all be assembled.\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "25",
    "Text": "They ask: \"When will this promise be fulfilled, if what you say\\n\\t\\t\\tis true?\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "26",
    "Text": "Tell them: \"Allah Alone has the knowledge of that; my mission is\\n\\t\\t\\tonly to warn you plainly.\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "27",
    "Text": "But, when they shall see it close at hand, the faces of the\\n\\t\\t\\tdisbelievers will turn black with gloom, and it will be said to\\n\\t\\t\\tthem: \"This is which you were calling for.\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "28",
    "Text": "Further say: \"Have you ever considered that even if Allah\\n\\t\\t\\tdestroys me as well as those with me or bestows His mercy on us;\\n\\t\\t\\twho will save the disbelievers from a painful punishment?\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "29",
    "Text": "Say: \"He is the Compassionate: in Him we have believed, and in\\n\\t\\t\\tHim we have put our trust. Soon you will find out, which one of\\n\\t\\t\\tus is in the manifest error.\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "30",
    "Text": "Say: \"Have you ever considered that if all the water you have,\\n\\t\\t\\tsink down in the ground, who is it, that will bring you the\\n\\t\\t\\tclear-flowing water?\""
  }
]
