[
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "1",
    "sectionHeading": "The Hadd for Drinking Wine",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tas-Sa'ib ibn Yazid informed him that Umar ibn al-Khattab\\n\\t\\t\\t\\tcame out to them. He said, \"I have found the smell of\\n\\t\\t\\t\\twine on so-and-so, and he claimed that it was the drink\\n\\t\\t\\t\\tof boiled fruit juice, and I am inquiring about what he\\n\\t\\t\\t\\thas drunk. If it intoxicates, I will flog him.\" Umar then\\n\\t\\t\\t\\tflogged him with the complete hadd.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "2",
    "sectionHeading": "The Hadd for Drinking Wine",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thawr ibn Zayd\\n\\t\\t\\t\\tad-Dili that Umar ibn al-Khattab asked advice about a man\\n\\t\\t\\t\\tdrinking wine. Ali ibn Abi Talib said to him, \"We think\\n\\t\\t\\t\\tthat you flog him for it with eighty lashes. Because when\\n\\t\\t\\t\\the drinks, he becomes intoxicated, and when he becomes\\n\\t\\t\\t\\tintoxicated, he talks confusedly, and when he talks\\n\\t\\t\\t\\tconfusedly, he lies.\" (80 lashes is the same amount as\\n\\t\\t\\t\\tfor slandering) Umar gave eighty lashes for drinking\\n\\t\\t\\t\\twine.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "3",
    "sectionHeading": "The Hadd for Drinking Wine",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that he\\n\\t\\t\\t\\twas asked about the hadd of the slave for wine. He said,\\n\\t\\t\\t\\t\"I heard that he has half the hadd of a freeman for\\n\\t\\t\\t\\tdrinking wine. Umar ibn al-Khattab, Uthman ibn Affan, and\\n\\t\\t\\t\\tAbdullah ibn Umar flogged their slaves with half of the\\n\\t\\t\\t\\thadd of a freeman when they drank wine.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "4",
    "sectionHeading": "The Hadd for Drinking Wine",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the heard Said ibn al-Musayyab say, \"There is nothing that\\n\\t\\t\\t\\tAllah does not like to be pardoned as long as it is not a\\n\\t\\t\\t\\thadd.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The sunna with us is that\\n\\t\\t\\t\\tthe hadd is obliged against anyone who drinks something\\n\\t\\t\\t\\tintoxicating whether or not he becomes drunk.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "5",
    "sectionHeading": "Containers Forbidden for Preparation of Nabidh",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, addressed the people in one of his\\n\\t\\t\\t\\traids. Abdullah ibn Umar said, \"I went towards him, but\\n\\t\\t\\t\\the finished before I reached him. I asked about what he\\n\\t\\t\\t\\thad said. Someone said to me, 'He forbade preparing\\n\\t\\t\\t\\tnabidh in a gourd or in a jug smeared with pitch.'\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "6",
    "sectionHeading": "Containers Forbidden for Preparation of Nabidh",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from al-Ala ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Yaqub from his father from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade preparing nabidh in a gourd or in a jug\\n\\t\\t\\t\\tsmeared with pitch.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "7",
    "sectionHeading": "Mixtures of Fruit Disapproved for Making Nabidh",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade preparing nabidh\\n\\t\\t\\t\\tfrom nearly ripe dates and fresh dates together, and from\\n\\t\\t\\t\\tdates and raisins together.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "8",
    "sectionHeading": "Mixtures of Fruit Disapproved for Making Nabidh",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from a reliable source\\n\\t\\t\\t\\tfrom Bukayr ibn Abdullah ibn al-Ashajj from Abd ar-Rahman\\n\\t\\t\\t\\tibn al-Hubab al-Ansari from Abu Qatada al-Ansari that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade making nabidh from dates and raisins\\n\\t\\t\\t\\ttogether, and nearly ripe dates and fresh dates together.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the way of doing things among us in\\n\\t\\t\\t\\twhich the people of knowledge in our city continue. It is\\n\\t\\t\\t\\tdisapproved of because the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "9",
    "sectionHeading": "Wine Made Haram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from ibn Shihab from Abu\\n\\t\\t\\t\\tSalama ibn Abd ar-Rahman that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, was asked about mead, and he replied, 'Every\\n\\t\\t\\t\\tdrink which intoxicates is haram.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "10",
    "sectionHeading": "Wine Made Haram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, was asked about\\n\\t\\t\\t\\tal-Ghubayra. He said, \"There is no good in it,\" and\\n\\t\\t\\t\\tforbade it. Malik said, \"I asked Zayd ibn Aslam, 'What is\\n\\t\\t\\t\\tal-Ghubayra?' He said, 'It is an intoxicant.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "11",
    "sectionHeading": "Wine Made Haram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said \"Whoever drinks wine in this\\n\\t\\t\\t\\tworld and does not turn from it in tawba, it is haram for\\n\\t\\t\\t\\thim in the Next World.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "12",
    "sectionHeading": "General Section on Wine being Made Haram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tIbn Wala al-Misri asked Abdullah ibn Abbas about what is\\n\\t\\t\\t\\tsqueezed from the grapes. Ibn Abbas replied, \"A man gave\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, a small water-skin of wine. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\thim, 'Don't you know that Allah has made it haram?' He\\n\\t\\t\\t\\tsaid, 'No.' Then a man at his side whispered to him. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, asked what he had whispered, and the man replied,\\n\\t\\t\\t\\t'I told him to sell it.' The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, 'The One who\\n\\t\\t\\t\\tmade drinking it haram has made selling it haram.' The\\n\\t\\t\\t\\tman then opened the water-skins and poured out what was\\n\\t\\t\\t\\tin them .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "13",
    "sectionHeading": "General Section on Wine being Made Haram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha that Anas ibn Malik said, \"I was serving\\n\\t\\t\\t\\twine to Abu Ubayda ibn al-Jarrah and Abu Talha al-Ansari\\n\\t\\t\\t\\tand Umayy ibn Kab. The wine had been prepared from\\n\\t\\t\\t\\tcrushed ripe dates and dried dates. Someone came to them\\n\\t\\t\\t\\tand said, 'Wine has been made haram.' Abu Talha ordered\\n\\t\\t\\t\\tme to go and take the jugs and break them. I stood up and\\n\\t\\t\\t\\twent to a mortar of ours and I struck them with the\\n\\t\\t\\t\\tbottom of it until they broke.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "14",
    "sectionHeading": "General Section on Wine being Made Haram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Da'ud ibn al-Husayn\\n\\t\\t\\t\\tthat Waqid ibn Amr ibn Sad ibn Muadh informed him from\\n\\t\\t\\t\\tMahmud ibn Labid al-Ansari that when Umar ibn al-Khattab\\n\\t\\t\\t\\twent to ash-Sham, the people of ash-Sham complained to\\n\\t\\t\\t\\thim about the bad air of their land and its heaviness.\\n\\t\\t\\t\\tThey said, \"Only this drink helps.\" Umar said, \"Drink\\n\\t\\t\\t\\tthis honey preparation.\" They said, \"Honey does not help\\n\\t\\t\\t\\tus.\" A man from the people of that land said, \"Can we\\n\\t\\t\\t\\tgive you something of this drink which does not\\n\\t\\t\\t\\tintoxicate?\" He said, \"Yes.\" They cooked it until\\n\\t\\t\\t\\ttwo-thirds of it evaporated and one-third of it remained.\\n\\t\\t\\t\\tThen they brought it to Umar. Umar put his finger in it\\n\\t\\t\\t\\tand then lifted his head and extended it. He said, \"This\\n\\t\\t\\t\\tis fruit juice concentrated by boiling. This is like the\\n\\t\\t\\t\\tdistillation with which you smear the camel's scabs.\"\\n\\t\\t\\t\\tUmar ordered them to drink it. Ubada ibn as-Samit said to\\n\\t\\t\\t\\thim, \"You have made it halal, by Allah!\" Umar said, \"No,\\n\\t\\t\\t\\tby Allah! O Allah! I will not make anything halal for\\n\\t\\t\\t\\tthem which You have made haram for them! I will not make\\n\\t\\t\\t\\tanything haram for them which You have made halal for\\n\\t\\t\\t\\tthem.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "42",
    "hadithNumber": "15",
    "sectionHeading": "General Section on Wine being Made Haram",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that some men from Iraq said to him, \"Abu Abd\\n\\t\\t\\t\\tar-Rahman, we buy the fruit of the palm and grapes and we\\n\\t\\t\\t\\tsqueeze them into wine and we sell it.\" Abdullah ibn Umar\\n\\t\\t\\t\\tsaid, \"I call on Allah and His angels and whoever hears\\n\\t\\t\\t\\tof jinn and men to testify to you that I order you not to\\n\\t\\t\\t\\tbuy it nor sell it nor to press it nor to drink it nor to\\n\\t\\t\\t\\tgive it to people to drink. It is something impure from\\n\\t\\t\\t\\tthe work of Shaytan.\"\\n\\t\\t\\t</p>"
  }
]
