[
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "1",
    "sectionHeading": "Judgement on the Mukatab.",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that Abdullah ibn Umar\\n\\t\\t\\t\\tsaid, \"A mukatab is a slave as long as any of his kitaba\\n\\t\\t\\t\\tremains to be paid.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "2",
    "sectionHeading": "Judgement on the Mukatab.",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Urwa ibn\\n\\t\\t\\t\\taz-Zubayr and Sulayman ibn Yasar said, \"The mukatab is a\\n\\t\\t\\t\\tslave as long as any of his kitaba remains to be paid.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is my opinion as well.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a mukatab dies and leaves more property\\n\\t\\t\\t\\tthan what remains to be paid of his kitaba and he has\\n\\t\\t\\t\\tchildren who were born during the time of his kitaba or\\n\\t\\t\\t\\twhose kitaba has been written as well, they inherit any\\n\\t\\t\\t\\tproperty that remains after the kitaba has been paid.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "3",
    "sectionHeading": "Judgement on the Mukatab.",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Humayd ibn Qays al-Makki that a\\n\\t\\t\\t\\tson of al-Mutawakkil had a mukatab who died at Makka and\\n\\t\\t\\t\\tleft (enough to pay) the rest of his kitaba and he owed\\n\\t\\t\\t\\tsome debts to people. He also left a daughter. The\\n\\t\\t\\t\\tgovernor of Makka was not certain about how to judge in\\n\\t\\t\\t\\tthe case, so he wrote to Abd al-Malik ibn Marwan to ask\\n\\t\\t\\t\\thim about it. Abd al-Malik wrote to him, \"Begin with the\\n\\t\\t\\t\\tdebts owed to people, and then pay what remains of his\\n\\t\\t\\t\\tkitaba. Then divide what remains of the property between\\n\\t\\t\\t\\tthe daughter and the master.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done among us is that the master of\\n\\t\\t\\t\\ta slave does not have to give his slave a kitaba if he\\n\\t\\t\\t\\tasks for it. I have not heard of any of the Imams forcing\\n\\t\\t\\t\\ta man to give a kitaba to his slave. I heard that one of\\n\\t\\t\\t\\tthe people of knowledge, when someone asked about that\\n\\t\\t\\t\\tand mentioned that Allah the Blessed, the Exalted, said,\\n\\t\\t\\t\\t'Give them their kitaba, if you know some good in them'\\n\\t\\t\\t\\t(Sura 24 ayat 33) recited these two ayats, 'When you are\\n\\t\\t\\t\\tfree of the state of ihram, then hunt for game.' (Sura 5\\n\\t\\t\\t\\tayat 3) 'When the prayer is finished, scatter in the land\\n\\t\\t\\t\\tand seek Allah's favour.' \" (Sura 62 ayat 10)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik commented, \"It is a way of doing things for which\\n\\t\\t\\t\\tAllah, the Mighty, the Majestic, has given permission to\\n\\t\\t\\t\\tpeople, and it is not obligatory for them.\" Malik said,\\n\\t\\t\\t\\t\"I heard one of the people of knowledge say about the\\n\\t\\t\\t\\tword of Allah, the Blessed, the Exalted, 'Give them of\\n\\t\\t\\t\\tthe wealth which Allah has given you,' that it meant that\\n\\t\\t\\t\\ta man give his slave a kitaba and then reduce the end of\\n\\t\\t\\t\\this kitaba for him by some specific amount.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I have heard from the people of\\n\\t\\t\\t\\tknowledge and what I see people doing here.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have heard that Abdullah ibn Umar gave one\\n\\t\\t\\t\\tof his slaves his kitaba for 35,000 dirhams, and then\\n\\t\\t\\t\\treduced the end of his kitaba by 5,000 dirhams.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done among us is that when a master\\n\\t\\t\\t\\tgives a mukatab his kitaba, the mukatab's property goes\\n\\t\\t\\t\\twith him but his children do not go with him unless he\\n\\t\\t\\t\\tstipulates that in his kitaba.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"I heard Malik say that if a mukatab whose\\n\\t\\t\\t\\tmaster had given him a kitaba had a slave-girl who was\\n\\t\\t\\t\\tpregnant by him, and neither he nor his master knew that\\n\\t\\t\\t\\ton the day he was given his kitaba, the child did not\\n\\t\\t\\t\\tfollow him because he was not included in the kitaba. He\\n\\t\\t\\t\\tbelonged to the master. As for the slave-girl, she\\n\\t\\t\\t\\tbelonged to the mukatab because she was his property.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man and his wife's son (by another\\n\\t\\t\\t\\thusband) inherited a mukatab from the wife and the\\n\\t\\t\\t\\tmukatab died before he had completed his kitaba, they\\n\\t\\t\\t\\tdivided his inheritance between them according to the\\n\\t\\t\\t\\tBook of Allah. If the slave paid his kitaba and then\\n\\t\\t\\t\\tdied, his inheritance went to the son of the woman, and\\n\\t\\t\\t\\tthe husband had nothing of his inheritance.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a mukatab gave his own slave a kitaba,\\n\\t\\t\\t\\tthe situation was looked at. If he wanted to do his slave\\n\\t\\t\\t\\ta favour and it was obvious by his making it easy for\\n\\t\\t\\t\\thim, that was not permitted. If he was giving him a\\n\\t\\t\\t\\tkitaba from desire to find money to pay off his own\\n\\t\\t\\t\\tkitaba, that was permitted for him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man had intercourse with a mukataba\\n\\t\\t\\t\\tof his and she became pregnant by him, she had an option.\\n\\t\\t\\t\\tIf she liked she could be an umm walad. If she wished,\\n\\t\\t\\t\\tshe could confirm her kitaba. If she did not conceive,\\n\\t\\t\\t\\tshe still had her kitaba.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us about a slave who is owned by two men is that\\n\\t\\t\\t\\tone of them does not give a kitaba for his share, whether\\n\\t\\t\\t\\tor not his companion gives him permission to do so,\\n\\t\\t\\t\\tunless they both write the kitaba together, because that\\n\\t\\t\\t\\talone would effect setting him free. If the slave were to\\n\\t\\t\\t\\tfulfil what he had agreed on to free half of himself, and\\n\\t\\t\\t\\tthen the one who had given a kitaba for half of him was\\n\\t\\t\\t\\tnot obliged to complete his setting free, that would be\\n\\t\\t\\t\\tin opposition to the words of the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace. 'If someone frees\\n\\t\\t\\t\\this share in a slave and has enough money to cover the\\n\\t\\t\\t\\tfull price of the slave, justly evaluated for him, he\\n\\t\\t\\t\\tmust give his partners their shares, so the slave is\\n\\t\\t\\t\\tcompletely free . ' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If he is not aware of that until the mukatab\\n\\t\\t\\t\\thas met the terms or before he has met them the owner who\\n\\t\\t\\t\\thas written him the kitaba returns what he has taken from\\n\\t\\t\\t\\tthe mukatab to him, and then he and his partner divide\\n\\t\\t\\t\\thim according to their original shares and the kitaba is\\n\\t\\t\\t\\tinvalid. He is the slave of both of them in his original\\n\\t\\t\\t\\tstate.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a mukatab who was owned by two men and\\n\\t\\t\\t\\tone of them granted him a delay in the payment of the\\n\\t\\t\\t\\tright which he was owed, and the other refused to defer\\n\\t\\t\\t\\tit, and so the one who refused to defer the payment\\n\\t\\t\\t\\texacted his part of the due. Malik said that if the\\n\\t\\t\\t\\tmukatab then died and left property which did not\\n\\t\\t\\t\\tcomplete his kitaba, \"They divide it according to what\\n\\t\\t\\t\\tthey are still owed by him. Each of them takes according\\n\\t\\t\\t\\tto his share. If the mukatab leaves more than his kitaba,\\n\\t\\t\\t\\teach of them takes what remains to them of the kitaba,\\n\\t\\t\\t\\tand what remains after that is divided equally between\\n\\t\\t\\t\\tthem. If the mukatab is unable to pay his kitaba fully\\n\\t\\t\\t\\tand the one who did not allow him to defer his payment\\n\\t\\t\\t\\thas exacted more than his associate did, the slave is\\n\\t\\t\\t\\tstill divided equally between them, and he does not\\n\\t\\t\\t\\treturn to his associates the excess of what he has\\n\\t\\t\\t\\texacted, because he only exacted his right with the\\n\\t\\t\\t\\tpermission of his associate. If one of them remits what\\n\\t\\t\\t\\tis owed to him and then his associate exacts part of what\\n\\t\\t\\t\\the is owed by him and then the mukatab is unable to pay,\\n\\t\\t\\t\\the belongs to both of them. And the one who has exacted\\n\\t\\t\\t\\tsomething does not return anything because he only\\n\\t\\t\\t\\tdemanded what he was owed. That is like the debt of two\\n\\t\\t\\t\\tmen in one writing against one man. One of them grants\\n\\t\\t\\t\\thim time to pay and the other is greedy and exacts his\\n\\t\\t\\t\\tdue. Then the debtor goes bankrupt. The one who exacted\\n\\t\\t\\t\\this due does not have to return any of what he took.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "4",
    "sectionHeading": "Assuming the Responsibility in Kitaba",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us is that when slaves write their kitaba together\\n\\t\\t\\t\\tin one kitaba, and some are responsible for others, and\\n\\t\\t\\t\\tthey are not reduced anything by the death of one of the\\n\\t\\t\\t\\tresponsible ones, and then one of them says, 'I can't do\\n\\t\\t\\t\\tit,' and gives up, his companions can use him in whatever\\n\\t\\t\\t\\twork he can do and they help each other with that in\\n\\t\\t\\t\\ttheir kitaba until they are freed, if they are freed, or\\n\\t\\t\\t\\tremain slaves if they remain slaves.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us is that when a master gives a slave his kitaba,\\n\\t\\t\\t\\tit is not permitted for the master to let anyone assume\\n\\t\\t\\t\\tthe responsibility for the kitaba of his slave if the\\n\\t\\t\\t\\tslave dies or is incapable. This is not part of the sunna\\n\\t\\t\\t\\tof the muslims. That is because when a man assumes\\n\\t\\t\\t\\tresponsibility to the master of a mukatab for what the\\n\\t\\t\\t\\tmukatab owes of his kitaba, and then the master of the\\n\\t\\t\\t\\tmukatab pursues that from the one who assumes the\\n\\t\\t\\t\\tresponsibility, he takes his money falsely. It is not as\\n\\t\\t\\t\\tif he is buying the mukatab, so that what he gives is\\n\\t\\t\\t\\tpart of the price of something that is his, and neither\\n\\t\\t\\t\\tis the mukatab being freed so that the price established\\n\\t\\t\\t\\tfor him buys his inviolability as a free man. If the\\n\\t\\t\\t\\tmukatab is unable to meet the payments he reverts to his\\n\\t\\t\\t\\tmaster and is his slave. That is because kitaba is not a\\n\\t\\t\\t\\tfixed debt which can be assumed by the master of the\\n\\t\\t\\t\\tmukatab. It is something which, when it is paid by the\\n\\t\\t\\t\\tmukatab, sets him free. If the mukatab dies and has a\\n\\t\\t\\t\\tdebt, his master is not one of the creditors for what\\n\\t\\t\\t\\tremains unpaid of the kitaba. The creditors have\\n\\t\\t\\t\\tprecedence over the master. If the mukatab cannot meet\\n\\t\\t\\t\\tthe payments, and he owes debts to people, he reverts to\\n\\t\\t\\t\\tbeing a slave owned by his master and the debts to the\\n\\t\\t\\t\\tpeople are the liability of the mukatab. The creditors do\\n\\t\\t\\t\\tnot enter with the master into any share of the price of\\n\\t\\t\\t\\this person.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When people are written together in one\\n\\t\\t\\t\\tkitaba and there is no kinship between them by which they\\n\\t\\t\\t\\tinherit from each other, and some of them are responsible\\n\\t\\t\\t\\tfor others, then none of them are freed before the others\\n\\t\\t\\t\\tuntil all the kitaba has been paid. If one of them dies\\n\\t\\t\\t\\tand leaves property and it is more than all of what is\\n\\t\\t\\t\\tagainst them, it pays all that is against them . The\\n\\t\\t\\t\\texcess of the property goes to the master, and none of\\n\\t\\t\\t\\tthose who have been written in the kitaba with the\\n\\t\\t\\t\\tdeceased have any of the excess. The master's claims are\\n\\t\\t\\t\\tovershadowed by their claims for the portions which\\n\\t\\t\\t\\tremain against them of the kitaba which can be fulfilled\\n\\t\\t\\t\\tfrom the property of the deceased, because the deceased\\n\\t\\t\\t\\thad assumed their responsibility and they must use his\\n\\t\\t\\t\\tproperty to pay for their freedom. If the deceased\\n\\t\\t\\t\\tmukatab has a free child not born in kitaba and who was\\n\\t\\t\\t\\tnot written in the kitaba, it does not inherit from him\\n\\t\\t\\t\\tbecause the mukatab was not freed until he died.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "5",
    "sectionHeading": "Severance in the Kitaba for an Agreed Price",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard that Umm Salama, the\\n\\t\\t\\t\\twife of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, made a settlement with her mukatab for an agreed\\n\\t\\t\\t\\tamount of gold and silver.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us in the case of a mukatab who is shared by two\\n\\t\\t\\t\\tpartners, is that one of them cannot make a settlement\\n\\t\\t\\t\\twith him for an agreed price according to his portion\\n\\t\\t\\t\\twithout the consent of his partner. That is because the\\n\\t\\t\\t\\tslave and his property are owned by both of them, and so\\n\\t\\t\\t\\tone of them is not permitted to take any of the property\\n\\t\\t\\t\\texcept with the consent of his partner. If one of them\\n\\t\\t\\t\\tsettled with the mukatab and his partner did not, and he\\n\\t\\t\\t\\ttook the agreed price, and then the mukatab died while he\\n\\t\\t\\t\\thad property or was unable to pay, the one who settled\\n\\t\\t\\t\\twould not have anything of the mukatab's property and he\\n\\t\\t\\t\\tcould not return that for which he made settlement so\\n\\t\\t\\t\\tthat his right to the slave's person would return to him.\\n\\t\\t\\t\\tHowever, when someone settles with a mukatab with the\\n\\t\\t\\t\\tpermission of his partner and then the mukatab is unable\\n\\t\\t\\t\\tto pay, it is preferable that the one who broke with him\\n\\t\\t\\t\\treturn what he has taken from the mukatab for the\\n\\t\\t\\t\\tseverance and he can have back his portion of the\\n\\t\\t\\t\\tmukatab. He can do that. If the mukatab dies and leaves\\n\\t\\t\\t\\tproperty, the partner who has kept hold of the kitaba is\\n\\t\\t\\t\\tpaid in full the amount of the kitaba which remains to\\n\\t\\t\\t\\thim against the mukatab from the mukatab's property. Then\\n\\t\\t\\t\\twhat remains of property of the mukatab is between the\\n\\t\\t\\t\\tpartner who broke with him and his partner, according to\\n\\t\\t\\t\\ttheir shares in the mukatab. If one of the partners\\n\\t\\t\\t\\tbreaks off with him and the other keeps the kitaba, and\\n\\t\\t\\t\\tthe mukatab is unable to pay, it is said to the partner\\n\\t\\t\\t\\twho settled with him, 'If you wish to give your partner\\n\\t\\t\\t\\thalf of what you took so the slave is divided between\\n\\t\\t\\t\\tyou, then do so. If you refuse, then all of the slave\\n\\t\\t\\t\\tbelongs to the one who held on to possession of the\\n\\t\\t\\t\\tslave.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a mukatab who was shared between two\\n\\t\\t\\t\\tmen and one of them made a settlement with him with the\\n\\t\\t\\t\\tpermission of his partner. Then the one who retained\\n\\t\\t\\t\\tpossession of the slave demanded the like of that for\\n\\t\\t\\t\\twhich his partner had settled or more than that and the\\n\\t\\t\\t\\tmukatab could not pay it. He said, \"The mukatab is shared\\n\\t\\t\\t\\tbetween them because the man has only demanded what is\\n\\t\\t\\t\\towed to him. If he demands less than what the one who\\n\\t\\t\\t\\tsettled with him took and the mukatab can not manage\\n\\t\\t\\t\\tthat, and the one who settled with him prefers to return\\n\\t\\t\\t\\tto his partner half of what he took so the slave is\\n\\t\\t\\t\\tdivided in halves between them, he can do that. If he\\n\\t\\t\\t\\trefuses then all of the slave belongs to the one who did\\n\\t\\t\\t\\tnot settle with him. If the mukatab dies and leaves\\n\\t\\t\\t\\tproperty, and the one who settled with him prefers to\\n\\t\\t\\t\\treturn to his companion half of what he has taken so the\\n\\t\\t\\t\\tinheritance is divided between them, he can do that. If\\n\\t\\t\\t\\tthe one who has kept the kitaba takes the like of what\\n\\t\\t\\t\\tthe one who has settled with him took, or more, the\\n\\t\\t\\t\\tinheritance is between them according to their shares in\\n\\t\\t\\t\\tthe slave because he is only taking his right.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a mukatab who was shared between two\\n\\t\\t\\t\\tmen and one of them made a settlement with him for half\\n\\t\\t\\t\\tof what was due to him with the permission of his\\n\\t\\t\\t\\tpartner, and then the one who retained possession of the\\n\\t\\t\\t\\tslave took less than what his partner settled with him\\n\\t\\t\\t\\tfor and the mukatab was unable to pay. He said, \"If the\\n\\t\\t\\t\\tone who made a settlement with the slave prefers to\\n\\t\\t\\t\\treturn half of what he was awarded to his partner, the\\n\\t\\t\\t\\tslave is divided between them. If he refuses to return\\n\\t\\t\\t\\tit, the one who retained possession has the portion of\\n\\t\\t\\t\\tthe share for which his partner made a settlement with\\n\\t\\t\\t\\tthe mukatab.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of that is that the slave is\\n\\t\\t\\t\\tdivided in two halves between them. They write him a\\n\\t\\t\\t\\tkitaba together and then one of them makes a settlement\\n\\t\\t\\t\\twith the mukatab for half his due with the permission of\\n\\t\\t\\t\\this partner. That is a fourth of all the slave. Then the\\n\\t\\t\\t\\tmukatab is unable to continue, so it is said to the one\\n\\t\\t\\t\\twho settled with him, 'If you wish, return to your\\n\\t\\t\\t\\tpartner half of what you were awarded and the slave is\\n\\t\\t\\t\\tdivided equally between you.' If he refuses, the one who\\n\\t\\t\\t\\theld to the kitaba takes in full the fourth of his\\n\\t\\t\\t\\tpartner for which he made settlement with the mukatab. He\\n\\t\\t\\t\\thad half the slave, so that now gives him three-fourths\\n\\t\\t\\t\\tof the slave. The one who broke off has a fourth of the\\n\\t\\t\\t\\tslave because he refused to return the equivalent of the\\n\\t\\t\\t\\tfourth share for which he settled.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a mukatab whose master made a\\n\\t\\t\\t\\tsettlement with him and set him free and what remained of\\n\\t\\t\\t\\this severance was written against him as debt, then the\\n\\t\\t\\t\\tmukatab died and people had debts against him. He said,\\n\\t\\t\\t\\t\"His master does not share with the creditors because of\\n\\t\\t\\t\\twhat he is owed from the severance. The creditors begin\\n\\t\\t\\t\\tfirst.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A mukatab cannot break with his master when\\n\\t\\t\\t\\the owes debts to people. He would be set free and have\\n\\t\\t\\t\\tnothing because the people who hold the debts are more\\n\\t\\t\\t\\tentitled to his property than his master. That is not\\n\\t\\t\\t\\tpermitted for him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"According to the way things are done among\\n\\t\\t\\t\\tus, there is no harm if a man gives a kitaba to his slave\\n\\t\\t\\t\\tand settles with him for gold and reduces what he is owed\\n\\t\\t\\t\\tof the kitaba provided that only the gold is paid\\n\\t\\t\\t\\timmediately. Whoever disapproves of that does so because\\n\\t\\t\\t\\the puts it in the category of a debt which a man has\\n\\t\\t\\t\\tagainst another man for a set term. He gives him a\\n\\t\\t\\t\\treduction and he pays it immediately. This is not like\\n\\t\\t\\t\\tthat debt. The breaking of the mukatab with his master is\\n\\t\\t\\t\\tdependent on his giving money to speed up the setting\\n\\t\\t\\t\\tfree. Inheritance, testimony and the hudud are obliged\\n\\t\\t\\t\\tfor him and the inviolability of being set free is\\n\\t\\t\\t\\testablished for him. He is not buying dirhams for dirhams\\n\\t\\t\\t\\tor gold for gold. Rather it is like a man who having said\\n\\t\\t\\t\\tto his slave, 'Bring me such-and-such an amount of dinars\\n\\t\\t\\t\\tand you are free', then reduces that for him, saying, 'If\\n\\t\\t\\t\\tyou bring me less than that, you are free.' That is not a\\n\\t\\t\\t\\tfixed debt. Had it been a fixed debt, the master would\\n\\t\\t\\t\\thave shared with the creditors of the mukatab when he\\n\\t\\t\\t\\tdied or went bankrupt. His claim on the property of the\\n\\t\\t\\t\\tmukatab would join theirs.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "6",
    "sectionHeading": "Injuries Caused by Mukatabs",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The best of what I have heard about a\\n\\t\\t\\t\\tmukatab who injures a man so that blood-money must be\\n\\t\\t\\t\\tpaid, is that if the mukatab can pay the blood-money for\\n\\t\\t\\t\\tthe injury with his kitaba,  he does so, and it is\\n\\t\\t\\t\\tagainst his kitaba. If he cannot do that, and he cannot\\n\\t\\t\\t\\tpay his kitaba because he must pay the blood-money of\\n\\t\\t\\t\\tthat injury before the kitaba, and he cannot pay the\\n\\t\\t\\t\\tblood-money of that injury, then his master has an\\n\\t\\t\\t\\toption. If he prefers to pay the blood-money of that\\n\\t\\t\\t\\tinjury, he does so and keeps his slave and he becomes an\\n\\t\\t\\t\\towned slave. If he wishes to surrender the slave to the\\n\\t\\t\\t\\tinjured, he surrenders him. The master does not have to\\n\\t\\t\\t\\tdo more than surrender his slave.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about people who were in a general kitaba and\\n\\t\\t\\t\\tone of them caused an injury which entailed blood-money.\\n\\t\\t\\t\\tHe said, \"If any of them does an injury involving\\n\\t\\t\\t\\tblood-money, he and those who are with him in the kitaba\\n\\t\\t\\t\\tare asked to pay all the blood-money of that injury. If\\n\\t\\t\\t\\tthey pay, they are confirmed in their kitaba. If they do\\n\\t\\t\\t\\tnot pay, and they are incapable then their master has an\\n\\t\\t\\t\\toption. If he wishes, he can pay all the blood-money of\\n\\t\\t\\t\\tthat injury and all the slaves revert to him. If he\\n\\t\\t\\t\\twishes, he can surrender the one who did the injury alone\\n\\t\\t\\t\\tand all the others revert to being his slaves since they\\n\\t\\t\\t\\tcould not pay the blood-money of the injury which their\\n\\t\\t\\t\\tcompanion caused.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things about which there is\\n\\t\\t\\t\\tno dispute among us, is that when a mukatab is injured in\\n\\t\\t\\t\\tsome way which entails blood-money or one of the\\n\\t\\t\\t\\tmukatab's children who is written with him in the kitaba\\n\\t\\t\\t\\tis injured, their blood-money is the blood-money of\\n\\t\\t\\t\\tslaves of their value, and what is appointed to them as\\n\\t\\t\\t\\ttheir blood-money is paid to the master who has the\\n\\t\\t\\t\\tkitaba and he reckons that for the mukatab at the end of\\n\\t\\t\\t\\this kitaba and there is a reduction for the blood-money\\n\\t\\t\\t\\tthat the master has taken for the injury.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of that is say, for example,\\n\\t\\t\\t\\the has written his kitaba for three thousand dirhams and\\n\\t\\t\\t\\tthe blood-money taken by the master for his injury is one\\n\\t\\t\\t\\tthousand dirhams. When the mukatab has paid his master\\n\\t\\t\\t\\ttwo thousand dirhams he is free. If what remains of his\\n\\t\\t\\t\\tkitaba is one thousand dirhams and the blood-money for\\n\\t\\t\\t\\this injury is one thousand dirhams, he is free\\n\\t\\t\\t\\tstraightaway. If the blood-money of the injury is more\\n\\t\\t\\t\\tthan what remains of the kitaba, the master of the\\n\\t\\t\\t\\tmukatab takes what remains of his kitaba and frees him.\\n\\t\\t\\t\\tWhat remains after the payment of the kitaba belongs to\\n\\t\\t\\t\\tthe mukatab. One must not pay the mukatab any of the\\n\\t\\t\\t\\tblood-money of his injury in case he might consume it and\\n\\t\\t\\t\\tuse it up. If he could not pay his kitaba completely he\\n\\t\\t\\t\\twould then return to his master one eyed, with a hand cut\\n\\t\\t\\t\\toff, or crippled in body. His master only wrote his\\n\\t\\t\\t\\tkitaba against his property and earnings, and he did not\\n\\t\\t\\t\\twrite his kitaba so that he would take the blood-money\\n\\t\\t\\t\\tfor what happened to his child or to himself and use it\\n\\t\\t\\t\\tup and consume it. One pays the blood-money of injuries\\n\\t\\t\\t\\tto a mukatab and his children who are born in his kitaba,\\n\\t\\t\\t\\tor their kitaba is written, to the master and he takes it\\n\\t\\t\\t\\tinto account for him at the end of his kitaba.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "7",
    "sectionHeading": "Selling Mukatabs",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The best of what is said about a man who\\n\\t\\t\\t\\tbuys the mukatab of a man is that if the man wrote the\\n\\t\\t\\t\\tslave's kitaba for dinars or dirhams, he does not sell\\n\\t\\t\\t\\thim unless it is for merchandise which is paid\\n\\t\\t\\t\\timmediately and not deferred, because if it is deferred,\\n\\t\\t\\t\\tit would be a debt for a debt. A debt for a debt is\\n\\t\\t\\t\\tforbidden.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"If the master gives a mukatab his kitaba for\\n\\t\\t\\t\\tcertain merchandise of camels, cattle, sheep, or slaves,\\n\\t\\t\\t\\tit is more correct that the buyer buy him for gold,\\n\\t\\t\\t\\tsilver, or different goods than the ones his master wrote\\n\\t\\t\\t\\tthe kitaba for, and that must be paid immediately, not\\n\\t\\t\\t\\tdeferred.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The best of what I have heard about a\\n\\t\\t\\t\\tmukatab when he is sold is that he is more entitled to\\n\\t\\t\\t\\tbuy his kitaba than the one who buys him if he can pay\\n\\t\\t\\t\\this master the price for which he was sold in cash. That\\n\\t\\t\\t\\tis because his buying himself is his freedom, and freedom\\n\\t\\t\\t\\thas priority over what bequests accompany it. If one of\\n\\t\\t\\t\\tthose who have written the kitaba for the mukatab sells\\n\\t\\t\\t\\this portion of him, so that a half, a third, a fourth, or\\n\\t\\t\\t\\twhatever share of the mukatab is sold, the mukatab does\\n\\t\\t\\t\\tnot have the right of pre-emption in what is sold of him.\\n\\t\\t\\t\\tThat is because it is like the severance of a partner,\\n\\t\\t\\t\\tand a partner can only make a settlement for a partner of\\n\\t\\t\\t\\tthe one who is mukatab with the permission of his\\n\\t\\t\\t\\tpartners because what is sold of him does not give him\\n\\t\\t\\t\\tcomplete rights as a free man and his property is barred\\n\\t\\t\\t\\tfrom him, and by buying part of himself, it is feared\\n\\t\\t\\t\\tthat he will become incapable of completing payment\\n\\t\\t\\t\\tbecause of what he had to spend. That is not like the\\n\\t\\t\\t\\tmukatab buying himself completely unless whoever has some\\n\\t\\t\\t\\tof the kitaba remaining due to him gives him permission.\\n\\t\\t\\t\\tIf they give him permission, he is more entitled to what\\n\\t\\t\\t\\tis sold of him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Selling one of the instalments of a mukatab\\n\\t\\t\\t\\tis not halal. That is because it Is an uncertain\\n\\t\\t\\t\\ttransaction. If the mukatab cannot pay it, what he owes\\n\\t\\t\\t\\tis nullified. If he dies or goes bankrupt and he owes\\n\\t\\t\\t\\tdebts to people, then the person who bought his\\n\\t\\t\\t\\tinstalment does not take any of his portion with the\\n\\t\\t\\t\\tcreditors. The person who buys one of the instalments of\\n\\t\\t\\t\\tthe mukatab is in the position of the master of the\\n\\t\\t\\t\\tmukatab. The master of the mukatab does not have a share\\n\\t\\t\\t\\twith the creditors of the mukatab for what he is owed of\\n\\t\\t\\t\\tthe kitaba of his slave. It is also like that with the\\n\\t\\t\\t\\tkharaj, (a set amount deducted daily from the slave\\n\\t\\t\\t\\tagainst his earnings), which accumulates for a master\\n\\t\\t\\t\\tfrom the earnings of his slave. The creditors of his\\n\\t\\t\\t\\tslave do not allow him a share for what has accumulated\\n\\t\\t\\t\\tfor him from those deductions.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in a mukatab paying off his\\n\\t\\t\\t\\tkitaba with coin or merchandise other than the\\n\\t\\t\\t\\tmerchandise for which he wrote his kitaba if it is\\n\\t\\t\\t\\tidentical with it, on time (for the instalment) or\\n\\t\\t\\t\\tdelayed. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a mukatab died and left an umm walad\\n\\t\\t\\t\\tand small children by her or by someone else and they\\n\\t\\t\\t\\tcould not work and it was feared that they would be\\n\\t\\t\\t\\tunable to fulfil their kitaba, the umm walad of the\\n\\t\\t\\t\\tfather was sold if her price would pay all the kitaba for\\n\\t\\t\\t\\tthem, whether or not she was their mother. They were paid\\n\\t\\t\\t\\tfor and set free because their father did not forbid her\\n\\t\\t\\t\\tsale if he feared that he would be unable to complete his\\n\\t\\t\\t\\tkitaba. If her price would not pay for them and neither\\n\\t\\t\\t\\tshe nor they could work, they all reverted to being\\n\\t\\t\\t\\tslaves of the master.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done among us in the case of a\\n\\t\\t\\t\\tperson who buys the kitaba of a mukatab, and then the\\n\\t\\t\\t\\tmukatab dies before he has paid his kitaba, is that the\\n\\t\\t\\t\\tperson who bought the kitaba inherits from him. If,\\n\\t\\t\\t\\trather than dying, the mukatab cannot pay, the buyer has\\n\\t\\t\\t\\this person. If the mukatab pays his kitaba to the person\\n\\t\\t\\t\\twho bought him and he is freed, his wala' goes to the\\n\\t\\t\\t\\tperson who wrote the kitaba and the person who bought his\\n\\t\\t\\t\\tkitaba does not have any of it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "8",
    "sectionHeading": "The Labour of Mukatabs",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard that Urwa ibn az-Zubayr\\n\\t\\t\\t\\tand Sulayman ibn Yasar when asked whether the sons of a\\n\\t\\t\\t\\tman, who had a kitaba written for himself and his\\n\\t\\t\\t\\tchildren and then died, worked for the kitaba of their\\n\\t\\t\\t\\tfather or were slaves, said, \"They work for the kitaba of\\n\\t\\t\\t\\ttheir father and they have no reduction at all for the\\n\\t\\t\\t\\tdeath of their father.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If they are small and unable to work, one\\n\\t\\t\\t\\tdoes not wait for them to grow up and they are slaves of\\n\\t\\t\\t\\ttheir father's master unless the mukatab has left what\\n\\t\\t\\t\\twill pay their instalments for them until they can work.\\n\\t\\t\\t\\tIf there is enough to pay for them in what he has left,\\n\\t\\t\\t\\tthat is paid for on their behalf and they are left in\\n\\t\\t\\t\\ttheir condition until they can work, and then if they\\n\\t\\t\\t\\tpay, they are free. If they cannot do it, they are\\n\\t\\t\\t\\tslaves.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a mukatab who died and left property\\n\\t\\t\\t\\twhich was not enough to pay his kitaba, and he also left\\n\\t\\t\\t\\ta child with him in his kitaba and an umm walad, and the\\n\\t\\t\\t\\tumm walad wanted to work for them. He said, \"The money is\\n\\t\\t\\t\\tpaid to her if she is trustworthy with it and strong\\n\\t\\t\\t\\tenough to work. If she is not strong enough to work and\\n\\t\\t\\t\\tnot trustworthy with property, she is not given any of it\\n\\t\\t\\t\\tand she and the children of the mukatab revert to being\\n\\t\\t\\t\\tslaves of the master of the mukatab.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If people are written together in one kitaba\\n\\t\\t\\t\\tand there is no kinship between them, and some of them\\n\\t\\t\\t\\tare incapable and others work until they are all set\\n\\t\\t\\t\\tfree, those who worked can claim from those who were\\n\\t\\t\\t\\tunable, the portion of what they paid for them because\\n\\t\\t\\t\\tsome of them assumed the responsibility for others.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "9",
    "sectionHeading": "Freeing a Mukatab if he Pays what he Owes before the End of the Term",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman and others mention that al-Furafisa ibn Umar\\n\\t\\t\\t\\tal-Hanafi had a mukatab who offered to pay him all of his\\n\\t\\t\\t\\tkitaba that he owed. Al-Furafisa refused to accept it and\\n\\t\\t\\t\\tthe mukatab went to Marwan ibn al-Hakam who was the amir\\n\\t\\t\\t\\tof Madina and brought up the matter. Marwan summoned\\n\\t\\t\\t\\tal-Furafisa and told him to accept. He refused. Marwan\\n\\t\\t\\t\\tthen ordered that the payment be taken from the mukatab\\n\\t\\t\\t\\tand placed in the treasury. He said to the mukatab \"Go,\\n\\t\\t\\t\\tyou are free.\" When al-Furafisa saw that, he took the\\n\\t\\t\\t\\tmoney.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done among us when a mukatab pays\\n\\t\\t\\t\\tall the instalments he owes before their term, is that it\\n\\t\\t\\t\\tis permitted to him. The master cannot refuse him that.\\n\\t\\t\\t\\tThat is because payment removes every condition from the\\n\\t\\t\\t\\tmukatab as well as service and travel. The setting free\\n\\t\\t\\t\\tof a man is not complete while he has any remaining\\n\\t\\t\\t\\tslavery, and neither would his inviolability as a free\\n\\t\\t\\t\\tman be complete and his testimony permitted and\\n\\t\\t\\t\\tinheritance obliged and such things in that situation.\\n\\t\\t\\t\\tHis master must not make any stipulation of service on\\n\\t\\t\\t\\thim after he has been set free.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that it was permitted for a mukatab who became\\n\\t\\t\\t\\textremely ill and wanted to pay his master all his\\n\\t\\t\\t\\tinstalments because his heirs who were free would then\\n\\t\\t\\t\\tinherit from him and he had no children with him in his\\n\\t\\t\\t\\tkitaba, to do so, because by that he completed his\\n\\t\\t\\t\\tinviolability as a free man, his testimony was permitted,\\n\\t\\t\\t\\tand his admission of what he owed of debts to people was\\n\\t\\t\\t\\tpermitted. His bequest was permitted as well. His master\\n\\t\\t\\t\\tcould not refuse him that by saying, \"He is escaping from\\n\\t\\t\\t\\tme with his property.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "10",
    "sectionHeading": "The Inheritance of a Mukatab when he is Set Free",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Said ibn\\n\\t\\t\\t\\tal-Musayyab was asked about a mukatab who was shared\\n\\t\\t\\t\\tbetween two men. One of them freed his portion and then\\n\\t\\t\\t\\tthe mukatab died and left a lot of money. Said replied,\\n\\t\\t\\t\\t\"The one who kept his kitaba is paid what remains due to\\n\\t\\t\\t\\thim, and then they divide what is left between them both\\n\\t\\t\\t\\tequally.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a mukatab who fulfils his kitaba and\\n\\t\\t\\t\\tbecomes free dies, he is inherited from by the people who\\n\\t\\t\\t\\twrote his kitaba and their children and paternal\\n\\t\\t\\t\\trelations - whoever is most deserving.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"This is also for whoever is set free when he\\n\\t\\t\\t\\tdies after being set free - his inheritance is for the\\n\\t\\t\\t\\tnearest people to him of children or paternal relations\\n\\t\\t\\t\\twho inherit by means of the wala'.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Brothers, written together in the same\\n\\t\\t\\t\\tkitaba, are in the same position as children to each\\n\\t\\t\\t\\tother when none of them have children written in the\\n\\t\\t\\t\\tkitaba or born in the kitaba. When one of them dies and\\n\\t\\t\\t\\tleaves property, he pays for them all that is against\\n\\t\\t\\t\\tthem of their kitaba and sets them free. The money left\\n\\t\\t\\t\\tover after that goes to his children rather than his\\n\\t\\t\\t\\tbrothers.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "11",
    "sectionHeading": "Conditions Concerning Mukatabs",
    "text": "<p>\\n\\t\\t\\t\\tMalik spoke to me about a man who wrote a kitaba for his\\n\\t\\t\\t\\tslave for gold or silver and stipulated against him in\\n\\t\\t\\t\\this kitaba a journey, service, sacrifice or similar,\\n\\t\\t\\t\\twhich he specified by its name, and then the mukatab was\\n\\t\\t\\t\\table to pay all his instalments before the end of the\\n\\t\\t\\t\\tterm.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"If he pays all his instalments and he is set\\n\\t\\t\\t\\tfree and his inviolability as a free man is complete, but\\n\\t\\t\\t\\the still has this condition to fulfil, the condition is\\n\\t\\t\\t\\texamined, and whatever involves his person in it, like\\n\\t\\t\\t\\tservice or a journey etc., is removed from him and his\\n\\t\\t\\t\\tmaster has nothing in it. Whatever there is of sacrifice,\\n\\t\\t\\t\\tclothing, or anything that he must pay, that is in the\\n\\t\\t\\t\\tposition of dinars and dirhams, and is valued and he pays\\n\\t\\t\\t\\tit along with his instalments, and he is not free until\\n\\t\\t\\t\\the has paid that along with his instalments.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed-on way of doing things\\n\\t\\t\\t\\tamong us about which there is no dispute, is that a\\n\\t\\t\\t\\tmukatab is in the same position as a slave whom his\\n\\t\\t\\t\\tmaster will free after a service of ten years. If the\\n\\t\\t\\t\\tmaster who will free him dies before ten years, what\\n\\t\\t\\t\\tremains of his service goes to his heirs and his wala'\\n\\t\\t\\t\\tgoes to the one who contracted to free him and to his\\n\\t\\t\\t\\tmale children or paternal relations.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who stipulated against his\\n\\t\\t\\t\\tmukatab that he could not travel, marry, or leave his\\n\\t\\t\\t\\tland without his permission, and that if he did so\\n\\t\\t\\t\\twithout his permission it was in his power to cancel the\\n\\t\\t\\t\\tkitaba. He said, \"If the mukatab does any of these things\\n\\t\\t\\t\\tit is not in the man's power to cancel the kitaba. Let\\n\\t\\t\\t\\tthe master put that before the Sultan. The mukatab,\\n\\t\\t\\t\\thowever, should not marry, travel, or leave the land of\\n\\t\\t\\t\\this master without his permission, whether or not he\\n\\t\\t\\t\\tstipulates that. That is because the man may write a\\n\\t\\t\\t\\tkitaba for his slave for 100 dinars and the slave may\\n\\t\\t\\t\\thave 1000 dinars or more than that. He goes off and\\n\\t\\t\\t\\tmarries a woman and pays her bride-price which sweeps\\n\\t\\t\\t\\taway his money and then he cannot pay. He reverts to his\\n\\t\\t\\t\\tmaster as a slave who has no property. Or else he may\\n\\t\\t\\t\\ttravel and his instalments fall due while he is away. He\\n\\t\\t\\t\\tcannot do that and kitaba is not to be based on that.\\n\\t\\t\\t\\tThat is in the hand of his master. If he wishes, he gives\\n\\t\\t\\t\\thim permission in that. If he wishes, he refuses it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "12",
    "sectionHeading": "The Wala' of the Mukatab when he is Set Free",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"When a mukatab sets his own slaves free, it\\n\\t\\t\\t\\tis only permitted for a mukatab to set his own slaves\\n\\t\\t\\t\\tfree with the consent of his master. If his master gives\\n\\t\\t\\t\\this consent and the mukatab sets his slave free, his\\n\\t\\t\\t\\twala' goes to the mukatab . If the mukatab then dies\\n\\t\\t\\t\\tbefore he has been set free himself, the wala' of the\\n\\t\\t\\t\\tfreed slave goes to the master of the mukatab. If the\\n\\t\\t\\t\\tfreed one dies before the mukatab has been set free, the\\n\\t\\t\\t\\tmaster of the mukatab inherits from him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is like that also when a mukatab gives\\n\\t\\t\\t\\this slave a kitaba and his mukatab is set free before he\\n\\t\\t\\t\\tis himself. The wala' goes to the master of the mukatab\\n\\t\\t\\t\\tas long as he is not free. If this one who wrote the\\n\\t\\t\\t\\tkitaba is set free, then the wala' of his mukatab who was\\n\\t\\t\\t\\tfreed before him reverts to him. If the first mukatab\\n\\t\\t\\t\\tdies before he pays, or he cannot pay his kitaba and he\\n\\t\\t\\t\\thas free children, they do not inherit the wala' of their\\n\\t\\t\\t\\tfather's mukatab because the wala' has not been\\n\\t\\t\\t\\testablished for their father and he does not have the\\n\\t\\t\\t\\twala' until he is free.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a mukatab who was shared between two\\n\\t\\t\\t\\tmen and one of them forewent what the mukatab owed him\\n\\t\\t\\t\\tand the other insisted on his due. Then the mukatab died\\n\\t\\t\\t\\tand left property.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The one who did not abandon any of what he\\n\\t\\t\\t\\twas owed, is paid in full. Then the property is divided\\n\\t\\t\\t\\tbetween them both just as if a slave had died because\\n\\t\\t\\t\\twhat the first one did was not setting him free. He only\\n\\t\\t\\t\\tabandoned a debt that was owed to him .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"One clarification of that is that when a man\\n\\t\\t\\t\\tdies and leaves a mukatab and he also leaves male and\\n\\t\\t\\t\\tfemale children and one of the children frees his portion\\n\\t\\t\\t\\tof the mukatab, that does not establish any of the wala'\\n\\t\\t\\t\\tfor him. Had it been a true setting free, the wala' would\\n\\t\\t\\t\\thave been established for whichever men and women freed\\n\\t\\t\\t\\thim.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Another clarification of that is that if one\\n\\t\\t\\t\\tof them freed his portion and then the mukatab could not\\n\\t\\t\\t\\tpay, the value of what was left of the mukatab would be\\n\\t\\t\\t\\taltered because of the one who freed his portion. Had it\\n\\t\\t\\t\\tbeen a true setting-free, his estimated value would have\\n\\t\\t\\t\\tbeen taken from the property of the one who set free\\n\\t\\t\\t\\tuntil he had been set completely free as the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'Whoever frees his share in a slave and has money to\\n\\t\\t\\t\\tcover the full price of the slave, justly evaluated for\\n\\t\\t\\t\\thim, gives his partners their shares. If not, he frees of\\n\\t\\t\\t\\thim what he frees.' \" (See Book 37 hadith 1).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"Another clarification of that is that part of\\n\\t\\t\\t\\tthe sunna of the muslims in which there is no dispute, is\\n\\t\\t\\t\\tthat whoever frees his share of a mukatab, the mukatab is\\n\\t\\t\\t\\tnot set fully free using his property. Had he been truly\\n\\t\\t\\t\\tset free, the wala' would have been his alone rather than\\n\\t\\t\\t\\this partners. Part of what will clarify that also is that\\n\\t\\t\\t\\tpart of the sunna of the muslims is that the wala'\\n\\t\\t\\t\\tbelongs to whoever writes the contract of kitaba. The\\n\\t\\t\\t\\twomen who inherit from the master of the mukatab do not\\n\\t\\t\\t\\thave any of the wala' of the mukatab. If they free any of\\n\\t\\t\\t\\ttheir share, the wala' belongs to the male children of\\n\\t\\t\\t\\tthe master of the mukatab or his male paternal\\n\\t\\t\\t\\trelations.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "13",
    "sectionHeading": "What is Not Permitted in Freeing a Mukatab",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"If people are together in one kitaba, their\\n\\t\\t\\t\\tmaster cannot free one of them without consulting his\\n\\t\\t\\t\\tcompanions who are with him in the kitaba and obtaining\\n\\t\\t\\t\\ttheir consent. If they are young, however, their\\n\\t\\t\\t\\tconsultation means nothing and it is not permitted to\\n\\t\\t\\t\\tthem. That is because a man might work for all the people\\n\\t\\t\\t\\tand he might pay their kitaba for them to complete their\\n\\t\\t\\t\\tfreedom. Their master approaches the one who will pay for\\n\\t\\t\\t\\tthem and their rescue from slavery is through him. He\\n\\t\\t\\t\\tfrees him and so makes those who remain unable to pay. He\\n\\t\\t\\t\\tdoes it intending benefit and increase for himself. It is\\n\\t\\t\\t\\tnot permitted for him to do that to those of them who\\n\\t\\t\\t\\tremain. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, 'There must be no harm nor return\\n\\t\\t\\t\\tof harm.' This is the most severe harm.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about slaves who wrote a kitaba together that\\n\\t\\t\\t\\tit was permitted for their master to free the old and\\n\\t\\t\\t\\texhausted of them and the young when neither of them\\n\\t\\t\\t\\tcould pay anything, and there was no help nor strength to\\n\\t\\t\\t\\tbe had from any of them in their kitaba.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "14",
    "sectionHeading": "What is Not Permitted in Freeing a Mukatab",
    "text": "<p>\\n\\t\\t\\t\\tMalik said about a man who had his slave in a kitaba and\\n\\t\\t\\t\\tthen the mukatab died and left his umm walad, and there\\n\\t\\t\\t\\tremained for him some of his kitaba to pay and he left\\n\\t\\t\\t\\twhat would pay it, \"The umm walad is a slave since the\\n\\t\\t\\t\\tmukatab was not freed until he died and he did not leave\\n\\t\\t\\t\\tchildren that were set free by his paying what remained,\\n\\t\\t\\t\\tso that the umm walad of their father was freed by their\\n\\t\\t\\t\\tbeing set free.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a mukatab who set free a slave of his or\\n\\t\\t\\t\\tgave sadaqa with some of his property and his master did\\n\\t\\t\\t\\tnot know that until he had set the mukatab free, \"That\\n\\t\\t\\t\\thas been performed by him and the master does not rescind\\n\\t\\t\\t\\tit. If the master of the mukatab knows before he sets the\\n\\t\\t\\t\\tmukatab free, he can reject that and not permit it. If\\n\\t\\t\\t\\tthe mukatab is then freed and it becomes in his power to\\n\\t\\t\\t\\tdo so, he does not have to free the slave, nor give the\\n\\t\\t\\t\\tsadaqa unless he does it voluntarily from himself.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "39",
    "hadithNumber": "15",
    "sectionHeading": "Bequests involving Mukatabs",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, The best of what I have heard about a mukatab\\n\\t\\t\\t\\twhose master frees him at death, is that the mukatab is\\n\\t\\t\\t\\tvalued according to what he would fetch if he were sold.\\n\\t\\t\\t\\tIf that value is less than what remains against him of\\n\\t\\t\\t\\this kitaba, his freedom is taken from the third that the\\n\\t\\t\\t\\tdeceased can bequeath. One does not look at the number of\\n\\t\\t\\t\\tdirhams which remain against him in his kitaba. That is\\n\\t\\t\\t\\tbecause had he been killed, his killer would not be in\\n\\t\\t\\t\\tdebt for other than his value on the day he killed him.\\n\\t\\t\\t\\tHad he been injured, the one who injured him would not be\\n\\t\\t\\t\\tliable for other than the blood-money of the injury on\\n\\t\\t\\t\\tthe day of his injury. One does not look at how much he\\n\\t\\t\\t\\thas paid of dinars and dirhams of the contract he has\\n\\t\\t\\t\\twritten because he is a slave as long as any of his\\n\\t\\t\\t\\tkitaba remains. If what remains in his kitaba is less\\n\\t\\t\\t\\tthan his value, only whatever of his kitaba remains owing\\n\\t\\t\\t\\tfrom him is taken into account in the third of the\\n\\t\\t\\t\\tproperty of the deceased. That is because the deceased\\n\\t\\t\\t\\tleft him what remains of his kitaba and so it becomes a\\n\\t\\t\\t\\tbequest which the deceased made.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The illustration of that is that if the\\n\\t\\t\\t\\tprice of the mukatab is one thousand dirhams, and only\\n\\t\\t\\t\\tone hundred dirhams remain of his kitaba, his master\\n\\t\\t\\t\\tleaves him the one hundred dirhams which complete it for\\n\\t\\t\\t\\thim. It is taken into account in the third of his master\\n\\t\\t\\t\\tand by it he becomes free.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man wrote his slave a kitaba at his\\n\\t\\t\\t\\tdeath, the value of the slave was estimated. If there was\\n\\t\\t\\t\\tenough to cover the price of the slave in one third of\\n\\t\\t\\t\\this property, that was permitted for him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The illustration of that is that the price\\n\\t\\t\\t\\tof the slave is one thousand dinars. His master writes\\n\\t\\t\\t\\thim a kitaba for two hundred dinars at his death. The\\n\\t\\t\\t\\tthird of the property of his master is one thousand\\n\\t\\t\\t\\tdinars, so that is permitted for him. It is only a\\n\\t\\t\\t\\tbequest which he makes from one third of his property. If\\n\\t\\t\\t\\tthe master has left bequests to people, and there is no\\n\\t\\t\\t\\tsurplus in the third after the value of the mukatab, one\\n\\t\\t\\t\\tbegins with the mukatab because the kitaba is setting\\n\\t\\t\\t\\tfree, and setting free has priority over bequests. When\\n\\t\\t\\t\\tthose bequests are paid from the kitaba of the mukatab,\\n\\t\\t\\t\\tthey follow it. The heirs of the testator have a choice.\\n\\t\\t\\t\\tIf they want to give the people with bequests all their\\n\\t\\t\\t\\tbequests and the kitaba of the mukatab is theirs, they\\n\\t\\t\\t\\thave that. If they refuse and hand over the mukatab and\\n\\t\\t\\t\\twhat he owes to the people with bequests they can do\\n\\t\\t\\t\\tthat, because the third commences with the mukatab and\\n\\t\\t\\t\\tbecause all the bequests which he makes are as one.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIf the heirs then say, \"What our fellow bequeathed was\\n\\t\\t\\t\\tmore than one third of his property and he has taken what\\n\\t\\t\\t\\twas not his,\" Malik said, \"His heirs choose. It is said\\n\\t\\t\\t\\tto them, 'Your companion has made the bequests you know\\n\\t\\t\\t\\tabout and if you would like to give them to those who are\\n\\t\\t\\t\\tto receive them according to the deceased's bequests,\\n\\t\\t\\t\\tthen do so. If not, hand over to the people with bequests\\n\\t\\t\\t\\tone third of the total property of the deceased.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik continued, \"If the heirs surrender the mukatab to\\n\\t\\t\\t\\tthe people with bequests, the people with bequests have\\n\\t\\t\\t\\twhat he owes of his kitaba. If the mukatab pays what he\\n\\t\\t\\t\\towes of his kitaba, they take that in their bequests\\n\\t\\t\\t\\taccording to their shares. If the mukatab cannot pay, he\\n\\t\\t\\t\\tis a slave of the people with bequests and does not\\n\\t\\t\\t\\treturn to the heirs because they gave him up when they\\n\\t\\t\\t\\tmade their choice, and because when he was surrendered to\\n\\t\\t\\t\\tthe people with bequests, they were liable. If he died,\\n\\t\\t\\t\\tthey would not have anything against the heirs. If the\\n\\t\\t\\t\\tmukatab dies before he pays his kitaba and he leaves\\n\\t\\t\\t\\tproperty which is more than what he owes, his property\\n\\t\\t\\t\\tgoes to the people with bequests. If the mukatab pays\\n\\t\\t\\t\\twhat he owes, he is free and his wala' returns to the\\n\\t\\t\\t\\tpaternal relations of the one who wrote the kitaba for\\n\\t\\t\\t\\thim.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a mukatab who owed his master ten\\n\\t\\t\\t\\tthousand dirhams in his kitaba, and when he died he\\n\\t\\t\\t\\tremitted one thousand dirhams from it. He said, \"The\\n\\t\\t\\t\\tmukatab is valued and his value is taken into\\n\\t\\t\\t\\tconsideration. If his value is one thousand dirhams and\\n\\t\\t\\t\\tthe reduction is a tenth of the kitaba, that portion of\\n\\t\\t\\t\\tthe slave's price is one hundred dirhams. It is a tenth\\n\\t\\t\\t\\tof the price. A tenth of the kitaba is therefore reduced\\n\\t\\t\\t\\tfor him. That is converted to a tenth of the price in\\n\\t\\t\\t\\tcash. That is as if he had had all of what he owed\\n\\t\\t\\t\\treduced for him. Had he done that, only the value of the\\n\\t\\t\\t\\tslave - one thousand dirhams - would have been taken into\\n\\t\\t\\t\\taccount in the third of the property of the deceased. If\\n\\t\\t\\t\\tthat which he had remitted is half of the kitaba, half\\n\\t\\t\\t\\tthe price is taken into account in the third of the\\n\\t\\t\\t\\tproperty of the deceased. If it is more or less than\\n\\t\\t\\t\\tthat, it is according to this reckoning.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a man reduces the kitaba of his mukatab\\n\\t\\t\\t\\tby one thousand dirhams at his death from a kitaba of ten\\n\\t\\t\\t\\tthousand dirhams, and he does not stipulate whether it is\\n\\t\\t\\t\\tfrom the beginning or the end of his kitaba, each\\n\\t\\t\\t\\tinstalment is reduced for him by one tenth.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a man remits one thousand dirhams from\\n\\t\\t\\t\\this mukatab at his death from the beginning or end of his\\n\\t\\t\\t\\tkitaba, and the original basis of the kitaba is three\\n\\t\\t\\t\\tthousand dirhams, the mukatab's cash value is estimated.\\n\\t\\t\\t\\tThen that value is divided. That thousand which is from\\n\\t\\t\\t\\tthe beginning of the kitaba is converted into its portion\\n\\t\\t\\t\\tof the price according to its proximity to the term and\\n\\t\\t\\t\\tits precedence and then the thousand which follows the\\n\\t\\t\\t\\tfirst thousand is according to its precedence also until\\n\\t\\t\\t\\tit comes to its end, and every thousand is paid according\\n\\t\\t\\t\\tto its place in advancing and deferring the term because\\n\\t\\t\\t\\twhat is deferred of that is less in respect of its price.\\n\\t\\t\\t\\tThen it is placed in the third of the deceased according\\n\\t\\t\\t\\tto whatever of the price befalls that thousand according\\n\\t\\t\\t\\tto the difference in preference of that, whether it is\\n\\t\\t\\t\\tmore or less, then it is according to this reckoning.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who willed a man a fourth of a\\n\\t\\t\\t\\tmukatab or freed a fourth, and then the man died and the\\n\\t\\t\\t\\tmukatab died and left a lot of property, more than he\\n\\t\\t\\t\\towed. He said, \"The heirs of the first master and the one\\n\\t\\t\\t\\twho was willed a fourth of the mukatab are given what\\n\\t\\t\\t\\tthey are still owed by the mukatab. Then they divide what\\n\\t\\t\\t\\tis left over, and the one willed a fourth has a third of\\n\\t\\t\\t\\twhat is left after the kitaba is paid. The heirs of his\\n\\t\\t\\t\\tmaster gets two-thirds. That is because the mukatab is a\\n\\t\\t\\t\\tslave as long as any of his kitaba remains to be paid. He\\n\\t\\t\\t\\tis inherited from by the possession of his person.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a mukatab whose master freed him at\\n\\t\\t\\t\\tdeath, \"If the third of the deceased will not cover him,\\n\\t\\t\\t\\the is freed from it according to what the third will\\n\\t\\t\\t\\tcover and his kitaba is decreased according to that. If\\n\\t\\t\\t\\tthe mukatab owed five thousand dirhams and his value is\\n\\t\\t\\t\\ttwo thousand dirhams cash, and the third of the deceased\\n\\t\\t\\t\\tis one thousand dirhams, half of him is freed and half of\\n\\t\\t\\t\\tthe kitaba has been reduced for him.\" Malik said about a\\n\\t\\t\\t\\tman who said in his will, \"My slave so-and-so is free and\\n\\t\\t\\t\\twrite a kitaba for so-and-so\", that the setting free had\\n\\t\\t\\t\\tpriority over the kitaba.\\n\\t\\t\\t</p>"
  }
]
