[
  {
    "SurahNumber": "84",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "I.e., at the coming of the Last Hour and the beginning of\\n\\t\\t\\t\\ta new reality, both in fact and in man's perception."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "See {20:105-107}."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "I.e., loses all its reality."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "6",
    "NoteID": "4",
    "Body": "An allusion to the fact that in man's earthly life -\\n\\t\\t\\t\\tirrespective of whether one is consciously aware of it or\\n\\t\\t\\t\\tnot - sorrow, pain, drudgery and worry by far outweigh\\n\\t\\t\\t\\tthe rare moments of true happiness and satisfaction.\\n\\t\\t\\t\\tThus, the human condition is described as \"painful\\n\\t\\t\\t\\ttoiling towards the Sustainer\" - i.e., towards the moment\\n\\t\\t\\t\\twhen one meets Him on resurrection."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "I.e., whose behaviour in life characterises him as\\n\\t\\t\\t\\t\"righteous\": see note [12] on  69:19 ."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "9",
    "NoteID": "6",
    "Body": "Lit., \"his people\" - i.e., those who, like him, were\\n\\t\\t\\t\\trighteous in life."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "10",
    "NoteID": "7",
    "Body": "At first glance, this seems to contrast with  69:25 \\n\\t\\t\\t\\twhere it is stated that the record of the unrighteous\\n\\t\\t\\t\\t\"shall be placed in his left hand\". In reality, however,\\n\\t\\t\\t\\tthe present formulation alludes to the sinner's horror at\\n\\t\\t\\t\\this record, and his wish that he had never been shown it\\n\\t\\t\\t\\t({69:25-26}): in other words, his not wanting to see it\\n\\t\\t\\t\\tis symbolized by its appearance \"behind his back\"."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "13",
    "NoteID": "8",
    "Body": "Lit., \"his people\" - i.e., people of the same sinful\\n\\t\\t\\t\\tinclinations. (Cf. note [14] on  75:33 .)"
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "18",
    "NoteID": "9",
    "Body": "Thus God \"calls to witness\" the fact that nothing in His\\n\\t\\t\\t\\tcreation is ever at a standstill, since everything moves\\n\\t\\t\\t\\tunceasingly from one state of being into another, at\\n\\t\\t\\t\\tevery moment changing its aspect and its condition: a\\n\\t\\t\\t\\tphenomenon aptly described by the Greek philosopher\\n\\t\\t\\t\\tHeraclitus by the phrase panta rhei (\"everything is in\\n\\t\\t\\t\\tflux\")."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "19",
    "NoteID": "10",
    "Body": "Or: \"from one state to another state\" (Zamakhshari):\\n\\t\\t\\t\\ti.e., in an unceasing progression - conception, birth,\\n\\t\\t\\t\\tgrowth, decline, death and, finally, resurrection."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "20",
    "NoteID": "11",
    "Body": "Since the inexorable movement of all that exists from\\n\\t\\t\\t\\tstage to stage or from one condition into another\\n\\t\\t\\t\\tcorresponds to a fundamental law evident in all creation,\\n\\t\\t\\t\\tit is unreasonable to assume that man alone should be an\\n\\t\\t\\t\\texception, and that his onward movement should cease at\\n\\t\\t\\t\\tthe moment of his bodily death, not to be followed by a\\n\\t\\t\\t\\tchange-over into another state of being."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "21",
    "NoteID": "12",
    "Body": "I.e., seeing how consistently it stresses the divine law\\n\\t\\t\\t\\tof unceasing change and progression in all that exists."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "23",
    "NoteID": "13",
    "Body": "Namely, their unwillingness to admit their responsibility\\n\\t\\t\\t\\tto a Supreme Being."
  }
]
