[
  {
    "SurahNumber": "32",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Cf. note [61] on  10:38 ."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "See note [43] on  7:54 ."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "I.e., the Day of Judgment will seem to be endless to\\n\\t\\t\\t\\tthose who are judged. In the ancient Arabic idiom, a day\\n\\t\\t\\t\\tthat is trying or painful is described as \"long\", just as\\n\\t\\t\\t\\ta happy day is spoken of as \"short\" (Maraghi XXI, 105)."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "See surah {6}, note [65]."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "7",
    "NoteID": "6",
    "Body": "I.e., He fashions every detail of His creation in\\n\\t\\t\\t\\taccordance with the functions intended for it,\\n\\t\\t\\t\\tirrespective of whether those functions can be understood\\n\\t\\t\\t\\tby us or are beyond the reach of our perception. In the\\n\\t\\t\\t\\ttext, the passage comprising verses {7-9} is in the past\\n\\t\\t\\t\\ttense; but since it relates to a continuous act of\\n\\t\\t\\t\\tcreation, it signifies the present and the future as well\\n\\t\\t\\t\\tas the past, and may, therefore, be suitably rendered in\\n\\t\\t\\t\\tthe present tense."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "Cf. note [4] on  23:12 . In view of the next verse, this\\n\\t\\t\\t\\t\"beginning\" of man's creation seems to allude to the\\n\\t\\t\\t\\tbasic composition of the human body as such, as well as\\n\\t\\t\\t\\tto each individual's pre-natal existence in the separate\\n\\t\\t\\t\\tbodies of his parents."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "8",
    "NoteID": "8",
    "Body": "Lit., \"He caused [i.e., as pointed out in note [6] above,\\n\\t\\t\\t\\t\"He causes\"] his procreation [or \"his begetting\"] to be\\n\\t\\t\\t\\tout of...\", etc."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "9",
    "NoteID": "9",
    "Body": "As in  15:29  and  38:72 , God's \"breathing of His spirit\\n\\t\\t\\t\\tinto man\" is a metaphor for the divine gift of life and\\n\\t\\t\\t\\tconsciousness, or of a \"soul\" (which, as pointed out in\\n\\t\\t\\t\\tsurah {4}, note [181], is one of the meanings of the term\\n\\t\\t\\t\\truh). Consequently, \"the soul of every human being is of\\n\\t\\t\\t\\tthe spirit of God\" (Razi). Regarding the verb sawwahu -\\n\\t\\t\\t\\trendered by me as \"He forms him in accordance with what\\n\\t\\t\\t\\the is meant to be\" - see note [1] on  87:2  and note [5]\\n\\t\\t\\t\\ton  91:7 ."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "9",
    "NoteID": "10",
    "Body": "Lit., \"hearts\" (af'idah), which in classical Arabic is a\\n\\t\\t\\t\\tmetonym for both \"feelings\" and minds\"; hence my\\n\\t\\t\\t\\tcomposite rendering of this term."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "10",
    "NoteID": "11",
    "Body": "Sc., \"and thus, by implication, they deny His existence\".\\n\\t\\t\\t\\t(Cf. notes [11] and [12] on  13:5 .)"
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "13",
    "NoteID": "12",
    "Body": "Lit., \"We could indeed have given unto every human being\\n\\t\\t\\t\\t(nafs) his guidance\", i.e., forcibly: but since this\\n\\t\\t\\t\\twould have deprived man of his ability to choose between\\n\\t\\t\\t\\tright and wrong - and, thus, of all moral responsibility\\n\\t\\t\\t\\t- God does not \"impose\" His guidance upon anyone (cf.\\n\\t\\t\\t\\t 26:4  and the corresponding note)."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "13",
    "NoteID": "13",
    "Body": "See  7:18  as well as the last paragraph of  11:119 . As\\n\\t\\t\\t\\tregards the \"invisible beings\" (jinn), see Appendix III."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "16",
    "NoteID": "14",
    "Body": "Lit., \"whose sides [i.e., bodies] restlessly rise\"."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "17",
    "NoteID": "15",
    "Body": "Lit., \"what is kept hidden for them [by way] of a joy of\\n\\t\\t\\t\\tthe eyes\", i.e., of blissful delights, irrespective of\\n\\t\\t\\t\\twhether seen, heard or felt. The expression \"what is kept\\n\\t\\t\\t\\thidden for them\" clearly alludes to the unknowable - and,\\n\\t\\t\\t\\ttherefore, only allegorically describable - quality of\\n\\t\\t\\t\\tlife in the hereafter. The impossibility of man's really\\n\\t\\t\\t\\t\"imagining\" paradise has been summed up by the Prophet in\\n\\t\\t\\t\\tthe well-authenticated hadith: \"God says: 'I have readied\\n\\t\\t\\t\\tfor My righteous servants what no eye has ever seen, and\\n\\t\\t\\t\\tno ear has ever heard, and no heart of man has ever\\n\\t\\t\\t\\tconceived'\" (Bukhari and Muslim, on the authority of Abu\\n\\t\\t\\t\\tHurayrah; also Tirmidhi). This hadith has always been\\n\\t\\t\\t\\tregarded by the Companions as the Prophet's own comment\\n\\t\\t\\t\\ton the above verse (cf. Fath al-Bari VIII, 418 f.)."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "21",
    "NoteID": "16",
    "Body": "Lit., \"nearer\", i.e., in this world: for an explanation,\\n\\t\\t\\t\\tsee note [27] on  52:47 ."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "21",
    "NoteID": "17",
    "Body": "Lit., \"so that they might return [to righteousness]\"."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "23",
    "NoteID": "18",
    "Body": "With this passage the discourse returns to the theme\\n\\t\\t\\t\\tenunciated at the beginning of this surah - namely, the\\n\\t\\t\\t\\tdivine origin of the revelation granted to Muhammad,\\n\\t\\t\\t\\twhich, as the present passage points out, proceeds from\\n\\t\\t\\t\\tthe same source as that granted to Moses (the last of the\\n\\t\\t\\t\\tgreat apostles of God accepted as such by all the three\\n\\t\\t\\t\\tmonotheistic religions, Judaism, Christianity and Islam).\\n\\t\\t\\t\\tFurthermore, the identity of the fundamental truths in\\n\\t\\t\\t\\tall divine revelations, stressed in the above verse,\\n\\t\\t\\t\\timplies an identity of the moral demands made of the\\n\\t\\t\\t\\tfollowers of those revelations irrespective of period,\\n\\t\\t\\t\\trace or social environment."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "24",
    "NoteID": "19",
    "Body": "I.e., in accordance with the divine ordinances enunciated\\n\\t\\t\\t\\tin and for their time in the Torah: an allusion to the\\n\\t\\t\\t\\tdecline of faith, frequently mentioned in the Qur'an,\\n\\t\\t\\t\\tamong the children of Israel of later times, and the\\n\\t\\t\\t\\ttendency among many of their leaders and learned men to\\n\\t\\t\\t\\tcorrupt the text of the Torah and, thus, to \"overlay the\\n\\t\\t\\t\\ttruth with falsehood\" (see, e.g.,  2:42 , {75}, {79}, and\\n\\t\\t\\t\\tthe corresponding notes)."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "24",
    "NoteID": "20",
    "Body": "This interpolation reflects Zamakhshari's commentary on\\n\\t\\t\\t\\tthe above passage, to the effect that the Qur'an is\\n\\t\\t\\t\\tdestined to provide guidance and light so long as the\\n\\t\\t\\t\\tcommunity's religious leaders are patient in adversity\\n\\t\\t\\t\\tand steadfast in their faith: an interpretation which\\n\\t\\t\\t\\timplies that the Qur'an will cease to be of benefit to\\n\\t\\t\\t\\tpeople who have lost their moral virtues and their faith."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "25",
    "NoteID": "21",
    "Body": "Lit., \"between them\"."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "25",
    "NoteID": "22",
    "Body": "See surah {2}, note [94]; also {22:67-69}. In the present\\n\\t\\t\\t\\tinstance, this difference of opinion relates to belief in\\n\\t\\t\\t\\tresurrection, on the one hand, and its denial, on the\\n\\t\\t\\t\\tother."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "26",
    "NoteID": "23",
    "Body": "For the wider meaning of the term qarn (lit.,\\n\\t\\t\\t\\t\"generation\"), see note [111] on  20:128 ."
  },
  {
    "SurahNumber": "32",
    "AyahNumber": "28",
    "NoteID": "24",
    "Body": "A reference to the statement in verse {25}."
  }
]
