[
  {
    "SurahNumber": "12",
    "AyahNumber": "1",
    "Text": "Alif L'am Ra. These are the verses of the Book that make things\\n\\t\\t\\tclear."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "2",
    "Text": "We have revealed this Qur'an in the Arabic language so that you\\n\\t\\t\\t(Arabs) may understand."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "3",
    "Text": "We relate to you the best of stories through this Qur'an by Our\\n\\t\\t\\trevelation to you (O Muhammad), though before this you were one\\n\\t\\t\\tof those who did not know."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "4",
    "Text": "This is the narrative of that time, when Yusuf (Joseph) said to\\n\\t\\t\\this father: \"O my father! In a dream I saw eleven stars, the sun\\n\\t\\t\\tand the moon - I saw them prostrate themselves before me!\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "5",
    "Text": "He replied: \"My dear little son! Do not say any thing about this\\n\\t\\t\\tdream to your brothers, lest they plot an evil scheme against\\n\\t\\t\\tyou; for Shaitan is an open enemy to human beings."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "6",
    "Text": "It will happen, as you have seen in your dream, that you will be\\n\\t\\t\\tchosen by your Rabb for His work. He will teach you how to\\n\\t\\t\\tinterpret visions, and will perfect His favor upon you and the\\n\\t\\t\\tchildren of Ya'qoob (Jacob), as He perfected it upon your\\n\\t\\t\\tforefathers Ibrahim (Abraham) and Ishaq (Isaac) before you.\\n\\t\\t\\tSurely your Rabb is Knowledgeable, Wise."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "7",
    "Text": "Indeed in the story of Yusuf and his brothers, there are signs\\n\\t\\t\\tfor inquirers."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "8",
    "Text": "This is how the story begins: his step brothers held a meeting\\n\\t\\t\\tand said to one another: \"This Yusuf and his brother (Benjamin)\\n\\t\\t\\tare loved more by our father than us, even though we are a group\\n\\t\\t\\tof ten and can help him more than them. In fact, our father is\\n\\t\\t\\tclearly mistaken."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "9",
    "Text": "Let us kill Yusuf or throw him out to some far-off land so that\\n\\t\\t\\tthe attention of our father turns exclusively towards us, after\\n\\t\\t\\tthat, we may again become righteous people!\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "10",
    "Text": "At this one of them said: \"Do not kill Yusuf, but if you must,\\n\\t\\t\\tthrow him into some dark well, so that he may be picked up by\\n\\t\\t\\tsome passing by caravan.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "11",
    "Text": "After this meeting, they asked their father: \"O our father! Why\\n\\t\\t\\tis it that you do not trust us with Yusuf, though we are his\\n\\t\\t\\tsincere well-wishers?"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "12",
    "Text": "Send him with us tomorrow, that he may play and enjoy himself. We\\n\\t\\t\\tshall take good care of him.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "13",
    "Text": "Their father said: \"I will be worried if you take him away, for I\\n\\t\\t\\tfear lest a wolf should eat him up while you are off your guard\\n\\t\\t\\t.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "14",
    "Text": "They said: \"If a wolf could eat him despite our number, then\\n\\t\\t\\tsurely we would be worthless people!\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "15",
    "Text": "When after such persistence they were able to take him away, they\\n\\t\\t\\tresolved to throw him into a dark well. We revealed this (to\\n\\t\\t\\tYusuf) : \"A time will come when you will admonish them about this\\n\\t\\t\\tact of theirs, now they do not perceive its consequences.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "16",
    "Text": "At nightfall they return to their father, weeping."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "17",
    "Text": "They said: \"Father! We went off to compete in racing with one\\n\\t\\t\\tanother, and left Yusuf by our belongings, and a wolf ate him !\\n\\t\\t\\tBut you will not believe us even though we are telling the\\n\\t\\t\\ttruth.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "18",
    "Text": "As proof they brought his shirt stained with false blood. \"No!\"\\n\\t\\t\\tHe cried, \"Your souls have tempted you to evil. I need good\\n\\t\\t\\tpatience! Allah Alone can help me bear the loss you are speaking\\n\\t\\t\\tof.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "19",
    "Text": "On the other side, a caravan passed by, and sent a water carrier\\n\\t\\t\\twho let down his bucket into the well. Seeing Yusuf in it, he\\n\\t\\t\\tshouted with joy: \"Good news! I found a young boy.\" They\\n\\t\\t\\tconcealed him like trade merchandise. But Allah knew what they\\n\\t\\t\\tdid."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "20",
    "Text": "They (brought him to Egypt and) sold him for a petty price, a few\\n\\t\\t\\tdirhams (silver coins), they had such a low estimation of him."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "21",
    "Text": "The Egyptian who bought Yusuf said to his wife: \"Be kind to him.\\n\\t\\t\\tHe may prove useful to us, or we may adopt him as a son.\" Thus We\\n\\t\\t\\testablished Yusuf in the land and arranged to teach him the\\n\\t\\t\\tunderstanding of affairs. Allah has full power over His affairs;\\n\\t\\t\\tthough most people do not know."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "22",
    "Text": "When he reached maturity, We bestowed on him wisdom and\\n\\t\\t\\tknowledge. Thus do We reward the righteous."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "23",
    "Text": "Now, the lady of the house (his master's wife) attempted to\\n\\t\\t\\tseduce him. She bolted the doors and said: \"Come!\" He replied:\\n\\t\\t\\t\"May Allah protect me from this! My lord has provided me with\\n\\t\\t\\tgood residence. Should I betray his trust? Such wrongdoers shall\\n\\t\\t\\tnot prosper.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "24",
    "Text": "She advanced toward him, and he would have advanced towards her\\n\\t\\t\\thad he not seen a sign from his Rabb. Thus did We shielded him\\n\\t\\t\\tfrom indecency and immodesty, for he was one of Our chosen, a\\n\\t\\t\\tsincere devotee."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "25",
    "Text": "They both rushed to the door. In order to stop him she caught his\\n\\t\\t\\tshirt, and as a result she ripped his shirt from behind. At the\\n\\t\\t\\tdoor they met her husband. Seeing him she cried: \"What punishment\\n\\t\\t\\tdoes someone who intended evil against your wife deserve except\\n\\t\\t\\timprisonment or a painful chastisement?\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "26",
    "Text": "Yusuf said: \"It was she who attempted to seduce me.\" At this -\\n\\t\\t\\tone accusing the other - one member of her own family bore\\n\\t\\t\\twitness saying: \"If his shirt is ripped from the front, then she\\n\\t\\t\\tis speaking the truth and he is lying."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "27",
    "Text": "But if it is ripped from behind, then he is speaking the truth\\n\\t\\t\\tand she is lying.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "28",
    "Text": "So when he (her husband) saw that Yusuf's shirt was ripped from\\n\\t\\t\\tbehind, he said to her: \"It is one of the tricks of you women!\\n\\t\\t\\tYour trick was mighty indeed!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "29",
    "Text": "O Yusuf, say no more about this, and you (O my wife) seek\\n\\t\\t\\tforgiveness for your sins, for you were indeed the wrongdoer.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "30",
    "Text": "The women of the city began to talk about this incident, saying:\\n\\t\\t\\t\"The wife of Al-Aziz has seduced her young slave, for she has\\n\\t\\t\\tfallen madly in love with him. In fact, we see her in manifest\\n\\t\\t\\terror.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "31",
    "Text": "When she heard about these remarks, she invited them and prepared\\n\\t\\t\\tfor them a banquet, and gave each of them a knife. When they were\\n\\t\\t\\tengaged in cutting fruit, she asked Yusuf to come out before\\n\\t\\t\\tthem. When they saw him, they were so amazed that they cut their\\n\\t\\t\\thands and exclaimed spontaneously: \"Good Lord! He is no human\\n\\t\\t\\tbeing; he is but a noble angel.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "32",
    "Text": "She said: \"Well, this is he about whom you blamed me. No doubt I\\n\\t\\t\\tseduced him, but he escaped. If he doesn't do what I say, he will\\n\\t\\t\\tcertainly be thrown into prison and be disgraced.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "33",
    "Text": "Yusuf said: \"O my Rabb! I would rather go to prison than that to\\n\\t\\t\\twhich they invite me; and unless You ward off their cunning snare\\n\\t\\t\\tfrom me, I may, in my youthful folly, feel inclined towards them\\n\\t\\t\\tand become one of the ignorant.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "34",
    "Text": "Thereupon his Rabb granted his prayer and warded off their\\n\\t\\t\\tcunning snare from him; surely He hears all and knows all."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "35",
    "Text": "Still, even after all the evidence they had seen (of his\\n\\t\\t\\tinnocence and the guilt of their women), they thought it proper\\n\\t\\t\\tto send him to prison for a while."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "36",
    "Text": "Two young men also entered the prison along with him. One day one\\n\\t\\t\\tof them said: \"I saw in a dream that I was pressing wine.\" The\\n\\t\\t\\tother said: \"I saw in a dream that I was carrying bread on my\\n\\t\\t\\thead, of which birds were eating.\" Tell us the interpretation of\\n\\t\\t\\tthese dreams, for we see that you are a man of virtue."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "37",
    "Text": "Yusuf replied: \"I will, with Allah's permission, tell you the\\n\\t\\t\\tinterpretation of these dreams before you are served the food you\\n\\t\\t\\teat, this is part of the knowledge which my Rabb has taught me.\\n\\t\\t\\tIn fact, I have forsaken the faith of those people who do not\\n\\t\\t\\tbelieve in Allah and even deny the hereafter."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "38",
    "Text": "I follow the faith of my forefathers Ibrahim (Abraham), Ishaq\\n\\t\\t\\t(Isaac) and Ya'qoob (Jacob). It is not fitting that we attribute\\n\\t\\t\\tany partners with Allah. It is the grace of Allah on us and on\\n\\t\\t\\tmankind (that He has not made us the servants of anyone else\\n\\t\\t\\tother than Himself), yet most of the people are not grateful."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "39",
    "Text": "O my fellow inmates! Tell me what is better; many different lords\\n\\t\\t\\tor one Allah, the Irresistible?"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "40",
    "Text": "Those you serve besides Him are nothing but mere names which you\\n\\t\\t\\tand your forefathers have invented, for which Allah has revealed\\n\\t\\t\\tno sanction. The Command belongs to none but Allah, Who has\\n\\t\\t\\tcommanded that you worship none but Him. That is the true faith,\\n\\t\\t\\tyet most of the people do not know."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "41",
    "Text": "O my fellow inmates! (Here is the interpretation of your dreams),\\n\\t\\t\\tone of you will be released and serve wine to your lord (the king\\n\\t\\t\\tof Egypt); and the other will be crucified and the birds will eat\\n\\t\\t\\tfrom his head. That's how your cases will be decided concerning\\n\\t\\t\\twhich you inquired (that is the answer to your question).\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "42",
    "Text": "Then, to the one who he thought would be released, he said:\\n\\t\\t\\t\"Mention me to your lord.\" But Shaitan made him forget to mention\\n\\t\\t\\t(Yusuf) to his lord, so he remained in the prison a few more\\n\\t\\t\\tyears."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "43",
    "Text": "One day the king of Egypt said: \"I saw seven fat cows in my dream\\n\\t\\t\\twhich were eaten up by seven lean cows, likewise I saw seven\\n\\t\\t\\tgreen ears of corn and seven others that were dried up. O chiefs!\\n\\t\\t\\tTell me the meaning of my dream if you can interpret the dreams.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "44",
    "Text": "They replied: \"Confused nightmares! We are not skilled in the\\n\\t\\t\\tinterpretation of dreams.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "45",
    "Text": "Thereupon one of the two inmates who was released remembered\\n\\t\\t\\tYusuf after all that time, and he said: \"I will tell you its\\n\\t\\t\\tinterpretation; just send me to Yusuf in the prison.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "46",
    "Text": "He came to Yusuf in the prison and said: \"O Yusuf the truthful\\n\\t\\t\\tone! Tell us the meaning of the dream of seven fat cows which are\\n\\t\\t\\teaten up by seven lean ones and of seven green ears of corn and\\n\\t\\t\\tseven others dried up: so that I may return to the people and let\\n\\t\\t\\tthem know the meaning of this dream.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "47",
    "Text": "He replied: \"You will cultivate for seven consecutive years.\\n\\t\\t\\tDuring this time you should leave the corn you reap in the ear,\\n\\t\\t\\texcept what may be sufficient for your food."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "48",
    "Text": "Then, after that period, there will come upon you seven hard\\n\\t\\t\\tyears which will eat away all that you had stored except a little\\n\\t\\t\\twhich you may have specifically set aside."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "49",
    "Text": "After that period will come a year of abundant rain, in which the\\n\\t\\t\\tpeople will squeeze the juice.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "50",
    "Text": "The king said: \"Bring this man to me.\" When the messenger came to\\n\\t\\t\\tYusuf, he said: \"Go back to your lord and ask him about the case\\n\\t\\t\\tof those women who cut their hands. Indeed my Rabb has full\\n\\t\\t\\tknowledge of their snare.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "51",
    "Text": "The king questioned those women, saying: \"What do you say about\\n\\t\\t\\tthe incident when you attempted to seduce Yusuf?\" They replied:\\n\\t\\t\\t\"God forbid! We know of no evil on his part.\" The `Aziz's wife\\n\\t\\t\\tsaid: \"Now that the truth has come to light, it was I who\\n\\t\\t\\tattempted to seduce him. In fact he is absolutely truthful.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "52",
    "Text": "Yusuf said, \"By this inquiry I meant to let him (Al-Aziz) know\\n\\t\\t\\tthat I did not betray him in his absence, and that Allah does not\\n\\t\\t\\tlet the snare of the treacherous succeed.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "53",
    "Text": "\"Not that I am free from sin - man's soul is prone to evil,\\n\\t\\t\\texcept the one to whom my Rabb has shown mercy, certainly my Rabb\\n\\t\\t\\tis Forgiving, Merciful\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "54",
    "Text": "The king said: \"Bring him to me; I will take him for my special\\n\\t\\t\\tservice.\" When Yusuf had a talk with the King, he said: \"From now\\n\\t\\t\\ton, you have an honorable place with us, and you will enjoy our\\n\\t\\t\\tfull confidence.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "55",
    "Text": "Yusuf said: \"Place me over all the resources of the land.\\n\\t\\t\\tCertainly I know how to manage; I have the necessary knowledge.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "56",
    "Text": "Thus We established Yusuf in the land to live therein in any way\\n\\t\\t\\the wished. We bestow Our mercy on whom We please and We do not\\n\\t\\t\\tlet the reward of good people go to waste."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "57",
    "Text": "Yet the reward in the hereafter will be even better for those who\\n\\t\\t\\tbelieve and are righteous."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "58",
    "Text": "Several years later when the famine started and there was no food\\n\\t\\t\\tavailable outside of Egypt, Yusuf's brothers came to Egypt for\\n\\t\\t\\tfood and entered his office. He recognized them but they did not\\n\\t\\t\\trecognize him."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "59",
    "Text": "When he had given them their due provisions and they were about\\n\\t\\t\\tto leave, he said: \"Bring your half brother to me next time. Do\\n\\t\\t\\tyou not see that I give full measure and provide the best\\n\\t\\t\\thospitality?"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "60",
    "Text": "But if you do not bring him, you shall have no grain, nor shall\\n\\t\\t\\tyou even come near me again.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "61",
    "Text": "They replied: \"We shall certainly try our best to bring him from\\n\\t\\t\\this father. This we will surely do.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "62",
    "Text": "Yusuf told his servants to put his brother's money into their\\n\\t\\t\\tsaddlebags secretly so that they should know about it only when\\n\\t\\t\\tthey reach their family, so that they may come back again.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "63",
    "Text": "When Yusuf's brothers returned to their father, they said:\\n\\t\\t\\t\"Father! Grain is henceforth denied us unless we take our\\n\\t\\t\\tstepbrother with us; please send our brother with us so that we\\n\\t\\t\\tmay get our measure; we take full responsibility for his safety.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "64",
    "Text": "He said: \"Should I trust you with him as I once trusted you with\\n\\t\\t\\this brother? Allah is the best protector and He is the Most\\n\\t\\t\\tMerciful of the mercy-givers.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "65",
    "Text": "When they opened their baggage, they discovered that their money\\n\\t\\t\\thad been returned to them. \"Father!\" They cried with joy, \"What\\n\\t\\t\\tmore can we ask for? Here is our money returned back to us. We\\n\\t\\t\\twill buy more food for our family, we will take good care of our\\n\\t\\t\\tbrother and obtain an extra camel load of grain. This way, it\\n\\t\\t\\twill be easy to add another camel load of grain.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "66",
    "Text": "Ya'qoob (Jacob) replied: \"I will never send him with you until\\n\\t\\t\\tyou pledge in the name of Allah that you will surely bring him\\n\\t\\t\\tback to me unless you become helpless.\" And when they had given\\n\\t\\t\\ttheir pledge, he said: \"Allah is the Witness over the pledge you\\n\\t\\t\\tmade.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "67",
    "Text": "Then he said; \"My sons! Do not enter the capital city of Egypt\\n\\t\\t\\tthrough one gate, enter from the different gates. Not that I can\\n\\t\\t\\tavail you aught against Allah; this advice is just a precaution,\\n\\t\\t\\tbecause none can accurately judge except Allah. In Him do I put\\n\\t\\t\\tmy trust and in Him let all the reliant put their trust.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "68",
    "Text": "When they entered the city as their father had advised them, it\\n\\t\\t\\tdid not avail them against the will of Allah. Of course, Ya'qoob\\n\\t\\t\\tdid his best to avert the fear he had in his heart. Indeed he\\n\\t\\t\\tpossessed the knowledge which We had given him, but most people\\n\\t\\t\\tdo not know."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "69",
    "Text": "When they entered to Yusuf, he called his brother (Benjamin)\\n\\t\\t\\talone to himself, and said: \"In fact, I am your brother (Yusuf),\\n\\t\\t\\tnow you need not grieve at what they have been doing.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "70",
    "Text": "While Yusuf was arranging the loading of their provisions, he put\\n\\t\\t\\tthe royal drinking cup into his brother's pack. Later on a crier\\n\\t\\t\\tcalled out: \"O people of the caravan! You must be thieves.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "71",
    "Text": "They turned back and asked: \"What have you lost?\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "72",
    "Text": "The royal servants said: \"We have lost the King's drinking cup.\\n\\t\\t\\t(The leader of the royal servants added) and the one who brings\\n\\t\\t\\tit, will be awarded a camel-load of corn, I guarantee it.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "73",
    "Text": "Yusuf's brothers said: \"By Allah! You should know, by our\\n\\t\\t\\tbehavior during our stay here, that we did not come here to make\\n\\t\\t\\tmischief in the land and we are no thieves.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "74",
    "Text": "The royal servants said: \"What should be the punishment of the\\n\\t\\t\\tthief, if you are liars?\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "75",
    "Text": "They replied: \"The punishment of he in whose pack you find the\\n\\t\\t\\troyal cup will be to make him your bondsman, that's how we punish\\n\\t\\t\\twrongdoers.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "76",
    "Text": "After this Yusuf first began to search the packs of his\\n\\t\\t\\tstepbrothers before the pack of his own brother (Benjamin).\\n\\t\\t\\tFinally he took it out of his brother's pack. Thus We directed\\n\\t\\t\\tYusuf. He could not seize his brother under the King's law; but\\n\\t\\t\\tAllah willed otherwise. We exalt in ranks whom We please, He is\\n\\t\\t\\tthe One Whose knowledge is far greater than the knowledge of all\\n\\t\\t\\tothers."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "77",
    "Text": "At this accusation, his brothers remarked: \"This is not strange\\n\\t\\t\\tif he has committed a theft - for his brother also committed a\\n\\t\\t\\ttheft before him.\" Hearing this, Yusuf suppressed his feelings\\n\\t\\t\\tand did not reveal anything to them - he simply whispered to\\n\\t\\t\\thimself: \"What a bad people you are! You are accusing me of\\n\\t\\t\\tsomething, the truth of which Allah knows best.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "78",
    "Text": "- They said: \"O noble prince! He (Benjamin) has a very aged\\n\\t\\t\\tfather who may not be able to survive without him, so please take\\n\\t\\t\\tone of us instead of him. We see that you are one of those who do\\n\\t\\t\\tgood to others.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "79",
    "Text": "Yusuf replied: \"God forbid that we should seize other than the\\n\\t\\t\\tone with whom we found our property: if we did so then indeed we\\n\\t\\t\\twould be unjust.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "80",
    "Text": "When they lost their hope of moving Yusuf, they went aside to\\n\\t\\t\\tconfer in private. The eldest of them said: \"You know that your\\n\\t\\t\\tfather had taken a solemn pledge in the name of Allah, and you\\n\\t\\t\\talso know how you fell short of your duty with respect to Yusuf.\\n\\t\\t\\tTherefore, I am not going to leave this land until my father\\n\\t\\t\\tgives me permission or Allah decide for me, and He is the best of\\n\\t\\t\\tall judges."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "81",
    "Text": "Go back to your father and tell him, \"father, your son committed\\n\\t\\t\\ttheft. We did not see him stealing, we testify only to what we\\n\\t\\t\\tknow. How could we guard against the unforeseen?"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "82",
    "Text": "You may enquire from the people of the city where we lodged and\\n\\t\\t\\tthe caravan in which we travelled that we are indeed telling the\\n\\t\\t\\ttruth.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "83",
    "Text": "When they went back and told all this to their father, \" No!\"\\n\\t\\t\\tCried their father, \" Your souls have contrived a story for you.\\n\\t\\t\\tWell, I will bear this too with good patience. Maybe Allah will\\n\\t\\t\\tbring them all back to me; indeed He is the Knowledgeable, the\\n\\t\\t\\tWise.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "84",
    "Text": "He turned his face away from them, crying: \"Alas for Yusuf!\" His\\n\\t\\t\\teyes became white with grief, and he became sorely oppressed with\\n\\t\\t\\tgrief."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "85",
    "Text": "They said: \"By Allah! It appears that you will not cease to\\n\\t\\t\\tremember Yusuf until you ruin your health or kill yourself.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "86",
    "Text": "He said: \"I complain of my distress and grief to Allah Alone and\\n\\t\\t\\tI know from Allah what you do not know."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "87",
    "Text": "O my sons! Go and search for Yusuf and his brother. Never give up\\n\\t\\t\\thope of Allah's mercy; in fact none despairs of Allah's mercy\\n\\t\\t\\texcept the unbelieving people.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "88",
    "Text": "When they went back to Egypt and entered Yusuf's office, they\\n\\t\\t\\tsaid: \"Noble prince! We and our family are in great distress, we\\n\\t\\t\\thave hardly any money, please give us full quota and also some\\n\\t\\t\\tcharity. Surely Allah rewards the charitable.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "89",
    "Text": "Hearing this, Yusuf, who could contain himself no longer,\\n\\t\\t\\treplied: \"Do you know what you did to Yusuf and his brother while\\n\\t\\t\\tacting out of ignorance?\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "90",
    "Text": "This took them by surprise, and they cried: \"What! Are you really\\n\\t\\t\\tYusuf?\" He said: \"Yes! I am Yusuf and this is my brother. Allah\\n\\t\\t\\thas indeed been gracious to us. In fact as for the righteous and\\n\\t\\t\\tpatient; Allah really does not let the reward of the righteous be\\n\\t\\t\\twasted.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "91",
    "Text": "They said: \"By Allah! Certainly Allah has preferred you over us.\\n\\t\\t\\tWe have indeed been guilty.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "92",
    "Text": "Yusuf said: \"There is no blame on you today. May Allah forgive\\n\\t\\t\\tyou! He is the most Merciful of those who show mercy!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "93",
    "Text": "Go, take this shirt of mine and cast it over the face of my\\n\\t\\t\\tfather, he will recover his sight. Then come back to me with all\\n\\t\\t\\tthe members of your family.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "94",
    "Text": "When the caravan started (from Egypt) their father (who was in\\n\\t\\t\\tKen'an) said: \"Certainly I feel the scent of Yusuf, even though\\n\\t\\t\\tyou may think I am out of my mind.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "95",
    "Text": "The people, who heard him, said: \"By Allah! You are still\\n\\t\\t\\tsuffering from your old illusion.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "96",
    "Text": "But when the bearer of the good news arrived, he cast the shirt\\n\\t\\t\\tof Yusuf over his face and he regained his sight. Then he said:\\n\\t\\t\\t\"Didn't I tell you that I know from Allah what you do not know?\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "97",
    "Text": "They said: \"Father! Pray for the forgiveness for our sins. We\\n\\t\\t\\thave indeed done wrong.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "98",
    "Text": "He replied: \"Soon I will ask my Rabb for your forgiveness; surely\\n\\t\\t\\tHe is the One who is the Forgiving, the Merciful.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "99",
    "Text": "When they came to Yusuf, he asked his parents to lodge with\\n\\t\\t\\thimself, and said: \"Now enter the city. Allah willing, you will\\n\\t\\t\\tlive here in peace.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "100",
    "Text": "After entering the city he helped his parents to seats on the\\n\\t\\t\\tthrone, and they all fell down in prostration before him. \"This,\"\\n\\t\\t\\tsaid Yusuf to his father, \"is the interpretation of my dream\\n\\t\\t\\twhich I dreamt long before. My Rabb has really made it come true.\\n\\t\\t\\tIt was His grace that He took me out of prison and brought you\\n\\t\\t\\tall here from the desert even though Shaitan had stirred up\\n\\t\\t\\tstrife between me and my brothers. For sure my Rabb fulfills His\\n\\t\\t\\tplan in mysterious ways. Surely He is the One Who is the\\n\\t\\t\\tKnowledgeable, the Wise."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "101",
    "Text": "O Rabb! You have indeed given me a kingdom and taught me the\\n\\t\\t\\tinterpretation of dreams. O, the Creator of the heavens and the\\n\\t\\t\\tearth, You are my Protector in this world and in the hereafter,\\n\\t\\t\\tmake me die as a Muslim and admit me among the righteous.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "102",
    "Text": "O Muhammad, this story which We have revealed to you is a tale of\\n\\t\\t\\tthe unseen; for you were not there with (the brothers of Yusuf)\\n\\t\\t\\twhen they collectively conspired and schemed against him."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "103",
    "Text": "Yet strive as you may, most men are not going to become\\n\\t\\t\\tbelievers,"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "104",
    "Text": "even though You do not demand any recompense for this\\n\\t\\t\\tinformation. This Qur'an is nothing but a reminder for all the\\n\\t\\t\\tpeople of the worlds."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "105",
    "Text": "There are many signs in the heavens and the earth which they pass\\n\\t\\t\\tby; yet they pay no attention to them!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "106",
    "Text": "As a result most of them who believe in Allah also commit shirk."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "107",
    "Text": "Do they feel secure that Allah's scourge will not fall on them,\\n\\t\\t\\tor that the Hour of Doom will not come upon them suddenly while\\n\\t\\t\\tthey do not suspect it?"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "108",
    "Text": "Tell them plainly: \"This is my way. I invite you to Allah with\\n\\t\\t\\tsure knowledge which I and my followers possess. Glory be to\\n\\t\\t\\tAllah, and I am not one of the mushrikin.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "109",
    "Text": "All the Rasools that We sent before you, O Muhammad, were human\\n\\t\\t\\tbeings, to whom We sent Our Revelations after choosing them from\\n\\t\\t\\tthe people of their town. Have these unbelievers not traveled\\n\\t\\t\\tthrough the land and seen what was the end of those who passed\\n\\t\\t\\taway before them? From their destiny you should know that the\\n\\t\\t\\thome of the hereafter is better for those who are righteous. Why\\n\\t\\t\\tdon't you understand?"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "110",
    "Text": "Respite was granted until the Rasools gave up hope of their\\n\\t\\t\\tpeople and realized that they were being treated as liars, Our\\n\\t\\t\\thelp came to them and We delivered those whom We pleased; and Our\\n\\t\\t\\tscourge was not averted from the criminal people."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "111",
    "Text": "There is a lesson in these stories of former people for the men\\n\\t\\t\\tof common sense. This story of Yusuf revealed in the Qur'an is\\n\\t\\t\\tnot an invented tale, but a confirmation of previous scriptures -\\n\\t\\t\\ta detailed exposition of all things, and is a guidance and\\n\\t\\t\\tblessing for the people who believe."
  }
]
