[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "14",
        "bookName": "Book of Itikaf",
        "bookNameArabic": "كتاب الاعتكاف",
        "hadiths": [
            {
                "hadithNo": "2780",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn ‘Umar [may Allah be pleased with them] that the Prophet (SAW) used to observe I’tikaf during the last ten days of Ramadan.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِىُّ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ رضى الله عنهما أَنَّ النَّبِىَّ -صلى الله عليه وسلم- كَانَ يَعْتَكِفُ فِى الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ."
            },
            {
                "hadithNo": "2781",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from ‘Abdullah bin ‘Umar [may Allah be pleased with them] that the Messenger of Allah (SAW) used to observe I’tikaf during the last ten days of Ramadan. Nafi said: “’Abdullah showed me the place where the Messenger of Allah (SAW) used to observe I’tikaf in the Masjid.”",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ بْنُ يَزِيدَ أَنَّ نَافِعًا حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ - رضى الله عنهما - أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ.\r\nقَالَ نَافِعٌ وَقَدْ أَرَانِى عَبْدُ اللَّهِ - رضى الله عنه - الْمَكَانَ الَّذِى كَانَ يَعْتَكِفُ فِيهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم- مِنَ الْمَسْجِدِ."
            },
            {
                "hadithNo": "2782",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Aishah [may Allah be pleased with her] said: “The Messenger of Allah (SAW) used to observe I‘tikaf during the last ten days of Ramadan.”",
                "hadithArabic": "وَحَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ السَّكُونِىُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ."
            },
            {
                "hadithNo": "2783",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Aishah [may Allah be pleased with her] said: “The Messenger of Allah (SAW) used to observe I‘tikaf during the last ten days of Ramadan.”",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ أَخْبَرَنَا حَفْصُ بْنُ غِيَاثٍ جَمِيعًا عَنْ هِشَامٍ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لَهُمَا - قَالاَ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ."
            },
            {
                "hadithNo": "2784",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Aishah [may Allah be pleased with her] that the Prophet (SAW) used to observe I‘tikaf during the last ten days of Ramadan, until Allah took his soul in death, then his wives observed I‘tikaf after him.",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ عُقَيْلٍ عَنِ الزُّهْرِىِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ - رضى الله عنها - أَنَّ النَّبِىَّ -صلى الله عليه وسلم- كَانَ يَعْتَكِفُ الْعَشْرَ الأَوَاخِرَ مِنْ رَمَضَانَ حَتَّى تَوَفَّاهُ اللَّهُ عَزَّ وَجَلَّ ثُمَّ اعْتَكَفَ أَزْوَاجُهُ مِنْ بَعْدِهِ."
            },
            {
                "hadithNo": "2785",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Aishah [may Allah be pleased with her] said: “When the Messenger of Allah (SAW) wanted to observe I‘tikaf, he prayed Fajr then he entered his place of I‘tikaf. He commanded that his tent be set up – when he wanted to observe I‘tikaf during the last ten days of Ramadan – and Zainab ordered that her tent be set up, and other wives of Prophet (SAW) ordered that their tents be set up. When the Messenger of Allah (SAW) prayed Fajr, he looked and saw the tents, and he said: ‘Is it righteousness that they seek?’ He ordered that his tent be taken down and he did not observe I‘tikaf during (that) Ramadan, until he observed I‘tikaf during the first ten days of Shawwal.”",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِذَا أَرَادَ أَنْ يَعْتَكِفَ صَلَّى الْفَجْرَ ثُمَّ دَخَلَ مُعْتَكَفَهُ وَإِنَّهُ أَمَرَ بِخِبَائِهِ فَضُرِبَ أَرَادَ الاِعْتِكَافَ فِى الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ فَأَمَرَتْ زَيْنَبُ بِخِبَائِهَا فَضُرِبَ وَأَمَرَ غَيْرُهَا مِنْ أَزْوَاجِ النَّبِىِّ -صلى الله عليه وسلم- بِخِبَائِهِ فَضُرِبَ فَلَمَّا صَلَّى رَسُولُ اللَّهِ -صلى الله عليه وسلم- الْفَجْرَ نَظَرَ فَإِذَا الأَخْبِيَةُ فَقَالَ « آلْبِرَّ تُرِدْنَ ». فَأَمَرَ بِخِبَائِهِ فَقُوِّضَ وَتَرَكَ الاِعْتِكَافَ فِى شَهْرِ رَمَضَانَ حَتَّى اعْتَكَفَ فِى الْعَشْرِ الأَوَّلِ مِنْ شَوَّالٍ."
            },
            {
                "hadithNo": "2786",
                "chapterNo": "2",
                "hadithEnglish": "A Hadith similar to that of Abu Muawiyah (no. 2875) was narrated from Aishah [may Allah be pleased with her] from the Prophet (SAW).\r\nIn the Hadith of Ibn Uyaynah, Amr bin Al- Harith and Ibn Ishaq, it mentions Aishah, Hafsah and Zainab [may Allah be pleased with them] setting up tents for I‘tikaf.",
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ ح وَحَدَّثَنِى عَمْرُو بْنُ سَوَّادٍ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ ح وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ ح وَحَدَّثَنِى سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الأَوْزَاعِىُّ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِى عَنِ ابْنِ إِسْحَاقَ كُلُّ هَؤُلاَءِ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ - رضى الله عنها - عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمَعْنَى حَدِيثِ أَبِى مُعَاوِيَةَ. وَفِى حَدِيثِ ابْنِ عُيَيْنَةَ وَعَمْرِو بْنِ الْحَارِثِ وَابْنِ إِسْحَاقَ ذِكْرُ عَائِشَةَ وَحَفْصَةَ وَزَيْنَبَ - رضى الله عنهن - أَنَّهُنَّ ضَرَبْنَ الأَخْبِيَةَ لِلاِعْتِكَافِ."
            },
            {
                "hadithNo": "2787",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Aishah [may Allah be pleased with her] said: “When the (last) ten (nights) began, the Messenger of Allah (SAW) would stay awake at night, wake his family, strive hard (in worship) and tighten his Izar.”",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِىُّ وَابْنُ أَبِى عُمَرَ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ - قَالَ إِسْحَاقُ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ - عَنْ أَبِى يَعْفُورٍ عَنْ مُسْلِمِ بْنِ صُبَيْحٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ - رضى الله عنها - قَالَتْ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِذَا دَخَلَ الْعَشْرُ أَحْيَا اللَّيْلَ وَأَيْقَظَ أَهْلَهُ وَجَدَّ وَشَدَّ الْمِئْزَرَ."
            },
            {
                "hadithNo": "2788",
                "chapterNo": "3",
                "hadithEnglish": "Aishah [may Allah be pleased with her] said: “The Messenger of Allah (SAW) used to strive harder in last ten (nights of Ramadan) than at any other time.”",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو كَامِلٍ الْجَحْدَرِىُّ كِلاَهُمَا عَنْ عَبْدِ الْوَاحِدِ بْنِ زِيَادٍ - قَالَ قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْوَاحِدِ - عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ قَالَ سَمِعْتُ إِبْرَاهِيمَ يَقُولُ سَمِعْتُ الأَسْوَدَ بْنَ يَزِيدَ يَقُولُ قَالَتْ عَائِشَةُ رضى الله عنها كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَجْتَهِدُ فِى الْعَشْرِ الأَوَاخِرِ مَا لاَ يَجْتَهِدُ فِى غَيْرِهِ."
            },
            {
                "hadithNo": "2789",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Aishah [may Allah be pleased with her] said: “I never saw the Messenger of Allah (SAW) fasting in the ten days (of Dhul-Hijjah).”",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَاقُ قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنِ الأَسْوَدِ عَنْ عَائِشَةَ - رضى الله عنها - قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- صَائِمًا فِى الْعَشْرِ قَطُّ."
            },
            {
                "hadithNo": "2790",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Aishah [may Allah be pleased with her] that the Prophet (SAW) did not fast the ten days (of Dhul-Hijjah).”",
                "hadithArabic": "وَحَدَّثَنِى أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِىُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنِ الأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنِ الأَسْوَدِ عَنْ عَائِشَةَ - رضى الله عنها - أَنَّ النَّبِىَّ -صلى الله عليه وسلم- لَمْ يَصُمِ الْعَشْرَ."
            }
        ]
    }
]