[
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "1",
    "sectionHeading": "The Prohibition against Talking about the Decree",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Adam and Musa\\n\\t\\t\\t\\targued and Adam got the better of Musa. Musa rebuked\\n\\t\\t\\t\\tAdam, 'You are Adam who led people astray and brought\\n\\t\\t\\t\\tthem out of the Garden.' Adam said to him, 'You are Musa\\n\\t\\t\\t\\tto whom Allah gave knowledge of everything and whom he\\n\\t\\t\\t\\tchose above people with His message.' He said, 'Yes.' He\\n\\t\\t\\t\\tsaid, 'Do you then censure me for a matter which was\\n\\t\\t\\t\\tdecreed for me before I was created?' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "2",
    "sectionHeading": "The Prohibition against Talking about the Decree",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Abi Unaysa\\n\\t\\t\\t\\tthat Abd al-Hamid ibn Abd ar-Rahman ibn Zayd ibn\\n\\t\\t\\t\\tal-Khattab informed him from Muslim ibn Yasar al-Juhani\\n\\t\\t\\t\\tthat Umar ibn al-Khattab was asked about this ayat -\\n\\t\\t\\t\\t\"When your Lord took their progeny from the Banu Adam\\n\\t\\t\\t\\tfrom their backs and made them testify against\\n\\t\\t\\t\\tthemselves. 'Am I not your Lord?' They said, 'Yes, we\\n\\t\\t\\t\\tbear witness'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tLest you should say on the Day of Rising, 'We were\\n\\t\\t\\t\\theedless of that.'\" (Sura 7 ayat 172) Umar ibn al-Khattab\\n\\t\\t\\t\\tsaid, \"I heard the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, being asked about it. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'Allah, the Blessed, the Exalted, created\\n\\t\\t\\t\\tAdam. Then He stroked his back with His right hand, and\\n\\t\\t\\t\\tprogeny issued from it. He said, \"I created these for the\\n\\t\\t\\t\\tGarden and they will act with the behaviour of the people\\n\\t\\t\\t\\tof the Garden.\" Then He stroked his back again and\\n\\t\\t\\t\\tbrought forth progeny from him. He said, \"I created these\\n\\t\\t\\t\\tfor the Fire and they will act with the behaviour of the\\n\\t\\t\\t\\tpeople of the Fire.\" 'A man said, 'Messenger of Allah!\\n\\t\\t\\t\\tThen of what value are deeds?' The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, answered, 'When\\n\\t\\t\\t\\tAllah creates a slave for the Garden, he makes him use\\n\\t\\t\\t\\tthe behaviour of the people of the Garden, so that he\\n\\t\\t\\t\\tdies on one of the actions of the people of the Garden\\n\\t\\t\\t\\tand by it He brings him into the Garden. When He creates\\n\\t\\t\\t\\ta slave for the Fire, He makes him use the behaviour of\\n\\t\\t\\t\\tthe people of the Fire, so that he dies on one of the\\n\\t\\t\\t\\tactions of the people of the Fire, and by it, He brings\\n\\t\\t\\t\\thim into the Fire.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "3",
    "sectionHeading": "The Prohibition against Talking about the Decree",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"I have left two matters with you. As long\\n\\t\\t\\t\\tas you hold to them, you will not go the wrong way. They\\n\\t\\t\\t\\tare the Book of Allah and the Sunna of His Prophet.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "4",
    "sectionHeading": "The Prohibition against Talking about the Decree",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ziyad ibn Sad from\\n\\t\\t\\t\\tAmr ibn Muslim that Tawus al-Yamani said, \"I found some\\n\\t\\t\\t\\tof the companions of the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, saying 'Everything is by\\n\\t\\t\\t\\tdecree.' \" Tawus added, \"I heard Abdullah ibn Umar say\\n\\t\\t\\t\\tthat The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace. said, 'Everything is by decree - even\\n\\t\\t\\t\\tincapacity and ability,' (or 'ability and incapacity').\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "5",
    "sectionHeading": "The Prohibition against Talking about the Decree",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ziyad ibn Sad that Amr ibn Dinar\\n\\t\\t\\t\\tsaid, \"I heard Abdullah ibn az-Zubayr say in a khutba,\\n\\t\\t\\t\\t'Allah - He is the Guider and the One Who Tempts Away.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "6",
    "sectionHeading": "The Prohibition against Talking about the Decree",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that his paternal uncle,\\n\\t\\t\\t\\tAbu Suhayl ibn Malik said, \"I was a prisoner with Umar\\n\\t\\t\\t\\tibn Abd al-Aziz. He said, 'What do you think about these\\n\\t\\t\\t\\tQadariyya (fatalists)?' I said, 'My opinion is that one\\n\\t\\t\\t\\tshould ask them to turn from wrong action, if they will\\n\\t\\t\\t\\tdo so. If not, subject them to the sword.' Umar ibn Abd\\n\\t\\t\\t\\tal-Aziz said, 'That is my opinion.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"That is my opinion also.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "7",
    "sectionHeading": "General Section on the People of the Decree",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"A woman\\n\\t\\t\\t\\tshould not ask for the divorce of her sister to make her\\n\\t\\t\\t\\tplate empty and in order to marry. She has what is\\n\\t\\t\\t\\tdecreed for her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "8",
    "sectionHeading": "General Section on the People of the Decree",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Ziyad that\\n\\t\\t\\t\\tMuhammad ibn Kab al-Quradhi said, ''Muawiya ibn Abi\\n\\t\\t\\t\\tSufyan said from the mimbar, 'O people! Nothing keeps\\n\\t\\t\\t\\taway what Allah gives and nothing gives what Allah keeps\\n\\t\\t\\t\\taway. The earnestness of the earnest one does not profit\\n\\t\\t\\t\\thim. When Allah desires good for him, he gives him\\n\\t\\t\\t\\tunderstanding in the deen.' Then Muawiya said, 'I heard\\n\\t\\t\\t\\tthese words from the Messenger of  Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, on these blocks of wood.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "9",
    "sectionHeading": "General Section on the People of the Decree",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tthis was said \"Praise be to Allah who created everything\\n\\t\\t\\t\\tas is necessary, who does not hasten anything He defers\\n\\t\\t\\t\\tand determines. Allah is enough for me and sufficient.\\n\\t\\t\\t\\tAllah hears whoever makes dua to him. Allah does not have\\n\\t\\t\\t\\ta goal.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "46",
    "hadithNumber": "10",
    "sectionHeading": "General Section on the People of the Decree",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that this\\n\\t\\t\\t\\twas said \"No one will die until his provision is\\n\\t\\t\\t\\tcompleted for him, so behave correctly in your seeking\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p>"
  }
]
