[
  {
    "SurahNumber": "41",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "See  12:2  and the corresponding note [3]."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "The \"people of [innate] knowledge\" mentioned in the\\n\\t\\t\\t\\tpreceding verse are obviously those who understand the\\n\\t\\t\\t\\tspiritual purport of this divine writ and, therefore,\\n\\t\\t\\t\\tsubmit to its guidance: hence, it cannot be \"most of\\n\\t\\t\\t\\tthem\" who are referred to in the above phrase and in the\\n\\t\\t\\t\\tnext verse, but, on the contrary, people who are devoid\\n\\t\\t\\t\\tof such knowledge and to whom, in consequence, the Qur'an\\n\\t\\t\\t\\tis meaningless. This elliptically implied differentation\\n\\t\\t\\t\\t- overlooked by almost all of the commentators (with\\n\\t\\t\\t\\tperhaps the sole exception of Ibn Kathir) - can only be\\n\\t\\t\\t\\tbrought out by means of an interpolation at the beginning\\n\\t\\t\\t\\tof the sentence."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "For this rendering of the term hijab, see note [36] on\\n\\t\\t\\t\\tthe first sentence of  7:46 . See also  6:25 . The\\n\\t\\t\\t\\t\"saying\" of those who turn away from the message of the\\n\\t\\t\\t\\tQur'an is, of course, figurative, describing only their\\n\\t\\t\\t\\tattitude."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "Cf.  6:50  and the corresponding note [38]."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "7",
    "NoteID": "6",
    "Body": "Belief in God's oneness and charitableness towards one's\\n\\t\\t\\t\\tfellow-men are two cardinal demands of Islam. Conversely,\\n\\t\\t\\t\\ta deliberate offence against either of these two demands\\n\\t\\t\\t\\tamounts to a denial of man's responsibility before God\\n\\t\\t\\t\\tand hence, by implication, of a continuation of life in\\n\\t\\t\\t\\tthe hereafter. (For my rendering of zakah, in this\\n\\t\\t\\t\\tcontext, as \"charity\", see surah {2}, note [34]. It is to\\n\\t\\t\\t\\tbe borne in mind that the application of this term to the\\n\\t\\t\\t\\tobligatory tax incumbent on Muslims dates from the Medina\\n\\t\\t\\t\\tperiod, whereas the present surah is a Meccan\\n\\t\\t\\t\\trevelation.)"
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "For the above rendering of the term yawm (lit., \"day\"),\\n\\t\\t\\t\\tas \"aeon\", see last third of note [43] on  7:54 . As in\\n\\t\\t\\t\\tso many verses of the Qur'an which relate to cosmic\\n\\t\\t\\t\\tevents, the repeated mention of the \"six aeons\" during\\n\\t\\t\\t\\twhich the universe was created - \"two\" of which,\\n\\t\\t\\t\\taccording to the above verse, were taken by the evolution\\n\\t\\t\\t\\tof the inorganic universe, including the earth - has a\\n\\t\\t\\t\\tpurely allegorical import: in this case, I believe, an\\n\\t\\t\\t\\tindication that the universe did not exist \"eternally\"\\n\\t\\t\\t\\tbut had a definite beginning in time, and that it\\n\\t\\t\\t\\trequired a definite time-lapse to evolve to its present\\n\\t\\t\\t\\tcondition."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "Lit., \"do you give Him compeers (andad)?\" For an\\n\\t\\t\\t\\texplanation, see note [13] on  2:22 ."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "10",
    "NoteID": "9",
    "Body": "I.e., in accordance with divine justice, and not with\\n\\t\\t\\t\\thuman concepts of \"equity\" or \"need\"."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "10",
    "NoteID": "10",
    "Body": "Almost all the classical commentators agree in that these\\n\\t\\t\\t\\t\"four aeons\" include the \"two\" mentioned in the preceding\\n\\t\\t\\t\\tverse: hence my interpolation of the words \"and all this\\n\\t\\t\\t\\tHe created\". Together with the \"two aeons\" of verse 12,\\n\\t\\t\\t\\tthe entire allegorical number comes to six."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "11",
    "NoteID": "11",
    "Body": "Whenever the particle thumma is used, as in the above\\n\\t\\t\\t\\tinstance, to link parallel statements - statements not\\n\\t\\t\\t\\tnecessarily indicating a sequence in time - it has the\\n\\t\\t\\t\\tfunction of a simple conjunction, and may be rendered as\\n\\t\\t\\t\\t\"and\"."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "11",
    "NoteID": "12",
    "Body": "I.e., a gas - evidently hydrogen gas, which physicists\\n\\t\\t\\t\\tregard as the primal element from which all material\\n\\t\\t\\t\\tparticles of the universe have evolved and still evolve.\\n\\t\\t\\t\\tFor the meaning of the term sama' (\"sky\" or \"skies\" or\\n\\t\\t\\t\\t\"heaven\") in its cosmic connotation, see note [20] on\\n\\t\\t\\t\\t 2:29 ."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "11",
    "NoteID": "13",
    "Body": "Explaining this passage, Zamakhshari observes: \"The\\n\\t\\t\\t\\tmeaning of God's command to the skies and the earth to\\n\\t\\t\\t\\t'come', and their submission [to His command] is this: He\\n\\t\\t\\t\\twilled their coming into being, and so they came to be as\\n\\t\\t\\t\\tHe willed them to be...: and this is the kind of metaphor\\n\\t\\t\\t\\t(majaz) which is called 'allegory' (tamthil).... Thus,\\n\\t\\t\\t\\tthe purport [of this passage] is but an illustration\\n\\t\\t\\t\\t(taswir) of the effect of His almighty power on all that\\n\\t\\t\\t\\tis willed [by Him], and nothing else...\" (It is obvious\\n\\t\\t\\t\\tthat Zamakhshari's reasoning is based on the oft-repeated\\n\\t\\t\\t\\tQur'anic statement, \"When God wills a thing to be, He but\\n\\t\\t\\t\\tsays unto it, 'Be' - and it is.\") Concluding his\\n\\t\\t\\t\\tinterpretation of the above passage, Zamakhshari adds: \"If\\n\\t\\t\\t\\tI am asked about the meaning of [the words] 'willingly or\\n\\t\\t\\t\\tunwillingly', I say that it is a figurative expression\\n\\t\\t\\t\\t(mathal) indicating that His almighty will must\\n\\t\\t\\t\\tinevitably take effect.\""
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "12",
    "NoteID": "14",
    "Body": "I.e., a multiplicity of cosmic systems (cf. note [20] on\\n\\t\\t\\t\\t 2:29 )."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "12",
    "NoteID": "15",
    "Body": "Cf. {15:16-18} and the corresponding notes [16] and [17];\\n\\t\\t\\t\\talso  37:6  ff."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "13",
    "NoteID": "16",
    "Body": "This connects with the opening sentence of verse {9}\\n\\t\\t\\t\\tabove: \"Would you indeed deny Him who has created...\",\\n\\t\\t\\t\\tetc."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "13",
    "NoteID": "17",
    "Body": "See note [40] on  2:55 ."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "13",
    "NoteID": "18",
    "Body": "For the story of these two ancient tribes, see {7:65-79}\\n\\t\\t\\t\\tand the corresponding notes, in particular [48] and [56];\\n\\t\\t\\t\\talso {26:123-158}."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "14",
    "NoteID": "19",
    "Body": "Lit.. \"from between their hands and from behind them\":\\n\\t\\t\\t\\ti.e., reminding them of something that was known to them\\n\\t\\t\\t\\t- namely, what happened to sinners like themselves who\\n\\t\\t\\t\\tlived before their time - and warning them of what was\\n\\t\\t\\t\\tbound to happen in the future to them, too, if they\\n\\t\\t\\t\\tpersisted in their denial of the truth (Al-Hasan\\n\\t\\t\\t\\tal-Basri, as quoted by Zamakhshari). However, it is\\n\\t\\t\\t\\tpossible to understand the above phrase (which has been\\n\\t\\t\\t\\texplained in note [247] on  2:255 ) in yet another, more\\n\\t\\t\\t\\tdirect way: God's message-bearers pointed out to those\\n\\t\\t\\t\\tsinning communities something that should have been\\n\\t\\t\\t\\tobvious to them (lit., \"between their hands\")- namely,\\n\\t\\t\\t\\ttheir patently wrong attitude in their worldly, social\\n\\t\\t\\t\\tconcerns and moral concepts - as well as the\\n\\t\\t\\t\\tunreasonableness of their denying something that was\\n\\t\\t\\t\\tstill beyond their ken (lit., \"behind them\"): namely,\\n\\t\\t\\t\\tlife after death and God's ultimate judgment."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "14",
    "NoteID": "20",
    "Body": "Cf.{6:8-9} and  15:7 ."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "16",
    "NoteID": "21",
    "Body": "See {69:6-8}."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "24",
    "NoteID": "22",
    "Body": "Sc., \"unless God wills to reprieve them\": see the last\\n\\t\\t\\t\\tparagraph of  6:128  and the corresponding note [114];\\n\\t\\t\\t\\talso the hadith quoted in note [10] on  40:12 ."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "24",
    "NoteID": "23",
    "Body": "Lit., \"they will not be of those who are allowed to make\\n\\t\\t\\t\\tamends\": an allusion to the request of the doomed, on the\\n\\t\\t\\t\\tDay of Judgment, to be granted a \"second chance\" on\\n\\t\\t\\t\\tearth, and to God's refusal of this request (cf.\\n\\t\\t\\t\\t{6:27-28} and  32:12 )."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "25",
    "NoteID": "24",
    "Body": "Or: \"soul-mates\" (cf.  4:38 ). The verb qarana, from\\n\\t\\t\\t\\twhich the noun qarin is derived, signifies \"he linked\" or\\n\\t\\t\\t\\t\"intimately associated\" or \"yoked together [one thing\\n\\t\\t\\t\\twith another]\". Cf.  43:36  - \"as for anyone who chooses\\n\\t\\t\\t\\tto remain blind to the remembrance of the Most Gracious,\\n\\t\\t\\t\\tto him We assign an [enduring] evil impulse [lit., \"a\\n\\t\\t\\t\\tsatan\"], to become his other self\"."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "25",
    "NoteID": "25",
    "Body": "Lit., \"that which was between their hands and that which\\n\\t\\t\\t\\twas behind them\": i.e., their own evil impulses (which\\n\\t\\t\\t\\thad become their \"other selves\", as it were) made\\n\\t\\t\\t\\talluring to them the unrestrained enjoyment, without any\\n\\t\\t\\t\\tmoral discrimination, of all the worldly attractions\\n\\t\\t\\t\\twhich lay open before them, causing them, at the same\\n\\t\\t\\t\\ttime, to dismiss as an illusion the idea of ressurrection\\n\\t\\t\\t\\tand of God's judgment - thus giving them a false sense of\\n\\t\\t\\t\\tsecurity with regard to something that was beyond their\\n\\t\\t\\t\\tken."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "25",
    "NoteID": "26",
    "Body": "For this rendering - and the meaning - of the term jinn,\\n\\t\\t\\t\\tsee Appendix III."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "26",
    "NoteID": "27",
    "Body": "This is an allusion to efforts aimed at discrediting the\\n\\t\\t\\t\\tQur'an by describing it as \"invented\" by Muhammad for his\\n\\t\\t\\t\\town - personal and political - ends, as a series of\\n\\t\\t\\t\\t\"misunderstood quotations\" from earlier scriptures, as\\n\\t\\t\\t\\tthe result of \"hallucinations\", and so forth: all of\\n\\t\\t\\t\\twhich implies that the opponents of the Qur'anic message\\n\\t\\t\\t\\tinstinctively feel its force, realizing at the same time\\n\\t\\t\\t\\tthat it endangers their self-complacent, materialistic\\n\\t\\t\\t\\toutlook on life and ought, therefore, to be combatted.\\n\\t\\t\\t\\tThis explains the statement, at the end of verse {28},\\n\\t\\t\\t\\tthat they \"knowingly reject\" God's messages."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "28",
    "NoteID": "28",
    "Body": "For the above rendering of the verb jahada, see surah\\n\\t\\t\\t\\t{29}, note [45]."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "29",
    "NoteID": "29",
    "Body": "See  6:112  - \"against every prophet We have set up as\\n\\t\\t\\t\\tenemies the evil forces (shayatin) from among humans as\\n\\t\\t\\t\\twell as from among invisible beings\" - and the\\n\\t\\t\\t\\tcorresponding note [98]."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "29",
    "NoteID": "30",
    "Body": "Cf. 7:38 ."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "34",
    "NoteID": "31",
    "Body": "See note [44] on  13:22 . In the present instance, the\\n\\t\\t\\t\\tinjunction to \"repel [evil] with something that is\\n\\t\\t\\t\\tbetter\" relates to scurrilous objections to, and hostile\\n\\t\\t\\t\\tcriticism of, the Qur'an. The whole of this passage\\n\\t\\t\\t\\t(verses {33} ff.) connects with verse {26}."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "36",
    "NoteID": "32",
    "Body": "I.e., He alone sees what is in the hearts of men, and He\\n\\t\\t\\t\\talone understands the innermost motivations, of which\\n\\t\\t\\t\\tthey themselves are unconscious, of those who criticize\\n\\t\\t\\t\\tthe Qur'an adversely. - See {7:199-200} and the\\n\\t\\t\\t\\tcorresponding notes, especially note [164]."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "37",
    "NoteID": "33",
    "Body": "This, according to Razi, connects with the phrase\\n\\t\\t\\t\\t\"calling [one's fellow-men] unto God\" in verse {33}\\n\\t\\t\\t\\tabove. God is the sole cause and source of all that\\n\\t\\t\\t\\texists; and whatever exists is but a wondrous sign of His\\n\\t\\t\\t\\tcreative power. Hence, it is a blasphemy - apart from\\n\\t\\t\\t\\tbeing unreasonable - to ascribe real power (which is the\\n\\t\\t\\t\\tmeaning of \"adoration\" in this context) to anything\\n\\t\\t\\t\\tcreated, whether it be a concrete phenomenon, or an\\n\\t\\t\\t\\tabstract force of nature, or a set of circumstances, or\\n\\t\\t\\t\\teven an idea."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "39",
    "NoteID": "34",
    "Body": "Although the allusion to the reviving earth often occurs\\n\\t\\t\\t\\tin the Qur'an as a parable of man's ultimate\\n\\t\\t\\t\\tresurrection, in the present context (and in tune with\\n\\t\\t\\t\\tthe entire passage comprising verses {33-39}) it appears\\n\\t\\t\\t\\tto be an illustration of God's power to bestow spiritual\\n\\t\\t\\t\\tlife upon hearts that have hitherto remained closed to\\n\\t\\t\\t\\tthe truth of His existence and omnipotence. Hence, it\\n\\t\\t\\t\\timplies a call to the believer never to abandon the hope\\n\\t\\t\\t\\tthat \"those who deny the truth\" may one day grasp the\\n\\t\\t\\t\\ttruth of the Qur'anic message."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "42",
    "NoteID": "35",
    "Body": "Lit., \"neither from between its hands, nor from behind\\n\\t\\t\\t\\tit\", i.e., it cannot be openly changed by means of\\n\\t\\t\\t\\tadditions or omissions (Razi), and neither\\n\\t\\t\\t\\tsurreptitiously, by hostile or deliberately confusing\\n\\t\\t\\t\\tinterpretations. The above is one of the Qur'anic\\n\\t\\t\\t\\tpassages on which the great commentator Abu Muslim\\n\\t\\t\\t\\tal-Isfahani (as quoted by Razi) bases his absolute\\n\\t\\t\\t\\trejection of the theory of \"abrogation\" (for which see\\n\\t\\t\\t\\tnote [87] on  2:106 ). Since the \"abrogation\" of any\\n\\t\\t\\t\\tQur'an-verse would have amounted to its ibtal - that is,\\n\\t\\t\\t\\tto an open or implied declaration that it was henceforth\\n\\t\\t\\t\\tto be regarded as null and void - the verse in question\\n\\t\\t\\t\\twould have to be considered \"false\" (batil) in the\\n\\t\\t\\t\\tcontext of the Qur'an as it is before us: and this, as\\n\\t\\t\\t\\tAbu Muslim points out, would clearly contradict the above\\n\\t\\t\\t\\tstatement that \"no falsehood (batil) can ever attain to\\n\\t\\t\\t\\tit\"."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "43",
    "NoteID": "36",
    "Body": "This is an allusion to the allegation of the Prophet's\\n\\t\\t\\t\\topponents that he himself was the \"author\" of what he\\n\\t\\t\\t\\tclaimed to be a divine revelation, as well as to their\\n\\t\\t\\t\\tdemand that he should \"prove\" the truth of his prophetic\\n\\t\\t\\t\\tmission by producing a miracle: a scornful attitude with\\n\\t\\t\\t\\twhich all the earlier prophets had been confronted at one\\n\\t\\t\\t\\ttime or another, and which is epitomized in the \"saying\"\\n\\t\\t\\t\\tof the unbelievers mentioned in verse {5} of this surah."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "44",
    "NoteID": "37",
    "Body": "Sc., \"in a tongue which we can understand\". Since the\\n\\t\\t\\t\\tProphet was an Arab and lived in an Arabian environment,\\n\\t\\t\\t\\this message had to be expressed in the Arabic language,\\n\\t\\t\\t\\twhich the people to whom it was addressed in the first\\n\\t\\t\\t\\tinstance could understand: see in this connection note\\n\\t\\t\\t\\t[72] on the first sentence of  13:37 , as well as the\\n\\t\\t\\t\\tfirst half of  14:4  - \"never have We sent forth any\\n\\t\\t\\t\\tapostle otherwise than [with a message] in his own\\n\\t\\t\\t\\tpeople's tongue, so that he might make [the truth] clear\\n\\t\\t\\t\\tunto them\". Had the message of the Qur'an been formulated\\n\\t\\t\\t\\tin a language other than Arabic, the opponents of the\\n\\t\\t\\t\\tProphet would have been justified in saying, \"between us\\n\\t\\t\\t\\tand thee is a barrier\" (verse {5} of this surah"
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "44",
    "NoteID": "38",
    "Body": "Lit, \"from a far-off place\": i.e., they only hear the\\n\\t\\t\\t\\tsound of the words, but cannot understand their meaning."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "45",
    "NoteID": "39",
    "Body": "As was and is the case with the Qur'an, some people\\n\\t\\t\\t\\taccepted the divine message revealed to Moses, and some\\n\\t\\t\\t\\trejected it (Zamakhshari, Razi), while others disagreed\\n\\t\\t\\t\\tabout the import and application of its tenets (Tabari)."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "45",
    "NoteID": "40",
    "Body": "For an explanation of this passage, as well as of the\\n\\t\\t\\t\\tabove parallel between men's attitudes towards the\\n\\t\\t\\t\\tearlier scriptures and the Qur'an, see the second\\n\\t\\t\\t\\tsentence of  10:19  and the corresponding note [29]."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "45",
    "NoteID": "41",
    "Body": "Lit., \"about it\", i.e., doubts as to whether the Qur'anic\\n\\t\\t\\t\\tapproach to problems of man's spirit and body - and, in\\n\\t\\t\\t\\tparticular, its stress on the essential unity of these\\n\\t\\t\\t\\ttwin aspects of human life (cf. note [118] on the first\\n\\t\\t\\t\\tsentence of  2:143 ) - is justified or not. In a wider\\n\\t\\t\\t\\tsense, these doubts of the deniers of the truth relate to\\n\\t\\t\\t\\tthe question of whether religion as such is \"beneficial\"\\n\\t\\t\\t\\tor \"injurious\" to human society - a question which is\\n\\t\\t\\t\\tposed and answered by them with a strong bias against all\\n\\t\\t\\t\\treligious faith."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "49",
    "NoteID": "42",
    "Body": "See note [17] on  11:9 ."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "50",
    "NoteID": "43",
    "Body": "I.e., man is, as a rule, so blinded by his love of this\\n\\t\\t\\t\\tworld that he cannot imagine its ever coming to an end.\\n\\t\\t\\t\\tImplied in this statement is a doubt as to whether there\\n\\t\\t\\t\\twill really be an afterlife, and whether man will really\\n\\t\\t\\t\\tbe judged by God on resurrection."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "50",
    "NoteID": "44",
    "Body": "Being fully convinced of his own merit (as expressed in\\n\\t\\t\\t\\tthe words, \"This is but my due\"), he is confident that -\\n\\t\\t\\t\\tin case there should really be a life after death - his\\n\\t\\t\\t\\town flattering view of himself will be confirmed by God."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "50",
    "NoteID": "45",
    "Body": "I.e., the truth of resurrection and of God's judgment."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "50",
    "NoteID": "46",
    "Body": "I.e., the realization of the spiritual blindness in which\\n\\t\\t\\t\\tthey spent their life will in itself be a source of\\n\\t\\t\\t\\ttheir suffering in the hereafter: cf.  17:72  - \"whoever\\n\\t\\t\\t\\tis blind [of heart] in this [worldl will be blind in the\\n\\t\\t\\t\\tlife to come [as well]\"."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "51",
    "NoteID": "47",
    "Body": "Lit., \"wide [i.e., prolonged or diffuse] prayers\"."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "52",
    "NoteID": "48",
    "Body": "According to Razii, this is an implied allusion to the\\n\\t\\t\\t\\tattitude of people who - as mentioned in verses {4} and\\n\\t\\t\\t\\t{5} of this surah - \"turn away\" from the message of the\\n\\t\\t\\t\\tQur'an, saying, as it were: \"Our hearts are veiled from\\n\\t\\t\\t\\twhatever thou callest us to, [O Muhammad,] and in our\\n\\t\\t\\t\\tears is deafness, and between us and thee is a barrier.\""
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "53",
    "NoteID": "49",
    "Body": "Lit., \"We will show them\" or \"make them see\"."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "53",
    "NoteID": "50",
    "Body": "I.e., through a progressive deepening and widening of\\n\\t\\t\\t\\ttheir insight into the wonders of the universe as well as\\n\\t\\t\\t\\tthrough a deeper understanding of man's own psyche - all\\n\\t\\t\\t\\tof which points to the existence of a conscious Creator."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "53",
    "NoteID": "51",
    "Body": "I.e., that He is almighty and all-seeing: a fundamental\\n\\t\\t\\t\\ttruth which, by itself, should be enough to remind man of\\n\\t\\t\\t\\this responsibility before Him."
  }
]
