[
  {
    "SurahNumber": "69",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "I.e., the Day of Resurrection and Judgment, on which man\\n\\t\\t\\t\\twill become fully aware of the quality of his past life\\n\\t\\t\\t\\tand, freed from all self-deception, will see himself as\\n\\t\\t\\t\\the really was, with the innermost meaning of all his past\\n\\t\\t\\t\\tdoings - and thus of his destiny in the hereafter -\\n\\t\\t\\t\\tblindingly revealed. (Cf. 37:19 , the last sentence of\\n\\t\\t\\t\\t 39:68 , and {50:21-22}.)"
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Implying that this sudden perception of the ultimate\\n\\t\\t\\t\\treality will be beyond anything that man can anticipate\\n\\t\\t\\t\\tor imagine: hence, no answer is given to the above\\n\\t\\t\\t\\trhetorical question."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "I.e., the Last Hour (see note [1] on  101:1 . For\\n\\t\\t\\t\\tparticulars of the pre-Islamic tribes of 'Ad and Thamud,\\n\\t\\t\\t\\tsee {7:65-79} and the corresponding notes."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "Cf. 7:78 ."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "9",
    "NoteID": "5",
    "Body": "I.e., Sodom and Gomorrah, the cities of Lot's people see\\n\\t\\t\\t\\t{11:69-83}."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "11",
    "NoteID": "6",
    "Body": "I.e., metonymically (in the consensus of all classical\\n\\t\\t\\t\\tcommentators), \"your ancestors\"."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "12",
    "NoteID": "7",
    "Body": "Alluding to the punishment of evildoers and the saving\\n\\t\\t\\t\\tgrace bestowed upon the righteous."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "15",
    "NoteID": "8",
    "Body": "I.e., the end of the world as we know it, followed by\\n\\t\\t\\t\\tresurrection and the Last Judgment."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "16",
    "NoteID": "9",
    "Body": "The term as-sama' may denote here \"the sky\" or \"skies\",\\n\\t\\t\\t\\ti.e., the visible firmament, or \"heaven\" in its\\n\\t\\t\\t\\tallegorical sense, or the aggregate of cosmic systems\\n\\t\\t\\t\\tcomprised in the concept of \"the universe\" (cf. surah\\n\\t\\t\\t\\t{2},note [20]).Its being \"rent asunder\" is perhaps a\\n\\t\\t\\t\\tmetaphor for a total breakdown of the cosmic order."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "17",
    "NoteID": "10",
    "Body": "Or: \"at its sides\"."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "17",
    "NoteID": "11",
    "Body": "Since God is infinite in space as well as in time, it is\\n\\t\\t\\t\\tobvious that His \"throne\" ('arsh) has a purely\\n\\t\\t\\t\\tmetaphorical connotation, circumscribing His absolute,\\n\\t\\t\\t\\tunfathomable sway over all that exists or possibly could\\n\\t\\t\\t\\texist (cf. note [43] on  7:54 ). Hence, too, the \"bearing\\n\\t\\t\\t\\taloft\" of the throne of His almightiness cannot be\\n\\t\\t\\t\\tanything but a metaphor - namely, an allusion to the full\\n\\t\\t\\t\\tmanifestation of that almightiness on the Day of\\n\\t\\t\\t\\tJudgment. The Qur'an is silent as to who or what the\\n\\t\\t\\t\\t\"eight\" are on whom this manifestation rests. Some of the\\n\\t\\t\\t\\tearliest commentators assume that they are eight angels;\\n\\t\\t\\t\\tothers, that they are eight ranks of angels; while still\\n\\t\\t\\t\\tothers frankly admit that it is impossible to say whether\\n\\t\\t\\t\\t\"eight\" or \"eight thousand\" are meant (Al-Hasan al-Basri,\\n\\t\\t\\t\\tas quoted by Zamakhshari). Possibly, we have here an\\n\\t\\t\\t\\tallusion to eight (unspecified) attributes of God or\\n\\t\\t\\t\\taspects of His creation; but, as the Qur'an states\\n\\t\\t\\t\\telsewhere, \"none save God knows its final meaning\" (see\\n\\t\\t\\t\\t 3:7  and the corresponding note [8])."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "19",
    "NoteID": "12",
    "Body": "I.e., whose record shows that he was righteous in his\\n\\t\\t\\t\\tlife on earth: cf. 17:71 , as well as the symbolic\\n\\t\\t\\t\\texpression \"those on the right hand\" in  74:39 . The\\n\\t\\t\\t\\tlinguistic origin of the symbolism of \"right\" and \"left\"\\n\\t\\t\\t\\tas \"righteous\" and \"unrighteous\" is explained in note [3]\\n\\t\\t\\t\\ton {56:8-9}."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "20",
    "NoteID": "13",
    "Body": "Implying that he had always been conscious of\\n\\t\\t\\t\\tresurrection and judgment, and had tried to behave\\n\\t\\t\\t\\taccordingly."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "25",
    "NoteID": "14",
    "Body": "Thus signifying that he had been unrighteous in his\\n\\t\\t\\t\\tearthly life, in contrast with those \"whose record will\\n\\t\\t\\t\\tbe placed in their right hand\" (see verse {19} and note\\n\\t\\t\\t\\t[12] above)."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "29",
    "NoteID": "15",
    "Body": "The term sultan, which primarily signifies \"power\" or\\n\\t\\t\\t\\t\"authority\", has here - as in many other places in the\\n\\t\\t\\t\\tQur'an - evidently the meaning of \"argument\", synonymous\\n\\t\\t\\t\\twith hujjah (Ibn 'Abbas, 'Ikrimah, Mujahid, Ad-Dahhak,\\n\\t\\t\\t\\tall of them quoted by Tabari): in this case, an argument\\n\\t\\t\\t\\tor arguments against the idea of life after death and,\\n\\t\\t\\t\\thence, of divine judgment."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "30",
    "NoteID": "16",
    "Body": "For an explanation of the allegory of \"shackles\", see\\n\\t\\t\\t\\tnote [13] on  13:5 , note [44] on the last but one\\n\\t\\t\\t\\tsentence of  34:33 , and notes [6] and [7] on  36:8 ."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "32",
    "NoteID": "17",
    "Body": "See  14:49  - \"on that Day thou wilt see all who were\\n\\t\\t\\t\\tlost in sin (al-mujrimin) linked together in fetters\" -\\n\\t\\t\\t\\tand the corresponding note [64], which explains my above\\n\\t\\t\\t\\tinterpolation of the phrase, \"of other sinners like him\"."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "32",
    "NoteID": "18",
    "Body": "I.e., a chain exceedingly long - the number \"seventy\"\\n\\t\\t\\t\\tbeing used here metonymically, as is often done in\\n\\t\\t\\t\\tclassical Arabic, in the sense of \"very many\"\\n\\t\\t\\t\\t(Zamakhshari); hence \"of a measure the length whereof is\\n\\t\\t\\t\\tknown only to God\" (Tabari; also Al-Hasan, as quoted by\\n\\t\\t\\t\\tRazi)."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "34",
    "NoteID": "19",
    "Body": "Lit., \"did not urge\", i.e., himself."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "37",
    "NoteID": "20",
    "Body": "The noun ghislin, which appears in the Qur'an only in\\n\\t\\t\\t\\tthis one instance, has been variously - and very\\n\\t\\t\\t\\tcontradictorily - explained by the early commentators.\\n\\t\\t\\t\\tIbn 'Abbas, when asked about it, frankly answered, \"I do\\n\\t\\t\\t\\tnot know what grisly denotes\" (Razi). The term \"filth\"\\n\\t\\t\\t\\tused by me contains an allusion to the \"devouring\" of all\\n\\t\\t\\t\\tthat is abominable in the spiritual sense: cf. its\\n\\t\\t\\t\\tcharacterisation in the next verse as \"[that] which none\\n\\t\\t\\t\\tbut the sinners eat\" - i.e., (metaphorically) in this\\n\\t\\t\\t\\tworld and, consequently, in the hereafter as well."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "39",
    "NoteID": "21",
    "Body": "The phrase \"all that you can see\" comprises all the\\n\\t\\t\\t\\tobservable phenomena of nature - including man himself\\n\\t\\t\\t\\tand the organic conditions of his own existence - as well\\n\\t\\t\\t\\tas the configuration of human society and the perceptible\\n\\t\\t\\t\\trules of its growth and decay in the historical sense;\\n\\t\\t\\t\\twhereas \"that which you cannot see\" relates to the\\n\\t\\t\\t\\tintangible spiritual verities accessible to man's\\n\\t\\t\\t\\tintuition and instinct, including the voice of his own\\n\\t\\t\\t\\tconscience: all of which \"bears witness\", as it were, to\\n\\t\\t\\t\\tthe fact that the light which the divine writ (spoken of\\n\\t\\t\\t\\tin the sequence) casts on the innermost realities and\\n\\t\\t\\t\\tinterrelations of all that exists objectively - or, as\\n\\t\\t\\t\\tthe case may be, manifests itself subjectively in man's\\n\\t\\t\\t\\town psyche - must be an outcome of genuine revelation,\\n\\t\\t\\t\\tinasmuch as it goes far beyond anything that unaided\\n\\t\\t\\t\\thuman intellect could ever acheive."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "45",
    "NoteID": "22",
    "Body": "I.e., deprived him of all ability to act - the \"right\\n\\t\\t\\t\\thand\" symbolizing power."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "48",
    "NoteID": "23",
    "Body": "Sc., \"who believe in [the existence of] that which is\\n\\t\\t\\t\\tbeyond the reach of human perception\": cf. {2:2-3}."
  }
]
