[
  {
    "SurahNumber": "106",
    "AyahNumber": "1",
    "NoteID": "6276",
    "Body": "The Quraish were the noblest tribe of Arabia, the tribe\\n\\t\\t\\t\\tto which belonged the holy Prophet himself. They had the\\n\\t\\t\\t\\tcustody of the Ka'ba, the central shrine of Arabia, and\\n\\t\\t\\t\\ttheir possession of Makkah gave them a triple advantage:\\n\\t\\t\\t\\t(1) they had a commanding influence over other tribes;\\n\\t\\t\\t\\t(2) their central position facilitated trade and\\n\\t\\t\\t\\tintercourse, which gave them both honour and profit; and\\n\\t\\t\\t\\t(3) the Makkah territory being by Arabian custom\\n\\t\\t\\t\\tinviolable from the ravages of war and private feuds,\\n\\t\\t\\t\\tthey had a secure position, free from fear of danger.\\n\\t\\t\\t\\tThis honour and advantage they owed to their position as\\n\\t\\t\\t\\tservants of the sacred shrine of the Ka'ba. They owed it\\n\\t\\t\\t\\tto Allah. Was it not therefore right and fitting that\\n\\t\\t\\t\\tthey should adore the One True God, and listen to His\\n\\t\\t\\t\\tMessage of Unity and Purity, brought by His Prophet? In\\n\\t\\t\\t\\tthose days of general insecurity, their prestige as\\n\\t\\t\\t\\tcustodians of Makkah enabled them to obtain Covenants of\\n\\t\\t\\t\\tsecurity and safeguard from the rulers of neighbouring\\n\\t\\t\\t\\tcountries on all sides-Syria, Persia, Yaman, and\\n\\t\\t\\t\\tAbyssinia-protecting their trade journey in all seasons."
  },
  {
    "SurahNumber": "106",
    "AyahNumber": "2",
    "NoteID": "6277",
    "Body": "See last note, especially section (2). On account of\\n\\t\\t\\t\\ttheir trade journeys to the warmth of Yaman in the winter\\n\\t\\t\\t\\tand the cooler regions of Syria and the north in the\\n\\t\\t\\t\\tsummer, the Quraish became practised travellers and\\n\\t\\t\\t\\tmerchants, acquired much knowledge of the world and\\n\\t\\t\\t\\tperfected their language as a polished medium of literary\\n\\t\\t\\t\\texpression."
  },
  {
    "SurahNumber": "106",
    "AyahNumber": "3",
    "NoteID": "6278",
    "Body": "The Ka'ba."
  },
  {
    "SurahNumber": "106",
    "AyahNumber": "4",
    "NoteID": "6279",
    "Body": "Their trade caravans enriched them, and drew people from\\n\\t\\t\\t\\tdistant parts to visit Makkah and bring their merchandise\\n\\t\\t\\t\\tand gifts thither."
  },
  {
    "SurahNumber": "106",
    "AyahNumber": "4",
    "NoteID": "6280",
    "Body": "Their territory being inviolable, they did not suffer\\n\\t\\t\\t\\tfrom the dangers of constant warfare nor from private\\n\\t\\t\\t\\tfeuds of vengeance or breaches of the peace in their\\n\\t\\t\\t\\tsecure homes."
  }
]
