[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "29",
        "bookName": "Book of Legal Punishmants",
        "bookNameArabic": "كتاب الحدود",
        "hadiths": [
            {
                "hadithNo": "4398",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Aishah said: \"The Messenger of Allah (s.a.w) would cut off the thief's hand for one-quarter of a Dinar or more.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِى عُمَرَ - وَاللَّفْظُ لِيَحْيَى - قَالَ ابْنُ أَبِى عُمَرَ حَدَّثَنَا وَقَالَ الآخَرَانِ أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِىِّ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَقْطَعُ السَّارِقَ فِى رُبْعِ دِينَارٍ فَصَاعِدًا."
            },
            {
                "hadithNo": "4399",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 4398) was narrated from Az-Zuhri with this chain.",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا سُلَيْمَانُ بْنُ كَثِيرٍ وَإِبْرَاهِيمُ بْنُ سَعْدٍ كُلُّهُمْ عَنِ الزُّهْرِىِّ بِمِثْلِهِ فِى هَذَا الإِسْنَادِ."
            },
            {
                "hadithNo": "4400",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Aishah that the Messenger of Allah (s.a.w) said: \"The hand of a thief should not be cut off, except for one-quarter of a Dinar or more.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى وَحَدَّثَنَا الْوَلِيدُ بْنُ شُجَاعٍ - وَاللَّفْظُ لِلْوَلِيدِ وَحَرْمَلَةَ - قَالُوا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ وَعَمْرَةَ عَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ « لاَ تُقْطَعُ يَدُ السَّارِقِ إِلاَّ فِى رُبْعِ دِينَارٍ فَصَاعِدًا »"
            },
            {
                "hadithNo": "4401",
                "chapterNo": "1",
                "hadithEnglish": "'Aishah narrated that she heard the Messenger of Allah (s.a.w) say: \"The hand should not be cut off except for one-quarter of a Dinar or more.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ وَأَحْمَدُ بْنُ عِيسَى - وَاللَّفْظُ لِهَارُونَ وَأَحْمَدَ - قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا وَقَالَ الآخَرَانِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى مَخْرَمَةُ عَنْ أَبِيهِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَمْرَةَ أَنَّهَا سَمِعَتْ عَائِشَةَ تُحَدِّثُ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « لاَ تُقْطَعُ الْيَدُ إِلاَّ فِى رُبْعِ دِينَارٍ فَمَا فَوْقَهُ »."
            },
            {
                "hadithNo": "4402",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Aishah that she heard the Prophet (s.a.w) say: \"The hand of the thief should not be cut off except for one-quarter of a Dinar or more.\"",
                "hadithArabic": "حَدَّثَنِى بِشْرُ بْنُ الْحَكَمِ الْعَبْدِىُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ أَبِى بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّهَا سَمِعَتِ النَّبِىَّ -صلى الله عليه وسلم- يَقُولُ « لاَ تُقْطَعُ يَدُ السَّارِقِ إِلاَّ فِى رُبْعِ دِينَارٍ فَصَاعِدًا »."
            },
            {
                "hadithNo": "4403",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 4402) was narrated from Yazid bin 'Abdullah bin Al-Hadi with this chain.",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَإِسْحَاقُ بْنُ مَنْصُورٍ جَمِيعًا عَنْ أَبِى عَامِرٍ الْعَقَدِىِّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ - مِنْ وَلَدِ الْمِسْوَرِ بْنِ مَخْرَمَةَ - عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "4404",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Aishah said: \"At the time of the Messenger of Allah (s.a.w) the hand of a thief was not cut off for less than the price of a shield made of leather or iron (steel?), both of which were valuable.\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الرُّؤَاسِىُّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ لَمْ تُقْطَعْ يَدُ سَارِقٍ فِى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فِى أَقَلَّ مِنْ ثَمَنِ الْمِجَنِّ حَجَفَةٍ أَوْ تُرْسٍ وَكِلاَهُمَا ذُو ثَمَنٍ."
            },
            {
                "hadithNo": "4405",
                "chapterNo": "1",
                "hadithEnglish": "A Hadith like that of Ibn Numair from Humaid bin 'Abdur-Rahman Ar-Ru'asi (no. 4404) was narrated from Hisham with this chain. In the Hadith of 'Abdur-Rahman and Abu Usamah it says: \"At that time it was valuable.\"",
                "hadithArabic": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِى شَيْبَةَ أَخْبَرَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ كُلُّهُمْ عَنْ هِشَامٍ بِهَذَا الإِسْنَادِ. نَحْوَ حَدِيثِ ابْنِ نُمَيْرٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الرُّؤَاسِىِّ وَفِى حَدِيثِ عَبْدِ الرَّحِيمِ وَأَبِى أُسَامَةَ وَهُوَ يَوْمَئِذٍ ذُو ثَمَنٍ."
            },
            {
                "hadithNo": "4406",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Messenger of Allah (s.a.w) cut off the hand of a thief for a shield, the value of which was three Dirham.",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَطَعَ سَارِقًا فِى مِجَنٍّ قِيمَتُهُ ثَلاَثَةُ دَرَاهِمَ."
            },
            {
                "hadithNo": "4407",
                "chapterNo": "1",
                "hadithEnglish": "A Hadith like that of Yahya bin Malik (no. 4406) was narrated from Nafi' from Ibn 'Umar, from the Prophet (s.a.w), except that some of them said: 'Its value,' and some of them said: \"Its price was three Dirham.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَابْنُ الْمُثَنَّى قَالاَ حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَلِىُّ بْنُ مُسْهِرٍ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَاعِيلُ يَعْنِى ابْنَ عُلَيَّةَ ح وَحَدَّثَنَا أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ ح وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ أَيُّوبَ السَّخْتِيَانِىِّ وَأَيُّوبَ بْنِ مُوسَى وَإِسْمَاعِيلَ بْنِ أُمَيَّةَ ح  وَحَدَّثَنِى عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِىُّ أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ وَإِسْمَاعِيلَ بْنِ أُمَيَّةَ وَعُبَيْدِ اللَّهِ وَمُوسَى بْنِ عُقْبَةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى إِسْمَاعِيلُ بْنُ أُمَيَّةَ ح وَحَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ حَنْظَلَةَ بْنِ أَبِى سُفْيَانَ الْجُمَحِىِّ وَعُبَيْدِ اللَّهِ بْنِ عُمَرَ وَمَالِكِ بْنِ أَنَسٍ وَأُسَامَةَ بْنِ زَيْدٍ اللَّيْثِىِّ كُلُّهُمْ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمِثْلِ حَدِيثِ يَحْيَى عَنْ مَالِكٍ غَيْرَ أَنَّ بَعْضَهُمْ قَالَ قِيمَتُهُ وَبَعْضُهُمْ قَالَ ثَمَنُهُ ثَلاَثَةُ دَرَاهِمَ."
            },
            {
                "hadithNo": "4408",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'May Allah curse the thief, for he steals an egg and his hand is cut off, or he steals a rope and his hand is cut off.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ عَنْ أَبِى صَالِحٍ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَعَنَ اللَّهُ السَّارِقَ يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ »."
            },
            {
                "hadithNo": "4409",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 4408) was narrated from Al-A'mash with this chain, except that he said: \"If he steals a rope, if he steals an egg.\"",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَلِىُّ بْنُ خَشْرَمٍ كُلُّهُمْ عَنْ عِيسَى بْنِ يُونُسَ عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ. مِثْلَهُ غَيْرَ أَنَّهُ يَقُولُ « إِنْ سَرَقَ حَبْلاً وَإِنْ سَرَقَ بَيْضَةً »."
            },
            {
                "hadithNo": "4410",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah that Quraish were concerned about the case of the Makhzumi woman who had stolen. They said: \"Who will speak to the Messenger of Allah (s.a.w) concerning her?\" Then they said: \"Who would dare to do that but Usamah, the beloved of the Messenger of Allah (s.a.w)?\" So Usamah spoke to him, and the Messenger of Allah (s.a.w) said: \"Are you interceding about one of the Hadd punishments of Allah?\" Then he stood up and delivered a speech in which he said: \"O people, those who came before you were doomed because if a nobleman among them stole, they let him off, but if a lowly person stole, they carried out the punishment on him. By Allah, if Fatimah the daughter of Muhammad were to steal, I would cut off her hand.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنَ عَائِشَةَ أَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِى سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالُوا وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلاَّ أُسَامَةُ حِبُّ رَسُولِ اللَّهِ -صلى الله عليه وسلم-. فَكَلَّمَهُ أُسَامَةُ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَتَشْفَعُ فِى حَدٍّ مِنْ حُدُودِ اللَّهِ ». ثُمَّ قَامَ فَاخْتَطَبَ فَقَالَ « أَيُّهَا النَّاسُ إِنَّمَا أَهْلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمُ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا ». وَفِى حَدِيثِ ابْنِ رُمْحٍ « إِنَّمَا هَلَكَ الَّذِينَ مِنْ قَبْلِكُمْ »."
            },
            {
                "hadithNo": "4411",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah, the wife of the Prophet (s.a.w), that Quraish were concerned about the case of the woman who had stolen, at the time of the Messenger of Allah (s.a.w), during the conquest of Makkah. They said: \"Who will speak to the Messenger of Allah (s.a.w) concerning her?\" Then they said: \"No one would dare to do that but Usamah bin Zaid, the beloved of the Messenger of Allah (s.a.w).\" She was brought to the Messenger of Allah (s.a.w), and Usamah bin Zaid spoke concerning her. The color of the face of the Messenger of Allah (s.a.w) changed, and he said: \"Are you interceding concerning one of the Hadd punishments of Allah?\" Usamah said to him: Pray for forgiveness for me, O Messenger of Allah! When evening came, the Messenger of Allah (s.a.w) stood up and delivered a speech. He praised Allah as He deserves to be praised, then he said: \"Those who came before you were doomed because, if a nobleman among them stole, they would let him off, but if a lowly person stole, they would carry out the Hadd punishment on him. By the One in Whose Hand is my soul, if Fatimah the daughter of Muhammad were to steal, I would cut off her hand.\" Then he ordered that the hand of that woman who had stolen be cut off. Yunus said: Ibn Shihab said: 'Urwah said: 'Aishah said: \"She repented properly after that, and got married, and after that she used to come and speak to me, and I would convey what she said to the Messenger of Allah(s.a.w).\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى - وَاللَّفْظُ لِحَرْمَلَةَ - قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِى يُونُسُ بْنُ يَزِيدَ عَنِ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِى عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الَّتِى سَرَقَتْ فِى عَهْدِ النَّبِىِّ -صلى الله عليه وسلم- فِى غَزْوَةِ الْفَتْحِ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالُوا وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلاَّ أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ -صلى الله عليه وسلم-. فَأُتِىَ بِهَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَكَلَّمَهُ فِيهَا أُسَامَةُ بْنُ زَيْدٍ فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « أَتَشْفَعُ فِى حَدٍّ مِنْ حُدُودِ اللَّهِ ». فَقَالَ لَهُ أُسَامَةُ اسْتَغْفِرْ لِى يَا رَسُولَ اللَّهِ. فَلَمَّا كَانَ الْعَشِىُّ قَامَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَاخْتَطَبَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ « أَمَّا بَعْدُ فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمُ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمُ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَإِنِّى وَالَّذِى نَفْسِى بِيَدِهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا ». ثُمَّ أَمَرَ بِتِلْكَ الْمَرْأَةِ الَّتِى سَرَقَتْ فَقُطِعَتْ يَدُهَا. قَالَ يُونُسُ قَالَ ابْنُ شِهَابٍ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ فَحَسُنَتْ تَوْبَتُهَا بَعْدُ وَتَزَوَّجَتْ وَكَانَتْ تَأْتِينِى بَعْدَ ذَلِكَ فَأَرْفَعُ حَاجَتَهَا إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم-."
            },
            {
                "hadithNo": "4412",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Aishah said: \"A Makhzumi woman used to borrow things and then deny it. The Prophet (s.a.w) ordered that her hand be cut off, and her family came to Usamah bin Zaid and spoke to him, and he spoke to the Messenger of Allah (s.a.w) about her...\" then he (the sub-narrator) mentioned a Hadith like that of Al-Laith and Yunus (no. 4411).",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَتِ امْرَأَةٌ مَخْزُومِيَّةٌ تَسْتَعِيرُ الْمَتَاعَ وَتَجْحَدُهُ فَأَمَرَ النَّبِىُّ -صلى الله عليه وسلم- أَنْ تُقْطَعَ يَدُهَا فَأَتَى أَهْلُهَا أُسَامَةَ بْنَ زَيْدٍ فَكَلَّمُوهُ فَكَلَّمَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- فِيهَا. ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ اللَّيْثِ وَيُونُسَ."
            },
            {
                "hadithNo": "4413",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Jubair that a woman from Banu Makhzum stole, and she was brought to the Prophet (s.a.w). She sought refuge with Umm Salamah, the wife of the Prophet (s.a.w), but the Prophet (s.a.w) said: \"If Fatimah were to steal I would cut off her hand.\" And her hand was cut off.",
                "hadithArabic": "وَحَدَّثَنِى سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِى الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ امْرَأَةً مِنْ بَنِى مَخْزُومٍ سَرَقَتْ فَأُتِىَ بِهَا النَّبِىُّ -صلى الله عليه وسلم- فَعَاذَتْ بِأُمِّ سَلَمَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- « وَاللَّهِ لَوْ كَانَتْ فَاطِمَةُ لَقَطَعْتُ يَدَهَا ». فَقُطِعَتْ."
            },
            {
                "hadithNo": "4414",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that 'Ubadah bin As-Samit said: \"Learn from me, learn from me, learn from me (the Hadd punishment for Zina). Allah has ordained a way for them. For an unmarried person with an unmarried person, one hundred lashes and exile for one year. For a married person with a married person, one hundred lashes and stoning.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ أَخْبَرَنَا هُشَيْمٌ عَنْ مَنْصُورٍ عَنِ الْحَسَنِ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِىِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « خُذُوا عَنِّى خُذُوا عَنِّى قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلاً الْبِكْرُ بِالْبِكْرِ جَلْدُ مِائَةٍ وَنَفْىُ سَنَةٍ وَالثَّيِّبُ بِالثَّيِّبِ جَلْدُ مِائَةٍ وَالرَّجْمُ »."
            },
            {
                "hadithNo": "4415",
                "chapterNo": "3",
                "hadithEnglish": "Mansur narrated a similar report (as no. 4414) with this chain.",
                "hadithArabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مَنْصُورٌ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "4416",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that 'Ubadah bin As-Samit said: \"When the Revelation came upon him, the Prophet (s.a.w) would feel some distress because of that, and his face would change color. It came to him one day, and he felt that distress, then when it was over, he said: 'Learn from me (the Hadd punishment for Zina). Allah has ordained a way for them, for a married person with a married person and for an unmarried person with an unmarried person. For a married person, one hundred lashes then stoning, and for an unmarried person, one hundred lashes then exile for one year.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ جَمِيعًا عَنْ عَبْدِ الأَعْلَى قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِىِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ كَانَ نَبِىُّ اللَّهِ -صلى الله عليه وسلم- إِذَا أُنْزِلَ عَلَيْهِ كُرِبَ لِذَلِكَ وَتَرَبَّدَ لَهُ وَجْهُهُ - قَالَ - فَأُنْزِلَ عَلَيْهِ ذَاتَ يَوْمٍ فَلُقِىَ كَذَلِكَ فَلَمَّا سُرِّىَ عَنْهُ قَالَ « خُذُوا عَنِّى فَقَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلاً الثَّيِّبُ بِالثَّيِّبِ وَالْبِكْرُ بِالْبِكْرِ الثَّيِّبُ جَلْدُ مِائَةٍ ثُمَّ رَجْمٌ بِالْحِجَارَةِ وَالْبِكْرُ جَلْدُ مِائَةٍ ثُمَّ نَفْىُ سَنَةٍ »."
            },
            {
                "hadithNo": "4417",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Qatadah with this chain (a Hadith similar to no. 4416), except that in their (the sub-narrators) Hadith it says: \"An unmarried person should be whipped then exiled, and a married person should be whipped then stoned\" and they did not mention (exile for) one year or one hundred (lashes).",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِى أَبِى كِلاَهُمَا عَنْ قَتَادَةَ بِهَذَا الإِسْنَادِ. غَيْرَ أَنَّ فِى حَدِيثِهِمَا « الْبِكْرُ يُجْلَدُ وَيُنْفَى وَالثَّيِّبُ يُجْلَدُ وَيُرْجَمُ ». لاَ يَذْكُرَانِ سَنَةً وَلاَ مِائَةً."
            },
            {
                "hadithNo": "4418",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Abdullah bin 'Abbas said: \"'Umar bin Al-Khattab said, when he was sitting on the Minbar of the Messenger of Allah (s.a.w): Allah sent Muhammad (s.a.w) with the truth, and He revealed the Book to him. One of the things that Allah revealed to him was the Verse of stoning. We recited it, memorized it and understood it, The Messenger of Allah (s.a.w) stoned (adulterers) and we stoned them after him. But I am afraid that with the passage of time, people will say, we do not find (the Verse of) stoning in the Book of Allah, so they will go astray and forsake an obligation that Allah revealed. Stoning (is mentioned) in the Book of Allah as a duty which much be carried out on those who commit Zina if they are married, men and women alike, if proof is established or if there is pregnancy or a confession.\"",
                "hadithArabic": "حَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِى عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ يَقُولُ قَالَ عُمَرُ بْنُ الْخَطَّابِ وَهُوَ جَالِسٌ عَلَى مِنْبَرِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- إِنَّ اللَّهَ قَدْ بَعَثَ مُحَمَّدًا -صلى الله عليه وسلم- بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ فَكَانَ مِمَّا أُنْزِلَ عَلَيْهِ آيَةُ الرَّجْمِ قَرَأْنَاهَا وَوَعَيْنَاهَا وَعَقَلْنَاهَا فَرَجَمَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَرَجَمْنَا بَعْدَهُ فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ قَائِلٌ مَا نَجِدُ الرَّجْمَ فِى كِتَابِ اللَّهِ فَيَضِلُّوا بِتَرْكِ فَرِيضَةٍ أَنْزَلَهَا اللَّهُ وَإِنَّ الرَّجْمَ فِى كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى إِذَا أَحْصَنَ مِنَ الرِّجَالِ وَالنِّسَاءِ إِذَا قَامَتِ الْبَيِّنَةُ أَوْ كَانَ الْحَبَلُ أَوْ الاِعْتِرَافُ."
            },
            {
                "hadithNo": "4419",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Az-Zuhri (a Hadith similar to no. 4418) with this chain .",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِى عُمَرَ قَالُوا حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ."
            },
            {
                "hadithNo": "4420",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"A Muslim man came to the Messenger of Allah (s.a.w) when he was in the Masjid and called out to him, saying: O Messenger of Allah, I have committed Zina. He turned away from him, so he came around to face him and said to him: O Messenger of Allah, I have committed Zina. He turned away from him, until he had repeated that four times. When he had testified against himself four times, the Messenger of Allah (s.a.w) called him and said: 'Are you insane?' He said: No. He said: 'Are you married?' He said: Yes. The Messenger of Allah (s.a.w) said: 'Take him and stone him.\"' Ibn Shihab said: \"Someone told me that he heard Jabir bin 'Abdullah say: I was one of those who stoned him. We stoned him in the prayer place, and when the stones hurt him he ran away. We caught up with him in the Harrah and we stoned him.\"",
                "hadithArabic": "وَحَدَّثَنِى عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ حَدَّثَنِى أَبِى عَنْ جَدِّى قَالَ حَدَّثَنِى عُقَيْلٌ عَنِ ابْنِ شِهَابٍ عَنْ أَبِى سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَسَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِى هُرَيْرَةَ أَنَّهُ قَالَ أَتَى رَجُلٌ مِنَ الْمُسْلِمِينَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- وَهُوَ فِى الْمَسْجِدِ فَنَادَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّى زَنَيْتُ، فَأَعْرَضَ عَنْهُ فَتَنَحَّى تِلْقَاءَ وَجْهِهِ فَقَالَ لَهُ يَا رَسُولَ اللَّهِ إِنِّى زَنَيْتُ. فَأَعْرَضَ عَنْهُ حَتَّى ثَنَى ذَلِكَ عَلَيْهِ أَرْبَعَ مَرَّاتٍ فَلَمَّا شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ دَعَاهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « أَبِكَ جُنُونٌ ». قَالَ لاَ. قَالَ « فَهَلْ أَحْصَنْتَ ». قَالَ نَعَمْ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « اذْهَبُوا بِهِ فَارْجُمُوهُ ». قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِى مَنْ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ فَكُنْتُ فِيمَنْ رَجَمَهُ فَرَجَمْنَاهُ بِالْمُصَلَّى فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ هَرَبَ فَأَدْرَكْنَاهُ بِالْحَرَّةِ فَرَجَمْنَاهُ."
            },
            {
                "hadithNo": "4421",
                "chapterNo": "5",
                "hadithEnglish": "A similar report (as no. 4420) was narrated from Ibn Shihab.",
                "hadithArabic": "وَرَوَاهُ اللَّيْثُ أَيْضًا عَنْ عَبْدِ الرَّحْمَنِ بْنِ خَالِدِ بْنِ مُسَافِرٍ عَنِ ابْنِ شِهَابٍ بِهَذَا الإِسْنَادِ. مِثْلَهُ."
            },
            {
                "hadithNo": "4422",
                "chapterNo": "5",
                "hadithEnglish": "Ibn Shihab said: \"Someone told me that he heard Jabir bin 'Abdullah say...\" a report like that mentioned by 'Uqail (no. 4420).",
                "hadithArabic": "وَحَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِىُّ حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ أَيْضًا وَفِى حَدِيثِهِمَا جَمِيعًا قَالَ ابْنُ شِهَابٍ أَخْبَرَنِى مَنْ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ كَمَا ذَكَرَ عُقَيْلٌ."
            },
            {
                "hadithNo": "4423",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah from the Prophet (s.a.w) - a report like that of 'Uqail from Az-Zuhri, from Sa'eed, from. Abu Salamah, from Abu Hurairah (no. 4420).",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ وَابْنُ جُرَيْجٍ كُلُّهُمْ عَنِ الزُّهْرِىِّ عَنْ أَبِى سَلَمَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. نَحْوَ رِوَايَةِ عُقَيْلٍ عَنِ الزُّهْرِىِّ عَنْ سَعِيدٍ وَأَبِى سَلَمَةَ عَنْ أَبِى هُرَيْرَةَ."
            },
            {
                "hadithNo": "4424",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Jabir bin Samurah said: \"I saw Ma'iz bin Malik when he was brought to the Prophet (s.a.w), a short, well built man who was not wearing a Rida' (upper garment). He testified against himself four times, saying that he had committed Zina, and the Messenger of Allah (s.a.w) said: 'Perhaps you (kissed her or embraced her)?' He said: 'No, by Allah, this ignoble one has committed Zina.' So he stoned him, then he gave a speech in which he said: 'Every time we set out on a campaign for the sake of Allah, one of them stayed behind and bleated like a male goat, and gave a small amount of milk or food (in return for sexual favors). By Allah, if I get hold of one of them I will certainly make an example of him.\"'",
                "hadithArabic": "وَحَدَّثَنِى أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِىُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ رَأَيْتُ مَاعِزَ بْنَ مَالِكٍ حِينَ جِىءَ بِهِ إِلَى النَّبِىِّ -صلى الله عليه وسلم- رَجُلٌ قَصِيرٌ أَعْضَلُ لَيْسَ عَلَيْهِ رِدَاءٌ فَشَهِدَ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ أَنَّهُ زَنَى فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « فَلَعَلَّكَ ». قَالَ لاَ وَاللَّهِ إِنَّهُ قَدْ زَنَى الأَخِرُ - قَالَ - فَرَجَمَهُ ثُمَّ خَطَبَ فَقَالَ « أَلاَ كُلَّمَا نَفَرْنَا غَازِينَ فِى سَبِيلِ اللَّهِ خَلَفَ أَحَدُهُمْ لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ يَمْنَحُ أَحَدُهُمُ الْكُثْبَةَ أَمَا وَاللَّهِ إِنْ يُمْكِنِّى مِنْ أَحَدِهِمْ لأُنَكِّلَنَّهُ عَنْهُ »."
            },
            {
                "hadithNo": "4425",
                "chapterNo": "5",
                "hadithEnglish": "Jabir bin Samurah said: \"A short man, muscular, with unkempt hair who was wearing an Izar (lower garment) and who had committed Zina was brought to the Messenger of Allah (s.a.w). He turned him away twice, then he ordered that he be stoned. The Messenger of Allah (s.a.w) said: 'Every time we went out on a campaign for the sake of Allah, one of you stayed behind and bleated like a male goat, and gave a small amount of milk or food (in return for sexual favors). If Allah enables me to get hold of one of them, I will make an example of him.'\" He (the narrator) said: I narrated it to Sa'eed bin Jubair and he said: He turned him away four times.",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ يَقُولُ أُتِىَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- بِرَجُلٍ قَصِيرٍ أَشْعَثَ ذِى عَضَلاَتٍ عَلَيْهِ إِزَارٌ وَقَدْ زَنَى فَرَدَّهُ مَرَّتَيْنِ ثُمَّ أَمَرَ بِهِ فَرُجِمَ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « كُلَّمَا نَفَرْنَا غَازِينَ فِى سَبِيلِ اللَّهِ تَخَلَّفَ أَحَدُكُمْ يَنِبُّ نَبِيبَ التَّيْسِ يَمْنَحُ إِحْدَاهُنَّ الْكُثْبَةَ إِنَّ اللَّهَ لاَ يُمْكِنِّى مِنْ أَحَدٍ مِنْهُمْ إِلاَّ جَعَلْتُهُ نَكَالاً ». أَوْ نَكَّلْتُهُ. قَالَ فَحَدَّثْتُهُ سَعِيدَ بْنَ جُبَيْرٍ فَقَالَ إِنَّهُ رَدَّهُ أَرْبَعَ مَرَّاتٍ."
            },
            {
                "hadithNo": "4426",
                "chapterNo": "5",
                "hadithEnglish": "A Hadith like that of Ibn Ja'far (no. 4425) was narrated from Jabir bin Samurah from the Prophet (s.a.w). Shababah agreed with his saying: he turned him away twice. \"In the Hadith of Abu 'Amir it says: \"He (s.a.w) turned him away two or three times.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا شَبَابَةُ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِىُّ كِلاَهُمَا عَنْ شُعْبَةَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. نَحْوَ حَدِيثِ ابْنِ جَعْفَرٍ وَوَافَقَهُ شَبَابَةُ عَلَى قَوْلِهِ فَرَدَّهُ مَرَّتَيْنِ. وَفِى حَدِيثِ أَبِى عَامِرٍ فَرَدَّهُ مَرَّتَيْنِ أَوْ ثَلاَثًا."
            },
            {
                "hadithNo": "4427",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Prophet (s.a.w) said to Ma'iz bin Malik: \"Is it true what I have heard about you?\" He said: \"What have you heard about me?\" He said: \"I heard that you committed Zina with the slave woman of the family of so-and-so.\" He said: \"Yes.\" He (the narrator) said: \"He testified to that four times, then he (s.a.w) ordered that he be stoned.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو كَامِلٍ الْجَحْدَرِىُّ - وَاللَّفْظُ لِقُتَيْبَةَ - قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- قَالَ لِمَاعِزِ بْنِ مَالِكٍ « أَحَقٌّ مَا بَلَغَنِى عَنْكَ ». قَالَ وَمَا بَلَغَكَ عَنِّى قَالَ « بَلَغَنِى أَنَّكَ وَقَعْتَ بِجَارِيَةِ آلِ فُلاَنٍ ». قَالَ نَعَمْ. قَالَ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ. ثُمَّ أَمَرَ بِهِ فَرُجِمَ."
            },
            {
                "hadithNo": "4428",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Sa'eed that a man from Aslam who was called Ma'iz bin Malik came to the Messenger of Allah (s.a.w) and said: \"I have committed an immoral deed, carry out (the punishment) on me.\" The Prophet (s.a.w) turned him away (from him) several times, then he asked his people about him, and they said: \"We do not know of anything wrong with him, except that he has done something, and we think that he feels there is no way out except having the Hadd punishment carried out on him.\" He went back to the Messenger of Allah (s.a.w), and he commanded us to stone him. We took him to Baqi' Al-Gharqad, and we did not tie him up or dig a pit for him. We threw bones, clods of earth and pebbles at him, and he ran away, so we ran after him until he reached the stony ground of the Harrah. He stopped there for us, and we threw tire heavy stones of the Harrah at him until he stopped moving. Then the Messenger of Allah (s.a.w) stood up and delivered a speech in the evening and said: \"Every time we went out on a campaign for the sake of Allah, a man would stay behind amongst our families and bleat like a male goat. It is my duty, if a man who has done that is brought to me, to make an example of him.\" And he (s.a.w) did not pray for forgiveness for him or curse him.",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِى عَبْدُ الأَعْلَى حَدَّثَنَا دَاوُدُ عَنْ أَبِى نَضْرَةَ عَنْ أَبِى سَعِيدٍ أَنَّ رَجُلاً مِنْ أَسْلَمَ يُقَالُ لَهُ مَاعِزُ بْنُ مَالِكٍ أَتَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ إِنِّى أَصَبْتُ فَاحِشَةً فَأَقِمْهُ عَلَىَّ. فَرَدَّهُ النَّبِىُّ -صلى الله عليه وسلم- مِرَارًا قَالَ ثُمَّ سَأَلَ قَوْمَهُ فَقَالُوا مَا نَعْلَمُ بِهِ بَأْسًا إِلاَّ أَنَّهُ أَصَابَ شَيْئًا يَرَى أَنَّهُ لاَ يُخْرِجُهُ مِنْهُ إِلاَّ أَنْ يُقَامَ فِيهِ الْحَدُّ - قَالَ - فَرَجَعَ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَأَمَرَنَا أَنْ نَرْجُمَهُ - قَالَ - فَانْطَلَقْنَا بِهِ إِلَى بَقِيعِ الْغَرْقَدِ - قَالَ - فَمَا أَوْثَقْنَاهُ وَلاَ حَفَرْنَا لَهُ - قَالَ - فَرَمَيْنَاهُ بِالْعَظْمِ وَالْمَدَرِ وَالْخَزَفِ - قَالَ - فَاشْتَدَّ فَاشْتَدَدْنَا خَلْفَهُ حَتَّى أَتَى عُرْضَ الْحَرَّةِ فَانْتَصَبَ لَنَا فَرَمَيْنَاهُ بِجَلاَمِيدِ الْحَرَّةِ - يَعْنِى الْحِجَارَةَ - حَتَّى سَكَتَ - قَالَ - ثُمَّ قَامَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- خَطِيبًا مِنَ الْعَشِىِّ فَقَالَ « أَوَكُلَّمَا انْطَلَقْنَا غُزَاةً فِى سَبِيلِ اللَّهِ تَخَلَّفَ رَجُلٌ فِى عِيَالِنَا لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ عَلَىَّ أَنْ لاَ أُوتَى بِرَجُلٍ فَعَلَ ذَلِكَ إِلاَّ نَكَّلْتُ بِهِ ». قَالَ فَمَا اسْتَغْفَرَ لَهُ وَلاَ سَبَّهُ."
            },
            {
                "hadithNo": "4429",
                "chapterNo": "5",
                "hadithEnglish": "Dawud narrated a similar report (as no. 4428) with this chain, and he said in the Hadith: \"The Prophet (s.a.w) stood up in the afternoon and praised and glorified Allah, then he said: 'What is the matter with people who, when we go out on a campaign, one of them stays behind and bleats like a male goat?' and he did not say: 'Who stays behind amongst our families.\"'",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا دَاوُدُ بِهَذَا الإِسْنَادِ. مِثْلَ مَعْنَاهُ. وَقَالَ فِى الْحَدِيثِ فَقَامَ النَّبِىُّ -صلى الله عليه وسلم- مِنَ الْعَشِىِّ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ « أَمَّا بَعْدُ فَمَا بَالُ أَقْوَامٍ إِذَا غَزَوْنَا يَتَخَلَّفُ أَحَدُهُمْ عَنَّا لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ ». وَلَمْ يَقُلْ « فِى عِيَالِنَا »."
            },
            {
                "hadithNo": "4430",
                "chapterNo": "5",
                "hadithEnglish": "Part of this Hadith was narrated from Dawud (as Hadith no. 4429) with this chain, except that in the Hadith of Sufyan (a sub-narrator) it says: \"He confessed to Zina three times.\"",
                "hadithArabic": "وَحَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِى زَائِدَةَ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ كِلاَهُمَا عَنْ دَاوُدَ بِهَذَا الإِسْنَادِ. بَعْضَ هَذَا الْحَدِيثِ. غَيْرَ أَنَّ فِى حَدِيثِ سُفْيَانَ فَاعْتَرَفَ بِالزِّنَى ثَلاَثَ مَرَّاتٍ"
            },
            {
                "hadithNo": "4431",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Sulaiman bin Buraidah that his father said: \"Ma'iz bin Malik came to the Prophet (s.a.w) and said: 'P Messenger of Allah, purify me! He said: 'Woe to you, go back and seek forgiveness from Allah and repent to Him.' He came back shortly after that and said: 'O Messenger of Allah, purify me!' He said: 'Woe to you, go back and seek forgiveness from Allah and repent to Him.' He came back shortly after that and said: 'O Messenger of Allah, purify me!' The Prophet (s.a.w) said something similar, then when it was the fourth time the Messenger of Allah (s.a.w) said to him: 'From what should I purify you?' He said: 'From Zina.' The Messenger of Allah (s.a.w) asked, 'Is he insane?' and he was told that he was not insane. He said: Has he drunk wine? A man got up and smelt his breath, and he did not find any smell of wine. The Messenger of Allah (s.a.w) said: 'Did you commit Zina?' He said: 'Yes.' So he ordered that he be stoned. The people were of two minds about him. Some said: 'He is doomed, he has been encompassed by his sin.' Others said: 'There is no repentance better than that of Ma'iz; he came to the Prophet (s.a.w) and put his hand in his, and said: Kill me with stones.' This (controversy) carried on for two or three days, then the Messenger of Allah (s.a.w) came when they were sitting. He greeted them with Salam then sat down, and said: 'Pray for forgiveness for Ma'iz bin Malik.' They said: 'May Allah forgive Ma'iz bin Malik.' The Messenger of Allah (s.a.w) said: 'He has repented in such a way that if it were to be divided among a nation it would be sufficient for them.\"' \"Then a woman from Ghamid from Al-Azd came to him and said: 'O Messenger of Allah, purify me.' He said: 'Woe to you! Go back and seek forgiveness from Allah and repent to Him.' She said: I think that you want to turn me away as you turned Ma'iz away. He said: 'Why is that?' She said: \"I am pregnant as a result of Zina.\" He said: 'You have done that?' She said: 'Yes.' He said to her: 'Not until you give birth to that which is in your womb.' A man among the Ansar sponsored her until she gave birth, then he came to the Prophet ~ and said: 'The Ghamidi woman has given birth.' He said: 'We will not stone her and leave her young child with no one to breast-feed him.' A man among the Ansar said: 'I will take responsibility for his breastfeeding, O Prophet of Allah.' Then he had her stoned.''",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِىُّ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى - وَهُوَ ابْنُ الْحَارِثِ الْمُحَارِبِىُّ - عَنْ غَيْلاَنَ - وَهُوَ ابْنُ جَامِعٍ الْمُحَارِبِىُّ - عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ جَاءَ مَاعِزُ بْنُ مَالِكٍ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَقَالَ يَا رَسُولَ اللَّهِ طَهِّرْنِى. فَقَالَ « وَيْحَكَ ارْجِعْ فَاسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ ». قَالَ فَرَجَعَ غَيْرَ بَعِيدٍ ثُمَّ جَاءَ فَقَالَ يَا رَسُولَ اللَّهِ طَهِّرْنِى. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « وَيْحَكَ ارْجِعْ فَاسْتَغْفِرِ اللَّهَ وَتُبْ إِلَيْهِ ». قَالَ فَرَجَعَ غَيْرَ بَعِيدٍ ثُمَّ جَاءَ فَقَالَ يَا رَسُولَ اللَّهِ طَهِّرْنِى. فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- مِثْلَ ذَلِكَ حَتَّى إِذَا كَانَتِ الرَّابِعَةُ قَالَ لَهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « فِيمَ أُطَهِّرُكَ ». فَقَالَ مِنَ الزِّنَى. فَسَأَلَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَبِهِ جُنُونٌ ». فَأُخْبِرَ أَنَّهُ لَيْسَ بِمَجْنُونٍ. فَقَالَ « أَشَرِبَ خَمْرًا ». فَقَامَ رَجُلٌ فَاسْتَنْكَهَهُ فَلَمْ يَجِدْ مِنْهُ رِيحَ خَمْرٍ. قَالَ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَزَنَيْتَ ». فَقَالَ نَعَمْ. فَأَمَرَ بِهِ فَرُجِمَ فَكَانَ النَّاسُ فِيهِ فِرْقَتَيْنِ قَائِلٌ يَقُولُ لَقَدْ هَلَكَ لَقَدْ أَحَاطَتْ بِهِ خَطِيئَتُهُ وَقَائِلٌ يَقُولُ مَا تَوْبَةٌ أَفْضَلَ مِنْ تَوْبَةِ مَاعِزٍ أَنَّهُ جَاءَ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَوَضَعَ يَدَهُ فِى يَدِهِ ثُمَّ قَالَ اقْتُلْنِى بِالْحِجَارَةِ - قَالَ - فَلَبِثُوا بِذَلِكَ يَوْمَيْنِ أَوْ ثَلاَثَةً ثُمَّ جَاءَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَهُمْ جُلُوسٌ فَسَلَّمَ ثُمَّ جَلَسَ فَقَالَ « اسْتَغْفِرُوا لِمَاعِزِ بْنِ مَالِكٍ ». قَالَ فَقَالُوا غَفَرَ اللَّهُ لِمَاعِزِ بْنِ مَالِكٍ. - قَالَ - فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَقَدْ تَابَ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ أُمَّةٍ لَوَسِعَتْهُمْ ». قَالَ ثُمَّ جَاءَتْهُ امْرَأَةٌ مِنْ غَامِدٍ مِنَ الأَزْدِ فَقَالَتْ يَا رَسُولَ اللَّهِ طَهِّرْنِى. فَقَالَ « وَيْحَكِ ارْجِعِى فَاسْتَغْفِرِى اللَّهَ وَتُوبِى إِلَيْهِ ». فَقَالَتْ أَرَاكَ تُرِيدُ أَنْ تُرَدِّدَنِى كَمَا رَدَّدْتَ مَاعِزَ بْنَ مَالِكٍ. قَالَ « وَمَا ذَاكِ ». قَالَتْ إِنَّهَا حُبْلَى مِنَ الزِّنَا. فَقَالَ « آنْتِ ». قَالَتْ نَعَمْ. فَقَالَ لَهَا « حَتَّى تَضَعِى مَا فِى بَطْنِكِ ». قَالَ فَكَفَلَهَا رَجُلٌ مِنَ الأَنْصَارِ حَتَّى وَضَعَتْ قَالَ فَأَتَى النَّبِىَّ -صلى الله عليه وسلم- فَقَالَ قَدْ وَضَعَتِ الْغَامِدِيَّةُ. فَقَالَ « إِذًا لاَ نَرْجُمَهَا وَنَدَعَ وَلَدَهَا صَغِيرًا لَيْسَ لَهُ مَنْ يُرْضِعُهُ ». فَقَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ إِلَىَّ رَضَاعُهُ يَا نَبِىَّ اللَّهِ. قَالَ فَرَجَمَهَا."
            },
            {
                "hadithNo": "4432",
                "chapterNo": "5",
                "hadithEnglish": "'Abdullah bin Buraidah narrated from his father that Ma'iz bin Malik Al-Aslami came to the Messenger of Allah (s.a.w) and said: \"O Messenger of Allah, I have wronged myself and committed Zina, and I want you to purify me.'' But he turned him away. The next day he came to him and said: \"O Messenger of Allah, I have committed Zina;\" but he turned him away a second time, and the Messenger of Allah (s.a.w) sent word to his people saying: \"Do you know whether there is anything wrong with his mind?\" They said: \"All we know is that he is of sound mind, and he is one of our righteous men as far as we can tell.\" He came to him (s.a.w) a third time, and he sent word to them again asking them, and they told him: \"There is nothing wrong with him or his mind.\" When he came a fourth time, he had a pit dug for him then he ordered that he be stoned. Then the Ghamidi woman came and said: \"O Messenger of Allah, I have committed Zina, purify me;\" but he turned her away. The next day she said: \"O Messenger of Allah, why are you turning me away? Perhaps you are turning me away as you turned Ma'iz away. But by Allah, I am pregnant.\" He said: \"Then no (not now), go away until you give birth.\" When she gave birth, she brought the child to him wrapped in a cloth, and said: \"Here he is, I have given birth.\" He said: \"Go away and breastfeed him until he is weaned.\" When she had weaned him, she brought the boy to him, with a piece of bread in his hand and said: \"Here, O Prophet of Allah, I have weaned him, and he is eating food.\" He handed the boy over to one of the Muslim men, then he ordered that a pit be dug for her, up to her chest, and he ordered the people to stone her. Khalid bin AI-Walid came forward with a stone, which he flung at her head. The blood spurted onto Khalid's face and he cursed her. The Prophet of Allah (s.a.w) heard him cursing her and he said: \"Calm down, O Khalid! By the One in Whose Hand is my soul, she has repented in such a manner that if the Maks - collector repented like that, he would be forgiven.\" Then he ordered that the funeral prayer be offered for her, and she was buried.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ - وَتَقَارَبَا فِى لَفْظِ الْحَدِيثِ - حَدَّثَنَا أَبِى حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ مَاعِزَ بْنَ مَالِكٍ الأَسْلَمِىَّ أَتَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ يَا رَسُولَ اللَّهِ إِنِّى قَدْ ظَلَمْتُ نَفْسِى وَزَنَيْتُ وَإِنِّى أُرِيدُ أَنْ تُطَهِّرَنِى. فَرَدَّهُ فَلَمَّا كَانَ مِنَ الْغَدِ أَتَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّى قَدْ زَنَيْتُ. فَرَدَّهُ الثَّانِيَةَ فَأَرْسَلَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِلَى قَوْمِهِ فَقَالَ « أَتَعْلَمُونَ بِعَقْلِهِ بَأْسًا تُنْكِرُونَ مِنْهُ شَيْئًا ». فَقَالُوا مَا نَعْلَمُهُ إِلاَّ وَفِىَّ الْعَقْلِ مِنْ صَالِحِينَا فِيمَا نُرَى فَأَتَاهُ الثَّالِثَةَ فَأَرْسَلَ إِلَيْهِمْ أَيْضًا فَسَأَلَ عَنْهُ فَأَخْبَرُوهُ أَنَّهُ لاَ بَأْسَ بِهِ وَلاَ بِعَقْلِهِ فَلَمَّا كَانَ الرَّابِعَةَ حَفَرَ لَهُ حُفْرَةً ثُمَّ أَمَرَ بِهِ فَرُجِمَ. قَالَ فَجَاءَتِ الْغَامِدِيَّةُ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّى قَدْ زَنَيْتُ فَطَهِّرْنِى. وَإِنَّهُ رَدَّهَا فَلَمَّا كَانَ الْغَدُ قَالَتْ يَا رَسُولَ اللَّهِ لِمَ تَرُدُّنِى لَعَلَّكَ أَنْ تَرُدَّنِى كَمَا رَدَدْتَ مَاعِزًا فَوَاللَّهِ إِنِّى لَحُبْلَى. قَالَ « إِمَّا لاَ فَاذْهَبِى حَتَّى تَلِدِى ». فَلَمَّا وَلَدَتْ أَتَتْهُ بِالصَّبِىِّ فِى خِرْقَةٍ قَالَتْ هَذَا قَدْ وَلَدْتُهُ. قَالَ « اذْهَبِى فَأَرْضِعِيهِ حَتَّى تَفْطِمِيهِ ». فَلَمَّا فَطَمَتْهُ أَتَتْهُ بِالصَّبِىِّ فِى يَدِهِ كِسْرَةُ خُبْزٍ فَقَالَتْ هَذَا يَا نَبِىَّ اللَّهِ قَدْ فَطَمْتُهُ وَقَدْ أَكَلَ الطَّعَامَ. فَدَفَعَ الصَّبِىَّ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ ثُمَّ أَمَرَ بِهَا فَحُفِرَ لَهَا إِلَى صَدْرِهَا وَأَمَرَ النَّاسَ فَرَجَمُوهَا فَيُقْبِلُ خَالِدُ بْنُ الْوَلِيدِ بِحَجَرٍ فَرَمَى رَأْسَهَا فَتَنَضَّحَ الدَّمُ عَلَى وَجْهِ خَالِدٍ فَسَبَّهَا فَسَمِعَ نَبِىُّ اللَّهِ -صلى الله عليه وسلم- سَبَّهُ إِيَّاهَا فَقَالَ « مَهْلاً يَا خَالِدُ فَوَالَّذِى نَفْسِى بِيَدِهِ لَقَدْ تَابَتْ تَوْبَةً لَوْ تَابَهَا صَاحِبُ مَكْسٍ لَغُفِرَ لَهُ ». ثُمَّ أَمَرَ بِهَا فَصَلَّى عَلَيْهَا وَدُفِنَتْ."
            },
            {
                "hadithNo": "4433",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from 'Imran bin Husain that a woman from Juhainah came to the Prophet of Allah (s.a.w) and she was pregnant as the result of Zina. She said: O Prophet of Allah, I have done something that incurs a Hadd punishment, so carry it out on me. The Prophet of Allah (s.a.w) called her guardian and said: \"Treat her well, then when she has given birth, bring her to me.\" He did that, and the Prophet of Allah (s.a.w) ordered that her clothes be tied around her, then he ordered that she be stoned. Then he offered the funeral prayer for her, and 'Umar said to him: \"Will you offer the funeral prayer for her, O Prophet of Allah, when she has committed Zina?\" He said: \"She has repented in such a manner that if it were divided among seventy of the people of Al-Madinah, it would be sufficient for them. Have you seen any repentance better than that of one who sacrificed herself to Allah, Exalted is He?\"",
                "hadithArabic": "حَدَّثَنِى أَبُو غَسَّانَ مَالِكُ بْنُ عَبْدِ الْوَاحِدِ الْمِسْمَعِىُّ حَدَّثَنَا مُعَاذٌ - يَعْنِى ابْنَ هِشَامٍ - حَدَّثَنِى أَبِى عَنْ يَحْيَى بْنِ أَبِى كَثِيرٍ حَدَّثَنِى أَبُو قِلاَبَةَ أَنَّ أَبَا الْمُهَلَّبِ حَدَّثَهُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ امْرَأَةً مِنْ جُهَيْنَةَ أَتَتْ نَبِىَّ اللَّهِ -صلى الله عليه وسلم- وَهِىَ حُبْلَى مِنَ الزِّنَى فَقَالَتْ يَا نَبِىَّ اللَّهِ أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَىَّ فَدَعَا نَبِىُّ اللَّهِ -صلى الله عليه وسلم- وَلِيَّهَا فَقَالَ « أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ فَائْتِنِى بِهَا ». فَفَعَلَ فَأَمَرَ بِهَا نَبِىُّ اللَّهِ -صلى الله عليه وسلم- فَشُكَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ ثُمَّ صَلَّى عَلَيْهَا فَقَالَ لَهُ عُمَرُ تُصَلِّى عَلَيْهَا يَا نَبِىَّ اللَّهِ وَقَدْ زَنَتْ فَقَالَ « لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ تَوْبَةً أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ تَعَالَى »."
            },
            {
                "hadithNo": "4434",
                "chapterNo": "5",
                "hadithEnglish": "Yahya bin Abi Kathir narrated a similar report (as Hadith no. 4433) with this chain.",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا أَبَانٌ الْعَطَّارُ حَدَّثَنَا يَحْيَى بْنُ أَبِى كَثِيرٍ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "4435",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Hurairah and Zaid bin Khalid Al-Juhani said: \"A man from among the Bedouin came to the Messenger of Allah (s.a.w) and said: 'O Messenger of Allah, I adjure you by Allah to judge me according to the Book of Allah.' The second claimant - who was wiser than him - said: 'Yes, judge between us according to the Book of Allah, but let me speak.' The Messenger of Allah (s.a.w) said: 'Speak.' He said: 'My son was employed by this man, and he committed Zina with his wife. I was told that my son should be stoned, but I ransomed him for one hundred sheep and a slave girl. I asked the people of knowledge and they told me that my son should be given one hundred lashes and be exiled for one year, and that this man's wife should be stoned.' The Messenger of Allah (s.a.w) said: 'By the One in Whose Hand is my soul, I will judge between you according to the Book of Allah. The slave girl and the sheep should be given back, and your son should be given one hundred lashes and exiled for one year. Tomorrow, O Unais, go to the wife of this man, and if she admits it, then stone her.' \"The next day he went to her, and she admitted it, so the Messenger of Allah (s.a.w) ordered that she be stoned.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنِ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ أَبِى هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِىِّ أَنَّهُمَا قَالاَ إِنَّ رَجُلاً مِنَ الأَعْرَابِ أَتَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ يَا رَسُولَ اللَّهِ أَنْشُدُكَ اللَّهَ إِلاَّ قَضَيْتَ لِى بِكِتَابِ اللَّهِ. فَقَالَ الْخَصْمُ الآخَرُ وَهُوَ أَفْقَهُ مِنْهُ نَعَمْ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَائْذَنْ لِى. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « قُلْ ». قَالَ إِنَّ ابْنِى كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِامْرَأَتِهِ وَإِنِّى أُخْبِرْتُ أَنَّ عَلَى ابْنِى الرَّجْمَ فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَوَلِيدَةٍ فَسَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِى أَنَّمَا عَلَى ابْنِى جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَأَنَّ عَلَى امْرَأَةِ هَذَا الرَّجْمَ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « وَالَّذِى نَفْسِى بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ الْوَلِيدَةُ وَالْغَنَمُ رَدٌّ وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَاغْدُ يَا أُنَيْسُ إِلَى امْرَأَةِ هَذَا فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ». قَالَ فَغَدَا عَلَيْهَا فَاعْتَرَفَتْ فَأَمَرَ بِهَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَرُجِمَتْ."
            },
            {
                "hadithNo": "4436",
                "chapterNo": "5",
                "hadithEnglish": "A similar report (as no. 4435) was narrated from Az-Zuhri with this chain.",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ ح وَحَدَّثَنِى عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِى عَنْ صَالِحٍ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ كُلُّهُمْ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ. نَحْوَهُ."
            },
            {
                "hadithNo": "4437",
                "chapterNo": "6",
                "hadithEnglish": "'Abdullah bin 'Umar narrated that a Jewish man and Jewish woman who had committed Zina were brought to the Messenger of Allah (s.a.w). The Messenger of Allah (s.a.w) went to the Jews and said: \"What do you find in the Tawrat (Torah) about the one who commits Zina?\" They said: \"We make them sit backwards (on mounts) and parade them around.\" He said: \"Bring the Tawrat (Torah) if you are telling the truth.\" They brought it and read it, and when they reached the Verse of stoning, the person who was reading placed his hand over the Verse of stoning and read that which came before it and that which came after it. 'Abdullah bin Salam - who was with the Messenger of Allah (s.a.w) - said to him: \"Tell him to lift- his hand\" so he lifted it, and there beneath it was the Verse of stoning. So the Messenger of Allah (s.a.w) ordered that they be stoned.\" - \"'Abdullah bin 'Umar said: 'I was among those who stoned them, and I saw him shielding her from the stones with his body.\"'",
                "hadithArabic": "حَدَّثَنِى الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ أَخْبَرَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- أُتِىَ بِيَهُودِىٍّ وَيَهُودِيَّةٍ قَدْ زَنَيَا فَانْطَلَقَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- حَتَّى جَاءَ يَهُودَ فَقَالَ « مَا تَجِدُونَ فِى التَّوْرَاةِ عَلَى مَنْ زَنَى ». قَالُوا نُسَوِّدُ وُجُوهَهُمَا وَنُحَمِّلُهُمَا وَنُخَالِفُ بَيْنَ وُجُوهِهِمَا وَيُطَافُ بِهِمَا. قَالَ « فَأْتُوا بِالتَّوْرَاةِ إِنْ كُنْتُمْ صَادِقِينَ ». فَجَاءُوا بِهَا فَقَرَءُوهَا حَتَّى إِذَا مَرُّوا بِآيَةِ الرَّجْمِ وَضَعَ الْفَتَى الَّذِى يَقْرَأُ يَدَهُ عَلَى آيَةِ الرَّجْمِ وَقَرَأَ مَا بَيْنَ يَدَيْهَا وَمَا وَرَاءَهَا فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ سَلاَمٍ وَهْوَ مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- مُرْهُ فَلْيَرْفَعْ يَدَهُ فَرَفَعَهَا فَإِذَا تَحْتَهَا آيَةُ الرَّجْمِ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَرُجِمَا. قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ كُنْتُ فِيمَنْ رَجَمَهُمَا فَلَقَدْ رَأَيْتُهُ يَقِيهَا مِنَ الْحِجَارَةِ بِنَفْسِهِ."
            },
            {
                "hadithNo": "4438",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Messenger of Allah (s.a.w) stoned two Jews, a man and a woman for Zina. The Jews brought the to the Messenger of Allah (s.a.w)... and he quoted a similar Hadith (as no. 4437).",
                "hadithArabic": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَاعِيلُ - يَعْنِى ابْنَ عُلَيَّةَ - عَنْ أَيُّوبَ ح وَحَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِى رِجَالٌ مِنْ أَهْلِ الْعِلْمِ مِنْهُمْ مَالِكُ بْنُ أَنَسٍ أَنَّ نَافِعًا أَخْبَرَهُمْ عَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- رَجَمَ فِى الزِّنَى يَهُودِيَّيْنِ رَجُلاً وَامْرَأَةً زَنَيَا فَأَتَتِ الْيَهُودُ إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- بِهِمَا. وَسَاقُوا الْحَدِيثَ بِنَحْوِهِ."
            },
            {
                "hadithNo": "4439",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Jews brought a man - of their own people - and a woman who had committed Zina, to the Messenger of Allah (s.a.w)... and he quoted a Hadith like that of 'Ubaidullah from Nafi' (no. 4437).",
                "hadithArabic": "وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّ الْيَهُودَ جَاءُوا إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- بِرَجُلٍ مِنْهُمْ وَامْرَأَةٍ قَدْ زَنَيَا. وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ."
            },
            {
                "hadithNo": "4440",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Al-Bara' bin 'Azib said: A Jew whose face had been blackened and who had been whipped passed by the Messenger of Allah (s.a.w). He called them and said: \"Is this how you find the punishment for Zina in your Book?\" They said: \"Yes.\" He called one of their scholars and said: \"I adjure you by Allah Who sent down the Tawrat (Torah) to Musa, is this how you find the punishment for Zina in your Book?\" He said: \"No. Had you not adjured me (by Allah), I would not have told you. We find (that the punishment) is stoning, but it became common among our nobles, so, if we caught a noble we would let him go, but if we caught a lowly person we would carry out the punishment on him. We said: Come, let us agree on something that we can impose on noble and lowly alike. So we made (the punishment of) blackening of the face and whipping instead of stoning.\" The Messenger of Allah (s.a.w) said: \"O Allah, I am the first to revive Your command which they had made dead.\" Then he (s.a.w) ordered that he be stoned, and Allah revealed: \"O Messenger! Let not those who hurry to fall into disbelief grieve you... If you are given this, take it...\" (Al-Ma'idah 5:41). He (the Jew) said: Go to Muhammad (s.a.w), and if he orders you to blacken the face and whip him, then accept it, but if he tells you to stone him, then beware. Then Allah revealed the words: \"And whosoever does not judge by what Allah has revealed, such are the disbelievers (Al-Ma'idah 5:44 ), \"...And whosoever does not judge by that which Allah has revealed, such are the wrongdoers (Al-Ma'idah 5:45), \"And whosoever does not judge by what Allah has revealed (then) such (people) are the rebellious to Allah\" (Al-Ma'idah 5:47), all concerning the disbelievers.",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ كِلاَهُمَا عَنْ أَبِى مُعَاوِيَةَ قَالَ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنِ الْبَرَاءِ بْنِ عَازِبٍ قَالَ مُرَّ عَلَى النَّبِىِّ -صلى الله عليه وسلم- بِيَهُودِىٍّ مُحَمَّمًا مَجْلُودًا فَدَعَاهُمْ -صلى الله عليه وسلم- فَقَالَ « هَكَذَا تَجِدُونَ حَدَّ الزَّانِى فِى كِتَابِكُمْ ». قَالُوا نَعَمْ. فَدَعَا رَجُلاً مِنْ عُلَمَائِهِمْ فَقَالَ « أَنْشُدُكَ بِاللَّهِ الَّذِى أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى أَهَكَذَا تَجِدُونَ حَدَّ الزَّانِى فِى كِتَابِكُمْ ». قَالَ لاَ وَلَوْلاَ أَنَّكَ نَشَدْتَنِى بِهَذَا لَمْ أُخْبِرْكَ نَجِدُهُ الرَّجْمَ وَلَكِنَّهُ كَثُرَ فِى أَشْرَافِنَا فَكُنَّا إِذَا أَخَذْنَا الشَّرِيفَ تَرَكْنَاهُ وَإِذَا أَخَذْنَا الضَّعِيفَ أَقَمْنَا عَلَيْهِ الْحَدَّ قُلْنَا تَعَالَوْا فَلْنَجْتَمِعْ عَلَى شَىْءٍ نُقِيمُهُ عَلَى الشَّرِيفِ وَالْوَضِيعِ فَجَعَلْنَا التَّحْمِيمَ وَالْجَلْدَ مَكَانَ الرَّجْمِ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « اللَّهُمَّ إِنِّى أَوَّلُ مَنْ أَحْيَا أَمْرَكَ إِذْ أَمَاتُوهُ ». فَأَمَرَ بِهِ فَرُجِمَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ (يَا أَيُّهَا الرَّسُولُ لاَ يَحْزُنْكَ الَّذِينَ يُسَارِعُونَ فِى الْكُفْرِ) إِلَى قَوْلِهِ (إِنْ أُوتِيتُمْ هَذَا فَخُذُوهُ) يَقُولُ ائْتُوا مُحَمَّدًا -صلى الله عليه وسلم- فَإِنْ أَمَرَكُمْ بِالتَّحْمِيمِ وَالْجَلْدِ فَخُذُوهُ وَإِنْ أَفْتَاكُمْ بِالرَّجْمِ فَاحْذَرُوا. فَأَنْزَلَ اللَّهُ تَعَالَى (وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْكَافِرُونَ) (وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الظَّالِمُونَ) ( وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْفَاسِقُونَ) فِى الْكُفَّارِ كُلُّهَا."
            },
            {
                "hadithNo": "4441",
                "chapterNo": "6",
                "hadithEnglish": "Al-A'mash narrated a similar Hadith (as no. 4440) with this chain, as far as the words: \"Then the Prophet (s.a.w) ordered that he be stoned,\" and he did not mention what comes after that about the revelation of the Verse.",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الأَعْمَشُ بِهَذَا الإِسْنَادِ. نَحْوَهُ إِلَى قَوْلِهِ فَأَمَرَ بِهِ النَّبِىُّ -صلى الله عليه وسلم- فَرُجِمَ. وَلَمْ يَذْكُرْ مَا بَعْدَهُ مِنْ نُزُولِ الآيَةِ."
            },
            {
                "hadithNo": "4442",
                "chapterNo": "6",
                "hadithEnglish": "Jabir bin 'Abdullah said: The Prophet (s.a.w) stoned a man from Aslam, and a Jewish man and his wife.",
                "hadithArabic": "وَحَدَّثَنِى هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِى أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ رَجَمَ النَّبِىُّ -صلى الله عليه وسلم- رَجُلاً مِنْ أَسْلَمَ وَرَجُلاً مِنَ الْيَهُودِ وَامْرَأَتَهُ."
            },
            {
                "hadithNo": "4443",
                "chapterNo": "6",
                "hadithEnglish": "Ibn Juraij narrated a similar report (as no. 4442) with this chain, except that he said: \"And a woman.\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ بِهَذَا الإِسْنَادِ مِثْلَهُ. غَيْرَ أَنَّهُ قَالَ وَامْرَأَةً."
            },
            {
                "hadithNo": "4444",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Ishaq Ash-Shaibani said: \"I asked 'Abdullah bin Abi Awfa: 'Did the Messenger of Allah (s.a.w) stone anyone?' He said: 'Yes.' I said: Was that after the Verse in Surat An-Nur or before it? 'He said:' I do not know.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِىُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِىُّ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِى أَوْفَى ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَلِىُّ بْنُ مُسْهِرٍ عَنْ أَبِى إِسْحَاقَ الشَّيْبَانِىِّ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِى أَوْفَى هَلْ رَجَمَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- قَالَ نَعَمْ. قَالَ قُلْتُ بَعْدَ مَا أُنْزِلَتْ سُورَةُ النُّورِ أَمْ قَبْلَهَا قَالَ لاَ أَدْرِى."
            },
            {
                "hadithNo": "4445",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"I heard the Messenger of Allah (s.a.w) say: 'If the slave woman of one of you commits Zina and it becomes clear, then carry out the Hadd punishment of whipping on her, but do not rebuke her. Then if she commits Zina (a second time) and it becomes clear, then carry out the Hadd punishment of whipping on her, but do not rebuke her. Then if she commits Zina a third time, and it becomes clear, sell her, even for a rope of hair.\"'",
                "hadithArabic": "وَحَدَّثَنِى عِيسَى بْنُ حَمَّادٍ الْمِصْرِىُّ أَخْبَرَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِى سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ أَنَّهُ سَمِعَهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ فَتَبَيَّنَ زِنَاهَا فَلْيَجْلِدْهَا الْحَدَّ وَلاَ يُثَرِّبْ عَلَيْهَا ثُمَّ إِنْ زَنَتْ فَلْيَجْلِدْهَا الْحَدَّ وَلاَ يُثَرِّبْ عَلَيْهَا ثُمَّ إِنْ زَنَتِ الثَّالِثَةَ فَتَبَيَّنَ زِنَاهَا فَلْيَبِعْهَا وَلَوْ بِحَبْلٍ مِنْ شَعَرٍ »."
            },
            {
                "hadithNo": "4446",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from the Prophet (s.a.w) concerning the whipping of a slave woman (a Hadith similar to no. 4445) if she commits Zina three times: \"Then let him sell her the fourth time.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِىُّ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ كِلاَهُمَا عَنْ أَيُّوبَ بْنِ مُوسَى ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَابْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ ح وَحَدَّثَنِى هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِى أُسَامَةُ بْنُ زَيْدٍ ح وَحَدَّثَنَا هَنَّادُ بْنُ السَّرِىِّ وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ عَنْ عَبْدَةَ بْنِ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ كُلُّ هَؤُلاَءِ عَنْ سَعِيدٍ الْمَقْبُرِىِّ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- إِلاَّ أَنَّ ابْنَ إِسْحَاقَ قَالَ فِى حَدِيثِهِ عَنْ سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- فِى جَلْدِ الأَمَةِ إِذَا زَنَتْ ثَلاَثًا « ثُمَّ لْيَبِعْهَا فِى الرَّابِعَةِ »."
            },
            {
                "hadithNo": "4447",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) was asked about a slave woman who commits Zina and is not married. He said: \"If she commits Zina, whip her; then if she commits Zina (again), whip her; then if she commits Zina, whip her, then sell her, even if it is for a rope.\" Ibn Shihab said: I do not know whether it (the selling) was after the third time or the fourth.",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِىُّ حَدَّثَنَا مَالِكٌ ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- سُئِلَ عَنِ الأَمَةِ إِذَا زَنَتْ وَلَمْ تُحْصِنْ قَالَ « إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ بِيعُوهَا وَلَوْ بِضَفِيرٍ ». قَالَ ابْنُ شِهَابٍ لاَ أَدْرِى أَبَعْدَ الثَّالِثَةِ أَوِ الرَّابِعَةِ. وَقَالَ الْقَعْنَبِىُّ فِى رِوَايَتِهِ قَالَ ابْنُ شِهَابٍ وَالضَّفِيرُ الْحَبْلُ."
            },
            {
                "hadithNo": "4448",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Abu Hurairah and Zaid bin Khalid Al-Juhani that the Messenger of Allah (s.a.w) was asked about a slave woman... a similar report (as no. 4447).",
                "hadithArabic": "وَحَدَّثَنَا أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ مَالِكًا يَقُولُ حَدَّثَنِى ابْنُ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِى هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِىِّ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- سُئِلَ عَنِ الأَمَةِ. بِمِثْلِ حَدِيثِهِمَا وَلَمْ يَذْكُرْ قَوْلَ ابْنِ شِهَابٍ وَالضَّفِيرُ الْحَبْلُ."
            },
            {
                "hadithNo": "4449",
                "chapterNo": "6",
                "hadithEnglish": "A Hadith like that of Malik (no. 4448) was narrated from Abu Hurairah and Zaid bin Khalid Al-Juhani from the Prophet (s.a.w). The uncertainty as to whether she is to be sold after the third time or the fourth appears in all the reports.",
                "hadithArabic": "حَدَّثَنِى عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنِى أَبِى عَنْ صَالِحٍ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كِلاَهُمَا عَنِ الزُّهْرِىِّ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِى هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِىِّ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمِثْلِ حَدِيثِ مَالِكٍ وَالشَّكُّ فِى حَدِيثِهِمَا جَمِيعًا فِى بَيْعِهَا فِى الثَّالِثَةِ أَوِ الرَّابِعَةِ."
            },
            {
                "hadithNo": "4450",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Abu 'Abdur-Rahman said: \" 'Ali (may Allah honor his face) gave a speech and said: 'O people, carry out the Hadd punishments on your slaves, those who are married and those who are not married. A slave woman of the Messenger of Allah (s.a.w) committed Zina, and he told me to whip her, but she had recently given birth, and I was afraid that if I whipped her, I would kill her. I mentioned that to the Prophet (s.a.w) and he said: You have done well.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِى بَكْرٍ الْمُقَدَّمِىُّ حَدَّثَنَا سُلَيْمَانُ أَبُو دَاوُدَ حَدَّثَنَا زَائِدَةُ عَنِ السُّدِّىِّ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ أَبِى عَبْدِ الرَّحْمَنِ قَالَ خَطَبَ عَلِىٌّ فَقَالَ يَا أَيُّهَا النَّاسُ أَقِيمُوا عَلَى أَرِقَّائِكُمُ الْحَدَّ مَنْ أَحْصَنَ مِنْهُمْ وَمَنْ لَمْ يُحْصِنْ فَإِنَّ أَمَةً لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- زَنَتْ فَأَمَرَنِى أَنْ أَجْلِدَهَا فَإِذَا هِىَ حَدِيثُ عَهْدٍ بِنِفَاسٍ فَخَشِيتُ إِنْ أَنَا جَلَدْتُهَا أَنْ أَقْتُلَهَا فَذَكَرْتُ ذَلِكَ لِلنَّبِىِّ -صلى الله عليه وسلم- فَقَالَ « أَحْسَنْتَ »."
            },
            {
                "hadithNo": "4451",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from As-Suddi with this chain (a similar Hadith as no. 4450), but he did not mention: \"Those who are married and those who are not married.\" And he added in the Hadith: \"Leave her until she recovers.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا إِسْرَائِيلُ عَنِ السُّدِّىِّ بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ مَنْ أَحْصَنَ مِنْهُمْ وَمَنْ لَمْ يُحْصِنْ. وَزَادَ فِى الْحَدِيثِ « اتْرُكْهَا حَتَّى تَمَاثَلَ »."
            },
            {
                "hadithNo": "4452",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Anas bin Malik that a man who had drunk wine was brought to the Prophet (s.a.w) and he whipped him with two palm branches approximately forty times. He said: \"And Abu Bakr did that, but when 'Umar was caliph he consulted the people and 'Abdur-Rahman said: 'The least of the Hadd punishments is eighty,' so 'Umar enjoined that.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- أُتِىَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَجَلَدَهُ بِجَرِيدَتَيْنِ نَحْوَ أَرْبَعِينَ. قَالَ وَفَعَلَهُ أَبُو بَكْرٍ فَلَمَّا كَانَ عُمَرُ اسْتَشَارَ النَّاسَ فَقَالَ عَبْدُ الرَّحْمَنِ أَخَفَّ الْحُدُودِ ثَمَانِينَ. فَأَمَرَ بِهِ عُمَرُ."
            },
            {
                "hadithNo": "4453",
                "chapterNo": "8",
                "hadithEnglish": "Qatadah said: I heard Anas say: A man was brought to the Prophet (s.a.w)... and he mentioned a similar report (as no. 4452).\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِىُّ حَدَّثَنَا خَالِدٌ - يَعْنِى ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ حَدَّثَنَا قَتَادَةُ قَالَ سَمِعْتُ أَنَسًا يَقُولُ أُتِىَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- بِرَجُلٍ. فَذَكَرَ نَحْوَهُ."
            },
            {
                "hadithNo": "4454",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Anas bin Malik that the Prophet of Allah (s.a.w) whipped people for drinking wine with palm branches and shoes, then Abu Bakr ordered that forty lashes be given, but when 'Umar was caliph, the people drew near to countryside and cities. He said: \"What do you think about whipping for drinking wine?\" 'Abdur-Rahman bin 'Awf said: \"I think you should make it like the lightest of the If add punishments\" so 'Umar ordered that eighty lashes be given.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِى أَبِى عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ نَبِىَّ اللَّهِ -صلى الله عليه وسلم- جَلَدَ فِى الْخَمْرِ بِالْجَرِيدِ وَالنِّعَالِ ثُمَّ جَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ. فَلَمَّا كَانَ عُمَرُ وَدَنَا النَّاسُ مِنَ الرِّيفِ وَالْقُرَى قَالَ مَا تَرَوْنَ فِى جَلْدِ الْخَمْرِ فَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَرَى أَنْ تَجْعَلَهَا كَأَخَفِّ الْحُدُودِ. قَالَ فَجَلَدَ عُمَرُ ثَمَانِينَ."
            },
            {
                "hadithNo": "4455",
                "chapterNo": "8",
                "hadithEnglish": "Hisham narrated a similar report (as no. 4454) with this chain.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا هِشَامٌ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "4456",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Anas that the Prophet (s.a.w) used to give forty lashes with palm branches and shoes for (drinking) wine; then he mentioned a similar Hadith (as no. 4454), but he did not mention countryside and cities.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- كَانَ يَضْرِبُ فِى الْخَمْرِ بِالنِّعَالِ وَالْجَرِيدِ أَرْبَعِينَ. ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمَا وَلَمْ يَذْكُرِ الرِّيفَ وَالْقُرَى."
            },
            {
                "hadithNo": "4457",
                "chapterNo": "8",
                "hadithEnglish": "Hudayn bin Al-Mundhir Abu Sasan said: \"I saw when Al-Walid was brought to 'Uthman bin 'Affan after he had led two Rak'ah of Fajr prayer and then said: 'Shall I lead you in further prayers?' Two men bore witness against him. One of them was Humran, who said that he had drunk wine, and the other testified that he had seen him vomiting. 'Uthman said: 'He would not have vomited unless he drank it.' He said: 'O 'Ali, get up and whip him.' 'Ali said: 'O Hasan, get up and whip him. Al-Hasan said: 'Let those who are enjoying the position of leadership carry out the punishment.' It was as if he ('Ali) got upset with him and he said: 'Get up, O 'Abdullah bin Ja'far! Get up and whip him.' So he whipped him, and 'Ali counted until he had reached forty, then he said: 'Stop.' Then he said: 'The Prophet (s.a.w) gave forty lashes, and Abu Bakr gave forty, and 'Umar gave eighty. All are Sunnah but this is dearer to me.\"'",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَعَلِىُّ بْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ - وَهُوَ ابْنُ عُلَيَّةَ - عَنِ ابْنِ أَبِى عَرُوبَةَ عَنْ عَبْدِ اللَّهِ الدَّانَاجِ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِىُّ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ فَيْرُوزَ مَوْلَى ابْنِ عَامِرٍ الدَّانَاجِ حَدَّثَنَا حُضَيْنُ بْنُ الْمُنْذِرِ أَبُو سَاسَانَ قَالَ شَهِدْتُ عُثْمَانَ بْنَ عَفَّانَ وَأُتِىَ بِالْوَلِيدِ قَدْ صَلَّى الصُّبْحَ رَكْعَتَيْنِ ثُمَّ قَالَ أَزِيدُكُمْ فَشَهِدَ عَلَيْهِ رَجُلاَنِ أَحَدُهُمَا حُمْرَانُ أَنَّهُ شَرِبَ الْخَمْرَ وَشَهِدَ آخَرُ أَنَّهُ رَآهُ يَتَقَيَّأُ فَقَالَ عُثْمَانُ إِنَّهُ لَمْ يَتَقَيَّأْ حَتَّى شَرِبَهَا فَقَالَ يَا عَلِىُّ قُمْ فَاجْلِدْهُ. فَقَالَ عَلِىٌّ قُمْ يَا حَسَنُ فَاجْلِدْهُ. فَقَالَ الْحَسَنُ وَلِّ حَارَّهَا مَنْ تَوَلَّى قَارَّهَا - فَكَأَنَّهُ وَجَدَ عَلَيْهِ - فَقَالَ يَا عَبْدَ اللَّهِ بْنَ جَعْفَرٍ قُمْ فَاجْلِدْهُ. فَجَلَدَهُ وَعَلِىٌّ يَعُدُّ حَتَّى بَلَغَ أَرْبَعِينَ فَقَالَ أَمْسِكْ. ثُمَّ قَالَ جَلَدَ النَّبِىُّ -صلى الله عليه وسلم- أَرْبَعِينَ وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ وَعُمَرُ ثَمَانِينَ وَكُلٌّ سُنَّةٌ وَهَذَا أَحَبُّ إِلَىَّ. زَادَ عَلِىُّ بْنُ حُجْرٍ فِى رِوَايَتِهِ قَالَ إِسْمَاعِيلُ وَقَدْ سَمِعْتُ حَدِيثَ الدَّانَاجِ مِنْهُ فَلَمْ أَحْفَظْهُ."
            },
            {
                "hadithNo": "4458",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that 'Ali said: \"I did not carry out any Hadd punishment on a person who died as a result, but I did not mind, except in the case of one who had drunk wine, because if he died I would pay the Diyah, because the Messenger of Allah (s.a.w) did not specify any number.\"",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سُفْيَانُ الثَّوْرِىُّ عَنْ أَبِى حَصِينٍ عَنْ عُمَيْرِ بْنِ سَعِيدٍ عَنْ عَلِىٍّ قَالَ مَا كُنْتُ أُقِيمُ عَلَى أَحَدٍ حَدًّا فَيَمُوتَ فِيهِ فَأَجِدَ مِنْهُ فِى نَفْسِى إِلاَّ صَاحِبَ الْخَمْرِ لأَنَّهُ إِنْ مَاتَ وَدَيْتُهُ لأَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- لَمْ يَسُنَّهُ."
            },
            {
                "hadithNo": "4459",
                "chapterNo": "8",
                "hadithEnglish": "Sufyan narrated a similar report (as no. 4458), with this chain.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "4460",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from Abu Burdah Al-Ansari that he heard the Messenger of Allah (s.a.w) say: \"No one should be given more than ten lashes except in the case of one of the Hadd punishments prescribed by Allah.\"",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى عَمْرٌو عَنْ بُكَيْرِ بْنِ الأَشَجِّ قَالَ بَيْنَا نَحْنُ عِنْدَ سُلَيْمَانَ بْنِ يَسَارٍ إِذْ جَاءَهُ عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ فَحَدَّثَهُ فَأَقْبَلَ عَلَيْنَا سُلَيْمَانُ فَقَالَ حَدَّثَنِى عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ عَنْ أَبِيهِ عَنْ أَبِى بُرْدَةَ الأَنْصَارِىِّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « لاَ يُجْلَدُ أَحَدٌ فَوْقَ عَشَرَةِ أَسْوَاطٍ إِلاَّ فِى حَدٍّ مِنْ حُدُودِ اللَّهِ »."
            },
            {
                "hadithNo": "4461",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that 'Ubadah bin As-Samit said: \"We were with the Messenger of Allah (s.a.w) in a gathering, and he said: 'Swear allegiance to me, pledging that you will not associate anything with Allah, you will not commit Zina, you will not steal and you will not kill any soul whom Allah has forbidden killing except in cases dictated by (Islamic) law. Whoever among you fulfills that, his reward will be with Allah, and whoever does any of those things and is punished for it, that will be an expiation for him. Whoever does any of those things and Allah conceals him, his case will rest with Allah: if He wills He will forgive him and if He wills He will punish him.'\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ نُمَيْرٍ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ - وَاللَّفْظُ لِعَمْرٍو قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِىِّ عَنْ أَبِى إِدْرِيسَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فِى مَجْلِسٍ فَقَالَ « تُبَايِعُونِى عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَزْنُوا وَلاَ تَسْرِقُوا وَلاَ تَقْتُلُوا النَّفْسَ الَّتِى حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ شَيْئًا مِنْ ذَلِكَ فَعُوقِبَ بِهِ فَهُوَ كَفَّارَةٌ لَهُ وَمَنْ أَصَابَ شَيْئًا مِنْ ذَلِكَ فَسَتَرَهُ اللَّهُ عَلَيْهِ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ عَفَا عَنْهُ وَإِنْ شَاءَ عَذَّبَهُ »."
            },
            {
                "hadithNo": "4462",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated from Az-Zuhri with this chain (a Hadith similar to no. 4461). He added in the Hadith: \"And he recited to us the Verse of (Surat) An-Nisa': '... That they will not associate anything in worship with Allah...\" (Al-Mumtahanah 60:12).",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ وَزَادَ فِى الْحَدِيثِ فَتَلاَ عَلَيْنَا آيَةَ النِّسَاءِ (أَنْ لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا) الآيَةَ."
            },
            {
                "hadithNo": "4463",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that 'Ubadah bin As-Samit said: \"The Messenger of Allah (s.a.w) took a pledge from us as he took from the women: That we would not associate anything in worship with Allah, we would not steal, we would not commit Zina, we would not kill our children and we would not slander one another. (The Messenger of Allah (s.a.w) would say:) among you fulfills that, his reward is with Allah, and whoever among you does any of these things and is punished for it, that will be his expiation. If Allah conceals anyone, his case will rest with Allah: if He wills He will punish him and if He wills He will forgive him.\"'",
                "hadithArabic": "وَحَدَّثَنِى إِسْمَاعِيلُ بْنُ سَالِمٍ أَخْبَرَنَا هُشَيْمٌ أَخْبَرَنَا خَالِدٌ عَنْ أَبِى قِلاَبَةَ عَنْ أَبِى الأَشْعَثِ الصَّنْعَانِىِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ أَخَذَ عَلَيْنَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- كَمَا أَخَذَ عَلَى النِّسَاءِ أَنْ لاَ نُشْرِكَ بِاللَّهِ شَيْئًا وَلاَ نَسْرِقَ وَلاَ نَزْنِىَ وَلاَ نَقْتُلَ أَوْلاَدَنَا وَلاَ يَعْضَهَ بَعْضُنَا بَعْضًا « فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَتَى مِنْكُمْ حَدًّا فَأُقِيمَ عَلَيْهِ فَهُوَ كَفَّارَتُهُ وَمَنْ سَتَرَهُ اللَّهُ عَلَيْهِ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ »."
            },
            {
                "hadithNo": "4464",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that 'Ubadah bin As-Samit said: I am one of the leaders who swore allegiance to the Messenger of Allah (s.a.w). He said: \"We swore allegiance to him, pledging that we would not associate anything in worship with Allah, we would not commit Zina, we would not steal, we would not kill any soul whom Allah has forbidden killing except in cases dictated by (Islamic) law, we would not plunder and we would not disobey. Paradise (would be ours) if we did that, but if we committed any of these actions then the judgment would be decided by Allah, exalted and glorified is He.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِى حَبِيبٍ عَنْ أَبِى الْخَيْرِ عَنِ الصُّنَابِحِىِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّهُ قَالَ إِنِّى لَمِنَ النُّقَبَاءِ الَّذِينَ بَايَعُوا رَسُولَ اللَّهِ -صلى الله عليه وسلم- وَقَالَ بَايَعْنَاهُ عَلَى أَنْ لاَ نُشْرِكَ بِاللَّهِ شَيْئًا وَلاَ نَزْنِىَ وَلاَ نَسْرِقَ وَلاَ نَقْتُلَ النَّفْسَ الَّتِى حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ وَلاَ نَنْتَهِبَ وَلاَ نَعْصِىَ فَالْجَنَّةُ إِنْ فَعَلْنَا ذَلِكَ فَإِنْ غَشِينَا مِنْ ذَلِكَ شَيْئًا كَانَ قَضَاءُ ذَلِكَ إِلَى اللَّهِ. وَقَالَ ابْنُ رُمْحٍ كَانَ قَضَاؤُهُ إِلَى اللَّهِ."
            },
            {
                "hadithNo": "4465",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"There is no Diyah for injuries caused by animals. There is no Diyah for injuries caused by falling into a well. There is no Diyah for injuries suffered when working in a mine. And the Khums is due on buried treasure.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالاَ أَخْبَرَنَا اللَّيْثُ ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنِ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِى سَلَمَةَ عَنْ أَبِى هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- أَنَّهُ قَالَ « الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِى الرِّكَازِ الْخُمْسُ »."
            },
            {
                "hadithNo": "4466",
                "chapterNo": "11",
                "hadithEnglish": "A similar Hadith (as no. 4465) was narrated from Az-Zuhri with the chain of Al-Laith.",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَعَبْدُ الأَعْلَى بْنُ حَمَّادٍ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا إِسْحَاقُ - يَعْنِى ابْنَ عِيسَى - حَدَّثَنَا مَالِكٌ كِلاَهُمَا عَنِ الزُّهْرِىِّ بِإِسْنَادِ اللَّيْثِ. مِثْلَ حَدِيثِهِ."
            },
            {
                "hadithNo": "4467",
                "chapterNo": "11",
                "hadithEnglish": "A similar report (as no. 4465) was narrated from Abu Hurairah, from the Messenger of Allah (s.a.w).",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ عَنِ ابْنِ الْمُسَيَّبِ وَعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِى هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- بِمِثْلِهِ."
            },
            {
                "hadithNo": "4468",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"There is no Diyah for injuries caused by falling into a well. There is no Diyah for injuries suffered when working in a mine. There is no Diyah for injuries caused by an animal. And the Khums is due on buried treasure.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ أَخْبَرَنَا اللَّيْثُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنِ الأَسْوَدِ بْنِ الْعَلاَءِ عَنْ أَبِى سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِى هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- أَنَّهُ قَالَ « الْبِئْرُ جَرْحُهَا جُبَارٌ وَالْمَعْدِنُ جَرْحُهُ جُبَارٌ وَالْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَفِى الرِّكَازِ الْخُمْسُ »."
            },
            {
                "hadithNo": "4469",
                "chapterNo": "11",
                "hadithEnglish": "A similar report (as no. 4468) was narrated from Abu Hurairah from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلاَّمٍ الْجُمَحِىُّ حَدَّثَنَا الرَّبِيعُ يَعْنِى ابْنَ مُسْلِمٍ ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالاَ حَدَّثَنَا شُعْبَةُ كِلاَهُمَا عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمِثْلِهِ."
            }
        ]
    }
]