[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "28",
        "bookName": "Book of Oaths and Blood Money etc.",
        "bookNameArabic": "كتاب القسامة والمحاربين والقصاص والديات",
        "hadiths": [
            {
                "hadithNo": "4342",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Sahl bin Abi Hathmah - Yahya said: \"I think he said: 'And from Rafi' bin Khadij\"' - that they said: \"'Abdullah bin Sahl bin Zaid and Muhaisah bin Mas'ud bin Zaid went out, and when they were in Khaibar they parted. Then Muhaisah found 'Abdullah bin Sahl slain, so he buried him. Then he came to the Messenger of Allah (s.a.w) along with Huwaisah bin Mas'ud and 'Abdur-Rahman bin Sahl, who was the youngest of the people. 'Abdur-Rahman began to speak before his two companions, and the Messenger of Allah (s.a.w) said to him: 'Let the eldest speak.' So he fell silent and his two companions spoke, and he spoke with them. They told the Messenger of Allah (s.a.w) about the killing of 'Abdullah bin Sahl, and he said to them: 'Will you swear fifty times so that you may be entitled to (blood money) for your companion?' They said: 'How can we swear when we did not witness (what happened)?' He said: 'Then let the Jews swear fifty oaths that they are innocent.' They said: 'How can we accept the oaths of a disbelieving people?' When the Messenger of Allah (s.a.w) saw that, he paid the blood money himself.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ يَحْيَى - وَهُوَ ابْنُ سَعِيدٍ - عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِى حَثْمَةَ - قَالَ يَحْيَى وَحَسِبْتُ قَالَ - وَعَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّهُمَا قَالاَ خَرَجَ عَبْدُ اللَّهِ بْنُ سَهْلِ بْنِ زَيْدٍ وَمُحَيِّصَةُ بْنُ مَسْعُودِ بْنِ زَيْدٍ حَتَّى إِذَا كَانَا بِخَيْبَرَ تَفَرَّقَا فِى بَعْضِ مَا هُنَالِكَ ثُمَّ إِذَا مُحَيِّصَةُ يَجِدُ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَتِيلاً فَدَفَنَهُ ثُمَّ أَقْبَلَ إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- هُوَ وَحُوَيِّصَةُ بْنُ مَسْعُودٍ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَكَانَ أَصْغَرَ الْقَوْمِ فَذَهَبَ عَبْدُ الرَّحْمَنِ لِيَتَكَلَّمَ قَبْلَ صَاحِبَيْهِ فَقَالَ لَهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « كَبِّرِ ». الْكُبْرَ فِى السِّنِّ فَصَمَتَ فَتَكَلَّمَ صَاحِبَاهُ وَتَكَلَّمَ مَعَهُمَا فَذَكَرُوا لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- مَقْتَلَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ « أَتَحْلِفُونَ خَمْسِينَ يَمِينًا فَتَسْتَحِقُّونَ صَاحِبَكُمْ ». أَوْ « قَاتِلَكُمْ ». قَالُوا وَكَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ قَالَ « فَتُبْرِئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا ». قَالُوا وَكَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَلَمَّا رَأَى ذَلِكَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَعْطَى عَقْلَهُ."
            },
            {
                "hadithNo": "4343",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Sahl bin Mas'ud and Rafi' bin Khadij, that Muhaisah bin Mas'ud and 'Abdullah bin Sahl went to Khaibar, where they parted among the palm trees. 'Abdullah bin Sahl was killed, and they accused the Jews. His brother 'Abdur-Rahman and his two cousins Huwaisah, and Muhaisah, came to the Prophet (s.a.w) and 'Abdur-Rahman began to speak about his brother, but he was the youngest of them, so the Messenger of Allah (s.a.w) said: \"Let the eldest speak\" or he ;i! said \"Let the eldest speak first.\" So they spoke about their companion's case, and the Messenger of Allah (s.a.w) said: \"Let fifty of you swear against one of them, then he will be handed over to you.\" They said: \"It is something that we did not witness; how can we swear?\" He said: \"Then let the Jews swear fifty oaths that they are innocent.\" They said: \"O Messenger of Allah, they are a disbelieving people.\" So the Messenger of Allah (s.a.w) paid the blood money himself. Sahl said: \"I entered a Mirbad (camel pen) of theirs one day, and a she-camel among those camels (that were given as blood money) kicked me.\"",
                "hadithArabic": "وَحَدَّثَنِى عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِىُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِى حَثْمَةَ وَرَافِعِ بْنِ خَدِيجٍ أَنَّ مُحَيِّصَةَ بْنَ مَسْعُودٍ وَعَبْدَ اللَّهِ بْنَ سَهْلٍ انْطَلَقَا قِبَلَ خَيْبَرَ فَتَفَرَّقَا فِى النَّخْلِ فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَاتَّهَمُوا الْيَهُودَ فَجَاءَ أَخُوهُ عَبْدُ الرَّحْمَنِ وَابْنَا عَمِّهِ حُوَيِّصَةُ وَمُحَيِّصَةُ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَتَكَلَّمَ عَبْدُ الرَّحْمَنِ فِى أَمْرِ أَخِيهِ وَهُوَ أَصْغَرُ مِنْهُمْ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « كَبِّرِ الْكُبْرَ - أَوْ قَالَ - لِيَبْدَإِ الأَكْبَرُ ». فَتَكَلَّمَا فِى أَمْرِ صَاحِبِهِمَا فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « يُقْسِمُ خَمْسُونَ مِنْكُمْ عَلَى رَجُلٍ مِنْهُمْ فَيُدْفَعُ بِرُمَّتِهِ ». قَالُوا أَمْرٌ لَمْ نَشْهَدْهُ كَيْفَ نَحْلِفُ قَالَ « فَتُبْرِئُكُمْ يَهُودُ بِأَيْمَانِ خَمْسِينَ مِنْهُمْ ». قَالُوا يَا رَسُولَ اللَّهِ قَوْمٌ كُفَّارٌ قَالَ فَوَدَاهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- مِنْ قِبَلِهِ. قَالَ سَهْلٌ فَدَخَلْتُ مِرْبَدًا لَهُمْ يَوْمًا فَرَكَضَتْنِى نَاقَةٌ مِنْ تِلْكَ الإِبِلِ رَكْضَةً بِرِجْلِهَا. قَالَ حَمَّادٌ هَذَا أَوْ نَحْوَهُ."
            },
            {
                "hadithNo": "4344",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 4343) was narrated from Sahl bin Abi Hathmah from the Prophet (s.a.w), and in his Hadith he said: \"The Messenger of Allah (s.a.w) paid the blood money himself,\" but he did not say in his Hadith: \"A she-camel kicked me.\"",
                "hadithArabic": "وَحَدَّثَنَا الْقَوَارِيرِىُّ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِى حَثْمَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. نَحْوَهُ. وَقَالَ فِى حَدِيثِهِ فَعَقَلَهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- مِنْ عِنْدِهِ. وَلَمْ يَقُلْ فِى حَدِيثِهِ فَرَكَضَتْنِى نَاقَةٌ."
            },
            {
                "hadithNo": "4345",
                "chapterNo": "1",
                "hadithEnglish": "A Hadith similar to theirs (no. 4343) was narrated from Sahl bin Abi Hathmah.",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ - يَعْنِى الثَّقَفِىَّ - جَمِيعًا عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِى حَثْمَةَ بِنَحْوِ حَدِيثِهِمْ."
            },
            {
                "hadithNo": "4346",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Bushair bin Yasar that 'Abdullah bin Sahl bin Zaid and Muhaisah bin Mas'ud bin Zaid, two Ansari men from the tribe of Banu Harithah, went out to Khaibar during the time of the Messenger of Allah (s.a.w). At that time there was a peace treaty, and its people were Jews. They parted to go about their business, and 'Abdullah bin Sahl was killed. He was found slain in a water tank. His companion buried him, then he came to Al-Madinah. The brother of the slain man, 'Abdur-Rahman bin Sahl, along with Muhaisah and Huwaisah, went and told the Messenger of Allah (s.a.w) about 'Abdullah, and where he was killed. Bushair, who narrated this Hadith from one of the Companions of the Messenger of Allah (s.a.w) whom he met, said that he (s.a.w) said to them: \"Will you swear fifty oaths so that you will be entitled to the blood money?\" They said: \"O Messenger of Allah, we did not witness anything and we were not present.\" And he said, that he (s.a.w) said: \"Will you let the Jews swear fifty times that they are innocent?\" They said: \"O Messenger of Allah, how can we accept the oaths of a disbelieving people?\" Bushair said that the Messenger of Allah (s.a.w) paid the blood money himself.",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلِ بْنِ زَيْدٍ وَمُحَيِّصَةَ بْنَ مَسْعُودِ بْنِ زَيْدٍ الأَنْصَارِيَّيْنِ ثُمَّ مِنْ بَنِى حَارِثَةَ خَرَجَا إِلَى خَيْبَرَ فِى زَمَانِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- وَهِىَ يَوْمَئِذٍ صُلْحٌ وَأَهْلُهَا يَهُودُ فَتَفَرَّقَا لِحَاجَتِهِمَا فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَوُجِدَ فِى شَرَبَةٍ مَقْتُولاً فَدَفَنَهُ صَاحِبُهُ ثُمَّ أَقْبَلَ إِلَى الْمَدِينَةِ فَمَشَى أَخُو الْمَقْتُولِ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَمُحَيِّصَةُ وَحُوَيِّصَةُ فَذَكَرُوا لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- شَأْنَ عَبْدِ اللَّهِ وَحَيْثُ قُتِلَ فَزَعَمَ بُشَيْرٌ وَهُوَ يُحَدِّثُ عَمَّنْ أَدْرَكَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- أَنَّهُ قَالَ لَهُمْ « تَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ قَاتِلَكُمْ ». أَوْ « صَاحِبَكُمْ ». قَالُوا يَا رَسُولَ اللَّهِ مَا شَهِدْنَا وَلاَ حَضَرْنَا.\r\nفَزَعَمَ أَنَّهُ قَالَ « فَتُبْرِئُكُمْ يَهُودُ بِخَمْسِينَ ». فَقَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَزَعَمَ بُشَيْرٌ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- عَقَلَهُ مِنْ عِنْدِهِ."
            },
            {
                "hadithNo": "4347",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Bushair bin Yasar, that an Ansari man from Banu Harithah who was called 'Abdullah bin Sahl bin Zaid, went with a cousin of his who was called Muhaisah bin Mas'ud bin Zaid... and he quoted a Hadith like that of Al-Laith, up to the words: \"And the Messenger of Allah (s.a.w) paid the blood money himself.\" Yahya said: \"Bushair bin Yasar told me: 'Sahl bin Abi Hathmah told me: One of those camels (that were given as blood money) kicked me in the Mirbad (camel pen).\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ أَنَّ رَجُلاً مِنَ الأَنْصَارِ مِنْ بَنِى حَارِثَةَ يُقَالُ لَهُ عَبْدُ اللَّهِ بْنُ سَهْلِ بْنِ زَيْدٍ انْطَلَقَ هُوَ وَابْنُ عَمٍّ لَهُ يُقَالُ لَهُ مُحَيِّصَةُ بْنُ مَسْعُودِ بْنِ زَيْدٍ. وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ اللَّيْثِ إِلَى قَوْلِهِ فَوَدَاهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- مِنْ عِنْدِهِ.\r\nقَالَ يَحْيَى فَحَدَّثَنِى بُشَيْرُ بْنُ يَسَارٍ قَالَ أَخْبَرَنِى سَهْلُ بْنُ أَبِى حَثْمَةَ قَالَ لَقَدْ رَكَضَتْنِى فَرِيضَةٌ مِنْ تِلْكَ الْفَرَائِضِ بِالْمِرْبَدِ."
            },
            {
                "hadithNo": "4348",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Sahl bin Abi Hathmah Al-Ansari that some of them went to Khaibar, where they parted, and they found one of their number slain. He quoted the Hadith (a Hadith similar to no. 4346), in which he said: \"The Messenger of Allah (s.a.w) did not want his blood to have been shed in vain, so he paid one hundred camels from the Zakah as blood money.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِى حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ حَدَّثَنَا بُشَيْرُ بْنُ يَسَارٍ الأَنْصَارِىُّ عَنْ سَهْلِ بْنِ أَبِى حَثْمَةَ الأَنْصَارِىِّ أَنَّهُ أَخْبَرَهُ أَنَّ نَفَرًا مِنْهُمُ انْطَلَقُوا إِلَى خَيْبَرَ فَتَفَرَّقُوا فِيهَا فَوَجَدُوا أَحَدَهُمْ قَتِيلاً. وَسَاقَ الْحَدِيثَ وَقَالَ فِيهِ فَكَرِهَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَنْ يُبْطِلَ دَمَهُ فَوَدَاهُ مِائَةً مِنْ إِبِلِ الصَّدَقَةِ."
            },
            {
                "hadithNo": "4349",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Sahl bin Abi Hathmah that some of the elders of his people told him, that 'Abdullah bin Sahl and Muhaisah went out to Khaibar, because of some problem. Then Muhaisah came and said that 'Abdullah bin Sahl had been killed and thrown into a shallow well or ditch. He went to the Jews and said: \"You killed him, by Allah.\" They said: \"By Allah, we did not kill him.\" Then he went to his people and told them about that. Then he came with his brother Huwaisah, who was older than him, and 'Abdur-Rahman bin Sahl Mubaisah began to speak, as he was the one who had been in Khaibar, but the Messenger of Allah (s.a.w) said to Muhaisah: \"Let the oldest speak.\" So Huwaisah spoke, then Muhaisah spoke, and the Messenger of Allah (s.a.w) said: \"They should pay the Diyah for your companion or else expect war.\" The Messenger of Allah (s.a.w) wrote to them about that, and they wrote back (saying): \"By Allah we did not kill him.\" The Messenger of Allah (s.a.w) said to Huwaisah, Muhaisah, and 'Abdur-Rahman: \"Will you swear, so that you will be entitled to Diyah for the blood of your companion?\" They said: \"No.\" He said: \"Then should the Jews swear for you?\" They said: \"They are not Muslims.\" So the Messenger of Allah (s.a.w) paid the blood money for him, and sent one hundred camels to them. Sahl said: \"A red she-camel among them kicked me.\"",
                "hadithArabic": "حَدَّثَنِى إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ قَالَ سَمِعْتُ مَالِكَ بْنَ أَنَسٍ يَقُولُ حَدَّثَنِى أَبُو لَيْلَى بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ عَنْ سَهْلِ بْنِ أَبِى حَثْمَةَ أَنَّهُ أَخْبَرَهُ عَنْ رِجَالٍ مِنْ كُبَرَاءِ قَوْمِهِ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأَتَى مُحَيِّصَةُ فَأَخْبَرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِى عَيْنٍ أَوْ فَقِيرٍ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ. قَالُوا وَاللَّهِ مَا قَتَلْنَاهُ. ثُمَّ أَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ ذَلِكَ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِى كَانَ بِخَيْبَرَ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- لِمُحَيِّصَةَ « كَبِّرْ كَبِّرْ ». يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذِنُوا بِحَرْبٍ ». فَكَتَبَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِلَيْهِمْ فِى ذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ « أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ ». قَالُوا لاَ. قَالَ « فَتَحْلِفُ لَكُمْ يَهُودُ ». قَالُوا لَيْسُوا بِمُسْلِمِينَ. فَوَدَاهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ رَسُولُ اللَّهِ -صلى الله عليه وسلم- مِائَةَ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمُ الدَّارَ.\r\nفَقَالَ سَهْلٌ فَلَقَدْ رَكَضَتْنِى مِنْهَا نَاقَةٌ حَمْرَاءُ."
            },
            {
                "hadithNo": "4350",
                "chapterNo": "1",
                "hadithEnglish": "Abu Salamah bin 'Abdur-Rahman and Sulaiman bin Yasar, the freed slave of Maimunah, the wife of the Prophet (s.a.w), narrated from an Ansari man among the Companions of the Messenger of Allah (s.a.w), that the Messenger of Allah (s.a.w) confirmed Qasamah as it had been during the Jahiliyyah.",
                "hadithArabic": "حَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَ أَبُو الطَّاهِرِ حَدَّثَنَا وَقَالَ حَرْمَلَةُ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ أَخْبَرَنِى أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَسُلَيْمَانُ بْنُ يَسَارٍ مَوْلَى مَيْمُونَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- عَنْ رَجُلٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- مِنَ الأَنْصَارِ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- أَقَرَّ الْقَسَامَةَ عَلَى مَا كَانَتْ عَلَيْهِ فِى الْجَاهِلِيَّةِ."
            },
            {
                "hadithNo": "4351",
                "chapterNo": "1",
                "hadithEnglish": "Ibn Shihab narrated a similar report (as no. 4350) with this chain, and he added: \"The Messenger of Allah (s.a.w) passed a judgment among some of the Ansar, concerning a slain man whom they claimed had been killed by the Jews.\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ حَدَّثَنَا ابْنُ شِهَابٍ بِهَذَا الإِسْنَادِ مِثْلَهُ. وَزَادَ وَقَضَى بِهَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- بَيْنَ نَاسٍ مِنَ الأَنْصَارِ فِى قَتِيلٍ ادَّعَوْهُ عَلَى الْيَهُودِ."
            },
            {
                "hadithNo": "4352",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn Shihab that Abu Salamah bin 'Abdur-Rahman and Sulaiman bin Yasar told him from some of the Ansar, from the Prophet (s.a.w) - a Hadith like that of Ibn Juraij (no. 4351).",
                "hadithArabic": "وَحَدَّثَنَا حَسَنُ بْنُ عَلِىٍّ الْحُلْوَانِىُّ حَدَّثَنَا يَعْقُوبُ - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِى عَنْ صَالِحٍ عَنِ ابْنِ شِهَابٍ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ وَسُلَيْمَانَ بْنَ يَسَارٍ أَخْبَرَاهُ عَنْ نَاسٍ مِنَ الأَنْصَارِ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمِثْلِ حَدِيثِ ابْنِ جُرَيْجٍ."
            },
            {
                "hadithNo": "4353",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Anas bin Malik that some people from 'Uraynah came to the Messenger of Allah (s.a.w) in Al-Madinah, but they found that the climate did not suit them (and they fell sick). The Messenger of Allah (s.a.w) said to them: \"If you wish, you may go out to the camels from Sadaqah and drink their milk and urine.\" So they did that and got better. Then they went to the herdsmen and killed them, and apostatized from Islam, and drove off the camels of the Messenger of Allah (s.a.w). News of that reached the Prophet (s.a.w) and he sent men after them. They were brought, and he had their hands and feet cut off, and their eyes poked out, and he left them in Al-Harrah until they died.",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ كِلاَهُمَا عَنْ هُشَيْمٍ - وَاللَّفْظُ لِيَحْيَى - قَالَ أَخْبَرَنَا هُشَيْمٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ وَحُمَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ نَاسًا مِنْ عُرَيْنَةَ قَدِمُوا عَلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- الْمَدِينَةَ فَاجْتَوَوْهَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنْ شِئْتُمْ أَنْ تَخْرُجُوا إِلَى إِبِلِ الصَّدَقَةِ فَتَشْرَبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا ». فَفَعَلُوا فَصَحُّوا ثُمَّ مَالُوا عَلَى الرِّعَاءِ فَقَتَلُوهُمْ وَارْتَدُّوا عَنِ الإِسْلاَمِ وَسَاقُوا ذَوْدَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَبَلَغَ ذَلِكَ النَّبِىَّ -صلى الله عليه وسلم- فَبَعَثَ فِى أَثْرِهِمْ فَأُتِىَ بِهِمْ فَقَطَعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْ وَتَرَكَهُمْ فِى الْحَرَّةِ حَتَّى مَاتُوا."
            },
            {
                "hadithNo": "4354",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Abu Qilabah: \"Anas told me that eight men from 'Ukl came to the Messenger of Allah (s.a.w), and they swore allegiance as Muslims, but they found that the land (i.e., the climate) did not suit them and they fell sick. They complained about that to the Messenger of Allah (s.a.w), and he said: 'Why don't you go out with our herdsman to the camels and get some of their milk and urine?' They said: 'Yes.' So they went out and drank some of their milk and urine, and they got better. Then they killed the herdsman and drove away the camels. News of that reached the Messenger of Allah (s.a.w), and he sent men after them. They were caught and brought, and he ordered that their hands and feet be cut off and their eyes be branded, then they were left in the sun until they died.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ الصَّبَّاحِ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ - وَاللَّفْظُ لأَبِى بَكْرٍ - قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ حَجَّاجِ بْنِ أَبِى عُثْمَانَ حَدَّثَنِى أَبُو رَجَاءٍ مَوْلَى أَبِى قِلاَبَةَ عَنْ أَبِى قِلاَبَةَ حَدَّثَنِى أَنَسٌ أَنَّ نَفَرًا مِنْ عُكْلٍ ثَمَانِيَةً قَدِمُوا عَلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَبَايَعُوهُ عَلَى الإِسْلاَمِ فَاسْتَوْخَمُوا الأَرْضَ وَسَقُمَتْ أَجْسَامُهُمْ فَشَكَوْا ذَلِكَ إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم-. فَقَالَ « أَلاَ تَخْرُجُونَ مَعَ رَاعِينَا فِى إِبِلِهِ فَتُصِيبُونَ مِنْ أَبْوَالِهَا وَأَلْبَانِهَا ». فَقَالُوا بَلَى. فَخَرَجُوا فَشَرِبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا فَصَحُّوا فَقَتَلُوا الرَّاعِىَ وَطَرَدُوا الإِبِلَ فَبَلغَ ذَلِكَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَبَعَثَ فِى آثَارِهِمْ فَأُدْرِكُوا فَجِىءَ بِهِمْ فَأَمَرَ بِهِمْ فَقُطِعَتْ أَيْدِيهِمْ وَأَرْجُلُهُمْ وَسُمِرَ أَعْيُنُهُمْ ثُمَّ نُبِذُوا فِى الشَّمْسِ حَتَّى مَاتُوا. وَقَالَ ابْنُ الصَّبَّاحِ فِى رِوَايَتِهِ وَاطَّرَدُوا النَّعَمَ. وَقَالَ وَسُمِّرَتْ أَعْيُنُهُمْ."
            },
            {
                "hadithNo": "4355",
                "chapterNo": "2",
                "hadithEnglish": "Anas bin Malik narrated: \"Some people from 'Ukl or 'Uraynah came to the Messenger of Allah (s.a.w), but AI-Madinah did not suit them (and they fell sick), so the Messenger of Allah (s.a.w) told them to go to some milch camels and drink their milk and urine...\" a Hadith like that of Hajjaj bin Abi 'Uthman (no. 4354). He said: \"Their eyes were branded and they were left in Al-Harrah, asking for water, but they were not given any water.\"",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِى رَجَاءٍ مَوْلَى أَبِى قِلاَبَةَ قَالَ قَالَ أَبُو قِلاَبَةَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَ قَدِمَ عَلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَوْمٌ مِنْ عُكْلٍ أَوْ عُرَيْنَةَ فَاجْتَوَوُا الْمَدِينَةَ فَأَمَرَ لَهُمْ رَسُولُ اللَّهِ -صلى الله عليه وسلم- بِلِقَاحٍ وَأَمَرَهُمْ أَنْ يَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا. بِمَعْنَى حَدِيثِ حَجَّاجِ بْنِ أَبِى عُثْمَانَ. قَالَ وَسُمِرَتْ أَعْيُنُهُمْ وَأُلْقُوا فِى الْحَرَّةِ يَسْتَسْقُونَ فَلاَ يُسْقَوْنَ."
            },
            {
                "hadithNo": "4356",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Abu Qilabah said: \"I was sitting behind 'Umar bin 'Abdul' Aziz, and he said to the people: 'What do you say about Qasamah?' 'Anbasah said: 'Anas bin Malik told us such-and-such.' I said: 'Anas told me that some people came to the Prophet (s.a.w)...\"' and he quoted a Hadith like that of Ayyub an.d Hajjaj (no. 4354 and 4355). Abu Qilabah said: \"When I had finished, 'Anbasah said: 'Subhan Allah!\" Abu Qilabah said: \"I said: 'Are you suspecting me (of lying), O 'Anbasah?' He said: 'No, this is what Anas bin Malik told us.' You will still be fine, O people of Ash-Sham, so long as this man, or one like him, is among you.\"'",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ ح وَحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِىُّ حَدَّثَنَا أَزْهَرُ السَّمَّانُ قَالاَ حَدَّثَنَا ابْنُ عَوْنٍ حَدَّثَنَا أَبُو رَجَاءٍ مَوْلَى أَبِى قِلاَبَةَ عَنْ أَبِى قِلاَبَةَ قَالَ كُنْتُ جَالِسًا خَلْفَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فَقَالَ لِلنَّاسِ مَا تَقُولُونَ فِى الْقَسَامَةِ فَقَالَ عَنْبَسَةُ قَدْ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ كَذَا وَكَذَا فَقُلْتُ إِيَّاىَ حَدَّثَ أَنَسٌ قَدِمَ عَلَى النَّبِىِّ -صلى الله عليه وسلم- قَوْمٌ. وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ أَيُّوبَ وَحَجَّاجٍ.\r\nقَالَ أَبُو قِلاَبَةَ فَلَمَّا فَرَغْتُ قَالَ عَنْبَسَةُ سُبْحَانَ اللَّهِ - قَالَ أَبُو قِلاَبَةَ - فَقُلْتُ أَتَتَّهِمُنِى يَا عَنْبَسَةُ قَالَ لاَ هَكَذَا حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ لَنْ تَزَالُوا بِخَيْرٍ يَا أَهْلَ الشَّامِ مَادَامَ فِيكُمْ هَذَا أَوْ مِثْلُ هَذَا."
            },
            {
                "hadithNo": "4357",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Abu Qilabah, that Anas bin Malik said: \"Eight men from 'Ukl came to the Messenger of Allah (s.a.w)...\" a Hadith like theirs (i.e., Ayyub and Hajjaj, no. 4354, 4355) and he added: \"And he did not cauterize them.\"",
                "hadithArabic": "وَحَدَّثَنَا الْحَسَنُ بْنُ أَبِى شُعَيْبٍ الْحَرَّانِىُّ حَدَّثَنَا مِسْكِينٌ - وَهُوَ ابْنُ بُكَيْرٍ الْحَرَّانِىُّ - أَخْبَرَنَا الأَوْزَاعِىُّ ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِىُّ أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنِ الأَوْزَاعِىِّ عَنْ يَحْيَى بْنِ أَبِى كَثِيرٍ عَنْ أَبِى قِلاَبَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَدِمَ عَلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- ثَمَانِيَةُ نَفَرٍ مِنْ عُكْلٍ.\r\nبِنَحْوِ حَدِيثِهِمْ. وَزَادَ فِى الْحَدِيثِ وَلَمْ يَحْسِمْهُمْ."
            },
            {
                "hadithNo": "4358",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Anas bin Malik said: \"Some people from 'Uraynah came to the Messenger of Allah (s.a.w), and they become Muslim and swore allegiance to him. Then Al-Madinah was stricken with Al-Mum - and it is pleurisy...\" and he mentioned a Hadith like theirs (no. 4354, 4355), and added: \"There were twenty young men of the Ansar with him, so he sent them to them, and he sent with them a tracker to follow their tracks.\"",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مَالِكُ بْنُ إِسْمَاعِيلَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَنَسٍ قَالَ أَتَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- نَفَرٌ مِنْ عُرَيْنَةَ فَأَسْلَمُوا وَبَايَعُوهُ وَقَدْ وَقَعَ بِالْمَدِينَةِ الْمُومُ - وَهُوَ الْبِرْسَامُ - ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ وَزَادَ وَعِنْدَهُ شَبَابٌ مِنَ الأَنْصَارِ قَرِيبٌ مِنْ عِشْرِينَ فَأَرْسَلَهُمْ إِلَيْهِمْ وَبَعَثَ مَعَهُمْ قَائِفًا يَقْتَصُّ أَثَرَهُمْ."
            },
            {
                "hadithNo": "4359",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Anas, and in the Hadith of Hammam (a sub-narrator it says): \"Some people from 'Uraynah came to the Prophet (s.a.w)...\" In the Hadith of Sa'eed it says: \"From 'Ukl and 'Uraynah,\" a similar Hadith (as no. 4358).",
                "hadithArabic": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ وَفِى حَدِيثِ هَمَّامٍ قَدِمَ عَلَى النَّبِىِّ -صلى الله عليه وسلم- رَهْطٌ مِنْ عُرَيْنَةَ وَفِى حَدِيثِ سَعِيدٍ مِنْ عُكْلٍ وَعُرَيْنَةَ. بِنَحْوِ حَدِيثِهِمْ."
            },
            {
                "hadithNo": "4360",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Anas said: \"The Prophet (s.a.w) had the eyes of those people poked out because they had poked out the eyes of the herdsmen.\"",
                "hadithArabic": "وَحَدَّثَنِى الْفَضْلُ بْنُ سَهْلٍ الأَعْرَجُ حَدَّثَنَا يَحْيَى بْنُ غَيْلاَنَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ سُلَيْمَانَ التَّيْمِىِّ عَنْ أَنَسٍ قَالَ إِنَّمَا سَمَلَ النَّبِىُّ -صلى الله عليه وسلم- أَعْيُنَ أُولَئِكَ لأَنَّهُمْ سَمَلُوا أَعْيُنَ الرِّعَاءِ."
            },
            {
                "hadithNo": "4361",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Anas bin Malik that a Jew killed a girl for her silver ornaments, and he killed her with a rock. She was brought to the Prophet (s.a.w) when there was still some life in her, and he said to her: \"Did so-and-so kill you?\" She gestured with her head saying no. He asked her again and she gestured with her head saying no. Then he asked her a third time and she said: Yes, gesturing with her head, so the Messenger of Allah (s.a.w) had him killed between two rocks.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ يَهُودِيًّا قَتَلَ جَارِيَةً عَلَى أَوْضَاحٍ لَهَا فَقَتَلَهَا بِحَجَرٍ - قَالَ - فَجِىءَ بِهَا إِلَى النَّبِىِّ -صلى الله عليه وسلم- وَبِهَا رَمَقٌ فَقَالَ لَهَا « أَقَتَلَكِ فُلاَنٌ ». فَأَشَارَتْ بِرَأْسِهَا أَنْ لاَ ثُمَّ قَالَ لَهَا الثَّانِيَةَ فَأَشَارَتْ بِرَأْسِهَا أَنْ لاَ ثُمَّ سَأَلَهَا الثَّالِثَةَ فَقَالَتْ نَعَمْ. وَأَشَارَتْ بِرَأْسِهَا فَقَتَلَهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- بَيْنَ حَجَرَيْنِ."
            },
            {
                "hadithNo": "4362",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as Hadith no. 4361) was narrated from Shu'bah with this chain. In the Hadith of Idris (a sub-narrator) it says that his head was crushed between two rocks.",
                "hadithArabic": "وَحَدَّثَنِى يَحْيَى بْنُ حَبِيبٍ الْحَارِثِىُّ حَدَّثَنَا خَالِدٌ يَعْنِى ابْنَ الْحَارِثِ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ إِدْرِيسَ كِلاَهُمَا عَنْ شُعْبَةَ بِهَذَا الإِسْنَادِ. نَحْوَهُ وَفِى حَدِيثِ ابْنِ إِدْرِيسَ فَرَضَخَ رَأْسَهُ بَيْنَ حَجَرَيْنِ."
            },
            {
                "hadithNo": "4363",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Anas that a Jewish man killed an Ansari girl for her jewelry, then he threw her into a well and crushed her head with rocks. He was caught and brought to the Messenger of Allah (s.a.w), who ordered that he be stoned to death, so he was stoned to death.",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ أَبِى قِلاَبَةَ عَنْ أَنَسٍ أَنَّ رَجُلاً مِنَ الْيَهُودِ قَتَلَ جَارِيَةً مِنَ الأَنْصَارِ عَلَى حُلِىٍّ لَهَا ثُمَّ أَلْقَاهَا فِى الْقَلِيبِ وَرَضَخَ رَأْسَهَا بِالْحِجَارَةِ فَأُخِذَ فَأُتِىَ بِهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَأَمَرَ بِهِ أَنْ يُرْجَمَ حَتَّى يَمُوتَ فَرُجِمَ حَتَّى مَاتَ."
            },
            {
                "hadithNo": "4364",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as Hadith no. 4361) was narrated from Ayyub with this chain.",
                "hadithArabic": "وَحَدَّثَنِى إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى مَعْمَرٌ عَنْ أَيُّوبَ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "4365",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Anas bin Malik that a girl was found with her head crushed between two rocks. They asked her: \"Who did this to you? Was it so-and-so? Was it so-and-so?\" Until they mentioned that Jew, and she nodded her head. The Jew was caught and he admitted it, so the Messenger of Allah (s.a.w) ordered that his head be struck with rocks.",
                "hadithArabic": "وَحَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ جَارِيَةً وُجِدَ رَأْسُهَا قَدْ رُضَّ بَيْنَ حَجَرَيْنِ فَسَأَلُوهَا مَنْ صَنَعَ هَذَا بِكِ فُلاَنٌ فُلاَنٌ حَتَّى ذَكَرُوا يَهُودِيًّا فَأَوْمَتْ بِرَأْسِهَا فَأُخِذَ الْيَهُودِىُّ فَأَقَرَّ فَأَمَرَ بِهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَنْ يُرَضَّ رَأْسُهُ بِالْحِجَارَةِ."
            },
            {
                "hadithNo": "4366",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Imran bin Husain said: \"Ya'la bin Munyah or Ibn Umayyah fought a man. One of them bit the other, and he tried to pull his hand away from his mouth, and his incisor fell out - Ibn Al-Muthannah said that two incisors fell out. They referred their dispute to the Prophet (s.a.w) and he said: \"Would one of you bite as a male camel bites?\" There is no Diyah for him.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَاتَلَ يَعْلَى ابْنُ مُنْيَةَ أَوِ ابْنُ أُمَيَّةَ رَجُلاً فَعَضَّ أَحَدُهُمَا صَاحِبَهُ فَانْتَزَعَ يَدَهُ مِنْ فَمِهِ فَنَزَعَ ثَنِيَّتَهُ - وَقَالَ ابْنُ الْمُثَنَّى ثَنِيَّتَيْهِ - فَاخْتَصَمَا إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَقَالَ « أَيَعَضُّ أَحَدُكُمْ كَمَا يَعَضُّ الْفَحْلُ لاَ دِيَةَ لَهُ »."
            },
            {
                "hadithNo": "4367",
                "chapterNo": "4",
                "hadithEnglish": "A similar report (as no. 4366) was narrated from Ya'la, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عَطَاءٍ عَنِ ابْنِ يَعْلَى عَنْ يَعْلَى عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمِثْلِهِ."
            },
            {
                "hadithNo": "4368",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from 'Imran bin Husain that a man bit the arm of another man, who pulled it away and his incisor fell out. The matter was referred to the Prophet (s.a.w) who dismissed the claim and said: \"Did you want to eat his flesh?\"",
                "hadithArabic": "حَدَّثَنِى أَبُو غَسَّانَ الْمِسْمَعِىُّ حَدَّثَنَا مُعَاذٌ - يَعْنِى ابْنَ هِشَامٍ - حَدَّثَنِى أَبِى عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَجُلاً عَضَّ ذِرَاعَ رَجُلٍ فَجَذَبَهُ فَسَقَطَتْ ثَنِيَّتُهُ فَرُفِعَ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَأَبْطَلَهُ وَقَالَ « أَرَدْتَ أَنْ تَأْكُلَ لَحْمَهُ »."
            },
            {
                "hadithNo": "4369",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Safwan bin Ya'la that a servant of Ya'la bin Munyah bit another man on the arm, and he pulled it away and his incisor fell out. The matter was referred to the Prophet (s.a.w) who dismissed the claim and said: \"Did you want to bite him as a male camel bites?\"",
                "hadithArabic": "حَدَّثَنِى أَبُو غَسَّانَ الْمِسْمَعِىُّ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِى أَبِى عَنْ قَتَادَةَ عَنْ بُدَيْلٍ عَنْ عَطَاءِ بْنِ أَبِى رَبَاحٍ عَنْ صَفْوَانَ بْنِ يَعْلَى أَنَّ أَجِيرًا لِيَعْلَى ابْنِ مُنْيَةَ عَضَّ رَجُلٌ ذِرَاعَهُ فَجَذَبَهَا فَسَقَطَتْ ثَنِيَّتُهُ فَرُفِعَ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَأَبْطَلَهَا وَقَالَ « أَرَدْتَ أَنْ تَقْضَمَهَا كَمَا يَقْضَمُ الْفَحْلُ »."
            },
            {
                "hadithNo": "4370",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from 'Imran bin Husain that a man bit the hand of another man, who pulled his hand away and one or more of his incisors fell out. He referred the matter to the Messenger of Allah (s.a.w) and the Messenger of Allah (s.a.w) said: \"What do you want me to do? Do you want me to order him to put his hand in your mouth so that you can bite it like a male camel? Give him your hand so that he can bite it, then you can pull it away\"",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِىُّ حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ عَنِ ابْنِ عَوْنٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَجُلاً عَضَّ يَدَ رَجُلٍ فَانْتَزَعَ يَدَهُ فَسَقَطَتْ ثَنِيَّتُهُ أَوْ ثَنَايَاهُ فَاسْتَعْدَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَا تَأْمُرُنِى تَأْمُرُنِى أَنْ آمُرَهُ أَنْ يَدَعَ يَدَهُ فِى فِيكَ تَقْضَمُهَا كَمَا يَقْضَمُ الْفَحْلُ ادْفَعْ يَدَكَ حَتَّى يَعَضَّهَا ثُمَّ انْتَزِعْهَا »."
            },
            {
                "hadithNo": "4371",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Safwan bin Ya'la bin Munyah that his father said: \"A man came to the Prophet (s.a.w) He had bitten a man's hand, who had pulled his hand away and his incisors had fallen out.\" He said: \"The Prophet (s.a.w) dismissed the claim and said: 'Did you want to bite him as a camel bites?\"'",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا عَطَاءٌ عَنْ صَفْوَانَ بْنِ يَعْلَى ابْنِ مُنْيَةَ عَنْ أَبِيهِ قَالَ أَتَى النَّبِىَّ -صلى الله عليه وسلم- رَجُلٌ وَقَدْ عَضَّ يَدَ رَجُلٍ فَانْتَزَعَ يَدَهُ فَسَقَطَتْ ثَنِيَّتَاهُ - يَعْنِى الَّذِى عَضَّهُ - قَالَ فَأَبْطَلَهَا النَّبِىُّ -صلى الله عليه وسلم- وَقَالَ « أَرَدْتَ أَنْ تَقْضَمَهُ كَمَا يَقْضَمُ الْفَحْلُ »."
            },
            {
                "hadithNo": "4372",
                "chapterNo": "4",
                "hadithEnglish": "Safwan bin Ya'la bin Umayyah narrated that his father said: \"I went out with the Prophet (s.a.w) on the campaign to Tabuk. He said: 'Ya'la used to say: \"That campaign was the best of my deeds, in my view.\"' 'Ata' said: \"Safwan said: 'Ya'la said: \"I had a servant who fought with another man and one of them bit the hand of the other\" - Safwan said: \"He told me which of them bit the other - the one who was bit pulled his hand away from the one who bit him, and pulled out one of his incisors. They came to the Prophet (s.a.w), who dismissed his claim for his tooth.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى عَطَاءٌ أَخْبَرَنِى صَفْوَانُ بْنُ يَعْلَى بْنِ أُمَيَّةَ عَنْ أَبِيهِ قَالَ غَزَوْتُ مَعَ النَّبِىِّ -صلى الله عليه وسلم- غَزْوَةَ تَبُوكَ - قَالَ وَكَانَ يَعْلَى يَقُولُ تِلْكَ الْغَزْوَةُ أَوْثَقُ عَمَلِى عِنْدِى - فَقَالَ عَطَاءٌ قَالَ صَفْوَانُ قَالَ يَعْلَى كَانَ لِى أَجِيرٌ فَقَاتَلَ إِنْسَانًا فَعَضَّ أَحَدُهُمَا يَدَ الآخَرِ - قَالَ لَقَدْ أَخْبَرَنِى صَفْوَانُ أَيُّهُمَا عَضَّ الآخَرَ - فَانْتَزَعَ الْمَعْضُوضُ يَدَهُ مِنْ فِى الْعَاضِّ فَانْتَزَعَ إِحْدَى ثَنِيَّتَيْهِ فَأَتَيَا النَّبِىَّ -صلى الله عليه وسلم- فَأَهْدَرَ ثَنِيَّتَهُ."
            },
            {
                "hadithNo": "4373",
                "chapterNo": "4",
                "hadithEnglish": "Ibn Juraij narrated a similar report (as no. 4372) with this chain.",
                "hadithArabic": "وَحَدَّثَنَاهُ عَمْرُو بْنُ زُرَارَةَ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "4374",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Anas that the sister of Ar-Rubai' Umm Harithah, injured a person. They referred the dispute to the Prophet (s.a.w) and the Messenger of Allah (s.a.w) said: \"Qisas, Qisas.\" Umm Ar-Rabi' said: \"O Messenger of Allah, will Qisas be taken from So-and-so? By Allah, no Qisas will be taken from her!\" The Prophet (s.a.w) said: \"Subhan-Allah, O Umm Ar-Rabi'! Qisas is a command in the Book of Allah.\" She said: \"No, by Allah, no Qisas will ever be taken from her.\" She kept saying it until they accepted the Diyah. The Messenger of Allah (s.a.w) said: \"Among the slaves of Allah are those who, if they swear by Allah that something will happen or not happen, then their oaths will be fulfilled.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسٍ أَنَّ أُخْتَ الرُّبَيِّعِ أُمَّ حَارِثَةَ جَرَحَتْ إِنْسَانًا فَاخْتَصَمُوا إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « الْقِصَاصَ الْقِصَاصَ ». فَقَالَتْ أُمُّ الرَّبِيعِ يَا رَسُولَ اللَّهِ أَيُقْتَصُّ مِنْ فُلاَنَةَ وَاللَّهِ لاَ يُقْتَصُّ مِنْهَا. فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- « سُبْحَانَ اللَّهِ يَا أُمَّ الرَّبِيعِ الْقِصَاصُ كِتَابُ اللَّهِ ». قَالَتْ لاَ وَاللَّهِ لاَ يُقْتَصُّ مِنْهَا أَبَدًا. قَالَ فَمَا زَالَتْ حَتَّى قَبِلُوا الدِّيَةَ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّ مِنْ عِبَادِ اللَّهِ مَنْ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ »."
            },
            {
                "hadithNo": "4375",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that 'Abdullah said: \"The Messenger of Allah (s.a.w) said: 'It is not permissible to shed the blood of a Muslim who testifies that none has the right to be worshiped but Allah and that I am the Messenger of Allah, except in one of three cases: A married (or previously married) adulterer, a life for a life, or one who forsakes his religion leaving the Jama'ah (the congregation of Muslims).\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ وَأَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنِ الأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّى رَسُولُ اللَّهِ إِلاَّ بِإِحْدَى ثَلاَثٍ الثَّيِّبُ الزَّانِ وَالنَّفْسُ بِالنَّفْسِ وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ »."
            },
            {
                "hadithNo": "4376",
                "chapterNo": "6",
                "hadithEnglish": "A similar report (as Hadith no. 4375) was narrated from Al-A'mash with this chain.",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَلِىُّ بْنُ خَشْرَمٍ قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ كُلُّهُمْ عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "4377",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that 'Abdullah said: \"The Messenger of Allah (s.a.w) stood up among us and said: 'By the One besides Whom none has the right to be worshiped! It is not permissible to shed the blood of a Muslim man who testifies that none has the right to be worshiped but Allah and that I am the Messenger of Allah, except in three cases: One who leaves Islam abandoning the Jama'ah (the congregation of Muslims), a married (or previously married) adulterer, and a life for a life.\"' Al-A'mash said: I narrated it to Ibrahim, and he narrated a similar report from Al-Aswad, from 'Aishah.",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى - وَاللَّفْظُ لأَحْمَدَ - قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِىٍّ عَنْ سُفْيَانَ عَنِ الأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَامَ فِينَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « وَالَّذِى لاَ إِلَهَ غَيْرُهُ لاَ يَحِلُّ دَمُ رَجُلٍ مُسْلِمٍ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّى رَسُولُ اللَّهِ إِلاَّ ثَلاَثَةُ نَفَرٍ التَّارِكُ الإِسْلاَمَ الْمُفَارِقُ لِلْجَمَاعَةِ أَوِ الْجَمَاعَةَ - شَكَّ فِيهِ أَحْمَدُ - وَالثَّيِّبُ الزَّانِى وَالنَّفْسُ بِالنَّفْسِ ».قَالَ الأَعْمَشُ فَحَدَّثْتُ بِهِ إِبْرَاهِيمَ فَحَدَّثَنِى عَنِ الأَسْوَدِ عَنْ عَائِشَةَ بِمِثْلِهِ."
            },
            {
                "hadithNo": "4378",
                "chapterNo": "6",
                "hadithEnglish": "A Hadith like that of Sufyan (no. 4377) was narrated from Al-A'mash with both chains, but he did not mention in his Hadith the words: \"By the One besides Whom none has the right to be worshiped.\"",
                "hadithArabic": "وَحَدَّثَنِى حَجَّاجُ بْنُ الشَّاعِرِ وَالْقَاسِمُ بْنُ زَكَرِيَّاءَ قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنِ الأَعْمَشِ بِالإِسْنَادَيْنِ جَمِيعًا. نَحْوَ حَدِيثِ سُفْيَانَ وَلَمْ يَذْكُرَا فِى الْحَدِيثِ قَوْلَهُ « وَالَّذِى لاَ إِلَهَ غَيْرُهُ »."
            },
            {
                "hadithNo": "4379",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that 'Abdullah said: The Messenger of Allah (s.a.w) said: 'No soul is killed unlawfully, but there is a share of the sin on the first son of Adam, because he was the first one to set the precedent of killing.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ - وَاللَّفْظُ لاِبْنِ أَبِى شَيْبَةَ - قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لاَ تُقْتَلُ نَفْسٌ ظُلْمًا إِلاَّ كَانَ عَلَى ابْنِ آدَمَ الأَوَّلِ كِفْلٌ مِنْ دَمِهَا لأَنَّهُ كَانَ أَوَّلَ مَنْ سَنَّ الْقَتْلَ »."
            },
            {
                "hadithNo": "4380",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from Al-A'mash with this chain (a Hadith similar as no. 4379). In the Hadith of Jarir and \"Eisa bin Yunus (sub-narrators): \"because he killed\" and it does not say \"the first one.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ عُثْمَانُ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا جَرِيرٌ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ وَعِيسَى بْنُ يُونُسَ ح وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ كُلُّهُمْ عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ وَفِى حَدِيثِ جَرِيرٍ وَعِيسَى بْنِ يُونُسَ « لأَنَّهُ سَنَّ الْقَتْلَ ». لَمْ يَذْكُرَا أَوَّلَ."
            },
            {
                "hadithNo": "4381",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that 'Abdullah said: \"The Messenger of Allah (s.a.w) said: 'The first thing concerning which judgment will be passed among the people on the Day of Resurrection will be bloodshed.\"'",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ جَمِيعًا عَنْ وَكِيعٍ عَنِ الأَعْمَشِ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَوَكِيعٌ عَنِ الأَعْمَشِ عَنْ أَبِى وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَوَّلُ مَا يُقْضَى بَيْنَ النَّاسِ يَوْمَ الْقِيَامَةِ فِى الدِّمَاءِ »."
            },
            {
                "hadithNo": "4382",
                "chapterNo": "8",
                "hadithEnglish": "A similar report (as no. 4381) was narrated from 'Abdullah from the Prophet (s.a.w).",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنِى يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدٌ - يَعْنِى ابْنَ الْحَارِثِ - ح وَحَدَّثَنِى بِشْرُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا ابْنُ أَبِى عَدِىٍّ كُلُّهُمْ عَنْ شُعْبَةَ عَنِ الأَعْمَشِ عَنْ أَبِى وَائِلٍ عَنْ عَبْدِ اللَّهِ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمِثْلِهِ غَيْرَ أَنَّ بَعْضَهُمْ قَالَ عَنْ شُعْبَةَ « يُقْضَى ». وَبَعْضُهُمْ قَالَ « يُحْكَمُ بَيْنَ النَّاسِ »."
            },
            {
                "hadithNo": "4383",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from Abu Bakrah that the Prophet (s.a.w) said: \"Time has returned to its original order as it was on the day when Allah created the heavens and the earth. The year is twelve months, of which four are sacred: Three consecutive months; Dhul-Qa'dah, Dhul-Hijjah and Muharram - and Rajab, the month of Mudar, which comes between Jumada and Sha'ban.\" Then he said: \"What month is this?\" We said: \"Allah and His Messenger know best.\" He remained silent until we thought that he was going to call it by another name. He said: \"Is it not Dhul-Hijjah?\" We said: \"Yes indeed.\" He said: \"What land is this?\"· We said: \"Allah and His Messenger know best.\" He remained silent until we thought that he was going to call it by another name. He said: \"Is it not Al-Baldah (the city of Makkah)?\" We said: \"Yes indeed.\" He said: \"What day is this?\" We said: \"Allah and His Messenger know best.\" He remained silent until we thought that he was going to call it by another name. He said: \"Is it not the Day of Sacrifice?\" We said: \"Yes indeed, O Messenger of Allah.\" He said: \"Your blood and your wealth\" - Muhammad (a narrator) said: \"and I think he said: 'your honor' - \"are sacred to you, as sacred as this day of yours, in this land of yours, in this month of yours. You will meet your Lord, and He will ask you about your deeds, so do not turn back misguided after I am gone, striking one another's necks. Let those who are present convey it to those who are absent; perhaps some of those to whom it is conveyed will understand it better than some of those who hear it.\" Then he said: \"Have I not conveyed (the message)?\" Ibn I:Iabib said in his report: \"And Rajab of Mudar.\" Abi Bakr (a narrator) said: \"Do not turn back after me.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَيَحْيَى بْنُ حَبِيبٍ الْحَارِثِىُّ - وَتَقَارَبَا فِى اللَّفْظِ - قَالاَ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِىُّ عَنْ أَيُّوبَ عَنِ ابْنِ سِيرِينَ عَنِ ابْنِ أَبِى بَكْرَةَ عَنْ أَبِى بَكْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهُ قَالَ « إِنَّ الزَّمَانَ قَدِ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَوَاتِ وَالأَرْضَ السَّنَةُ اثْنَا عَشَرَ شَهْرًا مِنْهَا أَرْبَعَةٌ حُرُمٌ ثَلاَثَةٌ مُتَوَالِيَاتٌ ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ وَرَجَبٌ شَهْرُ مُضَرَ الَّذِى بَيْنَ جُمَادَى وَشَعْبَانَ - ثُمَّ قَالَ - أَىُّ شَهْرٍ هَذَا ». قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ - قَالَ - فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ. قَالَ « أَلَيْسَ ذَا الْحِجَّةِ ». قُلْنَا بَلَى. قَالَ « فَأَىُّ بَلَدٍ هَذَا ». قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ - قَالَ - فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ. قَالَ « أَلَيْسَ الْبَلْدَةَ ». قُلْنَا بَلَى. قَالَ « فَأَىُّ يَوْمٍ هَذَا ». قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ - قَالَ - فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ. قَالَ « أَلَيْسَ يَوْمَ النَّحْرِ ». قُلْنَا بَلَى يَا رَسُولَ اللَّهِ. قَالَ « فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ - قَالَ مُحَمَّدٌ وَأَحْسِبُهُ قَالَ - وَأَعْرَاضَكُمْ حَرَامٌ عَلَيْكُمْ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِى بَلَدِكُمْ هَذَا فِى شَهْرِكُمْ هَذَا وَسَتَلْقَوْنَ رَبَّكُمْ فَيَسْأَلُكُمْ عَنْ أَعْمَالِكُمْ فَلاَ تَرْجِعُنَّ بَعْدِى كُفَّارًا - أَوْ ضُلاَّلاً - يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ أَلاَ لِيُبَلِّغِ الشَّاهِدُ الْغَائِبَ فَلَعَلَّ بَعْضَ مَنْ يُبَلَّغُهُ يَكُونُ أَوْعَى لَهُ مِنْ بَعْضِ مَنْ سَمِعَهُ ». ثُمَّ قَالَ « أَلاَ هَلْ بَلَّغْتُ ». قَالَ ابْنُ حَبِيبٍ فِى رِوَايَتِهِ « وَرَجَبُ مُضَرَ ». وَفِى رِوَايَةِ أَبِى بَكْرٍ « فَلاَ تَرْجِعُوا بَعْدِى »."
            },
            {
                "hadithNo": "4384",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from 'Abdur-Rahman bin Abi Bakrah that his father said: \"On that day, he (s.a.w) sat on his camel and someone took hold of its nose-ring, and he said: 'Do you know what day this is?' They said: 'Allah and His Messenger know best,' until we thought that he was going to call it by another name. He said: 'Is it not the Day of Sacrifice?' We said: 'Yes indeed, O Messenger of Allah.' He said: 'What month is this?' We said: 'Allah and His Messenger know best.' He said: 'Is it not Dhul-Hijjah?' We said: 'Yes indeed, O Messenger of Allah.' He said: 'What land is this?' We said: 'Allah and His Messenger know best,' until we thought that he was going to call it by another name. He said: 'Is it not Al-Baldah (the city of Makkah)?' We said: 'Yes indeed, O Messenger of Allah.' He said: 'Your blood, your wealth and your honor are sacred to you, as sacred as this day of yours, in this month of yours, in this land of yours. Let those who are present convey it to those who are absent.' Then he turned towards two speckled black and white rams and sacrificed them, and to a flock of sheep which he distributed amongst us.",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِىٍّ الْجَهْضَمِىُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَوْنٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِى بَكْرَةَ عَنْ أَبِيهِ قَالَ لَمَّا كَانَ ذَلِكَ الْيَوْمُ قَعَدَ عَلَى بَعِيرِهِ وَأَخَذَ إِنْسَانٌ بِخِطَامِهِ فَقَالَ « أَتَدْرُونَ أَىَّ يَوْمٍ هَذَا ». قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ. حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ سِوَى اسْمِهِ. فَقَالَ « أَلَيْسَ بِيَوْمِ النَّحْرِ ». قُلْنَا بَلَى يَا رَسُولَ اللَّهِ. قَالَ « فَأَىُّ شَهْرٍ هَذَا ». قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ « أَلَيْسَ بِذِى الْحِجَّةِ ». قُلْنَا بَلَى يَا رَسُولَ اللَّهِ. قَالَ « فَأَىُّ بَلَدٍ هَذَا ». قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ - قَالَ - حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ سِوَى اسْمِهِ. قَالَ « أَلَيْسَ بِالْبَلْدَةِ ». قُلْنَا بَلَى يَا رَسُولَ اللَّهِ. قَالَ « فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِى شَهْرِكُمْ هَذَا فِى بَلَدِكُمْ هَذَا فَلْيُبَلِّغِ الشَّاهِدُ الْغَائِبَ ». قَالَ ثُمَّ انْكَفَأَ إِلَى كَبْشَيْنِ أَمْلَحَيْنِ فَذَبَحَهُمَا وَإِلَى جُزَيْعَةٍ مِنَ الْغَنَمِ فَقَسَمَهَا بَيْنَنَا."
            },
            {
                "hadithNo": "4385",
                "chapterNo": "9",
                "hadithEnglish": "'Abdur-Rahman bin Abi Bakrah narrated that his father said: \"When that day came, the Prophet (s.a.w) sat on a camel and a man was holding on to its rope or reins...\" and he mentioned a Hadith like that of Yazid bin Zurai' (no 4384).",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ عَنِ ابْنِ عَوْنٍ قَالَ قَالَ مُحَمَّدٌ قَالَ عَبْدُ الرَّحْمَنِ بْنُ أَبِى بَكْرَةَ عَنْ أَبِيهِ قَالَ لَمَّا كَانَ ذَلِكَ الْيَوْمُ جَلَسَ النَّبِىُّ -صلى الله عليه وسلم- عَلَى بَعِيرٍ - قَالَ - وَرَجُلٌ آخِذٌ بِزِمَامِهِ - أَوْ قَالَ بِخِطَامِهِ - فَذَكَرَ نَحْوَ حَدِيثِ يَزِيدَ بْنِ زُرَيْعٍ."
            },
            {
                "hadithNo": "4386",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated that Abi Bakrah said: \"The Messenger of Allah (s.a.w) addressed us on the Day of Sacrifice and said: 'What day is this?'\"... they quoted a Hadith like that of Ibn 'Awn (no. 4385), except that he did not mention: \"Your honor\" and he did not mention: \"Then he turned towards two speckled black and white rams,\" etc. And in his Hadith he said: \"As sacred as this day of yours, in this month of yours, in this land of yours, until the Day you meet your Lord. Have I not conveyed (the message)?\" They said: \"Yes.\" He said: \"O Allah, bear witness.\"",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِى بَكْرَةَ وَعَنْ رَجُلٍ آخَرَ هُوَ فِى نَفْسِى أَفْضَلُ مِنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِى بَكْرَةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ وَأَحْمَدُ بْنُ خِرَاشٍ قَالاَ حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا قُرَّةُ بِإِسْنَادِ يَحْيَى بْنِ سَعِيدٍ - وَسَمَّى الرَّجُلَ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ - عَنْ أَبِى بَكْرَةَ قَالَ خَطَبَنَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَوْمَ النَّحْرِ فَقَالَ « أَىُّ يَوْمٍ هَذَا ». وَسَاقُوا الْحَدِيثَ بِمِثْلِ حَدِيثِ ابْنِ عَوْنٍ غَيْرَ أَنَّهُ لاَ يَذْكُرُ « وَأَعْرَاضَكُمْ ». وَلاَ يَذْكُرُ ثُمَّ انْكَفَأَ إِلَى كَبْشَيْنِ وَمَا بَعْدَهُ وَقَالَ فِى الْحَدِيثِ « كَحُرْمَةِ يَوْمِكُمْ هَذَا فِى شَهْرِكُمْ هَذَا فِى بَلَدِكُمْ هَذَا إِلَى يَوْمِ تَلْقَوْنَ رَبَّكُمْ أَلاَ هَلْ بَلَّغْتُ ». قَالُوا نَعَمْ. قَالَ « اللَّهُمَّ اشْهَدْ »."
            },
            {
                "hadithNo": "4387",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that 'Alqamah bin Wa'il narrated that his father told him: \"I was sitting with the Prophet (s.a.w) when a man came leading another on a rope. He said: 'O Messenger of Allah, this man killed my brother.' The Messenger of Allah (s.a.w) said: 'Did you kill him?' He said: 'If he does not admit it, I will establish proof against him.' He said: 'Yes, I killed him.' He said: 'How did you kill him?' He said: 'He and I were striking leaves from a tree, and he insulted me so I got angry and struck him with the axe on the side of his head and killed him.' The Prophet (s.a.w) said to him: 'Do you have anything with which to pay the Diyah for yourself?' He said: 'I have no property except my cloak and my axe.' He said: 'Perhaps your people will pay your ransom?' He said: 'I am too insignificant among my people for that.' He threw the rope to him and said: 'Take your companion away.' The man took him away, and when he turned away, the Messenger of Allah (s.a.w) said: 'If he kills him he will be like him.' He came back and said: 'O Messenger of Allah, I have heard that what you said: \"If he kills him he will be like him,\" but I took him at your command.' The Messenger of Allah (s.a.w) said: 'Don't you want him to carry your sin and the sin of your companion?' He said: 'O Prophet of Allah, yes.' He said: 'If so, then let it be,' and he threw the rope down and let him go.\"",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِىُّ حَدَّثَنَا أَبِى حَدَّثَنَا أَبُو يُونُسَ عَنْ سِمَاكِ بْنِ حَرْبٍ أَنَّ عَلْقَمَةَ بْنَ وَائِلٍ حَدَّثَهُ أَنَّ أَبَاهُ حَدَّثَهُ قَالَ إِنِّى لَقَاعِدٌ مَعَ النَّبِىِّ -صلى الله عليه وسلم- إِذْ جَاءَ رَجُلٌ يَقُودُ آخَرَ بِنِسْعَةٍ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا قَتَلَ أَخِى. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَقَتَلْتَهُ ». فَقَالَ إِنَّهُ لَوْ لَمْ يَعْتَرِفْ أَقَمْتُ عَلَيْهِ الْبَيِّنَةَ. قَالَ نَعَمْ. قَتَلْتُهُ قَالَ « كَيْفَ قَتَلْتَهُ ». قَالَ كُنْتُ أَنَا وَهُوَ نَخْتَبِطُ مِنْ شَجَرَةٍ فَسَبَّنِى فَأَغْضَبَنِى فَضَرَبْتُهُ بِالْفَأْسِ عَلَى قَرْنِهِ فَقَتَلْتُهُ. فَقَالَ لَهُ النَّبِىُّ -صلى الله عليه وسلم- « هَلْ لَكَ مِنْ شَىْءٍ تُؤَدِّيهِ عَنْ نَفْسِكَ ». قَالَ مَا لِى مَالٌ إِلاَّ كِسَائِى وَفَأْسِى. قَالَ « فَتَرَى قَوْمَكَ يَشْتَرُونَكَ ». قَالَ أَنَا أَهْوَنُ عَلَى قَوْمِى مِنْ ذَاكَ. فَرَمَى إِلَيْهِ بِنِسْعَتِهِ. وَقَالَ « دُونَكَ صَاحِبَكَ ». فَانْطَلَقَ بِهِ الرَّجُلُ فَلَمَّا وَلَّى قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ». فَرَجَعَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ بَلَغَنِى أَنَّكَ قُلْتَ « إِنْ قَتَلَهُ فَهُوَ مِثْلُهُ ». وَأَخَذْتُهُ بِأَمْرِكَ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَمَا تُرِيدُ أَنْ يَبُوءَ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ ». قَالَ يَا نَبِىَّ اللَّهِ - لَعَلَّهُ قَالَ - بَلَى. قَالَ « فَإِنَّ ذَاكَ كَذَاكَ ». قَالَ فَرَمَى بِنِسْعَتِهِ وَخَلَّى سَبِيلَهُ."
            },
            {
                "hadithNo": "4388",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated from 'Alqamah bin Wa'il that his father said: \"A man who had killed another man was brought to the Messenger of Allah (s.a.w) by the heir of the one who had been killed, and (the Messenger of Allah (s.a.w) gave the heir the right to retaliate). He took him away with a rope around his neck by which he was leading him. When he left, the Messenger of Allah (s.a.w) said: 'The killer and the slain are both in Hell' A man went to that man and told him what the Messenger of Allah (s.a.w) had said, so he let him go.\" Isma'il bin Salim said: \"I mentioned that to Habib bin Abi Thabit and he said: 'Ibn Ashwa' told me that the Prophet (s.a.w) asked him to let him go and he refused.\"'",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ سَالِمٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَ أُتِىَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- بِرَجُلٍ قَتَلَ رَجُلاً فَأَقَادَ وَلِىَّ الْمَقْتُولِ مِنْهُ فَانْطَلَقَ بِهِ وَفِى عُنُقِهِ نِسْعَةٌ يَجُرُّهَا فَلَمَّا أَدْبَرَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « الْقَاتِلُ وَالْمَقْتُولُ فِى النَّارِ ». فَأَتَى رَجُلٌ الرَّجُلَ فَقَالَ لَهُ مَقَالَةَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَخَلَّى عَنْهُ. قَالَ إِسْمَاعِيلُ بْنُ سَالِمٍ فَذَكَرْتُ ذَلِكَ لِحَبِيبِ بْنِ أَبِى ثَابِتٍ فَقَالَ حَدَّثَنِى ابْنُ أَشْوَعَ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- إِنَّمَا سَأَلَهُ أَنْ يَعْفُوَ عَنْهُ فَأَبَى."
            },
            {
                "hadithNo": "4389",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated from Abu Hurairah that there were two women from Hudhail, one of whom threw a stone at the other and caused her to miscarry. The Prophet (s.a.w) ordered that a slave, male or female, be given as Diyah.",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ عَنْ أَبِى سَلَمَةَ عَنْ أَبِى هُرَيْرَةَ أَنَّ امْرَأَتَيْنِ مِنْ هُذَيْلٍ رَمَتْ إِحْدَاهُمَا الأُخْرَى فَطَرَحَتْ جَنِينَهَا فَقَضَى فِيهِ النَّبِىُّ -صلى الله عليه وسلم- بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ."
            },
            {
                "hadithNo": "4390",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) ruled that a slave, male or female, be given as Diyah for the fetus of a woman from Banu Lihyan who was miscarried and born dead. Then the woman who was ordered to give the slave had died, and the Messenger of Allah (s.a.w) ruled that her estate be given to her sons and husband, and that the Diyah be paid by her 'Asabah.",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنِ ابْنِ شِهَابٍ عَنِ ابْنِ الْمُسَيَّبِ عَنْ أَبِى هُرَيْرَةَ أَنَّهُ قَالَ قَضَى رَسُولُ اللَّهِ -صلى الله عليه وسلم- فِى جَنِينِ امْرَأَةٍ مِنْ بَنِى لِحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِى قُضِىَ عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ فَقَضَى رَسُولُ اللَّهِ -صلى الله عليه وسلم- بِأَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا."
            },
            {
                "hadithNo": "4391",
                "chapterNo": "11",
                "hadithEnglish": "Abu Hurairah said: \"Two women from Hudhail fought and one of them threw a rock at the other and killed her and the child in her womb. They referred the matter to the Messenger of Allah (s.a.w), and the Messenger of Allah (s.a.w) ruled that the Diyah for her fetus was a slave, male or female, and he ruled that the Diyah for the woman be paid by her (the killer's) 'A.qilah, and that her children and those who were with her would inherit her estate. Hamal bin An-Nabighah Al-Hudhali said: 'O Messenger of Allah, how can a penalty be paid for one who did not drink or eat, or speak or make any sound (he said so rhyming the words in a poetic way)? Such a one should be overlooked.' The Messenger of Allah (s.a.w) said: 'This man is one of the brothers of the soothsayers,' because of the rhymed speech with which he spoke.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ ح وَحَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِىُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ عَنِ ابْنِ الْمُسَيَّبِ وَأَبِى سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَ اقْتَتَلَتِ امْرَأَتَانِ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الأُخْرَى بِحَجَرٍ فَقَتَلَتْهَا وَمَا فِى بَطْنِهَا فَاخْتَصَمُوا إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَضَى رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَنَّ دِيَةَ جَنِينِهَا غُرَّةٌ عَبْدٌ أَوْ وَلِيدَةٌ وَقَضَى بِدِيَةِ الْمَرْأَةِ عَلَى عَاقِلَتِهَا وَوَرَّثَهَا وَلَدَهَا وَمَنْ مَعَهُمْ فَقَالَ حَمَلُ بْنُ النَّابِغَةِ الْهُذَلِىُّ يَا رَسُولَ اللَّهِ كَيْفَ أَغْرَمُ مَنْ لاَ شَرِبَ وَلاَ أَكَلَ وَلاَ نَطَقَ وَلاَ اسْتَهَلَّ فَمِثْلُ ذَلِكَ يُطَلُّ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ ». مِنْ أَجْلِ سَجْعِهِ الَّذِى سَجَعَ."
            },
            {
                "hadithNo": "4392",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"Two women fought...\" and he quoted the Hadith (as no. 4390), but he did not mention: \"Her children and those who were with her would inherit her estate.\" And he said: \"Someone said: 'Why should we pay the Diyah?\"' But he did not mention Hamal bin Malik by name.",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ عَنْ أَبِى سَلَمَةَ عَنْ أَبِى هُرَيْرَةَ قَالَ اقْتَتَلَتِ امْرَأَتَانِ. وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ وَلَمْ يَذْكُرْ وَوَرَّثَهَا وَلَدَهَا وَمَنْ مَعَهُمْ. وَقَالَ فَقَالَ قَائِلٌ كَيْفَ نَعْقِلُ وَلَمْ يُسَمِّ حَمَلَ بْنَ مَالِكٍ."
            },
            {
                "hadithNo": "4393",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Al-Mughirah bin Shu'bah said: \"A woman struck pregnant co-wife with a tent pole, killing her. One of the women was from the tribe of Lihyan. The Messenger of Allah (s.a.w) ruled that the Diyah for the one who had been killed was to be paid by the 'Asabah of the killer, and a slave, male or female, should be given (as Diyah) for the fetus in her womb. A man from the 'Asabah of the killer said: 'Should we pay the Diyah for one who did not eat or drink or make any sound? Such a one should be overlooked.' The Messenger of Allah (s.a.w) said: 'Is this rhymed speech like that of the Bedouin?\"' He said: \"And he (s.a.w) imposed the Diyah on them.\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِىُّ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ الْخُزَاعِىِّ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ ضَرَبَتِ امْرَأَةٌ ضَرَّتَهَا بِعَمُودِ فُسْطَاطٍ وَهِىَ حُبْلَى فَقَتَلَتْهَا - قَالَ - وَإِحْدَاهُمَا لِحْيَانِيَّةٌ - قَالَ - فَجَعَلَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- دِيَةَ الْمَقْتُولَةِ عَلَى عَصَبَةِ الْقَاتِلَةِ وَغُرَّةً لِمَا فِى بَطْنِهَا. فَقَالَ رَجُلٌ مِنْ عَصَبَةِ الْقَاتِلَةِ أَنَغْرَمُ دِيَةَ مَنْ لاَ أَكَلَ وَلاَ شَرِبَ وَلاَ اسْتَهَلَّ فَمِثْلُ ذَلِكَ يُطَلُّ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَسَجْعٌ كَسَجْعِ الأَعْرَابِ ». قَالَ وَجَعَلَ عَلَيْهِمُ الدِّيَةَ."
            },
            {
                "hadithNo": "4394",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Al-Mughirah bin Shu'bah said: \"A woman killed her co-wife with a tent pole. Her case was brought to the Messenger of Allah (s.a.w) and he ruled that her 'Aqilah should pay the Diyah. She was pregnant, so he also ruled that a slave be given as Diyah for the fetus. One of her 'Asabah said: 'Should we pay Diyah for one who did not eat or drink or cry or make any sound? Such a one should be overlooked.' He said: 'Is this rhymed speech like that of the Bedouin?\"'",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا مُفَضَّلٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ. أَنَّ امْرَأَةً قَتَلَتْ ضَرَّتَهَا بِعَمُودِ فُسْطَاطٍ فَأُتِىَ فِيهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقَضَى عَلَى عَاقِلَتِهَا بِالدِّيَةِ وَكَانَتْ حَامِلاً فَقَضَى فِى الْجَنِينِ بِغُرَّةٍ. فَقَالَ بَعْضُ عَصَبَتِهَا أَنَدِى مَنْ لاَ طَعِمَ وَلاَ شَرِبَ وَلاَ صَاحَ فَاسْتَهَلَّ وَمِثْلُ ذَلِكَ يُطَلُّ قَالَ فَقَالَ « سَجْعٌ كَسَجْعِ الأَعْرَابِ »."
            },
            {
                "hadithNo": "4395",
                "chapterNo": "11",
                "hadithEnglish": "A Hadith like that of Jarir and Mufaddal (no. 4393, 4394) was narrated from Mansur with this chain.",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ حَاتِمٍ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِىٍّ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ بِهَذَا الإِسْنَادِ مِثْلَ مَعْنَى حَدِيثِ جَرِيرٍ وَمُفَضَّلٍ."
            },
            {
                "hadithNo": "4396",
                "chapterNo": "11",
                "hadithEnglish": "This Hadith was narrated from Mansur with their chain, except that it says: \"She miscarried, and the matter was referred to the Prophet (s.a.w) who ruled that a slave be given (as Diyah ). And he imposed that on the relatives of the woman; but in this Hadith it does not mention the Diyah for the woman.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ مَنْصُورٍ بِإِسْنَادِهِمُ الْحَدِيثَ بِقِصَّتِهِ. غَيْرَ أَنَّ فِيهِ فَأَسْقَطَتْ فَرُفِعَ ذَلِكَ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَقَضَى فِيهِ بِغُرَّةٍ وَجَعَلَهُ عَلَى أَوْلِيَاءِ الْمَرْأَةِ. وَلَمْ يَذْكُرْ فِى الْحَدِيثِ دِيَةَ الْمَرْأَةِ."
            },
            {
                "hadithNo": "4397",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Al-Miswar bin Makhramah said: \"'Umar bin Al-Khattab consulted the people about Diyah for a woman's miscarriage. Al-Mughirah bin Shu'bah said: 'I saw the Prophet (s.a.w) ruling that a slave, male or female, should be given.' 'Umar said: 'Bring me someone who can testify with you.' He (the narrator) said: 'Muhammad bin Maslamah testified with him.'\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لأَبِى بَكْرٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَ اسْتَشَارَ عُمَرُ بْنُ الْخَطَّابِ النَّاسَ فِى إِمْلاَصِ الْمَرْأَةِ فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ شَهِدْتُ النَّبِىَّ -صلى الله عليه وسلم- قَضَى فِيهِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ. قَالَ فَقَالَ عُمَرُ ائْتِنِى بِمَنْ يَشْهَدُ مَعَكَ قَالَ فَشَهِدَ لَهُ مُحَمَّدُ بْنُ مَسْلَمَةَ."
            }
        ]
    }
]