[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/024001",
        "Body":  "(Here is) a Surah which We have revealed and enjoined, and\n\t\t\twherein We have revealed plain tokens, that haply we may take\n\t\t\theed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/024010",
        "Body":  "And had it not been for the grace of Allah and His mercy unto\n\t\t\tyou, and that Allah is Clement, Wise, (ye had been undone)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/024011",
        "Body":  "Lo! they who spread the slander are a gang among you. Deem it not\n\t\t\ta bad thing for you; say, it is good for you. Unto every man of\n\t\t\tthem (will be paid that which he hath earned of the sin; and as\n\t\t\tfor him among them who had the greater share therein, his will be\n\t\t\tan awful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/024012",
        "Body":  "Why did not the believers, men and women, when ye heard it, think\n\t\t\tgood of their own folk; and say: It is a manifest untruth?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/024013",
        "Body":  "Why did they not produce four witnesses? Since they produce not\n\t\t\twitnesses, they verily are liars in the sight of Allah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/024014",
        "Body":  "Had it not been for the grace of Allah and His mercy unto you in\n\t\t\tthe world and the Hereafter an awful doom had overtaken you for\n\t\t\tthat whereof ye murmured."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/024015",
        "Body":  "When ye welcomed it with your tongues, and uttered with your\n\t\t\tmouths that whereof ye had no knowledge, ye counted it a trifle.\n\t\t\tIn the sight of Allah it is very great."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/024016",
        "Body":  "Wherefore, when ye heard it, said ye not: It is not for us to\n\t\t\tspeak of this. Glory be to Thee (O Allah); This is awful calumny."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/024017",
        "Body":  "Allah admonisheth you that ye repeat not the like thereof ever,\n\t\t\tif ye are (in truth) believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/024018",
        "Body":  "And He expoundeth unto you His revelations. Allah is Knower,\n\t\t\tWise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/024019",
        "Body":  "Lo! those who love that slander should be spread concerning those\n\t\t\twho believe, theirs will be a painful punishment in the world and\n\t\t\tthe Hereafter. Allah knoweth. Ye know not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/024002",
        "Body":  "The adulterer and the adulteress, scourge ye each one of them\n\t\t\t(with) a hundred stripes. And let not pity for the twain withhold\n\t\t\tyou from obedience to Allah, if ye believe in Allah and the Last\n\t\t\tDay. And let a party of believers witness their punishment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/024020",
        "Body":  "Had it not been for the grace of Allah and His mercy unto you,\n\t\t\tand that Allah is Clement, Merciful, (ye had been undone)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/024021",
        "Body":  "O ye who believe! Follow not the footsteps of the devil. Unto\n\t\t\twhomsoever followeth the footsteps of the devil, lo! he\n\t\t\tcommandeth filthiness and wrong. Had it not been for the grace of\n\t\t\tAllah and His mercy unto you, not one of you would ever have\n\t\t\tgrown pure. But Allah causeth whom He will to grow. And Allah is\n\t\t\tHearer, Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/024022",
        "Body":  "And let not those who possess dignity and ease among you swear\n\t\t\tnot to give to the near of kin and to the needy, and to fugitives\n\t\t\tfor the cause of Allah. Let them forgive and show indulgence.\n\t\t\tYearn ye not that Allah may forgive you? Allah is Forgiving,\n\t\t\tMerciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/024023",
        "Body":  "Lo! as for those who traduce virtuous, believing women (who are)\n\t\t\tcareless, cursed are they in the world and the Hereafter. Theirs\n\t\t\twill be an awful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/024024",
        "Body":  "On the day when their tongues and their hands and their feet\n\t\t\ttestify against them as to what they used to do,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/024025",
        "Body":  "On that day Allah will pay them their just due, and they will\n\t\t\tknow that Allah, He is the Manifest Truth."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/024026",
        "Body":  "Vile women are for vile men, and vile men for vile women. Good\n\t\t\twomen are for good men, and good men for good women; such are\n\t\t\tinnocent of that which people say: For them is pardon and a\n\t\t\tbountiful provision."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/024027",
        "Body":  "O ye who believe! Enter not houses other than your own without\n\t\t\tfirst announcing your presence and invoking peace upon the folk\n\t\t\tthereof. That is better for you, that ye may be heedful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/024028",
        "Body":  "And if ye find no one therein, still enter not until permission\n\t\t\thath been given. And if it be said unto you: Go away again, then\n\t\t\tgo away, for it is purer for you. Allah knoweth what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/024029",
        "Body":  "(It is) no sin for you to enter uninhabited houses wherein is\n\t\t\tcomfort for you. Allah knoweth what ye proclaim and what ye hide."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/024003",
        "Body":  "The adulterer shall not marry save an adulteress or an\n\t\t\tidolatress, and the adulteress none shall marry save an adulterer\n\t\t\tor an idolater. All that is forbidden unto believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/024030",
        "Body":  "Tell the believing men to lower their gaze and be modest. That is\n\t\t\tpurer for them. Lo! Allah is Aware of what they do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/024031",
        "Body":  "And tell the believing women to lower their gaze and be modest,\n\t\t\tand to display of their adornment only that which is apparent,\n\t\t\tand to draw their veils over their bosoms, and not to reveal\n\t\t\ttheir adornment save to their own husbands or fathers or\n\t\t\thusbands\u0027 fathers, or their sons or their husbands\u0027 sons, or\n\t\t\ttheir brothers or their brothers\u0027 sons or sisters\u0027 sons, or their\n\t\t\twomen, or their slaves, or male attendants who lack vigor, or\n\t\t\tchildren who know naught of women\u0027s nakedness. And let them not\n\t\t\tstamp their feet so as to reveal what they hide of their\n\t\t\tadornment. And turn unto Allah together, O believers, in order\n\t\t\tthat ye may succeed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/024032",
        "Body":  "And marry such of you as are solitary and the pious of your\n\t\t\tslaves and maid servants. If they be poor; Allah will enrich them\n\t\t\tof His bounty. Allah is of ample means, Aware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/024033",
        "Body":  "And let those who cannot find a match keep chaste till Allah give\n\t\t\tthem independence by His grace. And such of your slaves as seek a\n\t\t\twriting (of emancipation), write it for them if ye are aware of\n\t\t\taught of good in them, and bestow upon them of the wealth of\n\t\t\tAllah which He hath bestowed upon you. Force not your slave girls\n\t\t\tto whoredom that ye may seek enjoyment of the life of the world,\n\t\t\tif they would preserve their chastity. And if one force them,\n\t\t\tthen (unto them), after their compulsion, Lo! Allah will be\n\t\t\tForgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/024034",
        "Body":  "And verily We have sent down for you revelations that make plain,\n\t\t\tand the example of those who passed away before you. An\n\t\t\tadmonition unto those who ward off (evil)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/024035",
        "Body":  "Allah is the Light of the heavens and the earth. The similitude\n\t\t\tof His light is as a niche wherein is a lamp. The lamp is in a\n\t\t\tglass. The glass is as it were a shining star. (This lamp is)\n\t\t\tkindled from a blessed tree, an olive neither of the East nor of\n\t\t\tthe West, whose oil would almost glow forth (of itself) though no\n\t\t\tfire touched it. Light upon light, Allah guideth unto His light\n\t\t\twhom He will. And Allah speaketh to mankind in allegories, for\n\t\t\tAllah is knower of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/024036",
        "Body":  "(This lamp is found) in houses which Allah hath allowed to be\n\t\t\texalted and that His name shall be remembered therein. Therein do\n\t\t\toffer praise to Him at morn and evening--"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/024037",
        "Body":  "Men whom neither merchandise nor sale beguileth from remembrance\n\t\t\tof Allah and constancy in prayer and paying to the poor their\n\t\t\tdue; who fear a day when hearts and eyeballs will be overturned;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/024038",
        "Body":  "That Allah may reward them with the best of what they did, and\n\t\t\tincrease reward for them of His bounty. Allah giveth blessings\n\t\t\twithout stint to whom He will."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/024039",
        "Body":  "As for those who disbelieve, their deeds are as a mirage in a\n\t\t\tdesert. The thirsty one supposeth it to be water till he cometh\n\t\t\tunto it and findeth it naught, and findeth, in the place thereof,\n\t\t\tAllah, Who payeth him his due; and Allah is swift at reckoning."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/024004",
        "Body":  "And those who accuse honorable women but bring not four\n\t\t\twitnesses, scourge them (with) eighty stripes and never\n\t\t\t(afterward) accept their testimony--They indeed are evildoers--"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/024040",
        "Body":  "Or as darkness on a vast, abysmal sea. There covereth him a wave,\n\t\t\tabove which is a wave, above which is a cloud. Layer upon layer\n\t\t\tof darkness. When he holdeth out his hand he scarce can see it.\n\t\t\tAnd he for whom Allah hath not appointed light, for him there is\n\t\t\tno light."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/024041",
        "Body":  "Hast thou not seen that Allah, He it is Whom all who are in the\n\t\t\theavens and the earth praise; and the birds in their flight? Of\n\t\t\teach He knoweth verily the worship and the praise; and Allah is\n\t\t\tAware of what they do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/024042",
        "Body":  "And unto Allah belongeth the sovereignty of the heavens and the\n\t\t\tearth, and unto Allah is the journeying."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/024043",
        "Body":  "Hast thou not seen how Allah wafteth the clouds, then gathereth\n\t\t\tthem, then maketh them layers, and thou seest the rain come forth\n\t\t\tfrom between them; He sendeth down from the heaven mountains\n\t\t\twherein is hail, and smiteth therewith whom He will, and averteth\n\t\t\tit from whom He will. The flashing of His lightning all but\n\t\t\tsnatcheth away the sight."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/024044",
        "Body":  "Allah causeth the revolution of the day and the night. Lo! herein\n\t\t\tis indeed a lesson for those who see."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/024045",
        "Body":  "Allah hath created every animal of water. Of them is (a kind)\n\t\t\tthat goeth upon its belly and (a kind) that goeth upon two legs\n\t\t\tand (a kind) that goeth upon four. Allah createth what He will.\n\t\t\tLo! Allah is Able to do all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/024046",
        "Body":  "Verily We have sent down revelations and explained them. Allah\n\t\t\tguideth whom He will unto a straight path."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/024047",
        "Body":  "And they say: We believe in Allah and the messenger, and we obey;\n\t\t\tthen after that a faction of them turn away. Such are not\n\t\t\tbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/024048",
        "Body":  "And when they appeal unto Allah and His messenger to judge\n\t\t\tbetween them, lo! a faction of them are averse;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/024049",
        "Body":  "But if right had been with them they would have come unto him\n\t\t\twillingly."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/024005",
        "Body":  "Save those who afterward repent and make amends. (For such) lo!\n\t\t\tAllah is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/024050",
        "Body":  "Is there in their hearts a disease, or have they doubts, or fear\n\t\t\tthey lest Allah and His messenger should wrong them in judgment?\n\t\t\tNay, but such are evil-doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/024051",
        "Body":  "The saying of (all true) believers when they appeal unto Allah\n\t\t\tand His messenger to judge between them is only that they say: We\n\t\t\thear and we obey. And such are the successful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/024052",
        "Body":  "He who obeyeth Allah and His messenger, and feareth Allah, and\n\t\t\tkeepeth duty (unto Him): such indeed are the victorious."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/024053",
        "Body":  "They swear by Allah solemnly that, if thou order them, they will\n\t\t\tgo forth. Say: Swear not; known obedience (is better). Lo! Allah\n\t\t\tis Informed of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/024054",
        "Body":  "Say: Obey Allah and obey the messenger. But if ye turn away, then\n\t\t\t(it is) for him (to do) only that wherewith he hath been charged,\n\t\t\tand for you (to do) only that wherewith ye have been charged. If\n\t\t\tye obey him, ye will go aright. But the messenger hath no other\n\t\t\tcharge than to convey (the message), plainly."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/024055",
        "Body":  "Allah hath promised such of you as believe and do good works that\n\t\t\tHe will surely make them to succeed (the present rulers) in the\n\t\t\tearth even as He caused those who were before them to succeed\n\t\t\tothers); and that He will surely establish for them their\n\t\t\treligion which He hath approved for them, a will give them in\n\t\t\texchange safety after their fear. They serve Me. They ascribe no\n\t\t\tthing as partner unto Me. Those who disbelieve henceforth, they\n\t\t\tare the miscreants."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/024056",
        "Body":  "Establish worship and pay the poor due and obey the messenger,\n\t\t\tthat haply ye may find mercy."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/024057",
        "Body":  "Think not that the disbelievers can, escape in the land. Fire\n\t\t\twill be their home, a hapless journey\u0027s end!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/024058",
        "Body":  "O ye who believe! Let your slaves, and those of you who have not\n\t\t\tcome to puberty, ask leave of you at three times (before they\n\t\t\tcome into your presence): Before the prayer of dawn, and when ye\n\t\t\tlay aside your raiment for the heat of noon, and after the prayer\n\t\t\tof night. Three times of privacy for you. It is no sin for them\n\t\t\tor for you at other times, when some of you go round attendant\n\t\t\tupon others (if they come into your presence without leave). Thus\n\t\t\tAllah maketh clear the revelations for you. Allah is Knower,\n\t\t\tWise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/024059",
        "Body":  "And when the children among you come to puberty then let them ask\n\t\t\tleave even as those before them used to ask it. Thus Allah maketh\n\t\t\tclear His revelations for you. Allah is knower, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/024006",
        "Body":  "As for those who accuse their wives but have no witnesses except\n\t\t\tthemselves; let the testimony of one of them be four testimonies,\n\t\t\t(swearing) by Allah that he is of those who speak the truth;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/024060",
        "Body":  "As for women past child-bearing, who have no hope of marriage, it\n\t\t\tis no sin for them if they discard their (outer) clothing in such\n\t\t\ta way as not to show adornment. But to refrain is better for\n\t\t\tthem. Allah is Hearer, Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/024061",
        "Body":  "No blame is there upon the blind nor any blame upon the lame nor\n\t\t\tany blame upon the sick nor on yourselves if ye eat from your\n\t\t\thouses, or the houses of your fathers, or the houses of your\n\t\t\tmothers, or the houses of your brothers, or the houses of your\n\t\t\tsisters, or the houses of your fathers\u0027 brothers, or the houses\n\t\t\tof your fathers\u0027 sisters, or the houses of your mothers\u0027\n\t\t\tbrothers, or the houses of your mothers\u0027 sisters, or (from that)\n\t\t\twhereof ye hold the keys, or (from the house) of a friend. No sin\n\t\t\tshall it be for you whether ye eat together or apart. But when ye\n\t\t\tenter houses, salute one another with a greeting from Allah,\n\t\t\tblessed and sweet. Thus Allah maketh clear His revelations for\n\t\t\tyou, that haply ye may understand."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/024062",
        "Body":  "They only are the true believers who believe in Allah and His\n\t\t\tmessenger and, when they are with him on some common errand, go\n\t\t\tnot away until they have asked leave of him. Lo! those who ask\n\t\t\tleave of thee, those are they who believe in Allah and His\n\t\t\tmessenger. So, if they ask thy leave for some affair of theirs,\n\t\t\tgive leave to whom thou wilt of them, and ask for them\n\t\t\tforgiveness of Allah. Lo! Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/024063",
        "Body":  "Make not the calling of the messenger among you as your calling\n\t\t\tone of another. Allah knoweth those of you who steal away, hiding\n\t\t\tthemselves. And let those who conspire to evade orders beware\n\t\t\tlest grief or painful punishment befall them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/024064",
        "Body":  "Lo! verily unto Allah belongeth whatsoever is in the heavens and\n\t\t\tthe earth. He knoweth your condition. And (He knoweth) the Day\n\t\t\twhen they are returned unto Him so that He may inform them of\n\t\t\twhat they did. Allah is Knower of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/024007",
        "Body":  "And yet a fifth, invoking the curse of Allah on him if he is of\n\t\t\tthose who lie."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/024008",
        "Body":  "And it shall avert the punishment from her if she bear witness\n\t\t\tbefore Allah four times that the thing he saith is indeed false,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "24",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/024009",
        "Body":  "And a fifth (time) that the wrath of Allah be upon her if he\n\t\t\tspeaketh truth."
    }
]
