[
  {
    "SurahNumber": "64",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "See surah {10}, note [11]."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "I.e., in accordance with the exigencies of human life.\\n\\t\\t\\t\\tSee also note [9] on  7:11 ."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "This is an allusion to the disasters and the suffering\\n\\t\\t\\t\\twhich, as history shows, inevitably befall every\\n\\t\\t\\t\\tcommunity or nation bent on rejecting the basic ethical\\n\\t\\t\\t\\ttruths and, thus, all standards of morality."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "I.e., apostles from their own midst, entrusted with\\n\\t\\t\\t\\tdivine messages specifically meant for them. The\\n\\t\\t\\t\\texpression \"time and again\" is conditioned by the phrase\\n\\t\\t\\t\\tkanat ta'atihim, which implies repetition and duration."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "Lit., \"guide us\". This negative response is\\n\\t\\t\\t\\tcharacteristic of people who, in result of their own\\n\\t\\t\\t\\testrangement from all moral standards, are instinctively,\\n\\t\\t\\t\\tand deeply, distrustful of all things human and cannot,\\n\\t\\t\\t\\ttherefore, accept the idea that a divine message could\\n\\t\\t\\t\\tmanifest itself through mere human beings that have\\n\\t\\t\\t\\tnothing \"supernatural\" about them."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "Their refusal to believe in resurrection and a life to\\n\\t\\t\\t\\tcome implies a conviction that no one will be called\\n\\t\\t\\t\\tupon, after death, to answer for what he did in life."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "This or a similar interpolation is necessary in view of\\n\\t\\t\\t\\tthe mansub form of the subsequent noun, yawma (lit.,\\n\\t\\t\\t\\t\"day\"), which I am rendering in this context as \"the\\n\\t\\t\\t\\ttime\"."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "I.e., in the words of Razi, \"towards self-surrender to\\n\\t\\t\\t\\tGod's will...[and so] towards gratitude in times of ease,\\n\\t\\t\\t\\tand patience in times of misfortune\". It is also possible\\n\\t\\t\\t\\t- as some of the commentators do - to understand the\\n\\t\\t\\t\\tphrase in another sense, namely, \"if anyone believes in\\n\\t\\t\\t\\tGod, He [i.e., God] guides his heart\". However, the\\n\\t\\t\\t\\trendering adopted by me seems to be preferable inasmuch\\n\\t\\t\\t\\tas it stresses the idea that consious belief in God\\n\\t\\t\\t\\timpels man's reason to control and direct his emotions\\n\\t\\t\\t\\tand inclinations in accordance with all that this belief\\n\\t\\t\\t\\timplies."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "13",
    "NoteID": "10",
    "Body": "The above construction of this passage makes it clear,\\n\\t\\t\\t\\tfirstly, that a realisation of God's existence, oneness\\n\\t\\t\\t\\tand almightiness is the innermost purport - and, thus,\\n\\t\\t\\t\\tthe beginning and the end - of God's message to man; and,\\n\\t\\t\\t\\tsecondly, that His prophets can do no more than deliver\\n\\t\\t\\t\\tand expound this message, leaving it to man's reason and\\n\\t\\t\\t\\tfree choice to accept or reject it."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "14",
    "NoteID": "11",
    "Body": "I.e., \"sometimes, your spouses...\", etc. Since, in the\\n\\t\\t\\t\\tteachings of the Qur'an, all moral duties are binding on\\n\\t\\t\\t\\twomen as well as on men, it is obvious that the term\\n\\t\\t\\t\\tazwajikum must not be rendered as \"your wives\", but is to\\n\\t\\t\\t\\tbe understood - according to classical Arabic usage - as\\n\\t\\t\\t\\tapplying equally to both the male and the female partners\\n\\t\\t\\t\\tin a marriage."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "14",
    "NoteID": "12",
    "Body": "Love of his or her family may sometimes tempt a believer\\n\\t\\t\\t\\tto act contrary to the demands of conscience and faith;\\n\\t\\t\\t\\tand, occasionally, one or another of the loved ones -\\n\\t\\t\\t\\twhether wife or husband or child - may consciously try to\\n\\t\\t\\t\\tinduce the person concerned to abandon some of his or her\\n\\t\\t\\t\\tmoral commitments in order to satisfy some real or\\n\\t\\t\\t\\timaginary \"family interest\", and thus becomes the other's\\n\\t\\t\\t\\tspiritual \"enemy\". It is to this latter eventuality that\\n\\t\\t\\t\\tthe next sentence alludes."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "15",
    "NoteID": "13",
    "Body": "For an explanation, see note [28] on  8:28 , which is\\n\\t\\t\\t\\talmost identical with the present passage."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "16",
    "NoteID": "14",
    "Body": "Cf. last sentence of  59:9  and the corresponding note\\n\\t\\t\\t\\t[14]."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "18",
    "NoteID": "15",
    "Body": "See surah {6}, note [65].65_1\\tThe plural \"you\"\\n\\t\\t\\t\\tindicates that the whole community is thus addressed."
  }
]
