[
  {
    "SurahNumber": "39",
    "AyahNumber": "3",
    "NoteID": "1",
    "Body": "This relates not only to the worship of saints, angels\\n\\t\\t\\t\\tand \"deified\" persons as such, but also to that of their\\n\\t\\t\\t\\tsymbolic representations (statues, pictures, relics,\\n\\t\\t\\t\\tetc.) and, in the case of defunct human personalities, of\\n\\t\\t\\t\\ttheir real or reputed tombs. Since all such practices are\\n\\t\\t\\t\\tbased on the worshipper's hope of \"mediation\" between\\n\\t\\t\\t\\thimself and God, they obviously conflict with the concept\\n\\t\\t\\t\\tof His omniscience and justice, and are, therefore -\\n\\t\\t\\t\\tnotwithstanding their widespread occurrence - utterly\\n\\t\\t\\t\\trejected by the Qur'an."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "I.e., between those worshippers and the spiritual leaders\\n\\t\\t\\t\\twho have led them astray (cf. {34:31-33})"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "Cf. {6:22-24} and the corresponding notes."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "The implication is this: Since God is almighty, He can\\n\\t\\t\\t\\thave or do anything that He wills; and so, if He wanted,\\n\\t\\t\\t\\tHe could \"take unto Himself a son\" (which is an allusion\\n\\t\\t\\t\\tto the Christian doctrine of Jesus as \"the son of God\").\\n\\t\\t\\t\\tSince, however, He is \"limitless in His glory\" - i.e.,\\n\\t\\t\\t\\tcomplete in His excellence and utterly remote from all\\n\\t\\t\\t\\timperfection - He is ipso facto remote from the\\n\\t\\t\\t\\tincompleteness inherent in the need of, or desire for,\\n\\t\\t\\t\\tprogeny, which logically precludes the possibility of His\\n\\t\\t\\t\\thaving a \"son\". (Cf. the last sentence of  6:100  and the\\n\\t\\t\\t\\tcorresponding note [88].)"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "See note [I] I on the last but one sentence of  10:5 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "5",
    "NoteID": "6",
    "Body": "See note [5] on  13:2 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "6",
    "NoteID": "7",
    "Body": "See  4:1  and the corresponding note [1]."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "6",
    "NoteID": "8",
    "Body": "Lit., \"eight [in] pairs\", i.e., the male and the female\\n\\t\\t\\t\\tof four kinds of cattle (sheep, goats, camels and bovine\\n\\t\\t\\t\\tcattle). For an explanation of my rendering, see note\\n\\t\\t\\t\\t[130] on {6:143-144}, where the same kinds of\\n\\t\\t\\t\\tdomesticated cattle are spoken of in connection with\\n\\t\\t\\t\\tcertain meaningless, superstitious taboos of pre-Islamic\\n\\t\\t\\t\\ttimes, whereas here they are mentioned as \"bestowed upon\\n\\t\\t\\t\\tyou\" by God, and therefore lawful. Beyond this, the\\n\\t\\t\\t\\tmention of cattle in this context is meant to remind man\\n\\t\\t\\t\\tthat it is God who provides his sustenance and that,\\n\\t\\t\\t\\ttherefore, man is utterly dependent on Him."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "6",
    "NoteID": "9",
    "Body": "Lit., \"by creation after creation, in three darknesses\":\\n\\t\\t\\t\\tan allusion to the successive stages of embryonic\\n\\t\\t\\t\\tdevelopment, repeatedly spoken of in the Qur'an (cf.\\n\\t\\t\\t\\t 22:5  and {23:12-14}), and to the darkness of the womb,\\n\\t\\t\\t\\tthe membrane enveloping the embryo, and its pre-natal\\n\\t\\t\\t\\tblindness."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "6",
    "NoteID": "10",
    "Body": "Lit., \"how, then, are you turned away?\" - i.e., from the\\n\\t\\t\\t\\ttruth."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "7",
    "NoteID": "11",
    "Body": "Or: \"If you deny the truth\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "7",
    "NoteID": "12",
    "Body": "This statement occurs in the Qur'an five times in exactly\\n\\t\\t\\t\\tthe same formulation (apart from the above instance, in\\n\\t\\t\\t\\t 6:164 ,  17:15 ,  35:18  and  53:38  - this last being\\n\\t\\t\\t\\tthe earliest in the chronology of revelation). In the\\n\\t\\t\\t\\tpresent instance, it contains an allusion to (and\\n\\t\\t\\t\\trejection of) the Christian doctrine of \"vicarious\\n\\t\\t\\t\\tatonment\" and, indirectly, to the worship of saints.\\n\\t\\t\\t\\tetc., spoken of in verse {3} ahove and referred to in\\n\\t\\t\\t\\tnote [1]. (See also note [31] on  53:38 .)"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "8",
    "NoteID": "13",
    "Body": "Lit., \"he cries out\", i.e., instinctively, and as a rule."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "8",
    "NoteID": "14",
    "Body": "Lit., \"and gives God compeers (andad, sing. nidd)\". Cf.\\n\\t\\t\\t\\tthe last sentence of  2:22  and the corresponding note\\n\\t\\t\\t\\t[13]."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "9",
    "NoteID": "15",
    "Body": "Alternatively, the above verse could be rendered thus:\\n\\t\\t\\t\\t\"Is, perchance, he who worships . . hoping for his\\n\\t\\t\\t\\tSustainer's grace, [equal to one who denies the truth]?\""
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "10",
    "NoteID": "16",
    "Body": "This interpolation is justified by the fact that the\\n\\t\\t\\t\\tpossessive pronoun in the subsequent phrase \"servants of\\n\\t\\t\\t\\tMine\" obviously relates to God."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "10",
    "NoteID": "17",
    "Body": "I.e., there is always a possibility of doing good and\\n\\t\\t\\t\\t\"migrating from evil unto God\" - which is the permanent,\\n\\t\\t\\t\\tspiritual connotation of the concept of hijrah implied\\n\\t\\t\\t\\there: see note [124] on  4:97 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "15",
    "NoteID": "18",
    "Body": "Implying that on Resurrection Day they will be\\n\\t\\t\\t\\tirretrievably separated from all whom they had loved, and\\n\\t\\t\\t\\tall who had been close to them in this world. The \"loss\\n\\t\\t\\t\\tof one's own self\" signifies, I think, the destruction of\\n\\t\\t\\t\\tone's true identity and uniqueness as a human being,\\n\\t\\t\\t\\twhich is described in the next clause as \"the most\\n\\t\\t\\t\\tobvious loss\" that man may be made to suffer in the life\\n\\t\\t\\t\\tto come."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "16",
    "NoteID": "19",
    "Body": "As in many other instances, the Qur'an alludes in this\\n\\t\\t\\t\\tphrase to the allegorical nature as well as to the real\\n\\t\\t\\t\\tpurpose of all descriptions of the suffering which awaits\\n\\t\\t\\t\\tthe sinners in the hereafter; cf. {74:35-36}- \"that\\n\\t\\t\\t\\t[hell-fire] is indeed one of the great [forewarnings]: a\\n\\t\\t\\t\\twarning to mortal man\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "17",
    "NoteID": "20",
    "Body": "For my rendering of at-taghut as \"powers of evil\", see\\n\\t\\t\\t\\tsurah {2}, note [250]. In the present context, this term\\n\\t\\t\\t\\tapparently circumscribes the seductive force of certain\\n\\t\\t\\t\\tevil ambitions or desires - like striving after power for\\n\\t\\t\\t\\tits own sake, acquisition of wealth by exploiting one's\\n\\t\\t\\t\\tfellow-beings, social advancement by all manner of\\n\\t\\t\\t\\timmoral means, and so forth - any of which may cause man\\n\\t\\t\\t\\tto lose all spiritual orientation, and to be enslaved by\\n\\t\\t\\t\\this passions."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "17",
    "NoteID": "21",
    "Body": "Cf. {10:62-64}."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "18",
    "NoteID": "22",
    "Body": "According to Razi, this describes people who examine\\n\\t\\t\\t\\tevery religious proposition (in the widest sense of this\\n\\t\\t\\t\\tterm) in the light of their own reason, accepting that\\n\\t\\t\\t\\twhich their mind finds to be valid or possible, and\\n\\t\\t\\t\\trejecting all that does not measure up to the test of\\n\\t\\t\\t\\treason. In Raz~'s words, the above verse expresses \"a\\n\\t\\t\\t\\tpraise and commendation of following the evidence\\n\\t\\t\\t\\tsupplied by one's reason (hujjat al-'aql), and of\\n\\t\\t\\t\\treaching one's conclusions in accordance with [the\\n\\t\\t\\t\\tresults of] critical examination (nazar) and logical\\n\\t\\t\\t\\tinference (istidlal).\" A somewhat similar view is\\n\\t\\t\\t\\tadvanced, albeit in simpler terms, by Tabari."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "19",
    "NoteID": "23",
    "Body": "This, to my mind, is the meaning of the prefix fa in\\n\\t\\t\\t\\tfa-man - stressing, by implication, the contrast between\\n\\t\\t\\t\\tthe glad tiding given to those who have attained to faith\\n\\t\\t\\t\\tand the suffering which awaits those \"who shall have lost\\n\\t\\t\\t\\ttheir own selves\" through sinning (verses {15-16})."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "19",
    "NoteID": "24",
    "Body": "In view of the repeated Qur'anic statements that God\\n\\t\\t\\t\\talways accepts a sinner's sincere repentance, provided it\\n\\t\\t\\t\\tis proffered before the hour of death, His ineluctable\\n\\t\\t\\t\\t\"sentence of suffering\" obviously relates to such as die\\n\\t\\t\\t\\twithout repentance, and hence find themselves, as it\\n\\t\\t\\t\\twere, \"already in the fire\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "20",
    "NoteID": "25",
    "Body": "Lit., \"But\" (lakin), indicating a return to the theme of\\n\\t\\t\\t\\tverses {17-18}."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "21",
    "NoteID": "26",
    "Body": "As in many other instances, the above Qur'anic reference\\n\\t\\t\\t\\tto the endless transformations and the miraculous cycle\\n\\t\\t\\t\\tof life and death in all nature serves to emphasize God's\\n\\t\\t\\t\\talmightiness and, specifically, His power to resurrect\\n\\t\\t\\t\\tthe dead - thus alluding, indirectly, to the statement at\\n\\t\\t\\t\\tthe end of the preceding verse that \"never does God fail\\n\\t\\t\\t\\tto fulfil His promise\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "23",
    "NoteID": "27",
    "Body": "Lit., \"has been bestowing from on high\", i.e., step by\\n\\t\\t\\t\\tstep. The verbal form nazzala indicates both gradualness\\n\\t\\t\\t\\tand continuity in the process of divine revelation and\\n\\t\\t\\t\\tmay, therefore, be appropriately rendered by the use of\\n\\t\\t\\t\\tthe present tense."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "23",
    "NoteID": "28",
    "Body": "This is the most acceptable meaning, in this context, of\\n\\t\\t\\t\\tthe term mathani (pl. of mathna), as explained by\\n\\t\\t\\t\\tZamakhshari in his commentary on the above verse. Another\\n\\t\\t\\t\\tpossible meaning, preferred by Razi, is \"pairing its\\n\\t\\t\\t\\tstatements\", i.e., referring to the polarity stressed in\\n\\t\\t\\t\\tall Qur'anic teachings (e.g., command and prohibition,\\n\\t\\t\\t\\tduties and rights, reward and punishment, paradise and\\n\\t\\t\\t\\thell, light and darkness, the general and the specific,\\n\\t\\t\\t\\tand so forth). As regards the inner consistency of the\\n\\t\\t\\t\\tQur'an, see also  4:82  and  25:32 , as well as the\\n\\t\\t\\t\\tcorresponding notes."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "23",
    "NoteID": "29",
    "Body": "Or: \"He guides therewith whomever He wills\", either of\\n\\t\\t\\t\\tthese two formulations being syntactically correct."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "23",
    "NoteID": "30",
    "Body": "See note [4] on  14:4 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "24",
    "NoteID": "31",
    "Body": "Lit., \"who will protect himself with his face\": an\\n\\t\\t\\t\\tidiomatic phrase implying that the person concerned has\\n\\t\\t\\t\\tnothing whatever with which to protect himself."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "26",
    "NoteID": "32",
    "Body": "Cf.  16:26 , which contains the additional sentence, \"God\\n\\t\\t\\t\\tvisited with destruction all that they had ever built\\n\\t\\t\\t\\t...\", etc., which explains the present reference to their\\n\\t\\t\\t\\tsuffering and ignominy \"in the life of this world\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "27",
    "NoteID": "33",
    "Body": "As in many other passages of the Qur'an, the use of the\\n\\t\\t\\t\\tterm \"parable\" (mathal) immediately or shortly after a\\n\\t\\t\\t\\tdescription of men's condition - whether good or bad - in\\n\\t\\t\\t\\tthe hereafter is meant to remind us that all such\\n\\t\\t\\t\\tdescriptions relate to something that is \"beyond the\\n\\t\\t\\t\\treach of a created being's perception\" (al-ghayb), and\\n\\t\\t\\t\\tcannot, therefore, be conveyed to man otherwise than by\\n\\t\\t\\t\\tmeans of allegories or parables expressed in terms of\\n\\t\\t\\t\\thuman experience and therefore accessible, in a general\\n\\t\\t\\t\\tsense, to human imagination."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "28",
    "NoteID": "34",
    "Body": "Lit., \"without any deviousness ('iwaj) , i.e., which\\n\\t\\t\\t\\tcould obscure its meaning: see note [1] on  18:1 , where\\n\\t\\t\\t\\tthis term occurs in a slightly different phrasing. As\\n\\t\\t\\t\\tregards the stress on the formulation of this divine writ\\n\\t\\t\\t\\t\"in the Arabic tongue\", see  12:2 ,  13:37 ,  14:4  and\\n\\t\\t\\t\\t 41:44 , as well as the corresponding notes."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "29",
    "NoteID": "35",
    "Body": "Lit., \"with regard to whom there are [several] partners\\n\\t\\t\\t\\t(shuraka')\", i.e., as masters: a metaphor for belief in a\\n\\t\\t\\t\\tplurality of divine powers."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "29",
    "NoteID": "36",
    "Body": "The term mathal, which is usually rendered by me as\\n\\t\\t\\t\\t\"parable\" (e.g., at the beginning of this verse as well\\n\\t\\t\\t\\tas in verse {27}), primarily denotes a \"likeness\", i.e.,\\n\\t\\t\\t\\tof one thing to another; but sometimes it is used\\n\\t\\t\\t\\ttropically as a synonym for sifah (the \"quality\",\\n\\t\\t\\t\\t\"intrinsic attribute\" or \"nature\" of a thing) or halah\\n\\t\\t\\t\\t(its \"state\" or \"condition\"). In the present instance,\\n\\t\\t\\t\\tthe last mentioned of these meanings is most appropriate,\\n\\t\\t\\t\\tinasmuch as it alludes to man's condition arising from\\n\\t\\t\\t\\teither of two contrasting attitudes: a belief in God's\\n\\t\\t\\t\\ttranscendental oneness and uniqueness on the one hand,\\n\\t\\t\\t\\tand a readiness to ascribe divine powers and qualities to\\n\\t\\t\\t\\ta variety of created beings or supposed \"incarnations\" of\\n\\t\\t\\t\\tGod, on the other."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "32",
    "NoteID": "37",
    "Body": "In this instance, the \"inventing of lies about God\"\\n\\t\\t\\t\\talludes to the attribution of a share in His divinity to\\n\\t\\t\\t\\tanyone or anything beside Him, whether it be a belief in\\n\\t\\t\\t\\ta plurality of deities, or in an imaginary \"incarnation\"\\n\\t\\t\\t\\tof God in human form, or in saints allegedly endowed with\\n\\t\\t\\t\\tsemi-divine powers."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "32",
    "NoteID": "38",
    "Body": "Lit., \"Is not in hell an abode ...\", etc.: a rhetorical\\n\\t\\t\\t\\tquestion indicating, firstly, that otherworldly suffering\\n\\t\\t\\t\\tis the unavoidable destiny - symbolically, \"an abode\" -\\n\\t\\t\\t\\tof all such sinners and, secondly, that in the concept\\n\\t\\t\\t\\tand picture of \"hell\" we are given an allegory of that\\n\\t\\t\\t\\tself-caused suffering."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "36",
    "NoteID": "39",
    "Body": "Or: \"instead of Him\". This relates not merely to false\\n\\t\\t\\t\\tdeities, but also to saints alive or dead, and even to\\n\\t\\t\\t\\tcertain abstract concepts which the popular mind endows\\n\\t\\t\\t\\twith charismatic qualitieslike wealth, power, social\\n\\t\\t\\t\\tstatus, national or racial pre-eminence, the idea of\\n\\t\\t\\t\\tman's \"selfsufficiency\", etc. - and, finally, to all\\n\\t\\t\\t\\tfalse values which are allowed to dominate man's thoughts\\n\\t\\t\\t\\tand desires. The godless always stress the supposed\\n\\t\\t\\t\\tnecessity of paying attention to all these imaginary\\n\\t\\t\\t\\tforces and values, and frighten themselves and their\\n\\t\\t\\t\\tfellow-men by the thought that a neglect to do so might\\n\\t\\t\\t\\thave evil consequences in their practical life."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "38",
    "NoteID": "40",
    "Body": "For this rendering of la'in, see surah {11}, note [11]."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "38",
    "NoteID": "41",
    "Body": "See note [23] on  31:25 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "40",
    "NoteID": "42",
    "Body": "Lit., \"suffering ('adhab) that will disgrace him\":\\n\\t\\t\\t\\timplying that surrender to false values inevitably leads\\n\\t\\t\\t\\tto man's spiritual decay and, if persisted in by many, to\\n\\t\\t\\t\\tsocial catastrophes and widespread suffering."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "41",
    "NoteID": "43",
    "Body": "Or: \"thou art not responsible for their conduct\" (see\\n\\t\\t\\t\\tnote [4] on  17:2 )."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "42",
    "NoteID": "44",
    "Body": "According to Razi, this passage connects allegorically\\n\\t\\t\\t\\twith the preceding - the light of guidance being likened\\n\\t\\t\\t\\tto life, and man's going astray, to death or, if it is\\n\\t\\t\\t\\tnot permanent, to death-like sleep followed by awakening.\\n\\t\\t\\t\\tBeyond this, however, we have here a reminder - in tune\\n\\t\\t\\t\\twith the subsequent passages - of God's almightiness, and\\n\\t\\t\\t\\tespecially of His exclusive power to create and to\\n\\t\\t\\t\\twithdraw life. As to the operative verb yatawaffa, it\\n\\t\\t\\t\\tprimarily denotes \"He takes [something] away in full\";\\n\\t\\t\\t\\tand because death is characterized by a disappearance of\\n\\t\\t\\t\\tall vital impulses (the \"soul\") from the once-living body\\n\\t\\t\\t\\t- their being \"taken away in full\", as it were - this\\n\\t\\t\\t\\tform of the verb has been used tropically, since time\\n\\t\\t\\t\\timmemorial, in the sense of \"causing to die\", and (in its\\n\\t\\t\\t\\tintransitive form) \"dying\" or (as a noun) \"death\": a\\n\\t\\t\\t\\tusage invariably adhered to in the Qur'an. The\\n\\t\\t\\t\\ttraditional likening of sleep to death is due to the fact\\n\\t\\t\\t\\tthat in both cases the body appears to be devoid of\\n\\t\\t\\t\\tconsciousness, partially and temporarily in the former\\n\\t\\t\\t\\tcase, and completely and permanently in the latter. (The\\n\\t\\t\\t\\tpopular translation of anfus-pl. of nafs - as \"souls\" is\\n\\t\\t\\t\\tcertainly inappropriate in the above context, since,\\n\\t\\t\\t\\taccording to the fundamental teaching of the Qur'an,\\n\\t\\t\\t\\tman's soul does not \"die\" at the time of his bodily death\\n\\t\\t\\t\\tbut, on the contrary, lives on indefinitely. Hence, the\\n\\t\\t\\t\\tterm anfus must be rendered here as \"human beings\".)"
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "43",
    "NoteID": "45",
    "Body": "This is the meaning of the particle am in this context\\n\\t\\t\\t\\t(Zamakhshari), implying that despite all the evidence of\\n\\t\\t\\t\\tGod's almightiness, many people tend to disregard it."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "43",
    "NoteID": "46",
    "Body": "I.e., intercessors who could act as such independently of\\n\\t\\t\\t\\tGod's permission - an assumption which the Qur'an\\n\\t\\t\\t\\tcategorically denies (see surah {10}, note [7])."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "43",
    "NoteID": "47",
    "Body": "A reference to the adoration of dead saints or their\\n\\t\\t\\t\\ttombs or relics, as well as of inanimate representations\\n\\t\\t\\t\\tof saints, of imaginary deities, etc."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "44",
    "NoteID": "48",
    "Body": "Regarding the problem of intercession as such, see note\\n\\t\\t\\t\\t[7] on  10:3 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "45",
    "NoteID": "49",
    "Body": "Since a cognition of God must have a sense of moral\\n\\t\\t\\t\\tresponsibility as its correlate, the godless shrink from\\n\\t\\t\\t\\tit, and joyfully turn to the \"worship\" - real or\\n\\t\\t\\t\\tmetaphoric - of imaginary powers which make no such moral\\n\\t\\t\\t\\tdemand."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "46",
    "NoteID": "50",
    "Body": "See surah {6}, note [65]."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "47",
    "NoteID": "51",
    "Body": "Lit., \"and the like of it with it\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "47",
    "NoteID": "52",
    "Body": "Cf.  3:91  and the corresponding note [71]."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "47",
    "NoteID": "53",
    "Body": "Lit., \"will have become obvious to them (bada lahum) from\\n\\t\\t\\t\\tGod\" - i.e., the fact that man's attitudes and actions in\\n\\t\\t\\t\\tthis world determine his state and further development in\\n\\t\\t\\t\\tthe hereafter: in other words, that happiness or\\n\\t\\t\\t\\tsuffering in the life to come (allegorically described as\\n\\t\\t\\t\\t\"paradise\" or \"hell\", and \"reward\" or \"chastisement\") are\\n\\t\\t\\t\\tbut natural consequences of the use which man makes in\\n\\t\\t\\t\\tthis life of his capabilities, endowments and\\n\\t\\t\\t\\topportunities."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "48",
    "NoteID": "54",
    "Body": "Lit., \"that which they were wont to deride will enfold\\n\\t\\t\\t\\tthem\" or \"will have enfolded them\": i.e., the reality of\\n\\t\\t\\t\\tlife after death and of the spiritual truths preached by\\n\\t\\t\\t\\tGod's prophets will overwhelm them."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "49",
    "NoteID": "55",
    "Body": "Lit., \"knowledge\" - i.e., \"my prosperity is due to my own\\n\\t\\t\\t\\tability and shrewdness\": see the first sentence of\\n\\t\\t\\t\\t 28:78  and the corresponding note. But whereas there\\n\\t\\t\\t\\tthis \"saying\" or thought is attributed to the legendary\\n\\t\\t\\t\\tQarun, in the present instance - which is by far the\\n\\t\\t\\t\\tearlier in the chronology of Qur'anic revelation - it is\\n\\t\\t\\t\\tsaid to be characteristic of man as such (see, e.g.,\\n\\t\\t\\t\\t{7:189-190}, where this tendency is referred to in\\n\\t\\t\\t\\tconnection with the experience of parenthood)."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "51",
    "NoteID": "56",
    "Body": "Lit., \"those who are bent on wrongdoing (alladhina\\n\\t\\t\\t\\tzalamu) from among these here\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "53",
    "NoteID": "57",
    "Body": "See note [16] on the opening words of verse {10} of this\\n\\t\\t\\t\\tsurah {11}."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "53",
    "NoteID": "58",
    "Body": "Sc.. \"whenever the sinner repents and turns to Him\": cf.,\\n\\t\\t\\t\\tfor instance,  6:54  - \"Your Sustainer has willed upon\\n\\t\\t\\t\\tHimself the law of grace and mercy - so that if any of\\n\\t\\t\\t\\tyou does a bad deed out of ignorance, and thereafter\\n\\t\\t\\t\\trepents and lives righteously, He shall be [found]\\n\\t\\t\\t\\tmuchforgiving, a dispenser of grace\"; or  4:110  - \"he\\n\\t\\t\\t\\twho does evil or [otherwise] sins against himself, and\\n\\t\\t\\t\\tthereafter prays God to forgive him, shall find God\\n\\t\\t\\t\\tmuch-forgiving, a dispenser of grace\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "54",
    "NoteID": "59",
    "Body": "Cf.  4:18  - \"repentance shall not be accepted from those\\n\\t\\t\\t\\twho do evil deeds until their dying hour, and then say,\\n\\t\\t\\t\\t'Behold, I now repent'; nor from those who die as deniers\\n\\t\\t\\t\\tof the truth\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "56",
    "NoteID": "60",
    "Body": "Whenever there is no clear indication that the term nafs\\n\\t\\t\\t\\thas another meaning, it signifies a \"human being\"; hence,\\n\\t\\t\\t\\tthe personal pronouns relating to this term (which is\\n\\t\\t\\t\\tfeminine in Arabic) are masculine in my rendering."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "58",
    "NoteID": "61",
    "Body": "Cf.  2:167  and  26:102 , as well as {6:27-28} and the\\n\\t\\t\\t\\tcorresponding note [19]."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "60",
    "NoteID": "62",
    "Body": "The phrase iswadda wajhuhu (lit., \"his face became\\n\\t\\t\\t\\tblack\", or \"dark\") is used idiomatically to describe a\\n\\t\\t\\t\\tface expressive of grief or ignominy (cf.  16:58 ), just\\n\\t\\t\\t\\tas its opposite, ibyadda wajhuhu (lit., \"his face became\\n\\t\\t\\t\\twhite\" or \"shining\") describes a countenance expressive\\n\\t\\t\\t\\tof happiness or justified pride: cf.  2:106  - \"some\\n\\t\\t\\t\\tfaces will shine [with happiness] and some faces will be\\n\\t\\t\\t\\tdark [with grief]\". Apart from this, both phrases have\\n\\t\\t\\t\\talso a tropical significance namely \"he became [or\\n\\t\\t\\t\\t\"felt\"] disgraced\", resp. \"honoured\". - As regards the\\n\\t\\t\\t\\t\"inventing of lies about God\" spoken of in this verse,\\n\\t\\t\\t\\tsee note [37] above."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "60",
    "NoteID": "63",
    "Body": "See note [38] on the last sentence of verse {32} of this\\n\\t\\t\\t\\tsurah."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "62",
    "NoteID": "64",
    "Body": "For the meaning of the term wakil in this context, see\\n\\t\\t\\t\\tnote [4] on  17:2 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "65",
    "NoteID": "65",
    "Body": "I.e., \"it has been conveyed to thee through the divine\\n\\t\\t\\t\\tmessages revealed to the prophets\". The assumption of\\n\\t\\t\\t\\talmost all the classical commentators that this passage\\n\\t\\t\\t\\tis addressed to Muhammad does not make much sense in view\\n\\t\\t\\t\\tof God's knowledge that neither he nor any of the\\n\\t\\t\\t\\tprophets who came before him would ever commit the deadly\\n\\t\\t\\t\\tsin (referred to in the sequence) of \"ascribing divine\\n\\t\\t\\t\\tpowers to aught beside God\". On the other hand, the above\\n\\t\\t\\t\\treminder becomes very cogent and relevant as soon as it\\n\\t\\t\\t\\tis conceived as being addressed to man in general,\\n\\t\\t\\t\\tirrespective of time and circumstance."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "67",
    "NoteID": "66",
    "Body": "I.e., the whole universe is as nothing before Him: for\\n\\t\\t\\t\\tthis specific allegory of God's almightiness, see\\n\\t\\t\\t\\t 21:104 . There are many instances, in the Qur'an as well\\n\\t\\t\\t\\tas in authentic ahadith, of the clearly metaphorical use\\n\\t\\t\\t\\tof the term \"hand\" in allusions to God's absolute power\\n\\t\\t\\t\\tand dominion. The particular reference, in the above, to\\n\\t\\t\\t\\tthe Day of Resurrection is due to the fact that it will\\n\\t\\t\\t\\tbe only on his own resurrection that a human being shall\\n\\t\\t\\t\\tfully grasp the concept of God's almightiness, referred\\n\\t\\t\\t\\tto in the subsequent words, \"limitless is He in His\\n\\t\\t\\t\\tglory'' (subhanahu)\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "68",
    "NoteID": "67",
    "Body": "As is evident from  27:89 , the above is an allusion to\\n\\t\\t\\t\\tthe unbroken spiritual life in this world - and,\\n\\t\\t\\t\\ttherefore, happiness in the hereafter - of those who have\\n\\t\\t\\t\\tattained to faith and have done righteous deeds. Cf.\\n\\t\\t\\t\\t 21:103  - \"the supreme awesomeness [of the Day of\\n\\t\\t\\t\\tResurrection] will cause them no grief\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "68",
    "NoteID": "68",
    "Body": "Cf.  37:19 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "69",
    "NoteID": "69",
    "Body": "I.e., with a clear revelation of His will. See also\\n\\t\\t\\t\\t 14:48 , where it is stated that on Resurrection Day \"the\\n\\t\\t\\t\\tearth shall be changed into another earth, as shall be\\n\\t\\t\\t\\tthe heavens\". A further allusion to this transformation\\n\\t\\t\\t\\t(and not annihilation) of the universe is found in\\n\\t\\t\\t\\t{20:105-107}."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "69",
    "NoteID": "70",
    "Body": "Cf. {17:13-14} (and the corresponding note [18]); also\\n\\t\\t\\t\\t 18:49 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "69",
    "NoteID": "71",
    "Body": "See  4:41  and the corresponding note [52]. Accordingly,\\n\\t\\t\\t\\tthe above phrase may well have the meaning of \"all the\\n\\t\\t\\t\\tprophets as witnesses\", i.e., for or against those to\\n\\t\\t\\t\\twhom they conveyed God's message. In all probability,\\n\\t\\t\\t\\thowever, the term shuhada, a' (or ashhad in  40:51 )\\n\\t\\t\\t\\tsignifies here - as its singular shahid obviously does in\\n\\t\\t\\t\\t 50:21  - man's newly-awakened consciousness, which will\\n\\t\\t\\t\\tcompel him to bear witness against himself on Judgment\\n\\t\\t\\t\\tDay (cf.  6:130 ,  17:14 ,  24:24 ,  36:65 ,  41:20 \\n\\t\\t\\t\\tff.)."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "70",
    "NoteID": "72",
    "Body": "Cf. {99:7-8}, \"he who shall have done an atom's weight of\\n\\t\\t\\t\\tgood, shall behold it; and he who shall have done an\\n\\t\\t\\t\\tatom's weiaht of evil, shall behold it\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "71",
    "NoteID": "73",
    "Body": "I.e., as an ineluctable consequence of their unrepented\\n\\t\\t\\t\\tsinning."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "72",
    "NoteID": "74",
    "Body": "Sc., \"and therefore refused to submit to the guidance\\n\\t\\t\\t\\toffered them by God's apostles\": cf. {96:6-7} - \"man\\n\\t\\t\\t\\tbecomes grossly overweening whenever he believes himself\\n\\t\\t\\t\\tto be self-sufficient\". See also  16:22  and the\\n\\t\\t\\t\\tcorresponding note [IS]."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "73",
    "NoteID": "75",
    "Body": "Lit., \"and its gates have [or \"will have\"] been opened\",\\n\\t\\t\\t\\ti.e., before their arrival, as indicated by the particle\\n\\t\\t\\t\\twa (lit., \"and\"), which in this case denotes precedence\\n\\t\\t\\t\\tin time (Zamakhshari). Cf. in this connection {38}: SO -\\n\\t\\t\\t\\t\"gardens of perpetual bliss, with gates wide-open to\\n\\t\\t\\t\\tthem\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "74",
    "NoteID": "76",
    "Body": "Lit., \"has made us heirs to this land\", i.e., of\\n\\t\\t\\t\\tparadise. According to all the classical commentators,\\n\\t\\t\\t\\tthe concept of \"heritage\" is used here metaphorically, to\\n\\t\\t\\t\\tdenote the rightful due, or portion, of the blessed. The\\n\\t\\t\\t\\tterm ard (lit., \"earth\" or \"land\") has also - especially\\n\\t\\t\\t\\tin poetry - the connotation of \"anything that is spread\"\\n\\t\\t\\t\\t(cf. Lane I, 48): hence my rendering of it, in the above\\n\\t\\t\\t\\tcontext, as \"expanse\"."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "75",
    "NoteID": "77",
    "Body": "Whenever the term al-'arsh (\"the throne [of God]\") occurs\\n\\t\\t\\t\\tin the Qur'an, it is used as a metaphor for His absolute\\n\\t\\t\\t\\tdominion over all that exists: hence my rendering, \"the\\n\\t\\t\\t\\tthrone of [God's] almightiness\". (See also  7:54  and the\\n\\t\\t\\t\\tcorresponding note [43].) The mention of the \"angels\\n\\t\\t\\t\\tsurrounding\" it has, obviously, a metaphorical meaning:\\n\\t\\t\\t\\tsee note [4] on  40:7 ."
  },
  {
    "SurahNumber": "39",
    "AyahNumber": "75",
    "NoteID": "78",
    "Body": "Lit., \"it will he said\"."
  }
]
