[
  {
    "SurahNumber": "41",
    "AyahNumber": "1",
    "NoteID": "4462",
    "Body": "Abbreviated Letters: see Introduction to S. xi. See also\\n\\t\\t\\t\\tn. 4382 to xl. 18, and n. 4505 to xli. 34."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "2",
    "NoteID": "4463",
    "Body": "In the last Sura (xl. 2-3) the revelation was described\\n\\t\\t\\t\\twith reference to some of the qualities of Allah from\\n\\t\\t\\t\\tWhom it came. Here it is described mainly with reference\\n\\t\\t\\t\\tto its subject-matter. (1) It brings the Message of Grace\\n\\t\\t\\t\\tand Mercy; (2) it is not merely a book of Dark Sayings,\\n\\t\\t\\t\\tbut everything is explained clearly and from various\\n\\t\\t\\t\\tpoints of view; (3) it is in Arabic, the language of the\\n\\t\\t\\t\\tpeople among whom it was first promulgated, and therefore\\n\\t\\t\\t\\teasily intelligible to them if they take the trouble to\\n\\t\\t\\t\\tunderstand; and (4) it opens the way to Forgiveness\\n\\t\\t\\t\\tthrough Repentance and gives warning of all spiritual\\n\\t\\t\\t\\tDangers."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "4",
    "NoteID": "4464",
    "Body": "With all the qualities mentioned in the last note, if men\\n\\t\\t\\t\\tdo not profit by its blessings, the fault lies in their\\n\\t\\t\\t\\twill: they turn away, and thus fail to hear the voice\\n\\t\\t\\t\\tthat calls to them."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "5",
    "NoteID": "4465",
    "Body": "The consequence of their wilful rejection is that a\\n\\t\\t\\t\\tdistance is created between Revelation and those for whom\\n\\t\\t\\t\\tit is meant; their ears become deaf, so that the voice\\n\\t\\t\\t\\tfalls fainter and fainter on their ears: they feel a bar\\n\\t\\t\\t\\tbetween themselves and the Messenger who comes to teach\\n\\t\\t\\t\\tthem. Cf. vii. 25."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "5",
    "NoteID": "4466",
    "Body": "This is either a superiority complex adopting the\\n\\t\\t\\t\\tsarcastic tone of an inferiority complex, or it expresses\\n\\t\\t\\t\\tcalculated indifference to spiritual teaching. In effect\\n\\t\\t\\t\\tit says: 'Our hearts and minds are not intelligent enough\\n\\t\\t\\t\\tto understand your noble ideas, nor our ears sufficiently\\n\\t\\t\\t\\tacute to hear their exposition: you and we are quite\\n\\t\\t\\t\\tdifferent; there is a gulf between us. Why worry about\\n\\t\\t\\t\\tus? You go your way, and we shall go ours!'"
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "6",
    "NoteID": "4467",
    "Body": "The reply is in effect: that the bringer of the Message\\n\\t\\t\\t\\tis not an angel nor a god, and so there can and ought to\\n\\t\\t\\t\\tbe no barrier between him and his hearers; but he has\\n\\t\\t\\t\\tbeen chosen to bring a Message of Truth and Hope to them;\\n\\t\\t\\t\\tthey should accept the Gospel of Unity, and by\\n\\t\\t\\t\\tRepentance, obtain Allah's Grace and Forgiveness."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "6",
    "NoteID": "4468",
    "Body": "There is nothing but pity for those who reject Truth, run\\n\\t\\t\\t\\tafter false worship, have no sympathy or charity for\\n\\t\\t\\t\\ttheir fellow-men, and even deny that there is any future\\n\\t\\t\\t\\tLife."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "8",
    "NoteID": "4469",
    "Body": "But blessed are those who have Faith. They will have a\\n\\t\\t\\t\\tFuture and a Bliss that will never fail."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "9",
    "NoteID": "4470",
    "Body": "This is a difficult passage, describing the primal\\n\\t\\t\\t\\tcreation of our physical earth and the physical heavens\\n\\t\\t\\t\\taround us. If we count the two Days mentioned in this\\n\\t\\t\\t\\tverse, the four Days mentioned in verse 10, and the two\\n\\t\\t\\t\\tDays mentioned in verse 12, we get a total of eight Days,\\n\\t\\t\\t\\twhile in many passages the creation is stated to have\\n\\t\\t\\t\\ttaken place in six Days: see vii. 54, n. 1031; and xxxii.\\n\\t\\t\\t\\t4, n. 3632. The Commentators understand the \"four Days\"\\n\\t\\t\\t\\tin verse 10 to include the two Days in verse 9, so that\\n\\t\\t\\t\\tthe total for the universe comes to six Days. This is\\n\\t\\t\\t\\treasonable, because the processes described in verses 9\\n\\t\\t\\t\\tand 10 form really one series. In the one case it is the\\n\\t\\t\\t\\tcreation of the formless matter of the earth; in the\\n\\t\\t\\t\\tother case it is the gradual evolution of the form of the\\n\\t\\t\\t\\tearth, its mountains and seas, and its animal and\\n\\t\\t\\t\\tvegetable life, with the \"nourishment in due proportion\",\\n\\t\\t\\t\\tproper to each. Cf. also xv. 19-20."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "10",
    "NoteID": "4471",
    "Body": "Cf. xiii. 3 and xvi. 15, n. 2038. High above it: the\\n\\t\\t\\t\\thighest mountains are 29,000 feet above sea-level, and\\n\\t\\t\\t\\tthe lowest depths of the bottom of the ocean are 31,600\\n\\t\\t\\t\\tfeet below sea-level, so that the vertical difference\\n\\t\\t\\t\\tbetween the highest and lowest points on the solid crust\\n\\t\\t\\t\\tof the earth is about 11-1/2 miles. The highland areas\\n\\t\\t\\t\\tare the main sources of the water-supply in all the\\n\\t\\t\\t\\tregions of the earth, and vegetable and animal life\\n\\t\\t\\t\\tdepends on water-supply."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "10",
    "NoteID": "4472",
    "Body": "See n. 4470 above."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "10",
    "NoteID": "4473",
    "Body": "Sa-ilin may mean either (1) those who seek, or (2) those\\n\\t\\t\\t\\twho ask or enquire. If the former meaning is adopted, the\\n\\t\\t\\t\\tclause means that everything is apportioned to the needs\\n\\t\\t\\t\\tand appetites of Allah's creatures. If the latter, it\\n\\t\\t\\t\\tmeans that the needs of enquirers are sufficiently met by\\n\\t\\t\\t\\twhat is stated here."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "11",
    "NoteID": "4474",
    "Body": "For istawa see n. 1386 to x. 3. Cf. also ii. 29."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "11",
    "NoteID": "4475",
    "Body": "From lxxix. 30 it would appear as if the earth was spread\\n\\t\\t\\t\\tout after the sky was made. In the present passage the\\n\\t\\t\\t\\tcreation of the earth and the evolution of life on our\\n\\t\\t\\t\\tglobe are mentioned first; and the making of the sky into\\n\\t\\t\\t\\tthe seven firmaments is mentioned last. The two\\n\\t\\t\\t\\tstatements are not inconsistent. It is stated here that\\n\\t\\t\\t\\twhen the sky was made into seven firmaments, it had\\n\\t\\t\\t\\texisted previously as smoke, or vapour, or steam. The\\n\\t\\t\\t\\tidea I derive from a collation of the relevant Quranic\\n\\t\\t\\t\\tpassages is that Allah first created primeval matter,\\n\\t\\t\\t\\twhich was as yet without order, shape, or symmetry. This\\n\\t\\t\\t\\tstate is called Chaos as opposed to Cosmos in Greek\\n\\t\\t\\t\\tCosmogony. The next stage would be the condensation of\\n\\t\\t\\t\\tthis primeval matter, into gases, liquids, or solids: on\\n\\t\\t\\t\\tthis subject no precise information is given to us: it\\n\\t\\t\\t\\tbelongs to the realm of Physics. About the earth we are\\n\\t\\t\\t\\ttold of four stages or Days, and about the heavens, of\\n\\t\\t\\t\\ttwo stages or Days. For Days see n. 4477 below. If these\\n\\t\\t\\t\\tstages proceeded or proceed together in time, it is\\n\\t\\t\\t\\tobvious that each stage as we know it on earth is half as\\n\\t\\t\\t\\tlong as each stage in the heavens. But these are\\n\\t\\t\\t\\tquestions of Physics, Astronomy, or Geology."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "11",
    "NoteID": "4476",
    "Body": "I take this to mean that Allah's design in creation was\\n\\t\\t\\t\\tnot to keep heaven and earth separate, but together, as\\n\\t\\t\\t\\twe indeed are, being part of the solar system, and\\n\\t\\t\\t\\ttravellers through space, crossing the path of several\\n\\t\\t\\t\\tcomets. And all matter created by Allah willingly obeys\\n\\t\\t\\t\\tthe laws laid down for it."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "12",
    "NoteID": "4477",
    "Body": "For \"Days\", which may include thousands of years, see\\n\\t\\t\\t\\tvii. 54, and n. 1031. They refer to stages in the\\n\\t\\t\\t\\tevolution of physical nature. In the Biblical cosmogony,\\n\\t\\t\\t\\t(Gen. i, and ii. 1-7), which reflects old Babylonian\\n\\t\\t\\t\\tcosmogony, the scheme is apparently to be taken literally\\n\\t\\t\\t\\tas to days and is as follows. The first day Allah created\\n\\t\\t\\t\\tlight; the second, the firmament; the third, the earth\\n\\t\\t\\t\\tand vegetation; the fourth, the stars and plants; the\\n\\t\\t\\t\\tfifth, fish and fowl from the sea; and the sixth, cattle,\\n\\t\\t\\t\\tcreeping things, beasts on land, and man; on the seventh\\n\\t\\t\\t\\tday He ended His work and rested. Our scheme is wholly\\n\\t\\t\\t\\tdifferent. (1) Allah did not rest, and never rests. \"His\\n\\t\\t\\t\\tThrone doth extend over the heavens and the earth, and He\\n\\t\\t\\t\\tfeeleth no fatigue in guarding and preserving them\"; (2)\\n\\t\\t\\t\\tAllah's work has not ended; His activity still goes on:\\n\\t\\t\\t\\txxxii. 5; vii, 54; (3) man in our scheme does not come in\\n\\t\\t\\t\\twith land animals; his advent is much later; (4) our\\n\\t\\t\\t\\tstages are not sharply divided from each other, as in the\\n\\t\\t\\t\\tabove scheme, where the stars and planets having been\\n\\t\\t\\t\\tcreated on the fourth day, it is not intelligible how the\\n\\t\\t\\t\\tfirst three days were counted, nor how vegetation grew on\\n\\t\\t\\t\\tthe third day. Our stages for earth and heaven are not in\\n\\t\\t\\t\\tsequence of time for the heavens and the earth. Our six\\n\\t\\t\\t\\tstages are broadly speaking, (1) the throwing off of our\\n\\t\\t\\t\\tplanet from cosmic matter; (2) its cooling and\\n\\t\\t\\t\\tcondensing; (3) and (4) the growth of vegetable and\\n\\t\\t\\t\\tanimal life; (5) and (6) the parallel growth of the\\n\\t\\t\\t\\tstarry realm and our solar system."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "12",
    "NoteID": "4478",
    "Body": "Cf. xv. 17, and n. 1951; also xxxvii. 6-9. The transition\\n\\t\\t\\t\\tfrom the third person (\"He completed,\" etc.) to the first\\n\\t\\t\\t\\tperson (\"We adorned,\" etc.) may be noted. The act of\\n\\t\\t\\t\\tcreation is an impersonal act: the act of adornment and\\n\\t\\t\\t\\tguarding is a personal favour to Allah's creatures."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "13",
    "NoteID": "4479",
    "Body": "See verse 17 below."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "14",
    "NoteID": "4480",
    "Body": "\"From before them and behind them\": i.e., from every\\n\\t\\t\\t\\tside. They were warned from every point of view."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "14",
    "NoteID": "4481",
    "Body": "Cf. xv. 7, n. 1941; vi. 8-9, n. 841-42. The 'Ad had more\\n\\t\\t\\t\\tpower and material civilisation than the Pagan Arabs\\n\\t\\t\\t\\tcontemporary with the holy Prophet. But the greater the\\n\\t\\t\\t\\tmaterial civilisation, the greater the arrogance as the\\n\\t\\t\\t\\tbesetting sin."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "15",
    "NoteID": "4482",
    "Body": "Against (all) truth and reason: Cf. vii. 33. Their\\n\\t\\t\\t\\testimate of their own strength was greater than was\\n\\t\\t\\t\\tjustified by facts, but if they had all the strength\\n\\t\\t\\t\\twhich they arrogated to themselves, yet how could they\\n\\t\\t\\t\\tstand before Allah?"
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "16",
    "NoteID": "4483",
    "Body": "The detailed story of the 'Ad and their besetting sin,\\n\\t\\t\\t\\tand the preaching of their Prophet Hud to them will be\\n\\t\\t\\t\\tfound in xxvi. 123-140; also vii. 65-72, and n. 1040. For\\n\\t\\t\\t\\tthe furious Wind, Cf. liv. 19."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "17",
    "NoteID": "4484",
    "Body": "The story of the Thamud usually goes with that of the\\n\\t\\t\\t\\t'Ad. Cf. xxvi. 140-59; also vii. 73-79, and n. 1043."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "17",
    "NoteID": "4485",
    "Body": "\"The thunder bolt:\" i.e., deafening noises like those of\\n\\t\\t\\t\\tthunder and lightning; or the rumbling of a terrible\\n\\t\\t\\t\\tearthquake. In vii. 78, an earthquake is suggested: see\\n\\t\\t\\t\\tn. 1047 to that verse. Cf. also above. xli. 13."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "19",
    "NoteID": "4486",
    "Body": "\"Marched in ranks\": to show their further humiliation:\\n\\t\\t\\t\\tfor they will be like prisoners going to Punishment."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "20",
    "NoteID": "4487",
    "Body": "All the members of their bodies and the faculties of\\n\\t\\t\\t\\ttheir minds, which they misused, will bear witness\\n\\t\\t\\t\\tagainst them. Similarly, in xxxvi. 65, their hands and\\n\\t\\t\\t\\ttheir feet bear witness against them. The \"skin\" not only\\n\\t\\t\\t\\tincludes the sense of touch (which is so often misused in\\n\\t\\t\\t\\tsex), but also the sense of taste and the sense of smell,\\n\\t\\t\\t\\twhich are specialised forms of the organ of touch. All\\n\\t\\t\\t\\tthe sensory organs, and all their intellectual and\\n\\t\\t\\t\\temotional counterparts advance us by their use and pull\\n\\t\\t\\t\\tus down by their misuse. They become tell-tale witnesses\\n\\t\\t\\t\\tagainst us if abused."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "21",
    "NoteID": "4488",
    "Body": "A new phase of their existence will now dawn on them.\\n\\t\\t\\t\\tThey used to think that if they concealed their evil\\n\\t\\t\\t\\tdeeds from the rest of the world, nothing would happen to\\n\\t\\t\\t\\tthem! But Allah can give \"tongues to trees\", and can make\\n\\t\\t\\t\\tevery fact in life, known and unknown to the world,\\n\\t\\t\\t\\tcontribute to the elucidation of truth and justice. When\\n\\t\\t\\t\\twe succumb to evil, our limbs and faculties themselves\\n\\t\\t\\t\\tbetray us."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "22",
    "NoteID": "4489",
    "Body": "The limbs and faculties will say: \"You did not seek to\\n\\t\\t\\t\\thide your evil from us: in fact you used us for your\\n\\t\\t\\t\\tevil, because we were in your power. Did you not know\\n\\t\\t\\t\\tthat Allah knew everything and that our knowledge would\\n\\t\\t\\t\\tbe evidence against you?\""
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "23",
    "NoteID": "4490",
    "Body": "\"You now see the situation! We were given for your use\\n\\t\\t\\t\\tand service. You misused us, to your own utter and\\n\\t\\t\\t\\tirretrievable destruction!\""
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "24",
    "NoteID": "4491",
    "Body": "If they have patience: there is sarcasm in the meaning.\\n\\t\\t\\t\\t\"Let them not be impatient: they will soon find a home in\\n\\t\\t\\t\\tthe Fire of Hell! If they ask for grace and forgiveness\\n\\t\\t\\t\\tthen, it will be too late.\""
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "25",
    "NoteID": "4492",
    "Body": "Just as the idea of happiness in heaven is expressed, not\\n\\t\\t\\t\\tonly by individual satisfaction, but by congenial\\n\\t\\t\\t\\tsociety, so the idea of Punishment in hell is deepened by\\n\\t\\t\\t\\tthe fact that Evil will be made to meet evil: those who\\n\\t\\t\\t\\tmade sin fair-seeming in this life will be there to share\\n\\t\\t\\t\\tin the regrets and mutual recriminations which will make\\n\\t\\t\\t\\tlife a burden. In fact, in these Ha-Mim verses, the idea\\n\\t\\t\\t\\tof fit companionship for the Good and uncongenial company\\n\\t\\t\\t\\tfor the Evil, runs like a thread throughout. See\\n\\t\\t\\t\\tIntroduction to S. xl."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "25",
    "NoteID": "4493",
    "Body": "They painted in glowing colours the pleasures of sin in\\n\\t\\t\\t\\tthe past and the pleasure of sin in the future, thus\\n\\t\\t\\t\\tpractising a double deception, which will now be found\\n\\t\\t\\t\\tout."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "25",
    "NoteID": "4494",
    "Body": "Jinns: see n. 929 to vi. 100. All spirits of wickedness\\n\\t\\t\\t\\tand all men who submitted to them, in the past, were\\n\\t\\t\\t\\tunder one common sentence; and future generations who\\n\\t\\t\\t\\tembrace evil will also join them. Cf. vi. 128."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "25",
    "NoteID": "4495",
    "Body": "The echo here of verse 23 above completes the argument\\n\\t\\t\\t\\tfrom another point of view."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "26",
    "NoteID": "4496",
    "Body": "A favourite trick of those who wish to dishonour\\n\\t\\t\\t\\tRevelation is, not only not to listen to it themselves,\\n\\t\\t\\t\\tbut to talk loudly and insolently when it is being read,\\n\\t\\t\\t\\tso that even the true listeners may not be able to\\n\\t\\t\\t\\tperform their devotions. They think that they are\\n\\t\\t\\t\\tdrowning the voice of Allah: in fact they are piling up\\n\\t\\t\\t\\tmisery for themselves in the future. For Allah's voice\\n\\t\\t\\t\\tcan never be silenced."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "27",
    "NoteID": "4497",
    "Body": "Nothing that they can do, however outrageous, will escape\\n\\t\\t\\t\\tits fit punishment. And to reject Allah's Signs is to\\n\\t\\t\\t\\tshut the very door to His Grace and Mercy."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "29",
    "NoteID": "4498",
    "Body": "It is one of the qualities of sin and all evil, that it\\n\\t\\t\\t\\twishes to drag down others in its own camp, and rejoices\\n\\t\\t\\t\\tto see them humiliated and disgraced, just as, in the\\n\\t\\t\\t\\topposite case, the good rejoice to help and honour others\\n\\t\\t\\t\\tand make them happy wherever they can. Cf. vi. 112-113."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "30",
    "NoteID": "4499",
    "Body": "The people who succeed in eternal Life are those who\\n\\t\\t\\t\\trecognise and understand the one and only Eternal\\n\\t\\t\\t\\tReality, that is Allah, and further shape their\\n\\t\\t\\t\\tprobationary Life firmly and steadfastly on the\\n\\t\\t\\t\\tprinciples of that Truth and Reality. They will have\\n\\t\\t\\t\\ttheir friends and protectors in the good angels, in\\n\\t\\t\\t\\tcontrast to the evil ones, who will have no friendship or\\n\\t\\t\\t\\tprotection, but only the reproaches of the Satan."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "31",
    "NoteID": "4500",
    "Body": "\"Protectors\": Cf. n. 4492 to xli. 25 above, and n. 4505\\n\\t\\t\\t\\tto xli. 34 below."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "31",
    "NoteID": "4501",
    "Body": "Cf. xxi. 102, xliii. 71, lii, 22."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "32",
    "NoteID": "4502",
    "Body": "Cf. iii. 198. Through Allah's infinite Mercy and\\n\\t\\t\\t\\tForgiveness, they will now be in the position of guests\\n\\t\\t\\t\\tto Host, and will receive unnumbered gifts out of all\\n\\t\\t\\t\\tproportion to their own merits."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "33",
    "NoteID": "4503",
    "Body": "Better in speech: i.e., speaks better counsel; or is more\\n\\t\\t\\t\\tworthy of being listened to. That his word reaches the\\n\\t\\t\\t\\thighest mark of human speech is evidenced by three facts:\\n\\t\\t\\t\\t(1) that he calls all to the Truth of Allah, showing that\\n\\t\\t\\t\\this thoughts are not centred on himself; (2) every deed\\n\\t\\t\\t\\tof his is righteousness, showing that there is no\\n\\t\\t\\t\\tdivergence between his preaching and his conduct; and (3)\\n\\t\\t\\t\\the completely associates himself with the Will of Allah,\\n\\t\\t\\t\\tshowing that he is the full embodiment of Islam. What a\\n\\t\\t\\t\\tfine description of the holy Prophet!"
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "34",
    "NoteID": "4504",
    "Body": "You do not return good for evil, for there is no equality\\n\\t\\t\\t\\tor comparison between the two. You repel or destroy evil\\n\\t\\t\\t\\twith something which is far better, just as an antidote\\n\\t\\t\\t\\tis better than poison. You foil hatred with love. You\\n\\t\\t\\t\\trepel ignorance with knowledge, folly and wickedness with\\n\\t\\t\\t\\tthe friendly message of Revelation. The man who was in\\n\\t\\t\\t\\tthe bondage of sin, you not only liberate from sin, but\\n\\t\\t\\t\\tmake him your greatest friend and helper in the cause of\\n\\t\\t\\t\\tAllah! Such is the alchemy of the Word of Allah! Cf.\\n\\t\\t\\t\\txxiii. 96; xxviii. 54."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "34",
    "NoteID": "4505",
    "Body": "Hamim: See n. 4500 above, and Introduction to S. xi."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "35",
    "NoteID": "4506",
    "Body": "The moral standard referred to in the last verse can only\\n\\t\\t\\t\\tbe reached by the exercise of the highest patience and\\n\\t\\t\\t\\tself-restraint. All sorts of human weaknesses and\\n\\t\\t\\t\\tcounsels of pseudo-wisdom and \"self-respect\" will keep\\n\\t\\t\\t\\tbreaking in, but resist them as suggestions of Evil (see\\n\\t\\t\\t\\tnext verse). If you reach anywhere near that high\\n\\t\\t\\t\\tstandard, you will be indeed most fortunate in a\\n\\t\\t\\t\\tspiritual sense, for Allah's Revelation will have made\\n\\t\\t\\t\\tyou great and free."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "36",
    "NoteID": "4507",
    "Body": "Nazaga has in it the idea of discord, slander,\\n\\t\\t\\t\\tdisharmony, as well as incitements to such disturbances\\n\\t\\t\\t\\tin the soul. They can only proceed from evil, and should\\n\\t\\t\\t\\tbe resisted with the help of Allah. See also last note."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "37",
    "NoteID": "4508",
    "Body": "Night and Day are opposites, and yet, by the alchemy of\\n\\t\\t\\t\\tAllah, they can both subserve the purpose of human good,\\n\\t\\t\\t\\tbecause the Night can give rest while the Day can promote\\n\\t\\t\\t\\tactivity. The Sun and the Moon are similarly\\n\\t\\t\\t\\tcomplementary. So, in moral and spiritual affairs,\\n\\t\\t\\t\\tseeming opposites may by Allah's alchemy be made to\\n\\t\\t\\t\\tsubserve the purposes of Good. They are but instruments:\\n\\t\\t\\t\\tAllah is the Cause. Adore Allah, and not the things which\\n\\t\\t\\t\\tHe has created. Use the things which He has created, but\\n\\t\\t\\t\\tdo not adore them."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "38",
    "NoteID": "4509",
    "Body": "It does not in any way affect Allah if men rebel against\\n\\t\\t\\t\\tHim. It is men's own loss. Allah's glory is being\\n\\t\\t\\t\\tcelebrated night and day by angels and men who receive\\n\\t\\t\\t\\tthe privilege of approaching His presence. To them it is\\n\\t\\t\\t\\tdelight and an honour to be in the sunshine of Truth and\\n\\t\\t\\t\\tHappiness."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "39",
    "NoteID": "4510",
    "Body": "Evil makes of the souls of men what drought makes of\\n\\t\\t\\t\\tland: it kills life, beauty, and fruitfulness. Allah's\\n\\t\\t\\t\\tWord in the spiritual world has the same wonderful effect\\n\\t\\t\\t\\tas rain has on barren land: it gives life, beauty, and\\n\\t\\t\\t\\tfruitfulness. And the effect of Allah's Word is also seen\\n\\t\\t\\t\\tthrough the lives of men who repel evil with what is\\n\\t\\t\\t\\tbetter. They also convert dead souls (which harbour spite\\n\\t\\t\\t\\tand hatred) into living souls, which come into the main\\n\\t\\t\\t\\tcurrent of spiritual life, and help in carrying out\\n\\t\\t\\t\\tAllah's beneficent Purpose."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "39",
    "NoteID": "4511",
    "Body": "Why should we wonder then at the potency of Allah's Word,\\n\\t\\t\\t\\twhether in our probationary lives here, or in the eternal\\n\\t\\t\\t\\tlife of the Hereafter."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "40",
    "NoteID": "4512",
    "Body": "Pervert the Truth in Our Signs; either by corrupting the\\n\\t\\t\\t\\tscriptures or turning them to false and selfish uses; or\\n\\t\\t\\t\\tby neglecting the Signs of Allah in nature around them,\\n\\t\\t\\t\\tor silencing His voice in their own conscience.\\n\\t\\t\\t\\tEverything is known to Allah. Why not work for true\\n\\t\\t\\t\\tsalvation at the final Judgment?"
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "41",
    "NoteID": "4513",
    "Body": "Mere rejection by men will not silence the Signs of\\n\\t\\t\\t\\tAllah, which will work unintermittently and with the\\n\\t\\t\\t\\tfullest potency."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "42",
    "NoteID": "4514",
    "Body": "Allah's Truth is fully guarded on all sides. No one can\\n\\t\\t\\t\\tget the better of it by attacking it from before or\\n\\t\\t\\t\\tbehind it, openly or secretly, or in any way whatever."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "43",
    "NoteID": "4515",
    "Body": "The gist of Allah's Message, now, before, and for ever,\\n\\t\\t\\t\\tis the same: Mercy to the erring and repentant; just\\n\\t\\t\\t\\tpunishment to those who wilfully rebel against Allah."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "44",
    "NoteID": "4516",
    "Body": "Cf. xvi. 103-105; xii. 2; etc. It was most natural and\\n\\t\\t\\t\\treasonable that the Messenger being Arab, the Message\\n\\t\\t\\t\\tshould be in his own tongue, that he might explain it in\\n\\t\\t\\t\\tevery detail, with the greatest power and eloquence. Even\\n\\t\\t\\t\\tthough it was to be for the whole world, its initial\\n\\t\\t\\t\\texposition was thus to be in Arabic. But if people had no\\n\\t\\t\\t\\tfaith and were spiritually deaf or blind, it would not\\n\\t\\t\\t\\tmatter in what language it came."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "44",
    "NoteID": "4517",
    "Body": "Cf. xli. 5, and vi. 25. They pretended that it was too\\n\\t\\t\\t\\tdeep for them, when they meant that they were superior to\\n\\t\\t\\t\\tit! The fact was that by putting themselves in an\\n\\t\\t\\t\\tartificially false position, they rendered themselves\\n\\t\\t\\t\\timpervious to the Message. The voice of Revelation or the\\n\\t\\t\\t\\tvoice of conscience sounded to them as if it came from a\\n\\t\\t\\t\\tfar-off place! They themselves made themselves strangers\\n\\t\\t\\t\\tto it."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "45",
    "NoteID": "4518",
    "Body": "Callousness and self-sufficiency in religion are often\\n\\t\\t\\t\\tillustrated by sects like the Pharisees and Sadducees\\n\\t\\t\\t\\tamong the Jews. Where there are honest differences of\\n\\t\\t\\t\\topinion, they can, in Allah's Plan, lead to greater\\n\\t\\t\\t\\tenquiry and emulation. Where the differences are\\n\\t\\t\\t\\tfractious, there is often even then time left for\\n\\t\\t\\t\\trepentance. In any case the Word or Decree of God is for\\n\\t\\t\\t\\tthe best good of all, and should not disturb Faith. Cf.\\n\\t\\t\\t\\tx. 19. A good life, of faith and truth, is in our own\\n\\t\\t\\t\\tinterests, and the opposite against our own interests.\\n\\t\\t\\t\\tAllah is never unjust."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "47",
    "NoteID": "4519",
    "Body": "There are profound mysteries which the knowledge of man\\n\\t\\t\\t\\tcannot fathom but which are all open knowledge to Allah,\\n\\t\\t\\t\\tbecause He plans, guides and controls all things. The\\n\\t\\t\\t\\tprecise time of the Hour of Judgment is one of these. We\\n\\t\\t\\t\\tare not to dispute about matters like these, which are\\n\\t\\t\\t\\tmatters of speculation as far as human intelligence is\\n\\t\\t\\t\\tconcerned. Such speculations ruined the Ummat of Moses,\\n\\t\\t\\t\\tand set them on the arid path of doubts and\\n\\t\\t\\t\\tcontroversies. Our task is to do our duty and love Allah\\n\\t\\t\\t\\tand man (see the last two verses). Cf. also xxi. 4."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "47",
    "NoteID": "4520",
    "Body": "When the final restoration of true values comes, all\\n\\t\\t\\t\\tfalsehood will be exposed openly and publicly. The false\\n\\t\\t\\t\\tgods will vanish, and their falsehood will be\\n\\t\\t\\t\\tacknowledged by those who had lapsed from true worship.\\n\\t\\t\\t\\tBut it will be too late then for repentance."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "49",
    "NoteID": "4521",
    "Body": "Not only is man prone to doubts and speculations in\\n\\t\\t\\t\\tmatters beyond his ken, thus disturbing the even tenor of\\n\\t\\t\\t\\this spiritual life: he is apt to run into opposite\\n\\t\\t\\t\\textremes in his daily experiences in this life. He is\\n\\t\\t\\t\\talways hankering after the good things of this life. They\\n\\t\\t\\t\\tare not all good for him. If he receives a little check,\\n\\t\\t\\t\\teven though it may be to bring him to his bearings and\\n\\t\\t\\t\\tturn his thoughts to higher things, he is apt to fall\\n\\t\\t\\t\\tinto despair."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "50",
    "NoteID": "4522",
    "Body": "When men entertain false ideas of values in life, there\\n\\t\\t\\t\\tare two or three possible attitudes they may adopt in\\n\\t\\t\\t\\treaction to their experiences. In the first place, their\\n\\t\\t\\t\\tdesire may be inordinate for the good things of this\\n\\t\\t\\t\\tlife, and any little check brings them into a mood of\\n\\t\\t\\t\\tdespair. See last note. In the second place, if their\\n\\t\\t\\t\\tdesire is granted, they are puffed up, and think that\\n\\t\\t\\t\\teverything is due to their own cleverness or merit, and\\n\\t\\t\\t\\tthey forget Allah. Not only that, but they go a step\\n\\t\\t\\t\\tfurther, and begin to doubt a Hereafter at all! If by\\n\\t\\t\\t\\tchance they have a faint glimmering of the Hereafter,\\n\\t\\t\\t\\twhich they cannot help recognising, they think themselves\\n\\t\\t\\t\\t\"favoured of Heaven\", because of some small favours given\\n\\t\\t\\t\\tto them in this life by way of trial. Thus they turn all\\n\\t\\t\\t\\tthings, good or evil, away from their real purpose,\\n\\t\\t\\t\\tbecause they are devoted to falsehood."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "51",
    "NoteID": "4523",
    "Body": "The last verse and note dealt with men's distortion of\\n\\t\\t\\t\\tthe values of life. Here we come to men's ingratitude and\\n\\t\\t\\t\\thypocrisy. If they receive good, they go farther away\\n\\t\\t\\t\\tfrom Allah, instead of coming nearer to him. If they\\n\\t\\t\\t\\tsuffer ill, they call on Allah and offer prolonged\\n\\t\\t\\t\\tprayers, but it is not sincere devotion and therefore\\n\\t\\t\\t\\tworthless."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "51",
    "NoteID": "4524",
    "Body": "Cf. xvii. 83. A) An argument is now addressed, of a most\\n\\t\\t\\t\\tsearching nature. Examine your own souls. See if you do\\n\\t\\t\\t\\tnot really find something unusual in Allah's Revelation!\\n\\t\\t\\t\\tIf you do, and yet you reject it, what a terrible\\n\\t\\t\\t\\tresponsibility fastens itself on you? Could anything be\\n\\t\\t\\t\\tmore foolish or more misguided than to reject a Message\\n\\t\\t\\t\\twhich is transforming the whole world? B) 'If you resist\\n\\t\\t\\t\\tthe convictions of the whole world, you are only forming\\n\\t\\t\\t\\ta Cave or a narrow obscure sect or schism, which serves\\n\\t\\t\\t\\tno purpose, and is unfit to live in the broad light of\\n\\t\\t\\t\\tUniversal Religion.' Cf. ii. 176, n. 176. C) Allah's\\n\\t\\t\\t\\tTruth always spreads, in its own good time, across to the\\n\\t\\t\\t\\tuttermost ends of the earth, as it did in the case of\\n\\t\\t\\t\\tIslam. But its intensive spread in the hearts and souls\\n\\t\\t\\t\\tof people is even more remarkable than its extensive\\n\\t\\t\\t\\tspread over large areas. Men like the four Companions of\\n\\t\\t\\t\\tthe Prophet-and many more-became leaders of men and\\n\\t\\t\\t\\tarbiters of the world's fate. Madinah from being a focus\\n\\t\\t\\t\\tof jarring tribes and factions that hated each other,\\n\\t\\t\\t\\tbecame the seat of heroic actions and plans and the\\n\\t\\t\\t\\tnursery of great and noble heroic deeds that resounded\\n\\t\\t\\t\\tthroughout the world. It makes no difference what men may\\n\\t\\t\\t\\tsay or do. Allah's Truth must prevail, and He knows who\\n\\t\\t\\t\\tobstruct and who help."
  },
  {
    "SurahNumber": "41",
    "AyahNumber": "54",
    "NoteID": "4525",
    "Body": "Short-sighted people may like to think that there may be\\n\\t\\t\\t\\tno Judgment. But Judgment is inevitable and cannot be\\n\\t\\t\\t\\tescaped, for Allah \"doth encompass all things.\""
  }
]
