[
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "1",
    "sectionHeading": "The Order to Be In Wudu (When Touching the Qur'an)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Hazm that in a letter that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, sent to Amr ibn\\n\\t\\t\\t\\tHazm it said that no-one should touch the Qur'an unless\\n\\t\\t\\t\\the was pure.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"No-one should carry the Qur'an by its strap,\\n\\t\\t\\t\\tor on a cushion, unless he is pure. If it were\\n\\t\\t\\t\\tpermissible to do so, it would also have been permissible\\n\\t\\t\\t\\tto carry it in its cover. This is not because there is\\n\\t\\t\\t\\tsomething on the hands of the one who carries it by which\\n\\t\\t\\t\\tthe Qur'an will be soiled, but because it is disapproved\\n\\t\\t\\t\\tof for someone to carry the Qur'an without being pure out\\n\\t\\t\\t\\tof respect for the Qur'an, and in order to honour it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The best thing that I have heard about this\\n\\t\\t\\t\\tis the ayat 'None touch it except the purified.' (Sura 56\\n\\t\\t\\t\\tayat 79)  It ranks with the ayat in Surat Abasa (Sura\\n\\t\\t\\t\\t80), where Allah, the Blessed and Exalted, says, 'No, it\\n\\t\\t\\t\\tis a reminder, and whoever wishes will remember it. Upon\\n\\t\\t\\t\\thonoured pages, exalted and purified, by the hands of\\n\\t\\t\\t\\tscribes, noble and obedient.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "2",
    "sectionHeading": "Permission to Recite the Qur'an When Not in Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Abi Tamima\\n\\t\\t\\t\\tas-Sakhtayani from Muhammad ibn Sirin that Umar ibn\\n\\t\\t\\t\\tal-Khattab was with some people who were reciting Qur'an.\\n\\t\\t\\t\\tHe went to relieve himself and then came back and recited\\n\\t\\t\\t\\tQur'an. One of the men said to him, \"Amir al muminin, are\\n\\t\\t\\t\\tyou reciting the Qur'an without being in wudu?\" Umar\\n\\t\\t\\t\\treplied, \"Who gave you a verdict on this? Was it\\n\\t\\t\\t\\tMusaylima?\"'\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "3",
    "sectionHeading": "About the Division of the Qur'an into Sections (Hizbs)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Dawud ibn al-Husayn\\n\\t\\t\\t\\tfrom al-Araj from Abd ar-Rahman ibn Abd al-Qari that Umar\\n\\t\\t\\t\\tibn al Khattab said, \"Whoever misses reading his hizb at\\n\\t\\t\\t\\tnight and reads it from when the sun has passed the\\n\\t\\t\\t\\tmeridian until the dhuhr prayer has not missed it, or it\\n\\t\\t\\t\\tis as if he has caught it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "4",
    "sectionHeading": "About the Division of the Qur'an into Sections (Hizbs)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"Once Muhammad ibn Yahya ibn Habban and I were sitting\\n\\t\\t\\t\\tdown, and Muhammad called a man over to him and said to\\n\\t\\t\\t\\thim, 'Tell me what you have heard from your father.'  The\\n\\t\\t\\t\\tman replied that his father had told him that he went to\\n\\t\\t\\t\\tZayd ibn Thabit and asked him, 'What do you think of\\n\\t\\t\\t\\treciting the whole Qur'an in seven days?'  Zayd said,\\n\\t\\t\\t\\t'That's good, but I prefer to recite it in two weeks, or\\n\\t\\t\\t\\tten days. Ask me why that is.' He said, 'I ask you then.'\\n\\t\\t\\t\\tZayd said, 'So that I can reflect on it and pause in it.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "5",
    "sectionHeading": "About the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr that Abd ar-Rahman ibn Abd al-Qari said\\n\\t\\t\\t\\tthat he had heard Umar ibn al-Khattab say, \"I heard\\n\\t\\t\\t\\tHisham ibn Hakim ibn Hizam reciting Surat al-Furqan (Sura\\n\\t\\t\\t\\t25) differently from me, and it was the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, who had\\n\\t\\t\\t\\trecited it to me. I was about to rush up to him but I\\n\\t\\t\\t\\tgranted him a respite until he had finished his prayer.\\n\\t\\t\\t\\tThen I grabbed him by his cloak and took him to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and said, 'Messenger of Allah, I heard this man\\n\\t\\t\\t\\treciting Surat al-Furqan differently from the way you\\n\\t\\t\\t\\trecited it to me.'  The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'Let him go.'  Then\\n\\t\\t\\t\\the said, 'Recite, Hisham,' and Hisham recited as I had\\n\\t\\t\\t\\theard him recite. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, 'It was sent down like\\n\\t\\t\\t\\tthat.'\\tThen he said to me, 'Recite' and I recited the\\n\\t\\t\\t\\tsura, and he said, 'It was sent down like that. This\\n\\t\\t\\t\\tQur'an was sent down in seven (different) ways, so recite\\n\\t\\t\\t\\tfrom it whatever is easy for you .' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "6",
    "sectionHeading": "About the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"A man who knows the Qur'an\\n\\t\\t\\t\\twell is like a man who has a hobbled camel. If he takes\\n\\t\\t\\t\\tcare of it, he keeps it, and if he lets it go, it gets\\n\\t\\t\\t\\taway.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "7",
    "sectionHeading": "About the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, that al-Harith ibn\\n\\t\\t\\t\\tHisham asked the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, \"How does the revelation come to\\n\\t\\t\\t\\tyou?\" and the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"Sometimes it comes to me like the\\n\\t\\t\\t\\tringing of a bell, and that is the hardest for me, and\\n\\t\\t\\t\\twhen it leaves me I remember what it has said. And\\n\\t\\t\\t\\tsometimes the angel appears to me in the likeness of a\\n\\t\\t\\t\\tman and talks to me and I remember what he says.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha added, \"I saw it coming down on him on an\\n\\t\\t\\t\\tintensely cold day, and when it had left him his forehead\\n\\t\\t\\t\\twas dripping with sweat.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "8",
    "sectionHeading": "About the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said that Abasa (Sura 80) was sent down about\\n\\t\\t\\t\\tAbdullah ibn Umm Maktum. He came to the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, and began to say, \"O\\n\\t\\t\\t\\tMuhammad, show me a place near you (where I can sit),\"\\n\\t\\t\\t\\twhilst one of the leading men of the idol worshippers was\\n\\t\\t\\t\\tin audience with the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace. The Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, began to turn away from him and give his\\n\\t\\t\\t\\tattention to the other man, and he said to him, \"Father\\n\\t\\t\\t\\tof so-and-so, do you see any harm in what I am saying?\"\\n\\t\\t\\t\\tand he said, \"No, by the blood (of our sacrifices) I see\\n\\t\\t\\t\\tno harm in what you are saying.\"  And Abasa - \"He frowned\\n\\t\\t\\t\\tand turned away when the blind man came\" - was sent down.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "9",
    "sectionHeading": "About the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was on one of his journeys, and\\n\\t\\t\\t\\tone night Umar ibn al-Khattab, who was travelling with\\n\\t\\t\\t\\thim, asked him about something, but he did not answer\\n\\t\\t\\t\\thim. He asked him again, but he did not answer him. Then\\n\\t\\t\\t\\the asked him again, and again he did not answer him. Umar\\n\\t\\t\\t\\tsaid, \"May your mother be bereaved of you, Umar. Three\\n\\t\\t\\t\\ttimes you have importuned the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, with a question and\\n\\t\\t\\t\\the has not answered you at all.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tUmar continued, \"I got my camel moving until, when I was\\n\\t\\t\\t\\tin f ront of the people, I feared that a piece of Qur'an\\n\\t\\t\\t\\twas being sent down about me. It was not long before I\\n\\t\\t\\t\\theard a crier calling for me, and I said that I feared\\n\\t\\t\\t\\tthat a piece of Qur'an had been sent down about me.\" He\\n\\t\\t\\t\\tcontinued, \"I came to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and said, 'Peace be upon\\n\\t\\t\\t\\tyou' to him, and he said, 'A sura has been sent down to\\n\\t\\t\\t\\tme this night that is more beloved to me than anything on\\n\\t\\t\\t\\twhich the sun rises.'  Then he recited al-Fath (Sura 48).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "10",
    "sectionHeading": "About the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Ibrahim ibn al-Harith at-Taymi from Abu\\n\\t\\t\\t\\tSalama ibn Abd ar Rahman that Abu Said said that he had\\n\\t\\t\\t\\theard the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, say, \"A group of people will appear\\n\\t\\t\\t\\tamong you whose prayer, fasting and deeds will make you\\n\\t\\t\\t\\tthink little of your own prayer, fasting and deeds. They\\n\\t\\t\\t\\twill recite the Qur'an, but it wil not get past their\\n\\t\\t\\t\\tthroats, and they will pass through the deen like an\\n\\t\\t\\t\\tarrow passes through game. You look at the arrowhead, and\\n\\t\\t\\t\\tyou see nothing, and you look at the shaft, and you see\\n\\t\\t\\t\\tnothing, and you look at the flights, and you see\\n\\t\\t\\t\\tnothing. And you are in doubt about the notch.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "11",
    "sectionHeading": "About the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that it\\n\\t\\t\\t\\ttook Abdullah ibn Umar eight years to learn Surat\\n\\t\\t\\t\\tal-Baqara. (Sura 2)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t15.5 The Prostration of the Qur'an\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "12",
    "sectionHeading": "The Prostration of the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Yazid,\\n\\t\\t\\t\\tthe mawla of al Aswad ibn Sufyan, from Abu Salama ibn Abd\\n\\t\\t\\t\\tar Rahman that Abu Hurayra recited al-Inshiqaq (Sura 84)\\n\\t\\t\\t\\tto them and prostrated in it. When he had finished he\\n\\t\\t\\t\\ttold them that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, had prostrated in it.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "13",
    "sectionHeading": "The Prostration of the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi, the mawla of\\n\\t\\t\\t\\tIbn Umar that a man from Egypt told him that Umar ibn\\n\\t\\t\\t\\tal-Khattab recited Surat al-Hajj (Sura 22) and prostrated\\n\\t\\t\\t\\ttwice in it, and then said, \"This sura has been given\\n\\t\\t\\t\\tspecial preference by having two prostrations in it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "14",
    "sectionHeading": "The Prostration of the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Dinar\\n\\t\\t\\t\\tsaid, \"I saw Abdullah ibn Umar prostrate twice in Surat\\n\\t\\t\\t\\tal-Hajj (Sura 22).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "15",
    "sectionHeading": "The Prostration of the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tal-Araj that Umar ibn al Khattab recited Surat an-Najm\\n\\t\\t\\t\\t(Sura 53) and prostrated in it, and then got up and\\n\\t\\t\\t\\trecited another sura.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "16",
    "sectionHeading": "The Prostration of the Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Umar ibn al-Khattab once recited a piece\\n\\t\\t\\t\\tof Qur'an requiring a prostration while he was on the\\n\\t\\t\\t\\tmimbar on the day of jumua, and he came down and\\n\\t\\t\\t\\tprostrated, and everyone prostrated with him. Then he\\n\\t\\t\\t\\trecited it again the next jumua and everybody prepared to\\n\\t\\t\\t\\tprostrate but he said, \"At your ease. Allah has not\\n\\t\\t\\t\\tprescribed it for us, unless we wish.\" He did not\\n\\t\\t\\t\\tprostrate, and he stopped them from prostrating.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The imam does not come down and prostrate\\n\\t\\t\\t\\twhen he recites a piece of Qur'an requiring a prostration\\n\\t\\t\\t\\twhile he is on the mimbar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The position with us is that there are\\n\\t\\t\\t\\televen prescribed prostrations in the Qur'an, none of\\n\\t\\t\\t\\twhich are in the mufassal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"No-one should recite any of the pieces of\\n\\t\\t\\t\\tQur'an that require a prostration after the prayers of\\n\\t\\t\\t\\tsubh and asr. This is because the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbade prayer after\\n\\t\\t\\t\\tsubh until after the sun had risen, and after asr until\\n\\t\\t\\t\\tthe sun had set, and prostration is part of the prayer.\\n\\t\\t\\t\\tSo no-one should recite any piece of Qur'an requiring a\\n\\t\\t\\t\\tprostration during these two periods of time.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a menstruating woman could\\n\\t\\t\\t\\tprostrate if she heard some-one reciting a passage of\\n\\t\\t\\t\\tQur'an requiring a prostration, and he said, \"Neither a\\n\\t\\t\\t\\tman nor a woman should prostrate unless they are ritually\\n\\t\\t\\t\\tpure.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether a man in the company of a woman\\n\\t\\t\\t\\twho was reciting a passage of Qur'an requiring a\\n\\t\\t\\t\\tprostration should prostrate with her, and he said, \"He\\n\\t\\t\\t\\tdoes not have to prostrate with her. The prostration is\\n\\t\\t\\t\\tonly obligatory for people who are with a man who is\\n\\t\\t\\t\\tleading them. He recites the piece and they prostrate\\n\\t\\t\\t\\twith him. Some one who hears a piece of Qur'an that\\n\\t\\t\\t\\trequires a prostration being recited by a man who is not\\n\\t\\t\\t\\tleading him in prayer does not have to do the\\n\\t\\t\\t\\tprostration.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "17",
    "sectionHeading": "About Reciting Surat al-Ikhlas and Surat al-Mulk",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tAbdullah ibn Sasaca from his father that Abu Said\\n\\t\\t\\t\\tal-Khudri heard a man reciting Surat al-Ikhlas (Sura\\n\\t\\t\\t\\t112), repeating it over and over again. In the morning he\\n\\t\\t\\t\\twent to the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and mentioned it to him, as if he\\n\\t\\t\\t\\tthought little of it. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Bythe One in whose\\n\\t\\t\\t\\thand my self is, it is equal to one third of the Qur'an.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "18",
    "sectionHeading": "About Reciting Surat al-Ikhlas and Surat al-Mulk",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ubaydullah ibn Abd\\n\\t\\t\\t\\tar-Rahman that Ubayd ibn Hunayn, the mawla of the family\\n\\t\\t\\t\\tof Zayd ibn al Khattab, said that he had heard Abu\\n\\t\\t\\t\\tHurayra say, \"I was going along with the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, when he\\n\\t\\t\\t\\theard a man reciting Surat al-Ikhlas (Sura 112). The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'It is obligatory,' and I asked him, 'What\\n\\t\\t\\t\\tis, Messenger of Allah?' and he said, 'The Garden.' I\\n\\t\\t\\t\\twanted to tell the man the good news but I was afraid\\n\\t\\t\\t\\tthat I would miss the midday meal with the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, and I\\n\\t\\t\\t\\tpreferred to eat with the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace. When I went to the man\\n\\t\\t\\t\\tafterwards I found that he had gone.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "19",
    "sectionHeading": "About Reciting Surat al-Ikhlas and Surat al-Mulk",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tHumayd ibn Abd ar-Rahman ibn Awf had told him that Surat\\n\\t\\t\\t\\tal-Ikhlas (Sura 112) was equal to a third of the Qur'an,\\n\\t\\t\\t\\tand that Surat al-Mulk (Sura 67) pleaded for its owner.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "20",
    "sectionHeading": "Dhikr (Remembrance) ofAllah, the Blessed and Exalted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr, from Abu Salih as-Samman from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Whoever says 'There is no god but Allah,\\n\\t\\t\\t\\talone, without any partner. The Kingdom and praise belong\\n\\t\\t\\t\\tto Him and He has power over everything' (La ilaha\\n\\t\\t\\t\\tilla'llah, wahdahu la sharika lah, lahu'l mulku wa lahu'l\\n\\t\\t\\t\\thamd, wa huwa ala kulli shay'in qadir) one hundred times\\n\\t\\t\\t\\ta day, it is the same for him as freeing ten slaves. One\\n\\t\\t\\t\\thundred good actions are written for him and one hundred\\n\\t\\t\\t\\twrong actions are erased from him, and it is a protection\\n\\t\\t\\t\\tfrom Shaytan for that day until the night. No-one does\\n\\t\\t\\t\\tanything more excellent than what he does except someone\\n\\t\\t\\t\\twho does more than that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "21",
    "sectionHeading": "Dhikr (Remembrance) ofAllah, the Blessed and Exalted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr, from Abu Salih as-Samman from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Whoever says, 'Glory be to Allah and with\\n\\t\\t\\t\\tHis praise' (Subhana'llah wa bi-hamdihi) one hundred\\n\\t\\t\\t\\ttimes in a day will have his wrong actions taken away\\n\\t\\t\\t\\tfrom him, even if they are as abundant as the foam on the\\n\\t\\t\\t\\tsea.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "22",
    "sectionHeading": "Dhikr (Remembrance) ofAllah, the Blessed and Exalted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Ubayd, the mawla\\n\\t\\t\\t\\tof Sulayman ibn Abd al-Malik, from Ata ibn Yazid\\n\\t\\t\\t\\tal-Laythi that Abu Hurayra said, \"Whoever says 'Glory be\\n\\t\\t\\t\\tto Allah' (Subhana'llah) thirty-three times and 'Allah is\\n\\t\\t\\t\\tGreater' (Allahu akbar) thirty-three times and 'Praise be\\n\\t\\t\\t\\tto Allah' (al-hamdu lillah) thirty-three times, and seals\\n\\t\\t\\t\\tthe hundred with 'There is no god but Allah, alone\\n\\t\\t\\t\\twithout any partner. The Kingdom and praise belong to Him\\n\\t\\t\\t\\tand He has power over everything' (La ilaha illa'llah,\\n\\t\\t\\t\\twahdahu la sharika lah, lahu'l mulku wa lahu'l hamd, wa\\n\\t\\t\\t\\thuwa ala kulli shay'in qadir) after every prayer will\\n\\t\\t\\t\\thave his wrong actions forgiven him even if they are\\n\\t\\t\\t\\tabundant as the foam on the sea.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "23",
    "sectionHeading": "Dhikr (Remembrance) ofAllah, the Blessed and Exalted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Umara ibn Sayyad had\\n\\t\\t\\t\\theard Said ibn al Musayyab say about abiding good deeds\\n\\t\\t\\t\\tthat they were a slave's saying 'Allah is greater'\\n\\t\\t\\t\\t(Allahu akbar) and 'Glory be to Allah' (Subahana'llah)\\n\\t\\t\\t\\tand 'Praise be to Allah' (al-hamdu lillah) and 'There is\\n\\t\\t\\t\\tno god but Allah and there is no power and no strength\\n\\t\\t\\t\\texcept by Allah.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tLa ilaha illa'llah wa la hawla wa la quwwata illa\\n\\t\\t\\t\\tbi'llah.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "24",
    "sectionHeading": "Dhikr (Remembrance) ofAllah, the Blessed and Exalted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ziyad ibn Abi Ziyad\\n\\t\\t\\t\\tsaid that Abu'd-Darda had said, \"Shall I not tell you the\\n\\t\\t\\t\\tbest of your deeds, and those that give you the highest\\n\\t\\t\\t\\trank, and those that are the purest with your King, and\\n\\t\\t\\t\\tare better for you than giving gold and silver, and\\n\\t\\t\\t\\tbetter for you than meeting your enemy and striking their\\n\\t\\t\\t\\tnecks?\" They said, \"Of course.\" He said, \"Remembrance\\n\\t\\t\\t\\t(dhikr) of Allah ta ala.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "25",
    "sectionHeading": "Dhikr (Remembrance) ofAllah, the Blessed and Exalted",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nuaym ibn Abdullah ibn al-Mujmir\\n\\t\\t\\t\\tfrom AIi ibn Yahya az-Zuraqi from his father that Rifaa\\n\\t\\t\\t\\tibn Rafi said, \"One day we were praying behind the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, when the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, raised his head from ruku and said,\\n\\t\\t\\t\\t'Allah hears the one who praises Him' (Sami Allahu liman\\n\\t\\t\\t\\thamidah). A man behind him said, 'Our Lord, praise\\n\\t\\t\\t\\tbelongs to you - blessed, pure and abundant praise'\\n\\t\\t\\t\\t(Rabbana wa laka'l hamd kathiran tayiban mubarakan fihi).\\n\\t\\t\\t\\tWhen the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, had finished, he said, 'Who was it who\\n\\t\\t\\t\\tspoke just now?' The man said, 'I did, Messenger of\\n\\t\\t\\t\\tAllah,' and the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, 'I saw more than thirty angels\\n\\t\\t\\t\\trushing to it to see which one of them would record it\\n\\t\\t\\t\\tfirst.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "26",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Every prophet\\n\\t\\t\\t\\tis given a supplication (dua), and I wish to preserve my\\n\\t\\t\\t\\tdua as intercession for my community in the next world.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "27",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the had heard that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, used to say the following dua,\\n\\t\\t\\t\\t\"O Allah, it is You who makes the dawn break and makes\\n\\t\\t\\t\\tthe night a time for rest and appoints the sun and moon\\n\\t\\t\\t\\tto reckon by. Relieve me of debt and enrich me from\\n\\t\\t\\t\\tpoverty and let me enjoy my hearing, my sight and my\\n\\t\\t\\t\\tstrength in Your way.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllahumma faliqa'l isbah, wa ja ila'l-layli sakana,\\n\\t\\t\\t\\twa'sh-shamsi wa'l-qamari husbana. Iqda anniy addayna,\\n\\t\\t\\t\\twa'ghnaniy mina'l faqr. Na'mti aniy bi samiy wa basariy,\\n\\t\\t\\t\\twa quwwatiy fi sabilik.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "28",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z  Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, ''When you are\\n\\t\\t\\t\\tmaking dua do not say; 'O Allah, forgive me if You wish.\\n\\t\\t\\t\\tO Allah, forgive me if you wish.' You should be firm in\\n\\t\\t\\t\\tyour asking, for there is no compelling Him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "29",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tUbayd, the mawla of Ibn Azhar, from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"You will be answered as long as you are not\\n\\t\\t\\t\\timpatient and say, 'I have made a dua and I have not been\\n\\t\\t\\t\\tanswered .' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "30",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tAbdullah al-Agharr and from Abu Salama from Abu Hurayra\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"Our Lord, the Blessed and\\n\\t\\t\\t\\tExalted, descends every night to the heaven of this world\\n\\t\\t\\t\\twhen the last third of the night is still to come and\\n\\t\\t\\t\\tsays, 'Who will call on Me so that I may answer him? Who\\n\\t\\t\\t\\twill ask Me so that I may give him? Who will ask\\n\\t\\t\\t\\tforgiveness of Me so that I may forgive him?' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "31",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Ibrahim ibn al-Harith at-Taymi that A'isha,\\n\\t\\t\\t\\tumm al-muminin said, \"I was sleeping by the side of the\\n\\t\\t\\t\\tMessenger of Allah, mayAllah bless him and grant him\\n\\t\\t\\t\\tpeace, and I missed him in the night, so I felt for him\\n\\t\\t\\t\\twith my hand and I put my hand on his feet and he was in\\n\\t\\t\\t\\tsajda saying, 'I seek refuge in Your pleasure from Your\\n\\t\\t\\t\\twrath, and in Your pardon from Your punishment, and in\\n\\t\\t\\t\\tYou from You. I cannot enumerate Your praises as You\\n\\t\\t\\t\\tpraise Yourself.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAudhu bi ridaka min sakhatika, wa bi muafatika min\\n\\t\\t\\t\\tuqubatika wa bika minka, la uhsiy thana'an alayka, anta\\n\\t\\t\\t\\tkama athnayta ala nafsika.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "32",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ziyad ibn Abi Ziyad\\n\\t\\t\\t\\tfrom Talha ibn Ubaydullah ibn Kariz that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"The best dua is dua on the day of Arafa, and the best\\n\\t\\t\\t\\tthing that I or the Prophets before me have said is\\n\\t\\t\\t\\t'There is no god but Allah, alone, without any partner'\\n\\t\\t\\t\\t(La ilaha illa'llah, wahdahu la sharika lah.)\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "33",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'zZubayr al-Makki\\n\\t\\t\\t\\tfrom Tawus al-Yamani from Abdullah ibn Abbas that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to teach this dua in the same way that he\\n\\t\\t\\t\\twould teach them a sura of the Qur'an, \"O Allah, I seek\\n\\t\\t\\t\\trefuge in You from the torment of Jahannam, and I seek\\n\\t\\t\\t\\trefuge in You from the trial of the Dajjal, and I seek\\n\\t\\t\\t\\trefuge in You from the trial of life and death.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllahumma inniy audhu bika min adhabi jahannama, wa audhu\\n\\t\\t\\t\\tbika min adhabi'l-qabri, wa audhu bika min\\n\\t\\t\\t\\tfitnati'l-mahya wa mamati.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "34",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zubayr al-Makki\\n\\t\\t\\t\\tfrom Tawus al-Yamani from Abdullah ibn Abbas that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to say, when he rose for prayer in the middle\\n\\t\\t\\t\\tof the night, \"O Allah, praise belongs to You. You are\\n\\t\\t\\t\\tthe light of the heavens and the earth and praise belongs\\n\\t\\t\\t\\ttoYou.You are the Sustainer of the heavens and the earth\\n\\t\\t\\t\\tand praise belongs to You. You are the Lord of the\\n\\t\\t\\t\\theavens and the earth and whoever is in them. You are the\\n\\t\\t\\t\\tTruth, and Your words are true. Your promise is true, and\\n\\t\\t\\t\\tthe meeting with You is true. The Garden is true and the\\n\\t\\t\\t\\tFire is true and the Hour is true. O Allah, I submit\\n\\t\\t\\t\\ttoYou and I accept You and I trust in You and I turn to\\n\\t\\t\\t\\tYou and I argue by You and I summon toYou for judgement.\\n\\t\\t\\t\\tForgive me what I have sent before me and what I have\\n\\t\\t\\t\\tleft behind, what I have kept secret and what I have\\n\\t\\t\\t\\tproclaimed, You are my god - there is no god but You.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllahumma laka'l-hamdu anta nuru's-samawati wa'l-ardi, wa\\n\\t\\t\\t\\tlaka'l-hamdu anta qayamu's-Samawati wa'l-ardi, wa\\n\\t\\t\\t\\tlaka'l-hamdu anta rabbu's-Samawati\\n\\t\\t\\t\\twa'l-ardi,wamanfihina.Anta'l-haqqu,waqawluka'lhaqqu, wa\\n\\t\\t\\t\\twaduka'l-haqqu, wa liqa'uka haqqun, wa jannatu haqqun, wa\\n\\t\\t\\t\\tnaru haqqun, wa sactu haqqun. Allahumma laka aslamtu, wa\\n\\t\\t\\t\\tbikaamantu, waalayka tawakaltu, wa ilayka anabtu, wa bika\\n\\t\\t\\t\\tkhasamtu, wa ilayka hakamtu, fa'ghfirliy ma qadamtu wa\\n\\t\\t\\t\\takhartu wa asrartu, wa alantu. Anta ilahiy, la ilaha illa\\n\\t\\t\\t\\tant.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "35",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Abdullah\\n\\t\\t\\t\\tibn Jabir ibn Atik said that Abdullah ibn Umar had come\\n\\t\\t\\t\\tto them in Bani Muawiya, one of the villages of the\\n\\t\\t\\t\\tAnsar, and said, \"Do you know where the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, prayed in\\n\\t\\t\\t\\tthis mosque of yours? \"I told him, \"Yes,\" and I pointed\\n\\t\\t\\t\\tout a place near where he was. He said, \"Do you know the\\n\\t\\t\\t\\tthree things for which he made dua here?\" I said \"Yes.\"\\n\\t\\t\\t\\tHe said, \"Tell me them then.\" I said, \"He asked that He\\n\\t\\t\\t\\twould not make an enemy from among the non-believers\\n\\t\\t\\t\\ttriumph over the believers and that He would not destroy\\n\\t\\t\\t\\tthe believers by bad harvests, and he was given both\\n\\t\\t\\t\\tthese things. And he asked that He would not make the\\n\\t\\t\\t\\tbelievers fight among themselves, and that was refused.\"\\n\\t\\t\\t\\tIbn Umar said, \"You have told the truth,\" and he added,\\n\\t\\t\\t\\t\"Turmoil will not cease until the day of rising.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "36",
    "sectionHeading": "Dua (Supplication)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Zayd ibn Aslam used\\n\\t\\t\\t\\tto say, \"No-one makes a dua without one of three things\\n\\t\\t\\t\\thappening. Either it is answered, or it is stored up for\\n\\t\\t\\t\\thim, or wrong actions are atoned for by it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "37",
    "sectionHeading": "MakingDua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Dinar\\n\\t\\t\\t\\tsaid, \"Abdullah ibn Umar saw me when I was making dua and\\n\\t\\t\\t\\tI was pointing with two fingers, one from each hand, and\\n\\t\\t\\t\\the forbade me.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "38",
    "sectionHeading": "MakingDua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab used to say, \"A man is raised by the\\n\\t\\t\\t\\tdua of\\this son after his death.\" He spoke with his hands\\n\\t\\t\\t\\tturned upwards, and then lifted them up.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "39",
    "sectionHeading": "MakingDua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"The following ayat was sent down about\\n\\t\\t\\t\\tdua - 'And do not be loud in your prayer and do not be\\n\\t\\t\\t\\tsilent in it, but seek a way between these.' \" (Sura 17\\n\\t\\t\\t\\tayat 110)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked about making dua in\\n\\t\\t\\t\\tobligatory prayers and he said, \"There is no harm in\\n\\t\\t\\t\\tmaking dua in them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "40",
    "sectionHeading": "MakingDua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to make dua saying, \"O Allah, I askYou for\\n\\t\\t\\t\\tgood actions and for leaving what is disapproved of and\\n\\t\\t\\t\\tfor love of the poor. And if You wish to try people, then\\n\\t\\t\\t\\tbring me to You without being tried.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllahumma inniy asa'luka fala'l-khayrati, wa\\n\\t\\t\\t\\ttarqa'l-munqarati, wa hubba'l-masakin, wa idha aradta\\n\\t\\t\\t\\tfi'n-nasi fitnatan fa'qbithni ilayka ghayra maftun.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "41",
    "sectionHeading": "MakingDua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"No one calls to guidance without having the\\n\\t\\t\\t\\tsame reward as those who follow him without diminishing\\n\\t\\t\\t\\ttheir rewards at all. And no one calls to error without\\n\\t\\t\\t\\thaving the same burdens as they do without diminishing\\n\\t\\t\\t\\ttheir burdens at all.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "42",
    "sectionHeading": "MakingDua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar said, \"O Allah, make me one of the\\n\\t\\t\\t\\tleaders of the people of taqwa .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllahumma jalniy min a'imati'l-mutaqin.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "43",
    "sectionHeading": "MakingDua",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbu'd-Darda used to rise in the middle of the night and\\n\\t\\t\\t\\tsay, \"Eyes have slept, and stars have set, and You are\\n\\t\\t\\t\\tthe Living and Self Subsistent.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tNamat'l uyun wa ghariti'n-nujum wa anta'lhayyu-l-qayyum.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "44",
    "sectionHeading": "Forbidding Prayer After Subh and After Asr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar from Abdullah as-Sunabihi that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"The sun rises and with it is a horn of\\n\\t\\t\\t\\tShaytan and when the sun gets higher the horn leaves it.\\n\\t\\t\\t\\tThen when the sun reaches the meridian the horn joins it\\n\\t\\t\\t\\tand when the sun declines the horn leaves it, and when\\n\\t\\t\\t\\tthe sun has nearly set it joins it again.\"  The Messenger\\n\\t\\t\\t\\tof Allah,  may Allah bless him and grant him peace,\\n\\t\\t\\t\\tforbade prayer at these times.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "45",
    "sectionHeading": "Forbidding Prayer After Subh and After Asr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, used to say, \"Delay the\\n\\t\\t\\t\\tprayer when the edge of the sun appears until it is\\n\\t\\t\\t\\tcompletely in view, and delay the prayer when the edge of\\n\\t\\t\\t\\tthe sun is disappearing until it has completely\\n\\t\\t\\t\\tdisappeared.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "46",
    "sectionHeading": "Forbidding Prayer After Subh and After Asr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that al-Ala ibn Abd\\n\\t\\t\\t\\tar-Rahman said, \"We visited Anas ibn Malik after dhuhr\\n\\t\\t\\t\\tand he stood up and prayed asr. When he had finished his\\n\\t\\t\\t\\tprayer, we mentioned doing prayers early in their time,\\n\\t\\t\\t\\tor he mentioned it, and he said that he had heard the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, the prayer of the hypocrites, the prayer of\\n\\t\\t\\t\\tthe hypocrites, the prayer of the hypocrites is that one\\n\\t\\t\\t\\tof them sits until the sun becomes yellow and is between\\n\\t\\t\\t\\tthe horns of Shaytan, or on the horn of Shaytan, and then\\n\\t\\t\\t\\tgets up and rattles off four rakas, hardly remembering\\n\\t\\t\\t\\tAllah in them at all.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "47",
    "sectionHeading": "Forbidding Prayer After Subh and After Asr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"You should not intend to pray\\n\\t\\t\\t\\teither at sunrise or sunset.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "48",
    "sectionHeading": "Forbidding Prayer After Subh and After Asr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Yahya\\n\\t\\t\\t\\tibn Habban from al Araj from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade prayer after asr until the sun had set,\\n\\t\\t\\t\\tand prayer after subh until the sun had risen.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "49",
    "sectionHeading": "Forbidding Prayer After Subh and After Asr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that Umar ibn al-Khattab used to\\n\\t\\t\\t\\tsay, \"Do not intend to do your prayer at either sunrise\\n\\t\\t\\t\\tor sunset, for the horns of Shaytan rise with the rising\\n\\t\\t\\t\\tof the sun and set with its setting.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tUmar used to beat people for that kind of prayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "15",
    "hadithNumber": "50",
    "sectionHeading": "Forbidding Prayer After Subh and After Asr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tas-Sa'ib ibn Yazid that he saw Umar ibn al-Khattab\\n\\t\\t\\t\\tbeating al-Munkadir for praying after asr.\\n\\t\\t\\t</p>"
  }
]
