[
  {
    "SurahNumber": "60",
    "AyahNumber": "1",
    "Text": "O believers! Do not make friendship with those who are enemies of\\n\\t\\t\\tMine and yours. Would you show them friendship, when they have\\n\\t\\t\\tdenied the truth that has come to you and have driven the Rasool\\n\\t\\t\\tand yourselves out of your homes, simply because you believe in\\n\\t\\t\\tAllah, your Rabb? If it was indeed to strive in My way, and to\\n\\t\\t\\tseek My good pleasure that you left your homes, how can you\\n\\t\\t\\tbefriend in secret? I know all that you conceal, and all that you\\n\\t\\t\\treveal. Any of you who does this, he indeed has gone astray from\\n\\t\\t\\tthe Right Way."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "2",
    "Text": "If they overcome you, they would behave to you as enemies and\\n\\t\\t\\tstretch out their hands and their tongues towards you with evil,\\n\\t\\t\\tand they wish to see you become unbelievers."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "3",
    "Text": "On the Day of Resurrection, neither your relatives nor your\\n\\t\\t\\tchildren shall avail you. Allah will judge between you, and He is\\n\\t\\t\\tobserving all your actions."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "4",
    "Text": "You have an excellent example in Ibrahim (Abraham) and his\\n\\t\\t\\tcompanions. They said to their people plainly: \"We are clear of\\n\\t\\t\\tyou and your gods, whom you worship besides Allah. We renounce\\n\\t\\t\\tyou. Enmity and hate shall reign between us forever until you\\n\\t\\t\\tbelieve in Allah, the One and Only God.\" But do not emulate what\\n\\t\\t\\tIbrahim said to his father: \"I will pray for your forgiveness,\\n\\t\\t\\talthough I have no power to get anything for you from Allah.\"\\n\\t\\t\\tTheir collective prayer was: \"Our Rabb! In You we have put our\\n\\t\\t\\ttrust, to You we turn in repentance and to You is our final goal."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "5",
    "Text": "Our Rabb! Do not expose us to the plots of the unbelievers.\\n\\t\\t\\tForgive us, our Rabb! You are the All-Mighty, the All-Wise.\""
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "6",
    "Text": "Truly, in those there is an excellent example for everyone who\\n\\t\\t\\tputs their hopes in Allah and the Last Day. He that gives no heed\\n\\t\\t\\tshould know that Allah is free of all wants, worthy of all\\n\\t\\t\\tpraise."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "7",
    "Text": "It may well be that Allah will put love between you and those\\n\\t\\t\\twith whom you are now at odds because of the order which is given\\n\\t\\t\\tto you, for Allah is All-Powerful, and Allah is Oft-Forgiving,\\n\\t\\t\\tMost Merciful."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "8",
    "Text": "Allah does not forbid you to be kind and equitable to those who\\n\\t\\t\\thad neither fought against your faith nor driven you out of your\\n\\t\\t\\thomes. In fact Allah loves the equitable."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "9",
    "Text": "Allah only forbids you to make friendship with those who fought\\n\\t\\t\\tyou on account of your faith and drove you out of your homes and\\n\\t\\t\\tbacked up others in your expulsion. Those who will take them for\\n\\t\\t\\tfriends are indeed the wrongdoers."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "Text": "O believers! When the believing women seek refuge with you, test\\n\\t\\t\\tthem. Allah best knows their faith. If you find them true\\n\\t\\t\\tbelievers, do not send them back to the unbelievers. They are not\\n\\t\\t\\tlawful to the unbelievers, nor are the unbelievers lawful to\\n\\t\\t\\tthem. Return to their unbelieving husbands what they have spent\\n\\t\\t\\ton them. There is no blame on you if you marry such women,\\n\\t\\t\\tprovided you give them their dowers. Do not hold on to your\\n\\t\\t\\tmarriages with unbelieving women. Demand what you have spent on\\n\\t\\t\\tthem and let the unbelievers do the same. This is the order of\\n\\t\\t\\tAllah which He has decreed between you. Allah is All-Knowing,\\n\\t\\t\\tAll-Wise."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "11",
    "Text": "If you do not get back the demanded amount that you have spent on\\n\\t\\t\\tyour disbelieving wives from the unbelievers, and your turn\\n\\t\\t\\tcomes, to pay the demanded amount of Muslim wives to the\\n\\t\\t\\tunbelievers, you can offset the amount and pay those whose wives\\n\\t\\t\\thave fled the equivalent of the amount they have spent on their\\n\\t\\t\\tdisbelieving wives. Fear Allah, in Whom you believe."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "12",
    "Text": "O Prophet! When the believing women come to you to take the oath\\n\\t\\t\\tof allegiance , take their pledge: that they will not commit\\n\\t\\t\\tshirk with Allah, that they will not steal, that they will not\\n\\t\\t\\tcommit adultery, that they will not kill their children, that\\n\\t\\t\\tthey will not give any cause for scandal which they may invent\\n\\t\\t\\tbetween either their hands or legs (a woman accusing another\\n\\t\\t\\twoman of having an illicit relationship with a man and spreads\\n\\t\\t\\tsuch stories - or - a woman carrying an illegitimate child and\\n\\t\\t\\tmakes her husband believe that it is his), and that they will not\\n\\t\\t\\tdisobey you in any just matter, then accept their allegiance and\\n\\t\\t\\tpray to Allah for the forgiveness. Surely Allah is Oft-Forgiving,\\n\\t\\t\\tmost Merciful."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "13",
    "Text": "O believers! Do not befriend those who have incurred the wrath of\\n\\t\\t\\tAllah. Indeed they despair of the Hereafter, just as the\\n\\t\\t\\tunbelievers despair of those buried in the graves."
  }
]
