[
  {
    "SurahNumber": "47",
    "AyahNumber": "1",
    "NoteID": "4817",
    "Body": "Whatever they do will miss its mark, because Allah is the\\n\\t\\t\\t\\tsource of all energy and life. If the wicked try to\\n\\t\\t\\t\\tpersecute men or seduce them from the Truth, the result\\n\\t\\t\\t\\twill be the opposite of what they intend."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "2",
    "NoteID": "4818",
    "Body": "Bal means state or condition, whether external, or of the\\n\\t\\t\\t\\theart and mind. Both meanings apply here. The more the\\n\\t\\t\\t\\twicked rage, the better will be the position of the\\n\\t\\t\\t\\trighteous, and Allah will make it easier and easier for\\n\\t\\t\\t\\tthe righteous to love and follow the Truth."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "3",
    "NoteID": "4819",
    "Body": "We learn the greatest moral lessons by parables and\\n\\t\\t\\t\\tsimilitudes from things that happen in the outer world.\\n\\t\\t\\t\\tIf a man goes after a mirage or a thing that has no real\\n\\t\\t\\t\\texistence, he can never reach his goal, while the man\\n\\t\\t\\t\\tthat follows the kindly Light from Allah that leads him\\n\\t\\t\\t\\ton must be happier in mind, sounder in heart, and firmer\\n\\t\\t\\t\\tin life, generally for every moment that he lives."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "NoteID": "4820",
    "Body": "When once the fight (Jihad) is entered upon, carry it out\\n\\t\\t\\t\\twith the utmost vigour, and strike home your blows at the\\n\\t\\t\\t\\tmost vital points (smite at their necks), both literally\\n\\t\\t\\t\\tand figuratively. You cannot wage war with kid gloves."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "NoteID": "4821",
    "Body": "In the first onset there must necessarily be great loss\\n\\t\\t\\t\\tof life; \"after the enemy's numbers are fairly thinned\\n\\t\\t\\t\\tdown, prisoners may be taken\". With this passage may be\\n\\t\\t\\t\\tcompared viii. 67, and n. 1234."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "NoteID": "4822",
    "Body": "When once the enemy is brought under control, generosity\\n\\t\\t\\t\\t(i.e., the release of prisoners without ransom) or ransom\\n\\t\\t\\t\\tis recommended."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "NoteID": "4823",
    "Body": "The Believers are tested in Faith by the extent to which\\n\\t\\t\\t\\tthey are willing to make sacrifices, even to the laying\\n\\t\\t\\t\\tdown of their lives; and the enemies are tested as to\\n\\t\\t\\t\\twhether they would repent and let the righteous live in\\n\\t\\t\\t\\tfreedom and security."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "NoteID": "4824",
    "Body": "There are two alternative readings, (1) qatalu, \"those\\n\\t\\t\\t\\twho fight\", and (2) qutilu, \"those who are slain\". The\\n\\t\\t\\t\\tmeaning under the first reading is wider, and includes\\n\\t\\t\\t\\tthat under the second. I have translated on the basis of\\n\\t\\t\\t\\tthe second reading, which is in accordance with the text\\n\\t\\t\\t\\tof the Royal Egyptian edition."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "5",
    "NoteID": "4825",
    "Body": "If we read \"who are slain\" in the last clause but one of\\n\\t\\t\\t\\tverse 4, (see last note), \"guide\" would mean \"guide them\\n\\t\\t\\t\\tin their journey after death\"."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "6",
    "NoteID": "4826",
    "Body": "\"The Garden which He has made known to them \": Cf. ii.\\n\\t\\t\\t\\t25."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "8",
    "NoteID": "4827",
    "Body": "See above, xlvii. I and n. 4817."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "9",
    "NoteID": "4828",
    "Body": "Their deeds are \"fruitless\" in the sense that they are\\n\\t\\t\\t\\tvain; they do not produce the results intended by their\\n\\t\\t\\t\\tdoers. But they will not be exempt from producing the\\n\\t\\t\\t\\tnatural consequences of evil, viz., further degradation\\n\\t\\t\\t\\tand misery for the soul."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "10",
    "NoteID": "4829",
    "Body": "The end of evil is evil. All past history and tradition\\n\\t\\t\\t\\tshows that. Will not men of every generation learn that\\n\\t\\t\\t\\tlesson? Allah helps His servants, but those who rebel\\n\\t\\t\\t\\tagainst Allah have no one to help them."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "12",
    "NoteID": "4830",
    "Body": "An apt simile. Beasts of the field eat their fill, but\\n\\t\\t\\t\\thave no higher interests. Men who worship the world\\n\\t\\t\\t\\texclusively are no better: their pleasures and enjoyments\\n\\t\\t\\t\\trise no higher than those of the beasts of the field.\\n\\t\\t\\t\\tThey have no inkling of spiritual happiness. On the\\n\\t\\t\\t\\tcontrary, as they were endowed with spiritual faculties\\n\\t\\t\\t\\twhich they misused, they will not escape the Fire of\\n\\t\\t\\t\\tPunishment, the Penalty of Sin."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "13",
    "NoteID": "4831",
    "Body": "A reference to Pagan Makkah, which drove out the holy\\n\\t\\t\\t\\tProphet because of his righteousness and because he\\n\\t\\t\\t\\tpreached Repentance. The date of this Sura must therefore\\n\\t\\t\\t\\tbe after the Hijrat."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "14",
    "NoteID": "4832",
    "Body": "Clear, or enlightened; a Path on which shines the Light\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "NoteID": "4833",
    "Body": "In this description there are four kinds of drinks and\\n\\t\\t\\t\\tall kinds of fruits; and the summing up of all delights\\n\\t\\t\\t\\tin the \"Forgiveness from their Lord\". The four kinds of\\n\\t\\t\\t\\tdrinks are: (1) delicious, cool, pure water, not like\\n\\t\\t\\t\\tearthly water, for it never suffers corruption; (2) milk\\n\\t\\t\\t\\twhich never turns Sour, whose taste is like that of fresh\\n\\t\\t\\t\\twarm milk drawn from the udder; (3) wine, not like any\\n\\t\\t\\t\\twine on earth, for it leaves no headaches behind, and\\n\\t\\t\\t\\tcauses no intoxication, which is a kind of madness or\\n\\t\\t\\t\\tpoison, but is ever a joy to drink; and (4) honey, pure\\n\\t\\t\\t\\tand clear, with no admixture of wax or any foreign\\n\\t\\t\\t\\tsubstance. These drinks, will cool the spirit, feed the\\n\\t\\t\\t\\theart, warm the affections, and sweeten life."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "NoteID": "4834",
    "Body": "See n. 4671 to xliii. 73."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "NoteID": "4835",
    "Body": "Forgiveness from their Lord: that is the covering up or\\n\\t\\t\\t\\tblotting out of sin and all that was sad or\\n\\t\\t\\t\\tunsatisfactory in the lower life; the pure Light from the\\n\\t\\t\\t\\tCountenance of Allah Most High: xcii. 20."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "NoteID": "4836",
    "Body": "Cf. xxxvii. 66-67, and n. 4074. Just as the Bliss of the\\n\\t\\t\\t\\tBlessed will penetrate their being through and through,\\n\\t\\t\\t\\tso the agony of the condemned ones will penetrate their\\n\\t\\t\\t\\tbeing through and through."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "16",
    "NoteID": "4837",
    "Body": "Cf. x. 42, and n. 1434; also vi. 25, 36, and n. 857. The\\n\\t\\t\\t\\tcase here referred to is that of the Hypocrites who came\\n\\t\\t\\t\\tto the assemblies of Islam in Madinah and pretended to\\n\\t\\t\\t\\tlisten to the Prophet's teaching and preaching. But their\\n\\t\\t\\t\\theart and mind were not in learning righteousness, but in\\n\\t\\t\\t\\tcarping at things they saw and heard. When they got out,\\n\\t\\t\\t\\tthey knew nothing of the teaching, but on the contrary\\n\\t\\t\\t\\tasked foolish and ignorant questions, such as might raise\\n\\t\\t\\t\\tdoubts."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "17",
    "NoteID": "4838",
    "Body": "Spiritual advancement is progressive: each step makes the\\n\\t\\t\\t\\tnext ones easier and more complete."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "18",
    "NoteID": "4839",
    "Body": "Cf. xliii. 66, and n. 4665."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "18",
    "NoteID": "4840",
    "Body": "The sands of time are always running, and when a wrong is\\n\\t\\t\\t\\tdone, the time for its punishment is approaching every\\n\\t\\t\\t\\tmoment. No one should therefore wait. The time for\\n\\t\\t\\t\\trepentance is Now at any given time. When the punishment\\n\\t\\t\\t\\tcomes, it is too late for repentance, and all admonition\\n\\t\\t\\t\\twould be useless. Looking to the particular time when\\n\\t\\t\\t\\tthis Sura was revealed, viz., about a year after the\\n\\t\\t\\t\\tHijrat, already there were Signs that the plans of the\\n\\t\\t\\t\\tPagans to crush Islam were crumbling to pieces. The\\n\\t\\t\\t\\tHijrat showed how much good-will there was in Madinah for\\n\\t\\t\\t\\tthe holy Prophet of Allah, and how many people from\\n\\t\\t\\t\\tMakkah adhered to him, The battle of Badr showed that\\n\\t\\t\\t\\tthey could hold their own against odds of three to one."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "19",
    "NoteID": "4841",
    "Body": "Cf. xl. 55, and n. 4428."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "19",
    "NoteID": "4842",
    "Body": "The time and manner of our conducting ourselves at home\\n\\t\\t\\t\\tand when we move about on our business are all material\\n\\t\\t\\t\\tto the judgment of our conduct, and for every nuance in\\n\\t\\t\\t\\tour moral and spiritual progress, we must seek Allah's\\n\\t\\t\\t\\thelp and guidance."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "20",
    "NoteID": "4843",
    "Body": "The men of faith and loyalty are eager and anxious to get\\n\\t\\t\\t\\ta command to serve the Cause even if it be at the\\n\\t\\t\\t\\tsacrifice of their lives. Not so the Hypocrites, \"those\\n\\t\\t\\t\\tin whose hearts is a disease\". They are mortally afraid\\n\\t\\t\\t\\tas mentioned below."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "20",
    "NoteID": "4844",
    "Body": "Cf. iii. 7, and n. 347. The defence of truth and\\n\\t\\t\\t\\trighteousness at all sacrifice, when a definite and\\n\\t\\t\\t\\tcategorical command issues from the ruler of an Islamic\\n\\t\\t\\t\\tstate is a fundamental condition of enlistment in the\\n\\t\\t\\t\\tcause of Allah. It is true that Punishment and Judgment\\n\\t\\t\\t\\tbelong to Allah alone; but our mettle and fidelity have\\n\\t\\t\\t\\tto be tested, (see verse 4 above), and Allah uses human\\n\\t\\t\\t\\tagency in human affairs."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "20",
    "NoteID": "4845",
    "Body": "Cf. ii. 10. The disease is hypocrisy, disloyalty to the\\n\\t\\t\\t\\tCause, want of courage and of the spirit of\\n\\t\\t\\t\\tself-sacrifice, want of true understanding."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "21",
    "NoteID": "4846",
    "Body": "The resolution is not taken except under guidance from\\n\\t\\t\\t\\tAllah. Those, therefore, who fail to implement it by\\n\\t\\t\\t\\ttheir own effort and sacrifice, are not true to Allah.\\n\\t\\t\\t\\tAnd such disloyalty or cowardice is not even good for\\n\\t\\t\\t\\tthem from a worldly point of view. With what face can\\n\\t\\t\\t\\tthey meet their friends after their disgraceful conduct?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "22",
    "NoteID": "4847",
    "Body": "It is no use to say, as the Quraish said, that it is not\\n\\t\\t\\t\\tseemly to fight against kith and kin. From one point of\\n\\t\\t\\t\\tview the stand against sin brings \"not peace, but a\\n\\t\\t\\t\\tsword\". It is a case of either subduing evil or being\\n\\t\\t\\t\\tsubdued by evil. If evil gets the upper hand, it is not\\n\\t\\t\\t\\tlikely to respect ties of kith and kin. It did not in the\\n\\t\\t\\t\\tcase of the holy Prophet and his adherents, and had to be\\n\\t\\t\\t\\tsuppressed, to bring about the conditions necessary for\\n\\t\\t\\t\\tpeace."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "23",
    "NoteID": "4848",
    "Body": "Cursed: i.e., deprived of His Grace: left them straying,\\n\\t\\t\\t\\tbecause they deliberately rejected His guidance. The\\n\\t\\t\\t\\tresult is that what they hear is as if they had not\\n\\t\\t\\t\\theard, and what they see is as if they had not seen. They\\n\\t\\t\\t\\thave no desire to understand Allah's Will or Allah's\\n\\t\\t\\t\\tRevelation;-or is it that they have themselves locked and\\n\\t\\t\\t\\tbolted their hearts and minds, so that nothing can\\n\\t\\t\\t\\tpenetrate them?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "25",
    "NoteID": "4849",
    "Body": "Such men are entirely in the hands of Satan. They follow\\n\\t\\t\\t\\this suggestions, and their hopes are built on his\\n\\t\\t\\t\\tdeceptions."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "26",
    "NoteID": "4850",
    "Body": "They have become so impervious to facts and truths,\\n\\t\\t\\t\\tbecause, without the courage to oppose Allah's Cause\\n\\t\\t\\t\\topenly, they secretly intrigue with Allah's enemies, and\\n\\t\\t\\t\\tsay that they will follow them part of the way, and by\\n\\t\\t\\t\\tremaining partly in the other camp, they will be far more\\n\\t\\t\\t\\tuseful as spies and half-hearted doubters than by going\\n\\t\\t\\t\\tover altogether. If they think that this game will be\\n\\t\\t\\t\\tsuccessful, they are mistaken. All the inner secrets and\\n\\t\\t\\t\\tmotives of their hearts are known to Allah. Cf. lix. 11."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "27",
    "NoteID": "4851",
    "Body": "It is all very well for them to practise hypocrisy in\\n\\t\\t\\t\\tthis life. How will they feel at death, when they find\\n\\t\\t\\t\\tthat the angels know all, and touch the very spots they\\n\\t\\t\\t\\thad taken such care to conceal?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "27",
    "NoteID": "4852",
    "Body": "Their faces and their backs: there is a subtle metaphor.\\n\\t\\t\\t\\tThe face is what looks to the front, the side you present\\n\\t\\t\\t\\tto the outer world; the back is what is not shown, what\\n\\t\\t\\t\\tis hidden from the world. The hypocrites will be hit at\\n\\t\\t\\t\\tboth points. Or, the face is what they boast of, what\\n\\t\\t\\t\\tthey are proud of; the back is the skeleton in the\\n\\t\\t\\t\\tcupboard, the things they dare not utter, but which yet\\n\\t\\t\\t\\thaunt them. The hypocrites are hit on every side. Cf.\\n\\t\\t\\t\\tviii. 50."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "29",
    "NoteID": "4853",
    "Body": "Cf. verse 20 above, and n. 4845. Being diseased at the\\n\\t\\t\\t\\tvery core of their being, they do not understand the\\n\\t\\t\\t\\tsimplest facts of spiritual life."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "30",
    "NoteID": "4854",
    "Body": "Evil is not always necessarily branded in this life with\\n\\t\\t\\t\\ta distinguishing mark or brand. But the discerning ones\\n\\t\\t\\t\\tknow. Evil is betrayed by its speech and behaviour."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "31",
    "NoteID": "4855",
    "Body": "Cf. xxxiv. 21, and n. 3821. The test and trial is for our\\n\\t\\t\\t\\town psychological development, to help in the exercise of\\n\\t\\t\\t\\tsuch choice as has been given to us in our free-will. Cf.\\n\\t\\t\\t\\talso iii. 154, and n. 467."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "31",
    "NoteID": "4856",
    "Body": "Akhbar: the things reported of you; reputation for\\n\\t\\t\\t\\tcourage and constancy, which has to be brought to the\\n\\t\\t\\t\\ttest of facts and experience. In an epigram of Tacitus we\\n\\t\\t\\t\\tare told of a Roman Emperor that he would have been\\n\\t\\t\\t\\tconsidered in every way to have been worthy of being a\\n\\t\\t\\t\\truler if only he had never ruled! So in life people may\\n\\t\\t\\t\\tthink us courageous, true, noble, and self-sacrificing;\\n\\t\\t\\t\\tand we may consider ourselves as possessing all such\\n\\t\\t\\t\\tvirtues; but it is actual experience that will bring them\\n\\t\\t\\t\\tto the test."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "32",
    "NoteID": "4857",
    "Body": "Cf. verse 25 above, and verse 34 below: in verse 25 was\\n\\t\\t\\t\\tshown the source of the evil. viz., yielding to the\\n\\t\\t\\t\\tdeceptions of Satan; in this verse are shown the\\n\\t\\t\\t\\tproximate consequences of such yielding to evil, viz.,\\n\\t\\t\\t\\tfailure of all we do; and in verse 34 below are shown the\\n\\t\\t\\t\\teternal consequences, viz., our deprivation of Allah's\\n\\t\\t\\t\\tGrace and Mercy."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "34",
    "NoteID": "4858",
    "Body": "See last note."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "35",
    "NoteID": "4859",
    "Body": "To those who are trying to root out evil, and have\\n\\t\\t\\t\\tauthority to do so, the question is not of peace or\\n\\t\\t\\t\\tconflict, but of whether Good or Evil is to prevail. They\\n\\t\\t\\t\\tmust remember that Good must ultimately prevail, and\\n\\t\\t\\t\\tAllah's help is with those who, as far as men can, are\\n\\t\\t\\t\\ttrying to further the universal Plan. Cf. n. 4847 to\\n\\t\\t\\t\\tverse 22 above."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "36",
    "NoteID": "4860",
    "Body": "Cf. vi. 32, and n. 855; and xxix. 64, and n. 3497.\\n\\t\\t\\t\\tAmusement and play are not bad things in themselves. As\\n\\t\\t\\t\\tpreparations for the more serious life, they have their\\n\\t\\t\\t\\tvalue. But if we concentrate on them, and neglect the\\n\\t\\t\\t\\tbusiness of life, we cannot prosper. So we must use our\\n\\t\\t\\t\\tlife in this world as a preparation for the next life."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "36",
    "NoteID": "4861",
    "Body": "Complete self-sacrifice, if voluntarily offered, has a\\n\\t\\t\\t\\tmeaning: it means that the person's devotion is\\n\\t\\t\\t\\texclusively and completely for the Cause. But no law or\\n\\t\\t\\t\\trule can demand it. And a mere offer to kill yourself has\\n\\t\\t\\t\\tno meaning. You should be ready to take risks to your\\n\\t\\t\\t\\tlife in fighting for the Cause, but you should aim at\\n\\t\\t\\t\\tlife, not death. If you live, you should be ready to\\n\\t\\t\\t\\tplace your substance and your acquisitions at the\\n\\t\\t\\t\\tdisposal of the Cause. But it is not reasonable to\\n\\t\\t\\t\\tpauperise yourself and become a hanger-on for the Cause.\\n\\t\\t\\t\\tMoreover, the inborn tendency to self-preservation in an\\n\\t\\t\\t\\taverage man would lead to concealment and niggardliness\\n\\t\\t\\t\\tif all were asked for the Cause, by Law, and there would\\n\\t\\t\\t\\tfurther be a feeling of bitterness and rebellion."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "37",
    "NoteID": "4862",
    "Body": "Cf. iii. 180."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "37",
    "NoteID": "4863",
    "Body": "Cf. above, verse 29. Rancour or ill-feeling, or any\\n\\t\\t\\t\\tdesire but that of devotion, should never be given a\\n\\t\\t\\t\\thandle in a wise Law."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "38",
    "NoteID": "4864",
    "Body": "Here the case of the special devotee and of the average\\n\\t\\t\\t\\tman with his human foibles are distinguished. Stinginess\\n\\t\\t\\t\\tis not a virtue: it hurts more the finer-nature of the\\n\\t\\t\\t\\tindividual practising it that it hurts the Cause. Allah\\n\\t\\t\\t\\tis free of all wants and independent of any need that we\\n\\t\\t\\t\\tcan meet. His Cause is similarly independent of human\\n\\t\\t\\t\\taid. But it uses human agency for our own human\\n\\t\\t\\t\\tadvancement. The need to be able to serve Allah's cause\\n\\t\\t\\t\\tis ours. We are the needy beggars who should claim the\\n\\t\\t\\t\\tprivilege before the Lord of Bounties unbounded."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "38",
    "NoteID": "4865",
    "Body": "If we desert the Cause, the Cause will not fail. Better\\n\\t\\t\\t\\tmen than we will uphold the flag. But we should fall, and\\n\\t\\t\\t\\tothers will take our place, who are not so timid, half-\\n\\t\\t\\t\\thearted, or stingy. In Wordsworth's words, \"High Heaven\\n\\t\\t\\t\\trejects the lore of nicely calculated less or more.\""
  }
]
