[
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "3",
    "NoteID": "29061",
    "Text": "  &nbsp;To make a decision in pre-Islamic Arabia, a person would draw one of three straws: one saying &ldquo;Do it,&rdquo; the other &ldquo;Do not do it,&rdquo; and the third was left blank, whereas in Islam there is a special prayer (called istikh&acirc;rah) for guidance when making a decision.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "5",
    "NoteID": "29062",
    "Text": "  &nbsp;&ldquo;The food of the People of the Book&rdquo; here means the meat of the animals slaughtered by the Jews and Christians.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "6",
    "NoteID": "29063",
    "Text": "  &nbsp;For example, following sexual intercourse or a wet dream.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "6",
    "NoteID": "29064",
    "Text": "  &nbsp;This ruling is called tayammum&nbsp;or &lsquo;dry ablution.&rsquo; See&nbsp;footnote for 4:43.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "20",
    "NoteID": "29065",
    "Text": "  &nbsp;He rescued you from Egypt where the Pharaoh treated you like slaves and blessed you with freedom so you can manage your own affairs.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "20",
    "NoteID": "29066",
    "Text": "  &nbsp;i.e., the miracles of splitting the sea, water coming out of the rock, manna and quails, and clouds shading them.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "31",
    "NoteID": "29067",
    "Text": "  &nbsp;In Islam, regret for doing something wrong is essential for repentance. But in the case of Cain, his regret was not for killing his brother, but for failing to bury his corpse to hide the evidence of his crime. Therefore, his regret was not intended as a step towards repentance.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "32",
    "NoteID": "29068",
    "Text": "  &nbsp;Although this is addressed to the Children of Israel, it is applicable to everyone at all times.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "33",
    "NoteID": "29069",
    "Text": "   &nbsp;This ruling (called &#7717;ir&acirc;bah) applies to crimes committed by armed individuals or groups against civilians&mdash;Muslim or non-Muslim. Different punishments apply depending on the severity of the crime:     In the case of murder or rape, offenders are to be executed.   In the case of armed robbery, offenders&rsquo; right hands and left feet are to be cut off.   In the case of terrorizing innocent people, offenders are to be jailed in exile.   Penalties for lesser offences are left for the judge to decide.      "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "38",
    "NoteID": "29070",
    "Text": "  &nbsp;In Islam, strict conditions must be met for punishments to be carried out. For example, for someone to be punished for theft, the thief must be a sane adult who knows that theft is forbidden, the crime has to be proven either by confession or the testimony of two reliable eyewitnesses, the stolen item has to be of value and taken secretly from a safe place, and the owner has to claim it. Otherwise, the punishment is not applied. Islamic punishments apply neither in non-Muslim countries nor in Muslim countries where Shar&icirc;&rsquo;ah&nbsp;is not fully applied. Moreover, the punishment is only applicable in a society where the needs of the poor are adequately met (i.e., they receive alms-tax, charity, or welfare) and where theft is more out of desire than necessity. It is worth mentioning that &rsquo;Umar ibn Al-Kha&#7789;&#7789;&acirc;b, Islam&rsquo;s 2 nd &nbsp;Caliph, suspended this punishment for one year due to widespread famine.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "42",
    "NoteID": "29071",
    "Text": "  &nbsp;i.e., bribes and interest.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "51",
    "NoteID": "29072",
    "Text": "  &nbsp;Wali&nbsp;means guardian, caretaker, protector, provider, ally, etc. The Prophet (&#65018;) for example says, &ldquo;A woman should not get married without a wali.&rdquo;&mdash;that is a guardian such as her father to represent her in the marriage and make sure she receives her full rights. The verse forbids Muslims from allying with the Jews and Christians (or anyone else) conspiring to persecute Muslims. On the other hand, as long as non-Muslims are not at war with Muslims or persecuting them, the Quran (60:8) commands Muslims to be kind and gracious to them.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "60",
    "NoteID": "29073",
    "Text": "  &nbsp;Literally or metaphorically. See&nbsp;footnote for 2:65.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "64",
    "NoteID": "29074",
    "Text": "  &nbsp;lit., Allah&rsquo;s Hand is tied up &#761;with greed&#762;.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "69",
    "NoteID": "29075",
    "Text": "  &nbsp;See&nbsp;footnote for 2:62.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "75",
    "NoteID": "29076",
    "Text": "  &nbsp;i.e., they were in need of food for nourishment. According to some scholars, this implies that Jesus and his mother had to relieve themselves after the food had been digested. Almighty Allah is far above depending on food or having to go to the restroom.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "80",
    "NoteID": "29077",
    "Text": "  &nbsp;i.e., the pagans.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "90",
    "NoteID": "29078",
    "Text": "  &nbsp;See&nbsp;footnote for 5:3.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "101",
    "NoteID": "29079",
    "Text": "  &nbsp;This implies that either these minor details have been overlooked by Allah out of His mercy or that Allah has forgiven them for these unnecessary questions.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "103",
    "NoteID": "29080",
    "Text": "  &nbsp;These camels were allowed by pagan Arabs to pasture freely and were not to be used for labour or transportation after fathering or giving birth to a certain number of male or female camels.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "103",
    "NoteID": "29081",
    "Text": "  &nbsp;i.e., the pagans.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "105",
    "NoteID": "29082",
    "Text": "  &nbsp;After fulfilling their obligation of delivering the truth, enjoining what is good, and forbidding what is evil.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "106",
    "NoteID": "29083",
    "Text": "  &nbsp;If no Muslim witnesses can be found.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "110",
    "NoteID": "29084",
    "Text": "  &nbsp;i.e., the angel Gabriel.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "111",
    "NoteID": "29085",
    "Text": "  &nbsp;lit., Muslims.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "117",
    "NoteID": "29086",
    "Text": "  &nbsp;This refers to the ascension of Jesus Christ. See footnote for 3:54.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "5",
    "AyahNumber": "118",
    "NoteID": "29087",
    "Text": "  &nbsp;i.e., as your creation, they cannot escape the punishment.   "
  }
]
