[
  {
    "SurahNumber": "53",
    "AyahNumber": "1",
    "NoteID": "5085",
    "Body": "An-Najm is interpreted in various ways. As most commonly\\n\\t\\t\\t\\taccepted, it means either a Star generically, or the\\n\\t\\t\\t\\tclose cluster of seven stars known as the Pleiades in the\\n\\t\\t\\t\\tConstellation Taurus, which the sun enters about the 21st\\n\\t\\t\\t\\tof April every year. In mid-April, or a little later, the\\n\\t\\t\\t\\tbeautiful cluster would set just after the sun, after\\n\\t\\t\\t\\thaving gradually ascended the sky in the winter months.\\n\\t\\t\\t\\tIn late May, or a little later, it would rise just before\\n\\t\\t\\t\\tthe sun. In its western aspects, it might be considered a\\n\\t\\t\\t\\tspring constellation. To open-air nations (including the\\n\\t\\t\\t\\tArabs) whose climate usually presents starry skies, this\\n\\t\\t\\t\\tis an object of great interest, and many folklore tales\\n\\t\\t\\t\\tgather round it. When so glorious a cluster is content to\\n\\t\\t\\t\\tbow down in the horizon and merge its light in the\\n\\t\\t\\t\\tgreater light created by Allah, it becomes a symbol of\\n\\t\\t\\t\\thumility in beauty and power before the Most High. Whose\\n\\t\\t\\t\\trevelation discloses the summit of beauty, power, and\\n\\t\\t\\t\\twisdom. Hawa in the text may mean either \"goes down (or\\n\\t\\t\\t\\tsets)\" or \"rises\". Whichever meaning we take, it makes no\\n\\t\\t\\t\\tdifference to the interpretation given above."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "2",
    "NoteID": "5086",
    "Body": "\"Your Companion\" is the holy Prophet Muhammad, who had\\n\\t\\t\\t\\tlived among the Quraish. He is defended from three kinds\\n\\t\\t\\t\\tof charges that the Unbelievers brought against him: (1)\\n\\t\\t\\t\\tthat he was going astray, either through defect of\\n\\t\\t\\t\\tintelligence or through carelessness; (2) that he was\\n\\t\\t\\t\\tbeing misled or deceived by evil spirits; and (3) that he\\n\\t\\t\\t\\tspoke out of a whim or impulse, or from a selfish desire\\n\\t\\t\\t\\tto impress his own personality. None of these charges\\n\\t\\t\\t\\twere true. On the contrary he had direct inspiration from\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "5",
    "NoteID": "5087",
    "Body": "This is referred by the Commentators to the angel\\n\\t\\t\\t\\tGabriel, through whom the inspiration came. Cf. lxxxi,\\n\\t\\t\\t\\t20."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "7",
    "NoteID": "5088",
    "Body": "Gabriel appeared in stately form. Istawa in verse 61\\n\\t\\t\\t\\ttranslated \"appeared\", means literally \"mounted\" or\\n\\t\\t\\t\\t\"ascended\", or \"set himself to execute a design\"; see n.\\n\\t\\t\\t\\t1386 to x. 3."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "9",
    "NoteID": "5089",
    "Body": "Two bow-shots (counting 100 to 150 yards to a bow-shot)\\n\\t\\t\\t\\twould be a clearly visible distance."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "10",
    "NoteID": "5090",
    "Body": "Gabriel would be just a messenger, to do no more than\\n\\t\\t\\t\\tconvey Allah's Message to Allah's Messenger."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "11",
    "NoteID": "5091",
    "Body": "\"Heart\" in Arabic includes the faculty of intelligence as\\n\\t\\t\\t\\twell as the faculty of feeling. The impression conveyed\\n\\t\\t\\t\\twas pure truth; there was no illusion in it."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "13",
    "NoteID": "5092",
    "Body": "The first occasion when Gabriel appeared in a visible\\n\\t\\t\\t\\tform was at the Mountain of Light, when he brought his\\n\\t\\t\\t\\tfirst revelation beginning with Iqraa:. The second was at\\n\\t\\t\\t\\tthe Prophet's Miraj or Ascension: see Introduction to S.\\n\\t\\t\\t\\txvii."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "14",
    "NoteID": "5093",
    "Body": "For the Lote-tree in its literal meaning, see n. 3814 to\\n\\t\\t\\t\\txxxiv. 16. The wild Lote is thorny; under cultivation it\\n\\t\\t\\t\\tyields good fruit and shade, and is symbolic of heavenly\\n\\t\\t\\t\\tbliss, as here and in lvi. 28."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "15",
    "NoteID": "5094",
    "Body": "The \"Garden of Abode\" (Jannat al-Mawa) lies close to the\\n\\t\\t\\t\\tLote-Tree and, in the opinion of some authorities, is so\\n\\t\\t\\t\\tcalled because the souls of believers will find their\\n\\t\\t\\t\\tabode therein."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "19",
    "NoteID": "5095",
    "Body": "From the heights of divine Glory, we come back again to\\n\\t\\t\\t\\tthis sorry earth, with its base idolatries. We are asked\\n\\t\\t\\t\\tto \"look at this picture, and at that!\" The three\\n\\t\\t\\t\\tprincipal idols of Pagan Arab Idolatry were the goddesses\\n\\t\\t\\t\\tLat, Uzza, and Manat. Opinions differ as to their exact\\n\\t\\t\\t\\tforms: one version is that Lat was in human shape, Uzza\\n\\t\\t\\t\\thad its origin in a sacred tree, and Manat in a white\\n\\t\\t\\t\\tstone."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "21",
    "NoteID": "5096",
    "Body": "To show Allah in human shape, or imagine sons or\\n\\t\\t\\t\\tdaughters of Allah, as if Allah were flesh, was in any\\n\\t\\t\\t\\tcase a derogation from the supreme glory of Allah, high\\n\\t\\t\\t\\tabove all creatures, even if the human shapes were\\n\\t\\t\\t\\tinvested with great beauty and majesty as in the Greek\\n\\t\\t\\t\\tPantheon. But when we consider in what low opinion Pagan\\n\\t\\t\\t\\tArabia held the female sex, it was particularly degrading\\n\\t\\t\\t\\tto show Allah, or so-called daughters of Allah, in female\\n\\t\\t\\t\\tshapes. Cf. xvi. 57-59, and n. 2082; also lii. 39, and n.\\n\\t\\t\\t\\t5073."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "23",
    "NoteID": "5097",
    "Body": "Cf. vii. 71; xii. 40, n. 1693. The divine names which\\n\\t\\t\\t\\tthey give to stocks and stones, or to heroes living or\\n\\t\\t\\t\\tdead, or even to prophets and men of God, are but the\\n\\t\\t\\t\\tcreations of their own fancy. Whatever they were, they\\n\\t\\t\\t\\twere not gods."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "23",
    "NoteID": "5098",
    "Body": "Cf. vi. 116. Conjecture is a dangerous thing in speaking\\n\\t\\t\\t\\tof divine things. It follows lines which reflect the\\n\\t\\t\\t\\tlusts of men's own hearts. Why not follow the divine\\n\\t\\t\\t\\tguidance which comes through the prophets of Allah?"
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "24",
    "NoteID": "5099",
    "Body": "The unpurified desires of men's hearts often lead to\\n\\t\\t\\t\\tdestruction, for they are dictated by Evil. The true\\n\\t\\t\\t\\tsource of guidance and light is Allah, just as He is also\\n\\t\\t\\t\\tthe goal to which all persons and things-all\\n\\t\\t\\t\\texistence-retums."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "26",
    "NoteID": "5100",
    "Body": "We are apt to imagine the angelic host of heaven as\\n\\t\\t\\t\\tbeings of immense power. But their power is all derived\\n\\t\\t\\t\\tfrom Allah. Men, when they attain to the highest\\n\\t\\t\\t\\tspiritual dignities, may have even more power and\\n\\t\\t\\t\\tposition than angels in the sight of Allah, as in\\n\\t\\t\\t\\ttypified by angels being hidden to bow down to Adam: ii.\\n\\t\\t\\t\\t34. The Quraish superstition about angels being\\n\\t\\t\\t\\tintermediaries and intercessors for man with Allah is\\n\\t\\t\\t\\tcondemned."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "26",
    "NoteID": "5101",
    "Body": "Cf. xx. 109 and xxi. 28. No one can intercede except with\\n\\t\\t\\t\\tthe permission of Allah, and that permission will only be\\n\\t\\t\\t\\tgiven for one who is acceptable to Allah. For a possible\\n\\t\\t\\t\\tdifferent shade of meaning. See n. 2643 to xx. 109."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "27",
    "NoteID": "5102",
    "Body": "Cf. liii. 21, above, and n. 5096. The Pagan Quraish had\\n\\t\\t\\t\\tno firm belief in the Hereafter. Their prayers for\\n\\t\\t\\t\\tintercession to angels and deities was on account of\\n\\t\\t\\t\\ttheir worldly affairs."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "28",
    "NoteID": "5103",
    "Body": "Cf. liii. 23 above, and n. 5098."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "30",
    "NoteID": "5104",
    "Body": "Men with a materialist tum of mind, whose desires are\\n\\t\\t\\t\\tbounded by sex and material things, will not go beyond\\n\\t\\t\\t\\tthose things. Their knowledge will be limited to the\\n\\t\\t\\t\\tnarrow circle in which their thoughts move. The spiritual\\n\\t\\t\\t\\tworld is beyond their ken. While persons with a spiritual\\n\\t\\t\\t\\toutlook, even though they may fail again and again in\\n\\t\\t\\t\\tattaining their full ideals, are on the right Path. They\\n\\t\\t\\t\\tare willing to receive guidance and Allah's Grace will\\n\\t\\t\\t\\tfind them out and help them."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "31",
    "NoteID": "5105",
    "Body": "All deeds have their consequences, good or ill. But this\\n\\t\\t\\t\\tis not an iron law, as the Determinists in philosophy, or\\n\\t\\t\\t\\tthe preachers of bare Karma, would have us believe. Allah\\n\\t\\t\\t\\tdoes not sit apart. He governs the world. And Mercy as\\n\\t\\t\\t\\twell as Justice are His attributes. In His Justice every\\n\\t\\t\\t\\tdeed or word or thought of evil has its consequence for\\n\\t\\t\\t\\tthe doer or speaker or thinker. But there is always in\\n\\t\\t\\t\\tthis life room for repentance and amendment. As soon as\\n\\t\\t\\t\\tthis is forthcoming, Allah's Mercy comes into action. It\\n\\t\\t\\t\\tcan blot out our evil, and the \"reward\" which it gives is\\n\\t\\t\\t\\tnearly always greater than our merits."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "32",
    "NoteID": "5106",
    "Body": "Allah's attributes of Mercy and Forgiveness are\\n\\t\\t\\t\\tunlimited. They come into action without our asking, but\\n\\t\\t\\t\\ton our bringing our wills as offerings to Him. Our asking\\n\\t\\t\\t\\tor prayer helps us to bring our minds and wills as\\n\\t\\t\\t\\toffering to Him. That is necessary to frame our own\\n\\t\\t\\t\\tpsychological preparedness. it informs Allah of nothing,\\n\\t\\t\\t\\tfor He knows all."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "32",
    "NoteID": "5107",
    "Body": "As Allah knows our inmost being, it is absurd for us to\\n\\t\\t\\t\\tjustify ourselves either by pretending that we are better\\n\\t\\t\\t\\tthan we are or by finding excuses for our conduct. We\\n\\t\\t\\t\\tmust offer ourselves unreservedly such as we are: it is\\n\\t\\t\\t\\tHis Mercy and Grace that will cleanse us. If we try, out\\n\\t\\t\\t\\tof love for Him, to guard against evil, our striving is\\n\\t\\t\\t\\tall that He asks for."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "33",
    "NoteID": "5108",
    "Body": "The particular reference in this passage, according to\\n\\t\\t\\t\\tBaidhawi is to Walid ibn Mugaira, who bargained with a\\n\\t\\t\\t\\tQuraish Pagan for a certain sum if the latter would take\\n\\t\\t\\t\\tupon himself the sins of Walid. He paid a part of the sum\\n\\t\\t\\t\\tbut withheld the rest. The general application that\\n\\t\\t\\t\\tconcerns us is threefold: (1) if we accept Islam, we must\\n\\t\\t\\t\\taccept it whole-heartedly and not look back to Pagan\\n\\t\\t\\t\\tsuperstitions; (2) we cannot play fast and loose with our\\n\\t\\t\\t\\tpromises and (3) no man can bargain about spiritual\\n\\t\\t\\t\\tmatters for he cannot see what his end will be unless he\\n\\t\\t\\t\\tfollows the law of Allah, which is the law of\\n\\t\\t\\t\\trighteousness."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "35",
    "NoteID": "5109",
    "Body": "'So that he can see what will happen in the Hereafter':\\n\\t\\t\\t\\tfor no bargains can be struck about matters unknown."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "36",
    "NoteID": "5110",
    "Body": "Books of Moses: apparently not the Pentateuch, in the\\n\\t\\t\\t\\tTaurat, but some other book or books now lost. For\\n\\t\\t\\t\\texample, the Book of the Wars of Jehovah is referred to\\n\\t\\t\\t\\tin the Old Testament (Num. xxi. 14) but is now lost. The\\n\\t\\t\\t\\tpresent Pentateuch has no clear message at all of a Life\\n\\t\\t\\t\\tto come."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "37",
    "NoteID": "5111",
    "Body": "No original Book of Abraham is now extant. But a book\\n\\t\\t\\t\\tcalled \"The Testament of Abraham\" has come down to us,\\n\\t\\t\\t\\twhich seems to be a Greek translation of a Hebrew\\n\\t\\t\\t\\toriginal. See n. 6094 to lxxxvii. 19, where the Books of\\n\\t\\t\\t\\tMoses and Abraham are again mentioned together."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "37",
    "NoteID": "5112",
    "Body": "One of the titles of Abraham is Hanif, the True in Faith\\n\\t\\t\\t\\tCf. xvi. 120, 123."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "38",
    "NoteID": "5113",
    "Body": "Here follows a series of eleven aphorisms. The first is\\n\\t\\t\\t\\tthat a man's spiritual burden-the responsibility for his\\n\\t\\t\\t\\tsin must be borne by himself and not by another: Cf. vi.\\n\\t\\t\\t\\t164. There can be no vicarious atonement."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "40",
    "NoteID": "5114",
    "Body": "The second and third aphorisms are that man must strive,\\n\\t\\t\\t\\tor he will gain nothing; and that if he strives, the\\n\\t\\t\\t\\tresult must soon appear in sight and he will find his\\n\\t\\t\\t\\treward in full measure."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "42",
    "NoteID": "5115",
    "Body": "The fourth, fifth, and sixth aphorisms are that all\\n\\t\\t\\t\\tthings return to Allah; that all our hope should be in\\n\\t\\t\\t\\tHim; and we should fear none but Him: and that He alone\\n\\t\\t\\t\\tcan give Life and Death."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "45",
    "NoteID": "5116",
    "Body": "The seventh aphorism relates to sex: all things are\\n\\t\\t\\t\\tcreated in pairs: each sex performs its proper function,\\n\\t\\t\\t\\tand yet its wonderful working is part of the creative\\n\\t\\t\\t\\tprocess of Allah: the living seed fructifies, but\\n\\t\\t\\t\\tcontains within itself all the factors disclosed in its\\n\\t\\t\\t\\tlater development and life."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "47",
    "NoteID": "5117",
    "Body": "No less wonderful is the promise He has made about the\\n\\t\\t\\t\\traising of the dead, and a new fife in the Hereafter, and\\n\\t\\t\\t\\tthis is the subject of the eighth aphorism."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "48",
    "NoteID": "5118",
    "Body": "Wealth and material gain are sought by most men, in the\\n\\t\\t\\t\\thope that they will be a source of enjoyment and\\n\\t\\t\\t\\tsatisfaction. But this hope is not always fulfilled.\\n\\t\\t\\t\\tThere is a physical and spiritual side to it. But both\\n\\t\\t\\t\\tthe material and the spiritual side depend upon the\\n\\t\\t\\t\\tworking of Allah's Plan. This is referred to in the ninth\\n\\t\\t\\t\\taphorism."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "49",
    "NoteID": "5119",
    "Body": "The tenth aphorism refers to a mighty phenomenon of\\n\\t\\t\\t\\tnature, the magnificent star Sirius, which is such a\\n\\t\\t\\t\\tprominent object in the skies, in the early part of the\\n\\t\\t\\t\\tsolar year, say, from January to April. It is the\\n\\t\\t\\t\\tbrightest star in the firmament, and its bluish light\\n\\t\\t\\t\\tcauses wonder and terror in Pagan minds. The Pagan Arabs\\n\\t\\t\\t\\tworshipped it as a divinity. But Allah is the Lord,\\n\\t\\t\\t\\tCreator and Cherisher, of the most maginificent part of\\n\\t\\t\\t\\tCreation, and worship is due to Him alone."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "50",
    "NoteID": "5120",
    "Body": "The eleventh and last aphorism refers to the punishment\\n\\t\\t\\t\\tof the most powerful ancient peoples for their sins. For\\n\\t\\t\\t\\tthe 'Ad people, see n. 1040 to vii. 65, and for the\\n\\t\\t\\t\\tThamud, see n. 1043 to vii. 73. They were strong; and\\n\\t\\t\\t\\tthey were talented: but their strength and their talents\\n\\t\\t\\t\\tdid not save them from being destroyed for their sins.\\n\\t\\t\\t\\tThe same may be said about the earlier generation of\\n\\t\\t\\t\\tNoah, who were destroyed in the Flood: they \"rejected Our\\n\\t\\t\\t\\tSigns: they were indeed a blind people\" (vii, 64); see\\n\\t\\t\\t\\talso n. 1039 to vii. 59; and xi. 25-49. Ancient 'Ad\\n\\t\\t\\t\\t(people): some Commentators construe, \"First 'Ad people\",\\n\\t\\t\\t\\tdistinguishing them from the later 'Ad people, a remnant\\n\\t\\t\\t\\tthat had their day and passed away."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "53",
    "NoteID": "5121",
    "Body": "Verses 53-60 may be construed as a commentary on the\\n\\t\\t\\t\\taphorisms. The story of the Overthrown Cities, to which\\n\\t\\t\\t\\tLot was sent for a warning, will be found in xi. 74-83\\n\\t\\t\\t\\tand the notes thereon. This story may well be treated as\\n\\t\\t\\t\\tseparate from the aphorisms as it refers to events that\\n\\t\\t\\t\\thappened in the later life of Abraham."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "55",
    "NoteID": "5122",
    "Body": "With a slight modification this forms the refrain of the\\n\\t\\t\\t\\tnext Sura but one, the highly artistic Sura of Rahman. In\\n\\t\\t\\t\\tS. liv. 15, 17 etc., there is a similar refrain in\\n\\t\\t\\t\\tdifferent words. Every gift and benefit you have is from\\n\\t\\t\\t\\tAllah, and to save you from the just punishment of your\\n\\t\\t\\t\\tsins, Allah at all times sends revelations and Messengers\\n\\t\\t\\t\\tto warn you. Why not accept Allah's Grace instead of\\n\\t\\t\\t\\tdisputing about it?"
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "56",
    "NoteID": "5123",
    "Body": "The Prophet before the Quraish (and before us) continues\\n\\t\\t\\t\\tthe line of messengers of Allah who have come to teach\\n\\t\\t\\t\\tmankind and lead men into unity and righteousness. Shall\\n\\t\\t\\t\\twe not listen to his voice? Every day that passes, the\\n\\t\\t\\t\\tJudgment approaches nearer and nearer. But Allah alone\\n\\t\\t\\t\\tcan say at what precise hour it will come to any of us.\\n\\t\\t\\t\\tIt is certain, and yet it is a mystery, which Allah alone\\n\\t\\t\\t\\tcan lay bare."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "59",
    "NoteID": "5124",
    "Body": "Mere wondering will not do, even if it is the wonder of\\n\\t\\t\\t\\tadmiration. Each soul must strive and act, and Allah's\\n\\t\\t\\t\\tMercy will take it under its wings."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "60",
    "NoteID": "5125",
    "Body": "The higher issues of Life and the Hereafter are serious,\\n\\t\\t\\t\\tand therefore all that we do in this life is serious and\\n\\t\\t\\t\\timportant. We must shun inanities and frivolities. It is\\n\\t\\t\\t\\tno laughing time. If we only realised our own\\n\\t\\t\\t\\tshortcomings, we should weep. But weeping by itself will\\n\\t\\t\\t\\tnot help. We must try and understand Allah and adore Him.\\n\\t\\t\\t\\tThus shall we be able to understand ourselves and our\\n\\t\\t\\t\\tfellow-men."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "62",
    "NoteID": "5126",
    "Body": "And so we are invited to prostrate ourselves and adore\\n\\t\\t\\t\\tHim. For this is the true end of Revelation and the true\\n\\t\\t\\t\\tattitude when we understand the world, Nature, History\\n\\t\\t\\t\\tand the working of Allah's Plan."
  }
]
