[
  {
    "SurahNumber": "99",
    "AyahNumber": "1",
    "NoteID": "6235",
    "Body": "To the ordinary human observer a violent earthquake is a\\n\\t\\t\\t\\tterrifying phenomenon, in its suddenness, in its origin,\\n\\t\\t\\t\\tand in its power to destroy and uproot the strongest\\n\\t\\t\\t\\tbuildings and to bring up strange materials from the\\n\\t\\t\\t\\tbowels of the earth. The Overwhelming Event (S.\\n\\t\\t\\t\\tlxxxviii.) which ushers in the Judgment will be a bigger\\n\\t\\t\\t\\tand more far-reaching convulsion than any earthquakes\\n\\t\\t\\t\\tthat we know. And yet the incidents of earthquakes may\\n\\t\\t\\t\\tgive us some idea of that supreme world-shaking Event."
  },
  {
    "SurahNumber": "99",
    "AyahNumber": "2",
    "NoteID": "6236",
    "Body": "An earthquake, if accompanied by a volcanic eruption,\\n\\t\\t\\t\\tthrows up enormous boulders and lava from beneath the\\n\\t\\t\\t\\tcrust of the earth. They are thrown up as if they were a\\n\\t\\t\\t\\tburden to the Earth personified. They may be all kinds of\\n\\t\\t\\t\\tminerals, or treasures buried for secrecy. So in the\\n\\t\\t\\t\\tgreat and final Convulsion, the dead who had been buried\\n\\t\\t\\t\\tand forgotten will rise; and will be brought to the light\\n\\t\\t\\t\\tof day, and justice will be done in the full glare of\\n\\t\\t\\t\\tabsolute Truth."
  },
  {
    "SurahNumber": "99",
    "AyahNumber": "3",
    "NoteID": "6237",
    "Body": "The puzzled agony suffered by the victims of violent\\n\\t\\t\\t\\tearthquakes is as nothing compared to the experience of\\n\\t\\t\\t\\tthe new and wonderful world which will then open out of\\n\\t\\t\\t\\tthe gaze of man."
  },
  {
    "SurahNumber": "99",
    "AyahNumber": "5",
    "NoteID": "6238",
    "Body": "The present order may be personified as the earth. It\\n\\t\\t\\t\\twill pass away, but the Deeds done therein, even the most\\n\\t\\t\\t\\tsecret, will be brought to the full light of day. And\\n\\t\\t\\t\\tthis will be because Allah will give the Command, the\\n\\t\\t\\t\\tinspiration or Word, by which alone all events do\\n\\t\\t\\t\\tproceed. The \"inspiration\" is the Command or direction\\n\\t\\t\\t\\tconveyed by instruction breathed into the Earth\\n\\t\\t\\t\\tpersonified: she is directed to tell the whole story of\\n\\t\\t\\t\\twhat she knows. Cf. xvi. 68, n. 2097."
  },
  {
    "SurahNumber": "99",
    "AyahNumber": "6",
    "NoteID": "6239",
    "Body": "In this world good and evil are mixed together. But then\\n\\t\\t\\t\\tthey will be sorted out, and each grade of good and evil\\n\\t\\t\\t\\twill be sorted out. So they will proceed in companies to\\n\\t\\t\\t\\treceive judgment. And they will be shown the exact import\\n\\t\\t\\t\\tof everything that they had thought, said, or done, in\\n\\t\\t\\t\\tthis life of probation, however they may have concealed\\n\\t\\t\\t\\tor misinterpreted it in this life. Everything will be\\n\\t\\t\\t\\tconsidered in taking the account, and the account will\\n\\t\\t\\t\\tconvince the persons concerned themselves."
  },
  {
    "SurahNumber": "99",
    "AyahNumber": "7",
    "NoteID": "6240",
    "Body": "Zarrat: the weight of an atom, the smallest living weight\\n\\t\\t\\t\\tan ordinary man can think of. Figuratively the subtlest\\n\\t\\t\\t\\tform of good and evil will then be brought to account,\\n\\t\\t\\t\\tand it will be done openly and convincingly: he \"shall\\n\\t\\t\\t\\tsee it\"."
  }
]
