[
  {
    "SurahNumber": "23",
    "AyahNumber": "1",
    "Text": "Indeed successful are those believers"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "2",
    "Text": "who are humble in their Salah (prayers),"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "3",
    "Text": "who avoid vain talk,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "4",
    "Text": "who are punctual in the payment of Zakah (charity),"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "5",
    "Text": "who guard their private parts"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "6",
    "Text": "except with their spouses or those who are legally in their\\n\\t\\t\\tpossession, for in that case they shall not be blamed"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "7",
    "Text": "- however those who seek to go beyond that in lust are the ones\\n\\t\\t\\twho shall be the transgressors"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "8",
    "Text": "- who are true to their trust and covenants,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "9",
    "Text": "and who are diligent about their Salah (prayers)."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "10",
    "Text": "These are the heirs"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "11",
    "Text": "who will inherit paradise; and live therein forever."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "12",
    "Text": "Indeed We have created man from an essence of clay,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "13",
    "Text": "then placed him as a drop of semen in a firm resting place,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "14",
    "Text": "then changed the semen into a leechlike mass, then leechlike mass\\n\\t\\t\\tinto a fetus lump, then fetus lump into bones, then clothed the\\n\\t\\t\\tbones with flesh, and then We brought him forth as quite a\\n\\t\\t\\tdifferent creature from the embryo - so blessed is Allah, the\\n\\t\\t\\tbest of all creators."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "15",
    "Text": "Then after living for a while you shall all die,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "16",
    "Text": "then most surely you shall be raised to life again on the Day of\\n\\t\\t\\tResurrection."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "17",
    "Text": "We have made seven avenues (heavens) above you; and We are never\\n\\t\\t\\tunmindful of Our creation."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "18",
    "Text": "We send down water from the sky according to a due measure, then\\n\\t\\t\\tWe cause it to settle in the soil - you should know that if We\\n\\t\\t\\tplease, We can certainly take it away"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "19",
    "Text": "- then with it We cause to grow gardens of palm trees and grapes\\n\\t\\t\\tfor you; yielding abundant fruit for you to eat,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "20",
    "Text": "and also a tree which grows on Mount Sinai which produces oil and\\n\\t\\t\\trelish as a food for those who like to eat it."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "21",
    "Text": "In cattle, too, there is a lesson for you: from within their\\n\\t\\t\\tbodies We produce milk for you to drink, besides this you gain\\n\\t\\t\\tnumerous other benefits; some of them you eat,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "22",
    "Text": "yet on others as well as on ships you ride."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "23",
    "Text": "We sent Nuh (Noah) to his people. He said, \"O my people! Worship\\n\\t\\t\\tAllah, you have no other god but Him, are you not afraid of Him\\n\\t\\t\\tfor committing shirk?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "24",
    "Text": "The chiefs of the unbelievers among his people said, \"Nuh is but\\n\\t\\t\\ta human like you, he desires to assert his superiority over you.\\n\\t\\t\\tIf Allah wanted to send Rasools, He could have sent down angels,\\n\\t\\t\\twe have never heard such a thing as he says from our\\n\\t\\t\\tforefathers.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "25",
    "Text": "Some of them said: \"He is just a madman, so bear with him for a\\n\\t\\t\\twhile.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "26",
    "Text": "Nuh said, \"O my Rabb! Help me against their calling me a liar.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "27",
    "Text": "So We revealed Our will to him, saying: \"Build an ark under our\\n\\t\\t\\tsupervision according to Our instructions; and when Our judgement\\n\\t\\t\\tcomes to pass and water wells out from 'At-Tannur', take aboard a\\n\\t\\t\\tpair (a male and a female) from every species and take your\\n\\t\\t\\tfamily, except those of them against whom the judgement has\\n\\t\\t\\talready been passed; and do not plead with Me in favor of the\\n\\t\\t\\twrongdoers, for they are doomed to be drowned in the flood."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "28",
    "Text": "Then when you have embarked on the ark with your companions, say:\\n\\t\\t\\t\"Praise be to Allah Who has delivered us from the nation of\\n\\t\\t\\twrongdoers,\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "29",
    "Text": "and pray, \"O my Rabb! Bless my landing from this Ark, for You are\\n\\t\\t\\tthe best to make my landing safe.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "30",
    "Text": "There are many lessons in this story, and surely We do test\\n\\t\\t\\tpeople."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "31",
    "Text": "Then We raised after them a new generation (the people of 'Ad),"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "32",
    "Text": "and sent to them a Rasool (Hud) from among themselves, who said\\n\\t\\t\\tto them: \"Worship Allah! You have no other god except Him. Will\\n\\t\\t\\tyou not fear Him for committing shirk?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "33",
    "Text": "But the chiefs of his people - who disbelieved the message and\\n\\t\\t\\tdenied the life in the hereafter, - on whom We had bestowed\\n\\t\\t\\taffluence in this worldly life, said: \"This person is but a human\\n\\t\\t\\tlike you; he eats of what you eat and drinks of what you drink."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "34",
    "Text": "If you obey a human like yourselves, you shall indeed be lost."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "35",
    "Text": "What! Does he claim that when you are dead and turned into dust\\n\\t\\t\\tand bones, you will be brought to life out of your graves?"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "36",
    "Text": "Impossible! Just impossible is that with which you are being\\n\\t\\t\\tthreatened with!"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "37",
    "Text": "There is no other life but our life of this world: we live here\\n\\t\\t\\tand die here, and shall never be raised to life again."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "38",
    "Text": "This man is but an impostor, forging a lie against Allah, and we\\n\\t\\t\\tare not going to believe him.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "39",
    "Text": "At this the Rasool prayed: \"O my Rabb! Help me against their\\n\\t\\t\\tcalling me a liar.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "40",
    "Text": "Allah responded: \"After a short time they will surely be sorry.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "41",
    "Text": "So the Blast overtook them in all justice and We swept them away\\n\\t\\t\\tlike the rubbish of dead leaves - so gone is the nation of\\n\\t\\t\\twrongdoers."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "42",
    "Text": "After them We raised other generations"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "43",
    "Text": "- no people can hasten their term nor can they postpone it"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "44",
    "Text": "- and sent forth Our Rasools one after another: every time a\\n\\t\\t\\tRasool came to his people, they disbelieved him, so We punished\\n\\t\\t\\tthem one by one and made them a history; so gone is the nation of\\n\\t\\t\\tdisbelievers."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "45",
    "Text": "Then We sent Musa (Moses) and his brother Haroon (Aaron) with Our\\n\\t\\t\\tsigns and clear authority,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "46",
    "Text": "to Fir'on (Pharaoh) and his chiefs: but they received them with\\n\\t\\t\\tarrogance for they were very haughty people."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "47",
    "Text": "They said: \"What! Should we believe in two human beings like\\n\\t\\t\\tourselves, and whose people are our slaves?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "48",
    "Text": "So they disbelieved both of them and became among those who were\\n\\t\\t\\tdestroyed."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "49",
    "Text": "And We gave Musa the Book, so that his people might be rightly\\n\\t\\t\\tguided."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "50",
    "Text": "And We made the son of Maryam (Jesus) and his mother a sign for\\n\\t\\t\\tmankind, and gave them a shelter on a peaceful lofty ground,\\n\\t\\t\\tfurnished with a fresh spring."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "51",
    "Text": "O Rasools! Eat of pure things and do good deeds, certainly I have\\n\\t\\t\\tknowledge of all your actions."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "52",
    "Text": "In fact, your religion is one religion, and I am your only Rabb:\\n\\t\\t\\tso fear Me Alone."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "53",
    "Text": "Yet people have divided themselves into factions and each faction\\n\\t\\t\\trejoices in its own doctrines"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "54",
    "Text": "- well! Leave them in their heedlessness for an appointed time."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "55",
    "Text": "Do they think that, in giving them wealth and children,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "56",
    "Text": "We are eager for their welfare? By no means! They do not\\n\\t\\t\\tunderstand the reality of the matter."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "57",
    "Text": "Surely those who live cautiously for fear of their Rabb,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "58",
    "Text": "who believe in the revelations of their Rabb;"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "59",
    "Text": "who do not commit shirk with their Rabb,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "60",
    "Text": "who give to charity whatever they can give, and their hearts are\\n\\t\\t\\tfull of fear by the very idea that they shall have to return to\\n\\t\\t\\ttheir Rabb,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "61",
    "Text": "it is they who rush in doing good deeds and try to be the first\\n\\t\\t\\tin attaining them."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "62",
    "Text": "We charge no soul with more than it can bear; We have a Book of\\n\\t\\t\\trecord which shall clearly tell the truth, and they shall not be\\n\\t\\t\\ttreated unjustly."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "63",
    "Text": "But their hearts are blind to all this; and their deeds are also\\n\\t\\t\\tdifferent from the believers. They will continue doing their\\n\\t\\t\\tmisdeeds"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "64",
    "Text": "until when We seize those of them who live in comfort with\\n\\t\\t\\tpunishment; lo! Then they start crying for help in supplication."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "65",
    "Text": "We shall say: \"Do not cry for help this Day, for surely from Us\\n\\t\\t\\tyou shall receive no help."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "66",
    "Text": "My revelations were recited to you, but you used to turn back on\\n\\t\\t\\tyour heels"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "67",
    "Text": "in arrogance, talking nonsense about The Qur'an like one telling\\n\\t\\t\\tfables by night."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "68",
    "Text": "Do they not ponder over the Word of Allah or has anything new\\n\\t\\t\\tcome to them which did not come to their forefathers?"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "69",
    "Text": "Or is it because they do not recognize their Rasool, who is a\\n\\t\\t\\tmember of their own community, that they deny him?"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "70",
    "Text": "Or are they really convinced that he is a madman? Nay! In fact he\\n\\t\\t\\thas brought them the Truth and most of them dislike the Truth."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "71",
    "Text": "- Had the Truth followed their appetites, the heavens, the earth\\n\\t\\t\\tand everything therein would have been disrupted. Nay! We have\\n\\t\\t\\tgiven them their reminder, but they are heedless to their\\n\\t\\t\\treminder."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "72",
    "Text": "Or is it that you are asking them for some recompense? But the\\n\\t\\t\\trecompense of your Rabb is the best, for He is the best provider\\n\\t\\t\\tof sustenance."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "73",
    "Text": "As a matter of fact, you (O Muhammad) are calling them to the\\n\\t\\t\\tStraight Way;"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "74",
    "Text": "and surely those who do not believe in the hereafter will ever\\n\\t\\t\\tstray from the Straight Way."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "75",
    "Text": "If We show them mercy and relieve them of their affliction, they\\n\\t\\t\\twould obstinately persist in their rebellion, blindly wandering\\n\\t\\t\\tto and fro;"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "76",
    "Text": "for even now, when We have inflicted punishment on them, they\\n\\t\\t\\thave neither submitted to their Rabb nor humbled themselves\\n\\t\\t\\ttowards Him."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "77",
    "Text": "Until when We open upon them a gate of severe punishment, you\\n\\t\\t\\twill see that they are plunged in utter despair."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "78",
    "Text": "It is Allah Who has given you ears, eyes and hearts - yet seldom\\n\\t\\t\\tyou show gratitude"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "79",
    "Text": "- it is He Who has placed you in the earth and before Him you\\n\\t\\t\\tshall all be assembled on the Day of Judgement."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "80",
    "Text": "It is He Who gives life and cause you to die, and in His control\\n\\t\\t\\tis the alternation of the night and the day: then why don't you\\n\\t\\t\\tunderstand?"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "81",
    "Text": "On the contrary they just say what their forefathers said before\\n\\t\\t\\tthem,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "82",
    "Text": "who said: \"What! After death when our bodies become dust and\\n\\t\\t\\tbones, could we really be raised to life again?"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "83",
    "Text": "We have heard many such threats and so did our forefathers before\\n\\t\\t\\tus. These are nothing but legends of primitive people.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "84",
    "Text": "Say: \"To whom belong the earth and everything therein? Tell me if\\n\\t\\t\\tyou know?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "85",
    "Text": "They will promptly reply: \"to Allah!\" Ask them: \"Then why you\\n\\t\\t\\tdon't use your common sense and believe in Him?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "86",
    "Text": "Say: \"Who is the Rabb of the seven heavens and the Rabb of the\\n\\t\\t\\tGlorious Throne?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "87",
    "Text": "Right away they will say: \"Allah.\" Ask them: \"Then why you don't\\n\\t\\t\\tfear Him?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "88",
    "Text": "Say: \"In whose hands is the sovereignty of all things, protecting\\n\\t\\t\\tall, while against Him there is no protection? Tell me if you\\n\\t\\t\\tknow.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "89",
    "Text": "Quickly they will reply: \"Allah.\" Ask them: \"Then how you can be\\n\\t\\t\\tso bewitched?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "90",
    "Text": "The fact of the matter is that We have brought them the Truth,\\n\\t\\t\\tand undoubtedly these people are liars."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "91",
    "Text": "Never has Allah begotten a son, nor is there any god besides Him.\\n\\t\\t\\tHad it been so, each god would govern his own creation, and each\\n\\t\\t\\twould have tried to overpower the others. Exalted be Allah, above\\n\\t\\t\\tthe sort of things they attribute to Him!"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "92",
    "Text": "He knows what is hidden and what is open: far above is He from\\n\\t\\t\\tthe shirk of these people."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "93",
    "Text": "Pray: \"O my Rabb! If You inflict that punishment with which they\\n\\t\\t\\tare being threatened in my lifetime,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "94",
    "Text": "then O Rabb, do not include me amongst these unjust people.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "95",
    "Text": "Surely We have the power to let you see the punishment with which\\n\\t\\t\\tthey are being threatened."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "96",
    "Text": "Repel evil with good - We are fully aware of their slanders"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "97",
    "Text": "- and say, \"O my Rabb! I seek refuge in You from the prompting of\\n\\t\\t\\tthe shaitans,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "98",
    "Text": "and O Rabb! I seek refuge in You even from their coming near me.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "99",
    "Text": "These people will never refrain from wrongdoing until when death\\n\\t\\t\\tcomes to anyone of them, he will say: \"O Rabb! Send me back,"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "100",
    "Text": "so that I may do good deeds in the world that I have left\\n\\t\\t\\tbehind.\" Never! This is just a statement which carries no value,\\n\\t\\t\\tit will be too late because there will be a barrier between them\\n\\t\\t\\tand the world they have just left till the Day they are raised to\\n\\t\\t\\tlife again."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "101",
    "Text": "On the Day when the Trumpet will be blown, they will neither have\\n\\t\\t\\tworldly relations between them any more, nor will they ask about\\n\\t\\t\\teach other."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "102",
    "Text": "Then only those whose weight of good deeds is heavy, will attain\\n\\t\\t\\tsalvation."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "103",
    "Text": "As for those whose weight of good deeds is light, they will be\\n\\t\\t\\tthe ones who have lost their souls to live in hell forever."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "104",
    "Text": "The Fire will burn their faces and they will grin therein with\\n\\t\\t\\ttheir lips displaced."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "105",
    "Text": "We shall say to them: \"Were My revelations not recited to you,\\n\\t\\t\\tand did you not deny them?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "106",
    "Text": "They will say: \"O our Rabb! Our misfortune overwhelmed us and we\\n\\t\\t\\tbecame erring folk."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "107",
    "Text": "Our Rabb! Get us out of here; if we ever return to sin, then we\\n\\t\\t\\tshall indeed be wrongdoers.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "108",
    "Text": "In answer to this Allah will say: \"Stay here in shame and do not\\n\\t\\t\\tplead with Me!"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "109",
    "Text": "For you are the same people, who used to make fun of some of My\\n\\t\\t\\tworshippers who prayed: 'Our Rabb, We believe in You; please\\n\\t\\t\\tforgive us and have mercy on us, for You are the Best of those\\n\\t\\t\\twho show mercy!'"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "110",
    "Text": "But you ridiculed them so much, that you even forgot My very\\n\\t\\t\\texistence, and went on laughing at them."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "111",
    "Text": "Today I have rewarded them for their fortitude, and they are the\\n\\t\\t\\tones who have achieved bliss.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "112",
    "Text": "They will be asked: \"How many years did you live on earth?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "113",
    "Text": "They will reply: \"We lived there a day or part of a day; You may\\n\\t\\t\\task those who kept the count.\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "114",
    "Text": "It will be said: \"Well, now you know that your stay was just a\\n\\t\\t\\tlittle while - what a pity, you did not believe it then!\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "115",
    "Text": "Did you think that We had created you without any purpose and\\n\\t\\t\\tthat you would never return to Us for accountability?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "116",
    "Text": "Therefore, exalted be Allah, the Real King; there is no god but\\n\\t\\t\\tHim, the Lord of the Honorable Throne."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "117",
    "Text": "Whoever invokes another god besides Allah - about whose divinity\\n\\t\\t\\the has no proof -he will have to give an account to his Rabb.\\n\\t\\t\\tSurely such unbelievers will never attain salvation."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "118",
    "Text": "Say: \"O Rabb, forgive, have Mercy, You are the Best of those who\\n\\t\\t\\tshow mercy!\""
  }
]
