[
  {
    "SurahNumber": "76",
    "AyahNumber": "1",
    "Text": "Has there not passed over man a period of time when he was\\n\\t\\t\\tnothing- -not even mentioned?"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "2",
    "Text": "Indeed, We have created man from the sperm drop containing both\\n\\t\\t\\tsexes, so that We may test him. Therefore, We gave him the\\n\\t\\t\\tfaculties of hearing and sight."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "3",
    "Text": "Then We guided him to the Way: Now, it is his choice either to be\\n\\t\\t\\tgrateful or to be a disbeliever."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "4",
    "Text": "For the disbelievers, We have prepared chains, fetters and a\\n\\t\\t\\tblazing fire."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "5",
    "Text": "The righteous shall be in paradise drinking from a cup of wine\\n\\t\\t\\tmixed with Kafoor (camphor-water),"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "6",
    "Text": "from a gushing spring at which the servants of Allah will refresh\\n\\t\\t\\tthemselves, and shall be able to take out its channels from place\\n\\t\\t\\tto place at their will."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "7",
    "Text": "They are those who keep their vows and dread the Day of\\n\\t\\t\\twidespread terror,"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "8",
    "Text": "who feed the poor, the orphan and the captive for the love of\\n\\t\\t\\tAllah,"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "9",
    "Text": "saying: \"We feed you for the sake of Allah Alone; we seek from\\n\\t\\t\\tyou neither reward nor thanks,"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "10",
    "Text": "for we dread from our Rabb's torment of a very distressful Day.\""
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "11",
    "Text": "So Allah will deliver them from the evil of that Day, and bestow\\n\\t\\t\\ton them freshness and joy,"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "12",
    "Text": "and reward them, for their steadfastness with paradise and\\n\\t\\t\\tgarments of silk."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "13",
    "Text": "There they shall be reclining upon high couches; they shall feel\\n\\t\\t\\tneither the scorching heat nor the biting cold."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "14",
    "Text": "The trees of paradise will spread their shade around them, and\\n\\t\\t\\ttheir fruits will hang in clusters within their easy reach."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "15",
    "Text": "They shall be served with silver dishes, goblets of crystal,"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "16",
    "Text": "and goblets made of crystal-clear silver, filled by their\\n\\t\\t\\tattendants in due measure."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "17",
    "Text": "And they will also be given to drink a cup of wine mixed with\\n\\t\\t\\tZanjabil (ginger-flavored water),"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "18",
    "Text": "from a fountain, called Salsabil."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "19",
    "Text": "They shall be attended by boys graced with eternal youth: when\\n\\t\\t\\tyou see them, they would seem like sprinkled pearls."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "20",
    "Text": "And which ever direction you will look, you will see blessings\\n\\t\\t\\tand the splendor of a great Kingdom."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "21",
    "Text": "They (the residents of paradise) shall be arrayed in the garments\\n\\t\\t\\tof fine green silk and rich brocade, and adorned with bracelets\\n\\t\\t\\tof silver, and their Rabb will give them pure wine to drink."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "22",
    "Text": "O believers, that's how you will be rewarded, and your endeavors\\n\\t\\t\\tappreciated."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "23",
    "Text": "Surely, it is We Who have sent down this Qur'an to you through\\n\\t\\t\\tgradual revelations,"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "24",
    "Text": "therefore, await with patience the command of your Rabb and do\\n\\t\\t\\tnot yield to any sinner or disbeliever from among the\\n\\t\\t\\tunbelievers."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "25",
    "Text": "Glorify the name of your Rabb morning and evening;"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "26",
    "Text": "prostrate before Him at night and glorify Him during the long\\n\\t\\t\\thours of night."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "27",
    "Text": "These unbelievers love the transitory life of this world and\\n\\t\\t\\tneglect the heavy Day that is coming ahead."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "28",
    "Text": "It is We Who created them and made their joints strong; but if We\\n\\t\\t\\tplease We can replace them with others like them through a\\n\\t\\t\\tchange."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "29",
    "Text": "This is indeed an admonition, so let him who will, adopt The Way\\n\\t\\t\\tto his Rabb,"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "30",
    "Text": "but you cannot will, except by the will of Allah. Surely Allah is\\n\\t\\t\\tAll-Knowledgeable, All-Wise."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "31",
    "Text": "He admits to His mercy whom He wills, and for the wrongdoers He\\n\\t\\t\\thas prepared a painful punishment."
  }
]
