[
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "21",
    "Text": "Indeed, those who deny Allah&rsquo;s signs, kill the prophets unjustly, and kill people who stand up for justice&mdash;give them good news of a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "22",
    "Text": "They are the ones whose deeds are wasted in this world and the Hereafter. And they will have no helpers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "23",
    "Text": "Have you not seen those who were given a portion of the Scriptures?<span class='fn' foot_note=28961>1</span>&nbsp;Yet when they are invited to the Book of Allah to settle their disputes, some of them turn away heedlessly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "24",
    "Text": "This is because they say, &ldquo;The Fire will not touch us except for a few days.&rdquo; They have been deceived in their faith by their wishful lying."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "25",
    "Text": "But how &#761;horrible&#762; will it be when We gather them together on the Day about which there is no doubt&mdash;when every soul will be paid in full for what it has done, and none will be wronged!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "26",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;O Allah! Lord over all authorities! You give authority to whoever You please and remove it from who You please; You honour whoever You please and disgrace who You please&mdash;all good is in Your Hands. Surely You &#761;alone&#762; are Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "27",
    "Text": "You cause the night to pass into the day and the day into the night. You bring forth the living from the dead and the dead from the living. And You provide for whoever You will without limit.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "28",
    "Text": "Believers should not take disbelievers as guardians instead of the believers&mdash;and whoever does so will have nothing to hope for from Allah&mdash;unless it is a precaution against their tyranny. And Allah warns you about Himself. And to Allah is the final return."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "29",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;Whether you conceal what is in your hearts or reveal it, it is known to Allah. For He knows whatever is in the heavens and whatever is on the earth. And Allah is Most Capable of everything.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "30",
    "Text": "&#761;Watch for&#762; the Day when every soul will be presented with whatever good it has done. And it will wish that its misdeeds were far off. And Allah warns you about Himself. And Allah is Ever Gracious to &#761;His&#762; servants."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "31",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;If you &#761;sincerely&#762; love Allah, then follow me; Allah will love you and forgive your sins. For Allah is All-Forgiving, Most Merciful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "32",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;Obey Allah and His Messenger.&rdquo; If they still turn away, then truly Allah does not like the disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "33",
    "Text": "Indeed, Allah chose Adam, Noah, the family of Abraham, and the family of &rsquo;Imr&acirc;n above all people &#761;of their time&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "34",
    "Text": "They are descendants of one another. And Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "35",
    "Text": "&#761;Remember&#762; when the wife of &rsquo;Imr&acirc;n said, &ldquo;My Lord! I dedicate what is in my womb entirely to Your service,<span class='fn' foot_note=28962>1</span>&nbsp;so accept it from me. You &#761;alone&#762; are truly the All-Hearing, All-Knowing.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "36",
    "Text": "When she delivered, she said, &ldquo;My Lord! I have given birth to a girl,&rdquo;&mdash;and Allah fully knew what she had delivered&mdash;&ldquo;and the male is not like the female.<span class='fn' foot_note=28963>1</span>&nbsp;I have named her Mary, and I seek Your protection for her and her offspring from Satan, the accursed.&rdquo;<span class='fn' foot_note=28964>2</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "37",
    "Text": "So her Lord accepted her graciously and blessed her with a pleasant upbringing&mdash;entrusting her to the care of Zachariah. Whenever Zachariah visited her in the sanctuary, he found her supplied with provisions. He exclaimed, &ldquo;O Mary! Where did this come from?&rdquo; She replied, &ldquo;It is from Allah. Surely Allah provides for whoever He wills without limit.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "38",
    "Text": "Then and there Zachariah prayed to his Lord, saying, &ldquo;My Lord! Grant me&mdash;by your grace&mdash;righteous offspring. You are certainly the Hearer of &#761;all&#762; prayers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "39",
    "Text": "So the angels called out to him while he stood praying in the sanctuary, &ldquo;Allah gives you good news of &#761;the birth of&#762; John who will confirm the Word of Allah and will be a great leader, chaste, and a prophet among the righteous.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "40",
    "Text": "Zachariah exclaimed, &ldquo;My Lord! How can I have a son when I am very old and my wife is barren?&rdquo; He replied, &ldquo;So will it be. Allah does what He wills.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "41",
    "Text": "Zachariah said, &ldquo;My Lord! Grant me a sign.&rdquo; He said, &ldquo;Your sign is that you will not &#761;be able to&#762; speak to people for three days except through gestures. Remember your Lord often and glorify &#761;Him&#762; morning and evening.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "42",
    "Text": "And &#761;remember&#762; when the angels said, &ldquo;O Mary! Surely Allah has selected you, purified you, and chosen you over all women of the world."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "43",
    "Text": "O &nbsp;Mary! Be devout to your Lord, prostrate yourself &#761;in prayer&#762; and bow along with those who bow down.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "44",
    "Text": "This is news of the unseen that We reveal to you &#761;O Prophet&#762;. You were not with them when they cast lots to decide who would be Mary&rsquo;s guardian, nor were you there when they argued &#761;about it&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "45",
    "Text": "&#761;Remember&#762; when the angels proclaimed, &ldquo;O Mary! Allah gives you good news of a Word<span class='fn' foot_note=28965>1</span>&nbsp;from Him, his name will be the Messiah,<span class='fn' foot_note=28966>2</span>&nbsp;Jesus, son of Mary; honoured in this world and the Hereafter, and he will be one of those nearest &#761;to Allah&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "46",
    "Text": "And he will speak to people in &#761;his&#762; infancy and adulthood and will be one of the righteous.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "47",
    "Text": "Mary wondered, &ldquo;My Lord! How can I have a child when no man has ever touched me?&rdquo; An angel replied, &ldquo;So will it be. Allah creates what He wills. When He decrees a matter, He simply tells it, &lsquo;Be!&rsquo; And it is!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "48",
    "Text": "And Allah will teach him writing and wisdom, the Torah and the Gospel,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "49",
    "Text": "and &#761;make him&#762; a messenger to the Children of Israel &#761;to proclaim,&#762; &lsquo;I have come to you with a sign from your Lord: I will make for you a bird from clay, breathe into it, and it will become a &#761;real&#762; bird&mdash;by Allah&rsquo;s Will. I will heal the blind and the leper and raise the dead to life&mdash;by Allah&rsquo;s Will. And I will prophesize what you eat and store in your houses. Surely in this is a sign for you if you &#761;truly&#762; believe."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "50",
    "Text": "And I will confirm the Torah revealed before me and legalize some of what had been forbidden to you. I have come to you with a sign from your Lord, so be mindful of Allah and obey me."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "51",
    "Text": "Surely Allah is my Lord and your Lord. So worship Him &#761;alone&#762;. This is the Straight Path.&rsquo;&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "52",
    "Text": "When Jesus sensed disbelief from his people, he asked, &ldquo;Who will stand up with me for Allah?&rdquo; The disciples replied, &ldquo;We will stand up for Allah. We believe in Allah, so bear witness that we have submitted.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "53",
    "Text": "&#761;They prayed to Allah,&#762; &ldquo;Our Lord! We believe in Your revelations and follow the messenger, so count us among those who bear witness.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "54",
    "Text": "And the disbelievers made a plan &#761;against Jesus&#762;, but Allah also planned&mdash;and Allah is the best of planners."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "55",
    "Text": "&#761;Remember&#762; when Allah said, &ldquo;O Jesus! I will take you<span class='fn' foot_note=28967>1</span>&nbsp;and raise you up to Myself. I will deliver you from those who disbelieve, and elevate your followers above the disbelievers until the Day of Judgment. Then to Me you will &#761;all&#762; return, and I will settle all your disputes."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "56",
    "Text": "As for those who disbelieve, I will subject them to a severe punishment in this life and the Hereafter, and they will have no helpers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "57",
    "Text": "And as for those who believe and do good, they will be rewarded in full. And Allah does not like the wrongdoers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "58",
    "Text": "We recite &#761;all&#762; this to you &#761;O Prophet&#762; as one of the signs<span class='fn' foot_note=28968>1</span>&nbsp;and &#761;as&#762; a wise reminder."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "59",
    "Text": "Indeed, the example of Jesus in the sight of Allah is like that of Adam. He created him from dust, then said to him, &ldquo;Be!&rdquo; And he was!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "60",
    "Text": "This is the truth from your Lord, so do not be one of those who doubt."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "61",
    "Text": "Now, whoever disputes with you &#761;O Prophet&#762; concerning Jesus after full knowledge has come to you, say, &ldquo;Come! Let us gather our children and your children, our women and your women, ourselves and yourselves&mdash;then let us sincerely invoke Allah&rsquo;s curse upon the liars.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "62",
    "Text": "Certainly, this is the true narrative, and there is no god &#761;worthy of worship&#762; except Allah. And indeed, Allah &#761;alone&#762; is the Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "63",
    "Text": "If they turn away, then surely Allah has &#761;perfect&#762; knowledge of the corruptors."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "64",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;O People of the Book! Let us come to common terms: that we will worship none but Allah, associate none with Him, nor take one another as lords instead of Allah.&rdquo; But if they turn away, then say, &ldquo;Bear witness that we have submitted &#761;to Allah alone&#762;.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "65",
    "Text": "O People of the Book! Why do you argue about Abraham, while the Torah and the Gospel were not revealed until long after him? Do you not understand?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "66",
    "Text": "Here you are! You disputed about what you have &#761;little&#762; knowledge of,<span class='fn' foot_note=28969>1</span>&nbsp;but why do you now argue about what you have no knowledge of?<span class='fn' foot_note=28970>2</span>&nbsp;Allah knows and you do not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "67",
    "Text": "Abraham was neither a Jew nor a Christian; he submitted in all uprightness<span class='fn' foot_note=28971>1</span>&nbsp;and was not a polytheist."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "68",
    "Text": "Indeed, those who have the best claim to Abraham are his followers, this Prophet,<span class='fn' foot_note=28972>1</span>&nbsp;and the believers. And Allah is the Guardian of those who believe."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "69",
    "Text": "Some of the People of the Book wish to mislead you &#761;believers&#762;. They mislead none but themselves, yet they fail to perceive it."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "70",
    "Text": "O &nbsp;People of the Book! Why do you reject the signs of Allah while you bear witness &#761;to their truth&#762;?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "71",
    "Text": "O &nbsp;People of the Book! Why do you mix the truth with falsehood and hide the truth knowingly?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "72",
    "Text": "A group among the People of the Book said &#761;to one another&#762;, &ldquo;Believe in what has been revealed to the believers in the morning and reject it in the evening, so they may abandon their faith."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "73",
    "Text": "And only believe those who follow your religion.&rdquo; Say, &#761;O Prophet,&#762; &ldquo;Surely, &#761;the only&#762; true guidance is Allah&rsquo;s guidance.&rdquo; &#761;They also said,&#762; &ldquo;Do not believe that someone will receive &#761;revealed&#762; knowledge similar to yours or argue against you before your Lord.&rdquo; Say, &#761;O Prophet,&#762; &ldquo;Indeed, all bounty is in the Hands of Allah&mdash;He grants it to whoever He wills. And Allah is All-Bountiful, All-Knowing.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "74",
    "Text": "He chooses whoever He wills to receive His mercy. And Allah is the Lord of infinite bounty."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "75",
    "Text": "There are some among the People of the Book who, if entrusted with a stack of gold, will readily return it. Yet there are others who, if entrusted with a single coin, will not repay it unless you constantly demand it. This is because they say, &ldquo;We are not accountable for &#761;exploiting&#762; the Gentiles.&rdquo;<span class='fn' foot_note=28973>1</span>&nbsp;And &#761;so&#762; they attribute lies to Allah knowingly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "76",
    "Text": "Absolutely! Those who honour their trusts and shun evil&mdash;surely Allah loves those who are mindful &#761;of Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "77",
    "Text": "Indeed, those who trade Allah&rsquo;s covenant and their oaths for a fleeting gain will have no share in the Hereafter. Allah will neither speak to them, nor look at them, nor purify them on the Day of Judgment. And they will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "78",
    "Text": "There are some among them who distort the Book with their tongues to make you think this &#761;distortion&#762; is from the Book&mdash;but it is not what the Book says. They say, &ldquo;It is from Allah&rdquo;&mdash;but it is not from Allah. And &#761;so&#762; they attribute lies to Allah knowingly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "79",
    "Text": "It is not appropriate for someone who Allah has blessed with the Scripture, wisdom, and prophethood to say to people, &ldquo;Worship me instead of Allah.&rdquo; Rather, he would say, &ldquo;Be devoted to the worship of your Lord &#761;alone&#762;&rdquo;&mdash;in accordance with what these prophets read in the Scripture and what they taught."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "80",
    "Text": "And he would never ask you to take angels and prophets as lords. Would he ask you to disbelieve after you have submitted?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "81",
    "Text": "&#761;Remember&#762; when Allah made a covenant with the prophets, &#761;saying,&#762; &ldquo;Now that I have given you the Book and wisdom, if there comes to you a messenger<span class='fn' foot_note=28974>1</span>&nbsp;confirming what you have, you must believe in him and support him.&rdquo; He added, &ldquo;Do you affirm this covenant and accept this commitment?&rdquo; They said, &ldquo;Yes, we do.&rdquo; Allah said, &ldquo;Then bear witness, and I too am a Witness.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "82",
    "Text": "Whoever turns back after this, they will be the rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "83",
    "Text": "Do they desire a way other than Allah&rsquo;s&mdash;knowing that all those in the heavens and the earth submit to His Will, willingly or unwillingly, and to Him they will &#761;all&#762; be returned?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "84",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;We believe in Allah and what has been revealed to us and what was revealed to Abraham, Ishmael, Isaac, Jacob, and his descendants; and what was given to Moses, Jesus, and other prophets from their Lord&mdash;we make no distinction between any of them, and to Him we &#761;fully&#762; submit.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "85",
    "Text": "Whoever seeks a way other than Islam,<span class='fn' foot_note=28975>1</span>&nbsp;it will never be accepted from them, and in the Hereafter they will be among the losers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "86",
    "Text": "How will Allah guide a people who chose to disbelieve after they had believed, acknowledged the Messenger to be true, and received clear proofs? For Allah does not guide the wrongdoing people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "87",
    "Text": "Their reward is that they will be condemned by Allah, the angels, and all of humanity."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "88",
    "Text": "They will be in Hell forever. Their punishment will not be lightened, nor will they be delayed &#761;from it&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "89",
    "Text": "As for those who repent afterwards and mend their ways, then surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "90",
    "Text": "Indeed, those who disbelieve after having believed then increase in disbelief, their repentance will never be accepted.<span class='fn' foot_note=28976>1</span>&nbsp;It is they who are astray."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "91",
    "Text": "Indeed, if each of those who disbelieve then die as disbelievers were to offer a ransom of enough gold to fill the whole world, it would never be accepted from them. It is they who will suffer a painful punishment, and they will have no helpers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "92",
    "Text": "You will never achieve righteousness until you donate some of what you cherish. And whatever you give is certainly well known to Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "93",
    "Text": "All food was lawful for the children of Israel, except what Israel<span class='fn' foot_note=28977>1</span>&nbsp;made unlawful for himself before the Torah was revealed.<span class='fn' foot_note=28978>2</span>&nbsp;Say, &#761;O Prophet,&#762; &ldquo;Bring the Torah and read it, if your claims are true.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "94",
    "Text": "Then whoever still fabricates lies about Allah, they will be the &#761;true&#762; wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "95",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;Allah has declared the truth. So follow the Way of Abraham, the upright&mdash;who was not a polytheist.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "96",
    "Text": "Surely the first House &#761;of worship&#762; established for humanity is the one at Bakkah&mdash;a blessed sanctuary and a guide for &#761;all&#762; people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "97",
    "Text": "In it are clear signs and the standing-place of Abraham. Whoever enters it should be safe. Pilgrimage to this House is an obligation by Allah upon whoever is able among the people.<span class='fn' foot_note=28979>1</span>&nbsp;And whoever disbelieves, then surely Allah is not in need of &#761;any of His&#762; creation."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "98",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;O People of the Book! Why do you deny the revelations of Allah, when Allah is a Witness to what you do?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "99",
    "Text": "Say, &ldquo;O People of the Book! Why do you turn the believers away from the Way of Allah&mdash;striving to make it &#761;appear&#762; crooked, while you are witnesses &#761;to its truth&#762;? And Allah is never unaware of what you do.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "100",
    "Text": "O believers! If you were to yield to a group of those who were given the Scripture, they would turn you back from belief to disbelief."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "101",
    "Text": "How can you disbelieve when Allah&rsquo;s revelations are recited to you and His Messenger is in your midst? Whoever holds firmly to Allah is surely guided to the Straight Path."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "102",
    "Text": "O believers! Be mindful of Allah in the way He deserves,<span class='fn' foot_note=28980>1</span>&nbsp;and do not die except in &#761;a state of full&#762; submission &#761;to Him&#762;.<span class='fn' foot_note=28981>2</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "103",
    "Text": "And hold firmly to the rope of Allah<span class='fn' foot_note=28982>1</span>&nbsp;and do not be divided. Remember Allah&rsquo;s favour upon you when you were enemies, then He united your hearts, so you&mdash;by His grace&mdash;became brothers. And you were at the brink of a fiery pit and He saved you from it. This is how Allah makes His revelations clear to you, so that you may be &#761;rightly&#762; guided."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "104",
    "Text": "Let there be a group among you who call &#761;others&#762; to goodness, encourage what is good, and forbid what is evil&mdash;it is they who will be successful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "105",
    "Text": "And do not be like those who split &#761;into sects&#762; and differed after clear proofs had come to them. It is they who will suffer a tremendous punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "106",
    "Text": "On that Day some faces will be bright while others gloomy. To the gloomy-faced it will be said, &ldquo;Did you disbelieve after having believed? So taste the punishment for your disbelief.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "107",
    "Text": "As for the bright-faced, they will be in Allah&rsquo;s mercy, where they will remain forever."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "108",
    "Text": "These are Allah&rsquo;s revelations We recite to you &#761;O Prophet&#762; in truth. And Allah desires no injustice to &#761;His&#762; creation."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "109",
    "Text": "To Allah &#761;alone&#762; belongs whatever is in the heavens and whatever is on the earth. And to Allah &#761;all&#762; matters will be returned &#761;for judgment&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "110",
    "Text": "You are the best community ever raised for humanity&mdash;you encourage good, forbid evil, and believe in Allah. Had the People of the Book believed, it would have been better for them. Some of them are faithful, but most are rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "111",
    "Text": "They can never inflict harm on you, except a little annoyance.<span class='fn' foot_note=28983>1</span>&nbsp;But if they meet you in battle, they will flee and they will have no helpers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "112",
    "Text": "They will be stricken with disgrace wherever they go, unless they are protected by a covenant with Allah or a treaty with the people. They have invited the displeasure of Allah and have been branded with misery for rejecting Allah&rsquo;s revelations and murdering &#761;His&#762; prophets unjustly. This is &#761;a fair reward&#762; for their disobedience and violations."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "113",
    "Text": "Yet they are not all alike: there are some among the People of the Book who are upright, who recite Allah&rsquo;s revelations throughout the night, prostrating &#761;in prayer&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "114",
    "Text": "They believe in Allah and the Last Day, encourage good and forbid evil, and race with one another in doing good. They are &#761;truly&#762; among the righteous."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "115",
    "Text": "They will never be denied the reward for any good they have done. And Allah has &#761;perfect&#762; knowledge of those mindful &#761;of Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "116",
    "Text": "Indeed, neither the wealth nor children of the disbelievers will be of any benefit to them against Allah. It is they who will be the residents of the Fire. They will be there forever."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "117",
    "Text": "The good they do in this worldly life is like the harvest of an evil people struck by a bitter wind, destroying it &#761;completely&#762;. Allah never wronged them, but they wronged themselves."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "118",
    "Text": "O believers! Do not associate closely with those who would not miss a chance to harm you. Their only desire is to see you suffer. Their prejudice has become evident from what they say&mdash;and what their hearts hide is far worse. We have made Our revelations clear to you, if only you understood."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "119",
    "Text": "Here you are! You love them but they do not love you, and you believe in all Scriptures. When they meet you they say, &ldquo;We believe.&rdquo; But when alone, they bite their fingertips in rage. Say, &#761;O Prophet,&#762; &ldquo;&#761;May you&#762; die of your rage!&rdquo; Surely Allah knows best what is &#761;hidden&#762; in the heart."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "120",
    "Text": "When you &#761;believers&#762; are touched with good, they grieve; but when you are afflicted with evil, they rejoice. &#761;Yet,&#762; if you are patient and mindful &#761;of Allah&#762;, their schemes will not harm you in the least. Surely Allah is Fully Aware of what they do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "121",
    "Text": "&#761;Remember, O &nbsp;Prophet,&#762; when you left your home in the early morning to position the believers in the battlefield. And Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "122",
    "Text": "&#761;Remember&#762; when two groups among you &#761;believers&#762; were about to cower, then Allah reassured them. So in Allah let the believers put their trust."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "123",
    "Text": "Indeed, Allah made you victorious at Badr when you were &#761;vastly&#762; outnumbered. So be mindful of Allah, perhaps you will be grateful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "124",
    "Text": "&#761;Remember, O &nbsp;Prophet,&#762; when you said to the believers, &ldquo;Is it not enough that your Lord will send down a reinforcement of three thousand angels for your aid?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "125",
    "Text": "Most certainly, if you &#761;believers&#762; are firm and mindful &#761;of Allah&#762; and the enemy launches a sudden attack on you, Allah will reinforce you with five thousand angels designated &#761;for battle&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "126",
    "Text": "Allah ordained this &#761;reinforcement&#762; only as good news for you and reassurance for your hearts. And victory comes only from Allah&mdash;the Almighty, All-Wise&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "127",
    "Text": "to destroy a group of the disbelievers and humble the rest, causing them to withdraw in disappointment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "128",
    "Text": "You &#761;O Prophet&#762; have no say in the matter.<span class='fn' foot_note=28984>1</span>&nbsp;It is up to Allah to turn to them in mercy or punish them, for indeed they are wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "129",
    "Text": "To Allah &#761;alone&#762; belongs whatever is in the heavens and whatever is on the earth. He forgives whoever He wills, and punishes whoever He wills. And Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "130",
    "Text": "O believers! Do not consume interest, multiplying it many times over. And be mindful of Allah, so you may prosper."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "131",
    "Text": "Guard yourselves against the Fire prepared for the disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "132",
    "Text": "Obey Allah and the Messenger, so you may be shown mercy."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "133",
    "Text": "And hasten towards forgiveness from your Lord and a Paradise as vast as the heavens and the earth, prepared for those mindful &#761;of Allah&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "134",
    "Text": "&#761;They are&#762; those who donate in prosperity and adversity, control their anger, and pardon others. And Allah loves the good-doers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "135",
    "Text": "&#761;They are&#762; those who, upon committing an evil deed or wronging themselves, remember Allah and seek forgiveness and do not knowingly persist in sin&mdash;and who forgives sins except Allah?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "136",
    "Text": "Their reward is forgiveness from their Lord and Gardens under which rivers flow, staying there forever. How excellent is the reward for those who work &#761;righteousness&#762;!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "137",
    "Text": "Similar situations came to pass before you, so travel throughout the land and see the fate of the deniers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "138",
    "Text": "This<span class='fn' foot_note=28985>1</span>&nbsp;is an insight to humanity&mdash;a guide and a lesson to the God-fearing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "139",
    "Text": "Do not falter or grieve, for you will have the upper hand, if you are &#761;true&#762; believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "140",
    "Text": "If you have suffered injuries &#761;at U&#7717;ud&#762;, they suffered similarly &#761;at Badr&#762;. We alternate these days &#761;of victory and defeat&#762; among people so that Allah may reveal the &#761;true&#762; believers, choose martyrs from among you&mdash;and Allah does not like the wrongdoers&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "141",
    "Text": "and distinguish the &#761;true&#762; believers and destroy the disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "142",
    "Text": "Do you think you will enter Paradise without Allah proving which of you &#761;truly&#762; struggled &#761;for His cause&#762; and patiently endured?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "143",
    "Text": "You certainly wished &#761;for the opportunity&#762; for martyrdom before encountering it, now you have seen it with your own eyes."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "144",
    "Text": "Mu&#7717;ammad is no more than a messenger; other messengers have gone before him. If he were to die or to be killed, would you regress into disbelief? Those who do so will not harm Allah whatsoever. And Allah will reward those who are grateful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "145",
    "Text": "No soul can ever die without Allah&rsquo;s Will at the destined time. Those who desire worldly gain, We will let them have it, and those who desire heavenly reward, We will grant it to them. And We will reward those who are grateful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "146",
    "Text": "&#761;Imagine&#762; how many devotees fought along with their prophets and never faltered despite whatever &#761;losses&#762; they suffered in the cause of Allah, nor did they weaken or give in! Allah loves those who persevere."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "147",
    "Text": "And all they said was, &ldquo;Our Lord! Forgive our sins and excesses, make our steps firm, and grant us victory over the disbelieving people.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "148",
    "Text": "So Allah gave them the reward of this world and the excellent reward of the Hereafter. For Allah loves the good-doers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "149",
    "Text": "O believers! If you yield to the disbelievers, they will drag you back to disbelief&mdash;and you will become losers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "150",
    "Text": "But no! Allah is your Guardian, and He is the best Helper."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "151",
    "Text": "We will cast horror into the hearts of the disbelievers for associating &#761;false gods&#762; with Allah&mdash;a practice He has never authorized. The Fire will be their home&mdash;what an evil place for the wrongdoers to stay!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "152",
    "Text": "Indeed, Allah fulfilled His promise to you when you &#761;initially&#762; swept them away by His Will, then your courage weakened and you disputed about the command and disobeyed,<span class='fn' foot_note=28986>1</span>&nbsp;after Allah had brought victory within your reach. Some of you were after worldly gain while others desired a heavenly reward. He denied you victory over them as a test, yet He has pardoned you. And Allah is Gracious to the believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "153",
    "Text": "&#761;Remember&#762; when you were running far away &#761;in panic&#762;&mdash;not looking at anyone&mdash;while the Messenger was calling to you from behind! So Allah rewarded your disobedience with distress upon distress. Now, do not grieve over the victory you were denied or the injury you suffered. And Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "154",
    "Text": "Then after distress, He sent down serenity in the form of drowsiness overcoming some of you, while others were disturbed by evil thoughts about Allah&mdash;the thoughts of &#761;pre-Islamic&#762; ignorance. They ask, &ldquo;Do we have a say in the matter?&rdquo; Say, &#761;O Prophet,&#762; &ldquo;All matters are destined by Allah.&rdquo; They conceal in their hearts what they do not reveal to you. They say &#761;to themselves&#762;, &ldquo;If we had any say in the matter, none of us would have come to die here.&rdquo; Say, &#761;O Prophet,&#762; &ldquo;Even if you were to remain in your homes, those among you who were destined to be killed would have met the same fate.&rdquo; Through this, Allah tests what is within you and purifies what is in your hearts. And Allah knows best what is &#761;hidden&#762; in the heart."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "155",
    "Text": "Indeed, those &#761;believers&#762; who fled on the day when the two armies met were made to slip by Satan because of their misdeeds. But Allah has pardoned them. Surely Allah is All-Forgiving, Most Forbearing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "156",
    "Text": "O believers! Do not be like the unfaithful<span class='fn' foot_note=28987>1</span>&nbsp;who say about their brothers who travel throughout the land or engage in battle, &ldquo;If they had stayed with us, they would not have died or been killed.&rdquo; Allah makes such thinking a cause of agony in their hearts. It is Allah who gives life and causes death. And Allah is All-Seeing of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "157",
    "Text": "Should you be martyred or die in the cause of Allah, then His forgiveness and mercy are far better than whatever &#761;wealth&#762; those &#761;who stay behind&#762; accumulate."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "158",
    "Text": "Whether you die or are martyred&mdash;all of you will be gathered before Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "159",
    "Text": "It is out of Allah&rsquo;s mercy that you &#761;O Prophet&#762; have been lenient with them. Had you been cruel or hard-hearted, they would have certainly abandoned you. So pardon them, ask Allah&rsquo;s forgiveness for them, and consult with them in &#761;conducting&#762; matters. Once you make a decision, put your trust in Allah. Surely Allah loves those who trust in Him."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "160",
    "Text": "If Allah helps you, none can defeat you. But if He denies you help, then who else can help you? So in Allah let the believers put their trust."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "161",
    "Text": "It is not appropriate for a prophet to illegally withhold spoils of war. And whoever does so, it will be held against them on the Day of Judgment. Then every soul will be paid in full for what it has done, and none will be wronged."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "162",
    "Text": "Are those who seek Allah&rsquo;s pleasure like those who deserve Allah&rsquo;s wrath? Hell is their home. What an evil destination!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "163",
    "Text": "They &#761;each&#762; have varying degrees in the sight of Allah. And Allah is All-Seeing of what they do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "164",
    "Text": "Indeed, Allah has done the believers a &#761;great&#762; favour by raising a messenger from among them&mdash;reciting to them His revelations, purifying them, and teaching them the Book and wisdom. For indeed they had previously been clearly astray."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "165",
    "Text": "Why is it when you suffered causalities &#761;at U&#7717;ud&#762;&mdash;although you had made your enemy suffer twice as much &#761;at Badr&#762;&mdash;you protested, &ldquo;How could this be?&rdquo;? Say, &#761;O Prophet,&#762; &ldquo;It is because of your disobedience.&rdquo; Surely Allah is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "166",
    "Text": "So what you suffered on the day the two armies met was by Allah&rsquo;s Will, so that He might distinguish the &#761;true&#762; believers"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "167",
    "Text": "and expose the hypocrites. When it was said to them, &ldquo;Come fight in the cause of Allah or &#761;at least&#762; defend yourselves,&rdquo; they replied, &ldquo;If we had known there was fighting, we would have definitely gone with you.&rdquo; They were closer to disbelief than to belief on that day&mdash;for saying with their mouths what was not in their hearts. Allah is All-Knowing of what they hide."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "168",
    "Text": "Those who sat at home, saying about their brothers, &ldquo;Had they listened to us, they would not have been killed.&rdquo; Say, &#761;O Prophet,&#762; &ldquo;Try not to die<span class='fn' foot_note=28988>1</span>&nbsp;if what you say is true!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "169",
    "Text": "Never think of those martyred in the cause of Allah as dead. In fact, they are alive with their Lord, well provided for&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "170",
    "Text": "rejoicing in Allah&rsquo;s bounties and being delighted for those yet to join them. There will be no fear for them, nor will they grieve."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "171",
    "Text": "They are joyful for receiving Allah&rsquo;s grace and bounty, and that Allah does not deny the reward of the believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "172",
    "Text": "&#761;As for&#762; those who responded to the call of Allah and His Messenger after their injury,<span class='fn' foot_note=28989>1</span>&nbsp;those of them who did good and were mindful &#761;of Allah&#762; will have a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "173",
    "Text": "Those who were warned, &ldquo;Your enemies have mobilized their forces against you, so fear them,&rdquo; the warning only made them grow stronger in faith and they replied, &ldquo;Allah &#761;alone&#762; is sufficient &#761;as an aid&#762; for us and &#761;He&#762; is the best Protector.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "174",
    "Text": "So they returned with Allah&rsquo;s favours and grace, suffering no harm. For they sought to please Allah. And surely Allah is &#761;the&#762; Lord of infinite bounty."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "175",
    "Text": "That &#761;warning&#762; was only &#761;from&#762; Satan, trying to prompt you to fear his followers.<span class='fn' foot_note=28990>1</span>&nbsp;So do not fear them; fear Me if you are &#761;true&#762; believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "176",
    "Text": "&#761;O Prophet!&#762; Do not grieve for those who race to disbelieve&mdash;surely they will not harm Allah in the least. It is Allah&rsquo;s Will to disallow them a share in the Hereafter, and they will suffer a tremendous punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "177",
    "Text": "Those who trade belief for disbelief will never harm Allah in the least, and they will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "178",
    "Text": "Those who disbelieve should not think that living longer is good for them. They are only given more time to increase in sin, and they will suffer a humiliating punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "179",
    "Text": "Allah would not leave the believers in the condition you were in, until He distinguished the good from the evil &#761;among you&#762;. Nor would Allah &#761;directly&#762; reveal to you the unseen,<span class='fn' foot_note=28991>1</span>&nbsp;but He chooses whoever He wills as a messenger. So believe in Allah and His messengers. And if you are faithful and mindful &#761;of Allah&#762;, you will receive a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "180",
    "Text": "And do not let those who &#761;greedily&#762; withhold Allah&rsquo;s bounties think it is good for them&mdash;in fact, it is bad for them! They will be leashed &#761;by their necks&#762; on the Day of Judgment with whatever &#761;wealth&#762; they used to withhold. And Allah is the &#761;sole&#762; inheritor of the heavens and the earth. And Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "181",
    "Text": "Indeed, Allah has heard those &#761;among the Jews&#762; who said, &ldquo;Allah is poor; we are rich!&rdquo; We have certainly recorded their slurs and their killing of prophets unjustly. Then We will say, &ldquo;Taste the torment of burning!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "182",
    "Text": "This is &#761;the reward&#762; for what your hands have done. And Allah is never unjust to &#761;His&#762; servants.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "183",
    "Text": "Those &#761;are the same people&#762; who say, &ldquo;Allah has commanded us not to believe in any messenger unless he brings us an offering to be consumed by fire &#761;from the sky&#762;.&rdquo; Say, &#761;O Prophet,&#762; &ldquo;Other prophets did in fact come to you<span class='fn' foot_note=28992>1</span>&nbsp;before me with clear proofs and &#761;even&#762; what you demanded&mdash;why then did you kill them, if what you say is true?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "184",
    "Text": "If you are rejected by them, so too were messengers before you who came with clear proofs, divine Books, and enlightening Scriptures.<span class='fn' foot_note=28993>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "185",
    "Text": "Every soul will taste death. And you will only receive your full reward on the Day of Judgment. Whoever is spared from the Fire and is admitted into Paradise will &#761;indeed&#762; triumph, whereas the life of this world is no more than the delusion of enjoyment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "186",
    "Text": "You &#761;believers&#762; will surely be tested in your wealth and yourselves,<span class='fn' foot_note=28994>1</span>&nbsp;and you will certainly hear many hurtful words from those who were given the Scripture before you and &#761;from&#762; the polytheists. But if you are patient and mindful &#761;of Allah&#762;&mdash;surely this is a resolve to aspire to."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "187",
    "Text": "&#761;Remember, O &nbsp;Prophet,&#762; when Allah took the covenant of those who were given the Scripture to make it known to people and not hide it, yet they cast it behind their backs and traded it for a fleeting gain. What a miserable profit!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "188",
    "Text": "Do not let those who rejoice in their misdeeds and love to take credit for what they have not done think they will escape torment. They will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "189",
    "Text": "To Allah &#761;alone&#762; belongs the kingdom of the heavens and the earth. And Allah is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "190",
    "Text": "Indeed, in the creation of the heavens and the earth and the alternation of the day and night there are signs for people of reason."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "191",
    "Text": "&#761;They are&#762; those who remember Allah while standing, sitting, and lying on their sides, and reflect on the creation of the heavens and the earth &#761;and pray&#762;, &ldquo;Our Lord! You have not created &#761;all of&#762; this without purpose. Glory be to You! Protect us from the torment of the Fire."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "192",
    "Text": "Our Lord! Indeed, those You commit to the Fire will be &#761;completely&#762; disgraced! And the wrongdoers will have no helpers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "193",
    "Text": "Our Lord! We have heard the caller<span class='fn' foot_note=28995>1</span>&nbsp;to &#761;true&#762; belief, &#761;proclaiming,&#762; &lsquo;Believe in your Lord &#761;alone&#762;,&rsquo; so we believed. Our Lord! Forgive our sins, absolve us of our misdeeds, and allow us &#761;each&#762; to die as one of the virtuous."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "194",
    "Text": "Our Lord! Grant us what You have promised us through Your messengers and do not put us to shame on Judgment Day&mdash;for certainly You never fail in Your promise.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "195",
    "Text": "So their Lord responded to them: &ldquo;I will never deny any of you&mdash;male or female&mdash;the reward of your deeds. Both are equal in reward. Those who migrated or were expelled from their homes, and were persecuted for My sake and fought and &#761;some&#762; were martyred&mdash;I will certainly forgive their sins and admit them into Gardens under which rivers flow, as a reward from Allah. And with Allah is the finest reward!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "196",
    "Text": "Do not be deceived by the prosperity of the disbelievers throughout the land."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "197",
    "Text": "It is only a brief enjoyment. Then Hell will be their home&mdash;what an evil place to rest!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "198",
    "Text": "But those who are mindful of their Lord will be in Gardens under which rivers flow, to stay there forever&mdash;as an accommodation from Allah. And what is with Allah is best for the virtuous."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "199",
    "Text": "Indeed, there are some among the People of the Book who truly believe in Allah and what has been revealed to you &#761;believers&#762; and what was revealed to them. They humble themselves before Allah&mdash;never trading Allah&rsquo;s revelations for a fleeting gain. Their reward is with their Lord. Surely Allah is swift in reckoning."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "200",
    "Text": "O believers! Patiently endure, persevere, stand on guard,<span class='fn' foot_note=28996>1</span>&nbsp;and be mindful of Allah, so you may be successful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "1",
    "Text": "Alif-L&atilde;m-M&#297;m."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "2",
    "Text": "Allah! There is no god &#761;worthy of worship&#762; except Him&mdash;the Ever-Living, All-Sustaining."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "3",
    "Text": "He has revealed to you &#761;O Prophet&#762; the Book in truth, confirming what came before it, as He revealed the Torah and the Gospel"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "4",
    "Text": "previously, as a guide for people, and &#761;also&#762; revealed the Standard &#761;to distinguish between right and wrong&#762;.<span class='fn' foot_note=28951>1</span>&nbsp;Surely those who reject Allah&rsquo;s revelations will suffer a severe torment. For Allah is Almighty, capable of punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "5",
    "Text": "Surely nothing on earth or in the heavens is hidden from Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "6",
    "Text": "He is the One Who shapes you in the wombs of your mothers as He wills. There is no god &#761;worthy of worship&#762; except Him&mdash;the Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "7",
    "Text": "He is the One Who has revealed to you &#761;O Prophet&#762; the Book, of which some verses are precise&mdash;they are the foundation of the Book&mdash;while others are elusive.<span class='fn' foot_note=28952>1</span>&nbsp;Those with deviant hearts follow the elusive verses seeking &#761;to spread&#762; doubt through their &#761;false&#762; interpretations&mdash;but none grasps their &#761;full&#762; meaning except Allah. As for those well-grounded in knowledge, they say, &ldquo;We believe in this &#761;Quran&#762;&mdash;it is all from our Lord.&rdquo; But none will be mindful &#761;of this&#762; except people of reason."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "8",
    "Text": "&#761;They say,&#762; &ldquo;Our Lord! Do not let our hearts deviate after you have guided us. Grant us Your mercy. You are indeed the Giver &#761;of all bounties&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "9",
    "Text": "Our Lord! You will certainly gather all humanity for the &#761;promised&#762; Day&mdash;about which there is no doubt. Surely Allah does not break His promise.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "10",
    "Text": "Indeed, neither the wealth nor children<span class='fn' foot_note=28953>1</span>&nbsp;of the disbelievers will be of any benefit to them against Allah&mdash;and they will be the fuel for the Fire."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "11",
    "Text": "Their fate will be like that of the people of Pharaoh and those before them&mdash;they all rejected Our signs, so Allah seized them for their sins. And Allah is severe in punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "12",
    "Text": "&#761;O Prophet!&#762; Tell the disbelievers, &ldquo;Soon you will be overpowered and driven to Hell&mdash;what an evil place to rest!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "13",
    "Text": "Indeed, there was a sign for you in the two armies that met in battle&mdash;one fighting for the cause of Allah and the other in denial. The believers saw their enemy twice their number.<span class='fn' foot_note=28954>1</span>&nbsp;But Allah supports with His victory whoever He wills. Surely in this is a lesson for people of insight."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "14",
    "Text": "The enjoyment of &#761;worldly&#762; desires&mdash;women, children,<span class='fn' foot_note=28955>1</span>&nbsp;treasures of gold and silver, fine horses, cattle, and fertile land&mdash;has been made appealing to people. These are the pleasures of this worldly life, but with Allah is the finest destination."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "15",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;Shall I inform you of what is better than &#761;all of&#762; this? Those mindful &#761;of Allah&#762; will have Gardens with their Lord under which rivers flow, to stay there forever, and pure spouses,<span class='fn' foot_note=28956>1</span>&nbsp;along with Allah&rsquo;s pleasure.&rdquo; And Allah is All-Seeing of &#761;His&#762; servants,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "16",
    "Text": "who pray, &ldquo;Our Lord! We have believed, so forgive our sins and protect us from the torment of the Fire.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "17",
    "Text": "&#761;It is they&#762; who are patient, sincere, obedient, and charitable, and who pray for forgiveness before dawn.<span class='fn' foot_note=28957>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "18",
    "Text": "Allah &#761;Himself&#762; is a Witness that there is no god &#761;worthy of worship&#762; except Him&mdash;and so are the angels and people of knowledge. He is the Maintainer of justice. There is no god &#761;worthy of worship&#762; except Him&mdash;the Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "19",
    "Text": "Certainly, Allah&rsquo;s only Way is Islam.<span class='fn' foot_note=28958>1</span>&nbsp;Those who were given the Scripture did not dispute &#761;among themselves&#762; out of mutual envy until knowledge came to them.<span class='fn' foot_note=28959>2</span>&nbsp;Whoever denies Allah&rsquo;s signs, then surely Allah is swift in reckoning."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "3",
    "AyahNumber": "20",
    "Text": "So if they argue with you &#761;O Prophet&#762;, say, &ldquo;I have submitted myself to Allah, and so have my followers.&rdquo; And ask those who were given the Scripture and the illiterate &#761;people&#762;,<span class='fn' foot_note=28960>1</span>&nbsp;&ldquo;Have you submitted yourselves &#761;to Allah&#762;?&rdquo; If they submit, they will be &#761;rightly&#762; guided. But if they turn away, then your duty is only to deliver &#761;the message&#762;. And Allah is All-Seeing of &#761;His&#762; servants."
  }
]
