[
  {
    "SurahNumber": "7",
    "AyahNumber": "1",
    "NoteID": "989",
    "Body": "This is a combination of four Abbreviated Letters. For\\n\\t\\t\\t\\tAbbreviated Letters generally, see Appendix I (at the end\\n\\t\\t\\t\\tof Sura II). The combination here includes the three\\n\\t\\t\\t\\tletters A.L.M., which occurred at the beginning of Sura\\n\\t\\t\\t\\tII, and are discussed in n. 25 to ii. 1. The additional\\n\\t\\t\\t\\tletter Sad occurs in combination here and in Sura xix,\\n\\t\\t\\t\\tand by itself at the beginning of S. xxxviii, and nowhere\\n\\t\\t\\t\\telse. The factor common to S. vii. S. xix, and S.\\n\\t\\t\\t\\txxxviii, is that in each case the core of the Sura\\n\\t\\t\\t\\tconsists in the stories (qisas) of the Prophets. In this\\n\\t\\t\\t\\tSura we have the Stories of Noah, Hud, Salih, Lot,\\n\\t\\t\\t\\tShu'aib, and Moses, leading up to Muhammad, and in S.\\n\\t\\t\\t\\txxxviii, the stories of David, Solomon, and Job similarly\\n\\t\\t\\t\\tlead up to Muhammad, occupying three out of the five\\n\\t\\t\\t\\tsections. Sura xix consists almost entirely of such\\n\\t\\t\\t\\tstories. In this Sura vii, we have the religious history\\n\\t\\t\\t\\tof mankind traced-the Beginning the Middle, and the End."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "2",
    "NoteID": "990",
    "Body": "Heart: in the original, breast. I have used the word most\\n\\t\\t\\t\\tappropriate to the English idiom. The meaning is that\\n\\t\\t\\t\\tAl-Mustafa is consoled for all the difficulties which he\\n\\t\\t\\t\\tencountered in his mission, with the fact that he had\\n\\t\\t\\t\\tclear guidance in the Book for his preaching."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "3",
    "NoteID": "991",
    "Body": "This is added in order that men might not be puffed up\\n\\t\\t\\t\\twith such little knowledge as they possessed, for there\\n\\t\\t\\t\\tare great heights to be scaled in the spiritual kingdom."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "5",
    "NoteID": "992",
    "Body": "The religious story of man begins with a prelude. Think\\n\\t\\t\\t\\tof the towns and nations ruined by their iniquity. Allah\\n\\t\\t\\t\\tgave them many opportunities, and sent them warners and\\n\\t\\t\\t\\tteachers. But they arrogantly went on in their evil ways,\\n\\t\\t\\t\\ttill some dreadful calamity came and wiped out their\\n\\t\\t\\t\\ttraces. In a warm climate the disturbance in the heat of\\n\\t\\t\\t\\tthe midday rest is even more than the disturbance at\\n\\t\\t\\t\\tnight. It was when the catastrophe came that the people\\n\\t\\t\\t\\trealised their sins, but it was too late."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "6",
    "NoteID": "993",
    "Body": "In the final reckoning, the warners and teachers will\\n\\t\\t\\t\\tgive evidence of their preaching the truth, and the\\n\\t\\t\\t\\twicked will themselves have to acknowledge the truth. We\\n\\t\\t\\t\\tpicture it like a court scene, when the story is related,\\n\\t\\t\\t\\tbut the Judge knows all, even more than the parties can\\n\\t\\t\\t\\ttell."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "7",
    "NoteID": "994",
    "Body": "Allah (being all-knowing) is never absent from any place\\n\\t\\t\\t\\tor at any time, for Time and Place are relative\\n\\t\\t\\t\\tconceptions for our limited natures, while He is the\\n\\t\\t\\t\\tAbsolute, independent of such relative conceptions."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "10",
    "NoteID": "995",
    "Body": "That is, all the material things which are necessary to\\n\\t\\t\\t\\tsustain, beautify, and refine life, as well as all those\\n\\t\\t\\t\\tpowers, faculties, and opportunities which are\\n\\t\\t\\t\\tinstrumental in bringing up life to a higher plane and\\n\\t\\t\\t\\tpreparing man for his high destiny."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "11",
    "NoteID": "996",
    "Body": "It was after Adam (as standing for all mankind) had been\\n\\t\\t\\t\\tso taught that the angels were asked to prostrate to him,\\n\\t\\t\\t\\tfor, by Allah's grace, his status had actually been\\n\\t\\t\\t\\traised higher. Note the transition from \"you\" (plural) in\\n\\t\\t\\t\\tthe first clause to \"Adam\" in the second clause: Adam and\\n\\t\\t\\t\\tmankind are synonymous: the plural is reverted to in vii.\\n\\t\\t\\t\\t14, 16-18."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "11",
    "NoteID": "997",
    "Body": "Iblis not only refused to bow down: he refused to be of\\n\\t\\t\\t\\tthose who prostrated. In other words he arrogantly\\n\\t\\t\\t\\tdespised the angels who prostrated as well as man to whom\\n\\t\\t\\t\\tthey prostrated and he was in rebellion against Allah for\\n\\t\\t\\t\\tnot obeying His order. Arrogance, jealousy, and rebellion\\n\\t\\t\\t\\twere his triple crime."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "12",
    "NoteID": "998",
    "Body": "Notice the subtle wiles of Iblis: his egotism in putting\\n\\t\\t\\t\\thimself above man, and his falsehood in ignoring the fact\\n\\t\\t\\t\\tthat Allah had not merely made man's body from clay, but\\n\\t\\t\\t\\thad given him spiritual form,-in other words, had taught\\n\\t\\t\\t\\thim the nature of things and raised him above the angels."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "13",
    "NoteID": "999",
    "Body": "The incident marks the externment of Iblis from the\\n\\t\\t\\t\\tGarden owing to his rebelliousness born of arrogance."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "15",
    "NoteID": "1000",
    "Body": "Are there others under respite? Yes, Iblis has a large\\n\\t\\t\\t\\tarmy of wicked seducers, and those men who are their\\n\\t\\t\\t\\tdupes. For though degradation takes effect at once, its\\n\\t\\t\\t\\tappearance may be long delayed."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "16",
    "NoteID": "1001",
    "Body": "Another instance of Iblis's subtlety and falsehood. He\\n\\t\\t\\t\\twaits till he gets the respite. Then he breaks out into a\\n\\t\\t\\t\\tlie and impertinent defiance. The lie is in suggesting\\n\\t\\t\\t\\tthat Allah had thrown him out of the Way, in other words\\n\\t\\t\\t\\tmisled him: whereas his own conduct was responsible for\\n\\t\\t\\t\\this degradation. The defiance is in his setting snares on\\n\\t\\t\\t\\tthe Straight Way to which Allah directs men."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "17",
    "NoteID": "1002",
    "Body": "The assault of evil is from all sides. It takes advantage\\n\\t\\t\\t\\tof every weak point, and sometimes even our good and\\n\\t\\t\\t\\tgenerous sympathies are used to decoy us into the snares\\n\\t\\t\\t\\tof evil. Man has every reason to be grateful to Allah for\\n\\t\\t\\t\\tall His loving care and yet man in his folly forgets his\\n\\t\\t\\t\\tgratitude and does the very opposite of what he should\\n\\t\\t\\t\\tdo."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "19",
    "NoteID": "1003",
    "Body": "Now the story turns to man. He was placed in the Garden\\n\\t\\t\\t\\tof comfort and bliss, but it was Allah's Plan to give him\\n\\t\\t\\t\\ta limited faculty of choice. All that he was forbidden to\\n\\t\\t\\t\\tdo was to approach the Tree, but he succumbed to Satan's\\n\\t\\t\\t\\tsuggestions."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "19",
    "NoteID": "1004",
    "Body": "Enjoy: literally, \"eat.\" Cf. the meaning of ta'ama in vi,\\n\\t\\t\\t\\t14, n. 847 and akala in v. 66, n. 776."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "20",
    "NoteID": "1005",
    "Body": "The transition from the name \"Iblis\" to the name \"Satan\"\\n\\t\\t\\t\\tis similar to that in ii. 36, where it is explained in n.\\n\\t\\t\\t\\t52."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "20",
    "NoteID": "1006",
    "Body": "Our first parents as created by Allah (and this applies\\n\\t\\t\\t\\tto all of us) were innocent in matters material as well\\n\\t\\t\\t\\tas spiritual. They knew no evil. But the faculty of\\n\\t\\t\\t\\tchoice, which was given to them and which raised them\\n\\t\\t\\t\\tabove the angels, also implied that they had the capacity\\n\\t\\t\\t\\tof evil, which by the training of their own will, they\\n\\t\\t\\t\\twere to reject. They were warned of the danger. When they\\n\\t\\t\\t\\tfell, they realised the evil. They were (and we are)\\n\\t\\t\\t\\tstill given the chance, in this life on a lower plane, to\\n\\t\\t\\t\\tmake good and recover the lost status of innocence and\\n\\t\\t\\t\\tbliss."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "25",
    "NoteID": "1007",
    "Body": "Cf. this whole passage about Adam with the passage in ii.\\n\\t\\t\\t\\t30-39, and with other passages in subsequent Suras. In\\n\\t\\t\\t\\tplaces the words are precisely the same, and yet the\\n\\t\\t\\t\\twhole argument is different. In each case it exactly fits\\n\\t\\t\\t\\tthe context. In S. ii. the argument was about the origin\\n\\t\\t\\t\\tof man. Here the argument is a prelude to his history on\\n\\t\\t\\t\\tearth, and so it continues logically in the next section\\n\\t\\t\\t\\tto address the Children of Adam, and goes on afterwards\\n\\t\\t\\t\\twith the story of the various prophets that came to guide\\n\\t\\t\\t\\tmankind. Truth is one, but its apt presentment in words\\n\\t\\t\\t\\tshows a different facet in different contexts."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "26",
    "NoteID": "1008",
    "Body": "The body: is pure and beautiful, as long as it is not\\n\\t\\t\\t\\tdefiled by misuse: its clothing and ornaments may be good\\n\\t\\t\\t\\tor meretricious, according to the motives in the mind and\\n\\t\\t\\t\\tcharacter: if good, they arc the symbols of purity and\\n\\t\\t\\t\\tbeauty: but the best clothing and ornament we could have\\n\\t\\t\\t\\tcomes from righteousness, which covers the nakedness of\\n\\t\\t\\t\\tsin, and adorns us with virtues."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "27",
    "NoteID": "1009",
    "Body": "That is, by fraud and deceit,-by putting you off your\\n\\t\\t\\t\\tguard and telling lies. Adam's story here becomes an\\n\\t\\t\\t\\tintroduction to the later religious history of mankind:\\n\\t\\t\\t\\tvii. 20-22. In the Garden, Satan's deceit stripped off\\n\\t\\t\\t\\ttheir raiment of honour and innocence. In this life on a\\n\\t\\t\\t\\tlower plane he seeks to strip us of the raiment of\\n\\t\\t\\t\\trighteousness. And he can take up positions on a vantage\\n\\t\\t\\t\\tground of worldly power or influence or riches, in which\\n\\t\\t\\t\\the and his confederates are not seen in their true\\n\\t\\t\\t\\tcolours. They may assume a fair-seeming disguise of\\n\\t\\t\\t\\tdisinterested friendship or high motives of patriotism or\\n\\t\\t\\t\\tpublic spirit, or loyalty to ancestors, when beneath it\\n\\t\\t\\t\\tthere is nothing but spite and selfishness."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "29",
    "NoteID": "1010",
    "Body": "For wajh, see ii. 112 and n. 114. Our devotion should be\\n\\t\\t\\t\\tsincere, not as in other men's sight, but by presenting\\n\\t\\t\\t\\tour whole selves, heart and soul, to Allah. Even so, it\\n\\t\\t\\t\\tmay not be enough; for the sight of our heart and soul\\n\\t\\t\\t\\tmay be faulty. We should call upon Allah to give us the\\n\\t\\t\\t\\tlight, by which our sincerity may commend itself to Him\\n\\t\\t\\t\\tas true sincerity \"as in His sight\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "29",
    "NoteID": "1011",
    "Body": "Cf. vi. 94. Our sincerity should be real sincerity, as in\\n\\t\\t\\t\\tHis sight for when we return to Him, we shall be stripped\\n\\t\\t\\t\\tof all pretence, even such self-deception as may satisfy\\n\\t\\t\\t\\tus in this life."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "30",
    "NoteID": "1012",
    "Body": "Guidance is for all. But in some it takes effect: in\\n\\t\\t\\t\\tothers the doors are closed against it, because they have\\n\\t\\t\\t\\ttaken Satan for their friend. If they have lost their\\n\\t\\t\\t\\tway, they have richly deserved it; for they deliberately\\n\\t\\t\\t\\ttook their choice, even though, in their\\n\\t\\t\\t\\tself-righteousness, they may think that their sin is\\n\\t\\t\\t\\ttheir virtue, and that their Evil is their Good."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "31",
    "NoteID": "1013",
    "Body": "Beautiful apparel: zinat: adornments or apparel for\\n\\t\\t\\t\\tbeautiful living: construed to mean not only clothes that\\n\\t\\t\\t\\tadd grace to the wearer, but toilet and cleanliness,\\n\\t\\t\\t\\tattention to hair, and other small personal details which\\n\\t\\t\\t\\tno self-respecting man or woman ought to neglect when\\n\\t\\t\\t\\tgoing solemnly even before a great human dignitary, if\\n\\t\\t\\t\\tonly out of respect for the dignity of the occasion. How\\n\\t\\t\\t\\tmuch more important it is to attend to these details when\\n\\t\\t\\t\\twe solemny apply our minds to the Presence of Allah. But\\n\\t\\t\\t\\tthe caution against excess applies: men must not go to\\n\\t\\t\\t\\tprayer in silks or ornaments appropriate to women.\\n\\t\\t\\t\\tSimilary sober food, good and wholesome, is not to be\\n\\t\\t\\t\\tdivorced from offices of religion; only the caution\\n\\t\\t\\t\\tagainst excess applies strictly. A dirty, unkempt,\\n\\t\\t\\t\\tslovenly Faqir could not claim sanctity in Islam."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "32",
    "NoteID": "1014",
    "Body": "Asceticism often means the negation of art and beauty, it\\n\\t\\t\\t\\thas no necessary sanctity attached to it."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "32",
    "NoteID": "1015",
    "Body": "The beautiful and good things of life are really meant\\n\\t\\t\\t\\tfor, and should be the privilege of those with faith in\\n\\t\\t\\t\\tAllah. If they do not always have them in this life, and\\n\\t\\t\\t\\tif there is sometimes the semblance of others having them\\n\\t\\t\\t\\twho do not deserve them, let us remember that this is a\\n\\t\\t\\t\\ttest from Allah. In the life to come they will be purely\\n\\t\\t\\t\\tfor the faithful."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "33",
    "NoteID": "1016",
    "Body": "The forbidden things are described in four categories:\\n\\t\\t\\t\\t(1) what is shameful or unbecoming; the sort of things\\n\\t\\t\\t\\twhich have also legal and social sanctions, not of a\\n\\t\\t\\t\\tlocal but of a universal kind; they may be called\\n\\t\\t\\t\\toffences against society: (2) sins against self and\\n\\t\\t\\t\\ttrespasses or excesses of every sort; these are against\\n\\t\\t\\t\\ttruth and reason; here would come in indiscipline,\\n\\t\\t\\t\\tfailure in doing intangible duties not clearly defined by\\n\\t\\t\\t\\tlaw; selfishness or self-aggrandisement, which may be\\n\\t\\t\\t\\tcondoned by custom and not punished by law, etc.- (3)\\n\\t\\t\\t\\terecting fetishes or false gods; this is treason against\\n\\t\\t\\t\\tthe true God; and (4) corrupting religion by debasing\\n\\t\\t\\t\\tsuperstitions, etc."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "34",
    "NoteID": "1017",
    "Body": "People: ummat. I do not know whether \"generation\" would\\n\\t\\t\\t\\tnot be more appropriate here. If so, it would refer to\\n\\t\\t\\t\\tthe Time-Spirit, for it affects a whole number of people\\n\\t\\t\\t\\tliving contemporaneously, and while we deal grammatically\\n\\t\\t\\t\\twith a group, we really have in mind the individuals\\n\\t\\t\\t\\tcomposing the group. Anyway, the lesson is what is\\n\\t\\t\\t\\tsuggested in the following verses. There is only a\\n\\t\\t\\t\\tlimited time for an individual or for a group of people.\\n\\t\\t\\t\\tIf they do not make good during that time of probation,\\n\\t\\t\\t\\tthe chance is lost, and it cannot come again. We cannot\\n\\t\\t\\t\\tretard or advance the march of time by a single hour or\\n\\t\\t\\t\\tminute. (\"Hour\" in the text expresses an indefinite but\\n\\t\\t\\t\\tshort period of time)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "37",
    "NoteID": "1018",
    "Body": "It must not be supposed that the rebels against Allah\\n\\t\\t\\t\\twould at once be cut off in this life for their sins.\\n\\t\\t\\t\\tThey will get the portion allotted to them, including the\\n\\t\\t\\t\\tgood things of life and the chance of rcpentance and\\n\\t\\t\\t\\treformation, during their probationary period on this\\n\\t\\t\\t\\tearth. During that period they will have a full run.\\n\\t\\t\\t\\tAfter that period expires, they will be called to\\n\\t\\t\\t\\taccount. They will themselves see that the false things,\\n\\t\\t\\t\\tin which they put their trust, were false, and they will\\n\\t\\t\\t\\tconfess their sin, but it will be too late."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "38",
    "NoteID": "1019",
    "Body": "The earlier generations committed a double crime: (1)\\n\\t\\t\\t\\ttheir own sins, (2) the bad example they set for those\\n\\t\\t\\t\\tthat followed. We are responsible not only for our own\\n\\t\\t\\t\\tmisdeeds, but for those which our example and our\\n\\t\\t\\t\\tteaching to our juniors may induce them to commit. But it\\n\\t\\t\\t\\tdoes not lie in the mouth of the juniors to ask for a\\n\\t\\t\\t\\tdouble punishment for seniors: the motive is not justice,\\n\\t\\t\\t\\tbut pure spite, which is itself a sin. Further, the later\\n\\t\\t\\t\\tgenerations have to answer for two things: (1) their own\\n\\t\\t\\t\\tsins, and (2) their failure to learn from the past, from\\n\\t\\t\\t\\tthe experiences of those who preceded them. -They should\\n\\t\\t\\t\\thave an advantage in this respect, being \"in the foremost\\n\\t\\t\\t\\tfiles of Time,\" but they did not learn. Thus there was\\n\\t\\t\\t\\tnothing to choose between the earlier and later\\n\\t\\t\\t\\tgenerations in the matter of guilt. But how few people\\n\\t\\t\\t\\tunderstand this! In vi. 160, we were told that good was\\n\\t\\t\\t\\trewarded tenfold, but evil was punished according to its\\n\\t\\t\\t\\tguilt, in perfect justice. This verse is in no way\\n\\t\\t\\t\\tinconsistent with it. Two crimes must have a double\\n\\t\\t\\t\\tpenalty."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "39",
    "NoteID": "1020",
    "Body": "Wrong-doers have really no sense of honour towards each\\n\\t\\t\\t\\tother. \"Honour among thieves\" is an exceptional, not an\\n\\t\\t\\t\\tordinary, experience. In real life, guilt and crime are\\n\\t\\t\\t\\tapt to indulge in mean spite and bitter recriminations\\n\\t\\t\\t\\tagainst accomplices."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "43",
    "NoteID": "1021",
    "Body": "A man who may have suffered or been disappointed may have\\n\\t\\t\\t\\ta lurking sense of injury in the back of his mind, which\\n\\t\\t\\t\\tmay spoil his enjoyment on account of past memory\\n\\t\\t\\t\\tintruding in the midst of felicity. In such cases memory\\n\\t\\t\\t\\titself is pain. Even sorrow is intensified by memory: as\\n\\t\\t\\t\\tTennyson says, \"A sorrow's crown of sorrows is\\n\\t\\t\\t\\tremembering happier things.\" But that is in this our\\n\\t\\t\\t\\timperfect life. In the perfect felicity of the righteous,\\n\\t\\t\\t\\tall such feelings will be blotted out. No \"heartaches\"\\n\\t\\t\\t\\tthen and no memories of them! The clouds of the past will\\n\\t\\t\\t\\thave dissolved in glorious light, and no past happiness\\n\\t\\t\\t\\twill be comparable with the perfect happiness which will\\n\\t\\t\\t\\thave then been attained. Nor will any sense of envy or\\n\\t\\t\\t\\tshortcoming be possible in that perfect bliss."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "43",
    "NoteID": "1022",
    "Body": "Jesus said: \"Blessed are the meek, for they shall inherit\\n\\t\\t\\t\\tthe earth\": Matt. v. 5. Here we are told: blessed are the\\n\\t\\t\\t\\trighteous, for they shall inherit the kingdom of heaven.\\n\\t\\t\\t\\tThe stress here is on actual practical deeds of\\n\\t\\t\\t\\trighteousness: whether they find their rewards on earth\\n\\t\\t\\t\\tor not is immaterial: their attention is directed to an\\n\\t\\t\\t\\tinfinitely greater reward, the kingdom of heaven. In the\\n\\t\\t\\t\\tSermon on the Mount this is promised to the \"poor in\\n\\t\\t\\t\\tspirit\": Matt. v, 3."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "44",
    "NoteID": "1023",
    "Body": "The Companions of the Fire can only answer a single word,\\n\\t\\t\\t\\t\"Yes,\" such is their state of misery. Even so, their\\n\\t\\t\\t\\tvoice is drowned in the voice of the Crier, who explains\\n\\t\\t\\t\\ttheir state: they are in a state of curse, that is,\\n\\t\\t\\t\\tdeprivation of the grace and mercy of Allah. Such\\n\\t\\t\\t\\tdeprivation is the highest misery that souls can suffer."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "45",
    "NoteID": "1024",
    "Body": "The unrighteous reflect their own crooked minds when the\\n\\t\\t\\t\\tpath of Allah is before them. Instead of going straight,\\n\\t\\t\\t\\tthey try to find something in it that suits their own\\n\\t\\t\\t\\tcrooked ideas. Frankly they have no faith in the final\\n\\t\\t\\t\\tGoal, the Hereafter."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "46",
    "NoteID": "1025",
    "Body": "This is a difficult passage, and Commentators have\\n\\t\\t\\t\\tinterpreted it in different ways. Three distinct schools\\n\\t\\t\\t\\tof thought may be discerned in the interpretation. (1)\\n\\t\\t\\t\\tOne school thinks that the men on the Heights are angels,\\n\\t\\t\\t\\tor such men of exalted spiritual dignity (e.g., the great\\n\\t\\t\\t\\tprophets), as will be able to know the souls at sight as\\n\\t\\t\\t\\tregards their real worth: the Heights will be their\\n\\t\\t\\t\\texalted stations, from which they will welcome the\\n\\t\\t\\t\\trighteous with a salutation of peace, even before the\\n\\t\\t\\t\\trighteous have entered heaven; the salutation of peace\\n\\t\\t\\t\\tbeing itself an assurance of salvation to those whom they\\n\\t\\t\\t\\tsalute. (2) Another school of thought thinks that the men\\n\\t\\t\\t\\ton the Heights are such souls as are not decidedly on the\\n\\t\\t\\t\\tside of merit or decidedly on the side of sin, but evenly\\n\\t\\t\\t\\tbalanced on a partition between heaven and hell. Their\\n\\t\\t\\t\\tcase is yet to be decided, but their salutation to the\\n\\t\\t\\t\\trighteous is a wistful salutation, because they hope for\\n\\t\\t\\t\\tAllah's Mercy."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "47",
    "NoteID": "1026",
    "Body": "Their eyes: according to interpretation (2) of the last\\n\\t\\t\\t\\tnote, \"their\" would refer to the people whose fate has\\n\\t\\t\\t\\tnot yet been decided, and the speech would be theirs;\\n\\t\\t\\t\\taccording to interpretations (1) and (3) in that note,\\n\\t\\t\\t\\t\"their\" would refer to the Companions of the Garden, who\\n\\t\\t\\t\\twould realise the terrible nature of hell, and express\\n\\t\\t\\t\\ttheir horror of it. I prefer the latter. Then the mention\\n\\t\\t\\t\\tof the \"men on the Heights\" and their speech in verse 48\\n\\t\\t\\t\\tcomes in naturally as a different kind of speech from a\\n\\t\\t\\t\\tdifferent kind of men."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "48",
    "NoteID": "1027",
    "Body": "This speech is in three parts: (1) the last lines of this\\n\\t\\t\\t\\tverse are addressed to the Companions of the Fire,\\n\\t\\t\\t\\treminding them (as a bench of judges might speak to a\\n\\t\\t\\t\\tprisoner) of the futility of their wealth and riches and\\n\\t\\t\\t\\tarrogance in their earthly life: (2) the second part, in\\n\\t\\t\\t\\tthe first half of verse 49, recalls to their minds how\\n\\t\\t\\t\\tfalse was their contempt of the good but lowly men who\\n\\t\\t\\t\\tare now to be the inheritors of heaven: and (3) the\\n\\t\\t\\t\\tlatter part of verse 49, \"enter ye the Garden\" is\\n\\t\\t\\t\\taddressed to the Blessed, to give them a welcome to their\\n\\t\\t\\t\\tstate of felicity."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "50",
    "NoteID": "1028",
    "Body": "The Companions of the Fire will thirst for water and not\\n\\t\\t\\t\\tget it, and for sustenance which will not be theirs,\\n\\t\\t\\t\\twhile the Companions of the Garden will have the crystal\\n\\t\\t\\t\\twaters of the springs and rivers and they will enjoy the\\n\\t\\t\\t\\tbliss of Allah's Countenance, which will be their supreme\\n\\t\\t\\t\\tnourishment and the fruit of their life of probation and\\n\\t\\t\\t\\tseeking. These things will not be transferable. Cf. also\\n\\t\\t\\t\\txxxvii. 41-47, 62-67."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "51",
    "NoteID": "1029",
    "Body": "\"Forgetfulness\" may be involuntary, from a defect of\\n\\t\\t\\t\\tmemory, or figuratively, a deliberate turning away from,\\n\\t\\t\\t\\tor ignoring of, something we do not want, as when we say\\n\\t\\t\\t\\tin an argument, \"you conveniently forget that so- and-so\\n\\t\\t\\t\\tis so-and-so.\" Here the latter kind is meant. If men\\n\\t\\t\\t\\tdeliberately ignored the Hereafter in spite of warnings,\\n\\t\\t\\t\\tcan they expect to be received by Allah, Whom they\\n\\t\\t\\t\\tthemselves rejected?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "53",
    "NoteID": "1030",
    "Body": "If those without Faith want to wait and see what happens\\n\\t\\t\\t\\tin the Hereafter, they will indeed learn the truth, but\\n\\t\\t\\t\\tit will be too late for them to profit by it then. All\\n\\t\\t\\t\\tthe false ideals and false gods which they put their\\n\\t\\t\\t\\ttrust upon will leave them in the lurch. If they thought\\n\\t\\t\\t\\tthat the goodness or greatness of others would help them,\\n\\t\\t\\t\\tthey will be undeceived on the day when their personal\\n\\t\\t\\t\\tresponsibility will be enforced. There will be no\\n\\t\\t\\t\\tsalvation except on their own record. How they will then\\n\\t\\t\\t\\twish that they had another chance! But their chance will\\n\\t\\t\\t\\tbe gone."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "54",
    "NoteID": "1031",
    "Body": "A sublime verse, comparable to the Throne Verse ii. 255.\\n\\t\\t\\t\\tAs for the Creation in six days, in xxii. 47, we are told\\n\\t\\t\\t\\tthat a Day in the sight of Allah is like a thousand years\\n\\t\\t\\t\\tof our reckoning, and in lxx. 4, the comparison is with\\n\\t\\t\\t\\t50,000 of our years. In the history of our material\\n\\t\\t\\t\\tearth, we may reckon six great epochs of evolution."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "54",
    "NoteID": "1032",
    "Body": "Here, we are told of the creation of the heavens and the\\n\\t\\t\\t\\tearth in six days. But lest we should be obsessed with\\n\\t\\t\\t\\tthe Jewish idea that Allah rested on the seventh day, we\\n\\t\\t\\t\\tare told that the Creation was but a prelude to Allah's\\n\\t\\t\\t\\twork: for His authority is exercised constantly by the\\n\\t\\t\\t\\tlaws which He establishes and enforces in all parts of\\n\\t\\t\\t\\tHis Creation. The beautiful imagery of night and day\\n\\t\\t\\t\\tseeking out each other in rapid succession is still\\n\\t\\t\\t\\tfurther enforced in the Arabic by the double accusative\\n\\t\\t\\t\\tof the verb yugshi, showing the mutual interactions of\\n\\t\\t\\t\\tthe day and the night, each covering the other in turn.\\n\\t\\t\\t\\tThe heavenly bodies show an order which is evidence of\\n\\t\\t\\t\\tHis constant care and government. Not only that, but it\\n\\t\\t\\t\\tis only He Who creates, maintains, and governs, and no\\n\\t\\t\\t\\tone else."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "55",
    "NoteID": "1033",
    "Body": "In prayer, we must avoid any arrogance or show or\\n\\t\\t\\t\\tloudness, or vanity of requests or words. If excess is\\n\\t\\t\\t\\tcondemned in all things, it is specially worthy of\\n\\t\\t\\t\\tcondemnation when we go humbly before Our Lord,-we poor\\n\\t\\t\\t\\tcreatures before the Omnipotent Who knoweth all."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "56",
    "NoteID": "1034",
    "Body": "The man who prays with humility and earnestness finds the\\n\\t\\t\\t\\tground prepared by Allah for his spiritual advancement.\\n\\t\\t\\t\\tIt is all set in order, and cleared of weeds. He does\\n\\t\\t\\t\\tnot, like the wicked, upset that order, to introduce evil\\n\\t\\t\\t\\tor mischief into it."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "56",
    "NoteID": "1035",
    "Body": "Fear and longing: the fear of Allah is really a fear lest\\n\\t\\t\\t\\twe should diverge from His Will, or do anything which\\n\\t\\t\\t\\twould not be pleasing to Him: unlike ordinary fear, it\\n\\t\\t\\t\\ttherefore brings us nearer to Allah, and in fact\\n\\t\\t\\t\\tnourishes our longing and desire for Him."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "57",
    "NoteID": "1036",
    "Body": "The Parable is complete in its triple significance. (1)\\n\\t\\t\\t\\tIn the physical world the winds go like heralds of glad\\n\\t\\t\\t\\ttidings; they are the advance guard, behind which is\\n\\t\\t\\t\\tcoming the great army of winds driving heavily laden\\n\\t\\t\\t\\tclouds before it; the wise Providence of Allah is their\\n\\t\\t\\t\\tGeneral, who directs them towards a parched land, on\\n\\t\\t\\t\\twhich the clouds deliver their gladdening showers of\\n\\t\\t\\t\\tmercy, which convert the dead land into a living,\\n\\t\\t\\t\\tfertile, and beautiful land bearing a rich harvest. (2)\\n\\t\\t\\t\\tIn the spiritual world, the winds are the great motive\\n\\t\\t\\t\\tforces in the mind of man, or in the world around him,\\n\\t\\t\\t\\tthat bring the clouds or instruments of Allah's Mercy,\\n\\t\\t\\t\\twhich descend and fertilise souls hitherto spiritually\\n\\t\\t\\t\\tdead. (3) If we can see or experience such things in our\\n\\t\\t\\t\\tlife here below, can we doubt the resurrection?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "58",
    "NoteID": "1037",
    "Body": "The triple parable explained in the last note is here\\n\\t\\t\\t\\tcontinued. (1) In the physical world, the fertilising\\n\\t\\t\\t\\tshowers of rain yield a rich harvest on good soil, but\\n\\t\\t\\t\\tbad soil yields little or nothing. (2) In the spiritual\\n\\t\\t\\t\\tworld, also, Allah's Mercies evoke no response in some\\n\\t\\t\\t\\tsouls which have chosen evil. (3) In the final reckoning,\\n\\t\\t\\t\\tthough all will be raised, not all will achieve the\\n\\t\\t\\t\\tfulfilment of their lives."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "58",
    "NoteID": "1038",
    "Body": "Those who are grateful are those who joyfully receive\\n\\t\\t\\t\\tAllah's Message, and respond to it by deeds of\\n\\t\\t\\t\\trighteousness."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "59",
    "NoteID": "1039",
    "Body": "The story of Noah in greater detail will be found in xi.\\n\\t\\t\\t\\t25-49. Here the scheme is to tell briefly the stories of\\n\\t\\t\\t\\tsome of the Prophets between Noah and Moses, and lead up\\n\\t\\t\\t\\tthus to a lesson for the contemporaries of the Prophet\\n\\t\\t\\t\\tMuhammad himself. When Noah attacked the wickedness of\\n\\t\\t\\t\\this generation, he was laughed at for a madman, for he\\n\\t\\t\\t\\tmentioned the Great Day to come in the Hereafter. Allah's\\n\\t\\t\\t\\tretribution came soon afterwards-the great Flood, in\\n\\t\\t\\t\\twhich his unbelieving people were drowned, but he and\\n\\t\\t\\t\\tthose who believed in him and came into the Ark were\\n\\t\\t\\t\\tsaved."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "65",
    "NoteID": "1040",
    "Body": "The 'Ad people, with their prophet Had, are mentioned in\\n\\t\\t\\t\\tmany places. See especially xxvi. 123-140, and xivi.\\n\\t\\t\\t\\t21-26. Their story belongs to Arabian tradition. Their\\n\\t\\t\\t\\teponymous ancestor 'Ad was fourth in generation from\\n\\t\\t\\t\\tNoah, having been a son of 'Aus, the son of Aram, the son\\n\\t\\t\\t\\tof Sam, the son of Noah. They occupied a large tract of\\n\\t\\t\\t\\tcountry in Southern Arabia, extending from Umman at the\\n\\t\\t\\t\\tmouth of the Arabian Gulf to Hadhramaut and Yemen at the\\n\\t\\t\\t\\tsouthern end of the Red Sea. The people were tall in\\n\\t\\t\\t\\tstature and were great builders. Probably the long,\\n\\t\\t\\t\\twinding tracts of sands (ahqaf) in their dominions (xivi.\\n\\t\\t\\t\\t21) were irrigated with canals. They forsook the true\\n\\t\\t\\t\\tGod, and oppressed their people. A three years famine\\n\\t\\t\\t\\tvisited them, but yet they took no warning. At length a\\n\\t\\t\\t\\tterrible blast of wind destroyed them and their land, but\\n\\t\\t\\t\\ta remnant, known as the second 'Ad or the Thamud (see\\n\\t\\t\\t\\tbelow) were saved, and afterwards suffered a similar fate\\n\\t\\t\\t\\tfor their sins. The tomb of the Prophet Hud (qabr Nabi\\n\\t\\t\\t\\tHud) is still traditionally shown in Hadhramaut, latitude\\n\\t\\t\\t\\t16 N, and longitude 49 1/2 E', about 90 miles north of\\n\\t\\t\\t\\tMukalla. There are ruins and inscriptions in the\\n\\t\\t\\t\\tneighbourhood. See \"Hadhramaut, Some of its Mysteries\\n\\t\\t\\t\\tUnveiled,\" by D. van der Meulen and H. von Wissmann,\\n\\t\\t\\t\\tLeyden, 1932."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "71",
    "NoteID": "1041",
    "Body": "The past tense may be understood in three ways. (1) A\\n\\t\\t\\t\\tterrible famine had already afflicted the 'Ad as a\\n\\t\\t\\t\\twarning before they were overwhelmed in the final blast\\n\\t\\t\\t\\tof hot wind (see the last note). (2) The terrible\\n\\t\\t\\t\\tinsolence and sin into which they had fallen was itself a\\n\\t\\t\\t\\tpunishment. (3) The prophetic past is used, as much as to\\n\\t\\t\\t\\tsay: \"Behold! I see a dreadful calamity: it is already on\\n\\t\\t\\t\\tyou!\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "71",
    "NoteID": "1042",
    "Body": "Why dispute over names and imaginary gods, the inventions\\n\\t\\t\\t\\tof your minds? Come to realities. If you ask for the\\n\\t\\t\\t\\tpunishment and are waiting in insolent defiance, what can\\n\\t\\t\\t\\tI do but also wait?-in fear and trembling for you, for I\\n\\t\\t\\t\\tknow that Allah's punishment is sure!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "73",
    "NoteID": "1043",
    "Body": "The Thamud people were the successors to the culture and\\n\\t\\t\\t\\tcivilization of the 'Ad people, for whom see n. 1040 and\\n\\t\\t\\t\\tvii. 65 above. They were cousins to the 'Ad, apparently a\\n\\t\\t\\t\\tyounger branch of the same race. Their story also belongs\\n\\t\\t\\t\\tto Arabian tradition, according to which their eponymous\\n\\t\\t\\t\\tancestor Thamud was a son of 'Abir (a brother of Aram),\\n\\t\\t\\t\\tthe son of Sam, the son of Noah. Their seat was in the\\n\\t\\t\\t\\tnorth-west corner of Arabia (Arabia Petraea), between\\n\\t\\t\\t\\tMadinah and Syria. It included both rocky country (hijr.\\n\\t\\t\\t\\txv. 80), and the spacious fertile valley (Wadi) and\\n\\t\\t\\t\\tplains country of Qura, which begins just north of the\\n\\t\\t\\t\\tCity of Madinah and is traversed by the Hijaz Railway.\\n\\t\\t\\t\\tWhen the holy Prophet in the 9th year of the Hijra led\\n\\t\\t\\t\\this expedition to Tabuk (about 400 miles north of\\n\\t\\t\\t\\tMadinah) against the Roman forces, on a reported Roman\\n\\t\\t\\t\\tinvasion from Syria, he and his men came across the\\n\\t\\t\\t\\tarchaeological remains of the Thamud. The recently\\n\\t\\t\\t\\texcavated rock city of Petra, near Maan, may go back to\\n\\t\\t\\t\\tthe Thamud, though its architecture has many features\\n\\t\\t\\t\\tconnecting it with Egyptian and Graeco-Roman culture\\n\\t\\t\\t\\toverlaying what is called by European writers Nabataean\\n\\t\\t\\t\\tCulture. Who were the Nabataeans? They were an old Arab\\n\\t\\t\\t\\ttribe which played a considerable part in history after\\n\\t\\t\\t\\tthey came into conflict with Antigonus I in 312 B.C.\\n\\t\\t\\t\\tTheir capital was Petra, but they extended their\\n\\t\\t\\t\\tterritory right up to the Euphrates. In 85 B.C. they were\\n\\t\\t\\t\\tlords of Damascus under their king Haritha (Aretas of\\n\\t\\t\\t\\tRoman history). For some time they were allies of the\\n\\t\\t\\t\\tRoman Empire and held the Red Sea littoral. The Emperor\\n\\t\\t\\t\\tTrajan reduced them and annexed their territory in A.D.\\n\\t\\t\\t\\t105. The Nabataeans succeeded the Thamud of Arabian\\n\\t\\t\\t\\ttradition. The Thamud are mentioned by name in an\\n\\t\\t\\t\\tinscription of the Assyrian King Sargon, dated 715 B.C.,\\n\\t\\t\\t\\tas a people of Eastern and Central Arabia (Encyclopaedia\\n\\t\\t\\t\\tof Islam). See also Appendix VII to S. xxvi. With the\\n\\t\\t\\t\\tadvance of material civilisation, the Thamud people\\n\\t\\t\\t\\tbecame godless and arrogant, and were destroyed by an\\n\\t\\t\\t\\tearthquake. Their prophet and warner was Salih, and the\\n\\t\\t\\t\\tcrisis in their history is connected with the story of a\\n\\t\\t\\t\\twonderful she-camel: see next note."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "73",
    "NoteID": "1044",
    "Body": "The story of this wonderful she-camel, that was a sign to\\n\\t\\t\\t\\tthe Thamud, is variously told in tradition. We need not\\n\\t\\t\\t\\tfollow the various versions in the traditional story.\\n\\t\\t\\t\\tWhat we are told in the Qur-an is: that (1) she was a\\n\\t\\t\\t\\tSign or Symbol, which the prophet Salih, used for a\\n\\t\\t\\t\\twarning to the haughty oppressors of the poor: (2) there\\n\\t\\t\\t\\twas scarcity of water, and the arrogant or privileged\\n\\t\\t\\t\\tclasses tried to prevent the access of the poor or their\\n\\t\\t\\t\\tcattle to the springs, while Salih intervened on their\\n\\t\\t\\t\\tbehalf (xxvi. 155, liv. 28); (3) like water, pasture was\\n\\t\\t\\t\\tconsidered a free gift of nature, in this spacious earth\\n\\t\\t\\t\\tof Allah (vii. 73), but the arrogant ones tried to\\n\\t\\t\\t\\tmonopolise the pasture also; (4) this particular\\n\\t\\t\\t\\tshe-camel was made a test case (liv. 27) to see if the\\n\\t\\t\\t\\tarrogant ones would come to reason; (5) the arrogant\\n\\t\\t\\t\\tones, instead of yielding to the reasonable rights of the\\n\\t\\t\\t\\tpeople, ham-strung the poor she- camel and slew her,\\n\\t\\t\\t\\tprobably secretly (xci. 14, liv. 29): the cup of their\\n\\t\\t\\t\\tiniquities was full, and the Thamud people were destroyed\\n\\t\\t\\t\\tby a dreadful earthquake, which threw them prone on the\\n\\t\\t\\t\\tground and buried them with their houses and their fine\\n\\t\\t\\t\\tbuildings."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "75",
    "NoteID": "1045",
    "Body": "As usually happens in such cases, the Believers were the\\n\\t\\t\\t\\tlowly and the humble, and the oppressors were the\\n\\t\\t\\t\\tarrogant, who in selfishly keeping back nature's gifts\\n\\t\\t\\t\\t(which are Allah's gifts) from the people, were deaf to\\n\\t\\t\\t\\tthe dictates of justice and kindness. Salih took the side\\n\\t\\t\\t\\tof the unprivileged, and was therefore himself attacked."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "75",
    "NoteID": "1046",
    "Body": "Notice the relation between the question and the answer.\\n\\t\\t\\t\\tThe godless chiefs wanted to discredit Salih, and put a\\n\\t\\t\\t\\tpersonal question, as much as to say, \"Is he not a liar?\"\\n\\t\\t\\t\\tThe Believers took back the issue to the higher plane, as\\n\\t\\t\\t\\tmuch as to say. \"We know he is a man of Allah, but look\\n\\t\\t\\t\\tat the justice for which he is making a stand: to resist\\n\\t\\t\\t\\tit is to resist Allah\". The answer of the godless was to\\n\\t\\t\\t\\treject Allah in words, and in action to commit a further\\n\\t\\t\\t\\tact of cruelty and injustice in ham-stringing and killing\\n\\t\\t\\t\\tthe she-camel, at the same time hurling defiance at Salih\\n\\t\\t\\t\\tand his God."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "78",
    "NoteID": "1047",
    "Body": "The retribution was not long delayed. A terrible\\n\\t\\t\\t\\tearthquake came and buried the people and destroyed their\\n\\t\\t\\t\\tboasted civilisation. The calamity must have been fairly\\n\\t\\t\\t\\textensive in area and intense in the terror it inspired,\\n\\t\\t\\t\\tfor it is described (liv. 31) as a \"single mighty blast\"\\n\\t\\t\\t\\t(saihatan wahidatan), the sort of terror-inspiring noise\\n\\t\\t\\t\\twhich accompanies all big earthquakes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "79",
    "NoteID": "1048",
    "Body": "Salih was saved by Allah's mercy as a just and righteous\\n\\t\\t\\t\\tman. His speech here may be either a parting warning, or\\n\\t\\t\\t\\tit may be a soliloquy lamenting the destruction of his\\n\\t\\t\\t\\tpeople for their sin and folly."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "80",
    "NoteID": "1049",
    "Body": "Lut is the Lot of the English Bible. His story is\\n\\t\\t\\t\\tbiblical, but freed from some shameful features which are\\n\\t\\t\\t\\ta blot on the biblical narrative, (e.g., see Gen. xix.\\n\\t\\t\\t\\t30-36). He was a nephew of Abraham, and was sent as a\\n\\t\\t\\t\\tProphet and warner to the people of Sodom and Gomorrah,\\n\\t\\t\\t\\tcities utterly destroyed for their unspeakable sins. They\\n\\t\\t\\t\\tcannot be exactly located, but it may be supposed that\\n\\t\\t\\t\\tthey were somewhere in the plain cast of the Dead Sea.\\n\\t\\t\\t\\tThe story of their destruction is told in the 19th\\n\\t\\t\\t\\tchapter of Genesis. Two angels in the shape of handsome\\n\\t\\t\\t\\tyoung men came to Lot in the evening and became his\\n\\t\\t\\t\\tguests by night. The inhabitants of Sodom in their lust\\n\\t\\t\\t\\tfor unnatural crime invaded Lot's house but were\\n\\t\\t\\t\\trepulsed. In the morning, the angels warned Lot to escape\\n\\t\\t\\t\\twith his family. \"Then the Lord rained upon Sodom and\\n\\t\\t\\t\\tupon Gomorrah brimstone and fire from the Lord out of\\n\\t\\t\\t\\theaven; and He overthrew those cities, and all the plain,\\n\\t\\t\\t\\tand all the inhabitants of the cities, and that which\\n\\t\\t\\t\\tgrew upon the ground. But his wife looked back from\\n\\t\\t\\t\\tbehind him, and she became a pillar of salt.\" (Gen. xix.\\n\\t\\t\\t\\t24-26). Note that Lot's people are the people to whom he\\n\\t\\t\\t\\tis sent on a mission. He was not one of their own\\n\\t\\t\\t\\tbrethren, as was Salih or Shu'aib. But he looked upon his\\n\\t\\t\\t\\tpeople as his brethren (I. 13), as a man of God always\\n\\t\\t\\t\\tdoes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "82",
    "NoteID": "1050",
    "Body": "An instance of the withering sarcasm that hardened\\n\\t\\t\\t\\tsinners use against the righteous. They wound with words,\\n\\t\\t\\t\\tand follow up the insult with deeds of injustice,\\n\\t\\t\\t\\tthinking that they would bring the righteous into\\n\\t\\t\\t\\tdisgrace. But Allah looks after His own, and in the end,\\n\\t\\t\\t\\tthe wicked themselves are overthrown when the cup of\\n\\t\\t\\t\\ttheir iniquity is full."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "83",
    "NoteID": "1051",
    "Body": "In the biblical narrative she looks back, a physical act\\n\\t\\t\\t\\t(see n. 1049): here she is a type of those who lag\\n\\t\\t\\t\\tbehind, i.e, whose mental and moral attitude, in spite of\\n\\t\\t\\t\\ttheir association with the righteous, is to hark back to\\n\\t\\t\\t\\tthe glitter of wickedness and sin. The righteous should\\n\\t\\t\\t\\thave one sole objective, the Way of Allah. They should\\n\\t\\t\\t\\tnot took behind, nor yet to the right or the left."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "84",
    "NoteID": "1052",
    "Body": "The shower is expressly stated in Q. xi. 82 to have been\\n\\t\\t\\t\\tof stones. In xv. 73-74, we are told that there was a\\n\\t\\t\\t\\tterrible blast or noise (saihat) in addition to the\\n\\t\\t\\t\\tshower of stones. Taking these passages into\\n\\t\\t\\t\\tconsideration along with Gen. xix. 24. (see n. 1049\\n\\t\\t\\t\\tabove), I think it is legitimate to translate: \"a shower\\n\\t\\t\\t\\tof brimstone.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "85",
    "NoteID": "1053",
    "Body": "\"Madyan\" may be identified with \"Midian\". Midian and the\\n\\t\\t\\t\\tMidianites are frequently mentioned in the Old Testament,\\n\\t\\t\\t\\tthough the particular incident here mentioned belongs to\\n\\t\\t\\t\\tArab rather than to Jewish tradition. The Midianites were\\n\\t\\t\\t\\tof Arab race, though, as neighbours of the Canaanites,\\n\\t\\t\\t\\tthey probably intermixed with them. They were a wandering\\n\\t\\t\\t\\ttribe: it was Midianite merchants to whom Joseph was sold\\n\\t\\t\\t\\tinto slavery, and who took him to Egypt. Their principal\\n\\t\\t\\t\\tterritory in the time of Moses was in the northeast of\\n\\t\\t\\t\\tthe Sinai Peninsula, and east of the Amalekites. Under\\n\\t\\t\\t\\tMoses the Israelites waged a war of extermination against\\n\\t\\t\\t\\tthem: they slew the kings of Midian, slaughtered all the\\n\\t\\t\\t\\tmales, burnt their cities and castles, and captured their\\n\\t\\t\\t\\tcattle (Num. xxxi, 7-1 1). This sounds like total\\n\\t\\t\\t\\textermination. Yet a few generations afterwards, they\\n\\t\\t\\t\\twere so powerful that the Israelites for their sins were\\n\\t\\t\\t\\tdelivered into the captivity of the Midianites for seven\\n\\t\\t\\t\\tyears: both the Midianites and their camels were without\\n\\t\\t\\t\\tnumber: and the Israelites hid from them in \"dens.....\\n\\t\\t\\t\\tcaves, and strongholds\" (Judges vii. 1- 6). Gideon\\n\\t\\t\\t\\tdestroyed them again, (Judges vii. 1-25), say about two\\n\\t\\t\\t\\tcenturies after Moses. As the decisive battle was near\\n\\t\\t\\t\\tthe hill of Moreh, not far south of Mount Tabor, we may\\n\\t\\t\\t\\tlocalise the Midianites on this occasion in the northern\\n\\t\\t\\t\\tparts of the Jordan valley, at least 200 miles north of\\n\\t\\t\\t\\tthe Sinai Peninsula. This and the previous destruction\\n\\t\\t\\t\\tunder Moses were local, and mention no town of Midian. In\\n\\t\\t\\t\\tlater times there was a town of Madyan on the cast side\\n\\t\\t\\t\\tof the Gulf of 'Aqaba. It is mentioned in Josephus,\\n\\t\\t\\t\\tEusebius, and Ptolemy: (Encyclopaedia of Islam). Then it\\n\\t\\t\\t\\tdisappears from geography. In Muslim times it was a\\n\\t\\t\\t\\trevived town with quite a different kind of population,\\n\\t\\t\\t\\tbut it never flourished. The Midianites disappeared from\\n\\t\\t\\t\\thistory."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "85",
    "NoteID": "1054",
    "Body": "Shu'aib belongs to Arab rather than to Jewish tradition,\\n\\t\\t\\t\\tto which he is unknown. His identification with Jethro,\\n\\t\\t\\t\\tthe father-in-law of Moses, has no warrant, and I reject\\n\\t\\t\\t\\tit. There is no similarity either in names or incidents,\\n\\t\\t\\t\\tand there are chronological difficulties (see n. 1064\\n\\t\\t\\t\\tbelow). If, as the Commentators tell us, Shuaib was in\\n\\t\\t\\t\\tthe fourth generation from Abraham, being a\\n\\t\\t\\t\\tgreat-grandson of Madyan (a son of Abraham), he would be\\n\\t\\t\\t\\tonly about a century from the time of Abraham, whereas\\n\\t\\t\\t\\tthe Hebrew Bible would give us a period of four to six\\n\\t\\t\\t\\tcenturies between Abraham and Moses. The mere fact that\\n\\t\\t\\t\\tJathro was a Midianite and that another name, Hobab, is\\n\\t\\t\\t\\tmentioned for a father-in-law of Moses in Num x. 29, is\\n\\t\\t\\t\\tslender ground for identificaion. As the Midianites were\\n\\t\\t\\t\\tmainly a nomad tribe, we need not be surprised that their\\n\\t\\t\\t\\tdestruction in one or two settlements did not affect\\n\\t\\t\\t\\ttheir life in wandering sections of the tribe in other\\n\\t\\t\\t\\tgeographical regions. Shu'aib's mission was apparently in\\n\\t\\t\\t\\tone of the settled towns of the Midianites, which was\\n\\t\\t\\t\\tcompletely destroyed by an earthquake (vii. 91). If this\\n\\t\\t\\t\\thappened in the century after Abraham, there is no\\n\\t\\t\\t\\tdifficulty in supposing that they were again a numerous\\n\\t\\t\\t\\ttribe, three or five centuries later, in the time of\\n\\t\\t\\t\\tMoses (see last note). As they were a mixed wandering\\n\\t\\t\\t\\ttribe, both their resilience and their eventual\\n\\t\\t\\t\\tabsorption can be easily understood. But the destruction\\n\\t\\t\\t\\tof the settlement or settlements (if the Wood or Aika was\\n\\t\\t\\t\\ta separate settlement, see n. 2000 to xv. 78) to which\\n\\t\\t\\t\\tShu'aib was sent to preach was complete, and no traces of\\n\\t\\t\\t\\tit now remain. The name of the highest mountain of Yemen,\\n\\t\\t\\t\\tNabi Shu'aib (11,000 ft.) has probably no connection with\\n\\t\\t\\t\\tthe geographical territory of the nomad Midianites,\\n\\t\\t\\t\\tunless we suppose that their wanderings extended so far\\n\\t\\t\\t\\tsouth from the territories mentioned in the last note."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "86",
    "NoteID": "1055",
    "Body": "The Midianites were in the path of a commercial highway\\n\\t\\t\\t\\tof Asia, viz., that between two such opulent and highly\\n\\t\\t\\t\\torganised nations as Egypt and the Mesopotamian group\\n\\t\\t\\t\\tcomprising Assyria and Babylonia. Their besetting sins\\n\\t\\t\\t\\tare thus characterised here: (1) giving short measure or\\n\\t\\t\\t\\tweight, whereas the strictest commercial probity is\\n\\t\\t\\t\\tnecessary for success, (2) a more general form of such\\n\\t\\t\\t\\tfraud, depriving people of rightful dues, (3) producing\\n\\t\\t\\t\\tmishchief and disorder, whereas peace and order had been\\n\\t\\t\\t\\testablished (again in a literal as well as a metaphorical\\n\\t\\t\\t\\tsense); (4) not content with upsetting settled life,\\n\\t\\t\\t\\ttaking to highway robbery, literally as well as (5)\\n\\t\\t\\t\\tmetaphorically, in two ways, viz., cutting off people\\n\\t\\t\\t\\tfrom access to the worship of Allah, and abusing religion\\n\\t\\t\\t\\tand piety for crooked purposes, i.e., exploiting religion\\n\\t\\t\\t\\titself for their crooked ends, as when a man builds\\n\\t\\t\\t\\thouses of prayer out of unlawful gains or ostentatiously\\n\\t\\t\\t\\tgives charity out of money which he has obtained by force\\n\\t\\t\\t\\tor fraud, etc. After setting out this catalogue of\\n\\t\\t\\t\\tbesetting sins Shu'aib makes two appeals to the past: (1)\\n\\t\\t\\t\\tYou began as an insignificant tribe, and by Allah's\\n\\t\\t\\t\\tfavour you increased and multiplied in numbers and\\n\\t\\t\\t\\tresources: do you not then owe a duty to Allah to fulfil\\n\\t\\t\\t\\tHis Law? (2) What was the result in the case of those who\\n\\t\\t\\t\\tfell into sin? Will you not take warning by their\\n\\t\\t\\t\\texample? So Shu'aib began his argument with faith in\\n\\t\\t\\t\\tAllah as the source of all virtue, and ended it with\\n\\t\\t\\t\\tdestruction as the result of all sin. In the next verse\\n\\t\\t\\t\\the pleads with them to end their controversies and come\\n\\t\\t\\t\\tto Allah."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "87",
    "NoteID": "1056",
    "Body": "Madyan is torn by internal conflict. Shu'aib comes as a\\n\\t\\t\\t\\tpeace-maker, not in virtue of his own wisdom, but by\\n\\t\\t\\t\\tappeal to the truth, righteousness and justice of God. As\\n\\t\\t\\t\\twe see later, the real motives of his opponents were\\n\\t\\t\\t\\tselfishness, arrogance, violence, lawlessness, and\\n\\t\\t\\t\\tinjustice. But he appeals to their better nature, and is\\n\\t\\t\\t\\tprepared to argue on the basis that the party which wants\\n\\t\\t\\t\\tto suppress those who believe in God's Message and in\\n\\t\\t\\t\\trighteousness, has some sincere mental difficulty in\\n\\t\\t\\t\\taccepting Shu'aib's mission, \"If,\" he says to them, \"that\\n\\t\\t\\t\\tis the case, do you think it justifies your intolerance,\\n\\t\\t\\t\\tyour violence, or your persecution? On the contrary,\\n\\t\\t\\t\\tevents will prove by themselves who is right and who is\\n\\t\\t\\t\\twrong.\" To the small band who believe in his mission and\\n\\t\\t\\t\\tfollow his teaching, he would preach patience and\\n\\t\\t\\t\\tperseverance. His argument to them would be: \"You have\\n\\t\\t\\t\\tfaith; surely your faith is strong enough to sustain you\\n\\t\\t\\t\\tin the hope that Allah's truth will triumph in the end;\\n\\t\\t\\t\\tthere is no cause for despair or dejection.\" How exactly\\n\\t\\t\\t\\tthese past experiences fit the times of our holy guide\\n\\t\\t\\t\\tMuhammad! And it is for that analogy and that lesson that\\n\\t\\t\\t\\tthe stories of Noah, Hud, Salih, Lut, and Shuaib are\\n\\t\\t\\t\\trelated to us,-all different, and yet all pointing to the\\n\\t\\t\\t\\tgreat lessons in Muhammad's life."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "87",
    "NoteID": "1057",
    "Body": "See the argument in the last note. Allah's decision may\\n\\t\\t\\t\\tcome partly in this very life, either for the same\\n\\t\\t\\t\\tgeneration or for succeeding generations, by the logic of\\n\\t\\t\\t\\texternal events. But in any case it is bound to come\\n\\t\\t\\t\\tspiritually on a higher plane eventually, when the\\n\\t\\t\\t\\trighteous will be comforted and the sinners will be\\n\\t\\t\\t\\tconvinced of sin from their own inner conviction."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "88",
    "NoteID": "1058",
    "Body": "The gentle, all-persuasive arguments of Shuaib fell on\\n\\t\\t\\t\\thard hearts. Their only reply was: \"Turn him out!-him and\\n\\t\\t\\t\\this people.\" When courtesy and a plea for toleration are\\n\\t\\t\\t\\tpitted against bigotry, what room is there for logic? But\\n\\t\\t\\t\\tbigotry and unrighteousness havc their own crooked ways\\n\\t\\t\\t\\tof pretending to be tolerant. \"O yes!\" they said, \"we are\\n\\t\\t\\t\\tvery tolerant and long-suffering! But we are for our\\n\\t\\t\\t\\tcountry and religion. Come back to the ways of our\\n\\t\\t\\t\\tfathers, and we shall graciously forgive you!\" \"Ways of\\n\\t\\t\\t\\ttheir fathers!\"- they meant injustice and oppression,\\n\\t\\t\\t\\thigh-handedness to the poor and the weak, fraud under\\n\\t\\t\\t\\tcover of religion, and so on! Perhaps the righteous were\\n\\t\\t\\t\\tthe poor and the weak. Were they likely to love such\\n\\t\\t\\t\\tways? Perhaps there was implied a bribe as well as a\\n\\t\\t\\t\\tthreat. \"If you come back and wink at our iniquities, you\\n\\t\\t\\t\\tshall have scraps of prosperity thrown at you. If not,\\n\\t\\t\\t\\tout you go in disgrace!\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "89",
    "NoteID": "1059",
    "Body": "The answer of the righteous is threefold. (1) \"Coming\\n\\t\\t\\t\\tback is all very well. But do you mean that we should\\n\\t\\t\\t\\tpractise the vices we detest?\" (2) \"You want us to lie\\n\\t\\t\\t\\tagainst our conscience and our Lord, after we have seen\\n\\t\\t\\t\\tthe evil of your ways.\" (3) \"Neither bribes nor threats,\\n\\t\\t\\t\\tnor specious appeals to patriotism or ancestral religion\\n\\t\\t\\t\\tcan move us: the matter rests with Allah, Whose will and\\n\\t\\t\\t\\tpleasure we obey, and on Whom alone we rely. His\\n\\t\\t\\t\\tknowledge will search out all your specious pretences.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "89",
    "NoteID": "1060",
    "Body": "This, of course, does not mean that anyone can ever\\n\\t\\t\\t\\treturn to evil ways with Allah's consent. Shu'aib has\\n\\t\\t\\t\\talready emphatically repudiated the idea of returning \"to\\n\\t\\t\\t\\tyour ways after Allah hath rescued us therefrom.\" But\\n\\t\\t\\t\\teven if their ways had been good, the human will, he goes\\n\\t\\t\\t\\ton to say, has no data to rely upon, and he and his\\n\\t\\t\\t\\tfollowers would only be guided by Allah's Will and Plan."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "89",
    "NoteID": "1061",
    "Body": "Having answered the insincere quibblers among the\\n\\t\\t\\t\\tgodless, the righteous turn to Allah in earnest prayer.\\n\\t\\t\\t\\tThe endless controversies in this world about abstract or\\n\\t\\t\\t\\tspeculative things never end even where both sides are\\n\\t\\t\\t\\tsincere in their beliefs. The decision must be taken to\\n\\t\\t\\t\\tAllah, Who sits on the throne of Truth, and Whose\\n\\t\\t\\t\\tdecisions will, therefore, be free from the errors and\\n\\t\\t\\t\\timperfections of all human judgment. The sincere have\\n\\t\\t\\t\\tnothing to fear in the appeal to Him, as their motives\\n\\t\\t\\t\\tare pure."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "90",
    "NoteID": "1062",
    "Body": "The answer of the Unbelievers is characteristic. As all\\n\\t\\t\\t\\ttheir bribes and subtleties have failed, they resort to\\n\\t\\t\\t\\tthreats, which are worse than the argument of the stick.\\n\\t\\t\\t\\t\"All right,\" they say, \"there is nothing but ruin before\\n\\t\\t\\t\\tyou!\" That means that the Believers will be persecuted,\\n\\t\\t\\t\\theld up to obloquy, ostracised, and prevented from access\\n\\t\\t\\t\\tto all means of honourable livelihood; their families and\\n\\t\\t\\t\\tdependants will be insulted, reviled, and tortured, if\\n\\t\\t\\t\\tthey could but be got into the enemy's power: their homes\\n\\t\\t\\t\\tdestroyed, and their names held up to ridicule and\\n\\t\\t\\t\\tcontempt even when they are gone. But, as verse 92 says,\\n\\t\\t\\t\\ttheir wicked designs recoiled on themselves; it was the\\n\\t\\t\\t\\twicked who were ruined and blotted out."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "91",
    "NoteID": "1063",
    "Body": "The fate of the Madyan people is described in the same\\n\\t\\t\\t\\tterms as that of the Thamud in verse 78 above. An\\n\\t\\t\\t\\tearthquake seized them by night, and they were buried in\\n\\t\\t\\t\\ttheir own homes, no longer to vex Allah's earth. But a\\n\\t\\t\\t\\tsupplementary detail is mentioned in xxvi. 189, \"the\\n\\t\\t\\t\\tpunishment of a day of overshadowing gloom,\" which may be\\n\\t\\t\\t\\tunderstood to mean a shower of ashes and cinders\\n\\t\\t\\t\\taccompanying a volcanic eruption. Thus a day of terror\\n\\t\\t\\t\\tdrove them into their homes, and the earthquake finished\\n\\t\\t\\t\\tthem. The lament of Shu'aib in verse 93 is almost the\\n\\t\\t\\t\\tsame as that of Salih in verse 79, with two differences:\\n\\t\\t\\t\\t(1) Shu'aib's messages attacked the many sins of his\\n\\t\\t\\t\\tpeople (see n. 1055) and are, therefore, expressed in the\\n\\t\\t\\t\\tplural, while Salih's fight was chiefly against selfish\\n\\t\\t\\t\\tarrogance, and his message is expressed in the singular;\\n\\t\\t\\t\\t(2) the Thamud were the more cultured people of the two,\\n\\t\\t\\t\\tand perished in their own pride; as Salih said, \"ye love\\n\\t\\t\\t\\tnot good counsellors\"; the Midianites were a rougher\\n\\t\\t\\t\\tpeople, and their minds were less receptive of argument\\n\\t\\t\\t\\tor faith; as Shu'aib said, they were a people who\\n\\t\\t\\t\\t\"refused to believe.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "93",
    "NoteID": "1064",
    "Body": "Can we get any idea of the chronological place of the\\n\\t\\t\\t\\tdestruction of the Midianites? In n. 1053 (vii. 85) we\\n\\t\\t\\t\\thave discussed the geographical aspects. The following\\n\\t\\t\\t\\tconsiderations will help us in getting some idea of their\\n\\t\\t\\t\\tperiod. (1) The stories of Noah, Hud, Salih, Lut, and\\n\\t\\t\\t\\tShu'aib seem to be in chronological order. Therefore\\n\\t\\t\\t\\tShu'aib came after Abraham, whose nephew Lut was. (2) If\\n\\t\\t\\t\\tShu'aib was in the fourth generation from Abraham, (see\\n\\t\\t\\t\\tn. 1590 to xi. 80), it would be impossible for him to\\n\\t\\t\\t\\thave been a contemporary of Moses, who came many\\n\\t\\t\\t\\tcenturies later. This difficulty is recognised by Ibn\\n\\t\\t\\t\\tKathir and other classical commentators. (3) The\\n\\t\\t\\t\\tidentification of Shu'aib with Jethro the father-in-law\\n\\t\\t\\t\\tof Moses is without warrant; see n. 1054 (vii. 85). (4)\\n\\t\\t\\t\\tShu'aib must have been before Moses; see vii. 103. (5)\\n\\t\\t\\t\\tThe Midianites who were destroyed by Moses and by Gideon\\n\\t\\t\\t\\tafter him (n. 1053) were local remnants, as we may speak\\n\\t\\t\\t\\tof the Jews at the present day; but their existence as a\\n\\t\\t\\t\\tnation in their original home-lands seems to have ended\\n\\t\\t\\t\\tbefore Moses: \"they became as if they had never been in\\n\\t\\t\\t\\tthe homes where they had flourished\" (vii. 92). (6)\\n\\t\\t\\t\\tJosephus, Eusebius, and Ptolemy mention a town of Madyan,\\n\\t\\t\\t\\tbut it was not of any importance (n. 1053). (7) After the\\n\\t\\t\\t\\tfirst centuries of the Christian era, Madyan as a town\\n\\t\\t\\t\\tappears as an unimportant place resting on its past."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "94",
    "NoteID": "1065",
    "Body": "Man was originally created pure. The need of a prophet\\n\\t\\t\\t\\tarises when there is some corruption and iniquity, which\\n\\t\\t\\t\\the is sent to combat. His coming means much trial and\\n\\t\\t\\t\\tsuffering, especially to those who join him in his\\n\\t\\t\\t\\tprotest against wrong. Even so peaceful a prophet as\\n\\t\\t\\t\\tJesus said; \"I came not to send peace but a sword\" (Matt.\\n\\t\\t\\t\\tx. 34). But it is all in Allah's Plan, for we must learn\\n\\t\\t\\t\\thumility if we would be worthy of Him."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "95",
    "NoteID": "1066",
    "Body": "Allah gives enough rope to the sinful. They grow and\\n\\t\\t\\t\\tmultiply, and become scornful. Neither suffering nor\\n\\t\\t\\t\\taffluence teaches them the lessons which they are meant\\n\\t\\t\\t\\tto learn, viz., patience and humility, gratitude and\\n\\t\\t\\t\\tkindness to others. They take adversity and prosperity\\n\\t\\t\\t\\talike as a matter of chance. \"O yes!\" they say, \"such\\n\\t\\t\\t\\tthings have happened in all ages! Our fathers had such\\n\\t\\t\\t\\texperience before us, and our sons will have them after\\n\\t\\t\\t\\tus. Thus goes on the world for all time!\" But does it?\\n\\t\\t\\t\\tWhat about the decree of Allah? They are found napping\\n\\t\\t\\t\\twhen Nemesis overtakes them in the midst of their impious\\n\\t\\t\\t\\ttomfoolery!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "97",
    "NoteID": "1067",
    "Body": "This and the two following verses should be read\\n\\t\\t\\t\\ttogether. They furnish a commentary on the story of the\\n\\t\\t\\t\\tfive prophets that has already been related. Allah's\\n\\t\\t\\t\\twrath may come by night or by day, whether people are\\n\\t\\t\\t\\tarrogantly defying Allah's laws or are sunk in lethargy\\n\\t\\t\\t\\tor vain dreams of unreality. Who can escape Allah's\\n\\t\\t\\t\\tdecree, and who can feel themselves outside it except\\n\\t\\t\\t\\tthose who are seeking their own ruin?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "99",
    "NoteID": "1068",
    "Body": "This closes that chapter of the narrative which deals\\n\\t\\t\\t\\twith Prophets who were rejected by their own people, but\\n\\t\\t\\t\\twho stood firm on Allah's message and were able to rescue\\n\\t\\t\\t\\ta remnant who believed. In each case there were special\\n\\t\\t\\t\\tcircumstances and special besetting sins, which have been\\n\\t\\t\\t\\texplained in the notes. The nations which as a body could\\n\\t\\t\\t\\tnot be won over to Allah's Law perished. So far we have\\n\\t\\t\\t\\tbeen dealing with the corruptions and iniquities within\\n\\t\\t\\t\\teach nation. In the story of Moses we have first a\\n\\t\\t\\t\\tstruggle against the bondage of Egypt, one of the\\n\\t\\t\\t\\tforemost powers then in the world, the rescue of the\\n\\t\\t\\t\\tIsraelites and their wanderings, and their proving\\n\\t\\t\\t\\tthemselves unworthy and being left to wander in a new\\n\\t\\t\\t\\tsense when they rejected the new Prophet (Muhammad) who\\n\\t\\t\\t\\tcame to renew Allah's Message."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "100",
    "NoteID": "1069",
    "Body": "The stories which have been related should give a warning\\n\\t\\t\\t\\tto present and future generations which have inherited\\n\\t\\t\\t\\tthe land, the power, or the experience of the past. They\\n\\t\\t\\t\\tshould know that if they fall into the same sins they\\n\\t\\t\\t\\twill meet with the same fate: when through their\\n\\t\\t\\t\\tcontumacy their hearts are hardened, they do not listen\\n\\t\\t\\t\\tto the advice that falls on their ears."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "101",
    "NoteID": "1070",
    "Body": "Those who have heard the Message and rejected it find it\\n\\t\\t\\t\\tmore difficult afterwards to retrace their steps. Evil\\n\\t\\t\\t\\thas blocked the channels of Allah's grace to them. It\\n\\t\\t\\t\\tbegins with their breaking their Covenant with Allah;\\n\\t\\t\\t\\twith each step afterwards they fall deeper and deeper\\n\\t\\t\\t\\tinto the mire."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "104",
    "NoteID": "1071",
    "Body": "The story of Moses is told in many places in the Holy\\n\\t\\t\\t\\tQur-an, with a special lesson in each context. In ii.\\n\\t\\t\\t\\t49-71, the story is an appeal to the Jews from their own\\n\\t\\t\\t\\tscripture and traditions, to show their true place in the\\n\\t\\t\\t\\treligious history of mankind, and how they forfeited it.\\n\\t\\t\\t\\tHere we have an instructive parallelism in that story to\\n\\t\\t\\t\\tthe story of Muhammad's mission,-how both these men of\\n\\t\\t\\t\\tAllah had to fight against (1) a foreign foe, arrogant,\\n\\t\\t\\t\\tunjust, faithless, and superstitious, and (2) against the\\n\\t\\t\\t\\tsame class of internal foe among their own people. Both\\n\\t\\t\\t\\tof them won through. In the case of Moses, the foreign\\n\\t\\t\\t\\tfoe was Pharaoh and his Egyptians, who boasted of their\\n\\t\\t\\t\\tcarlier and superior civilisation; in the case of the\\n\\t\\t\\t\\tProphet Muhammad the foreign foes were the Jews\\n\\t\\t\\t\\tthemselves and the Christians of his day. Moses led his\\n\\t\\t\\t\\tpeople nearly to the land of promise in spite of\\n\\t\\t\\t\\trebellions among his own people; Muhammad succecded\\n\\t\\t\\t\\tcompletely in overcoming the resistance of his own people\\n\\t\\t\\t\\tby his own virtues and firmness of character, and by the\\n\\t\\t\\t\\tguidance of Allah. What was a hope when these Makkan\\n\\t\\t\\t\\tverses were revealed became an accomplishment before the\\n\\t\\t\\t\\tend of his life and mission on earth."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "104",
    "NoteID": "1072",
    "Body": "\"Pharaoh\" (Arabic, Fir'aun) is a dynastic title, not the\\n\\t\\t\\t\\tname of any particular king in Egypt. It has been traced\\n\\t\\t\\t\\tto the ancient Hieroglyphic words, Per-aa, which mean\\n\\t\\t\\t\\t\"Great House.\" The nun is an \"infirm\" letter added in the\\n\\t\\t\\t\\tprocess of Arabisation. Who was the Pharaoh in the story\\n\\t\\t\\t\\tof Moses? If the Inscriptions had helped us, we could\\n\\t\\t\\t\\thave answered with some confidence, but unfortunately the\\n\\t\\t\\t\\tInscriptions fail us. It is probable that it was an early\\n\\t\\t\\t\\tPharaoh of the XVIIIth Dynasty, say Thothmes 1, about\\n\\t\\t\\t\\t1540 B.C. See appendix IV on Egyptian Chronology and\\n\\t\\t\\t\\tIsrael, printed at the end of this Sura."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "105",
    "NoteID": "1073",
    "Body": "Notice that Moses, in addressing Pharaoh and the\\n\\t\\t\\t\\tEgyptians, claims his mission to be not from his God, or\\n\\t\\t\\t\\this people's God but from \"your Lord,\" from \"the Lord of\\n\\t\\t\\t\\tthe Worlds.\" And his mission is not to his people only:\\n\\t\\t\\t\\t\"I come unto you (Egyptian people) from your Lord.\" \"The\\n\\t\\t\\t\\tspirit of our version is entirely different from the\\n\\t\\t\\t\\tspirit of the same story as told in the Old Testament\\n\\t\\t\\t\\t(Exod. chapters i. to xv.). In Exod. iii. 18, the mission\\n\\t\\t\\t\\tof Moses is expressed to be as from \"the Lord God of the\\n\\t\\t\\t\\tHebrews.\" The essence of the whole Islamic story is this:\\n\\t\\t\\t\\tJoseph's sufferings and good fortune were not merely a\\n\\t\\t\\t\\tstory in a romance. Joseph was a prophet; his sufferings\\n\\t\\t\\t\\tand his subsequent rise to power and position in Egypt\\n\\t\\t\\t\\twere to be a lesson (a) to his wicked brothers who sold\\n\\t\\t\\t\\thim into slavery, (b) to his people who were stricken\\n\\t\\t\\t\\twith famine and found a welcome in Egypt, and (c) to the\\n\\t\\t\\t\\tEgyptians, who were arrogant over their high material\\n\\t\\t\\t\\tcivilisation, but had yet to be taught the pure faith of\\n\\t\\t\\t\\tAbraham. Israel prospered in Egypt, and stayed there\\n\\t\\t\\t\\tperhaps two to four centuries. (Renan allows only one\\n\\t\\t\\t\\tcentury). Times changed, and the racial bigotry of the\\n\\t\\t\\t\\tEgyptians showed its head again, and Israel was\\n\\t\\t\\t\\toppressed. Moses was raised up with a threefold mission\\n\\t\\t\\t\\tagain (a) to learn all the learning of the Egyptians and\\n\\t\\t\\t\\tpreach Allah's Truth to them as one who had been brought\\n\\t\\t\\t\\tup among themselves, (b) to unite and reclaim his own\\n\\t\\t\\t\\tpeople, and (c) to rescue them and lead them to a new\\n\\t\\t\\t\\tworld, which was to open out their spiritual horizon and\\n\\t\\t\\t\\tlead them to the Psalms of David and the glories of\\n\\t\\t\\t\\tSolomon."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "106",
    "NoteID": "1074",
    "Body": "The ensuing dialogue shows the psychology on the two\\n\\t\\t\\t\\tsides. Pharaoh is sitting in his court, with his\\n\\t\\t\\t\\tministers and chiefs around him. In their arrogance they\\n\\t\\t\\t\\tare only amused at the effrontery and apparent revolt of\\n\\t\\t\\t\\tthe Israelite leaders, and they rely upon their own\\n\\t\\t\\t\\tsuperior worldly power, aided by the magic which was a\\n\\t\\t\\t\\tpart of the Egyptian religion. Confronting them stand two\\n\\t\\t\\t\\tmen, Moses with his mission from Allah, and his brother\\n\\t\\t\\t\\tAaron who was his lieutenant. They are confident, not in\\n\\t\\t\\t\\ttheir own powers, but in the mission they had received.\\n\\t\\t\\t\\tThe first thing they have to do is to act on the\\n\\t\\t\\t\\tsubjective mind of the Egyptians, and by methods which by\\n\\t\\t\\t\\tAllah's miracle show that Egyptian magic was nothing\\n\\t\\t\\t\\tbefore the true power of Allah."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "107",
    "NoteID": "1075",
    "Body": "The serpent played a large part in Egyptian mythology.\\n\\t\\t\\t\\tThe great sun-god Ra won a great victory over the serpent\\n\\t\\t\\t\\tApophis, typifying the victory of light over darkness.\\n\\t\\t\\t\\tMany of their gods and goddesses took the forms of snakes\\n\\t\\t\\t\\tto impress their foes with terror. Moses's rod as a type\\n\\t\\t\\t\\tof a serpent at once appealed to the Egyptian mentality.\\n\\t\\t\\t\\tThe contempt which the Egyptians had entertained in their\\n\\t\\t\\t\\tminds before was converted into terror. Here was some one\\n\\t\\t\\t\\twho could control the reptile which their great god Ra\\n\\t\\t\\t\\thimself had such difficulty in overcoming!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "108",
    "NoteID": "1076",
    "Body": "But the second Sign displayed by Moses was even more\\n\\t\\t\\t\\tpuzzling to the Egyptians. Moses drew out his hand from\\n\\t\\t\\t\\tthe folds of the garments on his breast, and it was white\\n\\t\\t\\t\\tand shining as with divine light! This was to counter any\\n\\t\\t\\t\\tsuggestions of evil, which the serpent might have\\n\\t\\t\\t\\tcreated. This was no work of evil, of black magic, or a\\n\\t\\t\\t\\ttrick or illusion. His hand was transfigured with a light\\n\\t\\t\\t\\twhich no Egyptian sorcerers could produce. In Islamic\\n\\t\\t\\t\\tliterature the \"white hand\" of Moses has passed into a\\n\\t\\t\\t\\tproverb, for a symbol of divine glory dazzling to the\\n\\t\\t\\t\\tbeholders."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "110",
    "NoteID": "1077",
    "Body": "The two Signs had the desired effect on the Egyptians.\\n\\t\\t\\t\\tThey were impressed, but they judged them by their own\\n\\t\\t\\t\\tstandards. They thought to themselves, \"These are\\n\\t\\t\\t\\tordinary sorcerers: let us search out our best sorcerers\\n\\t\\t\\t\\tand show them that they have superior power.\" But like\\n\\t\\t\\t\\tall worldly people, they began to fear for their own\\n\\t\\t\\t\\tpower and possessions. It was far from Moses's intention\\n\\t\\t\\t\\tto drive out the Egyptians from their own land. He merely\\n\\t\\t\\t\\twanted to end the Egyptian oppression. But the Egyptians\\n\\t\\t\\t\\thad a guilty conscience, and they judged other people's\\n\\t\\t\\t\\tmotives by their own. They discussed the matter in\\n\\t\\t\\t\\tCouncil on quite wrong premises."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "112",
    "NoteID": "1078",
    "Body": "The advice of the Council to Pharaoh shows a misreading\\n\\t\\t\\t\\tof the situation. They were in a panic about what the\\n\\t\\t\\t\\tmagic of this evidently powerful sorcerer could do\\n\\t\\t\\t\\tagainst them. So they advised the Pharaoh to summon their\\n\\t\\t\\t\\tmost powerful sorcerers from all over the country, and in\\n\\t\\t\\t\\tthe meantime to hold Moses and Aaron in suspense,-neither\\n\\t\\t\\t\\tto yield to them nor definitely to oppose them. The\\n\\t\\t\\t\\tProphets of Allah could well afford to wait. Time is\\n\\t\\t\\t\\talways in favour of Truth."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "113",
    "NoteID": "1079",
    "Body": "The most noted sorcerers of Pharaoh came. Their art was\\n\\t\\t\\t\\tbuilt up on trickery and imposture, and the first thing\\n\\t\\t\\t\\tthey could think of was to make a selfish bargain for\\n\\t\\t\\t\\tthemselves. The Pharaoh and his Council would in their\\n\\t\\t\\t\\tpresent state of panic agree to anything. And so they\\n\\t\\t\\t\\tdid. Pharaoh not only promised them any rewards they\\n\\t\\t\\t\\tdesired if they foiled the strange power of these men,\\n\\t\\t\\t\\tbut he also promised them the highest dignities round his\\n\\t\\t\\t\\town person. And so the contest begins, with due\\n\\t\\t\\t\\tobservance of the amenities observed by combatants before\\n\\t\\t\\t\\tthey come to close grips."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "116",
    "NoteID": "1080",
    "Body": "Moses and his brother Aaron were pitted against the most\\n\\t\\t\\t\\tskilful magic-men of Egypt, but they were calm and\\n\\t\\t\\t\\tconfident and let the magic-men have their innings first.\\n\\t\\t\\t\\tAs is usual in this world, the magicians trickery made a\\n\\t\\t\\t\\tgreat impression on the people, but when Moses threw his\\n\\t\\t\\t\\trod, the illusion was broken, and the falsehood was all\\n\\t\\t\\t\\tshown up. In the Old Testament story (Exod. vii. 10-12)\\n\\t\\t\\t\\tit was Aaron that threw the rod, and he threw it before\\n\\t\\t\\t\\tthe magicians. Aaron's rod became a serpent. Then the\\n\\t\\t\\t\\tmagicians threw their rods, and they became serpents, but\\n\\t\\t\\t\\tAaron's rod swallowed up their rods. The story given to\\n\\t\\t\\t\\tus is more dramatic and less literal. We are told in\\n\\t\\t\\t\\tgeneral terms that Moses first allowed the magic-men to\\n\\t\\t\\t\\tplay their tricks. It was a simple shepherd's crook with\\n\\t\\t\\t\\twhich he used to feed his flocks. With Allah's grace\\n\\t\\t\\t\\tbehind him, he was able to expose all false trickery and\\n\\t\\t\\t\\testablish the Truth."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "119",
    "NoteID": "1081",
    "Body": "The proud ones of the Court-Pharaoh and his chiefs-were\\n\\t\\t\\t\\thard-hearted, and the exposure of the imposture only made\\n\\t\\t\\t\\tthem wreak their rage on those whom they could reach. On\\n\\t\\t\\t\\tthe other hand the effect on the humbler ones-those who\\n\\t\\t\\t\\thad been made the dupes and instruments of the\\n\\t\\t\\t\\timposture-was quite different. Their conscience was\\n\\t\\t\\t\\tawakened. They fell down to the ground in adoration of\\n\\t\\t\\t\\tthe Lord of the Worlds, and confessed their faith."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "123",
    "NoteID": "1082",
    "Body": "Pharaoh and his Court were doubly angry: first because\\n\\t\\t\\t\\tthey were made to look small when confronted by the power\\n\\t\\t\\t\\tof Allah, and secondly, because their dupes and\\n\\t\\t\\t\\tinstruments were snatched away from them. These men, the\\n\\t\\t\\t\\tsorcerers, at once recognised the Signs of Allah, and in\\n\\t\\t\\t\\ttheir case the mission of Moses, and Aaron was fulfilled.\\n\\t\\t\\t\\tThey turned back on their past life of false worship, and\\n\\t\\t\\t\\toppression of the weak, and confessed the One true God.\\n\\t\\t\\t\\tAs usually happens, hardened sinners resent all the more\\n\\t\\t\\t\\tthe saving of any of their companions from sin and error.\\n\\t\\t\\t\\tJudging other people's motives by their own, they accuse\\n\\t\\t\\t\\tthem of duplicity, and if they have the power, they take\\n\\t\\t\\t\\tcruel revenge. Here the Pharaoh threatens the repentant\\n\\t\\t\\t\\tsinners with the extreme punishment for treason and\\n\\t\\t\\t\\tapostasy (cutting off of hands and feet, combined with an\\n\\t\\t\\t\\tignominious death on the cross, as in the case of the\\n\\t\\t\\t\\tworst malefactors). But they remained firm, and prayed to\\n\\t\\t\\t\\tAllah for patience and constancy. Probably their\\n\\t\\t\\t\\tinfluence spread quietly in the commonalty. Ultimately it\\n\\t\\t\\t\\tappeared on the throne itself, in the person of Amenophis\\n\\t\\t\\t\\tIV about five or six generations afterwards."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "126",
    "NoteID": "1083",
    "Body": "These Egyptians, by their patience and constancy, show\\n\\t\\t\\t\\tthat their repentance was true. Thus in their case the\\n\\t\\t\\t\\tmission of Moses was fulfilled directly, and their number\\n\\t\\t\\t\\tmust have amounted to a considerable figure. They were\\n\\t\\t\\t\\tmartyrs to their faith, and their martyrdom affected\\n\\t\\t\\t\\ttheir nation in two ways. In the first place, as they\\n\\t\\t\\t\\twere the pick of those who practised magic in Egypt,\\n\\t\\t\\t\\ttheir conversion and disappearance dealt a staggering\\n\\t\\t\\t\\tblow to the whole system. Secondly, the indirect effect\\n\\t\\t\\t\\tof their martyrdom on the commonalty of Egypt must have\\n\\t\\t\\t\\tbeen far greater than can be measured by numbers. The\\n\\t\\t\\t\\tbanner of Allah was planted, and the silent spiritual\\n\\t\\t\\t\\tfight must have gone on ever since, though history, in\\n\\t\\t\\t\\trecording outward events, is silent on the slow and\\n\\t\\t\\t\\tgradual processes of transformation undergone by Egyptian\\n\\t\\t\\t\\treligion. From a chaotic pantheon of animals and animal\\n\\t\\t\\t\\tgods, the worship of the sun and the heavenly bodies, and\\n\\t\\t\\t\\tthe worship of the Pharaoh as the embodiment of power,\\n\\t\\t\\t\\tthey gradually came to realise the oneness and mercy of\\n\\t\\t\\t\\tthe true God. After many glimpses of Monotheism on\\n\\t\\t\\t\\tEgyptian soil itself, the (gospel of Jesus reached them,\\n\\t\\t\\t\\tand eventually Islam.)"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "127",
    "NoteID": "1084",
    "Body": "Pharaoh's order against the sorcerers was drastic enough.\\n\\t\\t\\t\\tBut his Council is not satisfied. What about Moses and\\n\\t\\t\\t\\tthe Israelites? They had a seeming victory, and will now\\n\\t\\t\\t\\tbe more mischievous than ever. They appeal to Pharaoh's\\n\\t\\t\\t\\tvanity and his superstition and sense of power. \"If you\\n\\t\\t\\t\\tleave them alone,\" they say, \"where will be your\\n\\t\\t\\t\\tauthority? You and your gods will be defied!\" Pharaoh has\\n\\t\\t\\t\\ta ready answer. He was really inwardly cowed by the\\n\\t\\t\\t\\tapparent power of Moses. He dared not openly act against\\n\\t\\t\\t\\thim. But he had already, before the birth of Moses,\\n\\t\\t\\t\\tpassed a cunning order to destroy the whole people of\\n\\t\\t\\t\\tIsrael. Through the instrumentality of midwives (Exod. i.\\n\\t\\t\\t\\t15) all the male children were to be destroyed, and the\\n\\t\\t\\t\\tfemales would then be for the Egyptians: the race of\\n\\t\\t\\t\\tIsrael would thus be at an end. This order was still in\\n\\t\\t\\t\\tforce, and would remain in force until the despised race\\n\\t\\t\\t\\twas absorbed. But Egyptian cunning and wickedness had no\\n\\t\\t\\t\\tpower against Allah's Plan for those who had faith. See\\n\\t\\t\\t\\tverse 129 below."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "128",
    "NoteID": "1085",
    "Body": "Notice the contrast between the arrogant tone of Pharaoh\\n\\t\\t\\t\\tand the humility and faith taught by Moses. In the end\\n\\t\\t\\t\\tthe arrogance was humbled, and humility and faith were\\n\\t\\t\\t\\tprotected and advanced."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "129",
    "NoteID": "1086",
    "Body": "There is a slight note of querulousness in the people's\\n\\t\\t\\t\\tanswer. But Moses allays it by his own example and\\n\\t\\t\\t\\tcourage, and his vision of the future: which was amply\\n\\t\\t\\t\\tfulfilled in time. See verse 137 below."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "129",
    "NoteID": "1087",
    "Body": "The Israelites, despised and enslaved, were to be rescued\\n\\t\\t\\t\\tand made rulers in Palestine. David and Solomon were\\n\\t\\t\\t\\tgreat kings and played a notable part in history. But the\\n\\t\\t\\t\\tgreatness of Israel was conditional: they were to be\\n\\t\\t\\t\\tjudged by their deeds. When they fell from grace, other\\n\\t\\t\\t\\tpeople were given honour and power. And so it came to be\\n\\t\\t\\t\\tthe turn of the Muslims, and so on. Allah gives His gifts\\n\\t\\t\\t\\tto those who are righteous and obey His Law."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "131",
    "NoteID": "1088",
    "Body": "Their superstition ascribed the punishment of their own\\n\\t\\t\\t\\twickedness to some evil omen. They thought Moses and his\\n\\t\\t\\t\\tpeople brought them ill-luck. They did not look within\\n\\t\\t\\t\\tthemselves to see the root of evil, and the cause of\\n\\t\\t\\t\\ttheir punishment! So it happens in all ages. People blame\\n\\t\\t\\t\\tthe righteous for something which they do, different from\\n\\t\\t\\t\\tother men, instead of searching out their own lapses from\\n\\t\\t\\t\\trectitude, which are punished by Allah."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "132",
    "NoteID": "1089",
    "Body": "A type of obstinacy and resistance to Allah's message. As\\n\\t\\t\\t\\tthey believed in sorcery and magic, they thought anything\\n\\t\\t\\t\\tunusual was but sorcery and magic, and hardened their\\n\\t\\t\\t\\thearts against Truth."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "133",
    "NoteID": "1090",
    "Body": "Tufan = a widespread calamity, causing wholesale death\\n\\t\\t\\t\\tand destruction. It may be a flood, or a typhoon, or an\\n\\t\\t\\t\\tepidemic, among men or cattle. Perhaps the last is meant,\\n\\t\\t\\t\\tif we may interpret by the Old Testament story. See also\\n\\t\\t\\t\\tExod. ix. 3, 9, 15; xii. 29."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "133",
    "NoteID": "1091",
    "Body": "In xvii. 101, the reference is to nine Clear Signs. These\\n\\t\\t\\t\\tare: (1) the Rod (vii. 107), (2) the Radiant Hand (vii.\\n\\t\\t\\t\\t108), (3) the years of drought or shortage of water (vii,\\n\\t\\t\\t\\t130), (4) short crops (vii. 130), and the five mentioned\\n\\t\\t\\t\\tin this verse, viz., (5) epidemics among men and beasts,\\n\\t\\t\\t\\t(6) locusts, (7) lice, (8) frogs, and (9) the water\\n\\t\\t\\t\\tturning to blood."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "134",
    "NoteID": "1092",
    "Body": "The demand of Moses was two-fold: (1) come to Allah and\\n\\t\\t\\t\\tcease from oppression, and (2) let me take Israel out of\\n\\t\\t\\t\\tEgypt. At first it was laughed at and rejected with\\n\\t\\t\\t\\tscorn. When the Plagues came for punishment, each time\\n\\t\\t\\t\\tthe Egyptians suffered, they promised amendment and\\n\\t\\t\\t\\tbegged Moses to intercede and cause the plague to cease.\\n\\t\\t\\t\\tBut every time it ceased, they went back to their evil\\n\\t\\t\\t\\tattitude, until the final retribution came. This is a\\n\\t\\t\\t\\ttype of the sinner's attitude for all times."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "135",
    "NoteID": "1093",
    "Body": "The intercession of Moses was to pray. Each plague or\\n\\t\\t\\t\\tpenalty had its appointed term in Allah's decree. That\\n\\t\\t\\t\\tterm was duly fulfilled before the plague ceased. The\\n\\t\\t\\t\\tintercession meant two things: (1) that Allah's name was\\n\\t\\t\\t\\tinvoked and His presence duly brought home to the mind\\n\\t\\t\\t\\tand heart of the sinner who promised repentance, and (2)\\n\\t\\t\\t\\tthat the sinner was given a further chance when the\\n\\t\\t\\t\\tprayer was accepted. This again is a universal truth."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "136",
    "NoteID": "1094",
    "Body": "When at last Pharaoh let Israel go, they selected, not\\n\\t\\t\\t\\tthe highway to Canaan, along the Mediterranean and by\\n\\t\\t\\t\\tGaza, because they were unarmed and would have\\n\\t\\t\\t\\tencountered immediate opposition there, but by way of the\\n\\t\\t\\t\\twilderness of Sinai. They crossed the Red Sea, while\\n\\t\\t\\t\\tPharaoh's host which came in pursuit was drowned. Cf. ii.\\n\\t\\t\\t\\t50."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "136",
    "NoteID": "1095",
    "Body": "Where was the Council of Pharaoh held in which Moses\\n\\t\\t\\t\\taddressed Pharoah? Egypt's primary capital in the XVIIIth\\n\\t\\t\\t\\tDynasty was Thebes (=Not-Ammon), but that was more than\\n\\t\\t\\t\\t400 miles to the south of the Delta, in whose corner\\n\\t\\t\\t\\tIsrael dwelt. Memphis, on the apex of the Delta, a little\\n\\t\\t\\t\\tsouth of where Cairo is now, was also over 100 miles from\\n\\t\\t\\t\\tIsrael's habitations. The interview must have been either\\n\\t\\t\\t\\tin a Palace near Goshen, where the Israelites dwelt, or\\n\\t\\t\\t\\tin Zoan (=Tanis), the Deltaic capital built by a former\\n\\t\\t\\t\\tdynasty, which was of course still available for the\\n\\t\\t\\t\\treigning dynasty, and which was not far from the\\n\\t\\t\\t\\tIsraelite settlement."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "137",
    "NoteID": "1096",
    "Body": "Israel, which was despised, became a great and glorious\\n\\t\\t\\t\\tnation under Solomon. He had goodly territory, and was\\n\\t\\t\\t\\tdoubly blest. His land and people were prosperous, and he\\n\\t\\t\\t\\twas blessed with wisdom from Allah. His sway and his fame\\n\\t\\t\\t\\tspread east and west. And thus Allah's promise to Israel\\n\\t\\t\\t\\twas fulfilled. Note that Syria and Palestine had once\\n\\t\\t\\t\\tbeen under the sway of Egypt. At the same time the proud\\n\\t\\t\\t\\tand rebellious Pharaoh and his people were brought low.\\n\\t\\t\\t\\tThe splendid monuments which they had erected with so\\n\\t\\t\\t\\tmuch skill and pride were mingled with the dust. Their\\n\\t\\t\\t\\tgreat cities-Thebes (or No-Ammon), Memphis (or Noph,\\n\\t\\t\\t\\tsacred to the Bull of Osiris), and the other splendid\\n\\t\\t\\t\\tcities, became as if they had not existed, and\\n\\t\\t\\t\\tarchaeologists have had to dig up their ruins from the\\n\\t\\t\\t\\tsands. The splendid monuments-temples, palaces, tombs,\\n\\t\\t\\t\\tstatues, columns, and stately structures of all\\n\\t\\t\\t\\tkinds-were buried in the sands. Even monuments like the\\n\\t\\t\\t\\tGreat Sphinx, which seem to defy the ages, were partly\\n\\t\\t\\t\\tburied in the sands, and owe their rescue to the\\n\\t\\t\\t\\tcomparatively recent researches of archaeologists. As\\n\\t\\t\\t\\tlate as 1743 Richard Pococke in his Travels in Fgypt (p.\\n\\t\\t\\t\\t41), remarked: \"Most of those pyramids are very much\\n\\t\\t\\t\\truined.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "138",
    "NoteID": "1097",
    "Body": "Who were these people? We are now in the Sinai Peninsula.\\n\\t\\t\\t\\tTwo conjectures are possible. (1) The Amalekites of the\\n\\t\\t\\t\\tSinai Peninsula were at perpetual war with the\\n\\t\\t\\t\\tIsraelites. They were probably an idolatrous nation, but\\n\\t\\t\\t\\twe have very little knowledge of their cult. (2) From\\n\\t\\t\\t\\tEgyptian history we know that Egypt had worked from very\\n\\t\\t\\t\\tancient times some copper mines in Sinai. An Egyptian\\n\\t\\t\\t\\tsettlement may have been here. Like all mining camps it\\n\\t\\t\\t\\tcontained from the beginning the dregs of the population.\\n\\t\\t\\t\\tWhen the mines ceased to be worked, the settlement, or\\n\\t\\t\\t\\twhat remained of it, must have degenerated further. Cut\\n\\t\\t\\t\\toff from civilisation, its cult must have become still\\n\\t\\t\\t\\tnarrower, without the refining influences which a\\n\\t\\t\\t\\tprogressive nation applies even to its idolatry. Perhaps\\n\\t\\t\\t\\tApis, the sacred bull of Memphis, lost all its\\n\\t\\t\\t\\tallegorical meaning for them, and only gross and\\n\\t\\t\\t\\tsuperstitious rites remained among them. The text speaks\\n\\t\\t\\t\\tof \"some idols they had,\" implying that they had merely a\\n\\t\\t\\t\\tdetached fragment of a completer religion. This was a\\n\\t\\t\\t\\tsnare in the path of the Israelites, whom many\\n\\t\\t\\t\\tgenerations of slavery in Egypt had debased into\\n\\t\\t\\t\\tignorance and superstition."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "139",
    "NoteID": "1098",
    "Body": "If conjecture 2 in the last note is correct, this\\n\\t\\t\\t\\tidolatrous worship was but the fragment of a ruin from\\n\\t\\t\\t\\tEgypt, and Moses's reproach is biting: \"You, who have\\n\\t\\t\\t\\tbeen rescued from the bondage of living Egypt,-do you\\n\\t\\t\\t\\thanker after the bondage of a dead cult debased even from\\n\\t\\t\\t\\tthat from which you have been rescued?\" Mutabbar = broken\\n\\t\\t\\t\\tin pieces, smashed into fragments, destroyed."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "141",
    "NoteID": "1099",
    "Body": "This is Allah's reminder to Israel through the mouth of\\n\\t\\t\\t\\tMoses. There was a double trial: (1) while the bondage\\n\\t\\t\\t\\tlasted, the people were to learn patience and constancy\\n\\t\\t\\t\\tin the midst of affliction: (2) when they were rescued,\\n\\t\\t\\t\\tthey were to learn humility; justice, and righteous deeds\\n\\t\\t\\t\\tof prosperity."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "142",
    "NoteID": "1100",
    "Body": "The forty nights' exclusion of Moses on the Mount may be\\n\\t\\t\\t\\tcompared with the forty days fast of Jesus in the\\n\\t\\t\\t\\twilderness before he took up his ministry (Matt. iv, 2).\\n\\t\\t\\t\\tIn each case the Prophets lived alone apart from their\\n\\t\\t\\t\\tpeople, before they came into the full blaze of the\\n\\t\\t\\t\\tevents of their Ministry."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "142",
    "NoteID": "1101",
    "Body": "When for any reason the man of God is absent from his\\n\\t\\t\\t\\tpeople, his duty of leadership (khilafat) should be taken\\n\\t\\t\\t\\tup by his brother,-not necessarily a blood-brother, but\\n\\t\\t\\t\\tone of his society or brotherhood. The deputy should\\n\\t\\t\\t\\tdischarge it in all humility, remembering three things:\\n\\t\\t\\t\\t(1) that he is only a deputy, and bound to follow the\\n\\t\\t\\t\\tdirections of his Principal, (2) that right and justice\\n\\t\\t\\t\\tare of the essence of power, and (3) that mischief gets\\n\\t\\t\\t\\tits best chance to raise its head in the absence of the\\n\\t\\t\\t\\tPrincipal, and that the deputy should always guard\\n\\t\\t\\t\\tagainst the traps laid for him in the Principal's\\n\\t\\t\\t\\tabsence."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "143",
    "NoteID": "1102",
    "Body": "Even the best of us may be betrayed into overweening\\n\\t\\t\\t\\tconfidence of spiritual ambition not yet justified by the\\n\\t\\t\\t\\tstage we have reached. Moses had already seen part of the\\n\\t\\t\\t\\tglory of Allah in his Radiant White Hand, that shone with\\n\\t\\t\\t\\tthe glory of Divine light (vii. 108, n. 1076). But he was\\n\\t\\t\\t\\tstill in the flesh, and the mission to his people was to\\n\\t\\t\\t\\tbegin after the Covenant of Sinai."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "143",
    "NoteID": "1103",
    "Body": "But Allah-the Cherisher of all His creatures-treats even\\n\\t\\t\\t\\tour improper requests with mercy, compassion, and\\n\\t\\t\\t\\tunderstanding. Even the reflected glory of Allah is too\\n\\t\\t\\t\\tgreat for the grosser substance of matter. The peak on\\n\\t\\t\\t\\twhich it shone became as powder before the ineffable\\n\\t\\t\\t\\tglory, and Moses could only live by being taken out of\\n\\t\\t\\t\\this bodily senses. When he recovered from his swoon, he\\n\\t\\t\\t\\tsaw the true position, and the distance between our\\n\\t\\t\\t\\tgrosser bodily senses and the true splendour of Allah's\\n\\t\\t\\t\\tglory. He at once turned in penitence to Allah, and\\n\\t\\t\\t\\tconfessed his faith."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "143",
    "NoteID": "1104",
    "Body": "\"First to believe.\" Cf. the expression \"first of those\\n\\t\\t\\t\\twho bow to Allah in Islam\" in vi. 14 and vi. 163. \"First\"\\n\\t\\t\\t\\tmeans here not the first in time, but most zealous in\\n\\t\\t\\t\\tfaith. It has the intensive and not the comparative\\n\\t\\t\\t\\tmeaning."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "144",
    "NoteID": "1105",
    "Body": "\"Above (other) men\": i.e. among his contemporaries. He\\n\\t\\t\\t\\thad a high mission, and he had the honour of speaking to\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "144",
    "NoteID": "1106",
    "Body": "Allah's revelation is for the benefit of His creatures,\\n\\t\\t\\t\\twho should receive it with reverence and gratitude. While\\n\\t\\t\\t\\tMoses was having these great spiritual experiences on the\\n\\t\\t\\t\\tMount, his people below were ungrateful enough to forget\\n\\t\\t\\t\\tAllah and make a golden calf for worship (vii. 147)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "145",
    "NoteID": "1107",
    "Body": "The Tablets of the Law contained the essential Truth,\\n\\t\\t\\t\\tfrom which were derived the positive injunctions and\\n\\t\\t\\t\\tprohibitions, explanations and interpretations, which it\\n\\t\\t\\t\\twas the function of the prophetic office to hold up for\\n\\t\\t\\t\\tthe people to follow. The precepts would contain, as the\\n\\t\\t\\t\\tShari'at does, matters absolutely prohibited, matters not\\n\\t\\t\\t\\tprohibited but disapproved, matters about which there was\\n\\t\\t\\t\\tno prohibition or injunction, but in which conduct was to\\n\\t\\t\\t\\tbe regulated by circumstances; matters of positive and\\n\\t\\t\\t\\tuniversal duty, matters recommended for those whose zeal\\n\\t\\t\\t\\twas sufficient to enable them to work on higher than\\n\\t\\t\\t\\tminimum standards. No soul is burdened beyond its\\n\\t\\t\\t\\tcapacity; but we are asked to seek the best and highest\\n\\t\\t\\t\\tpossible for us in conduct."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "145",
    "NoteID": "1108",
    "Body": "Notice the transition from the \"We\" of authority and\\n\\t\\t\\t\\thonour and impersonal dignity, to the \"I\" of personal\\n\\t\\t\\t\\tconcern in specially guiding the righteous."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "145",
    "NoteID": "1109",
    "Body": "Literally, the homes of the wicked, both individuals and\\n\\t\\t\\t\\tnations, lie desolate, as in the case of the ancient\\n\\t\\t\\t\\tEgyptians, the 'Ad, and the Thamud."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "146",
    "NoteID": "1110",
    "Body": "The argument may be simplified thus in paraphrase. The\\n\\t\\t\\t\\tright is established on the earth as Allah created it:\\n\\t\\t\\t\\tNature recognises and obeys Allah's law as fixed for each\\n\\t\\t\\t\\tportion of Creation. But man, because of the gift of\\n\\t\\t\\t\\tWill, sometimes upsets this balance. The root-cause is\\n\\t\\t\\t\\this arrogance, as it was in the case of Iblis. Allah's\\n\\t\\t\\t\\tSigns are everywhere, but if they are rejected with scorn\\n\\t\\t\\t\\tand blasphemy, Allah will withdraw His grace, for sin\\n\\t\\t\\t\\thardens the heart and makes it impervious to the truth.\\n\\t\\t\\t\\tWant of faith produces a kind of blindness to spiritual\\n\\t\\t\\t\\tfacts, a kind of deafness to the warnings of a Day of\\n\\t\\t\\t\\tAccount. If we had contumaciously rejected faith, can we\\n\\t\\t\\t\\thope for anything but justice,-the just punishment of our\\n\\t\\t\\t\\tsins."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "146",
    "NoteID": "1111",
    "Body": "Rejected Our Signs: again a return to the Plural of\\n\\t\\t\\t\\timpersonal Dignity and Authority, from the singular of\\n\\t\\t\\t\\tpersonal concern in granting grace and guidance to the\\n\\t\\t\\t\\tRighteous."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "148",
    "NoteID": "1112",
    "Body": "The making of the golden calf and its worship by the\\n\\t\\t\\t\\tIsraelites during the absence of Moses on the Mount were\\n\\t\\t\\t\\treferred to in ii. 51, and some further details are given\\n\\t\\t\\t\\tin xx. 95-97. Notice how in each case only those points\\n\\t\\t\\t\\tare referred to which are necessary to the argument in\\n\\t\\t\\t\\thand. A narrator whose object is mere narration, tells\\n\\t\\t\\t\\tthe story in all its details, and is done with it. A\\n\\t\\t\\t\\tconsummate artist, whose object is to enforce lessons,\\n\\t\\t\\t\\tbrings out each point in its proper place. Master of all\\n\\t\\t\\t\\tdetails, he does not ramble, but with supreme literary\\n\\t\\t\\t\\tskill, just adds the touch that is necessary in each\\n\\t\\t\\t\\tplace to complete the spiritual picture. His object is\\n\\t\\t\\t\\tnot a story but a lesson. Here notice the contrast\\n\\t\\t\\t\\tbetween the intense spiritual communion of Moses on the\\n\\t\\t\\t\\tMount and the simultaneous corruption of his people in\\n\\t\\t\\t\\this absence. We can understand his righteous indignation\\n\\t\\t\\t\\tand bitter grief (vii. 150). The people had melted all\\n\\t\\t\\t\\ttheir gold ornaments, and made the image of a calf like\\n\\t\\t\\t\\tthe bull of Osiris in the city of Memphis in the wicked\\n\\t\\t\\t\\tEgypt that they had turned their backs upon."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "148",
    "NoteID": "1113",
    "Body": "Image of a Calf. Jasad is literally a body, especially\\n\\t\\t\\t\\tthe body of a man according to Khalil quoted by Ragib. In\\n\\t\\t\\t\\txxi. 8, it is used obviously for the human body, as also\\n\\t\\t\\t\\tin xxxviii. 34; but in the latter case, the idea of an\\n\\t\\t\\t\\timage, without any real life or soul, is also suggested.\\n\\t\\t\\t\\tIn the present passage I understand many suggestions: (1)\\n\\t\\t\\t\\tthat it was a mere image, without life, (2) as such, it\\n\\t\\t\\t\\tcould not low, therefore the appearance of lowing,\\n\\t\\t\\t\\tmentioned immediately afterwards, was a fraud: (3) unlike\\n\\t\\t\\t\\tits prototype, the bull of Osiris, it had not even the\\n\\t\\t\\t\\tsymbolism of Osiris behind it; the Osiris myth, in the\\n\\t\\t\\t\\tliving religion of Egypt, had at least some ethical\\n\\t\\t\\t\\tprinciples behind it."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "148",
    "NoteID": "1114",
    "Body": "The lowing of the golden calf was obviously a deception\\n\\t\\t\\t\\tpractised by the promoters of the cult. Lytton in his\\n\\t\\t\\t\\t\"Last Days of Pompeii\" exposes the deception practised by\\n\\t\\t\\t\\tthe priests of Isis. Men hidden behind images imposed on\\n\\t\\t\\t\\tthe credulity of the commonalty."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "150",
    "NoteID": "1115",
    "Body": "Did ye inake haste...? 'In your impatience, could you not\\n\\t\\t\\t\\twait for me? Your lapse into idolatry has only hastened\\n\\t\\t\\t\\tAllah's wrath. If you had only waited, I was bringing to\\n\\t\\t\\t\\tyou in the Tablets the most excellent teaching in the\\n\\t\\t\\t\\tcommands of Allah.' There is subtle irony in the speech\\n\\t\\t\\t\\tof Moses. There is also a play upon words: 'ijl = calf:\\n\\t\\t\\t\\tand 'ajila = to make haste: no translation can bring out\\n\\t\\t\\t\\tthese niceties."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "150",
    "NoteID": "1116",
    "Body": "Put down the Tablets: we are not told that the Tablets\\n\\t\\t\\t\\twere broken: in fact vii. 154 (below) shows that they\\n\\t\\t\\t\\twere whole. They contained Allah's Message. There is a\\n\\t\\t\\t\\ttouch of disrespect (if not blasphemy) in supposing that\\n\\t\\t\\t\\tAllah's Messenger broke the Tablets in his incontinent\\n\\t\\t\\t\\trage, as is stated in the Old Testament: \"Moses's anger\\n\\t\\t\\t\\twaxed hot, and he cast the tablets out of his hands, and\\n\\t\\t\\t\\tbrake them beneath the Mount.\" (Exod. xxxii. 10). On this\\n\\t\\t\\t\\tpoint and also on the point that Aaron (in the Old\\n\\t\\t\\t\\tTestament story) ordered the gold to be brought, made a\\n\\t\\t\\t\\tmolten calf, fashioned it with a graving tool, and built\\n\\t\\t\\t\\tan altar before the calf (Exd. xxxii. 2-5), our version\\n\\t\\t\\t\\tdiffers from that of the Old Testament. We cannot believe\\n\\t\\t\\t\\tthat Aaron, who was appointed by Allah to assist Moses as\\n\\t\\t\\t\\tAllah's Messenger, could descend so low as to seduce the\\n\\t\\t\\t\\tpeople into idolatry, whatever his human weaknesses might\\n\\t\\t\\t\\the."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "150",
    "NoteID": "1117",
    "Body": "Moses was but human. Remembering the charge he had given\\n\\t\\t\\t\\tto Aaron (vii. 142) he had a just grievance at the turn\\n\\t\\t\\t\\tevents had taken. But he did not wreak his vengeance on\\n\\t\\t\\t\\tthe Tablets of Allah's law by breaking them. He laid\\n\\t\\t\\t\\thands on his brother, and his brother at once explained."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "150",
    "NoteID": "1118",
    "Body": "Aaron's speech is full of tenderness and regret. He\\n\\t\\t\\t\\taddresses Moses as \"son of my mother.\"-an affectionate\\n\\t\\t\\t\\tterm. He explains how the turbulent people nearly killed\\n\\t\\t\\t\\thim for resisting them. And he states in the clearest\\n\\t\\t\\t\\tterms that the idolatry neither originated with him nor\\n\\t\\t\\t\\thad his consent. In xx. 85, we are told that a fellow\\n\\t\\t\\t\\tdescribed as the Samiri had led them astray. We shall\\n\\t\\t\\t\\tdiscuss this when we come to that passage."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "151",
    "NoteID": "1119",
    "Body": "As Moses was convinced that his brother was guiltless,\\n\\t\\t\\t\\this wrath was turned to gentleness. He prayed for\\n\\t\\t\\t\\tforgiveness-for himself and his brother: for himself\\n\\t\\t\\t\\tbecause of his wrath and for his brother because he had\\n\\t\\t\\t\\tbeen unable to suppress idolatry among his people. And\\n\\t\\t\\t\\tlike a true leader that he is, he identifies himself with\\n\\t\\t\\t\\this lieutenant for all that has happened. Even more, he\\n\\t\\t\\t\\tidentifies himself with his whole people in his prayer in\\n\\t\\t\\t\\tverse 155 below. Herein, again, is a type of what the\\n\\t\\t\\t\\tHoly Prophet Muhammad did for his people."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "152",
    "NoteID": "1120",
    "Body": "The consequences were twofold: (1) spiritual, in that\\n\\t\\t\\t\\tAllah's grace is withdrawn, and (2) even in the present\\n\\t\\t\\t\\tlife of this world, in that godly men also shun the\\n\\t\\t\\t\\tsinner's company, and he is isolated."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "155",
    "NoteID": "1121",
    "Body": "Seventy of the elders were taken up to the Mount, but\\n\\t\\t\\t\\tleft at some distance from the place where Allah spoke to\\n\\t\\t\\t\\tMoses. They were to be silent witnesses, but their faith\\n\\t\\t\\t\\twas not yet complete, and they dared to say to Moses: \"We\\n\\t\\t\\t\\tshall never believe in thee until we see Allah in public\"\\n\\t\\t\\t\\t(ii.55). They were dazed with thunder and lightning, and\\n\\t\\t\\t\\tmight have been destroyed but for Allah's mercy on the\\n\\t\\t\\t\\tintercession of Moses."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "155",
    "NoteID": "1122",
    "Body": "Rajfat: violent quaking, earthquake, I take it to refer\\n\\t\\t\\t\\tto the same event as is described by the word Sa'iqat in\\n\\t\\t\\t\\tii. 55, the thunder and lightning that shook the\\n\\t\\t\\t\\tmountainside."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "155",
    "NoteID": "1123",
    "Body": "Moses was guiltless, but he identifies himself with his\\n\\t\\t\\t\\twhole people, and intercedes with Allah on their behalf.\\n\\t\\t\\t\\tHe recognises that it was a trial, in which some of his\\n\\t\\t\\t\\tpeople failed to stand the test. Such failure was worthy\\n\\t\\t\\t\\tof punishment. But he pleads for mercy for such as erred\\n\\t\\t\\t\\tfrom weakness and not from contumacy, and were truly\\n\\t\\t\\t\\trepentant, although all who erred were in their several\\n\\t\\t\\t\\tdegrees worthy of punishment."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "155",
    "NoteID": "1124",
    "Body": "Cf. ii. 26."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "156",
    "NoteID": "1125",
    "Body": "Allah's mercy is in and for all things. All nature\\n\\t\\t\\t\\tsubserves a common purpose, which is for the good of all\\n\\t\\t\\t\\tHis creatures. Our faculties and our understandings are\\n\\t\\t\\t\\tall instances of His grace and mercy. Each unit or factor\\n\\t\\t\\t\\tamong his creatures benefits from the others and receives\\n\\t\\t\\t\\tthem as Allah's mercy to itself: and in its turn, each\\n\\t\\t\\t\\tcontributes to the benefit of the others and is thus an\\n\\t\\t\\t\\tinstance of Allah's mercy to them. His mercy is universal\\n\\t\\t\\t\\tand all-pervasive; while His justice and punishment are\\n\\t\\t\\t\\treserved for those who swerve from His plan and (to use a\\n\\t\\t\\t\\tmediaeval juridicial formula) go out of His Peace."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "156",
    "NoteID": "1126",
    "Body": "The personal grace and mercy-and their opposite-are\\n\\t\\t\\t\\treferred to the singular pronoun \"I\" while the impersonal\\n\\t\\t\\t\\tLaw, by which Allah's Signs operate in His universe, is\\n\\t\\t\\t\\treferred to the plural pronoun of authority and dignity,\\n\\t\\t\\t\\t\"We\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "157",
    "NoteID": "1127",
    "Body": "In this verse is a prefiguring, to Moses, of the Arabian\\n\\t\\t\\t\\tMessenger, the last and greatest of the messengers of\\n\\t\\t\\t\\tAllah. Prophecies about him will be found in the Taurat\\n\\t\\t\\t\\tand the Injil. In the reflex of the Taurat as now\\n\\t\\t\\t\\taccepted by the Jews, Moses says: \"The Lord thy God will\\n\\t\\t\\t\\traise up unto thee a Prophet from the midst of thee, of\\n\\t\\t\\t\\tthy brethren, like unto me\" (Deut. xviii. 15): the only\\n\\t\\t\\t\\tProphet who brought a Shari'at like that of Moses was\\n\\t\\t\\t\\tMuhammad Al- Mustafa, and he came of the house of Ismail\\n\\t\\t\\t\\tthe brother of Isaac the father of Israel. In the reflex\\n\\t\\t\\t\\tof the Gospel as now accepted by the Christians, Christ\\n\\t\\t\\t\\tpromised another Comforter (John xiv. 16): the Greek word\\n\\t\\t\\t\\tParaclete which the Christians interpret as referring to\\n\\t\\t\\t\\tthe Holy Spirit is by our Doctors taken to be Periclyte,\\n\\t\\t\\t\\twhich would be the Greek form of Ahmad. See Q. lxi. 6."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "157",
    "NoteID": "1128",
    "Body": "Aglal: plural of gullun, a yoke, an iron collar. In the\\n\\t\\t\\t\\tformalism and exclusiveness of the Jews there were many\\n\\t\\t\\t\\trestrictions which were removed by Islam, a religion of\\n\\t\\t\\t\\tfreedom in the faith of Allah, of universality in the\\n\\t\\t\\t\\tvariety of races, languages, manners and customs."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "157",
    "NoteID": "1129",
    "Body": "Light which is sent down with him: the words are \"with\\n\\t\\t\\t\\thim\", not \"to him\", emphasizing the fact that the Light\\n\\t\\t\\t\\twhich he brought illumines every one who has the\\n\\t\\t\\t\\tprivilege of joining his great and universal Fellowship."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "157",
    "NoteID": "1130",
    "Body": "Falah = prosperity in its general sense as well as in its\\n\\t\\t\\t\\tspiritual sense. In the general sense it means that right\\n\\t\\t\\t\\tconduct is the only door to happiness and well-being. In\\n\\t\\t\\t\\tthe spiritual sense it means that Faith and its fruits\\n\\t\\t\\t\\t(right conduct) are the only gates to salvation."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "158",
    "NoteID": "1131",
    "Body": "Our attention having been directed to various prophets,\\n\\t\\t\\t\\twho were sent with missions to their several peoples, and\\n\\t\\t\\t\\tin each of whose careers there is some prefigurement of\\n\\t\\t\\t\\tthe life of the last and greatest of them, we are now\\n\\t\\t\\t\\tasked to listen to the proclamation of Muhammad's\\n\\t\\t\\t\\tuniversal mission. We contemplate no longer, after this,\\n\\t\\t\\t\\tpartial truths. It is not now a question of saving Israel\\n\\t\\t\\t\\tfrom the bondage of Egypt, nor teaching Midian the ethics\\n\\t\\t\\t\\tof business, nor reclaiming the people of Lot from sexual\\n\\t\\t\\t\\tsin or Thamud from the sin of oppression in power, or 'Ad\\n\\t\\t\\t\\tfrom arrogance and ancestorworship. Now are set forth\\n\\t\\t\\t\\tplainly the issues of Life and Death, the Message of\\n\\t\\t\\t\\tAllah, the One Universal God to all mankind."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "158",
    "NoteID": "1132",
    "Body": "\"Unlettered,\" as applied to the Prophet here and in verse\\n\\t\\t\\t\\t157 above, has three special significations. (1) He was\\n\\t\\t\\t\\tnot versed in human learning: yet he was full of the\\n\\t\\t\\t\\thighest wisdom, and had a most wonderful knowledge of the\\n\\t\\t\\t\\tprevious Scriptures. This was a proof of his inspiration.\\n\\t\\t\\t\\tIt was a miracle of the highest kind, a \"Sign\", which\\n\\t\\t\\t\\tevery one could test then, and every one can test now.\\n\\t\\t\\t\\t(2) All organised human knowledge tends to be\\n\\t\\t\\t\\tcrystallized, to acquire a partial bias or flavour of\\n\\t\\t\\t\\tsome \"school\" of thought. The highest Teacher had to be\\n\\t\\t\\t\\tfree from any such taint, just as a clean slate is\\n\\t\\t\\t\\tnecessary if a perfectly clear and bold message has to be\\n\\t\\t\\t\\twritten on it. (3) In iii.20 and lxii. 2, the epithet is\\n\\t\\t\\t\\tapplied to the Pagan Arabs, because, before the advent of\\n\\t\\t\\t\\tIslam, they were unlearned."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "160",
    "NoteID": "1133",
    "Body": "We now come to some incidents in Jewish history, which\\n\\t\\t\\t\\thave been referred to in ii. 57-60. Here they have\\n\\t\\t\\t\\tspecial reference to their bearing on the times when\\n\\t\\t\\t\\tearly Islam was preached. The Twelve Tribes and the\\n\\t\\t\\t\\tparable drawn from them have been explained in n. 73 to\\n\\t\\t\\t\\tii. 60."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "160",
    "NoteID": "1134",
    "Body": "Cf. ii. 57 and n. 71."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "161",
    "NoteID": "1135",
    "Body": "As in vii. 19, we may construe \"eat\" here to mean not\\n\\t\\t\\t\\tonly eating literally, but enjoying the good things of\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "162",
    "NoteID": "1136",
    "Body": "Cf. ii, 58-59, and n. 72. The story is here told by way\\n\\t\\t\\t\\tof parable for the times of Islam. Hence we have a few\\n\\t\\t\\t\\tverbal changes: e.g., \"dwell in this town\" instead of\\n\\t\\t\\t\\t\"enter this town.\" etc."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "163",
    "NoteID": "1137",
    "Body": "Cf. ii. 65 and n. 79. Fishing, like every other activity,\\n\\t\\t\\t\\twas prohibited to Israel on the Sabbath day. As this\\n\\t\\t\\t\\tpractice was usually observed, the fish used to come up\\n\\t\\t\\t\\twith a sense of security to their water channels or pools\\n\\t\\t\\t\\topenly on the Sabbath day, but not on other days when\\n\\t\\t\\t\\tfishing was open. This was a great temptation to the\\n\\t\\t\\t\\tlaw-breakers, which they could not resist. Some of their\\n\\t\\t\\t\\tmen of piety protested, but it had no effect. When their\\n\\t\\t\\t\\ttransgressions, which we may suppose, extended to other\\n\\t\\t\\t\\tcommandments, passed beyond bounds, the punishment came."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "164",
    "NoteID": "1138",
    "Body": "There are always people who wonder, no doubt sincerely,\\n\\t\\t\\t\\twhat good it is to preach to the wicked. The answer is\\n\\t\\t\\t\\tgiven to them here: (1) every man who sees evil must\\n\\t\\t\\t\\tspeak out against it; it is his duty and responsibility\\n\\t\\t\\t\\tto Allah; (2) there is always a chance that the warning\\n\\t\\t\\t\\tmay have effect and save a precious soul. This passage\\n\\t\\t\\t\\thas a special meaning for the times when our Holy Prophet\\n\\t\\t\\t\\twas preaching in Makkah, apparently without results. But\\n\\t\\t\\t\\tit applies to all times."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "166",
    "NoteID": "1139",
    "Body": "Cf. ii. 65, n. 79."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "167",
    "NoteID": "1140",
    "Body": "See Deut, xi. 28: \"A curse if ye will not obey the\\n\\t\\t\\t\\tcommandments of the Lord your God but turn aside out of\\n\\t\\t\\t\\tthe way which I command you this day\": also Deut, xxviii.\\n\\t\\t\\t\\t49; \"The Lord shall bring a nation against thee from\\n\\t\\t\\t\\tafar, from the end of the earth, as swift as the eagle\\n\\t\\t\\t\\tflieth: a nation whose tongue thou shalt not understand\";\\n\\t\\t\\t\\tand many other passages."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "168",
    "NoteID": "1141",
    "Body": "The dispersal of the Jews is a great fact in the world's\\n\\t\\t\\t\\thistory. Nor has their persecution ended yet, nor is it\\n\\t\\t\\t\\tlikely to end as far as we can foresee."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "169",
    "NoteID": "1142",
    "Body": "Merely inheriting a Book, or doing lip service to it,\\n\\t\\t\\t\\tdoes not make a nation righteous. If they succumb to the\\n\\t\\t\\t\\ttemptations of the world, their hypocrisy becomes all the\\n\\t\\t\\t\\tmore glaring. \"High finance\" is one of these temptations.\\n\\t\\t\\t\\tCf. also ii. 80: \"the Fire shall not touch us except for\\n\\t\\t\\t\\ta few numbered days\": and ii. 88, about their blasphemous\\n\\t\\t\\t\\tself-sufficiency."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "169",
    "NoteID": "1143",
    "Body": "Cf- Exod. xix. 5-8; xxiv 3; xxxiv. 27; and many other\\n\\t\\t\\t\\tpassages."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "171",
    "NoteID": "1144",
    "Body": "Cf. ii. 63 and n."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "171",
    "NoteID": "1145",
    "Body": "Therein = in the Book or Revelation, in \"what We have\\n\\t\\t\\t\\tgiven you.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "172",
    "NoteID": "1146",
    "Body": "This passage has led to differences of opinion in\\n\\t\\t\\t\\tinterpretation. According to the dominant opinion of\\n\\t\\t\\t\\tcommentators each individual in the posterity of Adam had\\n\\t\\t\\t\\ta separate existence from the time of Adam, and a\\n\\t\\t\\t\\tCovenant was taken from all of them, which is binding\\n\\t\\t\\t\\taccordingly on each individual. The words in the text\\n\\t\\t\\t\\trefer to the descendants of the Children of Adam, i.e.,\\n\\t\\t\\t\\tto all humanity, born or unborn, without any limit of\\n\\t\\t\\t\\ttime. Adam's seed carries on the existence of Adam and\\n\\t\\t\\t\\tsucceeds to his spiritual heritage. Humanity has been\\n\\t\\t\\t\\tgiven by Allah certain powers and faculties, whose\\n\\t\\t\\t\\tpossession creates on our side special spiritual\\n\\t\\t\\t\\tobligations which we must faithfully discharge: see v. 1.\\n\\t\\t\\t\\tand n. 682. These obligations may from a legal point of\\n\\t\\t\\t\\tview be considered as arising from implied Covenants. In\\n\\t\\t\\t\\tthe preceding verse (vii. 171) a reference was made to\\n\\t\\t\\t\\tthe implied Covenant of the Jewish nation. Now we\\n\\t\\t\\t\\tconsider the implied Covenant of the whole of humanity,\\n\\t\\t\\t\\tfor the Holy Prophet's mission was world-wide."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "172",
    "NoteID": "1147",
    "Body": "The Covenant is completed in this way. We acknowledge\\n\\t\\t\\t\\tthat Allah is our Creator, Cherisher, and Sustainer:\\n\\t\\t\\t\\ttherefore we acknowledge our duty to Him: when we so\\n\\t\\t\\t\\ttestify concerning ourselves, the obligation is as it\\n\\t\\t\\t\\twere assumed by us; for it follows from our very nature\\n\\t\\t\\t\\twhen it is pure and uncorrupted."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "173",
    "NoteID": "1148",
    "Body": "The latent faculties in man are enough to teach him the\\n\\t\\t\\t\\tdistinction between good and evil, to warn him of the\\n\\t\\t\\t\\tdangers that beset his life. But to awaken and stimulate\\n\\t\\t\\t\\tthem, a personal appeal is made to each individual\\n\\t\\t\\t\\tthrough the \"still small voice\" within him. This in its\\n\\t\\t\\t\\tuncorrupted state acknowledges the truth and, as it were,\\n\\t\\t\\t\\tswears its Covenant with Allah. There is, therefore, no\\n\\t\\t\\t\\texcuse for any individual to say, either (1) that he was\\n\\t\\t\\t\\tunmindful, or (2) that he should not be punished for the\\n\\t\\t\\t\\tsins of his fathers, because his punishment (if any)\\n\\t\\t\\t\\tcomes from his personal responsibility and is for his own\\n\\t\\t\\t\\trejection of faith and the higher spiritual influences."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "175",
    "NoteID": "1149",
    "Body": "Commentators differ whether this story or parable refers\\n\\t\\t\\t\\tto a particular individual, and if so, to whom. The story\\n\\t\\t\\t\\tof Balaam the seer, who was called out by Israel's\\n\\t\\t\\t\\tenemies to curse Israel, but who blessed Israel instead,\\n\\t\\t\\t\\t(Num. xxii., xxiii., xxiv,) is quite different. It is\\n\\t\\t\\t\\tbetter to take the parable in general sense. There are\\n\\t\\t\\t\\tmen, of talents and position, to whom great opportunities\\n\\t\\t\\t\\tof spiritual insight come, but they perversely pass them\\n\\t\\t\\t\\tby. Satan sees his opportunity and catches them up.\\n\\t\\t\\t\\tInstead of rising higher in the spiritual world, their\\n\\t\\t\\t\\tselfish and worldly desires and ambitions pull them down,\\n\\t\\t\\t\\tand they are lost."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "176",
    "NoteID": "1150",
    "Body": "Notice the contrast between the exalted spiritual honours\\n\\t\\t\\t\\twhich they would have received from Allah if they had\\n\\t\\t\\t\\tfollowed His Will, and the earthly desires which\\n\\t\\t\\t\\teventually bring them low to the position of beasts and\\n\\t\\t\\t\\tworse."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "176",
    "NoteID": "1151",
    "Body": "The dog, especially in the hot weather, lolls out his\\n\\t\\t\\t\\ttongue, whether he is attacked and pursued and is tired,\\n\\t\\t\\t\\tor he is left alone. It is part of his nature to slobber.\\n\\t\\t\\t\\tSo with the man who rejects Allah. Whether he is warned\\n\\t\\t\\t\\tor left alone, he continues to throw out his dirty\\n\\t\\t\\t\\tsaliva. The injury he will do will be to his own soul.\\n\\t\\t\\t\\tBut there may be infection in his evil example. So we\\n\\t\\t\\t\\tmust protect others. And we must never give up hope of\\n\\t\\t\\t\\this own amendment. So we must continue to warn him and\\n\\t\\t\\t\\tmake him think."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "178",
    "NoteID": "1152",
    "Body": "Those who reject Allah will be deprived of Allah's grace\\n\\t\\t\\t\\tand guidance. His Mercy is always open for sincere\\n\\t\\t\\t\\trepentance. But with each step downwards, they go lower\\n\\t\\t\\t\\tand lower, until they perish."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "179",
    "NoteID": "1153",
    "Body": "Cf. ii. 18. Though they have apparently all the faculties\\n\\t\\t\\t\\tof reason and perception, they have so deadened them that\\n\\t\\t\\t\\tthose faculties do not work, and they go headlong into\\n\\t\\t\\t\\thell. They are, as it were, made for Hell."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "180",
    "NoteID": "1154",
    "Body": "As we contemplate Allah's nature, we can use the most\\n\\t\\t\\t\\tbeautiful names to express His attributes. There are\\n\\t\\t\\t\\thundreds of such attributes. In the opening Sura, we have\\n\\t\\t\\t\\tthis indicated in a few comprehensive words, such as\\n\\t\\t\\t\\tRahman (most Gracious), Rahim (most Merciful),\\n\\t\\t\\t\\tRabb-ul-'alamin (Cherisher and Sustainer of the worlds).\\n\\t\\t\\t\\tOur bringing such names to remembrance is part of our\\n\\t\\t\\t\\tPrayer and Praise. But we must not associate with people\\n\\t\\t\\t\\twho use Allah's names profanely, or so as to suggest\\n\\t\\t\\t\\tanything derogatory to His dignity or His unity. Cf.\\n\\t\\t\\t\\txvii. 110. A) See also lxviii. 44 and n. 5626."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "184",
    "NoteID": "1155",
    "Body": "Their companion, i.e., the Holy Prophet, who lived with\\n\\t\\t\\t\\tand amongst them. He was accused of madness because he\\n\\t\\t\\t\\tbehaved differently from them. He had no selfish\\n\\t\\t\\t\\tambitions; he was always true, in thought, word, and\\n\\t\\t\\t\\tdeed: he was kind and considerate to the weak, and was\\n\\t\\t\\t\\tnot dazzled by worldly power or wealth or position: he\\n\\t\\t\\t\\twas undeterred by fear of the strong, the mockery of the\\n\\t\\t\\t\\tcynics, the bitterness of the evil, or the indifference\\n\\t\\t\\t\\tof the heedless. That is why he stood out boldly against\\n\\t\\t\\t\\twrong: he did not mince his words, and his warnings were\\n\\t\\t\\t\\tnot mealy-mouthed."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "184",
    "NoteID": "1156",
    "Body": "Mubin; perspicuous. The reason why I have not used a\\n\\t\\t\\t\\tsimpler word, such as \"plain\" or \"clear\" is explained in\\n\\t\\t\\t\\tn. 716 to v. 15. Al-Mustafa's sermons were not polite\\n\\t\\t\\t\\treminders, with an eye to the flattery of weaknesses in\\n\\t\\t\\t\\thigh places or national vanities or crowd passions. They\\n\\t\\t\\t\\tbrought out every foible into the glare of light, by a\\n\\t\\t\\t\\tfiery eloquence fed by inspiration from Allah."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "185",
    "NoteID": "1157",
    "Body": "An appeal to Allah's most wonderful universe should at\\n\\t\\t\\t\\tonce convince a thinking mind of man's nothingness, and\\n\\t\\t\\t\\tAllah's power, glory, and goodness. Man's term here is\\n\\t\\t\\t\\tfleeting. If he is not warned by the great Signs, and the\\n\\t\\t\\t\\tMessages which call his attention to them, is he capable\\n\\t\\t\\t\\tof any faith at all?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "186",
    "NoteID": "1158",
    "Body": "Cf. ii. 15. If Allah's light is removed, the best of them\\n\\t\\t\\t\\tcan only wander hither and thither, like blind men, in\\n\\t\\t\\t\\tdistraction."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "187",
    "NoteID": "1159",
    "Body": "The fact of its coming is a certainty: the exact time\\n\\t\\t\\t\\tappointed for it is not revealed by Allah. If it were it\\n\\t\\t\\t\\twould be so momentous as to disturb our thoughts and\\n\\t\\t\\t\\tlife. It would be a heavy burden to us. Our duty is to be\\n\\t\\t\\t\\tprepared for it at all times. It will come when we least\\n\\t\\t\\t\\texpect it. In the present Gospels Jesus says the same\\n\\t\\t\\t\\tthing: he does not know the Hour, but it will come\\n\\t\\t\\t\\tsuddenly. \"But of that day and that Hour knoweth no man,\\n\\t\\t\\t\\tno, not the angels which are in heaven, neither the Son,\\n\\t\\t\\t\\tbut the Father. Take ye heed, watch and pray: for ye know\\n\\t\\t\\t\\tnot when the time is.\" (Mark. xiii. 32-33)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "187",
    "NoteID": "1160",
    "Body": "Hafi is usually construed to mean; \"eager or anxious in\\n\\t\\t\\t\\tsearch of\": the preposition following here is 'an =\\n\\t\\t\\t\\tconcerning, about. Some commentators (including Ragib)\\n\\t\\t\\t\\tunderstand it in this passage to mean \"well-acquainted.\"\\n\\t\\t\\t\\tIn xix. 47, with the preposition by following it, it\\n\\t\\t\\t\\tsignifies \"well-disposed to\", favourable to, good to,\\n\\t\\t\\t\\tkind to.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "188",
    "NoteID": "1161",
    "Body": "A warner to all, and a bringer of glad tidings to those\\n\\t\\t\\t\\twho have faith, because they will profit by the glad\\n\\t\\t\\t\\ttidings. As every one is invited to faith, the glad\\n\\t\\t\\t\\ttidings are offered to all, but they are not necessarily\\n\\t\\t\\t\\taccepted by all."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "189",
    "NoteID": "1162",
    "Body": "Cf. iv. 1, and n. 504, where the construction is\\n\\t\\t\\t\\texplained."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "189",
    "NoteID": "1163",
    "Body": "The mystery of the physical birth of man, as it affects\\n\\t\\t\\t\\tthe father and the mother, only touches the imagination\\n\\t\\t\\t\\tof the parents in the later stages when the child is yet\\n\\t\\t\\t\\tunborn and yet the life stirs within the body of the\\n\\t\\t\\t\\texpectant mother. The coming of the new life is a solemn\\n\\t\\t\\t\\tthing, and is fraught with much hope as well as much\\n\\t\\t\\t\\tunknown risk to the mother herself. The parents in their\\n\\t\\t\\t\\tanxiety turn to Allah. If this feeling of solemnity,\\n\\t\\t\\t\\thope, and looking towards Allah were maintained after\\n\\t\\t\\t\\tbirth, all would be well for the parents as well as for\\n\\t\\t\\t\\tthe rising generation. But the attitude changes, as the\\n\\t\\t\\t\\tverses following show."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "189",
    "NoteID": "1164",
    "Body": "Goodly: salih: includes the following ideas: sound in\\n\\t\\t\\t\\tbody and mind; healthy; righteous; of good moral\\n\\t\\t\\t\\tdisposition."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "190",
    "NoteID": "1165",
    "Body": "When the child is born, the parents forget that it is a\\n\\t\\t\\t\\tprecious gift of Allah,-a miracle of Creation, which\\n\\t\\t\\t\\tshould lift their minds up to the higher things of Allah.\\n\\t\\t\\t\\tInstead, their gradual familiarity with the new life\\n\\t\\t\\t\\tmakes them connect it with many superstitious ideas or\\n\\t\\t\\t\\trites and ceremonies, or they take it as a matter of\\n\\t\\t\\t\\tcourse, is a little plaything of the material world. This\\n\\t\\t\\t\\tleads to idolatry or false worship, or the selling up of\\n\\t\\t\\t\\tfalse standards, in derogation of the dignity of Allah."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "193",
    "NoteID": "1166",
    "Body": "When false worship takes root, the teacher of Truth finds\\n\\t\\t\\t\\tmuch to discourage him. As far as he is concerned, it\\n\\t\\t\\t\\tseems as if he has produced no effect. Yet his duty is to\\n\\t\\t\\t\\tcontinue his work, in the spirit of verse 199 below,\\n\\t\\t\\t\\tforgiving all opposition, teaching what is right, and not\\n\\t\\t\\t\\tjoining the ignorant in their attitude of doubt and\\n\\t\\t\\t\\tindecision."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "194",
    "NoteID": "1167",
    "Body": "False gods, whether idols or deified men, or ideas and\\n\\t\\t\\t\\tsuperstitions, have no existence of their own,\\n\\t\\t\\t\\tindependent of Allah's creation. They are Allah's\\n\\t\\t\\t\\tcreatures, and like servents are subject to His\\n\\t\\t\\t\\tauthority. Deified men are not real men, but false ideas\\n\\t\\t\\t\\tof men. They cannot help themselves: how can they help\\n\\t\\t\\t\\tothers?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "195",
    "NoteID": "1168",
    "Body": "Here is a test and a challenge. If the false gods had any\\n\\t\\t\\t\\tpower or even existence, collect them all together, and,\\n\\t\\t\\t\\tsays the Prophet of Allah, \"Let them do their worst\\n\\t\\t\\t\\tagainst me.\" They cannot: because the whole thing is\\n\\t\\t\\t\\tbased on a superstition and a chimaera."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "198",
    "NoteID": "1169",
    "Body": "The beauty and righteousness of Al-Mustafa's life were\\n\\t\\t\\t\\tacknowledged on all hands, until he received the mission\\n\\t\\t\\t\\tto preach and to fight against evil. What happened then?\\n\\t\\t\\t\\tEvil erected barricades for itself. It had eyes, but it\\n\\t\\t\\t\\trefused to see. It had ears, but it refused to hear. It\\n\\t\\t\\t\\thad intelligence, but it blocked up its channels of\\n\\t\\t\\t\\tunderstanding. Even now, after Fourteen Centuries, a life\\n\\t\\t\\t\\tof unexampled purity, probity, justice, and righteousness\\n\\t\\t\\t\\tis seen in false lights by blind detractors!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "199",
    "NoteID": "1170",
    "Body": "Allah comforts the Prophet and directs his mind to three\\n\\t\\t\\t\\tprecepts: (1) to forgive injuries, insults, and\\n\\t\\t\\t\\tpersecution; (2) to continue to declare the faith that\\n\\t\\t\\t\\twas in him, and not only to declare it, but to act up to\\n\\t\\t\\t\\tit in all his dealings with friends and foes; (3) to pay\\n\\t\\t\\t\\tno attention to ignorant fools, who raised doubts or\\n\\t\\t\\t\\tdifficulties, hurled taunts or reproaches, or devised\\n\\t\\t\\t\\tplots to defeat the truth: they were to be ignored and\\n\\t\\t\\t\\tpassed by, not to be engaged in fights and fruitless\\n\\t\\t\\t\\tcontroversies, or conciliated by compromises."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "200",
    "NoteID": "1171",
    "Body": "Even a Prophet of Allah is but human. He might think that\\n\\t\\t\\t\\trevenge or retaliation, or a little tactful silence when\\n\\t\\t\\t\\tevil stalks abroad, or some compromise with ignorance,\\n\\t\\t\\t\\tmight be best for the cause. He is to reject such\\n\\t\\t\\t\\tsuggestions."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "201",
    "NoteID": "1172",
    "Body": "Allah protects His own, as no one else can. He is the\\n\\t\\t\\t\\tsure refuge-and the only one-for men of faith. If we are\\n\\t\\t\\t\\tconfused or angry, being blinded by this world, He will\\n\\t\\t\\t\\topen our eyes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "202",
    "NoteID": "1173",
    "Body": "We go back to consider the ungodly, whom we left at verse\\n\\t\\t\\t\\t198, in order to be taught our behaviour towards evil.\\n\\t\\t\\t\\tThe forces of evil never relax their efforts to draw\\n\\t\\t\\t\\ttheir \"brethren\" (those who go into their family) deeper\\n\\t\\t\\t\\tand deeper into the mire of sin and destruction."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "203",
    "NoteID": "1174",
    "Body": "\"Ayat\" here, I think, means specially an Ayat of the Holy\\n\\t\\t\\t\\tQur-an. The infidels did not believe in revelation, and\\n\\t\\t\\t\\tused to taunt the Holy Prophet, as much as to say that he\\n\\t\\t\\t\\tused to put together words and promulgate them as\\n\\t\\t\\t\\trevelation. The answer is contained in the sentence that\\n\\t\\t\\t\\tfollows. No human composition could contain the beauty,\\n\\t\\t\\t\\tpower, and spiritual insight of the Qur-An. Without\\n\\t\\t\\t\\tinspiration it is impossible to suppose that a man, with\\n\\t\\t\\t\\tor without literary and philosophic training could\\n\\t\\t\\t\\tproduce such a book as the Qur-an. Commentators of the\\n\\t\\t\\t\\tQur-An, however, consider Ayah here to refer to miracle\\n\\t\\t\\t\\tas the context seems to evidence."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "203",
    "NoteID": "1175",
    "Body": "\"Lights\": eyes, faculty of spiritual insight. The\\n\\t\\t\\t\\trevelation is for us (1) spiritual eyes, (2) guidance,\\n\\t\\t\\t\\tand (3) mercy, (1) is the highest in degree: just as a\\n\\t\\t\\t\\tblind man, if he is given eyes and the faculty of sight,\\n\\t\\t\\t\\tis at once removed into an entirely new world, so those\\n\\t\\t\\t\\twho can reach the stage of spiritual insight pass into\\n\\t\\t\\t\\tand become citizens of a wholly new spiritual World, (2)\\n\\t\\t\\t\\tis next in degree; the man of the world can act up to the\\n\\t\\t\\t\\tteaching about right conduct and prepare for the\\n\\t\\t\\t\\tHereafter, (3) is the Mercy of Allah, free to every one,\\n\\t\\t\\t\\tsaint and sinner, who sincerely believes and puts his\\n\\t\\t\\t\\ttrust in Allah."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "206",
    "NoteID": "1176",
    "Body": "The higher you are in spiritual attainment, the more is\\n\\t\\t\\t\\tyour desire and your opportunity to serve and worship\\n\\t\\t\\t\\tyour Lord and Cherisher and the Lord and Cherisher of all\\n\\t\\t\\t\\tthe worlds: and the greater is your pride in that service\\n\\t\\t\\t\\tand that worship."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "206",
    "NoteID": "1177",
    "Body": "At this stage a Sajda or prostration is indicated, as a\\n\\t\\t\\t\\tsign of our humble acceptance of the privilege of serving\\n\\t\\t\\t\\tand worshipping Allah,-a fitting close to Sura in which\\n\\t\\t\\t\\twe are led, through a contemplation of the stories of the\\n\\t\\t\\t\\tMessengers of Allah, to the meaning of revelation and its\\n\\t\\t\\t\\trelation to our moral and spiritual progress."
  }
]
