[
  {
    "SurahNumber": "92",
    "AyahNumber": "1",
    "NoteID": "6159",
    "Body": "The evidence of three things is invoked, viz., Night,\\n\\t\\t\\t\\tDay, and Sex, and the conclusion is stated in verse 4,\\n\\t\\t\\t\\tthat men's aims are diverse. But similarly there are\\n\\t\\t\\t\\tcontrasts in nature. What contrast can be greater than\\n\\t\\t\\t\\tbetween Night and Day? When the Night spreads her veil,\\n\\t\\t\\t\\tthe sun's light is hidden, but not lost. The sun is in\\n\\t\\t\\t\\this place all the time, and will come forth in all his\\n\\t\\t\\t\\tglory again in his own good time. Cf. xci. 3, 4, and n.\\n\\t\\t\\t\\t6149. Man pursuing diverse aims may find, owing to his\\n\\t\\t\\t\\town position, Allah's light obscured from him for a time,\\n\\t\\t\\t\\tbut he must strive hard to put himself in a position to\\n\\t\\t\\t\\treach it in all its glory."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "3",
    "NoteID": "6160",
    "Body": "Ma masdariya as in xci. 5-7; see there n. 6151."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "3",
    "NoteID": "6161",
    "Body": "The wonder of the sexes runs through all life. There is\\n\\t\\t\\t\\tattraction between opposite; each performs its own\\n\\t\\t\\t\\tfunctions, having special characters, primary and\\n\\t\\t\\t\\tsecondary, within limited spheres, and yet both have\\n\\t\\t\\t\\tcommon characteristics in many other spheres. Each is\\n\\t\\t\\t\\tindispensable to the other. Love in its noblest sense is\\n\\t\\t\\t\\tthe type of heavenly love and the highest good; in its\\n\\t\\t\\t\\tdebasement it leads to the lowest sins and the worst\\n\\t\\t\\t\\tcrimes. Here, then, striving is necessary for the highest\\n\\t\\t\\t\\tgood."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "4",
    "NoteID": "6162",
    "Body": "There are wide contrasts in the nature and aims of men.\\n\\t\\t\\t\\tThese may be broadly divided into two classes, good and\\n\\t\\t\\t\\tevil. As night replaces day on account of certain\\n\\t\\t\\t\\trelative position, but does not annihilate it, so evil\\n\\t\\t\\t\\tmay for a time obscure good but cannot blot it out.\\n\\t\\t\\t\\tAgain, night in certain circumstances (e.g. for rest) is\\n\\t\\t\\t\\ta blessing; so certain things, which may seem evils to\\n\\t\\t\\t\\tus, may be really blessings in disguise. Whatever our\\n\\t\\t\\t\\taims or positions, we must seek the highest truth from\\n\\t\\t\\t\\tthe light of Allah. Considering these contrasts, do not\\n\\t\\t\\t\\tbe surprised or depressed. Men's immediate aims may be\\n\\t\\t\\t\\tdifferent. The duty of all is to seek the one true light."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "6",
    "NoteID": "6163",
    "Body": "The good are distinguished here by three signs: (1)\\n\\t\\t\\t\\tlarge-hearted sacrifices for Allah and men: (2) fear of\\n\\t\\t\\t\\tAllah, which shows itself in righteous conduct for Taqwa,\\n\\t\\t\\t\\t(see n. 26 to ii. 2) includes just action as well as a\\n\\t\\t\\t\\tmental state: and (3) truth and sincerity in recognising\\n\\t\\t\\t\\tand supporting all that is morally beautiful, for Husn is\\n\\t\\t\\t\\tthe good as well as the beautiful."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "7",
    "NoteID": "6164",
    "Body": "So far from there being any hardship in a good life, the\\n\\t\\t\\t\\trighteous will enjoy their life more and more, and Allah\\n\\t\\t\\t\\twill make their path smoother and smoother until they\\n\\t\\t\\t\\treach eventual Bliss."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "9",
    "NoteID": "6165",
    "Body": "The evil are distinguished here by three signs: (1)\\n\\t\\t\\t\\tselfish greed and denial of other people's rights; (2)\\n\\t\\t\\t\\tarrogance and self-sufficiency (xcvi. 6-7); and (3)\\n\\t\\t\\t\\tknowingly dishonouring Truth out of spite, or seeing\\n\\t\\t\\t\\tugliness where there is beauty. Such men's downward\\n\\t\\t\\t\\tprogress gathers momentum as they go, and their end can\\n\\t\\t\\t\\tbe nothing but Misery. Where will be their boasted wealth\\n\\t\\t\\t\\tand possessions, or their self-confidence?"
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "11",
    "NoteID": "6166",
    "Body": "Wealth amassed in this world will be of no use at the Day\\n\\t\\t\\t\\tof Final Judgment, nor will any material advantages of\\n\\t\\t\\t\\tthis life bring profit by themselves in the Hereafter.\\n\\t\\t\\t\\tWhat will count will be a life of truth and\\n\\t\\t\\t\\trighteousness, and of goodness to all the creatures of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "12",
    "NoteID": "6167",
    "Body": "Allah in His infinite mercy has provided full guidance to\\n\\t\\t\\t\\tHis creatures. All through His creation there are\\n\\t\\t\\t\\tsign-posts indicating the right way. To man He has given\\n\\t\\t\\t\\tthe five senses of perception, with mental and spiritual\\n\\t\\t\\t\\tfaculties for coordinating his physical perceptions and\\n\\t\\t\\t\\tleading him higher and higher in thought and feeling. He\\n\\t\\t\\t\\thas besides sent inspired men as prophets for further\\n\\t\\t\\t\\tteaching and guidance."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "13",
    "NoteID": "6168",
    "Body": "In the End man will return to Allah, and even from the\\n\\t\\t\\t\\tbeginning of man's life Allah's mercies and loving care\\n\\t\\t\\t\\tsurround him. In the probationary period of man's life,\\n\\t\\t\\t\\the has a measure of free-will, and he is expected to use\\n\\t\\t\\t\\tit in such a way as to bring his whole being into harmony\\n\\t\\t\\t\\twith the universal Will and Law. For he will have to\\n\\t\\t\\t\\tanswer for the right use of his talents and\\n\\t\\t\\t\\topportunities. If man's will has any meaning, he has the\\n\\t\\t\\t\\tchoice of accepting Allah's guidance or rejecting it, and\\n\\t\\t\\t\\tin the latter case he must take the consequences. Hence\\n\\t\\t\\t\\tthe warning of the future \"Fire\" in the next verse."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "15",
    "NoteID": "6169",
    "Body": "The Fire of Punishment will not reach any except those\\n\\t\\t\\t\\twho have deliberately sinned against their conscience and\\n\\t\\t\\t\\trejected Allah's Truth. The term used for them is \"Ashqa\"\\n\\t\\t\\t\\t(superlative degree). Cf. lxxxvii. 11. The corresponding\\n\\t\\t\\t\\tidea in Christian theology is expressed in the following\\n\\t\\t\\t\\tsentence. \"All manner of sin and blasphemy shall be\\n\\t\\t\\t\\tforgiven unto men: but the blasphemy against the Holy\\n\\t\\t\\t\\tGhost shall not be forgiven unto men\" (Matt. xii. 31)."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "17",
    "NoteID": "6170",
    "Body": "\"Those most devoted to Allah\": the Atqa, the\\n\\t\\t\\t\\tAllah-fearing men who live lives of purity, and seek only\\n\\t\\t\\t\\tfor the \"Face of their Lord Most High\". See the verses\\n\\t\\t\\t\\tfollowing."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "18",
    "NoteID": "6171",
    "Body": "The spending may be for charity, or for good works, such\\n\\t\\t\\t\\tas advancing the cause of knowledge or science, or\\n\\t\\t\\t\\tsupporting ideals, etc. \"Wealth\" must be understood not\\n\\t\\t\\t\\tonly for money or material goods, but also for any\\n\\t\\t\\t\\tadvantage or opportunity which a man happens to enjoy,\\n\\t\\t\\t\\tand which he can place at the service of others."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "18",
    "NoteID": "6172",
    "Body": "The Arabic root word zaka implies both increase and\\n\\t\\t\\t\\tpurification, and both meanings may be understood to be\\n\\t\\t\\t\\timplied here. Wealth (understood both literally and\\n\\t\\t\\t\\tmetaphorically) is not for selfish enjoyment or idle\\n\\t\\t\\t\\tshow. It is held on trust. It may be a trial in itself,\\n\\t\\t\\t\\tfrom which a man who emerges successfully is a man all\\n\\t\\t\\t\\tthe purer in his life; and even if he was a good man\\n\\t\\t\\t\\tbefore, his proper use of his wealth increases his\\n\\t\\t\\t\\tposition and dignity in the moral and spiritual world."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "19",
    "NoteID": "6173",
    "Body": "The good man does not give in charity or do his good\\n\\t\\t\\t\\tdeeds with the motive that he is returning someone else's\\n\\t\\t\\t\\tfavour and compensating and rewarding someone for some\\n\\t\\t\\t\\tservice done to him or expecting some reward in retum for\\n\\t\\t\\t\\this own good deed: the sole motive in his mind is that he\\n\\t\\t\\t\\tdesires the Countenance or Good Pleasure of Allah Most\\n\\t\\t\\t\\tHigh. This \"Countenance\" or \"Face\" (Arabic, Wajh) implies\\n\\t\\t\\t\\tgood pleasure or approval; but it implies something more.\\n\\t\\t\\t\\tIt also means the Cause,-either the \"final cause\" or the\\n\\t\\t\\t\\t\"efficient cause\" of Aristotelian philosophy. For the\\n\\t\\t\\t\\tAtqa would refer everything, backwards in origin and\\n\\t\\t\\t\\tforwards in destiny, to Allah. Allah is the source of\\n\\t\\t\\t\\ttheir goodness, as well as its goal or purpose."
  },
  {
    "SurahNumber": "92",
    "AyahNumber": "20",
    "NoteID": "6174",
    "Body": "The definition of Righteousness, Charity, or\\n\\t\\t\\t\\tSelf-sacrifice, becomes thus highly spiritualised. The\\n\\t\\t\\t\\tAtqa are so completely identified with Allah's Will that\\n\\t\\t\\t\\teverything else is blotted out to them. What would seem\\n\\t\\t\\t\\tto be sacrifice from other points of view, becomes their\\n\\t\\t\\t\\town highest pleasure and satisfaction. Every virtuous man\\n\\t\\t\\t\\twill have his own bliss, for there are degrees in virtue\\n\\t\\t\\t\\tand bliss. This supreme bliss is the portion-not the\\n\\t\\t\\t\\tprize-of supreme virtue."
  }
]
