[
  {
    "SurahNumber": "40",
    "AyahNumber": "1",
    "NoteID": "4356",
    "Body": "See the Introduction to this Sura."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "2",
    "NoteID": "4357",
    "Body": "This verse is the same as xxxix: 1, except for the last\\n\\t\\t\\t\\twords describing the attribute of Allah. In S. xxxix. 1,\\n\\t\\t\\t\\tit was \"Full of Wisdom\", because stress was laid on the\\n\\t\\t\\t\\twisdom of Allah's Plan in ordering His World. In this\\n\\t\\t\\t\\tSura the stress is laid on Allah's Knowledge, before\\n\\t\\t\\t\\twhich the shallow knowledge of men is vain (xi. 83)."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "3",
    "NoteID": "4358",
    "Body": "Allah's knowledge is supreme and all-reaching. But there\\n\\t\\t\\t\\tare other attributes of His, which concern us even more\\n\\t\\t\\t\\tintimately; e.g., He forgives sin and accepts our\\n\\t\\t\\t\\trepentance when it is sincere and results in our change\\n\\t\\t\\t\\tof heart and life: but He is also just, and strict in\\n\\t\\t\\t\\tpunishment; and so no loophole will be left for Evil\\n\\t\\t\\t\\texcept in repentance. And further, all His attributes\\n\\t\\t\\t\\treach forward to everything: His Mercy, as well as His\\n\\t\\t\\t\\tKnowledge and Justice; His Bounties as well as His\\n\\t\\t\\t\\tPunishments."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "4",
    "NoteID": "4359",
    "Body": "Allah's knowledge and attributes are perfect, and\\n\\t\\t\\t\\teverything around us proclaims this. We are surrounded by\\n\\t\\t\\t\\tHis Signs. It is only want of Faith that will make people\\n\\t\\t\\t\\tdispute about them."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "4",
    "NoteID": "4360",
    "Body": "Cf. iii. 196. Their strutting about shows how little they\\n\\t\\t\\t\\tcan read the Signs."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "5",
    "NoteID": "4361",
    "Body": "Cf. xxxviii. 11-13, and n. 4158. All the hosts of\\n\\t\\t\\t\\twickedness collected together from history will have no\\n\\t\\t\\t\\tpower against Allah's Truth, or the Messenger of that\\n\\t\\t\\t\\tTruth, or Allah's holy Plan for all His Creation."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "5",
    "NoteID": "4362",
    "Body": "Whenever a great or vital Truth is proclaimed and\\n\\t\\t\\t\\trenewed, there are always shallow minds that are ready to\\n\\t\\t\\t\\tdispute about it! And what petty and vain arguments they\\n\\t\\t\\t\\tadvance! They think they can discredit or condemn the\\n\\t\\t\\t\\tTruth in this way, or render \"of none effect\" Allah's\\n\\t\\t\\t\\tPlan. But they are mistaken. If they seem to succeed for\\n\\t\\t\\t\\ta time, that is merely their trial. They may try to plan\\n\\t\\t\\t\\tand plot against Allah's men. But their plots will fail\\n\\t\\t\\t\\tin the long run. They will themselves be caught in their\\n\\t\\t\\t\\town snares. And then, how terrible will be their\\n\\t\\t\\t\\tPunishment!"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "5",
    "NoteID": "4363",
    "Body": "Cf. xiii. 32."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "6",
    "NoteID": "4364",
    "Body": "Cf. xxxix. 71. The Decree, or Word of Allah, by which\\n\\t\\t\\t\\tEvil was to be judged and condemned, was proved true\\n\\t\\t\\t\\tagainst these men. They are \"Companions of the Fire\": in\\n\\t\\t\\t\\tother words, they are fit to live only in Hell."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "7",
    "NoteID": "4365",
    "Body": "Cf. xxxix. 75."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "7",
    "NoteID": "4366",
    "Body": "Cf. vi. 80; vii. 89 and 98."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "8",
    "NoteID": "4367",
    "Body": "There is nothing selfish in prayer. We pray for all who\\n\\t\\t\\t\\tare true and sincere. But just as Evil is catching, so\\n\\t\\t\\t\\tGoodness is catching in another sense. The associates of\\n\\t\\t\\t\\tthe Good and those near and dear to them also share in\\n\\t\\t\\t\\ttheir goodness and happiness, if only they try to walk in\\n\\t\\t\\t\\tthe same Way. And the Grace of Allah is working for all,\\n\\t\\t\\t\\tall the time."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "9",
    "NoteID": "4368",
    "Body": "That is the final Judgment, and any who is saved from the\\n\\t\\t\\t\\tevil consequences of their deeds in this life will truly\\n\\t\\t\\t\\thave been saved by Allah's Mercy, and for them it is the\\n\\t\\t\\t\\thighest achievement they could have, the attainment of\\n\\t\\t\\t\\tall their wishes, the fulfilment of their destiny and the\\n\\t\\t\\t\\tnoblest purpose of their Life, the supreme Salvation and\\n\\t\\t\\t\\tFelicity."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "9",
    "NoteID": "4369",
    "Body": "Muslim Salvation, then, is more positive than mere safety\\n\\t\\t\\t\\tfrom dangers or evils: it is the complete fulfilment of\\n\\t\\t\\t\\tthe noble destiny of man in the attainment of the fullest\\n\\t\\t\\t\\tGrace."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "10",
    "NoteID": "4370",
    "Body": "The Unbelievers having rejected Allah's Signs, they now\\n\\t\\t\\t\\tsee how they are shut out from Grace, and they feel\\n\\t\\t\\t\\tdisgusted with themselves. How much greater was Allah's\\n\\t\\t\\t\\tdispleasure with them, when He showered mercy upon mercy\\n\\t\\t\\t\\ton them and they yet rebelled! How could they now hope\\n\\t\\t\\t\\tfor Grace!"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "11",
    "NoteID": "4371",
    "Body": "Cf. ii. 28: \"How can ye reject the faith in Allah?-seeing\\n\\t\\t\\t\\tthat ye were without life, and He gave you life; then\\n\\t\\t\\t\\twill He cause you to die, and will again bring you to\\n\\t\\t\\t\\tlife; and again to Him will ye return.\" Non-existence, or\\n\\t\\t\\t\\texistence as clay without life was equivalent to death.\\n\\t\\t\\t\\tThen came true Life on this earth; then came physical\\n\\t\\t\\t\\tdeath or the cessation of our physical life; and now at\\n\\t\\t\\t\\tthe Resurrection, is the second life."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "12",
    "NoteID": "4372",
    "Body": "Cf. xxxix. 45, and n. 4313. When exclusive devotion is\\n\\t\\t\\t\\tnot rendered to Allah, there is no true understanding, in\\n\\t\\t\\t\\tthe mind of a creature, of his own true position, or of\\n\\t\\t\\t\\tthe working of the Divine Will and Purpose. How can he\\n\\t\\t\\t\\tthen hope to achieve the purpose of his life, or obtain\\n\\t\\t\\t\\tAllah's Mercy, which is the only way to obtain release\\n\\t\\t\\t\\tfrom the consequences of Sin?"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "12",
    "NoteID": "4373",
    "Body": "At the Judgment, the matter will have passed out of the\\n\\t\\t\\t\\tstage at which further chances could have been hoped for.\\n\\t\\t\\t\\tBut in any case Allah is High above all things, Great\\n\\t\\t\\t\\tabove all that we can conceive of, both in Mercy and in\\n\\t\\t\\t\\tJustice. The Decision will be with Him, and Him alone."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "13",
    "NoteID": "4374",
    "Body": "Lest it should be thought that Allah's Grace did not meet\\n\\t\\t\\t\\tthe Sinner again and again and offer Allah's Mercy again\\n\\t\\t\\t\\tand again, it is pointed out that Allah's Signs were\\n\\t\\t\\t\\tfreely vouchsafed everywhere and continuously, and that\\n\\t\\t\\t\\tevery kind of means was provided for man's \"Sustenance\"\\n\\t\\t\\t\\tor growth and development, physical, mental, and\\n\\t\\t\\t\\tspiritual. But only those could take advantage of it who\\n\\t\\t\\t\\tturned their attention to Allah, who submitted their will\\n\\t\\t\\t\\tto Him."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "14",
    "NoteID": "4375",
    "Body": "Cf. ix. 33."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "15",
    "NoteID": "4376",
    "Body": "He is raised far above any rank or degree which we can\\n\\t\\t\\t\\timagine. It is possible also to treat Rafi as equivalent\\n\\t\\t\\t\\tto Rafi', meaning that He can raise His creatures to the\\n\\t\\t\\t\\thighest ranks and degrees for He is the fountain of all\\n\\t\\t\\t\\thonour."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "15",
    "NoteID": "4377",
    "Body": "The choosing of a man to be the recipient of\\n\\t\\t\\t\\tinspiration-to be the standard bearer of Allah's Truth-is\\n\\t\\t\\t\\tthe highest honour possible in the Kingdom of Allah. And\\n\\t\\t\\t\\tAllah bestows that honour according to His own most\\n\\t\\t\\t\\tperfect Will and Plan, which no one can question, for He\\n\\t\\t\\t\\tis the fountain of all honour, dignity, and authority."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "15",
    "NoteID": "4378",
    "Body": "All men will meet together and meet their Lord at the\\n\\t\\t\\t\\tResurrection, no matter how far scattered they may have\\n\\t\\t\\t\\tbeen in life or in death."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "16",
    "NoteID": "4379",
    "Body": "The Kingdom of Allah-of Justice, Truth, and\\n\\t\\t\\t\\tRighteousness-will then be fully established. Evil can\\n\\t\\t\\t\\tthen no more come into competition with Good, even in the\\n\\t\\t\\t\\tsubjective consciousness of man."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "17",
    "NoteID": "4380",
    "Body": "Swift in several senses; (1) the time of the present life\\n\\t\\t\\t\\tor of the interval before Judgment. i.e., before the\\n\\t\\t\\t\\trestoration of true values, is so short as compared to\\n\\t\\t\\t\\tEternity, that it may be counted as negligible: in the\\n\\t\\t\\t\\tnext verse the Day is characterised as \"(ever) drawing\\n\\t\\t\\t\\tnear\"; (2) in spite of the great concourse of souls to be\\n\\t\\t\\t\\tjudged, the process of Judgment will be almost\\n\\t\\t\\t\\tinstantaneous, \"in the twinkling of an eye\" (xvi. 77),\\n\\t\\t\\t\\tbecause everything is already known to Allah; and yet not\\n\\t\\t\\t\\tthe least injustice will be done."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "18",
    "NoteID": "4381",
    "Body": "Hearts will come right up to the Throats to choke them:\\n\\t\\t\\t\\tan idiom implying that the whole of their life-functions\\n\\t\\t\\t\\twill be choked up with terror. But a more subtle meaning\\n\\t\\t\\t\\temerges from further analysis. The heart (or the breast)\\n\\t\\t\\t\\tis the seat of affection, emotion, and every kind of\\n\\t\\t\\t\\tfeeling, such as terror, pain, despair, etc. These things\\n\\t\\t\\t\\twill as it were overflow right up to the throat and choke\\n\\t\\t\\t\\tit. The throat is the vehicle for the voice; their voice\\n\\t\\t\\t\\twill be choked, and they will be able to say nothing. The\\n\\t\\t\\t\\tthroat is the channel for food, which goes to the stomach\\n\\t\\t\\t\\tand maintains a healthy functioning of life; the choking\\n\\t\\t\\t\\tmeans that the healthy functioning will stop, and there\\n\\t\\t\\t\\twill be nothing but woe."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "18",
    "NoteID": "4382",
    "Body": "In that enforcement of personal responsibility, what\\n\\t\\t\\t\\tsympathy or intercession can the wrong-doers get?"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "19",
    "NoteID": "4383",
    "Body": "Men may be taken in by tricks that deceive with the eyes,\\n\\t\\t\\t\\tbut Allah's perfect knowledge penetrates through all\\n\\t\\t\\t\\tmysteries. \"Treachery of the eyes\" may mean several\\n\\t\\t\\t\\tthings; (1) a sleight of hand (literally or figuratively)\\n\\t\\t\\t\\tmay deceive in respect of the eyes of beholders, for the\\n\\t\\t\\t\\tthings that they see do not actually happen; (2) it may\\n\\t\\t\\t\\tbe the deceiver's own eyes that play false, because, for\\n\\t\\t\\t\\texample, they show love when hatred is meant; or (3) it\\n\\t\\t\\t\\tmay be that the eyes of the beholder play him false, in\\n\\t\\t\\t\\tthat he sees things that he should not see, and thus sins\\n\\t\\t\\t\\twith his eyes."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "19",
    "NoteID": "4384",
    "Body": "Here we come into the region of evil motives and thoughts\\n\\t\\t\\t\\twhich may be concealed in the hearts, breast, or mind,\\n\\t\\t\\t\\tbut which are all perfectly known to Allah."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "20",
    "NoteID": "4385",
    "Body": "If men build their hopes or their faith in anything\\n\\t\\t\\t\\texcept the Divine Grace, they will find themselves\\n\\t\\t\\t\\tdeserted. Any pretences that they make will be known to\\n\\t\\t\\t\\tAllah. On the other hand every single good act, or word,\\n\\t\\t\\t\\tor motive, or aspiration of their win, will reach Allah's\\n\\t\\t\\t\\tThrone of Mercy."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "21",
    "NoteID": "4386",
    "Body": "Cf. xxx. 9. and several other similar passages."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "21",
    "NoteID": "4387",
    "Body": "See n. 3515 to xxx. 9. We can learn from the history of\\n\\t\\t\\t\\tprevious nations. Many of them were more powerful, or\\n\\t\\t\\t\\thave left finer and more imposing monuments and made a\\n\\t\\t\\t\\tdeeper impression on the world around them than any\\n\\t\\t\\t\\tparticular generation addressed. \"Traces\" in the text may\\n\\t\\t\\t\\tbe taken in that extended sense. And yet all this did not\\n\\t\\t\\t\\tsave them from the consequences of their sins. They were\\n\\t\\t\\t\\tcalled to account and punished. None of the power or pomp\\n\\t\\t\\t\\tor skill of which they boasted could for a moment ward\\n\\t\\t\\t\\toff the punishment when it came in God's good time."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "22",
    "NoteID": "4388",
    "Body": "But Allah in His Mercy always sends a Message of warning\\n\\t\\t\\t\\tand good news through his messengers, and He gives His\\n\\t\\t\\t\\tmessengers Clear Signs and an authority that can be\\n\\t\\t\\t\\trecognised. Among the Clear Signs are: (1) the pure and\\n\\t\\t\\t\\tunselfish lives of the messengers; (2) the revelation of\\n\\t\\t\\t\\ttruth which they bring; (3) their influence on the course\\n\\t\\t\\t\\tof events in their own and succeeding generations; etc.\\n\\t\\t\\t\\tSome of these may be so remarkable that they merit the\\n\\t\\t\\t\\tname of Miracles."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "23",
    "NoteID": "4389",
    "Body": "This is not the story of Moses himself, so much as an\\n\\t\\t\\t\\tintroduction to the story of the one just man who\\n\\t\\t\\t\\tbelieved, in the court of Pharaoh: see verse 28 below.\\n\\t\\t\\t\\tThis Sura (\"The Believer\") is called after him."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "24",
    "NoteID": "4390",
    "Body": "Here are three types of Unfaith, each showing a different\\n\\t\\t\\t\\tphase, and yet all united in opposition to the Truth and\\n\\t\\t\\t\\tMission of Moses. (1) Pharaoh is the type of arrogance,\\n\\t\\t\\t\\tcruelty, and reliance on brute force; cf. xxviii. 38-39.\\n\\t\\t\\t\\t(2) Haman was Pharaoh's minister (n. 3331 to xxviii. 6;\\n\\t\\t\\t\\talso xxviii. 38): he was the type of a sycophant who\\n\\t\\t\\t\\twould pander to the vanity of any man in power. (3) Qarun\\n\\t\\t\\t\\texcelled in his wealth, was selfish in its use, and\\n\\t\\t\\t\\toverbearing to the poor (xxviii. 76-81, and n. 3404).\\n\\t\\t\\t\\tThey all came to an evil end eventually."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "25",
    "NoteID": "4391",
    "Body": "Verse 24 described the opposition of three types of\\n\\t\\t\\t\\tUnfaith, which opposed Faith, in different ways, as\\n\\t\\t\\t\\tdescribed in the last note. Qarun, in his overweening\\n\\t\\t\\t\\tinsolence, may well have called Moses and Aaron\\n\\t\\t\\t\\t\"sorcerers telling lies\" in the Sinai desert, as he\\n\\t\\t\\t\\tdespised priests and men of God, and might cast the\\n\\t\\t\\t\\tEgyptian reproach in their teeth as a reminiscence. Here,\\n\\t\\t\\t\\tin verse 25, we have an episode about the time of the\\n\\t\\t\\t\\tbirth of Moses: \"them\" and \"they\" refer to Pharaoh and\\n\\t\\t\\t\\this Court; the \"coming\" of Moses here refers to the time\\n\\t\\t\\t\\tof his birth. On that construction, \"with him\", lower\\n\\t\\t\\t\\tdown in their speech would be elliptical, referring to\\n\\t\\t\\t\\t\"slay the sons\", as if they had said, \"Kill all Israelite\\n\\t\\t\\t\\tmale children: the unknown Prophet to be born would be\\n\\t\\t\\t\\tamongst them: so kill them all with him.\" In verse 26 we\\n\\t\\t\\t\\tagain skip some years and recall an episode when Moses,\\n\\t\\t\\t\\thaving got his mission, stood in Pharaoh's Court, and\\n\\t\\t\\t\\tsome of the Egyptian Commonalty were almost ready to\\n\\t\\t\\t\\tbelieve in him."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "25",
    "NoteID": "4392",
    "Body": "That is, the Israelites, for they were the custodians of\\n\\t\\t\\t\\tAllah's Faith then. For the slaughter of Israelite\\n\\t\\t\\t\\tchildren by Pharaoh, see xxviii. 4-6, and notes."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "26",
    "NoteID": "4393",
    "Body": "This is an episode that occurs when Moses, invested with\\n\\t\\t\\t\\this mission, confronts Pharaoh in his Court and preaches\\n\\t\\t\\t\\tto him: see xx. 49 and following verses; also xx. 57, 63."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "26",
    "NoteID": "4394",
    "Body": "Some of Pharaoh's people did afterwards give up the\\n\\t\\t\\t\\tworship of Pharaoh and of the Egyptian gods and believed\\n\\t\\t\\t\\t\"in the Lord of Aaron and Moses\" and in fact suffered\\n\\t\\t\\t\\tmartyrdom for the Faith of Unity: xx. 70-73."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "27",
    "NoteID": "4395",
    "Body": "The whole point of the Gospel of Unity which Moses\\n\\t\\t\\t\\tpreached was that the God of Moses and the God of\\n\\t\\t\\t\\tPharaoh, of Israel and Egypt, the Lord of all the Worlds,\\n\\t\\t\\t\\twas One,-Allah, the only True God. See xx. 49-50 and\\n\\t\\t\\t\\tnotes 2572 and 2573."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "28",
    "NoteID": "4396",
    "Body": "There is nothing to justify the identification of this\\n\\t\\t\\t\\tman with the man mentioned in xxviii. 20, who warned\\n\\t\\t\\t\\tMoses long before Moses had received his mission. On the\\n\\t\\t\\t\\tcontrary, in this passage, the man is evidently speaking\\n\\t\\t\\t\\tafter Moses had received his mission, preached to\\n\\t\\t\\t\\tPharaoh, and got a certain amount of success, for which\\n\\t\\t\\t\\tPharaoh and his people were trying, to seek his life.\\n\\t\\t\\t\\tMoses had evidently already brought his Clear Signs."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "28",
    "NoteID": "4397",
    "Body": "A commonsense view is put before them by an Egyptian who\\n\\t\\t\\t\\tloves his own people and does not wish them to perish in\\n\\t\\t\\t\\tsin. \"Will you kill this man for calling on Allah? Have\\n\\t\\t\\t\\tyou not seen his character and behaviour? Do you not see\\n\\t\\t\\t\\tthe 'Clear Signs' about him that bespeak his credentials?\\n\\t\\t\\t\\tSuppose for a moment that he is a liar and pretender: he\\n\\t\\t\\t\\twill suffer for his falsehood, but why should you turn\\n\\t\\t\\t\\tagainst Allah? But suppose that he is really inspired by\\n\\t\\t\\t\\tAllah to tell you the truth and warn you against evil,\\n\\t\\t\\t\\twhat will be your fate when Allah's Wrath descends? For\\n\\t\\t\\t\\tit must descend if he is a true Messenger sent by Allah.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "28",
    "NoteID": "4398",
    "Body": "This is with reference to the \"Clear signs\". 'They are\\n\\t\\t\\t\\tSigns of Allah's guidance, for Allah would never guide a\\n\\t\\t\\t\\tman who exceeds the bounds of truth and tells you lies!\\n\\t\\t\\t\\tSuch a man is bound to be found out!'"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "29",
    "NoteID": "4399",
    "Body": "'Do not be puffed up with arrogance because the power is\\n\\t\\t\\t\\tin your hands at present! Do you deserve it? Will it\\n\\t\\t\\t\\tlast? If you are sinning and drawing upon yourselves\\n\\t\\t\\t\\tAllah's Punishment, is there anything that can shield you\\n\\t\\t\\t\\tfrom it?'"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "29",
    "NoteID": "4400",
    "Body": "Pharaoh's egotism and arrogance come out. 'I can see and\\n\\t\\t\\t\\tunderstand everything. As I see things, so do I direct\\n\\t\\t\\t\\tyou. The Path which I see must be right, and you must\\n\\t\\t\\t\\tfollow it.'"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "30",
    "NoteID": "4401",
    "Body": "He appeals to past history. \"Have you not heard of people\\n\\t\\t\\t\\twho lived before you?-like the generations of Noah, the\\n\\t\\t\\t\\t'Ad, the Thamud, and many more-who held together in sin\\n\\t\\t\\t\\tagainst Allah's Preachers, but were wiped out for their\\n\\t\\t\\t\\tsins?\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "30",
    "NoteID": "4402",
    "Body": "Cf. xxxviii. 11-13, and n. 4158, also xi. 5, and n. 4361."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "31",
    "NoteID": "4403",
    "Body": "'All these disasters happened in history, and they will\\n\\t\\t\\t\\thappen again to you if you do not give up evil. Do not\\n\\t\\t\\t\\tfor a moment think that Allah is unjust. It is you who\\n\\t\\t\\t\\tare deliberately preparing the disasters by your\\n\\t\\t\\t\\tconduct.'"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "32",
    "NoteID": "4404",
    "Body": "This Day may refer to the Day of Judgment, of which three\\n\\t\\t\\t\\tfeatures are here referred to. (1) People may wail and\\n\\t\\t\\t\\tcall to each other, but no one can help another: each one\\n\\t\\t\\t\\twill have his own judgment to face; (2) the wicked will\\n\\t\\t\\t\\tthen be driven to Hell from the Judgment-Seat; and (3)\\n\\t\\t\\t\\tthere will be no one to help, guide, or intercede,\\n\\t\\t\\t\\tbecause the grace and guidance of Allah had already been\\n\\t\\t\\t\\trejected. But the words are perfectly general, and are\\n\\t\\t\\t\\tapplicable to all stages at which the Wrath of Allah is\\n\\t\\t\\t\\tmanifest."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "34",
    "NoteID": "4405",
    "Body": "So far he has been speaking of general religious\\n\\t\\t\\t\\ttradition. Now, as an Egyptian, addressing Egyptians, he\\n\\t\\t\\t\\trefers to the mission of Joseph in Egypt, for which see\\n\\t\\t\\t\\tthe whole of Sura xii. Joseph was not born in Egypt, nor\\n\\t\\t\\t\\twas he an Egyptian. With what wonderful incidents he came\\n\\t\\t\\t\\tinto Egypt! What difficulties did he not surmount among\\n\\t\\t\\t\\this own brothers first, and in the Egyptian family which\\n\\t\\t\\t\\tafterwards adopted him! How injustice, spite, and\\n\\t\\t\\t\\tforgetfullness on the part of others, yet wove a spell\\n\\t\\t\\t\\tround him and made him a ruler and saviour of Egypt in\\n\\t\\t\\t\\ttimes of famine! How he preached to prisoners in prison,\\n\\t\\t\\t\\tthe wife of 'Aziz in her household, to the Egyptian\\n\\t\\t\\t\\tladies in their banquet, and to the Court of Pharaoh\\n\\t\\t\\t\\tgenerally. The Egyptians profited by the material gains\\n\\t\\t\\t\\twhich came to them through him, but as a nation remained\\n\\t\\t\\t\\tsceptical of his spiritual truths for many generations\\n\\t\\t\\t\\tafter him."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "34",
    "NoteID": "4406",
    "Body": "The interval between Joseph and Moses was about one to\\n\\t\\t\\t\\tthree centuries, a very short period for the memory of a\\n\\t\\t\\t\\tlearned nation like the Egyptians. And yet they as a\\n\\t\\t\\t\\tnation ignored his spiritual work, and afterwards even\\n\\t\\t\\t\\tpersecuted Israel in Egypt until Moses delivered them.\\n\\t\\t\\t\\tThey actually saw the benefits conferred by Joseph, but\\n\\t\\t\\t\\tdid not realise that Allah's Kingdom works continuously\\n\\t\\t\\t\\teven though men ignore it."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "35",
    "NoteID": "4407",
    "Body": "See the last note. The arrogant transgressors having\\n\\t\\t\\t\\tclosed their hearts to the Message of Allah and to every\\n\\t\\t\\t\\tappeal made to them, it followed by Allah's Law that\\n\\t\\t\\t\\ttheir hearts were sealed up to any fresh influences for\\n\\t\\t\\t\\tgood. Cf. vii. 100; also ii. 7, and n. 31."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "36",
    "NoteID": "4408",
    "Body": "Cf. xxviii. 38, and n. 3371. There are two points to be\\n\\t\\t\\t\\tnoted here. (1) Pharaoh, in the arrogance of his\\n\\t\\t\\t\\tmaterialism, thinks of the Kingdom of Heaven like a\\n\\t\\t\\t\\tkingdom on earth; he thinks of spiritual things in terms\\n\\t\\t\\t\\tof palaces and ladders: notice that the word asbab (ways\\n\\t\\t\\t\\tand means) is emphasised by repetition (2) His sarcasm\\n\\t\\t\\t\\tturns Moses and Allah to ridicule, and he frankly states\\n\\t\\t\\t\\tthat 'for his part he thinks Moses is a liar', though\\n\\t\\t\\t\\tother men less lofty than he (Pharaoh) may he deceived by\\n\\t\\t\\t\\tthe Clear Signs of Moses."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "37",
    "NoteID": "4409",
    "Body": "Pharaoh's speech shows how his own egotism and haughty\\n\\t\\t\\t\\tarrogance brought him to this pass, that even the evil\\n\\t\\t\\t\\twhich he did seemed alluring in his own eyes! His heart\\n\\t\\t\\t\\twas indeed sealed, and his arrogance prevented him from\\n\\t\\t\\t\\tseeing the right path. (With the Kufi Qiraat I read sudda\\n\\t\\t\\t\\tin the passive voice)."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "37",
    "NoteID": "4410",
    "Body": "Pharaoh had plotted to slay Moses (xi. 26) and to kill\\n\\t\\t\\t\\tthe Children of Israel (xl. 25). The plot recoiled on his\\n\\t\\t\\t\\town head and on the head of his people who joined in the\\n\\t\\t\\t\\tplot; for they were all drowned in the Red Sea."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "38",
    "NoteID": "4411",
    "Body": "Note the contrast between the earnest beseeching tone of\\n\\t\\t\\t\\tthe Believer here and the hectoring tone of Pharaoh in\\n\\t\\t\\t\\tusing similar words in xi. 29 above."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "39",
    "NoteID": "4412",
    "Body": "Faith makes him see the contrast between vanities, even\\n\\t\\t\\t\\tthough they may glitter temporarily, and the eternal Good\\n\\t\\t\\t\\tthat is destined for man."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "40",
    "NoteID": "4413",
    "Body": "Cf. ii. 212. This sustenance will not only last. It will\\n\\t\\t\\t\\tbe a most liberal reward, far above any merits of the\\n\\t\\t\\t\\trecipient."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "41",
    "NoteID": "4414",
    "Body": "It may seem strange according to the laws of this world\\n\\t\\t\\t\\tthat he should be seeking their Good while they are\\n\\t\\t\\t\\tseeking his damnation! But that is the merit of Faith.\\n\\t\\t\\t\\tIts mission is to rescue its enemies and Allah's enemies,\\n\\t\\t\\t\\tas far as their will will consent!"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "42",
    "NoteID": "4415",
    "Body": "The worship of Pharaoh was blasphemy, but it had many\\n\\t\\t\\t\\tsides, including the worship of heroes, animals, powers\\n\\t\\t\\t\\tof good and evil in nature, and idols of all kinds. It is\\n\\t\\t\\t\\tthis comprehensive cult which required warnings again and\\n\\t\\t\\t\\tagain, but Allah is Exalted in Power, and gives such\\n\\t\\t\\t\\tforgiveness on repentance."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "43",
    "NoteID": "4416",
    "Body": "Faith is not content with its own inner vision and\\n\\t\\t\\t\\tconviction. It can give ample arguments. Three are\\n\\t\\t\\t\\tmentioned here: (1) nothing but Allah is worthy of\\n\\t\\t\\t\\tworship, either in this world of sense or in the next\\n\\t\\t\\t\\tworld; (2) our Return will be to Allah, the Eternal\\n\\t\\t\\t\\tReality; and (3) the worship of Falsehood must\\n\\t\\t\\t\\tnecessarily lead to the Penalty of Falsehood, unless\\n\\t\\t\\t\\tAllah's Mercy intervenes and forgives on our sincere\\n\\t\\t\\t\\trepentance."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "44",
    "NoteID": "4417",
    "Body": "The next verse shows his thought to the last is with his\\n\\t\\t\\t\\tPeople. 'No matter what you do to me: you will have cause\\n\\t\\t\\t\\tto remember my admonition, when perhaps it is too late\\n\\t\\t\\t\\tfor you to repent. For my part I commit myself to the\\n\\t\\t\\t\\tcare of Allah, and my Faith tells me that all will be\\n\\t\\t\\t\\tright.'"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "45",
    "NoteID": "4418",
    "Body": "The Pharaoh of the time of Moses, and his people,\\n\\t\\t\\t\\tsuffered many calamities in this world: vii. 130-136. But\\n\\t\\t\\t\\tthose were nothing to the Penalties mentioned in the next\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "46",
    "NoteID": "4419",
    "Body": "When the Judgment really comes, it is not like an\\n\\t\\t\\t\\tordinary physical disaster. The Fire of Punishment is\\n\\t\\t\\t\\tever present-morning and evening-i.e., at all times. The\\n\\t\\t\\t\\tsentence becomes final and there is no mitigation."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "47",
    "NoteID": "4420",
    "Body": "Just as Unity, Harmony, and Peace are indications of\\n\\t\\t\\t\\tTruth, Bliss, and Salvation, so Reproaches, Disputes, and\\n\\t\\t\\t\\tDisorders are indications of Hell."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "48",
    "NoteID": "4421",
    "Body": "Note the evasion and cynicism of the answer, befitting\\n\\t\\t\\t\\tthe character of spiritual misleaders! 'What! are we not\\n\\t\\t\\t\\tsuffering with you in the same Fire! Pray to Allah if you\\n\\t\\t\\t\\tlike! He has pronounced His Judgment!' Cf. xiv. 21-22."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "49",
    "NoteID": "4422",
    "Body": "Cf. xxxix. 71. The poor misguided ones will turn to the\\n\\t\\t\\t\\tangels who are their Keepers, asking them to pray and\\n\\t\\t\\t\\tintercede for them. But the angels are set there to watch\\n\\t\\t\\t\\tover them, not to intercede for them. In their innocence\\n\\t\\t\\t\\tthey ask, 'Did you have no warnings from messengers, men\\n\\t\\t\\t\\tlike yourselves, in your past life?'"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "50",
    "NoteID": "4423",
    "Body": "The answer being in the affirmative, they will have to\\n\\t\\t\\t\\ttell the dreadful truth: 'This is neither the time nor\\n\\t\\t\\t\\tthe place for prayer, for mercy! And in any case, Prayer\\n\\t\\t\\t\\twithout Faith is Delusion, and must miss its mark.' Cf.\\n\\t\\t\\t\\txiii. 14."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "51",
    "NoteID": "4424",
    "Body": "The Day of Judgment is described as \"the Day when\\n\\t\\t\\t\\tWitnesses will stand forth\". This description implies two\\n\\t\\t\\t\\tthings: (1) that there man will be judged justly; his\\n\\t\\t\\t\\tpast actions and his faculties and opportunities will be\\n\\t\\t\\t\\twitnesses as to the use he made of them (xxiv. 24); in\\n\\t\\t\\t\\tfact he will himself be a witness against himself (vi.\\n\\t\\t\\t\\t130); and the prophets and just men will bear witness to\\n\\t\\t\\t\\tthe fact that they preached and warned men (xxxix. 69;\\n\\t\\t\\t\\tii. 133)."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "52",
    "NoteID": "4425",
    "Body": "After the testimony mentioned in the last note, there\\n\\t\\t\\t\\twill be no room for excuses, and if any were made, they\\n\\t\\t\\t\\tcould serve no purpose, unlike the state of matters in\\n\\t\\t\\t\\tthis world, where there is much make-believe, and\\n\\t\\t\\t\\tFalsehood often masquerades as Truth and is accepted as\\n\\t\\t\\t\\tsuch even by those who should know better."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "53",
    "NoteID": "4426",
    "Body": "Moses was given a Revelation, and it was given in\\n\\t\\t\\t\\theritage to the Children of Israel, to preserve it, guide\\n\\t\\t\\t\\ttheir conduct by it, and hold aloft its Message: but they\\n\\t\\t\\t\\tfailed in all these particulars."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "55",
    "NoteID": "4427",
    "Body": "The Israelites corrupted or lost their Book; they\\n\\t\\t\\t\\tdisobeyed Allah's Law; and failed to proclaim and\\n\\t\\t\\t\\texemplify Allah's Message. That is why the new Revelation\\n\\t\\t\\t\\tcame to the holy Prophet. If, in the beginning, it was\\n\\t\\t\\t\\trejected and persecuted, there was no cause for\\n\\t\\t\\t\\tdiscouragement; on the contrary, there was all the\\n\\t\\t\\t\\tgreater need for patience and perseverance."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "55",
    "NoteID": "4428",
    "Body": "Every mortal according to his nature and degree of\\n\\t\\t\\t\\tspiritual enlightenment falls short of the perfect\\n\\t\\t\\t\\tstandard of Allah (xvi. 61), and should therefore ask\\n\\t\\t\\t\\tAllah for forgiveness. What is merit in an ordinary man\\n\\t\\t\\t\\tmay be a human shortcoming in one nearest to Allah: see\\n\\t\\t\\t\\txxxviii. 24-25, and notes 4175-76. Prophets have a\\n\\t\\t\\t\\tfurther responsibility for their People or their Ummat,\\n\\t\\t\\t\\tand they ask in a representative capacity."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "55",
    "NoteID": "4429",
    "Body": "Cf. iii. 41. Evening and morning are the best times for\\n\\t\\t\\t\\tcontemplation and prayer. But the phrase \"evening and\\n\\t\\t\\t\\tmorning\" may mean \"at all times\"."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "56",
    "NoteID": "4430",
    "Body": "The Disputes are actuated by nothing but the desire for\\n\\t\\t\\t\\tself-glory and self- aggrandizement. Their desire is not\\n\\t\\t\\t\\tlikely to receive fruition, but others should take\\n\\t\\t\\t\\twarning from it."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "57",
    "NoteID": "4431",
    "Body": "The heavens and the earth include mankind and all other\\n\\t\\t\\t\\tcreatures and millions of stars. Man is himself but a\\n\\t\\t\\t\\ttiny part of creation. Why should he be so ego-centric?\\n\\t\\t\\t\\tThe whole is greater than a tiny part of it. And Allah\\n\\t\\t\\t\\tWho created the whole of the Worlds is able to do much\\n\\t\\t\\t\\tmore wonderful things than can enter the imagination of\\n\\t\\t\\t\\tman. Why should man be arrogant and doubt the\\n\\t\\t\\t\\tResurrection, and take upon himself to doubt the\\n\\t\\t\\t\\tpossibility of Allah's Revelation? It is only because he\\n\\t\\t\\t\\thas made himself blind. See next verse."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "58",
    "NoteID": "4432",
    "Body": "The man of Faith who backs his faith by righteous conduct\\n\\t\\t\\t\\tis like the man of clear vision, who sees things in their\\n\\t\\t\\t\\ttrue perspective and walks with firm steps in the Way of\\n\\t\\t\\t\\tAllah. The man who does evil is like a blind man: the\\n\\t\\t\\t\\tLight of Allah is all around him, but he is blind, and he\\n\\t\\t\\t\\tcan see nothing. He has rejected Faith and cannot even\\n\\t\\t\\t\\tlearn by other people's admonition."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "59",
    "NoteID": "4433",
    "Body": "\"The Hour\" is the crown and consummation of man's life on\\n\\t\\t\\t\\tthis earth,-the gateway to the Hereafter."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "60",
    "NoteID": "4434",
    "Body": "As this life is not the end of all things, and we are to\\n\\t\\t\\t\\thave its fulfilment in the Hereafter: we have only to\\n\\t\\t\\t\\tpray to the Lord of the Present and the Hereafter, and He\\n\\t\\t\\t\\twill hear us, forgive us, guide us, and make our Path\\n\\t\\t\\t\\tsmooth. But Pride will have its fall,-and its humiliating\\n\\t\\t\\t\\tPunishment: Cf. xxxvii. 18."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "61",
    "NoteID": "4435",
    "Body": "The succession of Day and Night in our physical life is\\n\\t\\t\\t\\tfrequently appealed to, as a symbol to draw our attention\\n\\t\\t\\t\\tto the Mercy and Bounty of Allah. If we viewed these\\n\\t\\t\\t\\tthings aright, we should serve Allah and seek Light from\\n\\t\\t\\t\\tHim and Rest from Him, and celebrate His praises with\\n\\t\\t\\t\\tgratitude."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "62",
    "NoteID": "4436",
    "Body": "If we worship false gods, i.e., go after vanities, what\\n\\t\\t\\t\\tis it that deludes us and leads us astray? What could it\\n\\t\\t\\t\\tbe but our rank ingratitude and failure to use the\\n\\t\\t\\t\\tunderstanding which Allah has given us?"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "63",
    "NoteID": "4437",
    "Body": "See the last two notes. If men are deluded by Falsehoods,\\n\\t\\t\\t\\tit is because they reject Revelation and refuse to learn\\n\\t\\t\\t\\tfrom the Signs of Allah all around them."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "64",
    "NoteID": "4438",
    "Body": "The argument in the last two verses was from man's\\n\\t\\t\\t\\tpersonal experiences of his physical life. In this and\\n\\t\\t\\t\\tthe next verse a parallel argument is addressed to man on\\n\\t\\t\\t\\ta much higher plane: 'look at the spacious earth and the\\n\\t\\t\\t\\tcanopy of the sky; look at the special position you\\n\\t\\t\\t\\toccupy above other animals that you know, in shape and\\n\\t\\t\\t\\tform, and moral and spiritual capacities; consider your\\n\\t\\t\\t\\trefinements in food and fruits and the higher spiritual\\n\\t\\t\\t\\tSustenance of which your physical food is a type; would\\n\\t\\t\\t\\tyou not indeed say that the Lord is good, and would you\\n\\t\\t\\t\\tnot glorify His holy name?'"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "64",
    "NoteID": "4439",
    "Body": "A resting place: I understand this to imply a temporary\\n\\t\\t\\t\\tplace of rest or sojourn, a period of probation, to be\\n\\t\\t\\t\\tfollowed by the eternal Home."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "64",
    "NoteID": "4440",
    "Body": "Cf. vii. 1 1 and n. 996. The shape and form refer to the\\n\\t\\t\\t\\tphysical form as well as to the inborn moral and\\n\\t\\t\\t\\tspiritual capacities of man. As regards physical form,\\n\\t\\t\\t\\tCf. Milton's description of Adam and Eve, \"Two of far\\n\\t\\t\\t\\tnoble shape, erect and tall\" (Paradise Lost, iv. 288). As\\n\\t\\t\\t\\tregards moral and spiritual capacities, they are typified\\n\\t\\t\\t\\tby the breathing of Allah's spirit into man: xv. 29."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "64",
    "NoteID": "4441",
    "Body": "\"Sustenance\": all that is necessary for growth and\\n\\t\\t\\t\\tdevelopment, physical, moral, and spiritual. Cf. n. 2105\\n\\t\\t\\t\\tto xvi. 73."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "65",
    "NoteID": "4442",
    "Body": "The real, self-subsisting Life is only in Him: Cf. ii.\\n\\t\\t\\t\\t255, and n. 296."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "66",
    "NoteID": "4443",
    "Body": "All objects of worship besides Allah are mere delusions.\\n\\t\\t\\t\\tTo any one who sees this clearly, through Allah's\\n\\t\\t\\t\\tSelf-revelations, the only possible course is to give up\\n\\t\\t\\t\\teverything else, which his own inner experience as well\\n\\t\\t\\t\\tas outer Revelation tell him is false or of a temporary\\n\\t\\t\\t\\tnature, and to bring his own will and actions into\\n\\t\\t\\t\\tcomplete unison with Allah's Will: for that is the\\n\\t\\t\\t\\tmeaning of Islam, bowing to the Will of Allah. When we\\n\\t\\t\\t\\tbow to the Real and Everlasting, we are automatically\\n\\t\\t\\t\\tsaved from falling victims to the False and Evanescent."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "67",
    "NoteID": "4444",
    "Body": "Cf. this passage with xxii. 5 and notes 2773 and 2774.\\n\\t\\t\\t\\tThe various stages of man's physical life are: (1) first,\\n\\t\\t\\t\\tsimple matter (dust); (2) the sperm-drop in the father;\\n\\t\\t\\t\\t(3) the fertilised ovum in the mother's womb; (4) out\\n\\t\\t\\t\\tinto the light, as a human child; (5) youth and full\\n\\t\\t\\t\\tmaturity; (6) decay; and (7) death. In some cases the\\n\\t\\t\\t\\tlater stages are curtailed or cut off; but in any case, a\\n\\t\\t\\t\\tTerm appointed is reached, so that the higher purpose of\\n\\t\\t\\t\\tAllah's Will and Plan may be fulfilled in each given\\n\\t\\t\\t\\tcase, that man \"may understand.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "68",
    "NoteID": "4445",
    "Body": "The keys of life and death are in Allah's hands. But He\\n\\t\\t\\t\\tis not dependent on time or place or instruments or\\n\\t\\t\\t\\tmaterials. All that He has to do is to say \"Be\", and it\\n\\t\\t\\t\\tcomes into existence. Cf. xvi. 40, and n. 2066; xxxvi.\\n\\t\\t\\t\\t82, and n. 4029. Conversely, His Will or Command is\\n\\t\\t\\t\\tsufficient to annihilate Existence into Non-Existence\\n\\t\\t\\t\\t(Life into Death) or determine the limits or conditions\\n\\t\\t\\t\\tof Existence or Non-Existence."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "69",
    "NoteID": "4446",
    "Body": "Those who dispute about the Signs of Allah which are\\n\\t\\t\\t\\tclear to all who care to see, are merely in the mists of\\n\\t\\t\\t\\tUnreality: Cf. x. 32."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "70",
    "NoteID": "4447",
    "Body": "\"The Book\" may refer to the Holy Qur-an or to the\\n\\t\\t\\t\\tfundamental, Revelation the \"Mother of the Book\" (xiii.\\n\\t\\t\\t\\t39), while the Books revealed to the messengers are the\\n\\t\\t\\t\\tdefinite Revelations that came down to men from time to\\n\\t\\t\\t\\ttime."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "71",
    "NoteID": "4448",
    "Body": "The rejection of Allah's Message, however brought,\\n\\t\\t\\t\\tcarries its own penalty. The yoke of slavery to Sin and\\n\\t\\t\\t\\tEvil is fastened more and more firmly round the\\n\\t\\t\\t\\trejecter's neck, because there is no one to safeguard his\\n\\t\\t\\t\\tfreedom, and the chains of superstitions and the ugly\\n\\t\\t\\t\\tconsequences of evil restrict his freedom and the limited\\n\\t\\t\\t\\tfaculty of choice which was given by Allah to man. This\\n\\t\\t\\t\\tprocess receives its climax at the Hour of Judgment."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "72",
    "NoteID": "4449",
    "Body": "The sinner gets dragged further and further in the\\n\\t\\t\\t\\tdisgusting consequences of his evil actions, until the\\n\\t\\t\\t\\tfire of destruction closes in upon him."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "74",
    "NoteID": "4450",
    "Body": "All falsehoods will vanish: Cf. vii. 36. The only Reality\\n\\t\\t\\t\\twill be fully manifest even to those to whom Evil was\\n\\t\\t\\t\\tmade to seem alluring in the lower life. They will feel\\n\\t\\t\\t\\tin their inmost souls that they had been pursuing mere\\n\\t\\t\\t\\tshadows, things of no real existence. This was the result\\n\\t\\t\\t\\tof their rejecting the Light and the Grace of Allah: they\\n\\t\\t\\t\\tgot entangled in the mazes of error."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "75",
    "NoteID": "4451",
    "Body": "Allah does not withdraw His grace from any unless (1)\\n\\t\\t\\t\\tthey actively and deliberately take a delight in things\\n\\t\\t\\t\\tthat are vain or false, and (2) they insolently reject\\n\\t\\t\\t\\tthe things that are truer-in other words, unless men are\\n\\t\\t\\t\\tdeliberately false to their own lights, as illuminated by\\n\\t\\t\\t\\tthe Light of Allah."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "76",
    "NoteID": "4452",
    "Body": "Cf. xxxix. 72."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "77",
    "NoteID": "4453",
    "Body": "Cf. x. 46, and n. 1438. As the eventual justice and\\n\\t\\t\\t\\treadjustment of values must take place, when every soul\\n\\t\\t\\t\\tretums to the Judgment-Seat of Allah, it makes no\\n\\t\\t\\t\\tdifference if good and evil meet their deserts in this\\n\\t\\t\\t\\tvery life or not. Cf. also xiii. 40."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "78",
    "NoteID": "4454",
    "Body": "Cf. iv. 164. Allah sent Messengers of His Truth to every\\n\\t\\t\\t\\tpeople. There are some whose names are known to us\\n\\t\\t\\t\\tthrough the holy Qur-an, but there are a large number\\n\\t\\t\\t\\twhose names are not made known to us through that medium.\\n\\t\\t\\t\\tWe must recognise the Truth wherever we find it."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "78",
    "NoteID": "4455",
    "Body": "The Signs of Allah are everywhere, and can be seen by the\\n\\t\\t\\t\\tdiscerning eye at all times. But if any extraordinary\\n\\t\\t\\t\\tSigns are demanded by cynics or Unbelievers, they will\\n\\t\\t\\t\\tnot be granted merely because they are demanded. It is\\n\\t\\t\\t\\tAllah's Will that issues them, not merely the desire of\\n\\t\\t\\t\\thuman beings, even if he be a Messenger of Allah. But\\n\\t\\t\\t\\twhen an extraordinary Sign does issue by the Command of\\n\\t\\t\\t\\tAllah, it means that the cup of the iniquitous is full;\\n\\t\\t\\t\\tthat their case is decided, and their time of respite is\\n\\t\\t\\t\\tpast; and that Justice takes the place of Mercy, and evil\\n\\t\\t\\t\\tis blotted out."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "79",
    "NoteID": "4456",
    "Body": "Cf. xvi. 5-8. The fact that beasts, which in their wild\\n\\t\\t\\t\\tstate are so noxious, are, when domesticated, so useful\\n\\t\\t\\t\\tto man, is itself one of the great and standing Signs of\\n\\t\\t\\t\\tAllah's care for man. The great usefulness of cattle is\\n\\t\\t\\t\\tvery instructive. They serve for riding, and many of them\\n\\t\\t\\t\\tfor food; further, they are used for the plough, and they\\n\\t\\t\\t\\tproduce milk, or wool, or hair; and from their carcases\\n\\t\\t\\t\\tman derives bones and horns for many industrial uses; but\\n\\t\\t\\t\\tpassing on to higher aspects of life, they further\\n\\t\\t\\t\\tsocial, moral, and spiritual uses as draught-animals, in\\n\\t\\t\\t\\tthat transport serves one of the fundamental purposes of\\n\\t\\t\\t\\tcivilisation, being in this respect like ships for\\n\\t\\t\\t\\tinternational commerce: xxx. 46, and n. 3565. It is by\\n\\t\\t\\t\\tmeans of human intercourse through transport that we can\\n\\t\\t\\t\\tcarry out the highest needs of our culture, \"any need\\n\\t\\t\\t\\tthere may be in our hearts\", i.e., in our inner being."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "81",
    "NoteID": "4457",
    "Body": "The Signs of Allah's goodness and mercy are so numerous\\n\\t\\t\\t\\tthat it is impossible to enumerate them. Which of them\\n\\t\\t\\t\\tcan any mortal deny? This is the theme of that highly\\n\\t\\t\\t\\tpoetical Sura, Rahman (S.lv.)."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "82",
    "NoteID": "4458",
    "Body": "Cf. ix. 69. For any generation to take inordinate pride\\n\\t\\t\\t\\tin its own single achievements in science or skill\\n\\t\\t\\t\\tbecomes ridiculous if we consider the broad stream of\\n\\t\\t\\t\\thistory. In the first place, men will find that a great\\n\\t\\t\\t\\tdeal of what they attribute to their own merits only\\n\\t\\t\\t\\tbecame possible owing to the earlier work of their\\n\\t\\t\\t\\tpredecessors. Secondly, many of their predecessors were\\n\\t\\t\\t\\tmore numerous and mightier in power than they, although\\n\\t\\t\\t\\tthe perspective of time may have reduced the apparent\\n\\t\\t\\t\\tdepth of their influence, and the monuments which they\\n\\t\\t\\t\\thave left behind may have suffered from the destroying\\n\\t\\t\\t\\thand of Time. Thirdly, and most important of all, when\\n\\t\\t\\t\\tthey forgot Allah and His inexorable Law, nothing of\\n\\t\\t\\t\\ttheir own handiwork profited them: they perished in the\\n\\t\\t\\t\\tcommon ruin as all vanities must perish. Cf. also xl. 21\\n\\t\\t\\t\\tabove, and n. 4387. See how the recapitulation rounds off\\n\\t\\t\\t\\tthe argument."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "83",
    "NoteID": "4459",
    "Body": "Arrogance and an exaggerated idea of Self were at the\\n\\t\\t\\t\\tbottom of the Evil to which they succumbed."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "83",
    "NoteID": "4460",
    "Body": "Cf. xvi. 34. Nothing could stop Justice of Allah\\n\\t\\t\\t\\tpunishing Evil. What they had ridiculed came as an\\n\\t\\t\\t\\tinexorable fact. None of their grandeur or art or science\\n\\t\\t\\t\\tor skill was of any use when they lost their souls!"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "85",
    "NoteID": "4461",
    "Body": "Again and again were they given chances, and again and\\n\\t\\t\\t\\tagain did they reject them. When it was too late, and in\\n\\t\\t\\t\\tfact when it had no meaning, they offered to profess\\n\\t\\t\\t\\tFaith. That was of no use. Allah does not accept\\n\\t\\t\\t\\tunmeaning things of that kind. He wants to train and\\n\\t\\t\\t\\tpurify our will. For their disobedience and rebellion\\n\\t\\t\\t\\tthey perished utterly."
  }
]
