[
  {
    "SurahNumber": "8",
    "AyahNumber": "1",
    "Text": "They ask you about booty (spoils of war). Tell them: \"The Booty\\n\\t\\t\\tbelongs to Allah and His Rasool: so fear Allah, end your\\n\\t\\t\\tdisputes, and correct the relations between yourselves: obey\\n\\t\\t\\tAllah and His Rasool if you are true believers.\""
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "2",
    "Text": "The true believers are those whose hearts tremble with fear, when\\n\\t\\t\\tthe name of Allah is mentioned, and whose faith grows stronger as\\n\\t\\t\\tthey listen to His revelations and they put their trust in their\\n\\t\\t\\tRabb,"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "3",
    "Text": "who establish Salah and spend in charity out of the sustenance\\n\\t\\t\\twhich We have given them."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "4",
    "Text": "They are the ones who are the true believers; they will have\\n\\t\\t\\texalted ranks with their Rabb, forgiveness for their sins, and\\n\\t\\t\\thonorable sustenance."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "5",
    "Text": "Your Rabb ordered you to leave your home to fight for justice,\\n\\t\\t\\tbut some of the believers were reluctant."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "6",
    "Text": "They argued with you about the truth which had been made clear,\\n\\t\\t\\tas if they were being driven to death with their eyes wide open."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "7",
    "Text": "Remember, Allah promised you victory over one of the two enemy\\n\\t\\t\\tparties and you wished for the one which was unarmed but Allah\\n\\t\\t\\tintended to prove the truth to be true according to His words and\\n\\t\\t\\tto cut off the roots of the unbelievers,"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "8",
    "Text": "so that truth should come out as truth and falsehood should be\\n\\t\\t\\tproved as false, even though the criminals wished otherwise."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "9",
    "Text": "When you prayed to your Rabb for help, He answered: \"I will\\n\\t\\t\\tassist you with one thousand angels, one after another.\""
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "10",
    "Text": "By this good news, Allah sought to comfort your heart, for\\n\\t\\t\\tvictory comes only from Allah; surely Allah is Mighty, Wise."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "11",
    "Text": "Remember (before the battle of Badr) when He caused drowsiness to\\n\\t\\t\\tovercome you as an assurance from Himself, and sent down water\\n\\t\\t\\tfrom the sky to cleanse you and to remove from you the\\n\\t\\t\\tuncleanliness caused by Shaitan, to strengthen your hearts and to\\n\\t\\t\\tsteady your feet therewith."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "12",
    "Text": "Then your Rabb revealed His will to the angels: \"I am with you,\\n\\t\\t\\tgive courage to the believers. I will cast panic into the hearts\\n\\t\\t\\tof the unbelievers, therefore, smite their necks and beat every\\n\\t\\t\\tjoint of their bodies.\""
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "13",
    "Text": "This is because they defied Allah and His Rasool. Whoever defies\\n\\t\\t\\tAllah and His Rasool should know that Allah is strict in\\n\\t\\t\\tretribution,"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "14",
    "Text": "that it is the reality, so taste it, and there will also be the\\n\\t\\t\\ttorture of hellfire for the unbelievers."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "15",
    "Text": "O believers! When you encounter the unbelievers in a battle,\\n\\t\\t\\tnever turn your backs to them,"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "16",
    "Text": "and whoever turns his back to them on such an occasion - unless\\n\\t\\t\\tit be a strategy of war, or to join towards a detachment - shall\\n\\t\\t\\tincur the wrath of Allah and his abode shall be hell, and how\\n\\t\\t\\tawful shall be that dwelling!"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "17",
    "Text": "In fact, it was not you who killed them, but it was Allah Who\\n\\t\\t\\tkilled them; it was not you who threw the handful of sand, but it\\n\\t\\t\\twas Allah Who threw it so that He might pass the believers\\n\\t\\t\\tsuccessfully through this excellent trial; surely Allah is\\n\\t\\t\\tAll-Hearing, All-Knowing."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "18",
    "Text": "This is His dealing with you: as for the unbelievers, Allah will\\n\\t\\t\\tsurely frustrate their evil plots."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "19",
    "Text": "O unbelievers! You wanted a decision; lo! The decision, in shape\\n\\t\\t\\tof the believers' victory, has come to you. Now if you desist, it\\n\\t\\t\\twill be better for you, and if you repeat your act of war against\\n\\t\\t\\tthe believers, so shall We repeat the act of providing them\\n\\t\\t\\tassistance, and your forces, however large in number they may be,\\n\\t\\t\\tshall avail you nothing, for verily Allah is with the believers."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "20",
    "Text": "O believers! Obey Allah and his Rasool and do not turn your back\\n\\t\\t\\tto him, now that you have heard all."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "21",
    "Text": "Do not be like those who say: \"We hear,\" but give no heed to what\\n\\t\\t\\tthey hear."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "22",
    "Text": "For the worst animals in the sight of Allah are those deaf and\\n\\t\\t\\tdumb people who do not use common sense."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "23",
    "Text": "Had Allah perceived any virtue in them He would have indeed\\n\\t\\t\\tendowed them with hearing. Had he made them (those without\\n\\t\\t\\tvirtue) hear, they would have turned away and refused to listen."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "24",
    "Text": "O believers! Respond to the call of Allah and His Rasool, when He\\n\\t\\t\\tcalls you to that which gives you life; and know that Allah\\n\\t\\t\\tstands between man and his heart, and that it is He in Whose\\n\\t\\t\\tpresence you shall all be assembled."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "25",
    "Text": "Guard yourselves against temptation. The wrongdoers among you are\\n\\t\\t\\tnot the only ones who will be tempted; and know that Allah is\\n\\t\\t\\tstrict in retribution."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "26",
    "Text": "Call to mind how He gave you shelter when you were a few in\\n\\t\\t\\tnumber and were oppressed in the land, ever fearing lest the\\n\\t\\t\\tenemy would kidnap you. He made you strong with His help and\\n\\t\\t\\tprovided you a safe asylum and gave you pure things for\\n\\t\\t\\tsustenance so that you may give thanks."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "27",
    "Text": "O believers! Do not betray the trust of Allah and His Rasool, nor\\n\\t\\t\\tviolate your trusts knowingly."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "28",
    "Text": "You should know that your wealth and your children are, in fact,\\n\\t\\t\\ta test for you, and that Allah is He with Whom is your mighty\\n\\t\\t\\treward."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "29",
    "Text": "O believers! If you fear Allah He will grant you a criterion (to\\n\\t\\t\\tjudge between right and wrong), do away with your sins and\\n\\t\\t\\tforgive you. Allah is the Lord of Mighty Grace."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "30",
    "Text": "Remember how the unbelievers plotted against you. They sought to\\n\\t\\t\\ttake you captive or kill you or exile you. They planned - and\\n\\t\\t\\tAllah also planned - Allah is the best planner of all."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "31",
    "Text": "Whenever Our revelations are recited to them they say: \"Well, we\\n\\t\\t\\thave heard this. If we wanted we could fabricate the like. These\\n\\t\\t\\tare nothing but the tales of the ancients.\""
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "32",
    "Text": "Also remember how they said: \"O Allah! If this is indeed the\\n\\t\\t\\ttruth from You, then rain down stones on us from the sky or\\n\\t\\t\\tinflict some dreadful scourge to punish us.\""
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "33",
    "Text": "But Allah would not punish them while you were present in their\\n\\t\\t\\tmidst. Nor does Allah punish people while they are asking His\\n\\t\\t\\tforgiveness."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "34",
    "Text": "But now there is no reason why Allah should not punish them when\\n\\t\\t\\tthey are blocking others from the Masjid-al-Haram (Ka'bah),\\n\\t\\t\\twhereas they are not its lawful guardians. In fact, its only\\n\\t\\t\\tguardians are those who fear Allah, even though most of them do\\n\\t\\t\\tnot understand."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "35",
    "Text": "Their prayer at the House of Allah is nothing but whistling and\\n\\t\\t\\tclapping of hands: whose only answer can be, \"Taste the\\n\\t\\t\\tpunishment because of your denying the truth.\""
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "36",
    "Text": "Surely the unbelievers spend their wealth in blocking the way of\\n\\t\\t\\tAllah and so will they continue to spend; but in the end these\\n\\t\\t\\tvery efforts will become the cause of their regrets; at length\\n\\t\\t\\tthey will be defeated, and in the hereafter these unbelievers\\n\\t\\t\\twill be gathered together and driven to hell,"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "37",
    "Text": "in order that Allah may separate the filthy from the pure. He\\n\\t\\t\\twill heap the filthy one upon another, altogether, and then cast\\n\\t\\t\\tthem into hell. They are the ones who will be the losers."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "38",
    "Text": "O Prophet, tell the unbelievers that if they desist from unbelief\\n\\t\\t\\ttheir past shall be forgiven; but if they persist in sin, let\\n\\t\\t\\tthem reflect upon the fate of their forefathers."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "39",
    "Text": "O believers, fight them until there is no more mischief and the\\n\\t\\t\\tDeen of Allah (way of life prescribed by Allah) is established\\n\\t\\t\\tcompletely; but if they do stop from mischief, then surely Allah\\n\\t\\t\\tis observant of all their actions."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "40",
    "Text": "If they give no heed, then you should know that Allah is your\\n\\t\\t\\tprotector. He is the best to protect and the best to help."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "41",
    "Text": "Know that one-fifth of the booty (spoils of war) is for Allah,\\n\\t\\t\\tHis Rasool, close relatives of the Rasool, orphans, the needy and\\n\\t\\t\\tthe wayfarer, if you do believe in Allah and in what We revealed\\n\\t\\t\\tto Our servant on the day of distinction (between right and\\n\\t\\t\\twrong), the day when two armies met in combat. Allah has power\\n\\t\\t\\tover everything."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "42",
    "Text": "Remember when you were on this side of the valley and they on the\\n\\t\\t\\tfarther side, and the caravan was on lower ground than you both.\\n\\t\\t\\tIf you had made a mutual appointment to fight, you would have\\n\\t\\t\\tcertainly failed; but Allah sought to accomplish what He has\\n\\t\\t\\tordained, that those who were destined to perish might die by\\n\\t\\t\\tclear proof and those who were destined to live might survive by\\n\\t\\t\\tclear proof. Surely, Allah is He Who hears all and knows all."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "43",
    "Text": "Also remember that Allah made them appear in your dream as few in\\n\\t\\t\\tnumber; if He had shown them to you as many in number, you would\\n\\t\\t\\tsurely have been discouraged and you would have disputed in your\\n\\t\\t\\tdecision. But Allah saved you; surely He knows the very secrets\\n\\t\\t\\tof the hearts."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "44",
    "Text": "And remember when you met them in the encounter, He showed them\\n\\t\\t\\tto you as few in number in your eyes and He made you appear as a\\n\\t\\t\\tfew in number in their eyes so that Allah might accomplish what\\n\\t\\t\\tHe had ordained: for ultimately all affairs return to Allah for\\n\\t\\t\\tdecision."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "45",
    "Text": "O believers! When you encounter an enemy in a combat, be firm and\\n\\t\\t\\tfrequently remember Allah so that you may be successful."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "46",
    "Text": "Obey Allah and His Rasool and do not argue with one another, lest\\n\\t\\t\\tyou lose courage and weaken your strength. Show patience, surely\\n\\t\\t\\tAllah is on the side of the patient."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "47",
    "Text": "Do not be like those who started from their homes recklessly and\\n\\t\\t\\tin order to be seen by everybody and debar others from the Way of\\n\\t\\t\\tAllah. Allah encompasses all their actions."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "48",
    "Text": "Remember when Shaitan made their actions seem attractive to them,\\n\\t\\t\\tand said: \"No one from mankind can overcome you today, for I will\\n\\t\\t\\tbe at hand to help you.\" Yet when the two armies came within\\n\\t\\t\\tsight of each other he turned upon his heels saying: \" I am done\\n\\t\\t\\twith you, for I can see what you cannot. I fear Allah, for Allah\\n\\t\\t\\tis severe in punishment."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "49",
    "Text": "At that time the hypocrites and all those who had malice in their\\n\\t\\t\\thearts were saying: \"Their religion has deceived them.\" But you\\n\\t\\t\\tshould know that anyone who puts his trust in Allah will find\\n\\t\\t\\tAllah Mighty, Wise."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "50",
    "Text": "If you could only see the angels when they were taking away the\\n\\t\\t\\tsouls of the killed unbelievers! They were smiting their faces\\n\\t\\t\\tand their backs saying: \"Taste the torment of the conflagration!"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "51",
    "Text": "This is the punishment for what your hands have sent forth; for\\n\\t\\t\\tAllah is never unjust to His servants.\""
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "52",
    "Text": "This was the same that happened to the people of Fir'on (Pharaoh)\\n\\t\\t\\tand to those that had gone before them. They also rejected the\\n\\t\\t\\trevelations of Allah and Allah seized them for their sins. Surely\\n\\t\\t\\tAllah is Mighty and severe in punishment."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "53",
    "Text": "That is because Allah has never changed the blessings which He\\n\\t\\t\\thas bestowed on a people until they themselves changed the\\n\\t\\t\\tcondition of their souls; verily Allah hears all and knows all."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "54",
    "Text": "This same principle was applied to the people of Fir'on and those\\n\\t\\t\\twho have gone before them, they rejected the revelations of their\\n\\t\\t\\tRabb so We destroyed them for their sins, and We drowned the\\n\\t\\t\\tpeople of Fir'on; they were all wrongdoers."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "55",
    "Text": "The worst of animals in the sight of Allah are those who reject\\n\\t\\t\\tthe truth and do not become believers."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "56",
    "Text": "Those who make treaties with you and time after time violate\\n\\t\\t\\ttheir treaties, and have no fear of Allah."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "57",
    "Text": "If you encounter them in combat, make them a fearsome example for\\n\\t\\t\\tothers who would follow them so that they all may learn a lesson."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "58",
    "Text": "If you fear treachery from any of your allies, you may fairly\\n\\t\\t\\tretaliate by breaking off the treaty with them (through properly\\n\\t\\t\\tnotifying them to that effect), for Allah does not love the\\n\\t\\t\\ttreacherous."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "59",
    "Text": "Let not the unbelievers think that they have won the game; surely\\n\\t\\t\\tthey can never frustrate the believers."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "60",
    "Text": "Muster against them all the military strength and cavalry that\\n\\t\\t\\tyou can afford so that you may strike terror into the hearts of\\n\\t\\t\\tthe enemy of Allah and of your, and others besides them who are\\n\\t\\t\\tunknown to you but known to Allah. Remember that whatever you\\n\\t\\t\\twill spend in the cause of Allah, shall be paid back to you in\\n\\t\\t\\tfull and you shall not be treated unjustly."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "61",
    "Text": "If the enemy is inclined towards peace, do make peace with them,\\n\\t\\t\\tand put your trust in Allah. He is the One Who hears all , knows\\n\\t\\t\\tall."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "62",
    "Text": "Should they intend to deceive you, verily Allah is All-Sufficient\\n\\t\\t\\tfor you. He is the One Who has strengthened you and the believers\\n\\t\\t\\twith His help ,"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "63",
    "Text": "through putting affection in their hearts. If you had spent all\\n\\t\\t\\tthat is in the earth, you could not have so united their hearts;\\n\\t\\t\\tbut Allah has united them. He is Mighty, Wise."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "64",
    "Text": "O Prophet! Allah is all-sufficient for you and for the believers\\n\\t\\t\\twho follow you."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "65",
    "Text": "O Prophet! Rouse the believers to prepare for combat. If there\\n\\t\\t\\tare twenty steadfast among you, they shall vanquish two hundred:\\n\\t\\t\\tif there are one hundred they shall overcome one thousand of the\\n\\t\\t\\tunbelievers, for they are a people who lack understanding."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "66",
    "Text": "For now Allah is lightening your burden, because He knows that\\n\\t\\t\\tthere are still some weak individuals among you, so if there are\\n\\t\\t\\tone hundred steadfast among you, they shall vanquish two hundred\\n\\t\\t\\tand if there be one thousand, they will overcome two thousand\\n\\t\\t\\twith the leave of Allah, for Allah is with those who are\\n\\t\\t\\tsteadfast."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "67",
    "Text": "It is not fit for a Prophet that he should take prisoners of war\\n\\t\\t\\tuntil he has thoroughly subdued the land. Do you, O followers of\\n\\t\\t\\tMuhammad, desire the temporal goods of this world? While Allah\\n\\t\\t\\tdesires for you the hereafter? Allah is Mighty, Wise."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "68",
    "Text": "Had there not been a previous sanction from Allah to take ransom,\\n\\t\\t\\tyou should have been sternly punished for what you have taken."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "69",
    "Text": "Very well, enjoy the booty which you have taken, for it is lawful\\n\\t\\t\\tand pure, but in the future fear Allah. Allah is Forgiving,\\n\\t\\t\\tMerciful."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "70",
    "Text": "O Prophet! Tell the captives in your custody: \"If Allah finds\\n\\t\\t\\tgoodness in your hearts He will give you even better than what\\n\\t\\t\\thas been taken from you, as well as forgive you. Allah Is\\n\\t\\t\\tForgiving, Merciful.\""
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "71",
    "Text": "But if they have treacherous designs against you, O Prophet, they\\n\\t\\t\\thave already shown treason against Allah. That is why He made\\n\\t\\t\\tthem your captives. Allah is Knowledgeable, Wise."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "72",
    "Text": "Those who believed (embraced Islam), migrated and made Jihad\\n\\t\\t\\t(exerted their utmost struggle) with their wealth and their\\n\\t\\t\\tpersons in the cause of Allah; as well as those who gave them\\n\\t\\t\\tasylum and help, are indeed the protecting friends of one\\n\\t\\t\\tanother. As to those who believed (embraced Islam) but did not\\n\\t\\t\\temigrate (to Dar-ul-Islam, the Islamic State), you are under no\\n\\t\\t\\tobligation to protect them until they emigrate; yet it is your\\n\\t\\t\\tobligation to help them in the matters of faith if they ask for\\n\\t\\t\\tyour help, except against a people with whom you have a treaty.\\n\\t\\t\\tAllah is observant of all your actions."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "73",
    "Text": "The unbelievers are protectors of one of another. If you fail to\\n\\t\\t\\tdo likewise, there will be disorder in the land and great\\n\\t\\t\\tcorruption."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "74",
    "Text": "Those who believed (embraced Islam), migrated and made Jihad\\n\\t\\t\\t(exerted their utmost struggle) in the cause of Allah, and those\\n\\t\\t\\twho gave them asylum and help - they are the true believers. They\\n\\t\\t\\tshall have forgiveness and honorable provisions."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "75",
    "Text": "Those who believed (embraced Islam) afterwards, migrated and\\n\\t\\t\\tjoined you in Jihad - they too are your brothers, although\\n\\t\\t\\taccording to the Book of Allah the blood relatives have greater\\n\\t\\t\\trights on one other. Indeed Allah knows everything."
  }
]
