[
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "1",
    "sectionHeading": "Asking for Someone's Hand in Marriage",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Yahya\\n\\t\\t\\t\\tibn Habban from al-Araj from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Do not ask for a woman in marriage when\\n\\t\\t\\t\\tanother muslim has already done so.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "2",
    "sectionHeading": "Asking for Someone's Hand in Marriage",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Do not ask for a woman in\\n\\t\\t\\t\\tmarriage when another muslim has already done so.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of the statement of the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, according to what we think - and Allah knows best\\n\\t\\t\\t\\t- is that 'Do not ask for a woman in marriage when\\n\\t\\t\\t\\tanother muslim has already done so' means that when a man\\n\\t\\t\\t\\thas asked for a woman in marriage, and she has inclined\\n\\t\\t\\t\\tto him and they have agreed on a bride-price, which she\\n\\t\\t\\t\\thas suggested and with which they are mutually satisfied,\\n\\t\\t\\t\\tit is forbidden for another man to ask for that woman in\\n\\t\\t\\t\\tmarriage. It does not mean that when a man has asked for\\n\\t\\t\\t\\ta woman in marriage, and his suit does not agree with her\\n\\t\\t\\t\\tand she does not incline to him that no one else can ask\\n\\t\\t\\t\\tfor her in marriage. That is a door to misery for\\n\\t\\t\\t\\tpeople.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "3",
    "sectionHeading": "Asking for Someone's Hand in Marriage",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim that his father said about the word of Allah,\\n\\t\\t\\t\\tthe Blessed, the Exalted, \"There is no fault in you about\\n\\t\\t\\t\\tthe proposal you offer to women, or hide in yourselves.\\n\\t\\t\\t\\tAllah knows that you will be mindful of them; but do not\\n\\t\\t\\t\\tmake troth with them secretly without honourable words,\"\\n\\t\\t\\t\\t(Sura 2 ayat 235) that it referred to a man saying to a\\n\\t\\t\\t\\twoman while she was still in her idda after the death of\\n\\t\\t\\t\\ther husband, \"You are dear to me, and I desire you, and\\n\\t\\t\\t\\tAllah brings provision and blessing to you,\" and words\\n\\t\\t\\t\\tsuch as these.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "4",
    "sectionHeading": "Asking Consent of Virgins and Women Previously Married for their Persons",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn al-Fadl from Nafi\\n\\t\\t\\t\\tibn Jubayr ibn Mutim from Abdullah ibn Abbas that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"A woman who has been previously married is\\n\\t\\t\\t\\tmore entitled to her person than her guardian, and a\\n\\t\\t\\t\\tvirgin must be asked for her consent for herself, and her\\n\\t\\t\\t\\tconsent is her silence \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "5",
    "sectionHeading": "Asking Consent of Virgins and Women Previously Married for their Persons",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab had said that Umar ibn al-Khattab\\n\\t\\t\\t\\tsaid, \"A woman is only married with the consent of her\\n\\t\\t\\t\\tguardian, someone of her family with sound judgement or\\n\\t\\t\\t\\tthe Sultan.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "6",
    "sectionHeading": "Asking Consent of Virgins and Women Previously Married for their Persons",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad and Salim ibn Abdullah were\\n\\t\\t\\t\\tmarrying off their daughters and they did not consult\\n\\t\\t\\t\\tthem.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what is done among us about the\\n\\t\\t\\t\\tmarriage of virgins.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A virgin has no right to her property until\\n\\t\\t\\t\\tshe enters her house and her state (competence, maturity\\n\\t\\t\\t\\tetc.) is known for sure.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "7",
    "sectionHeading": "Asking Consent of Virgins and Women Previously Married for their Persons",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad and Salim ibn Abdullah and Sulayman\\n\\t\\t\\t\\tibn Yasar said about the virgin given by her father in\\n\\t\\t\\t\\tmarriage without her permission, \"That is binding on\\n\\t\\t\\t\\ther.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "8",
    "sectionHeading": "The Bride-Price and Unreturnable Gifts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Malik from Abu Hazim\\n\\t\\t\\t\\tibn Dinar from Sahl ibn Sad as-Saidi that a woman came to\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and said, \"Messenger of Allah! I have given myself\\n\\t\\t\\t\\tto you.\" She stood for a long time, and then a man got up\\n\\t\\t\\t\\tand said, \"Messenger of Allah, marry her to me if you\\n\\t\\t\\t\\thave no need of her.\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Do you have\\n\\t\\t\\t\\tanything to give her as a bride-price?\" He said, \"I\\n\\t\\t\\t\\tpossess only this lower garment of mine.\" The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"If you give it to her you will not have a garment to\\n\\t\\t\\t\\twear so look for something else.\" He said, \"I have\\n\\t\\t\\t\\tnothing else.\" He said, \"Look for something else, even if\\n\\t\\t\\t\\tit is only an iron ring.\" He looked, and found that he\\n\\t\\t\\t\\thad nothing. The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Do you know any of the\\n\\t\\t\\t\\tQur'an?\" He said, \"Yes. I know such-and-such a sura and\\n\\t\\t\\t\\tsuch-and-such a sura,\" which he named. The Messengerof\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\thim, \"I have married her to you for what you know of the\\n\\t\\t\\t\\tQur'an.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "9",
    "sectionHeading": "The Bride-Price and Unreturnable Gifts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab had said that Umar ibn al-Khattab\\n\\t\\t\\t\\tsaid, \"If a man marries a woman who is insane, or has\\n\\t\\t\\t\\tleprosy or white leprosy, without being told of her\\n\\t\\t\\t\\tcondition by her guardian, and he has sexual relations\\n\\t\\t\\t\\twith her, she keeps her bride-price in its entirety. Her\\n\\t\\t\\t\\thusband has damages against her guardian.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The husband has damages against her guardian\\n\\t\\t\\t\\twhen the guardian is her father, brother, or one who is\\n\\t\\t\\t\\tdeemed to have knowledge of her condition. If the\\n\\t\\t\\t\\tguardian who gives her in marriage is a nephew, a mawla\\n\\t\\t\\t\\tor a member of her tribe who is not deemed to have\\n\\t\\t\\t\\tknowledge of her condition, there are no damages against\\n\\t\\t\\t\\thim, and the woman returns what she has taken of her\\n\\t\\t\\t\\tbride-price, and the husband leaves her whatever amount\\n\\t\\t\\t\\tis thought to be fair.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "10",
    "sectionHeading": "The Bride-Price and Unreturnable Gifts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that the\\n\\t\\t\\t\\tdaughter of Ubaydullah ibn Umar whose mother was the\\n\\t\\t\\t\\tdaughter of Zayd ibn al-Khattab, married the son of\\n\\t\\t\\t\\tAbdullah ibn Umar. He died and had not yet consummated\\n\\t\\t\\t\\tthe marriage or specified her bride-price. Her mother\\n\\t\\t\\t\\twanted the bride-price, and Abdullah ibn Umar said, \"She\\n\\t\\t\\t\\tis not entitled to a bride-price. Had she been entitled\\n\\t\\t\\t\\tto a bride-price, we would not have kept it and we would\\n\\t\\t\\t\\tnot do her an injustice. \"The mother refused to accept\\n\\t\\t\\t\\tthat. Zayd ibn Thabit was brought to adjudicate between\\n\\t\\t\\t\\tthem and he decided that she had no bride-price, but that\\n\\t\\t\\t\\tshe did inherit.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "11",
    "sectionHeading": "The Bride-Price and Unreturnable Gifts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn Abd al-Aziz during his khalifate, wrote to one\\n\\t\\t\\t\\tof his governors, \"Whatever a father, or guardian, who\\n\\t\\t\\t\\tgives someone in marriage, makes a condition in the way\\n\\t\\t\\t\\tof unreturnable gift or of favour, belongs to the woman\\n\\t\\t\\t\\tif she wants it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a woman whose father gave her in\\n\\t\\t\\t\\tmarriage and made an unreturnable gift a condition of the\\n\\t\\t\\t\\tbride-price which was to be given. He said, \"Whatever is\\n\\t\\t\\t\\tgiven as a condition by which marriage occurs belongs to\\n\\t\\t\\t\\tthe woman if she wants it. If the husband parts from her\\n\\t\\t\\t\\tbefore the marriage is consummated, the husband has half\\n\\t\\t\\t\\tof the unreturnable gift by which the marriage occurred.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who married off his young son and\\n\\t\\t\\t\\tthe son had no wealth at all, that the bride-price was\\n\\t\\t\\t\\tobliged of the father if the young man had no property on\\n\\t\\t\\t\\tthe day of marriage. If the young man did have property\\n\\t\\t\\t\\tthe bride-price was taken from his property unless the\\n\\t\\t\\t\\tfather stipulated that he would pay the bride-price. The\\n\\t\\t\\t\\tmarriage was affirmed for the son if he was a minor only\\n\\t\\t\\t\\tif he was under the guardianship of his father.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man divorced his wife before he had\\n\\t\\t\\t\\tconsummated the marriage and she was a virgin, her father\\n\\t\\t\\t\\treturned half of the bride-price to him. That half was\\n\\t\\t\\t\\tpermitted to the husband from the father to compensate\\n\\t\\t\\t\\thim for his expenses.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that that was because Allah, the Blessed, the\\n\\t\\t\\t\\tExalted, said in His Book, \"Unless they (women with whom\\n\\t\\t\\t\\the had not consummated marriage) make remission or he\\n\\t\\t\\t\\tmakes remission to him in whose hand is the knot of\\n\\t\\t\\t\\tmarriage.\" (Sura 2 ayat 237). (He being the father of a\\n\\t\\t\\t\\tvirgin daughter or the master of a female slave.)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what I have heard about the matter,\\n\\t\\t\\t\\tand that is how things are done among us.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a jewish or christian woman who was\\n\\t\\t\\t\\tmarried to a jew or christian and then became muslim\\n\\t\\t\\t\\tbefore the marriage had been consummated, did not keep\\n\\t\\t\\t\\tanything from the bride-price.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not think that women should be married\\n\\t\\t\\t\\tfor less than a quarter of a dinar. That is the lowest\\n\\t\\t\\t\\tamount for which cutting off the hand is obliged .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "12",
    "sectionHeading": "Consummating the Marriage",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSaid ibn al-Musayyab that 'Umar ibn al-Khattab decided\\n\\t\\t\\t\\tabout the woman who was married by a man and the marriage\\n\\t\\t\\t\\thad been consummated, that the bride-price was\\n\\t\\t\\t\\tobligatory.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "13",
    "sectionHeading": "Consummating the Marriage",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Zayd\\n\\t\\t\\t\\tibn Thabit said, \"When a man takes his wife to his house\\n\\t\\t\\t\\tand co-habits with her then the bride-price is obliged.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"When a man comes to his wife\\n\\t\\t\\t\\tin her room, he is believed. When she comes to him in his\\n\\t\\t\\t\\troom, she is believed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik commented, \"I think that this refers to sexual\\n\\t\\t\\t\\tintercourse. When he comes in to her in her room and she\\n\\t\\t\\t\\tsays, 'He has had intercourse with me' and he says, 'I\\n\\t\\t\\t\\thave not touched her', he is believed. When she comes in\\n\\t\\t\\t\\tto him in his room and he says, 'I have not had\\n\\t\\t\\t\\tintercourse with her' and she says, 'He had intercourse\\n\\t\\t\\t\\twith me', she is believed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t28.5 Wedding Nights of Virgins and Women Previously\\n\\t\\t\\t\\tMarried\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "14",
    "sectionHeading": "Wedding Nights of Virgins and Women Previously Married",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Muhammad ibn Amr ibn Hazm from Abd al-Malik ibn Abi\\n\\t\\t\\t\\tBakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham\\n\\t\\t\\t\\tal-Makhzumi from his father that when the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, married\\n\\t\\t\\t\\tUmm Salama and then spent the night with her, he said to\\n\\t\\t\\t\\ther, \"You are not being humbled in your right. If you\\n\\t\\t\\t\\twish, I will stay with you for seven nights as I stayed\\n\\t\\t\\t\\tseven nights with the others. If you wish, I will stay\\n\\t\\t\\t\\twith you for three nights, and then visit the others in\\n\\t\\t\\t\\tturn.\" She said, \"Stay three nights.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "15",
    "sectionHeading": "Wedding Nights of Virgins and Women Previously Married",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd at-Tawil that\\n\\t\\t\\t\\tAnas ibn Malik said, \"A virgin has seven nights, and a\\n\\t\\t\\t\\twoman who has been previously married has three nights.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik affirmed, \"That is what is done among us.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"If the man has another wife, he divides his\\n\\t\\t\\t\\ttime equally between them after the wedding nights. He\\n\\t\\t\\t\\tdoes not count the wedding nights against the one he has\\n\\t\\t\\t\\tjust married.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "16",
    "sectionHeading": "Stipulations Not Permitted in Marriage",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab was asked about a woman who made a\\n\\t\\t\\t\\tstipulation on her husband not to take her away from her\\n\\t\\t\\t\\ttown. Said ibn al-Musayyab said, \"He takes her away if he\\n\\t\\t\\t\\twishes.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The custom among us is that when a man\\n\\t\\t\\t\\tmarries a woman, and he makes a condition in the marriage\\n\\t\\t\\t\\tcontract that he will not marry after her or take a\\n\\t\\t\\t\\tconcubine, it means nothing unless there is an oath of\\n\\t\\t\\t\\tdivorce or setting-free attached to it. Then it is\\n\\t\\t\\t\\tobliged and required of him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "17",
    "sectionHeading": "Marriage of the Muhallil and its Like.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from al-Miswar ibn Rifaa\\n\\t\\t\\t\\tal-Quradhi from az-Zubayr ibn Abd ar-Rahman ibn az-Zubayr\\n\\t\\t\\t\\tthat Rifaa ibn Simwal divorced his wife, Tamima bint\\n\\t\\t\\t\\tWahb, in the time of the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, three times. Then she\\n\\t\\t\\t\\tmarried Abd ar-Rahman ibn az-Zubayr and he turned from\\n\\t\\t\\t\\ther and could not consummate the marriage and so he\\n\\t\\t\\t\\tparted from her. Rifaa wanted to marry her again and it\\n\\t\\t\\t\\twas mentioned to the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and he forbade him to marry her.\\n\\t\\t\\t\\tHe said, \"She is not halal for you until she has tasted\\n\\t\\t\\t\\tthe sweetness of intercourse.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "18",
    "sectionHeading": "Marriage of the Muhallil and its Like.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tal-Qasim ibn Muhammad that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, said\\n\\t\\t\\t\\twhen asked whether it was permissible for a man to marry\\n\\t\\t\\t\\tagain a wife he had divorced irrevocably if she had\\n\\t\\t\\t\\tmarried another man who divorced her before consummating\\n\\t\\t\\t\\tthe marriage, \"Not until she has tasted the sweetness of\\n\\t\\t\\t\\tintercourse.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "19",
    "sectionHeading": "Marriage of the Muhallil and its Like.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\twhen asked whether it was permissible for a man to return\\n\\t\\t\\t\\tto his wife if he had divorced her irrevocably and then\\n\\t\\t\\t\\tanother man had married her after him and died before\\n\\t\\t\\t\\tconsummating the marriage, al-Qasim ibn Muhammad said,\\n\\t\\t\\t\\t\"It is not halal for the first husband to return to her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about the muhallil, that he could not remain\\n\\t\\t\\t\\tin the marriage until he undertook a new marriage. If he\\n\\t\\t\\t\\thad intercourse with her in that marriage, she had her\\n\\t\\t\\t\\tdowry.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "20",
    "sectionHeading": "Combinations of Women Not to be Married Together",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said \"One cannot be\\n\\t\\t\\t\\tmarried to a woman and her paternal aunt, or a woman and\\n\\t\\t\\t\\ther maternal aunt at the same time.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "21",
    "sectionHeading": "Combinations of Women Not to be Married Together",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"It is forbidden to be married\\n\\t\\t\\t\\tto a woman and her paternal or maternal aunt at the same\\n\\t\\t\\t\\ttime, and for a man to have intercourse with a female\\n\\t\\t\\t\\tslave who is carrying another man's child.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "22",
    "sectionHeading": "Prohibition against Marrying Mothers of Wives",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tZayd ibn Thabit asked whether it was halal for a man who\\n\\t\\t\\t\\tmarried a woman and then separated from her before he had\\n\\t\\t\\t\\tcohabited with her, to marry her mother. Zayd ibn Thabit\\n\\t\\t\\t\\tsaid, \"No. The mother is prohibited unconditionally.\\n\\t\\t\\t\\tThere are conditions, however about foster-mothers.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "23",
    "sectionHeading": "Prohibition against Marrying Mothers of Wives",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from more than one source\\n\\t\\t\\t\\tthat when Abdullah ibn Masud was in Kufa, he was asked\\n\\t\\t\\t\\tfor an opinion about marrying the mother after marrying\\n\\t\\t\\t\\tthe daughter when the marriage with the daughter had not\\n\\t\\t\\t\\tbeen consummated. He permitted it. When Ibn Masud came to\\n\\t\\t\\t\\tMadina, he asked about it and was told that it was not as\\n\\t\\t\\t\\the had said, and that this condition referred to\\n\\t\\t\\t\\tfoster-mothers. Ibn Masud returnedto Kufa,and he had just\\n\\t\\t\\t\\treached his dwelling when the man who had asked him for\\n\\t\\t\\t\\tthe opinion came to visit and he ordered him to separate\\n\\t\\t\\t\\tfrom his wife.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man married the mother of a woman\\n\\t\\t\\t\\twho was his wife and he had sexual relations with the\\n\\t\\t\\t\\tmother then his wife was haram for him, and he had to\\n\\t\\t\\t\\tseparate from both of them. They were both haram to him\\n\\t\\t\\t\\tforever, if he had had sexual relations with the mother.\\n\\t\\t\\t\\tIf he had not had relations with the mcther, his wife was\\n\\t\\t\\t\\tnot haram for him, and he separated from the mother.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik explained further about the man who married a\\n\\t\\t\\t\\twoman, and then married her mother and cohabited with\\n\\t\\t\\t\\ther, \"The mother will never be halal for him, and she is\\n\\t\\t\\t\\tnot halal for his father or his son, and any daughters of\\n\\t\\t\\t\\thers are not halal for him and so his wife is haram for\\n\\t\\t\\t\\thim.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Fornication however, does not make any of\\n\\t\\t\\t\\tthat haram because Allah, the Blessed, the Exalted,\\n\\t\\t\\t\\tmentioned 'the mothers of your wives,' as one whom\\n\\t\\t\\t\\tmarriage made haram, and he didn't mention the making\\n\\t\\t\\t\\tharam by fornication. Every marriage in a halal manner in\\n\\t\\t\\t\\twhich a man cohabits with his wife, is a halal marriage.\\n\\t\\t\\t\\tThis is what I have heard, and this is how things are\\n\\t\\t\\t\\tdone among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "23",
    "sectionHeading": "Marriage to Mothers of Women with Whom One has had Sexual Relations in a Disapproved Manner",
    "text": "<p>\\n\\t\\t\\t\\tMalik said that a man who had committed fornication with\\n\\t\\t\\t\\ta woman and the hadd-punishment had been applied to him\\n\\t\\t\\t\\tfor it, could marry that woman's daughter and his son\\n\\t\\t\\t\\tcould marry the woman herself if he wished. That was\\n\\t\\t\\t\\tbecause he had haram relations with her, and the\\n\\t\\t\\t\\trelations Allah had made haram were from the relations\\n\\t\\t\\t\\tmade in a halal manner or in a manner resembling\\n\\t\\t\\t\\tmarriage. Allah, the Blessed, the Exalted, said, \"Do not\\n\\t\\t\\t\\tmarry the women your fathers have married. \" (Sura 4 ayat\\n\\t\\t\\t\\t21)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a man were to marry a woman in her\\n\\t\\t\\t\\tidda-period in a halal marriage and have relations with\\n\\t\\t\\t\\ther, it would be haram for his son to marry the woman.\\n\\t\\t\\t\\tThat is because the father married her in a halal manner,\\n\\t\\t\\t\\tand the hadd-punishment would not have been applied to\\n\\t\\t\\t\\thim. Any child who was born to him would be attached to\\n\\t\\t\\t\\thim as the father. Just as it would be haram for the son\\n\\t\\t\\t\\tto marry a woman whom his father had married in her\\n\\t\\t\\t\\tidda-period and had relations with, so the woman's\\n\\t\\t\\t\\tdaughter would be haram for the father if he had had\\n\\t\\t\\t\\tsexual relations with her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "24",
    "sectionHeading": "What is Not Permitted in Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade shighar, which meant one man\\n\\t\\t\\t\\tgiving his daughter in marriage to another man on the\\n\\t\\t\\t\\tcondition that the other gave his daughter to him in\\n\\t\\t\\t\\tmarriage without either of them paying the bride-price.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "25",
    "sectionHeading": "What is Not Permitted in Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father from Abd ar-Rahman and Mujamma\\n\\t\\t\\t\\tthe sons of Yazid ibn Jariya al-Ansari from Khansa bint\\n\\t\\t\\t\\tKhidam al-Ansariya that her father gave her in marriage\\n\\t\\t\\t\\tand she had been previously married. She disapproved of\\n\\t\\t\\t\\tthat, and went to the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and he revoked the marriage.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "26",
    "sectionHeading": "What is Not Permitted in Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zubayr al-Makki\\n\\t\\t\\t\\tthat a case was brought to Umar about a marriage which\\n\\t\\t\\t\\thad only been witnessed by one man and one woman . He\\n\\t\\t\\t\\tsaid, \"This is a secret marriage and I do not permit it.\\n\\t\\t\\t\\tHad I been the first to come upon it, I would have\\n\\t\\t\\t\\tordered them to be stoned.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "27",
    "sectionHeading": "What is Not Permitted in Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab and from Sulayman ibn Yasar that Tulayha\\n\\t\\t\\t\\tal-Asadiya was the wife of Rushayd ath-Thaqafi. He\\n\\t\\t\\t\\tdivorced her, and she got married in her idda-period.\\n\\t\\t\\t\\tUmar ibn al-Khattab beat her and her husband with a stick\\n\\t\\t\\t\\tseveral times, and separated them. Then Umar ibn\\n\\t\\t\\t\\tal-Khattab said, \"If a woman marries in her idda-period,\\n\\t\\t\\t\\tand the new husband has not consummated the marriage,\\n\\t\\t\\t\\tthen separate them, and when she has completed the idda\\n\\t\\t\\t\\tof her first husband, the other becomes a suitor. If he\\n\\t\\t\\t\\thas consummated the marriage then separate them. Then she\\n\\t\\t\\t\\tmust complete her idda from her first husband, and then\\n\\t\\t\\t\\tthe idda from the other one, and they are never to be\\n\\t\\t\\t\\treunited.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, ''Said ibn al-Musayyab said that she had her\\n\\t\\t\\t\\tdowry because he had consummated the marriage.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said,\"The practice with us concerning a free woman\\n\\t\\t\\t\\twhose husband dies, is that she does an idda of four\\n\\t\\t\\t\\tmonths and ten days and she does not marry if she doubts\\n\\t\\t\\t\\ther period until she is free of any doubt or if she fears\\n\\t\\t\\t\\tthat she is pregnant.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "28",
    "sectionHeading": "Marrying Slaves when already Married to Free Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Abbas and Abdullah ibn Umar were asked about\\n\\t\\t\\t\\ta man who had a free woman as a wife and then wanted to\\n\\t\\t\\t\\tmarry a slave-girl. They disapproved that he should\\n\\t\\t\\t\\tcombine the two of them.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "29",
    "sectionHeading": "Marrying Slaves when already Married to Free Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"The slave girl is not married\\n\\t\\t\\t\\twhen there is a free woman who is a wife unless the free\\n\\t\\t\\t\\twoman wishes it. If the free woman complies, she has\\n\\t\\t\\t\\ttwo-thirds of the division of time.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A free man must not marry a slave-girl when\\n\\t\\t\\t\\the can afford to marry a free-woman, and he should not\\n\\t\\t\\t\\tmarry a slave-girl when he cannot afford a free woman\\n\\t\\t\\t\\tunless he fears fornication. That is because Allah, may\\n\\t\\t\\t\\the be Blessed and Exalted, says in His Book, 'If you are\\n\\t\\t\\t\\tnot affluent enough to marry believing women, who are\\n\\t\\t\\t\\tmuhsanat, take slave-girls who are believing women that\\n\\t\\t\\t\\tyour right hands own.' (Sura 4 ayat 24) He says, 'That is\\n\\t\\t\\t\\tfor those of you who fear al-anat.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Al-anat is fornication.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "30",
    "sectionHeading": "A Man's Owning a Slave Whom He has Married and then Divorced",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tAbd ar-Rahman that Zayd ibn Thabit said that if a man\\n\\t\\t\\t\\tdivorced his slave-girl three times and then bought her,\\n\\t\\t\\t\\tshe was not halal for him until she had married another\\n\\t\\t\\t\\thusband.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "31",
    "sectionHeading": "A Man's Owning a Slave Whom He has Married and then Divorced",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab and Sulayman ibn Yasar were asked\\n\\t\\t\\t\\twhether, when a man married a slave of his to a\\n\\t\\t\\t\\tslave-girl and the slave divorced her irrevocably, and\\n\\t\\t\\t\\tthen her master gave her to the slave, she was then halal\\n\\t\\t\\t\\tfor the slave by the possession of the right hand. They\\n\\t\\t\\t\\tsaid, \"No. She is not halal until she has married another\\n\\t\\t\\t\\thusband.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "32",
    "sectionHeading": "A Man's Owning a Slave Whom He has Married and then Divorced",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had asked Ibn\\n\\t\\t\\t\\tShihab about a man who had a slave-girl as a wife, and\\n\\t\\t\\t\\tthen he bought her, and divorced her once. He said, \"She\\n\\t\\t\\t\\tis halal for him by the possession of the right hand as\\n\\t\\t\\t\\tlong as he does not make his divorce irrevocable. If he\\n\\t\\t\\t\\tirrevocably divorces her, she is not halal for him by the\\n\\t\\t\\t\\tpossession of the right hand until she has married\\n\\t\\t\\t\\tanother husband.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man rnarried a female slave and then\\n\\t\\t\\t\\tshe had a child by him, and then he bought her, she was\\n\\t\\t\\t\\tnot an umm walad for him because of the child born to him\\n\\t\\t\\t\\twhile she belonged to another, until she had had a child\\n\\t\\t\\t\\tby him while she was in his possession after he had\\n\\t\\t\\t\\tpurchased her.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If he buys her and she is pregnant by him\\n\\t\\t\\t\\tand she then gives birth while she belongs to him, she is\\n\\t\\t\\t\\this umm walad by that pregnancy, according to what we\\n\\t\\t\\t\\tthink, and Allah knows best.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "33",
    "sectionHeading": "Reprehensibility of Intercourse with Two Sisters or a Mother and Daughter that One Owns",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud from his\\n\\t\\t\\t\\tfather that Umar ibn al-Khattab was asked about a woman\\n\\t\\t\\t\\tand her daughter who were in the possession of the right\\n\\t\\t\\t\\thand, and whether one could have intercourse with one of\\n\\t\\t\\t\\tthem after the other Umar said, \"I dislike both being\\n\\t\\t\\t\\tpermitted together.\" He then forbade that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "34",
    "sectionHeading": "Reprehensibility of Intercourse with Two Sisters or a Mother and Daughter that One Owns",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tQabisa ibn Dhu'ayb that a man asked Uthman ibn Affan\\n\\t\\t\\t\\twhether one could have intercourse with two sisters who\\n\\t\\t\\t\\tone owned. Uthman said, \"One ayat makes them halal, and\\n\\t\\t\\t\\tone ayat makes them haram. As for me, I wouldn't like to\\n\\t\\t\\t\\tdo it.\" The man left him and met one of the companions of\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and asked him about it, and he said, \"Had I any\\n\\t\\t\\t\\tauthority and I found someone who had done it, I would\\n\\t\\t\\t\\tpunish him as an example.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Shihab added, \"I think that it was Ali ibn Abi Talib.\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "35",
    "sectionHeading": "Reprehensibility of Intercourse with Two Sisters or a Mother and Daughter that One Owns",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\taz-Zubayr ibn al-Awwam said the like of that.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man had sexual relations with a\\n\\t\\t\\t\\tfemale slave that he owned, and then he wanted to also\\n\\t\\t\\t\\thave relations with her sister, the sister was not halal\\n\\t\\t\\t\\tfor a man until intercourse with the slave-girl had been\\n\\t\\t\\t\\tmade haram for him by marriage, setting free, kitaba, or\\n\\t\\t\\t\\tthe like of that - for instance, if he had married her to\\n\\t\\t\\t\\this slave or someone other than his slave.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "36",
    "sectionHeading": "Prohibition against Intercourse with a Slave-Girl who Belonged to One's Father",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab gave his son a slave-girl and said,\\n\\t\\t\\t\\t\"Do not touch her, for I have uncovered her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYayha related to me from Malik that Abd arRahman ibn\\n\\t\\t\\t\\tal-Mujabbir said that Salim ibn Abdullah gave his son a\\n\\t\\t\\t\\tslave-girl and said, \"Do not go near her, for I wanted\\n\\t\\t\\t\\ther, and did not act towards her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "37",
    "sectionHeading": "Prohibition against Intercourse with a Slave-Girl who Belonged to One's Father",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAbu Nahshal ibn al-Aswad said to al-Qasim ibn Muhammad,\"I\\n\\t\\t\\t\\tsaw a slave-girl of mine uncovered in the moonlight, and\\n\\t\\t\\t\\tso I sat on her as a man sits on a woman. She said that\\n\\t\\t\\t\\tshe was menstruating, so I stood up and have not gone\\n\\t\\t\\t\\tnear her after that. Can I give her to my son to have\\n\\t\\t\\t\\tintercourse with?\" Al-Qasim forbade that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "38",
    "sectionHeading": "Prohibition against Intercourse with a Slave-Girl who Belonged to One's Father",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibrahim ibn Abi Abla\\n\\t\\t\\t\\tfrom Abd al-Malik ibn Marwan that he gave a slave-girl to\\n\\t\\t\\t\\ta friend of his, and later asked him about her. He said,\\n\\t\\t\\t\\t\"I intended to give her to my son to do such-and-such\\n\\t\\t\\t\\twith her.\" Abd al-Malik said, \"Marwan was more scrupulous\\n\\t\\t\\t\\tthan you. He gave a slave-girl to his son, and then he\\n\\t\\t\\t\\tsaid, 'Do not go near her, for I have seen her leg\\n\\t\\t\\t\\tuncovered .' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "38",
    "sectionHeading": "Prohibition against Marrying Slave-Girls of the People of the Book",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"It is not halal to marry a christian or\\n\\t\\t\\t\\tjewish slave-girl because Allah the Blessed, the Exalted,\\n\\t\\t\\t\\tsaid in His Book, 'Believing women who are muhsanat and\\n\\t\\t\\t\\twomen of those who were given the Book before you who are\\n\\t\\t\\t\\tmuhsanat', (sura 5 ayat 6) and they are free women from\\n\\t\\t\\t\\tthe Christians and Jews. Allah, the Blessed, the Exalted,\\n\\t\\t\\t\\tsaid in His Book, 'If you are not affluent enough to\\n\\t\\t\\t\\tmarry believing women who are muhsanat, take believing\\n\\t\\t\\t\\tslave-girls whom your right hands own.' \" (Sura 4 ayat\\n\\t\\t\\t\\t24)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"In our opinion, Allah made marriage to\\n\\t\\t\\t\\tbelieving slave-girls halal, and He did not make halal\\n\\t\\t\\t\\tmarriage to christian and jewish slave-girls from the\\n\\t\\t\\t\\tPeople of the Book.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The christian and jewish slave-girl are\\n\\t\\t\\t\\thalal for their master by right of possession, but\\n\\t\\t\\t\\tintercourse with a magian slave-girl is not halal by the\\n\\t\\t\\t\\tright of possession.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "39",
    "sectionHeading": "Muhsanat",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tibn al-Musayyab said, \"The muhsanat among women are those\\n\\t\\t\\t\\twho have husbands.\" That referred to the fact that Allah\\n\\t\\t\\t\\thas made fornication haram.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "40",
    "sectionHeading": "Muhsanat",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab, and he\\n\\t\\t\\t\\thad heard from al-Qasim ibn Muhammad that they said,\\n\\t\\t\\t\\t\"When a free man marries a slave-girl and consummates the\\n\\t\\t\\t\\tmarriage, she makes him muhsan.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"All (of the people of knowledge) I have seen\\n\\t\\t\\t\\tsaid that a slave-girl makes a free man muhsan when he\\n\\t\\t\\t\\tmarries her and consummates the marriage.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A slave makes a free woman muhsana when he\\n\\t\\t\\t\\tconsummates a marriage with her and a free woman only\\n\\t\\t\\t\\tmakes a slave muhsan when he is freed and he is her\\n\\t\\t\\t\\thusband and has had sexual relations with her after he\\n\\t\\t\\t\\thas been set free. If he parts from her before he is\\n\\t\\t\\t\\tfree, he is not a muhsan unless he marries her after\\n\\t\\t\\t\\thaving been set free and he consummates the marriage.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a slave-girl is married to a free man\\n\\t\\t\\t\\tand then he separates from her before she is set free,\\n\\t\\t\\t\\this marriage to her does not make her muhsana. She is not\\n\\t\\t\\t\\tmuhsana until she has married after she has been set free\\n\\t\\t\\t\\tand she has had intercourse with her husband. That gives\\n\\t\\t\\t\\ther ihsan. If she is the wife of a freeman and then she\\n\\t\\t\\t\\tis set free while she is his wife before he separates\\n\\t\\t\\t\\tfrom her, the man makes her muhsana if he has intercourse\\n\\t\\t\\t\\twith her after she has been set free.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The christian and jewish free women and the\\n\\t\\t\\t\\tmuslim slave-girl all make a muslim free man muhsan when\\n\\t\\t\\t\\the marries one of them and has intercourse with her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "41",
    "sectionHeading": "Temporary Marriage",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tAbdullah and Hasan, the sons of Muhammad ibn Ali ibn Abi\\n\\t\\t\\t\\tTalib from their ather, mayAllah be pleased with him,\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, forbade temporary marriage with women\\n\\t\\t\\t\\tand the flesh of domestic donkeys on the Day of Khaybar.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "42",
    "sectionHeading": "Temporary Marriage",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr that Khawla ibn Hakim came to Umar ibn\\n\\t\\t\\t\\tal-Khattab and said, ''Rabia ibn Umayya made a temporary\\n\\t\\t\\t\\tmarriage with a woman and she is pregnant by him.'' Umar\\n\\t\\t\\t\\tibn al-Khattab went out in dismay dragging his cloak,\\n\\t\\t\\t\\tsaying, \"This temporary marriage, had I come across it, I\\n\\t\\t\\t\\twould have ordered stoning and done away with it! \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "43",
    "sectionHeading": "Marriage of Slaves",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard Rabia ibn\\n\\t\\t\\t\\tAbd ar-Rahman say that a slave could marry four women.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the best of what I have heard about\\n\\t\\t\\t\\tthe matter.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The slave differs with the muhallil if the\\n\\t\\t\\t\\tslave is given permission by his master for his ex-wife.\\n\\t\\t\\t\\tIf his master does not give him permission, he separates\\n\\t\\t\\t\\tthem. The muhallil is separated in any case if he intends\\n\\t\\t\\t\\tto make the woman halal by marriage.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a slave is owned by his wife or a\\n\\t\\t\\t\\thusband owns his wife, the possession of each of them is\\n\\t\\t\\t\\trendered void without divorce. If a man, for instance, is\\n\\t\\t\\t\\tmarried to a slave-girl, and then he buys her, he must\\n\\t\\t\\t\\tdivorce her as a matter of course. They can then\\n\\t\\t\\t\\tre-marry. If they re-marry afterwards, that separation\\n\\t\\t\\t\\twas not divorce.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a slave is freed by his wife who owns\\n\\t\\t\\t\\thim and she is in the idda-period from him, they can only\\n\\t\\t\\t\\treturn to each other after she has made another\\n\\t\\t\\t\\tmarriage.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "44",
    "sectionHeading": "Marriage of Idol Worshippers when their Wives become Muslim before Them",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab that he had heard\\n\\t\\t\\t\\tthat in the time of the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, women were becoming muslim\\n\\t\\t\\t\\tin their own lands and they did not do hijra while their\\n\\t\\t\\t\\thusbands were still kafirun although they themselves had\\n\\t\\t\\t\\tbecome muslim. Among them was the daughter of al-Walid\\n\\t\\t\\t\\tibn al-Mughira and she was the wife of Safwan ibn Umayya.\\n\\t\\t\\t\\tShe became muslim on the day of the conquest (of Makka),\\n\\t\\t\\t\\tand her husband, Safwan ibn Umayya fled from Islam. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, sent Safwan's paternal cousin, Wahb ibn Umayr with\\n\\t\\t\\t\\tthe cloak of the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, as a safe-conduct for Safwan ibn\\n\\t\\t\\t\\tUmayya, and the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, called him to Islam and asked for\\n\\t\\t\\t\\thim to come to him and if he was pleased with the matter\\n\\t\\t\\t\\tto accept it. If not he would have a respite for two\\n\\t\\t\\t\\tmonths.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWhen Safwan came to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, with his cloak, he called\\n\\t\\t\\t\\tout to him over the heads of the people, \"Muhammad! Wahb\\n\\t\\t\\t\\tibn Umayr brought me your cloak and claimed that you had\\n\\t\\t\\t\\tsummoned me to come to you and if I was pleased with the\\n\\t\\t\\t\\tmatter, I should accept it and if not, you would give me\\n\\t\\t\\t\\ta respite for two months. \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Come down,\\n\\t\\t\\t\\tAbu Wahb.\" He said, \"No, by Allah! I will not come down\\n\\t\\t\\t\\tuntil you make it clear to me.\" The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"You have\\n\\t\\t\\t\\ta respite of four months.\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, went out toward\\n\\t\\t\\t\\tHawazin at Hunayn. He sent to Safwan ibn Umayya to borrow\\n\\t\\t\\t\\tsome equipment and arms that he had. Safwan said,\\n\\t\\t\\t\\t\"Willingly or unwillingly?\" He said, \"Willingly.\"\\n\\t\\t\\t\\tTherefore he lent him the equipment and arms which he\\n\\t\\t\\t\\thad. Then Safwan went out with the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, while he was\\n\\t\\t\\t\\tstill a kafir. He was present at the battles of Hunayn\\n\\t\\t\\t\\tand at-Ta'if while he was still a kafir and his wife was\\n\\t\\t\\t\\ta muslim. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, did not separate Safwan and his wife\\n\\t\\t\\t\\tuntil he had become muslim, and his wife was settled with\\n\\t\\t\\t\\thim by that marriage.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "45",
    "sectionHeading": "Marriage of Idol Worshippers when their Wives become Muslim before Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said,\\n\\t\\t\\t\\t\"Between the Islam of Safwan and the Islam of his wife\\n\\t\\t\\t\\tthere was about one month.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Shihab said, \"We have not heard about any woman doing\\n\\t\\t\\t\\thijra for Allah and His Messenger while her husband was a\\n\\t\\t\\t\\tkafir abiding in the land of kufr, but that her hijra\\n\\t\\t\\t\\tseparated her and her husband unless her husband came in\\n\\t\\t\\t\\thijra before her period of idda had been completed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "46",
    "sectionHeading": "Marriage of Idol Worshippers when their Wives become Muslim before Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Umm\\n\\t\\t\\t\\tHakim bint al-Harith ibn Hisham who was the wife of\\n\\t\\t\\t\\tIkrima ibn Abi Jahl became muslim on the day of the\\n\\t\\t\\t\\tconquest of Makka, and her husband Ikrima fled from Islam\\n\\t\\t\\t\\tas far as the Yemen. Umm Hakim set out after him until\\n\\t\\t\\t\\tshe came to him in the Yemen and she called him to Islam,\\n\\t\\t\\t\\tand he became muslim. He went to the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, in the year of\\n\\t\\t\\t\\tthe conquest. When the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, saw him, he rushed to him\\n\\t\\t\\t\\tin joy and did not bother to put on his cloak until he\\n\\t\\t\\t\\thad made the pledge with him. They were confirmed in\\n\\t\\t\\t\\ttheir marriage.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a man becomes muslim before his wife, a\\n\\t\\t\\t\\tseparation occurs between them when he presents Islam to\\n\\t\\t\\t\\ther and she does not become muslim, because Allah, the\\n\\t\\t\\t\\tBlessed, the Exalted, said in His Book, 'Do not hold fast\\n\\t\\t\\t\\tto the ties of women who are kafirun.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "47",
    "sectionHeading": "The Wedding Feast.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd at-Tawil from\\n\\t\\t\\t\\tAnas ibn Malik that Abd ar-Rahman ibn Awf came to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and he had a traceof yellow on him. The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, asked\\n\\t\\t\\t\\tabout it. He told him that he had just been married. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"How much did you hand over to her?\" He\\n\\t\\t\\t\\tsaid, \"The weight of a date pit in gold.\" The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said\\n\\t\\t\\t\\tto him, \"Hold a feast, even if it is only with a sheep.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "48",
    "sectionHeading": "The Wedding Feast.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"I have heard that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, held a wedding feast in\\n\\t\\t\\t\\twhich there was neither meat nor bread.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "49",
    "sectionHeading": "The Wedding Feast.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"When you are invited to a\\n\\t\\t\\t\\twedding feast, you must go to it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "50",
    "sectionHeading": "The Wedding Feast.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibr. Shihab from\\n\\t\\t\\t\\tal-Araj that Abu Hurayra said, \"The worst food is the\\n\\t\\t\\t\\tfood of a wedding feast to which the rich are invited and\\n\\t\\t\\t\\tthe poor are left out. If anyone rejects an invitation,\\n\\t\\t\\t\\the has rebelled against Allah and His Messenger.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "51",
    "sectionHeading": "The Wedding Feast.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha heard Anas ibn Malik say that a certain\\n\\t\\t\\t\\ttailor invited the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, to eat some food which he had\\n\\t\\t\\t\\tprepared.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAnas said, \"I went with the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, to eat the food. He served\\n\\t\\t\\t\\tbarley bread and a soup with pumpkin in it. I saw the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, going after the pumpkin around the dish, so I have\\n\\t\\t\\t\\talways liked pumpkin since that day.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "52",
    "sectionHeading": "Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"When you marry a woman or buy a slave-girl,\\n\\t\\t\\t\\ttake her by the forelock and ask for baraka. When you buy\\n\\t\\t\\t\\ta camel, take the top of its hump, and seek refuge with\\n\\t\\t\\t\\tAllah from Shaytan.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "53",
    "sectionHeading": "Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zubayr al-Makki\\n\\t\\t\\t\\tthat somebody asked a man for his sister in marriage and\\n\\t\\t\\t\\tthe man mentioned that she had committed fornication.\\n\\t\\t\\t\\tUmar ibn al-Khattab heard about it and he beat the man or\\n\\t\\t\\t\\talmost beat him, and said, \"What did you mean by giving\\n\\t\\t\\t\\thim such information?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "54",
    "sectionHeading": "Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman that al-Qasim ibn Muhammad and Urwa ibn\\n\\t\\t\\t\\taz-Zubayr said that a man who had four wives and then\\n\\t\\t\\t\\tdivorced one of them irrevocably, could marry\\n\\t\\t\\t\\tstraightaway if he wished, and he did not have to wait\\n\\t\\t\\t\\tfor the completion of her idda.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "55",
    "sectionHeading": "Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abd\\n\\t\\t\\t\\tar-Rahman that al-Qasim ibn Muhammad and Urwa ibn\\n\\t\\t\\t\\taz-Zubayr gave the same judgement to al-Walid ibn Abd\\n\\t\\t\\t\\tal-Malik in the year of his arrival in Madina except that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad said that he divorced his wife on\\n\\t\\t\\t\\tvarious occasions. (i.e. not at one time).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "56",
    "sectionHeading": "Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"There are three things in\\n\\t\\t\\t\\twhich there is no jest: marriage, divorce, and setting\\n\\t\\t\\t\\tfree.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "28",
    "hadithNumber": "57",
    "sectionHeading": "Marriage in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Rafi\\n\\t\\t\\t\\tibn Khadij married the daughter of Muhammad ibn Maslama\\n\\t\\t\\t\\tal-Ansari. She was with him until she grew older, and\\n\\t\\t\\t\\tthen he married a young girl and preferred the young girl\\n\\t\\t\\t\\tto her. She begged him to divorce her, so he divorced her\\n\\t\\t\\t\\tand then he gave her time until she had almost finished\\n\\t\\t\\t\\ther idda period and then he returned and still preferred\\n\\t\\t\\t\\tthe young girl. She therefore asked him to divorce her.\\n\\t\\t\\t\\tHe divorced her once, and then returned to her, and still\\n\\t\\t\\t\\tpreferred the young girl, and she asked him to divorce\\n\\t\\t\\t\\ther. He said, \"What do you want? There is only one\\n\\t\\t\\t\\tdivorce left. If you like, continue and put up with what\\n\\t\\t\\t\\tyou see of preference, and if you like, I will separate\\n\\t\\t\\t\\tfrom you.\" She said, \"I will continue in spite of the\\n\\t\\t\\t\\tpreference.\" He kept her in spite of that. Rafi did not\\n\\t\\t\\t\\tsee that he had done any wrong action when she remained\\n\\t\\t\\t\\twith him in spite of preference.\\n\\t\\t\\t</p>"
  }
]
