[
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "1",
    "Text": "&#761;This is&#762; a s&ucirc;rah&nbsp;which We have revealed and made &#761;its rulings&#762; obligatory, and revealed in it clear commandments so that you may be mindful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "2",
    "Text": "As for female and male fornicators, give each of them one hundred lashes,<span class='fn' foot_note=29495>1</span>&nbsp;and do not let pity for them make you lenient in &#761;enforcing&#762; the law of Allah, if you &#761;truly&#762; believe in Allah and the Last Day. And let a number of believers witness their punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "3",
    "Text": "A male fornicator would only marry a female fornicator or idolatress. And a female fornicator would only be married to a fornicator or idolater. This is &#761;all&#762; forbidden to the believers.<span class='fn' foot_note=29496>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "4",
    "Text": "Those who accuse chaste women &#761;of adultery&#762; and fail to produce four witnesses, give them eighty lashes &#761;each&#762;. And do not ever accept any testimony from them&mdash;for they are indeed the rebellious&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "5",
    "Text": "except those who repent afterwards and mend their ways, then surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "6",
    "Text": "And those who accuse their wives &#761;of adultery&#762; but have no witness except themselves, the accuser must testify,<span class='fn' foot_note=29497>1</span>&nbsp;swearing four times by Allah that he is telling the truth,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "7",
    "Text": "and a fifth oath that Allah may condemn him if he is lying."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "8",
    "Text": "For her to be spared the punishment, she must swear four times by Allah that he is telling a lie,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "9",
    "Text": "and a fifth oath that Allah may be displeased with her if he is telling the truth.<span class='fn' foot_note=29498>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "10",
    "Text": "&#761;You would have suffered,&#762; had it not been for Allah&rsquo;s grace and mercy upon you, and had Allah not been Accepting of Repentance, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "11",
    "Text": "Indeed, those who came up with that &#761;outrageous&#762; slander are a group of you. Do not think this is bad for you. Rather, it is good for you.<span class='fn' foot_note=29499>1</span>&nbsp;They will be punished, each according to their share of the sin. As for their mastermind,<span class='fn' foot_note=29500>2</span>&nbsp;he will suffer a tremendous punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "12",
    "Text": "If only the believing men and women had thought well of one another, when you heard this &#761;rumour&#762;, and said, &ldquo;This is clearly &#761;an outrageous&#762; slander!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "13",
    "Text": "Why did they not produce four witnesses? Now, since they have failed to produce witnesses, they are &#761;truly&#762; liars in the sight of Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "14",
    "Text": "Had it not been for Allah&rsquo;s grace and mercy upon you in this world and the Hereafter, you would have certainly been touched with a tremendous punishment for what you plunged into&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "15",
    "Text": "when you passed it from one tongue to the other, and said with your mouths what you had no knowledge of, taking it lightly while it is &#761;extremely&#762; serious in the sight of Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "16",
    "Text": "If only you had said upon hearing it, &ldquo;How can we speak about such a thing! Glory be to You &#761;O Lord&#762;! This is a heinous slander!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "17",
    "Text": "Allah forbids you from ever doing something like this again, if you are &#761;true&#762; believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "18",
    "Text": "And Allah makes &#761;His&#762; commandments clear to you, for Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "19",
    "Text": "Indeed, those who love to see indecency spread among the believers will suffer a painful punishment in this life and the Hereafter. Allah knows and you do not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "20",
    "Text": "&#761;You would have suffered,&#762; had it not been for Allah&rsquo;s grace and mercy upon you, and had Allah not been Ever Gracious, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "21",
    "Text": "O believers! Do not follow the footsteps of Satan. Whoever follows Satan&rsquo;s footsteps, then &#761;let them know that&#762; he surely bids &#761;all to&#762; immorality and wickedness. Had it not been for Allah&rsquo;s grace and mercy upon you, none of you would have ever been purified. But Allah purifies whoever He wills. And Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "22",
    "Text": "Do not let the people of virtue and affluence among you swear to suspend donations to their relatives, the needy, and the emigrants in the cause of Allah. Let them pardon and forgive. Do you not love to be forgiven by Allah? And Allah is All-Forgiving, Most Merciful.<span class='fn' foot_note=29501>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "23",
    "Text": "Surely those who accuse chaste, unsuspecting,<span class='fn' foot_note=29502>1</span>&nbsp;believing women are cursed in this life and the Hereafter. And they will suffer a tremendous punishment"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "24",
    "Text": "on the Day their tongues, hands, and feet will testify against them for what they used to do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "25",
    "Text": "On that Day, Allah will give them their just penalty in full, and they will &#761;come to&#762; know that Allah &#761;alone&#762; is the Ultimate Truth."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "26",
    "Text": "Wicked women are for wicked men, and wicked men are for wicked women. And virtuous women are for virtuous men, and virtuous men are for virtuous women. The virtuous are innocent of what the wicked say. They will have forgiveness and an honourable provision.<span class='fn' foot_note=29503>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "27",
    "Text": "O believers! Do not enter any house other than your own until you have asked for permission and greeted its occupants. This is best for you, so perhaps you will be mindful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "28",
    "Text": "If you find no one at home, do not enter it until you have been given permission. And if you are asked to leave, then leave. That is purer for you. And Allah has &#761;perfect&#762; knowledge of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "29",
    "Text": "There is no blame on you if you enter public places<span class='fn' foot_note=29504>1</span>&nbsp;where there is something of benefit for you. And Allah knows what you reveal and what you conceal."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "30",
    "Text": "&#761;O Prophet!&#762; Tell the believing men to lower their gaze and guard their chastity. That is purer for them. Surely Allah is All-Aware of what they do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "31",
    "Text": "And tell the believing women to lower their gaze and guard their chastity, and not to reveal their adornments<span class='fn' foot_note=29505>1</span>&nbsp;except what normally appears.<span class='fn' foot_note=29506>2</span>&nbsp;Let them draw their veils over their chests, and not reveal their &#761;hidden&#762; adornments<span class='fn' foot_note=29507>3</span>&nbsp;except to their husbands, their fathers, their fathers-in-law, their sons, their stepsons, their brothers, their brothers&rsquo; sons or sisters&rsquo; sons, their fellow women, those &#761;bondwomen&#762; in their possession, male attendants with no desire, or children who are still unaware of women&rsquo;s nakedness. Let them not stomp their feet, drawing attention to their hidden adornments. Turn to Allah in repentance all together, O &nbsp;believers, so that you may be successful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "32",
    "Text": "Marry off the &#761;free&#762; singles among you, as well as the righteous of your bondmen and bondwomen. If they are poor, Allah will enrich them out of His bounty. For Allah is All-Bountiful, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "33",
    "Text": "And let those who do not have the means to marry keep themselves chaste until Allah enriches them out of His bounty. And if any of those &#761;bondspeople&#762; in your possession desires a deed of emancipation, make it possible for them, if you find goodness in them. And give them some of Allah&rsquo;s wealth which He has granted you. Do not force your &#761;slave&#762; girls into prostitution for your own worldly gains while they wish to remain chaste. And if someone coerces them, then after such a coercion Allah is certainly All-Forgiving, Most Merciful &#761;to them&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "34",
    "Text": "Indeed, We have sent down to you clear revelations, along with examples of those who had gone before you, and a lesson to the God-fearing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "35",
    "Text": "Allah is the Light of the heavens and the earth. His light<span class='fn' foot_note=29508>1</span>&nbsp;is like a niche in which there is a lamp, the lamp is in a crystal, the crystal is like a shining star, lit from &#761;the oil of&#762; a blessed olive tree, &#761;located&#762; neither to the east nor the west,<span class='fn' foot_note=29509>2</span>&nbsp;whose oil would almost glow, even without being touched by fire. Light upon light! Allah guides whoever He wills to His light. And Allah sets forth parables for humanity. For Allah has &#761;perfect&#762; knowledge of all things."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "36",
    "Text": "&#761;That light shines&#762; through houses &#761;of worship&#762; which Allah has ordered to be raised, and where His Name is mentioned. He is glorified there morning and evening"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "37",
    "Text": "by men<span class='fn' foot_note=29510>1</span>&nbsp;who are not distracted&mdash;either by buying or selling&mdash;from Allah&rsquo;s remembrance, or performing prayer, or paying alms-tax. They fear a Day when hearts and eyes will tremble,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "38",
    "Text": "&#761;hoping&#762; that Allah may reward them according to the best of their deeds, and increase them out of His grace. And Allah provides for whoever He wills without limit."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "39",
    "Text": "As for the disbelievers, their deeds are like a mirage in a desert, which the thirsty perceive as water, but when they approach it, they find it to be nothing. Instead, they find Allah there &#761;in the Hereafter, ready&#762; to settle their account. And Allah is swift in reckoning."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "40",
    "Text": "Or &#761;their deeds are&#762; like the darkness in a deep sea, covered by waves upon waves,<span class='fn' foot_note=29511>1</span>&nbsp;topped by &#761;dark&#762; clouds. Darkness upon darkness! If one stretches out their hand, they can hardly see it. And whoever Allah does not bless with light will have no light!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "41",
    "Text": "Do you not see that Allah is glorified by all those in the heavens and the earth, even the birds as they soar? Each &#761;instinctively&#762; knows their manner of prayer and glorification. And Allah has &#761;perfect&#762; knowledge of all they do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "42",
    "Text": "To Allah &#761;alone&#762; belongs the kingdom of the heavens and the earth. And to Allah is the final return."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "43",
    "Text": "Do you not see that Allah gently drives the clouds, then joins them together, piling them up into masses, from which you see raindrops come forth? And He sends down from the sky mountains &#761;of clouds&#762; loaded with hail, pouring it on whoever He wills and averting it from whoever He wills. The flash of the clouds&rsquo; lightning nearly takes away eyesight."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "44",
    "Text": "Allah alternates the day and night. Surely in this is a lesson for people of insight."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "45",
    "Text": "And Allah has created from water every living creature. Some of them crawl on their bellies, some walk on two legs, and some walk on four. Allah creates whatever He wills. Surely Allah is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "46",
    "Text": "We have indeed sent down revelations clarifying &#761;the truth&#762;. But Allah &#761;only&#762; guides whoever He wills to the Straight Path."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "47",
    "Text": "And the hypocrites say, &ldquo;We believe in Allah and the Messenger, and we obey.&rdquo; Then a group of them turns away soon after that. These are not &#761;true&#762; believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "48",
    "Text": "And as soon as they are called to Allah and His Messenger so he may judge between them, a group of them<span class='fn' foot_note=29512>1</span>&nbsp;turns away."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "49",
    "Text": "But if the truth is in their favour, they come to him, fully submitting."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "50",
    "Text": "Is there a sickness in their hearts? Or are they in doubt? Or do they fear that Allah and His Messenger will be unjust to them? In fact, it is they who are the &#761;true&#762; wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "51",
    "Text": "The only response of the &#761;true&#762; believers, when they are called to Allah and His Messenger so he may judge between them, is to say, &ldquo;We hear and obey.&rdquo; It is they who will &#761;truly&#762; succeed."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "52",
    "Text": "For whoever obeys Allah and His Messenger, and fears Allah and is mindful of Him, then it is they who will &#761;truly&#762; triumph."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "53",
    "Text": "They swear by Allah their most solemn oaths that if you &#761;O Prophet&#762; were to command them, they would certainly march forth &#761;in Allah&rsquo;s cause&#762;. Say, &ldquo;&#761;You&#762; do not &#761;have to&#762; swear; your obedience is well known!&rdquo;<span class='fn' foot_note=29513>1</span>&nbsp;Surely Allah is All-Aware of what you do.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "54",
    "Text": "Say, &ldquo;Obey Allah and obey the Messenger. But if you turn away, then he is only responsible for his duty<span class='fn' foot_note=29514>1</span>&nbsp;and you are responsible for yours.<span class='fn' foot_note=29515>2</span>&nbsp;And if you obey him, you will be &#761;rightly&#762; guided. The Messenger&rsquo;s duty is only to deliver &#761;the message&#762; clearly.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "55",
    "Text": "Allah has promised those of you who believe and do good that He will certainly make them successors in the land, as He did with those before them; and will surely establish for them their faith which He has chosen for them; and will indeed change their fear into security&mdash;&#761;provided that&#762; they worship Me, associating nothing with Me. But whoever disbelieves after this &#761;promise&#762;, it is they who will be the rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "56",
    "Text": "Moreover, establish prayer, pay alms-tax, and obey the Messenger, so you may be shown mercy."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "57",
    "Text": "Do not think &#761;O Prophet&#762; that the disbelievers can escape in the land. The Fire will be their home. Indeed, what an evil destination!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "58",
    "Text": "O believers! Let those &#761;bondspeople&#762; in your possession and those of you who are still under age ask for your permission &#761;to come in&#762; at three times: before dawn prayer, when you take off your &#761;outer&#762; clothes at noon, and after the late evening prayer. &#761;These are&#762; three times of privacy for you. Other than these times, there is no blame on you or them to move freely, attending to one another. This is how Allah makes the revelations clear to you, for Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "59",
    "Text": "And when your children reach the age of puberty, let them seek permission &#761;to come in&#762;, as their seniors do. This is how Allah makes His revelations clear to you, for Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "60",
    "Text": "As for elderly women past the age of marriage, there is no blame on them if they take off their &#761;outer&#762; garments, without revealing their adornments. But it is better for them if they avoid this &#761;altogether&#762;. And Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "61",
    "Text": "There is no restriction on the blind, or the disabled, or the sick.<span class='fn' foot_note=29516>1</span>&nbsp;Nor on yourselves if you eat from your homes,<span class='fn' foot_note=29517>2</span>&nbsp;or the homes of your fathers, or your mothers, or your brothers, or your sisters, or your paternal uncles, or your paternal aunts, or your maternal uncles, or your maternal aunts, or from the homes in your trust, or &#761;the homes of&#762; your friends. There is no blame on you eating together or separately. However, when you enter houses, greet one another with a greeting &#761;of peace&#762; from Allah, blessed and good.<span class='fn' foot_note=29518>3</span>&nbsp;This is how Allah makes His revelations clear to you, so perhaps you will understand."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "62",
    "Text": "The &#761;true&#762; believers are only those who believe in Allah and His Messenger, and when they are with him on a public matter, they do not leave without his permission. Indeed, those who ask your permission &#761;O Prophet&#762; are the ones who &#761;truly&#762; believe in Allah and His Messenger. So when they ask your permission for a private matter, grant permission to whoever you wish and ask Allah&rsquo;s forgiveness for them. Surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "63",
    "Text": "Do not treat the Messenger&rsquo;s summons to you &#761;as lightly&#762; as your summons to one another.<span class='fn' foot_note=29519>1</span>&nbsp;Allah certainly knows those of you who slip away, hiding behind others.<span class='fn' foot_note=29520>2</span>&nbsp;So let those who disobey his orders beware, for an affliction may befall them, or a painful torment may overtake them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "24",
    "AyahNumber": "64",
    "Text": "Surely to Allah belongs whatever is in the heavens and the earth. He knows well what you stand for. And &#761;on&#762; the Day all will be returned to Him, He will inform them of what they did. For Allah has &#761;perfect&#762; knowledge of all things."
  }
]
