[
  {
    "SurahNumber": "4",
    "AyahNumber": "1",
    "Text": "O mankind! Have fear of your Rabb, the One who created you from a\\n\\t\\t\\tsingle soul, from that soul He created its mate, and through them\\n\\t\\t\\tHe spread countless men and women. Fear Allah, the One in whose\\n\\t\\t\\tname you demand your rights from one another and the ties of\\n\\t\\t\\trelationship; surely Allah is watching you very closely."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "2",
    "Text": "Give orphans the property which belongs to them when they are\\n\\t\\t\\table to handle it themselves and do not substitute your worthless\\n\\t\\t\\tthings for their valuable ones; and do not cheat them of their\\n\\t\\t\\tpossession through mixing it up with your own. For this would\\n\\t\\t\\tindeed be a great sin."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "3",
    "Text": "If you fear that you shall not be able to treat the orphans with\\n\\t\\t\\tfairness, then you should not marry the women with orphan\\n\\t\\t\\tchildren; marry other women of your choice: two, three or four.\\n\\t\\t\\tBut if you fear that you will not be able to maintain justice\\n\\t\\t\\tbetween your wives, then marry only one or any slave girl you may\\n\\t\\t\\town. That will be more suitable , so that you may not deviate\\n\\t\\t\\tfrom the Right Way."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "4",
    "Text": "At the time of marriage, give the women their dowries willingly\\n\\t\\t\\tas an obligation; but if they, by their own free will, give up to\\n\\t\\t\\tyou a portion of it then you may enjoy it with pleasure."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "5",
    "Text": "Do not entrust your property which Allah has made a means of\\n\\t\\t\\tsupport for your family, to feebleminded people for investment in\\n\\t\\t\\tbusiness, however, provide such people with food and clothing and\\n\\t\\t\\tspeak to them nicely and give them good advice."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "6",
    "Text": "Observe the orphans through testing their abilities until they\\n\\t\\t\\treach the age of marriage, then if you find them capable of sound\\n\\t\\t\\tjudgment, hand over to them their property; and do not consume it\\n\\t\\t\\twastefully in haste lest they grow up to demand it. If the\\n\\t\\t\\tguardian is well-off, he should not take compensation from the\\n\\t\\t\\torphan's property, but if he is poor let him take a just and\\n\\t\\t\\treasonable remuneration. When you hand over their property to\\n\\t\\t\\tthem, call in some witnesses; even though Allah is sufficient in\\n\\t\\t\\ttaking the accountability."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "7",
    "Text": "Men will have a share in what their parents and their near\\n\\t\\t\\trelatives leave; and women will have a share in what their\\n\\t\\t\\tparents and their near relatives leave: whether it be a little or\\n\\t\\t\\tmuch, they shall be legally entitled to their shares."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "8",
    "Text": "If the relatives, orphans or needy are present at the time of the\\n\\t\\t\\tdivision of an inheritance, give them something out of it, and\\n\\t\\t\\tspeak to them kind words."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "9",
    "Text": "Let those (disposing of an estate) have the same fear in their\\n\\t\\t\\tminds as they would have for their own if they were to leave a\\n\\t\\t\\thelpless family behind: they should, therefore, fear Allah and\\n\\t\\t\\tspeak for justice."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "10",
    "Text": "In fact, those who misappropriate the property of orphans\\n\\t\\t\\tunjustly, swallow but fire into their bellies; they will soon be\\n\\t\\t\\tcast into the blazing fire!"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "11",
    "Text": "In regard to inheritance Allah commands you concerning your\\n\\t\\t\\tchildren: that the share of a boy shall be twice that of a girl.\\n\\t\\t\\tIn the case where there are more than two girls, their share will\\n\\t\\t\\tbe two thirds of the estate; but if there is only one girl, her\\n\\t\\t\\tshare will be one half of the estate. If the deceased left\\n\\t\\t\\tchildren behind, each of the parents shall get one sixth of the\\n\\t\\t\\testate, but if the deceased left no children and the parents are\\n\\t\\t\\tthe only heirs, the mother shall get one third of the estate, but\\n\\t\\t\\tif the deceased left brothers and sisters, then the mother will\\n\\t\\t\\tget one sixth of it. The distribution in all cases shall be after\\n\\t\\t\\tfulfilling the terms of the last will and the payment of debts.\\n\\t\\t\\tWith regards to your parents and your children, you do not know\\n\\t\\t\\twho is more beneficial to you, therefore, Allah issued this\\n\\t\\t\\tordinance. Surely Allah is the Knowledgeable, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "12",
    "Text": "You shall inherit one half of your wives' estate if they leave no\\n\\t\\t\\tchild, but if they leave behind a child then you will get one\\n\\t\\t\\tfourth of their estate, after fulfilling the terms of their last\\n\\t\\t\\twill and the payment of debts. Your wives shall inherit one\\n\\t\\t\\tfourth if you leave no child behind you; but if you leave a\\n\\t\\t\\tchild, then they shall get one-eighth of your estate; after\\n\\t\\t\\tfulfilling the terms of your last will and the payment of debts.\\n\\t\\t\\tIf a man or a woman leaves neither ascendant nor descendants but\\n\\t\\t\\thas left a brother or a sister, they shall each inherit one\\n\\t\\t\\tsixth, but if they are more than two, they shall share one third\\n\\t\\t\\tof the estate; after fulfilling the terms of the last will and\\n\\t\\t\\tthe payment of debts; without prejudice to the rights of the\\n\\t\\t\\theirs. Thus is the commandment of Allah. Allah is Knowledgeable,\\n\\t\\t\\tForbearing."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "13",
    "Text": "These are the limits set by Allah: those who obey Allah and His\\n\\t\\t\\tRasool will be admitted to paradise, in which rivers flow, to\\n\\t\\t\\tlive therein forever, and that is the Great Achievement."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "14",
    "Text": "But the ones who disobey Allah and His Rasool and transgress His\\n\\t\\t\\tlimits will be cast to Hellfire to live therein forever, and they\\n\\t\\t\\tshall have a humiliating punishment."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "15",
    "Text": "If any of your women are guilty of fornication, ask for four\\n\\t\\t\\treliable witnesses from among yourselves against them; and if\\n\\t\\t\\tthey testify and their guilt is proved, confine them to their\\n\\t\\t\\thouses until they die or Allah opens some other way out for them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "16",
    "Text": "And the two, whether married or unmarried, who are guilty of this\\n\\t\\t\\toffense, punish them both. If they repent and mend their ways,\\n\\t\\t\\tleave them alone. Surely Allah is the Acceptor of Repentance,\\n\\t\\t\\tMerciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "17",
    "Text": "Repentance with Allah (right to be forgiven by Allah) is only for\\n\\t\\t\\tthose who do something evil in ignorance and repent as soon as\\n\\t\\t\\tthey realize it; Allah will pardon them. Allah is the\\n\\t\\t\\tKnowledgeable, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "18",
    "Text": "There is no repentance for those who persist in their evil deeds\\n\\t\\t\\tuntil death approaches anyone of them and he says: \"surely now I\\n\\t\\t\\trepent.\" Similarly, there is no repentance for those who die\\n\\t\\t\\twhile they were still unbelievers; for them We have prepared a\\n\\t\\t\\tpainful punishment."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "19",
    "Text": "O believers! It is not lawful for you consider women as a part of\\n\\t\\t\\tyour inheritance and retain them against their will in order that\\n\\t\\t\\tyou may force them to give up a part of the dowry you have given\\n\\t\\t\\tthem, unless they are guilty of proven fornication. Treat them\\n\\t\\t\\twith kindness even if you dislike them; it is quite possible that\\n\\t\\t\\tyou dislike something in which Allah has placed much good."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "20",
    "Text": "If you wish to marry another wife in place of the one you already\\n\\t\\t\\thave, do not take back anything of what you have given her even\\n\\t\\t\\tif it be a heap of gold. Would you take it back through slander\\n\\t\\t\\tand open sin (accusing her unjustly)?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "21",
    "Text": "And how could you take it back when you have enjoyed conjugal\\n\\t\\t\\thappiness and she had taken from you a firm pledge of marriage?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "22",
    "Text": "Do not marry those women whom your fathers had married, - except\\n\\t\\t\\twhat happened prior to this commandment. - Surely it was\\n\\t\\t\\tshocking, disgusting, and an evil practice."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "23",
    "Text": "Forbidden to you for marriage are: your mothers, your daughters,\\n\\t\\t\\tyour sisters, your paternal aunts, your maternal aunts, daughters\\n\\t\\t\\tof your brothers, daughters of your sisters, your foster-mothers,\\n\\t\\t\\tyour foster-sisters, the mothers of your wives, your\\n\\t\\t\\tstepdaughters under your guardianship from those wives with whom\\n\\t\\t\\tyou have consummated your marriage, but there is no blame on you\\n\\t\\t\\tin marrying your stepdaughters if you have not consummated your\\n\\t\\t\\tmarriage with their mothers, whom you have divorced, and the\\n\\t\\t\\twives of your own real sons; and you are also forbidden to take\\n\\t\\t\\tin marriage two sisters at one and the same time except what\\n\\t\\t\\thappened prior to this commandment; surely Allah is Forgiving,\\n\\t\\t\\tMerciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "24",
    "Text": "Also forbidden for you are married women, except those who have\\n\\t\\t\\tfallen in your hands as prisoners of war. This is the order of\\n\\t\\t\\tAllah relating to marriage prohibitions. All women other than\\n\\t\\t\\tthese are lawful provided you seek them in marriage with gifts\\n\\t\\t\\tfrom your property (dowry), desiring chastity and not lust. Give\\n\\t\\t\\tthem their dowry as an obligation for the benefit you have\\n\\t\\t\\treceived from your marriage relationship. However, there is no\\n\\t\\t\\tblame on you if you change the agreement of dowry with mutual\\n\\t\\t\\tconsent. Allah is the Knowledgeable, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "25",
    "Text": "If any of you cannot afford to marry a free believing woman, let\\n\\t\\t\\thim marry one of his own slave girls who is a believer; Allah\\n\\t\\t\\tknows how good you are in your faith. You all belong to one and\\n\\t\\t\\tthe same community. Marry them with the permission of their\\n\\t\\t\\tfamily and give them their fair dowry so that they may live a\\n\\t\\t\\tdecent life in wedlock and not live as prostitutes or look for\\n\\t\\t\\tsecret illicit relationships. Then if after marriage they commit\\n\\t\\t\\tadultery, they shall be given half the punishment prescribed for\\n\\t\\t\\ta free adulteress. The concession of such a marriage is for those\\n\\t\\t\\tof you who fear that they might commit a sin if they do not get\\n\\t\\t\\tmarried, but it is better for you to practice self-restraint.\\n\\t\\t\\tAllah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "26",
    "Text": "Allah desires to clarify, and guides you to the ways which were\\n\\t\\t\\tfollowed by the righteous people before you, and turns to you in\\n\\t\\t\\tmercy. Allah is the Knowledgeable, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "27",
    "Text": "Allah wishes to forgive you but those who follow their lusts wish\\n\\t\\t\\tto see you deviate far away from the Right Way."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "28",
    "Text": "Allah wishes to lighten your burdens because humans have been\\n\\t\\t\\tcreated weak by nature."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "29",
    "Text": "O believers! Do not consume one another's wealth through unlawful\\n\\t\\t\\tmeans; instead, do business with mutual consent; do not kill\\n\\t\\t\\tyourselves by adopting unlawful means. Indeed Allah is Merciful\\n\\t\\t\\tto you."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "30",
    "Text": "Anyone who commits such acts of aggression and injustice will\\n\\t\\t\\tsoon be thrown into hellfire, and this is very easy for Allah to\\n\\t\\t\\tdo."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "31",
    "Text": "If you avoid the heinous sins which you have been forbidden, We\\n\\t\\t\\twill do away with your small sins and cause you to enter a place\\n\\t\\t\\tof great honor (paradise)."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "32",
    "Text": "Do not envy that Allah has given some of you more than the\\n\\t\\t\\tothers. Men will be rewarded according to their deeds and women\\n\\t\\t\\twill be rewarded according to theirs. Ask Allah for His grace.\\n\\t\\t\\tSurely Allah has perfect knowledge of everything."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "33",
    "Text": "For every parent and relative We have appointed the rightful\\n\\t\\t\\theirs to inherit what they leave. As for those with whom you have\\n\\t\\t\\tmade firm agreements, give them their share. Surely Allah is a\\n\\t\\t\\tWitness to everything."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "34",
    "Text": "Men are overseers over women because Allah has given the one more\\n\\t\\t\\tstrength than other, and because men are required to spend their\\n\\t\\t\\twealth for the maintenance of women. Honorable women are,\\n\\t\\t\\ttherefore, devoutly obedient and guard in the husband's absence\\n\\t\\t\\twhat Allah require them to guard their husband's property and\\n\\t\\t\\ttheir own honor. As to those women from whom you fear\\n\\t\\t\\tdisobedience, first admonish them, then refuse to share your bed\\n\\t\\t\\twith them, and then, if necessary, beat them. Then if they obey\\n\\t\\t\\tyou, take no further actions against them and do not make excuses\\n\\t\\t\\tto punish them. Allah is Supremely Great and is aware of your\\n\\t\\t\\tactions."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "35",
    "Text": "If you fear a breach of marriage between a man and his wife,\\n\\t\\t\\tappoint one arbiter from his family and another from hers; if\\n\\t\\t\\tthey wish to reconcile, Allah will create a way of reconciliation\\n\\t\\t\\tbetween them. Allah is the Knowledgeable, Aware."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "36",
    "Text": "Serve Allah and do not commit shirk (associate any partner) with\\n\\t\\t\\tHim, and be good to your parents, kinfolks, orphans, the\\n\\t\\t\\thelpless, near and far neighbors who keep company with you, the\\n\\t\\t\\ttravellers in need, and the slaves you own. Allah does not love\\n\\t\\t\\tthose who are arrogant and boastful,"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "37",
    "Text": "who are themselves stingy and enjoin others to be stingy, who\\n\\t\\t\\thide the bounties which Allah has bestowed on them. For such\\n\\t\\t\\tunbelievers We have prepared a disgraceful punishment."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "38",
    "Text": "Similarly, Allah does not like those who spend their wealth to\\n\\t\\t\\tshow off to the people, believing neither in Allah nor in the\\n\\t\\t\\tLast Day. In fact the one who chooses Shaitan as his companion\\n\\t\\t\\thas chosen a very evil companion!"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "39",
    "Text": "What harm would they have suffered if they had believed in Allah\\n\\t\\t\\tand the Last Day and spent in charity out of what Allah had given\\n\\t\\t\\tthem? Allah Knows them all."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "40",
    "Text": "Rest assured that Allah does not wrong anyone even by an atom's\\n\\t\\t\\tweight. If someone does a good deed He increases it many fold and\\n\\t\\t\\talso gives an extra great reward on His own."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "41",
    "Text": "Just imagine how they will feel when We shall bring a witness\\n\\t\\t\\tfrom every nation and call upon you , O Muhammad, to testify\\n\\t\\t\\tagainst them?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "42",
    "Text": "On that Day (the Day of Judgement) those who rejected faith and\\n\\t\\t\\tdisobeyed the Rasool will wish that they were levelled with\\n\\t\\t\\tearth; for they will not be able to hide a single word from\\n\\t\\t\\tAllah!"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "43",
    "Text": "O believers! Do not offer your Salah when you are drunk until you\\n\\t\\t\\tknow what you are saying; nor after seminal emission, except when\\n\\t\\t\\tyou are travelling, unless you wash your whole body. If you are\\n\\t\\t\\tsick, or on a journey, or one of you has used the toilet, or has\\n\\t\\t\\thad contact with women (sexual relation with wives) and can find\\n\\t\\t\\tno water, then make Tayammum: take some clean earth and rub your\\n\\t\\t\\tfaces and hands with it. Allah is Lenient, Forgiving."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "44",
    "Text": "Have you not considered the case of those to whom a portion of\\n\\t\\t\\tthe Book was given? They purchased error for themselves and wish\\n\\t\\t\\tto see you lose the Right Way."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "45",
    "Text": "Allah knows your enemies very well. Sufficient is Allah to\\n\\t\\t\\tprotect you, and Sufficient is Allah to help you."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "46",
    "Text": "Among the Jews there are some who take the words out of their\\n\\t\\t\\tcontext and utter them with a twist of their tongues to slander\\n\\t\\t\\tthe true Deen (faith) and say: \"We hear and we disobey;\" and\\n\\t\\t\\t\"Hear, may you (O Muhammad) hear nothing!\" And \"Ra'ina\" (an\\n\\t\\t\\tambiguous word meaning: \"listen, may you become deaf,\" or \"our\\n\\t\\t\\tshepherd,\" or \"in judeo-Arabic language conveying the sense of\\n\\t\\t\\t\"our evil one\"). If only they had said: \"We hear and we obey;\"\\n\\t\\t\\tand \"Hear us;\" and \"Unzurna (\"look upon us,\" or \" pay attention\\n\\t\\t\\tto us\"): it would have been better for them and more proper. Due\\n\\t\\t\\tto all this Allah has cursed them for their unbelief. In fact\\n\\t\\t\\twith the exception of a few, they have no faith."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "47",
    "Text": "O people of the Book (Jews and Christians)! Believe in what We\\n\\t\\t\\thave now revealed (The Qur'an), confirming your own scriptures,\\n\\t\\t\\tbefore We obliterate your faces and turn them backward, or lay\\n\\t\\t\\tOur curse on you as We laid Our curse on the Sabbath-breakers:\\n\\t\\t\\tand remember that Allah's command is always executed."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "48",
    "Text": "Surely Allah does not forgive shirk (associating any partner with\\n\\t\\t\\tHim); and may forgive sins other than that if He so pleases. This\\n\\t\\t\\tis because one who commits shirk with Allah, does indeed invent a\\n\\t\\t\\tgreat sinful lie."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "49",
    "Text": "Have you not seen those who speak very highly of their own purity\\n\\t\\t\\teven though they are committing shirk. In fact, Allah purifies\\n\\t\\t\\twhom He wishes. If the mushrikin are not purified no injustice,\\n\\t\\t\\teven equal to the thread of a date-stone, is being done to them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "50",
    "Text": "See how they invent a lie against Allah, and this in itself is\\n\\t\\t\\tenough to show their manifest sin."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "51",
    "Text": "Have you not seen those who were given a portion of the Book?\\n\\t\\t\\tThey believe in superstition and Taghut (forces of Shaitan) and\\n\\t\\t\\tsay about the unbelievers that they are better guided to the\\n\\t\\t\\tRight Way than the believers!"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "52",
    "Text": "Those are the ones whom Allah has cursed, and the one who is\\n\\t\\t\\tcursed by Allah can find no helper."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "53",
    "Text": "Do they have a share in the kingdom? If they had any share they\\n\\t\\t\\twould have not given other people equal to a speck on a\\n\\t\\t\\tdate-stone."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "54",
    "Text": "Or do they envy other people because Allah has given them from\\n\\t\\t\\tHis grace? If so, let them know that We did give the Book and\\n\\t\\t\\tWisdom to the descendants of Ibrahim (Abraham), and blessed them\\n\\t\\t\\twith a great kingdom."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "55",
    "Text": "But some of them believed in it and some turned away. Sufficient\\n\\t\\t\\tis hell to burn those who turned away."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "56",
    "Text": "Those who rejected Our revelations will soon be thrown into the\\n\\t\\t\\tFire. No sooner will their skins be burnt out than We shall\\n\\t\\t\\treplace their skins, so that they may taste the real torment.\\n\\t\\t\\tAllah is Mighty, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "57",
    "Text": "As for those who believe and do righteous deeds, We shall admit\\n\\t\\t\\tthem to gardens beneath which rivers flow wherein they will live\\n\\t\\t\\tfor ever. Therein they will have chaste spouses, and We shall\\n\\t\\t\\tprovide them with cool thick shade."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "58",
    "Text": "Allah commands you to give back the trusts to their rightful\\n\\t\\t\\towners, and when you judge between people, judge with fairness.\\n\\t\\t\\tSurely, excellent is the counsel which Allah gives you. Allah is\\n\\t\\t\\tHe who hears and observes all."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "59",
    "Text": "O believers! Obey Allah, obey the Rasool and those charged with\\n\\t\\t\\tauthority among you. Should you have a dispute in anything, refer\\n\\t\\t\\tit to Allah and His Rasool, if you truly believe in Allah and the\\n\\t\\t\\tLast Day. This course of action will be better and more suitable."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "60",
    "Text": "Have you not seen those who claim that they believe in what has\\n\\t\\t\\tbeen revealed to you and other prophets before you? Yet they\\n\\t\\t\\tdesire that the judgment (in their disputes) be made by Taghut\\n\\t\\t\\t(forces of Shaitan) though they were commanded to reject them,\\n\\t\\t\\tand Shaitan's wish is to lead them far astray into deep error."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "61",
    "Text": "When it is said to them: \"Come to be judged by the Rasool in\\n\\t\\t\\taccordance with what Allah has revealed, \" you see that the\\n\\t\\t\\thypocrites show their utmost hesitation in coming to you."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "62",
    "Text": "But see how they behave when they get into trouble as a\\n\\t\\t\\tconsequence of their own doings? They come to you swearing by\\n\\t\\t\\tAllah that they desired nothing but to promote good and bring\\n\\t\\t\\tabout a reconciliation."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "63",
    "Text": "Allah knows what really is in their hearts; therefore, neglect\\n\\t\\t\\ttheir attitude, admonish them, and speak to them effectual words\\n\\t\\t\\twhich may go deep into their hearts."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "64",
    "Text": "We did not send any Rasool but to be obeyed by Allah's leave. If\\n\\t\\t\\tthey would have come to you when they had wronged themselves to\\n\\t\\t\\tseek Allah's forgiveness and if the Rasool had also asked Allah's\\n\\t\\t\\tforgiveness for them, they would have found Allah Forgiving,\\n\\t\\t\\tMerciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "65",
    "Text": "Nay! O Muhammad - by your Rabb - they will never be true\\n\\t\\t\\tbelievers until they accept you as a judge in their disputes,\\n\\t\\t\\tthen they do not find any resentment in their hearts against your\\n\\t\\t\\tverdicts and accept them with complete submission."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "66",
    "Text": "If We had commanded them to sacrifice their lives or to leave\\n\\t\\t\\ttheir homes, very few of them would have done it. Yet, if they\\n\\t\\t\\twould have done what they were commanded to do, it would have\\n\\t\\t\\tbeen better for them; not only would their faith have been\\n\\t\\t\\tstrengthened,"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "67",
    "Text": "but We would have given them an extra great reward on Our own"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "68",
    "Text": "and also guided them to the Right Way."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "69",
    "Text": "Whosoever obeys Allah and the Rasool will be in the company of\\n\\t\\t\\tthose whom Allah has blessed - the Prophets, the truthful, the\\n\\t\\t\\tmartyrs, and the righteous: What excellent companions they will\\n\\t\\t\\tbe!"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "70",
    "Text": "This is the real grace from Allah and sufficient is Allah's\\n\\t\\t\\tinfinite knowledge."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "71",
    "Text": "O believers! Prepare yourselves for encounter, then advance in\\n\\t\\t\\tdetachments or all together as the occasion may require."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "72",
    "Text": "There will be someone among you who will surely lag behind, so\\n\\t\\t\\tthat if you face any calamity, he will say: \"Allah has been\\n\\t\\t\\tgracious to me that I did not accompany them.\""
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "73",
    "Text": "But if you are blessed with grace from Allah, he will say, as if\\n\\t\\t\\tthere was no friendship between you and him: \"I wish I had been\\n\\t\\t\\twith them; I could have attained a mighty good fortune!\""
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "74",
    "Text": "Let it be known that only those people should fight in the cause\\n\\t\\t\\tof Allah who are willing to exchange the life of this world for\\n\\t\\t\\tthe Hereafter; and whoever fights for the cause of Allah, whether\\n\\t\\t\\the dies or is victorious, will soon be granted a mighty reward."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "75",
    "Text": "And what reason do you have not to fight in the cause of Allah,\\n\\t\\t\\tto rescue the helpless oppressed old men, women, and children who\\n\\t\\t\\tare crying: \"Our Rabb! Deliver us from this town whose people are\\n\\t\\t\\toppressors; send us a protector by Your grace and send us a\\n\\t\\t\\thelper from Your presence?\""
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "76",
    "Text": "Those who are believers fight in the cause of Allah and those who\\n\\t\\t\\tare unbelievers fight in the cause of Taghut (forces of Shaitan):\\n\\t\\t\\tso fight against the helpers of Shaitan; surely, Shaitan's crafty\\n\\t\\t\\tschemes are very weak."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "77",
    "Text": "Have you not seen those who were told to restrain their hands\\n\\t\\t\\tfrom fighting, establish Salah (regular prayers) and pay Zakah\\n\\t\\t\\t(regular charity). Now when at length they are commanded to\\n\\t\\t\\tfight, lo! A group of them fear people as they should have feared\\n\\t\\t\\tAllah, or even more than that, and say: \"Our Rabb! Why have You\\n\\t\\t\\tordered us to fight? Could you delay its implementation for a\\n\\t\\t\\twhile?\" Tell them: \"The enjoyment of this worldly life is short,\\n\\t\\t\\tlife of the hereafter is much better for those who fear Allah,\\n\\t\\t\\tand rest assured that you will not be wronged equal to the fiber\\n\\t\\t\\tof a date-stone."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "78",
    "Text": "As for death, no matter where you may be, death is going to reach\\n\\t\\t\\tyou even if you are in fortified towers. When such people are\\n\\t\\t\\tblessed with some benefit, they say: \"This is from Allah;\" but if\\n\\t\\t\\tthey suffer a loss, they say: \"this is because of you.\" O\\n\\t\\t\\tMuhammad tell them: \"Everything is from Allah.\" What is the\\n\\t\\t\\tmatter with these people that they do not understand a word?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "79",
    "Text": "Whatever benefit comes to you O people, it is by Allah's grace;\\n\\t\\t\\tand whatever loss you suffer, it is the result of your own\\n\\t\\t\\tdoings. We have sent you, O Muhammad, as a Rasool to mankind.\\n\\t\\t\\tAllah is your All-Sufficient Witness."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "80",
    "Text": "Anyone who obeys the Rasool, in fact, obeys Allah. As for those\\n\\t\\t\\twho pay no heed, they should know that We have not sent you as a\\n\\t\\t\\ttaskmaster over them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "81",
    "Text": "They will say: \"We are at your service!\" Yet when they leave you,\\n\\t\\t\\tsome of them meet together secretly at night to plot against what\\n\\t\\t\\tyou have said. Allah notes down all their plots. Therefore, leave\\n\\t\\t\\tthem alone and put your trust in Allah. Allah is your all\\n\\t\\t\\tsufficient trustee."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "82",
    "Text": "Why don't they research the Qur'an? Don't they realize that if it\\n\\t\\t\\twas from someone other than Allah, they would find many\\n\\t\\t\\tdiscrepancies in it."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "83",
    "Text": "Whenever they hear news of peace or of danger, they spread it\\n\\t\\t\\tquickly; but if they would report it to the Rasool and to the\\n\\t\\t\\tresponsible people in the community, it would come to the\\n\\t\\t\\tknowledge of those who could draw the right conclusions. If it\\n\\t\\t\\thad not been for Allah's grace and mercy, all of you with the\\n\\t\\t\\texception of a few, would have followed Shaitan."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "84",
    "Text": "Therefore, O Muhammad, fight; in the path of Allah, you are\\n\\t\\t\\taccountable for no one except for yourself. Urge the believers to\\n\\t\\t\\tfight, it may be that Allah will overthrow the might of the\\n\\t\\t\\tunbelievers, for Allah is the strongest in might and severe in\\n\\t\\t\\tpunishment."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "85",
    "Text": "Anyone who intercedes for a good cause shall have a share in it,\\n\\t\\t\\tand anyone who intercedes for an evil cause shall also get a\\n\\t\\t\\tshare in its burden. Allah has control over everything."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "86",
    "Text": "When anyone greets you in a courteous manner, let your greetings\\n\\t\\t\\tbe better than his - or at least return the same. Allah keeps\\n\\t\\t\\taccount of everything."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "87",
    "Text": "Allah! There is no god besides Him. He will certainly gather you\\n\\t\\t\\tall together on the Day of Resurrection; there is no doubt in it,\\n\\t\\t\\tand who can be more truthful in his words than Allah?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "88",
    "Text": "What is the matter with you, why are you divided into two groups\\n\\t\\t\\tconcerning the hypocrites, while Allah has cast them off on\\n\\t\\t\\taccount of their misdeeds? Do you wish to guide those whom Allah\\n\\t\\t\\thas confounded? Whomever Allah has confounded you cannot find a\\n\\t\\t\\tway for them to be guided."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "89",
    "Text": "Their real wish is to see that you become a disbeliever, as they\\n\\t\\t\\tthemselves have disbelieved, so that you may become exactly like\\n\\t\\t\\tthem. So you should not take friends from their ranks unless they\\n\\t\\t\\timmigrate in the way of Allah; and if they do not, seize them and\\n\\t\\t\\tkill them wherever you find them, and do not take any of them as\\n\\t\\t\\tprotectors or helpers."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "90",
    "Text": "The exception to this is for those who take refuge with your\\n\\t\\t\\tallies or come over to you because their hearts restrain them\\n\\t\\t\\tboth from fighting against you and from fighting against their\\n\\t\\t\\town people. If Allah had wanted, He would have given them power\\n\\t\\t\\tover you and they might easily have fought against you;\\n\\t\\t\\ttherefore, if they withdraw from you and cease their hostility\\n\\t\\t\\tand offer you peace, in that case Allah has not granted you\\n\\t\\t\\tpermission to fight against them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "91",
    "Text": "You will find other hypocrites who wish to be safe from you as\\n\\t\\t\\twell as from their own people; but who would plunge into mischief\\n\\t\\t\\twhenever they get an opportunity. Therefore if they do not keep\\n\\t\\t\\tdistance from you and neither offer you peace, nor cease their\\n\\t\\t\\thostilities against you, you may seize them and kill them\\n\\t\\t\\twherever you find them, against such people We give you absolute\\n\\t\\t\\tauthority."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "92",
    "Text": "It is not befitting for a believer to kill a believer except by\\n\\t\\t\\taccident, and whoever accidently kills a believer, he is\\n\\t\\t\\tcommanded to free a believing slave and pay bloodwit to the\\n\\t\\t\\tfamily of the victim, unless they forgo it as a charity. If the\\n\\t\\t\\tvictim is from a hostile nation, then the freeing of a believing\\n\\t\\t\\tslave is enough, but if he belonged to a nation with whom you\\n\\t\\t\\thave a treaty, then bloodwit must be paid to his family along\\n\\t\\t\\twith the freeing of a believing slave. Those who do not have the\\n\\t\\t\\tmeans (bloodwit and or a slave) must fast two consecutive months:\\n\\t\\t\\ta method of repentance provided by Allah. Allah is the\\n\\t\\t\\tKnowledgeable, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "93",
    "Text": "Whoever kills a believer intentionally, his punishment is hell to\\n\\t\\t\\tlive therein forever. He shall incur the wrath of Allah, Who will\\n\\t\\t\\tlay His curse on him and prepare for him a woeful punishment."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "94",
    "Text": "O believers! When you struggle in the way of Allah, investigate\\n\\t\\t\\tcarefully, and do not say to anyone who offers you a salutation:\\n\\t\\t\\t\"You are not a believer\" in order to seek worldly gain by this.\\n\\t\\t\\tAllah has abundant spoils for you. Remember that you yourselves\\n\\t\\t\\twere in the same condition before, Allah has conferred His favors\\n\\t\\t\\ton you. Therefore, make a thorough investigation before\\n\\t\\t\\tconsidering someone an unbeliever. Allah is well aware of all\\n\\t\\t\\tyour actions."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "95",
    "Text": "Those believers who stay at home - having no physical disability\\n\\t\\t\\t- are not equal to those who make Jihad (struggle) in the cause\\n\\t\\t\\tof Allah with their wealth and their persons. Allah has granted a\\n\\t\\t\\thigher rank to those who make Jihad with their wealth and their\\n\\t\\t\\tpersons than to those who stay at home. Though Allah has promised\\n\\t\\t\\ta good reward for all, Allah has prepared a much richer reward\\n\\t\\t\\tfor those who make Jihad for Him than for those who stay at home"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "96",
    "Text": "- they have special higher ranks, forgiveness and mercy. Allah is\\n\\t\\t\\tForgiving, Merciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "97",
    "Text": "When the angels of death cause those people to die who have\\n\\t\\t\\twronged their souls, they ask: \"What was your condition?\" They\\n\\t\\t\\treply: \"We were oppressed in the earth.\" The angels say: \"Was not\\n\\t\\t\\tthe earth of Allah spacious enough for you to emigrate and go\\n\\t\\t\\tsomewhere else?\" Hell will be their abode and it is a very evil\\n\\t\\t\\trefuge!"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "98",
    "Text": "However, those helpless men, women and children who have neither\\n\\t\\t\\tthe means to migrate nor strength to escape,"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "99",
    "Text": "Allah may pardon them. Allah is the Pardoning, Forgiving."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "100",
    "Text": "He who emigrates in the path of Allah shall find numerous places\\n\\t\\t\\tof refuge in the Earth and abundant resources. He who leaves his\\n\\t\\t\\thome to migrate for Allah and His Rasool and dies on the way, his\\n\\t\\t\\treward becomes due and sure with Allah. Allah is Forgiving,\\n\\t\\t\\tMerciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "101",
    "Text": "When you travel in the earth, there is no blame on you if you\\n\\t\\t\\tshorten your prayers, especially when you fear that the\\n\\t\\t\\tunbelievers may attack you, since the unbelievers are your open\\n\\t\\t\\tenemies."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "102",
    "Text": "When you, O Muhammad, are with them, leading their Salah (prayer\\n\\t\\t\\tin the state of war), let one party of them stand up to pray with\\n\\t\\t\\tyou, armed with their weapons. After they finish their\\n\\t\\t\\tprostrations, let them withdraw to the rear and let the other\\n\\t\\t\\tparty who have not yet prayed come forward to pray with you; and\\n\\t\\t\\tlet them also be on their guard, armed with their weapons. The\\n\\t\\t\\tunbelievers wish to see you neglect your arms and your baggage,\\n\\t\\t\\tso that they could suddenly attack to overpower you all in one\\n\\t\\t\\tstroke. However, there is no blame on you if you lay aside your\\n\\t\\t\\tarms because of heavy rain or because you are sick, but you\\n\\t\\t\\tshould still be on your guard. Allah has prepared a humiliating\\n\\t\\t\\tpunishment for the unbelievers."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "103",
    "Text": "When you finish your Salah (prayers) remember Allah whether you\\n\\t\\t\\tare standing, sitting or reclining; then as soon as you are safe\\n\\t\\t\\t(out of danger) establish regular Salah in full. Surely Salah are\\n\\t\\t\\tmade obligatory for the believers at their prescribed times."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "104",
    "Text": "Do not show weakness in following up the enemy; if you are\\n\\t\\t\\tsuffering hardships they too are suffering similar hardships;\\n\\t\\t\\tmoreover, you have hope to receive reward from Allah while they\\n\\t\\t\\thave none. Allah is the Knowledgeable, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "105",
    "Text": "We have revealed to you the Book with the Truth so that you may\\n\\t\\t\\tjudge between people in accordance with the Right Way which Allah\\n\\t\\t\\thas shown you, so be not an advocate for those who betray trust;"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "106",
    "Text": "seek Allah's forgiveness, surely Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "107",
    "Text": "Do not plead on behalf of those who betray their own souls; Allah\\n\\t\\t\\tdoes not love the treacherous, sinful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "108",
    "Text": "They might be able to hide their crimes from people, but they\\n\\t\\t\\tcannot hide from Allah. He is with them even when they plot by\\n\\t\\t\\tnight in words that He cannot approve. Allah encompasses all\\n\\t\\t\\ttheir actions."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "109",
    "Text": "You may plead for them in this life, but who will plead for them\\n\\t\\t\\twith Allah on the Day of Resurrection? Or who will be their\\n\\t\\t\\tdefender?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "110",
    "Text": "If anyone does evil or wrongs his own soul and then seeks Allah's\\n\\t\\t\\tforgiveness, he will find Allah Forgiving, Merciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "111",
    "Text": "Whoever commits a sin, he commits it against his own soul. Allah\\n\\t\\t\\tis knowledgeable, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "112",
    "Text": "But if anyone commits a crime and charges an innocent person with\\n\\t\\t\\tit (a Muslim from the tribe of Bani Dhafar committed theft and\\n\\t\\t\\tput the blame on a Jew who was innocent), he indeed shall bear\\n\\t\\t\\tthe guilt of slander and a flagrant sin."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "113",
    "Text": "If Allah's grace and mercy were not with you to save you from\\n\\t\\t\\ttheir mischief, a group of them (tribe of Bani Dhafar) was\\n\\t\\t\\tdetermined to lead you astray. They led astray none but\\n\\t\\t\\tthemselves, and they cannot do you any harm. Allah has revealed\\n\\t\\t\\tto you the Book and wisdom and taught you what you did not know;\\n\\t\\t\\tgreat indeed is the grace of Allah upon you."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "114",
    "Text": "There is no virtue in most of the secret counsels of the people;\\n\\t\\t\\tit is, however, good if one secretly enjoins charity, kindness,\\n\\t\\t\\tand reconciliation among people; the one who does this to please\\n\\t\\t\\tAllah, will soon be given a mighty reward."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "115",
    "Text": "Anyone who is hostile to the Rasool after guidance has been\\n\\t\\t\\tplainly conveyed to him and follows a path other than that of the\\n\\t\\t\\tbelievers, We shall leave him in the path he has chosen and cast\\n\\t\\t\\thim into Hell; which is an evil refuge."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "116",
    "Text": "Surely Allah will never forgive the one who commits the sin of\\n\\t\\t\\tshirk and may forgive anyone else if He so pleases. One who\\n\\t\\t\\tcommits shirk has indeed gone far away from the Right Way."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "117",
    "Text": "The pagans call upon female deities beside Him; by doing so they\\n\\t\\t\\tcall nothing but the rebellious Shaitan"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "118",
    "Text": "on whom Allah has laid His curse; and who has said: \"I will take\\n\\t\\t\\ta good portion of Your servants and mislead them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "119",
    "Text": "I will create in them false desires and order them to slit the\\n\\t\\t\\tears of cattle. I will order them to tamper with Allah's\\n\\t\\t\\tcreation.\" Therefore, whoever takes Shaitan as a guardian instead\\n\\t\\t\\tof Allah, has indeed become a clear-cut loser."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "120",
    "Text": "Shaitan makes promises to stir up in them false desires; but\\n\\t\\t\\tShaitan makes them promises only to deceive them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "121",
    "Text": "The home of such people who follow him will be hell, from where\\n\\t\\t\\tthey will find no way to escape."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "122",
    "Text": "As for those who have faith and do righteous deeds, We shall soon\\n\\t\\t\\tadmit them to gardens beneath which rivers flow to live therein\\n\\t\\t\\tforever. This is the promise of Allah, true indeed, and who can\\n\\t\\t\\tbe truer in his words than Allah?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "123",
    "Text": "The final result will neither be in accordance with your desires\\n\\t\\t\\tnor in accordance with the desires of the People of the Book. He\\n\\t\\t\\twho does evil will be requited with evil: he will find no\\n\\t\\t\\tprotector or helper besides Allah."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "124",
    "Text": "But the one who do righteous deeds, whether a male or a female -\\n\\t\\t\\tprovided he or she is a believer - shall enter paradise and will\\n\\t\\t\\tnot be harmed a speck."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "125",
    "Text": "Who has a better Deen (way of life or religion) than the one who\\n\\t\\t\\tis a Muslim (submits himself entirely) to Allah, does good to\\n\\t\\t\\tothers and follows the faith of Ibrahim (Abraham) the upright\\n\\t\\t\\tone, whom Allah chose to be His friend?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "126",
    "Text": "To Allah belongs all that is in the heavens and in the earth.\\n\\t\\t\\tAllah encompasses everything."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "127",
    "Text": "They ask your decision concerning the women. Tell them: Allah\\n\\t\\t\\tmakes His decision concerning them and along with it reminds you\\n\\t\\t\\tabout those commandments, recited to you in the Book (The\\n\\t\\t\\tQur'an), relating to orphan girls to whom you do not give their\\n\\t\\t\\tlawful rights and to whom you do not wish to marry. He also\\n\\t\\t\\treminds you regarding the helpless children, and to stand firm\\n\\t\\t\\tfor justice to orphans. Whatever good you do, Allah surely knows\\n\\t\\t\\tit."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "128",
    "Text": "If a women fears cruelty or desertion from her husband, there is\\n\\t\\t\\tno blame if both of them agree to reconcile by means of a\\n\\t\\t\\tcompromise, after all compromise is better. Human souls are prone\\n\\t\\t\\tto narrow- mindedness, but if you show generosity and fear Allah\\n\\t\\t\\tin your dealings, surely Allah is well aware of your actions."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "129",
    "Text": "It is not possible for you to do justice between your wives even\\n\\t\\t\\tif you wish to do so; therefore, in order to comply with Divine\\n\\t\\t\\tLaw, do not lean towards one wife to the extent that you leave\\n\\t\\t\\tthe other hanging in air. If you work out a friendly\\n\\t\\t\\tunderstanding and fear Allah, Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "130",
    "Text": "If the spouses do separate, Allah will make each one independent\\n\\t\\t\\tof the other out of His own limitless resources, Allah is\\n\\t\\t\\tAmplegiving, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "131",
    "Text": "To Allah belongs all that is in the heavens and in the earth. We\\n\\t\\t\\tdirected the People of the Book before you and now direct you\\n\\t\\t\\talso, to fear Allah in your dealings with one another. But if you\\n\\t\\t\\tdisobey ( you will do so at your own risk) for Allah owns all\\n\\t\\t\\tthat is in the Heavens and in the Earth and Allah is\\n\\t\\t\\tSelf-sufficient, Praiseworthy."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "132",
    "Text": "Yes! To Allah belongs all that is in the heavens and in the earth\\n\\t\\t\\tand Allah is sufficient as a Protector."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "133",
    "Text": "If He wanted He could destroy you all, O mankind, and bring\\n\\t\\t\\tothers. Allah has the power to do so."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "134",
    "Text": "Anyone who desires the reward of this world should know that\\n\\t\\t\\tAllah possesses the rewards of both, this world and the\\n\\t\\t\\thereafter. Allah hears all and sees all."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "135",
    "Text": "O believers! Stand firm for justice and bear true witness for the\\n\\t\\t\\tsake of Allah, even though it be against yourselves, your parents\\n\\t\\t\\tor your relatives. It does not matter whether the party is rich\\n\\t\\t\\tor poor - Allah is well wisher of both. So let not your selfish\\n\\t\\t\\tdesires swerve you from justice. If you distort your testimony or\\n\\t\\t\\tdecline to give it, then you should remember that Allah is fully\\n\\t\\t\\taware of your actions."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "136",
    "Text": "O believers! Believe in Allah, His Rasool, the Book which He has\\n\\t\\t\\trevealed to His Rasool, and every Book which He previously\\n\\t\\t\\trevealed. He who denies Allah, His angels, His Books, His Rasools\\n\\t\\t\\tand the Last Day has gone far astray."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "137",
    "Text": "As for those who accept the faith then renounce it, who again\\n\\t\\t\\tembrace it and again deny it and go on increasing in unbelief;\\n\\t\\t\\tAllah will neither forgive them nor guide them to the Right Way."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "138",
    "Text": "Announce the painful punishment to those hypocrites"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "139",
    "Text": "who choose the unbelievers to be their protectors rather than\\n\\t\\t\\tbelievers. Are they seeking honor in being with them? Whereas all\\n\\t\\t\\thonor belongs to Allah Alone."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "140",
    "Text": "He has already revealed for you in the Book that when you hear\\n\\t\\t\\tAllah's revelations being denied or ridiculed by people, you must\\n\\t\\t\\tnot sit with them unless they change the topic of their talk,\\n\\t\\t\\totherwise you shall be considered guilty like them. Rest assured\\n\\t\\t\\tthat Allah is going to gather the hypocrites and the unbelievers\\n\\t\\t\\tall together in hell."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "141",
    "Text": "These hypocrites are the ones who wait and watch to see how the\\n\\t\\t\\twind blows. If Allah grants you a victory, they say: \"Were we not\\n\\t\\t\\twith you?\" And if the unbelievers gain success, they will say to\\n\\t\\t\\tthem: \"Were we not strong enough to fight against you? Yet we\\n\\t\\t\\tprotected you from the believers (Muslims).\" Allah will judge\\n\\t\\t\\tbetween you and them on the Day of Resurrection. Allah will not\\n\\t\\t\\tleave the way for the unbelievers to triumph over the believers."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "142",
    "Text": "Surely the hypocrites try to deceive Allah, whereas, in fact, He\\n\\t\\t\\thas reverted their deception to them; when they stand up for\\n\\t\\t\\tSalah they stand reluctantly, merely to be seen by people and do\\n\\t\\t\\tnot remember Allah but a little"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "143",
    "Text": "- wavering between belief and disbelief, belonging neither to\\n\\t\\t\\tthis nor to that. Whom Allah let go astray, you cannot find a Way\\n\\t\\t\\tfor him."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "144",
    "Text": "O believers! Do not choose unbelievers to be your protecting\\n\\t\\t\\tfriends instead of believers. Would you like to furnish Allah a\\n\\t\\t\\tclear proof against yourselves?"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "145",
    "Text": "Surely the hypocrites will be in the lowest depth of hellfire;\\n\\t\\t\\tand you will not find any helper for them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "146",
    "Text": "However, those who repent and mend their ways, hold fast to\\n\\t\\t\\tAllah, and become sincere in their devotion to Allah - they are\\n\\t\\t\\tconsidered to be with the believers. Allah will soon grant the\\n\\t\\t\\tbelievers a mighty reward."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "147",
    "Text": "Why should Allah punish you if you are grateful and a true\\n\\t\\t\\tbeliever? Allah knows the grateful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "148",
    "Text": "Allah does not like evil words to be uttered except by someone\\n\\t\\t\\twho is truly wronged. Allah hears all and knows all."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "149",
    "Text": "If you do good deeds openly or in private or forgive an evil,\\n\\t\\t\\tthen surely Allah is Pardoning, Powerful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "150",
    "Text": "Those who deny Allah and his Rasool and those who intend to draw\\n\\t\\t\\ta line between Allah and His Rasools saying: \"We believe in some,\\n\\t\\t\\tand reject the rest\" - desiring to take a middle way between\\n\\t\\t\\tbelief and unbelief"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "151",
    "Text": "- these are the real unbelievers and We have prepared for such\\n\\t\\t\\tunbelievers a humiliating punishment."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "152",
    "Text": "As for those who believe in Allah and His Rasools and do not\\n\\t\\t\\tdiscriminate between any of them, We shall soon give them their\\n\\t\\t\\tdue rewards. Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "153",
    "Text": "The People of the Book ask you to bring down for them a book from\\n\\t\\t\\tHeaven. From Musa they demanded an even harder miracle than that.\\n\\t\\t\\tThey asked him: \"Make us see Allah with our own eyes.\" As a\\n\\t\\t\\tresult of their wickedness, the thunderbolt overtook them. Then\\n\\t\\t\\tthey took the calf for worship after receiving clear revelations.\\n\\t\\t\\tAfter all that, We still pardoned them and gave to Musa clear\\n\\t\\t\\tauthority."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "154",
    "Text": "We lifted the mount of Tur over them and took the covenant from\\n\\t\\t\\tthem that they will obey Our commandments. On another occasion We\\n\\t\\t\\tcommanded them to enter the gates prostrating in humility. Yet on\\n\\t\\t\\tanother occasion We commanded them not to transgress in the\\n\\t\\t\\tmatter of the Sabbath and took a solemn commitment from them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "155",
    "Text": "After all this, they still broke their covenant, rejected the\\n\\t\\t\\tRevelation of Allah, killed the Prophets unjustly. Yet they say:\\n\\t\\t\\t\"Our hearts are in secure wrappings which have preserved Allah's\\n\\t\\t\\tWord; we need no more.\" Nay! It is Allah who has sealed their\\n\\t\\t\\thearts on account of their disbelief. They have no faith except a\\n\\t\\t\\tlittle."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "156",
    "Text": "They went in their unbelief to such an extent that they uttered\\n\\t\\t\\tterrible slander against Maryam (Mary)."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "157",
    "Text": "They even say: \"We have killed the Messiah, Isa (Jesus), son of\\n\\t\\t\\tMaryam, the Rasool of Allah.\" Whereas in fact, neither did they\\n\\t\\t\\tkill him nor did they crucify him but they thought they did\\n\\t\\t\\tbecause the matter was made dubious for them. Those who differ\\n\\t\\t\\ttherein are only in doubt. They have no real knowledge, they\\n\\t\\t\\tfollow nothing but merely a conjecture, certainly they did not\\n\\t\\t\\tkill him (Jesus)."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "158",
    "Text": "Nay! The fact is that Allah took him up to Himself. Allah is\\n\\t\\t\\tMighty, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "159",
    "Text": "There is none of the People of the Book but will believe in this\\n\\t\\t\\tfact before his death; and on the Day of Resurrection Jesus will\\n\\t\\t\\tbear witness against them."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "160",
    "Text": "Because of the iniquity of those who call themselves Jews, their\\n\\t\\t\\thindering of many people from the way of Allah ,"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "161",
    "Text": "taking of usury in spite of its prohibition, and cheating others\\n\\t\\t\\tof their properties - We made many wholesome things unlawful\\n\\t\\t\\twhich were formerly lawful for them. We have prepared a painful\\n\\t\\t\\tpunishment for those among them who reject faith."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "162",
    "Text": "However, those among them who are well-grounded in knowledge and\\n\\t\\t\\tthose who truly believe in what has been revealed to you, O\\n\\t\\t\\tMuhammad, and other Prophets before you, establishes Salah, pays\\n\\t\\t\\tZakah, and believes in Allah and the Last Day, will soon be given\\n\\t\\t\\ta mighty reward."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "163",
    "Text": "O Muhammad, We have sent revelations to you just as We sent to\\n\\t\\t\\tNuh (Noah) and the Prophets who came after him; We also sent\\n\\t\\t\\trevelations to Ibrahim (Abraham), Isma`il (Ishmael), Ishaq\\n\\t\\t\\t(Isaac), Ya'qoob (Jacob), his descendants, Isa (Jesus), Ayub\\n\\t\\t\\t(Job), Yunus (Jonah), Haroon (Aaron) and Sulaiman (Solomon), and\\n\\t\\t\\tto Dawood (David) We gave the Psalms."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "164",
    "Text": "Revelations were also sent to those Rasools whom We have already\\n\\t\\t\\tmentioned to you and to those whose name We have not mentioned;\\n\\t\\t\\tto Musa Allah spoke directly."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "165",
    "Text": "All these Rasools conveyed good news to mankind and admonished\\n\\t\\t\\tthem so that, after conveying the message through the Rasools,\\n\\t\\t\\tpeople should have no excuse to plead against Allah. Allah is\\n\\t\\t\\tMighty, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "166",
    "Text": "People may or may not believe it, but Allah bears witness that\\n\\t\\t\\twhat He has sent to you, O Muhammad, He has sent with His own\\n\\t\\t\\tKnowledge and so do the angels; though only Allah's testimony is\\n\\t\\t\\tsufficient."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "167",
    "Text": "Those who reject faith and hinder others from the Way of Allah,\\n\\t\\t\\thave indeed strayed far away from the Path."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "168",
    "Text": "Surely Allah will neither forgive those who reject faith and act\\n\\t\\t\\tunjustly; nor guide them to any way"
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "169",
    "Text": "other than the path of hell, wherein they will live forever and\\n\\t\\t\\tthis is easy for Allah."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "170",
    "Text": "O mankind! The Rasool has brought you the Truth from your Rabb,\\n\\t\\t\\tso believe in it, it is for your own benefit. If you disbelieve,\\n\\t\\t\\tthen you should know that to Allah belongs all that is in the\\n\\t\\t\\theavens and in the earth. Allah is the Knowledgeable, Wise."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "171",
    "Text": "O People of the Book! Do not transgress the limits of your\\n\\t\\t\\treligion. Speak nothing but the Truth about Allah. The Messiah,\\n\\t\\t\\tIsa (Jesus) the son of Maryam (Mary) was no more than a Rasool of\\n\\t\\t\\tAllah and His Word \"Be\" which He bestowed on Maryam and a Spirit\\n\\t\\t\\tfrom Him which took the shape of a child in her womb. So believe\\n\\t\\t\\tin Allah and His Rasools and do not say: \"Trinity\".\" Stop saying\\n\\t\\t\\tthat, it is better for you. Allah is only One Deity. He is far\\n\\t\\t\\tabove from the need of having a son! To Him belongs all that is\\n\\t\\t\\tin the heavens and in the Earth. Allah Alone is sufficient for\\n\\t\\t\\tprotection."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "172",
    "Text": "The Messiah (Jesus) never disdained to be the worshipper of Allah\\n\\t\\t\\tnor do the angels who are nearest to Allah. Whosoever disdains\\n\\t\\t\\tHis worship and is arrogant will be brought before Him all\\n\\t\\t\\ttogether."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "173",
    "Text": "As for those who have faith and do righteous deeds, He will pay\\n\\t\\t\\tthem their due compensation and give them more on His own from\\n\\t\\t\\tHis grace, but He will inflict painful punishment on those who\\n\\t\\t\\tare disdainful and arrogant, and they will find none (of those on\\n\\t\\t\\twhom they rely) to protect or help them besides Allah."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "174",
    "Text": "O mankind! There has come to you convincing proof of Truth from\\n\\t\\t\\tyour Rabb. We have sent to you a glorious light (Al-Qur'an) that\\n\\t\\t\\tshows you the Right Way clearly."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "175",
    "Text": "Now those who believe in Allah and hold fast to Him, Allah will\\n\\t\\t\\tsoon cover them with His mercy and grace and will show them the\\n\\t\\t\\tRight Way to Himself."
  },
  {
    "SurahNumber": "4",
    "AyahNumber": "176",
    "Text": "They ask you for a legal decision relating to inheritance in the\\n\\t\\t\\tcase of a childless person. Say: Allah gives you His decision\\n\\t\\t\\tabout those who leave no descendants or ascendants as heirs. If a\\n\\t\\t\\tman dies childless and leaves behind a sister, she shall inherit\\n\\t\\t\\tone-half of his estate. If a woman dies childless, her brother\\n\\t\\t\\twill inherit all of her estate. If the childless person leaves\\n\\t\\t\\tbehind two sisters, they both shall inherit two-third of his\\n\\t\\t\\testate; but if he leaves more than two brothers and sisters, the\\n\\t\\t\\tshare of each male shall be equal to that of two females. Thus\\n\\t\\t\\tAllah makes His commandments clear to you lest you go astray.\\n\\t\\t\\tAllah has perfect knowledge of everything."
  }
]
