[
  {
    "SurahNumber": "66",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "There are several essentially conflicting - and,\\n\\t\\t\\t\\ttherefore, in their aggregate, not very trustworthy -\\n\\t\\t\\t\\treports as to the exact reason or reasons why, at some\\n\\t\\t\\t\\ttime during the second half of the Medina period, the\\n\\t\\t\\t\\tProphet declared on oath that for one month he would have\\n\\t\\t\\t\\tno intercourse with any of his wives. Still, while the\\n\\t\\t\\t\\texact reason cannot be established with certainty, it is\\n\\t\\t\\t\\tsufficiently clear from the above-mentioned ahadith that\\n\\t\\t\\t\\tthis emotional, temporary renunciation of marital life\\n\\t\\t\\t\\twas caused by a display of mutual jealousy among some of\\n\\t\\t\\t\\tthe Prophet's wives. In any case, the purport of the\\n\\t\\t\\t\\tabove Qur'anic allusion to this incident is not\\n\\t\\t\\t\\tbiographical but, rather, intended to bring out a moral\\n\\t\\t\\t\\tlesson applicable to all human situations: namely, the\\n\\t\\t\\t\\tinadmissibility of regarding as forbidden (haram)\\n\\t\\t\\t\\tanything that God has made lawful (halal), even if such\\n\\t\\t\\t\\tan attitude happens to be motivated by the desire to\\n\\t\\t\\t\\tplease another person or other persons. Apart from this,\\n\\t\\t\\t\\tit serves to illustrate the fact - repeatedly stressed in\\n\\t\\t\\t\\tthe Qur'an - that the Prophet was but a human being, and\\n\\t\\t\\t\\ttherefore subject to human emotions and even liable to\\n\\t\\t\\t\\tcommit an occasional mistake (which in his case, however,\\n\\t\\t\\t\\twas invariably pointed out to him, and thus rectified,\\n\\t\\t\\t\\tthrough divine revelation)."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "See  2:224  and the corresponding note [212], which shows\\n\\t\\t\\t\\tthat in certain circumstances an oath should be broken\\n\\t\\t\\t\\tand then atoned for: hence the above phrase, \"God has\\n\\t\\t\\t\\tenjoined upon you the breaking and expiation\" (with the\\n\\t\\t\\t\\tterm tahillah comprising both these concepts)."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "See surah {2}, note [21]."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "Lit., \"he turned aside from [or \"avoided\"] some of it\".\\n\\t\\t\\t\\tThere is no reliable Tradition as to the subject of that\\n\\t\\t\\t\\tconfidential information. Some of the early commentators,\\n\\t\\t\\t\\thowever, connect it with the Prophet's veiled prediction\\n\\t\\t\\t\\tthat Abu Bakr and 'Umar ibn al-Khattab would succeed him\\n\\t\\t\\t\\tas leaders of the Muslim community; the recipient of the\\n\\t\\t\\t\\tinformation is said to have been Hafsah, the daughter of\\n\\t\\t\\t\\t'Umar, and the one to whom she disclosed it, 'A'ishah,\\n\\t\\t\\t\\tthe daughter of Abu Bakr (Baghawi, on the authority of\\n\\t\\t\\t\\tIbn'Abbas and Al-Kalbi; also Zamakhshari). If this\\n\\t\\t\\t\\tinterpretation is correct, it would explain why the\\n\\t\\t\\t\\tProphet \"acquainted [others] with some of it and passed\\n\\t\\t\\t\\tover some of it\": for, once his confidential prediction\\n\\t\\t\\t\\thad been divulged, he saw no point in withholding it any\\n\\t\\t\\t\\tlonger from the community; nevertheless, he alluded to it\\n\\t\\t\\t\\tin deliberately vague terms - possibly in order not to\\n\\t\\t\\t\\tgive to the succession of Abu Bakr and 'Umar the\\n\\t\\t\\t\\tappearance of an \"apostolic sanction\" but to leave it,\\n\\t\\t\\t\\trather, to a free decision of the community in pursuance\\n\\t\\t\\t\\tof the Qur'anic principle amruhum shura baynahum (see\\n\\t\\t\\t\\t 42:38 )."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "3",
    "NoteID": "5",
    "Body": "I.e., that she had broken the Prophet's confidence."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "4",
    "NoteID": "6",
    "Body": "Although in the sequence the Prophet is referred to in\\n\\t\\t\\t\\tthe third person, it is obvious that it is he who is\\n\\t\\t\\t\\tcommanded through revelation to speak thus to his wives\\n\\t\\t\\t\\tHafsah and 'A'ishah (see note [4]); hence my above\\n\\t\\t\\t\\tinterpolation."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "4",
    "NoteID": "7",
    "Body": "Referring to Hafsah, who betrayed the Prophet's\\n\\t\\t\\t\\tconfidence, and to 'A'ishah, who by listening contributed\\n\\t\\t\\t\\tto this betrayal (see note [4] above)."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "4",
    "NoteID": "8",
    "Body": "Lit., \"after that\", i.e., in consequence of the fact that\\n\\t\\t\\t\\tGod Himself protects him."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "5",
    "NoteID": "9",
    "Body": "For this rendering of the expression sa'ihat, see note\\n\\t\\t\\t\\t[147] on  9:112 , where the same expression occurs in the\\n\\t\\t\\t\\tmasculine gender relating to both men and women."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "5",
    "NoteID": "10",
    "Body": "I.e., like the actual wives of the Prophet, one of whom\\n\\t\\t\\t\\t('A'ishah) was a virgin when she married him, one (Zaynab\\n\\t\\t\\t\\tbint Jahsh) had been divorced, while the others were\\n\\t\\t\\t\\twidows. This allusion, together with the fact that the\\n\\t\\t\\t\\tProphet did not divorce any of his wives, as well as the\\n\\t\\t\\t\\tpurely hypothetical formulation of this passage, shows\\n\\t\\t\\t\\tthat it is meant to be an indirect admonition to the\\n\\t\\t\\t\\tProphet's wives, who, despite their occasional\\n\\t\\t\\t\\tshortcomings - unavoidable in human beings - did possess\\n\\t\\t\\t\\tthe virtues referred to above. On a wider plane, it seems\\n\\t\\t\\t\\tto be an admonition to all believers, men and women\\n\\t\\t\\t\\talike: and this explains the subsequent change in the\\n\\t\\t\\t\\tdiscourse."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "6",
    "NoteID": "11",
    "Body": "Lit., \"your families\" or \"your people\"; however, the term\\n\\t\\t\\t\\tahl denotes also people who share one's race, religion,\\n\\t\\t\\t\\toccupation, etc., as well as \"dependents\" in the most\\n\\t\\t\\t\\tcomprehensive sense of this word (Jawhari, Raghib; also\\n\\t\\t\\t\\tMughni)."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "6",
    "NoteID": "12",
    "Body": "See surah {2}, note [16]."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "6",
    "NoteID": "13",
    "Body": "See  74:27  ff. and the corresponding notes, particularly\\n\\t\\t\\t\\tnotes [15] and [16], in which I have tried to explain the\\n\\t\\t\\t\\tallegorical meaning of that passage."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "6",
    "NoteID": "14",
    "Body": "I.e., these angelic powers are subject to the God-willed\\n\\t\\t\\t\\tlaw of cause and effect which dominates the realm of the\\n\\t\\t\\t\\tspirit no less than the world of matter."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "7",
    "NoteID": "15",
    "Body": "I.e., \"do not try to rationalise your deliberate denial\\n\\t\\t\\t\\tof the truth\" - the element of conscious intent being\\n\\t\\t\\t\\timplied in the past-tense phrase alladhina kafaru (see\\n\\t\\t\\t\\tnote [6] on  2:6 )."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "8",
    "NoteID": "16",
    "Body": "Sc., \"since no human being, however imbued with faith,\\n\\t\\t\\t\\tcan ever remain entirely free from faults and\\n\\t\\t\\t\\ttemptations\"."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "8",
    "NoteID": "17",
    "Body": "The implication is that He will not only \"not shame\" the\\n\\t\\t\\t\\tProphet and his followers but will, on the contrary,\\n\\t\\t\\t\\texalt them: an idiomatic turn of phrase similar to\\n\\t\\t\\t\\tsayings like \"I shall let you know something that will\\n\\t\\t\\t\\tnot be to your detriment\" - i.e., \"something that will\\n\\t\\t\\t\\tbenefit you\"."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "8",
    "NoteID": "18",
    "Body": "Cf.  57:12  and the corresponding note [12]."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "8",
    "NoteID": "19",
    "Body": "Lit., \"Complete for us our light\", i.e.' by making it\\n\\t\\t\\t\\tpermanent."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "9",
    "NoteID": "20",
    "Body": "See note [101] on  9:73 , which is identical with the\\n\\t\\t\\t\\tabove verse."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "10",
    "NoteID": "21",
    "Body": "Lit., \"and both betrayed them\", i.e., their respective\\n\\t\\t\\t\\thusbands. The story of Lot's wife and her spiritual\\n\\t\\t\\t\\tbetrayal of her husband is mentioned in the Qur'an in\\n\\t\\t\\t\\tseveral places; see, in particular, note [66] on  7:83 \\n\\t\\t\\t\\tand note [113] on  11:81 . As regards Noah's wife, the\\n\\t\\t\\t\\tabove is the only explicit reference to her having\\n\\t\\t\\t\\tbetrayed her husband; it would seem, however, that the\\n\\t\\t\\t\\tqualification of \"those on whom [God's] sentence has\\n\\t\\t\\t\\talready been passed\" in  11:40  applies to her no less\\n\\t\\t\\t\\tthan to her son (whose story appears in {11:42-47})."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "10",
    "NoteID": "22",
    "Body": "The \"parable\" (mathal) of these two women implies,\\n\\t\\t\\t\\tfirstly, that even the most intimate relationship with a\\n\\t\\t\\t\\ttruly righteous person - even though he be a prophet -\\n\\t\\t\\t\\tcannot save an unrepentant sinner from the consequences\\n\\t\\t\\t\\tof his sin; and, secondly, that a true believer must cut\\n\\t\\t\\t\\thimself off from any association with \"those who are bent\\n\\t\\t\\t\\ton denying the truth\" even if they happen to be those\\n\\t\\t\\t\\tnearest and dearest to him (cf.{ll:46})."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "11",
    "NoteID": "23",
    "Body": "Cf. {28:8-9}."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "12",
    "NoteID": "24",
    "Body": "I.e., a descendant of the House of 'Imran (cf. the last\\n\\t\\t\\t\\tthird of note [22] on  3:33 )."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "12",
    "NoteID": "25",
    "Body": "I.e., into the as yet unborn child (Razi, thus explaining\\n\\t\\t\\t\\tthe pronoun in fihi). For an explanation of the\\n\\t\\t\\t\\tmuch-misunderstood allegorical phrase, \"We breathed of\\n\\t\\t\\t\\tOur spirit into it\", see note [87] on  21:91 ."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "12",
    "NoteID": "26",
    "Body": "For the meaning of God's \"words\" (kalimat), see note [28]\\n\\t\\t\\t\\ton  3:39 ."
  }
]
