[
  {
    "SurahNumber": "48",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Namely, the moral victory achieved by the Truce of\\n\\t\\t\\t\\tHudaybiyyah, which opened the doors to the subsequent\\n\\t\\t\\t\\ttriumph of Islam in Arabia (see introductory note, which\\n\\t\\t\\t\\texplains many allusions to this historic event found in\\n\\t\\t\\t\\tthe subsequent verses)."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "Lit., \"so that God might forgive thee all that is past of\\n\\t\\t\\t\\tthy sins and all that is yet to come\" - thus indicating\\n\\t\\t\\t\\telliptically that freedom from faults is an exclusive\\n\\t\\t\\t\\tprerogative of God, and that every human being, however\\n\\t\\t\\t\\texalted, is bound to err on occasion."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "Sc., \"to a fulfilment of thy mission\", which the Truce of\\n\\t\\t\\t\\tHudaybiyyah clearly presaged."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "I.e., endowed them, although they were few and\\n\\t\\t\\t\\tpractically unarmed, with calm courage in the face of the\\n\\t\\t\\t\\tmuch more powerful forces of the enemy."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "Lit., \"so that they might add faith to their faith,\\n\\t\\t\\t\\tseeing that God's are . .\", etc. Since the latter is\\n\\t\\t\\t\\tobviously a parenthetic clause, I have transposed it in\\n\\t\\t\\t\\tmy rendering in order to make the meaning clear."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "I.e., who deny His existence or man's responsibility to\\n\\t\\t\\t\\tHim, or offend against the concept of His oneness."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "Lit., \"at morn and evening\", i.e., at all times."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "10",
    "NoteID": "8",
    "Body": "This refers, in the first instance, to the pledge of\\n\\t\\t\\t\\tfaith and allegiance (bay'at ar-ridwan) which the Muslims\\n\\t\\t\\t\\tassembled at Hudaybiyyah gave to the Prophet (see\\n\\t\\t\\t\\tintroductory note). Beyond this historical allusion,\\n\\t\\t\\t\\thowever, the above sentence implies that as one's faith\\n\\t\\t\\t\\tin God's message-bearer is to all intents and purposes\\n\\t\\t\\t\\tsynonymous with a declaration of faith in God Himself, so\\n\\t\\t\\t\\tdoes one's willingness to obey God necessarily imply a\\n\\t\\t\\t\\twillingness to obey His message-bearer.The phrase \"the\\n\\t\\t\\t\\thand of God is over their hands\" does not merely allude\\n\\t\\t\\t\\tto the hand-clasp with which all of the Prophet's\\n\\t\\t\\t\\tfollowers affirmed their allegiance to him, but is also a\\n\\t\\t\\t\\tmetaphor for His being a witness to their pledge."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "Lit., \"who were left behind\": i.e., the bedouin belonging\\n\\t\\t\\t\\tto the tribes of Ghifar, Muzaynah, Juhaynah, Ashja',\\n\\t\\t\\t\\tAslam and Dhayl, who, although allied with the Prophet\\n\\t\\t\\t\\tand outwardly professing Islam, refused under various\\n\\t\\t\\t\\tpretexts to accompany him on his march to Mecca (which\\n\\t\\t\\t\\tresulted in the Truce of Hudaybiyyah), since they were\\n\\t\\t\\t\\tconvinced that the Meccans would give battle and destroy\\n\\t\\t\\t\\tthe unarmed Muslims (Zamakhshari). The excuses mentioned\\n\\t\\t\\t\\tin the sequence were made after the Prophet's and his\\n\\t\\t\\t\\tfollowers' successful return to Medina; hence the future\\n\\t\\t\\t\\ttense, sayaqul."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "11",
    "NoteID": "10",
    "Body": "Implying that the excuses which they would proffer would\\n\\t\\t\\t\\tbe purely hypocritical."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "11",
    "NoteID": "11",
    "Body": "Lit., \"has anything in his power [that could be obtained]\\n\\t\\t\\t\\tin your behalf from God\": a construction which, in order\\n\\t\\t\\t\\tto become meaningful in translation, necessitates a\\n\\t\\t\\t\\tparaphrase."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "12",
    "NoteID": "12",
    "Body": "Implying that the real sympathies of those bedouin were\\n\\t\\t\\t\\twith the pagan Quraysh rather than with the Muslims."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "14",
    "NoteID": "13",
    "Body": "Implying that He may forgive even the most hardened\\n\\t\\t\\t\\tsinners if they truly repent and mend their ways: an\\n\\t\\t\\t\\tallusion to what the Prophet was to say according to\\n\\t\\t\\t\\tverse {16}."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "15",
    "NoteID": "14",
    "Body": "Lit., \"set forth to take booty\": i.e., any expedition\\n\\t\\t\\t\\tother than against the Quraysh of Mecca, with whom the\\n\\t\\t\\t\\tProphet had just concluded a truce. This is generally\\n\\t\\t\\t\\ttaken as an allusion to the forthcoming war against the\\n\\t\\t\\t\\tJews of Khaybar (in the year 7 H.), but the meaning may\\n\\t\\t\\t\\twell be more general."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "15",
    "NoteID": "15",
    "Body": "Evidently a reference to  8:1  - \"All spoils of war\\n\\t\\t\\t\\tbelong to God and the Apostle\" - which, as pointed out in\\n\\t\\t\\t\\tnote [1] on that verse, implies that no individual\\n\\t\\t\\t\\twarrior can have any claim to the booty obtained in war.\\n\\t\\t\\t\\tMoreover, fighting for the sake of booty contravenes the\\n\\t\\t\\t\\tvery principle of a \"war in God's cause\", which may be\\n\\t\\t\\t\\twaged only in defence of faith or liberty (cf. surah {2},\\n\\t\\t\\t\\tnote [167]), \"until there is no more oppression and all\\n\\t\\t\\t\\tworship is devoted to God alone\" (see  2:193  and the\\n\\t\\t\\t\\tcorresponding note [170]). It is to these principles,\\n\\t\\t\\t\\ttoo, that the Prophet's anticipated answer mentioned in\\n\\t\\t\\t\\tthe sequence, refers."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "15",
    "NoteID": "16",
    "Body": "I.e., in the first verse of Al-Anfal, which was revealed\\n\\t\\t\\t\\tin the year 2 H. (see preceding note)."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "16",
    "NoteID": "17",
    "Body": "This is evidently a prophecy relating to the future wars\\n\\t\\t\\t\\tagainst Byzantium and Persia."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "16",
    "NoteID": "18",
    "Body": "Lit., \"before\", i.e., at the time of the expedition which\\n\\t\\t\\t\\tresulted in the Truce of Hudaybiyyah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "17",
    "NoteID": "19",
    "Body": "These three categories circumscribe metonymically all\\n\\t\\t\\t\\tkinds of infirmities or disabilities which may prevent a\\n\\t\\t\\t\\tperson from actively participating in a war in God's\\n\\t\\t\\t\\tcause."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "17",
    "NoteID": "20",
    "Body": "This latter applies, by obvious implication, to such as\\n\\t\\t\\t\\tare unable to  participate in the fighting physically,\\n\\t\\t\\t\\tbut are in their hearts with those who fight."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "18",
    "NoteID": "21",
    "Body": "I.e., at Hudaybiyyah (see introductory note)."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "18",
    "NoteID": "22",
    "Body": "Most of the commentators assume that this relates to the\\n\\t\\t\\t\\tconquest of Khaybar, which took place a few months after\\n\\t\\t\\t\\tthe Truce of Hudaybiyyah. It is probable, however, that\\n\\t\\t\\t\\tthe implication is much wider than that - namely, a\\n\\t\\t\\t\\tprophecy of the almost bloodless conquest of Mecca in the\\n\\t\\t\\t\\tyear 8 H., the victorious establishment of Islam in all\\n\\t\\t\\t\\tof Arabia and, finally, the tremendous expansion of the\\n\\t\\t\\t\\tIslamic Commonwealth under the Prophet's immediate\\n\\t\\t\\t\\tsuccessors."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "20",
    "NoteID": "23",
    "Body": "Sc., \"of what is to come to you in the hereafter\"."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "20",
    "NoteID": "24",
    "Body": "Thus Razi."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "21",
    "NoteID": "25",
    "Body": "I.e., the achievement of final bliss in the life to come."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "22",
    "NoteID": "26",
    "Body": "This divine promise was fulfilled in the unbroken\\n\\t\\t\\t\\tsequence of Muslim victories after the Truce of\\n\\t\\t\\t\\tHudaybiyyah, ultimately leading to the establishment of\\n\\t\\t\\t\\tan empire which extended from the Atlantic Ocean to the\\n\\t\\t\\t\\tconfines of China. - For the conditional nature of the\\n\\t\\t\\t\\tabove promise, see note [82] on  3:111 ."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "23",
    "NoteID": "27",
    "Body": "This reference to \"God's way\" (sunnat Allah) is twofold:\\n\\t\\t\\t\\ton the one hand, \"you are bound to rise high if you are\\n\\t\\t\\t\\t[truly] believers\" ( 3:139 ), and, on the other, \"God\\n\\t\\t\\t\\tdoes not change men's condition unless they change their\\n\\t\\t\\t\\tinner selves\" ( 13:11 ), in both the positive and\\n\\t\\t\\t\\tnegative connotations of the concept of \"change\"."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "24",
    "NoteID": "28",
    "Body": "Shortly before the Truce of Hudaybiyyah was concluded, a\\n\\t\\t\\t\\tdetachment of Quraysh warriors - variously estimated at\\n\\t\\t\\t\\tbetween thirty and eighty men - attacked the Prophet's\\n\\t\\t\\t\\tcamp, but his practically unarmed followers overcame them\\n\\t\\t\\t\\tand took them prisoner; after the signing of the treaty\\n\\t\\t\\t\\tthe Prophet released them unharmed (Muslim, Nasa'i,\\n\\t\\t\\t\\tTabari)."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "29",
    "Body": "This interpolation is based on Razi's explanation of the\\n\\t\\t\\t\\tconnection between this and the preceding verse."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "30",
    "Body": "I.e., the Ka'bah, which, until the year 7 H., the Muslims\\n\\t\\t\\t\\twere not allowed to approach."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "31",
    "Body": "See surah {2}, note [175]."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "32",
    "Body": "I.e., killed. After the Prophet's and his followers'\\n\\t\\t\\t\\texodus to Medina, a number of Meccans both men and women\\n\\t\\t\\t\\t- had embraced Islam, but had been prevented by the pagan\\n\\t\\t\\t\\tQuraysh from emigrating (Tabari, Zamakhshari). Their\\n\\t\\t\\t\\tidentities were not generally known to the Muslims of\\n\\t\\t\\t\\tMedina."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "33",
    "Body": "Thus Zamakhshari, supported by Razi, Ibn Kathir, and\\n\\t\\t\\t\\tother commentators."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "34",
    "Body": "I.e., so that the believers might be spared, and that in\\n\\t\\t\\t\\ttime many a pagan Meccan might embrace Islam, as actually\\n\\t\\t\\t\\thappened."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "35",
    "Body": "Lit., \"had they been separated from one another\": i.e.,\\n\\t\\t\\t\\tthe believers and the pagans among the Meccans. In its\\n\\t\\t\\t\\twider sense, the above implies that man never really\\n\\t\\t\\t\\tknows whether another human being deserves God's grace or\\n\\t\\t\\t\\tcondemnation."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "26",
    "NoteID": "36",
    "Body": "Although this reference to the \"stubborn disdain\"\\n\\t\\t\\t\\t(hamiyyah) on the part of the pagan Quraysh may have been\\n\\t\\t\\t\\tcharacteristic of their over-all attitude towards the\\n\\t\\t\\t\\tProphet and his mission, it is probable - as Zamakhshari\\n\\t\\t\\t\\tpoints out - that its special mention here relates to an\\n\\t\\t\\t\\tincident which occurred at Hudaybiyyah during the truce\\n\\t\\t\\t\\tnegotations between the Prophet and the emissary of the\\n\\t\\t\\t\\tMeccans, Suhayl ibn 'Amr. The Prophet began to dictate to\\n\\t\\t\\t\\t'Al' ibn Ab' Talib the text of the proposed agreement:\\n\\t\\t\\t\\t\"Write down, 'In the name of God, the Most Gracious, the\\n\\t\\t\\t\\tDispenser of Grace'\"; but Suhayl interrupted him and\\n\\t\\t\\t\\tsaid: \"We have never heard of [the expression] 'the Most\\n\\t\\t\\t\\tGracious'; write down only what we know.\" Whereupon the\\n\\t\\t\\t\\tProphet said to 'Ali: \"Write, then, 'In Thy name, O\\n\\t\\t\\t\\tGod'.\" 'Ali wrote as he was told; and the Prophet\\n\\t\\t\\t\\tcontinued: \"This is what has been agreed upon between\\n\\t\\t\\t\\tMuhammad, God's Apostle, and the people of Mecca . . .\".\\n\\t\\t\\t\\tBut Suhayl interrupted again: \"If thou wert [really] an\\n\\t\\t\\t\\tapostle of God, [this would be an admission on our part\\n\\t\\t\\t\\tthat] we have been doing wrong to thee; write, therefore,\\n\\t\\t\\t\\tas we understand it.\" And so the Prophet dictated to Ali:\\n\\t\\t\\t\\t\"Write thus: 'This is what has been agreed upon between\\n\\t\\t\\t\\tMuhammad, the son of Abd Allah, son of Abd al-Muttalib,\\n\\t\\t\\t\\tand the people of Mecca...'.\" (This story is recorded in\\n\\t\\t\\t\\tmany versions, among others by Nasa'i, Ibn Hanbal and\\n\\t\\t\\t\\tTabari.)"
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "26",
    "NoteID": "37",
    "Body": "Lit., \"the word of God-consciousness\" (kalimat at-taqwa):\\n\\t\\t\\t\\timplying that their consciousness of God and of His\\n\\t\\t\\t\\tall-pervading power enabled them to bear the \"stubborn\\n\\t\\t\\t\\tdisdain\" of their enemies with inner calm and serenity."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "27",
    "NoteID": "38",
    "Body": "Shortly before the expedition which ended at Hudaybiyyah,\\n\\t\\t\\t\\tthe Prophet had a dream in which he saw himself and his\\n\\t\\t\\t\\tfollowers entering Mecca as pilgrims. This dream-vision\\n\\t\\t\\t\\twas destined to be fulfilled a year later, in 7 H., when\\n\\t\\t\\t\\tthe Muslims were able to perform their first peaceful\\n\\t\\t\\t\\tpilgrimage to the Holy City."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "27",
    "NoteID": "39",
    "Body": "Male pilgrims usually shave or (which is the meaning of\\n\\t\\t\\t\\tthe conjunctive wa in this context) cut their hair short\\n\\t\\t\\t\\tbefore assuming the pilgrim's garb (ihram), for it is not\\n\\t\\t\\t\\tpermitted to do so while in the state of pilgrimage. A\\n\\t\\t\\t\\trepetition of the same act marks the completion of the\\n\\t\\t\\t\\tpilgrimage (cf.  2:196 )."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "27",
    "NoteID": "40",
    "Body": "Namely, the future."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "27",
    "NoteID": "41",
    "Body": "See note [22]."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "28",
    "NoteID": "42",
    "Body": "Sc., \"through the revelations which He grants to His\\n\\t\\t\\t\\tprophets\". See also  3:19  - \"the only [true] religion in\\n\\t\\t\\t\\tthe sight of God is [man's] self-surrender unto Him\":\\n\\t\\t\\t\\tfrom which it follows that any religion (in the widest\\n\\t\\t\\t\\tsense of this term) which is not based on the above\\n\\t\\t\\t\\tprinciple is, eo ipso, false."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "43",
    "Body": "This composite gives, I believe, the full meaning of the\\n\\t\\t\\t\\tterm ashidda' (sing. shadid) in the above context."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "44",
    "Body": "Lit., \"among themselves\". Cf.  5:54  - \"humble towards\\n\\t\\t\\t\\tthe believers, proud towards all who deny the truth\"."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "45",
    "Body": "The infinitive noun sulud (\"prostration\") stands here for\\n\\t\\t\\t\\tthe innermost consummation of faith, while its \"trace\"\\n\\t\\t\\t\\tsignifies the spiritual reflection of that faith in the\\n\\t\\t\\t\\tbeliever's manner of life and even in his outward aspect.\\n\\t\\t\\t\\tSince the \"face\" is the most expressive part of man's\\n\\t\\t\\t\\tpersonality, it is often used in the Qur'an in the sense\\n\\t\\t\\t\\tof one's \"whole being\"."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "46",
    "Body": "Regarding the significance of the term Injil (\"Gospel\")\\n\\t\\t\\t\\tas used in the Qur'an, see surah {3}, note [4]."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "47",
    "Body": "Lit., \"infuse with wrath\"."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "48",
    "Body": "Whereas most of the classical commentators understand the\\n\\t\\t\\t\\tabove sentence as alluding to believers in general, Razi\\n\\t\\t\\t\\trelates the pronoun minhum (\"of them\" or \"among them\")\\n\\t\\t\\t\\texplicitly to the deniers of the truth spoken of in the\\n\\t\\t\\t\\tpreceding sentence - i.e., to those of them who might yet\\n\\t\\t\\t\\tattain to faith and thus achieve God's forgiveness: a\\n\\t\\t\\t\\tpromise which was fulfilled within a few years after the\\n\\t\\t\\t\\trevelation of this verse, inasmuch as most of the Arabian\\n\\t\\t\\t\\tenemies of the Prophet embraced Islam, and many of them\\n\\t\\t\\t\\tbecame its torchbearers. But in a wider sense, this\\n\\t\\t\\t\\tdivine promise remains open until Resurrection Day\\n\\t\\t\\t\\t(Tabari), relating to everybody, at all times and in all\\n\\t\\t\\t\\tcultural environments, who might yet attain to the truth\\n\\t\\t\\t\\tand live up to it."
  }
]
