[	
	{
		"Name": "Rumaisa - 07 Oct 2015",
		"Testimonial": "This site has helped me tremendously in learning the tafsir and achieving high scores in my Quran exam."
	},
	{
		"Name": "Ramish Ali - 24 Jul 2015",
		"Testimonial": "This is really a helpful post. During my practice I met a lot of young people who require this kind of assistance. Definitely this website is a wonderful medium to educate youngsters on Qura'n thoughts. Thank you."
	},
	{
		"Name": "AlQuran2015 - 08 Jul 2015",
		"Testimonial": "This site is just amazing and a very powerful tool for someone looking to \"brush up\" on the fundamentals of Qura'n and someone interested in a structured or even a solid knowledge on the same. I applaud the engineers, content providers, UI/UX designers, and those who do the research to keep the site relevant, fresh, and engaging. Jaz Jak Allah Khairun"
	},
	{
		"Name": "hameed321",
		"Testimonial": "This is wonderful and very useful. May this endeavor become a great success."
	},
	{
		"Name": "Muhammad Sheraz",
		"Testimonial": "MashaAllah! The website is very nice and informative. I pray may Allah bestow you and your efforts with special blessings and favors in both worlds."
	},
	{
		"Name": "Muhammad Azaan",
		"Testimonial": "Great website, I found a lot of great historical information as well as teachings from Quran. I really appreciate you each and everyone who come up with idea of Ayah theme. Ayah theme is one of the best tools that I use everyday; it's really helpful to understand the Quran. Great Job!"
	},
	{
		"Name": "Madiha Khalid",
		"Testimonial": "It is just a perfect effort for Muslim brothers and sisters. I was just searching for the feature of repeating specific verses for the sake of memorization and I found it on this Quranic site. May Allah grant you much more than your effort (ameen) Jazak Allah khair."
	},
	{
		"Name": "sehe b",
		"Testimonial": "MashAllah this is an amazing resource. Ironically, I was discussing with some friends a few weeks back about a 'database' where everyone could go to find hadith and Quran Ayahs for references; and how it would greatly help people explain things. SubhanAllah I stumbled onto this site and am very impressed. I pray that this site grows quickly."
	},
	{
		"Name": "Muniupa",
		"Testimonial": "Assalamualaikum, I Love this website! It'll be my new best friend until I become a Hafizah insha'Allah"
	},
	{
		"Name": "Islam Teachings",
		"Testimonial": "MashaAllah. Very Helpful Site.. Lots of Information. Loved it... JazaakAllah Khair."
	},
	{
		"Name": "Sefat E Kaniz",
		"Testimonial": "Thank you so much Alim team for running such a wonderful website to learn ad recite Quran. Now I have learned a lot about Quran and Hadith and started teaching my brothers and sisters the thoughts from Quran and Hadith."
	},
	{
		"Name": "Mohammad Parvez Kamal",
		"Testimonial": "While surfing Islamic sites for learning of Quran I could find alim.org. Subahan Allah what a useful website! It is not only for Quran learning but also Hadith and other related area."
	},
	{
		"Name": "Hussain M. Mir, Ontario, Canada",
		"Testimonial": "I recently used the Alim program for my computer and since then I am amazed at the wealth of information available at one's finger tips."
	},
	{
		"Name": "A.S. Hashim M.D., Rockville, MD",
		"Testimonial": "The Alim is outstanding and unique. It is also comprehensive and easy to use. The manual of instructions is one of the best and clearest I have ever read. Many thanks for a job well done."
	},
	{
		"Name": "Ali Campbell, New York, N.Y.",
		"Testimonial": "Congratulations on a remarkable achievement."
	},
	{
		"Name": "Samir Said, Jubail, Saudi Arabia",
		"Testimonial": "I thank you for the wonderful service you have rendered to the Muslim society and may Allah help you in your future endeavours as well."
	},
	{
		"Name": "Hanif Aziz, Brossard, Canada",
		"Testimonial": "I have tried the Alim software on my computer and found it to be much more than I had expected. I am very pleased with it."
	},
	{
		"Name": "Wali K.A. Muhammad, Trenton, N.J.",
		"Testimonial": "I would like to congratulate you on your courage in undertaking a tremendous task in producing the Alim software. You have done a great service to my Islamic studies. I am very happy over ISL Software's work and will recommend it to all the brothers I know with a computer to purchase this great study lesson software."
	},
	{
		"Name": "Imam Siraj Wahhaj",
		"Testimonial": "Incredible! This is definitely the wave of the future!"
	},
	{
		"Name": "The Minaret Islamic Magazine",
		"Testimonial": "Any mosque, Islamic school, university, organization, library, religious leader, researcher, teacher, or anyone interested in Islam for any reason will find it rewarding to use The Alim."
	},
	{
		"Name": "Dr. Hakim Chisti, noted Muslim Author",
		"Testimonial": "The Alim is by far the most comprehensive and powerful tool for access to Islamic knowledge that has ever been created in the English language. It is a stunning achievement by any standard."
	},
	{
		"Name": "Shoyba Tabassum - 14 Feb 2021",
		"Testimonial": "I am glad reading the tafsir. It has made my understanding to Qur'an easy . I was searching for the best and easy tafsir and my search ended here. Alhamdolillah . Jazakallah khair."
	}

]