[
  {
    "SurahNumber": "76",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Implying, according to all the classical commentators,\\n\\t\\t\\t\\t\"there has indeed been an immensely long [or \"endless\"]\\n\\t\\t\\t\\tspan of time\" - the interrogative particle hal having\\n\\t\\t\\t\\there the positive meaning of qad. However, this meaning\\n\\t\\t\\t\\tcan be brought out equally well by interpolating the word\\n\\t\\t\\t\\t\"not\"."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "Lit., \"a thing mentioned\" or \"mentionable\" - i.e.,\\n\\t\\t\\t\\tnon-existent even as a hypothetical concept. The purport\\n\\t\\t\\t\\tof this statement is a refutation of the blasphemous\\n\\t\\t\\t\\t\"anthropocentric\" world-view, which postulates man as he\\n\\t\\t\\t\\texists - and not any Supreme Being - as the centre and\\n\\t\\t\\t\\tultimate reality of all life."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "Sc., \"with the female ovum\": cf. {86:6-7}."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "I.e., God has not only endowed man with \"hearing and\\n\\t\\t\\t\\tsight\", i.e., with reason and the instinctive ability to\\n\\t\\t\\t\\tdiscern between right and wrong, good and evil (cf.\\n\\t\\t\\t\\t 90:10 ), but He also actively guides him by means of the\\n\\t\\t\\t\\trevelation bestowed on the prophets."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "In this context, the \"denial of the truth\" (kufr)\\n\\t\\t\\t\\tapparently relates to man's deliberate suppression of his\\n\\t\\t\\t\\tinborn cognition of God's existence (cf.  7:172  and the\\n\\t\\t\\t\\tcorresponding note [139]) as well as to his disregard of\\n\\t\\t\\t\\this own instinctive perceptions of good and evil."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "4",
    "NoteID": "6",
    "Body": "Sc., \"of despair\". For the metaphor of \"shackles and\\n\\t\\t\\t\\tchains\" - i.e., the consequence of the sinners' blind\\n\\t\\t\\t\\tsurrender to their own passions and to false values, and\\n\\t\\t\\t\\tthe resulting enslavement of their spirit - see surah\\n\\t\\t\\t\\t{34}, note [44]; also Razi's elaborate comments (quoted\\n\\t\\t\\t\\tin note [7] on {73:12-13}) on this allegory of suffering\\n\\t\\t\\t\\tin the hereafter."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "5",
    "NoteID": "7",
    "Body": "The Lisan al-'Arab gives \"the calyx (kimm) of the grape\\n\\t\\t\\t\\tbefore its flowering\" as the primary significance of\\n\\t\\t\\t\\tkafur; according to other lexicologists (e.g., Taj\\n\\t\\t\\t\\tal-'Arus), it denotes \"the calyx of any flower\"; Jawhari\\n\\t\\t\\t\\tapplies it to the \"spathe of a palm tree\". Hence, this -\\n\\t\\t\\t\\tand not \"camphor\" - is evidently the meaning of kafur in\\n\\t\\t\\t\\tthe above context: an allusion to the sweet, extremely\\n\\t\\t\\t\\tdelicate fragrance of the symbolic \"drink\" of divine\\n\\t\\t\\t\\tknowledge (cf. {83:25-28} and the corresponding notes [8]\\n\\t\\t\\t\\tand [9])."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "6",
    "NoteID": "8",
    "Body": "Lit., \"making [or \"letting\"] it flow...\", etc.: i.e.,\\n\\t\\t\\t\\thaving it always at their disposal."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "7",
    "NoteID": "9",
    "Body": "I.e., the spiritual and social obligations arising from\\n\\t\\t\\t\\ttheir faith."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "8",
    "NoteID": "10",
    "Body": "Or, as in  2:177 , \"however much they themselves may\\n\\t\\t\\t\\tcherish [i.e., \"need\"] it\"; cf. also {90:14-16}. It is to\\n\\t\\t\\t\\tbe noted that in this context the concept of \"giving\\n\\t\\t\\t\\tfood\" comprises every kind of help and care, both\\n\\t\\t\\t\\tmaterial and moral."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "8",
    "NoteID": "11",
    "Body": "The term asir denotes anyone who is a \"captive\" either\\n\\t\\t\\t\\tliterally (e.g., a prisoner) or figuratively, i.e., a\\n\\t\\t\\t\\tcaptive of circumstances which render him helpless; thus,\\n\\t\\t\\t\\tthe Prophet said, \"Thy debtor is thy captive; be,\\n\\t\\t\\t\\ttherefore, truly kind to thy captive\" (Zamakhshari, Razi,\\n\\t\\t\\t\\tet al.). The injunction of kindness towards all who are\\n\\t\\t\\t\\tin need of help - and therefore \"captive\" in one sense or\\n\\t\\t\\t\\tanother - applies to believers and non-believers alike\\n\\t\\t\\t\\t(Tabari, Zamakhshari), and apparently also to animals\\n\\t\\t\\t\\tdependent on man."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "10",
    "NoteID": "12",
    "Body": "Lit., \"we fear our Sustainer\"."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "12",
    "NoteID": "13",
    "Body": "For this allegory, see first half of note [41] on\\n\\t\\t\\t\\t 18:31 ."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "14",
    "NoteID": "14",
    "Body": "Regarding the allegorical implication of the term\\n\\t\\t\\t\\t\"shades\" (zilal), see note [74] on  4:57 . It is to be\\n\\t\\t\\t\\tnoted that the existence of shade presupposes the\\n\\t\\t\\t\\texistence of light (Jawhari), which latter is one of the\\n\\t\\t\\t\\tcharacteristics implicit in the concept of \"paradise\"."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "14",
    "NoteID": "15",
    "Body": "Lit., \"in all humility\"."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "16",
    "NoteID": "16",
    "Body": "I.e., partaking of as much as they may desire."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "18",
    "NoteID": "17",
    "Body": "This is how 'Ali ibn Abi Talib - as quoted by Zamakhshari\\n\\t\\t\\t\\tand Razi - explains the (obviously compound) word\\n\\t\\t\\t\\tsalsabilan, dividing it into its two components, sal\\n\\t\\t\\t\\tsabilan (\"ask [or \"seek\"] the way\"): namely, \"seek thy\\n\\t\\t\\t\\tway to paradise by means of doing righteous deeds\".\\n\\t\\t\\t\\tAlthough Zamakhshari does not quite agree with this\\n\\t\\t\\t\\tinterpretation, it is, in my opinion, very convincing\\n\\t\\t\\t\\tinasmuch as it contains an allusion to the highly\\n\\t\\t\\t\\tallegorical character of the concept of \"paradise\" as a\\n\\t\\t\\t\\tspiritual consequence of one's positive endeavours in\\n\\t\\t\\t\\tthis world. That its delights are not of a material\\n\\t\\t\\t\\tnature is also evident from their varying descriptions -\\n\\t\\t\\t\\ti.e., \"a cup flavoured with ginger\" in verse {17}, and\\n\\t\\t\\t\\t\"flavoured with the calyx of sweet-smelling flowers\" in\\n\\t\\t\\t\\tverse {5}; or \"they will be waited upon with trays and\\n\\t\\t\\t\\tgoblets of gold\" in  43:71 , and \"vessels of silver and\\n\\t\\t\\t\\tgoblets that will [seem to] be crystal - crystal-like,\\n\\t\\t\\t\\t[but] of silver\", in verses {15-16} of this surah; and so\\n\\t\\t\\t\\tforth."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "19",
    "NoteID": "18",
    "Body": "See note [6] on {56:17-18}."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "21",
    "NoteID": "19",
    "Body": "See  18:31  (where \"bracelets of gold\" are mentioned) and\\n\\t\\t\\t\\tthe corresponding note [41]."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "21",
    "NoteID": "20",
    "Body": "Implying that God Himself will slake their spiritual\\n\\t\\t\\t\\tthirst by purifying their inner selves \"of all envy, and\\n\\t\\t\\t\\trancour, and malice, and all that leads to harm, and all\\n\\t\\t\\t\\tthat is base in man's nature\" (Ibn Kathir, quoting 'Ali\\n\\t\\t\\t\\tibn Abi Talib), and by allowing them to \"drink\" of His\\n\\t\\t\\t\\tOwn Light (Razi)."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "23",
    "NoteID": "21",
    "Body": "The gradualness of Qur'anic revelation is implied in the\\n\\t\\t\\t\\tverbal form nazzalna."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "24",
    "NoteID": "22",
    "Body": "This connects with the preceding mention of the life to\\n\\t\\t\\t\\tcome, in which the righteous will meet with bliss, and\\n\\t\\t\\t\\tthe evildoers with suffering."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "25",
    "NoteID": "23",
    "Body": "I.e. His \"attributes\" as they manifest themselves in His\\n\\t\\t\\t\\tcreation - since the human mind can grasp only the fact\\n\\t\\t\\t\\tof His existence and the manifestation of those\\n\\t\\t\\t\\t\"attributes\", but never the \"how\" of His Reality (Razi)."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "26",
    "NoteID": "24",
    "Body": "I.e., at all times of wakefulness."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "26",
    "NoteID": "25",
    "Body": "I.e., \"whenever unhappiness oppresses thee and all seems\\n\\t\\t\\t\\tdark around thee\"."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "28",
    "NoteID": "26",
    "Body": "1.e., endowed their bodies and minds with the ability to\\n\\t\\t\\t\\tenjoy \"this fleeting life\"."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "28",
    "NoteID": "27",
    "Body": "I.e., with other human beings who would have the same\\n\\t\\t\\t\\tpowers of body and mind, but would put them to better\\n\\t\\t\\t\\tuse."
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "30",
    "NoteID": "28",
    "Body": "See note [11] on {81:28-29}. The perplexity of some of\\n\\t\\t\\t\\tthe commentators at the apparent \"contradiction\" between\\n\\t\\t\\t\\tthose two verses - as well as between verses {29-30} of\\n\\t\\t\\t\\tthe present surah - has been caused by their elliptic\\n\\t\\t\\t\\tformulation, which, I believe, is resolved in my\\n\\t\\t\\t\\trendering. In the present instance, in particular, there\\n\\t\\t\\t\\tis a clear connection between the above two verses and\\n\\t\\t\\t\\tverse {3} of this surah: \"We have shown him the way: [and\\n\\t\\t\\t\\tit rests with him to prove himself] either grateful or\\n\\t\\t\\t\\tungrateful\". (Cf. also  74:56 .)"
  },
  {
    "SurahNumber": "76",
    "AyahNumber": "31",
    "NoteID": "29",
    "Body": "Or: \"whomever He wills\" - either of these two\\n\\t\\t\\t\\tformulations being syntactically justified."
  }
]
