[
  {
    "SurahNumber": "35",
    "AyahNumber": "1",
    "Text": "Praise be to Allah, the Creator of the heavens and the earth! Who\\n\\t\\t\\tappoint the angels having two, three and four pairs of wings as\\n\\t\\t\\tHis messengers. He adds to His creation as He pleases; for Allah\\n\\t\\t\\thas power over all things."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "2",
    "Text": "None can withhold the blessings which He bestows on people and\\n\\t\\t\\tnone can award besides Him what He withholds. He is the Mighty,\\n\\t\\t\\tthe Wise."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "3",
    "Text": "O mankind! Call to mind the favors of Allah on you; is there any\\n\\t\\t\\tother creator than Allah who provides for you from the heavens\\n\\t\\t\\tand the earth? There is no god but Him. How then are you being\\n\\t\\t\\tdeceived?"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "4",
    "Text": "O Prophet! If they deny you, so were the Rasools denied before\\n\\t\\t\\tyou. All affairs shall ultimately be presented before Allah."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "5",
    "Text": "O mankind! Certainly the promise of Allah is true, therefore let\\n\\t\\t\\tnot the life of this world deceive you nor let the chief deceiver\\n\\t\\t\\t(Satan) deceive you about Allah."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "6",
    "Text": "Surely Shaitan (Satan) is your enemy: so take him as an enemy. He\\n\\t\\t\\tis inviting his adherents towards his way so that they may become\\n\\t\\t\\tcompanions of the blazing fire."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "7",
    "Text": "Those who disbelieve shall have a terrible punishment, and those\\n\\t\\t\\twho believe and do good deeds shall have forgiveness and a\\n\\t\\t\\tmagnificent reward."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "8",
    "Text": "Can that person be guided whose evil deeds are so fair seeming to\\n\\t\\t\\thim that he considers them good? The fact is that Allah leaves to\\n\\t\\t\\tstray whom He wills and guides to whom He pleases. Therefore, O\\n\\t\\t\\tProphet, let not your soul expire in sorrow on their account.\\n\\t\\t\\tAllah is aware of all their actions."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "9",
    "Text": "It is Allah Who sends forth winds to raise up the clouds, then\\n\\t\\t\\tdrives them to a dead land and therewith revive the earth after\\n\\t\\t\\tits death. Similar will be the resurrection of the dead."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "10",
    "Text": "If anyone is seeking honor, let him know that all honor belongs\\n\\t\\t\\tto Allah Alone. Good words ascend to Him and good deeds are\\n\\t\\t\\texalted by Him. As for those who plan evil deeds, they shall have\\n\\t\\t\\tsevere punishment and their plots will be brought to nothing."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "11",
    "Text": "It is Allah Who created you from dust, then from a sperm-drop,\\n\\t\\t\\tthen He made you pairs. No female conceives or delivers without\\n\\t\\t\\tHis knowledge. No long-lived man grows old or has his life cut\\n\\t\\t\\tshort but is written in a Book; surely all this is easy for\\n\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "12",
    "Text": "The two bodies of water, of which one is sweet and pleasant to\\n\\t\\t\\tdrink and the other is salty and bitter, are not alike. Yet from\\n\\t\\t\\teach kind of water you eat fresh meat and extract ornaments which\\n\\t\\t\\tyou wear; and you see the ships plough their course through them\\n\\t\\t\\tto seek the bounty of Allah, that you may be grateful."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "13",
    "Text": "He causes the night to pass into the day and the day into the\\n\\t\\t\\tnight, and He has made the sun and the moon to serve you; each\\n\\t\\t\\tone follows its course for an appointed term. Such is Allah, your\\n\\t\\t\\tRabb; His is the kingdom; and those to whom you pray besides Him\\n\\t\\t\\tdo not even own a thread of a date-stone."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "14",
    "Text": "If you pray to them they cannot hear your prayers and even if\\n\\t\\t\\tthey could hear you they could not answer you. On the Day of\\n\\t\\t\\tResurrection they will deny your associating them with Allah. O\\n\\t\\t\\tmankind! None can inform you about all this except the One Who is\\n\\t\\t\\tAll-Aware."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "15",
    "Text": "O mankind! It is you who stands in need of Allah, and it is Allah\\n\\t\\t\\tWho is Free of all wants, Worthy of all praise."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "16",
    "Text": "If He wants, He can destroy you and replace you with a new\\n\\t\\t\\tcreation;"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "17",
    "Text": "and this is not at all difficult for Allah."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "18",
    "Text": "No bearer of a burden will bear another's burden, and if a heavy\\n\\t\\t\\tladen person cries out for help, none will come forward to share\\n\\t\\t\\tthe least of his burden, even though he be a close relative. O\\n\\t\\t\\tProphet! You can only admonish those who fear their Rabb - though\\n\\t\\t\\tthey cannot see Him - and establish Salah. He that purifies\\n\\t\\t\\thimself does so for his own good. To Allah is the destination of\\n\\t\\t\\tall."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "19",
    "Text": "The blind and the seeing are not alike;"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "20",
    "Text": "nor the darkness and the Light;"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "21",
    "Text": "nor the shade and the heat;"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "22",
    "Text": "nor the living and the dead. Certainly Allah can make anyone hear\\n\\t\\t\\tif He so wills; but, O Prophet, you cannot make those who are in\\n\\t\\t\\tthe graves hear you."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "23",
    "Text": "You are nothing but a Warner."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "24",
    "Text": "Certainly We have sent you (O Muhammad) with the Truth as a\\n\\t\\t\\tbearer of good news and as a Warner, for there has not been a\\n\\t\\t\\tnation which has not had a Warner."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "25",
    "Text": "If they disbelieve you, know that their predecessors also\\n\\t\\t\\tdisbelieved their Rasools who came to them with clear signs,\\n\\t\\t\\tscriptures and light-giving Book."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "26",
    "Text": "But in the end I seized the disbelievers, and behold, how\\n\\t\\t\\tterrible was My disapproval!"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "27",
    "Text": "Do you not see that Allah sends down rain from the sky with which\\n\\t\\t\\tWe bring forth fruits of various colors? Similarly, in the\\n\\t\\t\\tmountains there are streaks of various shades including white,\\n\\t\\t\\tred, jet-black rocks."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "28",
    "Text": "Likewise men, beasts and cattle have their different colors. In\\n\\t\\t\\tfact, only those among His servants who possess knowledge fear\\n\\t\\t\\tAllah; surely Allah is All-Mighty, All-Forgiving."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "29",
    "Text": "Surely those who recite the Book of Allah, establish Salah, spend\\n\\t\\t\\tout of what We have given them, secretly and openly, may hope for\\n\\t\\t\\timperishable gain."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "30",
    "Text": "That He may pay them back their full reward and give them even\\n\\t\\t\\tmore out of His grace; surely He is Forgiving and Appreciative of\\n\\t\\t\\tHis devotees."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "31",
    "Text": "O Prophet, what We have revealed to you of the Book is the Truth,\\n\\t\\t\\twhich confirms the previous scriptures. Surely, with respect to\\n\\t\\t\\tHis servants, Allah is well Aware and fully Observant."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "32",
    "Text": "We have given the Book as an inheritance to those of Our servants\\n\\t\\t\\t(Muslims) whom We have chosen, among them there are some who\\n\\t\\t\\twrong their own souls, some follow a middle course and some, by\\n\\t\\t\\tAllah's leave, excel in good deeds; which is the supreme virtue."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "33",
    "Text": "They shall enter the gardens of Eden, where they shall be decked\\n\\t\\t\\twith bracelets of gold and pearls; and their dress therein will\\n\\t\\t\\tbe of silk."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "34",
    "Text": "They will say: \"Praise be to Allah Who has removed all sorrow\\n\\t\\t\\tfrom us; Our Rabb is indeed Forgiving and appreciative of His\\n\\t\\t\\tdevotees."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "35",
    "Text": "Who has admitted us to this Eternal Home out of His bounty,\\n\\t\\t\\twherein we neither experience any toil nor sense of any\\n\\t\\t\\tweariness.\""
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "36",
    "Text": "As for the disbelievers, there shall be the fire of hell, no term\\n\\t\\t\\tshall be determined for them so that they could die nor shall its\\n\\t\\t\\tpunishment be ever lightened for them. Thus shall We reward every\\n\\t\\t\\tdisbeliever."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "37",
    "Text": "Therein they shall cry for help: \"Our Rabb! Get us out, from now\\n\\t\\t\\ton we shall do good deeds and shall not repeat the ones we used\\n\\t\\t\\tto do\". The response will be: \"Did we not give you lives long\\n\\t\\t\\tenough so that he who would, could take a warning? Besides,\\n\\t\\t\\tsomeone did come to warn you. Now taste the fruit of your deeds,\\n\\t\\t\\there there is no helper for the wrongdoers.\""
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "38",
    "Text": "Surely Allah knows the unseen of the heavens and the earth, He\\n\\t\\t\\teven knows the secrets of the breasts (hidden thoughts of\\n\\t\\t\\tpeople)."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "39",
    "Text": "It is He Who has made you vicegerent on the earth. Whoever\\n\\t\\t\\tdisbelieves, bears the burden of his disbelief; and for the\\n\\t\\t\\tdisbelievers their disbelief does not increase anything except\\n\\t\\t\\tthe wrath of their Rabb and the disbelievers do not gain anything\\n\\t\\t\\texcept an increase in their loss."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "40",
    "Text": "O Prophet, say: \"Have you ever considered your associate gods to\\n\\t\\t\\twhom you call upon besides Allah? Show me anything that they have\\n\\t\\t\\tcreated in the earth! Or what is their share in the creation of\\n\\t\\t\\tthe heavens? Or have We given them a Book from which they derive\\n\\t\\t\\ta provision of shirk? Nay, in fact the wrongdoers promise each\\n\\t\\t\\tother nothing but delusions."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "41",
    "Text": "It is Allah Who keeps the heavens and the earth from slipping out\\n\\t\\t\\tof their places. Should they ever slip, none can hold them back\\n\\t\\t\\tbesides Him; certainly He is Most Forbearing, Oft-Forgiving."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "42",
    "Text": "These very people used to swear on solemn oaths by Allah that if\\n\\t\\t\\ta Warner ever come to them, they would be better guided than any\\n\\t\\t\\tother nation of the world; yet when a Warner has come to them\\n\\t\\t\\tthey have increased in nothing but aversion,"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "43",
    "Text": "behaving arrogantly in the land and plotting evil, whereas the\\n\\t\\t\\tplotting of evil recoils none but the authors of it. Are they\\n\\t\\t\\tawaiting for that end which overtook the former nations? If so,\\n\\t\\t\\tyou shall find no change in the ways of Allah, nor will you find\\n\\t\\t\\tany alteration in Allah's way of dealing."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "44",
    "Text": "Have they not traveled through the land and see what was the end\\n\\t\\t\\tof those who went before them, who were far superior in strength\\n\\t\\t\\tthan these people? There is nothing in the heavens or in the\\n\\t\\t\\tearth which can frustrate Allah; surely He is All-Knowing,\\n\\t\\t\\tAll-Powerful."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "45",
    "Text": "If it was Allah's will to punish people for their misdeeds, He\\n\\t\\t\\twould have not left any living creature around them on the\\n\\t\\t\\tsurface of the earth, but He is giving them respite for an\\n\\t\\t\\tappointed time; when their appointed time will come, they shall\\n\\t\\t\\trealize that in fact Allah has been watching His servants all\\n\\t\\t\\talong."
  }
]
