[
  {
    "SurahNumber": "29",
    "AyahNumber": "1",
    "NoteID": "3422",
    "Body": "We are asked to contrast, in our present life the real\\n\\t\\t\\t\\tinner life against the outer life, and learn from the\\n\\t\\t\\t\\tpast about the struggles of the soul which upholds\\n\\t\\t\\t\\tAllah's Truth, against the environment of evil, which\\n\\t\\t\\t\\tresists it, and to turn our thoughts to the Ma'ad, or\\n\\t\\t\\t\\tman's future destiny in the Hereafter."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "2",
    "NoteID": "3423",
    "Body": "Mere lip profession of Faith is not enough. It must be\\n\\t\\t\\t\\ttried and tested in the real turmoil of life. The test\\n\\t\\t\\t\\twill be applied in all kinds of circumstances, in\\n\\t\\t\\t\\tindividual life and in relation to the environment around\\n\\t\\t\\t\\tus, to see whether we can strive constantly and put Allah\\n\\t\\t\\t\\tabove Self. Much pain, sorrow, and self-sacrifice may be\\n\\t\\t\\t\\tnecessary, not because they are good in themselves, but\\n\\t\\t\\t\\tbecause they will purify us, like fire applied to a\\n\\t\\t\\t\\tgoldsmith's crucible to burn out the dross."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "3",
    "NoteID": "3424",
    "Body": "The word \"know\" is used here more in the sense of testing\\n\\t\\t\\t\\tthan of acquiring knowledge. Allah is All-Knowing: He\\n\\t\\t\\t\\tneeds no test to increase His own knowledge, but the test\\n\\t\\t\\t\\tis to burn out the dross within ourselves, as explained\\n\\t\\t\\t\\tin the last note."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "4",
    "NoteID": "3425",
    "Body": "If the enemies of Truth imagine that they will \"be first\"\\n\\t\\t\\t\\tby destroying Truth before it takes root, they are sadly\\n\\t\\t\\t\\tat fault, for their own persecution may help to plant\\n\\t\\t\\t\\tAllah's Truth more firmly in men's hearts."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "5",
    "NoteID": "3426",
    "Body": "The men of Faith look forward to Allah. Their quest is\\n\\t\\t\\t\\tAllah, and the object of their hopes is the meeting with\\n\\t\\t\\t\\tAllah. They should strive with might and main to serve\\n\\t\\t\\t\\tHim in this life, for this life is short, and the Term\\n\\t\\t\\t\\tappointed for their probation will soon be over."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "5",
    "NoteID": "3427",
    "Body": "The Term (ajal) may signify: (1) the time appointed for\\n\\t\\t\\t\\tdeath, which ends the probation of this life; (2) the\\n\\t\\t\\t\\ttime appointed for this life, so that we can prepare for\\n\\t\\t\\t\\tthe Hereafter; the limit will soon expire. In either case\\n\\t\\t\\t\\tthe ultimate meaning is the same. We must strive now and\\n\\t\\t\\t\\tnot postpone anything for the future. And we must realize\\n\\t\\t\\t\\tand remember that every prayer we make to Allah is heard\\n\\t\\t\\t\\tby Him, and that every unspoken wish or motive of our\\n\\t\\t\\t\\theart, good or bad, is known to Him, and goes to swell\\n\\t\\t\\t\\tour spiritual account."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "6",
    "NoteID": "3428",
    "Body": "All our striving ensures to our own spiritual benefit.\\n\\t\\t\\t\\tWhen we speak of serving Allah, it is not that we confer\\n\\t\\t\\t\\tany benefit on Him. For He has no needs, and is\\n\\t\\t\\t\\tindependent of all His Creation. In conforming to His\\n\\t\\t\\t\\tWill, we are seeking our own good, as in yielding to evil\\n\\t\\t\\t\\twe are doing harm to ourselves."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "7",
    "NoteID": "3429",
    "Body": "In striving to purify our Faith and our Life, we are\\n\\t\\t\\t\\tenabled to avoid the consequences of our misdeeds for\\n\\t\\t\\t\\tAllah will forgive any evil in our past, and help to the\\n\\t\\t\\t\\tattainment of a Future based on the best of what we have\\n\\t\\t\\t\\tdone rather than on the poor average of our own merits.\\n\\t\\t\\t\\tThe atonement or expiation is by Allah's Mercy, not by\\n\\t\\t\\t\\tour merits or the merits or sacrifice of anyone else."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "8",
    "NoteID": "3430",
    "Body": "That is, no certainty. In matters of faith and worship,\\n\\t\\t\\t\\teven parents have no right to force their children. They\\n\\t\\t\\t\\tcannot and must not hold up before them any worship but\\n\\t\\t\\t\\tthat of the One True God."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "8",
    "NoteID": "3431",
    "Body": "Children and parents must all remember that they have all\\n\\t\\t\\t\\tto go before Allah's tribunal, and answer, each for his\\n\\t\\t\\t\\town deeds. In cases where one set of people have lawful\\n\\t\\t\\t\\tauthority over another set of people (as in the case of\\n\\t\\t\\t\\tparents and children), and the two differ in important\\n\\t\\t\\t\\tmatters like that of Faith, the latter are justified in\\n\\t\\t\\t\\trejecting authority: the apparent conflict will be solved\\n\\t\\t\\t\\twhen the whole truth is revealed to all eyes in the final\\n\\t\\t\\t\\tJudgment."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "9",
    "NoteID": "3432",
    "Body": "The picking up again of the words which began verse 7\\n\\t\\t\\t\\tabove shows that the same subject is now pursued from\\n\\t\\t\\t\\tanother aspect. The striving in righteous deeds will\\n\\t\\t\\t\\trestore fallen man to the society of the Righteous."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "10",
    "NoteID": "3433",
    "Body": "Cf. ix. 56, and other passages where the cunning of the\\n\\t\\t\\t\\tHypocrites is exposed. The man who turns away from Faith\\n\\t\\t\\t\\tin adversity and only claims the friendship of the\\n\\t\\t\\t\\tFaithful when there is something to be gained by it, is\\n\\t\\t\\t\\tworthy of a double condemnation: first because he\\n\\t\\t\\t\\trejected Faith and Truth, and secondly because he falsely\\n\\t\\t\\t\\tpretended to be of those whom he feared or hated in his\\n\\t\\t\\t\\theart. But nothing in all creation is concealed from\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "11",
    "NoteID": "3434",
    "Body": "Cf xxix. 3 above. The general opposition between Truth\\n\\t\\t\\t\\tand Falsehood is now brought down to the specific case of\\n\\t\\t\\t\\tthe Hypocrites, who are against the Faith militant but\\n\\t\\t\\t\\tswear friendship with it when it seems to be gaining\\n\\t\\t\\t\\tground. The argument is rounded off with the next two\\n\\t\\t\\t\\tverses."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "12",
    "NoteID": "3435",
    "Body": "Besides the hypocrite there is another type of man who\\n\\t\\t\\t\\topenly scoffs at Faith. 'Take life as we take it,' he\\n\\t\\t\\t\\tsays; 'we shall bear your sins.' As if they could! Each\\n\\t\\t\\t\\tsoul bears its own burdens, and no one else can bear\\n\\t\\t\\t\\tthem. The principle also applies to the type of man who\\n\\t\\t\\t\\tpreaches vicarious atonement, for, if followed to its\\n\\t\\t\\t\\tlogical conclusion, it means both injustice and\\n\\t\\t\\t\\tirresponsibility, and puts quite a different complexion\\n\\t\\t\\t\\ton the nature of sin."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "13",
    "NoteID": "3436",
    "Body": "Besides the burden of their own infidelity, they will\\n\\t\\t\\t\\tbear the burden of deluding others with falsehood."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "14",
    "NoteID": "3437",
    "Body": "The story of Noah and his Flood is not told here. It is\\n\\t\\t\\t\\ttold in other places; e.g., see xi. 25-48 or xxvi.\\n\\t\\t\\t\\t105-22. It is only referred to here to point out that\\n\\t\\t\\t\\tNoah's period lasted a long time, 950 years. (Cf. Gen.\\n\\t\\t\\t\\tix. 28-29, where his whole age is declared to have been\\n\\t\\t\\t\\t950 years, of which 350 years were after the Flood). In\\n\\t\\t\\t\\tspite of this long period, his contemporaries failed to\\n\\t\\t\\t\\tlisten, and they were destroyed. But the story of the Ark\\n\\t\\t\\t\\tremains an everlasting Sign and Warning to mankind-a Sign\\n\\t\\t\\t\\tof deliverance to the righteous and of destruction to the\\n\\t\\t\\t\\twicked."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "16",
    "NoteID": "3438",
    "Body": "The story of Abraham has been told in various phases in\\n\\t\\t\\t\\tdifferent passages. The ones most germane to the present\\n\\t\\t\\t\\tpassage are: xxi. 51-72 (his being cast into the fire and\\n\\t\\t\\t\\tbeing saved from it); and xix. 41-49 (his voluntary exile\\n\\t\\t\\t\\tfrom the home of his fathers). Here the story is not told\\n\\t\\t\\t\\tbut is referred to in order to stress the following\\n\\t\\t\\t\\tpoints; (1) Abraham's people only responded to his\\n\\t\\t\\t\\tpreaching by threatening to burn him (xxix. 16-18, 24);\\n\\t\\t\\t\\t(2) evil consorts with evil but will have a rude\\n\\t\\t\\t\\tawakening (xxix. 25); (3) the good adhere to the good,\\n\\t\\t\\t\\tand are blessed (xxix. 26-27). Note that the passage\\n\\t\\t\\t\\txxix. 19-23 is a parenthetical comment, though some\\n\\t\\t\\t\\tCommentators treat a portion of it as part of Abraham's\\n\\t\\t\\t\\tspeech."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "17",
    "NoteID": "3439",
    "Body": "Sustenance: in the symbolic as well as the literal sense.\\n\\t\\t\\t\\tSeek from Allah all that is necessary for your upkeep and\\n\\t\\t\\t\\tdevelopment, and for preparing you for your future\\n\\t\\t\\t\\tDestiny. Lay all your hopes in Him and in no one else.\\n\\t\\t\\t\\tDedicate yourselves to His worship. He will give you all\\n\\t\\t\\t\\tthat is necessaq for your growth and well being, and you\\n\\t\\t\\t\\tshould show your gratitude to Him by conforming your will\\n\\t\\t\\t\\tentirely to His."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "19",
    "NoteID": "3440",
    "Body": "The originating of creation is the creation of primeval\\n\\t\\t\\t\\tmatter. The repetition of the process of creation goes on\\n\\t\\t\\t\\tconstantly, for at every moment new processes are being\\n\\t\\t\\t\\tcalled into being by the creative power of Allah, and\\n\\t\\t\\t\\taccording to His Laws. And the final creation as far as\\n\\t\\t\\t\\tman is concerned will be in the Ma'ad, when the whole\\n\\t\\t\\t\\tworld as man sees it will be entirely newly created on a\\n\\t\\t\\t\\tdifferent plane. As far as Allah is concerned, there is\\n\\t\\t\\t\\tnothing final, no first and last, for He is infinite. He\\n\\t\\t\\t\\twas before our First and will be after our Last."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "20",
    "NoteID": "3441",
    "Body": "Travel through the earth: again, literally as well as\\n\\t\\t\\t\\tsymbolically. If we actually go through this wide earth,\\n\\t\\t\\t\\twe shall see the wonderful things in His Creation-the\\n\\t\\t\\t\\tGrand Canyon and the Niagaras in America, beautiful\\n\\t\\t\\t\\tharbors like that at Sydney in Australia, mountains like\\n\\t\\t\\t\\tFujiyama, the Himalayas, and Elburz in Asia, the Nile\\n\\t\\t\\t\\twith its wonderful cataracts in Africa, the Fiords of\\n\\t\\t\\t\\tNorway, the Geysers of Iceland, the city of the midnight\\n\\t\\t\\t\\tsun in Tromsoe, and innumerable wonders everywhere. But\\n\\t\\t\\t\\twonders upon wonders are disclosed in the constitution of\\n\\t\\t\\t\\tmatter itself, the atom, and the forces of energy, as\\n\\t\\t\\t\\talso in the instincts of animals, and the minds and\\n\\t\\t\\t\\tcapacities of man. And there is no limit to these things.\\n\\t\\t\\t\\tWorlds upon worlds are created and transformed every\\n\\t\\t\\t\\tmoment, within and presumably beyond man's vision. From\\n\\t\\t\\t\\twhat we know we can judge of the unknown."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "21",
    "NoteID": "3442",
    "Body": "I think ilaihi tuqlabun is better translated \"towards Him\\n\\t\\t\\t\\tare ye turned\" than \"towards Him will be your return\", as\\n\\t\\t\\t\\tit implies not only the return of man to Allah in the\\n\\t\\t\\t\\tHereafter (turja'un in verse 17 above) but also the fact\\n\\t\\t\\t\\texplained in verse 22 that man's needs are always to be\\n\\t\\t\\t\\tobtained from Allah: man cannot frustrate Allah's\\n\\t\\t\\t\\tdesigns, and can have no help or protection except from\\n\\t\\t\\t\\tAllah: man has always to face Allah, whether man obeys\\n\\t\\t\\t\\tAllah or tries to ignore Allah. Man will never be able to\\n\\t\\t\\t\\tdefeat Allah's Plan. According to His wise Will and Plan,\\n\\t\\t\\t\\tHe will grant His grace or withhold it from man."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "23",
    "NoteID": "3443",
    "Body": "The emphasis is on \"they\" (ulaika). It is only the people\\n\\t\\t\\t\\twho ignore or reject Allah's Signs and reject a\\n\\t\\t\\t\\tHereafter, that will find themselves in despair and\\n\\t\\t\\t\\tsuffering. Allah's Mercy is open to all, but if any\\n\\t\\t\\t\\treject His Mercy, they must suffer."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "24",
    "NoteID": "3444",
    "Body": "See xxi. 66-70. Abraham was cast into the fire, but he\\n\\t\\t\\t\\twas unhurt, by the grace of Allah. So righteous people\\n\\t\\t\\t\\tsuffer no harm from the plots of the wicked. But they\\n\\t\\t\\t\\tmust leave the environment of evil even if they have to\\n\\t\\t\\t\\tforsake their ancestral home, as Abraham did."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "25",
    "NoteID": "3445",
    "Body": "In sin and wickedness there is as much log-rolling as in\\n\\t\\t\\t\\tpolitics. Evil men humor each other and support each\\n\\t\\t\\t\\tother; they call each other's vice by high-sounding\\n\\t\\t\\t\\tnames. They call it mutual regard or friendship or love;\\n\\t\\t\\t\\tat the lowest, they call it toleration. Perhaps they\\n\\t\\t\\t\\tflourish in this life by such arts. But they deceive\\n\\t\\t\\t\\tthemselves, and they deceive each other. What will be\\n\\t\\t\\t\\ttheir relations in the Hereafter? They will disown each\\n\\t\\t\\t\\tother when each has to answer on the principle of\\n\\t\\t\\t\\tpersonal responsibility. Each will accuse the others of\\n\\t\\t\\t\\tmisleading him, and they will curse each other. But there\\n\\t\\t\\t\\twill then be no help, and they must suffer in the Fire."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "26",
    "NoteID": "3446",
    "Body": "Lot was a nephew of Abraham. He adhered to Abraham's\\n\\t\\t\\t\\tteaching and faith and accepted voluntary exile with him,\\n\\t\\t\\t\\tfor Abraham left the home of his fathers in Chaldaea and\\n\\t\\t\\t\\tmigrated to Syria and Palestine, where Allah gave him\\n\\t\\t\\t\\tincrease and prosperity, and a numerous family, who\\n\\t\\t\\t\\tupheld the flag of Unity and the Light of Allah."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "27",
    "NoteID": "3447",
    "Body": "Isaac was Abraham's son and Jacob his grandson, and among\\n\\t\\t\\t\\this progeny was included Isma'il the eldest son of\\n\\t\\t\\t\\tAbraham. Each of these became a fountain-head of Prophecy\\n\\t\\t\\t\\tand Revelation, Isaac and Jacob through Moses, and\\n\\t\\t\\t\\tIsma'il through the holy Prophet Muhammad. Jacob got the\\n\\t\\t\\t\\tname of \"Israel\" at Bethel: Gen. 32:28; 35:10, and his\\n\\t\\t\\t\\tprogeny got the title of \"The Children of Israel\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "27",
    "NoteID": "3448",
    "Body": "Cf xxix. 9, and iv. 69, n. 586."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "28",
    "NoteID": "3449",
    "Body": "Cf vii. 80. A discreet reference is made to their\\n\\t\\t\\t\\tunspeakable crimes, which were against the laws of all\\n\\t\\t\\t\\tnature."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "29",
    "NoteID": "3450",
    "Body": "They infested highways and committed their horrible\\n\\t\\t\\t\\tcrimes not only secretly, but openly and publicly, even\\n\\t\\t\\t\\tin their assemblies. Some Commentators understand\\n\\t\\t\\t\\t\"cutting off the highway\" to refer to highway robberies:\\n\\t\\t\\t\\tthis is possible, and it is also possible that the crimes\\n\\t\\t\\t\\tin their assemblies may have been injustice, rowdiness,\\n\\t\\t\\t\\tetc. But the context seems to refer to their own special\\n\\t\\t\\t\\thorrible crime, and the point here seems to be that they\\n\\t\\t\\t\\twere not ashamed of it and that they practiced it\\n\\t\\t\\t\\tpublicly. Degradation could go no further."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "29",
    "NoteID": "3451",
    "Body": "This is another instance of their effrontery, in addition\\n\\t\\t\\t\\tto that mentioned in vii. 82: the two supplement each\\n\\t\\t\\t\\tother. Here the point emphasised is that they did not\\n\\t\\t\\t\\tbelieve in Allah or His Punishment, and dared Allah's\\n\\t\\t\\t\\tProphet Lot to bring about the Punishment if he could.\\n\\t\\t\\t\\tAnd it did come and destroy them."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "31",
    "NoteID": "3452",
    "Body": "See xi. 69-76. The angels, who were coming on the mission\\n\\t\\t\\t\\tto destroy the people who were polluting the earth with\\n\\t\\t\\t\\ttheir crimes, called on their way on Abraham to give the\\n\\t\\t\\t\\tgood news of the birth of a son to him in his old age.\\n\\t\\t\\t\\tWhen they told him their destination, he feared for his\\n\\t\\t\\t\\tnephew who he knew was there. They reassured him and then\\n\\t\\t\\t\\tcame on to Lot."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "31",
    "NoteID": "3453",
    "Body": "By translating \"township\" I imply the two neighbouring\\n\\t\\t\\t\\tpopulations of Sodom and Gomorrah, who had already gone\\n\\t\\t\\t\\ttoo far in their crime, their shamelessness, and their\\n\\t\\t\\t\\tdefiance, to profit by any mercy from Allah."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "32",
    "NoteID": "3454",
    "Body": "She was not loyal to her husband. Tradition says that she\\n\\t\\t\\t\\tbelonged to the wicked people, and was not prepared to\\n\\t\\t\\t\\tleave them. She had no faith in the mission either of her\\n\\t\\t\\t\\thusband or of the angels who had come as his guests."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "33",
    "NoteID": "3455",
    "Body": "This part of the story may be read in greater detail in\\n\\t\\t\\t\\txi. 77-83."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "34",
    "NoteID": "3456",
    "Body": "The Punishment was a rain of brimstone, which completely\\n\\t\\t\\t\\toverwhelmed the Cities, with possibly an earthquake and a\\n\\t\\t\\t\\tvolcanic eruption (see xi. 82)."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "35",
    "NoteID": "3457",
    "Body": "The whole tract on the east side of the Dead Sea (where\\n\\t\\t\\t\\tthe Cities were situated) is covered with sulphureous\\n\\t\\t\\t\\tsalts and is deadly to animal and plant life. The Dead\\n\\t\\t\\t\\tSea itself is called in Arabic the Bahr Lut (the sea of\\n\\t\\t\\t\\tLot). It is a scene of utter desolation, that should\\n\\t\\t\\t\\tstand as a Symbol of the Destruction that awaits Sin."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "37",
    "NoteID": "3458",
    "Body": "The story of Shu'aib and the Madyan people is only\\n\\t\\t\\t\\treferred to here. It is told in xi. 84-95. Their\\n\\t\\t\\t\\tbesetting sin was fraud and commercial immorality. Their\\n\\t\\t\\t\\tpunishment was a mighty Blast, such as accompanies\\n\\t\\t\\t\\tvolcanic eruptions. The point of the reference here is\\n\\t\\t\\t\\tthat they went about doing mischief on the earth, and\\n\\t\\t\\t\\tnever thought of the Ma'ad or the Hereafter, the\\n\\t\\t\\t\\tparticular theme of this Sura. The same point is made by\\n\\t\\t\\t\\tthe brief references in the following two verses to the\\n\\t\\t\\t\\t'Ad and the Thamud, and to Qarun, Pharaoh, and Haman,\\n\\t\\t\\t\\tthough the besetting sin in each case was different. The\\n\\t\\t\\t\\tMidianites were a commercial people and trafficked from\\n\\t\\t\\t\\tland to land; their frauds are well described as\\n\\t\\t\\t\\tspreading \"mischief on the earth\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "38",
    "NoteID": "3459",
    "Body": "For the 'Ad people see vii. 65-72, and n. 1040, and for\\n\\t\\t\\t\\tthe Thamud, vii. 73-79, and n. 1043. The remains of their\\n\\t\\t\\t\\tbuildings show (1) that they were gifted with great\\n\\t\\t\\t\\tintelligence and skill; (2) that they were proud of their\\n\\t\\t\\t\\tmaterial civilization; and (3) their destruction argues\\n\\t\\t\\t\\thow the greatest mataterial civilization and resources\\n\\t\\t\\t\\tcannot save a People who disobey Allah's moral law."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "38",
    "NoteID": "3460",
    "Body": "They were so arrogant and self-satisfied, that they\\n\\t\\t\\t\\tmissed the higher purpose of life, and strayed clean away\\n\\t\\t\\t\\tfrom the Path of Allah. Though their intelligence should\\n\\t\\t\\t\\thave kept them straight, Evil made them crooked and led\\n\\t\\t\\t\\tthem and kept them astray."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "39",
    "NoteID": "3461",
    "Body": "For Qarun see xxviii. 76-82; Pharaoh is mentioned\\n\\t\\t\\t\\tfrequently in the Qur-an, but he is mentioned in\\n\\t\\t\\t\\tassociation with Haman in xxviii. 6; for their\\n\\t\\t\\t\\tblasphemous arrogance and defiance of Allah see xxviii.\\n\\t\\t\\t\\t38. They thought such a lot of themselves, but they came\\n\\t\\t\\t\\tto an evil end."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "40",
    "NoteID": "3462",
    "Body": "For hasib (violent tornado with showers of stones), see\\n\\t\\t\\t\\txvii. 68; this punishment as inflicted on the Cities of\\n\\t\\t\\t\\tthe Plain, of which Lot preached (liv. 34). Some\\n\\t\\t\\t\\tCommentators think that this also applied to the 'Ad, but\\n\\t\\t\\t\\ttheir punishment is described as by a violent and\\n\\t\\t\\t\\tunseasonable cold wind (xli. 16; liv. 19 and lxix. 6),\\n\\t\\t\\t\\tsuch as blows in sand-storms in the Ahqaf, the region of\\n\\t\\t\\t\\tshifting sands which was in their territory."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "40",
    "NoteID": "3463",
    "Body": "For saihat (Blast) see xi. 67 and n. 1561, as also n.\\n\\t\\t\\t\\t1047 to vii. 78 and n. 1996 to xv. 73. This word is used\\n\\t\\t\\t\\tin describing the fate of (1) the Thamud (xi. 67); Madyan\\n\\t\\t\\t\\t(xi. 94); the population to which Lut preached (xv. 73);\\n\\t\\t\\t\\tand the Rocky Tract (Hijr, xv. 83), part of the territory\\n\\t\\t\\t\\tof the Thamud; also in the Parable of the City to which\\n\\t\\t\\t\\tcame three Prophets, who found a single-believer (xxxvi.\\n\\t\\t\\t\\t29)."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "40",
    "NoteID": "3464",
    "Body": "This was the fate of Qarun: see xxviii. 81. Cf. also xvi.\\n\\t\\t\\t\\t45 and n. 2071."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "40",
    "NoteID": "3465",
    "Body": "This was the fate of the hosts of Pharaoh and Haman\\n\\t\\t\\t\\t(xxviii. 40) as well as the wicked generation of Noah\\n\\t\\t\\t\\t(xxvi. 120)."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "41",
    "NoteID": "3466",
    "Body": "The Spider's house is one of the wonderful Signs of\\n\\t\\t\\t\\tAllah's creation. It is made up of fine silk threads spun\\n\\t\\t\\t\\tout of silk glands in the spider's body. There are many\\n\\t\\t\\t\\tkinds of spiders and many kinds of spider's houses. Two\\n\\t\\t\\t\\tmain types of houses may be mentioned. There is the\\n\\t\\t\\t\\ttubular nest or web, a silk-lined house or burrow with\\n\\t\\t\\t\\tone or two trap-doors. This may be called his residential\\n\\t\\t\\t\\tor family mansion. Then there is what is ordinarily\\n\\t\\t\\t\\tcalled a spider's web, consisting of a central point with\\n\\t\\t\\t\\tradiating threads running in all directions and acting as\\n\\t\\t\\t\\ttie-beams to the quasi-circular concentric threads that\\n\\t\\t\\t\\tform the body of the web. This is his hunting box. The\\n\\t\\t\\t\\twhole structure exemplifies economy in time, material,\\n\\t\\t\\t\\tand strength. If an insect is caught in the net, the\\n\\t\\t\\t\\tvibration set up in the radiating threads is at once\\n\\t\\t\\t\\tcommunicated to the spider, who can come and kill his\\n\\t\\t\\t\\tprey. In case the prey is powerful, the spider is\\n\\t\\t\\t\\tfurnished with poison glands with which to kill his prey.\\n\\t\\t\\t\\tThe spider sits either in the centre of the web or hides\\n\\t\\t\\t\\ton the under-side of a leaf or in some crevice, but he\\n\\t\\t\\t\\talways has a single thread connecting him with his web,\\n\\t\\t\\t\\tto keep him in telephonic communication. The female\\n\\t\\t\\t\\tspider is much bigger than the male, and in Arabic the\\n\\t\\t\\t\\tgeneric gender of 'Ankabut is feminine."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "41",
    "NoteID": "3467",
    "Body": "Most of the facts in the last note can be read into the\\n\\t\\t\\t\\tParable. For their thickness the spider's threads are\\n\\t\\t\\t\\tvery strong from the point of view of relativity, but in\\n\\t\\t\\t\\tour actual world they are flimsy, especially the threads\\n\\t\\t\\t\\tof the gossamer spider floating in the air. So is the\\n\\t\\t\\t\\thouse and strength of the man who relies on material\\n\\t\\t\\t\\tresources however fine or beautiful relatively; before\\n\\t\\t\\t\\tthe eternal Reality they are as nothing. The spider's\\n\\t\\t\\t\\tmost cunning architecture cannot stand against a wave of\\n\\t\\t\\t\\ta man's hand. His poison glands are like the hidden\\n\\t\\t\\t\\tpoison in our beautiful worldly plans which may take\\n\\t\\t\\t\\tvarious shapes but have seeds of death in them."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "42",
    "NoteID": "3468",
    "Body": "The last verse told us that men, out of spiritual\\n\\t\\t\\t\\tignorance, build their hopes on flimsy unsubstantial\\n\\t\\t\\t\\tthings (like the spider's web) which are broken by a\\n\\t\\t\\t\\tthousand chance attacks of wind and weather or the\\n\\t\\t\\t\\tactions of animals or men. If they cannot fully grasp\\n\\t\\t\\t\\ttheir own good, they should seek His Light. To Him\\n\\t\\t\\t\\teverything is known,-men's frailty, their false hopes,\\n\\t\\t\\t\\ttheir questionable motives, the false gods whom they\\n\\t\\t\\t\\tenthrone in their midst, the mischief done by the neglect\\n\\t\\t\\t\\tof Truth, and the way out for those who have entangled\\n\\t\\t\\t\\tthemselves in the snares of evil. He is All-Wise and is\\n\\t\\t\\t\\table to carry out all He wills, and they should turn to\\n\\t\\t\\t\\tHim."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "43",
    "NoteID": "3469",
    "Body": "Parables seem simple things, but their profound meaning\\n\\t\\t\\t\\tand application can only be understood by those who seek\\n\\t\\t\\t\\tknowledge and by Allah's grace attain it."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "44",
    "NoteID": "3470",
    "Body": "Cf. vi. 73 and n. 896. In all Allah's Creation, not only\\n\\t\\t\\t\\tis there evidence of intelligent Purpose, fitting all\\n\\t\\t\\t\\tparts together with wisdom, but also of supreme Goodness\\n\\t\\t\\t\\tand cherishing Care, by which all needs are satisfied and\\n\\t\\t\\t\\tall the highest and truest cravings fulfilled. These are\\n\\t\\t\\t\\tlike beckoning signals to lead on those who pray and\\n\\t\\t\\t\\tsearch in Faith."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "45",
    "NoteID": "3471",
    "Body": "The tilawat of the Qur-an implies: (1) rehearsing or\\n\\t\\t\\t\\treciting it, and publishing it abroad to the world; (2)\\n\\t\\t\\t\\treading it to ourselves; (3) studying it to understand it\\n\\t\\t\\t\\tas it should be studied and understood (ii. 121); (4)\\n\\t\\t\\t\\tmeditating on it so as to accord our knowledge and life\\n\\t\\t\\t\\tand desires with it. When this is done, it merges into\\n\\t\\t\\t\\treal Prayer, and Prayer purges us of anything (act, plan,\\n\\t\\t\\t\\tthought, motive, words) of which we should be ashamed or\\n\\t\\t\\t\\twhich would work injustice to others. Such Prayer passes\\n\\t\\t\\t\\tinto our inmost life and being, for then we realize the\\n\\t\\t\\t\\tPresence of Allah, and that is true zikr (or\\n\\t\\t\\t\\tremembrance), for remembrance is the bringing to mind of\\n\\t\\t\\t\\tthings as present to us which might otherwise be absent\\n\\t\\t\\t\\tto us. And that is the greatest thing in life. It is\\n\\t\\t\\t\\tsubjective to us: it fills our consciousness with Allah.\\n\\t\\t\\t\\tFor Allah is in any case always present and knows all."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "46",
    "NoteID": "3472",
    "Body": "Mere disputations are futile. In order to achieve our\\n\\t\\t\\t\\tpurpose as true standardbearers for Allah, we shall have\\n\\t\\t\\t\\tto find true common grounds of belief, as stated in the\\n\\t\\t\\t\\tlatter part of this verse, and also to show by our\\n\\t\\t\\t\\turbanity, kindness, sincerity, truth, and genuine\\n\\t\\t\\t\\tanxiety, for the good of others, that we are not cranks\\n\\t\\t\\t\\tor merely seeking selfish or questionable aims."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "46",
    "NoteID": "3473",
    "Body": "Of course those who are deliberately trying to wrong or\\n\\t\\t\\t\\tinjure others will have to be treated firmly, as we are\\n\\t\\t\\t\\tguardians of each other. With them there is little\\n\\t\\t\\t\\tquestion of finding common ground or exercising patience,\\n\\t\\t\\t\\tuntil the injury is prevented or stopped."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "46",
    "NoteID": "3474",
    "Body": "That is, the religion of all true and sincere men of\\n\\t\\t\\t\\tFaith is, or should be, one; and that is the ideal of\\n\\t\\t\\t\\tIslam."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "47",
    "NoteID": "3475",
    "Body": "It is in this spirit that all true Revelation comes from\\n\\t\\t\\t\\tAllah. Allah is One, and His Message cannot come in one\\n\\t\\t\\t\\tplace or at one time to contradict His Message in another\\n\\t\\t\\t\\tplace or at another time in spirit, though there may be\\n\\t\\t\\t\\tlocal variations according to the needs or understanding\\n\\t\\t\\t\\tof men at any given time or place."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "47",
    "NoteID": "3476",
    "Body": "The sincere Jews and Christians found in the holy Prophet\\n\\t\\t\\t\\ta fulfillment of their own religion. For the names of\\n\\t\\t\\t\\tsome Jews who recognized and embraced Islam, see n. 3227\\n\\t\\t\\t\\tto xxvi. 197. Among the Christians, too, the Faith slowly\\n\\t\\t\\t\\twon ground. Embassies were sent by the holy Prophet in\\n\\t\\t\\t\\tthe 6th and 7th years of the Hijrat to all the principal\\n\\t\\t\\t\\tcountries round Arabia, viz., the capital of the\\n\\t\\t\\t\\tByzantine Empire (Constantinople), the capital of the\\n\\t\\t\\t\\tPersian Empire (Madain), the Sasanian capital known to\\n\\t\\t\\t\\tthe West by the Greek name of Ctesiphon, (about thirty\\n\\t\\t\\t\\tmiles south of modern Bagdad), Syria, Abyssinia, and\\n\\t\\t\\t\\tEgypt. All these (except Persia) were Christian\\n\\t\\t\\t\\tcountries. In the same connection an embassy was also\\n\\t\\t\\t\\tsent to Yamama in Arabia itself (east of the Hijaz) where\\n\\t\\t\\t\\tthe Banu Hanifa tribe was Christian, like the Harith\\n\\t\\t\\t\\ttribe of Najran who voluntarily sent an embassy to\\n\\t\\t\\t\\tMadinah. All these countries except Abyssinia eventually\\n\\t\\t\\t\\tbecame Muslim, and Abyssinia itself has a considerable\\n\\t\\t\\t\\tMuslim population now and sent some Muslim converts to\\n\\t\\t\\t\\tMadinah in the time of the Prophet himself. As a\\n\\t\\t\\t\\tgeneralization it is true that the Jewish and the\\n\\t\\t\\t\\tChristian peoples as they existed in the seventh century\\n\\t\\t\\t\\tof the Christian era have been mainly absorbed by Islam,\\n\\t\\t\\t\\tas well as the lands in which they predominated. Remnants\\n\\t\\t\\t\\tof them built up new nuclei. The Roman Catholic Church\\n\\t\\t\\t\\tconquered new lands among the northern (Germanic) Pagans\\n\\t\\t\\t\\tand the Byzantine Church among the eastern (Slavonic)\\n\\t\\t\\t\\tPagans, and the Protestantism of the 16th century gave a\\n\\t\\t\\t\\tfresh stimulus to the main ideas for which Islam stands,\\n\\t\\t\\t\\tviz., the abolition of priest craft, the right of private\\n\\t\\t\\t\\tjudgment, the simplification of ritual, and the\\n\\t\\t\\t\\tinsistence upon the simple, practical, everyday duties of\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "47",
    "NoteID": "3477",
    "Body": "The Pagan Arabs also gradually came in until they were\\n\\t\\t\\t\\tall absorbed in Islam."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "48",
    "NoteID": "3478",
    "Body": "The holy Prophet was not a learned man. Before the Qur-an\\n\\t\\t\\t\\twas revealed to him, he never claimed to proclaim a\\n\\t\\t\\t\\tMessage from Allah. He was not in the habit of preaching\\n\\t\\t\\t\\teloquent truths as from a Book, before he received his\\n\\t\\t\\t\\tRevelation, nor was he able to write or transcribe with\\n\\t\\t\\t\\this own hand. If he had had these worldly gifts, there\\n\\t\\t\\t\\twould have been some plausibility in the charge of the\\n\\t\\t\\t\\ttalkers of vanities that he spoke not from inspiration\\n\\t\\t\\t\\tbut from other people's books, or that he composed the\\n\\t\\t\\t\\tbeautiful verses of the Qur-an himself and committed them\\n\\t\\t\\t\\tto memory in order to recite them to people. The\\n\\t\\t\\t\\tcircumstances in which the Qur-an came bear their own\\n\\t\\t\\t\\ttestimony to its truth as from Allah."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "49",
    "NoteID": "3479",
    "Body": "\"Knowledge\" ('ilm) means both power of judgment in\\n\\t\\t\\t\\tdiscerning the value of truth and acquaintance with\\n\\t\\t\\t\\tprevious revelations. It implies both literal and\\n\\t\\t\\t\\tspiritual insight. To men so endowed, Allah's revelations\\n\\t\\t\\t\\tand Signs are self-evident. They commend themselves to\\n\\t\\t\\t\\ttheir hearts, minds, and understandings, which are\\n\\t\\t\\t\\ttypified in Arabic by the word sadr, \"breast\"."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "49",
    "NoteID": "3480",
    "Body": "Cf. the last clause of verse 47 above. There the argument\\n\\t\\t\\t\\twas that the rejection of the Qur-an was a mark of\\n\\t\\t\\t\\tUnbelief. Now the argument is carried a stage farther.\\n\\t\\t\\t\\tSuch rejection is also a mark of injustice, a deliberate\\n\\t\\t\\t\\tperversity in going against obvious Signs, which should\\n\\t\\t\\t\\tconvince all honest men."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "50",
    "NoteID": "3481",
    "Body": "See last note. In the Qur-an, as said in verse 49, are\\n\\t\\t\\t\\tSigns which should carry conviction to all honest hearts.\\n\\t\\t\\t\\tAnd yet the Unbelievers ask for Signs! They mean some\\n\\t\\t\\t\\tspecial kinds of Signs or Miracles, such as their own\\n\\t\\t\\t\\tfoolish minds dictate. Everything is possible for Allah,\\n\\t\\t\\t\\tbut Allah is not going to humor the follies of men or\\n\\t\\t\\t\\tlisten to their disingenuous demands. He has sent a\\n\\t\\t\\t\\tMessenger to explain His Signs clearly, and to warn them\\n\\t\\t\\t\\tof the consequences of rejection. Is it not enough?"
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "51",
    "NoteID": "3482",
    "Body": "The perspicuous Qur-an, explained in detail by Allah's\\n\\t\\t\\t\\tMessenger, in conjunction with Allah's Signs in nature\\n\\t\\t\\t\\tand in the hearts of men, should be enough for all. It is\\n\\t\\t\\t\\tmere fractious opposition to demand vaguely something\\n\\t\\t\\t\\tmore. Cf. also vi. 124, and n. 946."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "52",
    "NoteID": "3483",
    "Body": "The test of a Revelation is whether it comes from Allah\\n\\t\\t\\t\\tor not. This is made clear by the life and teachings of\\n\\t\\t\\t\\tthe Messenger who brings it. No fraud or falsehood can\\n\\t\\t\\t\\tfor a moment stand before Allah. All the most hidden\\n\\t\\t\\t\\tthings in heaven and earth are open before Him."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "52",
    "NoteID": "3484",
    "Body": "If Truth is rejected, Truth does not suffer. It is the\\n\\t\\t\\t\\trejecters who suffer and perish in the end."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "53",
    "NoteID": "3485",
    "Body": "Cf. xxii. 47 and n. 2826. The rejecters of Faith throw\\n\\t\\t\\t\\tout a challenge out of bravado: \"Let us see if you can\\n\\t\\t\\t\\thasten the punishment on us!\" This is a vail taunt.\\n\\t\\t\\t\\tAllah's Plan will take its course, and can neither be\\n\\t\\t\\t\\tdelayed nor hastened. It is out of His Mercy that He\\n\\t\\t\\t\\tgives respite to sinners, in order that they may have a\\n\\t\\t\\t\\tchance of repentance. If they do not repent, the\\n\\t\\t\\t\\tPunishment must certainly come to them-and on a sudden,\\n\\t\\t\\t\\tbefore they perceive that it is coming! And then it will\\n\\t\\t\\t\\tbe too late for repentance."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "54",
    "NoteID": "3486",
    "Body": "The challenge of the wicked for Punishment was answered\\n\\t\\t\\t\\tin the last verse by reference to Allah's merciful\\n\\t\\t\\t\\tRespite, to give chances of repentance. It is answered in\\n\\t\\t\\t\\tthis verse by an assurance that if no repentance is\\n\\t\\t\\t\\tforthcoming, the Punishment will be certain and of an\\n\\t\\t\\t\\tall-pervasive kind. Hell will surround them on all sides,\\n\\t\\t\\t\\tand above them and below them."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "55",
    "NoteID": "3487",
    "Body": "Cf. a similar phrase in vi. 65."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "55",
    "NoteID": "3488",
    "Body": "This is not merely a reproach, but a justification of the\\n\\t\\t\\t\\tPunishment. \"It is you who brought it on yourselves by\\n\\t\\t\\t\\tyour evil deeds: blame none but yourselves. Allah's Mercy\\n\\t\\t\\t\\tgave you many chances: His Justice has now overtaken\\n\\t\\t\\t\\tyou!\""
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "56",
    "NoteID": "3489",
    "Body": "There is no excuse for any one to plead that he could not\\n\\t\\t\\t\\tdo good or was forced to evil by his circumstances and\\n\\t\\t\\t\\tsurroundings, or by the fact that he lived in evil times.\\n\\t\\t\\t\\tWe must shun evil and seek good, and Allah's Creation is\\n\\t\\t\\t\\twide enough to enable us to do that, provided we have the\\n\\t\\t\\t\\twill, the patience, and the constancy to do it. It may be\\n\\t\\t\\t\\tthat we have to change our village or city or country; or\\n\\t\\t\\t\\tthat we have to change our neighbors or associates; or to\\n\\t\\t\\t\\tchange our habits or our hours, our position in life or\\n\\t\\t\\t\\tour human relationships, or our callings. Our integrity\\n\\t\\t\\t\\tbefore Allah is more important than any of these things,\\n\\t\\t\\t\\tand we must be prepared for exile (or Hijrat) in all\\n\\t\\t\\t\\tthese senses. For the means with which Allah provides us\\n\\t\\t\\t\\tfor His service are ample, and it is our own fault if we\\n\\t\\t\\t\\tfail."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "57",
    "NoteID": "3490",
    "Body": "Cf. iii. 185, n. 491, and xxi. 35 and n. 2697. Death is\\n\\t\\t\\t\\tthe separation of the soul from the body when the latter\\n\\t\\t\\t\\tperishes. We should not be afraid of death, for it only\\n\\t\\t\\t\\tbrings us back to Allah. The various kinds of hijrat or\\n\\t\\t\\t\\texile, physical and spiritual, mentioned in the last\\n\\t\\t\\t\\tnote, are also modes of death in a sense: what is there\\n\\t\\t\\t\\tto fear in them?"
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "58",
    "NoteID": "3491",
    "Body": "The goodly homes mentioned in xvi. 41 referred to this\\n\\t\\t\\t\\tlife, but it was stated there that the reward of the\\n\\t\\t\\t\\tHereafter would be greater. Here the simile of the Home\\n\\t\\t\\t\\tis referred to Heaven: it will be beautiful; it will be\\n\\t\\t\\t\\tpicturesque, with the sight and sound of softly-murmuring\\n\\t\\t\\t\\tstreams; it will be lofty or sublime; and it will be\\n\\t\\t\\t\\teternal."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "60",
    "NoteID": "3492",
    "Body": "If we look at the animal creation, we see that many\\n\\t\\t\\t\\tcreatures seem almost helpless to find their own food or\\n\\t\\t\\t\\tsustain their full life, being surrounded by many\\n\\t\\t\\t\\tenemies. Yet in the Plan of Allah they find full\\n\\t\\t\\t\\tsustenance and protection. So does man. Man's needs-as\\n\\t\\t\\t\\twell as helplessness-are by many degrees greater. Yet\\n\\t\\t\\t\\tAllah provides for him as for all His creatures. Allah\\n\\t\\t\\t\\tlistens to the wish and cry of all His creatures and He\\n\\t\\t\\t\\tknows their needs and how to provide for them all. Man\\n\\t\\t\\t\\tshould not therefore hesitate to suffer exile or\\n\\t\\t\\t\\tpersecution in Allah's Cause."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "61",
    "NoteID": "3493",
    "Body": "Cf. xxiii. 84-89. \"Them\" in both passages refers to the\\n\\t\\t\\t\\tsort of inconsistent men who acknowledge the power of\\n\\t\\t\\t\\tAllah, but are deluded by false notions into disobedience\\n\\t\\t\\t\\tof Allah's Law and disregard of Allah's Message."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "61",
    "NoteID": "3494",
    "Body": "Cf. xiii. 2, and xxiii. 85. The perfect order and law in\\n\\t\\t\\t\\tAllah's universe should be Signs to man's intelligence to\\n\\t\\t\\t\\tget his own will into tune with Allah's Will; for only so\\n\\t\\t\\t\\tcan he hope to attain his full development."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "62",
    "NoteID": "3495",
    "Body": "Cf. xiii. 26. Unequal gifts are not a sign of chaos in\\n\\t\\t\\t\\tAllah's universe. Allah provides for all according to\\n\\t\\t\\t\\ttheir real needs and their most suitable requirements,\\n\\t\\t\\t\\taccording to His perfect knowledge and understanding of\\n\\t\\t\\t\\tHis creatures."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "63",
    "NoteID": "3496",
    "Body": "In xxix. 61 above, the point was that there is a certain\\n\\t\\t\\t\\ttype of man that realizes the power of Allah, but yet\\n\\t\\t\\t\\tgoes after false ideas and false worship. Here the point\\n\\t\\t\\t\\tis that there is another type of man to whom the goodness\\n\\t\\t\\t\\tof Allah is made clear by rain and the gifts of nature\\n\\t\\t\\t\\tand who realizes the daily, seasonal, and secular changes\\n\\t\\t\\t\\twhich evidence Allah's goodness in giving us life\\n\\t\\t\\t\\t(physical and Spiritual) and reviving us after we seem to\\n\\t\\t\\t\\tdie,-and who yet fails to draw the right conclusion from\\n\\t\\t\\t\\tit and to make his own life true and beautiful, so that\\n\\t\\t\\t\\twhen his period of probation in this transitory life is\\n\\t\\t\\t\\tended, he can enter into his eternal heritage. Having\\n\\t\\t\\t\\tcome so far, such men fail at the crucial stage. At that\\n\\t\\t\\t\\tstage they ought to have praised and glorified Allah and\\n\\t\\t\\t\\taccepted His Grace and Light, but they show their want of\\n\\t\\t\\t\\ttrue understanding by failing to profit by Allah's gifts."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "64",
    "NoteID": "3497",
    "Body": "Cf. vi. 32. Amusement and play have no lasting\\n\\t\\t\\t\\tsignificance except as preparing us for the serious work\\n\\t\\t\\t\\tof life. So this life is but an interlude, a preparation\\n\\t\\t\\t\\tfor the real Life, which is in the Hereafther. This\\n\\t\\t\\t\\tworld's vanities are therefore to be taken for what they\\n\\t\\t\\t\\tare worth; but they are not to be allowed to deflect our\\n\\t\\t\\t\\tminds from the requirements of the inner life that really\\n\\t\\t\\t\\tmatters."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "65",
    "NoteID": "3498",
    "Body": "Cf vii. 29, where I have slightly varied the English\\n\\t\\t\\t\\tphrase according to the context. It was shown in the last\\n\\t\\t\\t\\tverse that the life of this world is fleeting, and that\\n\\t\\t\\t\\tthe true life-that which matters-is the Life in the\\n\\t\\t\\t\\tHereafter. In contrast with this inner reality is now\\n\\t\\t\\t\\tshown the shortsighted folly of man. Where he faces the\\n\\t\\t\\t\\tphysical dangers of the sea, which are but an incident in\\n\\t\\t\\t\\tthe phenomenal world, he actually and sincerely seeks the\\n\\t\\t\\t\\thelp of Allah; but when he is safely back on land, he\\n\\t\\t\\t\\tforgets the Realities, plunges into the pleasures and\\n\\t\\t\\t\\tvanities of fleeting phenomena, and his devotion, which\\n\\t\\t\\t\\tshould be given exclusively to Allah, is shared by idols\\n\\t\\t\\t\\tand vanities of his own imagination."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "66",
    "NoteID": "3499",
    "Body": "Such folly results in the virtual rejection (even though\\n\\t\\t\\t\\tit may not be express) of Allah and His Grace. It plunges\\n\\t\\t\\t\\tman into the pleasures and vanities that merely delude\\n\\t\\t\\t\\tand are bound to pass away. This delusion, however, will\\n\\t\\t\\t\\tcome to an end when the true Reality of the Hereafter\\n\\t\\t\\t\\twill shine forth in all its splendor."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "67",
    "NoteID": "3500",
    "Body": "If they want evidences of their folly in the phenomenal\\n\\t\\t\\t\\tworld itself, they will see sacred Sanctuaries where\\n\\t\\t\\t\\tAllah's Truth abides safely in the midst of the Deluge of\\n\\t\\t\\t\\tbroken hopes, disappointed ambitions and unfulfilled\\n\\t\\t\\t\\tplans in the world around. The immediate reference was to\\n\\t\\t\\t\\tthe Sanctuary of Makkah and the gradual progress of Islam\\n\\t\\t\\t\\tin the districts surrounding the Quraish in the midst of\\n\\t\\t\\t\\tthe trying Makkan period. But the general application\\n\\t\\t\\t\\tholds good for all times and places."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "68",
    "NoteID": "3501",
    "Body": "Cf. vi. 21. Even from a worldly point of view those who\\n\\t\\t\\t\\treject Allah's Truth are at a disadvantage. But those who\\n\\t\\t\\t\\tdeliberately invent lies and set up false gods for\\n\\t\\t\\t\\tworship, what punishment can we imagine for them except a\\n\\t\\t\\t\\tpermanent deprivation of Allah's grace, and a home in\\n\\t\\t\\t\\tHell?"
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "69",
    "NoteID": "3502",
    "Body": "\"Strive in Our Cause.\" All that man can do is to strive\\n\\t\\t\\t\\tin Allah's Cause. As soon as he strives with might and\\n\\t\\t\\t\\tmain, with constancy and determination, the Light and\\n\\t\\t\\t\\tMercy of Allah come to meet him. They cure his defects\\n\\t\\t\\t\\tand shortcomings. They provide him with the means by\\n\\t\\t\\t\\twhich he can raise himself above himself. They point out\\n\\t\\t\\t\\tthe Way, and all the Paths leading up to it. See next\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "29",
    "AyahNumber": "69",
    "NoteID": "3503",
    "Body": "The Way of Allah (sirat-ul-Mustaqim) is a Straight Way.\\n\\t\\t\\t\\tBut men have strayed from it in all directions. And there\\n\\t\\t\\t\\tare numerous Paths by which they can get back to the\\n\\t\\t\\t\\tRight Way, the way in which the purity of their own\\n\\t\\t\\t\\tnature, and the Will and Mercy of Allah require them to\\n\\t\\t\\t\\tWalk. All these numerous Paths become open to them if\\n\\t\\t\\t\\tonce they give their hearts in keeping to Allah and work\\n\\t\\t\\t\\tin right Endeavour (Jihad) with all their mind and soul\\n\\t\\t\\t\\tand resources. Thus will they get out of the Spider's web\\n\\t\\t\\t\\tof this frail world and attain to eternal Bliss in the\\n\\t\\t\\t\\tfulfillment of their true Destiny."
  }
]
