[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/042001",
        "Body":  "Ha. Mim."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/042010",
        "Body":  "And in whatsoever ye differ, the verdict therein belongeth to\n\t\t\tAllah. Such is my Lord, in Whom I put my trust, and unto Whom I\n\t\t\tturn."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/042011",
        "Body":  "The Creator of the heavens and the earth. He hath made for you\n\t\t\tpairs of yourselves, and of the cattle also pairs, whereby He\n\t\t\tmultiplieth you. Naught is as His likeness; and He is the Hearer,\n\t\t\tthe Seer."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/042012",
        "Body":  "His are the keys of the heavens and the earth. He enlargeth\n\t\t\tprovidence for whom He will and straiteneth (it for whom He\n\t\t\twill). Lo! He is Knower of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/042013",
        "Body":  "He hath ordained for you that religion which He commended unto\n\t\t\tNoah, and that which We inspire in thee (Muhammad), and that\n\t\t\twhich We commended unto Abraham and Moses and Jesus, saying:\n\t\t\tEstablish the religion, and be not divided therein. Dreadful for\n\t\t\tthe idolaters is that unto which thou callest them. Allah\n\t\t\tchooseth for Himself whom He will, and guideth unto Himself him\n\t\t\twho turneth (toward Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/042014",
        "Body":  "And they were not divided until after the knowledge came unto\n\t\t\tthem, through rivalry among themselves; and had it not been for a\n\t\t\tWord that had already gone forth from thy Lord for an appointed\n\t\t\tterm, it surely had been judged between them. And those who were\n\t\t\tmade to inherit the Scripture after them are verily in hopeless\n\t\t\tdoubt concerning it."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/042015",
        "Body":  "Unto this, then, summon (O Muhammad). And be thou upright as thou\n\t\t\tart commanded, and follow not their lusts, but say: I believe in\n\t\t\twhatever Scripture Allah hath sent down, and I am commanded to be\n\t\t\tjust among you. Allah is our Lord and your Lord. Unto us our\n\t\t\tworks and unto you your works; no argument between us and you.\n\t\t\tAllah will bring us together, and unto Him is the journeying."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/042016",
        "Body":  "And those who argue concerning Allah after He hath been\n\t\t\tacknowledged, their argument hath no weight with their Lord, and\n\t\t\twrath is upon them and theirs will be an awful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/042017",
        "Body":  "Allah it is who hath revealed the Scripture with truth, and the\n\t\t\tBalance. How canst thou know? It may be that the Hour is nigh."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/042018",
        "Body":  "Those who believe not therein seek to hasten it, while those who\n\t\t\tbelieve are fearful of it and know that it is the Truth. Are not\n\t\t\tthey who dispute, in doubt concerning the Hour, far astray?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/042019",
        "Body":  "Allah is gracious unto His slaves. He provideth for whom He will.\n\t\t\tAnd He is the Strong, the Mighty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/042002",
        "Body":  "Ain. Sin. Qaf."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/042020",
        "Body":  "Whoso desireth the harvest of the Hereafter, We give him increase\n\t\t\tin its harvest. And Whoso desireth the harvest of the world, We\n\t\t\tgive him thereof, and he hath no portion in the Hereafter."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/042021",
        "Body":  "Or have they partners (of Allah) who have made lawful for them in\n\t\t\treligion that which Allah allowed not? And but for a decisive\n\t\t\tword (gone forth already), it would have been judged between\n\t\t\tthem. Lo! for wrong-doers is a painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/042022",
        "Body":  "Thou seest the wrong-doers fearful of that which they have\n\t\t\tearned, and it will surely befall them; while those who believe\n\t\t\tand do good works (will be) in flowering meadows of the Gardens,\n\t\t\thaving what they wish from their Lord. This is the great\n\t\t\tpreferment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/042023",
        "Body":  "This it is which Allah announceth unto His bondmen who believe\n\t\t\tand do good works. Say (O Muhammad, unto mankind): I ask of you\n\t\t\tno fee therefor, save loving kindness among kinsfolk. And whoso\n\t\t\tscoreth a good deed we add unto its good for him. Lo! Allah is\n\t\t\tForgiving, Responsive."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/042024",
        "Body":  "Or say they: He hath invented a lie concerning Allah? If Allah\n\t\t\twilled, He could have sealed thy heart (against them). And Allah\n\t\t\twill wipe out the lie and will vindicate the truth by His words.\n\t\t\tLo! He is aware of what is hidden in the breasts (of men)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/042025",
        "Body":  "And He it is Who accepteth repentance from his bondmen, and\n\t\t\tpardoneth the evil deeds, and knoweth what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/042026",
        "Body":  "And accepteth those who do good works, and giveth increase unto\n\t\t\tthem of His bounty. And as for disbelievers, theirs will be an\n\t\t\tawful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/042027",
        "Body":  "And if Allah were to enlarge the provision for His slaves they\n\t\t\twould surely rebel in the earth, but He sendeth down by measure\n\t\t\tas He willeth. Lo! He is Informed, a Seer of His bondmen."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/042028",
        "Body":  "And He it is Who sendeth down the saving rain after they have\n\t\t\tdespaired, and spreadeth out His mercy. He is the Protecting\n\t\t\tFriend, the Praiseworthy."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/042029",
        "Body":  "And of His portents is the creation of the heaven and the earth,\n\t\t\tand of whatever beasts He hath dispersed therein. And He is Able\n\t\t\tto gather them when He will."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/042003",
        "Body":  "Thus Allah the Mighty, the Knower inspireth thee (Muhammad) as\n\t\t\t(He inspired) those before thee."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/042030",
        "Body":  "Whatever of misfortune striketh you, it is what your right hands\n\t\t\thave earned. And He forgiveth much."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/042031",
        "Body":  "Ye cannot escape in the earth, for beside Allah ye have no\n\t\t\tprotecting friend nor any helper."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/042032",
        "Body":  "And of His portents are the ships, like banners on the sea;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/042033",
        "Body":  "If He will He calmeth the wind so that they keep still upon its\n\t\t\tsurface Lo! herein verily are signs for every steadfast grateful\n\t\t\t(heart)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/042034",
        "Body":  "Or he causeth them to perish on account of that which they have\n\t\t\tearned And He forgiveth much--"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/042035",
        "Body":  "And that those who argue concerning Our revelations may know they\n\t\t\thave no refuge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/042036",
        "Body":  "Now whatever ye have been given is but a passing comfort for the\n\t\t\tlife of the world, and that which Allah hath is better and more\n\t\t\tlasting for those who believe and put their trust in their Lord."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/042037",
        "Body":  "And those who shun the worst of sins and indecencies and, when\n\t\t\tthey are wroth, forgive,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/042038",
        "Body":  "And those who answer the call of their Lord and establish\n\t\t\tworship, and whose affairs are a matter of counsel, and who spend\n\t\t\tof what We have bestowed on them,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/042039",
        "Body":  "And those who, when great wrong is done to them, defend\n\t\t\tthemselves,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/042004",
        "Body":  "Unto Him belongeth all that is in the heavens and all that is in\n\t\t\tthe earth, and He is the Sublime, the Tremendous."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/042040",
        "Body":  "The guerdon of an ill deed is an ill the like thereof. But\n\t\t\twhosoever pardoneth and amendeth, his wage is the affair of\n\t\t\tAllah. Lo! He loveth not wrong doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/042041",
        "Body":  "And whoso defendeth himself after he hath suffered wrong for\n\t\t\tsuch, there is no way (of blame) against them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/042042",
        "Body":  "The way (of blame) is only against those who oppress mankind, and\n\t\t\twrongfully rebel in the earth. For such there is a painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/042043",
        "Body":  "And verily whoso is patient and forgiveth, lo! that, verily, is\n\t\t\t(of) the steadfast heart of things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/042044",
        "Body":  "He whom Allah sendeth astray, for him there is no protecting\n\t\t\tfriend after Him. And thou (Muhammad) wilt see the evil doers\n\t\t\twhen they see the doom, (how) they say: Is there any way of\n\t\t\treturn?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/042045",
        "Body":  "And thou wilt see them exposed to (the Fire), made humble by\n\t\t\tdisgrace, and looking with veiled eyes. And those who believe\n\t\t\twill say: Lo! the (eternal) losers are they who lose themselves\n\t\t\tand their housefolk on the Day of Resurrection. Lo! are not the\n\t\t\twrong-doers in perpetual torment?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/042046",
        "Body":  "And they will have no protecting friends to help them instead of\n\t\t\tAllah. He whom Allah sendeth astray, for him there is no road."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/042047",
        "Body":  "Answer the call of your Lord before there cometh unto you from\n\t\t\tAllah a Day which there is no averting. Ye have no refuge on that\n\t\t\tDay, nor have ye any (power of) refusal."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/042048",
        "Body":  "But if they are averse, We have not sent thee as a warder over\n\t\t\tthem. Thine is only to convey (the message). And lo! when We\n\t\t\tcause man to taste of mercy from Us he exulteth therefor. And if\n\t\t\tsome evil striketh them because of that which their own hands\n\t\t\thave sent before, then lo! man is an ingrate."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/042049",
        "Body":  "Unto Allah belongeth the sovereignty of the heavens and the\n\t\t\tearth. He createth what He will. He bestoweth female (offspring)\n\t\t\tupon whom He will, and bestoweth male (offspring) upon whom He\n\t\t\twill;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/042005",
        "Body":  "Almost might the heavens above be rent asunder while the angels\n\t\t\thymn the praise of their Lord and ask forgiveness for those on\n\t\t\tthe earth. Lo! Allah is the Forgiver, the Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/042050",
        "Body":  "Or He mingleth them, males and females, and He maketh barren whom\n\t\t\tHe will. Lo! He is Knower, Powerful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/042051",
        "Body":  "And it was not (vouchsafed) to any mortal that Allah should speak\n\t\t\tto him unless (it be) by revelation or from behind a veil, or\n\t\t\t(that) He sendeth a messenger to reveal what He will by His\n\t\t\tleave. Lo! He is Exalted, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/042052",
        "Body":  "And thus have We inspired in thee (Muhammad) a Spirit of Our\n\t\t\tcommand. Thou knewest not what the Scripture was, nor what the\n\t\t\tFaith. But We have made it a light whereby We guide whom We will\n\t\t\tof Our bondmen. And lo! thou verily dost guide unto a right path."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/042053",
        "Body":  "The path of Allah, unto Whom belongeth whatsoever is in the\n\t\t\theavens and whatsoever is in the earth. Do not all things reach\n\t\t\tAllah at last?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/042006",
        "Body":  "And as for those who choose protecting friends beside Him, Allah\n\t\t\tis Warden over them, and thou art in no wise a guardian over\n\t\t\tthem."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/042007",
        "Body":  "And thus we have inspired in thee a Lecture in Arabic, that thou\n\t\t\tmayest warn the mother town and those around it, and mayest warn\n\t\t\tof a day of assembling whereof there is no doubt. A host will be\n\t\t\tin the Garden, and a host of them in the Flame."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/042008",
        "Body":  "Had Allah willed, He could have made them one community, but\n\t\t\tAllah bringeth whom He will into His mercy. And the wrong-doers\n\t\t\thave no friend nor helper."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "42",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/042009",
        "Body":  "Or have they chosen protecting friends besides Him? But Allah, He\n\t\t\t(alone) is the Protecting Friend. He quickeneth the dead, and He\n\t\t\tis Able to do all things."
    }
]
