[
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "1",
    "Text": "Indeed, Allah has heard the argument of the woman who pleaded with you &#761;O Prophet&#762; concerning her husband, and appealed to Allah. Allah has heard your exchange.<span class='fn' foot_note=29959>1</span>&nbsp;Surely Allah is All-Hearing, All-Seeing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "2",
    "Text": "Those of you who &#761;sinfully&#762; divorce their wives by comparing them to their mothers &#761;should know that&#762; their wives are in no way their mothers. None can be their mothers except those who gave birth to them. What they say is certainly detestable and false. Yet Allah is truly Ever-Pardoning, All-Forgiving."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "3",
    "Text": "Those who divorce their wives in this manner, then &#761;wish to&#762; retract what they said, must free a slave before they touch each other. This &#761;penalty&#762; is meant to deter you. And Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "4",
    "Text": "But if the husband cannot afford this, let him then fast two consecutive months before the couple touch each other. But if he is unable &#761;to fast&#762;, then let him feed sixty poor people. This is to re-affirm your faith in Allah and His Messenger. These are the limits set by Allah. And the disbelievers will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "5",
    "Text": "Indeed, those who defy Allah and His Messenger will be debased, just like those before them. We have certainly sent down clear revelations. And the disbelievers will suffer a humiliating punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "6",
    "Text": "On the Day Allah resurrects them all together, He will then inform them of what they have done. Allah has kept account of it all, while they have forgotten it. For Allah is a Witness over all things."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "7",
    "Text": "Do you not see that Allah knows whatever is in the heavens and whatever is on the earth? If three converse privately, He is their fourth. If five, He is their sixth. Whether fewer or more, He is with them<span class='fn' foot_note=29960>1</span>&nbsp;wherever they may be. Then, on the Day of Judgment, He will inform them of what they have done. Surely Allah has &#761;perfect&#762; knowledge of all things."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "8",
    "Text": "Have you not seen those who were forbidden from secret talks, yet they &#761;always&#762; return to what they were forbidden from, conspiring in sin, aggression, and disobedience to the Messenger? And when they come to you &#761;O Prophet&#762;, they greet you not as Allah greets you,<span class='fn' foot_note=29961>1</span>&nbsp;and say to one another, &ldquo;Why does Allah not punish us for what we say?&rdquo; Hell is enough for them&mdash;they will burn in it. And what an evil destination!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "9",
    "Text": "O believers! When you converse privately, let it not be for sin, aggression, or disobedience to the Messenger, but let it be for goodness and righteousness. And fear Allah, to Whom you will &#761;all&#762; be gathered."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "10",
    "Text": "Secret talks are only inspired by Satan to grieve the believers. Yet he cannot harm them whatsoever except by Allah&rsquo;s Will. So in Allah let the believers put their trust."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "11",
    "Text": "O believers! When you are told to make room in gatherings, then do so. Allah will make room for you &#761;in His grace&#762;. And if you are told to rise, then do so. Allah will elevate those of you who are faithful, and &#761;raise&#762; those gifted with knowledge in rank. And Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "12",
    "Text": "O believers! When you consult the Messenger privately, give something in charity before your consultation. That is better and purer for you. But if you lack the means, then Allah is truly All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "13",
    "Text": "Are you afraid of spending in charity before your private consultations &#761;with him&#762;? Since you are unable to do so, and Allah has turned to you in mercy, then &#761;continue to&#762; establish prayer, pay alms-tax, and obey Allah and His Messenger. And Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "14",
    "Text": "Have you not seen those &#761;hypocrites&#762; who ally themselves with a people with whom Allah is displeased? They are neither with you nor with them. And they swear to lies knowingly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "15",
    "Text": "Allah has prepared for them a severe punishment. Evil indeed is what they do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "16",
    "Text": "They have made their &#761;false&#762; oaths as a shield, hindering &#761;others&#762; from the cause of Allah. So they will suffer a humiliating punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "17",
    "Text": "Neither their wealth nor children will be of any help to them against Allah whatsoever. It is they who will be the residents of the Fire. They will be there forever."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "18",
    "Text": "On the Day Allah resurrects them all, they will &#761;falsely&#762; swear to Him as they swear to you, thinking they have something to stand on. Indeed, it is they who are the &#761;total&#762; liars."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "19",
    "Text": "Satan has taken hold of them, causing them to forget the remembrance of Allah. They are the party of Satan. Surely Satan&rsquo;s party is bound to lose."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "20",
    "Text": "&#761;As for&#762; those who defy Allah and His Messenger, they will definitely be among the most debased."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "21",
    "Text": "Allah has decreed, &ldquo;I and My messengers will certainly prevail.&rdquo; Surely Allah is All-Powerful, Almighty."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "58",
    "AyahNumber": "22",
    "Text": "You will never find a people who &#761;truly&#762; believe in Allah and the Last Day loyal to those who defy Allah and His Messenger, even if they were their parents, children, siblings, or extended family. For those &#761;believers&#762;, Allah has instilled faith in their hearts and strengthened them with a spirit from Him.<span class='fn' foot_note=29962>1</span>&nbsp;He will admit them into Gardens under which rivers flow, to stay there forever. Allah is pleased with them and they are pleased with Him. They are the party of Allah. Indeed, Allah&rsquo;s party is bound to succeed."
  }
]
