[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/058001",
        "Body":  "Allah hath heard the saying of her that disputeth with thee\n\t\t\t(Muhammad) concerning her husband, and complaineth unto Allah.\n\t\t\tAnd Allah heareth your colloquy. Lo! Allah is Hearer, Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/058010",
        "Body":  "Lo! Conspiracy is only of the devil, that he may vex those who\n\t\t\tbelieve; but he can harm them not at all unless by Allah\u0027s leave.\n\t\t\tIn Allah let believers put their trust."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/058011",
        "Body":  "O ye who believe! When it is said, Make room! in assemblies, then\n\t\t\tmake room; Allah will make way for you (hereafter). And when it\n\t\t\tis said, Come up higher! go up higher; Allah will exalt those who\n\t\t\tbelieve among you, and those who have knowledge, to high ranks.\n\t\t\tAllah is informed of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/058012",
        "Body":  "O ye who believe! When ye hold conference with the messenger,\n\t\t\toffer an alms before your conference. That is better and purer\n\t\t\tfor you. But if ye cannot find (the wherewithal) then lo! Allah\n\t\t\tis Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/058013",
        "Body":  "Fear ye to offer alms before your conference? Then, when ye do it\n\t\t\tnot and Allah hath forgiven you, establish worship and pay the\n\t\t\tpoor due and obey Allah and His messenger. And Allah is Aware of\n\t\t\twhat ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/058014",
        "Body":  "Hast thou not seen those who take for friends a folk with whom\n\t\t\tAllah is wroth? They are neither of you nor of them, and they\n\t\t\tswear a false oath knowingly."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/058015",
        "Body":  "Allah hath prepared for them a dreadful doom. Evil indeed is that\n\t\t\twhich they are wont to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/058016",
        "Body":  "They make a shelter of their oaths and turn (men) from the way of\n\t\t\tAllah; so theirs will be a shameful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/058017",
        "Body":  "Their wealth and their children will avail them naught against\n\t\t\tAllah. Such are rightful owners of the Fire; they will abide\n\t\t\ttherein."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/058018",
        "Body":  "On the day when Allah will raise them all together, then will\n\t\t\tthey swear unto Him as they (now) swear unto you, and they will\n\t\t\tfancy that they have some standing. Lo! is it not they who are\n\t\t\tthe liars?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/058019",
        "Body":  "The devil hath engrossed them and so hath caused them to forget\n\t\t\tremembrance of Allah. They are the devil\u0027s party. Lo! is it not\n\t\t\tthe devil\u0027s party who will be the losers?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/058002",
        "Body":  "Such of you as put away your wives (by saying they are as their\n\t\t\tmothers) They are not their mothers; none are their mothers\n\t\t\texcept those who gave them birth--they indeed utter an ill word\n\t\t\tand a lie. And lo! Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/058020",
        "Body":  "Lo! those who oppose Allah and His messenger, they will be among\n\t\t\tthe lowest."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/058021",
        "Body":  "Allah hath decreed: Lo! I verily shall conquer, I and My\n\t\t\tmessengers. Lo! Allah is Strong, Almighty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/058022",
        "Body":  "Thou wilt not find folk who believe in Allah and the Last Day\n\t\t\tloving those who oppose Allah and His messenger: even though they\n\t\t\tbe their fathers or, their sons or their brethren or their clan.\n\t\t\tAs for such, He hath written faith upon their hearts and hath\n\t\t\tstrengthened them with a Spirit from Him, and He will bring them\n\t\t\tinto Gardens underneath which rivers flow, wherein they will\n\t\t\tabide. Allah is well pleased with them, and they are well pleased\n\t\t\twith Him. They are Allah\u0027s party. Lo! is it not Allah\u0027s party who\n\t\t\tare the successful?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/058003",
        "Body":  "Those who put away their wives (by saying they are as their\n\t\t\tmothers) and afterward would go back on that which they have\n\t\t\tsaid; (the penalty) in that case (is) the freeing of a slave\n\t\t\tbefore they touch one another. Unto this ye are exhorted; and\n\t\t\tAllah is informed of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/058004",
        "Body":  "And he who findeth not (the wherewithal), let him fast for two\n\t\t\tsuccessive months before they touch one another; and for him who\n\t\t\tis unable to do so (the penance is) the feeding of sixty needy\n\t\t\tones. This, that ye may put trust in Allah and His messenger.\n\t\t\tSuch are the limits (imposed by Allah); and for disbelievers is a\n\t\t\tpainful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/058005",
        "Body":  "Those who oppose Allah and His messenger will be abased even\n\t\t\tthose before them were abased; and We have sent down clear\n\t\t\ttokens, and for disbelievers is a shameful doom"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/058006",
        "Body":  "On the day when Allah will raise them all together and inform\n\t\t\tthem of what they did. Allah hath kept account of it while they\n\t\t\tforgot it. And Allah is Witness over all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/058007",
        "Body":  "Hast thou not seen that Allah knoweth all that is in the heavens\n\t\t\tand all that is in the earth? There is no secret conference of\n\t\t\tthree but He is their fourth, nor of five but He is their sixth,\n\t\t\tnor of less than that or more but He is with them wheresoever\n\t\t\tthey may be; and afterward, on the Day of Resurrection, He will\n\t\t\tinform them of what they did Lo! Allah is Knower of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/058008",
        "Body":  "Hast thou not observed those who were forbidden conspiracy and\n\t\t\tafterward returned to that which they had been forbidden, and\n\t\t\t(now) conspire together for crime and wrongdoing and disobedience\n\t\t\ttoward the messenger? And when they come unto thee they greet\n\t\t\tthee with a greeting wherewith Allah greeteth thee not, and say\n\t\t\twithin themselves: Why should Allah punish us for what we say?\n\t\t\tHell will suffice them; they will feel the heat thereof. A\n\t\t\thapless journey\u0027s end!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "58",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/058009",
        "Body":  "O ye who believe! when ye conspire together, conspire not\n\t\t\ttogether for crime and wrongdoing and disobedience toward the\n\t\t\tmessenger, but conspire together for righteousness and pity, and\n\t\t\tkeep your duty, toward Allah, unto whom ye will be gathered."
    }
]
