[
  {
    "SurahNumber": "19",
    "AyahNumber": "1",
    "Text": "Kaf Ha' Ya' 'Ayn Suad."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "2",
    "Text": "This is a reminder of blessings that your Rabb bestowed on His\\n\\t\\t\\tservant Zakariya,"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "3",
    "Text": "when he invoked his Rabb in secret,"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "4",
    "Text": "saying: \"O Rabb! Surely my bones have weakened and the hair of my\\n\\t\\t\\thead glisten with grey, while I have never been disappointed in\\n\\t\\t\\tmy prayer to You, O Rabb!"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "5",
    "Text": "Yet I fear about my relatives after me, for my wife is barren,\\n\\t\\t\\tgrant me a heir by Your grace"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "6",
    "Text": "who should inherit me and inherit the posterity of Ya'qoob, and\\n\\t\\t\\tmake him, O my Rabb, a desirable person!\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "7",
    "Text": "We answered his prayer saying: \"O Zakariya! Surely We give you\\n\\t\\t\\tthe good news of a son, his name shall be Yahya (John): a name\\n\\t\\t\\tthat no one has had before him\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "8",
    "Text": "He asked: \"O Rabb! How shall I have a son when my wife is barren\\n\\t\\t\\tand I have become impotent from old age?\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "9",
    "Text": "The answer came: \"So shall it be. Your Rabb says: 'It shall not\\n\\t\\t\\tbe a difficult task for Me, just as I created you before, when\\n\\t\\t\\tyou were nothing at all!\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "10",
    "Text": "Zakariya said \"O my Rabb! Give me a Sign\". He said: \"Your sign is\\n\\t\\t\\tthat for three nights you shall not be able to speak to the\\n\\t\\t\\tpeople even being sound in health\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "11",
    "Text": "After this Zakariya came out of the shrine and asked his people,\\n\\t\\t\\tthrough sign language, to glorify Allah in the morning and in the\\n\\t\\t\\tevening."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "12",
    "Text": "To Yahya, when he became old enough, We said: \" Hold firmly to\\n\\t\\t\\tthe Book.\" We granted him wisdom, while he was yet a boy,"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "13",
    "Text": "and also granted him kindness and purity by Our grace, and he\\n\\t\\t\\tgrew up a pious man;"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "14",
    "Text": "dutiful to his parents - he was neither arrogant nor disobedient."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "15",
    "Text": "Peace be on him the day he was born, the day of his death and the\\n\\t\\t\\tDay he will be raised to life again!"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "16",
    "Text": "O Muhammad, relate to them the story of Maryam in the Book (The\\n\\t\\t\\tQur'an) when she withdrew from her family to a place in the East."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "17",
    "Text": "She chose to be secluded from them. We sent to her Our angel and\\n\\t\\t\\the appeared before her as a grown up man."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "18",
    "Text": "She said: \"I seek Rahman's (Allah's) protection against you,\\n\\t\\t\\tleave me alone if you are Godfearing\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "19",
    "Text": "He said: \"Don't be afraid, I am merely a messenger from your Rabb\\n\\t\\t\\tto tell you about the gift of a holy son\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "20",
    "Text": "She said: \"How shall I bear a son, no man has ever touched me nor\\n\\t\\t\\tam I unchaste?\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "21",
    "Text": "The angel replied: \"So shall it be - Your Rabb says: `It is easy\\n\\t\\t\\tfor Me. We wish to make him a Sign for mankind and a blessing\\n\\t\\t\\tfrom Us' - and this matter has already been decreed\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "22",
    "Text": "So she conceived the child and she retired with him to a remote\\n\\t\\t\\tplace."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "23",
    "Text": "The pains of childbirth drove her to the trunk of a palm-tree.\\n\\t\\t\\tShe cried in her anguish: \"Ah! Would that I had died before this,\\n\\t\\t\\tand been long forgotten!\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "24",
    "Text": "An angel from beneath the palm-tree consoled her, saying: \"Do not\\n\\t\\t\\tgrieve! Your Rabb has provided a brook at your feet."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "25",
    "Text": "If you shake the trunk of this palm-tree, it will drop fresh ripe\\n\\t\\t\\tdates in your lap."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "26",
    "Text": "So eat, drink and refresh yourself. If you see anyone, tell him:\\n\\t\\t\\t`I have vowed a fast to Rahman (Allah), so I will not speak to\\n\\t\\t\\tanyone today'.\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "27",
    "Text": "Carrying the baby, she came back to her people. They said: \"O\\n\\t\\t\\tMaryam! You have brought something hard to believe!"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "28",
    "Text": "O sister (a woman from the noble family) of Haroon! Your father\\n\\t\\t\\twas not a bad man nor your mother an unchaste woman\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "29",
    "Text": "In response she merely pointed towards the baby. They said: \"How\\n\\t\\t\\tcan we talk to a babe in the cradle?\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "30",
    "Text": "Whereupon the baby spoke out: \"I am indeed a servant of Allah. He\\n\\t\\t\\thas given me the Book and made me a Prophet."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "31",
    "Text": "His blessing is with me wherever I go. He has commanded me to\\n\\t\\t\\testablish Salah and give Zakah as long as I shall live."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "32",
    "Text": "He has exhorted me to honor my mother and has not made me\\n\\t\\t\\tdomineering, hard to deal with."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "33",
    "Text": "Peace be upon me the day I was born, the day I shall die and the\\n\\t\\t\\tDay I shall be raised to life again\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "34",
    "Text": "Such was Isa (Jesus) the son of Maryam, and this is the True\\n\\t\\t\\tstatement about him concerning which they are in doubt."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "35",
    "Text": "It is not befitting to the majesty of Allah that He Himself\\n\\t\\t\\tshould beget a son! He is far above this (weakness to get a son\\n\\t\\t\\tfor name, fame, help or continuity of race); for when He decrees\\n\\t\\t\\ta matter He need only say: \"Be\" and it is."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "36",
    "Text": "Isa declared, Verily Allah is my Rabb and your Rabb: therefore\\n\\t\\t\\tserve Him. This is a Right Way."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "37",
    "Text": "Inspite of this, the sects from among them are divided concerning\\n\\t\\t\\tJesus. So woe to the disbelievers who shall be punished after\\n\\t\\t\\twitnessing this Truth on the Great Day of Judgement."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "38",
    "Text": "They will be able to see and hear very clearly on that Day when\\n\\t\\t\\tthey will appear before Us! But today these wrong doers, neither\\n\\t\\t\\twant to hear nor see the Truth and, are in manifest error."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "39",
    "Text": "O Muhammad, forewarn them about the Day of intense regret when\\n\\t\\t\\tthis matter will be decided, even though at present they are\\n\\t\\t\\tpaying no heed and do not believe."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "40",
    "Text": "Ultimately, all things will perish and it is We, Who will inherit\\n\\t\\t\\tthe earth and all that is on it, and to Us shall they return."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "41",
    "Text": "Relate to them the story of Ibrahim from the Book (The Qur'an),\\n\\t\\t\\the was a truthful Prophet."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "42",
    "Text": "Remember when he said to his father: \"O my father! Why do you\\n\\t\\t\\tworship something that can neither hear nor see, nor yet profit\\n\\t\\t\\tyou in any way?"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "43",
    "Text": "O my father! I have been given some knowledge which has not come\\n\\t\\t\\tto you, so follow me: I'll guide you to the Right Way."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "44",
    "Text": "O my father! Do not worship Shaitan: for Shaitan is disobedient\\n\\t\\t\\tto the Compassionate (Allah)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "45",
    "Text": "O my father! I fear that a punishment of the Beneficent may\\n\\t\\t\\tafflict you, and you may become a friend of the Shaitan\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "46",
    "Text": "His father replied: \"How dare you renounce my gods O Ibrahim? If\\n\\t\\t\\tyou do not stop this folly, I will indeed stone you to death: so\\n\\t\\t\\tbe gone from my house this very moment!\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "47",
    "Text": "Ibrahim said: \"Peace be upon you: I will pray to my Rabb for your\\n\\t\\t\\tforgiveness, surely He is ever Kind to me."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "48",
    "Text": "I am leaving you and those whom you invoke besides Allah: I will\\n\\t\\t\\tcall upon my Rabb and I am sure my prayers to my Rabb will not be\\n\\t\\t\\tignored\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "49",
    "Text": "So when he left them and the deities whom they worshipped besides\\n\\t\\t\\tAllah, We granted him descendants like Ishaq and Ya'qoob, and We\\n\\t\\t\\tmade each of them a Prophet."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "50",
    "Text": "We bestowed on them Our Mercy and We granted them honor of being\\n\\t\\t\\tmentioned with true high respect."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "51",
    "Text": "Relate to them the story of Musa in the Book; surely he was a\\n\\t\\t\\tchosen man and was a Rasool, a Prophet."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "52",
    "Text": "We called him from the right side of Mount Tur and honored him to\\n\\t\\t\\tcome closer for exclusive conversation."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "53",
    "Text": "We made his brother Haroon a Prophet with Our blessing and\\n\\t\\t\\tassigned him as his assistant."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "54",
    "Text": "Also relate to them the story of Isma`il in the Book; he was a\\n\\t\\t\\tman of his word and was a Rasool, a Prophet."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "55",
    "Text": "He commanded his people to establish Salah and give Zakah, and\\n\\t\\t\\twas the one with whom his Rabb was well pleased."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "56",
    "Text": "Also relate to them the story of Idris in the Book; he was a\\n\\t\\t\\tTruthful man, a Prophet."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "57",
    "Text": "Whom We raised to a lofty place."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "58",
    "Text": "These are some of the Prophets on whom Allah bestowed His favors\\n\\t\\t\\tfrom among the descendants of Adam and of those whom We carried\\n\\t\\t\\tin the Ark with Nuh, and of the descendants of Ibrahim and\\n\\t\\t\\tIsrael, and of those whom We guided and chose. Whenever the\\n\\t\\t\\tRevelations of the Compassionate (Allah) were recited to them,\\n\\t\\t\\tthey fell to prostrate and weep."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "59",
    "Text": "But the generations who succeeded them abandoned the Salah and\\n\\t\\t\\tstarted following their lusts; so they will soon face the\\n\\t\\t\\tconsequences of their deviation."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "60",
    "Text": "However, those who repent, become believers and do good deeds,\\n\\t\\t\\twill be admitted to Paradise and will not be wronged in the\\n\\t\\t\\tleast."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "61",
    "Text": "They will be granted the Gardens of Eden which the Merciful has\\n\\t\\t\\tpromised to His servants, even though they have not seen them,\\n\\t\\t\\tand His promise shall be fulfilled."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "62",
    "Text": "There they will hear no nonsense, but only the words of peace;\\n\\t\\t\\tand they will be provided their sustenance day and night."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "63",
    "Text": "Such is the Paradise which We shall give as an inheritance to\\n\\t\\t\\tthose of Our Servants who lead a pious life."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "64",
    "Text": "The angle Gabriel who brought this revelation after a long\\n\\t\\t\\tinterval said: \"We do not descend from heaven except by the\\n\\t\\t\\tcommand of your Rabb; to Him belongs whatever is before us and\\n\\t\\t\\twhatever is behind us and all that lies in between. Your Rabb is\\n\\t\\t\\tnever forgetful."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "65",
    "Text": "He is the Rabb of the heavens and the earth, and of all that lies\\n\\t\\t\\tin between, so worship Him, be steadfast in His worship. Do you\\n\\t\\t\\tknow any other being with the qualities like Him?\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "66",
    "Text": "Man says: \"What! Once I am dead, shall I be raised to life\\n\\t\\t\\tagain?\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "67",
    "Text": "Does not the man remember that We created him before out of\\n\\t\\t\\tnothing?"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "68",
    "Text": "By your Rabb, We will call them to account in the company of all\\n\\t\\t\\ttheir shaitans and set them on their knees around the Fire of\\n\\t\\t\\tHell;"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "69",
    "Text": "then from every sect We will certainly drag out its stoutest\\n\\t\\t\\trebels against the Compassionate (Allah)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "70",
    "Text": "Certainly We know best who deserves most to be burned therein."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "71",
    "Text": "There is not a single one of you, who shall not pass over it,\\n\\t\\t\\tthis absolute decree of your Rabb is unavoidable;"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "72",
    "Text": "then We will deliver those who were pious during their life on\\n\\t\\t\\tearth and leave the wrongdoers therein humbled on their knees."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "73",
    "Text": "When Our Clear Revelations are recited to them the unbelievers\\n\\t\\t\\tsay to the believer: \"Which one, of the two of us, have fine\\n\\t\\t\\tdwelling and better companions?\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "74",
    "Text": "Don't they see, how many generations have We destroyed before\\n\\t\\t\\tthem, who were far greater in riches and in splendor?"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "75",
    "Text": "Tell them: \"Anyone who has gone astray, the Compassionate (Allah)\\n\\t\\t\\tprolongs his respite and extends an opportunity until they see\\n\\t\\t\\tabout which they were warned; - be it a worldly scourge or the\\n\\t\\t\\tHour of Doom - then they will realize whose is the worst dwelling\\n\\t\\t\\tand whose are the weak companions?"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "76",
    "Text": "In fact, Allah increases in guidance those who seek guidance;\\n\\t\\t\\teverlasting are only the good deeds, which are the best in the\\n\\t\\t\\tsight of your Rabb to earn you a better reward and yield you the\\n\\t\\t\\tbest fruit?\""
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "77",
    "Text": "Have you noticed the words of that person who rejects Our\\n\\t\\t\\tRevelations yet boasts: \"I shall always be given wealth and\\n\\t\\t\\tchildren\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "78",
    "Text": "Has he gained knowledge of the Unseen or has he been awarded a\\n\\t\\t\\tcontract by the Compassionate (Allah)?"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "79",
    "Text": "By no means! We write down what he says and We will make his\\n\\t\\t\\tpunishment long and terrible."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "80",
    "Text": "We will inherit all that he boasts of, and he will come back to\\n\\t\\t\\tUs all alone leaving all these things behind."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "81",
    "Text": "They have taken other deities for worship besides Allah, so that\\n\\t\\t\\tthey should be a source of strength to them."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "82",
    "Text": "By no means! Those very deities will renounce their worship and\\n\\t\\t\\tturn against them on the Day of Judgement."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "83",
    "Text": "Don't you see that We have sent down to the unbelievers shaitans\\n\\t\\t\\twho incite them against the Truth?"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "84",
    "Text": "Therefore be not in haste against them, their days are numbered."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "85",
    "Text": "The Day will surely come when We will gather the righteous like\\n\\t\\t\\thonored guests before the Compassionate (Allah),"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "86",
    "Text": "and drive the criminals to Hell like thirsty cattle are driven to\\n\\t\\t\\twater."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "87",
    "Text": "None shall have the power to intercede except the one who may\\n\\t\\t\\treceive the sanction of the Compassionate (Allah)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "88",
    "Text": "Those who say: \"The Compassionate (God) has begotten a son,"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "89",
    "Text": "\" certainly preach such a monstrous falsehood,"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "90",
    "Text": "that the very Heavens might crack, the earth might cleave asunder\\n\\t\\t\\tand the mountains might crumble to pieces"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "91",
    "Text": "- at their ascribing a son to the Compassionate (God),"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "92",
    "Text": "It is not befitting to the Compassionate (God) that He should\\n\\t\\t\\tbeget a son."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "93",
    "Text": "There is none in the heavens and in the earth but must come to\\n\\t\\t\\tthe Compassionate (Allah) in full submission."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "94",
    "Text": "He has a comprehensive knowledge and has kept strict count of all\\n\\t\\t\\tHis creatures,"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "95",
    "Text": "and every one of them will come to Him individually on the Day of\\n\\t\\t\\tResurrection."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "96",
    "Text": "Surely the Beneficent will bring about love for those who believe\\n\\t\\t\\tand do good deeds."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "97",
    "Text": "We have made this Qur'an easy in your own language so that you\\n\\t\\t\\tmay give good news to the righteous and warn the headstrong\\n\\t\\t\\tcontentious folk."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "98",
    "Text": "How many generations have We destroyed before them! Can you see\\n\\t\\t\\tany of them, or hear even a sound of them?"
  }
]
