[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/065001",
        "Body":  "O Prophet! When ye (men) put away women, put them away for their\n\t\t\t(legal) period and reckon the period, and keep your duty to\n\t\t\tAllah, your Lord. Expel them not from their houses nor let them\n\t\t\tgo forth unless they commit open immorality. Such are the limits\n\t\t\t(imposed by) Allah; and whoso transgresseth Allah\u0027s limits, he\n\t\t\tverily wrongeth his soul. Thou knowest not: it may be that Allah\n\t\t\twill afterward bring some new thing to pass."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/065010",
        "Body":  "Allah hath prepared for them stern punishment; so keep your duty\n\t\t\tto Allah, O men of understanding! O ye who believe! Now Allah\n\t\t\thath sent down unto you a reminder,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/065011",
        "Body":  "A messenger reciting unto you the revelations of Allah made\n\t\t\tplain, that He may bring forth those who believe and do good\n\t\t\tworks from darkness unto light. And whosoever believeth in Allah\n\t\t\tand doeth right, He will bring him into Gardens underneath which\n\t\t\trivers flow, therein to abide for ever. Allah hath made good\n\t\t\tprovision for him."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/065012",
        "Body":  "Allah it is who hath created seven heavens, and of the earth the\n\t\t\tlike thereof. The commandment cometh down among them slowly, that\n\t\t\tye may know that Allah is Able to do all things, and that Allah\n\t\t\tsurroundeth all things in knowledge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/065002",
        "Body":  "Then, when they have reached their term, take them back in\n\t\t\tkindness or part from them in kindness, and call to witness two\n\t\t\tjust men among you, and keep your testimony upright for Allah.\n\t\t\tWhoso believeth in Allah and the Last Day is exhorted to act\n\t\t\tthus. And whosoever keepeth his duty to Allah, Allah will appoint\n\t\t\ta way out for him,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/065003",
        "Body":  "And will provide for him from (a quarter) whence he hath no\n\t\t\texpectation. And whosoever putteth his trust in Allah, He will\n\t\t\tsuffice him. Lo! Allah bringeth His command to pass. Allah hath\n\t\t\tset a measure for all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/065004",
        "Body":  "And for such of your women as despair of menstruation, if ye\n\t\t\tdoubt, their period (of waiting) shall be three months along with\n\t\t\tthose who have it not. And for those with child, their period\n\t\t\tshall be till they bring forth their burden. And whosoever\n\t\t\tkeepeth his duty to Allah, He maketh his course easy for him."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/065005",
        "Body":  "That is the commandment of Allah which He revealeth unto you. And\n\t\t\twhoso keepeth his duty to Allah, He will remit from him his evil\n\t\t\tdeeds and magnify reward for him."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/065006",
        "Body":  "Lodge them where ye dwell, according to your wealth, and harass\n\t\t\tthem not so as to straiten life for them. And if they are with\n\t\t\tchild, then spend for them till they bring forth their burden.\n\t\t\tThen, if they give suck for you, give them their due payment and\n\t\t\tconsult together in kindness; but if ye make difficulties for one\n\t\t\tanother, then let some other woman give suck for him (the father\n\t\t\tof the child)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/065007",
        "Body":  "Let him who hath abundance spend of his abundance, and he whose\n\t\t\tprovision is measured, let him spend of that which Allah hath\n\t\t\tgiven him. Allah asketh naught of any soul save that which He\n\t\t\thath given it. Allah will vouchsafe, after hardship, ease."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/065008",
        "Body":  "And how many a community revolted against the ordinance of its\n\t\t\tLord and His messenger, and we called it to a stern account and\n\t\t\tpunished it with dire punishment,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "65",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/065009",
        "Body":  "So that it tasted the ill effects of its conduct, and the\n\t\t\tconsequence of its conduct was loss."
    }
]
