[
  {
    "SurahNumber": "10",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "The term hakim - which, when qualifying an animated\\n\\t\\t\\t\\tbeing, may be translated as \"wise\" - has here the\\n\\t\\t\\t\\tconnotation of a means of imparting wisdom. Some of the\\n\\t\\t\\t\\tclassical commentators (e.g., Tabari) are of the opinion\\n\\t\\t\\t\\tthat the \"divine writ\" (kitab) mentioned here is the\\n\\t\\t\\t\\tQur'an as a whole, while others (e.g., Zamakhshari) see\\n\\t\\t\\t\\tin it a reference to this particular surah. In view of\\n\\t\\t\\t\\tthe sequence, it seems to me that the former\\n\\t\\t\\t\\tinterpretation is preferable."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "This connects with the end of the preceding surah, and\\n\\t\\t\\t\\tparticularly with the sentence, \"There has come unto you\\n\\t\\t\\t\\t[O mankind] an Apostle from among yourselves\" ( 9:128 ;\\n\\t\\t\\t\\tsee also note [2] on  50:2 )."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "2",
    "NoteID": "4",
    "Body": "Lit., \"they have precedence (qadam) of truthfulness\\n\\t\\t\\t\\t(sidq)\": the latter term denoting a concord between what\\n\\t\\t\\t\\ta person actually conceives in his mind or feels and what\\n\\t\\t\\t\\the expresses by word, deed or attitude - in other words,\\n\\t\\t\\t\\tcomplete sincerity."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "2",
    "NoteID": "5",
    "Body": "Lit., \"He is indeed an obvious enchanter (sahir)\" - thus\\n\\t\\t\\t\\timplying that the \"man from among yourselves\" (i.e.,\\n\\t\\t\\t\\tMuhammad) did not really receive any revelation from God,\\n\\t\\t\\t\\tbut merely deluded his followers by means of his\\n\\t\\t\\t\\tspellbinding eloquence (which is the meaning of sihr in\\n\\t\\t\\t\\tthis context): an accusation levelled by unbelievers of\\n\\t\\t\\t\\tall times not merely against Muhammad but - as the Qur'an\\n\\t\\t\\t\\tfrequently states - against most of the earlier prophets\\n\\t\\t\\t\\tas well. The term \"those who deny the truth\" refers, in\\n\\t\\t\\t\\tthis context, specifically to people who a priori reject\\n\\t\\t\\t\\tthe notion of divine revelation and, thus, of\\n\\t\\t\\t\\tprophethood."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "3",
    "NoteID": "6",
    "Body": "See surah {7}, note [43]. Since belief in divine\\n\\t\\t\\t\\trevelation naturally presupposes a belief in the\\n\\t\\t\\t\\texistence of God as the self-subsistent fount of all\\n\\t\\t\\t\\tbeing, the reference to the revelation of the Qur'an with\\n\\t\\t\\t\\twhich this surah opens is followed by a consideration of\\n\\t\\t\\t\\tGod's creative almightiness."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "3",
    "NoteID": "7",
    "Body": "Lit., \"there is no intercessor whatever, save after His\r\\n\\t\\t\\t\\tleave [has been granted]\". Cf.  2:255  - \"Who is there\r\\n\\t\\t\\t\\tthat could intercede with Him, unless it be by His\r\\n\\t\\t\\t\\tleave?\" Thus, the Qur'an rejects the popular belief in\r\\n\\t\\t\\t\\tunqualified \"intercession\" by living or dead saints or\r\\n\\t\\t\\t\\tprophets. As is shown elsewhere in the Qur'an (e.g., in\r\\n\\t\\t\\t\\t 20:109 ,  21:28  or  34:23 ), God will grant to His\r\\n\\t\\t\\t\\tprophets on Judgment Day the permission to \"intercede\",\r\\n\\t\\t\\t\\tsymbolically, for such of the sinners as will have\r\\n\\t\\t\\t\\talready achieved His redemptive acceptance (rida') by\r\\n\\t\\t\\t\\tvirtue of their repentance or basic goodness (see  19:87 \r\\n\\t\\t\\t\\tand the corresponding note [74]): in other words, the\r\\n\\t\\t\\t\\tright of \"intercession\" thus granted to the prophets will\r\\n\\t\\t\\t\\tbe but an expression of God's approval of the latter.\r\\n\\t\\t\\t\\tFurthermore, the above denial of the possibility of\r\\n\\t\\t\\t\\tunqualified intercession stresses, indirectly, not only\r\\n\\t\\t\\t\\tGod's omniscience - which requires no \"mediator\" - but\r\\n\\t\\t\\t\\talso the immutability of His will: and thus it connects\r\\n\\t\\t\\t\\twith the preceding mention of His almightiness. (See also\r\\n\\t\\t\\t\\tnote [27] below.)"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "4",
    "NoteID": "8",
    "Body": "I.e., He will resurrect him by a new act of creation.\\n\\t\\t\\t\\tThat the verb yu'iduhu (\"He brings him forth anew\")\\n\\t\\t\\t\\trefers here to the individual resurrection of human\\n\\t\\t\\t\\tbeings becomes obvious from the sequence. The noun khalq\\n\\t\\t\\t\\tprimarily denotes \"creation\" (i.e., the bringing into\\n\\t\\t\\t\\tbeing of something that did not exist before);\\n\\t\\t\\t\\tsubsequently, it denotes the result or object of\\n\\t\\t\\t\\tcreation, i.e., a \"created being\" (or \"beings\"); finally,\\n\\t\\t\\t\\tit is used in the sense of \"man\" in the generic\\n\\t\\t\\t\\tconnotation of this word, i.e., \"mankind\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "4",
    "NoteID": "9",
    "Body": "See surah {6}, note [62] (for my rendering of hamim as\\n\\t\\t\\t\\t\"burning despair\")."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "5",
    "NoteID": "10",
    "Body": "The nouns diya' and nur are often interchangeable,\r\\n\\t\\t\\t\\tinasmuch as both denote \"light\"; but many philologists\r\\n\\t\\t\\t\\tare of the opinion that the term diya' (or daw') has a\r\\n\\t\\t\\t\\tmore intensive connotation, and is used to describe \"a\r\\n\\t\\t\\t\\tlight which subsists by itself, as that of the sun and\r\\n\\t\\t\\t\\tfire\" - that is, a source of light - while nur signifies\r\\n\\t\\t\\t\\t\"a light that subsists by some other thing\" (Lane V,\r\\n\\t\\t\\t\\t1809, on the authority of Taj al-'Arus): in other words,\r\\n\\t\\t\\t\\tlight due to an extraneous source or - as in the case of\r\\n\\t\\t\\t\\tthe moon - reflected light."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "5",
    "NoteID": "11",
    "Body": "Lit., \"God has not created this otherwise than in\\n\\t\\t\\t\\taccordance with truth\" - i.e., to fulfil a definite\\n\\t\\t\\t\\tpurpose in consonance with His planning wisdom\\n\\t\\t\\t\\t(Zamakhshari, Baghawi, Razi): implying that everything in\\n\\t\\t\\t\\tthe universe - whether existent or potential, concrete or\\n\\t\\t\\t\\tabstract - is meaningful, and nothing is \"accidental\".\\n\\t\\t\\t\\tCf.  3:191  - \"O our Sustainer! Thou has not created\\n\\t\\t\\t\\t[aught of] this without meaning and purpose (batilan)\";\\n\\t\\t\\t\\tand  38:27  - \"We have not created heaven and earth and\\n\\t\\t\\t\\tall that is between them without meaning and purpose, as\\n\\t\\t\\t\\tis the surmise (zann) of those who are bent on denying\\n\\t\\t\\t\\tthe truth\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "7",
    "NoteID": "12",
    "Body": "Lit., \"who do not hope for [i.e., expect] a meeting with\\n\\t\\t\\t\\tUs\": implying that they do not believe in a life after\\n\\t\\t\\t\\tdeath or in God's ultimate judgment."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "7",
    "NoteID": "13",
    "Body": "Lit., \"are at rest with it\" - i.e., regard the life in\\n\\t\\t\\t\\tthis world as the only reality, dismissing the idea of\\n\\t\\t\\t\\tresurrection as mere wishful thinking."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "9",
    "NoteID": "14",
    "Body": "Lit., \"beneath them\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "10",
    "NoteID": "15",
    "Body": "Lit., \"their invocation (da'wa) therein [will be]...\",\\n\\t\\t\\t\\tetc."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "10",
    "NoteID": "16",
    "Body": "Lit., \"their greeting therein [will be], 'Peace'\". For an\\n\\t\\t\\t\\texplanation of the term salam and its fundamental\\n\\t\\t\\t\\tconnotation of inner peace, fulfilment, and security from\\n\\t\\t\\t\\tall that is evil, see surah {5}, note [29]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "11",
    "NoteID": "17",
    "Body": "Lit., \"[the end of] their term would indeed have been\\n\\t\\t\\t\\tdecreed for them\": the implication being, firstly, that\\n\\t\\t\\t\\tman is weak (cf.  4:28 ) and therefore prone to sinning;\\n\\t\\t\\t\\tsecondly, that God \"has willed upon Himself the law of\\n\\t\\t\\t\\tgrace and mercy\" (see  6:12  and the corresponding note)\\n\\t\\t\\t\\tand, consequently, does not punish sinners without taking\\n\\t\\t\\t\\ttheir circumstances into consideration and giving them\\n\\t\\t\\t\\ttime to repent and to mend their ways."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "11",
    "NoteID": "18",
    "Body": "See verse {7}, with which this verse connects."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "12",
    "NoteID": "19",
    "Body": "These three metaphorical expressions are often used in\\n\\t\\t\\t\\tthe Qur'an to describe the various situations in which\\n\\t\\t\\t\\tman may find himself. The \"calling unto God\" under the\\n\\t\\t\\t\\tstress of misfortune describes the instinctive reaction\\n\\t\\t\\t\\tof many people who consider themselves \"agnostics\" and in\\n\\t\\t\\t\\ttheir conscious thinking refuse to believe in God. See\\n\\t\\t\\t\\talso verses {22-23} below, as well as {6:40-41}."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "12",
    "NoteID": "20",
    "Body": "Lit., \"called out unto Us against (ila) an affliction\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "12",
    "NoteID": "21",
    "Body": "The expression musrif, which often (e.g., in  5:32  or\\n\\t\\t\\t\\t 7:81 ) denotes \"one who is given to excesses\" or\\n\\t\\t\\t\\t\"commits excesses\" or (as in  6:141 ) \"one who is\\n\\t\\t\\t\\twasteful\", has in the above context the meaning of \"one\\n\\t\\t\\t\\twho wastes his own self\" (Razi) - namely, destroys his\\n\\t\\t\\t\\tspiritual potential by following only his base impulses\\n\\t\\t\\t\\tand failing to submit to any moral imperative. (Cf. the\\n\\t\\t\\t\\tvery similar expression alladhina khasiru anfusahum\\n\\t\\t\\t\\toccurring in many places and rendered by me as \"those who\\n\\t\\t\\t\\thave squandered their own selves\".) In the sense in which\\n\\t\\t\\t\\tit is used here, the term israf (lit., \"wastefulness\" or\\n\\t\\t\\t\\t\"lack of moderation in one's doings\") is almost\\n\\t\\t\\t\\tsynonymous with the term tughyan (\"overweening\\n\\t\\t\\t\\tarrogance\") occurring in the preceding verse (Manar XI,\\n\\t\\t\\t\\t314), and relates to the same type of man. The phrase\\n\\t\\t\\t\\t\"goodly seem [to them] their own doings\" describes the\\n\\t\\t\\t\\tunthinking complacency with which \"those who waste their\\n\\t\\t\\t\\town selves\" go through life."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "13",
    "NoteID": "22",
    "Body": "Cf. {6:131-132}. The phrase rendered by me as \"the\\n\\t\\t\\t\\tapostles sent unto them\" reads, literally, \"their\\n\\t\\t\\t\\tapostles\". The sinners' refusal to believe is expressed\\n\\t\\t\\t\\tin the text by means of the construction wa-ma kanu\\n\\t\\t\\t\\tli-yu'minu."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "15",
    "NoteID": "23",
    "Body": "Sc., \"to suit our own views as to what is right and what\\n\\t\\t\\t\\tis wrong\". This is an oblique reference to the highly\\n\\t\\t\\t\\tsubjective criticism of Qur'anic ethics and eschatology\\n\\t\\t\\t\\tby many agnostics (both among the contemporaries of the\\n\\t\\t\\t\\tProphet and in later times), and particularly to their\\n\\t\\t\\t\\tview that the Qur'an was \"composed\" by Muhammad himself\\n\\t\\t\\t\\tand therefore expresses no more than his personal\\n\\t\\t\\t\\tconvictions. - Regarding the phrase, \"those who do not\\n\\t\\t\\t\\tbelieve that they are destined to meet Us\", see note [12]\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "16",
    "NoteID": "24",
    "Body": "This argument - placed in the mouth of the Prophet - has\\n\\t\\t\\t\\ta twofold implication. Ever since his early youth,\\n\\t\\t\\t\\tMuhammad had been renowned for his truthfulness and\\n\\t\\t\\t\\tintegrity, so much so that his Meccan compatriots applied\\n\\t\\t\\t\\tto him the epithet Al-Amin (\"The Trustworthy\"). In\\n\\t\\t\\t\\taddition to this, he had never composed a single line of\\n\\t\\t\\t\\tpoetry (and this in contrast with a tendency which was\\n\\t\\t\\t\\twidespread among the Arabs of his time), nor had he been\\n\\t\\t\\t\\tdistinguished by particular eloquence. \"How, then,\" goes\\n\\t\\t\\t\\tthe argument, \"can you reconcile your erstwhile\\n\\t\\t\\t\\tconviction - based on the experience of a lifetime - that\\n\\t\\t\\t\\tMuhammad was incapable of uttering a lie, with your\\n\\t\\t\\t\\tpresent contention that he himself has composed the\\n\\t\\t\\t\\tQur'an and now falsely attributes it to divine\\n\\t\\t\\t\\trevelation? And how could he who, up to the age of forty,\\n\\t\\t\\t\\thas never displayed any poetic or philosophic gifts and\\n\\t\\t\\t\\tis known to be entirely unlettered (ummi), have composed\\n\\t\\t\\t\\ta work as perfect in its language, as penetrating in its\\n\\t\\t\\t\\tpsychological insight and as compelling in its inner\\n\\t\\t\\t\\tlogic as the Qur'an?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "17",
    "NoteID": "25",
    "Body": "I.e., in the life to come. In this context, the\\n\\t\\t\\t\\t\"attributing of one's own lying inventions to God\" would\\n\\t\\t\\t\\tseem to apply specifically to the wanton accusation that\\n\\t\\t\\t\\tMuhammad himself composed the Qur'an and then attributed\\n\\t\\t\\t\\tit to God; and the \"giving the lie to God's messages\"\\n\\t\\t\\t\\trefers to the attitude of those who make such an\\n\\t\\t\\t\\taccusation and, consequently, reject the Qur'an (Razi)"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "18",
    "NoteID": "26",
    "Body": "Thus the discourse returns to the problem of\\n\\t\\t\\t\\t\"intercession\" touched upon in verse {3} of this surah.\\n\\t\\t\\t\\tLiterally, the beginning of the sentence reads thus: \"And\\n\\t\\t\\t\\tthey worship that which neither harms them nor benefits\\n\\t\\t\\t\\tthem\" - an expression alluding to both concrete\\n\\t\\t\\t\\trepresentations and conceptual images. It should be noted\\n\\t\\t\\t\\tthat the \"they\" elliptically referred to here are not\\n\\t\\t\\t\\tidentical with the people spoken of earlier as \"those who\\n\\t\\t\\t\\tdo not believe that they are destined to meet Us\" (in\\n\\t\\t\\t\\tother words, those who deny the reality of resurrection\\n\\t\\t\\t\\tand of the Day of Judgment): for the people of whom the\\n\\t\\t\\t\\tabove verse speaks obviously do believe - albeit in a\\n\\t\\t\\t\\tconfused manner - in life after death and man's\\n\\t\\t\\t\\tresponsibility before God, as is evident from the\\n\\t\\t\\t\\tstatement that they worship imaginary \"intercessors with\\n\\t\\t\\t\\tGod\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "18",
    "NoteID": "27",
    "Body": "Thus, belief in the efficacy of anyone's unqualified\\n\\t\\t\\t\\tintercession with God, or mediation between man and Him,\\n\\t\\t\\t\\tis here equated with a denial of God's omniscience, which\\n\\t\\t\\t\\ttakes all the circumstances of the sinner and his sinning\\n\\t\\t\\t\\ta priori into consideration. (As regards God's symbolic\\n\\t\\t\\t\\tgrant of permission to His prophets to \"intercede\" for\\n\\t\\t\\t\\ttheir followers on the Day of Judgment, see note [7]\\n\\t\\t\\t\\tabove.)"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "19",
    "NoteID": "28",
    "Body": "Lit., \"and then they disagreed [among themselves]\". For\\n\\t\\t\\t\\tan explanation of the term \"one single community\" (ummah\\n\\t\\t\\t\\twahidah), see surah {2}, note [197]. In the present\\n\\t\\t\\t\\tcontext, this expression alludes not merely to mankind's\\n\\t\\t\\t\\tone-time homogeneity, but also - by implication - to the\\n\\t\\t\\t\\tfact, repeatedly stressed in the Qur'an (e.g., in\\n\\t\\t\\t\\t 7:172 ), that the ability to realize God's existence,\\n\\t\\t\\t\\toneness and omnipotence is innate in man, and that all\\n\\t\\t\\t\\tdeviation from this basic perception is a consequence of\\n\\t\\t\\t\\tthe confusion brought about by man's progressive\\n\\t\\t\\t\\testrangement from his inborn instincts."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "19",
    "NoteID": "29",
    "Body": "Lit., \"it would indeed have been decided between them\\n\\t\\t\\t\\tregarding all that they were differing in\": i.e., had it\\n\\t\\t\\t\\tnot been for God's decree - which is the meaning, in this\\n\\t\\t\\t\\tcontext, of the term kalimah (lit., \"word\") - that men\\n\\t\\t\\t\\tshould differ in their intellectual approach to the\\n\\t\\t\\t\\tproblems touched upon by divine revelation, \"they would\\n\\t\\t\\t\\tnot have contended with one another after having received\\n\\t\\t\\t\\tall evidence of the truth\", but would all have held from\\n\\t\\t\\t\\tthe very outset, and would continue to hold, the same\\n\\t\\t\\t\\tviews (cf.  2:253  and the corresponding note [245]).\\n\\t\\t\\t\\tSince, however, such a uniformity would have precluded\\n\\t\\t\\t\\tmen's intellectual, moral and social development, God has\\n\\t\\t\\t\\tleft it to their reason, aided by prophetic guidance,\\n\\t\\t\\t\\tgradually to find their way to the truth. (See also surah\\n\\t\\t\\t\\t{2}, note [198].) The above parenthetic passage must be\\n\\t\\t\\t\\tread in conjunction with  2:213 ."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "20",
    "NoteID": "30",
    "Body": "I.e., on Muhammad, in order to \"prove\" that he is truly a\\n\\t\\t\\t\\tbearer of God's message (a sceptical objection which\\n\\t\\t\\t\\tresumes the theme enunciated in verses {1-2} and {15-17}\\n\\t\\t\\t\\tabove); see also  6:37  and {109} and the corresponding\\n\\t\\t\\t\\tnotes, especially note [94]. The pronoun \"they\" refers to\\n\\t\\t\\t\\tboth categories of deniers of the truth spoken of in the\\n\\t\\t\\t\\tpreceding passages: the atheists or agnostics \"who do not\\n\\t\\t\\t\\tbelieve that they are destined to meet God\", as well as\\n\\t\\t\\t\\tthose who, while believing in God, \"ascribe a share in\\n\\t\\t\\t\\tHis divinity\" to all manner of imaginary intercessors or\\n\\t\\t\\t\\tmediators (see verse {18} above)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "20",
    "NoteID": "31",
    "Body": "This answer relates not merely to the question as to why\\n\\t\\t\\t\\tGod has not bestowed on Muhammad a \"miraculous sign\" of\\n\\t\\t\\t\\this prophethood, but also to the \"why\" of his having been\\n\\t\\t\\t\\tchosen for his prophetic mission. See in this connection\\n\\t\\t\\t\\t 2:105  (\"God singles out for His grace whom He wills\")\\n\\t\\t\\t\\tand {3:73-74} (\"God is infinite, all-knowing, singling\\n\\t\\t\\t\\tout for His grace whom He wills\")."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "21",
    "NoteID": "32",
    "Body": "I.e., the two categories of people referred to in verses\\n\\t\\t\\t\\t{7}, {11}, {12}, {15}, {18} and {20}."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "21",
    "NoteID": "33",
    "Body": "Lit., \"they have forthwith a scheme against Our\\n\\t\\t\\t\\tmessages\". (The particle idha preceding this clause is\\n\\t\\t\\t\\tmeant to bring out the element of immediacy, and is best\\n\\t\\t\\t\\trendered as \"lo! they forthwith...\", etc.) Since God's\\n\\t\\t\\t\\tmessages are purely conceptual, the \"scheming against\\n\\t\\t\\t\\tthem\" obviously connotes the devising of fallacious\\n\\t\\t\\t\\targuments meant to cast doubt on the divine origin of\\n\\t\\t\\t\\tthese messages or to \"disprove\" the statements made in\\n\\t\\t\\t\\tthem. The above discourse on the psychology of\\n\\t\\t\\t\\tagnosticism and half-belief is continued in the parable\\n\\t\\t\\t\\tof the seafarers set forth in the next two verses."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "22",
    "NoteID": "34",
    "Body": "Lit., \"until, when you are in the ships...\", etc. As has\\n\\t\\t\\t\\tbeen pointed out by Zamakhshari, the particle \"until\"\\n\\t\\t\\t\\t(hatta) which precedes this clause refers to the sudden\\n\\t\\t\\t\\trise of the storm described in the sequence, and not to\\n\\t\\t\\t\\tthe \"going to sea in ships\". It is to be noted that at\\n\\t\\t\\t\\tthis point the discourse changes abruptly from the direct\\n\\t\\t\\t\\taddress \"you\" to the third person plural (\"they\"): a\\n\\t\\t\\t\\tconstruction which is evidently meant to bring out the\\n\\t\\t\\t\\tallegorical character of the subsequent narrative and to\\n\\t\\t\\t\\tturn it into a lesson of general validity."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "23",
    "NoteID": "35",
    "Body": "See verse {12} (of which the above passage is a parabolic\\n\\t\\t\\t\\tillustration) and the corresponding notes."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "23",
    "NoteID": "36",
    "Body": "Lit., \"your outrageousness (baghy) is only against your\\n\\t\\t\\t\\town selves\". Cf. the oft-recurring Qur'anic expression,\\n\\t\\t\\t\\t\"they have sinned against themselves\" (zalamu anfusahum,\\n\\t\\t\\t\\tlit., \"they have wronged themselves\"), indicating the\\n\\t\\t\\t\\tinevitability with which every evil deed damages its\\n\\t\\t\\t\\tperpetrator spiritually."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "24",
    "NoteID": "37",
    "Body": "Lit., \"with which the plants of the earth mingle\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "24",
    "NoteID": "38",
    "Body": "I.e., they come to believe that they have gained \"mastery\\n\\t\\t\\t\\tover nature\", with no conceivable limits to what they may\\n\\t\\t\\t\\tyet achieve. It is to be borne in mind that the term\\n\\t\\t\\t\\tzukhruf bears almost invariably a connotation of\\n\\t\\t\\t\\tartificiality - a connotation which in this case is\\n\\t\\t\\t\\tcommunicated to the subsequent verb izzayyanat. Thus, the\\n\\t\\t\\t\\twhole of the above parabolic sentence may be understood\\n\\t\\t\\t\\tas alluding to the artificial, illusory \"adornment\"\\n\\t\\t\\t\\tbrought about by man's technological efforts, not in\\n\\t\\t\\t\\tcollaboration with nature but, rather, in hostile\\n\\t\\t\\t\\t\"confrontation\" with it."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "24",
    "NoteID": "39",
    "Body": "Lit., \"as if it had not been in existence yesterday\": a\\n\\t\\t\\t\\tphrase used in classical Arabic to describe something\\n\\t\\t\\t\\tthat has entirely disappeared or perished (Taj al-'Arus)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "25",
    "NoteID": "40",
    "Body": "Or: \"guides whom He wills onto a straight way\". As\r\\n\\t\\t\\t\\tregards the expression salam, rendered here and in many\r\\n\\t\\t\\t\\tother places as \"peace\" and elsewhere as \"salvation\", see\r\\n\\t\\t\\t\\tsurah {5}, note [29]. It is obvious that the term dar\r\\n\\t\\t\\t\\tas-salam (\"abode of peace\") denotes not only the\r\\n\\t\\t\\t\\tcondition of ultimate happiness in the hereafter -\r\\n\\t\\t\\t\\talluded to in the allegory of paradise - but also the\r\\n\\t\\t\\t\\tspiritual condition of a true believer in this world:\r\\n\\t\\t\\t\\tnamely, a state of inner security, of peace with God,\r\\n\\t\\t\\t\\twith one's natural environment, and within oneself."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "26",
    "NoteID": "41",
    "Body": "I.e., more than their actual merits may warrant (cf.\\n\\t\\t\\t\\t 6:160  - \"Whoever shall come [before God] with a good\\n\\t\\t\\t\\tdeed will gain ten times the like thereof\"). See also\\n\\t\\t\\t\\tnote [79] on  27:89 ."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "27",
    "NoteID": "42",
    "Body": "In contrast with the multiple \"rewards\" for good deeds,\\n\\t\\t\\t\\tthe recompense of evil will be only commensurate with the\\n\\t\\t\\t\\tdeed itself. (See also note [46] on the last sentence of\\n\\t\\t\\t\\t 41:50 .)"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "27",
    "NoteID": "43",
    "Body": "Lit., \"by a piece of the night, densely dark\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "28",
    "NoteID": "44",
    "Body": "Lit., \"you and those [God -]partners of yours\"; cf. surah\r\\n\\t\\t\\t\\t{6}, note [15]. The expression makanakum (lit., \"your\r\\n\\t\\t\\t\\tplace\", i.e., \"keep to your place\") bears a connotation\r\\n\\t\\t\\t\\tof contempt and an implied threat."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "28",
    "NoteID": "45",
    "Body": "I.e., separated those who ascribed divinity to beings\\n\\t\\t\\t\\tother than God from the objects of their one-time\\n\\t\\t\\t\\tadoration (Tabari, Baghawi): a metonymical phrase\\n\\t\\t\\t\\tdenoting a realization on the part of the former that\\n\\t\\t\\t\\tthere has never been any existential link between them\\n\\t\\t\\t\\tand those false objects of worship (cf.  6:24 ,  10:30 ,\\n\\t\\t\\t\\t 11:21 ,  16:87  and  28:75  - \"and all their false\\n\\t\\t\\t\\timagery has [or \"will have\"] forsaken them\"). See also\\n\\t\\t\\t\\tthe next two notes."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "28",
    "NoteID": "46",
    "Body": "I.e., \"it was only your own fancies and desires that you\\n\\t\\t\\t\\tworshipped, clothing them in the garb of extraneous\\n\\t\\t\\t\\tbeings\": in other words, the worship of idols, forces of\\n\\t\\t\\t\\tnature, saints, prophets, angels, etc., is shown here to\\n\\t\\t\\t\\tbe nothing but a projection of the worshipper's own\\n\\t\\t\\t\\tsubconscious desires. (Cf. also  34:41  and the\\n\\t\\t\\t\\tcorresponding note [52].)"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "29",
    "NoteID": "47",
    "Body": "Thus the Qur'an makes it clear that the saints and\\n\\t\\t\\t\\tprophets who, after their death, have been unwarrantably\\n\\t\\t\\t\\tdeified by their followers shall not be held accountable\\n\\t\\t\\t\\tfor the blasphemous worship accorded to them (cf.\\n\\t\\t\\t\\t{5:116-117}); furthermore, even the inanimate objects of\\n\\t\\t\\t\\tfalse worship will symbolically deny any connection\\n\\t\\t\\t\\tbetween themselves and their worshippers."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "30",
    "NoteID": "48",
    "Body": "I.e., will be brought back to the realization of God's\\n\\t\\t\\t\\toneness, uniqueness and almightiness - that instinctive\\n\\t\\t\\t\\tcognition which has been implanted in human nature as\\n\\t\\t\\t\\tsuch (see  7:172 )."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "31",
    "NoteID": "49",
    "Body": "The term rizq (\"provision of sustenance\") is used here in\\n\\t\\t\\t\\tboth the physical and spiritual connotations of this\\n\\t\\t\\t\\tword, which explains the reference to \"heaven and earth\"\\n\\t\\t\\t\\tand, subsequently, \"[man's] hearing and sight\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "31",
    "NoteID": "50",
    "Body": "The people referred to here are those who believe,\\n\\t\\t\\t\\tfirstly, that there are beings endowed with certain\\n\\t\\t\\t\\tdivine or semi-divine qualities, thus having, as it were,\\n\\t\\t\\t\\ta \"share\" in God's divinity; and, secondly, that by\\n\\t\\t\\t\\tworshipping such beings men can come closer to God. This\\n\\t\\t\\t\\tidea obviously presupposes belief in God's existence, as\\n\\t\\t\\t\\tis brought out in the \"answer\" of the people thus\\n\\t\\t\\t\\taddressed (cf.  7:172  and the corresponding note [139]);\\n\\t\\t\\t\\tbut inasmuch as it offends against the concept of God's\\n\\t\\t\\t\\toneness and uniqueness, it deprives those people's belief\\n\\t\\t\\t\\tin God of its true meaning and spiritual value."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "32",
    "NoteID": "51",
    "Body": "Lit., \"this [or \"such\"], then, being God, your Sustainer,\\n\\t\\t\\t\\tthe Ultimate Truth\" - i.e., \"seeing that, on your own\\n\\t\\t\\t\\tadmission, He is the One who creates and governs all\\n\\t\\t\\t\\tthings and is the Ultimate Reality behind all that\\n\\t\\t\\t\\texists\" (see surah {20}, note [99]): which implies a\\n\\t\\t\\t\\tcategorical denial of the possibility that any other\\n\\t\\t\\t\\tbeing could have a share, however small, in His divinity."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "32",
    "NoteID": "52",
    "Body": "Lit., \"How, then, are you turned away?\" - i.e., from the\\n\\t\\t\\t\\ttruth."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "33",
    "NoteID": "53",
    "Body": "See surah {2}, note [7], as well as  8:55  and the\\n\\t\\t\\t\\tcorresponding note [58]. In this particular context, \"the\\n\\t\\t\\t\\tSustainer's word\" seems to be synonymous with \"the way of\\n\\t\\t\\t\\tGod\" (sunnat Allah) concerning deliberate sinners and\\n\\t\\t\\t\\tdeniers of the truth (Manar XI, 359). The particle anna\\n\\t\\t\\t\\tin annahum (lit., \"that they\") is, thus, indicative of\\n\\t\\t\\t\\tthe purport of the divine \"word\" referred to, and is best\\n\\t\\t\\t\\texpressed by a colon."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "34",
    "NoteID": "54",
    "Body": "This rhetorical question is connected with the false\\n\\t\\t\\t\\tbelief that those idolatrously worshipped beings are no\\n\\t\\t\\t\\tmore than \"intercessors\" between their followers and God\\n\\t\\t\\t\\t(see verse {18} above): and so, even their misguided\\n\\t\\t\\t\\tvotaries cannot possibly attribute to them the power to\\n\\t\\t\\t\\tcreate and to resurrect. See also note [8] on verse {4}\\n\\t\\t\\t\\tof this surah. In its wider sense, this question (and the\\n\\t\\t\\t\\tsubsequent answer) relates to the God-willed, cyclic\\n\\t\\t\\t\\tprocess of birth, death and regeneration evident in all\\n\\t\\t\\t\\torganic nature."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "34",
    "NoteID": "55",
    "Body": "See surah {5}, note [90]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "35",
    "NoteID": "56",
    "Body": "Since the concept of \"finding the right way\" cannot apply\\n\\t\\t\\t\\tto lifeless idols and idolatrous images, the above\\n\\t\\t\\t\\tpassage obviously relates to animate beings - whether\\n\\t\\t\\t\\tdead or alive - to whom \"a share in God's divinity\" is\\n\\t\\t\\t\\tfalsely attributed: that is, to saintly personalities,\\n\\t\\t\\t\\tprophets or angels whom popular fancy blasphemously\\n\\t\\t\\t\\tendows with some or all of God's qualities, sometimes\\n\\t\\t\\t\\teven to the extent that they are regarded as a\\n\\t\\t\\t\\tmanifestation or incarnation of God on earth. As for the\\n\\t\\t\\t\\tact of God's guidance, it is displayed, primarily, in the\\n\\t\\t\\t\\tpower of conscious reasoning as well as of instinctive\\n\\t\\t\\t\\tinsight with which He has graced man, thus enabling him\\n\\t\\t\\t\\tto follow the divine laws of right conduct (Zamakhshari)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "35",
    "NoteID": "57",
    "Body": "Lit., \"[and] how do you judge?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "36",
    "NoteID": "58",
    "Body": "Lit., \"conjecture can in no wise make [anyone]\\n\\t\\t\\t\\tindependent (la yughni) of the truth\", i.e., of positive\\n\\t\\t\\t\\tinsight obtained through authentic revelation (to which\\n\\t\\t\\t\\tthe sequence relates). The people referred to here (and\\n\\t\\t\\t\\tapparently also in the first sentence of verse {53} of\\n\\t\\t\\t\\tthis surah) are the agnostics who waver between truth and\\n\\t\\t\\t\\tfalsehood. - Some of the great exponents of Islamic Law -\\n\\t\\t\\t\\tforemost among them Ibn Hazm - base on this verse their\\n\\t\\t\\t\\trejection of qiyas (\"deduction by analogy\") as a means of\\n\\t\\t\\t\\teliciting religious laws which are supposedly \"implied\"\\n\\t\\t\\t\\tin the wording of the Qur'an or of the Prophet's\\n\\t\\t\\t\\tteachings, but not clearly laid down in terms of law. In\\n\\t\\t\\t\\this commentary on this verse, Razi thus sums up the above\\n\\t\\t\\t\\tview: \"They say that every deduction by analogy is a\\n\\t\\t\\t\\tconjectural process and is, therefore, of necessity,\\n\\t\\t\\t\\tinadmissible [in matters pertaining to religion] - for\\n\\t\\t\\t\\t'conjecture can never be a substitute for truth'.\" (See\\n\\t\\t\\t\\talso {5:101-102}, and the corresponding notes [120-123].)"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "37",
    "NoteID": "59",
    "Body": "Lit., \"but\" (wa-lakin) - a stress on the impossibility of\\n\\t\\t\\t\\tany assertion to the contrary."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "37",
    "NoteID": "60",
    "Body": "The above passage has a twofold significance: firstly,\\n\\t\\t\\t\\tthe wisdom inherent in the Qur'an precludes any\\n\\t\\t\\t\\tpossibility of its having been composed by a human being;\\n\\t\\t\\t\\tand, secondly, the Qur'anic message is meant to confirm,\\n\\t\\t\\t\\tand give a final formulation to, the eternal truths which\\n\\t\\t\\t\\thave been conveyed to man through a long succession of\\n\\t\\t\\t\\tprophets: truths which have subsequently been obscured\\n\\t\\t\\t\\tthrough wrong interpretation, deliberate omissions or\\n\\t\\t\\t\\tinterpolations, or a partial or even total loss of the\\n\\t\\t\\t\\toriginal texts. For an explanation of the phrase ma bayna\\n\\t\\t\\t\\tyadayhi, rendered by me in this context as \"whatever\\n\\t\\t\\t\\tthere still remains [of earlier revelations]\", see surah\\n\\t\\t\\t\\t{3}, note [3]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "38",
    "NoteID": "61",
    "Body": "According to the great philologist Abu 'Ubaydah Ma'mar\\n\\t\\t\\t\\tibn al-Muthanna (as quoted by Baghawi), the particle am\\n\\t\\t\\t\\twhich introduces this sentence has no interrogative\\n\\t\\t\\t\\tconnotation, but is - as in several other places in the\\n\\t\\t\\t\\tQur'an - synonymous with the conjunction wa (\"and\"),\\n\\t\\t\\t\\twhich in this case can be suitably rendered as above."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "38",
    "NoteID": "62",
    "Body": "Cf.  2:23  and the corresponding note [15]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "39",
    "NoteID": "63",
    "Body": "Lit., \"the knowledge whereof they do not encompass, while\\n\\t\\t\\t\\tits inner meaning has not yet come to them\". Most of the\\n\\t\\t\\t\\tclassical commentators explain this sentence in the way\\n\\t\\t\\t\\trendered by me, some of them, however (e.g., Tabari and\\n\\t\\t\\t\\tBaghawi), interpret the term ta'wil (\"final [or \"inner\"]\\n\\t\\t\\t\\tmeaning\") in the sense in which it is used in  7:53  (see\\n\\t\\t\\t\\tmy translation of that passage and the corresponding note\\n\\t\\t\\t\\t[41])."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "40",
    "NoteID": "64",
    "Body": "The verb yu'minun, which occurs twice in this verse, can\\n\\t\\t\\t\\tbe understood as connoting either the present tense -\\n\\t\\t\\t\\t\"[such as] believe\", resp. \"[such as] do not believe\" -\\n\\t\\t\\t\\tor the future tense. The future tense (adopted by me) is\\n\\t\\t\\t\\tthe meaning unequivocally attributed to it by Tabari and\\n\\t\\t\\t\\tIbn Kathir; some of the other authorities, like\\n\\t\\t\\t\\tZamakhshari and Razi, prefer the present tense, but\\n\\t\\t\\t\\tnevertheless regard the other interpretation as\\n\\t\\t\\t\\tlegitimate. (See also Manar XI, 380.)"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "45",
    "NoteID": "65",
    "Body": "I.e., their past sojourn in this world, during which they\\n\\t\\t\\t\\twere bound to one another by various ties of human\\n\\t\\t\\t\\trelationship, will appear to them like a short moment as\\n\\t\\t\\t\\tcompared with the timeless duration of the life that\\n\\t\\t\\t\\tawaits them after resurrection (see note [19] on {79:46),\\n\\t\\t\\t\\twith all their past relationships cut asunder. See also\\n\\t\\t\\t\\t 6:94 , which describes the condition of the deniers of\\n\\t\\t\\t\\tthe truth on the Day of Resurrection: \"And now, indeed,\\n\\t\\t\\t\\tyou have come unto Us in a lonely state, even as We\\n\\t\\t\\t\\tcreated you in the first instance\"; and later on, in that\\n\\t\\t\\t\\tsame verse: \"Indeed, all the bonds between you [and your\\n\\t\\t\\t\\tearthly life] are now severed....\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "46",
    "NoteID": "66",
    "Body": "Lit., \"of what We promise them\" or \"of what We threaten\\n\\t\\t\\t\\tthem with\" - i.e., the inevitable retribution, sometimes\\n\\t\\t\\t\\teven in this world, which a deliberate denial of the\\n\\t\\t\\t\\ttruth brings in its wake."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "46",
    "NoteID": "67",
    "Body": "The above verse is addressed, in the first instance, to\\n\\t\\t\\t\\tthe Prophet, and relates to those of his contemporaries\\n\\t\\t\\t\\twho refused to acknowledge the truth of the Qur'anic\\n\\t\\t\\t\\trevelation. In its wider sense, however, it is addressed\\n\\t\\t\\t\\tto every believer who might find it incomprehensible that\\n\\t\\t\\t\\tlife-long suffering is often the lot of the righteous,\\n\\t\\t\\t\\twhile many wrongdoers and deniers of the truth apparently\\n\\t\\t\\t\\tremain unscathed and are allowed to enjoy the good things\\n\\t\\t\\t\\tof life. The Qur'an solves this apparent paradox by\\n\\t\\t\\t\\tmaking it clear that, in comparison with the life to\\n\\t\\t\\t\\tcome, the life in this world is but a brief moment, and\\n\\t\\t\\t\\tthat it is only in the hereafter that man's destiny\\n\\t\\t\\t\\treveals itself in all its true aspects. Cf.  3:185  -\\n\\t\\t\\t\\t\"only on the Day of Resurrection will you be requited in\\n\\t\\t\\t\\tfull [for whatever you have done]...for the life of this\\n\\t\\t\\t\\tworld is nothing but an enjoyment of self-delusion\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "47",
    "NoteID": "68",
    "Body": "Lit., \"and when their apostle has come, a decision is\\n\\t\\t\\t\\tmade between them in all equity\". This verse stresses (a)\\n\\t\\t\\t\\tthe continuity of religious revelation in mankind's\\n\\t\\t\\t\\thistory and the fact that in the long run no community,\\n\\t\\t\\t\\tperiod or civilization (which latter is one of the\\n\\t\\t\\t\\tmeanings attributable to the term ummah) has been left\\n\\t\\t\\t\\twithout prophetic guidance, and (b) the doctrine that God\\n\\t\\t\\t\\tdoes not punish \"a community for its wrongdoing so long\\n\\t\\t\\t\\tas its people are still unaware [of the meaning of right\\n\\t\\t\\t\\tand wrong]: for all shall be judged according to their\\n\\t\\t\\t\\t[conscious] deeds\" ({6:131-132})."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "49",
    "NoteID": "69",
    "Body": "Sc., \"and since I do not possess any supernatural powers,\\n\\t\\t\\t\\tI cannot predict that which is beyond the reach of human\\n\\t\\t\\t\\tperception (al-ghayb)\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "49",
    "NoteID": "70",
    "Body": "See  7:34  and the corresponding notes [25] and [26]. In\\n\\t\\t\\t\\tthe above context, the \"end of the term\" refers, in\\n\\t\\t\\t\\tparticular, to the coming of the Last Hour and the Day of\\n\\t\\t\\t\\tJudgment."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "50",
    "NoteID": "71",
    "Body": "Lit., \"What [part] thereof might the people lost in sin\\n\\t\\t\\t\\t(al-mujrimun) wish to hasten\" - meaning, according to\\n\\t\\t\\t\\tZamakhshari, that \"all of [God's] chastisement is awful\\n\\t\\t\\t\\tand bitter, and should inspire one with the desire to\\n\\t\\t\\t\\tflee therefrom;...and there is nothing in it that ought\\n\\t\\t\\t\\tto make one wish to hasten it\". This is an allusion to\\n\\t\\t\\t\\tthe incredulous inquiry of the deniers of the truth about\\n\\t\\t\\t\\tthe coming of the Last Hour (verse {48} above), as well\\n\\t\\t\\t\\tas to their sarcastic demand that they should be\\n\\t\\t\\t\\timmediately chastised by God in proof of Muhammad's\\n\\t\\t\\t\\tprophetic mission (cf. {6:57-58} and  8:32 , as well as\\n\\t\\t\\t\\tthe corresponding notes). - The expression \"by night or\\n\\t\\t\\t\\tby day\" occurring in the preceding sentence denotes the\\n\\t\\t\\t\\tsuddenness and unexpectedness with which doom is bound to\\n\\t\\t\\t\\tencompass the evildoers on the Day of Judgment."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "51",
    "NoteID": "72",
    "Body": "I.e., \"when it is too late\" (Tabari, Zamakhshari, Razi;\\n\\t\\t\\t\\tmy interpolation at the beginning of this sentence is\\n\\t\\t\\t\\tbased on these authorities)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "52",
    "NoteID": "73",
    "Body": "Lit., \"Are you being requited for anything but for what\\n\\t\\t\\t\\tyou were wont to earn?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "53",
    "NoteID": "74",
    "Body": "Lit., \"they\" - i.e., those of the unbelievers who are\r\\n\\t\\t\\t\\twavering in their agnosticism and - as mentioned in\r\\n\\t\\t\\t\\tverse {36} above - \"follow nothing but conjecture\" (Manar\r\\n\\t\\t\\t\\tXI, 394)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "54",
    "NoteID": "75",
    "Body": "In this instance, by deliberately giving the lie to the\\n\\t\\t\\t\\tProphet and rejecting the message of the Qur'an."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "54",
    "NoteID": "76",
    "Body": "Cf.  3:91  and the corresponding note [71]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "54",
    "NoteID": "77",
    "Body": "The primary meaning of the verb asarrahu is \"he concealed\\n\\t\\t\\t\\tit\" or \"he kept it secret\", thus the phrase asarru\\n\\t\\t\\t\\t'n-nadamah (expressed in the past tense but in the above\\n\\t\\t\\t\\tcontext obviously denoting a future event) could be\\n\\t\\t\\t\\trendered as \"they will conceal their remorse\". In view,\\n\\t\\t\\t\\thowever, of the many statements in the Qur'an that on the\\n\\t\\t\\t\\tDay of Judgment the sinners will not only not conceal but\\n\\t\\t\\t\\twill, rather, stress their remorse, some of the\\n\\t\\t\\t\\tcommentators (e.g., Baghawi, on the authority of\\n\\t\\t\\t\\tAbu'Ubaydah) are of the opinion that in this particular\\n\\t\\t\\t\\tverse the verb asarra denotes the opposite of its primary\\n\\t\\t\\t\\tmeaning and, accordingly, interpret the phrase as \"they\\n\\t\\t\\t\\twill manifest their remorse\". But the linguistic validity\\n\\t\\t\\t\\tof this rather forced interpretation has been\\n\\t\\t\\t\\temphatically contested by many philologists, and\\n\\t\\t\\t\\tparticularly by Abu Mansur al-Azhari (cf. Lane IV, 1337);\\n\\t\\t\\t\\tand since there is no convincing reason to disregard the\\n\\t\\t\\t\\toriginal significance of the verb asarra with its\\n\\t\\t\\t\\timplication of \"concealment\", the above Qur'anic phrase\\n\\t\\t\\t\\tmust be understood (as Zamakhshari understands it), in\\n\\t\\t\\t\\tthe metonymical sense of an involuntary \"concealment\",\\n\\t\\t\\t\\tthat is, the sinners' inability to express the full depth\\n\\t\\t\\t\\tof their remorse."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "56",
    "NoteID": "78",
    "Body": "Lit., \"you shall be brought back\" - for, \"all that exists\\n\\t\\t\\t\\tgoes back to Him [as its source]\" ( 11:123 )."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "57",
    "NoteID": "79",
    "Body": "I.e., a remedy for all that is contrary to truth and\\n\\t\\t\\t\\tmoral good."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "59",
    "NoteID": "80",
    "Body": "This connects with the statement, in verse {57}, that the\r\\n\\t\\t\\t\\tQur'an offers to man a complete guidance towards the good\r\\n\\t\\t\\t\\tlife and spiritual fulfilment in this world, and\r\\n\\t\\t\\t\\thappiness in the life to come. As already mentioned in\r\\n\\t\\t\\t\\tsurah {2}, note [4], the term rizq connotes all that may\r\\n\\t\\t\\t\\tbe good and useful to man, be it of a physical nature (in\r\\n\\t\\t\\t\\tthe conventional sense of \"means of sustenance\") or\r\\n\\t\\t\\t\\tbelonging to the realm of the mind (like reason,\r\\n\\t\\t\\t\\tknowledge, etc.) or of the spirit (like faith, kindness,\r\\n\\t\\t\\t\\tpatience, etc.). Thus, it applies exclusively to\r\\n\\t\\t\\t\\tpositive, beneficial means of sustenance and never to\r\\n\\t\\t\\t\\tthings or phenomena which are morally reprehensible\r\\n\\t\\t\\t\\tand/or physically or socially injurious."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "59",
    "NoteID": "81",
    "Body": "Lit., \"and thereupon you have made some of it forbidden\\n\\t\\t\\t\\t(haram) and [some of it] lawful (halal)\". The fact that\\n\\t\\t\\t\\tit is God who \"has bestowed upon you from on high\"\\n\\t\\t\\t\\t(anzala 'alaykum) - i.e., has willed that man should make\\n\\t\\t\\t\\tuse of - all that can be qualified as rizq, automatically\\n\\t\\t\\t\\tmakes all its manifestations lawful (Zamakhshari). In\\n\\t\\t\\t\\taccordance with the doctrine that everything which has\\n\\t\\t\\t\\tnot been expressly forbidden by the Qur'an or the\\n\\t\\t\\t\\texplicit teachings of the Prophet is eo ipso lawful, this\\n\\t\\t\\t\\tverse takes a clear-cut stand against all arbitrary\\n\\t\\t\\t\\tprohibitions invented by man or artificially \"deduced\"\\n\\t\\t\\t\\tfrom the Qur'an or the Prophet's sunnah (Manar XI. 409\\n\\t\\t\\t\\tf.: see also note [58] on verse {36} of this surah, as\\n\\t\\t\\t\\twell as {5:101-102} and the corresponding notes). In its\\n\\t\\t\\t\\twider sense, the above verse relates to people who refuse\\n\\t\\t\\t\\tto be guided by revelation and prefer to \"follow nothing\\n\\t\\t\\t\\tbut conjecture\" (verse {36})."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "61",
    "NoteID": "82",
    "Body": "Or: \"Whatever discourse (qur'an) from Him\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "61",
    "NoteID": "83",
    "Body": "Lit., \"witnesses\", corresponding to the majestic plural\\n\\t\\t\\t\\t\"We\". The specific reference to the Prophet and his\\n\\t\\t\\t\\trecitation of the Qur'an (implied in the singular form of\\n\\t\\t\\t\\taddress in the first part of this sentence) is meant to\\n\\t\\t\\t\\tstress the supreme importance of divine revelation in the\\n\\t\\t\\t\\tcontext of human life."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "62",
    "NoteID": "84",
    "Body": "The verb waliya (from which the noun wali, pl. awliya',\\n\\t\\t\\t\\tis derived) signifies, primarily, the nearness or\\n\\t\\t\\t\\tcloseness of one thing to another: thus, God is spoken of\\n\\t\\t\\t\\tin the Qur'an (e.g., in  2:257  and  3:68 ) as being\\n\\t\\t\\t\\t\"near unto (wali) those who believe\". Although the term\\n\\t\\t\\t\\twali, when applied to God, as well as to the relationship\\n\\t\\t\\t\\tbetween one created being and another, is often used in\\n\\t\\t\\t\\tthe Qur'an in the sense of \"helper\", \"friend\",\\n\\t\\t\\t\\t\"protector\", \"guardian\", etc., none of these secondary\\n\\t\\t\\t\\tmeanings can properly - i.e., without offending against\\n\\t\\t\\t\\tthe reverence due to God - describe man's attitude to, or\\n\\t\\t\\t\\trelationship with, Him. Consequently, the above reference\\n\\t\\t\\t\\tto the believers as awliya' of God is best rendered as\\n\\t\\t\\t\\t\"they who are close to God\" in the sense of their being\\n\\t\\t\\t\\talways conscious of Him. This rendering has the support\\n\\t\\t\\t\\tof almost all the classical commentators."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "64",
    "NoteID": "85",
    "Body": "I.e., the happiness born of the feeling of closeness to\\n\\t\\t\\t\\tGod and, hence, of spiritual fulfilment."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "65",
    "NoteID": "86",
    "Body": "The noun 'izzah comprises the concepts of superior might\\n\\t\\t\\t\\tas well as of honour and glory. Its rendering into\\n\\t\\t\\t\\tanother language depends on the context, and sometimes -\\n\\t\\t\\t\\tas in this case - necessitates a combination of two\\n\\t\\t\\t\\tterms."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "66",
    "NoteID": "87",
    "Body": "Lit., \"partners\", i.e., of God (see surah {6}, note\\n\\t\\t\\t\\t[15]). The substantive pronoun man (\"whoever\") occurring\\n\\t\\t\\t\\ttwice in the first part of this verse contains an\\n\\t\\t\\t\\tallusion to rational beings (as distinct from inanimate\\n\\t\\t\\t\\tobjects) whom \"those who ascribe divinity to aught beside\\n\\t\\t\\t\\tGod\" consider to be endowed with qualities or powers\\n\\t\\t\\t\\twhich, in fact, belong to Him alone. The Qur'an argues\\n\\t\\t\\t\\tagainst this idolatrous concept by pointing out that all\\n\\t\\t\\t\\trational beings, whether men or angels \"belong to God\"\\n\\t\\t\\t\\t(i.e., are - like everything else in the universe -\\n\\t\\t\\t\\twholly dependent on Him for their existence), possessing\\n\\t\\t\\t\\tno divine qualities and, therefore, no reality as objects\\n\\t\\t\\t\\tof worship."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "67",
    "NoteID": "88",
    "Body": "See {14:32-33} and the corresponding note [46]; for the\\n\\t\\t\\t\\tspecific significance, in this context of the reference\\n\\t\\t\\t\\tto \"day\" and \"night\", see note [77] on  27:86 , which\\n\\t\\t\\t\\tbelongs to a somewhat earlier revelation than the present\\n\\t\\t\\t\\tsurah."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "68",
    "NoteID": "89",
    "Body": "See surah {2}, note [96]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "71",
    "NoteID": "90",
    "Body": "Sc., \"because they run counter to the idolatrous beliefs\\n\\t\\t\\t\\twhich you have inherited from your ancestors\". The story\\n\\t\\t\\t\\tof Noah, briefly mentioned in verses {71-73}, is told at\\n\\t\\t\\t\\tgreater length in {11:36-48} (see also {7:59-64}). Here\\n\\t\\t\\t\\tit connects with verse {47} above, and thus with the main\\n\\t\\t\\t\\ttheme of this surah: the truth of God's revelation of His\\n\\t\\t\\t\\twill through His prophets, and the suffering which in the\\n\\t\\t\\t\\tlife to come is bound to befall those who give the lie to\\n\\t\\t\\t\\tHis messages."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "71",
    "NoteID": "91",
    "Body": "Lit., \"upon your course of action\" (which is the meaning\\n\\t\\t\\t\\tof the term amr in this context)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "71",
    "NoteID": "92",
    "Body": "Lit., \"your [God -]partners\". For an explanation of this\\n\\t\\t\\t\\tterm, see surah {6}, note [15]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "71",
    "NoteID": "93",
    "Body": "This is a free rendering of the elliptic phrase, \"and let\\n\\t\\t\\t\\tnot your course of action (amrukum) be an uncertainty to\\n\\t\\t\\t\\tyou\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "73",
    "NoteID": "94",
    "Body": "I.e., \"made them outlive [the others]\" (Zamakhshari). As\\n\\t\\t\\t\\tregards the allegorical rendering of khala'if (sing.\\n\\t\\t\\t\\tkhalif or khalifah) adopted by me, see surah {2}, note\\n\\t\\t\\t\\t[22]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "73",
    "NoteID": "95",
    "Body": "See surah {7}, note [47]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "74",
    "NoteID": "96",
    "Body": "Lit., \"We sent apostles to their [own] people\" - an\\n\\t\\t\\t\\tallusion to the fact that each of the apostles before\\n\\t\\t\\t\\tMuhammad was sent to one particular people or community,\\n\\t\\t\\t\\tand that the Arabian Prophet was the first and the last\\n\\t\\t\\t\\tto bring a universal message addressed to all mankind."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "74",
    "NoteID": "97",
    "Body": "Cf.  7:101  and the corresponding note [82]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "74",
    "NoteID": "98",
    "Body": "See surah {2}, note [7]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "76",
    "NoteID": "99",
    "Body": "Lit., \"this is indeed obvious sorcery\": an accusation\\n\\t\\t\\t\\twhich apparently refers to the spellbinding force of the\\n\\t\\t\\t\\tmessages conveyed to them by Moses, similar to the\\n\\t\\t\\t\\tobjections raised against the Last Prophet, Muhammad.\\n\\t\\t\\t\\t(See verse {2} of this surah and the corresponding note\\n\\t\\t\\t\\t[5])."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "77",
    "NoteID": "100",
    "Body": "The implication is that what is termed \"sorcery\" cannot\\n\\t\\t\\t\\tachieve more than ephemeral phenomena lacking any\\n\\t\\t\\t\\tspiritual content, and can never prevail against the laws\\n\\t\\t\\t\\tof nature which, in their totality, are described in the\\n\\t\\t\\t\\tQur'an as \"the way of God\". The story of Moses and the\\n\\t\\t\\t\\tsorcerers and the latters' subsequent conversion is told\\n\\t\\t\\t\\tin greater detail in Al-A'raf and Ta Ha, both of which\\n\\t\\t\\t\\twere revealed before the present surah."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "78",
    "NoteID": "101",
    "Body": "The dual address \"you two\" relates to Moses and his\\n\\t\\t\\t\\tbrother Aaron."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "81",
    "NoteID": "102",
    "Body": "The above interpolation is based on  7:116 ; see also the\\n\\t\\t\\t\\tsecond paragraph of  20:66 ."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "82",
    "NoteID": "103",
    "Body": "By \"God's words\" is meant here His creative will,\\n\\t\\t\\t\\tmanifested in the laws of nature instituted by Him as\\n\\t\\t\\t\\twell as in the revelations granted by Him to His prophets\\n\\t\\t\\t\\t(Manar XI, 468). A similar phrase occurs also in  8:7 \\n\\t\\t\\t\\tand  42:24 ."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "83",
    "NoteID": "104",
    "Body": "Lit., \"believed in Moses\"; however, since the sequence\\n\\t\\t\\t\\tshows that not belief as such but its open profession is\\n\\t\\t\\t\\treferred to here, I have rendered the above phrase\\n\\t\\t\\t\\taccordingly. As for the term dhurriyyah (lit.,\\n\\t\\t\\t\\t\"offspring\"), we have several authoritative statements to\\n\\t\\t\\t\\tthe effect that it often denotes \"a small group [or \"a\\n\\t\\t\\t\\tfew\"] of one's people\" (Ibn 'Abbas, as quoted by Tabari,\\n\\t\\t\\t\\tBaghawi, Razi and Ibn Kathir, as well as Ad-Dahhak and\\n\\t\\t\\t\\tQatadah, as quoted by Tabari and Ibn Kathir); hence my\\n\\t\\t\\t\\trendering. Since the Qur'an mentions (e.g., in\\n\\t\\t\\t\\t{7:120-126}) that some Egyptians, too, came to believe in\\n\\t\\t\\t\\tMoses' message and openly proclaimed their belief, it is\\n\\t\\t\\t\\treasonable to assume that by \"his people\" are meant not\\n\\t\\t\\t\\tmerely the Israelites but, more generally, the people\\n\\t\\t\\t\\tamong whom Moses was living: that is, both Israelites and\\n\\t\\t\\t\\tEgyptians. This assumption is strengthened by the\\n\\t\\t\\t\\treference, in the next clause of this sentence, to \"their\\n\\t\\t\\t\\tgreat ones\" - an expression obviously relating to the\\n\\t\\t\\t\\tEgyptian \"great ones\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "83",
    "NoteID": "105",
    "Body": "If the expression 'ala khawf is taken to mean \"despite\\n\\t\\t\\t\\t[their] fear\" (referring to those who did declare their\\n\\t\\t\\t\\tfaith openly), the above sentence would read thus: \"...a\\n\\t\\t\\t\\tfew of his people declared their faith in Moses despite\\n\\t\\t\\t\\ttheir fear that Pharaoh and their great ones would\\n\\t\\t\\t\\tpersecute them\" - implying, as does the rendering adopted\\n\\t\\t\\t\\tby me, that, because of their fear, the majority did not\\n\\t\\t\\t\\tdeclare their faith openly."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "85",
    "NoteID": "106",
    "Body": "Lit., \"temptation to evil\" (fitnah)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "87",
    "NoteID": "107",
    "Body": "Lit., \"a direction of prayer\" (qiblah) - a metaphor meant\\n\\t\\t\\t\\tto impress upon the children of Israel that their only\\n\\t\\t\\t\\tsalvation lay in God-consciousness and unceasing devotion\\n\\t\\t\\t\\tto Him. The primary meaning of misr - usually rendered as\\n\\t\\t\\t\\t\"Egypt\" - is \"city\" or \"metropolis\"."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "88",
    "NoteID": "108",
    "Body": "According to most of the classical commentators, the\\n\\t\\t\\t\\tparticle li prefixed to the verb yudillu (\"they are\\n\\t\\t\\t\\tleading astray\") represents in this context the so-called\\n\\t\\t\\t\\tlam al-'aqibah (\"the [letter] lam denoting a\\n\\t\\t\\t\\tconsequence\") and does not, as in many other instances,\\n\\t\\t\\t\\texpress a purpose or an intent (\"in order that\" or \"to\\n\\t\\t\\t\\tthe end that\"). My rendering of this li as \"with the\\n\\t\\t\\t\\tresult that\" is meant to bring out Moses' moral\\n\\t\\t\\t\\tindignation at the perversity of Pharaoh and his great\\n\\t\\t\\t\\tones who, instead of being grateful to God for His\\n\\t\\t\\t\\tbounty, are using their power to corrupt their own\\n\\t\\t\\t\\tpeople."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "89",
    "NoteID": "109",
    "Body": "Lit., \"the prayer of you two\", i.e., Moses and Aaron,\\n\\t\\t\\t\\tboth of whom are addressed in the next sentence as well."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "90",
    "NoteID": "110",
    "Body": "Lit., \"until, when drowning overtook him, he said\". For\\n\\t\\t\\t\\tthe full story of Moses and Pharaoh, the latter's\\n\\t\\t\\t\\ttyrannical oppression of the Israelites and their\\n\\t\\t\\t\\tultimate deliverance, see Exodus i-xiv, and especially\\n\\t\\t\\t\\t(with reference to the above Qur'an-verse), ch. xiv,\\n\\t\\t\\t\\twhich narrates in great detail the miraculous escape of\\n\\t\\t\\t\\tthe Israelites and the doom of Pharaoh and his forces. It\\n\\t\\t\\t\\tshould always be remembered that all Qur'anic references\\n\\t\\t\\t\\tto historical or legendary events - whether described in\\n\\t\\t\\t\\tthe Bible or in the oral tradition of pre-Islamic Arabia\\n\\t\\t\\t\\t- are invariably meant to elucidate a particular lesson\\n\\t\\t\\t\\tin ethics and not to narrate a story as such: and this\\n\\t\\t\\t\\texplains the fragmentary character of these references\\n\\t\\t\\t\\tand allusions."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "91",
    "NoteID": "111",
    "Body": "I.e., \"Dost thou repent now, when it is too late?\" Cf.\\n\\t\\t\\t\\t 4:18  - \"repentance shall not be accepted from those who\\n\\t\\t\\t\\tdo evil deeds until their dying hour, and then say,\\n\\t\\t\\t\\t'Behold, I now repent'.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "92",
    "NoteID": "112",
    "Body": "Lit., \"We shall save thee in thy body\": probably an\\n\\t\\t\\t\\tallusion to the ancient Egyptian custom of embalming the\\n\\t\\t\\t\\tbodies of their kings and nobles and thus preserving them\\n\\t\\t\\t\\tfor posterity. Some Egyptologists assume that the \"evil\\n\\t\\t\\t\\tPharaoh\" of the Qur'an and the Bible was Ramses II (about\\n\\t\\t\\t\\t1324-1258 B.C.), while others identify him with his\\n\\t\\t\\t\\tunlucky predecessor, Tut-ankh-amen, or even with Thotmes\\n\\t\\t\\t\\t(or Thutmosis) III, who lived in the 15th century B.C.\\n\\t\\t\\t\\tHowever, all these \"identifications\" are purely\\n\\t\\t\\t\\tspeculative and have no definitive historical value. In\\n\\t\\t\\t\\tthis connection it should be remembered that the\\n\\t\\t\\t\\tdesignation \"Pharaoh\" (fir'awn in Arabic) is not a proper\\n\\t\\t\\t\\tname but a title borne by all the kings of ancient Egypt."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "93",
    "NoteID": "113",
    "Body": "Lit., \"We settled the children of Israel in an abode of\\n\\t\\t\\t\\texcellence\" - which latter term according to almost all\\n\\t\\t\\t\\tcommentators, conveys the meaning of sidq in this\\n\\t\\t\\t\\tcontext."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "93",
    "NoteID": "114",
    "Body": "Commenting on this verse, Razi says: \"The people of Moses\\n\\t\\t\\t\\tremained of one religious persuasion ('ala millah\\n\\t\\t\\t\\twahidah) and of one opinion, without any disagreement,\\n\\t\\t\\t\\tuntil they began to study the Torah: whereupon they\\n\\t\\t\\t\\tbecame aware of the [various] problems and obligations\\n\\t\\t\\t\\tinvolved, and disagreements [regarding their\\n\\t\\t\\t\\tinterpretation] arose among them. And so God makes it\\n\\t\\t\\t\\tclear [in the above Qur'an-verse] that this kind of\\n\\t\\t\\t\\tdisagreement is inevitable (la-budd) and will always\\n\\t\\t\\t\\toccur in the life of this world.\" Razi's penetrating\\n\\t\\t\\t\\tpsychological comment is in tune with the oft-repeated\\n\\t\\t\\t\\tQur'anic statement that proneness to intellectual\\n\\t\\t\\t\\tdissension is a permanent characteristic of human nature\\n\\t\\t\\t\\t(see the last sentences of  2:213  and {253},\\n\\t\\t\\t\\trespectively, as well as the corresponding notes; also\\n\\t\\t\\t\\t 23:53  and note [30])."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "94",
    "NoteID": "115",
    "Body": "Some of the commentators assume that verses {94} and {95}\\n\\t\\t\\t\\tare addressed to the Prophet Muhammad - an assumption\\n\\t\\t\\t\\twhich is highly implausible in view of the admonition (in\\n\\t\\t\\t\\tverse {95}), \"Be not among those who are bent on giving\\n\\t\\t\\t\\tthe lie to God's messages\": for it is obvious that God's\\n\\t\\t\\t\\tchosen Prophet was never in danger of falling into such a\\n\\t\\t\\t\\tsin. Consequently, Razi interprets these two verses as\\n\\t\\t\\t\\tbeing addressed to man in general, and explains the\\n\\t\\t\\t\\treference to \"what We have bestowed upon thee from on\\n\\t\\t\\t\\thigh\" in the sense given in my rendering. This\\n\\t\\t\\t\\tinterpretation makes it clear, moreover, that the above\\n\\t\\t\\t\\tpassage is closely connected with verses {57-58}, which\\n\\t\\t\\t\\tspeak of the guidance vouchsafed to mankind through the\\n\\t\\t\\t\\tultimate divine writ, the Qur'an."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "94",
    "NoteID": "116",
    "Body": "I.e. the Jews and the Christians. The \"reading\" is here a\\n\\t\\t\\t\\tmetonym for belief, namely, in the Bible, which -\\n\\t\\t\\t\\tnotwithstanding the fact that its text has been corrupted\\n\\t\\t\\t\\tin the course of time - still contains clear references\\n\\t\\t\\t\\tto the advent of the Prophet Muhammad and thus, by\\n\\t\\t\\t\\timplication, to the truth of the divine message revealed\\n\\t\\t\\t\\tthrough him. In its wider sense, the above verse alludes\\n\\t\\t\\t\\tto the unbroken continuity of man's religious experience\\n\\t\\t\\t\\tand to the fact, frequently stressed in the Qur'an, that\\n\\t\\t\\t\\tevery one of God's apostles preached one and the same\\n\\t\\t\\t\\tbasic truth. (See in this connection the second paragraph\\n\\t\\t\\t\\tof  5:48  and the corresponding notes [66] and [67].)"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "96",
    "NoteID": "117",
    "Body": "See verse {33} and note [53] above; also note [4] on\\n\\t\\t\\t\\t 14:4 ."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "97",
    "NoteID": "118",
    "Body": "Sc., \"when belief will be of no avail to them\": an\\n\\t\\t\\t\\tallusion to verses {90-91}, which speak of Pharaoh's\\n\\t\\t\\t\\t\"conversion\" at the point of death. Cf. also {4:17-18}."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "98",
    "NoteID": "119",
    "Body": "The particle law-la (\"were it not that\" or \"were it not\\n\\t\\t\\t\\tfor\") is sometimes synonymous with hal-la, and could\\n\\t\\t\\t\\ttherefore be translated as \"why not\" (\"why was there\\n\\t\\t\\t\\tnot...?\", etc.). However, neither the interrogative nor\\n\\t\\t\\t\\tthe above-mentioned literal rendering would bring out the\\n\\t\\t\\t\\tpurport of this passage. Its meaning becomes obvious only\\n\\t\\t\\t\\tif we remember that law-la is - apart from its primary\\n\\t\\t\\t\\tsignificance - one of the so-called huruf at-tahdid\\n\\t\\t\\t\\t(\"particles denoting insistence\"). Whenever it is\\n\\t\\t\\t\\tfollowed by a verb in the future tense, it expresses an\\n\\t\\t\\t\\turgent exhortation to do a thing; if followed by a verb\\n\\t\\t\\t\\tin the past tense, as in the above case, it implies\\n\\t\\t\\t\\treproof for one's not having done something that should\\n\\t\\t\\t\\thave been done. There is no idiomatic equivalent in\\n\\t\\t\\t\\tmodern English to convey this meaning. The nearest\\n\\t\\t\\t\\tapproach to it would be, I believe, the archaic\\n\\t\\t\\t\\texclamation \"alack\", expressive of deep sorrow or\\n\\t\\t\\t\\treproach; but the use of this expression (probably a\\n\\t\\t\\t\\tcompound of \"ah! lack!\" - i.e., loss or misfortune) is\\n\\t\\t\\t\\truled out by its obsoleteness. Consequently, I am\\n\\t\\t\\t\\tconstrained to employ the more current interjection\\n\\t\\t\\t\\t\"alas\", despite the fact that it does not possess the\\n\\t\\t\\t\\tintensity of the ancient \"alack\". At any rate, the reader\\n\\t\\t\\t\\tmust bear in mind that the passage under consideration,\\n\\t\\t\\t\\talthough seemingly phrased in a conditional or an\\n\\t\\t\\t\\tinterrogatory form, implies a positive statement: namely\\n\\t\\t\\t\\t- as has been stressed by several classical commentators,\\n\\t\\t\\t\\tand most explicitly by Tabari - the statement that \"there\\n\\t\\t\\t\\thas never yet been...\", etc."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "98",
    "NoteID": "120",
    "Body": "The Qur'an points out in many places that no prophet has\\n\\t\\t\\t\\tever been immediately accepted as such and followed by\\n\\t\\t\\t\\tall of his people, and that many a community perished in\\n\\t\\t\\t\\tresult of the stubborn refusal, by the majority of its\\n\\t\\t\\t\\tmembers, to listen to the divine message. The only\\n\\t\\t\\t\\texception in this respect is said to have been the people\\n\\t\\t\\t\\tof Nineveh, who - after having at first rejected their\\n\\t\\t\\t\\tprophet Jonah, so that \"he went off in wrath\"\\n\\t\\t\\t\\t(cf. 21:87 ) - later responded to his call in unison, and\\n\\t\\t\\t\\twere saved. For the story of Jonah, see {21:87-88} and\\n\\t\\t\\t\\t{37:139-148}, as well as the corresponding notes; a\\n\\t\\t\\t\\tfuller narrative, which does not conflict with the\\n\\t\\t\\t\\tQur'anic references, is forthcoming from the Bible (The\\n\\t\\t\\t\\tBook of Jonah). In the context of the passage which we\\n\\t\\t\\t\\tare now considering, the mention of Jonah's people - who\\n\\t\\t\\t\\talone among the communities of the past heeded their\\n\\t\\t\\t\\tprophet before it was too late - is meant to warn the\\n\\t\\t\\t\\thearers and readers of the Qur'an that a deliberate\\n\\t\\t\\t\\trejection of its message by \"those against whom God's\\n\\t\\t\\t\\tword [of judgment] has come true\" (see verse {96}) is\\n\\t\\t\\t\\tbound to result in their spiritual doom and,\\n\\t\\t\\t\\tconsequently, in grievous suffering in the life to come."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "98",
    "NoteID": "121",
    "Body": "Lit., \"for a time\", i.e., their natural life-span (Manar\\n\\t\\t\\t\\tXI, 483)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "99",
    "NoteID": "122",
    "Body": "The Qur'an stresses repeatedly the fact that, \"had He so\\n\\t\\t\\t\\twilled, He would have guided you all aright\" ( 6:149 ) -\\n\\t\\t\\t\\tthe obvious implication being that He has willed it\\n\\t\\t\\t\\totherwise: namely, that He has given man the freedom to\\n\\t\\t\\t\\tchoose between right and wrong, thus raising him to the\\n\\t\\t\\t\\tstatus of a moral being (in distinction from other\\n\\t\\t\\t\\tanimals, which can only follow their instincts). See, in\\n\\t\\t\\t\\tthis context, surah {6}, note [143], as well as - in\\n\\t\\t\\t\\tconnection with the allegory of the Fall - surah {7},\\n\\t\\t\\t\\tnote [16]."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "100",
    "NoteID": "123",
    "Body": "I.e., by virtue of God's guidance and within the compass\\n\\t\\t\\t\\tof what He has decreed to be man's nature, comprising the\\n\\t\\t\\t\\tability to discriminate between right and wrong. Since\\n\\t\\t\\t\\tman's freedom of moral choice expresses itself in his\\n\\t\\t\\t\\twillingness or unwillingness to conform to his true\\n\\t\\t\\t\\tGod-willed nature, it can be said to depend, in the last\\n\\t\\t\\t\\tresort, on God's grace. (Cf. in this respect surah {2},\\n\\t\\t\\t\\tnote [19], as well as surah {14}, note [4].)"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "100",
    "NoteID": "124",
    "Body": "Cf.  8:22  and {55}, as well as the corresponding note\\n\\t\\t\\t\\t[58]. As in those verses, unbelief is here shown to be\\n\\t\\t\\t\\tthe result of a person's a-priori unwillingness to use\\n\\t\\t\\t\\this reason with a view to understanding God's messages,\\n\\t\\t\\t\\tbe they directly expressed in the revelations granted to\\n\\t\\t\\t\\tHis prophets, or - as the Qur'an once again stresses in\\n\\t\\t\\t\\tthe next verse - open to man's perception in the\\n\\t\\t\\t\\tobservable phenomena of His creation."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "103",
    "NoteID": "125",
    "Body": "My long interpolation at the beginning of this verse is\\n\\t\\t\\t\\tbased, in the main, on Zamakhshari's interpretation of\\n\\t\\t\\t\\tit. It is necessitated by the fact that the adverbial\\n\\t\\t\\t\\tconjunction thumma (\"thereupon\" or \"thereafter\") does not\\n\\t\\t\\t\\trelate here to the immediately preceding passage but to a\\n\\t\\t\\t\\ttheme repeatedly occurring in the Qur'an and only\\n\\t\\t\\t\\tindirectly alluded to in verse {102} above: namely, the\\n\\t\\t\\t\\texperiences of the earlier prophets with their\\n\\t\\t\\t\\trecalcitrant communities, the doom of those who gave the\\n\\t\\t\\t\\tlie to their messages and, in every case, a divine\\n\\t\\t\\t\\tdeliverance of the prophet concerned and of those who\\n\\t\\t\\t\\tfollowed him. Rashid Rida' describes this passage,\\n\\t\\t\\t\\trightly, as \"one of the most outstanding examples of the\\n\\t\\t\\t\\telliptic mode of expression (ijaz) to be found in the\\n\\t\\t\\t\\tQur'an\" (Manar XI, 487)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "103",
    "NoteID": "126",
    "Body": "Razi explains the phrase haqqan 'alayna (lit., \"as is\\n\\t\\t\\t\\tincumbent upon Us\") as denoting no more than a logical\\n\\t\\t\\t\\tnecessity, i.e., the unavoidable fulfilment of God's\\n\\t\\t\\t\\t\"willing it upon Himself\", and not a \"duty\" on His part:\\n\\t\\t\\t\\tfor, neither is anything \"incumbent\" upon Him who has the\\n\\t\\t\\t\\tpower to will anything, nor - as Razi points out - has\\n\\t\\t\\t\\tman any \"right\" with regard to his Creator."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "104",
    "NoteID": "127",
    "Body": "Sc., \"and call you to account on Judgment Day\". The use\\n\\t\\t\\t\\tof the pronoun alladhina in the phrase \"those whom you\\n\\t\\t\\t\\tworship\" shows that it relates here to rational beings -\\n\\t\\t\\t\\tlike saints, etc. - and not to inanimate representations.\\n\\t\\t\\t\\tAs regards the term din (rendered here as \"faith\", see\\n\\t\\t\\t\\tthe first half of note [249] on  2:256 )."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "104",
    "NoteID": "128",
    "Body": "The specific reference, in this context, to God as the\\n\\t\\t\\t\\tOne who causes all living beings to die is meant to\\n\\t\\t\\t\\timpress upon \"those who deny the truth\" the fact that\\n\\t\\t\\t\\tafter their death they will be placed before Him for\\n\\t\\t\\t\\tjudgment."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "105",
    "NoteID": "129",
    "Body": "In classical Arabic usage, and particularly in the\\n\\t\\t\\t\\tQur'an, the word \"face\" is often employed as a metonym\\n\\t\\t\\t\\tfor one's whole being because it is the face, more than\\n\\t\\t\\t\\tany other part of the human body, that expresses man's\\n\\t\\t\\t\\tpersonality ([cf. surah {2}, note [91]). - For an\\n\\t\\t\\t\\texplanation of the term hanif, see surah {2}, note [110]."
  }
]
