[
  {
    "SurahNumber": "11",
    "AyahNumber": "1",
    "NoteID": "1492",
    "Body": "For the meaning of these Letters, see App. I."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "1",
    "NoteID": "1493",
    "Body": "See n. 347 to iii. 7. Every basic principle is included\\n\\t\\t\\t\\tin Allah's Revelation, and it is further illustrated and\\n\\t\\t\\t\\texplained in detail."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "2",
    "NoteID": "1494",
    "Body": "Al-Mustafa's Message-as was the Message of all\\n\\t\\t\\t\\tapostles-was to warn against evil, and to bring the glad\\n\\t\\t\\t\\ttidings of Allah's Mercy and Grace to all who would\\n\\t\\t\\t\\treceive it in Faith and trust in Allah. This double\\n\\t\\t\\t\\tMessage is preached illustratively in this Sura."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "3",
    "NoteID": "1495",
    "Body": "The enjoyment of all good and true things in life refers,\\n\\t\\t\\t\\tI think, to the present life with its limited term, and\\n\\t\\t\\t\\tthe abounding Grace refers to the higher reward, which\\n\\t\\t\\t\\tbegins here but is completed in the life to come."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "5",
    "NoteID": "1496",
    "Body": "The heart (literally breast in Arabic) is already well\\n\\t\\t\\t\\tguarded in the body; and secrets are supposed to be\\n\\t\\t\\t\\thidden in the heart or breast. Foolish persons might\\n\\t\\t\\t\\tfurther cover up their hearts with cloaks, but even so,\\n\\t\\t\\t\\tnothing can be hidden from Allah."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "5",
    "NoteID": "1497",
    "Body": "Cf. iii. 119."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "6",
    "NoteID": "1498",
    "Body": "Cf. vi. 59. Nothing happens in Creation except by the\\n\\t\\t\\t\\tWord of Allah and with the knowledge of Allah. Not a leaf\\n\\t\\t\\t\\tstirs but by His Will. Its maintenance in every sense is\\n\\t\\t\\t\\tdependent on His Will."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "6",
    "NoteID": "1499",
    "Body": "Mustaqarr = definite abode; where a thing stops or stays\\n\\t\\t\\t\\tfor some time, where it is established. Mustauda = where\\n\\t\\t\\t\\ta thing is laid up or deposited for a little while.\\n\\t\\t\\t\\tReferring to animals, the former denotes its life on this\\n\\t\\t\\t\\tearth; the latter its temporary pre-natal existence in\\n\\t\\t\\t\\tthe egg or the womb and its after-death existence in the\\n\\t\\t\\t\\ttomb or whatever state it is in until its resurrection."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "6",
    "NoteID": "1500",
    "Body": "Cf. vi. 59 and n. 880, and x. 61 and n. 1450."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "7",
    "NoteID": "1501",
    "Body": "See n. 1031 to vii. 54."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "7",
    "NoteID": "1502",
    "Body": "It is scientifically correct to say that all life was\\n\\t\\t\\t\\tevolved out of the waters, and this statement also occurs\\n\\t\\t\\t\\tin the Qur-an, xxi. 30. Some such meaning, I think, also\\n\\t\\t\\t\\tattaches to the Gen. i. 2. The past tense \"was\" refers to\\n\\t\\t\\t\\tthe time before life developed in solid forms, on land\\n\\t\\t\\t\\tand in air."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "7",
    "NoteID": "1503",
    "Body": "The Creation we see around us is not idle sport or play\\n\\t\\t\\t\\t(in Hindi, Lila) or whim on the part of Allah. It is the\\n\\t\\t\\t\\tmedium through which our spiritual life is to develop,\\n\\t\\t\\t\\twith such free-will as we have. This life is our testing\\n\\t\\t\\t\\ttime."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "7",
    "NoteID": "1504",
    "Body": "The Unbelievers, who do not believe in a Future life,\\n\\t\\t\\t\\tthink all talk of it is like a sorcerer's talk, empty of\\n\\t\\t\\t\\treality. But in this they show their ignorance, and they\\n\\t\\t\\t\\tare begging the question."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "8",
    "NoteID": "1505",
    "Body": "As much as to say: \"Oh! all this talk of punishment is\\n\\t\\t\\t\\tnonsense. There is no such thing!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "9",
    "NoteID": "1506",
    "Body": "He does not realise that some kinds of chastening are\\n\\t\\t\\t\\tgood for discipline and the training of our spiritual\\n\\t\\t\\t\\tfaculties."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "10",
    "NoteID": "1507",
    "Body": "He takes it as a matter of course, or as due to his own\\n\\t\\t\\t\\tmerit or cleverness! He does not realise that both in\\n\\t\\t\\t\\tgood and ill fortune there is a beneficent purpose in the\\n\\t\\t\\t\\tPlan of Allah."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "11",
    "NoteID": "1508",
    "Body": "Their attitude is the right one: to take ill-fortune with\\n\\t\\t\\t\\tfortitude and good fortune with humility, and in either\\n\\t\\t\\t\\tcase go on persevering in good deeds to their\\n\\t\\t\\t\\tfellow-creatures."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "12",
    "NoteID": "1509",
    "Body": "Every Prophet of Allah, when he not only encounters\\n\\t\\t\\t\\topposition, but is actually accused of falsehood and\\n\\t\\t\\t\\tthose very evils which he is protesting against, may feel\\n\\t\\t\\t\\tinclined, in his human weakness, to ask himself the\\n\\t\\t\\t\\tquestion. \"Supposing I omit this little point, will\\n\\t\\t\\t\\tAllah's Truth then be accepted more readily? Or he may\\n\\t\\t\\t\\tthink to himself, \"If I had only more money to organise\\n\\t\\t\\t\\tmy campaign, or something which will draw people's\\n\\t\\t\\t\\tattention, like the company of an angel, how much better\\n\\t\\t\\t\\tcan I push my Message?\" He is told that truth must be\\n\\t\\t\\t\\tdelivered as it is revealed, even though portions of it\\n\\t\\t\\t\\tmay be unpalatable, and that resources and other means to\\n\\t\\t\\t\\tdraw people to him are beside the point. He must use just\\n\\t\\t\\t\\tsuch resources and opportunities as he has, and leave the\\n\\t\\t\\t\\trest to Allah."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "13",
    "NoteID": "1510",
    "Body": "Cf. ii. 23 and x. 38."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "15",
    "NoteID": "1511",
    "Body": "If worldly men desire the glitter of this world, they\\n\\t\\t\\t\\tshall have it in full measure, but it is false glitter,\\n\\t\\t\\t\\tand it involves the negation of that spiritual life which\\n\\t\\t\\t\\tcomes from the guidance of the inner light and from the\\n\\t\\t\\t\\trevelation of Allah, as described in verse 17 below."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "17",
    "NoteID": "1512",
    "Body": "\"A witness from Himself': i.e., the Book which was given\\n\\t\\t\\t\\tto Al-Mustafa, the Holy Qur-an, which is compared to the\\n\\t\\t\\t\\toriginal Revelation given to Moses. We make no difference\\n\\t\\t\\t\\tbetween one true and genuine Message and another, nor\\n\\t\\t\\t\\tbetween one apostle and another,-for they all come from\\n\\t\\t\\t\\tthe One True God."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "17",
    "NoteID": "1513",
    "Body": "\"Guide\": the Arabic word here is Imam, a leader, a guide,\\n\\t\\t\\t\\tone that directs to the true Path. Such a direction is an\\n\\t\\t\\t\\tinstance of the Mercy and Goodness of Allah to man. The\\n\\t\\t\\t\\tQur-an and the Prophet Muhammad are also called, each, a\\n\\t\\t\\t\\tGuide and a Mercy, and so are these epithets applicable\\n\\t\\t\\t\\tto previous Books and Prophets."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "19",
    "NoteID": "1514",
    "Body": "Cf. vii. 45."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "20",
    "NoteID": "1515",
    "Body": "Cf. vii. 38. In this context, it is implied that they\\n\\t\\t\\t\\tcommitted a two-fold wrong: (1) in inventing falsehoods\\n\\t\\t\\t\\tagainst Allah, which deadened their own soul, and (2) in\\n\\t\\t\\t\\tleading others astray or hindering them from Allah's\\n\\t\\t\\t\\tpath. Thus they lost the faculty of hearing, which they\\n\\t\\t\\t\\tmight have used to hear the Word of Allah, and they\\n\\t\\t\\t\\tblinded the faculty of sight by shutting out Allah's\\n\\t\\t\\t\\tlight."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "23",
    "NoteID": "1516",
    "Body": "Note that the humility is to be \"before their Lord,\"\\n\\t\\t\\t\\ti.e., in Allah's sight. There is no virtue, quite the\\n\\t\\t\\t\\tcontrary, in rubbing our noses to the ground before men.\\n\\t\\t\\t\\tWe are not to be arrogant even before men because we are\\n\\t\\t\\t\\thumble as in Allah's sight. Nor does true humility lose\\n\\t\\t\\t\\tself-confidence; for that self-confidence arises from\\n\\t\\t\\t\\tconfidence in the support and help of Allah."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "26",
    "NoteID": "1517",
    "Body": "Noah's mission was to a wicked world, plunged in sin. The\\n\\t\\t\\t\\tmission had a double character, as in the mission of all\\n\\t\\t\\t\\tProphets of Allah: it had to warn men against evil and\\n\\t\\t\\t\\tcall them to repentance, and it had to give them the glad\\n\\t\\t\\t\\ttidings of Allah's Grace in case they turned back to\\n\\t\\t\\t\\tAllah: it was a Guidance and Mercy."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "27",
    "NoteID": "1518",
    "Body": "The Unbelievers were impelled by three powerful human\\n\\t\\t\\t\\tmotives of evil to resist Grace: (1) jealousy of other\\n\\t\\t\\t\\tmen; they said, \"Why, you are no better than ourselves,\"\\n\\t\\t\\t\\thalf perceiving the Prophet's superiority, and half\\n\\t\\t\\t\\tignoring it; (2), contempt of the weak and lowly, who are\\n\\t\\t\\t\\toften better intellectually, morally, and spiritually;\\n\\t\\t\\t\\tthey said, \"We cannot believe or do what these fellows,\\n\\t\\t\\t\\tour inferiors in social rank, believe or do!\"; (3)\\n\\t\\t\\t\\tarrogance and self-sufficiency, which is a vice cognate\\n\\t\\t\\t\\tto (2), looked at from a different angle; they said, \"We\\n\\t\\t\\t\\tare really better than the lot of you!\" Now the claim\\n\\t\\t\\t\\tmade on behalf of Allah's Message attacked all these\\n\\t\\t\\t\\tthree attitudes. And all they could say against it was to\\n\\t\\t\\t\\tabuse it impatiently, and call it a lie."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "28",
    "NoteID": "1519",
    "Body": "Noah's answer (like that of the Prophet of Allah who\\n\\t\\t\\t\\tspoke in later ages in Makkah and Madinah) is a pattern\\n\\t\\t\\t\\tof humility, gentleness, firmness, persuasiveness, truth,\\n\\t\\t\\t\\tand love for his own people. First, he meekly (not\\n\\t\\t\\t\\texultingly) informs them that he has got a Message from\\n\\t\\t\\t\\tAllah. Secondly, he tells them that it is a Message of\\n\\t\\t\\t\\tMercy even in its warning, though in their arrogance the\\n\\t\\t\\t\\tMercy may be hidden from them. Thirdly, he tells them\\n\\t\\t\\t\\tplainly that there can be no compulsion in Religion: but\\n\\t\\t\\t\\twill they not accept with goodwill what is for their own\\n\\t\\t\\t\\tbenefit? He pleads with them as one of their own."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "29",
    "NoteID": "1520",
    "Body": "The fourth point in Noah's address meets their accusation\\n\\t\\t\\t\\tthat he was a liar, implying that he was serving some\\n\\t\\t\\t\\tselfish end of his own: on the contrary, he says, he\\n\\t\\t\\t\\tseeks no reward from them but will bear any insults they\\n\\t\\t\\t\\theap on him, for he looks to Allah rather than men. But,\\n\\t\\t\\t\\tfifthly if they insult the poor and needy who come to him\\n\\t\\t\\t\\tin Faith, and think that he would send them away in order\\n\\t\\t\\t\\tto attract the great ones of the land, he tells them\\n\\t\\t\\t\\tplainly that they are mistaken. In fact, (sixthly), he\\n\\t\\t\\t\\thas no hesitation in telling the blunt truth that they\\n\\t\\t\\t\\tare the ignorant ones, and not the poor who came to seek\\n\\t\\t\\t\\tAllah's Truth!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "30",
    "NoteID": "1521",
    "Body": "But (seventhly) again he pleads, with as much earnestness\\n\\t\\t\\t\\tas ever, that he is one of themselves, and just doing his\\n\\t\\t\\t\\ttruest duty. Would they have him do less? Indeed, would\\n\\t\\t\\t\\tthey not themselves see the Truth and come into the\\n\\t\\t\\t\\tgoodly company of Believers?"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "31",
    "NoteID": "1522",
    "Body": "The eighth point that Noah urges is that he is not a mere\\n\\t\\t\\t\\tvulgar soothsayer pretending to reveal secrets not worth\\n\\t\\t\\t\\tknowing, nor an angel living in another world, with no\\n\\t\\t\\t\\tties to them. He is their real well-wisher, delivering a\\n\\t\\t\\t\\ttrue Message from Allah."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "31",
    "NoteID": "1523",
    "Body": "Cf. vi. 50 and n. 867."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "31",
    "NoteID": "1524",
    "Body": "But Noah will not close his argument without defending\\n\\t\\t\\t\\tthe men of Faith, whom the Chiefs despise because they\\n\\t\\t\\t\\tare lacking in worldly goods. He tells them plainly that\\n\\t\\t\\t\\tAllah perhaps sees in them something in which they, the\\n\\t\\t\\t\\tarrogant Chiefs, are lacking. Their spiritual faculties\\n\\t\\t\\t\\tcan only be appreciated truly by Him to Whom all the\\n\\t\\t\\t\\tsecrets of the spirit are open. But he, Noah, must\\n\\t\\t\\t\\tdeclare boldly his own Faith, and this is the ninth point\\n\\t\\t\\t\\tin his argument."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "32",
    "NoteID": "1525",
    "Body": "To Noah's address the worldly Chiefs give a\\n\\t\\t\\t\\tcharacteristic reply. In its aggressive spirit it is the\\n\\t\\t\\t\\tvery antithesis of the gentle remonstrances of Noah.\\n\\t\\t\\t\\tBecause he had gently and patiently argued with them,\\n\\t\\t\\t\\tthey impatiently accuse him of \"disputing with them\" and\\n\\t\\t\\t\\t\"prolonging the dispute\". They are unable to deal with\\n\\t\\t\\t\\this points. So they arrogantly throw out their challenge,\\n\\t\\t\\t\\twhich is a compound of hectoring insolence, unreasoning\\n\\t\\t\\t\\tscepticism, and biting irony. \"You foretell disaster to\\n\\t\\t\\t\\tus if we don't mend our ways! Let us see you bring it on!\\n\\t\\t\\t\\tNow, if you please! Or shall we have to call you a liar?\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "33",
    "NoteID": "1526",
    "Body": "To the blasphemous challenge addressed to Noah his only\\n\\t\\t\\t\\tanswer could be: \"I never claimed that I could punish\\n\\t\\t\\t\\tyou. All punishment is in the hands of Allah, and He\\n\\t\\t\\t\\tknows best when His punishment will descend. But this I\\n\\t\\t\\t\\tcan tell you! His punishment is sure if you do not\\n\\t\\t\\t\\trepent, and when it comes, you will not be able to ward\\n\\t\\t\\t\\tit off!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "34",
    "NoteID": "1527",
    "Body": "But Noah's heart bleeds for his people. They are\\n\\t\\t\\t\\tpreparing their own undoing! All his efforts are to be\\n\\t\\t\\t\\tvain! Obstinate as they are, Allah's grace must be\\n\\t\\t\\t\\twithdrawn, and then who can help them, and what use is\\n\\t\\t\\t\\tany counsel? But again he will try to remind them of\\n\\t\\t\\t\\ttheir Lord, and turn their face to Him. For their\\n\\t\\t\\t\\tultimate return to His judgment-seat is certain, to\\n\\t\\t\\t\\tanswer for their conduct."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "35",
    "NoteID": "1528",
    "Body": "The fine narrative of dramatic power is here interrupted\\n\\t\\t\\t\\tby a verse which shows that the story of Noah is also a\\n\\t\\t\\t\\tParable for the time and the ministry of Muhammad the\\n\\t\\t\\t\\tProphet. The wonderful force and aptness of the story\\n\\t\\t\\t\\tcannot be denied. The enemy therefore turns and says,\\n\\t\\t\\t\\t\"Oh! but you invented it!\" The answer is, \"No! but it is\\n\\t\\t\\t\\tAllah's own truth! You may be accustomed to dealing in\\n\\t\\t\\t\\tfalsehoods, but I protest that I am free from such sins.\"\\n\\t\\t\\t\\tThe place of this verse here corresponds to the place of\\n\\t\\t\\t\\tverse 49 at the end of the next Section. While\\n\\t\\t\\t\\tunderstanding this verse to refer to Al-Mustafa, as most\\n\\t\\t\\t\\tof the accepted Commentators understand it, it is\\n\\t\\t\\t\\tpossible also, I think, to read it into the story of\\n\\t\\t\\t\\tNoah, for all Prophets have similar experience."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "36",
    "NoteID": "1529",
    "Body": "The story of Noah is resumed. A point was reached, when\\n\\t\\t\\t\\tit was clear that there was no hope of saving the\\n\\t\\t\\t\\tsinners, who were courting their own destruction. It was\\n\\t\\t\\t\\tto be a great Flood. So Noah was ordered to construct a\\n\\t\\t\\t\\tgreat Ark or Ship, a heavy vessel to remain afloat in the\\n\\t\\t\\t\\tFlood, so that the righteous could be saved in it."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "37",
    "NoteID": "1530",
    "Body": "It was to be built under the special instructions of\\n\\t\\t\\t\\tAllah, to serve the special purpose it was intended to\\n\\t\\t\\t\\tserve."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "38",
    "NoteID": "1531",
    "Body": "The ridicule of the sinners, from their own point of\\n\\t\\t\\t\\tview, was natural. Here was a Prophet turned carpenter!\\n\\t\\t\\t\\tHere was a plain in the higher reaches of the\\n\\t\\t\\t\\tMesopotamian basin, drained by the majestic Tigris, over\\n\\t\\t\\t\\t800 to 900 miles from the sea Arabian Gulf in a straight\\n\\t\\t\\t\\tline! Yet he talks of a flood like the Sea! All material\\n\\t\\t\\t\\tcivilisations pride themselves on their Public Works and\\n\\t\\t\\t\\ttheir drainage schemes. And here was a fellow relying on\\n\\t\\t\\t\\tAllah! But did not their narrow pride seem ridiculous\\n\\t\\t\\t\\talso to the Prophet of Allah! Here were men steeped in\\n\\t\\t\\t\\tsin and insolence! And they pit themselves against the\\n\\t\\t\\t\\tpower and the promise of Allah! Truly a contemptible race\\n\\t\\t\\t\\tis man!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "38",
    "NoteID": "1532",
    "Body": "The Arabic Aorist may be construed either by the present\\n\\t\\t\\t\\ttense or the future tense, and both make good sense here.\\n\\t\\t\\t\\tFollowing Zamakhshari, I construe in the present tense,\\n\\t\\t\\t\\tbecause the future is so tragic for the sinners. For the\\n\\t\\t\\t\\ttime being the worldly ones looked down on the Believers\\n\\t\\t\\t\\tas they always do: but the Believers relied on Allah, and\\n\\t\\t\\t\\tpitied their critics for knowing no better!-for their\\n\\t\\t\\t\\tarrogance was really ridiculous."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "40",
    "NoteID": "1533",
    "Body": "Far-at-tannuru. Two interpretations have been given: (1)\\n\\t\\t\\t\\tthe fountains or the springs on the surface of the earth\\n\\t\\t\\t\\tbubbled over or gushed forth; or (2) the oven boiled\\n\\t\\t\\t\\tover. The former has the weight of the best authority\\n\\t\\t\\t\\tbehind it and I prefer it. Moreover, the same phrase\\n\\t\\t\\t\\toccurs in xxiii. 27, where it is a clause coordinated (as\\n\\t\\t\\t\\there) with the coming of Allah's Command. These two\\n\\t\\t\\t\\tpassages may be compared with liv. 11-12, where it is\\n\\t\\t\\t\\tsaid that water poured forth from the skies and gushed\\n\\t\\t\\t\\tforth from the springs. This double action is familiar to\\n\\t\\t\\t\\tany one who has seen floods on a large scale. The rain\\n\\t\\t\\t\\tfrom above would saturate the great Ararat Plateau, and\\n\\t\\t\\t\\tgive great force to the springs and fountains in the\\n\\t\\t\\t\\tvalley of the Tigris below."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "40",
    "NoteID": "1534",
    "Body": "Zaujaini: the dual number refers to the two individuals\\n\\t\\t\\t\\tin each pair of opposite sexes. Some of the most\\n\\t\\t\\t\\tauthoritative Commentators (e.g., Imam Razi) construe in\\n\\t\\t\\t\\tthis sense, though others construe it to mean two pairs\\n\\t\\t\\t\\tof each species."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "40",
    "NoteID": "1535",
    "Body": "A disobedient and recalcitrant son (or step-son or\\n\\t\\t\\t\\tgrandson) of Noah is mentioned below (xi. 42-43, 45-56).\\n\\t\\t\\t\\tA member of the family, who breaks away from the\\n\\t\\t\\t\\ttraditions of the family in things that matter, ceases to\\n\\t\\t\\t\\tshare in the privileges of the family."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "42",
    "NoteID": "1536",
    "Body": "The simile of mountains applies to the waves, which were\\n\\t\\t\\t\\tmountain high, -literally, for the peaks were being\\n\\t\\t\\t\\tsubmerged."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "43",
    "NoteID": "1537",
    "Body": "The Unbelievers refuse to believe in Allah, but have\\n\\t\\t\\t\\tgreat faith in material things! This young man was going\\n\\t\\t\\t\\tto save himself on mountain peaks, not knowing that the\\n\\t\\t\\t\\tpeaks were themselves being submerged."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "44",
    "NoteID": "1538",
    "Body": "A wonderful passage. The whole picture is painted in just\\n\\t\\t\\t\\ta few words. The chain of material facts are linked\\n\\t\\t\\t\\ttogether, not only in their relations to each other, but\\n\\t\\t\\t\\talso in their relation to the spiritual forces that\\n\\t\\t\\t\\tcontrol them, and the spiritual consequences of Sin and\\n\\t\\t\\t\\twrong-doing. The drowning in the material sense was the\\n\\t\\t\\t\\tleast part of the Penalty. A whole new world came into\\n\\t\\t\\t\\texistence after the Deluge."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "44",
    "NoteID": "1539",
    "Body": "Let us get a little idea of the geography of the place.\\n\\t\\t\\t\\tThe letters J.B. and K are philologically\\n\\t\\t\\t\\tinterchangeable, and Judi, Gudi, Kudi are sounds that can\\n\\t\\t\\t\\tpass into each other. There is no doubt that the name is\\n\\t\\t\\t\\tconnected with the name \"Kurd\", in which the letter r is\\n\\t\\t\\t\\ta later interpolation, for the oldest Sumerian records\\n\\t\\t\\t\\tname a people called Kuti or Gutu as holding the middle\\n\\t\\t\\t\\tTigris region not later than 2000 B.C. (see E.B.,\\n\\t\\t\\t\\tKurdistan). That region comprises the modern Turkish\\n\\t\\t\\t\\tdistrict of Bohtan, in which Jabal Judi is situated (near\\n\\t\\t\\t\\tthe frontiers of modern Turkey, modern 'lraq, and modern\\n\\t\\t\\t\\tSyria), and the town of Jazirat ibn 'Umar, (on the\\n\\t\\t\\t\\tpresent Turco-Syrian frontier), and it extends into 'Iraq\\n\\t\\t\\t\\tand Persia. The great mountain mass of the Ararat plateau\\n\\t\\t\\t\\tdominates this district. This mountain system \"is unique\\n\\t\\t\\t\\tin the Old World in containing great sheets of water that\\n\\t\\t\\t\\tare bitter lakes without outlets, Lake Van and Lake\\n\\t\\t\\t\\tUrumiya being the chief,\" (E.B., Asia). Such would be the\\n\\t\\t\\t\\tvery region for a stupendous Deluge if the usual scanty\\n\\t\\t\\t\\trainfall were to be changed into a very heavy downpour. A\\n\\t\\t\\t\\tglacier damming of Lake Van in the Ice Age would have\\n\\t\\t\\t\\tproduced the same result. The region has many local\\n\\t\\t\\t\\ttraditions connected with Noah and the Flood. The\\n\\t\\t\\t\\tBiblical legend of Mount Ararat being the resting place\\n\\t\\t\\t\\tof Noah's Ark is hardly plausible, seeing that the\\n\\t\\t\\t\\thighest peak of Ararat is over 16,000 feet high. If it\\n\\t\\t\\t\\tmeans one of the lower-peaks of the Ararat system, it\\n\\t\\t\\t\\tagrees with the Muslim tradition about Mount Judi (or\\n\\t\\t\\t\\tGudi), and this is in accordance with the oldest and best\\n\\t\\t\\t\\tlocal traditions. These traditions are accepted by\\n\\t\\t\\t\\tJosephus, by the Nestorian Christians, and indeed by all\\n\\t\\t\\t\\tthe Eastern Christians and Jews, and they are the best in\\n\\t\\t\\t\\ttouch with local traditions. See (Viscount) J. Bryce,\\n\\t\\t\\t\\t\"Transcaucasia and Ararat,\" 4th ed., 1896. p. 216."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "46",
    "NoteID": "1540",
    "Body": "See n. 5135 above. Like all Prophets of Allah, Noah was\\n\\t\\t\\t\\tkind-hearted, but he is told that there can be no\\n\\t\\t\\t\\tcompromise with evil. And Noah acknowledges the reproof.\\n\\t\\t\\t\\tThere was a wife of Noah, who was also an unbelieving\\n\\t\\t\\t\\twoman (lxvi. 10), and she suffered the fate of\\n\\t\\t\\t\\tUnbelievers."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "47",
    "NoteID": "1541",
    "Body": "Noah, in his natural affection and respect for ties of\\n\\t\\t\\t\\trelationship, was overcome with human weakness in wishing\\n\\t\\t\\t\\tto reverse the Decree of Allah. It was not sin but\\n\\t\\t\\t\\tignorance. His ignorance was corrected by divine\\n\\t\\t\\t\\tinspiration, and he immediately saw the full Truth,\\n\\t\\t\\t\\tacknowledged his error, and asked for Allah's forgiveness\\n\\t\\t\\t\\tand mercy. This is the standard set for us all."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "48",
    "NoteID": "1542",
    "Body": "Cf. ii. 126."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "48",
    "NoteID": "1543",
    "Body": "Those who truly seek Allah's light and guidance and\\n\\t\\t\\t\\tsincerely bend their will to His Will are freely admitted\\n\\t\\t\\t\\tto Allah's grace. Notwithstanding any human weaknesses in\\n\\t\\t\\t\\tthem, they are advanced higher in the stage on account of\\n\\t\\t\\t\\ttheir Faith, Trust, and Striving after Right. They are\\n\\t\\t\\t\\tgiven Allah's Peace, which gives the soul true calmness\\n\\t\\t\\t\\tand strength, and all the blessings that flow from\\n\\t\\t\\t\\tspiritual life. This was given not only to Noah and his\\n\\t\\t\\t\\tfamily but to all the righteous people who were saved\\n\\t\\t\\t\\twith him. And their descendants were also promised those\\n\\t\\t\\t\\tblessings on condition of righteousness. But some of them\\n\\t\\t\\t\\tfell from grace, as we know in history. Allah's grace is\\n\\t\\t\\t\\tnot a social or family privilege. Each people and each\\n\\t\\t\\t\\tindividual must earnestly strive for it and earn it."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "49",
    "NoteID": "1544",
    "Body": "Cf. n. 1528 to xi. 35. The sum of the whole matter is\\n\\t\\t\\t\\tthat the righteous, who work for Allah and their\\n\\t\\t\\t\\tfellow-men, may be traduced, insulted, and persecuted.\\n\\t\\t\\t\\tBut they will be sustained by Allah's Mercy. They must go\\n\\t\\t\\t\\ton working patiently, for the End will all be for them\\n\\t\\t\\t\\tand their Cause."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "50",
    "NoteID": "1545",
    "Body": "Cf. the story of Hud the Messenger of the 'Ad People, in\\n\\t\\t\\t\\tvii. 65-72. There the argument was how other Peoples\\n\\t\\t\\t\\ttreated thier prophets as the Makkans were treating\\n\\t\\t\\t\\tAl-Mustafa. Here we see another point emphasized: the\\n\\t\\t\\t\\tinsolence of the 'Ad in obstinately adhering to false\\n\\t\\t\\t\\tgods after the true God had been preached to them,\\n\\t\\t\\t\\tAllah's grace to them, and finally Allah's justice in\\n\\t\\t\\t\\tbringing them to book while the righteous were saved. The\\n\\t\\t\\t\\tlocality in which the 'Ad flourished is indicated in n.\\n\\t\\t\\t\\t1040 to vii. 65."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "52",
    "NoteID": "1546",
    "Body": "The beautiful metaphor about the skies coming down with\\n\\t\\t\\t\\train has been obscured unnecessarily in most\\n\\t\\t\\t\\ttranslations. The country of the 'Ad was an arid country,\\n\\t\\t\\t\\tand rain was the greatest blessing they could receive. We\\n\\t\\t\\t\\tcan imagine this being said in a time of famine, when the\\n\\t\\t\\t\\tpeople performed all sorts of superstitious rites and\\n\\t\\t\\t\\tinvocations instead of turning to the true God in faith\\n\\t\\t\\t\\tand repentance. Further, when we remember that there\\n\\t\\t\\t\\twere, in this tract in ancient times, dams like that at\\n\\t\\t\\t\\tMaarib, for the storage of rain water, the effect is\\n\\t\\t\\t\\tstill further heightened in pointing to Allah's care and\\n\\t\\t\\t\\tmercy in His dealing with men."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "52",
    "NoteID": "1547",
    "Body": "Adding strength to strength may refer to increase of\\n\\t\\t\\t\\tpopulation, as some Commentators think. While other parts\\n\\t\\t\\t\\tof Arabia were sparsely populated, the irrigated lands of\\n\\t\\t\\t\\tthe 'Ad supported a comparatively dense population and\\n\\t\\t\\t\\tadded to their natural strength in the arts of peace and\\n\\t\\t\\t\\twar. But the term used is perfectly general. They were a\\n\\t\\t\\t\\tpowerful people in their time. If they obeyed Allah and\\n\\t\\t\\t\\tfollowed the law of righteousness, they would be still\\n\\t\\t\\t\\tmore powerful, for \"righteousness exalteth a nation.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "53",
    "NoteID": "1548",
    "Body": "The argument of the Unbelievers is practically this: \"We\\n\\t\\t\\t\\tare not convinced by you: we don't want to be convinced:\\n\\t\\t\\t\\twe think you are a liar,-or perhaps a fool!\" (See next\\n\\t\\t\\t\\tverse)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "54",
    "NoteID": "1549",
    "Body": "See n. 1548 above. Continuing their argument, the\\n\\t\\t\\t\\tUnbelievers make a show of making all charitable\\n\\t\\t\\t\\tallowances for Hud, but in reality cut him to the quick\\n\\t\\t\\t\\tby bringing in their false gods. \"To be quite polite,\"\\n\\t\\t\\t\\tsaid they, \"we will not say that you are exactly a liar!\\n\\t\\t\\t\\tPerhaps you have been touched with imbecility! Ah yes!\\n\\t\\t\\t\\tYou rail against what you call our false gods! Some of\\n\\t\\t\\t\\tthem have paid you out, and made you a fool! Ha! ha!\"\\n\\t\\t\\t\\tThis mockery is even worse than their other false\\n\\t\\t\\t\\taccusations. For it sets up false gods against the One\\n\\t\\t\\t\\tTrue God, even in dealing with Hud. So Hud replies, with\\n\\t\\t\\t\\tspirit and indignation: \"At least keep Allah's name out\\n\\t\\t\\t\\tof your futile talk! You know as well as I do, that I\\n\\t\\t\\t\\tworship the One True God! You pretend that your false\\n\\t\\t\\t\\tgods can smite a true Prophet of Allah! I accept the\\n\\t\\t\\t\\tchallenge. Scheme and plot against me as you may, all of\\n\\t\\t\\t\\tyou-you and your gods! See if you have any power! I ask\\n\\t\\t\\t\\tfor no quarter from you! My trust is in Allah!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "55",
    "NoteID": "1550",
    "Body": "Cf. vii. 195 and n. 1168."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "56",
    "NoteID": "1551",
    "Body": "Grasp of the fore-lock; an Arabic idiom, referring to a\\n\\t\\t\\t\\thorse's fore-lock. The man who grasps it has complete\\n\\t\\t\\t\\tpower over the horse, and for the horse the fore-lock is\\n\\t\\t\\t\\tas it were the crown of his beauty, the sum of his power\\n\\t\\t\\t\\tof self-assertion. So Allah's power over all creatures is\\n\\t\\t\\t\\tunlimited and no one can withstand His decree. Cf. xcvi.\\n\\t\\t\\t\\t15- 16."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "56",
    "NoteID": "1552",
    "Body": "That is, the standard of all virtue and righteousness is\\n\\t\\t\\t\\tin the Will of Allah, the Universal Will that controls\\n\\t\\t\\t\\tall things in goodness and justice. You are on a crooked\\n\\t\\t\\t\\tPath. Allah's Path is a straight Path."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "57",
    "NoteID": "1553",
    "Body": "Hud was dealing with a people of pride and obstinate\\n\\t\\t\\t\\trebellion. He tells them that their conduct will only\\n\\t\\t\\t\\trecoil on themselves. It can do no harm to Allah or in\\n\\t\\t\\t\\tany way frustrate the beneficent Plan of Allah. He will\\n\\t\\t\\t\\tonly put some other people in their place to carry out\\n\\t\\t\\t\\tHis Plan. That Plan is referred to in the next sentence\\n\\t\\t\\t\\tas \"care and watch\" over all his Creation."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "58",
    "NoteID": "1554",
    "Body": "A few just men might suffer for the iniquities of the\\n\\t\\t\\t\\tmany. But Allah's Plan is perfect and eventually saves\\n\\t\\t\\t\\tHis own people by special Grace, if they have Faith and\\n\\t\\t\\t\\tTrust in Him."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "59",
    "NoteID": "1555",
    "Body": "Instead of following the beneficent Lord who cherished\\n\\t\\t\\t\\tthem, they followed every rebel against Allah's Law, if\\n\\t\\t\\t\\the only obtained a little power to dazzle them."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "61",
    "NoteID": "1556",
    "Body": "The story of Salih and the Thamud people has been told\\n\\t\\t\\t\\tfrom another point of view in vii. 73-79. The difference\\n\\t\\t\\t\\tin the point of view there and here is the same as in the\\n\\t\\t\\t\\tstory of Hud: see n. 1545 to xi. 50. Note how the story\\n\\t\\t\\t\\tnow is the same, and yet new points and details are\\n\\t\\t\\t\\tbrought out to illustrate each new argument. Note, also,\\n\\t\\t\\t\\thow the besetting sin of the 'Ad-pride and obstinacy-is\\n\\t\\t\\t\\tdistinguished from the besetting sin of the Thamud-the\\n\\t\\t\\t\\toppression of the poor, as illustrated by the test case\\n\\t\\t\\t\\tand symbol of the She-camel: see n. 1044 to vii, 73. All\\n\\t\\t\\t\\tsin is in a sense pride and rebellion; yet sins take\\n\\t\\t\\t\\tparticular hues in different circumstances, and these\\n\\t\\t\\t\\tcolours are brought out as in a most artistically painted\\n\\t\\t\\t\\tpicture-with the greatest economy of words and the most\\n\\t\\t\\t\\tpiercing analysis of motives. For the locality and\\n\\t\\t\\t\\thistory of the Thamud see n. 1043 to vii. 73."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "61",
    "NoteID": "1557",
    "Body": "For Anshaa as process of creation see n. 923 to vi. 98\\n\\t\\t\\t\\tand the further references given there. As to his body,\\n\\t\\t\\t\\tman has been produced from earth or clay, and his\\n\\t\\t\\t\\tsettlement on earth is a fact of his material existence.\\n\\t\\t\\t\\tTherefore we must conform to all the laws of our physical\\n\\t\\t\\t\\tbeing, in order that through our life on this earth we\\n\\t\\t\\t\\tmay develop that higher Life which belongs to the other\\n\\t\\t\\t\\tpart of our being, our spiritual heritage. Through the\\n\\t\\t\\t\\tuse we make of our health, of our tilth, of our pastures,\\n\\t\\t\\t\\tof material facts of all kinds, will develop our moral\\n\\t\\t\\t\\tand spiritual nature."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "62",
    "NoteID": "1558",
    "Body": "Salih's life with his people has been so righteous (like\\n\\t\\t\\t\\tthat of al-Amin in later times) that he might have been\\n\\t\\t\\t\\tchosen leader or king if he had only conformed to their\\n\\t\\t\\t\\tsuperstitions and supported their sins. But he was born\\n\\t\\t\\t\\tfor a higher mission-that of a preacher of truth and\\n\\t\\t\\t\\trighteousness and an ardent opponent of selfish privilege\\n\\t\\t\\t\\tand a champion of the rights of humanity on Allah's free\\n\\t\\t\\t\\tearth by the symbol of the she-camel: see n. 1044 to vii.\\n\\t\\t\\t\\t73."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "63",
    "NoteID": "1559",
    "Body": "\"Allah has been good to me and bestowed on me His light\\n\\t\\t\\t\\tand the inestimable privilege of carrying His mission to\\n\\t\\t\\t\\tyou. Don't you see that if I fail to carry out his\\n\\t\\t\\t\\tmission, I shall have to answer before Him? Who can help\\n\\t\\t\\t\\tme in that case? The only thing which you can add to may\\n\\t\\t\\t\\tmisfortunes would be total perdition in the Hereafter.\"\\n\\t\\t\\t\\tCf. xi. 28."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "64",
    "NoteID": "1560",
    "Body": "Salih does not merely take up a negative attitude. He\\n\\t\\t\\t\\tputs forward the she-camel as a sign see n. 1044 to vii.\\n\\t\\t\\t\\t73. \"Give up your selfish monopoly. Make Allah's gifts on\\n\\t\\t\\t\\tthis free earth available to all. Give the poor their\\n\\t\\t\\t\\trights, including grazing rights on common lands. Show\\n\\t\\t\\t\\tyour penitence and your new attitude by leaving this\\n\\t\\t\\t\\tshe-camel to graze freely. She is a Symbol, and therefore\\n\\t\\t\\t\\tsacred to you.\" But their only reply was to defy the\\n\\t\\t\\t\\tappeal and ham-string the camel. And so they went the way\\n\\t\\t\\t\\tof all sinners-to total perdition."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "65",
    "NoteID": "1561",
    "Body": "Just three days' time for further thought and repentance!\\n\\t\\t\\t\\tBut they paid no heed. A terrible earthquake came by\\n\\t\\t\\t\\tnight, preceded by a mighty rumbling blast (probably\\n\\t\\t\\t\\tvolcanic), such as is well-known in earthquake areas. It\\n\\t\\t\\t\\tcame by night and buried them in their own fortress\\n\\t\\t\\t\\thomes, which they thought such places of security! The\\n\\t\\t\\t\\tmorning found them lying on their faces hidden from the\\n\\t\\t\\t\\tlight. How the mighty were brought low!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "66",
    "NoteID": "1562",
    "Body": "Cf. xi, 58 above and n. 1554. For 'Aziz, see n. 2818 to\\n\\t\\t\\t\\txxi 40."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "67",
    "NoteID": "1563",
    "Body": "Cf. xi 78 and n. 1047,-also n. 1561 above."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "68",
    "NoteID": "1564",
    "Body": "Cf. xi. 60 above."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "69",
    "NoteID": "1565",
    "Body": "According to the sequence of Sura vii, the next reference\\n\\t\\t\\t\\tshould be to the story of Lut, and that story commences\\n\\t\\t\\t\\tat xi. 77 below, but it is introduced by a brief\\n\\t\\t\\t\\treference to an episode in the life of his uncle Abraham,\\n\\t\\t\\t\\tfrom whose seed sprang the peoples to whom Moses, Jesus,\\n\\t\\t\\t\\tand Muhammad Al-Mustafa were sent with the major\\n\\t\\t\\t\\tRevelations. Abraham had by this time passed through the\\n\\t\\t\\t\\tfire of persecutions in the Mesopotamian valleys: he had\\n\\t\\t\\t\\tleft behind him the ancestral idolatry of Ur of the\\n\\t\\t\\t\\tChaldees; he had been tried and he had triumphed over the\\n\\t\\t\\t\\tpersecution of Nimrud: he had now taken up his residence\\n\\t\\t\\t\\tin Canaan, from which his newphew Lot (Lut) was called to\\n\\t\\t\\t\\tpreach to the wicked Cities of the Plain east of the Dead\\n\\t\\t\\t\\tsea which is itself called Bahr Lut. Thus prepared and\\n\\t\\t\\t\\tsanctified, he was now ready to receive the Message that\\n\\t\\t\\t\\the was chosen to be the progenitor of a great line of\\n\\t\\t\\t\\tProphets, and that Message is now referred to. Can we\\n\\t\\t\\t\\tlocalise Nimrud? If local tradition in place-names can be\\n\\t\\t\\t\\trelied upon, this king must have ruled over the tract\\n\\t\\t\\t\\twhich includes the modern Nimrud, on the Tigris, about\\n\\t\\t\\t\\ttwenty miles south of Mosul. This is the site of Assyrian\\n\\t\\t\\t\\truins of great interest, but the rise of Assyria as an\\n\\t\\t\\t\\tEmpire was of course much later than the time of Abraham.\\n\\t\\t\\t\\tThe Assyrian city was called Kalakh (or Calah), and\\n\\t\\t\\t\\tarchaeological excavations carried out there have yielded\\n\\t\\t\\t\\tvaluable results, which are however irrelevant for our\\n\\t\\t\\t\\tCommentary. A) Abraham received the strangers with a\\n\\t\\t\\t\\tsalutation of Peace, and immediately placed before them a\\n\\t\\t\\t\\tsumptuous meal of roasted calf. The strangers were\\n\\t\\t\\t\\tembarrassed. They were angels and did not eat. If\\n\\t\\t\\t\\thospitality is refused, it means that those who refuse it\\n\\t\\t\\t\\tmeditate no good to the would be host. Abraham therefore\\n\\t\\t\\t\\thad a feeling of mistrust and fear in his mind, which the\\n\\t\\t\\t\\tstrangers at once set at rest by saying that their\\n\\t\\t\\t\\tmission was in the first place to help Lut as a warner to\\n\\t\\t\\t\\tthe Cities of Plain. But in the second place they had\\n\\t\\t\\t\\tgood news for Abraham; he was to be the father of great\\n\\t\\t\\t\\tpeoples!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "70",
    "NoteID": "1566",
    "Body": "The people of Lut means the people to whom Lut was sent\\n\\t\\t\\t\\ton his mission of warning, the people of the wicked\\n\\t\\t\\t\\tCities of the Plain, Sodom and Gomorrah."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "71",
    "NoteID": "1567",
    "Body": "The narrative is very concise, and most of the details\\n\\t\\t\\t\\tare taken for granted. We may suppose that the angels\\n\\t\\t\\t\\tgave the news first to Abraham, who was already,\\n\\t\\t\\t\\taccording to Gen. xxi 5, a hundred years of age, and his\\n\\t\\t\\t\\twife Sarah was not far short of ninety (Gen. xvii. 7).\\n\\t\\t\\t\\tShe was probably screened. She could hardly believe the\\n\\t\\t\\t\\tnews. In her scepticism (some say in her joy) she\\n\\t\\t\\t\\tlaughed. But the news was formally communicated to her\\n\\t\\t\\t\\tthat she was to be the mother of Isaac, and through\\n\\t\\t\\t\\tIsaac, the grandmother of Jacob. Jacob was to be a\\n\\t\\t\\t\\tfruitful tree, with his twelve sons. But hitherto Abraham\\n\\t\\t\\t\\thad had no son by her, and Sarah was past the age of\\n\\t\\t\\t\\tchild-bearing. \"How could it be?\" she thought."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "72",
    "NoteID": "1568",
    "Body": "This is as much a sigh of past regrets as of future\\n\\t\\t\\t\\twistfulness!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "73",
    "NoteID": "1569",
    "Body": "Ahl-ul-bait = people of the house, a polite form of\\n\\t\\t\\t\\taddressing the wife and members of the family. Blessings\\n\\t\\t\\t\\tare here invoked on the whole family."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "73",
    "NoteID": "1570",
    "Body": "This little episode of Abraham's life comes in fitly as\\n\\t\\t\\t\\tone of the illustrations of Allah's wonderful providence\\n\\t\\t\\t\\tin His dealings with man. Abraham had had a tussle with\\n\\t\\t\\t\\this father on behalf of Truth and Unity (vi. 74); he had\\n\\t\\t\\t\\tpassed through the fire unscathed (xxi. 68-69); he had\\n\\t\\t\\t\\ttravelled to far countries, and was now ready to receive\\n\\t\\t\\t\\this great mission as the fountain-head of prophets in his\\n\\t\\t\\t\\told age. Humanly speaking it seemed impossible that he\\n\\t\\t\\t\\tshould have a son at his age, and yet it came to pass and\\n\\t\\t\\t\\tbecame a corner-stone of sacred history."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "74",
    "NoteID": "1571",
    "Body": "Glad-tidings: not only that he was to have a son, but\\n\\t\\t\\t\\tthat he was to be a fountain-head of prophets. So he now\\n\\t\\t\\t\\tbegins to plead at once for the sinful people to whom Lot\\n\\t\\t\\t\\twas sent as a warner."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "75",
    "NoteID": "1572",
    "Body": "Like Al-Mustafa, Abraham had three qualities in a\\n\\t\\t\\t\\tpreeminent degree, which are here mentioned: (1) he was\\n\\t\\t\\t\\tlong-suffering with other people's faults: (2) his\\n\\t\\t\\t\\tsympathies and compassion were very wide: and (3) for\\n\\t\\t\\t\\tevery difficulty or trouble he turned to Allah and sought\\n\\t\\t\\t\\tHim in prayer."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "76",
    "NoteID": "1573",
    "Body": "This is a sort of prophetic apostrophe. 'O Abraham! All\\n\\t\\t\\t\\tyour warning. O Lut, will be unheeded! Alas! they are so\\n\\t\\t\\t\\tdeep in sin that nothing will reclaim them!' This is\\n\\t\\t\\t\\tillustrated in verse 79 below. And now we proceed to Lut\\n\\t\\t\\t\\tand how he was dealt with by the wicked."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "77",
    "NoteID": "1574",
    "Body": "The story of Lot, as referred to in vii. 80-84, laid\\n\\t\\t\\t\\temphasis on the rejection of Lot's mission by men who\\n\\t\\t\\t\\tpractised unnatural abominations. See n. 1049 to vii. 80.\\n\\t\\t\\t\\tHere the emphasis is laid on Allah's dealings with men-in\\n\\t\\t\\t\\tmercy for true spiritual service and in righteous wrath\\n\\t\\t\\t\\tand punishment for those who defy the laws of nature\\n\\t\\t\\t\\testablished by Him;-also on men's dealings with each\\n\\t\\t\\t\\tother and the contrast between the righteous and the\\n\\t\\t\\t\\twicked who respect no laws human or divine."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "78",
    "NoteID": "1575",
    "Body": "The Biblical narrative suggests that the daughters were\\n\\t\\t\\t\\tmarried and their husbands were close by (Gen. xix. 14)\\n\\t\\t\\t\\tand that these same daughters afterwards committed incest\\n\\t\\t\\t\\twith their father and had children by him (Gen. xix. 31).\\n\\t\\t\\t\\tThe holy Qur-an nowhere suggests such abominations. Some\\n\\t\\t\\t\\tCommentators suggest that \"my daughters\" in the mouth of\\n\\t\\t\\t\\ta venerable man like Lut, the father of his people, may\\n\\t\\t\\t\\tmean any young girls of those Towns. \"My son\" (waladi) is\\n\\t\\t\\t\\tstill a common mode of address in Arabic-speaking\\n\\t\\t\\t\\tcountries when an elderly man addresses a young man."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "80",
    "NoteID": "1576",
    "Body": "Lot seemed helpless in the situation in which he found\\n\\t\\t\\t\\thimself,-alone against a rabble of people inflamed with\\n\\t\\t\\t\\tevil passions. He wished he had had the strength to\\n\\t\\t\\t\\tsuppress them himself or had had some powerful support to\\n\\t\\t\\t\\tlean on! But the powerful support was there, though he\\n\\t\\t\\t\\thad not realised it till then. It was the support of\\n\\t\\t\\t\\tAllah. His guests were not ordinary men, but Angels who\\n\\t\\t\\t\\thad come to test the people before they inflicted the\\n\\t\\t\\t\\tpunishment. They now declared themselves, and gave him\\n\\t\\t\\t\\tdirections to get away before the morning, when the\\n\\t\\t\\t\\tpunishment would descend on the doomed Cities of the\\n\\t\\t\\t\\tPlain."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "81",
    "NoteID": "1577",
    "Body": "Even in Lot's household was one who detracted from the\\n\\t\\t\\t\\tharmony of the family. She was disobedient to her\\n\\t\\t\\t\\thusband, and he was here obeying Allah's Command. She\\n\\t\\t\\t\\tlooked back and shared the fate of the wicked inhabitants\\n\\t\\t\\t\\tof the Cities of the Plain: see also lxvi. 10. The\\n\\t\\t\\t\\tBiblical narrative suggests that she was turned into a\\n\\t\\t\\t\\tpillar of salt (Gen. xix. 26)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "82",
    "NoteID": "1578",
    "Body": "Cf. vii. 84 and n. 1052."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "82",
    "NoteID": "1579",
    "Body": "Sijjil, a Persian word Arabicised, from Sang-o-gil, or\\n\\t\\t\\t\\tSang-i-gil, stone and clay, or hard as baked clay,\\n\\t\\t\\t\\taccording to the Qamus. Sodom and Gomorrah were in a\\n\\t\\t\\t\\ttract of hard, caky, sulphurous soil, to which this\\n\\t\\t\\t\\tdescription well applies. Cf. Ii. 33, where the words are\\n\\t\\t\\t\\t\"stones of clay\" (hijarat min tin) in connection with the\\n\\t\\t\\t\\tsame incident. On the other hand, in cv. 4, the word\\n\\t\\t\\t\\tsijjil is used for pellets of hard-baked clay in\\n\\t\\t\\t\\tconnection with Abraha and the Companions of the\\n\\t\\t\\t\\tElephant."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "83",
    "NoteID": "1580",
    "Body": "If we take the words literally, they would mean that the\\n\\t\\t\\t\\tshowers of brimstones were marked with the destiny of the\\n\\t\\t\\t\\twicked as decreed by Allah."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "83",
    "NoteID": "1581",
    "Body": "They: Arabic, hiya: some Commentators take the pronoun to\\n\\t\\t\\t\\trefer to the wicked cities so destroyed: the meaning then\\n\\t\\t\\t\\twould be: those wicked cities were not so different from\\n\\t\\t\\t\\tother cities that do wrong, for they would all suffer\\n\\t\\t\\t\\tsimilar punishment! Perhaps it would be better to refer\\n\\t\\t\\t\\t\"they\" to the stones of punishment by a metonymy for\\n\\t\\t\\t\\t\"Punishment\": 'punishment would not be far from any\\n\\t\\t\\t\\tpeople that did wrong.'"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "84",
    "NoteID": "1582",
    "Body": "Cf. vii. 85-93. The location of Madyan is explained in n.\\n\\t\\t\\t\\t1053 to vii. 85 and the chronological place of Shu'aib in\\n\\t\\t\\t\\tn. 1064 to vii. 93. The point of the reference here is\\n\\t\\t\\t\\tdifferent from that in S. vii. Here the emphasis is on\\n\\t\\t\\t\\tAllah's dealings with men and men's crooked and obstinate\\n\\t\\t\\t\\tways: there the emphasis was rather on their treatment of\\n\\t\\t\\t\\ttheir Prophet, thus throwing light on some of the sins of\\n\\t\\t\\t\\tthe Makkans in later times."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "84",
    "NoteID": "1583",
    "Body": "The Midianites were a commercial people, and their\\n\\t\\t\\t\\tbesetting sin was commercial selfishness and fraudulent\\n\\t\\t\\t\\tdealings in weights and measures. Their Prophet tells\\n\\t\\t\\t\\tthem that that is the surest way to cut short their\\n\\t\\t\\t\\t\"prosperity\", both in the material and the spiritual\\n\\t\\t\\t\\tsense. When the Day of Judgment comes, it will search out\\n\\t\\t\\t\\ttheir dealings through and through: \"it will compass them\\n\\t\\t\\t\\tall round,\" and they will not be able to escape then,\\n\\t\\t\\t\\thowever much they may conceal their frauds in this world."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "85",
    "NoteID": "1584",
    "Body": "Both Plato and Aristotle define justice as the virtue\\n\\t\\t\\t\\twhich gives every one his due. From this point of view\\n\\t\\t\\t\\tJustice becomes the master virtue, and includes most\\n\\t\\t\\t\\tother virtues. It was the lack of this that ruined the\\n\\t\\t\\t\\tMidianites. Their selfishness was \"intent on mischief,\"\\n\\t\\t\\t\\ti.e., spoiling other people's business by not giving them\\n\\t\\t\\t\\ttheir just dues."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "86",
    "NoteID": "1585",
    "Body": "Allah's Law does not require that a man should deprive\\n\\t\\t\\t\\thimself of the things that are necessary for his own\\n\\t\\t\\t\\twell-being and development. If he follows Allah's Law,\\n\\t\\t\\t\\twhat is left him after he renders to others their just\\n\\t\\t\\t\\tdues will be not only enough, but will be the best\\n\\t\\t\\t\\tpossible provision for his own physical and spiritual\\n\\t\\t\\t\\tgrowth. Even the kindness and consideration which Allah's\\n\\t\\t\\t\\tLaw inculcates are in the best interests of the man's own\\n\\t\\t\\t\\tsoul. But of course the kindness and consideration must\\n\\t\\t\\t\\tbe spontaneous. It must flow from the man's own will, and\\n\\t\\t\\t\\tcannot be forced on him by the Prophet who come from\\n\\t\\t\\t\\tAllah to show him the way."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "87",
    "NoteID": "1586",
    "Body": "It is the way of selfish and material minded people (1)\\n\\t\\t\\t\\tto scoff at spiritual things like prayer and worship and\\n\\t\\t\\t\\t(2) to hug their own property rights as if there were not\\n\\t\\t\\t\\tother rights even greater than those of property!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "87",
    "NoteID": "1587",
    "Body": "They grow sarcastic against Shu'aib. In effect they say:\\n\\t\\t\\t\\t\"You are a fine man! You teach us that we must be kind\\n\\t\\t\\t\\tand forbearing with other people's faults, and now get at\\n\\t\\t\\t\\twhat you call our sins! You think you are the only right\\n\\t\\t\\t\\tminded man!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "88",
    "NoteID": "1588",
    "Body": "Shu'aib's answer is gentle and persuasive, First, he\\n\\t\\t\\t\\twould ask them not to fly into a passion but satisfy\\n\\t\\t\\t\\tthemselves that he had a mission from Allah, and was\\n\\t\\t\\t\\tworking in the discharge of his mission: he was not\\n\\t\\t\\t\\tmerely finding fault with them. Secondly, though he was a\\n\\t\\t\\t\\tpoor man, he asked them to note that he was happy and\\n\\t\\t\\t\\tcomfortable: Allah had given him good sustenance,\\n\\t\\t\\t\\tmaterial and spiritual, as from Himself, though he did\\n\\t\\t\\t\\tnot resort to the sort of tricks which they considered\\n\\t\\t\\t\\tnecessary for their prosperity. Thirdly, if he forbade\\n\\t\\t\\t\\tthem anything he wished to apply the same standards to\\n\\t\\t\\t\\thimself. Fourthly, all the advice which he is giving them\\n\\t\\t\\t\\tis for their own good, which he desires to advance to the\\n\\t\\t\\t\\tutmost of his powers. Fifthly, he is humble for himself;\\n\\t\\t\\t\\the would not set himself up to be their teacher or guide,\\n\\t\\t\\t\\tor expect to be obeyed; the success of any of his efforts\\n\\t\\t\\t\\ton their behalf must come from Allah's grace; will they\\n\\t\\t\\t\\tnot therefore turn to Allah, so that Allah's grace can\\n\\t\\t\\t\\theal them?"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "89",
    "NoteID": "1589",
    "Body": "Finally, Shu'aib appeals to them as man to man. \"Because\\n\\t\\t\\t\\tI differ from you, do not think I do not love you or feel\\n\\t\\t\\t\\tfor you. Let it not drive you into obstinacy and sin. I\\n\\t\\t\\t\\tsee things that you do not. My vision takes in the fate\\n\\t\\t\\t\\tof previous generations who sinned, and perished on\\n\\t\\t\\t\\taccount of their sins. Turn therefore to Allah in\\n\\t\\t\\t\\trepentance.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "89",
    "NoteID": "1590",
    "Body": "The generation of Lut was not far off from the generation\\n\\t\\t\\t\\tof Shu'aib chronologically if Shu'aib was only in the\\n\\t\\t\\t\\tfourth generation from Abraham (see n. 1064 to vii. 93).\\n\\t\\t\\t\\tNor was its habitat geographically far from that of\\n\\t\\t\\t\\tShu'aib, as the Midianites wandered about from Sinai\\n\\t\\t\\t\\tPeninsula to the Jordan valley (see n. 1053 to vii. 85)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "91",
    "NoteID": "1591",
    "Body": "Spiritual things are easy to understand if we bring the\\n\\t\\t\\t\\tright mind to them. But those who are contemptuous of\\n\\t\\t\\t\\tthem deliberately shut their eyes to Allah's Signs, and\\n\\t\\t\\t\\tthen pretend in their superior arrogance that they are\\n\\t\\t\\t\\t'quite beyond them'!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "91",
    "NoteID": "1592",
    "Body": "What they do understand is brute strength. They\\n\\t\\t\\t\\tpractically say: \"Don't you see that we have all the\\n\\t\\t\\t\\tpower and influence, and you, Shu'aib, are only a poor\\n\\t\\t\\t\\tTeacher? We could stone you or imprison you or do what we\\n\\t\\t\\t\\tlike with you! Thank us for our kindness that we spare\\n\\t\\t\\t\\tyou, for the sake of your family. It is more than you\\n\\t\\t\\t\\tyourself deserve!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "92",
    "NoteID": "1593",
    "Body": "Cf. viii. 47."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "93",
    "NoteID": "1594",
    "Body": "Cf. vi. 135 and n. 957."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "93",
    "NoteID": "1595",
    "Body": "If the wicked will continue to blaspheme and mock, what\\n\\t\\t\\t\\tcan the godly say but this? \"Watch and wait! Allah's Plan\\n\\t\\t\\t\\tworks without fail! I have faith, and I too will watch\\n\\t\\t\\t\\twith you for its fulfilment.\" Cf. x. 102, and n. 1484."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "94",
    "NoteID": "1596",
    "Body": "Cf. xi. 66 and xi. 58, n. 1554."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "95",
    "NoteID": "1597",
    "Body": "Cf. xi. 67-68. The blast was probably the tremendous\\n\\t\\t\\t\\tnoise which accompanies volcanic eruptions."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "96",
    "NoteID": "1598",
    "Body": "The story of Moses and Pharaoh is referred to in many\\n\\t\\t\\t\\tplaces in the Qur-an, each in connection with some\\n\\t\\t\\t\\tspecial point to be illustrated. Here the point is that\\n\\t\\t\\t\\tAllah's dealings with man are in all things and at all\\n\\t\\t\\t\\ttimes just. But man falls under false leadership by\\n\\t\\t\\t\\tdeliberate choice and perishes along with his false\\n\\t\\t\\t\\tleaders accordingly. In exercise of the intelligence and\\n\\t\\t\\t\\tchoice given him, man should be particularly careful to\\n\\t\\t\\t\\tunderstand his own responsibilities and to profit from\\n\\t\\t\\t\\tAllah's Signs, so as to attain to Allah's Mercy and\\n\\t\\t\\t\\tblessings."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "97",
    "NoteID": "1599",
    "Body": "Pharaoh is the type of the arrogant, selfish, and false\\n\\t\\t\\t\\tleader, who poses as a power in rivalry with that of\\n\\t\\t\\t\\tAllah. Such an attitude seems to attract unregenerate\\n\\t\\t\\t\\thumanity, which falls a willing victim, in spite of the\\n\\t\\t\\t\\tteaching and warning given by the men of Allah and the\\n\\t\\t\\t\\tmany moral and spiritual forces that beckon man towards\\n\\t\\t\\t\\tAllah's Grace."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "98",
    "NoteID": "1600",
    "Body": "Awrada = to lead, as cattle, down to their watering\\n\\t\\t\\t\\tplace. The metaphor is apt. The true herdsman is trusted\\n\\t\\t\\t\\tby his normal flock, and he leads them in the heat of the\\n\\t\\t\\t\\tday down to pleasant and cool watering places in order\\n\\t\\t\\t\\tthat they may slake their thirst and be happy. The false\\n\\t\\t\\t\\tleader does the opposite: he takes them down to the fire\\n\\t\\t\\t\\tof eternal misery! And yet men sin against their own\\n\\t\\t\\t\\tintelligence, and follow the false leader like cattle\\n\\t\\t\\t\\twithout intelligence!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "100",
    "NoteID": "1601",
    "Body": "Some are standing: like corn, which is ready to be\\n\\t\\t\\t\\treaped. Among the communities which remained was, and is,\\n\\t\\t\\t\\tEgypt, although the Pharaoh and his wicked people have\\n\\t\\t\\t\\tbeen swept away. The simile of standing corn also\\n\\t\\t\\t\\tsuggests that at no time can town or community expect\\n\\t\\t\\t\\tpermanency, except in the Law of the Lord."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "100",
    "NoteID": "1602",
    "Body": "Notions grow and ripen and are mown down. If they\\n\\t\\t\\t\\tdisobeyed Allah, their end is evil; if they were true and\\n\\t\\t\\t\\tgodly, their harvest was good."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "101",
    "NoteID": "1603",
    "Body": "All false and fleeting shadows must vanish before the\\n\\t\\t\\t\\treality and permanence of the decree of Allah. If we\\n\\t\\t\\t\\tworshipped the false, we carned nothing but perdition."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "103",
    "NoteID": "1604",
    "Body": "Yaumun mashhud: To suggest the comprehensive meaning of\\n\\t\\t\\t\\tthe Arabic I have translated, \"a Day of Testimony\". I\\n\\t\\t\\t\\tproceed to explain the various shades of meaning implied:\\n\\t\\t\\t\\t(1) a Day to which all testimony points from every\\n\\t\\t\\t\\tquarter; (2) a Day when testimony will be given before\\n\\t\\t\\t\\tAllah's Judgment-seat, by all who are relevant witnesses,\\n\\t\\t\\t\\te.g., the Prophets that preached, the men or women we\\n\\t\\t\\t\\tbenefited or injured, the angels who recorded our\\n\\t\\t\\t\\tthoughts and deeds, or our thoughts and deeds\\n\\t\\t\\t\\tpersonified; (3) a Day which will be witnessed, i.e.,\\n\\t\\t\\t\\tseen by all, no matter how or where they died."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "105",
    "NoteID": "1605",
    "Body": "Speak i.e., either in self-defence or in accusation of\\n\\t\\t\\t\\tothers or to intercede for others, or to enter into\\n\\t\\t\\t\\tconversation or ask questions, one with another. It will\\n\\t\\t\\t\\tbe a solemn Day, before the Great Judge of all, to whom\\n\\t\\t\\t\\teverything will be known and whose authority will be\\n\\t\\t\\t\\tunquestioned. There will be no room for quibbling or\\n\\t\\t\\t\\tequivocation or subterfuge of any kind, nor can any one\\n\\t\\t\\t\\tlay the blame on another or take the responsibility of\\n\\t\\t\\t\\tanother. Personal responsibility will be enforced\\n\\t\\t\\t\\tstrictly."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "105",
    "NoteID": "1606",
    "Body": "Shaqi (wretched) and Said (blessed) have become almost\\n\\t\\t\\t\\ttechnical theological terms. They are explained in the\\n\\t\\t\\t\\tfour following verses."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "106",
    "NoteID": "1607",
    "Body": "The first word, Zafir, translated \"sighs\", is applied to\\n\\t\\t\\t\\tone part in the process of the braying of an ass, when he\\n\\t\\t\\t\\temits a deep breath. The second, Shahiq, translated,\\n\\t\\t\\t\\t\"sobs\", is the other process in the braying of an ass,\\n\\t\\t\\t\\twhen he draws in a long breath. This suggestion of an\\n\\t\\t\\t\\tanimal proverbial for his folly implies that the wicked,\\n\\t\\t\\t\\tin spite of their arrogance and insolence in this world\\n\\t\\t\\t\\tbelow, will at last realise that they have been fools\\n\\t\\t\\t\\tafter all, throwing away their own chances whenever they\\n\\t\\t\\t\\tgot them. In lxvii. 7 the word Shahiq is applied to the\\n\\t\\t\\t\\ttremendous roaring in-take or devouring of Hell-fire."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "107",
    "NoteID": "1608",
    "Body": "Khalidin: This is the word which is usually translated\\n\\t\\t\\t\\t\"dwell for ever\" or \"dwell for aye\". Here it is\\n\\t\\t\\t\\tdefinitely connected with two conditions, viz: (1) as\\n\\t\\t\\t\\tlong as the heavens and the earth endure, and (2) except\\n\\t\\t\\t\\tas Allah wills. Some Muslim theologians deduce from this\\n\\t\\t\\t\\tthe conclusion that the penalties referred to are not\\n\\t\\t\\t\\teternal, because the heavens and the earth as we see them\\n\\t\\t\\t\\tare not eternal, and the punishments for the deeds of a\\n\\t\\t\\t\\tlife that will end should not be such as will never end.\\n\\t\\t\\t\\tThe majority of Muslim theologians reject this view. They\\n\\t\\t\\t\\thold that the heavens and the earth here referred to are\\n\\t\\t\\t\\tnot those we see now, but others that will be eternal.\\n\\t\\t\\t\\tThey agree that Allah's Will is unlimited in scope and\\n\\t\\t\\t\\tpower, but that It has willed that the rewards and\\n\\t\\t\\t\\tpunishments of the Day of Judgment will be eternal."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "108",
    "NoteID": "1609",
    "Body": "Exactly the same arguments apply as in the last note."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "108",
    "NoteID": "1610",
    "Body": "The felicity will be uninterrupted, unlike any joy or\\n\\t\\t\\t\\thappiness which we can imagine in this life and which is\\n\\t\\t\\t\\tsubject to chances and changes, as our daily experience\\n\\t\\t\\t\\tshows."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "109",
    "NoteID": "1611",
    "Body": "Their worship is not based on any spiritual attitude of\\n\\t\\t\\t\\tmind. They merely follow the ways of their fathers."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "109",
    "NoteID": "1612",
    "Body": "Allah will take fully into account all their motives in\\n\\t\\t\\t\\tsuch mummery as they call worship, and they will have\\n\\t\\t\\t\\ttheir full spiritual consequences in the future."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "110",
    "NoteID": "1613",
    "Body": "Cf. x. 19. Previous revelations are not to be denied or\\n\\t\\t\\t\\tdishonoured because those who nominally go by them have\\n\\t\\t\\t\\tcorrupted and deprived them of spiritual value by their\\n\\t\\t\\t\\tvain controversies and disputes. It was possible to\\n\\t\\t\\t\\tsettle such disputes under the flag, as it were, of the\\n\\t\\t\\t\\told Revelations, but Allah's Plan was to revive and\\n\\t\\t\\t\\trejuvenate His Message through Islam, amongst a newer and\\n\\t\\t\\t\\tyounger people, unhampered by the burden of age long\\n\\t\\t\\t\\tprejudices."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "110",
    "NoteID": "1614",
    "Body": "Cf. xi. 62. There is always in human affairs the conflict\\n\\t\\t\\t\\tbetween the old and the new,-the worn-out system of our\\n\\t\\t\\t\\tancestors, and the fresh living spring of Allah's\\n\\t\\t\\t\\tinspiration fitting in with new times and new\\n\\t\\t\\t\\tsurroundings. The advocates of the former look upon this\\n\\t\\t\\t\\tlatter not only with intellectual doubt but with moral\\n\\t\\t\\t\\tsuspicion, as did the People of the Book upon Islam, with\\n\\t\\t\\t\\tits fresh outlook and vigorous realistic way of looking\\n\\t\\t\\t\\tat things."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "111",
    "NoteID": "1615",
    "Body": "Cf. xi. 109 above, with which the argument is now\\n\\t\\t\\t\\tconnected up by recalling the characteristic word (\"pay\\n\\t\\t\\t\\tback\") and leading to the exhortation (in the verses\\n\\t\\t\\t\\tfollowing) to stand firm in the right path freshly\\n\\t\\t\\t\\trevealed."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "114",
    "NoteID": "1616",
    "Body": "The two ends of the day: Morning and afternoon. The\\n\\t\\t\\t\\tmorning prayer is the Fajr, after the light is up but\\n\\t\\t\\t\\tbefore sunrise: we thus get up betimes and begin the day\\n\\t\\t\\t\\twith the remembrance of Allah and of our duty to Him. The\\n\\t\\t\\t\\tearly afternoon prayer, Zuhr, is immediately after noon:\\n\\t\\t\\t\\twe are in the midst of our daily life, and again we\\n\\t\\t\\t\\tremember Allah. There is no disagreement among scholars\\n\\t\\t\\t\\tregarding which prayer is meant by one of these two ends\\n\\t\\t\\t\\tof the day. They agree that it is Fajr prayer which may\\n\\t\\t\\t\\tbe performed from dawn until a little before sunrise.\\n\\t\\t\\t\\tThere is disagreement, however, regarding the prayer\\n\\t\\t\\t\\twhich ought to be performed at the other end of the day.\\n\\t\\t\\t\\tIt is said variously that the reference is to Asr or\\n\\t\\t\\t\\tMaghrib prayer."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "114",
    "NoteID": "1617",
    "Body": "Approaches of the night: Zulafun, plural of Zulfatun, an\\n\\t\\t\\t\\tapproach, something near at hand. As Arabic has, like\\n\\t\\t\\t\\tGreek, a dual number distinct from the plural, and the\\n\\t\\t\\t\\tplural number is used here, and not the dual, it is\\n\\t\\t\\t\\treasonable to argue that at least three \"approaches of\\n\\t\\t\\t\\tthe night\" are meant. The late afternoon prayer, 'Asr,\\n\\t\\t\\t\\tcan be one of these three, and the evening prayer,\\n\\t\\t\\t\\tMagrib, just after sunset, can be the second. The early\\n\\t\\t\\t\\tnight prayer, 'Isha, at supper time-when the glow of\\n\\t\\t\\t\\tsunset is disappearing, would be the third of the\\n\\t\\t\\t\\t\"approaches of the night\", when we commit ourselves to\\n\\t\\t\\t\\tAllah before sleep. These are the five canonical prayers\\n\\t\\t\\t\\tof Islam."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "114",
    "NoteID": "1618",
    "Body": "\"Those things that are good\": in this context the words\\n\\t\\t\\t\\trefer primarily to prayers, but they include all good\\n\\t\\t\\t\\tthoughts, good words, and good deeds. It is by them that\\n\\t\\t\\t\\twe keep away everything that is evil, whether referring\\n\\t\\t\\t\\tto the past, the present, or the future."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "116",
    "NoteID": "1619",
    "Body": "Baqiyat: some virtue or faculty that stands assault and\\n\\t\\t\\t\\tis lasting; balanced good sense that stands firm to\\n\\t\\t\\t\\tvirtue and is not dazzled by the lusts and pleasures of\\n\\t\\t\\t\\tthis world, and is not deterred by fear from boldly\\n\\t\\t\\t\\tcondemning wrong if it was fashionable or customary. It\\n\\t\\t\\t\\tis leaders possessed of such character that can save a\\n\\t\\t\\t\\tnation from disaster or perdition. The scarcity of such\\n\\t\\t\\t\\tleaders-and the rejection of the few who stood out-\\n\\t\\t\\t\\tbrought ruin among the nations whose example has already\\n\\t\\t\\t\\tbeen set out to us as a warning. In xi. 86 the word has a\\n\\t\\t\\t\\tmore literal meaning."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "116",
    "NoteID": "1620",
    "Body": "The exceptional men of firm virtue would have been\\n\\t\\t\\t\\tdestroyed by the wicked to whom they were an offence, had\\n\\t\\t\\t\\tthey not been saved by the grace and mercy of Allah. Or\\n\\t\\t\\t\\tperhaps, but for such grace, they might themselves have\\n\\t\\t\\t\\tsuccumbed to the evil around them, or been overwhelmed in\\n\\t\\t\\t\\tthe general calamity."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "117",
    "NoteID": "1621",
    "Body": "There are different shades of interpretation for this\\n\\t\\t\\t\\tverse. According to Baidhawi, zulmin here means \"a single\\n\\t\\t\\t\\twrong\". He thinks that the wrong referred to is shirk."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "118",
    "NoteID": "1622",
    "Body": "Cf. x. 19. All mankind might have been one. But in\\n\\t\\t\\t\\tAllah's Plan man was to have a certain measure of\\n\\t\\t\\t\\tfree-will, and this made difference inevitable. This\\n\\t\\t\\t\\twould not have mattered if all had honestly sought Allah.\\n\\t\\t\\t\\tBut selfishness and moral wrong came in, and people's\\n\\t\\t\\t\\tdisputations became mixed up with hatred, jealousy, and\\n\\t\\t\\t\\tsin, except in the case of those who accepted Allah's\\n\\t\\t\\t\\tgrace, which saved them. The object of their creation was\\n\\t\\t\\t\\tto raise them up spiritually by Allah's grace. But if\\n\\t\\t\\t\\tthey will choose the path of evil and fall into sin,\\n\\t\\t\\t\\tAllah's decree must be fulfilled, and His justice will\\n\\t\\t\\t\\ttake its course. In the course of that justice Hell will\\n\\t\\t\\t\\tbe filled with men and jinns, such is the number of those\\n\\t\\t\\t\\twho go astray."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "119",
    "NoteID": "1623",
    "Body": "Cf. vii. 18 and vii. 179. If Satan and his evil soldiers\\n\\t\\t\\t\\ttempt men from the path of rectitude, the responsibility\\n\\t\\t\\t\\tof the tempted, who choose the path of evil, is no less\\n\\t\\t\\t\\tthan that of the tempters, and they will both be involved\\n\\t\\t\\t\\tin punishment together."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "120",
    "NoteID": "1624",
    "Body": "The stories of the Prophets in the Qur-an are not mere\\n\\t\\t\\t\\tnarratives or histories: they involve three things: (1)\\n\\t\\t\\t\\tthey teach the highest spiritual Truth; (2) they give\\n\\t\\t\\t\\tadvice, direction, and warning, as to how we should\\n\\t\\t\\t\\tgovern our lives, and (3) they awaken our conscience and\\n\\t\\t\\t\\trecall to us the working of Allah's Law in human affairs.\\n\\t\\t\\t\\tThe story of Joseph in the next Sura is an illustration\\n\\t\\t\\t\\tin point. A) Cf. xi. 93 and vi. 135, n. 957. The worst\\n\\t\\t\\t\\tthat ye can will not defeat Allah's Plan; and as for us\\n\\t\\t\\t\\twho believe, our obvious duty is to do our part as taught\\n\\t\\t\\t\\tto us by Allah's revelation."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "122",
    "NoteID": "1625",
    "Body": "Cf. xi. 93, n. 1595, and x. 102, n. 1484. If the wicked\\n\\t\\t\\t\\tonly wait, they will see how Allah's Plan unfolds itself.\\n\\t\\t\\t\\tAs for those who believe, they are glad to wait in\\n\\t\\t\\t\\tperfect confidence, because they know that Allah is good\\n\\t\\t\\t\\tand merciful, as well as just and true."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "123",
    "NoteID": "1626",
    "Body": "Cf. ii. 210. There is nothing, secret or open, in our\\n\\t\\t\\t\\tworld or in Creation, which does not depend ultimately on\\n\\t\\t\\t\\tAllah's Will and Plan. Every affair goes back to Him for\\n\\t\\t\\t\\tdecision. Therefore we must worship Him and trust Him.\\n\\t\\t\\t\\tWorship implies many things: e.g., (1) trying to\\n\\t\\t\\t\\tunderstand His nature and His Will: (2) realising His\\n\\t\\t\\t\\tgoodness and glory, and His working in us; as a means to\\n\\t\\t\\t\\tthis end, (3) keeping Him in constant remembrance and\\n\\t\\t\\t\\tcelebrating His praise, to whom all praise is due; and\\n\\t\\t\\t\\t(4) completely identifying our will with His, which means\\n\\t\\t\\t\\tobedience to His Law, and service, to Him and His\\n\\t\\t\\t\\tcreatures in all sincerity."
  }
]
