[
  {
    "SurahNumber": "15",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "Regarding this lengthy rendering of the participial\\n\\t\\t\\t\\tadjective mubin, see surah {12}, note [2]. In the above\\n\\t\\t\\t\\tcontext, the term qur'an (which, whenever it appears\\n\\t\\t\\t\\twithout the definite article al denotes a solemn\\n\\t\\t\\t\\t\"recital\" or \"discourse\") is preceded by the conjunction\\n\\t\\t\\t\\twa, which, in its simplest connotation, signifies \"and\";\\n\\t\\t\\t\\tbut since it is used here to stress the present,\\n\\t\\t\\t\\tparticular instance of the divine writ (al-kitab), it can\\n\\t\\t\\t\\tbe omitted in the translation without affecting the\\n\\t\\t\\t\\tmeaning of the sentence."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "Since this revelation - i.e., the Qur'an-is clear in\\n\\t\\t\\t\\titself and clearly shows the truth, those who\\n\\t\\t\\t\\tdeliberately reject it now will have no excuse on\\n\\t\\t\\t\\tResurrection Day. As so often in the Qur'an, the past\\n\\t\\t\\t\\ttense in the expression alladhina kafaru is indicative of\\n\\t\\t\\t\\tconscious intent (see surah {2} note [6])."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "Lit., \"unless it [the community] had a known divine writ\\n\\t\\t\\t\\t(kitab ma'lum)\" - i.e., unless the people in question had\\n\\t\\t\\t\\tbeen shown through a divine writ the meaning of right and\\n\\t\\t\\t\\twrong, and had deliberately rejected this divine\\n\\t\\t\\t\\tguidance: cf. the statement, in  26:208 , that \"never\\n\\t\\t\\t\\thave We destroyed any community unless it had had its\\n\\t\\t\\t\\twarners\", or in  6:131 , that God \"would never destroy a\\n\\t\\t\\t\\tcommunity for its wrongdoing so long as its people are\\n\\t\\t\\t\\tstill unaware [of the meaning of right and wrong]\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "I.e., every community - and, in the widest sense of this\\n\\t\\t\\t\\tterm, every civilization - has a God-willed, organic span\\n\\t\\t\\t\\tof life resembling in this respect all other living\\n\\t\\t\\t\\torganisms, destined to grow, to reach maturity and\\n\\t\\t\\t\\tultimately to decay. For the ethical implications of this\\n\\t\\t\\t\\tlaw of nature and its bearing on the passage that\\n\\t\\t\\t\\tfollows, see  7:34  and the corresponding note [25]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "7",
    "NoteID": "6",
    "Body": "Cf. {6:8-9}. The reference of the unbelievers to the\\n\\t\\t\\t\\tProphet's revelation is obviously sarcastic\\n\\t\\t\\t\\t(Zamakhshari); hence my interpolation of the word\\n\\t\\t\\t\\t\"allegedly\". Although these verses relate primarily to\\n\\t\\t\\t\\tthe pagan contemporaries of the Prophet, they broadly\\n\\t\\t\\t\\tdescribe the negative attitude of unbelievers of all\\n\\t\\t\\t\\ttimes."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "8",
    "NoteID": "7",
    "Body": "Sc., \"and not just to satisfy a frivolous demand of\\n\\t\\t\\t\\tpeople who refuse to consider a prophetic message on its\\n\\t\\t\\t\\tmerits\". Moreover - as is evident from the next clause -\\n\\t\\t\\t\\tan actual appearance of the angels to ordinary men would\\n\\t\\t\\t\\tbut presage the Day of Judgment (described in  78:39  as\\n\\t\\t\\t\\t\"the Day of Ultimate Truth\") and, thus, the doom of the\\n\\t\\t\\t\\tdeniers of the truth spoken of here."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "8",
    "NoteID": "8",
    "Body": "Cf.  6:8  - \"had We sent down an angel, all would indeed\\n\\t\\t\\t\\thave been decided\", i.e., the Day of Judgment would have\\n\\t\\t\\t\\tcome."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "9",
    "NoteID": "9",
    "Body": "I.e., the Qur'an. The grammatical form nazzalna implies a\\n\\t\\t\\t\\tgradual revelation (\"step by step\") over a period of\\n\\t\\t\\t\\ttime, as has been pointed out by Zamakhshari in his\\n\\t\\t\\t\\tcommentary on  2:23  (see the last sentence of my\\n\\t\\t\\t\\tcorresponding note [14])."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "9",
    "NoteID": "10",
    "Body": "This prophecy has been strikingly confirmed by the fact\\n\\t\\t\\t\\tthat the text of the Qur'an has remained free from all\\n\\t\\t\\t\\talterations, additions or deletions ever since it was\\n\\t\\t\\t\\tenunciated by the Prophet in the seventh century of the\\n\\t\\t\\t\\tChristian era; and there is no other instance of any\\n\\t\\t\\t\\tbook, of whatever description, which has been similarly\\n\\t\\t\\t\\tpreserved over such a length of time. The early-noted\\n\\t\\t\\t\\tvariants in the reading of certain words of the Qur'an,\\n\\t\\t\\t\\toccasionally referred to by the classical commentators,\\n\\t\\t\\t\\trepresent no more than differences in respect of\\n\\t\\t\\t\\tdiacritical marks or of vocalisation, and, as a rule, do\\n\\t\\t\\t\\tnot affect the meaning of the passage in question. (See\\n\\t\\t\\t\\talso note [11] on  85:22 , explaining the expression lawh\\n\\t\\t\\t\\tmahfuz.)"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "10",
    "NoteID": "11",
    "Body": "The term shi'ah denotes a distinct group of people having\\n\\t\\t\\t\\tin common the same persuasion or adhering to the same\\n\\t\\t\\t\\tprinciples of behaviour, and is sometimes (though not\\n\\t\\t\\t\\there) used in the sense of \"sect\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "13",
    "NoteID": "12",
    "Body": "Cf.  6:10  and the corresponding note [9]. My\\n\\t\\t\\t\\tinterpolation of the words \"derision of Our message\" is\\n\\t\\t\\t\\tbased on Tabari's and Zamakhshari's interpretations of\\n\\t\\t\\t\\tthe above passage. Regarding God's \"causing\" the deniers\\n\\t\\t\\t\\tof the truth to sin, see surah {2}, note [7], as well as\\n\\t\\t\\t\\tsurah {14}, note [4]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "13",
    "NoteID": "13",
    "Body": "Lit., \"although the way of life (sunnah) of those of\\n\\t\\t\\t\\tolden times has already passed\" - i.e., although the\\n\\t\\t\\t\\tmanner in which God has dealt with them has long since\\n\\t\\t\\t\\tbecome a matter of common knowledge (Ibn Kathir)."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "15",
    "NoteID": "14",
    "Body": "Lit., \"we are people bewitched\". Cf.  6:7 , as well as\\n\\t\\t\\t\\tthe last paragraph of  10:2  and the corresponding note\\n\\t\\t\\t\\t[5]. The confusing of revealed truths with illusory\\n\\t\\t\\t\\t\"enchantment\" or \"sorcery\" is often pointed out in the\\n\\t\\t\\t\\tQur'an as characteristic of the attitude of people who a\\n\\t\\t\\t\\tpriori refuse to accept the idea of revelation and, thus,\\n\\t\\t\\t\\tof prophethood. The above two verses, implying that not\\n\\t\\t\\t\\teven a direct insight into the wonders of heaven could\\n\\t\\t\\t\\tconvince \"those who are bent on denying the truth\", are a\\n\\t\\t\\t\\tprelude to the subsequent passage, which once again draws\\n\\t\\t\\t\\tour attention to the wonders of nature as an evidence of\\n\\t\\t\\t\\tGod's creative activity."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "16",
    "NoteID": "15",
    "Body": "My rendering of buruj as \"great constellations\" is based\\n\\t\\t\\t\\ton the Taj al-'Arus; among the classical commentators,\\n\\t\\t\\t\\tBaghawi, Baydawi and Ibn Kathir give the same\\n\\t\\t\\t\\tinterpretation, while Tabari (on the authority of Mujahid\\n\\t\\t\\t\\tand Qatadah) explains this term as signifying \"the stars\"\\n\\t\\t\\t\\tin general."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "17",
    "NoteID": "16",
    "Body": "The term shaytan (\"satan\") - derived from the verb\\n\\t\\t\\t\\tshatana (\"he was [or \"became\"] remote\") - often denotes\\n\\t\\t\\t\\tin the Qur'an a force or influence remote from, and\\n\\t\\t\\t\\topposed to, all that is true and good (Taj al-'Arus,\\n\\t\\t\\t\\tRaghib): thus, for instance, in  2:14  it is used to\\n\\t\\t\\t\\tdescribe the evil impulses (shayatin) within the hearts\\n\\t\\t\\t\\tof \"those who are bent on denying the truth\". In its\\n\\t\\t\\t\\twidest, abstract sense it denotes every \"satanic force\",\\n\\t\\t\\t\\ti.e., every impulsion directed towards ends which are\\n\\t\\t\\t\\tcontrary to valid ethical postulates. In the present\\n\\t\\t\\t\\tcontext, the phrase \"every satanic force accursed\\n\\t\\t\\t\\t(rajim)\" - like the phrase \"every rebellious (marid)\\n\\t\\t\\t\\tsatanic force\" in a similar context in  37:7  -\\n\\t\\t\\t\\tapparently refers to endeavours, strongly condemned in\\n\\t\\t\\t\\tIslam, to divine the future by means of astrological\\n\\t\\t\\t\\tspeculations: hence the preceding reference to the skies\\n\\t\\t\\t\\tand the stars. The statement that God has made the\\n\\t\\t\\t\\theavens \"secure\" against such satanic forces obviously\\n\\t\\t\\t\\timplies that He has made it impossible for the latter to\\n\\t\\t\\t\\tobtain, through astrology or what is popularly described\\n\\t\\t\\t\\tas \"occult sciences\", any real knowledge of \"that which\\n\\t\\t\\t\\tis beyond the reach of human perception\" (al-ghayb)."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "18",
    "NoteID": "17",
    "Body": "Lit., \"excepting [or \"except that\"] anyone who seeks to\\n\\t\\t\\t\\thear by stealth...\", etc. The implication seems to be\\n\\t\\t\\t\\tthat any attempt at fathoming the mysteries of the\\n\\t\\t\\t\\tunknowable by such illicit means (\"by stealth\") is\\n\\t\\t\\t\\tinevitably followed by \"a flame clear to see\", i.e., by\\n\\t\\t\\t\\tburning, self-evident frustration. (Cf. also  37:10 .)"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "20",
    "NoteID": "18",
    "Body": "Lit., \"whose providers you are not\"; i.e., all living\\n\\t\\t\\t\\torganisms - whether plants or animals - which are not\\n\\t\\t\\t\\ttended by man but are nevertheless provided for. In its\\n\\t\\t\\t\\twider sense, this phrase stresses the notion that all\\n\\t\\t\\t\\tliving beings - man included - are provided for by God,\\n\\t\\t\\t\\tand by Him alone (cf.  11:6 )."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "21",
    "NoteID": "19",
    "Body": "Lit., \"but with Us are its storehouses\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "21",
    "NoteID": "20",
    "Body": "Lit., \"and We do not send it down [i.e., \"create it\"]\\n\\t\\t\\t\\totherwise than according to a measure known [to Us]\":\\n\\t\\t\\t\\tthat is, in accordance with the exigencies of God's plan\\n\\t\\t\\t\\tas such and with the function which any particular thing\\n\\t\\t\\t\\tor phenomenon is to have within that plan."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "22",
    "NoteID": "21",
    "Body": "I.e., by pollination as well as by bringing rain-clouds."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "23",
    "NoteID": "22",
    "Body": "Lit., \"We are [or \"shall be\"] the inheritors\\n\\t\\t\\t\\t(al-warithun)\": an idiomatic metaphor based, according to\\n\\t\\t\\t\\tthe consensus of all classical commentators, on the use\\n\\t\\t\\t\\tof the term \"inheritor\" or \"heir\" in the sense of \"one\\n\\t\\t\\t\\twho remains after his predecessor has passed away\" - in\\n\\t\\t\\t\\tthis case, after all creation has perished. (Cf. the\\n\\t\\t\\t\\texpression \"the heritage of the heavens and of the earth\"\\n\\t\\t\\t\\tused, with reference to God, in  3:180  and  57:10 .)"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "24",
    "NoteID": "23",
    "Body": "Or: \"those of you who hasten forward [towards Us], and\\n\\t\\t\\t\\tthose who lag behind\". Both these interpretations are\\n\\t\\t\\t\\tconsidered equally legitimate by the early commentators."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "26",
    "NoteID": "24",
    "Body": "There are many references in the Qur'an to man's having\\n\\t\\t\\t\\tbeen \"created out of clay (tin)\" or \"out of dust\\n\\t\\t\\t\\t(turab)\", both these terms signifying man's lowly\\n\\t\\t\\t\\tbiological origins as well as the fact that his body is\\n\\t\\t\\t\\tcomposed of various organic and inorganic substances\\n\\t\\t\\t\\texisting - in other combinations or in their elementary\\n\\t\\t\\t\\tforms - on or in the earth. The term ,salsal, occurring\\n\\t\\t\\t\\tin three verses of this surah as well as in  55:14 , adds\\n\\t\\t\\t\\ta further dimension to this concept. According to most of\\n\\t\\t\\t\\tthe philological authorities, it denotes \"dried clay that\\n\\t\\t\\t\\temits a sound\" (i.e., when it is struck); and since it is\\n\\t\\t\\t\\tused in the Qur'an exclusively with reference to the\\n\\t\\t\\t\\tcreation of man, it seems to contain an allusion to the\\n\\t\\t\\t\\tpower of articulate speech which distinguishes man from\\n\\t\\t\\t\\tall other animal species, as well as to the brittleness\\n\\t\\t\\t\\tof his existence (cf. the expression \"like pottery\" in\\n\\t\\t\\t\\t 55:14 ). As the construction of the sentence shows, this\\n\\t\\t\\t\\tsalsal is stated to have evolved (Razi) out of hama' -\\n\\t\\t\\t\\twhich, according to some authorities, is the plural of\\n\\t\\t\\t\\tham'ah, signifying \"dark, fetid mud\" or \"dark slime\" -\\n\\t\\t\\t\\twhile the participial adjective masnun which qualifies\\n\\t\\t\\t\\tthis noun denotes, as Razi points out, both \"altered\"\\n\\t\\t\\t\\t(i.e., in its composition) and \"brought into shape\":\\n\\t\\t\\t\\thence my rendering of this expression as \"transmuted\",\\n\\t\\t\\t\\twhich to some extent combines both of the above meanings.\\n\\t\\t\\t\\tTo my mind, we have here a description of the primeval\\n\\t\\t\\t\\tbiological environment out of which the \"sounding clay\" -\\n\\t\\t\\t\\tthe matrix, as it were - of man's physical body has\\n\\t\\t\\t\\tevolved in accordance with God's plan of creation."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "27",
    "NoteID": "25",
    "Body": "Cf.  55:15  - \"out of the confusing flame of fire (marij\\n\\t\\t\\t\\tmin nar)\": i.e., of non-corporeal elements. The noun\\n\\t\\t\\t\\tal-jann, rendered by me as \"the invisible beings\", is in\\n\\t\\t\\t\\treality a singular, denoting here the kind of these\\n\\t\\t\\t\\tparticular beings or forces, similar to the use of the\\n\\t\\t\\t\\tsingular noun \"man\" (al-insan) which describes the\\n\\t\\t\\t\\tcollective entity \"mankind\". The etymology of the word\\n\\t\\t\\t\\tjann (the plural of which is jinn) has been briefly\\n\\t\\t\\t\\ttouched upon in note [86] on  6:100 ; a more detailed\\n\\t\\t\\t\\tdiscussion of its meaning is found in Appendix III."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "29",
    "NoteID": "26",
    "Body": "Cf. {2:30-34} and the corresponding notes, as well as\\n\\t\\t\\t\\t{7:11-18}. The allegorical character of all the passages\\n\\t\\t\\t\\tbearing on the creation of man and on God's command to\\n\\t\\t\\t\\tthe angels to prostrate themselves before him is brought\\n\\t\\t\\t\\tout clearly in God's saying, \"I am about to create mortal\\n\\t\\t\\t\\tman...; and when I have formed him fully...\", etc.: for\\n\\t\\t\\t\\tit is obvious that, in reality, no lapse of time is\\n\\t\\t\\t\\trequired for God's completing His creation - since, \"when\\n\\t\\t\\t\\tHe wills a thing to be, He but says unto it, 'Be'- and it\\n\\t\\t\\t\\tis\" (cf.  2:117 ,  3:47  and {59},  6:73 ,  16:40 ,\\n\\t\\t\\t\\t 19:35 ,  36:82  and  40:68 ). God's \"breathing of His\\n\\t\\t\\t\\tspirit\" into man is obviously a metaphor for His endowing\\n\\t\\t\\t\\thim with life and consciousness: that is, with a soul."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "31",
    "NoteID": "27",
    "Body": "See note [10] on  7:11 . For the deeper meaning of this\\n\\t\\t\\t\\t\"rebellion\", see note [31] below."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "35",
    "NoteID": "28",
    "Body": "Lit., \"is upon thee\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "39",
    "NoteID": "29",
    "Body": "See surah {7}, note [11]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "40",
    "NoteID": "30",
    "Body": "Lit., \"Thy sincere servants\": i.e., those who are so\\n\\t\\t\\t\\tdeeply conscious of God that no \"blandishment of Satan\"\\n\\t\\t\\t\\tcan lead them astray. (See also note [32] below.)"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "41",
    "NoteID": "31",
    "Body": "I.e., \"this is what I have willed\" - namely, that Iblis\\n\\t\\t\\t\\t(or Satan) should tempt man, but should have no power to\\n\\t\\t\\t\\tseduce those who are truly conscious of God. Thus, the\\n\\t\\t\\t\\tQur'an makes it clear that despite his ostensible\\n\\t\\t\\t\\t\"rebellion\" against his Creator, Satan fulfils a definite\\n\\t\\t\\t\\tfunction in God's plan: he is the eternal tempter who\\n\\t\\t\\t\\tenables man to exercise his God-given freedom of choice\\n\\t\\t\\t\\tbetween good and evil and, thus, to become a being\\n\\t\\t\\t\\tendowed with moral free will. (See in this connection\\n\\t\\t\\t\\t 19:83 , as well as note [26] on  2:34  and note [16] on\\n\\t\\t\\t\\t 7:24 .)"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "42",
    "NoteID": "32",
    "Body": "Lit., \"except him who shall follow thee from among those\\n\\t\\t\\t\\twho are lost in grievous error\". (Cf.  14:22 , according\\n\\t\\t\\t\\tto which Satan will thus address his erstwhile followers\\n\\t\\t\\t\\ton Judgment Day: \"I had no power at all over you: I but\\n\\t\\t\\t\\tcalled you - and you responded unto me.\") This phrase\\n\\t\\t\\t\\tconstitutes the essential difference between the above\\n\\t\\t\\t\\tpassage and the similar one in {7:11-18}."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "44",
    "NoteID": "33",
    "Body": "Lit., \"it has seven gates, [with] an allotted share of\\n\\t\\t\\t\\tthem for each gate\". This probably means \"seven degrees\"\\n\\t\\t\\t\\tof hell, i.e., of the suffering which, in the life to\\n\\t\\t\\t\\tcome, awaits the \"followers of Satan\" in accordance with\\n\\t\\t\\t\\tthe gravity of their sins (Razi; a similar explanation is\\n\\t\\t\\t\\tgiven by Qatadah, as quoted by Tabari,). It should also\\n\\t\\t\\t\\tbe remembered that the concept of \"hell\" as such is\\n\\t\\t\\t\\treferred to in the Qur'an under seven different names,\\n\\t\\t\\t\\tall of them metaphorical (necessarily so, because they\\n\\t\\t\\t\\trelate to what the Qur'an describes as al-ghayb,\\n\\t\\t\\t\\t\"something that is beyond the reach of human\\n\\t\\t\\t\\tperception\"): namely nar (\"fire, which is the general\\n\\t\\t\\t\\tterm), jahannam (\"hell\"), jahim (\"blazing fire\"), sa'ir\\n\\t\\t\\t\\t(\"blazing flame\"), saqar (\"hell-fire\"), laza (\"raging\\n\\t\\t\\t\\tflame\"), and hutamah (\"crushing torment\"). Since, as I\\n\\t\\t\\t\\thave mentioned, these designations of other-worldly\\n\\t\\t\\t\\tsuffering are obviously allegorical, we may also assume\\n\\t\\t\\t\\tthat the \"seven gates of hell\" have the same character,\\n\\t\\t\\t\\tand signify \"seven approaches [or \"ways\"] to hell\".\\n\\t\\t\\t\\tFurthermore, it is well known that in the Semitic\\n\\t\\t\\t\\tlanguages - and most particularly in classical Arabic -\\n\\t\\t\\t\\tthe number \"seven\" is often used in the sense of\\n\\t\\t\\t\\t\"several\" or \"various\" (cf. Lisan al-'Arab, Taj al -Arus,\\n\\t\\t\\t\\tetc.): and so the above Qur'anic phrase may well have the\\n\\t\\t\\t\\tmeaning of \"various ways leading to hell\" - in other\\n\\t\\t\\t\\twords, many ways of sinning."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "47",
    "NoteID": "34",
    "Body": "I.e., all being equal in dignity, and therefore free from\\n\\t\\t\\t\\tenvy. As Razi points out, the plural noun surur (sing.\\n\\t\\t\\t\\tsarir), which literally denotes \"couches\" or,\\n\\t\\t\\t\\toccasionally, \"thrones\", signifies also \"seats [or\\n\\t\\t\\t\\t\"thrones\"] of eminence\" or \"of happiness (surur)\", from\\n\\t\\t\\t\\twhich latter word the noun sarir and its plural surur may\\n\\t\\t\\t\\tbe derived. The sublime quality of these \"thrones of\\n\\t\\t\\t\\thappiness\" is in some instances further symbolized by\\n\\t\\t\\t\\texpressions like \"gold-encrusted\" ( 56:15 ) or \"raised\\n\\t\\t\\t\\thigh\" ( 88:13 )."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "48",
    "NoteID": "35",
    "Body": "Lit., \"never shall they be caused to depart from it\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "50",
    "NoteID": "36",
    "Body": "In his commentary on the above two verses, Razi notes\\n\\t\\t\\t\\tthat the statement relating to God's forgiveness and\\n\\t\\t\\t\\tgrace contains a threefold emphasis - expressed by the\\n\\t\\t\\t\\trepetition of the personal pronoun ana relating to God,\\n\\t\\t\\t\\tand the definite article al before each of the two\\n\\t\\t\\t\\tparticipial adjectives - whereas there is no such stress\\n\\t\\t\\t\\tin the mention of His chastisement of recalcitrant\\n\\t\\t\\t\\tsinners. (Cf.  6:12  - and the corresponding note [10] -\\n\\t\\t\\t\\tas well as  6:54 , both of which verses state that God\\n\\t\\t\\t\\t\"has willed upon Himself the law of grace and mercy\".)"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "51",
    "NoteID": "37",
    "Body": "For a more detailed story of Abraham and the heavenly\\n\\t\\t\\t\\tmessengers, see verses {69-76} of surah {11} (Hud), which\\n\\t\\t\\t\\twas revealed shortly before the present one. The\\n\\t\\t\\t\\tconnection between this story and the preceding stress on\\n\\t\\t\\t\\tGod's grace arises from Abraham's saying (in verse {56}),\\n\\t\\t\\t\\t\"And who - other than those who have utterly lost their\\n\\t\\t\\t\\tway - could ever lose the hope of his Sustainer's grace?\"\\n\\t\\t\\t\\tSimilarly, the subsequent references (in verses {58-84})\\n\\t\\t\\t\\tto the sinful communities that were destroyed because\\n\\t\\t\\t\\tthey refused to heed the warnings of their prophets are,\\n\\t\\t\\t\\tobviously, meant to illustrate the reverse of God's\\n\\t\\t\\t\\tgrace, namely, His inevitable chastisement of deliberate,\\n\\t\\t\\t\\tunrepented sinning (verse {50} above)."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "52",
    "NoteID": "38",
    "Body": "For the reason of Abraham's and Sarah's apprehension, see\\n\\t\\t\\t\\t 11:70 ."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "53",
    "NoteID": "39",
    "Body": "I.e., will be a prophet."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "55",
    "NoteID": "40",
    "Body": "Lit., \"We have given thee the glad tiding of the truth\" -\\n\\t\\t\\t\\ti.e., of the truth willed by God (Ibn 'Abbas, as quoted\\n\\t\\t\\t\\tby Razi)."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "58",
    "NoteID": "41",
    "Body": "I.e., to the people of Sodom (see also {7:80-84} and\\n\\t\\t\\t\\t{11:77-83})."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "60",
    "NoteID": "42",
    "Body": "See  7:83  and the corresponding note [66], as well as\\n\\t\\t\\t\\t 11:81  and  66:10 . My interpolation of the words \"of\\n\\t\\t\\t\\twhom God says\" is necessitated by the elliptic use of the\\n\\t\\t\\t\\tverb qaddarna - which, in the sense of \"We have ordained\"\\n\\t\\t\\t\\tor \"decreed\", is an act attributed in the Qur'an\\n\\t\\t\\t\\tinvariably, and exclusively, to God. As I have repeatedly\\n\\t\\t\\t\\tpointed out in my notes, God's \"ordaining\" a sinner to\\n\\t\\t\\t\\tcommit a sin or His \"decreeing\" that he should remain\\n\\t\\t\\t\\tdeaf to the voice of truth is a metonym for the natural\\n\\t\\t\\t\\tlaw instituted by Him, which has been explained in surah\\n\\t\\t\\t\\t{2}, note [7]; it refers also, generally speaking, to\\n\\t\\t\\t\\tGod's absolute fore-knowledge of how any of His creatures\\n\\t\\t\\t\\twill act in a given situation (Zamakhshari). See also\\n\\t\\t\\t\\tnote [56] on  11:34  and note [4] on  14:4 ."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "62",
    "NoteID": "43",
    "Body": "Implying that they might be assaulted by the sinful\\n\\t\\t\\t\\tpeople of his town: cf.  11:77  and the corresponding\\n\\t\\t\\t\\tnote [107]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "63",
    "NoteID": "44",
    "Body": "Lit., \"that about which they have persistently been\\n\\t\\t\\t\\t(kanu) in doubt\" - i.e., the doom which, in this world or\\n\\t\\t\\t\\tin the hereafter, is the inevitable consequence of\\n\\t\\t\\t\\tdeliberate sinning: a prediction which the sinners\\n\\t\\t\\t\\tthemselves so often deride (cf. {6:57-58},  8:32 ,\\n\\t\\t\\t\\t 11:8 , and the corresponding notes). To my mind, this\\n\\t\\t\\t\\tsentence constitutes the reason for the repetition, in\\n\\t\\t\\t\\tthis surah, of the stories of Lot's people and the other\\n\\t\\t\\t\\tsinful communities of old that were punished for their\\n\\t\\t\\t\\tpersistent transgressions against all moral laws."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "64",
    "NoteID": "45",
    "Body": "Lit., \"We have brought thee [or \"come to thee with\"] the\\n\\t\\t\\t\\ttruth\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "65",
    "NoteID": "46",
    "Body": "For an explanation of this metaphorical \"looking back\",\\n\\t\\t\\t\\tsee surah {11}, note [112]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "66",
    "NoteID": "47",
    "Body": "Lit., \"cut off\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "67",
    "NoteID": "48",
    "Body": "Sc., \"of the arrival of handsome strangers\". See also\\n\\t\\t\\t\\t{7:80-81} and {11:77-79}, as well as the relevant notes."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "70",
    "NoteID": "49",
    "Body": "Lit., \"all people\" (al-'alamin): obviously, because Lot\\n\\t\\t\\t\\twas a stranger in Sodom-having come there from\\n\\t\\t\\t\\tMesopotamia, his and Abraham's country of origin (see\\n\\t\\t\\t\\tsurah {11}, note [102]) - and had previously aroused the\\n\\t\\t\\t\\tire of the Sodomites by his moral reproaches (cf.\\n\\t\\t\\t\\t{7:80-82})."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "71",
    "NoteID": "50",
    "Body": "See surah {11}, note [109]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "72",
    "NoteID": "51",
    "Body": "The above two interpolations are based on Zamakhshari's\\n\\t\\t\\t\\tcommentary on this verse. The oath \"As thou livest\"\\n\\t\\t\\t\\treads, literally, \"By thy life\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "73",
    "NoteID": "52",
    "Body": "Regarding the meaning of the term Sayhah, rendered by me\\n\\t\\t\\t\\tas \"blast of [God's] punishment\", see surah {11}, note\\n\\t\\t\\t\\t[98]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "74",
    "NoteID": "53",
    "Body": "See surah {11}, note [114]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "75",
    "NoteID": "54",
    "Body": "In its full significance, the term mutawassim denotes\\n\\t\\t\\t\\t\"one who applies his mind to the study of the outward\\n\\t\\t\\t\\tappearance of a thing with a view to understanding its\\n\\t\\t\\t\\treal nature and its inner characteristics\" (Zamakhshari\\n\\t\\t\\t\\tand Razi)."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "76",
    "NoteID": "55",
    "Body": "The existence of that road, which led from northern Hijaz\\n\\t\\t\\t\\tto Syria, skirting the Dead Sea - to the north-east of\\n\\t\\t\\t\\twhich Sodom and Gomorrah were situated - has received\\n\\t\\t\\t\\tstartling confirmation through aerial photographs\\n\\t\\t\\t\\trecently published by the American School of Oriental\\n\\t\\t\\t\\tResearch (New Haven, Connecticut). These photographs\\n\\t\\t\\t\\tclearly show the ancient road as a dark streak winding\\n\\t\\t\\t\\tnorthwards, more or less parallel with the eastern shores\\n\\t\\t\\t\\tof the Dead Sea."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "78",
    "NoteID": "56",
    "Body": "As is evident from  26:176 ff., the \"dwellers of the\\n\\t\\t\\t\\twooded dales (al-aykah)\" were the people of Madyan, who\\n\\t\\t\\t\\trefused to pay heed to their prophet, Shu'ayb, and were\\n\\t\\t\\t\\tthereupon destroyed, apparently by an earthquake and/or a\\n\\t\\t\\t\\tvolcanic eruption (cf. {7:85-93} and {11:84-95})."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "79",
    "NoteID": "57",
    "Body": "I.e., the people of Lot and those of Shu'ayb, who\\n\\t\\t\\t\\tinhabited adjacent regions (see surah {7}, note [67]),\\n\\t\\t\\t\\tand whose fate should be an example as plain to see as\\n\\t\\t\\t\\tthe highway which passes through the regions once\\n\\t\\t\\t\\tinhabited by them."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "80",
    "NoteID": "58",
    "Body": "I.e., the tribe of Thamud (see surah {7}, note [56]), who\\n\\t\\t\\t\\tin pre-Islamic times inhabited the region of Al-Hijr in\\n\\t\\t\\t\\tnorthernmost Hijaz, south of the oasis of Taymah. The\\n\\t\\t\\t\\tstory of the Thamud is found in {7:73-79}."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "82",
    "NoteID": "59",
    "Body": "See  7:74  and the corresponding notes (particularly note\\n\\t\\t\\t\\t[59])."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "85",
    "NoteID": "60",
    "Body": "For an explanation of this rendering of illa bi'l-haqq\\n\\t\\t\\t\\t(lit., \"otherwise than with [or \"in\"] truth\"), see surah\\n\\t\\t\\t\\t{10}, note [11]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "86",
    "NoteID": "61",
    "Body": "I.e., \"He has created all human beings with full\\n\\t\\t\\t\\tknowledge of their natural differentiation and the\\n\\t\\t\\t\\tdisparity in their respective conditions\" (Razi) - and\\n\\t\\t\\t\\tthis, of course, includes their failings and errors. (Cf.\\n\\t\\t\\t\\t 7:199  - \"Make due allowance for man's nature\" - and the\\n\\t\\t\\t\\tcorresponding note [162].)"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "87",
    "NoteID": "62",
    "Body": "With these words, the discourse returns to the theme\\n\\t\\t\\t\\tenunciated at the beginning of this surah and indirectly\\n\\t\\t\\t\\talluded to in verse {85} as well: namely, the revelation\\n\\t\\t\\t\\tof the divine writ, destined to serve as a moral guidance\\n\\t\\t\\t\\tto man, who cannot, as yet, discern the meaning and\\n\\t\\t\\t\\tpurpose of God's creation. - According to most of the\\n\\t\\t\\t\\tauthorities, including some of the foremost Companions of\\n\\t\\t\\t\\tthe Prophet, \"The Seven Oft-Repeated [Verses]\" is a\\n\\t\\t\\t\\tdesignation given by Muhammad himself to the first surah\\n\\t\\t\\t\\tof the Qur'an, which has also been described by him as\\n\\t\\t\\t\\t\"The Essence of the Divine Writ\" (Umm al-Kitab) inasmuch\\n\\t\\t\\t\\tas it alludes to all the ethical and metaphysical\\n\\t\\t\\t\\tprinciples set forth in the Qur'an (Bukhari, Kitab\\n\\t\\t\\t\\tat-Tafsir). See also my introductory note to Al-Fatihah\\n\\t\\t\\t\\t(\"The Opening\")."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "88",
    "NoteID": "63",
    "Body": "The philological authorities are unanimous in that the\\n\\t\\t\\t\\tplural noun azwaj denotes here\"kinds\" of people, or\\n\\t\\t\\t\\t\"some\" of them, and not - as certain modern translators\\n\\t\\t\\t\\tof the Qur'an have assumed - \"pairs\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "88",
    "NoteID": "64",
    "Body": "Lit., \"lower thy wing for the believers\": an idiomatic\\n\\t\\t\\t\\tmetaphor for loving tenderness and humility (see  17:24 \\n\\t\\t\\t\\tand the corresponding note [28])."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "89",
    "NoteID": "65",
    "Body": "The above interpolated phrase offers, to my mind, the\\n\\t\\t\\t\\tonly satisfactory explanation of the definite articles\\n\\t\\t\\t\\tprefixed to the words an-nadhir al-mubin (\"the plain\\n\\t\\t\\t\\twarner\"). This construction possibly alludes to the\\n\\t\\t\\t\\tBiblical prediction of the advent of the Prophet Muhammad\\n\\t\\t\\t\\tappearing in Deuteronomy xviii, {15} and {18}, which has\\n\\t\\t\\t\\tbeen discussed by me in surah {2}, note [33]."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "90",
    "NoteID": "66",
    "Body": "Thus Zamakhshari, explaining the elliptic beginning of\\n\\t\\t\\t\\tthis sentence and its logical connection with the\\n\\t\\t\\t\\tpreceding verse as well as with verse {87}."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "90",
    "NoteID": "67",
    "Body": "This is apparently a reference to the followers of the\\n\\t\\t\\t\\tBible, who \"believe in some parts of the divine writ and\\n\\t\\t\\t\\tdeny the truth of other parts\" (cf.  2:85 ) - i.e., who\\n\\t\\t\\t\\tact in accordance with those principles of the Bible\\n\\t\\t\\t\\twhich suit their inclinations and the prevailing social\\n\\t\\t\\t\\ttrends, and disregard the others, thus denying, by\\n\\t\\t\\t\\timplication, their validity."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "91",
    "NoteID": "68",
    "Body": "This, according to the Taj al-'Arus (art. 'adiha and\\n\\t\\t\\t\\t'adawa) is the meaning of 'idin in the above context: an\\n\\t\\t\\t\\tinterpretation also advanced by Tabari and Razi (in the\\n\\t\\t\\t\\tlast paragraph of the latter's commentary on this verse).\\n\\t\\t\\t\\tAnother interpretation - equally acceptable from the\\n\\t\\t\\t\\tpurely linguistic point of view - is \"[those] who cut up\\n\\t\\t\\t\\tthe Qur'an into separate parts\": i.e., accept (on the\\n\\t\\t\\t\\tanalogy of the Jews and the Christians) some of it as\\n\\t\\t\\t\\ttrue and regard the rest as Muhammad's invention. But\\n\\t\\t\\t\\tsince - as Tabari points out - those who refuse to\\n\\t\\t\\t\\tbelieve in the divine origin of the Quran do not accept\\n\\t\\t\\t\\tany of it as true, the first interpretation is by far the\\n\\t\\t\\t\\tpreferable."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "96",
    "NoteID": "69",
    "Body": "Lit., \"who postulate (yaj'alun), side by side with God,\\n\\t\\t\\t\\tanother deity (ilah)\" - a term which is obviously used\\n\\t\\t\\t\\there in its generic sense, embracing anything that could\\n\\t\\t\\t\\tbe visualized as a \"divine power\": hence my use of the\\n\\t\\t\\t\\tplural."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "99",
    "NoteID": "70",
    "Body": "Lit., \"till there comes unto thee that which is certain\\n\\t\\t\\t\\t(al-yaqin)\" - a term which in the Qur'an is often used as\\n\\t\\t\\t\\ta metonym for \"death\" (Bukhari, Kitah-at-Tafsir).\\n\\t\\t\\t\\tHowever, see also the earliest occurrence of this term in\\n\\t\\t\\t\\t 74:47 ."
  }
]
