[
  {
    "SurahNumber": "30",
    "AyahNumber": "1",
    "NoteID": "3504",
    "Body": "See n. 25 to ii. 1 and Introduction to this Sura."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "2",
    "NoteID": "3505",
    "Body": "The remarkable defeats of the Roman Empire under\\n\\t\\t\\t\\tHeraclius and the straits to which it was reduced are\\n\\t\\t\\t\\treviewed in Appendix No. 6 (to follow this Sura). It was\\n\\t\\t\\t\\tnot merely isolated defeats; the Roman Empire lost most\\n\\t\\t\\t\\tof its Asiatic territory and was hemmed in on all sides\\n\\t\\t\\t\\tat its capital, Constantinople. The defeat, \"in a land\\n\\t\\t\\t\\tclose by\" must refer to Syria and Palestine, Jerusalem\\n\\t\\t\\t\\twas lost in 614-15 A.D., shortly before this Sura was\\n\\t\\t\\t\\trevealed."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "3",
    "NoteID": "3506",
    "Body": "The Pagan Quraish of Makkah rejoiced at the overthrow of\\n\\t\\t\\t\\tRome by Persia. They were pro-Persian, and in their heart\\n\\t\\t\\t\\tof hearts they hoped that the nascent movement of Islam,\\n\\t\\t\\t\\twhich at that time was, from a worldly point of view,\\n\\t\\t\\t\\tvery weak and helpless, would also collapse under their\\n\\t\\t\\t\\tpersecution. But they misread the true Signs of the\\n\\t\\t\\t\\ttimes. They are told here that they would soon be\\n\\t\\t\\t\\tdisillusioned in both their calculations, and it actually\\n\\t\\t\\t\\tso happened at the battle of Issus in 622 (the year of\\n\\t\\t\\t\\tHijrat) and in 624, when Heradius carried his campaign\\n\\t\\t\\t\\tinto the heart of Persia (see Appendix No: 6) and the\\n\\t\\t\\t\\tMakkan Quraish were beaten off at Badr."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "4",
    "NoteID": "3507",
    "Body": "Bidh'un in the text means a short period-a period of from\\n\\t\\t\\t\\tthree to nine years. The period between the loss of\\n\\t\\t\\t\\tJerusalem (614-15) by the Romans and their victory at\\n\\t\\t\\t\\tIssus (622) was seven years, and that to the penetration\\n\\t\\t\\t\\tof Persia by Heraclius was nine years. See last note."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "4",
    "NoteID": "3508",
    "Body": "See n. 3506 and Appendix No: 6. The battle of Badr (2\\n\\t\\t\\t\\tA.H. = 624 A.D.) was a real time of rejoicing for the\\n\\t\\t\\t\\tBelievers and a time of disillusionment for the arrogant\\n\\t\\t\\t\\tQuraish, who thought that they could crush the whole\\n\\t\\t\\t\\tmovement of Islam in Madinah as they had tried to do in\\n\\t\\t\\t\\tMakkah. but they were signally repulsed. See n. 352 to\\n\\t\\t\\t\\tiii. 13."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "5",
    "NoteID": "3509",
    "Body": "\"Whom He will.\"  As explained elsewhere, Allah's Will or\\n\\t\\t\\t\\tPlan is not arbitrary: it is full of the highest wisdom.\\n\\t\\t\\t\\tHis Plan is formed in mercy, so as to safeguard the\\n\\t\\t\\t\\tinterests of all his creatures, against the selfish\\n\\t\\t\\t\\taggrandizement of any section of them. And He is able to\\n\\t\\t\\t\\tcarry out His Plan in full, and there is no power that\\n\\t\\t\\t\\tcan stop or delay His Plan."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "6",
    "NoteID": "3510",
    "Body": "The promise refers to the Decision of all things by the\\n\\t\\t\\t\\tCommand of Allah, Who will remove all troubles and\\n\\t\\t\\t\\tdifficulties from the path of His righteous Believers,\\n\\t\\t\\t\\tand help them to rejoice over the success of their\\n\\t\\t\\t\\trighteous Cause. This refers to all times and all\\n\\t\\t\\t\\tsituations. The righteous should not despair in their\\n\\t\\t\\t\\tdarkest moments, for Allah's help will come. Ordinarily\\n\\t\\t\\t\\tmen are puffed up if they score a seeming temporary\\n\\t\\t\\t\\tsuccess against the righteous, and do not realize that\\n\\t\\t\\t\\tAllah's Will can never be thwarted."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "7",
    "NoteID": "3511",
    "Body": "Men are misled by the outward show of things, though the\\n\\t\\t\\t\\tinner reality may be quite different. Many seeming\\n\\t\\t\\t\\tdisasters are really godsends if we only understood."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "7",
    "NoteID": "3512",
    "Body": "AKhirat: may refer to the End of things or enterprises in\\n\\t\\t\\t\\thistory as well as the Hereafter in the technical\\n\\t\\t\\t\\ttheological sense."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "8",
    "NoteID": "3513",
    "Body": "f. xv. 85. Here the argument is about the ebb and flow of\\n\\t\\t\\t\\tworldly power, and the next clause is appropriately\\n\\t\\t\\t\\tadded, \"and for a term appointed\". Let not any one who is\\n\\t\\t\\t\\tgranted worldly power or advantage run away with the\\n\\t\\t\\t\\tnotion that it is permanent. It is definitely limited in\\n\\t\\t\\t\\tthe high Purpose of Allah, which is just and true. And an\\n\\t\\t\\t\\taccount will have to be given of it afterwards on basis\\n\\t\\t\\t\\tof strict personal responsibility."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "8",
    "NoteID": "3514",
    "Body": "It is therefore all the more strange that there should be\\n\\t\\t\\t\\tmen who not only forget themselves but even deny that\\n\\t\\t\\t\\tthere is a return to Allah or an End or Hereafter, when a\\n\\t\\t\\t\\tfull reckoning will be due for this period of probation.\\n\\t\\t\\t\\tThey are asked to study past history, as in the next\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "9",
    "NoteID": "3515",
    "Body": "Let not any generation think that it is superior to all\\n\\t\\t\\t\\tthat went before it. We may be \"heirs to all the ages, in\\n\\t\\t\\t\\tthe foremost files of times.\" That is no reason for\\n\\t\\t\\t\\tarrogance, but on the contrary adds to our\\n\\t\\t\\t\\tresponsibility. When we realize what flourishing cities\\n\\t\\t\\t\\tand kingdoms existed before, how they flourished in\\n\\t\\t\\t\\tnumbers and prosperity, what chances they were given, and\\n\\t\\t\\t\\thow they perished when they disobeyed the law of Allah,\\n\\t\\t\\t\\twe shall feel a sense of humility, and see that it was\\n\\t\\t\\t\\trebellion and self-will that brought them down. Allah was\\n\\t\\t\\t\\tmore than just. He was also merciful. But they brought\\n\\t\\t\\t\\tabout their own ruin."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "10",
    "NoteID": "3516",
    "Body": "The Arabic superlative feminine, referring to the\\n\\t\\t\\t\\tfeminine noun Aqibat, I have translated by \"Evil\". In\\n\\t\\t\\t\\tthis life good and evil may seem to be mixed up, and it\\n\\t\\t\\t\\tmay be that some things or persons that are evil get what\\n\\t\\t\\t\\tseem to be good rewards or blessings, while the opposite\\n\\t\\t\\t\\thappens to the good. But this is only a temporary\\n\\t\\t\\t\\tappearance. In the long run Evil will have its own evil\\n\\t\\t\\t\\tconsequences, multiplied cumulatively. And this, because\\n\\t\\t\\t\\tevil not only rejected Allah's Message of Good but\\n\\t\\t\\t\\tlaughed at Good and misled others."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "11",
    "NoteID": "3517",
    "Body": "Nothing exists of its own accord or fortuitously. It is\\n\\t\\t\\t\\tAllah Who originates all creation. What appears to be\\n\\t\\t\\t\\tdeath may be only transformation: for Allah can and does\\n\\t\\t\\t\\trecreate. And His creative activity is continuous. Our\\n\\t\\t\\t\\tdeath is but a phenomenal event. What we become after\\n\\t\\t\\t\\tdeath is the result of a process of recreation by Allah,\\n\\t\\t\\t\\tWho is both the source and the goal of all things. When\\n\\t\\t\\t\\twe are brought back to him, it will be as conscious and\\n\\t\\t\\t\\tresponsible beings, to receive the consequences of our\\n\\t\\t\\t\\tbrief life on this earth."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "12",
    "NoteID": "3518",
    "Body": "The Hour will be established: in due time the Hour will\\n\\t\\t\\t\\tcome when Judgment will be established, and the seeming\\n\\t\\t\\t\\tdisturbance of balance in this world will be redressed.\\n\\t\\t\\t\\tThen the Good will rejoice, and the Guilty, faced with\\n\\t\\t\\t\\tthe Realities, will lose all their illusions and be\\n\\t\\t\\t\\tstruck dumb with despair."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "13",
    "NoteID": "3519",
    "Body": "False worship will then appear in its true colors.\\n\\t\\t\\t\\tAnything to which we offered the worship due to Allah\\n\\t\\t\\t\\talone, will vanish instead of being of any help. Indeed\\n\\t\\t\\t\\tthe deluded false worshipers, whose eyes will now be\\n\\t\\t\\t\\topened, will themselves reject their falsehoods, as the\\n\\t\\t\\t\\tTruth will now shine with unquestioned splendor."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "14",
    "NoteID": "3520",
    "Body": "In the fullness of time good and evil will all be sorted\\n\\t\\t\\t\\tout and separated. The good will reach their destination\\n\\t\\t\\t\\tof felicity in rich and luscious, well-watered meadows,\\n\\t\\t\\t\\twhich stand as the type of all that is fair to see and\\n\\t\\t\\t\\tpleasant to feel. The evil will no longer imagine that\\n\\t\\t\\t\\tthey are enjoying good fortune, for the testing time will\\n\\t\\t\\t\\tbe over, and the grim reality will stare them in the\\n\\t\\t\\t\\tface. They will receive their just Punishment."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "17",
    "NoteID": "3521",
    "Body": "The special times for Allah's remembrance are so\\n\\t\\t\\t\\tdescribed as to include all our activities in life,-when\\n\\t\\t\\t\\twe rise early in the morning, and when we go to rest in\\n\\t\\t\\t\\tthe evening; when we are in the midst of our work, at the\\n\\t\\t\\t\\tdecline of the sun, and in the late afternoon. It may be\\n\\t\\t\\t\\tnoted that these are all striking stages in the passage\\n\\t\\t\\t\\tof the sun through our terrestrial day, as well as stages\\n\\t\\t\\t\\tin our daily working lives. On this are based the hours\\n\\t\\t\\t\\tof the five canonical prayers afterwards prescribed in\\n\\t\\t\\t\\tMadinah; viz. (1) early morning before sunrise (Fajr);\\n\\t\\t\\t\\t(2) when the day begins to decline, just after noon\\n\\t\\t\\t\\t(Zuhr); (3) in the late afternoon, say midway between\\n\\t\\t\\t\\tnoon and sunset ('Asr); and (4) and (5) the two evening\\n\\t\\t\\t\\tprayers, one just after sunset (Maghrib); and the other\\n\\t\\t\\t\\tafter the evening twilight has all faded from the\\n\\t\\t\\t\\thorizon, the hour indicated for rest and sleep ('Isha).\\n\\t\\t\\t\\tCf. xi. 114 nn. 1616-17; xvii. 78-79, n. 2275; xx. 130.\\n\\t\\t\\t\\tn. 2655."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "19",
    "NoteID": "3522",
    "Body": "Cf. x. 31. From dead matter Allah's creative act produces\\n\\t\\t\\t\\tlife and living matter, and even science has not yet been\\n\\t\\t\\t\\table to explain the mystery of life. Life and living\\n\\t\\t\\t\\tmatter again seem to reach maturity and again die, as we\\n\\t\\t\\t\\tsee every day. No material thing seems to have perpetual\\n\\t\\t\\t\\tlife. But again we see the creative process of Allah\\n\\t\\t\\t\\tconstantly at work, and the cycle of life and death seems\\n\\t\\t\\t\\tto go on."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "19",
    "NoteID": "3523",
    "Body": "Cf. ii. 164. The earth itself, seemingly so inert,\\n\\t\\t\\t\\tproduces vegetable life at once from a single shower of\\n\\t\\t\\t\\train, and in various ways sustains animal life. Normally\\n\\t\\t\\t\\tit seems to die in the winter in northern climates, and\\n\\t\\t\\t\\tin a drought everywhere, and the spring revives it in all\\n\\t\\t\\t\\tits glory. Metaphorically many movements, institutions,\\n\\t\\t\\t\\torganizations, seem to die and then to live again, all\\n\\t\\t\\t\\tunder the wonderful dispensation of Allah. So will our\\n\\t\\t\\t\\tpersonality be revived when we die on this earth, in\\n\\t\\t\\t\\torder to reap the fruit of this our probationary life."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "20",
    "NoteID": "3524",
    "Body": "Cf. xviii. 37 and n. 2379. In spite of the lowly origin\\n\\t\\t\\t\\tof man's body, Allah has given him a mind and soul by\\n\\t\\t\\t\\twhich he can almost compass the farthest reaches of Time\\n\\t\\t\\t\\tand Space. Is this not enough for a miracle or Sign? From\\n\\t\\t\\t\\ta physical point of view, see how man, a creature of\\n\\t\\t\\t\\tdust, scatters himself over the farthest corners of the\\n\\t\\t\\t\\tearth!"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "21",
    "NoteID": "3525",
    "Body": "This refers to the wonderful mystery of sex. Children\\n\\t\\t\\t\\tarise out of the union of the sexes. And it is always the\\n\\t\\t\\t\\tfemale sex that bring forth the offspring, whether female\\n\\t\\t\\t\\tor male. And the father is as necessary as the mother for\\n\\t\\t\\t\\tbringing forth daughters."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "21",
    "NoteID": "3526",
    "Body": "Cf. vii. 189. Unregenerate man is pugnacious in the male\\n\\t\\t\\t\\tsex, but rest and tranquility are found in the normal\\n\\t\\t\\t\\trelations of a father and mother dwelling together and\\n\\t\\t\\t\\tbringing up a family. A man's chivalry to the opposite\\n\\t\\t\\t\\tsex is natural and Allah-given. The friendship of two men\\n\\t\\t\\t\\tbetween each other is quite different in quality and\\n\\t\\t\\t\\ttemper from the feeling which unspoilt nature expects as\\n\\t\\t\\t\\tbetween men and women. There is a special kind of love\\n\\t\\t\\t\\tand tenderness between them. And as woman is the weaker\\n\\t\\t\\t\\tvessel, that tenderness may from a certain aspect be\\n\\t\\t\\t\\tlikened to mercy, the protecting kindness which the\\n\\t\\t\\t\\tstrong should give to the weak."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "22",
    "NoteID": "3527",
    "Body": "The variations in languages and colors may be viewed from\\n\\t\\t\\t\\tthe geographical aspect or from the aspect of periods of\\n\\t\\t\\t\\ttime. All mankind were created of a single pair of\\n\\t\\t\\t\\tparents; yet they have spread to different countries and\\n\\t\\t\\t\\tclimates and developed different languages and different\\n\\t\\t\\t\\tshades of complexions. And yet their basic unity remains\\n\\t\\t\\t\\tunaltered. They feel in the same way, and are all equally\\n\\t\\t\\t\\tunder Allah's care. Then there are the variations in\\n\\t\\t\\t\\ttime. Old languages die out and new ones are evolved. New\\n\\t\\t\\t\\tconditions of life and thought are constantly evolving\\n\\t\\t\\t\\tnew words and expressions, new syntactical structures,\\n\\t\\t\\t\\tand new modes of pronunciation. Even old races die, and\\n\\t\\t\\t\\tnew races are born."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "23",
    "NoteID": "3528",
    "Body": "If we consider deeply, sleep and dreams, the refreshment\\n\\t\\t\\t\\twe get from sleep to wakefulness as well as from\\n\\t\\t\\t\\twakefulness to sleep, as also the state of our thoughts\\n\\t\\t\\t\\tand feelings and sub-conscious self in these conditions,\\n\\t\\t\\t\\tare both wonderful and mysterious. Normally we sleep by\\n\\t\\t\\t\\tnight and do our ordinary work \"in quest of the Bounty of\\n\\t\\t\\t\\tAllah\" by day. But sleep and rest may come and be\\n\\t\\t\\t\\tnecessary by day, and we may have to work by night. And\\n\\t\\t\\t\\tour work for our livelihood may pass by insensible\\n\\t\\t\\t\\ttransitions to our work or thought or service of a higher\\n\\t\\t\\t\\tand spiritual kind. These processes suggest a background\\n\\t\\t\\t\\tof things which we know but vaguely, but which are as\\n\\t\\t\\t\\tmuch miracles as other Signs of Allah."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "23",
    "NoteID": "3529",
    "Body": "From verse 20 to verse 25 are mentioned a series of Signs\\n\\t\\t\\t\\tor Miracles, which should awaken our souls and lead us to\\n\\t\\t\\t\\ttrue Reality if we try to understand Allah. (1) There is\\n\\t\\t\\t\\tour own origin and destiny, which must necessarily be our\\n\\t\\t\\t\\tsubjective startingpoint: \"I think; therefore I am\": no\\n\\t\\t\\t\\tparticular exertion of our being is here necessary (xxx.\\n\\t\\t\\t\\t20). (2) The first beginnings of social life arise\\n\\t\\t\\t\\tthrough sex and love: see iv. 1, and n. 506; to\\n\\t\\t\\t\\tunderstand this in all its bearing, we must \"reflect\"\\n\\t\\t\\t\\t(xxx. 21). (3) The next point is to understand our\\n\\t\\t\\t\\tdiversities in speech, color, etc., arising from\\n\\t\\t\\t\\tdifferences of climate and external conditions; yet there\\n\\t\\t\\t\\tis unity beneath that diversity, which we shall realize\\n\\t\\t\\t\\tby extended knowledge (xxx. 22). (4) Next we turn to our\\n\\t\\t\\t\\tpsychological conditions, sleep, rest, visions, insight,\\n\\t\\t\\t\\tetc.; here we want teaching and guidance, to which we\\n\\t\\t\\t\\tmust hearken (xxx. 23). (5) Next, we must approach the\\n\\t\\t\\t\\thigher reaches of spiritual hopes and fears, as\\n\\t\\t\\t\\tsymbolized by such subtle forces of nature as lightning\\n\\t\\t\\t\\tand electricity, which may kill the foolish or bring\\n\\t\\t\\t\\tprosperity in its train by rain and abundant harvest; to\\n\\t\\t\\t\\tunderstand the highest spiritual hopes and fears so\\n\\t\\t\\t\\tsymbolized, we want the highest wisdom (xxx. 24). (6) And\\n\\t\\t\\t\\tlastly, we may become so transformed that we rise above\\n\\t\\t\\t\\tall petty, worldly, ephemeral things: Allah calls to us\\n\\t\\t\\t\\tand we rise, as from our dead selves to a Height which we\\n\\t\\t\\t\\tcan only describe as the Heaven of stability: here no\\n\\t\\t\\t\\thuman processes serve, for the Call of Allah Himself has\\n\\t\\t\\t\\tcome (xxx. 25-27)."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "24",
    "NoteID": "3530",
    "Body": "See last note, item (5). Cf. xiii. 12. To cowards\\n\\t\\t\\t\\tlightning and thunder appear as terrible forces of\\n\\t\\t\\t\\tnature: lightning seems to kill and destroy where its\\n\\t\\t\\t\\tirresistible progress is not assisted by proper\\n\\t\\t\\t\\tlightning-conductors. But lightning is also a herald of\\n\\t\\t\\t\\train-bearing clouds and showers that bring fertility and\\n\\t\\t\\t\\tprosperity in their train. This double aspect is also\\n\\t\\t\\t\\tsymbolical of spiritual fears and hopes, fears lest we\\n\\t\\t\\t\\tmay not be found receptive or worthy of the irresistible\\n\\t\\t\\t\\tperspicuous Message of Allah, and hopes that we may\\n\\t\\t\\t\\treceive it in the right spirit and be blessed by its\\n\\t\\t\\t\\tmighty power of transformation to achieve spiritual\\n\\t\\t\\t\\twell-being. Note that the repetition of the phrase \"gives\\n\\t\\t\\t\\tlife to the earth after it is dead\" connects this verse,\\n\\t\\t\\t\\twith verse 19 above; in other words, the Revelation,\\n\\t\\t\\t\\twhich we must receive with wisdom and understanding, is a\\n\\t\\t\\t\\tSign of Allah's own power and mercy, and is vouchsafed in\\n\\t\\t\\t\\torder to safeguard our own final Future."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "25",
    "NoteID": "3531",
    "Body": "In the physical world, the sky and the earth, as we see\\n\\t\\t\\t\\tthem, stand unsupported, by the artistry of Allah. They\\n\\t\\t\\t\\tbear witness to Allah, and in that our physical life\\n\\t\\t\\t\\tdepends on them-the earth for its produce and the sky for\\n\\t\\t\\t\\train, the heat of the sun, and other phenomena of\\n\\t\\t\\t\\tnature-they call to our mind our relation to Allah Who\\n\\t\\t\\t\\tmade them and us. How can we then be so dense as not to\\n\\t\\t\\t\\trealize that our higher Future, our Ma'ad, is bound up\\n\\t\\t\\t\\twith the call and the mercy of Allah?"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "26",
    "NoteID": "3532",
    "Body": "All nature in Creation not only obeys Allah, but devoutly\\n\\t\\t\\t\\tobeys Him, i.e., glories in its privilege of service and\\n\\t\\t\\t\\tobedience. Why should we not do likewise? It is part of\\n\\t\\t\\t\\tour original unspoilt nature, and we must respond to it,\\n\\t\\t\\t\\tas all beings do, by their very nature."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "27",
    "NoteID": "3533",
    "Body": "Cf. xxx. 11 above, where the same phrase began the\\n\\t\\t\\t\\targument about the beginning and end of all things being\\n\\t\\t\\t\\twith Allah. This has been illustrated by reference to\\n\\t\\t\\t\\tvarious Signs in Creation, and now the argument is\\n\\t\\t\\t\\trounded off with the same phrase."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "27",
    "NoteID": "3534",
    "Body": "Allah's glory and Allah's attributes are above any names\\n\\t\\t\\t\\twe can give to them. Human language is not adequate to\\n\\t\\t\\t\\texpress them. We can only form some idea of them at our\\n\\t\\t\\t\\tpresent stage by means of Similitudes and Parables. But\\n\\t\\t\\t\\teven so, the highest we can think of falls short of the\\n\\t\\t\\t\\ttrue Reality. For Allah is higher and wiser than the\\n\\t\\t\\t\\thighest and wisest we can think of."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "28",
    "NoteID": "3535",
    "Body": "One way in which we can get some idea of the things\\n\\t\\t\\t\\thigher than our own plane is to think of Parables and\\n\\t\\t\\t\\tSimilitudes. But even so, the highest we can think of\\n\\t\\t\\t\\tfalls short of the true Reality. For Allah is higher and\\n\\t\\t\\t\\twiser than the highest and wisest we can think of."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "28",
    "NoteID": "3536",
    "Body": "Allah is far higher above His Creation than any, the\\n\\t\\t\\t\\thighest, of His creatures can be above any, the lowest,\\n\\t\\t\\t\\tof His creatures. And yet would a man share his wealth on\\n\\t\\t\\t\\tequal terms with his dependants? Even what he calls his\\n\\t\\t\\t\\twealth is not really his own, but given by Allah. It is\\n\\t\\t\\t\\t\"his\" in common speech by reason merely of certain\\n\\t\\t\\t\\taccidental circumstances. How then can men raise Allah's\\n\\t\\t\\t\\tcreatures to equality with Allah in worship?"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "28",
    "NoteID": "3537",
    "Body": "Men fear each other as equals in a state of society at\\n\\t\\t\\t\\tperpetual warfare. To remove this fear they appoint an\\n\\t\\t\\t\\tauthority among themselves-a King or sovereign authority\\n\\t\\t\\t\\twhom they consider just-to preserve them from this fear\\n\\t\\t\\t\\tand give them an established order. But they must obey\\n\\t\\t\\t\\tand revere this authority and depend upon this authority\\n\\t\\t\\t\\tfor their own tranquility and security. Even with their\\n\\t\\t\\t\\tequals there is always the fear of public opinion. But\\n\\t\\t\\t\\tmen do not fear, or obey, or revere those who are their\\n\\t\\t\\t\\tslaves or dependents. Man is dependent on Allah. And\\n\\t\\t\\t\\tAllah is the Sovereign authority in an infinitely higher\\n\\t\\t\\t\\tsense. He is in no sense dependent on us, but we must\\n\\t\\t\\t\\thonor and revere Him and fear to disobey His Will or His\\n\\t\\t\\t\\tLaw. \"The fear of Allah is the beginning of wisdom.\""
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "28",
    "NoteID": "3538",
    "Body": "Cf vi. 55, and vii. 32, 174. etc."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "29",
    "NoteID": "3539",
    "Body": "The wrong-doers-those who deliberately reject Allah's\\n\\t\\t\\t\\tguidance and break Allah's Law-have put themselves out of\\n\\t\\t\\t\\tthe region of Allah's mercy. In this they have put\\n\\t\\t\\t\\tthemselves outside the pale of the knowledge of what is\\n\\t\\t\\t\\tfor their own good. In such a case they must suffer the\\n\\t\\t\\t\\tconsequences of the personal responsibility which flows\\n\\t\\t\\t\\tfrom the grant of a limited free-will. Who can then guide\\n\\t\\t\\t\\tthem or help them?"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "30",
    "NoteID": "3540",
    "Body": "For Hanif see n. 134 to ii. 135. Here \"true\" is used in\\n\\t\\t\\t\\tthe sense in which we say, \"the magnetic needle is true\\n\\t\\t\\t\\tto the north.\" Those who have been privileged to receive\\n\\t\\t\\t\\tthe Truth should never hesitate or swerve but remain\\n\\t\\t\\t\\tconstant, as men who know."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "30",
    "NoteID": "3541",
    "Body": "As turned out from the creative hand of Allah, man is\\n\\t\\t\\t\\tinnocent, pure, true, free, inclined to right and virtue,\\n\\t\\t\\t\\tand endued with true understanding about his own position\\n\\t\\t\\t\\tin the Universe and about Allah's goodness, wisdom, and\\n\\t\\t\\t\\tpower. That is his true nature, just as the nature of a\\n\\t\\t\\t\\tlamb is to be gentle and of a horse is to be swift. But\\n\\t\\t\\t\\tman is caught in the meshes of customs, superstitions,\\n\\t\\t\\t\\tselfish desires, and false teaching. This may make him\\n\\t\\t\\t\\tpugnacious, unclean, false, slavish, hankering after what\\n\\t\\t\\t\\tis wrong or forbidden, and deflected from the love of his\\n\\t\\t\\t\\tfellow-men and the pure worship of the One True God. The\\n\\t\\t\\t\\tproblem before the Prophets is to cure this crookedness,\\n\\t\\t\\t\\tand to restore human nature to what it should be under\\n\\t\\t\\t\\tthe Will of Allah."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "30",
    "NoteID": "3542",
    "Body": "Din Qaiyim here includes the whole life, thoughts and\\n\\t\\t\\t\\tdesires of man. The \"standard Religion,\" or the Straight\\n\\t\\t\\t\\tWay is thus contrasted with the various human systems\\n\\t\\t\\t\\tthat conflict with each other and call themselves\\n\\t\\t\\t\\tseparate \"religions\" or \"sects\" (see verse 32 below).\\n\\t\\t\\t\\tAllah's standard Religion is one, as Allah is One."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "31",
    "NoteID": "3543",
    "Body": "\"Repentance\" does not mean sackcloth and ashes, or\\n\\t\\t\\t\\tputting on a gloom pessimism. It means giving up disease\\n\\t\\t\\t\\tfor health, crookedness (which is abnormal) for the\\n\\t\\t\\t\\tStraight Way, the restoration of our nature as Allah\\n\\t\\t\\t\\tcreated it from the falsity introduced by the enticements\\n\\t\\t\\t\\tof Evil. To revert to the simile of the magnetic needle\\n\\t\\t\\t\\t(n. 3540 above), if the needle is held back by\\n\\t\\t\\t\\tobstructions, we must restore its freedom, so that it\\n\\t\\t\\t\\tpoints true again to the magnetic pole."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "32",
    "NoteID": "3544",
    "Body": "A good description of self-satisfied sectarianism as\\n\\t\\t\\t\\tagainst real Religion. See n. 3542 above."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "33",
    "NoteID": "3545",
    "Body": "Cf. x. 12. It is trouble, distress, or adversity that\\n\\t\\t\\t\\tmakes men realize their helplessness and turns their\\n\\t\\t\\t\\tattention back to the true Source of all goodness and\\n\\t\\t\\t\\thappiness. But when they are shown special Mercy-often\\n\\t\\t\\t\\tmore than they deserve-they forget themselves and\\n\\t\\t\\t\\tattribute it to their own cleverness, or to the stars, or\\n\\t\\t\\t\\tto some false ideas to which they pay court and worship,\\n\\t\\t\\t\\teither to the exdusion of Allah or in addition to the\\n\\t\\t\\t\\tlip-worship which they pay to Allah. Their action in any\\n\\t\\t\\t\\tcase amounts to gross ingratitude; but in the\\n\\t\\t\\t\\tcircumstances it looks as if they had gone out of their\\n\\t\\t\\t\\tway to show ingratitude."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "34",
    "NoteID": "3546",
    "Body": "CJ. xvi. 54. They are welcome to their fancies and false\\n\\t\\t\\t\\tworship, and to the enjoyment of the pleasures of this\\n\\t\\t\\t\\tLife, but they will soon be disillusioned. Then they will\\n\\t\\t\\t\\trealize the true values of the things they neglected and\\n\\t\\t\\t\\tthe things they cultivated."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "35",
    "NoteID": "3547",
    "Body": "Their behavior is exactly as if they were satisfied\\n\\t\\t\\t\\twithin themselves that they were entitled or given a\\n\\t\\t\\t\\tlicense to worship God and Mammon. In fact the whole\\n\\t\\t\\t\\tthing is their own invention or delusion."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "36",
    "NoteID": "3548",
    "Body": "Cf xxx. 33. In that passage the unreasonable behavior of\\n\\t\\t\\t\\tmen in sorrow and in affluence is considered with\\n\\t\\t\\t\\treference to their attitude to Allah: in distress they\\n\\t\\t\\t\\tturn to Him, but in prosperity they turn to other things.\\n\\t\\t\\t\\tHere the contrast in the two situations is considered\\n\\t\\t\\t\\twith reference to men's inner psychology: in affluence\\n\\t\\t\\t\\tthey are puffed up and unduly elated, and in adversity\\n\\t\\t\\t\\tthey lose all heart. Both attitudes are wrong. In\\n\\t\\t\\t\\tprosperity men should realize that it is not their merits\\n\\t\\t\\t\\tthat deserve all the Bounty of Allah, but that it is\\n\\t\\t\\t\\tgiven out of Allah's abundant generosity; in adversity\\n\\t\\t\\t\\tthey should remember that their suffering is brought on\\n\\t\\t\\t\\tby their own folly and sin, and humbly pray for Allah's\\n\\t\\t\\t\\tgrace and mercy, in order that they may be set on their\\n\\t\\t\\t\\tfeet again. For, as the next verse points out, Allah\\n\\t\\t\\t\\tgives opportunities, gifts, and the good things of life\\n\\t\\t\\t\\tto every one, but in a greater or less measure, and at\\n\\t\\t\\t\\tsome time or other, according to His All-Wise Plan, which\\n\\t\\t\\t\\tis the expression of His holy and benevolent Will."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "37",
    "NoteID": "3549",
    "Body": "Cf. xxviii. 82 and n. 3412. Also see last note. Allah's\\n\\t\\t\\t\\tgrant of certain gifts to some, as well as His\\n\\t\\t\\t\\twithholding of certain gifts from others, are themselves\\n\\t\\t\\t\\tSigns (trials or warnings) to men of faith and\\n\\t\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "38",
    "NoteID": "3550",
    "Body": "For Wajh (Face, Countenance), see n. 114 to ii. 112. Also\\n\\t\\t\\t\\tsee vi. 52."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "38",
    "NoteID": "3551",
    "Body": "In both this life and the next. See n. 29 to ii. 5."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "39",
    "NoteID": "3552",
    "Body": "Riba (literally 'usury' or 'interest') is prohibited, for\\n\\t\\t\\t\\tthe principle is that any profit which we should seek\\n\\t\\t\\t\\tshould be through our own exertions and at our own\\n\\t\\t\\t\\texpense, not through exploiting other people or at their\\n\\t\\t\\t\\texpense, however we may wrap up the process in the\\n\\t\\t\\t\\tspacious phraseology of high finance or City jargon. But\\n\\t\\t\\t\\twe are asked to go beyond this negative precept of\\n\\t\\t\\t\\tavoiding what is wrong. We should show our active love\\n\\t\\t\\t\\tfor our neighbor by spending of our own substance or\\n\\t\\t\\t\\tresources or the utilization of our own talents and\\n\\t\\t\\t\\topportunities in the service of those who need them. Then\\n\\t\\t\\t\\tour reward or recompense will not be merely what we\\n\\t\\t\\t\\tdeserve. It will be multiplied to many times more than\\n\\t\\t\\t\\tour strict account. According to Commentators this verse\\n\\t\\t\\t\\tspecially applies to those who give to others, whether\\n\\t\\t\\t\\tgifts or services, in order to receive from them greater\\n\\t\\t\\t\\tbenefits in return. Such seemingly good acts are void of\\n\\t\\t\\t\\tany merit and deserve no reward from Allah, since He\\n\\t\\t\\t\\tknows the real intention behind such ostensibly good\\n\\t\\t\\t\\tdeeds."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "39",
    "NoteID": "3553",
    "Body": "Seeking the \"Face\" or \"Countenance\" of Allah, i.e., out\\n\\t\\t\\t\\tof our pure love for the true vision of Allah's own Self.\\n\\t\\t\\t\\tSee also n. 3550 above."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "40",
    "NoteID": "3554",
    "Body": "The persons or things or ideas to which we give\\n\\t\\t\\t\\tpart-worship, while our whole and exclusive worship is\\n\\t\\t\\t\\tdue to Allah, are the \"Partners\" we set up. Do we owe our\\n\\t\\t\\t\\texistence to them? Do they sustain our being? Can they\\n\\t\\t\\t\\ttake our life or give it back to us? Certainly not. Then\\n\\t\\t\\t\\thow foolish of us to give them part-worship!"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "40",
    "NoteID": "3555",
    "Body": "Cf. x. 18 and similar passages."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "41",
    "NoteID": "3556",
    "Body": "Allah's Creation was pure and good in itself. All the\\n\\t\\t\\t\\tmischief or corruption was introduced by Evil, viz.,\\n\\t\\t\\t\\tarrogance, selfishness, etc. See n. 3541 to xxx. 30\\n\\t\\t\\t\\tabove. As soon as the mischief has come in, Allah's mercy\\n\\t\\t\\t\\tand goodness step in to stop it. The consequences of Evil\\n\\t\\t\\t\\tmust be evil, and this should be shown in such partial\\n\\t\\t\\t\\tpunishment as 'the hands of men have earned,\" so that it\\n\\t\\t\\t\\tmay be a warning for the future and an invitation to\\n\\t\\t\\t\\tenter the door of repentance."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "41",
    "NoteID": "3557",
    "Body": "The ultimate object of Allah's justice and punishment is\\n\\t\\t\\t\\tto reclaim man from Evil, and to restore him to the\\n\\t\\t\\t\\tpristine purity and innocence in which he was created.\\n\\t\\t\\t\\tThe Evil introduced by his possession of a limited\\n\\t\\t\\t\\tfree-will should be eliminated by the education and\\n\\t\\t\\t\\tpurification of man's own will. For, with his will and\\n\\t\\t\\t\\tmotives purified, he is capable of much greater heights\\n\\t\\t\\t\\tthan a creature not endowed with any free-will."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "42",
    "NoteID": "3558",
    "Body": "If you contemplate history and past experience (including\\n\\t\\t\\t\\tspiritual experience), you will find that evil and\\n\\t\\t\\t\\tcorruption tended to destroy themselves, because they had\\n\\t\\t\\t\\tfalse idols for worship, false standards of conduct, and\\n\\t\\t\\t\\tfalse goals of desire."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "43",
    "NoteID": "3559",
    "Body": "We should recover the balance that has been upset by Evil\\n\\t\\t\\t\\tand Falsehood before it is too late. For a Day will\\n\\t\\t\\t\\tsurely come when true values will be restored and all\\n\\t\\t\\t\\tfalsehood and evil will be destroyed. Nothing but\\n\\t\\t\\t\\trepentance and amendment can avert the consequences of\\n\\t\\t\\t\\tEvil. When the Day actually comes, repentance will be too\\n\\t\\t\\t\\tlate: for the impassable barrier between Evil and Good\\n\\t\\t\\t\\twill have been fixed, and the chance of return to Allah's\\n\\t\\t\\t\\tpattern will have been lost."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "43",
    "NoteID": "3560",
    "Body": "The sharp division will then have been accomplished\\n\\t\\t\\t\\tbetween the unfortunate ones who rejected Truth and Faith\\n\\t\\t\\t\\tand will suffer for their rejection, and the righteous\\n\\t\\t\\t\\twho will attain Peace and Salvation: see next verse. Note\\n\\t\\t\\t\\tthat the state of the Blessed will not be merely a\\n\\t\\t\\t\\tpassive state. They will actively earn and contribute to\\n\\t\\t\\t\\ttheir own happiness."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "45",
    "NoteID": "3561",
    "Body": "Though the repose and bliss will have been won by the\\n\\t\\t\\t\\trighteous by their own efforts, it must not be supposed\\n\\t\\t\\t\\tthat their own merits were equal to the reward they will\\n\\t\\t\\t\\tearn. What they will get will be due to the infinite\\n\\t\\t\\t\\tGrace and Bounty of Allah."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "45",
    "NoteID": "3562",
    "Body": "In form this clause is (here as elsewhere) negative, but\\n\\t\\t\\t\\tit has a positive meaning: Allah loves those who have\\n\\t\\t\\t\\tfaith and trust in Him, and will, out of His Grace and\\n\\t\\t\\t\\tBounty, reward them in abundant measure."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "46",
    "NoteID": "3563",
    "Body": "The theme of Allah's artistry in the physical and the\\n\\t\\t\\t\\tspiritual world was placed before us above in xxx. 20-27.\\n\\t\\t\\t\\tThen, in verse 28-40, we were shown how man and nature\\n\\t\\t\\t\\twere pure as they came out of the hand of Allah, and how\\n\\t\\t\\t\\twe must restore this purity in order to fulfill the Will\\n\\t\\t\\t\\tand Plan of Allah. Now we are told how the restorative\\n\\t\\t\\t\\tand purifying agencies are sent by Allah Himself,-in both\\n\\t\\t\\t\\tthe physical and the spiritual world."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "46",
    "NoteID": "3564",
    "Body": "Cf. vii. 57 and n. 1036 and xxv. 48 and n. 3104."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "46",
    "NoteID": "3565",
    "Body": "In the physical world, the winds not only cool and purify\\n\\t\\t\\t\\tthe air, and bring the blessings of rain, which\\n\\t\\t\\t\\tfertilizes the soil, but they help international commerce\\n\\t\\t\\t\\tand intercourse among men through sea-ways and now by\\n\\t\\t\\t\\tair-ways. Those who know how to take advantage of these\\n\\t\\t\\t\\tblessings of Allah prosper and rejoice, while those who\\n\\t\\t\\t\\tignore or fail to understand these Signs perish in\\n\\t\\t\\t\\tstorms. So in the spiritual world: heralds of glad\\n\\t\\t\\t\\ttidings were sent by Allah in the shape of Messengers:\\n\\t\\t\\t\\tthose who profited by their Message prospered and those\\n\\t\\t\\t\\twho ignored or opposed the Clear Signs perished, see next\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "48",
    "NoteID": "3566",
    "Body": "Again the Parable of the Winds is presented from another\\n\\t\\t\\t\\taspect, both physical and spiritual. In the physical\\n\\t\\t\\t\\tworld, see their play with the Clouds: how they suck up\\n\\t\\t\\t\\tthe moisture from terrestrial water, carry it about in\\n\\t\\t\\t\\tdark clouds as needed, and break it up with rain as\\n\\t\\t\\t\\tneeded. So Allah's wonderful Grace draws up men's\\n\\t\\t\\t\\tspiritual aspirations from the most unlikely places and\\n\\t\\t\\t\\tsuspends them as dark mysteries, according to His holy\\n\\t\\t\\t\\tWill and Plan: and when His Message reaches the hearts of\\n\\t\\t\\t\\tmen even in the smallest fragments, how its recipients\\n\\t\\t\\t\\trejoice, even though before it, they were in utter\\n\\t\\t\\t\\tdespair!"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "48",
    "NoteID": "3567",
    "Body": "See last note."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "50",
    "NoteID": "3568",
    "Body": "After the two Parables about the purifying action of the\\n\\t\\t\\t\\tWinds and their fertilizing action, we now have the\\n\\t\\t\\t\\tParable of the earth that dies in winter or drought and\\n\\t\\t\\t\\tlives again in spring or rain, by Allah's Grace: so in\\n\\t\\t\\t\\tthe spiritual sphere, man may be dead and may live again\\n\\t\\t\\t\\tby the Breath of Allah and His Mercy if she will only\\n\\t\\t\\t\\tplace himself in Allah's hands."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "51",
    "NoteID": "3569",
    "Body": "Another Parable from the forces of nature. We saw how the\\n\\t\\t\\t\\tWinds gladdened, vivified, and enriched those who\\n\\t\\t\\t\\tutilized them in the right spirit. But a wind might be\\n\\t\\t\\t\\tdestructive to tilth in certain circumstances: so the\\n\\t\\t\\t\\tblessings of Allah may-by the wrongdoers resisting and\\n\\t\\t\\t\\tblaspheming-bring punishment to the wrong-doers. Instead\\n\\t\\t\\t\\tof taking the punishment in the right spirit-in the\\n\\t\\t\\t\\tspirit in which Believers of Allah take their\\n\\t\\t\\t\\tmisfortunes,-the Unbelievers curse and deepen their sin!"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "52",
    "NoteID": "3570",
    "Body": "The marvels of Allah's creation can be realized in a\\n\\t\\t\\t\\tgeneral way by every one who has a disposition to allow\\n\\t\\t\\t\\tsuch knowledge to penetrate his mind. But if men, out of\\n\\t\\t\\t\\tperversity, kill the very faculties which Allah has given\\n\\t\\t\\t\\tthem, how can they then understand? Besides the men who\\n\\t\\t\\t\\tdeaden their spiritual sense, there are men who may be\\n\\t\\t\\t\\tlikened to the deaf, who lack one faculty but to whom an\\n\\t\\t\\t\\tappeal can be made through other faculties, such as the\\n\\t\\t\\t\\tsense of sight; but if they turn their backs and refuse\\n\\t\\t\\t\\tto be instructed at all, how can the Truth reach them?"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "53",
    "NoteID": "3571",
    "Body": "See last note. Then there is the case of men about whom\\n\\t\\t\\t\\tthe saying holds true, that none are so blind as those\\n\\t\\t\\t\\twho will not see. They prefer to stray in paths of wrong\\n\\t\\t\\t\\tand of sense-pleasures. How can they be guided in any\\n\\t\\t\\t\\tway? The only persons who gain by spiritual teaching are\\n\\t\\t\\t\\tthose who bring a mind to it-who believe and submit their\\n\\t\\t\\t\\twills to Allah's Will. This is the central doctrine of\\n\\t\\t\\t\\tIslam."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "54",
    "NoteID": "3572",
    "Body": "What was said before about the people who make Allah's\\n\\t\\t\\t\\tteaching of \"of none effect\" does not mean that Evil will\\n\\t\\t\\t\\tdefeat Allah. On the contrary we are asked to contemplate\\n\\t\\t\\t\\tthe mysteries of Allah's wisdom with another Parable. In\\n\\t\\t\\t\\tour physical life we see how strength is evolved out of\\n\\t\\t\\t\\tweakness and weakness out of strength. The helpless babe\\n\\t\\t\\t\\tbecomes a lusty man in the pride of his manhood, and then\\n\\t\\t\\t\\tsinks to a feeble old age: and yet there is wisdom in all\\n\\t\\t\\t\\tthese stages in the Universal Plan. So Allah carries out\\n\\t\\t\\t\\tHis Plan in this world \"as He wills\", i.e., according to\\n\\t\\t\\t\\tHis Will and Plan, and none can gainsay it. And His Plan\\n\\t\\t\\t\\tis wise and can never be frustrated."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "55",
    "NoteID": "3573",
    "Body": "Whatever the seeming inequalities may be now-when the\\n\\t\\t\\t\\tgood appear to be weak and the strong seem to\\n\\t\\t\\t\\toppress-will be removed when the balance will be finally\\n\\t\\t\\t\\tredressed. That will happen in good time,-indeed so\\n\\t\\t\\t\\tquickly that the Transgressors will be taken by Surprise.\\n\\t\\t\\t\\tThey were deluded by the fact that what they took to be\\n\\t\\t\\t\\ttheir triumph or their freedom to do what they liked was\\n\\t\\t\\t\\tonly a reprieve, a \"Term Appointed\", in which they could\\n\\t\\t\\t\\trepent and amend and get Allah's Mercy. Failing this,\\n\\t\\t\\t\\tthey will then be up against the Penalties which they\\n\\t\\t\\t\\tthought they had evaded or defied."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "56",
    "NoteID": "3574",
    "Body": "The men of knowledge and faith knew all along of the true\\n\\t\\t\\t\\tvalues-of the things of this ephemeral life and the\\n\\t\\t\\t\\tthings that will endure and face them at the End,-unlike\\n\\t\\t\\t\\tthe wrong-doers who were content with falsehoods and were\\n\\t\\t\\t\\ttaken by surprise, like ignorant men, when they faced the\\n\\t\\t\\t\\tRealities."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "57",
    "NoteID": "3575",
    "Body": "It will be no use for those who deliberately rejected the\\n\\t\\t\\t\\tclearest warnings in Allah's Message to say: \"Oh we did\\n\\t\\t\\t\\tnot realize this!\" The excuse will be false, and it would\\n\\t\\t\\t\\tbe unreasonable to suppose that they would then be asked\\n\\t\\t\\t\\tto seek Grace by repentance. It will then be too late."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "58",
    "NoteID": "3576",
    "Body": "Things of the highest moment have been explained in the\\n\\t\\t\\t\\tQur-an from various points of view. as in this Sura\\n\\t\\t\\t\\titself, by means of payables and similitudes drawn from\\n\\t\\t\\t\\tnature and from our ordinary daily life. But whatever the\\n\\t\\t\\t\\texplanation, however convincing it may be to men who\\n\\t\\t\\t\\tearnestly seek after Truth, those who deliberately turn\\n\\t\\t\\t\\ttheir backs to Truth can find nothing convincing. In\\n\\t\\t\\t\\ttheir eyes the explanations are mere \"vain talk\" or false\\n\\t\\t\\t\\targuments."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "59",
    "NoteID": "3577",
    "Body": "When an attitude of obstinate resistance to Truth is\\n\\t\\t\\t\\tadopted, the natural consequence (by Allah's Law) is that\\n\\t\\t\\t\\tthe heart and mind get more and more hardened with every\\n\\t\\t\\t\\tact of deliberate rejection. It becomes more and more\\n\\t\\t\\t\\timpervious to the reception of Truth, just as a sealed\\n\\t\\t\\t\\tenvelope is unable to receive any further letter or\\n\\t\\t\\t\\tmessage after it is sealed. Cf. also ii. 7 and n. 31."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "60",
    "NoteID": "3578",
    "Body": "The Prophet of Allah does not slacken in his efforts or\\n\\t\\t\\t\\tfeel discouraged because the Unbelievers laugh at him or\\n\\t\\t\\t\\tpersecute him or even seem to succeed in blocking his\\n\\t\\t\\t\\tMessage. He has firm faith, and he knows that Allah will\\n\\t\\t\\t\\tfinally establish His Truth. He goes on in his divinely\\n\\t\\t\\t\\tentrusted task, with patience and perseverance, which\\n\\t\\t\\t\\tmust win against the levity of his opponents, who have no\\n\\t\\t\\t\\tfaith or certainty at all to sustain them."
  }
]
