[
  {
    "SurahNumber": "96",
    "AyahNumber": "1",
    "NoteID": "6203",
    "Body": "Iqraa may mean \"read\", or \"recite or rehearse\", or\\n\\t\\t\\t\\t\"proclaim aloud\", the object understood being Allah's\\n\\t\\t\\t\\tMessage. In worldly letters he was unversed, but with\\n\\t\\t\\t\\tspiritual knowledge his mind and soul were filled, and\\n\\t\\t\\t\\tnow had come the time when he must stand forth to the\\n\\t\\t\\t\\tworld and declare his mission."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "1",
    "NoteID": "6204",
    "Body": "The declaration or proclamation was to be in the name of\\n\\t\\t\\t\\tAllah the Creator. It was not for any personal benefit to\\n\\t\\t\\t\\tthe Prophet: to him there was to come bitter persecution,\\n\\t\\t\\t\\tsorrow, and suffering. It was the call of Allah for the\\n\\t\\t\\t\\tbenefit of erring humanity. Allah is mentioned by his\\n\\t\\t\\t\\ttitle of \"thy Lord and Cherisher\", to establish a direct\\n\\t\\t\\t\\tnexus between the source of the Message and the one\\n\\t\\t\\t\\taddressed. The Message was not merely an abstract\\n\\t\\t\\t\\tproposition of philosophy, but the direct concrete\\n\\t\\t\\t\\tmessage of a personal Allah to the creatures whom He\\n\\t\\t\\t\\tloves and cherishes. \"Thy\" addressed to the Prophet is\\n\\t\\t\\t\\tappropriate in two ways: (1) he was in direct contact\\n\\t\\t\\t\\twith the divine Messenger (Gabriel) and Him Who sent the\\n\\t\\t\\t\\tMessenger; (2) he represented the whole of humanity, in a\\n\\t\\t\\t\\tfuller sense than that in which Christ Jesus is the \"Son\\n\\t\\t\\t\\tof Man\"."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "2",
    "NoteID": "6205",
    "Body": "Cf. xxiii. 14, The lowly origin of the animal in man is\\n\\t\\t\\t\\tcontrasted with the high destiny offered to him in his\\n\\t\\t\\t\\tintellectual, moral, and spiritual nature by his \"most\\n\\t\\t\\t\\tbountiful\" Creator. No knowledge is withheld from man. On\\n\\t\\t\\t\\tthe contrary, through the faculties freely given to him,\\n\\t\\t\\t\\the acquires it in such measure as outstrips his immediate\\n\\t\\t\\t\\tunderstanding, and leads him ever to strive for newer and\\n\\t\\t\\t\\tnewer meaning."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "4",
    "NoteID": "6206",
    "Body": "See n. 5593 to lxviii. 1. The Arabic words for \"teach\"\\n\\t\\t\\t\\tand \"knowledge\" are from the same root. It is impossible\\n\\t\\t\\t\\tto produce in a Translation the complete orchestral\\n\\t\\t\\t\\tharmony of the words for \"read\", \"teach\", \"pen\" (which\\n\\t\\t\\t\\timplies reading, writing, books, study, research),\\n\\t\\t\\t\\t\"knowledge\" (including science, self knowledge, spiritual\\n\\t\\t\\t\\tunderstanding), and \"proclaim\", an alternative meaning of\\n\\t\\t\\t\\tthe word for \"to read\". This proclaiming or reading\\n\\t\\t\\t\\timplies not only the duty of blazoning forth Allah's\\n\\t\\t\\t\\tmessage, as going, with the prophetic office, but also\\n\\t\\t\\t\\tthe duty of promulgation and wide dissemination of the\\n\\t\\t\\t\\tTruth by all who read and understand it. The\\n\\t\\t\\t\\tcomprehensive meaning of qaraa refers not only to a\\n\\t\\t\\t\\tparticular person and occasion but also gives a universal\\n\\t\\t\\t\\tdirection. And this kind of comprehensive meaning, as we\\n\\t\\t\\t\\thave seen, runs throughout the Qur-an -for those, who\\n\\t\\t\\t\\twill understand."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "5",
    "NoteID": "6207",
    "Body": "Allah teaches us new knowledge at every given moment.\\n\\t\\t\\t\\tIndividuals learn more and more day by day; nations and\\n\\t\\t\\t\\thumanity at large learn fresh knowledge at every stage.\\n\\t\\t\\t\\tThis is even more noticeable and important in the\\n\\t\\t\\t\\tspiritual world."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "6",
    "NoteID": "6208",
    "Body": "All our knowledge and capacities come as gifts from\\n\\t\\t\\t\\tAllah. But man, in his inordinate vanity and insolence,\\n\\t\\t\\t\\tmistakes Allah's gifts for his own achievements. The\\n\\t\\t\\t\\tgifts may be strength or beauty, wealth, position, or\\n\\t\\t\\t\\tpower, or the more subtle gifts of knowledge or talents\\n\\t\\t\\t\\tin individuals,-or Science, or Art, or Government, or\\n\\t\\t\\t\\tOrganisation for mankind in general."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "8",
    "NoteID": "6209",
    "Body": "Man is not self-sufficient, either as an individual, or\\n\\t\\t\\t\\tin his collective capacity. If he arrogates Allah's gifts\\n\\t\\t\\t\\tto himself, he is reminded-backwards, of his lowly\\n\\t\\t\\t\\tphysical origin (from a drop of animal matter), and\\n\\t\\t\\t\\tforwards, of his responsibility and final retum to Allah."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "9",
    "NoteID": "6210",
    "Body": "The words, may be applied generally to perverse humanity,\\n\\t\\t\\t\\twhich seeks not only to rebel against Allah's Law, but\\n\\t\\t\\t\\talso to prevent others from following it. There may\\n\\t\\t\\t\\thowever be a reference here to Abu Jahl, an inveterate\\n\\t\\t\\t\\tenemy of Islam, who used in its early days to insult and\\n\\t\\t\\t\\tpersecute the holy Prophet and those who followed his\\n\\t\\t\\t\\tteaching. He used, in particular, to use shameful methods\\n\\t\\t\\t\\tto prevent the Prophet from going to the Ka'ba for\\n\\t\\t\\t\\tdevotions, and forbid any who came under his influence,\\n\\t\\t\\t\\tfrom offering prayers or performing devotions. He was\\n\\t\\t\\t\\tarrogant and purse-proud and met his end in the battle of\\n\\t\\t\\t\\tBadr."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "11",
    "NoteID": "6211",
    "Body": "Man's insolence leads to two results: (1)\\n\\t\\t\\t\\tself-destruction through self- misleading; (2) a false\\n\\t\\t\\t\\texample or false guidance to others. The righteous man\\n\\t\\t\\t\\tmust therefore test human example or human guidance by\\n\\t\\t\\t\\tthe question, \"Is there Allah's guidance behind it?\" And\\n\\t\\t\\t\\tvisible light would be thrown on it by the question,\\n\\t\\t\\t\\t\"Does it lead to righteousness?\" A flouting of Allah and\\n\\t\\t\\t\\tAllah's truth answers the first question in the negative,\\n\\t\\t\\t\\tand conduct which turns back from the eternal principles\\n\\t\\t\\t\\tof Right answers the second."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "13",
    "NoteID": "6212",
    "Body": "The usual trick of the ungodly is to refuse to face\\n\\t\\t\\t\\tTruth. If they are placed in a corner, they deny what is\\n\\t\\t\\t\\tobvious to reasonable men, and turn their backs."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "15",
    "NoteID": "6213",
    "Body": "Cf. xi. 56, and n. 1551. The forelock is on the forehead,\\n\\t\\t\\t\\tand is thus symbolical of the summit and crown of the\\n\\t\\t\\t\\tman's power or dignity. To be dragged by it is to suffer\\n\\t\\t\\t\\tthe lowest dregs of humiliation. Nasfa'an is a syncopated\\n\\t\\t\\t\\tform of the emphatic first person plural."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "17",
    "NoteID": "6214",
    "Body": "The Pagan Quraish, who formed an oppressive junta or\\n\\t\\t\\t\\tcouncil to manage the Ka'ba were in sympathy with Abu\\n\\t\\t\\t\\tJahl, though they did not go to the unbridled lengths to\\n\\t\\t\\t\\twhich Abu Jahl went. But they could not, all combined,\\n\\t\\t\\t\\tresist the onward march of the divine mission, though\\n\\t\\t\\t\\tthey did all they could to check it."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "18",
    "NoteID": "6215",
    "Body": "All the combined forces of evil, though they may have\\n\\t\\t\\t\\tworldly appearances in their favour, and though they may\\n\\t\\t\\t\\tseem to be successful for a time, cannot stand against\\n\\t\\t\\t\\tAllah. He has but to command His forces of punishment to\\n\\t\\t\\t\\texert themselves, and they will subdue evil, protect\\n\\t\\t\\t\\tAllah's votaries and justify the faith for which the\\n\\t\\t\\t\\tvotaries suffer."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "19",
    "NoteID": "6216",
    "Body": "The righteous man has no fear. He can disregard all the\\n\\t\\t\\t\\tforces of evil that are brought against him. But he must\\n\\t\\t\\t\\tlearn humility: that is his defence. He will bow down in\\n\\t\\t\\t\\tadoration to Allah. He must have the will to bring\\n\\t\\t\\t\\thimself closer to Allah. For Allah is always close to\\n\\t\\t\\t\\thim,-closer to him than his life blood in the jugular\\n\\t\\t\\t\\tvein (I. 16). Man's humility and adoration remove him\\n\\t\\t\\t\\tfrom being an insolent rebel on the one hand and, on the\\n\\t\\t\\t\\tother, prepare his will to realise his nearness to Allah."
  }
]
