[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "8",
        "bookName": "Book of the Two Id Prayers",
        "bookNameArabic": "كتاب صلاة العيدين",
        "hadiths": [
            {
                "hadithNo": "2044",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: \"I attended the prayer of ('Id) Al-Fitr with the Prophet of Allah (s.a.w), Abu Bakr, 'Umar and 'Uthman, and all of them prayed before the Khutbah, then delivered the Khutbah. The Prophet of Allah (s.a.w) came down, and it is as if I can see him, gesturing to the men to remain sitting, then passing through them and going to the women, accompanied by Bilal. He said: \"O Prophet! When believing women come to you to give you the Bay'ah (pledge), that they will not associate anything in worship with Allah...\" and he recited this verse until the end, then he said: \"Do you adhere to that?\" One woman said: \"Yes, O Prophet of Allah,\" and no one else answered him. At that time I did not know who she was. He said: \"Give charity,\" and BiHil spread his garment and said: \"Come on, may my father and mother be sacrificed for you!\" And they started to throw their bracelets and rings into the garment of Bilal.",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ - قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ - أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى الْحَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ قَالَ شَهِدْتُ صَلاَةَ الْفِطْرِ مَعَ نَبِىِّ اللَّهِ -صلى الله عليه وسلم- وَأَبِى بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكُلُّهُمْ يُصَلِّيهَا قَبْلَ الْخُطْبَةِ ثُمَّ يَخْطُبُ قَالَ فَنَزَلَ نَبِىُّ اللَّهِ -صلى الله عليه وسلم- كَأَنِّى أَنْظُرُ إِلَيْهِ حِينَ يُجَلِّسُ الرِّجَالَ بِيَدِهِ ثُمَّ أَقْبَلَ يَشُقُّهُمْ حَتَّى جَاءَ النِّسَاءَ وَمَعَهُ بِلاَلٌ فَقَالَ (يَا أَيُّهَا النَّبِىُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَى أَنْ لاَ يُشْرِكْنَ بِاللَّهِ شَيْئًا) فَتَلاَ هَذِهِ الآيَةَ حَتَّى فَرَغَ مِنْهَا ثُمَّ قَالَ حِينَ فَرَغَ مِنْهَا « أَنْتُنَّ عَلَى ذَلِكِ » فَقَالَتِ امْرَأَةٌ وَاحِدَةٌ لَمْ يُجِبْهُ غَيْرُهَا مِنْهُنَّ نَعَمْ يَا نَبِىَّ اللَّهِ لاَ يُدْرَى حِينَئِذٍ مَنْ هِىَ قَالَ « فَتَصَدَّقْنَ ». فَبَسَطَ بِلاَلٌ ثَوْبَهُ ثُمَّ قَالَ هَلُمَّ فِدًى لَكُنَّ أَبِى وَأُمِّى. فَجَعَلْنَ يُلْقِينَ الْفَتَخَ وَالْخَوَاتِمَ فِى ثَوْبِ بِلاَلٍ."
            },
            {
                "hadithNo": "2045",
                "chapterNo": "0",
                "hadithEnglish": "Ibn 'Abbas said: \"I bear witness that the Messenger of Allah (s.a.w) prayed before the Khutbah, then he delivered the Khutbah. He realized that the women could not hear him, so he went to them and reminded and exhorted them, and told them to give charity. Bilal spread out his cloak and the women started to throw their rings, earrings and other things.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَابْنُ أَبِى عُمَرَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا أَيُّوبُ قَالَ سَمِعْتُ عَطَاءً قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَشْهَدُ عَلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- لَصَلَّى قَبْلَ الْخُطْبَةِ - قَالَ - ثُمَّ خَطَبَ فَرَأَى أَنَّهُ لَمْ يُسْمِعِ النِّسَاءَ فَأَتَاهُنَّ فَذَكَّرَهُنَّ وَوَعَظَهُنَّ وَأَمَرَهُنَّ بِالصَّدَقَةِ وَبِلاَلٌ قَائِلٌ بِثَوْبِهِ فَجَعَلَتِ الْمَرْأَةُ تُلْقِى الْخَاتَمَ وَالْخُرْصَ وَالشَّىْءَ."
            },
            {
                "hadithNo": "2046",
                "chapterNo": "0",
                "hadithEnglish": "A similar report (as no. 2045) was narrated from Ayyub with this chain.",
                "hadithArabic": "وَحَدَّثَنِيهِ أَبُو الرَّبِيعِ الزَّهْرَانِىُّ حَدَّثَنَا حَمَّادٌ ح وَحَدَّثَنِى يَعْقُوبُ الدَّوْرَقِىُّ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ كِلاَهُمَا عَنْ أَيُّوبَ بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "2047",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Ibn Juraij from 'Ata', from that Jabir bin 'Abdullah, who said: \"The Prophet (s.a.w) stood one day on ('Id) Al-Fitr and prayed. He started with the prayer before the Khutbah, then he addressed the people. When the Prophet of Allah (s.a.w) had finished he came down and went to the women, and he reminded them while leaning on Bilal's arm. Bilal spread his garment and the women threw charity into it. I said to 'Ata': \"Was it the Zakat Al-Fitr?\" He said: \"No, rather it was charity that they gave at that time; women threw in their bracelets and so on.\" I said to 'Ata': \"Is it a duty of the Imam now to go to the woman when he has finished his Khutbah and address them?\" He said: \"Yes, for the life of me, that is a duty for them, and why is it that they do not do that?\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ رَافِعٍ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى عَطَاءٌ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُهُ يَقُولُ إِنَّ النَّبِىَّ -صلى الله عليه وسلم- قَامَ يَوْمَ الْفِطْرِ فَصَلَّى فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ النَّاسَ فَلَمَّا فَرَغَ نَبِىُّ اللَّهِ -صلى الله عليه وسلم- نَزَلَ وَأَتَى النِّسَاءَ فَذَكَّرَهُنَّ وَهُوَ يَتَوَكَّأُ عَلَى يَدِ بِلاَلٍ وَبِلاَلٌ بَاسِطٌ ثَوْبَهُ يُلْقِينَ النِّسَاءُ صَدَقَةً. قُلْتُ لِعَطَاءٍ زَكَاةَ يَوْمِ الْفِطْرِ قَالَ لاَ وَلَكِنْ صَدَقَةً يَتَصَدَّقْنَ بِهَا حِينَئِذٍ تُلْقِى الْمَرْأَةُ فَتَخَهَا وَيُلْقِينَ وَيُلْقِينَ. قُلْتُ لِعَطَاءٍ أَحَقًّا عَلَى الإِمَامِ الآنَ أَنْ يَأْتِىَ النِّسَاءَ حِينَ يَفْرُغُ فَيُذَكِّرَهُنَّ قَالَ إِى لَعَمْرِى إِنَّ ذَلِكَ لَحَقٌّ عَلَيْهِمْ وَمَا لَهُمْ لاَ يَفْعَلُونَ ذَلِكَ."
            },
            {
                "hadithNo": "2048",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"I attended 'Id prayer with the Messenger of Allah (s.a.w), and he started with the prayer before the Khutbah, with no Adhan and no Iqamah. Then he stood, leaning on Bilal, and enjoined Taqwa of Allah and urged us to obey Him, and exhorted and reminded the people. Then he went to the women, and exhorted and reminded them. He said: 'Give charity, for most of you are fuel for Hell.' A woman with dark cheeks, who was one of the best of women, stood up and said: 'Why is that, O Messenger of Allah?' He said: 'Because you complain a great deal, and you are ungrateful to your husbands.' They started giving their jewelry in charity, throwing their earrings and rings into the cloak of Bilal.\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِى حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِى سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ شَهِدْتُ مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- الصَّلاَةَ يَوْمَ الْعِيدِ فَبَدَأَ بِالصَّلاَةِ قَبْلَ الْخُطْبَةِ بِغَيْرِ أَذَانٍ وَلاَ إِقَامَةٍ ثُمَّ قَامَ مُتَوَكِّئًا عَلَى بِلاَلٍ فَأَمَرَ بِتَقْوَى اللَّهِ وَحَثَّ عَلَى طَاعَتِهِ وَوَعَظَ النَّاسَ وَذَكَّرَهُمْ ثُمَّ مَضَى حَتَّى أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ فَقَالَ « تَصَدَّقْنَ فَإِنَّ أَكْثَرَكُنَّ حَطَبُ جَهَنَّمَ ». فَقَامَتِ امْرَأَةٌ مِنْ سِطَةِ النِّسَاءِ سَفْعَاءُ الْخَدَّيْنِ فَقَالَتْ لِمَ يَا رَسُولَ اللَّهِ قَالَ « لأَنَّكُنَّ تُكْثِرْنَ الشَّكَاةَ وَتَكْفُرْنَ الْعَشِيرَ ». قَالَ فَجَعَلْنَ يَتَصَدَّقْنَ مِنْ حُلِيِّهِنَّ يُلْقِينَ فِى ثَوْبِ بِلاَلٍ مِنْ أَقْرِطَتِهِنَّ وَخَوَاتِمِهِنَّ."
            },
            {
                "hadithNo": "2049",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Ibn Juraij who said: \"'Ata' informed me from Ibn 'Abbas and Jabir bin 'Abdullah Al-Ansari who said: 'There was no Adhan called on the day of Al-Fitr or Al-Adha.' I asked him about that later on and he said: 'Jabir bin 'Abdullah Al-Ansari informed me that there was no Adhan for the prayer on the day of Al-Fitr, neither before the Imam came out nor afterwards, and there was no Iqamah or call or anything; no call on that day and no Iqamah .'\"",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى عَطَاءٌ عَنِ ابْنِ عَبَّاسٍ وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِىِّ قَالاَ لَمْ يَكُنْ يُؤَذَّنُ يَوْمَ الْفِطْرِ وَلاَ يَوْمَ الأَضْحَى. ثُمَّ سَأَلْتُهُ بَعْدَ حِينٍ عَنْ ذَلِكَ فَأَخْبَرَنِى قَالَ أَخْبَرَنِى جَابِرُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِىُّ أَنْ لاَ أَذَانَ لِلصَّلاَةِ يَوْمَ الْفِطْرِ حِينَ يَخْرُجُ الإِمَامُ وَلاَ بَعْدَ مَا يَخْرُجُ وَلاَ إِقَامَةَ وَلاَ نِدَاءَ وَلاَ شَىْءَ لاَ نِدَاءَ يَوْمَئِذٍ وَلاَ إِقَامَةَ."
            },
            {
                "hadithNo": "2050",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Ibn 'Abbas sent word to Ibn Az-Zubair when allegiance was first sworn to him, saying: \"There is no Adhan called on the day of Al-Fitr, so do not have the Adhan called.\" So Ibn Az-Zubair did not have the Adhan called for it on that day. And he also sent word to him saying: \"The Khutbah comes after the prayer; this is how it was done.\" So Ibn Az-Zubair prayed before the Khutbah.",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى عَطَاءٌ أَنَّ ابْنَ عَبَّاسٍ أَرْسَلَ إِلَى ابْنِ الزُّبَيْرِ أَوَّلَ مَا بُويِعَ لَهُ أَنَّهُ لَمْ يَكُنْ يُؤَذَّنُ لِلصَّلاَةِ يَوْمَ الْفِطْرِ فَلاَ تُؤَذِّنْ لَهَا - قَالَ - فَلَمْ يُؤَذِّنْ لَهَا ابْنُ الزُّبَيْرِ يَوْمَهُ وَأَرْسَلَ إِلَيْهِ مَعَ ذَلِكَ إِنَّمَا الْخُطْبَةُ بَعْدَ الصَّلاَةِ وَإِنَّ ذَلِكَ قَدْ كَانَ يُفْعَلُ - قَالَ - فَصَلَّى ابْنُ الزُّبَيْرِ قَبْلَ الْخُطْبَةِ."
            },
            {
                "hadithNo": "2051",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Jabir bin Samurah said: \"I prayed both 'Id with the Messenger of Allah (s.a.w), not just one or two times, with no Adhan and no Iqamah .\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَحَسَنُ بْنُ الرَّبِيعِ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ حَدَّثَنَا أَبُو الأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- الْعِيدَيْنِ غَيْرَ مَرَّةٍ وَلاَ مَرَّتَيْنِ بِغَيْرِ أَذَانٍ وَلاَ إِقَامَةٍ."
            },
            {
                "hadithNo": "2052",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Prophet (s.a.w) 'Abu Bakr and 'Umar used to Offer the 'Id prayer before the Khutbah.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا يُصَلُّونَ الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ."
            },
            {
                "hadithNo": "2053",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah (s.a.w) used to come out on the day of Al-Adha and Al-Fitr and start with the prayer. When he had prayed and said the Salam, he stood up and turned to the people, who were sitting where they had prayed. If he needed to send out an army he would do so, and if he needed to issue any other orders, he would do so. And he used to say: \"Give charity, give charity, give charity.\" The ones who gave the most charity were the women. Then he would depart. It continued like that until the time of Marwan bin Al-Hakam. I went out hand in hand with Marwan until we reached the prayer place, where Kathir bin As-Salt had built a Minbar of clay and bricks. Marwan started to pull me with his hand, as if he wanted to pull me towards the Minbar, and I was trying to pull him towards the prayer. When I realized what he was doing, I said to him: \"What about starting with the prayer?\" He said: \"No, O Abu Sa'eed, what you know has been abandoned.\" I said: \"No, by the One in Whose Hand is my soul! You are not doing anything better than what I know\" - three times, then he left.",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ عَنْ دَاوُدَ بْنِ قَيْسٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ عَنْ أَبِى سَعِيدٍ الْخُدْرِىِّ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- كَانَ يَخْرُجُ يَوْمَ الأَضْحَى وَيَوْمَ الْفِطْرِ فَيَبْدَأُ بِالصَّلاَةِ فَإِذَا صَلَّى صَلاَتَهُ وَسَلَّمَ قَامَ فَأَقْبَلَ عَلَى النَّاسِ وَهُمْ جُلُوسٌ فِى مُصَلاَّهُمْ فَإِنْ كَانَ لَهُ حَاجَةٌ بِبَعْثٍ ذَكَرَهُ لِلنَّاسِ أَوْ كَانَتْ لَهُ حَاجَةٌ بِغَيْرِ ذَلِكَ أَمَرَهُمْ بِهَا وَكَانَ يَقُولُ « تَصَدَّقُوا تَصَدَّقُوا تَصَدَّقُوا ». وَكَانَ أَكْثَرَ مَنْ يَتَصَدَّقُ النِّسَاءُ ثُمَّ يَنْصَرِفُ فَلَمْ يَزَلْ كَذَلِكَ حَتَّى كَانَ مَرْوَانُ بْنُ الْحَكَمِ فَخَرَجْتُ مُخَاصِرًا مَرْوَانَ حَتَّى أَتَيْنَا الْمُصَلَّى فَإِذَا كَثِيرُ بْنُ الصَّلْتِ قَدْ بَنَى مِنْبَرًا مِنْ طِينٍ وَلَبِنٍ فَإِذَا مَرْوَانُ يُنَازِعُنِى يَدَهُ كَأَنَّهُ يَجُرُّنِى نَحْوَ الْمِنْبَرِ وَأَنَا أَجُرُّهُ نَحْوَ الصَّلاَةِ فَلَمَّا رَأَيْتُ ذَلِكَ مِنْهُ قُلْتُ أَيْنَ الاِبْتِدَاءُ بِالصَّلاَةِ فَقَالَ لاَ يَا أَبَا سَعِيدٍ قَدْ تُرِكَ مَا تَعْلَمُ. قُلْتُ كَلاَّ وَالَّذِى نَفْسِى بِيَدِهِ لاَ تَأْتُونَ بِخَيْرٍ مِمَّا أَعْلَمُ. ثَلاَثَ مِرَارٍ ثُمَّ انْصَرَفَ."
            },
            {
                "hadithNo": "2054",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Umm 'Atiyyah said: \"On the two 'Id, the Prophet (s.a.w) commanded us to bring out the girls who had attained puberty and those who were in seclusion, but he told the menstruating women to keep away from the Musalla (prayer-place) of the Muslims.\"",
                "hadithArabic": "حَدَّثَنِى أَبُو الرَّبِيعِ الزَّهْرَانِىُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ قَالَتْ أَمَرَنَا - تَعْنِى النَّبِىَّ -صلى الله عليه وسلم- - أَنْ نُخْرِجَ فِى الْعِيدَيْنِ الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ وَأَمَرَ الْحُيَّضَ أَنْ يَعْتَزِلْنَ مُصَلَّى الْمُسْلِمِينَ."
            },
            {
                "hadithNo": "2055",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Umm 'Atiyyah said: \"We were commanded to bring out women in seclusion and virgins on the two 'Id. And the menstruating women were to come out but stay behind the people, reciting Takbir with the people.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ عَاصِمٍ الأَحْوَلِ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْ كُنَّا نُؤْمَرُ بِالْخُرُوجِ فِى الْعِيدَيْنِ وَالْمُخَبَّأَةُ وَالْبِكْرُ قَالَتِ الْحُيَّضُ يَخْرُجْنَ فَيَكُنَّ خَلْفَ النَّاسِ يُكَبِّرْنَ مَعَ النَّاسِ."
            },
            {
                "hadithNo": "2056",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Umm 'Atiyyah said: \"On Al-Fitr and Al-Adha, the Messenger of Allah (s.a.w) commanded us to bring out the girls who had reached puberty, menstruating women and women in seclusion. The menstruating women were to keep away from the prayer but to witness goodness and the supplications of the Muslims. I said: 'O Messenger of Allah, one of us may not have a Jilbab.' He said: 'Let her sister lend her a Jilbab to wear.\"'",
                "hadithArabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا هِشَامٌ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْ أَمَرَنَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَنْ نُخْرِجَهُنَّ فِى الْفِطْرِ وَالأَضْحَى الْعَوَاتِقَ وَالْحُيَّضَ وَذَوَاتِ الْخُدُورِ فَأَمَّا الْحُيَّضُ فَيَعْتَزِلْنَ الصَّلاَةَ وَيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُسْلِمِينَ. قُلْتُ يَا رَسُولَ اللَّهِ إِحْدَانَا لاَ يَكُونُ لَهَا جِلْبَابٌ قَالَ « لِتُلْبِسْهَا أُخْتُهَا مِنْ جِلْبَابِهَا »."
            },
            {
                "hadithNo": "2057",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Messenger of Allah (s.a.w) came out on the day of Adha or Fitr and prayed two Rak'ah, and he did not offer any other prayer before or after that. Then he went to the women, accompanied by Bilal, and commanded them to give charity, so women started giving their earrings and necklaces.",
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِىُّ حَدَّثَنَا أَبِى حَدَّثَنَا شُعْبَةُ عَنْ عَدِىٍّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- خَرَجَ يَوْمَ أَضْحَى أَوْ فِطْرٍ فَصَلَّى رَكْعَتَيْنِ لَمْ يُصَلِّ قَبْلَهَا وَلاَ بَعْدَهَا ثُمَّ أَتَى النِّسَاءَ وَمَعَهُ بِلاَلٌ فَأَمَرَهُنَّ بِالصَّدَقَةِ فَجَعَلَتِ الْمَرْأَةُ تُلْقِى خُرْصَهَا وَتُلْقِى سِخَابَهَا."
            },
            {
                "hadithNo": "2058",
                "chapterNo": "2",
                "hadithEnglish": "A similar report (as no. 2057) was narrated from Shu'bah with this chain.",
                "hadithArabic": "وَحَدَّثَنِيهِ عَمْرٌو النَّاقِدُ حَدَّثَنَا ابْنُ إِدْرِيسَ ح وَحَدَّثَنِى أَبُو بَكْرِ بْنُ نَافِعٍ وَمُحَمَّدُ بْنُ بَشَّارٍ جَمِيعًا عَنْ غُنْدَرٍ كِلاَهُمَا عَنْ شُعْبَةَ بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "2059",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Ubaidullah bin 'Abdullah that 'Umar bin Al-Khattab asked Abu Waqid Al-Laithi: \"What did the Messenger of Allah (s.a.w) recite in Al-Adha and Al-Fitr?\" He said: \"He used to recite: Surat Qaf. By the Glorious Qur'an\" and: \"The Hour has drawn near, and the moon has been cleft asunder.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِىِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ سَأَلَ أَبَا وَاقِدٍ اللَّيْثِىَّ مَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فِى الأَضْحَى وَالْفِطْرِ فَقَالَ كَانَ يَقْرَأُ فِيهِمَا بِ (ق وَالْقُرْآنِ الْمَجِيدِ) وَ (اقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ)"
            },
            {
                "hadithNo": "2060",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Waqid Al-Laithi said: \"'Umar bin Al-Khattab asked me what the Messenger of Allah (s.a.w) recited on the day of 'Id. I said: \"'The Hour has drawn near \" and: \"Sura Qaf By the Glorious Qur'an.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِىُّ حَدَّثَنَا فُلَيْحٌ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِى وَاقِدٍ اللَّيْثِىِّ قَالَ سَأَلَنِى عُمَرُ بْنُ الْخَطَّابِ عَمَّا قَرَأَ بِهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فِى يَوْمِ الْعِيدِ فَقُلْتُ بِ (اقْتَرَبَتِ السَّاعَةُ) وَ (ق وَالْقُرْآنِ الْمَجِيدِ)"
            },
            {
                "hadithNo": "2061",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Aishah said: \"Abu Bakr entered upon me and there were two of the young girls of the Ansar with me who were singing the verses that the Ansar had recited on the day of Bu'ath.\" She said: \"But they were known to be singers. Abu Bakr said: 'Wind instruments of the Shaitan in the house of the Messenger of Allah (s.a.w)?' That was on the day of 'Id. The Messenger of Allah (s.a.w) said: 'O Abu Bakr, every people has its 'Id and this is our 'Id.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ دَخَلَ عَلَىَّ أَبُو بَكْرٍ وَعِنْدِى جَارِيَتَانِ مِنْ جَوَارِى الأَنْصَارِ تُغَنِّيَانِ بِمَا تَقَاوَلَتْ بِهِ الأَنْصَارُ يَوْمَ بُعَاثٍ قَالَتْ وَلَيْسَتَا بِمُغَنِّيَتَيْنِ.\r\nفَقَالَ أَبُو بَكْرٍ أَبِمُزْمُورِ الشَّيْطَانِ فِى بَيْتِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- وَذَلِكَ فِى يَوْمِ عِيدٍ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « يَا أَبَا بَكْرٍ إِنَّ لِكُلِّ قَوْمٍ عِيدًا وَهَذَا عِيدُنَا »."
            },
            {
                "hadithNo": "2062",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Hisham with this chain (a similar Hadith as no. 2061) and he said: \"Two young girls playing a Duff.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِى مُعَاوِيَةَ عَنْ هِشَامٍ بِهَذَا الإِسْنَادِ. وَفِيهِ جَارِيَتَانِ تَلْعَبَانِ بِدُفٍّ."
            },
            {
                "hadithNo": "2063",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from 'Aishah that Abu Bakr As-Siddiq entered upon her, and there were two young girls with her during the days of Mina, who were singing and beating (the Duff), and the Messenger of Allah (s.a.w) was covering himself with his garment. Abu Bakr rebuked them, and the Messenger of Allah (s.a.w) uncovered his face and said: \"Let them be, O Abu Bakr, for these are the days of 'Id.\" She said: \"I remember the Messenger of Allah (s.a.w) screening me with his Rida' while I was watching the Ethiopians who were playing, and I was a young girl. So you should understand the fondness that young girls have for amusement.\"",
                "hadithArabic": "حَدَّثَنِى هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى عَمْرٌو أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ أَبَا بَكْرٍ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ فِى أَيَّامِ مِنًى تُغَنِّيَانِ وَتَضْرِبَانِ وَرَسُولُ اللَّهِ -صلى الله عليه وسلم- مُسَجًّى بِثَوْبِهِ فَانْتَهَرَهُمَا أَبُو بَكْرٍ فَكَشَفَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- عَنْهُ وَقَالَ « دَعْهُمَا يَا أَبَا بَكْرٍ فَإِنَّهَا أَيَّامُ عِيدٍ ». وَقَالَتْ رَأَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَسْتُرُنِى بِرِدَائِهِ وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ وَهُمْ يَلْعَبُونَ وَأَنَا جَارِيَةٌ فَاقْدِرُوا قَدْرَ الْجَارِيَةِ الْعَرِبَةِ الْحَدِيثَةِ السِّنِّ."
            },
            {
                "hadithNo": "2064",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Urwah bin Az-Zubair said: '\"Aishah said: 'By Allah, I remember the Messenger of Allah (s.a.w) standing at the door to my apartment when the Ethiopians were playing with their spears in the Masjid of the Messenger of Allah (s.a.w), so that I could watch their games, and he was only standing there for my sake until I was the one who left. So you should understand the fondness that young girls have for amusement.\"'",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنِى ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ قَالَ قَالَتْ عَائِشَةُ وَاللَّهِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُومُ عَلَى بَابِ حُجْرَتِى - وَالْحَبَشَةُ يَلْعَبُونَ بِحِرَابِهِمْ فِى مَسْجِدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- - يَسْتُرُنِى بِرِدَائِهِ لِكَىْ أَنْظُرَ إِلَى لَعِبِهِمْ ثُمَّ يَقُومُ مِنْ أَجْلِى حَتَّى أَكُونَ أَنَا الَّتِى أَنْصَرِفُ. فَاقْدُرُوا قَدْرَ الْجَارِيَةِ الْحَدِيثَةِ السِّنِّ حَرِيصَةً عَلَى اللَّهْوِ."
            },
            {
                "hadithNo": "2065",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Aishah said: \"The Messenger of Allah (s.a.w) came in and there were with me two young girls who were singing the songs of Bu'ath. He lay down on the bed and turned his face away. Then Abu Bakr came in and rebuked me, saying: 'The wind instruments of the Shaitan in the presence of the Messenger of Allah (s.a.w)?' The Messenger of Allah (s.a.w) turned to him and said: 'Let them be.' When he turned away I signaled to them and they left. And on the day of 'Id, the black men were playing with shields and spears. Either I asked the Messenger of Allah (s.a.w) (to let me watch) or he said: 'Do you want to watch?' and I said: 'Yes.' So he made me stand behind him, with my cheek against his, and he was saying: 'Carry on, O Banu Arfidah!' until I had had enough, then he said: 'Have you had enough?' and I said yes, so he said, 'Go then.\"'",
                "hadithArabic": "حَدَّثَنِى هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ وَيُونُسُ بْنُ عَبْدِ الأَعْلَى - وَاللَّفْظُ لِهَارُونَ - قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرٌو أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ دَخَلَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَعِنْدِى جَارِيَتَانِ تُغَنِّيَانِ بِغِنَاءِ بُعَاثٍ فَاضْطَجَعَ عَلَى الْفِرَاشِ وَحَوَّلَ وَجْهَهُ فَدَخَلَ أَبُو بَكْرٍ فَانْتَهَرَنِى وَقَالَ مِزْمَارُ الشَّيْطَانِ عِنْدَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَأَقْبَلَ عَلَيْهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « دَعْهُمَا » فَلَمَّا غَفَلَ غَمَزْتُهُمَا فَخَرَجَتَا وَكَانَ يَوْمَ عِيدٍ يَلْعَبُ السُّودَانُ بِالدَّرَقِ وَالْحِرَابِ فَإِمَّا سَأَلْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- وَإِمَّا قَالَ « تَشْتَهِينَ تَنْظُرِينَ ». فَقُلْتُ نَعَمْ فَأَقَامَنِى وَرَاءَهُ خَدِّى عَلَى خَدِّهِ وَهُوَ يَقُولُ « دُونَكُمْ يَا بَنِى أَرْفَدَةَ ». حَتَّى إِذَا مَلِلْتُ قَالَ « حَسْبُكِ ». قُلْتُ نَعَمْ. قَالَ « فَاذْهَبِى »."
            },
            {
                "hadithNo": "2066",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that 'Aishah said: \"Some Ethiopians came to give a display with their weapons in the Masjid on the day of 'Id. The Prophet (s.a.w) called me and I put my head on his shoulder and started watching their display, until I was the one who decided to stop watching them.\"",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ جَاءَ حَبَشٌ يَزْفِنُونَ فِى يَوْمِ عِيدٍ فِى الْمَسْجِدِ فَدَعَانِى النَّبِىُّ -صلى الله عليه وسلم- فَوَضَعْتُ رَأْسِى عَلَى مَنْكِبِهِ فَجَعَلْتُ أَنْظُرُ إِلَى لَعِبِهِمْ حَتَّى كُنْتُ أَنَا الَّتِى أَنْصَرِفُ عَنِ النَّظَرِ إِلَيْهِمْ."
            },
            {
                "hadithNo": "2067",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Hisham (a similar Hadith with this chain, but he did not mention: \"in the Masjid.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِى زَائِدَةَ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ كِلاَهُمَا عَنْ هِشَامٍ بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرَا فِى الْمَسْجِدِ."
            },
            {
                "hadithNo": "2068",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Ibn Juraij, who said: 'Ata' informed me, he said: \"Ubaid bin 'Umair informed me, he said: \"Aishah told me that she said concerning those who were playing: I wish I could see them.' She said: The Messenger of Allah (s.a.w) stood up, and I stood at the door, watching between his ears and his shoulder, while they were playing in the Masjid.\"' 'Ata' said: Persians, or Ethiopians\"' He said: \"Ibn 'Atiq said to me: 'Rather, they were Ethiopians.\"'",
                "hadithArabic": "وَحَدَّثَنِى إِبْرَاهِيمُ بْنُ دِينَارٍ وَعُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّىُّ وَعَبْدُ بْنُ حُمَيْدٍ كُلُّهُمْ عَنْ أَبِى عَاصِمٍ - وَاللَّفْظُ لِعُقْبَةَ - قَالَ حَدَّثَنَا أَبُو عَاصِمٍ عَنِ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِى عَطَاءٌ أَخْبَرَنِى عُبَيْدُ بْنُ عُمَيْرٍ أَخْبَرَتْنِى عَائِشَةُ أَنَّهَا قَالَتْ لِلَعَّابِينَ وَدِدْتُ أَنِّى أَرَاهُمْ قَالَتْ فَقَامَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَقُمْتُ عَلَى الْبَابِ أَنْظُرُ بَيْنَ أُذُنَيْهِ وَعَاتِقِهِ وَهُمْ يَلْعَبُونَ فِى الْمَسْجِدِ. قَالَ عَطَاءٌ فُرْسٌ أَوْ حَبَشٌ. قَالَ وَقَالَ لِى ابْنُ عَتِيقٍ بَلْ حَبَشٌ."
            },
            {
                "hadithNo": "2069",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"While the Ethiopians were playing with their spears in the presence of the Messenger of Allah (s.a.w), 'Umar bin Al-Khattab came in, and he bent down to pick up some pebbles to throw at them, but the Messenger of Allah (s.a.w) said: 'Let them be, O 'Umar!\"'",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ عَنِ ابْنِ الْمُسَيَّبِ عَنْ أَبِى هُرَيْرَةَ قَالَ بَيْنَمَا الْحَبَشَةُ يَلْعَبُونَ عِنْدَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- بِحِرَابِهِمْ إِذْ دَخَلَ عُمَرُ بْنُ الْخَطَّابِ فَأَهْوَى إِلَى الْحَصْبَاءِ يَحْصِبُهُمْ بِهَا. فَقَالَ لَهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « دَعْهُمْ يَا عُمَرُ »."
            }
        ]
    }
]