[
  {
    "SurahNumber": "37",
    "AyahNumber": "1",
    "NoteID": "4030",
    "Body": "At a later stage, we shall study the general meaning of\\n\\t\\t\\t\\tthe adjurations in the Qur-an indicated by the particle\\n\\t\\t\\t\\twa. See app. xi. Here we may note that the last Sura\\n\\t\\t\\t\\t(Ya-Sin) practically began with the adjuration \"by the\\n\\t\\t\\t\\tQur-an, full of wisdom\", emphasising the fact that\\n\\t\\t\\t\\tRevelation was the evidence by which we could learn the\\n\\t\\t\\t\\thighest wisdom of the spiritual world. Here our attention\\n\\t\\t\\t\\tis called in three verses or clauses, to three definite\\n\\t\\t\\t\\tattitudes which illustrate the triumph of Good and the\\n\\t\\t\\t\\tfrustration of Evil. See the notes following."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "1",
    "NoteID": "4031",
    "Body": "Two questions arise: (1) are the doers of the three\\n\\t\\t\\t\\tthings noted in verses 1-3 the same persons, whose\\n\\t\\t\\t\\tactions or qualities are differently described, or are\\n\\t\\t\\t\\tthey three distinct sets of persons? (2) in either case,\\n\\t\\t\\t\\twho are they? As to (1) the most authoritative view is\\n\\t\\t\\t\\tthat the three clauses describe the same set of persons\\n\\t\\t\\t\\tin different aspects. As to (2) some take them to refer\\n\\t\\t\\t\\tto angels, and others understand by them the good men,\\n\\t\\t\\t\\tthe men of God, who strive and range themselves in\\n\\t\\t\\t\\tAllah's service. The words are perfectly general, and I\\n\\t\\t\\t\\tinterpret them to refer to both classes. The feminine\\n\\t\\t\\t\\tform is grammatically used in Arabic idiom for the\\n\\t\\t\\t\\tindefinite plural. In xxxvii. 165 below, the word saffan\\n\\t\\t\\t\\tis used in the definite plural, and seems to be spoken by\\n\\t\\t\\t\\tthese beings, angels or men of God or both, according to\\n\\t\\t\\t\\thow we interpret this verse."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "2",
    "NoteID": "4032",
    "Body": "The three acts in verses 1-3 are consecutive, as shown by\\n\\t\\t\\t\\tthe particle fa. I understand them to mean that angels\\n\\t\\t\\t\\tand good men (1) are ever ready to range themselves in\\n\\t\\t\\t\\tranks in the service of Allah and work in perfect\\n\\t\\t\\t\\tdiscipline and accord at all times; (2) that they check\\n\\t\\t\\t\\tand frustrate evil wherever they find it and they are\\n\\t\\t\\t\\tstrengthened in doing so by their discipline and their\\n\\t\\t\\t\\tranging themselves in ranks; and (3) that this service\\n\\t\\t\\t\\tfurthers the Kingdom of Allah and proclaims His Message\\n\\t\\t\\t\\tand His glory to all creation."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "4",
    "NoteID": "4033",
    "Body": "That divine Message is summed up in the gospel of Divine\\n\\t\\t\\t\\tUnity, on which the greatest emphasis is laid: \"verily,\\n\\t\\t\\t\\tverily your God is One\". It is a fact intimately\\n\\t\\t\\t\\tconnected with our own life and destiny. 'Your Lord is\\n\\t\\t\\t\\tone Who cares for you and cherishes you; you are dear to\\n\\t\\t\\t\\tHim. And He is One: it is only He that you have to look\\n\\t\\t\\t\\tto, the source of all goodness, love, and power. You are\\n\\t\\t\\t\\tnot the sport of many contending forces or blind chances.\\n\\t\\t\\t\\tThere is complete harmony and unity in heaven and you\\n\\t\\t\\t\\thave to put yourselves into unison with it-by discipline\\n\\t\\t\\t\\tin ranks, by unity of plan and purpose in repelling evil,\\n\\t\\t\\t\\tand by concerted action in promoting the Kingdom of\\n\\t\\t\\t\\tAllah. Here is the mystery of the manifold variety of\\n\\t\\t\\t\\tcreation pointing to the absolute Unity of the Creator."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "5",
    "NoteID": "4034",
    "Body": "Allah is the Lord of everything that exists-'the heavens\\n\\t\\t\\t\\tand the earth, and all between them'. He is the Lord of\\n\\t\\t\\t\\tthe Mashariq,-of every point at the rising of the sun. As\\n\\t\\t\\t\\tthe Commentators tell us, there are in the solar year\\n\\t\\t\\t\\tonly two equinoctial days, when the sun rises due east:\\n\\t\\t\\t\\ton every other the sun rises at a shifting point either\\n\\t\\t\\t\\tnorth or south of due east. In vii. 137 we have Mashariq\\n\\t\\t\\t\\tal ardhi wa magaribaha, where the plural of the words for\\n\\t\\t\\t\\tEast and West is negligible, as the conjunction of the\\n\\t\\t\\t\\ttwo embraces all points. The same may be said of lxx. 40,\\n\\t\\t\\t\\twhere Allah is called \"Lord of all points in the East and\\n\\t\\t\\t\\tthe West\". If we are speaking of longitudes, they may\\n\\t\\t\\t\\tembrace all latitudes. In lv. 17 Allah is called \"Lord of\\n\\t\\t\\t\\tthe two Easts and the two Wests\", referring to the\\n\\t\\t\\t\\textreme points in either case. A cursory reader may ask,\\n\\t\\t\\t\\twhy is only the East referred to here? The reply is that\\n\\t\\t\\t\\tit is not so much the East as the rising of the sun, on\\n\\t\\t\\t\\twhich stress is laid. The Arabic mashriq or mashariq is\\n\\t\\t\\t\\tclose enough to the root-word sharaqa, to suggest, not so\\n\\t\\t\\t\\tmuch the East as the rising of the sun, especially when\\n\\t\\t\\t\\tthe plural form is used. The glorious sun rises from\\n\\t\\t\\t\\tdifferent points, as seen by us, but it illuminates the\\n\\t\\t\\t\\twhole heaven and earth. It is an emblem of Unity."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "6",
    "NoteID": "4035",
    "Body": "Cf. lxvii. 5, lxxii. 8-9."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "6",
    "NoteID": "4036",
    "Body": "'Stars' may be taken here in the popular sense, as\\n\\t\\t\\t\\treferring to fixed stars, planets, comets, shooting\\n\\t\\t\\t\\tstars, etc. On a clear night the beauty of the starry\\n\\t\\t\\t\\theavens is proverbial. Here they are meant to illustrate\\n\\t\\t\\t\\ttwo points: (1) their marvellous beauty and their\\n\\t\\t\\t\\tgroupings and motions (apparent or real) manifest and\\n\\t\\t\\t\\ttypify the Design and Harmony of the One true Creator:\\n\\t\\t\\t\\tand (2) the power and glory behind them typify that there\\n\\t\\t\\t\\tis a guard against the assaults of Evil (see verse 7\\n\\t\\t\\t\\tbelow)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "7",
    "NoteID": "4037",
    "Body": "Verses 7-11 seem to refer to shooting stars, Cf. xv,\\n\\t\\t\\t\\t17-18, and notes 1951-53. The 'heavens typify not only\\n\\t\\t\\t\\tbeauty but power. The Good in Allah's world is guarded\\n\\t\\t\\t\\tand protected against every assault of Evil. The Evil is\\n\\t\\t\\t\\tnot part of the heavenly system: it is a thing in\\n\\t\\t\\t\\toutlawry, merely a self-willed rebellion,-\"cast away on\\n\\t\\t\\t\\tevery side, repulsed under a perpetual penalty\" (verses\\n\\t\\t\\t\\t8-9)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "8",
    "NoteID": "4038",
    "Body": "We can form a mental picture of the Court of the Most\\n\\t\\t\\t\\tHigh, in the highest heaven, conforming to the highest\\n\\t\\t\\t\\tidea we can form of goodness, beauty, purity, and\\n\\t\\t\\t\\tgrandeur. The Exalted Assembly of angels is given some\\n\\t\\t\\t\\tknowledge of the Plan and Will of Allah. Evil is\\n\\t\\t\\t\\taltogether foreign to such an atmosphere, but is actuated\\n\\t\\t\\t\\tby feelings of jealousy and curiosity. It tries to\\n\\t\\t\\t\\tapproach by stealth and overhear something from the\\n\\t\\t\\t\\taugust Assembly. It is repulsed and pursued by a flaming\\n\\t\\t\\t\\tfire, of which we can form some idea in our physical\\n\\t\\t\\t\\tworld by the piercing trail of a shooting star."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "10",
    "NoteID": "4039",
    "Body": "See last note and Cf. xv. 18 and notes 1953-54."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "11",
    "NoteID": "4040",
    "Body": "\"Their\": \"they\" are the doubters, the evil ones, the\\n\\t\\t\\t\\tdeniers of Allah's grace and mercy, who laugh at\\n\\t\\t\\t\\tRevelation and disbelieve in a Hereafter. Are they more\\n\\t\\t\\t\\timportant or more difficult to create than the wonderful\\n\\t\\t\\t\\tvariety of beings in Allah's spacious Creation? Do they\\n\\t\\t\\t\\tforget their own lowly state, as having been created from\\n\\t\\t\\t\\tmuddy clay?"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "11",
    "NoteID": "4041",
    "Body": "Cf. vi. 2; vii. 12; xxxii. 7; etc."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "12",
    "NoteID": "4042",
    "Body": "It is indeed strange that unregenerate man should forget,\\n\\t\\t\\t\\ton the one hand, his lowly-origin, and on the other hand,\\n\\t\\t\\t\\this high Destiny, as conferred upon him by the grace and\\n\\t\\t\\t\\tmercy of Allah. The indictment of him here comprises four\\n\\t\\t\\t\\tcounts: (1) they ridicule the teaching of Truth; (2)\\n\\t\\t\\t\\tinstead of profiting by admonition, they pay no heed; (3)\\n\\t\\t\\t\\twhen Allah's Signs are brought home to them, they\\n\\t\\t\\t\\tridicule them as much as they ridiculed the teaching of\\n\\t\\t\\t\\tTruth: and (4) when they have to acknowledge\\n\\t\\t\\t\\tincontestable facts, they give them false names like\\n\\t\\t\\t\\t\"sorcery\", which imply fraud or something which has no\\n\\t\\t\\t\\trelation to their life, although the facts touch the\\n\\t\\t\\t\\tinner springs of their life intimately."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "17",
    "NoteID": "4043",
    "Body": "Although the Hereafter, is the most solid facts in our\\n\\t\\t\\t\\tintelligent existence, materialists deny them. They\\n\\t\\t\\t\\tcannot believe that they could have any existence beyond\\n\\t\\t\\t\\tthe grave-still less their ancestors who died ages and\\n\\t\\t\\t\\tages ago: how could they ever come to life again?"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "18",
    "NoteID": "4044",
    "Body": "They are assured that the future life is a solid fact,\\n\\t\\t\\t\\tbut that it will be in very different conditions from\\n\\t\\t\\t\\tthose they know now. All their present arrogance will\\n\\t\\t\\t\\thave been humbled in the dust. There will be another\\n\\t\\t\\t\\tplane, in which souls will have experiences quite\\n\\t\\t\\t\\tdifferent from those in their probationary life here. In\\n\\t\\t\\t\\tthat life the virtues they lacked will count, and the\\n\\t\\t\\t\\tarrogance they hugged will be brought low."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "19",
    "NoteID": "4045",
    "Body": "Cf. xxxvi. 29, 49, and 53."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "21",
    "NoteID": "4047",
    "Body": "The Day of Judgment is the day of sorting out. Cf. xxxvi.\\n\\t\\t\\t\\t59. Good and evil will finally be separated, unlike the\\n\\t\\t\\t\\tapparently inexplicable conditions in the present\\n\\t\\t\\t\\tprobationary life, when they seem to be mixed together."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "22",
    "NoteID": "4048",
    "Body": "That is, if their wives were also wrong-doers. They are\\n\\t\\t\\t\\tseparately mentioned, because the Arabic phrase for\\n\\t\\t\\t\\t\"wrong-doers\" is of the masculine gender. All the\\n\\t\\t\\t\\tassociates in wrong-doing will be marshalled together.\\n\\t\\t\\t\\tThere will be personal responsibility: neither husband\\n\\t\\t\\t\\tnor wife can lay the blame on the other."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "24",
    "NoteID": "4049",
    "Body": "The scene here is after judgment. As, in an earthly\\n\\t\\t\\t\\ttribunal, the prisoner or his advocate is asked why\\n\\t\\t\\t\\tsentence should not be pronounced upon him, so here those\\n\\t\\t\\t\\twho are proved to have been guilty of wrong are allowed\\n\\t\\t\\t\\tto consider if anything or any one can help them. Then\\n\\t\\t\\t\\tcomes the exposure of the misleaders."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "25",
    "NoteID": "4050",
    "Body": "Obviously no one can stand and intercede, for it is a\\n\\t\\t\\t\\tquestion of personal responsibility for each soul. No one\\n\\t\\t\\t\\tcan help another."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "26",
    "NoteID": "4051",
    "Body": "All the previous arrogance of this life will be gone, but\\n\\t\\t\\t\\tthey will face each other, and those who were given a\\n\\t\\t\\t\\tfalse lead, as in the story of Pharaoh (Cf xx. 79), will\\n\\t\\t\\t\\tquestion their misleaders as in the following verses."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "28",
    "NoteID": "4052",
    "Body": "This is the mutual recrimination of the sinners-those who\\n\\t\\t\\t\\tsinned, against those whose instigation or evil example\\n\\t\\t\\t\\tled them into sin. The misleaders in the life here below\\n\\t\\t\\t\\toften used their power and influence to spread evil. The\\n\\t\\t\\t\\t\"right hand\" is the hand of power and authority. Instead\\n\\t\\t\\t\\tof using it for righteous purposes, they used it for\\n\\t\\t\\t\\tevil-selfishly for their own advantage, and mischievously\\n\\t\\t\\t\\tfor the degradation of others."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "29",
    "NoteID": "4053",
    "Body": "But the fact that others mislead, or that their evil\\n\\t\\t\\t\\texample is before us, does not justify us in falling from\\n\\t\\t\\t\\tright conduct. Faith should save us from the fall. But if\\n\\t\\t\\t\\twe have ourselves no Faith-in righteousness, or a future\\n\\t\\t\\t\\tlife, or the reality of Allah's Law, how can we blame\\n\\t\\t\\t\\tothers? The misleaders can well say, \"You will be judged\\n\\t\\t\\t\\taccording to your misdeeds!\" The responsibility is\\n\\t\\t\\t\\tpersonal, and cannot be shifted on to others. The others\\n\\t\\t\\t\\tmay get a double punishment,-for their own evil, and for\\n\\t\\t\\t\\tmisleading their weaker brethren. But the weaker brethren\\n\\t\\t\\t\\tcannot go free from responsibility for their own deeds;\\n\\t\\t\\t\\tfor evil means a personal rebellion against Allah, if we\\n\\t\\t\\t\\tbelieve in a personal God. Evil has no authority over us,\\n\\t\\t\\t\\texcept in so far as we deliberately choose it."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "31",
    "NoteID": "4054",
    "Body": "Allah's decree of justice requires that every soul should\\n\\t\\t\\t\\ttaste the consequences of its own sins, and that decree\\n\\t\\t\\t\\tmust be fulfilled. No excuses can serve. It is only\\n\\t\\t\\t\\tAllah's mercy that can save."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "32",
    "NoteID": "4055",
    "Body": "Further, the misleaders can well urge against those who\\n\\t\\t\\t\\treproach them for misleading them: \"How could you expect\\n\\t\\t\\t\\tanything better from us? You were already warned by\\n\\t\\t\\t\\tAllah's Message that we were astray.\""
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "19",
    "NoteID": "4056",
    "Body": "Selfish arrogance was the seed of sin and rebellion: ii.\\n\\t\\t\\t\\t34 (of Satan): xxviii. 39 (of Pharaoh); etc. It is that\\n\\t\\t\\t\\tkind of arrogance which prevents man from mending his\\n\\t\\t\\t\\tlife and conduct. When he speaks of ancestral ways, or\\n\\t\\t\\t\\tpublic opinion, or national honour, he is usually\\n\\t\\t\\t\\tthinking of himself or of a small clique which thrives on\\n\\t\\t\\t\\tinjustice. The recognition of Allah, the one true God, as\\n\\t\\t\\t\\tthe only standard of life and conduct, the Eternal\\n\\t\\t\\t\\tReality, cuts out Self, and is therefore disagreeable to\\n\\t\\t\\t\\tSin. If false gods are imagined, who themselves would\\n\\t\\t\\t\\thave weaknesses that fit in with sin, they give\\n\\t\\t\\t\\tcountenance to evils, and it becomes difficult to give\\n\\t\\t\\t\\tthem up, unless Allah's grace comes to our assistance."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "35",
    "NoteID": "4056",
    "Body": "Selfish arrogance was the seed of sin and rebellion: ii.\\n\\t\\t\\t\\t34 (of Satan): xxviii. 39 (of Pharaoh); etc. It is that\\n\\t\\t\\t\\tkind of arrogance which prevents man from mending his\\n\\t\\t\\t\\tlife and conduct. When he speaks of ancestral ways, or\\n\\t\\t\\t\\tpublic opinion, or national honour, he is usually\\n\\t\\t\\t\\tthinking of himself or of a small clique which thrives on\\n\\t\\t\\t\\tinjustice. The recognition of Allah, the one true God, as\\n\\t\\t\\t\\tthe only standard of life and conduct, the Eternal\\n\\t\\t\\t\\tReality, cuts out Self, and is therefore disagreeable to\\n\\t\\t\\t\\tSin. If false gods are imagined, who themselves would\\n\\t\\t\\t\\thave weaknesses that fit in with sin, they give\\n\\t\\t\\t\\tcountenance to evils, and it becomes difficult to give\\n\\t\\t\\t\\tthem up, unless Allah's grace comes to our assistance."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "36",
    "NoteID": "4057",
    "Body": "Possessed of an evil spirit, or mad. Such was the charge\\n\\t\\t\\t\\twhich the Unbelievers sometimes levelled at the holy\\n\\t\\t\\t\\tProphet in the early stages of his preaching."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "37",
    "NoteID": "4058",
    "Body": "The message of Islam, so far from being \"mad\" or in any\\n\\t\\t\\t\\tway peculiar, is eminently conformable to reason and the\\n\\t\\t\\t\\ttrue facts of nature as created by Allah. It is the Truth\\n\\t\\t\\t\\tin the purest sense of the term, and confirms the Message\\n\\t\\t\\t\\tof all true Messengers that ever lived."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "39",
    "NoteID": "4059",
    "Body": "Justice demands that those who sow evil should reap the\\n\\t\\t\\t\\tfruit, but the punishment is due to their own conduct and\\n\\t\\t\\t\\tnot to anything external to themselves."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "41",
    "NoteID": "4060",
    "Body": "\"Sustenance\": correlated with the Fruits mentioned below:\\n\\t\\t\\t\\tsee next verse."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "41",
    "NoteID": "4061",
    "Body": "\"Determined\": Ma'lum: the reward of the Blessed will not\\n\\t\\t\\t\\tbe a chance or a fleeting thing. It will follow a firm\\n\\t\\t\\t\\tDecree of Allah, on principles that can be known and\\n\\t\\t\\t\\tunderstood."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "42",
    "NoteID": "4062",
    "Body": "\"Fruits\": Cf. xxxvi. 57, and n. 4003. The Garden's\\n\\t\\t\\t\\tDelights are figured forth from parallel experiences in\\n\\t\\t\\t\\tour present life, and follow an ascending order: Food and\\n\\t\\t\\t\\tFruits; Gardens of Bliss, (with all their charm, design,\\n\\t\\t\\t\\tgreenery, birds' songs, fountains, etc.); the Home of\\n\\t\\t\\t\\tHappiness and Dignity, with congenial company seated on\\n\\t\\t\\t\\tThrones; Delicious Drinks from crystal Springs, for\\n\\t\\t\\t\\tsocial pleasure; and the society of Companions of the\\n\\t\\t\\t\\topposite sex, with beauty and charm but none of the\\n\\t\\t\\t\\tgrossness too often incidental to such companionship in\\n\\t\\t\\t\\tthis life."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "47",
    "NoteID": "4063",
    "Body": "The passing round of the social cup, as in the case of\\n\\t\\t\\t\\tother pleasures, is without any of the drawbacks and evil\\n\\t\\t\\t\\taccompaniments of the pleasures of this world, which are\\n\\t\\t\\t\\ttaken as types. In drink there is no intoxication: in\\n\\t\\t\\t\\tfruit there is no satiety. Cf. Dante: \"the bread of\\n\\t\\t\\t\\tAngels upon which One liveth here and grows not sated by\\n\\t\\t\\t\\tit.\" (Paradiso, Canto II., Longfellow's translation.)"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "48",
    "NoteID": "4064",
    "Body": "In the emblem used here, again, the pure type of chaste\\n\\t\\t\\t\\twomanhood is figured. They are chaste, not bold with\\n\\t\\t\\t\\ttheir glances: but their eyes are big with wonder and\\n\\t\\t\\t\\tbeauty, prefiguring grace, innocence, and a refined\\n\\t\\t\\t\\tcapacity of appreciation and admiration."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "49",
    "NoteID": "4065",
    "Body": "This is usually understood to refer to the delicate\\n\\t\\t\\t\\tcomplexion of a beautiful woman, which is compared to the\\n\\t\\t\\t\\ttransparent shell of eggs in the nest, closely guarded by\\n\\t\\t\\t\\tthe mother-bird; the shell is warm and free from stain.\\n\\t\\t\\t\\tIn Iv. 58 the phrase used is \"like rubies and coral\",\\n\\t\\t\\t\\treferring to the red or pink of a beautiful complexion."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "50",
    "NoteID": "4066",
    "Body": "Cf. above, xxxvii. 27, where the same phrase is used in\\n\\t\\t\\t\\tthe reverse conditions. In each case there is a going\\n\\t\\t\\t\\tback to the earlier memories or experiences of this life."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "51",
    "NoteID": "4067",
    "Body": "This companion was a sceptic, who laughed at Religion and\\n\\t\\t\\t\\ta Hereafter. How the tables are now turned! The devout\\n\\t\\t\\t\\tman backed up his Faith with a good life and is now in\\n\\t\\t\\t\\tBliss: the other was a cynic and made a mess of his life,\\n\\t\\t\\t\\tand is now burning in the Fire."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "55",
    "NoteID": "4068",
    "Body": "He is allowed a peep into the state which he so narrowly\\n\\t\\t\\t\\tescaped by the grace of Allah."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "57",
    "NoteID": "4069",
    "Body": "And he gratefully acknowledges his short-comings: \"I\\n\\t\\t\\t\\tshould have been a sinner just like this, but for the\\n\\t\\t\\t\\tgrace of Allah!\" He sees that if he had erred it would\\n\\t\\t\\t\\thave been no excuse to plead the other man's example. He\\n\\t\\t\\t\\thad Faith and was saved, to walk in the path of\\n\\t\\t\\t\\trighteousness."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "59",
    "NoteID": "4070",
    "Body": "After he realises the great danger from which he narrowly\\n\\t\\t\\t\\tescaped, his joy is so great that he can hardly believe\\n\\t\\t\\t\\tit! Is the danger altogether past now? Are the portals of\\n\\t\\t\\t\\tdeath closed for ever? Is he safe now from the\\n\\t\\t\\t\\ttemptations which will bring him to ruin and punishment?"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "60",
    "NoteID": "4071",
    "Body": "The answer is: Yes. \"Beyond the flight of Time. Beyond\\n\\t\\t\\t\\tthe realm of Death. There surely is some blessed clime,\\n\\t\\t\\t\\tWhere Life is not a breath!\" In the words of Longfellow\\n\\t\\t\\t\\tthis was an aspiration on this earth. In the Hereafter it\\n\\t\\t\\t\\tis a realisation! Some interpret verses 60-62 as a\\n\\t\\t\\t\\tcontinuation of the speech of the man in heaven. The\\n\\t\\t\\t\\tmeaning would in that case be the same."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "62",
    "NoteID": "4072",
    "Body": "Cf. xvii. 60, n. 2250. This bitter tree of Hell is in\\n\\t\\t\\t\\tcontrast with the beautiful Garden of heaven with its\\n\\t\\t\\t\\tdelicious fruits."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "63",
    "NoteID": "4073",
    "Body": "This dreadful bitter Tree of Hell is truly a trial to the\\n\\t\\t\\t\\twrong-doers. (1) It grows at the bottom of Hell; (2) even\\n\\t\\t\\t\\tits fruit-stalks, which should have been tender, are like\\n\\t\\t\\t\\tthe heads of devils: (3) its produce is eaten\\n\\t\\t\\t\\tvoraciously; (4) on top of it is a boiling mixture to cut\\n\\t\\t\\t\\tup their entrails (see next note); and (5) every time\\n\\t\\t\\t\\tthey complete this round of orgies they return to the\\n\\t\\t\\t\\tsame game. A truly lurid picture, but more lurid in\\n\\t\\t\\t\\treality are the stages of Evil. (1) It takes its rise in\\n\\t\\t\\t\\tthe lowest depths of corrupted human nature; (2) its\\n\\t\\t\\t\\ttenderest affections are degraded to envy and hate; (3)\\n\\t\\t\\t\\tthe appetite for Evil grows with what it feeds on; (4)\\n\\t\\t\\t\\tits \"cures\" serve but to aggravate the disease; and (5)\\n\\t\\t\\t\\tthe chain of evil is unending; one round is followed by\\n\\t\\t\\t\\tanother in interminable succession."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "66",
    "NoteID": "4074",
    "Body": "The parable of fruits and drinks in the contrasted\\n\\t\\t\\t\\tfortunes of the Good and the Evil is further elaborated\\n\\t\\t\\t\\tin xlvii. 15, where the boiling water given to the evil\\n\\t\\t\\t\\tones cuts up their entrails."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "68",
    "NoteID": "4075",
    "Body": "When they eat of the zaqqum in the lowest depths of hell,\\n\\t\\t\\t\\tthey are apparently brought up to drink of the mixture as\\n\\t\\t\\t\\ta further punishment, after which they go back to repeat\\n\\t\\t\\t\\tthe round."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "70",
    "NoteID": "4076",
    "Body": "A grim reproach. 'You found your fathers doing wrong; and\\n\\t\\t\\t\\tyou must rush headlong in their footsteps to perdition!'"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "72",
    "NoteID": "4077",
    "Body": "It is human to err. The error is forgiven if there is\\n\\t\\t\\t\\trepentance and amendment. The point is that Allah in His\\n\\t\\t\\t\\tmercy at all times in history sent messengers and\\n\\t\\t\\t\\tteachers to give His Message, and men deliberately\\n\\t\\t\\t\\trejected that Message."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "73",
    "NoteID": "4078",
    "Body": "It is on the reception or rejection of Allah's teachings\\n\\t\\t\\t\\tand guidance that judgment will come. In this world\\n\\t\\t\\t\\titself, see what is the teaching of history.\\n\\t\\t\\t\\tUnrighteousness and wrong-doing never prosper in the long\\n\\t\\t\\t\\trun."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "74",
    "NoteID": "4079",
    "Body": "But there is always a band of sincere and devoted men who\\n\\t\\t\\t\\tserve Allah, and the highest form of life is open to\\n\\t\\t\\t\\tthem. Note that this verse occurs at xxxvii. 40 above,\\n\\t\\t\\t\\twhere the argument of the difference between the fates of\\n\\t\\t\\t\\tthe righteous and the unrighteous was begun. Here it is\\n\\t\\t\\t\\trounded off with the same phrase, and now we proceed to\\n\\t\\t\\t\\ttake illustrations from the early Prophets."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "75",
    "NoteID": "4080",
    "Body": "Cf. xxi. 76-77. The story of Noah occurs in many places:\\n\\t\\t\\t\\there the point is that when men gird themselves against\\n\\t\\t\\t\\tevil, Allah protects them, and Evil cannot triumph\\n\\t\\t\\t\\tagainst Allah's Plan."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "76",
    "NoteID": "4081",
    "Body": "The Deluge, the Flood of Noah. The main story will be\\n\\t\\t\\t\\tfound in xi. 25-48."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "77",
    "NoteID": "4082",
    "Body": "Noah's posterity survived the Flood in the Ark, while the\\n\\t\\t\\t\\trest perished."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "78",
    "NoteID": "4083",
    "Body": "His name is remembered for ever, commencing a new era in\\n\\t\\t\\t\\treligious history. Note that the words in verses 78-81,\\n\\t\\t\\t\\twith slight modifications, form a sort of refrain to the\\n\\t\\t\\t\\tfollowing paragraphs about Abraham, Moses, and Elias, but\\n\\t\\t\\t\\tnot about Lot and Jonah. Lot was a nephew of Abraham, and\\n\\t\\t\\t\\tmay be supposed to belong to the story of Abraham.\\n\\t\\t\\t\\tJonah's career nearly ended in a tragedy for himself, and\\n\\t\\t\\t\\this people got a further lease of power \"for a time\"\\n\\t\\t\\t\\t(xxxvii. 148). And both Lot and Jonah belong to a limited\\n\\t\\t\\t\\tlocal tradition."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "79",
    "NoteID": "4084",
    "Body": "The story of the Flood is found in some form or other\\n\\t\\t\\t\\tamong all nations, and not only among those who follow\\n\\t\\t\\t\\tthe Mosaic tradition. In Greek tradition, the hero of the\\n\\t\\t\\t\\tFlood is Deukalion, with his wife Pyrrha: in Indian\\n\\t\\t\\t\\ttradition (Shatapatha Brahmana and Mahabharata) it is the\\n\\t\\t\\t\\tsage Manu and the Fish. The Chinese tradition of a great\\n\\t\\t\\t\\tFlood is recorded in Sha-King. Among American Indians the\\n\\t\\t\\t\\ttradition was common to many tribes."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "83",
    "NoteID": "4085",
    "Body": "The main story will be found in xxi. 51-73; but the\\n\\t\\t\\t\\tepisode about his readiness and that of his son to submit\\n\\t\\t\\t\\tto the most extreme form of self-sacrifice under trial\\n\\t\\t\\t\\t(in verses 102-107 below) is told here for the first\\n\\t\\t\\t\\ttime, as this Sura deals with the theme, \"Not my will,\\n\\t\\t\\t\\tbut Thine be done!\" In \"followed his way\", the pronoun\\n\\t\\t\\t\\t\"his\" refers to Noah, \"he\", of verse 81 above."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "84",
    "NoteID": "4086",
    "Body": "A sound heart: qalb salim: a heart that is pure, and\\n\\t\\t\\t\\tunaffected by the diseases that afflict others. As the\\n\\t\\t\\t\\theart in Arabic is taken to be not only the seat of\\n\\t\\t\\t\\tfeelings and affections, but also of intelligence and\\n\\t\\t\\t\\tresulting action, it implies the whole character. Cf.\\n\\t\\t\\t\\tAbraham's title of Hanif (the True): ii. 135 and n. 134.\\n\\t\\t\\t\\tCf. also xxvi. 89: \"only he will prosper who brings to\\n\\t\\t\\t\\tAllah a sound heart.\""
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "86",
    "NoteID": "4087",
    "Body": "False worship-worship of idols or stars or symbols, or\\n\\t\\t\\t\\tMammon or Self-is due either to false and degrading\\n\\t\\t\\t\\tconceptions of Allah, or to a sort of make-believe, where\\n\\t\\t\\t\\tpractice is inconsistent with knowledge or ignores the\\n\\t\\t\\t\\tinner promptings of Conscience. Abraham's challenge to\\n\\t\\t\\t\\this people is: 'Are you fools or hypocrites?'"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "87",
    "NoteID": "4088",
    "Body": "'Do you not realise that the real Creator is One-above\\n\\t\\t\\t\\tall the forms and superstitions that you associate with\\n\\t\\t\\t\\tHim?'"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "89",
    "NoteID": "4089",
    "Body": "The grief was really preying on his mind and soul, that\\n\\t\\t\\t\\the should be associated with such falsehoods. His father\\n\\t\\t\\t\\thimself was among the chief supporters of such\\n\\t\\t\\t\\tfalsehoods, and his people were given up wholly to them.\\n\\t\\t\\t\\tHe could not possibly share in their mummeries, and they\\n\\t\\t\\t\\tleft him in disgust. Then he made his practical protest\\n\\t\\t\\t\\tin the manner narrated in xxi. 56-64."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "93",
    "NoteID": "4090",
    "Body": "See the reference in the last note."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "93",
    "NoteID": "4091",
    "Body": "With the right hand: as the right hand is the hand of\\n\\t\\t\\t\\tpower, the phrase means that he struck them with might\\n\\t\\t\\t\\tand main and broke them."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "95",
    "NoteID": "4092",
    "Body": "His action was a challenge, and he drives home the\\n\\t\\t\\t\\tchallenge now with argument. 'Do you worship your own\\n\\t\\t\\t\\thandiwork? Surely worship is due to Him Who made you and\\n\\t\\t\\t\\tmade possible your handiwork!'"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "97",
    "NoteID": "4093",
    "Body": "The argument of Abraham was so sound that it could not be\\n\\t\\t\\t\\tmet by argument. In such cases Evil resorts to violence,\\n\\t\\t\\t\\tor secret plotting. Here there was both violence and\\n\\t\\t\\t\\tsecret plotting. The violence consisted in throwing him\\n\\t\\t\\t\\tinto a blazing Furnace. But by the mercy of Allah the\\n\\t\\t\\t\\tfire did not harm him (xxi. 69), and so they resorted to\\n\\t\\t\\t\\tplotting. But the plotting, as the next verse (xxxvii.\\n\\t\\t\\t\\t98) shows, was a boomerang that recoiled on their own\\n\\t\\t\\t\\theads."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "98",
    "NoteID": "4094",
    "Body": "Cf. xxi. 71. Their plot against the righteous Abraham\\n\\t\\t\\t\\tfailed. Abraham migrated from the country (Chaldea,\\n\\t\\t\\t\\tBabylon, and Assyria) and prospered in Syria and\\n\\t\\t\\t\\tPalestine. It was his persecutors that suffered\\n\\t\\t\\t\\thumiliation."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "99",
    "NoteID": "4095",
    "Body": "This was the Hijrat of Abraham. He left his people and\\n\\t\\t\\t\\this land, because the Truth was dearer to him than the\\n\\t\\t\\t\\tancestral falsehoods of his people. He trusted himself to\\n\\t\\t\\t\\tAllah, and under Allah's guidance he laid the foundations\\n\\t\\t\\t\\tof great peoples. See n. 2725 to xxi. 69."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "101",
    "NoteID": "4096",
    "Body": "This was in the fertile land of Syria and Palestine. The\\n\\t\\t\\t\\tboy thus born was, according to Muslim tradition, the\\n\\t\\t\\t\\tfirst-born son of Abraham, viz., Isma'il. The name itself\\n\\t\\t\\t\\tis from the root Samia, to hear, because Allah had heard\\n\\t\\t\\t\\tAbraham's prayer (verse 100). Abraham's age when Isma'il\\n\\t\\t\\t\\twas born was 86 (Gen xvi. 16)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "101",
    "NoteID": "4097",
    "Body": "The boy's character was to be Halim, \"forbearing\". This\\n\\t\\t\\t\\ttitle is also applied to Abraham (in ix. 114 and xi. 75).\\n\\t\\t\\t\\tIt refers to the patient way in which both father and son\\n\\t\\t\\t\\tcheerfully offered to suffer any self-sacrifice in order\\n\\t\\t\\t\\tto obey the Command of Allah. See next verse."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "102",
    "NoteID": "4098",
    "Body": "Where did this vision occur? The Muslim view is that it\\n\\t\\t\\t\\twas in or near Makkah. Some would identify it with the\\n\\t\\t\\t\\tvalley of Mina, six miles north of Makkah, where a\\n\\t\\t\\t\\tcommemoration sacrifice is annually celebrated as a rite\\n\\t\\t\\t\\tof the Hajj on the tenth of Zul-Hijjah, the 'Id of\\n\\t\\t\\t\\tSacrifice, in Memory of this Sacrifice of Abraham and\\n\\t\\t\\t\\tIsma'il (see' n.2l7 to ii. 197). Others say that the\\n\\t\\t\\t\\toriginal place of sacrifice was near the hill of Marwa\\n\\t\\t\\t\\t(the companion hill to Safa, ii. 158), which is\\n\\t\\t\\t\\tassociated with the infancy of Isma'il."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "102",
    "NoteID": "4099",
    "Body": "At what stage in Abraham's history did this occur? See n.\\n\\t\\t\\t\\t2725 to xxi. 69. It was obviously after his arrival in\\n\\t\\t\\t\\tthe land of Cannan and after Isma'il had grown up to\\n\\t\\t\\t\\tyears of discretion. Was it before or after the building\\n\\t\\t\\t\\tof the Ka'ba (ii. 127)? There are no data on which this\\n\\t\\t\\t\\tquestion can be answered. But we may suppose it was\\n\\t\\t\\t\\tbefore that event, and that event may itself have been\\n\\t\\t\\t\\tcommemorative."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "103",
    "NoteID": "4100",
    "Body": "Note that the sacrifice was demanded of both Abraham and\\n\\t\\t\\t\\tIsma'il. It was a trial of the will of the father and the\\n\\t\\t\\t\\tson. By way of trial the father had the command conveyed\\n\\t\\t\\t\\tto him in a vision. He consulted the son. The son readily\\n\\t\\t\\t\\tconsented, and offered to stand true to his promise if\\n\\t\\t\\t\\this self-sacrifice was really required. The whole thing\\n\\t\\t\\t\\tis symbolical. Allah does not require the flesh and blood\\n\\t\\t\\t\\tof animals (xxii. 37), much less of human beings. But he\\n\\t\\t\\t\\tdoes require the giving of our whole being to Allah, the\\n\\t\\t\\t\\tsymbol of which is that we should give up something very\\n\\t\\t\\t\\tdear to us, if Duty requires that sacrifice."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "103",
    "NoteID": "4101",
    "Body": "Our version may be compared with the Jewish-Christian\\n\\t\\t\\t\\tversion of the present Old Testament. The Jewish\\n\\t\\t\\t\\ttradition, in order to glorify the younger branch of the\\n\\t\\t\\t\\tfamily, descended from Isaac, ancestor of the Jews, as\\n\\t\\t\\t\\tagainst the elder branch, descended from Isma'il,\\n\\t\\t\\t\\tancestor of the Arabs, refers this sacrifice to Isaac\\n\\t\\t\\t\\t(Gen. xxii. 1-18). Now Isaac was born when Abraham was\\n\\t\\t\\t\\t100 years old (Gen. xxi. 5), while Isma'il was born to\\n\\t\\t\\t\\tAbraham when Abraham was 86 years old (Gen. xvi. 16).\\n\\t\\t\\t\\tIsma'il was therefore 14 years older than Isaac. During\\n\\t\\t\\t\\this first 14 years Isma'il was the only son of Abraham;\\n\\t\\t\\t\\tat no time was Isaac the only son of Abraham. Yet, in\\n\\t\\t\\t\\tspeaking of the sacrifice, the Old Testament says (Gen.\\n\\t\\t\\t\\txxii. 2): \"And He said, Take now thy son, thine only son\\n\\t\\t\\t\\tIssac, whom thou lovest, and get thee into the land of\\n\\t\\t\\t\\tMoriah: and offer him there for a burnt offering...\" This\\n\\t\\t\\t\\tslip shows at any rate which was the older version, and\\n\\t\\t\\t\\thow it was overlaid, like the present Jewish records, in\\n\\t\\t\\t\\tthe interests of a tribal religion. The \"land of Moriah\"\\n\\t\\t\\t\\tis not clear: it was three days' journey from Abraham's\\n\\t\\t\\t\\tplace (Gen. xxii. 4). There is less warrant for\\n\\t\\t\\t\\tidentifying it with the hill of Moriah on which Jerusalem\\n\\t\\t\\t\\twas afterwards built than with the hill of Marwa which is\\n\\t\\t\\t\\tidentified with the Arab tradition about Isma'il."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "104",
    "NoteID": "4102",
    "Body": "In the Biblical version Isaac's consent is not taken; in\\n\\t\\t\\t\\tfact Isaac asks, 'where is the lamb for sacrifice?' and\\n\\t\\t\\t\\tis told that 'God would provide it'. It is a complete\\n\\t\\t\\t\\thuman sacrifice like those to Moloch. In our version it\\n\\t\\t\\t\\tis as much a sacrifice by the will of Isma'il as by that\\n\\t\\t\\t\\tof Abraham."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "107",
    "NoteID": "4103",
    "Body": "The adjective qualifying \"sacrifice\" here, 'azim, (great,\\n\\t\\t\\t\\tmomentous) may be understood both in a literal and a\\n\\t\\t\\t\\tfigurative sense. In a literal sense it implies that a\\n\\t\\t\\t\\tfine sheep or ram was substituted. The figurative sense\\n\\t\\t\\t\\tis even more important. It was indeed a great and\\n\\t\\t\\t\\tmomentous occasion, when two men, with concerted will,\\n\\t\\t\\t\\t\"ranged themselves in the ranks\" of those to whom\\n\\t\\t\\t\\tself-sacrifice in the service of Allah was the supreme\\n\\t\\t\\t\\tthing in life."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "108",
    "NoteID": "4104",
    "Body": "Cf. above, xxxvii. 78-81 and n. 4083."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "112",
    "NoteID": "4105",
    "Body": "Isaac was Abraham's second son, born of Sarah, when\\n\\t\\t\\t\\tAbraham was 100 years of age. See n. 4101. He was also\\n\\t\\t\\t\\tblessed and became the ancestor of the Jewish people. See\\n\\t\\t\\t\\tnext note."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "113",
    "NoteID": "4106",
    "Body": "So long as the Children of Israel upheld the righteous\\n\\t\\t\\t\\tbanner of Allah, they enjoyed Allah's blessing, and their\\n\\t\\t\\t\\thistory is a portion of sacred history. When they fell\\n\\t\\t\\t\\tfrom grace, they did not stop Allah's Plan: they injured\\n\\t\\t\\t\\ttheir own souls."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "114",
    "NoteID": "4107",
    "Body": "The story of Moses is told in numerous passages of the\\n\\t\\t\\t\\tQur-an. The passages most illustrative of the present\\n\\t\\t\\t\\tpassage will be found in xxviii. 4 (oppression of the\\n\\t\\t\\t\\tIsraelites in Egypt) and xx. 77-79 (the Israelites\\n\\t\\t\\t\\ttriumphant over their enemies when the latter were\\n\\t\\t\\t\\tdrowned in the Red Sea)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "115",
    "NoteID": "4108",
    "Body": "What could have been a greater calamity to them than that\\n\\t\\t\\t\\tthey should have been held in slavery by the Egyptians,\\n\\t\\t\\t\\tthat their male children should have been killed and\\n\\t\\t\\t\\ttheir female children should have been saved alive for\\n\\t\\t\\t\\tthe Egyptians?"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "116",
    "NoteID": "4109",
    "Body": "The Israelites were delivered by three steps mentioned in\\n\\t\\t\\t\\tverses 114, 115, and 116 respectively; but the\\n\\t\\t\\t\\tconsummation of Allah's favour on them was (verses\\n\\t\\t\\t\\t117-118) the Revelation given to them, which guided them\\n\\t\\t\\t\\ton the Straight Way, so long as they preserved the\\n\\t\\t\\t\\tRevelation intact and followed its precepts. The three\\n\\t\\t\\t\\tsteps were: (1) the divine commission to Moses and Aaron:\\n\\t\\t\\t\\t(2) the deliverance from bondage; and (3) the triumphant\\n\\t\\t\\t\\tcrossing of the Red Sea and the destruction of Pharaoh's\\n\\t\\t\\t\\tarmy."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "117",
    "NoteID": "4110",
    "Body": "Mustabin has a slightly different force from Mubin. I\\n\\t\\t\\t\\thave translated the former by \"which helps to make things\\n\\t\\t\\t\\tclear\", and the latter by \"which makes things clear\",-apt\\n\\t\\t\\t\\tdescriptions as applied to the Taurat and the Qur-an."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "119",
    "NoteID": "4111",
    "Body": "See above, xxxvii. 78-81 and n. 4083."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "123",
    "NoteID": "4112",
    "Body": "See n. 905 to vi. 85. Elias is the same as Elijah, whose\\n\\t\\t\\t\\tstory will be found in the Old Testament in I Kings\\n\\t\\t\\t\\txvii-xix. and 2 Kings i-ii. Elijah lived in the reign of\\n\\t\\t\\t\\tAhab (B.C. 896-874) and Ahaziah (B.C. 874-872), kings of\\n\\t\\t\\t\\tthe (northern) kingdom of Israel or Samaria. He was a\\n\\t\\t\\t\\tprophet of the desert, like John the Baptist,-unlike our\\n\\t\\t\\t\\tholy Prophet, who took part in, controlled, and guided\\n\\t\\t\\t\\tall the affairs of his people. Both Ahab and Azariah were\\n\\t\\t\\t\\tprone to lapse into the worship of Baal, the sun-god\\n\\t\\t\\t\\tworshipped in Syria. That worship also included the\\n\\t\\t\\t\\tworship of nature-powers and procreative powers, as in\\n\\t\\t\\t\\tthe Hindu worship of the Lingam, and led to many abuses.\\n\\t\\t\\t\\tKing Ahab had married a princess of Sidon, Jezebel, a\\n\\t\\t\\t\\twicked woman who led her husband to forsake Allah and\\n\\t\\t\\t\\tadopt Baal-worship. Elijah denounced all Ahab's sins as\\n\\t\\t\\t\\twell as the sins of Ahaziah and had to flee for his life.\\n\\t\\t\\t\\tEventually, according to the Old Testament (2 Kings,\\n\\t\\t\\t\\tii-11) he was taken up in a whirlwind to heaven in a\\n\\t\\t\\t\\tchariot of fire after he had left his mantle with Elisha\\n\\t\\t\\t\\tthe prophet."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "125",
    "NoteID": "4113",
    "Body": "For Baal-worship see last note."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "127",
    "NoteID": "4114",
    "Body": "They persecuted him and he had to flee for his life.\\n\\t\\t\\t\\tEventually he disappeared mysteriously; see n. 4112."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "129",
    "NoteID": "4115",
    "Body": "See above, xxxvii. 78-81, and n. 4083. A) Ilyasin may be\\n\\t\\t\\t\\tan alternative form of Ilyas: Cf. Sainaa (xxiii. 20) and\\n\\t\\t\\t\\tSinin (xcv. 2). Or it may be the plural of Ilyas, meaning\\n\\t\\t\\t\\t\"such people as Ilyas\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "133",
    "NoteID": "4116",
    "Body": "The best illustration of this passage about Lut will be\\n\\t\\t\\t\\tfound in vii. 80-84. He was a prophet sent to Sodom and\\n\\t\\t\\t\\tGomorrah, Cities of the Plain, by the Dead Sea. The\\n\\t\\t\\t\\tinhabitants were given over to abominable crimes, against\\n\\t\\t\\t\\twhich he preached. They insulted him and threatened to\\n\\t\\t\\t\\texpel him. But Allah in His mercy saved him and his\\n\\t\\t\\t\\tfamily (with one exception, see the following note), and\\n\\t\\t\\t\\tthen destroyed the Cities."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "135",
    "NoteID": "4117",
    "Body": "Cf. vii. 83, and n. 1051. Lot's wife had no faith: she\\n\\t\\t\\t\\tlagged behind, and perished in the general ruin."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "137",
    "NoteID": "4118",
    "Body": "Cf. xv. 76, and n. 1998. The tract where they lay is\\n\\t\\t\\t\\tsituated on the highway to Syria where the Arab caravans\\n\\t\\t\\t\\ttravelled regularly, \"by day and by night\". Could not\\n\\t\\t\\t\\tfuture generations learn wisdom from the destruction of\\n\\t\\t\\t\\tthose who did wrong?"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "139",
    "NoteID": "4119",
    "Body": "For illustrative passages, see xxi. 87-88, n. 2744, and\\n\\t\\t\\t\\tlxviii. 48-50. Jonah's mission was to the city of\\n\\t\\t\\t\\tNineveh, then steeped in wickedness. He was rejected and\\n\\t\\t\\t\\the denounced Allah's wrath on them, but they repented and\\n\\t\\t\\t\\tobtained Allah's forgiveness. But Jonah \"departed in\\n\\t\\t\\t\\twrath\" (xxi. 87), forgetting that Allah has Mercy as well\\n\\t\\t\\t\\tas forgiveness. See the notes following. Cf. X. 98, n.\\n\\t\\t\\t\\t1478."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "140",
    "NoteID": "4120",
    "Body": "Jonah ran away from Nineveh like a slave from captivity.\\n\\t\\t\\t\\tHe should have stuck to his post. He was hasty, and went\\n\\t\\t\\t\\toff to take a ship. As if he could escape from Allah's\\n\\t\\t\\t\\tPlan!"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "141",
    "NoteID": "4121",
    "Body": "The ship was fully laden and met foul weather. The\\n\\t\\t\\t\\tsailors, according to their superstition, wanted to find\\n\\t\\t\\t\\tout who was responsible for the ill-luck: a fugitive\\n\\t\\t\\t\\tslave would cause such ill-luck. The lot fell on Jonah,\\n\\t\\t\\t\\tand he was cast off ."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "142",
    "NoteID": "4122",
    "Body": "The rivers of Mesopotamia have some huge fishes. The word\\n\\t\\t\\t\\tused here is Hat, which may be a fish or perhaps a\\n\\t\\t\\t\\tcrocodile. If it were in an open northern sea, it might\\n\\t\\t\\t\\tbe a whale. The locality is not mentioned: in the Old\\n\\t\\t\\t\\tTestament he is said to have taken ship in the port of\\n\\t\\t\\t\\tJoppa (now Jaffa) in the Mediterranean (Jonah, i. 3),\\n\\t\\t\\t\\twhich would be not less than 600 miles from Nineveh. The\\n\\t\\t\\t\\tTigris river, mentioned by some of our Commentators, is\\n\\t\\t\\t\\tmore likely, and it contains some fishes of extraordinary\\n\\t\\t\\t\\tsize."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "142",
    "NoteID": "4123",
    "Body": "See n. 4120."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "143",
    "NoteID": "4124",
    "Body": "\"But he cried through the depths of darkness, 'There is\\n\\t\\t\\t\\tno god but Thee: glory to Thee! I was indeed wrong!' \"\\n\\t\\t\\t\\t(xxi. 87)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "144",
    "NoteID": "4125",
    "Body": "This is just the idiom. This was to be the burial and the\\n\\t\\t\\t\\tgrave of Jonah. If he had not repented, he could not have\\n\\t\\t\\t\\tgot out of the body of the creature that had swallowed\\n\\t\\t\\t\\thim, until the Day of Resurrection, when all the dead\\n\\t\\t\\t\\twould be raised up."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "145",
    "NoteID": "4126",
    "Body": "Cf. xxxvii. 89 above. His strange situation might well\\n\\t\\t\\t\\thave caused him to be ill. He wanted fresh air and\\n\\t\\t\\t\\tsolitude. He got both in the open plain, and the\\n\\t\\t\\t\\tabundantly shady Gourd Plant or some fruitful tree like\\n\\t\\t\\t\\tit gave him both shade and sustenance. The Gourd is a\\n\\t\\t\\t\\tcreeper that can spread over any roof or ruined\\n\\t\\t\\t\\tstructure."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "147",
    "NoteID": "4127",
    "Body": "The city of Nineveh was a very large city. Tbe Old\\n\\t\\t\\t\\tTestament says: \"Nineveh was an exceeding great city of\\n\\t\\t\\t\\tthree days' journey\" (Jonah, iii. 3); \"wherein are more\\n\\t\\t\\t\\tthan six score thousand persons\" (Jonah, iv. 11). In\\n\\t\\t\\t\\tother words its circuit was about 45 miles, and its\\n\\t\\t\\t\\tpopulation was over a hundred and twenty thousand\\n\\t\\t\\t\\tinhabitants."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "148",
    "NoteID": "4128",
    "Body": "They repented and believed, and Nineveh got a new lease\\n\\t\\t\\t\\tof life. For the dates to which Jonah may be referred,\\n\\t\\t\\t\\tand the vicissitudes of the City's history as the seat of\\n\\t\\t\\t\\tthe Assyrian Empire, see notes 1478-79 to x. 98. The\\n\\t\\t\\t\\tlessons from Jonah's story are: (1) that no man should\\n\\t\\t\\t\\ttake upon himself to judge of Allah's wrath or Allah's\\n\\t\\t\\t\\tmercy; (2) that nevertheless Allah forgives true\\n\\t\\t\\t\\trepentance, whether in a righteous man, or in a wicked\\n\\t\\t\\t\\tcity; and (3) that Allah's Plan will always prevail, and\\n\\t\\t\\t\\tcan never be defeated."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "149",
    "NoteID": "4129",
    "Body": "We begin a new argument here. The Pagan Arabs called\\n\\t\\t\\t\\tangels daughters of Allah. They themselves were ashamed\\n\\t\\t\\t\\tof having daughters, and preferred to have sons, to add\\n\\t\\t\\t\\tto their power and dignity. See xvi. 57-59, and n. 2082.\\n\\t\\t\\t\\tYet they invented daughters for Allah!"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "152",
    "NoteID": "4130",
    "Body": "Any attribution to Allah of ideas derogatory to His\\n\\t\\t\\t\\tOneness and His supreme height above all creatures is\\n\\t\\t\\t\\tlikely to degrade our own conception of Allah's Universal\\n\\t\\t\\t\\tplan, and is condemned in the strongest terms."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "153",
    "NoteID": "4131",
    "Body": "There is the strongest irony in this passage."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "158",
    "NoteID": "4132",
    "Body": "The angels are at least pure beings engaged in the\\n\\t\\t\\t\\tservice of Allah. But the Pagan superstitions not only\\n\\t\\t\\t\\tconnect them with Allah as daughters but even connect\\n\\t\\t\\t\\tAllah by relationship with all kinds of spirits, good or\\n\\t\\t\\t\\tevil! In some mythologies the most evil powers are gods\\n\\t\\t\\t\\tor goddesses as if they belonged to the family of Allah\\n\\t\\t\\t\\tthe Creator and had some semblance of equality with Him!\\n\\t\\t\\t\\tThis, too, is repudiated in the strongest terms. For\\n\\t\\t\\t\\tJinns see n. 929 to vi. 100."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "160",
    "NoteID": "4133",
    "Body": "Those sincere in devotion to Allah never ascribe such\\n\\t\\t\\t\\tdegrading ideas to Allah."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "162",
    "NoteID": "4134",
    "Body": "Evil has no power over faith, truth, and sincerity. Such\\n\\t\\t\\t\\tpower as it has is over those who deliberately put\\n\\t\\t\\t\\tthemselves in the way of Destruction. It is their own\\n\\t\\t\\t\\twill that leads them astray. If they were fortified\\n\\t\\t\\t\\tagainst Evil by Faith, Patience, and Constancy, Evil\\n\\t\\t\\t\\twould have no power to hurt them. Allah would protect\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "164",
    "NoteID": "4135",
    "Body": "To round off the argument of the Sura we go back to the\\n\\t\\t\\t\\tidea with which it began. Those who range themselves in\\n\\t\\t\\t\\tranks for the united service of Allah (see above, xxxvii.\\n\\t\\t\\t\\tI and n. 4031)-whether angels or men of God-are content\\n\\t\\t\\t\\tto keep their ranks and do whatever service is assigned\\n\\t\\t\\t\\tto them. It is not for them to question Allah's Plan,\\n\\t\\t\\t\\tbecause they know that it is good and that it will\\n\\t\\t\\t\\tultimately triumph. Any seeming delays or defeats do not\\n\\t\\t\\t\\tworry them. Nor do they ever break their ranks."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "167",
    "NoteID": "4136",
    "Body": "There were the sceptics or Unbelievers,-primarily the\\n\\t\\t\\t\\tPagan Arabs, but in a more extended sense, all who doubt\\n\\t\\t\\t\\tAllah's providence or revelation."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "169",
    "NoteID": "4137",
    "Body": "Such men take refuge in ancestral tradition. 'If our\\n\\t\\t\\t\\tforefathers had had an inkling of Revelation or miracles,\\n\\t\\t\\t\\tor had worshipped as we are now taught to worship, we\\n\\t\\t\\t\\tshould gladly have accepted. Or if they had had anything\\n\\t\\t\\t\\tof the miracles which other nations of old are said to\\n\\t\\t\\t\\thave received, we could then have accepted.' But now\\n\\t\\t\\t\\tstronger and more convincing proofs have come to them in\\n\\t\\t\\t\\tthe Qur-an in their own tongue, and they doubt and reject\\n\\t\\t\\t\\tit."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "170",
    "NoteID": "4138",
    "Body": "Allah's Truth will manifest itself against all odds, and\\n\\t\\t\\t\\tthe whole world will see."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "173",
    "NoteID": "4139",
    "Body": "The victory will be the victory of Allah's Truth by the\\n\\t\\t\\t\\tforces of Allah, but every soldier in the army of Truth,\\n\\t\\t\\t\\twho has done his duty, will be entitied to claim a share\\n\\t\\t\\t\\tin the victory."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "174",
    "NoteID": "4140",
    "Body": "Addressed in the first instance to the holy Prophet, but\\n\\t\\t\\t\\tgood for all time. He was not to be discouraged by his\\n\\t\\t\\t\\tinitial failures. Soon came victory to him from Allah. So\\n\\t\\t\\t\\tis it always in the struggles of truth and righteousness.\\n\\t\\t\\t\\tThe righteous can afford to ignore opposition, confident\\n\\t\\t\\t\\tin the strength which comes from the Grace of Allah."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "175",
    "NoteID": "4141",
    "Body": "Watch and wait, for the Right must come to its own."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "176",
    "NoteID": "4142",
    "Body": "The last verse enjoined Patience under the attacks of\\n\\t\\t\\t\\tEvil, in the knowledge that evil must be conquered at\\n\\t\\t\\t\\tlast. Evil may perhaps turn back scoffingly and say, 'If\\n\\t\\t\\t\\ta punishment is to come, why not bring it on now?' Why\\n\\t\\t\\t\\tindeed? The answer is: when it comes, it will come like a\\n\\t\\t\\t\\trush by night when the enemy is overpowered, when he\\n\\t\\t\\t\\tleast expects it: when the day dawns, it is a sorry\\n\\t\\t\\t\\tplight in which the enemy finds himself. Cf. xxii. 47,\\n\\t\\t\\t\\tand n. 2826; and xxvi. 204, n. 3230."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "177",
    "NoteID": "4143",
    "Body": "See last note. The parable is that of an enemy camp in a\\n\\t\\t\\t\\tplain, which is surprised and destroyed by a night attack\\n\\t\\t\\t\\tfrom the hills. Evil is the plight of any survivors in\\n\\t\\t\\t\\tthe morning. Their regrets will be all the more poignant\\n\\t\\t\\t\\tif they had had some sort of a warning before hand and\\n\\t\\t\\t\\thad paid no heed to it!"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "178",
    "NoteID": "4144",
    "Body": "This and the following verse repeat verses 174-75 (with a\\n\\t\\t\\t\\tslight verbal alteration). The argument in verses 176-77\\n\\t\\t\\t\\tbrought in a new point. When that is finished, the\\n\\t\\t\\t\\trepetition carries us back to the main argument, and\\n\\t\\t\\t\\trounds off the whole Sura."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "180",
    "NoteID": "4145",
    "Body": "This and the following two verses recapitulate: (1)\\n\\t\\t\\t\\tGlory, Honour, and Power belong to Allah; (2) No one is\\n\\t\\t\\t\\tequal to Him; (3) He sends messengers and revelations,\\n\\t\\t\\t\\tand His aid will overcome all obstacles; for (4) He loves\\n\\t\\t\\t\\tand cherishes all His Creation."
  }
]
