[
  {
    "SurahNumber": "34",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "This definition comprises things physical and spiritual:\\n\\t\\t\\t\\twaters disappearing underground and reappearing; the\\n\\t\\t\\t\\tmetamorphosis of seed into plant, and of decaying plant\\n\\t\\t\\t\\tinto oil and coal; traces of old artifacts and entire\\n\\t\\t\\t\\tcivilizations buried in the earth and then reappearing\\n\\t\\t\\t\\twithin the sight and consciousness of later generations\\n\\t\\t\\t\\tof men; the transformation of dead bodies of animals and\\n\\t\\t\\t\\tmen into elements of nourishment for new life; the ascent\\n\\t\\t\\t\\tof earthy vapours towards the skies, and their descent as\\n\\t\\t\\t\\train, snow or hail; the ascent towards the heavens of\\n\\t\\t\\t\\tmen's longings, hopes and ambitions, and the descent of\\n\\t\\t\\t\\tdivine inspiration into the minds of men, and thus a\\n\\t\\t\\t\\trevival of faith and thought and, with it, the growth of\\n\\t\\t\\t\\tnew artifacts, new skills and new hopes: in short, the\\n\\t\\t\\t\\tendless recurrence of birth, death and re-birth which\\n\\t\\t\\t\\tcharacterizes all of God's creation."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "This assertion of the godless has a twofold meaning: (1)\\n\\t\\t\\t\\t\"The universe is without beginning and without end; it\\n\\t\\t\\t\\tcan only change, but can never cease to exist\" - which\\n\\t\\t\\t\\tamounts to a denial of the fact that God alone is\\n\\t\\t\\t\\teternal; and (2) \"There is no resurrection and divine\\n\\t\\t\\t\\tjudgment as symbolized by the Last Hour\" - which amounts\\n\\t\\t\\t\\tto a denial of life after death and, hence, of all\\n\\t\\t\\t\\tsignificance and purpose attaching to human life as such."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "See note [5] on  8:4 ."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "The particle min (lit., \"out of\") which precedes the noun\\n\\t\\t\\t\\trijz (\"vileness\" or \"vile conduct\") indicates that the\\n\\t\\t\\t\\tsuffering which awaits such sinners in the life to come\\n\\t\\t\\t\\tis an organic consequence of their deliberately evil\\n\\t\\t\\t\\tconduct in this world."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "8",
    "NoteID": "5",
    "Body": "Lit., \"remote aberration\". (For the Qur'anic use of the\\n\\t\\t\\t\\tterm dalal - lit., \"error\" or \"going astray\" - in the\\n\\t\\t\\t\\tsense of \"aberration\", see  12:8  and {95}.) The\\n\\t\\t\\t\\tconstruction of this phrase points definitely to\\n\\t\\t\\t\\tsuffering in this world (in contrast with the suffering\\n\\t\\t\\t\\tin the hereafter spoken of in verse {5} above): for\\n\\t\\t\\t\\twhereas the concept of \"aberration\" is meaningless in the\\n\\t\\t\\t\\tcontext of the life to come, it has an obvious meaning in\\n\\t\\t\\t\\tthe context of the moral and social confusion - and,\\n\\t\\t\\t\\thence, of the individual and social suffering - which is\\n\\t\\t\\t\\tthe unavoidable consequence of people's loss of belief in\\n\\t\\t\\t\\tthe existence of absolute moral values and, thus, in an\\n\\t\\t\\t\\tultimate divine judgment on the basis of those values."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "9",
    "NoteID": "6",
    "Body": "Lit., \"... not aware of what of the sky and the earth is\\n\\t\\t\\t\\tbetween their hands, and what is behind them\": an\\n\\t\\t\\t\\tidiomatic phrase explained in surah {2}, note [247]. In\\n\\t\\t\\t\\tthe present context - as well as in  2:255  - the above\\n\\t\\t\\t\\tphrase stresses the insignificance of the knowledge\\n\\t\\t\\t\\tattained to by man, or accessible to him; hence, so the\\n\\t\\t\\t\\targument goes, how can anyone be so presumptuous as to\\n\\t\\t\\t\\tdeny the reality of resurrection and life after death,\\n\\t\\t\\t\\tseeing that it is a phenomenon beyond man's experience,\\n\\t\\t\\t\\twhile, on the other hand, everything within the universe\\n\\t\\t\\t\\tpoints to God's unlimited creative power?"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "I.e.. in an earthquake."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "This allusion to unpredictable geological and cosmic\\n\\t\\t\\t\\toccurrences - earthquakes, the fall of meteors and\\n\\t\\t\\t\\tmeteorites, cosmic rays, and so forth - reinforces the\\n\\t\\t\\t\\tstatement about \"how little of the sky and the earth lies\\n\\t\\t\\t\\topen before them, and how much is hidden from them\", and\\n\\t\\t\\t\\tcontrasts man's insignificance with God's omniscience and\\n\\t\\t\\t\\talmightiness."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "9",
    "NoteID": "9",
    "Body": "See last sentence of  24:31  and the corresponding note\\n\\t\\t\\t\\t[41]."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "10",
    "NoteID": "10",
    "Body": "Lit., \"did We bestow upon David a favour from Ourselves\".\\n\\t\\t\\t\\tThis connects with the elliptic reference to repentance\\n\\t\\t\\t\\tin the preceding verse: David is singled out for special\\n\\t\\t\\t\\tmention in view of the allusion, in surah {38}, to his\\n\\t\\t\\t\\thaving suddenly become aware that he had committed a sin,\\n\\t\\t\\t\\twhereupon \"he asked his Sustainer to forgive him his\\n\\t\\t\\t\\tsin... and turned unto Him in repentance\" ( 38:24 )."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "10",
    "NoteID": "11",
    "Body": "Cf.  21:79  and the corresponding note [73]."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "10",
    "NoteID": "12",
    "Body": "Lit., \"for him\". The term hadid denotes, primarily,\\n\\t\\t\\t\\tsomething that is \"sharp\" in both the concrete and\\n\\t\\t\\t\\tabstract senses of the word: for the latter sense, cf.\\n\\t\\t\\t\\tthe Qur'anic phrase \"sharp (hadid) is thy sight today\"\\n\\t\\t\\t\\t( 50:22 ), or the many idiomatic expressions like rajul\\n\\t\\t\\t\\thadid, \"a man of sharp intellect\", hadid an-nazar, \"one\\n\\t\\t\\t\\twho looks boldly [at others]\", ra' ihah hadidah, \"a sharp\\n\\t\\t\\t\\todour\", etc. (Lisan al-'Arab). As a noun with a definite\\n\\t\\t\\t\\tarticle (al-hadid), it signifies \"all that is sharp\", or\\n\\t\\t\\t\\t\"sharpness\", as well as \"iron\". God's having \"softened\\n\\t\\t\\t\\tall sharpness\" in David is evidently an allusion to his\\n\\t\\t\\t\\texalted sense of beauty (expressed in the poetry of his\\n\\t\\t\\t\\tPsalms) as well as to his goodness and humility. - An\\n\\t\\t\\t\\talternative rendering of the above phrase would be: \"We\\n\\t\\t\\t\\tcaused iron to become soft for him\", which might be an\\n\\t\\t\\t\\tallusion to his outstanding abilities as poet, warrior\\n\\t\\t\\t\\tand ruler."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "11",
    "NoteID": "13",
    "Body": "The adjective sabigh (fem. sabighah) signifies anything\\n\\t\\t\\t\\tthat is \"ample\", \"abundant\" and \"complete\" (in the sense\\n\\t\\t\\t\\tof being perfect). In its plural form sabighat it assumes\\n\\t\\t\\t\\tthe function of the noun which it is meant to qualify,\\n\\t\\t\\t\\tand denotes, literally, \"things [or \"deeds\"] ample and\\n\\t\\t\\t\\tcomplete\" or \"perfect\" - i.e., good deeds done abundantly\\n\\t\\t\\t\\tand without stint: cf. the only other Qur'anic instance\\n\\t\\t\\t\\tof the same stem in  31:20  - \"[God] has lavished\\n\\t\\t\\t\\t(asbagha) upon you His blessings\". The noun sard, on the\\n\\t\\t\\t\\tother hand, denotes something \"carried on consecutively\",\\n\\t\\t\\t\\tor something the parts (or stages) whereof are \"following\\n\\t\\t\\t\\tone another steadily\", i.e., are continued or repeated."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "12",
    "NoteID": "14",
    "Body": "Cf.  21:81  and the corresponding note [75]. For a more\\n\\t\\t\\t\\tgeneral explanation of the legends connected with the\\n\\t\\t\\t\\tperson of Solomon, see note [77] on  21:82 ."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "12",
    "NoteID": "15",
    "Body": "Lit., \"for him\": probably a reference to the many\\n\\t\\t\\t\\tfurnishings of copper and brass which, according to the\\n\\t\\t\\t\\tBible (cf. 11 Chronicles iv), Solomon caused to be made\\n\\t\\t\\t\\tfor his newly-built temple."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "12",
    "NoteID": "16",
    "Body": "Lit., \"between his hands\", i.e., subject to his will: see\\n\\t\\t\\t\\t 21:82  and the corresponding notes [76] and [77]. For my\\n\\t\\t\\t\\trendering of jinn as \"invisible beings\", see Appendix\\n\\t\\t\\t\\tIII."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "13",
    "NoteID": "17",
    "Body": "I.e., because of their enormous size. Cf. II Chronicles\\n\\t\\t\\t\\tiii, 10-13, where statues (\"images\") of cherubim are\\n\\t\\t\\t\\tmentioned, as well as iv, 2-5, describing \"a molten sea\"\\n\\t\\t\\t\\t(i.e., basin) of huge dimensions, resting upon twelve\\n\\t\\t\\t\\tstatues of oxen, and meant to contain water \"for the\\n\\t\\t\\t\\tpriests to wash in\" (ibid., iv, 6). The \"sanctuaries\"\\n\\t\\t\\t\\twere apparently the various halls of the new temple."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "13",
    "NoteID": "18",
    "Body": "These words, ostensibly addressed to \"the people\" or \"the\\n\\t\\t\\t\\tfamily\" of David, are in reality an admonition to all\\n\\t\\t\\t\\tbelievers, at all times, since all of them are,\\n\\t\\t\\t\\tspiritually, \"David's people\"."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "13",
    "NoteID": "19",
    "Body": "I.e., even among those who consider themselves God's\\n\\t\\t\\t\\tservants - for \"truly grateful [to God] is only he who\\n\\t\\t\\t\\trealizes his inability to render adequate thanks to Him\"\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "14",
    "NoteID": "20",
    "Body": "This is yet another of the many Solomonic legends which\\n\\t\\t\\t\\thad become an inalienable part of ancient Arabian\\n\\t\\t\\t\\ttradition, and which the Qur'an uses as a vehicle for the\\n\\t\\t\\t\\tallegorical illustration of some of its teachings.\\n\\t\\t\\t\\tAccording to the legend alluded to above, Solomon died on\\n\\t\\t\\t\\this throne, leaning forward on his staff, and for a\\n\\t\\t\\t\\tlength of time nobody became aware of his death: with the\\n\\t\\t\\t\\tresult that the jinn, who had been constrained to work\\n\\t\\t\\t\\tfor him, went on labouring at the heavy tasks assigned to\\n\\t\\t\\t\\tthem. Gradually, however, a termite ate away Solomon's\\n\\t\\t\\t\\tstaff, and his body, deprived of support, fell to the\\n\\t\\t\\t\\tground. This story - only hinted at in its outline - is\\n\\t\\t\\t\\tapparently used here as an allegory of the insignificance\\n\\t\\t\\t\\tand inherent brittleness of human life and of the\\n\\t\\t\\t\\tperishable nature and emptiness of all worldly might and\\n\\t\\t\\t\\tglory."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "14",
    "NoteID": "21",
    "Body": "Al-ghayb, \"that which is beyond the reach of [a created\\n\\t\\t\\t\\tbeing's] perception\", either in an absolute or - as in\\n\\t\\t\\t\\tthis instance - in a relative, temporary sense."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "14",
    "NoteID": "22",
    "Body": "I.e., because they would have known that Solomon's sway\\n\\t\\t\\t\\tover them had ended. In the elliptic manner so\\n\\t\\t\\t\\tcharacteristic of the Qur'an, stress is laid here,\\n\\t\\t\\t\\tfirstly, on the limited nature of all empirical\\n\\t\\t\\t\\tknowledge, including the result of deductions and\\n\\t\\t\\t\\tinferences based on no more than observable or calculable\\n\\t\\t\\t\\tphenomena, and, secondly, on the impossibility to\\n\\t\\t\\t\\tdetermine correctly, on the basis of such limited\\n\\t\\t\\t\\tfragments of knowledge alone, what course of action would\\n\\t\\t\\t\\tbe right in a given situation. Although the story as such\\n\\t\\t\\t\\trelates to \"invisible beings\", its moral lesson (which\\n\\t\\t\\t\\tmay be summed up in the statement that empirical\\n\\t\\t\\t\\tknowledge cannot provide any ethical guideline unless it\\n\\t\\t\\t\\tis accompanied, and completed, by divine guidance) is\\n\\t\\t\\t\\tobviously addressed to human beings as well."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "15",
    "NoteID": "23",
    "Body": "This connects with the call to gratitude towards God in\\n\\t\\t\\t\\tthe preceding passage, and the mention, at the end of\\n\\t\\t\\t\\tverse {13}, that \"few are the truly grateful\" even among\\n\\t\\t\\t\\tthose who think of themselves as \"God's servants\" (see\\n\\t\\t\\t\\tnote [19] above). - The kingdom of Sheba (Saba' in\\n\\t\\t\\t\\tArabic) was situated in south-western Arabia, and at the\\n\\t\\t\\t\\ttime of its greatest prosperity (i.e., in the first\\n\\t\\t\\t\\tmillenium B.C.) comprised not only the Yemen but also a\\n\\t\\t\\t\\tlarge part of Hadramawt and the Mahrah country, and\\n\\t\\t\\t\\tprobably also much of present-day Abyssinia. In the\\n\\t\\t\\t\\tvicinity of its capital Ma'rib - sometimes also spelled\\n\\t\\t\\t\\tMa'rib - the Sabaeans had built in the course of\\n\\t\\t\\t\\tcenturies an extraordinary system of dams, dykes and\\n\\t\\t\\t\\tsluices, which became famous in history, with astonishing\\n\\t\\t\\t\\tremnants extant to this day. It was to this great dam\\n\\t\\t\\t\\tthat the whole country of Sheba owed its outstanding\\n\\t\\t\\t\\tprosperity, which became proverbial throughout Arabia.\\n\\t\\t\\t\\t(According to the geographer Al-Ham-dani, who died in 334\\n\\t\\t\\t\\tH., the area irrigated by this system of dams stretched\\n\\t\\t\\t\\teastward to the desert of Sayhad on the confines of the\\n\\t\\t\\t\\tRub' 'al-Khali) The flourishing state of the country was\\n\\t\\t\\t\\treflected in its people's intense trading activities and\\n\\t\\t\\t\\ttheir control of the \"spice road\" which led from Ma'rib\\n\\t\\t\\t\\tnorthwards to Mecca, Yathrib and Syria, and eastwards to\\n\\t\\t\\t\\tDufar on the shores of the Arabian Sea, thus connecting\\n\\t\\t\\t\\twith the maritime routes from India and China. - The\\n\\t\\t\\t\\tperiod to which the above Qur'anic passage refers is\\n\\t\\t\\t\\tevidently much later than that spoken of in {27:22-44}."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "16",
    "NoteID": "24",
    "Body": "Lit., \"the flooding of the dams\" (sayl al-'arim). The\\n\\t\\t\\t\\tdate of that catastrophe cannot be established with any\\n\\t\\t\\t\\tcertainty, but the most probable period of the first\\n\\t\\t\\t\\tbursting of the Dam of Ma'rib seems to have been the\\n\\t\\t\\t\\tsecond century of the Christian era. The kingdom of Sheba\\n\\t\\t\\t\\twas largely devastated, and this led to the migration of\\n\\t\\t\\t\\tmany southern (Qahtan) tribes towards the north of the\\n\\t\\t\\t\\tPeninsula. Subsequently, it appears, the system of dams\\n\\t\\t\\t\\tand dykes was to some extent repaired, but the country\\n\\t\\t\\t\\tnever regained its earlier prosperity; and a few decades\\n\\t\\t\\t\\tbefore the advent of Islam the great dam collapsed\\n\\t\\t\\t\\tcompletely and finally."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "17",
    "NoteID": "25",
    "Body": "Neither the Qur'an nor any authentic hadith tells us\\n\\t\\t\\t\\tanything definite about the way in which the people of\\n\\t\\t\\t\\tSheba had sinned at the time immediately preceding the\\n\\t\\t\\t\\tfinal collapse of the Dam of Ma'rib (i.e., in the sixth\\n\\t\\t\\t\\tcentury of the Christian era). This omission, however,\\n\\t\\t\\t\\tseems to be deliberate. In view of the fact that the\\n\\t\\t\\t\\tstory of Sheba's prosperity and subsequent catastrophic\\n\\t\\t\\t\\tdownfall had become a byword in ancient Arabia, it is\\n\\t\\t\\t\\tmost probable that its mention in the Qur'an has a purely\\n\\t\\t\\t\\tmoral purport similar to that of the immediately\\n\\t\\t\\t\\tpreceding legend of Solomon's death, inasmuch as both\\n\\t\\t\\t\\tthese legends, in their Qur'anic presentation, are\\n\\t\\t\\t\\tallegories of the ephemeral nature of all human might and\\n\\t\\t\\t\\tachievement. As mentioned at the beginning of note [23]\\n\\t\\t\\t\\tabove, the story of Sheba's downfall is closely linked\\n\\t\\t\\t\\twith the phenomenon of men's recurrent ingratitude\\n\\t\\t\\t\\ttowards God. (See also verse {20} and the corresponding\\n\\t\\t\\t\\tnote [29].)"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "18",
    "NoteID": "26",
    "Body": "I.e., Mecca and Jerusalem, both of which lay on the\\n\\t\\t\\t\\tcaravan route much used by the people of Sheba."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "19",
    "NoteID": "27",
    "Body": "In its generally-accepted spelling - based on the reading\\n\\t\\t\\t\\tadopted by most of the early scholars of Medina and Kufah\\n\\t\\t\\t\\t- the above phrase reads in the vocative rabbana and the\\n\\t\\t\\t\\timperative ba'id (\"Our Sustainer! Make long the distances\\n\\t\\t\\t\\t...\", etc.), which, however, cannot be convincingly\\n\\t\\t\\t\\texplained. On the other hand, Tabari, Baghawi and\\n\\t\\t\\t\\tZamakhshari mention, on the authority of some of the\\n\\t\\t\\t\\tearliest Qur'an-commentators, another legitimate reading\\n\\t\\t\\t\\tof the relevant words, namely, rabbuna (in the\\n\\t\\t\\t\\tnominative) and ba'ada (in the indicative), which gives\\n\\t\\t\\t\\tthe meaning adopted by me: \"Long has our Sustainer made\\n\\t\\t\\t\\tthe distances . ..\", etc. To my mind, this reading is\\n\\t\\t\\t\\tmuch more appropriate since (as pointed out by\\n\\t\\t\\t\\tZamakhshari) it expresses the belated regrets and the\\n\\t\\t\\t\\tsorrow of the people of Sheba at the devastation of their\\n\\t\\t\\t\\tcountry, the exodus of large groups of the population,\\n\\t\\t\\t\\tand the resultant abandonment of many towns and villages\\n\\t\\t\\t\\ton the great caravan routes."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "19",
    "NoteID": "28",
    "Body": "An allusion to the mass-migration of South-Arabian tribes\\n\\t\\t\\t\\tin all directions - particularly towards central and\\n\\t\\t\\t\\tnorthern Arabia - subsequent to the destruction of the\\n\\t\\t\\t\\tDam of Ma'rib."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "20",
    "NoteID": "29",
    "Body": "See  17:62 , as well as the last sentence of  7:17 , in\\n\\t\\t\\t\\twhich Iblis (i.e., Satan) says of the human race, \"most\\n\\t\\t\\t\\tof them wilt Thou find ungrateful\"."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "21",
    "NoteID": "30",
    "Body": "Cf. a similar phrase placed in the mouth of Iblis in\\n\\t\\t\\t\\t 14:22  (\"I had no power at all over you: I but called\\n\\t\\t\\t\\tyou - and you responded unto me\"), and the corresponding\\n\\t\\t\\t\\tnote [31]; also, see note [30] on {15:39-40}. - Although,\\n\\t\\t\\t\\ton the face of it, verses {20-21} of the present surah\\n\\t\\t\\t\\trefer to the people of Sheba, their import is (as the\\n\\t\\t\\t\\tsequence shows) much wider, applying to the human race as\\n\\t\\t\\t\\tsuch."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "21",
    "NoteID": "31",
    "Body": "See  15:41  and the corresponding note [31]."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "22",
    "NoteID": "32",
    "Body": "I.e., anybody who would \"mediate\" between Him and any of\\n\\t\\t\\t\\tHis creatures. As is evident from the sequence (as well\\n\\t\\t\\t\\tas from {17:56-57}), this passage relates, in particular,\\n\\t\\t\\t\\tto the attribution of divine or semi-divine qualities to\\n\\t\\t\\t\\tsaints and angels and to the problem of their\\n\\t\\t\\t\\t\"intercession\" with God."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "23",
    "NoteID": "33",
    "Body": "Regarding the Qur'anic concept of \"intercession\", see\\n\\t\\t\\t\\tnote [7] on  10:3 . Cf. also  19:87  and  20:109 ."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "23",
    "NoteID": "34",
    "Body": "Lit., \"the truth\" - i.e., whatever God decides regarding\\n\\t\\t\\t\\tHis grant or refusal of leave for intercession (which is\\n\\t\\t\\t\\tsynonymous with His redemptive acceptance or His\\n\\t\\t\\t\\trejection of the human being concerned) will conform with\\n\\t\\t\\t\\tthe requirements of absolute truth and justice (see note\\n\\t\\t\\t\\t[74] on  19:87 )."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "24",
    "NoteID": "35",
    "Body": "See note [49] on the first sentence of  10:31 ."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "29",
    "NoteID": "36",
    "Body": "The Qur'anic answer to this ironic question is found in\\n\\t\\t\\t\\t 7:187 ."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "30",
    "NoteID": "37",
    "Body": "For my rendering of sa'ah (lit., \"hour\") as \"a single\\n\\t\\t\\t\\tmoment\", see surah {7}, note [26]."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "31",
    "NoteID": "38",
    "Body": "For the rendering of ma bayna yadayhi, in relation to the\\n\\t\\t\\t\\tQur'an, as \"whatever there still remains of earlier\\n\\t\\t\\t\\trevelations\", see surah {3}, note [3]. As is evident from\\n\\t\\t\\t\\tthe preceding and subsequent verses, the rejection by\\n\\t\\t\\t\\t\"those who are bent on denying the truth\" of all\\n\\t\\t\\t\\trevelation is motivated by their refusal to believe in\\n\\t\\t\\t\\tresurrection and God's judgment, and, hence, to admit the\\n\\t\\t\\t\\tvalidity of absolute moral standards as postulated by\\n\\t\\t\\t\\tevery higher religion."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "31",
    "NoteID": "39",
    "Body": "I.e., as the \"intellectual leaders\" of their community."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "32",
    "NoteID": "40",
    "Body": "Lit., \"did we keep you away from guidance after it had\\n\\t\\t\\t\\tcome to you?\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "33",
    "NoteID": "41",
    "Body": "I.e., always. The term makr (lit., \"a scheme\" or\\n\\t\\t\\t\\t\"scheming\") has here the connotation of \"devising false\\n\\t\\t\\t\\targuments\" against something that is true: in this case,\\n\\t\\t\\t\\tas is shown in the first paragraph of verse {31} above,\\n\\t\\t\\t\\tagainst God's messages (cf. a similar use of this term in\\n\\t\\t\\t\\t 10:21  and  35:43 ; see also  86:15 )."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "33",
    "NoteID": "42",
    "Body": "Lit., \"[that we should] give God compeers (andad)\". For\\n\\t\\t\\t\\tan explanation of this phrase and my rendering of it, see\\n\\t\\t\\t\\tsurah {2}, note [13]."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "33",
    "NoteID": "43",
    "Body": "For a justification of this rendering of the phrase\\n\\t\\t\\t\\t'asarru 'n-nadamah, see surah {10}, note [77]."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "33",
    "NoteID": "44",
    "Body": "As pointed out by several of the classical commentators\\n\\t\\t\\t\\t(e.g., Zamakhshari, Razi and Baydawi) in their\\n\\t\\t\\t\\texplanations of similar phrases occurring in  13:5  and\\n\\t\\t\\t\\t 36:8 , the \"shackles\" (aghlal) which these sinners\\n\\t\\t\\t\\tcarry, as it were, \"around their necks\" in life, and will\\n\\t\\t\\t\\tcarry on Judgment Day, are a metaphor of the enslavement\\n\\t\\t\\t\\tof their souls to the false values to which they had\\n\\t\\t\\t\\tsurrendered, and of the suffering which will be caused by\\n\\t\\t\\t\\tthat surrender."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "34",
    "NoteID": "45",
    "Body": "The term mutraf denotes \"one who indulges in the pursuit\\n\\t\\t\\t\\tof pleasures\", i.e., to the exclusion of all moral\\n\\t\\t\\t\\tconsiderations: cf. note [147] on  11:116 ."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "35",
    "NoteID": "46",
    "Body": "Implying, firstly, that the only thing that really counts\\n\\t\\t\\t\\tin life is the enjoyment of material benefits; and,\\n\\t\\t\\t\\tsecondly, that a materially successful life is, by\\n\\t\\t\\t\\titself, an evidence of one's being \"on the right way\"."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "36",
    "NoteID": "47",
    "Body": "Sc., \"and foolishly regard riches and poverty as\\n\\t\\t\\t\\tindications of God's favour or disfavour\". Indirectly,\\n\\t\\t\\t\\tthis statement refutes the belief held by many people in\\n\\t\\t\\t\\tthe present as well as in the past that material\\n\\t\\t\\t\\tprosperity is a justification of all human endeavour."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "39",
    "NoteID": "48",
    "Body": "I.e., God's promise to the righteous that they would\\n\\t\\t\\t\\tattain to happiness in the life to come neither precludes\\n\\t\\t\\t\\tnor implies their being wealthy or poor in this world."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "39",
    "NoteID": "49",
    "Body": "I.e., either with worldly goods, or with inner\\n\\t\\t\\t\\tcontentment, or with spiritual merit (Zamakhshari)."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "40",
    "NoteID": "50",
    "Body": "This allegorical \"question\" - allegorical, because God is\\n\\t\\t\\t\\tomniscient and has no need to \"ask\" - implies that many\\n\\t\\t\\t\\tof \"those who deny the truth\" of God's messages delude\\n\\t\\t\\t\\tthemselves into believing that they are, nevertheless,\\n\\t\\t\\t\\tworshipping spiritual forces, here comprised in the term\\n\\t\\t\\t\\tangels\"."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "41",
    "NoteID": "51",
    "Body": "Implying that they (the angels) would never have accepted\\n\\t\\t\\t\\tthat worship which is due to God alone."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "41",
    "NoteID": "52",
    "Body": "In this instance, I believe, the term jinn has its\\n\\t\\t\\t\\tprimary meaning of \"that which is concealed from [man's]\\n\\t\\t\\t\\tsenses\" (see Appendix III), thus including all manner of\\n\\t\\t\\t\\tunknown forces, both real and imaginary, believed to be\\n\\t\\t\\t\\tinherent in what we describe as \"nature\". Hence, the\\n\\t\\t\\t\\tanswer of the angels implies that the sinners' alleged\\n\\t\\t\\t\\tworship of them had never been more than a subconscious\\n\\t\\t\\t\\tscreen for their fear of the invisible forces of nature\\n\\t\\t\\t\\tand, ultimately, of the yet deeper fear of the Unknown -\\n\\t\\t\\t\\tthat fear which sooner of later engulfs all who refuese\\n\\t\\t\\t\\tto believe in the existence of God and, hence, cannot see\\n\\t\\t\\t\\tany meaning or purpose in human life. (See also the last\\n\\t\\t\\t\\tsentence of  10:28  and the corresponding note [46.])"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "43",
    "NoteID": "53",
    "Body": "Lit., \"sorcery\" or \"magic\" - a term frequently used in\\n\\t\\t\\t\\tthe sense of \"spellbinding eloquence\" (cf.  74:24 , the\\n\\t\\t\\t\\tearliest instance in the chronology of Qur'anic\\n\\t\\t\\t\\trevelation)."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "44",
    "NoteID": "54",
    "Body": "Lit., \"which they could study\", i.e., in support of the\\n\\t\\t\\t\\tblasphemous beliefs and practices inherited from their\\n\\t\\t\\t\\tancestors. Cf. 30:35 , which expresses a similar idea."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "45",
    "NoteID": "55",
    "Body": "Sc., \"And how much worse will fare the deniers of the\\n\\t\\t\\t\\ttruth to whom so explicit and so comprehensive a divine\\n\\t\\t\\t\\twrit as the Qur'an has been conveyed!\" My rendering of\\n\\t\\t\\t\\tthe whole of this verse is based on Razi's\\n\\t\\t\\t\\tinterpretation, which differs from that of most of the\\n\\t\\t\\t\\tother commentators."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "46",
    "NoteID": "56",
    "Body": "Lit., \"two by two (mathna) and singly (furada)\".\\n\\t\\t\\t\\tAccording to Razi, the expression mathna denotes, in this\\n\\t\\t\\t\\tcontext, \"together with another person\" or \"other\\n\\t\\t\\t\\tpersons\": hence, the above phrase may be understood to\\n\\t\\t\\t\\trefer to man's social behaviour - i.e., his actions\\n\\t\\t\\t\\tconcerning others - as well as to his inner, personal\\n\\t\\t\\t\\tattidtude in all situations requiring a moral choice."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "46",
    "NoteID": "57",
    "Body": "See note [150] on  7:184 ."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "47",
    "NoteID": "58",
    "Body": "I.e., no reward of a material nature: cf.  25:57  - \"no\\n\\t\\t\\t\\treward other than that he who so wills may unto his\\n\\t\\t\\t\\tSustainer find a way\"."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "48",
    "NoteID": "59",
    "Body": "Cf.  21:18 ."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "49",
    "NoteID": "60",
    "Body": "Cf.  17:81 ."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "49",
    "NoteID": "61",
    "Body": "I.e., in contrast to the creativeness inherent in every\\n\\t\\t\\t\\ttrue idea, falsehood - being in itself an illusion -\\n\\t\\t\\t\\tcannot really create anything or revive any values that\\n\\t\\t\\t\\tmay have been alive in the past."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "50",
    "NoteID": "62",
    "Body": "According to Zamakhshari, the idea expressed by the\\n\\t\\t\\t\\tinterpolated words \"due to my own self\" is implied in the\\n\\t\\t\\t\\tabove, inasmuch as \"everything that goes against [the\\n\\t\\t\\t\\tspiritual interests of] oneself is caused by oneself\".\\n\\t\\t\\t\\t(See note [4] on  14:4 .)"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "51",
    "NoteID": "63",
    "Body": "Lit., \"from a place nearby\" - i.e., from within their own\\n\\t\\t\\t\\tselves: cf.  17:13  (\"every human being's destiny have We\\n\\t\\t\\t\\ttied to his neck\") and the corresponding note [17]. The\\n\\t\\t\\t\\tsame idea is expressed in  13:5  (\"it is they who carry\\n\\t\\t\\t\\tthe shackles [of their own making] around their necks\"),\\n\\t\\t\\t\\tas well as in the second part of verse {33} of the\\n\\t\\t\\t\\tpresent surah (\"We shall have put shackles around the\\n\\t\\t\\t\\tnecks of those who had been bent on denying the truth\").\\n\\t\\t\\t\\tSee also  50:41  and the corresponding note [33]."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "52",
    "NoteID": "64",
    "Body": "Lit., \"from a place far-away\" - i.e., from their utterly\\n\\t\\t\\t\\tdifferent past life on earth."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "53",
    "NoteID": "65",
    "Body": "The obvious implication is that man's fate in the\\n\\t\\t\\t\\thereafter will be a consequence of, and invariably\\n\\t\\t\\t\\tconditioned by, his spiritual attitude and the manner of\\n\\t\\t\\t\\this life during the first, earthly stage of his\\n\\t\\t\\t\\texistence. In this instance, the expression \"from far\\n\\t\\t\\t\\taway\" is apparently used in a sense similar to sayings\\n\\t\\t\\t\\tlike \"far off the mark\" or \"without rhyme or reason\", and\\n\\t\\t\\t\\tis meant to qualify as groundless and futile all negative\\n\\t\\t\\t\\tspeculations about what the Qur'an describes as al-ghayb\\n\\t\\t\\t\\t(\"that which is beyond the reach of human [or \"a created\\n\\t\\t\\t\\tbeing's\"] perception\"): in this case, life after death."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "54",
    "NoteID": "66",
    "Body": "Thus, the impossibility of attaining to the fulfilment of\\n\\t\\t\\t\\tany of their desires - whether positive or negative -\\n\\t\\t\\t\\tsums up, as it were, the suffering of the damned in the\\n\\t\\t\\t\\tlife to come."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "54",
    "NoteID": "67",
    "Body": "I.e., a suspicion that all moral postulates were but\\n\\t\\t\\t\\tmeant to deprive them of what they considered to be the\\n\\t\\t\\t\\t\"legitimate advantages\" of life in this world."
  }
]
