[
  {
    "SurahNumber": "74",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "The expression muddaththir (an abbreviated form of\\n\\t\\t\\t\\tmutadaththir) signifies \"one who is covered [with\\n\\t\\t\\t\\tsomething]\" or \"enfolded [in something]\"; and all\\n\\t\\t\\t\\tphilologists point out that the verb dathara, from which\\n\\t\\t\\t\\tthe above participial noun is derived, may equally well\\n\\t\\t\\t\\thave a concrete or abstract connotation. Most of the\\n\\t\\t\\t\\tcommentators understand the phrase \"O thou enfolded one\"\\n\\t\\t\\t\\tin its literal, concrete sense, and assume that it refers\\n\\t\\t\\t\\tto the Prophet's habit of covering himself with a cloak\\n\\t\\t\\t\\tor blanket when he felt that a revelation was about to\\n\\t\\t\\t\\tbegin. Razi, however, notes that this apostrophe may well\\n\\t\\t\\t\\thave been used metaphorically, as an allusion to\\n\\t\\t\\t\\tMuhammad's intense desire for solitude before the\\n\\t\\t\\t\\tbeginning of his prophetic mission (cf. introductory note\\n\\t\\t\\t\\tto surah {96}: and this, according to Razi, would explain\\n\\t\\t\\t\\this being thus addressed in connection with the\\n\\t\\t\\t\\tsubsequent call, \"Arise and warn\" - i.e., \"Give now up\\n\\t\\t\\t\\tthy solitude, and stand up before all the world as a\\n\\t\\t\\t\\tpreacher and warner.\""
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "4",
    "NoteID": "2",
    "Body": "Lit., \"thy garments (thiyab) purify\": but almost all the\\n\\t\\t\\t\\tclassical commentators point out that the noun thawb and\\n\\t\\t\\t\\tits plural thiyab is often metonymically applied to that\\n\\t\\t\\t\\twhich a garment encloses, i.e., a person's \"body\" or, in\\n\\t\\t\\t\\ta wider sense, his \"self\" or his \"heart\", or even his\\n\\t\\t\\t\\t\"spiritual state\" or \"conduct\" (Taj al-'Arus). Thus,\\n\\t\\t\\t\\tcommenting on the above verse, Zamakhshari draws the\\n\\t\\t\\t\\treader's attention to the well-known idiomatic phrases\\n\\t\\t\\t\\ttahir ath-thiyab (lit., \"one who is clean in his\\n\\t\\t\\t\\tgarments\") and danis ath-thiyab (\"one who is filthy in\\n\\t\\t\\t\\this garments\"), and stresses their tropical significance\\n\\t\\t\\t\\tof \"free from faults and vices\" and \"vicious and\\n\\t\\t\\t\\tperfidious\", respectively. Razi states with approval that\\n\\t\\t\\t\\t\"according to most of the [earlier] commentators, the\\n\\t\\t\\t\\tmeaning [of this verse] is, 'purify thy heart of all that\\n\\t\\t\\t\\tis blameworthy'\"."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "6",
    "NoteID": "3",
    "Body": "Lit. \"and do not bestow favours to obtain increase\"."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "10",
    "NoteID": "4",
    "Body": "Since this is the earliest Qur'anic occurrence of the\\n\\t\\t\\t\\texpression kafir (the above surah having been preceded\\n\\t\\t\\t\\tonly by the first five verses of surah {96}, its use here\\n\\t\\t\\t\\t- and, by implication, in the whole of the Qur'an - is\\n\\t\\t\\t\\tobviously determined by the meaning which it had in the\\n\\t\\t\\t\\tspeech of the Arabs before the advent of the Prophet\\n\\t\\t\\t\\tMuhammad: in other words, the term kafir cannot be simply\\n\\t\\t\\t\\tequated, as many Muslim theologians of post-classical\\n\\t\\t\\t\\ttimes and practically all Western translators of the\\n\\t\\t\\t\\tQur'an have done, with \"unbeliever\" or \"infidel\" in the\\n\\t\\t\\t\\tspecific, restricted sense of one who rejects the system\\n\\t\\t\\t\\tof doctrine and law promulgated in the Qur'an and\\n\\t\\t\\t\\tamplified by the teachings of the Prophet - but must have\\n\\t\\t\\t\\ta wider, more general meaning. This meaning is easily\\n\\t\\t\\t\\tgrasped when we bear in mind that the root verb of the\\n\\t\\t\\t\\tparticipial noun kafir (and of the infinitive noun kufr)\\n\\t\\t\\t\\tis kafara, \"he [or \"it\"] covered [a thing]\": thus, in\\n\\t\\t\\t\\t 57:20  the tiller of the soil is called (without any\\n\\t\\t\\t\\tpejorative implication) kafir, \"one who covers\", i.e.,\\n\\t\\t\\t\\tthe sown seed with earth, just as the night is spoken of\\n\\t\\t\\t\\tas having \"covered\" (kafara) the earth with darkness. In\\n\\t\\t\\t\\ttheir abstract sense, both the verb and the nouns derived\\n\\t\\t\\t\\tfrom it have a connotation of \"concealing\" something that\\n\\t\\t\\t\\texists or \"denying\" something that is true. Hence, in the\\n\\t\\t\\t\\tusage of the Qur'an - with the exception of the one\\n\\t\\t\\t\\tinstance (in  57:20 ) where this participial noun\\n\\t\\t\\t\\tsignifies a \"tiller of the soil\" - a kafir is \"one who\\n\\t\\t\\t\\tdenies [or \"refuses to acknowledge\"] the truth\" in the\\n\\t\\t\\t\\twidest, spiritual sense of this latter term: that is,\\n\\t\\t\\t\\tirrespective of whether it relates to a cognition of the\\n\\t\\t\\t\\tsupreme truth - namely, the existence of God - or to a\\n\\t\\t\\t\\tdoctrine or ordinance enunciated in the divine writ, or\\n\\t\\t\\t\\tto a self-evident moral proposition, or to an\\n\\t\\t\\t\\tacknowledgment of, and therefore gratitude for, favours\\n\\t\\t\\t\\treceived. (Regarding the expression alladhina kafaru,\\n\\t\\t\\t\\timplying conscious intent, see surah {2}, note [6].)"
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "11",
    "NoteID": "5",
    "Body": "Or: \"...whom I alone have created\". The above sentence\\n\\t\\t\\t\\tcan be understood in either of these two senses,\\n\\t\\t\\t\\tdepending on whether one relates the expression \"alone\"\\n\\t\\t\\t\\t(wahid) to God - thus stressing His uniqueness as Creator\\n\\t\\t\\t\\t- or to this particular object of His creation, man, who\\n\\t\\t\\t\\tbegins and ends his life in a state of utter loneliness\\n\\t\\t\\t\\t(cf.  6:94  and  19:80  and {95}). In either case, our\\n\\t\\t\\t\\tattention is drawn to the fact of man's inescapable\\n\\t\\t\\t\\tdependence on God. Beyond that, the phrase in question\\n\\t\\t\\t\\tcarries a further meaning, namely, \"Leave it to Me alone\\n\\t\\t\\t\\tto decide what to do with him who forgets that I am his\\n\\t\\t\\t\\tCreator and Sustainer\" - thus forbidding any human\\n\\t\\t\\t\\tpunishment of \"those who deny the truth\"."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "14",
    "NoteID": "6",
    "Body": "Lit., \"for whom I have spread [all] out in a [wide]\\n\\t\\t\\t\\tspread\" - i.e., \"whom I have endowed with potentialities\\n\\t\\t\\t\\tfar beyond those open to other living beings\"."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "16",
    "NoteID": "7",
    "Body": "Lit., \"he is wont (kana) to set himself\". The noun 'anid,\\n\\t\\t\\t\\tderived from the verb 'anada, denotes \"one who opposes or\\n\\t\\t\\t\\trejects something that is true, knowing it to be true\"\\n\\t\\t\\t\\t(Lisan al-'Arab). The element of human contrariness and\\n\\t\\t\\t\\tstubbornness is implied in the use of the auxiliary verb\\n\\t\\t\\t\\tkana, which indicates here a permanently recurring\\n\\t\\t\\t\\tphenomenon despite its past-tense formulation. I am,\\n\\t\\t\\t\\ttherefore, of the opinion that verses {18-25}, although\\n\\t\\t\\t\\tostensibly formulated in the past tense, must also be\\n\\t\\t\\t\\trendered in the present tense."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "17",
    "NoteID": "8",
    "Body": "In combination with the verb urhiquhu (\"I shall constrain\\n\\t\\t\\t\\thim to endure\") the term sa'ud (lit., \"ascent\" or\\n\\t\\t\\t\\t\"climb\") has the tropical connotation of something\\n\\t\\t\\t\\textremely difficult, painful or distressing. In the above\\n\\t\\t\\t\\tcontext, it is an allusion to the loss of all instinctive\\n\\t\\t\\t\\tinnocence - and, hence, to the individual and social\\n\\t\\t\\t\\tsuffering - which unavoidably follows upon man's wilful\\n\\t\\t\\t\\tneglect of moral and spiritual truths (\"God's messages\")\\n\\t\\t\\t\\tin this world and bars his spiritual development in the\\n\\t\\t\\t\\tlife to come."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "19",
    "NoteID": "9",
    "Body": "The expression qutila reads, literally, \"he has been\\n\\t\\t\\t\\tkilled\" or, as an imprecation, \"may he be killed\". Since\\n\\t\\t\\t\\ta literal rendering of this expression - whether\\n\\t\\t\\t\\tconceived as a statement of fact or an imprecation -\\n\\t\\t\\t\\twould be meaningless here, many commentators (Tabari\\n\\t\\t\\t\\tamong them) understand it as signifying \"he is rejected\\n\\t\\t\\t\\tfrom Gods grace\" (lu'ina) i.e., \"killed\" spiritually by\\n\\t\\t\\t\\this own action or attitude; hence my rendering, \"he\\n\\t\\t\\t\\tdestroys himself\"."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "22",
    "NoteID": "10",
    "Body": "I.e., he becomes emotionally involved because he suspects\\n\\t\\t\\t\\tin his heart that his arguments are weak (Razi)."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "23",
    "NoteID": "11",
    "Body": "See 96:6-7."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "24",
    "NoteID": "12",
    "Body": "The term sihr, which usually denotes \"sorcery\" or\\n\\t\\t\\t\\t\"magic\", primarily signifies \"the turning of something\\n\\t\\t\\t\\tfrom its proper [or \"natural\"] state of being into\\n\\t\\t\\t\\tanother state\"; hence, it is often applied to the\\n\\t\\t\\t\\tfascination or enchantment caused by exceptional,\\n\\t\\t\\t\\t\"spellbinding\" eloquence (Taj al-'Arus). In its\\n\\t\\t\\t\\tpejorative sense - as used by deniers of the truth to\\n\\t\\t\\t\\tdescribe a divine message - it has also the connotation\\n\\t\\t\\t\\tof \"wilful deception\" or \"delusion\"."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "26",
    "NoteID": "13",
    "Body": "This is unquestionably the earliest instance of the term\\n\\t\\t\\t\\tsaqar (\"hell-fire\"), one of the seven metaphorical names\\n\\t\\t\\t\\tgiven in the Qur'an to the concept of the suffering in\\n\\t\\t\\t\\tthe hereafter which man brings upon himself by sinning\\n\\t\\t\\t\\tand deliberately remaining blind and deaf, in this world,\\n\\t\\t\\t\\tto spiritual truths (cf. surah {15}, note [33]). The\\n\\t\\t\\t\\tallegorical character of this and all other Qur'anic\\n\\t\\t\\t\\tdescriptions of man's condition and destiny in the\\n\\t\\t\\t\\thereafter is clearly alluded to in the subsequent verse\\n\\t\\t\\t\\tas well as in verse {28} ff."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "29",
    "NoteID": "14",
    "Body": "Most of the commentators interpret the above elliptic\\n\\t\\t\\t\\tphrase in the sense of \"changing the appearance of man\"\\n\\t\\t\\t\\tor \"scorching the skin of man\". The rendering adopted by\\n\\t\\t\\t\\tme, on the other hand, is based on the primary\\n\\t\\t\\t\\tsignificance of the verb laha - \"it appeared\", \"it shone\\n\\t\\t\\t\\tforth\" or \"it became visible\". Hence, the primary meaning\\n\\t\\t\\t\\tof the intensive participial noun lawwah is \"that which\\n\\t\\t\\t\\tmakes [something] visible\". In the above context, it\\n\\t\\t\\t\\trelates to the sinner's belated cognition of the truth,\\n\\t\\t\\t\\tas well as to his distressing insight into his own\\n\\t\\t\\t\\tnature, his past failings and deliberate wrongdoings, and\\n\\t\\t\\t\\tthe realisation of his own responsibility for the\\n\\t\\t\\t\\tsuffering that is now in store for him: a state neither\\n\\t\\t\\t\\tof life nor of death (cf.{87:12-13})."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "30",
    "NoteID": "15",
    "Body": "Whereas most of the classical commentators are of the\\n\\t\\t\\t\\topinion that the \"nineteen\" are the angels that act as\\n\\t\\t\\t\\tkeepers or guardians of hell, Razi advances the view that\\n\\t\\t\\t\\twe may have here a reference to the physical,\\n\\t\\t\\t\\tintellectual and emotional powers within man himself:\\n\\t\\t\\t\\tpowers which raise man potentially far above any other\\n\\t\\t\\t\\tcreature, but which, if used wrongly, bring about a\\n\\t\\t\\t\\tdeterioration of his whole personality and, hence,\\n\\t\\t\\t\\tintense suffering in the life to come. According to Razi,\\n\\t\\t\\t\\tthe philosophers (arbab al-hikmah) identify these powers\\n\\t\\t\\t\\tor faculties with, firstly, the seven organic functions\\n\\t\\t\\t\\tof the animal - and therefore also human-body\\n\\t\\t\\t\\t(gravitation, cohesion, repulsion of noxious foreign\\n\\t\\t\\t\\tmatter, absorption of beneficent external matter,\\n\\t\\t\\t\\tassimilation of nutrients, growth, and reproduction);\\n\\t\\t\\t\\tsecondly, the five \"external\" or physical senses (sight,\\n\\t\\t\\t\\thearing, touch, smell and taste); thirdly, the five\\n\\t\\t\\t\\t\"internal\" or intellectual senses, defined by Ibn Sina -\\n\\t\\t\\t\\ton whom Razi apparently relies - as (1) perception of\\n\\t\\t\\t\\tisolated sense-images, (2) conscious apperceptions of\\n\\t\\t\\t\\tideas, (3) memory of sense-images, (4) memory of conscious\\n\\t\\t\\t\\tapperceptions; and, lastly, the emotions of desire or\\n\\t\\t\\t\\taversion (resp. fear or anger), which have their roots in\\n\\t\\t\\t\\tboth the \"external\" and \"internal\" sense-categories -\\n\\t\\t\\t\\tthus bringing the total of the powers and faculties which\\n\\t\\t\\t\\tpreside over man's spiritual fate to nineteen. In their\\n\\t\\t\\t\\taggregate, it is these powers that confer upon man the\\n\\t\\t\\t\\tability to think conceptually, and place him, in this\\n\\t\\t\\t\\trespect, even above the angels (cf.  2:30  ff. and the\\n\\t\\t\\t\\tcorresponding notes; see also the following note)."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "16",
    "Body": "Since it is by virtue of his powers of conscious\\n\\t\\t\\t\\tperception and conceptual thinking that man can arrive at\\n\\t\\t\\t\\ta discriminating cognition of good and evil and, thus,\\n\\t\\t\\t\\trise to great spiritual heights, these powers are\\n\\t\\t\\t\\tdescribed here as \"angelic\" (lit., \"angels\" - this being\\n\\t\\t\\t\\tthe earliest occurrence of the term malak in the history\\n\\t\\t\\t\\tof Qur'anic revelation). On the other hand, since a\\n\\t\\t\\t\\tneglect or a deliberately wrong use of these angelic\\n\\t\\t\\t\\tpowers is at the root of all sinning on the part of man\\n\\t\\t\\t\\tand, therefore, of his suffering in the hereafter, they\\n\\t\\t\\t\\tare spoken of as \"the lords (ashab) of the fire [of\\n\\t\\t\\t\\thell]\", which complements the expression \"over it\" in the\\n\\t\\t\\t\\tpreceding verse."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "17",
    "Body": "This is apparently an allusion to the allegorical\\n\\t\\t\\t\\tcharacter of this passage, which \"those who are bent on\\n\\t\\t\\t\\tdenying the truth\" are unwilling to recognize as such\\n\\t\\t\\t\\tand, hence, fail to grasp its real purport. By\\n\\t\\t\\t\\tspeculating on the reasons which allegedly induced\\n\\t\\t\\t\\tMuhammad - whom they regard as the \"author\" of the Qur'an\\n\\t\\t\\t\\t- to lay stress on one particular number, they tend to\\n\\t\\t\\t\\ttake the allegory in a literal sense, thus missing its\\n\\t\\t\\t\\tpoint entirely."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "18",
    "Body": "Namely, by being enabled, through an understanding of the\\n\\t\\t\\t\\tabove allegory, to appreciate the rational approach of\\n\\t\\t\\t\\tthe Qur'an to all questions of faith. The reference to\\n\\t\\t\\t\\t\"those who have been granted revelation aforetime\" is the\\n\\t\\t\\t\\tearliest statement outlining the principle of continuity\\n\\t\\t\\t\\tin mankind's religious experience."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "19",
    "Body": "I.e., in this instance, the half-hearted ones who,\\n\\t\\t\\t\\tdespite their ability to discern between right and wrong,\\n\\t\\t\\t\\tincline towards unbelief."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "20",
    "Body": "Cf. the identical phrase in  2:26 , together with the\\n\\t\\t\\t\\tcorresponding note [18]. My interpolation, in both these\\n\\t\\t\\t\\tpassages, of the word \"your\" between brackets is\\n\\t\\t\\t\\tnecessitated by the fact that it is the unbelievers who\\n\\t\\t\\t\\task this question."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "21",
    "Body": "Or: \"God lets go astray whomever He wills, and guides\\n\\t\\t\\t\\taright whomever He wills\" (see surah {14}, note [4]). The\\n\\t\\t\\t\\tstress on the allegorical nature of the above passage,\\n\\t\\t\\t\\tspoken of as a \"parable\" (mathal), has here the same\\n\\t\\t\\t\\tpurpose as in  2:26  - namely, to prevent the followers\\n\\t\\t\\t\\tof the Qur'an from attaching a literal meaning to its\\n\\t\\t\\t\\teschatological descriptions - a purpose that is\\n\\t\\t\\t\\tunmistakably expressed in the concluding sentence of this\\n\\t\\t\\t\\tpassage: \"All this is but a reminder to mortal man\". (See\\n\\t\\t\\t\\talso next note.)"
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "22",
    "Body": "Lit., \"it\" or \"these\" - depending on whether the personal\\n\\t\\t\\t\\tpronoun hiya is taken to denote a singular - in which\\n\\t\\t\\t\\tcase it would refer to the feminine noun saqar,\\n\\t\\t\\t\\t\"hell-fire\" (Tabari, Zamakhshari, Baghawi, Ibn Kathir) -\\n\\t\\t\\t\\tor a plural, referring to what Razi pinpoints as \"those\\n\\t\\t\\t\\t[Qur'anic] verses dealing with these allegories (hadhihi\\n\\t\\t\\t\\t'l-mutashabihat)\": hence my compromise rendering \"all\\n\\t\\t\\t\\tthis\"."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "32",
    "NoteID": "23",
    "Body": "This is the earliest Qur'anic instance of the adjurative\\n\\t\\t\\t\\tparticle wa used in the sense of a solemn, oathlike\\n\\t\\t\\t\\tassertion - a calling to witness, as it were - meant (as\\n\\t\\t\\t\\tin the expression \"by God!\") to give weight to a\\n\\t\\t\\t\\tsubsequently stated truth or evidence of the truth:\\n\\t\\t\\t\\thence, I am rendering it here and elsewhere as\\n\\t\\t\\t\\t\"consider\". In the present case, the truth thus to be\\n\\t\\t\\t\\tstressed is the implied statement that just as the\\n\\t\\t\\t\\tchanging phases of the moon and the alternation of night\\n\\t\\t\\t\\tand day are the outcome of God-given, natural laws, so,\\n\\t\\t\\t\\ttoo, a sinner's suffering in the hereafter is but a\\n\\t\\t\\t\\tnatural outcome of his deliberate wrongdoing in this\\n\\t\\t\\t\\tworld. (See also note [7] on  2:7 .)"
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "37",
    "NoteID": "24",
    "Body": "Lit., \"any of you who chooses...\", etc. - i.e.,\\n\\t\\t\\t\\tirrespective of whether one has chosen to follow or to\\n\\t\\t\\t\\tdisregard the divine call: implying that even true\\n\\t\\t\\t\\tbelievers may stumble into sinning, and hence need to be\\n\\t\\t\\t\\twarned."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "39",
    "NoteID": "25",
    "Body": "Lit., \"those [or \"the people\"] on the right hand\" (ashab al-yamin), an expression based on the tropical significance of yamin as \"righteous\" or \"righteousness\" and consequently, \"blessedness\". The above is probably the oldest Qur'anic incidence of this expression, which evidently comprises all those whose conduct in life will have earned them God's forgiveness of whatever sins they may have committed."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "43",
    "NoteID": "26",
    "Body": "In view of the fact that at the time of the revelation of\\n\\t\\t\\t\\tthis very early surah the canonical prayer (salah) had\\n\\t\\t\\t\\tnot yet been made obligatory on the followers of the\\n\\t\\t\\t\\tQur'an, it is reasonable to assume that in the above\\n\\t\\t\\t\\tcontext this term is used in its widest sense, namely,\\n\\t\\t\\t\\tconscious belief in God."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "48",
    "NoteID": "27",
    "Body": "Lit., \"the intercession of intercessors\" - implying that\\n\\t\\t\\t\\tthere would be none to intercede for them with God. As\\n\\t\\t\\t\\tregards the much-misunderstood Islamic concept of\\n\\t\\t\\t\\t\"intercession\", see  10:3  - \"there is none that could\\n\\t\\t\\t\\tintercede with Him unless He grants His leave therefor\" -\\n\\t\\t\\t\\tand the corresponding note [7]."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "49",
    "NoteID": "28",
    "Body": "I.e., with so many people who refuse to listen to the\\n\\t\\t\\t\\ttruth."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "52",
    "NoteID": "29",
    "Body": "Lit., \"every one of them wants to be given wide-open\\n\\t\\t\\t\\tscriptures\", or \"scriptures unfolded\" (i.e., open to\\n\\t\\t\\t\\teveryone's understanding): cf.  2:118  - \"Why does not\\n\\t\\t\\t\\tGod speak unto us, nor is a message conveyed to us?\" -\\n\\t\\t\\t\\ti.e., directly, without the intervention of a prophet.\\n\\t\\t\\t\\tThe above is the earliest illustration of the \"arrogance\"\\n\\t\\t\\t\\tor \"false pride\" to which the Qur'an so often refers."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "56",
    "NoteID": "30",
    "Body": "Namely, unless He bestows His grace on them by making\\n\\t\\t\\t\\ttheir minds and hearts receptive to the truth, so that\\n\\t\\t\\t\\tthey are compelled - from within themselves, as it were -\\n\\t\\t\\t\\tto make the right choice. (See also note [11] on\\n\\t\\t\\t\\t{81:28-29}, as well as note [4] on  14:4 .)"
  }
]
