[
  {
    "SurahNumber": "80",
    "AyahNumber": "1",
    "NoteID": "5950",
    "Body": "See the Introduction to this Sura for the incident to\\n\\t\\t\\t\\twhich this refers. The lesson is that neither spiritual\\n\\t\\t\\t\\tworth nor the prospect of effective spiritual guidance is\\n\\t\\t\\t\\tto be measured by a man's position in life. The poor, or\\n\\t\\t\\t\\tthe blind, the halt, or the maimed, may be more\\n\\t\\t\\t\\tsusceptible to the teaching of Allah's Word than men who\\n\\t\\t\\t\\tare apparently gifted, but who suffer from arrogance and\\n\\t\\t\\t\\tself-sufficiency."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "4",
    "NoteID": "5951",
    "Body": "It may be that the poor blind man might, on account of\\n\\t\\t\\t\\this will to learn, be more likely to grow in his own\\n\\t\\t\\t\\tspiritual development or to profit by any lessons taught\\n\\t\\t\\t\\tto him even in report than a self-sufficient leader. In\\n\\t\\t\\t\\tfact it was so. For the blind man became a true and\\n\\t\\t\\t\\tsincere Muslim and lived to become a governor of Madinah."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "5",
    "NoteID": "5952",
    "Body": "Such a one would be a Pagan Quraish leader, whom the holy\\n\\t\\t\\t\\tProphet was anxious to get into his fold, in order that\\n\\t\\t\\t\\tthe work of preaching Allah's Message might be\\n\\t\\t\\t\\tfacilitated. But such a Message works first amongst the\\n\\t\\t\\t\\tsimple and lowly, the poor and despised folk, and the\\n\\t\\t\\t\\tmighty ones of the earth only come in when the stream\\n\\t\\t\\t\\trushes in with irresistible force."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "7",
    "NoteID": "5953",
    "Body": "Allah's Message is for all, but if the great ones\\n\\t\\t\\t\\tarrogantly keep back from it, it is no fault of the\\n\\t\\t\\t\\tpreacher, so long as he has proclaimed the Message. He\\n\\t\\t\\t\\tshould attend to all, and specially to the humble and\\n\\t\\t\\t\\tlowly."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "9",
    "NoteID": "5954",
    "Body": "The fear in the blind man's heart may have been two-fold.\\n\\t\\t\\t\\t(1) He was humble and God-fearing, not arrogant and\\n\\t\\t\\t\\tself-sufficient; (2) being poor and blind, he feared to\\n\\t\\t\\t\\tintrude; yet his earnest desire to learn the Qur-an made\\n\\t\\t\\t\\thim bold, and he came, perhaps unseasonably, but was yet\\n\\t\\t\\t\\tworthy of encouragement, because of the purity of his\\n\\t\\t\\t\\theart."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "11",
    "NoteID": "5955",
    "Body": "Allah's Message is a universal Message, from which no one\\n\\t\\t\\t\\tis to be excluded, rich or poor, old or young, great or\\n\\t\\t\\t\\tlowly, learned or ignorant. If anyone had the spiritual\\n\\t\\t\\t\\tcraving that needed satisfaction, he was to be given\\n\\t\\t\\t\\tprecedence if there was to be any question of precedence\\n\\t\\t\\t\\tat all."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "13",
    "NoteID": "5956",
    "Body": "At the time this Sura was revealed, there were perhaps\\n\\t\\t\\t\\tonly about 42 or 45 Suras in the hands of the Muslims.\\n\\t\\t\\t\\tBut it was a sufficient body of Revelation of high\\n\\t\\t\\t\\tspiritual value, to which the discription given here\\n\\t\\t\\t\\tcould be applied. It was held in the highest honor; its\\n\\t\\t\\t\\tplace in the hearts of Muslims was more exalted than that\\n\\t\\t\\t\\tof anything else; as Allah's Word, it was pure and\\n\\t\\t\\t\\tsacred; and those who transcribed it were men who were\\n\\t\\t\\t\\thonorable, just and pious. The legend that the early\\n\\t\\t\\t\\tSuras were not carefully written down and preserved in\\n\\t\\t\\t\\tbooks is a pure invention. The recensions made later in\\n\\t\\t\\t\\tthe time of the first and the third Khalifas were merely\\n\\t\\t\\t\\tto preserve the purity and safeguard the arrangement of\\n\\t\\t\\t\\tthe text at a time when the expansion of Islam among\\n\\t\\t\\t\\tnon-Arabic-speaking people made such precautions\\n\\t\\t\\t\\tnecessary."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "19",
    "NoteID": "5957",
    "Body": "Cf. lxxvi. 2, and n. 5832. The origin of man as an animal\\n\\t\\t\\t\\tis lowly indeed. But what further faculties and\\n\\t\\t\\t\\tcapacities has not Allah granted to man? Besides his\\n\\t\\t\\t\\tanimal body, in which also he shares in all the blessings\\n\\t\\t\\t\\twhich Allah has bestowed on the rest of His Creation, man\\n\\t\\t\\t\\thas been granted divine gifts which entitle him to be\\n\\t\\t\\t\\tcalled the Vicegerent on earth: ii. 30. He has a will; he\\n\\t\\t\\t\\thas spiritual perception; he is capable of divine love;\\n\\t\\t\\t\\the can control nature within certain limits, and subject\\n\\t\\t\\t\\tnature's forces to his own use. And he has been given the\\n\\t\\t\\t\\tpower of judgment, so that he can avoid excess and\\n\\t\\t\\t\\tdefect, and follow the middle path. And that path, as\\n\\t\\t\\t\\twell as all that is necessary for his life in its\\n\\t\\t\\t\\tmanifold aspects, has been made easy for him."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "21",
    "NoteID": "5958",
    "Body": "Cf. xx. 55. Death is an inevitable event after the brief\\n\\t\\t\\t\\tlife on this earth, but it is also in a sense a blessing,\\n\\t\\t\\t\\ta release from the imperfections of this world, a close\\n\\t\\t\\t\\tof the probationary period, after which will dawn the\\n\\t\\t\\t\\tfull Reality. \"The Grave\" may be understood to be the\\n\\t\\t\\t\\tperiod between physical death and immortal Life, whatever\\n\\t\\t\\t\\tmay be the mode of disposal of the dead body. This\\n\\t\\t\\t\\tintermediate period is the Barzakh or Partition: see n.\\n\\t\\t\\t\\t2940 to xxiii. 101."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "23",
    "NoteID": "5959",
    "Body": "Though all these blessings and stages have been provided\\n\\t\\t\\t\\tby Allah's Grace for the good of man, yet unregenerate\\n\\t\\t\\t\\tman fails in carrying out the purpose of his creation and\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "24",
    "NoteID": "5960",
    "Body": "After a reference to man's inner history, there is now a\\n\\t\\t\\t\\treference to just one item in his daily outer life, his\\n\\t\\t\\t\\tfood: and it is shown how the forces of heaven and earth\\n\\t\\t\\t\\tunite by Allah's Command to serve man and his dependants.\\n\\t\\t\\t\\t\"A provision for you and your cattle\" (verse 32 below).\\n\\t\\t\\t\\tIf that is the case with just one item, food, how much\\n\\t\\t\\t\\tmore comprehensive is Allah's beneficence when the whole\\n\\t\\t\\t\\tof man's needs are considered!"
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "26",
    "NoteID": "5961",
    "Body": "The water comes from the clouds in plentiful abundance;\\n\\t\\t\\t\\tthe earth is ploughed, and the soil is broken up in\\n\\t\\t\\t\\tfragments, and yields an abundant harvest of cereals\\n\\t\\t\\t\\t(Corn), trellised fruit (Grapes), and vegetable food\\n\\t\\t\\t\\t(nutritious Plants), as well as fruit that can keep for\\n\\t\\t\\t\\tlong periods and serve many uses, like olives and dates."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "27",
    "NoteID": "5962",
    "Body": "Therein: i.e., from within the earth or the soil."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "30",
    "NoteID": "5963",
    "Body": "We not only get field crops such as were mentioned in n.\\n\\t\\t\\t\\t5961 above, but we have the more highly cultivated garden\\n\\t\\t\\t\\tcrops, both in the way of lofty trees, and in the way of\\n\\t\\t\\t\\tcarefully tended fruits like the fig; and then we have\\n\\t\\t\\t\\tgrass and all kinds of fodder."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "32",
    "NoteID": "5964",
    "Body": "The same verse occurs at Ixxix. 33, where no. 5940\\n\\t\\t\\t\\texplains the wider meaning in that context."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "33",
    "NoteID": "5965",
    "Body": "Preliminary to the establishment of the Final Judgment."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "36",
    "NoteID": "5966",
    "Body": "Even those who were nearest and dearest in this life will\\n\\t\\t\\t\\tnot be able or willing to help each other on that awful\\n\\t\\t\\t\\tDay. On the contrary, if they have to receive a sentence\\n\\t\\t\\t\\tfor their sins, they will be anxious to avoid even\\n\\t\\t\\t\\tsharing each other's sorrows or witnessing each other's\\n\\t\\t\\t\\thumiliation; for each will have enough of his own\\n\\t\\t\\t\\ttroubles to occupy him. On the other hand, the Righteous\\n\\t\\t\\t\\twill be united with their righteous families: lii. 21;\\n\\t\\t\\t\\tand their faces will be \"beaming, laughing, rejoicing\"\\n\\t\\t\\t\\t(lxxx. 38-39)."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "37",
    "NoteID": "5967",
    "Body": "Cf. lxx. 10-14. Nor friend will ask after a friend that\\n\\t\\t\\t\\tDay. On the contrary the sinner will desire to save\\n\\t\\t\\t\\thimself at the expense even of his own family and\\n\\t\\t\\t\\tbenefactors."
  },
  {
    "SurahNumber": "80",
    "AyahNumber": "40",
    "NoteID": "5968",
    "Body": "The dust on the faces of the sinners will be in contrast\\n\\t\\t\\t\\tto the beaming light on the faces of the righteous; and\\n\\t\\t\\t\\tthe blackness in contrast to the \"laughing, rejoicing\"\\n\\t\\t\\t\\tfaces of the righteous. But the dust also suggests that\\n\\t\\t\\t\\tbeing Rejecters of Allah, their faces and eyes and\\n\\t\\t\\t\\tfaculties were choked in dust, and the blackness suggests\\n\\t\\t\\t\\tthat being Doers of Iniquity they had no part or lot in\\n\\t\\t\\t\\tPurity or Light. Another contrast may possibly be\\n\\t\\t\\t\\tdeduced: the humble and lowly may be \"in the dust\" in\\n\\t\\t\\t\\tthis life, and the arrogant sinners in sunshine, but the\\n\\t\\t\\t\\troles will be reversed at Judgment."
  }
]
