[
  {
    "SurahNumber": "30",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "4",
    "NoteID": "2",
    "Body": "Lit., \"before and after\". The defeats and victories\\n\\t\\t\\t\\tspoken of above relate to the last phases of the\\n\\t\\t\\t\\tcenturies-long struggle between the Byzantine and Persian\\n\\t\\t\\t\\tEmpires. During the early years of the seventh century\\n\\t\\t\\t\\tthe Persians conquered parts of Syria and Anatolia, \"the\\n\\t\\t\\t\\tlands close-by\", i.e., near the heartland of the\\n\\t\\t\\t\\tByzantine Empire; in 613 they took Damascus, and in 614,\\n\\t\\t\\t\\tJerusalem; Egypt fell to them in 615-16, and at the same\\n\\t\\t\\t\\ttime they laid siege to Constantinople itself. At the\\n\\t\\t\\t\\ttime of the revelation of this surah - about the seventh\\n\\t\\t\\t\\tyear before the hijrah, corresponding to 615 or 616 of\\n\\t\\t\\t\\tthe Christian era - the total destruction of the\\n\\t\\t\\t\\tByzantine Empire seemed imminent. The few Muslims around\\n\\t\\t\\t\\tthe Prophet were despondent on hearing the news of the\\n\\t\\t\\t\\tutter discomfiture of the Byzantines, who were Christians\\n\\t\\t\\t\\tand, as such, believed in the One God. The pagan Quraysh,\\n\\t\\t\\t\\ton the other hand, sympathized with Persians who, they\\n\\t\\t\\t\\tthought, would vindicate their own opposition to the\\n\\t\\t\\t\\tOne-God idea. When Muhammad enunciated the above\\n\\t\\t\\t\\tQur'an-verses predicting a Byzantine victory \"within a\\n\\t\\t\\t\\tfew years\", this prophecy was received with derision by\\n\\t\\t\\t\\tthe Quraysh. Now the term bid' (commonly rendered as \"a\\n\\t\\t\\t\\tfew\") denotes any number between three and ten; and, as\\n\\t\\t\\t\\tit happened, in 622 - i.e., six or seven years after the\\n\\t\\t\\t\\tQur'anic prediction - the tide turned in favour of the\\n\\t\\t\\t\\tByzantines. In that year, Emperor Heraclius succeeded in\\n\\t\\t\\t\\tdefeating the Persians at Issus, south of the Taurus\\n\\t\\t\\t\\tMountains, and subsequently drove them out of Asia Minor.\\n\\t\\t\\t\\tBy 624, he carried the war into Persian territory and\\n\\t\\t\\t\\tthus put the enemy on the defensive; and in the beginning\\n\\t\\t\\t\\tof December, 626, the Persian armies were completely\\n\\t\\t\\t\\trouted by the Byzantines."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "This is a prediction of the battle of Badr, which was to\\n\\t\\t\\t\\ttake place eight or nine years later, in the month of\\n\\t\\t\\t\\tRamadan, 2 H. (corresponding to January, 624, of the\\n\\t\\t\\t\\tChristian era), when the Muslims decisively defeated a\\n\\t\\t\\t\\tvery much superior force of pagan Quraysh (see\\n\\t\\t\\t\\tintroductory note to surah {8}). The expression \"on that\\n\\t\\t\\t\\tday\" has in this context the meaning of \"at the same\\n\\t\\t\\t\\ttime\", for although the battle of Badr began and ended on\\n\\t\\t\\t\\tone day, the victories of Heraclius over the Persians\\n\\t\\t\\t\\ttook some years to materialize."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "The term al-akhirah circumscribes, in this context. both\\n\\t\\t\\t\\tthe inner reality of this world's life and the ultimate\\n\\t\\t\\t\\treality of the hereafter."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "8",
    "NoteID": "5",
    "Body": "Lit., \"Have they never thought within themselves?\""
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "I.e., in contrast to God, who is eternal and unlimited,\\n\\t\\t\\t\\teverything created is limited and subject to change and\\n\\t\\t\\t\\ttermination. As regards my rendering of illa bi'l-haqq\\n\\t\\t\\t\\t(lit., \"otherwise than with [or \"in\"] truth\") as \"without\\n\\t\\t\\t\\t[an inner] truth\", see note [11] on the second sentence\\n\\t\\t\\t\\tof  10:5 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "Lit., \"more\". The phrase can also be rendered as \"peopled\\n\\t\\t\\t\\tit [or \"dwelt in it\"] in great numbers\"."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "10",
    "NoteID": "8",
    "Body": "For this particular rendering of thumma see surah {6},\\n\\t\\t\\t\\tnote [31]."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "I.e., He will bring him forth anew: cf.  10:4  and the\\n\\t\\t\\t\\tcorresponding note [8]. (A more general formulation of\\n\\t\\t\\t\\tthe same statement is found in verse {27} of this surah.)"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "13",
    "NoteID": "10",
    "Body": "Lit., \"among their [God-]partners\" (see surah {6}, note\\n\\t\\t\\t\\t[15])."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "13",
    "NoteID": "11",
    "Body": "Lit., \"they will have rejected those [God-]partners of\\n\\t\\t\\t\\ttheirs\"."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "16",
    "NoteID": "12",
    "Body": "See note [111] on  7:147 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "18",
    "NoteID": "13",
    "Body": "I.e., \"remember God at all times\". Apart from this\\n\\t\\t\\t\\tgeneral exhortation, the hours mentioned above\\n\\t\\t\\t\\tcircumscribe the times of the five daily prayers\\n\\t\\t\\t\\tincumbent upon a Muslim. The \"evening hours\" indicate the\\n\\t\\t\\t\\tprayer after sunset (maghrib) as well as that after\\n\\t\\t\\t\\tnightfall ('isha')."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "20",
    "NoteID": "14",
    "Body": "See second half of note [47] on  3:59 , and note [4] on\\n\\t\\t\\t\\t 23:12 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "21",
    "NoteID": "15",
    "Body": "Lit., \"from among yourselves\" (see surah {4}, note [1])."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "24",
    "NoteID": "16",
    "Body": "I.e., hope of rain - an oft-recurring Qur'anic symbol of\\n\\t\\t\\t\\tfaith and spiritual life (cf.  13:12 )."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "25",
    "NoteID": "17",
    "Body": "Cf.  13:2 , where God is spoken of as having \"raised the\\n\\t\\t\\t\\tskies without any supports that you could see\" - a phrase\\n\\t\\t\\t\\texplained in the corresponding note [4]."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "27",
    "NoteID": "18",
    "Body": "Although this statement is phrased in almost exactly the\\n\\t\\t\\t\\tsame words as in verse {11} above (as well as in  10:4 ),\\n\\t\\t\\t\\tit evidently has here a more general purport, relating\\n\\t\\t\\t\\tnot only to man and man's individual resurrection but to\\n\\t\\t\\t\\tthe creation and constant re-creation of all life."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "27",
    "NoteID": "19",
    "Body": "Primarily, the term mathal denotes a \"likeness\" or\\n\\t\\t\\t\\t\"similitude\", and hence is often used in the Qur'an\\n\\t\\t\\t\\t(e.g., in the next verse) in the sense of \"parable\".\\n\\t\\t\\t\\tOccasionally, however, it is synonymous with sifah, which\\n\\t\\t\\t\\tsignifies the intrinsic \"attribute\", \"quality\" or\\n\\t\\t\\t\\t\"nature\" of a thing, concept or living being (cf. the\\n\\t\\t\\t\\treference to \"the nature of Jesus\" and \"the nature of\\n\\t\\t\\t\\tAdam\" in  3:59 ). With reference to God, who is\\n\\t\\t\\t\\t\"sublimely exalted above anything that men may devise by\\n\\t\\t\\t\\tway of definition\" (see  6:100  and the corresponding\\n\\t\\t\\t\\tnote [88]), the expression mathal clearly points to a\\n\\t\\t\\t\\tquality of being entirely different from all other\\n\\t\\t\\t\\tcategories of existence, inasmuch as there is \"nothing\\n\\t\\t\\t\\tlike unto Him\" ( 42:11 ) and \"nothing that could be\\n\\t\\t\\t\\tcompared with Him\" ( 112:4 ): hence, the rendering of\\n\\t\\t\\t\\tmathal as \"essence\" is most appropriate in this context."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "28",
    "NoteID": "20",
    "Body": "Lit., \"a parable (mathal) from yourselves\"."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "28",
    "NoteID": "21",
    "Body": "I.e., slaves or persons otherwise subject to one's\\n\\t\\t\\t\\tauthority."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "28",
    "NoteID": "22",
    "Body": "Lit., \"yourselves\" - i.e., \"those who are equal to you in\\n\\t\\t\\t\\tstatus\". The question is, of course, rhetorical, and must\\n\\t\\t\\t\\tbe answered in the negative. But if (so the implied\\n\\t\\t\\t\\targument goes) a human master would not willingly accept\\n\\t\\t\\t\\this slaves as full-fledged partners - even though master\\n\\t\\t\\t\\tand slave are essentially equal by virtue of the\\n\\t\\t\\t\\thumanness common to both of them (Zamakhshari) - how can\\n\\t\\t\\t\\tman regard any created beings or things as equal to Him\\n\\t\\t\\t\\twho is their absolute Lord and Master, and is beyond\\n\\t\\t\\t\\tcomparison with anything that exists or could ever exist?\\n\\t\\t\\t\\t(Parables with a similar purport are found in {16:75-76}."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "29",
    "NoteID": "23",
    "Body": "In this instance, the phrase alladhina zalamu (\"they who\\n\\t\\t\\t\\tare bent on evildoing\") relates to those who deliberately\\n\\t\\t\\t\\tascribe divinity or divine powers to anyone or anything\\n\\t\\t\\t\\tbeside God, thus yielding to a desire for divine or\\n\\t\\t\\t\\tsemi-divine \"mediators\" between themselves and Him.\\n\\t\\t\\t\\tInasmuch as such a desire offends against the concept of\\n\\t\\t\\t\\tGod's omniscience and omnipresence, its very existence\\n\\t\\t\\t\\tshows that the person concerned does not really believe\\n\\t\\t\\t\\tin Him and, therefore, does not have the least knowledge\\n\\t\\t\\t\\tof the truth."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "29",
    "NoteID": "24",
    "Body": "For an explanation of God's \"letting man go astray\", see\\n\\t\\t\\t\\tnote [4] on the second sentence of  14:4 , as well as\\n\\t\\t\\t\\tnote [7] on  2:7 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "30",
    "NoteID": "25",
    "Body": "I.e., \"surrender thy whole being\"; the term \"face\" is\\n\\t\\t\\t\\toften used metonymically in the sense of one's \"whole\\n\\t\\t\\t\\tbeing\"."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "30",
    "NoteID": "26",
    "Body": "For this rendering of hanif, see note [110] on  2:135 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "30",
    "NoteID": "27",
    "Body": "See  7:172  and the corresponding note [139]. The term\\n\\t\\t\\t\\tfitrah, rendered by me as \"natural disposition\", connotes\\n\\t\\t\\t\\tin this context man's inborn, intuitive ability to\\n\\t\\t\\t\\tdiscern between right and wrong, true and false, and,\\n\\t\\t\\t\\tthus, to sense God's existence and oneness. Cf. the\\n\\t\\t\\t\\tfamous saying of the Prophet, quoted by Bukhari and\\n\\t\\t\\t\\tMuslim: \"Every child is born in this natural disposition;\\n\\t\\t\\t\\tit is only his parents that later turn him into a 'Jew',\\n\\t\\t\\t\\ta 'Christian', or a 'Magian'.\" These three religious\\n\\t\\t\\t\\tformulations, best known to the contemporaries of the\\n\\t\\t\\t\\tProphet, are thus contrasted with the \"natural\\n\\t\\t\\t\\tdisposition\" which, by definition, consists in man's\\n\\t\\t\\t\\tinstinctive cognition of God and self-surrender (islam)\\n\\t\\t\\t\\tto Him. (The term \"parents\" has here the wider meaning of\\n\\t\\t\\t\\t\"social influences\" or \"environment\")."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "30",
    "NoteID": "28",
    "Body": "Lit., \"no change shall there be [or \"shall be made\"] in\\n\\t\\t\\t\\tGod's creation (khalq)\", i.e., in the natural disposition\\n\\t\\t\\t\\treferred to above (Zamakhshari). In this context, the\\n\\t\\t\\t\\tterm tabdil (\"change\") obviously comprises the concept of\\n\\t\\t\\t\\t\"corruption\"."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "32",
    "NoteID": "29",
    "Body": "See 6:159, {21:92-93} and {23:52-53}, as well as the\\n\\t\\t\\t\\tcorresponding notes."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "33",
    "NoteID": "30",
    "Body": "See note [61] on  16:54 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "35",
    "NoteID": "31",
    "Body": "Lit., \"a warrant\" or \"authority\" (sultan), in this\\n\\t\\t\\t\\tcontext obviously denoting a revelation."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "35",
    "NoteID": "32",
    "Body": "Lit., \"of that which they were wont to associate [with\\n\\t\\t\\t\\tUs]\". Cf. second paragraph of  35:40  and the\\n\\t\\t\\t\\tcorresponding note [27]."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "36",
    "NoteID": "33",
    "Body": "See  4:79  and the corresponding note [94]."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "38",
    "NoteID": "34",
    "Body": "Cf.  17:26 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "39",
    "NoteID": "35",
    "Body": "This is the earliest mention of the term and concept of\\n\\t\\t\\t\\triba in the chronology of Qur'anic revelation. In its\\n\\t\\t\\t\\tgeneral, linguistic sense, this term denotes an\\n\\t\\t\\t\\t\"addition\" to or an \"increase\" of a thing over and above\\n\\t\\t\\t\\tits original size or amount; in the terminology of the\\n\\t\\t\\t\\tQur'an, it signifies any unlawful addition, by way of\\n\\t\\t\\t\\tinterest, to a sum of money or goods lent by one person\\n\\t\\t\\t\\tor body of persons to another. Considering the problem in\\n\\t\\t\\t\\tterms of the economic conditions prevailing at or before\\n\\t\\t\\t\\ttheir time, most of the early Muslim jurists identified\\n\\t\\t\\t\\tthis \"unlawful addition\" with profits obtained through\\n\\t\\t\\t\\tany kind of interest-bearing loans irrespective of the\\n\\t\\t\\t\\trate of interest and the economic motivation involved.\\n\\t\\t\\t\\tWith all this - as is evidenced by the voluminous\\n\\t\\t\\t\\tjuridical literature on this subject - Islamic scholars\\n\\t\\t\\t\\thave not yet been able to reach an absolute agreement on\\n\\t\\t\\t\\tthe definition of riba: a definition, that is, which\\n\\t\\t\\t\\twould cover all conceivable legal situations and\\n\\t\\t\\t\\tpositively respond to all the exigencies of a variable\\n\\t\\t\\t\\teconomic environment. In the words of Ibn Kathir (in his\\n\\t\\t\\t\\tcommentary on  2:275 ), \"the subject of riba is one of\\n\\t\\t\\t\\tthe most difficult subjects for many of the scholars (ahl\\n\\t\\t\\t\\tal-'ilm)\". It should be borne in mind that the passage\\n\\t\\t\\t\\tcondemning and prohibiting riba in legal terms\\n\\t\\t\\t\\t({2:275-281}) was the last revelation received by the\\n\\t\\t\\t\\tProphet, who died a few days later (cf. note [268] on\\n\\t\\t\\t\\t 2:281 ; hence, the Companions had no opportunity to ask\\n\\t\\t\\t\\thim about the shar'i implications of the relevant\\n\\t\\t\\t\\tinjunction - so much so that even 'Umar ibn al-Khattab is\\n\\t\\t\\t\\treliably reported to have said: \" The last [of the\\n\\t\\t\\t\\tQur'an] that was revealed was the passage [lit., \"the\\n\\t\\t\\t\\tverse\"] on riba; and, behold, the Apostle of God passed\\n\\t\\t\\t\\taway without [lit., \"before\"] having explained its\\n\\t\\t\\t\\tmeaning to us\" (Ibn Hanbal, on the authority of Sa'id ibn\\n\\t\\t\\t\\tal-Musayyab). Nevertheless, the severity with which the\\n\\t\\t\\t\\tQur'an condemns riba and those who practice it furnishes\\n\\t\\t\\t\\t- especially when viewed against the background of\\n\\t\\t\\t\\tmankind's economic experiences during the intervening\\n\\t\\t\\t\\tcenturies - a sufficiently clear indication of its nature\\n\\t\\t\\t\\tand its social as well as moral implications. Roughly\\n\\t\\t\\t\\tspeaking, the opprobrium of riba (in the sense in which\\n\\t\\t\\t\\tthis term is used in the Qur'an and in many sayings of\\n\\t\\t\\t\\tthe Prophet) attaches to profits obtained through\\n\\t\\t\\t\\tinterest-bearing loans involving an exploitation of the\\n\\t\\t\\t\\teconomically weak by the strong and resourceful: an\\n\\t\\t\\t\\texploitation characterized by the fact that the lender,\\n\\t\\t\\t\\twhile retaining full ownership of the capital loaned and\\n\\t\\t\\t\\thaving no legal concern with the purpose for which it is\\n\\t\\t\\t\\tto be used or with the manner of its use, remains\\n\\t\\t\\t\\tcontractually assured of gain irrespective of any losses\\n\\t\\t\\t\\twhich the borrower may suffer in conseqence of this\\n\\t\\t\\t\\ttransaction. With this definition in mind, we realize\\n\\t\\t\\t\\tthat the question as to what kinds of financial\\n\\t\\t\\t\\ttransactions fall within the category of riba is, in the\\n\\t\\t\\t\\tlast resort, a moral one, closely connected with the\\n\\t\\t\\t\\tsocio-economic motivation underlying the mutual\\n\\t\\t\\t\\trelationship of borrower and lender; and, stated in\\n\\t\\t\\t\\tpurely economic terms, it is a question as to how profits\\n\\t\\t\\t\\tand risks may be equitably shared by both partners to a\\n\\t\\t\\t\\tloan transaction. It is, of course, impossible to answer\\n\\t\\t\\t\\tthis double question in a rigid, once-for-all manner: our\\n\\t\\t\\t\\tanswers must necessarily vary in accordance with the\\n\\t\\t\\t\\tchanges to which man's social and technological\\n\\t\\t\\t\\tdevelopment - and, thus, his economic environment - is\\n\\t\\t\\t\\tsubject. Hence, while the Qur'anic condemnation of the\\n\\t\\t\\t\\tconcept and practice of riba is unequivocal and final,\\n\\t\\t\\t\\tevery successive Muslim generation is faced with the\\n\\t\\t\\t\\tchallenge of giving new dimensions and a fresh economic\\n\\t\\t\\t\\tmeaning to this term which, for want of a better word,\\n\\t\\t\\t\\tmay be rendered as \"usury\". - In the present instance\\n\\t\\t\\t\\t(which, as I have mentioned, is the earliest in the\\n\\t\\t\\t\\thistory of the Qur'an), no clear-cut prohibition is as\\n\\t\\t\\t\\tyet laid down; but the prohibition appearing in  2:275 \\n\\t\\t\\t\\tff. is already foreshadowed by the reference to the\\n\\t\\t\\t\\timmoral hope of increasing one's own substance \"through\\n\\t\\t\\t\\t[other] people's possessions\", i.e., through the exploitation of others."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "39",
    "NoteID": "36",
    "Body": "Cf.  2:276 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "40",
    "NoteID": "37",
    "Body": "Lit., \"any of your [God-]partners\". Cf. note [15] on\\n\\t\\t\\t\\t 6:22 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "41",
    "NoteID": "38",
    "Body": "The prefix li in li-yudhiqahum does not indicate here a\\n\\t\\t\\t\\tpurport or intent (\"so that\" or \"in order that\"), but is\\n\\t\\t\\t\\ta lam al-'aqibah, i.e., a prefix expressing a factual\\n\\t\\t\\t\\tconsequence (best rendered as \"thereupon\" or \"and so\")."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "41",
    "NoteID": "39",
    "Body": "Thus, the growing corruption and destruction of our\\n\\t\\t\\t\\tnatural environment, so awesomely - if as yet only\\n\\t\\t\\t\\tpartially - demonstrated in our time, is here predicted\\n\\t\\t\\t\\tas \"an outcome of what men's hands have wrought\", i.e.,\\n\\t\\t\\t\\tof that self-destructive - because utterly materialistic\\n\\t\\t\\t\\t- inventiveness and frenzied activity which now threatens\\n\\t\\t\\t\\tmankind with previously unimaginable ecological\\n\\t\\t\\t\\tdisasters: an unbridled pollution of land, air and water\\n\\t\\t\\t\\tthrough industrial and urban waste, a progressive\\n\\t\\t\\t\\tpoisoning of plant and marine life, all manner of genetic\\n\\t\\t\\t\\tmalformations in men's own bodies through an\\n\\t\\t\\t\\tever-widening use of drugs and seemingly \"beneficial\"\\n\\t\\t\\t\\tchemicals, and the gradual extinction of many animal\\n\\t\\t\\t\\tspecies essential to human well-being. To all this may be\\n\\t\\t\\t\\tadded the rapid deterioration and decomposition of man's\\n\\t\\t\\t\\tsocial life, the all-round increase in sexual perversion,\\n\\t\\t\\t\\tcrime and violence, with, perhaps, nuclear annhihilation\\n\\t\\t\\t\\tas the ultimate stage: all of which is, in the last\\n\\t\\t\\t\\tresort, an outcome of man's oblivion of God and, hence,\\n\\t\\t\\t\\tof all absolute values, and their supersession by the\\n\\t\\t\\t\\tbelief that material \"progress\" is the only thing that\\n\\t\\t\\t\\tmatters."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "42",
    "NoteID": "40",
    "Body": "I.e., they worshipped material comfort and power, and\\n\\t\\t\\t\\tthus lost sight of all spiritual values and, in the end,\\n\\t\\t\\t\\tdestroyed themselves."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "43",
    "NoteID": "41",
    "Body": "See verse {30} above, as well as the corresponding notes;\\n\\t\\t\\t\\talso  3:19  - \"the only [true] religion in the sight of\\n\\t\\t\\t\\tGod is [man's] self-surrender unto Him\"."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "46",
    "NoteID": "42",
    "Body": "The mention of God's messages, interpolated by me between\\n\\t\\t\\t\\tbrackets, is justified by the verses which precede and\\n\\t\\t\\t\\tfollow this passage. Moreover, it is only by means of\\n\\t\\t\\t\\tsuch an interpolation that the symbolic purport of the\\n\\t\\t\\t\\tabove reference to \"the winds that bear glad tidings\" can\\n\\t\\t\\t\\tbe made fully obvious."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "47",
    "NoteID": "43",
    "Body": "Lit.. \"did We send apostles to their [own] people\": see\\n\\t\\t\\t\\tnote [96] on  10:74 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "48",
    "NoteID": "44",
    "Body": "As in verse {46} above, the reference to \"the winds\" has\\n\\t\\t\\t\\there a symbolic significance, namely, spiritual life and\\n\\t\\t\\t\\thope; hence my interpolation."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "51",
    "NoteID": "45",
    "Body": "The particle la'in (lit., \"indeed, if . . .\") is often\\n\\t\\t\\t\\tused in the Qur'an to express the recurrent, typical\\n\\t\\t\\t\\tcharacter of the attitude or situation referred to in the\\n\\t\\t\\t\\tsequence; in all such cases it may be suitably rendered\\n\\t\\t\\t\\tas \"thus it is: if . . .\", etc."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "51",
    "NoteID": "46",
    "Body": "For a full explanation of this verse, see  11:9  and the\\n\\t\\t\\t\\tcorresponding notes [16-19]."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "53",
    "NoteID": "47",
    "Body": "Cf. the identical passage in {27:80-81} and the\\n\\t\\t\\t\\tcorresponding note [72]."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "54",
    "NoteID": "48",
    "Body": "In the original, this sentence is formulated in the past\\n\\t\\t\\t\\ttense (\"has created you\" and \"has ordained\"), stressing\\n\\t\\t\\t\\tthe recurrent character of man's life-phases. In\\n\\t\\t\\t\\ttranslation, this recurrence can be suitably expressed by\\n\\t\\t\\t\\tusing the present tense."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "55",
    "NoteID": "49",
    "Body": "This interpolation - the meaning of which is elliptically\\n\\t\\t\\t\\timplied here - shows the connection of the present\\n\\t\\t\\t\\tpassage with the preceding one, as well as with verses\\n\\t\\t\\t\\t{11-16} and {27}."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "55",
    "NoteID": "50",
    "Body": "The illusory character of man's earthbound concept of\\n\\t\\t\\t\\t\"time\" is brought out in the Qur'an in several places. In\\n\\t\\t\\t\\tthe above context stress is laid, firstly, on the\\n\\t\\t\\t\\trelativity of this concept - i.e., on the infinitesimal\\n\\t\\t\\t\\tshortness of our life on earth as compared with the\\n\\t\\t\\t\\ttimeless duration of life in the hereafter (cf., for\\n\\t\\t\\t\\tinstance,  10:45  or  17:52 ) - and, secondly, on the\\n\\t\\t\\t\\tresurrected sinners' self-deluding excuse that their life\\n\\t\\t\\t\\ton earth had been too short to allow them to realize\\n\\t\\t\\t\\ttheir errors and mend their ways. It is to this second\\n\\t\\t\\t\\taspect of the problem that the Qur'an alludes in the\\n\\t\\t\\t\\twords, \"thus were they wont to delude themselves\" (lit.,\\n\\t\\t\\t\\t\"to be turned away\", i.e., from the truth). For an\\n\\t\\t\\t\\texplanation of the verb yu'fikun, see surah {5}, note\\n\\t\\t\\t\\t[90]."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "56",
    "NoteID": "51",
    "Body": "See surah {16}, note [25]."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "56",
    "NoteID": "52",
    "Body": "Lit., \"with regard to (fi) God's revelation (kitab)\",\\n\\t\\t\\t\\ti.e., that the dead shall be resurrected and judged by\\n\\t\\t\\t\\tHim. It is to be noted that the verb labitha signifies\\n\\t\\t\\t\\t\"he waited [for something] or \"he was tardy [with regard\\n\\t\\t\\t\\tto something]\" as well as \"he stayed [in a place]\" or \"he\\n\\t\\t\\t\\tremained\". Evidently, in verse {55} ma labithu has the\\n\\t\\t\\t\\tmeaning of \"they had not stayed\" or \"remained\", while in\\n\\t\\t\\t\\tverse {56} labithtum denotes \"you have been tardy\" or\\n\\t\\t\\t\\t\"you have waited\"."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "56",
    "NoteID": "53",
    "Body": "Lit., \"you were wont not to know\" - i.e., \"you\\n\\t\\t\\t\\tpersistently closed your mind to this promise\"."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "58",
    "NoteID": "54",
    "Body": "See note [33] on the first clause of  39:27 ."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "59",
    "NoteID": "55",
    "Body": "For an explanation of God's \"sealing\" the hearts of such\\n\\t\\t\\t\\tpeople, see note [7] on  2:7."
  }
]
