[
  {
    "SurahNumber": "58",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "According to the classical commentators, this is a\\n\\t\\t\\t\\treference to the case of Khawlah (or Khuwaylah) bint\\n\\t\\t\\t\\tTha'labah, whose husband Aws ibn as-Samit divorced her by\\n\\t\\t\\t\\tpronouncing the arbitrary pre-Islamic oath known as zihar\\n\\t\\t\\t\\t(explained in note [3] on  33:4 ). When she pleaded\\n\\t\\t\\t\\tbefore the Prophet against this divorce - which deprived\\n\\t\\t\\t\\ther of all her marital rights and, at the same time, made\\n\\t\\t\\t\\tit impossible for her to remarry - the iniquitous custom\\n\\t\\t\\t\\tof zihar was abolished by the revelation of verses {2-4}\\n\\t\\t\\t\\tof this surah. - In view of the sequence, as well as of\\n\\t\\t\\t\\tseveral Traditions to this effect, there is no doubt that\\n\\t\\t\\t\\tthe above verse alludes, in the first instance, to the\\n\\t\\t\\t\\tdivine condemnation of zihar. However, the deliberately\\n\\t\\t\\t\\tunspecified reference to \"her who pleads concerning her\\n\\t\\t\\t\\thusband\" seems to point to all cases where a wife has\\n\\t\\t\\t\\treason to complain against her husband: that is to say,\\n\\t\\t\\t\\tnot merely to an appeal against an unjustified or cruel\\n\\t\\t\\t\\tdivorce, but also to a wife's demand for release from an\\n\\t\\t\\t\\tunbearable marriage. Such a dissolution of the\\n\\t\\t\\t\\tmarriage-tie at the wife's instance - termed khul' - is\\n\\t\\t\\t\\tfully sanctioned by the shari'ah on the basis of  2:229 \\n\\t\\t\\t\\tand a number of extremely well-authenticated Traditions.\\n\\t\\t\\t\\t(For a fuller discussion of this problem, see note [218]\\n\\t\\t\\t\\ton the second paragraph of  2:229 .)"
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "Lit., \"does hear the mutual contentions of both of you\\n\\t\\t\\t\\t(tahawurakuma)\", i.e., of husband and wife alike,\\n\\t\\t\\t\\tembracing with His infinite wisdom and justice the\\n\\t\\t\\t\\tinnermost motivations of both. Alternatively - if the\\n\\t\\t\\t\\tabove verse is understood as referring specifically to\\n\\t\\t\\t\\tthe case of Khawlah - the second person indicated by the\\n\\t\\t\\t\\tsuffix kuma (\"both of you\") may relate to the Prophet,\\n\\t\\t\\t\\twho, before the revelation of this surah, thought that a\\n\\t\\t\\t\\tdivorce through zihar was valid and, therefore,\\n\\t\\t\\t\\trepeatedly told Khawlah, \"Thou art now indeed unlawful to\\n\\t\\t\\t\\thim\" (Tabari). This opinion was subsequently - almost\\n\\t\\t\\t\\timmediately - reversed by the divine prohibition of zihar\\n\\t\\t\\t\\texpressed in verses {2} ff."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "For this explanatory rendering of the verb yuzahirun, see\\n\\t\\t\\t\\tsurah {33}, note [3]. My interpolation of the word\\n\\t\\t\\t\\t\"henceforth\" is necessary in view of the fact that the\\n\\t\\t\\t\\tcustom of zihar - in its sense of a definitive act of\\n\\t\\t\\t\\tdivorce - had been abolished by verses {2-4} of the\\n\\t\\t\\t\\tpresent surah."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "2",
    "NoteID": "4",
    "Body": "For this particular rendering of the term munkar, see\\n\\t\\t\\t\\tsurah {16}, note [109]."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "3",
    "NoteID": "5",
    "Body": "I.e., the freeing or purchasing the freedom of a slave or\\n\\t\\t\\t\\tcaptive. In modern times, when slavery is more or less\\n\\t\\t\\t\\tnon-existent, the concept of tahrir raqabah may, I\\n\\t\\t\\t\\tbelieve, be legitimately extended to the redeeming of a\\n\\t\\t\\t\\thuman being from the bondage of debt or of great poverty."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "3",
    "NoteID": "6",
    "Body": "Cf.  2:225  - \"God will not take you to task for oaths\\n\\t\\t\\t\\twhich you may have uttered without thought, but will take\\n\\t\\t\\t\\tyou to task [only] for what your hearts have conceived\\n\\t\\t\\t\\t[in earnest]\"."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "4",
    "NoteID": "7",
    "Body": "I.e., in the manner prescribed for fasting during the\\n\\t\\t\\t\\tmonth of Ramadan (see {2:183-187}). As regards the phrase\\n\\t\\t\\t\\t\"he who does not find the wherewithal (lam yajid)\", it\\n\\t\\t\\t\\tmay indicate either a lack of financial means or the\\n\\t\\t\\t\\timpossibility of finding anyone else who could be\\n\\t\\t\\t\\tredeemed from factual or figurative bondage (see note [5]\\n\\t\\t\\t\\tabove). According to many Islamic scholars of our times\\n\\t\\t\\t\\t(e.g., Rashid Rida', commenting on  4:92 ), this relates,\\n\\t\\t\\t\\tin the first instance, to circumstances in which \"slavery\\n\\t\\t\\t\\twill have been abolished in accordance with the aim of\\n\\t\\t\\t\\tIslam\" (Manar V, 337)."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "4",
    "NoteID": "8",
    "Body": "Or, alternatively, one needy person for sixty days. The\\n\\t\\t\\t\\tinability to fast for two consecutive months may be due\\n\\t\\t\\t\\teither to ill-health or to really compelling external\\n\\t\\t\\t\\tcircumstances (for instance, the necessity of performing\\n\\t\\t\\t\\tlabours which require great physical and/or mental vigour\\n\\t\\t\\t\\tand alertness)."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "4",
    "NoteID": "9",
    "Body": "Sc., \"by showing that you have renounced the practices of\\n\\t\\t\\t\\tthe Time of Ignorance\" (Razi). In other words, the\\n\\t\\t\\t\\tpronouncement of zihar is not to be considered a divorce,\\n\\t\\t\\t\\tas was the case in pre-Islamic times, but solely as a\\n\\t\\t\\t\\treprehensible act which must be atoned for by a\\n\\t\\t\\t\\tsacrifice."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "5",
    "NoteID": "10",
    "Body": "Sc., \"which they chose to disregard\". Thus, proceeding\\n\\t\\t\\t\\tfrom the particular to the general, the present passage\\n\\t\\t\\t\\tconnects with the reference, at the end of verse {4}, to\\n\\t\\t\\t\\t\"all who deny the truth\", i.e., of divine revelation."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "8",
    "NoteID": "11",
    "Body": "The prohibition referred to here arises from the Qur'anic\\n\\t\\t\\t\\tstatement, \"No good comes, as a rule, out of secret\\n\\t\\t\\t\\tconfabulations - save those which are devoted to\\n\\t\\t\\t\\tenjoining charity, or equitable dealings, or setting\\n\\t\\t\\t\\tthings to rights between people\" (see  4:114  and the\\n\\t\\t\\t\\tcorresponding note [138]). Although there is no doubt\\n\\t\\t\\t\\tthat, as the classical commentators point out, the\\n\\t\\t\\t\\t\"secret confabulations\" spoken of in this passage relate\\n\\t\\t\\t\\tto intrigues aimed against the Prophet and his followers\\n\\t\\t\\t\\tby some of their unbelieving contemporaries, there is no\\n\\t\\t\\t\\tdoubt, either, that the passage has a general import, and\\n\\t\\t\\t\\tis, therefore, valid for all times."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "8",
    "NoteID": "12",
    "Body": "I.e., in the wider sense, disobedience to the Apostle's\\n\\t\\t\\t\\tethical teachings."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "8",
    "NoteID": "13",
    "Body": "The reference to \"approaching\" the Prophet has here a\\n\\t\\t\\t\\ttwofold meaning, relating literally to his unbelieving\\n\\t\\t\\t\\tcontemporaries, and figuratively to an intellectual\\n\\t\\t\\t\\t\"approach\" to his person and his teachings by hostile\\n\\t\\t\\t\\tcritics of all later times. The same observation is valid\\n\\t\\t\\t\\twith regard to the next clause as well."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "8",
    "NoteID": "14",
    "Body": "Lit., \"with which God has never saluted thee\".\\n\\t\\t\\t\\tHistorically, this is an allusion to the hostile attitude\\n\\t\\t\\t\\tof the Jews of Medina towards the Prophet. It is recorded\\n\\t\\t\\t\\tthat instead of pronouncing the traditional greeting\\n\\t\\t\\t\\t\"Peace be upon thee\" when encountering him, some of them\\n\\t\\t\\t\\tused to mumble the word salam (\"peace\") in such a way as\\n\\t\\t\\t\\tto make it indistinguishable from sam (\"death\"); and they\\n\\t\\t\\t\\temployed the same scurrilous play of words with regard to\\n\\t\\t\\t\\tthe Prophet's Companions as well. (The relevant ahadith\\n\\t\\t\\t\\tare quoted in full, with indication of the sources, by\\n\\t\\t\\t\\tTabari and Ibn Kathir in their commentaries on the above\\n\\t\\t\\t\\tverse.) But see also the preceding note."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "8",
    "NoteID": "15",
    "Body": "Sc., \"if Muhammad is truly a prophet\"."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "9",
    "NoteID": "16",
    "Body": "See note [12]."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "10",
    "NoteID": "17",
    "Body": "I.e., in and by itself, the force of evil epitomized in\\n\\t\\t\\t\\tthe concept of \"Satan\" has no power whatever: cf.  14:22 \\n\\t\\t\\t\\t- \"I had no power at all over you: I but called you - and\\n\\t\\t\\t\\tyou responded unto me. Hence, blame not me, but blame\\n\\t\\t\\t\\tyourselves.\" (See also Razi's views quoted in my note\\n\\t\\t\\t\\t[31] on the above-mentioned verse.) As regards the\\n\\t\\t\\t\\tproblem of God's \"letting\" or \"allowing\" a person to go\\n\\t\\t\\t\\tastray (implied in the phrase \"unless it be by God's\\n\\t\\t\\t\\tleave\"), see note [4] on  14:4 ."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "11",
    "NoteID": "18",
    "Body": "Lit., \"in the assemblies (al-majalis)\". Although it is\\n\\t\\t\\t\\tfrequently assumed that this refers to the assemblies\\n\\t\\t\\t\\theld by the Prophet, when his followers would throng\\n\\t\\t\\t\\taround him in their eagerness the better to hear what he\\n\\t\\t\\t\\thad to say, or - more generally - to congregations in\\n\\t\\t\\t\\tmosques, etc., in later times, I am (with Razi) of the\\n\\t\\t\\t\\topinion that the plural noun majalis is used here in a\\n\\t\\t\\t\\ttropical or metaphorical sense, denoting the totality of\\n\\t\\t\\t\\tmen's social life. Taken in this sense, the \"making room\\n\\t\\t\\t\\tfor one another\" implies the mutual providing of\\n\\t\\t\\t\\topportunities for a decent life to all - and especially\\n\\t\\t\\t\\tto the needy or handicapped - members of the community.\\n\\t\\t\\t\\tSee also next note."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "11",
    "NoteID": "19",
    "Body": "Commenting on this passage, Razi says: \"This verse\\n\\t\\t\\t\\tindicates that if one widens the means (abwab) of\\n\\t\\t\\t\\thappiness and well-being of God's creatures ('ibad), God\\n\\t\\t\\t\\twill widen for him all that is good in this life and in\\n\\t\\t\\t\\tthe hereafter. Hence, no reasonable person (al-'aqil)\\n\\t\\t\\t\\tcould ever restrict [the purport of] this verse to merely\\n\\t\\t\\t\\tmaking room for one another in an [actual] assembly.\""
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "11",
    "NoteID": "20",
    "Body": "The interpretation implied in the words \"for a good deed\"\\n\\t\\t\\t\\tinterpolated by me above is analogous to that offered by\\n\\t\\t\\t\\tmost of the classical commentators, and most explicitly\\n\\t\\t\\t\\tby Tabari; in the words of Qatadah (ibid.), \"Whenever you\\n\\t\\t\\t\\tare called upon to do a good deed, respond to this call.\""
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "11",
    "NoteID": "21",
    "Body": "Cf. the saying of the Prophet: \"The superiority of a\\n\\t\\t\\t\\tlearned man ('alim) over a [mere] worshipper ('abid) is\\n\\t\\t\\t\\tlike the superiority of the moon on the night when it is\\n\\t\\t\\t\\tfull over all other stars\" (Ibn Hanbal, Abu Da'ud,\\n\\t\\t\\t\\tTirmidhi, Nasa'i, Ibn Majah and Darimi)."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "12",
    "NoteID": "22",
    "Body": "This call to an exercise of charity on every occasion\\n\\t\\t\\t\\t(bayna yaday) of one's \"consultation\" with God's Apostle\\n\\t\\t\\t\\thas been widely misunderstood as applying only to factual\\n\\t\\t\\t\\tconsultations with him, i.e., in his lifetime, supposedly\\n\\t\\t\\t\\twith a view to lessening the encroachments on his time by\\n\\t\\t\\t\\tsome of his too-eager followers. This misunderstanding,\\n\\t\\t\\t\\ttogether with the qualified dispensation from the\\n\\t\\t\\t\\tabove-mentioned injunction expressed in the next verse,\\n\\t\\t\\t\\thas given rise to the unwarranted contention by some of\\n\\t\\t\\t\\tthe commentators that this injunction has been\\n\\t\\t\\t\\t\"abrogated\". But apart from the fact that the theory of\\n\\t\\t\\t\\t\"abrogation\" as such is entirely untenable (see  2:106 \\n\\t\\t\\t\\tand the corresponding note [87]), the above verse reveals\\n\\t\\t\\t\\tits true meaning as soon as we realize that the term \"the\\n\\t\\t\\t\\tApostle\" (ar-rasul) is used in the Qur'an not merely to\\n\\t\\t\\t\\tdesignate the unique person of the Prophet Muhammad but\\n\\t\\t\\t\\talso the sum-total of the teachings conveyed by him to\\n\\t\\t\\t\\tthe world. This is evident from the many Qur'anic\\n\\t\\t\\t\\texhortations, \"Pay heed unto God and the Apostle\", and,\\n\\t\\t\\t\\tmore specifically (in  4:59 ), \"if you are at variance\\n\\t\\t\\t\\tover any matter, refer it unto God [i.e., the Qur'an] and\\n\\t\\t\\t\\tthe Apostle [i.e., his sunnah]\", which latter is but\\n\\t\\t\\t\\tmeant to elucidate the former."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "12",
    "NoteID": "23",
    "Body": "Lit., \"if you do not find\", sc., anyone on whom to bestow\\n\\t\\t\\t\\tcharity at that particular moment, or have - for whatever\\n\\t\\t\\t\\treason - no opportunity to exercise it."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "13",
    "NoteID": "24",
    "Body": "I.e., the obligatory tax (zakah) which is meant to purify\\n\\t\\t\\t\\ta believer's possessions and income from the taint of\\n\\t\\t\\t\\tselfishness: implying that one's inability to do more by\\n\\t\\t\\t\\tway of charity does not constitute a sin."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "14",
    "NoteID": "25",
    "Body": "For the meaning of \"God's condemnation\", see note [4] on\\n\\t\\t\\t\\tthe last verse of Al-Fatihah. In this particular context,\\n\\t\\t\\t\\tthe ones \"who would be friends with people whom God has\\n\\t\\t\\t\\tcondemned\" are the half-hearted who - while dimly\\n\\t\\t\\t\\tperceiving the truth of God's existence and\\n\\t\\t\\t\\tself-revelation - are nevertheless unwilling to surrender\\n\\t\\t\\t\\tthemselves to this truth for fear of estranging\\n\\t\\t\\t\\tthemselves from their God-denying environment and, thus,\\n\\t\\t\\t\\tof losing what they regard as the material advantages of\\n\\t\\t\\t\\ta spiritually uncommitted life: and it is this moral\\n\\t\\t\\t\\tfalsehood to which the last sentence of this verse\\n\\t\\t\\t\\trefers. (See also the last verse of surah {60}.)"
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "16",
    "NoteID": "26",
    "Body": "I.e., by sowing doubts in other people's hearts."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "18",
    "NoteID": "27",
    "Body": "Namely, that their preference of worldly benefits to a\\n\\t\\t\\t\\tspiritual commitment is \"reasonable\" and, therefore, morally\\n\\t\\t\\t\\t\"justified\". It is to this flagrant self-deception that\\n\\t\\t\\t\\tthe next sentence refers."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "18",
    "NoteID": "28",
    "Body": "The definite article al prefixed to the participial noun\\n\\t\\t\\t\\tkadhibun indicates that the people thus characterized\\n\\t\\t\\t\\thave reached the utmost degree of self-deception; hence\\n\\t\\t\\t\\tmy interpolation of the adjective \"greatest\" in\\n\\t\\t\\t\\tconsonance with Zamakhshari's interpretation of the above\\n\\t\\t\\t\\tphrase."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "22",
    "NoteID": "29",
    "Body": "The operative phrase of this passage is contained in the\\n\\t\\t\\t\\twords, \"anyone who contends against (man hadda) God and\\n\\t\\t\\t\\tHis Apostle\": i.e., anyone who is engaged in active\\n\\t\\t\\t\\thostility against God's message and the person or the\\n\\t\\t\\t\\tteachings of His Apostle. As regards relations with\\n\\t\\t\\t\\tnon-believers who are not actively hostile to Islam, the\\n\\t\\t\\t\\tQur'an explicitly permits and implicitly ordains in many\\n\\t\\t\\t\\tplaces (e.g., in {60:8-9}) kindness and friendliness\\n\\t\\t\\t\\ttowards them."
  },
  {
    "SurahNumber": "58",
    "AyahNumber": "22",
    "NoteID": "30",
    "Body": "For my rendering of ruh as \"inspiration\" or,\\n\\t\\t\\t\\toccasionally, as \"divine inspiration\", see note [2] on\\n\\t\\t\\t\\t 16:2 . As pointed out by Zamakhshari, the pronominal\\n\\t\\t\\t\\tsuffix in minhu may relate either to God - as in my\\n\\t\\t\\t\\trendering - or to the believers' faith, in which latter\\n\\t\\t\\t\\tcase the phrase could be rendered as \"strengthened with\\n\\t\\t\\t\\tinspiration [flowing] therefrom\"."
  }
]
