[
  {
    "SurahNumber": "26",
    "AyahNumber": "1",
    "NoteID": "3137",
    "Body": "This is a combination of three Abbreviated Letters, as to\\n\\t\\t\\t\\twhich, generally, see Appendix I, printed at the end of\\n\\t\\t\\t\\tS.ii."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "2",
    "NoteID": "3138",
    "Body": "Cf. v. 17, and n. 716. The comparison of Allah's\\n\\t\\t\\t\\trevelation with Light is continued."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "3",
    "NoteID": "3139",
    "Body": "\"They\" are the Pagans of Makkah. From a human point of\\n\\t\\t\\t\\tview it was a great disappointment to Allah's Messenger\\n\\t\\t\\t\\tin the middle period of his Makkan ministry that the\\n\\t\\t\\t\\tMakkan could not be brought to believe in the Truth."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "4",
    "NoteID": "3140",
    "Body": "If it had been Allah's Will and Plan to force people's\\n\\t\\t\\t\\twill, He could quite easily have forced the Makkans. But\\n\\t\\t\\t\\tHis Will and Plan work differently. His revelation is\\n\\t\\t\\t\\tmeant to train man's own will so that it conforms to\\n\\t\\t\\t\\tAllah's beneficent purpose."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "6",
    "NoteID": "3141",
    "Body": "They may laugh at Allah's Message of righteousness, but\\n\\t\\t\\t\\tthey will soon see the power of Truth and realise the\\n\\t\\t\\t\\treal significance of the movement which they opposed.\\n\\t\\t\\t\\tWhere were the Pagans of Makkah after Badr, and still\\n\\t\\t\\t\\tmore, after the bloodless surrender of Makkah? And the\\n\\t\\t\\t\\tmeaning may be applied universally in all history."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "7",
    "NoteID": "3142",
    "Body": "If evil has a little run in this life, let them not run\\n\\t\\t\\t\\taway with the notion that the world is for evil. They\\n\\t\\t\\t\\thave only to look round at the physical and moral world\\n\\t\\t\\t\\taround them, and they would be undeceived. But they are\\n\\t\\t\\t\\tblind and without the Faith (the Light) which would open\\n\\t\\t\\t\\ttheir eyes."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "9",
    "NoteID": "3143",
    "Body": "One Who is able to carry out all His Will and Plans. See\\n\\t\\t\\t\\tn. 2818 to xxii. 40."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "10",
    "NoteID": "3144",
    "Body": "The part of the story of Moses told here is how Moses\\n\\t\\t\\t\\tfelt diffident about undertaking his commission; how\\n\\t\\t\\t\\tAllah reassured him; how he went to Pharaoh with \"the\\n\\t\\t\\t\\tSigns\"; how Pharaoh and his people rejected him; how\\n\\t\\t\\t\\ttheir blasphemy recoiled on themselves, but the cause of\\n\\t\\t\\t\\tAllah triumphed; in other words the point here is the\\n\\t\\t\\t\\treaction of a wicked people to the light that was held up\\n\\t\\t\\t\\tto them, considered in its relation to the mind of\\n\\t\\t\\t\\tAllah's Messenger."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "13",
    "NoteID": "3145",
    "Body": "As we should say in English, \"My heart would fail me, and\\n\\t\\t\\t\\tmy tongue cleave to my mouth.\" Moses had an impediment in\\n\\t\\t\\t\\this speech, and his mission was risky: see next note. But\\n\\t\\t\\t\\tAllah's Plan works in wondrous ways. Aaron was given to\\n\\t\\t\\t\\tassist him in his mission, and Moses's shortcomings were\\n\\t\\t\\t\\ttransformed by Allah's grace into power, so that he\\n\\t\\t\\t\\tbecame the most powerful leader of Israel."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "14",
    "NoteID": "3146",
    "Body": "Moses was brought up in the palace of Pharaoh, as\\n\\t\\t\\t\\tnarrated in his personal story in xx. 3940 and n. 2563.\\n\\t\\t\\t\\tWhen he was grown-up he saw an Egyptian smiting an\\n\\t\\t\\t\\tIsraelite, and as the Israelites were being generally\\n\\t\\t\\t\\toppressed by the Egyptians, Moses's anger was roused, and\\n\\t\\t\\t\\the slew the Egyptian. He then fled to the Midianite\\n\\t\\t\\t\\tcountry in the Sinai peninsula, where he received the\\n\\t\\t\\t\\tdivine commission. But the charge of slaying the Egyptian\\n\\t\\t\\t\\twas hanging against him. He was also apparently\\n\\t\\t\\t\\tquick-tempered. But Allah's grace cured his temper and he\\n\\t\\t\\t\\tbecame wise; his impediment in speech, for he stood up\\n\\t\\t\\t\\tboldly to speak to Pharaoh; and his fear, for he dared\\n\\t\\t\\t\\tthe Egyptians with Allah's Signs, and they were afraid of\\n\\t\\t\\t\\thim."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "18",
    "NoteID": "3147",
    "Body": "There is here a little play of wit on the part of\\n\\t\\t\\t\\tPharaoh. When Moses speaks of the \"Lord and Cherisher of\\n\\t\\t\\t\\tthe Worlds\", Pharaoh says: \"Who cherished you? Did we not\\n\\t\\t\\t\\tbring you up as a child? Did you not grow up among us?\"\\n\\t\\t\\t\\tBy implication Pharaoh suggest that he is the cherisher\\n\\t\\t\\t\\tof Moses, and in any case Pharaoh laid claim to godhead\\n\\t\\t\\t\\thimself."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "19",
    "NoteID": "3148",
    "Body": "Further, Pharaoh reminds Moses of his having slain the\\n\\t\\t\\t\\tEgyptian, and taunts him: \"You are not only a murderer:\\n\\t\\t\\t\\tyou are an ungrateful wretch\" (using kafir again in a\\n\\t\\t\\t\\tdouble sense) \"to have killed one of the race that\\n\\t\\t\\t\\tbrought you up!\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "20",
    "NoteID": "3149",
    "Body": "What is Moses's reply? He is no longer afraid. He tells\\n\\t\\t\\t\\tthe whole truth, extenuating nothing in his own favour.\\n\\t\\t\\t\\t\"Yes I did it: but I did it under an error.\" There are\\n\\t\\t\\t\\tthree implications in this: \"(1) I was wrong in doing it\\n\\t\\t\\t\\tin a temper and in being hasty; (2) I was wrong in taking\\n\\t\\t\\t\\tthe law into my own hands, but I repented and asked for\\n\\t\\t\\t\\tAllah's pardon (xxviii. 15-16); (3) that was at a time\\n\\t\\t\\t\\twhen I was under your influence, but since then I am a\\n\\t\\t\\t\\tchanged man, as Allah has called me.\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "21",
    "NoteID": "3150",
    "Body": "He accounts for all his movements, much more than Pharaoh\\n\\t\\t\\t\\thad asked for. He has nothing to hide. At that time he\\n\\t\\t\\t\\twas under the influence of fear, and he had fled from\\n\\t\\t\\t\\thim. Now he is serving Allah, the Lord of the Worlds. He\\n\\t\\t\\t\\thas no fear: he is a messenger."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "22",
    "NoteID": "3151",
    "Body": "Pharaoh had called Moses ungrateful and reproached him\\n\\t\\t\\t\\twith all the favours which Moses had received from the\\n\\t\\t\\t\\tEgyptians. \"What favours?\" he says; \"Do you count it also\\n\\t\\t\\t\\tas a favour to me that you have enslaved my brethren the\\n\\t\\t\\t\\tChildren of Israel?\" Moses was now speaking as a Prophet\\n\\t\\t\\t\\tof Allah, not as an individual. Any individual favours he\\n\\t\\t\\t\\tmay have received were blotted out by the oppression of\\n\\t\\t\\t\\this people."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "23",
    "NoteID": "3152",
    "Body": "Moses having eliminated all personalities, the argument\\n\\t\\t\\t\\tnow comes up to the highest plane of all,-the attributes\\n\\t\\t\\t\\tof Allah and His mercies. Moses had put forward this\\n\\t\\t\\t\\tbefore, as implied in verse 16 above, but Pharaoh had\\n\\t\\t\\t\\ttwisted it into personalities. Now we come back to the\\n\\t\\t\\t\\treal issue. It may have been in the same sitting, or it\\n\\t\\t\\t\\tmay have been in a later sitting."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "25",
    "NoteID": "3153",
    "Body": "Moses had stirred up the wrath of Pharaoh both by putting\\n\\t\\t\\t\\tforward the name of the One True God as against Pharaoh's\\n\\t\\t\\t\\tpretended godhead, and by suggesting that any man of\\n\\t\\t\\t\\tjudgment would understand Allah's majesty. While Pharaoh\\n\\t\\t\\t\\tturns to his people in indignation, Moses drives the nail\\n\\t\\t\\t\\tin further: \"He is the God of the heavens and the earth\\n\\t\\t\\t\\tand all between: therefore He is also your God, and the\\n\\t\\t\\t\\tGod of your fathers from the beginning. Any other\\n\\t\\t\\t\\tpretensions are false!\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "27",
    "NoteID": "3154",
    "Body": "Pharaoh is further perturbed. In reply to Moses's\\n\\t\\t\\t\\tstatement that Allah, the One True God is also the God of\\n\\t\\t\\t\\tthe Egyptians and Pharaoh also, Pharaoh says\\n\\t\\t\\t\\tsarcastically to his Court: \"Look at this 'Messenger' of\\n\\t\\t\\t\\tyours; he seems to be mad!\" But Moses is not abashed. He\\n\\t\\t\\t\\tboldly says what is the truth: \"It is you who are mad!\\n\\t\\t\\t\\tThe God Whom I preach is the universal Lord,-of the East\\n\\t\\t\\t\\tand of the West. He reigns wherever you go!\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "29",
    "NoteID": "3155",
    "Body": "Now we come to the crisis. Pharaoh threatens Moses with\\n\\t\\t\\t\\tprison for treason. Moses remains calm and still argues:\\n\\t\\t\\t\\t\"What if I show you a miracle? Will it convince you that\\n\\t\\t\\t\\tI am not mad, and that I have behind me the Lord of all\\n\\t\\t\\t\\tthe Worlds?\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "30",
    "NoteID": "3156",
    "Body": "The Egyptians were addicted to magic and sorcery. If a\\n\\t\\t\\t\\ttrue miracle were shown to them, would they believe?\\n\\t\\t\\t\\tPerhaps they would see the hollowness of their own magic.\\n\\t\\t\\t\\tIn fact this actually happened with the Egyptian\\n\\t\\t\\t\\tsorcerers themselves and perhaps with the commonalty. But\\n\\t\\t\\t\\tPharaoh and his Court were too arrogant to accept Moses's\\n\\t\\t\\t\\treligion."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "33",
    "NoteID": "3157",
    "Body": "Cf. vii. 107-8. See the whole passage there, and the\\n\\t\\t\\t\\tnotes thereon."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "34",
    "NoteID": "3158",
    "Body": "In vii. 109 it is the Chiefs who say this. The fact is\\n\\t\\t\\t\\tthat it was a general consultation, and this was the\\n\\t\\t\\t\\tgeneral feeling, expressed in words by each to the\\n\\t\\t\\t\\tothers."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "38",
    "NoteID": "3159",
    "Body": "A day well-known: a solemn day of festival: see xx. 59.\\n\\t\\t\\t\\tThe object was to get together as large a concourse of\\n\\t\\t\\t\\tpeople as possible. It was confidently expected that the\\n\\t\\t\\t\\tEgyptian sorcerers with all their organisation would win\\n\\t\\t\\t\\twith their tricks against these amateur Israelites, and\\n\\t\\t\\t\\tso the State cult of the worship of Pharaoh would be\\n\\t\\t\\t\\tfastened on the necks of the people more firmly than\\n\\t\\t\\t\\tever."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "40",
    "NoteID": "3160",
    "Body": "See the last note. The people are to come and witness the\\n\\t\\t\\t\\ttriumph of the State religion, so that they may become\\n\\t\\t\\t\\tthe more obedient to Pharaoh and more compliant with the\\n\\t\\t\\t\\tdemands of the priests. The State religion included magic\\n\\t\\t\\t\\tand the worship of Pharaoh."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "41",
    "NoteID": "3161",
    "Body": "There was no such thing as pure loyalty to an exploiting\\n\\t\\t\\t\\truler like this Pharaoh. The sorcerers, who were probably\\n\\t\\t\\t\\talso priests, were venal, and they hoped to establish\\n\\t\\t\\t\\ttheir own hold on both king and people by the further\\n\\t\\t\\t\\tenrichment of themselves and their order."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "43",
    "NoteID": "3162",
    "Body": "The euphemism implies a taunt, as if Moses had said: \"I\\n\\t\\t\\t\\tknow about your tricks! You pretend to throw ropes and\\n\\t\\t\\t\\trods, and make people believe they are snakes. But now\\n\\t\\t\\t\\tcome on!\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "44",
    "NoteID": "3163",
    "Body": "Though Pharaoh claimed to be a god. And so they appeal to\\n\\t\\t\\t\\this \"divine\" power."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "45",
    "NoteID": "3164",
    "Body": "The sorcerers' ropes and rods seemed to have become\\n\\t\\t\\t\\tserpents, but the rod of Moses was mightier than all of\\n\\t\\t\\t\\tthem and quickly swallowed them up. So truth is more\\n\\t\\t\\t\\tpowerful than tricks and win expose and destroy them."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "49",
    "NoteID": "3165",
    "Body": "The sorcerers knew that they had met something very\\n\\t\\t\\t\\tdifferent from their tricks. Allah's power worked on them\\n\\t\\t\\t\\tand they professed the True God. As they represented the\\n\\t\\t\\t\\tintelligence of the community, it may be presumed that\\n\\t\\t\\t\\tthey carried the intelligence of Egypt with them and\\n\\t\\t\\t\\tperhaps some of the commonalty, who were impressed by the\\n\\t\\t\\t\\tdramatic scene! Hence Pharaoh's anger, but it is the\\n\\t\\t\\t\\tbeginning of his decline!"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "51",
    "NoteID": "3166",
    "Body": "This is the core of the lesson enforced in this passage.\\n\\t\\t\\t\\tWhat was the reaction of the environment to the Light or\\n\\t\\t\\t\\tMessage of Allah? (1) It transformed Moses so that he\\n\\t\\t\\t\\tbecame a fearless leader, one of the foremost in faith.\\n\\t\\t\\t\\t(2) From men like Pharaoh and his corrupt court, it\\n\\t\\t\\t\\tcalled forth obstinacy, spite, and all the tricks and\\n\\t\\t\\t\\tsnares of evil, but Evil was defeated on its own ground.\\n\\t\\t\\t\\t(3) The magicians were touched by the glorious Light of\\n\\t\\t\\t\\tAllah, and they were ready to suffer tortures and death,\\n\\t\\t\\t\\ttheir sole ambition (in their transformed state) being to\\n\\t\\t\\t\\tbe foremost in Faith!"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "52",
    "NoteID": "3167",
    "Body": "The rest of the story-of the plagues of Egypt-is passed\\n\\t\\t\\t\\tover as not germane to the present argument. We come now\\n\\t\\t\\t\\tto the story of Israel leaving Egypt, pursued by Pharaoh.\\n\\t\\t\\t\\tHere again there are three contrasts: (1) the blind\\n\\t\\t\\t\\tarrogance of the Egyptians, against the development of\\n\\t\\t\\t\\tAllah's Plan; (2) the Faith of Moses, against the fears\\n\\t\\t\\t\\tof his people; and (3) the final deliverance of the\\n\\t\\t\\t\\tIsraelites against the destruction of the host of brute\\n\\t\\t\\t\\tforce."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "57",
    "NoteID": "3168",
    "Body": "In deference to almost unanimous authority I have\\n\\t\\t\\t\\ttranslated this passage (verses 58-60) as if it were a\\n\\t\\t\\t\\tparenthetical statement of Allah's purpose."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "59",
    "NoteID": "3169",
    "Body": "The Children of Israel certainly inherited the gardens,\\n\\t\\t\\t\\tsprings, treasures, and honourable positions in Palestine\\n\\t\\t\\t\\tafter many years' wanderings in the wilderness. But when\\n\\t\\t\\t\\tthey were false to Allah, they lost them again, and\\n\\t\\t\\t\\tanother people (the Muslims) inherited them when they\\n\\t\\t\\t\\twere true in Faith. \"Of such things\": literally, \"of\\n\\t\\t\\t\\tthem\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "60",
    "NoteID": "3170",
    "Body": "The story is here resumed after the parenthesis of verses\\n\\t\\t\\t\\t58-60."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "62",
    "NoteID": "3171",
    "Body": "Guide me: i.e., show me some way of escape from danger.\\n\\t\\t\\t\\tThis actually happened for Pharaoh's host was drowned.\\n\\t\\t\\t\\tThe faith of Moses stands in strong contrast to the fears\\n\\t\\t\\t\\tof his people."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "64",
    "NoteID": "3172",
    "Body": "The miracle was twofold: (1) Moses with his people passed\\n\\t\\t\\t\\tsafely through the sea; and (2) Pharaoh and his great\\n\\t\\t\\t\\thost were drowned in the sea."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "67",
    "NoteID": "3173",
    "Body": "As it was then, so it is now. In spite of the obvious\\n\\t\\t\\t\\tSigns of Allah, people who are blind in their obstinate\\n\\t\\t\\t\\tresistance to Truth accomplish their own destruction,\\n\\t\\t\\t\\twhile humble, persecuted men of Faith are transformed by\\n\\t\\t\\t\\tthe Light of Allah, and obtain salvation."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "68",
    "NoteID": "3174",
    "Body": "Nothing that the powers of evil can do, will ever defeat\\n\\t\\t\\t\\tthe merciful Purpose of Allah. Evil, in resisting good,\\n\\t\\t\\t\\twill effect its own destruction."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "69",
    "NoteID": "3175",
    "Body": "For the argument of this Sura the incidents in Abraham's\\n\\t\\t\\t\\tlife are not relevant and are not mentioned. What is\\n\\t\\t\\t\\tmentioned is: (1) the steps by which he taught about the\\n\\t\\t\\t\\tsin of false worship, in the form of a Dialogue; (2) the\\n\\t\\t\\t\\taims of a righteous man not only in his individual life,\\n\\t\\t\\t\\tbut for his ancestors and posterity, in the form of a\\n\\t\\t\\t\\tPrayer; and (3) a picture of the Future Judgment, in the\\n\\t\\t\\t\\tform of a vision. (1) is covered by verses 70-82; (2) by\\n\\t\\t\\t\\t83-87; and (3) by 88-102."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "71",
    "NoteID": "3176",
    "Body": "They want to show their true and assiduous devotion. But\\n\\t\\t\\t\\tAbraham goes at once to the heart of the matter by\\n\\t\\t\\t\\tasking: \"To whom is your devotion paid? Is the object\\n\\t\\t\\t\\tworthy of it?\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "77",
    "NoteID": "3177",
    "Body": "The things that you worship are enemies to mankind: let\\n\\t\\t\\t\\tme testify from my own personal experience: they are\\n\\t\\t\\t\\tenemies to me: they can do me no good, but would lead me\\n\\t\\t\\t\\tastray. Contrast with their impotence or their power of\\n\\t\\t\\t\\tmischief the One True God Whom I worship: He created me\\n\\t\\t\\t\\tand all the Worlds: He cherishes me and guides me; He\\n\\t\\t\\t\\ttakes care of me; and when I die, He will give me new\\n\\t\\t\\t\\tlife; He will forgive me and grant me final Salvation.\\n\\t\\t\\t\\tWill you then come to this true worship? How can you\\n\\t\\t\\t\\tdoubt, after seeing the contrast of the one with the\\n\\t\\t\\t\\tother? Is it not as the contrast between Light and\\n\\t\\t\\t\\tDarkness?'"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "83",
    "NoteID": "3178",
    "Body": "Having shown clearly the distinction between the False\\n\\t\\t\\t\\tand the True, Abraham now shows in the formn of a Prayer\\n\\t\\t\\t\\twhat his inmost wishes are. (1) He wants his own soul\\n\\t\\t\\t\\tentightened with divine wisdom, and (2) his heart and\\n\\t\\t\\t\\tlife filled with righteousness; (3) he will not be\\n\\t\\t\\t\\tcontent with working for himself or his own generation:\\n\\t\\t\\t\\this view extends to all future generations; (4) and of\\n\\t\\t\\t\\tcourse he wishes to attain the goal of the righteous, the\\n\\t\\t\\t\\tGarden of the Bliss of the Divine Countenance; but he is\\n\\t\\t\\t\\tnot content with this; for (5) he wants his father and\\n\\t\\t\\t\\trelatives to share in his spiritual joy, so that he can\\n\\t\\t\\t\\tproudly see all whom he can reach, in an honourable\\n\\t\\t\\t\\tstation (contrasted with disgrace) on the Day of\\n\\t\\t\\t\\tJudgment."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "84",
    "NoteID": "3179",
    "Body": "Cf. xix. 50. The whole of the passage about Abraham there\\n\\t\\t\\t\\tmay be compared with this passage."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "88",
    "NoteID": "3180",
    "Body": "Now we have a vision of the Day of Judgment. Nothing will\\n\\t\\t\\t\\tthen avail except a pure heart; all sorts of the\\n\\t\\t\\t\\tso-called \"good deeds\" of this world, without the motive\\n\\t\\t\\t\\tof purity, will be useless. The contrast of the Garden of\\n\\t\\t\\t\\tBliss with the Fire of Misery will be plainly visible.\\n\\t\\t\\t\\tEvil will be shown in its true colours,-isolated,\\n\\t\\t\\t\\thelpless, cursing and despairing; and all chances will\\n\\t\\t\\t\\tthen have been lost."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "90",
    "NoteID": "3181",
    "Body": "The Good will only see good (the Garden of Bliss), and\\n\\t\\t\\t\\tthe Evil will only see evil (the Fire of Hell). The type\\n\\t\\t\\t\\tof this contrast is shown to us in the world of our\\n\\t\\t\\t\\tspiritual sense even in this life."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "94",
    "NoteID": "3182",
    "Body": "The false gods, being devils or personified false\\n\\t\\t\\t\\tfancies, will be all involved in the punishment of Hell,\\n\\t\\t\\t\\ttogether with their worshippers, and the ultimate sources\\n\\t\\t\\t\\tof evil, the hosts of Iblis or Satan."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "97",
    "NoteID": "3183",
    "Body": "Error-manifest.- 'our error is now plainly manifest, but\\n\\t\\t\\t\\tit should have been manifest to us before it was too\\n\\t\\t\\t\\tlate, because the Signs of Allah were always around us'.\\n\\t\\t\\t\\tThis will be said by the ungodly, whose eyes will then be\\n\\t\\t\\t\\tfully opened."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "99",
    "NoteID": "3184",
    "Body": "They now see that the people who seduced them were\\n\\t\\t\\t\\tthemselves evil and subject to the penalities of evil,\\n\\t\\t\\t\\tand their seductions were frauds. They feel that they\\n\\t\\t\\t\\tought to have seen it before. For who would deliberately\\n\\t\\t\\t\\tfollow the paths of those condemned to misery and\\n\\t\\t\\t\\tpunishment? How simple they were not to see the true\\n\\t\\t\\t\\tcharacter of their seducers, though they had been warned\\n\\t\\t\\t\\tagain and again against them! It was their own folly that\\n\\t\\t\\t\\tmade them accept such obviously false guidance!"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "102",
    "NoteID": "3185",
    "Body": "This apparent longing for a chance of return is\\n\\t\\t\\t\\tdishonest. If they were sent back, they would certainly\\n\\t\\t\\t\\tretum to their evil ways: vi. 27-28. Besides, they have\\n\\t\\t\\t\\thad numerous chances already in this life, and they have\\n\\t\\t\\t\\tused them for mischief or evil."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "106",
    "NoteID": "3186",
    "Body": "Noah's generation had lost all faith and abandoned\\n\\t\\t\\t\\tthemselves to evil. They had rejected the Message of\\n\\t\\t\\t\\tmessengers previously sent to the world. Noah was sent to\\n\\t\\t\\t\\tthem as one of themselves (\"their brother\"). His life was\\n\\t\\t\\t\\topen before them: he had proved himself pure in heart and\\n\\t\\t\\t\\tconduct (like the holy Prophet of Islam long after him),\\n\\t\\t\\t\\tand worthy of every trust. Would they fear Allah and\\n\\t\\t\\t\\tfollow his advice? They could see that he had no ends of\\n\\t\\t\\t\\this own to serve. Would they not listen to him?"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "107",
    "NoteID": "3187",
    "Body": "Amin=one to whom a trust has been given, with several\\n\\t\\t\\t\\tshades of meaning implied: e.g., (1) worthy of trust, (2)\\n\\t\\t\\t\\tbound to deliver his trust, as a prophet is bound to\\n\\t\\t\\t\\tdeliver his Message, (3) bound to act entirely as\\n\\t\\t\\t\\tdirected by the trust, as a prophet is bound to give only\\n\\t\\t\\t\\tthe Message of Allah, and not add anything of his own,\\n\\t\\t\\t\\tand (4) not seeking any interest of his own."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "110",
    "NoteID": "3188",
    "Body": "Note how the repetition rounds off the argument. See n.\\n\\t\\t\\t\\t3186 above."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "111",
    "NoteID": "3189",
    "Body": "The leaders of the people are speaking, as the Quraish\\n\\t\\t\\t\\tleaders spoke in the time of the holy Prophet. \"We know\\n\\t\\t\\t\\tthat thou hast been trustworthy in thy life. But look at\\n\\t\\t\\t\\tthe 'tag rag and bob tail' that follow thee! Dost thou\\n\\t\\t\\t\\texpect us to be like them or to be classed with them?\"\\n\\t\\t\\t\\tHis answer was: \"I know nothing against them; if they\\n\\t\\t\\t\\thave done any wrong, or are only hypocrites, they are\\n\\t\\t\\t\\tanswerable to Allah; how can I drive them away from me,\\n\\t\\t\\t\\tseeing that I am expressly sent to admonish all people?\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "114",
    "NoteID": "3190",
    "Body": "Cf. xi. 29. All people who have faith have the right to\\n\\t\\t\\t\\tcome and listen to Allah's Word and receive Allah's\\n\\t\\t\\t\\tMercy, whether they are publicans and sinners, \"Harijans\"\\n\\t\\t\\t\\tand low-caste men, men of \"superior\" or \"inferior\" races.\\n\\t\\t\\t\\tThe Prophet of Allah welcomes them all, as His Message\\n\\t\\t\\t\\thas to shine before the whole world."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "116",
    "NoteID": "3191",
    "Body": "Two other cases occur to me where prophets of Allah were\\n\\t\\t\\t\\tthreatened with death by stoning: one was Abraham (xix.\\n\\t\\t\\t\\t46), and the other was Shu'aib (xi. 91). In neither case\\n\\t\\t\\t\\tdid the threats deter them from carrying out their\\n\\t\\t\\t\\tmission. On the contrary the threats recoiled on those\\n\\t\\t\\t\\twho threatened. So also did it happen in the case of Noah\\n\\t\\t\\t\\tand the holy Prophet."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "119",
    "NoteID": "3192",
    "Body": "The story of Noah's Flood is told in xi. 36-48. Here the\r\\n\\t\\t\\t\\tpoint emphasised is Noah's patience and constancy against\r\\n\\t\\t\\t\\tthreats, and the triumph and preservation of Allah's\r\\n\\t\\t\\t\\tTruth even though the world was raging against it."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "121",
    "NoteID": "3193",
    "Body": "Ibis and the following verse run like a refrain\\n\\t\\t\\t\\tthroughout this Sura, and give the key-note to the\\n\\t\\t\\t\\tsubject-matter: how the Message of Allah is preached, how\\n\\t\\t\\t\\tit is rejected in all ages, and how it triumphs at last,\\n\\t\\t\\t\\tthrough the Mercy of Allah. See xxvi. 8-9, 68-69,\\n\\t\\t\\t\\t103-104, here (121-122), 139-140, 158-159, 174-175, and\\n\\t\\t\\t\\t190-191."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "123",
    "NoteID": "3194",
    "Body": "See n. 1040 to vii. 65 for the 'Ad people and their\\n\\t\\t\\t\\tlocation. Here the emphasis is on the fact that they were\\n\\t\\t\\t\\tmaterialists believing in brute force, and felt secure in\\n\\t\\t\\t\\ttheir fortresses and resources, but were found quite\\n\\t\\t\\t\\thelpless when Allah's Message came and they rejected it."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "125",
    "NoteID": "3195",
    "Body": "See n. 3187 to xxvi. 107 above."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "128",
    "NoteID": "3196",
    "Body": "Any merely material civilisation prides itself on show\\n\\t\\t\\t\\tand parade. Its votaries scatter monuments for all sorts\\n\\t\\t\\t\\tof things in conspicuous places-monuments which\\n\\t\\t\\t\\tcommemorate deeds and events which are forgotten in a few\\n\\t\\t\\t\\tgenerations! Cf. Shelley's poem on Ozymandias: \"I am\\n\\t\\t\\t\\tOzymandias, King of Kings! Look on my works, ye mighty,\\n\\t\\t\\t\\tand despair! .... Boundless and bare the lonely and level\\n\\t\\t\\t\\tsands stretch far away!\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "130",
    "NoteID": "3197",
    "Body": "\"Without any responsibility or consideration for those\\n\\t\\t\\t\\twho come within your power?\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "131",
    "NoteID": "3198",
    "Body": "See n. 3188 above."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "132",
    "NoteID": "3199",
    "Body": "The gifts are described generally, immaterial and\\n\\t\\t\\t\\tmaterial. \"All that ye know\" includes not only material\\n\\t\\t\\t\\tthings, but knowledge and the faculties by which\\n\\t\\t\\t\\tknowledge may be used for human well-being, all that\\n\\t\\t\\t\\tmakes life beautiful and refined. \"Cattle\" means wealth\\n\\t\\t\\t\\tgenerally, and \"sons\" means population and man-power.\\n\\t\\t\\t\\t\"Gardens and Springs\" are things that contribute to the\\n\\t\\t\\t\\tdelight and pleasure of man."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "135",
    "NoteID": "3200",
    "Body": "\"But you have misused all those gifts, and you will\\n\\t\\t\\t\\tsuffer the inevitable penalties for your misuse and or\\n\\t\\t\\t\\tyour ingratitude. \""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "136",
    "NoteID": "3201",
    "Body": "\"We are not going to attend to you whether you preach to\\n\\t\\t\\t\\tus or not.\" The construction of the second clause, \"or be\\n\\t\\t\\t\\tnot among our admonishers\" is a rapier cut at Hud, as if\\n\\t\\t\\t\\tthey had said: \"Oh yes! we have heard plenty of\\n\\t\\t\\t\\tadmonishers like you!\" See the next verse."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "137",
    "NoteID": "3202",
    "Body": "They said, as many of our modern enemies of religion say,\\n\\t\\t\\t\\t\"you are only reviving an ancient superstition, a dope of\\n\\t\\t\\t\\tthe crowd; there is no such thing as a Hereafter, or the\\n\\t\\t\\t\\tsort of punishments you denounce!\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "141",
    "NoteID": "3203",
    "Body": "For the Thamud people see n. 1043 to vii. 73. They were\\n\\t\\t\\t\\tgreat builders in stone and a people with agricultural\\n\\t\\t\\t\\twealth, but they were an exclusive people and oppresed\\n\\t\\t\\t\\tthe poor. The point emphasised here is: \"How long will\\n\\t\\t\\t\\tyour wealth last, especially if you depress your own\\n\\t\\t\\t\\tpeople and dishonour Allah's Signs by sacrilege?\" The\\n\\t\\t\\t\\tinsciptions on the Thamud remains of rock-cut buildings\\n\\t\\t\\t\\tin Al-Hijr are described in the Appendix at the end of\\n\\t\\t\\t\\tthis Sura."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "148",
    "NoteID": "3204",
    "Body": "The date palm flowers on a long spathe: when the Howers\\n\\t\\t\\t\\tdevelop into fruit, the heavy ones hang with the load of\\n\\t\\t\\t\\tfruit. The Thamud evidently were proud of their skill in\\n\\t\\t\\t\\tproducing corn and fruit and in hewing fine dwellings out\\n\\t\\t\\t\\tof rocks, like the later dwellings of Roman times in the\\n\\t\\t\\t\\ttown of Petra."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "151",
    "NoteID": "3205",
    "Body": "They are told: \"All your skill is very well; but\\n\\t\\t\\t\\tcultivate virtue and do not follow the ways of those who\\n\\t\\t\\t\\tput forward extravagant claims for men's powers and\\n\\t\\t\\t\\tmaterial resources, or who lead lives of extravagance in\\n\\t\\t\\t\\tluxury and self-indulgence; that makes mischief: but the\\n\\t\\t\\t\\tdoor of repentance is open: will you repent?\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "153",
    "NoteID": "3206",
    "Body": "They think he is talking like a madman, and they say so."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "155",
    "NoteID": "3207",
    "Body": "For this she-camel, see n. 1044 to vii. 73. Thee\\n\\t\\t\\t\\tshe-camel was to be a Sign and a test-case. Would they\\n\\t\\t\\t\\trespect her rights of watering (and pasturage)?"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "157",
    "NoteID": "3208",
    "Body": "Their regrets were too late. They had themselves asked\\n\\t\\t\\t\\tfor a Sign. The Sign had been given to them in the\\n\\t\\t\\t\\tshe-camel, which their prophet Salih had put forward as a\\n\\t\\t\\t\\ttest-case. Would they, through that symbol, respect the\\n\\t\\t\\t\\tlaw of equity by which all people had rights in water and\\n\\t\\t\\t\\tin the gifts of nature? They refused to respect that law,\\n\\t\\t\\t\\tand committed sacrilege by deliberately killing the\\n\\t\\t\\t\\tshe-camel. They themselves came to an evil end."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "160",
    "NoteID": "3209",
    "Body": "The story of Lut (Lot) will be found in vii. 80-84: see\\n\\t\\t\\t\\tn. 1049. Here the point is that the people of the Cities\\n\\t\\t\\t\\tof the Plain were shamelessly addicted to vice against\\n\\t\\t\\t\\tnature, and Lut's warning only exasperated them, until\\n\\t\\t\\t\\tthey were destroyed by a shower of brimstone."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "167",
    "NoteID": "3210",
    "Body": "Their threat to cast him out has a grim significance in\\n\\t\\t\\t\\twhat actually happened. They were destroyed where they\\n\\t\\t\\t\\twere, and he was glad to escape the dreadful Punishment\\n\\t\\t\\t\\taccording to the warning he had received."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "168",
    "NoteID": "3211",
    "Body": "He was only among them from a stem sense of duty. The\\n\\t\\t\\t\\twhole atmosphere there was detestable to him, and he was\\n\\t\\t\\t\\tglad to escape when duty no longer demanded his presence\\n\\t\\t\\t\\tthere. He prayed for deliverance from such surroundings."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "171",
    "NoteID": "3212",
    "Body": "This was Lut's wife, who lingered behind and was among\\n\\t\\t\\t\\tthose who perished, See n. 1051 to vii. 83."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "173",
    "NoteID": "3213",
    "Body": "See n. 1052 to vii. 84."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "176",
    "NoteID": "3214",
    "Body": "See n. 2000 to xv. 78."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "177",
    "NoteID": "3215",
    "Body": "For Shu'aib see n. 1054 to vii. 85."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "181",
    "NoteID": "3216",
    "Body": "They were a commercial people, but they were given to\\n\\t\\t\\t\\tfraud, injustice, and wrongful mischief (by intermeddling\\n\\t\\t\\t\\twith others). They are asked to fear Allah and follow His\\n\\t\\t\\t\\tways: it is He Who also created their predecessors among\\n\\t\\t\\t\\tmankind, who never prospered by fraud and violent\\n\\t\\t\\t\\twrong-doing, but only justice and fair dealing."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "186",
    "NoteID": "3217",
    "Body": "They deny that he is a prophet or that they are doing\\n\\t\\t\\t\\twrong, or that any former generations behaved\\n\\t\\t\\t\\tdifferently. They think they are the true exponents of\\n\\t\\t\\t\\thuman nature, and that such as he-idealists-are mere\\n\\t\\t\\t\\tmadmen."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "187",
    "NoteID": "3218",
    "Body": "'If you really claim any real contact with Allah, let us\\n\\t\\t\\t\\tsee if you can bring down a piece of the sky to fall on\\n\\t\\t\\t\\tus!'"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "188",
    "NoteID": "3219",
    "Body": "The challenge to bring down a piece of the sky was merely\\n\\t\\t\\t\\tempty bravado, on the part of those who had called him a\\n\\t\\t\\t\\tliar. But Shuaib does not insult them. He merely says:\\n\\t\\t\\t\\t\"Allah is the best judge of your conduct: what more can I\\n\\t\\t\\t\\tsay?\" And Allah did punish them."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "189",
    "NoteID": "3220",
    "Body": "Perhaps a shower of ashes and cinders accompanying a\\n\\t\\t\\t\\tvolcanic eruption. If these people were the same as the\\n\\t\\t\\t\\tMidianites, there was also an earthquake. See vii. 91 and\\n\\t\\t\\t\\tn. 1063."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "189",
    "NoteID": "3221",
    "Body": "It must have been a terrible day of wholesale\\n\\t\\t\\t\\tdestruction-earthquake, volcanic eruption, lava, cinders\\n\\t\\t\\t\\tand ashes and rumbling noises to frighten those whose\\n\\t\\t\\t\\tdeath was not instantaneous."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "191",
    "NoteID": "3222",
    "Body": "See above, n. 3193 to xxvi. 121."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "192",
    "NoteID": "3223",
    "Body": "The hostile reception of some of the previous Messengers\\n\\t\\t\\t\\thaving been mentioned, the special characteristics of the\\n\\t\\t\\t\\tQur-an are now referred to, to show (1) that it is true,\\n\\t\\t\\t\\tand (2) that its rejection by the Makkan Pagans was of a\\n\\t\\t\\t\\tpiece with previous experience in the history of man:\\n\\t\\t\\t\\tvested interests resist Truth, but it conquers."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "193",
    "NoteID": "3224",
    "Body": "Ruh-ul-amin, the epithet of Gabriel, who came with the\\n\\t\\t\\t\\tinspired Messages to the holy Prophet, is difficult to\\n\\t\\t\\t\\trender in a single epithet in translation. In n. 3187 to\\n\\t\\t\\t\\txxvi. 107 I have described some of the various shades of\\n\\t\\t\\t\\tmeaning attached to the adjective Amin as applied to a\\n\\t\\t\\t\\tProphet. A further signification as attached to the\\n\\t\\t\\t\\tSpirit of Inspiration is that it is the very quintessence\\n\\t\\t\\t\\tof Faith and Truth, unlike the lying spirits which delude\\n\\t\\t\\t\\tmen with falsehood. On the whole, I think \"the Spirit of\\n\\t\\t\\t\\tFaith and Truth\" will represent the original best here."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "194",
    "NoteID": "3225",
    "Body": "Qalb (Heart) signifies not only the seat of the\\n\\t\\t\\t\\taffections, but also the seat of the memory and\\n\\t\\t\\t\\tunderstanding. The process of inspiration is indicated by\\n\\t\\t\\t\\tthe impression of the divine Message on the inspired\\n\\t\\t\\t\\tone's heart, memory, and understanding, from which it was\\n\\t\\t\\t\\tpromulgated in human speech to the world. In this case\\n\\t\\t\\t\\tthe human speech was the perspicuous Arabic tongue, which\\n\\t\\t\\t\\twould be plainly intelligible to the audience who would\\n\\t\\t\\t\\timmediately hear it and be through them transmitted to\\n\\t\\t\\t\\tall the world."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "196",
    "NoteID": "3226",
    "Body": "The word Zubur, used here, is plural of Zabur, which is\\n\\t\\t\\t\\tmentioned in the Qur-an as the Book revealed to the\\n\\t\\t\\t\\tprophet Da'ud. It has also been used in the Qur-an in\\n\\t\\t\\t\\tgeneric sense of \"Book\" (LIV: 52). Here the word refers\\n\\t\\t\\t\\tto the earlier Revelations."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "197",
    "NoteID": "3227",
    "Body": "Many of the Jewish Doctors recognised the holy Prophet's\\n\\t\\t\\t\\tMessage as a Message from Allah, e.g., 'Abdullah ibn\\n\\t\\t\\t\\tSalam and Mukhairiq. The latter was a man of property,\\n\\t\\t\\t\\twhich he left for Islam. (There were also Christian monks\\n\\t\\t\\t\\tand learned men who recognised the Prophet's mission.)"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "199",
    "NoteID": "3228",
    "Body": "The turn of Arabia having come for receiving Allah's\\n\\t\\t\\t\\tRevelation, as was foretold in previous Revelations, it\\n\\t\\t\\t\\twas inevitable that it should be in the Arab tongue\\n\\t\\t\\t\\tthrough the mouth of an Arab. Otherwise it would have\\n\\t\\t\\t\\tbeen unintelligible, and the Arabs could not have\\n\\t\\t\\t\\treceived the Faith and become the vehicles for its\\n\\t\\t\\t\\tpromulgation as actually happened in history."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "200",
    "NoteID": "3229",
    "Body": "\"Thus\" I think means through the medium of the Arabic\\n\\t\\t\\t\\tlanguage and the Arab people. The Qur-an penetrated\\n\\t\\t\\t\\tthrough their language and their hearts. If the\\n\\t\\t\\t\\thard-hearted among them did not believe, they will see\\n\\t\\t\\t\\twhen the Penalty comes, how grievous a mistake they made.\\n\\t\\t\\t\\tFor the Penalty must come; even when they least expected\\n\\t\\t\\t\\tit. They will be caught saying or thinking, \"There is\\n\\t\\t\\t\\tplenty of time; we can get another respite,\" when already\\n\\t\\t\\t\\tit will have become too late for them to turn over a new\\n\\t\\t\\t\\tleaf."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "204",
    "NoteID": "3230",
    "Body": "While some sinners out of negligence postpone the day of\\n\\t\\t\\t\\trepentance till it is too late, others more bold actually\\n\\t\\t\\t\\task out of bravado that Allah's Punishment should be\\n\\t\\t\\t\\tbrought down on them at once, as they do not believe in\\n\\t\\t\\t\\tAllah or His Punishment! The answer to them is: It will\\n\\t\\t\\t\\tcome soon enough-too soon, they will think, when it\\n\\t\\t\\t\\tcomes! Cf. xxii. 47 and notes."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "209",
    "NoteID": "3231",
    "Body": "Allah will grant much respite to sinners, for He is Most\\n\\t\\t\\t\\tGracious and Merciful. But all this respite will profit\\n\\t\\t\\t\\tthem nothing if they are merely immersed in the vanities\\n\\t\\t\\t\\tof this world. Again and again, in spite of their\\n\\t\\t\\t\\trebellion and their rejection, does Allah send warnings\\n\\t\\t\\t\\tand warners before the final Punishment of Justice. For\\n\\t\\t\\t\\tAllah knows human weakness, and He win never be unjust in\\n\\t\\t\\t\\tthe least."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "210",
    "NoteID": "3232",
    "Body": "When anything extraordinary happens, there are always\\n\\t\\t\\t\\tpeople desirous of putting the worst construction on it,\\n\\t\\t\\t\\tand saying that it is the work of Satans. So when the\\n\\t\\t\\t\\tQur-an came with its Message in wondrous Arabic, its\\n\\t\\t\\t\\tenemies could only account for its power by attributing\\n\\t\\t\\t\\tit to evil spirits! Such a beneficent message can never\\n\\t\\t\\t\\tsuit the purposes of Satans, nor would it be in their\\n\\t\\t\\t\\tpower to produce it. In fact Good and Evil are poles\\n\\t\\t\\t\\tasunder, and Evil cannot even hear words of Good, of\\n\\t\\t\\t\\ttender Pity for sinners and Forgiveness for the penitent!"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "215",
    "NoteID": "3233",
    "Body": "That is, be kind, gentle, and considerate with them, as a\\n\\t\\t\\t\\thigh flying bird is when she lowers her wing to her\\n\\t\\t\\t\\toffspring. Cf. xvii. 24 and n. 2205, and xv. 88 and n.\\n\\t\\t\\t\\t201 1."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "216",
    "NoteID": "3234",
    "Body": "\"Disobey thee\" implied that they did something wrong, for\\n\\t\\t\\t\\tthe holy Prophet commanded what was right and forbade\\n\\t\\t\\t\\twhat was wrong. If, then, any of his flock did wrong the\\n\\t\\t\\t\\tresponsibility was not his, for he, like a good shepherd,\\n\\t\\t\\t\\ttried to keep them right. What was he then to do? He\\n\\t\\t\\t\\twould continue his teaching. But if any of them went so\\n\\t\\t\\t\\tfar wrong as to try to injure their own Teacher, Leader,\\n\\t\\t\\t\\tand Guide, there was nothing for him to fear. His trust\\n\\t\\t\\t\\twas only in Allah, and Allah sees and appraises all men's\\n\\t\\t\\t\\tactions at their true worth."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "219",
    "NoteID": "3235",
    "Body": "Literally, the standing and prostration are postures in\\n\\t\\t\\t\\tMuslim prayer: the holy Prophet was equally earnest,\\n\\t\\t\\t\\tsincere, and zealous in prayer for himself and for all\\n\\t\\t\\t\\this people. The Prophet's behaviour was exemplary in all\\n\\t\\t\\t\\tthe turns of fortune, and however foolish men may cavil,\\n\\t\\t\\t\\this purity and uprightness are fully known to Allah."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "221",
    "NoteID": "3236",
    "Body": "To people who maliciously suggested that the holy Prophet\\n\\t\\t\\t\\twas possessed or inspired by evil spirits (xxvi. 210\\n\\t\\t\\t\\tabove) the reply had already been made, but it is now\\n\\t\\t\\t\\tdeclared that that suggestion is itself the work of Evil.\\n\\t\\t\\t\\tBehind such suggestions are lying and wickedness, or at\\n\\t\\t\\t\\tbest some half-truths caught up in hearsay and twisted so\\n\\t\\t\\t\\tas to show Allah in an evil light."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "224",
    "NoteID": "3237",
    "Body": "The Poets: to be read along with the exceptions mentioned\\n\\t\\t\\t\\tin verse 227 below. Poetry and other arts are not in\\n\\t\\t\\t\\tthemselves evil, but may on the contrary be used in the\\n\\t\\t\\t\\tservice of religion and righteousness. But there is a\\n\\t\\t\\t\\tdanger that they may be prostituted for base purposes. If\\n\\t\\t\\t\\tthey are insincere (\"they say what they do not\") or are\\n\\t\\t\\t\\tdivorced from actual life or its goodness or its serious\\n\\t\\t\\t\\tpurpose, they may become instruments of evil or futility.\\n\\t\\t\\t\\tThey then wander about without any set purpose, and seek\\n\\t\\t\\t\\tthe depths (valleys) of human folly rather than the\\n\\t\\t\\t\\theights of divine light."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "227",
    "NoteID": "3238",
    "Body": "Poetry and the fine arts which are to be commended are\\n\\t\\t\\t\\tthose which emanate from minds steeped in Faith, which\\n\\t\\t\\t\\ttry to carry out in life the fine sentiments they express\\n\\t\\t\\t\\tin their artistic work, aim at the glory of Allah rather\\n\\t\\t\\t\\tthan at self-glorification or the fulsome praise of men\\n\\t\\t\\t\\twith feet of clay, and do not (as in Jihad) attack\\n\\t\\t\\t\\tanything except aggressive evil. In this sense a perfect\\n\\t\\t\\t\\tartist should be a perfect man. Perfection may not be\\n\\t\\t\\t\\tattainable in this life, but it should be the aim of\\n\\t\\t\\t\\tevery man, and especially of one who wishes to become a\\n\\t\\t\\t\\tsupreme artist, not only in technique but in spirit and\\n\\t\\t\\t\\tessentials. Among the commendable poets contemporary with\\n\\t\\t\\t\\tthe holy Prophet may be mentioned Hassan and Labid: the\\n\\t\\t\\t\\tlatter had the honour of being one of the seven whose\\n\\t\\t\\t\\tpoems were selected for \"hanging\" (the Mu'allaqat) in the\\n\\t\\t\\t\\tDays of Ignorance."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "227",
    "NoteID": "3239",
    "Body": "These were the scurrilous rhymesters, who were doomed to\\n\\t\\t\\t\\tcome to an evil end."
  }
]
