[
  {
    "SurahNumber": "111",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "The real name of this uncle of the Prophet was 'Abd\\n\\t\\t\\t\\tal-'Uzza. He was popularly nicknamed Abu Lahab (lit., \"He\\n\\t\\t\\t\\tof the Flame\") on account of his beauty, which was most\\n\\t\\t\\t\\tnotably expressed in his glowing countenance (Baghawi, on\\n\\t\\t\\t\\tthe authority of Muqatil; Zamakhshari and Razi passim in\\n\\t\\t\\t\\ttheir comments on the above verse; Fath al-Bari VIII,\\n\\t\\t\\t\\t599). Since this nickname, or kunyah, appears to have\\n\\t\\t\\t\\tbeen applied to him even before the advent of Islam,\\n\\t\\t\\t\\tthere is no reason to suppose that it had a pejorative\\n\\t\\t\\t\\tsignificance. - The expression \"hands\" in the above\\n\\t\\t\\t\\tclause is, in accordance with classical Arabic usage, a\\n\\t\\t\\t\\tmetonym for \"power\", alluding to the great influence which Abu\\n\\t\\t\\t\\tLahab wielded."
  },
  {
    "SurahNumber": "111",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "The expression nar dhat lahab is a subtle play upon the\\n\\t\\t\\t\\tmeaning of the nickname Abu Lahab."
  },
  {
    "SurahNumber": "111",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "Lit., \"carrier of firewood\", a well-known idiomatic\\n\\t\\t\\t\\texpression denoting one who surreptitiously carries evil\\n\\t\\t\\t\\ttales and slander from one person to another \"so as to\\n\\t\\t\\t\\tkindle the flames of hatred between them\" (Zamakhshari;\\n\\t\\t\\t\\tsee also 'Ikrimah, Mujahid and Qatadah, as quoted by\\n\\t\\t\\t\\tTabari). The woman's name was Arwa umm Jamil bint Harb\\n\\t\\t\\t\\tibn Umayyah; she was a sister of Abu Sufyan and, hence, a\\n\\t\\t\\t\\tpaternal aunt of Mu'awiyah, the founder of the Umayyad\\n\\t\\t\\t\\tdynasty. Her hatred of Muhammad and his followers was so\\n\\t\\t\\t\\tintense that she would often, under the cover of\\n\\t\\t\\t\\tdarkness, scatter thorns before the Prophet's house with\\n\\t\\t\\t\\ta view to causing him hurt; and she employed her great\\n\\t\\t\\t\\teloquence in persistently slandering him and his message."
  },
  {
    "SurahNumber": "111",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "The term masad signifies anything that consists of\\n\\t\\t\\t\\ttwisted strands, irrespective of the material (Qamus,\\n\\t\\t\\t\\tMughni, Lisan al-'Arab). In the abstract sense in which\\n\\t\\t\\t\\tit is evidently used here, the above phrase seems to have\\n\\t\\t\\t\\ta double connotation: it alludes to the woman's twisted,\\n\\t\\t\\t\\twarped nature, as well as to the spiritual truth that\\n\\t\\t\\t\\t\"every human being's destiny is tied to his neck\" (see\\n\\t\\t\\t\\t 17:13  and, in particular, the corresponding note [17])\\n\\t\\t\\t\\t- which, together with verse {2}, reveals the general,\\n\\t\\t\\t\\ttimeless purport of this surah."
  }
]
