[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/057001",
        "Body":  "Whatever is in the heavens and on earth let it declare the\n\t\t\tPraises and Glory of Allah: for He is the Exalted in Might the\n\t\t\tWise. \u003cspan class=\u0027fn\u0027\u003e5275\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/057010",
        "Body":  "And what cause have ye why ye should not spend in the cause of\n\t\t\tAllah?\tFor to Allah belongs the heritage of the heavens and the\n\t\t\tearth.\tNot equal among you are those who spent (freely) and\n\t\t\tfought before the Victory (with those who did so later).  Those\n\t\t\tare higher in rank than those who spent (freely) and fought\n\t\t\tafterwards.  But to all has Allah promised a goodly (reward) and\n\t\t\tAllah is well-acquainted with all that ye do. \u003cspan class=\u0027fn\u0027\u003e5285\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5286\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/057011",
        "Body":  "Who is he that will loan to Allah a beautiful Loan? For (Allah)\n\t\t\twill increase it manifold to his credit and he will have\n\t\t\t(besides) a liberal reward. \u003cspan class=\u0027fn\u0027\u003e5287\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/057012",
        "Body":  "One Day shalt thou see the believing men and the believing women\n\t\t\thow their Light runs forward before them and by their right\n\t\t\thands: (their greeting will be): \"Good News for you this Day!\n\t\t\tGardens beneath which flow rivers! To dwell therein for aye! this\n\t\t\tis indeed the highest Achievement!\" \u003cspan class=\u0027fn\u0027\u003e5288\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5289\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/057013",
        "Body":  "One day will the Hypocrites men and women say to the Believers:\n\t\t\t\"Wait for us! let us borrow (a light) from your Light!\" It will\n\t\t\tbe said: \"turn ye back to your rear! then seek a light (where ye\n\t\t\tcan)!\" So a wall will be put up betwixt them with a gate therein.\n\t\t\t Within it will be Mercy throughout and without it all alongside\n\t\t\twill be (wrath and) Punishment! \u003cspan class=\u0027fn\u0027\u003e5290\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5291\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/057014",
        "Body":  "(Those without) will call out \"were we not with you?\" (The\n\t\t\tothers) will reply \"True! but ye led yourselves into temptation;\n\t\t\tye looked forward (to our ruin); ye doubted (Allah\u0027s promise);\n\t\t\tand (your false) desires deceived you; until there issued the\n\t\t\tCommand of Allah.  And the Deceiver deceived you in respect of\n\t\t\tAllah. \u003cspan class=\u0027fn\u0027\u003e5292\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5293\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/057015",
        "Body":  "\"This Day shall no ransom be accepted of you nor of those who\n\t\t\trejected Allah.  Your abode is the fire: That is the proper place\n\t\t\tto claim you: and an evil refuge it is!\" \u003cspan class=\u0027fn\u0027\u003e5294\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/057016",
        "Body":  "Has not the time arrived for the Believers that their hearts in\n\t\t\tall humility should engage in the remembrance of Allah and of the\n\t\t\ttruth which has been revealed (to them) and that they should not\n\t\t\tbecome like those to whom was given Revelation aforetime but long\n\t\t\tages passed over them and their hearts grew hard? For many among\n\t\t\tthem are rebellious transgressors. \u003cspan class=\u0027fn\u0027\u003e5295\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5296\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/057017",
        "Body":  "Know ye (all) that Allah giveth life to the earth after its\n\t\t\tdeath! already have We shown the Signs plainly to you that ye may\n\t\t\tlearn wisdom. \u003cspan class=\u0027fn\u0027\u003e5297\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/057018",
        "Body":  "For those who give in Charity men and women and loan to Allah a\n\t\t\tBeautiful Loan it shall be increased manifold (to their credit)\n\t\t\tand they shall have (besides) a liberal reward. \u003cspan class=\u0027fn\u0027\u003e5298\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/057019",
        "Body":  "And those who believe in Allah and His apostles they are the\n\t\t\tSincere (Lovers of truth) and the witnesses (who testify) in the\n\t\t\teyes of their Lord: they shall have their Reward and their Light\n\t\t\tbut those who reject Allah and deny Our Signs they are the\n\t\t\tCompanions of Hell-Fire. \u003cspan class=\u0027fn\u0027\u003e5299\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5300\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5301\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/057002",
        "Body":  "To Him belongs the dominion of the heavens and the earth; it is\n\t\t\tHe Who gives life and Death; and He has Power over all things."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/057020",
        "Body":  "Know ye (all) that the life of this world is but play and\n\t\t\tamusement pomp and mutual boasting and multiplying (in rivalry)\n\t\t\tamong yourselves riches and children: Here is a similitude: How\n\t\t\train and the growth which it brings forth delight (the hearts of)\n\t\t\tthe tillers; soon it withers; thou wilt see it grow yellow; then\n\t\t\tit becomes dry and crumbles away.  But in the Hereafter is a\n\t\t\tPenalty severe (for the devotees of wrong) and Forgiveness from\n\t\t\tAllah and (His) Good Pleasure (for the devotees of Allah).  And\n\t\t\twhat is the life of this world but goods and chattels of\n\t\t\tdeception? \u003cspan class=\u0027fn\u0027\u003e5302\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5303\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5304\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5305\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/057021",
        "Body":  "Be ye foremost (in seeking) forgiveness from your Lord and a\n\t\t\tGarden (of Bliss) the width whereof is as the width of heaven and\n\t\t\tearth prepared for those who believe in Allah and His apostles:\n\t\t\tthat is the Grace of Allah which He bestows on whom He pleases:\n\t\t\tand Allah is the Lord of Grace abounding. \u003cspan class=\u0027fn\u0027\u003e5306\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5307\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/057022",
        "Body":  "No misfortune can happen on earth or in your souls but is\n\t\t\trecorded in a decree before We bring it into existence: that is\n\t\t\ttruly easy for Allah: \u003cspan class=\u0027fn\u0027\u003e5308\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5309\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/057023",
        "Body":  "In order that ye may not despair over matters that pass you by\n\t\t\tnor exult over favors bestowed upon you.  For Allah loveth not\n\t\t\tany vainglorious boaster \u003cspan class=\u0027fn\u0027\u003e5310\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/057024",
        "Body":  "Such persons as are covetous and commend covetousness to men. \n\t\t\tAnd if any turn back (from Allah\u0027s Way) verily Allah is free of\n\t\t\tall needs worthy of all praise. \u003cspan class=\u0027fn\u0027\u003e5311\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5312\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/057025",
        "Body":  "We sent aforetime our apostles with Clear Signs and sent down\n\t\t\twith them the Book and the Balance (of Right and Wrong) that men\n\t\t\tmay stand forth in justice; and We sent down Iron in which is\n\t\t\t(material for) mighty war as well as many benefits for mankind\n\t\t\tthat Allah may test who it is that will help unseen Him and His\n\t\t\tapostles; for Allah is Full of Strength exalted in Might (and\n\t\t\table to enforce His will). \u003cspan class=\u0027fn\u0027\u003e5313\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5314\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5315\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5316\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5317\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/057026",
        "Body":  "And We sent Noah and Abraham and established in their line\n\t\t\tProphethood and Revelation: and some of them were on right\n\t\t\tguidance but many of them became rebellious transgressors.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5319\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/057027",
        "Body":  "Then in their wake We followed them up with (others of) Our\n\t\t\tapostles: We sent after them Jesus the son of Mary and bestowed\n\t\t\ton him the Gospel; and We ordained in the hearts of those who\n\t\t\tfollowed him Compassion and Mercy.  But the monasticism which\n\t\t\tthey invented for themselves We did not prescribe for them: (We\n\t\t\tcommanded) only the seeking for the Good pleasure of Allah; but\n\t\t\tthat they did not foster as they should have done.  Yet We\n\t\t\tbestowed on those among them who believed their (due) reward but\n\t\t\tmany of them are rebellious transgressors. \u003cspan class=\u0027fn\u0027\u003e5320\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5321\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5322\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5323\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5324\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/057028",
        "Body":  "O ye that believe! fear Allah and believe in His apostle and He\n\t\t\twill bestow on you a double portion of His Mercy: He will provide\n\t\t\tfor you a light by which ye shall walk (straight in your path)\n\t\t\tand He will forgive you (your past): For Allah is Oft-Forgiving. \n\t\t\tMost Merciful: \u003cspan class=\u0027fn\u0027\u003e5325\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5326\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5327\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5328\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/057029",
        "Body":  "That the People of the Book may know that they have no power\n\t\t\twhatever over the Grace of Allah that (His) Grace is (entirely)\n\t\t\tin his hand to bestow it on whomsoever He wills.  For Allah is\n\t\t\tthe Lord of Grace abounding. \u003cspan class=\u0027fn\u0027\u003e5329\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/057003",
        "Body":  "He is the First and the Last the Evident and the immanent: and He\n\t\t\thas full knowledge of all things. \u003cspan class=\u0027fn\u0027\u003e5276\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/057004",
        "Body":  "He it is Who created the heavens and the earth in six Days and is\n\t\t\tmoreover firmly established on the Throne (of authority).  He\n\t\t\tknows what enters within the earth and what comes forth out of it\n\t\t\twhat comes down from heaven and what mounts up to it.  And He is\n\t\t\twith you wheresoever ye may be.  And Allah sees well all that ye\n\t\t\tdo. \u003cspan class=\u0027fn\u0027\u003e5277\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5278\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5279\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/057005",
        "Body":  "To Him belongs the dominion of the heavens and the earth: and all\n\t\t\taffairs are referred back to Allah. \u003cspan class=\u0027fn\u0027\u003e5280\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/057006",
        "Body":  "He merges Night into Day and He merges Day into Night; and He has\n\t\t\tfull knowledge of the secrets of (all) hearts."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/057007",
        "Body":  "Believe in Allah and His Apostle and spend (in charity) out of\n\t\t\tthe (substance) whereof He has made you heirs.\tFor those of you\n\t\t\twho believe and spend (in charity) for them is a great Reward.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5281\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/057008",
        "Body":  "What cause have ye why ye should not believe in Allah? And the\n\t\t\tApostle invites you to believe in your Lord and has indeed taken\n\t\t\tyour Covenant if ye are men of faith. \u003cspan class=\u0027fn\u0027\u003e5282\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5283\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "57",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/057009",
        "Body":  "He is the One Who Sends to His Servants manifest Signs that He\n\t\t\tmay lead you from the depths of Darkness into the Light.  And\n\t\t\tverily Allah is to you Most Kind and Merciful. \u003cspan class=\u0027fn\u0027\u003e5284\u003c/span\u003e"
    }
]
