[
  {
    "SurahNumber": "7",
    "AyahNumber": "1",
    "Text": "Alif L'am M'im Suad."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "2",
    "Text": "This Book is revealed to you; let there be no hesitation in your\\n\\t\\t\\theart about it so that you may thereby warn the unbelievers and\\n\\t\\t\\tremind the believers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "3",
    "Text": "Say: \"O people, follow what has been brought down to you from\\n\\t\\t\\tyour Rabb and do not follow other patrons besides Him.\" Yet\\n\\t\\t\\tlittle do they take admonition."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "4",
    "Text": "How many towns have We destroyed for their sins? Our scourge took\\n\\t\\t\\tthem all of a sudden at night or while they were taking their\\n\\t\\t\\tafternoon rest,"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "5",
    "Text": "and when our scourge fell upon them, their only cry was: \"We have\\n\\t\\t\\tindeed been wrongdoers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "6",
    "Text": "On the Day of Judgement We shall question those to whom Rasools\\n\\t\\t\\twere sent and We shall also question the Rasools about Our\\n\\t\\t\\tmessage and its response."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "7",
    "Text": "Then We shall tell their whole story as an eye witness for We\\n\\t\\t\\twere never absent at any time or from any place."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "8",
    "Text": "On that Day, the scale of justice shall be established. Those\\n\\t\\t\\twhose scale of good deeds will be heavy, they are the ones who\\n\\t\\t\\twill attain felicity,"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "9",
    "Text": "and those whose scale is light, they shall find themselves in\\n\\t\\t\\tloss for they had done injustice to Our revelations."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "10",
    "Text": "We are the One Who established you on earth, and provided you\\n\\t\\t\\tmeans of your sustenance therein: yet little it is that you pay\\n\\t\\t\\tthanks."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "11",
    "Text": "Indeed We created you, then We fashioned you, then We asked the\\n\\t\\t\\tangels: \"Prostrate yourselves before Adam.\" They all prostrated\\n\\t\\t\\taccordingly except Iblees (Shaitan) who did not join those who\\n\\t\\t\\tprostrated."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "12",
    "Text": "Allah said: \"What prevented you from prostrating when I commanded\\n\\t\\t\\tyou?\" He replied: \"I am better than he; you created me from fire\\n\\t\\t\\tand him from clay.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "13",
    "Text": "Allah said: \"Get down from here. You have no right to brag here\\n\\t\\t\\tof your superiority. Get out, henceforth you are of the petty\\n\\t\\t\\tones.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "14",
    "Text": "Shaitan requested: \"Give me respite till the Day of\\n\\t\\t\\tResurrection.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "15",
    "Text": "Allah said: \"The respite you requested is hereby granted.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "16",
    "Text": "Shaitan declared: \"Since You let me deviate, now I will lie in\\n\\t\\t\\tambush for mankind on Your Right Way."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "17",
    "Text": "I Will come upon them from the front, from the rear, from the\\n\\t\\t\\tright, and from the left, and You will not find most of them to\\n\\t\\t\\tbe grateful.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "18",
    "Text": "Allah said: \"Get out from here, you despicable outcast; I will\\n\\t\\t\\tcertainly fill hell with you and all of them who follow you.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "19",
    "Text": "Allah said: \"O Adam! Dwell with your wife in paradise and eat any\\n\\t\\t\\tfruit you please; but never approach this tree or you shall both\\n\\t\\t\\tbecome wrongdoers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "20",
    "Text": "But Shaitan tempted them so that he might reveal to them the\\n\\t\\t\\tprivate parts of their bodies which they had never seen before.\\n\\t\\t\\tHe told them: \"Your Rabb has forbidden you to approach this tree\\n\\t\\t\\tonly to prevent you from becoming angels or immortals.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "21",
    "Text": "And he swore to them both: \"I am your sincere adviser.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "22",
    "Text": "Thus he cunningly seduced them, and when they ate from the tree,\\n\\t\\t\\ttheir shame became visible to them and they began to cover\\n\\t\\t\\tthemselves with the leaves of the garden. Then their Rabb called\\n\\t\\t\\tout to them: \"Did I not forbid you to approach that tree, and did\\n\\t\\t\\tnot I warn you that Shaitan was your open enemy?\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "23",
    "Text": "They both replied: \"Our Rabb! We have wronged our souls. If You\\n\\t\\t\\tdo not forgive us and have mercy on us, we shall certainly be of\\n\\t\\t\\tthe losers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "24",
    "Text": "Allah said: \"Go down, some of you are the enemy of others. The\\n\\t\\t\\tEarth will be your dwelling-place and your means of livelihood\\n\\t\\t\\tfor a fixed term.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "25",
    "Text": "He further said: \"Therein you shall live and therein you shall\\n\\t\\t\\tdie, and therefrom you shall be raised to life.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "26",
    "Text": "O children of Adam! We have sent down to you clothing to cover\\n\\t\\t\\tyour nakedness and as an adornment, however, the best clothing is\\n\\t\\t\\tthe clothing of piety. This is one of Allah's revelations so that\\n\\t\\t\\tthe people may learn a lesson."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "27",
    "Text": "O children of Adam! Let not Shaitan seduce you in the same manner\\n\\t\\t\\tas he seduced your parents out of paradise through stripping them\\n\\t\\t\\tof their clothing in order to expose their nakedness. He and his\\n\\t\\t\\ttribe watch you from where you cannot see them. We have permitted\\n\\t\\t\\tthe shaitans to be the guardians over the unbelievers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "28",
    "Text": "Whenever they commit a shameful deed, they say: \"We found our\\n\\t\\t\\tforefathers doing this and Allah Himself has commanded us to do\\n\\t\\t\\tso.\" Tell them: \"Nay! Allah never commands what is shameful. Do\\n\\t\\t\\tyou attribute to Allah something about which you have no\\n\\t\\t\\tknowledge?\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "29",
    "Text": "O Muhammad, say to them: \"My Rabb has commanded justice and that\\n\\t\\t\\tyou set your faces in the right direction at the time of every\\n\\t\\t\\tprayer and call on Him with true devotion. You shall return to\\n\\t\\t\\tHim as He created you in the beginning.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "30",
    "Text": "To one group He has guided while the other group deserved to be\\n\\t\\t\\tleft in error due to their own choice; for they took the shaitans\\n\\t\\t\\tfor their protectors instead of Allah yet they think that they\\n\\t\\t\\tare guided."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "31",
    "Text": "O Children of Adam! Put on your adornment (decent proper dress)\\n\\t\\t\\twhen you attend your Masjid at the time of every prayer. Eat and\\n\\t\\t\\tdrink, but do not be extravagant; surely He does not love the\\n\\t\\t\\textravagant."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "32",
    "Text": "O Muhammad, ask them: \"Who has forbidden you to wear decent\\n\\t\\t\\tclothes or to eat the good food which Allah has provided for His\\n\\t\\t\\tdevotees?\" Say: \"All these things are for the enjoyment of the\\n\\t\\t\\tbelievers in the life of this world though shared by others; but\\n\\t\\t\\tthese shall be exclusively theirs on the Day of Resurrection.\\n\\t\\t\\tThus do We make Our revelations clear for those who understand.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "33",
    "Text": "Say: \"My Rabb has forbidden all indecencies whether open or\\n\\t\\t\\tsecret, sin and rebellion against justice, committing shirk with\\n\\t\\t\\tAllah for which He has granted no sanction, and saying things\\n\\t\\t\\tabout Allah of which you have no knowledge."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "34",
    "Text": "For every nation there is a fixed term, when their term expires,\\n\\t\\t\\tit can neither be delayed for a moment nor can it be made to come\\n\\t\\t\\tearly.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "35",
    "Text": "O children of Adam! Whenever there come to you Rasools from among\\n\\t\\t\\tyou and recite to you My revelations, those who will become\\n\\t\\t\\trighteous and mend their ways will have nothing to fear or to\\n\\t\\t\\tregret;"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "36",
    "Text": "but those who deny Our revelations and treat them with arrogance,\\n\\t\\t\\tshall be the inmates of hellfire to live therein forever."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "37",
    "Text": "Who can be more unjust than the one who invents a lie against\\n\\t\\t\\tAllah or rejects His revelations? Such people will have their\\n\\t\\t\\tdestined portion from the Book (what was written for them to\\n\\t\\t\\treceive during their life on earth); until when Our messengers\\n\\t\\t\\t(angels of death) arrive to take away their souls, they will ask:\\n\\t\\t\\t\"Where are those gods whom you used to invoke besides Allah?\"\\n\\t\\t\\tThey will reply: \"They have forsaken us\" and they will bear\\n\\t\\t\\twitness against themselves (admit) that they were indeed kuffar\\n\\t\\t\\t(unbelievers)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "38",
    "Text": "Allah will say: \"Enter the fire and join the nations of Jinns and\\n\\t\\t\\tmen who have gone before you.\" As each nation will enter hell, it\\n\\t\\t\\twill curse its preceding sister till all are gathered there, the\\n\\t\\t\\tlast of them will say about the first one: \"Our Rabb! These have\\n\\t\\t\\tled us astray; therefore, give them double punishment of the\\n\\t\\t\\tfire.\" He will answer: \"There will be double for all, although\\n\\t\\t\\tyou may not know because of being predecessor or successor in sin\\n\\t\\t\\tand aggression.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "39",
    "Text": "Then the first will say to the last: \"If we were to blame, you\\n\\t\\t\\ttoo, were no better than us; now taste the punishment of your\\n\\t\\t\\tmisdeeds.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "40",
    "Text": "Surely, the gates of the Heaven will not be opened for those who\\n\\t\\t\\tdeny Our revelations and treat them with arrogance; their\\n\\t\\t\\tadmission into paradise will be as impossible as the passing of a\\n\\t\\t\\tcamel through the eye of a needle. That is how We shall reward\\n\\t\\t\\tthe criminals."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "41",
    "Text": "Hell shall be their bed and flames shall be their covering. That\\n\\t\\t\\tis how We shall reward the wrongdoers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "42",
    "Text": "As for those who believe and do good deeds - We never burden a\\n\\t\\t\\tsoul with more than it can bear - they are worthy of Paradise,\\n\\t\\t\\twherein they will live forever."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "43",
    "Text": "We shall remove whatever ill-feeling they may have in their\\n\\t\\t\\thearts against one another. Rivers will be flowing beneath them;\\n\\t\\t\\tand they will say: \"Praise be to Allah Who guided us this way, we\\n\\t\\t\\twould have never found the Right Way if Allah had not guided us.\\n\\t\\t\\tThe Rasools of our Rabb have surely preached us the truth.\" At\\n\\t\\t\\tthat time they will hear the announcement: \"This is paradise,\\n\\t\\t\\twhich you have inherited because of your good deeds.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "44",
    "Text": "The residents of paradise will call out to the inmates of the\\n\\t\\t\\thellfire: \"We have indeed found out the promises of our Rabb to\\n\\t\\t\\tbe true. Have you, too, found the promise of your Rabb to be\\n\\t\\t\\ttrue?\" \"Yes,\" they will answer, and a herald will proclaim among\\n\\t\\t\\tthem, \"the curse of Allah be upon those wrongdoers"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "45",
    "Text": "who hindered other people from the Way of Allah and sought to\\n\\t\\t\\tmake it crooked, and who did not believe in the hereafter.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "46",
    "Text": "Between the two, there shall be a veil, and on the A'raf\\n\\t\\t\\t(heights) there will be people who will recognize them by their\\n\\t\\t\\tfeatures. They will call out to the residents of Paradise: \"Peace\\n\\t\\t\\tbe upon you!\" They will not have yet entered it, though they will\\n\\t\\t\\thave the hope.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "47",
    "Text": "When their eyes shall turn towards the inmates of the hellfire\\n\\t\\t\\tthey will say: \"Our Rabb! Do not cast us among these wrongdoers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "48",
    "Text": "The people of the A'raf (heights) will call to certain men\\n\\t\\t\\t(famous personalities from among the inmates of Hell) whom they\\n\\t\\t\\twill recognize by their features and say: \"Have you found out\\n\\t\\t\\tthat neither your riches nor your arrogant pride have availed\\n\\t\\t\\tyou?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "49",
    "Text": "Are the residents of paradise not the same people about whom you\\n\\t\\t\\tswore that Allah will never bestow His mercy on them?\" Today the\\n\\t\\t\\tsame people are being welcomed with the words, \"Enter paradise,\\n\\t\\t\\tyou have nothing to fear or to regret.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "50",
    "Text": "Then the inmates of the fire will cry out to the residents of\\n\\t\\t\\tparadise: \"Give us some water or some of the food which Allah has\\n\\t\\t\\tprovided you.\" They will reply: \"Allah has prohibited both of\\n\\t\\t\\tthese things to the unbelievers,"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "51",
    "Text": "who took their religion to be mere amusement and play and were\\n\\t\\t\\tdeceived by their earthly life.\" Allah will say: \"Today We will\\n\\t\\t\\tforget them as they forgot the meeting of this Day; and mocked at\\n\\t\\t\\tOur revelations.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "52",
    "Text": "For We have certainly brought them a Book which provides clear\\n\\t\\t\\tdetails based on knowledge and which is a guidance and blessing\\n\\t\\t\\tfor the true believers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "53",
    "Text": "Now are these people waiting for anything other than the Day of\\n\\t\\t\\tFulfillment (Day of Judgement)? When the Day of Fulfillment will\\n\\t\\t\\tcome, those who have disregarded it, will say: \"Indeed the\\n\\t\\t\\tRasools of our Rabb had come with the truth. Are there any\\n\\t\\t\\tintercessors now, who could intercede on our behalf? Or could we\\n\\t\\t\\tbe sent back so that we would not do as we have done before.\" In\\n\\t\\t\\tfact they would have lost their souls and the things they had\\n\\t\\t\\tinvented will leave them in the lurch."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "54",
    "Text": "Surely your Rabb is Allah Who created the heavens and the earth\\n\\t\\t\\tin six Yome (time periods) and is firmly established on the\\n\\t\\t\\tthrone of authority. He makes the night cover the day and the day\\n\\t\\t\\tfollow the night automatically. He created the sun, the moon and\\n\\t\\t\\tthe stars; and made them subservient to His will. Take note: His\\n\\t\\t\\tis the creation, and His is the command. Blessed is Allah, the\\n\\t\\t\\tRabb of the worlds!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "55",
    "Text": "Call on your Rabb with humility and in private; for He does not\\n\\t\\t\\tlove the transgressors."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "56",
    "Text": "Do not create mischief in the land after it has been set in\\n\\t\\t\\torder. Pray to Him with fear and hope. Surely the mercy of Allah\\n\\t\\t\\tis always close to those who do good to others."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "57",
    "Text": "He is the One Who sends the winds bearing good news of His\\n\\t\\t\\tblessings, so when they lift up heavy clouds, We drive them along\\n\\t\\t\\tto a dead countryside and make the rain fall upon it and bring\\n\\t\\t\\tforth all kinds of fruits from the same dead land. Likewise We\\n\\t\\t\\twill raise the dead to life; this example is given so that you\\n\\t\\t\\tmay learn a lesson from this observation."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "58",
    "Text": "The good soil yields rich produce by the permission of Allah and\\n\\t\\t\\tbarren soil yields nothing but poor produce. Thus do We explain\\n\\t\\t\\tOur revelations over and over again for those who pay thanks."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "59",
    "Text": "Indeed We selected Nuh for the guidance of his people, and he\\n\\t\\t\\tsaid: \"O my people! Worship Allah, you have no god but Him. If\\n\\t\\t\\tyou do not listen to what I say, I fear for you the punishment of\\n\\t\\t\\ta Mighty Day.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "60",
    "Text": "The chiefs of his nation said: \"Surely we see that you are in\\n\\t\\t\\tevident error.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "61",
    "Text": "He replied: \"O my people! I am not in error; on the contrary, I\\n\\t\\t\\tam a Rasool from the Rabb of the worlds."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "62",
    "Text": "I am appointed to deliver the message of my Rabb and give you\\n\\t\\t\\tfriendly advice for I know from Allah something that you do not\\n\\t\\t\\tknow."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "63",
    "Text": "Do you wonder that there has come to you a message from your Rabb\\n\\t\\t\\tthrough a man from among yourselves to warn you, so that you may\\n\\t\\t\\tfear Allah in order to receive His mercy?\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "64",
    "Text": "But they denied him, as a result We saved him and all who were\\n\\t\\t\\twith him in the ark, and drowned those who denied Our\\n\\t\\t\\trevelations. Surely they were a blind nation."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "65",
    "Text": "For the people of 'Ad We selected their brother Hud, who said: \"O\\n\\t\\t\\tmy people! Worship Allah! You have no god but Him. Will you not\\n\\t\\t\\tfear Him?\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "66",
    "Text": "The chiefs of his nation who denied his message said: \"We can see\\n\\t\\t\\tthat you are crazy and we think that you are lying.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "67",
    "Text": "He replied: \"O my people! I am not crazy, on the contrary I am a\\n\\t\\t\\tRasool from the Rabb of the worlds."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "68",
    "Text": "I am conveying the message of my Rabb to you, and I am an honest\\n\\t\\t\\tadviser to you."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "69",
    "Text": "Do you wonder that a reminder from your Rabb has come to you\\n\\t\\t\\tthrough one of your own men to warn you? Remember that he made\\n\\t\\t\\tyou successors after the people of Nuh and gave you a tall\\n\\t\\t\\tstature as compared to other people. Therefore, remember the\\n\\t\\t\\tfavors that you have received from Allah, so that you may\\n\\t\\t\\tprosper.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "70",
    "Text": "They replied: \"Have you come to us with the demand that we should\\n\\t\\t\\tworship Allah Alone and give up those whom our forefathers used\\n\\t\\t\\tto worship? Well, bring us what you are threatening us with if\\n\\t\\t\\twhat you say is true!\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "71",
    "Text": "Hud said: \"You have already incurred the blight and wrath of your\\n\\t\\t\\tRabb. Would you dispute with me about mere names which you and\\n\\t\\t\\tyour forefathers have invented, and for which Allah has revealed\\n\\t\\t\\tno sanction? If so then wait for the decision of Allah, I too\\n\\t\\t\\twill wait with you.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "72",
    "Text": "We saved him and his companions by Our mercy and We cut off the\\n\\t\\t\\troots of (annihilated) those who denied Our revelations and did\\n\\t\\t\\tnot become believers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "73",
    "Text": "For the people of Thamud We selected their brother Saleh, who\\n\\t\\t\\tsaid: \"O my people! Worship Allah; you have no other god but Him.\\n\\t\\t\\tNow a clear proof has come to you from your Rabb; here is Allah's\\n\\t\\t\\tshe-camel as a sign for you, therefore leave her alone to pasture\\n\\t\\t\\ton Allah's land and do not touch her with bad intentions, lest\\n\\t\\t\\tyou incur a painful punishment."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "74",
    "Text": "Remember how you were made the heirs of 'Ad and settled in the\\n\\t\\t\\tland, capable of building mansions in the valleys and carving out\\n\\t\\t\\thomes in the mountains. Therefore, remember the favors of Allah\\n\\t\\t\\tand do not spread mischief in the land.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "75",
    "Text": "The arrogant leaders from his nation asked the oppressed among\\n\\t\\t\\tthem who have believed: \"Do you really believe that Saleh is a\\n\\t\\t\\tRasool from his Rabb?\" They replied: \"We do indeed believe in the\\n\\t\\t\\trevelation which he has been sent.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "76",
    "Text": "The arrogant, who considered themselves superior, said: \"We deny\\n\\t\\t\\tall that you believe in.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "77",
    "Text": "Then they hamstrung the she-camel, defied the commandment of\\n\\t\\t\\ttheir Rabb and challenged Saleh saying: \"Bring down the scourge\\n\\t\\t\\tyou have threatened us with, if you truly are one of the\\n\\t\\t\\tRasools.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "78",
    "Text": "Thereupon an earthquake overtook them and they became lifeless\\n\\t\\t\\tbodies in their homes with their faces down."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "79",
    "Text": "Saleh left them saying: \"O my people! I did indeed convey to you\\n\\t\\t\\tthe message of my Rabb and gave you good advice but you did not\\n\\t\\t\\tlove the good advisers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "80",
    "Text": "We also selected Lut, who said to his people: \"Will you do such\\n\\t\\t\\tindecent acts as no one else in the world has committed before\\n\\t\\t\\tyou?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "81",
    "Text": "You satisfy your lust with men (homosexual) instead of women.\\n\\t\\t\\tIndeed you are a nation who has transgressed beyond bounds.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "82",
    "Text": "His people had no answer but to say: \"Drive them out of your\\n\\t\\t\\ttown, they pose to be very pious!\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "83",
    "Text": "So We saved him and his family except his wife, who was of those\\n\\t\\t\\twho lagged behind."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "84",
    "Text": "We let loose rain of brimstone and every one of them was killed;\\n\\t\\t\\tsee what was the outcome for such criminals."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "85",
    "Text": "For Madyan We selected their brother Shuaib, who said: \"O my\\n\\t\\t\\tpeople! Worship Allah, you have no other god but Him. A clear\\n\\t\\t\\tguidance has come to you from your Rabb. Give just measure and\\n\\t\\t\\tweight, do not undersell others in their goods, and do not create\\n\\t\\t\\tmischief in the land after it has been set in order; this is\\n\\t\\t\\tbetter for you if you are true believers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "86",
    "Text": "Do not sit in ambush on every road to threaten people and hinder\\n\\t\\t\\tfrom the Way of Allah those who believe in Him, seeking to make\\n\\t\\t\\tHis Way crooked. Remember how He multiplied you when you were a\\n\\t\\t\\tfew in number and see what was the end of the mischief-makers of\\n\\t\\t\\tprior nations."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "87",
    "Text": "If there are some among you who believe in the message with which\\n\\t\\t\\tI have been sent and others who disbelieve it, then be patient\\n\\t\\t\\tuntil Allah judges between us, for He is the best of all judges.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "88",
    "Text": "The arrogant proud leaders of his nation said: \"O Shuaib! We\\n\\t\\t\\tshall certainly drive you and your fellow believers out of our\\n\\t\\t\\ttown or you will have to return back to our national ways.\" He\\n\\t\\t\\treplied: \"What! Will you make us turn back against our will?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "89",
    "Text": "We shall indeed invent a lie against Allah if we return to your\\n\\t\\t\\tways after Allah has rescued us therefrom. It is not possible for\\n\\t\\t\\tus to turn back unless Allah, our Rabb, want us to. Our Rabb has\\n\\t\\t\\tvast knowledge of everything. We put our trust in Allah.\" Then\\n\\t\\t\\tthey prayed: \"Our Rabb! Decide between us and our nation with\\n\\t\\t\\ttruth, for you are the best to decide.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "90",
    "Text": "The leaders who disbelieved from among his nation said: \"If you\\n\\t\\t\\tfollow Shu`aib, you shall indeed be losers!\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "91",
    "Text": "Thereupon an earthquake overtook them and they become lifeless\\n\\t\\t\\tbodies in their homes with their faces down."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "92",
    "Text": "Those who called Shu`aib a liar were as though they never lived\\n\\t\\t\\ttherein; those who called Shu`aib a liar were the actual losers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "93",
    "Text": "Shu`aib left them saying: \"O my people! I did indeed convey to\\n\\t\\t\\tyou the messages of my Rabb and I did give you good advice; how\\n\\t\\t\\tshall I then be sorry for the nation that refuses to believe?\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "94",
    "Text": "Whenever We sent a Prophet to a town We afflicted its people with\\n\\t\\t\\tadversity and misfortunes so that they might humble themselves."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "95",
    "Text": "Then We changed their adversity into good fortune till they\\n\\t\\t\\tbecame very affluent and said: \"Our forefathers also had their\\n\\t\\t\\tadversity and affluence.\" Behold! We took them by surprise while\\n\\t\\t\\tthey did not even notice it."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "96",
    "Text": "Had the residents of the towns believed and feared Allah We would\\n\\t\\t\\thave showered upon them riches from and the earth, but they\\n\\t\\t\\tdisbelieved; so We seized them for their misdeeds."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "97",
    "Text": "Do the people of these towns now feel secure from Our punishment\\n\\t\\t\\tcoming to them by night while they might be fast asleep?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "98",
    "Text": "Or do the people of these towns feel secure from Our punishment\\n\\t\\t\\tcoming to them in broad daylight while they are playing around?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "99",
    "Text": "Do these people feel secure against the plan of Allah? In fact,\\n\\t\\t\\tonly those people feel secure from the plan of Allah who are\\n\\t\\t\\tdoomed to destruction."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "100",
    "Text": "Is it not a guiding lesson to those who inherit the earth after\\n\\t\\t\\tits former occupants, that if We please, We can punish them for\\n\\t\\t\\ttheir sins and seal their hearts so they would not hear?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "101",
    "Text": "Those towns whose stories We related to you, can serve as\\n\\t\\t\\texamples. Certainly their Rasools came to them with clear signs,\\n\\t\\t\\tbut they persisted in their unbelief and would not believe what\\n\\t\\t\\tthey had denied before. That's why Allah sealed the hearts of\\n\\t\\t\\tthose unbelievers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "102",
    "Text": "We did not find most of them true to their commitments rather We\\n\\t\\t\\tfound that most of them were transgressors."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "103",
    "Text": "Then after them, We sent Musa (Moses) with Our revelations to\\n\\t\\t\\tFir'on (Pharaoh) and his chiefs but they too treated Our\\n\\t\\t\\trevelations unjustly, so see what was the end of those\\n\\t\\t\\tmischief-makers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "104",
    "Text": "Musa said: \"O Fir'on! I am a Rasool from the Rabb of the worlds."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "105",
    "Text": "It is not befitting for me to say anything about Allah except the\\n\\t\\t\\tTruth. I have come to you from your Rabb with clear signs of\\n\\t\\t\\tappointment, therefore, send the children of Israel with me.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "106",
    "Text": "Fir'on asked: \"If you have come with a sign then produce it, if\\n\\t\\t\\twhat you say is true.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "107",
    "Text": "So Musa threw down his staff and all of a sudden it became a real\\n\\t\\t\\tserpent."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "108",
    "Text": "Then he drew out his hand from his pocket and it became shining\\n\\t\\t\\twhite to all the beholders."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "109",
    "Text": "The chiefs of Fir'on's nation said: \"He indeed is a skilled\\n\\t\\t\\tsorcerer"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "110",
    "Text": "who intends to drive you out from your land.\" Fir'on asked: \"So\\n\\t\\t\\twhat do you propose?\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "111",
    "Text": "They said: \"Put him and his brother off for a while; and send the\\n\\t\\t\\tcollectors to all the cities"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "112",
    "Text": "and summon every skillful sorcerer to you.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "113",
    "Text": "The sorcerers came to Fir'on and said: \"We must certainly have\\n\\t\\t\\tsome suitable reward if we prevail!\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "114",
    "Text": "\"Yes,\" he answered. \"Not only reward but more: you shall\\n\\t\\t\\tcertainly become my favored friends.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "115",
    "Text": "Then they asked Musa: \"Will you cast, or should we be the first\\n\\t\\t\\tones to cast?\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "116",
    "Text": "Musa said: \"You cast.\" So when they cast, they bewitched the eyes\\n\\t\\t\\tof the people and terrified them by a display of a mighty\\n\\t\\t\\tsorcery."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "117",
    "Text": "We inspired Musa to cast his staff. No sooner did he cast his\\n\\t\\t\\tstaff than it became a serpent and began to swallow up the\\n\\t\\t\\tcreation of their sorcery!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "118",
    "Text": "Thus the truth prevailed and all that they did collapsed."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "119",
    "Text": "Fir'on and his people were defeated and put to humiliation,"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "120",
    "Text": "and the sorcerers, since they were professionals and knew that it\\n\\t\\t\\twas not sorcery, fell down in prostration,"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "121",
    "Text": "saying: \"we believe in the Rabb of the worlds,"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "122",
    "Text": "the Rabb of Musa and Haroon.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "123",
    "Text": "Fir'on said: \"How do you dare to believe in Him without my\\n\\t\\t\\tpermission? In fact this was a plot which you all had planned to\\n\\t\\t\\tdrive the people out of their city, but soon you will know its\\n\\t\\t\\tconsequences."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "124",
    "Text": "I will have your hands and your feet cut off on opposite sides\\n\\t\\t\\tand then crucify you all.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "125",
    "Text": "They answered: \"We will surely return to our Rabb."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "126",
    "Text": "Look at your verdict, you want to take revenge simply because we\\n\\t\\t\\tbelieved in the signs of our Rabb when they came before us! O\\n\\t\\t\\tRabb! Give us patience and cause us die as Muslims.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "127",
    "Text": "The chiefs of Fir'on's (Pharaoh's) nation asked him: \"Will you\\n\\t\\t\\tleave Musa (Moses) and his nation free to commit mischief in the\\n\\t\\t\\tland and to forsake you and your gods?\" He said: \"We will put\\n\\t\\t\\ttheir sons to death and spare their daughters; we have\\n\\t\\t\\tirresistible power over them.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "128",
    "Text": "Musa said to his people: \"Seek help from Allah and be patient.\\n\\t\\t\\tThe land belongs to Allah. He gives it as a heritage to those of\\n\\t\\t\\tHis devotees whom He pleases. You should know that final success\\n\\t\\t\\tis for the righteous.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "129",
    "Text": "They said: \"We were oppressed before you came to us and since you\\n\\t\\t\\thave come to us.\" He replied: \"It is quite possible that your\\n\\t\\t\\tRabb may destroy your enemy and make you vicegerent in the land;\\n\\t\\t\\tthen He will see how you act.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "130",
    "Text": "We afflicted Fir'on's people with several years of famine and\\n\\t\\t\\tshortages of fruit so that they might come to their senses."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "131",
    "Text": "But whenever they had good times they said \"It is our due,\" and\\n\\t\\t\\twhenever evil befell them they ascribed that bad luck to Musa and\\n\\t\\t\\tthose with him. Behold! In fact their misfortune was in the hands\\n\\t\\t\\tof Allah; yet most of them do not know."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "132",
    "Text": "They said to Musa: \"No matter what sign you may bring us to put\\n\\t\\t\\tyour magic spell, we are not going to believe you.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "133",
    "Text": "So We plagued them with storms, locusts, lice, frogs and blood:\\n\\t\\t\\tclear cut signs, yet they persisted in their arrogance, for they\\n\\t\\t\\twere a criminal nation."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "134",
    "Text": "Every time the plague befell them, they said: \"O Musa! Pray for\\n\\t\\t\\tus to your Rabb as He has made the promise with you, if you help\\n\\t\\t\\tremove the plague from us, we shall truly believe in you and send\\n\\t\\t\\tthe Children of Israel with you.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "135",
    "Text": "But every time We removed the plague from them and the appointed\\n\\t\\t\\ttime for the release of the Children of Israel came, lo! They\\n\\t\\t\\tbroke their promise."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "136",
    "Text": "Therefore, We inflicted retribution on them and drowned them in\\n\\t\\t\\tthe sea, for they denied Our signs and became heedless of them."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "137",
    "Text": "Thus We made that nation which was oppressed, the inheritors of\\n\\t\\t\\tthe eastern and western lands which We had blessed. That's how\\n\\t\\t\\tthe fair promise of your Rabb was fulfilled for the Children of\\n\\t\\t\\tIsrael because they had endured with patience; and We levelled to\\n\\t\\t\\tthe ground the great works and fine buildings which Fir'on and\\n\\t\\t\\this nation erected with such pride."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "138",
    "Text": "We made the Children of Israel cross the (Red) sea. On their way\\n\\t\\t\\tthey came across a people who were worshipping their idols. They\\n\\t\\t\\tsaid: \"O Musa (Moses) fashion for us an Ilah (a god for worship)\\n\\t\\t\\tlike the gods of these people.\" He replied: \"You are indeed very\\n\\t\\t\\tignorant people,"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "139",
    "Text": "don't you realize, what these people are following is doomed to\\n\\t\\t\\tdestruction and their deeds are in vain.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "140",
    "Text": "He further said: \"Should I seek for you a god for worship other\\n\\t\\t\\tthan Allah: when it is He who has exalted you above all the\\n\\t\\t\\tworlds"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "141",
    "Text": "and while Allah says, \"Remember that We rescued you from people\\n\\t\\t\\tof Fir'on (Pharaoh), who subjected you to cruel torment, putting\\n\\t\\t\\tyour sons to death and sparing your women and in that condition\\n\\t\\t\\tof slavery there was a great trial from your Rabb.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "142",
    "Text": "We summoned Musa to the mount of Tur for thirty nights and added\\n\\t\\t\\tten more to complete the term of forty nights for communion with\\n\\t\\t\\this Rabb. (Before leaving) Musa asked his brother Haroon (Aaron):\\n\\t\\t\\t\"You will be in my place among my people, set a good example and\\n\\t\\t\\tdo not follow the way of mischief-makers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "143",
    "Text": "When Musa came to Our appointed place and his Rabb spoke to him,\\n\\t\\t\\the asked: \"O my Rabb! Give me power of sight to see You.\" He\\n\\t\\t\\tanswered: \"You cannot see Me. Look at the mountain; if it remains\\n\\t\\t\\tfirm in its place then soon you might be able to see Me\". When\\n\\t\\t\\this Rabb manifested His glory on the mountain, it turned into\\n\\t\\t\\tsmall pieces of fine dust and Musa fell down unconscious. When\\n\\t\\t\\tMusa recovered he said: \"Glory be to You! Accept my repentance\\n\\t\\t\\tand I am the first of the believers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "144",
    "Text": "Allah said: \"O Musa! I have chosen you from among mankind to\\n\\t\\t\\tdeliver My message and to have conversation with Me: so take what\\n\\t\\t\\tI give you and be thankful.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "145",
    "Text": "We inscribed for him upon tablets all kind of instructions and\\n\\t\\t\\tdetails of every thing, concerning all branches of life, and\\n\\t\\t\\tsaid: \"Observe these with firmness and enjoin your people to\\n\\t\\t\\tfollow them according to the best of their abilities. Soon I\\n\\t\\t\\tshall show you the homes of the transgressors."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "146",
    "Text": "I will turn away from My signs the eyes of those who are unjustly\\n\\t\\t\\tarrogant in the land, so that even if they see each and every\\n\\t\\t\\tsign they will not believe in it. If they see the Right Way\\n\\t\\t\\tbefore them they will not follow it; but if they see a crooked\\n\\t\\t\\tway they will follow it; this is because they denied Our\\n\\t\\t\\trevelations and were heedless of them."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "147",
    "Text": "Those who deny Our signs and the meeting of the Hereafter, their\\n\\t\\t\\tdeeds are null. Should they be rewarded except for what they have\\n\\t\\t\\tdone?\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "148",
    "Text": "In his absence the nation of Musa (Moses) made an image of a calf\\n\\t\\t\\tfor worship from their jewelry which produced a mooing sound. Did\\n\\t\\t\\tthey not see that it could neither speak to them nor give them\\n\\t\\t\\tthe guidance? Yet they took it for worship and became wrongdoers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "149",
    "Text": "When they felt ashamed about what they had done and realized that\\n\\t\\t\\tthey had gone astray, they said: \"If our Rabb does not have mercy\\n\\t\\t\\ton us and pardon us, we shall become losers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "150",
    "Text": "When Musa came back to his people, he was extremely angry and\\n\\t\\t\\tsorrowful, and he said: \"What an evil thing you have done in my\\n\\t\\t\\tplace in my absence! Have you tried to hasten the retribution of\\n\\t\\t\\tyour Rabb?\" He put down the Holy Tablets and seized his brother\\n\\t\\t\\tby the hair of his head and dragged him closer. Haroon (Aaron)\\n\\t\\t\\tcried: \"O son of my mother! The people overpowered me and almost\\n\\t\\t\\tkilled me; do not make my enemies happy over me and do not count\\n\\t\\t\\tme among the wrongdoers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "151",
    "Text": "At this Musa said: \"O Rabb! Forgive me and my brother! And admit\\n\\t\\t\\tus to Your mercy, for You are the Most Merciful of all.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "152",
    "Text": "Those who worshipped the calf have indeed incurred the wrath of\\n\\t\\t\\ttheir Rabb and disgrace in this life; thus do We recompense those\\n\\t\\t\\twho invent falsehoods."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "153",
    "Text": "As for those who do evil deeds, then repent and become true\\n\\t\\t\\tbelievers thereafter, your Rabb is most surely the Forgiving,\\n\\t\\t\\tMerciful."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "154",
    "Text": "When Musa's anger calmed down he took up the Holy Tablets in\\n\\t\\t\\twhose writing there was guidance and mercy for those that fear\\n\\t\\t\\ttheir Rabb."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "155",
    "Text": "Musa chose seventy men from his nation to accompany him to Our\\n\\t\\t\\tplace of meeting. On their way when they were seized by a violent\\n\\t\\t\\tearthquake, he prayed: \"O my Rabb! Had it been Your will, You\\n\\t\\t\\tcould have destroyed them long ago, and myself too. Would You\\n\\t\\t\\tdestroy us for the offence committed by some fools among us? That\\n\\t\\t\\ttrail was ordained by You, to confound whom You willed and to\\n\\t\\t\\tguide whom You pleased. You are our Guardian, therefore, forgive\\n\\t\\t\\tus and have mercy on us; for You are the best of all forgivers!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "156",
    "Text": "O Allah ordain for us what is good in this life and in the\\n\\t\\t\\tHereafter, surely we have turned to You.\" He replied: \"I will\\n\\t\\t\\tinflict My punishment upon whom I please; yet My mercy\\n\\t\\t\\tencompasses everything. I will ordain special mercy for those who\\n\\t\\t\\tdo righteous deeds, pay Zakah and believe in Our revelations.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "157",
    "Text": "Now, special mercy is assigned to those who follow the Rasool,\\n\\t\\t\\tthe unlettered Prophet (Muhammad) - whom they shall find\\n\\t\\t\\tdescribed in the Taurat (Torah) and the Injeel (Gospel). Who\\n\\t\\t\\tenjoins them what is good and forbids what is evil; makes pure\\n\\t\\t\\tthings Halal (lawful) for them and impure things Haram\\n\\t\\t\\t(unlawful); relieves them from their heavy burdens and from the\\n\\t\\t\\tyokes that were around their necks. Therefore, those who believe\\n\\t\\t\\tin him, honor him, help him, and follow the Light which is sent\\n\\t\\t\\tdown with him will be the ones who will be successful in this\\n\\t\\t\\tlife and the hereafter\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "158",
    "Text": "O Muhammad, say: \"O mankind! I am the Rasool of Allah towards all\\n\\t\\t\\tof you from He to whom belongs the kingdom of the heavens and the\\n\\t\\t\\tearth. There is no deity but Him. He brings to life and causes to\\n\\t\\t\\tdie. Therefore, believe in Allah and His Rasool, the unlettered\\n\\t\\t\\tProphet (Muhammad) who believes in Allah and His Word. Follow him\\n\\t\\t\\tso that you may be rightly guided.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "159",
    "Text": "In the nation of Musa (Moses) there were some who guided others\\n\\t\\t\\twith the truth and thereby established justice."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "160",
    "Text": "We divided them into twelve tribes, as nations; and when his\\n\\t\\t\\tthirsty people asked him for water, We revealed to Musa: \"Strike\\n\\t\\t\\tthe rock with your staff.\" Thereupon twelve springs gushed out\\n\\t\\t\\tfrom the rock, each tribe was specified its drinking place. We\\n\\t\\t\\tcaused the clouds to cast shadow over them and sent down to them\\n\\t\\t\\tmanna and salva for their food, saying: \"Eat of the pure things\\n\\t\\t\\tWe have provided for you,\" but they rebelled and by doing so they\\n\\t\\t\\tdid not harm Us but they did injustice to their own souls."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "161",
    "Text": "When it was said to them: \"Reside in this town and eat therein\\n\\t\\t\\twhatever you please and say 'Hittatun' (forgive us) and enter the\\n\\t\\t\\tgate in a posture of humility; We will forgive you your sins and\\n\\t\\t\\tincrease all the more the reward for such righteous people.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "162",
    "Text": "But the wicked among them changed that word which was said to\\n\\t\\t\\tthem, as a result We sent down a scourge upon them from heaven\\n\\t\\t\\tfor their wrong doings."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "163",
    "Text": "Ask them, about the town which was situated on the sea shore,\\n\\t\\t\\twhat happened when they transgressed in the matter of Sabbath. On\\n\\t\\t\\tthe day of their Sabbath the fish appeared before them on the\\n\\t\\t\\tsurface of the water but on the days other than their Sabbath\\n\\t\\t\\tthey never came near them; thus did We tempt them because they\\n\\t\\t\\ttransgressed."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "164",
    "Text": "Also remind them about the conversation among some of them, when\\n\\t\\t\\tsome of them asked: \"Why do you admonish a people whom Allah will\\n\\t\\t\\tdestroy or sternly punish?\" They replied: \"To be able to offer an\\n\\t\\t\\texcuse before our Rabb, that we did discharge our duty, and also\\n\\t\\t\\tin the hope that they may refrain from His disobedience.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "165",
    "Text": "However, when they disregarded the reminder, We delivered those\\n\\t\\t\\twho forbade evil and We overtook those who were wrongdoers with\\n\\t\\t\\tstern punishment because of their transgression."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "166",
    "Text": "But when after that they persisted in their forbidden ways, We\\n\\t\\t\\tsaid to them: \"Be detested apes.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "167",
    "Text": "Also remind them when your Rabb declared that He would raise\\n\\t\\t\\tagainst them others who would afflict them with severe torment\\n\\t\\t\\ttill the Day of Resurrection. Swift is the retribution of your\\n\\t\\t\\tRabb, yet He is also the Forgiving, Merciful."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "168",
    "Text": "We broke their unity as a nation and dispersed them into\\n\\t\\t\\tdifferent communities all over the earth - some of them are\\n\\t\\t\\trighteous and others are the opposite - We tested them with both\\n\\t\\t\\tblessings and misfortunes so that they might turn to the Right\\n\\t\\t\\tWay."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "169",
    "Text": "Then they were succeeded by an evil generation. Who inherited the\\n\\t\\t\\tBook, they indulged in the vanities of this nether life, saying:\\n\\t\\t\\t\"We expect to be forgiven\" assuming that they are favorites of\\n\\t\\t\\tAllah and somehow He will spare them. Yet if similar vanities\\n\\t\\t\\tcome their way they would again seize them. Was not a covenant\\n\\t\\t\\ttaken from them in the Book that they would not speak anything\\n\\t\\t\\tabout Allah except the truth? And they have studied what is in\\n\\t\\t\\tthe Book. Best for the righteous is the home of the hereafter,\\n\\t\\t\\tdon't you understand?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "170",
    "Text": "As for those who strictly observe the Book and establish Salah;\\n\\t\\t\\tsurely We never let the reward of such righteous people go waste."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "171",
    "Text": "Remember when We suspended the mountain over them as though it\\n\\t\\t\\twas an umbrella and they feared it was going to fall on them and\\n\\t\\t\\tWe said: \"Hold firmly to the Book that We have given you and be\\n\\t\\t\\tmindful of what is in it, so that you may guard yourselves\\n\\t\\t\\tagainst evil.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "172",
    "Text": "O Prophet, remind mankind about incident when your Rabb brought\\n\\t\\t\\tinto existence the offspring from the loins of Adam and his\\n\\t\\t\\tdescendants (virtually each single individual of mankind) and\\n\\t\\t\\tmade them testify about themselves. Allah asked them: \"Am I not\\n\\t\\t\\tyour Rabb?\" They all replied: \"Yes! We bear witness that You\\n\\t\\t\\tare.\" This We did, lest you mankind should say on the Day of\\n\\t\\t\\tResurrection: \"We were not aware of this fact that You are our\\n\\t\\t\\tRabb and that there will be a Day of Judgement."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "173",
    "Text": "or lest you should say: \"Our forefathers started the practice of\\n\\t\\t\\tshirk and we just followed, being their descendants. Will you\\n\\t\\t\\tthen destroy us on account of following the sin committed by\\n\\t\\t\\tthose wrongdoers?\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "174",
    "Text": "Thus do We spell out Our revelations so that you might return to\\n\\t\\t\\tthe Right Way."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "175",
    "Text": "Tell them the story of that person to whom We sent our\\n\\t\\t\\trevelations but he turned away from them, as a result Shaitan\\n\\t\\t\\tpersuaded him until he become one of the misguided."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "176",
    "Text": "Had it been Our will, We would have exalted him through those\\n\\t\\t\\trevelations; but he clung to this earthly life and followed his\\n\\t\\t\\town desires. His similitude is that of a dog: if you chase him he\\n\\t\\t\\tlolls out his tongue and if you leave him alone he still lolls\\n\\t\\t\\tout his tongue. Such are those who deny Our revelations, tell\\n\\t\\t\\tthem these parables, so that they might think over their behavior\\n\\t\\t\\tto Our revelations."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "177",
    "Text": "Very bad is the example of those people who deny Our revelations\\n\\t\\t\\tand wrong their own souls."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "178",
    "Text": "Only he whom Allah guides is rightly guided; and whom He\\n\\t\\t\\tconfounds will become the losers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "179",
    "Text": "Certainly, We have destined many Jinns and human beings for hell;\\n\\t\\t\\tthose are the ones who have hearts with which they do not\\n\\t\\t\\tunderstand, they have eyes with which they do not see, they have\\n\\t\\t\\tears with which they do not hear. They are like animals - or even\\n\\t\\t\\tworse than them , because they are those who are heedless."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "180",
    "Text": "Allah has the most excellent names (over ninety-nine attributes);\\n\\t\\t\\tcall on Him by them ; and shun those people who use profanity in\\n\\t\\t\\tHis Names, such people shall be requited for their misdeeds."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "181",
    "Text": "Among those whom We have created, there are some people who guide\\n\\t\\t\\tothers with the truth and establish justice therewith."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "182",
    "Text": "Those who deny Our revelations, We draw them step by step closes\\n\\t\\t\\tto destruction in ways that they do not realize,"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "183",
    "Text": "and even though I grant them respite; My plan is surely\\n\\t\\t\\teffective."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "184",
    "Text": "Has it never occurred to them that their companion is not a\\n\\t\\t\\tmadman; he is merely a plain Warner."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "185",
    "Text": "Have they not pondered the kingdom of the heavens and the earth\\n\\t\\t\\tand whatever Allah has created, and that maybe their hour of\\n\\t\\t\\tdeath has come closer? In what message after this would they then\\n\\t\\t\\tbelieve?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "186",
    "Text": "None can guide those whom Allah confounds and leaves them\\n\\t\\t\\tblundering about in their rebellious transgression."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "187",
    "Text": "They ask you about the Hour of Doom and when will it take place.\\n\\t\\t\\tSay: \"Knowledge about it rests only with my Rabb: He Himself will\\n\\t\\t\\tdisclose it at the proper time. Heavy is its weight in the\\n\\t\\t\\theavens and the earth. It will not come gradually but all of a\\n\\t\\t\\tsudden. They ask you as if you yourself were in search of it.\\n\\t\\t\\tTell them: \"The knowledge about it rests only with Allah though\\n\\t\\t\\tmost people do not understand.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "188",
    "Text": "Further tell them: \"I have no power to acquire benefit or avert\\n\\t\\t\\tany harm from myself, only that happens which Allah wants. Had I\\n\\t\\t\\tpossessed the knowledge of the unseen I would have acquired many\\n\\t\\t\\tbenefits to myself; and no harm would have touched me. I am no\\n\\t\\t\\tmore than a Warner and bearer of good news for the true\\n\\t\\t\\tbelievers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "189",
    "Text": "He is the one who created you from a single being and from that\\n\\t\\t\\tbeing He created his mate, so that he might find comfort with\\n\\t\\t\\ther. When he covers her, she conceives a light burden and walks\\n\\t\\t\\taround with it. When it grows heavy they both pray to Allah their\\n\\t\\t\\tRabb saying: \"If You will grant us a healthy child, we will be\\n\\t\\t\\ttruly thankful.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "190",
    "Text": "But when He gives them a healthy child they both began to\\n\\t\\t\\tassociate partners with Him in what He has given them; but Allah\\n\\t\\t\\tis exalted far above the shirk they commit of associating other\\n\\t\\t\\tdeities with Him as His partners."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "191",
    "Text": "Do they associate with Him those deities who can create nothing\\n\\t\\t\\tbut are themselves created,"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "192",
    "Text": "they have neither the ability to help them, nor can they help\\n\\t\\t\\tthemselves?"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "193",
    "Text": "If you invite them to guidance they will not follow you. It will\\n\\t\\t\\tbe all the same for you whether you call them or hold your peace."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "194",
    "Text": "In fact those whom you call besides Allah are bondmen, like\\n\\t\\t\\tyourselves. Well call them, and let them answer you, if what you\\n\\t\\t\\tsay is true!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "195",
    "Text": "Have they feet to walk with? Have they hands to hold with? Have\\n\\t\\t\\tthey eyes to see with? Have they ears to hear with? O Muhammad,\\n\\t\\t\\tsay: \"Call on your shoraka' (partners you have set up besides\\n\\t\\t\\tAllah) and collectively plot against me and give me no respite!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "196",
    "Text": "My protector is Allah Who has revealed this Book and He is the\\n\\t\\t\\tprotecting friend of the righteous."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "197",
    "Text": "On the contrary, those whom you call besides Him have neither the\\n\\t\\t\\tability to help you, nor can they help themselves."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "198",
    "Text": "If you call them to guidance, they cannot even hear what you say,\\n\\t\\t\\talthough it appears as if they are looking at you, they do not\\n\\t\\t\\tsee."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "199",
    "Text": "Show forgiveness, speak for justice and avoid the ignorant."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "200",
    "Text": "If Shaitan tempts you, seek refuge with Allah; for He is the one\\n\\t\\t\\tWho is All Hearing, Knowing."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "201",
    "Text": "Those who fear Allah, when they are tempted by Shaitan, they have\\n\\t\\t\\tbut to remember Allah and they shall see the light (right course\\n\\t\\t\\tof action)!"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "202",
    "Text": "As for Shaitan's brothers, they drag them deeper into error and\\n\\t\\t\\tnever relax their efforts."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "203",
    "Text": "When you, O Muhammad, do not bring them a revelation, they say:\\n\\t\\t\\t\"Have you not yet invented?\" Tell them: \"I follow only what is\\n\\t\\t\\trevealed to me from my Rabb. This Book contains veritable insight\\n\\t\\t\\tfrom your Rabb, a guidance and blessing for the true believers.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "204",
    "Text": "When the Qur'an is recited, listen to it with complete silence so\\n\\t\\t\\tthat you may be shown mercy."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "205",
    "Text": "Bring your Rabb to remembrance deep in your soul with humility\\n\\t\\t\\tand in reverence without raising your voice, both in the mornings\\n\\t\\t\\tand in the evenings; and be not of those who are heedless."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "206",
    "Text": "Surely those who are close to your Rabb do not feel too proud to\\n\\t\\t\\tworship Him; they declare His glory and prostrate themselves\\n\\t\\t\\tbefore Him."
  }
]
