[
  {
    "SurahNumber": "100",
    "AyahNumber": "1",
    "NoteID": "6241",
    "Body": "The substantive proposition is in verses 6-8 below, and\\n\\t\\t\\t\\tthe metaphors enforcing the lesson are in verses 1-5\\n\\t\\t\\t\\there. They have at least three layers of meaning: (1)\\n\\t\\t\\t\\tLook at the chargers (mares or swift camels) panting for\\n\\t\\t\\t\\twar on behalf of their masters. Off they go, striking\\n\\t\\t\\t\\tfire with their hoofs by night at the behest of their\\n\\t\\t\\t\\triders; they push home the charge in the moming,\\n\\t\\t\\t\\tchivalrously giving the enemy the benefit of daylight;\\n\\t\\t\\t\\tand regardless of flashing steel or the weapons of their\\n\\t\\t\\t\\tenemies they boldly penetrate into the midst of their\\n\\t\\t\\t\\tfoe, risking their lives for the Cause. Does unregenerate\\n\\t\\t\\t\\tman show that fidelity to his Lord Allah? On the contrary\\n\\t\\t\\t\\the is ungrateful to Allah; he shows that by his deeds; he\\n\\t\\t\\t\\tis violently in love with wealth and gain and things that\\n\\t\\t\\t\\tperish. (2) By the figure of metonymy the brave fidelity\\n\\t\\t\\t\\tof the war-horse may stand for that of the brave men and\\n\\t\\t\\t\\ttrue who rally to the standard of Allah and carry it to\\n\\t\\t\\t\\tvictory, contrasted with the poltroonery and pettiness of\\n\\t\\t\\t\\tunregenerate man. (3) The whole conflict, fighting, and\\n\\t\\t\\t\\tvictory, may be applied to spiritual warfare against\\n\\t\\t\\t\\tthose who are caught and overwhelmed in the camp of Evil."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "2",
    "NoteID": "6242",
    "Body": "With their hoofs. If we suppose the march to be in the\\n\\t\\t\\t\\tdead of night, the sparks of fire would be still more\\n\\t\\t\\t\\tconspicuous."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "3",
    "NoteID": "6243",
    "Body": "We may suppose a surprise attack, but yet a chivalrous\\n\\t\\t\\t\\tattack by daylight. The foe is punished through his own\\n\\t\\t\\t\\tlethargy and unpreparedness, apart from the strength,\\n\\t\\t\\t\\tfire, and spirit of the forces of righteousness."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "4",
    "NoteID": "6244",
    "Body": "The clouds of dust typify the ignorance and confusion in\\n\\t\\t\\t\\tthe minds of those who oppose Truth."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "5",
    "NoteID": "6245",
    "Body": "The forces of evil mass themselves for strength, but\\n\\t\\t\\t\\ttheir massing itself may become a means of their speedy\\n\\t\\t\\t\\tundoing."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "6",
    "NoteID": "6246",
    "Body": "Man, i.e., unregenerate man, in contrast to those who\\n\\t\\t\\t\\treceive guidance and wage unceasing war with Evil, is\\n\\t\\t\\t\\tungrateful to his Lord and Cherisher, Him Who created him\\n\\t\\t\\t\\tand sustains him, and sends His blessings and favours at\\n\\t\\t\\t\\tall times. The ingratitude may be shown by thoughts,\\n\\t\\t\\t\\twords, and deeds,-by forgetting or denying Allah and His\\n\\t\\t\\t\\tgoodness, by misusing His gifts, or by injustice to His\\n\\t\\t\\t\\tcreatures."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "7",
    "NoteID": "6247",
    "Body": "Man himself, by his conduct, proves the charge of treason\\n\\t\\t\\t\\tagainst himself."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "8",
    "NoteID": "6248",
    "Body": "What an evil choice he makes in committing treason\\n\\t\\t\\t\\tagainst his own Benefactor by going after the petty\\n\\t\\t\\t\\tbaubles of this world's wealth of fleeting gains?"
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "9",
    "NoteID": "6249",
    "Body": "Dead bodies, secret plots, evil thoughts and imaginings,\\n\\t\\t\\t\\tlong since buried, will yet stand forth before the\\n\\t\\t\\t\\tJudgment-seat of Allah. Instead of being closely hidden\\n\\t\\t\\t\\tor blotted out-as they will have been from the\\n\\t\\t\\t\\tconsciousness of mankind,-they will stand out as from the\\n\\t\\t\\t\\tconsciousness of Allah, which is all-embracing and never\\n\\t\\t\\t\\tsuffers from sleep or fatigue."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "11",
    "NoteID": "6250",
    "Body": "Allah's knowledge is full and vigilant at all times. But\\n\\t\\t\\t\\ton that day it will reveal to men secrets which they had\\n\\t\\t\\t\\tlong forgotten, for the Book of their Deeds will be made\\n\\t\\t\\t\\tmanifest at Judgment."
  }
]
