[
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "1",
    "sectionHeading": "Wearing Clothes for Beautification",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tJabir ibn Abdullah al-Ansari said, \"We went out with the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, in the raid on the Banu Ammar tribe.\" Jabir said,\\n\\t\\t\\t\\t\"I was resting under a tree when the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, came. I said,\\n\\t\\t\\t\\t'Messenger of Allah; come to the shade.' So the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, sat\\n\\t\\t\\t\\tdown, and I stood up and went to a sack of ours. I looked\\n\\t\\t\\t\\tin it for something and found a small cucumber and broke\\n\\t\\t\\t\\tit. Then I brought it to the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace. He said, 'From where\\n\\t\\t\\t\\tdid you get this?' I said, 'We brought it from Madina,\\n\\t\\t\\t\\tMessenger of Allah.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tJabir continued, \"We had a friend of ours with us whom we\\n\\t\\t\\t\\tused to equip to go out to guard our mounts. I gave him\\n\\t\\t\\t\\twhat was necessary and then he turned about to go to the\\n\\t\\t\\t\\tmounts and he was wearing two threadbare cloaks of his.\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, looked at him and said, 'Does he have two garments\\n\\t\\t\\t\\tother than these?' I said, 'Yes, Messenger of Allah. He\\n\\t\\t\\t\\thas two garments in the bag.' I gave them to him. He\\n\\t\\t\\t\\tsaid, 'Let him go and put them on.' I let him go to put\\n\\t\\t\\t\\tthem on. As he turned to go, the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, exclaimed, 'May\\n\\t\\t\\t\\tAllah strike his neck. Isn't that better for him?' He\\n\\t\\t\\t\\tsaid (taking him literally), 'Messenger of Allah, in the\\n\\t\\t\\t\\tway of Allah.' The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, 'In the way of Allah.' \"\\n\\t\\t\\t\\tJabir added, \"The man was killed in the way of Allah.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "2",
    "sectionHeading": "Wearing Clothes for Beautification",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that Umar\\n\\t\\t\\t\\tibn al-Khattab said, \"I love to look at a Qur'an reader\\n\\t\\t\\t\\tin white garments.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "3",
    "sectionHeading": "Wearing Clothes for Beautification",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Abi Tamim\\n\\t\\t\\t\\tthat Ibn Sirin said, ''Umar ibn al-Khattab said, 'Allah\\n\\t\\t\\t\\thas been generous to you, so be generous to yourselves.\\n\\t\\t\\t\\tLet a man wear a combination of his garments.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "4",
    "sectionHeading": "Wearing Dyed Garments and Gold.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar wore garments dyed with red earth and dyed with\\n\\t\\t\\t\\tsaffron.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"I disapprove of\\n\\t\\t\\t\\tyouths wearing any gold because I heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade wearing gold rings, and I disapprove of it\\n\\t\\t\\t\\tfor males old or young.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"I heard Malik say about men wearing wraps\\n\\t\\t\\t\\tdyed with safflower in their houses and courtyards, 'I do\\n\\t\\t\\t\\tnot know that any of that is haram but I prefer other\\n\\t\\t\\t\\tgarments than that.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "5",
    "sectionHeading": "Wearing Silk",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Hisham ibn Urwa from his father\\n\\t\\t\\t\\tthat A'isha the wife of the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, dressed Abdullah ibn az-Zubayr in a\\n\\t\\t\\t\\tshawl of silk which A'isha used to wear.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "6",
    "sectionHeading": "Clothes Disapproved for Women to Wear",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Alqama ibn Abi Alqama\\n\\t\\t\\t\\tthat his mother said, \"Hafsa bint Abd ar-Rahman visited\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and Hafsa was wearing a long thin head\\n\\t\\t\\t\\tscarf A'isha tore it in two and made a wide one for her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "7",
    "sectionHeading": "Clothes Disapproved for Women to Wear",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muslim ibn Abi Maryam\\n\\t\\t\\t\\tfrom Abu Salih that Abu Hurayra said, \"Women who are\\n\\t\\t\\t\\tnaked even though they are wearing clothes, go astray and\\n\\t\\t\\t\\tmake others go astray, and they will not enter the Garden\\n\\t\\t\\t\\tand they will not find its scent, and its scent is\\n\\t\\t\\t\\texperienced from as far as the distance travelled in five\\n\\t\\t\\t\\thundred years.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "8",
    "sectionHeading": "Clothes Disapproved for Women to Wear",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tIbn Shihab that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, stood up in the night and looked\\n\\t\\t\\t\\tat the horizon of the sky. He said, \"What treasures has\\n\\t\\t\\t\\tthe night opened? What trials have occurred? How many are\\n\\t\\t\\t\\tdressed in this world and will be naked on the Day of\\n\\t\\t\\t\\tRising. Warn the women in their rooms.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "9",
    "sectionHeading": "A Man Dragging his Garments",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"A person who\\n\\t\\t\\t\\tdrags his garment in arrogance will not be looked at by\\n\\t\\t\\t\\tAllah on the Day of Rising.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "10",
    "sectionHeading": "A Man Dragging his Garments",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"On the Day of\\n\\t\\t\\t\\tRising, Allah the Blessed, the Exalted, will not look at\\n\\t\\t\\t\\ta person who drags his lower garment in arrogance.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "11",
    "sectionHeading": "A Man Dragging his Garments",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi and Abdullah ibn\\n\\t\\t\\t\\tDinar and Zayd ibn Aslam that all of them informed him\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"On the Day of\\n\\t\\t\\t\\tRising, Allah will not look at a person who drags his\\n\\t\\t\\t\\tgarment in arrogance.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "12",
    "sectionHeading": "A Man Dragging his Garments",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from al Ala ibn Abd\\n\\t\\t\\t\\tar-Rahman that his father said, \"I asked Abu Said\\n\\t\\t\\t\\tal-Khudri about the lower garment. He said that he would\\n\\t\\t\\t\\tinform me with knowledge and that he had heard the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, 'The lower garment of the mumin should reach\\n\\t\\t\\t\\tto the middle of his calves. There is no harm in what is\\n\\t\\t\\t\\tbetween that and the ankles. What is lower than that is\\n\\t\\t\\t\\tin the Fire. What is lower than that is in the Fire. On\\n\\t\\t\\t\\tthe Day of Rising, Allah will not look at a person who\\n\\t\\t\\t\\ttrails his lower garment in arrogance.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "13",
    "sectionHeading": "A Woman Dragging her Garments",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Bakr ibn Nafi\\n\\t\\t\\t\\tfrom his father Nafi, the mawla of Ibn Umar that Safiyya\\n\\t\\t\\t\\tbint Abi Ubayd informed him that Umm Salama, the wife of\\n\\t\\t\\t\\tthe Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tsaid that when the lower garment of women was mentioned\\n\\t\\t\\t\\tto the Messenger of Allah, he said, \"She lets it down a\\n\\t\\t\\t\\thandspan.\" Umm Salama said, \"If it leaves her uncovered?\"\\n\\t\\t\\t\\tHe said, \"Then the length of a forearm and let her not\\n\\t\\t\\t\\tincrease it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "14",
    "sectionHeading": "Wearing Sandals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Do not wear\\n\\t\\t\\t\\tone sandal. Wear both of them or go with both feet bare.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "15",
    "sectionHeading": "Wearing Sandals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"When you put\\n\\t\\t\\t\\ton sandals, begin with the right foot. When you take them\\n\\t\\t\\t\\toff, begin with the left foot. The right foot is the\\n\\t\\t\\t\\tfirst to be put in the sandal and the last to be taken\\n\\t\\t\\t\\tout.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "16",
    "sectionHeading": "Wearing Sandals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from his paternal uncle\\n\\t\\t\\t\\tAbu Suhayl ibn Malik from his father that Kab al-Ahbar\\n\\t\\t\\t\\tsaid to a man who took off his sandals, \"Why have you\\n\\t\\t\\t\\ttaken off your sandals? Perhaps you have interpreted this\\n\\t\\t\\t\\tayat, 'Remove your sandals. You are in the pure valley of\\n\\t\\t\\t\\tTuwa?' (Sura 20 ayat 12) Do you know what the sandals of\\n\\t\\t\\t\\tMusa were?\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik (the father of Abu Suhayl) said, \"I do not know\\n\\t\\t\\t\\twhat the man answered.\" Kab said, \"They were made from\\n\\t\\t\\t\\tthe skin of a dead donkey.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "17",
    "sectionHeading": "Ways of Dressing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj that Abu Hurayra said, \"The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, forbade two\\n\\t\\t\\t\\tsales. Mulamasa, in which a man is obliged to buy\\n\\t\\t\\t\\twhatever he touches without any choice in the matter, and\\n\\t\\t\\t\\tmunabadha, in which two men throw their garment to each\\n\\t\\t\\t\\tother without either seeing the other's garment. He also\\n\\t\\t\\t\\tforbade two ways of dressing. One in which a man sits\\n\\t\\t\\t\\twith his legs drawn up to his chest wrapped in one\\n\\t\\t\\t\\tgarment that does not cover his genitals, and the other\\n\\t\\t\\t\\tin which a man wraps a single garment over one arm and\\n\\t\\t\\t\\tshoulder restricting them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "18",
    "sectionHeading": "Ways of Dressing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that Umar ibn al-Khattab saw a silk robe at the\\n\\t\\t\\t\\tdoor of the mosque. He said, \"Messenger of Allah, would\\n\\t\\t\\t\\tyou buy this robe and wear it on jumua and when envoys\\n\\t\\t\\t\\tcome to you?\" The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Only a person who has no\\n\\t\\t\\t\\tportion in the next world wears this.\" Then the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\tbrought some robes of the same material and gave Umar ibn\\n\\t\\t\\t\\tal-Khattab one of the robes. Umar said, \"Messenger of\\n\\t\\t\\t\\tAllah, do you clothe me in it when you said what you said\\n\\t\\t\\t\\tabout the robe of Utarid?\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"I did not\\n\\t\\t\\t\\tgive it to you to wear.\" Umar gave it to a brother of his\\n\\t\\t\\t\\tin Makka who was still an idolater.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "48",
    "hadithNumber": "19",
    "sectionHeading": "Ways of Dressing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha said, \"Anas ibn Malik said, 'I saw Umar ibn\\n\\t\\t\\t\\tal-Khattab when he was the amir of Madina. Three patches\\n\\t\\t\\t\\twere sewn between his shoulders, one patched over the\\n\\t\\t\\t\\tother.' ''\\n\\t\\t\\t</p>"
  }
]
