[
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "1",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, had wanted to take two pieces of wood to\\n\\t\\t\\t\\tstrike them together to gather people for the prayer, and\\n\\t\\t\\t\\tAbdullah ibn Zayd al-Ansari, then of the tribe of Harith\\n\\t\\t\\t\\tibn al-Khazraj, was shown two pieces of wood in his\\n\\t\\t\\t\\tsleep. He said, 'These are close to what the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, wants.'\\n\\t\\t\\t\\tThen it was said, 'Do you not call to the prayer?', so\\n\\t\\t\\t\\twhen he woke up he went to the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, and mentioned the\\n\\t\\t\\t\\tdream to him. The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, ordered the adhan.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "2",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Ata\\n\\t\\t\\t\\tibn Yazid al-Laythi from Abu Said al-Khudri that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"When you hear the adhan, repeat what the\\n\\t\\t\\t\\tmuadhdhin says.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "3",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr ibn Abd ar-Rahman, from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"If people knew what was in the adhan and\\n\\t\\t\\t\\tthe first row of the prayer and could only draw lots for\\n\\t\\t\\t\\tit, they would draw lots. And if they knew what was in\\n\\t\\t\\t\\tdoing dhuhr early, they would race each other to it. And\\n\\t\\t\\t\\tif they knew what was in isha and subh, they would go to\\n\\t\\t\\t\\tthem even if they had to crawl.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "4",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from al-Ala ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Yaqub from his father and Ishaq ibn\\n\\t\\t\\t\\tAbdullah that they informed him that they heard Abu\\n\\t\\t\\t\\tHurayra say, \"The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, 'When the iqama is called for\\n\\t\\t\\t\\tprayer, do not come to it running, but come with\\n\\t\\t\\t\\tcalmness. Pray what you catch and complete what you miss.\\n\\t\\t\\t\\tYou are in prayer as long as your aim is the prayer.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "5",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd arRahman ibn\\n\\t\\t\\t\\tAbdullah ibn Abd ar-Rahman ibn Abu Sasaca al-Ansari, and\\n\\t\\t\\t\\tlater al-Mazini, that his father told him that Abu Said\\n\\t\\t\\t\\tal-Khudri had said to him, \"I see that you love sheep and\\n\\t\\t\\t\\tthe desert. When you are among your sheep or in your\\n\\t\\t\\t\\tdesert, call the prayer and raise your voice in the\\n\\t\\t\\t\\tadhan, because I heard the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, say, 'No jinn or man\\n\\t\\t\\t\\toranything within range hears the voice of the muadhdhin\\n\\t\\t\\t\\texcept that it bears witness for him on the day of\\n\\t\\t\\t\\trising.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "6",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"When the call\\n\\t\\t\\t\\tto prayer is made Shaytan retreats, passing wind, so that\\n\\t\\t\\t\\the will not hear the adhan. When the adhan is completed\\n\\t\\t\\t\\the comes back, until, when the iqama is said, he retreats\\n\\t\\t\\t\\tagain. When the iqama is completed, he comes back, until\\n\\t\\t\\t\\the comes between a man and his self and says, 'Think of\\n\\t\\t\\t\\tsuch and such, think of such and such,' which he was not\\n\\t\\t\\t\\tthinking about before, until the man does not know how\\n\\t\\t\\t\\tmuch he has prayed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "7",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Hazim ibn Dinar\\n\\t\\t\\t\\tthat Sahl ibn Sad as-Saidi said, \"There are two times\\n\\t\\t\\t\\twhen the gates of heaven are opened, and few who make\\n\\t\\t\\t\\tsupplication have it returned to them unanswered. They\\n\\t\\t\\t\\tare at the timeof the adhan, and in a rank of people\\n\\t\\t\\t\\tfighting in the way of Allah.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether the adhan on the day of jumua was\\n\\t\\t\\t\\tcalled before the time had come for the prayer and he\\n\\t\\t\\t\\tsaid, \"It is not called until after the sun has passed\\n\\t\\t\\t\\tthe meridian.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about doubling the adhan and the iqama,\\n\\t\\t\\t\\tand at what point people had to stand when the iqama for\\n\\t\\t\\t\\tthe prayer was called. He said, \"I have heard nothing\\n\\t\\t\\t\\tabout the adhan and iqama except what I have seen people\\n\\t\\t\\t\\tdo. As for the iqama, it is not doubled. That is what the\\n\\t\\t\\t\\tpeople of knowledge in our region continue to do. As for\\n\\t\\t\\t\\tpeople standing up when the iqama for the prayer is\\n\\t\\t\\t\\tcalled, I have not heard of any definite point at which\\n\\t\\t\\t\\tit is begun, and I consider it rather to be according to\\n\\t\\t\\t\\tpeople's (individual) capacity, for some people are heavy\\n\\t\\t\\t\\tand some are light, and they are not able to be as one\\n\\t\\t\\t\\tman .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a gathering of people who wished to\\n\\t\\t\\t\\tdo the prescribed prayer calling the iqama and not the\\n\\t\\t\\t\\tadhan, and he said, \"lt is enough for them. The adhan is\\n\\t\\t\\t\\tonly obligatory in mosques where the prayer is said in\\n\\t\\t\\t\\tcongregation.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about the muadhdhin saying \"Peace be upon\\n\\t\\t\\t\\tyou\" to the imam and calling him to the prayer, and he\\n\\t\\t\\t\\twas asked who was the first person to whom such a\\n\\t\\t\\t\\tgreeting was made. He replied, \"I have not heard that\\n\\t\\t\\t\\tthis greeting occurred in the first community.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether a muadhdhin who\\n\\t\\t\\t\\tcalled the people to prayer and then waited to see if\\n\\t\\t\\t\\tanyone would come and no one did, so he said the iqama\\n\\t\\t\\t\\tand did the prayer by himself and then people came after\\n\\t\\t\\t\\the had finished, should repeat the prayer with them.\\n\\t\\t\\t\\tMalik said, \"He does not repeat the prayer, and whoever\\n\\t\\t\\t\\tcomes after he has finished should do the prayer by\\n\\t\\t\\t\\thimself.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked about a muadhdhin who\\n\\t\\t\\t\\tcalled the adhan for a group of people, did voluntary\\n\\t\\t\\t\\tprayers, and then the group of people wanted to do the\\n\\t\\t\\t\\tprayer with some one else saying the iqama. He said,\\n\\t\\t\\t\\t\"There is no harm in that. His iqama or somebody else's\\n\\t\\t\\t\\tare the same.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The subh prayer is still\\n\\t\\t\\t\\tcalled before dawn. As for the other prayers, we believe\\n\\t\\t\\t\\tthat they should only be called after the time has\\n\\t\\t\\t\\tstarted.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "8",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tmuadhdhin came to Umar ibn al-Khattab to call him to the\\n\\t\\t\\t\\tsubh prayer and found him sleeping, so he said, \"Prayer\\n\\t\\t\\t\\tis better than sleep,\" and Umar ordered him to put that\\n\\t\\t\\t\\tin the adhan for subh .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "9",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from his paternal uncle\\n\\t\\t\\t\\tAbu Suhayl ibn Malik that his uncle's father said, \"I\\n\\t\\t\\t\\trecognise nothing nowadays of what I saw the people (i.e.\\n\\t\\t\\t\\tthe companions of the Messenger, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace ) doing except the call to prayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "10",
    "sectionHeading": "The Call to Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Umar\\n\\t\\t\\t\\theard the iqama while he was in Baqi, so he increased his\\n\\t\\t\\t\\tpace of walking to the mosque.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "11",
    "sectionHeading": "The Adhan During a Journey and Without Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar called the adhan on a cold and windy night and\\n\\t\\t\\t\\tincluded the phrase, \"Do the prayer in shelter.\" Then he\\n\\t\\t\\t\\tsaid, \"The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, used to orderthe muadhdhin to say, 'Do\\n\\t\\t\\t\\tthe prayerin shelter' when it was a cold, rainy night \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "12",
    "sectionHeading": "The Adhan During a Journey and Without Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that on a\\n\\t\\t\\t\\tjourney Abdullah ibn Umar did no more than the iqama,\\n\\t\\t\\t\\texcept for subh, when he called both the adhan and the\\n\\t\\t\\t\\tiqama. Abdullah ibn Umar used to say, \"The adhan is for\\n\\t\\t\\t\\tan imam whom people join .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "13",
    "sectionHeading": "The Adhan During a Journey and Without Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said to him, \"When you are on a journey you\\n\\t\\t\\t\\tcan, if you wish, call the adhan and the iqama, or, if\\n\\t\\t\\t\\tyou wish, the iqama and not the adhan.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"There is no harm in\\n\\t\\t\\t\\ta man calling the adhan while riding.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "14",
    "sectionHeading": "The Adhan During a Journey and Without Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab used to say, \"Whoever prays on\\n\\t\\t\\t\\twaterless, desolate land - an angel prays on his right\\n\\t\\t\\t\\tand an angel prays on his left. When he calls both the\\n\\t\\t\\t\\tadhan and the iqama for the prayer, or calls out the\\n\\t\\t\\t\\tiqama, angels like mountains pray behind him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "15",
    "sectionHeading": "The Duration of the Meal before Dawn (Sahur) in Relation to the Adhan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Bilal calls\\n\\t\\t\\t\\tthe adhan whilst it is still night so eat and drink until\\n\\t\\t\\t\\tIbn Umm Maktum calls the adhan.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "16",
    "sectionHeading": "The Adhan During a Journey and Without Wudu",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Bilal calls the adhan in\\n\\t\\t\\t\\tthe night, so eat and drink until Ibn Umm Maktum calls\\n\\t\\t\\t\\tthe adhan.\" Ibn Umm Maktum was a blind man who did not\\n\\t\\t\\t\\tcall the adhan until someone said to him, \"The morning\\n\\t\\t\\t\\thas come. The morning has come.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "17",
    "sectionHeading": "The Opening of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah from Abdullah ibn Umar that the Messengerof\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, used to\\n\\t\\t\\t\\traise his hands to the level of his shoulders when he\\n\\t\\t\\t\\tbegan the prayer and when he raised his head from the\\n\\t\\t\\t\\truku he raised them in the same way, saying, \"Allah hears\\n\\t\\t\\t\\twhoever praises him, our Lord and praise belongs to You.\"\\n\\t\\t\\t\\tHe did not raise them in the sujud.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "18",
    "sectionHeading": "The Opening of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that AIi\\n\\t\\t\\t\\tibn Husayn ibn Ali ibn Abi Talib said, \"The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, used to\\n\\t\\t\\t\\tsay, 'Allah is greater' whenever he lowered himself and\\n\\t\\t\\t\\traised himself, and he continued to pray like that until\\n\\t\\t\\t\\the met Al lah .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "19",
    "sectionHeading": "The Opening of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Sa'id from\\n\\t\\t\\t\\tSulayman ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, used to raise his hands in\\n\\t\\t\\t\\tthe prayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "20",
    "sectionHeading": "The Opening of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tSalama ibn Abdar-Rahman ibn Awf that Abu Hurayra used to\\n\\t\\t\\t\\tlead them in prayer and would say \"Allah is greater\"\\n\\t\\t\\t\\twhenever he lowered himself and raised himself. When he\\n\\t\\t\\t\\thad finished he would say, \"By Allah, I am the person\\n\\t\\t\\t\\twhose prayer most resembles the prayer of the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "21",
    "sectionHeading": "The Opening of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that Abdullah ibn Umar used to say \"Allah is\\n\\t\\t\\t\\tgreater\" in the prayer whenever he lowered himself and\\n\\t\\t\\t\\traised himself.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to raise his hands to the level of his\\n\\t\\t\\t\\tshoulders when he began the prayer and when he raised his\\n\\t\\t\\t\\thead from the ruku he would raise them less than that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "22",
    "sectionHeading": "The Opening of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Nuaym Wahb ibn\\n\\t\\t\\t\\tKaysan that Jabir ibn Abdullah used to teach them the\\n\\t\\t\\t\\ttakbir in the prayer. Abu Nuaym said, \"He used to tell us\\n\\t\\t\\t\\tto say 'Allah is greater' whenever we lowered or raised\\n\\t\\t\\t\\tourselves.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "23",
    "sectionHeading": "The Opening of the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab used to\\n\\t\\t\\t\\tsay, \"When a man catches the raka he says, 'Allah is\\n\\t\\t\\t\\tgreater' once, and that takbir is enough for him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"That is if he intended to begin the prayer\\n\\t\\t\\t\\tby that takbir \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who began with the imam but\\n\\t\\t\\t\\tforgot the opening takbir and the takbir of the ruku\\n\\t\\t\\t\\tuntil he had done one raka. Then he remembered that he\\n\\t\\t\\t\\thad not said the takbir at the opening nor in the ruku,so\\n\\t\\t\\t\\the said the takbir in the second raka. He said, \"I prefer\\n\\t\\t\\t\\tthat he start his prayer again, but if he forgets the\\n\\t\\t\\t\\topening takbir with the imam and says the takbir in the\\n\\t\\t\\t\\tfirst ruku, I consider that enough for him if he intends\\n\\t\\t\\t\\tby it the opening takbir.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about some one who prayed by himself and\\n\\t\\t\\t\\tforgot the opening takbir, \"He begins his prayer afresh\\n\\t\\t\\t\\t.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about an imam who forgot the opening takbir\\n\\t\\t\\t\\tuntil he had finished his prayer, \"I think that he should\\n\\t\\t\\t\\tdo the prayer again, and those behind him, even if they\\n\\t\\t\\t\\thave said the takbir.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "24",
    "sectionHeading": "The Recitation of Qur'an in the Maghrib and lsha Prayers.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tMuhammad ibn Jubayr ibn Mutim that his father said, \"I\\n\\t\\t\\t\\theard the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, recite at-Tur (Sura 52) in the maghrib\\n\\t\\t\\t\\tprayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "25",
    "sectionHeading": "The Recitation of Qur'an in the Maghrib and lsha Prayers.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud from Abdullah\\n\\t\\t\\t\\tibn Abbas that Umm al-Fadl bint al-Harith heard him\\n\\t\\t\\t\\treciting al Mursalat (sura 77) and she said to him, \"My\\n\\t\\t\\t\\tson, you have reminded me by reciting this sura that it\\n\\t\\t\\t\\twas what I last heard the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, recite in the maghrib\\n\\t\\t\\t\\tprayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "26",
    "sectionHeading": "The Recitation of Qur'an in the Maghrib and lsha Prayers.",
    "text": "<p>\\n\\t\\t\\t\\t26 Yahya related to me from Malik from Abu Ubayd, the\\n\\t\\t\\t\\tmawla of Sulayman ibn Abd alMalik, from Ubada ibn Nusayy\\n\\t\\t\\t\\tfrom Qays ibn al Harith that Abu Abdullah as-Sunabihi\\n\\t\\t\\t\\tsaid, \"I arrived in Madina in the khalifate of Abu Bakr\\n\\t\\t\\t\\tas-Siddiq, and I prayed maghrib behind him. He recited\\n\\t\\t\\t\\tthe umm al Qur'an and two suras from the shorter ones of\\n\\t\\t\\t\\tthe mufassal in the first two rakas. Then he stood up in\\n\\t\\t\\t\\tthe third and I drew so near to him that my clothes were\\n\\t\\t\\t\\talmost touching his clothes. I heard him reciting the umm\\n\\t\\t\\t\\tal-Qur'an and this ayat, 'Our Lord, do not make our\\n\\t\\t\\t\\thearts go astray after You have guided us, and give us\\n\\t\\t\\t\\tmercy from Your presence. Surely You are the Giver. ' \"\\n\\t\\t\\t\\t(Sura 3 ayat 8)\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "27",
    "sectionHeading": "The Recitation of Qur'an in the Maghrib and lsha Prayers.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to recite in all four rakas as when he\\n\\t\\t\\t\\tprayed alone - in every raka the umm al-Qur'an and\\n\\t\\t\\t\\tanother sura from the Qur'an. Sometimes he would recite\\n\\t\\t\\t\\ttwo or three suras in one raka in the obligatory prayer.\\n\\t\\t\\t\\tSimilarly, he recited the umm al-Qur'an and two suras in\\n\\t\\t\\t\\tthe first two rakas of maghrib.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "28",
    "sectionHeading": "The Recitation of Qur'an in the Maghrib and lsha Prayers.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAdi ibn Thabit al-Ansari that al-Barra ibn Azib said, \"I\\n\\t\\t\\t\\tprayed isha with the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and he recited at-Tin (Sura 95)\\n\\t\\t\\t\\tin it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "29",
    "sectionHeading": "Behaviour in the Recitation",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Ibrahim ibn\\n\\t\\t\\t\\tAbdullah ibn Hunayn from\\n\\t\\t\\t\\thisfatherfromAliibnAbiTalibthattheMessengerof Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbade wearing the\\n\\t\\t\\t\\tqassi (an Egyptian garment, stripedwithsilk),wearing gold\\n\\t\\t\\t\\trings, and reciting the Qur'an in ruku.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "30",
    "sectionHeading": "Behaviour in the Recitation",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Ibrahim ibn al Harith at-Taymi from Abu\\n\\t\\t\\t\\tHazim at-Tammar from al Bayadi that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, came out\\n\\t\\t\\t\\tto the people while they were praying and their voices\\n\\t\\t\\t\\twere raised in the recitation. He said, \"When you pray\\n\\t\\t\\t\\tyou are talking confidentially to your Lord. So look to\\n\\t\\t\\t\\twhat you confide to Him, and do not say the Qur'an out\\n\\t\\t\\t\\tloud so that others hear it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "31",
    "sectionHeading": "Behaviour in the Recitation",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd at-Tawil that\\n\\t\\t\\t\\tAnas ibn Malik said, \"I stood behind Abu Bakr and Umar\\n\\t\\t\\t\\tand Uthman and none of them used to recite 'In the name\\n\\t\\t\\t\\tof Allah, the Merciful, the Compassionate' when they\\n\\t\\t\\t\\tbegan the prayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "32",
    "sectionHeading": "Behaviour in the Recitation",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from his paternal uncle\\n\\t\\t\\t\\tAbu Suhayl ibn Malik that his father said, \"We heard the\\n\\t\\t\\t\\trecitation of Umar ibn al-Khattab when we were at the\\n\\t\\t\\t\\thome of Abu Jahmin al-Balat.\" (Al-Balat was a place in\\n\\t\\t\\t\\tMadina between the mosque and the market.)\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "33",
    "sectionHeading": "Behaviour in the Recitation",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that when\\n\\t\\t\\t\\tAbdullah ibn Umar missed anything of the prayer in which\\n\\t\\t\\t\\tthe imam recited out loud, he would stand up when the\\n\\t\\t\\t\\timam had said the taslim and recite what he owed out loud\\n\\t\\t\\t\\tto himself.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "34",
    "sectionHeading": "Behaviour in the Recitation",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yazid ibn Ruman said,\\n\\t\\t\\t\\t\"I used to pray next to Nafi ibn Jubayr ibn Mutim and he\\n\\t\\t\\t\\twould nudge me to prompt him while we were praying.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "35",
    "sectionHeading": "The Recitation in the Subh Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Abu Bakr as-Siddiq prayed subh and\\n\\t\\t\\t\\trecited suratal-Baqara in the two rak'as.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "36",
    "sectionHeading": "The Recitation in the Subh Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father heard Abdullah ibn Amir ibn Rabia say, \"We\\n\\t\\t\\t\\tprayed subh behind Umar ibn al-Khattab and he recited\\n\\t\\t\\t\\tsuraYusuf (Sura 12) and surat al-Hajj (Sura 22) slowly.\"\\n\\t\\t\\t\\tI (Hisham's father) said, \"By Allah, then it must have\\n\\t\\t\\t\\tbeen his habit to get up at the crack of dawn.\" He said,\\n\\t\\t\\t\\t\"Of course.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "37",
    "sectionHeading": "The Recitation in the Subh Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said and\\n\\t\\t\\t\\tRabia ibn Abi Abd arRahman from al-Qasim ibn Muhammad\\n\\t\\t\\t\\tthat al Furafisa ibn Umayral-Hanafi said, \"I only learnt\\n\\t\\t\\t\\tSura Yusuf (Sura 12) from the recitation of it by Uthman\\n\\t\\t\\t\\tibn Affan in the subh prayer because of the great number\\n\\t\\t\\t\\tof times he repeated it to us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "38",
    "sectionHeading": "The Recitation in the Subh Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to recite the first ten suras of the\\n\\t\\t\\t\\tmufassal in the subh prayer, and on a journey he would\\n\\t\\t\\t\\trecite the ummal-Qur'an and a sura in every raka.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "39",
    "sectionHeading": "The Umm al-Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from al-Ala ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Yaqub that Abu Said, the mawla of Amir ibn\\n\\t\\t\\t\\tKuraz told him that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, called toUbayy ibn Kab\\n\\t\\t\\t\\twhile he was praying. When Ubayy had finished his prayer\\n\\t\\t\\t\\the joined the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and the Messenger of Allah put his hand\\n\\t\\t\\t\\tupon his hand, and he was intending to leave by the door\\n\\t\\t\\t\\tof the mosque, so the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"I hope that you will not\\n\\t\\t\\t\\tleave the mosque until you know a sura whose like Allah\\n\\t\\t\\t\\thas notsentdown in the Tawrah nor in the Injil nor in the\\n\\t\\t\\t\\tQur'an.\" Ubayysaid, \"I began to slow down my pace in the\\n\\t\\t\\t\\thope of that. Then I said, 'Messenger of Allah, the sura\\n\\t\\t\\t\\tyou promised me!' He said, 'What do you recite when you\\n\\t\\t\\t\\tbegin the prayer?' I recited the Fatiha (Sura 1 ) until I\\n\\t\\t\\t\\tcame to the end of it, and the Messengerof Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, 'It is this\\n\\t\\t\\t\\tsura, and it is the \"seven oft-repeated\" and the Great\\n\\t\\t\\t\\tQur'an which I was given.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "40",
    "sectionHeading": "The Umm al-Qur'an",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Nuaym Wahb ibn\\n\\t\\t\\t\\tKaysan that he heard Jabir ibn Abdullah say, \"Someone who\\n\\t\\t\\t\\tprays a raka without reciting the umm al-Qur'an in it has\\n\\t\\t\\t\\tnot done the prayer except behind an imam.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "41",
    "sectionHeading": "Reciting to Oneself behind the Imam when He does not Recite Aloud",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from al-Ala ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Ya'qub that he heard Abu's-Sa'ib, the mawla\\n\\t\\t\\t\\tof Hisham ibn Zuhra, say he had heard Abu Hurayra say, \"I\\n\\t\\t\\t\\theard the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, say, 'Whoever prays a prayer without\\n\\t\\t\\t\\treciting the umm al-Qur'an in it, his prayer is aborted,\\n\\t\\t\\t\\tit is aborted, it is aborted, incomplete.' So I said,\\n\\t\\t\\t\\t'Abu Hurayra, sometimes I am behind the imam.'Hepulled my\\n\\t\\t\\t\\tforearm and said, 'Recite it to yourself, O Persian, for\\n\\t\\t\\t\\tI heard the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, say that Allah the Blessed, the Exalted,\\n\\t\\t\\t\\tsaid, \"I have divided the prayer into two halves between\\n\\t\\t\\t\\tme and my slave. One half of it is for Me and one half of\\n\\t\\t\\t\\tit is for IVly slave, and My slave has what he asks.\" '\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Recite.\" The slave says,\\t'Praise be to\\n\\t\\t\\t\\tAIIah, the Lord of theWorlds.'\\tAllah the Blessed, the\\n\\t\\t\\t\\tExalted, says, 'My slave has praised Me.' The slave says,\\n\\t\\t\\t\\t'The Merciful, the Compassionate.' Allah says, 'My slave\\n\\t\\t\\t\\thas spoken well of Me.' The slave says, 'Master of the\\n\\t\\t\\t\\tDay of the Deen.' Allah says, 'My slave has glorified\\n\\t\\t\\t\\tMe.' The slave says, 'You alone we worship and You alone\\n\\t\\t\\t\\twe askforhelp.'Allahsays,'This ayat is between Me and My\\n\\t\\t\\t\\tslave, and for My slave is what he asks. 'The slave says,\\n\\t\\t\\t\\t'Guide us in the straight Path, the Path of those whom\\n\\t\\t\\t\\tYou have blessed, not of those with whom You are angry,\\n\\t\\t\\t\\tnor those who are in error. ' Allah says, 'These are for\\n\\t\\t\\t\\tMy slaves, and for my slave is what he asks . ' \" ' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "42",
    "sectionHeading": "Reciting to Oneself behind the Imam when He does not Recite Aloud",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father used to recite behind the imam when the imam\\n\\t\\t\\t\\tdid not recite aloud.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "43",
    "sectionHeading": "Reciting to Oneself behind the Imam when He does not Recite Aloud",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said and\\n\\t\\t\\t\\tfrom Rabia ibn Abi Abd ar Rahman that al-Qasim ibn\\n\\t\\t\\t\\tMuhammad used to recite behind the imam when the imam did\\n\\t\\t\\t\\tnot recite aloud.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "44",
    "sectionHeading": "Reciting to Oneself behind the Imam when He does not Recite Aloud",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Ruman that\\n\\t\\t\\t\\tNafi ibn Jubayr ibn Mutim used to recite behind the imam\\n\\t\\t\\t\\twhen hedid not recite aloud .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the most preferable to me of what I\\n\\t\\t\\t\\thave heard about the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "45",
    "sectionHeading": "Not Reciting behind the Imam when He Recites Aloud",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar, when asked if anyone should recite behind an\\n\\t\\t\\t\\timam, said, \"When you pray behind an imam then the\\n\\t\\t\\t\\trecitation of the imam is enough for you and when you\\n\\t\\t\\t\\tpray on your own you must recite.\" Nafi added, \"Abdullah\\n\\t\\t\\t\\tibn 'Umar used not to recite behind the imam.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"The position with us\\n\\t\\t\\t\\tis that aman recites behind the imam when the imam does\\n\\t\\t\\t\\tnot recite aloud and he refrains from reciting when the\\n\\t\\t\\t\\timam recites aloud.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "46",
    "sectionHeading": "Not Reciting behind the Imam when He Recites Aloud",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Ibn\\n\\t\\t\\t\\tUkayma al-Laythi from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, finished\\n\\t\\t\\t\\ta prayer in which he had recited aloud and asked, \"Did\\n\\t\\t\\t\\tany of you recite with me just now?\" One man said, \"Yes,\\n\\t\\t\\t\\tI did, Messenger of Allah.\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"I was saying\\n\\t\\t\\t\\tto myself, 'Why am I distracted from the Qur'an?' \" When\\n\\t\\t\\t\\tthe people heard the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, say that, they refrained from\\n\\t\\t\\t\\treciting with the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, when he recited aloud.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "47",
    "sectionHeading": "Saying 'Amin' behind the Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Sa'id\\n\\t\\t\\t\\tibn al-Musayyab and Abu Salama ibn Abd ar-Rahman told him\\n\\t\\t\\t\\tfrom Abu Hurayra that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"When the imam says\\n\\t\\t\\t\\t'Amin', say 'Amin', for the one whose 'Amin' coincides\\n\\t\\t\\t\\twith the 'Amin' of the angels - his previous wrong\\n\\t\\t\\t\\tactions are forgiven him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Shihab said, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, used to say 'Aameen' (extending\\n\\t\\t\\t\\tit).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "48",
    "sectionHeading": "Saying 'Amin' behind the Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr, from Abu Salih as Samman, from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"When the imam has said, 'not of those with\\n\\t\\t\\t\\twhom You are angry nor of those who are in error,' say\\n\\t\\t\\t\\t'Amin', for the previous wrong actions of the one whose\\n\\t\\t\\t\\tutterance coincides with that of the angels, are forgiven\\n\\t\\t\\t\\thim.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "49",
    "sectionHeading": "Saying 'Amin' behind the Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"When one of\\n\\t\\t\\t\\tyou says 'Amin' and the angels in the sky say 'Amin' so\\n\\t\\t\\t\\tthat one coincides with the other, his previous wrong\\n\\t\\t\\t\\tactions are forgiven him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "50",
    "sectionHeading": "Saying 'Amin' behind the Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr, from Abu Salih as-Samman from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"When the imam says, 'Allah hears whoever\\n\\t\\t\\t\\tpraises Him,' say 'O Allah! Our Lord, praise be toYou,\\n\\t\\t\\t\\t'for the previous wrong actions done by the one whose\\n\\t\\t\\t\\tutterance coincides with that of the angels are\\n\\t\\t\\t\\tforgiven.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "51",
    "sectionHeading": "Behaviour in the Sitting in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muslim ibn Abi Maryam\\n\\t\\t\\t\\tthat AIi ibn Abd ar-Rahman al-Muawi said, \"Abdullah ibn\\n\\t\\t\\t\\tUmar saw me playing with some small pebbles in the\\n\\t\\t\\t\\tprayer. When I finished he forbade me, saying, 'Do as the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, did.' I said, 'What did the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, do?' He said,\\n\\t\\t\\t\\t'When he sat in the prayer, he placed his right hand on\\n\\t\\t\\t\\this right thigh and he closed his fist and pointed his\\n\\t\\t\\t\\tindex finger, and he placed his left hand on his left\\n\\t\\t\\t\\tthigh. That is what he used to do.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "52",
    "sectionHeading": "Behaviour in the Sitting in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tthat he had seen Abdullah ibn Umar with a man praying at\\n\\t\\t\\t\\this side. When the man sat in the fourth raka, heput both\\n\\t\\t\\t\\tfeet to one side and crossed them. When Abdullah\\n\\t\\t\\t\\tfinished, he disapproved of that to him, and the man\\n\\t\\t\\t\\tprotested, \"But you do the same.\" Abdullah ibn Umar said,\\n\\t\\t\\t\\t\"I am ill.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "53",
    "sectionHeading": "Behaviour in the Sitting in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sadaqa ibn Yasar that\\n\\t\\t\\t\\tal-Mughira ibn Hakim saw Abdullah ibn Umar sit back from\\n\\t\\t\\t\\tthe two sajdas of the prayer onto the top of his feet.\\n\\t\\t\\t\\tWhen he had finished, al-Mughira mentioned it to him, and\\n\\t\\t\\t\\tAbdullah ibn Umar explained, \"It is not a sunna of the\\n\\t\\t\\t\\tprayer. I do it because I am ill.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "54",
    "sectionHeading": "Behaviour in the Sitting in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim that Abdullah ibn Umar told him that he used to\\n\\t\\t\\t\\tsee Abdullah ibn Umar cross his legs in the sitting\\n\\t\\t\\t\\tposition of the prayer.He said, \"So I did the same, and I\\n\\t\\t\\t\\twas young at the time. Abdullah ibn Umar forbade me and\\n\\t\\t\\t\\tsaid, 'The sunna of the prayer is that you keep your\\n\\t\\t\\t\\tright foot vertical and lay your left foot down.' I said\\n\\t\\t\\t\\tto him, 'But you do the same (as I did).' He said, 'My\\n\\t\\t\\t\\tfeet do not support me.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "55",
    "sectionHeading": "Behaviour in the Sitting in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad showed them how to sit in the\\n\\t\\t\\t\\ttashahhud, and he kept his right foot vertical and laid\\n\\t\\t\\t\\this left foot down, and sat on his left haunch not on his\\n\\t\\t\\t\\tfoot. Then he said, \"Abdullah ibn Abdullah ibn Umar saw\\n\\t\\t\\t\\tme doing this and related to me that his father used to\\n\\t\\t\\t\\tdo the same thing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "56",
    "sectionHeading": "Tashahhud in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr from Abd ar-Rahman ibn Abd al-Qari that he\\n\\t\\t\\t\\theard Umar ibn al-Khattab say, while he was teaching\\n\\t\\t\\t\\tpeople the tashahhud from the mimbar, \"Say, Greetings\\n\\t\\t\\t\\tbelong to Allah. Pure actions belong to Allah. Good words\\n\\t\\t\\t\\tand prayers belong to Allah. Peace on you, Prophet, and\\n\\t\\t\\t\\tthe mercy of Allah and His blessings. Peace be upon us\\n\\t\\t\\t\\tand on the slaves of Allah who are salihun. I testify\\n\\t\\t\\t\\tthat there is no god except Allah. And I testify that\\n\\t\\t\\t\\tMuhammad is His slave and His messenger.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'At-tahiyatu lillah, az-zakiyatu lillah, at-tayibatu\\n\\t\\t\\t\\twa's-salawatu lillah. As-salamu alayka ayyuha'nnabiyyu wa\\n\\t\\t\\t\\trahmatu'llahi wa barakatuhu. As-salamu alayna wa ala\\n\\t\\t\\t\\tibadi'llahi s-salihin. Ash-hadu an la ilaha illa 'llah wa\\n\\t\\t\\t\\tash-hadu anna Muhammadan abduhu wa rasuluh.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "57",
    "sectionHeading": "Tashahhud in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say the tashahhud saying, \"In the name\\n\\t\\t\\t\\tof Allah. Greetings belong to Allah. Prayers belong to\\n\\t\\t\\t\\tAllah. Pure actions belong to Allah. Peace be on the\\n\\t\\t\\t\\tProphet and the mercy of Allah and His blessings. Peace\\n\\t\\t\\t\\tbe on us and on the slaves of Allah who are salihun. I\\n\\t\\t\\t\\ttestify that there is no god except Allah. I testify that\\n\\t\\t\\t\\tMuhammad is the Messenger of Allah.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"Bismillah, at-tahiyatu lillah, as-salawatu lillah,\\n\\t\\t\\t\\taz-zakiyatu lillah. As-salamu ala'n-nabiyyi wa\\n\\t\\t\\t\\trahmatullahi wa barakatuhu. As-salamu alayna wa ala\\n\\t\\t\\t\\tibadi'llahi's-salihin. Shahidtu an la ilaha illallah.\\n\\t\\t\\t\\tShahidtu anna Muhammadu'r-rasulu'llah.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe used to say this after the first two rakas and he\\n\\t\\t\\t\\twould make supplication with whatever seemed fit to him\\n\\t\\t\\t\\twhen the tashahhud was completed. When he sat at the end\\n\\t\\t\\t\\tof the prayer, he did the tashahhud in a similar manner,\\n\\t\\t\\t\\texcept that after the tashahhud he made supplication with\\n\\t\\t\\t\\twhatever seemed fit to him. When he had completed the\\n\\t\\t\\t\\ttashahhud and intended to say the taslim, he said, \"Peace\\n\\t\\t\\t\\tbe on the Prophet and His mercy and blessings. Peace be\\n\\t\\t\\t\\tupon us and on the slaves of Allah who are salihun.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"As-salamu ala'n-nabiyyi wa rahmatu'llahi wa barakatuhu.\\n\\t\\t\\t\\tAs-salamu alayna wa ala ibadi'llahi'ssalihin .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe then said, \"Peace be upon you\" to his right, and would\\n\\t\\t\\t\\treturn the greeting to the imam, and if anyone said\\n\\t\\t\\t\\t\"Peace be upon you\" from his left he would return the\\n\\t\\t\\t\\tgreeting to him.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "58",
    "sectionHeading": "Tashahhud in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, used to\\n\\t\\t\\t\\tsay in the tashahhud, \"Greetings, good words, prayers,\\n\\t\\t\\t\\tpure actions belong to Allah. I testify that there is no\\n\\t\\t\\t\\tgod except Allah, alone without partner, and that\\n\\t\\t\\t\\tMuhammad is His slave and His Messenger. Peace be on you,\\n\\t\\t\\t\\tProphet, and the mercy of Allah and His blessings. Peace\\n\\t\\t\\t\\tbe on us and on the slaves of Allah who are salihun.\\n\\t\\t\\t\\tPeace be upon you.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"At-tahiyatu, at-tayibatu, as-salawatu, az-zakiyatu\\n\\t\\t\\t\\tlillah. Ash-hadu an la ilaha illa'llah, wahdahu la\\n\\t\\t\\t\\tsharika lah wa anna Muhammadan abduhu wa rasuluhu.\\n\\t\\t\\t\\tAs-salamu alayka ayyuha-n-nabiyyu wa rahmatu-llahi wa\\n\\t\\t\\t\\tbarakatuhu. As-salamu alayna wa ala\\n\\t\\t\\t\\tibadi-llahi's-salihin. As-salamu alaykum.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "59",
    "sectionHeading": "Tashahhud in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said\\n\\t\\t\\t\\tal-Ansari that al-Qasim ibn Muhammad ibn Muhammad told\\n\\t\\t\\t\\thim that A'isha, the wife of the prophet, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, used to say in the tashahhud,\\n\\t\\t\\t\\t\"Greetings, good words, prayers, pure actions belong to\\n\\t\\t\\t\\tAllah. I testify that there is no god except Allah, alone\\n\\t\\t\\t\\twithout partner, and I testify that Muhammad is the slave\\n\\t\\t\\t\\tof Allah and His Messenger. Peace be upon you, Prophet,\\n\\t\\t\\t\\tand the mercy of Allah and His blessings. Peace be upon\\n\\t\\t\\t\\tus and on the slaves of Allah who are salihun . Peace be\\n\\t\\t\\t\\tupon you . \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"At-tahiyatu, at-tayibatu, as-salawatu, az-zakiyatu\\n\\t\\t\\t\\tlillah. Ash-hadu an la ilaha illa'llah, wahdahu la\\n\\t\\t\\t\\tsharika llah wa ash-hadu anna Muhammadan abduhu wa\\n\\t\\t\\t\\trasuluhu. As-salamu alayka ayyuha-n-nabiyyu wa\\n\\t\\t\\t\\trahmatu-llahi wa barakatuhu. As-salamu alayna wa ala\\n\\t\\t\\t\\tibadi-llahi's-salihin. As-salamu alaykum.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "60",
    "sectionHeading": "Tashahhud in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he asked Ibn Shihab\\n\\t\\t\\t\\tand Nafi, the mawla of Ibn Umar, whether a man who joined\\n\\t\\t\\t\\tan imam who had already done a raka should say the\\n\\t\\t\\t\\ttashahhud with the imam in the second and fourth rakas,\\n\\t\\t\\t\\teven though these were odd for him? They said, \"He should\\n\\t\\t\\t\\tsay tashahhud with him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the position with us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "61",
    "sectionHeading": "What to Do If One Raises One's Head Before the Imam.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Amr ibn\\n\\t\\t\\t\\tAIqama from Malik ibn Abdullah as-Sadi that Abu Hurayra\\n\\t\\t\\t\\tsaid, \"The one who raises his head and lowers it before\\n\\t\\t\\t\\tthe imam - his forelock is in the hand of a shaytan.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, concerning someone who forgot and raised his\\n\\t\\t\\t\\thead before the imam in ruku or sujud, \"The sunna of that\\n\\t\\t\\t\\tis to return to bowing or prostrating and not to wait for\\n\\t\\t\\t\\tthe imam to come up. What he has done is a mistake,\\n\\t\\t\\t\\tbecause the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, 'The imam is appointed to be\\n\\t\\t\\t\\tfollowed as a leader, so do not oppose him.' Abu Hurayra\\n\\t\\t\\t\\tsaid, 'The one who raises his head and lowers it before\\n\\t\\t\\t\\tthe imam - his forelock is in the hand of a shaytan.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "62",
    "sectionHeading": "What to Do if through Forgetfulness One Says the Taslim after Two Rakas",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Abi Tamima\\n\\t\\t\\t\\tas-Sakhtayani from Muhammad ibn Sirin from Abu Hurayra\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, finished the prayer after two rakas and\\n\\t\\t\\t\\tDhu'l-Yadayn said to him, \"Has the prayer been shortened\\n\\t\\t\\t\\tor have you forgotten, Messenger of Allah?\" The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Has Dhu'l-Yadayn spoken the truth?\"  The people said,\\n\\t\\t\\t\\t\"Yes,\" and the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, stood and prayed the other two rakas\\n\\t\\t\\t\\tand then said, \"Peace be upon you.\" Then he said, \"Allah\\n\\t\\t\\t\\tis greater\" and went into a sadja as long as his usual\\n\\t\\t\\t\\tprostrations or longer. Then he came up and said, \"Allah\\n\\t\\t\\t\\tis greater\" and went into a sajda as long as his usual\\n\\t\\t\\t\\tprostrations or longer and then came up.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "63",
    "sectionHeading": "What to Do if through Forgetfulness One Says the Taslim after Two Rakas",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Da'ud ibn al-Husayn\\n\\t\\t\\t\\tthat Abu Sufyan, the mawla of Ibn Abi Ahmad, said that he\\n\\t\\t\\t\\theard Abu Hurayra say, \"The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, prayed asr and said the\\n\\t\\t\\t\\ttaslim after two rakas. Dhu'l-Yadayn stood up and said,\\n\\t\\t\\t\\t'Has the prayer been shortened, Messenger of Allah, or\\n\\t\\t\\t\\thave you forgotten?' The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, stood up and completed\\n\\t\\t\\t\\twhat remained of the prayer, and then, remaining sitting\\n\\t\\t\\t\\tafter saying the taslim, he made two prostrations.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "64",
    "sectionHeading": "What to Do if through Forgetfulness One Says the Taslim after Two Rakas",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Abu\\n\\t\\t\\t\\tBakr ibn Sulayman ibn Abi Hathma said, \"I have heard that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, prayed two rakas of one of the two day-ti me\\n\\t\\t\\t\\tprayers, dhuhr or asr, and said the taslim after two\\n\\t\\t\\t\\trakas. Dhu'sh-Shamalayn said to him, 'Has the prayer been\\n\\t\\t\\t\\tshortened, Messenger of Allah, or have you forgotten?'\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'The prayer has not been shortened and I\\n\\t\\t\\t\\thave not forgotten.' Dhu'shShamalayn said, 'It was\\n\\t\\t\\t\\tcertainly one of those, Messenger of Allah.' The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, approached the people and said, 'Has Dh\\n\\t\\t\\t\\tu'sh-Shamalayn spoken the truth?' They said, 'Yes,\\n\\t\\t\\t\\tMessenger of Allah,' and the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, completed what\\n\\t\\t\\t\\tremained of the prayer, and then said, 'Peace be upon\\n\\t\\t\\t\\tyou.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "65",
    "sectionHeading": "What to Do if through Forgetfulness One Says the Taslim after Two Rakas",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab, and from Abu Salama ibn Abd ar-Rahman,\\n\\t\\t\\t\\tthe same as that.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Every forgetfulness which decreases from the\\n\\t\\t\\t\\tprayer, prostrations for it come before the greeting, and\\n\\t\\t\\t\\tevery forgetfulness which is an addition to the prayer,\\n\\t\\t\\t\\tprostrations for it come after the greeting.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "66",
    "sectionHeading": "Completing what is Recalled When Uncertain how much has been Prayed.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"If you are\\n\\t\\t\\t\\tuncertain in the prayer and do not know whether you have\\n\\t\\t\\t\\tprayed three or four rakas, then pray a raka and make two\\n\\t\\t\\t\\tprostrations from the sitting position before the taslim.\\n\\t\\t\\t\\tIf the raka that you prayed was the fifth, then you make\\n\\t\\t\\t\\tit even by these two sajdas, and if it was the fourth,\\n\\t\\t\\t\\tthen the two prostrations spite Shaytan.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "67",
    "sectionHeading": "Completing what is Recalled When Uncertain how much has been Prayed.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Umar ibn Muhammad ibn\\n\\t\\t\\t\\tZayd from Salim ibn Abdullah that Abdullah ibn Umar used\\n\\t\\t\\t\\tto say, \"If you are uncertain in the prayer, estimate\\n\\t\\t\\t\\twhat you think you have forgotten of the prayer and\\n\\t\\t\\t\\trepeat it, then do the two sajdas of forgetfulness from\\n\\t\\t\\t\\tthe sitting position.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "68",
    "sectionHeading": "Completing what is Recalled When Uncertain how much has been Prayed.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Afif ibn Amr as-Sahmi\\n\\t\\t\\t\\tthat Ata ibn Yasar said, \"I asked Abdullah ibn Amr ibn\\n\\t\\t\\t\\tal-As and Kab al Ahbar about someone who was uncertain in\\n\\t\\t\\t\\this prayer, and did not know whether he had prayed three\\n\\t\\t\\t\\tor four rakas. Both of them said, 'He should pray another\\n\\t\\t\\t\\traka and then do two sajdas from the sitting position.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "69",
    "sectionHeading": "Completing what is Recalled When Uncertain how much has been Prayed.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar, when questioned about forgetfulness in the\\n\\t\\t\\t\\tprayer, said, \"If you think that you have forgotten part\\n\\t\\t\\t\\tof the prayer, then pray it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "70",
    "sectionHeading": "What to Do if One Stands After the Completion of the Prayer or After Two Rakas.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tal-Araj that Abdullah ibn Buhayna said, \"The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, prayed\\n\\t\\t\\t\\ttwo rakas with us and then stood without sitting and the\\n\\t\\t\\t\\tpeople stood with him. When he had finished the prayerand\\n\\t\\t\\t\\twe had seen him say the taslim, he said 'Allah is\\n\\t\\t\\t\\tgreater' and did two sajdas from the sitting position and\\n\\t\\t\\t\\tthen said the taslim again.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "71",
    "sectionHeading": "What to Do if One Stands After the Completion of the Prayer or After Two Rakas.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAbd ar-Rahman ibn Hurmuz that Abdullah ibn Buhayna said,\\n\\t\\t\\t\\t\"The Messengerof Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, prayed dhuhr with us and he stood straight up\\n\\t\\t\\t\\tafter two rakas without sitting. When he had finished the\\n\\t\\t\\t\\tprayer, he did two sajdas and then said the taslim after\\n\\t\\t\\t\\tthat.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, concerning someone who forgot in his prayer\\n\\t\\t\\t\\tand stood up after he had completed four rakas and\\n\\t\\t\\t\\trecited and then went into ruku and then, when he raised\\n\\t\\t\\t\\this head from ruku, remembered that he had already\\n\\t\\t\\t\\tcompleted (his prayer), \"He returns to a sitting position\\n\\t\\t\\t\\tand does not do any sajda. If he has already done one\\n\\t\\t\\t\\tsajda I do not think he should do the other. Then when\\n\\t\\t\\t\\this prayer is finished he does two sajdas from the\\n\\t\\t\\t\\tsitting position after saying the taslim.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "72",
    "sectionHeading": "Looking in the Prayer at What Distracts You from It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from AIqama ibn Abi AIqama\\n\\t\\t\\t\\tfrom his mother that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Abu Jahm ibn\\n\\t\\t\\t\\tHudhayfa gave the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, a fine striped garment from Syria\\n\\t\\t\\t\\tand he did the prayer in it. When he had finished he\\n\\t\\t\\t\\tsaid, 'Give this garment back to Abu Jahm. I lookedat its\\n\\t\\t\\t\\tstripes in the prayer and they almost distracted me.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "73",
    "sectionHeading": "Looking in the Prayer at What Distracts You from It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Hisham ibn Urwa from his father\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, wore a fine striped garment f rom Syria,\\n\\t\\t\\t\\tand then gave it to Abu Jahm and took a plain, rough,\\n\\t\\t\\t\\tgarment in return. Abu Jahm asked, \"Messenger of Allah!\\n\\t\\t\\t\\tWhy?\" He said, \"I looked at its stripes in the prayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "74",
    "sectionHeading": "Looking in the Prayer at What Distracts You from It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Abi Bakr that Abu\\n\\t\\t\\t\\tTalha al-Ansari was praying in his garden when a wild\\n\\t\\t\\t\\tpigeon flew in and began to fly to and fro trying to find\\n\\t\\t\\t\\ta way out. The sight was pleasing to him and he let his\\n\\t\\t\\t\\teyes follow the bird for a time and then he went back to\\n\\t\\t\\t\\this prayer but could not remember how much he had prayed.\\n\\t\\t\\t\\tHe said, \"A trial has befallen me in this property of\\n\\t\\t\\t\\tmine.\" So he came to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and mentioned the trial\\n\\t\\t\\t\\tthat had happened to him in his garden and said,\\n\\t\\t\\t\\t\"Messenger of Allah, it is a sadaqa for Allah, so dispose\\n\\t\\t\\t\\tof it wherever you wish.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "3",
    "hadithNumber": "75",
    "sectionHeading": "Looking in the Prayer at What Distracts You from It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tthat a man from the Ansar was praying in a garden of his\\n\\t\\t\\t\\tin Quff, one of the valleys of Madina, during the date\\n\\t\\t\\t\\tseason and the palms' branches were weighed down with\\n\\t\\t\\t\\tfruit on all sides. He looked at them and what he saw of\\n\\t\\t\\t\\ttheir fruits amazed him. Then he went back to his prayer\\n\\t\\t\\t\\tand he did not know how much he had prayed. He said, \"A\\n\\t\\t\\t\\ttrial has befallen me in this property of mine.\" So he\\n\\t\\t\\t\\twent toUthman ibn Affan, who was the khalifa at the time,\\n\\t\\t\\t\\tand mentioned it to him and said, \"It is sadaqa, so give\\n\\t\\t\\t\\tit away in the paths of good.\" Uthman ibn Affan sold it\\n\\t\\t\\t\\tfor fifty thousand and so that property became known as\\n\\t\\t\\t\\tthe Fifty.\\n\\t\\t\\t</p>"
  }
]
