[
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "1",
    "Text": "The command of Allah is at hand, so do not hasten it. Glorified and Exalted is He above what they associate &#761;with Him in worship&#762;!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "2",
    "Text": "He sends down the angels with revelation by His command to whoever He wills of His servants, &#761;stating:&#762; &ldquo;Warn &#761;humanity&#762; that there is no god &#761;worthy of worship&#762; except Me, so be mindful of Me &#761;alone&#762;.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "3",
    "Text": "He created the heavens and the earth for a purpose. Exalted is He above what they associate with Him &#761;in worship&#762;!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "4",
    "Text": "He created humans from a sperm-drop, then&mdash;behold!&mdash;they openly challenge &#761;Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "5",
    "Text": "And He created the cattle for you as a source of warmth, food, and &#761;many other&#762; benefits."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "6",
    "Text": "They are also pleasing to you when you bring them home and when you take them out to graze."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "7",
    "Text": "And they carry your loads to &#761;distant&#762; lands which you could not otherwise reach without great hardship. Surely your Lord is Ever Gracious, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "8",
    "Text": "&#761;He also created&#762; horses, mules, and donkeys for your transportation and adornment. And He creates what you do not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "9",
    "Text": "It is upon Allah &#761;alone&#762; to &#761;clearly&#762; show the Straight Way. Other ways are deviant. Had He willed, He would have easily guided all of you."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "10",
    "Text": "He is the One Who sends down rain from the sky, from which you drink and by which plants grow for your cattle to graze."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "11",
    "Text": "With it He produces for you &#761;various&#762; crops, olives, palm trees, grapevines, and every type of fruit. Surely in this is a sign for those who reflect."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "12",
    "Text": "And He has subjected for your benefit the day and the night, the sun and the moon. And the stars have been subjected by His command. Surely in this are signs for those who understand."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "13",
    "Text": "And &#761;He subjected&#762; for you whatever He has created on earth of varying colours.<span class='fn' foot_note=29300>1</span>&nbsp;Surely in this is a sign for those who are mindful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "14",
    "Text": "And He is the One Who has subjected the sea, so from it you may eat tender seafood and extract ornaments to wear. And you see the ships ploughing their way through it, so you may seek His bounty and give thanks &#761;to Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "15",
    "Text": "He has placed into the earth firm mountains, so it does not shake with you, as well as rivers, and pathways so you may find your way."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "16",
    "Text": "Also by landmarks and stars do people find their way."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "17",
    "Text": "Can the One Who creates be equal to those who do not? Will you not then be mindful?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "18",
    "Text": "If you tried to count Allah&rsquo;s blessings, you would never be able to number them. Surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "19",
    "Text": "And Allah knows what you conceal and what you reveal."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "20",
    "Text": "But those &#761;idols&#762; they invoke besides Allah cannot create anything&mdash;they themselves are created."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "21",
    "Text": "They are dead, not alive&mdash;not even knowing when their followers will be resurrected."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "22",
    "Text": "Your God is &#761;only&#762; One God. As for those who do not believe in the Hereafter, their hearts are in denial, and they are too proud."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "23",
    "Text": "Without a doubt, Allah knows what they conceal and what they reveal. He certainly does not like those who are too proud."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "24",
    "Text": "And when it is said to them, &ldquo;What has your Lord revealed?&rdquo; They say, &ldquo;Ancient fables!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "25",
    "Text": "Let them bear their burdens in full on the Day of Judgment as well as some of the burdens of those they mislead without knowledge. Evil indeed is what they will bear!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "26",
    "Text": "Indeed, those before them had plotted, but Allah struck at the &#761;very&#762; foundation of their structure, so the roof collapsed on top of them, and the torment came upon them from where they did not expect.<span class='fn' foot_note=29301>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "27",
    "Text": "Then on the Day of Judgment He will humiliate them and say, &ldquo;Where are My &#761;so-called&#762; associate-gods for whose sake you used to oppose &#761;the believers&#762;?&rdquo; Those gifted with knowledge will say, &ldquo;Surely disgrace and misery today are upon the disbelievers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "28",
    "Text": "Those whose souls the angels seize while they wrong themselves will then offer &#761;full&#762; submission &#761;and say falsely,&#762; &ldquo;We did not do any evil.&rdquo; &#761;The angels will say,&#762; &ldquo;No! Surely Allah fully knows what you used to do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "29",
    "Text": "So enter the gates of Hell, to stay there forever. Indeed, what an evil home for the arrogant!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "30",
    "Text": "And &#761;when&#762; it is said to those mindful &#761;of Allah&#762;, &ldquo;What has your Lord revealed?&rdquo; They say, &ldquo;All the best!&rdquo; For those who do good in this world, there is goodness. But far better is the &#761;eternal&#762; Home of the Hereafter. How excellent indeed is the home of the righteous:"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "31",
    "Text": "the Gardens of Eternity which they will enter, under which rivers flow. In it they will have whatever they desire. This is how Allah rewards the righteous&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "32",
    "Text": "those whose souls the angels take while they are virtuous, saying &#761;to them&#762;, &ldquo;Peace be upon you! Enter Paradise for what you used to do.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "33",
    "Text": "Are they only awaiting the coming of the angels or the command of your Lord &#761;O Prophet&#762;? So were those before them. And Allah never wronged them, but it was they who wronged themselves."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "34",
    "Text": "Then the evil &#761;consequences&#762; of their deeds overtook them, and they were overwhelmed by what they used to ridicule."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "35",
    "Text": "The polytheists argue, &ldquo;Had Allah willed, neither we nor our forefathers would have worshipped anything other than Him, nor prohibited anything without His command.&rdquo; So did those before them. Is not the messengers&rsquo; duty only to deliver &#761;the message&#762; clearly?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "36",
    "Text": "We surely sent a messenger to every community, saying, &ldquo;Worship Allah and shun false gods.&rdquo; But some of them were guided by Allah, while others were destined to stray. So travel throughout the land and see the fate of the deniers!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "37",
    "Text": "Even though you &#761;O Prophet&#762; are keen on their guidance, Allah certainly does not guide those He leaves to stray, and they will have no helpers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "38",
    "Text": "They swear by Allah their most solemn oaths that Allah will never raise the dead to life. Yes &#761;He will&#762;! It is a true promise binding on Him, but most people do not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "39",
    "Text": "&#761;He will do that&#762; to make clear to them what they disagreed on, and for the disbelievers to know that they were liars."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "40",
    "Text": "If We ever will something &#761;to exist&#762;, all We say is: &ldquo;Be!&rdquo; And it is!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "41",
    "Text": "As for those who emigrated in &#761;the cause of&#762; Allah after being persecuted, We will surely bless them with a good home in this world. But the reward of the Hereafter is far better, if only they knew."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "42",
    "Text": "&#761;It is&#762; they who have patiently endured, and in their Lord they put their trust."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "43",
    "Text": "We did not send &#761;messengers&#762; before you &#761;O Prophet&#762; except mere men inspired by Us. If you &#761;polytheists&#762; do not know &#761;this already&#762;, then ask those who have knowledge &#761;of the Scriptures&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "44",
    "Text": "&#761;We sent them&#762; with clear proofs and divine Books. And We have sent down to you &#761;O Prophet&#762; the Reminder, so that you may explain to people what has been revealed for them, and perhaps they will reflect."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "45",
    "Text": "Do those who devise evil plots feel secure that Allah will not cause the earth to swallow them? Or that the torment will not come upon them in ways they cannot comprehend?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "46",
    "Text": "Or that He will not seize them while they go about &#761;their day&#762;, for then they will have no escape?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "47",
    "Text": "Or that He will not destroy them gradually? But your Lord is truly Ever Gracious, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "48",
    "Text": "Have they not considered how the shadows of everything Allah has created incline to the right and the left &#761;as the sun moves&#762;, totally submitting to Allah in all humility?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "49",
    "Text": "And to Allah &#761;alone&#762; bows down &#761;in submission&#762;<span class='fn' foot_note=29302>1</span>&nbsp;whatever is in the heavens and whatever is on the earth of living creatures, as do the angels&mdash;who are not too proud &#761;to do so&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "50",
    "Text": "They<span class='fn' foot_note=29303>1</span>&nbsp;fear their Lord above them, and do whatever they are commanded."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "51",
    "Text": "And Allah has said, &ldquo;Do not take two gods. There is only One God. So be in awe of Me &#761;alone&#762;.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "52",
    "Text": "To Him belongs whatever is in the heavens and the earth, and to Him &#761;alone&#762; is the everlasting devotion. Will you then fear any other than Allah?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "53",
    "Text": "Whatever blessings you have are from Allah. Then whenever hardship touches you, to Him &#761;alone&#762; you cry &#761;for help&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "54",
    "Text": "Then as soon as He removes the hardship from you, a group of you associates &#761;others&#762; with their Lord &#761;in worship&#762;,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "55",
    "Text": "only returning Our favours with ingratitude. So enjoy yourselves, for you will soon know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "56",
    "Text": "And they &#761;even&#762; assign to those &#761;idols&#762;&mdash;who know nothing&mdash;a share of what We have provided for them. By Allah! You will certainly be questioned about whatever &#761;lies&#762; you used to fabricate &#761;against Allah&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "57",
    "Text": "And they attribute &#761;angels as&#762; daughters to Allah&mdash;glory be to Him!&mdash;the opposite of what they desire for themselves."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "58",
    "Text": "Whenever one of them is given the good news of a baby girl, his face grows gloomy, as he suppresses his rage."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "59",
    "Text": "He hides himself from the people because of the bad news he has received. Should he keep her in disgrace, or bury her &#761;alive&#762; in the ground? Evil indeed is their judgment!<span class='fn' foot_note=29304>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "60",
    "Text": "To those who disbelieve in the Hereafter belong all evil qualities, whereas to Allah belong the finest attributes. And He is the Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "61",
    "Text": "If Allah were to punish people &#761;immediately&#762; for their wrongdoing, He would not have left a single living being on earth. But He delays them for an appointed term. And when their time arrives, they cannot delay it for a moment, nor could they advance it."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "62",
    "Text": "They attribute to Allah what they hate &#761;for themselves&#762;,<span class='fn' foot_note=29305>1</span>&nbsp;and their tongues utter the lie that they will have the finest reward. Without a doubt, for them is the Fire, where they will be abandoned."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "63",
    "Text": "By Allah! We have surely sent messengers to communities before you &#761;O Prophet&#762;, but Satan made their misdeeds appealing to them. So he is their patron today, and they will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "64",
    "Text": "We have revealed to you the Book only to clarify for them what they differed about, and as a guide and mercy for those who believe."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "65",
    "Text": "And Allah sends down rain from the sky, giving life to the earth after its death. Surely in this is a sign for those who listen."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "66",
    "Text": "And there is certainly a lesson for you in cattle: We give you to drink of what is in their bellies, from between digested food and blood: pure milk, pleasant to drink.<span class='fn' foot_note=29306>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "67",
    "Text": "And from the fruits of palm trees and grapevines you derive intoxicants<span class='fn' foot_note=29307>1</span>&nbsp;as well as wholesome provision. Surely in this is a sign for those who understand."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "68",
    "Text": "And your Lord inspired the bees: &ldquo;Make &#761;your&#762; homes in the mountains, the trees, and in what people construct,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "69",
    "Text": "and feed from &#761;the flower of&#762; any fruit &#761;you please&#762; and follow the ways your Lord has made easy for you.&rdquo; From their bellies comes forth liquid of varying colours, in which there is healing for people. Surely in this is a sign for those who reflect."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "70",
    "Text": "Allah has created you, and then causes you to die. And some of you are left to reach the most feeble stage of life so that they may know nothing after having known much. Indeed, Allah is All-Knowing, Most Capable."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "71",
    "Text": "And Allah has favoured some of you over others in provision. But those who have been much favoured would not share their wealth with those &#761;bondspeople&#762; in their possession, making them their equals.<span class='fn' foot_note=29308>1</span>&nbsp;Do they then deny Allah&rsquo;s favours?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "72",
    "Text": "And Allah has made for you spouses of your own kind, and given you through your spouses children and grandchildren.<span class='fn' foot_note=29309>1</span>&nbsp;And He has granted you good, lawful provisions. Are they then faithful to falsehood and ungrateful for Allah&rsquo;s favours?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "73",
    "Text": "Yet they worship besides Allah those &#761;idols&#762; who do not afford them any provision from the heavens and the earth, nor do they have the power to."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "74",
    "Text": "So do not set up equals to Allah, for Allah certainly knows and you do not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "75",
    "Text": "Allah sets forth a parable: a slave who lacks all means, compared to a &#761;free&#762; man to whom We granted a good provision, of which he donates &#761;freely,&#762; openly and secretly. Are they equal? Praise be to Allah. In fact, most of them do not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "76",
    "Text": "And Allah sets forth a parable of two men: one of them is dumb, incapable of anything. He is a burden on his master. Wherever he is sent, he brings no good. Can such a person be equal to the one who commands justice and is on the Straight Path?<span class='fn' foot_note=29310>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "77",
    "Text": "To Allah &#761;alone&#762; belongs &#761;the knowledge of&#762; the unseen in the heavens and the earth. Bringing about the Hour would only take the blink of an eye, or even less. Surely Allah is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "78",
    "Text": "And Allah brought you out of the wombs of your mothers while you knew nothing, and gave you hearing, sight, and intellect so perhaps you would be thankful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "79",
    "Text": "Have they not seen the birds glide in the open sky? None holds them up except Allah. Surely in this are signs for those who believe."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "80",
    "Text": "And Allah has made your homes a place to rest, and has given you tents from the hide of animals, light to handle when you travel and when you camp. And out of their wool, fur, and hair He has given you furnishings and goods for a while."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "81",
    "Text": "And Allah has provided you shade out of what He created, and has given you shelter in the mountains. He has also provided you with clothes protecting you from the heat &#761;and cold&#762;, and armour shielding you in battle. This is how He perfects His favour upon you, so perhaps you will &#761;fully&#762; submit &#761;to Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "82",
    "Text": "But if they turn away, then your duty &#761;O Prophet&#762; is only to deliver &#761;the message&#762; clearly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "83",
    "Text": "They are aware of Allah&rsquo;s favours, but still deny them. And most of them are &#761;truly&#762; ungrateful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "84",
    "Text": "&#761;Consider, O &nbsp;Prophet,&#762; the Day We will call &#761;a prophet as&#762; a witness from every faith-community. Then the disbelievers will neither be allowed to plead nor appease &#761;their Lord&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "85",
    "Text": "And when the wrongdoers face the punishment, it will not be lightened for them, nor will they be delayed &#761;from it&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "86",
    "Text": "And when the polytheists see their associate-gods, they will say, &ldquo;Our Lord! These are our associate-gods that we used to invoke besides You.&rdquo; Their gods will throw a rebuttal at them, &#761;saying,&#762; &ldquo;You are definitely liars.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "87",
    "Text": "They will offer &#761;full&#762; submission to Allah on that Day, and whatever &#761;gods&#762; they fabricated will fail them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "88",
    "Text": "For those who disbelieve and hinder &#761;others&#762; from the Way of Allah, We will add more punishment to their punishment for all the corruption they spread."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "89",
    "Text": "&#761;Consider, O &nbsp;Prophet,&#762; the Day We will call against every faith-community a witness of their own. And We will call you to be a witness against these &#761;people of yours&#762;. We have revealed to you the Book as an explanation of all things, a guide, a mercy, and good news for those who &#761;fully&#762; submit."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "90",
    "Text": "Indeed, Allah commands justice, grace, as well as courtesy to close relatives. He forbids indecency, wickedness, and aggression. He instructs you so perhaps you will be mindful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "91",
    "Text": "Honour Allah&rsquo;s covenant when you make a pledge, and do not break your oaths after confirming them, having made Allah your guarantor. Surely Allah knows all you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "92",
    "Text": "Do not be like the woman who &#761;foolishly&#762; unravels her yarn after it is firmly spun, by taking your oaths as a means of deceiving one another in favour of a stronger group. Surely Allah tests you through this. And on the Day of Judgment He will certainly make your differences clear to you."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "93",
    "Text": "Had Allah willed, He could have easily made you one community &#761;of believers&#762;, but He leaves to stray whoever He wills and guides whoever He wills.<span class='fn' foot_note=29311>1</span>&nbsp;And you will certainly be questioned about what you used to do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "94",
    "Text": "And do not take your oaths as a means of deceiving one another or your feet will slip after they have been firm. Then you will taste the evil &#761;consequences&#762; of hindering &#761;others&#762; from the Way of Allah, and you will suffer a tremendous punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "95",
    "Text": "And do not trade Allah&rsquo;s covenant for a fleeting gain. What is with Allah is certainly far better for you, if only you knew."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "96",
    "Text": "Whatever you have will end, but whatever Allah has is everlasting. And We will certainly reward the steadfast according to the best of their deeds."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "97",
    "Text": "Whoever does good, whether male or female, and is a believer, We will surely bless them with a good life, and We will certainly reward them according to the best of their deeds."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "98",
    "Text": "When you recite the Quran, seek refuge with Allah from Satan, the accursed."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "99",
    "Text": "He certainly has no authority over those who believe and put their trust in their Lord."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "100",
    "Text": "His authority is only over those who take him as a patron and who&mdash;under his influence&mdash;associate &#761;others&#762; with Allah &#761;in worship&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "101",
    "Text": "When We replace a verse with another<span class='fn' foot_note=29312>1</span>&mdash;and Allah knows best what He reveals&mdash;they say, &ldquo;You &#761;Mu&#7717;ammad&#762; are just a fabricator.&rdquo; In fact, most of them do not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "102",
    "Text": "Say, &ldquo;The holy spirit<span class='fn' foot_note=29313>1</span>&nbsp;has brought it down from your Lord with the truth to reassure the believers, and as a guide and good news for those who submit &#761;to Allah&#762;.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "103",
    "Text": "And We surely know that they say, &ldquo;No one is teaching him except a human.&rdquo; But the man they refer to speaks a foreign tongue, whereas this &#761;Quran&#762; is &#761;in&#762; eloquent Arabic.<span class='fn' foot_note=29314>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "104",
    "Text": "Surely those who do not believe in Allah&rsquo;s revelations will never be guided by Allah, and they will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "105",
    "Text": "No one fabricates lies except those who disbelieve in Allah&rsquo;s revelations, and it is they who are the &#761;true&#762; liars."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "106",
    "Text": "Whoever disbelieves in Allah after their belief&mdash;not those who are forced while their hearts are firm in faith,<span class='fn' foot_note=29315>1</span>&nbsp;but those who embrace disbelief wholeheartedly&mdash;they will be condemned by Allah and suffer a tremendous punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "107",
    "Text": "This is because they prefer the life of this world over the Hereafter. Surely Allah never guides those who &#761;choose to&#762; disbelieve."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "108",
    "Text": "They are the ones whose hearts, ears, and eyes are sealed by Allah, and it is they who are &#761;truly&#762; heedless."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "109",
    "Text": "Without a doubt, they will be the losers in the Hereafter."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "110",
    "Text": "As for those who emigrated after being compelled &#761;to renounce Islam&#762;, then struggled &#761;in Allah&rsquo;s cause&#762;, and persevered, your Lord &#761;O Prophet&#762; is truly All-Forgiving, Most Merciful after all."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "111",
    "Text": "&#761;Consider&#762; the Day &#761;when&#762; every soul will come pleading for itself, and each will be paid in full for what it did, and none will be wronged."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "112",
    "Text": "And Allah sets forth the example of a society which was safe and at ease, receiving its provision in abundance from all directions. But its people met Allah&rsquo;s favours with ingratitude, so Allah made them taste the clutches of hunger and fear for their misdeeds."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "113",
    "Text": "A messenger of their own actually did come to them, but they denied him. So the torment overtook them while they persisted in wrongdoing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "114",
    "Text": "So eat from the good, lawful things which Allah has provided for you, and be grateful for Allah&rsquo;s favours, if you &#761;truly&#762; worship Him &#761;alone&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "115",
    "Text": "He has only forbidden you &#761;to eat&#762; carrion, blood, swine,<span class='fn' foot_note=29316>1</span>&nbsp;and what is slaughtered in the name of any other than Allah. But if someone is compelled by necessity&mdash;neither driven by desire nor exceeding immediate need&mdash;then surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "116",
    "Text": "Do not falsely declare with your tongues, &ldquo;This is lawful, and that is unlawful,&rdquo; &#761;only&#762; fabricating lies against Allah. Indeed, those who fabricate lies against Allah will never succeed."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "117",
    "Text": "&#761;It is only&#762; a brief enjoyment, then they will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "118",
    "Text": "To the Jews, We have forbidden what We related to you before.<span class='fn' foot_note=29317>1</span>&nbsp;We did not wrong them, but it was they who wronged themselves."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "119",
    "Text": "As for those who commit evil ignorantly &#761;or recklessly&#762;, then repent afterwards and mend their ways, then your Lord is surely All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "120",
    "Text": "Indeed, Abraham was a model of excellence: devoted to Allah, &#761;perfectly&#762; upright&mdash;not a polytheist&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "121",
    "Text": "&#761;utterly&#762; grateful for Allah&rsquo;s favours. &#761;So&#762; He chose him and guided him to the Straight Path."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "122",
    "Text": "We blessed him with all goodness in this world,<span class='fn' foot_note=29318>1</span>&nbsp;and in the Hereafter he will certainly be among the righteous."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "123",
    "Text": "Then We revealed to you &#761;O Prophet, saying&#762;: &ldquo;Follow the faith of Abraham, the upright, who was not one of the polytheists.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "124",
    "Text": "&#761;Honouring&#762; the Sabbath was ordained only for those who disputed about Abraham.<span class='fn' foot_note=29319>1</span>&nbsp;And surely your Lord will judge between them on the Day of Judgment regarding their disputes."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "125",
    "Text": "Invite &#761;all&#762; to the Way of your Lord with wisdom and kind advice, and only debate with them in the best manner. Surely your Lord &#761;alone&#762; knows best who has strayed from His Way and who is &#761;rightly&#762; guided."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "126",
    "Text": "If you retaliate, then let it be equivalent to what you have suffered. But if you patiently endure, it is certainly best for those who are patient."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "127",
    "Text": "Be patient &#761;O Prophet&#762;, for your patience is only with Allah&rsquo;s help. Do not grieve over those &#761;who disbelieve&#762;, nor be distressed by their schemes."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "16",
    "AyahNumber": "128",
    "Text": "Surely Allah is with those who shun evil and who do good &#761;deeds&#762;."
  }
]
