[
  {
    "SurahNumber": "69",
    "AyahNumber": "1",
    "NoteID": "5635",
    "Body": "Al-haqqa: the sure Truth: the Event that must inevitably\\n\\t\\t\\t\\tcome to pass; the state in which all falsehood and\\n\\t\\t\\t\\tpretence will vanish, and the absolute Truth will be laid\\n\\t\\t\\t\\tbare. The questions in the three verses raise an air of\\n\\t\\t\\t\\twonder. The solution is suggested in what happened to the\\n\\t\\t\\t\\tThamud and the 'Ad, and other people of antiquity, who\\n\\t\\t\\t\\tdisregarded the Truth of Allah and came to violent end,\\n\\t\\t\\t\\teven in this life,-Symbolically suggesting the great\\n\\t\\t\\t\\tCataclysm of the Hereafter, the Day of Doom."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "4",
    "NoteID": "5636",
    "Body": "For these two peoples of antiquity, see n. 1043 to vii.\\n\\t\\t\\t\\t73, and n. 1040 to vii. 65."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "4",
    "NoteID": "5637",
    "Body": "Another description of the terrible Day of Judgment. This\\n\\t\\t\\t\\tword Qari'a also occurs as the title of S. ci."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "5",
    "NoteID": "5638",
    "Body": "The Thamud were addicted to class arrogance. They\\n\\t\\t\\t\\toppressed the poor. The prophet Salih preached to them,\\n\\t\\t\\t\\tand put forward a wonderful she-camel as symbol of the\\n\\t\\t\\t\\trights of the poor, but they ham-strung her. See n. 1044\\n\\t\\t\\t\\tto vii. 73. They were destroyed in a mighty calamity, an\\n\\t\\t\\t\\tearthquake accompanying a terrible thunderstorm."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "6",
    "NoteID": "5639",
    "Body": "The 'Ad were an unjust people spoilt by their prosperity.\\n\\t\\t\\t\\tThe prophet Hud preached to them in vain. They were\\n\\t\\t\\t\\tapparently destroyed by a terrible blast of wind. See n.\\n\\t\\t\\t\\t1040 to vii. 65. See also xli. 15-16, n. 4483, and liv.\\n\\t\\t\\t\\t19, n. 5144."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "7",
    "NoteID": "5640",
    "Body": "A graphic simile. Dead men all lying about like hollow\\n\\t\\t\\t\\ttrunks of palm-trees, with their roots exposed! The 'Ad\\n\\t\\t\\t\\twere reputed to be of a tall stature."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "8",
    "NoteID": "5641",
    "Body": "The calamity was thorough. The 'Ad were destroyed, and\\n\\t\\t\\t\\tthen the Thamud, and only the tradition of them was left\\n\\t\\t\\t\\tbehind. See the references in n. 5636."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "9",
    "NoteID": "5642",
    "Body": "Pharaoh's Messenger was Moses. See the story in vii.\\n\\t\\t\\t\\t103-137 and the notes there. Pharaoh was inordinately\\n\\t\\t\\t\\tproud, and his fall was proportionately great: it\\n\\t\\t\\t\\tgradually extended to his dynasty and his people."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "9",
    "NoteID": "5643",
    "Body": "If we follow the sequence of peoples whose sins destroyed\\n\\t\\t\\t\\tthem, as mentioned in vii. 59-158, we begin with Noah,\\n\\t\\t\\t\\tthen have the 'Ad and the Thamud, then the Cities of the\\n\\t\\t\\t\\tPlain, then Midian, then the people whose prophet was\\n\\t\\t\\t\\tMoses (who occupies a central place in the canvas), and\\n\\t\\t\\t\\tthen the Pagan Quraish, to whom came the last and\\n\\t\\t\\t\\tgreatest of the prophets, our holy Prophet Muhammad. This\\n\\t\\t\\t\\tis the chronological sequence. Here there is no details,\\n\\t\\t\\t\\tnor even complete mention. But Noah is alluded to last,\\n\\t\\t\\t\\tand the 'Ad and the Thamud mentioned first, because the\\n\\t\\t\\t\\tlatter two belong to Arab tradition, and this is\\n\\t\\t\\t\\tspecially addressed to the Pagans of Makkah. Pharaoh is\\n\\t\\t\\t\\tmentioned rather than Moses for the same reason, and any\\n\\t\\t\\t\\tothers are \"those before Pharaoh\"."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "9",
    "NoteID": "5644",
    "Body": "The Cities Overthrown: Sodom and Gomorrah, Cities of the\\n\\t\\t\\t\\tPlain, to whom Lot preached: see ix. 70, n. 1330; and\\n\\t\\t\\t\\tvii. 80-84, n. 1049."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "11",
    "NoteID": "5645",
    "Body": "It was a widespread Flood. Cf. vii. 59-64: also xi.\\n\\t\\t\\t\\t25-49. Noah was ridiculed for his preparations for the\\n\\t\\t\\t\\tFlood: see xi. 38, n. 1531. But Allah had commanded him\\n\\t\\t\\t\\tto build an Ark, in order that mankind should be saved\\n\\t\\t\\t\\tfrom perishing in the Flood. But only those of Faith got\\n\\t\\t\\t\\tinto the Ark and were saved. As the Ark was built to\\n\\t\\t\\t\\tAllah's command, Allah \"carried you (mankind) in the\\n\\t\\t\\t\\tfloating (Ark)\"."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "12",
    "NoteID": "5646",
    "Body": "It was a memorial for all time, to show that evil meets\\n\\t\\t\\t\\twith its punishment, but the good are saved by the mercy\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "12",
    "NoteID": "5647",
    "Body": "Cf. the biblical Phrase, \"He that hath ears to hear, let\\n\\t\\t\\t\\thim hear\" (Matt. xi. 15). But the phrase used here has a\\n\\t\\t\\t\\tmore complicated import. An ear may hear, but for want of\\n\\t\\t\\t\\twill in the hearer the hearer may not wish, for the\\n\\t\\t\\t\\tfuture or for all time, to retain the memory of the\\n\\t\\t\\t\\tlessons he had heard, even though for the time being he\\n\\t\\t\\t\\twas impressed by it. The penetration of the truth has to\\n\\t\\t\\t\\tbe far deeper and subtler, and this is desired here."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "13",
    "NoteID": "5648",
    "Body": "We now come to the Inevitable Event, the Day of Judgment,\\n\\t\\t\\t\\tthe theme of this Sura. This is the first Blast referred\\n\\t\\t\\t\\tto in xxxix. 68, n. 4343."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "14",
    "NoteID": "5649",
    "Body": "The whole of our visible world, as we now know it, will\\n\\t\\t\\t\\tpass away, and a new world will come into being. The\\n\\t\\t\\t\\tmountains are specially mentioned, because they stand as\\n\\t\\t\\t\\tthe type of hardness, size, and durability. They will be\\n\\t\\t\\t\\t\"crushed\", i.e., lose their form and being at one stroke."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "17",
    "NoteID": "5650",
    "Body": "The whole picture is painted in graphic poetical images,\\n\\t\\t\\t\\tto indicate that which cannot be adequately described in\\n\\t\\t\\t\\twords, and which indeed OUT human faculties with their\\n\\t\\t\\t\\tpresent limited powers are not ready to comprehend. The\\n\\t\\t\\t\\tangels will be on all sides, arrayed in ranks upon ranks,\\n\\t\\t\\t\\tand the Throne of the Lord on high will be borne by eight\\n\\t\\t\\t\\tangels (or eight rows of angels). That will be the Day\\n\\t\\t\\t\\twhen Justice will be fully established and man be\\n\\t\\t\\t\\tmustered to his Lord for reckoning."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "17",
    "NoteID": "5651",
    "Body": "The number eight has perhaps no special significance,\\n\\t\\t\\t\\tunless it be with reference to the shape of the Throne or\\n\\t\\t\\t\\tthe number of the angels. The Oriental Throne is often\\n\\t\\t\\t\\toctagonal, and its bearers would be one at each corner."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "19",
    "NoteID": "5652",
    "Body": "Cf. xvii. 71, where the righteous are described as those\\n\\t\\t\\t\\twho are given their record in their right hand at\\n\\t\\t\\t\\tJudgment. In lvi. 27, 38, and other passages, the\\n\\t\\t\\t\\trighteous are called \"Companions of the Right Hand\"."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "20",
    "NoteID": "5653",
    "Body": "The righteous one rejoices that the faith he had during\\n\\t\\t\\t\\tthis world's life was fully justified, and is now\\n\\t\\t\\t\\tactually realised before him. He quite understood and\\n\\t\\t\\t\\tbelieved that good and evil must meet with their due\\n\\t\\t\\t\\tconsequences in the Hereafter, however much appearances\\n\\t\\t\\t\\tmay have been against it in the life in the lower world,\\n\\t\\t\\t\\t\"in the days that are gone\"."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "23",
    "NoteID": "5654",
    "Body": "The description is that of ripe, luscious grapes, hanging\\n\\t\\t\\t\\tlow in heavy bunches, so near that they could be gathered\\n\\t\\t\\t\\tand enjoyed in dignified ease. Cf. also lv. 54; lxxvi.\\n\\t\\t\\t\\t14."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "24",
    "NoteID": "5655",
    "Body": "Cf. ii. 110: \"Whatever good ye send forth for your souls\\n\\t\\t\\t\\tbefore you, ye shall find it with Allah: for Allah sees\\n\\t\\t\\t\\twell all that ye do.\""
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "24",
    "NoteID": "5656",
    "Body": "It will be a wholly new world, a new earth and a new\\n\\t\\t\\t\\theaven, when the blessed might well think with calm\\n\\t\\t\\t\\trelief of \"the days that are gone\". Cf- xiv. 48, and n.\\n\\t\\t\\t\\t1925. Even Time and Space will be no more, so that any\\n\\t\\t\\t\\tideas that we may form here will be found to have become\\n\\t\\t\\t\\twholly obsolete by then."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "25",
    "NoteID": "5657",
    "Body": "This is in contrast to the righteous ones who will\\n\\t\\t\\t\\treceive their record in their right hand. Cf. lxix. 19,\\n\\t\\t\\t\\tn. 5652. The righteous are glad when they remember their\\n\\t\\t\\t\\tpast: their memory is itself a precious possession. The\\n\\t\\t\\t\\tunjust are in agony when they remember their past. Their\\n\\t\\t\\t\\tmemory is itself a grievous punishment."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "27",
    "NoteID": "5658",
    "Body": "The death as from this life was but a transition into a\\n\\t\\t\\t\\tnew world. They would wish that that death had been the\\n\\t\\t\\t\\tend of all things, but it will not be."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "29",
    "NoteID": "5659",
    "Body": "The intensest agony is when the soul loses power over\\n\\t\\t\\t\\titself, when the personality tries to realise itself in\\n\\t\\t\\t\\tnew conditions and cannot: this is life in death."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "30",
    "NoteID": "5660",
    "Body": "Perhaps the word for 'bind' should be construed: 'bind\\n\\t\\t\\t\\this hands round his neck, to remind him that his hands\\n\\t\\t\\t\\twhen they were free were closed to all acts of charity\\n\\t\\t\\t\\tand mercy': Cf. xvii. 29."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "32",
    "NoteID": "5661",
    "Body": "The sinful men who will be given their record on the Day\\n\\t\\t\\t\\tof Judgment in their left hands will be in utter despair.\\n\\t\\t\\t\\tTheir power and authority which they misused to\\n\\t\\t\\t\\tperpetrate injustice and oppression will be gone. The\\n\\t\\t\\t\\twealth that had made them turn a deaf ear to the call of\\n\\t\\t\\t\\tTruth will be no more. They will cry out in agony: \"O\\n\\t\\t\\t\\twould that we were never raised again!. 0 would that\\n\\t\\t\\t\\tdeath had obliterated us once for all\". But their cries\\n\\t\\t\\t\\twill be of no avail. They will be seized, bound in chains\\n\\t\\t\\t\\tand drawn into the Blazing Fire for their crimes against\\n\\t\\t\\t\\tAllah and man."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "33",
    "NoteID": "5662",
    "Body": "The grip of sin was fastened on sinners because they\\n\\t\\t\\t\\tforsook Allah. They ran after their own lusts and\\n\\t\\t\\t\\tworshipped them, or they ran after Allah's creatures,\\n\\t\\t\\t\\tignoring Him Who is the cause and source of all good."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "34",
    "NoteID": "5663",
    "Body": "Cf. cvii. 3; lxxxix, 18. The practical result of their\\n\\t\\t\\t\\trebellion against the God of Mercy was that their\\n\\t\\t\\t\\tsympathies dried up. Not only did they not help or feed\\n\\t\\t\\t\\tthose in need, but they hindered others from doing so.\\n\\t\\t\\t\\tAnd they have neither friend nor sympathy (food) in the\\n\\t\\t\\t\\tHereafter."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "36",
    "NoteID": "5664",
    "Body": "They wounded many people by their cruelty and injustice\\n\\t\\t\\t\\tin this life, and it is befitting that they should have\\n\\t\\t\\t\\tno food other than \"the foul pus from the washing of\\n\\t\\t\\t\\twounds.!\""
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "38",
    "NoteID": "5665",
    "Body": "This is an adjuration in the same form as that which\\n\\t\\t\\t\\toccurs in lvi. 75, lxx. 40, xc. 1, and elsewhere. Allah's\\n\\t\\t\\t\\tWord is the quintessence of Truth. But what if someone\\n\\t\\t\\t\\tdoubts whether a particular Message is Allah's Word\\n\\t\\t\\t\\tcomunicated through His Messenger, or merely an imaginary\\n\\t\\t\\t\\ttale presented by a poet, or a soothsayer's vain\\n\\t\\t\\t\\tprophecy? Then we have to exanmine it in the light of our\\n\\t\\t\\t\\thighest spiritual facilities. The witness to that Word is\\n\\t\\t\\t\\twhat we know in the visible world, in which falsehood in\\n\\t\\t\\t\\tthe long run gives place to truth, and what we know in\\n\\t\\t\\t\\tthe invisible world, through our highest spiritual\\n\\t\\t\\t\\tfaculties. We are asked to examine and test it in both\\n\\t\\t\\t\\tthese ways."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "40",
    "NoteID": "5666",
    "Body": "Honoured messenger: one that is worthy of honour on\\n\\t\\t\\t\\taccount of the purity of his life, and may be relied upon\\n\\t\\t\\t\\tnot to invent things but to give the true word of\\n\\t\\t\\t\\trevelation which he received."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "41",
    "NoteID": "5667",
    "Body": "A poet draws upon his imagination, and the subjective\\n\\t\\t\\t\\tfactor is so strong that though we may learn much from\\n\\t\\t\\t\\thim, we cannot believe as facts the wonderful tales he\\n\\t\\t\\t\\thas to tell. And the poet who is not a Seer is merely a\\n\\t\\t\\t\\tvulgar votary of exaggerations and falsehoods."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "42",
    "NoteID": "5668",
    "Body": "A soothsayer merely pretends to foretell future events of\\n\\t\\t\\t\\tno profound spiritual consequence. Most of his prophecies\\n\\t\\t\\t\\tare frauds, and none of them is meant to teach lessons of\\n\\t\\t\\t\\treal admonition. Such admonition is the work of an\\n\\t\\t\\t\\thonoured prophet."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "45",
    "NoteID": "5669",
    "Body": "The right hand is the hand of power and action. Any one\\n\\t\\t\\t\\twho is seized by his right hand is prevented from acting\\n\\t\\t\\t\\tas he wishes or carrying out his purpose. The argument is\\n\\t\\t\\t\\tthat if an impostor were to arise, he would soon be found\\n\\t\\t\\t\\tout. He could not carry out his fraud indefinitely. But\\n\\t\\t\\t\\tthe prophets of Allah, however much they are persecuted,\\n\\t\\t\\t\\tgain more and more power every day, as did the holy\\n\\t\\t\\t\\tProphet, whose truth, earnestness, sincerity, and love\\n\\t\\t\\t\\tfor all, were recognised as his life unfolded itself."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "46",
    "NoteID": "5670",
    "Body": "This would effectually stop the functioning of his life."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "47",
    "NoteID": "5671",
    "Body": "The protection which the prophets of Allah enjoy in\\n\\t\\t\\t\\tcircumstances of danger and difficulty would not be\\n\\t\\t\\t\\tavailable for impostors."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "50",
    "NoteID": "5672",
    "Body": "The Message of Allah is glad tidings for those who\\n\\t\\t\\t\\tbelieve in Him and follow His Law, for it is a message of\\n\\t\\t\\t\\tMercy and Forgiveness through repentance and amendment.\\n\\t\\t\\t\\tBut in the case of the wicked it is a cause of sorrow,\\n\\t\\t\\t\\tfor it denounces sin and proclaims the punishment of\\n\\t\\t\\t\\tthose who do not turn from evil:"
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "51",
    "NoteID": "5673",
    "Body": "All Truth is in itself. But as received by men, and\\n\\t\\t\\t\\tunderstood with reference to men's psychology, certainty\\n\\t\\t\\t\\tmay have certain degrees. There is the probability or\\n\\t\\t\\t\\tcertainty resulting from the application of man's power\\n\\t\\t\\t\\tof judgment and his appraisement of evidence. This is\\n\\t\\t\\t\\tilmulyaqin, certainty by reasoning or inference. Then\\n\\t\\t\\t\\tthere is the certainty of seeing something with our own\\n\\t\\t\\t\\teyes. \"Seeing is believing.\" This is 'ain-ul-yaqin,\\n\\t\\t\\t\\tcertainty by personal inspection. See cii. 5, 7. Then, as\\n\\t\\t\\t\\there, there is the absolute Truth, with no possiblity of\\n\\t\\t\\t\\terror of judgment or error of the eye, (which stands for\\n\\t\\t\\t\\tany instrument of sense-perception and any ancillary\\n\\t\\t\\t\\taids, such as microscopes etc.). This absolute Truth is\\n\\t\\t\\t\\tthe haqq-il-yaqin spoken of here."
  },
  {
    "SurahNumber": "69",
    "AyahNumber": "52",
    "NoteID": "5674",
    "Body": "As Allah has given us this absolute Truth through His\\n\\t\\t\\t\\tRevelation, it behaves us to understand it and be\\n\\t\\t\\t\\tgrateful to Him. We must celebrate His praises in\\n\\t\\t\\t\\tthought, word and deed."
  }
]
