[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/009001",
        "Body":  "Freedom from obligation (is proclaimed) from Allah and His\n\t\t\tmessenger toward those of the idolaters with whom ye made a\n\t\t\ttreaty:"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/009010",
        "Body":  "And they observe toward a believer neither pact nor honor. These\n\t\t\tare they who are transgressors."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "100",
        "Recitation":  "Alafasy_128kbps/009100",
        "Body":  "And the first to lead the way, of the Muhajirin and the Ansar,\n\t\t\tand those who followed them in goodness--Allah is well pleased\n\t\t\twith them and they are well pleased with Him and He hath made\n\t\t\tready for them Gardens underneath which rivers flow, wherein they\n\t\t\twill abide for ever. That is the supreme triumph."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "101",
        "Recitation":  "Alafasy_128kbps/009101",
        "Body":  "And among those around you of the wandering Arabs there are\n\t\t\thypocrites, and among the townspeople of Al-Madinah ( there are\n\t\t\tsome who) persist in hypocrisy whom thou (O Muhammad) knowest\n\t\t\tnot. We, We know them, and We shall chastise them twice; then\n\t\t\tthey will be relegated to a painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "102",
        "Recitation":  "Alafasy_128kbps/009102",
        "Body":  "And (there are) others who have acknowledged their faults. They\n\t\t\tmixed a righteous action with another that was bad. It may be\n\t\t\tthat Allah will relent toward them. Lo! Allah is Relenting,\n\t\t\tMerciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "103",
        "Recitation":  "Alafasy_128kbps/009103",
        "Body":  "Take alms of their wealth, wherewith thou mayst purify them and\n\t\t\tmayst make them grow, and pray for them. Lo! thy prayer is an\n\t\t\tassuagement for them. Allah is Hearer, Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "104",
        "Recitation":  "Alafasy_128kbps/009104",
        "Body":  "Know they not that Allah is He Who accepteth repentance from His\n\t\t\tbondmen and taketh the alms, and that Allah is He Who is the\n\t\t\tRelenting, the Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "105",
        "Recitation":  "Alafasy_128kbps/009105",
        "Body":  "And say (unto them): Act! Allah will behold your actions, and (so\n\t\t\twill) His messenger and the believers, and ye will be brought\n\t\t\tback to the Knower of the invisible and the visible, and He will\n\t\t\ttell you what ye used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "106",
        "Recitation":  "Alafasy_128kbps/009106",
        "Body":  "And (there are) others who await Allah\u0027s decree, whether He will\n\t\t\tpunish them or will forgive them. Allah is knower, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "107",
        "Recitation":  "Alafasy_128kbps/009107",
        "Body":  "And as for those who chose a place of worship out of opposition\n\t\t\tand disbelief, and in order to cause dissent among the believers,\n\t\t\tand as an outpost for those who warred against Allah and His\n\t\t\tmessenger aforetime, they will surely swear: We purposed naught\n\t\t\tsave good. Allah beareth witness that they verily are liars."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "108",
        "Recitation":  "Alafasy_128kbps/009108",
        "Body":  "Never stand (to pray) there. A place of worship which was founded\n\t\t\tupon duty (to Allah) from the first day is more worthy that thou\n\t\t\tshouldst stand (to pray) therein, wherein are men who love to\n\t\t\tpurify themselves. Allah loveth the purifiers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "109",
        "Recitation":  "Alafasy_128kbps/009109",
        "Body":  "Is he who founded his building upon duty to Allah and His good\n\t\t\tpleasure better; or he who founded his building on the brink of a\n\t\t\tcrumbling, overhanging precipice so that it toppled with him into\n\t\t\tthe fire of hell? Allah guideth not wrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/009011",
        "Body":  "But if they repent and establish worship and pay the poor due,\n\t\t\tthen are they your brethren in religion. We detail Our\n\t\t\trevelations for a people who have knowledge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "110",
        "Recitation":  "Alafasy_128kbps/009110",
        "Body":  "The building which they built will never cease to be a misgiving\n\t\t\tin their hearts unless their hearts be torn to pieces. Allah is\n\t\t\tKnower, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "111",
        "Recitation":  "Alafasy_128kbps/009111",
        "Body":  "Lo! Allah hath bought from the believers their lives and their\n\t\t\twealth because the Garden will be theirs: they shall fight in the\n\t\t\tway of Allah and shall slay and be slain. It is a promise which\n\t\t\tis binding on Him in the Torah and the Gospel and the Quran. Who\n\t\t\tfulfilleth His covenant better than Allah? Rejoice then in your\n\t\t\tbargain that ye have made, for that is the supreme triumph."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "112",
        "Recitation":  "Alafasy_128kbps/009112",
        "Body":  "(Triumphant) are those who turn repentant (to Allah), those who\n\t\t\tserve (Him), those who praise (Him), those who fast, these who\n\t\t\tbow down, those who fall prostrate (in worship), those who enjoin\n\t\t\tthe right and who forbid the wrong and those who keep the limits\n\t\t\t(ordained) of Allah And give glad tidings to believers!."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "113",
        "Recitation":  "Alafasy_128kbps/009113",
        "Body":  "It is not for the Prophet, and those who believe, to pray for the\n\t\t\tforgiveness of idolaters even though they may be near of kin (to\n\t\t\tthem) after it hath become clear that they are people of hell\n\t\t\tfire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "114",
        "Recitation":  "Alafasy_128kbps/009114",
        "Body":  "The prayer of Abraham for the forgiveness of his father was only\n\t\t\tbecause of a promise he had promised him, but when it had become\n\t\t\tclear unto him that he (his father) was an enemy to Allah he\n\t\t\t(Abraham) disowned him. Lo! Abraham was soft of heart,\n\t\t\tlong-suffering."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "115",
        "Recitation":  "Alafasy_128kbps/009115",
        "Body":  "It was never Allah\u0027s (part) that he should send a folk astray\n\t\t\tafter He had guided them until He had made clear unto them what\n\t\t\tthey should avoid. Lo! Allah is Aware of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "116",
        "Recitation":  "Alafasy_128kbps/009116",
        "Body":  "Lo! Allah! Unto Him belongeth the sovereignty of the heavens and\n\t\t\tthe earth. He quickeneth and He giveth death. And ye have,\n\t\t\tinstead of Allah, no protecting friend nor helper."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "117",
        "Recitation":  "Alafasy_128kbps/009117",
        "Body":  "Allah hath turned in mercy to the Prophet, and to the Muhajirin\n\t\t\tand the Ansar who followed him in the hour of hardship. After the\n\t\t\thearts of a party of them had almost swerved aside, then turned\n\t\t\tHe unto them in mercy. Lo! He is Full of Pity, Merciful for them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "118",
        "Recitation":  "Alafasy_128kbps/009118",
        "Body":  "And to the three also (did He turn in mercy) who were left\n\t\t\tbehind: when the earth, vast as it is, was straitened for them,\n\t\t\tand their own souls were straitened for them till they bethought\n\t\t\tthem that there is no refuge from Allah save toward Him. Then\n\t\t\tturned He unto them in mercy that they (too) might turn\n\t\t\t(repentant unto Him). Lo! Allah! He is the Relenting, the\n\t\t\tMerciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "119",
        "Recitation":  "Alafasy_128kbps/009119",
        "Body":  "O ye who believe! Be careful of your duty to Allah, and be with\n\t\t\tthe truthful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/009012",
        "Body":  "And if they break their pledges after their treaty (hath been\n\t\t\tmade with you) and assail your religion, then fight the heads of\n\t\t\tdisbelief Lo! they have no binding oaths in order that they may\n\t\t\tdesist."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "120",
        "Recitation":  "Alafasy_128kbps/009120",
        "Body":  "It is not for the townsfolk of Al-Madinah and for those around\n\t\t\tthem of the wandering Arabs to stay behind the messenger of Allah\n\t\t\tand prefer their lives to his life. That is because neither\n\t\t\tthirst nor toil nor hunger afflicteth them in the way of Allah,\n\t\t\tnor step they any step that angereth the disbelievers, nor gain\n\t\t\tthey from the enemy a gain, but a good deed is recorded for them\n\t\t\ttherefor. Lo! Allah loseth not the wages of the good."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "121",
        "Recitation":  "Alafasy_128kbps/009121",
        "Body":  "Nor spend they any spending, small or great, nor do they cross a\n\t\t\tvalley, but it is recorded for them, that Allah may repay them\n\t\t\tthe best of what they used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "122",
        "Recitation":  "Alafasy_128kbps/009122",
        "Body":  "And the believers should not all go out to fight. Of every troop\n\t\t\tof them, a party only should go forth, that they (who are left\n\t\t\tbehind) may gain sound knowledge in religion, and that they may\n\t\t\twarn their folk when they return to them, so that they may\n\t\t\tbeware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "123",
        "Recitation":  "Alafasy_128kbps/009123",
        "Body":  "O ye who believe! Fight those of the disbelievers who are near to\n\t\t\tyou, and let them find harshness in you, and know that Allah is\n\t\t\twith those who keep their duty (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "124",
        "Recitation":  "Alafasy_128kbps/009124",
        "Body":  "And whenever a surah is revealed there are some of them who say:\n\t\t\tWhich one of you hath thus increased in faith? As for those who\n\t\t\tbelieve, it hath increased them in faith and they rejoice\n\t\t\t(therefor)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "125",
        "Recitation":  "Alafasy_128kbps/009125",
        "Body":  "But as for those in whose hearts is disease, it only addeth\n\t\t\twickedness to their wickedness, and they die while they are\n\t\t\tdisbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "126",
        "Recitation":  "Alafasy_128kbps/009126",
        "Body":  "See they not that they are tested once or twice in every year?\n\t\t\tStill they turn not in repentance, neither pay they heed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "127",
        "Recitation":  "Alafasy_128kbps/009127",
        "Body":  "And whenever a surah is revealed, they look one at another (as\n\t\t\twho should say): Doth anybody see you? Then they turn away. Allah\n\t\t\tturneth away their hearts because they are a folk who understand\n\t\t\tnot."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "128",
        "Recitation":  "Alafasy_128kbps/009128",
        "Body":  "There hath come unto you a messenger, (one) of yourselves, unto\n\t\t\twhom aught that ye are overburdened is grievous, full of concern\n\t\t\tfor you, for the believers full of pity, merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "129",
        "Recitation":  "Alafasy_128kbps/009129",
        "Body":  "Now, if they turn away (O Muhammad) say: Allah sufficeth me.\n\t\t\tThere is no God save Him. In Him have I put my trust, and He is\n\t\t\tLord of the Tremendous Throne."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/009013",
        "Body":  "Will ye not fight a folk who broke their solemn pledges, and\n\t\t\tpurposed to drive out the messenger and did attack you first?\n\t\t\tWhat! Fear ye them? Now Allah hath more right that ye should fear\n\t\t\tHim, if ye are believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/009014",
        "Body":  "Fight them! Allah will chastise them at your hands, and He will\n\t\t\tlay them low and give you victory over them, and He will heal the\n\t\t\tbreasts of folk who are believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/009015",
        "Body":  "And He will remove the anger of their hearts. Allah relenteth\n\t\t\ttoward whom He will. Allah is Knower, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/009016",
        "Body":  "Or deemed ye that ye would be left (in peace) when Allah yet\n\t\t\tknoweth not those of you who strive, choosing for familiar none\n\t\t\tsave Allah and His messenger and the believers? Allah is Informed\n\t\t\tof what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/009017",
        "Body":  "It is not for the idolaters to tend Allah\u0027s sanctuaries, bearing\n\t\t\twitness against themselves of disbelief. As for such, their works\n\t\t\tare vain and in the Fire they will abide."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/009018",
        "Body":  "He only shall tend Allah\u0027s sanctuaries who believeth in Allah and\n\t\t\tthe Last Day and observeth proper worship and payeth the poor due\n\t\t\tand feareth none save Allah. For such (only) is it possible that\n\t\t\tthey can be of the rightly guided."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/009019",
        "Body":  "Count ye the slaking of a pilgrim\u0027s thirst and tendance of the\n\t\t\tInviolable Place of Worship as (equal to the worth of him) who\n\t\t\tbelieveth in Allah and the Last Day, and striveth in the way of\n\t\t\tAllah? They are not equal in the sight of Allah. Allah guideth\n\t\t\tnot wrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/009002",
        "Body":  "Travel freely in the land four months, and know that ye cannot\n\t\t\tescape Allah and that Allah will confound the disbelievers (in\n\t\t\tHis guidance)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/009020",
        "Body":  "Those who believe, and have left their homes and striven with\n\t\t\ttheir wealth and their lives in Allah\u0027s way are of much greater\n\t\t\tworth in Allah\u0027s sight. These are they who are triumphant."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/009021",
        "Body":  "Their Lord giveth them good tidings of mercy from Him, and\n\t\t\tacceptance, and Gardens where enduring pleasure will be theirs;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/009022",
        "Body":  "There they will abide for ever. Lo! with Allah there is immense\n\t\t\treward."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/009023",
        "Body":  "O ye who believe! Choose not your fathers nor your brethren for\n\t\t\tfriends if they take pleasure in disbelief rather than faith.\n\t\t\tWhoso of you taketh them for friends, such are wrong doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/009024",
        "Body":  "Say: If your fathers, and your sons, and your brethren, and your\n\t\t\twives, and your tribe, and the wealth ye have acquired, and\n\t\t\tmerchandise for which ye fear that there will be no sale, and\n\t\t\tdwellings ye desire are dearer to you than Allah and His\n\t\t\tmessenger and striving in His way: then wait till Allah bringeth\n\t\t\tHis command to pass. Allah guideth not wrong doing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/009025",
        "Body":  "Allah hath given you victory on many fields and on the day of\n\t\t\tHuneyn, when ye exulted in your multitude but it availed you\n\t\t\tnaught, and the earth, vast as it is, was straitened for you;\n\t\t\tthen ye turned back in flight;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/009026",
        "Body":  "Then Allah sent His peace of reassurance down upon His messenger\n\t\t\tand upon the believers, and sent down hosts ye could not see, and\n\t\t\tpunished those who disbelieved. Such is the reward of\n\t\t\tdisbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/009027",
        "Body":  "Then afterward Allah will relent toward whom He will; for Allah\n\t\t\tis Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/009028",
        "Body":  "O ye who believe! The idolaters only are unclean. So let them not\n\t\t\tcome near the Inviolable Place of Worship after this their year.\n\t\t\tIf ye fear poverty (from the loss of their merchandise) Allah\n\t\t\tshall preserve you of His bounty if He will. Lo! Allah is Knower,\n\t\t\tWise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/009029",
        "Body":  "Fight against such of those who have been given the Scripture as\n\t\t\tbelieve not in Allah nor the Last Day, and forbid not that which\n\t\t\tAllah hath forbidden by His messenger, and follow not the\n\t\t\treligion of truth, until they pay the tribute readily, being\n\t\t\tbrought low."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/009003",
        "Body":  "And a proclamation from Allah and His messenger to all men on the\n\t\t\tday of the Greater Pilgrimage that Allah is free from obligation\n\t\t\tto the idolaters, and (so is) His messenger. So, if ye repent, it\n\t\t\twill be better for you; but if ye are averse, then know that ye\n\t\t\tcannot escape Allah. Give tidings (O Muhammad) of a painful doom\n\t\t\tto those who disbelieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/009030",
        "Body":  "And the Jews say: Ezra is the son of Allah, and the Christians\n\t\t\tsay: The Messiah is the son of Allah. That is their saying with\n\t\t\ttheir mouths. They imitate the saying of those who disbelieved of\n\t\t\told. Allah (himself) fighteth against them. How perverse are\n\t\t\tthey!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/009031",
        "Body":  "They have taken as lords beside Allah their rabbis and their\n\t\t\tmonks and the Messiah son of Mary, when they were bidden to\n\t\t\tworship only One God. There is no god save Him. Be He glorified\n\t\t\tfrom all that they ascribe as partner (unto Him)!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/009032",
        "Body":  "Fain would they put out the light of Allah with their mouths, but\n\t\t\tAllah disdaineth (aught) save that He shall perfect His light,\n\t\t\thowever much the disbelievers are averse."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/009033",
        "Body":  "He it is who hath sent His messenger with the guidance and the\n\t\t\tReligion of Truth, that He may cause it to prevail over all\n\t\t\treligion, however much the idolaters may be averse."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/009034",
        "Body":  "O ye, who believe! Lo! many of the (Jewish) rabbis and the\n\t\t\t(Christian) monks devour the wealth of mankind wantonly and debar\n\t\t\t(men) from the way of Allah. They who hoard up gold and silver\n\t\t\tand spend it not in the way of Allah, unto them give tidings (O\n\t\t\tMuhammad) of a painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/009035",
        "Body":  "On the day when it will (all) be heated in the fire of hell, and\n\t\t\ttheir foreheads and their flanks and their backs will be branded\n\t\t\ttherewith (and it will be said unto them): Here is that which ye\n\t\t\thoarded for yourselves. Now taste of what ye used to hoard."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/009036",
        "Body":  "Lo! the number of the months with Allah is twelve months by\n\t\t\tAllah\u0027s ordinance in the day that He created the heavens and the\n\t\t\tearth. Four of them are sacred: that is the right religion. So\n\t\t\twrong not yourselves in them. And wage war on all the idolaters\n\t\t\tas they are waging war on all of you. And know that Allah is with\n\t\t\tthose who keep their duty (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/009037",
        "Body":  "Postponement (of a sacred month) is only an excess of disbelief\n\t\t\twhereby those who disbelieve are misled, they allow it one year\n\t\t\tand forbid it (another) year, that they may make up the number of\n\t\t\tthe months which Allah hath hallowed, so that they allow that\n\t\t\twhich Allah hath forbidden. The evil of their deeds is made\n\t\t\tfair-seeming unto them. Allah guideth not the disbelieving folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/009038",
        "Body":  "O ye who believe! What aileth you that when it is said unto you:\n\t\t\tGo forth in the way of Allah, ye are bowed down to the ground\n\t\t\twith heaviness. Take ye pleasure in the life of the world rather\n\t\t\tthan in the Hereafter? The comfort of the life of the world is\n\t\t\tbut little in the Hereafter."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/009039",
        "Body":  "If ye go not forth He will afflict you with a painful doom, and\n\t\t\twill choose instead of you a folk other then you. Ye cannot harm\n\t\t\tHim at all. Allah is Able to do all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/009004",
        "Body":  "Excepting those of the idolaters with whom ye (Muslims) have a\n\t\t\ttreaty, and who have since abated nothing of your right nor have\n\t\t\tsupported anyone against you. (As for these), fulfill their\n\t\t\ttreaty to them till their term. Lo! Allah loveth those who keep\n\t\t\ttheir duty (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/009040",
        "Body":  "If ye help him not, still Allah helped him when those who\n\t\t\tdisbelieve drove him forth, the second of two; when they two were\n\t\t\tin the cave, when he said unto his comrade: Grieve not. Lo! Allah\n\t\t\tis with us. Then Allah caused His peace of reassurance to descend\n\t\t\tupon him and supported him with hosts ye cannot see, and made the\n\t\t\tword of those who disbelieved the nethermost, while Allah\u0027s word\n\t\t\tit was that became the uppermost. Allah is Mighty, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/009041",
        "Body":  "Go forth, light armed and heavy armed, and strive with your\n\t\t\twealth and your lives in the way of Allah! That is best for you\n\t\t\tif ye but knew."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/009042",
        "Body":  "Had it been a near adventure and an easy journey they had\n\t\t\tfollowed thee, but the distance seemed too far for them. Yet will\n\t\t\tthey swear by Allah (saying): If we had been able we would surely\n\t\t\thave set out with you. They destroy their souls, and Allah\n\t\t\tknoweth that they verily are liars."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/009043",
        "Body":  "Allah forgive thee (O Muhammad)! Wherefore didst thou grant them\n\t\t\tleave ere those who told the truth were manifest to thee and thou\n\t\t\tdidst know the liars?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/009044",
        "Body":  "Those who believe in Allah and the Last Day ask no leave of thee\n\t\t\tlest they should strive with their wealth and their lives. Allah\n\t\t\tis Aware of those who keep their duty (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/009045",
        "Body":  "They alone ask leave of thee who believe not in Allah and the\n\t\t\tLast Day, and whose hearts feel doubt, so in their doubt they\n\t\t\twaver."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/009046",
        "Body":  "And if they had wished to go forth they would assuredly have made\n\t\t\tready some equipment, but Allah was averse to their being sent\n\t\t\tforth and held them back and (it was said unto them ) : Sit ye\n\t\t\twith the sedentary!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/009047",
        "Body":  "Had they gone forth among you they had added to you naught save\n\t\t\ttrouble and had hurried to and fro among you, seeking to cause\n\t\t\tsedition among you; and among you there are some who would have\n\t\t\tlistened to them. Allah is Aware of evil-doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/009048",
        "Body":  "Aforetime they sought to cause sedition and raised difficulties\n\t\t\tfor thee till the Truth came and the decree of Allah was made\n\t\t\tmanifest, though they were loth."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/009049",
        "Body":  "Of them is he who saith: Grant me leave (to stay at home) and\n\t\t\ttempt me not. Surely it is into temptation that they (thus) have\n\t\t\tfallen. Lo! hell is all around the disbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/009005",
        "Body":  "Then, when the sacred months have passed, slay the idolaters\n\t\t\twherever ye find them, and take them (captive), and besiege them,\n\t\t\tand prepare for them each ambush. But if they repent and\n\t\t\testablish worship and pay the poor due, then leave their way\n\t\t\tfree. Lo! Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/009050",
        "Body":  "If good befalleth thee (O Muhammad) it afflicteth them, and if\n\t\t\tcalamity befalleth thee, they say: We took precaution, and they\n\t\t\tturn away well pleased."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/009051",
        "Body":  "Say: Naught befalleth us save that which Allah hath decreed for\n\t\t\tus. He is our protecting Friend. In Allah let believers put their\n\t\t\ttrust!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/009052",
        "Body":  "Say: Can ye await for us aught save one of two good things (death\n\t\t\tor victory in Allah\u0027s way)? while we await for you that Allah\n\t\t\twill afflict you with a doom from Him or at our hands. Await\n\t\t\tthen! Lo! we are awaiting with you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/009053",
        "Body":  "Say: Pay (your contribution), willingly or unwillingly, it will\n\t\t\tnot be accepted from you. Lo! ye were ever froward folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/009054",
        "Body":  "And naught preventeth that their contributions should be accepted\n\t\t\tfrom them save that they have disbelieved in Allah and in His\n\t\t\tmessenger, and they come not to worship save as idlers, and pay\n\t\t\tnot (their contribution) save reluctantly."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/009055",
        "Body":  "So let not their riches nor their children please thee (O\n\t\t\tMuhammad). Allah thereby intendeth but to punish them in the life\n\t\t\tof the world and that their souls shall pass away while they are\n\t\t\tdisbelievers"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/009056",
        "Body":  "And they swear by Allah that they are in truth of you, when they\n\t\t\tare not of you, but they are folk who are afraid."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/009057",
        "Body":  "Had they but found a refuge, or caverns, or a place to enter,\n\t\t\tthey surely had resorted thither swift as runaways."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/009058",
        "Body":  "And of them is he who defameth thee in the matter of the alms. If\n\t\t\tthey are given thereof they are content, and if they are not\n\t\t\tgiven thereof, behold! they are enraged."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/009059",
        "Body":  "(How much more seemly) had they been content with that which\n\t\t\tAllah and His messenger had given them and had said: Allah\n\t\t\tsufficeth us. Allah will give us of His bounty, and (also) His\n\t\t\tmessenger. Unto Allah we are suppliants."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/009006",
        "Body":  "And if anyone of the idolaters seeketh thy protection (O\n\t\t\tMuhammad), then protect him so that he may hear the word of\n\t\t\tAllah; and afterward convey him to his place of safety. That is\n\t\t\tbecause they are a folk who know not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/009060",
        "Body":  "The alms are only for the poor and the needy, and those who\n\t\t\tcollect them, and those whose hearts are to be reconciled, and to\n\t\t\tfree the captives and the debtors, and for the cause of Allah,\n\t\t\tand (for) the wayfarers; a duty imposed by Allah. Allah is\n\t\t\tknower, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/009061",
        "Body":  "And of them are those who vex the Prophet and say: He is only a\n\t\t\thearer. Say: A hearer of good for you, who believeth in Allah and\n\t\t\tis true to the believers, and a mercy for such of you as believe.\n\t\t\tThose who vex the messenger of Allah, for them there is a painful\n\t\t\tdoom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/009062",
        "Body":  "They swear by Allah to you (Muslims) to please you, but Allah,\n\t\t\twith His messenger, hath more right that they should please Him\n\t\t\tif they are believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/009063",
        "Body":  "Know they not that whoso opposeth Allah and His messenger, his\n\t\t\tportion verily is hell, to abide therein? That is the extreme\n\t\t\tabasement."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/009064",
        "Body":  "The hypocrites fear lest a surah should be revealed concerning\n\t\t\tthem, proclaiming what is in their hearts. Say: Scoff (your\n\t\t\tfill)! Lo! Allah is disclosing what ye fear."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/009065",
        "Body":  "And if thou ask them (O Muhammad) they will say: We did but talk\n\t\t\tand jest. Say: was it at Allah and His revelations and His\n\t\t\tMessenger that ye did scoff?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/009066",
        "Body":  "Make no excuse. Ye have disbelieved after your (confession of)\n\t\t\tbelief. If We forgive a party of you, a party of you We shall\n\t\t\tpunish because they have been guilty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/009067",
        "Body":  "The hypocrites, both men and women, proceed one from another.\n\t\t\tThey enjoin the wrong, and they forbid the right, and they\n\t\t\twithhold their hands (from spending for the cause of Allah). They\n\t\t\tforget Allah, so He hath forgotten them. Lo! the hypocrites, they\n\t\t\tare the transgressors."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/009068",
        "Body":  "Allah promiseth the hypocrites, both men and women, and the\n\t\t\tdisbelievers fire of hell for their abode. It will suffice them.\n\t\t\tAllah curseth them, and theirs is lasting torment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/009069",
        "Body":  "Even as those before you were mightier than you in strength, and\n\t\t\tmore affluent than you in wealth and children. They enjoyed their\n\t\t\tlot awhile, so ye enjoy your lot awhile even as those before you\n\t\t\tdid enjoy their lot awhile. And ye prate even as they prated.\n\t\t\tSuch are they whose works have perished in the world and the\n\t\t\tHereafter. Such are they who are the losers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/009007",
        "Body":  "How can there be a treaty with Allah and with His messenger for\n\t\t\tthe idolaters save those with whom ye made a treaty at the\n\t\t\tInviolable Place of Worship? So long as they are true to you, be\n\t\t\ttrue to them. Lo! Allah loveth those who keep their duty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/009070",
        "Body":  "Hath not the fame of those before them reached them the folk of\n\t\t\tNoah, Aad, Thamud, the folk of Abraham, the dwellers of Midian\n\t\t\tand the disasters (which befell them)? Their messengers (from\n\t\t\tAllah) came unto them with proofs (of Allah\u0027s sovereignty). So\n\t\t\tAllah surely wronged them not, but they did wrong themselves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/009071",
        "Body":  "And the believers, men and women, are protecting friends one of\n\t\t\tanother; they enjoin the right and forbid the wrong, and they\n\t\t\testablish worship and they pay the poor-due, and they obey Allah\n\t\t\tand His messenger. As for these, Allah will have mercy on them.\n\t\t\tLo! Allah is Mighty, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/009072",
        "Body":  "Allah promiseth to the believers, men and women, Gardens\n\t\t\tunderneath which rivers flow, wherein they will abide--blessed\n\t\t\tdwellings in Gardens of Eden. And greater (far)!--acceptance from\n\t\t\tAllah. That is the supreme triumph."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/009073",
        "Body":  "O Prophet! Strive against the disbelievers and the hypocrites! Be\n\t\t\tharsh with them. Their ultimate abode is hell, a hapless\n\t\t\tjourney\u0027s end."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/009074",
        "Body":  "They swear by Allah that they said nothing (wrong), yet they did\n\t\t\tsay the word of disbelief, and did disbelieve after their\n\t\t\tSurrender (to Allah). And they purposed that which they could not\n\t\t\tattain, and they sought revenge only that Allah by His messenger\n\t\t\tshould enrich them of His bounty. If they repent it will be\n\t\t\tbetter for them; and if they turn away, Allah will afflict them\n\t\t\twith a painful doom in the world and the Hereafter, and they have\n\t\t\tno protecting friend nor helper in the earth."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/009075",
        "Body":  "And of them is he who made a covenant with Allah (saying): If He\n\t\t\tgive us of His bounty We will give alms and become of the\n\t\t\trighteous."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/009076",
        "Body":  "Yet when He gave them of His bounty, they boarded it and turned\n\t\t\taway, averse;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/009077",
        "Body":  "So He hath made the consequence (to be) hypocrisy in their hearts\n\t\t\tuntil the day when they shall meet Him, because they broke their\n\t\t\tword to Allah that they promised Him, and because they lied."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/009078",
        "Body":  "Know they not that Allah knoweth both their secret and the\n\t\t\tthought that they confide, and that Allah is the Knower of Things\n\t\t\tHidden?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/009079",
        "Body":  "Those who point at such of the believers as give the alms\n\t\t\twillingly and such as can find naught to give but their\n\t\t\tendeavors, and deride them Allah (Himself) derideth them. Theirs\n\t\t\twill be a painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/009008",
        "Body":  "How (can there be any treaty for the others) when, if they have\n\t\t\tthe upper hand of you, they regard not pact nor honor in respect\n\t\t\tof you? They satisfy you with their mouths the while their hearts\n\t\t\trefuse. And most of them are wrong doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/009080",
        "Body":  "Ask forgiveness for them (O Muhammad), or ask not forgiveness for\n\t\t\tthem; though thou ask forgiveness for them seventy times Allah\n\t\t\twill not forgive them. That is because they disbelieved in Allah\n\t\t\tand His messenger, and Allah guideth not wrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/009081",
        "Body":  "Those who were left behind rejoiced at sitting still behind the\n\t\t\tmessenger of Allah, and were averse to striving with their wealth\n\t\t\tand their lives in Allah\u0027s way. And they said: Go not forth in\n\t\t\tthe heat! Say: The heat of hell is more intense of heat, if they\n\t\t\tbut understood."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/009082",
        "Body":  "Then let them laugh a little: they will weep much, as the award\n\t\t\tof what they used to earn."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/009083",
        "Body":  "If Allah bring thee back (from the campaign) unto a party of them\n\t\t\tand they ask of thee leave to go out (to fight), then say unto\n\t\t\tthem: Ye shall never more go out with me nor fight with me\n\t\t\tagainst a foe. Ye were content with sitting still the first time.\n\t\t\tSo sit still, with the useless."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/009084",
        "Body":  "And never (O Muhammad) pray for one of them who dieth, nor stand\n\t\t\tby his grave. Lo! they disbelieved in Allah and His messenger,\n\t\t\tand they died while they were evil-doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/009085",
        "Body":  "Let not their wealth nor their children please thee! Allah\n\t\t\tpurposeth only to punish them thereby in the world, and that\n\t\t\ttheir souls shall pass away while they are disbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/009086",
        "Body":  "And when a surah is revealed (which saith ): Believe in Allah and\n\t\t\tstrive along with His messenger, the men of wealth among them\n\t\t\tstill ask leave of thee and say: Suffer us to be with those who\n\t\t\tsit (at home)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/009087",
        "Body":  "They are content that they should be with the useless and their\n\t\t\thearts are sealed, so that they apprehend not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/009088",
        "Body":  "But the messenger and those who believe with him strive with\n\t\t\ttheir wealth and their lives. Such are they for whom are the good\n\t\t\tthings. Such are they who are the successful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "89",
        "Recitation":  "Alafasy_128kbps/009089",
        "Body":  "Allah hath made ready for them Gardens underneath which rivers\n\t\t\tflow, wherein they will abide. That is the supreme triumph."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/009009",
        "Body":  "They have purchased with the revelations of Allah a little gain,\n\t\t\tso they debar (men) from His way. Lo! evil is that which they are\n\t\t\twont to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "90",
        "Recitation":  "Alafasy_128kbps/009090",
        "Body":  "And those among the wandering Arabs who had an excuse came in\n\t\t\torder that permission might be granted them. And those who lied\n\t\t\tto Allah and His messenger sat at home. A painful doom will fall\n\t\t\ton those of them who disbelieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "91",
        "Recitation":  "Alafasy_128kbps/009091",
        "Body":  "Not unto the weak nor unto the sick nor unto those who can find\n\t\t\tnaught to spend is any fault (to be imputed though they stay at\n\t\t\thome) if they are true to Allah and His messenger. Not unto the\n\t\t\tgood is there any road (of blame). Allah is Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "92",
        "Recitation":  "Alafasy_128kbps/009092",
        "Body":  "Nor unto those whom, when they came to thee (asking) that thou\n\t\t\tshouldest mount them, thou didst tell: I cannot find whereon to\n\t\t\tmount you. They turned back with eyes flowing with tears, for\n\t\t\tsorrow that they could not find the means to spend."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "93",
        "Recitation":  "Alafasy_128kbps/009093",
        "Body":  "The road (of blame) is only against those who ask for leave of\n\t\t\tthee (to stay at home) when they are rich. They are content to be\n\t\t\twith the useless. Allah hath sealed their hearts so that they\n\t\t\tknow not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "94",
        "Recitation":  "Alafasy_128kbps/009094",
        "Body":  "They will make excuse to you (Muslims) when ye return unto them.\n\t\t\tSay: Make no excuse, for we shall not believe you. Allah hath\n\t\t\ttold us tidings of you. Allah and His messenger will see your\n\t\t\tconduct, and then ye will be brought back unto Him Who knoweth\n\t\t\tthe invisible as well as the visible, and He will tell you what\n\t\t\tye used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "95",
        "Recitation":  "Alafasy_128kbps/009095",
        "Body":  "They will swear by Allah unto you, when ye return unto them, that\n\t\t\tye may let them be. Let them be, for lo! they are unclean, and\n\t\t\ttheir abode is hell as the reward for what they used to earn."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "96",
        "Recitation":  "Alafasy_128kbps/009096",
        "Body":  "They swear unto you, that ye may accept them. Though ye accept\n\t\t\tthem, Allah verily accepteth not wrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "97",
        "Recitation":  "Alafasy_128kbps/009097",
        "Body":  "The wandering Arabs are more hard in disbelief and hypocrisy, and\n\t\t\tmore likely to be ignorant of the limits which Allah hath\n\t\t\trevealed unto His messenger. And Allah is knower, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "98",
        "Recitation":  "Alafasy_128kbps/009098",
        "Body":  "And of the wandering Arabs there is he who taketh that which he\n\t\t\texpendeth (for the cause of Allah ), as a loss, and awaiteth\n\t\t\t(evil) turns of fortune for you (that he may be rid of it). The\n\t\t\tevil turn of fortune will be theirs. Allah is Nearer, Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "9",
        "AyahNumber":  "99",
        "Recitation":  "Alafasy_128kbps/009099",
        "Body":  "And of the wandering Arabs there is he who believeth in Allah and\n\t\t\tthe Last day, and taketh that which he expandeth and also the\n\t\t\tprayers of the messenger as acceptable offerings in the sight of\n\t\t\tAllah. Lo! verily it is an acceptable offering for them. Allah\n\t\t\twill bring them into His mercy. Lo! Allah is Forgiving, Merciful."
    }
]
