[
  {
    "SurahNumber": "105",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Lit., \"the companions (ashab) of the elephant\" - see\\n\\t\\t\\t\\tintroductory note."
  },
  {
    "SurahNumber": "105",
    "AyahNumber": "4",
    "NoteID": "2",
    "Body": "Lit., \"with stones of sijjil\". As explained in note [114]\\n\\t\\t\\t\\ton  11:82 , this latter term is synonymous with sijill,\\n\\t\\t\\t\\twhich signifies \"a writing\" and, tropically, \"something\\n\\t\\t\\t\\tthat has been decreed [by God]\": hence, the phrase\\n\\t\\t\\t\\thijarah min sijjil is a metaphor for \"stone-hard blows of\\n\\t\\t\\t\\tchastisement pre-ordained\", i.e., in God's decree\\n\\t\\t\\t\\t(Zamakhshari and Razi, with analogous comments on the\\n\\t\\t\\t\\tsame expression in  11:82 ). As already mentioned in the\\n\\t\\t\\t\\tintroductory note, the particular chastisement to which\\n\\t\\t\\t\\tthe above verse alludes seems to have been a sudden\\n\\t\\t\\t\\tepidemic of extreme virulence: according to Waqidi and\\n\\t\\t\\t\\tMuhammad ibn Ishaq - the latter as quoted by Ibn Hisham\\n\\t\\t\\t\\tand Ibn Kathir - \"this was the first time that spotted\\n\\t\\t\\t\\tfever (hasbah) and smallpox (judari) appeared in the land\\n\\t\\t\\t\\tof the Arabs\". It is interesting to note that the word\\n\\t\\t\\t\\thasbah - which, according to some authorities, signifies\\n\\t\\t\\t\\talso typhus - primarily means \"pelting [or smiting\"] with\\n\\t\\t\\t\\tstones\" (Qamus). - As regards the noun ta'ir (of which\\n\\t\\t\\t\\ttayr is the plural), we ought to remember that it denotes\\n\\t\\t\\t\\tany \"flying creature\", whether bird or insect (Taj\\n\\t\\t\\t\\tal-'Arus). Neither the Qur'an nor any authentic Tradition\\n\\t\\t\\t\\toffers us any evidence as to the nature of the \"flying\\n\\t\\t\\t\\tcreatures\" mentioned in the above verse; and since, on\\n\\t\\t\\t\\tthe other hand, all the \"descriptions\" indulged in by the\\n\\t\\t\\t\\tcommentators are purely imaginary, they need not be\\n\\t\\t\\t\\tseriously considered. If the hypothesis of an epidemic is\\n\\t\\t\\t\\tcorrect, the \"flying creatures\" - whether birds or\\n\\t\\t\\t\\tinsects - may well have been the carriers of the\\n\\t\\t\\t\\tinfection. One thing, however, is clear: whatever the\\n\\t\\t\\t\\tnature of the doom that overtook the invading force, it\\n\\t\\t\\t\\twas certainly miraculous in the true sense of this word -\\n\\t\\t\\t\\tnamely, in the sudden, totally unexpected rescue which it\\n\\t\\t\\t\\tbrought to the distressed people of Mecca."
  },
  {
    "SurahNumber": "105",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "This passage is evidently continued in the next surah,\\n\\t\\t\\t\\twhich, according to some authorities, is part of the\\n\\t\\t\\t\\tpresent one (see introductory note to surah {106})."
  }
]
