[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/065001",
        "Body":  "O Prophet! when ye do divorce women divorce them at their\n\t\t\tprescribed periods and count (accurately) their prescribed\n\t\t\tperiods: and fear Allah your Lord: and turn them not out of their\n\t\t\thouses nor shall they (themselves) leave except in case they are\n\t\t\tguilty of some open lewdness.  Those are limits set by Allah: and\n\t\t\tany who transgresses the limits of Allah does verily wrong his\n\t\t\t(own) soul: thou knowest not if perchance Allah will bring about\n\t\t\tthereafter some new situation. \u003cspan class=\u0027fn\u0027\u003e5503\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5504\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5505\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5506\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5507\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5508\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/065010",
        "Body":  "Allah has prepared for them a severe Punishment (in the\n\t\t\tHereafter). Therefore fear Allah O ye men of understanding who\n\t\t\thave believed!\tfor Allah hath indeed sent down to you a Message\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5523\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5524\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/065011",
        "Body":  "An Apostle who rehearses to you the Signs of Allah containing\n\t\t\tclear explanations that he may lead forth those who believe and\n\t\t\tdo righteous deeds from the depths of Darkness into Light.  And\n\t\t\tthose who believe in Allah and work righteousness He will admit\n\t\t\tto Gardens beneath which rivers flow to dwell therein forever:\n\t\t\tAllah has indeed granted for them a most excellent provision.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5525\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/065012",
        "Body":  "Allah is He Who created seven Firmaments and of the earth a\n\t\t\tsimilar number. Through the midst of them (all) descends His\n\t\t\tCommand: that ye may know that Allah has power over all things\n\t\t\tand that Allah comprehends all things in (His) Knowledge.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5526\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5527\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5528\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/065002",
        "Body":  "Thus when they fulfil their term appointed either take them back\n\t\t\ton equitable terms or part with them on equitable terms; and take\n\t\t\tfor witness two persons from among you endued with justice and\n\t\t\testablish the evidence (as) before Allah.  Such is the admonition\n\t\t\tgiven to him who believes in Allah and the Last Day. And for\n\t\t\tthose who fear Allah He (ever) prepares a way out \u003cspan class=\u0027fn\u0027\u003e5509\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5510\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5511\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/065003",
        "Body":  "And He provides for him from (sources) he never could imagine. \n\t\t\tAnd if anyone puts his trust in Allah sufficient is (Allah) for\n\t\t\thim.  For Allah will surely accomplish His purpose: verily for\n\t\t\tall things has Allah appointed a due proportion. \u003cspan class=\u0027fn\u0027\u003e5512\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/065004",
        "Body":  "Such of your women as have passed the age of monthly courses for\n\t\t\tthem the prescribed period if ye have any doubt is three months\n\t\t\tand for those who have no courses (it is the same): for those who\n\t\t\tcarry (life within their wombs) their period is until they\n\t\t\tdeliver their burdens: and for those who fear Allah He will make\n\t\t\ttheir path easy. \u003cspan class=\u0027fn\u0027\u003e5513\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5514\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/065005",
        "Body":  "That is the Command of Allah which He has sent down to you: and\n\t\t\tif anyone fears Allah He will remove his ills from him and will\n\t\t\tenlarge His reward. \u003cspan class=\u0027fn\u0027\u003e5515\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/065006",
        "Body":  "Let the women live (in \u0027iddah) in the same style as ye live\n\t\t\taccording to your means: annoy them not so as to restrict them. \n\t\t\tAnd if they carry (life in their wombs) then spend (your\n\t\t\tsubstance) on them until they deliver their burden: and if they\n\t\t\tsuckle your (offspring) give them their recompense: and take\n\t\t\tmutual counsel together according to what is just and reasonable.\n\t\t\t And if ye find yourselves in difficulties let another woman\n\t\t\tsuckle (the child) on the (father\u0027s) behalf. \u003cspan class=\u0027fn\u0027\u003e5516\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5517\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5518\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5519\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/065007",
        "Body":  "Let the man of means spend according to his means: and the man\n\t\t\twhose resources are restricted let him spend according to what\n\t\t\tAllah has given him.  Allah puts no burden on any person beyond\n\t\t\twhat He has given him.\tAfter a difficulty Allah will soon grant\n\t\t\trelief. \u003cspan class=\u0027fn\u0027\u003e5520\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/065008",
        "Body":  "How many populations that insolently opposed the command of their\n\t\t\tLord and of His apostles did We not then call to account to\n\t\t\tsevere account? And We imposed on them an exemplary Punishment.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5521\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5522\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "65",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/065009",
        "Body":  "Then did they taste the evil result of their conduct and the End\n\t\t\tof their conduct was Perdition."
    }
]
