[
  {
    "SurahNumber": "23",
    "AyahNumber": "1",
    "NoteID": "2865",
    "Body": "Aflaha: win through, prosper, succeed, achieve their aims\\n\\t\\t\\t\\tor obtain salvation from sorrow and all evil. This verse\\n\\t\\t\\t\\tconnects on with verses 10 and 11 below. The success or\\n\\t\\t\\t\\tvictory may come in this world, but is certain and\\n\\t\\t\\t\\tlasting in the world to come."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "2",
    "NoteID": "2866",
    "Body": "Humility in prayer as regards (1) their estimate of their\\n\\t\\t\\t\\town worth in Allah's presence, (2) as regards their\\n\\t\\t\\t\\testimate of their own powers or strength unless they are\\n\\t\\t\\t\\thelped by Allah, and (3) as regards the petitions they\\n\\t\\t\\t\\toffer to Allah."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "5",
    "NoteID": "2867",
    "Body": "The Muslim must guard himself against every kind of sex\\n\\t\\t\\t\\tabuse or sex perversion. The new psychology associated\\n\\t\\t\\t\\twith the name of Freud traces many of our hidden motives\\n\\t\\t\\t\\tto sex, and it is common knowledge that our refinement or\\n\\t\\t\\t\\tdegradation may be measured by the hidden workings of our\\n\\t\\t\\t\\tsex instincts. But even the natural and lawful exercise\\n\\t\\t\\t\\tof sex is restricted to the marriage bond, under which\\n\\t\\t\\t\\tthe rights of both parties are duly regulated and\\n\\t\\t\\t\\tmaintained."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "6",
    "NoteID": "2868",
    "Body": "This is further explained and amplified in iv. 25."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "8",
    "NoteID": "2869",
    "Body": "Trusts may be express or implied. Express trusts are\\n\\t\\t\\t\\tthose where property is entrusted or duties are assigned\\n\\t\\t\\t\\tby some one to some other whom he trusts, to carry out\\n\\t\\t\\t\\teither immediately or in specified contingencies, such as\\n\\t\\t\\t\\tdeath. Implied trusts arise out of power, or position, or\\n\\t\\t\\t\\topportunity; e.g., a king holds his kingdom on trust from\\n\\t\\t\\t\\tAllah for his subjects. The subject of covenants, express\\n\\t\\t\\t\\tand implied, has been discussed in n. 682 to v.1.\\n\\t\\t\\t\\tCovenants create obligations, and express and implied\\n\\t\\t\\t\\ttrusts and covenants taken together cover the whole field\\n\\t\\t\\t\\tof obligations."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "9",
    "NoteID": "2870",
    "Body": "In verse 2 we were directed to the spirit of humility and\\n\\t\\t\\t\\tearnestness in our prayers. Here we are told how\\n\\t\\t\\t\\tnecessary the habit of regular prayer is to our spiritual\\n\\t\\t\\t\\twell-being and development, as it brings us closer to\\n\\t\\t\\t\\tAllah, and thus sums up the light of the seven jewels of\\n\\t\\t\\t\\tour Faith, viz.,: (1) humility, (2) avoidance of vanity,\\n\\t\\t\\t\\t(3) charity, (4) sex purity, (5) fidelity to trusts, and\\n\\t\\t\\t\\t(6) to covenants, and (7) an earnest desire to get closer\\n\\t\\t\\t\\tto Allah."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "10",
    "NoteID": "2871",
    "Body": "Cf. xxi. 105, where it is said that the righteous will\\n\\t\\t\\t\\tinherit the earth. In the first verse of this Sura, the\\n\\t\\t\\t\\tfinal success or victory is referred to. Truth will\\n\\t\\t\\t\\tprevail even on this earth, but it may not be for any\\n\\t\\t\\t\\tindividual men of righteousness to see it: it may be in\\n\\t\\t\\t\\tthe time of their heirs and successors. But in the life\\n\\t\\t\\t\\tto come, there is no doubt that every man will see the\\n\\t\\t\\t\\tfruit of his life here, and the righteous will inherit\\n\\t\\t\\t\\theaven, in the sense that they will attain it after their\\n\\t\\t\\t\\tdeath here."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "12",
    "NoteID": "2872",
    "Body": "In this beautiful passage, Allah's creative work, as far\\n\\t\\t\\t\\tas man is concerned, is recapitulated, in order to show\\n\\t\\t\\t\\tman's real position in this life, and the certainty of\\n\\t\\t\\t\\tthe future: to which he was referred for his reward in\\n\\t\\t\\t\\tverses 10-11 above. For the various stages of creation,\\n\\t\\t\\t\\tsee n. 120 to ii. 117. Here we are not concerned with the\\n\\t\\t\\t\\tearliest stage, the creation of primeval matter out of\\n\\t\\t\\t\\tnothing. It is also a process of creation when inorganic\\n\\t\\t\\t\\tmatter becomes living matter. Thus inorganic constituents\\n\\t\\t\\t\\tof the earth are absorbed into fiving matter by way of\\n\\t\\t\\t\\tfood and living matter reproduces itself by means of\\n\\t\\t\\t\\tsperm. This is deposited in the ovum and fertilises it\\n\\t\\t\\t\\tand rests for a time in security in the mother's womb.\\n\\t\\t\\t\\tThe first change in the fertilised ovum is the conversion\\n\\t\\t\\t\\tinto a sort of clot of thickly congealed blood; the\\n\\t\\t\\t\\tzygote cells grow by segmentation; then the mass\\n\\t\\t\\t\\tgradually assumes shape in its growth as a foetus. From\\n\\t\\t\\t\\tthe lump develop bones and flesh and organs and a nervous\\n\\t\\t\\t\\tsystem. So far man's growth is like that of an animal,\\n\\t\\t\\t\\tbut a further process takes place which makes the infant\\n\\t\\t\\t\\tanimal into the infant man. This is the breathing from\\n\\t\\t\\t\\tAllah's spirit into him (xv. 29). It may be a continuous\\n\\t\\t\\t\\tprocess parallel to that of physical growth. The child is\\n\\t\\t\\t\\tborn; it grows; it decays and dies; but after death\\n\\t\\t\\t\\tanother chapter opens for the individual, and it is to\\n\\t\\t\\t\\tremind us of this most momentous chapter that the\\n\\t\\t\\t\\tprevious stages are recapitulated."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "13",
    "NoteID": "2873",
    "Body": "The growth in the foetal stage is silent and unseen. The\\n\\t\\t\\t\\tfoetus is protected in the mother's womb like a king in a\\n\\t\\t\\t\\tcastle; it is firmly fixed, and gets the protection of\\n\\t\\t\\t\\tthe mother's body, on which it depends for its own growth\\n\\t\\t\\t\\tuntil birth."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "14",
    "NoteID": "2874",
    "Body": "From a mere animal, we now consider man as man. Is it not\\n\\t\\t\\t\\ta Sign of wonder in itself that from dry dust (turab,\\n\\t\\t\\t\\txxii. 5) or inorganic matter should be made protoplasm\\n\\t\\t\\t\\t(moist clay or organic matter); from it should grow a new\\n\\t\\t\\t\\tanimal life; and out of it should grow human life, with\\n\\t\\t\\t\\tall its capacities and responsibilities? Man carries\\n\\t\\t\\t\\twithin himself Signs of Allah's wisdom and power, and he\\n\\t\\t\\t\\tcan see them every day in the universe around him."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "15",
    "NoteID": "2875",
    "Body": "Our physical death in this mortal life seems to make a\\n\\t\\t\\t\\tbreak. But if it were the end of all, our life becomes\\n\\t\\t\\t\\tmeaningless. Our own instinct tells us that it cannot be\\n\\t\\t\\t\\tso, and Allah assures us that there will be a\\n\\t\\t\\t\\tresurrection for judgment."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "17",
    "NoteID": "2876",
    "Body": "Taraiq: literally tracts, roads, orbits or paths. Here it\\n\\t\\t\\t\\tmeans: seven heavens. The assurance given in the next\\n\\t\\t\\t\\tclause, that Allah cares for us and all His Creation,\\n\\t\\t\\t\\tcalls out attention to Allah's goodness, which is further\\n\\t\\t\\t\\tillustrated in the subsequent verses."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "17",
    "NoteID": "2877",
    "Body": "Allah's care for His Creation is ceaseless. A few\\n\\t\\t\\t\\texamples of His care for our physical well-being are\\n\\t\\t\\t\\tgiven in verses 18-22, and for our spiritual well-being,\\n\\t\\t\\t\\tin Sections 2 to 5."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "18",
    "NoteID": "2878",
    "Body": "Normally the rain comes well distributed; it soaks into\\n\\t\\t\\t\\tthe soil; the moisture is retained for a long time in all\\n\\t\\t\\t\\thigh grounds; it soaks and penetrates through many layers\\n\\t\\t\\t\\tof soil and forms the architecture of physical geography;\\n\\t\\t\\t\\tthe retentive powers of higher soil enable rivers to flow\\n\\t\\t\\t\\tperennially even where, as in India, the rainfall is\\n\\t\\t\\t\\tseasonal and confined to a few months in the year.\\n\\t\\t\\t\\tAnother form in which water comes down from the sky\\n\\t\\t\\t\\taccording to due measure is in snow and hail: these also\\n\\t\\t\\t\\thave their place in the economy of air and soil. Were it\\n\\t\\t\\t\\tnot for snow and glaciers in the higher mountain regions,\\n\\t\\t\\t\\tsome of the rivers would fail in their abundant flow. As\\n\\t\\t\\t\\twonderful as the supply of water and moisture is its\\n\\t\\t\\t\\tdrainage. It retums to the sea and air in all sorts of\\n\\t\\t\\t\\tways, and the formation of mist and clouds repeats the\\n\\t\\t\\t\\tcycle. Were it not for the drainage and the clearance of\\n\\t\\t\\t\\tthe waters, we should have floods and waterlogging, as\\n\\t\\t\\t\\thappens when the normal processes of nature are\\n\\t\\t\\t\\ttemporarily obstructed. The same thing happens when the\\n\\t\\t\\t\\train comes down in other than due measure. These abnormal\\n\\t\\t\\t\\tconditions also have their value. But how grateful should\\n\\t\\t\\t\\tman be for Allah's gifts in the ceaseless processes of\\n\\t\\t\\t\\tnature on such an enormous scale!"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "19",
    "NoteID": "2879",
    "Body": "Cf. vii. 19 and n. 776 to v. 69."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "20",
    "NoteID": "2880",
    "Body": "For Arabia the best olives grow round about Mount Sinai.\\n\\t\\t\\t\\tThe fig, the olive, Mount Sinai, and the sacred city of\\n\\t\\t\\t\\tMakkah are mentioned together in association in xcv. 1-3,\\n\\t\\t\\t\\twhere we shall consider its meaning. Olive oil is an\\n\\t\\t\\t\\tingredient in medicinal ointments. If used for food, the\\n\\t\\t\\t\\tolive has a delicious flavour, Cf. also xxiv. 35, where\\n\\t\\t\\t\\tthe olive is called a Blessed Tree, and n. 3000."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "21",
    "NoteID": "2881",
    "Body": "'Ibrat. the root meaning of the verb is \"to interpret, or\\n\\t\\t\\t\\texpound, or instruct\", as in xii. 43; the noun means, an\\n\\t\\t\\t\\tinterpretation, or example or Sign that instructs, as\\n\\t\\t\\t\\there and in xvi. 66, or gives warning, as in iii. 13.\\n\\t\\t\\t\\tFrom cattle we get milk and meat; also from their skins\\n\\t\\t\\t\\twe make leather for shoes, boots, straps, saddlery, and\\n\\t\\t\\t\\tnumerous other uses; from camel's hair and sheep's wool\\n\\t\\t\\t\\twe weave cloth, hangings, carpets, etc.; from the horns\\n\\t\\t\\t\\tof cattle we make cups and articles of ornament or use;\\n\\t\\t\\t\\tand camels, horses, donkeys, mules, etc., are used for\\n\\t\\t\\t\\triding, carrying loads, or drawing vehicles."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "23",
    "NoteID": "2882",
    "Body": "The material gifts having been mentioned, which we\\n\\t\\t\\t\\treceive from a wise and kindly Providence, our attention\\n\\t\\t\\t\\tis now directed to Allah's Providence in spiritual\\n\\t\\t\\t\\tmatters. He sent Teachers to instruct and guide us, and\\n\\t\\t\\t\\tthough they were mocked, rejected, and accused of\\n\\t\\t\\t\\tfalsehood and selfishness, they were protected by Allah,\\n\\t\\t\\t\\tand Allah's Truth at length prevailed."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "23",
    "NoteID": "2883",
    "Body": "\"People\" here is almost equivalent to \"contemporaries\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "23",
    "NoteID": "2884",
    "Body": "Cf. vii. 59. To fear Allah is to lead righteous lives and\\n\\t\\t\\t\\teschew evil."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "24",
    "NoteID": "2885",
    "Body": "They attribute altogether wrong motives to him (such as\\n\\t\\t\\t\\twould have actuated them themselves), in saying that he\\n\\t\\t\\t\\twas trying to establish his own personal superiority over\\n\\t\\t\\t\\tthem by his preaching. Then they accuse him of falsehood\\n\\t\\t\\t\\tin claiming to bring a message of Allah. \"If\", they say,\\n\\t\\t\\t\\t\"Allah had wished to send us messengers, He would have\\n\\t\\t\\t\\tsent angels, not a man like ourselves and from among\\n\\t\\t\\t\\tourselves. Our ancestors did not worship One God: why\\n\\t\\t\\t\\tshould we?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "25",
    "NoteID": "2886",
    "Body": "I construe this to be a speech of another group among\\n\\t\\t\\t\\tthem. They thought he was mad, and best left alone. His\\n\\t\\t\\t\\tmadness would run out, or he would come to an evil end."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "27",
    "NoteID": "2887",
    "Body": "Cf. this whole passage with xi. 35-48, and notes thereon."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "27",
    "NoteID": "2888",
    "Body": "See n. 1533 to xi. 40."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "27",
    "NoteID": "2889",
    "Body": "See. 1534 to xi. 40."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "27",
    "NoteID": "2890",
    "Body": "See n. 1535 to xi. 40."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "28",
    "NoteID": "2891",
    "Body": "For istawa see 1386 to x. 3. Here the meaning is: mounted\\n\\t\\t\\t\\ton board, ascended, embarked."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "29",
    "NoteID": "2892",
    "Body": "This second prayer was inspired when the Flood subsided,\\n\\t\\t\\t\\tand the time came for disembarkation."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "30",
    "NoteID": "2893",
    "Body": "Noah's contemporaries had all sorts of chances and\\n\\t\\t\\t\\twarnings. But they refused to believe and perished. But\\n\\t\\t\\t\\tAllah's Truth survived, and it went to the next and\\n\\t\\t\\t\\tsucceeding generations. Will not mankind understand?"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "32",
    "NoteID": "2894",
    "Body": "If this refers to any particular prophet, it must be Hud\\n\\t\\t\\t\\twhose mission was to the 'Ad people, or to Salih, whose\\n\\t\\t\\t\\tmission was to the Thamud people. That is the sequence\\n\\t\\t\\t\\tafter Noah in S. xi. 50-60 and 61-68. But I think that as\\n\\t\\t\\t\\tthe name is not mentioned, we are to understand in\\n\\t\\t\\t\\tgeneral the type of the post-Flood prophets until we come\\n\\t\\t\\t\\tlater on to Moses and Jesus. The object here is not to\\n\\t\\t\\t\\trecount the stories, but to show that the resistance of\\n\\t\\t\\t\\tthe wicked made no difference to the triumph of Allah's\\n\\t\\t\\t\\tholy Truth."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "34",
    "NoteID": "2895",
    "Body": "The type of the narrow Sybarite, who enjoys the good\\n\\t\\t\\t\\tthings of this life, denies a future life, and is jealous\\n\\t\\t\\t\\tof any one who presumes to widen his horizon, is here\\n\\t\\t\\t\\tdescribed in a few masterly strokes. He is bored by any\\n\\t\\t\\t\\tmention of the serious things beyond his ken. What good\\n\\t\\t\\t\\tis it, he says, to talk about the future? Enjoy the\\n\\t\\t\\t\\tpresent. The gain is all in the present: the loss is all\\n\\t\\t\\t\\tin the future."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "37",
    "NoteID": "2896",
    "Body": "They seem to say; \"There is no future life: that we shall\\n\\t\\t\\t\\tdie is certain; that we have this life is certain: some\\n\\t\\t\\t\\tdie, some are born, some live: and so the cycle\\n\\t\\t\\t\\tcontinues: but how can dead men be raised to life?\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "38",
    "NoteID": "2897",
    "Body": "\"He is only a fool, and invents things, and attributes\\n\\t\\t\\t\\tthem to Allah's inspiration! We are too wise to believe\\n\\t\\t\\t\\tsuch things!\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "39",
    "NoteID": "2898",
    "Body": "See above, xxiii. 26. Every prophet is maligned and\\n\\t\\t\\t\\tpersecuted: it is always the same story with them, told\\n\\t\\t\\t\\tin different ways."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "40",
    "NoteID": "2899",
    "Body": "When the Punishment comes, they will be sorry for\\n\\t\\t\\t\\tthemselves, but it will be too late then."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "41",
    "NoteID": "2900",
    "Body": "See xi. 66, and notes 1563 and 1561."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "41",
    "NoteID": "2901",
    "Body": "Gutha-un: rubbish of dead leaves, or scum floating on a\\n\\t\\t\\t\\ttorrent."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "44",
    "NoteID": "2902",
    "Body": "Their habitations and their organisation have been wiped\\n\\t\\t\\t\\tout. What remains is merely a vague story of their\\n\\t\\t\\t\\texistence, a tale that is told. Where their name remains,\\n\\t\\t\\t\\twhich is not always the case, it is only a by-word,\\n\\t\\t\\t\\tsuggesting all that is unstable and ephemeral,-\"to point\\n\\t\\t\\t\\ta moral and adorn a tale\"."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "45",
    "NoteID": "2903",
    "Body": "Moses and Aaron had a twofold mission: (1) to Pharaoh and\\n\\t\\t\\t\\this Court, which failed because of Egyptian arrogance;\\n\\t\\t\\t\\t(2) to the Israelites, for whom the Law was received on\\n\\t\\t\\t\\tMount Sinai, but they repeatedly rebelled against Allah.\\n\\t\\t\\t\\tIn both cases there were miracles (\"Clear Signs\") and\\n\\t\\t\\t\\tother proofs which showed that they came at Allah's\\n\\t\\t\\t\\tcommand and were inspired by His authority."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "47",
    "NoteID": "2904",
    "Body": "Racial arrogance made the Egyptians say, 'These men\\n\\t\\t\\t\\tbelong to a race which we hold in subjection as our\\n\\t\\t\\t\\tslaves: how can we accept them as messengers of Allah?'"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "49",
    "NoteID": "2905",
    "Body": "Here the reference is to the second part of the mission\\n\\t\\t\\t\\tof Moses, that to the Israelites, which the Israelites\\n\\t\\t\\t\\trendered ineffective by their want of faith. See n. 2903\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "50",
    "NoteID": "2906",
    "Body": "The virgin birth of Jesus was a miracle both for him and\\n\\t\\t\\t\\this mother. She was falsely accused of unchastity, but\\n\\t\\t\\t\\tthe child Jesus triumphantly vindicated her by his own\\n\\t\\t\\t\\tmiracles (xix. 27-33), and showed by his life the\\n\\t\\t\\t\\tmeanness of the calumny against his mother."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "50",
    "NoteID": "2907",
    "Body": "There is no need to look far for the place where mother\\n\\t\\t\\t\\tand child were given secure shelter. It is described in\\n\\t\\t\\t\\txix. 22-26. It was the place to which she withdrew to be\\n\\t\\t\\t\\tdelivered when the time drew near. There was a fruitful\\n\\t\\t\\t\\tpalm-tree, evidently on high ground, for beneath it\\n\\t\\t\\t\\tflowed a spring. She retired there in seclusion, and she\\n\\t\\t\\t\\tand her child rested there until it was time for her to\\n\\t\\t\\t\\tgo to her people with her child."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "51",
    "NoteID": "2908",
    "Body": "Literally, \"eat\". See n. 776 to v. 69. The prophets of\\n\\t\\t\\t\\tAllah do not pose as ascetics, but receive gratefully all\\n\\t\\t\\t\\tAllah's gifts, and show their gratitude by their\\n\\t\\t\\t\\trighteous lives."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "52",
    "NoteID": "2909",
    "Body": "Cf. xxi. 92-93. All prophets form one Brotherhood: their\\n\\t\\t\\t\\tmessage is one, and their religion and teaching are one;\\n\\t\\t\\t\\tthey serve the One True God, Who loves and cherishes\\n\\t\\t\\t\\tthem; and they owe their duty to Him and Him alone."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "53",
    "NoteID": "2910",
    "Body": "The people who began to trade on the names of the\\n\\t\\t\\t\\tprophets cut off that unity and made sects; and each sect\\n\\t\\t\\t\\trejoices in its own narrow doctrine, instead of taking\\n\\t\\t\\t\\tthe universal teaching of Unity from Allah. But this\\n\\t\\t\\t\\tsectarian confusion is of man's making. It will last for\\n\\t\\t\\t\\ta time, but the rays of Truth and Unity will finally\\n\\t\\t\\t\\tdissipate it."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "56",
    "NoteID": "2911",
    "Body": "Worldly wealth, power, and influence may be but trials.\\n\\t\\t\\t\\tLet not their possessors think that they are in\\n\\t\\t\\t\\tthemselves things that will necessarily bring them\\n\\t\\t\\t\\thappiness."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "60",
    "NoteID": "2912",
    "Body": "Their hearts are full of reverence for Allah and fear\\n\\t\\t\\t\\tlest their charity or their hearts be not good enough for\\n\\t\\t\\t\\tacceptance before their Lord; for they have the certainty\\n\\t\\t\\t\\tof a future life, in which they will stand before the\\n\\t\\t\\t\\tJudgment Seat. They fear for their own worthiness, but\\n\\t\\t\\t\\tthey hope in Faith."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "62",
    "NoteID": "2913",
    "Body": "Cf. ii. 286 and n. 339."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "62",
    "NoteID": "2914",
    "Body": "The record speaks clearly, and shows exactly what each\\n\\t\\t\\t\\tsoul has done and thought, and what is due to it in\\n\\t\\t\\t\\tjustice. The worst will receive full justice. The best\\n\\t\\t\\t\\twill receive far more than their due: xxviii. 84."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "63",
    "NoteID": "2915",
    "Body": "This is said of the Unbelievers who rejected Faith and\\n\\t\\t\\t\\trejoiced in the vanities of this world. In spite of the\\n\\t\\t\\t\\tproclamation of Truth, they are doubtful of the future\\n\\t\\t\\t\\tLife and Judgment."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "63",
    "NoteID": "2916",
    "Body": "In addition to their rejection of Faith, they have\\n\\t\\t\\t\\tagainst them positive deeds of wrong-doing, from which,\\n\\t\\t\\t\\ton account of their contempt of the Light from Allah,\\n\\t\\t\\t\\tthey will not desist until they are sharply pulled up for\\n\\t\\t\\t\\tpunishment: and then repentance will be too late!"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "67",
    "NoteID": "2917",
    "Body": "Samir: one who remains awake by night, one who passes the\\n\\t\\t\\t\\tnight in talk or in the recital of stories of romances, a\\n\\t\\t\\t\\tfavourite amusement of the Days of Ignorance."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "68",
    "NoteID": "2918",
    "Body": "If they ponder over the matter, they will find that\\n\\t\\t\\t\\tAllah's Message to humanity is as old as Adam. It is good\\n\\t\\t\\t\\tfor all ages. It never grows old, and it is never new."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "71",
    "NoteID": "2919",
    "Body": "Allah is All-Wise and All-Good, and His architecture of\\n\\t\\t\\t\\tthe universe is on a perfect Plan. If these poor, low,\\n\\t\\t\\t\\tselfish, ignorant creatures were to plan it according to\\n\\t\\t\\t\\ttheir hearts' desires, it would be a dreadful world, full\\n\\t\\t\\t\\tof confusion and corruption."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "72",
    "NoteID": "2920",
    "Body": "This is the last of the questions, beginning with xxiii.\\n\\t\\t\\t\\t68 above, showing the absurdity of the position taken up\\n\\t\\t\\t\\tby the Unbelievers. (1) The Message of Allah is as old as\\n\\t\\t\\t\\thumanity: why do they fight shy of it? (2) They have\\n\\t\\t\\t\\tknown their Prophet to be true and righteous: why do they\\n\\t\\t\\t\\tdeny him? (3) Is it madness to bring the bitter Truth\\n\\t\\t\\t\\tbefore them? (4) Does the Prophet ask any worldly reward\\n\\t\\t\\t\\tfrom them? If not, why do they reject his unselfish\\n\\t\\t\\t\\tefforts for their own good?"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "75",
    "NoteID": "2921",
    "Body": "The reference is to a very severe famine felt in Makkah,\\n\\t\\t\\t\\twhich was attributed by the Unbelievers to the presence\\n\\t\\t\\t\\tof the holy Prophet among them and his preaching against\\n\\t\\t\\t\\ttheir gods. As this is a Makkan Sura, the famine referred\\n\\t\\t\\t\\tto must be that described by Ibn Kathir as having occured\\n\\t\\t\\t\\tin the 8th year of the Mission, say about four years\\n\\t\\t\\t\\tbefore the Hijra. There was also a post-Hijra famine,\\n\\t\\t\\t\\twhich is referred to by Bukhari, but that was a later\\n\\t\\t\\t\\tevent."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "76",
    "NoteID": "2922",
    "Body": "Some Commentators understand the battle of Badr to be\\n\\t\\t\\t\\tmeant here; if so, this particular verse would be of the\\n\\t\\t\\t\\tMadinah period. But it is better to understand it as\\n\\t\\t\\t\\treferring to the same \"distress\" as in the preceding\\n\\t\\t\\t\\tverse, or to punishments in general, which obstinate\\n\\t\\t\\t\\tsinners refuse to take as warnings given to them to mend\\n\\t\\t\\t\\ttheir ways and turn in repentance to Allah."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "77",
    "NoteID": "2923",
    "Body": "Cf. vi. 44. If the little trials in the present life will\\n\\t\\t\\t\\tnot open their eyes, will great trials do so?\\n\\t\\t\\t\\tUnfortunately they only cause in the wicked a feeling of\\n\\t\\t\\t\\tdespair. In the final Punishment after the Judgment, it\\n\\t\\t\\t\\twill be too late for them to repent, and despair will be\\n\\t\\t\\t\\ttheir only lot."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "78",
    "NoteID": "2924",
    "Body": "As elsewhere, \"heart\" is to be understood as the seat\\n\\t\\t\\t\\tboth of feeling and intelligence. 'All the means by which\\n\\t\\t\\t\\tknowledge can be gathered, judgment formed, and goodness\\n\\t\\t\\t\\tcultivated, are provided for you by Allah. If you were\\n\\t\\t\\t\\tgrateful, you would use those in My service, which is\\n\\t\\t\\t\\texpressed in your service to your fellow men. But instead\\n\\t\\t\\t\\tyou ignore these gifts, question Allah's Providence, and\\n\\t\\t\\t\\tblaspheme against Him!'"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "80",
    "NoteID": "2925",
    "Body": "The alternation of Night and Day stands here as a symbol\\n\\t\\t\\t\\tfor all the beneficent processes of Nature provided by\\n\\t\\t\\t\\tAllah for the comfort and growth of man's outer and inner\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "81",
    "NoteID": "2926",
    "Body": "And they are the more culpable, as they have received a\\n\\t\\t\\t\\tlater and completer revelation. Why should they now stand\\n\\t\\t\\t\\ton the primitive ideas of their ancestors?"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "85",
    "NoteID": "2927",
    "Body": "If their argument is that such things about a future life\\n\\t\\t\\t\\tcannot be known or proved, they are referred to the\\n\\t\\t\\t\\tthings which are actually before them. The tangible\\n\\t\\t\\t\\tthings of the earth-can they postulate their order or\\n\\t\\t\\t\\tgovernment except by a Power or Force or Energy outside\\n\\t\\t\\t\\tthem? They will admit that there is such a Power or Force\\n\\t\\t\\t\\tor Energy. We call it Allah. Go a step further. We see a\\n\\t\\t\\t\\tsublime Universe in the heavens above, stretching far,\\n\\t\\t\\t\\tfar beyond our ken. They will admit its existence and its\\n\\t\\t\\t\\tgrandeur. We ask them to entertain a feeling of reverence\\n\\t\\t\\t\\tfor the Power behind it, and to understand their own\\n\\t\\t\\t\\tlittleness and their dependence upon that Power."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "86",
    "NoteID": "2928",
    "Body": "Cf. ix. 129."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "87",
    "NoteID": "2929",
    "Body": "See n. 2927 above. 'If this great and glorious Universe\\n\\t\\t\\t\\tinspires you with awe, surely the Power behind is more\\n\\t\\t\\t\\tworthy of your awe, especially if you compare your\\n\\t\\t\\t\\tdependence and its dependence upon Him.'"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "89",
    "NoteID": "2930",
    "Body": "'The order and unity of purpose in the Universe argue\\n\\t\\t\\t\\tunity of design and goodness in its Maker. Is it not then\\n\\t\\t\\t\\tsheer madness for you to run after fancies and fail to\\n\\t\\t\\t\\tunderstand and obey His Will? It is delusion in you to\\n\\t\\t\\t\\tseek other than Allah.'"
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "91",
    "NoteID": "2931",
    "Body": "Cf. xvii. 42. The multiplicity of gods is intellectually\\n\\t\\t\\t\\tindefensible, considering the unity of Design and Purpose\\n\\t\\t\\t\\tin His wonderful Universe."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "92",
    "NoteID": "2932",
    "Body": "To suppose that Allah has a son or family or partners or\\n\\t\\t\\t\\tcompanions is to have a low idea of Allah, Who is high\\n\\t\\t\\t\\tabove all such relationships. He is the One True God, and\\n\\t\\t\\t\\tthere can be none to compare with Him."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "93",
    "NoteID": "2933",
    "Body": "In the first instance, this applied to the holy Prophet.\\n\\t\\t\\t\\tHis subsequent Hijrat from Makkah and the eventual\\n\\t\\t\\t\\toverthrow of the Makkan oligarchy amply prove the\\n\\t\\t\\t\\tfulfilment of the prophecy. But in general meaning it\\n\\t\\t\\t\\tapplies to all. We are taught that evil will be visited\\n\\t\\t\\t\\twith a terrible punishment, not only in a future life,\\n\\t\\t\\t\\tbut in this very life when its cup is full and the time\\n\\t\\t\\t\\tcomes for punishment in Allah's Plan. If it has to come\\n\\t\\t\\t\\twhile we are still on the scene of this life, we are\\n\\t\\t\\t\\tasked to pray that we may not be found in the company of\\n\\t\\t\\t\\tthose who draw such punishment on themselves. In other\\n\\t\\t\\t\\twords we must eschew the society of evil ones."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "96",
    "NoteID": "2934",
    "Body": "Whether people speak evil of you, in your presence or\\n\\t\\t\\t\\tbehind your back, or they do evil to you in either of\\n\\t\\t\\t\\tthose ways, all is known to Allah. It is not for you to\\n\\t\\t\\t\\tpunish. Your best course is not to do evil in your tum,\\n\\t\\t\\t\\tbut to do what will best repel the evil. Two evils do not\\n\\t\\t\\t\\tmake a good. Cf. xli. 34, n. 4504."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "97",
    "NoteID": "2935",
    "Body": "But in any case, shun evil for yourself, and you cannot\\n\\t\\t\\t\\tdo this without seeking the help and protection of Allah.\\n\\t\\t\\t\\tNot only must you shun all promptings of evil, but you\\n\\t\\t\\t\\tmust shun its proximity. It may be that in retaliating on\\n\\t\\t\\t\\tevil, or even in your curiosity to discover what evil is,\\n\\t\\t\\t\\tyou may fall into evil yourself. You should avoid going\\n\\t\\t\\t\\tnear it or anything which brings it near to you. And in\\n\\t\\t\\t\\tthis matter you should seek Allah's help."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "99",
    "NoteID": "2936",
    "Body": "This verse I think connects on with xxiii. 90 above.\\n\\t\\t\\t\\tThough Allah proclaims His Truth everywhere, the wicked\\n\\t\\t\\t\\tcling to Falsehood until they face the reality of Death."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "99",
    "NoteID": "2937",
    "Body": "The verb for \"send me back\" is in the plural in Arabic,\\n\\t\\t\\t\\twhich is construed either (1) as an emphatic form, as if\\n\\t\\t\\t\\tthe singular were repeated, or (2) as a plural of\\n\\t\\t\\t\\trespect, though such a plural is not ordinarily used in\\n\\t\\t\\t\\taddressing Allah, or (3) as a plural addressed to the\\n\\t\\t\\t\\tangels, after the address to Allah in \"O my Lord!\""
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "100",
    "NoteID": "2938",
    "Body": "The unrighteous will ask for another chance. But it will\\n\\t\\t\\t\\tbe too late then. The time for repentance will then have\\n\\t\\t\\t\\tpassed."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "100",
    "NoteID": "2939",
    "Body": "Their request will mean nothing. It will be treated\\n\\t\\t\\t\\tmerely as an empty word of excuse. They had plenty of\\n\\t\\t\\t\\tchances in this life. Not only did they reject them, but\\n\\t\\t\\t\\tthey did not even believe in Allah or ask for His\\n\\t\\t\\t\\tassistance."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "100",
    "NoteID": "2940",
    "Body": "Barzakh: a partition, a bar or barrier; the place or\\n\\t\\t\\t\\tstate in which people will be after death and before\\n\\t\\t\\t\\tJudgment. Cf. xxv. 53 and Iv. 20. Behind them is the\\n\\t\\t\\t\\tbarrier of death, and in front of them is the Barzakh,\\n\\t\\t\\t\\tpartition, a quiescent state until the judgment comes."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "101",
    "NoteID": "2941",
    "Body": "The old relationships of the world will then be\\n\\t\\t\\t\\tdissolved. Each soul will stand on its merits."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "102",
    "NoteID": "2942",
    "Body": "Good and evil deeds will be weighed against each other.\\n\\t\\t\\t\\tIf the good deeds prevail, the soul will attain falah,\\n\\t\\t\\t\\ti.e., prosperity, well-being, bliss, or salvation; if the\\n\\t\\t\\t\\tcontrary, there will be the misery and anguish of Hell."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "103",
    "NoteID": "2943",
    "Body": "The loss or perdition will not mean that they will die\\n\\t\\t\\t\\tand feel no more: xiv. 17. The punishment will mean\\n\\t\\t\\t\\tnothing, if there was no sensibility, but total\\n\\t\\t\\t\\tannihilation."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "104",
    "NoteID": "2944",
    "Body": "That is to say, their faces will be disfigured with\\n\\t\\t\\t\\tanguish, and their lips will quiver and fall out of\\n\\t\\t\\t\\tplace, exposing their teeth."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "106",
    "NoteID": "2945",
    "Body": "'The evil in us conquered us; it was our misfortune that\\n\\t\\t\\t\\twe surrendered to evil, and went astray.' They forget\\n\\t\\t\\t\\tthat it was by their own deliberate choice that they\\n\\t\\t\\t\\tsurrendered to evil, and they are reminded in verses\\n\\t\\t\\t\\t109-110 of the ridicule with which they covered godly men\\n\\t\\t\\t\\tin their life on earth."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "108",
    "NoteID": "2946",
    "Body": "After their flouting of Allah's Signs and their mockery\\n\\t\\t\\t\\tof godly men on earth, they have forfeited their right to\\n\\t\\t\\t\\tplead for mercy before Allah's Throne."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "110",
    "NoteID": "2947",
    "Body": "Literally, 'they made you forget My Message'. The ungodly\\n\\t\\t\\t\\twere so occupied in the backbiting and ridicule of the\\n\\t\\t\\t\\tgodly that the godly themselves became the unconscious\\n\\t\\t\\t\\tcause of the ungodly forgetting the warnings declared by\\n\\t\\t\\t\\tAllah against those who do not treat His Signs seriously.\\n\\t\\t\\t\\tThus evil often brings about its own ruin through the\\n\\t\\t\\t\\tinstrumentality of those whom it would make its victims."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "112",
    "NoteID": "2948",
    "Body": "The Hafs reading is \"Qala\", \"He will say\". This follows\\n\\t\\t\\t\\tthe Kufa Qiraat. The Basra Qiraat reads \"Qul\", \"Say\" (in\\n\\t\\t\\t\\tthe imperative). The point is only one of grammatical\\n\\t\\t\\t\\tconstruction. See n. 2666 to xxi. 4."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "113",
    "NoteID": "2949",
    "Body": "The question and answer about Time imply two things. (1)\\n\\t\\t\\t\\tThe attention of the ungodly is drawn to the extremely\\n\\t\\t\\t\\tshort time of the life in this world, compared to the\\n\\t\\t\\t\\teternity which they face: they are made to see this, and\\n\\t\\t\\t\\tto realise how mistaken they were in their comparative\\n\\t\\t\\t\\tvaluation of things spiritual and things material. (2)\\n\\t\\t\\t\\tTime, as we know it now, will have faded away and appear\\n\\t\\t\\t\\tas almost nothing. It is just a matter relative to this\\n\\t\\t\\t\\tlife of temporary probation. Cf. the experience of the\\n\\t\\t\\t\\tCompanions of the Cave: xviii. 19."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "115",
    "NoteID": "2950",
    "Body": "Allah's Creation is not without a high serious purpose.\\n\\t\\t\\t\\tIt is not vain, or for mere play or sport. As far as man\\n\\t\\t\\t\\tis concerned, the highest issues for him hang on his\\n\\t\\t\\t\\tbehaviour in this life. \"Life is real, life is earnest,\\n\\t\\t\\t\\tAnd the grave is not its goal\", as Longfellow truly says.\\n\\t\\t\\t\\tWe must therefore earnestly search out Allah's Truth,\\n\\t\\t\\t\\tencouraged by the fact that Allah's Truth is also, out of\\n\\t\\t\\t\\tHis unbounded mercy, searching us out and trying to reach\\n\\t\\t\\t\\tus."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "117",
    "NoteID": "2951",
    "Body": "Not with any one else whatever, as Allah is the Eternal\\n\\t\\t\\t\\tReality. If men, out of the figments of their\\n\\t\\t\\t\\timagination, fancy other gods, they will be rudely\\n\\t\\t\\t\\tundeceived. And Allah is Lord, i.e., our Cherisher as\\n\\t\\t\\t\\twell as our Creator. In spite of all our shortcomings and\\n\\t\\t\\t\\tour rebellions, He will forgive us if we go to Him not on\\n\\t\\t\\t\\tour merits but on His grace."
  },
  {
    "SurahNumber": "23",
    "AyahNumber": "117",
    "NoteID": "2952",
    "Body": "See the same word used in describing the contrast with\\n\\t\\t\\t\\tthe Believers, in the first verse of this Sura.\\n\\t\\t\\t\\tRighteousness must win and all opposition to it must\\n\\t\\t\\t\\tfail. Thus the circle of the argument is completed."
  }
]
