[
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "1",
    "Text": "O believers! Do not proceed &#761;in any matter&#762; before &#761;a decree from&#762; Allah and His Messenger. And fear Allah. Surely Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "2",
    "Text": "O believers! Do not raise your voices above the voice of the Prophet, nor speak loudly to him as you do to one another,<span class='fn' foot_note=29854>1</span>&nbsp;or your deeds will become void while you are unaware."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "3",
    "Text": "Indeed, those who lower their voices in the presence of Allah&rsquo;s Messenger are the ones whose hearts Allah has refined for righteousness. They will have forgiveness and a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "4",
    "Text": "Indeed, most of those who call out to you &#761;O Prophet&#762; from outside &#761;your&#762; private quarters have no understanding &#761;of manners&#762;.<span class='fn' foot_note=29855>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "5",
    "Text": "Had they been patient until you could come out to them, it would have certainly been better for them. And Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "6",
    "Text": "O believers, if an evildoer brings you any news, verify &#761;it&#762; so you do not harm people unknowingly, becoming regretful for what you have done.<span class='fn' foot_note=29856>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "7",
    "Text": "And keep in mind that Allah&rsquo;s Messenger is &#761;still&#762; in your midst. If he were to yield to you in many matters, you would surely suffer &#761;the consequences&#762;.<span class='fn' foot_note=29857>1</span>&nbsp;But Allah has endeared faith to you, making it appealing in your hearts. And He has made disbelief, rebelliousness, and disobedience detestable to you. Those are the ones rightly guided."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "8",
    "Text": "&#761;This is&#762; a bounty and a blessing from Allah. And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "9",
    "Text": "And if two groups of believers fight each other, then make peace between them. But if one of them transgresses against the other, then fight against the transgressing group until they &#761;are willing to&#762; submit to the rule of Allah. If they do so, then make peace between both &#761;groups&#762; in all fairness and act justly. Surely Allah loves those who uphold justice."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "10",
    "Text": "The believers are but one brotherhood, so make peace between your brothers. And be mindful of Allah so you may be shown mercy."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "11",
    "Text": "O believers! Do not let some &#761;men&#762; ridicule others, they may be better than them, nor let &#761;some&#762; women ridicule other women, they may be better than them. Do not defame one another, nor call each other by offensive nicknames. How evil it is to act rebelliously after having faith! And whoever does not repent, it is they who are the &#761;true&#762; wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "12",
    "Text": "O &nbsp;believers! Avoid many suspicions, &#761;for&#762; indeed, some suspicions are sinful. And do not spy, nor backbite one another. Would any of you like to eat the flesh of their dead brother? You would despise that!<span class='fn' foot_note=29858>1</span>&nbsp;And fear Allah. Surely Allah is &#761;the&#762; Accepter of Repentance, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "13",
    "Text": "O humanity! Indeed, We created you from a male and a female, and made you into peoples and tribes so that you may &#761;get to&#762; know one another. Surely the most noble of you in the sight of Allah is the most righteous among you. Allah is truly All-Knowing, All-Aware.<span class='fn' foot_note=29859>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "14",
    "Text": "&#761;Some of&#762; the nomadic Arabs say, &ldquo;We believe.&rdquo; Say, &#761;O Prophet,&#762; &ldquo;You have not believed. But say, &lsquo;We have submitted,&rsquo; for faith has not yet entered your hearts.<span class='fn' foot_note=29860>1</span>&nbsp;But if you obey Allah and His Messenger &#761;wholeheartedly&#762;, He will not discount anything from &#761;the reward of&#762; your deeds. Allah is truly All-Forgiving, Most Merciful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "15",
    "Text": "The &#761;true&#762; believers are only those who believe in Allah and His Messenger&mdash;never doubting&mdash;and strive with their wealth and their lives in the cause of Allah. They are the ones true in faith."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "16",
    "Text": "Say, &ldquo;Do you inform Allah of your faith, when Allah &#761;already&#762; knows whatever is in the heavens and whatever is on the earth? And Allah has &#761;perfect&#762; knowledge of all things.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "17",
    "Text": "They regard their acceptance of Islam as a favour to you. Tell &#761;them, O &nbsp;Prophet&#762;, &ldquo;Do not regard your Islam as a favour to me. Rather, it is Allah Who has done you a favour by guiding you to the faith, if &#761;indeed&#762; you are faithful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "49",
    "AyahNumber": "18",
    "Text": "Surely Allah knows the unseen of the heavens and earth. And Allah is All-Seeing of what you do.&rdquo;"
  }
]
