[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "46",
        "bookName": "Book of Divine Decree",
        "bookNameArabic": "كتاب القدر",
        "hadiths": [
            {
                "hadithNo": "6723",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Abdullah said: \"The Messenger of Allah (s.a.w) - and he is the truthful, the one who is believed - told us: 'The creation of any one of you is put together in his mother's womb for forty days, then, he is during that (period) an 'Alaqah for a similar period. Then he becomes a Mudghah for a similar period. Then Allah sends to him an angel who breathes the soul into him, and is enjoined to write down four things: His provision, his lifespan, his deeds and his misery or happiness. By the One besides Whom none has the right lobe worshiped! One of you may do the deeds of the people of Paradise until there is nothing between him and it but a cubit, then the Decree overtakes him and he does the deeds of the people of the Fire and enters it. And one of you may do the deeds of the people of the Fire until there is nothing between him and it but a cubit, then the Decree overtakes him and he does the deeds of the people of Paradise, and enters it.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا أَبُو مُعَاوِيَةَ ، وَوَكِيعٌ (ح) وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ ، وَاللَّفْظُ لَهُ ، حَدَّثَنَا أَبِي ، وَأَبُو مُعَاوِيَةَ ، وَوَكِيعٌ ، قَالُوا: حَدَّثَنَا الأَعْمَشُ ، عَنْ زَيْدِ بْنِ وَهْبٍ ، عَنْ عَبْدِ اللهِ ، قَالَ: حَدَّثَنَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ الصَّادِقُ الْمَصْدُوقُ إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا ، ثُمَّ يَكُونُ فِي ذَلِكَ عَلَقَةً مِثْلَ ذَلِكَ ، ثُمَّ يَكُونُ فِي ذَلِكَ مُضْغَةً مِثْلَ ذَلِكَ ، ثُمَّ يُرْسَلُ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ ، وَأَجَلِهِ ، وَعَمَلِهِ ، وَشَقِيٌّ ، أَوْ سَعِيدٌ ، فَوَالَّذِي لاَ إِلَهَ غَيْرُهُ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ ، فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ ، فَيَدْخُلُهَا ، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ ، حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ ، فَيَسْبِقُ عَلَيْهِ الْكِتَابُ ، فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ ، فَيَدْخُلُهَا."
            },
            {
                "hadithNo": "6724",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Al-A'mash with this chain of narrators (a Hadith similar to no. 6723). In the Hadith of Waki' it says: \"The creation of any one of you is put together in his mother's womb for forty nights.\" In the Hadith of Mu'adh from Shu'bah it says: \"Forty nights or forty days.\" In the Hadith of Jarir and 'Eisa it says: \"Forty days.\"",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ ، كِلاَهُمَا عَنْ جَرِيرِ بْنِ عَبْدِ الْحَمِيدِ (ح) وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ (ح) وحَدَّثَنِي أَبُو سَعِيدٍ الأَشَجُّ ، حَدَّثَنَا وَكِيعٌ (ح) وَحَدَّثَنَاهُ عُبَيْدُ اللهِ بْنُ مُعَاذٍ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ ، كُلُّهُمْ عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ. قَالَ فِي حَدِيثِ وَكِيعٍ: إِنَّ خَلْقَ أَحَدِكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ لَيْلَةً. وقَالَ فِي حَدِيثِ مُعَاذٍ ، عَنْ شُعْبَةَ : أَرْبَعِينَ لَيْلَةً أَرْبَعِينَ يَوْمًا. وَأَمَّا فِي حَدِيثِ جَرِيرٍ وَعِيسَى : أَرْبَعِينَ يَوْمًا."
            },
            {
                "hadithNo": "6725",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Hudhaifah bin Asid that the Prophet (s.a.w) said: \"The angel enters upon the Nutfah (sperm drop) after it has settled in the womb for forty or forty-five nights, and he says: 'O Lord, miserable or happy?' And they are written down. Then he says: 'O Lord, male or female?' And they are written down. And he writes down his deeds, what he will leave behind, lifespan and provisions, then the scroll is rolled up, and nothing is added or taken away there from.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ ، وَزُهَيْرُ بْنُ حَرْبٍ ، وَاللَّفْظُ لاِبْنِ نُمَيْرٍ ، قَالاَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ، عَنْ عَمْرِو بْنِ دِينَارٍ ، عَنْ أَبِي الطُّفَيْلِ ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ ، يَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: يَدْخُلُ الْمَلَكُ عَلَى النُّطْفَةِ بَعْدَ مَا تَسْتَقِرُّ فِي الرَّحِمِ بِأَرْبَعِينَ ، أَوْ خَمْسَةٍ وَأَرْبَعِينَ لَيْلَةً ، فَيَقُولُ: يَا رَبِّ أَشَقِيٌّ ، أَوْ سَعِيدٌ ؟ فَيُكْتَبَانِ ، فَيَقُولُ: أَيْ رَبِّ أَذَكَرٌ ، أَوْ أُنْثَى ؟ فَيُكْتَبَانِ ، وَيُكْتَبُ عَمَلُهُ وَأَثَرُهُ وَأَجَلُهُ وَرِزْقُهُ ، ثُمَّ تُطْوَى الصُّحُفُ ، فَلاَ يُزَادُ فِيهَا وَلاَ يُنْقَصُ."
            },
            {
                "hadithNo": "6726",
                "chapterNo": "1",
                "hadithEnglish": "'Amir bin Wathilah narrated that he heard 'Abdullah bin Mas'ud say (explaining the Hadith no. 6725) : \"The miserable one is the one who is miserable in his mother's womb, and the happy one is the one who learns lessons from (the end of) others.\" He ('Amir bin Wathilah) went to a man among the Companions of the Messenger of Allah (s.a.w) who was called Hudhaifah bin Asid Al-Ghifari, and told him what Ibn Mas'ud had said and asked: \"How can a man (Hudhaifah) be in a state of misery without having done anything?\" The man said to him: \"Are you surprised by that? I heard the Messenger of Allah (s.a.w) say: 'When forty-two nights have passed for the Nutfah (sperm drop), Allah sends an angel to it, and he gives it its shape and creates its hearing, sight, skin, flesh and bones. Then he says: 'O Lord, male or female?' Your Lord decrees whatever He wills, and the angel writes it down. Then he says: 'O Lord, his lifespan?' Your Lord says whatever He wills, and the angel writes it down. Then he says: 'O Lord, his provision?' Your Lord decrees whatever He wills, and the angel writes it down. Then the angel departs with the page in his hand, and he does not add or take away anything. therefrom\"",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ ، أَخْبَرَنَا ابْنُ وَهْبٍ ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ ، أَنَّ عَامِرَ بْنَ وَاثِلَةَ ، حَدَّثَهُ أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ مَسْعُودٍ ، يَقُولُ : الشَّقِيُّ مَنْ شَقِيَ فِي بَطْنِ أُمِّهِ وَالسَّعِيدُ مَنْ وُعِظَ بِغَيْرِهِ ، فَأَتَى رَجُلاً مِنْ أَصْحَابِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ : حُذَيْفَةُ بْنُ أَسِيدٍ الْغِفَارِيُّ ، فَحَدَّثَهُ بِذَلِكَ مِنْ قَوْلِ ابْنِ مَسْعُودٍ فَقَالَ : وَكَيْفَ يَشْقَى رَجُلٌ بِغَيْرِ عَمَلٍ ؟ فَقَالَ لَهُ الرَّجُلُ : أَتَعْجَبُ مِنْ ذَلِكَ ؟ فَإِنِّي سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، يَقُولُ : إِذَا مَرَّ بِالنُّطْفَةِ ثِنْتَانِ وَأَرْبَعُونَ لَيْلَةً ، بَعَثَ اللَّهُ إِلَيْهَا مَلَكًا ، فَصَوَّرَهَا وَخَلَقَ سَمْعَهَا وَبَصَرَهَا وَجِلْدَهَا وَلَحْمَهَا وَعِظَامَهَا ، ثُمَّ قَالَ : يَا رَبِّ أَذَكَرٌ أَمْ أُنْثَى ؟ فَيَقْضِي رَبُّكَ مَا شَاءَ ، وَيَكْتُبُ الْمَلَكُ ، ثُمَّ يَقُولُ : يَا رَبِّ أَجَلُهُ ، فَيَقُولُ رَبُّكَ مَا شَاءَ ، وَيَكْتُبُ الْمَلَكُ ، ثُمَّ يَقُولُ : يَا رَبِّ رِزْقُهُ ، فَيَقْضِي رَبُّكَ مَا شَاءَ ، وَيَكْتُبُ الْمَلَكُ ، ثُمَّ يَخْرُجُ الْمَلَكُ بِالصَّحِيفَةِ فِي يَدِهِ ، فَلاَ يَزِيدُ عَلَى مَا أُمِرَ وَلاَ يَنْقُصُ."
            },
            {
                "hadithNo": "6727",
                "chapterNo": "1",
                "hadithEnglish": "Abu At-Tufail narrated that 'Abdullah bin Mas'ud said ..., and he quoted a Hadith like that of 'Amr bin Al-Harith (no.6726).",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ ، أَخْبَرَنَا أَبُو عَاصِمٍ ، حَدَّثَنَا ابْنُ جُرَيْجٍ ، أَخْبَرَنِي أَبُو الزُّبَيْرِ ، أَنَّ أَبَا الطُّفَيْلِ ، أَخْبَرَهُ أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ مَسْعُودٍ يَقُولُ: وَسَاقَ الْحَدِيثَ ، بِمِثْلِ حَدِيثِ عَمْرِو بْنِ الْحَارِثِ."
            },
            {
                "hadithNo": "6728",
                "chapterNo": "1",
                "hadithEnglish": "Abu At-Tufail said: I entered upon Abu Sarihah Hudhaifah bin Asid Al-Ghifari, and he said: I heard the Messenger of Allah (s.a.w) with these two ears of mine, saying: \"The Nutfah (sperm drop) stays in the womb for forty nights, then the angel comes down to it.\"- Zuhair (one of the narrators) said: \"I think he said: 'The one who shapes it.\"' - \"He says: 'O Lord, male or female?' And Allah makes it male or female. Then he says: 'O Lord, physically sound or unsound?' And Allah makes him physically sound or unsound. Then he says: 'O Lord, what is his provision?' What is his lifespan? 'Then Allah makes him doomed or blessed.\"'",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ ، حَدَّثَنَا زُهَيْرٌ أَبُو خَيْثَمَةَ ، حَدَّثَنِي عَبْدُ اللهِ بْنُ عَطَاءٍ ، أَنَّ عِكْرِمَةَ بْنَ خَالِدٍ ، حَدَّثَهُ أَنَّ أَبَا الطُّفَيْلِ حَدَّثَهُ ، قَالَ : دَخَلْتُ عَلَى أَبِي سَرِيحَةَ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ ، فَقَالَ : سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأُذُنَيَّ هَاتَيْنِ ، يَقُولُ : إِنَّ النُّطْفَةَ تَقَعُ فِي الرَّحِمِ أَرْبَعِينَ لَيْلَةً ، ثُمَّ يَتَصَوَّرُ عَلَيْهَا الْمَلَكُ قَالَ زُهَيْرٌ : حَسِبْتُهُ قَالَ الَّذِي يَخْلُقُهَا فَيَقُولُ : يَا رَبِّ أَذَكَرٌ ، أَوْ أُنْثَى ، فَيَجْعَلُهُ اللَّهُ ذَكَرًا ، أَوْ أُنْثَى ، ثُمَّ يَقُولُ : يَا رَبِّ أَسَوِيٌّ ، أَوْ غَيْرُ سَوِيٍّ ، فَيَجْعَلُهُ اللَّهُ سَوِيًّا ، أَوْ غَيْرَ سَوِيٍّ ، ثُمَّ يَقُولُ : يَا رَبِّ مَا رِزْقُهُ مَا أَجَلُهُ مَا خُلُقُهُ ، ثُمَّ يَجْعَلُهُ اللَّهُ شَقِيًّا ، أَوْ سَعِيدًا."
            },
            {
                "hadithNo": "6729",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Hudhaifah bin Asid Al-Ghifari, the Companion of the Prophet (s.a.w) ' who attributed the Hadith to the Messenger of Allah (s.a.w): \"An angel is appointed over the womb, and when Allah wants to create anything by His leave, after forty-odd nights ... \" then he mentioned a similar Hadith (as no. 6728).",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ ، حَدَّثَنِي أَبِي ، حَدَّثَنَا رَبِيعَةُ بْنُ كُلْثُومٍ ، حَدَّثَنِي أَبِي كُلْثُومٌ ، عَنْ أَبِي الطُّفَيْلِ ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ صَاحِبِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، رَفَعَ الْحَدِيثَ إِلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ مَلَكًا مُوَكَّلاً بِالرَّحِمِ ، إِذَا أَرَادَ اللَّهُ أَنْ يَخْلُقَ شَيْئًا بِإِذْنِ اللهِ ، لِبِضْعٍ وَأَرْبَعِينَ لَيْلَةً ... ، ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ."
            },
            {
                "hadithNo": "6730",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Anas bin. Malik that the Prophet (s.a.w) said: \"Allah, Glorified and Exalted is He, has appointed an angel over the womb, and he says: 'O Lord, a Nutfah (sperm drop); O lord, an 'Alaqah; O Lord, a Mudghah.' Then when Allah wants to decree the (final stage of) his creation, the angel says: 'O Lord, male or female? Miserable or happy? What is his provision? What is his lifespan?' And that is written in the womb of his mother.\"",
                "hadithArabic": "حَدَّثَنِي أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ أَبِي بَكْرٍ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، وَرَفَعَ الْحَدِيثَ ، أَنَّهُ قَالَ: إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ وَكَّلَ بِالرَّحِمِ مَلَكًا ، فَيَقُولُ : أَيْ رَبِّ نُطْفَةٌ ، أَيْ رَبِّ عَلَقَةٌ ، أَيْ رَبِّ مُضْغَةٌ ، فَإِذَا أَرَادَ اللَّهُ أَنْ يَقْضِيَ خَلْقًا قَالَ: قَالَ الْمَلَكُ: أَيْ رَبِّ ذَكَرٌ ، أَوْ أُنْثَى ؟ شَقِيٌّ ، أَوْ سَعِيدٌ ؟ فَمَا الرِّزْقُ ؟ فَمَا الأَجَلُ ؟ فَيُكْتَبُ كَذَلِكَ فِي بَطْنِ أُمِّهِ."
            },
            {
                "hadithNo": "6731",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Ali said: \"We were at a funeral in Baqi' Al-Gharqad, and the Messenger of Allah (s.a.w) came to us. He sat down and we sat down around him. He had a stick, and he looked down at the ground, and started to scratch the ground with the stick, then he said: 'There is no one among you, no living soul, but Allah has decreed his place in Paradise or the Fire, and it has been decreed whether he is miserable or happy.' A man said: 'O Messenger of Allah, shouldn't we rely on our destiny and stop striving?' He said: 'Whoever is one of the happy, he will find himself doing the deeds of the happy, and whoever is one of the miserable, he will find himself doing the deeds of them miserable.' He (s.a.w) said: 'Do good deeds, for everyone is helped (to do their deeds). The happy are helped to do the deeds of the happy, and the miserable are helped to do the deeds of the miserable.' Then he recited: 'As for him who gives (in charity) and keeps his duty to Allah and fears Him, and believes in Al-Husna; We will make smooth for him the path of ease (goodness). But he who is greedy miser and thinks himself self sufficient and belies Al-Husna, We will make smooth for him the path for evil.\"'",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ ، وَزُهَيْرُ بْنُ حَرْبٍ ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ ، وَاللَّفْظُ لِزُهَيْرٍ ، قَالَ إِسْحَاقُ: أَخْبَرَنَا ، وقَالَ الآخَرَانِ: حَدَّثَنَا ، جَرِيرٌ ، عَنْ مَنْصُورٍ ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ ، عَنْ عَلِيٍّ ، قَالَ: كُنَّا فِي جَِنَازَةٍ فِي بَقِيعِ الْغَرْقَدِ ، فَأَتَانَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَعَدَ وَقَعَدْنَا حَوْلَهُ ، وَمَعَهُ مِخْصَرَةٌ فَنَكَّسَ فَجَعَلَ يَنْكُتُ بِمِخْصَرَتِهِ ، ثُمَّ قَالَ: مَا مِنْكُمْ مِنْ أَحَدٍ ، مَا مِنْ نَفْسٍ مَنْفُوسَةٍ ، إِلاَّ وَقَدْ كَتَبَ اللَّهُ مَكَانَهَا مِنَ الْجَنَّةِ وَالنَّارِ ، وَإِلاَّ وَقَدْ كُتِبَتْ شَقِيَّةً ، أَوْ سَعِيدَةً ، قَالَ فَقَالَ رَجَلٌ: يَا رَسُولَ اللهِ ، أَفَلاَ نَمْكُثُ عَلَى كِتَابِنَا ، وَنَدَعُ الْعَمَلَ ؟ فَقَالَ : مَنْ كَانَ مِنْ أَهْلِ السَّعَادَةِ ، فَسَيَصِيرُ إِلَى عَمَلِ أَهْلِ السَّعَادَةِ ، وَمَنْ كَانَ مِنْ أَهْلِ الشَّقَاوَةِ ، فَسَيَصِيرُ إِلَى عَمَلِ أَهْلِ الشَّقَاوَةِ فَقَالَ : اعْمَلُوا فَكُلٌّ مُيَسَّرٌ ، أَمَّا أَهْلُ السَّعَادَةِ فَيُيَسَّرُونَ لِعَمَلِ أَهْلِ السَّعَادَةِ ، وَأَمَّا أَهْلُ الشَّقَاوَةِ فَيُيَسَّرُونَ لِعَمَلِ أَهْلِ الشَّقَاوَةِ ، ثُمَّ قَرَأَ: {فَأَمَّا مَنْ أَعْطَى وَاتَّقَى ، وَصَدَّقَ بِالْحُسْنَى ، فَسَنُيَسِّرُهُ لِلْيُسْرَى ، وَأَمَّا مَنْ بَخِلَ وَاسْتَغْنَى ، وَكَذَّبَ بِالْحُسْنَى فَسَنُيَسِّرُهُ لِلْعُسْرَى}."
            },
            {
                "hadithNo": "6732",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as Hadith no. 6731) was narrated from Mansur with this chain of narrators.",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَهَنَّادُ بْنُ السَّرِيِّ ، قَالاَ: حَدَّثَنَا أَبُو الأَحْوَصِ ، عَنْ مَنْصُورٍ ، بِهَذَا الإِسْنَادِ فِي مَعْنَاهُ. وَقَالَ فَأَخَذَ عُودًا ، وَلَمْ يَقُلْ: مِخْصَرَةً. وَقَالَ ابْنُ أَبِي شَيْبَةَ فِي حَدِيثِهِ ، عَنْ أَبِي الأَحْوَصِ ، ثُمَّ قَرَأَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
            },
            {
                "hadithNo": "6733",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Ali said: \"One day the Messenger of Allah (s.a.w) was sitting with a stick in his hand, with which he was scratching the ground. He raised his head and said: 'There is no soul among you but his place in Paradise or the Fire is known.' They said: 'O Messenger of Allah, (if it is so, then) why should we strive? Should we not rely on that?' He said: 'No, keep striving, for everyone will be helped to do that for which he was created.' Then he (s.a.w) recited: As for him who gives (in charity) and keeps his duty to Allah and fears Him, and believes in Al-Husna', up to II is saying: We will make smooth for him the path for evil.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَزُهَيْرُ بْنُ حَرْبٍ ، وَأَبُو سَعِيدٍ الأَشَجُّ ، قَالُوا : حَدَّثَنَا وَكِيعٌ (ح) وَحَدَّثَنَا ابْنُ نُمَيْرٍ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا الأَعْمَشُ (ح) وَحَدَّثَنَا أَبُو كُرَيْبٍ ، وَاللَّفْظُ لَهُ ، حَدَّثَنَا أَبُو مُعَاوِيَةَ ، حَدَّثَنَا الأَعْمَشُ ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ ، عَنْ عَلِيٍّ ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ذَاتَ يَوْمٍ جَالِسًا وَفِي يَدِهِ عُودٌ يَنْكُتُ بِهِ ، فَرَفَعَ رَأْسَهُ فَقَالَ: مَا مِنْكُمْ مِنْ نَفْسٍ إِلاَّ وَقَدْ عُلِمَ مَنْزِلُهَا مِنَ الْجَنَّةِ وَالنَّارِ قَالُوا: يَا رَسُولَ اللهِ ، فَلِمَ نَعْمَلُ ؟ أَفَلاَ نَتَّكِلُ ؟ قَالَ: لاَ ، اعْمَلُوا ، فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ ثُمَّ قَرَأَ : {فَأَمَّا مَنْ أَعْطَى وَاتَّقَى ، وَصَدَّقَ بِالْحُسْنَى} ، إِلَى قَوْلِهِ {فَسَنُيَسِّرُهُ لِلْعُسْرَى}."
            },
            {
                "hadithNo": "6734",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as Hadith no. 6733) was narrated from 'Ali, from the Prophet (s.a.w) with this chain of narrators.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، وَابْنُ بَشَّارٍ ، قَالاَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ مَنْصُورٍ ، وَالأَعْمَشِ أَنَّهُمَا سَمِعَا سَعْدَ بْنَ عُبَيْدَةَ يُحَدِّثُهُ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ ، عَنْ عَلِيٍّ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ."
            },
            {
                "hadithNo": "6735",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Jabir said: \"Suraqah bin Malik bin Ju'sham said: 'O Messenger of Allah, explain our religion to us as if we had been created just now. What about the deeds that we do day-to-day? Are they because the pens have dried and they are happening as they have already been decreed, or what we are to do?' He (s.a.w) said: 'No, it is because the pens have dried and they are happening as they have already been decreed.' He said: 'Then why should we strive?\"' Zuhair (a sub narrator) said: \"Then Abu Az-Zubair (a narrator) said something that I did not understand, and I asked: 'What did he say?' He said: 'Strive, for everyone is helped.\"'",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ ، حَدَّثَنَا زُهَيْرٌ ، حَدَّثَنَا أَبُو الزُّبَيْرِ (ح) وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا أَبُو خَيْثَمَةَ ، عَنْ أَبِي الزُّبَيْرِ ، عَنْ جَابِرٍ ، قَالَ : جَاءَ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ قَالَ : يَا رَسُولَ اللهِ ، بَيِّنْ لَنَا دِينَنَا كَأَنَّا خُلِقْنَا الآنَ ، فِيمَا الْعَمَلُ الْيَوْمَ ؟ أَفِيمَا جَفَّتْ بِهِ الأَقْلاَمُ ، وَجَرَتْ بِهِ الْمَقَادِيرُ ، أَمْ فِيمَا نَسْتَقْبِلُ ؟ قَالَ : لاَ ، بَلْ فِيمَا جَفَّتْ بِهِ الأَقْلاَمُ وَجَرَتْ بِهِ الْمَقَادِيرُ قَالَ : فَفِيمَ الْعَمَلُ ؟. قَالَ زُهَيْرٌ : ثُمَّ تَكَلَّمَ أَبُو الزُّبَيْرِ بِشَيْءٍ لَمْ أَفْهَمْهُ ، فَسَأَلْتُ : مَا قَالَ ؟ فَقَالَ : اعْمَلُوا فَكُلٌّ مُيَسَّرٌ."
            },
            {
                "hadithNo": "6736",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as Hadith no. 6735) was narrated from Jabir bin 'Abdullah from the Prophet (s.a.w) and in it he said: \"Everyone who strives will be helped to do his deeds (that were decreed for him).\"",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ ، أَخْبَرَنَا ابْنُ وَهْبٍ ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ ، عَنْ أَبِي الزُّبَيْرِ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، بِهَذَا الْمَعْنَى. وَفِيهِ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كُلُّ عَامِلٍ مُيَسَّرٌ لِعَمَلِهِ."
            },
            {
                "hadithNo": "6737",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Imran bin Husain said: \"It was said: 'O Messenger of Allah, is it known who are the people of Paradise and who are the people of the Fire?' He said: 'Yes.' It was said: 'Then why should people strive?' He said: 'Everyone is helped to do that for which he was created.\"'",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ يَزِيدَ الضُّبَعِيِّ ، حَدَّثَنَا مُطَرِّفٌ ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ ، قَالَ: قِيلَ: يَا رَسُولَ اللهِ ، أَعُلِمَ أَهْلُ الْجَنَّةِ مَنْ أَهْلِ النَّارِ ؟ قَالَ: فَقَالَ: نَعَمْ ، قَالَ قِيلَ : فَفِيمَ يَعْمَلُ الْعَامِلُونَ ؟ قَالَ: كُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ."
            },
            {
                "hadithNo": "6738",
                "chapterNo": "1",
                "hadithEnglish": "A Hadith like that of Hammad (no. 6737) was narrated from Yazid Ar-Rishk with this chain of narrators. In the Hadith of 'Abdul-Warith it says: \"I said: 'O Messenger of Allah.\"'",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ ، حَدَّثَنَا عَبْدُ الْوَارِثِ (ح) وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ نُمَيْرٍ ، عَنِ ابْنِ عُلَيَّةَ (ح) وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ (ح) وَحَدَّثَنَا ابْنُ الْمُثَنَّى ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، كُلُّهُمْ عَنْ يَزِيدَ الرِّشْكِ ، فِي هَذَا الإِسْنَادِ ، بِمَعْنَى حَدِيثِ حَمَّادٍ ، وَفِي حَدِيثِ عَبْدِ الْوَارِثِ ، قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ."
            },
            {
                "hadithNo": "6739",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Abul-Aswad Ad-Daili said: \"Imran bin Al-Husain said to me: 'What do you think about what people are working and striving for today - is it something that has been previously decreed and decided for them, or, is it connected to that which their Prophet (s.a.w) brought to them so that proof may he established against them?' \"I said: 'It is something that has been previously decreed and decided for them.' He said: 'Wouldn't that be an injustice?' I was greatly disturbed by that, and I said: 'Everything is created by Allah and belongs to Him; He is not to be questioned about what He does, but they will be questioned.'\r\n\"He said to me: 'May Allah have mercy on you. I only asked you that in order to test your intelligence. Two men from Muzainah came to the Messenger of Allah (s.a.w) and said: \"O Messenger of Allah, what do you think about what people are working and striving for today - is it something that has been previously decreed and decided for them or it is connected to that which their Prophet (s.a.w) brought to them so that proof may be established against them?\" ''He ((s.a.w)) said: 'No, it is something that has been previously decreed and decided for them, and the confirmation of that is in the Book of Allah (the Mighty and Sublime): \"By Nafs (Adam or a person or a soul), and Him Who perfected him in proportion; then He showed him what is wrong for him and what is right for him.'\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ ، عَنْ يَحْيَى بْنِ عُقَيْلٍ ، عَنْ يَحْيَى بْنِ يَعْمَُرَ ، عَنْ أَبِي الأَسْوَدِ الدِّيلِيِّ ، قَالَ: قَالَ لِي عِمْرَانُ بْنُ الْحُصَيْنِ ، أَرَأَيْتَ مَا يَعْمَلُ النَّاسُ الْيَوْمَ وَيَكْدَحُونَ فِيهِ ، أَشَيْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى عَلَيْهِمْ مِنْ قَدَرِ مَا سَبَقَ ؟ ، أَوْ فِيمَا يُسْتَقْبَلُونَ بِهِ مِمَّا أَتَاهُمْ بِهِ نَبِيُّهُمْ ، وَثَبَتَتِ الْحُجَّةُ عَلَيْهِمْ ؟ فَقُلْتُ: بَلْ شَيْءٌ قُضِيَ عَلَيْهِمْ ، وَمَضَى عَلَيْهِمْ ، قَالَ فَقَالَ : أَفَلاَ يَكُونُ ظُلْمًا ؟ قَالَ : فَفَزِعْتُ مِنْ ذَلِكَ فَزَعًا شَدِيدًا ، وَقُلْتُ : كُلُّ شَيْءٍ خَلْقُ اللهِ وَمِلْكُ يَدِهِ ، فَلاَ يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ ، فَقَالَ لِي : يَرْحَمُكَ اللَّهُ إِنِّي لَمْ أُرِدْ بِمَا سَأَلْتُكَ إِلاَّ لأَحْزِرَ عَقْلَكَ ، إِنَّ رَجُلَيْنِ مِنْ مُزَيْنَةَ أَتَيَا رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالاَ: يَا رَسُولَ اللهِ ، أَرَأَيْتَ مَا يَعْمَلُ النَّاسُ الْيَوْمَ ، وَيَكْدَحُونَ فِيهِ ، أَشَيْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى فِيهِمْ مِنْ قَدَرٍ قَدْ سَبَقَ ، أَوْ فِيمَا يُسْتَقْبَلُونَ بِهِ مِمَّا أَتَاهُمْ بِهِ نَبِيُّهُمْ ، وَثَبَتَتِ الْحُجَّةُ عَلَيْهِمْ ؟ فَقَالَ: لاَ ، بَلْ شَيْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى فِيهِمْ ، وَتَصْدِيقُ ذَلِكَ فِي كِتَابِ اللهِ عَزَّ وَجَلَّ: وَنَفْسٍ وَمَا سَوَّاهَا فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا."
            },
            {
                "hadithNo": "6740",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"A man may do the deeds of the people of Paradise for a long time, then his deeds end with one of the deeds of the people of the Fire, and a man may do the deeds of the people of the Fire for a long time, then his deeds end with one of the deeds of the people of Paradise.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا عَبْدُ الْعَزِيزِ ، يَعْنِي ابْنَ مُحَمَّدٍ ، عَنِ الْعَلاَءِ ، عَنْ أَبِيهِ ، عَنْ أَبِي هُرَيْرَةَ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، قَالَ: إِنَّ الرَّجُلَ لَيَعْمَلُ الزَّمَنَ الطَّوِيلَ بِعَمَلِ أَهْلِ الْجَنَّةِ ، ثُمَّ يُخْتَمُ لَهُ عَمَلُهُ بِعَمَلِ أَهْلِ النَّارِ ، وَإِنَّ الرَّجُلَ لَيَعْمَلُ الزَّمَنَ الطَّوِيلَ بِعَمَلِ أَهْلِ النَّارِ ، ثُمَّ يُخْتَمُ لَهُ عَمَلُهُ بِعَمَلِ أَهْلِ الْجَنَّةِ."
            },
            {
                "hadithNo": "6741",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Sahl bin Sa'd As-Sa'idi that the Messenger of Allah (s.a.w) said: \"A man may do the deeds of the people of Paradise, or so it may seem to the people, although he is one of the people of the Fire. And a man may do the deeds of (the people of) the Fire, or so it seems to the people, although he is one of the people of Paradise.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا يَعْقُوبُ ، يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ ، عَنْ أَبِي حَازِمٍ ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: إِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ الْجَنَّةِ ، فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ النَّارِ ، وَإِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ النَّارِ ، فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ الْجَنَّةِ."
            },
            {
                "hadithNo": "6742",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated by Tawus that he heard Abu Hurairah say: The Messenger of Allah (s.a.w) said: \"Adam and Musa debated. Musa said: 'O Adam, you are our father, but you caused our doom and caused us to be expelled from Paradise.' Adam said to him: 'You are Musa, Allah chose you to speak to and wrote (the Tawrah) for you with His Own Rand. Are you blaming me for something that Allah decreed for me forty years before He created me?' The Prophet (s.a.w) said: 'Adam got the better of -Musa, Adam got the better of Musa.'\"",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ ، وَإِبْرَاهِيمُ بْنُ دِينَارٍ ، وَابْنُ أَبِي عُمَرَ الْمَكِّيُّ ، وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ جَمِيعًا ، عَنِ ابْنِ عُيَيْنَةَ ، وَاللَّفْظُ لاِبْنِ حَاتِمٍ وَابْنِ دِينَارٍ ، قَالاَ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ، عَنْ عَمْرٍو ، عَنْ طَاوُوسٍ ، قَالَ: سَمِعْتُ أَبَا هُرَيْرَةَ ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: احْتَجَّ آدَمُ وَمُوسَى ، فَقَالَ مُوسَى: يَا آدَمُ أَنْتَ أَبُونَا خَيَّبْتَنَا وَأَخْرَجْتَنَا مِنَ الْجَنَّةِ ، فَقَالَ لَهُ آدَمُ: أَنْتَ مُوسَى ، اصْطَفَاكَ اللَّهُ بِكَلاَمِهِ ، وَخَطَّ لَكَ بِيَدِهِ ، أَتَلُومُنِي عَلَى أَمْرٍ قَدَّرَهُ اللَّهُ عَلَيَّ قَبْلَ أَنْ يَخْلُقَنِي بِأَرْبَعِينَ سَنَةً ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : فَحَجَّ آدَمُ مُوسَى ، فَحَجَّ آدَمُ مُوسَى. وَفِي حَدِيثِ ابْنِ أَبِي عُمَرَ وَابْنِ عَبْدَةَ ، قَالَ أَحَدُهُمَا: خَطَّ ، وقَالَ الآخَرُ: كَتَبَ لَكَ التَّوْرَاةَ بِيَدِهِ."
            },
            {
                "hadithNo": "6743",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"Adam and Musa debated, and Adam got the better of Musa. Musa said to him: 'You are Adam who caused the people to be misguided and caused them to be expelled from Paradise?' Adam said: 'You are the one to whom Allah gave knowledge of all things and chose him above all the people to convey His Message.?' He said: 'Yes.' He (i.e., Adam) said: 'Are you blaming me for something that Allah decreed for me before I was created?\"'",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، عَنْ مَالِكِ بْنِ أَنَسٍ ، فِيمَا قُرِئَ عَلَيْهِ عَنْ أَبِي الزِّنَادِ ، عَنِ الأَعْرَجِ ، عَنْ أَبِي هُرَيْرَةَ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : تَحَاجَّ آدَمُ وَمُوسَى ، فَحَجَّ آدَمُ مُوسَى ، فَقَالَ لَهُ مُوسَى: أَنْتَ آدَمُ الَّذِي أَغْوَيْتَ النَّاسَ وَأَخْرَجْتَهُمْ مِنَ الْجَنَّةِ ، فَقَالَ آدَمُ: أَنْتَ الَّذِي أَعْطَاهُ اللَّهُ عِلْمَ كُلِّ شَيْءٍ وَاصْطَفَاهُ عَلَى النَّاسِ بِرِسَالَتِهِ ؟ قَالَ: نَعَمْ ، قَالَ: فَتَلُومُنِي عَلَى أَمْرٍ قُدِّرَ عَلَيَّ قَبْلَ أَنْ أُخْلَقَ ؟."
            },
            {
                "hadithNo": "6744",
                "chapterNo": "2",
                "hadithEnglish": "Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Adam and Musa debated in the presence of their Lord, and Adam got the better of Musa. Musa said: \"You are Adam whom Allah created with His Own Hand and breathed into you of His spirit, and commanded the angels to prostrate to you, and caused you to dwell in Paradise. Then because of your lapse you caused the people to be sent down to the earth.\" Adam, said: \"You are Musa whom Allah chose by means of His Message, and by means of speaking to you, and He gave you the Tablets on which was the explanation of all things, and brought you close to speak with you. How long before I was created did Allah write the Tawrah?\" Musa said: \"Forty years.\" Adam said: \"And did you find in it (the words): Thus did Adam disobey his Lord, so he went astray.? He said: \"Yes.\" He said: \"Are you blaming me for doing a deed which Allah decreed I would do, forty years before He created me?\" The Messenger of Allah (s.a.w) said: 'Thus Adam got the better of Musa.\"'",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى بْنِ عَبْدِ اللهِ بْنِ مُوسَى بْنِ عَبْدِ اللهِ بْنِ يَزِيدَ الأَنْصَارِيِّ ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ ، حَدَّثَنِي الْحَارِثُ بْنُ أَبِي ذُبَابٍ ، عَنْ يَزِيدَ ، وَهُوَ ابْنُ هُرْمُزَ وَعَبْدِ الرَّحْمَنِ الأَعْرَجِ ، قَالاَ : سَمِعْنَا أَبَا هُرَيْرَةَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : احْتَجَّ آدَمُ وَمُوسَى عَلَيْهِمَا السَّلاَمُ عِنْدَ رَبِّهِمَا ، فَحَجَّ آدَمُ مُوسَى ، قَالَ مُوسَى : أَنْتَ آدَمُ الَّذِي خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ ، وَأَسْجَدَ لَكَ مَلاَئِكَتَهُ ، وَأَسْكَنَكَ فِي جَنَّتِهِ ، ثُمَّ أَهْبَطْتَ النَّاسَ بِخَطِيئَتِكَ إِلَى الأَرْضِ ، فَقَالَ آدَمُ : أَنْتَ مُوسَى الَّذِي اصْطَفَاكَ اللَّهُ بِرِسَالَتِهِ وَبِكَلاَمِهِ وَأَعْطَاكَ الأَلْوَاحَ فِيهَا تِبْيَانُ كُلِّ شَيْءٍ وَقَرَّبَكَ نَجِيًّا ، فَبِكَمْ وَجَدْتَ اللَّهَ كَتَبَ التَّوْرَاةَ قَبْلَ أَنْ أُخْلَقَ ، قَالَ مُوسَى : بِأَرْبَعِينَ عَامًا ، قَالَ آدَمُ: فَهَلْ وَجَدْتَ فِيهَا وَعَصَى آدَمُ رَبَّهُ فَغَوَى ، قَالَ : نَعَمْ ، قَالَ: أَفَتَلُومُنِي عَلَى أَنْ عَمِلْتُ عَمَلاً كَتَبَهُ اللَّهُ عَلَيَّ أَنْ أَعْمَلَهُ قَبْلَ أَنْ يَخْلُقَنِي بِأَرْبَعِينَ سَنَةً ؟ قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: فَحَجَّ آدَمُ مُوسَى."
            },
            {
                "hadithNo": "6745",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger or Allah (s.a.w) said: 'Adam and Musa 'debated. Musa said to him: 'You are Adam, whose lapse caused you to be expelled from Paradise.' Adam said to him: 'You are Musa, whom Allah chose by means of His Message and by means of speaking to you, but you are blaming me for something that was decreed for me before I was created.' So Adam got the better of Musa.'\"",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ حَاتِمٍ ، قَالاَ: حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ ، حَدَّثَنَا أَبِي ، عَنِ ابْنِ شِهَابٍ ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: احْتَجَّ آدَمُ وَمُوسَى، فَقَالَ لَهُ مُوسَى: أَنْتَ آدَمُ الَّذِي أَخْرَجَتْكَ خَطِيئَتُكَ مِنَ الْجَنَّةِ؟ فَقَالَ لَهُ آدَمُ: أَنْتَ مُوسَى الَّذِي اصْطَفَاكَ اللَّهُ بِرِسَالَتِهِ وَبِكَلاَمِهِ، ثُمَّ تَلُومُنِي عَلَى أَمْرٍ قَدْ قُدِّرَ عَلَيَّ قَبْلَ أَنْ أُخْلَقَ؟ فَحَجَّ آدَمُ مُوسَى."
            },
            {
                "hadithNo": "6746",
                "chapterNo": "2",
                "hadithEnglish": "A similar Hadith (as no. 6745) was narrated from Abu Hurairah, from the Prophet (s.a.w).",
                "hadithArabic": "حَدَّثَنِي عَمْرٌو النَّاقِدُ ، حَدَّثَنَا أَيُّوبُ بْنُ النَّجَّارِ الْيَمَامِيُّ ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ ، عَنْ أَبِي سَلَمَةَ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (ح)وَحَدَّثَنَا ابْنُ رَافِعٍ ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، بِمَعْنَى حَدِيثِهِمْ."
            },
            {
                "hadithNo": "6747",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Abu Hurairah from the Messenger of Allah (s.a.w) a similar Hadith (as no. 6745).",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ ، عَنْ أَبِي هُرَيْرَةَ ، عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِهِمْ."
            },
            {
                "hadithNo": "6748",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Abdullah bin 'Amr bin Al-'As said: \"I heard the Messenger of Allah (s.a.w) say: 'Allah decided the decrees of creation fifty thousand years before He created the heavens and the earth.' He said: 'And His Throne is above the water.'\"",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللهِ بن عمرو بْنِ سَرْحٍ ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلاَنِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ ، عَنْ عَبْدِ اللهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ: كَتَبَ اللَّهُ مَقَادِيرَ الْخَلاَئِقِ قَبْلَ أَنْ يَخْلُقَ السَّمَاوَاتِ وَالأَرْضَ بِخَمْسِينَ أَلْفَ سَنَةٍ، قَالَ: وَعَرْشُهُ عَلَى الْمَاءِ."
            },
            {
                "hadithNo": "6749",
                "chapterNo": "2",
                "hadithEnglish": "A similar report (as Hadith no. 6748) was narrated from Abu Hani' with this chain of narrators, except that they did not mention: \"And His Throne is above the water.''",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ ، حَدَّثَنَا الْمُقْرِئُ ، حَدَّثَنَا حَيْوَةُ (ح) وحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ ، أَخْبَرَنَا نَافِعٌ ، يَعْنِي ابْنَ يَزِيدَ ، كِلاَهُمَا عَنْ أَبِي هَانِئٍ ، بِهَذَا الإِسْنَادِ مِثْلَهُ ، غَيْرَ أَنَّهُمَا لَمْ يَذْكُرَا : وَعَرْشُهُ عَلَى الْمَاءِ."
            },
            {
                "hadithNo": "6750",
                "chapterNo": "3",
                "hadithEnglish": "'Abdullah bin 'Amr bin Al-'As said that he heard the Messenger of Allah (s.a.w) say: \"The hearts of the sons of Adam are all between two Fingers of the Most Merciful, like one heart, and He directs them as He wills.\" Then the Messenger of Allah (s.a.w) said: \"O Allah, controller of the hearts, direct our hearts to obey You.''",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ ، وَابْنُ نُمَيْرٍ كِلاَهُمَا ، عَنِ الْمُقْرِئِ ، قَالَ زُهَيْرٌ : حَدَّثَنَا عَبْدُ اللهِ بْنُ يَزِيدَ الْمُقْرِئُ ، قَالَ : حَدَّثَنَا حَيْوَةُ ، أَخْبَرَنِي أَبُو هَانِئٍ ، أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ ، أَنَّهُ سَمِعَ عَبْدَ اللهِ بْنَ عَمْرِو بْنِ الْعَاصِ ، يَقُولُ : أَنَّهُ سَمِعَ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، يَقُولُ: إِنَّ قُلُوبَ بَنِي آدَمَ كُلَّهَا بَيْنَ إِصْبَعَيْنِ مِنْ أَصَابِعِ الرَّحْمَنِ ، كَقَلْبٍ وَاحِدٍ ، يُصَرِّفُهُ حَيْثُ يَشَاءُ ، ثُمَّ قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ."
            },
            {
                "hadithNo": "6751",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Tawus that he said: \"I met one of the Companions of the Messenger of Allah (s.a.w) who said: 'Everything is decided and decreed.\"' He said: \"And I heard 'Abdullah bin 'Umar say: 'The Messenger of Allah (s.a.w) said: Everything is decided and decreed, even incapability and ability, or ability and incapability.\"'",
                "hadithArabic": "حَدَّثَنِي عَبْدُ الأَعْلَى بْنُ حَمَّادٍ ، قَالَ: قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ (ح) وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ عَمْرِو بْنِ مُسْلِمٍ، عَنْ طَاوُوسٍ، أَنَّهُ قَالَ: أَدْرَكْتُ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُونَ كُلُّ شَيْءٍ بِقَدَرٍ، قَالَ: وَسَمِعْتُ عَبْدَ اللهِ بْنَ عُمَرَ يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: كُلُّ شَيْءٍ بِقَدَرٍ، حَتَّى الْعَجْزِ وَالْكَيْسِ، أَوِ الْكَيْسِ وَالْعَجْزِ."
            },
            {
                "hadithNo": "6752",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The idolaters of the Quraish came to argue with the Messenger of Allah (s.a.w) about the Divine Decree, and thus was revealed: 'The Day they will be dragged on their faces into the Fire (it will be said to them): Taste you the touch of Hell!' Verily, We have created all things with Qadar.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَأَبُو كُرَيْبٍ ، قَالاَ: حَدَّثَنَا وَكِيعٌ ، عَنْ سُفْيَانَ ، عَنْ زِيَادِ بْنِ إِسْمَاعِيلَ ، عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ الْمَخْزُومِيِّ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ: جَاءَ مُشْرِكُو قُرَيْشٍ يُخَاصِمُونَ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْقَدَرِ ، فَنَزَلَتْ {يَوْمَ يُسْحَبُونَ فِي النَّارِ عَلَى وُجُوهِهِمْ ذُوقُوا مَسَّ سَقَرَ ، إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ}."
            },
            {
                "hadithNo": "6753",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: I have never seen anything more relative to Lamam than what Abu Hurairah said: That the Prophet (s.a.w) said: \"Allah has decreed for the son of Adam his share of Zina, which he will inevitably get. The Zina of the eyes is looking, and the Zina of the tongue is speaking. The heart wishes and hopes, and the private part confirms that or denies it.\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، وَعَبْدُ بْنُ حُمَيْدٍ ، وَاللَّفْظُ لإِسْحَاقَ ، قَالاَ: أَخْبَرَنَا عَبْدُ الرَّزَّاقِ ، حَدَّثَنَا مَعْمَرٌ ، عَنِ ابْنِ طَاوُوسٍ ، عَنْ أَبِيهِ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ: مَا رَأَيْتُ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِمَّا قَالَ أَبُو هُرَيْرَةَ : أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَا ، أَدْرَكَ ذَلِكَ لاَ مَحَالَةَ ، فَزِنَا الْعَيْنَيْنِ النَّظَرُ ، وَزِنَا اللِّسَانِ النُّطْقُ ، وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي ، وَالْفَرْجُ يُصَدِّقُ ذَلِكَ ، أَوْ يُكَذِّبُهُ.قَالَ عَبْدٌ فِي رِوَايَتِهِ: ابْنِ طَاوُوسٍ ، عَنْ أَبِيهِ ، سَمِعْتُ ابْنَ عَبَّاسٍ."
            },
            {
                "hadithNo": "6754",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"The son of Adam's share of Zina has been decreed for him, which he will inevitably get. The Zina of the eyes is looking, the Zina of the ears is listening, the Zina of the tongue is speaking, the Zina of the hands is touching, and the Zina of the foot is walking. The heart longs and wishes, and the private part confirms that or denies it.\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ ، أَخْبَرَنَا أَبُو هِشَامٍ الْمَخْزُومِيُّ ، حَدَّثَنَا وُهَيْبٌ ، حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ ، عَنْ أَبِيهِ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : كُتِبَ عَلَى ابْنِ آدَمَ نَصِيبُهُ مِنَ الزِّنَا ، مُدْرِكٌ ذَلِكَ لاَ مَحَالَةَ ، فَالْعَيْنَانِ زِنَاهُمَا النَّظَرُ ، وَالأُذُنَانِ زِنَاهُمَا الاِسْتِمَاعُ ، وَاللِّسَانُ زِنَاهُ الْكَلاَمُ ، وَالْيَدُ زِنَاهَا الْبَطْشُ ، وَالرِّجْلُ زِنَاهَا الْخُطَا ، وَالْقَلْبُ يَهْوَى وَيَتَمَنَّى ، وَيُصَدِّقُ ذَلِكَ الْفَرْجُ وَيُكَذِّبُهُ."
            },
            {
                "hadithNo": "6755",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Abu Hurairah that he used to say the Messenger of Allah (s.a.w) said: \"There is no child who is not born in a state of Fitrah, then his parents make him a Jew or a Christian or a Magian, just as animals bring forth animals with their limbs intact, do you see any deformed one among them?\" Then Abu Hurairah said: \"Recite, if you wish: Allah's Fitrah with which He has created mankind. No change let there be in Khalq-illah.\"",
                "hadithArabic": "حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ ، عَنِ الزُّبَيْدِيِّ ، عَنِ الزُّهْرِيِّ ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ ، عَنْ أَبِي هُرَيْرَةَ ، أَنَّهُ كَانَ يَقُولُ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ ، فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ وَيُمَجِّسَانِهِ ، كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً جَمْعَاءَ ، هَلْ تُحِسُّونَ فِيهَا مِنْ جَدْعَاءَ ؟. ثُمَّ يَقُولُ : أَبُو هُرَيْرَةَ وَاقْرَؤُوا إِنْ شِئْتُمْ : {فِطْرَةَ اللهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لاَ تَبْدِيلَ لِخَلْقِ اللَّهِ} الآيَةَ."
            },
            {
                "hadithNo": "6756",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Az-Zuhri with this chain of narrators (a Hadith similar to no. 6755), and he said: \"As animals bring forth other animals\" and he did not say: \"With their limbs intact.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَبْدُ الأَعْلَى (ح) وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ ، كِلاَهُمَا عَنْ مَعْمَرٍ ، عَنِ الزُّهْرِيِّ ، بِهَذَا الإِسْنَادِ ، وَقَالَ: كَمَا تُنْتَجُ الْبَهِيمَةُ بَهِيمَةً وَلَمْ يَذْكُرْ: جَمْعَاءَ."
            },
            {
                "hadithNo": "6757",
                "chapterNo": "6",
                "hadithEnglish": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: \"There is no child who is not born in a state of Fitrah.\" Then he said: Recite: \"Allah's Fitrah with which He has created mankind. No change let there be in Khalq-illah, that is the straight religion.\"",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ ، وَأَحْمَدُ بْنُ عِيسَى ، قَالاَ : حَدَّثَنَا ابْنُ وَهْبٍ ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ ، عَنِ ابْنِ شِهَابٍ ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ. ثُمَّ يَقُولُ: اقْرَؤُوا:{فِطْرَةَ اللهِ الَّتِي فَطَرَ النَّاسَ عَلَيْهَا لاَ تَبْدِيلَ لِخَلْقِ اللهِ ذَلِكَ الدِّينُ الْقَيِّمُ}."
            },
            {
                "hadithNo": "6758",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'There is no child who is not born in a state of Fitrah, then his parents make him a Jew or a Christian or a idolater.' A man said: 'O Messenger of Allah, what do you think if he dies before that?' He said: 'Allah knows best what they would have done.\"'",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ ، حَدَّثَنَا جَرِيرٌ ، عَنِ الأَعْمَشِ ، عَنْ أَبِي صَالِحٍ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا مِنْ مَوْلُودٍ إِلاَّ يُولَدُ عَلَى الْفِطْرَةِ، فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ وَيُشَرِّكَانِهِ فَقَالَ رَجُلٌ: يَا رَسُولَ اللهِ ، أَرَأَيْتَ لَوْ مَاتَ قَبْلَ ذَلِكَ ؟ قَالَ: اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ."
            },
            {
                "hadithNo": "6759",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Al-A'mash with this chain of narrators (a Hadith similar to no .6758). In the Hadith of Ibn Numair it says: \"There is no child who is born but upon this Millah.\" In the report of Abu Bakr from Abu Mu'awiyah:  \"... upon this Millah, until he starts to speak.\" In the report of Abu Kuraib from Abu Mu'awiyah: \"There is no child who is not born in a state of Fitrah, until he begins to speak.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ ، قَالاَ : حَدَّثَنَا أَبُو مُعَاوِيَةَ (ح) وَحَدَّثَنَا ابْنُ نُمَيْرٍ ، حَدَّثَنَا أَبِي ، كِلاَهُمَا عَنِ الأَعْمَشِ ، بِهَذَا الإِسْنَادِ. فِي حَدِيثِ ابْنِ نُمَيْرٍ: مَا مِنْ مَوْلُودٍ يُولَدُ إِلاَّ وَهُوَ عَلَى الْمِلَّةِ. وَفِي رِوَايَةِ أَبِي بَكْرٍ ، عَنْ أَبِي مُعَاوِيَةَ : إِلاَّ عَلَى هَذِهِ الْمِلَّةِ ، حَتَّى يُبَيِّنَ عَنْهُ لِسَانُهُ. وَفِي رِوَايَةِ أَبِي كُرَيْبٍ ، عَنْ أَبِي مُعَاوِيَةَ : لَيْسَ مِنْ مَوْلُودٍ يُولَدُ إِلاَّ عَلَى هَذِهِ الْفِطْرَةِ ، حَتَّى يُعَبِّرَ عَنْهُ لِسَانُهُ."
            },
            {
                "hadithNo": "6760",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Hammam bin Munabbih said: \"This is what Abu Hurairah narrated to us from the Messenger of Allah (s.a.w),\" and he mentioned a number of Ahadith, including the following: \"The Messenger of Allah (s.a.w) said: 'Everyone who is born, is born in this state of Fitrah, then his parents make him a Jew or a Christian. Just as camels are bred - do you see any deformed one among them? Until you are the one who cuts (their ears, noses, tails etc).' They said: 'O Messenger of Allah, what do you think of one who dies in childhood?' He said: 'Allah knows best what they would have done.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، حَدَّثَنَا مَعْمَرٌ ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ ، قَالَ: هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ ، عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَذَكَرَ أَحَادِيثَ مِنْهَا ، وَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ يُولَدُ يُولَدُ عَلَى هَذِهِ الْفِطْرَةِ ، فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ ، كَمَا تَنْتِجُونَ الإِبِلَ ، فَهَلْ تَجِدُونَ فِيهَا جَدْعَاءَ ، حَتَّى تَكُونُوا أَنْتُمْ تَجْدَعُونَهَا قَالُوا: يَا رَسُولَ اللهِ ، أَفَرَأَيْتَ مَنْ يَمُوتُ صَغِيرًا ؟ قَالَ: اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ."
            },
            {
                "hadithNo": "6761",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"Every person is borne by his mother in a state of Fitrah, after which his parents make him a Jew or a Christian or a Magian, or if they are Muslims, (they make him) a Muslim. Every person who is borne by his mother is struck on his side by the Shaitan, except for Mariam and her son.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ ، عَنِ الْعَلاَءِ ، عَنْ أَبِيهِ ، عَنْ أَبِي هُرَيْرَةَ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ: كُلُّ إِنْسَانٍ تَلِدُهُ أُمُّهُ عَلَى الْفِطْرَةِ ، وَأَبَوَاهُ بَعْدُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ وَيُمَجِّسَانِهِ ، فَإِنْ كَانَا مُسْلِمَيْنِ ، فَمُسْلِمٌ كُلُّ إِنْسَانٍ تَلِدُهُ أُمُّهُ يَلْكُزُهُ الشَّيْطَانُ فِي حِضْنَيْهِ إِلاَّ مَرْيَمَ وَابْنَهَا."
            },
            {
                "hadithNo": "6762",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) was asked about the children of the idolaters. He said: \"Allah knows best what they would have done.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو الطَّاهِرِ ، أَخْبَرَنَا ابْنُ وَهْبٍ ، أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ ، وَيُونُسُ ، عَنِ ابْنِ شِهَابٍ ، عَنْ عَطَاءِ بْنِ يَزِيدَ ، عَنْ أَبِي هُرَيْرَةَ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، سُئِلَ عَنْ أَوْلاَدِ الْمُشْرِكِينَ فَقَالَ: اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ."
            },
            {
                "hadithNo": "6763",
                "chapterNo": "6",
                "hadithEnglish": "A similar Hadith (as no. 6762) was narrated from Az-Zuhri with the chain of narrators of Yunus and Ibn Abi Dhi'b, except that in the Hadith of Shu'aib and Ma'qil it says: \"He was asked about the offspring of the idolaters.\"",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ (ح) وَحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بِهْرَامَ ، أَخْبَرَنَا أَبُو الْيَمَانِ ، أَخْبَرَنَا شُعَيْبٌ (ح) وَحَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ ، حَدَّثَنَا مَعْقِلٌ ، وَهُوَ ابْنُ عُبَيْدِ اللهِ ، كُلُّهُمْ عَنِ الزُّهْرِيِّ ، بِإِسْنَادِ يُونُسَ وَابْنِ أَبِي ذِئْبٍ ، مِثْلَ حَدِيثِهِمَا ، غَيْرَ أَنَّ فِي حَدِيثِ شُعَيْبٍ وَمَعْقِلٍ : سُئِلَ عَنْ ذَرَارِيِّ الْمُشْرِكِينَ."
            },
            {
                "hadithNo": "6764",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) was asked about the children of the idolaters who die in infancy. He said: 'Allah knows best what they would have done.\"'",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ ، حَدَّثَنَا سُفْيَانُ ، عَنْ أَبِي الزِّنَادِ ، عَنِ الأَعْرَجِ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ: سُئِلَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، عَنْ أَطْفَالِ الْمُشْرِكِينَ ، مَنْ يَمُوتُ مِنْهُمْ صَغِيرًا ؟ فَقَالَ: اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ."
            },
            {
                "hadithNo": "6765",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah (s.a.w) was asked about the children of the idolaters. He said: 'Allah knows best what they would have done, as He created them.\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا أَبُو عَوَانَةَ ، عَنْ أَبِي بِشْرٍ ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : سُئِلَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، عَنْ أَطْفَالِ الْمُشْرِكِينَ ؟ قَالَ: اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ إِذْ خَلَقَهُمْ."
            },
            {
                "hadithNo": "6766",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Ubayy bin Ka'b said: \"The Messenger of Allah (s.a.w) said: 'The boy who was killed by Al-Khidr was decreed to be a disbeliever; had he lived he would have oppressed his parents by rebellion and disbelief.\"'",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ ، عَنْ أَبِيهِ ، عَنْ رَقَبَةَ بْنِ مَسْقَلَةَ ، عَنْ أَبِي إِسْحَاقَ ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ ، عَنِ ابْنِ عَبَّاسٍ ، عَنْ أُبَيِّ بْنِ كَعْبٍ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ الْغُلاَمَ الَّذِي قَتَلَهُ الْخَضِرُ طُبِعَ كَافِرًا ، وَلَوْ عَاشَ لأَرْهَقَ أَبَوَيْهِ طُغْيَانًا وَكُفْرًا."
            },
            {
                "hadithNo": "6767",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that 'Aishah, the Mother of the Believers, said: \"A boy died and I said: 'Glad tidings for him, one of the little birds of Paradise.' The Messenger of Allah (s.a.w) said: 'Do you not know that Allah created Paradise and the Fire, and He created people for one and people for the other?\"'",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ ، حَدَّثَنَا جَرِيرٌ ، عَنِ الْعَلاَءِ بْنِ الْمُسَيَّبِ ، عَنْ فُضَيْلِ بْنِ عَمْرٍو ، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ، قَالَتْ: تُوُفِّيَ صَبِيٌّ ، فَقُلْتُ: طُوبَى لَهُ عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَوَلاَ تَدْرِينَ أَنَّ اللَّهَ خَلَقَ الْجَنَّةَ وَخَلَقَ النَّارَ ، فَخَلَقَ لِهَذِهِ أَهْلاً وَلِهَذِهِ أَهْلاً."
            },
            {
                "hadithNo": "6768",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that 'Aishah, the Mother of the Believers, said: \"The Messenger of Allah (s.a.w) was called to the funeral of an Ansari boy and I said: 'O Messenger of Allah, glad tidings for this (boy), one of the little birds of Paradise. He did not do any evil or reach the age of doing evil.' He said: 'It may be otherwise, O 'Aishah, for Allah created people for Paradise, He created them for it when they were in their fathers' loins. And He created people for the Fire, He created them for it when they were in their fathers' loins.'\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا وَكِيعٌ ، عَنْ طَلْحَةَ بْنِ يَحْيَى ، عَنْ عَمَّتِهِ عَائِشَةَ بِنْتِ طَلْحَةَ ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ، قَالَتْ : دُعِيَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى جَِنَازَةِ صَبِيٍّ مِنَ الأَنْصَارِ ، فَقُلْتُ : يَا رَسُولَ اللهِ ، طُوبَى لِهَذَا ، عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ لَمْ يَعْمَلِ السُّوءَ وَلَمْ يُدْرِكْهُ ، قَالَ : أَوَ غَيْرَ ذَلِكَ ، يَا عَائِشَةُ إِنَّ اللَّهَ خَلَقَ لِلْجَنَّةِ أَهْلاً ، خَلَقَهُمْ لَهَا وَهُمْ فِي أَصْلاَبِ آبَائِهِمْ ، وَخَلَقَ لِلنَّارِ أَهْلاً ، خَلَقَهُمْ لَهَا وَهُمْ فِي أَصْلاَبِ آبَائِهِمْ."
            },
            {
                "hadithNo": "6769",
                "chapterNo": "6",
                "hadithEnglish": "A similar Hadith (as no. 6768) was narrated from Talhah bin Yahya with the chain of Waki'.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّا ، عَنْ طَلْحَةَ بْنِ يَحْيَى (ح) وحَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ ، حَدَّثَنَا الْحُسَيْنُ بْنُ حَفْصٍ (ح) وحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ ، أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ ، كِلاَهُمَا عَنْ سُفْيَانَ الثَّوْرِيِّ ، عَنْ طَلْحَةَ بْنِ يَحْيَى بِإِسْنَادِ وَكِيعٍ ، نَحْوَ حَدِيثِهِ."
            },
            {
                "hadithNo": "6770",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that 'Abdullah said: 'Umm Habibah, the wife of the Prophet (s.a.w), said: 'O Allah, let me have the joy of the company of my husband the Messenger of Allah (s.a.w) ' and my father Abu Sufyan, and my brother Mu'awiyah (all my life).' The Prophet (s.a.w) said: 'You have asked Allah about lifespans that have already been determined, days that have already been counted and provisions that have already been allotted. Allah will never do anything before its due time or delay it beyond its due time. If you had asked Allah to grant you refuge from punishment in the Fire or punishment in the grave, that would have been better or preferable.\"' Mention of monkeys was made in his presence. Mis'ar said: \"I think he also mentioned pigs, which were transformed.'' He said: \"Allah never gives those who have been transformed offspring. Monkeys and pigs existed before that.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَأَبُو كُرَيْبٍ ، وَاللَّفْظُ لأَبِي بَكْرٍ ، قَالاَ : حَدَّثَنَا وَكِيعٌ ، عَنْ مِسْعَرٍ ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ ، عَنِ الْمُغِيرَةِ بْنِ عَبْدِ اللهِ الْيَشْكُرِيِّ ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ ، عَنْ عَبْدِ اللهِ ، قَالَ : قَالَتْ أُمُّ حَبِيبَةَ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : اللَّهُمَّ أَمْتِعْنِي بِزَوْجِي رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَبِأَبِي أَبِي سُفْيَانَ ، وَبِأَخِي مُعَاوِيَةَ قَالَ : فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : قَدْ سَأَلْتِ اللَّهَ لِآجَالٍ مَضْرُوبَةٍ ، وَأَيَّامٍ مَعْدُودَةٍ ، وَأَرْزَاقٍ مَقْسُومَةٍ ، لَنْ يُعَجِّلَ شَيْئًا قَبْلَ حِلِّهِ ، أَوْ يُؤَخِّرَ شَيْئًا عَنْ حِلِّهِ ، وَلَوْ كُنْتِ سَأَلْتِ اللَّهَ أَنْ يُعِيذَكِ مِنْ عَذَابٍ فِي النَّارِ ، أَوْ عَذَابٍ فِي الْقَبْرِ ، كَانَ خَيْرًا وَأَفْضَلَ. قَالَ: وَذُكِرَتْ عِنْدَهُ الْقِرَدَةُ ، قَالَ مِسْعَرٌ : وَأُرَاهُ قَالَ : وَالْخَنَازِيرُ مِنْ مَسْخٍ ، فَقَالَ : إِنَّ اللَّهَ لَمْ يَجْعَلْ لِمَسْخٍ نَسْلاً وَلاَ عَقِبًا ، وَقَدْ كَانَتِ الْقِرَدَةُ وَالْخَنَازِيرُ قَبْلَ ذَلِكَ."
            },
            {
                "hadithNo": "6771",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from both Ibn Bishr and Waki' (a Hadith similar to no. 6770): \"...From punishment in the Fire and from punishment in the grave.\"",
                "hadithArabic": "حَدَّثَنَاهُ أَبُو كُرَيْبٍ ، حَدَّثَنَا ابْنُ بِشْرٍ ، عَنْ مِسْعَرٍ ، بِهَذَا الإِسْنَادِ ، غَيْرَ أَنَّ فِي حَدِيثِهِ ، عَنِ ابْنِ بِشْرٍ وَوَكِيعٍ ، جَمِيعًا: مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ."
            },
            {
                "hadithNo": "6772",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that 'Abdullah bin Mas'ud said: \"Umm Habibah said: 'O Allah, let me have the joy of the company of my husband the Messenger of Allah (s.a.w) 'and my father Abu Sufyan, and my brother Mu'awiyah (all my life).' The Messenger of Allah (s.a.w) said to her: 'You have asked Allah about lifespans that have already been determined, steps (every move) it is decreed you will take, and provisions that have already been allotted. Nothing will happen before its due time, and nothing will be delayed beyond its due time. If you had asked Allah to protect you from punishment in the Fire and punishment in the grave, that would have been better for you.' \"A man said: 'O Messenger of Allah, monkeys and pigs, are they among those who were transformed?' The Prophet (s.a.w) said: 'Allah does not destroy a people or punish a people and grant them offspring. Monkeys and pigs existed before that.\"'",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ ، وَحَجَّاجُ بْنُ الشَّاعِرِ ، وَاللَّفْظُ لِحَجَّاجٍ ، قَالَ إِسْحَاقُ : أَخْبَرَنَا وقَالَ حَجَّاجٌ : حَدَّثَنَا ، عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا الثَّوْرِيُّ ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ ، عَنِ الْمُغِيرَةِ بْنِ عَبْدِ اللهِ الْيَشْكُرِيِّ ، عَنْ مَعْرُورِ بْنِ سُوَيْدٍ ، عَنْ عَبْدِ اللهِ بْنِ مَسْعُودٍ ، قَالَ : قَالَتْ أُمُّ حَبِيبَةَ : اللَّهُمَّ مَتِّعْنِي بِزَوْجِي رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَبِأَبِي أَبِي سُفْيَانَ ، وَبِأَخِي مُعَاوِيَةَ ، فَقَالَ لَهَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِنَّكِ سَأَلْتِ اللَّهَ لِآجَالٍ مَضْرُوبَةٍ ، وَآثَارٍ مَوْطُوءَةٍ ، وَأَرْزَاقٍ مَقْسُومَةٍ ، لاَ يُعَجِّلُ شَيْئًا مِنْهَا قَبْلَ حِلِّهِ ، وَلاَ يُؤَخِّرُ مِنْهَا شَيْئًا بَعْدَ حِلِّهِ ، وَلَوْ سَأَلْتِ اللَّهَ أَنْ يُعَافِيَكِ مِنْ عَذَابٍ فِي النَّارِ ، وَعَذَابٍ فِي الْقَبْرِ لَكَانَ خَيْرًا لَكِ. قَالَ فَقَالَ رَجُلٌ: يَا رَسُولَ اللهِ ، الْقِرَدَةُ وَالْخَنَازِيرُ ، هِيَ مِمَّا مُسِخَ ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمْ يُهْلِكْ قَوْمًا ، أَوْ يُعَذِّبْ قَوْمًا ، فَيَجْعَلَ لَهُمْ نَسْلاً ، وَإِنَّ الْقِرَدَةَ وَالْخَنَازِيرَ كَانُوا قَبْلَ ذَلِكَ."
            },
            {
                "hadithNo": "6773",
                "chapterNo": "7",
                "hadithEnglish": "Sufyan narrated it with this chain of narrators (a Hadith similar to no. 6272) but he did not said: ... Monkeys and pigs existed before that.",
                "hadithArabic": "حَدَّثَنِيهِ أَبُو دَاوُدَ سُلَيْمَانُ بْنُ مَعْبَدٍ، حَدَّثَنَا الْحُسَيْنُ بْنُ حَفْصٍ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الإِسْنَادِ، غَيْرَ أَنَّهُ قَالَ: وَآثَارٍ مَبْلُوغَةٍ. قَالَ ابْنُ مَعْبَدٍ: وَرَوَى بَعْضُهُمْ قَبْلَ حِلِّهِ أَيْ نُزُولِهِ."
            },
            {
                "hadithNo": "6774",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'The strong believer is better and more beloved to Allah than the weak believer, although both are good. Strive to do that which will benefit you and seek the help of Allah, and do not feel helpless. If anything befalls you, do not say: \"If only I had done (such and such), then such and such would have happened,\" rather say: \"Allah has decreed and what He wills He does.\" For; \"if only\" opens the door to the work of the Shaitan.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَابْنُ نُمَيْرٍ ، قَالاَ: حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ ، عَنْ رَبِيعَةَ بْنِ عُثْمَانَ ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ ، عَنِ الأَعْرَجِ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : الْمُؤْمِنُ الْقَوِيُّ ، خَيْرٌ وَأَحَبُّ إِلَى اللهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ ، وَفِي كُلٍّ خَيْرٌ احْرِصْ عَلَى مَا يَنْفَعُكَ ، وَاسْتَعِنْ بِاللَّهِ وَلاَ تَعْجَزْ ، وَإِنْ أَصَابَكَ شَيْءٌ ، فَلاَ تَقُلْ لَوْ أَنِّي فَعَلْتُ كَانَ كَذَا وَكَذَا ، وَلَكِنْ قُلْ قَدَرُ اللهِ وَمَا شَاءَ فَعَلَ ، فَإِنَّ لَوْ تَفْتَحُ عَمَلَ الشَّيْطَانِ."
            }
        ]
    }
]