[
  {
    "SurahNumber": "12",
    "AyahNumber": "1",
    "NoteID": "1627",
    "Body": "For the meaning of these letters, see App. I."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "1",
    "NoteID": "1628",
    "Body": "Ayat: Signs and verses of the Our-Sn. The whole of\\n\\t\\t\\t\\tJoseph's story is a Sign or a Miracle-a wonder-working\\n\\t\\t\\t\\texposition of the Plan and Purpose of Allah."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "1",
    "NoteID": "1629",
    "Body": "Cf. v. 15, n. 716. The predominant meaning of Mubin here\\n\\t\\t\\t\\tis: one that explains or makes things clear."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "2",
    "NoteID": "1630",
    "Body": "Qur-an means: something (1) to be read, or (2) recited,\\n\\t\\t\\t\\tor (3) proclaimed. It may apply to a verse, or a Sura, or\\n\\t\\t\\t\\tto the whole Book of Revelation."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "3",
    "NoteID": "1631",
    "Body": "Most beautiful of stories: see Introduction to this Sura.\\n\\t\\t\\t\\tEloquence consists in conveying by a word or hint many\\n\\t\\t\\t\\tmeanings for those who can understand and wish to learn\\n\\t\\t\\t\\twisdom. Not only is Joseph's story \"beautiful\" in that\\n\\t\\t\\t\\tsense, Joseph himself was renowned for manly beauty; the\\n\\t\\t\\t\\twomen of Egypt, called him a noble angel (xii. 31), and\\n\\t\\t\\t\\tthe beauty of his exterior form was a symbol of the\\n\\t\\t\\t\\tbeauty of his soul."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "4",
    "NoteID": "1632",
    "Body": "For the Parable all that is necessary to know about\\n\\t\\t\\t\\tJoseph is that he was one of the Chosen Ones of Allah.\\n\\t\\t\\t\\tFor the story it is necessary to set down a few more\\n\\t\\t\\t\\tdetails. His father was Jacob, also called Israel the son\\n\\t\\t\\t\\tof Isaac, the younger son of Abraham, (the elder son\\n\\t\\t\\t\\thaving been Isma'il, whose story is told in ii. 124-129.\\n\\t\\t\\t\\tAbraham may be called the Father of the line of Semitic\\n\\t\\t\\t\\tprophecy. Jacob had four wives. From three of them he had\\n\\t\\t\\t\\tten sons. In his old age he had from Rachel (Arabic\\n\\t\\t\\t\\tRahil), a very beautiful woman, two sons Joseph and\\n\\t\\t\\t\\tBenjamin (the youngest). The place where Jacob and his\\n\\t\\t\\t\\tfamily and his flocks were located was in Canaan, and is\\n\\t\\t\\t\\tshown by tradition near modern Nablus (ancient Shechem),\\n\\t\\t\\t\\tsome thirty miles north of Jerusalem. The traditional\\n\\t\\t\\t\\tsite of the well into which Joseph was thrown by his\\n\\t\\t\\t\\tbrothers is still shown in the neighbourhood."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "4",
    "NoteID": "1633",
    "Body": "Joseph was a mere lad. But he was true and frank and\\n\\t\\t\\t\\trighteous; he was a type of manly beauty and rectitude.\\n\\t\\t\\t\\tHis father loved him dearly. His half-brothers were\\n\\t\\t\\t\\tjealous of him and hated him. His destiny was prefigured\\n\\t\\t\\t\\tin the vision. He was to be exalted in rank above his\\n\\t\\t\\t\\televen brothers (stars) and his father and mother (sun\\n\\t\\t\\t\\tand moon), but as the subsequent story shows, he never\\n\\t\\t\\t\\tlost his head, but always honoured his parents and repaid\\n\\t\\t\\t\\this brothers' craft and hatred with forgiveness and\\n\\t\\t\\t\\tkindness."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "5",
    "NoteID": "1634",
    "Body": "The young lad Yusuf was innocent and did not even know of\\n\\t\\t\\t\\this brothers' guile and hatred, but the father knew and\\n\\t\\t\\t\\twarned him."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "5",
    "NoteID": "1635",
    "Body": "The story is brought up at once to its spiritual bearing.\\n\\t\\t\\t\\tThese wicked brothers were puppets in the hands of Evil.\\n\\t\\t\\t\\tThey allowed their manhood to be subjugated by Evil, not\\n\\t\\t\\t\\tremembering that Evil was the declared opposite or enemy\\n\\t\\t\\t\\tof the true nature and instincts of manhood."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "6",
    "NoteID": "1636",
    "Body": "If Joseph was to be of the elect, he must understand and\\n\\t\\t\\t\\tinterpret Signs and events aright. The imagination of the\\n\\t\\t\\t\\tpure sees truths, which those not so endowed cannot\\n\\t\\t\\t\\tunderstand. The dreams of the righteous prefigure great\\n\\t\\t\\t\\tevents, while the dreams of the futile are mere idle\\n\\t\\t\\t\\tfutilities. Even things that happen to us are often like\\n\\t\\t\\t\\tdreams. The righteous man received disasters and\\n\\t\\t\\t\\treverses, not with blasphemies against Allah, but with\\n\\t\\t\\t\\thumble devotion, seeking to ascertain His Will. Nor does\\n\\t\\t\\t\\the receive good fortune with arrogance, but as an\\n\\t\\t\\t\\topportunity for doing good, to friends and foes alike.\\n\\t\\t\\t\\tHis attitude to histories and stories is the same: he\\n\\t\\t\\t\\tseeks the edifying material which leads to Allah."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "6",
    "NoteID": "1637",
    "Body": "Whatever happens is the result of Allah's Will and Plan.\\n\\t\\t\\t\\tAnd He is good and wise, and He knows all things.\\n\\t\\t\\t\\tTherefore we must trust Him. In Joseph's case he could\\n\\t\\t\\t\\tlook back to his fathers, and to Abraham, the True, the\\n\\t\\t\\t\\tRighteous, who through all adversities kept his Faith\\n\\t\\t\\t\\tpure and undefiled and won through."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "7",
    "NoteID": "1638",
    "Body": "In Joseph's story we have good and evil contrasted in so\\n\\t\\t\\t\\tmany different ways. Those in search of true spiritual\\n\\t\\t\\t\\tknowledge can see it embodied in concrete events in this\\n\\t\\t\\t\\tstory of many facets, matching the colours of Joseph's\\n\\t\\t\\t\\tmany-coloured coat."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "8",
    "NoteID": "1639",
    "Body": "The ten brothers envied and hated their innocent younger\\n\\t\\t\\t\\tbrothers Joseph and Benjamin. Jacob had the wisdom to see\\n\\t\\t\\t\\tthat his young and innocent sons wanted protection and to\\n\\t\\t\\t\\tperceive Joseph's spiritual greatness. But his wisdom, to\\n\\t\\t\\t\\tthem, was folly or madness of imbecility, because it\\n\\t\\t\\t\\ttouched their self-love, as truth often does. And they\\n\\t\\t\\t\\trelied on the brute strength of numbers-the ten hefty\\n\\t\\t\\t\\tbrethren against old Jacob, the lad Joseph, and the boy\\n\\t\\t\\t\\tBenjamin!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "9",
    "NoteID": "1640",
    "Body": "There seems to be some irony here, consistent with the\\n\\t\\t\\t\\tcynical nature of these callous, worldly-wise brethren.\\n\\t\\t\\t\\tThe goodness of Joseph was a reproach to their own\\n\\t\\t\\t\\twickedness. Perhaps the grieved father contrasted Joseph\\n\\t\\t\\t\\tagainst them, and sometimes spoke of it: \"Why don't you\\n\\t\\t\\t\\tbe good like Joseph?\" This was gall and wormwood to them.\\n\\t\\t\\t\\tReal goodness was to them nothing but a name. Perhaps it\\n\\t\\t\\t\\tonly suggested hypocrisy to them. So they plotted to get\\n\\t\\t\\t\\trid of Joseph. In their mean hearts they thought that\\n\\t\\t\\t\\twould bring back their father's love whole to them. But\\n\\t\\t\\t\\tthey valued that love only for what material good they\\n\\t\\t\\t\\tcould get out of it. On the other hand their father was\\n\\t\\t\\t\\tneither foolish nor unjustly partial. He only knew the\\n\\t\\t\\t\\tdifference between gold and dross. They say in irony,\\n\\t\\t\\t\\t\"Let us first get rid of Joseph. It will be time enough\\n\\t\\t\\t\\tthen to pretend to be 'good' like him, or to repent of\\n\\t\\t\\t\\tour crime after we have had all its benefits in material\\n\\t\\t\\t\\tthings\"!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "10",
    "NoteID": "1641",
    "Body": "One of the brethren, perhaps less cruel by nature, or\\n\\t\\t\\t\\tperhaps more worldly-wise, said: \"Why undertake the risk\\n\\t\\t\\t\\tof blood-guiltiness? Throw him into the well you see\\n\\t\\t\\t\\tthere! Some travellers passing by will pick him up and\\n\\t\\t\\t\\tremove him to a far country. If not, at least we shall\\n\\t\\t\\t\\tnot have killed him,\" This was false casuistry, but such\\n\\t\\t\\t\\tcasuistry appeals to sinners of a certain kind of\\n\\t\\t\\t\\ttemperament. The well was apparently a dry well, deep\\n\\t\\t\\t\\tenough to prevent his coming out, but with no water in\\n\\t\\t\\t\\twhich he could be drowned. It was Allah's Plan to save\\n\\t\\t\\t\\thim alive, but not to make Joseph indebted to any of his\\n\\t\\t\\t\\tbrethren for his life!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "11",
    "NoteID": "1642",
    "Body": "The plot having been formed, the brethren proceed to put\\n\\t\\t\\t\\tit into execution. Jacob, knowing the situation, did not\\n\\t\\t\\t\\tordinarily trust his beloved Joseph with the brethren.\\n\\t\\t\\t\\tThe latter therefore remonstrate and feign brotherly\\n\\t\\t\\t\\taffection."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "12",
    "NoteID": "1643",
    "Body": "They did not expect their protestations to be believed\\n\\t\\t\\t\\tin. But they added an argument that might appeal both to\\n\\t\\t\\t\\tJacob and Joseph. 'They were going to give their young\\n\\t\\t\\t\\tbrother a good time. Why not let him come out with them\\n\\t\\t\\t\\tand play and enjoy himself to his heart's content?'"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "13",
    "NoteID": "1644",
    "Body": "Jacob did not know the precise plot, but he had strong\\n\\t\\t\\t\\tmisgivings. But how could he put off these brethren? If\\n\\t\\t\\t\\tthey were driven to open hostility, they would be certain\\n\\t\\t\\t\\tto cause him harm. He must deal with the brethren wisely\\n\\t\\t\\t\\tand cautiously. He pleaded that he was an old man, and\\n\\t\\t\\t\\twould miss Joseph and be sad without him. And after all,\\n\\t\\t\\t\\tJoseph was not of an age to play with them. They would be\\n\\t\\t\\t\\tattending to their own affairs, and a wolf might come and\\n\\t\\t\\t\\tattack and kill Joseph. In saying this he was really\\n\\t\\t\\t\\tunwittingly giving a cue to the wicked ones, for they use\\n\\t\\t\\t\\tthat very excuse in verse 17 below. Thus the wicked plot\\n\\t\\t\\t\\tthickens, but there is a counter-plan also, which is\\n\\t\\t\\t\\tdrawing a noose of lies round the wicked ones, so that\\n\\t\\t\\t\\tthey are eventually driven into a corner, and have to\\n\\t\\t\\t\\tconfess their own guilt in verse 91 below, and through\\n\\t\\t\\t\\trepentance obtain forgiveness."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "14",
    "NoteID": "1645",
    "Body": "Jacob's objections as stated could be easily rebutted,\\n\\t\\t\\t\\tand the brethren did so. They would be eleven in the\\n\\t\\t\\t\\tparty, and the ten strong and grown-up men would have to\\n\\t\\t\\t\\tperish before the wolf could touch the young lad Joseph!\\n\\t\\t\\t\\tSo they prevailed, as verbal arguments are apt to\\n\\t\\t\\t\\tprevail, when events are weaving their web on quite\\n\\t\\t\\t\\tanother Plan, which has nothing to do with verbal\\n\\t\\t\\t\\targuments. Presumably Benjamin was too young to go with\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "15",
    "NoteID": "1646",
    "Body": "Allah was with Joseph in all his difficulties, sorrows,\\n\\t\\t\\t\\tand sufferings, as He is with all His servants who put\\n\\t\\t\\t\\ttheir trust in Him. The poor lad was betrayed by his\\n\\t\\t\\t\\tbrothers, and left, perhaps to die or to be sold into\\n\\t\\t\\t\\tslavery. But his heart was undaunted. His courage never\\n\\t\\t\\t\\tfailed him. On the contrary he had an inkling, a\\n\\t\\t\\t\\tpresentiment, of things that were to be-that his own\\n\\t\\t\\t\\trectitude and beauty of soul would land him on his feet,\\n\\t\\t\\t\\tand perhaps some day, his brothers would stand in need of\\n\\t\\t\\t\\thim, and he would be in a position to fulfil that need,\\n\\t\\t\\t\\tand would do it gladly, putting them, to shame for their\\n\\t\\t\\t\\tpresent plotting and betrayal of him."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "15",
    "NoteID": "1647",
    "Body": "This situation actually occurred when Joseph later on\\n\\t\\t\\t\\tbecame the govenor of Egypt and his brothers stood before\\n\\t\\t\\t\\thim suing for his assistance although they did not know\\n\\t\\t\\t\\tthat he was their betrayed brother; see xii. 89 below;\\n\\t\\t\\t\\talso xii. 58."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "16",
    "NoteID": "1648",
    "Body": "The plotters were ready with their false tale for their\\n\\t\\t\\t\\tfather, but in order to make it appear plausible, they\\n\\t\\t\\t\\tcame some time after sundown, to show that they had made\\n\\t\\t\\t\\tan effort to search for their brother and save him."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "17",
    "NoteID": "1649",
    "Body": "They wanted to make out that they were not negligent of\\n\\t\\t\\t\\tJoseph. They were naturally having games and exercise,\\n\\t\\t\\t\\twhile the boy was left with their belongings. It was the\\n\\t\\t\\t\\tracing that prevented them from seeing the wolf. And\\n\\t\\t\\t\\tJacob's fears about the wolf (xii. 13 above) made them\\n\\t\\t\\t\\timagine that he would swallow the wolf story readily."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "17",
    "NoteID": "1650",
    "Body": "They were surprised that Jacob received the story about\\n\\t\\t\\t\\tthe wolf with cold incredulity. So they grew petulant,\\n\\t\\t\\t\\tput on an air of injured innocence, and bring out the\\n\\t\\t\\t\\tblood-stained garment described in the next verse."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "18",
    "NoteID": "1651",
    "Body": "Joseph wore a garment of many colours, which was a\\n\\t\\t\\t\\tspecial garment peculiar to him. If the brethren could\\n\\t\\t\\t\\tproduce it blood-stained before their father, they\\n\\t\\t\\t\\tthought he would be convinced that Joseph had been killed\\n\\t\\t\\t\\tby a wild beast. But the stain on the garment was a stain\\n\\t\\t\\t\\tof \"false blood\",-not the blood of Joseph, but the blood\\n\\t\\t\\t\\tof a goat which the brethren had killed expressly for\\n\\t\\t\\t\\tthis purpose. Their device, however, was not quite\\n\\t\\t\\t\\tconvincing because, as some Commentators have pointed out\\n\\t\\t\\t\\tthe garment was intact which is unconceivable if a wolf\\n\\t\\t\\t\\thad indeed devoured Joseph."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "18",
    "NoteID": "1652",
    "Body": "Jacob saw that there had been some foul play, and he did\\n\\t\\t\\t\\tnot hesitate to say so. In effect he said \"Ah me! the\\n\\t\\t\\t\\ttale you tell may be good enough for you, who invented\\n\\t\\t\\t\\tit! But what about me, your aged father? What is there\\n\\t\\t\\t\\tleft in life for me now, with my beloved son gone? And\\n\\t\\t\\t\\tyet what can I do but hold my heart in patience and\\n\\t\\t\\t\\timplore Allah's assistance? I have faith, and I know that\\n\\t\\t\\t\\tall that He does is for the best!\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "19",
    "NoteID": "1653",
    "Body": "Then comes the caravan of unknown travellers-Midianite or\\n\\t\\t\\t\\tArab merchants travelling to Egypt with merchandise, such\\n\\t\\t\\t\\tas the balm of Gilead in Trans-Jordania. In accordance\\n\\t\\t\\t\\twith custom the caravan was preceded by advance parties\\n\\t\\t\\t\\tto search out water and pitch a camp near. They naturally\\n\\t\\t\\t\\twent to the well and let down their bucket."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "19",
    "NoteID": "1654",
    "Body": "The water carrier is surprised and taken aback, when he\\n\\t\\t\\t\\tfinds a youth of comely appearance, innocent like an\\n\\t\\t\\t\\tangel, with a face as bright as the sun! What is he to\\n\\t\\t\\t\\tmake of it? Anyhow, to see him is a delight! And he\\n\\t\\t\\t\\tshouts it out as a piece of good news. Some Commentators\\n\\t\\t\\t\\tthink that \"Bushra\", the Arabic word for \"Good news\", is\\n\\t\\t\\t\\ta proper noun, the name of the companion to whom he\\n\\t\\t\\t\\tshouted."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "19",
    "NoteID": "1655",
    "Body": "It was a caravan of merchants, and they think of\\n\\t\\t\\t\\teverything in terms of the money to be made out of it!\\n\\t\\t\\t\\tHere was an unknown, unclaimed youth, of surpassing\\n\\t\\t\\t\\tbeauty, with apparently a mind as refined as was his\\n\\t\\t\\t\\texternal beauty. If he could be sold in the opulent slave\\n\\t\\t\\t\\tmarkets of Memphis or whatever was the capital of the\\n\\t\\t\\t\\tHyksos Dynasty then ruling in Egypt, what a price he\\n\\t\\t\\t\\twould fetch! They had indeed lighted upon a treasure! And\\n\\t\\t\\t\\tthey wanted to conceal him lest he was another's slave\\n\\t\\t\\t\\tand had run away from his master who might come and claim\\n\\t\\t\\t\\thim! The circumstances were peculiar and the merchants\\n\\t\\t\\t\\twere cautious. Bidha'at=stock-in-trade; capital; money;\\n\\t\\t\\t\\twealth; treasure."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "19",
    "NoteID": "1656",
    "Body": "To different mind the situation appeared different.\\n\\t\\t\\t\\tJoseph must have felt keenly the edge of his brethren's\\n\\t\\t\\t\\ttreason. His father Jacob was lost in the sorrow of the\\n\\t\\t\\t\\tloss of his best-beloved son. The brethren were exulting\\n\\t\\t\\t\\tin their plan of getting rid of one whom they hated. The\\n\\t\\t\\t\\tmerchants were gloating over their gains. But the horizon\\n\\t\\t\\t\\tof all was limited. Allah knew their deeds and their\\n\\t\\t\\t\\tfeelings and motives, and He was working out His own\\n\\t\\t\\t\\tPlan. Neither the best of us nor the worst of us know\\n\\t\\t\\t\\twhither our Destiny is leading us-how evil plots are\\n\\t\\t\\t\\tdefeated and goodness comes to its own in marvellous\\n\\t\\t\\t\\tways!."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "20",
    "NoteID": "1657",
    "Body": "Dirham: from Greek, drachma, a small silver coin, which\\n\\t\\t\\t\\tvaried in weight and value at different times and in\\n\\t\\t\\t\\tdifferent States."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "20",
    "NoteID": "1658",
    "Body": "There was mutual deceit on both sides. The Brethren had\\n\\t\\t\\t\\tevidently been watching to see what happened to Joseph.\\n\\t\\t\\t\\tWhen they saw the merchants take him up and hide him,\\n\\t\\t\\t\\tthey came to claim his price as a run away slave, but\\n\\t\\t\\t\\tdared not haggle over the price, lest their object, to\\n\\t\\t\\t\\tget rid of him, should be defeated. The merchants were\\n\\t\\t\\t\\tshrewd enough to doubt the claim in their own minds; but\\n\\t\\t\\t\\tthey dared not haggle lest they should lose a very\\n\\t\\t\\t\\tvaluable acquisition. And so the most precious of human\\n\\t\\t\\t\\tlives in that age was sold into slavery for a few silver\\n\\t\\t\\t\\tpieces!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "21",
    "NoteID": "1659",
    "Body": "Joseph is now clear of his jealous brethren in the land\\n\\t\\t\\t\\tof Canaan. The merchants take him to Egypt. In the city\\n\\t\\t\\t\\tof Memphis (or whatever was the Egyptian capital then) he\\n\\t\\t\\t\\twas exposed for sale by the merchants. The merchants had\\n\\t\\t\\t\\tnot miscalculated. There was a ready market for him; his\\n\\t\\t\\t\\thandsome presence, his winning ways, his purity and\\n\\t\\t\\t\\tinnocence, his intelligence and integrity, combined with\\n\\t\\t\\t\\this courtesy and noble manliness, attracted all eyes to\\n\\t\\t\\t\\thim. There was the keenest competition to purchase him,\\n\\t\\t\\t\\tand in the highest Court circles. Every competitor was\\n\\t\\t\\t\\toutbid by a high court official, who is called in verse\\n\\t\\t\\t\\t30 below \"the 'Aziz\" (the Exalted in rank)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "21",
    "NoteID": "1660",
    "Body": "See last note. The 'Aziz's motive was perhaps worldly.\\n\\t\\t\\t\\tSuch a handsome, attractive, intelligent son would get\\n\\t\\t\\t\\thim more honour, dignity, power and wealth."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "21",
    "NoteID": "1661",
    "Body": "How unerringly Allah's plan works! To teach Joseph wisdom\\n\\t\\t\\t\\tand power, he had to be tested and proved in\\n\\t\\t\\t\\trighteousness, and advanced and established in Egypt, and\\n\\t\\t\\t\\tthe way prepared for Israel and his posterity to proclaim\\n\\t\\t\\t\\tAllah's truth to the world and to make possible the\\n\\t\\t\\t\\tsubsequent missions of Moses."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "21",
    "NoteID": "1662",
    "Body": "Ahadith might be stories, things imagined or related,\\n\\t\\t\\t\\tthings that happened, in life or in true dreams. To\\n\\t\\t\\t\\tsuppose that phenomenal events are the only reality is a\\n\\t\\t\\t\\tmark of one-sided materialism. As Hamlet said to Horatio,\\n\\t\\t\\t\\t\"there are more things in heaven and earth, Horatio, than\\n\\t\\t\\t\\tare dreamt of in your philosophy.\" External events have\\n\\t\\t\\t\\ttheir own limited reality, but there are bigger realities\\n\\t\\t\\t\\tbehind them, that sometimes appear darkly in the visions\\n\\t\\t\\t\\tof ordinary men, but more clearly in the visions of\\n\\t\\t\\t\\tpoets, seers, sages and prophets. Joseph had to be\\n\\t\\t\\t\\ttrained in seeing the realities behind events and\\n\\t\\t\\t\\tvisions. He was hated by his brothers and sold by them\\n\\t\\t\\t\\tinto slavery; they were sending him into the land of\\n\\t\\t\\t\\tEgypt, where he was to rule men. He loved his father\\n\\t\\t\\t\\tdearly and was separated from him, and his mother had\\n\\t\\t\\t\\tdied early; but his affection was not blunted, but drawn\\n\\t\\t\\t\\tto a keener edge when his benevolent work benefited\\n\\t\\t\\t\\tmillions in Egypt, and in the world. His own visions of\\n\\t\\t\\t\\tstars, sun, and moon prostrating themselves before him,\\n\\t\\t\\t\\twas no idle dream of a selfish fool, but the\\n\\t\\t\\t\\tprefigurement of a power, which, used rightly, was to\\n\\t\\t\\t\\tmake his own honour an instrument of service to millions\\n\\t\\t\\t\\the had not seen, through men and women whose own power\\n\\t\\t\\t\\tand dignity were sanctified through him. He was to\\n\\t\\t\\t\\tunderstand the hidden meaning of what seemed futilities,\\n\\t\\t\\t\\tblunderings, snares, evil-plottings, love gone wrong, and\\n\\t\\t\\t\\tpower used tyrannically. He was to interpret truth to\\n\\t\\t\\t\\tthose who would never have reached it otherwise."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "21",
    "NoteID": "1663",
    "Body": "Cf.: \"There is a divinity that shapes our ends, rough-hew\\n\\t\\t\\t\\tthem as we will.\" Only, in Shakespeare, (Hamlet, V. 2),\\n\\t\\t\\t\\twe have a vague and distant ideal, an irresolute\\n\\t\\t\\t\\tstriving, an unsuccessful attempt at getting beyond \"this\\n\\t\\t\\t\\ttoo, too solid flesh\"! In Joseph we have the Prophet of\\n\\t\\t\\t\\tAllah, sure in faith, above all carnal motives, and\\n\\t\\t\\t\\tadvancing the destiny of mankind with a conscious\\n\\t\\t\\t\\tpurpose, as the scroll of knowledge, wisdom, and power,\\n\\t\\t\\t\\tunfolds itself before him by the grace of Allah, All-Good\\n\\t\\t\\t\\tand All-Powerful."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "22",
    "NoteID": "1664",
    "Body": "When Joseph left Canaan, he was a young and immature lad,\\n\\t\\t\\t\\tbut his nature was innocent and good. Through the\\n\\t\\t\\t\\tvicissitudes of his fortune in Egypt, he grew in\\n\\t\\t\\t\\tknowledge, judgment, and power."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "22",
    "NoteID": "1665",
    "Body": "Muhsinin: those who do right, those who do good. Both\\n\\t\\t\\t\\tideas are implied. In following right conduct, you are\\n\\t\\t\\t\\tnecessarily doing good to yourself and to others."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "23",
    "NoteID": "1666",
    "Body": "The 'Aziz had treated Joseph with honour; he was more his\\n\\t\\t\\t\\tguest and son than his slave. In trying to seduce Joseph\\n\\t\\t\\t\\tin these circumstances, his wife was guilty of a crime\\n\\t\\t\\t\\tagainst Joseph's own honour and dignity. And there was a\\n\\t\\t\\t\\tthird fault in her earthly love. True love blots Self\\n\\t\\t\\t\\tout: it thinks more of the loved one than of the Self.\\n\\t\\t\\t\\tThe 'Aziz's wife was seeking the satisfaction of her own\\n\\t\\t\\t\\tselfish passion, and was in treason against Joseph's pure\\n\\t\\t\\t\\tsoul and his high destiny. It was inevitable that Joseph\\n\\t\\t\\t\\tshould repel the advances made by the wife of the\\n\\t\\t\\t\\tcourtier."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "23",
    "NoteID": "1667",
    "Body": "Joseph's plea in rejecting her advances is threefold:\\n\\t\\t\\t\\t'(1) I owe a duty, and so do you, to your husband, the\\n\\t\\t\\t\\t'Aziz; (2) the kindness, courtesy, and honour, with which\\n\\t\\t\\t\\the has treated me entitied him to more than mere\\n\\t\\t\\t\\tgratitude from me; (3) in any case, do you not see that\\n\\t\\t\\t\\tyou are harbouring a guilty passion, and that no good can\\n\\t\\t\\t\\tcome out of guilt? We must all obey laws, human and\\n\\t\\t\\t\\tdivine.'"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "24",
    "NoteID": "1668",
    "Body": "She was blinded with passion, and his plea had no effect\\n\\t\\t\\t\\ton her. He was human after all, and her passionate love\\n\\t\\t\\t\\tand her beauty placed a great temptation in his path. But\\n\\t\\t\\t\\the had a sure refuge,-his faith in Allah. His spiritual\\n\\t\\t\\t\\teyes saw something that her eyes, blinded by passion, did\\n\\t\\t\\t\\tnot see. She thought no one saw when the doors were\\n\\t\\t\\t\\tclosed. He knew that Allah was there. That made him\\n\\t\\t\\t\\tstrong and proof against temptation."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "24",
    "NoteID": "1669",
    "Body": "The credit of our being saved from sin is due, not to our\\n\\t\\t\\t\\tweak earthly nature, but to Allah. We can only try, like\\n\\t\\t\\t\\tJoseph, to be true and sincere; Allah will purify us and\\n\\t\\t\\t\\tsave us from all that is wrong. Tempted but true, we rise\\n\\t\\t\\t\\tabove ourselves."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "25",
    "NoteID": "1670",
    "Body": "With his master's wife in her mad passion, the situation\\n\\t\\t\\t\\tbecame intolerable, and Joseph made for the door. She ran\\n\\t\\t\\t\\tafter him to detain him. She tugged at his garment to\\n\\t\\t\\t\\tdetain him. As he was retreating, she could only catch\\n\\t\\t\\t\\thold of the back of his shirt, and in the struggle she\\n\\t\\t\\t\\ttore it. He was determined to open the door and leave the\\n\\t\\t\\t\\tplace, as it was useless to argue with her in her mad\\n\\t\\t\\t\\tpassion. When the door was opened, it so happened, that\\n\\t\\t\\t\\tthe 'Aziz was not far off. We need not assume that he was\\n\\t\\t\\t\\tspying, or had any suspicions either of his wife or\\n\\t\\t\\t\\tJoseph. In his narrow limited way he was a just man. We\\n\\t\\t\\t\\tcan imagine his wife's consternation. One guilt leads to\\n\\t\\t\\t\\tanother. She had to resort to a lie, not only to justify\\n\\t\\t\\t\\therself but also to have her revenge on the man who had\\n\\t\\t\\t\\tscorned her love. Slighted love (of the physical kind)\\n\\t\\t\\t\\tmade her ferocious, and she lost all sense of right and\\n\\t\\t\\t\\twrong."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "25",
    "NoteID": "1671",
    "Body": "Her lie and her accusation were plausible. Joseph was\\n\\t\\t\\t\\tfound with his dress disarranged. She wanted the\\n\\t\\t\\t\\tinference to be drawn that he had assaulted her and she\\n\\t\\t\\t\\thad resisted. For one in his position it was a dreadful\\n\\t\\t\\t\\tcrime. Should he not be consigned to a dungeon or at\\n\\t\\t\\t\\tleast scourged? Perhaps she hoped that in either case he\\n\\t\\t\\t\\twould be more pliable to her designs in the future."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "26",
    "NoteID": "1672",
    "Body": "Joseph bore himself with dignity. He was too great and\\n\\t\\t\\t\\tnoble to indulge in angry recrimination. But he had to\\n\\t\\t\\t\\ttell the truth. And he did it with quiet simplicity. 'The\\n\\t\\t\\t\\tlove game was hers, not his, and it went too far in\\n\\t\\t\\t\\tseeking to assault his person.'"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "26",
    "NoteID": "1673",
    "Body": "In the nature of things there was no eye-witness to what\\n\\t\\t\\t\\thad happened between them. But as there was a scene and\\n\\t\\t\\t\\tthe whole household collected, wisdom came through one\\n\\t\\t\\t\\twho was not immediately concerned. They say it was a\\n\\t\\t\\t\\tchild. If so, it illustrates the truth that the most\\n\\t\\t\\t\\tobvious things are not noticed by people who are excited,\\n\\t\\t\\t\\tbut are plain to simple people who remain calm. Wisdom\\n\\t\\t\\t\\tcomes often through babes and sucklings."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "27",
    "NoteID": "1674",
    "Body": "If Joseph's shirt was torn at the back, he must obviously\\n\\t\\t\\t\\thave been retreating, and the wife of the 'Aziz must have\\n\\t\\t\\t\\tbeen tugging from behind. No one could doubt who was the\\n\\t\\t\\t\\tguilty party. Everybody saw it, and the 'Aziz was\\n\\t\\t\\t\\tconvinced."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "28",
    "NoteID": "1675",
    "Body": "When the real fact became clear to every one, the 'Aziz\\n\\t\\t\\t\\tas head of the household had to decide what to do. His\\n\\t\\t\\t\\town position was difficult, and it was made ridiculous.\\n\\t\\t\\t\\tHe was a high officer of state, say Grand Chamberlain.\\n\\t\\t\\t\\tWas he going to proclaim to the world that his wife was\\n\\t\\t\\t\\trunning after a slave? He was probably fond of her, and\\n\\t\\t\\t\\the saw the innocence, loyalty, and sterling merit of\\n\\t\\t\\t\\tJoseph. He must treat the whole affair as a woman's\\n\\t\\t\\t\\tprank,-the madness of sex-love, and the tricks and snares\\n\\t\\t\\t\\tconnected with sex-love. He must take no further action\\n\\t\\t\\t\\tbut to rate his wife and do justice."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "29",
    "NoteID": "1676",
    "Body": "As was only fair, he apologised to Joseph and begged him\\n\\t\\t\\t\\tto give no further thought to the injury that had been\\n\\t\\t\\t\\tdone to him, first by the love-snare of his wife,\\n\\t\\t\\t\\tsecondly, by the utterly false charge made against him,\\n\\t\\t\\t\\tand thirdly, by the scene, which must have been painful\\n\\t\\t\\t\\tto a man of such spotless character as Joseph. That was\\n\\t\\t\\t\\tnot enough. He must ask his wife humbly to beg Joseph's\\n\\t\\t\\t\\tpardon for the wrong that she had done him. And he must\\n\\t\\t\\t\\tfurther ask her to consider her unbecoming conduct in\\n\\t\\t\\t\\titself, apart from any wrong done to Joseph."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "30",
    "NoteID": "1677",
    "Body": "'Aziz: title of a nobleman or officer of Court, of high\\n\\t\\t\\t\\trank. Considering all the circumstances, the office of\\n\\t\\t\\t\\tGrand Chamberlain or minister may be indicated. But\\n\\t\\t\\t\\t\"Aziz\" I think is a title, not an office. I have not\\n\\t\\t\\t\\ttranslated the title but left it as it is. \"Excellency\"\\n\\t\\t\\t\\tor \"Highness\" would have specialised modern associations\\n\\t\\t\\t\\twhich I want to avoid."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "30",
    "NoteID": "1678",
    "Body": "The 'Aziz's just, wise, and discreet conduct would have\\n\\t\\t\\t\\tclosed the particular episode of his wife's guilty\\n\\t\\t\\t\\tconduct if only Mrs. Grundy had left her alone and she\\n\\t\\t\\t\\thad not foolishly thought of justifying her conduct to\\n\\t\\t\\t\\tMrs. Grundy. The 'Aziz had reproved her, and he had the\\n\\t\\t\\t\\tright and authority so to do. He also probably understood\\n\\t\\t\\t\\ther. Joseph by his behaviour had upheld the highest\\n\\t\\t\\t\\tstandard both for himself and for her."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "31",
    "NoteID": "1679",
    "Body": "When her reputation began to be pulled to pieces, the\\n\\t\\t\\t\\twife of 'Aziz invited all ladies in society to a grand\\n\\t\\t\\t\\tbanquet. We can imagine them reclining at ease after the\\n\\t\\t\\t\\tmanner of fashionable banquets. When dessert was reached\\n\\t\\t\\t\\tand the talk flowed freely about the gossip and scandal\\n\\t\\t\\t\\twhich made their hostess interesting, they were just\\n\\t\\t\\t\\tabout to cut the fruit with their knives, when, behold!\\n\\t\\t\\t\\tJoseph was brought into their midst. Imagine the\\n\\t\\t\\t\\tconsternation which his beauty caused, and the havoc it\\n\\t\\t\\t\\tplayed with their hearts! \"Ah!\" thought the wife of\\n\\t\\t\\t\\t'Aziz, \"now is your hypocrisy self-exposed! What about\\n\\t\\t\\t\\tyour reproaches to me? You have yourselves so lost your\\n\\t\\t\\t\\tself-control that you have cut your fingers!\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "32",
    "NoteID": "1680",
    "Body": "Her speech is subtle, and shows that any repentance or\\n\\t\\t\\t\\tcompunction she may have felt is blotted out by the\\n\\t\\t\\t\\tcollective crowd mentality into which she has\\n\\t\\t\\t\\tdeliberately invited herself to fall. Her speech falls\\n\\t\\t\\t\\tinto two parts, with a hiatus between, which I have\\n\\t\\t\\t\\tmarked by the punctuation mark ( ... ). In the first part\\n\\t\\t\\t\\tthere is a note of triumph, as much as to say, \"Now you\\n\\t\\t\\t\\tsee! mine was no vulgar passion! you are just as\\n\\t\\t\\t\\tsusceptible! you would have done the same thing!\" Finding\\n\\t\\t\\t\\tencouragement from their passion and their\\n\\t\\t\\t\\tfellow-feeling, she openly avows as a woman amongst women\\n\\t\\t\\t\\twhat she would have been ashamed to acknowledge to others\\n\\t\\t\\t\\tbefore. She falls a step lower and boasts of it. A step\\n\\t\\t\\t\\tlower still, and she sneers at Joseph's innocence, his\\n\\t\\t\\t\\tfirmness in saving himself guiltless! There is a pause.\\n\\t\\t\\t\\tThe tide of passion rises still higher, and the dreadful\\n\\t\\t\\t\\tsecond part of her speech begins. It is a sort of joint\\n\\t\\t\\t\\tconsultation, though she speaks in monologue. The women\\n\\t\\t\\t\\tall agree that no man has a right to resist their\\n\\t\\t\\t\\tsolicitations. Beauty spurned is the highest crime. And\\n\\t\\t\\t\\tso now she rises to the height of tragic guilt and\\n\\t\\t\\t\\tthreatens Joseph. She forgets all her finer feelings, and\\n\\t\\t\\t\\tis overpowered by brute passion. After all, he is a slave\\n\\t\\t\\t\\tand must obey his mistress! Or, there is prison, and the\\n\\t\\t\\t\\tcompany of the vilest. Poor, deluded, fallen creature!\\n\\t\\t\\t\\tShe sank lower than herself, in seeking the support of\\n\\t\\t\\t\\tthe crowd around her! What pain and suffering and sorrow\\n\\t\\t\\t\\tcan expiate the depth of this crime?"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "33",
    "NoteID": "1681",
    "Body": "\"To which they invite me.\" Notice it is now \"they\" not\\n\\t\\t\\t\\t\"she\". Where there was the snare of one woman before, it\\n\\t\\t\\t\\tis now the collective snare of many women."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "33",
    "NoteID": "1682",
    "Body": "Joseph's speech is characteristic. Like a true Prophet of\\n\\t\\t\\t\\tAllah, he takes refuge in Allah. He knows the weakness of\\n\\t\\t\\t\\thuman nature. He would not pit his own strength against\\n\\t\\t\\t\\tthe whole assault of evil. He will rely on Allah to tum\\n\\t\\t\\t\\tevil away from him, and praise Him alone for any success\\n\\t\\t\\t\\the achieves in his fight. It is only the ignorant who do\\n\\t\\t\\t\\tnot know man's weakness and Allah's strength!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "34",
    "NoteID": "1683",
    "Body": "Joseph was saved from the wiles of the women, which would\\n\\t\\t\\t\\thave degraded him. But more, his truth and character were\\n\\t\\t\\t\\tcompletely vindicated in the eyes of all concerned by the\\n\\t\\t\\t\\tavowal of the wife of the 'Aziz ."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "35",
    "NoteID": "1684",
    "Body": "When Joseph's character was completely vindicated, there\\n\\t\\t\\t\\twas no disgrace to him in being sent to prison after\\n\\t\\t\\t\\tthat. On the contrary the blame now would attach to those\\n\\t\\t\\t\\twho for their own selfish motives restricted his liberty\\n\\t\\t\\t\\tfor a time. As a matter of fact various motives on the\\n\\t\\t\\t\\tpart of the many actors in this drama converged towards\\n\\t\\t\\t\\tthat end. For Joseph prison was better than the\\n\\t\\t\\t\\timportunities of the women, and now, not one woman, but\\n\\t\\t\\t\\tall society women were after him. To the women themselves\\n\\t\\t\\t\\tit looked as if that was a lever which they could use to\\n\\t\\t\\t\\tforce his compliance. Vain, deluded creatures, to think\\n\\t\\t\\t\\tthat a man of God could be forced from the path of\\n\\t\\t\\t\\trectitude by threats or bribes. To the 'Aziz it appears\\n\\t\\t\\t\\tas if it might be in his wife's best interests that he\\n\\t\\t\\t\\tshould disappear from her view in prison. The decisive\\n\\t\\t\\t\\tfactor was the view of the men generally, who were\\n\\t\\t\\t\\talarmed at the consternation he had caused among the\\n\\t\\t\\t\\twomen. They knew that Joseph was righteous: they had seen\\n\\t\\t\\t\\tthe Signs of Allah in his wonderful personality and his\\n\\t\\t\\t\\tcalm and confident fortitude. But, it was argued, it was\\n\\t\\t\\t\\tbetter that one man (even if righteous) should suffer in\\n\\t\\t\\t\\tprison rather than that many should suffer from the\\n\\t\\t\\t\\textraordinary disturbance he was unwittingly causing in\\n\\t\\t\\t\\ttheir social life. Not for the first nor for the last\\n\\t\\t\\t\\ttime did the righteous suffer plausibly for the guilt of\\n\\t\\t\\t\\tthe guilty. And so Joseph went to prison-for a time."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "36",
    "NoteID": "1685",
    "Body": "Now opens another chapter in Joseph's life. The Plan of\\n\\t\\t\\t\\tAllah develops. The wicked might plot; the weak might be\\n\\t\\t\\t\\tswayed by specious arguments; but everything is used by\\n\\t\\t\\t\\tthe Universal Plan for its own beneficent purposes.\\n\\t\\t\\t\\tJoseph must get into touch with the Pharaoh, in order to\\n\\t\\t\\t\\twork out the salvation of Egypt, and yet it must be\\n\\t\\t\\t\\tthrough no obligation to smaller men. And he must diffuse\\n\\t\\t\\t\\this personality and teach the truth to men of all sorts\\n\\t\\t\\t\\tin prison."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "36",
    "NoteID": "1686",
    "Body": "Two men came to the prison about the same time as Joseph.\\n\\t\\t\\t\\tThey were both apparently officers of the king (the\\n\\t\\t\\t\\tPharaoh), who had incurred his wrath. One was a\\n\\t\\t\\t\\tcup-bearer (or butler or chief steward) whose duty was to\\n\\t\\t\\t\\tprepare the king's wines and drinks. The other was the\\n\\t\\t\\t\\tking's baker, whose duty was to prepare the king's bread.\\n\\t\\t\\t\\tThey were both in disgrace. The former dreamed that he\\n\\t\\t\\t\\twas again carrying on his duties and pressing wine; the\\n\\t\\t\\t\\tlatter that he was carrying bread, but it did not reach\\n\\t\\t\\t\\this master, for the birds ate of it."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "36",
    "NoteID": "1687",
    "Body": "Both these men saw the Signs of Allah about Joseph. They\\n\\t\\t\\t\\tfelt not only that he had wisdom, but that he was kind\\n\\t\\t\\t\\tand benevolent, and would give of his wisdom even to\\n\\t\\t\\t\\tstrangers like themselves. They therefore told him their\\n\\t\\t\\t\\tdreams and asked him to interpret them."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "37",
    "NoteID": "1688",
    "Body": "The dream of one foreboded good to him, and of the other,\\n\\t\\t\\t\\tevil to him. It was good that each should prepare for his\\n\\t\\t\\t\\tfate. But Joseph's mission was far higher than that of\\n\\t\\t\\t\\tmerely foretelling events. He must teach the truth of\\n\\t\\t\\t\\tAllah and the faith in the Hereafter to both men. He does\\n\\t\\t\\t\\tthat first before he talks of the events of their\\n\\t\\t\\t\\tphenomenal life. And yet he does it so tenderly. He does\\n\\t\\t\\t\\tnot tantalise them. In effect he says. \"You shall learn\\n\\t\\t\\t\\teverything before our next meal, but let me first teach\\n\\t\\t\\t\\tyou Faith!\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "37",
    "NoteID": "1689",
    "Body": "Joseph does not preach a pompous sermon, or claim any\\n\\t\\t\\t\\tcredit to himself for placing himself at their service.\\n\\t\\t\\t\\tHe is just doing his duty, and the highest good he can do\\n\\t\\t\\t\\tto them is to teach them Faith."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "37",
    "NoteID": "1690",
    "Body": "These men were Egyptians, perhaps steeped in materialism,\\n\\t\\t\\t\\tidolatry, and polytheism. He must teach them the Gospel\\n\\t\\t\\t\\tof Unity. And he does it simply, by appealing to his own\\n\\t\\t\\t\\texperience. I have found the Lord good; in prosperity and\\n\\t\\t\\t\\tadversity I have been supported by Faith; in life no man\\n\\t\\t\\t\\tcan live by error or evil; perhaps one of you had done\\n\\t\\t\\t\\tsome wrong for which you find yourself here; perhaps one\\n\\t\\t\\t\\tof you is innocent in either case, will you not accept\\n\\t\\t\\t\\tFaith and live for ever?"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "38",
    "NoteID": "1691",
    "Body": "Again the same note of personal modesty. 'You may think I\\n\\t\\t\\t\\tam as young as you, or younger. Yes, but I have the\\n\\t\\t\\t\\theritage of great men renowned for wisdom and truth, such\\n\\t\\t\\t\\tas Abraham, Isaac, Jacob. Surely what they knew is worthy\\n\\t\\t\\t\\tof respect. Never did they swerve a hair's breadth from\\n\\t\\t\\t\\tthe Gospel of Unity. It is not that we boast. It was\\n\\t\\t\\t\\tAllah's grace that taught us and Allah's grace is\\n\\t\\t\\t\\tteaching all mankind. But men show their ingratitude by\\n\\t\\t\\t\\tinventing other so-called gods'."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "39",
    "NoteID": "1692",
    "Body": "Note the personal touch again. 'Are we not also\\n\\t\\t\\t\\tcompanions in misfortune? And may I not speak to you on\\n\\t\\t\\t\\tterms of perfect equality,-as one prisoner to another?\\n\\t\\t\\t\\tWell then, do you really think a conflict of\\n\\t\\t\\t\\theterogeneous gods is better than Allah, the One (and\\n\\t\\t\\t\\tOnly), Whose power is supreme and irresistible?'"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "40",
    "NoteID": "1693",
    "Body": "'If you name other gods, they are nothing but your\\n\\t\\t\\t\\tinventions,-names which you and your fathers put forward\\n\\t\\t\\t\\twithout any reality behind them. Who gave you authority\\n\\t\\t\\t\\tto do any such thing? The only reality is Allah.\\n\\t\\t\\t\\tAuthority can come from Him alone. It is only for Him to\\n\\t\\t\\t\\tcommand. And He has distinctly commanded you to worship\\n\\t\\t\\t\\tnone other than Him. That is the only religion that is\\n\\t\\t\\t\\tright,-that has stood and will stand and endure for ever.\\n\\t\\t\\t\\tHe has revealed it at all times by His Messengers and by\\n\\t\\t\\t\\tHis Signs. If men fail to understand, it is their own\\n\\t\\t\\t\\tfault."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "41",
    "NoteID": "1694",
    "Body": "Having fulfilled his great duty, that touching the things\\n\\t\\t\\t\\tof the spirit, Joseph now passes on, and comes to the\\n\\t\\t\\t\\tthings in which they were immediately interested,-the\\n\\t\\t\\t\\tquestions which they had asked him about their dreams and\\n\\t\\t\\t\\twhat they prognosticated of their immediate future.\\n\\t\\t\\t\\tNotice how Joseph again puts himself into sympathy with\\n\\t\\t\\t\\tthem by repeating the phrase of camaraderie. \"my two\\n\\t\\t\\t\\tcompanions of the prison!\" For one he has good news, and\\n\\t\\t\\t\\tfor the other, bad news. He does not mince matters or\\n\\t\\t\\t\\twaste words. He just barely tells the truth, hoping that\\n\\t\\t\\t\\tthe higher spiritual truths of which he has spoken will\\n\\t\\t\\t\\tappear in their eyes, too, as of more importance than\\n\\t\\t\\t\\tmere earthly triumphs or disasters,-(in Kipling's words)\\n\\t\\t\\t\\t\"both impostors all the same.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "41",
    "NoteID": "1695",
    "Body": "The cup-bearer had perhaps been proved innocent of the\\n\\t\\t\\t\\tcrime which had been charged against him, and was to be\\n\\t\\t\\t\\trestored to the favour of the Pharaoh. He was to carry\\n\\t\\t\\t\\tthe cup and be the king's confidante again. How much more\\n\\t\\t\\t\\tgood he could do now, after the spiritual influence he\\n\\t\\t\\t\\thad imbibed from Joseph the man of God! He was more\\n\\t\\t\\t\\tfortunate in having had Joseph's company than in being\\n\\t\\t\\t\\trestored to his intimate position with the king! Yet he\\n\\t\\t\\t\\twas not a perfect man, as we shall see presently."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "41",
    "NoteID": "1696",
    "Body": "For the baker, alas! he had bad news, and he tells it\\n\\t\\t\\t\\tdirectly without tantalizing him. Perhaps he had been\\n\\t\\t\\t\\tfound guilty-perhaps he had been really guilty-of some\\n\\t\\t\\t\\tact of embezzlement or of joining in some palace\\n\\t\\t\\t\\tintrigue, and he was to die a malefactor's death on the\\n\\t\\t\\t\\tcross, following by exposure to birds of the air-vultures\\n\\t\\t\\t\\tpecking away at his eyes and cheeks, and all that had\\n\\t\\t\\t\\tbeen his face and head! Poor man! If he was guilty,\\n\\t\\t\\t\\tJoseph had taught him repentance, and we should like to\\n\\t\\t\\t\\tthink that he lost in this life but gained in the next.\\n\\t\\t\\t\\tIf he was innocent, the cruel death did not affect him.\\n\\t\\t\\t\\tJoseph had shown him a higher and more lasting hope in\\n\\t\\t\\t\\tthe Hereafter."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "42",
    "NoteID": "1697",
    "Body": "Joseph never mentioned himself in interpreting the dream,\\n\\t\\t\\t\\tnor ever thought of himself in his kindness to his\\n\\t\\t\\t\\tfellow-sufferers in prison. It was afterwards, when the\\n\\t\\t\\t\\tcup-bearer's dream came true, and he was being released\\n\\t\\t\\t\\ton being restored to favour, that we can imagine him\\n\\t\\t\\t\\ttaking an affectionate leave of Joseph, and even asking\\n\\t\\t\\t\\thim in his elation if he could do anything for Joseph.\\n\\t\\t\\t\\tJoseph had no need of earthly favours,- least of all,\\n\\t\\t\\t\\tfrom kings or their favourites. The divine grace was\\n\\t\\t\\t\\tenough for him. But he had great work to do, which he\\n\\t\\t\\t\\tcould not do in prison-work for Egypt and her king, and\\n\\t\\t\\t\\tthe world at large. If the cup-bearer could mention him\\n\\t\\t\\t\\tto the king, not by way of recommendation, but because\\n\\t\\t\\t\\tthe king's own justice was being violated in keeping an\\n\\t\\t\\t\\tinnocent man in prison, perhaps that might help to\\n\\t\\t\\t\\tadvance the cause of the king and of Egypt. And so he\\n\\t\\t\\t\\tsaid, \"Mention me to Pharaoh.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "42",
    "NoteID": "1698",
    "Body": "The eternal Plan does not put Allah's Prophets under\\n\\t\\t\\t\\tobligations to men commanding mere worldly favour or\\n\\t\\t\\t\\tearthly power. If they are given a chance, the obligation\\n\\t\\t\\t\\tis on the worldly men, however highly placed...In this\\n\\t\\t\\t\\tcase, the poor cup-bearer was but human. When he was in\\n\\t\\t\\t\\tthe midst of the Court, he forgot the poor\\n\\t\\t\\t\\tfellow-prisoner languishing in prison. In this he yielded\\n\\t\\t\\t\\tto the lower part of his nature, which is guided by\\n\\t\\t\\t\\tSatan."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "42",
    "NoteID": "1699",
    "Body": "A few (more) years: bidh' in Arabic signifies a small\\n\\t\\t\\t\\tindefinite number, say up to 3, 5, 7 or 9 years."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "43",
    "NoteID": "1700",
    "Body": "The Pharaoh is holding a Council. His confidential\\n\\t\\t\\t\\tadviser the cup-bearer is present. The Pharaoh relates\\n\\t\\t\\t\\this double dream,-of seven fat kine being devoured by\\n\\t\\t\\t\\tseven lean ones, and of seven fine full green ears of\\n\\t\\t\\t\\tcorn (presumably being devoured) by seven dry withered\\n\\t\\t\\t\\tears."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "44",
    "NoteID": "1701",
    "Body": "No one in the Council apparently wanted to take the\\n\\t\\t\\t\\tresponsibility either of interpreting the dream, or of\\n\\t\\t\\t\\tcarrying out any measures consequent on the\\n\\t\\t\\t\\tinterpretation."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "45",
    "NoteID": "1702",
    "Body": "At length the cup-bearer's conscience was awakened. He\\n\\t\\t\\t\\tthought of Joseph. He (Joseph) was a truthful man, and\\n\\t\\t\\t\\tthe cup-bearer knew by personal experience how skillful\\n\\t\\t\\t\\the was in the interpretation of dreams. Perhaps he could\\n\\t\\t\\t\\tget him released at this juncture by getting him to\\n\\t\\t\\t\\tinterpret the king's dream. If he had been frank,\\n\\t\\t\\t\\tstraight, and direct, he would have mentioned Joseph at\\n\\t\\t\\t\\tonce, and presented him to Pharaoh. But he had worldly\\n\\t\\t\\t\\tsubtlety. He wanted some credit for himself, at the same\\n\\t\\t\\t\\ttime that he fulfilled an old obligation. His petty\\n\\t\\t\\t\\tconscience would be satisfied if he got Joseph's release,\\n\\t\\t\\t\\tbut meanwhile he wanted to see how much attention he\\n\\t\\t\\t\\tcould draw to himself in the court. So he just asked\\n\\t\\t\\t\\tpermission to withdraw in order to find the\\n\\t\\t\\t\\tinterpretation. He went straight to the prison, and\\n\\t\\t\\t\\taddressed himself to Joseph, as in the following verse."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "46",
    "NoteID": "1703",
    "Body": "The speech must have been longer, to explain the\\n\\t\\t\\t\\tcircumstances. We are just given the points. From Joseph\\n\\t\\t\\t\\the conceals nothing. He knows that Joseph knows more than\\n\\t\\t\\t\\thimself. He tells Joseph that if he got the meaning, he\\n\\t\\t\\t\\twould go and tell the Council. It would be impertinent\\n\\t\\t\\t\\tfor the cup-bearer to hold out to Joseph, the Prophet of\\n\\t\\t\\t\\tAllah, the bribe of the hope of his release. Notice how\\n\\t\\t\\t\\tblandly he avoids referring to his own lapse in having\\n\\t\\t\\t\\tforgotten Joseph so long, and how the magnanimous Joseph\\n\\t\\t\\t\\thas not a word of reproach, but gets straight on with the\\n\\t\\t\\t\\tinterpretation."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "47",
    "NoteID": "1704",
    "Body": "Joseph not only shows what will happen, but, unasked,\\n\\t\\t\\t\\tsuggests the measures to be taken for dealing with the\\n\\t\\t\\t\\tcalamity when it comes. There will be seven years of\\n\\t\\t\\t\\tabundant harvest. With diligent cultivation they should\\n\\t\\t\\t\\tget bumper crops. Of them they should take a little for\\n\\t\\t\\t\\ttheir sustenance and store the rest in the ear, the\\n\\t\\t\\t\\tbetter to preserve it from the pests that attack\\n\\t\\t\\t\\tcorn-heaps when they have passed through the threshing\\n\\t\\t\\t\\tfloor."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "48",
    "NoteID": "1705",
    "Body": "There will follow seven years of dreadful famine, which\\n\\t\\t\\t\\twill devour all the stores which they will have laid by\\n\\t\\t\\t\\tin the good years. They must be careful, even during the\\n\\t\\t\\t\\tfamine, not to consume all the grain; they must by\\n\\t\\t\\t\\tspecial arrangement save a little for seed, lest they\\n\\t\\t\\t\\tshould be helpless even when the Nile brought down\\n\\t\\t\\t\\tabundant waters from the rains at its sources."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "49",
    "NoteID": "1706",
    "Body": "This is a symbol of a very abundant year, following the\\n\\t\\t\\t\\tseven years of drought. The Nile must have brought\\n\\t\\t\\t\\tabundant fertilising waters and silt from its upper\\n\\t\\t\\t\\treaches, and there was probably some rain also in Lower\\n\\t\\t\\t\\tEgypt. The vine and the olive trees, which must have\\n\\t\\t\\t\\tsuffered in the drought, now revived, and yielded their\\n\\t\\t\\t\\tjuice and their off, among the annuals, also, the oil\\n\\t\\t\\t\\tseeds such as , sesamum, and the castor oil plant, must\\n\\t\\t\\t\\thave been grown, as there was irrigated land and to spare\\n\\t\\t\\t\\tfrom the abundant grain crops. And the people's spirits\\n\\t\\t\\t\\trevived, to enjoy the finer products of the earth, when\\n\\t\\t\\t\\ttheir absolute necessities had been more than met in\\n\\t\\t\\t\\ttheir grain crops."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "50",
    "NoteID": "1707",
    "Body": "The cup-bearer must have reported Joseph's interpretation\\n\\t\\t\\t\\tto the king, and the king naturally wanted to see Joseph\\n\\t\\t\\t\\thimself. He sent a messenger to fetch him."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "50",
    "NoteID": "1708",
    "Body": "The king's messenger must have expected that a prisoner\\n\\t\\t\\t\\twould be only too overjoyed at the summons of the king.\\n\\t\\t\\t\\tBut Joseph, sure of himself, wanted some assurance that\\n\\t\\t\\t\\the would be safe from the sort of nagging and persecution\\n\\t\\t\\t\\tto which he had been subjected by the ladies. We saw in\\n\\t\\t\\t\\tverse 33 above that he preferred prison to their\\n\\t\\t\\t\\tsolicitations. He must therefore know what was in the\\n\\t\\t\\t\\tmind of the women now."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "50",
    "NoteID": "1709",
    "Body": "If the king (\"thy Lord\") did not know of all the snares\\n\\t\\t\\t\\twhich had been laid for Joseph by the ladies. Allah (\"my\\n\\t\\t\\t\\tLord\") knew all their secret motives and plots."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "51",
    "NoteID": "1710",
    "Body": "Joseph's message was conveyed by the messenger to the\\n\\t\\t\\t\\tking, who sent for the ladies concerned. Among them came\\n\\t\\t\\t\\tthe wife of the 'Aziz. \"What was this affair?\" said the\\n\\t\\t\\t\\tking: \"Tell me the whole truth\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "51",
    "NoteID": "1711",
    "Body": "The wife of the 'Aziz stood by, while the other ladies\\n\\t\\t\\t\\tanswered. Their answer acknowledged the truth of Joseph's\\n\\t\\t\\t\\tinnocence and high principles. When they had done, she\\n\\t\\t\\t\\tbegan. She did not mince matters. She acknowledged her\\n\\t\\t\\t\\town guilt, freely and frankly."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "52",
    "NoteID": "1712",
    "Body": "I construe verses 52 and 53 to be a continuation of the\\n\\t\\t\\t\\tspeech of the 'Aziz's wife and have translated\\n\\t\\t\\t\\taccordingly. There is both good reason and authority\\n\\t\\t\\t\\t(e.g., Ibn Kathir) for this. But the majority of\\n\\t\\t\\t\\tCommentators construe verses 52-53 to be spoken by\\n\\t\\t\\t\\tJoseph, in which case they would mean that Joseph was\\n\\t\\t\\t\\treferring to his fidelity to the 'Aziz, that he had never\\n\\t\\t\\t\\ttaken advantage of his absence to play false with his\\n\\t\\t\\t\\twife, although he (Joseph) was human and liable to err.\\n\\t\\t\\t\\tIn my view the 'Aziz's wife while fully reprobating her\\n\\t\\t\\t\\town guilty conduct, claims that she has at least been\\n\\t\\t\\t\\tconstant, and that she hopes for mercy, forgiveness, and\\n\\t\\t\\t\\tthe capacity to understand at last what true love is.\\n\\t\\t\\t\\tWhatever false charge she made, she made it in a moment\\n\\t\\t\\t\\tof passion and to his face, (never in cold blood, or\\n\\t\\t\\t\\tbehind his back). Guide the snare of the false ones, i.e.\\n\\t\\t\\t\\tallow such snare to attain its goal. A) Ammara: prone,\\n\\t\\t\\t\\timpelling, headstrong, passionate. See n. 5810 to lxxv.\\n\\t\\t\\t\\t2."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "53",
    "NoteID": "1713",
    "Body": "See n. 1712. I construe this verse to be a continuation\\n\\t\\t\\t\\tof the speech of the wife of the 'Aziz. It is more\\n\\t\\t\\t\\tappropriate to her than to Joseph."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "54",
    "NoteID": "1714",
    "Body": "Joseph had not yet appeared before the king. The king's\\n\\t\\t\\t\\torder in the same terms in verse 50 above had led to a\\n\\t\\t\\t\\tmessage from Joseph and the subsequent public proceedings\\n\\t\\t\\t\\twith the ladies. Now that Joseph's innocence, wisdom,\\n\\t\\t\\t\\ttruth, and trustworthiness had been Proved, and confirmed\\n\\t\\t\\t\\tby the splendid tribute of the courtier's wife, and\\n\\t\\t\\t\\tJoseph's own manly bearing before the king, the king was\\n\\t\\t\\t\\tmuch impressed, and took him specially to serve about his\\n\\t\\t\\t\\town person as his trusty and confidential Wazir. If, as\\n\\t\\t\\t\\tis probable, the 'Aziz had by this time died (for he is\\n\\t\\t\\t\\tnever mentioned again) Joseph succeeded to his office,\\n\\t\\t\\t\\tand he is addressed as 'Aziz in verse 78 below. But\\n\\t\\t\\t\\tJoseph got more than his rank and powers, as specially\\n\\t\\t\\t\\tselected to carry out a great emergency policy to meet\\n\\t\\t\\t\\tthe very difficult times of depression that were\\n\\t\\t\\t\\tforetold. He was given plenary powers and the fullest\\n\\t\\t\\t\\tconfidence that a king could give to his most trusted and\\n\\t\\t\\t\\tbest-proved Wazir or Prime Minister, with special access\\n\\t\\t\\t\\tto his Person, like a Grand Chamberlain."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "54",
    "NoteID": "1715",
    "Body": "Who was this Pharaoh, and what approximate date could we\\n\\t\\t\\t\\tassign to him? He was probably a king of the Hyksos\\n\\t\\t\\t\\tDynasty, somewhere between the 19th and the 17th century\\n\\t\\t\\t\\tB.C."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "55",
    "NoteID": "1716",
    "Body": "Joseph had been given plenary authority by the king. He\\n\\t\\t\\t\\tcould have enjoyed his dignity, drawn his emoluments, put\\n\\t\\t\\t\\tthe hard and perhaps unpopular work on the shoulders of\\n\\t\\t\\t\\tothers, and kept to himself the glitter and the kudos.\\n\\t\\t\\t\\tBut that was not his way, nor can it indeed be the way of\\n\\t\\t\\t\\tany one who wants to do real service. He undertook the\\n\\t\\t\\t\\thardest and most unpopular task himself. Such a task was\\n\\t\\t\\t\\tthat of organising reserves in times of plenty, against\\n\\t\\t\\t\\tthe lean years to come. He deliberately asked to be put\\n\\t\\t\\t\\tin charge of the granaries and store-houses, and the\\n\\t\\t\\t\\tdrudgery of establishing them and guarding them, for the\\n\\t\\t\\t\\tsimple reason that he understood that need better than\\n\\t\\t\\t\\tany one else, and was prepared to take upon himself\\n\\t\\t\\t\\trather than throw on to another the obloquy of\\n\\t\\t\\t\\trestricting supplies in times of plenty."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "56",
    "NoteID": "1717",
    "Body": "What a wonderful example of the working of divine\\n\\t\\t\\t\\tProvidence! The boy whom his jealous brothers got rid of\\n\\t\\t\\t\\tby selling him into slavery for a miserable price becomes\\n\\t\\t\\t\\tthe most trusted dignitary in a foreign land, chief\\n\\t\\t\\t\\tminister in one of the greatest empires of the world of\\n\\t\\t\\t\\tthat day. And this not for himself only, but for his\\n\\t\\t\\t\\tfamily, and for that noble example of righteousness and\\n\\t\\t\\t\\tstrenuous service, which he was to set for all time.\\n\\t\\t\\t\\tAccording to tradition, Joseph's age was barely 30 at\\n\\t\\t\\t\\tthat time! As when, or where he pleased: haithu refers to\\n\\t\\t\\t\\tmanner, time, or place. He had almost absolute powers,\\n\\t\\t\\t\\tbut as his fidelity was fully proved (xii. 53) these\\n\\t\\t\\t\\tpowers were for service rather than for self."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "57",
    "NoteID": "1718",
    "Body": "To the righteous, whatever rewards (if any) that come in\\n\\t\\t\\t\\tthis world are welcome for the opportunities of service\\n\\t\\t\\t\\twhich they open out. But the true and best reward is in\\n\\t\\t\\t\\tthe Hereafter."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "58",
    "NoteID": "1719",
    "Body": "Years pass; the times of prosperity go by: famine holds\\n\\t\\t\\t\\tthe land in its grip; and it extends to neighbouring\\n\\t\\t\\t\\tcountries. Joseph's preparations are complete. His\\n\\t\\t\\t\\treserves are ample to meet the calamity. Not only does\\n\\t\\t\\t\\tEgypt bless him, but neighbouring countries send to Egypt\\n\\t\\t\\t\\tto purchase corn. All are received with hospitality, and\\n\\t\\t\\t\\tcorn is sold to them according to judicious measure. Now\\n\\t\\t\\t\\tthere has been one sorrow gnawing at Joseph's heart. His\\n\\t\\t\\t\\tpoor father Jacob! How he must have wept, as indeed he\\n\\t\\t\\t\\tdid, at the loss of his beloved Joseph! And Joseph's\\n\\t\\t\\t\\tlittle brother Benjamin, born of the same mother as\\n\\t\\t\\t\\thimself; would the other ten brothers, not by the same\\n\\t\\t\\t\\tmother, have any affection for him, or would they treat\\n\\t\\t\\t\\thim, as they treated Joseph? How would the whole family\\n\\t\\t\\t\\tbe in these hard times? A sort of answer came when the\\n\\t\\t\\t\\tten selfish brothers, driven by famine, came from Canaan\\n\\t\\t\\t\\tto buy corn. Joseph, though so great a man, kept the\\n\\t\\t\\t\\tdetails of the famine department in his own hands,\\n\\t\\t\\t\\totherwise there might have been waste. But to the public\\n\\t\\t\\t\\the was a mighty Egyptian administrator, probably in\\n\\t\\t\\t\\tEgyptian dress, and with all the paraphernalia of his\\n\\t\\t\\t\\trank about him. When his brothers came, he knew them, but\\n\\t\\t\\t\\tthey did not know he was Joseph. In their thoughts was\\n\\t\\t\\t\\tprobably some menial slave in a remote household, perhaps\\n\\t\\t\\t\\talready starved to death in these hard times!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "59",
    "NoteID": "1720",
    "Body": "Joseph treated his brothers liberally. Perhaps he\\n\\t\\t\\t\\tcondescended to enter into conversation with these\\n\\t\\t\\t\\tstrangers, and enquired about their family. The ten\\n\\t\\t\\t\\tbrothers had come. Had they left a father behind them?\\n\\t\\t\\t\\tWhat sort of a person was he? Very aged? Well, of course\\n\\t\\t\\t\\the could not come. Had they any other brothers? Doubtless\\n\\t\\t\\t\\tthe ten brothers said nothing about their lost Joseph, or\\n\\t\\t\\t\\ttold some lie about him. But perhaps their host's kindly\\n\\t\\t\\t\\tinsistence brought Benjamin into the conversation. How\\n\\t\\t\\t\\told was he? Why had they not brought him? Would they\\n\\t\\t\\t\\tbring him next time? Indeed they must, or they would get\\n\\t\\t\\t\\tno more corn, and he-the great Egyptian Wazir-would not\\n\\t\\t\\t\\teven see them."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "61",
    "NoteID": "1721",
    "Body": "The brothers said: \"Certainly, we shall try to beg him of\\n\\t\\t\\t\\tour father, and bring him away with us; we shall\\n\\t\\t\\t\\tcertainly comply with your desire.\" In reality they\\n\\t\\t\\t\\tprobably loved Benjamin no more than they loved Joseph.\\n\\t\\t\\t\\tBut they must get food when the present supply was\\n\\t\\t\\t\\texhausted, and they must humour the great Egyptian Wazir.\\n\\t\\t\\t\\tNote that they do not call Jacob \"our father\" but \"his\\n\\t\\t\\t\\tfather\"; how little they loved their aged father, whom\\n\\t\\t\\t\\tthey identified with Joseph and Benjamin! Their trial and\\n\\t\\t\\t\\ttheir instruction in their duties is now being undertaken\\n\\t\\t\\t\\tby Joseph."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "62",
    "NoteID": "1722",
    "Body": "Bidha'at: stock in trade; capital with which business is\\n\\t\\t\\t\\tcarried on; money-when it is used as capital for trade.\\n\\t\\t\\t\\tIt is better here to suppose that they were bartering\\n\\t\\t\\t\\tgoods for grain. Cf. xii. 19."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "62",
    "NoteID": "1723",
    "Body": "It was most important for Joseph's plan that they should\\n\\t\\t\\t\\tcome back. If they came back at all, they could not come\\n\\t\\t\\t\\twithout Benjamin after what he had told them. As an\\n\\t\\t\\t\\tadditional incentive to their coming back, he returns the\\n\\t\\t\\t\\tprice of the grain in such a way that they should find it\\n\\t\\t\\t\\tin their saddle-bags when they reach home."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "63",
    "NoteID": "1724",
    "Body": "On their return they no doubt told Jacob all that had\\n\\t\\t\\t\\ttranspired. But to beg Benjamin of him was no easy\\n\\t\\t\\t\\tmatter, as Jacob did not trust them and had no cause to\\n\\t\\t\\t\\ttrust them after their treatment of Joseph, So they use\\n\\t\\t\\t\\tthe argument of urgent necessity for all it is worth."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "64",
    "NoteID": "1725",
    "Body": "I construe Jacob's answer to be a flat refusal to let\\n\\t\\t\\t\\tBenjamin go with them. It would be like the former\\n\\t\\t\\t\\toccasion when he trusted Joseph with them and they lost\\n\\t\\t\\t\\thim. Did they talk of taking care of him? The only\\n\\t\\t\\t\\tprotection that he trusted was that of Allah. He at least\\n\\t\\t\\t\\tshowed mercy to old and young alike. Did man show such\\n\\t\\t\\t\\tmercy? Witness his sad old age and his lost little\\n\\t\\t\\t\\tJoseph! Would they bring down \"his grey hairs with sorrow\\n\\t\\t\\t\\tto the grave?\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "65",
    "NoteID": "1726",
    "Body": "The ten brothers did not take their father's refusal as\\n\\t\\t\\t\\tfinal. They opened their saddle-bags, and found that the\\n\\t\\t\\t\\tprice they had paid for their provisions had been\\n\\t\\t\\t\\treturned to them. They had got the grain free! What more\\n\\t\\t\\t\\tcould they desire? The spell which Joseph had woven now\\n\\t\\t\\t\\tworked. If they only went back, this kind Wazir would\\n\\t\\t\\t\\tgive more grain if they pleased him. And the only way to\\n\\t\\t\\t\\tplease him was to take back their younger brother with\\n\\t\\t\\t\\tthem. It would cost them nothing. Judging by past\\n\\t\\t\\t\\texperience they would get a whole camel's load of grain\\n\\t\\t\\t\\tnow. And so they stated their case to the aged father."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "65",
    "NoteID": "1727",
    "Body": "Two meanings are possible,-either or perhaps both. 'What\\n\\t\\t\\t\\twe have brought now is nothing compared to what we shall\\n\\t\\t\\t\\tget if we humour the whim of the Egyptian Wazir. And,\\n\\t\\t\\t\\tmoreover, Egypt seems to have plenty of grain stored up.\\n\\t\\t\\t\\tWhat is a camel-load to her Wazir to give away?'"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "66",
    "NoteID": "1728",
    "Body": "The appeal to the family's needs in the time of famine at\\n\\t\\t\\t\\tlength made Jacob relent, but he exacted a solemn promise\\n\\t\\t\\t\\tfrom the brothers, under the most religious sanctions,\\n\\t\\t\\t\\tthat they would bring Benjamin back to him, unless they\\n\\t\\t\\t\\twere themselves prevented, as the Insurance Policies say\\n\\t\\t\\t\\t\"by an act of God,\" so that they became really powerless.\\n\\t\\t\\t\\tTo that promise Jacob called Allah to witness."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "66",
    "NoteID": "1729",
    "Body": "This is more than a formula. Allah is invoked as present\\n\\t\\t\\t\\tand witnessing the bargain, and to Him both parties make\\n\\t\\t\\t\\tover the affair to arrange and fulfil."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "67",
    "NoteID": "1730",
    "Body": "The Commentators refer to a Jewish or Eastern custom or\\n\\t\\t\\t\\tsuperstition which forbade members of a numerous family\\n\\t\\t\\t\\tto go together in a mass for fear of \"the evil eye\". But\\n\\t\\t\\t\\tapart from East or West, or custom or superstition, it\\n\\t\\t\\t\\twould be ridiculous for any large family of ten or eleven\\n\\t\\t\\t\\tto parade together in a procession among strangers. But\\n\\t\\t\\t\\tthere was even a better reason in this particular case,\\n\\t\\t\\t\\twhich made Jacob's advice sound, and Jacob was, as stated\\n\\t\\t\\t\\tin the next verse, a man of knowledge and experience.\\n\\t\\t\\t\\tHere were eleven strangers dressed alike, in a dress not\\n\\t\\t\\t\\tof the country, talking a strange language, coming in a\\n\\t\\t\\t\\ttime of stress, on an errand for which they had no\\n\\t\\t\\t\\tcredentials. Would they not attract undue attention and\\n\\t\\t\\t\\tsuspicion if they went together? Would they not be taken\\n\\t\\t\\t\\tfor spies?-or for men bent on some mischief, theft, or\\n\\t\\t\\t\\torganised crime? Such a suspicion is referred to in verse\\n\\t\\t\\t\\t73 below. By entering separately they would attract\\n\\t\\t\\t\\tlittle attention. Jacob very wisely tells them to take\\n\\t\\t\\t\\tall human precautions. But like a Prophet of Allah he\\n\\t\\t\\t\\twarns them that human precautions would be no good if\\n\\t\\t\\t\\tthey neglect or run counter to far weightier\\n\\t\\t\\t\\tmatters-Allah's Will and Law. Above all, they must try to\\n\\t\\t\\t\\tunderstand and obey this, and their trust should be on\\n\\t\\t\\t\\tAllah rather than on human usages, institutions, or\\n\\t\\t\\t\\tprecautions, however good and reasonable these might be."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "68",
    "NoteID": "1731",
    "Body": "See the last verse and n. 1730. Though they scrupulously\\n\\t\\t\\t\\tobserved their father's injunctions to the letter, their\\n\\t\\t\\t\\thearts were not yet pure, and they got into trouble, as\\n\\t\\t\\t\\tthe later story will show. They had the hardihood to cast\\n\\t\\t\\t\\taspersions on Joseph, not knowing that they were in\\n\\t\\t\\t\\tJoseph's power. And Joseph took a noble revenge by\\n\\t\\t\\t\\tplanning a reunion of the whole family and shaming the\\n\\t\\t\\t\\tten brothers into repentance. He was the instrument for\\n\\t\\t\\t\\tthe fulfilment of Allah's Plan."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "68",
    "NoteID": "1732",
    "Body": "It is a necessity of a Prophet's soul that he should\\n\\t\\t\\t\\tspeak out and teach all that he knows, to the worthy and\\n\\t\\t\\t\\tunworthy alike. This, Jacob did to his unworthy sons, as\\n\\t\\t\\t\\twell as to his worthy sons whom he loved best. It was not\\n\\t\\t\\t\\tfor him as Prophet to guarantee any results. In this case\\n\\t\\t\\t\\the could not save his sons from getting into trouble\\n\\t\\t\\t\\tmerely because they followed the letter of his advice in\\n\\t\\t\\t\\ta small matter. Apply this to the teaching of a greater\\n\\t\\t\\t\\tthan Jacob. Men who literally observe some small\\n\\t\\t\\t\\tinjunctions of the Holy Prophet Muhammad and neglect the\\n\\t\\t\\t\\tgreater principles which he taught cannot blame him for\\n\\t\\t\\t\\ttheir troubles and difficulties. If they examined the\\n\\t\\t\\t\\tmatter, they would find that they brought the troubles on\\n\\t\\t\\t\\tthemselves."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "68",
    "NoteID": "1733",
    "Body": "The Prophets of Allah are full of knowledge,-not as men,\\n\\t\\t\\t\\tbut as taught by the grace of Allah. For men, as such,\\n\\t\\t\\t\\tare (Carlyle said) mostly fools,-devoid of knowledge and\\n\\t\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "69",
    "NoteID": "1734",
    "Body": "The ten brothers, with Benjamin, arrived in Egypt, and\\n\\t\\t\\t\\twaited on the great Wazir. Joseph again received them\\n\\t\\t\\t\\thospitably, even more so than before, as they had\\n\\t\\t\\t\\tcomplied with his request to bring Benjamin. No doubt\\n\\t\\t\\t\\tmany shrewd and probing questions were asked by Joseph,\\n\\t\\t\\t\\tand no doubt it was clear that Benjamin was one apart\\n\\t\\t\\t\\tfrom the other ten. Baidhawi fills up the picture of the\\n\\t\\t\\t\\tgreat feast for us. The guests were seated two by two.\\n\\t\\t\\t\\tBaidhawi was the odd one, and Joseph courteously took him\\n\\t\\t\\t\\tto his own table."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "69",
    "NoteID": "1735",
    "Body": "After the feast the question of lodgings arose. They were\\n\\t\\t\\t\\tto be accommodated two by two. Again Benjamin was the odd\\n\\t\\t\\t\\tone. What more natural than that the Wazir should take\\n\\t\\t\\t\\thim to himself He thus got a chance of privacy with him.\\n\\t\\t\\t\\tHe disclosed his identity to him, charging him to keep it\\n\\t\\t\\t\\ta secret, and to take no notice of any strange doings\\n\\t\\t\\t\\tthat might occur. He must have learnt from Benjamin about\\n\\t\\t\\t\\this father and about the inner doings of the family. He\\n\\t\\t\\t\\tmust get them all together into Egypt under his own eye.\\n\\t\\t\\t\\tHe had a plan, and he proceeded to put it into execution."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "69",
    "NoteID": "1736",
    "Body": "The past tense of Kanu, combined with the aorist of\\n\\t\\t\\t\\tYa'malun, signifies that the reference is to their\\n\\t\\t\\t\\tbrothers' doings, past, present, and future. Benjamin was\\n\\t\\t\\t\\tnot to mind what wrongs they had done in the past, or how\\n\\t\\t\\t\\tthey behaved in the present or the immediate future.\\n\\t\\t\\t\\tJoseph had a plan that required Benjamin's silence in\\n\\t\\t\\t\\tstrange circumstances."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "70",
    "NoteID": "1737",
    "Body": "Joseph's plan was to play a practical joke on them, which\\n\\t\\t\\t\\twould achieve two objects. Immediately it would put them\\n\\t\\t\\t\\tinto some consternation, but nothing comparable to what\\n\\t\\t\\t\\the had suffered at their hands. When the plan was\\n\\t\\t\\t\\tunravelled, it would make them thoroughly ashamed of\\n\\t\\t\\t\\tthemselves, and dramatically bring home their guilt to\\n\\t\\t\\t\\tthem. Secondly, it would give him an excuse to detain\\n\\t\\t\\t\\tBenjamin and bring their aged father into Egypt. He\\n\\t\\t\\t\\tcontrived that a valuable drinking cup should be\\n\\t\\t\\t\\tconcealed in Benjamin's saddle-bag. When it was found\\n\\t\\t\\t\\tafter an ostentatious search, he would detain the\\n\\t\\t\\t\\tsupposed culprit, and attain his object, as the story\\n\\t\\t\\t\\trelates further on."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "73",
    "NoteID": "1738",
    "Body": "As strangers in a strange land, they were liable to be\\n\\t\\t\\t\\tsuspected as spies or men who meditated some unlawful\\n\\t\\t\\t\\tdesign, or some crime, such as theft, which would be\\n\\t\\t\\t\\tcommon in a season of scarcity. The brothers protested\\n\\t\\t\\t\\tagainst the absurdity of such a suspicion after they had\\n\\t\\t\\t\\tbeen entertained so royally by the Wazir."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "74",
    "NoteID": "1739",
    "Body": "\"That might be all very well,\" said the Egyptians, \"but\\n\\t\\t\\t\\twhat if it is found by a search that you have in fact\\n\\t\\t\\t\\tabused the Wazir's hospitality by stealing a valuable\\n\\t\\t\\t\\tcup?\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "75",
    "NoteID": "1740",
    "Body": "We must try to picture to ourselves the mentality of the\\n\\t\\t\\t\\tten. They understood each other perfectly, in their sins\\n\\t\\t\\t\\tas well as in other things. For themselves, the search\\n\\t\\t\\t\\theld out no fears. Besides they had had no opportunity of\\n\\t\\t\\t\\tstealing. But what of that young fellow Benjamin? They\\n\\t\\t\\t\\twere ready to believe anything against him, the more so\\n\\t\\t\\t\\tas the Wazir's partiality for him had lent a keen edge to\\n\\t\\t\\t\\ttheir jealousy. Judging by their own standards, they\\n\\t\\t\\t\\twould not be surprised if he had stolen, seeing that he\\n\\t\\t\\t\\thad had such opportunities-sitting at the High Table and\\n\\t\\t\\t\\tstaying with the Wazir. They felt very self-righteous at\\n\\t\\t\\t\\tthe same time that they indulged in the luxury of\\n\\t\\t\\t\\taccusing in their thoughts the most innocent of men!\\n\\t\\t\\t\\tSupposing he had stolen, here would be a fine opportunity\\n\\t\\t\\t\\tof getting rid of him. What about their solemn oath to\\n\\t\\t\\t\\ttheir father? Oh! that was covered by the exception. He\\n\\t\\t\\t\\thad done for himself. They had done all they could to\\n\\t\\t\\t\\tprotect him, but they were powerless. The old man could\\n\\t\\t\\t\\tcome and see for himself."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "75",
    "NoteID": "1741",
    "Body": "This was their family custom. It was of course long\\n\\t\\t\\t\\tanterior to the Mosaic Law, which laid down full\\n\\t\\t\\t\\trestitution for theft, and if the culprit had nothing, he\\n\\t\\t\\t\\twas to be sold for his theft (Exod. xxii. 3). But here\\n\\t\\t\\t\\tthe crime was more than theft. It was theft, lying, and\\n\\t\\t\\t\\tthe grossest abuse of confidence and hospitality. While\\n\\t\\t\\t\\tthe ten felt a secret satisfaction in suggesting the\\n\\t\\t\\t\\tpenalty, they were unconsciously carrying out Joseph's\\n\\t\\t\\t\\tplan. Thus the vilest motives often help in carrying out\\n\\t\\t\\t\\tthe most beneficent plans."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "76",
    "NoteID": "1742",
    "Body": "The pronoun \"he\" can only refer to Joseph. He may have\\n\\t\\t\\t\\tbeen present all the time, or he may just have come up,\\n\\t\\t\\t\\tas the supposed theft of the king's own cup (xii. 72\\n\\t\\t\\t\\tabove) was a very serious and important affair, and the\\n\\t\\t\\t\\tinvestigation required his personal supervision. All that\\n\\t\\t\\t\\this officers did by his orders was his own act. As the\\n\\t\\t\\t\\tlawyers say: Qui facit per alium, facit per se (whoever\\n\\t\\t\\t\\tdoes anything through another, does it himself)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "76",
    "NoteID": "1743",
    "Body": "The Arabic word here used is wi'aun, plural au'iya, which\\n\\t\\t\\t\\tincludes bags, lockers, boxes, or any receptacles in\\n\\t\\t\\t\\twhich things are stored. Notice the appropriateness of\\n\\t\\t\\t\\tthe words used. The cup was concealed in a saddle-bag\\n\\t\\t\\t\\t(rahl), verse 70 above. When it comes to searching, they\\n\\t\\t\\t\\tmust search all the baggage of every description if the\\n\\t\\t\\t\\tsearch was to be convincing and effective."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "76",
    "NoteID": "1744",
    "Body": "It refers to the drinking cup, the siqayat, which is a\\n\\t\\t\\t\\tfeminine noun: hence the feminine pronoun (ha) in Arabic."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "76",
    "NoteID": "1745",
    "Body": "Let no one suppose that it was a vulgar or wicked trick,\\n\\t\\t\\t\\tsuch as we sometimes hear of in police courts, when\\n\\t\\t\\t\\tproperty is planted on innocent men to get them into\\n\\t\\t\\t\\ttrouble. On the contrary it was a device or stratagem\\n\\t\\t\\t\\twhose purpose was to show up wickedness in its true\\n\\t\\t\\t\\tcolours, to give it a chance of repentance, to bring\\n\\t\\t\\t\\tabout forgiveness and reconciliation, to give solace to\\n\\t\\t\\t\\tthe aged father who had suffered so much. Joseph was a\\n\\t\\t\\t\\tProphet of Allah, but he could not have carried out his\\n\\t\\t\\t\\tplan or taken the first step, of detaining his brother,\\n\\t\\t\\t\\texcept with the will and permission of Allah, Whose Plan\\n\\t\\t\\t\\tis universal and for all His creatures."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "76",
    "NoteID": "1746",
    "Body": "If we examine this world's affairs, there are all sorts\\n\\t\\t\\t\\tof plans, and all degrees of folly and wisdom. The wicked\\n\\t\\t\\t\\tones plan; the foolish ones plan; the simple ones plan;\\n\\t\\t\\t\\tthen there are men who think themselves wise and are\\n\\t\\t\\t\\tperhaps thought to be wise, but who are foolish, and they\\n\\t\\t\\t\\thave their plans; and there are degrees of real and\\n\\t\\t\\t\\tbeneficent wisdom among men. Allah, is above all.\\n\\t\\t\\t\\tAnything good in our wisdom is but a reflection of His\\n\\t\\t\\t\\twisdom, and His wisdom can even turn folly and wickedness\\n\\t\\t\\t\\tto good."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "77",
    "NoteID": "1747",
    "Body": "The hatred of the Ten for Joseph and Benjamin comes out\\n\\t\\t\\t\\tagain. They are not only ready to believe evil of\\n\\t\\t\\t\\tBenjamin, but they carry their thoughts back to Joseph\\n\\t\\t\\t\\tand call him a thief as well. They had injured Joseph;\\n\\t\\t\\t\\tand by a false charge of this kind they salve their\\n\\t\\t\\t\\tconscience. Little did they suspect that Joseph was\\n\\t\\t\\t\\tbefore them under another guise, and their falsehood and\\n\\t\\t\\t\\ttreachery, would soon be exposed."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "77",
    "NoteID": "1748",
    "Body": "There were many secrets: (1) that he was Joseph himself;\\n\\t\\t\\t\\t(2) that his brother Benjamin knew him; (3) that there\\n\\t\\t\\t\\twas no guilt in Benjamin, but the whole practical joke\\n\\t\\t\\t\\twas in furtherance of a great plan (see n. 1745, above);\\n\\t\\t\\t\\t(4) that they were giving themselves away, and were\\n\\t\\t\\t\\tunconsciously facilitating the plan, though their motives\\n\\t\\t\\t\\twere not above-board."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "77",
    "NoteID": "1749",
    "Body": "\"Ah!\" thought Joseph, \"you think that Benjamin is safely\\n\\t\\t\\t\\tout of the way, and that Joseph was got rid of long\\n\\t\\t\\t\\tsince! Would you be surprised to know that you have given\\n\\t\\t\\t\\tyourselves away, that you are now in the power of Joseph,\\n\\t\\t\\t\\tand that Joseph is the very instrument of your exposure\\n\\t\\t\\t\\tand (let us hope) of your repentance?\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "78",
    "NoteID": "1750",
    "Body": "I have translated the title of 'Aziz here as \"the exalted\\n\\t\\t\\t\\tone\" when addressed to Joseph in order not to cause\\n\\t\\t\\t\\tconfusion with the other man, the 'Aziz the Courtier, who\\n\\t\\t\\t\\thad bought Joseph on arrival in Egypt. See xii. 30 above,\\n\\t\\t\\t\\tand notes 1677 and 1714."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "79",
    "NoteID": "1751",
    "Body": "There is a little sparring now between the Ten and\\n\\t\\t\\t\\tJoseph. They are afraid of meeting their father's wrath,\\n\\t\\t\\t\\tand he holds them strictly to the bargain which they had\\n\\t\\t\\t\\tthemselves suggested."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "80",
    "NoteID": "1752",
    "Body": "Kabir may mean the eldest. But in xii. 78 above, Kabir is\\n\\t\\t\\t\\tdistinguished from Shaikh, and I have translated the one\\n\\t\\t\\t\\tas \"venerable\" and the other as \"aged\". In xx. 71 Kabir\\n\\t\\t\\t\\tobviously means \"leader\" or \"chief\", and has no reference\\n\\t\\t\\t\\tto age. I therefore translate here by the word \"leader\",\\n\\t\\t\\t\\tthat brother among them who took the most active part in\\n\\t\\t\\t\\tthese transactions. His name is not given in the Qur-an.\\n\\t\\t\\t\\tThe eldest brother was Reuben. But according to the\\n\\t\\t\\t\\tbiblical story the brother who had taken the most active\\n\\t\\t\\t\\tpart in this transaction was Judah, one of the elder\\n\\t\\t\\t\\tbrothers, being the fourth son, after Reuben, Simeon, and\\n\\t\\t\\t\\tLevi, and of the same mother as these. It was Judah who\\n\\t\\t\\t\\tstood surety to Jacob for Benjamin (Gen. xliii. 9). It is\\n\\t\\t\\t\\ttherefore natural that Judah should, as here, offer to\\n\\t\\t\\t\\tstay behind."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "80",
    "NoteID": "1753",
    "Body": "The pledge he had given was to his father, and in Allah's\\n\\t\\t\\t\\tname. Therefore he was bound both to his father, and to\\n\\t\\t\\t\\tAllah. He must await his father's orders and remain here\\n\\t\\t\\t\\tas pledged, unless Allah opened out some other way. For\\n\\t\\t\\t\\texample the Egyptian Wazir might relent; if so, he could\\n\\t\\t\\t\\tgo back with Benjamin to his father, and his pledge would\\n\\t\\t\\t\\tbe satisfied."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "81",
    "NoteID": "1754",
    "Body": "'He stole in secret and without our knowledge. How could\\n\\t\\t\\t\\twe in the circumstances prevent it? This may have been a\\n\\t\\t\\t\\tgood statement for the other nine brothers, but Judah was\\n\\t\\t\\t\\thimself personally and specially pledged."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "82",
    "NoteID": "1755",
    "Body": "To vouch for the truth of the story, the nine brothers\\n\\t\\t\\t\\tare asked by Judah to appeal to their father to enquire\\n\\t\\t\\t\\tat the place where they stayed and the caravan with which\\n\\t\\t\\t\\tthey came, and he would find that the facts were as they\\n\\t\\t\\t\\tstated them. The nine brothers came back and told their\\n\\t\\t\\t\\tfather as they had been instructed by Judah."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "83",
    "NoteID": "1756",
    "Body": "Jacob was absolutely stunned by the story. He knew his\\n\\t\\t\\t\\tdarling little Benjamin too well to believe that he had\\n\\t\\t\\t\\tcommitted theft. He flatly refused to believe it, and\\n\\t\\t\\t\\tcalled it a cock-and-bull story, which indeed it was,\\n\\t\\t\\t\\tthough not in the sense in which he reproached the nine\\n\\t\\t\\t\\tbrothers. With the eye of faith he saw clearly the\\n\\t\\t\\t\\tinnocence of Benjamin, though he did not see every detail\\n\\t\\t\\t\\tof what had happened."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "83",
    "NoteID": "1757",
    "Body": "With the eye of faith he clung to even a larger hope.\\n\\t\\t\\t\\tPerhaps all three of his lost sons would come\\n\\t\\t\\t\\tback,-Joseph, Benjamin, and Judah. His faith in Allah was\\n\\t\\t\\t\\tunswerving, although alas! the present facts altogether\\n\\t\\t\\t\\tunnerved him."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "84",
    "NoteID": "1758",
    "Body": "The old father's grief is indescribable. Yet with what\\n\\t\\t\\t\\tmaster-strokes it is described here! One sorrow brings up\\n\\t\\t\\t\\tthe memory of another and a greater one. 'Benjamin is now\\n\\t\\t\\t\\tgone! Oh but Joseph! his pretty dream of boyhood! his\\n\\t\\t\\t\\tgreatness foretold! and now how dark was the world! If he\\n\\t\\t\\t\\tcould but weep! Tears might give relief, and his red and\\n\\t\\t\\t\\tswollen eyes might yet regain their light!' But his grief\\n\\t\\t\\t\\twas too deep for tears. His eyes lost their colour, and\\n\\t\\t\\t\\tbecame a dull white. The light became a mere blur, a\\n\\t\\t\\t\\twhite glimmer. Darkness seemed to cover everything. So it\\n\\t\\t\\t\\twas in the outside world. So was it in his mind. His\\n\\t\\t\\t\\tgrief was unshared, unexpressed, and uncomplaining. Who\\n\\t\\t\\t\\tcould share it? Who could understand it? He bore his\\n\\t\\t\\t\\tsorrow in silence. Yet his faith was undimmed, and he\\n\\t\\t\\t\\ttrimmed the lamp of patience, that sovereign virtue for\\n\\t\\t\\t\\tthose who have faith."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "85",
    "NoteID": "1759",
    "Body": "A speech full of jealousy, taunting malice, and lack of\\n\\t\\t\\t\\tunderstanding,-one that would have driven mad any one\\n\\t\\t\\t\\tless endowed with patience and wisdom than was Jacob, the\\n\\t\\t\\t\\tProphet of Allah. It shows that the sons were still\\n\\t\\t\\t\\tunregenerate, though the time of their repentance and\\n\\t\\t\\t\\treclamation was drawing nigh. The cruel heartlessness of\\n\\t\\t\\t\\ttheir words is particularly out of place, as Jacob bore\\n\\t\\t\\t\\this sorrow in silence and complained to no mortal, but\\n\\t\\t\\t\\tpoured out his distraction and grief only to Allah, as\\n\\t\\t\\t\\tstated in the next verse."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "86",
    "NoteID": "1760",
    "Body": "Jacob's plaint to Allah is about himself, not about\\n\\t\\t\\t\\tAllah's doings. He bewails the distraction of his mind\\n\\t\\t\\t\\tand his occasional breaking out of those bounds of\\n\\t\\t\\t\\tpatience which he had set for himself."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "86",
    "NoteID": "1761",
    "Body": "He knew of Allah's merciful and beneficent dealings with\\n\\t\\t\\t\\tman in a way his shallow sons did not. And his perfect\\n\\t\\t\\t\\tfaith in Allah also told him that all would be well. He\\n\\t\\t\\t\\tnever gave up hope for Joseph, as his directions in the\\n\\t\\t\\t\\tnext verse show. They may be supposed to have been spoken\\n\\t\\t\\t\\tafter a little silence of grief and thought. That silence\\n\\t\\t\\t\\tI have indicated in punctuation by three dots."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "87",
    "NoteID": "1762",
    "Body": "The word is rauh, not ruh as some translators have\\n\\t\\t\\t\\tmistakenly construed it. Rauh includes the idea of a\\n\\t\\t\\t\\tMercy that stills or calms our distracted state, and is\\n\\t\\t\\t\\tparticularly appropriate here in the mouth of Jacob."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "87",
    "NoteID": "1763",
    "Body": "Jacob ignores and forgives the sting and malice in the\\n\\t\\t\\t\\tspeech of his sons, and like a true Prophet of Allah,\\n\\t\\t\\t\\tstill wishes them well, gives them sound advice, and\\n\\t\\t\\t\\tsends them on an errand which is to open their eyes to\\n\\t\\t\\t\\tthe wonderful ways of Providence as much as it will bring\\n\\t\\t\\t\\tconsolation to his own distressed soul. He asks them to\\n\\t\\t\\t\\tgo again in search of Joseph and Benjamin. Perhaps by now\\n\\t\\t\\t\\the had an idea that they might be together in Egypt. In\\n\\t\\t\\t\\tany case their stock of grain is again low, and they must\\n\\t\\t\\t\\tseek its replenishment in Egypt."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "88",
    "NoteID": "1764",
    "Body": "The nine brothers come back to Egypt according to their\\n\\t\\t\\t\\tfather's direction. Their first care is to see the Wazir.\\n\\t\\t\\t\\tThey must tell him of all their father's distress and\\n\\t\\t\\t\\texcite his pity, if perchance he might release Benjamin.\\n\\t\\t\\t\\tThey would describe the father's special mental distress\\n\\t\\t\\t\\tas well as the distress which was the common lot of all\\n\\t\\t\\t\\tin famine time. They had spent a great part of their\\n\\t\\t\\t\\tcapital and stock-in-trade. They would appeal to his\\n\\t\\t\\t\\tcharity. It might please so great a man, the absolute\\n\\t\\t\\t\\tgovernor of a wealthy state. And they did so. Perhaps\\n\\t\\t\\t\\tthey mentioned their father's touching faith, and that\\n\\t\\t\\t\\tbrought Joseph out of his shell, as in the next verse."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "89",
    "NoteID": "1765",
    "Body": "Joseph now wants to reveal himself and touch their\\n\\t\\t\\t\\tconscience. He had but to remind them of the true facts\\n\\t\\t\\t\\tas to their treatment of their brother Joseph, whom they\\n\\t\\t\\t\\tpretended to have lost. He had by now also learnt from\\n\\t\\t\\t\\tBenjamin what slights and injustice he too had suffered\\n\\t\\t\\t\\tat their hands after Joseph's protection had been removed\\n\\t\\t\\t\\tfrom him in their home. Had not Jospeh himself seen them\\n\\t\\t\\t\\tbut too prone to believe the worst of Benjamin and to say\\n\\t\\t\\t\\tthe worst of Joseph? But Joseph would be charitable,-not\\n\\t\\t\\t\\tonly in the sense which they meant when they asked for a\\n\\t\\t\\t\\tcharitable grant of grain, but in a far higher sense. He\\n\\t\\t\\t\\twould forgive them and put the most charitable\\n\\t\\t\\t\\tconstruction on what they did,-that they knew not what\\n\\t\\t\\t\\tthey were doing!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "90",
    "NoteID": "1766",
    "Body": "Their father's words, the way events were shaping\\n\\t\\t\\t\\tthemselves. Joseph's questionings, perhaps Benjamin's\\n\\t\\t\\t\\tmanner now, not a slave kept in subjection but one in\\n\\t\\t\\t\\tperfect love and understanding with this great\\n\\t\\t\\t\\tWazir,-perhaps also a recollection of Joseph's boyish\\n\\t\\t\\t\\tdream,-all these things had prepared their minds and they\\n\\t\\t\\t\\task the direct question, \"Art thou Joseph?\" They get the\\n\\t\\t\\t\\tdirect reply, \"Yes, I am Joseph; and if you have still\\n\\t\\t\\t\\tany doubt of my identity, here is Benjamin: ask him. We\\n\\t\\t\\t\\thave suffered much, but patience and right conduct are at\\n\\t\\t\\t\\tlast rewarded by Allah!\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "91",
    "NoteID": "1767",
    "Body": "The scales fall from the eyes of the brothers. We may\\n\\t\\t\\t\\tsuppose that they had joined Judah at this interview, and\\n\\t\\t\\t\\tperhaps what Judah had seen when he was alone helped in\\n\\t\\t\\t\\tthe process of their enlightenment, They are convicted of\\n\\t\\t\\t\\tsin out of their own mouths, and now there is no arrier\\n\\t\\t\\t\\tpensee, no reserve thought, in their minds. They freely\\n\\t\\t\\t\\tconfess their wrong-doing, and the justice of Joseph's\\n\\t\\t\\t\\tpreferment."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "92",
    "NoteID": "1768",
    "Body": "Joseph is most generous. He is glad that they have at\\n\\t\\t\\t\\tlast seen the significance of what happened. But he will\\n\\t\\t\\t\\tnot allow them at this great moment of reconciliation to\\n\\t\\t\\t\\tdwell on their conduct with reproaches against\\n\\t\\t\\t\\tthemselves. There is more urgent work to do. An aged and\\n\\t\\t\\t\\tbeloved father is eating out his heart in far Canaan in\\n\\t\\t\\t\\tlove and longing for his Joseph, and he must be told all\\n\\t\\t\\t\\timmediately, and \"comforted in body, mind, and estate,\"\\n\\t\\t\\t\\tand so he tells the brothers to hurry back immediately\\n\\t\\t\\t\\twith his shirt as a sign of recognition, as a proof of\\n\\t\\t\\t\\tthese wonderful happenings."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "93",
    "NoteID": "1769",
    "Body": "It will be remembered that they had covered their crime\\n\\t\\t\\t\\tby taking his shirt, putting on the stains of blood, and\\n\\t\\t\\t\\tpretending that he had been killed by a wolf: see above,\\n\\t\\t\\t\\txii. 17-18. Now that they have confessed their crime and\\n\\t\\t\\t\\tbeen forgiven, and they have joyful news to tell Jacob\\n\\t\\t\\t\\tabout Joseph. Joseph gives them another shirt of his to\\n\\t\\t\\t\\tprove the truth of their story. It is rich shirt,\\n\\t\\t\\t\\tbefitting a ruler of Egypt, to prove his good fortune,\\n\\t\\t\\t\\tand yet perhaps in design and many colours (xii. 18, n.\\n\\t\\t\\t\\t1651) were reminiscent of the lost Joseph. The first\\n\\t\\t\\t\\tshirt plunged Jacob into grief. This one will now restore\\n\\t\\t\\t\\thim. See the verses following."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "94",
    "NoteID": "1770",
    "Body": "Literally, I feel the scent, or the air, or the\\n\\t\\t\\t\\tatmosphere or the breath of Joseph; for rih has all these\\n\\t\\t\\t\\tsignifications. Or we might translate, 'I feel the\\n\\t\\t\\t\\tpresence of Joseph in the air'. When a long-lost friend\\n\\t\\t\\t\\tis about to be found or heard of, many people have a sort\\n\\t\\t\\t\\tof presentiment of it, which they call telepathy. In\\n\\t\\t\\t\\tJacob's case it was more definite. He had always had\\n\\t\\t\\t\\tfaith that Joseph was living and that his dream would he\\n\\t\\t\\t\\trealised. Now that faith was proved true by his own sons;\\n\\t\\t\\t\\tthey had been undutiful, and hard, and ignorant; and\\n\\t\\t\\t\\tcircumstances had converged to prove it to them by ocular\\n\\t\\t\\t\\tdemonstration. Jacob's soul was more sensitive. No wonder\\n\\t\\t\\t\\the knew already before the news was actually brought to\\n\\t\\t\\t\\thim."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "95",
    "NoteID": "1771",
    "Body": "\"They\" must be the people around him, before the brothers\\n\\t\\t\\t\\tactually arrived. These same brothers had sedulously\\n\\t\\t\\t\\tcultivated the calumny that their father was an old\\n\\t\\t\\t\\tdotard, and everybody around believed it, even after its\\n\\t\\t\\t\\tauthors had to give it up. Thus lies die hard, once they\\n\\t\\t\\t\\tget a start."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "96",
    "NoteID": "1772",
    "Body": "We may suppose this to have been Judah (see notes 1752\\n\\t\\t\\t\\tand 1753 above) who was pledged to his father for\\n\\t\\t\\t\\tBenjamin, and who could now announce the good news not\\n\\t\\t\\t\\tonly of Benjamin but of Joseph. We can imagine him\\n\\t\\t\\t\\thurrying forward, to be the first to tell the news,\\n\\t\\t\\t\\tthough the plural pronoun for those whom Jacob addresses\\n\\t\\t\\t\\tin this verse, and for those who reply in the next verse,\\n\\t\\t\\t\\tshows that all the brothers practically arrived together."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "96",
    "NoteID": "1773",
    "Body": "The particle fa (\"then\") has here the force of\\n\\t\\t\\t\\t\"forthwith\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "96",
    "NoteID": "1774",
    "Body": "Jacob's sight had grown dim; his eyes had become white\\n\\t\\t\\t\\twith much sorrow for Joseph (see xii. 84 above). Both his\\n\\t\\t\\t\\tphysical and mental vision now became clear and bright as\\n\\t\\t\\t\\tbefore."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "96",
    "NoteID": "1775",
    "Body": "He had said this (xii. 86) when everything was against\\n\\t\\t\\t\\thim, and his sons were scoffers. Now they themselves have\\n\\t\\t\\t\\tcome to say that his faith was justified and his vision\\n\\t\\t\\t\\twas true."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "98",
    "NoteID": "1776",
    "Body": "He fully intended to do this, but the most injured party\\n\\t\\t\\t\\twas Joseph, and it was only fair that Joseph should be\\n\\t\\t\\t\\tconsulted. In fact Joseph had already forgiven his\\n\\t\\t\\t\\tbrothers all their past, and his father could confidently\\n\\t\\t\\t\\tlook forward to Joseph joining in the wish of the whole\\n\\t\\t\\t\\tfamily to turn to Allah through their aged father Jacob\\n\\t\\t\\t\\tin his prophetic office."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "99",
    "NoteID": "1777",
    "Body": "At length the whole family arrived in Egypt and were\\n\\t\\t\\t\\tre-united with Joseph. They were all entertained and\\n\\t\\t\\t\\tprovided with homes. But the parents were treated with\\n\\t\\t\\t\\tspecial honour, as was becoming both to Joseph's\\n\\t\\t\\t\\tcharacter and ordinary family ethics. His mother Rachel\\n\\t\\t\\t\\thad long been dead, but he had been brought up by his\\n\\t\\t\\t\\tmother's sister Leah, whom his father had also married.\\n\\t\\t\\t\\tLeah was now his mother. They were lodged with Joseph\\n\\t\\t\\t\\thimself."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "99",
    "NoteID": "1778",
    "Body": "This is in Arabic in the plural, not in the dual number.\\n\\t\\t\\t\\tThe welcome is for all to Egypt, and under the auspices\\n\\t\\t\\t\\tof the Wazir or Egypt. They came, therefore, under\\n\\t\\t\\t\\tAllah's will, to a double sense of security: Egypt was\\n\\t\\t\\t\\tsecure from the famine unlike the neighbouring countries;\\n\\t\\t\\t\\tand they were to be cared for by the highest in the land."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "100",
    "NoteID": "1779",
    "Body": "Certainly metaphorically: probably also literally. By\\n\\t\\t\\t\\tEastern custom the place of honour at a ceremonial\\n\\t\\t\\t\\treception is on a seat on a dais, with a special cushion\\n\\t\\t\\t\\tof honour, such as is assigned to a bridegroom at his\\n\\t\\t\\t\\treception. To show his high respect for his parents,\\n\\t\\t\\t\\tJoseph made them sit on a throne of dignity. On the other\\n\\t\\t\\t\\thand, his parents and his brothers,-all performed the\\n\\t\\t\\t\\tceremony of prostration before Joseph in recognition of\\n\\t\\t\\t\\this supreme rank in Egypt under the Pharaoh. And thus was\\n\\t\\t\\t\\tfulfilled the dream or vision of his youth (xii. 4 above\\n\\t\\t\\t\\tand n. 1633). A) The ceremony of prostration for paying\\n\\t\\t\\t\\trespect might have been allowed at the time of previous\\n\\t\\t\\t\\tprophets, but with the advent of the complete and final\\n\\t\\t\\t\\trevelation prostration before anyone other than Allah is\\n\\t\\t\\t\\ta grave sin strictly prohibited."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "100",
    "NoteID": "1780",
    "Body": "Note how modest Joseph is throughout. The first things he\\n\\t\\t\\t\\tthinks of among Allah's gracious favours to him are: (1)\\n\\t\\t\\t\\tthat he was brought out of prison and publicly proclaimed\\n\\t\\t\\t\\tto be honest and virtuous; and (2) that his dear father\\n\\t\\t\\t\\twas restored to him, as well as the brothers who had\\n\\t\\t\\t\\tpersecuted him all his life. He will say nothing against\\n\\t\\t\\t\\tthem personally. In his husn-i-zann (habit of\\n\\t\\t\\t\\tinterpreting everyone and everything in the most\\n\\t\\t\\t\\tfavourable and charitable light), he looks upon them as\\n\\t\\t\\t\\thaving been misled. It was Satan that set them against\\n\\t\\t\\t\\thim. But now all is rectified by the grace of Allah, to\\n\\t\\t\\t\\tWhom he renders due praise. Latif: see n. 2844 to xxii.\\n\\t\\t\\t\\t63; the fourth meaning mentioned there applies here, with\\n\\t\\t\\t\\techoes of the other meanings."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "101",
    "NoteID": "1781",
    "Body": "Then he turns to Allah in prayer, and again his modesty\\n\\t\\t\\t\\tis predominant. He held supreme power under the king, but\\n\\t\\t\\t\\the calls it \"some power\" or authority. His reading of\\n\\t\\t\\t\\tevents and dreams had saved millions of lives in the\\n\\t\\t\\t\\tgreat Egyptian famine; yet he refers to it as \"something\\n\\t\\t\\t\\tof the interpretation of dreams and events\". And he takes\\n\\t\\t\\t\\tno credit to himself, \"All this,\" he says, \"was Thy gift,\\n\\t\\t\\t\\tO Allah! For such things can only come from the Creator\\n\\t\\t\\t\\tof the heavens and earth.\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "101",
    "NoteID": "1782",
    "Body": "Power in the doing of things as well as power in\\n\\t\\t\\t\\tintelligent forecasts and plans,-both must look to Allah:\\n\\t\\t\\t\\totherwise the deed and the plan would be futile."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "101",
    "NoteID": "1783",
    "Body": "Joseph's prayer may be analysed thus: (1) I am nothing;\\n\\t\\t\\t\\tall power and knowledge are Thine; (2) such things can\\n\\t\\t\\t\\tonly come from Thee, for Thou art the Creator of all; (3)\\n\\t\\t\\t\\tnone can protect me from danger and wrong, but only Thou;\\n\\t\\t\\t\\t(4) Thy protection I need both in this world and the\\n\\t\\t\\t\\tnext; (5) may I till death remain constant to Thee-, (6)\\n\\t\\t\\t\\tmay I yield up my soul to Thee in cheerful submission to\\n\\t\\t\\t\\tThy will; (7) in this moment of union with my family\\n\\t\\t\\t\\tafter many partings let me think of the final union with\\n\\t\\t\\t\\tthe great family of the righteous. How marvellously apt\\n\\t\\t\\t\\tto the occasion!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "102",
    "NoteID": "1784",
    "Body": "The story is finished. But is it a story? It is rather a\\n\\t\\t\\t\\trecital of forces and motives, thoughts and feelings,\\n\\t\\t\\t\\tcomplications and results, ordinarily not seen by men.\\n\\t\\t\\t\\tHowever much they concert their plans and unite their\\n\\t\\t\\t\\tforces, whatever dark plots they back with all their\\n\\t\\t\\t\\tresources,-the plan of Allah works irresistibly, and\\n\\t\\t\\t\\tsweeps away all their machinations. The good win through\\n\\t\\t\\t\\tin the end, but not always as they planned: the evil are\\n\\t\\t\\t\\tfoiled, and often their very plots help the good. What\\n\\t\\t\\t\\tdid the brothers desire in trying to get rid of Joseph,\\n\\t\\t\\t\\tand what actually happened? How the Courtier's wife,\\n\\t\\t\\t\\tencouraged by the corrupt women of her acquaintance,\\n\\t\\t\\t\\ttried and failed to seduce Joseph and how Allah listened\\n\\t\\t\\t\\tto his prayer and saved him from her vile designs? How\\n\\t\\t\\t\\twrong was it of the cup-bearer to forget Joseph, and yet\\n\\t\\t\\t\\thow his very forgetfulness kept Joseph safe and\\n\\t\\t\\t\\tundisturbed in prison until the day came when he should\\n\\t\\t\\t\\ttackle the great problems of Pharaoh's kingdom? With\\n\\t\\t\\t\\tevery character in the story there are problems, and the\\n\\t\\t\\t\\twhole is a beautifully balanced picture of the working of\\n\\t\\t\\t\\tAllah's providence in man's chequered destiny."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "102",
    "NoteID": "1785",
    "Body": "The holy Prophet was no actor in those scenes; yet by\\n\\t\\t\\t\\tinspiration he was able to expound them in the divine\\n\\t\\t\\t\\tlight, as they had never been expounded before, whether\\n\\t\\t\\t\\tin the Pentateuch or by any Seer before him. And\\n\\t\\t\\t\\tallegorically they figured his own story,-how his own\\n\\t\\t\\t\\tbrethren sought to betray and kill him how by Allah's\\n\\t\\t\\t\\tprovidence he was not only saved but he won through."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "103",
    "NoteID": "1786",
    "Body": "In spite of such an exposition and such a convincing\\n\\t\\t\\t\\tillustration, how few men really have true faith,- such a\\n\\t\\t\\t\\tfaith as Jacob had in the old story, or Muhammad the\\n\\t\\t\\t\\tChosen One had, in the story which was actually unfolding\\n\\t\\t\\t\\titself on the world's stage when his Sara was revealed,\\n\\t\\t\\t\\tshortly before the Hijrat? Al-Mustafa's ardent wish and\\n\\t\\t\\t\\tfaith was to save his people and all mankind from the\\n\\t\\t\\t\\tgraceless condition of want of faith. But his efforts\\n\\t\\t\\t\\twere flouted, and he had to leave his home and suffer all\\n\\t\\t\\t\\tkinds of persecution, but like Joseph, and more than\\n\\t\\t\\t\\tJoseph, he was marked out for great work, which he\\n\\t\\t\\t\\tfinally achieved."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "104",
    "NoteID": "1787",
    "Body": "The divine Message was priceless; it was not for the\\n\\t\\t\\t\\tMessenger's personal profit, nor did he ask of men any\\n\\t\\t\\t\\treward for bringing it for their benefit. It was for all\\n\\t\\t\\t\\tcreatures,-literally, for all the worlds, as explained in\\n\\t\\t\\t\\ti. 2, n. 20."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "105",
    "NoteID": "1788",
    "Body": "Not only can we learn through Scripture of the working of\\n\\t\\t\\t\\tAllah's providence in human history and the history of\\n\\t\\t\\t\\tindividual souls. His Signs are scattered literally\\n\\t\\t\\t\\tthroughout nature-throughout Creation-for all who have\\n\\t\\t\\t\\teyes to see. And yet man is so arrogant that he turns\\n\\t\\t\\t\\taway his very eyes from them!"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "106",
    "NoteID": "1789",
    "Body": "Even if people profess a nominal faith in Allah, they\\n\\t\\t\\t\\tcorrupt it by believing in other things as if they were\\n\\t\\t\\t\\tAllah's partners, or had some share in the shaping of the\\n\\t\\t\\t\\tworld's destinies! In some circles, it is idolatry, the\\n\\t\\t\\t\\tworship of stocks and stones. In others, it is\\n\\t\\t\\t\\tChristolatry and Mariolatry, or the deification of heroes\\n\\t\\t\\t\\tand men of renown. In others it is the powers of Nature\\n\\t\\t\\t\\tor of Life, or of the human intellect personified in\\n\\t\\t\\t\\tScience or Art or invention, and this is the more common\\n\\t\\t\\t\\tform of modern idolatry. Others again worship mystery, or\\n\\t\\t\\t\\timaginary powers of good or even evil: greed and fear are\\n\\t\\t\\t\\tmixed up with these forms of worship. Islam calls us to\\n\\t\\t\\t\\tworship Allah, the One True God, and Him only."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "107",
    "NoteID": "1790",
    "Body": "Gashiyat=covering veil, pall; used for the Judgment to\\n\\t\\t\\t\\tcome, which will be so dark and appalling as to hide up\\n\\t\\t\\t\\tall other and petty things, and be the one great reality\\n\\t\\t\\t\\tfor the souls that were slaves to evil."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "107",
    "NoteID": "1791",
    "Body": "The metaphor is changed, from intensity of darkness to\\n\\t\\t\\t\\tsuddenness of time. It will come before they are aware of\\n\\t\\t\\t\\tit. Let them not feel any sense of safety in sin."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "108",
    "NoteID": "1792",
    "Body": "Islam holds fast to the one central fact in the spiritual\\n\\t\\t\\t\\tworld,-the unity of God, and all Reality springing from\\n\\t\\t\\t\\tHim and Him alone. There can be no one and nothing in\\n\\t\\t\\t\\tcompetition with that one and only Reality. It is the\\n\\t\\t\\t\\tessence of Truth. All other ideas or existences,\\n\\t\\t\\t\\tincluding our perception of Self, are merely\\n\\t\\t\\t\\trelative,-mere projections from the wonderful faculties\\n\\t\\t\\t\\twhich He has given to us. This is not, to us, mere\\n\\t\\t\\t\\thypothesis. It is in our inmost experience. In the\\n\\t\\t\\t\\tphysical world, they say that seeing is believing. In our\\n\\t\\t\\t\\tinner world this sense of Allah is as clear as sight in\\n\\t\\t\\t\\tthe physical world. Therefore, Al-Mustafa and those who\\n\\t\\t\\t\\treally follow him in the truest sense of the world, call\\n\\t\\t\\t\\tall the world to see this Truth, feel this experience,\\n\\t\\t\\t\\tfollow this Way. They will never be distracted by\\n\\t\\t\\t\\tmetaphysical speculations, whose validity will always be\\n\\t\\t\\t\\tdoubtful, nor be deluded with phantoms which lead men\\n\\t\\t\\t\\tastray."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "109",
    "NoteID": "1793",
    "Body": "It was men that Allah sent as His Messengers to explain\\n\\t\\t\\t\\tHim to men. He did not send angels or gods. Into His\\n\\t\\t\\t\\tchosen men He breathed His inspiration, so that they\\n\\t\\t\\t\\tcould see truer than other men. But they were men living\\n\\t\\t\\t\\twith men,-in men's habitations in town or country; not\\n\\t\\t\\t\\trecluses or cenobites, who had no personal experience of\\n\\t\\t\\t\\tmen's affairs and could not be teachers of men in the\\n\\t\\t\\t\\tfullest sense. Their deeds tell their own tale."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "109",
    "NoteID": "1794",
    "Body": "The righteous, the men of Allah, had, as in Joseph's\\n\\t\\t\\t\\thistory, some evidence of Allah's providence in this very\\n\\t\\t\\t\\tworld with all its imperfections as reflecting our\\n\\t\\t\\t\\timperfections. But this world is of no real consequence\\n\\t\\t\\t\\tto them. Their home is in the Hereafter. Joseph's earthly\\n\\t\\t\\t\\thome was in Canaan; but he attained his glory elsewhere;\\n\\t\\t\\t\\tand his spiritual Home is in the great Society of the\\n\\t\\t\\t\\tRighteous (iii. 39)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "110",
    "NoteID": "1795",
    "Body": "Zannu (come to think): I construe the nominative of this\\n\\t\\t\\t\\tverb to be \"the messengers\" in agreement with the best\\n\\t\\t\\t\\tauthorities. Kuzibu is the usual reading, though Kuzzibu,\\n\\t\\t\\t\\tthe alternative reading, also rests on good authority. I\\n\\t\\t\\t\\tconstrue the meaning to be: that Allah gives plenty of\\n\\t\\t\\t\\trope to the wicked (as in Joseph's story) until His own\\n\\t\\t\\t\\tMessengers feel almost that it will be hopeless to preach\\n\\t\\t\\t\\tto them and come to consider themselves branded as liars\\n\\t\\t\\t\\tby an unbelieving world; that the breaking point is then\\n\\t\\t\\t\\treached: that Allah's help then comes swiftly to His men,\\n\\t\\t\\t\\tand they are delivered from persecution and danger, while\\n\\t\\t\\t\\tthe wrath of Allah overtakes sinners, and nothing can\\n\\t\\t\\t\\tthen ward it off. This interpretation has good authority\\n\\t\\t\\t\\tbehind it, though there are differences of opinion."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "111",
    "NoteID": "1796",
    "Body": "Their stories, i.e., the stories of Prophets or of the\\n\\t\\t\\t\\twicked; for the two threads inter-twine, as in Joseph's\\n\\t\\t\\t\\tstory."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "111",
    "NoteID": "1797",
    "Body": "A story like that of Joseph is not a purely imaginary\\n\\t\\t\\t\\tfable. The People of the Book have it in their sacred\\n\\t\\t\\t\\tliterature. It is confirmed here in its main outline, but\\n\\t\\t\\t\\there there is a detailed spiritual exposition that will\\n\\t\\t\\t\\tbe found nowhere in earlier literature. The exposition\\n\\t\\t\\t\\tcovers all sides of human life. If properly understood it\\n\\t\\t\\t\\tgives valuable lessons to guide our conduct,-an instance\\n\\t\\t\\t\\tof Allah's grace and mercy to people who will go to Him\\n\\t\\t\\t\\tin faith and put their affairs in His hands."
  }
]
