[
  {
    "SurahNumber": "112",
    "AyahNumber": "1",
    "NoteID": "6296",
    "Body": "The nature of Allah is here indicated to us in a few\\n\\t\\t\\t\\twords, such as we can understand. The qualities of Allah\\n\\t\\t\\t\\tare described in numerous places elsewhere, e.g., in lix.\\n\\t\\t\\t\\t22-24, lxii. 1, and ii. 255. Here we are specially taught\\n\\t\\t\\t\\tto avoid the pitfalls into which men and nations have\\n\\t\\t\\t\\tfallen at various times in trying to understand Allah.\\n\\t\\t\\t\\tThe first thing we have to note is that His nature is so\\n\\t\\t\\t\\tsublime, so far beyond our limited conceptions, that the\\n\\t\\t\\t\\tbest way in which we can realise Him is to feel that He\\n\\t\\t\\t\\tis a Personality, \"He\", and not a mere abstract\\n\\t\\t\\t\\tconception of philosophy. He is near us; He cares for us;\\n\\t\\t\\t\\twe owe our existence to Him. Secondly, He is the One and\\n\\t\\t\\t\\tOnly God, the Only One to Whom worship is due; all other\\n\\t\\t\\t\\tthings or beings that we can think of are His creatures\\n\\t\\t\\t\\tand in no way comparable to Him. Thirdly, He is Eternal,\\n\\t\\t\\t\\twithout beginning or end, Absolute, not limited by time\\n\\t\\t\\t\\tor place or circumstance, the Reality. Fourthly, we must\\n\\t\\t\\t\\tnot think of Him as having a son or a father, for that\\n\\t\\t\\t\\twould be to import animal qualities into our conception\\n\\t\\t\\t\\tof Him. Fifthly, He is not like any other person or thing\\n\\t\\t\\t\\tthat we know or can imagine: His qualities and nature are\\n\\t\\t\\t\\tunique."
  },
  {
    "SurahNumber": "112",
    "AyahNumber": "1",
    "NoteID": "6297",
    "Body": "This is to negative the idea of Polytheism, a system in\\n\\t\\t\\t\\twhich people believe in gods many and lords many. Such a\\n\\t\\t\\t\\tsystem is opposed to our truest and profoundest\\n\\t\\t\\t\\tconceptions of life. For Unity in Design, Unity in the\\n\\t\\t\\t\\tfundamental facts of existence, proclaim the Unity of the\\n\\t\\t\\t\\tMaker."
  },
  {
    "SurahNumber": "112",
    "AyahNumber": "2",
    "NoteID": "6298",
    "Body": "Samad is difficult to translate by one word. I have used\\n\\t\\t\\t\\ttwo, \"Eternal\" and \"Absolute\". The latter implies: (1)\\n\\t\\t\\t\\tthat absolute existence can only be predicated of Him;\\n\\t\\t\\t\\tall other existence is temporal or conditional; (2) that\\n\\t\\t\\t\\tHe is dependent on no person or things, but all persons\\n\\t\\t\\t\\tor things are dependent on Him, thus negativing the idea\\n\\t\\t\\t\\tof gods and goddesses who ate and drank, wrangled and\\n\\t\\t\\t\\tplotted, depended on the gifts of worshippers, etc."
  },
  {
    "SurahNumber": "112",
    "AyahNumber": "3",
    "NoteID": "6299",
    "Body": "This is to negative the Christian idea of the godhead,\\n\\t\\t\\t\\t\"the Father\", \"the only-begotten Son\" etc."
  },
  {
    "SurahNumber": "112",
    "AyahNumber": "4",
    "NoteID": "6300",
    "Body": "This sums up the whole argument and warns us specially\\n\\t\\t\\t\\tagainst Anthropomorphism, the tendency to conceive of\\n\\t\\t\\t\\tAllah after our own pattern, an insidious tendency that\\n\\t\\t\\t\\tcreeps in at all times and among all peoples."
  }
]
