[
  {
    "SurahNumber": "88",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "I.e., the Day of Resurrection."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "7",
    "NoteID": "2",
    "Body": "According to Al-Qiffal (as quoted by Razi), this kind of\\n\\t\\t\\t\\thellish drink and food is a metonym for utter\\n\\t\\t\\t\\thopelessness and abasement. As regards the noun dari' -\\n\\t\\t\\t\\twhich is said to be a bitter, thorny plant in its dried\\n\\t\\t\\t\\tstate (Jawhari) - it is to be borne in mind that it is\\n\\t\\t\\t\\tderived from the verb dara'a or dari'a, which signifies\\n\\t\\t\\t\\t\"he [or \"it\"] became abject\" or \"abased\", (ibid.): hence\\n\\t\\t\\t\\tmy rendering of this (obviously metaphorical) expression\\n\\t\\t\\t\\tas \"the bitterness of dry thorns\". A similarly\\n\\t\\t\\t\\tmetaphorical meaning attaches to the expression \"a\\n\\t\\t\\t\\tboiling spring\" in verse {5}, which recalls the term\\n\\t\\t\\t\\thamim so often mentioned in the Qur'an (see note [62] on\\n\\t\\t\\t\\tthe last sentence of  6:70 )."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "12",
    "NoteID": "3",
    "Body": "Lit., \"a spring\" - but, as Zamakhshari and Ibn Kathir\\n\\t\\t\\t\\tpoint out, the singular form has here a generic import,\\n\\t\\t\\t\\timplying \"a multitude of springs\". This metaphor of the\\n\\t\\t\\t\\tlife-giving element is analogous to that of the \"running\\n\\t\\t\\t\\twaters\" (anhar) frequently mentioned in Qur'anic\\n\\t\\t\\t\\tdescriptions of paradise."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "13",
    "NoteID": "4",
    "Body": "See note [34] on  15:47 ."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "17",
    "NoteID": "5",
    "Body": "Implying that a denial of resurrection and life in the\\n\\t\\t\\t\\thereafter renders the concept of a conscious Creator\\n\\t\\t\\t\\tutterly meaningless; hence my interpretation of the words\\n\\t\\t\\t\\t\"who deny resurrection\" in the first part of this verse.\\n\\t\\t\\t\\t- As regards the noun ibil, it denotes, as a rule,\\n\\t\\t\\t\\t\"camels\": a generic plural which has no singular form.\\n\\t\\t\\t\\tBut one must remember that it also signifies \"clouds\\n\\t\\t\\t\\tbearing rain-water\" (Lisan al-'Arab, Qamus, Taj al-'Arus)\\n\\t\\t\\t\\t- a meaning which is preferable in the present context.\\n\\t\\t\\t\\tIf the term were used in the sense of \"camels\", the\\n\\t\\t\\t\\treference to it in the above verse would have been\\n\\t\\t\\t\\tprimarily - if not exclusively - addressed to the Arabian\\n\\t\\t\\t\\tcontemporaries of the Prophet, to whom the camel was\\n\\t\\t\\t\\talways an object of admiration on account of its\\n\\t\\t\\t\\toutstanding endurance, the many uses to which it could be\\n\\t\\t\\t\\tput (riding, load-bearing, and as a source of milk, flesh\\n\\t\\t\\t\\tand fine wool) and its indispensability to people living\\n\\t\\t\\t\\tamid deserts. But precisely because a reference to\\n\\t\\t\\t\\t\"camels\" would restrict its significance to people of a\\n\\t\\t\\t\\tparticular environment and a particular time (without\\n\\t\\t\\t\\teven the benefit of a historical allusion to past\\n\\t\\t\\t\\tevents), it must be ruled out here, for the Qur'anic\\n\\t\\t\\t\\tappeals to observe the wonders of the God-created\\n\\t\\t\\t\\tuniverse are invariably directed at people of all times\\n\\t\\t\\t\\tand all environments. Hence, there is every reason to\\n\\t\\t\\t\\tassume that the term ibil relates here not to camels but\\n\\t\\t\\t\\tto \"clouds pregnant with water\": the more so as such an\\n\\t\\t\\t\\tallusion to the miraculous, cyclic process of the\\n\\t\\t\\t\\tevaporation of water, the skyward ascension of vapour,\\n\\t\\t\\t\\tits condensation and, finally, its precipitation over the\\n\\t\\t\\t\\tearth is definitely more in tune with the subsequent\\n\\t\\t\\t\\tmention (in verses {18-20}) of sky, mountains and earth,\\n\\t\\t\\t\\tthan would be a reference to \"camels\", however admirable\\n\\t\\t\\t\\tand noteworthy these animals may be."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "22",
    "NoteID": "6",
    "Body": "Lit., \"thou hast no power over them\"."
  }
]
