[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/058001",
        "Body":  "Allah has indeed heard (and accepted) the statement of the woman\n\t\t\twho pleads with thee concerning her husband and carries her\n\t\t\tcomplaint (in prayer) to Allah: and Allah (always) hears the\n\t\t\targuments between both sides among you: for Allah hears and sees\n\t\t\t(all things). \u003cspan class=\u0027fn\u0027\u003e5330\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5331\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/058010",
        "Body":  "Secret counsels are only (inspired) by the Evil One in order that\n\t\t\the may cause grief to the Believers; but he cannot harm them in\n\t\t\tthe least except as Allah permits; and on Allah let the Believers\n\t\t\tput their trust. \u003cspan class=\u0027fn\u0027\u003e5346\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/058011",
        "Body":  "O ye who believe! When ye are told to make room in the assemblies\n\t\t\t(spread out and) make room: (Ample) room will Allah provide for\n\t\t\tyou. And when ye are told to rise up rise up: Allah will raise up\n\t\t\tto (suitable) ranks (and degrees) those of you who believe and\n\t\t\twho have been granted Knowledge: and Allah is well-acquainted\n\t\t\twith all ye do. \u003cspan class=\u0027fn\u0027\u003e5347\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5348\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5349\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/058012",
        "Body":  "O ye who believe! W hen ye consult the Apostle in private spend\n\t\t\tsomething in charity before your private consultation.\tThat will\n\t\t\tbe best for you and most conducive to purity (of conduct).  But\n\t\t\tif ye find not (the wherewithal) Allah is Oft-Forgiving Most\n\t\t\tMerciful. \u003cspan class=\u0027fn\u0027\u003e5350\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5351\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/058013",
        "Body":  "Is it that ye are afraid of spending sums in charity before your\n\t\t\tprivate consultation (with him)? If then ye do not so and Allah\n\t\t\tforgives you then (at least) establish regular prayer; practice\n\t\t\tregular charity; and obey Allah and His Apostle: and Allah is\n\t\t\twell-acquainted will all that ye do. \u003cspan class=\u0027fn\u0027\u003e5352\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5353\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/058014",
        "Body":  "Turnest thou not thy attention to those who turn (in friendship)\n\t\t\tto such as have the Wrath of Allah upon them? They are neither of\n\t\t\tyou nor of them and they swear to falsehood knowingly.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5354\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5355\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5356\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/058015",
        "Body":  "Allah has prepared for them a severe Penalty: evil indeed are\n\t\t\ttheir deeds."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/058016",
        "Body":  "They have made their oaths a screen (for their misdeeds): Thus\n\t\t\tthey obstruct (men) from the Path of Allah: therefore shall they\n\t\t\thave a humiliating Penalty. \u003cspan class=\u0027fn\u0027\u003e5357\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/058017",
        "Body":  "Of no profit whatever to them against Allah will be their riches\n\t\t\tnor their sons: They will be Companions of the Fire to dwell\n\t\t\ttherein (for aye)! \u003cspan class=\u0027fn\u0027\u003e5358\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/058018",
        "Body":  "One day will Allah raise them all up (for Judgment): then will\n\t\t\tthey swear to Him as they swear to you: and they think that they\n\t\t\thave something (to stand upon): No indeed! they are but liars!\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5359\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/058019",
        "Body":  "The Evil One has got the better of them: So he has made them lose\n\t\t\tthe remembrance of Allah.  They are the Party of the Evil One. \n\t\t\tTruly it is the Party of the Evil One that will perish!\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5360\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/058002",
        "Body":  "If any men among you divorce their wives by Zihar (calling them\n\t\t\tmothers) they cannot be their mothers: none can be their mothers\n\t\t\texcept those who gave them birth.  And in fact they use words\n\t\t\t(both) iniquitous and false: but truly Allah is one that blots\n\t\t\tout (sins) and forgives (again and again). \u003cspan class=\u0027fn\u0027\u003e5332\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5333\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5334\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/058020",
        "Body":  "Those who resist Allah and His Apostle will be among those most\n\t\t\thumiliated. \u003cspan class=\u0027fn\u0027\u003e5361\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/058021",
        "Body":  "Allah has decreed: \"It is I and My Apostle who must prevail\": For\n\t\t\tAllah is One full of strength able to enforce His Will.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5362\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/058022",
        "Body":  "Thou wilt not find any people who believe in Allah and the Last\n\t\t\tDay loving those who resist Allah and His Apostle even though\n\t\t\tthey were their fathers or their sons or their brothers or their\n\t\t\tkindred.  For such He has written Faith in their hearts and\n\t\t\tstrengthened them with a spirit from Himself.  And He will admit\n\t\t\tthem to Gardens beneath which Rivers flow to dwell therein (for\n\t\t\tever).\tAllah will be well pleased with them and they with Him. \n\t\t\tThey are the Party of Allah. Truly it is the Party of Allah that\n\t\t\twill achieve Felicity. \u003cspan class=\u0027fn\u0027\u003e5363\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5364\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5365\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5366\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5367\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/058003",
        "Body":  "But those who divorce their wives by Zihar then wish to go back\n\t\t\ton the words they uttered (it is ordained that such a one) should\n\t\t\tfree a slave before they touch each other: this are ye admonished\n\t\t\tto perform: and Allah is well-acquainted with (all) that ye do.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5335\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/058004",
        "Body":  "And if any has not (the wherewithal) he should fast for two\n\t\t\tmonths consecutively before they touch each other.  But if any is\n\t\t\tunable to do so he should feed sixty indigent ones.  This that ye\n\t\t\tmay show your faith in Allah and His Apostle.  Those are limits\n\t\t\t(set by) Allah. For those who Reject (Him) there is a grievous\n\t\t\tPenalty. \u003cspan class=\u0027fn\u0027\u003e5336\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5337\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5338\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/058005",
        "Body":  "Those who resist Allah and His Apostle will be humbled to dust as\n\t\t\twere those before them: for We have already sent down clear\n\t\t\tSigns.\tAnd the Unbelievers (will have) a humiliating Penalty ."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/058006",
        "Body":  "On the Day that Allah will raise them all up (again) and show\n\t\t\tthem the truth (and meaning) of their conduct.\tAllah has\n\t\t\treckoned its (value) though they may have forgotten it: for Allah\n\t\t\tis Witness to all things. \u003cspan class=\u0027fn\u0027\u003e5340\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/058007",
        "Body":  "Seest thou not that Allah doth know (all) that is in the heavens\n\t\t\tand on earth? There is not a secret consultation between three\n\t\t\tbut He makes the fourth among them nor between five but He makes\n\t\t\tthe sixth nor between fewer nor more but He is in their midst\n\t\t\twheresoever they be: in the end will He tell them the truth of\n\t\t\ttheir conduct on the Day of Judgment for Allah has full knowledge\n\t\t\tof all things. \u003cspan class=\u0027fn\u0027\u003e5341\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/058008",
        "Body":  "Turnest thou not thy sight towards those who were forbidden\n\t\t\tsecret counsels yet revert to that which they were forbidden (to\n\t\t\tdo)? And they hold secret counsels among themselves for iniquity\n\t\t\tand hostility and disobedience to the Apostle.\tAnd when they\n\t\t\tcome to thee they salute thee not as Allah salutes thee (but in\n\t\t\tcrooked ways): and they say to themselves \"Why does not Allah\n\t\t\tpunish us for our words?\" Enough for them is Hell: in it will\n\t\t\tthey burn and evil is that destination! \u003cspan class=\u0027fn\u0027\u003e5342\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5343\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5344\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "58",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/058009",
        "Body":  "O ye who believe! when ye hold secret counsel do it not for\n\t\t\tiniquity and hostility and disobedience to the Prophet; but do it\n\t\t\tfor righteousness and self-restraint; and fear Allah to whom ye\n\t\t\tshall be brought back. \u003cspan class=\u0027fn\u0027\u003e5345\u003c/span\u003e"
    }
]
