[
  {
    "SurahNumber": "87",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "I.e., He endows it with inner coherence and with\\n\\t\\t\\t\\tqualities consistent with the functions which it is meant\\n\\t\\t\\t\\tto perform, and thus adapts it a priori to the exigencies\\n\\t\\t\\t\\tof its existence."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Cf. the last sentence of  25:2  and the corresponding\\n\\t\\t\\t\\tnote [3]; also  20:50  and note [31]."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "I.e., metonymically, \"who brings forth life and deals\\n\\t\\t\\t\\tdeath\"."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "The classical commentators assume that the above words\\n\\t\\t\\t\\tare addressed specifically to the Prophet, and that,\\n\\t\\t\\t\\ttherefore, they relate to his being taught the Qur'an and\\n\\t\\t\\t\\tbeing promised that he would not forget anything thereof,\\n\\t\\t\\t\\t\"save what God may will [thee to forget]\". This last\\n\\t\\t\\t\\tclause has ever since given much trouble to the\\n\\t\\t\\t\\tcommentators, inasmuch as it is not very plausible that\\n\\t\\t\\t\\tHe who has revealed the Qur'an to the Prophet should\\n\\t\\t\\t\\tcause him to forget anything of it. Hence, many\\n\\t\\t\\t\\tunconvincing explanations have been advanced from very\\n\\t\\t\\t\\tearly times down to our own days, the least convincing\\n\\t\\t\\t\\tbeing that last refuge of every perplexed\\n\\t\\t\\t\\tQuran-commentator, the \"doctrine of abrogation\" (refuted\\n\\t\\t\\t\\tin my note [87] on  2:106 ). However, the supposed\\n\\t\\t\\t\\tdifficulty of interpretation disappears as soon as we\\n\\t\\t\\t\\tallow ourselves to realize that the above passage, though\\n\\t\\t\\t\\tostensibly addressed to the Prophet, is directed at man\\n\\t\\t\\t\\tin general, and that it is closely related to an earlier\\n\\t\\t\\t\\tQuranic revelation - namely, the first five verses of\\n\\t\\t\\t\\tsurah {96} (\"The Germ-Cell\") and, in particular, verses\\n\\t\\t\\t\\t{3-5}, which speak of God's having \"taught man what he\\n\\t\\t\\t\\tdid not know\". In note [3] on those verses I have\\n\\t\\t\\t\\texpressed the opinion that they allude to mankind's\\n\\t\\t\\t\\tcumulative acquisition of empirical and rational\\n\\t\\t\\t\\tknowledge, handed down from generation to generation and\\n\\t\\t\\t\\tfrom one civilization to another: and it is to this very\\n\\t\\t\\t\\tphenomenon that the present passage, too, refers. We are\\n\\t\\t\\t\\ttold here that God, who has formed man in accordance with\\n\\t\\t\\t\\twhat he is meant to be and has promised to guide him,\\n\\t\\t\\t\\twill enable him to acquire (and thus, as it were,\\n\\t\\t\\t\\t\"impart\" to him) elements of knowledge which mankind will\\n\\t\\t\\t\\taccumulate, record and collectively \"remember\" - except\\n\\t\\t\\t\\twhat God may cause man to \"forget\" (in another word, to\\n\\t\\t\\t\\tabandon) as having become redundant by virtue of his new\\n\\t\\t\\t\\texperiences and his acquisition of wider, more\\n\\t\\t\\t\\tdifferentiated elements of knowledge, empirical as well\\n\\t\\t\\t\\tas deductive or speculative, including more advanced,\\n\\t\\t\\t\\tempirically acquired skills. However, the very next\\n\\t\\t\\t\\tsentence makes it clear that all knowledge arrived at\\n\\t\\t\\t\\tthrough our observation of the external world and through\\n\\t\\t\\t\\tspeculation, though necessary and most valuable, is\\n\\t\\t\\t\\tdefinitely limited in scope and does not, therefore, in\\n\\t\\t\\t\\titself suffice to give us an insight into ultimate\\n\\t\\t\\t\\ttruths."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "I.e., all that is intrinsically beyond the reach of human\\n\\t\\t\\t\\tperception (al-ghayb): the implication being that, since\\n\\t\\t\\t\\thuman knowledge must forever remain imperfect, man cannot\\n\\t\\t\\t\\treally find his way through life without the aid of\\n\\t\\t\\t\\tdivine revelation."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "I.e., towards an ease of the mind and peace of the\\n\\t\\t\\t\\tspirit."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "Thus Baghawi, as well as Razi in one of his alternative\\n\\t\\t\\t\\tinterpretations of this phrase."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "13",
    "NoteID": "8",
    "Body": "I.e., in consequence of having remained aloof from the\\n\\t\\t\\t\\tdivine reminder. (Cf. {74:2-29}.)"
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "19",
    "NoteID": "9",
    "Body": "These two names are given here only as examples of\\n\\t\\t\\t\\tearlier prophetic revelations, thus stressing, once\\n\\t\\t\\t\\tagain, the twofold fact of continuity in mankind's\\n\\t\\t\\t\\treligious experiences and of the identity of the basic\\n\\t\\t\\t\\ttruths preached by all the prophets. (Cf. also  53:36 \\n\\t\\t\\t\\tff.) The noun suhuf (sing. sahifah), which literally\\n\\t\\t\\t\\tdenotes \"leaves [of a book]\" or \"scrolls\", is synonymous\\n\\t\\t\\t\\twith kitab in all the senses of this term (Jawhari):\\n\\t\\t\\t\\thence, in the above context, \"revelations\"."
  }
]
