[
  {
    "SurahNumber": "10",
    "AyahNumber": "1",
    "Text": "Alif L'am Ra. These are the verses of the Book of Wisdom."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "2",
    "Text": "Does it seem strange to the people that We revealed Our will to a\\n\\t\\t\\tman from among themselves, saying: \"Warn mankind and give the\\n\\t\\t\\tgood news to the Believers that they are on sound footing with\\n\\t\\t\\ttheir Rabb?\" The disbelievers say: \"This man is indeed an obvious\\n\\t\\t\\tmagician!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "3",
    "Text": "The fact is that your Rabb is the same Allah Who created the\\n\\t\\t\\theavens and the earth in six Yome (time periods) and is firmly\\n\\t\\t\\testablished on the Throne of authority, and is directing the\\n\\t\\t\\taffairs of the universe. None can intercede for you, except the\\n\\t\\t\\tone who receives His permission. This is Allah your Rabb, so\\n\\t\\t\\tworship Him: will you not receive admonition?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "4",
    "Text": "To Him you shall all return. Allah's promise is true. He is the\\n\\t\\t\\tOne Who originates the process of Creation and repeats it (will\\n\\t\\t\\tbring it back to life) so that He may justly reward those who\\n\\t\\t\\tbelieved in Him and did righteous deeds. As for those who\\n\\t\\t\\tdisbelieved, they shall have boiling fluids to drink and shall\\n\\t\\t\\tundergo a painful punishment because they rejected the truth."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "5",
    "Text": "He is the One Who gave the sun its brightness and the moon its\\n\\t\\t\\tlight, established her phases that you may learn to compute the\\n\\t\\t\\tyears and other such counts (days, weeks, months). Allah created\\n\\t\\t\\tthem only to manifest the truth. He has spelled out His\\n\\t\\t\\trevelations for people who want to understand."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "6",
    "Text": "Indeed in the alternation of the night and the day and what Allah\\n\\t\\t\\thas created in the heavens and the earth, there are signs for\\n\\t\\t\\tthose who are Godfearing."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "7",
    "Text": "As for those who do not hope to meet Us on the Day of Judgement,\\n\\t\\t\\tbeing well pleased and satisfied with this worldly life and those\\n\\t\\t\\twho give no heed to Our revelations,"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "8",
    "Text": "they shall have the Fire as their abode because of what they had\\n\\t\\t\\tearned (erroneous creed and wrong conduct)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "9",
    "Text": "It is also a fact that those who believe sincerely in the truth\\n\\t\\t\\twhich is revealed in this Book and do good deeds, their Rabb will\\n\\t\\t\\tguide them because of their faith and rivers will flow beneath\\n\\t\\t\\ttheir feet in the gardens of bliss."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "10",
    "Text": "Their slogan therein will be: \"Glory to You O Allah!\" And their\\n\\t\\t\\tgreetings therein will be \"Peace be upon you!\" And their closing\\n\\t\\t\\tremarks will be: \"All praises are for Allah Alone, the Rabb of\\n\\t\\t\\tthe Worlds!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "11",
    "Text": "If Allah were to hasten the punishment for their evil as they\\n\\t\\t\\thasten in asking good of this world, then the respite given to\\n\\t\\t\\tthe people would have been terminated, but this is not Our way.\\n\\t\\t\\tWe leave those people alone who do not entertain the hope of\\n\\t\\t\\tmeeting Us, to blunder about in their rebellion."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "12",
    "Text": "Whenever affliction touches a man, he prays to Us, whether lying\\n\\t\\t\\tdown on his side, sitting, or standing on his feet. But as soon\\n\\t\\t\\tas We relieve his affliction he walks away as if he had never\\n\\t\\t\\tprayed to Us for removing that affliction which touched him! Thus\\n\\t\\t\\tthe foul deeds which they do are made fair-seeming to the\\n\\t\\t\\ttransgressors."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "13",
    "Text": "We have destroyed generations before your time when they adopted\\n\\t\\t\\tunjust attitudes: their Rasools came to them with clear signs but\\n\\t\\t\\tthey would not believe! Thus, do We requite the criminals."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "14",
    "Text": "Then, We made you their successors in the land so that We may\\n\\t\\t\\tobserve how you would conduct yourselves."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "15",
    "Text": "When Our clear revelations are recited to them, those who\\n\\t\\t\\tentertain no hope of meeting Us say to you: \"Bring us a Qur'an\\n\\t\\t\\tdifferent than this or make some changes in it.\" O Muhammad, tell\\n\\t\\t\\tthem: \"It is not possible for me to change it myself. I follow\\n\\t\\t\\tonly what is revealed to me. Indeed, I cannot disobey my Rabb,\\n\\t\\t\\tfor I fear the punishment of a Mighty Day.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "16",
    "Text": "Say: \"If Allah wanted otherwise, I would have not recited this\\n\\t\\t\\t(Qur'an) to you, nor would have made you aware of it. Indeed, a\\n\\t\\t\\twhole lifetime I lived among you before its revelation. Why you\\n\\t\\t\\tdo not use your common-sense?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "17",
    "Text": "Who can be more unjust than the one who himself forges a lie,\\n\\t\\t\\tthen ascribes it to Allah or falsifies His real Revelations?\\n\\t\\t\\tIndeed, such criminals can never prosper."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "18",
    "Text": "They worship other deities besides Allah, who can neither harm\\n\\t\\t\\tthem nor benefit them, and they say: \"These are our intercessors\\n\\t\\t\\twith Allah.\" O Muhammad, say to them: \"Are you informing Allah of\\n\\t\\t\\twhat He knows to exist neither in the heavens nor on the earth?\\n\\t\\t\\tGlory to Him! He is far above from having the partners they\\n\\t\\t\\tascribe to Him!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "19",
    "Text": "Mankind was once just one nation; later on they became divided\\n\\t\\t\\tthrough inventing different creeds. If your Rabb had not already\\n\\t\\t\\tgiven His word ( specified time for the life of mankind on\\n\\t\\t\\tEarth), the matters in which they differ would have certainly\\n\\t\\t\\tbeen decided."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "20",
    "Text": "In regards to their saying: \"Why has not a sign been sent down to\\n\\t\\t\\thim (Muhammad) from his Rabb?\" Tell them: \" Allah Alone has the\\n\\t\\t\\tknowledge of the unseen. Wait if you will: I too shall wait with\\n\\t\\t\\tyou.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "21",
    "Text": "When We show mercy to mankind after some calamity had afflicted\\n\\t\\t\\tthem, they begin to plot against Our revelations! Tell them:\\n\\t\\t\\t\"Allah is more swift in plotting than you; indeed Our angels are\\n\\t\\t\\trecording all the plots you make.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "22",
    "Text": "He is the One Who enables you to travel through the land and by\\n\\t\\t\\tthe sea; until when you are on board a ship, as the ship sails\\n\\t\\t\\twith a favorable wind and they feel happy about it; but when\\n\\t\\t\\tthere comes a stormy wind and the waves reach them from all sides\\n\\t\\t\\tand they think they are being overwhelmed: then they pray to\\n\\t\\t\\tAllah with their sincere devotion, saying, \"If You deliver us\\n\\t\\t\\tfrom this, we shall become your true thankful devotees!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "23",
    "Text": "Yet, when He does deliver them, behold! The same people become\\n\\t\\t\\tunjustly rebellious in the land. O mankind! Your rebellion is\\n\\t\\t\\tagainst your own souls - (you may enjoy) the transitory pleasure\\n\\t\\t\\tof this world - in the end you have to return to Us, then We\\n\\t\\t\\tshall inform you of what you have done."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "24",
    "Text": "The example of this worldly life (which you love so much that you\\n\\t\\t\\thave even become neglectful of Our signs) is like the water which\\n\\t\\t\\tWe send down from the sky; it mingles with the soil and produces\\n\\t\\t\\tvegetation which becomes the food for men and animals. Then, at\\n\\t\\t\\tthe very time when the crops are ripened and the land looks\\n\\t\\t\\tattractive, the people to whom it belongs think that they are\\n\\t\\t\\table to cultivate it, and there comes Our scourge upon it, by\\n\\t\\t\\tnight or in broad day, and We mow it down thoroughly as if\\n\\t\\t\\tnothing existed there yesterday! Thus do We spell out Our signs\\n\\t\\t\\tfor those who are thoughtful."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "25",
    "Text": "Allah invites you to the Home of Peace and guides whom He pleases\\n\\t\\t\\tto the Right Way."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "26",
    "Text": "Those who do good deeds shall have a good reward and even more\\n\\t\\t\\tthan they deserve! Neither blackness nor disgrace shall cover\\n\\t\\t\\ttheir faces. They will be the inhabitants of paradise; they will\\n\\t\\t\\tlive therein forever."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "27",
    "Text": "As for those who have done evil deeds, they will be rewarded with\\n\\t\\t\\tlike evil: disgrace will cover them - they shall have none to\\n\\t\\t\\tprotect them from Allah - as if their faces have been covered\\n\\t\\t\\twith patches of the dense darkness of night. They will become the\\n\\t\\t\\tinmates of the Fire; they will live therein forever."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "28",
    "Text": "On the Day when We shall gather them all together, We shall say\\n\\t\\t\\tto those who committed shirk (associated other deities with Us):\\n\\t\\t\\t\"Stay where you are, you and those whom you set as partners with\\n\\t\\t\\tUs.\" We will separate them from one another, then the shoraka'\\n\\t\\t\\t(partners they had set up with Us) will say: \"It was not us that\\n\\t\\t\\tyou worshipped!"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "29",
    "Text": "Allah is an all-sufficient witness between you and us, (even if\\n\\t\\t\\tyou worshipped us) we were quite unaware of your worship.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "30",
    "Text": "Thereupon, every soul shall know what it had sent forth, as they\\n\\t\\t\\twill be brought in the Court of Allah, their true Patron, and\\n\\t\\t\\ttheir invented falsehoods will leave them in the lurch."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "31",
    "Text": "Ask them: \"Who provides your sustenance from the heaven and from\\n\\t\\t\\tthe earth? Who has control over hearing and sight? Who brings\\n\\t\\t\\tforth the living from the dead and the dead from the living? Who\\n\\t\\t\\tregulates the universe?\" They will soon reply: \"Allah.\" Say: \"Why\\n\\t\\t\\tdo you not then fear Him for you going against the truth?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "32",
    "Text": "The same Allah is your real Rabb: What is left after the truth\\n\\t\\t\\texcept falsehood? How then can you turn away?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "33",
    "Text": "Thus has the Word of your Rabb proved true in regards to the\\n\\t\\t\\ttransgressors that they do not believe."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "34",
    "Text": "Ask them: \"Can any of your shoraka' (the deities you worship\\n\\t\\t\\tbesides Allah) create anything and then repeat its process?\" If\\n\\t\\t\\tthey do not answer, then tell them: \"Well, Allah creates and then\\n\\t\\t\\trepeats the process. Then how is that you are so misled?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "35",
    "Text": "Again ask them: \"Is there any of your shoraka' who can guide you\\n\\t\\t\\tto the truth?\" If they do not answer, then tell them: \"Well,\\n\\t\\t\\tAllah can guides you to the truth. Then who is more worthy to be\\n\\t\\t\\tfollowed: He that can guide to the truth, or he that cannot and\\n\\t\\t\\tis himself in need of guidance? What is the matter with you? What\\n\\t\\t\\tkind of judgement do you make?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "36",
    "Text": "The fact is that most of them follow nothing but mere conjecture\\n\\t\\t\\tand conjecture is in no way a substitute for the truth. Surely\\n\\t\\t\\tAllah is well aware of all that they do."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "37",
    "Text": "This Qur'an is not such as could be produced by anyone other than\\n\\t\\t\\tAllah; in fact it is the confirmation of prior revelations\\n\\t\\t\\t(Psalms, Torah, and Gospel) and fully explains the Holy Book\\n\\t\\t\\t(prior scriptures); there is no doubt in this fact that it is\\n\\t\\t\\t(revealed) from the Rabb of the Worlds."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "38",
    "Text": "Do they say: \"He (the Prophet) has forged it?\" Tell them: \"If\\n\\t\\t\\twhat you say be true; then produce one Surah like this, you may\\n\\t\\t\\teven call to your aid anyone you want other than Allah.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "39",
    "Text": "Nay! They do not believe that which they cannot grasp, for they\\n\\t\\t\\thave not yet seen its prophecy fulfilled. The same way those who\\n\\t\\t\\tpassed before them disbelieved. But see what was the end of the\\n\\t\\t\\twrongdoers!"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "40",
    "Text": "Of these people there are some who will believe in it and some\\n\\t\\t\\twill not: and your Rabb best knows the troublemakers."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "41",
    "Text": "If they do not believe you, say: \"I am responsible for my actions\\n\\t\\t\\tand you are for yours! You are not accountable for my actions,\\n\\t\\t\\tnor I am responsible for what you do.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "42",
    "Text": "There are some among them who pretend to hear you what you say:\\n\\t\\t\\tbut can you make the deaf listen to you, incapable as they are of\\n\\t\\t\\tunderstanding?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "43",
    "Text": "Then there are some among them who pretend to look at you: but\\n\\t\\t\\tcan you show the way to blind, bereft as they are of sight?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "44",
    "Text": "The fact is that Allah does not do injustice to mankind in any\\n\\t\\t\\tway: but men are unjust to their own souls."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "45",
    "Text": "On that Day when He will gather them all together, it will appear\\n\\t\\t\\tto them as if they had not stayed in this world but an hour of a\\n\\t\\t\\tday to get to know each other. At that time they will realize\\n\\t\\t\\tthat: in fact the losers are those who denied the meeting with\\n\\t\\t\\tAllah and were not rightly guided."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "46",
    "Text": "Whether We show you in your lifetime some consequences of what We\\n\\t\\t\\thave promised them, or cause you to die before that, in any case\\n\\t\\t\\tthey will have to return to Us: moreover Allah is watching all\\n\\t\\t\\ttheir actions."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "47",
    "Text": "Every nation was sent a Rasool. Once their Rasool came, judgement\\n\\t\\t\\twas passed between them with all fairness and they were not\\n\\t\\t\\twronged in the least."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "48",
    "Text": "They ask: \"When will this promise be fulfilled, tell us if what\\n\\t\\t\\tyou say be true?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "49",
    "Text": "Say: \"I have no control over any harm or benefit to myself,\\n\\t\\t\\texcept what Allah wills. For every nation there is a deadline:\\n\\t\\t\\twhen their deadline comes, it can neither be delayed for even a\\n\\t\\t\\tmoment, nor it can be advanced."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "50",
    "Text": "Say: \"Have you ever considered that if his scourge fall upon you\\n\\t\\t\\tby night or by day you can do nothing to avert it? What then is\\n\\t\\t\\tthere that the criminals wish to hasten?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "51",
    "Text": "Would you believe it when it actually overtakes you? Then you\\n\\t\\t\\twould beg it to be removed although it had been your own wish to\\n\\t\\t\\thurry it on.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "52",
    "Text": "Then it will be said to the wrongdoers: \"Taste the everlasting\\n\\t\\t\\tpunishment! Should you not be rewarded according to your deeds?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "53",
    "Text": "They ask you: \"Is what you say really true?\" Tell them: \"Yes! By\\n\\t\\t\\tmy Rabb, it is absolutely true! And you will not be able to avert\\n\\t\\t\\tit.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "54",
    "Text": "If every person that has done injustice possessed all that the\\n\\t\\t\\tearth contains, he would be willing to offer it all in ransom to\\n\\t\\t\\tredeem himself if he could. They will regret in their hearts when\\n\\t\\t\\tthey see the punishment of Hell. The decision between them will\\n\\t\\t\\tbe made with justice and no wrong will be done to them."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "55",
    "Text": "Be aware! All that is in the heavens and the earth belongs to\\n\\t\\t\\tAllah. Be aware! The promise of Allah is true, yet most of them\\n\\t\\t\\tdo not know."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "56",
    "Text": "He is the One Who gives life and causes death, and to Him you\\n\\t\\t\\tshall all return."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "57",
    "Text": "O mankind! There has come to you an instruction from your Rabb, a\\n\\t\\t\\tcure for whatever (disease) is in your hearts, a guidance and a\\n\\t\\t\\tblessing for the true believers."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "58",
    "Text": "Say: \"It is the grace and mercy of Allah (that He has sent this\\n\\t\\t\\tQur'an), so let the people rejoice over it, for it is better than\\n\\t\\t\\t(the worldly riches) they are collecting.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "59",
    "Text": "O Prophet, ask them: \"Have you ever considered that out of the\\n\\t\\t\\tsustenance which Allah has given you, you yourselves have made\\n\\t\\t\\tsome things Halal (lawful) and others Haram (unlawful)? Ask them:\\n\\t\\t\\t\"Did Allah permit you to do so, or do you ascribe a false thing\\n\\t\\t\\tto Allah?\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "60",
    "Text": "What treatment do they think those people will get, who ascribe\\n\\t\\t\\tfalse things to Allah, on the Day of Resurrection? Indeed Allah\\n\\t\\t\\tis full of grace to mankind, but most of them are not grateful."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "61",
    "Text": "No matter what affairs you may be engaged in, what portion from\\n\\t\\t\\tthe Qur'an you may be reciting and whatever deeds you may be\\n\\t\\t\\tdoing; We are a Witnesses thereof when you are deeply occupied\\n\\t\\t\\twith it: for there is not even an iota of anything in the earth\\n\\t\\t\\tor in the heaven that is hidden from your Rabb, neither anything\\n\\t\\t\\tsmaller than that nor larger, but is recorded in a Glorious Book."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "62",
    "Text": "Be aware! The friend of Allah has nothing to fear or to regret."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "63",
    "Text": "Those who believe and (constantly) guard against evil,"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "64",
    "Text": "for them there is good news in this life and in the hereafter -\\n\\t\\t\\tAllah's Words do not change - this is indeed the mighty\\n\\t\\t\\tachievement."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "65",
    "Text": "O Prophet, let not their remarks grieve you: surely all honor\\n\\t\\t\\tbelongs to Allah: He hears all and knows all."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "66",
    "Text": "Be aware! Indeed whatever is in the Heavens and in the Earth\\n\\t\\t\\tbelongs to Allah. Those who invoke other deities besides Allah\\n\\t\\t\\tfollow nothing but conjectures and preach nothing but falsehood."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "67",
    "Text": "He is the One Who has made the night for you to rest therein and\\n\\t\\t\\tthe day so that you can see. Indeed, there are signs in this for\\n\\t\\t\\tthose who listen to His message."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "68",
    "Text": "They (Jews and Christians) say: \"Allah has begotten a son!\" Glory\\n\\t\\t\\tbe to Him! He is self-sufficient! His is all that is in the\\n\\t\\t\\tHeavens and in the Earth! Have you any proof for what you say?\\n\\t\\t\\tWould you ascribe to Allah something about which you have no\\n\\t\\t\\tknowledge?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "69",
    "Text": "O Prophet, tell them: \"Those who ascribe false things to Allah\\n\\t\\t\\twill never prosper.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "70",
    "Text": "Well, they may have a little enjoyment in this world, but\\n\\t\\t\\teventually they have to return to Us and then We will make them\\n\\t\\t\\ttaste the severest punishment for their unbelief."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "71",
    "Text": "Quote to them the story of Nuh (Noah) when he said to his people:\\n\\t\\t\\t\"O my people! If it offends you that I should live among you and\\n\\t\\t\\tpreach to you the revelations of Allah, then you should know that\\n\\t\\t\\tI have put my trust in Allah. Go ahead and muster all your\\n\\t\\t\\tshoraka' (deities you worship) and come up with your united\\n\\t\\t\\tdecision. Plan it well so that you may not have any doubt about\\n\\t\\t\\tits being foolproof. Then execute it against me and give me no\\n\\t\\t\\trespite."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "72",
    "Text": "If you have turned away from my message, I did not lose any\\n\\t\\t\\tthing, for I did not ask any reward from you for my services: my\\n\\t\\t\\treward is only with Allah, I have been commanded to become a\\n\\t\\t\\tMuslim.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "73",
    "Text": "But they disbelieved him. As a result, We saved him and those of\\n\\t\\t\\tthem who were with him in the Ark and We made them successors in\\n\\t\\t\\tthe Earth and drowned those who rejected Our revelations. You see\\n\\t\\t\\twhat was the end of those who were warned but did not believe!"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "74",
    "Text": "Then after him We sent Rasools to their descendants. They came to\\n\\t\\t\\tthem with clear signs but they would not believe what they had\\n\\t\\t\\trejected before. Thus, do We set seals upon the hearts of those\\n\\t\\t\\twho (intentionally) exceed the limits."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "75",
    "Text": "Then later on We sent Musa (Moses) and Haroon (Aaron) to Fir'on\\n\\t\\t\\t(Pharaoh) and his chiefs with Our signs. But they showed\\n\\t\\t\\tarrogance, for they were a guilty nation."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "76",
    "Text": "When the truth did come to them from Us they said: \"This is\\n\\t\\t\\tindeed sheer magic!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "77",
    "Text": "Musa replied: \"Is this what you say of the Truth when it has come\\n\\t\\t\\tto you? Is this a magic? Magicians do not prosper.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "78",
    "Text": "They said: \"Have you come to turn us away from the faith of our\\n\\t\\t\\tforefathers in order that you two (Musa and Haroon) may become\\n\\t\\t\\tthe leaders in the land? We will never believe in you!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "79",
    "Text": "Fir'on said: \"Bring me every skillful magician.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "80",
    "Text": "When the magicians came, Musa said to them: \"Throw what you wish\\n\\t\\t\\tto throw!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "81",
    "Text": "So when they had thrown, Musa said: \"The magic that you have\\n\\t\\t\\tbrought, Allah will surely prove it wrong: for Allah does not\\n\\t\\t\\tpromote the work of mischief makers."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "82",
    "Text": "By His Words Allah vindicates the truth, much as the criminals\\n\\t\\t\\tmay dislike it!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "83",
    "Text": "None but a few youth from his own people believed in Musa\\n\\t\\t\\t(Moses), because of the fear of Fir'on (Pharaoh) and his chiefs,\\n\\t\\t\\tlest they should persecute them; and certainly Fir'on was mighty\\n\\t\\t\\tin the land and the one who did not hesitate to transgress any\\n\\t\\t\\tlimit."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "84",
    "Text": "Musa said: \"O my people! If you sincerely believe in Allah, then\\n\\t\\t\\tput your trust in Him, if you are really Muslims.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "85",
    "Text": "They replied: \"In Allah do we put our trust. Our Rabb! Do not let\\n\\t\\t\\tus suffer at the hands of unjust people,"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "86",
    "Text": "and deliver us through Your mercy, from the nation of\\n\\t\\t\\tunbelievers.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "87",
    "Text": "We revealed Our will to Musa and his brother, saying: \"Take your\\n\\t\\t\\tpeople to dwell in Egypt, and make your houses as your Qiblah\\n\\t\\t\\t(places of worship) and establish Salah and give good news to the\\n\\t\\t\\tbelievers!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "88",
    "Text": "Musa prayed: \"Our Rabb! You have indeed bestowed on Fir'on and\\n\\t\\t\\this chiefs splendor and wealth in this worldly life. Our Rabb,\\n\\t\\t\\thave you done this so that they may mislead people from Your way?\\n\\t\\t\\tOur Rabb, destroy their wealth and harden their hearts, so that\\n\\t\\t\\tthey may not believe until they see the painful punishment.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "89",
    "Text": "Allah replied: \"Your prayer shall be answered! So remain\\n\\t\\t\\tsteadfast and do not follow the path of those who have no\\n\\t\\t\\tknowledge.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "90",
    "Text": "We led the Children of Israel across the sea. Fir'on and his\\n\\t\\t\\thosts pursued them with wickedness and oppression, until when\\n\\t\\t\\tdrowning, he cried out: \"I believe that there is no god but Him\\n\\t\\t\\tin Whom the Children of Israel believe and I have become one of\\n\\t\\t\\tthe Muslims.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "91",
    "Text": "In response it was said to him: \"Now you believe! But a little\\n\\t\\t\\twhile before you were disobedient and one of the mischief-makers!"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "92",
    "Text": "We shall save your body this day, so that you may become a sign\\n\\t\\t\\tfor the succeeding generations, indeed many among mankind are\\n\\t\\t\\theedless of Our signs!\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "93",
    "Text": "We settled the Children of Israel in a respectable dwelling place\\n\\t\\t\\tand provided them with the good things of life. They did not\\n\\t\\t\\tcause dissension until after knowledge had come to them. Surely\\n\\t\\t\\tyour Rabb will judge between them in those matters in which they\\n\\t\\t\\tcaused dissension on the Day of Resurrection."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "94",
    "Text": "If you are in doubt regarding what We have revealed to you, ask\\n\\t\\t\\tthose who have been reading the Book before you. In fact, the\\n\\t\\t\\ttruth has indeed come to you from your Rabb: therefore, do not be\\n\\t\\t\\tof those who doubt,"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "95",
    "Text": "and do not join those who deny the revelations of Allah;\\n\\t\\t\\totherwise you will become one of the losers."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "96",
    "Text": "In fact, those against whom the Word of your Rabb has proved true\\n\\t\\t\\twill not believe,"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "97",
    "Text": "even if every sign should come to them, until they themselves see\\n\\t\\t\\tthe painful punishment."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "98",
    "Text": "Was there any town which seeing the scourge, believed, and their\\n\\t\\t\\tbelief profited them except the people of Yunus (Jonah)? When\\n\\t\\t\\tthey believed, We removed from them the disgraceful scourge and\\n\\t\\t\\tallowed them to enjoy their worldly life for a while."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "99",
    "Text": "If it had been the will of your Rabb that all the people of the\\n\\t\\t\\tworld should be believers, all the people of the earth would have\\n\\t\\t\\tbelieved! Would you then compel mankind against their will to\\n\\t\\t\\tbelieve?"
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "100",
    "Text": "It is not possible for anyone to believe except by the permission\\n\\t\\t\\tof Allah, and He throws filth on those who do not use their\\n\\t\\t\\tcommon-sense."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "101",
    "Text": "Say: \"Look at whatever exists in the heavens and the earth.\"\\n\\t\\t\\tSigns and warnings do not benefit those people who do not\\n\\t\\t\\tbelieve."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "102",
    "Text": "Now are they waiting for evil days like the ones that befell the\\n\\t\\t\\tpeople who passed away before them? Say: \"Wait if you will; I too\\n\\t\\t\\twill wait with you.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "103",
    "Text": "When such a time comes, We rescue Our Rasools and those who\\n\\t\\t\\tbelieve - this is Our way; it is but right that We rescue the\\n\\t\\t\\tbelievers."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "104",
    "Text": "Say: \"O people! Doubt my Deen (religion) if you will, but never\\n\\t\\t\\twill I worship those that you worship besides Allah. I worship\\n\\t\\t\\tAllah, Who has the power to cause your death, and I am commanded\\n\\t\\t\\tto be one of the believers.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "105",
    "Text": "I am further commanded: \" Dedicate yourself to the Deen\\n\\t\\t\\t(religion) in all uprightness and be not of the mushrikin (who\\n\\t\\t\\tassociate other gods with Allah)."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "106",
    "Text": "You shall not pray to others than Allah who can neither benefit\\n\\t\\t\\tnor harm you, for if you do, you shall certainly become one of\\n\\t\\t\\tthe wrongdoers."
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "107",
    "Text": "If Allah afflicts you with a calamity, none can remove it but He;\\n\\t\\t\\tand if He intends to bestow a favor, none can withhold His\\n\\t\\t\\tbounty. He bestows it on whomsoever of His servants He pleases;\\n\\t\\t\\tHe is the Forgiving, the Merciful.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "108",
    "Text": "O Muhammad, declare: \"O mankind! The truth has come to you from\\n\\t\\t\\tyour Rabb! He that follows guidance (Right Way) follows it for\\n\\t\\t\\this own good, and he that goes astray does so at his own risk;\\n\\t\\t\\tfor I am not a custodian over you.\""
  },
  {
    "SurahNumber": "10",
    "AyahNumber": "109",
    "Text": "O Prophet, follow what is revealed to you and be patient till\\n\\t\\t\\tAllah passes His judgement, for He is the best of all the Judges."
  }
]
