[
  {
    "SurahNumber": "48",
    "AyahNumber": "1",
    "Text": "O Prophet, Surely We have granted you a manifest victory in the\\n\\t\\t\\tshape of a Treaty concluded at Hudeybiyah,"
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "2",
    "Text": "so that Allah may forgive your past as well as your future sins,\\n\\t\\t\\tand may perfect His blessings upon you, and keep you on the Right\\n\\t\\t\\tWay,"
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "3",
    "Text": "and that Allah may bestow on you His mighty help."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "4",
    "Text": "It was He who sent down tranquillity into the hearts of the\\n\\t\\t\\tbelievers, so that they may add more faith to their Faith. To\\n\\t\\t\\tAllah belong the forces of the heavens and the earth. Allah is\\n\\t\\t\\tAll-Knowledgeable, All-Wise."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "5",
    "Text": "He has caused you to do as you have done, so that He may admit\\n\\t\\t\\tthe believing men and believing women into the gardens beneath\\n\\t\\t\\twhich rivers flow, to live therein forever and remove their ills\\n\\t\\t\\tfrom them; and that is the highest achievement for men in the\\n\\t\\t\\tsight of Allah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "6",
    "Text": "And that He may punish the hypocritical men and the hypocritical\\n\\t\\t\\twomen and the mushrik men and the mushrik women, who entertained\\n\\t\\t\\tan evil thought about Allah. A turn of evil shall befall them,\\n\\t\\t\\tfor Allah's wrath is upon them. He has laid His curse on them and\\n\\t\\t\\tprepared for them the fire of hell, which is a very evil abode."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "7",
    "Text": "To Allah belongs the forces of the heavens and the earth; and\\n\\t\\t\\tAllah is All-Mighty, All-Wise."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "8",
    "Text": "O Prophet, We have sent you as a witness, as a bearer of good\\n\\t\\t\\tnews, and as a Warner."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "9",
    "Text": "So that you, O people, may believe in Allah and His Rasool, and\\n\\t\\t\\tthat you may help him and honor him and glorify Allah morning and\\n\\t\\t\\tevening."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "10",
    "Text": "Surely those who swore allegiance to you O Prophet, indeed swore\\n\\t\\t\\tallegiance to Allah Himself. The Hand of Allah was above their\\n\\t\\t\\thands. Now, the one who will break his pledge, will break it at\\n\\t\\t\\this own peril, and the one who will keep his pledge that he has\\n\\t\\t\\tmade with Allah, shall soon be given a great rewarded by Him."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "11",
    "Text": "The beduin Arabs who stayed behind will soon say to you: \"Our\\n\\t\\t\\tgoods and families kept us occupied, so please ask forgiveness\\n\\t\\t\\tfor us.\" They say with their tongues what is not in their hearts.\\n\\t\\t\\tTell them: \"Who can intervene on your behalf with Allah if it be\\n\\t\\t\\tHis will to do you harm or He pleases to do you good? Allah is\\n\\t\\t\\twell aware of your actions."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "12",
    "Text": "Rather you thought that the Rasool and the believers would never\\n\\t\\t\\treturn to their families; this fancy seemed pleasing to your\\n\\t\\t\\thearts. You conceived evil thoughts and thus incurred damnation.\""
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "13",
    "Text": "He who does not believe in Allah and His Rasool, We have prepared\\n\\t\\t\\ta blazing fire for such unbelievers."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "14",
    "Text": "To Allah belongs the kingdom of the heavens and the earth: He\\n\\t\\t\\tforgives whom He pleases and He punishes whom He wills. Allah is\\n\\t\\t\\tAll-Forgiving, Most Merciful."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "15",
    "Text": "When you set forth to take the spoils of war, those who stayed\\n\\t\\t\\tbehind will say: \"Let us come with you.\" They wish to change\\n\\t\\t\\tAllah's decree. Tell them plainly: \"You shall not come with us.\\n\\t\\t\\tAllah has already said this before.\" Then they will say: \"Nay!\\n\\t\\t\\tBut you are jealous of us.\" Whereas there is no question of\\n\\t\\t\\tjealousy, but little do they understand such things."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "16",
    "Text": "Tell the beduin Arabs who stayed behind: \"You shall soon be\\n\\t\\t\\tcalled upon to fight against a mighty people then either you will\\n\\t\\t\\tfight or they will embrace Islam. Then if you obey, Allah will\\n\\t\\t\\tgrant you a good reward, but if you turn away as you have done\\n\\t\\t\\tbefore, He will inflict on you a painful penalty.\""
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "17",
    "Text": "There is no blame on the blind, the lame, and the sick if they\\n\\t\\t\\tstay behind. He that obeys Allah and His Rasool shall be admitted\\n\\t\\t\\tto gardens beneath which the rivers flow, and he that turns away\\n\\t\\t\\tshall be punished with a painful punishment."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "18",
    "Text": "Allah was well pleased with the believers when they swore\\n\\t\\t\\tallegiance to you under the tree. He knew what was in their\\n\\t\\t\\thearts, so He sent down tranquillity upon them and He rewarded\\n\\t\\t\\tthem with a speedy victory,"
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "19",
    "Text": "and many spoils which they will soon acquire. Allah is\\n\\t\\t\\tAll-Mighty, All-Wise."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "20",
    "Text": "Allah has promised you many spoils which you shall acquire, and\\n\\t\\t\\thas given you these spoils of Khayber with all promptness. He has\\n\\t\\t\\trestrained the hands of enemies from you, so that it may serve as\\n\\t\\t\\ta sign to the believers and that He may guide you to the Right\\n\\t\\t\\tWay."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "21",
    "Text": "Besides, He promises you other spoils as well, which are not yet\\n\\t\\t\\twithin your reach but Allah has surely encompassed them. Allah\\n\\t\\t\\thas power over everything."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "22",
    "Text": "Even if the unbelievers had fought with you, they would have been\\n\\t\\t\\tput to flight, and would have not found any protector or helper."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "23",
    "Text": "Such has been the practice of Allah in the past; and you shall\\n\\t\\t\\tfind no change in the practice of Allah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "24",
    "Text": "It is He Who has restrained their hands from you and your hands\\n\\t\\t\\tfrom them in the valley of Makkah, through the Peace Treaty of\\n\\t\\t\\tHudeybiyah, after that He had given you victory over them, and\\n\\t\\t\\tAllah was watching all your actions."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "Text": "They are the ones who disbelieved and obstructed you from the\\n\\t\\t\\tMasjid-al-Haram (Sacred Mosque - Ka'bah) and prevented your\\n\\t\\t\\tofferings from reaching their destination. Had there not been\\n\\t\\t\\tbelieving men and believing women in the city of Makkah, whom you\\n\\t\\t\\tdid not know, and their possibility of being trampled under your\\n\\t\\t\\tfeet and thus incurred unwitting guilt on their account. Allah\\n\\t\\t\\twould have allowed you to fight, but He held back your hands, so\\n\\t\\t\\tthat He may admit to His mercy whom He will. Had the believers\\n\\t\\t\\tstood apart from them, We would certainly have punished the\\n\\t\\t\\tdisbelievers among them with painful punishment."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "26",
    "Text": "While the unbelievers set up in their hearts the arrogance, the\\n\\t\\t\\tarrogance of ignorance, Allah sent down His tranquillity upon His\\n\\t\\t\\tRasool and the believers and made the believers to adhere to the\\n\\t\\t\\tword of piety; for they were most worthy and deserving of it.\\n\\t\\t\\tAllah has full knowledge of everything."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "27",
    "Text": "Indeed Allah has in all truth shown the vision to His Rasool,\\n\\t\\t\\tthat, Allah willing, you shall enter the Masjid-al-Haram (Ka'bah)\\n\\t\\t\\tfearless and secure to perform Umrah or Hajj and some having\\n\\t\\t\\ttheir heads shaved and others having their hair cut, for He knows\\n\\t\\t\\twhat you do not know. So, He granted you a near victory before\\n\\t\\t\\tthe fulfillment of that vision."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "28",
    "Text": "It is He who has sent His Rasool with Guidance and the religion\\n\\t\\t\\tof truth, so that He may exalt this religion over all other\\n\\t\\t\\treligions: and sufficient is Allah as a witness."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "Text": "Muhammad, the Rasool of Allah, and those with him are strong\\n\\t\\t\\tagainst the unbelievers and compassionate to each other among\\n\\t\\t\\tthemselves. When you see them, you will find them making Rakuh\\n\\t\\t\\t(bowing down) and Sajud (prostrate in prayers), and craving for\\n\\t\\t\\tthe blessings from Allah and His good pleasure. They have mark of\\n\\t\\t\\tSajud (prostration) on their foreheads, the traces of their\\n\\t\\t\\tprostration. This is their similitude in the Taurat (Torah); and\\n\\t\\t\\ttheir similitude in the Injeel (Gospel): they are like the seed\\n\\t\\t\\twhich puts forth its sprout, then strengthens it, then becomes\\n\\t\\t\\tthick and stands firmly on its stem, delighting the sowers of the\\n\\t\\t\\tseed, so that through them He may enrage the unbelievers. Yet to\\n\\t\\t\\tthose of them who will believe and do good deeds, Allah has\\n\\t\\t\\tpromised forgiveness and a great reward."
  }
]
