[
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "1",
    "sectionHeading": "The 'Irrevocable' Divorce.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that a\\n\\t\\t\\t\\tman said to Abdullah ibn Abbas, \"I have divorced my wife\\n\\t\\t\\t\\tby saying I divorce you a hundred times. What do you\\n\\t\\t\\t\\tthink my situation is?\" Ibn Abbas said to him, \"She was\\n\\t\\t\\t\\tdivorced from you by three pronouncements, and by the\\n\\t\\t\\t\\tninety-seven, you have mocked the ayat of Allah.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "2",
    "sectionHeading": "The 'Irrevocable' Divorce.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that a\\n\\t\\t\\t\\tman came to Abdullah ibn Masud and said, \"I have divorced\\n\\t\\t\\t\\tmy wife by saying I divorce you eight times.\" Ibn Masud\\n\\t\\t\\t\\tsaid to him, \"What have people told you?\" He replied, \"I\\n\\t\\t\\t\\thave been told that I have to part absolutely from her.\"\\n\\t\\t\\t\\tIbn Masud said, \"They have spoken the truth. A person who\\n\\t\\t\\t\\tdivorces as Allah has commanded, Allah makes it clear for\\n\\t\\t\\t\\thim, and a person who obscures himself in error, we make\\n\\t\\t\\t\\tstay by his error. So do not confuse yourselves and pull\\n\\t\\t\\t\\tus into your confusion. It is as they have said.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "3",
    "sectionHeading": "The 'Irrevocable' Divorce.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAbu Bakr ibn Hazm thatUmar ibn Abd al-Aziz had asked him\\n\\t\\t\\t\\twhat people said about the 'irrevocable' divorce, and Abu\\n\\t\\t\\t\\tBakr had replied that Aban ibn Uthman had clarified that\\n\\t\\t\\t\\tit was declared only once. Umar ibn Abd al-Aziz said,\\n\\t\\t\\t\\t\"Even if divorce had to be declared a thousand times,\\n\\t\\t\\t\\tthe'irrevocable' would use them all up. A person who\\n\\t\\t\\t\\tsays, 'irrevocably' has cast the furthest limit.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "4",
    "sectionHeading": "The 'Irrevocable' Divorce.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tMarwan ibn al-Hakam decided that if someone made three\\n\\t\\t\\t\\tpronouncements of divorce, he had divorced his wife\\n\\t\\t\\t\\tirrevocably.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what I like best of what I have\\n\\t\\t\\t\\theard on the subject.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t29.2 Divorce by Euphemistic Statements\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "5",
    "sectionHeading": "The 'Irrevocable' Divorce.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab had heard in a letter from Iraq that\\n\\t\\t\\t\\ta man said to his wife, \"Your rein is on your withers\\n\\t\\t\\t\\t(i.e. you have free rein).\" Umar ibn al-Khattab wrote to\\n\\t\\t\\t\\this governor to order the man to come to him at Makka at\\n\\t\\t\\t\\tthe time of hajj. While Umar was doing tawaf around the\\n\\t\\t\\t\\tHouse, a man met him and greeted him. Umar asked him who\\n\\t\\t\\t\\the was, and he replied that he was the man that he had\\n\\t\\t\\t\\tordered to be brought to him. Umar said to him, \"I ask\\n\\t\\t\\t\\tyou by the Lord of this building, what did you mean by\\n\\t\\t\\t\\tyour statement, 'Your rein is on your withers.'?\" The man\\n\\t\\t\\t\\treplied, \"Had you made me swear by other than this place,\\n\\t\\t\\t\\tI would not have told you the truth. I intended\\n\\t\\t\\t\\tseparation by that.\" Umar ibn al- Khattab said, \"It is\\n\\t\\t\\t\\twhat you intended.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "6",
    "sectionHeading": "The 'Irrevocable' Divorce.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Ali\\n\\t\\t\\t\\tibn Abi Talib used to say that if a man said to his wife,\\n\\t\\t\\t\\t\"You are haram for me,\" it counted as three\\n\\t\\t\\t\\tpronouncements of divorce.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the best of what I have heard on the\\n\\t\\t\\t\\tsubject.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "7",
    "sectionHeading": "The 'Irrevocable' Divorce.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said that statements like \"I cut myself off from\\n\\t\\t\\t\\tyou\",or\"You are abandoned\", were considered as three\\n\\t\\t\\t\\tpronouncements of divorce.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that any strong statements such as these or\\n\\t\\t\\t\\tothers were considered as three pronouncements of divorce\\n\\t\\t\\t\\tfor a woman whose marriage had been consummated. In the\\n\\t\\t\\t\\tcase of a woman whose marriage had not been consummated,\\n\\t\\t\\t\\tthe man was asked to make an oath on his deen, as to\\n\\t\\t\\t\\twhether he had intended one or three pronouncements of\\n\\t\\t\\t\\tdivorce. If he had intended one pronouncement, he was\\n\\t\\t\\t\\tasked to make an oath by Allah to confirm it, and he\\n\\t\\t\\t\\tbecame a suitor among other suitors, because a woman\\n\\t\\t\\t\\twhose marriage had been consummated, required three\\n\\t\\t\\t\\tpronouncements of divorce to make her inaccessible for\\n\\t\\t\\t\\tthe husband, whilst only one pronouncement was needed to\\n\\t\\t\\t\\tmake a woman whose marriage had not been consummated\\n\\t\\t\\t\\tinaccessible.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"That is the best of what I have heard about\\n\\t\\t\\t\\tthe matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "8",
    "sectionHeading": "The 'Irrevocable' Divorce.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tal-Qasim ibn Muhammad that a certain man had taken a\\n\\t\\t\\t\\tslave-girl belonging to somebody else as a wife. He said\\n\\t\\t\\t\\tto her people, \"She is your concern,\" and people\\n\\t\\t\\t\\tconsidered that to be one pronouncement of divorce.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "9",
    "sectionHeading": "The 'Irrevocable' Divorce.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard Ibn Shihab\\n\\t\\t\\t\\tsay that if a man said to his wife, \"You are free of me,\\n\\t\\t\\t\\tand I am free of you, \" it counted as three\\n\\t\\t\\t\\tpronouncements of divorce as if it were an 'irrevocable'\\n\\t\\t\\t\\tdivorce.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man made any strong statement such\\n\\t\\t\\t\\tas these to his wife, it counted as three pronouncements\\n\\t\\t\\t\\tof divorce for a woman whose marriage had been\\n\\t\\t\\t\\tconsummated, or it was written as one of three for a\\n\\t\\t\\t\\twoman whose marriage had not been consummated, whichever\\n\\t\\t\\t\\tthe man wished. If he said he intended only one divorce\\n\\t\\t\\t\\the swore to it and he became one of the suitors because,\\n\\t\\t\\t\\twhereas a woman whose marriage had been consummated was\\n\\t\\t\\t\\tmade inaccessible by three pronouncements of divorce, the\\n\\t\\t\\t\\twoman whose marriage had not been consummated was made\\n\\t\\t\\t\\tinaccessible by only one pronouncement.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the best of what I have heard.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "10",
    "sectionHeading": "What is Clear about Giving Wives Right of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that a\\n\\t\\t\\t\\tman came to Abdullah ibn Umar, and said, \"Abu Abd\\n\\t\\t\\t\\tar-Rahman! I placed the command of my wife in her hand,\\n\\t\\t\\t\\tand she divorced herself, what do you think?\" Abdullah\\n\\t\\t\\t\\tibn Umar said, \"I think that it is as she said.\" The man\\n\\t\\t\\t\\tsaid, \"Don't do it, Abu Abd ar-Rahman!\" Ibn Umar said,\\n\\t\\t\\t\\t\"You did it, it has nothing to do with me.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "11",
    "sectionHeading": "What is Clear about Giving Wives Right of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"When a man gives a woman command over\\n\\t\\t\\t\\therself, then the result is as she decides unless he\\n\\t\\t\\t\\tdenies it and says that he only meant to give her one\\n\\t\\t\\t\\tdivorce and he swears to it - then he has access to her\\n\\t\\t\\t\\twhile she is in her idda.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "12",
    "sectionHeading": "Circumstances in Which only One Pronouncement of Divorce Permitted in Giving Wives Right of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Sulayman ibn\\n\\t\\t\\t\\tZayd ibn Thabit that Kharija ibn Zayd ibn Thabit told him\\n\\t\\t\\t\\tthat he was sitting with Zayd ibn Thabit when Muhammad\\n\\t\\t\\t\\tibn Abi Atiq came to him with his eyes brimming with\\n\\t\\t\\t\\ttears. Zayd asked him what the matter was. He said, \"I\\n\\t\\t\\t\\tgave my wife command of herself, and she separated from\\n\\t\\t\\t\\tme.\" Zayd said to him, \"What made you do that?\" He said,\\n\\t\\t\\t\\t\"The Decree.\" Zayd said, \"Return to her if you wish for\\n\\t\\t\\t\\tit is only one pronouncement, and you have access to\\n\\t\\t\\t\\ther.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "13",
    "sectionHeading": "Circumstances in Which only One Pronouncement of Divorce Permitted in Giving Wives Right of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father that a man of Thaqif gave his\\n\\t\\t\\t\\twife command over herself, and she said, \"You are\\n\\t\\t\\t\\tdivorced.\" He was silent. She said, \"You are divorced.\"\\n\\t\\t\\t\\tHe said, \"May a stone be in your mouth.\" She said, \"You\\n\\t\\t\\t\\tare divorced.\" He said, \"May a stone be in your mouth.\"\\n\\t\\t\\t\\tThey argued and went to Marwan ibn al-Hakam. He took an\\n\\t\\t\\t\\toath that he had only given her control over one\\n\\t\\t\\t\\tpronouncement, and then she returned to him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that Abd ar-Rahman declared that this decision\\n\\t\\t\\t\\thad amazed al-Qasim, who thought it the best that he had\\n\\t\\t\\t\\theard on the subject.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"That is also the best of what I have heard\\n\\t\\t\\t\\ton the subject.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "14",
    "sectionHeading": "What is Not Clear in Giving Wives Right of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father that A'isha, umm al-muminin,\\n\\t\\t\\t\\tproposed to Qurayba bint Abi Umayya on behalf of Abd\\n\\t\\t\\t\\tar-Rahman ibn Abi Bakr. They married her to him and her\\n\\t\\t\\t\\tpeople found fault with Abd ar-Rahman and said, \"We only\\n\\t\\t\\t\\tgave in marriage because of A'isha.\" A'isha therefore\\n\\t\\t\\t\\tsent for Abd ar-Rahman and told him about it. He gave\\n\\t\\t\\t\\tQurayba authority over herself and she chose her husband\\n\\t\\t\\t\\tand so there was no divorce.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "15",
    "sectionHeading": "What is Not Clear in Giving Wives Right of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, gave\\n\\t\\t\\t\\tHafsa bint Abd arRahman in marriage to al-Mundhir ibn\\n\\t\\t\\t\\taz-Zubayr while Abd ar-Rahman was away in Syria. When Abd\\n\\t\\t\\t\\tar-Rahman arrived, he said, \"Shall someone like me have\\n\\t\\t\\t\\tthis done to him? Am I the kind of man to have something\\n\\t\\t\\t\\tdone to him without his consent?\" A'isha spoke to\\n\\t\\t\\t\\tal-Mundhir ibn az-Zubayr, and al-Mundhir said, \"It is in\\n\\t\\t\\t\\tthe hands of Abd ar-Rahman.\" Abd ar-Rahman said, \"I won't\\n\\t\\t\\t\\toppose something that you have already completed.\" Hafsa\\n\\t\\t\\t\\twas confirmed with al-Mundhir, and there was no divorce.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "16",
    "sectionHeading": "What is Not Clear in Giving Wives Right of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar and Abu Hurayra were asked about a man\\n\\t\\t\\t\\twho gave his wife power over herself, and she returned it\\n\\t\\t\\t\\tto him without doing anything with it. They said that\\n\\t\\t\\t\\tthere was no divorce. (i.e. The man's giving his wife\\n\\t\\t\\t\\tpower over herself was not interpreted as a desire for\\n\\t\\t\\t\\tdivorce on his part.)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"If a man gives his wife\\n\\t\\t\\t\\tauthority over herself, and she does not separate from\\n\\t\\t\\t\\thim and remains with him, there is no divorce.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a woman whose husband gave her power over\\n\\t\\t\\t\\therself and they separated while she was unwilling, had\\n\\t\\t\\t\\tno power to revoke the divorce. She only had power over\\n\\t\\t\\t\\therself as long as they remained together.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "17",
    "sectionHeading": "Annulment of Marriage by Husband's Vow to Refrain from Intercourse (Ila)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Jafar ibn Muhammad\\n\\t\\t\\t\\tfrom his father that Ali ibn Abi Talib said, \"When a man\\n\\t\\t\\t\\ttakes a vow to abstain from intercourse, divorce does not\\n\\t\\t\\t\\toccur immediately. If four months pass, he must declare\\n\\t\\t\\t\\this intent and either he is divorced or he revokes his\\n\\t\\t\\t\\tvow . \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what is done among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "18",
    "sectionHeading": "Annulment of Marriage by Husband's Vow to Refrain from Intercourse (Ila)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"When a man makes a vow to abstain from\\n\\t\\t\\t\\tintercourse with his wife and four months have passed he\\n\\t\\t\\t\\tmust declare his intent and either he is divorced or he\\n\\t\\t\\t\\trevokes his vow. Divorce does not occur until four months\\n\\t\\t\\t\\thave passed and he continues to abstain.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tal-Musayyab and Abu Bakr ibn Abd ar-Rahman said about a\\n\\t\\t\\t\\tman who made a vow to abstain from intercourse with his\\n\\t\\t\\t\\twife, \"If four months pass it is a divorce. The husband\\n\\t\\t\\t\\tcan go back to his wife as long as she is in her idda.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "19",
    "sectionHeading": "Annulment of Marriage by Husband's Vow to Refrain from Intercourse (Ila)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tMarwan ibn al-Hakam decided about a man who had made a\\n\\t\\t\\t\\tvow to abstain from intercourse with his wife, that when\\n\\t\\t\\t\\tfour months had passed, it was a divorce and he could\\n\\t\\t\\t\\treturn to her as long as she was in her idda.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"That was also the opinion of Ibn Shihab.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man made a vow to abstain from\\n\\t\\t\\t\\tintercourse with his wife and at the end of four months\\n\\t\\t\\t\\the declared his intent to continue to abstain, he was\\n\\t\\t\\t\\tdivorced. He could go back to his wife, but if he did not\\n\\t\\t\\t\\thave intercourse with her before the end of her idda, he\\n\\t\\t\\t\\thad no access to her and he could not go back to her\\n\\t\\t\\t\\tunless he had an excuse - illness, imprisonment, or a\\n\\t\\t\\t\\tsimilar excuse. His return to her maintained her as his\\n\\t\\t\\t\\twife. If her idda passed and then he married her after\\n\\t\\t\\t\\tthat and did not have intercourse with her until four\\n\\t\\t\\t\\tmonths had passed and he declared his intent to continue\\n\\t\\t\\t\\tto abstain, divorce was applied to him by the first vow.\\n\\t\\t\\t\\tIf four months passed, and he had not returned to her, he\\n\\t\\t\\t\\thad no idda against her nor access because he had married\\n\\t\\t\\t\\ther and then divorced her before touching her.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a man who made a vow to abstain from\\n\\t\\t\\t\\tintercourse with his wife and continued to abstain after\\n\\t\\t\\t\\tfour months and so divorced her, but then returned and\\n\\t\\t\\t\\tdid not touch her and four months were completed before\\n\\t\\t\\t\\ther idda was completed, did not have to declare his\\n\\t\\t\\t\\tintent and divorce did not befall him. If he had\\n\\t\\t\\t\\tintercourse with her before the end of her idda, he was\\n\\t\\t\\t\\tentitled to her. If her idda passed before he had\\n\\t\\t\\t\\tintercourse with her, he had no access to her. This is\\n\\t\\t\\t\\twhat Malik preferred of what he had heard on the subject.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man made a vow to abstain from\\n\\t\\t\\t\\tintercourse with his wife and then divorced her, and the\\n\\t\\t\\t\\tfour months of the vow were completed before completion\\n\\t\\t\\t\\tof the idda of the divorce, it counted as two\\n\\t\\t\\t\\tpronouncements of divorce. If he declared his intention\\n\\t\\t\\t\\tto continue to abstain and the idda of the divorce\\n\\t\\t\\t\\tfinished before the four months the vow of abstention was\\n\\t\\t\\t\\tnot a divorce. That was because the four months had\\n\\t\\t\\t\\tpassed and she was not his on that day.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone makes a vow not to have\\n\\t\\t\\t\\tintercourse with his wife for a day or a month and then\\n\\t\\t\\t\\twaits until more than four months have passed, it is not\\n\\t\\t\\t\\tila. Ila only applies to someone who vows more than four\\n\\t\\t\\t\\tmonths. As for the one who vows not to have intercourse\\n\\t\\t\\t\\twith his wife for four months or less than that, I do not\\n\\t\\t\\t\\tthink that it is ila because when the term enters into it\\n\\t\\t\\t\\tat which it stops, he comes out of his oath and he does\\n\\t\\t\\t\\tnot have to declare his intention.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone vows to his wife not to have\\n\\t\\t\\t\\tintercourse with her until her child has been weaned,\\n\\t\\t\\t\\tthat is not ila. I have heard that Ali ibn Abi Talib was\\n\\t\\t\\t\\tasked about that and he did not think that it was ila.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "19",
    "sectionHeading": "The Ila (Vow of Abstention) of Slaves",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had asked Ibn\\n\\t\\t\\t\\tShihab about the ila of the slave. He said that it was\\n\\t\\t\\t\\tlike the ila of the free man, and it put an obligation on\\n\\t\\t\\t\\thim. The ila of the slave was two months.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "20",
    "sectionHeading": "Dhihar of Free Men",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Amr ibn\\n\\t\\t\\t\\tSulaym az-Zuraqi that he asked al-Qasim ibn Muhammad\\n\\t\\t\\t\\tabout a man who made divorce conditional on his marrying\\n\\t\\t\\t\\ta woman i.e. if he married her he would automatically\\n\\t\\t\\t\\tdivorce her. Al-Qasim ibn Muhammad said, \"If a man\\n\\t\\t\\t\\tmarries a woman whom he has made as his mother's back,\\n\\t\\t\\t\\ti.e. has made haram for him, Umar ibn al-Khattab ordered\\n\\t\\t\\t\\thim not to go near her if he married her until he had\\n\\t\\t\\t\\tdone the kaffara for pronouncing dhihar.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "21",
    "sectionHeading": "Dhihar of Free Men",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that a\\n\\t\\t\\t\\tman asked al-Qasim ibn Muhammad and Sulayman ibn Yasar\\n\\t\\t\\t\\tabout a man who pronounced dhihar from his wife before he\\n\\t\\t\\t\\thad married her. They said, \"If he marries her, he must\\n\\t\\t\\t\\tnot touch her until he has done the kaffara for\\n\\t\\t\\t\\tpronouncing dhihar.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "22",
    "sectionHeading": "Dhihar of Free Men",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said that a man who pronounced a dhihar from\\n\\t\\t\\t\\this four wives in one statement, had only to do one\\n\\t\\t\\t\\tkaffara. Yahya related the same as that to me from Malik\\n\\t\\t\\t\\tfrom Rabia ibn Abi Abd ar-Rahman.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what is done among us. Allah, the\\n\\t\\t\\t\\tExalted said about the kaffara for pronouncing dhihar,\\n\\t\\t\\t\\t'It is to free a slave before they touch one another. If\\n\\t\\t\\t\\the does not find the means to do that, then fasting for\\n\\t\\t\\t\\ttwo consecutive months before they touch one another. If\\n\\t\\t\\t\\the cannot do that, it is to feed sixty poor people. ' \"\\n\\t\\t\\t\\t(Sura 58 ayats 4,5).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a man who pronounced dhihar from his wife\\n\\t\\t\\t\\ton various occasions had only to do one kaffara. If he\\n\\t\\t\\t\\tpronounced dhihar, and then did kaffara, and then\\n\\t\\t\\t\\tpronounced dhihar after he had done the kaffara, he had\\n\\t\\t\\t\\tto do kaffara again.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Some one who pronounces dhihar from his wife\\n\\t\\t\\t\\tand then has intercourse with her before he has done\\n\\t\\t\\t\\tkaffara, only has to do one kaffara. He must abstain from\\n\\t\\t\\t\\ther until he does kaffara and ask forgiveness of Allah.\\n\\t\\t\\t\\tThat is the best of what I have heard. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is the same with dhihar using any\\n\\t\\t\\t\\tprohibited relations of fosterage and ancestry.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Women have no dhihar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that he had heard that the commentary on the\\n\\t\\t\\t\\tword of Allah, the Blessed, the Exalted, \"Those of you\\n\\t\\t\\t\\twho pronounce the dhihar about their wives, and then\\n\\t\\t\\t\\tretract what they have said,\" (Sura 56 ayat 3), was that\\n\\t\\t\\t\\ta man pronounced dhihar on his wife and then decided to\\n\\t\\t\\t\\tkeep her and have intercourse with her. If he decided on\\n\\t\\t\\t\\tthat, he must do kaffara. If he divorced her and did not\\n\\t\\t\\t\\tdecide to retract his dhihar of her and to keep her and\\n\\t\\t\\t\\thave intercourse with her, there would be no kaffara\\n\\t\\t\\t\\tincumbent on him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMaliksaid, \"If he marries her after that, he does not\\n\\t\\t\\t\\ttouch her until he has completed the kaffara of\\n\\t\\t\\t\\tpronouncing dhihar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man who pronounced dhihar from his\\n\\t\\t\\t\\tslave-girl wanted to have intercourse with her, he had to\\n\\t\\t\\t\\tdo the kaffara of the dhihar before he could sleep with\\n\\t\\t\\t\\ther.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no ila in a man's dhihar unless it\\n\\t\\t\\t\\tis evident that he does not intend to retract his\\n\\t\\t\\t\\tdhihar.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "23",
    "sectionHeading": "Dhihar of Free Men",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\the heard a man ask Urwa ibn az-Zubayr about a man who\\n\\t\\t\\t\\tsaid to his wife, \"Any woman I marry along with you as\\n\\t\\t\\t\\tlong as you live will be like my mother's back to me.\"\\n\\t\\t\\t\\tUrwa ibn az-Zubayr said, \"The freeing of slaves is enough\\n\\t\\t\\t\\tto release him from that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "24",
    "sectionHeading": "Dhihar of Slaves",
    "text": "<p>\\n\\t\\t\\t\\tahya related to me from Malik that he asked Ibn Shihab\\n\\t\\t\\t\\tabout the dhihar of a slave.  He said, \"It is like the\\n\\t\\t\\t\\tdhihar of a free man.\" \\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"He meant that the same conditions were\\n\\t\\t\\t\\tapplied in both cases.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The dhihar of the slave is incumbent on him,\\n\\t\\t\\t\\tand the fasting of the slave in the dhihar is two months.\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that there was no ila for a slave who\\n\\t\\t\\t\\tpronounced a dhihar from his wife. That was because if he\\n\\t\\t\\t\\twere to fast the kaffara for pronouncing a dhihar, the\\n\\t\\t\\t\\tdivorce of the ila would come to him before he had\\n\\t\\t\\t\\tfinished the fast.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "25",
    "sectionHeading": "The Option (of Slave-Girls Married to Slaves when Freed)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman from al-Qasim ibn Muhammad that A'isha umm\\n\\t\\t\\t\\tal-muminin, said, \"There were three sunnas established in\\n\\t\\t\\t\\tconnection with Barira: firstly was that when she was set\\n\\t\\t\\t\\tfree she was given her choice about her husband,\\n\\t\\t\\t\\tsecondly, the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said about her, 'The right of\\n\\t\\t\\t\\tinheritance belongs to the person who has set a person\\n\\t\\t\\t\\tfree,' thirdly, the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, came in and there was a pot with\\n\\t\\t\\t\\tmeat on the boil. Bread and condiments were brought to\\n\\t\\t\\t\\thim from the stock of the house. The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, 'Didn't I\\n\\t\\t\\t\\tsee a pot with meat in it?' They said, 'Yes, Messenger of\\n\\t\\t\\t\\tAllah. That is meat which was given as sadaqa for Barira,\\n\\t\\t\\t\\tand you do not eat sadaqa.' The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, 'It is sadaqa\\n\\t\\t\\t\\tfor her, and it is a gift for us.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "26",
    "sectionHeading": "The Option (of Slave-Girls Married to Slaves when Freed)",
    "text": "<p>\\n\\t\\t\\t\\tahya related to me from Malik from Nafi that Abdullah ibn\\n\\t\\t\\t\\tUmar said that a female slave who was the wife of a slave\\n\\t\\t\\t\\tand then was set free, had the right of choice as long as\\n\\t\\t\\t\\the did not have intercourse with her.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If her husband has intercourse with her and\\n\\t\\t\\t\\tshe claims that she did not know, she still has the right\\n\\t\\t\\t\\tof choice. If she is suspect and one does not believe her\\n\\t\\t\\t\\tclaim of ignorance, then she has no choice after he has\\n\\t\\t\\t\\thad intercourse with her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "27",
    "sectionHeading": "The Option (of Slave-Girls Married to Slaves when Freed)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr that a mawla of the tribe of Banu Adi\\n\\t\\t\\t\\tcalled Zabra told him that she had been the wife of a\\n\\t\\t\\t\\tslave when she was a slave-girl. Then she was set free\\n\\t\\t\\t\\tand she sent a message to Hafsa, the wife of the Prophet,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace. Hafsa called her\\n\\t\\t\\t\\tand said, \"I will tell you something., but I would prefer\\n\\t\\t\\t\\tthat you did not act upon it. You have authority over\\n\\t\\t\\t\\tyourself as long as your husband does not have\\n\\t\\t\\t\\tintercourse with you. If he has intercourse with you, you\\n\\t\\t\\t\\thave no authority at all.\" Therefore she pronounced her\\n\\t\\t\\t\\tdivorce from him three times.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "28",
    "sectionHeading": "The Option (of Slave-Girls Married to Slaves when Freed)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said that if a man married a woman,\\n\\t\\t\\t\\tand he was insane or had a physical defect, she had the\\n\\t\\t\\t\\tright of choice. If she wished she could stay, and if she\\n\\t\\t\\t\\twished she could separate from him.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "29",
    "sectionHeading": "The Option (of Slave-Girls Married to Slaves when Freed)",
    "text": "<p>\\n\\t\\t\\t\\tMalik said that if a slave-girl, who was the wife of a\\n\\t\\t\\t\\tslave, was set free before he had consummated the\\n\\t\\t\\t\\tmarriage, and she chose herself, then she had no\\n\\t\\t\\t\\tbride-price and it was a pronouncement of divorce. That\\n\\t\\t\\t\\twas what was done among them.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "30",
    "sectionHeading": "The Option (of Slave-Girls Married to Slaves when Freed)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik heard Ibn Shihab say,\\n\\t\\t\\t\\t\"When a man gives his wife the right of choice, and she\\n\\t\\t\\t\\tchooses him, that is not divorce.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"That is the best of what I have heard.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a woman who had been given the right\\n\\t\\t\\t\\tof choice by her husband chose herself, she was divorced\\n\\t\\t\\t\\ttrebly. If her husband said, \"But I only gave her the\\n\\t\\t\\t\\tright of choice in one,\" he had none of that. That was\\n\\t\\t\\t\\tthe best of what he had heard.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the man gives his wife the right of\\n\\t\\t\\t\\tchoice and she says, 'I accept one', and he says, 'I did\\n\\t\\t\\t\\tnot mean that, I have given the right of choice in all\\n\\t\\t\\t\\tthree together,' then if she only accepts one, she\\n\\t\\t\\t\\tremains with him in her marriage, and that is not\\n\\t\\t\\t\\tseparation if Allah, the Exalted wills.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "31",
    "sectionHeading": "Separating from Wives for Compensation",
    "text": "<p>\\n\\t\\t\\t\\tYahya related. to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAmra bint Abd ar-Rahman told him from Habiba bint Sahl\\n\\t\\t\\t\\tal-Ansari that she had been the wife of Thabit ibn Qays\\n\\t\\t\\t\\tibn Shammas. The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, went out for the dawn prayer, and\\n\\t\\t\\t\\tfound Habiba bint Sahl at his door in the darkness. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said to her, \"Who is this?\" She said, \"I am Habiba\\n\\t\\t\\t\\tbint Sahl, Messenger of Allah.\" He said, \"What do you\\n\\t\\t\\t\\twant?\" She said, \"That Thabit ibn Qays and I separate.\"\\n\\t\\t\\t\\tWhen her husband, Thabit ibn Qays came, the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\thim, \"This is Habiba bint Sahl. She mentioned what Allah\\n\\t\\t\\t\\twilled that she mention.\" Habiba said, \"Messenger of\\n\\t\\t\\t\\tAllah, all that he has given me is with me!\" The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said to Thabit ibn Qays, \"Take it from her,\" and\\n\\t\\t\\t\\the took it from her, and she stayed in the house of her\\n\\t\\t\\t\\tfamily.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "32",
    "sectionHeading": "Separating from Wives for Compensation",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from a mawla of\\n\\t\\t\\t\\tSafiyya bint Abi Ubayd that she gave all that she\\n\\t\\t\\t\\tpossessed to her husband as compensation for her divorce\\n\\t\\t\\t\\tfrom him, and Abdullah ibn Umar did not disapprove of\\n\\t\\t\\t\\tthat.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that divorce was ratified for a woman who\\n\\t\\t\\t\\transomed herself from her husband, when it was known that\\n\\t\\t\\t\\ther husband was detrimental to her and was oppressive for\\n\\t\\t\\t\\ther, and it was known that he wronged her, and he had to\\n\\t\\t\\t\\treturn her property to her. Malik added, \"This is what I\\n\\t\\t\\t\\thave heard, and it is what is done among us.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm if a woman ransoms herself\\n\\t\\t\\t\\tfrom her husband for more than he gave her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "33",
    "sectionHeading": "Divorce of Men who Divorce for Compensation",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Rubayyi\\n\\t\\t\\t\\tbint Muawwidh ibn Afra came with her paternal uncle to\\n\\t\\t\\t\\tAbdullah ibn Umar and told him that she had divorced her\\n\\t\\t\\t\\thusband for a compensation in the time of Uthman ibn\\n\\t\\t\\t\\tAffan, and he heard about it and did not disapprove.\\n\\t\\t\\t\\tAbdullah ibn Umar said, \"Her idda is the idda of a\\n\\t\\t\\t\\tdivorced woman.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab and Sulayman ibn Yasar and Ibn\\n\\t\\t\\t\\tShihab all said that a woman who divorced for a\\n\\t\\t\\t\\tcompensation had the same idda as a divorced woman -\\n\\t\\t\\t\\tthree periods.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a woman who ransomed herself could not\\n\\t\\t\\t\\treturn to her husband except by a new marriage. If\\n\\t\\t\\t\\tsomeone married her and then separated from her before he\\n\\t\\t\\t\\thad intercourse with her, there was no idda against her\\n\\t\\t\\t\\tfrom the recent marriage, and she rested on her first\\n\\t\\t\\t\\tidda.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the best that I have heard on the\\n\\t\\t\\t\\tmatter.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If, when a woman offers to compensate her\\n\\t\\t\\t\\thusband, he divorces her straightaway, then that\\n\\t\\t\\t\\tcompensation is confirmed for him. If he makes no\\n\\t\\t\\t\\tresponse, and then at a later date, does divorce her, he\\n\\t\\t\\t\\tis not entitled to that compensation.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "34",
    "sectionHeading": "Lian (Invoking Mutual Curses)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Sahl\\n\\t\\t\\t\\tibn Sad as-Saidi told him that Uwaymir al-Ajlani came to\\n\\t\\t\\t\\tAsim ibn Adi al-Ansari and said to him, \"Asim! What do\\n\\t\\t\\t\\tyou think a man who finds another man with his wife\\n\\t\\t\\t\\tshould do? Should he kill him and then be killed himself,\\n\\t\\t\\t\\tor what should .he do? Asim! ask the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, about that for\\n\\t\\t\\t\\tme.\" Asim asked the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, about it. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\trevolted by the questions and reproved them until what he\\n\\t\\t\\t\\theard from the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace. was intolerable for Asim. When Asim\\n\\t\\t\\t\\treturned to his people, Uwaymir came to him and said, \"\\n\\t\\t\\t\\tAsim! what did the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, say to you?\" Asim said to\\n\\t\\t\\t\\tUwaymir, \"You didn't bring me any good. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\trevolted by the question which I asked him.\" Uwaymir\\n\\t\\t\\t\\tsaid, \"By Allah! I will not stop until I ask him about\\n\\t\\t\\t\\tit!\" Uwaymir stood up and went to the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, in the middle of\\n\\t\\t\\t\\tthe people and said, \"Messenger of Allah! What do you\\n\\t\\t\\t\\tthink a man who finds another man with his wife should\\n\\t\\t\\t\\tdo? Should he kill him and then be killed himself, or\\n\\t\\t\\t\\twhat should he do?\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Something has been\\n\\t\\t\\t\\tsent down about you and your wife, so go and bring her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tSahl continued, \"They mutually cursed one another in the\\n\\t\\t\\t\\tpresence of the Messenger, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, and I was present with the people. When they\\n\\t\\t\\t\\tfinished cursing each other, Uwaymir said, 'I shall have\\n\\t\\t\\t\\tlied about her, Messenger of Allah, if I keep her,' and\\n\\t\\t\\t\\tpronounced the divorce three times before the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tordered him to do it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that Ibn Shihab said, \"That was how the sunna\\n\\t\\t\\t\\tof a couple mutually cursing each other was established\\n\\t\\t\\t\\t(lian).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "35",
    "sectionHeading": "Lian (Invoking Mutual Curses)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafic from Abdullah\\n\\t\\t\\t\\tibn Umar that a man cursed his wife in the time of the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and disowned her child. The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, separated them\\n\\t\\t\\t\\tand gave the child to the woman.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Allah the Blessed, the Exalted, said, 'The\\n\\t\\t\\t\\ttestimony of men who accuse their wives but do not have\\n\\t\\t\\t\\tany witnesses except themselves is to testify by Allah\\n\\t\\t\\t\\tfour times that he is being truthful, and a fifth time,\\n\\t\\t\\t\\tthat the curse of Allah will be upon him, if he should be\\n\\t\\t\\t\\ta liar. She will avoid punishment if she testifies by\\n\\t\\t\\t\\tAllah four times that he is a liar, and a fifth time,\\n\\t\\t\\t\\tthat the wrath of Allah shall be upon her, if he should\\n\\t\\t\\t\\tbe telling the truth. ' \"(Sura 24 ayat 6).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna with us is that those who curse\\n\\t\\t\\t\\teach other are never to be remarried. If the man calls\\n\\t\\t\\t\\thimself a liar, (i.e. takes back his accusation), he is\\n\\t\\t\\t\\tflogged with the hadd-punishment, and the child is given\\n\\t\\t\\t\\tto him, and his wife can never return to him. There is no\\n\\t\\t\\t\\tdoubt or dispute about this sunna among us. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a man separates from his wife by an\\n\\t\\t\\t\\tirrevocable divorce by which he cannot return to her, and\\n\\t\\t\\t\\tthen he denies the paternity of the child she is\\n\\t\\t\\t\\tcarrying, whilst she claims that he is the father, and it\\n\\t\\t\\t\\tis possible by the timing, that he be so, he must curse\\n\\t\\t\\t\\ther, and the child is not recognised as his.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what is done among us, and it is\\n\\t\\t\\t\\twhat I have heard from the people of knowledge.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a man who accused his wife after he had\\n\\t\\t\\t\\tdivorced her trebly while she was pregnant, and he had at\\n\\t\\t\\t\\tfirst accepted being the father but then claimed that he\\n\\t\\t\\t\\thad seen her committing adultery before he separated from\\n\\t\\t\\t\\ther, was flogged with the hadd-punishment, and did not\\n\\t\\t\\t\\tcurse her.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIf he denied the paternity of her child after he had\\n\\t\\t\\t\\tdivorced her trebly, and he had not previously accepted\\n\\t\\t\\t\\tit, then he cursed her.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I have heard.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The slave is in the same position as the\\n\\t\\t\\t\\tfree man as regards making accusations and invoking\\n\\t\\t\\t\\tmutual curses (lian). He acts in the lian as the free man\\n\\t\\t\\t\\tacts although there is no hadd applied for slandering a\\n\\t\\t\\t\\tfemale-slave.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The muslim slave-girl and the christian and\\n\\t\\t\\t\\tjewish free woman also do lian when a free muslim marries\\n\\t\\t\\t\\tone of them and has intercourse with her. That is because\\n\\t\\t\\t\\tAllah - may He be blessed and Exalted, said in His Book,\\n\\t\\t\\t\\t'As for those who accuse their wives,' and they are their\\n\\t\\t\\t\\twives. This is what is done among us.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a man who did the lian with his wife, and\\n\\t\\t\\t\\tthen stopped and called himself a liar after one or two\\n\\t\\t\\t\\toaths and he had not cursed himself in the fifth one, had\\n\\t\\t\\t\\tto be flogged with the hadd-punishment, but they did not\\n\\t\\t\\t\\thave to be separated.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man divorced his wife and then after\\n\\t\\t\\t\\tthree months the woman said, \"I am pregnant,\" and he\\n\\t\\t\\t\\tdenied paternity, then he had to do lian.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that the husband of a female slave who\\n\\t\\t\\t\\tpronounced the lian on her and then bought her, was not\\n\\t\\t\\t\\tto have intercourse with her, even if he owned her. The\\n\\t\\t\\t\\tsunna which had been handed down about a couple who\\n\\t\\t\\t\\tmutually cursed each other in the lian was that they were\\n\\t\\t\\t\\tnever to return to each other.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that when a man pronounced the lian against\\n\\t\\t\\t\\this wife before he had consummated the marriage, she only\\n\\t\\t\\t\\thad half of the bride price.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "36",
    "sectionHeading": "Inheritance of Children of Women against whom Lian has been Pronounced",
    "text": "<p>\\n\\t\\t\\t\\tYaha related to me from Malik that he had heard that Urwa\\n\\t\\t\\t\\tibn az-Zubayr said that if the child of the woman against\\n\\t\\t\\t\\twhom lian had been pronounced or the child of\\n\\t\\t\\t\\tfornication, died, his mother inherited from him her\\n\\t\\t\\t\\tright in the Book of Allah the Exalted, and his maternal\\n\\t\\t\\t\\thalf-brothers had their rights. The rest was inherited by\\n\\t\\t\\t\\tthe owners of his mother's wala' if she was a freed\\n\\t\\t\\t\\tslave. If she was an ordinary free woman, she inherited\\n\\t\\t\\t\\ther right, his maternal brothers inherited their rights,\\n\\t\\t\\t\\tand the rest went to the muslims.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said,\"I heard the same as  that from Sulayman ibn\\n\\t\\t\\t\\tYasar, and it is what I saw the people of knowledge in\\n\\t\\t\\t\\tour city doing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "37",
    "sectionHeading": "Divorce of Virgins",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tMuhammad ibn Abd ar-Rahman ibn Thawban that Muhammad ibn\\n\\t\\t\\t\\tIyas ibn al-Bukayr said, \"A man divorced his wife three\\n\\t\\t\\t\\ttimes before he had consummated the marriage, and then it\\n\\t\\t\\t\\tseemed good to him to marry her. Therefore, he wanted an\\n\\t\\t\\t\\topinion, and I went with him to ask Abdullah ibn Abbas\\n\\t\\t\\t\\tand Abu Hurayra on his behalf about it, and they said,\\n\\t\\t\\t\\t'We do not think that you should marry her until she has\\n\\t\\t\\t\\tmarried another husband.' He protested that his divorcing\\n\\t\\t\\t\\ther had been only once. Ibn Abbas said, 'You threw away\\n\\t\\t\\t\\twhat you had of blessing.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "38",
    "sectionHeading": "Divorce of Virgins",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tBukayr ibn Abdullah al-Ashajj from an-Numan ibn Abi\\n\\t\\t\\t\\tAyyash al Ansari from Ata ibn Yasar that a man came and\\n\\t\\t\\t\\tasked Abdullah ibn Amr ibn al-As about a man who divorced\\n\\t\\t\\t\\this wife three times before he had had intercourse with\\n\\t\\t\\t\\ther Ata said, \"The divorce of the virgin is one. Abdullah\\n\\t\\t\\t\\tibn Amr ibn al-As said to me, 'You say one pronouncement\\n\\t\\t\\t\\tseparates her and three makes her haram until she has\\n\\t\\t\\t\\tmarried another husband.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "38",
    "sectionHeading": "Divorce of Virgins",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tBukayr ibn Abdullah al-Ashajj informed him that Muawiya\\n\\t\\t\\t\\tibn Abi Ayyash al-Ansari told him that he was sitting\\n\\t\\t\\t\\twith Abdullah ibn az-Zubayr and Asim ibn Umar ibn\\n\\t\\t\\t\\tal-Khattab when Muhammad ibn Iyas ibn al-Bukayr came up\\n\\t\\t\\t\\tto them and said, \"A man from the desert has divorced his\\n\\t\\t\\t\\twife three times before consummating the marriage, what\\n\\t\\t\\t\\tdo you think?\" Abdullah ibn az-Zubayr said \"This is\\n\\t\\t\\t\\tsomething about which we have no statement. Go to\\n\\t\\t\\t\\tAbdullah ibn Abbas and Abu Hurayra. I left them with\\n\\t\\t\\t\\tA'isha. Ask them and then come and tell us.\" He went and\\n\\t\\t\\t\\tasked them. Ibn Abbas said to Abu Hurayra, \"Give an\\n\\t\\t\\t\\topinion, Abu Hurayra! A difficult one has come to you.\"\\n\\t\\t\\t\\tAbu Hurayra said, \"One pronouncement separates her and\\n\\t\\t\\t\\tthree makes her haram until she has married another\\n\\t\\t\\t\\thusband.\" Ibn Abbas said the like of that.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what is done among us, and when a\\n\\t\\t\\t\\tman marries a woman who has been married before, and he\\n\\t\\t\\t\\thas not had intercourse with her, she is treated as a\\n\\t\\t\\t\\tvirgin - one pronouncement separates her and three make\\n\\t\\t\\t\\ther haram until she has married another husband.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "40",
    "sectionHeading": "Divorce of Sick Men",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Talha\\n\\t\\t\\t\\tibn Abdullah ibn Awf said, and he knew that better than\\n\\t\\t\\t\\tthem, from Abu Salama ibn Abd ar-Rahman ibn Awf that Abd\\n\\t\\t\\t\\tar-Rahman ibn Awf divorced his wife irrevocably while he\\n\\t\\t\\t\\twas terminally ill, and Uthman ibn Affan made her an heir\\n\\t\\t\\t\\tafter the end of her idda.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "41",
    "sectionHeading": "Divorce of Sick Men",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn al-Fadl\\n\\t\\t\\t\\tfrom al-Araj that Uthman ibn Affan made the wives of ibn\\n\\t\\t\\t\\tMukmil inherit from him, and he had divorced them while\\n\\t\\t\\t\\the was terminally ill.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "42",
    "sectionHeading": "Divorce of Sick Men",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard Rabia ibn\\n\\t\\t\\t\\tAbi Abd ar-Rahman say, ''I heard that the wife of Abd\\n\\t\\t\\t\\tar-Rahman ibn Awf asked him to divorce her. He said,\\n\\t\\t\\t\\t'When you have menstruated and are pure, then come to\\n\\t\\t\\t\\tme.' She did not menstruate until Abd ar-Rahman ibn Awf\\n\\t\\t\\t\\twas ill. When she was purified, she told him and he\\n\\t\\t\\t\\tdivorced her irrevocably or made a pronouncement of\\n\\t\\t\\t\\tdivorce which was all that he had left over her Abd\\n\\t\\t\\t\\tarRahman ibn Awf was terminally ill at the time, so\\n\\t\\t\\t\\tUthman ibn Affan made her one of the heirs after the end\\n\\t\\t\\t\\tof her idda.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "43",
    "sectionHeading": "Divorce of Sick Men",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tMuhammad ibn Yahya ibn Habban said, \"My grandfather\\n\\t\\t\\t\\tHabban had two wives, one from the Hashimites and one\\n\\t\\t\\t\\tfrom the Ansars. He divorced the Ansariyya while she was\\n\\t\\t\\t\\tnursing, and a year passed and he died and she had still\\n\\t\\t\\t\\tnot yet menstruated. She said, 'I inherit from him. I\\n\\t\\t\\t\\thave not menstruated yet.' The wives quarrelled and went\\n\\t\\t\\t\\tto Uthman ibn Affan. He decided that she did inherit, and\\n\\t\\t\\t\\tthe Hashimiyya rebuked Uthman. He said, 'This is the\\n\\t\\t\\t\\tpractice of the son of your paternal uncle. He pointed\\n\\t\\t\\t\\tthis out to us.' He meant Ali ibn Abi Talib.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "44",
    "sectionHeading": "Divorce of Sick Men",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard Ibn\\n\\t\\t\\t\\tShihab say, \"When a man who is terminally ill divorces\\n\\t\\t\\t\\this wife three times, she inherits from him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If he divorces her while he is terminally\\n\\t\\t\\t\\till before he has consummated the marriage, she has half\\n\\t\\t\\t\\tof the bride-price and inherits, and she does not have to\\n\\t\\t\\t\\tdo an idda. If he consummated the marriage, she has all\\n\\t\\t\\t\\tthe dowry and inherits. The virgin and the previously\\n\\t\\t\\t\\tmarried woman are the same in this situation according to\\n\\t\\t\\t\\tus.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "45",
    "sectionHeading": "Compensation in Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Abd\\n\\t\\t\\t\\tar-Rahman ibn Awf divorced his wife, and gave her\\n\\t\\t\\t\\tcompensation in the form of a slave-girl.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"Every divorced woman has compensation\\n\\t\\t\\t\\texcept for the one who is divorced and is allocated a\\n\\t\\t\\t\\tbride-price and has not been touched. She has half of\\n\\t\\t\\t\\twhat was allocated to her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "46",
    "sectionHeading": "Compensation in Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said,\\n\\t\\t\\t\\t\"Every divorced woman has compensation.\" \\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have also heard the same as that from\\n\\t\\t\\t\\tal-Qasim ibn Muhammad.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no fixed limit among us as to how\\n\\t\\t\\t\\tsmall or large the compensation is.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "47",
    "sectionHeading": "The Divorce of the Slave",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tSulayman ibn Yasar that Nufay, a mukatab of Umm Salama\\n\\t\\t\\t\\tthe wife of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, or her slave, had a free woman as a wife. He\\n\\t\\t\\t\\tdivorced her twice, and then he wanted to return to her.\\n\\t\\t\\t\\tThe wives of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, ordered him to go to Uthman ibn Affan to ask\\n\\t\\t\\t\\thim about it. He found him at ad-Daraj with Zayd ibn\\n\\t\\t\\t\\tThabit. He asked them, and they both anticipated him and\\n\\t\\t\\t\\tsaid, \"She is haram for you. She is haram for you.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "48",
    "sectionHeading": "The Divorce of the Slave",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab that Nufay, a mukatab of Umm Salama, the\\n\\t\\t\\t\\twife of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, divorced his free wife twice, so he asked Uthman\\n\\t\\t\\t\\tibn Affan for an opinion, and he said, \"She is haram for\\n\\t\\t\\t\\tyou.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "49",
    "sectionHeading": "The Divorce of the Slave",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdu Rabbih ibn Said\\n\\t\\t\\t\\tfrom Muhammad ibn Ibrahim ibn al-Harith at-Taymi that\\n\\t\\t\\t\\tNufay, a mukatab of Umm Salama, the wife of the Prophet,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, asked Zayd ibn\\n\\t\\t\\t\\tThabit for an opinion. He said, \"I have divorced my free\\n\\t\\t\\t\\twife twice.\" Zayd ibn Thabit said, \"She is haram for\\n\\t\\t\\t\\tyou.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "50",
    "sectionHeading": "The Divorce of the Slave",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"When the slave divorces his wife twice,\\n\\t\\t\\t\\tshe is haram for him until she has married another\\n\\t\\t\\t\\thusband, whether she is free or a slave. The idda of a\\n\\t\\t\\t\\tfree woman is three menstrual periods, and the idda of a\\n\\t\\t\\t\\tslave-girl is two periods.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "51",
    "sectionHeading": "The Divorce of the Slave",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"If a man gives his slave permission to\\n\\t\\t\\t\\tmarry, the divorce is in the hand of the slave, and\\n\\t\\t\\t\\tnobody else has any power over his divorce. Nothing is\\n\\t\\t\\t\\theld against a man who takes the slave-girl of his male\\n\\t\\t\\t\\tslave or the slave-girl of his female-slave.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "51",
    "sectionHeading": "Maintenance of Slave-Girls Divorced when Pregnant",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"Neither a free man nor a slave who divorces\\n\\t\\t\\t\\ta slave-girl nor a slave who divorces a free woman, in an\\n\\t\\t\\t\\tirrevocable divorce, is obliged to pay maintenance even\\n\\t\\t\\t\\tif she is pregnant, and he cannot return to her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A free man is not obliged to pay for the\\n\\t\\t\\t\\tsuckling of his son when he is a slave of other people,\\n\\t\\t\\t\\tnor is a slave obliged to spend his money for what his\\n\\t\\t\\t\\tmaster owns except with the permission of his master.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "52",
    "sectionHeading": "Idda of Women whose Husbands are Missing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSaid ibn al-Musayyab that Umar ibn al-Khattab said, \"The\\n\\t\\t\\t\\twoman who loses her husband and does not know where he\\n\\t\\t\\t\\tis, waits for four years, then she does idda for four\\n\\t\\t\\t\\tmonths, and then she is free to marry.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If she marries after her idda is over,\\n\\t\\t\\t\\tregardless of whether the new husband has consummated the\\n\\t\\t\\t\\tmarriage or not, her first husband has no means of access\\n\\t\\t\\t\\tto her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what is done among us and if her\\n\\t\\t\\t\\thusband reaches her before she has remarried, he is more\\n\\t\\t\\t\\tentitled to her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that he had seen people disapproving of\\n\\t\\t\\t\\tsomeone who said that one of the people (of knowledge)\\n\\t\\t\\t\\tattributed to Umar ibn al-Khattab that he said, \"Her\\n\\t\\t\\t\\tfirst husband chooses when he comes either her\\n\\t\\t\\t\\tbride-price or his wife.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have heard that Umar ibn al-Khattab,\\n\\t\\t\\t\\tspeaking about a woman whose husband divorced her while\\n\\t\\t\\t\\the was absent from her, and then he took her back and the\\n\\t\\t\\t\\tnews of his taking her back had not reached her, while\\n\\t\\t\\t\\tthe news of his divorcing her had, and so she had married\\n\\t\\t\\t\\tagain, said, 'Her first husband who divorced her has no\\n\\t\\t\\t\\tmeans of access to her whether or not the new husband has\\n\\t\\t\\t\\tconsummated the marriage.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I like the best of what I heard\\n\\t\\t\\t\\tabout the missing man.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "53",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar divorced his wife while she was menstruating in\\n\\t\\t\\t\\tthe time of the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, Umar ibn al-Khattab asked the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, about it. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Go and tell him to take\\n\\t\\t\\t\\ther back and keep her until she is purified and then has\\n\\t\\t\\t\\ta period and then is purified. Then if he wishes, he an\\n\\t\\t\\t\\tkeep her, and if he wishes he should divorce her before\\n\\t\\t\\t\\the has intercourse with her. That is the idda which Allah\\n\\t\\t\\t\\thas commanded for women who are divorced.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "54",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr from A'isha, umm al-muminin, that she took\\n\\t\\t\\t\\tHafsa ibn Abd ar-Rahman ibn Abi Bakr as-Siddiq into her\\n\\t\\t\\t\\thouse when she had entered the third period of her idda.\\n\\t\\t\\t\\tIbn Shihab said, \"That was mentioned to Amra bint Abd\\n\\t\\t\\t\\tar-Rahman, and she said that Urwa had spoken the truth\\n\\t\\t\\t\\tand people had argued with A'isha about it. They said\\n\\t\\t\\t\\tthat Allah, the Blessed, the Exalted, said in His Book,\\n\\t\\t\\t\\t'Three quru.' A'isha said, 'You spoke the truth. Do you\\n\\t\\t\\t\\tknow what quru are? Quru are times of becoming pure after\\n\\t\\t\\t\\tmenstruation .' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "55",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said that\\n\\t\\t\\t\\the heard Abu Bakr ibn Abd ar-Rahman say, \"I have never\\n\\t\\t\\t\\tseen any of our fuqaha who did not say that this was what\\n\\t\\t\\t\\tthe statement of A'isha meant.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "56",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi and Zayd ibn\\n\\t\\t\\t\\tAslam from Sulayman ibn Yasar that al-Ahwas died in Syria\\n\\t\\t\\t\\twhen his wife had begun her third menstrual period after\\n\\t\\t\\t\\the had divorced her. Muawiya ibn Abi Sufyan wrote and\\n\\t\\t\\t\\tasked Zayd ibn Thabit about that. Zayd wrote to him,\\n\\t\\t\\t\\t\"When she began her third period, she was free from him\\n\\t\\t\\t\\tand he was free from her, and he does not inherit from\\n\\t\\t\\t\\ther nor she from him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "57",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Abu\\n\\t\\t\\t\\tBakr ibn Abd ar-Rahman and Sulayman ibn Yasar and Ibn\\n\\t\\t\\t\\tShihab used to say, \"When the divorced woman enters the\\n\\t\\t\\t\\tbeginning of her third period, she is clearly separated\\n\\t\\t\\t\\tfrom her husband and there is no inheritance between them\\n\\t\\t\\t\\tand he has no access to her.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "58",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"When a man divorces his wife and she\\n\\t\\t\\t\\tbegins her third period, she is free from him and he is\\n\\t\\t\\t\\tfree from her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is how things are done among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "59",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from al-Fudayl ibn Abi\\n\\t\\t\\t\\tAbdullah, the mawla of al-Mahri that al-Qasim ibn\\n\\t\\t\\t\\tMuhammad and Salim ibn Abdullah said, \"When a woman is\\n\\t\\t\\t\\tdivorced and begins her third period, she is clearly\\n\\t\\t\\t\\tseparated from him and is free to marry again.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "60",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab and Ibn Shihab and Sulayman ibn\\n\\t\\t\\t\\tYasar all said, \"The idda of the woman with a khul\\n\\t\\t\\t\\tdivorce is three periods.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "61",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard Ibn Shihab\\n\\t\\t\\t\\tsay, \"The idda of the divorced woman is reckoned by the\\n\\t\\t\\t\\tmenstrual cycles even if she is estranged .\" (The reason\\n\\t\\t\\t\\tthe idda is normally reckoned by the menstrual cycle is\\n\\t\\t\\t\\tto see whether the woman is pregnant or not.)\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "62",
    "sectionHeading": "Idda of Divorce and Divorce of Menstruating Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from a\\n\\t\\t\\t\\tman of the Ansar that his wife asked him for a divorce,\\n\\t\\t\\t\\tand he said to her, \"When you have had your period, then\\n\\t\\t\\t\\ttell me.\" When she had her period, she told him. He said,\\n\\t\\t\\t\\t\"When you are purified then tell me.\" When she was\\n\\t\\t\\t\\tpurified, she told him and he divorced her.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the best of what I have heard about\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "63",
    "sectionHeading": "Idda of Women in their Houses when Divorced in Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik thal Yahya ibn Said heard\\n\\t\\t\\t\\tal-Qasim ibn Muhammad and Sulayman ibn Yasar both mention\\n\\t\\t\\t\\tthat Yahya ibn Said ibn al-As divorced the daughter of\\n\\t\\t\\t\\tAbd ar-Rahman ibn al-Hakam irrevocably, so Abd ar-Rahman\\n\\t\\t\\t\\tibn al-Hakam took her away A'isha umm al-muminin sent to\\n\\t\\t\\t\\tMarwan ibn al-Hakam who was the Amir of al-Madina at that\\n\\t\\t\\t\\ttime. She said, \"Fear Allah and make him return the woman\\n\\t\\t\\t\\tto her house.\" Marwan said in what Sulayman related,\\n\\t\\t\\t\\t''Abd ar-Rahman has the upper hand over me.\" Marwan said\\n\\t\\t\\t\\tin what al-Qasim related, \"Hasn't the affair of Fatima\\n\\t\\t\\t\\tbint Qays reached you?\" A'isha said, \"You are forced to\\n\\t\\t\\t\\tmention the story of Fatima \" Marwan said, \"If you know\\n\\t\\t\\t\\tthat evil, whatever evil there was between those two is\\n\\t\\t\\t\\tenough for you.\" (See hadith 67.)\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "64",
    "sectionHeading": "Idda of Women in their Houses when Divorced in Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that the\\n\\t\\t\\t\\tdaughter of Said ibn Zayd ibn Amr ibn Nufayl was the wife\\n\\t\\t\\t\\tof Abdullah ibn Umar ibn Uthman ibn Affan, and he\\n\\t\\t\\t\\tdivorced her irrevocably and she moved out. Abdullah ibn\\n\\t\\t\\t\\tUmar rebuked her for that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "65",
    "sectionHeading": "Idda of Women in their Houses when Divorced in Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar divorced one of his wives in the house of Hafsa,\\n\\t\\t\\t\\tthe wife of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, while he was on the way to the mosque. He went\\n\\t\\t\\t\\tanother route from behind the houses being averse to ask\\n\\t\\t\\t\\tpermission to enter until he returned to her.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "66",
    "sectionHeading": "Idda of Women in their Houses when Divorced in Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab was asked who was obliged to pay the\\n\\t\\t\\t\\trent for a woman whose husband divorced her while she was\\n\\t\\t\\t\\tin a leased house. Said ibn al-Musayyab said, \"Her\\n\\t\\t\\t\\thusband is obliged to pay it.\" Someone asked, \"what if\\n\\t\\t\\t\\ther husband does not have it?\" He said, \"Then she must\\n\\t\\t\\t\\tpay it.\" Someone asked, \"And if she does not have it?\" He\\n\\t\\t\\t\\tsaid, \"Then the Amir must pay it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "67",
    "sectionHeading": "Maintenance of Divorced Woman",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Yazid,\\n\\t\\t\\t\\tthe mawla of al-Aswad ibn Sufyan from Abu Salama ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Awf from Fatima bint Qays that Abu Amr ibn\\n\\t\\t\\t\\tHafs divorced her absolutely while he was away in Syria.\\n\\t\\t\\t\\tHis agent sent her some barley and she was displeased\\n\\t\\t\\t\\twith it, saying, \"By Allah, I don't expect anything from\\n\\t\\t\\t\\tyou.\" She went to the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and mentioned it to him. He\\n\\t\\t\\t\\tsaid, \"You have no maintenance.\" He then ordered her to\\n\\t\\t\\t\\tspend her idda in the house of Umm Sharik. Then he said,\\n\\t\\t\\t\\t\"This is a woman whom my companions visit. Spend the idda\\n\\t\\t\\t\\tin the house of Ibn Umm Maktum. He is a blind man and you\\n\\t\\t\\t\\tcan undress at his home. When you are free to remarry,\\n\\t\\t\\t\\ttell me.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe continued, \"When I was free to remarry, I mentioned\\n\\t\\t\\t\\tto him that Muawiya ibn Abi Sufyan and Abu Jahm ibn\\n\\t\\t\\t\\tHisham had asked for me in marriage. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, 'As\\n\\t\\t\\t\\tfor Abu Jahm, he never puts down his stick from his\\n\\t\\t\\t\\tshoulder (i.e. he is always travelling), and as for\\n\\t\\t\\t\\tMuawiya he is a poor man with no property. Marry Usama\\n\\t\\t\\t\\tibn Zayd.' I objected to him and he said, 'Marry Usama\\n\\t\\t\\t\\tibn Zayd,' so I married him, and Allah put good in it and\\n\\t\\t\\t\\tI was content with him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "68",
    "sectionHeading": "Maintenance of Divorced Woman",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard Ibn Shihab\\n\\t\\t\\t\\tsay, \"The woman who is absolutely divorced does not leave\\n\\t\\t\\t\\ther house until she is free to remarry. She has no\\n\\t\\t\\t\\tmaintenance unless she is pregnant. In that circumstance\\n\\t\\t\\t\\tthe husband spends on her until she gives birth.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what is done among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "69",
    "sectionHeading": "Idda of Slave-Girls Divorced by Their Husbands",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"What is done among us when a slave divorces\\n\\t\\t\\t\\ta slave-girl when she is a slave and then she is set\\n\\t\\t\\t\\tfree, is that her idda is the idda of a slave-girl, and\\n\\t\\t\\t\\ther being set free does not change her idda whether or\\n\\t\\t\\t\\tnot he can still return to her. Her idda is not altered.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"The hadd-punishment which a slave incurs is\\n\\t\\t\\t\\tthe same as this. When he is freed after he has incurred\\n\\t\\t\\t\\tbut before the punishment has been executed, his hadd is\\n\\t\\t\\t\\tthe hadd of the slave.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a free man divorces a slave-girl three\\n\\t\\t\\t\\ttimes, her idda is two periods. When a slave divorces a\\n\\t\\t\\t\\tfree woman twice, her idda is three periods.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who had a slave-girl as a wife,\\n\\t\\t\\t\\tand he bought her and set her free, ''Her idda is the\\n\\t\\t\\t\\tidda of a slave-girl, i.e. two periods, as long as he has\\n\\t\\t\\t\\tnot had intercourse with her. If he has had intercourse\\n\\t\\t\\t\\twith her after buying her and before he set her free, she\\n\\t\\t\\t\\tonly has to wait until one period has passed . \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "70",
    "sectionHeading": "General Chapter on Idda of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said and\\n\\t\\t\\t\\tfrom Yazid ibn Abdullah ibn Qusayt al-Laythi that Said\\n\\t\\t\\t\\tibn al-Musayyab said, ''Umar ibn al-Khattab said, 'If a\\n\\t\\t\\t\\twoman is divorced and has one or two periods and then\\n\\t\\t\\t\\tstops menstruating, she must wait nine months. If it is\\n\\t\\t\\t\\tclear that she is pregnant, that is that. If not, she\\n\\t\\t\\t\\tmust do an idda of three months after the nine, and then\\n\\t\\t\\t\\tshe is free to marry.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"Divorce belongs to men, and\\n\\t\\t\\t\\twomen have the idda.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "71",
    "sectionHeading": "General Chapter on Idda of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tibn al-Musayyab said, \"The idda of the woman who bleeds\\n\\t\\t\\t\\tconstantly is a year.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done among us about a divorced woman\\n\\t\\t\\t\\twhose periods stop when her husband divorces her is that\\n\\t\\t\\t\\tshe waits nine months. If she has not had a period in\\n\\t\\t\\t\\tthem, she has an idda of three months. If she has a\\n\\t\\t\\t\\tperiod before the end of the three months, she accepts\\n\\t\\t\\t\\tthe period. If another nine months pass without her\\n\\t\\t\\t\\thaving a period, she does an idda of three months. If she\\n\\t\\t\\t\\thas a second period before the end of those three months,\\n\\t\\t\\t\\tshe accepts the period. If nine months then pass without\\n\\t\\t\\t\\ta period, she does an idda of three months. If she has a\\n\\t\\t\\t\\tthird period, the idda of the period is complete. If she\\n\\t\\t\\t\\tdoes not have a period, she waits three months, and then\\n\\t\\t\\t\\tshe is free to marry. Her husband can return to her\\n\\t\\t\\t\\tbefore she becomes free to marry unless he made her\\n\\t\\t\\t\\tdivorce irrevocable.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sunna with us is that when a man\\n\\t\\t\\t\\tdivorces his wife and has the option to return to her,\\n\\t\\t\\t\\tand she does part of her idda and then he returns to her\\n\\t\\t\\t\\tand then parts from her before he has had intercourse\\n\\t\\t\\t\\twith her, she does not add to what has passed of her\\n\\t\\t\\t\\tidda. Her husband has wronged himself and erred if he\\n\\t\\t\\t\\treturned to her and had no need of her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done among us is that if a woman\\n\\t\\t\\t\\tbecomes a muslim while her husband is a kafir and then he\\n\\t\\t\\t\\tbecomes muslim, he is entitled to her as long as she is\\n\\t\\t\\t\\tin her idda. If her idda is finished, he has no access to\\n\\t\\t\\t\\ther. If he remarries her after the end of her idda,\\n\\t\\t\\t\\thowever, that is not counted as divorce. Islam removed\\n\\t\\t\\t\\ther from him without divorce.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "72",
    "sectionHeading": "The Two Arbiters",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Ali\\n\\t\\t\\t\\tibn Abi Talib said about the two arbiters about whom\\n\\t\\t\\t\\tAllah, the Exalted, said,\"If you fear a breach between\\n\\t\\t\\t\\tthe two, appoint an arbiter from his people, and an\\n\\t\\t\\t\\tarbiter from her people. If they desire to set things\\n\\t\\t\\t\\taright, Allah will make peace between them, surely Allah\\n\\t\\t\\t\\tis Knowing, Aware,\" (Sura 4 ayat 35), that the separation\\n\\t\\t\\t\\tand the joining were overseen by the two of them.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the best of what I have heard from\\n\\t\\t\\t\\tthe people of knowledge. Whatever the two arbiters say\\n\\t\\t\\t\\tconcerning separation or joining is taken into\\n\\t\\t\\t\\tconsideration \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "73",
    "sectionHeading": "Oath of Men to Divorce while Not yet Married",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab, Abdullah ibn Umar, Abdullah ibn\\n\\t\\t\\t\\tMasud, Salim ibn Abdullah, al-Qasim ibn Muhammad, Ibn\\n\\t\\t\\t\\tShihab,and Sulayman ibn Yasar all said, \"If a man has\\n\\t\\t\\t\\tvowed to divorce his wife before marrying her and then he\\n\\t\\t\\t\\tbreaks his vow, divorce is obligatory for him when he\\n\\t\\t\\t\\tmarries her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Masud said that there was nothing binding on\\n\\t\\t\\t\\tsomeone who said, \"Every woman I marry is divorced,\" if\\n\\t\\t\\t\\the did not name a specific tribe or woman.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the best of what I have heard.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man saying to his wife, \"You are\\n\\t\\t\\t\\tdivorced, and every woman I marry is divorced,\" or that\\n\\t\\t\\t\\tall his property would be sadaqa if he did not do\\n\\t\\t\\t\\tsuch-and-such, and he broke his oath: \"As for his wives,\\n\\t\\t\\t\\tit is divorce as he said, and as for his statement,\\n\\t\\t\\t\\t'Every woman I marry is divorced', if he did not name a\\n\\t\\t\\t\\tspecific woman, tribe, or land, or such, it is not\\n\\t\\t\\t\\tbinding on him and he can marry as he wishes. As for his\\n\\t\\t\\t\\tproperty, he gives a third of it away as sadaqa.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "74",
    "sectionHeading": "Deadline of Men who do Not have Intercourse with Their Wives",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tibn al-Musayyab said, \"If someone marries a woman and\\n\\t\\t\\t\\tcannot have intercourse with her, there is a deadline of\\n\\t\\t\\t\\ta year set for him to have intercourse with her. If he\\n\\t\\t\\t\\tdoes not, they are separated.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "75",
    "sectionHeading": "Deadline of Men who do Not have Intercourse with Their Wives",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had asked Ibn\\n\\t\\t\\t\\tShihab about whether the deadline was set from the day he\\n\\t\\t\\t\\thad married her, or from the day she raised the question\\n\\t\\t\\t\\tbefore the Sultan. He said. 'It is from the day she\\n\\t\\t\\t\\tpresents it before the Sultan.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for someone who has intercourse with his\\n\\t\\t\\t\\twife and then is prevented from intercourse with her, I\\n\\t\\t\\t\\thave not heard that there is a deadline set for him or\\n\\t\\t\\t\\tthat they are separated.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "76",
    "sectionHeading": "General Section on Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said, \"I\\n\\t\\t\\t\\thave heard that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said to a man from Thaqif who\\n\\t\\t\\t\\thad ten wives when he became muslim, 'Take four and\\n\\t\\t\\t\\tseparate from the rest.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "77",
    "sectionHeading": "General Section on Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said that\\n\\t\\t\\t\\the had heard Said ibn al-Musayyab, Humayd ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Awf, Ubaydullah ibn Abdullah ibn Utba ibn\\n\\t\\t\\t\\tMasud, and Sulayman ibn Yasarall say, that they had heard\\n\\t\\t\\t\\tAbu Hurayra say that he had heard Umar ibn al-Khattab\\n\\t\\t\\t\\tsay, \"If a woman is divorced by her husband once or\\n\\t\\t\\t\\ttwice, and he leaves her until she is free to marry and\\n\\t\\t\\t\\tshe marries another husband and he dies or divorces her,\\n\\t\\t\\t\\tand then she marries her first husband, she is with him\\n\\t\\t\\t\\taccording to what remains of her divorce.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what is done among us and there is\\n\\t\\t\\t\\tno dispute about it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "78",
    "sectionHeading": "General Section on Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thabit ibn al-Ahnaf\\n\\t\\t\\t\\tthat he married an umm walad of Abd ar-Rahman ibn Zayd\\n\\t\\t\\t\\tibn al-Khattab. He said, \"Abdullah ibn Abd ar-Rahman ibn\\n\\t\\t\\t\\tZayd ibn al-Khattab summoned me and I went to him. I came\\n\\t\\t\\t\\tin upon him and there were whips and two iron fetters\\n\\t\\t\\t\\tplaced there, and two of his slaves whom he had made to\\n\\t\\t\\t\\tsit there. He said, 'Divorce her, or by He by whom one\\n\\t\\t\\t\\tswears, I will do such-and-such to you!' I said, 'It is\\n\\t\\t\\t\\tdivorce a thousand times.' Then I left him and I saw\\n\\t\\t\\t\\tAbdullah ibn Umar on the road to Makka and I told him\\n\\t\\t\\t\\tabout my situation. Abdullah ibn Umar was furious, and\\n\\t\\t\\t\\tsaid, 'That is not divorce, and she is not haram for you,\\n\\t\\t\\t\\tso return to your home.' I was still not at ease so I\\n\\t\\t\\t\\twent to Abdullah ibn az-Zubayr who was the Amir of Makka\\n\\t\\t\\t\\tat that time. I told him about my situation and what\\n\\t\\t\\t\\tAbdullah ibn Umar had said to me. Abdullah ibn az-Zubayr\\n\\t\\t\\t\\tsaid to me, 'She is not haram for you, so return to your\\n\\t\\t\\t\\thome,' and he wrote to Jabir ibn al-Aswad az-Zuhra who\\n\\t\\t\\t\\twas the Amir of Madina and ordered him to punish Abdullah\\n\\t\\t\\t\\tibn Abdar-Rahman and to have him leave me and my family\\n\\t\\t\\t\\talone. I went to Madina, and Safiyya, the wife of\\n\\t\\t\\t\\tAbdullah ibn Umar fitted out my wife so that she could\\n\\t\\t\\t\\tbring her to my house with the knowledge of Abdullah ibn\\n\\t\\t\\t\\tUmar. Then I invited Abdullah ibn Umar on the day of my\\n\\t\\t\\t\\twedding to the wedding feast and he came.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "79",
    "sectionHeading": "General Section on Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Dinar\\n\\t\\t\\t\\tsaid, \"I heard Abdullah ibn Umar recite from the Qur'an,\\n\\t\\t\\t\\t'Prophet! When you divorce women, divorce them at the\\n\\t\\t\\t\\tbeginning of their idda.'\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"He meant by that, to make one pronouncement\\n\\t\\t\\t\\tof divorce at the beginning of each period of purity.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "80",
    "sectionHeading": "General Section on Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"It used to be that a man would divorce\\n\\t\\t\\t\\this wife and then return to her before her idda was over,\\n\\t\\t\\t\\tand that was alright, even if he divorced her a thousand\\n\\t\\t\\t\\ttimes. The man went to his wife and then divorced her and\\n\\t\\t\\t\\twhen the end of her idda was in sight, he took her back\\n\\t\\t\\t\\tand then divorced her and said, 'No! By Allah, I will not\\n\\t\\t\\t\\tgo to you and you will never be able to marry again.'\\n\\t\\t\\t\\tAllah, the Blessed, the Exalted, sent down, 'Divorce is\\n\\t\\t\\t\\ttwice, then honourable retention or setting free kindly.'\\n\\t\\t\\t\\tPeople then turned towards divorce in a new light from\\n\\t\\t\\t\\tthat day whether or not they were divorced or not\\n\\t\\t\\t\\tdivorced.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "81",
    "sectionHeading": "General Section on Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thawr ibn Zayd\\n\\t\\t\\t\\tad-Dili that Allah, the Blessed, the Exalted, sent down\\n\\t\\t\\t\\tabout a man who divorced his wife and then returned to\\n\\t\\t\\t\\ther while he had no need of her and did not mean to keep\\n\\t\\t\\t\\ther so as to make the idda period long for her by that in\\n\\t\\t\\t\\torder to do her harm, \"Do not retain them by force, to\\n\\t\\t\\t\\ttransgress. Whoever does that has wronged himself.\" (Sura\\n\\t\\t\\t\\t2 ayat 231). Allah warns them by that ayat.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "82",
    "sectionHeading": "General Section on Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab and Sulayman ibn Yasar were asked\\n\\t\\t\\t\\tabout a man who divorced when he was drunk. They said,\\n\\t\\t\\t\\t\"When a drunk man divorces, his divorce is allowed. If he\\n\\t\\t\\t\\tkills, he is killed for it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what is done among us.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"If a man does not find the\\n\\t\\t\\t\\tmeans to spend on his wife, they are to be separated . \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what I saw the people of knowledge\\n\\t\\t\\t\\tin our city doing.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t29.30 Idda of Widows when Pregnant\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "83",
    "sectionHeading": "Idda of Widows when Pregnant",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdu Rabbih ibn Said\\n\\t\\t\\t\\tibn Qays that Abu Salama ibn Abd ar-Rahman said that\\n\\t\\t\\t\\tAbdullah ibn Abbas and Abu Hurayra were asked when a\\n\\t\\t\\t\\tpregnant woman whose husband had died could remarry. Ibn\\n\\t\\t\\t\\tAbbas said, \"At the end of two periods.\" Abu Hurayra\\n\\t\\t\\t\\tsaid, \"When she gives birth, she is free to marry.\" Abu\\n\\t\\t\\t\\tSalama ibn Abd ar-Rahman visited Umm Salama, the wife of\\n\\t\\t\\t\\tthe Prophet, may Allah bless him and grant him peace, and\\n\\t\\t\\t\\tasked her about it Umm Salama said, ''Subaya al-Aslamiya\\n\\t\\t\\t\\tgave birth half a month after the death of her husband,\\n\\t\\t\\t\\tand two men asked to marry her. One was young and the\\n\\t\\t\\t\\tother was old. She preferred the young man and so the\\n\\t\\t\\t\\tolder man said, 'You are not free to marry yet.' Her\\n\\t\\t\\t\\tfamily were away and he hoped that when her family came,\\n\\t\\t\\t\\tthey would give her to him. She went to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, and he\\n\\t\\t\\t\\tsaid, 'You are free to marry, so marry whomever you\\n\\t\\t\\t\\twish.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "84",
    "sectionHeading": "Idda of Widows when Pregnant",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar was asked about a woman whose husband died while\\n\\t\\t\\t\\tshe was pregnant, and he said, \"When she gives birth, she\\n\\t\\t\\t\\tis free to marry.\" A man of the Ansar who was with him\\n\\t\\t\\t\\ttold him that Umar ibn al-Khattab had said, \"Had she\\n\\t\\t\\t\\tgiven birth while her husband was still on his bed,\\n\\t\\t\\t\\tunburied, she would be free to marry.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "85",
    "sectionHeading": "Idda of Widows when Pregnant",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn 'Urwa from\\n\\t\\t\\t\\this father that al-Miswar ibn Makhrama told him that\\n\\t\\t\\t\\tSubaya al-Aslamiya gave birth a few nights after the\\n\\t\\t\\t\\tdeath of her husband. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said to her, \"You are free\\n\\t\\t\\t\\tto marry, so marry whomever you wish.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "86",
    "sectionHeading": "Idda of Widows when Pregnant",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSulayman ibn Yasar that Abdullah ibn Abbas and Abu Salama\\n\\t\\t\\t\\tibn Abd ar-Rahman ibn Awf differed on the question of a\\n\\t\\t\\t\\twornan who gave birth a few nights after the death of her\\n\\t\\t\\t\\thusband. Abu Salama said, \"When she gives birth to the\\n\\t\\t\\t\\tchild she is carrying, she is free to marry.\" Ibn Abbas\\n\\t\\t\\t\\tsaid, \"At the end of two periods.\" Abu Hurayra came and\\n\\t\\t\\t\\tsaid, \"I am with my nephew\", meaning Abu Salama. They\\n\\t\\t\\t\\tsent Kurayb, a mawla of Abdullah ibn Abbas to Umm Salama,\\n\\t\\t\\t\\tthe wife of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, to ask her about it. He came back and told\\n\\t\\t\\t\\tthem that she had said that Subaya al-Aslamiya had given\\n\\t\\t\\t\\tbirth a few nights after the death of her husband, and\\n\\t\\t\\t\\tshe had brought the matter to the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, and he had said,\\n\\t\\t\\t\\t\"You are free to marry, so marry whomever you wish.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is how the people of knowledge here\\n\\t\\t\\t\\tcontinue to act.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t29.31 Widows Remaining in Their Houses until Free to\\n\\t\\t\\t\\tMarry\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "87",
    "sectionHeading": "Idda of Widows when Pregnant",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Ishaq ibn\\n\\t\\t\\t\\tKab ibn Ujra from his paternal aunt, Zaynab bint Kab ibn\\n\\t\\t\\t\\tUjra that al-Furaya bint Malik ibn Sinan, the sister of\\n\\t\\t\\t\\tAbu Said al-Khudri, informed her that she went to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and asked to be able to return to her people among\\n\\t\\t\\t\\tthe Banu Khudra since her husband had gone out in search\\n\\t\\t\\t\\tof some of his slaves who had run away and he had caught\\n\\t\\t\\t\\tup with them near al-Qudum, (which is 6 miles from\\n\\t\\t\\t\\tMadina), and they had killed him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe said, \"I asked the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, if I could return to my\\n\\t\\t\\t\\tpeople in the Banu Khudra, as my husband had not left me\\n\\t\\t\\t\\tin a dwelling which belonged to him, and had left me no\\n\\t\\t\\t\\tmaintenance. The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said,'Yes.' So I left. When I was in\\n\\t\\t\\t\\tthe courtyard, the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, called me or summoned me, and I\\n\\t\\t\\t\\tanswered him. He said, 'What did you say?' I repeated the\\n\\t\\t\\t\\tstory about my husband. He said, 'Stay in your house\\n\\t\\t\\t\\tuntil what is written reaches its term.' I did the idda\\n\\t\\t\\t\\tin the house for four months and ten days.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe added, \"When Uthman ibn Affan sent for me, I told him\\n\\t\\t\\t\\tthat, and he followed it and made decisions by it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "88",
    "sectionHeading": "Idda of Widows when Pregnant",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd ibn Qays\\n\\t\\t\\t\\tal-Makki from Amr ibn Shuayb from Said ibn al-Musayyab\\n\\t\\t\\t\\tthat Umar ibn al-Khattab sent back widows from the desert\\n\\t\\t\\t\\tand prevented them from doing the hajj.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Saqd that\\n\\t\\t\\t\\the had heard that as-Sa'ib ibn Khabbab died, and his wife\\n\\t\\t\\t\\twent to Abdullah ibn Umar and mentioned to him that her\\n\\t\\t\\t\\thusband had died and mentioned some land which they had\\n\\t\\t\\t\\tat Qanah, (a district on the outskirts of Madina), and\\n\\t\\t\\t\\tasked him if it would be alright for her to stay\\n\\t\\t\\t\\tovernight there. He forbade her to do so. So, she went\\n\\t\\t\\t\\tout before dawn from Madina and spent the whole day on\\n\\t\\t\\t\\ttheir land, but when evening came, she spent the night in\\n\\t\\t\\t\\ther house.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "89",
    "sectionHeading": "Idda of Widows when Pregnant",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Hisham ibn Urwa said\\n\\t\\t\\t\\tabout a Bedouin woman whose husband died, that she was to\\n\\t\\t\\t\\tstay where her people stayed.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what is done among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "90",
    "sectionHeading": "Idda of Widows when Pregnant",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullan\\n\\t\\t\\t\\tibn Umar said, \"The only place a woman whose husband has\\n\\t\\t\\t\\tdied and a woman who is absolutely divorced can spend the\\n\\t\\t\\t\\tnight is in their houses.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "91",
    "sectionHeading": "Idda of an Umm Walad when Her Master Dies",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat he had heard al-Qasim ibn Muhammad say that Zayd ibn\\n\\t\\t\\t\\tAbd al-Malik separated some men and their wives who were\\n\\t\\t\\t\\tslave-girls who had borne children to men who had died,\\n\\t\\t\\t\\tbecause they had married them after one or two menstrual\\n\\t\\t\\t\\tperiods. He separated them until they had done an idda of\\n\\t\\t\\t\\tfour months and ten days. Al-Qasim ibn Muhammad said,\\n\\t\\t\\t\\t\"Glory be to Allah! Allah says in His Book, 'Those of you\\n\\t\\t\\t\\twho die, leaving wives, they are not wives.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "92",
    "sectionHeading": "Idda of an Umm Walad when Her Master Dies",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that Abdullah ibn Umar\\n\\t\\t\\t\\tsaid, \"The idda of an umm walad when her master dies is\\n\\t\\t\\t\\tone menstrual period.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad said, \"The idda of an umm walad\\n\\t\\t\\t\\twhen her master dies is one menstrual period.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what is done among us.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"If she does not have a menstrual period,\\n\\t\\t\\t\\ther idda is three months.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "93",
    "sectionHeading": "Idda of Slave-Girls whose Master or Husband Dies",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab and Sulayman ibn Yasar said, \"The\\n\\t\\t\\t\\tidda of a slave-girl when her husband dies is two months\\n\\t\\t\\t\\tand five days.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "94",
    "sectionHeading": "Idda of Slave-Girls whose Master or Husband Dies",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me the like of that from Malik from Ibn\\n\\t\\t\\t\\tShihab.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, about a slave who divorced a slave-girl but\\n\\t\\t\\t\\tdid not make it absolute, \"He can return to her. If he\\n\\t\\t\\t\\tthen dies while she is still in the idda from her\\n\\t\\t\\t\\tdivorce, she does the idda of a slave-girl whose husband\\n\\t\\t\\t\\tdies, and it is two months and five days. If she has been\\n\\t\\t\\t\\tset free and he can return to her, and she does not\\n\\t\\t\\t\\tchoose to separate after she has been set free, and he\\n\\t\\t\\t\\tdies while she is in the idda from the divorce, she does\\n\\t\\t\\t\\tthe idda of a free woman whose husband has died, four\\n\\t\\t\\t\\tmonths and ten days. That is because the idda of\\n\\t\\t\\t\\twidowhood befell her while she was free, so her idda is\\n\\t\\t\\t\\tthe idda of a free woman.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what is done among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "95",
    "sectionHeading": "Coitus Interruptus",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman from Muhammad ibn Yahya ibn Habban that Ibn\\n\\t\\t\\t\\tMuhayriz said, \"I went into the mosque and saw Abu Said\\n\\t\\t\\t\\tal-Khudri and so I sat by him and asked him about coitus\\n\\t\\t\\t\\tinterruptus. Abu Said al-Khudri said, 'We went out with\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, on the expedition to the Banu al-Mustaliq. We took\\n\\t\\t\\t\\tsome Arabs prisoner, and we desired the women as celibacy\\n\\t\\t\\t\\twas hard for us. We wanted the ransom, so we wanted to\\n\\t\\t\\t\\tpractise coitus interruptus. We said, 'Shall we practise\\n\\t\\t\\t\\tcoitus interruptus while the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, is among us before\\n\\t\\t\\t\\twe ask him?' We asked him about that and he said, 'You\\n\\t\\t\\t\\tdon't have to not do it. There is no self which is to\\n\\t\\t\\t\\tcome into existence up to the Day of Rising but that it\\n\\t\\t\\t\\twill come into existence.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "96",
    "sectionHeading": "Coitus Interruptus",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n-Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah from Amir ibn Sad ibn Abi Waqqas\\n\\t\\t\\t\\tfrom his father that he used to practise coitus\\n\\t\\t\\t\\tinterruptus.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "97",
    "sectionHeading": "Coitus Interruptus",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n-Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah from Ibn Aflah, the mawla of Abu\\n\\t\\t\\t\\tAyyub al-Ansari from an umm walad of Abu Ayyubal-Ansari\\n\\t\\t\\t\\tthat he practised coitus interruptus.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "98",
    "sectionHeading": "Coitus Interruptus",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar did not practise coitus interruptus and thought\\n\\t\\t\\t\\tthat it was disapproved.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "99",
    "sectionHeading": "Coitus Interruptus",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Damra ibn Said\\n\\t\\t\\t\\tal-Mazini from al-Hajjaj ibn Amr ibn Ghaziya that he was\\n\\t\\t\\t\\tsitting with Zayd ibn Thabit when Ibn Fahd came to him.\\n\\t\\t\\t\\tHe was from the Yemen. He said, \"Abu Said! I have\\n\\t\\t\\t\\tslave-girls. None of the wives in my keep are more\\n\\t\\t\\t\\tpleasing to me than them, and not all of them please me\\n\\t\\t\\t\\tso much that I want a child by them, shall I then\\n\\t\\t\\t\\tpractise coitus interruptus?\" Zayd ibn Thabit said, \"Give\\n\\t\\t\\t\\tan opinion, Hajjaj!\" \"I said, 'May Allah forgive you! We\\n\\t\\t\\t\\tsit with you in order to learn from you!' He said, 'Give\\n\\t\\t\\t\\tan opinion! 'I said, 'She is your field, if you wish,\\n\\t\\t\\t\\twater it, and if you wish, leave it thirsty. I heard that\\n\\t\\t\\t\\tfrom Zayd.' Zayd said, 'He has spoken the truth.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "100",
    "sectionHeading": "Coitus Interruptus",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd ibn Qays\\n\\t\\t\\t\\tal-Makki that a man called Dhafif said that Ibn Abbas was\\n\\t\\t\\t\\tasked about coitus interruptus. He called a slave-girl of\\n\\t\\t\\t\\this and said, \"Tell them.\" She was embarrassed. He said,\\n\\t\\t\\t\\t\"It is alright, and I do it myself.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A man does not practise coitus interruptus\\n\\t\\t\\t\\twith a free woman unless she gives her permission. There\\n\\t\\t\\t\\tis no harm in practising coitus interruptus with a\\n\\t\\t\\t\\tslave-girl without her permission. Someone who has\\n\\t\\t\\t\\tsomeone else's slave-girl as a wife, does not practise\\n\\t\\t\\t\\tcoitus interruptus with her unless her people give him\\n\\t\\t\\t\\tpermission.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "101",
    "sectionHeading": "Limit of Abstaining from Adornment in Mourning",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Muhammad ibn Amr ibn Hazm from Humayd ibn Nafi that\\n\\t\\t\\t\\tZaynab bint Abi Salama related these three traditions to\\n\\t\\t\\t\\thim. Zaynab said, \"I visited Umm Habiba, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, when\\n\\t\\t\\t\\ther father Abu Sufyan ibn Harb had died. Umm Habiba\\n\\t\\t\\t\\tcalled for a yellowy perfume perhaps khaluq or something\\n\\t\\t\\t\\telse. She rubbed the perfume first on a slave-girl and\\n\\t\\t\\t\\tshe then wiped it on the sides of her face and said, 'By\\n\\t\\t\\t\\tAllah! I have no need of perfume but I heard the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, 'It is not halal for a woman who trusts in\\n\\t\\t\\t\\tAllah and the Last Day to abstain from adornment in\\n\\t\\t\\t\\tmourning for someone who has died, for more than three\\n\\t\\t\\t\\tnights, except for four months and ten days for a\\n\\t\\t\\t\\thusband.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "102",
    "sectionHeading": "Limit of Abstaining from Adornment in Mourning",
    "text": "<p>\\n\\t\\t\\t\\tZaynab said, \"I went to the house of Zaynab bint Jahsh,\\n\\t\\t\\t\\tthe wife of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, when her brother had died. She called for\\n\\t\\t\\t\\tperfume and put some on and said, 'By Allah! I have no\\n\\t\\t\\t\\tneed of perfume, but I heard the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, say, 'It is not\\n\\t\\t\\t\\thalal for a woman who trusts in Allah and the Last Day to\\n\\t\\t\\t\\tabstain from adornment in mourning for someone who has\\n\\t\\t\\t\\tdied for more than three nights, except for four months\\n\\t\\t\\t\\tand ten days for a husband.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "103",
    "sectionHeading": "Limit of Abstaining from Adornment in Mourning",
    "text": "<p>\\n\\t\\t\\t\\tZaynab said, \"I heard my mother, Umm Salama, the wife of\\n\\t\\t\\t\\tthe Prophet, may Allah bless him and grant him peace, say\\n\\t\\t\\t\\tthat a woman came to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and said, 'Messenger of\\n\\t\\t\\t\\tAllah! My daughter's husband died, and her eyes are\\n\\t\\t\\t\\ttroubling her, can she put kohl on them?' The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'No' two or three times. Then he said, 'It is only four\\n\\t\\t\\t\\tmonths and ten days. In the Jahiliyya, none of you threw\\n\\t\\t\\t\\taway the piece of dung until a year had passed.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHumayd ibn Nafi said, \"I asked Zaynab to explain what\\n\\t\\t\\t\\t'throwing away the piece of dung at the end of a year'\\n\\t\\t\\t\\tmeant. Zaynab said, 'In the Jahiliyya when a woman's\\n\\t\\t\\t\\thusband died, she went into a small tent and dressed in\\n\\t\\t\\t\\tthe worst of clothes. She did not touch perfume or\\n\\t\\t\\t\\tanything until a year had passed. Then she was brought an\\n\\t\\t\\t\\tanimal - a donkey, a sheep, or a bird, and she would\\n\\t\\t\\t\\tbreak her idda with it, by rubbing her body against it\\n\\t\\t\\t\\t(taftaddu). Rarely did she break her idda with anything\\n\\t\\t\\t\\t(by rubbing herself against it) but that it died. Then\\n\\t\\t\\t\\tshe would come out and would be given a piece of dung.\\n\\t\\t\\t\\tShe would throw it away and then return to whatever she\\n\\t\\t\\t\\twished of perfumes or whatever.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik explained, 'Taftaddu' means to wipe her skin with\\n\\t\\t\\t\\tit in the same way as with a healing charm.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "104",
    "sectionHeading": "Limit of Abstaining from Adornment in Mourning",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Safiyya\\n\\t\\t\\t\\tbint Abi Ubayd from A'isha and Hafsa, the wives of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"It is not halal for a woman in mourning for\\n\\t\\t\\t\\tsomeone who has died, if she trusts in Allah and the Last\\n\\t\\t\\t\\tDay, to abstain from adornment for more than three\\n\\t\\t\\t\\tnights, except for a husband.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "105",
    "sectionHeading": "Limit of Abstaining from Adornment in Mourning",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Umm\\n\\t\\t\\t\\tSalama, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said to a woman in mourning for her\\n\\t\\t\\t\\thusband whose eyes were troubling her and the pain had\\n\\t\\t\\t\\tbecome very strong, \"Apply jala kohl at night and wipe it\\n\\t\\t\\t\\toff in the day.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "106",
    "sectionHeading": "Limit of Abstaining from Adornment in Mourning",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSalim ibn Abdullah and Sulayman ibn Yasar said that if a\\n\\t\\t\\t\\twoman whose husband had died feared that an inflammation\\n\\t\\t\\t\\tof her eyes might affect her sight or that some complaint\\n\\t\\t\\t\\tmight befall her, she should put kohl on and seek a\\n\\t\\t\\t\\tremedy with kohl or some other cure even if it had\\n\\t\\t\\t\\tperfume in it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If there is a necessity, the deen of Allah\\n\\t\\t\\t\\tis ease.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "107",
    "sectionHeading": "Limit of Abstaining from Adornment in Mourning",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafic that Saffiyya\\n\\t\\t\\t\\tbint Abi Ubayd suffered from an eye-complaint while she\\n\\t\\t\\t\\twas in mourning for her husband, Abdullah ibn Umar. She\\n\\t\\t\\t\\tdid not apply kohl until her eyes almost had ramas (a dry\\n\\t\\t\\t\\twhite secretion in the corners of the eye).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A woman whose husband has died should anoint\\n\\t\\t\\t\\ther eyes with olive oil and sesame oil and the like of\\n\\t\\t\\t\\tthat since there is no perfume in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A woman in mourning for her husband should\\n\\t\\t\\t\\tnot put on any jewellery - rings, anklets, or such-like,\\n\\t\\t\\t\\tneither should she dress in any sort of colourful,\\n\\t\\t\\t\\tstriped garment unless it is coarse. She should not wear\\n\\t\\t\\t\\tany cloth dyed with anything except black, and she should\\n\\t\\t\\t\\tonly dress her hair with things like lotus-tree leaves\\n\\t\\t\\t\\twhich do not dye the hair.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "108",
    "sectionHeading": "Limit of Abstaining from Adornment in Mourning",
    "text": "<p>\\n\\t\\t\\t\\t108 Yahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, visited Umm Salama while she was in mourning for\\n\\t\\t\\t\\tAbu Salama and she had put aloes on her eyes. He said,\\n\\t\\t\\t\\t\"What is this, Umm Salama?\" She said, \"It is only aloes,\\n\\t\\t\\t\\tMessenger of Allah.\" He said, \"Put it on at night and\\n\\t\\t\\t\\twipe it off in the daytime.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The mourning of a young girl who has not yet\\n\\t\\t\\t\\thad a menstrual period takes the same form as the\\n\\t\\t\\t\\tmourning of one who has had a period. She avoids what a\\n\\t\\t\\t\\tmature woman avoids if her husband dies.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A slave-girl mourns her husband when he dies\\n\\t\\t\\t\\tfor two months and five nights like her idda.''\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"An umm walad does not have to mourn when her\\n\\t\\t\\t\\tmaster dies, and a slave-girl does not have to mourn when\\n\\t\\t\\t\\ther master dies. Mourning is for those with husbands.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "29",
    "hadithNumber": "109",
    "sectionHeading": "Limit of Abstaining from Adornment in Mourning",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Umm\\n\\t\\t\\t\\tSalama, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"A mourning woman can rub her head\\n\\t\\t\\t\\twith lotus leaves and olive oil.''\\n\\t\\t\\t</p>"
  }
]
