[
  {
    "SurahNumber": "67",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "Since what is termed \"death\" is stated here to have been\\n\\t\\t\\t\\tcreated, it cannot be identical with \"non-existence\", but\\n\\t\\t\\t\\tobviously must have a positive reality of its own. To my\\n\\t\\t\\t\\tmind, it connotes, firstly, the inanimate state of\\n\\t\\t\\t\\texistence preceding the emergence of life in plants or\\n\\t\\t\\t\\tanimated beings; and, secondly, the state of transition\\n\\t\\t\\t\\tfrom life as we know it in this world to the - as yet to\\n\\t\\t\\t\\tus unimaginable - condition of existence referred to in\\n\\t\\t\\t\\tthe Qur'an as \"the hereafter\" or \"the life to come\"\\n\\t\\t\\t\\t(al-akhirah)."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Or: \"conforming [with one another]\", this being the\\n\\t\\t\\t\\tprimary significance of tibaq (sing. tabaq). For the\\n\\t\\t\\t\\tmeaning of the \"seven heavens\", see surah {2}, note [20]."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "Sc., in its endeavour to encompass the mysteries of the\\n\\t\\t\\t\\tuniverse."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "Lit., \"lamps\" - i.e., stars: cf.  37:6  \"We have adorned\\n\\t\\t\\t\\tthe skies nearest to the earth with the beauty of stars\"."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "For the wider meaning of shayatin - a term which in this\\n\\t\\t\\t\\tcontext points specifically  to \"the satans from among\\n\\t\\t\\t\\tmankind, that is, the astrologers\" (Baydawi) - see surah\\n\\t\\t\\t\\t{15}, note [16]. As regards the term rajm (pl. rujum),\\n\\t\\t\\t\\twhich literally denotes the \"throwing [of something] like\\n\\t\\t\\t\\ta stone,\" - i.e., at random - it is often used\\n\\t\\t\\t\\tmetaphorically in the sense of \"speaking conjecturally\"\\n\\t\\t\\t\\tor \"making [something] the object of guesswork\" (Jawhari,\\n\\t\\t\\t\\tRaghib - the latter connecting this metaphor explicitly\\n\\t\\t\\t\\twith the above verse -, Lisan al-'Arab, Qamus, Taj\\n\\t\\t\\t\\tal-'Arus, etc.). Cf. also {37:6-10}."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "I.e., by presuming to know what will happen in the future\\n\\t\\t\\t\\t- a knowledge which rests with God alone. This connects\\n\\t\\t\\t\\twith the statement in verse {4} that man can never truly\\n\\t\\t\\t\\tunravel the mysteries of cosmic space (\"the heavens\"),\\n\\t\\t\\t\\twhich in its turn implies that he should not presume to\\n\\t\\t\\t\\tforetell terrestrial events from the position and the\\n\\t\\t\\t\\taspects of the stars. Since only God knows \"that which is\\n\\t\\t\\t\\tbeyond the reach of a created being's perception\"\\n\\t\\t\\t\\t(al-ghayb), any such attempt is a blasphemy (kufr)."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "Lit., \"You are in nothing but a great error (dalal)\" -\\n\\t\\t\\t\\tthus denying the reality of divine revelation as such."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "10",
    "NoteID": "8",
    "Body": "Reason, properly used, must lead man to a cognition of\\n\\t\\t\\t\\tGod's existence and, thus, of the fact that a definite\\n\\t\\t\\t\\tplan underlies all His creation. A logical concomitant of\\n\\t\\t\\t\\tthat cognition is the realisation that certain aspects of\\n\\t\\t\\t\\tthe divine plan touching upon human life - in particular,\\n\\t\\t\\t\\tthe distinction between right and wrong - are being\\n\\t\\t\\t\\tcontinuously disclosed to man through the medium of the\\n\\t\\t\\t\\trevelation which God bestows on His chosen\\n\\t\\t\\t\\tmessage-bearers, the prophets. This innate \"bond with\\n\\t\\t\\t\\tGod\" (referred to in  2:27  and explained in the\\n\\t\\t\\t\\tcorresponding note [19]) may be broken only at the\\n\\t\\t\\t\\texpense of man's spiritual future, with suffering in the\\n\\t\\t\\t\\tlife to come as the inevitable alternative."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "12",
    "NoteID": "9",
    "Body": "For this rendering of the expression bi'l-ghayb, see\\n\\t\\t\\t\\tsurah {2}, note [3]."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "13",
    "NoteID": "10",
    "Body": "While the primary significance of the noun qawl is \"a\\n\\t\\t\\t\\tsaying\" or \"an utterance\", it is often used tropically in\\n\\t\\t\\t\\tthe sense of \"a statement\", i.e., of a belief, an\\n\\t\\t\\t\\topinion, a teaching, a doctrine, etc. In the present\\n\\t\\t\\t\\tcontext it evidently relates to man's beliefs in general,\\n\\t\\t\\t\\tbe they affirmative or negative: hence the plural form in\\n\\t\\t\\t\\tmy rendering of this term."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "13",
    "NoteID": "11",
    "Body": "I.e., He knows why one person believes in Him and another\\n\\t\\t\\t\\trejects this belief; hence, He takes man's innermost\\n\\t\\t\\t\\tmotivations, abilities and inabilities fully into\\n\\t\\t\\t\\taccount."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "14",
    "NoteID": "12",
    "Body": "Lit., \"Does He not know, [He] who has created?\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "14",
    "NoteID": "13",
    "Body": "See surah {6}, note [89]."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "15",
    "NoteID": "14",
    "Body": "Lit., \"who has made the earth submissive (dhalulan) to\\n\\t\\t\\t\\tyou\": i.e., yielding to the intelligence with which He\\n\\t\\t\\t\\thas endowed man."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "16",
    "NoteID": "15",
    "Body": "This expression is, of course, purely metaphorical since\\n\\t\\t\\t\\tGod is limitless in space as well as in time. Its use\\n\\t\\t\\t\\there is apparently meant to stress the unfathomable\\n\\t\\t\\t\\tquality of His existence and power, which penetrates, and\\n\\t\\t\\t\\treveals itself in, every aspect of His cosmic\\n\\t\\t\\t\\tcreativeness, symbolized in the term \"heaven\"."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "17",
    "NoteID": "16",
    "Body": "Lit., \"a stormwind that raises stones\"."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "18",
    "NoteID": "17",
    "Body": "Lit., \"before them\" (min qablihim). This personal pronoun\\n\\t\\t\\t\\trelates - as does the whole of the passage beginning with\\n\\t\\t\\t\\tverse {13} - to people of all times, who are herewith\\n\\t\\t\\t\\treminded of what happened to deniers of the truth in\\n\\t\\t\\t\\tearlier times; hence my rendering of min qablihim as\\n\\t\\t\\t\\t\"aforetime\"."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "20",
    "NoteID": "18",
    "Body": "Lit., \"an army\"."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "23",
    "NoteID": "20",
    "Body": "I.e., with the faculty of feeling as well as of rational\\n\\t\\t\\t\\tthinking."
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "28",
    "NoteID": "21",
    "Body": "I.e., \"Whether we succeed in spreading God's message or\\n\\t\\t\\t\\tnot, what have you unbelievers to gain?\""
  },
  {
    "SurahNumber": "67",
    "AyahNumber": "30",
    "NoteID": "22",
    "Body": "Apart from a further reminder of God's providential power\\n\\t\\t\\t\\t(thus continuing the argument touched upon in verses\\n\\t\\t\\t\\t{19-21}), the above verse has a parabolic significance as\\n\\t\\t\\t\\twell. Just as water is an indispensable element of all\\n\\t\\t\\t\\torganic life, so is a constant flow of moral\\n\\t\\t\\t\\tconsciousness an indispensable prerequisite of all\\n\\t\\t\\t\\tspiritual life and stability: and who but God could\\n\\t\\t\\t\\tenable man to regain that consciousness after all the\\n\\t\\t\\t\\tolder ethical stimuli have dried up and \"vanished\\n\\t\\t\\t\\tunderground\"?"
  }
]
