[
  {
    "SurahNumber": "63",
    "AyahNumber": "1",
    "Text": "When the hypocrites come to you, they say: \"We bear witness that\\n\\t\\t\\tyou are indeed the Rasool of Allah.\" Allah knows that you are\\n\\t\\t\\tindeed His Rasool, and Allah bears witness that the hypocrites\\n\\t\\t\\tare liars."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "2",
    "Text": "They use their faith as a disguise, and thus debar others from\\n\\t\\t\\tthe Way of Allah. Evil is indeed what they do."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "3",
    "Text": "This is because they believed and then renounced their faith.\\n\\t\\t\\tTheir hearts are sealed, therefore, they are devoid of\\n\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "4",
    "Text": "When you see them, their good stature pleases you; and when they\\n\\t\\t\\tspeak, you listen to what they say. Yet they are as worthless as\\n\\t\\t\\thollow pieces of propped up timber. Every shout they hear, they\\n\\t\\t\\tthink it to be against them. They are your enemies, so guard\\n\\t\\t\\tyourselves against them. May Allah destroy them! How perverse\\n\\t\\t\\tthey are!"
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "5",
    "Text": "When it is said to them: \"Come, the Rasool of Allah will pray for\\n\\t\\t\\tyour forgiveness,\" they shake their heads and you see them\\n\\t\\t\\tturning away with arrogance."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "6",
    "Text": "It is the same, whether you pray for their forgiveness or not,\\n\\t\\t\\tAllah is not going to forgive them. Surely Allah does not guide\\n\\t\\t\\tthe transgressors."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "7",
    "Text": "They are the same people who say: \"Do not give anything to those\\n\\t\\t\\twho follow the Rasool of Allah until they have deserted him.\" To\\n\\t\\t\\tAllah belong the treasures of the heavens and the earth; but the\\n\\t\\t\\thypocrites cannot understand."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "8",
    "Text": "They say: \"When we return to Madinah, the honorable ones will\\n\\t\\t\\tsoon drive out the mean ones.\" But the honor belongs to Allah, to\\n\\t\\t\\tHis Rasool and to the believers; but the hypocrites do not know."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "9",
    "Text": "O believers! Let neither your riches nor your children divert you\\n\\t\\t\\tfrom the remembrance of Allah. Those who will do so, it is they\\n\\t\\t\\twho shall be the real losers."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "10",
    "Text": "Spend, in charity and in the Cause of Allah, out of the\\n\\t\\t\\tsustenance which We have bestowed on you before that time when\\n\\t\\t\\tdeath will come to anyone of you, and he shall say: \"O my Rabb!\\n\\t\\t\\tIf only you would reprieve me for a little while then I would\\n\\t\\t\\tgive out everything in charity, and be among the righteous.\""
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "11",
    "Text": "But Allah reprieves no soul when its term comes to an end. Allah\\n\\t\\t\\tis well aware of all your actions."
  }
]
