[
  {
    "SurahNumber": "71",
    "AyahNumber": "1",
    "Text": "We sent Nuh (Noah) to his people, saying: \"Give warning to your\\n\\t\\t\\tpeople before there comes to them a painful punishment.\""
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "2",
    "Text": "He said: \"O my People! I am sent towards you as a plain Warner."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "3",
    "Text": "Worship Allah, fear Him and obey me."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "4",
    "Text": "If you will do so, He will forgive you your sins and give you\\n\\t\\t\\trespite for an appointed term. The fact is that when the term\\n\\t\\t\\tgiven by Allah arrives, it cannot be deferred. If you could\\n\\t\\t\\tunderstand!\""
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "5",
    "Text": "After exhausting all his efforts Nuh said: \"O Rabb! I have\\n\\t\\t\\tpleaded with my people night and day,"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "6",
    "Text": "but my plea has only added to their aversion."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "7",
    "Text": "Each time I called on them to seek Your pardon, they thrust their\\n\\t\\t\\tfingers in their ears and drew their cloaks over their heads,\\n\\t\\t\\tpersisting in sin and puffing themselves up with insolent pride."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "8",
    "Text": "I have called them aloud,"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "9",
    "Text": "appealed them openly in public and secretly in private,"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "10",
    "Text": "saying: \"Seek forgiveness of your Rabb, He is ever ready to\\n\\t\\t\\tforgive you."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "11",
    "Text": "He will send abundant rain for you from heaven,"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "12",
    "Text": "help you with wealth and sons, and provide you with gardens and\\n\\t\\t\\tthe flowing rivers."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "13",
    "Text": "What is the matter with you that you do not regard the greatness\\n\\t\\t\\tof Allah"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "14",
    "Text": "when He has created you in gradual stages?"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "15",
    "Text": "Can you not see how Allah created the seven heavens one above the\\n\\t\\t\\tother,"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "16",
    "Text": "placing in them the moon as a light and the sun as a glorious\\n\\t\\t\\tlamp?"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "17",
    "Text": "Allah has caused you to grow as a growth from the earth."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "18",
    "Text": "He will return you to the same earth and then raise you back to\\n\\t\\t\\tlife again on the Day of Resurrection?"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "19",
    "Text": "Allah has made the earth for you as a wide expanse"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "20",
    "Text": "so that you may walk in its spacious paths.\""
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "21",
    "Text": "Finally, Nuh (Noah) submitted: \"O Rabb! My people have disobeyed\\n\\t\\t\\tme, and followed those chiefs whose wealth and children have\\n\\t\\t\\tadded to them nothing but loss."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "22",
    "Text": "They have devised an outrageous plot,"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "23",
    "Text": "and said to each other: 'Do not leave your gods; especially Wadd,\\n\\t\\t\\tSuwa, Yaghus, Yauq and Nasr (the names of their idols).'"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "24",
    "Text": "They have already misled many, so O Rabb, do not increase the\\n\\t\\t\\twrongdoers in anything but deviation.\""
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "25",
    "Text": "Because of their wrong doings they were drowned in the great\\n\\t\\t\\tflood and made to enter the fire. They found no one besides Allah\\n\\t\\t\\tto help them."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "26",
    "Text": "As Nuh had prayed: \"O Rabb! Do not leave a single unbeliever on\\n\\t\\t\\tthe surface of the earth."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "27",
    "Text": "For if You spare any of them, they will mislead your servants and\\n\\t\\t\\tbeget none but wicked unbelievers."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "28",
    "Text": "O Rabb! Forgive me, my parents and every true believer who seeks\\n\\t\\t\\trefuge in my house, and all believing men and believing women. As\\n\\t\\t\\tto the wrongdoers, grant them increase in nothing but\\n\\t\\t\\tdestruction.\""
  }
]
