[
  {
    "SurahNumber": "77",
    "AyahNumber": "1",
    "NoteID": "5863",
    "Body": "This Sura begins with an appeal to five things, as\\n\\t\\t\\t\\tpointing to the substantive statement in verse 7, that\\n\\t\\t\\t\\tthe Day of Justice and Judgment is bound to come, and we\\n\\t\\t\\t\\tmust prepare for it. It is difficult to translate, but\\n\\t\\t\\t\\teasy to understand, if we remember that a triple thread\\n\\t\\t\\t\\tof allegory runs through this passage (verses 1-7). The\\n\\t\\t\\t\\tfive things or phases, which will be presently considered\\n\\t\\t\\t\\tin detail, refer to (a) Winds in the physical world, (b)\\n\\t\\t\\t\\tAngels in the Kingdom of Allah, and (c) Prophets in the\\n\\t\\t\\t\\thuman world, connecting it with the Kingdom of Allah."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "1",
    "NoteID": "5864",
    "Body": "Understanding the reference to Winds, we can see that\\n\\t\\t\\t\\tthey are powerful factors in the government of the\\n\\t\\t\\t\\tphysical world. (1) They come gently as harbingers of the\\n\\t\\t\\t\\tblessings of rain and fertility (xv. 22; xxx. 48); but\\n\\t\\t\\t\\t(2) they can come as violent tornadoes, uprooting and\\n\\t\\t\\t\\tdestroying (li. 41-42); (3) they can scatter seeds far\\n\\t\\t\\t\\tand wide, and (4) they can separate chaff from grain, or\\n\\t\\t\\t\\tclear the air from epidemics; and (5) they literally\\n\\t\\t\\t\\tcarry sound, and therefore Messages. All these things\\n\\t\\t\\t\\tpoint to the power and goodness of Allah, and we are\\n\\t\\t\\t\\tasked to believe that His promise of Mercy and Justice in\\n\\t\\t\\t\\tthe Hereafter is indeed true. Cf. this passage with li.\\n\\t\\t\\t\\t1-6 (Zariyat) with which it has many affinities."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "2",
    "NoteID": "5865",
    "Body": "If we understand the reference to be, not to Winds, but\\n\\t\\t\\t\\tto Angels, they are agencies in the Kingdom of Allah,\\n\\t\\t\\t\\twhich carry out similar functions, changing and\\n\\t\\t\\t\\trevolutionising the face of the world. (1) They come\\n\\t\\t\\t\\tsoftly, on beneficent errands of Mercy; (2) they are\\n\\t\\t\\t\\tcharged with the mission of punishment and destruction\\n\\t\\t\\t\\tfor sin as in the case of the two angels who came to Lut\\n\\t\\t\\t\\t(xv. 57-66); (3) they distribute Allah's Mercies as the\\n\\t\\t\\t\\tWinds distribute good seeds; (4) they sort out the good\\n\\t\\t\\t\\tfrom the evil among men; and (5) they are the agency\\n\\t\\t\\t\\tthrough which Allah's Messages and Revelations are\\n\\t\\t\\t\\tconveyed to the Prophets (see No. 5 in the last note)."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "5",
    "NoteID": "5866",
    "Body": "If we understand the reference to Prophets or Messengers\\n\\t\\t\\t\\tof Allah, or the verses of Revelation which would be\\n\\t\\t\\t\\tparticularly appropriate for verses 5-6, we also get a\\n\\t\\t\\t\\tsatisfactory solution of the Allegory. (1) The Prophets\\n\\t\\t\\t\\thave followed one another in a series: the verses of the\\n\\t\\t\\t\\tQur-an came, one after another as needed; in both cases\\n\\t\\t\\t\\tit was for man's spiritual profit; (2) they caused great\\n\\t\\t\\t\\tdisturbance in a spiritual decadent world; they pulled\\n\\t\\t\\t\\tdown evil institutions root and branch, and substituted\\n\\t\\t\\t\\tnew ones; (3) they proclaimed their truths far and wide,\\n\\t\\t\\t\\twithout fear and without favour; (4) through them were\\n\\t\\t\\t\\tsorted out men of Faith and rebels against Allah's Law;\\n\\t\\t\\t\\tand (5) they gave a Message, through which just men were\\n\\t\\t\\t\\tjustified through repentance, and evil men were warned of\\n\\t\\t\\t\\ttheir sins. Some Commentators take one or other of these\\n\\t\\t\\t\\tallegories, and some apply one allegory to a few of these\\n\\t\\t\\t\\tverses, and another to another few. In my opinion the\\n\\t\\t\\t\\tAllegory is wide enough to comprehend all the meanings\\n\\t\\t\\t\\twhich I have sketched. I wish a translation could do\\n\\t\\t\\t\\tjustice to those marvellously terse sentences in the\\n\\t\\t\\t\\toriginal."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "8",
    "NoteID": "5867",
    "Body": "The lustre of the stars will become dim; in fact they\\n\\t\\t\\t\\twill disappear: cf. lxxxi. 2, and lxxxii. 2. The heaven's\\n\\t\\t\\t\\tcanopy will be torn asunder: cf. lxxxii. 1, and lxxiii.\\n\\t\\t\\t\\t18. The mountains will be uprooted and fly about like\\n\\t\\t\\t\\tdust: cf. lxix. 14; lxxxi. 3; etc. All the old landmarks\\n\\t\\t\\t\\tof the physical world as we know it will be swept away."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "11",
    "NoteID": "5868",
    "Body": "The Resurrection will be established. In the world which\\n\\t\\t\\t\\twill then have passed away, inspired Prophets had been\\n\\t\\t\\t\\tsent in succession at different times to all nations. Now\\n\\t\\t\\t\\tthey will be gathered together in one place before the\\n\\t\\t\\t\\tJudgment-seat to bear witness as to the righteous or the\\n\\t\\t\\t\\tevil ones within their respective spheres of work. Cf.\\n\\t\\t\\t\\txxxix. 69."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "13",
    "NoteID": "5869",
    "Body": "Cf. xxxvii. 21 and n. 4047; also xliv. 40, and n. 4718.\\n\\t\\t\\t\\tThat will be the Day of Judgment or Day of Decision. Good\\n\\t\\t\\t\\twill then be completely separated from Evil. And the men\\n\\t\\t\\t\\twho rejected Truth and flourished on Falsehood will find\\n\\t\\t\\t\\tthat in the world of Realities they will be absolutely\\n\\t\\t\\t\\tnowhere. Hence the refrain of this Sura. \"Ah woe, that\\n\\t\\t\\t\\tDay, to the Rejecters of Truth!\" it sounds like a dirge\\n\\t\\t\\t\\ton Sin."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "16",
    "NoteID": "5870",
    "Body": "Allah's Law is always the same. Sin or corruption\\n\\t\\t\\t\\tprepares its own destruction. It was so with the\\n\\t\\t\\t\\tgeneration of Noah. In Arab tradition it was so with the\\n\\t\\t\\t\\t'Ad and the Thamud. In our own day we see relics of\\n\\t\\t\\t\\tprehistoric civilisations, in Egypt, Mesopotamia, the\\n\\t\\t\\t\\tIndus Valley, and the Aegean: these were men of wonderful\\n\\t\\t\\t\\tskill and resource, but they went under. If our\\n\\t\\t\\t\\tgenerations, which pride themselves on their science and\\n\\t\\t\\t\\tskill, desert Allah's Law, they will be certain to meet\\n\\t\\t\\t\\tthe same fate."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "20",
    "NoteID": "5871",
    "Body": "Cf. xxxii. 8, n. 3638. Man is ashamed of the process of\\n\\t\\t\\t\\tphysical creation, by which he comes into being. Yet he\\n\\t\\t\\t\\tis arrogant in life and neglectful of the Future."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "21",
    "NoteID": "5872",
    "Body": "See n. 2873 to xxiii. 13. The silent growth in the\\n\\t\\t\\t\\tmother's womb, and the protection and sustenance which\\n\\t\\t\\t\\tthe growing life receives from the life of the mother,\\n\\t\\t\\t\\tare themselves wonders of creation."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "22",
    "NoteID": "5873",
    "Body": "The period roughly of nine months and ten days is subject\\n\\t\\t\\t\\tto many adjustments. In fact throughout our prenatal as\\n\\t\\t\\t\\twell as post-natal life there are wonderful and\\n\\t\\t\\t\\tnicely-balanced adjustments of which we are ourselves\\n\\t\\t\\t\\tunconscious. Should we not turn in love and gratitude to\\n\\t\\t\\t\\tAllah our Creator?"
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "23",
    "NoteID": "5874",
    "Body": "Perhaps the life in the womb, in relation to the life\\n\\t\\t\\t\\tafter birth, is an allegory for our probationary life on\\n\\t\\t\\t\\tearth in relation to the eternal Life to come. Perhaps,\\n\\t\\t\\t\\talso, our state when we are buried in the tomb suggests\\n\\t\\t\\t\\tan allegory to the life in the womb, in relation to the\\n\\t\\t\\t\\tlife in the Hereafter."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "26",
    "NoteID": "5875",
    "Body": "What a wonderful parable! The earth is a place where\\n\\t\\t\\t\\tdeath and life, decay and growth and decay, green grass,\\n\\t\\t\\t\\tstubble, and fuel, corruption and purification jostle\\n\\t\\t\\t\\ttogether,-one often leading to the other. The drama which\\n\\t\\t\\t\\twe see with our own eyes in this world should enable us\\n\\t\\t\\t\\tto appreciate the wonders in the Kingdom of Allah where\\n\\t\\t\\t\\tthe despised and rejected receive the highest honour,\\n\\t\\t\\t\\tLazarus rests in Abraham's bosom, and the Pharaoh is led\\n\\t\\t\\t\\tin chains for his arrogance and his sin."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "27",
    "NoteID": "5876",
    "Body": "See n. 2038 to xvi. 15. The solid mountains are\\n\\t\\t\\t\\tfrequently referred to: cf. xiii. 3. The parable here is\\n\\t\\t\\t\\tthat the mountains are hard, solid rock, and yet they act\\n\\t\\t\\t\\tas sponges to collect, store up, and filter sweet and\\n\\t\\t\\t\\twholesome water, which on account of their altitude they\\n\\t\\t\\t\\tare able to distribute by gravity to the lower, dry land\\n\\t\\t\\t\\tby means of rivers or springs. Any one who has seen the\\n\\t\\t\\t\\tparched Makkan valleys and the delicious springs in the\\n\\t\\t\\t\\tmountains around, or the Zubaida Canal, which used to be\\n\\t\\t\\t\\tthe main source of Makkah's water-supply, will appreciate\\n\\t\\t\\t\\tthe aptness of the metaphor, but it applies to any\\n\\t\\t\\t\\tcountry, though not to so striking a degree. If the\\n\\t\\t\\t\\twisdom and power of Allah can do such things before your\\n\\t\\t\\t\\teyes, how can you reject His teaching of a still more\\n\\t\\t\\t\\twonderful future Life?"
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "30",
    "NoteID": "5877",
    "Body": "The Sinners, instead of reposing in cool shades, will\\n\\t\\t\\t\\tonly see the blazing Fire. The only shadow they will see\\n\\t\\t\\t\\twill be that of Smoke, ascending in three columns, right,\\n\\t\\t\\t\\tleft, and above, i.e., completely enveloping them. But it\\n\\t\\t\\t\\twill give no comfort or coolness. On the contrary, it\\n\\t\\t\\t\\twill contain huge sparks."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "32",
    "NoteID": "5878",
    "Body": "Qasr: Fort, big building, palace. An alternative reading\\n\\t\\t\\t\\tis Qasar, plural of Qasarat (-un), meaning bundies of\\n\\t\\t\\t\\twood used for fuel: Ibn Abbas apud Bukhari. I almost\\n\\t\\t\\t\\tprefer this latter reading."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "33",
    "NoteID": "5879",
    "Body": "The yellow sparks flying swiftly one after another\\n\\t\\t\\t\\tsuggest a string of camels marching swiftly, such as the\\n\\t\\t\\t\\tArabs of Nejd and central Arabia are so proud of. There\\n\\t\\t\\t\\tis a double allegory. It refers not only to the colour\\n\\t\\t\\t\\tand the rapid succession of sparks, but to the vanity of\\n\\t\\t\\t\\tworldly pride, as much as to say: \"your fine yellow\\n\\t\\t\\t\\tcamels in which you took such pride in the world are but\\n\\t\\t\\t\\tsparks that fly away and even sting you in the\\n\\t\\t\\t\\tHereafter!\" Smoke with sparks may also assume fantastic\\n\\t\\t\\t\\tshapes like long-necked camels."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "35",
    "NoteID": "5880",
    "Body": "They will be dumbfounded; i.e., (when read with the next\\n\\t\\t\\t\\tverse), they will not be in a position to put forward any\\n\\t\\t\\t\\tvalid defence or plea. Facts will speak too plainly\\n\\t\\t\\t\\tagainst them. They might perversely try to deny false\\n\\t\\t\\t\\tworship: vi. 23: but their own tongues and limbs will\\n\\t\\t\\t\\tbear witness against them: xxiv. 24. Nor does the\\n\\t\\t\\t\\tfighting out or settling of doctrinal disputes in the\\n\\t\\t\\t\\tHereafter (xxxix. 31) amount to putting forward pleas in\\n\\t\\t\\t\\tdefence."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "38",
    "NoteID": "5881",
    "Body": "We may suppose this as spoken primarily to the Quraish\\n\\t\\t\\t\\twho were plotting against the Prophet. You may use all\\n\\t\\t\\t\\tyour wisdom and that of your ancestors, but you will not\\n\\t\\t\\t\\tbe able to defeat Allah or His Plan. See next verse."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "39",
    "NoteID": "5882",
    "Body": "The plots against the holy Prophet were plots against\\n\\t\\t\\t\\tAllah's Truth, and therefore against Allah. Can any one\\n\\t\\t\\t\\thope to profit by such plots? Can any one defeat Allah's\\n\\t\\t\\t\\tPlan and Purpose? Let them try. They will only ruin\\n\\t\\t\\t\\tthemselves, as the Pagan leaders did. There can only be\\n\\t\\t\\t\\tpity for such men. What will be their state in the\\n\\t\\t\\t\\tHereafter? \"Ah woe, that Day, to the Rejecters of Allah's\\n\\t\\t\\t\\tTruth!\""
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "41",
    "NoteID": "5883",
    "Body": "This is in contrast to the triple shade of smoke and sin\\n\\t\\t\\t\\tfor the sinners, which neither gives them coolness nor\\n\\t\\t\\t\\tprotects them from the Blazing Fire. The Shade, i.e.\\n\\t\\t\\t\\tCovering, of Allah's Good Pleasure, will be the greatest\\n\\t\\t\\t\\tBoon of all, and the Spring of Allah's Love will be\\n\\t\\t\\t\\tinexhaustible."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "42",
    "NoteID": "5884",
    "Body": "Fruits: see n. 4671 to xliii. 73."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "43",
    "NoteID": "5885",
    "Body": "The fruits of righteousness are contentment in this life\\n\\t\\t\\t\\tand the supreme Bliss in the next."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "46",
    "NoteID": "5886",
    "Body": "\"Eat\" is symbolical of having the good things of life in\\n\\t\\t\\t\\tthis world. It may be that they are only given for a\\n\\t\\t\\t\\ttrial. Because their minds and wishes run to wrong\\n\\t\\t\\t\\tthings, the opportunities for wrong are multiplied, as\\n\\t\\t\\t\\tthe impetus for good or for evil increases progressively.\\n\\t\\t\\t\\tThey are asked to believe and repent. But if they do not,\\n\\t\\t\\t\\tthey are to be pitied, even for the good things of this\\n\\t\\t\\t\\tlife, for they will come to an evil End in the Hereafter."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "48",
    "NoteID": "5887",
    "Body": "Prostration is a symbol of humility and a desire to get\\n\\t\\t\\t\\tnearer to Allah by Prayer and a good life. Those who\\n\\t\\t\\t\\trefuse to adopt this Path are to be pitied: how will they\\n\\t\\t\\t\\tfare at Judgment?"
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "50",
    "NoteID": "5888",
    "Body": "\"That\" may refer to verse 48: they were given plain and\\n\\t\\t\\t\\tclear Guidance, and they refused to accept it: after that\\n\\t\\t\\t\\twhat kind of Message will they accept? The Guidance\\n\\t\\t\\t\\treferred to is obviously that of Islam or the Qur-an."
  }
]
