[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/005001",
        "Body":  "O ye who believe! fulfil (all) obligations. Lawful unto you (for\n\t\t\tfood) are all four-footed animals with the exceptions named: but\n\t\t\tanimals of the chase are forbidden while ye are in the Sacred\n\t\t\tPrecincts or in pilgrim garb: for Allah doth command according to\n\t\t\tHis Will and Plan. \u003cspan class=\u0027fn\u0027\u003e682\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e683\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e684\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e685\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/005010",
        "Body":  "Those who reject faith and deny our signs will be companions of\n\t\t\thell-fire."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "100",
        "Recitation":  "Alafasy_128kbps/005100",
        "Body":  "Say: \"Not equal are things that are bad and things that are good\n\t\t\teven though the abundance of the bad may dazzle thee; so fear\n\t\t\tAllah O ye that understand! that (so) ye may prosper.\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e806\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "101",
        "Recitation":  "Alafasy_128kbps/005101",
        "Body":  "O ye who believe! ask not questions about things which if made\n\t\t\tplain to you may cause you trouble.  But if ye ask about things\n\t\t\twhen the Qur\u0027an is being revealed they will be made plain to you:\n\t\t\tAllah will forgive those: for Allah is Oft-Forgiving Most\n\t\t\tForbearing. \u003cspan class=\u0027fn\u0027\u003e807\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "102",
        "Recitation":  "Alafasy_128kbps/005102",
        "Body":  "Some people before you did ask such questions and on that account\n\t\t\tlost their faith. \u003cspan class=\u0027fn\u0027\u003e808\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "103",
        "Recitation":  "Alafasy_128kbps/005103",
        "Body":  "It was not Allah Who instituted (superstitions like those of) a\n\t\t\tslit-ear she-camel or a she-camel let loose for free pasture or\n\t\t\tidol sacrifices for twin-births in animals or stallion-camels\n\t\t\tfreed from work; it is blasphemers who invent a lie against Allah\n\t\t\tbut most of them lack wisdom. \u003cspan class=\u0027fn\u0027\u003e809\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "104",
        "Recitation":  "Alafasy_128kbps/005104",
        "Body":  "When it is said to them: \"Come to what Allah hath revealed; come\n\t\t\tto the Apostle\": they say: \"Enough for us are the ways we found\n\t\t\tour fathers following.\"  What! even though their fathers were\n\t\t\tvoid of knowledge and guidance? \u003cspan class=\u0027fn\u0027\u003e810\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "105",
        "Recitation":  "Alafasy_128kbps/005105",
        "Body":  "O ye who believe! guard your own souls: if ye follow (right)\n\t\t\tguidance no hurt can come to you from those who stray.\tThe goal\n\t\t\tof you all is to Allah: it is He that will show you the truth of\n\t\t\tall that ye do. \u003cspan class=\u0027fn\u0027\u003e811\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "106",
        "Recitation":  "Alafasy_128kbps/005106",
        "Body":  "O ye who believe! when death approaches any of you (take)\n\t\t\twitnesses among yourselves when making bequests two just men of\n\t\t\tyour own (brotherhood) or others from outside if ye are\n\t\t\tjourneying through the earth and the chance of death befalls you\n\t\t\t(thus).  If ye doubt (their truth) detain them both after prayer\n\t\t\tand let them both swear by Allah: \"We wish not in this for any\n\t\t\tworldly gain even though the (beneficiary) be our near relation:\n\t\t\twe shall hide not the evidence before Allah: if we do then\n\t\t\tbehold! the sin be upon us!\" \u003cspan class=\u0027fn\u0027\u003e812\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "107",
        "Recitation":  "Alafasy_128kbps/005107",
        "Body":  "But if it gets known that these two were guilty of the sin (of\n\t\t\tperjury).  Let two others stand forth in their places nearest in\n\t\t\tkin from among those who claim a lawful right: let them swear by\n\t\t\tAllah: \"We affirm that our witness is truer than that of those\n\t\t\ttwo and that we have not trespassed (beyond the truth): if we did\n\t\t\tbehold! the wrong be upon us! \u003cspan class=\u0027fn\u0027\u003e813\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "108",
        "Recitation":  "Alafasy_128kbps/005108",
        "Body":  "That is most suitable: that they may give the evidence in its\n\t\t\ttrue nature and shape or else they would fear that other oaths\n\t\t\twould be taken after their oaths.  But fear Allah and listen (to\n\t\t\tHis counsel): for Allah guideth not a rebellious people."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "109",
        "Recitation":  "Alafasy_128kbps/005109",
        "Body":  "One day will Allah gather the apostles together and ask: \"What\n\t\t\twas the response ye received (from men to your teaching)?  They\n\t\t\twill say: \"We have no knowledge: it is thou who knowest in full\n\t\t\tall that is hidden. \u003cspan class=\u0027fn\u0027\u003e814\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/005011",
        "Body":  "O ye who believe! call in remembrance the favor of Allah unto you\n\t\t\twhen certain men formed the design to stretch out their hands\n\t\t\tagainst you but (Allah) held back their hands from you: so fear\n\t\t\tAllah.\tAnd on Allah let believers put (all) their trust.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e708\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "110",
        "Recitation":  "Alafasy_128kbps/005110",
        "Body":  "Then will Allah say: \"O Jesus the son of Mary! recount my favor\n\t\t\tto thee and to thy mother.  Behold! I strengthened thee with the\n\t\t\tholy spirit so that thou didst speak to the people in childhood\n\t\t\tand in maturity. Behold! I taught thee the Book and Wisdom the\n\t\t\tLaw and the Gospel. And behold! thou makest out of clay as it\n\t\t\twere the figure of a bird by My leave and thou breathest into it\n\t\t\tand it becometh a bird by My leave and thou healest those born\n\t\t\tblind and the lepers by My leave. And behold! thou bringest forth\n\t\t\tthe dead by My leave.  And behold! I did restrain the Children of\n\t\t\tIsrael from (violence to) thee when thou didst show them the\n\t\t\tClear Signs and the unbelievers among them said: `This is nothing\n\t\t\tbut evident magic\u0027. \u003cspan class=\u0027fn\u0027\u003e815\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e816\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e817\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e818\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e820\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e821\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e822\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "111",
        "Recitation":  "Alafasy_128kbps/005111",
        "Body":  "\"And behold! I inspired the Disciples to have faith in Me and\n\t\t\tMine Apostle: they said `We have faith and do thou bear witness\n\t\t\tthat we bow to Allah as Muslims\u0027.\" \u003cspan class=\u0027fn\u0027\u003e823\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e824\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "112",
        "Recitation":  "Alafasy_128kbps/005112",
        "Body":  "Behold! the disciples said: \"O Jesus the son of Mary! can thy\n\t\t\tLord send down to us a table set (with viands) from heaven?\" Said\n\t\t\tJesus: \"Fear Allah if ye have faith.\" \u003cspan class=\u0027fn\u0027\u003e825\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "113",
        "Recitation":  "Alafasy_128kbps/005113",
        "Body":  "They said: \"We only wish to eat thereof and satisfy our hearts\n\t\t\tand to know that thou hast indeed told us the truth; and that we\n\t\t\tourselves may be witnesses to the miracle."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "114",
        "Recitation":  "Alafasy_128kbps/005114",
        "Body":  "Said Jesus the son of Mary: \"O Allah our Lord! send us from\n\t\t\theaven a table set (with viands) that there may be for us for the\n\t\t\tfirst and the last of us a solemn festival and a sign from Thee;\n\t\t\tand provide for our sustenance for Thou art the best Sustainer\n\t\t\t(of our needs). \u003cspan class=\u0027fn\u0027\u003e826\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e827\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "115",
        "Recitation":  "Alafasy_128kbps/005115",
        "Body":  "Allah said: \"I will send it down unto you: but if any of you\n\t\t\tafter that resisteth faith I will punish him with a penalty such\n\t\t\tas I have not inflicted on anyone among all the peoples.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e828\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "116",
        "Recitation":  "Alafasy_128kbps/005116",
        "Body":  "And behold! Allah will say \"O Jesus the son of Mary! didst thou\n\t\t\tsay unto men `worship me and my mother as gods in derogation of\n\t\t\tAllah\"?  He will say: \"Glory to Thee! never could I say what I\n\t\t\thad no right (to say). Had I said such a thing Thou wouldst\n\t\t\tindeed have known it.  Thou knowest what is in my heart though I\n\t\t\tknow not what is in Thine.  For Thou knowest in full all that is\n\t\t\thidden. \u003cspan class=\u0027fn\u0027\u003e829\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "117",
        "Recitation":  "Alafasy_128kbps/005117",
        "Body":  "\"Never said I to them aught except what Thou didst command me to\n\t\t\tsay to wit `Worship Allah my Lord and your Lord\u0027; and I was a\n\t\t\twitness over them whilst I dwelt amongst them; when Thou didst\n\t\t\ttake me up thou wast the Watcher over them and Thou art a Witness\n\t\t\tto all things. \u003cspan class=\u0027fn\u0027\u003e831\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "118",
        "Recitation":  "Alafasy_128kbps/005118",
        "Body":  "\"If Thou dost punish them they are Thy servants: if Thou dost\n\t\t\tforgive them Thou art the Exalted the Wise. \u003cspan class=\u0027fn\u0027\u003e832\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "119",
        "Recitation":  "Alafasy_128kbps/005119",
        "Body":  "Allah will say: \"This is a day on which the truthful will profit\n\t\t\tfrom their truth: theirs are Gardens with rivers flowing beneath\n\t\t\ttheir eternal home: Allah well-pleased with them and they with\n\t\t\tAllah: that is the great Salvation (the fulfillment of all\n\t\t\tdesires). \u003cspan class=\u0027fn\u0027\u003e833\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/005012",
        "Body":  "Allah did aforetime take a Covenant from the Children of Israel\n\t\t\tand We appointed twelve captains among them and Allah said: \"I am\n\t\t\twith you: if ye (but) establish regular prayers practice regular\n\t\t\tcharity believe in My apostles honor and assist them and loan to\n\t\t\tAllah a beautiful loan verily I will wipe out from you your evils\n\t\t\tand admit you to gardens with rivers flowing beneath; but if any\n\t\t\tof you after this resisteth faith he hath truly wandered from the\n\t\t\tpath of rectitude.\" \u003cspan class=\u0027fn\u0027\u003e709\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e710\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e711\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "120",
        "Recitation":  "Alafasy_128kbps/005120",
        "Body":  "To Allah doth belong the dominion of the heavens and the earth\n\t\t\tand all that is therein and it is He who hath power over all\n\t\t\tthings."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/005013",
        "Body":  "But because of their breach of their Covenant We cursed them and\n\t\t\tmade their hearts grow hard: they change the words from their\n\t\t\t(right) places and forget a good part of the Message that was\n\t\t\tsent them nor wilt thou cease to find them barring a few ever\n\t\t\tbent on (new) deceits: but forgive them and overlook (their\n\t\t\tmisdeeds): for Allah loveth those who are kind. \u003cspan class=\u0027fn\u0027\u003e712\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e713\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e714\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/005014",
        "Body":  "From those too who call themselves Christians We did take a\n\t\t\tCovenant but they forgot a good part of the Message that was sent\n\t\t\tthem: so We estranged them with enmity and hatred between the one\n\t\t\tand the other to the Day of Judgment.  And soon will Allah show\n\t\t\tthem what it is they have done. \u003cspan class=\u0027fn\u0027\u003e715\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e715\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/005015",
        "Body":  "O People of the Book! there hath come to you Our Apostle\n\t\t\trevealing to you much that ye used to hide in the Book and\n\t\t\tpassing over much (that is now unnecessary): There hath come to\n\t\t\tyou from Allah a (new) Light and a perspicuous Book. \u003cspan class=\u0027fn\u0027\u003e716\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/005016",
        "Body":  "Wherewith Allah guideth all who seek His good pleasure to ways of\n\t\t\tpeace and safety and leadeth them out of darkness by His Will\n\t\t\tunto the light guideth them to a Path that is Straight."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/005017",
        "Body":  "In blasphemy indeed are those that say that Allah is Christ the\n\t\t\tson of Mary.  Say: \"Who then hath the least power against Allah\n\t\t\tif His Will were to destroy Christ the son of Mary his mother and\n\t\t\tall everyone that is on the earth?  For to Allah belongeth the\n\t\t\tdominion of the heavens and the earth and all that is between. \n\t\t\tHe createth what He pleaseth.  For Allah hath power over all\n\t\t\tthings.\" \u003cspan class=\u0027fn\u0027\u003e717\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/005018",
        "Body":  "(Both) the Jews and the Christians say: \"We are sons of Allah and\n\t\t\tHis beloved.\"  Say: \"Why then doth He punish you for your sins? \n\t\t\tNay ye are but men of the men He hath created: He forgiveth whom\n\t\t\tHe pleaseth and He punisheth whom He pleaseth: and to Allah\n\t\t\tbelongeth the dominion of the heavens and the earth and all that\n\t\t\tis between: and unto Him is the final goal (of all).\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e718\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e719\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/005019",
        "Body":  "O people of the Book! now hath come unto you making (things)\n\t\t\tclear unto you Our Apostle after the break in (the series of) Our\n\t\t\tapostles lest ye should say: there came unto us no bringer of\n\t\t\tglad tidings and no warner (from evil): but now hath come unto\n\t\t\tyou a bringer of glad tidings and a warner (from evil): and Allah\n\t\t\thath power over all things. \u003cspan class=\u0027fn\u0027\u003e720\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/005002",
        "Body":  "O ye who believe! violate not the sanctity of the Symbols of\n\t\t\tAllah nor of the Sacred Month nor of the animals brought for\n\t\t\tsacrifice nor the garlands that mark out such animals nor the\n\t\t\tpeople resorting to the Sacred House seeking of the bounty and\n\t\t\tgood pleasure of their Lord. But when ye are clear of the Sacred\n\t\t\tPrecincts and of pilgrim garb ye may hunt and let not the hatred\n\t\t\tof some people in (once) shutting you out of the Sacred Mosque\n\t\t\tlead you to transgression (and hostility on your part).  Help ye\n\t\t\tone another in righteousness and piety but help ye not one\n\t\t\tanother in sin and rancor: fear Allah: for Allah is strict in\n\t\t\tpunishment. \u003cspan class=\u0027fn\u0027\u003e686\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e687\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e688\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e689\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e690\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/005020",
        "Body":  "Remember Moses said to his people: \"O my people! call in\n\t\t\tremembrance the favor of Allah unto you when He produced prophets\n\t\t\tamong you made you kings and gave you what He had not given to\n\t\t\tany other among the peoples. \u003cspan class=\u0027fn\u0027\u003e721\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e722\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e723\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/005021",
        "Body":  "\"O my people! enter the holy land which Allah hath assigned unto\n\t\t\tyou and turn not back ignominiously for then will ye be\n\t\t\toverthrown to your own ruin.\" \u003cspan class=\u0027fn\u0027\u003e724\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/005022",
        "Body":  "They said: \"O Moses! in this land are a people of exceeding\n\t\t\tstrength: never shall we enter it until they leave it: if (once)\n\t\t\tthey leave then shall we enter.\" \u003cspan class=\u0027fn\u0027\u003e725\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/005023",
        "Body":  "(But) among (their) Allah-fearing men were two on whom Allah had\n\t\t\tbestowed His Grace: they said: \"Assault them at the (proper)\n\t\t\tgate: when once ye are in, victory will be yours. But on Allah\n\t\t\tput your trust if ye have faith.\" \u003cspan class=\u0027fn\u0027\u003e726\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/005024",
        "Body":  "They said: O \"Moses! while they remain there never shall we be\n\t\t\table to enter to the end of time.  Go thou and thy Lord and fight\n\t\t\tye two while we sit here (and watch).\" \u003cspan class=\u0027fn\u0027\u003e727\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/005025",
        "Body":  "He said: \"O my Lord! I have power only over myself and my bother\n\t\t\tso separate us from this rebellious people!\" \u003cspan class=\u0027fn\u0027\u003e728\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/005026",
        "Body":  "Allah said: \"Therefore will the land be out of their reach for\n\t\t\tforty years; in distraction will they wander through the land:\n\t\t\tbut sorrow thou not over these rebellious people.\" \u003cspan class=\u0027fn\u0027\u003e729\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/005027",
        "Body":  "Recite to them the truth of the story of the two sons of Adam.\n\t\t\tBehold! they each presented a sacrifice (to Allah): it was\n\t\t\taccepted from one but not from the other.  Said the latter: \"Be\n\t\t\tsure I will slay thee.\"  \"Surely\" said the former \"Allah doth\n\t\t\taccept of the sacrifice of those who are righteous. \u003cspan class=\u0027fn\u0027\u003e730\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e731\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/005028",
        "Body":  "\"If thou dost stretch thy hand against me to slay me it is not\n\t\t\tfor me to stretch my hand against thee to slay thee: for I do\n\t\t\tfear Allah the Cherisher of the worlds."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/005029",
        "Body":  "\"For me I intend to let thee draw on thyself my sin as well as\n\t\t\tthine for thou wilt be among the companions of the fire and that\n\t\t\tis the reward of those who do wrong.\" \u003cspan class=\u0027fn\u0027\u003e732\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e733\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/005003",
        "Body":  "Forbidden to you (for food) are: dead meat blood the flesh of\n\t\t\tswine and that on which hath been invoked the name of other than\n\t\t\tAllah that which hath been killed by strangling or by a violent\n\t\t\tblow or by a headlong fall or by being gored to death; that which\n\t\t\thath been (partly) eaten by a wild animal; unless ye are able to\n\t\t\tslaughter it (in due form); that which is sacrificed on stone\n\t\t\t(altars); (forbidden) also is the division (of meat) by raffling\n\t\t\twith arrows: that is impiety.  This day have those who reject\n\t\t\tfaith given up all hope of your religion: yet fear them not but\n\t\t\tfear Me.  This day have I perfected your religion for you\n\t\t\tcompleted my favor upon you and have chosen for you Islam as your\n\t\t\treligion.  But if any forced by hunger with no inclination to\n\t\t\ttransgression Allah is indeed Oft-Forgiving Most Merciful.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e691\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e692\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e693\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e694\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/005030",
        "Body":  "The (selfish) soul of the other led him to the murder of his\n\t\t\tbrother: he murdered him and became (himself) one of the lost\n\t\t\tones. \u003cspan class=\u0027fn\u0027\u003e734\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/005031",
        "Body":  "Then Allah sent a raven who scratched the ground to show him how\n\t\t\tto hide the shame of his brother.  \"Woe is me!\" said he: \"Was I\n\t\t\tnot even able to be as this raven and to hide the shame of my\n\t\t\tbrother?\" Then he became full of regrets. \u003cspan class=\u0027fn\u0027\u003e735\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e736\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/005032",
        "Body":  "On that account: We ordained for the Children of Israel that if\n\t\t\tanyone slew a person unless it be for murder or for spreading\n\t\t\tmischief in the land it would be as if he slew the whole people:\n\t\t\tand if anyone saved a life it would be as if he saved the life of\n\t\t\tthe whole people. Then although there came to them Our apostles\n\t\t\twith clear Signs yet even after that many of them continued to\n\t\t\tcommit excesses in the land. \u003cspan class=\u0027fn\u0027\u003e737\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/005033",
        "Body":  "The punishment of those who wage war against Allah and His\n\t\t\tApostle and strive with might and main for mischief through the\n\t\t\tland is: execution or crucifixion of the cutting off of hands and\n\t\t\tfeet from opposite sides or exile from the land: that is their\n\t\t\tdisgrace in this world and a heavy punishment is theirs in the\n\t\t\tHereafter. \u003cspan class=\u0027fn\u0027\u003e738\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e739\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/005034",
        "Body":  "Except for those who repent before they fall into your power: in\n\t\t\tthat case know that Allah is Oft-Forgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/005035",
        "Body":  "O ye who believe! do your duty to Allah seek the means of\n\t\t\tapproach unto Him and strive with might and main in His cause:\n\t\t\tthat ye may prosper. \u003cspan class=\u0027fn\u0027\u003e740\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e741\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/005036",
        "Body":  "As to those who reject faith if they had everything on earth and\n\t\t\ttwice repeated to give as ransom for the penalty of the Day of\n\t\t\tJudgment it would never be accepted of them.  Theirs would be a\n\t\t\tgrievous penalty."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/005037",
        "Body":  "Their wish will be to get out of the fire but never will they get\n\t\t\tout therefrom: their penalty will be one that endures."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/005038",
        "Body":  "As to the thief male or female cut off his or her hands: a\n\t\t\tpunishment by way of example from Allah for their crime: and\n\t\t\tAllah is Exalted in Power. \u003cspan class=\u0027fn\u0027\u003e742\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/005039",
        "Body":  "But if the thief repent after his crime and amend his conduct\n\t\t\tAllah turneth to him in forgiveness; for Allah is Oft-Forgiving\n\t\t\tMost Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/005004",
        "Body":  "They ask thee what is lawful to them (as food): say: Lawful unto\n\t\t\tyou are (all) things good and pure: and what ye have taught your\n\t\t\ttrained hunting animals (to catch) in the manner directed to you\n\t\t\tby Allah; eat what they catch for you but pronounce the name of\n\t\t\tAllah over it: and fear Allah; for Allah is swift in taking\n\t\t\taccount. \u003cspan class=\u0027fn\u0027\u003e697\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e698\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/005040",
        "Body":  "Knowest thou not that to Allah (alone) belongeth the dominion of\n\t\t\tthe heavens and the earth?  He punisheth whom He pleaseth and He\n\t\t\tforgiveth whom He pleaseth: and Allah hath power over all things.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e743\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/005041",
        "Body":  "O Apostle! let not those grieve thee who race each other into\n\t\t\tunbelief: (whether it be) among those who say: \"We believe\" with\n\t\t\ttheir lips but whose hearts have no faith; or it be among the\n\t\t\tJews men who will listen to any lie will listen even to others\n\t\t\twho have never so much as come to thee.  They change the words\n\t\t\tfrom their (right) times and places; they say \"If ye are given\n\t\t\tthis take it but if not beware:\" If anyone\u0027s trial is intended by\n\t\t\tAllah thou hast no authority in the least for him against Allah. \n\t\t\tFor such it is not Allah\u0027s will to purify their hearts.  For them\n\t\t\tthere is disgrace in this world and in the Hereafter a heavy\n\t\t\tpunishment. \u003cspan class=\u0027fn\u0027\u003e744\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e745\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e746\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/005042",
        "Body":  "(They are fond of) listening to falsehood of devouring anything\n\t\t\tforbidden.  If they do come to thee either judge between them or\n\t\t\tdecline to interfere.  If thou decline they cannot hurt thee in\n\t\t\tthe least.  If thou judge judge in equity between them; for Allah\n\t\t\tloveth those who judge in equity. \u003cspan class=\u0027fn\u0027\u003e747\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e748\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/005043",
        "Body":  "But why do they come to thee for decision when they have (their\n\t\t\town) laws before them?\tTherein is the (plain) command of Allah;\n\t\t\tyet even after that they would turn away.  For they are not\n\t\t\t(really) people of faith. \u003cspan class=\u0027fn\u0027\u003e749\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/005044",
        "Body":  "It was We who revealed the law (to Moses); therein was guidance\n\t\t\tand light.  By its standard have been judged the Jews by the\n\t\t\tProphet who bowed (as in Islam) to Allah\u0027s will by the Rabbis and\n\t\t\tthe doctors of Law: for to them was entrusted the protection of\n\t\t\tAllah\u0027s Book and they were witnesses thereto: therefore fear not\n\t\t\tmen but fear Me and sell not My Signs for a miserable price.  If\n\t\t\tany do fail to judge by (the light of) what Allah hath revealed\n\t\t\tthey are (no better than) unbelievers. \u003cspan class=\u0027fn\u0027\u003e750\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e751\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e752\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e753\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/005045",
        "Body":  "We ordained therein for them: \"Life for life eye for eye nose for\n\t\t\tnose ear for ear tooth for tooth and wounds equal for equal.\" \n\t\t\tBut if anyone remits the retaliation by way of charity it is an\n\t\t\tact of atonement for himself.  And if any fail to judge by (the\n\t\t\tlight of) what Allah hath revealed they are (no better than)\n\t\t\twrong-doers. \u003cspan class=\u0027fn\u0027\u003e754\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e755\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e756\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/005046",
        "Body":  "And in their footsteps We sent Jesus the son of Mary confirming\n\t\t\tthe law that had come before him: We sent him the Gospel: therein\n\t\t\twas guidance and light and confirmation of the law that had come\n\t\t\tbefore him: a guidance and an admonition to those who fear Allah.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e757\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/005047",
        "Body":  "Let the people of the Gospel Judge by what Allah hath revealed\n\t\t\ttherein. If any do fail to judge by (the light of) what Allah\n\t\t\thath revealed they are (no better than) those who rebel.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e758\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/005048",
        "Body":  "To thee We sent the Scripture in truth confirming the scripture\n\t\t\tthat came before it and guarding it in safety; so judge between\n\t\t\tthem by what Allah hath revealed and follow not their vain\n\t\t\tdesires diverging from the truth that hath come to thee.  To each\n\t\t\tamong you have We prescribed a Law and an Open Way.  If Allah had\n\t\t\tso willed He would have made you a single people but (His plan\n\t\t\tis) to test you in what He hath given you: so strive as in a race\n\t\t\tin all virtues.  The goal of you all is to Allah; it is He that\n\t\t\twill show you the truth of the matters in which ye dispute.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e759\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e760\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e761\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e762\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/005049",
        "Body":  "And this (He commands): Judge thou between them by what Allah\n\t\t\thath revealed and follow not their vain desires but beware of\n\t\t\tthem lest they beguile thee from any of that (teaching) which\n\t\t\tAllah hath sent down to thee.  And if they turn away be assured\n\t\t\tthat for some of their crimes it is Allah\u0027s purpose to punish\n\t\t\tthem.  And truly most men are rebellious."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/005005",
        "Body":  "This day are (all) things good and pure made lawful unto you. \n\t\t\tThe food of the People of the Book is lawful unto you and yours\n\t\t\tis lawful unto them.  (Lawful unto you in marriage) are (not\n\t\t\tonly) chaste women who are believers but chaste women among the\n\t\t\tPeople of the Book revealed before your time when ye give them\n\t\t\ttheir due dowers and desire chastity not lewdness nor secret\n\t\t\tintrigues.  If anyone rejects faith fruitless is his work and in\n\t\t\tthe Hereafter he will be in the ranks of those who have lost (all\n\t\t\tspiritual good). \u003cspan class=\u0027fn\u0027\u003e699\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e700\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e701\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/005050",
        "Body":  "Do they then seek after a judgment of (the Days of) Ignorance? \n\t\t\tBut who for a people whose faith is assured can give better\n\t\t\tjudgment than Allah? \u003cspan class=\u0027fn\u0027\u003e763\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/005051",
        "Body":  "O ye who believe! take not the Jews and the Christians for your\n\t\t\tfriends and protectors: they are but friends and protectors to\n\t\t\teach other.  And he amongst you that turns to them (for\n\t\t\tfriendship) is of them.  Verily Allah guideth not a people\n\t\t\tunjust. \u003cspan class=\u0027fn\u0027\u003e764\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/005052",
        "Body":  "Those in whose heart is a disease thou seest how eagerly they run\n\t\t\tabout amongst them saying: \"We do fear lest a change of fortune\n\t\t\tbring us disaster.\"  Ah! perhaps Allah will give (thee) victory\n\t\t\tor a decision according to His Will.  Then will they repent of\n\t\t\tthe thoughts which they secretly harbored in their hearts.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e765\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/005053",
        "Body":  "And those who believe will say: \"Are these the men who swore\n\t\t\ttheir strongest oaths by Allah that they were with you?\"  All\n\t\t\tthat they do will be in vain and they will fall into (nothing\n\t\t\tbut) ruin. \u003cspan class=\u0027fn\u0027\u003e766\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/005054",
        "Body":  "O ye who believe! if any from among you turn back from his faith\n\t\t\tsoon will Allah produce a people whom He will love as they will\n\t\t\tlove Him lowly with the believers mighty against the rejecters\n\t\t\tfighting in the way of Allah and never afraid of the reproaches\n\t\t\tof such as find fault.\tThat is the Grace of Allah which He will\n\t\t\tbestow on whom He pleaseth: and Allah encompasseth all and He\n\t\t\tknoweth all things. \u003cspan class=\u0027fn\u0027\u003e767\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/005055",
        "Body":  "Your (real) friends are (no less than) Allah His Apostle and the\n\t\t\t(fellowship of) believers those who establish regular prayers and\n\t\t\tregular charity and they bow down humbly (in worship)."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/005056",
        "Body":  "As to those who turn (for friendship) to Allah His Apostle and\n\t\t\tthe (fellowship of) believers it is the fellowship of Allah that\n\t\t\tmust certainly triumph."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/005057",
        "Body":  "O ye who believe! take not for friends and protectors those who\n\t\t\ttake your religion for a mockery or sport whether among those who\n\t\t\treceived the Scripture before you or among those who reject\n\t\t\tfaith; but fear ye Allah if ye have Faith (indeed). \u003cspan class=\u0027fn\u0027\u003e768\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/005058",
        "Body":  "When ye proclaim your call to prayer they take it (but) as\n\t\t\tmockery and sport; that is because they are a people without\n\t\t\tunderstanding."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/005059",
        "Body":  "Say: \"O People of the Book! do ye disapprove of us for no other\n\t\t\treason than that we believe in Allah and the revelation that hath\n\t\t\tcome to us and that which came before (us) and (perhaps) that\n\t\t\tmost of you are rebellious and disobedient?\" \u003cspan class=\u0027fn\u0027\u003e769\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/005006",
        "Body":  "O ye who believe! when ye prepare for prayer wash your faces and\n\t\t\tyour hands (and arms) to the elbows; rub your heads (with water);\n\t\t\tand (wash) your feet to the ankles.  If ye are in a state of\n\t\t\tceremonial impurity bathe your whole body.  But if ye are ill or\n\t\t\ton a journey or one of you cometh from offices of nature or ye\n\t\t\thave been in contact with women and ye find no water then take\n\t\t\tfor yourselves clean sand or earth and rub therewith your faces\n\t\t\tand hands.  Allah doth not wish to place you in a difficulty but\n\t\t\tto make you clean and to complete His favor to you that ye may be\n\t\t\tgrateful. \u003cspan class=\u0027fn\u0027\u003e702\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e703\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e704\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/005060",
        "Body":  "Say: \"Shall I point out to you something much worse than this (as\n\t\t\tjudged) by the treatment it received from Allah?  Those who\n\t\t\tincurred the curse of Allah and His wrath those of whom some He\n\t\t\ttransformed into apes and swine those who worshipped Evil; these\n\t\t\tare (many times) worse in rank and far more astray from the even\n\t\t\tPath! \u003cspan class=\u0027fn\u0027\u003e770\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/005061",
        "Body":  "When they come to thee they say: \"We believe\": but in fact they\n\t\t\tenter with a mind against Faith and they go out with the same:\n\t\t\tbut Allah knoweth fully all that they hide."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/005062",
        "Body":  "Many of them dost thou see racing each other in sin and rancor\n\t\t\tand their eating of things forbidden.  Evil indeed are the things\n\t\t\tthat they do. \u003cspan class=\u0027fn\u0027\u003e771\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/005063",
        "Body":  "Why do not the Rabbis and the doctors of laws forbid them from\n\t\t\ttheir (habit of) uttering sinful words and eating things\n\t\t\tforbidden?  Evil indeed are their works."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/005064",
        "Body":  "The Jews say: \"Allah\u0027s hand is tied up.\"  Be their hands tied up\n\t\t\tand be they accursed for the (blasphemy) they utter.  Nay both\n\t\t\tHis hands are widely outstretched: He giveth and spendeth (of His\n\t\t\tbounty) as He pleaseth.  But the revelation that cometh to thee\n\t\t\tfrom Allah increaseth in most of them their obstinate rebellion\n\t\t\tand blasphemy.\tAmongst them We have placed enmity and hatred\n\t\t\ttill the Day of Judgment.  Every time they kindle the fire of war\n\t\t\tAllah doth extinguish it; but they (ever) strive to do mischief\n\t\t\ton earth.  And Allah loveth not those who do mischief.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e772\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e773\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e774\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e775\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/005065",
        "Body":  "If only the people of the Book had believed and been righteous We\n\t\t\tshould indeed have blotted out their iniquities and admitted them\n\t\t\tto gardens of Bliss."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/005066",
        "Body":  "If only they had stood fast by the Law the Gospel and all the\n\t\t\trevelation that was sent to them from their Lord they would have\n\t\t\tenjoyed happiness from every side.  There is from among them a\n\t\t\tparty on the right course; but many of them follow a course that\n\t\t\tis evil. \u003cspan class=\u0027fn\u0027\u003e776\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/005067",
        "Body":  "O Apostle! proclaim the (Message) which hath been sent to thee\n\t\t\tfrom thy Lord.\tIf thou didst not thou wouldst not have fulfilled\n\t\t\tand proclaimed His mission: and Allah will defend thee from men\n\t\t\t(who mean mischief).  For Allah guideth not those who reject\n\t\t\tfaith. \u003cspan class=\u0027fn\u0027\u003e777\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/005068",
        "Body":  "Say: \"O People of the Book! ye have no ground to stand upon\n\t\t\tunless ye stand fast by the Law the Gospel and all the revelation\n\t\t\tthat has come to you from your Lord.\"  It is the revelation that\n\t\t\tcometh to thee from thy Lord that increaseth in most of them\n\t\t\ttheir obstinate rebellion and blasphemy.  But sorrow thou not\n\t\t\tover (these) people without Faith. \u003cspan class=\u0027fn\u0027\u003e778\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/005069",
        "Body":  "Those who believe (in the Qur\u0027an) those who follow the Jewish\n\t\t\t(Scriptures) and the Sabians and the Christians any who believe\n\t\t\tin Allah and the Last Day and work righteousness on them shall be\n\t\t\tno fear nor shall they grieve. \u003cspan class=\u0027fn\u0027\u003e779\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/005007",
        "Body":  "And call in remembrance the favor of Allah unto you and His\n\t\t\tCovenant which He ratified with you when ye said: \"We hear and we\n\t\t\tobey\": and fear Allah for Allah knoweth well the secrets of your\n\t\t\thearts. \u003cspan class=\u0027fn\u0027\u003e705\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/005070",
        "Body":  "We took the Covenant of the Children of Israel and sent them\n\t\t\tApostles. Every time there came to them an apostle with what they\n\t\t\tthemselves desired not some (of these) they called impostors and\n\t\t\tsome they (go so far as to) slay. \u003cspan class=\u0027fn\u0027\u003e780\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/005071",
        "Body":  "They thought there would be no trial (or punishment); so they\n\t\t\tbecame blind and deaf: yet Allah (in mercy) turned to them: yet\n\t\t\tagain many of them became blind and deaf.  But Allah sees well\n\t\t\tall that they do. \u003cspan class=\u0027fn\u0027\u003e781\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/005072",
        "Body":  "They do blaspheme who say: \"Allah is Christ the son of Mary.\" \n\t\t\tBut said Christ: \"O children of Israel! worship Allah my Lord and\n\t\t\tyour Lord.\" Whoever joins other gods with Allah Allah will forbid\n\t\t\thim the garden and the Fire will be his abode.\tThere will for\n\t\t\tthe wrong-doers be no one to help. \u003cspan class=\u0027fn\u0027\u003e782\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/005073",
        "Body":  "They do blaspheme who say: Allah is one of three in a Trinity:\n\t\t\tfor there is no god except One Allah.  If they desist not from\n\t\t\ttheir word (of blasphemy) verily a grievous penalty will befall\n\t\t\tthe blasphemers among them."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/005074",
        "Body":  "Why turn they not to Allah and seek His forgiveness?  For Allah\n\t\t\tis Oft-forgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/005075",
        "Body":  "Christ the son of Mary was no more than an Apostle; many were the\n\t\t\tApostles that passed away before him.  His mother was a woman of\n\t\t\ttruth.\tThey had both to eat their (daily) food.  See how Allah\n\t\t\tdoth makes His Signs clear to them; yet see in what ways they are\n\t\t\tdeluded away from the truth! \u003cspan class=\u0027fn\u0027\u003e783\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e784\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/005076",
        "Body":  "Say: Will ye worship besides Allah something which hath no power\n\t\t\teither to harm or benefit you?\tBut Allah He it is that heareth\n\t\t\tand knoweth all things.\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/005077",
        "Body":  "Say: \"O people of the Book! exceed not in your religion the\n\t\t\tbounds (of what is proper) trespassing beyond the truth nor\n\t\t\tfollow the vain desires of people who went wrong in times gone by\n\t\t\twho misled many and strayed (themselves) from the even way.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e785\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/005078",
        "Body":  "Curses were pronounced on those among the Children of Israel who\n\t\t\trejected faith by the tongue of David and of Jesus the son of\n\t\t\tMary: because they disobeyed and persisted in excesses.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e786\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e787\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/005079",
        "Body":  "Nor did they (usually) forbid one another the iniquities which\n\t\t\tthey committed: evil indeed were the deeds which they did.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e788\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/005008",
        "Body":  "O ye who believe! stand out firmly for Allah as witnesses to fair\n\t\t\tdealing and let not the hatred of others to you make you swerve\n\t\t\tto wrong and depart from justice.  Be just: that is next to\n\t\t\tPiety: and fear Allah for Allah is well-acquainted with all that\n\t\t\tye do. \u003cspan class=\u0027fn\u0027\u003e706\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e707\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/005080",
        "Body":  "Thou seest many of them turning in friendship to the unbelievers.\n\t\t\tEvil indeed are (the works) which their souls have sent forward\n\t\t\tbefore them (with the result) that Allah\u0027s wrath is on them and\n\t\t\tin torment will they abide."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/005081",
        "Body":  "If only they had believed in Allah in the Apostle and in what\n\t\t\thath been revealed to him never would they have taken them for\n\t\t\tfriends and protectors but most of them are rebellious\n\t\t\twrong-doers."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/005082",
        "Body":  "Strongest among men in enmity to the believers wilt thou find the\n\t\t\tJews and Pagans; and nearest among them in love to the believers\n\t\t\twilt thou find those who say: \"We are Christians:\" because\n\t\t\tamongst these are men devoted to learning and men who have\n\t\t\trenounced the world and they are not arrogant. \u003cspan class=\u0027fn\u0027\u003e789\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e790\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/005083",
        "Body":  "And when they listen to the revelation received by the Apostle\n\t\t\tthou wilt see their eyes overflowing with tears for they\n\t\t\trecognize the truth: they pray: \"Our Lord! we believe; write us\n\t\t\tdown among the witnesses."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/005084",
        "Body":  "\"What cause can we have not to believe in Allah and the truth\n\t\t\twhich has come to us seeing that we long for our Lord to admit us\n\t\t\tto the company of the righteous?\""
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/005085",
        "Body":  "And for this their prayer hath Allah rewarded them with gardens\n\t\t\twith rivers flowing underneath their eternal home.  Such is the\n\t\t\trecompense of those who do good."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/005086",
        "Body":  "But those who reject faith and belie our Signs they shall be\n\t\t\tcompanions of hell-fire."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/005087",
        "Body":  "O ye who believe! make not unlawful the good things which Allah\n\t\t\thath made lawful for you but commit no excess: for Allah loveth\n\t\t\tnot those given to excess. \u003cspan class=\u0027fn\u0027\u003e791\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/005088",
        "Body":  "Eat of the things which Allah hath provided for you lawful and\n\t\t\tgood: but fear Allah in Whom ye believe."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "89",
        "Recitation":  "Alafasy_128kbps/005089",
        "Body":  "Allah will not call you to account for what is futile in your\n\t\t\toaths but He will call you to account for your deliberate oaths:\n\t\t\tfor expiation feed then indigent persons on a scale of the\n\t\t\taverage for the food of your families; or clothe them; or give a\n\t\t\tslave his freedom.  If that is beyond your means fast for three\n\t\t\tdays.  That is the expiation for the oaths ye have sworn.  But\n\t\t\tkeep to your oaths.  Thus doth Allah make clear to you His Signs\n\t\t\tthat ye may be grateful. \u003cspan class=\u0027fn\u0027\u003e792\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/005009",
        "Body":  "To those who believe and do deeds of righteousness hath Allah\n\t\t\tpromised forgiveness and a great reward."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "90",
        "Recitation":  "Alafasy_128kbps/005090",
        "Body":  "O ye who believe! intoxicants and gambling (dedication of) stones\n\t\t\tand (divination by) arrows are an abomination of Satan\u0027s\n\t\t\thandiwork: eschew such (abomination) that ye may prosper.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e793\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e794\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e795\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "91",
        "Recitation":  "Alafasy_128kbps/005091",
        "Body":  "Satan\u0027s plan is (but) to excite enmity and hatred between you\n\t\t\twith intoxicants and gambling and hinder you from the remembrance\n\t\t\tof Allah and from prayer: will ye not then abstain?"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "92",
        "Recitation":  "Alafasy_128kbps/005092",
        "Body":  "Obey Allah and obey the Apostle and beware (of evil): if ye do\n\t\t\tturn back know ye that it is Our Apostle\u0027s duty to proclaim (the\n\t\t\tMessage) in the clearest manner. \u003cspan class=\u0027fn\u0027\u003e796\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e797\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "93",
        "Recitation":  "Alafasy_128kbps/005093",
        "Body":  "On those who believe and do deeds of righteousness there is no\n\t\t\tblame for what they ate (in the past) when they guard themselves\n\t\t\tfrom evil and believe and do deeds of righteousness (or) again\n\t\t\tguard themselves from evil and do good.  For Allah loveth those\n\t\t\twho do good. \u003cspan class=\u0027fn\u0027\u003e798\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "94",
        "Recitation":  "Alafasy_128kbps/005094",
        "Body":  "O ye who believe! Allah doth but make a trial of you in a little\n\t\t\tmatter of game well within reach of your hands and your lances\n\t\t\tthat He may test who feareth Him unseen: any who transgress\n\t\t\tthereafter will have a grievous penalty. \u003cspan class=\u0027fn\u0027\u003e799\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "95",
        "Recitation":  "Alafasy_128kbps/005095",
        "Body":  "O ye who believe! kill not game while in the Sacred Precincts or\n\t\t\tin pilgrim garb.  If any of you doth so intentionally the\n\t\t\tcompensation is an offering brought to the Ka\u0027ba of a domestic\n\t\t\tanimal equivalent to the one he killed as adjudged by two just\n\t\t\tmen among you; or by way of atonement the feeding of the\n\t\t\tindigent; or its equivalent in fasts: that he may taste of the\n\t\t\tpenalty of his deed.  Allah forgives what is past: for repetition\n\t\t\tAllah will exact from him the penalty: for Allah is Exalted and\n\t\t\tLord of Retribution. \u003cspan class=\u0027fn\u0027\u003e800\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e801\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "96",
        "Recitation":  "Alafasy_128kbps/005096",
        "Body":  "Lawful to you is the pursuit of water-game and its use for food\n\t\t\tfor the benefit of yourselves and those who travel; but forbidden\n\t\t\tis the pursuit of land-game: as long as ye are in the Sacred\n\t\t\tPrecincts or in pilgrim garb.  And fear Allah to whom ye shall be\n\t\t\tgathered back. \u003cspan class=\u0027fn\u0027\u003e802\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "97",
        "Recitation":  "Alafasy_128kbps/005097",
        "Body":  "Allah made the Ka\u0027ba the Sacred House an asylum of security for\n\t\t\tmen as also the Sacred Months the animals for offerings and the\n\t\t\tgarlands that mark them: that ye may know that Allah hath\n\t\t\tknowledge of what is in the heavens and on earth and that Allah\n\t\t\tis well acquainted with all things. \u003cspan class=\u0027fn\u0027\u003e803\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e804\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e805\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "98",
        "Recitation":  "Alafasy_128kbps/005098",
        "Body":  "Know ye that Allah is strict in punishment and that Allah is Oft-\n\t\t\tForgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "5",
        "AyahNumber":  "99",
        "Recitation":  "Alafasy_128kbps/005099",
        "Body":  "The Apostle\u0027s duty is but to proclaim (the Message): but Allah\n\t\t\tknoweth all that ye reveal and ye conceal."
    }
]
