[
  {
    "SurahNumber": "22",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "Lit., \"thou shalt see [or \"behold\"] mankind drunk\", i.e.,\\n\\t\\t\\t\\tbehaving as if they were drunk. The illusory, purely\\n\\t\\t\\t\\tsubjective character of this \"seeing\" - implied in the\\n\\t\\t\\t\\tuse of the singular form tara (\"thou shalt see\") after\\n\\t\\t\\t\\tthe plural \"you\" employed in the first clause of this\\n\\t\\t\\t\\tverse - justifies the rendering \"it will seem to thee\\n\\t\\t\\t\\tthat...\", etc."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "My interpolation of the words \"their dread of\" is based\\n\\t\\t\\t\\ton the statement in  21:103  that, as far as the\\n\\t\\t\\t\\trighteous are concerned, \"the supreme awesomeness [of the\\n\\t\\t\\t\\tDay of Resurrection] will cause them no grief\" despite\\n\\t\\t\\t\\tthe dread with which it will overwhelm every human being."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "See first half of note [16] on  15:17 ."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "This rendering conforms with the interpretation of the\\n\\t\\t\\t\\tphrase mukhallaqah wa-ghayr mukhallaqah by Ibn 'Abbas and\\n\\t\\t\\t\\tQatadah (the latter quoted by Tabari and the former by\\n\\t\\t\\t\\tBaghawi), alluding to the various stages of embryonic\\n\\t\\t\\t\\tdevelopment. In addition, Tabari explains the expression\\n\\t\\t\\t\\tghayr mukhallaqah as denoting the stage at which the\\n\\t\\t\\t\\tembryonic lump (mudghah) has as yet no individual life -\\n\\t\\t\\t\\tor, in his words, \"when no soul has as yet been breathed\\n\\t\\t\\t\\tinto it\" (la yunfakh fiha ar-ruh). - As regards the\\n\\t\\t\\t\\texpression \"created out of dust\", it is meant to indicate\\n\\t\\t\\t\\tman's lowly biological origin and his affinity with other\\n\\t\\t\\t\\t\"earthy\" substances; see in this connection the second\\n\\t\\t\\t\\thalf of note [47] on  3:59 , and note [4] on  23:12 ."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "See note [79] on  16:70 ."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "See surah {20}, note [99]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "Since many unrighteous people apparently \"prosper\" in\\n\\t\\t\\t\\tthis world, it is clear that the disgrace of which the\\n\\t\\t\\t\\tabove verse speaks is of a moral nature - namely, a\\n\\t\\t\\t\\tgradual coarsening of all moral perceptions and, thus, a\\n\\t\\t\\t\\tdegradation of the spirit."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "11",
    "NoteID": "8",
    "Body": "I.e., wavering between belief and disbelief, and not\\n\\t\\t\\t\\treally committed to either."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "Lit., \"he turns about on his face\" - the \"face\" (wajh) of\\n\\t\\t\\t\\tman signifying metonymically his whole being."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "11",
    "NoteID": "10",
    "Body": "Lit., \"the [most] obvious loss\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "12",
    "NoteID": "11",
    "Body": "By failing to commit himself unreservedly to the faith\\n\\t\\t\\t\\twhich he professes, man is often inclined to attribute to\\n\\t\\t\\t\\tall manner of extraneous forces, be they real or\\n\\t\\t\\t\\timaginary, a decisive \"influence\" on his own destiny, and\\n\\t\\t\\t\\tthus invests them, as it were, with divine qualities."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "12",
    "NoteID": "12",
    "Body": "Lit., \"this, this (dhalika huwa) is the straying\\n\\t\\t\\t\\tfar-away\". For an explanation of my paraphrase, see note\\n\\t\\t\\t\\t[25] on the last sentence of  14:18 ."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "13",
    "NoteID": "13",
    "Body": "The interpolation of \"another human being\" in the opening\\n\\t\\t\\t\\tclause of this verse is necessitated by the relative\\n\\t\\t\\t\\tpronoun man (\"one that\" or \"who\"), which almost always\\n\\t\\t\\t\\trelates to an animate person - in this case, a human\\n\\t\\t\\t\\tbeing who, by allowing himself to be idolized by those\\n\\t\\t\\t\\twho \"worship God on the border-line of faith\", causes\\n\\t\\t\\t\\tinfinite spiritual harm to himself and to his followers."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "15",
    "NoteID": "14",
    "Body": "I.e., that God is not enough to succour him: obviously an\\n\\t\\t\\t\\tallusion to the type of man who \"worships God on the\\n\\t\\t\\t\\tborder-line of faith\" (verse {11} above) and therefore\\n\\t\\t\\t\\tdoubts His power to guide men towards happiness in this\\n\\t\\t\\t\\tworld and in the hereafter. The assumption of the\\n\\t\\t\\t\\tmajority of the commentators that the personal pronoun\\n\\t\\t\\t\\t\"him\" relates to the Prophet Muhammad is, to my mind,\\n\\t\\t\\t\\tvery far-fetched and certainly not warranted by the\\n\\t\\t\\t\\tcontext."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "15",
    "NoteID": "15",
    "Body": "The rendering of la-yaqta' as \"let him [try to] make\\n\\t\\t\\t\\theadway\" is based on the accepted, tropical use of the\\n\\t\\t\\t\\tverb qata'a (lit., \"he cut\") in the sense of \"traversing\\n\\t\\t\\t\\ta distance\": and this is the interpretation of yaqta' by\\n\\t\\t\\t\\tAbu Muslim (as quoted by Razi). The expression \"by any\\n\\t\\t\\t\\t[other] means\" (bi-sabab) relates to what has been said\\n\\t\\t\\t\\tin verses {12-13} above."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "15",
    "NoteID": "16",
    "Body": "Lit., \"that which causes anger\" or \"exasperation\", i.e.,\\n\\t\\t\\t\\tanguish at finding himself helpless and abandoned."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "16",
    "NoteID": "17",
    "Body": "Or: \"God guides aright whomever He wills\". For an\\n\\t\\t\\t\\texplanation of the rendering adopted by me, see note [4]\\n\\t\\t\\t\\ton  14:4 ."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "17",
    "NoteID": "18",
    "Body": "See surah [2]. note {49}."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "17",
    "NoteID": "19",
    "Body": "Al-majus: the followers of Zoroaster or Zarathustra\\n\\t\\t\\t\\t(Zardusht), the Iranian prophet who lived about the\\n\\t\\t\\t\\tmiddle of the last millenium B.C. and whose teachings are\\n\\t\\t\\t\\tlaid down in the Zend-Avesta. They are represented today\\n\\t\\t\\t\\tby the Gabrs of Iran and, more prominently, by the Parsis\\n\\t\\t\\t\\tof India and Pakistan. Their religion, though dualistic\\n\\t\\t\\t\\tin philosophy, is based on belief in God as the Creator\\n\\t\\t\\t\\tof the universe."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "17",
    "NoteID": "20",
    "Body": "The Christians and the Magians (Zoroastrians) are\\n\\t\\t\\t\\tincluded in the first category, for although they do\\n\\t\\t\\t\\tascribe divine qualities to other beings beside God, they\\n\\t\\t\\t\\tregard those beings, fundamentally, as no more than\\n\\t\\t\\t\\tmanifestations - or incarnations - of the One God, thus\\n\\t\\t\\t\\tpersuading themselves that they are worshipping Him\\n\\t\\t\\t\\talone; whereas \"those who are bent on ascribing divinity\\n\\t\\t\\t\\tto beings other than God\" (alladhina ashraku) by obvious\\n\\t\\t\\t\\timplication reject the principle of His oneness and\\n\\t\\t\\t\\tuniqueness."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "18",
    "NoteID": "21",
    "Body": "For the meaning of this \"prostration\", see  13:15  and\\n\\t\\t\\t\\t{16:48-49}, and the corresponding notes. My rendering of\\n\\t\\t\\t\\tthe relative pronoun man, in this context, as \"all\\n\\t\\t\\t\\t[things and beings] that...\" is explained in note [33] on\\n\\t\\t\\t\\t 13:15 ."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "18",
    "NoteID": "22",
    "Body": "According to Zamakhshari and Razi, this interpolated\\n\\t\\t\\t\\tphrase - with its stress on \"consciously\" - is an\\n\\t\\t\\t\\telliptically implied predicate (khabar) linked with the\\n\\t\\t\\t\\tpreceding nominal subject (mubtada'): the purport being\\n\\t\\t\\t\\tthat although everything in creation \"prostrates itself\"\\n\\t\\t\\t\\tbefore God, willingly or unwillingly (cf.  13:15 ), not\\n\\t\\t\\t\\tall human beings do so consciously."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "18",
    "NoteID": "23",
    "Body": "Lit., \"whereas upon many a one the suffering [in the life to come] has become unavoidably incumbent ( haqqa 'alayhi)\", i.e., as a necessary consequence and corollary of his attitude in this world, and not as an arbitrary \"punishment\" in the conventional sense of this term."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "19",
    "NoteID": "24",
    "Body": "Lit., \"these two adversaries\" or \"antagonists\", i.e.,\\n\\t\\t\\t\\tthose who believe in God's oneness and uniqueness, and\\n\\t\\t\\t\\tthose who ascribe divine qualities to beings other than\\n\\t\\t\\t\\tHim, or even deny His existence altogether."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "19",
    "NoteID": "25",
    "Body": "I.e., in distinction from those who err out of ignorance."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "19",
    "NoteID": "26",
    "Body": "For this rendering of hamim, see note [62] on the\\n\\t\\t\\t\\tconcluding sentence of  6:70 , as well as note [65] on\\n\\t\\t\\t\\t 14:50  and note [7] on {73:12-13}, which mention Razi’s\\n\\t\\t\\t\\tinterpretations of similar allegorical descriptions of\\n\\t\\t\\t\\tthe suffering that will befall the sinners in the\\n\\t\\t\\t\\thereafter."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "20",
    "NoteID": "27",
    "Body": "I.e., causing their inner and outer personality utterly\\n\\t\\t\\t\\tto disintegrate."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "21",
    "NoteID": "28",
    "Body": "Lit., \"for them will be grips (maqami) of iron\". The noun\\n\\t\\t\\t\\tmiqma'ah - of which maqami is the plural - is derived\\n\\t\\t\\t\\tfrom the verb qama'a, signifying \"he curbed\" or\\n\\t\\t\\t\\t\"restrained\" or \"held in subjection\" (Lisan al-'Arab).\\n\\t\\t\\t\\tHence, the \"iron grips\" mentioned in the above verse\\n\\t\\t\\t\\tdenote the inescapability of the suffering in the\\n\\t\\t\\t\\thereafter to which \"they who are bent on denying the\\n\\t\\t\\t\\ttruth\" condemn themselves."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "23",
    "NoteID": "29",
    "Body": "See  18:31  and the corresponding note [41]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "24",
    "NoteID": "30",
    "Body": "I.e., that there is no deity save God. (One must bear in\\n\\t\\t\\t\\tmind that the term qawl denotes not merely a saying but\\n\\t\\t\\t\\talso an intellectually formulated \"opinion\" or \"tenet\".)"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "25",
    "NoteID": "31",
    "Body": "This connects with the allusion, in the preceding verse,\\n\\t\\t\\t\\tto \"the way that leads to the One unto whom all praise is\\n\\t\\t\\t\\tdue\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "25",
    "NoteID": "32",
    "Body": "Lit., \"who aim therein at a deviation from the right\\n\\t\\t\\t\\tcourse (ilhad)\" - a term which circumscribes every\\n\\t\\t\\t\\tperversion of religious tenets."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "25",
    "NoteID": "33",
    "Body": "According to Ibn 'Abbas as quoted by Ibn Hisham, this\\n\\t\\t\\t\\tverse was revealed towards the end of the year 6 H., when\\n\\t\\t\\t\\tthe pagan Quraysh refused the Prophet and his followers,\\n\\t\\t\\t\\twho had come on pilgrimage from Medina, the right of\\n\\t\\t\\t\\tentry into Mecca, and thus into the sanctuary of the\\n\\t\\t\\t\\tKa'bah (the \"Inviolable House of Worship\"). But whether\\n\\t\\t\\t\\tor not this claim is correct - and we have no definite\\n\\t\\t\\t\\thistorical evidence in either sense - the purport of the\\n\\t\\t\\t\\tabove verse is not restricted to any historical situation\\n\\t\\t\\t\\tbut relates to every attempt at preventing believers, be\\n\\t\\t\\t\\tit physically or through intellectual seduction, from\\n\\t\\t\\t\\tgoing on pilgrimage to this symbolic centre of their\\n\\t\\t\\t\\tfaith, or at destroying its sanctity in their eyes."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "26",
    "NoteID": "34",
    "Body": "I.e., the Ka'bah: see note [102] on  2:125 ."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "26",
    "NoteID": "35",
    "Body": "In view of the oft-repeated Qur'anic statement that\\n\\t\\t\\t\\tAbraham was beyond all temptation to ascribe divinity to\\n\\t\\t\\t\\tanything but God, it seems to me that the above\\n\\t\\t\\t\\tinjunction has a specific import, namely, \"Do not allow\\n\\t\\t\\t\\tthis Temple to become an object of worship, but make it\\n\\t\\t\\t\\tclear that it is holy only by virtue of its being the\\n\\t\\t\\t\\tfirst temple ever dedicated to the worship of the One\\n\\t\\t\\t\\tGod\" (cf.  3:96 ). Apart from that, it refers to \"those\\n\\t\\t\\t\\twho are bent on denying the truth\" spoken of at the\\n\\t\\t\\t\\tbeginning of the preceding verse."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "26",
    "NoteID": "36",
    "Body": "See surah {2}, note [104]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "27",
    "NoteID": "37",
    "Body": "Lit., \"proclaim thou the pilgrimage among the people\",\\n\\t\\t\\t\\ti.e., the believers (Tabari). Most of the commentators\\n\\t\\t\\t\\tassume that this passage is a continuation of God's\\n\\t\\t\\t\\tcommand to Abraham; but some of them - in particular,\\n\\t\\t\\t\\tAl-Hasan al-Basri - consider it to have been addressed to\\n\\t\\t\\t\\tthe Prophet Muhammad. (Regarding the annual pilgrimage to\\n\\t\\t\\t\\tMecca, as instituted in Islam, see {2:196-203} and the\\n\\t\\t\\t\\tcorresponding notes.)"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "27",
    "NoteID": "38",
    "Body": "Lit., \"lean mount\" - an expression which has induced some\\n\\t\\t\\t\\tof the commentators to assume that it denotes \"a camel\\n\\t\\t\\t\\tthat has become lean on account of a long and fatiguing\\n\\t\\t\\t\\tjourney\". However, the verb dammarahu or admarahu relates\\n\\t\\t\\t\\tin classical Arabic not only to camels but also to\\n\\t\\t\\t\\thorses, and has the meaning of \"he made it [i.e., the\\n\\t\\t\\t\\tmount] lean and fit [for racing or warl\"; thus, the noun\\n\\t\\t\\t\\tmidmar signifies \"a training-ground where horses are\\n\\t\\t\\t\\tprepared for racing or war\", as well as \"a race-course\"\\n\\t\\t\\t\\t(Jawhari, Asas, etc.; cf. also Lane V, 1803 f.). Hence,\\n\\t\\t\\t\\tthe adjectival noun damir - especially when contrasted,\\n\\t\\t\\t\\tas above, with the expression rijalan (\"on foot\") - has\\n\\t\\t\\t\\tthe connotation of \"fleetness\" or more properly, \"fitness\\n\\t\\t\\t\\tfor speed\", and may by inference be applied to every kind\\n\\t\\t\\t\\tof \"fast conveyance\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "28",
    "NoteID": "39",
    "Body": "Lit., \"that they might witness benefits [accruing] to\\n\\t\\t\\t\\tthem\" - i.e., increased consciousness of God through\\n\\t\\t\\t\\tfacing the first temple ever dedicated to Him, as well as\\n\\t\\t\\t\\tthe consciousness of being part of a brotherhood\\n\\t\\t\\t\\tembracing all believers. Apart from these spiritual\\n\\t\\t\\t\\tbenefits, the annual pilgrimage to Mecca provides an\\n\\t\\t\\t\\topportunity for believers from all parts of the world to\\n\\t\\t\\t\\tbecome acquainted with the many social and political\\n\\t\\t\\t\\tproblems that confront various geographically separated\\n\\t\\t\\t\\tsectors of the community."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "28",
    "NoteID": "40",
    "Body": "The repeated Qur'anic insistence on pronouncing the name\\n\\t\\t\\t\\tof God whenever one slaughters an animal is meant to make\\n\\t\\t\\t\\tthe believers \"realize the awfulness of taking life, and\\n\\t\\t\\t\\tthe solemn nature of the trust which God has conferred\\n\\t\\t\\t\\tupon them in the permission to eat the flesh of animals\"\\n\\t\\t\\t\\t(Marmaduke Pickthall, The Meaning of the Glorious Koran,\\n\\t\\t\\t\\tLondon 1930, p. 342, footnote 2). As regards the \"days\\n\\t\\t\\t\\tappointed\" (ayyam ma 'lumat) spoken of above, they\\n\\t\\t\\t\\tapparently denote the Festival of Sacrifices, which falls\\n\\t\\t\\t\\ton the 10th of the lunar month of Dhu 'l-Hijjah, as well\\n\\t\\t\\t\\tas the next two days, marking the end of the pilgramage\\n\\t\\t\\t\\t(Ibn 'Abbas, as quoted by Razi)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "28",
    "NoteID": "41",
    "Body": "Whereas the pilgrims are merely permitted to eat some of\\n\\t\\t\\t\\tthe flesh of the animals which they have sacrificed, the\\n\\t\\t\\t\\tfeeding of the poor is mandatory (Tabari and Zamakhshari)\\n\\t\\t\\t\\tand constitutes, thus, the primary objective of these\\n\\t\\t\\t\\tsacrifices. Apart from this, they are meant to\\n\\t\\t\\t\\tcommemorate Abraham’s readiness to sacrifice his\\n\\t\\t\\t\\tfirst-born son after he dreamt that God demanded of him\\n\\t\\t\\t\\tthis supreme sacrifice (see {37:102-107} and the\\n\\t\\t\\t\\tcorresponding notes); furthermore, they are a reminder\\n\\t\\t\\t\\tthat God is the Provider of all sustenance and the One\\n\\t\\t\\t\\twho gives life and deals death, and that all must return\\n\\t\\t\\t\\tto Him; and, lastly (as stressed by Razi), they are to be\\n\\t\\t\\t\\tsymbols of each believer’s readiness to sacrifice himself\\n\\t\\t\\t\\tin the cause of truth."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "29",
    "NoteID": "42",
    "Body": "In Tabari’s opinion, the phrase thumma ‘l-yaqda\\n\\t\\t\\t\\ttafathahum signifies \"then let them complete the acts of\\n\\t\\t\\t\\tworship (manasik) incumbent on them by virtue of their\\n\\t\\t\\t\\tpilgrimage\". Other commentators, however, understand by\\n\\t\\t\\t\\tthe (extremely rare) expression tafath the prohibition of\\n\\t\\t\\t\\tenjoying, while in the actual state of pilgrimage,\\n\\t\\t\\t\\tcertain bodily comforts like cutting or shaving one’s\\n\\t\\t\\t\\thair (see  2:196 ), wearing any clothing but the simple,\\n\\t\\t\\t\\tunsewn pilgrim’s garb (ihram), indulging in sexual\\n\\t\\t\\t\\tintercourse ( 2:197 ), etc. Consequently, they explain\\n\\t\\t\\t\\tthe above phrase as meaning \"let them bring to an end the\\n\\t\\t\\t\\t[condition of self-denial described as] tafath which was\\n\\t\\t\\t\\tincumbent on them during pilgrimage\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "29",
    "NoteID": "43",
    "Body": "I.e., around the Kaabah (see surah {2}, notes [102] and\\n\\t\\t\\t\\t[104]), thus completing the pilgrimage."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "30",
    "NoteID": "44",
    "Body": "See the first paragraph of  5:3 . Once again, the Qur’an\\n\\t\\t\\t\\tstresses the principle that everything that has not been\\n\\t\\t\\t\\texplicitly forbidden is per se lawful."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "30",
    "NoteID": "45",
    "Body": "The term awthan (lit., \"idols\") denotes not merely\\n\\t\\t\\t\\tactual, concrete images of false deities but also, in its\\n\\t\\t\\t\\twidest sense, everything that is associated with false\\n\\t\\t\\t\\tbeliefs and practices or with a tendency to \"worship\"\\n\\t\\t\\t\\tfalse values: hence the subsequent injunction to shun\\n\\t\\t\\t\\t\"every word that is untrue\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "31",
    "NoteID": "46",
    "Body": "For an explanation of the term hunafa’ (sing. hanif), see\\n\\t\\t\\t\\tnote [110] on  2:135 ."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "32",
    "NoteID": "47",
    "Body": "Lit., \"God’s symbols (sha'a'ir) - an expression which\\n\\t\\t\\t\\tin this context refers to the rites of pilgrimage (see\\n\\t\\t\\t\\tthe second half of note [4] on  5:2 ). This stress on the\\n\\t\\t\\t\\tsymbolic character of all the rites connected with the\\n\\t\\t\\t\\tpilgrimage is meant to draw the believer’s attention to\\n\\t\\t\\t\\tthe spiritual meaning of those rites, and thus to warn\\n\\t\\t\\t\\thim against making, unthinkingly, a sort of fetish of\\n\\t\\t\\t\\tthem. - The assumption of some of the commentators that\\n\\t\\t\\t\\tthe \"symbols\" referred to here relate specifically to the\\n\\t\\t\\t\\tsacrificial animals, resp. their sacrifice as such, is\\n\\t\\t\\t\\tnot warranted by the text. As Tabari explains in his\\n\\t\\t\\t\\tcommentary on this and the next verse, the term sha'a’ir\\n\\t\\t\\t\\tcomprises all the rites, actions and places connected\\n\\t\\t\\t\\twith the pilgrimage (all of which have a symbolic\\n\\t\\t\\t\\tmeaning), and cannot be restricted to any one of them."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "33",
    "NoteID": "48",
    "Body": "I.e., \"until the end of your lives\" (Baydawi)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "33",
    "NoteID": "49",
    "Body": "The noun mahill, derived from the verb halla (lit., \"he\\n\\t\\t\\t\\tuntied\" or \"undid\" [e.g., a knot]\", or \"he loosened [a\\n\\t\\t\\t\\tload]\", or \"he alighted\"), denotes primarily a\\n\\t\\t\\t\\t\"destination\", as well as \"the time or place at which an\\n\\t\\t\\t\\tobligation [e.g., a debt] falls due\" (Taj al-'Arus ). In\\n\\t\\t\\t\\tthe above context, in which this term obviously relates\\n\\t\\t\\t\\tto the \"God-consciousness\" (taqwa) unequivocally\\n\\t\\t\\t\\tmentioned in the preceding verse, it has the tropical\\n\\t\\t\\t\\tmeaning of \"goal and end\", implying that the realization\\n\\t\\t\\t\\tof God's oneness and uniqueness - symbolized by the\\n\\t\\t\\t\\tKa'bah (the \"Most Ancient Temple\") - is the goal and end\\n\\t\\t\\t\\tof all true God-consciousness."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "34",
    "NoteID": "50",
    "Body": "I.e., as a conscious, selfless offering in His name of\\n\\t\\t\\t\\tsomething that one cherishes as necessary and valuable,\\n\\t\\t\\t\\tand not as an attempt to \"propitiate\" Him who is far\\n\\t\\t\\t\\tabove anything that resembles human emotion. (See also\\n\\t\\t\\t\\tverse {36} below.)"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "35",
    "NoteID": "51",
    "Body": "See surah {2}, note [4]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "36",
    "NoteID": "52",
    "Body": "See note [47] above."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "36",
    "NoteID": "53",
    "Body": "Lit., \"of them\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "36",
    "NoteID": "54",
    "Body": "Lit., \"thus\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "36",
    "NoteID": "55",
    "Body": "I.e., the sacrificial animals."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "38",
    "NoteID": "56",
    "Body": "See surah {4}, note [134]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "39",
    "NoteID": "57",
    "Body": "Lit., \"inasmuch as they have been wronged\". Connecting\\n\\t\\t\\t\\twith the promise, in the preceding verse, that \"God will\\n\\t\\t\\t\\tward off [all evil] from those who attain to faith\", the\\n\\t\\t\\t\\tpresent verse enunciates the permission to fight\\n\\t\\t\\t\\tphysically in self-defence. All relevant Traditions\\n\\t\\t\\t\\t(quoted, in particular, by Tabari and Ibn Kathir) show\\n\\t\\t\\t\\tthat this is the earliest Qur'anic reference to the\\n\\t\\t\\t\\tproblem of war as such. According to Abd Allah ibn\\n\\t\\t\\t\\t'Abbas, it was revealed immediately after the Prophet\\n\\t\\t\\t\\tleft Mecca for Medina, i.e., at the beginning of the year\\n\\t\\t\\t\\t1 H. The principle of war in self-defence - and only in\\n\\t\\t\\t\\tself-defence - has been further elaborated in Al-Baqarah,\\n\\t\\t\\t\\twhich was revealed about a year later (see {2: 190-193}\\n\\t\\t\\t\\tand the corresponding notes)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "40",
    "NoteID": "58",
    "Body": "Lit., \"were it not that God repels some people by means\\n\\t\\t\\t\\tof others\" (cf. the identical phrase in the second\\n\\t\\t\\t\\tparagraph of {2: 251})."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "40",
    "NoteID": "59",
    "Body": "The implication is that the defence of religious freedom\\n\\t\\t\\t\\tis the foremost cause for which arms may - and, indeed,\\n\\t\\t\\t\\tmust - be taken up (see  2:193  and the corresponding\\n\\t\\t\\t\\tnote [170]), or else, as stressed in the concluding\\n\\t\\t\\t\\tclause of  2:251 , \"corruption would surely overwhelm the\\n\\t\\t\\t\\tearth\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "44",
    "NoteID": "60",
    "Body": "I.e., not by his own people, since these, despite their\\n\\t\\t\\t\\tsinning, had accepted him as God's prophet (Tabari).\\n\\t\\t\\t\\tReferences to the tribes of 'Ad and Thamud and the people\\n\\t\\t\\t\\tof Madyan are given in surah {7}, notes [48], [56] and\\n\\t\\t\\t\\t[67]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "46",
    "NoteID": "61",
    "Body": "Lit., \"whereupon they would have hearts wherewith they\\n\\t\\t\\t\\tmight understand, or ears whereby they might hear\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "47",
    "NoteID": "62",
    "Body": "For an explanation, see  6:57 ,  8:32  and  13:6 , as\\n\\t\\t\\t\\twell as the corresponding notes."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "47",
    "NoteID": "63",
    "Body": "I.e., what men conceive of as \"time\" has no meaning with\\n\\t\\t\\t\\tregard to God, because He is timeless, without beginning\\n\\t\\t\\t\\tand without end, so that \"in relation to Him, one day and\\n\\t\\t\\t\\ta thousand years are alike\" (Razi). Cf.  70:4 , where in\\n\\t\\t\\t\\tthe same sense, a \"day\" is said to be equal to \"fifty\\n\\t\\t\\t\\tthousand years\", or the well-authenticated saying of the\\n\\t\\t\\t\\tProphet' \"God says, 'I am Time Absolute (ad-dahr)'.\""
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "50",
    "NoteID": "64",
    "Body": "See  8:4  and the corresponding note [5]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "52",
    "NoteID": "65",
    "Body": "Lit., \"We never sent any apostle or prophet before thee\\n\\t\\t\\t\\twithout that, when he was hoping (tamanna)...\", etc.\\n\\t\\t\\t\\tAccording to most of the commentators, the designation\\n\\t\\t\\t\\t\"apostle\" (rasul) is applied to bearers of divine\\n\\t\\t\\t\\trevelations which comprise a new doctrinal system or\\n\\t\\t\\t\\tdispensation; a \"prophet\" (nabi), on the other hand, is\\n\\t\\t\\t\\tsaid to be one whom God has entrusted with the\\n\\t\\t\\t\\tenunciation of ethical principles on the basis of an\\n\\t\\t\\t\\talready-existing dispensation, or of principles common to\\n\\t\\t\\t\\tall divine dispensations.  Hence, every apostle is a\\n\\t\\t\\t\\tprophet as well, but not every prophet is an apostle."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "52",
    "NoteID": "66",
    "Body": "I.e., insinuating that the innermost aim (umniyyah, lit.,\\n\\t\\t\\t\\t\"longing\" or \"hope\") of the message-bearer in question\\n\\t\\t\\t\\twas not the spiritual improvement of his community but,\\n\\t\\t\\t\\trather, the attainment of personal power and influence:\\n\\t\\t\\t\\tcf.  6:112 -\"against every prophet We have set up as\\n\\t\\t\\t\\tenemies the evil forces (shayatin) from among humans as\\n\\t\\t\\t\\twell as from among invisible beings (al-jinn)\" - a\\n\\t\\t\\t\\tstatement which is explained in surah {6}, note [98]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "52",
    "NoteID": "67",
    "Body": "Lit., \"and God makes His messages clear in and by\\n\\t\\t\\t\\tthemselves\". This is the meaning of the phrase yuhkimu\\n\\t\\t\\t\\tayatahu (cf. the expression uhkimat ayatuhu in  11:1 ):\\n\\t\\t\\t\\ti.e., God causes His messages to speak for themselves, so\\n\\t\\t\\t\\tthat any insinuation as to the prophet's \"hidden motives\"\\n\\t\\t\\t\\tis automatically disproved. The conjunction thumma at the\\n\\t\\t\\t\\tbeginning of this clause does not connote a sequence in\\n\\t\\t\\t\\ttime but a coordination of activities, and is best\\n\\t\\t\\t\\trendered by the simple conjunction \"and\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "53",
    "NoteID": "68",
    "Body": "See  2:10  and the corresponding note."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "53",
    "NoteID": "69",
    "Body": "Lit., \"all [such] evildoers\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "55",
    "NoteID": "70",
    "Body": "Lit., \"or [until] there comes upon them the chastisement\\n\\t\\t\\t\\t[or \"suffering] of a barren Day\", i.e., the Day of\\n\\t\\t\\t\\tJudgment, which will offer no hope to those who, until\\n\\t\\t\\t\\ttheir death, failed to realize the existence of God or to\\n\\t\\t\\t\\tsubmit to His guidance."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "58",
    "NoteID": "71",
    "Body": "For this rendering of the phrase alladhina hajaru, see\\n\\t\\t\\t\\tnote [203] on  2:218 . The subsequent mention of \"those\\n\\t\\t\\t\\twho strive in God's cause, and then are slain or die\"\\n\\t\\t\\t\\tconnects with the reference, in verses {39-40}, to God's\\n\\t\\t\\t\\tpermission to the believers to fight in defence of their\\n\\t\\t\\t\\tfaith and liberty. The extreme merit of the\\n\\t\\t\\t\\tself-sacrifice involved is stressed in several Qur'anic\\n\\t\\t\\t\\tpassages, and particularly in {4:95-96}; hence, it has\\n\\t\\t\\t\\talso a bearing on the Day of Judgement spoken of in the\\n\\t\\t\\t\\tpreceding passage."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "59",
    "NoteID": "72",
    "Body": "Or: \"cause them to enter [upon their life after death] in\\n\\t\\t\\t\\ta manner that will please them well\" (cf. note [40] on\\n\\t\\t\\t\\tthe last clause of  4:31 ) - thus implying that by\\n\\t\\t\\t\\tsacrificing their lives in God’s cause they will have\\n\\t\\t\\t\\tobtained His forgiveness of whatever sins they may have\\n\\t\\t\\t\\tpreviously committed."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "60",
    "NoteID": "73",
    "Body": "Lit., \"who has retaliated with the like of what he had\\n\\t\\t\\t\\tbeen afflicted with\" - i.e., has acted only in\\n\\t\\t\\t\\tself-defence and done to his enemy no more than the enemy\\n\\t\\t\\t\\thad done to him. (A similar phrase, relating to\\n\\t\\t\\t\\tretaliation in argument, is found in  16:126  and\\n\\t\\t\\t\\texplained in the corresponding note [150].)"
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "60",
    "NoteID": "74",
    "Body": "While the opening sentence of this verse stresses the\\n\\t\\t\\t\\tprinciple of self-defence as the only justification of\\n\\t\\t\\t\\twar (cf.  2:190  and {192-193}) - with the proviso that\\n\\t\\t\\t\\tretaliation must not exceed the injury initially suffered\\n\\t\\t\\t\\t- the concluding part of the verse implies that in case\\n\\t\\t\\t\\tof repeated, unprovoked aggression the believers are\\n\\t\\t\\t\\tallowed to wage an all-out war with a view to destroying\\n\\t\\t\\t\\tcompletely the enemy's military power. Since such an\\n\\t\\t\\t\\tall-out war might seem to conflict with the principle of\\n\\t\\t\\t\\tlimited retaliation alluded to above, the Qur'an states\\n\\t\\t\\t\\tthat God absolves the believers of what otherwise might\\n\\t\\t\\t\\thave been a sin, since it is they \"against whom war is\\n\\t\\t\\t\\tbeing wrongfully waged\" (verse {39}) by repeated acts of\\n\\t\\t\\t\\taggression."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "61",
    "NoteID": "75",
    "Body": "Sc., \"and therefore has the power to succour the\\n\\t\\t\\t\\tbelievers who have been wronged\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "61",
    "NoteID": "76",
    "Body": "I.e., it is He who knows what is in the hearts of men,\\n\\t\\t\\t\\tand nevertheless, in His unfathomable wisdom, allows the\\n\\t\\t\\t\\tdarkness of oppression to grow at the expense of the\\n\\t\\t\\t\\tlight of freedom, and then causes the light to overcome\\n\\t\\t\\t\\tthe darkness: an eternal, cyclical recurrence which\\n\\t\\t\\t\\tdominates the life of mankind. (As Ibn Kathir points out,\\n\\t\\t\\t\\tthe above passage contains a direct allusion to\\n\\t\\t\\t\\t{3:26-27}-\"Say: O God, Lord of all dominion! Thou\\n\\t\\t\\t\\tgrantest dominion unto whom Thou willest, and takest away\\n\\t\\t\\t\\tdominion from whom Thou willest.... Thou hast the power\\n\\t\\t\\t\\tto will anything: Thou makest the night grow longer by\\n\\t\\t\\t\\tshortening the day, and Thou makest the day grow longer\\n\\t\\t\\t\\tby shortening the night....\""
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "62",
    "NoteID": "77",
    "Body": "See surah {20}, note [99]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "63",
    "NoteID": "78",
    "Body": "For an explanation of the term latif (\"unfathomable\"),\\n\\t\\t\\t\\tsee surah {6}, note [89]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "65",
    "NoteID": "79",
    "Body": "I.e., \"has enabled you to benefit from all. . .\", etc.\\n\\t\\t\\t\\t(cf. surah {14}, note [46])."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "65",
    "NoteID": "80",
    "Body": "Lit., \"the sky\" - used here as a metonym for the stars\\n\\t\\t\\t\\tand planets, which are held on their courses by the\\n\\t\\t\\t\\tGod-willed laws of cosmic movement (Maraghi XVII, 137)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "65",
    "NoteID": "81",
    "Body": "I.e., at the Last Hour, which - as the Qur'an so often\\n\\t\\t\\t\\tstates - will manifest itself in universal cosmic\\n\\t\\t\\t\\tcatastrophe."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "67",
    "NoteID": "82",
    "Body": "Lit., \"a way of worship\" (mansak, which sometimes denotes\\n\\t\\t\\t\\talso \"an act of worship\"). For a fuller explanation of\\n\\t\\t\\t\\tthis passage, see the second paragraph of  5:48 -\"Unto\\n\\t\\t\\t\\tevery one of you have We appointed a [different] law and\\n\\t\\t\\t\\tway of life\" - and the corresponding notes [66-68]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "67",
    "NoteID": "83",
    "Body": "I.e., do not allow thyself to be drawn into disputes\"\\n\\t\\t\\t\\t(Zamakhshari and Baghawi)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "68",
    "NoteID": "84",
    "Body": "Cf.  10:41  -\"To me [shall be accounted] my doings, and\\n\\t\\t\\t\\tto you, your doings: you are not accountable for what I\\n\\t\\t\\t\\tam doing, and I am not accountable for whatever you do\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "69",
    "NoteID": "85",
    "Body": "See surah {2}, note [94]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "71",
    "NoteID": "86",
    "Body": "I.e., despite their awareness that God alone knows all\\n\\t\\t\\t\\tand is, therefore, unique in His all-embracing Presence."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "71",
    "NoteID": "87",
    "Body": "See surah {3}, note [106]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "71",
    "NoteID": "88",
    "Body": "I.e., through independent reasoning or observation."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "72",
    "NoteID": "89",
    "Body": "Lit., \"worse than this\" - i.e., \"more painful than the\\n\\t\\t\\t\\trepugnance which you feel with regard to God's messages\"."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "75",
    "NoteID": "90",
    "Body": "I.e., the prophets and the angels are but created beings\\n\\t\\t\\t\\thaving no share whatever in His omniscience and, hence,\\n\\t\\t\\t\\tno claim to being worshipped."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "76",
    "NoteID": "91",
    "Body": "For an explanation of this rendering of the phrase ma\\n\\t\\t\\t\\tbayna aydihim wa-ma khalfahum, see surah {2}, note [247]."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "78",
    "NoteID": "92",
    "Body": "The absence of any \"hardship\" in the religion of Islam is\\n\\t\\t\\t\\tdue to several factors: (1) it is free of any dogma or\\n\\t\\t\\t\\tmystical proposition which might make the Qur'anic\\n\\t\\t\\t\\tdoctrine difficult to understand or might even conflict\\n\\t\\t\\t\\twith man's innate reason; (2) it avoids all complicated\\n\\t\\t\\t\\tritual or system of taboos which would impose undue\\n\\t\\t\\t\\trestrictions on man's everyday life; (3) it rejects all\\n\\t\\t\\t\\tself-mortification and exaggerated asceticism, which must\\n\\t\\t\\t\\tunavoidably conflict with man's true nature (cf. in this\\n\\t\\t\\t\\tconnection note [118] on the first sentence of  2:143 );\\n\\t\\t\\t\\tand (4) it takes fully into account the fact that \"man\\n\\t\\t\\t\\thas been created weak\" ( 4:28 )."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "78",
    "NoteID": "93",
    "Body": "Abraham is designated here as \"your forefather\" not only\\n\\t\\t\\t\\tbecause he was, in fact, an ancestor of the Prophet\\n\\t\\t\\t\\tMuhammad - to whose followers this passage is addressed -\\n\\t\\t\\t\\tbut also because he is the prototype (and thus, the\\n\\t\\t\\t\\tspiritual \"forefather\") of all who consciously \"surrender\\n\\t\\t\\t\\tthemselves to God\" (see next note)."
  },
  {
    "SurahNumber": "22",
    "AyahNumber": "78",
    "NoteID": "94",
    "Body": "The term muslim signifies \"one who surrenders himself to\\n\\t\\t\\t\\tGod\"; correspondingly, islam denotes \"self-surrender to\\n\\t\\t\\t\\tGod\". Both these terms are applied in the Qur'an to all\\n\\t\\t\\t\\twho believe in the One God and affirm this belief by an\\n\\t\\t\\t\\tunequivocal acceptance of His revealed messages. Since\\n\\t\\t\\t\\tthe Qur'an represents the final and most universal of\\n\\t\\t\\t\\tthese divine revelations, the believers are called upon,\\n\\t\\t\\t\\tin the sequence, to follow the guidance of its Apostle\\n\\t\\t\\t\\tand thus to become an example for all mankind (cf.\\n\\t\\t\\t\\t 2:143  and the corresponding note [119])."
  }
]
