[
  {
    "SurahNumber": "79",
    "AyahNumber": "1",
    "NoteID": "5916",
    "Body": "The beginning of this Sura may be compared with the\\n\\t\\t\\t\\tbeginning of S. lxxvii. A translator's task in such\\n\\t\\t\\t\\tpassages is extremely difficult. He has to contend, again\\n\\t\\t\\t\\tand again, with verities of a realm beyond man's normal\\n\\t\\t\\t\\trange of experience expressed in elliptical language and\\n\\t\\t\\t\\the has to render them in another language with words of\\n\\t\\t\\t\\tprecision intelligible to readers. It is therefore\\n\\t\\t\\t\\tnecessary for him to put in part of the Commentary in the\\n\\t\\t\\t\\tTranslation in such cases. The evidence of five things is\\n\\t\\t\\t\\there invoked in verses 1-5, in order to lead to the\\n\\t\\t\\t\\tconclusion in verse 6 and those following. Or, if we\\n\\t\\t\\t\\ttreat verses 3-5 as three stages of the same thing, there\\n\\t\\t\\t\\tare three things to be considered in five stages. What\\n\\t\\t\\t\\tare they? And what is the conclusion? See the following\\n\\t\\t\\t\\tnotes."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "1",
    "NoteID": "5917",
    "Body": "'There is much difference of opinion among the\\n\\t\\t\\t\\tCommentators as to the five things or beings mentioned in\\n\\t\\t\\t\\tthese verses. I follow the general opinion in my\\n\\t\\t\\t\\tinterpretation, which is that angels are referred to as\\n\\t\\t\\t\\tthe agency which in their dealings with mankind show\\n\\t\\t\\t\\tclearly Allah's Justice, Power, and Mercy, which again\\n\\t\\t\\t\\tpoint to the Judgment to come, as a certainty which none\\n\\t\\t\\t\\tcan evade. The first point, referred to in this verse, is\\n\\t\\t\\t\\tthat the souls of the wicked are loath to part with their\\n\\t\\t\\t\\tmaterial body at death, but their will will not count:\\n\\t\\t\\t\\ttheir souls will be wrenched out into another world. Who\\n\\t\\t\\t\\twill then deny Resurrection and Judgment?"
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "2",
    "NoteID": "5918",
    "Body": "The second point is that in contrast with the wicked, the\\n\\t\\t\\t\\tsouls of the blessed will be drawn out gently to their\\n\\t\\t\\t\\tnew fife. They will be ready for it. In fact death for\\n\\t\\t\\t\\tthem will be a realease from the grosser incidents of\\n\\t\\t\\t\\tbodily sense. To them the approach of Judgment will be\\n\\t\\t\\t\\twelcome."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "3",
    "NoteID": "5919",
    "Body": "At all times there are errands of mercy and blessing and\\n\\t\\t\\t\\terrands of justice, which the angels are prompt to\\n\\t\\t\\t\\texecute by order of Allah. There are three features of\\n\\t\\t\\t\\tthis, thus giving the third, fourth, and fifth points.\\n\\t\\t\\t\\t(3) Their movement is compared to that of gliding or\\n\\t\\t\\t\\tswimming (sabhan). In xxi. 33 this verb is applied to the\\n\\t\\t\\t\\tmotion of the celestial bodies: they all \"swim along,\\n\\t\\t\\t\\teach in its rounded course\". Cf. Shakespeare, Merchant of\\n\\t\\t\\t\\tVenice: \"There's not an orb which thou behold'st, But in\\n\\t\\t\\t\\this motion like an angel sings, Still quiring to the\\n\\t\\t\\t\\tyoung-eyed cherubims\". (4) In hurrying on their errands\\n\\t\\t\\t\\tthe angels press forth as in a race. (5) And thus they\\n\\t\\t\\t\\tpromptly execute the orders of their Lord."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "6",
    "NoteID": "5920",
    "Body": "The evidence of the wonderful working of the angels\\n\\t\\t\\t\\thaving been invoked in the first five verses, the\\n\\t\\t\\t\\tconclusion is now drawn and stated. It is certain that\\n\\t\\t\\t\\tone great Day, the whole world as we now see it in our\\n\\t\\t\\t\\tlower life will be in violent revolution. It will be like\\n\\t\\t\\t\\tan earthquake destroying all land-marks. But that will\\n\\t\\t\\t\\taffect only things subject to change: they will suffer\\n\\t\\t\\t\\tviolent convulsions as a preliminary to their\\n\\t\\t\\t\\tdisappearance. But Allah and His divine order will not\\n\\t\\t\\t\\tchange: His \"Face\" abideth for ever, full of Majesty,\\n\\t\\t\\t\\tBounty, and Honour (lv. 27)."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "7",
    "NoteID": "5921",
    "Body": "The Commotion will be repeated again and again in the\\n\\t\\t\\t\\ttransitory world, to make way for the new world that will\\n\\t\\t\\t\\tthen come into being."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "8",
    "NoteID": "5922",
    "Body": "All hearts will be in agitation: those of the blessed\\n\\t\\t\\t\\tones to see the beginning of the fulfilment of their\\n\\t\\t\\t\\tLord's Promise; those of the Rejecters of Allah for fear\\n\\t\\t\\t\\tof His just Judgement."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "9",
    "NoteID": "5923",
    "Body": "Similarly all eyes will be cast down: those of the\\n\\t\\t\\t\\tblessed ones in humble modesty, and those of the\\n\\t\\t\\t\\tRejecters of Allah, in utter humiliation, sorrow, and\\n\\t\\t\\t\\tshame, for their arrogance and insolence in their\\n\\t\\t\\t\\tprobationary life."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "10",
    "NoteID": "5924",
    "Body": "The Unbelievers say now, in their arrogance, insolence,\\n\\t\\t\\t\\tand mocking defiance: \"Surely death here is the end of\\n\\t\\t\\t\\tall things! When we are dead and buried, and our bones\\n\\t\\t\\t\\tare rotten, how can we be restored again?\" They add, \"If\\n\\t\\t\\t\\tthat were so, then we should indeed be in a turn of\\n\\t\\t\\t\\tdreadful luck! Instead of gaining by the Resurrection, we\\n\\t\\t\\t\\tshould be in terrible loss (with our rotten bones)!\" They\\n\\t\\t\\t\\tmean this in biting mockery. But there will indeed be an\\n\\t\\t\\t\\tAccount taken, and they will indeed be in a terrible\\n\\t\\t\\t\\tloss, for they will go to perdition!"
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "13",
    "NoteID": "5925",
    "Body": "Judgment will be insugurated with a single compelling\\n\\t\\t\\t\\tCry. Cf. xxxvii. 19. See also xxxvi. 29 and 49, where the\\n\\t\\t\\t\\tsingle mightly Blast seems to refer to the sinners being\\n\\t\\t\\t\\tcut off in this life and plunged into the other world\\n\\t\\t\\t\\twhere they will be further judged, and xxxvi. 53, where\\n\\t\\t\\t\\tthe final Judgment is referred to."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "14",
    "NoteID": "5926",
    "Body": "They will have been more or less dormant before the Great\\n\\t\\t\\t\\tJudgment, as contrasted with the Lesser Judgment (n. 5914\\n\\t\\t\\t\\tto lxxviii. 40, and n. 5822 to lxxv. 22). When the\\n\\t\\t\\t\\tresurrection comes, they will come fully into the new\\n\\t\\t\\t\\tworld, the old heaven and earth having then completely\\n\\t\\t\\t\\tpassed away, not only for them but absolutely."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "15",
    "NoteID": "5927",
    "Body": "This is just a reference to the story of Moses told more\\n\\t\\t\\t\\tfully in S. xx. 9-76. The lessons drawn are: (1) That\\n\\t\\t\\t\\teven to an arrogant blasphemer and rebel against Allah's\\n\\t\\t\\t\\tLaw, like Pharaoh, Allah's grace was offered through a\\n\\t\\t\\t\\tmajor Prophet Moses; (2) that this rejection brought\\n\\t\\t\\t\\tabout his signal downfall even in this world; and (3)\\n\\t\\t\\t\\tthat his humiliation and punishment will be completed in\\n\\t\\t\\t\\tthe Hereafter at Judgment."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "16",
    "NoteID": "5928",
    "Body": "Cf. xx. 12."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "17",
    "NoteID": "5929",
    "Body": "Cf. xx. 24."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "19",
    "NoteID": "5930",
    "Body": "Even for such a one as Pharaoh, intoxicated with his own\\n\\t\\t\\t\\tpower and greatness, guidance and grace were offered\\n\\t\\t\\t\\tthrough Moses."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "20",
    "NoteID": "5931",
    "Body": "What was the Great Sign? Some Commentators understand by\\n\\t\\t\\t\\tit the \"White Shining Hand\": see n. 2550 to xx. 22-23.\\n\\t\\t\\t\\tOthers think it was the miracle of the rod that became a\\n\\t\\t\\t\\t\"snake active in motion\": see xx. 20, n. 2549. These were\\n\\t\\t\\t\\tamong the Greater Signs: xx. 23. In xvii. 101 there is a\\n\\t\\t\\t\\treference to nine Clear Signs given to Moses, and these\\n\\t\\t\\t\\tare specified in detail in n. 1091 to vii. 133. The fact\\n\\t\\t\\t\\tis, there were many Signs given, \"openly self-explained,\"\\n\\t\\t\\t\\tbut Pharaoh and his men \"were steeped in arrogance,-a\\n\\t\\t\\t\\tpeople given to sin\" (vii. 133). The preeminently Great\\n\\t\\t\\t\\tSign was therefore the fact of Moses being sent to\\n\\t\\t\\t\\tPharaoh, which subsequently converted the magicians and\\n\\t\\t\\t\\tthe more learned Egyptians to the true God (xx. 70-73),\\n\\t\\t\\t\\tthough Pharaoh and his Chiefs resisted and suffered for\\n\\t\\t\\t\\ttheir sins."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "25",
    "NoteID": "5932",
    "Body": "See xx. 78-79, also vii. 135-137."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "26",
    "NoteID": "5933",
    "Body": "Cf. xxiv. 44."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "27",
    "NoteID": "5934",
    "Body": "If man grows arrogant or forgets his accountability to\\n\\t\\t\\t\\tAllah, in his ignorance or thoughtlessness, he is\\n\\t\\t\\t\\treminded that he is only an insignificant speck in\\n\\t\\t\\t\\tAllah's spacious Creation. All the excellence that man\\n\\t\\t\\t\\tacquires is the gift of Allah. Who has bestowed on him a\\n\\t\\t\\t\\thigh Destiny if he fulfils the purpose of his creation:\\n\\t\\t\\t\\tii. 30-39. Then follows a nature passage, pointing to the\\n\\t\\t\\t\\tglory of the heavens and the earth, and how they are both\\n\\t\\t\\t\\tmade to subserve the life of man."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "28",
    "NoteID": "5935",
    "Body": "Cf. ii. 29. The mystery of the heavens with their\\n\\t\\t\\t\\tcountless stars and the planets obeying the laws of\\n\\t\\t\\t\\tmotion, and the sun and moon influencing the temperature\\n\\t\\t\\t\\tand climates of the earth from thousands or millions of\\n\\t\\t\\t\\tmiles, illustrate the order and perfection which Allah\\n\\t\\t\\t\\thas given to His Creation. Can man then remain exempt\\n\\t\\t\\t\\tfrom his responsibility for his deeds, endowed as he is\\n\\t\\t\\t\\twith a will, or deny the Day of Sorting Out, which is the\\n\\t\\t\\t\\tDay of Judgment?"
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "29",
    "NoteID": "5936",
    "Body": "Its of course refers to the starry heaven. Both the Night\\n\\t\\t\\t\\tand the Day have each its own beauty and its utility for\\n\\t\\t\\t\\tman, as has been frequently pointed out in the Qur-an.\\n\\t\\t\\t\\tThe night is a period of darkness, but it has also its\\n\\t\\t\\t\\tsplendours of light in the moon, or the planets Jupiter\\n\\t\\t\\t\\tor Venus, or stars like Sirius or the Milky Way. These\\n\\t\\t\\t\\tcountless lights of night have their own beauty, and by\\n\\t\\t\\t\\tday there is the splendour of the sun for us, which in\\n\\t\\t\\t\\tCreation as a whole, is just one of countless stars."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "30",
    "NoteID": "5937",
    "Body": "Moreover: or, more literally, after that. See n. 4475 to\\n\\t\\t\\t\\txli. 11."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "31",
    "NoteID": "5938",
    "Body": "The underground springs and wells of water as well as\\n\\t\\t\\t\\trivers and glaciers in northren climates are due to the\\n\\t\\t\\t\\tdifferent levels of highlands not lowlands. They spread\\n\\t\\t\\t\\tthe moisture evenly as wanted, and give corn, fruits, and\\n\\t\\t\\t\\tvegetables to man, and pastures and feeding grounds to\\n\\t\\t\\t\\tbeasts of the fields. For the wonderful circuit or cycle\\n\\t\\t\\t\\tof water between heaven and earth, see notes 3106 (xxv.\\n\\t\\t\\t\\t49) and 3111 (xxv. 53)."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "32",
    "NoteID": "5939",
    "Body": "See n. 2038 to xvi. 15. The \"eternal hills\" are the main\\n\\t\\t\\t\\treservoirs for the storage and gradual distribution of\\n\\t\\t\\t\\twater, the very basis of the life of man and beast."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "33",
    "NoteID": "5940",
    "Body": "This clause I construe to apply to verses 30, 31, and 32\\n\\t\\t\\t\\tabove. Everything on earth has, by Allah's bountiful\\n\\t\\t\\t\\tprovidence, been arranged to subserve the use and\\n\\t\\t\\t\\tconvenience of man and the lower life which depends upon\\n\\t\\t\\t\\thim. The intermediary between Allah's providence and the\\n\\t\\t\\t\\tactual use made of Allah's other gifts is man's own\\n\\t\\t\\t\\tintelligence and initiative, which are also gifts of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "34",
    "NoteID": "5941",
    "Body": "The Judgment, the time for sorting out all things\\n\\t\\t\\t\\taccording to their true, intrinsic, and eternal values."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "35",
    "NoteID": "5942",
    "Body": "The Judgment will be not only for his acts but for his\\n\\t\\t\\t\\tmotives, \"all he strove for\". In this life he may forget\\n\\t\\t\\t\\this ill-deeds, but in the new conditions he will not only\\n\\t\\t\\t\\tremember them, but the Fire of Punishment will be plainly\\n\\t\\t\\t\\tvisible to him, and not only to him, but it will be \"for\\n\\t\\t\\t\\tall to see\". This will add to the sinner's humiliation."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "36",
    "NoteID": "5943",
    "Body": "Cf. xxvi. 91."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "38",
    "NoteID": "5944",
    "Body": "The abiding Punishment will be for those who had wilfully\\n\\t\\t\\t\\tand persistently rebelled against Allah, \"transgressing\\n\\t\\t\\t\\tall bounds\", and had given themselves up to the vanities\\n\\t\\t\\t\\tand lusts of this lower life. This Punishment will not\\n\\t\\t\\t\\ttouch those who had repented and been forgiven, nor those\\n\\t\\t\\t\\tguilty, through human frailty, of minor sing, whose deeds\\n\\t\\t\\t\\twill be weighed in the balance against their good deeds:\\n\\t\\t\\t\\tci. 6-9."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "42",
    "NoteID": "5946",
    "Body": "Cf vii. 187 and n. 1159. Only Allah can reveal it. But\\n\\t\\t\\t\\twere it known, \"heavy were its burden through the heavens\\n\\t\\t\\t\\tand the earth\"."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "44",
    "NoteID": "5947",
    "Body": "Our time has no sort of comparison with the timeless\\n\\t\\t\\t\\tstate in the new spiritual World in which the final\\n\\t\\t\\t\\tJudgment will take place. Nor can its limits-how long it\\n\\t\\t\\t\\twill last-be set except in the Will of Almighty Allah.\\n\\t\\t\\t\\tLord of Supreme Wisdom, Justice, and Goodness: xi.\\n\\t\\t\\t\\t107-108. But it is near, in the sense explained in n.\\n\\t\\t\\t\\t5914 to lxxviii. 40."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "45",
    "NoteID": "5948",
    "Body": "The warning is only effective for those who believe in\\n\\t\\t\\t\\tAllah and in the Final Account. Such men immediately turn\\n\\t\\t\\t\\tin repentance to Allah, and it is to lead such men and\\n\\t\\t\\t\\thelp them, that Prophets are sent."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "46",
    "NoteID": "5949",
    "Body": "Cf. x. 45, where the expression used is: \"it will be as\\n\\t\\t\\t\\tif they had tarried but an hour of a day.\" Here the\\n\\t\\t\\t\\tmetaphor used is \"a single evening, or, at most, till the\\n\\t\\t\\t\\tfollowing morn\". Death is like sleep, and may be compared\\n\\t\\t\\t\\tto the evening of life. In sleep we do not know how the\\n\\t\\t\\t\\ttime passes. When we wake up from the sleep of Death at\\n\\t\\t\\t\\tthe Resurrection, we shall not know whether it was the\\n\\t\\t\\t\\tfollowing moment or the following hour after we slept,\\n\\t\\t\\t\\tbut we shall feel that it is morning, for we shall be\\n\\t\\t\\t\\tconscious of all that goes on, as one awakened in the\\n\\t\\t\\t\\tmorning."
  },
  {
    "SurahNumber": "79",
    "AyahNumber": "40",
    "NoteID": "5995",
    "Body": "It is not meant for one class or race; it is universal,\\n\\t\\t\\t\\tand is addressed to all the Worlds. For the meaning of\\n\\t\\t\\t\\t\"Worlds\", see n. 20 to i. 2."
  }
]
