[
  {
    "SurahNumber": "31",
    "AyahNumber": "1",
    "NoteID": "3579",
    "Body": "See n. 25 to ii. 1 and Introduction to S. xxx."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "2",
    "NoteID": "3580",
    "Body": "This Sura relates to Wisdom, and the Qur-an is\\n\\t\\t\\t\\tappropriately called the Wise Book, or the Book of\\n\\t\\t\\t\\tWisdom. In verse 12 below there is a reference to Luqman\\n\\t\\t\\t\\tthe Wise. \"Wise\" in this sense (Hakim) means not only a\\n\\t\\t\\t\\tman versed in knowledge human and divine, but one\\n\\t\\t\\t\\tcarrying out in practical conduct ('amal) the right\\n\\t\\t\\t\\tcourse in life to the utmost of his power. His knowledge\\n\\t\\t\\t\\tis correct and practical, but not necessarily complete:\\n\\t\\t\\t\\tfor no man is perfect. Such an ideal involves the\\n\\t\\t\\t\\tconception of a man of heroic action as well as of deep\\n\\t\\t\\t\\tand workman-like knowledge of nature and human\\n\\t\\t\\t\\tnature,-not merely dreams or speculation. That ideal was\\n\\t\\t\\t\\tfulfilled in a most remarkable degree in the holy\\n\\t\\t\\t\\tProphet, and in the sacred Book which was revealed\\n\\t\\t\\t\\tthrough him. \"The Wise Book\" (Kilab-ul-hakim) is one of\\n\\t\\t\\t\\tthe titles of the Qur-an."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "3",
    "NoteID": "3581",
    "Body": "A guide to all, and, to those who accept its guidance, a\\n\\t\\t\\t\\tsource of mercy as leading them to Salvation."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "4",
    "NoteID": "3582",
    "Body": "The righteous are distinguished here by three marks,\\n\\t\\t\\t\\twhich are summed up in the phrase \"doers of good\", viz.:\\n\\t\\t\\t\\t(1) they yearn towards Allah in duty, love, and prayer,\\n\\t\\t\\t\\t(2) they love and serve their fellow-men in charity, (3)\\n\\t\\t\\t\\tthey win peace and rest for themselves in the assured\\n\\t\\t\\t\\thope of the Future."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "5",
    "NoteID": "3583",
    "Body": "They get these blessings because they submit their will\\n\\t\\t\\t\\tto Allah's Will and receive His guidance. They will do\\n\\t\\t\\t\\twell in this life (from the highest standpoint) and they\\n\\t\\t\\t\\twill reach their true Goal in the Future."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "6",
    "NoteID": "3584",
    "Body": "Life is taken seriously by men who realize the issues\\n\\t\\t\\t\\tthat hang upon it. But there are men of a frivolous turn\\n\\t\\t\\t\\tof mind who prefer idle tales to true Realities and they\\n\\t\\t\\t\\tare justly rebuked here. In the time of the holy Prophet\\n\\t\\t\\t\\tthere was a pagan Nadhr ibn al-Harith who preferred\\n\\t\\t\\t\\tPersian romances to the Message of Allah, and turned away\\n\\t\\t\\t\\tignorant men from the preaching of Allah's Word."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "7",
    "NoteID": "3585",
    "Body": "Such men behave as if they had heard nothing of serious\\n\\t\\t\\t\\timport, or laugh at serious teaching. The loss will be\\n\\t\\t\\t\\ttheir own. They will miss the higher things of life and\\n\\t\\t\\t\\tbe left out of Allah's blessings. Ignorance and arrogance\\n\\t\\t\\t\\tare in most cases the causes of their fall."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "9",
    "NoteID": "3586",
    "Body": "He is Exalted in power, and can carry out His Will, and\\n\\t\\t\\t\\tnothing can stop the carrying out of His promise. He is\\n\\t\\t\\t\\talso infinitely Wise: His promise is therefore full of\\n\\t\\t\\t\\tmeaning: it is not merely without purpose: it has a place\\n\\t\\t\\t\\tin the Universal Plan."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "10",
    "NoteID": "3587",
    "Body": "Cf. xiii. 2 and n. 1800."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "10",
    "NoteID": "3588",
    "Body": "Cf. xvi. 15 and n. 2038."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "10",
    "NoteID": "3589",
    "Body": "Cf. ii. 164 and n. 166."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "10",
    "NoteID": "3590",
    "Body": "Note the change of the pronoun at this stage in the\\n\\t\\t\\t\\tverse. Before this, Allah was spoken of in the third\\n\\t\\t\\t\\tperson, \"He\", and the acts of Creation referred to were\\n\\t\\t\\t\\tacts that in the main were completed when the universe as\\n\\t\\t\\t\\twe see it came into being, though its slow age-long\\n\\t\\t\\t\\tevolution continues. After this, Allah speaks in the\\n\\t\\t\\t\\tfirst person \"We\", the plural of honor, as explained\\n\\t\\t\\t\\tbefore (see n. 56 to ii. 38); and the processes spoken of\\n\\t\\t\\t\\tare those that go on continually before us, as in the\\n\\t\\t\\t\\tcase of rain and the growth of the vegetable kingdom. In\\n\\t\\t\\t\\tsome way the creation of the heavens and the earth and\\n\\t\\t\\t\\tanimal life on it may be considered impersonal to man,\\n\\t\\t\\t\\twhile the processes of rain and vegetation may be\\n\\t\\t\\t\\tconsidered in special personal relationship to him."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "10",
    "NoteID": "3591",
    "Body": "I think that sex life in plants is referred to, as in\\n\\t\\t\\t\\txiii. 3, where see n. 1804, though the pairs here may\\n\\t\\t\\t\\trefer to animals also. \"Noble\" (karim) may refer to the\\n\\t\\t\\t\\tmore beneficent plants and trees (and animals), which\\n\\t\\t\\t\\tAllah has created for man's use."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "11",
    "NoteID": "3592",
    "Body": "The transition from \"We\" in the last verse to \"Me\" in\\n\\t\\t\\t\\tthis verse means a still more personal relation to\\n\\t\\t\\t\\tAllah:(see n. 56 to ii. 38): as we are now asked about\\n\\t\\t\\t\\tthe true worship of Allah, as against the false worship\\n\\t\\t\\t\\tof others besides Allah."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "12",
    "NoteID": "3593",
    "Body": "The sage Luqman, after whom this Sura is called, belongs\\n\\t\\t\\t\\tto Arab tradition. Very little is known of his life. He\\n\\t\\t\\t\\tis usually associated with a long life, and his title is\\n\\t\\t\\t\\tMu'ammar (the long-lived). He is referred by some to the\\n\\t\\t\\t\\tage of the 'Ad people, for whom see n. 1040 to vii. 65.\\n\\t\\t\\t\\tHe is the type of perfect wisdom. It is said that he\\n\\t\\t\\t\\tbelonged to a humble station in life, being a slave or a\\n\\t\\t\\t\\tcarpenter, and that he refused worldly power and a\\n\\t\\t\\t\\tkingdom. Many instructive apologies are credited to him,\\n\\t\\t\\t\\tsimilar to Aesop's Fables in Greek tradition. The\\n\\t\\t\\t\\tidentification of Luqman and Aesop has no historical\\n\\t\\t\\t\\tfoundation, though it is true that the traditions about\\n\\t\\t\\t\\tthem have influenced each other."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "12",
    "NoteID": "3594",
    "Body": "Cf. xiv. 8. The basis of the moral Law is man's own good,\\n\\t\\t\\t\\tand not any benefit to Allah, for Allah is above all\\n\\t\\t\\t\\tneeds, and \"worthy of all praise\"; i.e., even in praising\\n\\t\\t\\t\\tHim, we do not advance His glory. When we obey His Will,\\n\\t\\t\\t\\twe bring our position into conformity with our own nature\\n\\t\\t\\t\\tas made by Him."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "13",
    "NoteID": "3595",
    "Body": "Luqman is held up as a pattern of wisdom, because he\\n\\t\\t\\t\\trealized the best in a wise life in this world, as based\\n\\t\\t\\t\\tupon the highest Hope in the inner life. To him, as in\\n\\t\\t\\t\\tIslam, true human wisdom is also divine wisdom: the two\\n\\t\\t\\t\\tcannot be separated. The beginning of all wisdom,\\n\\t\\t\\t\\ttherefore, is conformity with the Will of Allah (xxxi.\\n\\t\\t\\t\\t12). That means that we must understand our relations to\\n\\t\\t\\t\\tHim and worship Him aright (xxxi. 13). Then we must be\\n\\t\\t\\t\\tgood to mankind, beginning with our own parents (xxxi.\\n\\t\\t\\t\\t14). For the two duties are not diverse, but one. Where\\n\\t\\t\\t\\tthey appear to conflict, there is something wrong with\\n\\t\\t\\t\\tthe human will (see n. 3597)."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "14",
    "NoteID": "3596",
    "Body": "The set of milk teeth in a human child is completed at\\n\\t\\t\\t\\tthe age of two years, which is therefore the natural\\n\\t\\t\\t\\textreme limit for breast-feeding. In our artificial life\\n\\t\\t\\t\\tthe duration is much less."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "15",
    "NoteID": "3597",
    "Body": "Where the duty to man conflicts with the duty to Allah,\\n\\t\\t\\t\\tit means that there is something wrong with the human\\n\\t\\t\\t\\twill, and we should obey Allah rather than man. But even\\n\\t\\t\\t\\there, it does not mean that we should be arrogant or\\n\\t\\t\\t\\tinsolent. To parents and those in authority, we must be\\n\\t\\t\\t\\tkind, considerate, and courteous, even where they command\\n\\t\\t\\t\\tthings which we should not do and therefore disobedience\\n\\t\\t\\t\\tbecomes our highest duty. The worship of things other\\n\\t\\t\\t\\tthan Allah is the worship of false things, things which\\n\\t\\t\\t\\tare alien to our true knowledge, things that go against\\n\\t\\t\\t\\tour own pure nature as created by Allah."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "15",
    "NoteID": "3598",
    "Body": "In any apparent conflict of duties our standard should be\\n\\t\\t\\t\\tAllah's Will, as declared to us by His command. That is\\n\\t\\t\\t\\tthe way of those who love Allah: and their motive in\\n\\t\\t\\t\\tdisobedience to parents or human authority where\\n\\t\\t\\t\\tdisobedience is necessary by Allah's Law is not self\\n\\t\\t\\t\\twilled rebellion or defiance, but love of Allah, which\\n\\t\\t\\t\\tmeans the true love of man in the highest sense of the\\n\\t\\t\\t\\tword. And the reason we should give is: \"Both you and I\\n\\t\\t\\t\\thave to return to Allah; therefore not only must I follow\\n\\t\\t\\t\\tAllah's Will, but you must command nothing against\\n\\t\\t\\t\\tAllah's Will.\""
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "15",
    "NoteID": "3599",
    "Body": "These conflicts may appear to us strange and puzzling in\\n\\t\\t\\t\\tthis life. But in Allah's Presence we shall see their\\n\\t\\t\\t\\treal meaning and significance. It may be that that was\\n\\t\\t\\t\\tone way in which our true mettle could be tested: for it\\n\\t\\t\\t\\tis not easy to disobey and love man at the same time."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "16",
    "NoteID": "3600",
    "Body": "Verses 14-15 are not the direct speech of Luqman but flow\\n\\t\\t\\t\\tby way of commentary on his teaching. He was speaking as\\n\\t\\t\\t\\ta father to his son, and he could not very well urge\\n\\t\\t\\t\\trespect for himself and draw the son's attention to the\\n\\t\\t\\t\\tlimitations of filial obedience. These verses may be\\n\\t\\t\\t\\tsupposed to be general directions flowing from Luqman's\\n\\t\\t\\t\\tteaching to men, and not directed to his son; though in\\n\\t\\t\\t\\teither case, as Luqman got wisdom from Allah, it is\\n\\t\\t\\t\\tdivine principles that are enunciated."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "16",
    "NoteID": "3601",
    "Body": "The mustard-seed is proverbially a small, minute thing,\\n\\t\\t\\t\\tthat people may ordinarily pass by. Not so Allah. Further\\n\\t\\t\\t\\temphasis is laid by supposing the mustard-seed to be\\n\\t\\t\\t\\thidden beneath a rock or in the cleft of a rock, or to be\\n\\t\\t\\t\\tlost in the spacious expanse of the earth or of the\\n\\t\\t\\t\\theavens. To Allah everything is known, and He will bring\\n\\t\\t\\t\\tit forth, i. e., take account of it."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "16",
    "NoteID": "3602",
    "Body": "For Latif as a title applied to Allah, see n. 2844 to\\n\\t\\t\\t\\txxii. 63."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "18",
    "NoteID": "3603",
    "Body": "The word \"cheek\" in English, too, means arrogance or\\n\\t\\t\\t\\teffrontery, with a slightly different shade added, viz.:\\n\\t\\t\\t\\teffrontery from one in an inferior position to one in a\\n\\t\\t\\t\\tsuperior position. The Arabic usage is wider, and\\n\\t\\t\\t\\tincludes smug self-satisfaction and a sense of lofty\\n\\t\\t\\t\\tSuperiority."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "19",
    "NoteID": "3604",
    "Body": "The \"Golden Mean\" is the pivot of the philosophy of\\n\\t\\t\\t\\tLuqman as it is of the philosophy of Aristotle and indeed\\n\\t\\t\\t\\tof Islam. And it flows naturally from a true\\n\\t\\t\\t\\tunderstanding of our relation to Allah and His universe\\n\\t\\t\\t\\tand to our fellow-creatures, especially man. In all\\n\\t\\t\\t\\tthings be moderate. Do not go the pace, and do not be\\n\\t\\t\\t\\tstationary or slow. Do not be talkative and do not be\\n\\t\\t\\t\\tsilent. Do not be loud and do not be timid or\\n\\t\\t\\t\\thalf-hearted. Do not be too confident, and do not be\\n\\t\\t\\t\\tcowed down. If you have patience, it is to give you\\n\\t\\t\\t\\tconstancy and determination, that you may bravely carry\\n\\t\\t\\t\\ton the struggle of life. If you have humility, it is to\\n\\t\\t\\t\\tsave you from unseemly swagger, not to curb your right\\n\\t\\t\\t\\tspirit and your reasoned determination."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "20",
    "NoteID": "3605",
    "Body": "Allah's Creation is independent of man. But Allah, in His\\n\\t\\t\\t\\tinfinite mercy, has given man the faculty to subdue the\\n\\t\\t\\t\\tforces of nature and to penetrate through high mysteries\\n\\t\\t\\t\\twith his powers of reason and insight. But this is not\\n\\t\\t\\t\\tmerely a question of power. For in His Universal Plan,\\n\\t\\t\\t\\tall are safeguarded. But man's destiny, as far as we can\\n\\t\\t\\t\\tsee, is noble to the highest degree."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "20",
    "NoteID": "3606",
    "Body": "Allah's grace and bounties work for us at all times.\\n\\t\\t\\t\\tSometimes we see them, and sometimes we do not. In things\\n\\t\\t\\t\\twhich we can apprehend with our senses, we can see\\n\\t\\t\\t\\tAllah's grace, but even in them, sometimes it works\\n\\t\\t\\t\\tbeyond the sphere of our knowledge. In the inner or\\n\\t\\t\\t\\tspiritual world, sometimes, when our vision is clear, we\\n\\t\\t\\t\\tcan see it working, and often we are not conscious of it.\\n\\t\\t\\t\\tBut it works all the same."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "20",
    "NoteID": "3607",
    "Body": "Such men lack knowledge, as they make no use of their\\n\\t\\t\\t\\tintellects but are swayed by their passions; they lack\\n\\t\\t\\t\\tguidance, as they are impatient of control; and the\\n\\t\\t\\t\\tfruits of revelation, or spiritual insight, do not reach\\n\\t\\t\\t\\tthem, as they reject Faith and Revelation."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "21",
    "NoteID": "3608",
    "Body": "They do not realize that in the spiritual world, as in\\n\\t\\t\\t\\tthe physical world, there is constant progress for the\\n\\t\\t\\t\\tlive ones: they are spiritually dead, as they are content\\n\\t\\t\\t\\tto stand on ancestral ways, many of them evil, and\\n\\t\\t\\t\\tleading to perdition."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "22",
    "NoteID": "3609",
    "Body": "Cf. ii. 256 and n. 301."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "22",
    "NoteID": "3610",
    "Body": "Cf. xxii. 41. Everything goes back to Allah. He is our\\n\\t\\t\\t\\tfinal Goal, as He is the final Goal of all things."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "23",
    "NoteID": "3611",
    "Body": "The man of God should not grieve because people reject\\n\\t\\t\\t\\tFaith. He should do his duty and leave the rest to Allah.\\n\\t\\t\\t\\tEvery soul must return to Allah for his reckoning. Allah\\n\\t\\t\\t\\tknows everything, and His Universal Plan is full of\\n\\t\\t\\t\\twisdom."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "24",
    "NoteID": "3612",
    "Body": "Cf ii. 126. The respite in this life is of short\\n\\t\\t\\t\\tduration. The ultimate Penalty of Evil is such as cannot\\n\\t\\t\\t\\tbe quenched. Cf. xiv. 17. It will be too late then to\\n\\t\\t\\t\\trepent."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "25",
    "NoteID": "3613",
    "Body": "Cf xxiii. 84-89, and xxix. 61 and n. 3493. Men will\\n\\t\\t\\t\\tacknowledge that Allah created the heavens and the earth,\\n\\t\\t\\t\\tand yet fail to understand the love and goodness of Allah\\n\\t\\t\\t\\tin continuing to cherish and maintain them with His\\n\\t\\t\\t\\tgifts. Even if they allow this, they sometimes yet fall\\n\\t\\t\\t\\tshort of the corollary, that He is the only One to be\\n\\t\\t\\t\\tworshipped, and run after their own false gods in the\\n\\t\\t\\t\\tshapes of their fancies and lusts. They do not do the\\n\\t\\t\\t\\tduties which, if they rightly understood their own nature\\n\\t\\t\\t\\tand position, they should take a delight in doing."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "25",
    "NoteID": "3614",
    "Body": "This ejaculation expresses our satisfaction that at least\\n\\t\\t\\t\\tthis is recognized, that the Creator of the whole world\\n\\t\\t\\t\\tis Allah. It is a pity that they do not go further and\\n\\t\\t\\t\\trecognize other facts and duties (see the last note)."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "26",
    "NoteID": "3615",
    "Body": "Cf. above, xxxi. 12. There was begun the argument about\\n\\t\\t\\t\\tshowing gratitude to Allah, introducing Luqman's teaching\\n\\t\\t\\t\\tand philosophy. Such gratitude is shown by our\\n\\t\\t\\t\\tunderstanding His love and doing our duty to Him by\\n\\t\\t\\t\\tserving our fellow-men. For Allah Himself is Free from\\n\\t\\t\\t\\tall wants and is in no way dependent on our service. That\\n\\t\\t\\t\\targument has been illustrated in various ways. But now we\\n\\t\\t\\t\\tare told that it can never be completed, for no human\\n\\t\\t\\t\\ttongue or human resources can be adequate either to\\n\\t\\t\\t\\tpraise him or to expound His Word."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "27",
    "NoteID": "3616",
    "Body": "\"Words of Allah\": his wonderful Signs and Commandments\\n\\t\\t\\t\\tare infinite and cannot be expressed if all the trees\\n\\t\\t\\t\\twere made into pens, and all the wide Ocean, multiplied\\n\\t\\t\\t\\tseven times, were made into ink. Any Book of His\\n\\t\\t\\t\\tRevelation would deal with matters which man can\\n\\t\\t\\t\\tunderstand and use in his life: there are things that man\\n\\t\\t\\t\\tcan never fathom. Nor would any praise that we could\\n\\t\\t\\t\\twrite with infinite resources be adequate to describe His\\n\\t\\t\\t\\tpower, glory, and wisdom."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "28",
    "NoteID": "3617",
    "Body": "Allah's greatness and infinitude are such that He can\\n\\t\\t\\t\\tcreate and cherish not only a whole mass, but each\\n\\t\\t\\t\\tindividual soul, and He can follow its history and doings\\n\\t\\t\\t\\tuntil the final Judgment. This shows not only Allah's\\n\\t\\t\\t\\tglory and Omniscience and Omnipotence: it also shows the\\n\\t\\t\\t\\tvalue of each individual soul in His eyes, and lifts\\n\\t\\t\\t\\tindividual responsibility right up into relations with\\n\\t\\t\\t\\tHim."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "29",
    "NoteID": "3618",
    "Body": "Cf. xxii. 61 and n. 2841. Even when we can form a\\n\\t\\t\\t\\tconception of Allah's infinitude by His dealings with\\n\\t\\t\\t\\teach individual in His Creation as in verse 28 above, it\\n\\t\\t\\t\\tis still inadequate. What is an individual himself? What\\n\\t\\t\\t\\tis his relation to the universal Laws of Allah? In outer\\n\\t\\t\\t\\tnature we can see that there is no clear-cut line between\\n\\t\\t\\t\\tnight and day: each merges into the other. Yet the sun\\n\\t\\t\\t\\tand moon obey definite laws. Though they seem to go on\\n\\t\\t\\t\\tfor ever, yet their existence and duration themselves are\\n\\t\\t\\t\\tbut an atom in Allah's great universe. How much more\\n\\t\\t\\t\\t\"merging\" and imperceptible gradation there is in the\\n\\t\\t\\t\\tinner and spiritual world? Our actions themselves cannot\\n\\t\\t\\t\\tbe classified and ticketed and labelled when examined in\\n\\t\\t\\t\\trelation to motives and circumstances. Yet they are like\\n\\t\\t\\t\\tan open book before Allah."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "30",
    "NoteID": "3619",
    "Body": "Cf. xxii. 62 and note 2842 and 2843. All the wonderful\\n\\t\\t\\t\\tcomplexities, gradations, and nuances, that we find in\\n\\t\\t\\t\\tCreation, are yet blended in one harmonious whole, that\\n\\t\\t\\t\\tobeys Law and exemplifies Order. They therefore point to\\n\\t\\t\\t\\tthe One True God. He is the only Eternal Reality.\\n\\t\\t\\t\\tAnything put up in competition or equality with Him is\\n\\t\\t\\t\\tonly Falsehood. For He is higher and greater than\\n\\t\\t\\t\\tanything we can imagine."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "31",
    "NoteID": "3620",
    "Body": "Even the things that man makes are, as using the forces\\n\\t\\t\\t\\tof Nature, evidence of the grace of Allah, Who has\\n\\t\\t\\t\\tsubdued these wonderful forces to the use of man. But\\n\\t\\t\\t\\tthis gift of mastery can only be understood and\\n\\t\\t\\t\\tappreciated by constant perseverance, combined with a\\n\\t\\t\\t\\trecognition of the divine gifts (\"giving thanks\"). Sabbar\\n\\t\\t\\t\\tis an intensive form from sabr and I have indicated it by\\n\\t\\t\\t\\tthe adverb \"constantly\"."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "32",
    "NoteID": "3621",
    "Body": "Cf. vii. 29. Unlike the people mentioned in the last\\n\\t\\t\\t\\tverse, who constantly seek Allah's help and give thanks\\n\\t\\t\\t\\tfor His mercies by using them aright and doing their\\n\\t\\t\\t\\tduty, there is a class of men whose worship is merely\\n\\t\\t\\t\\tinspired by terror. When they are in physical danger-the\\n\\t\\t\\t\\tonly kind of danger they appreciate,-e.g., in a storm at\\n\\t\\t\\t\\tsea, they genuinely think of Allah. But once the danger\\n\\t\\t\\t\\tis past, they become indifferent or wish to appear good\\n\\t\\t\\t\\twhile dallying with evil. See next verse."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "32",
    "NoteID": "3622",
    "Body": "They halt between two opinions. They are not against\\n\\t\\t\\t\\tgood, but they will not eschew evil. They are a contrast\\n\\t\\t\\t\\tto those who \"constantly persevere and give thanks\". But\\n\\t\\t\\t\\tsuch an attitude amounts really to \"perfidious\\n\\t\\t\\t\\tingratitude\"."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "33",
    "NoteID": "3623",
    "Body": "On the Day of Reckoning no one can help another. The most\\n\\t\\t\\t\\tloving father cannot help his son or be a substitute for\\n\\t\\t\\t\\thim, and vice versa. Each will have his own personal\\n\\t\\t\\t\\tresponsibilities."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "33",
    "NoteID": "3624",
    "Body": "The Chief Deceiver is Satan. It may make us forget that\\n\\t\\t\\t\\tTime is fleeting and delude us by suggesting that the\\n\\t\\t\\t\\tReckoning may not come, whereas it is certain to come,\\n\\t\\t\\t\\tbecause Allah's promise is true. We must not play with\\n\\t\\t\\t\\tTime nor be deceived by appearances. The Day may come\\n\\t\\t\\t\\tto-day or to-morrow or when we least expect it."
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "34",
    "NoteID": "3625",
    "Body": "The question of Knowledge or Mystery governs both clauses\\n\\t\\t\\t\\there, viz.: Rain and Wombs. In fact it governs all the\\n\\t\\t\\t\\tfive things mentioned in this verse: viz. (1) the Hour;\\n\\t\\t\\t\\t(2) Rain; (3) the Birth of a new Life (Wombs); (4) our\\n\\t\\t\\t\\tPhysical Life from day to day; (5) our Death. See n. 3627\\n\\t\\t\\t\\tbelow. As regards Rain we are asked to contemplate how\\n\\t\\t\\t\\tand when it is sent down. The moisture may be sucked up\\n\\t\\t\\t\\tby the sun's heat in the Arabian Sea or the Red Sea or\\n\\t\\t\\t\\tthe Indian Ocean near East Africa, or in the Lake Region\\n\\t\\t\\t\\tin Central Africa. The winds drive it hither and thither\\n\\t\\t\\t\\tacross thousands of miles, or it may be, only short\\n\\t\\t\\t\\tdistances. \"The wind bloweth where it listeth.\" No doubt\\n\\t\\t\\t\\tit obeys certain physical Laws established by Allah, but\\n\\t\\t\\t\\thow these Laws are interlocked, one with another!\\n\\t\\t\\t\\tMeteorology, gravity, hydrostatics and dynamics,\\n\\t\\t\\t\\tclimatology, hygrometry, and a dozen other sciences are\\n\\t\\t\\t\\tinvolved, and no man can completely master all of them,\\n\\t\\t\\t\\tand yet this relates to only one of the millions of facts\\n\\t\\t\\t\\tin physical nature, which are governed by Allah's\\n\\t\\t\\t\\tKnowledge and Law. The whole vegetable kingdom is\\n\\t\\t\\t\\tprimarily affected by Rain. The mention of Wombs brings\\n\\t\\t\\t\\tin the mystery of animal Life, Embryology, Sex, and a\\n\\t\\t\\t\\tthousand other things. Who can tell-to take man alone-how\\n\\t\\t\\t\\tlong it will remain in the womb, whether it will be born\\n\\t\\t\\t\\talive, what sort of a new individual it will be,-a\\n\\t\\t\\t\\tblessing or a curse to its parents, or to Society?"
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "34",
    "NoteID": "3626",
    "Body": "\"Earn\" here, as elsewhere, means not only \"earn one's\\n\\t\\t\\t\\tlivelihood\" in a physical sense, but also to reap the\\n\\t\\t\\t\\tconsequences (good or ill) of one's conduct generally.\\n\\t\\t\\t\\tThe whole sentence practically means; \"no man knows what\\n\\t\\t\\t\\tthe morrow may bring forth.\""
  },
  {
    "SurahNumber": "31",
    "AyahNumber": "34",
    "NoteID": "3627",
    "Body": "See the five Mysteries summed up in n. 3625 above. The\\n\\t\\t\\t\\targument is about the mystery of Time and Knowledge. We\\n\\t\\t\\t\\tare supposed to know things in ordinary life. But what\\n\\t\\t\\t\\tdoes that knowledge amount to in reality? Only a\\n\\t\\t\\t\\tsuperficial acquaintance with things. And Time is even\\n\\t\\t\\t\\tmore uncertain. In the case of rain, which causes\\n\\t\\t\\t\\tvegetable life to spring up, or in the case of new animal\\n\\t\\t\\t\\tlife, can we answer with precision questions as to When\\n\\t\\t\\t\\tor How or Wherefore? So about questions of our life from\\n\\t\\t\\t\\tday to day or of our death. These are great mysteries,\\n\\t\\t\\t\\tand full knowledge is with Allah only. How much more so\\n\\t\\t\\t\\tin the case of the Ma'ad, the Final House, when all true\\n\\t\\t\\t\\tvalues will be restored and the balance redressed? It is\\n\\t\\t\\t\\tcertain, but the When and the How are known to Allah\\n\\t\\t\\t\\talone."
  }
]
