[
  {
    "BookCode": "AMH",
    "VolumeNumber": "24",
    "hadithNumber": "1",
    "sectionHeading": "Saying the Name of Allah over the Slaughtered Animal",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was asked, 'Messenger of Allah!\\n\\t\\t\\t\\tSome people from the desert bring us meat, and we do not\\n\\t\\t\\t\\tknow whether the name of Allah has been mentioned over it\\n\\t\\t\\t\\tor not.' The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, 'Mention the name of Allah over it\\n\\t\\t\\t\\tand eat.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That was in the beginning of Islam.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "24",
    "hadithNumber": "2",
    "sectionHeading": "Saying the Name of Allah over the Slaughtered Animal",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAbdullah ibn Ayyash ibn Abi Rabia al-Makhzumi ordered one\\n\\t\\t\\t\\tof his slaves to slaughter an animal. When he wanted to\\n\\t\\t\\t\\tslaughter it, he said to him, \"Mention Allah's name.\" The\\n\\t\\t\\t\\tslave said to him, \"I have mentioned the name!\" He said\\n\\t\\t\\t\\tto him, \"Mention the name of Allah, bother you!\" He said\\n\\t\\t\\t\\tto him, \"I have mentioned the name of Allah \" Abdullah\\n\\t\\t\\t\\tibn Ayyash said, \"By Allah, I shall never eat it!\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "24",
    "hadithNumber": "3",
    "sectionHeading": "Methods of Slaughter Permitted in Necessity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that a man from the Ansar of the tribe of\\n\\t\\t\\t\\tBanu Haritha was herding a pregnant she-camel at Uhud. It\\n\\t\\t\\t\\twas about to die, so he slaughtered it with a sharp\\n\\t\\t\\t\\tstake. The Messenger of Allah was asked about that, and\\n\\t\\t\\t\\the said, \"There is no harm in it, eat it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "24",
    "hadithNumber": "4",
    "sectionHeading": "Methods of Slaughter Permitted in Necessity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from a man of\\n\\t\\t\\t\\tthe Ansar from Muadh ibn Sad or Sad ibn Muadh that a\\n\\t\\t\\t\\tslave-girl of Kab ibn Malik was herding some sheep at Sal\\n\\t\\t\\t\\t(a mountain near Madina). One of the sheep was about to\\n\\t\\t\\t\\tdie, so she went over to it and slaughtered it with a\\n\\t\\t\\t\\tstone. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, was asked about that, and he said,\\n\\t\\t\\t\\t\"There is no harm in it, so eat it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "24",
    "hadithNumber": "5",
    "sectionHeading": "Methods of Slaughter Permitted in Necessity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thawr ibn Zayd\\n\\t\\t\\t\\tad-Dili that Abdullah ibn Abbas was asked about animals\\n\\t\\t\\t\\tslaughtered by the\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tChristian Arabs. He said, \"There is no harm in them,\" but\\n\\t\\t\\t\\the recited this ayat, \"Whoever takes them as friends is\\n\\t\\t\\t\\tfrom them.\" (Sura 5 ayat 54).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "24",
    "hadithNumber": "6",
    "sectionHeading": "Methods of Slaughter Permitted in Necessity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Abbas\\n\\t\\t\\t\\tused to say, \"You can eat anything that has had its\\n\\t\\t\\t\\tjugular vein cut.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"There is no harm in whatever\\n\\t\\t\\t\\tyou slaughter with a cutting edge, as long as you are\\n\\t\\t\\t\\tforced to do it by necessity.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "24",
    "hadithNumber": "7",
    "sectionHeading": "What is Disapproved of in Slaughtering Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAbu Murra, the mawla of Aqil ibn Abi Talib asked Abu\\n\\t\\t\\t\\tHurayra about a sheep which was slaughtered and then part\\n\\t\\t\\t\\tof it moved. He ordered him to eat it. Then he asked Zayd\\n\\t\\t\\t\\tibn Thabit about it, and he said, \"Does a corpse move?\"\\n\\t\\t\\t\\tand he forbade eating its meat.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a sheep which fell down and injured\\n\\t\\t\\t\\titself badly and then its master reached it and\\n\\t\\t\\t\\tslaughtered it. Blood flowed from it but it did not move.\\n\\t\\t\\t\\tMalik said, \"If he kills it and blood flows from it and\\n\\t\\t\\t\\tits eyes blink, he should eat it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "24",
    "hadithNumber": "8",
    "sectionHeading": "Slaughtering What is in the Womb of a Slaughtered Animal",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"When a she-camel is slaughtered, what is\\n\\t\\t\\t\\tin its womb is included in the slaughter if it is\\n\\t\\t\\t\\tperfectly formed and its hair has begun to grow. If it\\n\\t\\t\\t\\tcomes out of its mother's womb, it is slaughtered so that\\n\\t\\t\\t\\tblood flows from its heart.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "24",
    "hadithNumber": "9",
    "sectionHeading": "Slaughtering What is in the Womb of a Slaughtered Animal",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Abdullah\\n\\t\\t\\t\\tibn Qusayt al-Laythi that Said ibn al- Musayyab said,\\n\\t\\t\\t\\t\"The slaughter of what is in the womb is included in the\\n\\t\\t\\t\\tslaughter of the mother if it is perfectly formed and its\\n\\t\\t\\t\\thair has begun to grow.\"\\n\\t\\t\\t</p>"
  }
]
