[
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "1",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that Abdullah ibn Umar\\n\\t\\t\\t\\tsaid, \"The Jews came to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and mentioned to him that\\n\\t\\t\\t\\ta man and woman from among them had committed adultery.\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, asked them, 'What do you find in the Torah about\\n\\t\\t\\t\\tstoning?' They said, 'We make their wrong action known\\n\\t\\t\\t\\tand flog them.' Abdullah ibn Salam said, 'You have lied!\\n\\t\\t\\t\\tIt has stoning for it, so bring the Torah.' They spread\\n\\t\\t\\t\\tit out and one of them placed his hand over the ayat of\\n\\t\\t\\t\\tstoning. Then he read what was before it and what was\\n\\t\\t\\t\\tafter it. Abdullah ibn Salam told him to lift his hand.\\n\\t\\t\\t\\tHe lifted his hand and there was the ayat of stoning.\\n\\t\\t\\t\\tThey said, 'He has spoken the truth, Muhammad. The ayat\\n\\t\\t\\t\\tof stoning is in it.' So the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, gave the order and\\n\\t\\t\\t\\tthey were stoned . \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah ibn Umar added, \"I saw the man leaning over the\\n\\t\\t\\t\\twoman to protect her from the stones.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik commented, \"By leaning he meant throwing himself\\n\\t\\t\\t\\tover her so that the stones fell on him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "2",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said from Said ibn\\n\\t\\t\\t\\tal-Musayyab that a man from the Aslam tribe came to Abu\\n\\t\\t\\t\\tBakr as-Siddiq and said to him, \"I have committed\\n\\t\\t\\t\\tadultery.\" Abu Bakr said to him, \"Have you mentioned this\\n\\t\\t\\t\\tto anyone else?\" He said, \"No.\" Abu Bakr said to him,\\n\\t\\t\\t\\t\"Then cover it up with the veil of Allah. Allah accepts\\n\\t\\t\\t\\ttawba from his slaves.\" His self was still unsettled, so\\n\\t\\t\\t\\the went to Umar ibn al-Khattab. He told him the same as\\n\\t\\t\\t\\the had said to Abu Bakr, and Umar told him the same as\\n\\t\\t\\t\\tAbu Bakr had said to him. His self was still not settled\\n\\t\\t\\t\\tso he went to the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, and said to him, \"I have committed\\n\\t\\t\\t\\tadultery,\" insistently. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, turned away from him three\\n\\t\\t\\t\\ttimes. Each time the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, turned away from him until it\\n\\t\\t\\t\\tbecame too much. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, questioned his family, \"Does he\\n\\t\\t\\t\\thave an illness which affects his mind, or is he mad?\"\\n\\t\\t\\t\\tThey said, \"Messenger of Allah, by Allah, he is well.\"\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Unmarried or married?\" They said, \"Married,\\n\\t\\t\\t\\tMessenger of Allah.\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, gave the order and he was\\n\\t\\t\\t\\tstoned.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "3",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said that Said ibn\\n\\t\\t\\t\\tal-Musayyab said, \"I have heard that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to a\\n\\t\\t\\t\\tman from the Aslam tribe called Hazzal, 'Hazzal, had you\\n\\t\\t\\t\\tveiled him with your cloak, it would have been better for\\n\\t\\t\\t\\tyou.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya ibn Said said, \"I related this hadith in an\\n\\t\\t\\t\\tassembly among whom was Yazid ibn Nuaym ibn Hazzal\\n\\t\\t\\t\\tal-Aslami. Yazid said, 'Hazzal was my grandfather. This\\n\\t\\t\\t\\thadith is true.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "4",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Ibn Shihab informed him that a\\n\\t\\t\\t\\tman confessed that he had committed adultery in the time\\n\\t\\t\\t\\tof the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, and he testified against himself four times,\\n\\t\\t\\t\\tso the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, gave the order and he was stoned.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Shihab said, \"Because of this a man is to be taken\\n\\t\\t\\t\\tfor his own confession against himself.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "5",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yaqub ibn Zayd ibn Talha from\\n\\t\\t\\t\\this father Zayd ibn Talha that Abdullah ibn Abi Mulayka\\n\\t\\t\\t\\tinformed him that a woman came to the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, and informed him\\n\\t\\t\\t\\tthat she had committed adultery and was pregnant. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said to her, \"Go away until you give birth.\" When\\n\\t\\t\\t\\tshe had given birth, she came to him. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\ther, \"Go away until you have suckled and weaned the\\n\\t\\t\\t\\tbaby.\" When she had weaned the baby, she came to him. He\\n\\t\\t\\t\\tsaid, \"Go and entrust the baby to someone.\" She entrusted\\n\\t\\t\\t\\tthe baby to someone and then came to him. He gave the\\n\\t\\t\\t\\torder and she was stoned.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "6",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Ubaydullah ibn\\n\\t\\t\\t\\tAbdullah ibn Utba ibn Masud that Abu Hurayra and Zayd ibn\\n\\t\\t\\t\\tKhalid al-Juhani informed him that two men brought a\\n\\t\\t\\t\\tdispute to the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace. One of them said, \"Messenger of\\n\\t\\t\\t\\tAllah! Judge between us by the Book of Allah!\" The other\\n\\t\\t\\t\\tsaid, and he was the wiser of the two, \"Yes, Messenger of\\n\\t\\t\\t\\tAllah. Judge between us by the Book of Allah and give me\\n\\t\\t\\t\\tpermission to speak.\" He said, \"Speak.\" He said, \"My son\\n\\t\\t\\t\\twas hired by this person and he committed fornication\\n\\t\\t\\t\\twith his wife. He told me that my son deserved stoning,\\n\\t\\t\\t\\tand I ransomed him for one hundred sheep and a\\n\\t\\t\\t\\tslave-girl. Then I asked the people of knowledge and they\\n\\t\\t\\t\\ttold me that my son deserved to be flogged with one\\n\\t\\t\\t\\thundred lashes and exiled for a year, and they informed\\n\\t\\t\\t\\tme that the woman deserved to be stoned.\" The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"By him in whose Hand myself is, I will judge between you\\n\\t\\t\\t\\tby the Book of Allah. As for your sheep and slave girl,\\n\\t\\t\\t\\tthey should be returned to you. Your son should have one\\n\\t\\t\\t\\thundred lashes and be exiled for a year.\" He ordered\\n\\t\\t\\t\\tUnays al-Aslami to go to the wife of the other man and to\\n\\t\\t\\t\\tstone her if she confessed . She confessed and he stoned\\n\\t\\t\\t\\ther.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "7",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Suhayl ibn Abi Salih from his\\n\\t\\t\\t\\tfather from Abu Hurayra that Sad ibn Ubada said to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, \"What do you think I should do if I were to find a\\n\\t\\t\\t\\tman with my wife? Should I leave him there until I had\\n\\t\\t\\t\\tbrought four witnesses?\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Yes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "8",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Ubaydullah ibn\\n\\t\\t\\t\\tAbdullah ibn Utba ibn Masud that Abdullah ibn Abbas said,\\n\\t\\t\\t\\t\"I heard Umar ibn al-Khattab say, 'Stoning is in the Book\\n\\t\\t\\t\\tof Allah for those who commit adultery, men or women when\\n\\t\\t\\t\\tthey are muhsan and when there is clear proof of\\n\\t\\t\\t\\tpregnancy or a confession.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "9",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said from Sulayman ibn\\n\\t\\t\\t\\tYasar from Abu Waqid al-Laythi that a man came to Umar\\n\\t\\t\\t\\tibn al-Khattab while he was in ash-Sham . He mentioned to\\n\\t\\t\\t\\thim that he had found a man with his wife Umar sent Abu\\n\\t\\t\\t\\tWaqid al-Laythi to the wife to question her about that.\\n\\t\\t\\t\\tHe came to her while there were women around her and\\n\\t\\t\\t\\tmentioned to her what her husband had mentioned to Umar\\n\\t\\t\\t\\tibn al-Khattab, and informed her that she would not be\\n\\t\\t\\t\\tpunished on his word and began to suggest to her by that,\\n\\t\\t\\t\\tthat she should retract. She refused to retract and held\\n\\t\\t\\t\\tfirm to confession. Umar gave the order and she was\\n\\t\\t\\t\\tstoned.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "10",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Yahya ibn Said heard Said ibn\\n\\t\\t\\t\\tal-Musayyab say, \"When Umar ibn al-Khattab came from\\n\\t\\t\\t\\tMina, he made his camel kneel at al-Abtah, and then he\\n\\t\\t\\t\\tgathered a pile of small stones and cast his cloak over\\n\\t\\t\\t\\tthem and dropped to the ground. Then he raised his hands\\n\\t\\t\\t\\tto the sky and said, 'O Allah! I have become old and my\\n\\t\\t\\t\\tstrength has weakened. My flock is scattered. Take me to\\n\\t\\t\\t\\tYou with nothing missed out and without having neglected\\n\\t\\t\\t\\tanything.' Then he went to Madina and addressed the\\n\\t\\t\\t\\tpeople. He said, 'People! Sunan have been laid down for\\n\\t\\t\\t\\tyou. Obligations have been placed upon you. You have been\\n\\t\\t\\t\\tleft with a clear way unless you lead people astray right\\n\\t\\t\\t\\tand left.' He struck one of his hands on the other and\\n\\t\\t\\t\\tthen said, 'Take care lest you destroy the ayat of\\n\\t\\t\\t\\tstoning so that one will say, \"We do not find two hadds\\n\\t\\t\\t\\tin the Book of Allah.\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, stoned, so we have stoned.\\n\\t\\t\\t\\tBy He in Whose Hand my self is, had it not been that\\n\\t\\t\\t\\tpeople would say that Umar ibn al-Khattab has added to\\n\\t\\t\\t\\tthe Book of Allah ta-ala, we would have written it, -The\\n\\t\\t\\t\\tfull-grown man and the full-grown woman, stone them\\n\\t\\t\\t\\tabsolutely.\" We have certainly recited that.'\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Yahya ibn Said said Said ibn al-Musayyab\\n\\t\\t\\t\\tsaid, 'Dhu'l-Hijja had not passed before Umar was\\n\\t\\t\\t\\tmurdered, may Allah have mercy on him.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say, \"As for his words\\n\\t\\t\\t\\t'The full-grown man and the full-grown woman' he meant,\\n\\t\\t\\t\\t'The man and the woman who have been married, stone them\\n\\t\\t\\t\\tabsolutely.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "11",
    "sectionHeading": "Stoning",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Uthman ibn\\n\\t\\t\\t\\tAffan was brought a woman who had given birth after six\\n\\t\\t\\t\\tmonths and he ordered her to be stoned. Ali ibn Abi Talib\\n\\t\\t\\t\\tsaid to him, \"She does not deserve that. Allah, the\\n\\t\\t\\t\\tBlessed, the Exalted, says in His Book, 'Their carrying\\n\\t\\t\\t\\tand weaning is thirty months,' (Sura 46 ayat 15) and he\\n\\t\\t\\t\\tsaid, 'Mothers suckle their children for two full years\\n\\t\\t\\t\\tfor whoever wishes to complete the suckling.' (Sura 2\\n\\t\\t\\t\\tayat 233) Pregnancy can then be six months, so she does\\n\\t\\t\\t\\tnot deserve to be stoned.\" Uthman ibn Affan sent for her\\n\\t\\t\\t\\tand found that she had already been stoned.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik related to me that he asked Ibn Shihab about\\n\\t\\t\\t\\tsomeone who committed sodomy. Ibn Shihab said, \"He is to\\n\\t\\t\\t\\tbe stoned, whether or not he is muhsan.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "12",
    "sectionHeading": "Self-Confession of Fornication",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Zayd ibn Aslam that a man\\n\\t\\t\\t\\tconfessed to fornication in the time of the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, called for a whip, and he was brought a broken\\n\\t\\t\\t\\twhip. He said, \"Above this,\" and he was brought a new\\n\\t\\t\\t\\twhip whose knots had not been cut yet. He said, \"Below\\n\\t\\t\\t\\tthis,\" and he was brought a whip which had been used and\\n\\t\\t\\t\\tmade flexible. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, gave the order and he was\\n\\t\\t\\t\\tflogged. Then he said, \"People! The time has come for you\\n\\t\\t\\t\\tto observe the limits of Allah. Whoever has had any of\\n\\t\\t\\t\\tthese ugly things befall him should cover them up with\\n\\t\\t\\t\\tthe veil of Allah. Whoever reveals to us his wrong\\n\\t\\t\\t\\taction, we perform what is in the Book of Allah against\\n\\t\\t\\t\\thim.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "13",
    "sectionHeading": "Self-Confession of Fornication",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that Safiyya bint Abi Ubayd\\n\\t\\t\\t\\tinformed him that a man who had had intercourse with a\\n\\t\\t\\t\\tvirgin slave-girl and made her pregnant was brought to\\n\\t\\t\\t\\tAbu Bakr as-Siddiq. He confessed to fornication, and he\\n\\t\\t\\t\\twas not muhsan. Abu Bakr gave the order and he was\\n\\t\\t\\t\\tflogged with the hadd punishment. Then he was banished to\\n\\t\\t\\t\\tFadak, (thirty miles from Madina).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a person who confessed to fornication\\n\\t\\t\\t\\tand then retracted it and said, \"I didn't do it. I said\\n\\t\\t\\t\\tthat for such-and-such a reason,\" and he mentioned the\\n\\t\\t\\t\\treason. Malik said, \"That is accepted from him and the\\n\\t\\t\\t\\thadd is not imposed on him. That is because the hadd is\\n\\t\\t\\t\\twhat is for Allah, and it is only applied by one of two\\n\\t\\t\\t\\tmeans, either by a clear proof which establishes guilt or\\n\\t\\t\\t\\tby a confession which is persisted in so that the hadd is\\n\\t\\t\\t\\timposed. If someone persists in his confession, the hadd\\n\\t\\t\\t\\tis imposed on him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have not seen the people of knowledge\\n\\t\\t\\t\\texiling slaves who have committed adultery.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "14",
    "sectionHeading": "The Hadd for Fornication",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Ubaydullah ibn\\n\\t\\t\\t\\tAbdullah ibn Utba ibn Masud from Abu Hurayra and Zayd ibn\\n\\t\\t\\t\\tKhalid al-Juhani that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, was asked about a\\n\\t\\t\\t\\tslave-girl who committed fornication and was not muhsana.\\n\\t\\t\\t\\tHe said, \"If she commits fornication, then flog her. If\\n\\t\\t\\t\\tshe commits fornication again, then flog her, and if she\\n\\t\\t\\t\\tcommits fornication again, then sell her, if only for a\\n\\t\\t\\t\\trope.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Shihab added, \"I don't know whether it was three or\\n\\t\\t\\t\\tfour times.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "15",
    "sectionHeading": "The Hadd for Fornication",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi that a slave was in charge\\n\\t\\t\\t\\tof the slaves in the khumus and he forced a slave-girl\\n\\t\\t\\t\\tamong those slaves against her will and had intercourse\\n\\t\\t\\t\\twith her. Umar ibn al-Khattab had him flogged and\\n\\t\\t\\t\\tbanished him, and he did not flog the slave-girl because\\n\\t\\t\\t\\tthe slave had forced her.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "16",
    "sectionHeading": "The Hadd for Fornication",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said that Sulayman ibn\\n\\t\\t\\t\\tYasar informed him that Abdullah ibn Abbas ibn Abi Rabia\\n\\t\\t\\t\\tal-Makhzumi said, -Umar ibn al-Khattab gave me orders\\n\\t\\t\\t\\tabout the slaves of Quraysh and we flogged some of the\\n\\t\\t\\t\\tslave-girls of the muslim lands fifty times each for\\n\\t\\t\\t\\tfornication.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "16",
    "sectionHeading": "Rape",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The position with us about a woman who is\\n\\t\\t\\t\\tfound to be pregnant and has no husband and she says, 'I\\n\\t\\t\\t\\twas forced,' or she says, 'I was married,' is that it is\\n\\t\\t\\t\\tnot accepted from her and the hadd is inflicted on her\\n\\t\\t\\t\\tunless she has a clear proof of what she claims about the\\n\\t\\t\\t\\tmarriage or that she was forced or she comes bleeding if\\n\\t\\t\\t\\tshe was a virgin or she calls out for help so that\\n\\t\\t\\t\\tsomeone comes to her and she is in that state or what\\n\\t\\t\\t\\tresembles it of the situation in which the violation\\n\\t\\t\\t\\toccurred.\" He said, \"If she does not produce any of\\n\\t\\t\\t\\tthose, the hadd is inflicted on her and what she claims\\n\\t\\t\\t\\tof that is not accepted from her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A raped woman cannot marry until she has\\n\\t\\t\\t\\trestored herself by three menstrual periods.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"If she doubts her periods, she does not marry\\n\\t\\t\\t\\tuntil she has freed herself of that doubt.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "17",
    "sectionHeading": "The Hadd for Slander, Denial and Insinuation",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abu'z-Zinad that he said, ''Umar\\n\\t\\t\\t\\tibn Abd al-Aziz flogged a slave with eighty lashes for\\n\\t\\t\\t\\tslander.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu'z-Zinad said, \"I asked Abdullah ibn Amir ibn Rabia\\n\\t\\t\\t\\tabout that. He said, 'I saw Umar ibn al-Khattab, Uthman\\n\\t\\t\\t\\tibn Affan, the Khalifs, and so on, and I did not see any\\n\\t\\t\\t\\tof them flog a slave more than forty lashes for slander.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "18",
    "sectionHeading": "The Hadd for Slander, Denial and Insinuation",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Zurayq ibn Hakim al-Ayli that a\\n\\t\\t\\t\\tman called Misbah asked his son for help and he thought\\n\\t\\t\\t\\thim unnecessarily slow. When the son came, his father\\n\\t\\t\\t\\tsaid to him, \"O fornicator.\" Zurayq said, \"So the son\\n\\t\\t\\t\\tasked me to help him against the father. When I wanted to\\n\\t\\t\\t\\tflog him, his son said, 'By Allah, if you flog him, I\\n\\t\\t\\t\\twill acknowledge that I have committed fornication.' When\\n\\t\\t\\t\\the said that, the situation was confused for me, so I\\n\\t\\t\\t\\twrote about it to Umar ibn Abd al-Aziz who was the\\n\\t\\t\\t\\tgovernor at that time, and I mentioned it to him. Umar\\n\\t\\t\\t\\twrote me to permit his pardon.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tZurayq said, \"I wrote to Umar ibn Abd al-Aziz also, 'What\\n\\t\\t\\t\\tdo you think about a man who is slandered or his parents\\n\\t\\t\\t\\tare slandered and both or only one of them are dead?' He\\n\\t\\t\\t\\tsaid, Umar wrote to me, 'If he forgives, his pardon is\\n\\t\\t\\t\\tpermitted for himself. If his parents are slandered and\\n\\t\\t\\t\\tone or both of them are dead, take the judgement of the\\n\\t\\t\\t\\tBook of Allah for it unless he wants to veil it.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"I heard Malik say, 'That is because the\\n\\t\\t\\t\\tslandered man might fear that if that is unveiled about\\n\\t\\t\\t\\thim, a clear proof might be established. If it is\\n\\t\\t\\t\\taccording to what we have described, his pardon is\\n\\t\\t\\t\\tpermitted.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "19",
    "sectionHeading": "The Hadd for Slander, Denial and Insinuation",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Hisham ibn Urwa that his father\\n\\t\\t\\t\\tsaid that there was only one hadd against a man who\\n\\t\\t\\t\\tslandered a group of people.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If they are on separate occasions there is\\n\\t\\t\\t\\tstill only one hadd against him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik related to me from Abu'r-Rijal Muhammad ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Haritha ibn an-Numan al-Ansari, then from\\n\\t\\t\\t\\tthe Banu'n-Najar from his mother Amra bint Abd ar-Rahman\\n\\t\\t\\t\\tthat two men cursed each other in the time of Umar ibn\\n\\t\\t\\t\\tal-Khattab. One of them said to the other, \" By Allah, my\\n\\t\\t\\t\\tfather is not an adulterer and my mother is not an\\n\\t\\t\\t\\tadulteress.\" Umar ibn al-Khattab asked advice about that.\\n\\t\\t\\t\\tOne person said, \"He has praised his father and mother.\"\\n\\t\\t\\t\\tAnother said, \"His father and mother have praise other\\n\\t\\t\\t\\tthan this. We think that he is to be flogged with the\\n\\t\\t\\t\\thadd.\" So Umar flogged him with the hadd of eighty\\n\\t\\t\\t\\tlashes.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no hadd in our view except for\\n\\t\\t\\t\\tslander, denial or insinuation, in which one sees that\\n\\t\\t\\t\\tthe speaker intends by that denial or slander. Then the\\n\\t\\t\\t\\thadd is completely imposed on the one who said it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community when a man\\n\\t\\t\\t\\tdenies that another man is from his father, is that he\\n\\t\\t\\t\\tdeserves the hadd. If the mother who is denied is a\\n\\t\\t\\t\\tslave, then he deserves the hadd as well. '\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "19",
    "sectionHeading": "What has No Hadd for It",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The best of what is heard about a slave-girl\\n\\t\\t\\t\\twhom a man has intercourse with while he has a partner in\\n\\t\\t\\t\\ther is that the hadd is not inflicted on him and the\\n\\t\\t\\t\\tchild is connected to him. When the slave-girl becomes\\n\\t\\t\\t\\tpregnant, her value is estimated and he gives his\\n\\t\\t\\t\\tpartners their shares of the price and the slave-girl is\\n\\t\\t\\t\\this. That is what is done among us.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who made his slave-girl halal to a\\n\\t\\t\\t\\tman that if the one for whom she was made halal had\\n\\t\\t\\t\\tintercourse with her, her value was estimated on the day\\n\\t\\t\\t\\the had intercourse with her and he owed that to her owner\\n\\t\\t\\t\\twhether or not she conceived. The hadd was averted from\\n\\t\\t\\t\\thim by that. If she conceived the child was connected to\\n\\t\\t\\t\\thim.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who had intercourse with his son's\\n\\t\\t\\t\\tor daughter's slave-girl, \"The hadd is averted from him\\n\\t\\t\\t\\tand he owes the estimated value of the slave-girl whether\\n\\t\\t\\t\\tor not she conceives.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "20",
    "sectionHeading": "What has No Hadd for It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Rabia ibn Abi Abd ar-Rahman that\\n\\t\\t\\t\\tUmar ibn al-Khattab spoke about a man who went out with\\n\\t\\t\\t\\this wife's slave-girl on a journey and had intercourse\\n\\t\\t\\t\\twith her and then the wife became jealous and mentioned\\n\\t\\t\\t\\tthat to Umar ibn al-Khattab. Umar questioned him about\\n\\t\\t\\t\\tit. He said, \"She gave her to me.\" Umar said, \"Bring me a\\n\\t\\t\\t\\tclear proof or I will stone you.\" Rabia added, \"The wife\\n\\t\\t\\t\\tconfessed that she had given her to him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "21",
    "sectionHeading": "What Obliges Cutting Off the Hand",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Abdullah ibn Umar that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, cut off the hand of a man who stole a shield whose\\n\\t\\t\\t\\tprice was three dirhams.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "22",
    "sectionHeading": "What Obliges Cutting Off the Hand",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abd\\n\\t\\t\\t\\tar-Rahman abu Husayn al-Makki that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"The hand is not cut off for fruit hanging on the tree\\n\\t\\t\\t\\tand for sheep kept in the mountains. So when they are\\n\\t\\t\\t\\ttaken from the fold or the place where the fruit is\\n\\t\\t\\t\\tdried, a hand is cut off for whatever reaches the price\\n\\t\\t\\t\\tof a shield.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "23",
    "sectionHeading": "What Obliges Cutting Off the Hand",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tfrom his father from Amra bint Abd ar-Rahman that a thief\\n\\t\\t\\t\\tstole a citron in the time of Uthman Uthman ibn Affan\\n\\t\\t\\t\\tordered its value to be estimated and it was estimated at\\n\\t\\t\\t\\tthree dirhams at the rate of exchange of twelve dirhams\\n\\t\\t\\t\\tfor the dinar, so Uthman cut off his hand.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "24",
    "sectionHeading": "What Obliges Cutting Off the Hand",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAmra bint Abd ar-Rahman that A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"It has not been a long time for me and I have not\\n\\t\\t\\t\\tforgotten. A thief's hand is cut off for a quarter of a\\n\\t\\t\\t\\tdinar and upwards.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "25",
    "sectionHeading": "What Obliges Cutting Off the Hand",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Hazim that Amra bint Abd ar-Rahman said, \"A'isha, the\\n\\t\\t\\t\\twife of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, went out to Makka and she had two girl mawlas of\\n\\t\\t\\t\\thers and a slave belonging to the sons of Abdullah ibn\\n\\t\\t\\t\\tAbi Bakr as-Siddiq . She sent a figured cloak with the\\n\\t\\t\\t\\ttwo mawlas which was sewn up in a piece of green cloth.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAmra continued, \"The slave took it and unstitched it and\\n\\t\\t\\t\\ttook out the cloak. In its place, he put some felt or\\n\\t\\t\\t\\tskin and sewed it up again. When the mawla girls came to\\n\\t\\t\\t\\tMadina, they gave it to his people. When they opened it,\\n\\t\\t\\t\\tthey found felt in it and did not find the cloak. They\\n\\t\\t\\t\\tspoke to the two women and they spoke to A'isha, the wife\\n\\t\\t\\t\\tof the Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tor they wrote to her and suspected the slave. The slave\\n\\t\\t\\t\\twas asked about it and confessed. A'isha, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, gave\\n\\t\\t\\t\\tthe order and his hand was cut off. A'isha said, 'A\\n\\t\\t\\t\\tthief's hand is cut off for a quarter of a dinar and\\n\\t\\t\\t\\tupwards.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The limit I prefer above which cutting off\\n\\t\\t\\t\\tthe hand is obliged is three dirhams, whether the\\n\\t\\t\\t\\texchange is high or low. That is because the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, cut off\\n\\t\\t\\t\\tthe hand of a thief for a shield whose value was three\\n\\t\\t\\t\\tdirhams, and Uthman ibn Affan cut off the hand of a thief\\n\\t\\t\\t\\tfor a citron which was estimated at three dirhams. This\\n\\t\\t\\t\\tis what I prefer of what I have heard on the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "26",
    "sectionHeading": "Cutting Off the Hands of Runaway Slaves Who Steal",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that a slave of\\n\\t\\t\\t\\tAbdullah ibn Umar stole while he was a runaway. Abdullah\\n\\t\\t\\t\\tibn Umar sent him to Said ibn al-As, who was the amir of\\n\\t\\t\\t\\tMadina, to cut off his hand. Said refused to cut off his\\n\\t\\t\\t\\thand. He said, \"The hand of a runaway slave is not cut\\n\\t\\t\\t\\toff when he steals.\" Abdullah ibn Umar said to him, \"In\\n\\t\\t\\t\\twhat Book of Allah did you find this?\" Then Abdullah ibn\\n\\t\\t\\t\\tUmar gave the order, and his hand was cut off.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "27",
    "sectionHeading": "Cutting Off the Hands of Runaway Slaves Who Steal",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Zurayq ibn Hakim\\n\\t\\t\\t\\tinformed him that he had a runaway slave who had stolen.\\n\\t\\t\\t\\tHe said, \"The situation was obscure for me, so I wrote to\\n\\t\\t\\t\\tUmar ibn Abd al-Aziz to ask him about it. He was the\\n\\t\\t\\t\\tgovernor at that time. I informed him that I had heard\\n\\t\\t\\t\\tthat if a runaway slave stole while he was a fugitive,\\n\\t\\t\\t\\this hand was not cut off. 'Umar ibn Abd al-Aziz wrote to\\n\\t\\t\\t\\tcontradict my letter, 'You wrote to me that you have\\n\\t\\t\\t\\theard that when the runaway slave steals, his hand is not\\n\\t\\t\\t\\tcut off. Allah, the Blessed, the Exalted, says in His\\n\\t\\t\\t\\tBook, 'The thief, male and female, cut off the hands of\\n\\t\\t\\t\\tboth, as a recompense for what they have earned, and an\\n\\t\\t\\t\\texemplary punishment from Allah. Allah is Mighty, Wise.'\\n\\t\\t\\t\\t(Sura 5 ayat 41) When his theft reaches a quarter of a\\n\\t\\t\\t\\tdinar, and upwards, his hand is cut off.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad and Salim ibn Abdullah and Urwa ibn\\n\\t\\t\\t\\taz-Zubayr said, \"When a runaway slave steals something\\n\\t\\t\\t\\tfor which cutting off the hand is obliged, his hand is\\n\\t\\t\\t\\tcut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things amongst us about\\n\\t\\t\\t\\twhich there is no dispute is that when the runaway slave\\n\\t\\t\\t\\tsteals that for which cutting off the hand is obliged,\\n\\t\\t\\t\\this hand is cut off.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "28",
    "sectionHeading": "Intercession Cut Off for Thieves when Cases Reach the Sultan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tSafwan ibn Abdullah ibn Safwan that it was said to Safwan\\n\\t\\t\\t\\tibn Umayya, \"Whoever does not do hijra is ruined.\" So\\n\\t\\t\\t\\tSafwan ibn Umayya went to Madina and slept in the mosque\\n\\t\\t\\t\\twith his cloak as a pillow. A thief came and took his\\n\\t\\t\\t\\tcloak and Safwan grabbed hold of the thief and brought\\n\\t\\t\\t\\thim to the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said to him, \"Did you steal this\\n\\t\\t\\t\\tcloak?\" He said, \"Yes.\" So the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, ordered that his\\n\\t\\t\\t\\thand be cut off. Safwan said to him, \"I did not intend\\n\\t\\t\\t\\tthis. It is his as sadaqa.\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Why didn't\\n\\t\\t\\t\\tyou do it before bringing him to me?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "29",
    "sectionHeading": "Intercession Cut Off for Thieves when Cases Reach the Sultan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman that az-Zubayr ibn al-Awwam came across a man\\n\\t\\t\\t\\twho had taken hold of a thief and was intending to take\\n\\t\\t\\t\\thim to the Sultan. Az-Zubayr ibn al-Awwam interceded for\\n\\t\\t\\t\\thim to let him go. He said, \"No. Not until I take him to\\n\\t\\t\\t\\tthe Sultan.\" Az-Zubayr said, \"When you reach the Sultan\\n\\t\\t\\t\\twith him, Allah curses the one who intercedes and the one\\n\\t\\t\\t\\twho accepts the intercession.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "30",
    "sectionHeading": "General Section on Cutting Off the Hand",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim from his father that a man from Yemen who had\\n\\t\\t\\t\\this hand and foot cut off came and went before Abu Bakr\\n\\t\\t\\t\\tas-Siddiq and complained to him that the governor of the\\n\\t\\t\\t\\tYemen had wronged him, and the man used to pray part of\\n\\t\\t\\t\\tthe night. Abu Bakr said, \"By your father, your night is\\n\\t\\t\\t\\tnot the night of a thief.\" Then they missed a necklace of\\n\\t\\t\\t\\tAsma bint Umays, the wife of Abu Bakr as-Siddiq. The man\\n\\t\\t\\t\\tcame to go around with them looking for it. He said, \"O\\n\\t\\t\\t\\tAllah! You are responsible for the one who invaded the\\n\\t\\t\\t\\tpeople of this good house by night!\" They found the\\n\\t\\t\\t\\tjewelry with a goldsmith. He claimed that the maimed man\\n\\t\\t\\t\\thad brought it to him. The maimed man confessed or it was\\n\\t\\t\\t\\ttestified against him. Abu Bakr as-Siddiq ordered that\\n\\t\\t\\t\\this left hand be cut off. Abu Bakr said, \"By Allah! His\\n\\t\\t\\t\\tdua against himself is more serious, as far as I am\\n\\t\\t\\t\\tconcerned, than his theft.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"What is done among us about\\n\\t\\t\\t\\tthe person who steals several times and is then called to\\n\\t\\t\\t\\treckoning, is that only his hand is cut off for all he\\n\\t\\t\\t\\tstole when the hadd has not been applied againsthim. If\\n\\t\\t\\t\\tthe hadd has been applied against him before that, and he\\n\\t\\t\\t\\tsteals what obliges cutting off, then the next limb is\\n\\t\\t\\t\\tcut off.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "31",
    "sectionHeading": "General Section on Cutting Off the Hand",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu'z-Zinad informed\\n\\t\\t\\t\\thim that a governor of Umar ibn Abd al-Aziz took some\\n\\t\\t\\t\\tpeople in battle and had not killed any of them. He\\n\\t\\t\\t\\twanted to cut off their hands or kill them, so he wrote\\n\\t\\t\\t\\tto Umar ibn Abd al-Aziz about that Umar ibn Abd al-Aziz\\n\\t\\t\\t\\twrote to him, \"Better to take less than that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"What is done among\\n\\t\\t\\t\\tus about a person who steals the goods of people which\\n\\t\\t\\t\\tare placed under guard in the markets, and their owners\\n\\t\\t\\t\\tput them in their containers and store them together is\\n\\t\\t\\t\\tthat if anyone steals any of that from where it is kept,\\n\\t\\t\\t\\tand its value reaches that for which cutting off the hand\\n\\t\\t\\t\\tis obliged, his hand must be cut off, whether or not the\\n\\t\\t\\t\\towner of the goods is with his goods and whether it is\\n\\t\\t\\t\\tnight or day.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about some one who stole something for which\\n\\t\\t\\t\\tcutting off the hand was obliged and then what he stole\\n\\t\\t\\t\\twas found with him and he returned it to its owner, \"His\\n\\t\\t\\t\\thand is cut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someon says, 'How can his hand be cut off\\n\\t\\t\\t\\twhen the goods have been taken from him and returned to\\n\\t\\t\\t\\ttheir owner?', it is because he is in the same position\\n\\t\\t\\t\\tas the wine drinker when the smell of the wine is found\\n\\t\\t\\t\\ton his breath and he is not drunk. He is flogged with the\\n\\t\\t\\t\\thadd.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"The hadd is imposed for drinking wine even if it does\\n\\t\\t\\t\\tnot make the man intoxicated. That is because he drank it\\n\\t\\t\\t\\tto become intoxicated. It is the same as that with\\n\\t\\t\\t\\tcutting off the hand of the thief for theft when it is\\n\\t\\t\\t\\ttaken from him, even if he has not profited from it and\\n\\t\\t\\t\\tit was returned to its owner. When he stole it, he stole\\n\\t\\t\\t\\tit to take it away.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if some people came to a house and robbed\\n\\t\\t\\t\\tit together, and then they left with a sack or box or a\\n\\t\\t\\t\\tboard or basket or the like of that which they carried\\n\\t\\t\\t\\ttogether, and when they took it out of its guarded place,\\n\\t\\t\\t\\tthey carried it together, and the price of what they took\\n\\t\\t\\t\\treached that for which cutting off the hand was obliged,\\n\\t\\t\\t\\tand that was three dirhams and upwards, each of them had\\n\\t\\t\\t\\this hand cut off.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"If each of them takes out something by himself, whoever\\n\\t\\t\\t\\tof them takes out something whose value reaches three\\n\\t\\t\\t\\tdirhams and upwards must have his hand cut off. If any of\\n\\t\\t\\t\\tthem takes out something whose value does not reach three\\n\\t\\t\\t\\tdirhams, he does not have his hand cut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"What is done among us is\\n\\t\\t\\t\\tthat when a man's house is locked and he is the only one\\n\\t\\t\\t\\tliving in it, cutting off the hand is not obliged against\\n\\t\\t\\t\\tthe one who steals something from it until he takes it\\n\\t\\t\\t\\tout of the house completely. That is because all of the\\n\\t\\t\\t\\thouse is a place of custody. If someone other than him\\n\\t\\t\\t\\tlives in the house and each of them locks his door, and\\n\\t\\t\\t\\tit is a place of custody for each of them, whoever steals\\n\\t\\t\\t\\tanything from the apartments of that house must have his\\n\\t\\t\\t\\thand cut off when he leaves the apartment and goes into\\n\\t\\t\\t\\tthe main house. He has removed it from its place of\\n\\t\\t\\t\\tcustody to another place and he must have his hand cut\\n\\t\\t\\t\\toff.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community about a slave\\n\\t\\t\\t\\twho steals from the property of his master is that if he\\n\\t\\t\\t\\tis not in service and among those trusted in the house\\n\\t\\t\\t\\tand he enters secretly and steals from his master\\n\\t\\t\\t\\tsomething that for which cutting off the hand is obliged,\\n\\t\\t\\t\\this hand is not cut off. It is like that with a\\n\\t\\t\\t\\tslave-girl when she steals from her master's property.\\n\\t\\t\\t\\tHer hand is not cut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik then spoke about a slave who was not in service and\\n\\t\\t\\t\\tnot one of those trusted in the house, and he entered\\n\\t\\t\\t\\tsecretly and stole from the property of his master's wife\\n\\t\\t\\t\\tthat for which cutting off the hand was obliged. He said,\\n\\t\\t\\t\\t\"His hand is cut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"It is like that with the wife's slave-girl when she does\\n\\t\\t\\t\\tnot serve her or her husband nor is she trusted in the\\n\\t\\t\\t\\thouse and she enters secretly and steals from her\\n\\t\\t\\t\\tmistress's property that for which cutting off the hand\\n\\t\\t\\t\\tis obliged. Her hand is not cut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"It is like that with the wife's slave-girl who is not in\\n\\t\\t\\t\\ther service and is not trusted in the house and she\\n\\t\\t\\t\\tenters secretly and steals from the property of her\\n\\t\\t\\t\\tmistress's husband something for which cutting off the\\n\\t\\t\\t\\thand is obliged. Her hand is cut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIt is like that with the man who steals from his wife's\\n\\t\\t\\t\\tgoods or the wife who steals from her husband's goods\\n\\t\\t\\t\\tsomething for which cutting off the hand is obliged. If\\n\\t\\t\\t\\tthe thing which one of them steals from his spouse's\\n\\t\\t\\t\\tproperty is in a room other than the room which they both\\n\\t\\t\\t\\tlock for themselves, or it is in a place of custody in a\\n\\t\\t\\t\\troom other than the room which they are in, whichever of\\n\\t\\t\\t\\tthem steals something for which cutting off the hand is\\n\\t\\t\\t\\tobliged, their hand should be cut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a small child and a foreigner who does\\n\\t\\t\\t\\tnot speak clearly. He said, \"If they are robbed of\\n\\t\\t\\t\\tsomething from its place of custody or from under a lock,\\n\\t\\t\\t\\tthe one who stole it has his hand cut off. If the\\n\\t\\t\\t\\tproperty is outside of its place of custody or locked\\n\\t\\t\\t\\troom(when it is stolen), the one who robbed them does not\\n\\t\\t\\t\\thave his hand cut off. It is then in the position of\\n\\t\\t\\t\\tsheep stolen from the mountain and uncut fruit hanging on\\n\\t\\t\\t\\tthe trees \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done among us about a person who\\n\\t\\t\\t\\trobs graves is that if what he takes from the grave\\n\\t\\t\\t\\treaches what cutting off the hand is obliged for, his\\n\\t\\t\\t\\thand is cut off . That is because the grave is a place of\\n\\t\\t\\t\\tcustody for what is in it just as houses are a place of\\n\\t\\t\\t\\tcustody for what is in them. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"Cutting off the hand is not obliged for him\\n\\t\\t\\t\\tuntil he takes it out of the grave.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "32",
    "sectionHeading": "Things for Which the Hand is Not Cut Off",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Yahya ibn Habban that a slave stole a small\\n\\t\\t\\t\\tpalm from a man's garden and planted it in the garden of\\n\\t\\t\\t\\this master. The owner of the palm went out looking for\\n\\t\\t\\t\\tthe palm and found it. He asked for help against the\\n\\t\\t\\t\\tslave from Marwan ibn al-Hakam. Marwan jailed the slave\\n\\t\\t\\t\\tand wanted to cut off his hand. The master of the slave\\n\\t\\t\\t\\trushed off to Rafi ibn Khadij and asked him about it.\\n\\t\\t\\t\\tRafi informed him that he heard the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, say, \"The hand\\n\\t\\t\\t\\tis not cut off for fruit or palm pith.\" The man said,\\n\\t\\t\\t\\t\"Marwan ibn al-Hakam has taken a slave of mine and wants\\n\\t\\t\\t\\tto cut off his hand. I would like you to go with me to\\n\\t\\t\\t\\thim so you can tell him what you heard from the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace.\" So,\\n\\t\\t\\t\\tRafi went with him to Marwan ibn al-Hakam. He said, \"Did\\n\\t\\t\\t\\tyou arrest a slave for this?\" He said, \"Yes.\" He said,\\n\\t\\t\\t\\t\"What will you do with him?\" He said, \"I want to cut off\\n\\t\\t\\t\\this hand.\" Rafi said to him, \"I heard the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, say, 'The\\n\\t\\t\\t\\thand is not cut off for dates or palm pith.' Marwan\\n\\t\\t\\t\\ttherefore ordered the slave to be released.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "33",
    "sectionHeading": "Things for Which the Hand is Not Cut Off",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tas-Sa'ib ibn Yazid that Abdullah ibn Amr ibn al-Hadrami\\n\\t\\t\\t\\tbrought a slave of his to Umar ibn al-Khattab and said to\\n\\t\\t\\t\\thim, \"Cut off the hand of this slave of mine. He has\\n\\t\\t\\t\\tstolen.\" Umar said to him, \"What did he steal?\" He said,\\n\\t\\t\\t\\t\"He stole a mirror belonging to my wife. Its value was\\n\\t\\t\\t\\tsixty dirhams.\" Umar said, \"Let him go. His hand is not\\n\\t\\t\\t\\tto be cut off. He is your servant who has stolen your\\n\\t\\t\\t\\tbelongings.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "34",
    "sectionHeading": "Things for Which the Hand is Not Cut Off",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tMarwan ibn al-Hakam was brought a man who had snatched\\n\\t\\t\\t\\tsome goods and he wanted to cut off his hand. He sent to\\n\\t\\t\\t\\tZayd ibn Thabit to ask him about it. Zayd ibn Thabit said\\n\\t\\t\\t\\tto him, \"The hand is not cut off for what is stolen by\\n\\t\\t\\t\\tchance, openly, in haste.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "41",
    "hadithNumber": "35",
    "sectionHeading": "Things for Which the Hand is Not Cut Off",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat Abu Bakr ibn Muhammad ibn Amr ibn Hazm informed him\\n\\t\\t\\t\\tthat he had taken a Nabatean who had stolen some iron\\n\\t\\t\\t\\trings and jailed him in order to cut off his hand. Amra\\n\\t\\t\\t\\tbint Abd ar-Rahman sent a girl mawla to him called\\n\\t\\t\\t\\tUmayya. Abu Bakr said that she had come to him while he\\n\\t\\t\\t\\twas among the people and said that his aunt Amra sent\\n\\t\\t\\t\\tword to him saying, \"Son of my brother! You have taken a\\n\\t\\t\\t\\tNabatean for something insignificant which was mentioned\\n\\t\\t\\t\\tto me. Do you want to cut off his hand?\" He had said,\\n\\t\\t\\t\\t\"Yes.\" She said, ''Amra says to you not to cut off the\\n\\t\\t\\t\\thand except for a quarter of a dinar and upwards.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Bakr added, \"So I let the Nabatean go.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us about the confession of slaves is that if a\\n\\t\\t\\t\\tslave confesses something against himself, the hadd and\\n\\t\\t\\t\\tpunishment for it is inflicted on his body. His\\n\\t\\t\\t\\tconfession is accepted from him and one does not suspect\\n\\t\\t\\t\\tthat he would inflict something on himself.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for the one of them who confesses to a\\n\\t\\t\\t\\tmatter which will incur damages agains this master, his\\n\\t\\t\\t\\tconfession is not accepted against his master.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"One does not cut off the hand of a hireling\\n\\t\\t\\t\\tor a man who is with some people to serve them, if he\\n\\t\\t\\t\\trobs them, because his state is not the state of a thief.\\n\\t\\t\\t\\tHis state is the state of a treacherous one. The\\n\\t\\t\\t\\ttreacherous one does not have his hand cut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a person who borrows something and then\\n\\t\\t\\t\\tdenies it, \"His hand is not cut off. He is like a man who\\n\\t\\t\\t\\towes a debt to another man and denies it. He does not\\n\\t\\t\\t\\thave his hand cut off for what he has denied.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed-on way of dealing among\\n\\t\\t\\t\\tus, with the thief who is found in a house and has\\n\\t\\t\\t\\tgathered up goods and has not taken them out, is that his\\n\\t\\t\\t\\thand is not cut off. That is like the man who places wine\\n\\t\\t\\t\\tbefore him to drink it and does not do it. The hadd is\\n\\t\\t\\t\\tnot imposed on him. That is like a man who sits with a\\n\\t\\t\\t\\twoman and desires to have haram intercourse with her and\\n\\t\\t\\t\\tdoes not do it and he does not reach her. There is no\\n\\t\\t\\t\\thadd against that either.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed-on way of doing things\\n\\t\\t\\t\\tamong us is that there is no cutting off the hand for\\n\\t\\t\\t\\twhat is taken by chance, openly and in haste, whether or\\n\\t\\t\\t\\tnot its price reaches that for which the hand is cut\\n\\t\\t\\t\\toff.\"\\n\\t\\t\\t</p>"
  }
]
