[
  {
    "SurahNumber": "60",
    "AyahNumber": "1",
    "NoteID": "5409",
    "Body": "The immediate occasion for this was a secret letter sent\\n\\t\\t\\t\\tby one Hatib, a Muhajir, from Madinah, to the Pagans at\\n\\t\\t\\t\\tMakkah, in most friendly terms, seeking for their\\n\\t\\t\\t\\tprotection on behalf of his children and relatives left\\n\\t\\t\\t\\tbehind in Makkah. The letter was intercepted, and he\\n\\t\\t\\t\\tconfessed the truth. He was forgiven as he told the truth\\n\\t\\t\\t\\tand his motive did not appear to be heinous, but this\\n\\t\\t\\t\\tinstruction was given for future guidance. This was\\n\\t\\t\\t\\tshortly before the conquest of Makkah, but the principle\\n\\t\\t\\t\\tis of universal application. You cannot be on terms of\\n\\t\\t\\t\\tsecret intimacy with the enemies of your Faith and\\n\\t\\t\\t\\tpeople, who are persecuting your Faith and seeking to\\n\\t\\t\\t\\tdestroy your Faith and you. You may not do so even for\\n\\t\\t\\t\\tthe sake of your relatives as it compromises the life and\\n\\t\\t\\t\\texistence of your whole community."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "1",
    "NoteID": "5410",
    "Body": "Such was the position of the Muslim community in Madinah\\n\\t\\t\\t\\tafter the Hijrat and before the conquest of Makkah."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "2",
    "NoteID": "5411",
    "Body": "Besides the question of your fidelity to your own people,\\n\\t\\t\\t\\teven your own selfish interests require you to beware of\\n\\t\\t\\t\\tsecret intrigues with enemies. They will welcome you as\\n\\t\\t\\t\\tcat's paw. But what will happen when they have used you\\n\\t\\t\\t\\tand got the better of you and your people! Then they will\\n\\t\\t\\t\\tshow you their hand. And a heavy hand it will be! Not\\n\\t\\t\\t\\tonly will they injure you with their hands but with their\\n\\t\\t\\t\\ttongues! The only words they will use for you will be\\n\\t\\t\\t\\t\"Traitors to their own\"! If they intrigue with you now,\\n\\t\\t\\t\\tit is to prevert you from the Path of Truth and\\n\\t\\t\\t\\trighteousness and win you over to their evil ways."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "3",
    "NoteID": "5412",
    "Body": "The plea of children and relatives (see n. 5409 above)\\n\\t\\t\\t\\twill be no excuse for treachery when the Day of Judgment\\n\\t\\t\\t\\tcomes. Your children and family will not save you. The\\n\\t\\t\\t\\tJudgment will be in the hands of Allah, and He has full\\n\\t\\t\\t\\tknowledge of all your overt and hidden acts and motives."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "4",
    "NoteID": "5413",
    "Body": "See ix. 114. Abraham was tender-hearted, and loyal to his\\n\\t\\t\\t\\tfather and his people. He warned them against idolatory\\n\\t\\t\\t\\tand sin, and prayed for his father, but when his father\\n\\t\\t\\t\\tand his people became open enemies of Allah, Abraham\\n\\t\\t\\t\\tentirely dissociated himself from them, and left his\\n\\t\\t\\t\\thome, his father, his people, and his country. Those with\\n\\t\\t\\t\\thim were his believing wife and nephew Lut and any other\\n\\t\\t\\t\\tBelievers that went into exile with him."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "4",
    "NoteID": "5414",
    "Body": "The enemies of Allah are enemies of the righteous, and\\n\\t\\t\\t\\tthey hate the righteous. Therefore the righteous must cut\\n\\t\\t\\t\\tthemselves off eternally from them, unless they repent\\n\\t\\t\\t\\tand come back to Allah. In that case they receive Allah's\\n\\t\\t\\t\\tmercy and are entitied to all the rights of love and\\n\\t\\t\\t\\tbrotherhood. This shows that our detestation is for evil,\\n\\t\\t\\t\\tnot for men as such so long as there is a chance for\\n\\t\\t\\t\\trepentance. See also verse 7 below. But we must give no\\n\\t\\t\\t\\tchance to Evil for working evil on our Brotherhood at any\\n\\t\\t\\t\\ttime."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "4",
    "NoteID": "5415",
    "Body": "Refer again to ix. 114, n. 1365: and n. 5413 above.\\n\\t\\t\\t\\tAbraham's conduct is not condemned. it was a special\\n\\t\\t\\t\\tcase, and is not to be imitated by weaker men, who may\\n\\t\\t\\t\\tfall into sin by thinking too much of sinners."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "4",
    "NoteID": "5416",
    "Body": "This prayer indicates what our attitude should be. We\\n\\t\\t\\t\\tmust trust to Allah, and not to Allah's enemies to\\n\\t\\t\\t\\tprotect and befriend ourselves, our families, or those\\n\\t\\t\\t\\tnear and dear to us."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "5",
    "NoteID": "5417",
    "Body": "In n. 1198 to viii. 25, I have explained the shades of\\n\\t\\t\\t\\tmeaning in the word Fitnat. In ii. 102 Harut and Marut\\n\\t\\t\\t\\twere a trial to test the righteous who trusted in Allah\\n\\t\\t\\t\\tfrom the unrighteous who resorted to evil and\\n\\t\\t\\t\\tsuperstition. Here the prayer to Allah is that we should\\n\\t\\t\\t\\tbe saved from becoming so weak as to tempt the\\n\\t\\t\\t\\tUnbelievers to try to attack and destroy us."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "6",
    "NoteID": "5418",
    "Body": "In them: i.e. in their attitude of prayer and reliance on\\n\\t\\t\\t\\tAllah, and of dissociation from evil."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "6",
    "NoteID": "5419",
    "Body": "If any one rejects Allah's Message or Law, the loss is\\n\\t\\t\\t\\this own. It is not Allah Who needs him or his worship or\\n\\t\\t\\t\\this sacrifice or his praise. Allah is independent of all\\n\\t\\t\\t\\twants, and His attributes are inherently deserving of all\\n\\t\\t\\t\\tpraise, whether the wicked give such praise or not, in\\n\\t\\t\\t\\tword or deed."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "7",
    "NoteID": "5420",
    "Body": "Apparent religious hatred or enmity or persecution may be\\n\\t\\t\\t\\tdue to ignorance or over-zeal in a soul, which Allah will\\n\\t\\t\\t\\tforgive and use eventually in His service, as happened in\\n\\t\\t\\t\\tthe case of Hadhrat 'Umar, who was a different man before\\n\\t\\t\\t\\tand after his conversion. As stated in n. 5414 above, we\\n\\t\\t\\t\\tshould hate evil, but not men as such."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "8",
    "NoteID": "5421",
    "Body": "Even with Unbelievers, unless they are rampant and out to\\n\\t\\t\\t\\tdestroy us and our Faith, we should deal kindly and\\n\\t\\t\\t\\tequitably, as is shown by our holy Prophet's own example."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "5422",
    "Body": "Under the treaty of Hudaibiya [see Introduction to S.\\n\\t\\t\\t\\txlviii, paragraph 4, condition (3)], women under\\n\\t\\t\\t\\tguardianship (including married women), who fled from the\\n\\t\\t\\t\\tQuraish in Makkah to the Prophet's protection at Madinah\\n\\t\\t\\t\\twere to be sent back. But before this Ayat was issued,\\n\\t\\t\\t\\tthe Quraish had already broken the treaty, and some\\n\\t\\t\\t\\tinstruction was necessary as to what the Madinah Muslims\\n\\t\\t\\t\\tshould do in those circumstances. Muslim women married to\\n\\t\\t\\t\\tPagan husbands in Makkah were oppressed for their Faith,\\n\\t\\t\\t\\tand some of them came to Madinah as refugees. After this,\\n\\t\\t\\t\\tthey were not to be returned to the custody of their\\n\\t\\t\\t\\tPagan husbands at Makkah, as the marriage of believing\\n\\t\\t\\t\\twomen with non-Muslims was held to be dissolved if the\\n\\t\\t\\t\\thusbands did not accept Islam. But in order to give no\\n\\t\\t\\t\\tsuspicion to the Pagans that they were badly treated as\\n\\t\\t\\t\\tthey lost the dower they had given on marriage, that\\n\\t\\t\\t\\tdower was to be repaid to the husbands. Thus helpless\\n\\t\\t\\t\\twomen refugees were to be protected at the cost of the\\n\\t\\t\\t\\tMuslims."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "5423",
    "Body": "The condition was that they should be Muslim women. How\\n\\t\\t\\t\\twere the Muslims to know? A non-Muslim woman, in order to\\n\\t\\t\\t\\tescape from her lawful guardians in Makkah, might pretend\\n\\t\\t\\t\\tthat she was a Muslim. The true state of her mind and\\n\\t\\t\\t\\theart would be known to Allah alone. But if the Muslims,\\n\\t\\t\\t\\ton an examination of the woman, found that she professed\\n\\t\\t\\t\\tIslam, she was to have protection. The examination would\\n\\t\\t\\t\\tbe directed (among other things) to the points mentioned\\n\\t\\t\\t\\tin verse 12 below."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "5424",
    "Body": "As the marriage was held to be dissolved (see n. 5422\\n\\t\\t\\t\\tabove), there was no bar to the remarriage of the refugee\\n\\t\\t\\t\\tMuslim woman with a Muslim man on the payment of the\\n\\t\\t\\t\\tusual dower to her."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "10",
    "NoteID": "5425",
    "Body": "Unbelieving women in a Muslim society would only be a\\n\\t\\t\\t\\tclog and a handicap. There would be neither happiness for\\n\\t\\t\\t\\tthem, nor could they conduce in any way to a healthy life\\n\\t\\t\\t\\tof the society in which they lived as aliens. They were\\n\\t\\t\\t\\tto be sent away, as their marriage was held to be\\n\\t\\t\\t\\tdissolved; and the dowers paid to them were to be\\n\\t\\t\\t\\tdemanded from the guardians to whom they were sent back,\\n\\t\\t\\t\\tjust as in the contrary case the dowers of believing\\n\\t\\t\\t\\twomen were to be paid back to their Pagan ex-husbands (n.\\n\\t\\t\\t\\t5422 above)."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "11",
    "NoteID": "5426",
    "Body": "A very unlikely contingency, considering how much better\\n\\t\\t\\t\\tposition the women occupied in Islam than under Pagan\\n\\t\\t\\t\\tcustom. But all contingencies have to be provided for\\n\\t\\t\\t\\tequitably in legislation. If a woman went over to the\\n\\t\\t\\t\\tPagans, her dower would be recoverable from the Pagans\\n\\t\\t\\t\\tand payable to the deserted husband. If a woman came over\\n\\t\\t\\t\\tfrom the Pagans, her dower would be payable to the\\n\\t\\t\\t\\tPagans. Assuming that the two dowers were equal, the one\\n\\t\\t\\t\\twould be set off against the other as between the two\\n\\t\\t\\t\\tcommunities; but within the communities the deserted\\n\\t\\t\\t\\tindividual would be compensated by the individual who\\n\\t\\t\\t\\tgains a wife. If the dowers were unequal, the balance\\n\\t\\t\\t\\twould be recoverable as between the communities, and the\\n\\t\\t\\t\\tadjustment would then be made as between the individuals."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "12",
    "NoteID": "5427",
    "Body": "Now come directions as to the points on which women\\n\\t\\t\\t\\tentering Islam should pledge themselves. Similar points\\n\\t\\t\\t\\tapply to men, but here the question is about women, and\\n\\t\\t\\t\\tespecially such as were likely, in those early days of\\n\\t\\t\\t\\tIslam, to come from Pagan society into Muslim society in\\n\\t\\t\\t\\tthe conditions discussed in notes 5422 and 5423 above. A\\n\\t\\t\\t\\tpledge on these points would search out their real\\n\\t\\t\\t\\tmotives: (1) to worship none but Allah; (2) not to steal;\\n\\t\\t\\t\\t(3) not to indulge in sex outside the marriage tie; (4)\\n\\t\\t\\t\\tnot to commit infanticide; (the Pagan Arabs were prone to\\n\\t\\t\\t\\tfemale infanticide): (5) not to indulge in slander or\\n\\t\\t\\t\\tscandal; and (6) generally, to obey loyally the law and\\n\\t\\t\\t\\tprinciples of Islam. The last was a comprehensive and\\n\\t\\t\\t\\tsufficient phrase, but it was good to indicate also the\\n\\t\\t\\t\\tspecial points to which attention was to be directed in\\n\\t\\t\\t\\tthose special circumstances. Obedience was of course to\\n\\t\\t\\t\\tbe in all things just and reasonable: Islam requires\\n\\t\\t\\t\\tstrict discipline but not slavishness. A) \"That they will\\n\\t\\t\\t\\tnot utter slander intentionally forging falsehood\".\\n\\t\\t\\t\\tLiterally, \"...nor produce any lie that they have devised\\n\\t\\t\\t\\tbetween their hands and feet,\". These words mean that\\n\\t\\t\\t\\tthey should not falsely attribute the paternity of their\\n\\t\\t\\t\\tillegitimate children to their lawful husbands thereby\\n\\t\\t\\t\\tadding to the monstrosity of their original sin of\\n\\t\\t\\t\\tinfidelity."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "12",
    "NoteID": "5428",
    "Body": "If pledges are sincerely given for future conduct,\\n\\t\\t\\t\\tadmission to Islam is open. If there is anything in the\\n\\t\\t\\t\\tpast, for which there is evidence of sincere repentance,\\n\\t\\t\\t\\tforgiveness is to be prayed for. Allah forgives in such\\n\\t\\t\\t\\tcases: how can man refuse to give such cases a real\\n\\t\\t\\t\\tchance?"
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "13",
    "NoteID": "5429",
    "Body": "So we come back to the theme with which we started in\\n\\t\\t\\t\\tthis Sura: that we should not turn for friendship and\\n\\t\\t\\t\\tintimacy to those who break Allah's Law and are outlaws\\n\\t\\t\\t\\tin Allah's Kingdom. The various phrases of this question,\\n\\t\\t\\t\\tand the legitimate qualifications, have already been\\n\\t\\t\\t\\tmentioned, and the argument is here rounded off. Cf. also\\n\\t\\t\\t\\tlviii. 14."
  },
  {
    "SurahNumber": "60",
    "AyahNumber": "13",
    "NoteID": "5430",
    "Body": "The Unbelievers, who do not believe in a Future Life, can\\n\\t\\t\\t\\ttherefore have no hope beyond this life. Miserable indeed\\n\\t\\t\\t\\tis this life to them; for the ills of this life are real\\n\\t\\t\\t\\tto them, and they can have no hope of redress. But such\\n\\t\\t\\t\\tis also the state of others-People of the Book or not-who\\n\\t\\t\\t\\twallow in sin and incur the divine Wrath. Even if they\\n\\t\\t\\t\\tbelieve in a Future Life, it can only be to them a life\\n\\t\\t\\t\\tof horror, punishment, and despair. For those of Faith\\n\\t\\t\\t\\tthe prospect is different. They may suffer in this life,\\n\\t\\t\\t\\tbut this life to them is only a fleeting shadow that will\\n\\t\\t\\t\\tsoon pass away. The Reality is beyond; there will be full\\n\\t\\t\\t\\tredress in the Beyond, and Achievement and Felicity such\\n\\t\\t\\t\\tas they can scarcely conceive of in the terms of this\\n\\t\\t\\t\\tlife."
  }
]
