[
  {
    "SurahNumber": "17",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "The above short reference to the Prophet's mystic\\n\\t\\t\\t\\texperience of the \"Night Journey\" (al-isra') to Jerusalem\\n\\t\\t\\t\\tand the subsequent \"Ascension\" (mi'raj) to heaven is\\n\\t\\t\\t\\tfully discussed in Appendix IV at the end of this work. -\\n\\t\\t\\t\\t\"The Inviolable House of Worship\" (al-masjid al-haram) is\\n\\t\\t\\t\\tone of the designations given in the Qur'an to the Temple\\n\\t\\t\\t\\tof the Ka'bah, the prototype of which owed its origin to\\n\\t\\t\\t\\tAbraham (see surah {2}, note [102]) and was \"the first\\n\\t\\t\\t\\tTemple set up for mankind\" ( 3:96 ), i.e., the first ever\\n\\t\\t\\t\\tbuilt for the worship of the One God. \"The Remote [lit.,\\n\\t\\t\\t\\t\"farthest\"] House of Worship\", on the other hand, denotes\\n\\t\\t\\t\\tthe ancient Temple of Solomon - or, rather, its site -\\n\\t\\t\\t\\twhich symbolizes here the long line of Hebrew prophets\\n\\t\\t\\t\\twho preceded the advent of Muhammad and are alluded to by\\n\\t\\t\\t\\tthe phrase \"the environs of which We had blessed\". The\\n\\t\\t\\t\\tjuxtaposition of these two sacred temples is meant to\\n\\t\\t\\t\\tshow that the Qur'an does not inaugurate a \"new\" religion\\n\\t\\t\\t\\tbut represents a continuation and the ultimate\\n\\t\\t\\t\\tdevelopment of the same divine message which was preached\\n\\t\\t\\t\\tby the prophets of old."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "Although the term ayah is most frequently used in the\\n\\t\\t\\t\\tQur'an in the sense of \"[divine] message\", we must\\n\\t\\t\\t\\tremember that, primarily, it denotes \"a sign [or \"token\"]\\n\\t\\t\\t\\tby which a thing is known\" (Qamus). As defined by Raghib,\\n\\t\\t\\t\\tit signifies any perceivable phenomenon (irrespective of\\n\\t\\t\\t\\twhether it is apparent to the senses or only to the\\n\\t\\t\\t\\tintellect) connected with a thing that is not, by itself,\\n\\t\\t\\t\\tsimilarly perceivable: in brief, a \"symbol\". Hence, the\\n\\t\\t\\t\\texpression min ayatina may be suitably rendered as \"some\\n\\t\\t\\t\\tof Our symbols\", i.e., insight, through symbols, into\\n\\t\\t\\t\\tsome of the ultimate truths."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "The conjunctive particle \"And\" which introduces this\\n\\t\\t\\t\\tverse is meant to show that the mystic Night Journey -\\n\\t\\t\\t\\tand, by implication, the subsequent Ascension as well -\\n\\t\\t\\t\\twere experiences of the same high order of divine grace\\n\\t\\t\\t\\tas the revelation bestowed upon Moses.\\tThe Qur'an\\n\\t\\t\\t\\tmentions  in 4:164  that \"God spoke His word unto Moses\",\\n\\t\\t\\t\\ti.e., directly (takliman); see also {7:143-144}, and\\n\\t\\t\\t\\tespecially verse {144}, in which God says to Moses, \"I\\n\\t\\t\\t\\thave raised thee above all people...by virtue of My\\n\\t\\t\\t\\tspeaking [unto thee]\".\\tA similar directness of\\n\\t\\t\\t\\texperience is alluded to in the opening words of this\\n\\t\\t\\t\\tsurah, \"Limitless in His Glory is He who transported His\\n\\t\\t\\t\\tservant [Muhammad] by night...so that We might show him\\n\\t\\t\\t\\tsome of Our symbols\" (see note [2] above; also, Appendix\\n\\t\\t\\t\\tIV).  Apart from this, the reference, in this and many\\n\\t\\t\\t\\tother places in the Qur'an, to the religious history of\\n\\t\\t\\t\\tthe Hebrews is due to the fact that the revelations\\n\\t\\t\\t\\tgranted to their prophets represent the earliest\\n\\t\\t\\t\\tformulation of monotheism, which makes it ideologically\\n\\t\\t\\t\\timportant for its later development."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "2",
    "NoteID": "4",
    "Body": "The term wakil denotes \"one who is entrusted with the\\n\\t\\t\\t\\tmanagement of [another person’s] affairs\", or \"is\\n\\t\\t\\t\\tresponsible for [another person’s] conduct\". When applied\\n\\t\\t\\t\\tto God, it is sometimes used in the sense of \"guardian\"\\n\\t\\t\\t\\t(e.g., in  3:173 ), or \"defender\" (e.g., in  4:109 ), or\\n\\t\\t\\t\\t- in combination with the phrase 'ala kulli shay’in (as,\\n\\t\\t\\t\\te.g., in  6:102  or  11:12 ) - in the sense of \"the One\\n\\t\\t\\t\\twho has everything in His care\". In the present instance\\n\\t\\t\\t\\t(as well as in  39:62 ) the term evidently alludes to\\n\\t\\t\\t\\tGod’s exclusive power to determine the fate of any\\n\\t\\t\\t\\tcreated being or thing."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "Lit., \"in the revelation\" - here evidently used in the\\n\\t\\t\\t\\tgeneric sense of the word, and probably applying to\\n\\t\\t\\t\\tpredictions contained in the Torah (Leviticus xxvi, 14-39\\n\\t\\t\\t\\tand Deuteronomy xxviii, 15-68) as well as the prophecies\\n\\t\\t\\t\\tof Isaiah, Jeremiah, John and Jesus."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "4",
    "NoteID": "6",
    "Body": "Since both the Bible and the Qur’an mention that the\\n\\t\\t\\t\\tchildren of Israel rebelled against the law of God on\\n\\t\\t\\t\\tmany occasions, there is every reason to assume that the\\n\\t\\t\\t\\texpression \"twice\" (marratayn) does not refer to two\\n\\t\\t\\t\\tsingle instances but, rather, to two distinct, extended\\n\\t\\t\\t\\tperiods of their history."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "5",
    "NoteID": "7",
    "Body": "The term ibad, rendered by me above as \"bondmen\", denotes\\n\\t\\t\\t\\tevery kind of \"created beings\" (in this case, obviously\\n\\t\\t\\t\\thuman beings) inasmuch as all of them are, willingly or\\n\\t\\t\\t\\tunwillingly, subservient to God’s will (cf.  13:15  and\\n\\t\\t\\t\\tthe corresponding note [33]). It is probable that the\\n\\t\\t\\t\\tphrase \"Our bondmen of terrible prowess in war\" relates\\n\\t\\t\\t\\tto the Assyrians who overran Palestine in the seventh\\n\\t\\t\\t\\tcentury B.C. and caused the disappearance of the greater\\n\\t\\t\\t\\tpart of the Hebrew nation (the ten \"lost tribes\"), and to\\n\\t\\t\\t\\tthe Babylonians who, about one hundred years later,\\n\\t\\t\\t\\tdestroyed Solomon’s Temple and carried off the remainder\\n\\t\\t\\t\\tof the children of Israel into captivity, or to both,\\n\\t\\t\\t\\tthus comprising all these events within one \"period\" (see\\n\\t\\t\\t\\tforegoing note). - God’s \"sending\" tribulations upon\\n\\t\\t\\t\\treprobate sinners is here, as elsewhere in the Qur'an, a\\n\\t\\t\\t\\tmetonym for the natural law of cause and effect to which,\\n\\t\\t\\t\\tin the long run, the life of man - and particularly the\\n\\t\\t\\t\\tcorporate life of nations and communities - is subject."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "6",
    "NoteID": "8",
    "Body": "Lit., \"We gave back to you the turn against them\" -\\n\\t\\t\\t\\tapparently a reference to the return of the Jews from the\\n\\t\\t\\t\\tBabylonian captivity in the last quarter of the sixth\\n\\t\\t\\t\\tcentury B.C., the partial re-establishment of their\\n\\t\\t\\t\\tstate, and the building of a new temple in the place of\\n\\t\\t\\t\\tthe one that had been destroyed."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "7",
    "NoteID": "9",
    "Body": "Lit., \"to bring evil to your faces\". Inasmuch as the face\\n\\t\\t\\t\\tis the most prominent and expressive part of the human\\n\\t\\t\\t\\tbody, it is often used as a metonym for one’s whole\\n\\t\\t\\t\\tbeing; hence, the \"evil done to one’s face\" is synonymous\\n\\t\\t\\t\\twith \"utter disgrace\". Most probably, this passage\\n\\t\\t\\t\\trelates to the destruction of the Second Temple and of\\n\\t\\t\\t\\tJewish statehood by Titus in the year 70 of the Christian\\n\\t\\t\\t\\tera."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "9",
    "NoteID": "10",
    "Body": "I.e., conformable to ethical rectitude and beneficial to\\n\\t\\t\\t\\tman’s individual and social life. Thus, after showing\\n\\t\\t\\t\\tthat sinning is synonymous with denying the truth, the\\n\\t\\t\\t\\tdiscourse returns to the fundamental theme of the Qur'an,\\n\\t\\t\\t\\talready alluded to in verse {2} of this surah: namely,\\n\\t\\t\\t\\tthe statement that God always offers guidance to man\\n\\t\\t\\t\\tthrough the revelations which He bestows upon His\\n\\t\\t\\t\\tprophets."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "11",
    "NoteID": "11",
    "Body": "This, to my mind, is the meaning of the conjunctive\\n\\t\\t\\t\\tparticle wa in the above context."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "11",
    "NoteID": "12",
    "Body": "Cf. {2:216} - \"it may well be that you hate a thing the\\n\\t\\t\\t\\twhile it is good for you, and it may well be that you\\n\\t\\t\\t\\tlove a thing the while it is bad for you: and God knows,\\n\\t\\t\\t\\twhereas you do not know\": in other words, divine\\n\\t\\t\\t\\tguidance is the only objective criterion as to what is\\n\\t\\t\\t\\tgood and what is bad."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "12",
    "NoteID": "13",
    "Body": "Regarding the primary meaning of the term ayah, see note\\n\\t\\t\\t\\t[2] above. In the present context, the expression ayatayn\\n\\t\\t\\t\\t(\"two symbols\") refers - as the subsequent clause shows -\\n\\t\\t\\t\\tto the symbols of spiritual darkness and light."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "12",
    "NoteID": "14",
    "Body": "I.e., the message of the Qur'an, which is meant to lead\\n\\t\\t\\t\\tman out of spiritual ignorance and error into the light\\n\\t\\t\\t\\tof faith and reason."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "12",
    "NoteID": "15",
    "Body": "Lit., \"the count ('adad) of years\". Since, as the Qamus\\n\\t\\t\\t\\tpoints out, this phrase denotes also \"the years of [a\\n\\t\\t\\t\\tperson's] life, which he counts\", it obviously implies\\n\\t\\t\\t\\there a call to spiritual self-criticism in view of the\\n\\t\\t\\t\\tephemeral nature of one's worldly life."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "12",
    "NoteID": "16",
    "Body": "I.e., everything that man may be in need of in the domain\\n\\t\\t\\t\\tof ethics and religion."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "13",
    "NoteID": "17",
    "Body": "The word ta'ir literally signifies a \"bird\" or, more\\n\\t\\t\\t\\tproperly, a \"flying creature\". Since the pre-Islamic\\n\\t\\t\\t\\tArabs often endeavoured to establish a good or bad omen\\n\\t\\t\\t\\tand, in general, to foretell the future from the manner\\n\\t\\t\\t\\tand direction in which birds would fly, the term ta'ir\\n\\t\\t\\t\\tcame to be tropically used in the sense of \"fortune\",\\n\\t\\t\\t\\tboth good and evil, or \"destiny\". (See in this connection\\n\\t\\t\\t\\tsurah {3}, note [37], and surah {7}, note [95].) It\\n\\t\\t\\t\\tshould, however, be borne in mind that the Qur'anic\\n\\t\\t\\t\\tconcept of \"destiny\" relates not so much to the external\\n\\t\\t\\t\\tcircumstances of and events in man's life as, rather, to\\n\\t\\t\\t\\tthe direction which this life takes in result of one's\\n\\t\\t\\t\\tmoral choices: in other words, it relates to man's\\n\\t\\t\\t\\tspiritual fate - and this, in its turn, depends - as the\\n\\t\\t\\t\\tQur'an so often points out - on a person's inclinations,\\n\\t\\t\\t\\tattitudes and conscious actions (including self-restraint\\n\\t\\t\\t\\tfrom morally bad actions or, alternatively, a deliberate\\n\\t\\t\\t\\tomission of good actions). Hence, man's spiritual fate\\n\\t\\t\\t\\tdepends on himself and is inseparably linked with the\\n\\t\\t\\t\\twhole tenor of his personality; and since it is God who\\n\\t\\t\\t\\thas made man responsible for his behaviour on earth, He\\n\\t\\t\\t\\tspeaks of Himself as having \"tied every human being's\\n\\t\\t\\t\\tdestiny to his neck\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "14",
    "NoteID": "18",
    "Body": "The \"record\" and the subsequent \"account\" represent man's\\n\\t\\t\\t\\ttotal comprehension, on Judgment Day, of all his past\\n\\t\\t\\t\\tlife (Razi). This allegory occurs in the Qur'an in many\\n\\t\\t\\t\\tformulations, e.g., in  37:19  or  39:68 , and perhaps\\n\\t\\t\\t\\tmost incisively in {50:22} - \"now We have lifted from\\n\\t\\t\\t\\tthee thy veil, and sharp is thy sight today!\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "15",
    "NoteID": "19",
    "Body": "See  6:164 ,  35:18  and  39:7 , as well as the\\n\\t\\t\\t\\tcorresponding notes, also  53:38 , which represents the\\n\\t\\t\\t\\tearliest Qur'anic statement of this fundamental principle\\n\\t\\t\\t\\tof ethics."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "15",
    "NoteID": "20",
    "Body": "Sc., \"so that they might fully understand the meaning of\\n\\t\\t\\t\\tright and wrong\": cf. {6:131-132} and the corresponding\\n\\t\\t\\t\\tnote [117], as well as  28:59  (which, in the chronology\\n\\t\\t\\t\\tof revelation, immediately precedes the present surah)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "16",
    "NoteID": "21",
    "Body": "Lit., \"Our command\", i.e., to mend their ways. The term\\n\\t\\t\\t\\tqaryah (lit., \"town\") denotes usually - though not always\\n\\t\\t\\t\\t - a \"community\" or \"people of a community\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "16",
    "NoteID": "22",
    "Body": "I.e., to the exclusion of all moral considerations. (For\\n\\t\\t\\t\\tthe above rendering of the expression mutraf, see surah\\n\\t\\t\\t\\t{11}, note [147].) The people referred to here are those\\n\\t\\t\\t\\twho, by virtue of their wealth and social position,\\n\\t\\t\\t\\tembody the real leadership of their community and are,\\n\\t\\t\\t\\ttherefore, morally responsible for the behaviours of\\n\\t\\t\\t\\ttheir followers."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "18",
    "NoteID": "23",
    "Body": "Lit., \"We assign [or \"shall assign\"] hell to him\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "19",
    "NoteID": "24",
    "Body": "Since caring and striving for the good of the hereafter\\n\\t\\t\\t\\tpresupposes belief in God and in man's responsibility\\n\\t\\t\\t\\tbefore Him, it is obvious that the term \"believer\"\\n\\t\\t\\t\\trelates, in this context, to a cognition of God's\\n\\t\\t\\t\\tabsolute oneness and uniqueness as well as to a willing\\n\\t\\t\\t\\tacceptance of the guidance offered to man through\\n\\t\\t\\t\\tprophetic revelation. - In the original, the whole\\n\\t\\t\\t\\tpreceding sentence has the singular form (\"he who\\n\\t\\t\\t\\tcares...and strives...and is a believer\"); but in view of\\n\\t\\t\\t\\tthe next clause, which is expressed in the plural, it is\\n\\t\\t\\t\\tpreferable to render these pronouns, agreeably with\\n\\t\\t\\t\\tArabic usage, uniformly in the plural."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "21",
    "NoteID": "25",
    "Body": "Lit., \"greater in degrees and greater in the bestowal of\\n\\t\\t\\t\\tbounty (tafdilan)\"-but since the latter term obviously\\n\\t\\t\\t\\tcomprises, in this instance, the concept of \"merit\" as\\n\\t\\t\\t\\twell, a composite rendering would seem to be indicated."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "23",
    "NoteID": "26",
    "Body": "Whereas God is the real, ultimate cause of man's coming\\n\\t\\t\\t\\tto life, his parents are its outward immediate cause: and\\n\\t\\t\\t\\tso the preceding call to God is followed by the\\n\\t\\t\\t\\tinjunction to honour and cherish one's parents. Beyond\\n\\t\\t\\t\\tthis, the whole of the present passage - up to and\\n\\t\\t\\t\\tincluding verse {39} - is meant to show that kindness and\\n\\t\\t\\t\\tjust dealings between man and man are an integral part of\\n\\t\\t\\t\\tthe concept of \"striving for the good of the life to\\n\\t\\t\\t\\tcome\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "23",
    "NoteID": "27",
    "Body": "In Arabic. uff- a word or sound indicative of contempt,\\n\\t\\t\\t\\tdislike or disgust."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "24",
    "NoteID": "28",
    "Body": "Lit., \"lower for them the wing of humility, out of\\n\\t\\t\\t\\ttenderness (rahmah)\" - a metonymical expression evocative\\n\\t\\t\\t\\tof a bird that lovingly spreads its wings over its\\n\\t\\t\\t\\toffspring in the nest."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "25",
    "NoteID": "29",
    "Body": "This interpolation gives the meaning of the above\\n\\t\\t\\t\\telliptic sentence (Tabari, Baghawi, Zamakhshari, Razi)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "26",
    "NoteID": "30",
    "Body": "In this instance, \"his due\" evidently refers to the\\n\\t\\t\\t\\tloving consideration due to one's relatives (Zamakhsharl\\n\\t\\t\\t\\tand Razi); those of them who are in a state of want are\\n\\t\\t\\t\\tincluded in the subsequent mention of \"the needy\"\\n\\t\\t\\t\\t(al-miskin)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "26",
    "NoteID": "31",
    "Body": "Regarding this expression, see surah {2}, note [145]."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "26",
    "NoteID": "32",
    "Body": "Lit., \"with [utter] squandering\" (tabdhiran) i.e.,\\n\\t\\t\\t\\tsenselessly and to no good purpose. It is to be borne in\\n\\t\\t\\t\\tmind that the term tabdhir does not relate to the\\n\\t\\t\\t\\tquantity but, rather, to the purpose of one's spending.\\n\\t\\t\\t\\tThus, Ibn'Abbas and Ibn Mas'ud (both of them quoted by\\n\\t\\t\\t\\tTabari) defined tabdhlr as \"spending without a righteous\\n\\t\\t\\t\\tpurpose\" or \"in a frivolous (batil) cause\": and Mujahid\\n\\t\\t\\t\\tis reported (ibid.) to have said, \"If a man were to spend\\n\\t\\t\\t\\tall that he possesses in a righteous cause, it could not\\n\\t\\t\\t\\tbe termed squandering; but if he spends even a small\\n\\t\\t\\t\\tamount in a frivolous cause, it is squandering.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "27",
    "NoteID": "33",
    "Body": "Since squandering - in the sense explained in the preceding\\n\\t\\t\\t\\tnote - implies an utter lack of gratitude for the gift of\\n\\t\\t\\t\\tsustenance bestowed by God upon man, the squanderers are\\n\\t\\t\\t\\tdescribed as being \"of the ilk [lit., \"brethren\"] of the\\n\\t\\t\\t\\tsatans\". Regarding the deeper meaning of the terms\\n\\t\\t\\t\\t\"satans\" and \"satanic\", see surah {15}, note [16]."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "28",
    "NoteID": "34",
    "Body": "I.e., \"because thou art thyself in want, and therefore\\n\\t\\t\\t\\tunable to help others\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "29",
    "NoteID": "35",
    "Body": "A metaphor signifying miserliness and, in particular,\\n\\t\\t\\t\\tunwillingness to help others (cf. a similar expression in\\n\\t\\t\\t\\t 5:64 )."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "31",
    "NoteID": "36",
    "Body": "Historically, this may be a reference to the pre-Islamic\\n\\t\\t\\t\\tArabian custom of burying unwanted female children alive\\n\\t\\t\\t\\t(see note [4] on {81:8-9}, as well as to the occasional -\\n\\t\\t\\t\\tthough much rarer - sacrifices of male children to some\\n\\t\\t\\t\\tof their gods (see Zamakhshari's comments on  6:137 ).\\n\\t\\t\\t\\tBeyond this, however, the above prohibition has a\\n\\t\\t\\t\\ttimeless validity inasmuch as it relates also to\\n\\t\\t\\t\\tabortions undertaken \"for fear of poverty\", i.e., on\\n\\t\\t\\t\\tpurely economic grounds."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "32",
    "NoteID": "37",
    "Body": "Lit., \"do not come near adultery\", thus intensifying the\\n\\t\\t\\t\\tprohibition. It is to be noted that the term zina\\n\\t\\t\\t\\tsignifies all sexual intercourse between a man and a\\n\\t\\t\\t\\twoman who are not husband and wife, irrespective of\\n\\t\\t\\t\\twhether either of them is married to another partner or\\n\\t\\t\\t\\tnot; hence, it denotes both \"adultery\" and \"fornication\"\\n\\t\\t\\t\\tin the English senses of these terms."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "33",
    "NoteID": "38",
    "Body": "I.e., in the execution of a legal sentence or in a just\\n\\t\\t\\t\\twar (see {2: 190} and the corresponding note [167]), or\\n\\t\\t\\t\\tin individual, legitimate self-defence."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "33",
    "NoteID": "39",
    "Body": "This refers to the legal punishment for homicide, termed\\n\\t\\t\\t\\tqisas (\"just retribution\") and explained in {2: 178} and\\n\\t\\t\\t\\tthe corresponding notes. In the present context, the term\\n\\t\\t\\t\\twali (\"protector\" or \"defender of [one's] rights\") is\\n\\t\\t\\t\\tusually taken to mean the heir or next of kin of the\\n\\t\\t\\t\\tvictim. Zamakhshari, however, observes that it may also\\n\\t\\t\\t\\tapply to the government (as-sultan): an interpretation\\n\\t\\t\\t\\twhich is obviously based on the concept of the government\\n\\t\\t\\t\\tas the \"protector\" or \"defender of the rights\" of all its\\n\\t\\t\\t\\tcitizens. As regards the expression qutila mazluman\\n\\t\\t\\t\\t(\"slain wrongfully\"), it is obvious that it refers only\\n\\t\\t\\t\\tto cases of willful homicide, since the concept of zulm\\n\\t\\t\\t\\tapplies in the Qur'an exclusively to intentional and\\n\\t\\t\\t\\tnever to accidental wrongdoing."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "33",
    "NoteID": "40",
    "Body": "Thus, the defender of the victim's rights (in this case,\\n\\t\\t\\t\\ta court of justice) is not only not entitled to impose a\\n\\t\\t\\t\\tcapital sentence on any but the actual murderer or\\n\\t\\t\\t\\tmurderers, but may also, if the case warrants it, concede\\n\\t\\t\\t\\tmitigating circumstances and refrain from capital\\n\\t\\t\\t\\tpunishment altogether."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "33",
    "NoteID": "41",
    "Body": "I.e., he is avenged in this world by the retribution\\n\\t\\t\\t\\texacted from his murderer, and in the life to come,\\n\\t\\t\\t\\tblessed by the special grace which God bestows on all who\\n\\t\\t\\t\\thave been slain without any legal or moral justification\\n\\t\\t\\t\\t(Razi). Some of the commentators, however, relate the\\n\\t\\t\\t\\tpronoun \"he\" to the defender of the victim's rights,\\n\\t\\t\\t\\trespectively, to the latter's heir or next of kin, and\\n\\t\\t\\t\\texplain the above phrase as meaning \"he is sufficiently\\n\\t\\t\\t\\thelped by the law of just retribution (qisas) and\\n\\t\\t\\t\\tshould not, therefore, demand any punishment in excess of\\n\\t\\t\\t\\twhat is equitable\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "34",
    "NoteID": "42",
    "Body": "See surah {6}, note [149]."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "34",
    "NoteID": "43",
    "Body": "Lit., \"every promise shall be asked about\" or\\n\\t\\t\\t\\t\"investigated\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "35",
    "NoteID": "44",
    "Body": "Lit., \"straight\" (mustaqim)-a term which in the Qur'an\\n\\t\\t\\t\\thas invariably a spiritual or moral connotation. Hence,\\n\\t\\t\\t\\tas in the similar phrase in {6: 152}, the above\\n\\t\\t\\t\\tinjunction applies not merely to commercial transactions\\n\\t\\t\\t\\tbut to all dealings between man and man."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "36",
    "NoteID": "45",
    "Body": "Or: \"do not follow [or \"pursue\"] anything...\", etc. This\\n\\t\\t\\t\\twould seem to relate to groundless assertions about\\n\\t\\t\\t\\tevents or people (and hence to slander or false\\n\\t\\t\\t\\ttestimony), to statements based on guesswork unsupported\\n\\t\\t\\t\\tby evidence, or to interfering in social situations which\\n\\t\\t\\t\\tone is unable to evaluate correctly."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "38",
    "NoteID": "46",
    "Body": "According to some commentators, this condemnation refers\\n\\t\\t\\t\\tto what has been mentioned in the preceding two verses;\\n\\t\\t\\t\\tmore probably, however, it extends to the subject-matter\\n\\t\\t\\t\\tof all the prohibitions - whether enunciated as such or\\n\\t\\t\\t\\tmerely implied - in verses {22-37}."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "39",
    "NoteID": "47",
    "Body": "Or: \"which thy Sustainer has revealed to thee\". It is to\\n\\t\\t\\t\\tbe noted that the noun hikmah, usually signifying\\n\\t\\t\\t\\t\"wisdom\", is derived from the verb, hakama (\"he\\n\\t\\t\\t\\tprevented\" or \"restrained [him or it]\", i.e., from acting\\n\\t\\t\\t\\tin an undesirable manner). Hence, the primary meaning of\\n\\t\\t\\t\\thikmah is \"that which prevents one from evil or ignorant\\n\\t\\t\\t\\tbehaviour\" (cf. Lane II, 617); in its positive sense, it\\n\\t\\t\\t\\tsignifies \"[conscious] insight into that which is most\\n\\t\\t\\t\\texcellent\" (Lisan al-'Arab, Taj al-'Arus). Inasmuch as\\n\\t\\t\\t\\tthis term refers here, in particular, to what is \"odious\\n\\t\\t\\t\\tin God's sight\", it implies moral discrimination (or \"the\\n\\t\\t\\t\\tknowledge of right and wrong\") on the part of men; and\\n\\t\\t\\t\\tthis, in its turn, presupposes the existence of an\\n\\t\\t\\t\\tabsolute, God-willed standard of moral values."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "39",
    "NoteID": "48",
    "Body": "Since there is no basis for an acceptance of absolute\\n\\t\\t\\t\\tmoral values - i.e., values that are independent of time\\n\\t\\t\\t\\tand social circumstances - without a belief in God and\\n\\t\\t\\t\\tHis ultimate judgment, the passage ends, as it began,\\n\\t\\t\\t\\twith a call to a cognition of God's oneness and\\n\\t\\t\\t\\tuniqueness."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "40",
    "NoteID": "49",
    "Body": "Lit., \"and taken unto Himself, out of the angels,\\n\\t\\t\\t\\tfemales\": an allusion to the pre-Islamic Arabian belief\\n\\t\\t\\t\\tthat the angels - conceived of as a kind of female\\n\\t\\t\\t\\tsub-deities - were God's \"daughters\", and this despite\\n\\t\\t\\t\\tthe pagan Arabs' contempt for female offspring (cf. {16:\\n\\t\\t\\t\\t57-59} and the corresponding notes). In its wider\\n\\t\\t\\t\\timplication, this rhetorical question is meant to bring\\n\\t\\t\\t\\tout the absurdity of the supposition that God's divinity\\n\\t\\t\\t\\tcould be projected into, or shared by, any other being\\n\\t\\t\\t\\t(cf. {6 :100-101})."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "42",
    "NoteID": "50",
    "Body": "The term 'arsh (lit., \"throne\" or, more properly, \"seat\\n\\t\\t\\t\\tof power\") is used in the Qur'an to denote God's absolute\\n\\t\\t\\t\\tsway over all that exists; hence, the expression dhu\\n\\t\\t\\t\\t'l-'arsh may be suitably rendered as \"He who is enthroned\\n\\t\\t\\t\\tin His almightiness\". Beyond this, the commentators are\\n\\t\\t\\t\\tnot entirely agreed as to the purport of the above\\n\\t\\t\\t\\tsentence. Some take it to mean that \"had there been other\\n\\t\\t\\t\\tdeities apart from God, they would endeavour to deprive\\n\\t\\t\\t\\tHim of some or all of His power, and would thus create\\n\\t\\t\\t\\tchaos in the universe\". Others - and most prominently\\n\\t\\t\\t\\tamong them Tabarl and Ibn Kathlr - have a far better,\\n\\t\\t\\t\\tthough somewhat more complicated explanation to offer.\\n\\t\\t\\t\\tStarting from the legitimate assumption that those who\\n\\t\\t\\t\\tbelieve in the existence of other deities or divine\\n\\t\\t\\t\\tpowers apart from God regard them as no more than\\n\\t\\t\\t\\tmediators between man and Him, the argument runs thus: If\\n\\t\\t\\t\\tthose alleged divine or semi-divine \"mediators\" would\\n\\t\\t\\t\\treally exist, then it is obvious that, being no more than\\n\\t\\t\\t\\tmediators, even they would have to recognize Him as the\\n\\t\\t\\t\\tSupreme Being - which would amount to admitting that they\\n\\t\\t\\t\\thave no power of their own but are, in the last resort,\\n\\t\\t\\t\\tentirely dependent on and subject to Him: and this\\n\\t\\t\\t\\tunavoidable conclusion implies a negation of any divinity\\n\\t\\t\\t\\tin those imaginary \"mediators\". This being so, is it not\\n\\t\\t\\t\\tfar more reasonable for man to turn directly to God, who\\n\\t\\t\\t\\tis almighty, all-seeing, all-hearing, and has therefore\\n\\t\\t\\t\\tno need of any mediator?"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "43",
    "NoteID": "51",
    "Body": "See surah {6}, note [88]."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "44",
    "NoteID": "52",
    "Body": "For an explanation of this expression, see surah {2},\\n\\t\\t\\t\\tnote [20]."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "44",
    "NoteID": "53",
    "Body": "I.e., although everything in creation bears witness to\\n\\t\\t\\t\\tthe existence of a conscious Creative Will, man is only\\n\\t\\t\\t\\ttoo often blind and deaf to this overwhelming evidence of\\n\\t\\t\\t\\tGod's ever-present almightiness."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "45",
    "NoteID": "54",
    "Body": "This passage connects with verse {41} above."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "46",
    "NoteID": "55",
    "Body": "Cf. {6: 25}. See also  2:7  and the corresponding note."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "46",
    "NoteID": "56",
    "Body": "Lit., \"whenever thou dost mention in the Qur'an thy\\n\\t\\t\\t\\tSustainer alone\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "47",
    "NoteID": "57",
    "Body": "I.e., to find fault with the message of the Qur'an."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "51",
    "NoteID": "58",
    "Body": "Lit., \"or any created matter which, in your hearts,\\n\\t\\t\\t\\tappears yet more difficult\" - i.e., even less susceptible\\n\\t\\t\\t\\tof having or receiving life."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "52",
    "NoteID": "59",
    "Body": "Man's life on earth will appear to him \"but as a little\\n\\t\\t\\t\\twhile\" in comparison with the unlimited duration of the\\n\\t\\t\\t\\tlife in the hereafter (Tabari, Zamakhshari). A further\\n\\t\\t\\t\\timplication is that man's concept of \"time\" is earthbound\\n\\t\\t\\t\\tand, hence, has no meaning in the context of ultimate\\n\\t\\t\\t\\treality. The preceding reference to the erstwhile deniers\\n\\t\\t\\t\\tof the possibility of resurrection as \"answering God's\\n\\t\\t\\t\\tcall by praising Him\" implies that as soon as they are\\n\\t\\t\\t\\tresurrected they will become fully aware of His existence\\n\\t\\t\\t\\tand almightiness."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "53",
    "NoteID": "60",
    "Body": "Cf. {16: 125} (and the corresponding note [149]) as well\\n\\t\\t\\t\\tas  29:46 ."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "53",
    "NoteID": "61",
    "Body": "Lit., \"Satan stirs up discord between them\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "54",
    "NoteID": "62",
    "Body": "For my rendering of the term wakil, in this context, as\\n\\t\\t\\t\\t\"one who has the power to determine the fate [of another\\n\\t\\t\\t\\tbeing]\", see note [4] on verse {2} of this surah. An\\n\\t\\t\\t\\talternative, equally acceptable rendering of the above\\n\\t\\t\\t\\tphrase would be, \"We have not sent thee charged with\\n\\t\\t\\t\\tresponsibility for their conduct.\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "55",
    "NoteID": "63",
    "Body": "This seems to be an allusion to the role of Muhammad as\\n\\t\\t\\t\\tthe Last Prophet (Zamakhshari, Baydawi): despite his\\n\\t\\t\\t\\tpersonal inability to \"determine the fate\" of the people\\n\\t\\t\\t\\tto whom he conveyed God's message, that message is\\n\\t\\t\\t\\tdestined to remain alive forever."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "55",
    "NoteID": "64",
    "Body": "I.e., just as David's \"book of divine wisdom\" (the\\n\\t\\t\\t\\tPsalms) had outlived the glory of his earthly kingdom, so\\n\\t\\t\\t\\twill Muhammad's message, the Qur'an, outlive all the\\n\\t\\t\\t\\tchanging fortunes of his followers."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "56",
    "NoteID": "65",
    "Body": "Sc., \"to those who believe in the existence of any divine\\n\\t\\t\\t\\tpower apart from God\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "56",
    "NoteID": "66",
    "Body": "As the sequence shows, this relates to the worship of\\n\\t\\t\\t\\tsaints or angels."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "56",
    "NoteID": "67",
    "Body": "I.e., to transfer it unto themselves: obviously an\\n\\t\\t\\t\\tallusion to the Christian doctrine of \"vicarious\\n\\t\\t\\t\\tatonement\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "57",
    "NoteID": "68",
    "Body": "I.e., the greatest of the prophets, as well as the\\n\\t\\t\\t\\tangels."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "58",
    "NoteID": "69",
    "Body": "I.e., since everything in this world is ephemeral and\\n\\t\\t\\t\\tbound to perish, man ought to be conscious of the life to\\n\\t\\t\\t\\tcome."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "58",
    "NoteID": "70",
    "Body": "Lit., \"in the decree\" - i.e., in accordance with the\\n\\t\\t\\t\\timmutable laws which God has laid down for His creation."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "59",
    "NoteID": "71",
    "Body": "This highly elliptic sentence has a fundamental bearing\\n\\t\\t\\t\\ton the purport of the Qur'an as a whole. In many places\\n\\t\\t\\t\\tthe Qur'an stresses the fact that the Prophet Muhammad,\\n\\t\\t\\t\\tdespite his being the last and greatest of God's\\n\\t\\t\\t\\tapostles, was not empowered to perform miracles similar\\n\\t\\t\\t\\tto those with which the earlier prophets are said to have\\n\\t\\t\\t\\treinforced their verbal messages. His only miracle was\\n\\t\\t\\t\\tand is the Qur'an itself - a message perfect in its\\n\\t\\t\\t\\tlucidity and ethical comprehensiveness, destined for all\\n\\t\\t\\t\\ttimes and all stages of human development, addressed not\\n\\t\\t\\t\\tmerely to the feelings but also to the minds of men, open\\n\\t\\t\\t\\tto everyone, whatever his race or social environment, and\\n\\t\\t\\t\\tbound to remain unchanged forever. Since the earlier\\n\\t\\t\\t\\tprophets invariably appealed to their own community and\\n\\t\\t\\t\\ttheir own time alone, their teachings were, of necessity,\\n\\t\\t\\t\\tcircumscribed by the social and intellectual conditions\\n\\t\\t\\t\\tof that particular community and time; and since the\\n\\t\\t\\t\\tpeople to whom they addressed themselves had not yet\\n\\t\\t\\t\\treached the stage of independent thinking, those prophets\\n\\t\\t\\t\\tstood in need of symbolic portents or miracles (see surah\\n\\t\\t\\t\\t{6}, note [94]) in order to make the people concerned\\n\\t\\t\\t\\trealize the inner truth of their mission. The message of\\n\\t\\t\\t\\tthe Qur'an, on the other hand, was revealed at a time\\n\\t\\t\\t\\twhen mankind (and, in particular, that part of it which\\n\\t\\t\\t\\tinhabited the regions marked by the earlier,\\n\\t\\t\\t\\tJudaeo-Christian religious development) had reached a\\n\\t\\t\\t\\tdegree of maturity which henceforth enabled it to grasp\\n\\t\\t\\t\\tan idealogy as such without the aid of those persuasive\\n\\t\\t\\t\\tportents and miraculous demonstrations which in the past,\\n\\t\\t\\t\\tas the above verse points out, only too often gave rise\\n\\t\\t\\t\\tto new, grave misconceptions."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "59",
    "NoteID": "72",
    "Body": "See the second paragraph of  7:73  and the corresponding\\n\\t\\t\\t\\tnote [57]. Although there is absolutely no indication in\\n\\t\\t\\t\\tthe Qur'an that the she-camel referred to was of\\n\\t\\t\\t\\tmiraculous origin, it was meant to be a test for the\\n\\t\\t\\t\\tpeople of Thamud (cf.  54:27 ), and thus a \"light-giving\\n\\t\\t\\t\\tportent\" (mubsirah)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "60",
    "NoteID": "73",
    "Body": "The vision (ru'ya) mentioned here is the Prophet's\\n\\t\\t\\t\\texperience of the Ascension, preceded by the Night\\n\\t\\t\\t\\tJourney (see Appendix IV). In as much as this experience\\n\\t\\t\\t\\twas and is open to most conflicting interpretations and,\\n\\t\\t\\t\\thence, may give rise to doubts regarding its objective\\n\\t\\t\\t\\treality, it becomes - as stated in the sequence - \"a\\n\\t\\t\\t\\ttrial for men\": the weak of faith and the superficial are\\n\\t\\t\\t\\tshaken in their belief in Muhammad's veracity and, thus,\\n\\t\\t\\t\\tin his prophethood; whereas those who firmly believe in\\n\\t\\t\\t\\tGod see in it an extraordinary evidence of the spiritual\\n\\t\\t\\t\\tgrace which He bestows on His chosen ones, and are,\\n\\t\\t\\t\\ttherefore, strengthened in their faith in the message of\\n\\t\\t\\t\\tthe Qur'an."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "60",
    "NoteID": "74",
    "Body": "As regards \"the tree cursed in this Qur'an\", there is no\\n\\t\\t\\t\\tdoubt that it is the \"tree of deadly fruit\" (shajarat\\n\\t\\t\\t\\taz-zaqqum) spoken of in  37:62  ff. and  44:43  ff. as\\n\\t\\t\\t\\tone of the manifestations of hell (see {37:62-63} and the\\n\\t\\t\\t\\tcorresponding notes [22] and [23], the latter of which\\n\\t\\t\\t\\texplains why this \"tree\" has become \"a trial for men\").\\n\\t\\t\\t\\tIn the above context it is described as \"cursed\" because\\n\\t\\t\\t\\tit obviously symbolizes hell itself. The reason why only\\n\\t\\t\\t\\t\"hell\" - and no other manifestation of the hereafter - is\\n\\t\\t\\t\\tspecifically alluded to here becomes evident in the\\n\\t\\t\\t\\tsubsequent statement that it is meant to convey a\\n\\t\\t\\t\\twarning."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "61",
    "NoteID": "75",
    "Body": "For an explanation of the allegory of Adam and the\\n\\t\\t\\t\\tangels, see {2:30-34}, {7:11-18} and {15:26-41}, as well\\n\\t\\t\\t\\tas the corresponding notes. In the present instance, as\\n\\t\\t\\t\\tin Al-A'raf and Al-Hijr, the accent is on the contempt of\\n\\t\\t\\t\\tIblls for Adam (which is obviously a metonym for the\\n\\t\\t\\t\\twhole human race): hence, this passage apparently\\n\\t\\t\\t\\tconnects with the end of verse {53} above - \"verily, Satan\\n\\t\\t\\t\\tis man's open foe!\" The stress on man's dignity -\\n\\t\\t\\t\\texpressed in God's commandment to the angels to\\n\\t\\t\\t\\t\"prostrate themselves before Adam\" - links this allegory\\n\\t\\t\\t\\twith verses {70-72}."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "62",
    "NoteID": "76",
    "Body": "Cf. {7:16-17}. The verb hanaka denotes, literally, \"he\\n\\t\\t\\t\\tput a rope around the lower jaw (hanak) [of a horse]\",\\n\\t\\t\\t\\ti.e., in order to lead it; hence, the form ihtanaka means\\n\\t\\t\\t\\t\"he made [another being] follow him submissively\" or\\n\\t\\t\\t\\t\"obey him blindly\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "64",
    "NoteID": "77",
    "Body": "This is an idiomatically established metaphor, signifying\\n\\t\\t\\t\\t\"with all thy might\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "64",
    "NoteID": "78",
    "Body": "An allusion to possessions acquired by sinful means or\\n\\t\\t\\t\\tspent on sinful purposes, and to the begetting of\\n\\t\\t\\t\\tchildren through fornication or adultery. (It must,\\n\\t\\t\\t\\thowever, be pointed out that in the ethics and the canon\\n\\t\\t\\t\\tlaw of Islam no moral stigma and no legal disability\\n\\t\\t\\t\\twhatever attaches to the child thus begotten.)"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "64",
    "NoteID": "79",
    "Body": "Cf.  4:120  and the corresponding note [142]."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "65",
    "NoteID": "80",
    "Body": "I.e., \"thou shalt have no real power over them\", as\\n\\t\\t\\t\\tbrought out in  14:22  and  15:42 ."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "68",
    "NoteID": "81",
    "Body": "Lit., \"a stormwind that raises stones\" (Taj al-'Arus,\\n\\t\\t\\t\\tart. hasaba)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "69",
    "NoteID": "82",
    "Body": "Lit., \"therein\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "70",
    "NoteID": "83",
    "Body": "I.e., by bestowing upon them the faculty of conceptual\\n\\t\\t\\t\\tthinking (cf.  2:31  and the corresponding note [23]),\\n\\t\\t\\t\\twhich makes them superior in this respect to all other\\n\\t\\t\\t\\tanimate beings, and even to the angels. By stressing here\\n\\t\\t\\t\\tthis unique distinction of man, the present passage\\n\\t\\t\\t\\tconnects with, and continues the theme of, verse {61}\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "71",
    "NoteID": "84",
    "Body": "Thus Razi interprets the phrase nad'u kulla unasin\\n\\t\\t\\t\\tbi-imamihim (lit., \"We shall summon all human beings by\\n\\t\\t\\t\\t[mentioning] their leaders\" or \"guides\"). In his opinion,\\n\\t\\t\\t\\tthe expression imam (lit., \"leader\" or \"guide\") has in\\n\\t\\t\\t\\tthis context an abstract connotation, signifying the\\n\\t\\t\\t\\tconscious disposition, good or bad, which governs a\\n\\t\\t\\t\\tperson's behaviour and provides the motives for his\\n\\t\\t\\t\\tdeeds. This interpretation is most convincing, and\\n\\t\\t\\t\\tparticularly so in view of the fundamental hadith quoted\\n\\t\\t\\t\\tin my note [32] on  53:39."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "71",
    "NoteID": "85",
    "Body": "A symbolic image, often used in the Qur'an, denoting an\\n\\t\\t\\t\\tacknowledgement of righteousness in the spiritual sense,\\n\\t\\t\\t\\tjust as the \"left hand\" indicates its opposite (cf.\\n\\t\\t\\t\\t 69:19  and {25}, as well as  84:7 )."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "71",
    "NoteID": "86",
    "Body": "This last clause obviously applies to both the righteous\\n\\t\\t\\t\\tand the unrighteous. (For my above rendering of fatil,\\n\\t\\t\\t\\tsee surah {4}, note [67].)"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "72",
    "NoteID": "87",
    "Body": "Cf. {20:124-125}. This passage shows that man's life in\\n\\t\\t\\t\\tthe hereafter is not merely conditioned by the manner of\\n\\t\\t\\t\\this life on earth, but is also an organic extension of\\n\\t\\t\\t\\tthe latter, manifested in a natural development and\\n\\t\\t\\t\\tintensification of previously-existing tendencies."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "73",
    "NoteID": "88",
    "Body": "This relates to an offer of \"compromise\" made by the\\n\\t\\t\\t\\tpagan Quraysh: they demanded of the Prophet that he give\\n\\t\\t\\t\\tsome sort of recognition to their tribal deities and\\n\\t\\t\\t\\tattribute this recognition to God; in return, they\\n\\t\\t\\t\\tpromised to recognize him as a prophet and to make him\\n\\t\\t\\t\\ttheir leader. Naturally, the Prophet rejected this offer."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "74",
    "NoteID": "89",
    "Body": "The implication is that the Prophet's deep faith made it\\n\\t\\t\\t\\timpossible for him to consider anything of this kind."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "75",
    "NoteID": "90",
    "Body": "I.e., \"for having gone astray despite the revelation\\n\\t\\t\\t\\tbestowed on thee by God, and for having, by thy example,\\n\\t\\t\\t\\tled thy followers astray as well\". The purport of the\\n\\t\\t\\t\\tabove passage goes, however, beyond the historical event\\n\\t\\t\\t\\tor events to which it relates: it expresses the idea that\\n\\t\\t\\t\\tany conscious offence against a fundamental truth is an\\n\\t\\t\\t\\tunforgivable sin."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "76",
    "NoteID": "91",
    "Body": "It must be borne in mind that this is a Meccan surah,\\n\\t\\t\\t\\trevealed at a time when the persecution, both physical\\n\\t\\t\\t\\tand moral, which the Prophet and his followers had to\\n\\t\\t\\t\\tsuffer at the hands of the pagan Quraysh reached the peak\\n\\t\\t\\t\\tof its intensity."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "76",
    "NoteID": "92",
    "Body": "Lit., \"after thee\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "76",
    "NoteID": "93",
    "Body": "This prophecy was fulfilled a little over two years\\n\\t\\t\\t\\tlater, in the month of Ramadan, 2 H., when those same\\n\\t\\t\\t\\tleaders of the Quraysh were killed in the battle of Badr."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "77",
    "NoteID": "94",
    "Body": "I.e., the people who drove them away were invariably\\n\\t\\t\\t\\tpunished with destruction."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "78",
    "NoteID": "95",
    "Body": "As is evidenced by the practice (sunnah) of the Prophet,\\n\\t\\t\\t\\tthis verse fully circumscribes the five daily prayers\\n\\t\\t\\t\\tlaid down in Islam as obligatory for every adult man and\\n\\t\\t\\t\\twoman: at dawn (fajr), shortly after the sun passes its\\n\\t\\t\\t\\tzenith (zuhr), in the middle of the afternoon ('asr),\\n\\t\\t\\t\\timmediately after sunset (maghrib), and after the night\\n\\t\\t\\t\\thas fully set in ('isha'). Although parts of the Qur'an\\n\\t\\t\\t\\tshould be recited in every prayer, the early morning\\n\\t\\t\\t\\tprayer is metonymically singled out as the \"recitation\\n\\t\\t\\t\\t(qur'an) at dawn\" because the Prophet, under divine\\n\\t\\t\\t\\tinspiration, used to lengthen his recitation while\\n\\t\\t\\t\\tpraying at that time, thus stressing the special\\n\\t\\t\\t\\tsignificance of this particular prayer. (See next note.)"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "78",
    "NoteID": "96",
    "Body": "Most of the classical commentators take this to mean\\n\\t\\t\\t\\t\"witnessed by the angels of night as well as those of\\n\\t\\t\\t\\tday\", since dawn is the time between night and day. Razi,\\n\\t\\t\\t\\thowever, is of the opinion that the \"witness\" to which\\n\\t\\t\\t\\tthe Qur'an refers here is the spark of God-given\\n\\t\\t\\t\\tillumination in man's own soul - the heightening of his\\n\\t\\t\\t\\tinner perception at the time when the darkness and\\n\\t\\t\\t\\tstillness of night begins to give way to the life-giving\\n\\t\\t\\t\\tlight of day, so that prayer becomes a means of attaining\\n\\t\\t\\t\\tto deeper insight into the realm of spiritual truths and,\\n\\t\\t\\t\\tthus, of achieving communion with all that is holy."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "79",
    "NoteID": "97",
    "Body": "Lit., \"as a deed beyond that which is incumbent on thee\"\\n\\t\\t\\t\\t(nafilatan laka) - i.e., in addition to the five\\n\\t\\t\\t\\tobligatory prayers. Hence, the above is not an injunction\\n\\t\\t\\t\\tbut a recommendation, although the Prophet himself\\n\\t\\t\\t\\tinvariably spent the greater part of the night in prayer."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "82",
    "NoteID": "98",
    "Body": "By \"evildoers\" are meant people who, out of self-conceit\\n\\t\\t\\t\\tor an excessive \"love of this world\", reject out of hand\\n\\t\\t\\t\\tany suggestion of divine guidance - and, with it, any\\n\\t\\t\\t\\tbelief in the existence of absolute moral values - and in\\n\\t\\t\\t\\tthe end, as the sequence shows, fall prey to spiritual\\n\\t\\t\\t\\tnihilism."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "83",
    "NoteID": "99",
    "Body": "Cf. {11: 9-10} and the corresponding notes."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "84",
    "NoteID": "100",
    "Body": "Lit., \"as to who is best guided on a path\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "85",
    "NoteID": "101",
    "Body": "For this interpretation of the term ruh, see surah {16}, note [2]. Some commentators are of the opinion that it refers here, specifically, to the revelation of the Qur'an; others understand by it the \"soul\", in particular the soul of man. This latter interpretation is, however, unconvincing in as much as the preceding as well as the subsequent verses relate explicitly to the Qur'an and, hence, to the phenomenon of divine revelation."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "86",
    "NoteID": "102",
    "Body": "Lit., \"to be thy guardian against [or \"before\"] Us\" -\\n\\t\\t\\t\\ti.e., \"to provide thee with other means of guidance\": an\\n\\t\\t\\t\\tallusion to the fact that divine guidance is the only\\n\\t\\t\\t\\tsource of ethics in the absolute sense of this word. The\\n\\t\\t\\t\\t\"taking away\" of revelation denotes its alienation from\\n\\t\\t\\t\\tthe hearts and the memory of men, as well as its\\n\\t\\t\\t\\tdisappearance in written form."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "88",
    "NoteID": "103",
    "Body": "See Appendix III."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "89",
    "NoteID": "104",
    "Body": "According to Raghib, the noun mathal (lit., \"similitude\",\\n\\t\\t\\t\\t\"parable\" or \"example\") is here more or less synonymous\\n\\t\\t\\t\\twith wasf (\"description by means of a comparison\", i.e.,\\n\\t\\t\\t\\t\"definition\"). In its broadest sense, this term signifies\\n\\t\\t\\t\\t\"a lesson\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "89",
    "NoteID": "105",
    "Body": "I.e., they are unwilling to accept any idea which runs\\n\\t\\t\\t\\tcounter to their own, blasphemous inclinations."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "90",
    "NoteID": "106",
    "Body": "I.e., like Moses (cf.  2:60 )."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "91",
    "NoteID": "107",
    "Body": "This seems to be a derisory allusion to the allegory of\\n\\t\\t\\t\\tparadise so often mentioned in the Qur'an."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "92",
    "NoteID": "108",
    "Body": "Lit., \"claimed\": possibly a reference to the warning\\n\\t\\t\\t\\texpressed in {34: 9}, which was revealed somewhat earlier\\n\\t\\t\\t\\tthan the present surah."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "93",
    "NoteID": "109",
    "Body": "A reply to this demand of the unbelievers is found in verse {7} of Al-An'am, revealed - according to Suyuti - shortly after the present surah. But the allusion to, this and the preceding \"conditions\" is not merely historical: it illustrates a widely prevalent, psychologically contradictory attitude of mind - a strange mixture of prima-facie scepticism and primitive credulity which makes belief in a prophetic message dependent on the prophet's \"performing miracles\" (cf. 6:37 and {109} and 7:203). Since the only miracle granted by God to Muhammad is the Qur'an itself (see the first part of verse {59} of this surah, as well as note [71] above), he is bidden, in the next passage, to declare that these demands are irrelevant and, by implication, frivolous."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "93",
    "NoteID": "110",
    "Body": "I.e., \"miracles are in the power of God alone\" (cf.\\n\\t\\t\\t\\t 6:109  and the corresponding note [94])."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "94",
    "NoteID": "111",
    "Body": "Lit., \"save that they said\". The verb qala (as also the\\n\\t\\t\\t\\tnoun qawl) is often used tropically in the sense of\\n\\t\\t\\t\\tholding or asserting an opinion or a belief; in the above\\n\\t\\t\\t\\tcase it obviously implies a conceptual objection."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "97",
    "NoteID": "112",
    "Body": "The phrase \"for them\" is meant, I believe, to stress the individual character of the suffering allegorized in the Qur'an as a \"blazing flame\" (sa'ir). For a further discussion of this terminology and its philosophical implications, see Appendix I."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "98",
    "NoteID": "113",
    "Body": "Implying that this denial of God's power to resurrect the\\n\\t\\t\\t\\tdead (mentioned in exactly the same phrasing in verse\\n\\t\\t\\t\\t{49} of this surah) is equivalent to a denial of His\\n\\t\\t\\t\\talmightiness and, hence, of His Being - all of which is\\n\\t\\t\\t\\tcharacterized by the words \"blind and deaf and dumb\" in\\n\\t\\t\\t\\tthe preceding verse."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "99",
    "NoteID": "114",
    "Body": "Lit., \"to create the like of them\" - i.e., to resurrect\\n\\t\\t\\t\\tthem individually, each of them having the same identity\\n\\t\\t\\t\\t(or \"likeness\") which he or she had before death."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "99",
    "NoteID": "115",
    "Body": "Lit., \"a term (ajal) for them\". Since ajal denotes,\\n\\t\\t\\t\\tprimarily, \"a specified term [at which something falls\\n\\t\\t\\t\\tdue]\", it obviously relates here to the inescapable fact\\n\\t\\t\\t\\tof resurrection."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "99",
    "NoteID": "116",
    "Body": "See notes [98] and [105] above."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "100",
    "NoteID": "117",
    "Body": "Lit., \"grace\" (rahmah)."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "100",
    "NoteID": "118",
    "Body": "I.e., since man is, by his very nature, dependent on\\n\\t\\t\\t\\tmaterial possessions, he instinctively tries to hold on\\n\\t\\t\\t\\tto them; God, on the other hand, is self-sufficient and,\\n\\t\\t\\t\\ttherefore, above all need of placing any limits on His\\n\\t\\t\\t\\tbestowal of bounty (hence my interpolation). This implied\\n\\t\\t\\t\\treference to God's grace and bounty is necessitated by\\n\\t\\t\\t\\tthe emphasis, in the preceding as well as in the\\n\\t\\t\\t\\tsubsequent passages, on the fact that He has never ceased\\n\\t\\t\\t\\tto guide man, through His prophets, towards the good\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "101",
    "NoteID": "119",
    "Body": "Some of the commentators assume that this is an allusion\\n\\t\\t\\t\\tto the miracles performed by Moses, while others (relying\\n\\t\\t\\t\\ton a Tradition quoted in the compilations of Nasa'i, Ibn\\n\\t\\t\\t\\tHanbal, Bayhaqi, Ibn Majah and Tabarani) see in it a\\n\\t\\t\\t\\treference to nine specific commandments or ethical\\n\\t\\t\\t\\tprinciples, the foremost of them being a stress on God's\\n\\t\\t\\t\\toneness and uniqueness. In my opinion, however, the\\n\\t\\t\\t\\tnumber \"nine\" may be no more than a metonym for\\n\\t\\t\\t\\t\"several\", just as the numbers \"seven\" and \"seventy\" are\\n\\t\\t\\t\\toften used in classical Arabic to denote \"several\" or\\n\\t\\t\\t\\t\"many\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "101",
    "NoteID": "120",
    "Body": "I.e., of the present time. The whole phrase has this\\n\\t\\t\\t\\tmeaning: \"Ask them about what the Qur'an tells us in this\\n\\t\\t\\t\\trespect, and they will be bound to confirm it on the\\n\\t\\t\\t\\tbasis of their own scriptures.\" This \"confirmation\"\\n\\t\\t\\t\\tapparently relates to what is said in verse {104},\\n\\t\\t\\t\\texplaining why the story of Moses and Pharaoh has been\\n\\t\\t\\t\\tmentioned in the present context. (The story as such\\n\\t\\t\\t\\tappears in greater detail in {7:103-137} and {20:49-79}.)"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "101",
    "NoteID": "121",
    "Body": "Cf. {7:105} - \"let the children of Israel go with me!\""
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "101",
    "NoteID": "122",
    "Body": "Or: \"that thou art bewitched\". However, my rendering is\\n\\t\\t\\t\\tbased on Tabari's interpretation of the passive\\n\\t\\t\\t\\tparticiple mashur, which I consider preferable in view of\\n\\t\\t\\t\\tthe subsequent reference to the miraculous signs granted\\n\\t\\t\\t\\tby God to Moses."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "102",
    "NoteID": "123",
    "Body": "See surah {6}, note [94]."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "103",
    "NoteID": "124",
    "Body": "See surah {7}, note [100]."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "104",
    "NoteID": "125",
    "Body": "According to Razi, the expression lafif denotes a human\\n\\t\\t\\t\\tcrowd composed of innumerable heterogeneous elements,\\n\\t\\t\\t\\tgood and bad, strong and weak, fortunate and unfortunate:\\n\\t\\t\\t\\tin short, it characterizes mankind in all its aspects. It\\n\\t\\t\\t\\tis obviously used here to refute, once again, the idea\\n\\t\\t\\t\\tthat the children of Israel are a \"chosen people\" by\\n\\t\\t\\t\\tvirtue of their Abrahamic descent and, therefore, a\\n\\t\\t\\t\\tpriori and invariably destined for God's grace. The\\n\\t\\t\\t\\tQur'an rejects this claim by stating that on Resurrection\\n\\t\\t\\t\\tDay all mankind will be judged, and none will have a\\n\\t\\t\\t\\tprivileged position."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "105",
    "NoteID": "126",
    "Body": "Lit., \"with truth\" or \"in truth\"."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "105",
    "NoteID": "127",
    "Body": "I.e., it has come down to man, through the Prophet,\\n\\t\\t\\t\\twithout any alteration, omission or addition."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "106",
    "NoteID": "128",
    "Body": "Lit., \"which We have divided into [consecutive] parts\"\\n\\t\\t\\t\\tor, according to some authorities (quoted by Razi), \"set\\n\\t\\t\\t\\tforth with clarity\". The rendering adopted by me allows\\n\\t\\t\\t\\tfor both these meanings."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "106",
    "NoteID": "129",
    "Body": "The above verse alludes both to the historical fact that\\n\\t\\t\\t\\tthe process of the revelation of the Qur'an was gradual,\\n\\t\\t\\t\\textending over the twenty-three years of the Prophet's\\n\\t\\t\\t\\tministry, and to the fact that it is nevertheless one\\n\\t\\t\\t\\tintegral whole and can, therefore, be properly understood\\n\\t\\t\\t\\tonly if it is considered in its entirety - that is to\\n\\t\\t\\t\\tsay, if each of its passages is read in the light of all\\n\\t\\t\\t\\tthe other passages which it contains. (See also  20:114 \\n\\t\\t\\t\\tand the corresponding note [101].)"
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "107",
    "NoteID": "130",
    "Body": "Lit., \"before it\" - i.e., before the Qur'an as such has\\n\\t\\t\\t\\tcome within their ken."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "108",
    "NoteID": "131",
    "Body": "This may be an allusion to the many Biblical predictions\\n\\t\\t\\t\\tof the advent of the Prophet Muhammad, especially to\\n\\t\\t\\t\\tDeuteronomy xviii, 15 and 18 (cf. surah {2}, note [33]).\\n\\t\\t\\t\\tIn its wider sense, however, the \"fulfilment of God's\\n\\t\\t\\t\\tpromise\" relates to His bestowal of a definitive\\n\\t\\t\\t\\trevelation, the Qur'an, henceforth destined to guide man\\n\\t\\t\\t\\tat all stages of his spiritual, cultural and social\\n\\t\\t\\t\\tdevelopment."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "110",
    "NoteID": "132",
    "Body": "For an explanation of the expression al-asma' al-husna\\n\\t\\t\\t\\t(lit., \"the most perfect [or \"most goodly\"] names\"), see\\n\\t\\t\\t\\tsurah {7}, note [145]. The epithet ar-rahman - rendered\\n\\t\\t\\t\\tby me throughout as \"the Most Gracious\"- has an intensive\\n\\t\\t\\t\\tsignificance, denoting the unconditional, all-embracing\\n\\t\\t\\t\\tquality and exercise of grace and mercy, and is applied\\n\\t\\t\\t\\texclusively to God, \"who has willed upon Himself the law\\n\\t\\t\\t\\tof grace and mercy\" ({6 :12} and {54})."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "111",
    "NoteID": "133",
    "Body": "Lit., \"who has not taken unto Himself [or \"begotten\"] a\\n\\t\\t\\t\\tson\" - i.e., who is free of the imperfection inherent in\\n\\t\\t\\t\\tthe concept of begetting a child as an extension of one's\\n\\t\\t\\t\\town being. Since this statement not merely refutes the\\n\\t\\t\\t\\tChristian doctrine of Jesus as \"the son of God\" but,\\n\\t\\t\\t\\tbeyond that, stresses the logical impossibility of\\n\\t\\t\\t\\tconnecting such a concept with God, the clause is best\\n\\t\\t\\t\\trendered in the present tense, and the noun walad in its\\n\\t\\t\\t\\tprimary sense of \"offspring\", which applies to a child of\\n\\t\\t\\t\\teither sex."
  },
  {
    "SurahNumber": "17",
    "AyahNumber": "111",
    "NoteID": "134",
    "Body": "Lit., \"and has no protector [to aid Him] on account of\\n\\t\\t\\t\\tany [supposed] weakness [on His part]\"."
  }
]
