[
  {
    "SurahNumber": "89",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "The \"daybreak\" (fajr) apparently symbolises man's\\n\\t\\t\\t\\tspiritual awakening; hence, the \"ten nights\" is an\\n\\t\\t\\t\\tallusion to the last third of the month of Ramadan, in\\n\\t\\t\\t\\tthe year 13 before the hijrah, during which Muhammad\\n\\t\\t\\t\\treceived his first revelation (see introductory note to\\n\\t\\t\\t\\tsurah {96}) and was thus enabled to contribute to\\n\\t\\t\\t\\tmankind's spiritual awakening."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Lit., \"the even and the odd\" or \"the one\": i.e., the\\n\\t\\t\\t\\tmultiplicity of creation as contrasted with the oneness\\n\\t\\t\\t\\tand uniqueness of the Creator (Baghawi, on the authority\\n\\t\\t\\t\\tof Sa'id ibn al-Khudri, as well as Tabari in one of his\\n\\t\\t\\t\\talternative interpretations of the above phrase). The\\n\\t\\t\\t\\tconcept of the \"even number\" implies the existence of\\n\\t\\t\\t\\tmore than one of the same kind: in other words, it\\n\\t\\t\\t\\tsignifies every thing that has a counterpart or\\n\\t\\t\\t\\tcounterparts and, hence, a definite relationship with\\n\\t\\t\\t\\tother things (cf. the term azwaj in  36:36 , referring to\\n\\t\\t\\t\\tthe polarity evident in all creation). As against this,\\n\\t\\t\\t\\tthe term al-watr - or, in the more common (Najdi)\\n\\t\\t\\t\\tspelling, al-witr - primarily denotes \"that which is\\n\\t\\t\\t\\tsingle\" or \"one\" and is, hence, one of the designations\\n\\t\\t\\t\\tgiven to God - since \"there is nothing that could be\\n\\t\\t\\t\\tcompared with Him\" (112:4) and \"nothing like unto Him\"\\n\\t\\t\\t\\t( 42:11 )."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "An allusion to the night of spiritual darkness which is\\n\\t\\t\\t\\tbound to \"run its course\" - i.e., to disappear - as soon\\n\\t\\t\\t\\tas man becomes truly conscious of God."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "Lit., \"a [more] solemn affirmation\" (qasam): i.e., a\\n\\t\\t\\t\\tconvincing evidence of the existence and oneness of God."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "See {7:65-72}, and particularly the second half of note\\n\\t\\t\\t\\t[48] on  7:65 . Iram, mentioned in the next verse, seems\\n\\t\\t\\t\\tto have been the name of their legendary capital, now\\n\\t\\t\\t\\tcovered by the sands of the desert of Al-Ahqaf."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "9",
    "NoteID": "6",
    "Body": "See surah {7}, notes [56] and [59]. The \"valley\" referred\\n\\t\\t\\t\\tto in the sequence is the Wadi 'l-Qura, situated north of\\n\\t\\t\\t\\tMedina on the ancient caravan route from South Arabia to\\n\\t\\t\\t\\tSyria."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "10",
    "NoteID": "7",
    "Body": "For an explanation of this epithet, see surah {38}, note\\n\\t\\t\\t\\t[17]."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "15",
    "NoteID": "8",
    "Body": "The above phrase, introduced by the particle fa-amma\\n\\t\\t\\t\\t(\"But as for...\"), obviously connects with the reference\\n\\t\\t\\t\\tto the \"solemn evidence of the truth\" in verse {5} -\\n\\t\\t\\t\\timplying that man does not, as a rule, bethink himself of\\n\\t\\t\\t\\tthe hereafter, being concerned only with this world and\\n\\t\\t\\t\\twhat promises to be of immediate advantage to him\\n\\t\\t\\t\\t(Zamakhshari, Razi, Baydawi)."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "15",
    "NoteID": "9",
    "Body": "I.e., he regards God's bounty as something due to him\\n\\t\\t\\t\\t(Razi)."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "16",
    "NoteID": "10",
    "Body": "I.e., he regards the absence or loss of affluence not as\\n\\t\\t\\t\\ta trial, but as an evidence of divine \"injustice\" -\\n\\t\\t\\t\\twhich, in its turn, may lead to a denial of God's\\n\\t\\t\\t\\texistence."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "18",
    "NoteID": "11",
    "Body": "I.e., \"you feel no urge to feed the needy\" (cf.  107:3 )."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "22",
    "NoteID": "12",
    "Body": "Lit., \"[when] thy Sustainer comes\", which almost all of\\n\\t\\t\\t\\tthe classical commentators understand as the revelation\\n\\t\\t\\t\\t(in the abstract sense of this word) of God's\\n\\t\\t\\t\\ttranscendental majesty and the manifestation of His\\n\\t\\t\\t\\tjudgment."
  },
  {
    "SurahNumber": "89",
    "AyahNumber": "26",
    "NoteID": "13",
    "Body": "See note [7] on {73:12-13}."
  }
]
