[
  {
    "SurahNumber": "50",
    "AyahNumber": "1",
    "Text": "Qaf. By the Glorious Qur'an (O Muhammad you are the Rasool of\\n\\t\\t\\tAllah)."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "2",
    "Text": "But they wonder that there has come to them a Warner from among\\n\\t\\t\\tthemselves. So the unbelievers say: \"This is a indeed very\\n\\t\\t\\tstrange"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "3",
    "Text": "that after we are dead and have become dust we shall be raised to\\n\\t\\t\\tlife again, such a return is far from reason.\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "4",
    "Text": "We know all that the earth consumes of their bodies, and We have\\n\\t\\t\\ta Book which keeps records of everything."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "5",
    "Text": "Nay! But these people deny the truth when it comes to them, and\\n\\t\\t\\tthey are confused."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "6",
    "Text": "Have they never looked at the sky above them, and marked how We\\n\\t\\t\\thave made it and adorned it, and there are no flaws in it?"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "7",
    "Text": "And the earth, how We have spread it out and set upon it\\n\\t\\t\\tmountains and caused to grow in it every kind of beautiful\\n\\t\\t\\tvegetation."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "8",
    "Text": "All these things are eye-openers and a reminder for every servant\\n\\t\\t\\treturning to Allah."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "9",
    "Text": "We send down blessed water from the sky with which We bring forth\\n\\t\\t\\tgardens and the harvest grain,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "10",
    "Text": "and tall palm trees laden with clusters of dates, piled one over\\n\\t\\t\\tanother,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "11",
    "Text": "a sustenance for the servants; thereby giving new life to dead\\n\\t\\t\\tland. That is how the resurrection will be of the dead from the\\n\\t\\t\\tearth."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "12",
    "Text": "Before, the people of Nuh and the dwellers of Ar-Rass denied this\\n\\t\\t\\ttruth and so did Thamud,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "13",
    "Text": "`Ad, Fir'on (Pharaoh) and the brethren of Lut,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "14",
    "Text": "the dwellers of the Al-Aiykah and the people of Tubba; all of\\n\\t\\t\\tthem disbelieved their Rasools and thus brought down upon them My\\n\\t\\t\\tthreatened scourge."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "15",
    "Text": "Were We fatigued with the first creation that they are in doubt\\n\\t\\t\\tabout a new creation?"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "16",
    "Text": "We created man, We know the prompting of his soul, and We are\\n\\t\\t\\tcloser to him than his jugular vein."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "17",
    "Text": "Besides this direct knowledge ,We have assigned to every one two\\n\\t\\t\\tscribes (guardian angels), the one seated on his right and the\\n\\t\\t\\tother on his left,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "18",
    "Text": "not a single word does he utter but there is a vigilant guardian\\n\\t\\t\\tready to note it down."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "19",
    "Text": "When the agony of death will bring the truth before his eyes,\\n\\t\\t\\tthey will say: \"This is what you were trying to escape!\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "20",
    "Text": "And the Trumpet shall be blown; that will be the Day of which you\\n\\t\\t\\twere threatened!"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "21",
    "Text": "Each soul will come forth; with it there will be a an angel to\\n\\t\\t\\tdrive and an angel to bear witness."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "22",
    "Text": "It will be said: \"You were heedless of this, but now We have\\n\\t\\t\\tremoved your veil, so your eyesight is sharp today!\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "23",
    "Text": "His companion will say: \"Here is my testimony ready with me.\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "24",
    "Text": "The sentence will be: \"Throw into hell every stubborn\\n\\t\\t\\tdisbeliever,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "25",
    "Text": "every opponent of good, and every doubting transgressor"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "26",
    "Text": "who set up other gods besides Allah. Throw him into severe\\n\\t\\t\\tpunishment.\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "27",
    "Text": "His companion will say: \"Our Rabb! I did not mislead him. He\\n\\t\\t\\thimself had gone far astray.\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "28",
    "Text": "Allah will say: \"Do not dispute with each other in My presence. I\\n\\t\\t\\tgave you warning beforehand."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "29",
    "Text": "My words cannot be changed, nor am I unjust to My servants.\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "30",
    "Text": "On that Day, We shall ask hell: \"Are you full?\" And hell will\\n\\t\\t\\tanswer: \"Are there any more?\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "31",
    "Text": "Paradise shall be brought close to the righteous, which will be\\n\\t\\t\\tno more a thing distant,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "32",
    "Text": "and it will be said: \"Here is what you were promised. It is for\\n\\t\\t\\tevery penitent faithful person,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "33",
    "Text": "who feared the Compassionate (Allah) without seeing Him and come\\n\\t\\t\\tbefore Him with a devoted heart.\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "34",
    "Text": "Allah will say: \"Enter it in peace; this is the Day of Eternal\\n\\t\\t\\tLife!\""
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "35",
    "Text": "There they shall have all that they wish, and We shall have yet\\n\\t\\t\\tmore to give."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "36",
    "Text": "How many generations, far stronger in power, have We destroyed\\n\\t\\t\\tbefore them! They searched the entire land: but could they find\\n\\t\\t\\tany refuge?"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "37",
    "Text": "Surely in this there is a lesson for every person who has a\\n\\t\\t\\theart, and can hear and witness."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "38",
    "Text": "We created the heavens and the earth and all that lies between\\n\\t\\t\\tthem in six periods, and no fatigue touched Us."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "39",
    "Text": "Therefore, O Prophet, bear with them in patience whatever they\\n\\t\\t\\tsay, and keep on glorifying your Rabb before sunrise and before\\n\\t\\t\\tsunset."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "40",
    "Text": "And glorify Him during a part of the night and after the\\n\\t\\t\\tprostration (prayers)."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "41",
    "Text": "And listen! The Day when the Caller will call out from a place\\n\\t\\t\\tquite near,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "42",
    "Text": "the Day when the people will hear the mighty blast in reality;\\n\\t\\t\\tthat will be the Day of coming forth (the dead will rise from\\n\\t\\t\\ttheir graves)."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "43",
    "Text": "Surely it is We Who give life and death; and to Us shall all\\n\\t\\t\\treturn,"
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "44",
    "Text": "on that Day when the earth shall split asunder and the people\\n\\t\\t\\tshall be rushing out of it; that gathering them together shall be\\n\\t\\t\\tquite easy for Us."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "45",
    "Text": "We know very well what these unbelievers say. You (O Muhammad)\\n\\t\\t\\tare not there to compel them to believe. So admonish with this\\n\\t\\t\\tQur'an every such person who fears My warning."
  }
]
