[
  {
    "SurahNumber": "53",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Or: \"Consider the star when it sets\" - an interpretation\\n\\t\\t\\t\\twhich for some reason has the preference of the majority\\n\\t\\t\\t\\tof the commentators. However, almost all of them admit\\n\\t\\t\\t\\tthat the term najm - derived from the verb najama, \"it\\n\\t\\t\\t\\tappeared\", \"began\", \"ensued\", or \"proceeded\" denotes also\\n\\t\\t\\t\\tthe \"unfolding\" of something that comes or appears\\n\\t\\t\\t\\tgradually, as if by instalments. Hence, this term has\\n\\t\\t\\t\\tfrom the very beginning been applied to each of the\\n\\t\\t\\t\\tgradually-revealed parts (nujum) of the Qur'an and, thus,\\n\\t\\t\\t\\tto the process of its gradual revelation, or its\\n\\t\\t\\t\\t\"unfolding\", as such. This was, in fact, the\\n\\t\\t\\t\\tinterpretation of the above verse given by 'Abd Allah\\n\\t\\t\\t\\tibn'Abbas (as quoted by Tabari); in view of the sequence,\\n\\t\\t\\t\\tthis interpretation is regarded as fully justified by\\n\\t\\t\\t\\tRaghib, Zamakhshari, Razi, Baydawi, Ibn Kathir and other\\n\\t\\t\\t\\tauthorities. Raghib and Ibn Kathir, in particular, point\\n\\t\\t\\t\\tto the phrase mawaqi' an-nujum in  56:75 , which\\n\\t\\t\\t\\tundoubtedly refers to the step-by-step revelation of the\\n\\t\\t\\t\\tQur'an. - As regards my rendering of the adjective\\n\\t\\t\\t\\tparticle wa as \"Consider\", see surah {74}, note [23]."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "See note [150] on  7:184 ."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "I.e., the Angel of Revelation, Gabriel."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "Cf.  81:23  and the corresponding note [8]. According to\\n\\t\\t\\t\\tthe Qur'an and the testimony of authentic Traditions, the\\n\\t\\t\\t\\tProphet had no more than twice in his lifetime a vision\\n\\t\\t\\t\\tof this angelic force \"manifested in its true shape and\\n\\t\\t\\t\\tnature\" (which, as pointed out by Zamakhshari, is the\\n\\t\\t\\t\\tmeaning of the expression istawa in this context): once\\n\\t\\t\\t\\tafter the period called fatrat al-wahy (see introductory\\n\\t\\t\\t\\tnote to surah {74}), and another time, as alluded to in\\n\\t\\t\\t\\tverses {13-18}, in the course of his mystic vision known\\n\\t\\t\\t\\tas the \"Ascension\" (see Appendix IV)."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "9",
    "NoteID": "5",
    "Body": "This graphic \"description\" of the angel's approach, based\\n\\t\\t\\t\\ton an Arabian figure of speech, is meant to convey the\\n\\t\\t\\t\\tidea that the Angel of Revelation became a clearly\\n\\t\\t\\t\\tperceptible, almost tangible, presence."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "10",
    "NoteID": "6",
    "Body": "Lit., \"whatever He revealed\": an allusion to the\\n\\t\\t\\t\\texceptional manifestation of the angel \"in his true shape\\n\\t\\t\\t\\tand nature\" as well as to the contents of divine\\n\\t\\t\\t\\trevelation as such. In its deeper sense the above phrase\\n\\t\\t\\t\\timplies that even to His chosen prophets God does not\\n\\t\\t\\t\\tentirely unveil the ultimate mysteries of existence, of\\n\\t\\t\\t\\tlife and death, of the purpose for which He has created\\n\\t\\t\\t\\tthe universe, or of the nature of the universe itself."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "11",
    "NoteID": "7",
    "Body": "Inasmuch as the Prophet was fully aware of the spiritual\\n\\t\\t\\t\\tcharacter of his experience, there was no conflict\\n\\t\\t\\t\\tbetween his conscious mind and his intuitive perception\\n\\t\\t\\t\\t(the \"vision of the heart\") of what is normally not\\n\\t\\t\\t\\tperceptible."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "12",
    "NoteID": "8",
    "Body": "Thus the Qur'an makes it clear that the Prophet's vision\\n\\t\\t\\t\\tof the angel was not a delusion but a true spiritual\\n\\t\\t\\t\\texperience: but precisely because it was purely spiritual\\n\\t\\t\\t\\tin nature, it could be conveyed to others only by means\\n\\t\\t\\t\\tof symbols and allegories, which sceptics all too readily\\n\\t\\t\\t\\tdismiss as fancies, \"contending with him as to what he\\n\\t\\t\\t\\tsaw\"."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "13",
    "NoteID": "9",
    "Body": "I.e., he saw the angel \"manifested in his true shape and\\n\\t\\t\\t\\tnature\"."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "14",
    "NoteID": "10",
    "Body": "I.e., on the occasion of his mystic experience of the\\n\\t\\t\\t\\t\"Ascension\" (mi'raj). Explaining the vision conveyed in\\n\\t\\t\\t\\tthe expression sidrat al-muntaha, Raghib suggests that\\n\\t\\t\\t\\towing to the abundance of its leafy shade, the sidr or\\n\\t\\t\\t\\tsidrah (the Arabian lote-tree) appears in the Qur'an as\\n\\t\\t\\t\\twell as in the Traditions relating to the Ascension as a\\n\\t\\t\\t\\tsymbol of the \"shade\" - i.e., the spiritual peace and\\n\\t\\t\\t\\tfulfilment - of paradise. One may assume that the\\n\\t\\t\\t\\tqualifying term al-muntaha (\"of the utmost [or\\n\\t\\t\\t\\t\"farthest\"] limit\") is indicative of the fact that God\\n\\t\\t\\t\\thas set a definite limit to all knowledge accessible to\\n\\t\\t\\t\\tcreated beings, as pointed out in the Nihayah: implying,\\n\\t\\t\\t\\tin particular, that human knowledge, though potentially\\n\\t\\t\\t\\tvast and penetrating, can never - not even in paradise\\n\\t\\t\\t\\t(the \"garden of promise\" mentioned in the next verse) -\\n\\t\\t\\t\\tattain to an understanding of the ultimate reality, which\\n\\t\\t\\t\\tthe Creator has reserved for Himself (cf. note [6]\\n\\t\\t\\t\\tabove)."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "16",
    "NoteID": "11",
    "Body": "Lit., \"when the lote-tree was veiled with whatever veiled\\n\\t\\t\\t\\t[it]\": a phrase deliberately vague (mubham), indicative\\n\\t\\t\\t\\tof the inconceivable majesty and splendour attaching to\\n\\t\\t\\t\\tthis symbol of paradise \"which no description can picture\\n\\t\\t\\t\\tand no definition can embrace\" (Zamakhshari)."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "18",
    "NoteID": "12",
    "Body": "Lit., \"[some] of the greatest of his Sustainer's symbols\\n\\t\\t\\t\\t(ayat)\" For this specific rendering of the term ayah, see\\n\\t\\t\\t\\tnote [2] on  17:1 , which refers to the same mystic\\n\\t\\t\\t\\texperience, namely, the Ascension. In both these Qur'anic\\n\\t\\t\\t\\tallusions the Prophet is said to have been \"made to see\"\\n\\t\\t\\t\\t(i.e., given to understand) some, but not all, of the\\n\\t\\t\\t\\tultimate truths (cf. also {7:187-188}); and this, too,\\n\\t\\t\\t\\tserves to explain the idea expressed in verse {10} above."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "20",
    "NoteID": "13",
    "Body": "After pointing out that the Prophet was granted true\\n\\t\\t\\t\\tinsight into some of the most profound verities, the\\n\\t\\t\\t\\tOur'an draws our attention to the \"false symbols\" which\\n\\t\\t\\t\\tmen so often choose to invest with divine qualities or\\n\\t\\t\\t\\tpowers: in this instance - by way of example - to the\\n\\t\\t\\t\\tblasphemous imagery of the Prophet's pagan contemporaries\\n\\t\\t\\t\\tepitomized in the triad of Al-Lat, Manat and Al-Uzza.\\n\\t\\t\\t\\tThese three goddesses - regarded by the pagan Arabs as\\n\\t\\t\\t\\t\"God's daughters\" side by side with the angels (who, too,\\n\\t\\t\\t\\twere conceived of as females) - were worshipped in most\\n\\t\\t\\t\\tof pre-Islamic Arabia, and had several shrines in the\\n\\t\\t\\t\\tHijaz and in Najd. The worship of Al-Lat was particularly\\n\\t\\t\\t\\tancient and almost certainly of South-Arabian origin; she\\n\\t\\t\\t\\tmay have been the prototype of the Greek semi-goddess\\n\\t\\t\\t\\tLeto, one of the wives of Zeus and mother of Apollo and\\n\\t\\t\\t\\tArtemis."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "21",
    "NoteID": "14",
    "Body": "In view of the contempt which the pagan Arabs felt for\\n\\t\\t\\t\\ttheir female offspring (cf. {16: 57-59} and {62}, as well\\n\\t\\t\\t\\tas the corresponding notes), their attribution of\\n\\t\\t\\t\\t\"daughters\" to God was particularly absurd and\\n\\t\\t\\t\\tself-contradictory: for, quite apart from the blasphemous\\n\\t\\t\\t\\tbelief in God's having \"offspring\" of any kind, their\\n\\t\\t\\t\\tascribing to Him what they themselves despised gave the\\n\\t\\t\\t\\tlie to their alleged \"reverence\" for Him whom they, too,\\n\\t\\t\\t\\tregarded as the Supreme Being - a point which is stressed\\n\\t\\t\\t\\twith irony in the next sentence."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "23",
    "NoteID": "15",
    "Body": "Cf.  12:40 ."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "23",
    "NoteID": "16",
    "Body": "An allusion to the pagan idea that those goddesses, as\\n\\t\\t\\t\\twell as the angels, would act as \"mediators\" between\\n\\t\\t\\t\\ttheir worshippers and God: a wishful idea which lingers\\n\\t\\t\\t\\ton even among adherents of higher religions in the guise\\n\\t\\t\\t\\tof a veneration of saints and deified persons."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "24",
    "NoteID": "17",
    "Body": "Lit., \"Is it for man to have . ..\", etc."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "25",
    "NoteID": "18",
    "Body": "I.e., despite the fact (which is the meaning of the\\n\\t\\t\\t\\tparticle fa in this context) that God is omnipotent and\\n\\t\\t\\t\\tomniscient and does not, therefore, require any\\n\\t\\t\\t\\t\"mediator\" between Himself and His creatures."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "26",
    "NoteID": "19",
    "Body": "For an explanation of the Qur'anic concept of\\n\\t\\t\\t\\t\"intercession\", see note [7] on  10:3 , as well as notes\\n\\t\\t\\t\\t[26] and [27] on  10:18 ."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "27",
    "NoteID": "20",
    "Body": "Lit., \"that name the angels with a female name\" - i.e.,\\n\\t\\t\\t\\tthink of them as being endowed with sex and/or as being\\n\\t\\t\\t\\t\"God's daughters\". As the Qur'an points out in many\\n\\t\\t\\t\\tplaces, the people spoken of in this context do believe\\n\\t\\t\\t\\tin life after death, inasmuch as they express the hope\\n\\t\\t\\t\\tthat the angels and the imaginary deities which they\\n\\t\\t\\t\\tworship will \"mediate\" between them and God, and will\\n\\t\\t\\t\\t\"intercede\" for them. However, their belief is far too\\n\\t\\t\\t\\tvague to make them realize that the quality of man's life\\n\\t\\t\\t\\tin the hereafter does not depend on such outside factors\\n\\t\\t\\t\\tbut is causally, and directly, connected with the manner\\n\\t\\t\\t\\tof his life in this world: and so the Qur'an declares\\n\\t\\t\\t\\tthat their attitude is, for all practical purposes, not\\n\\t\\t\\t\\tmuch different from the attitude of people who reject the\\n\\t\\t\\t\\tidea of a hereafter altogether."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "28",
    "NoteID": "21",
    "Body": "Namely, of the real nature and function of the category\\n\\t\\t\\t\\tof beings spoken of in the Qur'an as angels, inasmuch as\\n\\t\\t\\t\\tthey belong to the realm of al-ghayb, \"that which is\\n\\t\\t\\t\\tbeyond the reach of human perception\". Alternatively, the\\n\\t\\t\\t\\tpronoun in bihi may relate to God, in which case the\\n\\t\\t\\t\\tphrase could be rendered as \"they have no knowledge\\n\\t\\t\\t\\twhatever of Him\" - implying that both the attribution of\\n\\t\\t\\t\\t\"progeny\" to Him and the belief that His judgment depends\\n\\t\\t\\t\\ton, or could be influenced by, \"mediation\" or\\n\\t\\t\\t\\t\"intercession\" is the result of an anthropomorphic\\n\\t\\t\\t\\tconcept of God and, therefore, far removed from the\\n\\t\\t\\t\\ttruth."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "30",
    "NoteID": "22",
    "Body": "Lit., \"that is their sum-total [or \"goal\"] of knowledge\"."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "31",
    "NoteID": "23",
    "Body": "I.e., whereas good deeds will be rewarded with far more\\n\\t\\t\\t\\tthan their merits may warrant, evil will be recompensed\\n\\t\\t\\t\\twith no more than its equivalent (cf.  6:160 ); and\\n\\t\\t\\t\\teither will be decided by the Almighty without the need\\n\\t\\t\\t\\tof \"mediation\" or \"intercession\"."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "32",
    "NoteID": "24",
    "Body": "Lit., \"save for a touch [thereof]\": a phrase which may be\\n\\t\\t\\t\\ttaken to mean \"an     occasional stumbling into sin\" -\\n\\t\\t\\t\\ti.e., not deliberately - followed by sincere repentance\\n\\t\\t\\t\\t(Baghawi, Razi, Ibn Kathir)."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "32",
    "NoteID": "25",
    "Body": "Sc., \"and of your inborn weakness\" - an implied echo of\\n\\t\\t\\t\\tthe statement that \"man has been created weak\" ( 4:28 )\\n\\t\\t\\t\\tand, therefore, liable to stumble into sinning."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "32",
    "NoteID": "26",
    "Body": "Lit., \"out of the earth\": see second half of note [47] on\\n\\t\\t\\t\\t 3:59 , as well as note [4] on  23:12 ."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "32",
    "NoteID": "27",
    "Body": "I.e., \"never boast about your own purity\", but remain\\n\\t\\t\\t\\thumble and remember that \"it is God who causes whomever\\n\\t\\t\\t\\tHe wills to remain pure\" ( 4:49 )."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "34",
    "NoteID": "28",
    "Body": "My rendering of the above two verses (together with the\\n\\t\\t\\t\\ttwo interpolations between brackets) is based on Razi's\\n\\t\\t\\t\\tconvincing interpretation of this passage as a return to\\n\\t\\t\\t\\tthe theme touched upon in verses 29-30."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "35",
    "NoteID": "29",
    "Body": "I.e., \"How can he be so sure that there is no life in the\\n\\t\\t\\t\\thereafter, and no judgment?\""
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "37",
    "NoteID": "30",
    "Body": "Cf.  2:124  and the corresponding note [100]. It is\\n\\t\\t\\t\\tobvious that the names of Abraham and Moses are cited\\n\\t\\t\\t\\there only by way of example, drawing attention to the\\n\\t\\t\\t\\tfact that all through human history God has entrusted His\\n\\t\\t\\t\\telect, the prophets, with the task of conveying certain\\n\\t\\t\\t\\tunchangeable ethical truths to man."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "38",
    "NoteID": "31",
    "Body": "This basic ethical law appears in the Qur'an five times -\\n\\t\\t\\t\\tin  6:164 ,  17:15 ,  35:18 ,  39:7 , as well as in the\\n\\t\\t\\t\\tabove instance, which is the oldest in the chronology of\\n\\t\\t\\t\\trevelation. Its implication is threefold: firstly, it\\n\\t\\t\\t\\texpresses a categorical rejection of the Christian\\n\\t\\t\\t\\tdoctrine of the \"original sin\" with which every human\\n\\t\\t\\t\\tbeing is allegedly burdened from birth; secondly, it\\n\\t\\t\\t\\trefutes the idea that a person's sins could be \"atoned\\n\\t\\t\\t\\tfor\" by a saint's or a prophet's redemptive sacrifice (as\\n\\t\\t\\t\\tevidenced, for instance, in the Christian doctrine of\\n\\t\\t\\t\\tJesus' vicarious atonement for mankind's sinfulness, or\\n\\t\\t\\t\\tin the earlier, Persian doctrine of man's vicarious\\n\\t\\t\\t\\tredemption by Mithras); and, thirdly, it denies, by\\n\\t\\t\\t\\timplication, the possibility of any \"mediation\" between\\n\\t\\t\\t\\tthe sinner and God."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "39",
    "NoteID": "32",
    "Body": "Cf. the basic, extremely well-authenticated saying of the\\n\\t\\t\\t\\tProphet, \"Actions will be [judged] only according to the\\n\\t\\t\\t\\tconscious intentions [which prompted them]; and unto\\n\\t\\t\\t\\teveryone will be accounted only what he consciously\\n\\t\\t\\t\\tintended\", i.e., while doing whatever he did. This\\n\\t\\t\\t\\tTradition is quoted by Bukhari in seven places - the\\n\\t\\t\\t\\tfirst one as a kind of introduction to his Sahih - as\\n\\t\\t\\t\\twell as by Muslim, Tirmidhi, Abu Da'ud, Nasa'i (in four\\n\\t\\t\\t\\tplaces), Ibn Majah, Ibn Hanbal, and several other\\n\\t\\t\\t\\tcompilations. In this connection it is to be noted that\\n\\t\\t\\t\\tin the ethics of the Qur'an, the term \"action\" ('amal)\\n\\t\\t\\t\\tcomprises also a deliberate omission of actions, whether\\n\\t\\t\\t\\tgood or bad, as well as a deliberate voicing of beliefs,\\n\\t\\t\\t\\tboth righteous and sinful: in short, everything that man\\n\\t\\t\\t\\tconsciously aims at and expresses by word or deed."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "40",
    "NoteID": "33",
    "Body": "Lit., \"his striving will be seen\", i.e., on the Day of\\n\\t\\t\\t\\tJudgment, when - as the Qur'an states in many places -\\n\\t\\t\\t\\tGod \"will make you [truly] understand all that you were\\n\\t\\t\\t\\tdoing [in life]\"."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "42",
    "NoteID": "34",
    "Body": "Lit., \"the utmost limit\" or \"goal\", circumscribing the\\n\\t\\t\\t\\tbeginning and the end of the universe both in time and in\\n\\t\\t\\t\\tspace, as well as the source from which everything\\n\\t\\t\\t\\tproceeds and to which everything must return."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "47",
    "NoteID": "35",
    "Body": "Lit., \"that upon Him rests the other [or \"second\"] coming\\n\\t\\t\\t\\tto life (nash'ah)\", i.e., resurrection."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "49",
    "NoteID": "36",
    "Body": "Lit., \"who is the Sustainer of Sirius (ash-shi'ra)\", a\\n\\t\\t\\t\\tstar of the first magnitude, belonging to the\\n\\t\\t\\t\\tconstellation Canis Major. Because it is the brightest\\n\\t\\t\\t\\tstar in the heavens, it was widely worshipped in\\n\\t\\t\\t\\tpre-Islamic Arabia. Idiomatically, the phrase rabb\\n\\t\\t\\t\\tash-shi'ra is used as a metonym for the Creator and\\n\\t\\t\\t\\tUpholder of the universe."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "51",
    "NoteID": "37",
    "Body": "For the story of the tribe of 'Ad, see second half of\\n\\t\\t\\t\\tnote [48] on  7:65 ; for that of the Thamud, note [56] on\\n\\t\\t\\t\\t 7:73 ."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "54",
    "NoteID": "38",
    "Body": "Lit., \"so that there covered them that which covered\": a\\n\\t\\t\\t\\treference to Sodom and Gomorrah, the cities of \"Lot's\\n\\t\\t\\t\\tpeople\" (see, in particular, {11:77-83})."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "55",
    "NoteID": "39",
    "Body": "This rhetorical question is evidently addressed to the\\n\\t\\t\\t\\ttype of man spoken of in verses {33-35}. - For the reason\\n\\t\\t\\t\\tof my rendering of ala' (lit., \"blessings\" or \"bounties\")\\n\\t\\t\\t\\tas \"powers\", see second half of note [4] on  55:13 ."
  },
  {
    "SurahNumber": "53",
    "AyahNumber": "56",
    "NoteID": "40",
    "Body": "Lit., \"a warning of [or \"from among\"] the warnings of\\n\\t\\t\\t\\told\" - implying that the revelation granted to Muhammad\\n\\t\\t\\t\\tdoes not aim at establishing a \"new\" religion but, on the\\n\\t\\t\\t\\tcontrary, continues and confirms the basic message\\n\\t\\t\\t\\tentrusted to the earlier prophets - in this particular\\n\\t\\t\\t\\tinstance alluding to the certainty of the coming of the\\n\\t\\t\\t\\tLast Hour and of God's ultimate judgment."
  }
]
