[
  {
    "SurahNumber": "77",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "I.e., one after another: an allusion to the gradual,\\n\\t\\t\\t\\tstep-by-step revelation of the Qur'an. By contrast, the\\n\\t\\t\\t\\tnext clause (verse {2}) obviously relates to the impact\\n\\t\\t\\t\\tof the divine writ as a whole. For my rendering of the\\n\\t\\t\\t\\tadjurative particle wa as \"Consider\", see surah {74},\\n\\t\\t\\t\\tfirst half of note [23]."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "4",
    "NoteID": "2",
    "Body": "Lit., \"with [all] separation\" (farqan). Cf.  8:29  and\\n\\t\\t\\t\\tthe corresponding note; also note [38] on  2:53 ."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "6",
    "NoteID": "3",
    "Body": "I.e., showing what leads to freedom from blame - in other\\n\\t\\t\\t\\twords, the principles of right conduct - and what is\\n\\t\\t\\t\\tethically reprehensible and, therefore, to be avoided."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "Lit., \"that which you are promised\", i.e., resurrection."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "11",
    "NoteID": "5",
    "Body": "Sc., to bear witness for or against those to whom they\\n\\t\\t\\t\\tconveyed God's message (cf. {4:41-42},  5:109 ,  7:6  or\\n\\t\\t\\t\\t 39:69 )."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "13",
    "NoteID": "6",
    "Body": "This is chronologically the earliest occurrence of the\\n\\t\\t\\t\\texpression yawm al-fasl, which invariably relates to the\\n\\t\\t\\t\\tDay of Resurrection (cf.  37:21 ,  44:40 ,  78:17 , as\\n\\t\\t\\t\\twell as verse {38} of the present surah): an allusion to\\n\\t\\t\\t\\tthe oft-repeated Qur'anic statement that on resurrection\\n\\t\\t\\t\\tman will gain a perfect, unfailing insight into himself\\n\\t\\t\\t\\tand the innermost motivation of his past attitudes and\\n\\t\\t\\t\\tdoings (cf.  69:1  and the corresponding note [1])."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "17",
    "NoteID": "7",
    "Body": "The use of the conjunction thumma - which in this case\\n\\t\\t\\t\\thas been rendered as \"And\" - implies that suffering in\\n\\t\\t\\t\\tthe hereafter is bound to befall the sinners \"of later\\n\\t\\t\\t\\ttimes\" (al-akhirun) even if God, in His unfathomable\\n\\t\\t\\t\\twisdom, wills to spare them in this world."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "23",
    "NoteID": "8",
    "Body": "The process of man's coming into being (illustrated, for\\n\\t\\t\\t\\tinstance, in {23:12-14}) clearly points to God's creative\\n\\t\\t\\t\\tactivity and, hence, to His existence. Consequently, lack\\n\\t\\t\\t\\tof gratitude on man's part amounts to what the Qur'an\\n\\t\\t\\t\\tdescribes as \"giving the lie to the truth\"."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "26",
    "NoteID": "9",
    "Body": "This refers not merely to the fact that the earth is an\\n\\t\\t\\t\\tabode for living and dead human beings and animals, but\\n\\t\\t\\t\\tis also an allusion to the God-willed, cyclic recurrence\\n\\t\\t\\t\\tof birth, growth, decay and death in all organic creation\\n\\t\\t\\t\\t- and thus an evidence of the existence of the Creator\\n\\t\\t\\t\\twho \"brings forth the living out of that which is dead,\\n\\t\\t\\t\\tand brings forth the dead out of that which is alive\"\\n\\t\\t\\t\\t( 3:27 ,  6:95 ,  10:31  and  30:19 )."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "27",
    "NoteID": "10",
    "Body": "Parallel with the preceding, this verse refers to God's\\n\\t\\t\\t\\tcreation of inanimate matter, and thus rounds off the\\n\\t\\t\\t\\tstatement that He is the Maker of the universe in all its\\n\\t\\t\\t\\tmanifestations, both organic and inorganic."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "30",
    "NoteID": "11",
    "Body": "I.e., of death, resurrection and God's judgment, all\\n\\t\\t\\t\\tthree of which cast dark shadows, as it were, over the\\n\\t\\t\\t\\tsinners' hearts."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "33",
    "NoteID": "12",
    "Body": "Lit., \"like yellow twisted ropes\", yellow being \"the\\n\\t\\t\\t\\tcolour of fire\" (Baghawi). The conventional rendering of\\n\\t\\t\\t\\tjimalat (also spelt jimalat and jimalah) as \"camels\",\\n\\t\\t\\t\\tadopted by many commentators and, until now, by all\\n\\t\\t\\t\\ttranslators of the Qur'an, must be rejected as grossly\\n\\t\\t\\t\\tanomalous; see in this connection note [32] on the second\\n\\t\\t\\t\\tpart of  7:40  - \"they shall not enter paradise any more\\n\\t\\t\\t\\tthan a twisted rope can pass through a needle's eye\". In\\n\\t\\t\\t\\tthe above verse, too, the plural noun jimalah (or\\n\\t\\t\\t\\tjimalat) signifies \"twisted ropes\" or \"giant ropes\" - a\\n\\t\\t\\t\\tconnotation that has been forcefully stressed by Ibn\\n\\t\\t\\t\\t'Abbas, Mujahid, Sa'id ibn Jubayr and others (cf. Tabari,\\n\\t\\t\\t\\tBaghawi, Razi, Ibn Kathir; also Bukhari, Kitab\\n\\t\\t\\t\\tat-Tafsir). Moreover, our observation of the trajectory\\n\\t\\t\\t\\tof shooting stars fully justifies the rendering \"giant\\n\\t\\t\\t\\tfiery ropes\". Similarly, my rendering of qasr, in this\\n\\t\\t\\t\\tcontext, as \"[burning] logs\" - instead of the\\n\\t\\t\\t\\tconventional (and utterly meaningless) \"castles\",\\n\\t\\t\\t\\t\"palaces\", etc. - goes back to all of the above-mentioned\\n\\t\\t\\t\\tauthorities."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "43",
    "NoteID": "13",
    "Body": "For this symbolism of the joys of paradise, see Appendix\\n\\t\\t\\t\\tI."
  },
  {
    "SurahNumber": "77",
    "AyahNumber": "46",
    "NoteID": "14",
    "Body": "Lit., \"behold, you are lost in sin (mujrimun)\"."
  }
]
