[
  {
    "SurahNumber": "19",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "Lit., \"An account of thy Sustainer's grace upon...\", etc.\\n\\t\\t\\t\\tAccording to the account in the Gospels, not contradicted\\n\\t\\t\\t\\tby the Qur'an, Zachariah's wife Elisabeth was a cousin of\\n\\t\\t\\t\\tMary, the mother of Jesus (Cf. Luke i, 36)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "Lit., \"with secret calling\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "Lit., \"never have I been unfortunate in my prayer to\\n\\t\\t\\t\\tThee\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "Lit., \"after me\". He evidently anticipated that his\\n\\t\\t\\t\\tkinsfolk- who, like himself, were priests attached to the\\n\\t\\t\\t\\tTemple - would be morally too weak to fulfil their duties\\n\\t\\t\\t\\twith dignity and conviction (Razi), and thus, perhaps,\\n\\t\\t\\t\\tunable to safeguard the future of Mary, whose guardian he\\n\\t\\t\\t\\twas (cf. the first paragraph of  3:37 )."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "7",
    "NoteID": "6",
    "Body": "See  3:39 ."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "Lit., \"Never before have We made a namesake for him\". The\\n\\t\\t\\t\\tname Yahya (John) signifies \"he shall live\", i.e., he\\n\\t\\t\\t\\twill be spiritually alive and will be remembered forever;\\n\\t\\t\\t\\tand the fact that God Himself had chosen this name for\\n\\t\\t\\t\\thim was a singular distinction, equivalent to a divine\\n\\t\\t\\t\\tpromise (kalimah, cf. note [28] on  3:39 )."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "Lit., \"when [or \"although\"] thou wert nothing\". This\\n\\t\\t\\t\\tstress on God's unlimited power to bring into being a new\\n\\t\\t\\t\\tchain of causes and effects forms here, as in Al 'Imran,\\n\\t\\t\\t\\ta preamble to the announcement, expressed in very similar\\n\\t\\t\\t\\tterms, of the birth of Jesus (see verses {19} ff.)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "10",
    "NoteID": "9",
    "Body": "See  3:41  and the corresponding note [29]."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "12",
    "NoteID": "10",
    "Body": "According to Razi, this is clearly implied inasmuch as the sequence presupposes that John had in  the meantime reached an age which enabled him to receive and understand God's commandment. "
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "12",
    "NoteID": "10",
    "Body": "According to Razi, this is clearly implied in as much as the sequence presupposes that John had in  the meantime reached an age which enabled him to receive and understand God's commandment. "
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "13",
    "NoteID": "11",
    "Body": "Lit., \"compassion from Us\"-i.e., as a special divine\\n\\t\\t\\t\\tgift."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "16",
    "NoteID": "12",
    "Body": "Lit., \"in the divine writ\". In this surah as well as in\\n\\t\\t\\t\\tAl 'Imran the story of the birth of John is followed by\\n\\t\\t\\t\\tthat of Jesus-firstly, because John (called \"the Baptist\"\\n\\t\\t\\t\\tin the Bible) was to be a precursor of Jesus, and,\\n\\t\\t\\t\\tsecondly, because of the obvious parallelism in the form\\n\\t\\t\\t\\tof the announcements of these two births."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "17",
    "NoteID": "13",
    "Body": "Apparently, in order to devote herself undisturbed to\\n\\t\\t\\t\\tprayer and meditation. The \"eastern place\" may possibly,\\n\\t\\t\\t\\tas Ibn Kathir suggests, signify an eastern chamber of the\\n\\t\\t\\t\\tTemple, to the service of which Mary had been dedicated\\n\\t\\t\\t\\tby her mother (cf. {3: 35-37})."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "17",
    "NoteID": "14",
    "Body": "As pointed out in surah {2}, note [71], and surah {16},\\n\\t\\t\\t\\tnote [2], the term ruh often denotes \"divine\\n\\t\\t\\t\\tinspiration\". Occasionally, however, it is used to\\n\\t\\t\\t\\tdescribe the medium through which such inspiration is\\n\\t\\t\\t\\timparted to God's elect: in other words, the angel (or\\n\\t\\t\\t\\tangelic force) of revelation. Since - as is implied in\\n\\t\\t\\t\\t 6:9  - mortals cannot perceive an angel in his true\\n\\t\\t\\t\\tmanifestation, God caused him to appear to Mary \"in the\\n\\t\\t\\t\\tshape of a well-made human being\", i.e., in a shape\\n\\t\\t\\t\\taccessible to her perception. According to Razi, the\\n\\t\\t\\t\\tdesignation of the angel as ruh (\"spirit\" or \"soul\")\\n\\t\\t\\t\\tindicates that this category of beings is purely\\n\\t\\t\\t\\tspiritual, without any physical element."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "21",
    "NoteID": "15",
    "Body": "Cf. the identical phrase in verse {9} above, relating to\\n\\t\\t\\t\\tthe announcement of John's birth to Zachariah. In both\\n\\t\\t\\t\\tthese cases, the implication is that God can and does\\n\\t\\t\\t\\tbring about events which may be utterly unexpected or\\n\\t\\t\\t\\teven inconceivable before they materialize. In connection\\n\\t\\t\\t\\twith the announcement of a son to Mary, the Qur'an states\\n\\t\\t\\t\\tin {3 :47} that \"when He wills a thing to be, He but says\\n\\t\\t\\t\\tunto it, 'Be' - and it is\": but since neither the Qur'an\\n\\t\\t\\t\\tnor any authentic Tradition tells us anything about the\\n\\t\\t\\t\\tchain of causes and effects (asbab) which God's decree\\n\\t\\t\\t\\t\"Be\" was to bring into being, all speculation as to the\\n\\t\\t\\t\\t\"how\" of this event must remain beyond the scope of a\\n\\t\\t\\t\\tQur'an-commentary. (But see also note [87] on {21: 91}.)"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "21",
    "NoteID": "16",
    "Body": "One of the several meanings of the term ayah is \"a sign\"\\n\\t\\t\\t\\tor, as elaborately defined by Raghib, \"a symbol\" (cf.\\n\\t\\t\\t\\tsurah {17}, note [2]). However, the sense in which it is\\n\\t\\t\\t\\tmost frequently used in the Qur'an is \"a [divine]\\n\\t\\t\\t\\tmessage\": hence, its metonymic application to Jesus may\\n\\t\\t\\t\\tmean that he was destined to become a vehicle of God's\\n\\t\\t\\t\\tmessage to man - i.e., a prophet- and, thus, a symbol of\\n\\t\\t\\t\\tGod's grace. - As regards the words \"thou shalt have a\\n\\t\\t\\t\\tson\" interpolated by me between brackets, a statement to\\n\\t\\t\\t\\tthis effect is implied in the subsequent phrase beginning\\n\\t\\t\\t\\twith \"so that\" (Zamakhshari and Razi)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "23",
    "NoteID": "17",
    "Body": "I.e., compelling her to cling to it for support: thus\\n\\t\\t\\t\\tstressing the natural, normal circumstances of this\\n\\t\\t\\t\\tchildbirth, attended - as is the case with all women - by\\n\\t\\t\\t\\tsevere labour pains."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "24",
    "NoteID": "18",
    "Body": "Or: \"from beneath her\". However, Qatadah (as quoted by\\n\\t\\t\\t\\tZamakhshari) interprets this as meaning \"from beneath the\\n\\t\\t\\t\\tpalm-tree\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "26",
    "NoteID": "19",
    "Body": "Lit., \"say\" - but since actual speech would contradict\\n\\t\\t\\t\\twhat follows, the \"saying\" implies here a communication\\n\\t\\t\\t\\tby gestures."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "26",
    "NoteID": "20",
    "Body": "In its primary sense, the term sawm denotes \"abstinence\"\\n\\t\\t\\t\\tor \"self-denial\"; in the present context it is synonymous\\n\\t\\t\\t\\twith samt (\"abstinence from speech\"); in fact-as pointed\\n\\t\\t\\t\\tout by Zamakhshari - the latter term is said to have\\n\\t\\t\\t\\tfigured in the Qur'an-copy belonging to 'Abd Allah ibn\\n\\t\\t\\t\\tMas'ud (possibly as a marginal, explanatory notation)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "27",
    "NoteID": "21",
    "Body": "Lit., \"she came with him to her people, carrying him\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "28",
    "NoteID": "22",
    "Body": "In ancient Semitic usage, a person's name was often\\n\\t\\t\\t\\tlinked with that of a renowned ancestor or founder of the\\n\\t\\t\\t\\ttribal line. Thus, for instance, a man of the tribe of\\n\\t\\t\\t\\tBanu Tamim was sometimes addressed as \"son of Tamim\" or\\n\\t\\t\\t\\t\"brother of Tamim\". Since Mary belonged to the priestly\\n\\t\\t\\t\\tcaste, and hence descended from Aaron, the brother of\\n\\t\\t\\t\\tMoses, she was called a \"sister of Aaron\" (in the same\\n\\t\\t\\t\\tway as her cousin Elisabeth. the wife of Zachariah, is\\n\\t\\t\\t\\tspoken of in Luke i, 5, as one \"of the daughters of\\n\\t\\t\\t\\tAaron\")."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "30",
    "NoteID": "23",
    "Body": "Although the Qur'an mentions in  3:46  that Jesus would\\n\\t\\t\\t\\t\"speak unto men [while yet] in his cradle\" - i.e., would\\n\\t\\t\\t\\tbe imbued with wisdom from his early childhood - verses\\n\\t\\t\\t\\t{30-33} seem to be in the nature of a trope, projecting\\n\\t\\t\\t\\tthe shape of things to come by using, for the sake of\\n\\t\\t\\t\\temphasis, the past tense to describe something that was\\n\\t\\t\\t\\tto become real in the future. (See also next note.)"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "30",
    "NoteID": "24",
    "Body": "Since it is not conceivable that anyone could be granted\\n\\t\\t\\t\\tdivine revelation and made a prophet before attaining to\\n\\t\\t\\t\\tfull maturity of intellect and experience, 'Ikrimah and\\n\\t\\t\\t\\tAd-Dahhak - as quoted by Tabari - interpret this passage\\n\\t\\t\\t\\tas meaning, \"God has decreed (qada) that He would\\n\\t\\t\\t\\tvouchsafe unto me revelation...\", etc., thus regarding it\\n\\t\\t\\t\\tas an allusion to the future. Tabari himself applies the\\n\\t\\t\\t\\tsame interpretation to the next verse, explaining it\\n\\t\\t\\t\\tthus: \"He has decreed that He would enjoin upon me prayer\\n\\t\\t\\t\\tand charity\". However, the whole of this passage (verses\\n\\t\\t\\t\\t{30-33}) may also be understood as having been uttered by\\n\\t\\t\\t\\tJesus at a much later time - namely, after he had reached\\n\\t\\t\\t\\tmaturity and been actually entrusted with his prophetic\\n\\t\\t\\t\\tmission: that is to say, it may be understood as an\\n\\t\\t\\t\\tanticipatory description of the ethical and moral\\n\\t\\t\\t\\tprinciples which were to dominate the adult life of Jesus\\n\\t\\t\\t\\tand particularly his deep consciousness of being only \"a\\n\\t\\t\\t\\tservant of God\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "34",
    "NoteID": "25",
    "Body": "Lit., \"about whom they are in doubt\", or \"about whom they\\n\\t\\t\\t\\t[vainly] dispute\": an allusion to the many conflicting\\n\\t\\t\\t\\tviews about the nature of Jesus and his origins, ranging\\n\\t\\t\\t\\tfrom the blasphemous Jewish assertion that he was a\\n\\t\\t\\t\\t\"false prophet\" and the product of a shameful, illicit\\n\\t\\t\\t\\tunion (cf.  4:156 ), to the Christian belief that he was\\n\\t\\t\\t\\t\"the son of God\" and, therefore, God incarnate. In this\\n\\t\\t\\t\\tconnection, see also  3:59  and the corresponding note\\n\\t\\t\\t\\t[47]."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "35",
    "NoteID": "26",
    "Body": "See note [96] on {2: 116}."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "36",
    "NoteID": "27",
    "Body": "Cf.  3:51  and  43:64 ."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "37",
    "NoteID": "28",
    "Body": "I.e., either rejecting him entirely, as do the Jews, or -\\n\\t\\t\\t\\tas is the case with the Christians - deifying him."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "37",
    "NoteID": "29",
    "Body": "Lit., \"from the manifestation (mashhad) of an awesome\\n\\t\\t\\t\\tDay\", i.e., the Day of Judgment."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "40",
    "NoteID": "30",
    "Body": "Lit., \"We alone shall inherit the earth and all who are\\n\\t\\t\\t\\ton it\". For an explanation of this metaphoric use of the\\n\\t\\t\\t\\tconcept of \"inheritance\", see surah {15}, note [22]."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "41",
    "NoteID": "31",
    "Body": "The mention of Abraham and his subsequent, unavailing\\n\\t\\t\\t\\tplea to his father to recognize God's oneness and\\n\\t\\t\\t\\tuniqueness connects with the preceding discourse, under\\n\\t\\t\\t\\tthe same aspect, on the true nature of Jesus as a mortal\\n\\t\\t\\t\\thuman being and a mere servant of the One and Only God."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "43",
    "NoteID": "32",
    "Body": "I.e., a cognition of God's existence and uniqueness\\n\\t\\t\\t\\tthrough intellectual insight (cf. {6:7-82})."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "44",
    "NoteID": "33",
    "Body": "The absurdity inherent in the attribution of divine\\n\\t\\t\\t\\tqualities to anything or anyone but God is here declared,\\n\\t\\t\\t\\tby implication, to be equivalent to \"worshipping\" the\\n\\t\\t\\t\\tepitome of unreason and ingratitude symbolized in Satan's\\n\\t\\t\\t\\trebellion against his Creator. In this connection it\\n\\t\\t\\t\\tshould be noted that the term shaytan is derived from the\\n\\t\\t\\t\\tverb shatana, signifying \"he was [or \"became\"] remote\\n\\t\\t\\t\\t[from the truth];' (Lisan al-'Arab, Taj al-'Arus); hence,\\n\\t\\t\\t\\tthe Qur'an describes every impulse that inherently\\n\\t\\t\\t\\toffends against truth, reason and morality as \"satanic\",\\n\\t\\t\\t\\tand every conscious act of submission to such satanic\\n\\t\\t\\t\\tinfluences as a \"worship of Satan\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "45",
    "NoteID": "34",
    "Body": "According to Zamakhshari and Razi, the construction of\\n\\t\\t\\t\\tthis clause (beginning with \"so that\") is meant to bring\\n\\t\\t\\t\\tout the idea that one's belated realization, in the\\n\\t\\t\\t\\thereafter, of having been \"close unto Satan\" is the most\\n\\t\\t\\t\\tterrible consequence of deliberate sinning."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "48",
    "NoteID": "35",
    "Body": "Lit., \"that I will not be unfortunate in the prayer to my\\n\\t\\t\\t\\tSustainer\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "50",
    "NoteID": "36",
    "Body": "Lit., \"a lofty language of truth\" or \"of\\n\\t\\t\\t\\ttruthfulness\"-the term lisan (\"language\" or \"tongue\")\\n\\t\\t\\t\\tbeing used here metonymically for what may be pronounced\\n\\t\\t\\t\\tby the tongue (Zamakhshari). An alternative\\n\\t\\t\\t\\tinterpretation of the phrase, advanced by many\\n\\t\\t\\t\\tcommentators, is \"granted them a lofty renown for truth\"\\n\\t\\t\\t\\tor \"truthfulness\", or simply \"a most goodly renown\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "51",
    "NoteID": "37",
    "Body": "The mention of Moses and other prophets in this context\\n\\t\\t\\t\\tserves to reinforce the statement that all of them - like\\n\\t\\t\\t\\tJesus - were but mortal servants of God whom He had\\n\\t\\t\\t\\tinspired with His message to man (cf. verse {30} above).\\n\\t\\t\\t\\tAs regards the distinction between the terms \"prophet\"\\n\\t\\t\\t\\t(nabi) and \"apostle\" (rasul), see the opening clause of\\n\\t\\t\\t\\t 22:52  and the corresponding note [65]."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "52",
    "NoteID": "38",
    "Body": "I.e., to the right side from the standpoint of Moses, as\\n\\t\\t\\t\\the was facing Mount Sinai (Tabari). However, it is much\\n\\t\\t\\t\\tmore probable that the term \"right side\" has here, as\\n\\t\\t\\t\\telsewhere in the Qur'an the abstract connotation of\\n\\t\\t\\t\\t\"blessedness\" (cf. note [25] on {74: 39}). For a fuller\\n\\t\\t\\t\\taccount of God's calling Moses to prophethood, see {20:\\n\\t\\t\\t\\t9} ff."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "54",
    "NoteID": "39",
    "Body": "After the mention of Moses, who descended from Abraham\\n\\t\\t\\t\\tthrough Isaac, we are reminded of Ishmael, Abraham's\\n\\t\\t\\t\\tfirst-born son and the progenitor of the \"northern\" group\\n\\t\\t\\t\\tof Arab tribes, and thus of the Prophet Muhammad, who\\n\\t\\t\\t\\tdescended in direct line, through the tribe of Quraysh,\\n\\t\\t\\t\\tfrom Ishmael."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "55",
    "NoteID": "40",
    "Body": "This may perhaps mean that Ishmael was the first among\\n\\t\\t\\t\\tthe prophets to establish prayer and charity as\\n\\t\\t\\t\\tobligatory forms of worship."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "56",
    "NoteID": "41",
    "Body": "The majority of the classical commentators identify the\\n\\t\\t\\t\\tProphet Idris - who is mentioned in the Qur'an once\\n\\t\\t\\t\\tagain, namely in  21:85  - with the Biblical Enoch\\n\\t\\t\\t\\t(Genesis v, 18-19 and 21-24), without, however, being\\n\\t\\t\\t\\table to adduce any authority for this purely conjectural\\n\\t\\t\\t\\tidentification. Some modern Qur'an-commentators suggest\\n\\t\\t\\t\\tthat the name Idris may be the Arabicized form of Osiris\\n\\t\\t\\t\\t(which, in its turn, was the ancient Greek version of the\\n\\t\\t\\t\\tEgyptian name As-ar or Us-ar), said to have been a wise\\n\\t\\t\\t\\tking and/or prophet whom the Egyptians subsequently\\n\\t\\t\\t\\tdeified (cf. Maraghi XVI, 64, and Sayyid Qutb, Fi Zilal\\n\\t\\t\\t\\tal-Qur'ain, Cairo, n.d., vol. XVI,44); but this\\n\\t\\t\\t\\tassumption is too far-fetched to deserve any serious\\n\\t\\t\\t\\tconsideration. Finally, some of the earliest\\n\\t\\t\\t\\tQur'an-commentators ('Abd Allah ibn Mas'ud, Qatadah,\\n\\t\\t\\t\\t'Ikrimah and Ad-Dahhak) assert - with, to my mind, great\\n\\t\\t\\t\\tplausibility-that ''Idris'' is but another name for\\n\\t\\t\\t\\tIlyas, the Biblical Elijah (regarding whom see note [48]\\n\\t\\t\\t\\ton {37: 123})."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "57",
    "NoteID": "42",
    "Body": "As regards my rendering of rafa'nahu as \"whom We\\n\\t\\t\\t\\texalted\", see  3:55  and  4:158 , where the same\\n\\t\\t\\t\\texpression is used with reference to Jesus, as well as\\n\\t\\t\\t\\tnote [172] on the last-named verse."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "58",
    "NoteID": "43",
    "Body": "Whereas the Hebrew prophets, whose line ended with Jesus,\\n\\t\\t\\t\\tdescended from Abraham through Isaac and Israel (Jacob),\\n\\t\\t\\t\\tMuhammad traced his descent from the same patriarch\\n\\t\\t\\t\\tthrough the latter's first-born son, Ishmael."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "58",
    "NoteID": "44",
    "Body": "I.e., all of the prophets were conscious of being no more\\n\\t\\t\\t\\tthan mortal, humble servants of God. (See also  32:15 .)"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "59",
    "NoteID": "45",
    "Body": "I.e., they will realize in the hereafter the full extent\\n\\t\\t\\t\\tof the self-deception which has led to their spiritual\\n\\t\\t\\t\\truin."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "60",
    "NoteID": "46",
    "Body": "I.e., they will not only not be deprived of reward for\\n\\t\\t\\t\\tthe least of their good deeds, but will be granted\\n\\t\\t\\t\\tblessings far beyond their actual deserts (cf.  4:40 )."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "61",
    "NoteID": "47",
    "Body": "This lengthy paraphrase of the expression bi'l-ghayb\\n\\t\\t\\t\\tgives, I think, the closest possible interpretation of\\n\\t\\t\\t\\tthe idea underlying it: namely, the prospect of a reality\\n\\t\\t\\t\\twhich is inconceivable by man in terms of his worldly\\n\\t\\t\\t\\texperiences, and which can, therefore, only be hinted at\\n\\t\\t\\t\\tby means of allegorical allusions. (See also the first\\n\\t\\t\\t\\tclause of  2:3  and the corresponding note [3].)"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "62",
    "NoteID": "48",
    "Body": "The term salam comprises the concepts of spiritual\\n\\t\\t\\t\\tsoundness and peace, freedom from faults and evils of any\\n\\t\\t\\t\\tkind, and inner contentment. As I have pointed out in\\n\\t\\t\\t\\tnote [29] on  5:16  (where this term has been rendered,\\n\\t\\t\\t\\tin a different context, as \"salvation\"), its closest -\\n\\t\\t\\t\\tthough by no means perfect - equivalent would be the\\n\\t\\t\\t\\tFrench salut, in the abstract sense of that word, or the\\n\\t\\t\\t\\tGerman Heil."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "62",
    "NoteID": "49",
    "Body": "I.e., always. It is to be noted that the term rizq\\n\\t\\t\\t\\t(\"sustenance\") applies to all that might be of benefit to\\n\\t\\t\\t\\ta living being, spiritually as well as physically."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "64",
    "NoteID": "50",
    "Body": "I.e., that which even the angels can only glimpse but not\\n\\t\\t\\t\\tfully understand. Literally, the above phrase reads,\\n\\t\\t\\t\\t\"that which is between our hands and that which is behind\\n\\t\\t\\t\\tus and that which is between these\". Regarding this\\n\\t\\t\\t\\tidiomatic expression, see  2:255  -\"He knows all that\\n\\t\\t\\t\\tlies open before men and all that is hidden from them\" -\\n\\t\\t\\t\\tand the corresponding note [247]. The reference to the\\n\\t\\t\\t\\tangels connects with the preceding mention of some of the\\n\\t\\t\\t\\tearlier prophets who, like Muhammad, were recipients of\\n\\t\\t\\t\\tdivine revelation."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "67",
    "NoteID": "51",
    "Body": "Lit., \"when [or \"although\"] he was nothing\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "68",
    "NoteID": "52",
    "Body": "See surah {15}, first half of note [16]; cf. also the\\n\\t\\t\\t\\treference to the \"worship of Satan\" in verses {44-45} of\\n\\t\\t\\t\\tthe present surah, as well as the corresponding notes\\n\\t\\t\\t\\t[33] and [34]. The symbolism of the sinners being linked\\n\\t\\t\\t\\ton Judgment Day \"with the satanic forces which impelled\\n\\t\\t\\t\\tthem in life\" is easily understood if we remember - as\\n\\t\\t\\t\\thas been pointed out in note [10] on  2:14  - that the\\n\\t\\t\\t\\tterm shaytan (\"satan\" or \"satanic force\") is often used\\n\\t\\t\\t\\tin the Qur'an to describe every evil propensity in man's\\n\\t\\t\\t\\town self. The personal pronoun relates to those who\\n\\t\\t\\t\\treject the concept of resurrection and life after death."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "69",
    "NoteID": "53",
    "Body": "I.e., those who have consciously and deliberately\\n\\t\\t\\t\\trejected the idea of man's responsibility before God and\\n\\t\\t\\t\\thave thus led their weaker, less conscious fellow-men\\n\\t\\t\\t\\tastray will be consigned to the deepest suffering in the\\n\\t\\t\\t\\thereafter."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "70",
    "NoteID": "54",
    "Body": "Lit., \"of burning therein\": an allusion to the fact that\\n\\t\\t\\t\\tnot every one of the sinners will be irrevocably\\n\\t\\t\\t\\tconsigned to the suffering described in the Qur'an as\\n\\t\\t\\t\\thell. (The particle thumma which introduces this clause\\n\\t\\t\\t\\thas here the function of an explanatory conjunction with\\n\\t\\t\\t\\tthe preceding statement and is, therefore, best rendered\\n\\t\\t\\t\\tas \"for\".)"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "71",
    "NoteID": "55",
    "Body": "Lit., \"none of you but will reach it\". According to some\\n\\t\\t\\t\\tof the classical authorities, the pronoun \"you\" relates\\n\\t\\t\\t\\tto the sinners spoken of in the preceding passages, and\\n\\t\\t\\t\\tparticularly to those who refuse to believe in\\n\\t\\t\\t\\tresurrection; the majority of the commentators, however,\\n\\t\\t\\t\\tare of the opinion that all human beings, sinners and\\n\\t\\t\\t\\trighteous alike, are comprised within this address in the\\n\\t\\t\\t\\tsense that all \"will come within sight of it\": hence my\\n\\t\\t\\t\\trendering."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "72",
    "NoteID": "56",
    "Body": "For this particular rendering of thumma, see surah {6},\\n\\t\\t\\t\\tnote [31]."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "72",
    "NoteID": "57",
    "Body": "I.e., utterly humbled and crushed by their belated\\n\\t\\t\\t\\trealization of God's judgment and of the ethical truths\\n\\t\\t\\t\\twhich they had arrogantly neglected in life."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "73",
    "NoteID": "58",
    "Body": "Lit., \"two groups\" or \"parties\": an allusion to two kinds\\n\\t\\t\\t\\tor types of human society characterized by their\\n\\t\\t\\t\\tfundamentally different approach to problems of faith and\\n\\t\\t\\t\\tmorality. (See next note.)"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "73",
    "NoteID": "59",
    "Body": "Lit., \"better in assembly\". This parabolic \"saying\" of\\n\\t\\t\\t\\tthe unbelievers implies, in the garb of a rhetorical\\n\\t\\t\\t\\tquestion, a superficially plausible but intrinsically\\n\\t\\t\\t\\tfallacious argument in favour of a society which refuses\\n\\t\\t\\t\\tto submit to any absolute moral imperatives and is\\n\\t\\t\\t\\tdetermined to obey the dictates of expediency alone. In\\n\\t\\t\\t\\tsuch a social order, material success and power are\\n\\t\\t\\t\\tusually seen as consequences of a more or less conscious\\n\\t\\t\\t\\trejection of all metaphysical considerations - and, in\\n\\t\\t\\t\\tparticular, of all that is comprised in the concept of\\n\\t\\t\\t\\tGod-willed standards of morality - on the assumption that\\n\\t\\t\\t\\tthey are but an obstacle in the path of man's free,\\n\\t\\t\\t\\tunlimited \"development\". It goes without saying that this\\n\\t\\t\\t\\tattitude (which has reached its epitome in the modern\\n\\t\\t\\t\\tstatement that \"religion is opium for the people\") is\\n\\t\\t\\t\\tdiametrically opposed to the demand, voiced by every\\n\\t\\t\\t\\thigher religion, that man's social life, if it is to be a\\n\\t\\t\\t\\ttruly \"good\" life, must be subordinated to definite\\n\\t\\t\\t\\tethical principles and restraints. By their very nature,\\n\\t\\t\\t\\tthese restraints inhibit the unprincipled power-drive\\n\\t\\t\\t\\twhich dominates the more materialistic societies and\\n\\t\\t\\t\\tenables them to achieve - without regard to the damage\\n\\t\\t\\t\\tdone to others and, spiritually, to themselves - outward\\n\\t\\t\\t\\tcomforts and positions of strength in the shortest\\n\\t\\t\\t\\tpossible time: but precisely because they do act as a\\n\\t\\t\\t\\tbrake on man's selfishness and power-hunger, it is these\\n\\t\\t\\t\\tmoral considerations and restraints - and they alone -\\n\\t\\t\\t\\tthat can free a community from the interminable,\\n\\t\\t\\t\\tself-destructive inner tensions and frustrations to which\\n\\t\\t\\t\\tmaterialistic societies are subject, and thus bring about\\n\\t\\t\\t\\ta more enduring, because more organic, state of social\\n\\t\\t\\t\\twell-being. This, in short, is the elliptically implied\\n\\t\\t\\t\\tanswer of the Qur'an to a rhetorical question placed in\\n\\t\\t\\t\\tthe mouths of \"those who are bent on denying the truth\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "74",
    "NoteID": "60",
    "Body": "Lit., \"in property\" or \"abundance of property\". In this\\n\\t\\t\\t\\tcontext - as in the last verse of this surah - the term -\\n\\t\\t\\t\\tqarn apparently signifies \"people of one and the same\\n\\t\\t\\t\\tepoch\", i.e., a \"civilization\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "75",
    "NoteID": "61",
    "Body": "Or: \"grant him a respite\", so that he might have a chance\\n\\t\\t\\t\\tto realize the error of his ways and to repent: thus,\\n\\t\\t\\t\\tevery believer is enjoined to pray for those who are\\n\\t\\t\\t\\tsinning."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "75",
    "NoteID": "62",
    "Body": "This interpolation refers to, and connects with, the\\n\\t\\t\\t\\t\"saying\" of the deniers of the truth mentioned in verse\\n\\t\\t\\t\\t{73} above (Zamakhshari)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "75",
    "NoteID": "63",
    "Body": "Lit., \"in respect of support\" or \"of forces\" (jundan) -\\n\\t\\t\\t\\tan expression which, in this context, denotes both\\n\\t\\t\\t\\tmaterial resources and the ability to utilize them\\n\\t\\t\\t\\ttowards good ends."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "76",
    "NoteID": "64",
    "Body": "Lit.. \"God increases in guidance those who...\", etc."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "76",
    "NoteID": "65",
    "Body": "Lit., \"which are better in thy Sustainer's sight as\\n\\t\\t\\t\\tregards merit, and better as regards returns\" (cf.\\n\\t\\t\\t\\t 18:46 .)"
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "77",
    "NoteID": "66",
    "Body": "This is a further illustration of the attitude described\\n\\t\\t\\t\\tin verses {73-75} (and referred to in note [59]): namely,\\n\\t\\t\\t\\tthe insistence on material values to the exclusion of all\\n\\t\\t\\t\\tmoral considerations, and the conviction that worldly\\n\\t\\t\\t\\t\"success\" is the only thing that really counts in life.\\n\\t\\t\\t\\tAs in many other places in the Qur'an, this materialistic\\n\\t\\t\\t\\tconcept of \"success\" is metonymically equated with one's\\n\\t\\t\\t\\tabsorption in the idea of \"wealth and children\"."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "78",
    "NoteID": "67",
    "Body": "In this context, the term al-ghayb denotes the unknowable\\n\\t\\t\\t\\tfuture."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "80",
    "NoteID": "68",
    "Body": "Lit., \"inherit from him\" - a metaphor based on the\\n\\t\\t\\t\\tconcept of one person's taking over what once belonged\\n\\t\\t\\t\\tto, or was vested in, another."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "80",
    "NoteID": "69",
    "Body": "I.e.. bereft of any extraneous support, and thus\\n\\t\\t\\t\\tdepending on God's grace and mercy alone (cf.  6:94  as\\n\\t\\t\\t\\twell as verse [95] of the present surah)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "81",
    "NoteID": "70",
    "Body": "This refers to the type of man spoken of in the preceding\\n\\t\\t\\t\\tpassage as well as in verses {73-75}: people who\\n\\t\\t\\t\\t\"worship\" wealth and power with an almost religious\\n\\t\\t\\t\\tdevotion, attributing to these manifestations of worldly\\n\\t\\t\\t\\tsuccess the status of divine forces."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "83",
    "NoteID": "71",
    "Body": "Lit., \"the satans\", by which term the Qur'an often\\n\\t\\t\\t\\tdescribes all that is intrinsically evil, especially the\\n\\t\\t\\t\\timmoral impulses in man's own soul (cf. note [10] on\\n\\t\\t\\t\\t 2:14  and note [33] on verse {44} of the present surah)."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "83",
    "NoteID": "72",
    "Body": "See note [31] on  15:41 . According to Zamakhshari and\\n\\t\\t\\t\\tRazi, the expression \"We have let loose (arsalna) all\\n\\t\\t\\t\\t[manner of] satanic forces (shayatin) upon those who deny\\n\\t\\t\\t\\tthe truth\" has here the meaning of \"We have allowed them\\n\\t\\t\\t\\tto be active (khallayna) among them\", leaving it to man's\\n\\t\\t\\t\\tfree will to accept or to reject those evil influences or\\n\\t\\t\\t\\timpulses. Razi, in particular, points in this context to\\n\\t\\t\\t\\tsurah {14}, verse {22}, according to which Satan will\\n\\t\\t\\t\\tthus address the sinners on Resurrection Day: \"I had no\\n\\t\\t\\t\\tpower at all over you: I but called you-and you responded\\n\\t\\t\\t\\tto me. Hence, blame not me, but blame yourselves.\" See\\n\\t\\t\\t\\talso note [31] on  14:22 , in which Razi's comment is\\n\\t\\t\\t\\tquoted verbatim."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "84",
    "NoteID": "73",
    "Body": "Lit., \"We number for them but a number\". Cf. also the\\n\\t\\t\\t\\tfirst sentence of verse {75} above."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "87",
    "NoteID": "74",
    "Body": "Lit., \"except him who has...\", etc. According to the\\n\\t\\t\\t\\tclassical commentators - including some of the most\\n\\t\\t\\t\\toutstanding Companions of the Prophet - the \"bond with\\n\\t\\t\\t\\tGod\" denotes, in this context, the realization of His\\n\\t\\t\\t\\toneness and uniqueness; for the wider implications of\\n\\t\\t\\t\\tthis term, see surah {2}, note [19]. Consequently, as\\n\\t\\t\\t\\tpointed out by Razi, even great sinners may hope for\\n\\t\\t\\t\\tGod's forgiveness - symbolically expressed by the right\\n\\t\\t\\t\\tof \"intercession\" which will be granted to the prophets\\n\\t\\t\\t\\ton Judgment Day (see note [7]on {10: 3}) - provided that,\\n\\t\\t\\t\\tduring their life on earth, they were aware of God's\\n\\t\\t\\t\\texistence and oneness."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "88",
    "NoteID": "75",
    "Body": "Lit., \"And\" (wa), connecting the present passage with\\n\\t\\t\\t\\tverse {81}."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "88",
    "NoteID": "76",
    "Body": "This allusion to the Christian belief in Jesus as \"the\\n\\t\\t\\t\\tson of God\" - and, in general, to every belief in God's\\n\\t\\t\\t\\t\"incarnation\" in a created being - takes up the theme\\n\\t\\t\\t\\tbroached in verse {81} above: namely, the deification of\\n\\t\\t\\t\\tpowers or beings other than God \"with a view to their\\n\\t\\t\\t\\tbeing a source of strength\" to those who turn to them.\\n\\t\\t\\t\\tBut whereas verse {81} refers specifically to the godless\\n\\t\\t\\t\\twho accord a quasi-divine status to material wealth and\\n\\t\\t\\t\\tpower and abandon themselves entirely to the pursuit of\\n\\t\\t\\t\\tworldly success, the present passage refers to people\\n\\t\\t\\t\\twho, while believing in God, deify prophets and saints,\\n\\t\\t\\t\\ttoo, in the subconscious hope that they might act as\\n\\t\\t\\t\\t\"mediators\" between them and the Almighty. Since this\\n\\t\\t\\t\\tdeification offends against the principle of God's\\n\\t\\t\\t\\ttranscendent oneness and uniqueness, it implies a breach\\n\\t\\t\\t\\tof man's \"bond with God\" and, if consciously persisted\\n\\t\\t\\t\\tin, constitutes an unforgivable sin (cf.  4:48  and\\n\\t\\t\\t\\t{116})."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "92",
    "NoteID": "77",
    "Body": "The idea that God might have a \"son\" - either in the real\\n\\t\\t\\t\\tor in the metaphorical sense of this term - would\\n\\t\\t\\t\\tpresuppose a degree of innate likeness between \"the\\n\\t\\t\\t\\tfather\" and \"the son\": but God is in every respect\\n\\t\\t\\t\\tunique, so that \"there is nothing like unto Him\" ({42:\\n\\t\\t\\t\\t11}) and \"nothing that could be compared with Him\" ({112:\\n\\t\\t\\t\\t4}). Moreover, the concept of \"progeny\" implies an\\n\\t\\t\\t\\torganic continuation of the progenitor, or of part of\\n\\t\\t\\t\\thim, in another being and, therefore, presupposes a\\n\\t\\t\\t\\tdegree of incompleteness before the act of procreation\\n\\t\\t\\t\\t(or incarnation, if the term \"sonship\" is used\\n\\t\\t\\t\\tmetaphorically): and the idea of incompleteness, in\\n\\t\\t\\t\\twhatever sense, negates the very concept of God. But even\\n\\t\\t\\t\\tif the idea of \"sonship\" is meant to express no more than\\n\\t\\t\\t\\tone of the different \"aspects\" of the One Deity (as is\\n\\t\\t\\t\\tclaimed in the Christian dogma of the \"Trinity\"), it is\\n\\t\\t\\t\\tdescribed in the Qur'an as blasphemous inasmuch as it\\n\\t\\t\\t\\tamounts to an attempt at defining Him who is \"sublimely\\n\\t\\t\\t\\texalted above anything that men may devise by way of\\n\\t\\t\\t\\tdefinition\" (see last sentence of  6:100 )."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "93",
    "NoteID": "78",
    "Body": "I.e., all of them - whether men or angels - are but\\n\\t\\t\\t\\tcreated beings, having no share whatever in His divinity,\\n\\t\\t\\t\\tand all of them submit, consciously or unconsciously, to\\n\\t\\t\\t\\tHis will (cf.  13:15  and {16:48-49})."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "95",
    "NoteID": "79",
    "Body": "See note [69] above."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "96",
    "NoteID": "80",
    "Body": "I.e., bestow on them His love and endow them with the\\n\\t\\t\\t\\tcapability to love His creation, as well as cause them to\\n\\t\\t\\t\\tbe loved by their fellow-men. As is shown in the next\\n\\t\\t\\t\\tverse, this gift of love is inherent in the guidance\\n\\t\\t\\t\\toffered to man through divine revelation."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "97",
    "NoteID": "81",
    "Body": "Since man is incapable of understanding the \"word\" of God\\n\\t\\t\\t\\tas such, it has always been revealed to him in his own,\\n\\t\\t\\t\\thuman tongue (cf.  14:4 -\"never have We sent forth any\\n\\t\\t\\t\\tapostle otherwise than [with a message] in his own\\n\\t\\t\\t\\tpeople's tongue\"), and has always been expounded in\\n\\t\\t\\t\\tconcepts accessible to the human mind: hence the\\n\\t\\t\\t\\treference to the Prophet's revelations as \"brought down\\n\\t\\t\\t\\tupon thy heart\" ({2: 97}), or \"[divine inspiration] has\\n\\t\\t\\t\\talighted with it upon thy heart\" ({26: 193-194})."
  },
  {
    "SurahNumber": "19",
    "AyahNumber": "98",
    "NoteID": "82",
    "Body": "I.e., civilization - a meaning which the term qarn has\\n\\t\\t\\t\\talso in the identical phrase in verse {74}."
  }
]
