[
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "5503",
    "Body": "Note that in the first instance the Prophet is himself\\n\\t\\t\\t\\taddressed individually, as the Teacher and representative\\n\\t\\t\\t\\tof the Community. Then the actual directions: \"when\\n\\t\\t\\t\\tye....\" are addressed to the Community collectively."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "5504",
    "Body": "\"Of all things permitted by law, Divorce is the most\\n\\t\\t\\t\\thateful in the sight of Allah\"; see Introduction to this\\n\\t\\t\\t\\tSura. The general directions and limitations of Divorce\\n\\t\\t\\t\\tmay be studied in ii. 228-232, 236-237, 241, and notes;\\n\\t\\t\\t\\talso iv. 35."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "5505",
    "Body": "'Iddat, as a technical term in divorce law, is explained\\n\\t\\t\\t\\tin n. 254 to ii. 228. Its general meaning is \"a\\n\\t\\t\\t\\tprescribed period\": in that general sense it is used in\\n\\t\\t\\t\\tii. 185 for a prescribed period for fasting."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "5506",
    "Body": "The prescribed period (see last note) is in the interests\\n\\t\\t\\t\\tof the wife, of the husband, of an unborn child (if there\\n\\t\\t\\t\\tis any), and of sex laws in nature, and therefore the\\n\\t\\t\\t\\telementary dictates of refined human society. In English\\n\\t\\t\\t\\tLaw the six months interval between the decree nisi and\\n\\t\\t\\t\\tthe decree absolute in divorce attains the same purpose\\n\\t\\t\\t\\tin a round-about way. The Commentators suggest that the\\n\\t\\t\\t\\tdivorce should not be pronounced during the courses. Read\\n\\t\\t\\t\\twith ii. 222, this implies that any incipient differences\\n\\t\\t\\t\\tbetween husband and wife should not be forced to an issue\\n\\t\\t\\t\\tat a time when sex is least attractive and almost\\n\\t\\t\\t\\trepulsive. Everything should be done to strengthen the\\n\\t\\t\\t\\tsocial and spiritual aspects of marriage and keep down\\n\\t\\t\\t\\tstray impulses of animal instinct. The parties are to\\n\\t\\t\\t\\tthink seriously in a mood of piety, keeping the fear of\\n\\t\\t\\t\\tAllah in their minds."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "5507",
    "Body": "As Islam treats the married woman as a full juristic\\n\\t\\t\\t\\tpersonality in every sense of the term a married woman\\n\\t\\t\\t\\thas a right, in the married state, to a house or\\n\\t\\t\\t\\tapartment of her own. And a house or apartment implies\\n\\t\\t\\t\\tthe reasonable expenses for its upkeep and for her own\\n\\t\\t\\t\\tand her children's maintenance. And this is obligatory\\n\\t\\t\\t\\tnot only in the married state, but during the 'iddat,\\n\\t\\t\\t\\twhich is necessarily a most trying period for the woman.\\n\\t\\t\\t\\tDuring this period she must not only not be turned out,\\n\\t\\t\\t\\tbut it is not decent for her to leave of her own accord,\\n\\t\\t\\t\\tlest the chances of reconciliation should be diminished:\\n\\t\\t\\t\\tsee the next note."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "5508",
    "Body": "A reconciliation is possible, and is indeed recommended\\n\\t\\t\\t\\tat every stage. The first serious difference between the\\n\\t\\t\\t\\tparties are to be submitted to a family council on which\\n\\t\\t\\t\\tboth sides are represented (iv. 35); divorce is not to be\\n\\t\\t\\t\\tpronounced when mutual physical attraction is at an ebb\\n\\t\\t\\t\\t(n. 5506); when it is pronounced, there should be a\\n\\t\\t\\t\\tperiod of probationary waiting: dower has to be paid and\\n\\t\\t\\t\\tdue provision has to be made for many things on equitable\\n\\t\\t\\t\\tterms; every facility has to be given for reconciliation\\n\\t\\t\\t\\ttill the last moment, and impediments are provided\\n\\t\\t\\t\\tagainst hasty impulses leading to rupture. \"Thou knowest\\n\\t\\t\\t\\tnot if perchance Allah will bring about thereafter some\\n\\t\\t\\t\\tnew situation.\""
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "2",
    "NoteID": "5509",
    "Body": "Cf. ii. 231. Everything should be done fairly and\\n\\t\\t\\t\\tsquarely, and all interests should be safeguarded."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "2",
    "NoteID": "5510",
    "Body": "Publicity and the establishment of proper evidence ensure\\n\\t\\t\\t\\tthat no one will act unjustly or selfishly. All should\\n\\t\\t\\t\\tremember that these are matters of serious import,\\n\\t\\t\\t\\taffecting our most intimate lives, and therefore our\\n\\t\\t\\t\\tposition in the next life."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "2",
    "NoteID": "5511",
    "Body": "In these very delicate and difficult matters, the wisdom\\n\\t\\t\\t\\tof jurists provides a less satisfactory solution than a\\n\\t\\t\\t\\tsincere desire to be just and true, which is described as\\n\\t\\t\\t\\tthe \"fear of Allah\". Where such a desire exists, Allah\\n\\t\\t\\t\\toften provides a solution in the most unexpected ways or\\n\\t\\t\\t\\tfrom the most unexpected quarters; e.g., the worst\\n\\t\\t\\t\\tenemies may be reconciled, or the cry or the smile of an\\n\\t\\t\\t\\tinfant baby may heal seemingly irreparable injuries or\\n\\t\\t\\t\\tunite hearts seemingly alienated for ever. And Faith is\\n\\t\\t\\t\\tfollowed at once by a psychological feeling of rest for\\n\\t\\t\\t\\tthe troubled spirit."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "3",
    "NoteID": "5512",
    "Body": "Our anger and our impatience have to be curbed. Our\\n\\t\\t\\t\\tfriends and our mates or associates may seem to us ever\\n\\t\\t\\t\\tso weak and unreasonable, and the circumstances may be\\n\\t\\t\\t\\tever so disheartening; yet we must trust in Allah. How\\n\\t\\t\\t\\tcan we measure our own weakness or perhaps blindness? He\\n\\t\\t\\t\\tknows all. His universal Purpose is always good. His Will\\n\\t\\t\\t\\tmust be accomplished, and we should wish for its\\n\\t\\t\\t\\taccomplishment. His ordering of the universe observes a\\n\\t\\t\\t\\tdue, just, and perfect proportion."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "4",
    "NoteID": "5513",
    "Body": "Cf. ii. 228, For normal women, the 'iddat is the three\\n\\t\\t\\t\\tmonthly courses after separation: if there are no courses\\n\\t\\t\\t\\tor if the courses are in doubt, it is three calendar\\n\\t\\t\\t\\tmonths. But that time it will be clear whether there is\\n\\t\\t\\t\\tpregnancy: if there is, the waiting period is still after\\n\\t\\t\\t\\tdelivery."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "4",
    "NoteID": "5514",
    "Body": "Cf. n. 5511. If there is a true and sincere desire to\\n\\t\\t\\t\\tobey the Will of Allah and do right the difficulties will\\n\\t\\t\\t\\tvanish, and these delicate matters will be settled for\\n\\t\\t\\t\\tthe greatest happiness of all."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "5",
    "NoteID": "5515",
    "Body": "Allah's ordinance is nothing arbitrary. \"It is to help\\n\\t\\t\\t\\tus, and to lead us on to our highest good, temporal and\\n\\t\\t\\t\\tspiritual. If we obey Allah, His wisdom will not only\\n\\t\\t\\t\\tsolve our difficulties, but it will remove other ills\\n\\t\\t\\t\\tthat we may have, subjective and objective. Like a good\\n\\t\\t\\t\\tshepherd, He will lead us on to more and more luscious\\n\\t\\t\\t\\tpastures. With each step higher, our position becomes\\n\\t\\t\\t\\tmore and more sure and our reward more and more precious."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "6",
    "NoteID": "5516",
    "Body": "Cf. n. 5507 above. A selfish man, because he has divorced\\n\\t\\t\\t\\this wife, may, in the probationary period before the\\n\\t\\t\\t\\tdivorce becomes absolute, treat her with contumely, and\\n\\t\\t\\t\\twhile giving her residence and maintenance, may so\\n\\t\\t\\t\\trestrict it as to make her life miserable. This is\\n\\t\\t\\t\\tforbidden. She must be provided on the same scale as he\\n\\t\\t\\t\\tis, according to his status in life. There is still hope\\n\\t\\t\\t\\tof reconciliation, and if not, yet the parting must be\\n\\t\\t\\t\\thonourable."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "6",
    "NoteID": "5517",
    "Body": "If there is pregnancy, a sacred third life comes on the\\n\\t\\t\\t\\tscene, for which there is added responsibility (perhaps\\n\\t\\t\\t\\tadded hope of reconciliation) for both parents. In any\\n\\t\\t\\t\\tcase no separation is possible until after the child is\\n\\t\\t\\t\\tborn. Even after birth, if no reconciliation between\\n\\t\\t\\t\\tparents is possible, yet for the nursing of the child and\\n\\t\\t\\t\\tfor its welfare the care of the mother remains the duty\\n\\t\\t\\t\\tof the father, and there must be mutual counsel between\\n\\t\\t\\t\\thim and the mother in all truth and sincerity."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "6",
    "NoteID": "5518",
    "Body": "\"If ye find yourselves in difficulties\": e.g., if the\\n\\t\\t\\t\\tmother's milk fails, or if her health fails, or if any\\n\\t\\t\\t\\tcircumstance arises which bars the natural course of the\\n\\t\\t\\t\\tmother nursing her own child. There may be psychological\\n\\t\\t\\t\\tdifficulties also."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "6",
    "NoteID": "5519",
    "Body": "That is, the father must stand all expenses."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "7",
    "NoteID": "5520",
    "Body": "We must trust in Allah, and do whatever is possible for\\n\\t\\t\\t\\tus in the interests of the young life for which we are\\n\\t\\t\\t\\tresponsible. We must not be frightened by difficulties.\\n\\t\\t\\t\\tAllah will give us relief and provide a solution if we\\n\\t\\t\\t\\tact with honest integrity. Cf. xciv. 5-6."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "8",
    "NoteID": "5521",
    "Body": "Insolent impiety consists not only in the breach of the\\n\\t\\t\\t\\trites of religion. Even more vital is the defiance of the\\n\\t\\t\\t\\tlaws of nature which Allah has made for us. These laws,\\n\\t\\t\\t\\tfor us human beings include those which relate to our\\n\\t\\t\\t\\tfellow-beings in society to whom kindness and\\n\\t\\t\\t\\tconsideration form the basis of our social duties. Our\\n\\t\\t\\t\\tduties to our families and our children in intimate\\n\\t\\t\\t\\tmatters such as were spoken of in the last Section, are\\n\\t\\t\\t\\tas important as any in our spiritual life. Peoples who\\n\\t\\t\\t\\tforgot the moral law in marriage or family life perished\\n\\t\\t\\t\\tin this world and will have no future in the Hereafter.\\n\\t\\t\\t\\tThe lessons apply not only to individuals but to whole\\n\\t\\t\\t\\tnations or social groups."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "8",
    "NoteID": "5522",
    "Body": "This refers to the present life: apparently the Hereafter\\n\\t\\t\\t\\tis implied in verse 10 below."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "10",
    "NoteID": "5523",
    "Body": "See last note."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "10",
    "NoteID": "5524",
    "Body": "There is no excuse for us to go astray, seeing that Allah\\n\\t\\t\\t\\tin His infinite Mercy has explained to us His Message by\\n\\t\\t\\t\\tHis many Signs around us and clearly by means of the\\n\\t\\t\\t\\thuman Teachers and Messengers whom He has sent for our\\n\\t\\t\\t\\tinstruction: see next verse."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "11",
    "NoteID": "5525",
    "Body": "Cf. xxiv. 40: the unbelievers' state is \"like the depths\\n\\t\\t\\t\\tof darkness in a vast deep ocean, overwhelmed with billow\\n\\t\\t\\t\\ttopped by billow, topped by dark clouds; depths of\\n\\t\\t\\t\\tdarkness, one above another.\" Cf. ii. 257; \"Allah is the\\n\\t\\t\\t\\tProtector of those who have Faith: from the depths of\\n\\t\\t\\t\\tdarkness He will lead them forth into light.\""
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "12",
    "NoteID": "5526",
    "Body": "\"Seven Firmaments.\" (Cf. ii. 29; xvii. 44; xxiii- 86; and\\n\\t\\t\\t\\txli. 12.)"
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "12",
    "NoteID": "5527",
    "Body": "Literally: they are seven in number, each one separate\\n\\t\\t\\t\\tfrom the other."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "12",
    "NoteID": "5528",
    "Body": "But in all spheres of life and Creation, whatever\\n\\t\\t\\t\\tconception we are able to form of them, it is certain\\n\\t\\t\\t\\tthat the Command or Law of Allah runs through them all,\\n\\t\\t\\t\\tfor His knowledge and power extend through all things."
  }
]
