[
    {
        "BookCode": "AMH",
        "VolumeNumber": "26",
        "hadithNumber": "1",
        "sectionHeading": "About The Aqiqa",
        "text": "Yahya related to me from Zayd ibn Aslam from a man of the Banu Damra that his father said, \"The Messenger of Allah, may Allah bless him and grant him peace, was asked about the Aqiqa. He said, 'I do not like disobedience (uquq),' as if he disliked the name. He said, 'If anyone has a child born to him, and wants to sacrifice for his child, then let him do it.' \""
    },
    {
        "BookCode": "AMH",
        "VolumeNumber": "26",
        "hadithNumber": "2",
        "sectionHeading": "About The Aqiqa",
        "text": "Yahya related to me from Malik from Jafar ibn Muhammad that his father said, \"Fatima, the daughter of the Messenger of Allah, may Allah bless him and grant him peace, weighed the hair of Hasan, Husayn, Zaynab and Umm Kulthum, and gave away in sadaqa an equivalent weight of silver.\""
    },
    {
        "BookCode": "AMH",
        "VolumeNumber": "26",
        "hadithNumber": "3",
        "sectionHeading": "About The Aqiqa",
        "text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman that Muhammad ibn Ali ibn al-Husayn said, \"Fatima, the daughter of the Messenger of Allah, may Allah bless him and grant him peace, weighed the hair of Hasan and Husayn, and gave away in sadaqa the equivalent weight in silver.\""
    },
    {
        "BookCode": "AMH",
        "VolumeNumber": "26",
        "hadithNumber": "4",
        "sectionHeading": "Behaviour in the Aqiqa",
        "text": "Yahya related to me from Malik from Nafi that if any of Abdullah ibn Umar's family asked him for an aqiqa, he would give it to them. He gave a sheep as aqiqa for both his male and female children."
    },
    {
        "BookCode": "AMH",
        "VolumeNumber": "26",
        "hadithNumber": "5",
        "sectionHeading": "Behaviour in the Aqiqa",
        "text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman that Muhammad ibn Ibrahim ibn al-Harith at-Taymi said, \"I heard my father say that the aqiqa was desirable, even if it was only a sparrow.\""
    },
    {
        "BookCode": "AMH",
        "VolumeNumber": "26",
        "hadithNumber": "6",
        "sectionHeading": "Behaviour in the Aqiqa",
        "text": "Yahya related to me from Malik that he heard that there had been an aqiqa for Hasan and Husayn, the sons of Ali ibn Abi Talib."
    },
    {
        "BookCode": "AMH",
        "VolumeNumber": "26",
        "hadithNumber": "7",
        "sectionHeading": "Behaviour in the Aqiqa",
        "text": "Yahya related to me from Malik from Hisham ibn Urwa that his father, Urwa ibn az-Zubayr made an aqiqa for his male and female children of a sheep each.  Malik said, \"What we do about the aqiqa is that if someone makes an aqiqa for his children, he gives a sheep for both male and female. The aqiqa is not obligatory but it is desirable to do it, and people continue to come to us about it. If someone makes an aqiqa for his children, the same rules apply as with all sacrificial animals - one-eyed, emaciated, injured, or sick animals must not be used, and neither the meat or the skin is to be sold. The bones are broken and the family eat the meat and give some of it away as sadaqa. The child is not smeared with any of the blood .''"
    }
]