[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/018001",
        "Body":  "Praise be to Allah Who hath revealed the Scripture unto His\n\t\t\tslave, and hath not placed therein any crookedness,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/018010",
        "Body":  "When the young men fled for refuge to the Cave and said: Our\n\t\t\tLord! Give us mercy from Thy presence and shape for us right\n\t\t\tconduct in our plight."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "100",
        "Recitation":  "Alafasy_128kbps/018100",
        "Body":  "On that day We shall present hell to the disbelievers, plain to\n\t\t\tview,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "101",
        "Recitation":  "Alafasy_128kbps/018101",
        "Body":  "Those whose eyes were hoodwinked from My reminder, and who could\n\t\t\tnot bear to hear."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "102",
        "Recitation":  "Alafasy_128kbps/018102",
        "Body":  "Do the disbelievers reckon that they can choose My bondmen as\n\t\t\tprotecting friends beside Me? Lo! We have prepared hell as a\n\t\t\twelcome for the disbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "103",
        "Recitation":  "Alafasy_128kbps/018103",
        "Body":  "Say: Shall We inform you who will be the greatest losers by their\n\t\t\tworks?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "104",
        "Recitation":  "Alafasy_128kbps/018104",
        "Body":  "Those whose effort goeth astray in the life of the world, and yet\n\t\t\tthey reckon that they do good work."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "105",
        "Recitation":  "Alafasy_128kbps/018105",
        "Body":  "Those are they who disbelieve in the revelations of their Lord\n\t\t\tand in the meeting with Him. Therefore their works are vain, and\n\t\t\ton the Day of Resurrection We assign no weight to them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "106",
        "Recitation":  "Alafasy_128kbps/018106",
        "Body":  "That is their reward: hell, because they disbelieved, and made a\n\t\t\tjest of Our revelations and Our messengers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "107",
        "Recitation":  "Alafasy_128kbps/018107",
        "Body":  "Lo! those who believe and do good works, theirs are the Gardens\n\t\t\tof Paradise, for welcome,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "108",
        "Recitation":  "Alafasy_128kbps/018108",
        "Body":  "Wherein they will abide, with no desire to be removed from\n\t\t\tthence."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "109",
        "Recitation":  "Alafasy_128kbps/018109",
        "Body":  "Say: Though the sea became ink for the Words of my Lord, verily\n\t\t\tthe sea would be used up before the Words of my Lord were\n\t\t\texhausted, even though We brought the like thereof to help."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/018011",
        "Body":  "Then We sealed up their hearing in the Cave for a number of\n\t\t\tyears."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "110",
        "Recitation":  "Alafasy_128kbps/018110",
        "Body":  "Say: I am only a mortal like you. My Lord inspireth in me that\n\t\t\tyour God is only One God. And whoever hopeth for the meeting with\n\t\t\this Lord, let him do righteous work, and make none sharer of the\n\t\t\tworship due unto his Lord."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/018012",
        "Body":  "And afterward We raised them up that We might know which of the\n\t\t\ttwo parties would best calculate the time that they had tarried."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/018013",
        "Body":  "We narrate unto thee their story with truth. Lo! they were young\n\t\t\tmen who believed in their Lord, and We increased them in\n\t\t\tguidance."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/018014",
        "Body":  "And We made firm their hearts when they stood forth and said: Our\n\t\t\tLord is the Lord of the heavens and the earth. We cry unto no god\n\t\t\tbeside Him, for then should we utter an enormity."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/018015",
        "Body":  "These, our people, have chosen (other) gods beside Him though\n\t\t\tthey bring no clear warrant (vouchsafed) to them. And who doth\n\t\t\tgreater wrong than he who inventeth a lie concerning Allah?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/018016",
        "Body":  "And when ye withdraw from them and that which they worship except\n\t\t\tAllah, then seek refuge in the Cave; your Lord will spread for\n\t\t\tyou of His mercy and will prepare for you a pillow in your\n\t\t\tplight."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/018017",
        "Body":  "And thou mightest have seen the sun when it rose move away from\n\t\t\ttheir cave to the right, and when it set go past them on the\n\t\t\tleft, and they were in the cleft thereof. That was (one) of the\n\t\t\tportents of Allah. He whom Allah guideth, he indeed is led\n\t\t\taright, and he whom He sendeth astray, for him thou wilt not find\n\t\t\ta guiding friend."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/018018",
        "Body":  "And thou wouldst have deemed them waking though they were asleep,\n\t\t\tand we caused them to turn over to the right and the left, and\n\t\t\ttheir dog stretching out his paws on the threshold. If thou hadst\n\t\t\tobserved them closely thou hadst assuredly turned away from them\n\t\t\tin flight, and hadst been filled with awe of them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/018019",
        "Body":  "And in like manner We awakened them that they might question one\n\t\t\tanother. A speaker from among them said : How long have ye\n\t\t\ttarried? They said: We have tarried a day or some part of a day,\n\t\t\t(Other) said: Your Lord best knoweth what ye have tarried. Now\n\t\t\tsend one of you with this your silver coin unto the city, and let\n\t\t\thim see what food is purest there and bring you a supply thereof.\n\t\t\tLet him be courteous and let no man know of you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/018002",
        "Body":  "(But hath made it) straight, to give warning of stern punishment\n\t\t\tfrom Him, and to bring unto the believers who do good works the\n\t\t\tnews that theirs will be a fair reward,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/018020",
        "Body":  "For they, if they should come to know of you, will stone you or\n\t\t\tturn you back to their religion; then ye will never prosper."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/018021",
        "Body":  "And in like manner We disclosed them (to the people of the city)\n\t\t\tthat they might know that the promise of Allah is true, and that,\n\t\t\tas for the Hour, there is no doubt concerning it. When (the\n\t\t\tpeople of the city) disputed of their case among themselves, they\n\t\t\tsaid: Build over them a building; their Lord knoweth best\n\t\t\tconcerning them. Those who won their point said: We verily shall\n\t\t\tbuild a place of worship over them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/018022",
        "Body":  "(Some) will say: They were three, their dog the fourth, and\n\t\t\t(some) say: Five, their dog the sixth, guessing at random; and\n\t\t\t(some) say: Seven, and their dog the eighth. Say (O Muhammad): My\n\t\t\tLord is best aware of their number. None knoweth them save a few.\n\t\t\tSo contend not concerning them except with an outward contending,\n\t\t\tand ask not any of them to pronounce concerning them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/018023",
        "Body":  "And say not of anything: Lo! I shall do that tomorrow,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/018024",
        "Body":  "Except if Allah will. And remember thy Lord when thou forgettest,\n\t\t\tand say: It may be that my Lord guideth me unto a nearer way of\n\t\t\ttruth than this."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/018025",
        "Body":  "And (it is said) they tarried in their Cave three hundred years\n\t\t\tand add nine."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/018026",
        "Body":  "Say: Allah is best aware how long they tarried. His is the\n\t\t\tInvisible of the heavens and the earth. How clear of sight is He\n\t\t\tand keen of hearing! They have no protecting friend beside Him,\n\t\t\tand He maketh none to share in His government."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/018027",
        "Body":  "And recite that which hath been revealed unto thee of the\n\t\t\tscripture of thy Lord. There is none who can change His words,\n\t\t\tand thou wilt find no refuge beside Him."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/018028",
        "Body":  "Restrain thyself along with those who cry unto their Lord at morn\n\t\t\tand evening, seeking His countenance; and let not thine eyes\n\t\t\toverlook them, desiring the pomp of the life of the world; and\n\t\t\tobey not him whose heart We have made heedless of Our\n\t\t\tremembrance, who followeth his own lust and whose case hath been\n\t\t\tabandoned."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/018029",
        "Body":  "Say: (It is) the truth from the Lord of you (all). Then whosoever\n\t\t\twill, let him believe, and whosoever will, let him disbelieve.\n\t\t\tLo! We have prepared for disbelievers Fire. Its tent encloseth\n\t\t\tthem. If they ask for showers, they will be showered with water\n\t\t\tlike to molten lead which burneth the faces. Calamitous the drink\n\t\t\tand ill the resting place!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/018003",
        "Body":  "Wherein they will abide for ever;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/018030",
        "Body":  "Lo! as for those who believe and do good works, Lo! We suffer not\n\t\t\tthe reward of one whose work is goodly to be lost."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/018031",
        "Body":  "As for such, theirs will be Gardens of Eden, wherein rivers flow\n\t\t\tbeneath them; therein they will be given armlets of gold and will\n\t\t\twear green robes of finest silk and gold embroidery, reclining\n\t\t\tupon thrones therein. Blest the reward, and fair the resting\n\t\t\tplace!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/018032",
        "Body":  "Coin for them a similitude: Two men, unto one of whom We had\n\t\t\tassigned two gardens of grapes, and We had surrounded both with\n\t\t\tdate palms and had put between them tillage."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/018033",
        "Body":  "Each of the gardens gave its fruit and withheld naught thereof.\n\t\t\tAnd We caused a river to gush forth therein."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/018034",
        "Body":  "And he had fruit. And he said unto his comrade, when he spake\n\t\t\twith him: I am more than thee in wealth, and stronger in respect\n\t\t\tof men."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/018035",
        "Body":  "And he went into his garden, while he (thus) wronged himself. He\n\t\t\tsaid: I think not that all this will ever perish."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/018036",
        "Body":  "I think not that the Hour will ever come, and if indeed I am\n\t\t\tbrought back unto my Lord I surely shall find better than this as\n\t\t\ta resort."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/018037",
        "Body":  "And his comrade, while he disputed with him, exclaimed:\n\t\t\tDisbelievest thou in Him Who created thee of dust, then of a drop\n\t\t\t(of seed), and then fashioned thee a man?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/018038",
        "Body":  "But He is Allah, my Lord, and I ascribe unto my Lord no partner."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/018039",
        "Body":  "If only, when thou enteredst thy garden, thou hadst said: That\n\t\t\twhich Allah willeth (will come to pass)! There is no strength\n\t\t\tsave in Allah! Though thou seest me as less than thee in wealth\n\t\t\tand children."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/018004",
        "Body":  "And to warn those who say: Allah hath chosen a son,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/018040",
        "Body":  "Yet it may be that my Lord will give me better than thy garden,\n\t\t\tand will send on it a bolt from heaven, and some morning it will\n\t\t\tbe a smooth hillside,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/018041",
        "Body":  "Or some morning the water thereof will he lost in the earth so\n\t\t\tthat thou canst not make search for it."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/018042",
        "Body":  "And his fruit was beset (with destruction). Then began he to\n\t\t\twring his hands for all that he had spent upon it, when (now) it\n\t\t\twas all ruined on its trellises, and to say: Would that I had\n\t\t\tascribed no partner to my Lord!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/018043",
        "Body":  "And he had no troop of men to help him as against Allah, nor\n\t\t\tcould he save himself."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/018044",
        "Body":  "In this case is protection only from Allah, the True. He is best\n\t\t\tfor reward, and best for consequence."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/018045",
        "Body":  "And coin for them the similitude of the life of the world as\n\t\t\twater which We send down from the sky, and the vegetation of the\n\t\t\tearth mingleth with it and then becometh dry twigs that the winds\n\t\t\tscatter. Allah is Able to do all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/018046",
        "Body":  "Wealth and children are an ornament of life of the world. But the\n\t\t\tgood deeds which endure are better in thy Lord\u0027s sight for\n\t\t\treward, and better in respect of hope."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/018047",
        "Body":  "And (bethink you of) the Day when We remove the hills and ye see\n\t\t\tthe earth emerging, and We gather them together so as to leave\n\t\t\tnot one of them behind."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/018048",
        "Body":  "And they are set before thy Lord in ranks (and it is said unto\n\t\t\tthem): Now verily have ye come unto Us as We created you at the\n\t\t\tfirst. But ye thought that We had set no tryst for you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/018049",
        "Body":  "And the Book is placed, and thou seest the guilty fearful of that\n\t\t\twhich is therein, and they say: What Kind of a book is this that\n\t\t\tleaveth not a small thing nor a great thing but hath counted it!\n\t\t\tAnd they find all that they did confronting them, and thy Lord\n\t\t\twrongeth no one."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/018005",
        "Body":  "(A thing) whereof they have no knowledge, nor (had) thee fathers.\n\t\t\tDreadful is the word that cometh out of their mouths. They speak\n\t\t\tnaught but a lie."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/018050",
        "Body":  "And (remember) when We said unto the angels: Fall prostrate\n\t\t\tbefore Adam, and they fell prostrate, all save Iblis. He was of\n\t\t\tthe Jinn, so he rebelled against his Lord\u0027s command. Will ye\n\t\t\tchoose him and his seed for your protecting friends instead of\n\t\t\tMe, when they are an enemy unto you? Calamitous is the exchange\n\t\t\tfor evil doers!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/018051",
        "Body":  "I made them not to witness the creation of the heavens and the\n\t\t\tearth, nor their own creation; nor choose I misleaders for (My)\n\t\t\thelpers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/018052",
        "Body":  "And (be mindful of) the Day when He will say: Call those partners\n\t\t\tof Mine whom ye pretended. Then they will cry unto them, but they\n\t\t\twill not hear their prayer, and We shall set a gulf of doom\n\t\t\tbetween them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/018053",
        "Body":  "And the guilty behold the Fire and know that they are about to\n\t\t\tfall therein, and they find no way of escape thence:"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/018054",
        "Body":  "And verily We have displayed for mankind in this Qur\u0027an all\n\t\t\tmanner of similitudes, but man is more than anything contentious."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/018055",
        "Body":  "And naught hindereth mankind from believing when the guidance\n\t\t\tcometh unto them, and from asking for forgiveness of their Lord,\n\t\t\tunless (it be that they wish) that the judgment of the men of old\n\t\t\tshould come upon them or (that) they should be confronted with\n\t\t\tthe Doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/018056",
        "Body":  "We send not the messengers save as bearers of good news and\n\t\t\twarners. Those who disbelieve contend with falsehood in order to\n\t\t\trefute the Truth thereby. And they take Our revelations and that\n\t\t\twherewith they are threatened as a jest."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/018057",
        "Body":  "And who doth greater wrong than he who hath been reminded of the\n\t\t\trevelations of his Lord, yet turneth away from them and\n\t\t\tforgetteth what his hands send forward (to the Judgment)? Lo! on\n\t\t\ttheir hearts We have placed coverings so that they understand\n\t\t\tnot, and in their ears a deafness. And though thou call them to\n\t\t\tthe guidance, in that case they can never be led aright."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/018058",
        "Body":  "Thy Lord is the Forgiver, Full of Mercy. If He took them to task\n\t\t\t(now) for what they earn, He would hasten on the doom for them;\n\t\t\tbut their is an appointed term from which they will find no\n\t\t\tescape."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/018059",
        "Body":  "And (all) those townships! We destroyed them when they did wrong,\n\t\t\tand We appointed a fixed time for their destruction."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/018006",
        "Body":  "Yet it may be, if they believe not in this statement, that thou\n\t\t\t(Muhammad) wilt torment thy soul with grief over their footsteps."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/018060",
        "Body":  "And when Moses said unto his servant: I will not give up until I\n\t\t\treach the point where the two rivers meet, though I march on for\n\t\t\tages."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/018061",
        "Body":  "And when they reached the point where the two met, they forgot\n\t\t\ttheir fish, and it took its way into the waters, being free."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/018062",
        "Body":  "And when they had gone further, he said unto his servant: Bring\n\t\t\tus our breakfast. Verily we have found fatigue in this our\n\t\t\tjourney."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/018063",
        "Body":  "He said: Didst thou see, when we took refuge on the rock, and I\n\t\t\tforgot the fish and none but Satan caused me to forget to mention\n\t\t\tit, it took its way into the waters by a marvel."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/018064",
        "Body":  "He said: This is that which we have been seeking. So they\n\t\t\tretraced their steps again."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/018065",
        "Body":  "Then found they one of Our slaves, unto whom We had given mercy\n\t\t\tfrom Us, and had taught him knowledge from Our presence."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/018066",
        "Body":  "Moses said unto him: May I follow thee, to the end that thou\n\t\t\tmayst teach me right conduct of that which thou hast been taught?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/018067",
        "Body":  "He said: Lo! thou canst not bear with me."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/018068",
        "Body":  "How canst thou bear with that whereof thou canst not compass any\n\t\t\tknowledge?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/018069",
        "Body":  "He said: Allah willing, thou shalt find me patient and I shall\n\t\t\tnot in aught gainsay thee:"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/018007",
        "Body":  "Lo! We have placed all that is in the earth as an ornament\n\t\t\tthereof that we may try them: which of them is best in conduct."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/018070",
        "Body":  "He said: Well, if thou go with me, ask me not concerning aught\n\t\t\ttill I myself mention of it unto thee."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/018071",
        "Body":  "So the twain set out till, when they were in the ship, he made a\n\t\t\thole therein. (Moses) said: Hast thou made a hole therein to\n\t\t\tdrown the folk thereof? Thou verily hast done a dreadful thing."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/018072",
        "Body":  "He said: Did I not tell thee thou couldst not bear with me?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/018073",
        "Body":  "(Moses) said: Be not wroth with me that I forgot, and be not hard\n\t\t\tupon me for my fault."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/018074",
        "Body":  "So the twain journeyed on till, when they met a lad, he slew him.\n\t\t\t(Moses) said: What! Hast thou slain an innocent soul who hath\n\t\t\tslain no man? Verily thou hast done a horrid thing."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/018075",
        "Body":  "He said: Did I not tell thee that thou couldst not bear with me? \n\t\t\t\t `"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/018076",
        "Body":  "(Moses) said: If I ask thee after this concerning aught, keep not\n\t\t\tcompany with me. Thou hast received an excuse from me."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/018077",
        "Body":  "So they twain journeyed on till, when they came unto the folk of\n\t\t\ta certain township, they asked its folk for food, but they\n\t\t\trefused to make them guests. And they found therein a wall upon\n\t\t\tthe point of falling into ruin, and he repaired it. (Moses) said\n\t\t\t: If thou hadst wished, thou couldst have taken payment for it."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/018078",
        "Body":  "He said: This is the parting between thee and me! I will announce\n\t\t\tunto thee the interpretation of that thou couldst not bear with\n\t\t\tpatience."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/018079",
        "Body":  "As for the ship, it belonged to poor people working on the river,\n\t\t\tand I wished to mar it, for there was a king behind them who is\n\t\t\ttaking every ship by force."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/018008",
        "Body":  "And lo! We shall make all that is therein a barren mound."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/018080",
        "Body":  "And as for the lad, his parents were believers and We feared lest\n\t\t\the should oppress them by rebellion and disbelief."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/018081",
        "Body":  "And We intended that their Lord should change him for them for\n\t\t\tone better in purity and nearer to mercy."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/018082",
        "Body":  "And as for the wall, it belonged to two orphan boys in the city,\n\t\t\tand there was beneath it a treasure belonging to them and their\n\t\t\tfather had been righteous, and thy Lord intended that they should\n\t\t\tcome to their full strength and should bring forth their treasure\n\t\t\tas a mercy from their Lord; and I did it not upon my own command.\n\t\t\tSuch is the interpretation of that wherewith thou couldst not\n\t\t\tbear."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/018083",
        "Body":  "They will ask thee of Dhul-Qarneyn. Say: I shall recite unto you\n\t\t\ta remembrance of him."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/018084",
        "Body":  "Lo! We made him strong in the land and gave unto every thing a\n\t\t\troad."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/018085",
        "Body":  "And he followed a road"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/018086",
        "Body":  "Till, when he reached the setting place of the sun, he found it\n\t\t\tsetting in a muddy spring, and found a people thereabout: We\n\t\t\tsaid: O Dhul-Qarneyn! Either punish or show them kindness."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/018087",
        "Body":  "He said: As for him who doeth wrong, we shall punish him, and\n\t\t\tthen he will be brought back unto, his Lord, who will punish him\n\t\t\twith awful punishment!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/018088",
        "Body":  "But as for him who believeth and doeth right, good will be his\n\t\t\treward, and We shall speak unto him a mild command."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "89",
        "Recitation":  "Alafasy_128kbps/018089",
        "Body":  "Then he followed a road"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/018009",
        "Body":  "Or deemest thou that the People of the Cave and the Inscription\n\t\t\tare a wonder among Our portents?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "90",
        "Recitation":  "Alafasy_128kbps/018090",
        "Body":  "Till, when he reached the rising place of the sun, he found it\n\t\t\trising on a people for whom We had appointed no helper therefrom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "91",
        "Recitation":  "Alafasy_128kbps/018091",
        "Body":  "So (it was). And We knew all concerning him."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "92",
        "Recitation":  "Alafasy_128kbps/018092",
        "Body":  "Then he followed a road"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "93",
        "Recitation":  "Alafasy_128kbps/018093",
        "Body":  "Till, when he came between the two mountains, he found upon their\n\t\t\thither side a folk that scarce could understand a saying."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "94",
        "Recitation":  "Alafasy_128kbps/018094",
        "Body":  "They said: O Dhul-Qarneyn! Lo! Gog and Magog are spoiling the\n\t\t\tland. So may we pay thee tribute on condition that thou set a\n\t\t\tbarrier between us and them?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "95",
        "Recitation":  "Alafasy_128kbps/018095",
        "Body":  "He said: That wherein my Lord hath established me better (than\n\t\t\tyour tribute). Do but help me with strength (of men), I will set\n\t\t\tbetween you and them a bank."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "96",
        "Recitation":  "Alafasy_128kbps/018096",
        "Body":  "Give me pieces of iron--till, when he had levelled up (the gap)\n\t\t\tbetween the cliffs, he said: Blow!--till, when he had made it a\n\t\t\tfire, he said: Bring me molten copper to pour thereon."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "97",
        "Recitation":  "Alafasy_128kbps/018097",
        "Body":  "And (Gog and Magog) were not able to surmount, nor could they\n\t\t\tpierce (it)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "98",
        "Recitation":  "Alafasy_128kbps/018098",
        "Body":  "He said: This is a mercy from my Lord; but when the promise of my\n\t\t\tLord cometh to pass, He will lay it low, for the promise of my\n\t\t\tLord is true."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "18",
        "AyahNumber":  "99",
        "Recitation":  "Alafasy_128kbps/018099",
        "Body":  "And on that day We shall let some of them surge against others,\n\t\t\tand the Trumpet will be blown. Then We shall gather them together\n\t\t\tin one gathering."
    }
]
