[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "38",
        "bookName": "Book of Manners",
        "bookNameArabic": "كتاب الآداب",
        "hadiths": [
            {
                "hadithNo": "5586",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Anas said: \"A man called out to another man in Al-Baqi': 'O Abul-Qasim!' The Messenger of Allah (s.a.w) turned to him. (But) he said: 'O Messenger of Allah, I did not mean you; I was calling so-and-so.' The Messenger of Allah (s.a.w) said: 'You may call yourselves by my name but do not call yourselves by my Kunyah.\"'",
                "hadithArabic": "حَدَّثَنِي أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ وَابْنُ أَبِي عُمَرَ ، قَالَ أَبُو كُرَيْبٍ : أَخْبَرَنَا ، وقَالَ ابْنُ أَبِي عُمَرَ ، حَدَّثَنَا وَاللَّفْظُ لَهُ ، قَالاَ : حَدَّثَنَا مَرْوَانُ يَعْنِيَانِ الْفَزَارِيَّ ، عَنْ حُمَيْدٍ ، عَنْ أَنَسٍ ، قَالَ : نَادَى رَجُلٌ رَجُلاً بِالْبَقِيعِ يَا أَبَا الْقَاسِمِ فَالْتَفَتَ إِلَيْهِ رَسُولُ اللهِ فَقَالَ يَا رَسُولَ اللهِ ، إِنِّي لَمْ أَعْنِكَ إِنَّمَا دَعَوْتُ فُلاَنًا ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : تَسَمَّوْا بِاسْمِي وَلاَ تَكَنَّوْا بِكُنْيَتِي."
            },
            {
                "hadithNo": "5587",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah (s.a.w) said: 'The most beloved of your names to Allah are 'Abdullah and 'Abdur-Rahman.\"'",
                "hadithArabic": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ زِيَادٍ وَهُوَ الْمُلَقَّبُ بِسَبَلاَنَ ، أَخْبَرَنَا عَبَّادُ بْنُ عَبَّادٍ ، عَنْ عُبَيْدِ اللهِ بْنِ عُمَرَ ، وَأَخِيهِ عَبْدِ اللهِ ، سَمِعَهُ مِنْهُمَا سَنَةَ أَرْبَعٍ وَأَرْبَعِينَ وَمِئَةٍ ، يُحَدِّثَانِ عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِنَّ أَحَبَّ أَسْمَائِكُمْ إِلَى اللهِ عَبْدُ اللهِ وَعَبْدُ الرَّحْمَنِ."
            },
            {
                "hadithNo": "5588",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Salim bin Abu Ja'd that Jabir bin 'Abdullah said: \"A boy was born to a man among us, and he called him Muhammad. His people said to him: 'We will not let you call him by 'the name of the Messenger of Allah (s.a.w).' He took his son, carrying him on his back, and brought him to the Prophet (s.a.w), and he said: 'O Messenger of Allah, a boy had been born to me and I named him Muhammad, but my people said to me: \"We will not let you call him by the name of the Messenger of Allah (s.a.w). \"'The Messenger of Allah (s.a.w) said: 'You may call yourselves by my name but do not call yourselves by my Kunyah, for I am Qasim (distributor), I distribute (Allah's blessings) among you.'\"",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ ، قَالَ عُثْمَانُ : حَدَّثَنَا ، وقَالَ إِسْحَاقُ : أَخْبَرَنَا جَرِيرٌ ، عَنْ مَنْصُورٍ ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، قَالَ : وُلِدَ لِرَجُلٍ مِنَّا غُلاَمٌ فَسَمَّاهُ مُحَمَّدًا ، فَقَالَ لَهُ قَوْمُهُ : لاَ نَدَعُكَ تُسَمِّي بِاسْمِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَانْطَلَقَ بِابْنِهِ حَامِلَهُ عَلَى ظَهْرِهِ فَأَتَى بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ : يَا رَسُولَ اللهِ ، وُلِدَ لِي غُلاَمٌ فَسَمَّيْتُهُ مُحَمَّدًا فَقَالَ لِي قَوْمِي : لاَ نَدَعُكَ تُسَمِّي بِاسْمِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : تَسَمَّوْا بِاسْمِي وَلاَ تَكْتَنُوا بِكُنْيَتِي ، فَإِنَّمَا أَنَا قَاسِمٌ أَقْسِمُ بَيْنَكُمْ."
            },
            {
                "hadithNo": "5589",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"A boy was born to a man among us and he called him Muhammad. We said: 'We will not allow you to call him by the name of the Messenger of Allah (s.a.w) until you consult him.' So he went to him and said: 'A boy has been born to me and I called him after the Messenger of Allah, but my people refused to call me after him (i.e., Abu Muhammad) until I ask permission from the Prophet (s.a.w).' He (s.a.w) said: 'You may call yourselves by my name but not my Kunyah, for I have only been sent as a Qasim (distributor), I distribute (Allah's blessings) among you.\"'",
                "hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ ، حَدَّثَنَا عَبْثَرٌ ، عَنْ حُصَيْنٍ ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، قَالَ : وُلِدَ لِرَجُلٍ مِنَّا غُلاَمٌ ، فَسَمَّاهُ مُحَمَّدًا فَقُلْنَا : لاَ نَكْنِكَ بِرَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، حَتَّى تَسْتَأْمِرَهُ ، قَالَ فَأَتَاهُ ، فَقَالَ : إِنَّهُ وُلِدَ لِي غُلاَمٌ فَسَمَّيْتُهُ بِرَسُولِ اللهِ , وَإِنَّ قَوْمِي أَبَوْا أَنْ يَكْنُونِي بِهِ حَتَّى تَسْتَأْذِنَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ : سَمُّوا بِاسْمِي ، وَلاَ تَكَنَّوْا بِكُنْيَتِي ، فَإِنَّمَا بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ."
            },
            {
                "hadithNo": "5590",
                "chapterNo": "1",
                "hadithEnglish": "It was· narrated from Husain with this chain (a Hadith similar to no. 5589), but he did not mention (the phrase): \"For I have been sent as a Qasim (distributor), I distribute (Allah's blessings) among you.\"",
                "hadithArabic": "حَدَّثَنَا رِفَاعَةُ بْنُ الْهَيْثَمِ الْوَاسِطِيُّ ، حَدَّثَنَا خَالِدٌ يَعْنِي الطَّحَّانَ ، عَنْ حُصَيْنٍ ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ فَإِنَّمَا بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ."
            },
            {
                "hadithNo": "5591",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"The Messenger of Allah (s.a.w) said: 'You may call yourselves by my name but do not call yourselves by my Kunyah, for I am Abul-Qasim, I distribute (Allah's blessings) among you.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا وَكِيعٌ ، عَنِ الأَعْمَشِ (ح) وحَدَّثَنِي أَبُو سَعِيدٍ الأَشَجُّ ، حَدَّثَنَا وَكِيعٌ ، حَدَّثَنَا الأَعْمَشُ ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : تَسَمَّوْا بِاسْمِي ، وَلاَ تَكَنَّوْا بِكُنْيَتِي ، فَإِنِّي أَنَا أَبُو الْقَاسِمِ أَقْسِمُ بَيْنَكُمْ. وَفِي رِوَايَةِ أَبِي بَكْرٍ وَلاَ تَكْتَنُوا."
            },
            {
                "hadithNo": "5592",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Al-A'mash with this chain of narrators, and he said: \"I have only been appointed as a Qasim (distributor), I distribute among you.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ ، حَدَّثَنَا أَبُو مُعَاوِيَةَ ، عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ وَقَالَ : إِنَّمَا جُعِلْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ."
            },
            {
                "hadithNo": "5593",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah that a boy was born to an Ansari man and he wanted to call him Muhammad, so he came to the Prophet (s.a.w) and asked him, and he (s.a.w) said: \"The Ansar have done well; you may call yourselves by my name and you do not call yourselves by my Kunyah.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، وَمُحَمَّدُ بْنُ بَشَّارٍ ، قَالاَ : حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، سَمِعْتُ قَتَادَةَ ، عَنْ سَالِمٍ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، أَنَّ رَجُلاً مِنَ الأَنْصَارِ وُلِدَ لَهُ غُلاَمٌ ، فَأَرَادَ أَنْ يُسَمِّيَهُ مُحَمَّدًا ، فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ ، فَقَالَ : أَحْسَنَتِ الأَنْصَارُ سَمُّوا بِاسْمِي ، وَلاَ تَكْتَنُوا بِكُنْيَتِي."
            },
            {
                "hadithNo": "5594",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah from the Prophet (s.a.w)... a Hadith like that of Zakariyya. In the Hadith of An-Nadr it is narrated that Shu'bah said: \"And Husain and Sulaiman added - Husain said: 'The Messenger of Allah (s.a.w) said: \"I have only been sent as a Qasim (distributor), I distribute (Allah's blessings) among you.\" And Sulaiman said: \"I am only a Qasim (distributor), I distribute (Allah's blessings) among you.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَمُحَمَّدُ بْنُ الْمُثَنَّى ، كِلاَهُمَا ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ ، عَنْ شُعْبَةَ ، عَنْ مَنْصُورٍ (ح) وحَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ ، حَدَّثَنَا مُحَمَّدٌ ، يَعْنِي ابْنَ جَعْفَرٍ (ح) وَحَدَّثَنَا ابْنُ الْمُثَنَّى ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ ، كِلاَهُمَا ، عَنْ شُعْبَةَ ، عَنْ حُصَيْنٍ (ح) وحَدَّثَنِي بِشْرُ بْنُ خَالِدٍ ، أَخْبَرَنَا مُحَمَّدٌ ، يَعْنِي ابْنَ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ سُلَيْمَانَ ، , كُلُّهُمْ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ.\r\n(ح) وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ ، وَإِسْحَاقُ بْنُ مَنْصُورٍ ، قَالاَ : أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ قَتَادَةَ ، وَمَنْصُورٍ ، وَسُلَيْمَانَ ، وَحُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ ، قَالُوا : سَمِعْنَا سَالِمَ بْنَ أَبِي الْجَعْدِ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِ مَنْ ذَكَرْنَا حَدِيثَهُمْ مِنْ قَبْلُ. وَفِي حَدِيثِ النَّضْرِ ، عَنْ شُعْبَةَ ، قَالَ : وَزَادَ فِيهِ حُصَيْنٌ ، وَسُلَيْمَانُ ، قَالَ حُصَيْنٌ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِنَّمَا بُعِثْتُ قَاسِمًا أَقْسِمُ بَيْنَكُمْ. و قَالَ سُلَيْمَانُ : فَإِنَّمَا أَنَا قَاسِمٌ أَقْسِمُ بَيْنَكُمْ."
            },
            {
                "hadithNo": "5595",
                "chapterNo": "1",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"A boy was born to a man among us, and he called him Al-Qasim. We said: 'We will not call you Abul-Qasim, and we will not give you that pleasure.' He went to the Prophet (s.a.w) and told him about that, and he said: 'Call your son 'Abdur-Rahman.\"'",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ ، جَمِيعًا عَنْ سُفْيَانَ ، قَالَ عَمْرٌو : حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ، حَدَّثَنَا ابْنُ الْمُنْكَدِرِ ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ ، يَقُولُ : وُلِدَ لِرَجُلٍ مِنَّا غُلاَمٌ فَسَمَّاهُ الْقَاسِمَ فَقُلْنَا : لاَ نَكْنِيكَ أَبَا الْقَاسِمِ ، وَلاَ نُنْعِمُكَ عَيْنًا ، فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَذَكَرَ ذَلِكَ لَهُ فَقَالَ : أَسْمِ ابْنَكَ عَبْدَ الرَّحْمَنِ."
            },
            {
                "hadithNo": "5596",
                "chapterNo": "1",
                "hadithEnglish": "A Hadith like that of Ibn 'Uyaynah was narrated from Jabir, except that he did not mention (the phrase) 'we will not give you that pleasure.'",
                "hadithArabic": "وحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ ، حَدَّثَنَا يَزِيدُ ، يَعْنِي ابْنَ زُرَيْعٍ (ح) وَحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ ، حَدَّثَنَا إِسْمَاعِيلُ ، يَعْنِي ابْنَ عُلَيَّةَ ، كِلاَهُمَا ، عَنْ رَوْحِ بْنِ الْقَاسِمِ ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ ، عَنْ جَابِرٍ ، ... بِمِثْلِ حَدِيثِ ابْنِ عُيَيْنَةَ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ : وَلاَ نُنْعِمُكَ عَيْنًا."
            },
            {
                "hadithNo": "5597",
                "chapterNo": "1",
                "hadithEnglish": "Abu Hurairah said: Abul-Qasim (s.a.w) said: \"You may call yourselves by my name but do not call yourselves by my Kunyah.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَعَمْرٌو النَّاقِدُ ، وَزُهَيْرُ بْنُ حَرْبٍ ، وَابْنُ نُمَيْرٍ ، قَالُوا : حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ، عَنْ أَيُّوبَ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ ، قَالَ : سَمِعْتُ أَبَا هُرَيْرَةَ ، يَقُولُ : قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : تَسَمَّوْا بِاسْمِي ، وَلاَ تَكَنَّوْا بِكُنْيَتِي.\r\nقَالَ عَمْرٌو ، عَنْ أَبِي هُرَيْرَةَ وَلَمْ يَقُلْ سَمِعْتُ."
            },
            {
                "hadithNo": "5598",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Al-Mughirah bin Shu'bah said: \"When I came to Najran, they asked me: 'You recite (the Verse) 'O sister of Harun, but Musa came such-and-such a number of years before 'Eisa.' So when I returned I asked Allah's Messenger about that, and he said: 'They used to name their children after the Prophets and the righteous who came before them.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَمُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ ، وَأَبُو سَعِيدٍ الأَشَجُّ ، وَمُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ ، وَاللَّفْظُ لاِبْنِ نُمَيْرٍ ، قَالُوا : حَدَّثَنَا ابْنُ إِدْرِيسَ ، عَنْ أَبِيهِ ، عَنْ سِمَاكِ بْنِ حَرْبٍ ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ ، قَالَ : لَمَّا قَدِمْتُ نَجْرَانَ سَأَلُونِي ، فَقَالُوا : إِنَّكُمْ تَقْرَؤُونَ يَا أُخْتَ هَارُونَ ، وَمُوسَى قَبْلَ عِيسَى بِكَذَا وَكَذَا ، فَلَمَّا قَدِمْتُ عَلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلْتُهُ عَنْ ذَلِكَ ، فَقَالَ : إِنَّهُمْ كَانُوا يُسَمُّونَ بِأَنْبِيَائِهِمْ وَالصَّالِحِينَ قَبْلَهُمْ."
            },
            {
                "hadithNo": "5599",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Samurah bin Jundab said: \"The Messenger of Allah (s.a.w) forbade us from giving our slaves four names: Aflah (successful), Rabah (profit), Yasar (wealth) and Nafi' (beneficial).\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، قَالَ أَبُو بَكْرٍ : حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ ، عَنِ الرُّكَيْنِ ، عَنْ أَبِيهِ ، عَنْ سَمُرَةَ . وقَالَ يَحْيَى : أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ ، قَالَ : سَمِعْتُ الرُّكَيْنَ ، يُحَدِّثُ عَنْ أَبِيهِ ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ ، قَالَ : نَهَانَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُسَمِّيَ رَقِيقَنَا بِأَرْبَعَةِ أَسْمَاءٍ : أَفْلَحَ ، وَرَبَاحٍ ، وَيَسَارٍ ، وَنَافِعٍ."
            },
            {
                "hadithNo": "5600",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Samurah bin Jundab said: \"The Messenger of Allah (s.a.w) said: 'Do not call your boys Rabah, Yasar, Aflah or Nafi' .'\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا جَرِيرٌ ، عَنِ الرُّكَيْنِ بْنِ الرَّبِيعِ ، عَنْ أَبِيهِ ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : لاَ تُسَمِّ غُلاَمَكَ رَبَاحًا ، وَلاَ يَسَارًا ، وَلاَ أَفْلَحَ ، وَلاَ نَافِعًا."
            },
            {
                "hadithNo": "5601",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Samurah bin Jundab said: \"The Messenger of Allah (s.a.w) said: 'The most beloved· of words to Allah are four: Subhan-Allah (Glory be to Allah), Al-Hamdu-Lillah (praise be to Allah), La ilaha illallah (none has the right to be worshiped but Allah) and Allahu-Akbar (Allah is most Great), and it does not matter with which of them you start. And do not call your boys Yasar, Rabah, Najih or Aflah, for you will say: 'Is he there,' and if he is not you will say: 'No.\"' \"They are only four, and do not ask me any more.\"",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ يُونُسَ ، حَدَّثَنَا زُهَيْرٌ ، حَدَّثَنَا مَنْصُورٌ ، عَنْ هِلاَلِ بْنِ يَسَافٍ ، عَنْ رَبِيعِ بْنِ عُمَيْلَةَ ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَحَبُّ الْكَلاَمِ إِلَى اللهِ أَرْبَعٌ : سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلَّهِ ، وَلاَ إِلَهَ إِلاَّ اللَّهُ ، وَاللَّهُ أَكْبَرُ . لاَ يَضُرُّكَ بِأَيِّهِنَّ بَدَأْتَ وَلاَ تُسَمِّيَنَّ غُلاَمَكَ يَسَارًا ، وَلاَ رَبَاحًا ، وَلاَ نَجِيحًا ، وَلاَ أَفْلَحَ ، فَإِنَّكَ تَقُولُ : أَثَمَّ هُوَ ؟ فَلاَ يَكُونُ فَيَقُولُ : لاَ.\r\nإِنَّمَا هُنَّ أَرْبَعٌ فَلاَ تَزِيدُنَّ عَلَيَّ."
            },
            {
                "hadithNo": "5602",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Mansur with the chain of Zuhair. As for the Hadith of Jarir and Rawh, it is like the Hadith of Zuhair. As for the Hadith of Shu'bah, it only mentions the naming of boys, it does not mention the four words.",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنِي جَرِيرٌ (ح) وحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ ، حَدَّثَنَا رَوْحٌ ، وَهُوَ ابْنُ الْقَاسِمِ (ح) وحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، وَابْنُ بَشَّارٍ ، قَالاَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، كُلُّهُمْ عَنْ مَنْصُورٍ ، بِإِسْنَادِ زُهَيْرٍ.\r\nفَأَمَّا حَدِيثُ جَرِيرٍ وَرَوْحٍ فَكَمِثْلِ حَدِيثِ زُهَيْرٍ بِقِصَّتِهِ. وَأَمَّا حَدِيثُ شُعْبَةَ فَلَيْسَ فِيهِ إِلاَّ ذِكْرُ تَسْمِيَةِ الْغُلاَمِ وَلَمْ يَذْكُرِ الْكَلاَمَ الأَرْبَعَ."
            },
            {
                "hadithNo": "5603",
                "chapterNo": "2",
                "hadithEnglish": "Abu Az-Zubair narrated that Jabir bin 'Abdullah said: \"The Prophet (s.a.w) wanted to forbid using the names Ya'la (elevated), Barakah (blessing), Aflah (successful), Yasar (wealth), Nafi' (beneficial) etc., then I saw that he remained quiet about them after that and did not say anything. Then the Messenger of Allah (s.a.w) passed away without having forbidden that. Then 'Umar wanted to forbid that but then he did not.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ ، حَدَّثَنَا رَوْحٌ ، حَدَّثَنَا ابْنُ جُرَيْجٍ ، أَخْبَرَنِي أَبُو الزُّبَيْرِ ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ ، يَقُولُ : أَرَادَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْهَى عَنْ أَنْ يُسَمَّى بِيَعْلَى ، وَبِبَرَكَةَ ، وَبِأَفْلَحَ ، وَبِيَسَارٍ ، وَبِنَافِعٍ وَبِنَحْوِ ذَلِكَ ، ثُمَّ رَأَيْتُهُ سَكَتَ بَعْدُ عَنْهَا ، فَلَمْ يَقُلْ شَيْئًا ، ثُمَّ قُبِضَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَنْهَ عَنْ ذَلِكَ ثُمَّ أَرَادَ عُمَرُ أَنْ يَنْهَى عَنْ ذَلِكَ ثُمَّ تَرَكَهُ."
            },
            {
                "hadithNo": "5604",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Messenger of Allah (s.a.w) changed the name of 'Asiyah (meaning disobedient) and said: \"You are Jamilah (meaning beautiful).\"",
                "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ ، وَزُهَيْرُ بْنُ حَرْبٍ ، وَمُحَمَّدُ بْنُ الْمُثَنَّى ، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ ، وَمُحَمَّدُ بْنُ بَشَّارٍ ، قَالُوا : حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللهِ ، أَخْبَرَنِي نَافِعٌ ، عَنِ ابْنِ عُمَرَ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيَّرَ اسْمَ عَاصِيَةَ وَقَالَ : أَنْتِ جَمِيلَةُ.\r\nقَالَ أَحْمَدُ : مَكَانَ أَخْبَرَنِي عَنْ."
            },
            {
                "hadithNo": "5605",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Ibn 'Umar that a daughter of 'Umar was called 'Asiyah, and the Messenger of Allah (s.a.w) renamed her Jamilah.",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، عَنْ عُبَيْدِ اللهِ ، عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ : أَنَّ ابْنَةً لِعُمَرَ كَانَتْ يُقَالُ لَهَا عَاصِيَةُ فَسَمَّاهَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمِيلَةَ."
            },
            {
                "hadithNo": "5606",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: \"Juwairiyah's name was Barrah (meaning pious) and the Messenger of Allah (s.a.w) changed her name to Juwairiyah. He did not like it to be said that he had left the company of a pious woman.\"",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ ، وَابْنُ أَبِي عُمَرَ ، وَاللَّفْظُ لِعَمْرٍو ، قَالاَ : حَدَّثَنَا سُفْيَانُ ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ ، مَوْلَى آلِ طَلْحَةَ ، عَنْ كُرَيْبٍ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : كَانَتْ جُوَيْرِيَةُ اسْمُهَا بَرَّةُ فَحَوَّلَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْمَهَا جُوَيْرِيَةَ ، وَكَانَ يَكْرَهُ أَنْ يُقَالَ : خَرَجَ مِنْ عِنْدَ بَرَّةَ. وَفِي حَدِيثِ ابْنِ أَبِي عُمَرَ ، عَنْ كُرَيْبٍ قَالَ : سَمِعْتُ ابْنَ عَبَّاسٍ."
            },
            {
                "hadithNo": "5607",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Abu Hurairah that Zainab's name was Barrah, and it was said: \"She is praising herself.\" So the Messenger of Allah (s.a.w) named her Zainab.",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَمُحَمَّدُ بْنُ الْمُثَنَّى ، وَمُحَمَّدُ بْنُ بَشَّارٍ ، قَالُوا : حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ ، سَمِعْتُ أَبَا رَافِعٍ ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ (ح) وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا شُعْبَةُ ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ ، عَنْ أَبِي رَافِعٍ ، عَنْ أَبِي هُرَيْرَةَ : أَنَّ زَيْنَبَ ، كَانَ اسْمُهَا بَرَّةَ فَقِيلَ : تُزَكِّي نَفْسَهَا ، فَسَمَّاهَا رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ.\r\nوَلَفْظُ الْحَدِيثِ لِهَؤُلاَءِ دُونَ ابْنِ بَشَّارٍ. وقَالَ ابْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، عَنْ شُعْبَةَ."
            },
            {
                "hadithNo": "5608",
                "chapterNo": "3",
                "hadithEnglish": "Zainab bint Umm Salamah said: \"My name was Barrah, but the Messenger of Allah (s.a.w) named me Zainab.\" She said: \"Zainab bint Jahsh joined his (s.a.w) household and her name was Barrah, but he renamed her Zainab.\"",
                "hadithArabic": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ (ح) وَحَدَّثَنَا أَبُو كُرَيْبٍ ، حَدَّثَنَا أَبُو أُسَامَةَ ، قَالاَ : حَدَّثَنَا الْوَلِيدُ بْنُ كَثِيرٍ ، حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ ، حَدَّثَتْنِي زَيْنَبُ بِنْتُ أُمِّ سَلَمَةَ ، قَالَتْ : كَانَ اسْمِي بَرَّةَ ، فَسَمَّانِي رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْنَبَ.\r\nقَالَتْ : وَدَخَلَتْ عَلَيْهِ زَيْنَبُ بِنْتُ جَحْشٍ ، وَاسْمُهَا بَرَّةُ فَسَمَّاهَا زَيْنَبَ."
            },
            {
                "hadithNo": "5609",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Muhammad bin 'Amr bin 'Ata' said: \"I called my daughter Barrah, but Zainab bint Abi Salamah told me that the Messenger of Allah (s.a.w) had forbidden this name. (She said) 'I was given this name, but the Messenger of Allah (s.a.w) said: \"Do not praise yourselves, for Allah knows best who among you is pious.\" They said: \"What should we call her?\" He said: \"Call her Zainab.\"",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ ، حَدَّثَنَا اللَّيْثُ ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ ، قَالَ : سَمَّيْتُ ابْنَتِي بَرَّةَ ، فَقَالَتْ لِي زَيْنَبُ بِنْتُ أَبِي سَلَمَةَ : إِنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ هَذَا الاِسْمِ ، وَسُمِّيتُ بَرَّةَ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : لاَ تُزَكُّوا أَنْفُسَكُمْ ، اللَّهُ أَعْلَمُ بِأَهْلِ الْبِرِّ مِنْكُمْ فَقَالُوا : بِمَ نُسَمِّيهَا ؟ قَالَ: سَمُّوهَا زَيْنَبَ."
            },
            {
                "hadithNo": "5610",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"The vilest of names before Allah is that of a man who is called Malik Al-Amlak\" Ibn Abi Shaibah added in his report: \"There is no King but Allah, Glorified and Exalted is He.\" Al-Ashaj'i said: Sufyan said: \"It is like Shahin - shah (a Persian title signifying \"king of kings\").\"",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ ، وَأَحْمَدُ بْنُ حَنْبَلٍ ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَاللَّفْظُ لأَحْمَدَ قَالَ الأَشْعَثِيُّ: أَخْبَرَنَا ، وقَالَ الآخَرَانِ: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ، عَنْ أَبِي الزِّنَادِ ، عَنِ الأَعْرَجِ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: إِنَّ أَخْنَعَ اسْمٍ عِنْدَ اللهِ رَجُلٌ تَسَمَّى مَلِكَ الأَمْلاَكِ. زَادَ ابْنُ أَبِي شَيْبَةَ فِي رِوَايَتِهِ لاَ مَالِكَ إِلاَّ اللَّهُ عَزَّ وَجَلَّ. قَالَ الأَشْعَثِيُّ: قَالَ سُفْيَانُ: مِثْلُ شَاهَانْ شَاهْ.\r\nوقَالَ أَحْمَدُ بْنُ حَنْبَلٍ ، سَأَلْتُ أَبَا عَمْرٍو عَنْ أَخْنَعَ ؟ فَقَالَ: أَوْضَعَ."
            },
            {
                "hadithNo": "5611",
                "chapterNo": "4",
                "hadithEnglish": "Ma'mar narrated that Hammam bin Munabbih said: \"This is what Abu Hurairah narrated to us from the Messenger of Allah (s.a.w)\" - and he narrated a number of Ahadith, including the following: \"The Messenger of Allah (s.a.w) said: 'The most hated of men before Allah on the Day of Resurrection, and the most wretched, and the most hated to Him, will be a man who was called Malik Al-Amlak, for there is no King but Allah.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ ، قَالَ : هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ ، عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا : وَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَغْيَظُ رَجُلٍ عَلَى اللهِ يَوْمَ الْقِيَامَةِ ، وَأَخْبَثُهُ وَأَغْيَظُهُ عَلَيْهِ ، رَجُلٍ كَانَ يُسَمَّى مَلِكَ الأَمْلاَكِ ، لاَ مَلِكَ إِلاَّ اللَّهُ."
            },
            {
                "hadithNo": "5612",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Anas bin Malik said: \"I took 'Abdullah bin Abi Talhah Al-Ansari to the Messenger of Allah (s.a.w) when he was born, and the Messenger of Allah (s.a.w) was wearing a cloak and daubing pitch on a camel of his. He said: 'Do you have any dates with you?' I said: 'Yes.' I gave him some dates and he put them in his mouth and softened them, then he opened the baby's mouth and put some in his mouth, and the baby started to smack his lips. The Messenger of Allah (s.a.w) said: 'How the Ansar love dates,' and he named him 'Abdullah.\"",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، عَنْ ثَابِتٍ الْبُنَانِيِّ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ : ذَهَبْتُ بِعْبْدِ اللهِ بْنِ أَبِي طَلْحَةَ الأَنْصَارِيِّ إِلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ وُلِدَ ، وَرَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عَبَاءَةٍ يَهْنَأُ بَعِيرًا لَهُ ، فَقَالَ : هَلْ مَعَكَ تَمْرٌ ؟ فَقُلْتُ : نَعَمْ ، فَنَاوَلْتُهُ تَمَرَاتٍ ، فَأَلْقَاهُنَّ فِي فِيهِ فَلاَكَهُنَّ ، ثُمَّ فَغَرَ فَا الصَّبِيِّ فَمَجَّهُ فِي فِيهِ ، فَجَعَلَ الصَّبِيُّ يَتَلَمَّظُهُ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : حُبُّ الأَنْصَارِ التَّمْرَ , وَسَمَّاهُ عَبْدَ اللَّهِ."
            },
            {
                "hadithNo": "5613",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Anas bin Malik said: \"A son of Abu Talhah fell sick; Abu Talhah went out and the boy died. When Abu Talhah returned he said: 'What happened to my son?' Umm Sulaim said: 'He is quieter than he was.' She brought him his dinner and he ate, then he had intercourse with her, and when it was over she said: 'Bury the boy.' The next morning Abu Talhah went to the Messenger of Allah (s.a.w) and told him what had happened. He said: 'Did you spend the night together?' He said: 'Yes.' He said: 'O Allah, bless them.' She gave birth to a boy and Abu Talhah said to me: 'Take him to the Prophet (s.a.w),' [So he took him to the Prophet (s.a.w)] And she sent some dates with him. The Prophet (s.a.w) took him and said: 'Is there anything with him?' They said: 'Yes, some dates.' The Prophet (s.a.w) took them and chewed them, then he took it from his mouth and put it in the child's mouth and rubbed it on his palate (Tahnik) and named him 'Abdullah.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ، أَخْبَرَنَا ابْنُ عَوْنٍ ، عَنِ ابْنِ سِيرِينَ (1)، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ : كَانَ ابْنٌ لأَبِي طَلْحَةَ يَشْتَكِي ، فَخَرَجَ أَبُو طَلْحَةَ ، فَقُبِضَ الصَّبِيُّ ، فَلَمَّا رَجَعَ أَبُو طَلْحَةَ قَالَ : مَا فَعَلَ ابْنِي ؟ قَالَتْ أُمُّ سُلَيْمٍ : هُوَ أَسْكَنُ مِمَّا كَانَ ، فَقَرَّبَتْ إِلَيْهِ الْعَشَاءَ فَتَعَشَّى ، ثُمَّ أَصَابَ مِنْهَا ، فَلَمَّا فَرَغَ قَالَتْ : وَارُوا الصَّبِيَّ ، فَلَمَّا أَصْبَحَ أَبُو طَلْحَةَ أَتَى رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ ، فَقَالَ : أَعْرَسْتُمُ اللَّيْلَةَ ؟ قَالَ : نَعَمْ ، قَالَ : اللَّهُمَّ بَارِكْ لَهُمَا فَوَلَدَتْ غُلاَمًا ، فَقَالَ لِي أَبُو طَلْحَةَ : احْمِلْهُ حَتَّى تَأْتِيَ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَأَتَى بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَبَعَثَتْ مَعَهُ بِتَمَرَاتٍ ، فَأَخَذَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ : أَمَعَهُ شَيْءٌ ؟ قَالُوا : نَعَمْ ، تَمَرَاتٌ ، فَأَخَذَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَضَغَهَا ، ثُمَّ أَخَذَهَا مِنْ فِيهِ ، فَجَعَلَهَا فِي فِي الصَّبِيِّ ثُمَّ حَنَّكَهُ ، وَسَمَّاهُ عَبْدَ اللَّهِ."
            },
            {
                "hadithNo": "5614",
                "chapterNo": "5",
                "hadithEnglish": "This story was narrated from Anas, like the Hadith of Yazid (no. 5613).",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ ، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ ، حَدَّثَنَا ابْنُ عَوْنٍ ، عَنْ مُحَمَّدٍ ، عَنْ أَنَسٍ بِهَذِهِ الْقِصَّةِ نَحْوَ حَدِيثِ يَزِيدَ."
            },
            {
                "hadithNo": "5615",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Musa said: \"A son was born to me and I took him to the Prophet (s.a.w). He named him Ibrahim and rubbed his palate with some dates (Tahnik).\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَعَبْدُ اللهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ ، وَأَبُو كُرَيْبٍ ، قَالُوا: حَدَّثَنَا أَبُو أُسَامَةَ ، عَنْ بُرَيْدٍ ، عَنْ أَبِي بُرْدَةَ ، عَنْ أَبِي مُوسَى، قَالَ: وُلِدَ لِي غُلاَمٌ فَأَتَيْتُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمَّاهُ إِبْرَاهِيمَ وَحَنَّكَهُ بِتَمْرَةٍ."
            },
            {
                "hadithNo": "5616",
                "chapterNo": "5",
                "hadithEnglish": "'Urwah bin Az-Zubair and Fatimah bint Al-Mundhir said: \"Asma' bint Abi Bakr set out when she migrated, and she was pregnant with 'Abdullah bin Az-Zubair. She came to Quba' and gave birth to 'Abdullah bin Az-Zubair. When she had given birth, she went to the Messenger of Allah (s.a.w) so that he could perform Tahnik for him. The Messenger of Allah (s.a.w) took him from her and put him in his lap, then he called for a date.\" 'Aishah said: \"We looked for a while before we found one. He chewed it, then he spat it into his mouth, so the first thing that entered his stomach was the saliva of the Messenger of Allah (s.a.w).\" Then Asma' said: \"Then he patted him and prayed for him and named him 'Abdullah. Then when he was seven or eight years old, he came and swore allegiance to the Messenger of Allah (s.a.w), as Az-Zubair told him to do that. The Messenger of Allah (s.a.w) smiled when he saw him coming to him and accepted his oath of allegiance from him.\"",
                "hadithArabic": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ ، حَدَّثَنَا شُعَيْبٌ ، يَعْنِي ابْنَ إِسْحَاقَ ، أَخْبَرَنِي هِشَامُ بْنُ عُرْوَةَ ، حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ ، وَفَاطِمَةُ بِنْتُ الْمُنْذِرِ بْنِ الزُّبَيْرِ ، أَنَّهُمَا قَالاَ : خَرَجَتْ أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ حِينَ هَاجَرَتْ وَهِيَ حُبْلَى بِعَبْدِ اللهِ بْنِ الزُّبَيْرِ ، فَقَدِمَتْ قُبَاءً ، فَنُفِسَتْ بِعَبْدِ اللهِ بِقُبَاءٍ ، ثُمَّ خَرَجَتْ حِينَ نُفِسَتْ إِلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُحَنِّكَهُ فَأَخَذَهُ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا ، فَوَضَعَهُ فِي حَجْرِهِ ، ثُمَّ دَعَا بِتَمْرَةٍ قَالَ : قَالَتْ عَائِشَةُ : فَمَكَثْنَا سَاعَةً نَلْتَمِسُهَا قَبْلَ أَنْ نَجِدَهَا ، فَمَضَغَهَا . ثُمَّ بَصَقَهَا فِي فِيهِ ، فَإِنَّ أَوَّلَ شَيْءٍ دَخَلَ بَطْنَهُ لَرِيقُ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ثُمَّ قَالَتْ أَسْمَاءُ : ثُمَّ مَسَحَهُ وَصَلَّى عَلَيْهِ وَسَمَّاهُ عَبْدَ اللهِ ، ثُمَّ جَاءَ ، وَهُوَ ابْنُ سَبْعِ سِنِينَ ، أَوْ ثَمَانٍ ، لِيُبَايِعَ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَأَمَرَهُ بِذَلِكَ الزُّبَيْرُ ، فَتَبَسَّمَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ رَآهُ مُقْبِلاً إِلَيْهِ ، ثُمَّ بَايَعَهُ."
            },
            {
                "hadithNo": "5617",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Asma' that she became pregnant with 'Abdullah bin Az-Zubair in Makkah. She said: \"I set out when I was in the late stages of pregnancy, and headed for Al-Madinah. I stopped in Quba' and gave birth to him in Quba'. Then I came to the Messenger of Allah (s.a.w) who put him in his lap and called for a date. He chewed it then he spat into his mouth, so the first thing that entered his stomach was the saliva of the Messenger of Allah (s.a.w). Then he rubbed his palate with a date then he supplicated for him and blessed him. He was the first child to be born in Islam.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ ، حَدَّثَنَا أَبُو أُسَامَةَ ، عَنْ هِشَامٍ ، عَنْ أَبِيهِ ، عَنْ أَسْمَاءَ ، أَنَّهَا حَمَلَتْ بِعَبْدِ اللهِ بْنِ الزُّبَيْرِ بِمَكَّةَ قَالَتْ : فَخَرَجْتُ وَأَنَا مُتِمٌّ ، فَأَتَيْتُ الْمَدِينَةَ فَنَزَلْتُ بِقُبَاءٍ فَوَلَدْتُهُ بِقُبَاءٍ ، ثُمَّ أَتَيْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَهُ فِي حَجْرِهِ ، ثُمَّ دَعَا بِتَمْرَةٍ فَمَضَغَهَا ، ثُمَّ تَفَلَ فِي فِيهِ ، فَكَانَ أَوَّلَ شَيْءٍ دَخَلَ جَوْفَهُ رِيقُ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ثُمَّ حَنَّكَهُ بِالتَّمْرَةِ ، ثُمَّ دَعَا لَهُ وَبَرَّكَ عَلَيْهِ ، وَكَانَ أَوَّلَ مَوْلُودٍ وُلِدَ فِي الإِسْلاَمِ."
            },
            {
                "hadithNo": "5618",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Asma' bint Abi Bakr As-Siddiq that she migrated to join the Messenger of Allah (s.a.w) when she was pregnant with 'Abdullah bin Az-Zubair - and he mentioned a Hadith like that of Abu Usamah (no. 5615).",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ ، عَنْ هِشَامِ بْنِ عُرْوَةَ ، عَنْ أَبِيهِ ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّهَا هَاجَرَتْ إِلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ حُبْلَى بِعَبْدِ اللهِ بْنِ الزُّبَيْرِ فَذَكَرَ نَحْوَ حَدِيثِ أَبِي أُسَامَةَ."
            },
            {
                "hadithNo": "5619",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from 'Aishah that infants would be brought to the Messenger of Allah (s.a.w), and he would bless them and perform Tahnik for them.",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ ، حَدَّثَنَا هِشَامٌ ، يَعْنِي ابْنَ عُرْوَةَ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ : أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُؤْتَى بِالصِّبْيَانِ فَيُبَرِّكُ عَلَيْهِمْ وَيُحَنِّكُهُمْ."
            },
            {
                "hadithNo": "5620",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated. that 'Aishah said: \"We brought 'Abdullah bin Az-Zubair to the Messenger of Allah (s.a.w) so that he could perform Tahnik for him. He asked us for a date and we had a hard time finding one.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ ، عَنْ هِشَامٍ ، عَنْ أَبِيهِ ، عَنْ عَائِشَةَ ، قَالَتْ: جِئْنَا بِعَبْدِ اللهِ بْنِ الزُّبَيْرِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَنِّكُهُ ، فَطَلَبْنَا تَمْرَةً ، فَعَزَّ عَلَيْنَا طَلَبُهَا."
            },
            {
                "hadithNo": "5621",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated. that 'Aishah said: \"We brought 'Abdullah bin Az-Zubair to the Messenger of Allah (s.a.w) so that he could perform Tahnik for him. He asked us for a date and we had a hard time finding one.\"",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِىُّ وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالاَ حَدَّثَنَا ابْنُ أَبِى مَرْيَمَ حَدَّثَنَا مُحَمَّدٌ - وَهُوَ ابْنُ مُطَرِّفٍ أَبُو غَسَّانَ - حَدَّثَنِى أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ أُتِىَ بِالْمُنْذِرِ بْنِ أَبِى أُسَيْدٍ إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- حِينَ وُلِدَ فَوَضَعَهُ النَّبِىُّ -صلى الله عليه وسلم- عَلَى فَخِذِهِ وَأَبُو أُسَيْدٍ جَالِسٌ فَلَهِىَ النَّبِىُّ -صلى الله عليه وسلم- بِشَىْءٍ بَيْنَ يَدَيْهِ فَأَمَرَ أَبُو أُسَيْدٍ بِابْنِهِ فَاحْتُمِلَ مِنْ عَلَى فَخِذِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَأَقْلَبُوهُ فَاسْتَفَاقَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « أَيْنَ الصَّبِىُّ ». فَقَالَ أَبُو أُسَيْدٍ أَقْلَبْنَاهُ يَا رَسُولَ اللَّهِ. فَقَالَ « مَا اسْمُهُ ». قَالَ فُلاَنٌ يَا رَسُولَ اللَّهِ. قَالَ « لاَ وَلَكِنِ اسْمُهُ الْمُنْذِرُ ». فَسَمَّاهُ يَوْمَئِذٍ الْمُنْذِرَ."
            },
            {
                "hadithNo": "5622",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Anas bin Malik said: \"The Messenger of Allah (s.a.w) was the best of people in attitude. I had a brother who was called Abu 'Umair.\" - He (the narrator) said: \"I think he said: 'He was a weanling.\"' - \"When the Messenger of Allah (s.a.w) came and saw him, he said: 'Abu 'Umair, what happened to the Nughair (nightingale)?' He used to play with it.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ ، حَدَّثَنَا عَبْدُ الْوَارِثِ ، حَدَّثَنَا أَبُو التَّيَّاحِ ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ (ح) وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ ، وَاللَّفْظُ لَهُ ، حَدَّثَنَا عَبْدُ الْوَارِثِ ، عَنْ أَبِي التَّيَّاحِ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ: كَانَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْسَنَ النَّاسِ خُلُقًا ، وَكَانَ لِي أَخٌ يُقَالُ لَهُ: أَبُو عُمَيْرٍ ، قَالَ: أَحْسِبُهُ ، قَالَ: كَانَ فَطِيمًا ، قَالَ: فَكَانَ إِذَا جَاءَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَآهُ ، قَالَ: أَبَا عُمَيْرٍ مَا فَعَلَ النُّغَيْرُ قَالَ: فَكَانَ يَلْعَبُ بِهِ."
            },
            {
                "hadithNo": "5623",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Anas bin Malik said: \"The Messenger of Allah (s.a.w) said to me: 'O my son.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ ، حَدَّثَنَا أَبُو عَوَانَةَ ، عَنْ أَبِي عُثْمَانَ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ: قَالَ لِي رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: يَا بُنَيَّ."
            },
            {
                "hadithNo": "5624",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Al-Mughirah bin Shu'bah said: \"No one asked the Messenger of Allah (s.a.w) about the Dajjal more than I did. He said to me: 'O my son, why are you so worried about him? He will never harm you.' I said: 'They say that he has with him rivers of water and mountains of bread.' He said: 'He is more insignificant before Allah than that.\"'",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَابْنُ أَبِي عُمَرَ ، وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ ، قَالاَ: حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ ، قَالَ: مَا سَأَلَ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدٌ عَنِ الدَّجَّالِ أَكْثَرَ مِمَّا سَأَلْتُهُ عَنْهُ ، فَقَالَ لِي: أَيْ بُنَيَّ وَمَا يُنْصِبُكَ مِنْهُ ؟ إِنَّهُ لَنْ يَضُرَّكَ قَالَ قُلْتُ: إِنَّهُمْ يَزْعُمُونَ أَنَّ مَعَهُ أَنْهَارَ الْمَاءِ وَجِبَالَ الْخُبْزِ ، قَالَ: هُوَ أَهْوَنُ عَلَى اللهِ مِنْ ذَلِكَ."
            },
            {
                "hadithNo": "5625",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Isma'il with this chain of narrators (a Hadith similar to no. 5624), but it does not mention in the Hadith of any of them the words of the Prophet (s.a.w) to Al-Mughirah: \"O my son,\" except the Hadith of Yazid (no. 5624).",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَابْنُ نُمَيْرٍ ، قَالاَ: حَدَّثَنَا وَكِيعٌ (ح) وَحَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ ، حَدَّثَنَا هُشَيْمٌ (ح) وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ (ح) وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ ، حَدَّثَنَا أَبُو أُسَامَةَ ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ ، بِهَذَا الإِسْنَادِ. وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ قَوْلُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْمُغِيرَةِ أَيْ بُنَيَّ إِلاَّ فِي حَدِيثِ يَزِيدَ وَحْدَهُ."
            },
            {
                "hadithNo": "5626",
                "chapterNo": "7",
                "hadithEnglish": "Abu Sa'eed Al-Khudri said: \"I was sitting in Al-Madinah, in a gathering of the Ansar, when Abu Musa came to us, in a panic, or trembling with fear. We said: 'What is the matter with you?' He said: \"Umar sent for me to come to him, and I came to his door and said Salam three times, but he did not answer me, so I went back.' He said: 'What kept you from coming to us?' I said: 'I did come, and I said Salam three times at your door, but you did not answer me, so I went back, because the Messenger of Allah (s.a.w) said: \"If one of you asks permission to enter three times and permission is not given to him, let him go back.\"' 'Umar said: 'Bring proof (of the Prophet (s.a.w) saying that), otherwise I will take you to task.' Ubayy bin Ka'b said: 'No one should go with him but the youngest of the people.'\" Abu Sa'eed said: \"I ·said: 'I am the youngest of the people.' He said: 'Go with him.'\"",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ، حَدَّثَنَا وَاللَّهِ يَزِيدُ بْنُ خُصَيْفَةَ ، عَنْ بُسْرِ بْنِ سَعِيدٍ ، قَالَ: سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ ، يَقُولُ : كُنْتُ جَالِسًا بِالْمَدِينَةِ فِي مَجْلِسِ الأَنْصَارِ ، فَأَتَانَا أَبُو مُوسَى فَزِعًا ، أَوْ مَذْعُورًا قُلْنَا: مَا شَأْنُكَ ؟ قَالَ: إِنَّ عُمَرَ أَرْسَلَ إِلَيَّ أَنْ آتِيَهُ ، فَأَتَيْتُ بَابَهُ فَسَلَّمْتُ ثَلاَثًا فَلَمْ يَرُدَّ عَلَيَّ فَرَجَعْتُ فَقَالَ: مَا مَنَعَكَ أَنْ تَأْتِيَنَا ؟ فَقُلْتُ: إِنِّي أَتَيْتُكَ، فَسَلَّمْتُ عَلَى بَابِكَ ثَلاَثًا ، فَلَمْ يَرُدُّوا عَلَيَّ ، فَرَجَعْتُ، وَقَدْ قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَأْذَنَ أَحَدُكُمْ ثَلاَثًا فَلَمْ يُؤْذَنْ لَهُ ، فَلْيَرْجِعْ فَقَالَ عُمَرُ: أَقِمْ عَلَيْهِ الْبَيِّنَةَ، وَإِلاَّ أَوْجَعْتُكَ. فَقَالَ: أُبَيُّ بْنُ كَعْبٍ:لاَ يَقُومُ مَعَهُ إِلاَّ أَصْغَرُ الْقَوْمِ، قَالَ:أَبُو سَعِيدٍ: قُلْتُ أَنَا أَصْغَرُ الْقَوْمِ، قَالَ: فَاذْهَبْ بِهِ."
            },
            {
                "hadithNo": "5627",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from Yazid bin Khusaifah with this chain of narrators (a Hadith similar to no. 5626). Ibn Abi 'Umar added in his Hadith: \"Abu Sa'eed said: 'So I went with him to 'Umar and I bore witness.\"'",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، وَابْنُ أَبِي عُمَرَ ، قَالاَ: حَدَّثَنَا سُفْيَانُ ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ ، بِهَذَا الإِسْنَادِ.\r\nوَزَادَ ابْنُ أَبِي عُمَرَ ، فِي حَدِيثِهِ قَالَ أَبُو سَعِيدٍ: فَقُمْتُ مَعَهُ فَذَهَبْتُ إِلَى عُمَرَ فَشَهِدْتُ."
            },
            {
                "hadithNo": "5628",
                "chapterNo": "7",
                "hadithEnglish": "Abu Sa'eed Al-Khudri said: \"We were in a gathering with Ubayy bin Ka'b, when Abi Musa Al-Ash'ari came, looking angry. He stood there and said: 'I adjure you by Allah, did anyone among you hear the Messenger of Allah (s.a.w) say: \"Permission is to be sought three times, then if permission is given to you, (enter) otherwise go back\"?' Ubayy said: 'Why is that?' He said: 'I asked permission to enter upon 'Umar bin Al-Khattab three times yesterday, but permission was not given to me, so I went back.' Then I came to him today and entered upon him, and I told him that I had come to him yesterday and said Salam three times, then I went away. He said: \"We heard you but we were busy with something at that time. Why didn't you keep asking for permission until permission was given to you?\" He said: \"I asked permission as I heard the Messenger of Allah (s.a.w) (say we should ask permission).\" He said: \"By Allah, I will beat you on your back and your stomach if you do not bring someone to bear witness to that.\"' \"Ubayy bin Ka'b said: 'By Allah, no one will go with you but the youngest of us. Get up, O Abu Sa'eed!' So I got up and went to 'Umar, and I said: 'I heard the Messenger of Allah (s.a.w) say that.\"'",
                "hadithArabic": "حَدَّثَنِي أَبُو الطَّاهِرِ ، أَخْبَرَنِي عَبْدُ اللهِ بْنُ وَهْبٍ ، حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ ، أَنَّ بُسْرَ بْنَ سَعِيدٍ ، حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ ، يَقُولُ : كُنَّا فِي مَجْلِسٍ عِنْدَ أُبَيِّ بْنِ كَعْبٍ ، فَأَتَى أَبُو مُوسَى الأَشْعَرِيُّ مُغْضَبًا حَتَّى وَقَفَ ، فَقَالَ : أَنْشُدُكُمُ اللَّهَ هَلْ سَمِعَ أَحَدٌ مِنْكُمْ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : الاِسْتِئْذَانُ ثَلاَثٌ ، فَإِنْ أُذِنَ لَكَ ، وَإِلاَّ فَارْجِعْ قَالَ أُبَيٌّ : وَمَا ذَاكَ ؟ قَالَ : اسْتَأْذَنْتُ عَلَى عُمَرَ بْنِ الْخَطَّابِ أَمْسِ ثَلاَثَ مَرَّاتٍ ، فَلَمْ يُؤْذَنْ لِي فَرَجَعْتُ ، ثُمَّ جِئْتُهُ الْيَوْمَ فَدَخَلْتُ عَلَيْهِ ، فَأَخْبَرْتُهُ ، أَنِّي جِئْتُ أَمْسِ فَسَلَّمْتُ ثَلاَثًا ، ثُمَّ انْصَرَفْتُ . قَالَ : قَدْ سَمِعْنَاكَ وَنَحْنُ حِينَئِذٍ عَلَى شُغْلٍ ، فَلَوْ مَا اسْتَأْذَنْتَ حَتَّى يُؤْذَنَ لَكَ قَالَ : اسْتَأْذَنْتُ كَمَا سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : فَوَاللَّهِ ، لأُوجِعَنَّ ظَهْرَكَ وَبَطْنَكَ ، أَوْ لَتَأْتِيَنَّ بِمَنْ يَشْهَدُ لَكَ عَلَى هَذَا.\r\nفَقَالَ أُبَيُّ بْنُ كَعْبٍ : فَوَاللَّهِ ، لاَ يَقُومُ مَعَكَ إِلاَّ أَحْدَثُنَا سِنًّا ، قُمْ ، يَا أَبَا سَعِيدٍ ، فَقُمْتُ حَتَّى أَتَيْتُ عُمَرَ ، فَقُلْتُ : قَدْ سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هَذَا."
            },
            {
                "hadithNo": "5629",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from Abu Sa'eed that Abu Musa went to 'Umar's door and asked for permission to enter. 'Umar said: \"One.\" He asked permission a second time and 'Umar said: \"Two.\" He asked permission a third time, and 'Umar said: \"Three.\" Then he went away. 'Umar sent someone after him to bring him back. He ('Umar) said: \"If this is something that you learned from the Messenger of Allah (s.a.w), all well and good, otherwise I will make an example of you.\" Abu Sa'eed said: \"He came to us and said: 'Do you not know that the Messenger of Allah (s.a.w) said: \"Permission is to be sought three times?\"' They started laughing and I said: 'Your Muslim brother comes to you upset and you laugh? Let's go, and I will be your partner in this trouble.' He said: 'This is Abu Sa'eed.\"'",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ ، حَدَّثَنَا بِشْرٌ ، يَعْنِي ابْنَ مُفَضَّلٍ ، حَدَّثَنَا سَعِيدُ بْنُ يَزِيدَ ، عَنْ أَبِي نَضْرَةَ ، عَنْ أَبِي سَعِيدٍ ، أَنَّ أَبَا مُوسَى ، أَتَى بَابَ عُمَرَ ، فَاسْتَأْذَنَ ، فَقَالَ عُمَرُ وَاحِدَةٌ ، ثُمَّ اسْتَأْذَنَ الثَّانِيَةَ ، فَقَالَ عُمَرُ: ثِنْتَانِ ، ثُمَّ اسْتَأْذَنَ الثَّالِثَةَ ، فَقَالَ عُمَرُ : ثَلاَثٌ ، ثُمَّ انْصَرَفَ فَأَتْبَعَهُ فَرَدَّهُ ، فَقَالَ : إِنْ كَانَ هَذَا شَيْئًا حَفِظْتَهُ مِنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَا ، وَإِلاَّ ، فَلأَجْعَلَنَّكَ عِظَةً ، قَالَ أَبُو سَعِيدٍ : فَأَتَانَا فَقَالَ : أَلَمْ تَعْلَمُوا أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: الاِسْتِئْذَانُ ثَلاَثٌ ؟ قَالَ: فَجَعَلُوا يَضْحَكُونَ ، قَالَ: فَقُلْتُ: أَتَاكُمْ أَخُوكُمُ الْمُسْلِمُ قَدْ أُفْزِعَ ، تَضْحَكُونَ ؟ انْطَلِقْ فَأَنَا شَرِيكُكَ فِي هَذِهِ الْعُقُوبَةِ ، فَأَتَاهُ فَقَالَ: هَذَا أَبُو سَعِيدٍ."
            },
            {
                "hadithNo": "5630",
                "chapterNo": "7",
                "hadithEnglish": "A Hadith like that of Bishr bin Mufaddal (no. 5629) was narrated from Abu Sa'eed Al-Khudri, from Abu Maslamah.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، وَابْنُ بَشَّارٍ ، قَالاَ : حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ أَبِي مَسْلَمَةَ ، عَنْ أَبِي نَضْرَةَ ، عَنْ أَبِي سَعِيدٍ (ح) وَحَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ ، حَدَّثَنَا شَبَابَةُ ، حَدَّثَنَا شُعْبَةُ ، عَنِ الْجُرَيْرِيِّ ، وَسَعِيدِ بْنِ يَزِيدَ ، كِلاَهُمَا عَنْ أَبِي نَضْرَةَ ، قَالاَ: سَمِعْنَاهُ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ، بِمَعْنَى حَدِيثِ بِشْرِ بْنِ مُفَضَّلٍ ، عَنْ أَبِي مَسْلَمَةَ."
            },
            {
                "hadithNo": "5631",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from 'Ubaid bin 'Umair that Abu Musil asked permission to enter upon 'Umar three times, and it was as if he found him busy, so he went back. 'Umar said: \"Didn't we hear the voice of 'Abdullah bin Qais? Let him in.\" He was called and he said: \"What made you do what you did?\" He said: \"That was enjoined upon us.\" He said: \"Either you bring us proof for that or I will do such-and-such.\" He went to a gathering of the Ansar and they said: \"No one will bear witness to that except the youngest of us.\" Abu Sa'eed stood up and said: \"This was enjoined upon us.\" 'Umar said: \"I missed out on this command of the Messenger of Allah (s.a.w) because of my business in the marketplace.\"",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ ، عَنِ ابْنِ جُرَيْجٍ ، حَدَّثَنَا عَطَاءٌ ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ ، أَنَّ أَبَا مُوسَى ، اسْتَأْذَنَ عَلَى عُمَرَ ثَلاَثًا ، فَكَأَنَّهُ وَجَدَهُ مَشْغُولاً ، فَرَجَعَ فَقَالَ عُمَرُ : أَلَمْ تَسْمَعْ صَوْتَ عَبْدِ اللهِ بْنِ قَيْسٍ ، ائْذَنُوا لَهُ ، فَدُعِيَ لَهُ ، فَقَالَ : مَا حَمَلَكَ عَلَى مَا صَنَعْتَ ، قَالَ : إِنَّا كُنَّا نُؤْمَرُ بِهَذَا قَالَ : لَتُقِيمَنَّ عَلَى هَذَا بَيِّنَةً ، أَوْ لأَفْعَلَنَّ ، فَخَرَجَ فَانْطَلَقَ إِلَى مَجْلِسٍ مِنَ الأَنْصَارِ ، فَقَالُوا : لاَ يَشْهَدُ لَكَ عَلَى هَذَا إِلاَّ أَصْغَرُنَا ، فَقَامَ أَبُو سَعِيدٍ فَقَالَ : كُنَّا نُؤْمَرُ بِهَذَا فَقَالَ عُمَرُ : خَفِيَ عَلَيَّ هَذَا مِنْ أَمْرِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، أَلْهَانِي عَنْهُ الصَّفْقُ بِالأَسْوَاقِ."
            },
            {
                "hadithNo": "5632",
                "chapterNo": "7",
                "hadithEnglish": "Ibn Juraij narrated a similar report (as no. 5631) with this chain of narrators, but in the Hadith of An-Nadr it does not mention (the phrase): \"I missed out on this command of the Messenger of Allah (s.a.w) because of my business in the marketplace\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ ، حَدَّثَنَا أَبُو عَاصِمٍ (ح) وَحَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ ، حَدَّثَنَا النَّضْرُ ، يَعْنِي ابْنَ شُمَيْلٍ ، قَالاَ: جَمِيعًا ، حَدَّثَنَا ابْنُ جُرَيْجٍ ، بِهَذَا الإِسْنَادِ ، نَحْوَهُ. وَلَمْ يَذْكُرَ فِي حَدِيثِ النَّضْرِ أَلْهَانِي عَنْهُ الصَّفْقُ بِالأَسْوَاقِ."
            },
            {
                "hadithNo": "5633",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Abu Musa Al-Ash'ari said: \"Abu Musa came to 'Umar bin Al-Khattab and said: . 'As-Salamu 'alaikum, this is 'Abdullah bin Qais,' but permission was not given to him to enter. He said: 'As-Salamu 'alaikum, this i.s Abu Musa; As-Salamu 'alaikum, this is Al-Ash'ari.' Then he left. He ('Umar) said: 'Bring him back,' so they brought him back. He said: 'O Abu Musa, why did you go back? We were busy with something.' He said: 'I heard the Messenger of Allah (s.a.w) say: \"Permission is to be sought three times, then if permission is given to you (go in), otherwise go back.\"' He said: 'Bring proof of this, or I will do such-and-such. So Abu Musa went away.' \"Umar said: 'If there is any proof, you will find it by the Minbar this evening. If there is no proof, you will not find it.' When evening came, he found it. He said: 'O Abu Musa what do you say? Did you find it?' He said: 'Yes, Ubayy bin Ka'b.' He said: 'He is of good character.' He said: 'O Abu At-Tufail, what does this one say?' He said: 'I heard the Messenger of Allah (s.a.w) say that, O son of Al-Khattab, so do not punish the Companions of the Messenger of Allah (s.a.w).' He said: 'Subhan Allah, I heard something and I wanted to be sure of it.\"'",
                "hadithArabic": "حَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ أَبُو عَمَّارٍ ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى ، أَخْبَرَنَا طَلْحَةُ بْنُ يَحْيَى ، عَنْ أَبِي بُرْدَةَ ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ ، قَالَ : جَاءَ أَبُو مُوسَى إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ : السَّلاَمُ عَلَيْكُمْ هَذَا عَبْدُ اللهِ بْنُ قَيْسٍ ، فَلَمْ يَأْذَنْ لَهُ ، فَقَالَ : السَّلاَمُ عَلَيْكُمْ هَذَا أَبُو مُوسَى ، السَّلاَمُ عَلَيْكُمْ هَذَا الأَشْعَرِيُّ ، ثُمَّ انْصَرَفَ ، فَقَالَ : رُدُّوا عَلَيَّ رُدُّوا عَلَيَّ ، فَجَاءَ فَقَالَ : يَا أَبَا مُوسَى مَا رَدَّكَ ؟ كُنَّا فِي شُغْلٍ ، قَالَ : سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : الاِسْتِئْذَانُ ثَلاَثٌ ، فَإِنْ أُذِنَ لَكَ ، وَإِلاَّ فَارْجِعْ قَالَ : لَتَأْتِيَنِّي عَلَى هَذَا بِبَيِّنَةٍ ، وَإِلاَّ فَعَلْتُ وَفَعَلْتُ ، فَذَهَبَ أَبُو مُوسَى.\r\nقَالَ عُمَرُ : إِنْ وَجَدَ بَيِّنَةً تَجِدُوهُ عِنْدَ الْمِنْبَرِ عَشِيَّةً ، وَإِنْ لَمْ يَجِدْ بَيِّنَةً فَلَمْ تَجِدُوهُ ، فَلَمَّا أَنْ جَاءَ بِالْعَشِيِّ وَجَدُوهُ ، قَالَ : يَا أَبَا مُوسَى ، مَا تَقُولُ ؟ أَقَدْ وَجَدْتَ ؟ قَالَ : نَعَمْ ، أُبَيَّ بْنَ كَعْبٍ ، قَالَ : عَدْلٌ ، قَالَ : يَا أَبَا الطُّفَيْلِ مَا يَقُولُ هَذَا ؟ قَالَ : سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَلِكَ يَا ابْنَ الْخَطَّابِ فَلاَ تَكُونَنَّ عَذَابًا عَلَى أَصْحَابِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، قَالَ : سُبْحَانَ اللهِ إِنَّمَا سَمِعْتُ شَيْئًا ، فَأَحْبَبْتُ أَنْ أَتَثَبَّتَ."
            },
            {
                "hadithNo": "5634",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from Talhah bin Yahya with this chain of narrators, except that he said: \"He said: 'O Abul-Mundhir, did you hear this from the Messenger of Allah (s.a.w)?' He said: 'Yes, so do not be a torment to the Companions of the Messenger of Allah (s.a.w), O son of Al-Khattab.\"' And he did not mention the word of 'Umar; \"Subhan Allah,\" etc.",
                "hadithArabic": "وَحَدَّثَنَاهُ عَبْدُ اللهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانَ ، حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ ، عَنْ طَلْحَةَ بْنِ يَحْيَى ، بِهَذَا الإِسْنَادِ. غَيْرَ أَنَّهُ قَالَ : فَقَالَ : يَا أَبَا الْمُنْذِرِ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ فَقَالَ : نَعَمْ ، فَلاَ تَكُنْ ، يَا ابْنَ الْخَطَّابِ ، عَذَابًا عَلَى أَصْحَابِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَلَمْ يَذْكُرْ مِنْ قَوْلِ عُمَرَ : سُبْحَانَ اللهِ وَمَا بَعْدَهُ."
            },
            {
                "hadithNo": "5635",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"I came to the Prophet (s.a.w) and called out, and the Prophet (s.a.w) said: 'Who is this?' I said: 'Me.'\" He (s.a.w) came out saying: 'Me? Me?'\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ ، حَدَّثَنَا عَبْدُ اللهِ بْنُ إِدْرِيسَ ، عَنْ شُعْبَةَ ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَعَوْتُ ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ هَذَا ؟ قُلْتُ: أَنَا ، قَالَ : فَخَرَجَ وَهُوَ يَقُولُ: أَنَا أَنَا."
            },
            {
                "hadithNo": "5636",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"I asked permission to enter upon the Prophet (s.a.w) and he said: 'Who is this?' I said: 'Me.' The Prophet (s.a.w) said: 'Me? Me?\"'",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَاللَّفْظُ لأَبِي بَكْرٍ ، قَالَ يَحْيَى : أَخْبَرَنَا وَقَالَ أَبُو بَكْرٍ: حَدَّثَنَا وَكِيعٌ ، عَنْ شُعْبَةَ ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ ، قَالَ: اسْتَأْذَنْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَالَ: مَنْ هَذَا ؟ فَقُلْتُ: أَنَا ، فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَنَا أَنَا."
            },
            {
                "hadithNo": "5637",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Shu'bah with this chain of narrators (a Hadith similar to no. 5636). In their Hadith it says: \"As if he disliked that.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ ، وَأَبُو عَامِرٍ الْعَقَدِيُّ (ح) وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ (ح) وحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ ، حَدَّثَنَا بَهْزٌ , كُلُّهُمْ عَنْ شُعْبَةَ بِهَذَا الإِسْنَادِ. وَفِي حَدِيثِهِمْ كَأَنَّهُ كَرِهَ ذَلِكَ."
            },
            {
                "hadithNo": "5638",
                "chapterNo": "9",
                "hadithEnglish": "Sahl bin Sa'd As-Sa'idi narrated that a man looked through a crack in the door of the Messenger of Allah (s.a.w), and the Messenger of Allah (s.a.w) had a comb with which he was scratching his head. When the Messenger of Allah (s.a.w) saw him he said: \"If I had known that you were looking at me I would have poked you in the eye with it.\" And the Messenger of Allah (s.a.w) said: \"Seeking permission is enjoined because of looking.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، وَمُحَمَّدُ بْنُ رُمْحٍ ، قَالاَ : أَخْبَرَنَا اللَّيْثُ ، وَاللَّفْظُ لِيَحْيَى (ح) وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا لَيْثٌ ، عَنِ ابْنِ شِهَابٍ ، أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ ، أَخْبَرَهُ أَنَّ رَجُلاً اطَّلَعَ فِي جُحْرٍ فِي بَابِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَمَعَ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِدْرًى يَحُكُّ بِهِ رَأْسَهُ ، فَلَمَّا رَآهُ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : لَوْ أَعْلَمُ أَنَّكَ تَنَْظِرُنِي لَطَعَنْتُ بِهِ فِي عَيْنِكَ وَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : إِنَّمَا جُعِلَ الإِذْنُ مِنْ أَجْلِ الْبَصَرِ."
            },
            {
                "hadithNo": "5639",
                "chapterNo": "9",
                "hadithEnglish": "Sahl bin Sa'd As-Sa'idi Al-Ansari narrated that a man looked through a crack in the door of the Messenger of Allah (s.a.w), and the Messenger of Allah (s.a.w) had a comb with which he was combing his hair. The Messenger of Allah (s.a.w) said to him: \"If I had known that you were looking at me I would have poked you in the eye with it. Allah has only enjoined seeking permission because of looking.\"",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى ، أَخْبَرَنَا ابْنُ وَهْبٍ ، أَخْبَرَنِي يُونُسُ ، عَنِ ابْنِ شِهَابٍ ، أَنَّ سَهْلَ بْنَ سَعْدٍ الأَنْصَارِيَّ ، أَخْبَرَهُ ، أَنَّ رَجُلاً اطَّلَعَ مِنْ جُحْرٍ فِي بَابِ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَمَعَ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِدْرًى يُرَجِّلُ بِهِ رَأْسَهُ ، فَقَالَ لَهُ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : لَوْ أَعْلَمُ أَنَّكَ تَنْظُرُ ، طَعَنْتُ بِهِ فِي عَيْنِكَ ، إِنَّمَا جَعَلَ اللَّهُ الإِذْنَ مِنْ أَجْلِ الْبَصَرِ."
            },
            {
                "hadithNo": "5640",
                "chapterNo": "9",
                "hadithEnglish": "A Hadith like that of Al-Laith and Yunus (no. 5638) was narrated from Sahl bin Sa'd, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَعَمْرٌو النَّاقِدُ ، وَزُهَيْرُ بْنُ حَرْبٍ ، وَابْنُ أَبِي عُمَرَ ، قَالُوا : حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ (ح) وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ ، حَدَّثَنَا مَعْمَرٌ ، كِلاَهُمَا عَنِ الزُّهْرِيِّ ، عَنْ سَهْلِ بْنِ سَعْدٍ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ اللَّيْثِ وَيُونُسَ."
            },
            {
                "hadithNo": "5641",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from Anas bin Malik that a man looked into one of the apartments of the Prophet (s.a.w), and he (s.a.w) got up, with one or more arrowheads in his hand. It is as if I can see the Messenger of Allah (s.a.w) trying to stab him.",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ ، وَقُتَيْبَةُ بْنُ سَعِيدٍ ، وَاللَّفْظُ لِيَحْيَى وَأَبِي كَامِلٍ قَالَ يَحْيَى : أَخْبَرَنَا ، وقَالَ الآخَرَانِ : حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ ، عَنْ عُبَيْدِ اللهِ بْنِ أَبِي بَكْرٍ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، أَنَّ رَجُلاً اطَّلَعَ مِنْ بَعْضِ حُجَرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، فَقَامَ إِلَيْهِ بِمِشْقَصٍ ، أَوْ مَشَاقِصَ ، فَكَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْتِلُهُ لِيَطْعُنَهُ."
            },
            {
                "hadithNo": "5642",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Whoever looks into a house without the people's permission, it is permissible for them to put out his eyes.\"",
                "hadithArabic": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ ، حَدَّثَنَا جَرِيرٌ ، عَنْ سُهَيْلٍ ، عَنْ أَبِيهِ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : مَنِ اطَّلَعَ فِي بَيْتِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ ، فَقَدْ حَلَّ لَهُمْ أَنْ يَفْقَؤُوا عَيْنَهُ."
            },
            {
                "hadithNo": "5643",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"If a man were to look in at you without your permission, and you threw a pebble at him and put out his eye, there would be no blame on you.\"",
                "hadithArabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ ، حَدَّثَنَا سُفْيَانُ ، عَنْ أَبِي الزِّنَادِ ، عَنِ الأَعْرَجِ ، عَنْ أَبِي هُرَيْرَةَ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : لَوْ أَنَّ رَجُلاً اطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ ، فَخَذَفْتَهُ بِحَصَاةٍ ، فَفَقَأْتَ عَيْنَهُ مَا كَانَ عَلَيْكَ مِنْ جُنَاحٍ."
            },
            {
                "hadithNo": "5644",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that Jarir bin 'Abdullah said: \"I asked the Messenger of Allah (s.a.w) about an accidental glance and he ordered me to avert my gaze.\"",
                "hadithArabic": "حَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ (ح) وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ ، كِلاَهُمَا عَنْ يُونُسَ (ح) وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ ، حَدَّثَنَا هُشَيْمٌ ، أَخْبَرَنَا يُونُسُ ، عَنْ عَمْرِو بْنِ سَعِيدٍ ، عَنْ أَبِي زُرْعَةَ ، عَنْ جَرِيرِ بْنِ عَبْدِ اللهِ ، قَالَ : سَأَلْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظَرِ الْفُجَاءَةِ فَأَمَرَنِي أَنْ أَصْرِفَ بَصَرِي."
            },
            {
                "hadithNo": "5645",
                "chapterNo": "10",
                "hadithEnglish": "A similar report (as no. 5644) was narrated from Yunus with this chain of narrators.",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا عَبْدُ الأَعْلَى ، وَقَالَ : إِسْحَاقُ ، أَخْبَرَنَا وَكِيعٌ ، حَدَّثَنَا سُفْيَانُ كِلاَهُمَا ، عَنْ يُونُسَ ، بِهَذَا الإِسْنَادِ مِثْلَهُ."
            }
        ]
    }
]