[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "23",
        "bookName": "Book of Shares of Inheritance",
        "bookNameArabic": "كتاب الفرائض",
        "hadiths": [
            {
                "hadithNo": "4140",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Usamah bin Zaid that the Prophet (s.a.w) said: \"A Muslim does not inherit from a disbeliever and a disbeliever does not inherit from a Muslim.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنِ الزُّهْرِىِّ عَنْ عَلِىِّ بْنِ حُسَيْنٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- قَالَ « لاَ يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلاَ يَرِثُ الْكَافِرُ الْمُسْلِمَ »."
            },
            {
                "hadithNo": "4141",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah (s.a.w) said: 'Give the shares of inheritance to those who are entitled to them, and whatever is left, then it is for the closest male relative.\"'",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ حَمَّادٍ - وَهُوَ النَّرْسِىُّ - حَدَّثَنَا وُهَيْبٌ عَنِ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنِ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِىَ فَهُوَ لأَوْلَى رَجُلٍ ذَكَرٍ »."
            },
            {
                "hadithNo": "4142",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Messenger of Allah (s.a.w) said: \"Give the shares of inheritance to those who are entitled to them, and whatever is left of inheritance, then it is for the closest male relative.\"",
                "hadithArabic": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِىُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنِ ابْنِ عَبَّاسٍ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ « أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا تَرَكَتِ الْفَرَائِضُ فَلأَوْلَى رَجُلٍ ذَكَرٍ »."
            },
            {
                "hadithNo": "4143",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: \"The Messenger of Allah (s.a.w) said: 'Divide the wealth among those who are entitled to a share of inheritance according to the Book of Allah, the Most High, and whatever is left then it is for the closest male relative.\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ - وَاللَّفْظُ لاِبْنِ رَافِعٍ - قَالَ إِسْحَاقُ حَدَّثَنَا وَقَالَ الآخَرَانِ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنِ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « اقْسِمُوا الْمَالَ بَيْنَ أَهْلِ الْفَرَائِضِ عَلَى كِتَابِ اللَّهِ فَمَا تَرَكَتِ الْفَرَائِضُ فَلأَوْلَى رَجُلٍ ذَكَرٍ »."
            },
            {
                "hadithNo": "4144",
                "chapterNo": "1",
                "hadithEnglish": "A Hadith like that of Wuhaib and Rawh bin Al-Qasim (nos. 4141, 4142) was narrated from Ibn Tawus with this chain.",
                "hadithArabic": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ الْعَلاَءِ أَبُو كُرَيْبٍ الْهَمْدَانِىُّ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنِ ابْنِ طَاوُسٍ بِهَذَا الإِسْنَادِ. نَحْوَ حَدِيثِ وُهَيْبٍ وَرَوْحِ بْنِ الْقَاسِمِ."
            },
            {
                "hadithNo": "4145",
                "chapterNo": "2",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"I fell sick and the Messenger of Allah (s.a.w) and Abu Bakr came walking to visit me. I lost consciousness, and the Messenger of Allah (s.a.w) performed Wudu' then poured some of the water on me, and I regained consciousness. I said: 'O Messenger of Allah, how should I dispose of my wealth?' He did not give me any answer until the Verse of inheritance was revealed: They ask you for a legal verdict. Say: Allah directs (thus) about Al-Kalalah (those who leave neither descendants nor ascendants as heirs)...\".",
                "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ مَرِضْتُ فَأَتَانِى رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَأَبُو بَكْرٍ يَعُودَانِى مَاشِيَيْنِ فَأُغْمِىَ عَلَىَّ فَتَوَضَّأَ ثُمَّ صَبَّ عَلَىَّ مِنْ وَضُوئِهِ فَأَفَقْتُ قُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَقْضِى فِى مَالِى فَلَمْ يَرُدَّ عَلَىَّ شَيْئًا حَتَّى نَزَلَتْ آيَةُ الْمِيرَاثِ ( يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِى الْكَلاَلَةِ)"
            },
            {
                "hadithNo": "4146",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"The Prophet (s.a.w) and Abu Bakr came walking to visit me in Banu Salamah, and they found me unconscious. He called for water and performed Wudu', then he sprinkled some of it on me, and I regained consciousness. I said: 'What should I do with my wealth, O Messenger of Allah?' And the Verse \"Allah commands you as regards your children's (inheritance): To the male, a portion equal to that of two females\" was revealed.\"",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِى ابْنُ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ عَادَنِى النَّبِىُّ -صلى الله عليه وسلم- وَأَبُو بَكْرٍ فِى بَنِى سَلَمَةَ يَمْشِيَانِ فَوَجَدَنِى لاَ أَعْقِلُ فَدَعَا بِمَاءٍ فَتَوَضَّأَ ثُمَّ رَشَّ عَلَىَّ مِنْهُ فَأَفَقْتُ فَقُلْتُ كَيْفَ أَصْنَعُ فِى مَالِى يَا رَسُولَ اللَّهِ فَنَزَلَتْ (يُوصِيكُمُ اللَّهُ فِى أَوْلاَدِكُمْ لِلذَّكَرِ مِثْلُ حَظِّ الأُنْثَيَيْنِ)"
            },
            {
                "hadithNo": "4147",
                "chapterNo": "2",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"The Messenger of Allah (s.a.w) visited me while· I was sick, and Abu Bakr was with him. (They came) walking and found me unconscious. The Messenger of Allah (s.a.w) performed Wudu'. Then he poured some of the water on me, and I regained consciousness, and saw the Messenger of Allah (s.a.w) there. I said: 'O Messenger of Allah, what should I do with my wealth?' He did not give me any reply until the Verse of inheritance was revealed.\"",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِىُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ - يَعْنِى ابْنَ مَهْدِىٍّ - حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ الْمُنْكَدِرِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ عَادَنِى رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَأَنَا مَرِيضٌ وَمَعَهُ أَبُو بَكْرٍ مَاشِيَيْنِ فَوَجَدَنِى قَدْ أُغْمِىَ عَلَىَّ فَتَوَضَّأَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- ثُمَّ صَبَّ عَلَىَّ مِنْ وَضُوئِهِ فَأَفَقْتُ فَإِذَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ فِى مَالِى فَلَمْ يَرُدَّ عَلَىَّ شَيْئًا حَتَّى نَزَلَتْ آيَةُ الْمِيرَاثِ."
            },
            {
                "hadithNo": "4148",
                "chapterNo": "2",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"The Messenger of Allah (s.a.w) entered upon me while I was sick and unconscious. He performed Wudu' and they poured some of the water over me, and I regained consciousness. I said: 'O Messenger of Allah, I have no ascendants or descendents to inherit from me.' Then the Verse of inheritance was revealed.\" I [Shu'bah (a narrator)] said to Muhammad bin Al-Munkadir: \"Was it: 'They ask you for a legal verdict. Say: Allah directs (thus) about Al-Kalalah (those who leave neither descendants nor ascendants as heirs)...\"'? He said: \"Thus it was revealed.''",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِى مُحَمَّدُ بْنُ الْمُنْكَدِرِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَأَنَا مَرِيضٌ لاَ أَعْقِلُ فَتَوَضَّأَ فَصَبُّوا عَلَىَّ مِنْ وَضُوئِهِ فَعَقَلْتُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا يَرِثُنِى كَلاَلَةٌ. فَنَزَلَتْ آيَةُ الْمِيرَاثِ. فَقُلْتُ لِمُحَمَّدِ بْنِ الْمُنْكَدِرِ (يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِى الْكَلاَلَةِ) قَالَ هَكَذَا أُنْزِلَتْ"
            },
            {
                "hadithNo": "4149",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Shu'bah (a Hadith similar to no. 4148, with a different chain of narrators). In the Hadith of Wahb bin Jarir it says: \"The Verse of the shares of inheritance was revealed.\" In the Hadith of An-Nadr, ir and Al-'Aqadi it says: \"The Verse of the share of inheritance.\" None of their reports mention what Shu'bah said to Ibn Al-Munkadir.",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ وَأَبُو عَامِرٍ الْعَقَدِىُّ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ كُلُّهُمْ عَنْ شُعْبَةَ بِهَذَا الإِسْنَادِ. فِى حَدِيثِ وَهْبِ بْنِ جَرِيرٍ فَنَزَلَتْ آيَةُ الْفَرَائِضِ. وَفِى حَدِيثِ النَّضْرِ وَالْعَقَدِىِّ فَنَزَلَتْ آيَةُ الْفَرْضِ. وَلَيْسَ فِى رِوَايَةِ أَحَدٍ مِنْهُمْ قَوْلُ شُعْبَةَ لاِبْنِ الْمُنْكَدِرِ."
            },
            {
                "hadithNo": "4150",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Ma'dan bin Abi Talhah that 'Umar bin Al-Khattab delivered a Khutbah one Friday. He mentioned the Prophet of Allah (s.a.w) and he mentioned Abu Bakr. Then he said: \"I am not leaving behind me any problem more difficult than that of Kalalah. I did not ask the Messenger of Allah (s.a.w) about any matter more than I asked him about Kalalah, and he never appeared to be more annoyed by my asking any question than he did regarding this matter, until he poked me in the chest with his finger and said: 'O 'Umar, is not the Verse that was revealed in summer at the end of Surat An-Nisa' sufficient for you?' If I live I will give a verdict concerning it which would enable those who read the Qur'an and those who do not read it to know about this.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِى بَكْرٍ الْمُقَدَّمِىُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا هِشَامٌ حَدَّثَنَا قَتَادَةُ عَنْ سَالِمِ بْنِ أَبِى الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِى طَلْحَةَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ خَطَبَ يَوْمَ جُمُعَةٍ فَذَكَرَ نَبِىَّ اللَّهِ -صلى الله عليه وسلم- وَذَكَرَ أَبَا بَكْرٍ ثُمَّ قَالَ إِنِّى لاَ أَدَعُ بَعْدِى شَيْئًا أَهَمَّ عِنْدِى مِنَ الْكَلاَلَةِ مَا رَاجَعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- فِى شَىْءٍ مَا رَاجَعْتُهُ فِى الْكَلاَلَةِ وَمَا أَغْلَظَ لِى فِى شَىْءٍ مَا أَغْلَظَ لِى فِيهِ حَتَّى طَعَنَ بِإِصْبَعِهِ فِى صَدْرِى وَقَالَ « يَا عُمَرُ أَلاَ تَكْفِيكَ آيَةُ الصَّيْفِ الَّتِى فِى آخِرِ سُورَةِ النِّسَاءِ ». وَإِنِّى إِنْ أَعِشْ أَقْضِ فِيهَا بِقَضِيَّةٍ يَقْضِى بِهَا مَنْ يَقْرَأُ الْقُرْآنَ وَمَنْ لاَ يَقْرَأُ الْقُرْآنَ."
            },
            {
                "hadithNo": "4151",
                "chapterNo": "2",
                "hadithEnglish": "A similar report (as no. 4150) was narrated from Qatadah with this chain.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ عَنْ سَعِيدِ بْنِ أَبِى عَرُوبَةَ ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ رَافِعٍ عَنْ شَبَابَةَ بْنِ سَوَّارٍ عَنْ شُعْبَةَ كِلاَهُمَا عَنْ قَتَادَةَ بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "4152",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Al-Bara' said: \"The last Verse of the Qur'an to be revealed was: 'They ask you for a legal verdict. Say: Allah directs (thus) about Al-Katalah (those who leave neither descendants nor ascendants as heirs)...\"'.",
                "hadithArabic": "حَدَّثَنَا عَلِىُّ بْنُ خَشْرَمٍ أَخْبَرَنَا وَكِيعٌ عَنِ ابْنِ أَبِى خَالِدٍ عَنْ أَبِى إِسْحَاقَ عَنِ الْبَرَاءِ قَالَ آخِرُ آيَةٍ أُنْزِلَتْ مِنَ الْقُرْآنِ (يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِى الْكَلاَلَةِ)"
            },
            {
                "hadithNo": "4153",
                "chapterNo": "3",
                "hadithEnglish": "Al-Bara' bin 'Azib said: \"The last Verse to be revealed was the Verse of Kalalah, and the last Surah to be revealed was Bara'ah (i.e., Surat At-Taubah )\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِى إِسْحَاقَ قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يَقُولُ آخِرُ آيَةٍ أُنْزِلَتْ آيَةُ الْكَلاَلَةِ وَآخِرُ سُورَةٍ أُنْزِلَتْ بَرَاءَةُ."
            },
            {
                "hadithNo": "4154",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Al-Bara' that the last Surah to be revealed in full was Surat At-Taubah and the last Verse to be revealed was the Verse of Kalalah.",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِىُّ أَخْبَرَنَا عِيسَى - وَهُوَ ابْنُ يُونُسَ - حَدَّثَنَا زَكَرِيَّاءُ عَنْ أَبِى إِسْحَاقَ عَنِ الْبَرَاءِ أَنَّ آخِرَ سُورَةٍ أُنْزِلَتْ تَامَّةً سُورَةُ التَّوْبَةِ وَأَنَّ آخِرَ آيَةٍ أُنْزِلَتْ آيَةُ الْكَلاَلَةِ."
            },
            {
                "hadithNo": "4155",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as no. 4154) was narrated from Al-Bara', except that ,he said: \"The last Surah to be revealed completely.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا يَحْيَى - يَعْنِى ابْنَ آدَمَ - حَدَّثَنَا عَمَّارٌ - وَهُوَ ابْنُ رُزَيْقٍ - عَنْ أَبِى إِسْحَاقَ عَنِ الْبَرَاءِ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ آخِرُ سُورَةٍ أُنْزِلَتْ كَامِلَةً."
            },
            {
                "hadithNo": "4156",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Al-Bara' said: \"The last Verse to be revealed was: 'They ask you for a legal verdict...\"'.",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِىُّ حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ عَنْ أَبِى السَّفَرِ عَنِ الْبَرَاءِ قَالَ آخِرُ آيَةٍ أُنْزِلَتْ يَسْتَفْتُونَكَ."
            },
            {
                "hadithNo": "4157",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Hurairah that a deceased man who owed debts would be brought to the Messenger of Allah (s.a.w). He would ask: \"Did he leave behind anything to pay off his debt?\" If he was told that he had left behind something to pay off his debt, he would offer the funeral prayer for him, otherwise he would say: \"Pray for your companion.\" When Allah granted him conquests, he said: \"I am closer to the believers than their own selves. Whoever dies owing a debt, I will repay it, and whoever leaves behind wealth, it is for his heirs.\"",
                "hadithArabic": "وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا أَبُو صَفْوَانَ الأُمَوِىُّ عَنْ يُونُسَ الأَيْلِىِّ ح وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى - وَاللَّفْظُ لَهُ - قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ عَنْ أَبِى سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- كَانَ يُؤْتَى بِالرَّجُلِ الْمَيِّتِ عَلَيْهِ الدَّيْنُ فَيَسْأَلُ « هَلْ تَرَكَ لِدَيْنِهِ مِنْ قَضَاءٍ ». فَإِنْ حُدِّثَ أَنَّهُ تَرَكَ وَفَاءً صَلَّى عَلَيْهِ وَإِلاَّ قَالَ « صَلُّوا عَلَى صَاحِبِكُمْ ». فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ الْفُتُوحَ قَالَ « أَنَا أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنْفُسِهِمْ فَمَنْ تُوُفِّىَ وَعَلَيْهِ دَيْنٌ فَعَلَىَّ قَضَاؤُهُ وَمَنْ تَرَكَ مَالاً فَهُوَ لِوَرَثَتِهِ »."
            },
            {
                "hadithNo": "4158",
                "chapterNo": "4",
                "hadithEnglish": "This Hadith (similar to no. 4157) was narrated from Az-Zuhri with this chain.",
                "hadithArabic": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِى أَبِى عَنْ جَدِّى حَدَّثَنِى عُقَيْلٌ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ أَخِى ابْنِ شِهَابٍ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى حَدَّثَنَا ابْنُ أَبِى ذِئْبٍ كُلُّهُمْ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ هَذَا الْحَدِيثَ."
            },
            {
                "hadithNo": "4159",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"By the One in Whose Hand is the soul of Muhammad! There is no believer on earth but I am the closest of people to him. Whoever among you leaves behind a debt or destitute children, I will take care of them. And whoever among you leaves behind wealth, it is for his heirs, whoever they are.\"",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا شَبَابَةُ قَالَ حَدَّثَنِى وَرْقَاءُ عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « وَالَّذِى نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنْ عَلَى الأَرْضِ مِنْ مُؤْمِنٍ إِلاَّ أَنَا أَوْلَى النَّاسِ بِهِ فَأَيُّكُمْ مَا تَرَكَ دَيْنًا أَوْ ضَيَاعًا فَأَنَا مَوْلاَهُ وَأَيُّكُمْ تَرَكَ مَالاً فَإِلَى الْعَصَبَةِ مَنْ كَانَ »."
            },
            {
                "hadithNo": "4160",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Hammam bin Munabbih said: \"This is what Abu Hurairah narrated to us from the Messenger of Allah (s.a.w),\" and he mentioned a number of Ahadith, including the following: \"The Messenger of Allah (s.a.w) said: 'I am the closest of people to the believers according to the Book of Allah, the Mighty and Sublime. Whoever among you leaves behind a debt or destitute children, call me, and I will take care of them. Whoever among you leaves behind wealth, let his wealth be given to his heirs, whoever they are.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَنَا أَوْلَى النَّاسِ بِالْمُؤْمِنِينَ فِى كِتَابِ اللَّهِ عَزَّ وَجَلَّ فَأَيُّكُمْ مَا تَرَكَ دَيْنًا أَوْ ضَيْعَةً فَادْعُونِى فَأَنَا وَلِيُّهُ وَأَيُّكُمْ مَا تَرَكَ مَالاً فَلْيُؤْثَرْ بِمَالِهِ عَصَبَتُهُ مَنْ كَانَ »."
            },
            {
                "hadithNo": "4161",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Whoever leaves behind wealth, it is for his heirs, and whoever leaves behind children, it is for us (to take care of them).\"",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِىُّ حَدَّثَنَا أَبِى حَدَّثَنَا شُعْبَةُ عَنْ عَدِىٍّ أَنَّهُ سَمِعَ أَبَا حَازِمٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهُ قَالَ « مَنْ تَرَكَ مَالاً فَلِلْوَرَثَةِ وَمَنْ تَرَكَ كَلاًّ فَإِلَيْنَا »."
            },
            {
                "hadithNo": "4162",
                "chapterNo": "4",
                "hadithEnglish": "Shu'bah narrated (a Hadith similar to no. 4161) with this chain, except that in the Hadith of Ghundar it says: \"Whoever leaves behind children, I will take care of them.\"",
                "hadithArabic": "وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ نَافِعٍ حَدَّثَنَا غُنْدَرٌ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ - يَعْنِى ابْنَ مَهْدِىٍّ - قَالاَ حَدَّثَنَا شُعْبَةُ بِهَذَا الإِسْنَادِ. غَيْرَ أَنَّ فِى حَدِيثِ غُنْدَرٍ « وَمَنْ تَرَكَ كَلاًّ وَلِيتُهُ »."
            }
        ]
    }
]