{
    "1670": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1670,
        "enghadithText": " Narrated Al-Bara' bin 'Azib:\r\nThat the Messenger of Allah (ﷺ) said:   Bring me a shoulder blade or tablet.   Then he wrote: Not equal are those of believers who sit. 'Amr bin Umm Maktum who was behind him said:   Is there an exemption for me?   So the following was revealed: Except those who are disabled.\r\nThere are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit.\r\nThis Hadith is Hasan Sahih and it is a Hadith that is Gharib from the narration of Sulaiman At-Taimi from Abu Ishaq.\r\nAnd Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq. ",
        "Arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاق، عَنْ الْبَرَاءِ بْنِ عَازِبٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    ائْتُونِي بِالْكَتِفِ أَوِ اللَّوْحِ، ‏‏‏‏‏‏فَكَتَبَ:‏‏‏‏ لا يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ سورة النساء آية 95   ، ‏‏‏‏‏‏وَعَمْرُو بْنُ أُمِّ مَكْتُومٍ خَلْفَ ظَهْرِهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَلْ لِي مِنْ رُخْصَةٍ ؟ فَنَزَلَتْ:‏‏‏‏ غَيْرُ أُولِي الضَّرَرِ سورة النساء آية 95، ‏‏‏‏‏‏وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَزَيْدِ بْنِ ثَابِتٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَهُوَ حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ سُلَيْمَانَ التَّيْمِيِّ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏وَقَدْ رَوَى شُعْبَةُ، وَالثَّوْرِيُّ، عَنْ أَبِي إِسْحَاق، هَذَا الْحَدِيثَ."
    },
    "1671": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1671,
        "enghadithText": " Narrated 'Abdullah bin 'Umar:\r\nA man came to Prophet (ﷺ) seeking permission to go for Jihad. So he said: 'Do you have parents (living)? ' He said: 'Yes.' He said: 'Then it is for them that you should perform Jihad.'  \r\n[Abu 'Eisa said:] There is something on this topic from Ibn 'Abbas.\r\nThis Hadith is Hasan Sahih. (One of the narrators) Abul-Abbas is the blind (Al-A'ma) poet (Ash-Sha'ir), from Makkah, and his name is As-Sa'ab bin Farrukh. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، وَشُعْبَةَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْذِنُهُ فِي الْجِهَادِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    أَلَكَ وَالِدَانِ ؟   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏    فَفِيهِمَا فَجَاهِدْ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو الْعَبَّاسِ هُوَ الشَّاعِرُ الْأَعْمَى الْمَكِّيُّ وَاسْمُهُ:‏‏‏‏ السَّائِبُ بْنُ فَرُّوخَ."
    },
    "1672": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1672,
        "enghadithText": " Narrated Al-Hajjaj bin Muhammad:\r\nThat Ibn Juraij commented on Allah's saying: Obey Allah and obey the Messenger, and those in authority among you. He said:   Abdullah bin Hudhafah bin Qais bin 'Adi As-Sahmi was sent by the Messenger of Allah (ﷺ) over a military expedition. I was informed of that by Ya'la bin Muslim, from Sa'eed bin Jubair, from Ibn 'Abbas.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do not know if it except as a narration of Ibn Juraij. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ، حَدَّثَنَا الْحَجَّاجُ بْنُ مُحَمَّدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ فِي قَوْلِهِ:‏‏‏‏ أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الأَمْرِ مِنْكُمْ سورة النساء آية 59، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عَبْدُ اللَّهِ بْنُ حُذَافَةَ بْنِ قَيْسِ بْنِ عَدِيٍّ السَّهْمِيُّ:‏‏‏‏    بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى سَرِيَّةٍ، ‏‏‏‏‏‏أَخْبَرَنِيهِ يَعْلَى بْنُ مُسْلِمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنْ ابْنِ عَبَّاسٍ، قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ابْنِ جُرَيْجٍ."
    },
    "1673": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1673,
        "enghadithText": " Narrated Ibn 'Umar:\r\nThat the Messenger of Allah (ﷺ) said:   If the people knew what I know about being alone, then a rider would not journey at night.   - meaning alone. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَاصِمِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ ابْنِ عُمَرَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    لَوْ أَنَّ النَّاسَ يَعْلَمُونَ مَا أَعْلَمُ مِنَ الْوِحْدَةِ، ‏‏‏‏‏‏مَا سَرَى رَاكِبٌ بِلَيْلٍ   ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ وَحْدَهُ."
    },
    "1674": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1674,
        "enghadithText": " Narrated 'Amr bin Shu'aib:\r\nFrom his father, from his grandfather that the Messenger of Allah (ﷺ) said:   The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party.\r\n[Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar.\r\nMuhammad said:   He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him.   The Hadith of 'Abdullah bin 'Amr (no. 1674) is better. ",
        "Arabic": "حَدَّثَنَا إِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    الرَّاكِبُ شَيْطَانٌ، ‏‏‏‏‏‏وَالرَّاكِبَانِ شَيْطَانَانِ، ‏‏‏‏‏‏وَالثَّلَاثَةُ رَكْبٌ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ عَاصِمٍ وَهُوَ ابْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏وَحَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ هُوَ ثِقَةٌ صَدُوقٌ، ‏‏‏‏‏‏وَعَاصِمُ بْنُ عُمَرَ الْعُمَرِيُّ ضَعِيفٌ فِي الْحَدِيثِ لَا أَرْوِي عَنْهُ شَيْئًا."
    },
    "1675": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1675,
        "enghadithText": " Narrated Jabir bin ‘Abdullah :\r\nThat the Messenger of Allah (ﷺ) said:   War is deceit.  \r\n[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Zaid bin Thabit, 'Aishah, Ibn 'Abbas, Abu Hurairah, Asma' bint Yazid bin As-Sakan, Ka'b bin Malik and Anas bin Malik. This Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، وَنَصْرُ بْنُ عَلِيٍّ، قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    الْحَرْبُ خُدْعَةٌ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَزَيْدِ بْنِ ثَابِتٍ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَسْمَاءَ بِنْتِ يَزِيدَ بْنِ السَّكَنِ، ‏‏‏‏‏‏وَكَعْبِ بْنِ مَالِكٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1676": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1676,
        "enghadithText": " Narrated Abu Ishaq:\r\n  I was next to Zaid bin Arqam when he was asked: 'How many battles did the Prophet (ﷺ) fight ?' He said: 'Nineteen.' So I said: 'How many battles did you take part in with him ?' he said: 'Seventeen.' I said: 'Which of them was the first?' He said: 'Dhat Al-Ushaira' or Al-'Usaira'. '  \r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، وَأَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاق، قَالَ:‏‏‏‏ كُنْتُ إِلَى جَنْبِ زَيْدِ بْنِ أَرْقَمَ، فَقِيلَ لَهُ:‏‏‏‏ كَمْ غَزَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَزْوَةٍ ؟ قَالَ:‏‏‏‏    تِسْعَ عَشْرَةَ   ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ كَمْ غَزَوْتَ أَنْتَ مَعَهُ ؟ قَالَ:‏‏‏‏    سَبْعَ عَشْرَةَ   ، ‏‏‏‏‏‏قُلْتُ:‏‏‏‏ أَيَّتُهُنَّ كَانَ أَوَّلَ ؟ قَالَ:‏‏‏‏    ذَاتُ الْعُشَيْرِ، ‏‏‏‏‏‏أَوْ الْعُشَيْرَةِ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1677": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1677,
        "enghadithText": " Narrated 'Abdur-Rahman bin 'Awf:\r\n  The Messenger of Allah (ﷺ) positioned us during the night at Badr.  \r\n[Abu 'Eisa said:] There is something on this topic from Abu Ayyub.\r\nThis Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said:   Muhammad bin Ishaq heard from 'Ikrimah.   And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later. ",
        "Arabic": "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق، عَنْ عِكْرِمَةَ، عَنْ ابْنِ عَبَّاسٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، قَالَ:‏‏‏‏    عَبَّأَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَدْرٍ لَيْلًا   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَبِي أَيُّوبَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَاعِيل، ‏‏‏‏‏‏عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ مُحَمَّدُ بْنُ إِسْحَاق، ‏‏‏‏‏‏سَمِعَ مِنْ عِكْرِمَةَ، ‏‏‏‏‏‏وَحِينَ رَأَيْتُهُ كَانَ حَسَنَ الرَّأْيِ فِي مُحَمَّدِ بْنِ حُمَيْدٍ الرَّازِيِّ، ‏‏‏‏‏‏ثُمَّ ضَعَّفَهُ بَعْدُ."
    },
    "1678": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1678,
        "enghadithText": " Narrated Ibn Abi Awfa:\r\n  I heard him saying   - meaning the Prophet (ﷺ) -   while supplicating against the Ahzab: 'O Allah, Revealer of Book! Severe is reckoning! Rout the Ahzab and shake them.'  \r\n[Abu 'Eisa said:] There is something on this topic from Ibn Masu'd\r\nThis Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا إِسْمَاعِيل بْنُ أَبِي خَالِدٍ، عَنْ ابْنِ أَبِي أَوْفَى، قَالَ:‏‏‏‏ سَمِعْتُهُ يَقُولُ:‏‏‏‏ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو عَلَى الْأَحْزَابِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    اللَّهُمَّ مُنْزِلَ الْكِتَابِ، ‏‏‏‏‏‏سَرِيعَ الْحِسَابِ، ‏‏‏‏‏‏اهْزِمْ الْأَحْزَابَ، ‏‏‏‏‏‏اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ فِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1679": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1679,
        "enghadithText": " Narrated Jabir:\r\n  The Messenger of Allah (ﷺ) entered Makkah, and his standard was white.  \r\n[Abu 'Eisa said:] This Hadith is Gharib, we do know of it except as a narration of Yayha bin Adam from Sharik. He said: I asked Muhammad about this Hadith, but he did not know it except as a narration of Yahya bin Adam from Sharik, he said:   More than one narrator has narrated to us from Sharik from 'Ammar bin Abu Az-Zubair from Jabir: 'The Prophet (ﷺ) entered Makkah and he was wearing a black 'Imamah.'  \r\nMuhammad said:   This is the Hadith.  \r\n[Abu 'Eisa said:] Duhn is a branch of Bajilah (the tribe), and 'Ammar ad-Duhni (one of the narrators) is 'Ammar bin Mu'awiyah Ad-Duhni, and his kunyah is Abu Mu'awiyah, he is from Al-Kufah, and he is trustworthy according to the people of Hadith. ",
        "Arabic": "حَدَّثَنَا حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ الْكُوفِيُّ، وَأَبُو كُرَيْبٍ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالُوا:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ شَرِيكٍ، عَنْ عَمَّارٍ يَعْنِي:‏‏‏‏ الدُّهْنِيَّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    دَخَلَ مَكَّةَ وَلِوَاؤُهُ أَبْيَضُ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَحْيَى بْنِ آدَمَ، ‏‏‏‏‏‏عَنْ شَرِيكٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ، ‏‏‏‏‏‏إِلَّا مِنْ حَدِيثِ يَحْيَى بْنِ آدَمَ، ‏‏‏‏‏‏عَنْ شَرِيكٍ. وقَالَ:‏‏‏‏ حَدَّثَنَا غَيْرُ وَاحِدٍ، ‏‏‏‏‏‏عَنْ شَرِيكٍ، ‏‏‏‏‏‏عَنْ عَمَّارٍ، ‏‏‏‏‏‏عَنْ أَبِي الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ جَابِرٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    دَخَلَ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ   ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ وَالْحَدِيثُ هُوَ هَذَا، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَالدُّهْنُ بَطْنٌ مِنْ بَجِيلَةَ، ‏‏‏‏‏‏وَعَمَّارٌ الدُّهْنِيُّ هُوَ عَمَّارُ بْنُ مُعَاوِيَةَ الدُّهْنِيُّ وَيُكْنَى أَبَا مُعَاوِيَةَ وَهُوَ كُوفِيٌّ وَهُوَ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ."
    },
    "1680": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1680,
        "enghadithText": " Narrated Yunus bin 'Ubaid:\r\nthe freed salve of Muhammad bin Al-Qasim said:   Muhammad bin Al-Qasim sent me to Al-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (ﷺ). He said: 'It was a black square of Namirah.'  \r\n[Abu 'Eisa said:] There are narrations on this topic from 'Ali, Al-Harith bin Hassan, and Ibn 'Abbas.\r\n[Abu 'Eisa said:] This Hadith is Hasan Gharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، حَدَّثَنَا أَبُو يَعْقُوبَ الثَّقَفِيُّ، حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ مَوْلَى مُحَمَّدِ بْنِ الْقَاسِمِ، قَالَ:‏‏‏‏ بَعَثَنِي مُحَمَّدُ بْنُ الْقَاسِمِ إِلَى الْبَرَاءِ بْنِ عَازِبٍ أَسْأَلُهُ عَنْ رَايَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    كَانَتْ سَوْدَاءَ مُرَبَّعَةً مِنْ نَمِرَةٍ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَالْحَارِثِ بْنِ حَسَّانَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ابْنِ أَبِي زَائِدَةَ، ‏‏‏‏‏‏وَأَبُو يَعْقُوبَ الثَّقَفِيُّ اسْمُهُ:‏‏‏‏ إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏وَرَوَى عَنْهُ أَيْضًا عُبَيْدُ اللَّهِ بْنُ مُوسَى."
    },
    "1681": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1681,
        "enghadithText": " Narrated Ibn 'Abbas:\r\n  The flag of the Messenger of Allah (ﷺ) was black, and his standard was white.  \r\n[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route, as a narration of Ibn 'Abbas. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا يَحْيَى بْنُ إِسْحَاق وَهُوَ السَّالِحَانِيُّ، حَدَّثَنَا يَزِيدُ بْنُ حَيَّانَ، قَال:‏‏‏‏ سَمِعْتُ أَبَا مِجْلَزٍ لَاحِقَ بْنَ حُمَيْدٍ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏    كَانَتْ رَايَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَوْدَاءَ، ‏‏‏‏‏‏وَلِوَاؤُهُ أَبْيَضَ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏مِنْ حَدِيثِ ابْنِ عَبَّاسٍ."
    },
    "1682": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1682,
        "enghadithText": " Narrated Al-Muhallab bin Abi Sufrah:\r\nFrom one who heard the Prophet (ﷺ) saying:   If you suffer a surprise attack from the enemy then say: 'Ha Min, they will not be victorious.'  \r\n[Abu 'Eisa said:] There is something on this topic from Salamah bin Al-Akwa'. This is how some of them reported it from Abu Ishaq, the same as the narration of Ath-Thawri. And it has been reported from him, from Al-Muhallab bin Abi Sufrah from the Prophet (ﷺ) in Mursal form. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاق، عَنْ الْمُهَلَّبِ بْنِ أَبِي صُفْرَةَ، عَمَّنْ سَمِعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    إِنْ بَيَّتَكُمُ الْعَدُوُّ فَقُولُوا:‏‏‏‏    حم    لَا يُنْصَرُونَ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ، ‏‏‏‏‏‏وَهَكَذَا رَوَى بَعْضُهُمْ عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏مِثْلَ رِوَايَةِ الثَّوْرِيِّ، ‏‏‏‏‏‏وَرُوِيَ عَنْهُ، ‏‏‏‏‏‏عَنْ الْمُهَلَّبِ بْنِ أَبِي صُفْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا"
    },
    "1683": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1683,
        "enghadithText": " Narrated 'Uthman bin Sa'd:\r\nThat Ibn Sirin said:   I made my sword like the sword of Samurah bin Jundab. Samurah claimed that he made his sword like the sword of the Messenger of Allah (ﷺ), and it was a Hanafiyah.  \r\n[Abu 'Eisa said:] This Hadith is Gharib, we do not know of it except through this route. Yahya bin Sa'eed Al-Qattan has criticized 'Uthman bin Sa'd the scribe, and he graded him weak due to his memory. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ شُجَاعٍ الْبَغْدَادِيُّ، حَدَّثَنَا أَبُو عُبَيْدَةَ الْحَدَّادُ، عَنْ عُثْمَانَ بْنِ سَعْدٍ، عَنْ ابْنِ سِيرِينَ، قَالَ:‏‏‏‏ صَنَعْتُ سَيْفِي عَلَى سَيْفِ سَمُرَةَ بْنِ جُنْدَبٍ، ‏‏‏‏‏‏وَزَعَمَ سَمُرَةُ أَنَّهُ صَنَعَ سَيْفَهُ عَلَى سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَكَانَ حَنَفِيًّا    قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَقَدْ تَكَلَّمَ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، ‏‏‏‏‏‏فِي عُثْمَانَ بْنِ سَعْدٍ الْكَاتِبِ، ‏‏‏‏‏‏وَضَعَّفَهُ مِنْ قِبَلِ حِفْظِهِ."
    },
    "1684": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1684,
        "enghadithText": " Narrated Abu Sa’id Al Khudri :\r\n  During the year of the conquest, when the Prophet (ﷺ) reached Marr Zahran, he told us that we would meet the enemy. So he ordered us to break the fast, and we [all] broke our fast.  \r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih, and there is something on this topic from Ibn 'Umar. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَنْبَأَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ عَطِيَّةَ بْنِ قَيْسٍ، عَنْ قَزَعَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ:‏‏‏‏    لَمَّا بَلَغَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ، ‏‏‏‏‏‏مَرَّ الظَّهْرَانِ، ‏‏‏‏‏‏فَآذَنَنَا بِلِقَاءِ الْعَدُوِّ، ‏‏‏‏‏‏فَأَمَرَنَا بِالْفِطْرِ، ‏‏‏‏‏‏فَأَفْطَرْنَا أَجْمَعُونَ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عُمَرَ."
    },
    "1685": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1685,
        "enghadithText": " Narrated Anas bin Malik:\r\n  The Prophet (ﷺ) rode a horse belonging to Abu Talhah called Mandub. He said: 'There is nothing to be frightened of, and we found him to be (quick) like the sea.'  \r\n[Abu 'Eisa said:] There is something on this topic from Ibn 'Amr Al-'As. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، قَالَ:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ:‏‏‏‏ رَكِبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَسًا لِأَبِي طَلْحَةَ يُقَالُ لَهُ:‏‏‏‏ مَنْدُوبٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    مَا كَانَ مِنْ فَزَعٍ وَإِنْ وَجَدْنَاهُ لَبَحْرًا   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عَمْرِو بْنِ الْعَاصِ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1686": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1686,
        "enghadithText": " Narrated Anas bin Malik:\r\n  There was a cause of fright in Al-Madinah. So the Messenger of Allah (ﷺ) borrowed a horse of ours called Mandub. He said: 'I have not seen anything to be frightened of, and we found him to be (quick) like the sea.'  \r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَابْنُ أَبِي عَدِيٍّ، وأبو داود، قَالُوا:‏‏‏‏ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ كَانَ فَزَعٌ بِالْمَدِينَةِ، ‏‏‏‏‏‏فَاسْتَعَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَسًا لَنَا يُقَالُ لَهُ:‏‏‏‏ مَنْدُوبٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    مَا رَأَيْنَا مِنْ فَزَعٍ وَإِنْ وَجَدْنَاهُ لَبَحْرًا   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1687": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1687,
        "enghadithText": " Narrated Anas:\r\n  The Prophet (ﷺ) was the nicest person among the people, the most generous of the people, and the bravest among the people.   He said:   The inhabitants of Al-Madinah became freightened one night upon hearing a loud noise.   He said:   So the Prophet (ﷺ) met them upon an unsaddled horse belonging to Abu Talhah, with a sword hanging around his neck. He said: 'I found him to be (quick) like the sea.'   - meaning the horse.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَحْسَنِ النَّاسِ، ‏‏‏‏‏‏وَأَجْوَدِ النَّاسِ، ‏‏‏‏‏‏وَأَشْجَعِ النَّاسِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَقَدْ فَزِعَ أَهْلُ الْمَدِينَةِ لَيْلَةً سَمِعُوا صَوْتًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَتَلَقَّاهُمُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى فَرَسٍ لِأَبِي طَلْحَةَ عُرْيٍ وَهُوَ مُتَقَلِّدٌ سَيْفَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    لَمْ تُرَاعُوا، ‏‏‏‏‏‏لَمْ تُرَاعُوا   ، ‏‏‏‏‏‏فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    وَجَدْتُهُ بَحْرًا   ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ الْفَرَسَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ"
    },
    "1688": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1688,
        "enghadithText": " Narrated Abu Ishaq:\r\nFrom Al-Bara' bin 'Azib who said:   A man said to us: 'Did you flee from the Messenger of Allah (ﷺ) O Abu 'Umarah ?'   He said:   No, By Allah! I did not flee from the Messenger of Allah (ﷺ), but som hasty people fled and (the tribe of) Hawazin assaulted them with arrows. The Messenger of Allah (Saws) was on his white muls, and Abu Sufyan bin Al-Harith bin 'Abdul Muttalib was holding its reigns. The Messenger of Allah (ﷺ) was saying: 'I am the Prophet without lie, I am the son of 'Abdul-Muttalib.'  \r\n[Abu 'Eisa said:] There are narrations on this topic from 'Ali, and Ibn 'Umar. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، حَدَّثَنَا أَبُو إِسْحَاق، عَنْ الْبَرَاءِ بِنِ عَازِبٍ، قَالَ:‏‏‏‏ قَالَ لَنَا رَجُلٌ:‏‏‏‏ أَفَرَرْتُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا عُمَارَةَ ؟ قَالَ:‏‏‏‏ لَا وَاللَّهِ، ‏‏‏‏‏‏مَا وَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَلَكِنْ وَلَّى سَرَعَانُ النَّاسِ تَلَقَّتْهُمْ هَوَازِنُ بِالنَّبْلِ، ‏‏‏‏‏‏وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى بَغْلَتِهِ، ‏‏‏‏‏‏وَأَبُو سُفْيَانَ بْنُ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ آخِذٌ بِلِجَامِهَا، ‏‏‏‏‏‏وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    أَنَا النَّبِيُّ لَا كَذِبْ، ‏‏‏‏‏‏أَنَا ابْنُ عَبْدِ الْمُطَّلِبْ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1689": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1689,
        "enghadithText": " Narrated Ibn 'Umar:\r\n  Indeed we saw the day of Hunain, and indeed the two armies fled from the Messenger of Allah (ﷺ), and there did not remain one hundred men with the Messenger of Allah (ﷺ).  \r\n[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of 'Ubaidullah. We do not know of it except from this route. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ الْمُقَدَّمِيُّ الْبَصْرِيُّ، حَدَّثَنِي أَبِي، عَنْ سُفْيَانَ بْنِ حُسَيْنٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏    لَقَدْ رَأَيْتُنَا يَوْمَ حُنَيْنٍ وَإِنَّ الْفِئَتَيْنِ لَمُوَلِّيَتَانِ، ‏‏‏‏‏‏وَمَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِائَةُ رَجُلٍ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ عُبَيْدِ اللَّهِ إِلَّا مِنْ هَذَا الْوَجْهِ."
    },
    "1690": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1690,
        "enghadithText": " Narrated Talib bin Hujair:\r\nFrom Hud bin 'Abdullah bin Sa'd, from his grandfather Mazidah, who said:   The Messenger of Allah (ﷺ) on the Day of the Conquest and there was gold and silver on his sword.   Talib said:   So I asked him about the silver and he said: 'The hand-guard of his sword was of silver.'  \r\n[Abu 'Eisa said:] There is something on this topic form Anas. This Hadith is Hasan Gharib. Hud's (great) grandfather's name is Mazidah Al-'Asari. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ صُدْرَانَ أَبُو جَعْفَرٍ الْبَصْرِيُّ، حَدَّثَنَا طَالِبُ بْنُ حُجَيْرٍ، عَنْ هُودِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ، عَنْ جَدِّهِ مَزِيدَةَ، قَالَ:‏‏‏‏ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ وَعَلَى سَيْفِهِ ذَهَبٌ وَفِضَّةٌ، ‏‏‏‏‏‏قَالَ طَالِبٌ:‏‏‏‏ فَسَأَلْتُهُ عَنِ الْفِضَّةِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    كَانَتْ قَبِيعَةُ السَّيْفِ فِضَّةً   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَجَدُّ هُودٍ اسْمُهُ:‏‏‏‏ مَزِيدَةُ الْعَصَرِيُّ."
    },
    "1691": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1691,
        "enghadithText": " Narrated Anas:\r\n  The hand-guard on the sword of the Messenger of Allah (ﷺ) was made from silver.  \r\n[Abu 'Eisa said:] This Hadith is Hasan Gharib. This is how it has been reported from Hamam from Qatadah from Anas. While some of them reported it from Qatadah, from Sa'eed bin Abu Al-Hasan who said:   The hand-guard on the sword of Messenger of Allah (ﷺ) was made from silver. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرِ بْنِ حَازِمٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ:‏‏‏‏    كَانَتْ قَبِيعَةُ سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَهَكَذَا رُوِيَ عَنْ هَمَّامٍ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏وَقَدْ رَوَى بَعْضُهُمْ عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏    كَانَتْ قَبِيعَةُ سَيْفِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ   ."
    },
    "1692": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1692,
        "enghadithText": " Narrated Az-Zubair bin Al-'Awwam:\r\n  On the Day of Uhud, the Prophet (ﷺ) wore two coats of mail. He tried to get up on a boulder but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it such that he could sit on the boulder. So he said: (Paradise)   It is obligated from Talhah.'  \r\n[Abu 'Eisa said:] There are narrations on this topic from Safwan bin Umayyah and As-Sa'ib bin Yazid.\r\nThis Hadith is Hasan Gharib, we do not know of it except through the narration of Muhammad bin Ishaq. ",
        "Arabic": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاق، عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ الزُّبَيْرِ بْنِ الْعَوَّامِ، قَالَ:‏‏‏‏    كَانَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِرْعَانِ يَوْمَ أُحُدٍ، ‏‏‏‏‏‏فَنَهَضَ إِلَى الصَّخْرَةِ فَلَمْ يَسْتَطِعْ، ‏‏‏‏‏‏فَأَقْعَدَ طَلْحَةَ تَحْتَهُ، ‏‏‏‏‏‏فَصَعِدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ حَتَّى اسْتَوَى عَلَى الصَّخْرَةِ   ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    أَوْجَبَ طَلْحَةُ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ صَفْوَانَ بْنِ أُمَيَّةَ، ‏‏‏‏‏‏وَالسَّائِبِ بْنِ يَزِيدَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مُحَمَّدِ بْنِ إِسْحَاق."
    },
    "1693": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1693,
        "enghadithText": " Narrated Anas bin Malik:\r\nThe Prophet (ﷺ) entered (Makkah) during they year of the Conquest, and upon his head was a helmet (Mighfar). It was said to him: 'Ibn Khatal is clinging to the covering of the Ka'bah.' So he said: 'Kill him.'  \r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib. We do knot know of anyone important who reported it other than Malik from Az-Zuhri. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏    دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ، ‏‏‏‏‏‏فَقِيلَ لَهُ:‏‏‏‏ ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ   ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    اقْتُلُوهُ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُ كَبِيرَ أَحَدٍ رَوَاهُ غَيْرَ مَالِكٍ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ."
    },
    "1694": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1694,
        "enghadithText": " Narrated 'Urwah Al-Bariqi:\r\nThat the Messenger of Allah (ﷺ) said:   Goodness will remain in the forelocks of horses until the Day of Judgement: (They bring about) Rewards and spoils of war.  \r\n[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Abu Sa'eed, Jarir, Abu Hurairah, Asma' bin Yazid, Al-Mughira bin Shu'bah, and Jabir.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Urwah is Ibn Al-Ja'd Al-Bariqi, and they say he is 'Urwah bin Al-Ja'd. Ahmad bin Hanbal said:   The Fiqh of this Hadith is that Jihad is with every Imam until the Day of Judgement. ",
        "Arabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْثَرُ بْنُ الْقَاسِمِ، عَنْ حُصَيْنٍ، عَنْ الشَّعْبِيِّ، عَنْ عُرْوَةَ الْبَارِقِيِّ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    الْخَيْرُ مَعْقُودٌ فِي نَوَاصِي الْخَيْلِ إِلَى يَوْمِ الْقِيَامَةِ، ‏‏‏‏‏‏الْأَجْرُ وَالْمَغْنَمُ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَجَرِيرٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَسْمَاءَ بِنْتِ يَزِيدَ، ‏‏‏‏‏‏وَالْمُغِيرَةِ بْنِ شُعْبَةَ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَعُرْوَةُ هُوَ ابْنُ أَبِي الْجَعْدِ الْبَارِقِيُّ وَيُقَالُ:‏‏‏‏ هُوَ عُرْوَةُ بْنُ الْجَعْدِ، ‏‏‏‏‏‏قَالَ أَحْمَدُ بْنُ حَنْبَلٍ:‏‏‏‏ وَفِقْهُ هَذَا الْحَدِيثِ:‏‏‏‏ أَنَّ الْجِهَادَ مَعَ كُلِّ إِمَامٍ إِلَى يَوْمِ الْقِيَامَةِ."
    },
    "1695": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1695,
        "enghadithText": " Narrated Ibn 'Abbas:\r\nThat the Messenger of Allah (ﷺ) said:   The blessing of the horse is in its redness.  \r\n[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, from the narration of Shaiban. ",
        "Arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ الْبَصْرِيُّ، ‏‏‏‏‏‏حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا شَيْبَانُ يعْنِي ابْنَ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا عِيسَى بْنُ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ أَبِيهِ، عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    يُمْنُ الْخَيْلِ فِي الشُّقْرِ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ شَيْبَانَ."
    },
    "1696": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1696,
        "enghadithText": " Narrated Abu Qatadah:\r\nThat the Prophet (ﷺ) said:   The best horse is the black one with a spot on the face, and white on the upper lip. Then the one with some white on his lower legs, except for the right. So if it is no black, then the Kumait (red one with black on its ears and its mane) with these markings. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، أَخْبَرَنَا ابْنُ لَهِيعَةَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَلِيِّ بْنِ رَبَاحٍ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    خَيْرُ الْخَيْلِ:‏‏‏‏ الْأَدْهَمُ الْأَقْرَحُ الْأَرْثَمُ، ‏‏‏‏‏‏ثُمَّ الْأَقْرَحُ الْمُحَجَّلُ طَلْقُ الْيَمِينِ، ‏‏‏‏‏‏فَإِنْ لَمْ يَكُنْ أَدْهَمَ، ‏‏‏‏‏‏فَكُمَيْتٌ عَلَى هَذِهِ الشِّيَةِ   ."
    },
    "1697": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1697,
        "enghadithText": " Another chain with similar meaning.\r\n[Abu 'Eisa said:\r\n] This Hadith is Hasan Gharib Sahih. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ يَحْيَى بْنِ أَيُّوبَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ بِمَعْنَاهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ."
    },
    "1698": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1698,
        "enghadithText": " Narrated Abu Hurairah:\r\nThat the Prophet (ﷺ) disliked Shikal in horses.\r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported similarly from 'Abdullah bin Yazid Al-Khath'ami, from Abu Zur'ah (one of the narrators in the chain of this Hadith), from Abu Hurairah, from the Prophet (ﷺ). Abu Zur'ah bin 'Amr bin Jarir's name is Harim.\r\nMuhammed bin Hammad Ar-Razi narrated to us (he said):   Jarir narrated to us from 'Umarah bin Al-Qa'qa' who said: 'Ibrahim An-Nakha'i said to me:   When you narrate from me, then narrate from me from Abu Zur'ah, for one time he narrated a Hadith to me, then I asked him about it two years later, and he did not leave a letter out of it. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، قَالَ:‏‏‏‏ حَدَّثَنِي سَلْمُ بْنُ عَبْدِ الرَّحْمَنِ النَّخَعِيُّ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    أَنَّهُ كَرِهَ الشِّكَالَ مِنَ الْخَيْلِ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَاهُ شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَثْعَمِيِّ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏نَحْوَهُ، ‏‏‏‏‏‏وَأَبُو زُرْعَةَ بْنُ عَمْرِو بْنِ جَرِيرٍ اسْمُهُ:‏‏‏‏ هَرِمٌ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، ‏‏‏‏‏‏حَدَّثَنَا جَرِيرٌ، ‏‏‏‏‏‏عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ لِي إِبْرَاهِيمُ النَّخَعِيُّ، ‏‏‏‏‏‏إِذَا حَدَّثْتَنِي فَحَدِّثْنِي عَنْ أَبِي زُرْعَةَ، ‏‏‏‏‏‏فَإِنَّهُ حَدَّثَنِي مَرَّةً بِحَدِيثٍ ثُمَّ سَأَلْتُهُ بَعْدَ ذَلِكَ بِسِنِينَ، ‏‏‏‏‏‏فَمَا أَخْرَمَ مِنْهُ حَرْفًا."
    },
    "1699": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1699,
        "enghadithText": " Narrated Ibn 'Umar:\r\n  The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall.  \r\n[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ وَزِيرٍ الْوَاسِطِيُّ، حَدَّثَنَا إِسْحَاق بْنُ يُوسُفَ الْأَزْرَقُ، عَنْ سُفْيَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    أَجْرَى الْمُضَمَّرَ مِنَ الْخَيْلِ مِنْ الْحَفْيَاءِ إِلَى ثَنِيَّةِ الْوَدَاعِ وَبَيْنَهُمَا سِتَّةُ أَمْيَالٍ، ‏‏‏‏‏‏وَمَا لَمْ يُضَمَّرْ مِنَ الْخَيْلِ مِنْ ثَنِيَّةِ الْوَدَاعِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ وَبَيْنَهُمَا مِيلٌ، ‏‏‏‏‏‏وَكُنْتُ فِيمَنْ أَجْرَى، ‏‏‏‏‏‏فَوَثَبَ بِي فَرَسِي جِدَارًا   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ صَحِيحٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏مِنْ حَدِيثِ الثَّوْرِيِّ."
    },
    "1700": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1700,
        "enghadithText": " Narrated Abu Hurairah:\r\nThat the Prophet (ﷺ) said:   No stake is acceptable except in archery, racing a camel, and racing a horse. ",
        "Arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ ابْنِ أَبِي ذِئْبٍ، عَنْ نَافِعِ بْنِ أَبِي نَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    لَا سَبَقَ إِلَّا فِي نَصْلٍ، ‏‏‏‏‏‏أَوْ خُفٍّ، ‏‏‏‏‏‏أَوْ حَافِرٍ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
    },
    "1701": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1701,
        "enghadithText": " Narrated Ibn 'Abbas:\r\n  The Messenger of Allah (ﷺ) was a slave (of Allah), who would order as he has ben ordered to. He did not give an order to us instead of the people regarding anything except for three: He ordered us that we make our Wudu' well (Isbagh), that we not eat from charity, and the we not mate a donkey with a horse.  \r\n[Abu 'Eisa said:] There is something on this topic from 'Ali. This Hadith is Hasan Sahih.\r\nSufyan Ath-Thawri reported this from Abu Jahdam, who said:   From 'Ubaidullah bin 'Abdullah bin 'Abbas, from Ibn 'Abbas.   He said I heard Muhammad saying:   The narration of Ath-Thawri is not preserved. Ath-Thawri made a mistake in it. What is correct is what Ismail bin 'Ulaiyyah and 'Abul-Warith bin Sa'eed reported from Abu Jahdam, from 'Abdullah bin 'Ubaidullah bin 'Abbas from Ibn 'Abbas. ",
        "Arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبُو جَهْضَمٍ مُوسَى بْنُ سَالِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدًا مَأْمُورًا، ‏‏‏‏‏‏مَا اخْتَصَّنَا دُونَ النَّاسِ بِشَيْءٍ إِلَّا بِثَلَاثٍ:‏‏‏‏    أَمَرَنَا أَنْ نُسْبِغَ الْوُضُوءَ، ‏‏‏‏‏‏وَأَنْ لَا نَأْكُلَ الصَّدَقَةَ، ‏‏‏‏‏‏وَأَنْ لَا نُنْزِيَ حِمَارًا عَلَى فَرَسٍ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى سُفْيَانُ الثَّوْرِيُّ هَذَا، ‏‏‏‏‏‏عَنْ أَبِي جَهْضَمٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وسَمِعْت مُحَمَّدًا، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ حَدِيثُ الثَّوْرِيِّ غَيْرُ مَحْفُوظٍ وَوَهِمَ فِيهِ الثَّوْرِيُّ، ‏‏‏‏‏‏وَالصَّحِيحُ مَا رَوَى إِسْمَاعِيل ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏وَعَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَبِي جَهْضَمٍ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ."
    },
    "1702": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1702,
        "enghadithText": " Narrated Abu Ad-Darda':\r\nThat he heard the Prophet (ﷺ) saying:   Seek your weak for me. For indeed you sustenance and aid is only by your weak.  \r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، قَالَ:‏‏‏‏ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ، حَدَّثَنَا زَيْدُ بْنُ أَرْطَاةَ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    ابْغُونِي ضُعَفَاءَكُمْ، ‏‏‏‏‏‏فَإِنَّمَا تُرْزَقُونَ وَتُنْصَرُونَ بِضُعَفَائِكُمْ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1703": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1703,
        "enghadithText": " Narrated Abu Hurairah:\r\nThat the Messenger of Allah (ﷺ) said:   The angels do no accompany a group among whom there is a dog or a bell.  \r\n[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar, Umm Habibah, and Umm Salamah. This Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا كَلْبٌ، ‏‏‏‏‏‏وَلَا جَرَسٌ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عُمَرَ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَأُمِّ حَبِيبَةَ، ‏‏‏‏‏‏وَأُمِّ سَلَمَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1704": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1704,
        "enghadithText": " Narrated Al-Bara' :\r\n  The Prophet (ﷺ) sent two armies, place 'Ali bin Abi Talib as the commanded of one of them, and Khalid bin Al-Walid over the other. He said: 'Where there is fighting, then 'Ali (is in command).'   He said:   So 'Ali conquered a fortress and took a slave girl. Khalid [bin Al-Walid] wrote a letter and sent me with it to the Prophet (ﷺ), to speak against him for it. So I arrived to the Prophet (ﷺ) to read the letter. The color of his face changed, the he said: 'What do you think about a man who loves Allah and His Messenger, and Allah and His Messenger love him?'   He said:   I said: 'I seek refuge from angering Allah and angering His Messenger, I am only the Messenger.' So he was silent.\r\n[Abu 'Eisa said:] There is something about this from Ibn 'Umar. This Hadith is Hasan Gharib, we do not know of it except from the narration of Al-Ahwas bin Jawwab. And his saying:   To speak against him for that.   refers to An-Namimah. ",
        "Arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ، حَدَّثَنَا الْأَحْوَصُ بْنُ الْجَوَّابِ أَبُو الْجَوَّابِ، عَنْ يُونُسَ بْنِ أَبِي إِسْحَاق، عَنْ أَبِي إِسْحَاق، عَنْ الْبَرَاءِ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    بَعَثَ جَيْشَيْنِ وَأَمَّرَ عَلَى أَحَدِهِمَا عَلِيَّ بْنَ أَبِي طَالِبٍ، ‏‏‏‏‏‏وَعَلَى الْآخَرِ خَالِدَ بْنَ الْوَلِيدِ   ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    إِذَا كَانَ الْقِتَالُ، ‏‏‏‏‏‏فَعَلِيٌّ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَافْتَتَحَ عَلِيٌّ حِصْنًا فَأَخَذَ مِنْهُ جَارِيَةً، ‏‏‏‏‏‏فَكَتَبَ مَعِي خَالِدُ بْنُ الْوَلِيدِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشِي بِهِ، ‏‏‏‏‏‏فَقَدِمْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَرَأَ الْكِتَابَ، ‏‏‏‏‏‏فَتَغَيَّرَ لَوْنُهُ ثُمَّ قَالَ:‏‏‏‏    مَا تَرَى فِي رَجُلٍ يُحِبُّ اللَّهَ وَرَسُولَهُ، ‏‏‏‏‏‏وَيُحِبُّهُ اللَّهُ وَرَسُولُهُ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ أَعُوذُ بِاللَّهِ مِنْ غَضَبِ اللَّهِ وَغَضَبِ رَسُولِهِ، ‏‏‏‏‏‏وَإِنَّمَا أَنَا رَسُولٌ، ‏‏‏‏‏‏فَسَكَتَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْأَحْوَصِ بْنِ جَوَّابٍ، ‏‏‏‏‏‏قَوْلُهُ يَشِي بِهِ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ النَّمِيمَةَ."
    },
    "1705": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1705,
        "enghadithText": " Ibrahim bin Bash-shar Ar-Ramadi reported it from Sufyan bin 'Uyainah, from Buraid bin 'Abdullah bin Abu Burdah, from Abu Burdah, from Abu Musa, from the Prophet (ﷺ).\r\nMuhammad informed me of that, from Ibrahim bin Bash-Shar [Ar-Ramadi]. Muhammad said:\r\n  More than one has reported it from Sufyan, from Buraid bin Abu Burdah [from Abu Burdah] from the Prophet (ﷺ) in Mursal form. This is more correct.   Muhammad said:   Ishaq bin Ibrahim reported from Mu'adh bin Hisham, from his father, from Qatadah, from Anas, from the Prophet (ﷺ) who said: 'Indeed Allah will question everyone who is responsible about his charge.'   I heard Muhammad saying:   This is not preserved. It is only correct from Mu'adh bin Hisham from his father, from Qatadah, from Al-Hasan, from the Prophet (ﷺ), in Mursal form. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    أَلَا كُلُّكُمْ رَاعٍ، ‏‏‏‏‏‏وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ، ‏‏‏‏‏‏فَالْأَمِيرُ الَّذِي عَلَى النَّاسِ رَاعٍ وَمَسْئُولٌ عَنْ رَعِيَّتِهِ، ‏‏‏‏‏‏وَالرَّجُلُ رَاعٍ عَلَى أَهْلِ بَيْتِهِ وَهُوَ مَسْئُولٌ عَنْهُمْ، ‏‏‏‏‏‏وَالْمَرْأَةُ رَاعِيَةٌ عَلَى بَيْتِ بَعْلِهَا وَهِيَ مَسْئُولَةٌ عَنْهُ، ‏‏‏‏‏‏وَالْعَبْدُ رَاعٍ عَلَى مَالِ سَيِّدِهِ وَهُوَ مَسْئُولٌ عَنْهُ، ‏‏‏‏‏‏أَلَا فَكُلُّكُمْ رَاعٍ، ‏‏‏‏‏‏وَكُلُّكُمْ مَسْئُولٌ عَنْ رَعِيَّتِهِ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَأَبِي مُوسَى، ‏‏‏‏‏‏وَحَدِيثُ أَبِي مُوسَى غَيْرُ مَحْفُوظٍ، ‏‏‏‏‏‏وَحَدِيثُ أَنَسٍ غَيْرُ مَحْفُوظٍ، ‏‏‏‏‏‏وَحَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَكَاهُ إِبْرَاهِيمُ بْنُ بَشَّارٍ الرَّمَادِيُّ، ‏‏‏‏‏‏عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، ‏‏‏‏‏‏عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنْ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنْ أَبِي مُوسَى، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَخْبَرَنِي بِذَلِكَ مُحَمَّدٌ بِنِ إِبْرَاهِيمَ بْنِ بَشَّارٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَرَوَى غَيْرُ وَاحِدٍ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ بُرَيْدٍ، ‏‏‏‏‏‏عَنْ أَبِي بُرْدَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَهَذَا أَصَحُّ، ‏‏‏‏‏‏قَالَ مُحَمَّدٌ:‏‏‏‏ وَرَوَى إِسْحَاق بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ مُعَاذِ بْنِ هِشَامٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    إِنَّ اللَّهَ سَائِلٌ كُلَّ رَاعٍ عَمَّا اسْتَرْعَاهُ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْت مُحَمَّدًا، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ هَذَا غَيْرُ مَحْفُوظٍ، ‏‏‏‏‏‏وَإِنَّمَا الصَّحِيحُ عَنْ مُعَاذِ بْنِ هِشَامٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ قَتَادَةَ، ‏‏‏‏‏‏عَنْ الْحَسَنِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا."
    },
    "1706": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1706,
        "enghadithText": " Narrated Umm Al-Husain Al-Ahmasiyyah:\r\nI heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.   She said:   I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'  \r\n[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاق، عَنْ الْعَيْزَارِ بْنِ حُرَيْثٍ، عَنْ أُمِّ الْحُصَيْنِ الْأَحْمَسِيَّةِ، قَالَتْ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فِي حَجَّةِ الْوَدَاعِ، ‏‏‏‏‏‏وَعَلَيْهِ بُرْدٌ قَدِ الْتَفَعَ بِهِ مِنْ تَحْتِ إِبْطِهِ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فَأَنَا أَنْظُرُ إِلَى عَضَلَةِ عَضُدِهِ تَرْتَجُّ، ‏‏‏‏‏‏سَمِعْتُهُ يَقُولُ:‏‏‏‏    يَا أَيُّهَا النَّاسُ، ‏‏‏‏‏‏اتَّقُوا اللَّهَ، ‏‏‏‏‏‏وَإِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ مُجَدَّعٌ، ‏‏‏‏‏‏فَاسْمَعُوا لَهُ، ‏‏‏‏‏‏وَأَطِيعُوا مَا أَقَامَ لَكُمْ كِتَابَ اللَّهِ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَعِرْبَاضِ بْنِ سَارِيَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أُمِّ حُصَيْنٍ."
    },
    "1707": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1707,
        "enghadithText": " Narrated Ibn 'Umar:\r\nThat the Messenger of Allah (ﷺ) said:   Hearing and obeying is required from every Muslim man - in what he like and what he dislikes - as long as he is not ordered with disobedience. If he is ordered with disobedience, then no hearing or obeying is required of him.  \r\n[Abu 'Eisa said:] There are narrations on this topic from 'Ali, 'Imran bin Husain, and Al-Hakam bin 'Amr Al-Ghifari. This Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    السَّمْعُ وَالطَّاعَةُ عَلَى الْمَرْءِ الْمُسْلِمِ فِيمَا أَحَبَّ وَكَرِهَ، ‏‏‏‏‏‏مَا لَمْ يُؤْمَرْ بِمَعْصِيَةٍ، ‏‏‏‏‏‏فَإِنْ أُمِرَ بِمَعْصِيَةٍ، ‏‏‏‏‏‏فَلَا سَمْعَ عَلَيْهِ وَلَا طَاعَةَ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏وَعِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏وَالْحَكَمِ بْنِ عَمْرٍو الْغِفَارِيِّ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1708": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1708,
        "enghadithText": " Narrated Abu Yahya:\r\nFrom Mujahid from Ibn 'Abbas who said:   The Messenger of Allah (ﷺ) prohibited instigating fights between beasts. ",
        "Arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ قُطْبَةَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ الْأَعْمَشِ، عَنْ أَبِي يَحْيَى، عَنْ مُجَاهِدٍ، عَنْ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏    نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّحْرِيشِ بَيْنَ الْبَهَائِمِ   ."
    },
    "1709": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1709,
        "enghadithText": " Abu Yahya reported from Mujahid:\r\n  The Prophet (ﷺ) prohibited instigating fights between beasts.   And he did not mention   from Ibn 'Abbas   in it.\r\nIt is said that this is more correct that the (previous) narration of Qutbah. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ الْأَعْمَشِ، عَنْ أَبِي يَحْيَى، عَنْ مُجَاهِدٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    نَهَى عَنِ التَّحْرِيشِ بَيْنَ الْبَهَائِمِ   ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ فِيهِ عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ هَذَا أَصَحُّ مِنْ حَدِيثِ قُطْبَةَ، ‏‏‏‏‏‏وَرَوَى شَرِيكٌ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏نَحْوَهُ، ‏‏‏‏‏‏وَلَمْ يَذْكُرْ فِيهِ عَنْ أَبِي يَحْيَى، ‏‏‏‏‏‏حَدَّثَنَا بِذَلِكَ أَبُو كُرَيْبٍ، عَنْ يَحْيَى بْنِ آدَمَ، عَنْ شَرِيكٍ، ‏‏‏‏‏‏وَرَوَى أَبُو مُعَاوِيَةَ، عَنْ الْأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏نَحْوَهُ، ‏‏‏‏‏‏وَأَبُو يَحْيَى هُوَ الْقَتَّاتُ الْكُوفِيُّ وَيُقَالُ اسْمُهُ:‏‏‏‏ زَاذَانُ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ طَلْحَةَ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَعِكْرَاشِ بْنِ ذُؤَيْبٍ."
    },
    "1710": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1710,
        "enghadithText": " Narrated Jabir:\r\n  The Prophet (ﷺ) prohibited branding on the face and striking (it).  \r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، عَنْ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    نَهَى عَنِ الْوَسْمِ فِي الْوَجْهِ وَالضَّرْبِ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1711": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1711,
        "enghadithText": " Narrated Nafi:\r\nThat Ibn 'Umar said:   I was reviewed before army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him later in army while I was fifteen years old, and he accepted me.  \r\nNafi said:   I narrated this Hadith to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between youth and manhood.' The he wrote to give salaries to whoever reached fifteen years of age. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَزِيرِ الْوَاسِطِيُّ، حَدَّثَنَا إِسْحَاق بْنُ يُوسُفَ الْأَزْرَقُ، عَنْ سُفْيَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏    عُرِضْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَيْشٍ وَأَنَا ابْنُ أَرْبَعَ عَشْرَةَ فَلَمْ يَقْبَلْنِي، ‏‏‏‏‏‏ثُمَّ عُرِضْتُ عَلَيْهِ مِنْ قَابِلٍ فِي جَيْشٍ وَأَنَا ابْنُ خَمْسَ عَشْرَةَ فَقَبِلَنِي   ، ‏‏‏‏‏‏قَالَ نَافِعٌ:‏‏‏‏ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    هَذَا حَدُّ مَا بَيْنَ الصَّغِيرِ وَالْكَبِيرِ، ‏‏‏‏‏‏ثُمَّ كَتَبَ أَنْ يُفْرَضَ لِمَنْ بَلَغَ الْخَمْسَ عَشْرَةَ   ."
    },
    "1712": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1712,
        "enghadithText": " Narrated 'Abdullah bin Abi Qatadah:\r\nThat he heard is father, narating a Hadith, which he heard from the Messenger of Allah (ﷺ) in which he stood among them, mentioning to them that Jihad in the cause of Allah and faith in Allah were the most virtuous of deeds. Then a man stood and said:   O Messenger of Allah! If I were killed in the cause of Allah, would my sins forgiven ?   So the Messenger of Allah (ﷺ) said:   Yes, If you are killed in Allah's cause, and you are patient, seeking the reward, advancing, not fleeing.   Then the Messenger of Allah (ﷺ) said:   What was it that you said?   So he replied:   If I were killed in the cause of Allah, would my sins be removed (forgiven)?   So the Messenger of Allah (ﷺ) said:   Yes, If you are patient, seeking the reward, advancing, not fleeing - except debt. For Jibril said that to me.  \r\n[Abu 'Eisa said:] There are narrations on this topic from Anas, Muhammad bin Jahsh, And Abu Hurairah. This Hadith is Hasan Sahih.\r\nSome of them reported this Hadith from Sa'eed Al-Maqburi, from Abu Hurairah, from the Prophet (ﷺ) similar to this. Yahya bin Sa'eed Al-Ansari and more than one narrator reported this from Sa'eed Al-Maqburi from 'Abdullah bin Abi Qatadah, from his fahter, from the Prophet (ﷺ). This is more correct than the narration of Sa'eed Al-Maqburi from Abu Hurairah. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَهُ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهُ قَامَ فِيهِمْ فَذَكَرَ لَهُمْ:‏‏‏‏ أَنَّ الْجِهَادَ فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏وَالْإِيمَانَ بِاللَّهِ، ‏‏‏‏‏‏أَفْضَلُ الْأَعْمَالِ، ‏‏‏‏‏‏فَقَامَ رَجُلٌ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏يُكَفِّرُ عَنِّي خَطَايَايَ ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    نَعَمْ، ‏‏‏‏‏‏إِنْ قُتِلْتَ فِي سَبِيلِ اللَّهِ وَأَنْتَ صَابِرٌ مُحْتَسِبٌ مُقْبِلٌ غَيْرُ مُدْبِرٍ   ، ‏‏‏‏‏‏ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    كَيْفَ قُلْتَ ؟   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَرَأَيْتَ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ، ‏‏‏‏‏‏أَيُكَفِّرُ عَنِّي خَطَايَايَ ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    نَعَمْ، ‏‏‏‏‏‏وَأَنْتَ صَابِرٌ مُحْتَسِبٌ مُقْبِلٌ غَيْرُ مُدْبِرٍ، ‏‏‏‏‏‏إِلَّا الدَّيْنَ، ‏‏‏‏‏‏فَإِنَّ جِبْرِيلَ قَالَ لِي ذَلِكَ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏وَمُحَمَّدِ بْنِ جَحْشٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا، ‏‏‏‏‏‏وَرَوَى يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ، ‏‏‏‏‏‏وَغَيْرُ وَاحِدٍ هَذَا، ‏‏‏‏‏‏عَنْ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَهَذَا أَصَحُّ مِنْ حَدِيثِ سَعِيدٍ الْمَقْبُرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ."
    },
    "1713": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1713,
        "enghadithText": " Narrated Hisham bin 'Amr:\r\n  On the day of Uhud, the wounded complained to the Messenger of Allah, so he said: 'Dig, and make it wide, and appropriate, and bury two and three in one grave. And advance the one who knew the most Qu'ran.' My father had died so he placed before two men.  \r\n[Abu 'Eisa said:] There are narrations on this topic from Khabbab, Jabir, and Anas.\r\nThis Hadith is Hasan Sahih\r\nSufyan Ath-Thawri and others reported this Hadith from Ayyub, from Humaid bin Hilal, from Hisham bin 'Amir. And Abu Ad-Dahma's (a narrator in the chain) name is Qirfah bin Buhais or Baihas ",
        "Arabic": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ الْبَصْرِيُّ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، عَنْ أَبِي الدَّهْمَاءِ، عَنْ هِشَامِ بْنِ عَامِرٍ، قَالَ:‏‏‏‏ شُكِيَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجِرَاحَاتُ يَوْمَ أُحُدٍ فَقَالَ:‏‏‏‏    احْفِرُوا، ‏‏‏‏‏‏وَأَوْسِعُوا، ‏‏‏‏‏‏وَأَحْسِنُوا، ‏‏‏‏‏‏وَادْفِنُوا الِاثْنَيْنِ وَالثَّلَاثَةَ فِي قَبْرٍ وَاحِدٍ، ‏‏‏‏‏‏وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًا   ، ‏‏‏‏‏‏فَمَاتَ أَبِي، ‏‏‏‏‏‏فَقُدِّمَ بَيْنَ يَدَيْ رَجُلَيْنِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ خَبَّابٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى سُفْيَانُ الثَّوْرِيُّ، وَغَيْرُهُ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ أَيُّوبَ، عَنْ حُمَيْدِ بْنِ هِلَالٍ، عَنْ هِشَامِ بْنِ عَامِرٍ، وَأَبُو الدَّهْمَاءِ اسْمُهُ:‏‏‏‏ قِرْفَةُ بْنُ بُهَيْسٍ أَوْ بَيْهَسٍ."
    },
    "1714": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1714,
        "enghadithText": " Narrated Abu 'Ubaidah:\r\nThat 'Abdullah said:   On the Day of Badr when the captives were gathered, the Messenger of Allah (ﷺ) said: 'What do you (people) say about these captives?'   Then he mentioned the story in the lengthy Hadith.\r\n[Abu 'Eisa said:] There are narrations of this topic from 'Umar, Abu Ayyub, Anas, and Abu Hurairah\r\nThis Hadith is Hasan, and Abu 'Ubaidah did not hear from his father. It has been reported that Abu Hurairah said:   None was more apt to seek council of his Companions than the Messenger of Allah (ﷺ) ",
        "Arabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ الْأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ:‏‏‏‏ لَمَّا كَانَ يَوْمُ بَدْرٍ، ‏‏‏‏‏‏وَجِيءَ بِالْأُسَارَى، ‏‏‏‏‏‏قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَا تَقُولُونَ فِي هَؤُلَاءِ الْأُسَارَى ؟   ، ‏‏‏‏‏‏فَذَكَرَ قِصَّةً فِي هَذَا الْحَدِيثِ طَوِيلَةً، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب، ‏‏‏‏‏‏عَنْ عُمَرَ، ‏‏‏‏‏‏وَأَبِي أَيُّوبَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَأَبُو عُبَيْدَةَ لَمْ يَسْمَعْ مِنْ أَبِيهِ، ‏‏‏‏‏‏وَيُرْوَى عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا رَأَيْتُ أَحَدًا أَكْثَرَ مَشُورَةً لِأَصْحَابِهِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
    },
    "1715": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1715,
        "enghadithText": " Narrated Ibn 'Abbas:\r\n  The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him].  \r\n[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said:   I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof.   Muhammad bin Isma'il said:   Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him.   Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain.\r\nNasr bin 'Ali narrated to us, [he said:]   Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.' ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنْ ابْنِ أَبِي لَيْلَى، عَنْ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنْ ابْنِ عَبَّاسٍ    أَنَّ الْمُشْرِكِينَ أَرَادُوا أَنْ يَشْتَرُوا جَسَدَ رَجُلٍ مِنَ الْمُشْرِكِينَ، ‏‏‏‏‏‏فَأَبَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعَهُمْ إِيَّاهُ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْحَكَمِ، ‏‏‏‏‏‏وَرَوَاهُ الْحَجَّاجُ بْنُ أَرْطَاةَ أَيْضًا عَنْ الْحَكَمِ، ‏‏‏‏‏‏وقَالَ أَحْمَدُ بْنُ الْحَسَنِ:‏‏‏‏ سَمِعْتُ أَحْمَدُ بْنُ حَنْبَلٍ، ‏‏‏‏‏‏يَقولُ:‏‏‏‏ ابْنُ أَبِي لَيْلَى لَا يُحْتَجُّ بِحَدِيثِهِ، ‏‏‏‏‏‏وقَالَ مُحَمَّدُ بْنُ إِسْمَاعِيل:‏‏‏‏ ابْنُ أَبِي لَيْلَى صَدُوقٌ وَلَكِنْ لَا نَعْرِفُ صَحِيحَ حَدِيثِهِ مِنْ سَقِيمِهِ وَلَا أَرْوِي عَنْهُ شَيْئًا، ‏‏‏‏‏‏وَابْنُ أَبِي لَيْلَى صَدُوقٌ فَقِيهٌ، ‏‏‏‏‏‏وَرُبَّمَا يَهِمُ فِي الْإِسْنَادِ، ‏‏‏‏‏‏حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، ‏‏‏‏‏‏عَنْ سُفْيَانَ الثَّوْرِيِّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فُقَهَاؤُنَا ابْنُ أَبِي لَيْلَى عَبْدُ اللَّهِ بْنُ شُبْرُمَةَ."
    },
    "1716": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1716,
        "enghadithText": " Narrated Ibn 'Umar:\r\n  The Messenger of Allah sent us on a military expedition, and the people turned to escape. So we arrived in Al-Madinah and concealed ourselves in it and we said: 'We are ruined.' Then we went to the Messenger of Allah (ﷺ) and we said: 'O Messenger of Allah! We are those who fled.' He said: 'Rather you are Al-'Akkarun (those who are regrouping) and I am your reinforcement.\r\n[Abu 'Eisa said:] This Hadith is Hasan Gharib. We do not know of it except as a narration of Yazid bin Abi Ziyad. And the meaning of his saying:   The people turned to escape   is that they fled from the fighting. As for the meaning of his saying:   Rather you are Al-'Akkarun,   the 'Akkar is the one who flees to his Imam in order that he may help him, it does not mean fleeing from the advancing army. ",
        "Arabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏    بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ، ‏‏‏‏‏‏فَحَاصَ النَّاسُ حَيْصَةً، ‏‏‏‏‏‏فَقَدِمْنَا الْمَدِينَةَ، ‏‏‏‏‏‏فَاخْتَبَيْنَا بِهَا وَقُلْنَا:‏‏‏‏ هَلَكْنَا، ‏‏‏‏‏‏ثُمَّ أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْنَا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏نَحْنُ الْفَرَّارُونَ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏    بَلْ أَنْتُمُ الْعَكَّارُونَ وَأَنَا فِئَتُكُمْ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَزِيدَ بْنِ أَبِي زِيَادٍ، ‏‏‏‏‏‏وَمَعْنَى قَوْلِهِ:‏‏‏‏ فَحَاصَ النَّاسُ حَيْصَةً، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ أَنَّهُمْ فَرُّوا مِنَ الْقِتَالِ، ‏‏‏‏‏‏وَمَعْنَى قَوْلِهِ:‏‏‏‏    بَلْ أَنْتُمُ الْعَكَّارُونَ   ، ‏‏‏‏‏‏وَالْعَكَّارُ:‏‏‏‏ الَّذِي يَفِرُّ إِلَى إِمَامِهِ لِيَنْصُرَهُ، ‏‏‏‏‏‏لَيْسَ يُرِيدُ الْفِرَارَ مِنَ الزَّحْفِ."
    },
    "1717": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1717,
        "enghadithText": " Narrated Jabir bin ‘Abdullah :\r\n  On the day of Uhud, my father's sister came with my father to bury him in a cemetery of ours. So one of the callers of the Messenger of Allah (ﷺ) called out: 'Return those killed to where they were lying.  \r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. And (one of the narrators) Nubaih is trustworthy. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، أَخْبَرَنَا شُعْبَةُ، عَنْ الْأَسْوَدِ بْنِ قَيْسٍ، قَال:‏‏‏‏ سَمِعْتُ نُبَيْحًا الْعَنَزِيَّ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ جَابِرٍ، قَالَ:‏‏‏‏ لَمَّا كَانَ يَوْمُ أُحُدٍ، ‏‏‏‏‏‏جَاءَتْ عَمَّتِي بِأَبِي لِتَدْفِنَهُ فِي مَقَابِرِنَا، ‏‏‏‏‏‏فَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    رُدُّوا الْقَتْلَى إِلَى مَضَاجِعِهِمْ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَنُبَيْحٌ ثِقَةٌ."
    },
    "1718": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1718,
        "enghadithText": " Narrated As-Sa'ib bin Yazid:\r\n  When the Messenger of Allah (ﷺ) arrived from Tabuk, the people went out to Thaniyyah Al-Wada' to meet him.   As-Sa'ib said:   I went out with the people, and I was a boy.  \r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. ",
        "Arabic": "حَدَّثَنَا حَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ الزُّهْرِيِّ، عَنْ السَّائِبِ بْنِ يَزِيدَ، قَالَ:‏‏‏‏    لَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ تَبُوكَ، ‏‏‏‏‏‏خَرَجَ النَّاسُ يَتَلَقَّوْنَهُ إِلَى ثَنِيَّةِ الْوَدَاعِ   ، ‏‏‏‏‏‏قَالَ السَّائِبُ:‏‏‏‏ فَخَرَجْتُ مَعَ النَّاسِ وَأَنَا غُلَامٌ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "1719": {
        "bookNumber": 23,
        "bookName": "The Book on Jihad",
        "hadithNumber": 1719,
        "enghadithText": " Narrated 'Umar bin Al-Khattab:\r\n  The wealth of Banu An-Nadir was among the spoils of war which Allah granted upon His Messenger (ﷺ) which the Muslims did not gain with the rush of their horses nor camel. So it was purely for the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) would set aside a year's worth of expenditure for his family, then he would use what remained of it for horses and weapons to be used in Allah's cause.  \r\n[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan bin 'Uyainah reported this Hadith from Ma'mar, from Ibn Shihab. ",
        "Arabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، قَالَ:‏‏‏‏ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ:‏‏‏‏ كَانَتْ أَمْوَالُ بَنِي النَّضِيرِ مِمَّا أَفَاءَ اللهُ عَلَى رَسُولِهِ مِمَّا لَمْ يُوجِفْ الْمُسْلِمُونَ عَلَيْهِ بِخَيْلٍ وَلَا رِكَابٍ، ‏‏‏‏‏‏وَكَانَتْ لِرَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَالِصًا، ‏‏‏‏‏‏وَكَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    يَعْزِلُ نَفَقَةَ أَهْلِهِ سَنَةً، ‏‏‏‏‏‏ثُمَّ يَجْعَلُ مَا بَقِيَ فِي الْكُرَاعِ وَالسَّلَاحِ عُدَّةً فِي سَبِيلِ اللهِ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى سُفْيَانُ بْنُ عُيَيْنَةَ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهابٍ."
    }
}