{
    "2270": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2270,
        "enghadithText": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\r\n  When time draws near, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. The dream of a Muslim is a portion among the forty-six portions of Prophet-hood. And dreams are of three types: The righteous dream which is good news from Allah, dreams in which the Shaithan frightens someone, and dreams about something that has happened to the man himself. So when one of you sees what he dislikes, then he should get up and spit, and not tell any of the people- he said:- and I like the fetters in a dream while I dislike the iron collar.   And the interpretation of fetters is being firm in the religion  . ",
        "Arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُؤْمِنِ تَكْذِبُ وَأَصْدَقُهُمْ رُؤْيَا أَصْدَقُهُمْ حَدِيثًا، ‏‏‏‏‏‏وَرُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ، ‏‏‏‏‏‏وَالرُّؤْيَا ثَلَاثٌ:‏‏‏‏ فَالرُّؤْيَا الصَّالِحَةُ بُشْرَى مِنَ اللَّهِ، ‏‏‏‏‏‏وَالرُّؤْيَا مِنْ تَحْزِينِ الشَّيْطَانِ، ‏‏‏‏‏‏وَالرُّؤْيَا مِمَّا يُحَدِّثُ بِهَا الرَّجُلُ نَفْسَهُ، ‏‏‏‏‏‏فَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُمْ فَلْيَتْفُلْ وَلَا يُحَدِّثْ بِهَا النَّاسَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَأُحِبُّ الْقَيْدَ فِي النَّوْمِ وَأَكْرَهُ الْغُلَّ، ‏‏‏‏‏‏الْقَيْدُ ثَبَاتٌ فِي الدِّينِ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2271": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2271,
        "enghadithText": " Ubadah bin As-Samit narrated that the Prophet (s.a.w) said:\r\n  The dreams of the believer are a portion of the forty-six portions of Prophet-hood  . ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، أَنَّهُ سَمِعَ أَنَسًا يُحَدِّثُ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي رَزِينٍ الْعُقَيْلِيِّ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَعَوْفِ بْنِ مَالِكٍ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَحَدِيثُ عُبَادَةَ حَدِيثٌ صَحِيحٌ."
    },
    "2272": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2272,
        "enghadithText": " Anas bin Malik narrated:\r\n  The Messenger of Allah (s.a.w) said: 'Indeed Messenger-ship and Prophethood have been terminated, so there shall be no Messenger after me, nor a Prophet.'   He(Anas) said:  The people were concerned about that, so he (s.a.w) said: 'But there will be Mubash-shirat.' So they said: 'O Messenger of Allah! What is Mubash-shirat?' He said: 'The Muslim's dreams, for it is a portion of the portions of Prophethood.' ",
        "Arabic": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زيَادٍ، حَدَّثَنَا الْمُخْتَارُ بْنُ فُلْفُلٍ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    إِنَّ الرِّسَالَةَ وَالنُّبُوَّةَ قَدِ انْقَطَعَتْ، ‏‏‏‏‏‏فَلَا رَسُولَ بَعْدِي وَلَا نَبِيَّ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَشَقَّ ذَلِكَ عَلَى النَّاسِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    لَكِنْ الْمُبَشِّرَاتُ   ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏وَمَا الْمُبَشِّرَاتُ ؟ قَالَ:‏‏‏‏    رُؤْيَا الْمُسْلِمِ، ‏‏‏‏‏‏وَهِيَ جُزْءٌ مِنْ أَجْزَاءِ النُّبُوَّةِ   ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَحُذَيْفَةَ بْنِ أَسِيدٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأُمِّ كُرْزٍ، ‏‏‏‏‏‏وَأَبِي أَسِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ الْمُخْتَارِ بْنِ فُلْفُلٍ."
    },
    "2273": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2273,
        "enghadithText": " Ata' bin Yasar narrated from a man among the inhabitants of Egypt who said:\r\nI asked Abu Ad-Darda about the saying of Allah, Most High: 'For them are glad tidings in the life of the present world' so he said: 'No one other than you asked me about it, except for one man, since I asked the Messenger of Allah (s.a.w), he said: 'No one other than you has asked me about it since it was revealed: This Ayah refers to the righteous dreams which the Muslim sees or which are seen about him. ",
        "Arabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ أَبَا الدَّرْدَاءِ عَنْ قَوْلِ اللَّهِ تَعَالَى:‏‏‏‏ لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا سورة يونس آية 64، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا سَأَلَنِي عَنْهَا أَحَدٌ غَيْرُكَ إِلَّا رَجُلٌ وَاحِدٌ مُنْذُ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    مَا سَأَلَنِي عَنْهَا أَحَدٌ غَيْرُكَ مُنْذُ أُنْزِلَتْ، ‏‏‏‏‏‏هِيَ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
    },
    "2274": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2274,
        "enghadithText": " Abu Sa'eed narrated that the Prophet (s.a.w) said:\r\n  The most truthful of dreams are in the last hours of the night. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا ابْنُ لَهِيعَةَ، عَنْ دَرَّاجٍ، عَنْ أَبِي الْهَيْثَمَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    أَصْدَقُ الرُّؤْيَا بِالْأَسْحَارِ   ."
    },
    "2275": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2275,
        "enghadithText": " It is narrated from 'Ubadah bin As-Samit, who said:\r\n  [I asked] the Messenger of Allah (s.a.w) about For them are glad tidings in the life of the present world. He said: 'This refers to the righteous dreams which the Muslim sees or which are seen about him.' ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ، وَعِمْرَانُ الْقَطَّانُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، قَالَ:‏‏‏‏ نُبِّئْتُ، ‏‏‏‏‏‏عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ:‏‏‏‏ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ:‏‏‏‏ لَهُمُ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا سورة يونس آية 64، ‏‏‏‏‏‏قَالَ:‏‏‏‏    هِيَ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُؤْمِنُ أَوْ تُرَى لَهُ   ، ‏‏‏‏‏‏قَالَ حَرْبٌ فِي حَدِيثِهِ:‏‏‏‏ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
    },
    "2276": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2276,
        "enghadithText": " Abdullah narrated that the Prophet (s.a.w) said:\r\n  Whoever saw me (in a dream) while sleeping then he has indeed seen me. For indeed the Shaitan can not resemble me. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاق، عَنْ أَبِي الْأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ بِي   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي قَتَادَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَأَبِي مَالِكٍ الْأَشْجَعِيِّ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏وَأَبِي بَكْرَةَ، ‏‏‏‏‏‏وَأَبِي جُحَيْفَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2277": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2277,
        "enghadithText": " Abu Qatadah narrated that the Messenger of Allah (s.a.w) said:\r\n  Dreams are from Allah and Hulum are from Shaitan. So when one of you sees something that bothers him, then let him spit on his left three times, and let him seek refuge in Allah from its evil. Then it will not harm him. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي قَتَادَةَ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ:‏‏‏‏    الرُّؤْيَا مِنَ اللَّهِ، ‏‏‏‏‏‏وَالْحُلْمُ مِنَ الشَّيْطَانِ، ‏‏‏‏‏‏فَإِذَا رَأَى أَحَدُكُمْ شَيْئًا يَكْرَهُهُ فَلْيَنْفُثْ عَنْ يَسَارِهِ ثَلَاثَ مَرَّاتٍ وَلْيَسْتَعِذْ بِاللَّهِ مِنْ شَرِّهَا فَإِنَّهَا لَا تَضُرُّهُ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2278": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2278,
        "enghadithText": " Waki' bin 'Udus narrated that Abu Razin Al-'Uqaili said:\r\n   The Messenger of Allah (s.a.w) said:    The believer's dreams are a portion of the forty portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it drops.   I think he said:    And it should not be discussed except with an intelligent one or a beloved one. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، قَالَ:‏‏‏‏ أَنْبَأَنَا شُعْبَةُ، قَالَ:‏‏‏‏ أَخْبَرَنِي يَعْلَى بْنُ عَطَاءٍ، قَال:‏‏‏‏ سَمِعْتُ وَكِيعَ بْنَ عُدُسٍ، عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ أَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ، ‏‏‏‏‏‏وَهِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يَتَحَدَّثْ بِهَا، ‏‏‏‏‏‏فَإِذَا تَحَدَّثَ بِهَا سَقَطَتْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَأَحْسَبُهُ قَالَ:‏‏‏‏ وَلَا يُحَدِّثُ بِهَا إِلَّا لَبِيبًا أَوْ حَبِيبًا   ."
    },
    "2279": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2279,
        "enghadithText": " Waki' bin 'Udus narrated from Abu Razin that the Prophet (s.a.w) said:\r\n   The Muslim's dreams are a portion of the forty-six portions of Prophet-hood. And it is (as if it is) on the leg of a bird, as long as it is not spoken of. But when it is spoken of it falls. ",
        "Arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا شُعْبَةُ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ وَكِيعِ بْنِ عُدُسٍ، عَنْ عَمِّهِ أَبِي رَزِينٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    رُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ وَهِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدِّثْ بِهَا، ‏‏‏‏‏‏فَإِذَا حَدَّثَ بِهَا وَقَعَتْ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو رَزِينٍ الْعُقَيْلِيُّ اسْمُهُ لَقِيطُ بْنُ عَامِرٍ، ‏‏‏‏‏‏وَرَوَى حَمَّادُ بْنُ سَلَمَةَ، ‏‏‏‏‏‏عَنْ يَعْلَى بْنِ عَطَاءٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَنْ وَكِيعِ بْنِ حُدُسٍ، ‏‏‏‏‏‏وَقَالَ شُعْبَةُ، ‏‏‏‏‏‏وَأَبُو عَوَانَةَ، ‏‏‏‏‏‏وَهُشَيْمٌ:‏‏‏‏ عَنْ يَعْلَى بْنِ عَطَاءٍ، ‏‏‏‏‏‏عَنْ وَكِيعِ بْنِ عُدُسٍ، ‏‏‏‏‏‏وَهَذَا أَصَحُّ."
    },
    "2280": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2280,
        "enghadithText": " Abu Hurarirah narrated that the Messenger of Allah (s.a.w) said:\r\n  Dreams are of three types: The true dream, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So whoever sees what he dislikes, then he should get up and perform Salah.   And he would say:   I like fetters and I dislike the iron collar.   And he would say:    Whoever has seen me (in a dream) then it is I , for indeed Shaitan is not able to resemble me.   And he would say:   The dream is not to be narrated except to a knowledgeable person or a sincere advisor. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي عُبَيْدِ اللَّهِ السَّلِيمِيُّ الْبَصْرِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    الرُّؤْيَا ثَلَاثٌ:‏‏‏‏ فَرُؤْيَا حَقٌّ، ‏‏‏‏‏‏وَرُؤْيَا يُحَدِّثُ بِهَا الرَّجُلُ نَفْسَهُ، ‏‏‏‏‏‏وَرُؤْيَا تَحْزِينٌ مِنَ الشَّيْطَانِ، ‏‏‏‏‏‏فَمَنْ رَأَى مَا يَكْرَهُ فَلْيَقُمْ فَلْيُصَلِّ   . (حديث مرفوع) (حديث موقوف) وَكَانَ يَقُولُ:‏‏‏‏    يُعْجِبُنِي الْقَيْدُ وَأَكْرَهُ الْغُلَّ، ‏‏‏‏‏‏الْقَيْدُ ثَبَاتٌ فِي الدِّينِ   . (حديث مرفوع) (حديث موقوف) وَكَانَ يَقُولُ:‏‏‏‏    مَنْ رَآنِي فَإِنِّي أَنَا هُوَ، ‏‏‏‏‏‏فَإِنَّهُ لَيْسَ لِلشَّيْطَانِ أَنْ يَتَمَثَّلَ بِي   . (حديث مرفوع) (حديث موقوف) وَكَانَ يَقُولُ:‏‏‏‏    لَا تُقَصُّ الرُّؤْيَا إِلَّا عَلَى عَالِمٍ أَوْ نَاصِحٍ   ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ أَنَسٍ، ‏‏‏‏‏‏وَأَبِي بَكْرَةَ، ‏‏‏‏‏‏وَأُمِّ الْعَلَاءِ، ‏‏‏‏‏‏وَابْنِ عُمَرَ، ‏‏‏‏‏‏وَعَائِشَةَ، ‏‏‏‏‏‏وَأَبِي مُوسَى، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2281": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2281,
        "enghadithText": " Abu 'Abdur-Rahman(As-Sulami) narrated from 'Ali and I think he said:\r\n   From the Prophet(s.a.w), who said:   Whoever lies about his dream, he will be required to knot barely kernels on the Day of Judgement. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْأَعْلَى، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ، قَالَ:‏‏‏‏ أُرَاهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    مَنْ كَذَبَ فِي حُلْمِهِ كُلِّفَ يَوْمَ الْقِيَامَةِ عَقْدَ شَعِيرَةٍ   ."
    },
    "2282": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2282,
        "enghadithText": " (another chain) from Abu 'Abdur-Rahman As-Sulami who narrated from 'Ali from the Prophet with similar narrations. [He said:\r\nThis narration is Hasan.] There are narration on this topic from Ibn 'Abbas, Abu Hurairah, Abu Shuraih and Wathilah bin Al-Asqa'. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْأَعْلَى، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي شُرَيْحٍ، ‏‏‏‏‏‏وَوَاثِلَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا أَصَحُّ مِنَ الْحَدِيثِ الْأَوَّلِ."
    },
    "2283": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2283,
        "enghadithText": " Ibn 'Abbas narrated that the Prophet (s.a.w) said:\r\n  Whoever lies about having a dream, he will be required to knot two barely kernels together on the Day Of Judgment., and he will never be able to knot them together. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    مَنْ تَحَلَّمَ كَاذِبًا كُلِّفَ يَوْمَ الْقِيَامَةِ أَنْ يَعْقِدَ بَيْنَ شَعِيرَتَيْنِ، ‏‏‏‏‏‏وَلَنْ يَعْقِدَ بَيْنَهُمَا   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2284": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2284,
        "enghadithText": " Ibn 'Umar narrated that the Messenger of Allah (s.a.w) said:\r\n  While I was sleeping , I was brought a cup of milk and I drank from it. Then I gave what I had left to 'Umar bin Al-Khattab.   They said;   How did you interpret it O Messenger of Allah?   He said:   Knowledge. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    بَيْنَمَا أَنَا نَائِمٌ إِذْ أُتِيتُ بِقَدَحِ لَبَنٍ، ‏‏‏‏‏‏فَشَرِبْتُ مِنْهُ ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏ الْعِلْمَ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَأَبِي بَكْرَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ سَلَامٍ، ‏‏‏‏‏‏وَخُزَيْمَةَ، ‏‏‏‏‏‏وَالطُّفَيْلِ بْنِ سَخْبَرَةَ، ‏‏‏‏‏‏وَأَبِي أُمَامَةَ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ صَحِيحٌ."
    },
    "2285": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2285,
        "enghadithText": " Abu Umamah bin Sahl bin Hunaif narrated from some of the companions of the Prophet (s.a.w) that the Prophet (s.a.w) said:\r\n  While I was sleeping I saw people presented before me, and that they were wearing shirts. Some of them (the shirts) reaching their breasts, and some of them reaching below that.   He said:   Then 'Umar was presented before me and he was wearing a shirt that was dragging.   They said:   How did you interpret that O Messenger of Allah?   He said:   The religion. ",
        "Arabic": "حَدَّثَنَا الْحُسَيْنُ بْنُ مُحمَّدٍ الْجُرَيْريُّ الْبَلْخِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    بَيْنَمَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَيَّ وَعَلَيْهِمْ قُمُصٌ مِنْهَا مَا يَبْلُغُ الثُّدِيَّ، ‏‏‏‏‏‏وَمِنْهَا مَا يَبْلُغُ أَسْفَلَ مِنْ ذَلِكَ، ‏‏‏‏‏‏فَعُرِضَ عَلَيَّ عُمَرُ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ، ‏‏‏‏‏‏قَالُوا:‏‏‏‏ فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏ الدِّينَ   ."
    },
    "2286": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2286,
        "enghadithText": " Abu Umamah bin Sahl bin Hunaif narrated from Abu Sa'eed al-Khudri that the Prophet (s.a.w) said:\r\nsimilar in meaning (to no. 2285). ",
        "Arabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنْ أَبِيهِ، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَذَا أَصَحُّ."
    },
    "2287": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2287,
        "enghadithText": " Abu Bakrah narrated:\r\n  One day the Prophet (s.a.w) said:   'Who among you had a dream?' A man said:   I did. I saw as if a scale had descended from the Heavens in which you and Abu Bakr were weighed So you outweighed Abu Bakr. Abu Bkar and 'Umar were weighed, and Abu Bakr outweighed ('Umar). 'Umar and 'Uthman were weighed and 'Umar outweighed ('Uthman). Then the scale was raised up.' Then I saw dislike in the the face of Messenger of Allah (s.a.w). ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا الْأَنْصَارِيُّ، حَدَّثَنَا أَشْعَثُ، عَنِ الْحَسَنِ، عَنْ أَبِي بَكْرَةَ:‏‏‏‏ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَاتَ يَوْمٍ:‏‏‏‏    مَنْ رَأَى مِنْكُمْ رُؤْيَا ؟ فَقَالَ رَجُلٌ:‏‏‏‏ أَنَا رَأَيْتُ كَأَنَّ مِيزَانًا نَزَلَ مِنَ السَّمَاءِ فَوُزِنْتَ أَنْتَ وَأَبُو بَكْرٍ، ‏‏‏‏‏‏فَرَجَحْتَ أَنْتَ بِأَبِي بَكْرٍ، ‏‏‏‏‏‏وَوُزِنَ أَبُو بَكْرٍ وَعُمَرُ، ‏‏‏‏‏‏فَرَجَحَ أَبُو بَكْرٍ، ‏‏‏‏‏‏وَوُزِنَ عُمَرُ وَعُثْمَانُ، ‏‏‏‏‏‏فَرَجَحَ عُمَرُ، ‏‏‏‏‏‏ثُمَّ رُفِعَ الْمِيزَانُ فَرَأَيْنَا الْكَرَاهِيَةَ فِي وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2288": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2288,
        "enghadithText": " Aishah said:\r\n  The Messenger of Allah (s.a.w) was asked about Waraqah. Khadijah said to him: 'He believed in you, but he died before your advent.' So the Messenger of Allah (s.a.w) said: 'I saw him in a dream, and upon him were white garments. If he were among the inhabitants of the Fire then he would have been wearing other than that.' ",
        "Arabic": "حَدَّثَنَا أَبُو مُوسَى الْأَنْصَارِيُّ، حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ، حَدَّثَنِي عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ وَرَقَةَ، ‏‏‏‏‏‏فَقَالَتْ لَهُ خَدِيجَةُ:‏‏‏‏ إِنَّهُ كَانَ صَدَّقَكَ، ‏‏‏‏‏‏وَلَكِنَّهُ مَاتَ قَبْلَ أَنْ تَظْهَرَ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    أُرِيتُهُ فِي الْمَنَامِ، ‏‏‏‏‏‏وَعَلَيْهِ ثِيَابٌ بَيَاضٌ وَلَوْ كَانَ مِنْ أَهْلِ النَّارِ لَكَانَ عَلَيْهِ لِبَاسٌ غَيْرُ ذَلِكَ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏وَعُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ لَيْسَ عِنْدَ أَهْلِ الْحَدِيثِ بِالْقَوِيِّ."
    },
    "2289": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2289,
        "enghadithText": " Salim bin 'Abdullah narrated from 'Abdullah bin 'Umar about the dream of the Prophet (s.a.w) and Abu Bakr and 'Umar, so he said:\r\n  I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رُؤْيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏    رَأَيْتُ النَّاسَ اجْتَمَعُوا، ‏‏‏‏‏‏فَنَزَعَ أَبُو بَكْرٍ ذَنُوبًا أَوْ ذَنُوبَيْنِ فِيهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ، ‏‏‏‏‏‏ثُمَّ قَامَ عُمَرُ فَنَزَعَ فَاسْتَحَالَتْ غَرْبًا، ‏‏‏‏‏‏فَلَمْ أَرَ عَبْقَرِيًّا يَفْرِي فَرْيَهُ حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَهَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ ابْنِ عُمَرَ."
    },
    "2290": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2290,
        "enghadithText": " Salim bin 'Abdullah narrated from his father about the dream of the Prophet (s.a.w) who said:\r\n  I saw a black woman with unkempt hair going out of Al-Madinah, until she stood in Mabaya'ah, and it is Al-Juhfah. So I interpreted that to be an epidemic in Al-Madinah that would spread to Al-Juhfah. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ رُؤْيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    رَأَيْتُ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الرَّأْسِ خَرَجَتْ مِنَ الْمَدِينَةِ حَتَّى قَامَتْ بِمَهْيَعَةَ وَهِيَ الْجُحْفَةُ، ‏‏‏‏‏‏وَأَوَّلْتُهَا وَبَاءَ الْمَدِينَةِ يُنْقَلُ إِلَى الْجُحْفَةِ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ."
    },
    "2291": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2291,
        "enghadithText": " Abu Hurrairah narrated that the Messenger of Allah (s.a.w) said:\r\n  In the end of time, the dreams of a believer will hardly ever fail to come true, and the most truthful of them in dreams will be the truest in speech among them. And dreams are three types: The good dreams wihich is glad tidings from Allah, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So when one of you sees what he dislikes, then he should get up and perform Salat.   Abu Hurairah said:   I like fetters and dislikes, the iron collar. And fetters refers to being firm in the religion.   He said:   The Prophet (s. a. w) said: 'Dreams are a portion among the forty_six portions of Prophethood. ",
        "Arabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    فِي آخِرِ الزَّمَانِ لَا تَكَادُ رُؤْيَا الْمُؤْمِنِ تَكْذِبُ وَأَصْدَقُهُمْ رُؤْيَا أَصْدَقُهُمْ حَدِيثًا، ‏‏‏‏‏‏وَالرُّؤْيَا ثَلَاثٌ:‏‏‏‏ الْحَسَنَةُ بُشْرَى مِنَ اللَّهِ، ‏‏‏‏‏‏وَالرُّؤْيَا يُحَدِّثُ الرَّجُلُ بِهَا نَفْسَهُ، ‏‏‏‏‏‏وَالرُّؤْيَا تَحْزِينٌ مِنَ الشَّيْطَانِ، ‏‏‏‏‏‏فَإِذَا رَأَى أَحَدُكُمْ رُؤْيَا يَكْرَهُهَا فَلَا يُحَدِّثُ بِهَا أَحَدًا، ‏‏‏‏‏‏وَلْيَقُمْ فَلْيُصَلِّ   . (حديث موقوف) (حديث موقوف) قَالَ أَبُو هُرَيْرَةَ:‏‏‏‏    يُعْجِبُنِي الْقَيْدُ وَأَكْرَهُ الْغُلَّ، ‏‏‏‏‏‏الْقَيْدُ ثَبَاتٌ فِي الدِّينِ   . (حديث مرفوع) (حديث موقوف) قَالَ:‏‏‏‏ قَالَ:‏‏‏‏ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رَوَى عَبْدُ الْوَهَّابِ الثَّقَفِيُّ هَذَا الْحَدِيثَ عَنْ أَيُّوبَ مَرْفُوعًا، ‏‏‏‏‏‏وَرَوَاهُ حَمَّادُ بْنُ زَيْدٍ، ‏‏‏‏‏‏عَنْ أَيُّوبَ وَوَقَفَهُ."
    },
    "2292": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2292,
        "enghadithText": " Ibn 'abbas narrated fro Abu Hurairah that the Messengr of Allah (s.a.w) said:\r\n  I had a dream while sleeping as if there were two gold bracelets in my hands which bothered me very much. So it was reveled to me to blow them off. I blew them off and they flew away. I interpreted thwm to be two liars who would appear after me. One of them caled Masalamah of Yamamah, and (the other) Al-'ansi of San'a'.   (sahih) ",
        "Arabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ الْبَغْدَادِيُّ، حَدَّثَنَا أَبُو الْيَمَانِ، عَنْ شُعَيْبٍ وَهُوَ ابْنُ أَبِي حَمْزَةَ، عَنِ ابْنِ أَبِي حُسَيْنٍ وَهُوَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    رَأَيْتُ فِي الْمَنَامِ كَأَنَّ فِي يَدَيَّ سِوَارَيْنِ مِنْ ذَهَبٍ فَهَمَّنِي شَأْنُهُمَا، ‏‏‏‏‏‏فَأُوحِيَ إِلَيَّ أَنْ أَنْفُخَهُمَا فَنَفَخْتُهُمَا فَطَارَا، ‏‏‏‏‏‏فَأَوَّلْتُهُمَا كَاذِبَيْنِ يَخْرُجَانِ مِنْ بَعْدِي، ‏‏‏‏‏‏يُقَالُ لِأَحَدِهِمَا:‏‏‏‏ مُسَيْلِمَةُ صَاحِبُ الْيَمَامَةِ، ‏‏‏‏‏‏وَالْعَنْسِيُّ صَاحِبُ صَنْعَاءَ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ."
    },
    "2293": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2293,
        "enghadithText": " Abu Hurairah narrated that a man came to the Prophet (s.a.w) and said:\r\n  I had a dream of a cloud with shade dripping butter and honey. I saw the people scooping it up with their hands, some taking much and some taking little. I saw a rope extending from the sky to the earth. Then I saw you O Messenger of Allah ! You took hold of it and went up, then a man took hold of it after you do so, then a man took hold of it after him to do so. Then a man took hold of it and it was severed, and then connected for him, and he did so (i.e. , went up).   Abu Bakr said:   May my father and mother be ransomed for you O Messenger of Allah! Allow me to interpret it.   He said:   Interpret it.   so he said:   As for the cloud with its shade, it is Islam. As for what the butter and honey that dropped from it, this is the Quran and its delicateness and sweetness. It means some of them gathered much of the Quran and some of them a little. As for the rope extending from the sky to the earth, it is the truth which you are upon, you clug to it and Allah exalted you. Then another man will take hold of it after you and ascend on it, then after him, another man will take hold of it and ascend on it. Then another [man] will take hold of it but it will break, then be connected so he will ascend on it. Inform me O Messenger of Allah! Am I correct or am I mistaken?   The Prophet (s.a.w) said:   You are correct in some of it and mistaken in some of it.   He (i.e., Abu Bakr) said:   I swear to you by my father and my mother O Messenger of Allah! Inform me in what I was mistaken?   The Prophet(s.a.w) said:   Do not swear. ",
        "Arabic": "حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ كَانَ أَبُو هُرَيْرَة يُحَدِّثُ، ‏‏‏‏‏‏أَنَّ رَجُلًا جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنِّي رَأَيْتُ اللَّيْلَةَ ظُلَّةً يَنْطِفُ مِنْهَا السَّمْنُ وَالْعَسَلُ، ‏‏‏‏‏‏وَرَأَيْتُ النَّاسَ يَسْتَقُونَ بِأَيْدِيهِمْ فَالْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ، ‏‏‏‏‏‏وَرَأَيْتُ سَبَبًا وَاصِلًا مِنَ السَّمَاءِ إِلَى الْأَرْضِ، ‏‏‏‏‏‏وَأَرَاكَ يَا رَسُولَ اللَّهِ أَخَذْتَ بِهِ فَعَلَوْتَ، ‏‏‏‏‏‏ثُمَّ أَخَذَ بِهِ رَجُلٌ بَعْدَكَ فَعَلَا، ‏‏‏‏‏‏ثُمَّ أَخَذَ بِهِ رَجُلٌ بَعْدَهُ فَعَلَا، ‏‏‏‏‏‏ثُمَّ أَخَذَ بِهِ رَجُلٌ فَقُطِعَ بِهِ، ‏‏‏‏‏‏ثُمَّ وُصِلَ لَهُ فَعَلَا بِهِ، ‏‏‏‏‏‏فَقَالَ أَبُو بَكْرٍ:‏‏‏‏ أَيْ رَسُولَ اللَّهِ، ‏‏‏‏‏‏بِأَبِي أَنْتَ وَأُمِّي وَاللَّهِ لَتَدَعَنِّي أَعْبُرُهَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    اعْبُرْهَا   ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَمَّا الظُّلَّةُ فَظُلَّةُ الْإِسْلَامِ، ‏‏‏‏‏‏وَأَمَّا مَا يَنْطِفُ مِنَ السَّمْنِ وَالْعَسَلِ، ‏‏‏‏‏‏فَهُوَ الْقُرْآنُ لِينُهُ وَحَلَاوَتُهُ، ‏‏‏‏‏‏وَأَمَّا الْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ فَهُوَ الْمُسْتَكْثِرُ مِنَ الْقُرْآنِ وَالْمُسْتَقِلُّ مِنْهُ، ‏‏‏‏‏‏وَأَمَّا السَّبَبُ الْوَاصِلُ مِنَ السَّمَاءِ إِلَى الْأَرْضِ فَهُوَ الْحَقُّ الَّذِي أَنْتَ عَلَيْهِ فَأَخَذْتَ بِهِ فَيُعْلِيكَ اللَّهُ، ‏‏‏‏‏‏ثُمَّ يَأْخُذُ بِهِ بَعْدَكَ رَجُلٌ آخَرُ فَيَعْلُو بِهِ، ‏‏‏‏‏‏ثُمَّ يَأْخُذُ بِهِ بَعْدَهُ رَجُلٌ آخَرُ فَيَعْلُو بِهِ، ‏‏‏‏‏‏ثُمَّ يَأْخُذُ رَجُلٌ آخَرُ فَيَنْقَطِعُ بِهِ، ‏‏‏‏‏‏ثُمَّ يُوصَلُ لَهُ فَيَعْلُو، ‏‏‏‏‏‏أَيْ رَسُولَ اللَّهِ، ‏‏‏‏‏‏لَتُحَدِّثَنِّي أَصَبْتُ أَوْ أَخْطَأْتُ ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    أَصَبْتَ بَعْضًا وَأَخْطَأْتَ بَعْضًا   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَقْسَمْتُ بِأَبِي أَنْتَ وَأُمِّي لَتُخْبِرَنِّي مَا الَّذِي أَخْطَأْتُ ؟ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    لَا تُقْسِمْ   ، ‏‏‏‏‏‏قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2294": {
        "bookNumber": 34,
        "bookName": "Chapters On Dreams",
        "hadithNumber": 2294,
        "enghadithText": " Samurah bin Jundub narrated :\r\n  When the Messenger of Allah (s.a.w) had led us in Subh(Fajr prayer), he turned to face the people and said: 'Did any of you have a dream during the night?'   [He said:] This Hadith is Hasan Sahih. This Hadith has been related from 'Awf and Jarir bin Hazim, from Abu Raja', from sumarah from the Prophet(s.a.w) with the story in its entirety. [He said:] This is how Bundar reported this Hadith, with its brevity, from Wahib bin Jarir. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرِ بْنِ حَازِمٍ، عَنْ أَبِيهِ، عَنْ أَبِي رَجَاءٍ، عَنْ سَمْرَةَ بْنِ جُنْدَبٍ، قَالَ:‏‏‏‏ كَانَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمِ    إِذَا صَلَّى بِنَا الصُّبْحَ أَقْبَلَ عَلَى النَّاسِ بِوَجْهِهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ هَلْ رَأَى أَحَدٌ مِنْكُمُ اللَّيْلَةَ رُؤْيَا ؟   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَيُروى هَذَا الْحَدِيثُ عَنْ عَوْفٍ، وَجَرِيرِ بْنِ حَازِمٍ، عَنْ أَبِي رَجَاءٍ، عَنْ سَمُرَةَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمُ فِي قِصَّةٍ طَوِيلَةٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَهَكَذَا رَوَى مُحَمَّدُ بْنُ بَشَّارٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ وَهْبِ بْنِ جَرِيرٍ مُخْتَصَرًا."
    }
}