{
    "2295": {
        "bookNumber": 35,
        "bookName": "Chapters On Witnesses",
        "hadithNumber": 2295,
        "enghadithText": " Zaid bin Khalid Al-Juhani narrated that the Messenger of Allah (s.a.w) said:\r\n  Shall l not inform you of the best of witnesses? The one who comes with his testimony before being asked for it. ",
        "Arabic": "حَدَّثَنَا الْأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عُثْمَانَ، عَنْ أَبِي عَمْرَةَ الْأَنْصَارِيِّ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    أَلَا أُخْبِرُكُمْ بِخَيْرِ الشُّهَدَاءِ ؟ الَّذِي يَأْتِي بِالشَّهَادَةِ قَبْلَ أَنْ يُسْأَلَهَا   ."
    },
    "2296": {
        "bookNumber": 35,
        "bookName": "Chapters On Witnesses",
        "hadithNumber": 2296,
        "enghadithText": " (Another chain) from Malik in which he said:\r\nIbn Abi 'Amrah. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ نَحْوَهُ، ‏‏‏‏‏‏وَقَالَ ابْنُ أَبِي عَمْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَأَكْثَرُ النَّاسِ، ‏‏‏‏‏‏يَقُولُونَ:‏‏‏‏ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ، ‏‏‏‏‏‏وَاخْتَلَفُوا عَلَى مَالِكٍ فِي رِوَايَةِ هَذَا الْحَدِيثِ، ‏‏‏‏‏‏فَرَوَى بَعْضُهُمْ عَنْ أَبِي عَمْرَةَ، ‏‏‏‏‏‏وَرَوَى بَعْضُهُمْ عَنْ ابْنِ أَبِي عَمْرَةَ وَهُوَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ الْأَنْصَارِيُّ، ‏‏‏‏‏‏وَهَذَا أَصَحُّ لِأَنَّهُ قَدْ رُوِيَ مِنْ غَيْرِ حَدِيثِ مَالِكٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ خَالِدٍ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنِ ابْنِ أَبِي عَمْرَةَ، ‏‏‏‏‏‏عَنْ زَيْدِ بْنِ خَالِدٍ غَيْرُ هَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَهُوَ حَدِيثٌ صَحِيحٌ أَيْضًا، ‏‏‏‏‏‏وَأَبُو عَمْرَةَ مَوْلَى زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، ‏‏‏‏‏‏وَلَهُ حَدِيثُ الْغُلُولِ، ‏‏‏‏‏‏وَأَكْثَرُ النَّاسِ، ‏‏‏‏‏‏يَقُولُونَ:‏‏‏‏ عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ."
    },
    "2297": {
        "bookNumber": 35,
        "bookName": "Chapters On Witnesses",
        "hadithNumber": 2297,
        "enghadithText": " Zaid bin Khalid Al-Juhani narrated that the Messenger of Allah(s.a.w) said:\r\n  The best of witnesses is the one who gives his testimony before being asked for it. ",
        "Arabic": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ ابْنُ بِنْتِ أَزْهَرَ السَّمَّانِ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا أُبَيُّ بْنُ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ، حَدَّثَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ عُثْمَانَ، حَدَّثَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ، حَدَّثَنِي زَيْدُ بْنُ خَالِدٍ الْجُهَنِيُّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    خَيْرُ الشُّهَدَاءِ مَنْ أَدَّى شَهَادَتَهُ قَبْلَ أَنْ يُسْأَلَهَا   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
    },
    "2298": {
        "bookNumber": 35,
        "bookName": "Chapters On Witnesses",
        "hadithNumber": 2298,
        "enghadithText": " Aishah narrated that the Messenger of Allah (s.a.w) said:\r\nThe testimony of a treacherous man is not acceptable nor a treacherous woman nor a man lashed for the Hadd nor a woman lashed nor one possessing malice of enmity nor a rehearsed witness nor the Qani of (one contracted by)the family on their behalf nor the one associating himself to other than his Wala or to other than his relatives. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ يَزِيدَ بْنِ زِيَادٍ الدِّمَشْقِيِّ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    لَا تَجُوزُ شَهَادَةُ خَائِنٍ، ‏‏‏‏‏‏وَلَا خَائِنَةٍ، ‏‏‏‏‏‏وَلَا مَجْلُودٍ حَدًّا، ‏‏‏‏‏‏وَلَا مَجْلُودَةٍ، ‏‏‏‏‏‏وَلَا ذِي غِمْرٍ لِأَخِيهِ، ‏‏‏‏‏‏وَلَا مُجَرَّبِ شَهَادَةٍ، ‏‏‏‏‏‏وَلَا الْقَانِعِ أَهْلَ الْبَيْتِ لَهُمْ، ‏‏‏‏‏‏وَلَا ظَنِينٍ فِي وَلَاءٍ، ‏‏‏‏‏‏وَلَا قَرَابَةٍ   ، ‏‏‏‏‏‏قَالَ الْفَزَارِيُّ:‏‏‏‏ الْقَانِعُ التَّابِعُ، ‏‏‏‏‏‏هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَزِيدَ بْنِ زِيَادٍ الدِّمَشْقِيِّ، ‏‏‏‏‏‏وَيَزِيدُ يُضَعَّفُ فِي الْحَدِيثِ، ‏‏‏‏‏‏وَلَا يُعْرَفُ هَذَا الْحَدِيثُ مِنْ حَدِيثِ الزُّهْرِيِّ إِلَّا مِنْ حَدِيثِهِ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَلَا نَعْرِفُ مَعْنَى هَذَا الْحَدِيثِ، ‏‏‏‏‏‏وَلَا يَصِحُّ عِنْدِي مِنْ قِبَلِ إِسْنَادِهِ، ‏‏‏‏‏‏وَالْعَمَلُ عِنْدَ أَهْلِ الْعِلْمِ فِي هَذَا أَنَّ شَهَادَةَ الْقَرِيبِ جَائِزَةٌ لِقَرَابَتِهِ، ‏‏‏‏‏‏وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي شَهَادَةِ الْوَالِدِ لِلْوَلَدِ، ‏‏‏‏‏‏وَالْوَلَدِ لِوَالِدِهِ، ‏‏‏‏‏‏وَلَمْ يُجِزْ أَكْثَرُ أَهْلِ الْعِلْمِ شَهَادَةَ الْوَالِدِ لِلْوَلَدِ، ‏‏‏‏‏‏وَلَا الْوَلَدِ لِلْوَالِدِ، ‏‏‏‏‏‏وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ:‏‏‏‏ إِذَا كَانَ عَدْلًا، ‏‏‏‏‏‏فَشَهَادَةُ الْوَالِدِ لِلْوَلَدِ جَائِزَةٌ، ‏‏‏‏‏‏وَكَذَلِكَ شَهَادَةُ الْوَلَدِ لِلْوَالِدِ، ‏‏‏‏‏‏وَلَمْ يَخْتَلِفُوا فِي شَهَادَةِ الْأَخِ لِأَخِيهِ أَنَّهَا جَائِزَةٌ، ‏‏‏‏‏‏وَكَذَلِكَ شَهَادَةُ كُلِّ قَرِيبٍ لِقَرِيبِهِ، ‏‏‏‏‏‏وَقَالَ الشَّافِعِيُّ:‏‏‏‏ لَا تَجُوزُ شَهَادَةٌ لِرَجُلٍ عَلَى الْآخَرِ وَإِنْ كَانَ عَدْلًا إِذَا كَانَتْ بَيْنَهُمَا عَدَاوَةٌ، ‏‏‏‏‏‏وَذَهَبَ إِلَى حَدِيثِ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا، ‏‏‏‏‏‏لَا تَجُوزُ شَهَادَةُ صَاحِبِ إِحْنَةٍ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ صَاحِبَ عَدَاوَةٍ، ‏‏‏‏‏‏وَكَذَلِكَ مَعْنَى هَذَا الْحَدِيثِ حَيْثُ قَالَ:‏‏‏‏    لَا تَجُوزُ شَهَادَةُ صَاحِبِ غِمْرٍ لِأَخِيهِ   ، ‏‏‏‏‏‏يَعْنِي:‏‏‏‏ صَاحِبَ عَدَاوَةٍ."
    },
    "2299": {
        "bookNumber": 35,
        "bookName": "Chapters On Witnesses",
        "hadithNumber": 2299,
        "enghadithText": " Ayman bin Khuraim narrated that the Prophet (s.a.w) stood to give a Khutbah and said:\r\n  O you people False witness is tantamount to Shirk with Allah   Then the Messenger of Allah (s.a.w)recited: So shun the Rijs of the idols, and shun false speech. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ سُفْيَانَ بْنِ زِيَادٍ الْأَسَدِيِّ، عَنْ فَاتِكِ بْنِ فَضَالَةَ، عَنْ أَيْمَنَ بْنِ خُرَيْمٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ خَطِيبًا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا أَيُّهَا النَّاسُ، ‏‏‏‏‏‏   عَدِلَتْ شَهَادَةُ الزُّورِ إِشْرَاكًا بِاللَّهِ   ، ‏‏‏‏‏‏ثُمَّ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاجْتَنِبُوا الرِّجْسَ مِنَ الأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ سورة الحج آية 30، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ سُفْيَانَ بْنِ زِيَادٍ، ‏‏‏‏‏‏وَاخْتَلَفُوا فِي رِوَايَةِ هَذَا الْحَدِيثِ عَنْ سُفْيَانَ بْنِ زِيَادٍ، ‏‏‏‏‏‏وَلَا نَعْرِفُ لِأَيْمَنَ بْنِ خُرَيْمٍ سَمَاعًا مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
    },
    "2300": {
        "bookNumber": 35,
        "bookName": "Chapters On Witnesses",
        "hadithNumber": 2300,
        "enghadithText": " Khuraim bin Fatik Al-Asadi narrated that the Messenger of Allah (s.a.w) performed the Subh (Fajr)prayer. Then when he turned he got up to stand and said:\r\n  O you people! False witness is tantamount to Shirk with Allah.  Saying it three times, then he recited this Ayah And shun false speech Until the end of the Ayah. ",
        "Arabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، حَدَّثَنَا سُفْيَانُ وَهُوَ ابْنُ زِيَادٍ الْعُصْفُرِيُّ، عَنْ أَبِيهِ، عَنْ حَبِيبِ بْنِ النُّعْمَانِ الْأَسَدِيِّ، عَنْ خُرَيْمِ بْنِ فَاتِكٍ الْأَسَدِيِّ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةَ الصُّبْحِ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    عُدِلَتْ شَهَادَةُ الزُّورِ بِالشِّرْكِ بِاللَّهِ    ثَلَاثَ مَرَّاتٍ، ‏‏‏‏‏‏ثُمَّ تَلَا هَذِهِ الْآيَةَ وَاجْتَنِبُوا قَوْلَ الزُّورِ سورة الحج آية 30 إِلَى آخِرِ الْآيَةِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا عِنْدِي أَصَحُّ، ‏‏‏‏‏‏وَخُرَيْمُ بْنُ فَاتِكٍ لَهُ صُحْبَةٌ، ‏‏‏‏‏‏وَقَدْ رَوَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَادِيثَ وَهُوَ مَشْهُورٌ."
    },
    "2301": {
        "bookNumber": 35,
        "bookName": "Chapters On Witnesses",
        "hadithNumber": 2301,
        "enghadithText": " Abdur-Rahman bin Abi Bakrah narrated from his father that the Messenger of Allah (s.a.w) said:\r\n  Shall I not inform you of the greatest of the major sins?   They said:   Of course O Messenger of Allah(s.a.w)!   He said:   Shirk with Allah disobeying parents, and false testimony.   Or:   False speech   He said:   So the Messenger of Allah(s.a.w) would not stop saying it until we said ( to ourselves): 'I wish he would be quiet. ",
        "Arabic": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنِ الْجُرَيْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    أَلَا أُخْبِرُكُمْ بِأَكْبَرِ الْكَبَائِرِ ؟    قَالُوا:‏‏‏‏ بَلَى يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏    الْإِشْرَاكُ بِاللَّهِ، ‏‏‏‏‏‏وَعُقُوقُ الْوَالِدَيْنِ، ‏‏‏‏‏‏وَشَهَادَةُ الزُّورِ، ‏‏‏‏‏‏أَوْ قَوْلُ الزُّورِ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَا زَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُهَا حَتَّى قُلْنَا لَيْتَهُ سَكَتَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَفِي الْبَابِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو."
    },
    "2302": {
        "bookNumber": 35,
        "bookName": "Chapters On Witnesses",
        "hadithNumber": 2302,
        "enghadithText": " Imran bin Husain narrated that the Messenger of Allah(s.a.w)said:\r\n  The best of people are my generation, then those who follow them,then those who follow them, then those who follow them.  (He(s.a.w)said that) three times.   Then, after them a people will come who increase in fatness, loving fatness, giving testimony before they are asked for it. ",
        "Arabic": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الْأَعْمَشِ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، عَنْ هِلَالِ بْنِ يَسَافٍ، عَنْ عِمْرَانَ بْنِ حُصَيْنِ، قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    خَيْرُ النَّاسِ قَرْنِي، ‏‏‏‏‏‏ثُمَّ الَّذِينَ يَلُونَهُمْ، ‏‏‏‏‏‏ثُمَّ الَّذِينَ يَلُونَهُمْ، ‏‏‏‏‏‏ثُمَّ الَّذِينَ يَلُونَهُمْ ثَلَاثًا، ‏‏‏‏‏‏ثُمَّ يَجِيءُ قَوْمٌ مِنْ بَعْدِهِمْ يَتَسَمَّنُونَ وَيُحِبُّونَ السِّمَنَ يُعْطُونَ الشَّهَادَةَ قَبْلَ أَنْ يُسْأَلُوهَا   ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَهَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ عَلِيِّ بْنِ مُدْرِكٍ، ‏‏‏‏‏‏وَأَصْحَابُ الْأَعْمَشِ إِنَّمَا رَوَوْا عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ هِلَالِ بْنِ يَسَافٍ، ‏‏‏‏‏‏عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ."
    },
    "2303": {
        "bookNumber": 35,
        "bookName": "Chapters On Witnesses",
        "hadithNumber": 2303,
        "enghadithText": " Clarification of this is in the Hadith of 'Umar bin Al-Khattab, from the Prophet(s.a.w) who said:\r\n  The best of people are my generation, then those who follow them,then those who follow them. Then lying will spread, until a man testifies while his testimony was not requested, and a man will take an oath while an oath was not sought. ",
        "Arabic": "وَبَيَانُ هَذَا فِي حَدِيثِ عُمَرَ بْنِ الْخَطَّابِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    خَيْرُ النَّاسِ قَرْنِي، ‏‏‏‏‏‏ثُمَّ الَّذِينَ يَلُونَهُمْ، ‏‏‏‏‏‏ثُمَّ الَّذِينَ يَلُونَهُمْ، ‏‏‏‏‏‏ثُمَّ يَفْشُو الْكَذِبُ حَتَّى يَشْهَدَ الرَّجُلُ وَلَا يُسْتَشْهَدُ، ‏‏‏‏‏‏وَيَحْلِفُ الرَّجُلُ وَلَا يُسْتَحْلَفُ   ، ‏‏‏‏‏‏وَمَعْنَى حَدِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    خَيْرُ الشُّهَدَاءِ الَّذِي يَأْتِي بِشَهَادَتِهِ قَبْلَ أَنْ يُسْأَلَهَا    هُوَ عِنْدَنَا إِذَا أُشْهِدَ الرَّجُلُ عَلَى الشَّيْءِ أَنْ يُؤَدِّيَ شَهَادَتَهُ وَلَا يَمْتَنِعَ مِنَ الشَّهَادَةِ، ‏‏‏‏‏‏هَكَذَا وَجْهُ الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ."
    }
}