{
    "2645": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2645,
        "enghadithText": " Narrated Ibn 'Abbas:\r\nthat the Messenger of Allah (ﷺ) said:   For whomever Allah wants good, he gives him understanding in the religion. ",
        "Arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ أَبِيهِ، عَنْ ابْنِ عَبَّاسٍ، أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ   ،‏‏‏‏ وفي الباب عن عُمَرَ، ‏‏‏‏‏‏وَأَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَمُعَاوِيَةَ،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2646": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2646,
        "enghadithText": " Narrated Abu Hurairah:\r\nthat the Messenger of Allah (ﷺ) said:   Whoever takes a path upon which to obtain knowledge, Allah makes the path to Paradise easy for him. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ طَرِيقًا إِلَى الْجَنَّةِ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ."
    },
    "2647": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2647,
        "enghadithText": " Narrated Anas bin Malik:\r\nthat the Messenger of Allah (ﷺ) said:   Whoever goes out seeking knowledge, then he is in Allah's cause until he returns. ",
        "Arabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ:‏‏‏‏ حَدَّثَنَا خَالِدُ بْنُ يَزِيدَ الْعَتَكِيُّ، عَنْ أَبِي جَعْفَرٍ الرَّازِيِّ، عَنْ الرَّبِيعِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَنْ خَرَجَ فِي طَلَبِ الْعِلْمِ فَهُوَ فِي سَبِيلِ اللَّهِ حَتَّى يَرْجِعَ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَرَوَاهُ بَعْضُهُمْ فَلَمْ يَرْفَعْهُ."
    },
    "2648": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2648,
        "enghadithText": " Narrated 'Abdullah bin Sakhbarah:\r\nnarrated that the Prophet (ﷺ) said:   Whoever seeks knowledge, he is atoning for what has passed (of sins while doing so). ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُعَلَّى، حَدَّثَنَا زِيَادُ بْنُ خَيْثَمَةَ، عَنْ أَبِي دَاوُدَ، عَنْ عَبْدِ اللَّهِ بْنِ سَخْبَرَةَ، عَنْ سَخْبَرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    مَنْ طَلَبَ الْعِلْمَ كَانَ كَفَّارَةً لِمَا مَضَى   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ ضَعِيفُ الْإِسْنَادِ، ‏‏‏‏‏‏أَبُو دَاوُدَ يُضَعَّفُ فِي الْحَدِيثِ، ‏‏‏‏‏‏وَلَا نَعْرِفُ لِعَبْدِ اللَّهِ بْنِ سَخْبَرَةَ كَبِيرَ شَيْءٍ وَلَا لِأَبِيهِ، ‏‏‏‏‏‏وَاسْمُ أَبِي دَاوُدَ:‏‏‏‏ نُفَيْعٌ الْأَعْمَى تَكَلَّمَ فِيهِ قَتَادَةُ وَغَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ."
    },
    "2649": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2649,
        "enghadithText": " Narrated Abu Hurairah:\r\nthat the Messenger of Allah (ﷺ) said:   Whoever is asked about some knowledge that he knows, then he conceals it, he will be bridled with bridle of fire. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ بُدَيْلِ بْنِ قُرَيْشٍ الْيَامِيُّ الْكُوفِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُمَارَةَ بْنِ زَاذَانَ، عَنْ عَلِيِّ بْنِ الْحَكَمِ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَنْ سُئِلَ عَنْ عِلْمٍ عَلِمَهُ ثُمَّ كَتَمَهُ أُلْجِمَ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنْ نَارٍ   ،‏‏‏‏ وفي الباب عن جَابِرٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ."
    },
    "2650": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2650,
        "enghadithText": " Narrated Abu Harun [Al-'Abdi]:\r\n  We went to Abu Sa'eed and he said: 'Welcome with the exhortation of the Messenger of Allah (ﷺ). Indeed the Prophet (ﷺ) said:   Surely, the people are followers of you, and men will certainly come to you from the regions of the earth to gain understanding in the religion. So when they come to you exhort them with good. ",
        "Arabic": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عَنْ سُفْيَانَ، عَنْ أَبِي هَارُونَ الْعَبْدِيِّ، قَالَ:‏‏‏‏ كُنَّا نَأْتِي أَبَا سَعِيدٍ فَيَقُولُ:‏‏‏‏ مَرْحَبًا بِوَصِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    إِنَّ النَّاسَ لَكُمْ تَبَعٌ وَإِنَّ رِجَالًا يَأْتُونَكُمْ مِنْ أَقْطَارِ الْأَرَضِينَ يَتَفَقَّهُونَ فِي الدِّينِ فَإِذَا أَتَوْكُمْ فَاسْتَوْصُوا بِهِمْ خَيْرًا   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ قَالَ عَلِيُّ بْنُ عَبْدِ اللَّهِ:‏‏‏‏ قَالَ يَحْيَى بْنُ سَعِيدٍ:‏‏‏‏ كَانَ شُعْبَةُ يُضَعِّفُ أَبَا هَارُونَ الْعَبْدِيَّ، ‏‏‏‏‏‏قَالَ يَحْيَى بْنُ سَعِيدٍ:‏‏‏‏ مَا زَالَ ابْنُ عَوْنٍ يَرْوِي، ‏‏‏‏‏‏عَنْ أَبِي هَارُونَ الْعَبْدِيِّ حَتَّى مَاتَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَأَبُو هَارُونَ اسْمُهُ:‏‏‏‏ عُمَارَةُ بْنُ جُوَيْنٍ."
    },
    "2651": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2651,
        "enghadithText": " Narrated Abu Harun [Al-'Abdi]:\r\nfrom Abu Sa'eed Al-Khudri that the Prophet (ﷺ) said:   Men will come to you from the direction of the east to learn. So when they come to you then exhort them to good.   He said:   When Abu Sa'eed saw us he would say: 'Welcome with the exhortation of the Messenger of Allah, may the peace and blessings of Allah be upon him and his family.' ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا نُوحُ بْنُ قَيْسٍ، عَنْ أَبِي هَارُونَ الْعَبْدِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    يَأْتِيكُمْ رِجَالٌ مِنْ قِبَلِ الْمَشْرِقِ يَتَعَلَّمُونَ، ‏‏‏‏‏‏فَإِذَا جَاءُوكُمْ فَاسْتَوْصُوا بِهِمْ خَيْرًا   ،‏‏‏‏ قَالَ:‏‏‏‏ فَكَانَ أَبُو سَعِيدٍ إِذَا رَآنَا قَالَ:‏‏‏‏ مَرْحَبًا بِوَصِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ قَالَ:‏‏‏‏ هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ أَبِي هَارُونَ،‏‏‏‏ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ."
    },
    "2652": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2652,
        "enghadithText": " Narrated 'Abdullah bin 'Amr bin Al-'As:\r\nthat the Messenger of Allah (ﷺ) said:   Indeed Allah does not take away knowledge by removing it from the people, but He takes away knowledge by taking the scholars, until there remains no scholar and the people begin to ask the ignorant leaders, so they give their verdict without knowledge. They will go astray and lead the people astray. ",
        "Arabic": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَاق الْهَمْدَانِيُّ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    إِنَّ اللَّهَ لَا يَقْبِضُ الْعِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنَ النَّاسِ، ‏‏‏‏‏‏وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ، ‏‏‏‏‏‏حَتَّى إِذَا لَمْ يَتْرُكْ عَالِمًا اتَّخَذَ النَّاسُ رُءُوسًا جُهَّالًا، ‏‏‏‏‏‏فَسُئِلُوا فَأَفْتَوْا بِغَيْرِ عِلْمٍ فَضَلُّوا وَأَضَلُّوا   ،‏‏‏‏ وفي الباب عن عَائِشَةَ، ‏‏‏‏‏‏وَزِيَادِ بْنِ لَبِيدٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَى هَذَا الْحَدِيثَ الزُّهْرِيُّ، عَنْ عُرْوَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، وَعَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ هَذَا."
    },
    "2653": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2653,
        "enghadithText": " Narrated Jubair bin Nufair:\r\nfrom Abu Ad-Darda who said:   We were with the Prophet (ﷺ) when he raised his sight to the sky, then he said: 'This is the time when knowledge is to be taken from the people, until what remains of it shall not amount to anything.   So Ziyad bin Labid Al-Ansari said: 'How will it be taken from us while we recite the Qur'an. By Allah we recite it, and our women and children recite it?' He (ﷺ) said: 'May you be bereaved of your mother O Ziyad! I used to consider you among the Fuqaha of the people of Al-Madinah. The Tawrah and Injil are with the Jews and Christians, but what do they avail of them?'   Jubair said:   So I met 'Ubadah bin As-Samit and said to him: 'Have you not heard what your brother Abu Ad-Darda said?' Then I informed him of what Abu Ad-Darda said. He said: 'Abu Ad-Darda spoke the truth. If you wish, we shall narrated to you about the first knowledge to be removed from the people: It is Khushu', soon you will enter the congregational Masjid, but not see any man in it with Khushu'.' ",
        "Arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ، حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ:‏‏‏‏ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَشَخَصَ بِبَصَرِهِ إِلَى السَّمَاءِ ثُمَّ قَالَ:‏‏‏‏    هَذَا أَوَانُ يُخْتَلَسُ الْعِلْمُ مِنَ النَّاسِ حَتَّى لَا يَقْدِرُوا مِنْهُ عَلَى شَيْءٍ   ، ‏‏‏‏‏‏فَقَالَ زِيَادُ بْنُ لَبِيدٍ الْأَنْصَارِيُّ:‏‏‏‏ كَيْفَ يُخْتَلَسُ مِنَّا وَقَدْ قَرَأْنَا الْقُرْآنَ ؟ فَوَاللَّهِ لَنَقْرَأَنَّهُ، ‏‏‏‏‏‏وَلَنُقْرِئَنَّهُ نِسَاءَنَا، ‏‏‏‏‏‏وَأَبْنَاءَنَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    ثَكِلَتْكَ أُمُّكَ يَا زِيَادُ إِنْ كُنْتُ لَأَعُدُّكَ مِنْ فُقَهَاءِ أَهْلِ الْمَدِينَةِ، ‏‏‏‏‏‏هَذِهِ التَّوْرَاةُ وَالْإِنْجِيلُ عِنْدَ الْيَهُودِ،‏‏‏‏ وَالنَّصَارَى فَمَاذَا تُغْنِي عَنْهُمْ   ،‏‏‏‏ قَالَ جُبَيْرٌ:‏‏‏‏ فَلَقِيتُ عُبَادَةَ بْنَ الصَّامِتِ، قُلْتُ:‏‏‏‏ أَلَا تَسْمَعُ إِلَى مَا يَقُولُ أَخُوكَ أَبُو الدَّرْدَاءِ ؟ فَأَخْبَرْتُهُ بِالَّذِي قَالَ أَبُو الدَّرْدَاءِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏    صَدَقَ أَبُو الدَّرْدَاءِ إِنْ شِئْتَ لَأُحَدِّثَنَّكَ بِأَوَّلِ عِلْمٍ يُرْفَعُ مِنَ النَّاسِ الْخُشُوعُ يُوشِكُ أَنْ تَدْخُلَ مَسْجِدَ جَمَاعَةٍ فَلَا تَرَى فِيهِ رَجُلًا خَاشِعًا   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏وَمُعَاوِيَةُ بْنُ صَالِحٍ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ، ‏‏‏‏‏‏وَلَا نَعْلَمُ أَحَدًا تَكَلَّمَ فِيهِ غَيْرَ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ نَحْوُ هَذَا، ‏‏‏‏‏‏وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ عَوْفِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
    },
    "2654": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2654,
        "enghadithText": " Narrated Ibn Ka'b bin Malik:\r\nfrom his father that he heard the Messenger of Allah (ﷺ) saying:   Whoever seeks knowledge to contend with the scholars, or to use it to argue with the fools, and to have people's faces turn towards him, then he shall be admitted to the Fire. ",
        "Arabic": "حَدَّثَنَا أَبُو الْأَشْعَثِ أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ الْبَصْرِيُّ، حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ، حَدَّثَنَا إِسْحَاق بْنُ يَحْيَى بْنِ طَلْحَةَ، حَدَّثَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    مَنْ طَلَبَ الْعِلْمَ لِيُجَارِيَ بِهِ الْعُلَمَاءَ، ‏‏‏‏‏‏أَوْ لِيُمَارِيَ بِهِ السُّفَهَاءَ، ‏‏‏‏‏‏أَوْ يَصْرِفَ بِهِ وُجُوهَ النَّاسِ إِلَيْهِ أَدْخَلَهُ اللَّهُ النَّارَ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَإِسْحَاق بْنُ يَحْيَى بْنِ طَلْحَةَ لَيْسَ بِذَاكَ الْقَوِيِّ عِنْدَهُمْ، ‏‏‏‏‏‏تُكُلِّمَ فِيهِ مِنْ قِبَلِ حِفْظِهِ."
    },
    "2655": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2655,
        "enghadithText": " Narrated Ibn 'Umar:\r\nthat the Prophet (ﷺ) said:   Whoever learns knowledge for other than (the sake of) Allah, or intends by it other than Allah, then let him take his seat in the Fire. ",
        "Arabic": "حَدَّثَنَا عَلِيُّ بْنُ نَصْرِ بْنِ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ الْهُنَائِيُّ، حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ خَالِدِ بْنِ دُرَيْكٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    مَنْ تَعَلَّمَ عِلْمًا لِغَيْرِ اللَّهِ أَوْ أَرَادَ بِهِ غَيْرَ اللَّهِ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ   ،‏‏‏‏ وفي الباب عن جَابِرٍ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ مِنْ حَدِيثِ أَيُّوبَ إِلَّا مِنْ هَذَا الْوَجْهِ."
    },
    "2656": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2656,
        "enghadithText": " Narrated 'Abdur-Rahman bin Aban bin 'Uthman:\r\nfrom his father who said:   Zaid bin Thabit left to go to Marwan during the middle of the day. We said: 'He did not send for him [during] this hour except to ask him about something.' So we got up to ask him, and he said: 'Yes, he asked us about something we heard from the Messenger of Allah (ﷺ). I heard the Messenger of Allah (ﷺ) saying:   May Allah gladden a man who hears a Hadith from us, so he memorizes it until he conveys it to someone else. Perhaps he carries Fiqh to one who is more understanding than him, and perhaps the one who carries the Fiqh is not a Faqih. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، أَخْبَرَنَا شُعْبَةُ، أَخْبَرَنَا عُمَرُ بْنُ سُلَيْمَانَ مِنْ وَلَدِ عُمَرَ بْنِ الْخَطَّابِ، ‏‏‏‏‏‏قَال:‏‏‏‏ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبَانَ بْنِ عُثْمَانَ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَبِيهِ، قَالَ:‏‏‏‏ خَرَجَ زَيْدُ بْنُ ثَابِتٍ مِنْ عِنْدِ مَرْوَانَ نِصْفَ النَّهَارِ، ‏‏‏‏‏‏قُلْنَا:‏‏‏‏ مَا بَعَثَ إِلَيْهِ فِي هَذِهِ السَّاعَةِ إِلَّا لِشَيْءٍ سَأَلَهُ عَنْهُ ؟ فَسَأَلْنَاهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ نَعَمْ سَأَلَنَا عَنْ أَشْيَاءَ سَمِعْنَاهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    نَضَّرَ اللَّهُ امْرَأً سَمِعَ مِنَّا حَدِيثًا فَحَفِظَهُ حَتَّى يُبَلِّغَهُ غَيْرَهُ، ‏‏‏‏‏‏فَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ، ‏‏‏‏‏‏وَرُبَّ حَامِلِ فِقْهٍ لَيْسَ بِفَقِيهٍ   ،‏‏‏‏ وفي الباب عن عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَمُعَاذِ بْنِ جَبَلٍ، ‏‏‏‏‏‏وَجُبَيْرِ بْنِ مُطْعِمٍ، ‏‏‏‏‏‏وَأَبِي الدَّرْدَاءِ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ زَيْدِ بْنِ ثَابِتٍ حَدِيثٌ حَسَنٌ."
    },
    "2657": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2657,
        "enghadithText": " Narrated Simak bin Hard:\r\n  I heard 'Abdur-Rahman bin 'Abdullah bin Mas'ud narrating from his father who said: 'I heard the Messenger of Allah (ﷺ) saying: 'May Allah gladden a man who hears something from us, so he conveys it as he heard it. Perhaps the one it is conveyed to is more understanding than the one who heard it.' ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، أَنْبَأَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَال:‏‏‏‏ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَبِيهِ، قَالَ:‏‏‏‏ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    نَضَّرَ اللَّهُ امْرَأً سَمِعَ مِنَّا شَيْئًا فَبَلَّغَهُ كَمَا سَمِعَ فَرُبَّ مُبَلِّغٍ أَوْعَى مِنْ سَامِعٍ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَاهُ عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ."
    },
    "2658": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2658,
        "enghadithText": " Narrated 'Abdul-Malik bin 'Umair:\r\nfrom 'Abdur-Rahman bin 'Abdullah bin Mas'ud that he narrated from his father, from the Prophet (ﷺ) who said:   May Allah beautify a man who hears a saying of mine, so he understands it, remembers it, and conveys it. Perhaps he carries the Fiqh to one who has more understanding than him. There are three with which the heart of a Muslim shall not be deceived. Sincerity in deeds for Allah, giving Nasihah to the A'immah of Muslims, and sticking to the Jama'ah. For indeed the call is protected from behind them. ",
        "Arabic": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ يُحَدِّثُ،‏‏‏‏ عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    نَضَّرَ اللَّهُ امْرَأً سَمِعَ مَقَالَتِي فَوَعَاهَا وَحَفِظَهَا وَبَلَّغَهَا فَرُبَّ حَامِلِ فِقْهٍ إِلَى مَنْ هُوَ أَفْقَهُ مِنْهُ، ‏‏‏‏‏‏ثَلَاثٌ لَا يُغِلُّ عَلَيْهِنَّ قَلْبُ مُسْلِمٍ:‏‏‏‏ إِخْلَاصُ الْعَمَلِ لِلَّهِ، ‏‏‏‏‏‏وَمُنَاصَحَةُ أَئِمَّةِ الْمُسْلِمِينَ، ‏‏‏‏‏‏وَلُزُومُ جَمَاعَتِهِمْ، ‏‏‏‏‏‏فَإِنَّ الدَّعْوَةَ تُحِيطُ مِنْ وَرَائِهِمْ   ."
    },
    "2659": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2659,
        "enghadithText": " Narrated 'Abdullah [bin Mas'ud]:\r\nthat the Messenger of Allah (ﷺ) said:   Whoever lies upon me, then let him take his seat in the Fire. ",
        "Arabic": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، حَدَّثَنَا عَاصِمٌ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ   ."
    },
    "2660": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2660,
        "enghadithText": " Narrated 'Ali bin Abi Talib:\r\nthat the Messenger of Allah (ﷺ) said:   Do not lie upon me, for indeed whoever lies upon me, he will be admitted into the Fire. ",
        "Arabic": "حَدَّثَنَا إِسْمَاعِيل بْنُ مُوسَى الْفَزَارِيُّ ابْنُ بِنْتِ السُّدِّيِّ، حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ، عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    لَا تَكْذِبُوا عَلَيَّ، ‏‏‏‏‏‏فَإِنَّهُ مَنْ كَذَبَ عَلَيَّ يَلِجُ فِي النَّارِ   ،‏‏‏‏ وفي الباب عن أَبِي بَكْرٍ، ‏‏‏‏‏‏وَعُمَرَ، ‏‏‏‏‏‏وَعُثْمَانَ، ‏‏‏‏‏‏وَالزُّبَيْرِ، ‏‏‏‏‏‏وَسَعِيدِ بْنِ زَيْدٍ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَجَابِرٍ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَبِي سَعِيدٍ، ‏‏‏‏‏‏وَعَمْرِو بْنِ عَبَسَةَ، ‏‏‏‏‏‏وَعُقْبَةَ بْنِ عَامِرٍ، ‏‏‏‏‏‏وَمُعَاوِيَةَ، ‏‏‏‏‏‏وَبُرَيْدَةَ، ‏‏‏‏‏‏وَأَبِي مُوسَى الْغَافِقِيِّ، ‏‏‏‏‏‏وَأَبِي أُمَامَةَ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏وَالْمُنْقَعِ، ‏‏‏‏‏‏وَأَوْسٍ الثَّقَفِيِّ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏قَالَ عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ مَنْصُورُ بْنُ الْمُعْتَمِرِ، ‏‏‏‏‏‏أَثْبَتُ أَهْلِ الْكُوفَةِ، ‏‏‏‏‏‏وَقَالَ وَكِيعٌ:‏‏‏‏ لَمْ يَكْذِبْ رِبْعِيُّ بْنُ حِرَاشٍ فِي الْإِسْلَامِ كَذْبَةً."
    },
    "2661": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2661,
        "enghadithText": " Narrated Anas bin Malik:\r\nthat the Messenger of Allah (ﷺ) said:   Whoever lies upon me   - I think he said -   purposely, then let him take his seat in the Fire. ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَنْ كَذَبَ عَلَيَّ حَسِبْتُ أَنَّهُ قَالَ:‏‏‏‏ مُتَعَمِّدًا فَلْيَتَبَوَّأْ بَيْتَهُ مِنَ النَّارِ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَنَسٍ، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ أَنَسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
    },
    "2662": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2662,
        "enghadithText": " Narrated Al-Mughirah bin Shu'bah:\r\nthat the Prophet (ﷺ) said:   Whoever narrates a Hadith from me which he knows is a lie, then he is one of the liars. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    مَنْ حَدَّثَ عَنِّي حَدِيثًا وَهُوَ يَرَى أَنَّهُ كَذِبٌ فَهُوَ أَحَدُ الْكَاذِبِينَ   ،‏‏‏‏ وفي الباب عن عَلِيِّ بْنِ أَبِي طَالِبٍ، ‏‏‏‏‏‏وَسَمُرَةَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى شُعْبَةُ، عَنْ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ سَمُرَةَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا الْحَدِيثَ. وَرَوَى الْأَعْمَشُ، وَابْنُ أَبِي لَيْلَى، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَكَأَنَّ حَدِيثَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، ‏‏‏‏‏‏عَنْ سَمُرَةَ عِنْدَ أَهْلِ الْحَدِيثِ أَصَحُّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَأَلْتُ أَبَا مُحَمَّدٍ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ، ‏‏‏‏‏‏عَنْ حَدِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَنْ حَدَّثَ عَنِّي حَدِيثًا وَهُوَ يَرَى أَنَّهُ كَذِبٌ فَهُوَ أَحَدُ الْكَاذِبِينَ   ، ‏‏‏‏‏‏قُلْتُ لَهُ:‏‏‏‏ مَنْ رَوَى حَدِيثًا وَهُوَ يَعْلَمُ أَنَّ إِسْنَادَهُ خَطَأٌ أَيُخَافُ أَنْ يَكُونَ قَدْ دَخَلَ فِي حَدِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ؟ أَوْ إِذَا رَوَى النَّاسُ حَدِيثًا مُرْسَلًا فَأَسْنَدَهُ بَعْضُهُمْ أَوْ قَلَبَ إِسْنَادَهُ يَكُونُ قَدْ دَخَلَ فِي هَذَا الْحَدِيثِ ؟ فَقَالَ:‏‏‏‏ لَا إِنَّمَا مَعْنَى هَذَا الْحَدِيثِ إِذَا رَوَى الرَّجُلُ حَدِيثًا وَلَا يُعْرَفُ لِذَلِكَ الْحَدِيثِ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصْلٌ فَحَدَّثَ بِهِ فَأَخَافُ أَنْ يَكُونَ قَدْ دَخَلَ فِي هَذَا الْحَدِيثِ."
    },
    "2663": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2663,
        "enghadithText": " Narrated 'Ubaidullah bin Abu Rafi:\r\nfrom Abu Rafi' and others, from the Prophet (ﷺ) who said:   Let me not find one of you reclining on his couch when a command I ordered, or a prohibition from me comes to him, and he says: 'I do not know. What we find in the Book of Allah, we follow it.' ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، وَسَالِمٍ أبي النضر،‏‏‏‏ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ أَبِي رَافِعٍ وَغَيْرِهِ، ‏‏‏‏‏‏رَفَعَهُ قَالَ:‏‏‏‏    لَا أُلْفِيَنَّ أَحَدَكُمْ مُتَّكِئًا عَلَى أَرِيكَتِهِ يَأْتِيهِ أَمْرٌ مِمَّا أَمَرْتُ بِهِ أَوْ نَهَيْتُ عَنْهُ فَيَقُولُ:‏‏‏‏ لَا أَدْرِي مَا وَجَدْنَا فِي كِتَابِ اللَّهِ اتَّبَعْنَاهُ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَرَوَى بَعْضُهُمْ عَنْ سُفْيَانَ، عَنِ ابْنِ الْمُنْكَدِرِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا، ‏‏‏‏‏‏وَسَالِمٍ أَبِي النَّضْرِ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَكَانَ ابْنُ عُيَيْنَةَ إِذَا رَوَى هَذَا الْحَدِيثَ عَلَى الِانْفِرَادِ، ‏‏‏‏‏‏بَيَّنَ حَدِيثَ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، ‏‏‏‏‏‏مِنْ حَدِيثِ سَالِمٍ أَبِي النَّضْرِ، ‏‏‏‏‏‏وَإِذَا جَمَعَهُمَا رَوَى هَكَذَا، ‏‏‏‏‏‏وَأَبُو رَافِعٍ مَوْلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْمُهُ:‏‏‏‏ أَسْلَمُ."
    },
    "2664": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2664,
        "enghadithText": " Narrated Al-Miqdam bin Ma'dikarib:\r\nthat the Messenger of Allah (ﷺ) said:   Lo! Soon a Hadith from me will be conveyed to a man, while he is reclining on his couch, and he says: 'Between us and you is Allah's Book. So whatever we find in it that is lawful, we consider lawful, and whatever we find in it that is unlawful, we consider it unlawful.' Indeed whatever the Messenger of Allah (ﷺ) made unlawful, it is the same as what Allah made unlawful. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنِ الْحَسَنِ بْنِ جَابِرٍ اللَّخْمِيِّ، عَنِ الْمِقْدَامِ بْنِ مَعْدِ يكَرِبَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    أَلَا هَلْ عَسَى رَجُلٌ يَبْلُغُهُ الْحَدِيثُ عَنِّي وَهُوَ مُتَّكِئٌ عَلَى أَرِيكَتِهِ فَيَقُولُ بَيْنَنَا وَبَيْنَكُمْ كِتَابُ اللَّهِ فَمَا وَجَدْنَا فِيهِ حَلَالًا اسْتَحْلَلْنَاهُ وَمَا وَجَدْنَا فِيهِ حَرَامًا حَرَّمْنَاهُ وَإِنَّ مَا حَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا حَرَّمَ اللَّهُ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ."
    },
    "2665": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2665,
        "enghadithText": " Narrated Abu Sa'eed Al-Khudri:\r\n  We sought permission from the Messenger of Allah (ﷺ) for writing but he did not permit us. ",
        "Arabic": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ:‏‏‏‏    اسْتَأْذَنَّا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْكِتَابَةِ فَلَمْ يَأْذَنْ لَنَا   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ أَيْضًا عَنْ زَيْدِ بْنِ أَسْلَمَ، ‏‏‏‏‏‏رَوَاهُ هَمَّامٌ،‏‏‏‏ عَنْ زَيْدِ بْنِ أَسْلَمَ."
    },
    "2666": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2666,
        "enghadithText": " Narrated Abu Hurairah:\r\n  There was a man among the Ansar who would sit with the Messenger of Allah (ﷺ), and he would listen to the Ahadith of the Prophet (ﷺ) and he was amazed with them but he could not remember them. So he complained about that to the Messenger of Allah (ﷺ). He said: 'O Messenger of Allah! I listen to your Ahadith and I am amazed but I can not remember them.' So the Messenger of Allah (ﷺ) said: 'Help yourself with your right hand' and he motioned with his hand as if writing.' ",
        "Arabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ الْخَلِيلِ بْنِ مُرَّةَ، عَنْ يَحْيَى بْنِ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ كَانَ رَجُلٌ مِنَ الْأَنْصَارِ يَجْلِسُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَسْمَعُ مِنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَدِيثَ، ‏‏‏‏‏‏فَيُعْجِبُهُ وَلَا يَحْفَظُهُ، ‏‏‏‏‏‏فَشَكَا ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنِّي أَسْمَعُ مِنْكَ الْحَدِيثَ فَيُعْجِبُنِي وَلَا أَحْفَظُهُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    اسْتَعِنْ بِيَمِينِكَ وَأَوْمَأَ بِيَدِهِ لِلْخَطِّ   ،‏‏‏‏ وفي الباب عن عَبْدِ اللَّهِ بْنِ عَمْرٍو، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ إِسْنَادُهُ لَيْسَ بِذَلِكَ الْقَائِمِ، ‏‏‏‏‏‏وَسَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيل يَقُولُ:‏‏‏‏ الْخَلِيلُ بْنُ مُرَّةَ مُنْكَرُ الْحَدِيثِ."
    },
    "2667": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2667,
        "enghadithText": " Narrated Abu Hurairah:\r\nThat the Messenger of Allah (ﷺ) gave an address. So he mentioned a story in the Hadith, and Abu Shah said: 'Have it written for me O Messenger of Allah! So the Messenger of Allah (ﷺ) said: 'Write it for Abu Shah.' ",
        "Arabic": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى، وَمَحْمُودُ بْنُ غَيْلَانَ،‏‏‏‏ قَالَا:‏‏‏‏ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الْأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ فَذَكَرَ الْقِصَّةَ فِي الْحَدِيثِ، ‏‏‏‏‏‏قَالَ أَبُو شَاهٍ:‏‏‏‏ اكْتُبُوا لِي يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    اكْتُبُوا لِأَبِي شَاهٍ   ،‏‏‏‏ وَفِي الْحَدِيثِ قِصَّةٌ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رَوَى شَيْبَانُ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ مِثْلَ هَذَا."
    },
    "2668": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2668,
        "enghadithText": " Narrated Hammam bin Munabbih:\r\nthat the heard Abu Hurairah say:   None of the Companions of the Messenger of Allah (ﷺ) narrated more Ahadith from him than me, except 'Abdullah bin 'Amr. For he used to write them down and I did not write ",
        "Arabic": "حَدَّثَنَا حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ وَهْبِ بْنِ مُنَبِّهٍ، عَنْ أَخِيهِ وَهُوَ هَمَّامُ بْنُ مُنَبِّهٍ، قَال:‏‏‏‏ سَمِعْتُ أَبَا هُرَيْرَةَ،‏‏‏‏ يَقُولُ:‏‏‏‏    لَيْسَ أَحَدٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرَ حَدِيثًا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنِّي إِلَّا عَبْدَ اللَّهِ بْنَ عَمْرٍو، ‏‏‏‏‏‏فَإِنَّهُ كَانَ يَكْتُبُ وَكُنْتُ لَا أَكْتُبُ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَوَهْبُ بْنُ مُنَبِّهٍ عَنْ أَخِيهِ هُوَ هَمَّامُ بْنُ مُنَبِّهٍ."
    },
    "2669": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2669,
        "enghadithText": " Narrated 'Abdullah bin 'Amr:\r\nthat the Messenger of Allah (ﷺ) said:   Convey from me, even if it be an Ayah, and narrate from the Children of Isra'il, and there is no harm, And whoever lies upon me purposely, then let him take his seat in the Fire. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنِ ابْنِ ثَوْبَانَ هُوَ عَبْدُ الرَّحْمَنِ بْنُ ثَابِتِ بْنِ ثَوْبَانَ، عَنْ حَسَّانَ بْنِ عَطِيَّةَ، عَنْ أَبِي كَبْشَةَ السَّلُولِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    بَلِّغُوا عَنِّي وَلَوْ آيَةً، ‏‏‏‏‏‏وَحَدِّثُوا عَنْ بَنِي إِسْرَائِيلَ وَلَا حَرَجَ، ‏‏‏‏‏‏وَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2670": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2670,
        "enghadithText": " Narrated Anas bin Malik:\r\n  A man came to the Prophet (ﷺ) to get a mount, but he (ﷺ) did not have anything to mount him on with him. So he was lead to another person to give him a mount. He came to the Prophet (ﷺ) to inform him about that and he said: 'Whoever leads to good, he is like the one who does it.' ",
        "Arabic": "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ، حَدَّثَنَا أَحْمَدُ بْنُ بَشِيرٍ، عَنْ شَبِيبِ بْنِ بِشْرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ:‏‏‏‏ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ يَسْتَحْمِلُهُ فَلَمْ يَجِدْ عِنْدَهُ مَا يَتَحَمَّلُهُ، ‏‏‏‏‏‏فَدَلَّهُ عَلَى آخَرَ فَحَمَلَهُ، ‏‏‏‏‏‏فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏    إِنَّ الدَّالَّ عَلَى الْخَيْرِ كَفَاعِلِهِ   ،‏‏‏‏ وفي الباب عن أَبِي مَسْعُودٍ الْبَدْرِيِّ، ‏‏‏‏‏‏وَبُرَيْدَةَ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَنَسٍ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
    },
    "2671": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2671,
        "enghadithText": " Narrated Abu Mas'ud Al-Badri:\r\nthat a man came to the Prophet (ﷺ) looking for a mount, he said: 'Mine has been ruined.' So the Messenger of Allah (ﷺ) said: 'Go to so-and-so.' So he went to him and he gave him a mount. The Messenger of Allah (ﷺ) said: 'Whoever leads to good, then for him is the same reward as the one who does it - or - who acts upon it.' ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا أَبُو دَاوُدَ، أَنْبَأَنَا شُعْبَةُ، عَنِ الْأَعْمَشِ، قَال:‏‏‏‏ سَمِعْتُ أَبَا عَمْرٍو الشَّيْبَانِيَّ يُحَدِّثُ، ‏‏‏‏‏‏عَنْ أَبِي مَسْعُودٍ الْبَدْرِيِّ، أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَحْمِلُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّهُ قَدْ أُبْدِعَ بِي، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    ائْتِ فُلَانًا   ،‏‏‏‏ فَأَتَاهُ فَحَمَلَهُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَنْ دَلَّ عَلَى خَيْرٍ فَلَهُ مِثْلُ أَجْرِ فَاعِلِهِ    أَوْ قَالَ:‏‏‏‏    عَامِلِهِ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو عَمْرٍو الشَّيْبَانِيُّ اسْمُهُ:‏‏‏‏ سَعْدُ بْنُ إِيَاسٍ، ‏‏‏‏‏‏وَأَبُو مَسْعُودٍ الْبَدْرِيُّ اسْمُهُ:‏‏‏‏ عُقْبَةُ بْنُ عَمْرٍو."
    },
    "2672": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2672,
        "enghadithText": " Narrated Abu Musa Al-Ash'ari:\r\nthat the Prophet (ﷺ) said:   Intercede, and you will be rewarded, and Allah will fulfill what He wills upon the tongue of His Prophet. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، وَالْحَسَنُ بْنُ عَلِيٍّ،‏‏‏‏ وَغَيْرُ وَاحِدٍ قَالُوا:‏‏‏‏ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    اشْفَعُوا وَلْتُؤْجَرُوا وَلْيَقْضِ اللَّهُ عَلَى لِسَانِ نَبِيِّهِ مَا شَاءَ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَبُرَيْدٌ يُكْنَى:‏‏‏‏ أَبَا بُرْدَةَ أَيْضًا هُوَ ابْنُ أَبِي مُوسَى الْأَشْعَرِيِّ وَهُوَ كُوفِيٌّ ثِقَةٌ فِي الْحَدِيثِ رَوَى عَنْهُ شُعْبَةُ، ‏‏‏‏‏‏وَالثَّوْرِيُّ، ‏‏‏‏‏‏وَابْنُ عُيَيْنَةَ."
    },
    "2673": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2673,
        "enghadithText": " Narrated 'Abdullah bin Mas'ud:\r\nthat the Messenger of Allah (ﷺ) said:   No soul is wrongfully taken except that some of the burden of its blood is upon the son of Adam, because he was the first to institute murder. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ، حَدَّثَنَا وَكِيعٌ، وَعَبْدُ الرَّزَّاقِ،‏‏‏‏ عَنْ سُفْيَانَ، عَنِ الْأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَا مِنْ نَفْسٍ تُقْتَلُ ظُلْمًا، ‏‏‏‏‏‏إِلَّا كَانَ عَلَى ابْنِ آدَمَ كِفْلٌ مِنْ دَمِهَا، ‏‏‏‏‏‏وَذَلِكَ لِأَنَّهُ أَوَّلُ مَنْ أَسَنَّ الْقَتْلَ   ، ‏‏‏‏‏‏وَقَالَ عَبْدُ الرَّزَّاقِ:‏‏‏‏    سَنَّ الْقَتْلَ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2674": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2674,
        "enghadithText": " Narrated Abu Hurairah:\r\nthat the Messenger of Allah (ﷺ) said:   Whoever calls to guidance, then he receives the reward similar to the reward of whoever follows him, without that diminishing anything from their rewards. And whoever calls to misguidance, then he receives of sin similar to the sins of those who followed him, without that diminishing anything from their sins. ",
        "Arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيل بْنُ جَعْفَرٍ،‏‏‏‏ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ،‏‏‏‏ عَنْ أَبِيهِ،‏‏‏‏ عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَنْ دَعَا إِلَى هُدًى كَانَ لَهُ مِنَ الْأَجْرِ مِثْلُ أُجُورِ مَنْ يَتَّبِعُهُ لَا يَنْقُصُ ذَلِكَ مِنْ أُجُورِهِمْ شَيْئًا،‏‏‏‏ وَمَنْ دَعَا إِلَى ضَلَالَةٍ كَانَ عَلَيْهِ مِنَ الْإِثْمِ مِثْلُ آثَامِ مَنْ يَتَّبِعُهُ لَا يَنْقُصُ ذَلِكَ مِنْ آثَامِهِمْ شَيْئًا   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2675": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2675,
        "enghadithText": " Narrated Ibn Jarir bin 'Abdullah:\r\nfrom his father that the Messenger of Allah (ﷺ) said:   Whoever starts a good tradition which is followed, then for him is a reward, and the likes of their rewards of whoever follows him, there being nothing diminished from their rewards. And whoever starts a bad tradition which is followed, then for him is the sin, and the likes of the sins of whoever follows him, there being nothing diminished from their sins. ",
        "Arabic": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا الْمَسْعُودِيُّ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنِ ابْنِ جَرِيرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    مَنْ سَنَّ سُنَّةَ خَيْرٍ فَاتُّبِعَ عَلَيْهَا فَلَهُ أَجْرُهُ وَمِثْلُ أُجُورِ مَنِ اتَّبَعَهُ غَيْرَ مَنْقُوصٍ مِنْ أُجُورِهِمْ شَيْئًا، ‏‏‏‏‏‏وَمَنْ سَنَّ سُنَّةَ شَرٍّ فَاتُّبِعَ عَلَيْهَا كَانَ عَلَيْهِ وِزْرُهُ وَمِثْلُ أَوْزَارِ مَنِ اتَّبَعَهُ، ‏‏‏‏‏‏غَيْرَ مَنْقُوصٍ مِنْ أَوْزَارِهِمْ شَيْئًا   ،‏‏‏‏ وفي الباب عن حُذَيْفَةَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوُ هَذَا، ‏‏‏‏‏‏وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنِ الْمُنْذِرِ بْنِ جَرِيرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ،‏‏‏‏ وَقَدْ رُوِيَ عَنْ عُبَيْدِ اللَّهِ بْنِ جَرِيرٍ، عَنْ أَبِيهِ،‏‏‏‏ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْضًا."
    },
    "2676": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2676,
        "enghadithText": " Narrated Al-'Irbad bin Sariyah:\r\n  One day after the morning Salat, the Messenger of Allah (ﷺ) exhorted us to the extent that the eyes wept and the hearts shuddered with fear. A man said: 'Indeed this is a farewell exhortation. [So what] do you order us O Messenger of Allah?' He said: 'I order you to have Taqwa of Allah, and to listen and obey, even in the case of an Ethiopian slave. Indeed, whomever among you lives, he will see much difference. Beware of the newly invented matters, for indeed they are astray. Whoever among you sees that, then he must stick to my Sunnah and the Sunnah of the rightly guided Khulafa', cling to it with the molars.' ",
        "Arabic": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو السُّلَمِيِّ، عَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ، قَالَ:‏‏‏‏ وَعَظَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا بَعْدَ صَلَاةِ الْغَدَاةِ مَوْعِظَةً بَلِيغَةً ذَرَفَتْ مِنْهَا الْعُيُونُ وَوَجِلَتْ مِنْهَا الْقُلُوبُ، ‏‏‏‏‏‏فَقَالَ رَجُلٌ:‏‏‏‏ إِنَّ هَذِهِ مَوْعِظَةُ مُوَدِّعٍ، ‏‏‏‏‏‏فَمَاذَا تَعْهَدُ إِلَيْنَا يَا رَسُولَ اللَّهِ ؟ قَالَ:‏‏‏‏    أُوصِيكُمْ بِتَقْوَى اللَّهِ، ‏‏‏‏‏‏وَالسَّمْعِ، ‏‏‏‏‏‏وَالطَّاعَةِ، ‏‏‏‏‏‏وَإِنْ عَبْدٌ حَبَشِيٌّ فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ يَرَى اخْتِلَافًا كَثِيرًا، ‏‏‏‏‏‏وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ فَإِنَّهَا ضَلَالَةٌ، ‏‏‏‏‏‏فَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ فَعَلَيْهِ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ، ‏‏‏‏‏‏عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ،‏‏‏‏ وَقَدْ رَوَى ثَوْرُ بْنُ يَزِيدَ، ‏‏‏‏‏‏عَنْ خَالِدِ بْنِ مَعْدَانَ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو السُّلَمِيِّ، ‏‏‏‏‏‏عَنْ الْعِرْبَاضِ بْنِ سَارِيَةَ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا."
    },
    "2677": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2677,
        "enghadithText": " Narrated Narrated Kathir bin 'Abdullah [and he is Ibn 'Amr bin 'Awf Al-Musani]:\r\nnarrated from his father, from his grandfather that the Prophet (ﷺ) said to Bilal bin Al-Harith:   Know.   He said:   I am ready to know O Messenger of Allah!   He (ﷺ) said:   That indeed whoever revives a Sunnah from my Sunnah which has died after me, then for him is a reward similar to whoever acts upon it without diminishing anything from their rewards. And whoever introduces an erroneous innovation which Allah is not pleased with, nor His Messenger, then he shall receive sins similar to whoever acts upon it, without that diminishing anything from the sins of the people.' ",
        "Arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ، عَنْ مَرْوَانَ بْنِ مُعَاوِيَةَ الْفَزَارِيِّ، عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ هُوَ ابْنُ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيِّ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِبِلَالِ بْنِ الْحَارِثِ:‏‏‏‏    اعْلَمْ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَعْلَمُ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏    اعْلَمْ يَا بِلَالُ   ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا أَعْلَمُ يَا رَسُولَ اللَّهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏    إِنَّهُ مَنْ أَحْيَا سُنَّةً مِنْ سُنَّتِي قَدْ أُمِيتَتْ بَعْدِي فَإِنَّ لَهُ مِنَ الْأَجْرِ مِثْلَ مَنْ عَمِلَ بِهَا مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَيْئًا، ‏‏‏‏‏‏وَمَنِ ابْتَدَعَ بِدْعَةَ ضَلَالَةٍ لَا يَرْضَاهَا اللَّهَ وَرَسُولَهُ كَانَ عَلَيْهِ مِثْلُ آثَامِ مَنْ عَمِلَ بِهَا لَا يَنْقُصُ ذَلِكَ مِنْ أَوْزَارِ النَّاسِ شَيْئًا   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ عُيَيْنَةَ هُوَ مَصِّيصِيٌّ شَامِيٌّ، ‏‏‏‏‏‏وَكَثِيرُ بْنُ عَبْدِ اللَّهِ هُوَ ابْنُ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيُّ."
    },
    "2678": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2678,
        "enghadithText": " Narrated Anas bin Malik:\r\n  The Messenger of Allah (ﷺ) said to me: 'O my son! If you are capable of (waking up in) the morning and (ending) the evening, while there is nothing of deception in your heart for anything, then do so.' Then he said to me: 'O my son! That is from my Sunnah. Whoever revives my Sunnah then he has loved me. And whoever loved me, he shall be with me in Paradise.' ",
        "Arabic": "حَدَّثَنَا مُسْلِمُ بْنُ حَاتِمٍ الْأَنْصَارِيُّ الْبَصْرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ، عَنْ أَبِيهِ، عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ:‏‏‏‏ قَالَ أَنَسُ بْنُ مَالِكٍ،‏‏‏‏ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا بُنَيَّ    إِنْ قَدَرْتَ أَنْ تُصْبِحَ وَتُمْسِيَ لَيْسَ فِي قَلْبِكَ غِشٌّ لِأَحَدٍ فَافْعَلْ، ‏‏‏‏‏‏ثُمَّ قَالَ لِي:‏‏‏‏ يَا بُنَيَّ وَذَلِكَ مِنْ سُنَّتِي، ‏‏‏‏‏‏وَمَنْ أَحْيَا سُنَّتِي فَقَدْ أَحَبَّنِي، ‏‏‏‏‏‏وَمَنْ أَحَبَّنِي كَانَ مَعِي فِي الْجَنَّةِ   ،‏‏‏‏ وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ ثِقَةٌ، ‏‏‏‏‏‏وَأَبُوهُ ثِقَةٌ، ‏‏‏‏‏‏وَعَلِيُّ بْنُ زَيْدٍ صَدُوقٌ، ‏‏‏‏‏‏إِلَّا أَنَّهُ رُبَّمَا يَرْفَعُ الشَّيْءَ الَّذِي يُوقِفُهُ غَيْرُهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَسَمِعْتُ مُحَمَّدَ بْنَ بَشَّارٍ يَقُولُ:‏‏‏‏ قَالَ أَبُو الْوَلِيدِ، ‏‏‏‏‏‏قَالَ شُعْبَةُ، ‏‏‏‏‏‏حَدَّثَنَا عَلِيُّ بْنُ زَيْدٍ وَكَانَ رَفَّاعًا، ‏‏‏‏‏‏وَلَا نَعْرِفُ لِسَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ أَنَسٍ رِوَايَةً إِلَّا هَذَا الْحَدِيثَ بِطُولِهِ،‏‏‏‏ وَقَدْ رَوَى عَبَّادُ بْنُ مَيْسَرَةَ الْمِنْقَرِيُّ هَذَا الْحَدِيثَ،‏‏‏‏ عَنْ عَلِيِّ بْنِ زَيْدٍ، عَنْ أَنَسٍ، وَلَمْ يَذْكُرْ فِيهِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ وَذَاكَرْتُ بِهِ مُحَمَّدَ بْنَ إِسْمَاعِيل فَلَمْ يَعْرِفْهُ وَلَمْ يُعْرَفْ لِسَعِيدِ بْنِ الْمُسَيَّبِ، ‏‏‏‏‏‏عَنْ أَنَسٍ هَذَا الْحَدِيثُ وَلَا غَيْرُهُ،‏‏‏‏ وَمَاتَ أَنَسُ بْنُ مَالِكٍ سَنَةَ ثَلَاثٍ وَتِسْعِينَ، ‏‏‏‏‏‏وَمَاتَ سَعِيدُ بْنُ الْمُسَيَّبِ بَعْدَهُ بِسَنَتَيْنِ، ‏‏‏‏‏‏مَاتَ سَنَةَ خَمْسٍ وَتِسْعِينَ."
    },
    "2679": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2679,
        "enghadithText": " Narrated Abu Hurairah:\r\nthat the Messenger of Allah (ﷺ) said:   Leave me with what I left you. When I narrated a Hadith to you, then take it from me. The people before you were only destroyed by their excessive questioning and disagreeing with their Prophets. ",
        "Arabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    اتْرُكُونِي مَا تَرَكْتُكُمْ فَإِذَا حَدَّثْتُكُمْ فَخُذُوا عَنِّي فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِكَثْرَةِ سُؤَالِهِمْ وَاخْتِلَافِهِمْ عَلَى أَنْبِيَائِهِمْ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ."
    },
    "2680": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2680,
        "enghadithText": " Narrated Abu Salih reported a narration from Abu Hurairah:\r\n  It shall soon be that people are beating the livers of camels (meaning that they are hastening and traveling upon them) seeking knowledge. But they will not find anyone more knowledgeable than a scholar of Al-Madinah. ",
        "Arabic": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّارُ، وَإِسْحَاق بْنُ مُوسَى الْأَنْصَارِيُّ، قَالَا:‏‏‏‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ رِوَايَةً    يُوشِكُ أَنْ يَضْرِبَ النَّاسُ أَكْبَادَ الْإِبِلِ يَطْلُبُونَ الْعِلْمَ فَلَا يَجِدُونَ أَحَدًا أَعْلَمَ مِنْ عَالِمِ الْمَدِينَةِ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ،‏‏‏‏ وَهُوَ حَدِيثُ ابْنِ عُيَيْنَةَ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنِ ابْنِ عُيَيْنَةَ أَنَّهُ قَالَ فِي هَذَا سُئِلَ:‏‏‏‏ مَنْ عَالِمُ الْمَدِينَةِ ؟ فَقَالَ:‏‏‏‏ إِنَّهُ مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏وَقَالَ إِسْحَاق بْنُ مُوسَى، ‏‏‏‏‏‏سَمِعْتُ ابْنَ عُيَيْنَةَ يَقُولُ:‏‏‏‏ هُوَ الْعُمَرِيُّ عَبْدُ اللهِ بْنُ عَبْدِ الْعَزِيزَ الزَّاهِدُ وَاسْمُهُ:‏‏‏‏ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، ‏‏‏‏‏‏وَسَمِعْتُ يَحْيَى بْنَ مُوسَى يَقُولُ، ‏‏‏‏‏‏قَالَ عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏هُوَ مَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏وَالْعُمَرِيُّ هُوَ عَبْدِ اللَّهِ بْنُ عَبْدُ الْعَزِيزِ مِنْ وَلَدِ عُمَرَ بْنِ الْخَطَّابِ."
    },
    "2681": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2681,
        "enghadithText": " Narrated Ibn 'Abbas:\r\nthat the Messenger of Allah (ﷺ) said:   The Faqih is harder on Ash-Shaitan than a thousand worshipers. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيل، حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا رَوْحُ بْنُ جَنَاحٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    فَقِيهٌ أَشَدُّ عَلَى الشَّيْطَانِ مِنْ أَلْفِ عَابِدٍ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏وَلَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ الْوَلِيدِ بْنِ مُسْلِمٍ."
    },
    "2682": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2682,
        "enghadithText": " Narrated Qais bin Kathir:\r\n  A man from Al-Madinah came to Abu Ad-Darda when he was in Dimashq. So he said: 'What brings you O my nephew?' He replied: 'A Hadith reached me which you have narrated from the Messenger of Allah (ﷺ).' He said: 'You did not come for some need?' He said: 'No.' He said: 'Did you come for trade?' He said: 'No, I did not come except seeking this Hadith.' So he said: 'Indeed, I heard the Messenger of Allah (ﷺ) saying:   Whoever takes a path upon which he seeks knowledge, then Allah makes a path to Paradise easy for him. And indeed the angels lower their wings in approval to the one seeking knowledge. Indeed forgiveness is sought for the knowledgeable one by whomever is in the heavens and whomever is in the earth, even the fish in the waters. And superiority of the scholar over the worshiper is like the superiority of the moon over the rest of the celestial bodies. Indeed the scholars are the heirs of the Prophets, and the Prophets do not leave behind Dinar or Dirham. The only legacy of the scholars is knowledge, so whoever takes from it, then he has indeed taken the most able share. ",
        "Arabic": "حَدَّثَنَا مَحْمُودُ بْنُ خِدَاشٍ الْبَغْدَادِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ الْوَاسِطِيُّ، حَدَّثَنَا عَاصِمُ بْنُ رَجَاءِ بْنِ حَيْوَةَ، عَنْ قَيْسِ بْنِ كَثِيرٍ، قَالَ:‏‏‏‏ قَدِمَ رَجُلٌ مِنْ الْمَدِينَةِ عَلَى أَبِي الدَّرْدَاءِ وَهُوَ بِدِمَشْقَ،‏‏‏‏ فَقَالَ:‏‏‏‏ مَا أَقْدَمَكَ يَا أَخِي ؟ فَقَالَ:‏‏‏‏ حَدِيثٌ بَلَغَنِي أَنَّكَ تُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَا جِئْتَ لِحَاجَةٍ ؟، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَا قَدِمْتَ لِتِجَارَةٍ ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَا جِئْتُ إِلَّا فِي طَلَبِ هَذَا الْحَدِيثِ ؟ قَالَ:‏‏‏‏ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏    مَنْ سَلَكَ طَرِيقًا يَبْتَغِي فِيهِ عِلْمًا سَلَكَ اللَّهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ، ‏‏‏‏‏‏وَإِنَّ الْمَلَائِكَةَ لَتَضَعُ أَجْنِحَتَهَا رِضَاءً لِطَالِبِ الْعِلْمِ، ‏‏‏‏‏‏وَإِنَّ الْعَالِمَ لَيَسْتَغْفِرُ لَهُ مَنْ فِي السَّمَوَاتِ وَمَنْ فِي الْأَرْضِ حَتَّى الْحِيتَانُ فِي الْمَاءِ، ‏‏‏‏‏‏وَفَضْلُ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِ الْقَمَرِ عَلَى سَائِرِ الْكَوَاكِبِ، ‏‏‏‏‏‏إِنَّ الْعُلَمَاءَ وَرَثَةُ الْأَنْبِيَاءِ، ‏‏‏‏‏‏إِنَّ الْأَنْبِيَاءَ لَمْ يُوَرِّثُوا دِينَارًا وَلَا دِرْهَمًا إِنَّمَا وَرَّثُوا الْعِلْمَ فَمَنْ أَخَذَ بِهِ أَخَذَ بِحَظٍّ وَافِرٍ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ وَلَا نَعْرِفُ هَذَا الْحَدِيثَ إِلَّا مِنْ حَدِيثِ عَاصِمِ بْنِ رَجَاءِ بْنِ حَيْوَةَ، ‏‏‏‏‏‏وَلَيْسَ هُوَ عِنْدِي بِمُتَّصِلٍ هَكَذَا،‏‏‏‏ حَدَّثَنَا مَحْمُودُ بْنُ خِدَاشٍ هَذَا الْحَدِيثَ، ‏‏‏‏‏‏وَإِنَّمَا يُرْوَى هَذَا الْحَدِيثُ عَنْ عَاصِمِ بْنِ رَجَاءِ بْنِ حَيْوَةَ، عَنِ الْوَلِيدِ بْنِ جَمِيلٍ، عَنْ كَثِيرِ بْنِ قَيْسٍ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏وَهَذَا أَصَحُّ مِنْ حَدِيثِ مَحْمُودِ بْنِ خِدَاشٍ،‏‏‏‏ وَرَأْيُ مُحَمَّدِ بْنِ إِسْمَاعِيل هَذَا أَصَحُّ."
    },
    "2683": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2683,
        "enghadithText": " Narrated Ibn Ashwa:\r\nfrom Yazid bin Salamah Al-Ju'fi, he said:   Yazid bin Salamah 'O Messenger of Allah! I heard so many narrations from you that I am afraid the last of them will cause me to forget the first of them. So narrate a statement to me that will encompass them.' So he said: 'Have Taqwa of Allah with what you learn.' ",
        "Arabic": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا أَبُو الْأَحْوَصِ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنِ ابْنِ أَشْوَعَ، عَنْ يَزِيدَ بْنِ سَلَمَةَ الْجُعْفِيِّ، قَالَ:‏‏‏‏ قَالَ يَزِيدُ بْنُ سَلَمَةَ:‏‏‏‏ يَا رَسُولَ اللَّهِ إِنِّي قَدْ سَمِعْتُ مِنْكَ حَدِيثًا كَثِيرًا أَخَافُ أَنْ يُنْسِيَنِي أَوَّلَهُ آخِرُهُ فَحَدِّثْنِي بِكَلِمَةٍ تَكُونُ جِمَاعًا، ‏‏‏‏‏‏قَالَ:‏‏‏‏    اتَّقِ اللَّهَ فِيمَا تَعْلَمُ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ، ‏‏‏‏‏‏وَهُوَ عِنْدِي مُرْسَلٌ، ‏‏‏‏‏‏وَلَمْ يُدْرِكْ عِنْدِي ابْنُ أَشْوَعَ يَزِيدَ بْنَ سَلَمَةَ، ‏‏‏‏‏‏وَابْنُ أَشْوَعَ اسْمُهُ:‏‏‏‏ سَعِيدُ بْنُ أَشْوَعَ."
    },
    "2684": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2684,
        "enghadithText": " Narrated Abu Hurairah:\r\nthat the Messenger of Allah (ﷺ) said:   Two things will not be together in a hypocrite: Good manners, and Fiqh in the religion. ",
        "Arabic": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا خَلَفُ بْنُ أَيُّوبَ الْعَامِرِيُّ، عَنْ عَوْفٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    خَصْلَتَانِ لَا تَجْتَمِعَانِ فِي مُنَافِقٍ:‏‏‏‏ حُسْنُ سَمْتٍ، ‏‏‏‏‏‏وَلَا فِقْهٌ فِي الدِّينِ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏وَلَا نَعْرِفُ هَذَا الْحَدِيثَ مِنْ حَدِيثِ عَوْفٍ إِلَّا مِنْ حَدِيثِ هَذَا الشَّيْخِ خَلَفِ بْنِ أَيُّوبَ الْعَامِرِيِّ، ‏‏‏‏‏‏وَلَمْ أَرَ أَحَدًا يَرْوِي عَنْهُ غَيْرَ أَبِي كُرَيْبٍ مُحَمَّدِ بْنِ الْعَلَاءِ، ‏‏‏‏‏‏وَلَا أَدْرِي كَيْفَ هُوَ."
    },
    "2685": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2685,
        "enghadithText": " Narrated Abu Umamah Al-Bahili:\r\n  Two men were mentioned before the Messenger of Allah (ﷺ). One of them a worshiper, and the other a scholar. So the Messenger of Allah (ﷺ) said: 'The superiority of the scholar over the worshiper is like my superiority over the least of you.' Then the Messenger of Allah (ﷺ) said: 'Indeed Allah, His Angels, the inhabitants of the heavens and the earths - even the ant in his hole, even the fish - say Salat upon the one who teaches the people to do good.' ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ، حَدَّثَنَا سَلَمَةُ بْنُ رَجَاءٍ، حَدَّثَنَا الْوَلِيدُ بْنُ جَمِيلٍ، حَدَّثَنَا الْقَاسِمُ أَبُو عَبْدِ الرَّحْمَنِ، عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ، قَالَ:‏‏‏‏ ذُكِرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَانِ أَحَدُهُمَا:‏‏‏‏ عَابِدٌ وَالْآخَرُ عَالِمٌ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    فَضْلُ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِي عَلَى أَدْنَاكُمْ   ، ‏‏‏‏‏‏ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    إِنَّ اللَّهَ وَمَلَائِكَتَهُ وَأَهْلَ السَّمَوَاتِ وَالأَرْض حَتَّى النَّمْلَةَ فِي جُحْرِهَا، ‏‏‏‏‏‏وَحَتَّى الْحُوتَ لَيُصَلُّونَ عَلَى مُعَلِّمِ النَّاسِ الْخَيْرَ   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ،‏‏‏‏ قَالَ:‏‏‏‏ سَمِعْت أَبَا عَمَّارٍ الْحُسَيْنَ بْنَ حُرَيْثٍ الْخُزَاعِيَّ،‏‏‏‏ يَقُولُ:‏‏‏‏ سَمِعْتُ الْفُضَيْلَ بْنَ عِيَاضٍ،‏‏‏‏ يَقُولُ:‏‏‏‏ عَالِمٌ عَامِلٌ مُعَلِّمٌ يُدْعَى كَبِيرًا فِي مَلَكُوتِ السَّمَوَاتِ."
    },
    "2686": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2686,
        "enghadithText": " Narrated Abu Sa'eed Al-Khudri:\r\nthat the Messenger of Allah (ﷺ) said:   The believer will never be satisfied with the good he hears, until he ends up in Paradise. ",
        "Arabic": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ الشَّيْبَانِيُّ الْبَصْرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ دَرَّاجٍ، عَنْ أَبِي الْهَيْثَمِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ:‏‏‏‏    لَنْ يَشْبَعَ الْمُؤْمِنُ مِنْ خَيْرٍ يَسْمَعُهُ حَتَّى يَكُونَ مُنْتَهَاهُ الْجَنَّةُ   ،‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ."
    },
    "2687": {
        "bookNumber": 41,
        "bookName": "Chapters on Knowledge",
        "hadithNumber": 2687,
        "enghadithText": " Narrated Abu Hurairah:\r\nthat the Messenger of Allah (ﷺ) said:   The wise statement is the lost property of the believer, so wherever he finds it, then he is more worthy of it. ",
        "Arabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ، عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏    الْكَلِمَةُ الْحِكْمَةُ ضَالَّةُ الْمُؤْمِنِ فَحَيْثُ وَجَدَهَا فَهُوَ أَحَقُّ بِهَا   ،‏‏‏‏ قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ، ‏‏‏‏‏‏وَإِبْرَاهِيمُ بْنُ الْفَضْلِ الْمَدَنِيُّ الْمَخْزُومِيُّ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ."
    }
}