[
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "1",
    "sectionHeading": "Eating Game Killed with Throwing Sticks and by Stones",
    "text": "<p>\\n\\t\\t\\t\\tahya related to me from Malik that Nafi said, \"I was at\\n\\t\\t\\t\\tal-Juruf (near Madina) and threw a stone at two birds,\\n\\t\\t\\t\\tand hit them. One of them died, and Abdullah ibn Umar\\n\\t\\t\\t\\tthrew it away, and then went to slaughter the other one\\n\\t\\t\\t\\twith an adze. It died before he could slaughter it, so\\n\\t\\t\\t\\tAbdullah threw that one away as well.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "2",
    "sectionHeading": "Eating Game Killed with Throwing Sticks and by Stones",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad disapproved of eating game that had\\n\\t\\t\\t\\tbeen killed with throwing sticks and by clay pellets.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "3",
    "sectionHeading": "Eating Game Killed with Throwing Sticks and by Stones",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab disapproved of killing domestic\\n\\t\\t\\t\\tanimals that had become wild by any means that game was\\n\\t\\t\\t\\tslain such as arrows and the like.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not see any harm in eating game which\\n\\t\\t\\t\\tis pierced by a throwing stick in a vital organ.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllah, the Blessed, the Exalted! said, 'Oh you who\\n\\t\\t\\t\\tbelieve! Allah will surely try you with something of the\\n\\t\\t\\t\\tgame that your hands and spears attain.' \" (Sura 5 ayat\\n\\t\\t\\t\\t97).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"Any game that man obtains by his hand or by\\n\\t\\t\\t\\this spear or by any weapon which pierces it and reaches a\\n\\t\\t\\t\\tvital organ, is acceptable as Allah, the Exalted, has\\n\\t\\t\\t\\tsaid.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "4",
    "sectionHeading": "Eating Game Killed with Throwing Sticks and by Stones",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard the\\n\\t\\t\\t\\tpeople of knowledge say that when a man hit game and\\n\\t\\t\\t\\tsomething else might have contributed to death, like\\n\\t\\t\\t\\twater or an untrained dog, that game was not to be eaten\\n\\t\\t\\t\\tunless it was beyond doubt that it was the arrow of the\\n\\t\\t\\t\\thunter that had killed it by reaching a vital organ, so\\n\\t\\t\\t\\tthat it did not have any life after that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "5",
    "sectionHeading": "Eating Game Killed with Throwing Sticks and by Stones",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that he heard Malik say that there was no harm\\n\\t\\t\\t\\tin eating game when you did not see it die if you found\\n\\t\\t\\t\\tthe mark of your dog on it or your arrow in it as long as\\n\\t\\t\\t\\tit had not remained overnight. If it had remained\\n\\t\\t\\t\\tovernight, then it was disapproved of to eat it.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "5",
    "sectionHeading": "Game Caught by Trained Dogs",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said about a trained dog, \"Eat whatever it\\n\\t\\t\\t\\tcatches for you whether it eats from it or not.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "6",
    "sectionHeading": "Game Caught by Trained Dogs",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard Nafi say\\n\\t\\t\\t\\tthat Abdullah ibn Umar said, \"Whether it eats from it or\\n\\t\\t\\t\\tnot.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "7",
    "sectionHeading": "Game Caught by Trained Dogs",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Sad\\n\\t\\t\\t\\tibn Abi Waqqas had said, when asked about a trained dog\\n\\t\\t\\t\\tkilling game, \"Eat, even if only one piece of it\\n\\t\\t\\t\\tremains.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "8",
    "sectionHeading": "Game Caught by Trained Dogs",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard some of\\n\\t\\t\\t\\tthe people of knowledge say that when falcons, eagles,\\n\\t\\t\\t\\tand hawks and their like, understood as trained dogs\\n\\t\\t\\t\\tunderstood, there was no harm in eating what they had\\n\\t\\t\\t\\tkilled in the course of hunting, if the name of Allah had\\n\\t\\t\\t\\tbeen mentioned when they were sent out.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The best of what I have heard about\\n\\t\\t\\t\\tretrieving game from the falcon's talons or from the\\n\\t\\t\\t\\tdog's fangs and then waiting until it dies, is that it is\\n\\t\\t\\t\\tnot halal to eat it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The same applies to anything which could\\n\\t\\t\\t\\thave been slaughtered by the hunter when it was in the\\n\\t\\t\\t\\ttalons of the falcon or the fangs of the dog. If the\\n\\t\\t\\t\\thunter leaves it until the falcon or dog has killed it,\\n\\t\\t\\t\\tit is not halal to eat it either\". He continued, \"The\\n\\t\\t\\t\\tsame thing applies to any game hit by a hunter and caught\\n\\t\\t\\t\\twhile still alive, which he neglects to slaughter before\\n\\t\\t\\t\\tit dies.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is generally agreed among us that it is\\n\\t\\t\\t\\thalal to eat the game that a hunting-dog belonging to\\n\\t\\t\\t\\tmagians hunts or kills, if it is sent out by a muslim and\\n\\t\\t\\t\\tthe animal is trained. There is no harm in it even if the\\n\\t\\t\\t\\tmuslim does not actually slaughter it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIt is the same as a muslim using a magian's knife to\\n\\t\\t\\t\\tslaughter with or using his bow and arrows to shoot and\\n\\t\\t\\t\\tkill with. The game he shot and the animal he slaughters\\n\\t\\t\\t\\tare halal. There is no harm in eating them. If a magian\\n\\t\\t\\t\\tsends out a muslim's hunting dog for game, and it catches\\n\\t\\t\\t\\tit, the game is not to be eaten unless it is slaughtered\\n\\t\\t\\t\\tby a muslim. That is like a magian using a muslim's bow\\n\\t\\t\\t\\tand arrow to hunt game with, or like his using a muslim's\\n\\t\\t\\t\\tknife to slaughter with. It is not halal to eat anything\\n\\t\\t\\t\\tkilled like that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "9",
    "sectionHeading": "Game of the Sea",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abd\\n\\t\\t\\t\\tar-Rahman ibn Abi Hurayra asked Abdullah ibn Umar about\\n\\t\\t\\t\\teating what was cast up by the sea and he forbade him to\\n\\t\\t\\t\\teat it. Then Abdullah turned and asked for a Qur'an, and\\n\\t\\t\\t\\tread, \"The game of the sea and its flesh are halal for\\n\\t\\t\\t\\tyou.\" Nafi added, \"Abdullah ibn Umar sent me to\\n\\t\\t\\t\\tAbdar-Rahman Ibn Abi Hurayra to say that there was no\\n\\t\\t\\t\\tharm in eating it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "10",
    "sectionHeading": "Game of the Sea",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tSad al-Jari, the mawla of Umar ibn al-Khattab asked\\n\\t\\t\\t\\tAbdullah ibn Umar about fish which had killed each other\\n\\t\\t\\t\\tor which had died from severe cold . He said, \"There is\\n\\t\\t\\t\\tno harm in eating them.'' Sad said,' 'I then asked\\n\\t\\t\\t\\tAbdullah ibn Amr ibn al As and he said the same.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "11",
    "sectionHeading": "Game of the Sea",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from Abu\\n\\t\\t\\t\\tSalama ibn Abd ar-Rahman from Abu Hurayra and Zayd ibn\\n\\t\\t\\t\\tThabit that they saw no harm in eating what was cast up\\n\\t\\t\\t\\tby the sea.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "12",
    "sectionHeading": "Game of the Sea",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from Abu\\n\\t\\t\\t\\tSalama ibn Abd ar-Rahman that some people from al-Jar\\n\\t\\t\\t\\tcame to Marwan ibn al-Hakam and asked him about eating\\n\\t\\t\\t\\twhat was cast up by the sea. He said, \"There is no harm\\n\\t\\t\\t\\tin eating it.\" Marwan said, \"Go to Zayd ibn Thabit and\\n\\t\\t\\t\\tAbu Hurayra and ask them about it, then come to me and\\n\\t\\t\\t\\ttell me what they say.\" They went to them and asked them,\\n\\t\\t\\t\\tand they both said, \"There is no harm in eating it \" They\\n\\t\\t\\t\\treturned to Marwan and told him. Marwan said, \"I told\\n\\t\\t\\t\\tyou.\" \\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that there was no harm in eating fish caught\\n\\t\\t\\t\\tby magians, because the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"In the sea's water\\n\\t\\t\\t\\tis purity, and that which is dead in it is halal. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If it is eaten when it is dead, there is no\\n\\t\\t\\t\\tharm in who catches it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "13",
    "sectionHeading": "Prohibition Against Eating Animals with Fangs.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shibab from Abu\\n\\t\\t\\t\\tIdris al-Khawlani from Abu Tha~laba al-Khushani that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"It is haram to eat animals with fangs \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "14",
    "sectionHeading": "Prohibition Against Eating Animals with Fangs.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ismail ibn Abi Hakim\\n\\t\\t\\t\\tfrom Abiyda ibn Sufyan al-Hadrami from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Eating animals with fangs is haram. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the custom among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "15",
    "sectionHeading": "What is Disapproved of Regarding Eating Riding Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that the best of what he\\n\\t\\t\\t\\thad heard about horses, mules, and donkeys was that they\\n\\t\\t\\t\\twere not eaten because Allah, the Blessed, the\\n\\t\\t\\t\\tExalted,said, \"And horses, and mules and asses, for you\\n\\t\\t\\t\\tto ride, and as an adornment. \" (Sura 16 ayat 8) . He\\n\\t\\t\\t\\tsaid, may He be Blessed and Exalted, \"In cattle, some of\\n\\t\\t\\t\\tthem you ride, and some of them you eat.\" (Sura 6 ayat\\n\\t\\t\\t\\t79). He said, the Blessed, the Exalted, \"Mention Allah's\\n\\t\\t\\t\\tname over what He has provided you of cattle, and eat of\\n\\t\\t\\t\\tthem and feed the beggar (al-qani) and the suppliant\\n\\t\\t\\t\\t(al-mutarr). (Sura 22 ayat 34).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said \"Allah mentioned horses, mules, and donkeys\\n\\t\\t\\t\\tfor riding and adornment, and He mentioned cattle for\\n\\t\\t\\t\\triding and eating.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Al-qani also means the poor.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "16",
    "sectionHeading": "Using the Skin of Animals Found Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud that Abdullah\\n\\t\\t\\t\\tibn Abbas said, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, passed by a dead sheep which had\\n\\t\\t\\t\\tbeen given to a mawla of his wife, Maimuna. He said, '\\n\\t\\t\\t\\tAren't you going to use its skin?' They said, 'Messenger\\n\\t\\t\\t\\tof Allah, but it is carrion. 'The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, 'Only eating\\n\\t\\t\\t\\tit is haram.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "17",
    "sectionHeading": "Using the Skin of Animals Found Dead",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Zayd ibn Aslam from Ibn Wala\\n\\t\\t\\t\\tal-Misri from Abdullah ibn Abbas that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, \"A\\n\\t\\t\\t\\tskin when it is tanned is pure.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "18",
    "sectionHeading": "Using the Skin of Animals Found Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Abdullah\\n\\t\\t\\t\\tibn Qusayt from Muhammad ibn Abd ar-Rahman ibn Thawban\\n\\t\\t\\t\\tfrom his mother that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, ordered that the skins of carrion be used after\\n\\t\\t\\t\\tthey had been tanned.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "25",
    "hadithNumber": "19",
    "sectionHeading": "Eating Carrion when Forced to, out of Necessity",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that the best of what he\\n\\t\\t\\t\\thad heard about a man who is forced by necessity to eat\\n\\t\\t\\t\\tcarrion is that he ate it until he was full and then he\\n\\t\\t\\t\\ttook provision from it. If he found something which would\\n\\t\\t\\t\\tenable him to dispense with it, he threw it away.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik when asked whether or not a man who had been forced\\n\\t\\t\\t\\tby necessity to eat carrion, should eat it when he also\\n\\t\\t\\t\\tfound the fruit, crops or sheep of a people in that\\n\\t\\t\\t\\tplace, answered, \"If he thinks that the owners of the\\n\\t\\t\\t\\tfruit, crops, or sheep will believe his necessity so that\\n\\t\\t\\t\\the will not be deemed a thief and have his hand cut off,\\n\\t\\t\\t\\tthen I think that he should eat from whatever he finds\\n\\t\\t\\t\\tthat which will remove his hunger but he should not carry\\n\\t\\t\\t\\tany of it away. I prefer that he does that than that he\\n\\t\\t\\t\\teat carrion. If he fears that he will not be believed,\\n\\t\\t\\t\\tand will be deemed a thief for what he has taken, then I\\n\\t\\t\\t\\tthink that it is better for him to eat the carrion, and\\n\\t\\t\\t\\the has leeway to eat carrion in this respect. Even so, I\\n\\t\\t\\t\\tfear that someone who is not forced by necessity to eat\\n\\t\\t\\t\\tcarrion might exceed the limits out of a desire to\\n\\t\\t\\t\\tconsume other peoples' property, crops or fruit.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the best of what I have heard.\"\\n\\t\\t\\t</p>"
  }
]
