[
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "1",
    "sectionHeading": "Concerning Prayer in the Night",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn\\n\\t\\t\\t\\tal-Munkadir from Said ibn al-Jubayr that a man who has\\n\\t\\t\\t\\tapproval (as a relater of hadith), told him that A'isha,\\n\\t\\t\\t\\tthe wife of the Prophet, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, said, \"If a man prays in the night and sleep\\n\\t\\t\\t\\tovercomes him during it, Allah writes for him the reward\\n\\t\\t\\t\\tof his prayer, and his sleep is sadaqa for him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "2",
    "sectionHeading": "Concerning Prayer in the Night",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'nNadr, the mawla\\n\\t\\t\\t\\tof Umar ibn 'Ubaydullah, from Abu Salama ibn Abd\\n\\t\\t\\t\\tar-Rahman that A'isha, the wife of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"I was sleeping in\\n\\t\\t\\t\\tfront of the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and my feet were in his qibla. When he\\n\\t\\t\\t\\tprostrated, he nudged me and I pulled up my feet,and when\\n\\t\\t\\t\\the stood up I spread them out.\" She added, \"There were no\\n\\t\\t\\t\\tlamps in the house at that time.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "3",
    "sectionHeading": "Concerning Prayer in the Night",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"If you are drowsy in prayer, sleep until sleep leaves\\n\\t\\t\\t\\tyou, because if you pray while you are drowsy, you do not\\n\\t\\t\\t\\tknow whether you may intend to ask for forgiveness but\\n\\t\\t\\t\\t(in fact) ask for harm.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "5",
    "sectionHeading": "Concerning Prayer in the Night",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ismail from Ibn Abi\\n\\t\\t\\t\\tHakim that he had heard that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, heard a woman\\n\\t\\t\\t\\tpraying at night. He said, \"Who is that?\" and someone\\n\\t\\t\\t\\tsaid to him,\"It is al-Hawla bint Tuwayt, she does not\\n\\t\\t\\t\\tsleep in the night.\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, disapproved of that and\\n\\t\\t\\t\\this disapproval showed in his face. Then he said, \"Allah,\\n\\t\\t\\t\\tthe Blessed and Exalted, does not become weary, but you\\n\\t\\t\\t\\tbecome weary. Take on whatever is within your\\n\\t\\t\\t\\tcapability.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "5",
    "sectionHeading": "Concerning Prayer in the Night",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\this father that Umar ibn al-Khattab used to pray as much\\n\\t\\t\\t\\tas Allah willed in the night until at the end of the\\n\\t\\t\\t\\tnight he would wake his family for the prayer. He used to\\n\\t\\t\\t\\tsay to them, \"The prayer, the prayer.\" Then he would\\n\\t\\t\\t\\trecite the ayat, \"Enjoin prayer on your family and be\\n\\t\\t\\t\\tconstant in it. We do not ask you for your provision. We\\n\\t\\t\\t\\tprovide for you. And the end result is for taqwa.\" (Sura\\n\\t\\t\\t\\t20 ayat 132)\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "6",
    "sectionHeading": "Concerning Prayer in the Night",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab used to say, \"Sleep is disapproved\\n\\t\\t\\t\\tof before isha and conversation after it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "7",
    "sectionHeading": "Concerning Prayer in the Night",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar used to say, \"(Voluntary) prayer in\\n\\t\\t\\t\\tboth the day and night is two at a time with a taslim\\n\\t\\t\\t\\tafter every raka.''\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the custom among us. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "8",
    "sectionHeading": "How the Prophet, may Allah bless him and grant him peace, Prayed the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr from A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, used\\n\\t\\t\\t\\tto pray eleven rakas in the night, making them odd by a\\n\\t\\t\\t\\tsingle one, and when he had finished he lay down on his\\n\\t\\t\\t\\tright side.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "9",
    "sectionHeading": "How the Prophet, may Allah bless him and grant him peace, Prayed the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Said ibn Abi Said\\n\\t\\t\\t\\tal-Maqburi from Abu Salama ibn Abd ar-Rahman ibn Awf that\\n\\t\\t\\t\\the asked A'isha, the wife of the Prophet, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, what the prayer of the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\tlike during Ramadan. She said, \"The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, did not go above\\n\\t\\t\\t\\televen rakas in Ramadan or at any other time. He prayed\\n\\t\\t\\t\\tfour - do not ask me about their beauty or length. Then\\n\\t\\t\\t\\the prayed another four - do not ask me about their beauty\\n\\t\\t\\t\\tand length. Then he prayed three.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha continued, \"I said, 'Messenger of Allah, are you\\n\\t\\t\\t\\tsleeping before you do the witr?' He said, A'isha, my\\n\\t\\t\\t\\teyes sleep but my heart does not sleep.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "10",
    "sectionHeading": "How the Prophet, may Allah bless him and grant him peace, Prayed the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, umm al-muminin said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to pray thirteen rakas in the night and then\\n\\t\\t\\t\\twould pray two rakas when he heard the adhan for the subh\\n\\t\\t\\t\\tprayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "11",
    "sectionHeading": "How the Prophet, may Allah bless him and grant him peace, Prayed the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Makhrama ibn Sulayman\\n\\t\\t\\t\\tfrom Kurayb, the mawla of Ibn Abbas, that Abdullah ibn\\n\\t\\t\\t\\tAbbas told him that he had spent a night at the house of\\n\\t\\t\\t\\tMaimuna, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, who was also Ibn Abbas' mother's sister.\\n\\t\\t\\t\\tIbn Abbas said, \"I lay down with my head on the breadth\\n\\t\\t\\t\\tof the cushion, and the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and his wife lay down with\\n\\t\\t\\t\\ttheir heads on its length. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, slept, until,\\n\\t\\t\\t\\thalfway through the night or a little before or after it,\\n\\t\\t\\t\\the awoke and sat up and wiped the sleep away from his\\n\\t\\t\\t\\tface with his hand. Then he recited the last ten ayats of\\n\\t\\t\\t\\tsura Ali Imran (Sura3). Then he got up and went over to a\\n\\t\\t\\t\\twater-skin which was hanging up and did wudu from it,\\n\\t\\t\\t\\tdoing his wudu thoroughly, and then he stood in prayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Abbas continued, \"I stood up and did the same and\\n\\t\\t\\t\\tthen went and stood by his side. The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, put his right\\n\\t\\t\\t\\thand on my head and took my right ear and tweaked it. He\\n\\t\\t\\t\\tprayed two rakas, then two rakas, then two rakas, then\\n\\t\\t\\t\\ttwo rakas, then two rakas, then two rakas, and then\\n\\t\\t\\t\\tprayed an odd raka. Then he lay down until the muadhdhin\\n\\t\\t\\t\\tcame to him, and then prayed two quick rakas, and went\\n\\t\\t\\t\\tout and prayed subh .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "12",
    "sectionHeading": "How the Prophet, may Allah bless him and grant him peace, Prayed the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tfrom his father that Abdullah ibn Qays ibn Makhrama told\\n\\t\\t\\t\\thim that Zayd ibn Khalid al-Juhani said one night that he\\n\\t\\t\\t\\twas going to observe the prayer of the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace. He said,\\n\\t\\t\\t\\t\"I rested my head on his threshold. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, got up\\n\\t\\t\\t\\tand prayed two long, long, long rakas. Then he prayed two\\n\\t\\t\\t\\trakas which were slightly less long than the two before\\n\\t\\t\\t\\tthem. Then he prayed two rakas which were slightly less\\n\\t\\t\\t\\tlong than the two before them. Then he prayed two rakas\\n\\t\\t\\t\\twhich were slightly less long than the two before them.\\n\\t\\t\\t\\tThen he prayed two rakas which were slightly less long\\n\\t\\t\\t\\tthan the two before them. Then he prayed two rakas which\\n\\t\\t\\t\\twere slightly less long than the two before them. Then he\\n\\t\\t\\t\\tprayed an odd raka, making thirteen rakas in all.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "13",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi and Abdullah ibn\\n\\t\\t\\t\\tUmar that a man asked the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, about night prayers. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Night prayers are two by two, and when you\\n\\t\\t\\t\\tare afraid that dawn is approaching, pray one raka to\\n\\t\\t\\t\\tmake what you have prayed odd.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "14",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Yahya ibn Habban from Ibn Muhayriz that a\\n\\t\\t\\t\\tman from the Kinana tribe called al-Mukhdaji heard a man\\n\\t\\t\\t\\tin Syria known as Abu Muhammad saying, \"The witr is\\n\\t\\t\\t\\tobligatory (fard).\" Al-Mukhdaji said, \"I went to Ubada\\n\\t\\t\\t\\tibn as-Samit and presented myself to him as he was going\\n\\t\\t\\t\\tto the mosque, and told him what Abu Muhammad had said.\\n\\t\\t\\t\\tUbada said that Abu Muhammad had lied and that he had\\n\\t\\t\\t\\theard the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, say, 'Allah the Majestic and Mighty has\\n\\t\\t\\t\\twritten five prayers for mankind, and whoever does them\\n\\t\\t\\t\\tand does not waste anything of them by making light of\\n\\t\\t\\t\\twhat is due to them, there is a pact for him with Allah\\n\\t\\t\\t\\tthat He will admit him into the Garden.Whoever does not\\n\\t\\t\\t\\tdo them, there is no pact for him with Allah. If He\\n\\t\\t\\t\\twishes, He punishes him, and if He wishes, He admits him\\n\\t\\t\\t\\tinto the Garden.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "15",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Bakr ibn Umar\\n\\t\\t\\t\\tthat Said ibn Yasar said, ''I was travelling with\\n\\t\\t\\t\\tAbdullah ibn Umar on the road to Makka, and fearing that\\n\\t\\t\\t\\tit was nearly dawn. I dismounted and prayed witr.\\n\\t\\t\\t\\tAbdullah said, 'Is there not a model for you in the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace?'  I said, 'Of course, by Allah!'  He said, 'The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to pray witr on his camel.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "16",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"Abu Bakr as-Siddiq used to\\n\\t\\t\\t\\tpray witr when he wished to go to bed, and Umar ibn\\n\\t\\t\\t\\tal-Khattab used to pray witr at the end of the night. As\\n\\t\\t\\t\\tfor me, I pray witr when I go to bed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "17",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that a\\n\\t\\t\\t\\tman asked Abdullah ibn Umar whether the witr was\\n\\t\\t\\t\\tobligatory and Abdullah ibn Umar said, \"The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, prayed\\n\\t\\t\\t\\twitr, and the muslims prayed witr.\" The man began\\n\\t\\t\\t\\trepeating his question, and Abdullah ibn Umar kept\\n\\t\\t\\t\\tsaying, \"The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, prayed witr, and the muslims prayed\\n\\t\\t\\t\\twitr.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "18",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, used to say, \"If someone fears that he\\n\\t\\t\\t\\twill sleep through till the morning, let him pray the\\n\\t\\t\\t\\twitr before he sleeps, and if some one hopes to wake for\\n\\t\\t\\t\\tthe last part of the night, let him delay his witr.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "19",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Nafi said, \"I was\\n\\t\\t\\t\\twith Abdullah ibn Umar in Makka. The sky was clouded over\\n\\t\\t\\t\\tand Abdullah feared that dawn was approaching so he\\n\\t\\t\\t\\tprayed one raka for witr. Then the clouds cleared and he\\n\\t\\t\\t\\tsaw that it was still night, so he made his prayers even\\n\\t\\t\\t\\twith one raka. Then he continued to pray two rakas at a\\n\\t\\t\\t\\ttime, until when he feared the approach of dawn, he\\n\\t\\t\\t\\tprayed one raka for witr.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "20",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say the taslim between the two rakas and\\n\\t\\t\\t\\tthe one raka of witr so that he could order something he\\n\\t\\t\\t\\tneeded.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "21",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Sad\\n\\t\\t\\t\\tibn Abi Waqqas used to pray witr after isha with one\\n\\t\\t\\t\\traka.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is not the situation with us. Rather\\n\\t\\t\\t\\tthree is the minimum for witr.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "22",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tthat Abdullah ibn Umar used to say, \"The maghrib prayer\\n\\t\\t\\t\\tis the witr of the daytime prayers.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone prays witr at the beginning of\\n\\t\\t\\t\\tthe night, and goes to sleep, and then wakes up and it\\n\\t\\t\\t\\tseems good to him to pray, let him pray, two rakas at a\\n\\t\\t\\t\\ttime. That is what I like most of what I have heard.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "23",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd al Karim ibn\\n\\t\\t\\t\\tAbi'l-Mukhariq al-Basri from Said ibn Jubayr that\\n\\t\\t\\t\\tAbdullah ibn Abbas slept, and when he woke up, he said to\\n\\t\\t\\t\\this servant, \"Go and see what the people have done,\" (by\\n\\t\\t\\t\\tthat time his sight had gone.) The servant went out and\\n\\t\\t\\t\\treturned saying, \"The people have left from subh,\" so\\n\\t\\t\\t\\tAbdullah ibn Abbas got up and prayed witr and then prayed\\n\\t\\t\\t\\tsubh.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "24",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Abbas and Ubada ibn as-Samit and al-Qasim\\n\\t\\t\\t\\tibn Muhammad and Abdullah ibn Amir ibn Rabia had all\\n\\t\\t\\t\\tprayed witr after the break of dawn.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "25",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Abdullah ibn Masud said, \"I do not mind\\n\\t\\t\\t\\tif the iqama for the subh prayer is called while I am\\n\\t\\t\\t\\tstill praying witr.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "26",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t''Ubada ibn as-Samit used to lead the people in prayer.\\n\\t\\t\\t\\tOne day he came out for subh and the muadhdhin began to\\n\\t\\t\\t\\tgive the iqama for the subh prayer Ubada silenced him,\\n\\t\\t\\t\\tprayed witr and then led them in subh.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "27",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim said, \"I heard Abdullah ibn Amir ibn Rabia say,\\n\\t\\t\\t\\t'I sometimes pray witr while hearing the iqama, or after\\n\\t\\t\\t\\tthe break of dawn.' \" Abd ar-Rahman was not certain which\\n\\t\\t\\t\\the said.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "28",
    "sectionHeading": "The Command to Pray the Witr",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Abd ar-Rahman ibn al-Qasim heard\\n\\t\\t\\t\\this father al-Qasim ibn Muhammad say, \"I have prayed witr\\n\\t\\t\\t\\tafter dawn.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Only a person who oversleeps so that he does\\n\\t\\t\\t\\tnot do the witr prays it after dawn. No one should\\n\\t\\t\\t\\tintentionally make his witr after dawn.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "29",
    "sectionHeading": "The Two Rakas of Fajr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that Hafsa, the wife of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, told him that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to pray two quick rakas when the muadhdhin\\n\\t\\t\\t\\thad finished the adhan for the subh prayer, before the\\n\\t\\t\\t\\tiqama was said for the prayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "30",
    "sectionHeading": "The Two Rakas of Fajr",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said that A'isha, the\\n\\t\\t\\t\\twife of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, used to pray the two rakas of the\\n\\t\\t\\t\\tdawn (fajr) so quickly that I would say to myself  'Has\\n\\t\\t\\t\\the recited the umm al-Qur'an or not?' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "31",
    "sectionHeading": "The Two Rakas of Fajr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sharik ibn Abdullah\\n\\t\\t\\t\\tibn Abi Namir that Abu Salama ibn Abd ar-Rahman said,\\n\\t\\t\\t\\t\"Some people heard the iqama and started to pray. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, came out and said, 'Are you doing two prayers at\\n\\t\\t\\t\\tthe same time? Are you doing two prayers at the same\\n\\t\\t\\t\\ttime?'\\tThat was about the subh prayer and the two rakas\\n\\t\\t\\t\\tbefore subh.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "32",
    "sectionHeading": "The Two Rakas of Fajr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar missed the two rakas of dawn, and then\\n\\t\\t\\t\\tdid them after the sun rose.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "7",
    "hadithNumber": "33",
    "sectionHeading": "The Two Rakas of Fajr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim that al-Qasim ibn Muhammad had done the same as\\n\\t\\t\\t\\tIbn Umar.\\n\\t\\t\\t</p>"
  }
]
