[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/061001",
        "Body":  "All that is in the heavens and all that is in the earth\n\t\t\tglorifieth Allah, and He is the Mighty, the Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/061010",
        "Body":  "O ye who believe! Shall I show you a commerce that will save you\n\t\t\tfrom a painful doom?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/061011",
        "Body":  "Ye should believe in Allah and His messenger, and should strive\n\t\t\tfor the cause of Allah with your wealth and your lives. That is\n\t\t\tbetter for you, if ye did but know."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/061012",
        "Body":  "He will forgive you your sins and bring you into Gardens\n\t\t\tunderneath which rivers flow, and pleasant dwellings in Gardens\n\t\t\tof Eden. That is the supreme triumph."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/061013",
        "Body":  "And (He will give you) another blessing which ye love: help from\n\t\t\tAllah and present victory. Give good tidings (O Muhammad) to\n\t\t\tbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/061014",
        "Body":  "O ye who believe! Be Allah\u0027s helpers, even as Jesus son of Mary\n\t\t\tsaid unto the disciples: Who are my helpers for Allah? They said:\n\t\t\tWe are Allah\u0027s helpers. And a party of the Children of Israel\n\t\t\tbelieved, while a party disbelieved. Then We strengthened those\n\t\t\twho believed against their foe, and they became the uppermost."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/061002",
        "Body":  "O ye who believe! why say ye that which ye do not?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/061003",
        "Body":  "It is most hateful in the sight of Allah that ye say that which\n\t\t\tye do not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/061004",
        "Body":  "Lo! Allah loveth those who battle for His cause in ranks, as if\n\t\t\tthey were a solid structure."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/061005",
        "Body":  "And (remember) when Moses said unto his people: O my people! Why\n\t\t\tpersecute ye me, when ye well know that I am Allah\u0027s messenger\n\t\t\tunto you? So when they went astray Allah sent their hearts\n\t\t\tastray. And Allah guideth not the evil-living folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/061006",
        "Body":  "And when Jesus son of Mary said: O Children of Israel! Lo! I am\n\t\t\tthe messenger of Allah unto you, confirming that which was\n\t\t\t(revealed) before me in the Torah, and bringing good tidings of a\n\t\t\tmessenger who cometh after me, whose name is the Praised One. Yet\n\t\t\twhen he hath come unto them with clear proofs, they say: This is\n\t\t\tmere magic."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/061007",
        "Body":  "And who doth greater wrong than he who inventeth a lie against\n\t\t\tAllah when he is summoned unto Al-Islam. And Allah guideth not\n\t\t\twrongdoing folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/061008",
        "Body":  "Fain would they put out the light of Allah with their mouths, but\n\t\t\tAllah will perfect His light however much the disbelievers are\n\t\t\taverse."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "61",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/061009",
        "Body":  "He it is who hath sent His messenger with the guidance and the\n\t\t\treligion of truth, that He may make it conqueror of all religion\n\t\t\thowever much idolaters may be averse."
    }
]
