[
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "1",
    "Text": "&#761;This is&#762; a discharge from all obligations,<span class='fn' foot_note=29162>1</span>&nbsp;by Allah and His Messenger, to the polytheists you &#761;believers&#762; have entered into treaties with:"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "2",
    "Text": "&ldquo;You &#761;polytheists&#762; may travel freely through the land for four months, but know that you will have no escape from Allah, and that Allah will disgrace the disbelievers.&rdquo;<span class='fn' foot_note=29163>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "3",
    "Text": "A declaration from Allah and His Messenger &#761;is made&#762; to all people on the day of the greater pilgrimage<span class='fn' foot_note=29164>1</span>&nbsp;that Allah and His Messenger are free of the polytheists. So if you &#761;pagans&#762; repent, it will be better for you. But if you turn away, then know that you will have no escape from Allah. And give good news &#761;O Prophet&#762; to the disbelievers of a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "4",
    "Text": "As for the polytheists who have honoured every term of their treaty with you and have not supported an enemy against you, honour your treaty with them until the end of its term. Surely Allah loves those who are mindful &#761;of Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "5",
    "Text": "But once the Sacred Months have passed, kill the polytheists &#761;who violated their treaties&#762; wherever you find them,<span class='fn' foot_note=29165>1</span>&nbsp;capture them, besiege them, and lie in wait for them on every way. But if they repent, perform prayers, and pay alms-tax, then set them free. Indeed, Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "6",
    "Text": "And if anyone from the polytheists asks for your protection &#761;O Prophet&#762;, grant it to them so they may hear the Word of Allah, then escort them to a place of safety, for they are a people who have no knowledge."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "7",
    "Text": "How can such polytheists have a treaty with Allah and His Messenger, except those you have made a treaty with at the Sacred Mosque?<span class='fn' foot_note=29166>1</span>&nbsp;So, as long as they are true to you, be true to them. Indeed Allah loves those who are mindful &#761;of Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "8",
    "Text": "How &#761;can they have a treaty&#762;? If they were to have the upper hand over you, they would have no respect for kinship or treaty. They only flatter you with their tongues, but their hearts are in denial, and most of them are rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "9",
    "Text": "They chose a fleeting gain over Allah&rsquo;s revelations, hindering &#761;others&#762; from His Way. Evil indeed is what they have done!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "10",
    "Text": "They do not honour the bonds of kinship or treaties with the believers. It is they who are the transgressors."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "11",
    "Text": "But if they repent, perform prayer, and pay alms-tax, then they are your brothers in faith. This is how We make the revelations clear for people of knowledge."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "12",
    "Text": "But if they break their oaths after making a pledge and attack your faith, then fight the champions of disbelief&mdash;who never honour their oaths&mdash;so perhaps they will desist."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "13",
    "Text": "Will you not fight those who have broken their oaths, conspired to expel the Messenger &#761;from Mecca&#762;, and attacked you first? Do you fear them? Allah is more deserving of your fear, if you are &#761;true&#762; believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "14",
    "Text": "&#761;So&#762; fight them and Allah will punish them at your hands, put them to shame, help you overcome them, and soothe the hearts of the believers&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "15",
    "Text": "removing rage from their hearts. And Allah pardons whoever He wills. For Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "16",
    "Text": "Do you &#761;believers&#762; think that you will be left without Allah proving who among you &#761;truly&#762; struggles &#761;in His cause&#762; and never takes trusted allies other than Allah, His Messenger, or the believers? And Allah is All-Aware of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "17",
    "Text": "It is not for the polytheists to maintain the mosques of Allah while they openly profess disbelief. Their deeds are void, and they will be in the Fire forever."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "18",
    "Text": "The mosques of Allah should only be maintained by those who believe in Allah and the Last Day, establish prayer, pay alms-tax, and fear none but Allah. It is right to hope that they will be among the &#761;truly&#762; guided."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "19",
    "Text": "Do you &#761;pagans&#762; consider providing the pilgrims with water and maintaining the Sacred Mosque as equal to believing in Allah and the Last Day and struggling in the cause of Allah? They are not equal in Allah&rsquo;s sight. And Allah does not guide the wrongdoing people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "20",
    "Text": "Those who have believed, emigrated, and strived in the cause of Allah with their wealth and their lives are greater in rank in the sight of Allah. It is they who will triumph."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "21",
    "Text": "Their Lord gives them good news of His mercy, pleasure, and Gardens with everlasting bliss,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "22",
    "Text": "to stay there for ever and ever. Surely with Allah is a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "23",
    "Text": "O believers! Do not take your parents and siblings as trusted allies if they choose disbelief over belief. And whoever of you does so, they are the &#761;true&#762; wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "24",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;If your parents and children and siblings and spouses and extended family and the wealth you have acquired and the trade you fear will decline and the homes you cherish&mdash;&#761;if all these&#762; are more beloved to you than Allah and His Messenger and struggling in His Way, then wait until Allah brings about His Will. Allah does not guide the rebellious people.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "25",
    "Text": "Indeed Allah has given you &#761;believers&#762; victory on many battlefields, even at the Battle of &#7716;unain<span class='fn' foot_note=29167>1</span>&nbsp;when you took pride in your great numbers, but they proved of no advantage to you. The earth, despite its vastness, seemed to close in on you, then you turned back in retreat."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "26",
    "Text": "Then Allah sent down His reassurance<span class='fn' foot_note=29168>1</span>&nbsp;upon His Messenger and the believers, and sent down forces<span class='fn' foot_note=29169>2</span>&nbsp;you could not see, and punished those who disbelieved. Such was the reward of the disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "27",
    "Text": "Then afterwards Allah will turn in grace to whoever He wills.<span class='fn' foot_note=29170>1</span>&nbsp;And Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "28",
    "Text": "O believers! Indeed, the polytheists are &#761;spiritually&#762; impure,<span class='fn' foot_note=29171>1</span>&nbsp;so they should not approach the Sacred Mosque after this year.<span class='fn' foot_note=29172>2</span>&nbsp;If you fear poverty, Allah will enrich you out of His bounty, if He wills. Surely, Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "29",
    "Text": "Fight those who do not believe in Allah and the Last Day, nor comply with what Allah and His Messenger have forbidden, nor embrace the religion of truth from among those who were given the Scripture,<span class='fn' foot_note=29173>1</span>&nbsp;until they pay the tax,<span class='fn' foot_note=29174>2</span>&nbsp;willingly submitting, fully humbled."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "30",
    "Text": "The Jews say, &ldquo;Ezra is the son of Allah,&rdquo; while the Christians say, &ldquo;The Messiah is the son of Allah.&rdquo; Such are their baseless assertions, only parroting the words of earlier disbelievers. May Allah condemn them! How can they be deluded &#761;from the truth&#762;?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "31",
    "Text": "They have taken their rabbis and monks as well as the Messiah, son of Mary, as lords besides Allah,<span class='fn' foot_note=29175>1</span>&nbsp;even though they were commanded to worship none but One God. There is no god &#761;worthy of worship&#762; except Him. Glorified is He above what they associate &#761;with Him&#762;!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "32",
    "Text": "They wish to extinguish Allah&rsquo;s light<span class='fn' foot_note=29176>1</span>&nbsp;with their mouths, but Allah will only allow His light to be perfected, even to the dismay of the disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "33",
    "Text": "He is the One Who has sent His Messenger with &#761;true&#762; guidance and the religion of truth, making it prevail over all others, even to the dismay of the polytheists."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "34",
    "Text": "O believers! Indeed, many rabbis and monks consume people&rsquo;s wealth wrongfully and hinder &#761;others&#762; from the Way of Allah. Give good news of a painful torment to those who hoard gold and silver and do not spend it in Allah&rsquo;s cause."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "35",
    "Text": "The Day &#761;will come&#762; when their treasure will be heated up in the Fire of Hell, and their foreheads, sides, and backs branded with it. &#761;It will be said to them,&#762; &ldquo;This is the treasure you hoarded for yourselves. Now taste what you hoarded!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "36",
    "Text": "Indeed, the number of months ordained by Allah is twelve&mdash;in Allah&rsquo;s Record<span class='fn' foot_note=29177>1</span>&nbsp;since the day He created the heavens and the earth&mdash;of which four are sacred. That is the Right Way. So do not wrong one another during these months. And together fight the polytheists as they fight against you together. And know that Allah is with those mindful &#761;of Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "37",
    "Text": "Reallocating the sanctity of &#761;these&#762; months<span class='fn' foot_note=29178>1</span>&nbsp;is an increase in disbelief, by which the disbelievers are led &#761;far&#762; astray. They adjust the sanctity one year and uphold it in another, only to maintain the number of months sanctified by Allah, violating the very months Allah has made sacred. Their evil deeds have been made appealing to them. And Allah does not guide the disbelieving people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "38",
    "Text": "O believers! What is the matter with you that when you are asked to march forth in the cause of Allah, you cling firmly to &#761;your&#762; land?<span class='fn' foot_note=29179>1</span>&nbsp;Do you prefer the life of this world over the Hereafter? The enjoyment of this worldly life is insignificant compared to that of the Hereafter."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "39",
    "Text": "If you do not march forth, He will afflict you with a painful torment and replace you with other people. You are not harming Him in the least. And Allah is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "40",
    "Text": "&#761;It does not matter&#762; if you &#761;believers&#762; do not support him, for Allah did in fact support him when the disbelievers drove him out &#761;of Mecca&#762; and he was only one of two. While they both were in the cave, he reassured his companion,<span class='fn' foot_note=29180>1</span>&nbsp;&ldquo;Do not worry; Allah is certainly with us.&rdquo; So Allah sent down His serenity upon the Prophet, supported him with forces you &#761;believers&#762; did not see, and made the word of the disbelievers lowest, while the Word of Allah is supreme. And Allah is Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "41",
    "Text": "&#761;O believers!&#762; March forth whether it is easy or difficult for you, and strive with your wealth and your lives in the cause of Allah. That is best for you, if only you knew."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "42",
    "Text": "Had the gain been within reach and the journey shorter, they would have followed you, but the distance seemed too long for them. And they will swear by Allah, &ldquo;Had we been able, we would have certainly joined you.&rdquo; They are ruining themselves. And Allah knows that they are surely lying."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "43",
    "Text": "May Allah pardon you &#761;O Prophet&#762;! Why did you give them permission &#761;to stay behind&#762; before those who told the truth were distinguished from those who were lying?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "44",
    "Text": "Those who believe in Allah and the Last Day do not ask for exemption from striving with their wealth and their lives. And Allah has perfect knowledge of those who are mindful &#761;of Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "45",
    "Text": "No one would ask for exemption except those who have no faith in Allah or the Last Day, and whose hearts are in doubt, so they are torn by their doubts."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "46",
    "Text": "Had they &#761;really&#762; intended to march forth, they would have made preparations for it. But Allah disliked that they should go, so He let them lag behind, and it was said &#761;to them&#762;, &ldquo;Stay with those &#761;helpless&#762; who remain behind.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "47",
    "Text": "Had they gone forth with you &#761;believers&#762;, they would have been nothing but trouble for you, and would have scrambled around, seeking to spread discord in your midst. And some of you would have eagerly listened to them. And Allah has &#761;perfect&#762; knowledge of the wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "48",
    "Text": "They had already sought to spread discord before<span class='fn' foot_note=29181>1</span>&nbsp;and devised every &#761;possible&#762; plot against you &#761;O Prophet&#762;, until the truth came and Allah&rsquo;s Will prevailed&mdash;much to their dismay."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "49",
    "Text": "There are some of them who say, &ldquo;Exempt me and do not expose me to temptation.&rdquo;<span class='fn' foot_note=29182>1</span>&nbsp;They have already fallen into temptation. And Hell will surely engulf the disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "50",
    "Text": "If a blessing befalls you &#761;O Prophet&#762;, they grieve, but if a disaster befalls you, they say, &ldquo;We took our precaution in advance,&rdquo; and turn away, rejoicing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "51",
    "Text": "Say, &ldquo;Nothing will ever befall us except what Allah has destined for us. He is our Protector.&rdquo; So in Allah let the believers put their trust."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "52",
    "Text": "Say, &ldquo;Are you awaiting anything to befall us except one of the two best things: &#761;victory or martyrdom&#762;? But&nbsp;We are awaiting Allah to afflict you with torment either from Him or at our hands. So keep waiting! We too are waiting with you.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "53",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;&#761;Whether you&#762; donate willingly or unwillingly, it will never be accepted from you, for you have been a rebellious people.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "54",
    "Text": "And what prevented their donations from being accepted is that they have lost faith in Allah and His Messenger, they never come to prayer except half-heartedly, and they never donate except resentfully."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "55",
    "Text": "So let neither their wealth nor children impress you &#761;O Prophet&#762;. Allah only intends to torment them through these things in this worldly life, then their souls will depart while they are disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "56",
    "Text": "They swear by Allah that they are part of you, but they are not. They only say so out of fear."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "57",
    "Text": "If only they could find a refuge, or a cave, or any hiding-place, they would rush headlong towards it."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "58",
    "Text": "There are some of them who are critical of your distribution of alms &#761;O Prophet&#762;. If they are given some of it they are pleased, but if not they are enraged."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "59",
    "Text": "If only they had been content with what Allah and His Messenger had given them and said, &ldquo;Allah is sufficient for us! Allah will grant us out of His bounty, and so will His Messenger. To Allah &#761;alone&#762; we turn with hope.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "60",
    "Text": "Alms-tax is only for the poor and the needy, for those employed to administer it, for those whose hearts are attracted &#761;to the faith&#762;, for &#761;freeing&#762; slaves, for those in debt, for Allah&rsquo;s cause, and for &#761;needy&#762; travellers. &#761;This is&#762; an obligation from Allah. And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "61",
    "Text": "And there are others who hurt the Prophet by saying, &ldquo;He listens to anyone.&rdquo; Say, &#761;O Prophet,&#762; &ldquo;He listens to what is best for you. He believes in Allah, has faith in the believers, and is a mercy for those who believe among you.&rdquo; Those who hurt Allah&rsquo;s Messenger will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "62",
    "Text": "They swear by Allah to you &#761;believers&#762; in order to please you, while it is the pleasure of Allah and His Messenger they should seek, if they are &#761;true&#762; believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "63",
    "Text": "Do they not know that whoever opposes Allah and His Messenger will be in the Fire of Hell forever? That is the ultimate disgrace."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "64",
    "Text": "The hypocrites fear that a s&ucirc;rah&nbsp;should be revealed about them, exposing what is in their hearts. Say, &#761;O Prophet,&#762; &ldquo;Keep mocking! Allah will definitely bring to light what you fear.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "65",
    "Text": "If you question them, they will certainly say, &ldquo;We were only talking idly and joking around.&rdquo; Say, &ldquo;Was it Allah, His revelations, and His Messenger that you ridiculed?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "66",
    "Text": "Make no excuses! You have lost faith after your belief. If We pardon a group of you,<span class='fn' foot_note=29183>1</span>&nbsp;We will punish others for their wickedness."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "67",
    "Text": "The hypocrites, both men and women, are all alike: they encourage what is evil, forbid what is good, and withhold &#761;what is in&#762; their hands. They neglected Allah, so He neglected them. Surely the hypocrites are the rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "68",
    "Text": "Allah has promised the hypocrites, both men and women, and the disbelievers an everlasting stay in the Fire of Hell&mdash;it is sufficient for them. Allah has condemned them, and they will suffer a never-ending punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "69",
    "Text": "&#761;You hypocrites are&#762; like those &#761;disbelievers&#762; before you. They were far superior to you in might and more abundant in wealth and children. They enjoyed their share in this life. You have enjoyed your share, just as they did. And you have engaged in idle talk, just as they did. Their deeds have become void in this world and the Hereafter. And it is they who are the &#761;true&#762; losers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "70",
    "Text": "Have they not received the stories of those &#761;destroyed&#762; before them: the people of Noah, &rsquo;&Acirc;d, and Tham&ucirc;d, the people of Abraham, the residents of Midian, and the overturned cities &#761;of Lot&#762;?<span class='fn' foot_note=29184>1</span>&nbsp;Their messengers came to them with clear proofs. Allah would have never wronged them, but it was they who wronged themselves."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "71",
    "Text": "The believers, both men and women, are guardians of one another. They encourage good and forbid evil, establish prayer and pay alms-tax, and obey Allah and His Messenger. It is they who will be shown Allah&rsquo;s mercy. Surely Allah is Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "72",
    "Text": "Allah has promised the believers, both men and women, Gardens under which rivers flow, to stay there forever, and splendid homes in the Gardens of Eternity, and&mdash;above all&mdash;the pleasure of Allah. That is &#761;truly&#762; the ultimate triumph."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "73",
    "Text": "O Prophet! Struggle against the disbelievers and the hypocrites, and be firm with them. Hell will be their home. What an evil destination!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "74",
    "Text": "They swear by Allah that they never said anything &#761;blasphemous&#762;, while they did in fact utter a blasphemy, lost faith after accepting Islam, and plotted what they could not carry out.<span class='fn' foot_note=29185>1</span>&nbsp;It is only through resentment that they pay Allah and His Messenger back for enriching them out of His bounty! If they repent, it will be better for them. But if they turn away, Allah will torment them with a painful punishment in this world and the Hereafter, and they will have no one on earth to protect or help them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "75",
    "Text": "And there are some who had made a vow to Allah: &ldquo;If He gives us from His bounty, we will surely spend in charity and be of the righteous.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "76",
    "Text": "But when He gave them out of His bounty, they withheld it and turned away indifferently."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "77",
    "Text": "So He caused hypocrisy to plague their hearts until the Day they will meet Him, for breaking their promise to Allah and for their lies."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "78",
    "Text": "Do they not know that Allah &#761;fully&#762; knows their &#761;evil&#762; thoughts and secret talks, and that Allah is the Knower of all unseen?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "79",
    "Text": "&#761;There are&#762; those who slander &#761;some of&#762; the believers for donating liberally and mock others for giving only the little they can afford. Allah will throw their mockery back at them, and they will suffer a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "80",
    "Text": "&#761;It does not matter&#762; whether you &#761;O Prophet&#762; pray for them to be forgiven or not. Even if you pray for their forgiveness seventy times, Allah will never forgive them. That is because they have lost faith in Allah and His Messenger. And Allah does not guide the rebellious people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "81",
    "Text": "Those &#761;hypocrites&#762; who remained behind rejoiced for doing so in defiance of the Messenger of Allah and hated &#761;the prospect of&#762; striving with their wealth and their lives in the cause of Allah. They said &#761;to one another&#762;, &ldquo;Do not march forth in the heat.&rdquo; Say, &#761;O Prophet,&#762; &ldquo;The Fire of Hell is far hotter!&rdquo; If only they could comprehend!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "82",
    "Text": "So let them laugh a little&mdash;they will weep much as a reward for what they have committed."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "83",
    "Text": "If Allah returns you &#761;O Prophet&#762; to a group of them and they ask to go forth with you, say, &ldquo;You will not ever go forth or fight an enemy along with me. You preferred to stay behind the first time, so stay with those &#761;helpless&#762; who remain behind.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "84",
    "Text": "And do not ever offer &#761;funeral&#762; prayers for any of their dead, nor stand by their grave &#761;at burial&#762;, for they have lost faith in Allah and His Messenger and died rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "85",
    "Text": "And let neither their wealth nor children impress you &#761;O Prophet&#762;. Allah only intends to torment them through these things in this world, and &#761;then&#762; their souls will depart while they are disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "86",
    "Text": "Whenever a s&ucirc;rah&nbsp;is revealed stating, &ldquo;Believe in Allah and struggle along with His Messenger,&rdquo; the rich among them would ask to be exempt, saying, &ldquo;Leave us with those who remain behind.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "87",
    "Text": "They preferred to stay behind with the helpless, and their hearts have been sealed so they do not comprehend."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "88",
    "Text": "But the Messenger and the believers with him strived with their wealth and their lives. They will have all the best, and it is they who will be successful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "89",
    "Text": "Allah has prepared for them Gardens under which rivers flow, to stay there forever. That is the ultimate triumph."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "90",
    "Text": "Some nomadic Arabs &#761;also&#762; came with excuses, seeking exemption. And those who were untrue to Allah and His Messenger remained behind &#761;with no excuse&#762;. The unfaithful among them will be afflicted with a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "91",
    "Text": "There is no blame on the weak, the sick, or those lacking the means &#761;if they stay behind&#762;, as long as they are true to Allah and His Messenger. There is no blame on the good-doers. And Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "92",
    "Text": "Nor &#761;is there any blame on&#762; those who came to you &#761;O Prophet&#762; for mounts, then when you said, &ldquo;I can find no mounts for you,&rdquo; they left with eyes overflowing with tears out of grief that they had nothing to contribute."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "93",
    "Text": "Blame is only on those who seek exemption from you although they have the means. They preferred to stay behind with the helpless, and Allah has sealed their hearts so they do not realize &#761;the consequences&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "94",
    "Text": "They will make excuses to you &#761;believers&#762; when you return to them. Say, &ldquo;Make no excuses, &#761;for&#762; we will not believe you. Allah has already informed us about your &#761;true&#762; state &#761;of faith&#762;. Your &#761;future&#762; deeds will be observed by Allah and His Messenger as well. And you will be returned to the Knower of the seen and unseen, then He will inform you of what you used to do.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "95",
    "Text": "When you return, they will swear to you by Allah so that you may leave them alone. So leave them alone&mdash;they are truly evil. Hell will be their home as a reward for what they have committed."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "96",
    "Text": "They will swear to you in order to please you. And even if you are pleased with them, Allah will never be pleased with the rebellious people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "97",
    "Text": "The nomadic Arabs &#761;around Medina&#762; are far worse in disbelief and hypocrisy, and less likely to know the laws revealed by Allah to His Messenger. And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "98",
    "Text": "And among the nomads are those who consider what they donate to be a loss and await your misfortune. May ill-fortune befall them! And Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "99",
    "Text": "However, among the nomadic Arabs are those who believe in Allah and the Last Day, and consider what they donate as a means of coming closer to Allah and &#761;receiving&#762; the prayers of the Messenger. It will certainly bring them closer. Allah will admit them into His mercy. Surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "100",
    "Text": "As for the foremost&mdash;the first of the Emigrants<span class='fn' foot_note=29186>1</span>&nbsp;and the Helpers<span class='fn' foot_note=29187>2</span>&mdash;and those who follow them in goodness, Allah is pleased with them and they are pleased with Him. And He has prepared for them Gardens under which rivers flow, to stay there for ever and ever. That is the ultimate triumph."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "101",
    "Text": "Some of the nomads around you &#761;believers&#762; are hypocrites, as are some of the people of Medina. They have mastered hypocrisy. They are not known to you &#761;O Prophet&#762;; they are known to Us. We will punish them twice &#761;in this world&#762;,<span class='fn' foot_note=29188>1</span>&nbsp;then they will be brought back &#761;to their Lord&#762; for a tremendous punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "102",
    "Text": "Some others have confessed their wrongdoing: they have mixed goodness with evil.<span class='fn' foot_note=29189>1</span>&nbsp;It is right to hope that Allah will turn to them in mercy. Surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "103",
    "Text": "Take from their wealth &#761;O Prophet&#762; charity to purify and bless them, and pray for them&mdash;surely your prayer is a source of comfort for them. And Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "104",
    "Text": "Do they not know that Allah alone accepts the repentance of His servants and receives &#761;their&#762; charity, and that Allah alone is the Accepter of Repentance, Most Merciful?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "105",
    "Text": "Tell &#761;them, O &nbsp;Prophet&#762;, &ldquo;Do as you will. Your deeds will be observed by Allah, His Messenger, and the believers. And you will be returned to the Knower of the seen and unseen, then He will inform you of what you used to do.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "106",
    "Text": "And some others are left for Allah&rsquo;s decision, either to punish them or turn to them in mercy.<span class='fn' foot_note=29190>1</span>&nbsp;And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "107",
    "Text": "There are also those &#761;hypocrites&#762; who set up a mosque &#761;only&#762; to cause harm, promote disbelief, divide the believers, and as a base for those who had previously fought against Allah and His Messenger.<span class='fn' foot_note=29191>1</span>&nbsp;They will definitely swear, &ldquo;We intended nothing but good,&rdquo; but Allah bears witness that they are surely liars."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "108",
    "Text": "Do not &#761;O Prophet&#762; ever pray in it. Certainly, a mosque founded on righteousness from the first day is more worthy of your prayers. In it are men who love to be purified.<span class='fn' foot_note=29192>1</span>&nbsp;And Allah loves those who purify themselves."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "109",
    "Text": "Which is better: those who laid the foundation of their building on the fear and pleasure of Allah, or those who did so on the edge of a crumbling cliff that tumbled down with them into the Fire of Hell? And Allah does not guide the wrongdoing people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "110",
    "Text": "The building which they erected will never cease to fuel hypocrisy in their hearts until their hearts are torn apart. And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "111",
    "Text": "Allah has indeed purchased from the believers their lives and wealth in exchange for Paradise. They fight in the cause of Allah and kill or are killed. This is a true promise binding on Him in the Torah, the Gospel, and the Quran. And whose promise is truer than Allah&rsquo;s? So rejoice in the exchange you have made with Him. That is &#761;truly&#762; the ultimate triumph."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "112",
    "Text": "&#761;It is the believers&#762; who repent, who are devoted to worship, who praise &#761;their Lord&#762;, who fast, who bow down and prostrate themselves, who encourage good and forbid evil, and who observe the limits set by Allah. And give good news to the believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "113",
    "Text": "It is not &#761;proper&#762; for the Prophet and the believers to seek forgiveness for the polytheists, even if they were close relatives, after it has become clear to the believers that they are bound for the Hellfire."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "114",
    "Text": "As for Abraham&rsquo;s prayer for his father&rsquo;s forgiveness, it was only in fulfilment of a promise he had made to him. But when it became clear to Abraham that his father was an enemy of Allah, he broke ties with him.<span class='fn' foot_note=29193>1</span>&nbsp;Abraham was truly tender-hearted, forbearing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "115",
    "Text": "Allah would never consider a people deviant after He has guided them, until He makes clear to them what they must avoid. Surely Allah has &#761;full&#762; knowledge of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "116",
    "Text": "Indeed, to Allah &#761;alone&#762; belongs the kingdom of the heavens and the earth. He gives life and causes death. And besides Allah you have no guardian or helper."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "117",
    "Text": "Allah has certainly turned in mercy to the Prophet<span class='fn' foot_note=29194>1</span>&nbsp;as well as the Emigrants and the Helpers who stood by him in the time of hardship, after the hearts of a group of them had almost faltered. He then accepted their repentance. Surely He is Ever Gracious and Most Merciful to them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "118",
    "Text": "And &#761;Allah has also turned in mercy to&#762; the three who had remained behind, &#761;whose guilt distressed them&#762; until the earth, despite its vastness, seemed to close in on them, and their souls were torn in anguish. They knew there was no refuge from Allah except in Him. Then He turned to them in mercy so that they might repent. Surely Allah &#761;alone&#762; is the Accepter of Repentance, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "119",
    "Text": "O &nbsp;believers! Be mindful of Allah and be with the truthful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "120",
    "Text": "It was not &#761;proper&#762; for the people of Medina and the nomadic Arabs around them to avoid marching with the Messenger of Allah or to prefer their own lives above his. That is because whenever they suffer from thirst, fatigue, or hunger in the cause of Allah; or tread on a territory, unnerving the disbelievers; or inflict any loss on an enemy&mdash;it is written to their credit as a good deed. Surely Allah never discounts the reward of the good-doers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "121",
    "Text": "And whenever they make a donation, small or large, or cross a valley &#761;in Allah&rsquo;s cause&#762;&mdash;it is written to their credit, so that Allah may grant them the best reward for what they used to do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "122",
    "Text": "&#761;However,&#762; it is not necessary for the believers to march forth all at once. Only a party from each group should march forth, leaving the rest to gain religious knowledge then enlighten their people when they return to them, so that they &#761;too&#762; may beware &#761;of evil&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "123",
    "Text": "O believers! Fight the disbelievers around you and let them find firmness in you. And know that Allah is with those mindful &#761;of Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "124",
    "Text": "Whenever a s&ucirc;rah&nbsp;is revealed, some of them ask &#761;mockingly&#762;, &ldquo;Which of you has this increased in faith?&rdquo; As for the believers, it has increased them in faith and they rejoice."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "125",
    "Text": "But as for those with sickness in their hearts,<span class='fn' foot_note=29195>1</span>&nbsp;it has increased them only in wickedness upon their wickedness, and they die as disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "126",
    "Text": "Do they not see that they are tried once or twice every year?<span class='fn' foot_note=29196>1</span>&nbsp;Yet they neither repent nor do they learn a lesson."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "127",
    "Text": "Whenever a s&ucirc;rah&nbsp;is revealed, they look at one another, &#761;saying,&#762; &ldquo;Is anyone watching you?&rdquo; Then they slip away. &#761;It is&#762; Allah &#761;Who&#762; has turned their hearts away because they are a people who do not comprehend."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "128",
    "Text": "There certainly has come to you a messenger from among yourselves. He is concerned by your suffering, anxious for your well-being, and gracious and merciful to the believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "9",
    "AyahNumber": "129",
    "Text": "But if they turn away, then say, &#761;O Prophet,&#762; &ldquo;Allah is sufficient for me. There is no god &#761;worthy of worship&#762; except Him. In Him I put my trust. And He is the Lord of the Mighty Throne.&rdquo;"
  }
]
