[
  {
    "SurahNumber": "88",
    "AyahNumber": "1",
    "NoteID": "6096",
    "Body": "Gashiya: the thing or event that overshadows or\\n\\t\\t\\t\\toverwhelms, that covers over or makes people lose their\\n\\t\\t\\t\\tsenses. In xii. 107, it is described as the \"covering\\n\\t\\t\\t\\tveil of the Wrath of Allah\": where see n. 1790. The Day\\n\\t\\t\\t\\tof Judgment is indicated, as the Event of overwhenning\\n\\t\\t\\t\\timportance in which all our petty differences of this\\n\\t\\t\\t\\timperfect world are covered over and overwhelmed in a new\\n\\t\\t\\t\\tworld of perfect justice and truth."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "2",
    "NoteID": "6097",
    "Body": "Cf. lxxv. 22, 24."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "3",
    "NoteID": "6098",
    "Body": "On the faces of the wicked will appear the hard labour\\n\\t\\t\\t\\tand consequent fatigue of the task they will have in\\n\\t\\t\\t\\tbattling against the fierce Fire which their own Deeds\\n\\t\\t\\t\\twill have kindled."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "6",
    "NoteID": "6099",
    "Body": "The root-meaning implies again the idea of humiliation.\\n\\t\\t\\t\\tIt is a plant, bitter and thorny, loathsome in smell and\\n\\t\\t\\t\\tappearance, which will neither give fattening nourishment\\n\\t\\t\\t\\tto the body nor in any way satisfy the burning pangs of\\n\\t\\t\\t\\thunger,-a fit plant for Hell, like Zaqqum (lvi. 52; or\\n\\t\\t\\t\\txvii. 60, n. 2250)."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "9",
    "NoteID": "6100",
    "Body": "Notice the parallelism in contrast, between the fate of\\n\\t\\t\\t\\tthe Wicked and that of the Righteous. In the one case\\n\\t\\t\\t\\tthere was humiliation in their faces; in the other, there\\n\\t\\t\\t\\tis joy; where there was labour and weariness in warding\\n\\t\\t\\t\\toff the Fire, there is instead a healthy Striving, which\\n\\t\\t\\t\\tis itself pleasurable, -a Striving which is a pleasant\\n\\t\\t\\t\\tconsequence of the spiritual Endeavour in the earthly\\n\\t\\t\\t\\tlife, which may have brought trouble or persecution from\\n\\t\\t\\t\\twithout, but which brought inward peace and satisfaction."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "10",
    "NoteID": "6101",
    "Body": "The most important point is their inward state of joy and\\n\\t\\t\\t\\tsatisfaction, mentioned in verses 8-9. Now are mentioned\\n\\t\\t\\t\\tthe outer things of bliss, the chief of which is the\\n\\t\\t\\t\\tGarden. The Garden is in contrast to the Fire. Its chief\\n\\t\\t\\t\\tbeauty will be that they will hear there nothing\\n\\t\\t\\t\\tunbecoming, or foolish, or vain. It will be a Garden on\\n\\t\\t\\t\\thigh, in all senses,-fit for the best, highest, and\\n\\t\\t\\t\\tnoblest."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "12",
    "NoteID": "6102",
    "Body": "Instead of the boiling hot spring (verse 5) there will be\\n\\t\\t\\t\\ta bubbling spring of sparkling water. Instead of the\\n\\t\\t\\t\\tgrovelling and grumbling in the place of Wrath, there\\n\\t\\t\\t\\tWill be couches, with all the accompaniments of a\\n\\t\\t\\t\\tbrilliant assembly."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "17",
    "NoteID": "6103",
    "Body": "In case men neglect the Hereafter as of no account, they\\n\\t\\t\\t\\tare asked to contemplate four things, which they can see\\n\\t\\t\\t\\tin every-day life, and which are full of meaning, high\\n\\t\\t\\t\\tdesign, and the goodness of Allah to man. The first\\n\\t\\t\\t\\tmentioned is the domesticated animal, which for Arab\\n\\t\\t\\t\\tcountries is par excellence the Camel. What a wonderful\\n\\t\\t\\t\\tstructure has this Ship of the Desert? He can store water\\n\\t\\t\\t\\tin his stomach for days. He can live on dry and thorny\\n\\t\\t\\t\\tdesert shrubs. His limbs are adapted to his life. He can\\n\\t\\t\\t\\tcarry men and goods. His flesh can be eaten. Camel's hair\\n\\t\\t\\t\\tcan be used in weaving. And withal, he is so gentle! Who\\n\\t\\t\\t\\tcan sing his praises enough?"
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "18",
    "NoteID": "6104",
    "Body": "The second thing they should consider is the noble blue\\n\\t\\t\\t\\tvault high above them,-with the sun and moon, the stars\\n\\t\\t\\t\\tand planets, and other heavenly bodies. This scene is\\n\\t\\t\\t\\tfull of beauty and magnificence, design and order,\\n\\t\\t\\t\\tplainness and mystery. And yet we receive our light and\\n\\t\\t\\t\\twarmth from the sun, and what would our physical lives be\\n\\t\\t\\t\\twithout these influences that come from such enormous\\n\\t\\t\\t\\tdistance&amp;"
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "19",
    "NoteID": "6105",
    "Body": "From every-day utility and affection in the Camel, to the\\n\\t\\t\\t\\tutility in grandeur in the heavens above us, we had two\\n\\t\\t\\t\\tinstances touching our individual as well as our social\\n\\t\\t\\t\\tlives. In the third instance, in the Mountains we come to\\n\\t\\t\\t\\tthe utility to human kind generally in the services the\\n\\t\\t\\t\\tMountains perform in storing water, in moderating\\n\\t\\t\\t\\tclimate, and in various other ways which it is the\\n\\t\\t\\t\\tbusiness of Physical Geography to investigate and\\n\\t\\t\\t\\tdescribe."
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "20",
    "NoteID": "6106",
    "Body": "The fourth and last instance given is that of the Earth\\n\\t\\t\\t\\tas a whole, the habitation of mankind in our present\\n\\t\\t\\t\\tphase of life. The Earth is a globe, and yet how\\n\\t\\t\\t\\tmarvellously it seems to be spread out before us in\\n\\t\\t\\t\\tplains, valleys, hills, deserts, seas, etc! Can man,\\n\\t\\t\\t\\tseeing these things, fail to see a Plan and Purpose in\\n\\t\\t\\t\\this life, or fail to tum to the great Creator before Whom\\n\\t\\t\\t\\the will have to give an account after this life is done?"
  },
  {
    "SurahNumber": "88",
    "AyahNumber": "22",
    "NoteID": "6107",
    "Body": "The Prophet of Allah is sent to teach and direct people\\n\\t\\t\\t\\ton the way. He is not sent to force their will, or to\\n\\t\\t\\t\\tpunish them, except in so far as he may receive authority\\n\\t\\t\\t\\tto do so. Punishment belongs to Allah alone. And\\n\\t\\t\\t\\tPunishment is certain in the Hereafter, when true values\\n\\t\\t\\t\\twill be restored."
  }
]
