[
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "1",
    "sectionHeading": "Sighting the New Moon for Beginning and Ending the Fast of Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, once mentioned Ramadan and said, \"Do\\n\\t\\t\\t\\tnot begin the fast until you see the new moon, and do not\\n\\t\\t\\t\\tbreak the fast (at the end of Ramadan) until you see it.\\n\\t\\t\\t\\tIf the new moon is obscured from you, then work out (when\\n\\t\\t\\t\\tit should be).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "2",
    "sectionHeading": "Sighting the New Moon for Beginning and Ending the Fast of Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"A month has\\n\\t\\t\\t\\ttwenty-nine days in it. Do not start the fast or break it\\n\\t\\t\\t\\tuntil you see the new moon. If the new moon is obscured\\n\\t\\t\\t\\tfrom you, then work out (when it should be).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "3",
    "sectionHeading": "Sighting the New Moon for Beginning and Ending the Fast of Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thawr ibn Zayd\\n\\t\\t\\t\\tad-Dili from Abdullah ibn Abbas that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, once\\n\\t\\t\\t\\tmentioned Ramadan and said, \"Do not start the fast or\\n\\t\\t\\t\\tbreak it until you see the new moon. If the new moon is\\n\\t\\t\\t\\tobscured from you, then complete a full thirty days.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "4",
    "sectionHeading": "Sighting the New Moon for Beginning and Ending the Fast of Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tonce in the time of Uthman ibn Affan the new moon had\\n\\t\\t\\t\\tbeen seen in the afternoon and Uthman did not break his\\n\\t\\t\\t\\tfast until evening had come and the sun had set.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say that some one who\\n\\t\\t\\t\\tsees the new moon of Ramadan when he is on his own should\\n\\t\\t\\t\\tstart the fast and not break it if he knows that that day\\n\\t\\t\\t\\tis part of Ramadan. He added, \"Some one who sees the new\\n\\t\\t\\t\\tmoon of Shawwal when he is on his own does not break the\\n\\t\\t\\t\\tfast, because people suspect the reliability of someone\\n\\t\\t\\t\\tamong them who breaks the fast. Such people should say,\\n\\t\\t\\t\\twhen they sight the new moon, 'We have seen the new\\n\\t\\t\\t\\tmoon.' Whoever sees the new moon of Shawwal during the\\n\\t\\t\\t\\tday should not break his fast but should continue fasting\\n\\t\\t\\t\\tfor the rest of that day. This is because it is really\\n\\t\\t\\t\\tthe new moon of the night that is coming .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"If people are\\n\\t\\t\\t\\tfasting on the day of Fitr thinking that it is still\\n\\t\\t\\t\\tRamadan and then definite evidence comes to them that the\\n\\t\\t\\t\\tnew moon of Ramadan had been seen one day before they\\n\\t\\t\\t\\tbegan to fast and that they are now into the thirty-first\\n\\t\\t\\t\\tday, then they should break the fast on that day at\\n\\t\\t\\t\\twhatever time the news comes to them. However, they do\\n\\t\\t\\t\\tnot pray the id prayer if they hear the news after the\\n\\t\\t\\t\\tsun has begun to decline.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "5",
    "sectionHeading": "Making the Intention to Fast Before Dawn",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Only some one who makes the\\n\\t\\t\\t\\tintention to fast before dawn (actually) fasts.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tA'isha and Hafsa, the wives of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, also said that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "6",
    "sectionHeading": "Being Quick to Break the Fast",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Hazim ibn Dinar\\n\\t\\t\\t\\tfrom Sahl ibn Sad as Saidi that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"People\\n\\t\\t\\t\\twill remain in good as long as they are quick to break\\n\\t\\t\\t\\tthe fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "7",
    "sectionHeading": "Being Quick to Break the Fast",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tHarmala al-Aslami from Said ibn al-Musayyab that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"People will remain in good as long as they\\n\\t\\t\\t\\tare quick to break the fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "8",
    "sectionHeading": "Being Quick to Break the Fast",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tHumayd ibn Abd ar-Rahman that Umar ibn al-Khattab and\\n\\t\\t\\t\\tUthman ibn Affan would pray maghrib when they saw the\\n\\t\\t\\t\\tnight darkening, before they broke their fast, and that\\n\\t\\t\\t\\twas during Ramadan.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "9",
    "sectionHeading": "Fasting When Junub in the Morning during Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Mamar al-Ansari from Abu Yunus, the mawla\\n\\t\\t\\t\\tof A'isha, from  A'isha that she overheard a man standing\\n\\t\\t\\t\\tat the door saying to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, \"Messenger of Allah, I get\\n\\t\\t\\t\\tup in the morning junub, in a state of major ritual\\n\\t\\t\\t\\timpurity, and want to fast,\" and the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"I too get\\n\\t\\t\\t\\tup in the morning junub and want to fast, so I do ghusl\\n\\t\\t\\t\\tand fast.\"  The man said to him, \"You are not the same as\\n\\t\\t\\t\\tus. Allah has forgiven you all your wrong actions that\\n\\t\\t\\t\\thave gone before and those that have come after.\"  The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, got angry and said, \"By Allah, I hope that I am\\n\\t\\t\\t\\tthe most fearful of you with respect to Allah and the\\n\\t\\t\\t\\tmost knowledgeable of you in how I have taqwa.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "10",
    "sectionHeading": "Fasting When Junub in the Morning during Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd Rabbih ibn Said\\n\\t\\t\\t\\tfrom Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham\\n\\t\\t\\t\\tfrom A'isha and Umm Salama, the wives of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, that the Prophet,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, used to get up\\n\\t\\t\\t\\tin the morning\\tjunub from intercourse, not a dream, in\\n\\t\\t\\t\\tRamadan, and then he would fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "11",
    "sectionHeading": "Fasting When Junub in the Morning during Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham that\\n\\t\\t\\t\\the heard Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn\\n\\t\\t\\t\\tHisham say, \"My father and I were with Marwan ibn al\\n\\t\\t\\t\\tHakam at the time when he was amir of Madina, and someone\\n\\t\\t\\t\\tmentioned to him that Abu Hurayra used to say, 'If\\n\\t\\t\\t\\tsomeone begins the morning junub, he has broken the fast\\n\\t\\t\\t\\tfor that day.'\\tMarwan said, 'I swear to you,\\n\\t\\t\\t\\tAbdar-Rahman, you must go to the two umm al muminin,\\n\\t\\t\\t\\tA'isha and Umm Salama, and ask them about it.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t''Abd ar-Rahman went to visit A'isha and I accompanied\\n\\t\\t\\t\\thim. He greeted her and then said, 'Umm al-muminin, we\\n\\t\\t\\t\\twere with Marwan ibn al Hakam and someone mentioned to\\n\\t\\t\\t\\thim that Abu Hurayra used to say that if some one had\\n\\t\\t\\t\\tbegun the morning junub, he had broken the fast for that\\n\\t\\t\\t\\tday.' A'isha said, 'It is not as Abu Hurayra says Abd\\n\\t\\t\\t\\tar-Rahman. Do you dislike what the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, used to do?',\\n\\t\\t\\t\\tand Abd ar-Rahman said, 'No, by Allah.' A'isha said, 'I\\n\\t\\t\\t\\tbear witness that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, used to get up in the morning\\n\\t\\t\\t\\tjunub from intercourse, not a dream, and would then fast\\n\\t\\t\\t\\tfor that day.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe continued, \"Then we went and visited Umm Salama, and\\n\\t\\t\\t\\tAbd ar-Rahman asked her about the same matter and she\\n\\t\\t\\t\\tsaid the same as A'isha had said. Then we went off until\\n\\t\\t\\t\\twe came to Marwan ibn al-Hakam Abd ar-Rahman told him\\n\\t\\t\\t\\twhat they had both said and Marwan said, 'I swear to you,\\n\\t\\t\\t\\tAbu Muhammad, you must use the mount which is at the\\n\\t\\t\\t\\tdoor, and go to Abu Hurayra, who is on his land at al\\n\\t\\t\\t\\tAqiq, and tell him this.' So Abd ar-Rahman rode off, and\\n\\t\\t\\t\\tI went with him, until we came to Abu Hurayra. Abd\\n\\t\\t\\t\\tar-Rahman talked with him for a while, and then mentioned\\n\\t\\t\\t\\tthe matter to him, and Abu Hurayra said, 'I don't know\\n\\t\\t\\t\\tanything about it. I was just told that by someone.'\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "12",
    "sectionHeading": "Fasting When Junub in the Morning during Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr, from Abu Bakr ibn Abd ar-Rahman that A'isha and\\n\\t\\t\\t\\tUmm Salama, the wives of the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"The Messengerof Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, used to get up in\\n\\t\\t\\t\\tthe morning junub from intercourse, not a dream, and\\n\\t\\t\\t\\twould then fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "13",
    "sectionHeading": "Permission for a Fasting Man to Kiss",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that a certain man kissed his wife while he\\n\\t\\t\\t\\twas fasting in Ramadan. This made him very anxious, and\\n\\t\\t\\t\\tso he sent his wife to the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, to ask him about that for him. She\\n\\t\\t\\t\\twent in and saw Umm Salama, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, and mentioned the\\n\\t\\t\\t\\tmatter to her, and Umm Salama told her that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, used\\n\\t\\t\\t\\tto kiss while he was fasting. So she went back and told\\n\\t\\t\\t\\ther husband that, but it only made him find fault all the\\n\\t\\t\\t\\tmore and he said, \"We are not like the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace. Allah\\n\\t\\t\\t\\tmakes permissible for the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, whatever He wishes.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHis wife then went back to Umm Salama and found the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, with her. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"What's the matter with\\n\\t\\t\\t\\tthis woman?\", and Umm Salama told him. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Didn't you tell her that I do that myself?\" and she\\n\\t\\t\\t\\tsaid, \"I told her, and she went to her husband and told\\n\\t\\t\\t\\thim, but it only made him find fault all the more and\\n\\t\\t\\t\\tsay, 'We are not like the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace. Allah makes permissible\\n\\t\\t\\t\\tfor His Messenger, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, whatever He wishes.' \" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, got angry and said,\\n\\t\\t\\t\\t\"By Allah, I am the one with the most taqwa of Allah of\\n\\t\\t\\t\\tyou all, and of you all the one who best knows His\\n\\t\\t\\t\\tlimits.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "14",
    "sectionHeading": "Permission for a Fasting Man to Kiss",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, umm al-muminin, may Allah be\\n\\t\\t\\t\\tpleased with her, said, \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, used to kiss certain\\n\\t\\t\\t\\tof his wives when fasting,\" and then she laughed.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "15",
    "sectionHeading": "Permission for a Fasting Man to Kiss",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAtika bint Zayd ibn Amr ibn Nufayl, the wife of Umar ibn\\n\\t\\t\\t\\tal-Khattab, used to kiss Umar ibn al-Khattab's head while\\n\\t\\t\\t\\the was fasting, and he did not tell her not to.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "16",
    "sectionHeading": "Permission for a Fasting Man to Kiss",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n-Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah that A'isha bint Talha told him\\n\\t\\t\\t\\tthat she was once with A'isha, the wife of the Prophet,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, and her husband,\\n\\t\\t\\t\\twho was fasting, came and visited her there. (He was\\n\\t\\t\\t\\tAbdullah ibn Abd ar-Rahman ibn Abi Bakras-Siddiq.) A'isha\\n\\t\\t\\t\\tsaid to him, \"What's stopping you from coming close to\\n\\t\\t\\t\\tyour wife and kissing her and joking with her?\"  He said,\\n\\t\\t\\t\\t\"Can I kiss her when I am fasting?\"  She said, \"Yes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "17",
    "sectionHeading": "Permission for a Fasting Man to Kiss",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tAbu Hurayra and Sad ibn Abi Waqqas used to say that\\n\\t\\t\\t\\tsomeone who was fasting was allowed to kiss.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "18",
    "sectionHeading": "Restraint in Kissing when Fasting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, would say, when she mentioned that the\\n\\t\\t\\t\\tMessenger of Allah, used to kiss while fasting, \"And who\\n\\t\\t\\t\\tamong you is more able to control himself than the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace?\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said that Hisham ibn Urwa ibn\\n\\t\\t\\t\\taz-Zubayr had said, \"I do not think that kissing invites\\n\\t\\t\\t\\tto good for people who are fasting.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "19",
    "sectionHeading": "Restraint in Kissing when Fasting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that Abdullah ibn Abbas was asked about\\n\\t\\t\\t\\tpeople kissing while fasting and he said that he allowed\\n\\t\\t\\t\\tit for old men but disapproved of it for young men.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "20",
    "sectionHeading": "Restraint in Kissing when Fasting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to forbid kissing and fondling for people\\n\\t\\t\\t\\twho were fasting .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "21",
    "sectionHeading": "Fasting while Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud from Abdullah\\n\\t\\t\\t\\tibn Abbas that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, left for Makka in Ramadan during\\n\\t\\t\\t\\tthe year of the conquest, and fasted until he reached\\n\\t\\t\\t\\tal-Kadid. He then broke the fast, and so everyone else\\n\\t\\t\\t\\tdid so as well. What people used to do was act according\\n\\t\\t\\t\\tto whatever the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, had done most recently.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "22",
    "sectionHeading": "Fasting while Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr ibn Abd ar-Rahman, from Abu Bakr ibn Abd\\n\\t\\t\\t\\tar-Rahman from one of the companions of the Messenger of\\n\\t\\t\\t\\tAllah, that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, ordered everyone to break the fast\\n\\t\\t\\t\\ton the journey he made in the year of the conquest\\n\\t\\t\\t\\tsaying, \"Be strong for your enemy,\" while the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, kept\\n\\t\\t\\t\\ton fasting. Abu Bakr said that the one who related this\\n\\t\\t\\t\\tto him said, \"I saw the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, pouring water over his\\n\\t\\t\\t\\thead at al-Arj, either from thirst or from the heat. Then\\n\\t\\t\\t\\tsome one said to the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, 'Messenger of Allah, a group of\\n\\t\\t\\t\\tpeople kept on fasting when you did.'  Then when the\\n\\t\\t\\t\\tMessenger of Allah was at al-Kadid, he asked for a\\n\\t\\t\\t\\tdrinking-bowl and drank, and everyone broke the fast.\" \\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "23",
    "sectionHeading": "Fasting while Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd at-Tawil that\\n\\t\\t\\t\\tAnas ibn Malik said, \"We once travelled with the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, in Ramadan, and those who were fasting did not\\n\\t\\t\\t\\tfind fault with those who were not, and those who were\\n\\t\\t\\t\\tnot fasting did not find fault with those who were.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "24",
    "sectionHeading": "Fasting while Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Hamza ibn Amr al-Aslami once said to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, \"Messenger of Allah, I am a man who fasts. Can I\\n\\t\\t\\t\\tfast when travelling?\"\\tThe Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"If you want you can\\n\\t\\t\\t\\tfast, and if you want you can break the fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "25",
    "sectionHeading": "Fasting while Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used not to fast while travelling.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "26",
    "sectionHeading": "Fasting while Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Hisham ibn Urwa said,\\n\\t\\t\\t\\t\"My father, Urwa, used to travel in Ramadan, and we would\\n\\t\\t\\t\\ttravel with him, and he used to fast while we would break\\n\\t\\t\\t\\tthe fast, and he would not tell us to fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "27",
    "sectionHeading": "What to Do when Returning from a Journey in Ramadan or Intending to Travel in Ramadan",
    "text": "<p>\\n\\t\\t\\t\\t27 Yahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab, if he was travelling in Ramadan and\\n\\t\\t\\t\\tknew that he would reach Madina at the begining of the\\n\\t\\t\\t\\tday ,would do so fasting.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"Someone who is travelling\\n\\t\\t\\t\\tand knows that he will be reaching his people in the\\n\\t\\t\\t\\tfirst part of the day, and then dawn breaks before he\\n\\t\\t\\t\\tgets there, should be fasting when he gets there.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone who intends to go away (on a\\n\\t\\t\\t\\tjourney) in Ramadan, and then dawn breaks while he is\\n\\t\\t\\t\\tstill on his land before he has left, should fast that\\n\\t\\t\\t\\tday.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a man who returns from a journey in\\n\\t\\t\\t\\tRamadan and is not fasting may have sexual intercourse\\n\\t\\t\\t\\twith his wife if he wishes, if she is not fasting and she\\n\\t\\t\\t\\thas just become pure after her menses.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "28",
    "sectionHeading": "The Kaffara (Making Amends) for Breaking the Fast in Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tHunayd ibn Abd arRahman ibn Awf from Abu Hurayra that a\\n\\t\\t\\t\\tman broke the fast in Ramadan and the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, ordered him to\\n\\t\\t\\t\\tmake kaffara by freeing a slave, or fasting two\\n\\t\\t\\t\\tconsecutive months, or feeding sixty poor people, and he\\n\\t\\t\\t\\tsaid, \"I can't do it.\"\\tSomeone brought a large basket of\\n\\t\\t\\t\\tdates to the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and he said, \"Take this and give it away\\n\\t\\t\\t\\tas sadaqa.\"  He said, \"Messenger of Allah, there is no-ne\\n\\t\\t\\t\\tmore needy than I am.\"\\tThe Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, laughed until his\\n\\t\\t\\t\\teye-teeth appeared, and then he said, \"Eat them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "29",
    "sectionHeading": "The Kaffara (Making Amends) for Breaking the Fast in Ramadan",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ata ibn Abdullah\\n\\t\\t\\t\\tal-Khurasani that Said ibn al-Musayyab said, \"A bedouin\\n\\t\\t\\t\\tcame to the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, beating his breast and tearing out his\\n\\t\\t\\t\\thair and saying, 'I am destroyed.'  The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'Why is that?', and he said, 'I had intercourse with my\\n\\t\\t\\t\\twife while fasting in Ramadan.'  The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, asked him, 'Are\\n\\t\\t\\t\\tyou able to free a slave?', and the man said, 'No.'  Then\\n\\t\\t\\t\\the asked him, 'Are you able to give away a camel?', and\\n\\t\\t\\t\\tthe man replied, 'No.'\\tHe said, 'Sit own,' and someone\\n\\t\\t\\t\\tbrought a large basket of dates to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, and he\\n\\t\\t\\t\\tsaid to the man, 'Take this and give it away as sadaqa.'\\n\\t\\t\\t\\tThe man said, 'There is no one more needy than me,' and\\n\\t\\t\\t\\t(the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace), said, 'Eat them, and fast one day for the day\\n\\t\\t\\t\\twhen you had intercourse.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that Ata said that he had asked Said ibn\\n\\t\\t\\t\\tal-Musayyab how many dates there were in that basket, and\\n\\t\\t\\t\\the said, \"Between fifteen and twenty sas.''\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have heard people of knowledge saying that\\n\\t\\t\\t\\tthe kaffara specified by the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, for a man who has\\n\\t\\t\\t\\tintercourse with his wife during the day in Ramadan is\\n\\t\\t\\t\\tnot due from someone who, on a day when he is making up\\n\\t\\t\\t\\tthe fast of Ramadan, breaks his fast by having\\n\\t\\t\\t\\tintercourse with his wife, or whatever. He only has to\\n\\t\\t\\t\\tmake up for that day.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I like most out of what I have\\n\\t\\t\\t\\theard about the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "30",
    "sectionHeading": "Cupping a Man who is Fasting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to be cupped while he was fasting. Nafi\\n\\t\\t\\t\\tsaid, \"He later stopped doing that, and would not be\\n\\t\\t\\t\\tcupped when he was fasting until he had broken the fast.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "31",
    "sectionHeading": "Cupping a Man who is Fasting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Sad\\n\\t\\t\\t\\tibn Abi Waqqas and Abdullah ibn Umar used to be cupped\\n\\t\\t\\t\\twhile they were fasting.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "32",
    "sectionHeading": "Cupping a Man who is Fasting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father used to be cupped while he was fasting and he\\n\\t\\t\\t\\twould not then break his fast. Hisham added, \"I only ever\\n\\t\\t\\t\\tsaw him being cupped when he was fasting.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Cupping is only disapproved of for some one\\n\\t\\t\\t\\twho is fasting out of fear that he will become weak and\\n\\t\\t\\t\\tif it were not for that, it would not be disapproved of.\\n\\t\\t\\t\\tI do not think that a man who is cupped in Ramadan and\\n\\t\\t\\t\\tdoes not break his fast, owes anything, and I do not say\\n\\t\\t\\t\\tthat he has to make up for the day on which he was\\n\\t\\t\\t\\tcupped, because cupping is only disapproved of for\\n\\t\\t\\t\\tsomeone fasting if his fast is endangered. I do not think\\n\\t\\t\\t\\tthat someone who is cupped, and is then well enough to\\n\\t\\t\\t\\tkeep the fast until evening, owes anything, nor does he\\n\\t\\t\\t\\thave to make up for that day.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "33",
    "sectionHeading": "Fasting on the Day of Ashura ( the 10th of Muharram)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The day of\\n\\t\\t\\t\\tAshura was a day the Quraysh used to fast in the\\n\\t\\t\\t\\tjahiliyya, and the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, used also to fast it during the\\n\\t\\t\\t\\tjahiliyya. Then when the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, came to Madina he fasted\\n\\t\\t\\t\\tit and ordered that it be fasted. Then Ramadan was made\\n\\t\\t\\t\\tobligatory, and that became the fard instead of Ashura,\\n\\t\\t\\t\\tbut whoever wanted to, fasted it, and whoever did not\\n\\t\\t\\t\\twant to, did not fast it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "34",
    "sectionHeading": "Fasting on the Day of Ashura ( the 10th of Muharram)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tHumayd ibn Abd ar-Rahman ibn Awf heard Muawiya ibn Abi\\n\\t\\t\\t\\tSufyan say from the mimbar on the day of Ashura in the\\n\\t\\t\\t\\tyear in which he made the hajj, \"People of Madina, where\\n\\t\\t\\t\\tare your learned men?  I heard the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, say about this\\n\\t\\t\\t\\tday, 'This is the day of Ashura, and fasting it has not\\n\\t\\t\\t\\tbeen prescribed for you. I am fasting it, and whoever of\\n\\t\\t\\t\\tyou wants to fast it can do so, and whoever does not want\\n\\t\\t\\t\\tto, does not have to.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "35",
    "sectionHeading": "Fasting on the Day of Ashura ( the 10th of Muharram)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab had sent (the following message) to\\n\\t\\t\\t\\tal-Harith ibn Hisham, ''Tomorrow is the day of Ashura, so\\n\\t\\t\\t\\tfast (it) and tell your family to fast (also).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "36",
    "sectionHeading": "Fasting the Days of Fitr and Adha and Fasting Continuously",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Yahya\\n\\t\\t\\t\\tibn Habban from alAraj from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade fasting on two days, the day of Fitr and\\n\\t\\t\\t\\tthe day of Adha.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "37",
    "sectionHeading": "Fasting the Days of Fitr and Adha and Fasting Continuously",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he used to hear the\\n\\t\\t\\t\\tpeople of knowledge say,\"There is no harm in fasting\\n\\t\\t\\t\\tcontinuously as long as one breaks the fast on the days\\n\\t\\t\\t\\ton which the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, forbade fasting, namely, the days of\\n\\t\\t\\t\\tMina, the day of Adha and the day of Fitr, according to\\n\\t\\t\\t\\twhat we have heard.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what I like most out of what I have\\n\\t\\t\\t\\theard about the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "38",
    "sectionHeading": "The Prohibition against Fasting for Two Days or More without Breaking the Fast in between (Wisal)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade fasting for two days or more\\n\\t\\t\\t\\twithout breaking the fast in between. They said, \"But\\n\\t\\t\\t\\tMessenger of Allah, you practise wisal.\"  He replied, \"I\\n\\t\\t\\t\\tam not the same as you. I am fed and given to drink.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "39",
    "sectionHeading": "The Prohibition against Fasting for Two Days or More without Breaking the Fast in between (Wisal)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Beware of\\n\\t\\t\\t\\twisal. Beware of wisal.\"  They said, \"But you practise\\n\\t\\t\\t\\twisal, Messenger of Allah.\" He replied, \"I am not the\\n\\t\\t\\t\\tsame as you. My Lord feeds me and gives me to drink.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "40",
    "sectionHeading": "The Fasting of Someone who Kills by Mistake or Pronounces the Dhihar Form of Divorce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me, and I (myself) heard Malik say, \"The\\n\\t\\t\\t\\tbest that I have heard about some one who has to fast for\\n\\t\\t\\t\\ttwo consecutive months because of having killed someone\\n\\t\\t\\t\\tby mistake or having pronounced the dhihar form of\\n\\t\\t\\t\\tdivorce, becoming very ill and having to break his fast,\\n\\t\\t\\t\\tis that if he recovers from his illness and is strong\\n\\t\\t\\t\\tenough to fast, he must not delay doing so. He continues\\n\\t\\t\\t\\this fast from where he left off.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tSimilarly, a woman who has to fast because of having\\n\\t\\t\\t\\tkilled some one by mistake should not delay resuming her\\n\\t\\t\\t\\tfast when she has become pure after her period. She\\n\\t\\t\\t\\tcontinues her fast from where she left off.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tNo one who, by the Book of Allah, has to fast for two\\n\\t\\t\\t\\tconsecutive months may break his fast except for a reason\\n\\t\\t\\t\\t- illness or menstruation. He must not travel and break\\n\\t\\t\\t\\this fast.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the best that I have heard about the\\n\\t\\t\\t\\tmatter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "41",
    "sectionHeading": "What a Sick Man Does when Fasting",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"What I have heard\\n\\t\\t\\t\\tfrom the people of knowledge is that if a man succumbs to\\n\\t\\t\\t\\tan illness which makes fasting very difficult for him and\\n\\t\\t\\t\\texhausts him and wears him out, he can break his fast.\\n\\t\\t\\t\\tThis is the same as with a sick man in the prayer, who\\n\\t\\t\\t\\tfinds standing to be too difficult and exhausting, (and\\n\\t\\t\\t\\tAllah knows better than the slave that it is an excuse\\n\\t\\t\\t\\tfor him and that it really cannot be described).  If the\\n\\t\\t\\t\\tman is in such a condition he prays sitting, and the deen\\n\\t\\t\\t\\tof Allah is ease.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllah has permitted a traveller to break the fast when\\n\\t\\t\\t\\ttravelling, and he has more strength for fasting than a\\n\\t\\t\\t\\tsick man. Allah, the Exalted, says in His book, 'Whoever\\n\\t\\t\\t\\tamong you is ill or on a journey (must fast) a number of\\n\\t\\t\\t\\tother days,' and Allah has thus permitted a traveller to\\n\\t\\t\\t\\tbreak his fast when on a journey, and he is more capable\\n\\t\\t\\t\\tof fasting than a sick man.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "42",
    "sectionHeading": "The Vow to Fast, and Fasting for the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab was asked whether a man who had\\n\\t\\t\\t\\tvowed to fast a month could fast voluntarily, and Said\\n\\t\\t\\t\\tsaid, \"He should fulfil his vow before he does any\\n\\t\\t\\t\\tvoluntary fasting.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have heard the same thing from Sulayman\\n\\t\\t\\t\\tibn Yasar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone dies with an unfulfilled vow to\\n\\t\\t\\t\\tfree a slave or to fast or to give sadaqa or to give away\\n\\t\\t\\t\\ta camel, and makes a bequest that his vow should be\\n\\t\\t\\t\\tfulfilled from his estate, then the sadaqa or the gift of\\n\\t\\t\\t\\tthe camel are taken from one third of his estate.\\n\\t\\t\\t\\tPreference is given to it over other bequests, except\\n\\t\\t\\t\\tthings of a similar nature, because by his vow it has\\n\\t\\t\\t\\tbecome incumbent on him, and this is not the case with\\n\\t\\t\\t\\tsomething he donates voluntarily. They (vows and\\n\\t\\t\\t\\tvoluntary donations) are settled from a limited one-third\\n\\t\\t\\t\\tof his estate, and not from the whole of it, since if the\\n\\t\\t\\t\\tdying man were free to dispose of all of his estate, he\\n\\t\\t\\t\\tmight delay settling what had become incumbent on him\\n\\t\\t\\t\\t(i.e. his vows), so that when death came and the estate\\n\\t\\t\\t\\tpassed into the hands of his heirs, he would have\\n\\t\\t\\t\\tbequeathed such things (i.e. his vows) that were not\\n\\t\\t\\t\\tclaimed by anyone (like debts). If that (i.e. to dispose\\n\\t\\t\\t\\tfreely of his property) were allowed him, he would delay\\n\\t\\t\\t\\tthese things (i.e. his vows) until when he was near\\n\\t\\t\\t\\tdeath, he would designate them and they might take up all\\n\\t\\t\\t\\tof his estate. He must not do that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "43",
    "sectionHeading": "The Vow to Fast, and Fasting for the Dead",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar used to be asked, \"an some one fast for\\n\\t\\t\\t\\tsome one else, or do the prayer for some one else?\" and\\n\\t\\t\\t\\the would reply, \"No one can fast or do the prayer for\\n\\t\\t\\t\\tanyone else.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "44",
    "sectionHeading": "Making Up Days Missed in Ramadan, and the Kaffara",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\this brother Khalid ibn Aslam that Umar ibn al-Khattab\\n\\t\\t\\t\\tonce broke thefast on a cloudy day thinking that evening\\n\\t\\t\\t\\thad come and the sun had set. Then a man came to him and\\n\\t\\t\\t\\tsaid, \"Amir al-muminin, the sun has come out,'' and Umar\\n\\t\\t\\t\\tsaid, \"That's an easy matter. It was our deduction\\n\\t\\t\\t\\t(ijtihad).\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"According to what we think, and Allah knows\\n\\t\\t\\t\\tbest, what he was referring to when he said, 'That's an\\n\\t\\t\\t\\teasy matter' was making up the fast, and how slight the\\n\\t\\t\\t\\teffort involved was and how easy it was. He was saying\\n\\t\\t\\t\\t(in effect), 'We will fast another day in its place.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "45",
    "sectionHeading": "Making Up Days Missed in Ramadan, and the Kaffara",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Someone who breaks the fast in\\n\\t\\t\\t\\tRamadan because he is ill or travelling should make up\\n\\t\\t\\t\\tthe days he has missed consecutively.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "46",
    "sectionHeading": "Making Up Days Missed in Ramadan, and the Kaffara",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibr Shihab that\\n\\t\\t\\t\\tAbdullah ibn Abbas and Abu Hurayra differed about making\\n\\t\\t\\t\\tup days missed in Ramadan. One of them said that they\\n\\t\\t\\t\\twere done separately and the other said that they were\\n\\t\\t\\t\\tdone consecutively. He did not know which one of them it\\n\\t\\t\\t\\twas who said that they were done separately.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "47",
    "sectionHeading": "Making Up Days Missed in Ramadan, and the Kaffara",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"If some one makes himself vomit\\n\\t\\t\\t\\twhile he is fasting he has to make up a day, but if he\\n\\t\\t\\t\\tcannot help vomiting he does not have to make up\\n\\t\\t\\t\\tanything.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "48",
    "sectionHeading": "Making Up Days Missed in Ramadan, and the Kaffara",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the heard Said ibn al Musayyab being asked about making up\\n\\t\\t\\t\\tdays missed in Ramadan, and Said said, \"What I like best\\n\\t\\t\\t\\tis for days missed in Ramadan to be made up\\n\\t\\t\\t\\tconsecutively, and not separately.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say, about some one\\n\\t\\t\\t\\twho made up the days he had missed in Ramadan separately,\\n\\t\\t\\t\\tthat he did not have to repeat them. (What he had done)\\n\\t\\t\\t\\twas enough for him.  It was, however, preferable, if he\\n\\t\\t\\t\\tdid them consecutively.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Whoever eats or drinks thoughtlessly or\\n\\t\\t\\t\\tforgetfully in Ramadan or during any other obligatory\\n\\t\\t\\t\\tfast that he must do, has to fast another day in its\\n\\t\\t\\t\\tplace.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "49",
    "sectionHeading": "Making Up Days Missed in Ramadan, and the Kaffara",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Humayd ibn Oays\\n\\t\\t\\t\\tal-Makki told him, \"I was with Mujahid while he was\\n\\t\\t\\t\\tperforming tawaf around the Kaba, and a man came to him\\n\\t\\t\\t\\tand asked whether the days (of fasting) for kaffara had\\n\\t\\t\\t\\tto be fasted consecutively, or could they be split up. I\\n\\t\\t\\t\\tsaid to him, 'Yes, they can be split up, if the person so\\n\\t\\t\\t\\twishes.' Mujahid said, 'He should not split them up,\\n\\t\\t\\t\\tbecause in Ubayy ibn Kab's recitation they are referred\\n\\t\\t\\t\\tto as three consecutive days.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What I like most is what Allah has specified\\n\\t\\t\\t\\tin the Qur'an, that is, that they are fasted\\n\\t\\t\\t\\tconsecutively.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a woman who began the day fasting\\n\\t\\t\\t\\tin Ramadan and though it was outside of the time of her\\n\\t\\t\\t\\tperiod, fresh blood (i.e. not menstrual blood) flowed\\n\\t\\t\\t\\tfrom her. She then waited until evening to see the same,\\n\\t\\t\\t\\tbut did not see anything.Then, on the next day in the\\n\\t\\t\\t\\tmorning she had anotherflow, though less than the first.\\n\\t\\t\\t\\tThen, some days before her period, the flow stopped\\n\\t\\t\\t\\tcompletely. Malik was asked what she should do about her\\n\\t\\t\\t\\tfasting and prayer, and he said, \"This blood is like\\n\\t\\t\\t\\tmenstrual blood. When she sees it she should break her\\n\\t\\t\\t\\tfast, and then make up the days she has missed. Then,\\n\\t\\t\\t\\twhen the blood has completely stopped, she should do\\n\\t\\t\\t\\tghusl and fast.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether someone who became muslim on the\\n\\t\\t\\t\\tlast day of Ramadan had to make up all of Ramadan or\\n\\t\\t\\t\\twhether he just had to make up the day when he became\\n\\t\\t\\t\\tmuslim, and he said, \"He does not have to make up any of\\n\\t\\t\\t\\tthe days that have passed. He begins fasting from that\\n\\t\\t\\t\\tday onwards. What I like most is that he makes up the day\\n\\t\\t\\t\\ton which he became muslim.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "50",
    "sectionHeading": "Making up forVoluntary Fasts (Broken)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tA'isha and Hafsa, the wives of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, began fasting voluntarily\\n\\t\\t\\t\\tone morning and then food was given to them and they\\n\\t\\t\\t\\tbroke their fast with it. Then the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, came in. A'isha\\n\\t\\t\\t\\tsaid, \"Hafsa asked, anticipating me in speech - she took\\n\\t\\t\\t\\tafter her father Umar - 'Messenger of Allah, A'isha and I\\n\\t\\t\\t\\tbegan the morning fasting voluntarily and then food was\\n\\t\\t\\t\\tgiven us and we broke the fast with it.'  The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'Fast another day in its place.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"Someone who eats or\\n\\t\\t\\t\\tdrinks out of neglect or forgetfulness during a voluntary\\n\\t\\t\\t\\tfast does not have to repeat his fast, but he should\\n\\t\\t\\t\\tcontinue fasting for the rest of the day in which he eats\\n\\t\\t\\t\\tor drinks while voluntarily fasting, and not stop\\n\\t\\t\\t\\tfasting. Someone to whom something unexpected happens\\n\\t\\t\\t\\twhich causes him to break his fast while he is fasting\\n\\t\\t\\t\\tvoluntarily does not have to repeat his fast if he has\\n\\t\\t\\t\\tbroken it for a reason, and not simply because he decided\\n\\t\\t\\t\\tto break his fast. Just as I do not think that someone\\n\\t\\t\\t\\thas to repeat a voluntary prayer if he has had to stop it\\n\\t\\t\\t\\tbecause of some discharge which he could prevent and\\n\\t\\t\\t\\twhich meant that he had to repeat his wudu.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Once a man has begun doing any of the right\\n\\t\\t\\t\\tactions (al-amal as-saliha) such as the prayer, the fast\\n\\t\\t\\t\\tand the hajj, or similar right actions of a voluntary\\n\\t\\t\\t\\tnature, he should not stop until he has completed it\\n\\t\\t\\t\\taccording to what the sunna for that action is. If he\\n\\t\\t\\t\\tsays the takbir he should not stop until he has prayed\\n\\t\\t\\t\\ttwo rakas. If he is fasting he should not break his fast\\n\\t\\t\\t\\tuntil he has completed that day's fast. If he goes into\\n\\t\\t\\t\\tihram he should not return until he has completed his\\n\\t\\t\\t\\thajj, and if he begins doing tawaf he should not stop\\n\\t\\t\\t\\tdoing so until he has gone around the Kaba seven times.\\n\\t\\t\\t\\tHe should not stop doing any of these actions once he has\\n\\t\\t\\t\\tstarted them until he has completed them, except if\\n\\t\\t\\t\\tsomething happens such as illness or some other matter by\\n\\t\\t\\t\\twhich a man is excused. This is because Allah, the\\n\\t\\t\\t\\tBlessed and Exalted, says in His Book, 'And eat and drink\\n\\t\\t\\t\\tuntil the white thread becomes clear to you from the\\n\\t\\t\\t\\tblack thread of dawn, (and) then complete the fast until\\n\\t\\t\\t\\tnight-time,' (Sura 2 ayat 187), and so he must complete\\n\\t\\t\\t\\this fast as Allah has said. Allah, the Exalted, (also)\\n\\t\\t\\t\\tsays, 'And complete the hajj and the umra forAllah,' and\\n\\t\\t\\t\\tso if a man were to go into ihram for a voluntary hajj\\n\\t\\t\\t\\thaving done his one obligatory hajj (on a previous\\n\\t\\t\\t\\toccasion), he could not then stop doing his hajj having\\n\\t\\t\\t\\tonce begun it and leave ihram while in the middle of his\\n\\t\\t\\t\\thajj. Anyone that begins a voluntary act must complete it\\n\\t\\t\\t\\tonce he has begun doing it, just as an obligatory act\\n\\t\\t\\t\\tmust be completed . This is the best of what I have\\n\\t\\t\\t\\theard.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "51",
    "sectionHeading": "The Fidya (Compensation) of a Man who Breaks the Fast in Ramadan from Weakness",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAnas ibn Malik used to pay fidya when he had grown old\\n\\t\\t\\t\\tand could no longer manage to do the fast.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not consider that to do so is\\n\\t\\t\\t\\tobligatory, but what I like most is that a man does the\\n\\t\\t\\t\\tfast when he is strong enough. Whoever pays compensation\\n\\t\\t\\t\\tgives one mudd of food in place of every day, using the\\n\\t\\t\\t\\tmudd of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "52",
    "sectionHeading": "The Fidya (Compensation) of a Man who Breaks the Fast in Ramadan from Weakness",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar was asked about what a pregnant woman\\n\\t\\t\\t\\tshould do if the fast became difficult for her and she\\n\\t\\t\\t\\tfeared for her child, and he said, \"She should break the\\n\\t\\t\\t\\tfast and feed a poor man one mudd of wheat in place of\\n\\t\\t\\t\\tevery day, using the mudd of the Prophet, may Allah bless\\n\\t\\t\\t\\thim and grant him peace.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The people of  knowledge consider that she\\n\\t\\t\\t\\thas to make up for each day of the fast that she misses\\n\\t\\t\\t\\tas Allah, the Exalted and Glorified, says, 'And whoever\\n\\t\\t\\t\\tof you is sick or on a journey should fast an equal\\n\\t\\t\\t\\tnumber of other days, ' and they consider her pregnancy\\n\\t\\t\\t\\tand her concern for her child as a sickness.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "53",
    "sectionHeading": "The Fidya (Compensation) of a Man who Breaks the Fast in Ramadan from Weakness",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim that his father used to say, \"If someone has to\\n\\t\\t\\t\\tmake up for days not fasted in Ramadan and does not do\\n\\t\\t\\t\\tthem before the next Ramadan comes although he is strong\\n\\t\\t\\t\\tenough to do so, he should feed a poor man with a mudd of\\n\\t\\t\\t\\twheat for every day that he has missed, and he has to\\n\\t\\t\\t\\tfast the days he owes as well.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard the same\\n\\t\\t\\t\\tthing from Said ibn Jubayr.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "54",
    "sectionHeading": "Making Up For Days Not Fasted in Ramadan in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAbu Salama ibn Abd ar-Rahman that he heard A'isha, the\\n\\t\\t\\t\\twife of the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, \"I used to have to make up days from Ramadan\\n\\t\\t\\t\\tand not be able to do them until Shaban came.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "55",
    "sectionHeading": "Fasting The Day of Doubt",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard the\\n\\t\\t\\t\\tpeople of knowledge telling people not to fast on the day\\n\\t\\t\\t\\tin Shaban when there was doubt (about whether it was\\n\\t\\t\\t\\tShaban or Ramadan), if they intended by it the fast of\\n\\t\\t\\t\\tRamadan . They considered that whoever fasted on that day\\n\\t\\t\\t\\twithout having seen (the new moon) had to make up that\\n\\t\\t\\t\\tday if it later became clear that it was part of Ramadan.\\n\\t\\t\\t\\tThey did not see any harm in voluntary fasting on that\\n\\t\\t\\t\\tday.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what we do, and what I have seen the\\n\\t\\t\\t\\tpeople of knowledge in our city doing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "56",
    "sectionHeading": "The Fast in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah, from Abu Salama ibn Abd ar-Rahman\\n\\t\\t\\t\\tthat A'isha, the wife of the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant  him peace, said, \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, used to fast for so\\n\\t\\t\\t\\tlong that we thought he would never stop fasting, and he\\n\\t\\t\\t\\twould go without fasting for so long that we thought he\\n\\t\\t\\t\\twould never fast again. I never saw the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, fast for\\n\\t\\t\\t\\ta complete month except for Ramadan, and I never saw him\\n\\t\\t\\t\\tdo more fasting in any one month than he did in Shaban.'\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "57",
    "sectionHeading": "The Fast in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-A'raj from Abu Hurayra that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"Fasting\\n\\t\\t\\t\\tis a protection for you, so when you are fasting, do not\\n\\t\\t\\t\\tbehave obscenely or foolishly, and if any one argues with\\n\\t\\t\\t\\tyou or abuses you, say, 'I am fasting. I am fasting.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "58",
    "sectionHeading": "The Fast in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"By the One in\\n\\t\\t\\t\\tWhose hand my self is, the smell of the breath of a man\\n\\t\\t\\t\\tfasting is better with Allah than the scent of musk.' He\\n\\t\\t\\t\\tleaves his desires and his food and drink for My sake.\\n\\t\\t\\t\\tFasting is for Me and I reward it. Every good action is\\n\\t\\t\\t\\trewarded by ten times its kind, up to seven hundred\\n\\t\\t\\t\\ttimes, except fasting, which is for Me, and I reward it.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "59",
    "sectionHeading": "The Fast in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from his paternal uncle\\n\\t\\t\\t\\tAbu Suhayl ibn Malik from his father that Abu Hurayra\\n\\t\\t\\t\\tsaid, \"When Ramadan comes the gates of the Garden are\\n\\t\\t\\t\\topened and the gates of the Fire are locked, and the\\n\\t\\t\\t\\tshayatin are chained.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "18",
    "hadithNumber": "60",
    "sectionHeading": "The Fast in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tpeople of knowledge did not disapprove of people fasting\\n\\t\\t\\t\\tusing tooth-sticks at any hour of the day in Ramadan,\\n\\t\\t\\t\\twhether at the beginning or the end, nor had he heard any\\n\\t\\t\\t\\tof the people of knowledge disapproving of or forbidding\\n\\t\\t\\t\\tthe practice.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, about fasting for six\\n\\t\\t\\t\\tdays after breaking the fast at the end of Ramadan, that\\n\\t\\t\\t\\the had never seen any of the people of knowledge and fiqh\\n\\t\\t\\t\\tfasting them. He said, \"I have not heard that any of our\\n\\t\\t\\t\\tpredecessors used to do that, and the people of knowledge\\n\\t\\t\\t\\tdisapprove of it and they are afraid that it might become\\n\\t\\t\\t\\ta bida and that common and ignorant people might join to\\n\\t\\t\\t\\tRamadan what does not belong to it, if they were to think\\n\\t\\t\\t\\tthat the people of knowledge had given permission for\\n\\t\\t\\t\\tthat to be done and were seen doing it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"I have never heard\\n\\t\\t\\t\\tany of the people of knowledge and fiqh and those whom\\n\\t\\t\\t\\tpeople take as an example forbidding fasting on the day\\n\\t\\t\\t\\tof jumua. Fasting on it is good, and I have seen one of\\n\\t\\t\\t\\tthe people of knowledge fasting it, and it seemed to me\\n\\t\\t\\t\\tthat he was keen to do so.\"\\n\\t\\t\\t</p>"
  }
]
