[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/014001",
        "Body":  "Alif. Lam. Ra. (This is) a Scripture which We have revealed unto\n\t\t\tthee (Muhammad) that thereby thou mayst bring forth mankind from\n\t\t\tdarkness unto light, by the permission of their Lord, unto the\n\t\t\tpath of the Mighty, the Owner of Praise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/014010",
        "Body":  "Their messengers said: Can there be doubt concerning Allah, the\n\t\t\tCreator of the heavens and the earth? He calleth you that He may\n\t\t\tforgive you your sins and reprieve you unto an appointed term.\n\t\t\tThey said: Ye are but mortals like us, who would fain turn us\n\t\t\taway from what our fathers used to worship. Then bring some clear\n\t\t\twarrant."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/014011",
        "Body":  "Their messengers said unto them: We are but mortals like you, but\n\t\t\tAllah giveth grace unto whom He will of His slaves. It is not\n\t\t\tours to bring you a warrant unless by the permission of Allah. In\n\t\t\tAllah let believers put their trust!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/014012",
        "Body":  "How should we not put our trust in Allah when He hath shown us\n\t\t\tour ways? We surely will endure that hurt ye do us. In Allah let\n\t\t\tthe trusting put their trust!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/014013",
        "Body":  "And those who disbelieved said unto their messengers: Verily we\n\t\t\twill drive you out from our land, unless ye return to our\n\t\t\treligion. Then their Lord inspired them, (saying): Verily We\n\t\t\tshall destroy the wrong-doers,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/014014",
        "Body":  "And verily We shall make you to dwell in the land after them.\n\t\t\tThis is for him who feareth My Majesty and feareth My threats."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/014015",
        "Body":  "And they sought help (from their Lord) and every froward\n\t\t\tpotentate was brought to naught;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/014016",
        "Body":  "Hell is before him, and he is made to drink a festering water,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/014017",
        "Body":  "Which he sippeth but can hardly swallow, and death cometh unto\n\t\t\thim from every side while yet he cannot die, and before him is a\n\t\t\tharsh doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/014018",
        "Body":  "A similitude of those who disbelieve in their Lord: Their works\n\t\t\tare as ashes which the wind bloweth hard upon a stormy day. They\n\t\t\thave no control of aught that they have earned. That is the\n\t\t\textreme failure."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/014019",
        "Body":  "Hast thou not seen that Allah hath created the heavens and the\n\t\t\tearth with truth? If He will, He can remove you and bring (in)\n\t\t\tsome new creation."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/014002",
        "Body":  "Allah, unto Whom belongeth whatsoever is in the heavens and\n\t\t\twhatsoever is in the earth. And woe unto the disbelievers from an\n\t\t\tawful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/014020",
        "Body":  "And that is no great matter for Allah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/014021",
        "Body":  "They all come forth unto their Lord. Then those who were despised\n\t\t\tsay unto those who were scornful: We were unto you a following,\n\t\t\tcan ye then avert from us aught of Allah\u0027s doom? They say: Had\n\t\t\tAllah guided us, we should have guided you. Whether we rage or\n\t\t\tpatiently endure is (now) all one for us: we have no place of\n\t\t\trefuge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/014022",
        "Body":  "And Satan saith, when the matter hath been decided: Lo! Allah\n\t\t\tpromised you a promise of truth; and I promised you, then failed\n\t\t\tyou. And I had no power over you save that I called unto you and\n\t\t\tye obeyed me. So blame me not, but blame yourselves. I cannot\n\t\t\thelp you, nor can ye help me. Lo! I disbelieved in that which ye\n\t\t\tbefore ascribed to me. Lo! for wrong-doers is a painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/014023",
        "Body":  "And those who believed and did good works are made to enter\n\t\t\tGardens underneath which rivers flow, therein abiding by\n\t\t\tpermission of their Lord, their greeting therein: Peace!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/014024",
        "Body":  "Seest thou not how Allah coineth a similitude: A goodly saying,\n\t\t\tas a goodly tree, its root set firm, its branches reaching into\n\t\t\theaven,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/014025",
        "Body":  "Giving its fruit at every season by permission of its Lord? Allah\n\t\t\tcoineth the similitudes for mankind in order that they may\n\t\t\treflect."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/014026",
        "Body":  "And the similitude of a bad saying is as a bad tree, uprooted\n\t\t\tfrom upon the earth, possessing no stability."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/014027",
        "Body":  "Allah confirmeth those who believe by a firm saying in the life\n\t\t\tof the world and in the Hereafter, and Allah sendeth wrongdoers\n\t\t\tastray. And Allah doeth what He will."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/014028",
        "Body":  "Hast thou not seen those who gave the grace of Allah in exchange\n\t\t\tfor thanklessness and led their people down to the Abode of Loss,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/014029",
        "Body":  "(Even to) hell? They are exposed thereto. A hapless end!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/014003",
        "Body":  "Those who love the life of the world more than the Hereafter, and\n\t\t\tdebar (men) from the way of Allah and would have it crooked: such\n\t\t\tare far astray."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/014030",
        "Body":  "And they set up rivals to Allah that they may mislead (men) from\n\t\t\tHis way. Say: Enjoy life (while ye may) for lo! your journey\u0027s\n\t\t\tend will be the Fire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/014031",
        "Body":  "Tell My bondmen who believe to establish worship and spend of\n\t\t\tthat which We have given them, secretly and publicly, before a\n\t\t\tday cometh wherein there will be neither traffic nor befriending."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/014032",
        "Body":  "Allah is He Who created the heavens and the earth, and causeth\n\t\t\twater to descend from the sky, thereby producing fruits as food\n\t\t\tfor you, and maketh the ships to be of service unto you, that\n\t\t\tthey may run upon the sea at His command, and hath made of\n\t\t\tservice unto you the rivers;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/014033",
        "Body":  "And maketh the sun and the moon, constant in their courses, to be\n\t\t\tof service unto you, and hath made of service unto you the night\n\t\t\tand the day."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/014034",
        "Body":  "And He giveth you of all ye ask of Him, and if ye would count the\n\t\t\tbounty of Allah ye cannot reckon it. Lo! man is verily a\n\t\t\twrong-doer, an ingrate."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/014035",
        "Body":  "And when Abraham said: My Lord! Make safe this territory, and\n\t\t\tpreserve me and my sons from serving idols."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/014036",
        "Body":  "My Lord! Lo! they have led many of mankind astray. But whoso\n\t\t\tfolloweth me, he verily is of me. And whoso disobeyeth me, still\n\t\t\tThou art Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/014037",
        "Body":  "Our Lord! Lo! I have settled some of my posterity in an\n\t\t\tuncultivable valley near unto Thy holy House, our Lord! that they\n\t\t\tmay establish proper worship; so incline some hearts of men that\n\t\t\tthey may yearn toward them, and provide Thou them with fruits in\n\t\t\torder that they may be thankful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/014038",
        "Body":  "Our Lord! Lo! Thou knowest that which we hide and that which we\n\t\t\tproclaim. Nothing in the earth or in the heaven is hidden from\n\t\t\tAllah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/014039",
        "Body":  "Praise be to Allah Who hath given me, in my old age, Ishmael and\n\t\t\tIsaac! Lo! my Lord is indeed the Hearer of Prayer."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/014004",
        "Body":  "And We never sent a messenger save with the language of his folk,\n\t\t\tthat he might make (the message) clear for them. Then Allah\n\t\t\tsendeth whom He will astray, and guideth whom He will. He is the\n\t\t\tMighty, the Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/014040",
        "Body":  "My Lord! Make me to establish proper worship, and some of my\n\t\t\tposterity (also); our Lord! and accept the prayer."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/014041",
        "Body":  "Our Lord! Forgive me and my parents and believers on the day when\n\t\t\tthe account is cast."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/014042",
        "Body":  "Deem not that Allah is unaware of what the wicked do. He but\n\t\t\tgiveth them a respite till a day when eyes will stare (in\n\t\t\tterror)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/014043",
        "Body":  "As they come hurrying on in fear, their heads upraised, their\n\t\t\tgaze returning not to them, and their hearts as air."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/014044",
        "Body":  "And warn mankind of a day when the doom will come upon them, and\n\t\t\tthose who did wrong will say: Our Lord! Reprieve us for a little\n\t\t\twhile. We will obey Thy call and will follow the messengers. (It\n\t\t\twill be answered): Did ye not swear before that there would be no\n\t\t\tend for you?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/014045",
        "Body":  "And (have ye not) dwelt in the dwellings of those who wronged\n\t\t\tthemselves (of old) and (hath it not) become plain to you how We\n\t\t\tdealt with them, and made examples for you?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/014046",
        "Body":  "Verily they have plotted their plot, and their plot is with\n\t\t\tAllah, though their plot were one whereby the mountains should be\n\t\t\tmoved."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/014047",
        "Body":  "So think not that Allah will fail to keep His promise to His\n\t\t\tmessengers. Lo! Allah is Mighty, Able to Requite (the wrong)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/014048",
        "Body":  "On the day when the earth will be changed to other than the\n\t\t\tearth, and the heavens (also will be changed) and they will come\n\t\t\tforth unto Allah, the One, the Almighty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/014049",
        "Body":  "Thou wilt see the guilty on that day linked together in chains."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/014005",
        "Body":  "We verily sent Moses with Our revelations, saying: Bring thy\n\t\t\tpeople forth from darkness unto light. And remind them of the\n\t\t\tdays of Allah. Lo! therein are revelations for each steadfast,\n\t\t\tthankful (heart)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/014050",
        "Body":  "Their raiment of pitch, and the Fire covering their faces."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/014051",
        "Body":  "That Allah may repay each soul what it hath earned. Lo! Allah is\n\t\t\tswift at reckoning."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/014052",
        "Body":  "This is a clear message for mankind in order that they may be\n\t\t\twarned thereby, and that they may know that He is only One God,\n\t\t\tand that men of understanding may take heed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/014006",
        "Body":  "And (remind them) how Moses said unto his people: Remember\n\t\t\tAllah\u0027s favor unto you when He delivered you from Pharaoh\u0027s folk\n\t\t\twho were afflicting you with dreadful torment, and were slaying\n\t\t\tyour sons and sparing your women; that was a tremendous trial\n\t\t\tfrom your Lord."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/014007",
        "Body":  "And when your Lord proclaimed: If ye give thanks, I will give you\n\t\t\tmore; but if ye are thankless, lo! my punishment is dire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/014008",
        "Body":  "And Moses said: Though ye and all who are in the earth prove\n\t\t\tthankless, lo! Allah verily is Absolute, Owner of Praise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "14",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/014009",
        "Body":  "Hath not the history of those before you reached you: the folk of\n\t\t\tNoah. and (the tribes of) Aad and Thamud, and those after them?\n\t\t\tNone save Allah knoweth them. Their messengers came unto them\n\t\t\twith clear proofs, but they thrust their hands into their mouths,\n\t\t\tand said: Lo! we disbelieve in that wherewith ye have been sent,\n\t\t\tand lo! we are in grave doubt concerning that to which ye call\n\t\t\tus."
    }
]
