[
  {
    "SurahNumber": "96",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Sc., \"this divine writ\". The imperative iqra' may be\\n\\t\\t\\t\\trendered as \"read\" or \"recite\". The former rendering is,\\n\\t\\t\\t\\tto my mind, by far the preferable in this context\\n\\t\\t\\t\\tinasmuch as the concept of \"reciting\" implies no more\\n\\t\\t\\t\\tthan the oral delivery - with or without understanding -\\n\\t\\t\\t\\tof something already laid down in writing or committed to\\n\\t\\t\\t\\tmemory, whereas \"reading\" primarily signifies a conscious\\n\\t\\t\\t\\ttaking-in, with or without an audible utterance but with\\n\\t\\t\\t\\ta view to understanding them, of words and ideas received\\n\\t\\t\\t\\tfrom an outside source: in this case, the message of the\\n\\t\\t\\t\\tQur'an."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "The past tense in which the verb khalaqa appears in these\\n\\t\\t\\t\\ttwo verses is meant to indicate that the act of divine\\n\\t\\t\\t\\tcreation (khalq) has been and is being continuously\\n\\t\\t\\t\\trepeated. It is also noteworthy that this very first\\n\\t\\t\\t\\tQur'anic revelation alludes to man's embryonic evolution\\n\\t\\t\\t\\tout of a \"germ-cell\" - i.e., out of a fertilized female\\n\\t\\t\\t\\tovum - thus contrasting the primitiveness and simplicity\\n\\t\\t\\t\\tof his biological origins with his intellectual and\\n\\t\\t\\t\\tspiritual potential: a contrast which clearly points to\\n\\t\\t\\t\\tthe existence of a conscious design and a purpose\\n\\t\\t\\t\\tunderlying the creation of life."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "\"The pen\" is used here as a symbol for the art of writing\\n\\t\\t\\t\\tor, more specifically, for all knowledge recorded by\\n\\t\\t\\t\\tmeans of writing: and this explains the symbolic summons\\n\\t\\t\\t\\t\"Read!\" at the beginning of verses {1} and {3}. Man's\\n\\t\\t\\t\\tunique ability to transmit, by means of written records,\\n\\t\\t\\t\\this thoughts, experiences and insights from individual to\\n\\t\\t\\t\\tindividual, from generation to generation, and from one\\n\\t\\t\\t\\tcultural environment to another endows all human\\n\\t\\t\\t\\tknowledge with a cumulative character; and since, thanks\\n\\t\\t\\t\\tto this God-given ability, every human being partakes, in\\n\\t\\t\\t\\tone way or another, in mankind's continuous accumulation\\n\\t\\t\\t\\tof knowledge, man is spoken of as being \"taught by God\"\\n\\t\\t\\t\\tthings which the single individual does not - and,\\n\\t\\t\\t\\tindeed, cannot - know by himself. (This double stress on\\n\\t\\t\\t\\tman's utter dependence on God, who creates him as a\\n\\t\\t\\t\\tbiological entity and implants in him the will and the\\n\\t\\t\\t\\tability to acquire knowledge, receives its final accent,\\n\\t\\t\\t\\tas it were, in the next three verses.) Furthermore, God's\\n\\t\\t\\t\\t\"teaching\" man signifies also the act of His revealing,\\n\\t\\t\\t\\tthrough the prophets, spiritual truths and moral\\n\\t\\t\\t\\tstandards which cannot be unequivocally established\\n\\t\\t\\t\\tthrough human experience and reasoning alone: and, thus,\\n\\t\\t\\t\\tit circumscribes the phenomenon of divine revelation as\\n\\t\\t\\t\\tsuch."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "8",
    "NoteID": "4",
    "Body": "Lit., \"is the return (ar-ruj'a)\". This noun has here a\\n\\t\\t\\t\\ttwofold implication: \"everyone will inescapably be\\n\\t\\t\\t\\tbrought before God for judgment\", as well as \"everything\\n\\t\\t\\t\\tthat exists goes back to God as its source\". In ultimate\\n\\t\\t\\t\\tanalysis, the statement expressed in verses {6-8} rejects\\n\\t\\t\\t\\tas absurd the arrogant idea that man could ever be\\n\\t\\t\\t\\tself-sufficient and, hence, \"master of his own fate\";\\n\\t\\t\\t\\tfurthermore, it implies that all moral concepts - that\\n\\t\\t\\t\\tis, all discrimination between good and evil, or right\\n\\t\\t\\t\\tand wrong - are indissolubly linked with the concept of\\n\\t\\t\\t\\tman's responsibility to a Supreme Power: in other words,\\n\\t\\t\\t\\twithout such a feeling of responsibility - whether\\n\\t\\t\\t\\tconscious or subconscious - the concept of \"morality\" as\\n\\t\\t\\t\\tsuch loses all its meaning."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "10",
    "NoteID": "5",
    "Body": "Lit., \"who forbids a servant [of God] when he prays\",\\n\\t\\t\\t\\timplying an attempt at preventing. Since this seems to\\n\\t\\t\\t\\trefer to praying in public, most of the classical\\n\\t\\t\\t\\tcommentators see in this passage (which was revealed at\\n\\t\\t\\t\\tleast a year later than the first five verses) an\\n\\t\\t\\t\\tallusion to Abu Jahl, the Prophet's bitterest opponent in\\n\\t\\t\\t\\tMecca, who persistently tried to prevent Muhammad and his\\n\\t\\t\\t\\tfollowers from praying before the Ka'bah. However, there\\n\\t\\t\\t\\tis no doubt that the purport of the above passage goes\\n\\t\\t\\t\\tfar beyond any historical incident or situation inasmuch\\n\\t\\t\\t\\tas it applies to all attempts, at all times, to deny to\\n\\t\\t\\t\\treligion (symbolized in the term \"praying\") its\\n\\t\\t\\t\\tlegitimate function in the shaping of social life -\\n\\t\\t\\t\\tattempts made either in the conviction that religion is\\n\\t\\t\\t\\tevery individual's \"private affair\" and, therefore, must\\n\\t\\t\\t\\tnot be allowed to \"intrude\" into the realm of social\\n\\t\\t\\t\\tconsiderations, or, alternatively, in the pursuit of the\\n\\t\\t\\t\\tillusion that man is above any need of metaphysical\\n\\t\\t\\t\\tguidance."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "12",
    "NoteID": "6",
    "Body": "Lit., \"or enjoins God-consciousness (taqwa)\" - i.e.,\\n\\t\\t\\t\\twhether his aim is to deepen his fellow-men's\\n\\t\\t\\t\\tGod-consciousness by insisting that religion is a purely\\n\\t\\t\\t\\tpersonal matter: the obvious implication being that this\\n\\t\\t\\t\\tis not his aim, and that he is not on the right way in\\n\\t\\t\\t\\tthinking and acting as he does. - Throughout this work,\\n\\t\\t\\t\\tthe term taqwa - of which the present is the earliest\\n\\t\\t\\t\\tinstance in the chronology of Qur'anic revelation - has\\n\\t\\t\\t\\tbeen rendered as \"God-consciousness\", with the same\\n\\t\\t\\t\\tmeaning attaching to the verbal forms from which this\\n\\t\\t\\t\\tnoun is derived. (See also surah {2}, note [2].)."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "13",
    "NoteID": "7",
    "Body": "Sc., \"because in his arrogance he cannot face it\"."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "15",
    "NoteID": "8",
    "Body": "Or: \"by his forelock\" - an ancient Arabian expression\\n\\t\\t\\t\\tdenoting a person's utter subjection and humiliation (see\\n\\t\\t\\t\\t 11:56  and the corresponding note [80]). However, as\\n\\t\\t\\t\\tRazi points out, the term \"forelock\" (nasiyah) is here\\n\\t\\t\\t\\tused metonymically for the place on which the forelock\\n\\t\\t\\t\\tgrows, i.e., the forehead (cf. also Taj al-'Arus)."
  },
  {
    "SurahNumber": "96",
    "AyahNumber": "17",
    "NoteID": "9",
    "Body": "Lit., \"his council\". According to the commentators who\\n\\t\\t\\t\\ttend to interpret verses such as this in purely\\n\\t\\t\\t\\thistorical terms, this may be a reference to the\\n\\t\\t\\t\\ttraditional council of elders (dar an-nadwah) in pagan\\n\\t\\t\\t\\tMecca; but more probably, I think, it is an allusion to\\n\\t\\t\\t\\tthe arrogance which so often deludes man into regarding\\n\\t\\t\\t\\thimself as \"self-sufficient\" (verses {6-7} above)."
  }
]
