[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "17",
        "bookName": "Book of Breastfeeding",
        "bookNameArabic": "كتاب الرضاع",
        "hadiths": [
            {
                "hadithNo": "3568",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Amrah that 'Aishah told her, that the Messenger of Allah (s.a.w) was with her, and she heard the voice of a man asking permission to enter Hafsah's house. 'Aishah said: \"I said: 'O Messenger of Allah, there is a man asking permission to enter your house.' The Messenger of Allah (s.a.w) said: 'I think it is so-and-so' - Hafsah's paternal uncle through breastfeeding. 'Aishah said: 'O Messenger of Allah, if so-and-so' - her paternal uncle through breastfeeding - were still alive, 'could he enter upon me?' The Messenger of Allah (s.a.w) said: 'Yes, for breastfeeding makes unlawful what birth makes unlawful.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِى بَكْرٍ عَنْ عَمْرَةَ أَنَّ عَائِشَةَ أَخْبَرَتْهَا أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- كَانَ عِنْدَهَا وَإِنَّهَا سَمِعَتْ صَوْتَ رَجُلٍ يَسْتَأْذِنُ فِى بَيْتِ حَفْصَةَ. قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا رَجُلٌ يَسْتَأْذِنُ فِى بَيْتِكَ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أُرَاهُ فُلاَنًا ». لِعَمِّ حَفْصَةَ مِنَ الرَّضَاعَةِ. فَقَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ لَوْ كَانَ فُلاَنٌ حَيًّا - لِعَمِّهَا مِنَ الرَّضَاعَةِ - دَخَلَ عَلَىَّ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « نَعَمْ إِنَّ الرَّضَاعَةَ تُحَرِّمُ مَا تُحَرِّمُ الْوِلاَدَةُ »."
            },
            {
                "hadithNo": "3569",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Amrah that 'Aishah said: \"The Messenger of Allah (s.a.w) said to me: 'What becomes unlawful through breastfeeding is that which becomes unlawful through birth.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ ح وَحَدَّثَنِى أَبُو مَعْمَرٍ إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ الْهُذَلِىُّ حَدَّثَنَا عَلِىُّ بْنُ هَاشِمِ بْنِ الْبَرِيدِ جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِى بَكْرٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ لِى رَسُولُ اللَّهِ -صلى الله عليه وسلم- « يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الْوِلاَدَةِ »."
            },
            {
                "hadithNo": "3570",
                "chapterNo": "1",
                "hadithEnglish": "'Abdullah bin Abi Bakr narrated a Hadith similar to that of Hisham bin 'Urwah (no. 3569), with this chain.",
                "hadithArabic": "وَحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى عَبْدُ اللَّهِ بْنُ أَبِى بَكْرٍ بِهَذَا الإِسْنَادِ. مِثْلَ حَدِيثِ هِشَامِ بْنِ عُرْوَةَ."
            },
            {
                "hadithNo": "3571",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah that Aflah, the brother of Abu Al-Qu'ais, came and asked for permission to enter upon her, who was her paternal uncle through breastfeeding, after (the command of) Hijab had been revealed. She said: \"I refused to let him in, and when the Messenger of Allah (s.a.w) came, I told him what I had done, and he told me to let him in.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّهَا أَخْبَرَتْهُ أَنَّ أَفْلَحَ - أَخَا أَبِى الْقُعَيْسِ - جَاءَ يَسْتَأْذِنُ عَلَيْهَا وَهُوَ عَمُّهَا مِنَ الرَّضَاعَةِ بَعْدَ أَنْ أُنْزِلَ الْحِجَابُ قَالَتْ فَأَبَيْتُ أَنْ آذَنَ لَهُ فَلَمَّا جَاءَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَخْبَرْتُهُ بِالَّذِى صَنَعْتُ فَأَمَرَنِى أَنْ آذَنَ لَهُ عَلَىَّ."
            },
            {
                "hadithNo": "3572",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Aishah said: \"My paternal uncle through breastfeeding, Aflah bin Abu Al-Qu'ais, came to me ...\" and he mentioned a Hadith similar to that of Malik (no. 3571) and added: \"I said: 'It is the woman who breastfed me, not the man.' He  said: 'May your hands' - or 'your right hand -be rubbed with dust.\"'",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِىِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ أَتَانِى عَمِّى مِنَ الرَّضَاعَةِ أَفْلَحُ بْنُ أَبِى قُعَيْسٍ. فَذَكَرَ بِمَعْنَى حَدِيثِ مَالِكٍ وَزَادَ قُلْتُ إِنَّمَا أَرْضَعَتْنِى الْمَرْأَةُ وَلَمْ يُرْضِعْنِى الرَّجُلُ قَالَ « تَرِبَتْ يَدَاكِ أَوْ يَمِينُكِ »."
            },
            {
                "hadithNo": "3573",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Urwah that 'Aishah told him that Aflah, the brother of Abu Al-Qu'ais, came and asked for permission to enter upon her, after the (command of) Hijab had been revealed. Abu Al-Qu'ais was 'Aishah's father through breastfeeding. 'Aishah said: \"I said: 'By Allah, I will not give permission to Aflah. until I seek permission from the Messenger of Allah (s.a.w), for Abu Al-Qu'ais is not the one who breastfed me, rather his wife breastfed me.'\" 'Aishah said: \"When the Messenger of Allah (s.a.w) came in, I said: 'O Messenger of Allah, Aflah, the brother of Abu Al-Qu'ais, came to me and asked permission to enter upon me, but I did not want to give him permission until I asked your permission.' The Prophet (s.a.w) said: 'Give him permission.\"' 'Urwah said: \"Because of that,  'Aishah used to say: 'Regard as unlawful through breastfeeding that which you regard as unlawful through lineage.\"'",
                "hadithArabic": "وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّهُ جَاءَ أَفْلَحُ أَخُو أَبِى الْقُعَيْسِ يَسْتَأْذِنُ عَلَيْهَا بَعْدَ مَا نَزَلَ الْحِجَابُ - وَكَانَ أَبُو الْقُعَيْسِ أَبَا عَائِشَةَ مِنَ الرَّضَاعَةِ - قَالَتْ عَائِشَةُ فَقُلْتُ وَاللَّهِ لاَ آذَنُ لأَفْلَحَ حَتَّى أَسْتَأْذِنَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَإِنَّ أَبَا الْقُعَيْسِ لَيْسَ هُوَ أَرْضَعَنِى وَلَكِنْ أَرْضَعَتْنِى امْرَأَتُهُ - قَالَتْ عَائِشَةُ - فَلَمَّا دَخَلَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَفْلَحَ أَخَا أَبِى الْقُعَيْسِ جَاءَنِى يَسْتَأْذِنُ عَلَىَّ فَكَرِهْتُ أَنْ آذَنَ لَهُ حَتَّى أَسْتَأْذِنَكَ - قَالَتْ - فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- « ائْذَنِى لَهُ ». قَالَ عُرْوَةُ فَبِذَلِكَ كَانَتْ عَائِشَةُ تَقُولُ حَرِّمُوا مِنَ الرَّضَاعَةِ مَا تُحَرِّمُونَ مِنَ النَّسَبِ."
            },
            {
                "hadithNo": "3574",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Az-Zuhri with this chain: \"Aflah, the brother of Abu Al-Qu'ais, came and asked permission to enter upon her ...\" a similar Hadith (as no. 3572), in which it says: \"He is your paternal uncle, may your right hand be rubbed with dust.\" Abu Al-Qu'ais was the husband of the woman who breastfed 'Aishah.",
                "hadithArabic": "وَحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ جَاءَ أَفْلَحُ أَخُو أَبِى الْقُعَيْسِ يَسْتَأْذِنُ عَلَيْهَا. بِنَحْوِ حَدِيثِهِمْ وَفِيهِ « فَإِنَّهُ عَمُّكِ تَرِبَتْ يَمِينُكِ ». وَكَانَ أَبُو الْقُعَيْسِ زَوْجَ الْمَرْأَةِ الَّتِى أَرْضَعَتْ عَائِشَةَ."
            },
            {
                "hadithNo": "3575",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Aishah said: \"My paternal uncle through breastfeeding came and asked permission to enter upon me, and I refused to give him permission until I consulted the Messenger of Allah (s.a.w). When the Messenger of Allah (s.a.w) came, I said: 'My paternal uncle through breastfeeding came and asked for permission to enter upon me, but I refused to give him permission.' The Messenger of Allah (s.a.w) said: 'Let your uncle enter upon you.' I said: 'But it is the woman who breastfed me; the man did not breastfeed me.' He said: 'He is your uncle, let him enter upon you.'\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ جَاءَ عَمِّى مِنَ الرَّضَاعَةِ يَسْتَأْذِنُ عَلَىَّ فَأَبَيْتُ أَنْ آذَنَ لَهُ حَتَّى أَسْتَأْمِرَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَلَمَّا جَاءَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- قُلْتُ إِنَّ عَمِّى مِنَ الرَّضَاعَةِ اسْتَأْذَنَ عَلَىَّ فَأَبَيْتُ أَنْ آذَنَ لَهُ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « فَلْيَلِجْ عَلَيْكِ عَمُّكِ ». قُلْتُ إِنَّمَا أَرْضَعَتْنِى الْمَرْأَةُ وَلَمْ يُرْضِعْنِى الرَّجُلُ قَالَ « إِنَّهُ عَمُّكِ فَلْيَلِجْ عَلَيْكِ »."
            },
            {
                "hadithNo": "3576",
                "chapterNo": "2",
                "hadithEnglish": "Hisham narrated with this chain that the brother of Abu Qu'ais asked for permission to enter upon her... a similar report (as no. 3575).",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الرَّبِيعِ الزَّهْرَانِىُّ حَدَّثَنَا حَمَّادٌ - يَعْنِى ابْنَ زَيْدٍ - حَدَّثَنَا هِشَامٌ بِهَذَا الإِسْنَادِ أَنَّ أَخَا أَبِى الْقُعَيْسِ اسْتَأْذَنَ عَلَيْهَا. فَذَكَرَ نَحْوَهُ."
            },
            {
                "hadithNo": "3577",
                "chapterNo": "2",
                "hadithEnglish": "A similar report (as no. 3575) was narrated from Hisham, with this chain, except that he said: \"Abu Al-Qu'ais asked for permission to enter upon her.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامٍ بِهَذَا الإِسْنَادِ نَحْوَهُ غَيْرَ أَنَّهُ قَالَ اسْتَأْذَنَ عَلَيْهَا أَبُو الْقُعَيْسِ."
            },
            {
                "hadithNo": "3578",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Ibn Juraij from 'Ata', who said: \"'Urwah bin Az-Zubair informed me that 'Aishah told him: 'My paternal uncle through breastfeeding, Abu Al-Ja'd, asked for permission to enter upon me, and I refused.\"' - Hisham said to me: \"In fact it was Abu Al-Qu'ais.\" - \"When the Prophet (s.a.w) came, I told him about that and he said: 'Why didn't you let him in, may your right hand - or your hand - be rubbed with dust?\"'",
                "hadithArabic": "وَحَدَّثَنِى الْحَسَنُ بْنُ عَلِىٍّ الْحُلْوَانِىُّ وَمُحَمَّدُ بْنُ رَافِعٍ قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ أَخْبَرَنِى عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ أَخْبَرَتْهُ قَالَتِ اسْتَأْذَنَ عَلَىَّ عَمِّى مِنَ الرَّضَاعَةِ أَبُو الْجَعْدِ فَرَدَدْتُهُ - قَالَ لِى هِشَامٌ إِنَّمَا هُوَ أَبُو الْقُعَيْسِ - فَلَمَّا جَاءَ النَّبِىُّ -صلى الله عليه وسلم- أَخْبَرْتُهُ بِذَلِكَ قَالَ « فَهَلاَّ أَذِنْتِ لَهُ تَرِبَتْ يَمِينُكِ أَوْ يَدُكِ »."
            },
            {
                "hadithNo": "3579",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah that her paternal uncle through breastfeeding, who was called Aflah, asked for permission to enter upon her, and she did not give him permission to enter until she had put on Hijab. She told the Messenger of Allah (s.a.w). and he said to her: \"Do not observe Hijab before him, for what becomes unlawful through breastfeeding is that which becomes unlawful through lineage.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِى حَبِيبٍ عَنْ عِرَاكٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا أَخْبَرَتْهُ أَنَّ عَمَّهَا مِنَ الرَّضَاعَةِ - يُسَمَّى أَفْلَحَ - اسْتَأْذَنَ عَلَيْهَا فَحَجَبَتْهُ فَأَخْبَرَتْ رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ لَهَا « لاَ تَحْتَجِبِى مِنْهُ فَإِنَّهُ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ النَّسَبِ »."
            },
            {
                "hadithNo": "3580",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Aishah said: \"Aflah. bin Qu'ais asked for permission to enter upon me, and I refused to let him in. He sent word saying: 'I am your paternal uncle, my brother's wife breastfed you.' But she refused to let him in. Then the Messenger of Allah (s.a.w) came, and she told him about that, and he said: 'Let him enter upon you, for he is your paternal uncle.\"'",
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِىُّ حَدَّثَنَا أَبِى حَدَّثَنَا شُعْبَةُ عَنِ الْحَكَمِ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتِ اسْتَأْذَنَ عَلَىَّ أَفْلَحُ بْنُ قُعَيْسٍ فَأَبَيْتُ أَنْ آذَنَ لَهُ فَأَرْسَلَ إِنِّى عَمُّكِ أَرْضَعَتْكِ امْرَأَةُ أَخِى. فَأَبَيْتُ أَنْ آذَنَ لَهُ فَجَاءَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ « لِيَدْخُلْ عَلَيْكِ فَإِنَّهُ عَمُّكِ »."
            },
            {
                "hadithNo": "3581",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that 'Ali said: \"I said: 'O Messenger of Allah, why do you insist on choosing a wife from among the Quraish and you ignore us?' He said: 'Have you anything to suggest?' I said: 'Yes, the daughter of Hamzah.' The Messenger of Allah (s.a.w) said: 'She is not permissible for me (to marry), for she is the daughter of my brother through breastfeeding.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لأَبِى بَكْرٍ - قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ أَبِى عَبْدِ الرَّحْمَنِ عَنْ عَلِىٍّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا لَكَ تَنَوَّقُ فِى قُرَيْشٍ وَتَدَعُنَا فَقَالَ « وَعِنْدَكُمْ شَىْءٌ ». قُلْتُ نَعَمْ بِنْتُ حَمْزَةَ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّهَا لاَ تَحِلُّ لِى إِنَّهَا ابْنَةُ أَخِى مِنَ الرَّضَاعَةِ »."
            },
            {
                "hadithNo": "3582",
                "chapterNo": "3",
                "hadithEnglish": "A similar report (as no. 3581) was narrated from Al-A'mash with this chain.",
                "hadithArabic": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ عَنْ جَرِيرٍ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنَا مُحَمَّدُ بْنُ أَبِى بَكْرٍ الْمُقَدَّمِىُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِىٍّ عَنْ سُفْيَانَ كُلُّهُمْ عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "3583",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that it was suggested that the Prophet (s.a.w) marry the daughter of Hamzah. He said: \"She is not permissible for me (to marry), for she is the daughter of my brother through breastfeeding, and what becomes unlawful through breastfeeding is that which becomes unlawful through ties of kinship.\"",
                "hadithArabic": "وَحَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ جَابِرِ بْنِ زَيْدٍ عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- أُرِيدَ عَلَى ابْنَةِ حَمْزَةَ فَقَالَ « إِنَّهَا لاَ تَحِلُّ لِى إِنَّهَا ابْنَةُ أَخِى مِنَ الرَّضَاعَةِ وَيَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ الرَّحِمِ »."
            },
            {
                "hadithNo": "3584",
                "chapterNo": "3",
                "hadithEnglish": "The same report (no. 3583) was narrated from Qatadah with the chain of Hammam, except that the Hadith of Shu'bah ends with the words \"... the daughter of my brother through breastfeeding.\" In the Hadith of Sa'eed it says: \"Verily what becomes unlawful through breastfeeding is that which becomes unlawful through blood ties\"",
                "hadithArabic": "وَحَدَّثَنَاهُ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى وَهُوَ الْقَطَّانُ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ مِهْرَانَ الْقُطَعِىُّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ جَمِيعًا عَنْ شُعْبَةَ ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَلِىُّ بْنُ مُسْهِرٍ عَنْ سَعِيدِ بْنِ أَبِى عَرُوبَةَ كِلاَهُمَا عَنْ قَتَادَةَ بِإِسْنَادِ هَمَّامٍ سَوَاءً غَيْرَ أَنَّ حَدِيثَ شُعْبَةَ انْتَهَى عِنْدَ قَوْلِهِ « ابْنَةُ أَخِى مِنَ الرَّضَاعَةِ ». وَفِى حَدِيثِ سَعِيدٍ « وَإِنَّهُ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ النَّسَبِ ». وَفِى رِوَايَةِ بِشْرِ بْنِ عُمَرَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ."
            },
            {
                "hadithNo": "3585",
                "chapterNo": "3",
                "hadithEnglish": "Umm Salamah, the wife of the Prophet (s.a.w) said: \"It was said to the Messenger of Allah (s.a.w): 'What do you think, O Messenger of Allah, about the daughter of Hamzah?' Or it was said: 'Why don't you propose marriage to the daughter of Hamzah bin 'Abdul-Muttalib?' He said: 'Hamzah is my brother through breastfeeding.\"'",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ وَأَحْمَدُ بْنُ عِيسَى قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى مَخْرَمَةُ بْنُ بُكَيْرٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُسْلِمٍ يَقُولُ سَمِعْتُ مُحَمَّدَ بْنَ مُسْلِمٍ يَقُولُ سَمِعْتُ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُ سَمِعْتُ أُمَّ سَلَمَةَ زَوْجَ النَّبِىِّ -صلى الله عليه وسلم- تَقُولُ قِيلَ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- أَيْنَ أَنْتَ يَا رَسُولَ اللَّهِ عَنِ ابْنَةِ حَمْزَةَ. أَوْ قِيلَ أَلاَ تَخْطُبُ بِنْتَ حَمْزَةَ بْنِ عَبْدِ الْمُطَّلِبِ قَالَ « إِنَّ حَمْزَةَ أَخِى مِنَ الرَّضَاعَةِ »."
            },
            {
                "hadithNo": "3586",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Umm Habibah bint Abi Sufyan said: \"The Messenger of Allah (s.a.w) entered upon me and I said to him: 'What about my sister, the daughter of Abu Sufyan?' He said: 'What should I do?' I said: 'Marry her.' He said: 'Would you like that?' I said: 'I am not your only wife, and I would like my sister to share with me in this goodness.' He said: 'She is not permissible for me (to marry).' I said: 'I have been told that you proposed marriage to Durrah bint Abi Salamah.' He said: 'The daughter of Umm Salamah?' I said: 'Yes.' He said: 'Even if she was not my stepdaughter under my care, she would not be permissible for me (to marry); her father and I were both breastfed by Thuwaibah. Do not offer your daughters or sisters to me in marriage.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ أَخْبَرَنَا هِشَامٌ أَخْبَرَنَا أَبِى عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِى سُفْيَانَ قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقُلْتُ لَهُ هَلْ لَكَ فِى أُخْتِى بِنْتِ أَبِى سُفْيَانَ فَقَالَ « أَفْعَلُ مَاذَا ». قُلْتُ تَنْكِحُهَا. قَالَ « أَوَتُحِبِّينَ ذَلِكَ ». قُلْتُ لَسْتُ لَكَ بِمُخْلِيَةٍ وَأَحَبُّ مَنْ شَرِكَنِى فِى الْخَيْرِ أُخْتِى. قَالَ « فَإِنَّهَا لاَ تَحِلُّ لِى ». قُلْتُ فَإِنِّى أُخْبِرْتُ أَنَّكَ تَخْطُبُ دُرَّةَ بِنْتَ أَبِى سَلَمَةَ. قَالَ « بِنْتَ أُمِّ سَلَمَةَ ». قُلْتُ نَعَمْ. قَالَ « لَوْ أَنَّهَا لَمْ تَكُنْ رَبِيبَتِى فِى حَجْرِى مَا حَلَّتْ لِى إِنَّهَا ابْنَةُ أَخِى مِنَ الرَّضَاعَةِ أَرْضَعَتْنِى وَأَبَاهَا ثُوَيْبَةُ فَلاَ تَعْرِضْنَ عَلَىَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ »."
            },
            {
                "hadithNo": "3587",
                "chapterNo": "4",
                "hadithEnglish": "A similar report (as no. 3586) was narrated from Hisham bin 'Urwah with this chain.",
                "hadithArabic": "وَحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِى زَائِدَةَ ح وَحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ أَخْبَرَنَا زُهَيْرٌ كِلاَهُمَا عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الإِسْنَادِ سَوَاءً."
            },
            {
                "hadithNo": "3588",
                "chapterNo": "4",
                "hadithEnglish": "Umm Habibah, the wife of the Prophet (s.a.w), narrated that she said to the Messenger of Allah (s.a.w): \"O Messenger of Allah, marry my sister 'Azzah.\" The Messenger of Allah (s.a.w) said: \"Would you like that?\" She said: \"Yes, O Messenger of Allah. I am not your only wife, and I would like my sister to share with me in the goodness.\" The Messenger of Allah (s.a.w) said: \"That is not permissible for me.\" I said: \"O Messenger of Allah, we have been told that you want to marry Durrah hint Abi Salamah.\" He said: \"The daughter of Abu Salamah?\" She said: \"Yes.\" The Messenger of Allah (s.a.w) said: \"Even if she were not my stepdaughter under my care, she would not be permissible for me (to marry), for she is the daughter of my brother through breastfeeding. Her father Abu Salamah and I were both breastfed by Thuwaibah. Do not offer your daughters or sisters to me in marriage.\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ أَخْبَرَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِى حَبِيبٍ أَنَّ مُحَمَّدَ بْنَ شِهَابٍ كَتَبَ يَذْكُرُ أَنَّ عُرْوَةَ حَدَّثَهُ أَنَّ زَيْنَبَ بِنْتَ أَبِى سَلَمَةَ حَدَّثَتْهُ أَنَّ أُمَّ حَبِيبَةَ زَوْجَ النَّبِىِّ -صلى الله عليه وسلم- حَدَّثَتْهَا أَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- يَا رَسُولَ اللَّهِ انْكِحْ أُخْتِى عَزَّةَ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَتُحِبِّينَ ذَلِكِ ». فَقَالَتْ نَعَمْ يَا رَسُولَ اللَّهِ لَسْتُ لَكَ بِمُخْلِيَةٍ وَأَحَبُّ مَنْ شَرِكَنِى فِى خَيْرٍ أُخْتِى. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « فَإِنَّ ذَلِكِ لاَ يَحِلُّ لِى ». قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ فَإِنَّا نَتَحَدَّثُ أَنَّكَ تُرِيدُ أَنْ تَنْكِحَ دُرَّةَ بِنْتَ أَبِى سَلَمَةَ. قَالَ « بِنْتَ أَبِى سَلَمَةَ ». قَالَتْ نَعَمْ. قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَوْ أَنَّهَا لَمْ تَكُنْ رَبِيبَتِى فِى حَجْرِى مَا حَلَّتْ لِى إِنَّهَا ابْنَةُ أَخِى مِنَ الرَّضَاعَةِ أَرْضَعَتْنِى وَأَبَا سَلَمَةَ ثُوَيْبَةُ فَلاَ تَعْرِضْنَ عَلَىَّ بَنَاتِكُنَّ وَلاَ أَخَوَاتِكُنَّ »."
            },
            {
                "hadithNo": "3589",
                "chapterNo": "4",
                "hadithEnglish": "A similar Hadith (as no. 3588) was narrated from Az-Zuhri with the chain of Ibn Abi Habibah, but none of them mentioned 'Azzah by name except Yazid bin Abi Habibah.",
                "hadithArabic": "وَحَدَّثَنِيهِ عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِى أَبِى عَنْ جَدِّى حَدَّثَنِى عُقَيْلُ بْنُ خَالِدٍ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنِى يَعْقُوبُ بْنُ إِبْرَاهِيمَ الزُّهْرِىُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ كِلاَهُمَا عَنِ الزُّهْرِىِّ بِإِسْنَادِ ابْنِ أَبِى حَبِيبٍ عَنْهُ نَحْوَ حَدِيثِهِ وَلَمْ يُسَمِّ أَحَدٌ مِنْهُمْ فِى حَدِيثِهِ عَزَّةَ غَيْرُ يَزِيدَ بْنِ أَبِى حَبِيبٍ."
            },
            {
                "hadithNo": "3590",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that 'Aishah said: \"The Messenger of Allah (s.a.w) said: 'One or two sucks do not make anything forbidden.\"'",
                "hadithArabic": "حَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا إِسْمَاعِيلُ ح وَحَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ كِلاَهُمَا عَنْ أَيُّوبَ عَنِ ابْنِ أَبِى مُلَيْكَةَ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَقَالَ سُوَيْدٌ وَزُهَيْرٌ إِنَّ النَّبِىَّ -صلى الله عليه وسلم- قَالَ « لاَ تُحَرِّمُ الْمَصَّةُ وَالْمَصَّتَانِ »."
            },
            {
                "hadithNo": "3591",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Umm Al-Fadl said: \"A Bedouin entered upon the Prophet of Allah (s.a.w) when he was in my house, and said: 'O Prophet of Allah, I have a wife and I took another wife. My first wife claims that she breastfed my new wife once or twice.' The Prophet of Allah (s.a.w) said: 'One or two sucks do not make anything forbidden.\"' 'Amr said in his report: \"It was narrated from 'Abdullah bin Al-Harith bin Nawfal.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَعَمْرٌو النَّاقِدُ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ كُلُّهُمْ عَنِ الْمُعْتَمِرِ - وَاللَّفْظُ لِيَحْيَى - أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ أَيُّوبَ يُحَدِّثُ عَنْ أَبِى الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ الْفَضْلِ قَالَتْ دَخَلَ أَعْرَابِىٌّ عَلَى نَبِىِّ اللَّهِ -صلى الله عليه وسلم- وَهُوَ فِى بَيْتِى فَقَالَ يَا نَبِىَّ اللَّهِ إِنِّى كَانَتْ لِى امْرَأَةٌ فَتَزَوَّجْتُ عَلَيْهَا أُخْرَى فَزَعَمَتِ امْرَأَتِى الأُولَى أَنَّهَا أَرْضَعَتِ امْرَأَتِى الْحُدْثَى رَضْعَةً أَوْ رَضْعَتَيْنِ.\r\nفَقَالَ نَبِىُّ اللَّهِ -صلى الله عليه وسلم- « لاَ تُحَرِّمُ الإِمْلاَجَةُ وَالإِمْلاَجَتَانِ ». قَالَ عَمْرٌو فِى رِوَايَتِهِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ."
            },
            {
                "hadithNo": "3592",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Umm Al-Fadl that a man from Banu 'Amir bin Sa'sa'ah said: \"O Prophet of Allah, does a single breastfeeding make anything forbidden?\" He said: \"No.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو غَسَّانَ الْمِسْمَعِىُّ حَدَّثَنَا مُعَاذٌ ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِى أَبِى عَنْ قَتَادَةَ عَنْ صَالِحِ بْنِ أَبِى مَرْيَمَ أَبِى الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ الْفَضْلِ أَنَّ رَجُلاً مِنْ بَنِى عَامِرِ بْنِ صَعْصَعَةَ قَالَ يَا نَبِىَّ اللَّهِ هَلْ تُحَرِّمُ الرَّضْعَةُ الْوَاحِدَةُ قَالَ « لاَ »."
            },
            {
                "hadithNo": "3593",
                "chapterNo": "5",
                "hadithEnglish": "Umm Al-Fadl narrated that the Prophet of Allah (s.a.w) said: \"One or two breastfeedings, or one or two sucks, do not make anything forbidden.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِى عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَبِى الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ أَنَّ أُمَّ الْفَضْلِ حَدَّثَتْ أَنَّ نَبِىَّ اللَّهِ -صلى الله عليه وسلم- قَالَ « لاَ تُحَرِّمُ الرَّضْعَةُ أَوِ الرَّضْعَتَانِ أَوِ الْمَصَّةُ أَوِ الْمَصَّتَانِ »."
            },
            {
                "hadithNo": "3594",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Ibn 'Abi 'Arubah, with this chain (a Hadith similar to no. 3593). As for Ishaq, he said, as in the report of Ibn Bishr: \"... or two breastfeedings or two sucks.\" As for Ibn Abi Shaibah, he said: \"... and two breastfeedings and two sucks.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ عَبْدَةَ بْنِ سُلَيْمَانَ عَنِ ابْنِ أَبِى عَرُوبَةَ بِهَذَا الإِسْنَادِ أَمَّا إِسْحَاقُ فَقَالَ كَرِوَايَةِ ابْنِ بِشْرٍ « أَوِ الرَّضْعَتَانِ أَوِ الْمَصَّتَانِ ». وَأَمَّا ابْنُ أَبِى شَيْبَةَ فَقَالَ « وَالرَّضْعَتَانِ وَالْمَصَّتَانِ »."
            },
            {
                "hadithNo": "3595",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Umm Al-Fadl that the Prophet (s.a.w) said: \"One or two sucks do not make anything forbidden.\"",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا بِشْرُ بْنُ السَّرِىِّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ عَنْ أَبِى الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ عَنْ أَمِّ الْفَضْلِ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « لاَ تُحَرِّمُ الإِمْلاَجَةُ وَالإِمْلاَجَتَانِ »."
            },
            {
                "hadithNo": "3596",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Umm Al-Fadl that a man asked the Prophet (s.a.w): \"Does one suck make anything forbidden?\" He said: \"No.\"",
                "hadithArabic": "حَدَّثَنِى أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِىُّ حَدَّثَنَا حَبَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَبِى الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ الْفَضْلِ سَأَلَ رَجُلٌ النَّبِىَّ -صلى الله عليه وسلم- أَتُحَرِّمُ الْمَصَّةُ فَقَالَ « لاَ »."
            },
            {
                "hadithNo": "3597",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that 'Aishah said: \"Among the things that were revealed of the Qur'an was that ten definite breastfeedings make a person a Mahram, then that was abrogated and replaced with five definite breastfeedings, and the Messenger of Allah (s.a.w) passed away when this was among the things that were recited of the Qur'an.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِى بَكْرٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ فِيمَا أُنْزِلَ مِنَ الْقُرْآنِ عَشْرُ رَضَعَاتٍ مَعْلُومَاتٍ يُحَرِّمْنَ. ثُمَّ نُسِخْنَ بِخَمْسٍ مَعْلُومَاتٍ فَتُوُفِّىَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَهُنَّ فِيمَا يُقْرَأُ مِنَ الْقُرْآنِ."
            },
            {
                "hadithNo": "3598",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from 'Amrah that she heard 'Aishah say - when she was mentioning what kind of breastfeeding makes a person a Mahram - Ten definite breastfeedings were revealed in the Qur'an, then five definite breastfeedings were revealed too.",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِىُّ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ عَنْ يَحْيَى - وَهُوَ ابْنُ سَعِيدٍ - عَنْ عَمْرَةَ أَنَّهَا سَمِعَتْ عَائِشَةَ تَقُولُ - وَهْىَ تَذْكُرُ الَّذِى يُحَرِّمُ مِنَ الرَّضَاعَةِ - قَالَتْ عَمْرَةُ فَقَالَتْ عَائِشَةُ نَزَلَ فِى الْقُرْآنِ عَشْرُ رَضَعَاتٍ مَعْلُومَاتٍ ثُمَّ نَزَلَ أَيْضًا خَمْسٌ مَعْلُومَاتٌ."
            },
            {
                "hadithNo": "3599",
                "chapterNo": "6",
                "hadithEnglish": "'Amrah narrated that she heard 'Aishah say... a similar report (as no. 3597).",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ قَالَ أَخْبَرَتْنِى عَمْرَةُ أَنَّهَا سَمِعَتْ عَائِشَةَ تَقُولُ. بِمِثْلِهِ."
            },
            {
                "hadithNo": "3600",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that 'Aishah said: \"Sahlah bint Suhail came to the Prophet (s.a.w) and said: 'O Messenger of Allah, I see (signs of displeasure) on the face of Abu Hudhaifah when Salim- who was his-ally - comes in. The Prophet (s.a.w) said: 'Breastfeed him.' She said: 'How can I breastfeed him? He is a grown man.' The Messenger of Allah (s.a.w) smiled and said: 'I know that he is a grown man.\"' 'Amr added in his Hadith: \"He was one of those who had been present at Badr.'' In the report of Ibn Abi 'Umar: \"The Messenger of Allah (s.a.w) laughed.''",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ أَبِى عُمَرَ قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ جَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلٍ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّى أَرَى فِى وَجْهِ أَبِى حُذَيْفَةَ مِنْ دُخُولِ سَالِمٍ - وَهُوَ حَلِيفُهُ. فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- « أَرْضِعِيهِ ». قَالَتْ وَكَيْفَ أُرْضِعُهُ وَهُوَ رَجُلٌ كَبِيرٌ فَتَبَسَّمَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَقَالَ « قَدْ عَلِمْتُ أَنَّهُ رَجُلٌ كَبِيرٌ ». زَادَ عَمْرٌو فِى حَدِيثِهِ وَكَانَ قَدْ شَهِدَ بَدْرًا. وَفِى رِوَايَةِ ابْنِ أَبِى عُمَرَ فَضَحِكَ رَسُولُ اللَّهِ -صلى الله عليه وسلم-."
            },
            {
                "hadithNo": "3601",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from 'Aishah that Salim, the freed slave of Abu Hudhaifah, was with Abu Hudhaifah and his family in their house. She meaning the daughter of Suhail ( ans wife of Abu Hudhaifah )- came to the Prophet (s.a.w) and said: \"Salim has attained what men attain (puberty) and he understands what they understand. He enters upon us and I think that Abu Hudhaifah feels some (discomfort) in his heart because of that.\" The Prophet (s.a.w) said to her: \"Breastfeed him and he will be unlawful for you, and what Abu Hudhaifah feels in his heart will disappear.\" She came back to him and said: \"I breastfed him, and what Abu Hudhaifah felt in his heart has disappeared.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِىُّ وَمُحَمَّدُ بْنُ أَبِى عُمَرَ جَمِيعًا عَنِ الثَّقَفِىِّ - قَالَ ابْنُ أَبِى عُمَرَ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِىُّ - عَنْ أَيُّوبَ عَنِ ابْنِ أَبِى مُلَيْكَةَ عَنِ الْقَاسِمِ عَنْ عَائِشَةَ أَنَّ سَالِمًا مَوْلَى أَبِى حُذَيْفَةَ كَانَ مَعَ أَبِى حُذَيْفَةَ وَأَهْلِهِ فِى بَيْتِهِمْ فَأَتَتْ - تَعْنِى ابْنَةَ سُهَيْلٍ - النَّبِىَّ -صلى الله عليه وسلم- فَقَالَتْ إِنَّ سَالِمًا قَدْ بَلَغَ مَا يَبْلُغُ الرِّجَالُ وَعَقَلَ مَا عَقَلُوا وَإِنَّهُ يَدْخُلُ عَلَيْنَا وَإِنِّى أَظُنُّ أَنَّ فِى نَفْسِ أَبِى حُذَيْفَةَ مِنْ ذَلِكَ شَيْئًا. فَقَالَ لَهَا النَّبِىُّ -صلى الله عليه وسلم- « أَرْضِعِيهِ تَحْرُمِى عَلَيْهِ وَيَذْهَبِ الَّذِى فِى نَفْسِ أَبِى حُذَيْفَةَ ». فَرَجَعَتْ فَقَالَتْ إِنِّى قَدْ أَرْضَعْتُهُ فَذَهَبَ الَّذِى فِى نَفْسِ أَبِى حُذَيْفَةَ."
            },
            {
                "hadithNo": "3602",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from 'Aishah that Sahlah bint Suhail bin 'Amr came to the Prophet (s.a.w) and said: \"O Messenger of Allah, Salim - meaning Salim, the freed slave of Abu Hudhaifah - is with us in our house, and he has attained what men attain and knows what men know.\" He said: \"Breastfeed him and he will be unlawful for you.\" He (Ibn Abi Mulaikah, a narrator) said: \"For a year or so I did not narrate this out of fear, then I met Al-Qasim and said to him: 'You told me a Hadith that I have not narrated yet.' He said: 'What is it?' And I told him. He said: 'Narrate from me that 'Aishah told me that.\"'",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ رَافِعٍ - وَاللَّفْظُ لاِبْنِ رَافِعٍ - قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنَا ابْنُ أَبِى مُلَيْكَةَ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدِ بْنِ أَبِى بَكْرٍ أَخْبَرَهُ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّ سَهْلَةَ بِنْتَ سُهَيْلِ بْنِ عَمْرٍو جَاءَتِ النَّبِىَّ -صلى الله عليه وسلم- فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ سَالِمًا - لِسَالِمٍ مَوْلَى أَبِى حُذَيْفَةَ - مَعَنَا فِى بَيْتِنَا وَقَدْ بَلَغَ مَا يَبْلُغُ الرِّجَالُ وَعَلِمَ مَا يَعْلَمُ الرِّجَالُ. قَالَ « أَرْضِعِيهِ تَحْرُمِى عَلَيْهِ ». قَالَ فَمَكَثْتُ سَنَةً أَوْ قَرِيبًا مِنْهَا لاَ أُحَدِّثُ بِهِ وَهِبْتُهُ ثُمَّ لَقِيتُ الْقَاسِمَ فَقُلْتُ لَهُ لَقَدْ حَدَّثْتَنِى حَدِيثًا مَا حَدَّثْتُهُ بَعْدُ. قَالَ فَمَا هُوَ فَأَخْبَرْتُهُ. قَالَ فَحَدِّثْهُ عَنِّى أَنَّ عَائِشَةَ أَخْبَرَتْنِيهِ."
            },
            {
                "hadithNo": "3603",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Zainab bint Umm Salamah said: Umm Salamah said to Aishah: 'There enters upon you a slave boy who is close to puberty, and I would not like him to enter upon me. 'Aishah said: Do you not have a good example in the Messenger of Allah (s.a.w)? She said: The wife of Abu Hudhaifah said: \"O Messenger of Allah, Salim enters upon me and he is a man, and there is some (discomfort) in the heart of Abu Hudhaifah about that.\" The Messenger of Allah (s.a.w) said: \"Breastfeed him so that he may enter upon you.\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ نَافِعٍ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ قَالَتْ قَالَتْ أُمُّ سَلَمَةَ لِعَائِشَةَ إِنَّهُ يَدْخُلُ عَلَيْكِ الْغُلاَمُ الأَيْفَعُ الَّذِى مَا أُحِبُّ أَنْ يَدْخُلَ عَلَىَّ. قَالَ فَقَالَتْ عَائِشَةُ أَمَا لَكِ فِى رَسُولِ اللَّهِ -صلى الله عليه وسلم- أُسْوَةٌ قَالَتْ إِنَّ امْرَأَةَ أَبِى حُذَيْفَةَ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ سَالِمًا يَدْخُلُ عَلَىَّ وَهُوَ رَجُلٌ وَفِى نَفْسِ أَبِى حُذَيْفَةَ مِنْهُ شَىْءٌ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَرْضِعِيهِ حَتَّى يَدْخُلَ عَلَيْكِ »."
            },
            {
                "hadithNo": "3604",
                "chapterNo": "7",
                "hadithEnglish": "Zainab bint Abi Salamah said: I heard Umm Salamah, the wife of the Prophet (s.a.w) say to 'Aishah: By Allah, I do not like a boy who has passed the age of breastfeeding to see me. She said: Why? Sahlah bint Sa'd came to the Messenger of Allah (s.a.w) and said: \"O Messenger of Allah, by Allah, I see some (discomfort) in the face of Abu Hudhaifah when Salim comes in.\" The Messenger of Allah (s.a.w) said: \"Breastfeed him.\" She said: \"He has a beard.\" He said: \"Breastfeed him, and that which is in the face of Abu Hudhaifah will disappear.\" She said: \"By Allah, I did not see it in the face of Abu Hudhaifah (after that).\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ - وَاللَّفْظُ لِهَارُونَ - قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى مَخْرَمَةُ بْنُ بُكَيْرٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ حُمَيْدَ بْنَ نَافِعٍ يَقُولُ سَمِعْتُ زَيْنَبَ بِنْتَ أَبِى سَلَمَةَ تَقُولُ سَمِعْتُ أُمَّ سَلَمَةَ زَوْجَ النَّبِىِّ -صلى الله عليه وسلم- تَقُولُ لِعَائِشَةَ وَاللَّهِ مَا تَطِيبُ نَفْسِى أَنْ يَرَانِى الْغُلاَمُ قَدِ اسْتَغْنَى عَنِ الرَّضَاعَةِ. فَقَالَتْ لِمَ قَدْ جَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلٍ إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ إِنِّى لأَرَى فِى وَجْهِ أَبِى حُذَيْفَةَ مِنْ دُخُولِ سَالِمٍ. قَالَتْ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَرْضِعِيهِ ». فَقَالَتْ إِنَّهُ ذُو لِحْيَةٍ. فَقَالَ « أَرْضِعِيهِ يَذْهَبْ مَا فِى وَجْهِ أَبِى حُذَيْفَةَ ». فَقَالَتْ وَاللَّهِ مَا عَرَفْتُهُ فِى وَجْهِ أَبِى حُذَيْفَةَ."
            },
            {
                "hadithNo": "3605",
                "chapterNo": "7",
                "hadithEnglish": "Zainab bint Abi Salamah narrated that her mother Umm Salamah, the wife of the Prophet (s.a.w), used to say: \"The other wives of the Prophet (s.a.w) used to refuse to admit anyone on the basis of that breastfeeding (of a grown-up). They said to 'Aishah, 'By Allah, we think that this is a concession which the Messenger of Allah (s.a.w) granted only in the case of Salim. No one will enter upon us or see us on the basis of this type of breastfeeding. \"'",
                "hadithArabic": "حَدَّثَنِى عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِى أَبِى عَنْ جَدِّى حَدَّثَنِى عُقَيْلُ بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ أَنَّهُ قَالَ أَخْبَرَنِى أَبُو عُبَيْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ زَمْعَةَ أَنَّ أُمَّهُ زَيْنَبَ بِنْتَ أَبِى سَلَمَةَ أَخْبَرَتْهُ أَنَّ أُمَّهَا أُمَّ سَلَمَةَ زَوْجَ النَّبِىِّ -صلى الله عليه وسلم- كَانَتْ تَقُولُ أَبَى سَائِرُ أَزْوَاجِ النَّبِىِّ -صلى الله عليه وسلم- أَنْ يُدْخِلْنَ عَلَيْهِنَّ أَحَدًا بِتِلْكَ الرَّضَاعَةِ وَقُلْنَ لِعَائِشَةَ وَاللَّهِ مَا نَرَى هَذَا إِلاَّ رُخْصَةً أَرْخَصَهَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- لِسَالِمٍ خَاصَّةً فَمَا هُوَ بِدَاخِلٍ عَلَيْنَا أَحَدٌ بِهَذِهِ الرَّضَاعَةِ وَلاَ رَائِينَا."
            },
            {
                "hadithNo": "3606",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Masruq said: \"Aishah said: The Messenger of Allah (s.a.w) entered upon me and there was a man sitting in my house. He felt upset because of that and I saw signs of anger in his face. I said: \"O Messenger of Allah, he is my brother through breastfeeding.\" He said: \"Consider who are your brothers through breastfeeding, for breastfeeding is only through hunger.\"",
                "hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِىِّ حَدَّثَنَا أَبُو الأَحْوَصِ عَنْ أَشْعَثَ بْنِ أَبِى الشَّعْثَاءِ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ قَالَ قَالَتْ عَائِشَةُ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَعِنْدِى رَجُلٌ قَاعِدٌ فَاشْتَدَّ ذَلِكَ عَلَيْهِ وَرَأَيْتُ الْغَضَبَ فِى وَجْهِهِ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُ أَخِى مِنَ الرَّضَاعَةِ. قَالَتْ فَقَالَ « انْظُرْنَ إِخْوَتَكُنَّ مِنَ الرَّضَاعَةِ فَإِنَّمَا الرَّضَاعَةُ مِنَ الْمَجَاعَةِ »."
            },
            {
                "hadithNo": "3607",
                "chapterNo": "8",
                "hadithEnglish": "A similar Hadith (as no. 3606) was narrated from Ash'ath bin Abi Ash-Sha'tha' with the chain of Abu Al-Ahwas.",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِى قَالاَ جَمِيعًا حَدَّثَنَا شُعْبَةُ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِىٍّ جَمِيعًا عَنْ سُفْيَانَ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا حُسَيْنٌ الْجُعْفِىُّ عَنْ زَائِدَةَ كُلُّهُمْ عَنْ أَشْعَثَ بْنِ أَبِى الشَّعْثَاءِ بِإِسْنَادِ أَبِى الأَحْوَصِ كَمَعْنَى حَدِيثِهِ غَيْرَ أَنَّهُمْ قَالُوا « مِنَ الْمَجَاعَةِ »."
            },
            {
                "hadithNo": "3608",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from Abu Sa'eed Al-Khudri that on the Day of Hunain, the Messenger of Allah (s.a.w) sent an army to Awtas, where they met the enemy, fought them and prevailed over them. They captured some female prisoners, and it was as if the Companions of the Messenger of Allah (s.a.w) felt reluctant to have intercourse with them because of their idolator husbands. Then Allah, the Mighty and Sublime, revealed: \"Also (forbidden are) women already married, except those (slaves) whom your right hands possess\", meaning, they are permissible for you once their 'Iddah has ended.",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ الْقَوَارِيرِىُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِى عَرُوبَةَ عَنْ قَتَادَةَ عَنْ صَالِحٍ أَبِى الْخَلِيلِ عَنْ أَبِى عَلْقَمَةَ الْهَاشِمِىِّ عَنْ أَبِى سَعِيدٍ الْخُدْرِىِّ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَوْمَ حُنَيْنٍ بَعَثَ جَيْشًا إِلَى أَوْطَاسٍ فَلَقُوا عَدُوًّا فَقَاتَلُوهُمْ فَظَهَرُوا عَلَيْهِمْ وَأَصَابُوا لَهُمْ سَبَايَا فَكَأَنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- تَحَرَّجُوا مِنْ غِشْيَانِهِنَّ مِنْ أَجْلِ أَزْوَاجِهِنَّ مِنَ الْمُشْرِكِينَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِى ذَلِكَ ( وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلاَّ مَا مَلَكَتْ أَيْمَانُكُمْ) أَىْ فَهُنَّ لَكُمْ حَلاَلٌ إِذَا انْقَضَتْ عِدَّتُهُنَّ."
            },
            {
                "hadithNo": "3609",
                "chapterNo": "9",
                "hadithEnglish": "Abu Sa'eed Al-Khudri narrated that on the Day of Hunain the Prophet of Allah (s.a.w) sent out a party ...a Hadith like that of Yazid bin Zuray', (no. 3608) except that he said: \"Except those whom your right hands possess\" for they are permissible for you. And he did not mention: \"When their 'Iddah is over.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالُوا حَدَّثَنَا عَبْدُ الأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَبِى الْخَلِيلِ أَنَّ أَبَا عَلْقَمَةَ الْهَاشِمِىَّ حَدَّثَ أَنَّ أَبَا سَعِيدٍ الْخُدْرِىَّ حَدَّثَهُمْ أَنَّ نَبِىَّ اللَّهِ -صلى الله عليه وسلم- بَعَثَ يَوْمَ حُنَيْنٍ سَرِيَّةً. بِمَعْنَى حَدِيثِ يَزِيدَ بْنِ زُرَيْعٍ غَيْرَ أَنَّهُ قَالَ إِلاَّ مَا مَلَكَتْ أَيْمَانُكُمْ مِنْهُنَّ فَحَلاَلٌ لَكُمْ وَلَمْ يَذْكُرْ إِذَا انْقَضَتْ عِدَّتُهُنَّ."
            },
            {
                "hadithNo": "3610",
                "chapterNo": "9",
                "hadithEnglish": "A similar report (as no. 3609) was narrated from Qatadah with this chain.",
                "hadithArabic": "وَحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِىُّ حَدَّثَنَا خَالِدٌ - يَعْنِى ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "3611",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated that Abu Sa'eed said: 'They captured some female prisoners on the Day of Awtas, who had husbands, so they were worried, then this verse was revealed: \"Also (forbidden are) women already married, except those (slaves) whom your right hands\r\npossess ...\"",
                "hadithArabic": "وَحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِىُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِى الْخَلِيلِ عَنْ أَبِى سَعِيدٍ قَالَ أَصَابُوا سَبْيًا يَوْمَ أَوْطَاسٍ لَهُنَّ أَزْوَاجٌ فَتَخَوَّفُوا فَأُنْزِلَتْ هَذِهِ الآيَةُ (وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلاَّ مَا مَلَكَتْ أَيْمَانُكُمْ )."
            },
            {
                "hadithNo": "3612",
                "chapterNo": "9",
                "hadithEnglish": "A similar report (as no. 3611) was narrated from Qatadah with this chain.",
                "hadithArabic": "وَحَدَّثَنِى يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدٌ - يَعْنِى ابْنَ الْحَارِثِ - حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "3613",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that 'Aishah said: \"Sa'd bin Abi Waqqas and 'Abd bin Zam'ah disputed concerning a boy. Sa'd said: 'O Messenger of Allah, this is the son of my brother, 'Utbah bin Abi Waqqas, who stated to me that he is his child. See how he resembles him.' 'Abd bin Zam'ah said: 'This is my brother, O Messenger of Allah, he was born on my father's bed of his slave woman.' The Messenger of Allah (s.a.w) looked to see who he resembled, and he saw a clear resemblance to 'Utbah. But he said: 'He is yours, O 'Abd. The child is for the (owner of the) bed and the fornicator gets the Hajar. Observe Hijab from him, O Sawdah bint Zam'ah.'\" She said: \"And he never saw Sawdah.\" Muhammad bin Rumh did not mention the words: \"O 'Abd.''",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتِ اخْتَصَمَ سَعْدُ بْنُ أَبِى وَقَّاصٍ وَعَبْدُ بْنُ زَمْعَةَ فِى غُلاَمٍ فَقَالَ سَعْدٌ هَذَا يَا رَسُولَ اللَّهِ ابْنُ أَخِى عُتْبَةَ بْنِ أَبِى وَقَّاصٍ عَهِدَ إِلَىَّ أَنَّهُ ابْنُهُ انْظُرْ إِلَى شَبَهِهِ وَقَالَ عَبْدُ بْنُ زَمْعَةَ هَذَا أَخِى يَا رَسُولَ اللَّهِ وُلِدَ عَلَى فِرَاشِ أَبِى مِنْ وَلِيدَتِهِ فَنَظَرَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِلَى شَبَهِهِ فَرَأَى شَبَهًا بَيِّنًا بِعُتْبَةَ فَقَالَ « هُوَ لَكَ يَا عَبْدُ الْوَلَدُ لِلْفِرَاَشِ وَلِلْعَاهِرِ الْحَجَرُ وَاحْتَجِبِى مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ ». قَالَتْ فَلَمْ يَرَ سَوْدَةَ قَطُّ وَلَمْ يَذْكُرْ مُحَمَّدُ بْنُ رُمْحٍ قَوْلَهُ « يَا عَبْدُ »."
            },
            {
                "hadithNo": "3614",
                "chapterNo": "10",
                "hadithEnglish": "A similar report (as no. 3613) was narrated from Az-Zuhri with this chain, except that Ma'mar and Ibn 'Uyaynah said in their Hadith: \"The child is for the (owner of the) bed,\" and they did not mention \"and the fornicator gets the Hajar.\"",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كِلاَهُمَا عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ نَحْوَهُ. غَيْرَ أَنَّ مَعْمَرًا وَابْنَ عُيَيْنَةَ فِى حَدِيثِهِمَا « الْوَلَدُ لِلْفِرَاشِ ». وَلَمْ يَذْكُرَا « وَلِلْعَاهِرِ الْحَجَرُ »."
            },
            {
                "hadithNo": "3615",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"The child is for the ( owner of the) bed and the fornicator gets the Hajar.\"",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ - قَالَ ابْنُ رَافِعٍ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ عَنِ ابْنِ الْمُسَيَّبِ وَأَبِى سَلَمَةَ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ »."
            },
            {
                "hadithNo": "3616",
                "chapterNo": "10",
                "hadithEnglish": "A Hadith like that of Ma'mar (no. 3615) was narrated from Abu Hurairah from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَزُهَيْرُ بْنُ حَرْبٍ وَعَبْدُ الأَعْلَى بْنُ حَمَّادٍ وَعَمْرٌو النَّاقِدُ قَالُوا حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِىِّ أَمَّا ابْنُ مَنْصُورٍ فَقَالَ عَنْ سَعِيدٍ عَنْ أَبِى هُرَيْرَةَ وَأَمَّا عَبْدُ الأَعْلَى فَقَالَ عَنْ أَبِى سَلَمَةَ أَوْ عَنْ سَعِيدٍ عَنْ أَبِى هُرَيْرَةَ وَقَالَ زُهَيْرٌ عَنْ سَعِيدٍ أَوْ عَنْ أَبِى سَلَمَةَ أَحَدُهُمَا أَوْ كِلاَهُمَا عَنْ أَبِى هُرَيْرَةَ وَقَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ مَرَّةً عَنِ الزُّهْرِىِّ عَنْ سَعِيدٍ وَأَبِى سَلَمَةَ وَمَرَّةً عَنْ سَعِيدٍ أَوْ أَبِى سَلَمَةَ وَمَرَّةً عَنْ سَعِيدٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمِثْلِ حَدِيثِ مَعْمَرٍ."
            },
            {
                "hadithNo": "3617",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated from 'Aishah that she said: \"The Messenger of Allah (s.a.w) entered upon me one day happily, with his face shining. He said: 'Did you not see that Mujazziz looked at Zaid bin Harithah and Usamah bin Zaid just now, and he said: These feet belong to one another.\"'",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالاَ أَخْبَرَنَا اللَّيْثُ ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنِ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ إِنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- دَخَلَ عَلَىَّ مَسْرُورًا تَبْرُقُ أَسَارِيرُ وَجْهِهِ فَقَالَ « أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا نَظَرَ آنِفًا إِلَى زَيْدِ بْنِ حَارِثَةَ وَأُسَامَةَ بْنِ زَيْدٍ فَقَالَ إِنَّ بَعْضَ هَذِهِ الأَقْدَامِ لَمِنْ بَعْضٍ »."
            },
            {
                "hadithNo": "3618",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that 'Aishah said: \"The Messenger of Allah (s.a.w) entered upon me happy one day and said: 'O 'Aishah, did you not see that Mujazziz Al-Mudlaji entered upon me and he saw Usamah and Zaid with a piece of velvet cloth over them that was covering their heads, but their feet were showing, and he said: These feet belong to one another.\"'",
                "hadithArabic": "وَحَدَّثَنِى عَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ - وَاللَّفْظُ لِعَمْرٍو - قَالُوا حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِىِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ -صلى الله عليه وسلم- ذَاتَ يَوْمٍ مَسْرُورًا فَقَالَ « يَا عَائِشَةُ أَلَمْ تَرَىْ أَنَّ مُجَزِّزًا الْمُدْلِجِىَّ دَخَلَ عَلَىَّ فَرَأَى أُسَامَةَ وَزَيْدًا وَعَلَيْهِمَا قَطِيفَةٌ قَدْ غَطَّيَا رُءُوسَهُمَا وَبَدَتْ أَقْدَامُهُمَا فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ »."
            },
            {
                "hadithNo": "3619",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that 'Aishah said: \"A Qa'if (one who detects family resemblance) entered when the Messenger of Allah (s.a.w) was present, and Usamah bin Zaid and Zaid bin Harithah were lying down. He said: 'These feet belong to one another.' The Prophet (s.a.w) was pleased by this and liked it, and he told 'Aishah about it.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ مَنْصُورُ بْنُ أَبِى مُزَاحِمٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنِ الزُّهْرِىِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ دَخَلَ قَائِفٌ وَرَسُولُ اللَّهِ -صلى الله عليه وسلم- شَاهِدٌ وَأُسَامَةُ بْنُ زَيْدٍ وَزَيْدُ بْنُ حَارِثَةَ مُضْطَجِعَانِ فَقَالَ إِنَّ هَذِهِ الأَقْدَامَ بَعْضُهَا مِنْ بَعْضٍ. فَسُرَّ بِذَلِكَ النَّبِىُّ -صلى الله عليه وسلم- وَأَعْجَبَهُ وَأَخْبَرَ بِهِ عَائِشَةَ."
            },
            {
                "hadithNo": "3620",
                "chapterNo": "11",
                "hadithEnglish": "A similar Hadith (as no. 3619) was narrated from Az-Zuhri with this chain, and in the Hadith of Yunus it adds: \"And Mujazziz was a Qa'if.\"",
                "hadithArabic": "وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ وَابْنُ جُرَيْجٍ كُلُّهُمْ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ. بِمَعْنَى حَدِيثِهِمْ. وَزَادَ فِى حَدِيثِ يُونُسَ وَكَانَ مُجَزِّزٌ قَائِفًا."
            },
            {
                "hadithNo": "3621",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Umm Salamah that when the Messenger of Allah (s.a.w) married Umm Salamah, he stayed with her for three days, and he said: \"There is no lack ofesteem on the part of your husband towards you. If you wish, I will stay with you for seven days, but if I stay with you for seven days, then I will have to stay with each of my wives for seven days.''",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَمُحَمَّدُ بْنُ حَاتِمٍ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لأَبِى بَكْرٍ - قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ عَنْ مُحَمَّدِ بْنِ أَبِى بَكْرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِى بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- لَمَّا تَزَوَّجَ أُمَّ سَلَمَةَ أَقَامَ عِنْدَهَا ثَلاَثًا وَقَالَ « إِنَّهُ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ لَكِ وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِنِسَائِى »."
            },
            {
                "hadithNo": "3622",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Abu Bakr bin 'Abdur-Rahman that when the Messenger of Allah (s.a.w) married Umm Salamah, the following morning he said to her: \"There is no lack of esteem on the part of your husband towards you. If you wish, I will stay with you for seven days, or if you wish I will stay with you for three, then I will visit (each of you) in tum.\" She said: \"Make it three.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِى بَكْرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِى بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ { عَنْ أَبِيهِ } أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- حِينَ تَزَوَّجَ أَمَّ سَلَمَةَ وَأَصْبَحَتْ عِنْدَهُ قَالَ لَهَا « لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ عِنْدَكِ وَإِنْ شِئْتِ ثَلَّثْتُ ثُمَّ دُرْتُ ». قَالَتْ ثَلِّثْ."
            },
            {
                "hadithNo": "3623",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Abu Bakr bin 'Abdur-Rahman that when the Messenger of Allah (s.a.w) married Umm Salamah, he went to stay with her, then he wanted to leave and she took hold of his garment. The Messenger of Allah (s.a.w) said: \"If you wish, I will stay longer and count it. For a virgin seven days, and for a previously-married woman, three.\"",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِىُّ حَدَّثَنَا سُلَيْمَانُ - يَعْنِى ابْنَ بِلاَلٍ - عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِى بَكْرٍ عَنْ أَبِى بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- حِينَ تَزَوَّجَ أُمَّ سَلَمَةَ فَدَخَلَ عَلَيْهَا فَأَرَادَ أَنْ يَخْرُجَ أَخَذَتْ بِثَوْبِهِ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنْ شِئْتِ زِدْتُكِ وَحَاسَبْتُكِ بِهِ لِلْبِكْرِ سَبْعٌ وَلِلثَّيِّبِ ثَلاَثٌ »."
            },
            {
                "hadithNo": "3624",
                "chapterNo": "12",
                "hadithEnglish": "A similar report (as no. 3623) was narrated from 'Abdur-Rahman bin Humaid with this chain.",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو ضَمْرَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ بِهَذَا الإِسْنَادِ مِثْلَهُ."
            },
            {
                "hadithNo": "3625",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Abu Bakr bin 'Abdur-Rahman bin Al-Harith bin Hisham, from Umm Salamah. He(s.a.w) said that the Messenger of Allah (s.a.w) married her, and he mentioned some things, including this: He said: \"If you wish, I will stay with you (to Umm Salamah) for seven days, and then spend seven days with each of my wives, for if I spend seven days with you I will spend seven days with each of my wives.\"",
                "hadithArabic": "حَدَّثَنِى أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا حَفْصٌ - يَعْنِى ابْنَ غِيَاثٍ - عَنْ عَبْدِ الْوَاحِدِ بْنِ أَيْمَنَ عَنْ أَبِى بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أُمِّ سَلَمَةَ ذَكَرَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- تَزَوَّجَهَا وَذَكَرَ أَشْيَاءَ هَذَا فِيهِ قَالَ « إِنْ شِئْتِ أَنْ أُسَبِّعَ لَكِ وَأُسَبِّعَ لِنِسَائِى وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِنِسَائِى »."
            },
            {
                "hadithNo": "3626",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated that Anas bin Malik said: \"If (a man) marries a virgin in addition to a previously-married woman, he should stay with her for seven days, and if he marries a previously-married woman in addition to a virgin, he should stay with her for three.\" Khalid (a narrator) said: \"If I were to say that he attributed it to the Prophet (s.a.w) I would be speaking the truth, but he said: 'That is the Sunnah.'\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ خَالِدٍ عَنْ أَبِى قِلاَبَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ إِذَا تَزَوَّجَ الْبِكْرَ عَلَى الثَّيِّبِ أَقَامَ عِنْدَهَا سَبْعًا وَإِذَا تَزَوَّجَ الثَّيِّبَ عَلَى الْبِكْرِ أَقَامَ عِنْدَهَا ثَلاَثًا. قَالَ خَالِدٌ وَلَوْ قُلْتُ إِنَّهُ رَفَعَهُ لَصَدَقْتُ وَلَكِنَّهُ قَالَ السُّنَّةُ كَذَلِكَ."
            },
            {
                "hadithNo": "3627",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated that Anas said: \"It is Sunnah to stay with a virgin for seven days.\" Khalid (a narrator) said: \"If you wish, I will say that he attributed it to the Prophet (s.a.w).''",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ أَيُّوبَ وَخَالِدٍ الْحَذَّاءِ عَنْ أَبِى قِلاَبَةَ عَنْ أَنَسٍ قَالَ مِنَ السُّنَّةِ أَنْ يُقِيمَ عِنْدَ الْبِكْرِ سَبْعًا. قَالَ خَالِدٌ وَلَوْ شِئْتُ قُلْتُ رَفَعَهُ إِلَى النَّبِىِّ -صلى الله عليه وسلم-."
            },
            {
                "hadithNo": "3628",
                "chapterNo": "13",
                "hadithEnglish": "It was narrated that Anas said: \"The Prophet (s.a.w) had nine wives, and when he divided his time among them, he did not come back to the first one until the ninth day. Every night they used to gather in the house of the one whose night it was. He was in 'Aishah's house, and Zainab came and he reached out his hand towards her. 'Aishah said: 'This is Zainab, and the Prophet (s.a.w) withdrew his hand.' They argued and raised their voices, and the Iqamah was called for prayer. Abu Bakr came past at that point and heard their voices, so he said: 'Come out for the prayer, O Messenger of Allah (s.a.w), and throw dust in their mouths.' The Prophet (s.a.w) came out, and 'Aishah said: 'Now the Prophet (s.a.w) will finish his prayer and come, and Abu Bakr will come and do such-and-such to me.' When the Prophet (s.a.w) had finished his prayer, Abu Bakr came to her and spoke sternly to her, and said: 'Do you behave like this?\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ كَانَ لِلنَّبِىِّ -صلى الله عليه وسلم- تِسْعُ نِسْوَةٍ فَكَانَ إِذَا قَسَمَ بَيْنَهُنَّ لاَ يَنْتَهِى إِلَى الْمَرْأَةِ الأُولَى إِلاَّ فِى تِسْعٍ فَكُنَّ يَجْتَمِعْنَ كُلَّ لَيْلَةٍ فِى بَيْتِ الَّتِى يَأْتِيهَا فَكَانَ فِى بَيْتِ عَائِشَةَ فَجَاءَتْ زَيْنَبُ فَمَدَّ يَدَهُ إِلَيْهَا فَقَالَتْ هَذِهِ زَيْنَبُ. فَكَفَّ النَّبِىُّ -صلى الله عليه وسلم- يَدَهُ. فَتَقَاوَلَتَا حَتَّى اسْتَخَبَتَا وَأُقِيمَتِ الصَّلاَةُ فَمَرَّ أَبُو بَكْرٍ عَلَى ذَلِكَ فَسَمِعَ أَصْوَاتَهُمَا فَقَالَ اخْرُجْ يَا رَسُولَ اللَّهِ إِلَى الصَّلاَةِ وَاحْثُ فِى أَفْوَاهِهِنَّ التُّرَابَ.\r\nفَخَرَجَ النَّبِىُّ -صلى الله عليه وسلم- فَقَالَتْ عَائِشَةُ الآنَ يَقْضِى النَّبِىُّ -صلى الله عليه وسلم- صَلاَتَهُ فَيَجِىءُ أَبُو بَكْرٍ فَيَفْعَلُ بِى وَيَفْعَلُ. فَلَمَّا قَضَى النَّبِىُّ -صلى الله عليه وسلم- صَلاَتَهُ أَتَاهَا أَبُو بَكْرٍ فَقَالَ لَهَا قَوْلاً شَدِيدًا وَقَالَ أَتَصْنَعِينَ هَذَا."
            },
            {
                "hadithNo": "3629",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated that 'Aishah said: \"I never saw a woman whose position I wished I could be in more than Sawdah bint Zam'ah, a woman of strong character.\" When she grew old, she gave her day with the Messenger of Allah (s.a.w) to 'Aishah. She said: \"O Messenger of Allah, I have given my day with you to 'Aishah.\" So the Messenger of Allah (s.a.w) gave 'Aishah two days, her day, and Sawdah's day.",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ مَا رَأَيْتُ امْرَأَةً أَحَبَّ إِلَىَّ أَنْ أَكُونَ فِى مِسْلاَخِهَا مِنْ سَوْدَةَ بِنْتِ زَمْعَةَ مِنِ امْرَأَةٍ فِيهَا حِدَّةٌ قَالَتْ فَلَمَّا كَبِرَتْ جَعَلَتْ يَوْمَهَا مِنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- لِعَائِشَةَ قَالَتْ يَا رَسُولَ اللَّهِ قَدْ جَعَلْتُ يَوْمِى مِنْكَ لِعَائِشَةَ.\r\nفَكَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَقْسِمُ لِعَائِشَةَ يَوْمَيْنِ يَوْمَهَا وَيَوْمَ سَوْدَةَ."
            },
            {
                "hadithNo": "3630",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from Hisham with this chain, that when Sawdah grew old... a Hadith like that of Jarir (no. 3629). In the Hadith of Sharik it adds: \"She was the first woman whom he married after me.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ ح وَحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا زُهَيْرٌ ح وَحَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَرِيكٌ كُلُّهُمْ عَنْ هِشَامٍ بِهَذَا الإِسْنَادِ أَنَّ سَوْدَةَ لَمَّا كَبِرَتْ. بِمَعْنَى حَدِيثِ جَرِيرٍ وَزَادَ فِى حَدِيثِ شَرِيكٍ قَالَتْ وَكَانَتْ أَوَّلَ امْرَأَةٍ تَزَوَّجَهَا بَعْدِى."
            },
            {
                "hadithNo": "3631",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated that 'Aishah said: \"I used to feel jealous of the women who offered themselves (in marriage) to the Messenger of Allah (s.a.w), and I would say: Would a woman offer herself?' When Allah, the Most High, revealed the words: \"You can postpone (the turn of) whom you will of them (your wives), and you may receive whom you will. And whomsoever you desire of those whom you have set aside her turn temporarily), ..., said: 'By Allah, I see that your Lord is quick to respond to your wishes.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كُنْتُ أَغَارُ عَلَى اللاَّتِى وَهَبْنَ أَنْفُسَهُنَّ لِرَسُولِ اللَّهِ -صلى الله عليه وسلم- وَأَقُولُ وَتَهَبُ الْمَرْأَةُ نَفْسَهَا فَلَمَّا أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ (تُرْجِى مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِى إِلَيْكَ مَنْ تَشَاءُ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ) قَالَتْ قُلْتُ وَاللَّهِ مَا أَرَى رَبَّكَ إِلاَّ يُسَارِعُ لَكَ فِى هَوَاكَ."
            },
            {
                "hadithNo": "3632",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from 'Aishah that she used to say: \"Wouldn't a woman feel too shy to offer herself to a man?\" Until Allah [the Mighty and Sublime] revealed: \"You can postpone (the tum of) whom you will of them (your wives), and you may receive whom you will\" Then she said: \"Your Lord is quick to respond to your wishes.\"'",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا كَانَتْ تَقُولُ أَمَا تَسْتَحْيِى امْرَأَةٌ تَهَبُ نَفْسَهَا لِرَجُلٍ حَتَّى أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ (تُرْجِى مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِى إِلَيْكَ مَنْ تَشَاءُ) فَقُلْتُ إِنَّ رَبَّكَ لَيُسَارِعُ لَكَ فِى هَوَاكَ."
            },
            {
                "hadithNo": "3633",
                "chapterNo": "14",
                "hadithEnglish": "'Ata' said: \"We attended the funeral of Maimunah, the wife of the Prophet (s.a.w). in Sarif with Ibn 'Abbas. Ibn 'Abbas said: 'This is the wife of the Prophet (s.a.w). so when you lift her, do not shake her nor disturb her; be gentle with her. The Messenger of Allah (s.a.w) had nine wives, and he used to divide his time between eight of them, and he did not allot a share of his time to one of them. The one to whom he did not allot a share of his time was Safiyyah bint Huyayy bin Akhtab.\"'",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ حَاتِمٍ قَالَ مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى عَطَاءٌ قَالَ حَضَرْنَا مَعَ ابْنِ عَبَّاسٍ جَنَازَةَ مَيْمُونَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- بِسَرِفَ فَقَالَ ابْنُ عَبَّاسٍ هَذِهِ زَوْجُ النَّبِىِّ -صلى الله عليه وسلم- فَإِذَا رَفَعْتُمْ نَعْشَهَا فَلاَ تُزَعْزِعُوا وَلاَ تُزَلْزِلُوا وَارْفُقُوا فَإِنَّهُ كَانَ عِنْدَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- تِسْعٌ فَكَانَ يَقْسِمُ لِثَمَانٍ وَلاَ يَقْسِمُ لِوَاحِدَةٍ.\r\nقَالَ عَطَاءٌ الَّتِى لاَ يَقْسِمُ لَهَا صَفِيَّةُ بِنْتُ حُيَىِّ بْنِ أَخْطَبَ."
            },
            {
                "hadithNo": "3634",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from Ibn Juraij with this chain (a Hadith similar to no. 3633), and he added: 'Ata' said: \"... She was the last of them to die, and she died in Al-Madinah.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ عَنِ ابْنِ جُرَيْجٍ بِهَذَا الإِسْنَادِ وَزَادَ قَالَ عَطَاءٌ كَانَتْ آخِرَهُنَّ مَوْتًا مَاتَتْ بِالْمَدِينَةِ."
            },
            {
                "hadithNo": "3635",
                "chapterNo": "15",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Women are married for four things: Their wealth, their lineage, their beauty and their religion. Choose the one with religion, may your hands be rubbed with dust.\"",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِى سَعِيدُ بْنُ أَبِى سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « تُنْكَحُ الْمَرْأَةُ لأَرْبَعٍ لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ »."
            },
            {
                "hadithNo": "3636",
                "chapterNo": "15",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"I married a woman at the time of the Messenger of Allah (s.a.w), and I met the Prophet (s.a.w) and he said: 'O Jabir, have you gotten married?' I said: 'Yes.' He said: 'A virgin or a previously-married woman?' I said: 'A previously-married woman.' He said: 'Why not a virgin so you could play with her?' I said: 'O Messenger of Allah, I have sisters, and I was afraid that she might cause trouble between myself and them.' He said: 'That's fine then. A woman is married for her religion, her wealth or her beauty. Choose the one with religion, may your hands be rubbed with dust.\"'",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِى حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِى سُلَيْمَانَ عَنْ عَطَاءٍ أَخْبَرَنِى جَابِرُ بْنُ عَبْدِ اللَّهِ قَالَ تَزَوَّجْتُ امْرَأَةً فِى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَلَقِيتُ النَّبِىَّ -صلى الله عليه وسلم- فَقَالَ « يَا جَابِرُ تَزَوَّجْتَ ». قُلْتُ نَعَمْ. قَالَ « بِكْرٌ أَمْ ثَيِّبٌ ». قُلْتُ ثَيِّبٌ. قَالَ « فَهَلاَّ بِكْرًا تُلاَعِبُهَا ». قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِى أَخَوَاتٍ فَخَشِيتُ أَنْ تَدْخُلَ بَيْنِى وَبَيْنَهُنَّ. قَالَ « فَذَاكَ إِذًا. إِنَّ الْمَرْأَةَ تُنْكَحُ عَلَى دِينِهَا وَمَالِهَا وَجَمَالِهَا فَعَلَيْكَ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ »."
            },
            {
                "hadithNo": "3637",
                "chapterNo": "16",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"I married a woman and the Messenger of Allah (s.a.w) said to me: 'Have you gotten married?' I said: 'Yes.' He said: 'A virgin or a previously-married woman?' I said: 'A previously-married woman.' He said: 'What about virgins and playing with them?\"' Shu'bah said: \"I mentioned this to 'Amr bin Dinar and he said: 'I heard it from Jabir, but he said: \"Why not a young virgin, so you could play with her and she could play with you?\"",
                "hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِى حَدَّثَنَا شُعْبَةُ عَنْ مُحَارِبٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ تَزَوَّجْتُ امْرَأَةً فَقَالَ لِى رَسُولُ اللَّهِ -صلى الله عليه وسلم- « هَلْ تَزَوَّجْتَ ». قُلْتُ نَعَمْ. قَالَ « أَبِكْرًا أَمْ ثَيِّبًا ». قُلْتُ ثَيِّبًا. قَالَ « فَأَيْنَ أَنْتَ مِنَ الْعَذَارَى وَلِعَابِهَا ». قَالَ شُعْبَةُ فَذَكَرْتُهُ لِعَمْرِو بْنِ دِينَارٍ فَقَالَ قَدْ سَمِعْتُهُ مِنْ جَابِرٍ وَإِنَّمَا قَالَ « فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ »"
            },
            {
                "hadithNo": "3638",
                "chapterNo": "16",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah, that 'Abdullah (his father) died and left behind nine - or seven - daughters, and I married a previously-married woman. The Messenger of Allah (s.a.w) said to me: \"O Jabir, have you gotten married?\" I said: \"Yes.\" He said: \"A virgin or a previously-married woman?\" I said: \"A previously-married woman, O Messenger of Allah.\" He said: \"Why not a young virgin whom you could play with, and she could play with you?\" - or he said: \"Whom you could make laugh, and she could make you laugh?''- I said to him: '\"Abdullah died and left behind nine - or seven - daughters, and I did not like to bring to them one who was like them. I wanted to bring a woman who could look after them and take care of them.\" He said: \"Then may Allah bless you,\" or he said good words to me.",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو الرَّبِيعِ الزَّهْرَانِىُّ قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ هَلَكَ وَتَرَكَ تِسْعَ بَنَاتٍ - أَوْ قَالَ سَبْعَ - فَتَزَوَّجْتُ امْرَأَةً ثَيِّبًا فَقَالَ لِى رَسُولُ اللَّهِ -صلى الله عليه وسلم- « يَا جَابِرُ تَزَوَّجْتَ ». قَالَ قُلْتُ نَعَمْ. قَالَ « فَبِكْرٌ أَمْ ثَيِّبٌ ». قَالَ قُلْتُ بَلْ ثَيِّبٌ يَا رَسُولَ اللَّهِ. قَالَ « فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ». أَوْ قَالَ « تُضَاحِكُهَا وَتُضَاحِكُكَ ». قَالَ قُلْتُ لَهُ إِنَّ عَبْدَ اللَّهِ هَلَكَ وَتَرَكَ تِسْعَ بَنَاتٍ - أَوْ سَبْعَ - وَإِنِّى كَرِهْتُ أَنْ آتِيَهُنَّ أَوْ أَجِيئَهُنَّ بِمِثْلِهِنَّ فَأَحْبَبْتُ أَنْ أَجِىءَ بِامْرَأَةٍ تَقُومُ عَلَيْهِنَّ وَتُصْلِحُهُنَّ. قَالَ « فَبَارَكَ اللَّهُ لَكَ ». أَوْ قَالَ لِى خَيْرًا وَفِى رِوَايَةِ أَبِى الرَّبِيعِ « تُلاَعِبُهَا وَتُلاَعِبُكَ وَتُضَاحِكُهَا وَتُضَاحِكُكَ »."
            },
            {
                "hadithNo": "3639",
                "chapterNo": "16",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"The Messenger of Allah (s.a.w) said to me: 'Did you get married, O Jabir?\"' ... and he quoted the Hadith (similar to no. 3638) as far as the words: \"A woman who would look after them and comb their hair.\" He said: \"You have done well,\" and he did not mention the words that come after that.",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ لِى رَسُولُ اللَّهِ -صلى الله عليه وسلم- « هَلْ نَكَحْتَ يَا جَابِرُ ». وَسَاقَ الْحَدِيثَ إِلَى قَوْلِهِ امْرَأَةً تَقُومُ عَلَيْهِنَّ وَتَمْشُطُهُنَّ قَالَ « أَصَبْتَ ». وَلَمْ يَذْكُرْ مَا بَعْدَهُ."
            },
            {
                "hadithNo": "3640",
                "chapterNo": "16",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"We were with the Messenger of Allah (s.a.w) on a campaign, and when we were heading back I urged my camel on because it was slow. A rider behind me caught up with me and prodded my camel with an 'Anazah that he had with him, and my camel moved forward like the best camel you have ever seen. I turned around and there was the Messenger of Allah (s.a.w). He said: 'Why are you in such a hurry, O Jabir?' I said: 'O Messenger of Allah, I have recently got married.' He said: 'Did you marry a virgin or a previously-married woman?' I said: 'A previously-married woman.' He said: 'Why not a young virgin who you could play with and she could play with you?'\" \"When we came to Al-Madinah, we wanted to enter but he said: 'Slow down so we can enter at night, so that the women whose hair is disheveled may comb their hair, and the women whose husbands have been away may shave their pubes.' And he said: 'When you arrive, be smart, be smart.\"'",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ سَيَّارٍ عَنِ الشَّعْبِىِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فِى غَزَاةٍ فَلَمَّا أَقْبَلْنَا تَعَجَّلْتُ عَلَى بَعِيرٍ لِى قَطُوفٍ فَلَحِقَنِى رَاكِبٌ خَلْفِى فَنَخَسَ بَعِيرِى بِعَنَزَةٍ كَانَتْ مَعَهُ فَانْطَلَقَ بَعِيرِى كَأَجْوَدِ مَا أَنْتَ رَاءٍ مِنَ الإِبِلِ فَالْتَفَتُّ فَإِذَا أَنَا بِرَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « مَا يُعْجِلُكَ يَا جَابِرُ ». قُلْتُ يَا رَسُولَ اللَّهِ إِنِّى حَدِيثُ عَهْدٍ بِعُرْسٍ.\r\nفَقَالَ « أَبِكْرًا تَزَوَّجْتَهَا أَمْ ثَيِّبًا ». قَالَ قُلْتُ بَلْ ثَيِّبًا. قَالَ « هَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ». قَالَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ ذَهَبْنَا لِنَدْخُلَ فَقَالَ « أَمْهِلُوا حَتَّى نَدْخُلَ لَيْلاً - أَىْ عِشَاءً - كَىْ تَمْتَشِطَ الشَّعِثَةُ وَتَسْتَحِدَّ الْمُغِيبَةُ ». قَالَ وَقَالَ « إِذَا قَدِمْتَ فَالْكَيْسَ الْكَيْسَ »."
            },
            {
                "hadithNo": "3641",
                "chapterNo": "16",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"I went out on a campaign with the Messenger of Allah (s.a.w) and my camel held me back. The Messenger of Allah (s.a.w) came to me and said: 'O Jabir.' I said: 'Yes.' He said: 'What is the matter with you?' I said: 'My camel is holding me back; it is tired and I fell behind.' He dismounted and prodded it with a crooked stick, then he said: 'Ride.' So I rode, and I remember that I had to restrain it from passing the Messenger of Allah (s.a.w). He said: 'Have you gotten married?' I said: 'Yes.' He said: 'A virgin or a previously-married woman?' I said: 'A previously-married woman.' He said: 'Why not a girl whom you could play with and she could play with you?' I said: 'I have sisters and I wanted to marry a woman who could keep them together and comb their hair and take care of them.' He said: 'You are going home, and when you arrive, be smart, be smart.' Then he said: 'Will you sell your camel?' I said: 'Yes.' So he bought it from me for an Uqiyah, then the Messenger of Allah (s.a.w) arrived and I arrived in the morning. I came to the Masjid and found him at the door of the Masjid. He said: 'Have you just arrived now?' I said: 'Yes.' He said: 'Leave your camel and go inside and pray two Rak'ah.' So I went inside and prayed, then I came back. He told Bilal to weigh out an Uqiyah for me and Bilal did that, and added a little more. Then I left, then when I was on my way he said: 'Call Jabir for me.' I was called and I said: 'Now he will return the camel to me, and there was nothing I disliked more than it.' He said: 'Take your camel, and keep its price for yourself.'\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ - يَعْنِى ابْنَ عَبْدِ الْمَجِيدِ الثَّقَفِىَّ - حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ وَهْبِ بْنِ كَيْسَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ خَرَجْتُ مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فِى غَزَاةٍ فَأَبْطَأَ بِى جَمَلِى فَأَتَى عَلَىَّ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقَالَ لِى « يَا جَابِرُ ». قُلْتُ نَعَمْ. قَالَ « مَا شَأْنُكَ ». قُلْتُ أَبْطَأَ بِى جَمَلِى وَأَعْيَا فَتَخَلَّفْتُ. فَنَزَلَ فَحَجَنَهُ بِمِحْجَنِهِ ثُمَّ قَالَ « ارْكَبْ ». فَرَكِبْتُ فَلَقَدْ رَأَيْتُنِى أَكُفُّهُ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « أَتَزَوَّجْتَ ». فَقُلْتُ نَعَمْ. فَقَالَ « أَبِكْرًا أَمْ ثَيِّبًا ». فَقُلْتُ بَلْ ثَيِّبٌ. قَالَ « فَهَلاَّ جَارِيَةً تُلاَعِبُهَا وَتُلاَعِبُكَ ». قُلْتُ إِنَّ لِى أَخَوَاتٍ فَأَحْبَبْتُ أَنْ أَتَزَوَّجَ امْرَأَةً تَجْمَعُهُنَّ وَتَمْشُطُهُنَّ وَتَقُومُ عَلَيْهِنَّ. قَالَ « أَمَا إِنَّكَ قَادِمٌ فَإِذَا قَدِمْتَ فَالْكَيْسَ الْكَيْسَ ». ثُمَّ قَالَ « أَتَبِيعُ جَمَلَكَ ». قُلْتُ نَعَمْ. فَاشْتَرَاهُ مِنِّى بِأُوقِيَّةٍ ثُمَّ قَدِمَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَقَدِمْتُ بِالْغَدَاةِ فَجِئْتُ الْمَسْجِدَ فَوَجَدْتُهُ عَلَى بَابِ الْمَسْجِدِ فَقَالَ « الآنَ حِينَ قَدِمْتَ ». قُلْتُ نَعَمْ. قَالَ « فَدَعْ جَمَلَكَ وَادْخُلْ فَصَلِّ رَكْعَتَيْنِ ». قَالَ فَدَخَلْتُ فَصَلَّيْتُ ثُمَّ رَجَعْتُ فَأَمَرَ بِلاَلاً أَنْ يَزِنَ لِى أُوقِيَّةً فَوَزَنَ لِى بِلاَلٌ فَأَرْجَحَ فِى الْمِيزَانِ - قَالَ - فَانْطَلَقْتُ فَلَمَّا وَلَّيْتُ قَالَ « ادْعُ لِى جَابِرًا ». فَدُعِيتُ فَقُلْتُ الآنَ يَرُدُّ عَلَىَّ الْجَمَلَ. وَلَمْ يَكُنْ شَىْءٌ أَبْغَضَ إِلَىَّ مِنْهُ فَقَالَ « خُذْ جَمَلَكَ وَلَكَ ثَمَنُهُ »."
            },
            {
                "hadithNo": "3642",
                "chapterNo": "16",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"We were on a journey with the Messenger of Allah (s.a.w) and I was on a camel that lagged behind the people. The Messenger of Allah (s.a.w) struck it,\" or prodded it - I think he said, \"with something that he had with him. After that it started going ahead of the people and I was struggling to restrain it. The Messenger of Allah (s.a.w) said: 'Will you sell it to me for such-and-such, may Allah forgive you?' I said: 'It is yours, O Prophet of Allah.' He said: 'Will you sell it to me for such-and-such, may Allah forgive you?' I said: 'It is yours, O Prophet of Allah.' He said to me: 'Did you get married after your father died?' I said: 'Yes.' He said: 'A previously-married woman or a virgin?' I said: 'A previously-married woman.' He said: 'Why didn't you marry a virgin who could make you laugh and you could make her laugh, and she could play with you and you could play with her?\"' Abu Nadrah said: \"That was a phrase that the Muslims used to say: 'Do such and such, may Allah forgive you.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ أَبِى حَدَّثَنَا أَبُو نَضْرَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا فِى مَسِيرٍ مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- وَأَنَا عَلَى نَاضِحٍ إِنَّمَا هُوَ فِى أُخْرَيَاتِ النَّاسِ - قَالَ - فَضَرَبَهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَوْ قَالَ نَخَسَهُ - أُرَاهُ قَالَ - بِشَىْءٍ كَانَ مَعَهُ قَالَ فَجَعَلَ بَعْدَ ذَلِكَ يَتَقَدَّمُ النَّاسَ يُنَازِعُنِى حَتَّى إِنِّى لأَكُفُّهُ قَالَ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَتَبِيعُنِيهِ بِكَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ ». قَالَ قُلْتُ هُوَ لَكَ يَا نَبِىَّ اللَّهِ. قَالَ « أَتَبِيعُنِيهِ بِكَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ ». قَالَ قُلْتُ هُوَ لَكَ يَا نَبِىَّ اللَّهِ. قَالَ وَقَالَ لِى « أَتَزَوَّجْتَ بَعْدَ أَبِيكَ ». قُلْتُ نَعَمْ. قَالَ « ثَيِّبًا أَمْ بِكْرًا ». قَالَ قُلْتُ ثَيِّبًا. قَالَ « فَهَلاَّ تَزَوَّجْتَ بِكْرًا تُضَاحِكُكَ وَتُضَاحِكُهَا وَتُلاَعِبُكَ وَتُلاَعِبُهَا ».\r\nقَالَ أَبُو نَضْرَةَ فَكَانَتْ كَلِمَةً يَقُولُهَا الْمُسْلِمُونَ. افْعَلْ كَذَا وَكَذَا وَاللَّهُ يَغْفِرُ لَكَ."
            },
            {
                "hadithNo": "3643",
                "chapterNo": "17",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Woman was created from a rib, it will never become straight for you in any way. If you wish to benefit from her then you may benefit from her, along with her crookedness, but if you try to straighten her you will break her, and breaking her is divorcing her.\"'",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ أَبِى عُمَرَ - وَاللَّفْظُ لاِبْنِ أَبِى عُمَرَ - قَالاَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ لَنْ تَسْتَقِيمَ لَكَ عَلَى طَرِيقَةٍ فَإِنِ اسْتَمْتَعْتَ بِهَا اسْتَمْتَعْتَ بِهَا وَبِهَا عِوَجٌ وَإِنْ ذَهَبْتَ تُقِيمُهَا كَسَرْتَهَا وَكَسْرُهَا طَلاَقُهَا »."
            },
            {
                "hadithNo": "3644",
                "chapterNo": "17",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Whoever believes in Allah and the Last Day, if he witnesses something let him speak good or else keep silent. Deal kindly with women, for woman was created from a rib, and the most crooked part of a rib is its upper part. If you try to straighten it you will break it, and if you leave it alone it will remain crooked. Deal (kindly) with women.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِىٍّ عَنْ زَائِدَةَ عَنْ مَيْسَرَةَ عَنْ أَبِى حَازِمٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَإِذَا شَهِدَ أَمْرًا فَلْيَتَكَلَّمْ بِخَيْرٍ أَوْ لِيَسْكُتْ وَاسْتَوْصُوا بِالنِّسَاءِ فَإِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ وَإِنَّ أَعْوَجَ شَىْءٍ فِى الضِّلَعِ أَعْلاَهُ إِنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ وَإِنْ تَرَكْتَهُ لَمْ يَزَلْ أَعْوَجَ اسْتَوْصُوا بِالنِّسَاءِ خَيْرًا »."
            },
            {
                "hadithNo": "3645",
                "chapterNo": "17",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'No believing man should hate a believing woman. If he dislikes one of her characteristics, he may be pleased with another.\"'",
                "hadithArabic": "وحدثنى إبراهيم بن موسى الرازى حدثنا عيسى - يعنى ابن يونس - حدثنا عبد الحميد بن جعفر عن عمران بن أبى أنس عن عمر بن الحكم عن أبى هريرة قال قال رسول الله -صلى الله عليه وسلم- « لا يفرك مؤمن مؤمنة إن كره منها خلقا رضى منها آخر ». أو قال « غيره »."
            },
            {
                "hadithNo": "3646",
                "chapterNo": "17",
                "hadithEnglish": "A similar report (as no. 3645) was narrated from Abu Hurairah from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ حَدَّثَنَا عِمْرَانُ بْنُ أَبِى أَنَسٍ عَنْ عُمَرَ بْنِ الْحَكَمِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمِثْلِهِ."
            },
            {
                "hadithNo": "3647",
                "chapterNo": "18",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"Were it not for Hawa', no female would ever have betrayed her husband.\"",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِى عَمْرُو بْنُ الْحَارِثِ أَنَّ أَبَا يُونُسَ مَوْلَى أَبِى هُرَيْرَةَ حَدَّثَهُ عَنْ أَبِى هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ « لَوْلاَ حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا الدَّهْرَ »."
            },
            {
                "hadithNo": "3648",
                "chapterNo": "18",
                "hadithEnglish": "It was narrated that Hammam bin Munabbih said: This is what Abu Hurairah narrated from the Messenger of Allah (s.a.w). He mentioned a number of Ahadith, including the following: \"The Messenger of Allah (s.a.w) said: 'Were it not for the Children of Israel, no food would go bad and no meat would tum rotten, and were it not for Hawwa' no female would ever betray her husband.\"'",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَوْلاَ بَنُو إِسْرَائِيلَ لَمْ يَخْبُثِ الطَّعَامُ وَلَمْ يَخْنَزِ اللَّحْمُ وَلَوْلاَ حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا الدَّهْرَ »."
            },
            {
                "hadithNo": "3649",
                "chapterNo": "19",
                "hadithEnglish": "It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (s.a.w) said: \"This world is no more than temporary joys, and there is no temporary joy of this world that is better than the righteous wife.\"",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ الْهَمْدَانِىُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا حَيْوَةُ أَخْبَرَنِى شُرَحْبِيلُ بْنُ شَرِيكٍ أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِىَّ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « الدُّنْيَا مَتَاعٌ وَخَيْرُ مَتَاعِ الدُّنْيَا الْمَرْأَةُ الصَّالِحَةُ »."
            },
            {
                "hadithNo": "3650",
                "chapterNo": "20",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Woman is like a rib. If you try to straighten her you will break her, but if you leave her alone you will benefit from her even though there is some crookedness in her.'\"",
                "hadithArabic": "وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ حَدَّثَنِى ابْنُ الْمُسَيَّبِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّ الْمَرْأَةَ كَالضِّلَعِ إِذَا ذَهَبْتَ تُقِيمُهَا كَسَرْتَهَا وَإِنْ تَرَكْتَهَا اسْتَمْتَعْتَ بِهَا وَفِيهَا عِوَجٌ »."
            },
            {
                "hadithNo": "3651",
                "chapterNo": "20",
                "hadithEnglish": "A similar report (as no. 3650) was narrated from the nephew of Az-Zuhri, from his paternal uncle, with this chain.",
                "hadithArabic": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ وَعَبْدُ بْنُ حُمَيْدٍ كِلاَهُمَا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنِ ابْنِ أَخِى الزُّهْرِىِّ عَنْ عَمِّهِ بِهَذَا الإِسْنَادِ. مِثْلَهُ سَوَاءً."
            }
        ]
    }
]