[
  {
    "SurahNumber": "20",
    "AyahNumber": "1",
    "Text": "Tua Ha."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "2",
    "Text": "We have not sent down this Qur'an to put you in trouble,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "3",
    "Text": "but as a reminder to those who fear Allah."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "4",
    "Text": "This is a revelation from Him Who has created the earth and the\\n\\t\\t\\tlofty Heavens,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "5",
    "Text": "the Beneficent (Allah) Who is firmly established on the throne of\\n\\t\\t\\tauthority,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "6",
    "Text": "to Him belongs whatever is in the Heavens and in the earth, and\\n\\t\\t\\tall that lies between them, and all that is beneath the soil."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "7",
    "Text": "The One to Whom you need not speak aloud; for He knows what is\\n\\t\\t\\tsaid in secret and what is yet more hidden."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "8",
    "Text": "He is Allah! There is no deity worthy of worship except Him! To\\n\\t\\t\\tHim belong the most beautiful Names."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "9",
    "Text": "Have you heard the story of Musa?"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "10",
    "Text": "When he saw a fire, he said to his family: \"Stop: I saw a fire. I\\n\\t\\t\\tmay be able to bring some fire or find someone beside the fire to\\n\\t\\t\\tguide us towards the right direction.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "11",
    "Text": "When he reached there, he was called: \"O Musa!"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "12",
    "Text": "In fact, I am your Rabb! Take off your shoes, you are in the\\n\\t\\t\\tsacred valley of Tuwa."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "13",
    "Text": "I have chosen you, so listen to what I am about to reveal."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "14",
    "Text": "It is Me, Allah; there is none worthy of worship except Me, so\\n\\t\\t\\tworship Me and establish Salah for My remembrance."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "15",
    "Text": "The final Hour is sure to come, I choose to keep it hidden, so\\n\\t\\t\\tthat every soul may be rewarded according to its efforts."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "16",
    "Text": "Therefore, let not any, who does not believe in this fact and\\n\\t\\t\\tfollow his own desires, turn your away, lest you should perish.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "17",
    "Text": "\"O Musa what is in your right hand?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "18",
    "Text": "Musa replied: \"It is my staff; I lean on it, I beat down fodder\\n\\t\\t\\twith it for my flocks and I have also other uses for it\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "19",
    "Text": "Allah said \"Toss it down O Musa\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "20",
    "Text": "So he toss it down and saw that it became a snake active in\\n\\t\\t\\tmotion."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "21",
    "Text": "Allah said: \"Catch it and don't be afraid, We shall change it to\\n\\t\\t\\tits original shape."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "22",
    "Text": "Now put your hand under your armpit, it shall become shining\\n\\t\\t\\twhite without hurting you, this will be another Sign."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "23",
    "Text": "These miracles are given to you, in order to show you some of Our\\n\\t\\t\\tGreat Signs."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "24",
    "Text": "Now go to Fir'on (Pharaoh) for he has indeed transgressed all\\n\\t\\t\\tbounds.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "25",
    "Text": "Musa prayed: \"O Rabb! Open my heart,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "26",
    "Text": "ease my task"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "27",
    "Text": "and remove the impediment from my speech"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "28",
    "Text": "so that people may understand what I say"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "29",
    "Text": "and grant me a minister from my family;"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "30",
    "Text": "Haroon my brother."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "31",
    "Text": "Grant me strength through him"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "32",
    "Text": "and let him share my task,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "33",
    "Text": "so that we may glorify You frequently"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "34",
    "Text": "and mention You often;"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "35",
    "Text": "for You are the One Who has always been watching over us.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "36",
    "Text": "Allah responded: \"Your request is granted, O Musa."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "37",
    "Text": "We had indeed bestowed a favor on you before,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "38",
    "Text": "when We revealed Our will to your mother saying:"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "39",
    "Text": "'Put your child into the chest and throw the chest into the\\n\\t\\t\\triver. The river will cast him on to the bank and he will be\\n\\t\\t\\tpicked up by one who is an enemy to Me and an enemy to him'. I\\n\\t\\t\\tmade you an object of love and so arranged things that you may be\\n\\t\\t\\tbrought up under My supervision."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "Text": "Recall when your sister went to them and said: `May I tell you of\\n\\t\\t\\tthe one who can take care of this child?' Thus did We return you\\n\\t\\t\\tback to your mother to comfort her eyes and that she might not\\n\\t\\t\\tgrieve. Again when you killed a man, We saved you from great\\n\\t\\t\\tdistress and We tested you through various trials. You stayed a\\n\\t\\t\\tnumber of years with the people of Median. Now you have come here\\n\\t\\t\\tper Our pre-estimation, O Musa."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "41",
    "Text": "I have moulded you for My service."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "42",
    "Text": "You and your brother should go with My Signs and do not neglect\\n\\t\\t\\tto mention Me."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "43",
    "Text": "Go both of you to Fir'on, for he has indeed transgressed all\\n\\t\\t\\tbounds."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "44",
    "Text": "Speak to him in gentle words; perhaps he may take heed of the\\n\\t\\t\\treminder or fear Our punishment.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "45",
    "Text": "Musa and Haroon said: \"Our Rabb! We fear that he may behave\\n\\t\\t\\ttowards us unjustly or may cross all bounds.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "46",
    "Text": "Allah said: \"Do not be afraid, I shall be with you both. I hear\\n\\t\\t\\teverything and see everything."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "47",
    "Text": "So go to him and say `Surely we both are Rasools of your Rabb.\\n\\t\\t\\tLet the Children of Israel go with us and oppress them no more.\\n\\t\\t\\tWe have brought you a Sign from your Rabb; may peace be upon him\\n\\t\\t\\twho follows the guidance."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "48",
    "Text": "Indeed it has been revealed to us that the scourge will fall on\\n\\t\\t\\tthose who deny this fact and turns away'.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "49",
    "Text": "When Musa and Haroon went to Fir'on and delivered this message ,\\n\\t\\t\\the said: \"Well, who is your Rabb O Musa?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "50",
    "Text": "Musa replied: \"Our Rabb is He Who has given a distinctive form to\\n\\t\\t\\tall creatures and then rightly guided them.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "51",
    "Text": "Fir'on asked: \"What do you say about the condition of previous\\n\\t\\t\\tgenerations?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "52",
    "Text": "Musa replied: \"That knowledge is with my Rabb, duly recorded in a\\n\\t\\t\\tBook. He neither makes a mistake nor does He forget.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "53",
    "Text": "He is the One Who has made the earth a cradle for you, traced the\\n\\t\\t\\troads on it for you to walk on; and sends down water from the sky\\n\\t\\t\\twith which We produce pairs of various kinds of vegetation"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "54",
    "Text": "- eat from these yourselves and pasture your cattle. Surely there\\n\\t\\t\\tare Signs in it for those who use their brains."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "55",
    "Text": "We have created you from the earth, into it We shall return you\\n\\t\\t\\tand from it We shall bring you back to life once again."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "56",
    "Text": "We showed Fir'on all kinds of Our Signs, but he denied them and\\n\\t\\t\\tgave no heed."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "57",
    "Text": "He said: \"Have you come to drive us out of our land with your\\n\\t\\t\\tmagic O Musa?"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "58",
    "Text": "Well, we will confront you with magic to match yours! Let us fix\\n\\t\\t\\ta day when both of us should meet, neither we nor you shall fail\\n\\t\\t\\tto keep it, in a place where both shall have even chances.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "59",
    "Text": "Musa replied: \"Let it be the Day of Festival and let the people\\n\\t\\t\\tbe assembled before noon\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "60",
    "Text": "Fir'on then withdrew, concerted his plan and came back."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "61",
    "Text": "Musa addressed them saying: \"Woe to you for this challenge! Do\\n\\t\\t\\tnot forge a lie against Allah by calling it a magic, lest He\\n\\t\\t\\tdestroy you by a scourge; for whosoever forge a lie will indeed\\n\\t\\t\\tbe disappointed.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "62",
    "Text": "Hearing this, they debated their case among themselves,\\n\\t\\t\\twhispering to one another."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "63",
    "Text": "Finally they said: \"These two (Musa and Haroon) are certainly\\n\\t\\t\\texpert magicians who intend to drive you out from your land with\\n\\t\\t\\ttheir magic and to do away with your best traditions."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "64",
    "Text": "Therefore, muster up all devices and face them with a united\\n\\t\\t\\tfront.\" Finally when the day of confrontation came, Fir'on said:\\n\\t\\t\\t\" Whoever comes out victorious this day shall prevail.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "65",
    "Text": "The magicians said: \"O Musa! Will you throw down first or shall\\n\\t\\t\\twe?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "66",
    "Text": "Musa replied: \"Go ahead, throw down first\". Suddenly it appeared\\n\\t\\t\\tto Musa as if their cords and staffs were moving about because of\\n\\t\\t\\ttheir magic,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "67",
    "Text": "and Musa conceived fear within himself."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "68",
    "Text": "We said: \"Do not be afraid! You will surely come out on top."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "69",
    "Text": "Throw that which is in your right hand. It will swallow up every\\n\\t\\t\\tthing they have produced. What they have produced is nothing but\\n\\t\\t\\ta magician's trick, and a magician can never succeed against a\\n\\t\\t\\tmiracle no matter how skillful he may be.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "70",
    "Text": "When the magicians saw the serpent of Musa swallowing all their\\n\\t\\t\\tdisplay, being professionals they knew that it was not magic, so\\n\\t\\t\\tthe magicians humbled themselves by prostrating and said: \"We\\n\\t\\t\\tbelieve in the Rabb of Haroon and Musa.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "71",
    "Text": "Fir'on said: \"How do you dare to believe in Him without my\\n\\t\\t\\tpermission? This man must be your master, who taught you\\n\\t\\t\\twitchcraft. Well, I will cut off your hands and feet on alternate\\n\\t\\t\\tsides and crucify you on trunks of palm-trees; then you will know\\n\\t\\t\\twhich one of us can give a more terrible and more lasting\\n\\t\\t\\tpunishment.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "72",
    "Text": "The magicians replied: \"We can never prefer you, rather we prefer\\n\\t\\t\\tthe miracle which we have witnessed and Him Who has created us.\\n\\t\\t\\tTherefore do whatever you will; you can only punish us in this\\n\\t\\t\\tworldly life."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "73",
    "Text": "As for us, we have believed in our Rabb so that He may forgive us\\n\\t\\t\\tour sins and the magic you have forced us to practice. Better is\\n\\t\\t\\tthe ever lasting reward of Allah.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "74",
    "Text": "Surely he who will come to his Rabb as a sinner shall be\\n\\t\\t\\tconsigned to Hell - wherein he shall neither die nor live."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "75",
    "Text": "While he who will come to Him as a believer and has done good\\n\\t\\t\\tdeeds shall have the highest ranks"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "76",
    "Text": "- Gardens of Eden, beneath which rivers flow, live therein\\n\\t\\t\\tforever; such is the reward of those who purify themselves from\\n\\t\\t\\tevil."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "77",
    "Text": "We sent Our revelation to Musa, saying: \"Set forth with my\\n\\t\\t\\tservants at night and strike a dry path for them through the sea\\n\\t\\t\\twithout fear of being overtaken by Fir'on and without any fear\\n\\t\\t\\twhile passing through the sea.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "78",
    "Text": "Fir'on followed them with his armies but the waters completely\\n\\t\\t\\toverwhelmed them as it could overwhelm them."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "79",
    "Text": "Thus Fir'on misled his people instead of guiding them aright."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "80",
    "Text": "O Children of Israel! We delivered you from your enemy, We fixed\\n\\t\\t\\ta time to grant you The Taurat on the right side of Mount Tur and\\n\\t\\t\\tWe sent down to you Manna (sweet dish) and Salva (quail meat)"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "81",
    "Text": "- saying: \"Eat of the good things We have provided for your\\n\\t\\t\\tsustenance and do not transgress, lest you should incur My wrath,\\n\\t\\t\\tand whoever incurs My wrath is surely bound to perish,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "82",
    "Text": "but the one who repents, becomes a believer, does good deeds and\\n\\t\\t\\tfollows the Right Way shall be forgiven.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "83",
    "Text": "When Musa came to the mount Tur Allah said: \"But, why have you\\n\\t\\t\\tcome with such a haste ahead of your people, O Musa?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "84",
    "Text": "He replied: \"They are close behind me, I hastened to You O Rabb\\n\\t\\t\\tso that You may be pleased\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "85",
    "Text": "Allah said: \"Well listen! We tested your people after you and the\\n\\t\\t\\tSamiri (Samaritan) has led them astray.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "86",
    "Text": "So Musa returned to his people in a state of anger and sorrow. He\\n\\t\\t\\tsaid: \"O my people! Did your Rabb not make a gracious promise to\\n\\t\\t\\tyou? Did my absence seem too long to you? Or was it to incur the\\n\\t\\t\\twrath of your Rabb that you broke your promise with me?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "87",
    "Text": "They replied: \"We broke the promise through no fault of ours. We\\n\\t\\t\\twere made to carry the burden of the peoples ornaments and throw\\n\\t\\t\\tthem into the fire, thus Samiri suggested, who threw in something"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "88",
    "Text": "and forged a calf in the shape of a body which produced the\\n\\t\\t\\tmooing sound. Then they cried out: `This is your god and the god\\n\\t\\t\\tof Musa, but Musa forgot to mention it to you.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "89",
    "Text": "What! Could they not see that it did not respond to them and that\\n\\t\\t\\tit could neither harm them nor help them?"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "90",
    "Text": "Haroon had already told them: \"O my people! This is but a test\\n\\t\\t\\tfor you; for verily your Rabb is the Rahman (Allah): so follow me\\n\\t\\t\\tand do as I command you.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "91",
    "Text": "They had replied: \"We will not abandon its worship until Musa's\\n\\t\\t\\treturn.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "92",
    "Text": "Then Musa addressed Haroon: \" O Haroon! What prevented you from\\n\\t\\t\\tfollowing me, when you saw them going astray?"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "93",
    "Text": "Why did you disobey me?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "94",
    "Text": "Haroon replied: \"O son of my mother! Do not seize me by my beard\\n\\t\\t\\tnor pull the hair of my head, in fact I was afraid lest you might\\n\\t\\t\\tsay: `You have caused a division, through civil war, among the\\n\\t\\t\\tChildren of Israel and did not respect to what I said, 'to keep\\n\\t\\t\\tpeace'.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "95",
    "Text": "Then Musa addressed Samiri: \"Now what you have to say about this,\\n\\t\\t\\tO Samiri?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "96",
    "Text": "He replied: \"I saw what they did not see, so I took a handful of\\n\\t\\t\\tdust from the footprint of the Rasool (Angel Gabriel) and threw\\n\\t\\t\\tit into the casting of the calf: thus did my soul prompt me.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "97",
    "Text": "Musa cursed him: \"Get out of here! Now through out your life, you\\n\\t\\t\\twill say to other people: `Touch me not'; and you will not escape\\n\\t\\t\\tyour appointed doom. Behold this god to whom you had become a\\n\\t\\t\\tdevoted worshipper: we will burn it and scatter its ashes into\\n\\t\\t\\tthe sea.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "98",
    "Text": "Then he addressed his people: \"O my people! Your only God is\\n\\t\\t\\tAllah, other than Whom there is no god. His knowledge encompasses\\n\\t\\t\\tevery thing.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "99",
    "Text": "Thus do We relate to you, O Muhammad, some information of the\\n\\t\\t\\tpast events; and indeed We have sent you this Reminder (The\\n\\t\\t\\tQur'an) from Our Own Self."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "100",
    "Text": "Those who reject it, shall bear a heavy burden on the Day of\\n\\t\\t\\tResurrection."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "101",
    "Text": "For ever shall they bear it, and it will be indeed a very evil\\n\\t\\t\\tburden to bear on the Day of Resurrection."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "102",
    "Text": "The Day, when the Trumpet will be blown and We shall assemble all\\n\\t\\t\\tthe sinners, their eyes will turn blue with terror."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "103",
    "Text": "They shall murmur among themselves: \"You hardly lived ten days on\\n\\t\\t\\tearth\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "104",
    "Text": "We know fully well what they will say; the most careful estimator\\n\\t\\t\\tamong them will say: \"No, you stayed no longer than a day.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "105",
    "Text": "They ask you as to what will happen to the mountains. Tell them:\\n\\t\\t\\t\"My Rabb will crush and scatter them like a fine dust."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "106",
    "Text": "He will turn the earth into a plain leveled ground,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "107",
    "Text": "wherein you will not see neither any curve nor crease.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "108",
    "Text": "- On that Day the people will follow the call of the Caller, no\\n\\t\\t\\tone will dare show any crookedness; their voices hushed before\\n\\t\\t\\tthe Beneficent (Allah), and you shall here nothing but the sound\\n\\t\\t\\tof the marching feet."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "109",
    "Text": "On that Day, no intercession will avail except the one to whom\\n\\t\\t\\tthe Beneficent (Allah) shall grant permission and would like to\\n\\t\\t\\tgive him a hearing."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "110",
    "Text": "He knows what is before them and what is behind them while they\\n\\t\\t\\tdo not encompass any knowledge about Him."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "111",
    "Text": "Their faces shall be humbled before the Ever-Living, the\\n\\t\\t\\tEver-existent (Allah). The one who is carrying the burden of\\n\\t\\t\\tiniquity will be doomed:"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "112",
    "Text": "but the one who is a believer and does good deeds shall fear no\\n\\t\\t\\ttyranny or injustice."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "113",
    "Text": "Thus have we sent down this Qur'an in Arabic and clearly\\n\\t\\t\\tproclaimed in it some of the warnings so that they may take heed\\n\\t\\t\\tor that it may serve as a reminder to them."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "114",
    "Text": "High and exalted be Allah, the True King! Do not hasten to recite\\n\\t\\t\\tthe Qur'an before its revelation is completely conveyed to you,\\n\\t\\t\\tand then say: \"O Rabb! Increase my knowledge.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "115",
    "Text": "We had taken a covenant from Adam before, but he forgot. We did\\n\\t\\t\\tnot find in him firm determination."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "116",
    "Text": "When We said to the angels \"Prostrate yourselves before Adam\",\\n\\t\\t\\tthey all prostrated themselves except Iblees (Shaitan),: who\\n\\t\\t\\trefused."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "117",
    "Text": "Then We said: \"O Adam! This Shaitan is a real enemy to you and to\\n\\t\\t\\tyour wife. Do not let him get you both out of Paradise and get\\n\\t\\t\\tyou in trouble."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "118",
    "Text": "Here in Paradise you shall go neither hungry nor naked;"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "119",
    "Text": "you shall neither suffer from thirst nor from the scorching\\n\\t\\t\\theat.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "120",
    "Text": "- But Shaitan seduced him saying: \"O Adam! Should I show you the\\n\\t\\t\\tTree of Immortality and an everlasting kingdom?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "121",
    "Text": "They both end up eating the fruit of the forbidden tree. As a\\n\\t\\t\\tresult their private parts became apparent to them and they both\\n\\t\\t\\tbegan to cover themselves with the leaves from the Garden. Thus\\n\\t\\t\\tdid Adam disobey His Rabb and go astray."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "122",
    "Text": "Later on Adam repented and his Rabb chose him, accepted his\\n\\t\\t\\trepentance and gave him guidance,"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "123",
    "Text": "saying: \"Get down from here all of you (Adam, Eve and Iblees);\\n\\t\\t\\tyou will remain enemies to one another, whenever there comes to\\n\\t\\t\\tyou guidance from Me and whosoever will follow My guidance will\\n\\t\\t\\tneither go astray nor get into trouble;"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "124",
    "Text": "but the one who will turn away from My reminder shall live a\\n\\t\\t\\tmeager life and We shall raise him back to life as a blind person\\n\\t\\t\\ton the Day of Resurrection.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "125",
    "Text": "He will say: \"O Rabb! Why have you raised me up blind here, while\\n\\t\\t\\tI was clear-sighted before?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "126",
    "Text": "Allah will say: \"Just as Our revelation came to you and you\\n\\t\\t\\tplayed blind; so are you blind today.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "127",
    "Text": "Thus do We reward the one who is a transgressor and does not\\n\\t\\t\\tbelieve in the revelations of his Rabb. The punishment of the\\n\\t\\t\\tHereafter is more terrible and more lasting."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "128",
    "Text": "Have these people not learned a lesson that; We have destroyed\\n\\t\\t\\tbefore them many generations in whose ruins they walk through?\\n\\t\\t\\tCertainly in these ruins there are Signs for people of\\n\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "129",
    "Text": "Had it not been already decreed by your Rabb and a term for\\n\\t\\t\\trespite been appointed, they would have been punished."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "130",
    "Text": "Therefore be patient with what they say. Glorify your Rabb with\\n\\t\\t\\tHis praise before sunrise and before sunset, glorify Him during\\n\\t\\t\\tthe hours of the night as well as at the ends of the day, so that\\n\\t\\t\\tyou may find satisfaction."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "131",
    "Text": "Do not strain your eyes with envy regarding the worldly benefits\\n\\t\\t\\tWe have bestowed on some among them, for with these We seek to\\n\\t\\t\\ttest them, the lawful provision of your Rabb is better and more\\n\\t\\t\\tlasting."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "132",
    "Text": "Enjoin Salah on your people and be diligent in its observance. We\\n\\t\\t\\tdemand nothing of you; instead We provide you sustenance. Blessed\\n\\t\\t\\tshall be the end of the Righteous."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "133",
    "Text": "They say: \"Why does he (Muhammad) not bring us a Sign from His\\n\\t\\t\\tRabb?\" Has not a clear Sign (The Qur'an) come to them containing\\n\\t\\t\\tall the teachings of the former Scriptures?"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "134",
    "Text": "Had We destroyed them as punishment before its revelation, they\\n\\t\\t\\twould have said: \"Our Rabb! If only You had sent us a Rasool, we\\n\\t\\t\\twould certainly have followed Your revelations before being\\n\\t\\t\\thumiliated and disgraced.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "135",
    "Text": "Say: \"All are waiting: so wait if you will. Very soon you shall\\n\\t\\t\\tfind out, who is following the Right Way and who has been rightly\\n\\t\\t\\tguided.\""
  }
]
