[
  {
    "SurahNumber": "35",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "The \"wings\" of the spiritual beings or forces comprised\\n\\t\\t\\t\\twithin the designation of angels are, obviously, a\\n\\t\\t\\t\\tmetaphor for the speed and power with which God's\\n\\t\\t\\t\\trevelations are conveyed to His prophets. Their\\n\\t\\t\\t\\tmultiplicity (\"two, or three, or four\") is perhaps meant\\n\\t\\t\\t\\tto stress the countless ways in which He causes His\\n\\t\\t\\t\\tcommands to materialize within the universe created by\\n\\t\\t\\t\\tHim: an assumption which, to my mind, is supported by an\\n\\t\\t\\t\\tauthentic hadith to the effect that on the night of his\\n\\t\\t\\t\\tAscension (see Appendix IV) the Prophet saw Gabriel\\n\\t\\t\\t\\t\"endowed with six hundred wings\" (Bukhari and Muslim, on\\n\\t\\t\\t\\tthe authority of Ibn Mas'ud)."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "I.e., the process of creation is continuous, constantly\\n\\t\\t\\t\\texpanding in scope, range and variety."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "See  10:31  and the corresponding note [49]."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "Sc., \"inasmuch as you attribute divine qualities or\\n\\t\\t\\t\\tpowers to anyone or anything beside Him\". For an\\n\\t\\t\\t\\texplanation of the phrase anna tu'fakun (lit., \"how\\n\\t\\t\\t\\tturned-away you are\", i.e., from the truth), see surah\\n\\t\\t\\t\\t{5}, note [90]."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "See  31:33  (which is phrased in exactly the same way)\\n\\t\\t\\t\\tand the corresponding note [30]. - As regards the\\n\\t\\t\\t\\texplicit reference to Satan in the next verse of the\\n\\t\\t\\t\\tpresent surah, see Razi's remarks quoted in note [31] on\\n\\t\\t\\t\\t 14:22 , as well as note [16] on  15:17 ."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "See surah {14}, note [4], which explains my rendering of\\n\\t\\t\\t\\tthis sentence."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "10",
    "NoteID": "7",
    "Body": "It appears that in this context - as in the first\\n\\t\\t\\t\\tparagraph of  10:21  or in  34:33  - both the noun makr\\n\\t\\t\\t\\t(lit., \"a scheme\", or \"scheming\" or \"plotting\") and the\\n\\t\\t\\t\\tverb yamkurun (lit., \"they scheme\" or \"plot\") have the\\n\\t\\t\\t\\tconnotation of \"devising false [or \"fallacious\"]\\n\\t\\t\\t\\targuments\" against something that is true. Since the\\n\\t\\t\\t\\tpreceding passages refer to God's creativeness and, in\\n\\t\\t\\t\\tparticular, to His power to create life and resurrect the\\n\\t\\t\\t\\tdead (verse {9}), the \"evil deeds\" spoken of above are,\\n\\t\\t\\t\\tpresumably, specious arguments meant to \"disprove\" the\\n\\t\\t\\t\\tannouncement of resurrection."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "11",
    "NoteID": "8",
    "Body": "See second half of note [47] on  3:59 , and note [4] on\\n\\t\\t\\t\\t 23:12 ."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "Lit., \"makes you pairs\" or \"mates\" [of one another]."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "12",
    "NoteID": "10",
    "Body": "This interpolated sentence reflects Razi's convincing\\n\\t\\t\\t\\texplanation of the passage that follows here, and its\\n\\t\\t\\t\\tconnection with the preceding one."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "12",
    "NoteID": "11",
    "Body": "For this rendering of al-bahran, see note [41] on\\n\\t\\t\\t\\t 25:53 ."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "13",
    "NoteID": "12",
    "Body": "See surah {13}, note [5]."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "14",
    "NoteID": "13",
    "Body": "The Qur'an states in many places that all false objects\\n\\t\\t\\t\\tof worship - whether saints, angels, relics, fetishes, or\\n\\t\\t\\t\\tdeified forces of nature - will bear witness against\\n\\t\\t\\t\\ttheir one-time worshippers on Resurrection Day, and will\\n\\t\\t\\t\\t\"disown\" them: a symbolic allusion to man's perception,\\n\\t\\t\\t\\tat the end of time, of the ultimate reality."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "16",
    "NoteID": "14",
    "Body": "See note [27] on  14:19 ."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "18",
    "NoteID": "15",
    "Body": "I.e., on Judgment Day - for \"whatever [wrong] any human\\n\\t\\t\\t\\tbeing commits rests upon him alone\" ( 6:164 , which is\\n\\t\\t\\t\\tfollowed by a sentence identical with the one above)."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "18",
    "NoteID": "16",
    "Body": "Thus, any transfer of moral responsibility from one\\n\\t\\t\\t\\tperson to another is shown to be impossible. Whereas the\\n\\t\\t\\t\\tfirst part of the above statement implies a negation of\\n\\t\\t\\t\\tthe Christian doctrine of \"original sin\" with which\\n\\t\\t\\t\\tmankind is supposedly burdened, the second part\\n\\t\\t\\t\\tcategorically refutes the doctrine of the \"vicarious\\n\\t\\t\\t\\tatonement\" of that sin by Jesus. (See also  53:38  and\\n\\t\\t\\t\\tthe corresponding note [31].)"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "18",
    "NoteID": "17",
    "Body": "For an explanation of this rendering of bi'l-ghayb, see\\n\\t\\t\\t\\tsurah {2}, note [3]. The meaning is that only those \"who\\n\\t\\t\\t\\tbelieve in the existence of that which is beyond the\\n\\t\\t\\t\\treach of human perception\" can really benefit by the\\n\\t\\t\\t\\t\"warning\" inherent in the preceding statement. (See also\\n\\t\\t\\t\\t{27:80-81} and {30:52-53}.)"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "24",
    "NoteID": "18",
    "Body": "One of the meanings of the term ummah (preferred by\\n\\t\\t\\t\\tZamakhshari in his commentary on the above verse) is\\n\\t\\t\\t\\t\"people of one time\" or \"age\"; another, \"people of one\\n\\t\\t\\t\\tkind\", i.e., \"a nation\" or \"a community\" (which is\\n\\t\\t\\t\\tadopted by me in this context). Taking into consideration\\n\\t\\t\\t\\ta third, well-established meaning, namely, \"a\\n\\t\\t\\t\\t[particular] way of life\" or \"of behaviour\" (Jawhari),\\n\\t\\t\\t\\tthe term \"community\" comes, in this instance, close to\\n\\t\\t\\t\\tthe modern concept of \"civilization\" in its historical\\n\\t\\t\\t\\tsense. - The stress on the warners' (i.e., prophets)\\n\\t\\t\\t\\thaving \"passed away\" is meant to emphasize the humanness\\n\\t\\t\\t\\tand mortality of each and all of them."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "28",
    "NoteID": "19",
    "Body": "Cf.  16:13 , where the splendour of nature (\"the beauty\\n\\t\\t\\t\\tof many hues\") is spoken of as an evidence of God's\\n\\t\\t\\t\\tcreative power."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "28",
    "NoteID": "20",
    "Body": "I.e., spiritual knowledge, born of the realization that\\n\\t\\t\\t\\tthe phenomena which can be observed do not comprise the\\n\\t\\t\\t\\twhole of reality, inasmuch as there is \"a realm beyond\\n\\t\\t\\t\\tthe reach of a created being's perception\" (cf. surah\\n\\t\\t\\t\\t{2}, note [3])."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "31",
    "NoteID": "21",
    "Body": "For this explanatory rendering of the phrase ma bayna\\n\\t\\t\\t\\tyadayhi, see note [3] on  3:3 ."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "32",
    "NoteID": "22",
    "Body": "See  7:46  and the corresponding note [37]."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "33",
    "NoteID": "23",
    "Body": "Regarding this symbolic \"adornment\" of the blessed in\\n\\t\\t\\t\\tparadise, see note [41] on  18:31 ."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "39",
    "NoteID": "24",
    "Body": "See note [22] on  2:30 . In this instance, God's having\\n\\t\\t\\t\\tmade man \"inherit the earth\" implies the grant to him of\\n\\t\\t\\t\\tthe ability to discern between right and wrong as well as\\n\\t\\t\\t\\tbetween truth and falsehood."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "40",
    "NoteID": "25",
    "Body": "Lit., \"those [God-]partners of yours\": see note [15] on\\n\\t\\t\\t\\t 6:22 ."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "40",
    "NoteID": "26",
    "Body": "I.e., to those who ascribe divinity to beings or forces other than God."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "40",
    "NoteID": "27",
    "Body": "Cf. 30 : 35 - \"Have We ever bestowed upon them from on high a divine writ which would speak [with approval] of their worshipping aught beside Us?\" The reference to a \"divine writ\" makes it clear that the people spoken of here are the erring followers of earlier revelation, and not atheists."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "40",
    "NoteID": "28",
    "Body": "I.e., their expectation that the saints whom they invest with divine or semi-divine qualities will \"mediate\" between them and God, or \"intercede\" for them before Him, is based on nothing but wishful thinking."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "41",
    "NoteID": "29",
    "Body": "Lit., \"the heavens\" - in this case apparently a metonym\\n\\t\\t\\t\\tfor all the stars, galaxies, nebulae, etc., which\\n\\t\\t\\t\\ttraverse the cosmic spaces in obedience to a most\\n\\t\\t\\t\\tintricate system of God-willed laws, of which the law of\\n\\t\\t\\t\\tgravity, perhaps most obvious to man, is but one."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "41",
    "NoteID": "30",
    "Body": "Lit., \"after Him\". This seems to be an allusion to the\\n\\t\\t\\t\\tLast Hour, which, according to the Qur'an, will be\\n\\t\\t\\t\\theralded by a cosmic catastrophe."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "41",
    "NoteID": "31",
    "Body": "I.e., inasmuch as He does not speed up the end of the\\n\\t\\t\\t\\tworld despite the sinfulness of most of its inhabitants,\\n\\t\\t\\t\\tand neither punishes without giving the sinner time to\\n\\t\\t\\t\\treflect and to repent (cf. verse {45})."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "42",
    "NoteID": "32",
    "Body": "Cf.  6:157  and the corresponding note [158]."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "43",
    "NoteID": "33",
    "Body": "I.e., fallacious arguments meant to disparage those\\n\\t\\t\\t\\tmessages and to \"disprove\" their divine origin (cf.\\n\\t\\t\\t\\t 10:21  or  34:33  and the corresponding notes on the\\n\\t\\t\\t\\tQur'anic use of the term makr in this sense)."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "43",
    "NoteID": "34",
    "Body": "I.e., the way (sunnah) in which God has punished them."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "45",
    "NoteID": "35",
    "Body": "Or: \"known [to Him alone]\" - i.e., the end of their lives\\n\\t\\t\\t\\ton earth."
  }
]
