[
  {
    "SurahNumber": "44",
    "AyahNumber": "1",
    "NoteID": "4688",
    "Body": "These Abbreviated Letters are discussed in the\\n\\t\\t\\t\\tIntroduction to S. xi."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "2",
    "NoteID": "4689",
    "Body": "The Qur-an is its own evidence. In the last Sura (xliii.\\n\\t\\t\\t\\t3) stress was laid on the fact that everyone could\\n\\t\\t\\t\\tunderstand it. Here the stress is on the fact that it is\\n\\t\\t\\t\\ta Message of Mercy from Allah in that it warns mankind\\n\\t\\t\\t\\tagainst evil."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "3",
    "NoteID": "4690",
    "Body": "Usually taken to be a night in the month of Ramadhan, say\\n\\t\\t\\t\\tthe 23rd, 25th, or 27th night of that month. It is\\n\\t\\t\\t\\treferred to as the Night of Power in xcvii. 1-2. See also\\n\\t\\t\\t\\tii. 185. But perhaps we need not fix it literally by the\\n\\t\\t\\t\\tcalendar. The night that a Message descends from Allah is\\n\\t\\t\\t\\tindeed a blessed night like a day of rain for a parched\\n\\t\\t\\t\\tland."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "4",
    "NoteID": "4691",
    "Body": "Such an occasion is one on which divine Wisdom places\\n\\t\\t\\t\\tbefore us through Revelation the solution of spiritual\\n\\t\\t\\t\\tproblems of the highest import to mankind."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "6",
    "NoteID": "4692",
    "Body": "It is because Allah is the friend of the friendless and\\n\\t\\t\\t\\tthe help of the helpless that He hears all sincere\\n\\t\\t\\t\\tprayers, and as His knowledge embraces all things, He\\n\\t\\t\\t\\tgrants to us whatever is best for us, not as we see it,\\n\\t\\t\\t\\tbut as He knows it in His perfect knowledge."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "7",
    "NoteID": "4693",
    "Body": "Cf. ii. 4. They cannot fully realise what a tremendous\\n\\t\\t\\t\\tthing it is that Allah is their own Lord and Cherisher\\n\\t\\t\\t\\t(nex verse), as He is the Lord and Cherisher of the whole\\n\\t\\t\\t\\tUniverse, until they firmly believe,-until their Faith\\n\\t\\t\\t\\tamounts to a certainty, secure and unshakable."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "9",
    "NoteID": "4694",
    "Body": "The story is mainly about the Quraish. But there is a\\n\\t\\t\\t\\twider meaning behind it, applicable to men generally, and\\n\\t\\t\\t\\tat all times. As a body the Quraish, especially in the\\n\\t\\t\\t\\tearlier stages of the preaching of Islam, before they\\n\\t\\t\\t\\tstarted persecution, received the Message with more\\n\\t\\t\\t\\tamusement than hatred. They played about with it, and\\n\\t\\t\\t\\texpressed doubts about it, whereas the Preacher was most\\n\\t\\t\\t\\tearnest about it, with all his heart and soul in it, as\\n\\t\\t\\t\\the loved his people and wished to save them from their\\n\\t\\t\\t\\twickedness and folly."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "10",
    "NoteID": "4695",
    "Body": "What Day is this? It obviously refers to great calamity,\\n\\t\\t\\t\\tand from the wording it is to be a great calamity in the\\n\\t\\t\\t\\tfuture, seen with the prophetic eye. The word yagsha in\\n\\t\\t\\t\\tverse 11 may be compared to gashiya in lxxxviii. 1, which\\n\\t\\t\\t\\tobviously refers to the final Day of Judgment. But verse\\n\\t\\t\\t\\t15 below (\"We shall remove the Penalty for a while\")\\n\\t\\t\\t\\tshows that it is not the final Judgment referred to here,\\n\\t\\t\\t\\tbut some calamity that was to happen soon afterwards.\\n\\t\\t\\t\\tPerhaps it was a famine, about which see the next note."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "10",
    "NoteID": "4696",
    "Body": "The \"smoke\" or \"mist\" is interpreted on good authority to\\n\\t\\t\\t\\trefer to a severe famine in Makkah, in which men were so\\n\\t\\t\\t\\tpinched with hunger that they saw mist before their eyes\\n\\t\\t\\t\\twhen they looked at the sky. Ibn Kathir in his Tarikh\\n\\t\\t\\t\\tmentions two famines in Makkah, one in the 8th year of\\n\\t\\t\\t\\tthe Mission, say the fourth year before the Hijra, and\\n\\t\\t\\t\\tanother about the 8th year after the Hijra. But as either\\n\\t\\t\\t\\tor both of these famines lasted as many as seven years,\\n\\t\\t\\t\\tthe dates are to be taken very roughly. It is even\\n\\t\\t\\t\\tpossible that the two famines were continuous, of varying\\n\\t\\t\\t\\tseverity from year to year. Bukhari mentions only the\\n\\t\\t\\t\\tpost-Hijrat famine, which was apparently so severe that\\n\\t\\t\\t\\tmen began to eat bones and carrion. Abu Sufyan (about 8\\n\\t\\t\\t\\tA.H.) approached the holy Prophet to intercede and pray\\n\\t\\t\\t\\tfor the removal of the famine, as the Pagans attributed\\n\\t\\t\\t\\tit to the curse of the Prophet. Sura xxiii., which is\\n\\t\\t\\t\\talso Makkan, but of later date than the present Sura,\\n\\t\\t\\t\\talso refers to a famine: see xxiii. 75, and n. 2921. As\\n\\t\\t\\t\\tSuras were not all revealed entire, but many came\\n\\t\\t\\t\\tpiecemeal, it is possible that particular verses in a\\n\\t\\t\\t\\tgiven Sura may be of different dates from the Sura as a\\n\\t\\t\\t\\twhole."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "13",
    "NoteID": "4697",
    "Body": "The Quraish had before them a prophet whose purity of\\n\\t\\t\\t\\tlife was openly known to them; they themselves called him\\n\\t\\t\\t\\tal-Amin (worthy of all trust); he preached in their own\\n\\t\\t\\t\\tlanguage in words of burning eloquence and transparent\\n\\t\\t\\t\\tclearness; yet they turned away from him and called him a\\n\\t\\t\\t\\tmadman, or one whose Message was not inspired by Allah,\\n\\t\\t\\t\\tbut written by some hidden hand (see next note)! How will\\n\\t\\t\\t\\tthe teaching of spiritual Truth make way among such\\n\\t\\t\\t\\tunreasonable people?"
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "14",
    "NoteID": "4698",
    "Body": "Tutored: see xvi. 103, and n. 2143. Possessed: see xv. 6,\\n\\t\\t\\t\\tand n. 1940."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "15",
    "NoteID": "4699",
    "Body": "Allah gives every chance to all His creatures, however\\n\\t\\t\\t\\trebellious. He gives them a little trial, perhaps\\n\\t\\t\\t\\tpersonal, perhaps economic, to see if that would bring\\n\\t\\t\\t\\tthem to their bearings, and train their will in the right\\n\\t\\t\\t\\tdirection. Some are thus reclaimed, and some do not\\n\\t\\t\\t\\tlearn. Perhaps, for the latter, he gives them a chance by\\n\\t\\t\\t\\tremoving the trial; some are reclaimed, and some still\\n\\t\\t\\t\\tremain obdurate. And so, in His wisdom, He allows His\\n\\t\\t\\t\\tgrace to work, again and again, until, at the last,\\n\\t\\t\\t\\tJudgment must seize the last and irreclaimable remnant\\n\\t\\t\\t\\t\"with a mighty onslaught\". Such working of Allah's\\n\\t\\t\\t\\tProvidence is clearly visible in the story of the\\n\\t\\t\\t\\tQuraish. It is a pity that the economic conditions of\\n\\t\\t\\t\\tMakkah have not been studied in detail in any of the\\n\\t\\t\\t\\tstandard biographies of the Prophet. The so-called\\n\\t\\t\\t\\tbiographies by non-Muslims, e.g. , Muir's Life, do not\\n\\t\\t\\t\\teven mention any Makkan famine or its reactions on the\\n\\t\\t\\t\\tQuraish mind!"
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "17",
    "NoteID": "4700",
    "Body": "This reference is to the pride of Pharaoh and his\\n\\t\\t\\t\\tEgyptians, and their fall, rather than to the story of\\n\\t\\t\\t\\tMoses himself; just as in xliv. 30-33 the reference is to\\n\\t\\t\\t\\tthe blessings bestowed on Israel, contrasted with their\\n\\t\\t\\t\\tpride, unbelief, and fall; and in xliv. 37, to the\\n\\t\\t\\t\\tancient Himyar kingdom in Yaman, which similarly fell for\\n\\t\\t\\t\\tits sins."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "17",
    "NoteID": "4701",
    "Body": "Most honourable: this epithet is specially applied to\\n\\t\\t\\t\\tMoses here, as expressing the truth, in contrast to the\\n\\t\\t\\t\\tPharaoh's false characterisation of him as \"a\\n\\t\\t\\t\\tcontemptible wretch\". (xliii. 52)."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "18",
    "NoteID": "4702",
    "Body": "The argument of Moses and his \"authority manifest\" will\\n\\t\\t\\t\\tbe found at vii. 104-108, 120-126, 130-137. Notice how\\n\\t\\t\\t\\tfully he assumes the authority of his office here. He\\n\\t\\t\\t\\tclaims all \"servants of Allah\", i.e., true worshippers,\\n\\t\\t\\t\\tas under his protection, for his mission was both to the\\n\\t\\t\\t\\tEgyptians and the Israelites; he asks that they should be\\n\\t\\t\\t\\trestored to him; and he boldly denounces the Pharaoh's\\n\\t\\t\\t\\tarrogance \"as against Allah\"."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "18",
    "NoteID": "4703",
    "Body": "\"Worthy of all trust\": Amin, a title applied to prophets\\n\\t\\t\\t\\tin S. xxvi.:e.g., see xxvi. 107. As the holy Prophet had\\n\\t\\t\\t\\thistorically earned that title among his own people, the\\n\\t\\t\\t\\treminiscences of the story of Moses apply to him in his\\n\\t\\t\\t\\trelations with the arrogant Quraish."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "20",
    "NoteID": "4704",
    "Body": "It is no use their plotting his death or his\\n\\t\\t\\t\\tvilification; for his safety is in Allah. As he truly\\n\\t\\t\\t\\tsays, \"Allah is not only my Lord, but your Lord also;\\n\\t\\t\\t\\tyour responsibility arises apart from my preaching, but I\\n\\t\\t\\t\\tpreach in order to remind you of it.\""
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "20",
    "NoteID": "4705",
    "Body": "\"Injuring me\": literally \"stoning me\". \"Stoning\" may be\\n\\t\\t\\t\\there symbolical of any injury or vilification."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "21",
    "NoteID": "4706",
    "Body": "If you do not believe me, at least go your ways: do not\\n\\t\\t\\t\\tadd to your sins by trying to suppress me and the Message\\n\\t\\t\\t\\tof Truth which I bring: keep out of my way."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "22",
    "NoteID": "4707",
    "Body": "They would not even leave him alone to do his duty. So he\\n\\t\\t\\t\\tcried to Allah, not indeed to destroy them, for a Prophet\\n\\t\\t\\t\\tdoes not judge, but only Allah judges; he justified\\n\\t\\t\\t\\thimself in prayer, that he had done his best, but they\\n\\t\\t\\t\\twere obdurate in sin, and they were trying to oppress and\\n\\t\\t\\t\\tinjure the believers. Then came the order to march. They\\n\\t\\t\\t\\twere to march under the cover of night, because the enemy\\n\\t\\t\\t\\twas sure to pursue. They were to march with all\\n\\t\\t\\t\\tbelievers, presumably believing Egyptians (such as were\\n\\t\\t\\t\\tnot martyred) as well as Israelites, for some Egyptians\\n\\t\\t\\t\\thad believed: vii. 121."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "24",
    "NoteID": "4708",
    "Body": "For the passage of Moses and his following, the sea had\\n\\t\\t\\t\\tdivided: they were to pass through the gap or furrow and\\n\\t\\t\\t\\tleave it alone, to lure on the Egyptian host, on which\\n\\t\\t\\t\\tthe sea afterwards closed in, totally destroying them."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "25",
    "NoteID": "4709",
    "Body": "There follows a word-picture of all the fine and\\n\\t\\t\\t\\tenjoyable things which the ruling caste had monopolised.\\n\\t\\t\\t\\tNow these proud monopolists were drowned in the sea, and\\n\\t\\t\\t\\tthe inheritance went to other hands."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "29",
    "NoteID": "4710",
    "Body": "They died, \"unwept, unhonoured, and unsung\". They were\\n\\t\\t\\t\\ttoo inordinate to be given another chance. Pharaoh had\\n\\t\\t\\t\\tclaimed to be their supreme god; and they had followed\\n\\t\\t\\t\\thim!"
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "30",
    "NoteID": "4711",
    "Body": "The Israelites were held in bondage prior to the Exodus.\\n\\t\\t\\t\\tTheir hard taskmaster placed every indignity on them, and\\n\\t\\t\\t\\tby Pharaoh's decree their male children were to be\\n\\t\\t\\t\\tkilled, and their females were to be kept alive for the\\n\\t\\t\\t\\tEgyptians."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "32",
    "NoteID": "4712",
    "Body": "From degrading servitude, Israel was delivered, and\\n\\t\\t\\t\\ttaken, in spite of many rebellions and backslidings on\\n\\t\\t\\t\\tthe way, to \"a land flowing with milk and honey\", where\\n\\t\\t\\t\\tlater they established the glorious kingdom of David and\\n\\t\\t\\t\\tSolomon. This was not merely fortuitous. In Allah's\\n\\t\\t\\t\\tdecree it was to be a link in furthering His Plan. But\\n\\t\\t\\t\\ttheir being chosen did not mean that they could do what\\n\\t\\t\\t\\tthey liked. In that sense there is no \"chosen race\"\\n\\t\\t\\t\\tbefore Allah. But Allah gives every race and every\\n\\t\\t\\t\\tindividual a chance, and when the race or individual\\n\\t\\t\\t\\tfails to live up to it, he or it must fall and give place\\n\\t\\t\\t\\tto others."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "33",
    "NoteID": "4713",
    "Body": "Among the \"Signs\" given to Israel were their own\\n\\t\\t\\t\\tRevelation under Moses, their prosperous land of Canaan,\\n\\t\\t\\t\\ttheir flourishing Kingdom under David and Solomon, their\\n\\t\\t\\t\\tprophets and teachers of Truth, and the advent of Jesus\\n\\t\\t\\t\\tto reclaim the lost ones among them. All these were\\n\\t\\t\\t\\ttrials. When they failed in the trials, they were left to\\n\\t\\t\\t\\twander desolate and suffer."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "34",
    "NoteID": "4714",
    "Body": "The cases of the Egyptians and the Israelites having been\\n\\t\\t\\t\\tcited as great nations which fell through inordinate\\n\\t\\t\\t\\tvanity and wrong-doing, the case is now pressed home\\n\\t\\t\\t\\tagainst the Quraish leaders in their arrogance to the\\n\\t\\t\\t\\tholy Prophet himself. They deny Revelation; they deny a\\n\\t\\t\\t\\tfuture life, as the Sadducees did among the Jews before\\n\\t\\t\\t\\tthem; they persecute the prophet of Allah, and those who\\n\\t\\t\\t\\tbelieve in him: and they mockingly demand that their\\n\\t\\t\\t\\tancestors should be brought back to life, if it is true\\n\\t\\t\\t\\tthat there is a future life. They are reminded that\\n\\t\\t\\t\\tbetter men than they lived in their own country of\\n\\t\\t\\t\\tArabia, men who had knowledge of Allah's revelation under\\n\\t\\t\\t\\tthe earliest Dispensation. See next note. They perished\\n\\t\\t\\t\\tbecause of their unbelief and wrong-doing. What chance\\n\\t\\t\\t\\thave they unless they turn and repent?"
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "37",
    "NoteID": "4715",
    "Body": "Tubba' is understood to be a title or family name of\\n\\t\\t\\t\\tHimyuar kings in Yaman, of the tribe of Hamdan. The\\n\\t\\t\\t\\tHimyar were an ancient race. At one time they seem to\\n\\t\\t\\t\\thave extended their hegemony over all Arabia and perhaps\\n\\t\\t\\t\\tbeyond, to the East African Coast. Their earliest\\n\\t\\t\\t\\treligion seems to have been Sabianism, or the worship of\\n\\t\\t\\t\\tthe heavenly bodies. They seem at different times, later\\n\\t\\t\\t\\ton, to have professed the Jewish and the Christian\\n\\t\\t\\t\\treligion. Among the Embassies sent by the holy Prophet in\\n\\t\\t\\t\\tA.H. 9-10 was one to the Himyar of Yaman, which led to\\n\\t\\t\\t\\ttheir coming into Islam. This was of course much later\\n\\t\\t\\t\\tthan the date of this Sura."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "37",
    "NoteID": "4716",
    "Body": "In prehistoric times the Himyar and Yaman seem to have\\n\\t\\t\\t\\tplayed a large part in Arabia and even beyond: see last\\n\\t\\t\\t\\tnote. But when they were intoxicated with power, they\\n\\t\\t\\t\\tfell into sin, and gradually they ceased to count, not\\n\\t\\t\\t\\tonly in Arabia but even in Yaman."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "38",
    "NoteID": "4717",
    "Body": "Cf. xxi. 16, and n. 2676. All creation is for a wise and\\n\\t\\t\\t\\tjust purpose. But men usually do not realise or\\n\\t\\t\\t\\tunderstand it, because they are steeped in their own\\n\\t\\t\\t\\tignorance, folly, or passions."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "40",
    "NoteID": "4718",
    "Body": "Day of Sorting Out, or the Day of Decision. Cf. xxxvii.\\n\\t\\t\\t\\t21, and n. 4047. Ignorance, prejudice, passion, spite,\\n\\t\\t\\t\\tand selfishness, seem sometimes to flourish in this\\n\\t\\t\\t\\tprobationary life. In any case they are mixed up with\\n\\t\\t\\t\\tknowledge, justice, commonsense, love and regard for\\n\\t\\t\\t\\tothers. But the good and the evil will be sorted out and\\n\\t\\t\\t\\tseparated at the Day of Judgment. There is a time\\n\\t\\t\\t\\tappointed for it. In Allah's good time all will come\\n\\t\\t\\t\\tright."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "41",
    "NoteID": "4719",
    "Body": "When that Day comes, the strictest justice will prevail.\\n\\t\\t\\t\\tNo man, however prominently he may have walked on the\\n\\t\\t\\t\\tworld's stage, can help another. He himself will need\\n\\t\\t\\t\\thelp, not the sort of log-rolling help which high and low\\n\\t\\t\\t\\trender to each other in this life, but which in the\\n\\t\\t\\t\\tconditions of reality will be of no avail. The only\\n\\t\\t\\t\\tthings which will help will be the Mercy of Allah."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "42",
    "NoteID": "4720",
    "Body": "Allah's Mercy will be the only thing of any efficacy, for\\n\\t\\t\\t\\tHe is both able to help (\"Exalted in Might\") and willing\\n\\t\\t\\t\\tto forgive (\"Most Merciful\")."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "43",
    "NoteID": "4721",
    "Body": "Now follows a word-picture of the horrors to which Evil\\n\\t\\t\\t\\tmust lead us. What human language and what figures of\\n\\t\\t\\t\\tspeech can adequately describe them?"
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "43",
    "NoteID": "4722",
    "Body": "The opposite of \"delicious Fruits\" is the terrible tree\\n\\t\\t\\t\\tof Zaqqam, which is further described in xxxvii. 62-68,\\n\\t\\t\\t\\twhere see n. 4073. Also see xvii. 60, n. 2250."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "49",
    "NoteID": "4723",
    "Body": "In this particular Sura the besetting sin we are\\n\\t\\t\\t\\tconsidering is the arrogance born of place or power,\\n\\t\\t\\t\\twealth or honour, as understood in this world. The\\n\\t\\t\\t\\tpunishment of ignominy looks back to the kind of sin\\n\\t\\t\\t\\twhich is to be punished."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "50",
    "NoteID": "4724",
    "Body": "When the Punishment becomes a realised fact, how foolish\\n\\t\\t\\t\\twill those look who doubted whether there would be a\\n\\t\\t\\t\\tHereafter?"
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "51",
    "NoteID": "4725",
    "Body": "There will be no uncertainty, as on this earth; no danger\\n\\t\\t\\t\\tof discontinuance: no possibility of their satisfaction\\n\\t\\t\\t\\tbeing terminated."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "53",
    "NoteID": "4726",
    "Body": "Cf. xvifi: 31, and n. 2373."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "53",
    "NoteID": "4727",
    "Body": "Everything will be open and in social companionship: for\\n\\t\\t\\t\\tall the petty feelings of jealousy or exclusiveness will\\n\\t\\t\\t\\thave passed away."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "54",
    "NoteID": "4728",
    "Body": "The Maidens, like the scene, the dress, the outlook, and\\n\\t\\t\\t\\tthe fruit, will be beautiful. There will be life, but\\n\\t\\t\\t\\tfree from all earthly grossness. The women as well as the\\n\\t\\t\\t\\tmen of this life will attain to this indescribable bliss."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "54",
    "NoteID": "4729",
    "Body": "Hur implies the following ideas: (1) purity, (2) beauty,\\n\\t\\t\\t\\tespecially of eyes, where the intense white of the\\n\\t\\t\\t\\teye-balls stands out against the intense black of the\\n\\t\\t\\t\\tpupil, thus giving the appearance of lustre, and intense\\n\\t\\t\\t\\tfeeling, as opposed to dullness or want of expression;\\n\\t\\t\\t\\tand (3) truth and goodwill."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "55",
    "NoteID": "4730",
    "Body": "The signification is explained in n. 4671 to xliii. 73."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "56",
    "NoteID": "4731",
    "Body": "First Death: the ordinary natural death from this life,\\n\\t\\t\\t\\twhich brought them to the Garden of Felicity: there will\\n\\t\\t\\t\\tbe no further death after that. Cf. xxxvii. 59, and n.\\n\\t\\t\\t\\t4071."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "56",
    "NoteID": "4732",
    "Body": "In Islam we are taught that salvation is not possible by\\n\\t\\t\\t\\tour unaided efforts. Certainly, striving on our part is\\n\\t\\t\\t\\tan indispensable condition: but it is the Mercy of Allah\\n\\t\\t\\t\\twhich comes to our help and keeps us from the Fire of\\n\\t\\t\\t\\tfinal Punishment. This is mentioned last as the\\n\\t\\t\\t\\tfoundation on which is built our etemal felicity and our\\n\\t\\t\\t\\tpositive spiritual joys."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "57",
    "NoteID": "4733",
    "Body": "This is our idea of Salvation; the negative avoidance of\\n\\t\\t\\t\\tall the consequences of evil, and the positive attainment\\n\\t\\t\\t\\tof all-and more than all-that our hearts could possibly\\n\\t\\t\\t\\tdesire. For Allah's Bounty outstrips anything that our\\n\\t\\t\\t\\teyes have seen, or our ears have heard of, or our\\n\\t\\t\\t\\timagination can conceive."
  },
  {
    "SurahNumber": "44",
    "AyahNumber": "58",
    "NoteID": "4734",
    "Body": "Easy: not only to understand, being in the Arabic tongue;\\n\\t\\t\\t\\tbut mellifluous, whose rhythm carries off our spirits to\\n\\t\\t\\t\\ta higher spiritual plane. In another sense, it is\\n\\t\\t\\t\\tdifficult; for to get to its deepest meaning, we shall\\n\\t\\t\\t\\thave to strive hard, as the contents of this Sura alone\\n\\t\\t\\t\\twill show."
  }
]
