[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "42",
        "bookName": "Book of Dreams",
        "bookNameArabic": "كتاب الرؤيا",
        "hadiths": [
            {
                "hadithNo": "5897",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Abu Hurairah said: “I used to see dreams that made me tremble, but I did not cover myself with a blanket, until I met Abu Qatadah and told him about that. He said: ‘I heard the Messenger of Allah (s.a.w) say: “Good dreams come from Allah and bad dreams come from the Shaitan. If one of you see a dream that he dislikes, let him spot lightly to his left three times, and seek refuge with Allah from its evil, them it will never harm him.”",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ ، وَابْنُ أَبِي عُمَرَ ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ ، وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ ، حَدَّثَنَا سُفْيَانُ ، عَنِ الزُّهْرِيِّ ، عَنْ أَبِي سَلَمَةَ ، قَالَ : كُنْتُ أَرَى الرُّؤْيَا أُعْرَى مِنْهَا ، غَيْرَ أَنِّي لاَ أُزَمَّلُ ، حَتَّى لَقِيتُ أَبَا قَتَادَةَ فَذَكَرْتُ ذَلِكَ لَهُ ، فَقَالَ : سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : الرُّؤْيَا مِنَ اللهِ ، وَالْحُلْمُ مِنَ الشَّيْطَانِ ، فَإِذَا حَلَمَ أَحَدُكُمْ حُلْمًا يَكْرَهُهُ فَلْيَنْفُثْ عَنْ يَسَارِهِ ثَلاَثًا ، وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا ، فَإِنَّهَا لَنْ تَضُرَّهُ."
            },
            {
                "hadithNo": "5898",
                "chapterNo": "0",
                "hadithEnglish": "A similar report (as no. 5897) was narrated from Abu Qatadah, from the Prophet (s.a.w), but they did not mention in their Hadith the words of Abu Salamah: “I used to see dreams that made me tremble, but I did not cover myself with a blanket.”",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ ، حَدَّثَنَا سُفْيَانُ ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ ، مَوْلَى آلِ طَلْحَةَ ، وَعَبْدِ رَبِّهِ ، وَيَحْيَى ، ابْنَيْ سَعِيدٍ ، وَمُحَمَّدِ بْنِ عَمْرِو بْنِ عَلْقَمَةَ ، عَنْ أَبِي سَلَمَةَ ، عَنْ أَبِي قَتَادَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ ، وَلَمْ يَذْكُرْ فِي حَدِيثِهِمْ قَوْلَ أَبِي سَلَمَةَ: كُنْتُ أَرَى الرُّؤْيَا أُعْرَى مِنْهَا ، غَيْرَ أَنِّي لاَ أُزَمَّلُ."
            },
            {
                "hadithNo": "5899",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Az-Zuhri with this chain of narrators (a Hadith similar to no. 5897), but it does not say in their Hadith: Which made me tremble. And in the Hadith of Yunus it adds: ‘Let him spit lightly to his left three times when he gets up.”",
                "hadithArabic": "وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى ، أَخْبَرَنَا ابْنُ وَهْبٍ ، أَخْبَرَنِي يُونُسُ (ح) وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، وَعَبْدُ بْنُ حُمَيْدٍ ، قَالاَ : أَخْبَرَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ كِلاَهُمَا ، عَنِ الزُّهْرِيِّ ، بِهَذَا الإِسْنَادِ ، وَلَيْسَ فِي حَدِيثِهِمَا أُعْرَى مِنْهَا. وَزَادَ فِي حَدِيثِ يُونُسَ فَلْيَبْصُقْ عَلَى يَسَارِهِ ، حِينَ يَهُبُّ مِنْ نَوْمِهِ ، ثَلاَثَ مَرَّاتٍ."
            },
            {
                "hadithNo": "5900",
                "chapterNo": "0",
                "hadithEnglish": "Abu Qatadah said: “I heard the Messenger of Allah (s.a.w) say: ‘Good dreams come from Allah and bad dreams come from Shaitan. If one of you sees something that he dislikes, let him spit lightly to his left three times, and seek refuge with Allah from its evil, then it will never harm him.”’ He said: “I used to see dreams that weight more heavily on me than a mountain, but since I heard this Hadith, I do not care about them.”",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ ، حَدَّثَنَا سُلَيْمَانُ ، يَعْنِي ابْنَ بِلاَلٍ ، عَنْ يَحْيَى بْنِ سَعِيدٍ ، قَالَ: سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ ، يَقُولُ: سَمِعْتُ أَبَا قَتَادَةَ ، يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : الرُّؤْيَا مِنَ اللهِ ، وَالْحُلْمُ مِنَ الشَّيْطَانِ ، فَإِذَا رَأَى أَحَدُكُمْ شَيْئًا يَكْرَهُهُ ، فَلْيَنْفُثْ عَنْ يَسَارِهِ ثَلاَثَ مَرَّاتٍ وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا ، فَإِنَّهَا لَنْ تَضُرَّهُ. فَقَالَ: إِنْ كُنْتُ لأَرَى الرُّؤْيَا أَثْقَلَ عَلَيَّ مِنْ جَبَلٍ ، فَمَا هُوَ إِلاَّ أَنْ سَمِعْتُ بِهَذَا الْحَدِيثِ ، فَمَا أُبَالِيهَا."
            },
            {
                "hadithNo": "5901",
                "chapterNo": "0",
                "hadithEnglish": "Abu Salamah said: “I used to see dreams… (a Hadith similar to no. 5897).” In the Hadith of Al-Laith and Ibn Numair, there is no mention of the words of Abu Salamah up to the end of the Hadith. Ibn Rumh added: “And let him turn over from the side on which he was sleeping.”",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ ، وَمُحَمَّدُ بْنُ رُمْحٍ ، عَنِ اللَّيْثِ بْنِ سَعْدٍ (ح) وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ (ح) وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَبْدُ اللهِ بْنُ نُمَيْرٍ , كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ ، بِهَذَا الإِسْنَادِ. وَفِي حَدِيثِ الثَّقَفِيِّ : قَالَ أَبُو سَلَمَةَ: فَإِنْ كُنْتُ لأَرَى الرُّؤْيَا.وَلَيْسَ فِي حَدِيثِ اللَّيْثِ ، وَابْنِ نُمَيْرٍ قَوْلُ أَبِي سَلَمَةَ إِلَى آخِرِ الْحَدِيثِ. وَزَادَ ابْنُ رُمْحٍ فِي رِوَايَةِ هَذَا الْحَدِيثِ: وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ."
            },
            {
                "hadithNo": "5902",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Abu Qatadah, that the Messenger of Allah (s.a.w) said: “Good dreams come from Allah and bad dreams come from the Shaitan. Whoever sees a dream that he dislikes, let hum spit lightly to his left and seek refuge with Allah from Shaitan, and it will not harm him; and he should not tell anyone about it. If he sees a good dream, let hum rejoice but he should not tell anyone except one whom he loves.”",
                "hadithArabic": "وَحَدَّثَنِي أَبُو الطَّاهِرِ ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ وَهْبٍ ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ ، عَنْ أَبِي قَتَادَةَ ، عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ : الرُّؤْيَا الصَّالِحَةُ مِنَ اللهِ ، وَالرُّؤْيَا السَّوْءُ مِنَ الشَّيْطَانِ ، فَمَنْ رَأَى رُؤْيَا فَكَرِهَ مِنْهَا شَيْئًا فَلْيَنْفُثْ عَنْ يَسَارِهِ ، وَلْيَتَعَوَّذْ بِاللَّهِ مِنَ الشَّيْطَانِ ، لاَ تَضُرُّهُ وَلاَ يُخْبِرْ بِهَا أَحَدًا ، فَإِنْ رَأَى رُؤْيَا حَسَنَةً ، فَلْيُبْشِرْ وَلاَ يُخْبِرْ إِلاَّ مَنْ يُحِبُّ."
            },
            {
                "hadithNo": "5903",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Abu Salamah said: “I used to see dreams that made me ill. Then I met Abu Qatadah and he said: ‘I used to see dreams that made me ill, until I heard the Messenger of Allah (s.a.w) say: “Good dreams come from Allah, so if one of you sees something that he likes, let hum not tell anyone of it but one whom he loves. If he sees something that he dislikes, let him spit lightly to his left three times, and seek refuge with Allah from the evil if the Shaitan and its evil, but let him not tell anyone about it, for it will not harm him.”’",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ ، وَأَحْمَدُ بْنُ عَبْدِ اللهِ بْنِ الْحَكَمِ ، قَالاَ : حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، حَدَّثَنَا شُعْبَةُ ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ ، عَنْ أَبِي سَلَمَةَ ، قَالَ : إِنْ كُنْتُ لأَرَى الرُّؤْيَا تُمْرِضُنِي ، قَالَ : فَلَقِيتُ أَبَا قَتَادَةَ ، فَقَالَ : وَأَنَا كُنْتُ لأَرَى الرُّؤْيَا فَتُمْرِضُنِي ، حَتَّى سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ : الرُّؤْيَا الصَّالِحَةُ مِنَ اللهِ ، فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ ، فَلاَ يُحَدِّثْ بِهَا إِلاَّ مَنْ يُحِبُّ ، وَإِنْ رَأَى مَا يَكْرَهُ فَلْيَتْفُلْ عَنْ يَسَارِهِ ثَلاَثًا وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّ الشَّيْطَانِ وَشَرِّهَا ، وَلاَ يُحَدِّثْ بِهَا أَحَدًا فَإِنَّهَا لَنْ تَضُرَّهُ."
            },
            {
                "hadithNo": "5904",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Jabir that the Messenger of Allah (s.a.w) said: “If one of you sees a dream that he dislikes, let him spit to his left three times and seek refuge with Allah from the Shaitan three times, and let hum turn over from the side on which he was sleeping.”",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا لَيْثٌ (ح) وَحَدَّثَنَا ابْنُ رُمْحٍ ، أَخْبَرَنَا اللَّيْثُ ، عَنْ أَبِي الزُّبَيْرِ ، عَنْ جَابِرٍ ، عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يَكْرَهُهَا ، فَلْيَبْصُقْ عَنْ يَسَارِهِ ثَلاَثًا وَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ ثَلاَثًا ، وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ."
            },
            {
                "hadithNo": "5905",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: “Towards the end of time, hardly any dream of a Muslim will be false. The ones who have truest dream will be those who are truest in speech. The dream of a Muslim is one of the forty-five parts of Prophet Hood. Dreams are of three types: A good dream which is glad tidings from Allah, a dream from the Shaitan which causes distress, and a dream that comes from what man is thinking of to himself. If one of you sees something that he dislikes, let him get up and offer Salat, and not tell people about it.” He said: “And I like fetters and I dislike yokes (in dreams); fetters represent steadfastness in religion.” (One of the narrators said) I do not know if this is part of the Hadith or the words of Ibn Sirin.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُسْلِمِ تَكْذِبُ ، وَأَصْدَقُكُمْ رُؤْيَا أَصْدَقُكُمْ حَدِيثًا ، وَرُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ خَمْسٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ ، وَالرُّؤْيَا ثَلاَثَةٌ : فَرُؤْيَا الصَّالِحَةِ بُشْرَى مِنَ اللهِ ، وَرُؤْيَا تَحْزِينٌ مِنَ الشَّيْطَانِ ، وَرُؤْيَا مِمَّا يُحَدِّثُ الْمَرْءُ نَفْسَهُ ، فَإِنْ رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُمْ فَلْيُصَلِّ ، وَلاَ يُحَدِّثْ بِهَا النَّاسَ قَالَ : وَأُحِبُّ الْقَيْدَ وَأَكْرَهُ الْغُلَّ وَالْقَيْدُ ثَبَاتٌ فِي الدِّينِ.\r\nفَلاَ أَدْرِي هُوَ فِي الْحَدِيثِ أَمْ قَالَهُ ابْنُ سِيرِينَ."
            },
            {
                "hadithNo": "5906",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Ayyub with this chain of narrators, and he said in the Hadith: “Abu Hurairah said: ‘I like fetters, and I dislike yokes (in dreams); fetters represent steadfastness in religion. And the Prophet (s.a.w) said: “The dream of a believer is one of the forty-six parts of Prophet Hood.”",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ ، عَنْ أَيُّوبَ ، بِهَذَا الإِسْنَادِ ، وَقَالَ فِي الْحَدِيثِ : قَالَ أَبُو هُرَيْرَةَ : فَيُعْجِبُنِي الْقَيْدُ ، وَأَكْرَهُ الْغُلَّ ، وَالْقَيْدُ ثَبَاتٌ فِي الدِّينِ . وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ."
            },
            {
                "hadithNo": "5907",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Abu Hurairah said: “Towards the end of time…” and he quoted the Hadith (As no. 5906), but he did not mention the Prophet (s.a.w).",
                "hadithArabic": "حَدَّثَنِي أَبُو الرَّبِيعِ ، حَدَّثَنَا حَمَّادٌ ، يَعْنِي ابْنَ زَيْدٍ ، حَدَّثَنَا أَيُّوبُ ، وَهِشَامٌ ، عَنْ مُحَمَّدٍ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ: إِذَا اقْتَرَبَ الزَّمَانُ وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فِيهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
            },
            {
                "hadithNo": "5908",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Abu Hurairah from the Prophet (s.a.w), and he mentioned in the Hadith the words: “And I dislike yokes,” until the end of the Hadith, but he did not mention (the word): “Dreams are one of the forty-six parts of Prophet Hood.”",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ ، حَدَّثَنَا أَبِي ، عَنْ قَتَادَةَ ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَأَدْرَجَ فِي الْحَدِيثِ قَوْلَهُ: وَأَكْرَهُ الْغُلَّ ، إِلَى تَمَامِ الْكَلاَمِ ، وَلَمْ يَذْكُرْ الرُّؤْيَا جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ."
            },
            {
                "hadithNo": "5909",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Anas bin Malik that ‘Ubadah bin As-Samit said: “The Messenger of Allah (s.a.w) said: ‘The dream of the believer is one of the forty-six parts of Prophet Hood.”",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، وَابْنُ بَشَّارٍ ، قَالاَ : حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ، وَأَبُو دَاوُدَ (ح) وحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ، كُلُّهُمْ عَنْ شُعْبَةَ (ح) وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ ، وَاللَّفْظُ لَهُ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا شُعْبَةُ ، عَنْ قَتَادَةَ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ."
            },
            {
                "hadithNo": "5910",
                "chapterNo": "0",
                "hadithEnglish": "A similar report (as no. 5909) was narrated from Anas bin Malik, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا شُعْبَةُ ، عَنْ ثَابِتٍ الْبُنَانِيِّ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ."
            },
            {
                "hadithNo": "5911",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Abu Hurairah said: “The Messenger of Allah (s.a.w) said: ‘The dream of a believer is one of the forty-six parts of Prophet Hood.”’",
                "hadithArabic": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ ، عَنِ الزُّهْرِيِّ ، عَنِ ابْنِ الْمُسَيَّبِ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: إِنَّ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ."
            },
            {
                "hadithNo": "5912",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Abu Hurairah said: “The Messenger of Allah (s.a.w) said: ‘The dream of a believer that he sees or that is shown to him.”’ In the Hadith of Ibn Mushir it says: “A good dream is one o the forty-six parts of Prophet Hood.”",
                "hadithArabic": "وَحَدَّثَنَا إِسْمَاعِيلُ بْنُ الْخَلِيلِ ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ ، عَنِ الأَعْمَشِ (ح) وَحَدَّثَنَا ابْنُ نُمَيْرٍ ، حَدَّثَنَا أَبِي ، حَدَّثَنَا الأَعْمَشُ ، عَنْ أَبِي صَالِحٍ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: رُؤْيَا الْمُسْلِمِ يَرَاهَا ، أَوْ تُرَى لَهُ. وَفِي حَدِيثِ ابْنِ مُسْهِرٍ الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ."
            },
            {
                "hadithNo": "5913",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: “The dream of a righteous man is one of the forty-six parts of Prophet Hood.”",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى ، أَخْبَرَنَا عَبْدُ اللهِ بْنُ يَحْيَى بْنِ أَبِي كَثِيرٍ ، قَالَ : سَمِعْتُ أَبِي ، يَقُولُ : حَدَّثَنَا أَبُو سَلَمَةَ ، عَنْ أَبِي هُرَيْرَةَ ، عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : رُؤْيَا الرَّجُلِ الصَّالِحِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ."
            },
            {
                "hadithNo": "5914",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Yahya bin Kathir with this chain of narrators.",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ ، حَدَّثَنَا عَلِيٌّ ، يَعْنِي ابْنَ الْمُبَارَكِ (ح) وَحَدَّثَنَا أَحْمَدُ بْنُ الْمُنْذِرِ ، حَدَّثَنَا عَبْدُ الصَّمَدِ ، حَدَّثَنَا حَرْبٌ ، يَعْنِي ابْنَ شَدَّادٍ كِلاَهُمَا ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ ، بِهَذَا الإِسْنَادِ."
            },
            {
                "hadithNo": "5915",
                "chapterNo": "0",
                "hadithEnglish": "A Hadith like that of ‘Abdullah bin Yahya bin Abi Kathir (no. 5913) from his father was narrated from Abu Hurairah, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، حَدَّثَنَا مَعْمَرٌ ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ ، عَنْ أَبِي هُرَيْرَةَ ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، ... بِمِثْلِ حَدِيثِ عَبْدِ اللهِ بْنِ يَحْيَى بْنِ أَبِي كَثِيرٍ ، عَنْ أَبِيهِ."
            },
            {
                "hadithNo": "5916",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Ibn ‘Umar said: “The Messenger of Allah (s.a.w) said: ‘Good dreams are one of seventy parts of Prophet Hood.”’",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا أَبُو أُسَامَةَ (ح) وَحَدَّثَنَا ابْنُ نُمَيْرٍ ، حَدَّثَنَا أَبِي قَالاَ : جَمِيعًا حَدَّثَنَا عُبَيْدُ اللهِ ، عَنْ نَافِعٍ ، عَنِ ابْنِ عُمَرَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ."
            },
            {
                "hadithNo": "5917",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from ‘Ubaidullah with this chain of narrators.",
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى ، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ ، قَالاَ : حَدَّثَنَا يَحْيَى ، عَنْ عُبَيْدِ اللهِ بِهَذَا الإِسْنَادِ."
            },
            {
                "hadithNo": "5918",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Nafi with this chain of narrators (a Hadith similar to no.5916). in the Hadith of Al-Laith it says: Nafi’ said: “I think that Ibn ‘Umar said: ‘One of the seventy parts of Prophet Hood.”’",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ ، وَابْنُ رُمْحٍ ، عَنِ اللَّيْثِ بْنِ سَعْدٍ (ح) وَحَدَّثَنَا ابْنُ رَافِعٍ ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ ، أَخْبَرَنَا الضَّحَّاكُ ، يَعْنِي ابْنَ عُثْمَانَ كِلاَهُمَا ، عَنْ نَافِعٍ بِهَذَا الإِسْنَادِ. وَفِي حَدِيثِ اللَّيْثِ ، قَالَ نَافِعٌ : حَسِبْتُ أَنَّ ابْنَ عُمَرَ قَالَ : جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ."
            },
            {
                "hadithNo": "5919",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Abu Hurairah said: “The Messenger of Allah (s.a.w) said: ‘Whoever sees me in a dream has indeed seen me, for Shaitan cannot resemble me.”’",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ ، حَدَّثَنَا حَمَّادٌ ، يَعْنِي ابْنَ زَيْدٍ ، حَدَّثَنَا أَيُّوبُ ، وَهِشَامٌ ، عَنْ مُحَمَّدٍ ، عَنْ أَبِي هُرَيْرَةَ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي ، فَإِنَّ الشَّيْطَانَ لاَ يَتَمَثَّلُ بِي."
            },
            {
                "hadithNo": "5920",
                "chapterNo": "1",
                "hadithEnglish": "Abu Hurairah said: “I heard the Messenger of Allah (s.a.w) say: ‘Whoever sees me in a dream will see me when he is awake, or it is as if he saw me when he was awake, for the Shaitan cannot resemble me.”’",
                "hadithArabic": "وحَدَّثَنِي أَبُو الطَّاهِرِ ، وَحَرْمَلَةُ ، قَا لاَ: أَخْبَرَنَا ابْنُ وَهْبٍ ، أَخْبَرَنِي يُونُسُ ، عَنِ ابْنِ شِهَابٍ ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ ، أَنَّ أَبَا هُرَيْرَةَ ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ ، أَوْ لَكَأَنَّمَا رَآنِي فِي الْيَقَظَةِ ، لاَ يَتَمَثَّلُ الشَّيْطَانُ بِي."
            },
            {
                "hadithNo": "5921",
                "chapterNo": "1",
                "hadithEnglish": "Abu Qatadah said: “The Messenger of Allah (s.a.w) said: ‘Whoever sees me has seen the truth.”’",
                "hadithArabic": "وَقَالَ : فَقَالَ أَبُو سَلَمَةَ: قَالَ أَبُو قَتَادَةَ : قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ."
            },
            {
                "hadithNo": "5922",
                "chapterNo": "1",
                "hadithEnglish": "The nephew of Az-Zuhri narrated: “My paternal uncle told me…” and he mentioned the two Ahadith with their chain of narrators, like the Hadith of Yunus (no. 5920).",
                "hadithArabic": "وحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ ، حَدَّثَنَا ابْنُ أَخِي الزُّهْرِيِّ ، حَدَّثَنَا عَمِّي ، فَذَكَرَ الْحَدِيثَيْنِ جَمِيعًا بِإِسْنَادَيْهِمَا ، سَوَاءً مِثْلَ حَدِيثِ يُونُسَ."
            },
            {
                "hadithNo": "5923",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Jabir that the Messenger of Allah (s.a.w) said: “Whoever sees me in a dream has indeed seen me, for the Shaitan cannot appear in my form.” And he said: “If one of you has a bad dream, let him not tell anyone of how the Shaitan toyed with him in his sleep.”",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا لَيْثٌ (ح) وَحَدَّثَنَا ابْنُ رُمْحٍ ، أَخْبَرَنَا اللَّيْثُ ، عَنْ أَبِي الزُّبَيْرِ ، عَنْ جَابِرٍ ، أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: مَنْ رَآنِي فِي النَّوْمِ فَقَدْ رَآنِي ، إِنَّهُ لاَ يَنْبَغِي لِلشَّيْطَانِ أَنْ يَتَمَثَّلَ فِي صُورَتِي. وَقَالَ: إِذَا حَلَمَ أَحَدُكُمْ فَلاَ يُخْبِرْ أَحَدًا بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي الْمَنَامِ."
            },
            {
                "hadithNo": "5924",
                "chapterNo": "1",
                "hadithEnglish": "Jabir bin ‘Abdullah narrated that the  Messenger of Allah said: “Whoever sees me in a dream has indeed seen me, for the Shaitan cannot resemble me.”",
                "hadithArabic": "وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ ، حَدَّثَنَا رَوْحٌ ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ ، حَدَّثَنِي أَبُو الزُّبَيْرِ ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللهِ ، يَقُولُ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَنْ رَآنِي فِي النَّوْمِ فَقَدْ رَآنِي ، فَإِنَّهُ لاَ يَنْبَغِي لِلشَّيْطَانِ أَنْ يَتَشَبَّهَ بِي."
            },
            {
                "hadithNo": "5925",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Jabir that a Bedouin came to the Messenger of Allah (s.a.w) and said: “I dream that my head was cut off and I was chasing it. The Prophet (s.a.w) rebuked him and said: ‘Do not speak of how the Shaitan toyed with you in your sleep.”’",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ ، حَدَّثَنَا لَيْثٌ (ح) وَحَدَّثَنَا ابْنُ رُمْحٍ ، أَخْبَرَنَا اللَّيْثُ ، عَنْ أَبِي الزُّبَيْرِ ، عَنْ جَابِرٍ ، عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لأَعْرَابِيٍّ جَاءَهُ فَقَالَ: إِنِّي حَلَمْتُ أَنَّ رَأْسِي قُطِعَ فَأَنَا أَتَّبِعُهُ ، فَزَجَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَقَالَ: لاَ تُخْبِرْ بِتَلَعُّبِ الشَّيْطَانِ بِكَ فِي الْمَنَامِ."
            },
            {
                "hadithNo": "5926",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Jabir said: “A Bedouin came to the Prophet (s.a.w) and said: ‘O Messenger of Allah, I saw in a dream as if my head was cut off and it rolled away and I was chasing it.’ The Messenger of Allah (s.a.w) said to the Bedouin: ‘Do not tell people of how the Shaitan toyed with you in your sleep.”’ He said: “I heard the Prophet (s.a.w) after that, delivering a Khutbah and saying: ‘None of you should speak of how the Shaitan toyed with him in his sleep.”’",
                "hadithArabic": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا جَرِيرٌ ، عَنِ الأَعْمَشِ ، عَنْ أَبِي سُفْيَانَ ، عَنْ جَابِرٍ ، قَالَ : جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ : يَا رَسُولَ اللهِ ، رَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَأْسِي ضُرِبَ فَتَدَحْرَجَ فَاشْتَدَدْتُ عَلَى أَثَرِهِ ، فَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلأَعْرَابِيِّ : لاَ تُحَدِّثِ النَّاسَ بِتَلَعُّبِ الشَّيْطَانِ بِكَ فِي مَنَامِكَ وَقَالَ : سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدُ ، يَخْطُبُ فَقَالَ : لاَ يُحَدِّثَنَّ أَحَدُكُمْ بِتَلَعُّبِ الشَّيْطَانِ بِهِ فِي مَنَامِهِ."
            },
            {
                "hadithNo": "5927",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Jabir said: “A Bedouin came to the Prophet (s.a.w) and said: ‘O Messenger of Allah, I saw in a dream as if my head was cut off.’ The Prophet (s.a.w) smiled and said: ‘If the Shaitan toys with one of you in his sleep, he should not tell the people about it.”’ According to the report of Abu Bakr (Ibn Abi Shaibah): “If one of you is toyed with,” and he did not mention the Shaitan.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، وَأَبُو سَعِيدٍ الأَشَجُّ ، قَالاَ : حَدَّثَنَا وَكِيعٌ ، عَنِ الأَعْمَشِ ، عَنْ أَبِي سُفْيَانَ ، عَنْ جَابِرٍ ، قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللهِ ، رَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَأْسِي قُطِعَ ، قَالَ: فَضَحِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَقَالَ: إِذَا لَعِبَ الشَّيْطَانُ بِأَحَدِكُمْ فِي مَنَامِهِ ، فَلاَ يُحَدِّثْ بِهِ النَّاسَ.وَفِي رِوَايَةِ أَبِي بَكْرٍ إِذَا لُعِبَ بِأَحَدِكُمْ وَلَمْ يَذْكُرِ الشَّيْطَانَ."
            },
            {
                "hadithNo": "5928",
                "chapterNo": "3",
                "hadithEnglish": "Ibn ‘Abbas used to narrate that a man came to the Messenger of Allah (s.a.w) and said: “O Messenger of Allah, last night I saw in a dream a canopy dripping with ghee and honey, and I saw people collecting it in the palms of their hands, some getting more and some getting less. And I saw a rope connecting heaven and earth. I saw you take hold of it and ascend, then another man took hold of it after you and ascended, then another man took hold of it and ascended, then another man took hold of it but it broke, then it was reconnected and he ascended.” Abu Bakr said: “O Messenger of Allah, may my father be sacrificed for you, by Allah. Let me interpret it.” The Messenger of Allah (s.a.w) said: “Interpret it.” Abu Bakr said: “As for the canopy, it is the canopy if Islam. As for the ghee and honey dripping from it, that is the Qur’an, its sweetness and softness. As for that which the people collected of it, it is the one who learns a great deal of Qur’an and the one who learns a little. As for the rope connecting heaven and earth, it is the Truth that you brought, you adhere to it and Allah raises you thereby. Then another man takes hold of it after you and is raised thereby, then another man takes hold of it and is raised thereby, then another man takes hold of it, then it breaks and it reconnected, and he is raised thereby. Tell me, O Messenger of Allah, may my father and mother be sacrificed for you, am I right or wrong?” The Messenger of Allah (s.a.w) said: “You got some of it right and some of it wrong.” He said: “By Allah, O Messenger of Allah, I adjure you to tell me what I got wrong.” He said: “Do not swear.”",
                "hadithArabic": "حَدَّثَنَا حَاجِبُ بْنُ الْوَلِيدِ ، حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ ، عَنِ الزُّبَيْدِيِّ ، أَخْبَرَنِي الزُّهْرِيُّ ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ ، أَنَّ ابْنَ عَبَّاسٍ ، أَوْ أَبَا هُرَيْرَةَ كَانَ يُحَدِّثُ أَنَّ رَجُلاً أَتَى رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (ح) وحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ ، وَاللَّفْظُ لَهُ ، أَخْبَرَنَا ابْنُ وَهْبٍ ، أَخْبَرَنِي يُونُسُ ، عَنِ ابْنِ شِهَابٍ أَنَّ عُبَيْدَ اللهِ بْنَ عَبْدِ اللهِ بْنِ عُتْبَةَ أَخْبَرَهُ ، أَنَّ ابْنَ عَبَّاسٍ كَانَ يُحَدِّثُ ، أَنَّ رَجُلاً أَتَى رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ : يَا رَسُولَ اللهِ ، إِنِّي أَرَى اللَّيْلَةَ فِي الْمَنَامِ ظُلَّةً تَنْطِفُ السَّمْنَ وَالْعَسَلَ ، فَأَرَى النَّاسَ يَتَكَفَّفُونَ مِنْهَا بِأَيْدِيهِمْ ، فَالْمُسْتَكْثِرُ وَالْمُسْتَقِلُّ ، وَأَرَى سَبَبًا وَاصِلاً ، مِنَ السَّمَاءِ إِلَى الأَرْضِ ، فَأَرَاكَ أَخَذْتَ بِهِ فَعَلَوْتَ ، ثُمَّ أَخَذَ بِهِ رَجُلٌ مِنْ بَعْدِكَ فَعَلاَ ، ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَعَلاَ ، ثُمَّ أَخَذَ بِهِ رَجُلٌ آخَرُ فَانْقَطَعَ بِهِ ، ثُمَّ وُصِلَ لَهُ فَعَلاَ.\r\nقَالَ أَبُو بَكْرٍ : يَا رَسُولَ اللهِ ، بِأَبِي أَنْتَ ، وَاللَّهِ لَتَدَعَنِّي فَلأَعْبُرَنَّهَا ، قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : اعْبُرْهَا قَالَ أَبُو بَكْرٍ : أَمَّا الظُّلَّةُ فَظُلَّةُ الإِسْلاَمِ ، وَأَمَّا الَّذِي يَنْطِفُ مِنَ السَّمْنِ وَالْعَسَلِ فَالْقُرْآنُ حَلاَوَتُهُ وَلِينُهُ ، وَأَمَّا مَا يَتَكَفَّفُ النَّاسُ مِنْ ذَلِكَ فَالْمُسْتَكْثِرُ مِنَ الْقُرْآنِ وَالْمُسْتَقِلُّ ، وَأَمَّا السَّبَبُ الْوَاصِلُ مِنَ السَّمَاءِ إِلَى الأَرْضِ فَالْحَقُّ الَّذِي أَنْتَ عَلَيْهِ ، تَأْخُذُ بِهِ فَيُعْلِيكَ اللَّهُ بِهِ ، ثُمَّ يَأْخُذُ بِهِ رَجُلٌ مِنْ بَعْدِكَ فَيَعْلُو بِهِ ، ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَعْلُو بِهِ ، ثُمَّ يَأْخُذُ بِهِ رَجُلٌ آخَرُ فَيَنْقَطِعُ بِهِ ثُمَّ يُوصَلُ لَهُ فَيَعْلُو بِهِ ، فَأَخْبِرْنِي يَا رَسُولَ اللهِ ، بِأَبِي أَنْتَ ، أَصَبْتُ أَمْ أَخْطَأْتُ ؟ قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : أَصَبْتَ بَعْضًا وَأَخْطَأْتَ بَعْضًا قَالَ : فَوَاللَّهِ يَا رَسُولَ اللهِ ، لَتُحَدِّثَنِّي مَا الَّذِي أَخْطَأْتُ ؟ قَالَ لاَ تُقْسِمْ."
            },
            {
                "hadithNo": "5929",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Ibn ‘Abbas said: “A man came to the Prophet (s.a.w) when he returned to the Uhud and said: ‘O Messenger of Allah, last night I saw in a dream a canopy dripping with ghee and honey…”’ a Hadith like that of Yunus (no 5928).",
                "hadithArabic": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ ، حَدَّثَنَا سُفْيَانُ ، عَنِ الزُّهْرِيِّ ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : جَاءَ رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنْصَرَفَهُ مِنْ أُحُدٍ ، فَقَالَ: يَا رَسُولَ اللهِ ، إِنِّي رَأَيْتُ هَذِهِ اللَّيْلَةَ فِي الْمَنَامِ ظُلَّةً تَنْطِفُ السَّمْنَ وَالْعَسَلَ ، بِمَعْنَى حَدِيثِ يُونُسَ."
            },
            {
                "hadithNo": "5930",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Ibn ‘Abbas or Abu Hurairah said – Ma’mar (the sub narrator) sometimes said it was narrated from Ibn ‘Abbas and sometimes said it was narrated from Abu Hurairah – that a man came to the Messenger of Allah (s.a.w) and said: “Last night I saw a canopy…” a similar Hadith (as no. 5928).",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ ، عَنِ الزُّهْرِيِّ ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ ، عَنِ ابْنِ عَبَّاسٍ ، أَوْ أَبِي هُرَيْرَةَ قَالَ عَبْدُ الرَّزَّاقِ ، كَانَ مَعْمَرٌ ، أَحْيَانًا يَقُولُ: عَنِ ابْنِ عَبَّاسٍ وَأَحْيَانًا يَقُولُ: عَنْ أَبِي هُرَيْرَةَ ؛ أَنَّ رَجُلاً أَتَى رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: إِنِّي أَرَى اللَّيْلَةَ ظُلَّةً بِمَعْنَى حَدِيثِهِمْ."
            },
            {
                "hadithNo": "5931",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Ibn ‘Abbas that among the things that the Messenger of Allah (s.a.w) used to say to his Companions was: “Whoever among you has seen a dream, let him narrate it and I will interpret It for him.” A man came and said: “O Messenger of Allah, I saw a canopy…” a similar Hadith (as no. 5928).",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ ، حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ ، حَدَّثَنَا سُلَيْمَانُ ، وَهُوَ ابْنُ كَثِيرٍ ، عَنِ الزُّهْرِيِّ ، عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ ، عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ مِمَّا يَقُولُ لأَصْحَابِهِ مَنْ رَأَى مِنْكُمْ رُؤْيَا فَلْيَقُصَّهَا أَعْبُرْهَا لَهُ قَالَ فَجَاءَ رَجُلٌ فَقَالَ: يَا رَسُولَ اللهِ ، رَأَيْتُ ظُلَّةً . بِنَحْوِ حَدِيثِهِمْ."
            },
            {
                "hadithNo": "5932",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Anas bin Malik said: “The Messenger of Allah (s.a.w) said: ‘One night in a dream I saw myself in the house of ‘Uqbah bin Rafi’. We were brought some fresh Ibn Tab dates. I interpreted it as high status in this word and a good ending in the Hereafter, and that our religion is perfected.”’",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ، عَنْ ثَابِتٍ الْبُنَانِيِّ ، عَنْ أَنَسِ بْنِ مَالِكٍ ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: رَأَيْتُ ذَاتَ لَيْلَةٍ ، فِيمَا يَرَى النَّائِمُ ، كَأَنَّا فِي دَارِ عُقْبَةَ بْنِ رَافِعٍ ، فَأُتِينَا بِرُطَبٍ مِنْ رُطَبِ ابْنِ طَابٍ ، فَأَوَّلْتُ الرِّفْعَةَ لَنَا فِي الدُّنْيَا، وَالْعَاقِبَةَ فِي الآخِرَةِ ، وَأَنَّ دِينَنَا قَدْ طَابَ."
            },
            {
                "hadithNo": "5933",
                "chapterNo": "4",
                "hadithEnglish": "‘Abdullah bin ‘Umar narrated that the Messenger of Allah (s.a.w) said: “I saw myself in a dream using a Siwak, and two men competed to take it from me, one of whom was older than the other. The younger one got it from me, and it was said to me: ‘Give it to the older one.’ So I gave it to the older one.”",
                "hadithArabic": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ ، أَخْبَرَنِي أَبِي ، حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ ، عَنْ نَافِعٍ ، أَنَّ عَبْدَ اللهِ بْنَ عُمَرَ ، حَدَّثَهُ أَنَّ رَسُولَ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: أَرَانِي فِي الْمَنَامِ أَتَسَوَّكُ بِسِوَاكٍ ، فَجَذَبَنِي رَجُلاَنِ ، أَحَدُهُمَا أَ كْبَرُ مِنَ الآخَرِ ، فَنَاوَلْتُ السِّوَاكَ الأَصْغَرَ مِنْهُمَا ، فَقِيلَ لِي: كَبِّرْ ، فَدَفَعْتُهُ إِلَى الأَكْبَرِ."
            },
            {
                "hadithNo": "5934",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Musa that the Prophet (s.a.w) said: “In a dream I saw myself migrating from Makkah to a land in which there were dates palms. I thought that it would by Al-Yamamah or Hajar, but it turned out to be Al-Madinah, Yathrib. And in this dream of mine I saw myself brandishing a sword, the upper part of which was broken. That turned out to be what happened to the believers on the Day of Uhad. Then I brandished it again and it became better than it had before. That turned out be what Allah had brought about of the Conquest (of Makkah) and the unity of the believers. And I also saw some cows, and something that was good from Allah. The cows are the group of believers on the Day of Uhad, and the good is the good that Allah brought about after that, and the reward for sincerity that Allah gave us after that on the Day of Badr.”",
                "hadithArabic": "حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ اللهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ ، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ ، وَتَقَارَبَا فِي اللَّفْظِ ، قَالاَ : حَدَّثَنَا أَبُو أُسَامَةَ ، عَنْ بُرَيْدٍ ، عَنْ أَبِي بُرْدَةَ جَدِّهِ ، عَنْ أَبِي مُوسَى ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ ، فَذَهَبَ وَهْلِي إِلَى أَنَّهَا الْيَمَامَةُ ، أَوْ هَجَرُ ، فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ ، وَرَأَيْتُ فِي رُؤْيَايَ هَذِهِ أَنِّي هَزَزْتُ سَيْفًا ، فَانْقَطَعَ صَدْرُهُ ، فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ، ثُمَّ هَزَزْتُهُ أُخْرَى فَعَادَ أَحْسَنَ مَا كَانَ ، فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنَ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ ، وَرَأَيْتُ فِيهَا أَيْضًا بَقَرًا وَاللَّهُ خَيْرٌ ، فَإِذَا هُمُ النَّفَرُ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ، وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ بِهِ مِنَ الْخَيْرِ بَعْدُ ، وَثَوَابُ الصِّدْقِ الَّذِي آتَانَا اللَّهُ بَعْدَ يَوْمِ بَدْرٍ."
            },
            {
                "hadithNo": "5935",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Ibn ‘Abbas said: “The liar Musailimah came to Al-Madinah at the time of the Prophet (s.a.w) and started saying: ‘If Muhammad appoints me as his successor I will follow him.’ He came with a large number of his people, and was met by the Prophet (s.a.w) who had Thabit bin Qais bin Shammas with him, and in the Prophet’s hand was a piece of palm branch. He came and his companions, and said: ‘If you were to ask me for this piece of palm branch I would not give it to you. I will never transgress the Command of Allah with regard to you. If you turn away, Allah will destroy you. I think you are the one concerning whom I was shown something in a dream. This is Thabit; he will answer you on my behalf.’ Then he left.” Ibn ‘Abbas said: “I asked about the words of the Prophet (s.a.w): ‘I think you are the one concerning whom I was shown something in a dream.’ Abu Hurairah told me that the Prophet (s.a.w) said: “While I was sleeping I was two bangles of gold on my arms, and they troubled me. It was revealed to me in my dream that I should blow on them, so I did that, and they flew away. I interpreted them as referring to two liars who will emerge after I am gone. One of them is Al-‘Ansi, the man of San’a’, and the other is Musailimah, the man of Al-Yamamah.”’",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ ، حَدَّثَنَا أَبُو الْيَمَانِ ، أَخْبَرَنَا شُعَيْبٌ ، عَنْ عَبْدِ اللهِ بْنِ أَبِي حُسَيْنٍ ، حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ ، عَنِ ابْنِ عَبَّاسٍ ، قَالَ : قَدِمَ مُسَيْلِمَةُ الْكَذَّابُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ ، فَجَعَلَ يَقُولُ : إِنْ جَعَلَ لِي مُحَمَّدٌ الأَمْرَ مِنْ بَعْدِهِ تَبِعْتُهُ ، فَقَدِمَهَا فِي بَشَرٍ كَثِيرٍ مِنْ قَوْمِهِ ، فَأَقْبَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ ، وَفِي يَدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِطْعَةُ جَرِيدَةٍ ، حَتَّى وَقَفَ عَلَى مُسَيْلِمَةَ فِي أَصْحَابِهِ ، قَالَ : لَوْ سَأَلْتَنِي هَذِهِ الْقِطْعَةَ مَا أَعْطَيْتُكَهَا ، وَلَنْ أَتَعَدَّى أَمْرَ اللهِ فِيكَ ، وَلَئِنْ أَدْبَرْتَ لَيَعْقِرَنَّكَ اللَّهُ ، وَإِنِّي لأُرَاكَ الَّذِي أُرِيتُ فِيكَ مَا أُرِيتُ ، وَهَذَا ثَابِتٌ يُجِيبُكَ عَنِّي ثُمَّ انْصَرَفَ عَنْهُ.\r\nفَقَالَ ابْنُ عَبَّاسٍ : فَسَأَلْتُ عَنْ قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكَ أَرَى الَّذِي أُرِيتُ فِيكَ مَا أُرِيتُ فَأَخْبَرَنِي أَبُو هُرَيْرَةَ ، أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ : بَيْنَا أَنَا نَائِمٌ رَأَيْتُ فِي يَدَيَّ سِوَارَيْنِ مِنْ ذَهَبٍ ، فَأَهَمَّنِي شَأْنُهُمَا ، فَأُوحِيَ إِلَيَّ فِي الْمَنَامِ أَنِ انْفُخْهُمَا ، فَنَفَخْتُهُمَا فَطَارَا، فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ مِنْ بَعْدِي ، فَكَانَ أَحَدُهُمَا الْعَنْسِيَّ صَاحِبَ صَنْعَاءَ ، وَالآخَرُ مُسَيْلِمَةَ صَاحِبَ الْيَمَامَةِ."
            },
            {
                "hadithNo": "5936",
                "chapterNo": "4",
                "hadithEnglish": "Ma’mar narrated that Hammam bin Munabbih said: “This is what Abu Hurairah narrated to us from the Messenger of Allah (s.a.w).” He narrated a number of Ahadith, including the following: “While I was sleeping, the treasures of the earth were brought to me, and two bangles of gold were placed on my arms. They troubled me greatly, then it was revealed to me that I should blow on them, so I blew on them and they were gone. I interpreted them as being the two liars between whom I am: the man of San’a’ and the man of Al-Yamamah.”",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ ، أَخْبَرَنَا مَعْمَرٌ ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ ، قَالَ : هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ ، عَنْ رَسُولِ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَحَادِيثَ مِنْهَا ، وَقَالَ رَسُولُ اللهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : بَيْنَا أَنَا نَائِمٌ أُتِيتُ خَزَائِنَ الأَرْضِ , فَوَضَعَ فِي يَدَيَّ أُسْوَارَيْنِ مِنْ ذَهَبٍ ، فَكَبُرَا عَلَيَّ وَأَهَمَّانِي ، فَأُوحِيَ إِلَيَّ أَنِ انْفُخْهُمَا فَنَفَخْتُهُمَا فَذَهَبَا ، فَأَوَّلْتُهُمَا الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا : صَاحِبَ صَنْعَاءَ ، وَصَاحِبَ الْيَمَامَةِ."
            },
            {
                "hadithNo": "5937",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Samurah bin Jundab said: “When the Prophet (s.a.w) had prayed Subh, he would turn towards them (i.e., the people praying with him) and say: ‘Did any one of you see a dream last night?”’",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ ، حَدَّثَنَا أَبِي ، عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ ، قَالَ : كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى الصُّبْحَ أَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالَ : هَلْ رَأَى أَحَدٌ مِنْكُمُ الْبَارِحَةَ رُؤْيَا ؟."
            }
        ]
    }
]