[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "27",
        "bookName": "Book of Oaths",
        "bookNameArabic": "كتاب الأيمان",
        "hadiths": [
            {
                "hadithNo": "4254",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Salim bin 'Abdullah, that his father said: \"I heard 'Umar bin Al-Khattab say: 'The Messenger of Allah (s.a.w) said: \"Allah, may He be exalted, forbids you to swear by your fathers.\" 'Umar said: \"By Allah, I have not sworn by them since I heard the Messenger of Allah (s.a.w) forbid that, whether on my own behalf or narrating it from someone else.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ ح وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّ اللَّهَ عَزَّ وَجَلَّ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ». قَالَ عُمَرُ فَوَاللَّهِ مَا حَلَفْتُ بِهَا مُنْذُ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- نَهَى عَنْهَا ذَاكِرًا وَلاَ آثِرًا."
            },
            {
                "hadithNo": "4255",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 4254) was narrated from Az-Zuhri with this chain, except that in the Hadith of 'Uqail it says: \"I have not sworn by them since I heard the Messenger of Allah (s.a.w) forbidding it, and I have not spoken of it\" He did not say: \"Whether on my own behalf or narrating it from someone else.\"",
                "hadithArabic": "وَحَدَّثَنِى عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِى أَبِى عَنْ جَدِّى حَدَّثَنِى عُقَيْلُ بْنُ خَالِدٍ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كِلاَهُمَا عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ.\r\nمِثْلَهُ غَيْرَ أَنَّ فِى حَدِيثِ عُقَيْلٍ مَا حَلَفْتُ بِهَا مُنْذُ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَنْهَى عَنْهَا وَلاَ تَكَلَّمْتُ بِهَا. وَلَمْ يَقُلْ ذَاكِرًا وَلاَ آثِرًا."
            },
            {
                "hadithNo": "4256",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Salim that his father said: \"The Prophet (s.a.w) heard 'Umar swearing by his father...\" a report like that of Yunus and Ma'mar (no. 4254, 4255).",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِىِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ سَمِعَ النَّبِىُّ -صلى الله عليه وسلم- عُمَرَ وَهُوَ يَحْلِفُ بِأَبِيهِ. بِمِثْلِ رِوَايَةِ يُونُسَ وَمَعْمَرٍ."
            },
            {
                "hadithNo": "4257",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Abdullah that the Messenger of Allah (s.a.w) caught up with 'Umar bin Al-Khattab among a group of riders when 'Umar was swearing by his father, and the Messenger of Allah (s.a.w) told them not to do that and said: \"Allah forbids you to swear by your fathers. Whoever wants to swear, let him swear by Allah or else remain silent.\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- أَنَّهُ أَدْرَكَ عُمَرَ بْنَ الْخَطَّابِ فِى رَكْبٍ وَعُمَرُ يَحْلِفُ بِأَبِيهِ فَنَادَاهُمْ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَلاَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ فَمَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ أَوْ لِيَصْمُتْ »."
            },
            {
                "hadithNo": "4258",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 4257) was narrated from Ibn 'Umar from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ ح وَحَدَّثَنِى بِشْرُ بْنُ هِلاَلٍ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَيُّوبُ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنِ الْوَلِيدِ بْنِ كَثِيرٍ ح وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ ح وَحَدَّثَنَا ابْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِى فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ وَابْنُ أَبِى ذِئْبٍ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ رَافِعٍ عَنْ عَبْدِ الرَّزَّاقِ عَنِ ابْنِ جُرَيْجٍ أَخْبَرَنِى عَبْدُ الْكَرِيمِ. كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ بِمِثْلِ هَذِهِ الْقِصَّةِ عَنِ النَّبِىِّ -صلى الله عليه وسلم-."
            },
            {
                "hadithNo": "4259",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Abdullah bin Dinar that he heard Ibn 'Umar say: \"The Messenger of Allah (s.a.w) said: 'Whoever wants to swear, let him not swear by anything but Allah.' The Quraish used to swear by their fathers.\" But he said: \"Do not swear by your fathers.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ حَدَّثَنَا إِسْمَاعِيلُ - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّهُ سَمِعَ ابْنَ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ كَانَ حَالِفًا فَلاَ يَحْلِفْ إِلاَّ بِاللَّهِ ». وَكَانَتْ قُرَيْشٌ تَحْلِفُ بِآبَائِهَا فَقَالَ « لاَ تَحْلِفُوا بِآبَائِكُمْ »."
            },
            {
                "hadithNo": "4260",
                "chapterNo": "2",
                "hadithEnglish": "Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Whoever among you swears and says in his oath 'By al-Lat,' let him say La Ilaha Illallah. And whoever says to his companion: 'Come, I will gamble with you,' let him give charity.\"",
                "hadithArabic": "حَدَّثَنِى أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ ح وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ أَخْبَرَنِى حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ حَلَفَ مِنْكُمْ فَقَالَ فِى حَلِفِهِ بِاللاَّتِ. فَلْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ. وَمَنْ قَالَ لِصَاحِبِهِ تَعَالَ أُقَامِرْكَ. فَلْيَتَصَدَّقْ »."
            },
            {
                "hadithNo": "4261",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Az-Zuhri with this chain (a Hadith similar to no. 4260), and the Hadith of Ma'mar is like the Hadith of Yunus, except that he said: \"Let him give something in charity.\" In the Hadith of Al-Awza'i it says: \"Whoever swears by al-Lat and Al-'Uzza.\" Abu Al-Husain Muslim said: This phrase - meaning: \"Come, I will gamble with you\" - was not narrated by anyone except Az-Zuhri. Az-Zuhri had approximately ninety phrases which he narrated from the Prophet (s.a.w) and no one else narrated them with any reliable chain of narrators.",
                "hadithArabic": "وَحَدَّثَنِى سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنِ الأَوْزَاعِىِّ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كِلاَهُمَا عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ وَحَدِيثُ مَعْمَرٍ مِثْلُ حَدِيثِ يُونُسَ غَيْرَ أَنَّهُ قَالَ « فَلْيَتَصَدَّقْ بِشَىْءٍ ». وَفِى حَدِيثِ الأَوْزَاعِىِّ « مَنْ حَلَفَ بِاللاَّتِ وَالْعُزَّى ».\r\nقَالَ أَبُو الْحُسَيْنِ مُسْلِمٌ هَذَا الْحَرْفُ - يَعْنِى قَوْلَهُ تَعَالَ أُقَامِرْكَ. فَلْيَتَصَدَّقْ - لاَ يَرْوِيهِ أَحَدٌ غَيْرُ الزُّهْرِىِّ قَالَ وَلِلزُّهْرِىِّ نَحْوٌ مِنْ تِسْعِينَ حَدِيثًا يَرْوِيهِ عَنِ النَّبِىِّ -صلى الله عليه وسلم- لاَ يُشَارِكُهُ فِيهِ أَحَدٌ بِأَسَانِيدَ جِيَادٍ."
            },
            {
                "hadithNo": "4262",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that 'Abdur-Rahman bin Samurah said: \"The Messenger of Allah (s.a.w) said: 'Do not swear by false gods or by your fathers.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدُ الأَعْلَى عَنْ هِشَامٍ عَنِ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لاَ تَحْلِفُوا بِالطَّوَاغِى وَلاَ بِآبَائِكُمْ »."
            },
            {
                "hadithNo": "4263",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Musa Al-Asha'ri said: \"I came to the Prophet (s.a.w) among a group of the Asha'ris to ask him for mounts. He said: 'By Allah, I will not give you mounts, and I do not have anything to give you as mounts.' As much time as Allah willed passed, then some camels were brought, and he ordered that we be given three camels with white humps. When we set out we said\" - or \"we said to one another\" - 'Allah will not bless us. We came to the Messenger of Allah (s.a.w) to ask him for mounts and he swore that he would not give us mounts, then he gave us mounts.\"' So they went to him and told him, and he said: \"It was not me who gave you mounts, rather Allah gave you mounts. By Allah, if Allah wills, I do not swear an oath then see something better than that, but I expiate my oath and do that which is better.\"",
                "hadithArabic": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَيَحْيَى بْنُ حَبِيبٍ الْحَارِثِىُّ - وَاللَّفْظُ لِخَلَفٍ - قَالُوا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ غَيْلاَنَ بْنِ جَرِيرٍ عَنْ أَبِى بُرْدَةَ عَنْ أَبِى مُوسَى الأَشْعَرِىِّ قَالَ أَتَيْتُ النَّبِىَّ -صلى الله عليه وسلم- فِى رَهْطٍ مِنَ الأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ « وَاللَّهِ لاَ أَحْمِلُكُمْ وَمَا عِنْدِى مَا أَحْمِلُكُمْ عَلَيْهِ ». قَالَ فَلَبِثْنَا مَا شَاءَ اللَّهُ ثُمَّ أُتِىَ بِإِبِلٍ فَأَمَرَ لَنَا بِثَلاَثِ ذَوْدٍ غُرِّ الذُّرَى فَلَمَّا انْطَلَقْنَا قُلْنَا - أَوْ قَالَ بَعْضُنَا لِبَعْضٍ - لاَ يُبَارِكُ اللَّهُ لَنَا أَتَيْنَا رَسُولَ اللَّهِ -صلى الله عليه وسلم- نَسْتَحْمِلُهُ فَحَلَفَ أَنْ لاَ يَحْمِلَنَا ثُمَّ حَمَلَنَا. فَأَتَوْهُ فَأَخْبَرُوهُ فَقَالَ « مَا أَنَا حَمَلْتُكُمْ وَلَكِنَّ اللَّهَ حَمَلَكُمْ وَإِنِّى وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ ثُمَّ أَرَى خَيْرًا مِنْهَا إِلاَّ كَفَّرْتُ عَنْ يَمِينِى وَأَتَيْتُ الَّذِى هُوَ خَيْرٌ »."
            },
            {
                "hadithNo": "4264",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Musa said: \"My companions sent me to the Messenger of Allah (s.a.w) to ask him for mounts for them, because they were with him in the army of hardship - meaning, the campaign to Tabuk. I said: 'O Prophet of Allah, my companions have sent me to you, so that you might give them mounts.' He said: 'By Allah, I will not give you anything to ride.' It so happened that I came to him when he was angry and I did not realize it. So I went back saddened by the refusal of the Messenger of Allah (s.a.w), and I was worried that the Messenger of Allah (s.a.w) was upset with me. So I went back to my companions and told them what the Messenger of Allah (s.a.w) had said. Only a short time passed, then I heard Bilal calling: 'O 'Abdullah bin Qais!' So I answered him, and he said: 'Go to the Messenger of Allah (s.a.w), he is calling you.' When I came to the Messenger of Allah (s.a.w), he said: 'Take this pair and this pair and this pair' - six camels that he had bought from Sa'd at that time. 'Take them to your companions and say: \"Allah\" - or \"the Messenger of Allah ~ - has provided you with these mounts so ride them.\" Abu Milsa said: \"So I took them to my companions and I said: 'The Messenger of Allah (s.a.w) has given you these to ride, but by Allah I will not leave you until some of you come with me to one who heard what the Messenger of Allah (s.a.w) said, when I asked him (for mounts) for you and he refused at first, then he gave them to me after that. Do not think that I have told you anything that he did not say.' They said to me: 'By Allah, you are truthful in our opinion, but we will do what you wish.\"' So Abu Musa went with a group of them until they came to those who had heard what the Messenger of Allah (s.a.w) had said when he refused to respond to their request, then gave them something after that, and they told them the same as Abu Musa had told them.",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِىُّ وَمُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِىُّ - وَتَقَارَبَا فِى اللَّفْظِ - قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِى بُرْدَةَ عَنْ أَبِى مُوسَى قَالَ أَرْسَلَنِى أَصْحَابِى إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- أَسْأَلُهُ لَهُمُ الْحُمْلاَنَ إِذْ هُمْ مَعَهُ فِى جَيْشِ الْعُسْرَةِ - وَهِىَ غَزْوَةُ تَبُوكَ - فَقُلْتُ يَا نَبِىَّ اللَّهِ إِنَّ أَصْحَابِى أَرْسَلُونِى إِلَيْكَ لِتَحْمِلَهُمْ. فَقَالَ « وَاللَّهِ لاَ أَحْمِلُكُمْ عَلَى شَىْءٍ ». وَوَافَقْتُهُ وَهُوَ غَضْبَانُ وَلاَ أَشْعُرُ فَرَجَعْتُ حَزِينًا مِنْ مَنْعِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- وَمِنْ مَخَافَةِ أَنْ يَكُونَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- قَدْ وَجَدَ فِى نَفْسِهِ عَلَىَّ فَرَجَعْتُ إِلَى أَصْحَابِى فَأَخْبَرْتُهُمُ الَّذِى قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَلَمْ أَلْبَثْ إِلاَّ سُوَيْعَةً إِذْ سَمِعْتُ بِلاَلاً يُنَادِى أَىْ عَبْدَ اللَّهِ بْنَ قَيْسٍ. فَأَجَبْتُهُ فَقَالَ أَجِبْ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَدْعُوكَ. فَلَمَّا أَتَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « خُذْ هَذَيْنِ الْقَرِينَيْنِ وَهَذَيْنِ الْقَرِينَيْنِ وَهَذَيْنِ الْقَرِينَيْنِ - لِسِتَّةِ أَبْعِرَةٍ ابْتَاعَهُنَّ حِينَئِذٍ مِنْ سَعْدٍ - فَانْطَلِقْ بِهِنَّ إِلَى أَصْحَابِكَ فَقُلْ إِنَّ اللَّهَ - أَوْ قَالَ إِنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- - يَحْمِلُكُمْ عَلَى هَؤُلاَءِ فَارْكَبُوهُنَّ ». قَالَ أَبُو مُوسَى فَانْطَلَقْتُ إِلَى أَصْحَابِى بِهِنَّ فَقُلْتُ إِنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَحْمِلُكُمْ عَلَى هَؤُلاَءِ وَلَكِنْ وَاللَّهِ لاَ أَدَعُكُمْ حَتَّى يَنْطَلِقَ مَعِى بَعْضُكُمْ إِلَى مَنْ سَمِعَ مَقَالَةَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- حِينَ سَأَلْتُهُ لَكُمْ وَمَنْعَهُ فِى أَوَّلِ مَرَّةٍ ثُمَّ إِعْطَاءَهُ إِيَّاىَ بَعْدَ ذَلِكَ لاَ تَظُنُّوا أَنِّى حَدَّثْتُكُمْ شَيْئًا لَمْ يَقُلْهُ. فَقَالُوا لِى وَاللَّهِ إِنَّكَ عِنْدَنَا لَمُصَدَّقٌ وَلَنَفْعَلَنَّ مَا أَحْبَبْتَ. فَانْطَلَقَ أَبُو مُوسَى بِنَفَرٍ مِنْهُمْ حَتَّى أَتَوُا الَّذِينَ سَمِعُوا قَوْلَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- وَمَنْعَهُ إِيَّاهُمْ ثُمَّ إِعْطَاءَهُمْ بَعْدُ فَحَدَّثُوهُمْ بِمَا حَدَّثَهُمْ بِهِ أَبُو مُوسَى سَوَاءً."
            },
            {
                "hadithNo": "4265",
                "chapterNo": "3",
                "hadithEnglish": "Ayyub said: \"The Hadith of Al-Qasim is better known to me than the Hadith of Abu Qilabah. He said: 'We were with Abu Musa and he called for his food, and there was some chicken there. A man from Banu Taimullah came in who was of reddish complexion and looked like a freed slave. He said: \"Come and join me.\" The man hesitated, so he said: \"Come, for I saw the Messenger of Allah (s.a.w) eating this.\" The man said: \"I saw it eating something and I found it repugnant, and I swore that I would not eat it.\" He said: \"Come, I will tell you something about that (the oath).\" \"I came to the Messenger of Allah (s.a.w) with a group of Ash'aris to ask him for mounts, and he said: 'By Allah, I will not give you mounts, and I have nothing to give to you as mounts.' As much time passed as Allah willed, then some spoils of war consisting of camels, was brought to the Messenger of Allah (s.a.w). He called us, and ordered that we be given five of the camels with white humps. When we set out, we said to one another: 'We made the Messenger of Allah (s.a.w) forget his oath, and we will not be blessed.' So we went back to him and said: 'O Messenger of Allah, we came to you and asked you for mounts, and you swore that you would not give us mounts, then you gave us mounts. Did you forget, O Messenger of Allah?' He said: 'By Allah, if Allah wills, I do not swear an oath then see that something else is better than it, but I do that which is better and offer expiation. Go, for it is Allah Who has given you mounts.\"'",
                "hadithArabic": "حَدَّثَنِى أَبُو الرَّبِيعِ الْعَتَكِىُّ حَدَّثَنَا حَمَّادٌ - يَعْنِى ابْنَ زَيْدٍ - عَنْ أَيُّوبَ عَنْ أَبِى قِلاَبَةَ وَعَنِ الْقَاسِمِ بْنِ عَاصِمٍ عَنْ زَهْدَمٍ الْجَرْمِىِّ - قَالَ أَيُّوبُ وَأَنَا لِحَدِيثِ الْقَاسِمِ أَحْفَظُ مِنِّى لِحَدِيثِ أَبِى قِلاَبَةَ - قَالَ كُنَّا عِنْدَ أَبِى مُوسَى فَدَعَا بِمَائِدَتِهِ وَعَلَيْهَا لَحْمُ دَجَاجٍ فَدَخَلَ رَجُلٌ مِنْ بَنِى تَيْمِ اللَّهِ أَحْمَرُ شَبِيهٌ بِالْمَوَالِى فَقَالَ لَهُ هَلُمَّ. فَتَلَكَّأَ فَقَالَ هَلُمَّ فَإِنِّى قَدْ رَأَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَأْكُلُ مِنْهُ. فَقَالَ الرَّجُلُ إِنِّى رَأَيْتُهُ يَأْكُلُ شَيْئًا فَقَذِرْتُهُ فَحَلَفْتُ أَنْ لاَ أَطْعَمَهُ فَقَالَ هَلُمَّ أُحَدِّثْكَ عَنْ ذَلِكَ إِنِّى أَتَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- فِى رَهْطٍ مِنَ الأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ « وَاللَّهِ لاَ أَحْمِلُكُمْ وَمَا عِنْدِى مَا أَحْمِلُكُمْ عَلَيْهِ ». فَلَبِثْنَا مَا شَاءَ اللَّهُ فَأُتِىَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- بِنَهْبِ إِبِلٍ فَدَعَا بِنَا فَأَمَرَ لَنَا بِخَمْسِ ذَوْدٍ غُرِّ الذُّرَى قَالَ فَلَمَّا انْطَلَقْنَا قَالَ بَعْضُنَا لِبَعْضٍ أَغْفَلْنَا رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَمِينَهُ لاَ يُبَارَكُ لَنَا . فَرَجَعْنَا إِلَيْهِ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّا أَتَيْنَاكَ نَسْتَحْمِلُكَ وَإِنَّكَ حَلَفْتَ أَنْ لاَ تَحْمِلَنَا ثُمَّ حَمَلْتَنَا أَفَنَسِيتَ يَا رَسُولَ اللَّهِ قَالَ « إِنِّى وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلاَّ أَتَيْتُ الَّذِى هُوَ خَيْرٌ وَتَحَلَّلْتُهَا فَانْطَلِقُوا فَإِنَّمَا حَمَلَكُمُ اللَّهُ عَزَّ وَجَلَّ »."
            },
            {
                "hadithNo": "4266",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Zahdam Al-Jarmi said: \"There was love and brotherhood between this clan of J arm and the Ash'aris. We were with Abu Musa Al-Asha'ri, and some food containing chicken was brought to him...'' and he narrated something similar (as Hadith no. 4265).",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِىُّ عَنْ أَيُّوبَ عَنْ أَبِى قِلاَبَةَ وَالْقَاسِمِ التَّمِيمِىِّ عَنْ زَهْدَمٍ الْجَرْمِىِّ قَالَ كَانَ بَيْنَ هَذَا الْحَىِّ مِنْ جَرْمٍ وَبَيْنَ الأَشْعَرِيِّينَ وُدٌّ وَإِخَاءٌ فَكُنَّا عِنْدَ أَبِى مُوسَى الأَشْعَرِىِّ فَقُرِّبَ إِلَيْهِ طَعَامٌ فِيهِ لَحْمُ دَجَاجٍ. فَذَكَرَ نَحْوَهُ."
            },
            {
                "hadithNo": "4267",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Zahdam Al-Jarmi said: \"We were with Abu Musa...\" and they all narrated a Hadith like that of Hammad bin Zaid (no. 4265).",
                "hadithArabic": "وَحَدَّثَنِى عَلِىُّ بْنُ حُجْرٍ السَّعْدِىُّ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ نُمَيْرٍ عَنْ إِسْمَاعِيلَ ابْنِ عُلَيَّةَ عَنْ أَيُّوبَ عَنِ الْقَاسِمِ التَّمِيمِىِّ عَنْ زَهْدَمٍ الْجَرْمِىِّ ح وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ أَبِى قِلاَبَةَ عَنْ زَهْدَمٍ الْجَرْمِىِّ ح وَحَدَّثَنِى أَبُو بَكْرِ بْنُ إِسْحَاقَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ أَبِى قِلاَبَةَ وَالْقَاسِمِ عَنْ زَهْدَمٍ الْجَرْمِىِّ قَالَ كُنَّا عِنْدَ أَبِى مُوسَى. وَاقْتَصُّوا جَمِيعًا الْحَدِيثَ بِمَعْنَى حَدِيثِ حَمَّادِ بْنِ زَيْدٍ."
            },
            {
                "hadithNo": "4268",
                "chapterNo": "3",
                "hadithEnglish": "Zahdam Al-Jarmi said: \"I entered upon Abu Musa when he was eating chicken...\" and he quoted a Hadith like theirs (no. 4264, 4265), and he added: \"He (s.a.w) said: 'By Allah, I did not forget it.\"'",
                "hadithArabic": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا الصَّعْقُ - يَعْنِى ابْنَ حَزْنٍ - حَدَّثَنَا مَطَرٌ الْوَرَّاقُ حَدَّثَنَا زَهْدَمٌ الْجَرْمِىُّ قَالَ دَخَلْتُ عَلَى أَبِى مُوسَى وَهُوَ يَأْكُلُ لَحْمَ دَجَاجٍ وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِهِمْ وَزَادَ فِيهِ قَالَ « إِنِّى وَاللَّهِ مَا نَسِيتُهَا »."
            },
            {
                "hadithNo": "4269",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Musa Al-Asha'ri said: \"We came to the Messenger of Allah (s.a.w) to ask him for mounts, and he said: 'I do not have anything to give to you as mounts, and by Allah I will not give you mounts.' Then the Messenger of Allah (s.a.w) sent to us three camels with white humps. We said: 'We came to the Messenger of Allah (s.a.w) and asked him for mounts, and he swore that he would not give us mounts.' So we went back to him and told him, and he said: 'I do not swear an oath, then see that something else is better than it, but I do that which is better.'\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ سُلَيْمَانَ التَّيْمِىِّ عَنْ ضُرَيْبِ بْنِ نُقَيْرٍ الْقَيْسِىِّ عَنْ زَهْدَمٍ عَنْ أَبِى مُوسَى الأَشْعَرِىِّ قَالَ أَتَيْنَا رَسُولَ اللَّهِ -صلى الله عليه وسلم- نَسْتَحْمِلُهُ فَقَالَ « مَا عِنْدِى مَا أَحْمِلُكُمْ وَاللَّهِ مَا أَحْمِلُكُمْ ». ثُمَّ بَعَثَ إِلَيْنَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- بِثَلاَثَةِ ذَوْدٍ بُقْعِ الذُّرَى فَقُلْنَا إِنَّا أَتَيْنَا رَسُولَ اللَّهِ -صلى الله عليه وسلم- نَسْتَحْمِلُهُ فَحَلَفَ أَنْ لاَ يَحْمِلَنَا فَأَتَيْنَاهُ فَأَخْبَرْنَاهُ فَقَالَ « إِنِّى لاَ أَحْلِفُ عَلَى يَمِينٍ أَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلاَّ أَتَيْتُ الَّذِى هُوَ خَيْرٌ »."
            },
            {
                "hadithNo": "4270",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Musa said: \"We were on foot, then we came to the Prophet of Allah (s.a.w) and asked him for mounts...'' a Hadith like that of Jarir (no. 4269).",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى التَّيْمِىُّ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ حَدَّثَنَا أَبُو السَّلِيلِ عَنْ زَهْدَمٍ يُحَدِّثُهُ عَنْ أَبِى مُوسَى قَالَ كُنَّا مُشَاةً فَأَتَيْنَا نَبِىَّ اللَّهِ -صلى الله عليه وسلم- نَسْتَحْمِلُهُ. بِنَحْوِ حَدِيثِ جَرِيرٍ."
            },
            {
                "hadithNo": "4271",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"A man came to the Prophet (s.a.w) late at night, then he went back to his family and found that his children had gone to sleep. His wife brought him his food, but he swore that he would not eat because of his children, then he decided to eat. He came to the Messenger of Allah (s.a.w) and told him about that, and the Messenger of Allah (s.a.w) said: 'Whoever swears an oath then sees that something else is better than it, let him do that, and offer expiation for his oath.'\"",
                "hadithArabic": "حَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِىُّ أَخْبَرَنَا يَزِيدُ بْنُ كَيْسَانَ عَنْ أَبِى حَازِمٍ عَنْ أَبِى هُرَيْرَةَ قَالَ أَعْتَمَ رَجُلٌ عِنْدَ النَّبِىِّ -صلى الله عليه وسلم- ثُمَّ رَجَعَ إِلَى أَهْلِهِ فَوَجَدَ الصِّبْيَةَ قَدْ نَامُوا فَأَتَاهُ أَهْلُهُ بِطَعَامِهِ فَحَلَفَ لاَ يَأْكُلُ مِنْ أَجْلِ صِبْيَتِهِ ثُمَّ بَدَا لَهُ فَأَكَلَ فَأَتَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَذَكَرَ ذَلِكَ لَهُ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِهَا وَلْيُكَفِّرْ عَنْ يَمِينِهِ »."
            },
            {
                "hadithNo": "4272",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"Whoever swears an oath, then sees that something else is better than it, let him offer expiation for his oath and do it.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِى مَالِكٌ عَنْ سُهَيْلِ بْنِ أَبِى صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَفْعَلْ »."
            },
            {
                "hadithNo": "4273",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Whoever swears an oath, then sees that something else is better than it, let him do that which is better, and offer expiation for his oath.\"'",
                "hadithArabic": "وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا ابْنُ أَبِى أُوَيْسٍ حَدَّثَنِى عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ عَنْ سُهَيْلِ بْنِ أَبِى صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِى هُوَ خَيْرٌ وَلْيُكَفِّرْ عَنْ يَمِينِهِ »."
            },
            {
                "hadithNo": "4274",
                "chapterNo": "3",
                "hadithEnglish": "Suhail narrated a Hadith like that of Malik (no. 4272) with a different chain of narrators, (reporting the Messenger of Allah (s.a.w) saying: \"Let him offer expiation for his oath and do that which is better.\"",
                "hadithArabic": "وَحَدَّثَنِى الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِى سُلَيْمَانُ - يَعْنِى ابْنَ بِلاَلٍ - حَدَّثَنِى سُهَيْلٌ فِى هَذَا الإِسْنَادِ بِمَعْنَى حَدِيثِ مَالِكٍ « فَلْيُكَفِّرْ يَمِينَهُ وَلْيَفْعَلِ الَّذِى هُوَ خَيْرٌ »."
            },
            {
                "hadithNo": "4275",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Tamim bin Tarafah said: \"A man came to 'Adiyy bin Hatim and asked him for the price of a servant, or part of the price of a servant. He said: 'I do not have anything to give you except my coat of mail and my helmet, but I will write to my family and tell them to give you these two things.' He did not accept that, and 'Adiyy got angry. He said: 'By Allah, I will not give you  anything!' Then the man accepted it, and he said: 'By Allah, were it not that I heard the Messenger of Allah (s.a.w) say: \"Whoever swears an oath then sees something that is more favored by Allah the Mighty and Sublime, than it, let him do that which is more favored by Allah,\" I would not have broken my oath.\"'",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ عَبْدِ الْعَزِيزِ - يَعْنِى ابْنَ رُفَيْعٍ - عَنْ تَمِيمِ بْنِ طَرَفَةَ قَالَ جَاءَ سَائِلٌ إِلَى عَدِىِّ بْنِ حَاتِمٍ فَسَأَلَهُ نَفَقَةً فِى ثَمَنِ خَادِمٍ أَوْ فِى بَعْضِ ثَمَنِ خَادِمٍ. فَقَالَ لَيْسَ عِنْدِى مَا أُعْطِيكَ إِلاَّ دِرْعِى وَمِغْفَرِى فَأَكْتُبُ إِلَى أَهْلِى أَنْ يُعْطُوكَهَا. قَالَ فَلَمْ يَرْضَ فَغَضِبَ عَدِىٌّ فَقَالَ أَمَا وَاللَّهِ لاَ أُعْطِيكَ شَيْئًا ثُمَّ إِنَّ الرَّجُلَ رَضِىَ فَقَالَ أَمَا وَاللَّهِ لَوْلاَ أَنِّى سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « مَنْ حَلَفَ عَلَى يَمِينٍ ثُمَّ رَأَى أَتْقَى لِلَّهِ مِنْهَا فَلْيَأْتِ التَّقْوَى ». مَا حَنَّثْتُ يَمِينِى."
            },
            {
                "hadithNo": "4276",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that 'Adiyy bin Hatim said: \"The Messenger of Allah (s.a.w) said: 'Whoever swears an oath, then sees that something else is better than it, let him do that which is better and ignore his oath.\"'",
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِى حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ عَدِىِّ بْنِ حَاتِمٍ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِى هُوَ خَيْرٌ وَلْيَتْرُكْ يَمِينَهُ »."
            },
            {
                "hadithNo": "4277",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Tamim At-Ta'i that 'Adiyy said: \"The Messenger of Allah (s.a.w) said: 'If one of you swears an oath, then he sees something that is better than it, let him offer expiation for it then do that which is better than it.\"'",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَمُحَمَّدُ بْنُ طَرِيفٍ الْبَجَلِىُّ - وَاللَّفْظُ لاِبْنِ طَرِيفٍ - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنِ الأَعْمَشِ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمٍ الطَّائِىِّ عَنْ عَدِىٍّ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِذَا حَلَفَ أَحَدُكُمْ عَلَى الْيَمِينِ فَرَأَى خَيْرًا مِنْهَا فَلْيُكَفِّرْهَا وَلْيَأْتِ الَّذِى هُوَ خَيْرٌ »."
            },
            {
                "hadithNo": "4278",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from 'Adiyy bin Hatim that he heard the Prophet (s.a.w) saying that (a Hadith similar to no. 4277).",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنِ الشَّيْبَانِىِّ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمٍ الطَّائِىِّ عَنْ عَدِىِّ بْنِ حَاتِمٍ أَنَّهُ سَمِعَ النَّبِىَّ -صلى الله عليه وسلم- يَقُولُ ذَلِكَ."
            },
            {
                "hadithNo": "4279",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Tamim bin Tarafah said: \"I heard 'Adiyy bin Hatim say, when a man came to him asking him for a hundred Dirham: 'Are you asking me for a hundred Dirham when I am the son of Hatim? By Allah, I will not give it to you.' Then he said: 'Were it not that I heard the Messenger of Allah (s.a.w) say: \"Whoever swears an oath, then sees somethi11g better than it, let him do that which is better.''",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ قَالَ سَمِعْتُ عَدِىَّ بْنَ حَاتِمٍ وَأَتَاهُ رَجُلٌ يَسْأَلُهُ مِائَةَ دِرْهَمٍ. فَقَالَ تَسْأَلُنِى مِائَةَ دِرْهَمٍ وَأَنَا ابْنُ حَاتِمٍ وَاللَّهِ لاَ أُعْطِيكَ. ثُمَّ قَالَ لَوْلاَ أَنِّى سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « مَنْ حَلَفَ عَلَى يَمِينٍ ثُمَّ رَأَى خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِى هُوَ خَيْرٌ »."
            },
            {
                "hadithNo": "4280",
                "chapterNo": "3",
                "hadithEnglish": "Tamim bin Tarafah said: \"I heard 'Adiyy bin Hatim, when a man asked him...'' he mentioned a similar report (as no. 4279) and added: \"You may have four hundred from me.''",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ قَالَ سَمِعْتُ تَمِيمَ بْنَ طَرَفَةَ قَالَ سَمِعْتُ عَدِىَّ بْنَ حَاتِمٍ أَنَّ رَجُلاً سَأَلَهُ فَذَكَرَ مِثْلَهُ وَزَادَ وَلَكَ أَرْبَعُمِائَةٍ فِى عَطَائِى."
            },
            {
                "hadithNo": "4281",
                "chapterNo": "3",
                "hadithEnglish": "'Abdur-Rahman bin Samurah said: \"The Messenger of Allah (s.a.w) said to me: 'O 'Abdur-Rahman bin Samurah, do not seek authority, for if you are given it when you ask for it, you will be left on your own without the support of Allah. But if you are given it without asking for it, you will be helped (by Allah). If you swear to do something then see that something else is better than it, then offer expiation for your oath and do that which is better.\"'",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ حَدَّثَنَا الْحَسَنُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ قَالَ قَالَ لِى رَسُولُ اللَّهِ -صلى الله عليه وسلم- « يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لاَ تَسْأَلِ الإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَائْتِ الَّذِى هُوَ خَيْرٌ ». قَالَ أَبُو أَحْمَدَ الْجُلُودِىُّ حَدَّثَنَا أَبُو الْعَبَّاسِ الْمَاسَرْجَسِىُّ حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ. بِهَذَا الْحَدِيثِ."
            },
            {
                "hadithNo": "4282",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Al-Hasan, from 'Abdur-Rahman bin Samurah, from the Prophet (s.a.w) with this chain (a Hadith similar to no. 4281), but in the Hadith of Al-Mu'tamir from his father there is no mention of authority.",
                "hadithArabic": "حَدَّثَنِى عَلِىُّ بْنُ حُجْرٍ السَّعْدِىُّ حَدَّثَنَا هُشَيْمٌ عَنْ يُونُسَ وَمَنْصُورٍ وَحُمَيْدٍ ح وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِىُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ سِمَاكِ بْنِ عَطِيَّةَ وَيُونُسَ بْنِ عُبَيْدٍ وَهِشَامِ بْنِ حَسَّانَ فِى آخَرِينَ ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ ح وَحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّىُّ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ كُلُّهُمْ عَنِ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِهَذَا الْحَدِيثِ وَلَيْسَ فِى حَدِيثِ الْمُعْتَمِرِ عَنْ أَبِيهِ ذِكْرُ الإِمَارَةِ."
            },
            {
                "hadithNo": "4283",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Your oath is according to what your companion believes.'\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَعَمْرٌو النَّاقِدُ - قَالَ يَحْيَى أَخْبَرَنَا هُشَيْمُ بْنُ بَشِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِى صَالِحٍ وَقَالَ عَمْرٌو حَدَّثَنَا هُشَيْمُ بْنُ بَشِيرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَبِى صَالِحٍ - عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « يَمِينُكَ عَلَى مَا يُصَدِّقُكَ عَلَيْهِ صَاحِبُكَ ». وَقَالَ عَمْرٌو « يُصَدِّقُكَ بِهِ صَاحِبُكَ »."
            },
            {
                "hadithNo": "4284",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'The oath is according to the intention of the one who asks for it to be sworn.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ هُشَيْمٍ عَنْ عَبَّادِ بْنِ أَبِى صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « الْيَمِينُ عَلَى نِيَّةِ الْمُسْتَحْلِفِ »."
            },
            {
                "hadithNo": "4285",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"Sulaiman had sixty women and he said: 'I will go around to all of them tonight, and each of them will become pregnant, and each of them will give birth to a boy who will become a knight who will fight in the cause of Allah. But none of them became pregnant except one, who gave birth to an malformed child.\" The Messenger of Allah (s.a.w) said: \"If he had said: 'If Allah wills,' each of them would have given birth to a boy who would become a knight who would fight in the cause of Allah.\"",
                "hadithArabic": "حَدَّثَنِى أَبُو الرَّبِيعِ الْعَتَكِىُّ وَأَبُو كَامِلٍ الْجَحْدَرِىُّ فُضَيْلُ بْنُ حُسَيْنٍ - وَاللَّفْظُ لأَبِى الرَّبِيعِ - قَالاَ حَدَّثَنَا حَمَّادٌ - وَهُوَ ابْنُ زَيْدٍ - حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ عَنْ أَبِى هُرَيْرَةَ قَالَ كَانَ لِسُلَيْمَانَ سِتُّونَ امْرَأَةً فَقَالَ لأَطُوفَنَّ عَلَيْهِنَّ اللَّيْلَةَ فَتَحْمِلُ كُلُّ وَاحِدَةٍ مِنْهُنَّ فَتَلِدُ كُلُّ وَاحِدَةٍ مِنْهُنَّ غُلاَمًا فَارِسًا يُقَاتِلُ فِى سَبِيلِ اللَّهِ فَلَمْ تَحْمِلْ مِنْهُنَّ إِلاَّ وَاحِدَةٌ فَوَلَدَتْ نِصْفَ إِنْسَانٍ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَوْ كَانَ اسْتَثْنَى لَوَلَدَتْ كُلُّ وَاحِدَةٍ مِنْهُنَّ غُلاَمًا فَارِسًا يُقَاتِلُ فِى سَبِيلِ اللَّهِ »."
            },
            {
                "hadithNo": "4286",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Sulaiman bin Dawud, the Prophet of Allah, said: 'Tonight I will go around to seventy women, each of whom will give birth to a boy who will fight in the cause of Allah.' His companion, or the Angel, said: 'Say: \"If Allah wills.\"' But he did not say it, or he was caused to forget, and none of his women gave birth to a child except one, who gave birth to a deformed child.\" The Messenger of Allah (s.a.w) said: \"If he had said: 'If Allah wills,' he would not have broken his oath, and that would have been a means of attaining what he hoped for.\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ وَابْنُ أَبِى عُمَرَ - وَاللَّفْظُ لاِبْنِ أَبِى عُمَرَ - قَالاَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ حُجَيْرٍ عَنْ طَاوُسٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « قَالَ سُلَيْمَانُ بْنُ دَاوُدَ نَبِىُّ اللَّهِ لأَطُوفَنَّ اللَّيْلَةَ عَلَى سَبْعِينَ امْرَأَةً كُلُّهُنَّ تَأْتِى بِغُلاَمٍ يُقَاتِلُ فِى سَبِيلِ اللَّهِ. فَقَالَ لَهُ صَاحِبُهُ أَوِ الْمَلَكُ قُلْ إِنْ شَاءَ اللَّهُ. فَلَمْ يَقُلْ وَنَسِىَ. فَلَمْ تَأْتِ وَاحِدَةٌ مِنْ نِسَائِهِ إِلاَّ وَاحِدَةٌ جَاءَتْ بِشِقِّ غُلاَمٍ ». فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « وَلَوْ قَالَ إِنْ شَاءَ اللَّهُ. لَمْ يَحْنَثْ وَكَانَ دَرَكًا لَهُ فِى حَاجَتِهِ »."
            },
            {
                "hadithNo": "4287",
                "chapterNo": "5",
                "hadithEnglish": "A similar report (as no. 4286) was narrated from Abu Hurairah, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- مِثْلَهُ أَوْ نَحْوَهُ."
            },
            {
                "hadithNo": "4288",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"Sulaiman bin Dawud said: 'Tonight I will go around to seventy women and each of them will give birth to a boy who will fight in the cause of Allah.' It was said to him: 'Say: \"If Allah wills,\"' but he did not say it. He went around to them, but none of them gave birth except one woman, who gave birth to an malformed child.'' The Messenger of Allah (s.a.w) said: \"If he had said 'If Allah wills,' he would not have broken his oath, and that could have been a means of fulfilling his wish.\"",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ أَخْبَرَنَا مَعْمَرٌ عَنِ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ سُلَيْمَانُ بْنُ دَاوُدَ لأُطِيفَنَّ اللَّيْلَةَ عَلَى سَبْعِينَ امْرَأَةً تَلِدُ كُلُّ امْرَأَةٍ مِنْهُنَّ غُلاَمًا يُقَاتِلُ فِى سَبِيلِ اللَّهِ. فَقِيلَ لَهُ قُلْ إِنْ شَاءَ اللَّهُ. فَلَمْ يَقُلْ. فَأَطَافَ بِهِنَّ فَلَمْ تَلِدْ مِنْهُنَّ إِلاَّ امْرَأَةٌ وَاحِدَةٌ نِصْفَ إِنْسَانٍ. قَالَ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَوْ قَالَ إِنْ شَاءَ اللَّهُ. لَمْ يَحْنَثْ وَكَانَ دَرَكًا لِحَاجَتِهِ »."
            },
            {
                "hadithNo": "4289",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Sulaiman bin Dawud said: 'Tonight I will go around to ninety women, and each of them will give birth to a knight who will fight in the cause of Allah.' His companion said to him: 'Say \"If Allah wills.'\" But he did not say 'If Allah wills,' and he went round to all of them. None of them became pregnant except one woman, who gave birth to a deformed child. By the One in Whose Hand is the soul of Muhammad, if he had said 'If Allah wills,' they would all have been knights, striving in the cause of Allah.''",
                "hadithArabic": "وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا شَبَابَةُ حَدَّثَنِى وَرْقَاءُ عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « قَالَ سُلَيْمَانُ بْنُ دَاوُدَ لأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةً كُلُّهَا تَأْتِى بِفَارِسٍ يُقَاتِلُ فِى سَبِيلِ اللَّهِ. فَقَالَ لَهُ صَاحِبُهُ قُلْ إِنْ شَاءَ اللَّهُ. فَلَمْ يَقُلْ إِنْ شَاءَ اللَّهُ. فَطَافَ عَلَيْهِنَّ جَمِيعًا فَلَمْ تَحْمِلْ مِنْهُنَّ إِلاَّ امْرَأَةٌ وَاحِدَةٌ فَجَاءَتْ بِشِقِّ رَجُلٍ وَايْمُ الَّذِى نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ قَالَ إِنْ شَاءَ اللَّهُ. لَجَاهَدُوا فِى سَبِيلِ اللَّهِ فُرْسَانًا أَجْمَعُونَ »."
            },
            {
                "hadithNo": "4290",
                "chapterNo": "5",
                "hadithEnglish": "A similar report (as no. 4289) was narrated from Abu Az-Zinnad with this chain, except that he said: \"They all would have borne a boy who would strive in the cause of Allah, may He be exalted.\"",
                "hadithArabic": "وَحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ أَبِى الزِّنَادِ بِهَذَا الإِسْنَادِ مِثْلَهُ. غَيْرَ أَنَّهُ قَالَ « كُلُّهَا تَحْمِلُ غُلاَمًا يُجَاهِدُ فِى سَبِيلِ اللَّهِ »."
            },
            {
                "hadithNo": "4291",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated that Hammam bin Munabbih said: \"This is what Abu Hurairah narrated to us from the Messenger of Allah (s.a.w).\" He mentioned a number of Ahadith including the following: \"The Messenger of Allah (s.a.w) said: 'By Allah, if one of you persist in an oath concerning his family, that is more sinful before Allah than offering the expiation that has been enjoined by Allah.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « وَاللَّهِ لأَنْ يَلَجَّ أَحَدُكُمْ بِيَمِينِهِ فِى أَهْلِهِ آثَمُ لَهُ عِنْدَ اللَّهِ مِنْ أَنْ يُعْطِىَ كَفَّارَتَهُ الَّتِى فَرَضَ اللَّهُ »."
            },
            {
                "hadithNo": "4292",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from Ibn 'Umar that 'Umar said: \"O Messenger of Allah, during the Jahiliyyah I vowed that I would spend a night in l'tikaf in Al-Masjid Al-Haram.\" He said: \"Fulfill your vow.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِى بَكْرٍ الْمُقَدَّمِىُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَزُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لِزُهَيْرٍ - قَالُوا حَدَّثَنَا يَحْيَى - وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِى نَافِعٌ عَنِ ابْنِ عُمَرَ أَنَّ عُمَرَ قَالَ يَا رَسُولَ اللَّهِ إِنِّى نَذَرْتُ فِى الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ لَيْلَةً فِى الْمَسْجِدِ الْحَرَامِ. قَالَ « فَأَوْفِ بِنَذْرِكَ »."
            },
            {
                "hadithNo": "4293",
                "chapterNo": "7",
                "hadithEnglish": "This Hadith (which is similar to no. 4291) was narrated from Ibn 'Umar. As for Abu Usamah and Ath-Thaqafi, their Hadith mentions I'tikaf for one night. As for Shu'bah, he said: \"He obliged himself to spend a day in I'tikaf\" In the Hadith there is no mention of a day or a night.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ حَدَّثَنَا أَبُو أُسَامَةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِى الثَّقَفِىَّ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلاَءِ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ حَفْصِ بْنِ غِيَاثٍ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ بْنِ أَبِى رَوَّادٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ وَقَالَ حَفْصٌ مِنْ بَيْنِهِمْ عَنْ عُمَرَ بِهَذَا الْحَدِيثِ أَمَّا أَبُو أُسَامَةَ وَالثَّقَفِىُّ فَفِى حَدِيثِهِمَا اعْتِكَافُ لَيْلَةٍ. وَأَمَّا فِى حَدِيثِ شُعْبَةَ فَقَالَ جَعَلَ عَلَيْهِ يَوْمًا يَعْتَكِفُهُ. وَلَيْسَ فِى حَدِيثِ حَفْصٍ ذِكْرُ يَوْمٍ وَلاَ لَيْلَةٍ."
            },
            {
                "hadithNo": "4294",
                "chapterNo": "7",
                "hadithEnglish": "'Abdullah bin 'Umar narrated that 'Umar bin Al-Khattab asked the Messenger of Allah (s.a.w) when he was in Al-Jir'anah, after he had come back from At-Ta'if: \"O Messenger of Allah, during the Jahiliyyah I vowed that I would spend a day in I'tikaf in Al-Masjid Al-Haram. What do you think?\" He said: \"Go and spend a day in I'tikaf\" He said: \"And the Messenger of Allah (s.a.w) had given him a slave woman from the Khums, but when the Messenger of Allah (s.a.w) freed the captives, 'Umar bin Al-Khattab heard their voices saying: 'The Messenger of Allah (s.a.w) has set us free.' He said: 'What is this?' They said: 'The Messenger of Allah (s.a.w) has set the prisoners free.' 'Umar said: 'O 'Abdullah, go to that slave woman and set her free.'\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ أَنَّ أَيُّوبَ حَدَّثَهُ أَنَّ نَافِعًا حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ حَدَّثَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ سَأَلَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- وَهُوَ بِالْجِعْرَانَةِ بَعْدَ أَنْ رَجَعَ مِنَ الطَّائِفِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّى نَذَرْتُ فِى الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ يَوْمًا فِى الْمَسْجِدِ الْحَرَامِ فَكَيْفَ تَرَى قَالَ « اذْهَبْ فَاعْتَكِفْ يَوْمًا ». قَالَ وَكَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- قَدْ أَعْطَاهُ جَارِيَةً مِنَ الْخُمْسِ فَلَمَّا أَعْتَقَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- سَبَايَا النَّاسِ سَمِعَ عُمَرُ بْنُ الْخَطَّابِ أَصْوَاتَهُمْ يَقُولُونَ أَعْتَقَنَا رَسُولُ اللَّهِ -صلى الله عليه وسلم-. فَقَالَ مَا هَذَا فَقَالُوا أَعْتَقَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- سَبَايَا النَّاسِ. فَقَالَ عُمَرُ يَا عَبْدَ اللَّهِ اذْهَبْ إِلَى تِلْكَ الْجَارِيَةِ فَخَلِّ سَبِيلَهَا."
            },
            {
                "hadithNo": "4295",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Ibn 'Umar said: \"When the Prophet (s.a.w) came back from Hunain, 'Umar asked the Messenger of Allah (s.a.w) about a vow that he had made during the Jahiliyyah, to observe l'tikaf for one day.'' Then he mentioned a Hadith like that of Jarir bin Hazim (no. 4294).",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ لَمَّا قَفَلَ النَّبِىُّ -صلى الله عليه وسلم- مِنْ حُنَيْنٍ سَأَلَ عُمَرُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- عَنْ نَذْرٍ كَانَ نَذَرَهُ فِى الْجَاهِلِيَّةِ اعْتِكَافِ يَوْمٍ. ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ جَرِيرِ بْنِ حَازِمٍ."
            },
            {
                "hadithNo": "4296",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Nafi' said: \"Mention was made in the presence of Ibn 'Umar of the 'Umrah of the Messenger of Allah (s.a.w) from Al-Jir'anah. He said: 'He did not perform 'Umrah from there.' He said: 'And 'Umar had made a vow during the Jahiliyyah to observe I'tikaf for one night.\"' Then he mentioned a Hadith like that of Jarir bin Hazim and Ma'mar, from Ayyub (no. 4294, 4295).",
                "hadithArabic": "وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّىُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ قَالَ ذُكِرَ عِنْدَ ابْنِ عُمَرَ عُمْرَةُ رَسُولِ اللَّهِ -صلى الله عليه وسلم- مِنَ الْجِعْرَانَةِ فَقَالَ لَمْ يَعْتَمِرْ مِنْهَا - قَالَ - وَكَانَ عُمَرُ نَذَرَ اعْتِكَافَ لَيْلَةٍ فِى الْجَاهِلِيَّةِ. ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ جَرِيرِ بْنِ حَازِمٍ وَمَعْمَرٍ عَنْ أَيُّوبَ."
            },
            {
                "hadithNo": "4297",
                "chapterNo": "7",
                "hadithEnglish": "This Hadith about vows was narrated from Ibn 'Umar (a Hadith similar to no. 4294). In both their Ahadith it mentions I'tikaf for one day.",
                "hadithArabic": "وَحَدَّثَنِى عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِىُّ حَدَّثَنَا حَجَّاجُ بْنُ الْمِنْهَالِ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ ح وَحَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الأَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ كِلاَهُمَا عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ. بِهَذَا الْحَدِيثِ فِى النَّذْرِ وَفِى حَدِيثِهِمَا جَمِيعًا اعْتِكَافُ يَوْمٍ."
            },
            {
                "hadithNo": "4298",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Zadan bin Abi 'Umar said: \"I came to Ibn 'Umar who had freed a slave. He picked up a stick or something from the ground and said: 'There is no more reward in it than the equivalent of this, but I heard the Messenger of Allah (s.a.w) say: \"Whoever slaps his slave or beats him, his expiation is to manumit him.\"",
                "hadithArabic": "حَدَّثَنِى أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِىُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ فِرَاسٍ عَنْ ذَكْوَانَ أَبِى صَالِحٍ عَنْ زَاذَانَ أَبِى عُمَرَ قَالَ أَتَيْتُ ابْنَ عُمَرَ وَقَدْ أَعْتَقَ مَمْلُوكًا - قَالَ - فَأَخَذَ مِنَ الأَرْضِ عُودًا أَوْ شَيْئًا فَقَالَ مَا فِيهِ مِنَ الأَجْرِ مَا يَسْوَى هَذَا إِلاَّ أَنِّى سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « مَنْ لَطَمَ مَمْلُوكَهُ أَوْ ضَرَبَهُ فَكَفَّارَتُهُ أَنْ يُعْتِقَهُ »."
            },
            {
                "hadithNo": "4299",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Zadan that Ibn 'Umar called a slave of his and he saw marks on his back. He said to him: \"Have I caused you pain?\" He said: \"No.\" He said: \"You are free.\" Then he picked up something from the ground and said: \"I will not have any reward for it, not even the weight of this. I heard the Messenger of Allah (s.a.w) say: 'Whoever beats a slave without him having done anything to deserve it, or slaps him, his expiation is to manumit him.\"'",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ فِرَاسٍ قَالَ سَمِعْتُ ذَكْوَانَ يُحَدِّثُ عَنْ زَاذَانَ أَنَّ ابْنَ عُمَرَ دَعَا بِغُلاَمٍ لَهُ فَرَأَى بِظَهْرِهِ أَثَرًا فَقَالَ لَهُ أَوْجَعْتُكَ قَالَ لاَ. قَالَ فَأَنْتَ عَتِيقٌ. قَالَ ثُمَّ أَخَذَ شَيْئًا مِنَ الأَرْضِ فَقَالَ مَا لِى فِيهِ مِنَ الأَجْرِ مَا يَزِنُ هَذَا إِنِّى سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « مَنْ ضَرَبَ غُلاَمًا لَهُ حَدًّا لَمْ يَأْتِهِ أَوْ لَطَمَهُ فَإِنَّ كَفَّارَتَهُ أَنْ يُعْتِقَهُ »."
            },
            {
                "hadithNo": "4300",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Firas with the chain of Shu'bah and Abu 'Awanah (a Hadith similar to no. 4299). As for the Hadith of Ibn Mahdi, it says: \"Without him having done anything to deserve it\". In the Hadith of Waki' it says: \"Whoever slaps his slave\" and does not mention \"Without him having done anything to deserve it.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنِى مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ كِلاَهُمَا عَنْ سُفْيَانَ عَنْ فِرَاسٍ بِإِسْنَادِ شُعْبَةَ وَأَبِى عَوَانَةَ أَمَّا حَدِيثُ ابْنِ مَهْدِىٍّ فَذَكَرَ فِيهِ « حَدًّا لَمْ يَأْتِهِ ». وَفِى حَدِيثِ وَكِيعٍ « مَنْ لَطَمَ عَبْدَهُ ». وَلَمْ يَذْكُرِ الْحَدَّ."
            },
            {
                "hadithNo": "4301",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Mu'awiyah bin Suwaid said: \"I slapped a freed slave of ours and he ran away. Then I came just before Zuhr and prayed behind my father. He called him, and called for me, then he said: 'Do to him what he did to you,' but he let me go. Then he said: 'At the time of the Messenger of Allah (s.a.w), we Banu Muqarrin had only one servant. One of us slapped her and news of that reached the Prophet (s.a.w) He said: 'Manumit her.' They said: 'They do not have any other servant.' He said: 'Then let them keep her, and when they no longer need her, they should let her go.'\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِى حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ قَالَ لَطَمْتُ مَوْلًى لَنَا فَهَرَبْتُ ثُمَّ جِئْتُ قُبَيْلَ الظُّهْرِ فَصَلَّيْتُ خَلْفَ أَبِى فَدَعَاهُ وَدَعَانِى ثُمَّ قَالَ امْتَثِلْ مِنْهُ. فَعَفَا ثُمَّ قَالَ كُنَّا بَنِى مُقَرِّنٍ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- لَيْسَ لَنَا إِلاَّ خَادِمٌ وَاحِدَةٌ فَلَطَمَهَا أَحَدُنَا فَبَلَغَ ذَلِكَ النَّبِىَّ -صلى الله عليه وسلم- فَقَالَ « أَعْتِقُوهَا ». قَالُوا لَيْسَ لَهُمْ خَادِمٌ غَيْرُهَا قَالَ « فَلْيَسْتَخْدِمُوهَا فَإِذَا اسْتَغْنَوْا عَنْهَا فَلْيُخَلُّوا سَبِيلَهَا »."
            },
            {
                "hadithNo": "4302",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Hilal bin Yasaf said: \"An old man got angry and slapped a servant of his. Suwaid bin Muqarrin said to him: 'Could you not find any part other than her face? I remember when I was the seventh of seven sons of Banu Muqarrin and we had no servant but one woman. The youngest of us slapped her and the Messenger of Allah (s.a.w) commanded us to manumit her.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ - وَاللَّفْظُ لأَبِى بَكْرٍ - قَالاَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ حُصَيْنٍ عَنْ هِلاَلِ بْنِ يَسَافٍ قَالَ عَجِلَ شَيْخٌ فَلَطَمَ خَادِمًا لَهُ فَقَالَ لَهُ سُوَيْدُ بْنُ مُقَرِّنٍ عَجَزَ عَلَيْكَ إِلاَّ حُرُّ وَجْهِهَا لَقَدْ رَأَيْتُنِى سَابِعَ سَبْعَةٍ مِنْ بَنِى مُقَرِّنٍ مَا لَنَا خَادِمٌ إِلاَّ وَاحِدَةٌ لَطَمَهَا أَصْغَرُنَا فَأَمَرَنَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَنْ نُعْتِقَهَا."
            },
            {
                "hadithNo": "4303",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Hilal bin Yasaf said: \"We used to sell cloth in the house of Suwaid bin Muqarrin, the brother of An-Nu'man bin Muqarrin. A slave woman came out and said something to one of us, and he slapped her and Suwaid got angry...\" a Hadith like that of Ibn Idris (no. 4302).",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا ابْنُ أَبِى عَدِىٍّ عَنْ شُعْبَةَ عَنْ حُصَيْنٍ عَنْ هِلاَلِ بْنِ يَسَافٍ قَالَ كُنَّا نَبِيعُ الْبَزَّ فِى دَارِ سُوَيْدِ بْنِ مُقَرِّنٍ أَخِى النُّعْمَانِ بْنِ مُقَرِّنٍ فَخَرَجَتْ جَارِيَةٌ فَقَالَتْ لِرَجُلٍ مِنَّا كَلِمَةً فَلَطَمَهَا فَغَضِبَ سُوَيْدٌ. فَذَكَرَ نَحْوَ حَدِيثِ ابْنِ إِدْرِيسَ."
            },
            {
                "hadithNo": "4304",
                "chapterNo": "8",
                "hadithEnglish": "Shu'bah narrated: \"Muhammad bin Al-Munkadir said to me: 'What is your name?' I said: 'Shu'bah.' Muhammad said: 'Abu Shu'bah Al-'Iraqi narrated to me from Suwaid bin Muqarrin that someone slapped a slave woman of his. Suwaid said to him: Do you not know that hitting the face is unlawful? He said: I remember when I was the seventh of my brothers, with the Messenger of Allah (s.a.w), and we only had one servant. One of us went and slapped him, and the Messenger of Allah (s.a.w) commanded us to manumit him.\"'",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ حَدَّثَنِى أَبِى حَدَّثَنَا شُعْبَةُ قَالَ قَالَ لِى مُحَمَّدُ بْنُ الْمُنْكَدِرِ مَا اسْمُكَ قُلْتُ شُعْبَةُ. فَقَالَ مُحَمَّدٌ حَدَّثَنِى أَبُو شُعْبَةَ الْعِرَاقِىُّ عَنْ سُوَيْدِ بْنِ مُقَرِّنٍ أَنَّ جَارِيَةً لَهُ لَطَمَهَا إِنْسَانٌ فَقَالَ لَهُ سُوَيْدٌ أَمَا عَلِمْتَ أَنَّ الصُّورَةَ مُحَرَّمَةٌ فَقَالَ لَقَدْ رَأَيْتُنِى وَإِنِّى لَسَابِعُ إِخْوَةٍ لِى مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- وَمَا لَنَا خَادِمٌ غَيْرُ وَاحِدٍ فَعَمَدَ أَحَدُنَا فَلَطَمَهُ فَأَمَرَنَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- أَنْ نُعْتِقَهُ."
            },
            {
                "hadithNo": "4305",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Wahb bin Jarir: \"Shu'bah told us: 'Muhammad bin Al-Munkadir said to me: What is your name?\"' And he mentioned a Hadith like that of 'Abdus-Samad (no. 4304).",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى عَنْ وَهْبِ بْنِ جَرِيرٍ أَخْبَرَنَا شُعْبَةُ قَالَ قَالَ لِى مُحَمَّدُ بْنُ الْمُنْكَدِرِ مَا اسْمُكَ فَذَكَرَ بِمِثْلِ حَدِيثِ عَبْدِ الصَّمَدِ."
            },
            {
                "hadithNo": "4306",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Ibrahim At-Taimi that his father said: 'Abu Mas'ud Al-Badri said: \"I was beating a slave of mine with a whip when I heard a voice behind me (saying): 'You should realize, Abu Mas'ud!' But I did not understand the voice because I was so angry. When he came close to me, I saw that it was the Messenger of Allah (s.a.w) and he was saying: 'You should realize, Abu Mas'ud! 'You should realize, Abu Mas'ud!' I threw down the whip that was in my hand and he said: 'You should realize, Abu Mas'ud, that Allah has more power over you than you have over this slave.' I said: 'I will never beat a slave again after this.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِىُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ - يَعْنِى ابْنَ زِيَادٍ - حَدَّثَنَا الأَعْمَشُ عَنْ إِبْرَاهِيمَ التَّيْمِىِّ عَنْ أَبِيهِ قَالَ قَالَ أَبُو مَسْعُودٍ الْبَدْرِىُّ كُنْتُ أَضْرِبُ غُلاَمًا لِى بِالسَّوْطِ فَسَمِعْتُ صَوْتًا مِنْ خَلْفِى « اعْلَمْ أَبَا مَسْعُودٍ ». فَلَمْ أَفْهَمِ الصَّوْتَ مِنَ الْغَضَبِ - قَالَ - فَلَمَّا دَنَا مِنِّى إِذَا هُوَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَإِذَا هُوَ يَقُولُ « اعْلَمْ أَبَا مَسْعُودٍ اعْلَمْ أَبَا مَسْعُودٍ ». قَالَ فَأَلْقَيْتُ السَّوْطَ مِنْ يَدِى فَقَالَ « اعْلَمْ أَبَا مَسْعُودٍ أَنَّ اللَّهَ أَقْدَرُ عَلَيْكَ مِنْكَ عَلَى هَذَا الْغُلاَمِ ». قَالَ فَقُلْتُ لاَ أَضْرِبُ مَمْلُوكًا بَعْدَهُ أَبَدًا."
            },
            {
                "hadithNo": "4307",
                "chapterNo": "8",
                "hadithEnglish": "A similar Hadith (as no. 4306) was narrated from Al-A'mash with this chain, except that in the Hadith of Jarir it says: \"The whip fell from my hand, out of awe towards him.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ - وَهُوَ الْمَعْمَرِىُّ - عَنْ سُفْيَانَ ح وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبُو عَوَانَةَ كُلُّهُمْ عَنِ الأَعْمَشِ بِإِسْنَادِ عَبْدِ الْوَاحِدِ. نَحْوَ حَدِيثِهِ. غَيْرَ أَنَّ فِى حَدِيثِ جَرِيرٍ فَسَقَطَ مِنْ يَدِى السَّوْطُ مِنْ هَيْبَتِهِ."
            },
            {
                "hadithNo": "4308",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated that Abu Mas'ud AI-Ansari said: \"I was beating a slave of mine, and I heard a voice behind me (saying): 'You should realize, Abu Mas'ud, that Allah has more power over you than you have over him.' I turned around, and I saw the Messenger of Allah (s.a.w). I said: 'O Messenger of Allah, he is free for the Face of Allah.' He said: 'If you had not done that, the Fire would have scorched you,' or 'the Fire would have touched you.\"'",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الأَعْمَشُ عَنْ إِبْرَاهِيمَ التَّيْمِىِّ عَنْ أَبِيهِ عَنْ أَبِى مَسْعُودٍ الأَنْصَارِىِّ قَالَ كُنْتُ أَضْرِبُ غُلاَمًا لِى فَسَمِعْتُ مِنْ خَلْفِى صَوْتًا « اعْلَمْ أَبَا مَسْعُودٍ لَلَّهُ أَقْدَرُ عَلَيْكَ مِنْكَ عَلَيْهِ ». فَالْتَفَتُّ فَإِذَا هُوَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقُلْتُ يَا رَسُولَ اللَّهِ هُوَ حُرٌّ لِوَجْهِ اللَّهِ. فَقَالَ « أَمَا لَوْ لَمْ تَفْعَلْ لَلَفَحَتْكَ النَّارُ أَوْ لَمَسَّتْكَ النَّارُ »."
            },
            {
                "hadithNo": "4309",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Abu Mas'ud that he was beating a slave of his, and he (the slave) started saying: \"I seek refuge in Allah.\" He carried on beating him, so he said: \"I seek refuge in the Messenger of Allah, and he stopped beating him.\" The Messenger of Allah (s.a.w) said: \"By Allah, Allah has more power over you than you have over him.\" Then he set him free.",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا ابْنُ أَبِى عَدِىٍّ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ عَنْ إِبْرَاهِيمَ التَّيْمِىِّ عَنْ أَبِيهِ عَنْ أَبِى مَسْعُودٍ أَنَّهُ كَانَ يَضْرِبُ غُلاَمَهُ فَجَعَلَ يَقُولُ أَعُوذُ بِاللَّهِ - قَالَ - فَجَعَلَ يَضْرِبُهُ فَقَالَ أَعُوذُ بِرَسُولِ اللَّهِ. فَتَرَكَهُ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « وَاللَّهِ لَلَّهُ أَقْدَرُ عَلَيْكَ مِنْكَ عَلَيْهِ ». قَالَ فَأَعْتَقَهُ."
            },
            {
                "hadithNo": "4310",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Shu'bah with this chain (a Hadith similar to no. 4309), but he did not mention the words: \"I seek refuge in Allah, I seek refuge in the Messenger of Allah.''",
                "hadithArabic": "وَحَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ أَخْبَرَنَا مُحَمَّدٌ - يَعْنِى ابْنَ جَعْفَرٍ - عَنْ شُعْبَةَ بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ قَوْلَهُ أَعُوذُ بِاللَّهِ أَعُوذُ بِرَسُولِ اللَّهِ -صلى الله عليه وسلم-."
            },
            {
                "hadithNo": "4311",
                "chapterNo": "9",
                "hadithEnglish": "Abu Hurairah said: Abul-Qasim (s.a.w) said: \"Whoever accuses his slave of fornication, the Hadd punishment will be carried out against him on the Day of Resurrection, unless he is as he said.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا ابْنُ نُمَيْرٍ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِى حَدَّثَنَا فُضَيْلُ بْنُ غَزْوَانَ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِى نُعْمٍ حَدَّثَنِى أَبُو هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ -صلى الله عليه وسلم- « مَنْ قَذَفَ مَمْلُوكَهُ بِالزِّنَا يُقَامُ عَلَيْهِ الْحَدُّ يَوْمَ الْقِيَامَةِ إِلاَّ أَنْ يَكُونَ كَمَا قَالَ »."
            },
            {
                "hadithNo": "4312",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from Fudail bin Ghazwan (a Hadith similar to no. 4311) with this chain. In their Hadith it says: \"I heard Abul-Qasim (s.a.w), the Prophet of repentance.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ كِلاَهُمَا عَنْ فُضَيْلِ بْنِ غَزْوَانَ بِهَذَا الإِسْنَادِ. وَفِى حَدِيثِهِمَا سَمِعْتُ أَبَا الْقَاسِمِ -صلى الله عليه وسلم- نَبِىَّ التَّوْبَةِ."
            },
            {
                "hadithNo": "4313",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that Al-Ma'rur bin Suwaid said: \"We passed by Abu Dharr in Ar-Rabadhah. He was wearing a Burd and his slave was wearing something similar. We said: 'O Abu Dharr, if you put them together it would be a Hullah.' He said: 'There was an exchange of words between myself and one of my brothers whose mother was a non-Arab, and I insulted him because of his mother. He complained about me to the Prophet (s.a.w), then I met the Prophet (s.a.w) and he said: \"O Abu Dharr, you are a man in whom there is some ignorance.\" I said: \"O Messenger of Allah, if someone insults people, they will insult his father and mother.\" He said: \"O Abu Dharr, you are a man in whom there is some ignorance. They are your brothers whom Allah has placed under your control, so feed them what you eat, and clothe them with what you wear, and do not burden them with more than they can bear; if you do burden them, then help them.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الأَعْمَشُ عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ قَالَ مَرَرْنَا بِأَبِى ذَرٍّ بِالرَّبَذَةِ وَعَلَيْهِ بُرْدٌ وَعَلَى غُلاَمِهِ مِثْلُهُ فَقُلْنَا يَا أَبَا ذَرٍّ لَوْ جَمَعْتَ بَيْنَهُمَا كَانَتْ حُلَّةً. فَقَالَ إِنَّهُ كَانَ بَيْنِى وَبَيْنَ رَجُلٍ مِنْ إِخْوَانِى كَلاَمٌ وَكَانَتْ أَمُّهُ أَعْجَمِيَّةً فَعَيَّرْتُهُ بِأُمِّهِ فَشَكَانِى إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَلَقِيتُ النَّبِىَّ -صلى الله عليه وسلم- فَقَالَ « يَا أَبَا ذَرٍّ إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ ». قُلْتُ يَا رَسُولَ اللَّهِ مَنْ سَبَّ الرِّجَالَ سَبُّوا أَبَاهُ وَأُمُّهُ. قَالَ « يَا أَبَا ذَرٍّ إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ هُمْ إِخْوَانُكُمْ جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ فَأَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ وَأَلْبِسُوهُمْ مِمَّا تَلْبَسُونَ وَلاَ تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ فَإِنْ كَلَّفْتُمُوهُمْ فَأَعِينُوهُمْ »."
            },
            {
                "hadithNo": "4314",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated from Al-A'mash (a Hadith similar to no. 4313) with this chain. In the Hadith of Zuhair and Abu Mu'awiyah after the words \"You are a man in whom there is some ignorance\" it adds: \"I said: 'Even up to this time of old age?' He said: 'Yes.'\" In the Hadith of Abu Mu'awiyah it says: \"Yes, even up to this time of old age.'' In the Hadith of 'Eisa it says: \"If he burdens him with more than he can bear, let him sell him.\" In the Hadith of Zuhair it says: \"Let him help him with it.'' In the Hadith of Abu Mu'awiyah it does not say: \"Let him sell him\" or \"let him help him.'' It ends with the words \"and do not burden him with more than he can bear.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ كُلُّهُمْ عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ وَزَادَ فِى حَدِيثِ زُهَيْرٍ وَأَبِى مُعَاوِيَةَ بَعْدَ قَوْلِهِ « إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ ». قَالَ قُلْتُ عَلَى حَالِ سَاعَتِى مِنَ الْكِبَرِ قَالَ « نَعَمْ ». وَفِى رِوَايَةِ أَبِى مُعَاوِيَةَ « نَعَمْ عَلَى حَالِ سَاعَتِكَ مِنَ الْكِبَرِ ». وَفِى حَدِيثِ عِيسَى « فَإِنْ كَلَّفَهُ مَا يَغْلِبُهُ فَلْيَبِعْهُ ». وَفِى حَدِيثِ زُهَيْرٍ « فَلْيُعِنْهُ عَلَيْهِ ». وَلَيْسَ فِى حَدِيثِ أَبِى مُعَاوِيَةَ « فَلْيَبِعْهُ ». وَلاَ « فَلْيُعِنْهُ ». انْتَهَى عِنْدَ قَوْلِهِ « وَلاَ يُكَلِّفْهُ مَا يَغْلِبُهُ »."
            },
            {
                "hadithNo": "4315",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that Al-Ma'rur bin Suwaid said: \"I saw Abu Dharr wearing a Hullah and his slave was wearing something similar. I asked him about that and he said that he had insulted a man at the time of the Messenger of Allah (s.a.w), criticizing him because of his mother. The man went to the Prophet (s.a.w) and told him about that, and the Prophet (s.a.w) said: 'You are a man in whom there is still some ignorance. (They are) your brothers and servants whom Allah has placed under your control, so whoever has his brother under his control, let him feed him what he eats and clothe him with what he wears. And do not burden them with more than they can bear, and if you do that, then help them.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ وَاصِلٍ الأَحْدَبِ عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ قَالَ رَأَيْتُ أَبَا ذَرٍّ وَعَلَيْهِ حُلَّةٌ وَعَلَى غُلاَمِهِ مِثْلُهَا فَسَأَلْتُهُ عَنْ ذَلِكَ قَالَ فَذَكَرَ أَنَّهُ سَابَّ رَجُلاً عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَعَيَّرَهُ بِأُمِّهِ - قَالَ - فَأَتَى الرَّجُلُ النَّبِىَّ -صلى الله عليه وسلم- فَذَكَرَ ذَلِكَ لَهُ فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- « إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ إِخْوَانُكُمْ وَخَوَلُكُمْ جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ فَمَنْ كَانَ أَخُوهُ تَحْتَ يَدَيْهِ فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ وَلاَ تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ فَإِنْ كَلَّفْتُمُوهُمْ فَأَعِينُوهُمْ عَلَيْهِ »."
            },
            {
                "hadithNo": "4316",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"A slave is entitled to his food and clothing, and he should not be burdened except with that which he can bear.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ بُكَيْرَ بْنَ الأَشَجِّ حَدَّثَهُ عَنِ الْعَجْلاَنِ مَوْلَى فَاطِمَةَ عَنْ أَبِى هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- أَنَّهُ قَالَ « لِلْمَمْلُوكِ طَعَامُهُ وَكِسْوَتُهُ وَلاَ يُكَلَّفُ مِنَ الْعَمَلِ إِلاَّ مَا يُطِيقُ »."
            },
            {
                "hadithNo": "4317",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"When the servant of any one of you brings food which he had looked, worked hard and endured heat and smoke, let him invite him to eat with him, and if the food runs a little short, he should still put a morsel or two of it in his hand.\"",
                "hadithArabic": "وَحَدَّثَنَا الْقَعْنَبِىُّ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ مُوسَى بْنِ يَسَارٍ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِذَا صَنَعَ لأَحَدِكُمْ خَادِمُهُ طَعَامَهُ ثُمَّ جَاءَهُ بِهِ وَقَدْ وَلِىَ حَرَّهُ وَدُخَانَهُ فَلْيُقْعِدْهُ مَعَهُ فَلْيَأْكُلْ فَإِنْ كَانَ الطَّعَامُ مَشْفُوهًا قَلِيلاً فَلْيَضَعْ فِى يَدِهِ مِنْهُ أُكْلَةً أَوْ أُكْلَتَيْنِ ». قَالَ دَاوُدُ يَعْنِى لُقْمَةً أَوْ لُقْمَتَيْنِ."
            },
            {
                "hadithNo": "4318",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Messenger of Allah (s.a.w) said: \"If a slave is sincere towards his master and worships Allah properly, he will have a twofold reward.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « إِنَّ الْعَبْدَ إِذَا نَصَحَ لِسَيِّدِهِ وَأَحْسَنَ عِبَادَةَ اللَّهِ فَلَهُ أَجْرُهُ مَرَّتَيْنِ »."
            },
            {
                "hadithNo": "4319",
                "chapterNo": "11",
                "hadithEnglish": "A Haditj similar to that of Malik (4318) was narrated from Nafi', from Ibn 'Umar, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالاَ حَدَّثَنَا يَحْيَى وَهْوَ الْقَطَّانُ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا ابْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِى أُسَامَةُ جَمِيعًا عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمِثْلِ حَدِيثِ مَالِكٍ."
            },
            {
                "hadithNo": "4320",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Ibn Shibab said: I heard Sa'eed bin Al-Musayyab say: 'Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'The faithful slave will- have two rewards.' By the One in Whose Hand is the soul of Abu Hurairah, were it not for Jihad in the cause of Allah, Hajj and honoring my mother, I would have liked to die a slave . He said: \"We heard that Abu Hurairah did not perform Hajj until his mother died, because he kept her company.\"",
                "hadithArabic": "حَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ قَالَ أَبُو هُرَيْرَةَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لِلْعَبْدِ الْمَمْلُوكِ الْمُصْلِحِ أَجْرَانِ ». وَالَّذِى نَفْسُ أَبِى هُرَيْرَةَ بِيَدِهِ لَوْلاَ الْجِهَادُ فِى سَبِيلِ اللَّهِ وَالْحَجُّ وَبِرُّ أُمِّى لأَحْبَبْتُ أَنْ أَمُوتَ وَأَنَا مَمْلُوكٌ. قَالَ وَبَلَغَنَا أَنَّ أَبَا هُرَيْرَةَ لَمْ يَكُنْ يَحُجُّ حَتَّى مَاتَتْ أُمُّهُ لِصُحْبَتِهَا. قَالَ أَبُو الطَّاهِرِ فِى حَدِيثِهِ « لِلْعَبْدِ الْمُصْلِحِ ». وَلَمْ يَذْكُرِ الْمَمْلُوكَ."
            },
            {
                "hadithNo": "4321",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated from Ibn Shihab (a Hadith similar to no. 4340) with this chain, but he did not mention: \"We heard...\" etc.",
                "hadithArabic": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا أَبُو صَفْوَانَ الأُمَوِىُّ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ بَلَغَنَا وَمَا بَعْدَهُ."
            },
            {
                "hadithNo": "4322",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'If a slave fulfills his duty towards Allah and towards his master, he will have two rewards.'\" He said: \"I narrated it to Ka'b and Ka'b said (adding): 'He will not be brought to account, and neither will the poor believer.\"'",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ عَنْ أَبِى صَالِحٍ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِذَا أَدَّى الْعَبْدُ حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ كَانَ لَهُ أَجْرَانِ ». قَالَ فَحَدَّثْتُهَا كَعْبًا فَقَالَ كَعْبٌ لَيْسَ عَلَيْهِ حِسَابٌ وَلاَ عَلَى مُؤْمِنٍ مُزْهِدٍ."
            },
            {
                "hadithNo": "4323",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated from Al-A'mash with this chain (a Hadith similar to no. 4322).",
                "hadithArabic": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ."
            },
            {
                "hadithNo": "4324",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Hammam bin Munabbih said: \"This is what Abu Hurairah narrated to us from the Messenger of Allah (s.a.w).\" He mentioned a number of Ahadith, including the following: \"The Messenger of Allah (s.a.w) said: 'How good it is for a slave, if he dies worshiping Allah well and keeping good company with his master. How good it is for him.'\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « نِعِمَّا لِلْمَمْلُوكِ أَنْ يُتَوَفَّى يُحْسِنُ عِبَادَةَ اللَّهِ وَصَحَابَةَ سَيِّدِهِ نِعِمَّا لَهُ »."
            },
            {
                "hadithNo": "4325",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah (s.a.w) said: 'If a person frees his share of a slave, and has enough money to pay the full price of the slave, a fair price should be worked out for the slave, and his partners should be paid for their shares, then he should free the slave, otherwise he has freed only what he has freed.'\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ نَافِعٌ عَنِ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ أَعْتَقَ شِرْكًا لَهُ فِى عَبْدٍ فَكَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ قُوِّمَ عَلَيْهِ قِيمَةَ الْعَدْلِ فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ وَعَتَقَ عَلَيْهِ الْعَبْدُ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ »."
            },
            {
                "hadithNo": "4326",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah (s.a.w) said: 'Whoever frees his share of a slave, has to free him completely, if he has enough money to pay the full price; if he does not have enough money then he has freed only what he has freed.'\"",
                "hadithArabic": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ أَعْتَقَ شِرْكًا لَهُ مِنْ مَمْلُوكٍ فَعَلَيْهِ عِتْقُهُ كُلُّهُ إِنْ كَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَهُ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ عَتَقَ مِنْهُ مَا عَتَقَ »."
            },
            {
                "hadithNo": "4327",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated that 'Abdullah bin 'Umar said: \"The Messenger of Allah (s.a.w) said: 'Whoever frees his share of a slave and has enough money to pay the full price for him, a fair price should be worked out, otherwise he has freed only what he has freed.'\"",
                "hadithArabic": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ نَافِعٍ مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ أَعْتَقَ نَصِيبًا لَهُ فِى عَبْدٍ فَكَانَ لَهُ مِنَ الْمَالِ قَدْرُ مَا يَبْلُغُ قِيمَتَهُ قُوِّمَ عَلَيْهِ قِيمَةَ عَدْلٍ وَإِلاَّ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ »."
            },
            {
                "hadithNo": "4328",
                "chapterNo": "12",
                "hadithEnglish": "This Hadith was narrated from Ibn 'Umar, (similar to no. 4326) from the Prophet (s.a.w), but in their Hadith it does not say: \"If he does not have enough money then he has freed only what he has freed.\" But in the Hadith of Ayyub and Yahya bin Sa'eed, they mentioned this phrase but they said: \"We do not know whether it is part of the Hadith or is something that was said by Nafi' (a narrator).\" It does not say in the Hadith of any of them: \"I heard the Messenger of Allah (s.a.w) say,\" except in the Hadith of Al-Laith bin Sa'd.",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ ح وَحَدَّثَنِى أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَاعِيلُ - يَعْنِى ابْنَ عُلَيَّةَ - كِلاَهُمَا عَنْ أَيُّوبَ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنِ ابْنِ جُرَيْجٍ أَخْبَرَنِى إِسْمَاعِيلُ بْنُ أُمَيَّةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِى فُدَيْكٍ عَنِ ابْنِ أَبِى ذِئْبٍ ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِى أُسَامَةُ - يَعْنِى ابْنَ زَيْدٍ - كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِهَذَا الْحَدِيثِ وَلَيْسَ فِى حَدِيثِهِمْ « وَإِنْ لَمْ يَكُنْ لَهُ مَالٌ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ ». إِلاَّ فِى حَدِيثِ أَيُّوبَ وَيَحْيَى بْنِ سَعِيدٍ فَإِنَّهُمَا ذَكَرَا هَذَا الْحَرْفَ فِى الْحَدِيثِ وَقَالاَ لاَ نَدْرِى أَهُوَ شَىْءٌ فِى الْحَدِيثِ أَوْ قَالَهُ نَافِعٌ مِنْ قِبَلِهِ وَلَيْسَ فِى رِوَايَةِ أَحَدٍ مِنْهُمْ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم-. إِلاَّ فِى حَدِيثِ اللَّيْثِ بْنِ سَعْدٍ."
            },
            {
                "hadithNo": "4329",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Salim bin 'Abdullah, from his father, that the Messenger of Allah (s.a.w) said: \"Whoever frees a slave who is owned by him and another person, a fair price should be worked out for him, without cheating, underestimating or overestimating, then he should free him from his own wealth if he is well off.\"",
                "hadithArabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ وَابْنُ أَبِى عُمَرَ كِلاَهُمَا عَنِ ابْنِ عُيَيْنَةَ قَالَ ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « مَنْ أَعْتَقَ عَبْدًا بَيْنَهُ وَبَيْنَ آخَرَ قُوِّمَ عَلَيْهِ فِى مَالِهِ قِيمَةَ عَدْلٍ لاَ وَكْسَ وَلاَ شَطَطَ ثُمَّ عَتَقَ عَلَيْهِ فِى مَالِهِ إِنْ كَانَ مُوسِرًا »."
            },
            {
                "hadithNo": "4330",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Prophet (s.a.w) said: \"Whoever frees his share in a slave should (also) free the rest with his own money, if he has enough money to pay the price of the slave.\"",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- قَالَ « مَنْ أَعْتَقَ شِرْكًا لَهُ فِى عَبْدٍ عَتَقَ مَا بَقِىَ فِى مَالِهِ إِذَا كَانَ لَهُ مَالٌ يَبْلُغُ ثَمَنَ الْعَبْدِ »."
            },
            {
                "hadithNo": "4331",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said concerning a slave who is owned by two men, one of whom manumits (his share): \"He is responsible (for manumitting the other share).\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنِ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ فِى الْمَمْلُوكِ بَيْنَ الرَّجُلَيْنِ فَيُعْتِقُ أَحَدُهُمَا قَالَ « يَضْمَنُ »."
            },
            {
                "hadithNo": "4332",
                "chapterNo": "12",
                "hadithEnglish": "Shu'bah narrated with this chain (a Hadith similar to no. 4331): He said: \"Whoever frees a share of a slave, he should be freed using his wealth.\"",
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِى حَدَّثَنَا شُعْبَةُ بِهَذَا الإِسْنَادِ قَالَ « مَنْ أَعْتَقَ شَقِيصًا مِنْ مَمْلُوكٍ فَهُوَ حُرٌّ مِنْ مَالِهِ »."
            },
            {
                "hadithNo": "4333",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Whoever manumits his share of a slave, let him manumit him completely with his own money if he has money, and if he does not have money, let the slave work for his manumission, without being overburdened.\"",
                "hadithArabic": "وَحَدَّثَنِى عَمْرٌو النَّاقِدُ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنِ ابْنِ أَبِى عَرُوبَةَ عَنْ قَتَادَةَ عَنِ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « مَنْ أَعْتَقَ شَقِيصًا لَهُ فِى عَبْدٍ فَخَلاَصُهُ فِى مَالِهِ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتُسْعِىَ الْعَبْدُ غَيْرَ مَشْقُوقٍ عَلَيْهِ »."
            },
            {
                "hadithNo": "4334",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Ibn Abi 'Arubah with (a different chain, a Hadith similar to no. 4333). In the Hadith of 'Eisa it says: \"Then let him work for the manumission of the part that has not been freed, without being overburdened.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَلِىُّ بْنُ مُسْهِرٍ وَمُحَمَّدُ بْنُ بِشْرٍ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَلِىُّ بْنُ خَشْرَمٍ قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ جَمِيعًا عَنِ ابْنِ أَبِى عَرُوبَةَ بِهَذَا الإِسْنَادِ. وَفِى حَدِيثِ عِيسَى « ثُمَّ يُسْتَسْعَى فِى نَصِيبِ الَّذِى لَمْ يُعْتِقْ غَيْرَ مَشْقُوقٍ عَلَيْهِ »."
            },
            {
                "hadithNo": "4335",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from 'Imran bin Husain that a man declared that six slaves of his would be set free when he died, but he did not have any other wealth apart from them. The Messenger of Allah (s.a.w) called for them and divided them into three groups, then he cast lots among them, freeing two and leaving four as slaves, and he spoke harsh words to him.",
                "hadithArabic": "حَدَّثَنَا عَلِىُّ بْنُ حُجْرٍ السَّعْدِىُّ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ أَيُّوبَ عَنْ أَبِى قِلاَبَةَ عَنْ أَبِى الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ. أَنَّ رَجُلاً أَعْتَقَ سِتَّةَ مَمْلُوكِينَ لَهُ عِنْدَ مَوْتِهِ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَدَعَا بِهِمْ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَجَزَّأَهُمْ أَثْلاَثًا ثُمَّ أَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً وَقَالَ لَهُ قَوْلاً شَدِيدًا."
            },
            {
                "hadithNo": "4336",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Ayyub with this chain (a Hadith similar to no. 4335). As for Hammad (a narrator), his Hadith is like the report of Ibn 'Ulayyah (no. 4335). As for Ath-Thaqafi, in his Hadith it says: \"That a man from among the Ansar left instructions that when he died, his six slaves would be set free.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حَمَّادٌ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِى عُمَرَ عَنِ الثَّقَفِىِّ كِلاَهُمَا عَنْ أَيُّوبَ بِهَذَا الإِسْنَادِ. أَمَّا حَمَّادٌ فَحَدِيثُهُ كَرِوَايَةِ ابْنِ عُلَيَّةَ وَأَمَّا الثَّقَفِىُّ فَفِى حَدِيثِهِ أَنَّ رَجُلاً مِنَ الأَنْصَارِ أَوْصَى عِنْدَ مَوْتِهِ فَأَعْتَقَ سِتَّةَ مَمْلُوكِينَ."
            },
            {
                "hadithNo": "4337",
                "chapterNo": "12",
                "hadithEnglish": "A Hadith like that of Ibn 'Ulayyah and Hammad (no. 4336) was narrated from 'Imran bin Husain, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ وَأَحْمَدُ بْنُ عَبْدَةَ قَالاَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ وَحَمَّادٍ."
            },
            {
                "hadithNo": "4338",
                "chapterNo": "13",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah that a man among the Ansar declared that a slave of his would become free after he died, and he did not own any other wealth apart from the slave. News of that reached the Prophet (s.a.w) and he said: \"Who will buy him from me?\" Nu'aim bin 'Abdullah bought him for a price of eight hundred Dirham, and he gave it to him. 'Amr said: \"I heard Jabir bin 'Abdullah say: 'He was a Coptic slave who died last year.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِىُّ حَدَّثَنَا حَمَّادٌ - يَعْنِى ابْنَ زَيْدٍ - عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَجُلاً مِنَ الأَنْصَارِ أَعْتَقَ غُلاَمًا لَهُ عَنْ دُبُرٍ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَبَلَغَ ذَلِكَ النَّبِىَّ -صلى الله عليه وسلم- فَقَالَ « مَنْ يَشْتَرِيهِ مِنِّى ». فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ بِثَمَانِمِائَةِ دِرْهَمٍ فَدَفَعَهَا إِلَيْهِ. قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ عَبْدًا قِبْطِيًّا مَاتَ عَامَ أَوَّلَ."
            },
            {
                "hadithNo": "4339",
                "chapterNo": "13",
                "hadithEnglish": "Sufyan bin 'Uyaynah narrated: \"'Amr heard Jabir say: 'A man among the Ansar declared that a slave of his would become free after he died, and he did not own any other wealth apart from him. The Messenger of Allah (s.a.w) sold him.\"' Jabir said: \"Ibn An-Nahham bought him, a Coptic slave who died last year, during the governorship of Ibn Az-Zubair.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ عَنِ ابْنِ عُيَيْنَةَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ سَمِعَ عَمْرٌو جَابِرًا يَقُولُ دَبَّرَ رَجُلٌ مِنَ الأَنْصَارِ غُلاَمًا لَهُ لَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَبَاعَهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم-. قَالَ جَابِرٌ فَاشْتَرَاهُ ابْنُ النَّحَّامِ عَبْدًا قِبْطِيًّا مَاتَ عَامَ أَوَّلَ فِى إِمَارَةِ ابْنِ الزُّبَيْرِ."
            },
            {
                "hadithNo": "4340",
                "chapterNo": "13",
                "hadithEnglish": "A Hadith like that of Hammad from 'Amr bin Dinar (no. 4338) was narrated from Jabir, from the Prophet (s.a.w), concerning the Mudabbar.",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ عَنْ أَبِى الزُّبَيْرِ عَنْ جَابِرٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم- فِى الْمُدَبَّرِ نَحْوَ حَدِيثِ حَمَّادٍ عَنْ عَمْرِو بْنِ دِينَارٍ."
            },
            {
                "hadithNo": "4341",
                "chapterNo": "13",
                "hadithEnglish": "It was narrated from 'Ata' bin Abi Rabah, Ibn Az-Zubair and 'Amr bin Dinar that Jabir bin 'Abdullah told them about the sale of a Mudabbar. All of them said, - a Hadith like that of Hammad and Ibn 'Uyaynah from 'Amr from Jabir (no. 4338, 4339).",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ - يَعْنِى الْحِزَامِىَّ - عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلٍ عَنْ عَطَاءِ بْنِ أَبِى رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ ح وَحَدَّثَنِى عَبْدُ اللَّهِ بْنُ هَاشِمٍ حَدَّثَنَا يَحْيَى - يَعْنِى ابْنَ سَعِيدٍ - عَنِ الْحُسَيْنِ بْنِ ذَكْوَانَ الْمُعَلِّمِ حَدَّثَنِى عَطَاءٌ عَنْ جَابِرٍ ح وَحَدَّثَنِى أَبُو غَسَّانَ الْمِسْمَعِىُّ حَدَّثَنَا مُعَاذٌ حَدَّثَنِى أَبِى عَنْ مَطَرٍ عَنْ عَطَاءِ بْنِ أَبِى رَبَاحٍ وَأَبِى الزُّبَيْرِ وَعَمْرِو بْنِ دِينَارٍ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ حَدَّثَهُمْ فِى بَيْعِ الْمُدَبَّرِ. كُلُّ هَؤُلاَءِ قَالَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمَعْنَى حَدِيثِ حَمَّادٍ وَابْنِ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ جَابِرٍ."
            }
        ]
    }
]