[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/049001",
        "Body":  "O ye who believe! put not yourselves forward before Allah and His\n\t\t\tApostle: But fear Allah: for Allah is He who hears and knows all\n\t\t\tthings. \u003cspan class=\u0027fn\u0027\u003e4919\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/049010",
        "Body":  "The believers are but a single Brotherhood: So make peace and\n\t\t\treconciliation between your two (contending) brothers: And fear\n\t\t\tAllah that ye may receive Mercy. \u003cspan class=\u0027fn\u0027\u003e4928\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/049011",
        "Body":  "O ye who believe! let not some men among you laugh at others: it\n\t\t\tmay be that the (latter) are better than the (former): Nor let\n\t\t\tsome women laugh at others: it may be that the (latter) are\n\t\t\tbetter than the (former): nor defame nor be sarcastic to each\n\t\t\tother nor call each other by (offensive) nicknames: Ill-seeming\n\t\t\tis a name connoting wickedness (to be used of one) after he has\n\t\t\tbelieved: And those who do not desist are (Indeed) doing wrong.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e4929\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e4930\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/049012",
        "Body":  "O ye who believe! avoid suspicion as much (as possible): for\n\t\t\tsuspicion in some cases is a sin: and spy not on each other nor\n\t\t\tspeak ill of each other behind their backs.  Would any of you\n\t\t\tlike to eat the flesh of his dead brother? Nay ye would abhor\n\t\t\tit...but fear Allah: for Allah is Oft-Returning Most Merciful.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e4931\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e4931\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e4932\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/049013",
        "Body":  "O mankind! We created you from a single (pair) of a male and a\n\t\t\tfemale and made you into nations and tribes that ye may know each\n\t\t\tother (not that ye may despise each other).  Verily the most\n\t\t\thonored of you in the sight of Allah is (he who is) the most\n\t\t\trighteous of you.  And Allah has full knowledge and is well\n\t\t\tacquainted (with all things). \u003cspan class=\u0027fn\u0027\u003e4933\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/049014",
        "Body":  "The desert Arabs say \"We believe.\" Say \"Ye have no faith; but ye\n\t\t\t(only) say `We have submitted our wills to Allah.\u0027 For not yet\n\t\t\thas Faith entered your hearts.\tBut if ye obey Allah and His\n\t\t\tApostle He will not belittle aught of your deeds: for Allah is\n\t\t\tOft-Forgiving Most Merciful.\" \u003cspan class=\u0027fn\u0027\u003e4934\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e4935\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/049015",
        "Body":  "Only those are Believers who have believed in Allah and His\n\t\t\tApostle and have never since doubted but have striven with their\n\t\t\tbelongings and their persons in the Cause of Allah: Such are the\n\t\t\tsincere ones."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/049016",
        "Body":  "Say: \"what! Will ye instruct Allah about your Religion?\" but\n\t\t\tAllah knows all that is in the heavens and on earth: He has full\n\t\t\tknowledge of all things. \u003cspan class=\u0027fn\u0027\u003e4936\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/049017",
        "Body":  "They impress on thee as favor that they have embraced Islam.  Say\n\t\t\t\"Count not your Islam as a favor upon me: Nay Allah has conferred\n\t\t\ta favor upon you that He has guided you to the Faith if ye be\n\t\t\ttrue and sincere. \u003cspan class=\u0027fn\u0027\u003e4937\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/049018",
        "Body":  "\"Verily Allah knows the secrets of the heavens and the earth: and\n\t\t\tAllah sees well all that ye do.\" \u003cspan class=\u0027fn\u0027\u003e4938\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/049002",
        "Body":  "O ye who believe! raise not your voices above the voice of the\n\t\t\tProphet nor speak aloud to him in talk as ye may speak aloud to\n\t\t\tone another lest your deeds become vain and ye perceive not.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e4920\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e4921\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/049003",
        "Body":  "Those that lower their voice in the presence of Allah\u0027s Apostle\n\t\t\ttheir hearts has Allah tested for piety: for them is Forgiveness\n\t\t\tand a great Reward. \u003cspan class=\u0027fn\u0027\u003e4922\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/049004",
        "Body":  "Those who shout out to thee from without the Inner Apartments\n\t\t\tmost of them lack understanding. \u003cspan class=\u0027fn\u0027\u003e4923\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/049005",
        "Body":  "If only they had patience until thou couldst come out to them it\n\t\t\twould be best for them: but Allah is Oft-Forgiving Most Merciful."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/049006",
        "Body":  "O ye who believe! if a wicked person comes to you with any news\n\t\t\tascertain the truth lest ye harm people unwittingly and\n\t\t\tafterwards become full of repentance for what ye have done.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e4924\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/049007",
        "Body":  "And know that among you is Allah\u0027s Apostle: were he in many\n\t\t\tmatters to follow your (wishes) ye would certainly fall into\n\t\t\tmisfortune: but Allah has endeared the Faith to you and has made\n\t\t\tit beautiful in your hearts and He has made hateful to you\n\t\t\tunbelief wickedness and rebellion: such indeed are those who walk\n\t\t\tin righteousness \u003cspan class=\u0027fn\u0027\u003e4925\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e4926\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/049008",
        "Body":  "A grace and favor from Allah; and Allah is full of Knowledge and\n\t\t\tWisdom."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "49",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/049009",
        "Body":  "If two parties among the Believers fall into a quarrel make ye\n\t\t\tpeace between them: but if one of them transgresses beyond bounds\n\t\t\tagainst the other then fight ye (all) against the one that\n\t\t\ttransgresses until it complies with the command of Allah; but if\n\t\t\tit complies then make peace between them with justice and be\n\t\t\tfair: for Allah loves those who are fair (and just).\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e4927\u003c/span\u003e"
    }
]
