[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "9",
        "bookName": "Book of Prayer Seeking Rain",
        "bookNameArabic": "كتاب صلاة الاستسقاء",
        "hadiths": [
            {
                "hadithNo": "2070",
                "chapterNo": "0",
                "hadithEnglish": "'Abdullah bin Zaid Al-Mazini said: \"The Messenger of Allah (s.a.w) went out to the prayer-place and prayed for rain, and he turned his Rida' around when he turned to face the Qiblah.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِى بَكْرٍ أَنَّهُ سَمِعَ عَبَّادَ بْنَ تَمِيمٍ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ زَيْدٍ الْمَازِنِىَّ يَقُولُ خَرَجَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِلَى الْمُصَلَّى فَاسْتَسْقَى وَحَوَّلَ رِدَاءَهُ حِينَ اسْتَقْبَلَ الْقِبْلَةَ."
            },
            {
                "hadithNo": "2071",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from 'Abbad bin Tamim that his paternal uncle said: \"The Prophet (s.a.w) went out to the prayer-place. He prayed for rain, turned to face the Qiblah, turned his Rida' around and prayed two Rak'ah.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِى بَكْرٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِ قَالَ خَرَجَ النَّبِىُّ -صلى الله عليه وسلم- إِلَى الْمُصَلَّى فَاسْتَسْقَى وَاسْتَقْبَلَ الْقِبْلَةَ وَقَلَبَ رِدَاءَهُ وَصَلَّى رَكْعَتَيْنِ."
            },
            {
                "hadithNo": "2072",
                "chapterNo": "0",
                "hadithEnglish": "'Abdullah bin Zaid Al-Ansari said: \"The Messenger of Allah (s.a.w) went out to the prayer-place to pray for rain. When he wanted to supplicate, he turned to face the Qiblah and turned his Rida' around.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ أَخْبَرَنِى أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرٍو أَنَّ عَبَّادَ بْنَ تَمِيمٍ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ زَيْدٍ الأَنْصَارِىَّ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- خَرَجَ إِلَى الْمُصَلَّى يَسْتَسْقِى وَأَنَّهُ لَمَّا أَرَادَ أَنْ يَدْعُوَ اسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ."
            },
            {
                "hadithNo": "2073",
                "chapterNo": "0",
                "hadithEnglish": "'Abbad bin Tamim Al-Mazini said that he heard his paternal uncle, who was one of the Companions of the Messenger of Allah (s.a.w), say: \"The Messenger of Allah (s.a.w) went out one day to pray for rain. He turned his back to the people, supplicating to Allah, and he turned to face the Qiblah and turned his Rida' around, then he prayed two Rak'ah.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِى عَبَّادُ بْنُ تَمِيمٍ الْمَازِنِىُّ أَنَّهُ سَمِعَ عَمَّهُ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- يَقُولُ خَرَجَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَوْمًا يَسْتَسْقِى فَجَعَلَ إِلَى النَّاسِ ظَهْرَهُ يَدْعُو اللَّهَ وَاسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ ثُمَّ صَلَّى رَكْعَتَيْنِ."
            },
            {
                "hadithNo": "2074",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Anas said: \"I saw the Messenger of Allah (s.a.w) raising his hands in supplication so much that the whiteness of his armpits could be seen.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ أَبِى بُكَيْرٍ عَنْ شُعْبَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ رَأَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَرْفَعُ يَدَيْهِ فِى الدُّعَاءِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ."
            },
            {
                "hadithNo": "2075",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Anas bin Malik that the Prophet (s.aw) prayed for rain, and he gestured with the backs of his hands towards the sky.",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- اسْتَسْقَى فَأَشَارَ بِظَهْرِ كَفَّيْهِ إِلَى السَّمَاءِ."
            },
            {
                "hadithNo": "2076",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Anas that the Prophet of Allah (s.a.w) used not to raise his hands in any supplication except when he was praying for rain, when (his raised his hands) so much that the whiteness of his armpits could be seen.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِى عَدِىٍّ وَعَبْدُ الأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ نَبِىَّ اللَّهِ -صلى الله عليه وسلم- كَانَ لاَ يَرْفَعُ يَدَيْهِ فِى شَىْءٍ مِنْ دُعَائِهِ إِلاَّ فِى الاِسْتِسْقَاءِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ. غَيْرَ أَنَّ عَبْدَ الأَعْلَى قَالَ يُرَى بَيَاضُ إِبْطِهِ أَوْ بَيَاضُ إِبْطَيْهِ."
            },
            {
                "hadithNo": "2077",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Qatadah that Anas bin Malik narrated a similar report to them from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ أَبِى عَرُوبَةَ عَنْ قَتَادَةَ أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ عَنِ النَّبِىِّ -صلى الله عليه وسلم- نَحْوَهُ."
            },
            {
                "hadithNo": "2078",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Anas bin Malik that a man entered the Masjid one Friday through the door that was nearest Dar Al-Qada', while the Messenger of Allah (s.a.w) was standing, delivering the Khutbah. He turned towards the Messenger of Allah (s.a.w) and said: \"O Messenger of Allah, our wealth has been destroyed and the roads are cut off. Pray to Allah to give us rain.\" The Messenger of Allah (s.a.w) raised his hands and said: \"Allahumma! Aghithna, Allahumma! Aghithna (O Allah, give us rain; O Allah, give us rain; O Allah, give us rain).\" Anas said: \"By Allah, we could not see any clouds in the sky, and between us and Sal' there were no houses. Then from behind it there appeared a cloud like a shield. When it reached the middle of the sky, it spread, then it began to rain. By Allah, we did not see the sun for a week. Then a man entered through that door during Jumu'ah when the Messenger of Allah (s.a.w) was standing, delivering the Khutbah; he turned to the Messenger of Allah (s.a.w) and said: 'O Messenger of Allah, our wealth has been destroyed and the roads are cut off. Pray to Allah to stop (the rain) for us.' The Messenger of Allah (s.a.w) raised his hands and said: 'Allahumma! Hawlana wa la 'alaina. Allahumma! 'Alal-akami waz-zirabi wa butunil-awdiyati wa manabitish-shajar (O Allah, around us and not on us! O Allah, on the hillocks and small mountains, the valley bottoms and places where trees grow.).' Then it stopped, and we went out walking in the sun.\" Sharik said: \"I asked Anas bin Malik: 'Was that the first man?' He said: 'I do not know.\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ عَنْ شَرِيكِ بْنِ أَبِى نَمِرٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَجُلاً دَخَلَ الْمَسْجِدَ يَوْمَ جُمُعَةٍ مِنْ بَابٍ كَانَ نَحْوَ دَارِ الْقَضَاءِ وَرَسُولُ اللَّهِ -صلى الله عليه وسلم- قَائِمٌ يَخْطُبُ فَاسْتَقْبَلَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَائِمًا ثُمَّ قَالَ يَا رَسُولَ اللَّهِ هَلَكَتِ الأَمْوَالُ وَانْقَطَعَتِ السُّبُلُ فَادْعُ اللَّهِ يُغِثْنَا. قَالَ فَرَفَعَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَدَيْهِ ثُمَّ قَالَ « اللَّهُمَّ أَغِثْنَا اللَّهُمَّ أَغِثْنَا اللَّهُمَّ أَغِثْنَا ». قَالَ أَنَسٌ وَلاَ وَاللَّهِ مَا نَرَى فِى السَّمَاءِ مِنْ سَحَابٍ وَلاَ قَزَعَةٍ وَمَا بَيْنَنَا وَبَيْنَ سَلْعٍ مِنْ بَيْتٍ وَلاَ دَارٍ - قَالَ - فَطَلَعَتْ مِنْ وَرَائِهِ سَحَابَةٌ مِثْلُ التُّرْسِ فَلَمَّا تَوَسَّطَتِ السَّمَاءَ انْتَشَرَتْ ثُمَّ أَمْطَرَتْ - قَالَ - فَلاَ وَاللَّهِ مَا رَأَيْنَا الشَّمْسَ سَبْتًا - قَالَ - ثُمَّ دَخَلَ رَجُلٌ مِنْ ذَلِكَ الْبَابِ فِى الْجُمُعَةِ الْمُقْبِلَةِ وَرَسُولُ اللَّهِ -صلى الله عليه وسلم- قَائِمٌ يَخْطُبُ فَاسْتَقْبَلَهُ قَائِمًا فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَتِ الأَمْوَالُ وَانْقَطَعَتِ السُّبُلُ فَادْعُ اللَّهَ يُمْسِكْهَا عَنَّا - قَالَ - فَرَفَعَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَدَيْهِ ثُمَّ قَالَ « اللَّهُمَّ حَوْلَنَا وَلاَ عَلَيْنَا اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ وَبُطُونِ الأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ ». فَانْقَلَعَتْ وَخَرَجْنَا نَمْشِى فِى الشَّمْسِ. قَالَ شَرِيكٌ فَسَأَلْتُ أَنَسَ بْنَ مَالِكٍ أَهُوَ الرَّجُلُ الأَوَّلُ قَالَ لاَ أَدْرِى."
            },
            {
                "hadithNo": "2079",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Anas bin Malik said: \"The people were stricken with a famine during the time of the Messenger of Allah (s.a.w). While the Messenger of Allah (s.a.w) was addressing the people from the Minbar one Friday, a Bedouin stood up and said: 'O Messenger of Allah, our wealth has been destroyed and our children are starving...\"' and he quoted a similar Hadith (as no. 2078), in which he said: Allahumma! Hawlana wa la 'alaina (O Allah, around us and not on us).\" And whichever direction he pointed to, the clouds broke up, until I saw Al-Madinah as if it were in a hole. The valley of Qanah flowed for a month, and no one came from any direction but he brought news of heavy rainfall.",
                "hadithArabic": "وَحَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنِ الأَوْزَاعِىِّ حَدَّثَنِى إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِى طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ أَصَابَتِ النَّاسَ سَنَةٌ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَبَيْنَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَخْطُبُ النَّاسَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ إِذْ قَامَ أَعْرَابِىٌّ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَ الْمَالُ وَجَاعَ الْعِيَالُ. وَسَاقَ الْحَدِيثَ بِمَعْنَاهُ. وَفِيهِ قَالَ « اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ». قَالَ فَمَا يُشِيرُ بِيَدِهِ إِلَى نَاحِيَةٍ إِلاَّ تَفَرَّجَتْ حَتَّى رَأَيْتُ الْمَدِينَةَ فِى مِثْلِ الْجَوْبَةِ وَسَالَ وَادِى قَنَاةَ شَهْرًا. وَلَمْ يَجِئْ أَحَدٌ مِنْ نَاحِيَةٍ إِلاَّ أَخْبَرَ بِجَوْدٍ."
            },
            {
                "hadithNo": "2080",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated that Anas bin Malik said: \"The Prophet (s.a.w) was delivering the Khutbah one Friday when the people stood up and shouted: 'O Prophet of Allah, there is a drought and the trees have turned brown, and the animals are dying...\"' and he quoted the Hadith (as in no. 2078). In it, it was narrated from 'Abdul-A'la: \"and the clouds cleared from Al-Madinah and it started to rain around (the city), but not a drop fell in Al-Madinah itself. I looked at Al-Madinah and it was as if it were surrounded by a crown.\"",
                "hadithArabic": "وَحَدَّثَنِى عَبْدُ الأَعْلَى بْنُ حَمَّادٍ وَمُحَمَّدُ بْنُ أَبِى بَكْرٍ الْمُقَدَّمِىُّ قَالاَ حَدَّثَنَا مُعْتَمِرٌ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ ثَابِتٍ الْبُنَانِىِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ النَّبِىُّ -صلى الله عليه وسلم- يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَامَ إِلَيْهِ النَّاسُ فَصَاحُوا وَقَالُوا يَا نَبِىَّ اللَّهِ قَحِطَ الْمَطَرُ وَاحْمَرَّ الشَّجَرُ وَهَلَكَتِ الْبَهَائِمُ. وَسَاقَ الْحَدِيثَ وَفِيهِ مِنْ رِوَايَةِ عَبْدِ الأَعْلَى فَتَقَشَّعَتْ عَنِ الْمَدِينَةِ. فَجَعَلَتْ تُمْطِرُ حَوَالَيْهَا وَمَا تُمْطِرُ بِالْمَدِينَةِ قَطْرَةً. فَنَظَرْتُ إِلَى الْمَدِينَةِ وَإِنَّهَا لَفِى مِثْلِ الإِكْلِيلِ."
            },
            {
                "hadithNo": "2081",
                "chapterNo": "2",
                "hadithEnglish": "A similar report (as no. 2080) was narrated from Anas, and he added: \"Allah gathered the clouds and we stayed until a strong man among us would be concerned only with how he would be able to reach his family.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسٍ بِنَحْوِهِ وَزَادَ فَأَلَّفَ اللَّهُ بَيْنَ السَّحَابِ وَمَكَثْنَا حَتَّى رَأَيْتُ الرَّجُلَ الشَّدِيدَ تُهِمُّهُ نَفْسُهُ أَنْ يَأْتِىَ أَهْلَهُ."
            },
            {
                "hadithNo": "2082",
                "chapterNo": "2",
                "hadithEnglish": "Anas bin Malik said: \"A Bedouin came to the Messenger of Allah (s.a.w) one Friday, while he was on the Minbar...\" and he quoted the Hadith (as in 2080) and added: \"I saw the clouds clearing like a sheet being folded.\"",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِى أُسَامَةُ أَنَّ حَفْصَ بْنَ عُبَيْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ حَدَّثَهُ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُ جَاءَ أَعْرَابِىٌّ إِلَى رَسُولِ اللَّهِ -صلى الله عليه وسلم- يَوْمَ الْجُمُعَةِ وَهُوَ عَلَى الْمِنْبَرِ. وَاقْتَصَّ الْحَدِيثَ وَزَادَ فَرَأَيْتُ السَّحَابَ يَتَمَزَّقُ كَأَنَّهُ الْمُلاَءُ حِينَ تُطْوَى."
            },
            {
                "hadithNo": "2083",
                "chapterNo": "2",
                "hadithEnglish": "Anas said: \"When ·we were with the Messenger of Allah (s.a.w) it rained. The Messenger of Allah (s.a.w) lifted part of his garment so that the rain could fall on him. We said: 'O Messenger of Allah, why did you do that?' He said: 'Because it has just come from its Lord, the Mighty and Sublime.\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ ثَابِتٍ الْبُنَانِىِّ عَنْ أَنَسٍ قَالَ قَالَ أَنَسٌ أَصَابَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- مَطَرٌ قَالَ فَحَسَرَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- ثَوْبَهُ حَتَّى أَصَابَهُ مِنَ الْمَطَرِ. فَقُلْنَا يَا رَسُولَ اللَّهِ لِمَ صَنَعْتَ هَذَا قَالَ « لأَنَّهُ حَدِيثُ عَهْدٍ بِرَبِّهِ تَعَالَى »."
            },
            {
                "hadithNo": "2084",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from 'Ata' bin Abi Rabah that he heard 'Aishah, the wife of the Prophet (s.a.w), say: \"If it was a windy and cloudy day, the (reaction of) the Messenger of Allah (s.a.w) could be seen on his face, and he would pace back and forth. Then if it rained he would rejoice, and that (anxiety) would leave him.\" 'Aishah said: \"I asked him about that and he said: 'I was afraid that it might be a punishment that had been sent against my Ummah.' And when he saw the rain he would say: 'A mercy.\"'",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا سُلَيْمَانُ - يَعْنِى ابْنَ بِلاَلٍ - عَنْ جَعْفَرٍ - وَهُوَ ابْنُ مُحَمَّدٍ - عَنْ عَطَاءِ بْنِ أَبِى رَبَاحٍ أَنَّهُ سَمِعَ عَائِشَةَ زَوْجَ النَّبِىِّ -صلى الله عليه وسلم- تَقُولُ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِذَا كَانَ يَوْمُ الرِّيحِ وَالْغَيْمِ عُرِفَ ذَلِكَ فِى وَجْهِهِ أَقْبَلَ وَأَدْبَرَ فَإِذَا مَطَرَتْ سُرَّ بِهِ وَذَهَبَ عَنْهُ ذَلِكَ. قَالَتْ عَائِشَةُ فَسَأَلْتُهُ فَقَالَ « إِنِّى خَشِيتُ أَنْ يَكُونَ عَذَابًا سُلِّطَ عَلَى أُمَّتِى ». وَيَقُولُ إِذَا رَأَى الْمَطَرَ « رَحْمَةٌ »."
            },
            {
                "hadithNo": "2085",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that 'Aishah, the wife of the Prophet (s.a.w), said: \"If there was a stormy wind, the Messenger of Allah (s.a.w) would say: 'Allahumma Inni as'aluka khairaha, wa khaira ma fiha, wa khaira ma ursilat bihi wa a'udhu bika min sharriha, wa sharri ma fiha, wa sharri maa ursilat bih (O Allah, I ask You for its goodness and the goodness of that with which it has been sent, and I seek refuge with You from its evil and the evil of that with which it has been sent).' If there was thunder and lightening, his color would change, and he would go in and out (of the house) and pace back and forth, then if it rained he would feel relieved. 'Aishah noticed that and asked him. He said: 'Perhaps, O 'Aishah, it is as the people of 'Ad said: Then, when they saw it as a dense cloud coming towards their valleys, they said: This is a cloud bringing us rain!...\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ ابْنَ جُرَيْجٍ يُحَدِّثُنَا عَنْ عَطَاءِ بْنِ أَبِى رَبَاحٍ عَنْ عَائِشَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهَا قَالَتْ كَانَ النَّبِىُّ -صلى الله عليه وسلم- إِذَا عَصَفَتِ الرِّيحُ قَالَ « اللَّهُمَّ إِنِّى أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا فِيهَا وَخَيْرَ مَا أُرْسِلَتْ بِهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا وَشَرِّ مَا أُرْسِلَتْ بِهِ ». قَالَتْ وَإِذَا تَخَيَّلَتِ السَّمَاءُ تَغَيَّرَ لَوْنُهُ وَخَرَجَ وَدَخَلَ وَأَقْبَلَ وَأَدْبَرَ فَإِذَا مَطَرَتْ سُرِّىَ عَنْهُ فَعَرَفْتُ ذَلِكَ فِى وَجْهِهِ. قَالَتْ عَائِشَةُ فَسَأَلْتُهُ فَقَالَ « لَعَلَّهُ يَا عَائِشَةُ كَمَا قَالَ قَوْمُ عَادٍ (فَلَمَّا رَأَوْهُ عَارِضًا مُسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَذَا عَارِضٌ مُمْطِرُنَا) »."
            },
            {
                "hadithNo": "2086",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that 'Aishah, the wife of the Prophet (s.a.w), said: \"I never saw the Messenger of Allah (s.a.w) laughing so much that I could see his uvula; he only used to smile. If he saw a cloud or wind, (his reaction to that) could be seen on his face.\" She said: \"O Messenger of Allah, I see that when the people see a cloud, they rejoice, hoping that it is bringing rain, but when you see it, I can see on your face that you do not like it.\" He said: \"O 'Aishah, I cannot be sure that there is not a punishment in it, because some people were punished by means of the wind, and some people saw the punishment and said: \"This is a cloud bringing us rain!...\"",
                "hadithArabic": "وَحَدَّثَنِى هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ ح وَحَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ أَبَا النَّضْرِ حَدَّثَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَائِشَةَ زَوْجِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- مُسْتَجْمِعًا ضَاحِكًا حَتَّى أَرَى مِنْهُ لَهَوَاتِهِ إِنَّمَا كَانَ يَتَبَسَّمُ - قَالَتْ - وَكَانَ إِذَا رَأَى غَيْمًا أَوْ رِيحًا عُرِفَ ذَلِكَ فِى وَجْهِهِ. فَقَالَتْ يَا رَسُولَ اللَّهِ أَرَى النَّاسَ إِذَا رَأَوُا الْغَيْمَ فَرِحُوا. رَجَاءَ أَنْ يَكُونَ فِيهِ الْمَطَرُ وَأَرَاكَ إِذَا رَأَيْتَهُ عَرَفْتُ فِى وَجْهِكَ الْكَرَاهِيَةَ قَالَتْ فَقَالَ « يَا عَائِشَةُ مَا يُؤَمِّنُنِى أَنْ يَكُونَ فِيهِ عَذَابٌ قَدْ عُذِّبَ قَوْمٌ بِالرِّيحِ وَقَدْ رَأَى قَوْمٌ الْعَذَابَ فَقَالُوا (هَذَا عَارِضٌ مُمْطِرُنَا) »."
            },
            {
                "hadithNo": "2087",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Prophet (s.a.w) said: \"I have been helped by means of the east wind, and 'Ad were destroyed by means of the west wind.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنِ الْحَكَمِ عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهُ قَالَ « نُصِرْتُ بِالصَّبَا وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ »."
            },
            {
                "hadithNo": "2088",
                "chapterNo": "4",
                "hadithEnglish": "A similar report (as no. 2087) was narrated from Ibn 'Abbas, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانٍ الْجُعْفِىُّ حَدَّثَنَا عَبْدَةُ - يَعْنِى ابْنَ سُلَيْمَانَ - كِلاَهُمَا عَنِ الأَعْمَشِ عَنْ مَسْعُودِ بْنِ مَالِكٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمِثْلِهِ."
            }
        ]
    }
]