[
  {
    "SurahNumber": "13",
    "AyahNumber": "1",
    "NoteID": "1798",
    "Body": "For abbreviated Letters generally see Appendix 1."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "1",
    "NoteID": "1799",
    "Body": "Cf. x. 1, n. 1382."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "2",
    "NoteID": "1800",
    "Body": "Should we construe the clause \"that ye can see\" to refer\\n\\t\\t\\t\\tto \"pillars\" or \"to the heavens\"? Either is admissible,\\n\\t\\t\\t\\tbut I prefer the former. The heavens are supported on no\\n\\t\\t\\t\\tpillars that we can see. What we see is the blue vault of\\n\\t\\t\\t\\theaven, but there are invisible forces or conditions\\n\\t\\t\\t\\tcreated by Allah, which should impress us with His power\\n\\t\\t\\t\\tand glory."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "2",
    "NoteID": "1801",
    "Body": "Cf. x. 3, and n. 1386. We must not think that anything\\n\\t\\t\\t\\tcame into being by itself or carries out its functions by\\n\\t\\t\\t\\titself. Allah is the Creator from Whom everything has its\\n\\t\\t\\t\\tlife and being and through Whom everything is maintained\\n\\t\\t\\t\\tand supported, even though fixed laws are established for\\n\\t\\t\\t\\tits regulation and government. The \"term appointed\"\\n\\t\\t\\t\\tlimits the duration of their functioning: its ultimate\\n\\t\\t\\t\\treturn is to Allah, as its beginning proceeded from\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "2",
    "NoteID": "1802",
    "Body": "Cf. x. 31, n. 1425. Where the laws of nature are fixed,\\n\\t\\t\\t\\tand everything runs according to its appointed course,\\n\\t\\t\\t\\tthe government and regulation behind it is still that of\\n\\t\\t\\t\\tAllah. Where there is limited free will as in man, yet\\n\\t\\t\\t\\tthe ultimate source of man's faculties is Allah. Allah\\n\\t\\t\\t\\tcares for His creatures. He does not, as in the idea of\\n\\t\\t\\t\\tpolytheistic Greece, sit apart on Olympus, careless of\\n\\t\\t\\t\\tHis creatures."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "2",
    "NoteID": "1803",
    "Body": "One manifestation of His caring for His creatures, even\\n\\t\\t\\t\\twhere a limited amount of free-will is granted for their\\n\\t\\t\\t\\tdevelopment, is that He is careful to explain His Signs\\n\\t\\t\\t\\tboth in nature and in express and detailed revelation\\n\\t\\t\\t\\tthrough His Messengers, lest man should have any doubts\\n\\t\\t\\t\\twhether he has to return ultimately to his Lord and\\n\\t\\t\\t\\taccount for all his actions during the \"term appointed,\"\\n\\t\\t\\t\\twhen he was given some initiative by way of trial and\\n\\t\\t\\t\\tpreparation. If man attends carefully to the Signs, he\\n\\t\\t\\t\\tshould have no doubt whatever."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "3",
    "NoteID": "1804",
    "Body": "I think that this refers to sex in plants, and I see M.P.\\n\\t\\t\\t\\thas translated accordingly. Plants like animals have\\n\\t\\t\\t\\ttheir reproductive apparatus,-male stamens and female\\n\\t\\t\\t\\tpistils. In most cases the same flower combines both\\n\\t\\t\\t\\tstamens and pistils, but in some cases these organs are\\n\\t\\t\\t\\tspecialised in separate flowers, and in some cases, even\\n\\t\\t\\t\\tin separate trees. The date-palm of Arabia and the\\n\\t\\t\\t\\tPapaiya of India, are instances of fruit trees which are\\n\\t\\t\\t\\tuni-sexual."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "3",
    "NoteID": "1805",
    "Body": "Cf. vii. 54 and n. 1032. The whole passage there may be\\n\\t\\t\\t\\tcompared with the whole passage here. Both their\\n\\t\\t\\t\\tsimilarity and their variation show how closely reasoned\\n\\t\\t\\t\\teach argument is, with expressions exactly appropriate to\\n\\t\\t\\t\\teach occasion."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "4",
    "NoteID": "1806",
    "Body": "Does \"growing out of single roots or otherwise\" qualify\\n\\t\\t\\t\\t\"palm trees\" or \"vines\" and \"corn\" as well? The former\\n\\t\\t\\t\\tconstruction is adopted by the classical Commentators: in\\n\\t\\t\\t\\twhich case the reference is to the fact either that two\\n\\t\\t\\t\\tor more palm trees occasionally grow out of a single\\n\\t\\t\\t\\troot, or that palm trees grow sometimes as odd trees and\\n\\t\\t\\t\\tsometimes in great thick clusters. If the latter\\n\\t\\t\\t\\tconstruction is adopted, the reference would be to the\\n\\t\\t\\t\\tfact that date-palm (and palms generally) and some other\\n\\t\\t\\t\\tplants arise out of a single tap-root, while the majority\\n\\t\\t\\t\\tof trees arise out of a net-work of roots that spread out\\n\\t\\t\\t\\textensively. Here is adaptation to soil and water\\n\\t\\t\\t\\tconditions,-another Sign or wonder of Creation."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "4",
    "NoteID": "1807",
    "Body": "The date-palm, the crops of food-grains, and the\\n\\t\\t\\t\\tgrape-vine are all fed by the same kind of water, yet how\\n\\t\\t\\t\\tdifferent the harvests which they yield! And that applies\\n\\t\\t\\t\\tto all vegetation. The fruit or eatable produce may vary\\n\\t\\t\\t\\tin shape, size, colour, flavour, etc., in endless\\n\\t\\t\\t\\tvariety."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "5",
    "NoteID": "1808",
    "Body": "After seeing the Signs in nature and the Signs in\\n\\t\\t\\t\\trevelation, it is indeed strange that people should deny\\n\\t\\t\\t\\ttheir Creator. But if they admit the Signs of the\\n\\t\\t\\t\\tCreator, Who works marvels before their very eyes every\\n\\t\\t\\t\\tday, why should they doubt that when they are reduced to\\n\\t\\t\\t\\tdust, they can be raised up again? If one creation is\\n\\t\\t\\t\\tpossible, what difficulty can there be in accepting a\\n\\t\\t\\t\\trenewed creation? It becomes then a question of an\\n\\t\\t\\t\\tobstinate and rebellious will, for which the punishment\\n\\t\\t\\t\\tis described."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "5",
    "NoteID": "1809",
    "Body": "Aglal: yokes (of servitude): Cf. vii. 157 and n. 1128.\\n\\t\\t\\t\\tThe punishment may be conceived of in two stages:\\n\\t\\t\\t\\timmediately, yokes of servitude to superstition,\\n\\t\\t\\t\\tfalsehood, etc., as against the freedom in Faith; and\\n\\t\\t\\t\\tfinally, the Fire which burns the very soul."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "6",
    "NoteID": "1810",
    "Body": "The Unbelievers by way of a taunt say: \"If there is a\\n\\t\\t\\t\\tpunishment, let us see it come down now.\" The answer to\\n\\t\\t\\t\\tit is threefold. (1) Why do you want to see the\\n\\t\\t\\t\\tpunishment rather than the mercy of Allah? Which is\\n\\t\\t\\t\\tbetter? (2) Have you not heard in history of terrible\\n\\t\\t\\t\\tpunishments for evil? And have you not before your very\\n\\t\\t\\t\\teyes seen examples of wickedness brought to book? (3)\\n\\t\\t\\t\\tAllah works not only in justice and punishment, but also\\n\\t\\t\\t\\tin mercy and forgiveness, and mercy and forgiveness come\\n\\t\\t\\t\\tfirst."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "7",
    "NoteID": "1811",
    "Body": "After all the Signs that have just been mentioned it is\\n\\t\\t\\t\\tmere fractiousness to say, \"Bring down a Sign.\"\\n\\t\\t\\t\\tAl-Mustafa brought Signs and credentials as other\\n\\t\\t\\t\\tProphets did, and like them, refused to satisfy mere idle\\n\\t\\t\\t\\tcuriosity."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "7",
    "NoteID": "1812",
    "Body": "The last sentence of this verse has usually been\\n\\t\\t\\t\\tinterpreted to mean that the Prophet's function was\\n\\t\\t\\t\\tmerely to warn, and that guidance was sent by Allah to\\n\\t\\t\\t\\tevery nation through its Prophets. I think the following\\n\\t\\t\\t\\tinterpretation is equally possible: 'it is itself a Sign\\n\\t\\t\\t\\tthat Al-Mustafa should warn and preach and produce the\\n\\t\\t\\t\\tQur-an, and the guidance which he brings is universal\\n\\t\\t\\t\\tguidance, as from Allah."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "8",
    "NoteID": "1813",
    "Body": "The female womb is just an example, a type, of extreme\\n\\t\\t\\t\\tsecrecy. Not even the female herself knows what is in the\\n\\t\\t\\t\\twomb,-whether it is a male young or a female young,\\n\\t\\t\\t\\twhether it is one or more, whether it is to be born short\\n\\t\\t\\t\\tof the standard time or to exceed the standard time. But\\n\\t\\t\\t\\tthe most hidden and apparently unknowable things are\\n\\t\\t\\t\\tclear to Allah's knowledge: there is no mere chance; all\\n\\t\\t\\t\\tthings are regulated by Allah in just measure and\\n\\t\\t\\t\\tproportion. The general proposition comes in the last\\n\\t\\t\\t\\tsentence: \"every single thing is with Him in (due)\\n\\t\\t\\t\\tproportion.\""
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "9",
    "NoteID": "1814",
    "Body": "A verse of matchless rhythm in Arabic."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "10",
    "NoteID": "1815",
    "Body": "Our most hidden thoughts and motives are known to Him at\\n\\t\\t\\t\\tall times."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "11",
    "NoteID": "1816",
    "Body": "See last verse. Every person, whether he conceals or\\n\\t\\t\\t\\treveals his thoughts, whether he skulks in darkness or\\n\\t\\t\\t\\tgoes about by day,-all are under Allah's watch and ward.\\n\\t\\t\\t\\tHis grace encompasses everyone, and again and again\\n\\t\\t\\t\\tprotects him, if he will only take the protection, from\\n\\t\\t\\t\\tharm and evil. If in his folly he thinks he can secretly\\n\\t\\t\\t\\ttake some pleasure or profit, he is wrong, for recording\\n\\t\\t\\t\\tangels record all his thoughts and deeds."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "11",
    "NoteID": "1817",
    "Body": "Allah is not intent on punishment. He created man\\n\\t\\t\\t\\tvirtuous and pure; he gave him intelligence and\\n\\t\\t\\t\\tknowledge; he surrounded him with all sorts of\\n\\t\\t\\t\\tinstruments of His grace and mercy. If, in spite of all\\n\\t\\t\\t\\tthis, man distorts his own will and goes against Allah's\\n\\t\\t\\t\\tWill, yet is Allah's forgiveness open to him if he will\\n\\t\\t\\t\\ttake it. It is only when he has made his own sight blind\\n\\t\\t\\t\\tand changed his own nature or soul away from the\\n\\t\\t\\t\\tbeautiful mould in which Allah formed it, that Allah's\\n\\t\\t\\t\\tWrath will descend on him and the favourable position in\\n\\t\\t\\t\\twhich Allah placed him will be changed. When once the\\n\\t\\t\\t\\tpunishment comes, there is no turning it back. None of\\n\\t\\t\\t\\tthe things which he relied upon- other than Allah-can\\n\\t\\t\\t\\tpossibly protect him."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "12",
    "NoteID": "1818",
    "Body": "Here then is the climax to the answer of the sarcastic\\n\\t\\t\\t\\tchallenge of the Unbelievers for punishment, in language\\n\\t\\t\\t\\tof great sublimity. Why look to evil rather than to\\n\\t\\t\\t\\tgood?-to punishment rather than to mercy?-to the fear in\\n\\t\\t\\t\\tthe force and fire of the lightning rather than to the\\n\\t\\t\\t\\thope of good and abundant crops in the rain which will\\n\\t\\t\\t\\tcome behind the lightning clouds?"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "13",
    "NoteID": "1819",
    "Body": "Nay, thunder itself, which may frighten you, is but a\\n\\t\\t\\t\\ttame and beneficent force before Him, declaring His\\n\\t\\t\\t\\tpraises, like the rest of creation. THUNDER thus aptly\\n\\t\\t\\t\\tgives the name to this Sura of contrasts, where what we\\n\\t\\t\\t\\tmay think terrible is shown to be really a submissive\\n\\t\\t\\t\\tinstrument of good in Allah's hands."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "13",
    "NoteID": "1820",
    "Body": "And the angels, whom we think to be beautiful creatures\\n\\t\\t\\t\\tof power and glory nearest to Allah, yet feel reverence\\n\\t\\t\\t\\tand awe even as they praise His holy name."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "13",
    "NoteID": "1821",
    "Body": "Who is puny man, to call Allah in question? Cf. some\\n\\t\\t\\t\\tvariations on this theme in the Book of Job, e.g.\\n\\t\\t\\t\\tchapters 38 to 41."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "14",
    "NoteID": "1822",
    "Body": "Haqq=truth; right; what is due, befitting, proper. All\\n\\t\\t\\t\\tthese meanings are to be understood here. If we worship\\n\\t\\t\\t\\tanything other than Allah (whether it is idols, stars,\\n\\t\\t\\t\\tpowers of nature, spirits, or deified men, or Self, or\\n\\t\\t\\t\\tPower, or Wealth, Science or Art, Talent or Intellect),\\n\\t\\t\\t\\tour worship is both foolish and futile."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "14",
    "NoteID": "1823",
    "Body": "Without Faith, it is obvious that prayer or worship has\\n\\t\\t\\t\\tno meaning whatever. It is but an aberration of the mind.\\n\\t\\t\\t\\tBut there is a deeper meaning. You may have false faith,\\n\\t\\t\\t\\tas in superstitions or in worshipping things other than\\n\\t\\t\\t\\tAllah, as explained in the last note. In that case, too,\\n\\t\\t\\t\\tyou are pursuing mere phantoms of the mind. When you come\\n\\t\\t\\t\\tto examine it, it is mere imbecility or futility. Worship\\n\\t\\t\\t\\tand prayer are justified only to Allah, the One True God."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "15",
    "NoteID": "1824",
    "Body": "Notice that the original of what I have translated\\n\\t\\t\\t\\t\"whatever being\" is the personal pronoun man, not ma.\\n\\t\\t\\t\\tThis then refers to beings with a personality, e.g.,\\n\\t\\t\\t\\tangels, spirits, human beings, and possibly other things\\n\\t\\t\\t\\tof objective (not necessarily material) existence, as\\n\\t\\t\\t\\tcontrasted with their Shadows or Simulacra or\\n\\t\\t\\t\\tAppearances, or Phantasms, mentioned at the end of the\\n\\t\\t\\t\\tverse. Both these Beings and their Shadows are subject to\\n\\t\\t\\t\\tthe Will of Allah. See notes 1825 and 1827."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "15",
    "NoteID": "1825",
    "Body": "\"Prostrate themselves\": the posture means that they\\n\\t\\t\\t\\trecognise their subjection to Allah's Will and Law,\\n\\t\\t\\t\\twhether they wish it or not."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "15",
    "NoteID": "1826",
    "Body": "\"In spite of themselves\": Satan and Evil. They would like\\n\\t\\t\\t\\tto get away from the control of the All-good Allah, but\\n\\t\\t\\t\\tthey cannot, and they have to acknowledge His supremacy\\n\\t\\t\\t\\tand lordship over them."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "15",
    "NoteID": "1827",
    "Body": "Even the Shadows-creations of the Imagination, or\\n\\t\\t\\t\\tprojections from other things and dependent on the other\\n\\t\\t\\t\\tthings for their existence, as shadows are to substance-\\n\\t\\t\\t\\teven such shadows are subject to Allah's Laws and Will,\\n\\t\\t\\t\\tand cannot arise or have any effect on our minds except\\n\\t\\t\\t\\tby His permission. The Shadows are longest and therefore\\n\\t\\t\\t\\tmost prominent when the sun is level, and tend to\\n\\t\\t\\t\\tdisappear as the sun approaches the zenith. But even when\\n\\t\\t\\t\\tthey are longest and most prominent, they are still\\n\\t\\t\\t\\tsubject to Allah's Will and Law."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "16",
    "NoteID": "1828",
    "Body": "The meaning of \"Rabb\" is explained in n. 20, to i. 2."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "16",
    "NoteID": "1829",
    "Body": "Cf. v. 76."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "16",
    "NoteID": "1830",
    "Body": "This verse may be analysed into six parts, each two parts\\n\\t\\t\\t\\tgoing together like question and answer. Each except the\\n\\t\\t\\t\\tfifth part is introduced by the word \"Say\", which is\\n\\t\\t\\t\\tequivalent in old Arabic to inverted commas. The fifth\\n\\t\\t\\t\\tpart, \"or do they assign .... similar?\" is not introduced\\n\\t\\t\\t\\tby \"Say\", because it is in the indirect form. (1) Who is\\n\\t\\t\\t\\tthe Lord and Sustainer of the Worlds? It is Allah, (2)\\n\\t\\t\\t\\tAnd yet you worship other gods? No, no one can be equal\\n\\t\\t\\t\\tto Him, any more than darkness is equal to light. (3)\\n\\t\\t\\t\\tYour other gods have created nothing by which you can be\\n\\t\\t\\t\\tmisled? No indeed; He is the only Creator, the One and\\n\\t\\t\\t\\tSupreme."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "17",
    "NoteID": "1831",
    "Body": "This verse is full of parables. (1) It is Allah Who sends\\n\\t\\t\\t\\train and sends it to all. See how it flows in different\\n\\t\\t\\t\\tchannels according to their capacities. Some are\\n\\t\\t\\t\\tsluggish-, some have a swift current. Some form great\\n\\t\\t\\t\\trivers and irrigate wide tracts of country; some are\\n\\t\\t\\t\\tclear crystal streams, perhaps in hilly tracts, with beds\\n\\t\\t\\t\\tof clean pebbles which you can see through the water.\\n\\t\\t\\t\\tSome produce delicious edible fish; and some are infested\\n\\t\\t\\t\\tby crocodiles or injurious monsters. And there are\\n\\t\\t\\t\\tdegrees and degrees among brooks, streams, lakes, rivers,\\n\\t\\t\\t\\tand seas. So with the rain of Allah's mercy and the\\n\\t\\t\\t\\tknowledge and wisdom and guidance which He sends. All can\\n\\t\\t\\t\\treceive it. Different ones will respond according to\\n\\t\\t\\t\\ttheir capacities. (2) In the physical world, water is\\n\\t\\t\\t\\tpure and beneficial. But froth and scum will gather\\n\\t\\t\\t\\taccording to local conditions. As the floods will carry\\n\\t\\t\\t\\toff the scum and purify the water, so will the flood of\\n\\t\\t\\t\\tAllah's spiritual mercy carry away our spiritual scum and\\n\\t\\t\\t\\tpurify the water. (3) The froth may make a greater show\\n\\t\\t\\t\\ton the surface, but it will not last. So will there be\\n\\t\\t\\t\\tfrothy knowledge, which will disappear, but Allah's Truth\\n\\t\\t\\t\\twill endure."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "17",
    "NoteID": "1832",
    "Body": "In continuation of the last note, the fourth parable is\\n\\t\\t\\t\\tthat of metal ores: (4) the ore is full of baser\\n\\t\\t\\t\\tadmixture, but the fire will separate the gold from the\\n\\t\\t\\t\\tdross for ornaments, or (5) some metal of household\\n\\t\\t\\t\\tutility, with which you make every-day utensils, which\\n\\t\\t\\t\\tthe fire will separate from admixtures which you do not\\n\\t\\t\\t\\twant. So the fire of Allah's test, either by adversity or\\n\\t\\t\\t\\tby affluence, will search out the true metal in us and\\n\\t\\t\\t\\treject the dross. It will show us what is valuable or\\n\\t\\t\\t\\twhat is useful, all sorts of scum and vanity which we\\n\\t\\t\\t\\tcollect and miscall knowledge."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "18",
    "NoteID": "1833",
    "Body": "Cf. iii. 91 and x. 54."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "19",
    "NoteID": "1834",
    "Body": "In this section the contrast between Faith and\\n\\t\\t\\t\\tRighteousness on the one hand and Infidelity and Evil on\\n\\t\\t\\t\\tthe other is set out. The righteous man is known as one\\n\\t\\t\\t\\twho (1) receives admonition; (2) is true to his\\n\\t\\t\\t\\tcovenants; (3) follows the universal Religion of Faith\\n\\t\\t\\t\\tand Practice joined together; (4) is patient and\\n\\t\\t\\t\\tpersevering in seeking Allah; and in practical matters he\\n\\t\\t\\t\\tis known to be; (5) regular in prayer; (6) generous in\\n\\t\\t\\t\\ttrue charity, whether open or secret; and (7) not\\n\\t\\t\\t\\trevengeful, but anxious to turn off evil with good, thus\\n\\t\\t\\t\\tbreaking the chain of evil which tends to perpetuate\\n\\t\\t\\t\\titself."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "21",
    "NoteID": "1835",
    "Body": "That is, join faith with practice, love of God with love\\n\\t\\t\\t\\tof man, and respect for all Prophets alike, i.e., follow\\n\\t\\t\\t\\tthe right Religion, and not odd bits of it."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "22",
    "NoteID": "1836",
    "Body": "Their journey in this life was at best a sojourn. The\\n\\t\\t\\t\\tHeaven is their eternal Home, which is further prefigured\\n\\t\\t\\t\\tin the two following verses."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "23",
    "NoteID": "1837",
    "Body": "The relationships of this life are temporal, but love in\\n\\t\\t\\t\\trighteousness is eternal."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "25",
    "NoteID": "1838",
    "Body": "This is the opposite of the things explained in xiii. 21\\n\\t\\t\\t\\tabove, n. 1835."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "25",
    "NoteID": "1839",
    "Body": "This is in contrast to the state of the blessed,\\n\\t\\t\\t\\tdescribed in xiii. 22-24 above, The Curse is the opposite\\n\\t\\t\\t\\tof the Bliss, and the Terrible Home is the opposite of\\n\\t\\t\\t\\tthe Eternal Home, the Gardens of perpetual bliss."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "26",
    "NoteID": "1840",
    "Body": "Allah, the Sustainer and Cherisher of all His creatures,\\n\\t\\t\\t\\tgives sustenance to all. To some He grants it in\\n\\t\\t\\t\\tabundance; to others He gives it in strict measure. No\\n\\t\\t\\t\\tone can question Him, for His Will is supreme, and it is\\n\\t\\t\\t\\tthe measure of all good."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "26",
    "NoteID": "1841",
    "Body": "Cf. ix. 38. The meaning here may also be: This present\\n\\t\\t\\t\\tlife is just a furniture, a convenience, a stepping\\n\\t\\t\\t\\tstone, a probation, for the life to come. In itself it is\\n\\t\\t\\t\\tless important than the Hereafter."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "27",
    "NoteID": "1842",
    "Body": "The question is repeated from xiii. 7 above; for the line\\n\\t\\t\\t\\tof reasoning there suggested in answer is now completed,\\n\\t\\t\\t\\tand another line of reasoning is now taken up. Allah\\n\\t\\t\\t\\tprovides every guidance for those who turn to Him in\\n\\t\\t\\t\\tpenitence, but He will leave those to wander astray who\\n\\t\\t\\t\\tdeliberately close their eyes and their hearts to His\\n\\t\\t\\t\\tgrace and the comfort that comes from remembering Him and\\n\\t\\t\\t\\tcelebrating His praises."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "28",
    "NoteID": "1843",
    "Body": "The Sign or Miracle is not something external: it is\\n\\t\\t\\t\\tsomething internal, something in your mind, heart, and\\n\\t\\t\\t\\tsoul. It depends on your inner spiritual experience. If\\n\\t\\t\\t\\tyou turn to Allah, that light, that experience, will\\n\\t\\t\\t\\tcome. If you do not, Allah will not force you."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "29",
    "NoteID": "1844",
    "Body": "\"Blessedness\": Tuba: an internal state of satisfaction,\\n\\t\\t\\t\\tan inward joy which is difficult to describe in words,\\n\\t\\t\\t\\tbut which reflects itself in the life of the good man,\\n\\t\\t\\t\\tthrough good and ill fortune, through good report and\\n\\t\\t\\t\\tevil. And then, there is always the final goal to which\\n\\t\\t\\t\\this eyes are turned, the beautiful Home of rest in the\\n\\t\\t\\t\\tHereafter, after this life's struggles are over. That\\n\\t\\t\\t\\tgoal is Allah Himself."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "30",
    "NoteID": "1845",
    "Body": "Our Prophet came later in time than other Prophets, to\\n\\t\\t\\t\\tcomplete their Message and universalise Religion. And\\n\\t\\t\\t\\tcertainly it is after his age that the process of the\\n\\t\\t\\t\\tunification of the world began. That process is not\\n\\t\\t\\t\\tcomplete yet, but is proceeding apace."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "30",
    "NoteID": "1846",
    "Body": "Faith tells us that no amount of opposition from\\n\\t\\t\\t\\tUnbelievers can ever stop Allah's Plan."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "31",
    "NoteID": "1847",
    "Body": "Everything is possible and in Allah's power. His Plan is\\n\\t\\t\\t\\tbeneficient and all-embracing. But it is not for His\\n\\t\\t\\t\\tcreatures to dictate to Him, or demand what He should do,\\n\\t\\t\\t\\tor how He should do it. The Command is with Allah in all\\n\\t\\t\\t\\tthings. The Believers know His omnipotence, and they also\\n\\t\\t\\t\\tknow that He will order His world for the best."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "31",
    "NoteID": "1848",
    "Body": "Let not the Unbelievers think that if they seem to\\n\\t\\t\\t\\tprosper for a time, that is the end of the matter. They\\n\\t\\t\\t\\tare warned about three things. (1) their ill deeds must\\n\\t\\t\\t\\tcarry evil consequences for them all the time, though\\n\\t\\t\\t\\tthey may not perceive them for a certain time. (2) Their\\n\\t\\t\\t\\thomes, their places of resort, the circles in which they\\n\\t\\t\\t\\tmove, will also be haunted by their ill deeds and their\\n\\t\\t\\t\\tconsequences. For evil makes a complex of its\\n\\t\\t\\t\\tenvironment. The walls of Jericho, when they fall, must\\n\\t\\t\\t\\tbring down all Jericho in its ruins. (3) The ultimate\\n\\t\\t\\t\\tDisaster, the final Reckoning, must come, for Allah never\\n\\t\\t\\t\\tfails in His promise. True values must eventually be\\n\\t\\t\\t\\trestored: the good to the good, and the evil to the evil,\\n\\t\\t\\t\\tThe Commentators draw illustrations from the life of the\\n\\t\\t\\t\\tProphet, his exile from Makkah, and his restoration. A\\n\\t\\t\\t\\tsimilar miracle works in all history. But the Command is\\n\\t\\t\\t\\twith Allah."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "32",
    "NoteID": "1849",
    "Body": "Cf. vi. 10."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "32",
    "NoteID": "1850",
    "Body": "The punishment was in many cases deferred. But when it\\n\\t\\t\\t\\tdid come, how terrible and exemplary it was!"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "33",
    "NoteID": "1851",
    "Body": "Cf. xii. 40. 'You have but to name your false gods, and\\n\\t\\t\\t\\tyou will see that they are nothing but names. There is no\\n\\t\\t\\t\\treality behind them, whereas Allah is the One great\\n\\t\\t\\t\\tReality. He penetrates everything through and through and\\n\\t\\t\\t\\tknows all things. Do you dare to tell Him of something on\\n\\t\\t\\t\\tearth that He does not know? Or is it just a trick or a\\n\\t\\t\\t\\tshow of words?"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "33",
    "NoteID": "1852",
    "Body": "All pretences and fancies seem attractive to their\\n\\t\\t\\t\\tinventors, but alas! They are a great obstruction to the\\n\\t\\t\\t\\tPath of Religion and Truth. However, if by their\\n\\t\\t\\t\\tcontumacy, they have cut themselves off from Allah's\\n\\t\\t\\t\\tgrace, who can guide them or reclaim them from their\\n\\t\\t\\t\\terrors?"
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "34",
    "NoteID": "1853",
    "Body": "The consequences of sin may be felt in this life itself,\\n\\t\\t\\t\\tbut they are nothing compared to the final penalties in\\n\\t\\t\\t\\tthe life to come."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "35",
    "NoteID": "1854",
    "Body": "For the comprehensive meaning of the root akala\\n\\t\\t\\t\\t(literally \"to eat\"), see v. 66, n. 776. In its derived\\n\\t\\t\\t\\tmeaning it means fruit and enjoyment of all kinds,\\n\\t\\t\\t\\tspiritual as well as other. The joys of heaven are not\\n\\t\\t\\t\\tlike the joys of the earth, which fade away or cloy. The\\n\\t\\t\\t\\tjoys of heaven are pure, lasting, and without any of the\\n\\t\\t\\t\\tdrawbacks which we associate with the joys of the sense."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "35",
    "NoteID": "1855",
    "Body": "Zillun: literally shade, hence, shelter, protection,\\n\\t\\t\\t\\tsecurity. All these meanings are implied. Shade is one of\\n\\t\\t\\t\\tthe delights of a garden. Cf. iv. 57 and n. 579."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "35",
    "NoteID": "1856",
    "Body": "In this, as in other places, the Fire is contrasted with\\n\\t\\t\\t\\tthe Garden, as Misery is contrasted with Bliss. We can\\n\\t\\t\\t\\talso imagine other incidents in contrast with those of\\n\\t\\t\\t\\tthe Garden, e.g., with the Fire will be drought, aridity,\\n\\t\\t\\t\\tthirst, instead of beautiful rivers; pain and suffering,\\n\\t\\t\\t\\tinstead of perpetual delight; no protection against the\\n\\t\\t\\t\\tfierceness of the heat, as contrasted with the cool\\n\\t\\t\\t\\tshades ever deepening as you proceed in the Garden."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "36",
    "NoteID": "1857",
    "Body": "The Book: in a general sense, Revelation. \"Those to whom\\n\\t\\t\\t\\tthe Book hath been given\" are both (1) the People of the\\n\\t\\t\\t\\tBook of previous revelations, who study the new\\n\\t\\t\\t\\tRevelation in Arabic without prejudice and find in it\\n\\t\\t\\t\\tconfirmation of what their ancestors had received and\\n\\t\\t\\t\\tbelieved in it, and (2) the Muslims who receive the\\n\\t\\t\\t\\tQur-an with such joy."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "36",
    "NoteID": "1858",
    "Body": "Ahzab (plural of hizb = parties, sects, troops, clans.\\n\\t\\t\\t\\tThe reference may be to the clans mentioned in xxx. 20\\n\\t\\t\\t\\tand 22 (that whole Sura is called Ahzab). But we can\\n\\t\\t\\t\\tunderstand it in a perfectly general sense. Among all\\n\\t\\t\\t\\tsections of the people there are persons who would\\n\\t\\t\\t\\treceive a portion of Allah's truth but reject whatever\\n\\t\\t\\t\\tdoes not suit them or fall in with their selfish aims or\\n\\t\\t\\t\\tvain desires. The proper answer to them is: Surely,\\n\\t\\t\\t\\tAllah's command is universal,-to worship and serve Him\\n\\t\\t\\t\\tand refuse to bend the knee to any other; the man of God\\n\\t\\t\\t\\tfinds his staff and support in it; but he must invite all\\n\\t\\t\\t\\tto share in its blessings; it came from Allah, and to\\n\\t\\t\\t\\tAllah shall we all return."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "37",
    "NoteID": "1859",
    "Body": "The Qur-an is in Arabic; therefore the Arabs, among whom\\n\\t\\t\\t\\tit was promulgated, could have no difficulty in\\n\\t\\t\\t\\tunderstanding its precepts and using it in judging of\\n\\t\\t\\t\\tright and wrong in all their affairs. But it is also\\n\\t\\t\\t\\tuniversal; therefore no one should give preference to his\\n\\t\\t\\t\\town vain fancies against this authoritative declaration."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "37",
    "NoteID": "1860",
    "Body": "Cf. ii. 120. The variation is in the single word \"Waq\"\\n\\t\\t\\t\\there in place of \"Nasir\" in ii. 120. In each case the apt\\n\\t\\t\\t\\tword is chosen not only for the rhythm in its own passage\\n\\t\\t\\t\\tbut for the general meaning in the Argument."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "38",
    "NoteID": "1861",
    "Body": "All the Prophets of whom we have any detailed knowledge,\\n\\t\\t\\t\\texcept one, had wives and children. The exception is\\n\\t\\t\\t\\tJesus the son of Mary. But his life was incomplete; his\\n\\t\\t\\t\\tministry barely lasted three years; his mission was\\n\\t\\t\\t\\tlimited; and he was not called upon to deal with the\\n\\t\\t\\t\\tmany-sided problems that arise in a highly organised\\n\\t\\t\\t\\tsociety or State. We pay equal respect to him, because he\\n\\t\\t\\t\\twas Allah's Messenger; but that is not to say that his\\n\\t\\t\\t\\tMessage covers the same universal ground as that of\\n\\t\\t\\t\\tAl-Mustafa. There is no reproach for a normal human being\\n\\t\\t\\t\\tif he lives a normal human life; there is glory if he\\n\\t\\t\\t\\tbeautifies it and sets a nobler example of virtue than\\n\\t\\t\\t\\tother men, as did Al-Mustafa."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "38",
    "NoteID": "1862",
    "Body": "No Prophet performed any Miracle or showed forth any\\n\\t\\t\\t\\t\"Signs,\" except as Allah willed. Allah's Will (Mashiyat)\\n\\t\\t\\t\\tis an all-wise, universal Plan, which is not formed for\\n\\t\\t\\t\\tthe benefit of one tribe or millat or of one age or\\n\\t\\t\\t\\tcountry (see also next verse). The greatest Miracle in\\n\\t\\t\\t\\thistory was and is the Qur-an. We can apprehend its\\n\\t\\t\\t\\tbeauty and grandeur today as much as did the people of\\n\\t\\t\\t\\tAl-Mustafa's day,-even more, as our collective knowledge\\n\\t\\t\\t\\tof nature and of Allah's creation has increased."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "38",
    "NoteID": "1863",
    "Body": "Kitab: means \"a Law decreed\" or \"a Decree established.\""
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "39",
    "NoteID": "1864",
    "Body": "Umm-ul-Kitab: Mother of the Book: the original foundation\\n\\t\\t\\t\\tof all revelation; the Essence of Allah's Will and Law.\\n\\t\\t\\t\\tCf. iii. 7, and n. 347."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "41",
    "NoteID": "1865",
    "Body": "In the Prophet's ministry at Makkah, the most\\n\\t\\t\\t\\tstiff-necked opposition came from the seat and centre of\\n\\t\\t\\t\\tpower in Makkah. The humbler people-the fringe of Makkan\\n\\t\\t\\t\\tsociety-came in readily, as also did some tribes round\\n\\t\\t\\t\\tabout Makkah. After the Hijrat there was a hard struggle\\n\\t\\t\\t\\tbetween Makkah and Madinah and at last the bloodless\\n\\t\\t\\t\\tconquest of Makkah in A.H. 8 made the Pagan structure\\n\\t\\t\\t\\tfinally collapse, though it had already been sapped to\\n\\t\\t\\t\\tits foundations. So, generally, Truth finds easiest\\n\\t\\t\\t\\tentrance through the humble and lowly, and not in the\\n\\t\\t\\t\\tbeginning at the headquarters of power, but in the\\n\\t\\t\\t\\tfulness of time it makes its way everywhere with\\n\\t\\t\\t\\tirresistible force."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "42",
    "NoteID": "1866",
    "Body": "Cf. iii. 54 and n. 393."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "43",
    "NoteID": "1867",
    "Body": "The enemies of Islam have to acknowledge that\\n\\t\\t\\t\\tAl-Mustafawas a great and noble character, but they deny\\n\\t\\t\\t\\this Prophethood. He could point to his credentials from\\n\\t\\t\\t\\tAllah in the work which he achieved, and the Qur-an which\\n\\t\\t\\t\\the brought."
  },
  {
    "SurahNumber": "13",
    "AyahNumber": "43",
    "NoteID": "1868",
    "Body": "That is, those who have knowledge of revelation generally\\n\\t\\t\\t\\twill recognise Allah's revelation in the holy Qur-an. An\\n\\t\\t\\t\\talternative reading is \"min 'indi-hi\", which is written\\n\\t\\t\\t\\tthe same in Arabic, with only three vowel points\\n\\t\\t\\t\\tdifferent. If we adopt that, the last clause will be:\\n\\t\\t\\t\\t\"and from Him is (all) knowledge of the Book\": i.e., 'as\\n\\t\\t\\t\\tall knowledge of the Book comes from Allah, the Qur-an\\n\\t\\t\\t\\talso bears witness to me'."
  }
]
