[
  {
    "SurahNumber": "59",
    "AyahNumber": "1",
    "Text": "All that is in the heavens and the earth glorifies Allah, and He\\n\\t\\t\\tis the Almighty, the All-Wise."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "2",
    "Text": "It is He Who drove the disbelievers from among the People of the\\n\\t\\t\\tBook (reference is to the Jewish tribe of Banu Al-Nadir) out of\\n\\t\\t\\ttheir homes at the first banishment. You did not think that they\\n\\t\\t\\twould ever go out; and they thought that their fortresses would\\n\\t\\t\\tdefend them from Allah, but the wrath of Allah came to them from\\n\\t\\t\\twhere they never expected - which casted such terror into their\\n\\t\\t\\thearts - that they destroyed their homes by their own hands as\\n\\t\\t\\twell as by the hands of the believers. So learn a lesson from\\n\\t\\t\\tthis example! O the people of insight."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "3",
    "Text": "Had Allah not decreed exile for them, He would certainly have\\n\\t\\t\\tpunished them in this world, and in the hereafter there shall be\\n\\t\\t\\tthe punishment of the fire for them,"
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "4",
    "Text": "because they set themselves up against Allah and His Rasool; and\\n\\t\\t\\the that set himself up against Allah should know that Allah is\\n\\t\\t\\tstern in retribution."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "5",
    "Text": "Whatever palm-trees you cut down or left them standing on their\\n\\t\\t\\troots, was by the leave of Allah, so that He might humiliate the\\n\\t\\t\\ttransgressors."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "6",
    "Text": "As for those spoils of theirs which Allah has bestowed on His\\n\\t\\t\\tRasool, you spurred neither cavalry nor camelry to capture them:\\n\\t\\t\\tbut Allah gives authority to His Rasools over whom He pleases,\\n\\t\\t\\tfor Allah has power over all things."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "7",
    "Text": "Whatever spoils from the dwellers of the township Allah has\\n\\t\\t\\tbestowed on His Rasool, shall belong to Allah, His Rasool,\\n\\t\\t\\tRasool's relatives, and to the orphans, the needy and the\\n\\t\\t\\ttravellers in need; so that it may not become the property of the\\n\\t\\t\\trich among you. Whatever the Rasool gives you, take it and from\\n\\t\\t\\twhatever he forbids you, refrain from it. Fear Allah; for Allah\\n\\t\\t\\tis stern in retribution."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "8",
    "Text": "A share of the spoils shall be given to the indigent Muhajirin\\n\\t\\t\\t(immigrants) who were driven out of their homes and their\\n\\t\\t\\tpossessions, and are seeking Allah's grace and His good pleasure\\n\\t\\t\\tand who want to help Allah and His Rasool: such are indeed the\\n\\t\\t\\ttrue believers."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "9",
    "Text": "A share of the spoils shall also be given to those who made their\\n\\t\\t\\tabode in Madinah (the Ansar) and believed even before the\\n\\t\\t\\tarrivals of the Muhajirin and love those who migrated to them and\\n\\t\\t\\tentertain no desire in their hearts for things given to them, and\\n\\t\\t\\tprefer those Muhajirin over themselves, even though they\\n\\t\\t\\tthemselves are poor. In fact those who are saved from the\\n\\t\\t\\tgreediness of hearts, are the ones who will achieve true success."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "10",
    "Text": "And it is also for those who came after them and say: \"Our Rabb!\\n\\t\\t\\tForgive us and our brothers who embraced the faith before us and\\n\\t\\t\\tdo not leave any malice in our hearts towards the believers. Our\\n\\t\\t\\tRabb! Surely You are the Kind, the Merciful.\""
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "11",
    "Text": "Have you not observed the hypocrites? They say to their fellow\\n\\t\\t\\tunbelievers among the people of the Book: \"If they drive you out,\\n\\t\\t\\twe will go with you. We will never obey anyone who seeks to harm\\n\\t\\t\\tyou. If you are attacked we will certainly help you.\" Allah bears\\n\\t\\t\\twitness that they are lying."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "12",
    "Text": "If the People of the Book are driven out, they will never go with\\n\\t\\t\\tthem, nor, if the people of the Book are attacked, will they help\\n\\t\\t\\tthem, and even if they help them, they will turn their backs;\\n\\t\\t\\tleaving them with no help at all."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "13",
    "Text": "In their hearts there is greater dread of you than of Allah,\\n\\t\\t\\tbecause they are a people devoid of understanding."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "14",
    "Text": "They will never fight against you together except in fortified\\n\\t\\t\\ttownships and from behind walls. Strong is their valor amongst\\n\\t\\t\\tthemselves; you think of them united whereas their hearts are\\n\\t\\t\\tdivided. This is because they are a people devoid of wisdom."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "15",
    "Text": "Their example is like those who have tasted, a short while before\\n\\t\\t\\tthem, the evil consequences of their deeds. They shall have a\\n\\t\\t\\tpainful punishment."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "16",
    "Text": "Their parable is like the Shaitan who says to man disbelieve, but\\n\\t\\t\\twhen man becomes a disbeliever, he says: \"I have nothing to do\\n\\t\\t\\twith you; I fear Allah, the Rabb of the worlds.\""
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "17",
    "Text": "The end of both will be that they will be tossed in hell and\\n\\t\\t\\tremain there forever. Thus shall be the reward of the wrongdoers."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "18",
    "Text": "O believers! Fear Allah and let every soul see what it is sending\\n\\t\\t\\tfor the morrow (Hereafter). Fear Allah, surely Allah is aware of\\n\\t\\t\\tall your actions."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "19",
    "Text": "Be not like those who forgot Allah, as a result Allah caused them\\n\\t\\t\\tto forget themselves, it is they who are the transgressors."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "20",
    "Text": "The companions of hell and the companions of paradise are not\\n\\t\\t\\tequals, of course the companions of paradise are far superior."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "21",
    "Text": "If We had sent down this Qur'an on a mountain, you would have\\n\\t\\t\\tseen it humble itself and split asunder from the fear of Allah,\\n\\t\\t\\tWe are citing this example for mankind, so that they may take\\n\\t\\t\\theed."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "22",
    "Text": "Allah is He, besides Whom there is no god, the Knower of the\\n\\t\\t\\tunseen and the seen. He is the Compassionate, the Merciful."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "23",
    "Text": "Allah is He, besides Whom there is no god, the King, the Holy,\\n\\t\\t\\tthe Giver of peace, the Granter of security, the Guardian, the\\n\\t\\t\\tAlmighty, the Irresistible, the Supreme: Glory be to Allah! He is\\n\\t\\t\\tfar above the shirk they commit (by associating other gods with\\n\\t\\t\\tHim)."
  },
  {
    "SurahNumber": "59",
    "AyahNumber": "24",
    "Text": "He is Allah, the Creator, the Evolver, the Modeler. His are the\\n\\t\\t\\tmost beautiful names. All that is in the heavens and the earth\\n\\t\\t\\tdeclares His glory, and He is the All-Mighty, the All-Wise."
  }
]
