[
  {
    "SurahNumber": "100",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Since the subsequent clauses refer to a parabolic,\\n\\t\\t\\t\\timaginary situation, the adjurative particle wa is more\\n\\t\\t\\t\\tsuitably rendered here as \"Oh\", instead of the rendering\\n\\t\\t\\t\\t\"Consider\" usually adopted by me, or the adjuration \"By\"\\n\\t\\t\\t\\tappearing in most other translations."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "5",
    "NoteID": "2",
    "Body": "I.e., blinded by clouds of dust and not knowing whether\\n\\t\\t\\t\\ttheir assault aims at friend or foe. The metaphoric image\\n\\t\\t\\t\\tdeveloped in the above five verses is closely connected\\n\\t\\t\\t\\twith the sequence, although this connection has never\\n\\t\\t\\t\\tbeen brought out by the classical commentators. The term\\n\\t\\t\\t\\tal-'adiyat undoubtedly denotes the war-horses, or\\n\\t\\t\\t\\tchargers, employed by the Arabs from time immemorial down\\n\\t\\t\\t\\tto the Middle Ages (the feminine gender of this term\\n\\t\\t\\t\\tbeing due to the fact that, as a rule, they preferred\\n\\t\\t\\t\\tmares to stallions). But whereas the conventional\\n\\t\\t\\t\\texplanation is based on the assumption that \"the\\n\\t\\t\\t\\tchargers\" symbolize here the believers' fight in God's\\n\\t\\t\\t\\tcause (jihad) and, therefore, represent something highly\\n\\t\\t\\t\\tcommendable, it takes no account whatever of the\\n\\t\\t\\t\\tdiscrepancy between so positive an imagery and the\\n\\t\\t\\t\\tcondemnation expressed in verses {6} ff., not to speak of\\n\\t\\t\\t\\tthe fact that such a conventional interpretation does not\\n\\t\\t\\t\\tprovide any logical link between the two parts of the\\n\\t\\t\\t\\tsurah. But since such a link must exist, and since verses\\n\\t\\t\\t\\t{6-11} are undoubtedly condemnatory, we must conclude\\n\\t\\t\\t\\tthat the first five verses, too, have the same - or, at\\n\\t\\t\\t\\tleast, a similar - character. This character becomes at\\n\\t\\t\\t\\tonce obvious if we dissociate ourselves from the\\n\\t\\t\\t\\tpreconceived notion that the imagery of \"the chargers\" is\\n\\t\\t\\t\\tused here in a laudatory sense. In fact, the opposite is\\n\\t\\t\\t\\tthe case. Beyond any doubt, \"the chargers\" symbolize the\\n\\t\\t\\t\\terring human soul or self - a soul devoid of all\\n\\t\\t\\t\\tspiritual direction, obsessed and ridden by all manner of\\n\\t\\t\\t\\twrong, selfish desires, madly, unseeingly rushing\\n\\t\\t\\t\\tonwards, unchecked by conscience or reason, blinded by\\n\\t\\t\\t\\tthe dust-clouds of confused and confusing appetites,\\n\\t\\t\\t\\tstorming into insoluble situations and, thus, into its\\n\\t\\t\\t\\town spiritual destruction."
  },
  {
    "SurahNumber": "100",
    "AyahNumber": "6",
    "NoteID": "3",
    "Body": "I.e., whenever he surrenders to his appetites, symbolised\\n\\t\\t\\t\\tby the madly storming chargers, he forgets God and his\\n\\t\\t\\t\\town responsibility to Him."
  }
]
