[
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "7",
    "NoteID": "29151",
    "Text": "  &nbsp;After many years of persecution in Mecca, the Prophet (&#65018;) and many of his early followers decided to emigrate secretly to Medina, about 250 miles to the north, leaving behind their homes and valuables, which were soon taken over by the pagans of Mecca. To avenge &nbsp;this financial loss, the Prophet (&#65018;) decided to capture an unarmed Meccan trade caravan headed by Abu Sufy&acirc;n, a Meccan chief. Eventually, the caravan escaped, but the Meccans mobilized an army of over 1000 well-armed soldiers, more than three times the size of the Muslim force. Many Muslims had hoped to capture the caravan without having to meet the Meccan army in battle. Although the Muslims were vastly outnumbered and lightly-armed, they still won this decisive battle.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "9",
    "NoteID": "29152",
    "Text": "  &nbsp;Five thousand angels in total, as mentioned in 3:125.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "11",
    "NoteID": "29153",
    "Text": "  &nbsp;This happened the night before the battle.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "17",
    "NoteID": "29154",
    "Text": "  &nbsp;Before the battle, the Prophet (&#65018;) threw a handful of sand at the disbelievers and prayed for their defeat.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "22",
    "NoteID": "29155",
    "Text": "  &nbsp;This refers metaphorically to the disbelievers who fail to see and hear the truth.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "26",
    "NoteID": "29156",
    "Text": "  &nbsp;i.e., Mecca.  "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "42",
    "NoteID": "29157",
    "Text": "  &nbsp;The battle was not planned since the Muslim force was after the caravan. Had the two armies made plans to meet in battle at that time and place, they both probably would have missed each other.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "59",
    "NoteID": "29158",
    "Text": "  &nbsp;Who survived the Battle of Badr.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "67",
    "NoteID": "29159",
    "Text": "  &nbsp;i.e., ransom.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "68",
    "NoteID": "29160",
    "Text": "  &nbsp;The decree that ransoming captives will be allowed.   "
  },
  {
    "BookCode": " MKT ",
    "SurahNumber": "8",
    "AyahNumber": "75",
    "NoteID": "29161",
    "Text": "  &nbsp;This verse ended a previous ruling that allowed inheritance between Muslims from Mecca (Al-Muh&acirc;jir&ucirc;n, the Emigrants) and Muslims from Medina (Al-An&#7779;&acirc;r, the Helpers). Now, only relatives can inherit from one another, whereas non-heirs can receive a share through bequest, up to one third of the estate. See&nbsp;4:7, 11-13, 32-33, and 176.   "
  }
]
