[
  {
    "SurahNumber": "85",
    "AyahNumber": "1",
    "NoteID": "6051",
    "Body": "Here is an appeal to three Signs in verses 1-3, and the\\n\\t\\t\\t\\tsubstantive proposition is in verses 4-8, a denunciation\\n\\t\\t\\t\\tof wicked persecutors of the votaries of Allah,\\n\\t\\t\\t\\tpersecutors who burnt righteous men for their Faith. The\\n\\t\\t\\t\\tthree Signs are: (1) the Glorious Sky, with the broad\\n\\t\\t\\t\\tbelt of the Constellations marking the twelve Signs of\\n\\t\\t\\t\\tthe Zodiac; (2) the Day of Judgment, when all evil will\\n\\t\\t\\t\\tbe punished; and (3) certain Persons that will be\\n\\t\\t\\t\\twitnesses, and certain Persons or things that will be the\\n\\t\\t\\t\\tsubjects of the witness. See the notes following."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "1",
    "NoteID": "6052",
    "Body": "See n. 1950 to xv. 16. The Stars of the Zodiac as well as\\n\\t\\t\\t\\tof other Constellations are like the eyes of the Night.\\n\\t\\t\\t\\tIt may be that crimes are committed in the darkness of\\n\\t\\t\\t\\tthe night. But countless eyes are watching all the time,\\n\\t\\t\\t\\tand every author of evil will be brought to book."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "2",
    "NoteID": "6053",
    "Body": "The Day of Judgment, when the Sinner will have to give an\\n\\t\\t\\t\\taccount of every deed, open or hidden, is not merely a\\n\\t\\t\\t\\tmatter of speculation. It is definitely promised in\\n\\t\\t\\t\\trevelation, and will inevitably come to pass. Woe then to\\n\\t\\t\\t\\tthe Sinners for their crimes."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "3",
    "NoteID": "6054",
    "Body": "The literal meaning is clear, but its metaphorical\\n\\t\\t\\t\\tapplication has been explained in a variety of ways by\\n\\t\\t\\t\\tdifferent Commentators. The words are fairly\\n\\t\\t\\t\\tcomprehensive, and should, I think, be understood in\\n\\t\\t\\t\\tconnection with Judgment. There the Witnesses may be: (1)\\n\\t\\t\\t\\tthe Prophets (iii. 81); Allah Himself (iii. 81, and x.\\n\\t\\t\\t\\t61); the Recording Angels (I. 21); the Sinner's own\\n\\t\\t\\t\\tmisused limbs (xxiv. 24); his record of deeds (xvii. 14);\\n\\t\\t\\t\\tor the Sinner himself (xvii. 14). The subject of the\\n\\t\\t\\t\\twitness may be the deed or crime, or the Sinner against\\n\\t\\t\\t\\twhom the testimony cries out. The appeal to these things\\n\\t\\t\\t\\tmeans that the Sinner cannot possibly escape the\\n\\t\\t\\t\\tconsequences of his crime. He should repent, seek Allah's\\n\\t\\t\\t\\tMercy, and amend his life."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "4",
    "NoteID": "6055",
    "Body": "Who were the makers of the pit of fire in which they burn\\n\\t\\t\\t\\tpeople for their Faith? The words are perfectly general,\\n\\t\\t\\t\\tand we need not search for particular names, except by\\n\\t\\t\\t\\tway of illustration. In ancient history, and in Medieval\\n\\t\\t\\t\\tEurope, many lives were sacrificed at the stake because\\n\\t\\t\\t\\tthe victims did not conform to the established religion.\\n\\t\\t\\t\\tIn Arab tradition there is the story of Abraham: Nimrud\\n\\t\\t\\t\\ttries to burn him to death, but on account of Abraham's\\n\\t\\t\\t\\tFaith, the fire became \"a means of safety for Abraham\":\\n\\t\\t\\t\\txxi. 69, and n. 2725. Another case cited is that of\\n\\t\\t\\t\\tZu-Nuwas, the last Himyarite King of Yemen, by religion a\\n\\t\\t\\t\\tJew, who persecuted the Christians of Najran and is said\\n\\t\\t\\t\\tto have burnt them to death. He seems to have lived in\\n\\t\\t\\t\\tthe latter half of the sixth Christian century, in the\\n\\t\\t\\t\\tgeneration immediately preceding the Prophet's birth in\\n\\t\\t\\t\\t570 A.D. While the words are perfectly general, a\\n\\t\\t\\t\\treference is suggested to the persecution to which the\\n\\t\\t\\t\\tearly Muslims were subjected by the Pagan Quraish. Among\\n\\t\\t\\t\\tother cruelties, they were stripped, and their skins were\\n\\t\\t\\t\\texposed to the burning rays of the Arabian summer sun."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "6",
    "NoteID": "6056",
    "Body": "The persecutors sat calmly to gloat over the agonies of\\n\\t\\t\\t\\ttheir victims in the well-fed fire."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "9",
    "NoteID": "6057",
    "Body": "It is suggested that the persecutors will richly deserve\\n\\t\\t\\t\\tto be punished in the Fire of Hell. That Punishment will\\n\\t\\t\\t\\tbe far more real and lasting than the undeserved cruelty\\n\\t\\t\\t\\twhich they inflicted on men for their Faith in the One\\n\\t\\t\\t\\tTrue God."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "10",
    "NoteID": "6058",
    "Body": "The \"Chastisement of the Burning Fire\" has been mentioned\\n\\t\\t\\t\\there in addition to the \"Penalty of Hell\". This assumes a\\n\\t\\t\\t\\tspecial significance in the background of the cruel\\n\\t\\t\\t\\tburning of the Faithful by the \"makers of the pit\". These\\n\\t\\t\\t\\tcriminals would be duly retributed by being subjected to\\n\\t\\t\\t\\ta similar kind of suffering that they had caused their\\n\\t\\t\\t\\tinnocent victims."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "11",
    "NoteID": "6059",
    "Body": "Cf. v. 119, ix. 72 and xxii. 19."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "11",
    "NoteID": "6060",
    "Body": "Cf. v. 119, n. 833."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "13",
    "NoteID": "6061",
    "Body": "For the various words for \"Creation\" and the ideas\\n\\t\\t\\t\\timplied in them, see n. 120 to ii. 117."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "16",
    "NoteID": "6062",
    "Body": "Allah's Will is itself the Word and the Deed. There is no\\n\\t\\t\\t\\tinterval between them. He does not change His mind. No\\n\\t\\t\\t\\tcircumstances whatever can come between His Will and the\\n\\t\\t\\t\\texecution thereof. Such are His Power and His Glory.\\n\\t\\t\\t\\tCompare it with that of men, described in the next two\\n\\t\\t\\t\\tverses."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "17",
    "NoteID": "6063",
    "Body": "In contrast to the real, all-embracing, and eternal power\\n\\t\\t\\t\\tof Allah, what are the forces of man at their best? Two\\n\\t\\t\\t\\texamples are mentioned. (1) Pharaoh was a proud monarch\\n\\t\\t\\t\\tof a powerful kingdom, with resources and organisation,\\n\\t\\t\\t\\tmaterial, moral, and intellectual, as good as any in the\\n\\t\\t\\t\\tworld. When he pitted himself against Allah's Prophet, he\\n\\t\\t\\t\\tand his forces were destroyed. See lxxix. 15-26. (2) The\\n\\t\\t\\t\\tThamud were great builders, and had a high standard of\\n\\t\\t\\t\\tmaterial civilization. But they defied the law of Allah\\n\\t\\t\\t\\tand perished. See vii. 73-79, and n. 1043."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "19",
    "NoteID": "6064",
    "Body": "In spite of the great examples of the past, by which\\n\\t\\t\\t\\thuman might and skill were shown to have availed nothing\\n\\t\\t\\t\\twhen the law of Allah was broken, the unbelievers persist\\n\\t\\t\\t\\t(in all ages) in defying that law. But Allah will know\\n\\t\\t\\t\\thow to deal with them."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "20",
    "NoteID": "6065",
    "Body": "Allah encompasses every thing. But the wicked will find\\n\\t\\t\\t\\tthemselves defeated not only in conditions that they\\n\\t\\t\\t\\tforesee, but from all sorts of unexpected directions,\\n\\t\\t\\t\\tperhaps from behind them, i.e., from the very people or\\n\\t\\t\\t\\tcircumstances which in their blindness they despised or\\n\\t\\t\\t\\tthought of as helping them."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "22",
    "NoteID": "6066",
    "Body": "\"Inscribed in a Tablet Preserved\", i.e. Allah's Message\\n\\t\\t\\t\\tis not ephemeral. It is eternal. The \"Tablet\" is\\n\\t\\t\\t\\t\"preserved\" or guarded from corruption: xv. 9: for\\n\\t\\t\\t\\tAllah's Message must endure for ever. That Message is the\\n\\t\\t\\t\\t\"Mother of the book\": see n. 347 to iii. 7."
  }
]
