[
    {
        "title":"Al-Muwatta",
        "text":"One of the earliest collections of Ahadith text based on the subjects of Islamic Law, compiled by Imam Malik Ibn Anas."
    },
    {
        "title":"Fiqh-us-Sunnah",
        "text":"The Ahadith collection about Fiqh (Islamic jurisprudence) written by Shaikh Sayyid Saabiq. Accepted by all the four major madhabs."
    },
    {
        "title":"Sahih Al-Bukhari",
        "text":"The most authentic Ahadith collection of the sunnah of Prophet Muhammad (PBUH) written by Imam Muhammad al-Bukhari."
    },
    {
        "title":"Sahih Muslim",
        "text":"One of the major and authentic Ahadith collection about the sunnah of Prophet Muhammad (PBUH) compiled by Imam Muslim ibn al-Hajjaj."
    },
    {
        "title":"An-Nawawi",
        "text":"A collection of the 42 Ahadith of Prophet Muhammad (PBUH) compiled by the Islamic Scholar Yahia bin Sharaful-Deen An-Nawawi."
    },
    {
        "title":"Jami' at-Tirmidhi",
        "text":"Jami’ at-Tirmidhi also known as Sunan at-Tirmidhi is one of the six books of the Kutub al-Sittah and is compiled by Imam Abu Isa Muhammad at-Tirmidhi (RA)."
    },
    {
        "title":"Hadith Qudsi",
        "text":"Hadith Qudsi or Hadith Qudse means “holy Hadith” and are attributed to the revelations from Allah (SWT) while the wordings are credited to Prophet Muhammad (PBUH)."
    },
    {
        "title":"Sunan Abu Dawood",
        "text":"Sunan Abu Dawood is one of the six books of the Kutub al-Sittah and is compiled by Imam Abu Dawud al-Sijistani."
    },
    {
        "title":"Hadith Subject Index",
        "text":"Speed up your research on Hadith topics using our fast Subject Index functionality."
    },
    {
        "title":"Hadith Narrator Index",
        "text":"Reduce your research time by using Narrator Index to quickly find hadith by a specific narrator."
    },
    {
        "title":"Prophet's Last Sermon",
        "text":"Acquire the golden guidance from Prophet Muhammad (PBUH) delivered to the entire Muslim Ummah in his last sermon."
    }
]