[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "0",
        "bookName": "Introduction by Imam Muslim",
        "bookNameArabic": "مقدمةُ الكِتابِ",
        "hadiths": [
            {
                "hadithNo": "1",
                "chapterNo": "1",
                "hadithEnglish": "Samura bin Jundab and Mughirah bin Shubah narrated that the Messenger of Allah (s.a.w) said: \"Whoever narrates a Hadith from me knowing that it is false, then he is one of the liars.\"",
                "hadithArabic": "\"‏مَنْ حَدَّثَ عَنِّي، بِحَدِيثٍ يُرَى أَنَّهُ كَذِبٌ فَهُوَ أَحَدُ الْكَاذِبِينَ\"‏‏.‏ حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنِ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ سَمُرَةَ بْنِ جُنْدَبٍ ‏.‏ ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ أَيْضًا حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ وَسُفْيَانَ عَنْ حَبِيبٍ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالاَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ"
            },
            {
                "hadithNo": "2",
                "chapterNo": "2",
                "hadithEnglish": "Narrated by Ribi bin Hirash that he heard Ali (r.a) delivering a sermon in which he said, \"The Messenger of Allah (s.a.w) said, 'Do not tell lies about me, for whoever tells lies about me will enter the Fire (Hell)'.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح: وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ قَالاَ: حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، أَنَّهُ سَمِعَ عَلِيًّا، - رَضِيَ اللَّهُ عَنْهُ - يَخْطُبُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"‏لاَ تَكْذِبُوا عَلَىَّ فَإِنَّهُ مَنْ يَكْذِبْ عَلَىَّ يَلِجِ النَّارَ\""
            },
            {
                "hadithNo": "3",
                "chapterNo": "2",
                "hadithEnglish": "Narrated by Anas bin Malik (r.a), \"What prevents me from narrating many Ahadith to you is the fact that the Messenger of Allah (s.a.w) said, 'Whoever tells a lie about me deliberately, let him take his place in the Fire (Hell)'\"",
                "hadithArabic": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ قَالَ: إِنَّهُ لَيَمْنَعُنِي أَنْ أُحَدِّثَكُمْ حَدِيثًا كَثِيرًا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ تَعَمَّدَ عَلَيَّ كَذِبًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ\""
            },
            {
                "hadithNo": "4",
                "chapterNo": "2",
                "hadithEnglish": "Narrated by Abu Hurairah (r.a), the Messenger of Allah (s.a.w) said, \"Whoever tells a lie about me deliberately, let him take his place in the Fire (Hell).\"",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي حَصِينٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ\""
            },
            {
                "hadithNo": "5",
                "chapterNo": "2",
                "hadithEnglish": "Ali bin Rabiah Al-Walibi said, \"I came to the Masjid when Mughirah was the governor of Kufah. Mughirah said that he heard the Messenger of Allah (s.a.w) say, 'To lie about me is not like lying about anyone else. Whoever tells a lie about me deliberately, let him take his place in the Fire (Hell).'\"",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ حَدَّثَنَا عَلِيُّ بْنُ رَبِيعَةَ الوَالِبِيُّ قَالَ: أَتَيْتُ الْمَسْجِدَ وَالْمُغِيرَةُ أَمِيرُ الْكُوفَةِ قَالَ فَقَالَ الْمُغِيرَةُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \"إِنَّ كَذِبًا عَلَيَّ لَيْسَ كَكَذِبٍ عَلَى أَحَدٍ فَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ\""
            },
            {
                "hadithNo": "6",
                "chapterNo": "2",
                "hadithEnglish": "Similar report to the previous hadith (Hadith No. 5), but he Mughirah did not mention, \"To lie about me is not like lying about anyone else.\"",
                "hadithArabic": "و حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ أَخْبَرَنَا مُحَمَّدُ بْنُ قَيْسٍ الْأَسْدِيُّ عَنْ عَلِيِّ بْنِ رَبِيعَةَ الْأَسَدِيِّ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَلَمْ يَذْكُرْ \"إِنَّ كَذِبًا عَلَيَّ لَيْسَ كَكَذِبٍ عَلَى أَحَدٍ\""
            },
            {
                "hadithNo": "7",
                "chapterNo": "3",
                "hadithEnglish": "Narrated by Hafs bin Asim that the Messenger of Allah (s.a.w) said, \"It is sufficient lying for a man to tell everything that he hears.\"",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي ؛ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالاَ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\" كَفَى بِالْمَرْءِ كَذِبًا أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ\""
            },
            {
                "hadithNo": "8",
                "chapterNo": "3",
                "hadithEnglish": "Abu Hurairah reported the same from the Prophet (s.a.w) (Hadith No. 7)",
                "hadithArabic": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ ذَلِكَ"
            },
            {
                "hadithNo": "9",
                "chapterNo": "3",
                "hadithEnglish": "Umar bin Khattab (r.a) said, \"It is sufficient lying for a man to tell of everything that he hears.\"",
                "hadithArabic": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ : \"بِحَسْبِ الْمَرْءِ مِنْ الْكَذِبِ أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ\""
            },
            {
                "hadithNo": "10",
                "chapterNo": "3",
                "hadithEnglish": "Ibn Wahb said, Malik said to me, \"You should know that no man who speaks of everything that he hears will be free of faults, and he will never be an Imam who speaks of everything that he hears.\"",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ سَرْحٍ قَالَ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ قَالَ لِي مَالِكٌ: \"اعْلَمْ أَنَّهُ لَيْسَ يَسْلَمُ رَجُلٌ حَدَّثَ بِكُلِّ مَا سَمِعَ وَلَا يَكُونُ إِمَامًا أَبَدًا وَهُوَ يُحَدِّثُ بِكُلِّ مَا سَمِعَ\""
            },
            {
                "hadithNo": "11",
                "chapterNo": "3",
                "hadithEnglish": "It is narrated that Abdullah said, \"It is sufficient lying for a man to speak of everything that he hears.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَ: \"بِحَسْبِ الْمَرْءِ مِنْ الْكَذِبِ أَنْ يُحَدِّثَ بِكُلِّ مَا سَمِعَ\""
            },
            {
                "hadithNo": "12",
                "chapterNo": "3",
                "hadithEnglish": "Muhammad bin Muthanna said, \"I heard Abdur Rahman bin Mahdi say, 'No man will be a Imam whose example is followed unless he refrains from (speaking of) some of the things that he hears.'\"",
                "hadithArabic": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ مَهْدِيٍّ يَقُولُ: لَا يَكُونُ الرَّجُلُ إِمَامًا يُقْتَدَى بِهِ حَتَّى يُمْسِكَ عَنْ بَعْضِ مَا سَمِعَ."
            },
            {
                "hadithNo": "13",
                "chapterNo": "3",
                "hadithEnglish": "Narrated by Sufyan bin Hussain, \"Yuas bin Muawiyah asked me, 'I see that you are fond of learning Quran. Recite a Surah to me and explain it so that I may see how much you have learned.' I did that and he said to me, 'Remember what I am going to say to you. Beware of narrating the distorted reports, for anyone who does that only humiliates himself and the people will deny his narrations.'\"",
                "hadithArabic": "وَ حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عُمَرُ بْنُ عَلِيِّ بْنِ مُقَدَّمٍ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ قَالَ سَأَلَنِي إِيَاسُ بْنُ مُعَاوِيَةَ فَقَالَ إِنِّي أَرَاكَ قَدْ كَلِفْتَ بِعِلْمِ الْقُرْآنِ فَاقْرَأْ عَلَيَّ سُورَةً وَفَسِّرْ حَتَّى أَنْظُرَ فِيمَا عَلِمْتَ قَالَ فَفَعَلْتُ فَقَالَ لِيَ احْفَظْ عَلَيَّ مَا أَقُولُ لَكَ إِيَّاكَ وَالشَّنَاعَةَ فِي الْحَدِيثِ فَإِنَّهُ قَلَّمَا حَمَلَهَا أَحَدٌ إِلَّا ذَلَّ فِي نَفْسِهِ وَكُذِّبَ فِي حَدِيثِهِ"
            },
            {
                "hadithNo": "14",
                "chapterNo": "3",
                "hadithEnglish": "Narrated by Ubaidullah bin Abdullah bin Utbah that Abdullah bin Masood said, \"You will never narrate a hadith to the people that is beyond their grasp, except that it will be a source of Fitnah (confusion) for some of them.\"",
                "hadithArabic": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ قَالَ: مَا أَنْتَ بِمُحَدِّثٍ قَوْمًا حَدِيثًا لَا تَبْلُغُهُ عُقُولُهُمْ إِلَّا كَانَ لِبَعْضِهِمْ فِتْنَةً"
            },
            {
                "hadithNo": "15",
                "chapterNo": "4",
                "hadithEnglish": "Narrated by Abu Hurairah that the Messenger of Allah (s.a.w) said, \"At the end of my Ummah there will be people who will narrate to you things that neither you nor your forefathers ever heard. Beware of them and stay away from them.\"",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ قَالَ حَدَّثَنِي أَبُو هَانِئٍ عَنْ أَبِي عُثْمَانَ مُسْلِمِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: \"سَيَكُونُ فِي آخِرِ أُمَّتِي أُنَاسٌ يُحَدِّثُونَكُمْ مَا لَمْ تَسْمَعُوا أَنْتُمْ وَلَا آبَاؤُكُمْ ، فَإِيَّاكُمْ وَإِيَّاهُمْ\""
            },
            {
                "hadithNo": "16",
                "chapterNo": "4",
                "hadithEnglish": "Narrated by Muslim bin Yasar that he heard Abu Hurairah say, \"The Messenger of Allah (s.a.w) said, 'At the end of time there will be imposters and liars who will bring ahadith that neither you nor your forefathers ever heard. Beware of them and stay away from them, and do not let them mislead you or confuse you.'\"",
                "hadithArabic": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ حَرْمَلَةَ بْنِ عِمْرَانَ التُّجِيبِيُّ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنِي أَبُو شُرَيْحٍ أَنَّهُ سَمِعَ شَرَاحِيلَ بْنَ يَزِيدَ يَقُولُ أَخْبَرَنِي مُسْلِمُ بْنُ يَسَارٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \"يَكُونُ فِي آخِرِ الزَّمَانِ دَجَّالُونَ كَذَّابُونَ، يَأْتُونَكُمْ مِنْ الْأَحَادِيثِ بِمَا لَمْ تَسْمَعُوا أَنْتُمْ وَلَا آبَاؤُكُمْ، فَإِيَّاكُمْ وَإِيَّاهُمْ، لَا يُضِلُّونَكُمْ وَلَا يَفْتِنُونَكُمْ\""
            },
            {
                "hadithNo": "17",
                "chapterNo": "4",
                "hadithEnglish": "Narrated by Amir bin Abdah that Abdullah said, \"The Shaitan appears in the form of a man, coming to people and telling them false reports. Then they disperse, and a man whose face I recognize, but I do not know his name, telling me (such and such).\"",
                "hadithArabic": "و حَدَّثَنِي أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ عَامِرِ بْنِ عَبَدَةَ قَالَ قَالَ عَبْدُ اللَّهِ: إِنَّ الشَّيْطَانَ لِيَتَمَثَّلُ فِي صُورَةِ الرَّجُلِ فَيَأْتِي الْقَوْمَ فَيُحَدِّثُهُمْ بِالْحَدِيثِ مِنْ الْكَذِبِ فَيَتَفَرَّقُونَ فَيَقُولُ الرَّجُلُ مِنْهُمْ سَمِعْتُ رَجُلًا أَعْرِفُ وَجْهَهُ وَلَا أَدْرِي مَا اسْمُهُ يُحَدِّثُ"
            },
            {
                "hadithNo": "18",
                "chapterNo": "4",
                "hadithEnglish": "Narrated by Abdullah bin Amr bin Al-As, \"There are devils detained in the sea who were put in chains by Prophet Sulieman (e.s). Soon they will emerge and (falsely) recite Quran to the people.\"",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: إِنَّ فِي الْبَحْرِ شَيَاطِينَ مَسْجُونَةً أَوْثَقَهَا سُلَيْمَانُ يُوشِكُ أَنْ تَخْرُجَ فَتَقْرَأَ عَلَى النَّاسِ قُرْآنًا"
            },
            {
                "hadithNo": "19",
                "chapterNo": "4",
                "hadithEnglish": "Narrated by Tawus, \"This man (Bushair bin Kab) came to Ibn Abbas and started telling him something. Ibn Abbas said to him, 'Repeat to me the report of so-and-so.' He repeated it to him, and he said to him, 'I do not know (your intension). Do you approve of everything else I say, and have a problem with this one? Or do you have a problem with everything I say and approve only to this one?' Ibn Abbas said to him, 'We used to narrate from the Messenger (s.a.w) where there were no lies that had been fabricated against him, but when the people rode high and low (started adding things), we stopped narrating from him.'\"",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ وَسَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ سَعِيدٌ أَخْبَرَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ حُجَيْرٍ عَنْ طَاوُسٍ قَالَ جَاءَ هَذَا إِلَى ابْنِ عَبَّاسٍ -يَعْنِي بُشَيْرَ بْنَ كَعْبٍ - فَجَعَلَ يُحَدِّثُهُ فَقَالَ لَهُ ابْنُ عَبَّاسٍ: عُدْ لِحَدِيثِ كَذَا وَكَذَا فَعَادَ لَهُ ثُمَّ حَدَّثَهُ فَقَالَ لَهُ: عُدْ لِحَدِيثِ كَذَا وَكَذَا فَعَادَ لَهُ فَقَالَ لَهُ مَا أَدْرِي أَعَرَفْتَ حَدِيثِي كُلَّهُ وَأَنْكَرْتَ هَذَا ؟ أَمْ أَنْكَرْتَ حَدِيثِي كُلَّهُ وَعَرَفْتَ هَذَا ؟ فَقَالَ لَهُ ابْنُ عَبَّاسٍ: إِنَّا كُنَّا نُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ لَمْ [يَكُنْ] يُكْذَبُ عَلَيْهِ فَلَمَّا رَكِبَ النَّاسُ الصَّعْبَ وَالذَّلُولَ تَرَكْنَا الْحَدِيثَ عَنْهُ."
            },
            {
                "hadithNo": "20",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Ibn Abbas said, \"We used to memorize hadith and that which is narrated from the Messenger of Allah (s.a.w) deserved to be memorized. But when you started riding every high and low (to narrate a great deal), there is no way.\"",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّمَا كُنَّا نَحْفَظُ الْحَدِيثَ وَالْحَدِيثُ يُحْفَظُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَّا إِذْ رَكِبْتُمْ كُلَّ صَعْبٍ وَذَلُولٍ فَهَيْهَاتَ."
            },
            {
                "hadithNo": "21",
                "chapterNo": "4",
                "hadithEnglish": "It is narrated that Mujahid said, \"Bushair bin Kab Al-Adawi came to Ibn Abbas and started narrating to him saying, 'The Messenger of Allah (s.a.w) said, ...' 'The Messenger of Allah (s.a.w) said, ...' Ibn Abbas did not approve of his reports and did not even look at him. He said, 'O Ibn Abbas, why is it that I do not see you listening to what I am telling? I am narrating to you from the Messenger of Allah (s.a.w) and you are not paying attention.' Ibn Abbas said, 'At one time, if we heard a man say that the Messenger of Allah (s.a.w) said ..., we would all turn to look at him and listen. But when the people started to ride high and low (to narrate a great deal), we did not accept from the people anything but that which we are familiar with.' \"",
                "hadithArabic": "و حَدَّثَنِي أَبُو أَيُّوبَ سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ الْغَيْلَانِيُّ حَدَّثَنَا أَبُو عَامِرٍ يَعْنِي الْعَقَدِيَّ حَدَّثَنَا رَبَاحٌ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ مُجَاهِدٍ قَالَ جَاءَ بُشَيْرٌ بْنُ كَعْبٍ الْعَدَوِيُّ إِلَى ابْنِ عَبَّاسٍ فَجَعَلَ يُحَدِّثُ وَيَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ ابْنُ عَبَّاسٍ لَا يَأْذَنُ لِحَدِيثِهِ وَلَا يَنْظُرُ إِلَيْهِ فَقَالَ يَا ابْنَ عَبَّاسٍ مَالِي لَا أَرَاكَ تَسْمَعُ لِحَدِيثِي؟ أُحَدِّثُكَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا تَسْمَعُ فَقَالَ ابْنُ عَبَّاسٍ إِنَّا كُنَّا مَرَّةً إِذَا سَمِعْنَا رَجُلًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَدَرَتْهُ أَبْصَارُنَا وَأَصْغَيْنَا إِلَيْهِ بِآذَانِنَا فَلَمَّا رَكِبَ النَّاسُ الصَّعْبَةَ [الصَّعْبَ] وَالذَّلُولَ لَمْ نَأْخُذْ مِنْ النَّاسِ إِلَّا مَا نَعْرِفُ"
            },
            {
                "hadithNo": "22",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Ibn Abi Mulaikah said, \"I wrote to Ibn Abbas asking him to write something for me, but to be selective. He said, 'A sincere boy, I will choose for him and be selective.' He called for a record of judgements passed by Ali, and he started to write down some of them and he would come across some things and say, 'By Allah, Ali would never have passed such a judgement unless he got it wrong.'\"",
                "hadithArabic": "حَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو الضَّبِّيُّ حَدَّثَنَا نَافِعُ بْنُ عُمَرَ عَنْ ابْنِ أَبِي مُلَيْكَةَ قَالَ كَتَبْتُ إِلَى ابْنِ عَبَّاسٍ أَسْأَلُهُ أَنْ يَكْتُبَ لِي كِتَابًا وَيُخْفِي عَنِّي فَقَالَ وَلَدٌ نَاصِحٌ أَنَا أَخْتَارُ لَهُ الْأُمُورَ اخْتِيَارًا وَأُخْفِي عَنْهُ قَالَ فَدَعَا بِقَضَاءِ عَلِيٍّ فَجَعَلَ يَكْتُبُ مِنْهُ أَشْيَاءَ وَيَمُرُّ بِهِ الشَّيْءُ فَيَقُولُ وَاللَّهِ مَا قَضَى بِهَذَا عَلِيٌّ إِلَّا أَنْ يَكُونَ ضَلَّ"
            },
            {
                "hadithNo": "23",
                "chapterNo": "4",
                "hadithEnglish": "It is narrated that Tawus said, \"A book containing judgements passed by Ali (r.a) was brought to Ibn Abbas. He erased all of them except a few,\" and Sufyan bin Uyaynah gestured with his hand.",
                "hadithArabic": "حَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامِ بْنِ حُجَيْرٍ عَنْ طَاوُسٍ قَالَ أُتِيَ ابْنُ عَبَّاسٍ بِكِتَابٍ فِيهِ قَضَاءُ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فَمَحَاهُ إِلَّا قَدْرَ وَأَشَارَ سُفْيَانُ بْنُ عُيَيْنَةَ بِذِرَاعِهِ"
            },
            {
                "hadithNo": "24",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Abu Ishaq said, \"When they introduced those things after Ali was gone, a man from among the companions of Ali said, 'May Allah kill them! What great knowledge they have corrupted.'\"",
                "hadithArabic": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ أَبِي إِسْحَقَ قَالَ لَمَّا أَحْدَثُوا تِلْكَ الْأَشْيَاءَ بَعْدَ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ رَجُلٌ مِنْ أَصْحَابِ عَلِيٍّ قَاتَلَهُمْ اللَّهُ أَيَّ عِلْمٍ أَفْسَدُوا"
            },
            {
                "hadithNo": "25",
                "chapterNo": "4",
                "hadithEnglish": "Abu Bakr bin Ayyash narrated, \"I heard Al-Mughirah say, 'No report narrated from Ali by anyone could be believed, except that which was narrated from the companions of Abdullah bin Masood.'\"",
                "hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ قَالَ سَمِعْتُ الْمُغِيرَةَ يَقُولُ: لَمْ يَكُنْ يَصْدُقُ عَلَى عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فِي الْحَدِيثِ عَنْهُ إِلَّا مِنْ أَصْحَابِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ"
            },
            {
                "hadithNo": "26",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Muhammad bin Sirin said, \"This knowledge is the religion, so be careful from whom you learn your religion.\"",
                "hadithArabic": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ وَهِشَامٍ عَنْ مُحَمَّدٍ ؛ ح: قال: وَحَدَّثَنَا فُضَيْلٌ عَنْ هِشَامٍ -قَالَ -: وَحَدَّثَنَا مَخْلَدُ بْنُ حُسَيْنٍ عَنْ هِشَامٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَ: إِنَّ هَذَا الْعِلْمَ دِينٌ فَانْظُرُوا عَمَّنْ تَأْخُذُونَ دِينَكُمْ."
            },
            {
                "hadithNo": "27",
                "chapterNo": "5",
                "hadithEnglish": "It is narrated that Ibn Sirin said, \"They used not to ask about the chain (of narrations), but when the Fitnah occurred, they said, 'Tell us about the men (in the chain of narrations).' They would look for the people following Sunnah to accept their Hadith, and they would look for the people following Bidah (innovations in religion) to reject their Hadith.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ ابْنِ سِيرِينَ قَالَ لَمْ يَكُونُوا يَسْأَلُونَ عَنْ الْإِسْنَادِ فَلَمَّا وَقَعَتْ الْفِتْنَةُ قَالُوا: سَمُّوا لَنَا رِجَالَكُمْ فَيُنْظَرُ إِلَى أَهْلِ السُّنَّةِ فَيُؤْخَذُ حَدِيثُهُمْ وَيُنْظَرُ إِلَى أَهْلِ الْبِدَعِ فَلَا يُؤْخَذُ حَدِيثُهُمْ."
            },
            {
                "hadithNo": "28",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Sulaiman bin Musa said, \"I met Tawus and said, 'So and so narrated such and such to me.' He said, 'If your companion is able then learn from him.'\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا عِيسَى وَهُوَ ابْنُ يُونُسَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ سُلَيْمَانَ بْنِ مُوسَى قَالَ لَقِيتُ طَاوُسًا فَقُلْتُ حَدَّثَنِي فُلَانٌ كَيْتَ وَكَيْتَ قَالَ إِنْ كَانَ [صَاحِبُكَ] مَلِيْئًا فَخُذْ عَنْهُ"
            },
            {
                "hadithNo": "29",
                "chapterNo": "5",
                "hadithEnglish": "Saeed bin Abdul Aziz said that it was narrated that Sulaiman bin Musa said, \"I said to Tawus, 'So and so narrated such and such to me.' He said, 'If your companion is able then learn from him.'\"",
                "hadithArabic": "و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا مَرْوَانُ يَعْنِي ابْنَ مُحَمَّدٍ الدِّمَشْقِيَّ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ سُلَيْمَانَ بْنِ مُوسَى قَالَ قُلْتُ لِطَاوُسٍ: إِنَّ فُلَانًا حَدَّثَنِي بِكَذَا وَكَذَا قَالَ إِنْ كَانَ صَاحِبُكَ مَلِيْئًا فَخُذْ عَنْهُ"
            },
            {
                "hadithNo": "30",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Ibn Abi Zinad that his father said, \"I met one hundred men in Madina, all of whom were reliable, but no one accepted Ahadith from them. It was said, 'He is not one of its people (of knowledge).'\"",
                "hadithArabic": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا الْأَصْمَعِيُّ عَنْ ابْنِ أَبِي الزِّنَادِ عَنْ أَبِيهِ قَالَ أَدْرَكْتُ بِالْمَدِينَةِ مِائَةً كُلُّهُمْ مَأْمُونٌ، مَا يُؤْخَذُ عَنْهُمْ الْحَدِيثُ يُقَالُ: لَيْسَ مِنْ أَهْلِهِ."
            },
            {
                "hadithNo": "31",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Mis'ar said: \"I heard Sa'd bin Ibrahim say: 'There is to be no narrating from the Messenger of Allah (s.a.w) except from those who are trustworthy.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ حَدَّثَنَا سُفْيَانُ؛ ح: و حَدَّثَنِي أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ وَاللَّفْظُ لَهُ قَالَ سَمِعْتُ سُفْيَانَ بْنَ عُيَيْنَةَ عَنْ مِسْعَرٍ قَالَ سَمِعْتُ سَعْدَ بْنَ إِبْرَاهِيمَ يَقُولُ: لَا يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا الثِّقَاتُ"
            },
            {
                "hadithNo": "32",
                "chapterNo": "5",
                "hadithEnglish": "Muhammad bin 'Abdullah bin Quhzadh - from the people of Marw - narrated to me, he said: \"I heard 'Abdan bin 'Uthman saying: \"Abdullah bin Al-Mubarak said: \"The chain (of narration) is part of religion, were it not for the chain, anyone could say whatever he wanted.\" He (Muslim) said: Muhammad bin 'Abdullah said: \"Al-'Abbas bin Abi Rizmah said to me: 'I heard 'Abdullah say: \"The criterion between us and other people is these lists,\" meaning the chain of narration. Muhammad said: \"I heard Abu Ishaq Ibrahim bin 'Eisa At-Talaqani say: 'I said to 'Abdullah bin Al-Mubarak: \"O Abu 'Abdur-Rahman, there is a Hadith which says: 'It is part of honoring one's parents in death after honoring them in life to pray on behalf of your parents when you pray, and fast on behalf of your parents when you fast.\"' 'Abdullah said: \"O Abu Ishaq! From whom (did you get) this?\" I said to him: \"This Hadith is from Shihab bin Khirash.\" He said: \"He is trustworthy. From whom did he get it?\" I said: \"From Al-Hajjaj bin Dinar.\" He said: \"He is trustworthy. From whom did he get it?'\" I said: \"The Messenger of Allah (s.a.w) said.\" He said: \"O Abu Ishaq, between Al-Hajjaj bin Dinar and the Prophet (s.a.w) there is a big gap which cannot be easily bridged. But there is no dispute concerning charity (given on behalf of deceased parents).\" Muhammad said: \"I heard 'Ali bin Shaqiq say: 'I heard 'Abdullah bin Al-Mubarak say, in front of the people: \"Ignore the Ahadith of 'Amr bin Thabit, for he used to verbally abuse the Salaf.\"",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ - مِنْ أَهْلِ مَرْوَ- قَالَ سَمِعْتُ عَبْدَانَ بْنَ عُثْمَانَ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْمُبَارَكِ يَقُولُ: الْإِسْنَادُ مِنْ الدِّينِ وَلَوْلَا الْإِسْنَادُ لَقَالَ مَنْ شَاءَ مَا شَاءَ. قَالَ و قَالَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي الْعَبَّاسُ بْنُ أَبِي رِزْمَةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ يَقُولُ: بَيْنَنَا وَبَيْنَ الْقَوْمِ الْقَوَائِمُ يَعْنِي الْإِسْنَادَ و قَالَ مُحَمَّدُ: سَمِعْتُ أَبَا إِسْحَقَ إِبْرَاهِيمَ بْنَ عِيسَى الطَّالَقَانِيَّ قَالَ قُلْتُ لِعَبْدِ اللَّهِ بْنِ الْمُبَارَكِ يَا أَبَا عَبْدِ الرَّحْمَنِ! الْحَدِيثُ الَّذِي جَاءَ: \"إِنَّ مِنْ الْبِرِّ بَعْدَ الْبِرِّ أَنْ تُصَلِّيَ لِأَبَوَيْكَ مَعَ صَلَاتِكَ وَتَصُومَ لَهُمَا مَعَ صَوْمِكَ\" قَالَ فَقَالَ عَبْدُ اللَّهِ يَا أَبَا إِسْحَقَ! عَمَّنْ هَذَا؟ قَالَ قُلْتُ لَهُ هَذَا مِنْ حَدِيثِ شِهَابِ بْنِ خِرَاشٍ فَقَالَ ثِقَةٌ عَمَّنْ؟ قَالَ قُلْتُ عَنْ الْحَجَّاجِ بْنِ دِينَارٍ قَالَ ثِقَةٌ عَمَّنْ؟ قَالَ قُلْتُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا أَبَا إِسْحَقَ إِنَّ بَيْنَ الْحَجَّاجِ بْنِ دِينَارٍ وَبَيْنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَفَاوِزَ تَنْقَطِعُ فِيهَا أَعْنَاقُ الْمَطِيِّ وَلَكِنْ لَيْسَ فِي الصَّدَقَةِ اخْتِلَافٌ. وَقَالَ مُحَمَّدٌ: سَمِعْتُ عَلِيَّ بْنَ شَقِيقٍ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْمُبَارَكِ يَقُولُ عَلَى رُءُوسِ النَّاسِ: دَعُوا حَدِيثَ عَمْرِو بْنِ ثَابِتٍ فَإِنَّهُ كَانَ يَسُبُّ السَّلَفَ."
            },
            {
                "hadithNo": "33",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu 'Aqil, the companion of Buhayyah said: \"I was sitting with Al-Qasim bin 'Ubaidullah and Yahya bin Sa'eed. Yahya said to Al-Qasim: 'O Abu Muhammad! How grave it is for a great man like you to be asked a question about this religion and you have no knowledge of it and no answer.' Al-Qasim said to him: 'Why is that?' He said: 'Because you are the son of two Imam of guidance, the son of Abu Bakr and 'Umar.' Al-Qasim said to him: 'What is worse than that is one who knows about Allah but speaks without knowledge, or accepts a report from one who is not trustworthy.' He fell silent and did not answer him.\"",
                "hadithArabic": "و حَدَّثَنِي أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ قَالَ حَدَّثَنِي أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا أَبُو عَقِيلٍ صَاحِبُ بُهَيَّةَ قَالَ كُنْتُ جَالِسًا عِنْدَ الْقَاسِمِ بْنِ عُبَيْدِ اللَّهِ وَيَحْيَى بْنِ سَعِيدٍ فَقَالَ يَحْيَى لِلْقَاسِمِ يَا أَبَا مُحَمَّدٍ ! إِنَّهُ قَبِيحٌ عَلَى مِثْلِكَ عَظِيمٌ أَنْ تُسْأَلَ عَنْ شَيْءٍ مِنْ أَمْرِ هَذَا الدِّينِ فَلَا يُوجَدَ عِنْدَكَ مِنْهُ عِلْمٌ وَلَا فَرَجٌ أَوْ عِلْمٌ وَلَا مَخْرَجٌ فَقَالَ لَهُ الْقَاسِمُ وَعَمَّ ذَاكَ قَالَ لِأَنَّكَ ابْنُ إِمَامَيْ هُدًى ابْنُ أَبِي بَكْرٍ وَعُمَرَ قَالَ يَقُولُ لَهُ الْقَاسِمُ أَقْبَحُ مِنْ ذَاكَ عِنْدَ مَنْ عَقَلَ عَنْ اللَّهِ أَنْ أَقُولَ بِغَيْرِ عِلْمٍ أَوْ آخُذَ عَنْ غَيْرِ ثِقَةٍ قَالَ فَسَكَتَ فَمَا أَجَابَهُ."
            },
            {
                "hadithNo": "34",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated by Sufyan [bin 'Uyaynah] who said: \"They informed me about Abu 'Aqil, the companion of Buhayyah; that a son of 'Abdullah bin 'Umar was asked about something of which he did not have any knowledge. Yahya bin Sa'eed said to him: 'I feel it is very grave that a man like you, who is the son of two Imam of guidance' - meaning 'Umar and Ibn 'Umar - 'can be asked about something of which he has no knowledge.' He said: 'By Allah, it is more serious than that before Allah and before anyone who has any knowledge of Allah, to speak without knowledge, or to narrate from someone who is not trustworthy.' Abu 'Aqil Yahya bin Al-Mutawakkil was present while the two of them said that.\"",
                "hadithArabic": "و حَدَّثَنِي بِشْرُ بْنُ الْحَكَمِ الْعَبْدِيُّ قَالَ سَمِعْتُ سُفْيَانَ بْنَ عُيَيْنَةَ يَقُولُ أَخْبَرُونِي عَنْ أَبِي عَقِيلٍ صَاحِبِ بُهَيَّةَ أَنَّ أَبْنَاءً لِعَبْدِ اللَّهِ بْنِ عُمَرَ سَأَلُوهُ عَنْ شَيْءٍ لَمْ يَكُنْ عِنْدَهُ فِيهِ عِلْمٌ فَقَالَ لَهُ يَحْيَى بْنُ سَعِيدٍ وَاللَّهِ إِنِّي لَأُعْظِمُ أَنْ يَكُونَ مِثْلُكَ وَأَنْتَ ابْنُ إِمَامَيْ الْهُدَى يَعْنِي عُمَرَ وَابْنَ عُمَرَ تُسْأَلُ عَنْ أَمْرٍ لَيْسَ عِنْدَكَ فِيهِ عِلْمٌ فَقَالَ أَعْظَمُ مِنْ ذَلِكَ وَاللَّهِ عِنْدَ اللَّهِ وَعِنْدَ مَنْ عَقَلَ عَنْ اللَّهِ أَنْ أَقُولَ بِغَيْرِ عِلْمٍ أَوْ أُخْبِرَ عَنْ غَيْرِ ثِقَةٍ قَالَ وَشَهِدَهُمَا أَبُو عَقِيلٍ يَحْيَى بْنُ الْمُتَوَكِّلِ حِينَ قَالَا ذَلِكَ."
            },
            {
                "hadithNo": "35",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Yahya bin Sa'eed said: \"I asked Sufyan Ath-Thawri, Shu'bah, Malik and Ibn 'Uyaynah about a man who was not reliable in narration of Hadith, but a man came and asked me about him. They said: ' Tell them that he is not reliable.\"'",
                "hadithArabic": "و حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ أَبُو حَفْصٍ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ قَالَ سَأَلْتُ سُفْيَانَ الثَّوْرِيَّ وَشُعْبَةَ وَمَالِكًا وَابْنَ عُيَيْنَةَ عَنْ الرَّجُلِ لَا يَكُونُ ثَبْتًا فِي الْحَدِيثِ فَيَأْتِينِي الرَّجُلُ فَيَسْأَلُنِي عَنْهُ قَالُوا أَخْبِرْ عَنْهُ أَنَّهُ لَيْسَ بِثَبْتٍ."
            },
            {
                "hadithNo": "36",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that An-Nadr said: \"While Ibn 'Awn was standing in the threshold, he was asked about the Hadith of Shahr. He said: 'They condemned Shahr, they condemned Shahr.\"' Abu Al-Husain Muslim bin Al-Hajjaj (may Allah have mercy on him) said: (Ibn 'Awn meant that) The people have taken to criticizing him.",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ سَمِعْتُ النَّضْرَ يَقُولُ سُئِلَ ابْنُ عَوْنٍ عَنْ حَدِيثٍ لِشَهْرٍ وَهُوَ قَائِمٌ عَلَى أُسْكُفَّةِ الْبَابِ فَقَالَ إِنَّ شَهْرًا نَزَكُوهُ إِنَّ شَهْرًا نَزَكُوهُ \r\nقَالَ أَبُوْ الْحُسَيْنِ مُسْلِم بْنُ الْحَجَّاجِ رَحِمَهُ اللَّهُ يَقُولُ أَخَذَتْهُ أَلْسِنَةُ النَّاسِ تَكَلَّمُوا فِيهِ."
            },
            {
                "hadithNo": "37",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Shu'bah said: \"I met Shahr but I did not pay any attention to him.\"",
                "hadithArabic": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا شَبَابَةُ قَالَ قَالَ شُعْبَةُ وَقَدْ لَقِيتُ شَهْرًا فَلَمْ أَعْتَدَّ بِهِ"
            },
            {
                "hadithNo": "38",
                "chapterNo": "5",
                "hadithEnglish": "Muhammad bin 'Abdullah bin Quhzadh - from the people of Mar, narrated to me, he said: 'Ali bin Husain bin Waqid said: 'Abdullah bin Al-Mubarak said: \"I said to Sufyan Ath-Thawri: \"Abbad bin Kathir is one whose situation you know about. When he narrates a report he makes serious mistakes. Do you think that I should tell the people not to accept reports from him?' Sufyan said: 'Yes.' 'Abdullah said: 'If I was in a gathering where mention was made of 'Abbad, I would praise him for his religion, but I would say: \"Do not accept reports from him.\"' Muhammad narrated to us: 'Abdullah bin 'Uthman said: My father said: \"'Abdullah bin Al-Mubarak said: I went to Shu'bah and he said: 'This is 'Abbad bin Kathir - beware of him.\"'",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ مِنْ أَهْلِ مَرْوَ قَالَ أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ قُلْتُ لِسُفْيَانَ الثَّوْرِيِّ: إِنَّ عَبَّادَ بْنَ كَثِيرٍ مَنْ تَعْرِفُ حَالَهُ وَإِذَا حَدَّثَ جَاءَ بِأَمْرٍ عَظِيمٍ فَتَرَى أَنْ أَقُولَ لِلنَّاسِ لَا تَأْخُذُوا عَنْهُ؟ قَالَ سُفْيَانُ: بَلَى.قَالَ عَبْدُ اللَّهِ فَكُنْتُ إِذَا كُنْتُ فِي مَجْلِسٍ ذُكِرَ فِيهِ عَبَّادٌ أَثْنَيْتُ عَلَيْهِ فِي دِينِهِ وَأَقُولُ لَا تَأْخُذُوا عَنْهُ\r\nوَقَالَ مُحَمَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ قَالَ قَالَ أَبِي قَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ انْتَهَيْتُ إِلَى شُعْبَةَ فَقَالَ هَذَا عَبَّادُ بْنُ كَثِيرٍ فَاحْذَرُوهُ"
            },
            {
                "hadithNo": "39",
                "chapterNo": "5",
                "hadithEnglish": "Al-Fadl bin Sahl narrated to me: \"I asked Mu'alla Ar-Razi about Muhammad bin Sa'eed, the one that 'Abbad bin Kathir narrated from. So he told me that 'Eisa bin Yunus said: 'I was at his door and Sufyan was with him. When he came out, I asked him about Muhammad bin Sa'eed, and he told me that he was a liar.'\"",
                "hadithArabic": "و حَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ قَالَ سَأَلْتُ مُعَلًّى الرَّازِيَّ عَنْ مُحَمَّدِ بْنِ سَعِيدٍ الَّذِي رَوَى عَنْهُ عَبَّادٌ بْنُ كَثِيْرٍ فَأَخْبَرَنِي عَنْ عِيسَى بْنِ يُونُسَ قَالَ كُنْتُ عَلَى بَابِهِ وَسُفْيَانُ عِنْدَهُ فَلَمَّا خَرَجَ سَأَلْتُهُ عَنْهُ فَأَخْبَرَنِي أَنَّهُ كَذَّابٌ."
            },
            {
                "hadithNo": "40",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Muhammad bin Yahya bin Sa'eed Al-Qattan that his father said: \"We have not seen any fault in the righteous worse than their telling lies in narrating Hadith.\" Ibn Abi 'Attab said: \"I met Muhammad bin Yahya bin Sa'eed AI-Qattan and I asked him about him . He said, narrating from his father: 'You will not see in good people anything worse than in telling lies about Hadith.\"' Muslim said: (This means) Lies flow from their tongues but they do not lie deliberately.",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عَتَّابٍ قَالَ حَدَّثَنِي عَفَّانُ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ عَنْ أَبِيهِ قَالَ لَمْ نَرَ الصَّالِحِينَ فِي شَيْءٍ أَكْذَبَ مِنْهُمْ فِي الْحَدِيثِ. \r\nقَالَ ابْنُ أَبِي عَتَّابٍ فَلَقِيتُ أَنَا مُحَمَّدَ بْنَ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ فَسَأَلْتُهُ عَنْهُ فَقَالَ عَنْ أَبِيهِ لَمْ تَرَ أَهْلَ الْخَيْرِ فِي شَيْءٍ أَكْذَبَ مِنْهُمْ فِي الْحَدِيثِ. \r\nقَالَ مُسْلِم يَقُولُ يَجْرِي الْكَذِبُ عَلَى لِسَانِهِمْ وَلَا يَتَعَمَّدُونَ الْكَذِبَ."
            },
            {
                "hadithNo": "41",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Khalifah bin Musa said: \"I entered upon Ghalib bin 'Ubaidullah and he started to dictate to me: 'Makhul narrated to me,' 'Makhul narrated to me.' Then he needed to urinate, so he got up, and I looked at his notebook and in it (was written): \"Aban narrated to me from Anas,' 'Aban narrated from so-and-so.' So I got up and left.\" He (Muslim) said: And I heard Al-Hasan bin 'Ali Al-Hulwani say: \"I saw in the book of 'Affan a Hadith of Hisham Abu Al-Miqdam - a Hadith of 'Umar bin 'Abdul-'Aziz. Hisham said: 'A man called Yahya bin so-and-so narrated to me, from Muhammad bin Ka'b.' I said to 'Affan: 'They say that Hisham heard it from Muhammad bin Ka'b.' He said: 'His problem started with this Hadith. He used to say: \"Yahya narrated to me from Muhammad,' then after that he claimed that he had heard it from Muhammad.\"'",
                "hadithArabic": "حَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنِي خَلِيفَةُ بْنُ مُوسَى قَالَ دَخَلْتُ عَلَى غَالِبِ بْنِ عُبَيْدِ اللَّهِ فَجَعَلَ يُمْلِي عَلَيَّ حَدَّثَنِي مَكْحُولٌ حَدَّثَنِي مَكْحُولٌ فَأَخَذَهُ الْبَوْلُ فَقَامَ فَنَظَرْتُ فِي الْكُرَّاسَةِ فَإِذَا فِيهَا حَدَّثَنِي أَبَانٌ عَنْ أَنَسٍ وَأَبَانُ عَنْ فُلَانٍ فَتَرَكْتُهُ وَقُمْتُ\r\n[قَالَ] وَسَمِعْتُ الْحَسَنَ بْنَ عَلِيٍّ الْحُلْوَانِيَّ يَقُولُا رَأَيْتُ فِي كِتَابِ عَفَّانَ حَدِيثَ هِشَامٍ أَبِي الْمِقْدَامِ حَدِيثَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ قَالَ هِشَامٌ حَدَّثَنِي رَجُلٌ يُقَالُ لَهُ يَحْيَى بْنُ فُلَانٍ عَنْ مُحَمَّدِ بْنِ كَعْبٍ [قَالَ] قُلْتُ لِعَفَّانَ إِنَّهُمْ يَقُولُونَ هِشَامٌ سَمِعَهُ مِنْ مُحَمَّدِ بْنِ كَعْبٍ فَقَالَ إِنَّمَا ابْتُلِيَ مِنْ قِبَلِ هَذَا الْحَدِيثِ كَانَ يَقُولُ حَدَّثَنِي يَحْيَى عَنْ مُحَمَّدٍ ثُمَّ ادَّعَى بَعْدُ أَنَّهُ سَمِعَهُ مِنْ مُحَمَّدٍ"
            },
            {
                "hadithNo": "42",
                "chapterNo": "5",
                "hadithEnglish": "Muhammad bin 'Abdullah bin Quhzadh narrated to me: \"I heard 'Abdullah bin 'Uthman bin Jabalah saying: 'I said to 'Abdullah bin Al-Mubarak: \"Who is the man from whom you narrated the Hadith of 'Abdullah bin 'Amr: 'The Day of Al-Fitr is the day of rewards'?\" He said: \"Sulaiman bin Al-Hajjaj. Look into what you get from him.'' Ibn Quhzadh said: \"I heard Wahb bin Zam'ah mentioning from Sufyan bin 'Abdul-Malik who said: \"Abdullah, meaning Ibn Al-Mubarak, said: \"I saw Rawh bin Ghutaif, the narrator of the Hadith about blood the size of a Dirham, and I sat with him for a while, but I began to feel embarrassed of my companions if they were to see me with him, because they disliked his narrations.\"",
                "hadithArabic": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُثْمَانَ بْنِ جَبَلَةَ يَقُولُ قُلْتُ لِعَبْدِ اللَّهِ بْنِ الْمُبَارَكِ مَنْ هَذَا الرَّجُلُ الَّذِي رَوَيْتَ عَنْهُ حَدِيثَ عَبْدِ اللَّهِ بْنِ عَمْرٍو \"يَوْمُ الْفِطْرِ يَوْمُ الْجَوَائِزِ\"؟ قَالَ سُلَيْمَانُ بْنُ الْحَجَّاجِ انْظُرْ مَا وَضَعْتَ فِي يَدِكَ مِنْهُ.\r\nقَالَ ابْنُ قُهْزَاذَ وَسَمِعْتُ وَهْبَ بْنَ زَمْعَةَ يَذْكُرُ عَنْ سُفْيَانَ بْنِ عَبْدِ الْمَلِكِ قَالَ قَالَ عَبْدُ اللَّهِ يَعْنِي ابْنَ الْمُبَارَكِ رَأَيْتُ رَوْحَ بْنَ غُطَيْفٍ صَاحِبَ الدَّمِ قَدْرِ الدِّرْهَمِ وَجَلَسْتُ إِلَيْهِ مَجْلِسًا فَجَعَلْتُ أَسْتَحْيِي مِنْ أَصْحَابِي أَنْ يَرَوْنِي جَالِسًا مَعَهُ كُرْهَ حَدِيثِهِ"
            },
            {
                "hadithNo": "43",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that 'Abdullah bin Al-Mubarak said: \"Baqiyyah is truthful in speech, but he accepts (reports) from (anyone).\"",
                "hadithArabic": "حَدَّثَنِي ابْنُ قُهْزَاذَ قَالَ سَمِعْتُ وَهْبًا يَقُولُ عَنْ سُفْيَانَ عَنْ ابْنِ الْمُبَارَكِ قَالَ بَقِيَّةُ صَدُوقُ اللِّسَانِ وَلَكِنَّهُ يَأْخُذُ عَمَّنْ أَقْبَلَ وَأَدْبَرَ"
            },
            {
                "hadithNo": "44",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Ash-Sha'bi said: \"Al-Harith Al-A'war Al-Hamdani narrated to me, but he was a liar.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ الشَّعْبِيِّ قَالَ حَدَّثَنِي الْحَارِثُ الْأَعْوَرُ الْهَمْدَانِيُّ وَكَانَ كَذَّابًا."
            },
            {
                "hadithNo": "45",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Mughirah said: \"I heard Ash-Sha'bi say: 'Al-Harith Al-A'war narrated to me,' but he bears witness that Al-Harith Al-A'war is one of the liars.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ اللَّهِ بْنُ بَرَّادٍ الْأَشْعَرِيُّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُفَضَّلٍ عَنْ مُغِيرَةَ قَالَ سَمِعْتُ الشَّعْبِيَّ يَقُولُ حَدَّثَنِي الْحَارِثُ الْأَعْوَرُ وَهُوَ يَشْهَدُ أَنَّهُ أَحَدُ الْكَاذِبِينَ"
            },
            {
                "hadithNo": "46",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Ibrahim said: '\"Alqamah said: 'I read the Qur'an in two years.' Al-Harith said: 'The Qur'an is easy but the Wahi (revelation) is more difficult.\"'",
                "hadithArabic": "وَ حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، قَالَ قَالَ عَلْقَمَةُ قَرَأْتُ الْقُرْآنَ فِي سَنَتَيْنِ ‏.‏ فَقَالَ الْحَارِثُ الْقُرْآنُ هَيِّنٌ، الْوَحْىُ أَشَدُّ ."
            },
            {
                "hadithNo": "47",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Ibrahim that Al-Harith said: \"I learned the'Qur'an in three years and the Wabi in two\" - or he said: \"the Wahi in three years and the Qur'an in two.\"",
                "hadithArabic": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَحْمَدُ، - يَعْنِي ابْنَ يُونُسَ - حَدَّثَنَا زَائِدَةُ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، أَنَّ الْحَارِثَ، قَالَ: تَعَلَّمْتُ الْقُرْآنَ فِي ثَلاَثِ سِنِينَ، وَالْوَحْىَ فِي سَنَتَيْنِ - أَوْ قَالَ: الْوَحْىَ فِي ثَلاَثِ سِنِينَ وَالْقُرْآنَ فِي سَنَتَيْنِ."
            },
            {
                "hadithNo": "48",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Ibrahim that Al-Harith was accused (of fabrication).",
                "hadithArabic": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، قَالَ حَدَّثَنِي أَحْمَدُ، - وَهُوَ ابْنُ يُونُسَ - حَدَّثَنَا زَائِدَةُ، عَنْ مَنْصُورٍ، وَالْمُغِيرَةِ، عَنْ إِبْرَاهِيمَ، أَنَّ الْحَارِثَ، اتُّهِمَ ."
            },
            {
                "hadithNo": "49",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Hamzah Az-Zayyat said: \"Murrah Al-Hamdani heard something from Al-Harith and he said to him: 'Sit by the door.' Murrah went in and picked up his sword, but Al-Harith sensed that he was up to no good, so he went away.\"",
                "hadithArabic": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ حَمْزَةَ الزَّيَّاتِ قَالَ سَمِعَ مُرَّةُ الْهَمْدَانِيُّ مِنْ الْحَارِثِ شَيْئًا فَقَالَ لَهُ: اقْعُدْ بِالْبَابِ قَالَ فَدَخَلَ مُرَّةُ وَأَخَذَ سَيْفَهُ قَالَ: وَأَحَسَّ الْحَارِثُ بِالشَّرِّ فَذَهَبَ."
            },
            {
                "hadithNo": "50",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Ibn 'Awn said: \"Ibrahim said to us: 'Beware of Al-Mughirah bin Sa'eed and Abu 'Abdur-Rahman, for they are liars.\"'",
                "hadithArabic": "و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ابْنِ عَوْنٍ قَالَ قَالَ لَنَا إِبْرَاهِيمُ إِيَّاكُمْ وَالْمُغِيرَةَ بْنَ سَعِيدٍ وَأَبَا عَبْدِ الرَّحِيمِ فَإِنَّهُمَا كَذَّابَانِ"
            },
            {
                "hadithNo": "51",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that 'Asim said: \"We used to go to Abu 'Abdur-Rahman Al-Sulami when we were young boys, and he used to say to us: 'Do not sit with the storytellers except for Abu Al-Ahwas, and beware of Shaqiq.' And He said: 'This Shaqiq held some Khariji views, but he was not Abu Wa'il.\"'",
                "hadithArabic": "وحَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ قَالَ حَدَّثَنَا عَاصِمٌ قَالَ كُنَّا نَأْتِي أَبَا عَبْدِ الرَّحْمَنِ السُّلَمِيَّ وَنَحْنُ غِلْمَةٌ أَيْفَاعٌ فَكَانَ يَقُولُ لَنَا لَا تُجَالِسُوا الْقُصَّاصَ غَيْرَ أَبِي الْأَحْوَصِ وَإِيَّاكُمْ وَشَقِيقًا قَالَ وَكَانَ شَقِيقٌ هَذَا يَرَى رَأْيَ الْخَوَارِجِ وَلَيْسَ بِأَبِي وَائِلٍ."
            },
            {
                "hadithNo": "52",
                "chapterNo": "5",
                "hadithEnglish": "Abu Ghassan Muhammad bin 'Amr Ar-Razi narrated to us, he said: \"I heard Jarir say: 'I met Jabir bin Yazid Al-Ju'fi, but I did not write down anything from him as he believed in Ar-Raj'ah.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو غَسَّانَ مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ قَالَ سَمِعْتُ جَرِيرًا يَقُولُ: لَقِيتُ جَابِرَ بْنَ يَزِيدَ الْجُعْفِيَّ فَلَمْ أَكْتُبْ عَنْهُ كَانَ يُؤْمِنُ بِالرَّجْعَةِ."
            },
            {
                "hadithNo": "53",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Mis'ar said: \"Jabir bin Yazid narrated to us, before he innovated as he did.\"",
                "hadithArabic": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا مِسْعَرٌ قَالَ حَدَّثَنَا جَابِرُ بْنُ يَزِيدَ قَبْلَ أَنْ يُحْدِثَ مَا أَحْدَثَ."
            },
            {
                "hadithNo": "54",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Sufyan said: \"The people used to narrate from Jabir before he showed what he showed. And when he showed what he showed, the people suspected his Hadith, and some people abandoned him.\" It was said to him: \"What did he show?\" He said: \"Belief in Ar-Raj'ah (return to this life after death and before the Day of Judgement).\"",
                "hadithArabic": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ قَالَ كَانَ النَّاسُ يَحْمِلُونَ عَنْ جَابِرٍ قَبْلَ أَنْ يُظْهِرَ مَا أَظْهَرَ فَلَمَّا أَظْهَرَ مَا أَظْهَرَ اتَّهَمَهُ النَّاسُ فِي حَدِيثِهِ وَتَرَكَهُ بَعْضُ النَّاسِ فَقِيلَ لَهُ وَمَا أَظْهَرَ؟ قَالَ الْإِيمَانَ بِالرَّجْعَةِ."
            },
            {
                "hadithNo": "55",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Yahya Al-Himmani said: \"Qabisah and his brother narrated us that they heard Al-Jarrah bin Malih say: 'I heard Jabir bin Yazid say: \"I have seventy thousand Ahadith, all from Abu Ja'far from the Prophet (s.a.w).\"",
                "hadithArabic": "و حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو يَحْيَى الْحِمَّانِيُّ حَدَّثَنَا قَبِيصَةُ وَأَخُوهُ أَنَّهُمَا سَمِعَا الْجَرَّاحَ بْنَ مَلِيحٍ يَقُولُ: سَمِعْتُ جَابِرًا يَقُولُ: عِنْدِي سَبْعُونَ أَلْفَ حَدِيثٍ عَنْ أَبِي جَعْفَرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّهَا."
            },
            {
                "hadithNo": "56",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Zuhair said: \"Jabir said\" - or \"I heard Jabir say: 'I have fifty thousand Ahadith, and I have not narrated any of them.' Then one day he narrated a Hadith and said: 'This is one of the fifty thousand.'\"",
                "hadithArabic": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ قَالَ سَمِعْتُ زُهَيْرًا يَقُولُ قَالَ جَابِرٌ أَوْ سَمِعْتُ جَابِرًا يَقُولُ: إِنَّ عِنْدِي لَخَمْسِينَ أَلْفَ حَدِيثٍ مَا حَدَّثْتُ مِنْهَا بِشَيْءٍ. قَالَ ثُمَّ حَدَّثَ يَوْمًا بِحَدِيثٍ فَقَالَ: هَذَا مِنْ الْخَمْسِينَ أَلْفًا."
            },
            {
                "hadithNo": "57",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Sallam bin Abi' Muti'' said: \"I heard Jabir Al-Ju'fi say: 'I have fifty thousand Hadith from the Prophet (s.a.w).\"'",
                "hadithArabic": "و حَدَّثَنِي إِبْرَاهِيمُ بْنُ خَالِدٍ الْيَشْكُرِيُّ قَالَ سَمِعْتُ أَبَا الْوَلِيدِ يَقُولُ سَمِعْتُ سَلَّامَ بْنَ أَبِي مُطِيعٍ يَقُولُ: سَمِعْتُ جَابِرًا الْجُعْفِيَّ يَقُولُ: عِنْدِي خَمْسُونَ أَلْفَ حَدِيثٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
            },
            {
                "hadithNo": "58",
                "chapterNo": "5",
                "hadithEnglish": "Sufyan said: \"I heard a man asking Jabir about the Verse of the Holy Qur'an: \"...Therefore I will not leave this land until my father permits me, or Allah decides my case and He is the Best of the judges. Jabir said: 'This has not been fulfilled yet.' Sufyan said: 'He is lying.'\" We said [to Sufyan]: \"What did he mean by that?\" He said: \"The Rafidah say that 'Ali is in the clouds, and we will not join any of his sons who rebel against the state, until a voice calls out to us from heaven\" - meaning 'Ali - \"who will tell us to go out and support so-and-so. Jabir said: 'This is the interpretation of this Verse.' But he was lying; it was about the brothers of Yusuf .''",
                "hadithArabic": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ رَجُلًا سَأَلَ جَابِرًا عَنْ قَوْلِهِ عَزَّ وَجَلَّ { فَلَنْ أَبْرَحَ الْأَرْضَ حَتَّى يَأْذَنَ لِي أَبِي أَوْ يَحْكُمَ اللَّهُ لِي وَهُوَ خَيْرُ الْحَاكِمِينَ } [يوسف:80] قال: فَقَالَ جَابِرٌ: لَمْ يَجِئْ تَأْوِيلُ هَذِهِ قَالَ سُفْيَانُ وَكَذَبَ فَقُلْنَا [لِسُفْيَانَ] وَمَا أَرَادَ بِهَذَا؟ فَقَالَ: إِنَّ الرَّافِضَةَ تَقُولُ إِنَّ عَلِيًّا فِي السَّحَابِ فَلَا نَخْرُجُ مَعَ مَنْ خَرَجَ مِنْ وَلَدِهِ حَتَّى يُنَادِيَ مُنَادٍ مِنْ السَّمَاءِ -يُرِيدُ عَلِيًّا- أَنَّهُ يُنَادِي اخْرُجُوا مَعَ فُلَانٍ يَقُولُ جَابِرٌ فَذَا تَأْوِيلُ هَذِهِ الْآيَةِ وَكَذَبَ، كَانَتْ فِي إِخْوَةِ يُوسُفَ [صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ]"
            },
            {
                "hadithNo": "59",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Sufyan said: \"I heard Jabir narrating nearly thirty thousand Ahadith, but I would not allow myself to mention any of them, even if I had such-and-such.'' [Muslim said]: I heard Abu Ghassan Muhammad bin 'Amr al-Razi say: \"I asked Jarir bin 'Abdul-Hamid: 'Did you meet Al-Harith bin Hasirah?' He said: 'Yes, he was a very quiet old man, who is hiding something serious.\"'",
                "hadithArabic": "و حَدَّثَنِي سَلَمَةُ حَدَّثَنَا الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ جَابِرًا يُحَدِّثُ بِنَحْوٍ مِنْ ثَلَاثِينَ أَلْفَ حَدِيثٍ مَا أَسْتَحِلُّ أَنْ أَذْكُرَ مِنْهَا شَيْئًا وَأَنَّ لِي كَذَا وَكَذَا.\r\nقَالَ مُسْلِم وَسَمِعْتُ أَبَا غَسَّانَ مُحَمَّدَ بْنَ عَمْرٍو الرَّازِيَّ قَالَ سَأَلْتُ جَرِيرَ بْنَ عَبْدِ الْحَمِيدِ، فَقُلْتُ: الْحَارِثُ بْنُ حَصِيرَةَ لَقِيتَهُ؟ قَالَ نَعَمْ شَيْخٌ طَوِيلُ السُّكُوتِ يُصِرُّ عَلَى أَمْرٍ عَظِيمٍ."
            },
            {
                "hadithNo": "60",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Hammad bin Zaid said: \"Ayyub mentioned a man one day and said: 'He is not careful about what he says.' And he mentioned another, and said: 'He adds to the number.\"'",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي جَمِيعًا عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَحْفُوا الشَّوَارِبَ وَأَعْفُوا اللِّحَى."
            },
            {
                "hadithNo": "61",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Hammad bin Zaid said: \"Ayyub said: 'I have a neighbor, then he mentioned some of his virtues, (then he said) but if he were to testify before me even concerning two date fruits, I would not find his testimony acceptable.\"'",
                "hadithArabic": "حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ قَالَ أَيُّوبُ: إِنَّ لِي جَارًا ثُمَّ ذَكَرَ مِنْ فَضْلِهِ وَلَوْ شَهِدَ [عِنْدِي] عَلَى تَمْرَتَيْنِ مَا رَأَيْتُ شَهَادَتَهُ جَائِزَةً."
            },
            {
                "hadithNo": "62",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Ma'mar said: \"I never saw Ayyub backbite about anyone except 'Abdul-Karim,\" meaning Abu Umayyah. \"He mentioned him and said: 'May Allah have mercy on him. He was not trustworthy, and he asked me about a Hadith of 'Ikrimah, then he said: \"I heard 'Ikrimah.\"",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَحَجَّاجُ بْنُ الشَّاعِرِ قَالَا :حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ قَالَ مَعْمَرٌ مَا رَأَيْتُ أَيُّوبَ اغْتَابَ أَحَدًا قَطُّ إِلَّا عَبْدَ الْكَرِيمِ يَعْنِي أَبَا أُمَيَّةَ فَإِنَّهُ ذَكَرَهُ فَقَالَ رَحِمَهُ اللَّهُ كَانَ غَيْرَ ثِقَةٍ لَقَدْ سَأَلَنِي عَنْ حَدِيثٍ لِعِكْرِمَةَ ثُمَّ قَالَ سَمِعْتُ عِكْرِمَةَ."
            },
            {
                "hadithNo": "63",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Hammam said: \"Abu Dawud Al-A'ma came to us and started saying: 'Al-Bara' narrated to us' and 'Zaid bin Arqam narrated to us.' We mentioned that to Qatadah and he said: 'He is lying, he never heard anything from them; rather he used to beg from the people at the time of the severe plague.\"'",
                "hadithArabic": "حَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ قَالَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا هَمَّامٌ قَالَ قَدِمَ عَلَيْنَا أَبُو دَاوُدَ الْأَعْمَى فَجَعَلَ يَقُولُ حَدَّثَنَا الْبَرَاءُ وَحَدَّثَنَا زَيْدُ بْنُ أَرْقَمَ فَذَكَرْنَا ذَلِكَ لِقَتَادَةَ فَقَالَ كَذَبَ مَا سَمِعَ مِنْهُمْ إِنَّمَا كَانَ ذَلِكَ سَائِلًا يَتَكَفَّفُ النَّاسَ زَمَنَ طَاعُونِ الْجَارِفِ."
            },
            {
                "hadithNo": "64",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Hammam said: \"Abu Dawud Al-A'ma entered upon Qatadah and when he left, they said: 'This man claims that he met eighteen men who had been present at (the battle at) Badr.' Qatadah said: 'He used to beg before the plague, and he has nothing to do with that at all, and he should not speak. By Allah, Al-Hasan did not narrate directly from anyone who had been present at Badr, and Sa'eed bin Al-Musayyab did not narrate directly from anyone who had been present at Badr, except for Sa'd bin Malik.\"'",
                "hadithArabic": "و حَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامٌ قَالَ دَخَلَ أَبُو دَاوُدَ الْأَعْمَى عَلَى قَتَادَةَ فَلَمَّا قَامَ قَالُوا إِنَّ هَذَا يَزْعُمُ أَنَّهُ لَقِيَ ثَمَانِيَةَ عَشَرَ بَدْرِيًّا فَقَالَ قَتَادَةُ هَذَا كَانَ سَائِلًا قَبْلَ الْجَارِفِ لَا يَعْرِضُ لشَيْءٍ مِنْ هَذَا وَلَا يَتَكَلَّمُ فِيهِ فَوَ اللَّهِ مَا حَدَّثَنَا الْحَسَنُ عَنْ بَدْرِيٍّ مُشَافَهَةً وَلَا حَدَّثَنَا سَعِيدُ بْنُ الْمُسَيَّبِ عَنْ بَدْرِيٍّ مُشَافَهَةً إِلَّا عَنْ سَعْدِ بْنِ مَالِكٍ."
            },
            {
                "hadithNo": "65",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Raqabah that Abu Ja'far Al-Hashimi Al-Madani used to fabricate Hadith, though the words were true, but they were not Ahadith from the Prophet (s.a.w), but he used to report that they were from the Prophet (s.a.w).",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ رَقَبَةَ أَنَّ أَبَا جَعْفَرٍ الْهَاشِمِيَّ الْمَدَنِيَّ كَانَ يَضَعُ أَحَادِيثَ كَلَامَ حَقٍّ وَلَيْسَتْ مِنْ أَحَادِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ يَرْوِيهَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ."
            },
            {
                "hadithNo": "66",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Shu'bah narrated from Yunus bin 'Ubaid who said:\" 'Amr bin 'Ubaid used to tell lies in Hadith.\"",
                "hadithArabic": "حَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ قَالَ حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ قَالَ أَبُو إِسْحَاقَ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ سُفْيَانَ و حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ شُعْبَةَ عَنْ يُونُسَ بْنِ عُبَيْدٍ قَالَ كَانَ عَمْرُو بْنُ عُبَيْدٍ يَكْذِبُ فِي الْحَدِيثِ."
            },
            {
                "hadithNo": "67",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Mu'adh bin Mu'adh said: \"I said to 'Awf bin Abi Jamilah that 'Amr bin 'Ubaid narrated to us, from Al-Hasan, that the Messenger of Allah (s.a.w) said: 'Whoever bears weapons against us is not one of us.' He said: \"Amr is lying, by Allah, but he wanted to use that to support his vile views.'\"",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ أَبُو حَفْصٍ قَالَ سَمِعْتُ مُعَاذَ بْنَ مُعَاذٍ يَقُولُ: قُلْتُ لِعَوْفِ بْنِ أَبِي جَمِيلَةَ إِنَّ عَمْرَو بْنَ عُبَيْدٍ حَدَّثَنَا عَنْ الْحَسَنِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \"مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا\" قَالَ كَذَبَ وَاللَّهِ! عَمْرٌو وَلَكِنَّهُ أَرَادَ أَنْ يَحُوزَهَا إِلَى قَوْلِهِ الْخَبِيثِ."
            },
            {
                "hadithNo": "68",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Hammad bin Zaid said: \"A man had been staying close to Ayyub and listening to him, then Ayyub noticed that he was missing. They said to him: 'O Abu Bakr, now he is staying close to 'Amr bin 'Ubaid.\"' Hammad said: \"One day while I was with Ayyub, and we had gone early to the market, he met that man. Ayyub greeted him with Salam and asked him, then Ayyub said to him: 'I have heard that you are staying close to that man.\"' Hammad asked: \"[Did] he name him,\" meaning 'Amr. \"He said: 'Yes, O Abu Bakr. He tells us weird things.' Ayyub said to him: 'We run away from' or 'we feel anxious about those weird things.'\"",
                "hadithArabic": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ كَانَ رَجُلٌ قَدْ لَزِمَ أَيُّوبَ وَسَمِعَ مِنْهُ فَفَقَدَهُ أَيُّوبُ فَقَالُوا له : يَا أَبَا بَكْرٍ إِنَّهُ قَدْ لَزِمَ عَمْرَو بْنَ عُبَيدٍ قَالَ حَمَّادٌ فَبَيْنَا أَنَا يَوْمًا مَعَ أَيُّوبَ وَقَدْ بَكَّرْنَا إِلَى السُّوقِ فَاسْتَقْبَلَهُ الرَّجُلُ فَسَلَّمَ عَلَيْهِ أَيُّوبُ وَسَأَلَهُ ثُمَّ قَالَ لَهُ أَيُّوبُ بَلَغَنِي أَنَّكَ لَزِمْتَ ذَاكَ الرَّجُلَ قَالَ حَمَّادٌ سَمَّاهُ يَعْنِي عَمْرًا قَالَ نَعَمْ يَا أَبَا بَكْرٍ إِنَّهُ يَجِيئُنَا بِأَشْيَاءَ غَرَائِبَ قَالَ يَقُولُ لَهُ أَيُّوبُ إِنَّمَا نَفِرُّ أَوْ نَفْرَقُ مِنْ تِلْكَ الْغَرَائِبِ."
            },
            {
                "hadithNo": "69",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Ibn Zaid, meaning, Hammad, said: \"It was said to Ayyub that 'Amr bin 'Ubaid narrated that Al-Hasan said: 'The drunkard is not to be flogged if he is intoxicated by consuming Nabidh.' He said: 'He is lying. I heard Al-Hasan say that the drunkard is to be flogged for drinking Nabidh.\"'",
                "hadithArabic": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا ابْنُ زَيْدٍ يَعْنِي حَمَّادًا قَالَ قِيلَ لِأَيُّوبَ إِنَّ عَمْرَو بْنَ عُبَيْدٍ رَوَى عَنْ الْحَسَنِ قَالَ: لَا يُجْلَدُ السَّكْرَانُ مِنْ النَّبِيذِ فَقَالَ كَذَبَ أَنَا سَمِعْتُ الْحَسَنَ يَقُولُ يُجْلَدُ السَّكْرَانُ مِنْ النَّبِيذِ."
            },
            {
                "hadithNo": "70",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Sallam bin Abi Muti' said: \"Ayyub heard that I was going to 'Amr, so he came to me one day and said: 'If you are not safe with his religion, bow can you be safe with his Ahadith?\"'",
                "hadithArabic": "و حَدَّثَنِي حَجَّاجٌ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ سَمِعْتُ سَلَّامَ بْنَ أَبِي مُطِيعٍ يَقُولُ: بَلَغَ أَيُّوبَ أَنِّي آتِي عَمْرًا فَأَقْبَلَ عَلَيَّ يَوْمًا، فَقَالَ: أَرَأَيْتَ رَجُلًا لَا تَأْمَنُهُ عَلَى دِينِهِ كَيْفَ تَأْمَنُهُ عَلَى الْحَدِيثِ."
            },
            {
                "hadithNo": "71",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Sufyan said: \"I beard Abu Musa say: ·'Amr bin 'Ubaid narrated to us, before he innovated.\"'",
                "hadithArabic": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ أَبَا مُوسَى يَقُولُ حَدَّثَنَا عَمْرُو بْنُ عُبَيْدٍ قَبْلَ أَنْ يُحْدِثَ."
            },
            {
                "hadithNo": "72",
                "chapterNo": "5",
                "hadithEnglish": "'Ubaidullah bin Mu'adh Al-Anbari narrated to me: \"My father narrated us: 'I wrote to Shu'bah asking him about Abu Shaibah, the Qadi of Wasit. He wrote to me saying: \"Do not write down anything from him, and tear up my letter.\"",
                "hadithArabic": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي قَالَ كَتَبْتُ إِلَى شُعْبَةَ أَسْأَلُهُ عَنْ أَبِي شَيْبَةَ قَاضِي وَاسِطٍ فَكَتَبَ إِلَيَّ لَا تَكْتُبْ عَنْهُ شَيْئًا وَمَزِّقْ كِتَابِي."
            },
            {
                "hadithNo": "73",
                "chapterNo": "5",
                "hadithEnglish": "Al-Hulwani narrated to me, he said: \"I heard 'Affan say: 'I told Hammad bin Salamah a Hadith from Salih Al-Murri from Thabit. He said: \"He is lying.\" And I told Hammam a Hadith from Salih Al-Murri and he said: \"He is lying.\"",
                "hadithArabic": "و حَدَّثَنَا الْحُلْوَانِيُّ قَالَ سَمِعْتُ عَفَّانَ قَالَ حَدَّثْتُ حَمَّادَ بْنَ سَلَمَةَ عَنْ صَالِحٍ الْمُرِّيِّ بِحَدِيثٍ عَنْ ثَابِتٍ فَقَالَ كَذَبَ وَحَدَّثْتُ هَمَّامًا عَنْ صَالِحٍ الْمُرِّيِّ بِحَدِيثٍ فَقَالَ كَذَبَ."
            },
            {
                "hadithNo": "74",
                "chapterNo": "5",
                "hadithEnglish": "Abu Dawud said: \"Shu'bah said to me: 'Go to Jarir bin Hazim and tell him: \"It is not permissible for you to narrate from Al-Hasan bin 'Umarah, because he tells lies.\" Abu Dawud said: \"I said to Shu'bah: 'How is that?' He said: 'He narrated to us from Al-Hakam things for which I find no basis.\"' He said: \"I said to him: 'What things?' He said: 'I asked Al-Hakam: \"Did the Prophet (s.a.w) offer the funeral prayer for those who were slain at Uhud?\" He said: \"He did not offer the prayer for them.\" But Al-Hasan bin 'Umarah said, narrating from Al-Hakam, from Miqsam, from Ibn 'Abbas, that the Prophet (s.a.w) offered the prayer for them and buried them. I said to Al-Hakam: \"What do you say about the children of Zina (children born out of wedlock)?\" He said: \"The funeral prayer should be offered for them.\" I said: \"From the Hadith of whom is that narrated?\" He said: \"It is narrated from Al-Hasan Al-Basri.\" But Al-Hasan bin 'Umarah said: \"Al-Hakam narrated to us from Yahya bin Al-Jazzar, from 'Ali, may Allah be pleased with him.\"",
                "hadithArabic": "و حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ قَالَ لِي شُعْبَةُ ائْتِ جَرِيرَ بْنَ حَازِمٍ فَقُلْ لَهُ: لَا يَحِلُّ لَكَ أَنْ تَرْوِيَ عَنْ الْحَسَنِ بْنِ عُمَارَةَ فَإِنَّهُ يَكْذِبُ قَالَ أَبُو دَاوُدَ قُلْتُ لِشُعْبَةَ وَكَيْفَ ذَاكَ؟ فَقَالَ حَدَّثَنَا عَنْ الْحَكَمِ بِأَشْيَاءَ لَمْ أَجِدْ لَهَا أَصْلًا -قَالَ-قُلْتُ لَهُ بِأَيِّ شَيْءٍ؟ قَالَ قُلْتُ لِلْحَكَمِ: أَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قَتْلَى أُحُدٍ؟ فَقَالَ لَمْ يُصَلِّ عَلَيْهِمْ فَقَالَ الْحَسَنُ بْنُ عُمَارَةَ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَيْهِمْ وَدَفَنَهُمْ قُلْتُ لِلْحَكَمِ مَا تَقُولُ فِي أَوْلَادِ الزِّنَا ؟ قَالَ يُصَلَّى عَلَيْهِمْ قُلْتُ مِنْ حَدِيثِ مَنْ يُرْوَى ؟ قَالَ يُرْوَى عَنْ الْحَسَنِ الْبَصْرِيِّ فَقَالَ الْحَسَنُ بْنُ عُمَارَةَ حَدَّثَنَا الْحَكَمُ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ عَلِيٍّ رضي الله عنه."
            },
            {
                "hadithNo": "75",
                "chapterNo": "5",
                "hadithEnglish": "Al-Hasan Al -Hulwani narrated to me, he said: \"I heard Yazid bin Harun, when he mentioned Ziyad bin Maimun, say: 'I swore that I would not narrate anything from him, or from Khalid bin Mahduj.' He said: 'I met Ziyad bin Maimun, and I asked him about a Hadith. He narrated it to me from Bakr Al-Muzani. Then I went back to him, and he narrated it to me from Muwarriq. Then I went back to him, and he narrated it to me from Al-Hasan.' And he used to accuse the two of them of lying.'' Al-Hulwani said: \"I heard ' Abdus-Samad, when I mentioned Ziyad bin Maimun in his presence, accuse him of lying.''",
                "hadithArabic": "و حَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ قَالَ سَمِعْتُ يَزِيدَ بْنَ هَارُونَ وَذَكَرَ زِيَادَ بْنَ مَيْمُونٍ فَقَالَ حَلَفْتُ أَلَّا أَرْوِيَ عَنْهُ شَيْئًا وَلَا عَنْ خَالِدِ بْنِ مَحْدُوجٍ وَقَالَ لَقِيتُ زِيَادَ بْنَ مَيْمُونٍ فَسَأَلْتُهُ عَنْ حَدِيثٍ فَحَدَّثَنِي بِهِ عَنْ بَكْرٍ الْمُزَنِيِّ ثُمَّ عُدْتُ إِلَيْهِ فَحَدَّثَنِي بِهِ عَنْ مُوَرِّقٍ ثُمَّ عُدْتُ إِلَيْهِ فَحَدَّثَنِي بِهِ عَنْ الْحَسَنِ وَكَانَ يَنْسُبُهُمَا إِلَى الْكَذِبِ.\r\nقَالَ الْحُلْوَانِيُّ سَمِعْتُ عَبْدَ الصَّمَدِ وَذَكَرْتُ عِنْدَهُ زِيَادَ بْنَ مَيْمُونٍ فَنَسَبَهُ إِلَى الْكَذِبِ."
            },
            {
                "hadithNo": "76",
                "chapterNo": "5",
                "hadithEnglish": "Mahmud bin Ghailan narrated to me, he said: \"I said to Abu Dawud At-Tayalisi: 'You have narrated a great deal from 'Abbad bin Mansur. How come you did not hear from him the Hadith of Al-'Attarah which was narrated to us by An-Nadr bin Shumail?' He said to me: 'Be quiet! 'Abdur-Rahman bin Mahdi and I met Ziyad bin Maimun and we asked him. We said to him: \"What are these Ahadith that you narrate from Anas?\" He said: \"What do you think of a man who commits a sin then repents; doesn't Allah accept his repentance?\" We said: \"Yes.'' He said: \"I did not hear either a little or a lot from Anas (meaning, nothing at all). If the people do not know, then you now know that I did not meet Anas.\" Abu Dawud said: \"After that, I heard that he was narrating and 'Abdur-Rahman and I went to him and he said: 'I repent.' Then after that he was narrating again, so we ignored him.\"",
                "hadithArabic": "و حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ قُلْتُ لِأَبِي دَاوُدَ الطَّيَالِسِيِّ قَدْ أَكْثَرْتَ عَنْ عَبَّادِ بْنِ مَنْصُورٍ فَمَا لَكَ لَمْ تَسْمَعْ مِنْهُ حَدِيثَ الْعَطَّارَةِ الَّذِي رَوَى لَنَا النَّضْرُ بْنُ شُمَيْلٍ قَالَ لِيَ اسْكُتْ فَأَنَا لَقِيتُ زِيَادَ بْنَ مَيْمُونٍ وَعَبْدَ الرَّحْمَنِ بْنَ مَهْدِيٍّ فَسَأَلْنَاهُ فَقُلْنَا لَهُ هَذِهِ الْأَحَادِيثُ الَّتِي تَرْوِيهَا عَنْ أَنَسٍ فَقَالَ أَرَأَيْتُمَا رَجُلًا يُذْنِبُ فَيَتُوبُ أَلَيْسَ يَتُوبُ اللَّهُ عَلَيْهِ؟ قَالَ قُلْنَا نَعَمْ قَالَ مَا سَمِعْتُ مِنْ أَنَسٍ مِنْ ذَا قَلِيلًا وَلَا كَثِيرًا إِنْ كَانَ لَا يَعْلَمُ النَّاسُ فَأَنْتُمَا لَا تَعْلَمَانِ أَنِّي لَمْ أَلْقَ أَنَسًا قَالَ أَبُو دَاوُدَ فَبَلَغَنَا بَعْدُ أَنَّهُ يَرْوِي فَأَتَيْنَاهُ أَنَا وَعَبْدُ الرَّحْمَنِ فَقَالَ أَتُوبُ ثُمَّ كَانَ بَعْدُ يُحَدِّثُ فَتَرَكْنَاهُ."
            },
            {
                "hadithNo": "77",
                "chapterNo": "5",
                "hadithEnglish": "Hasan Al-Hulwani narrated to me, he said: \"I heard Shababah say: \"Abdul-Quddus used to narrate to us and say: \"Suwaid bin 'Aqalah.\"' Shababah said: 'And I heard 'Abdul-Quddus say: \"The Messenger of Allah (s.a.w) forbade using Ar-Rawhu 'andan.\" It was said to him: \"What does that mean?\" He said: \"It means making a small window in a wall to let the breeze pass through.\" Muslim said: I heard 'Ubaidullah bin 'Umar Al-Qawariri say: \"I heard Hammad bin Zaid say to a man - a few days after Mahdi bin Hilal arrived : 'What is this tainted spring coming from your direction?' He said: 'Yes indeed, O Abu Isma'il.\"'",
                "hadithArabic": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ قَالَ سَمِعْتُ شَبَابَةَ قَالَ كَانَ عَبْدُ الْقُدُّوسِ يُحَدِّثُنَا فَيَقُولُ سُوَيْدُ بْنُ عَقَلَةَ قَالَ شَبَابَةُ وَسَمِعْتُ عَبْدَ الْقُدُّوسِ يَقُولُ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَّخَذَ الرَّوْحُ عَرْضًا قَالَ فَقِيلَ لَهُ أَيُّ شَيْءٍ هَذَا قَالَ يَعْنِي تُتَّخَذُ كُوَّةٌ فِي حَائِطٍ لِيَدْخُلَ عَلَيْهِ الرَّوْحُ.\r\n[قَالَ مُسْلِم] و سَمِعْت عُبَيْدَ اللَّهِ بْنَ عُمَرَ الْقَوَارِيرِيَّ يَقُولُ سَمِعْتُ حَمَّادَ بْنَ زَيْدٍ يَقُولُ لِرَجُلٍ بَعْدَ مَا جَلَسَ مَهْدِيُّ بْنُ هِلَالٍ بِأَيَّامٍ مَا هَذِهِ الْعَيْنُ الْمَالِحَةُ الَّتِي نَبَعَتْ قِبَلَكُمْ قَالَ نَعَمْ يَا أَبَا إِسْمَاعِيلَ."
            },
            {
                "hadithNo": "78",
                "chapterNo": "5",
                "hadithEnglish": "Al-Hasan Al-Hulwani narrated to me, he said: \"I heard 'Affan say: 'I heard Abu 'Awanah say: \"No Hadith reached me from Al-Hasan, but I bring it to Aban bin Abi 'Ayyash and he would recite it for me.\"'",
                "hadithArabic": "و حَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ قَالَ سَمِعْتُ عَفَّانَ قَالَ سَمِعْتُ أَبَا عَوَانَةَ قَالَ مَا بَلَغَنِي عَنْ الْحَسَنِ حَدِيثٌ إِلَّا أَتَيْتُ بِهِ أَبَانَ بْنَ أَبِي عَيَّاشٍ فَقَرَأَهُ عَلَيَّ."
            },
            {
                "hadithNo": "79",
                "chapterNo": "5",
                "hadithEnglish": "Suwaid bin Sa'eed narrated to me, he said: '\"Ali bin Mushir narrated to us: 'Hamzah Az-Zayyat and I heard approximately one thousand Ahadith from Aban bin Abi 'Ayyash.\"' 'Ali said: 'I met Hamzah, and he told me that he saw the Prophet (s.a.w) in a dream, and he told him what he had heard from Aban, and he did not recognize anything except a few things, five or six.\"'",
                "hadithArabic": "و حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ قَالَ سَمِعْتُ أَنَا وَحَمْزَةُ الزَّيَّاتُ مِنْ أَبَانَ بْنِ أَبِي عَيَّاشٍ نَحْوًا مِنْ أَلْفِ حَدِيثٍ قَالَ عَلِيٌّ فَلَقِيتُ حَمْزَةَ فَأَخْبَرَنِي أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَنَامِ فَعَرَضَ عَلَيْهِ مَا سَمِعَ مِنْ أَبَانَ فَمَا عَرَفَ مِنْهَا إِلَّا شَيْئًا يَسِيرًا خَمْسَةً أَوْ سِتَّةً."
            },
            {
                "hadithNo": "80",
                "chapterNo": "5",
                "hadithEnglish": "Zakariyya bin 'Adiyy said: \"Abu Ishaq AI-Fazari said to me: 'Write down from Baqiyyah whatever he narrates from those who are known, and do not write down what he narrates from those who are not known. And do not write down anything that Isma'il bin 'Ayyash narrated from those who are known nor those who are not known.\"'",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ قَالَ قَالَ لِي أَبُو إِسْحَاقَ الْفَزَارِيُّ: اكْتُبْ عَنْ بَقِيَّةَ مَا رَوَى عَنْ الْمَعْرُوفِينَ وَلَا تَكْتُبْ عَنْهُ مَا رَوَى عَنْ غَيْرِ الْمَعْرُوفِينَ وَلَا تَكْتُبْ عَنْ إِسْمَاعِيلَ بْنِ عَيَّاشٍ مَا رَوَى عَنْ الْمَعْرُوفِينَ وَلَا عَنْ غَيْرِهِمْ."
            },
            {
                "hadithNo": "81",
                "chapterNo": "5",
                "hadithEnglish": "Ishaq bin Ibrahim Al-Hanzali narrated to me, he said: \"I heard some of the companions of 'Abdullah say: 'Ibn Al-Mubarak said: \"What a good man Baqiyyah would be, were it not that he changes names into nicknames and nicknames into names. For a long time he used to narrate to us from Abu Sa'eed Al-Wuhazi, then we realized that that was 'Abdul-Quddus.\"",
                "hadithArabic": "و حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ قَالَ سَمِعْتُ بَعْضَ أَصْحَابِ عَبْدِ اللَّهِ قَالَ قَالَ ابْنُ الْمُبَارَكِ نِعْمَ الرَّجُلُ بَقِيَّةُ لَوْلَا أَنَّهُ كَانَ يَكْنِي الْأَسَامِيَ وَيُسَمِّي الْكُنَى كَانَ دَهْرًا يُحَدِّثُنَا عَنْ أَبِي سَعِيدٍ الْوُحَاظِيِّ فَنَظَرْنَا فَإِذَا هُوَ عَبْدُ الْقُدُّوسِ."
            },
            {
                "hadithNo": "82",
                "chapterNo": "5",
                "hadithEnglish": "Ahmad bin Yusuf Al-Azdi narrated to me, he said: \"I heard 'Abdur-Razzaq say: 'I never saw Ibn Al-Mubarak state bluntly that anyone was a liar, except in the case of 'Abdul-Quddus. I heard him say: \"He is a liar.\"",
                "hadithArabic": "و حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الْأَزْدِيُّ قَالَ سَمِعْتُ عَبْدَ الرَّزَّاقِ يَقُولُ مَا رَأَيْتُ ابْنَ الْمُبَارَكِ يُفْصِحُ بِقَوْلِهِ كَذَّابٌ إِلَّا لِعَبْدِ الْقُدُّوسِ فَإِنِّي سَمِعْتُهُ يَقُولُ لَهُ كَذَّابٌ."
            },
            {
                "hadithNo": "83",
                "chapterNo": "5",
                "hadithEnglish": "'Abdullah bin 'Abdur-Rahman Ad-Darimi narrated to me, he said: \"I heard Abu Nu'aim say - and he mentioned Al-Mu'alla bin 'Urfan - he said: 'Abu Wa'il narrated to us: \"Ibn Mas'ud came out to us at the battle of Siffeen.\"' Abu Nu'aim said: 'Do you think that he was resurrected after death?'\"",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ قَالَ سَمِعْتُ أَبَا نُعَيْمٍ وَذَكَرَ الْمُعَلَّى بْنَ عُرْفَانَ فَقَالَ قَالَ حَدَّثَنَا أَبُو وَائِلٍ قَالَ خَرَجَ عَلَيْنَا ابْنُ مَسْعُودٍ بِصِفِّينَ فَقَالَ أَبُو نُعَيْمٍ أَتُرَاهُ بُعِثَ بَعْدَ الْمَوْتِ؟."
            },
            {
                "hadithNo": "84",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that 'Affan bin Muslim said: \"We were with Isma'il bin 'Ulayyah and a man narrated a report from another man. I said that this one is not reliable. The man said: 'You are backbiting about him.' Isma'il said: 'He is not backbiting; rather he judged that he is not reliable.\"'",
                "hadithArabic": "حَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ وَحَسَنٌ الْحُلْوَانِيُّ كِلَاهُمَا عَنْ عَفَّانَ بْنِ مُسْلِمٍ قَالَ كُنَّا عِنْدَ إِسْمَاعِيلَ بْنِ عُلَيَّةَ فَحَدَّثَ رَجُلٌ عَنْ رَجُلٍ فَقُلْتُ إِنَّ هَذَا لَيْسَ بِثَبْتٍ قَالَ فَقَالَ الرَّجُلُ اغْتَبْتَهُ قَالَ إِسْمَاعِيلُ مَا اغْتَابَهُ وَلَكِنَّهُ حَكَمَ أَنَّهُ لَيْسَ بِثَبْتٍ."
            },
            {
                "hadithNo": "85",
                "chapterNo": "5",
                "hadithEnglish": "Bishr bin 'Umar said: \"I asked Malik bin Anas about Muhammad bin 'Abdur-Rahman, who narrated from Sa'eed bin Al-Musayyab. He said: 'He is not trustworthy.' I asked Malik bin Anas about Abu Al-Huwairith. He said: 'He is not trustworthy.' I asked him about Shu'bah from whom Ibn Abi Dhi'b narrated. He said: 'He is not trustworthy.' I asked him about Salilh, the freed slave of At-Taw'amah. He said: 'He is not trustworthy.' I asked him about Haram bin 'Uthman. He said: 'He is not trustworthy.' I asked Malik about these five. He said: 'They are not trustworthy in their Ahadith.' I asked him about another man whose name I have forgotten and he said: 'Have you seen him in my books?' I said: 'No.' He said: 'If he were trustworthy, you would have seen him in my books.'\"",
                "hadithArabic": "و حَدَّثَنَا أَبُو جَعْفَرٍ الدَّارِمِيُّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ قَالَ سَأَلْتُ مَالِكَ بْنَ أَنَسٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الَّذِي يَرْوِي عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ فَقَالَ لَيْسَ بِثِقَةٍ وَسَأَلْتُهُ عَنْ صَالِحٍ مَوْلَى التَّوْأَمَةِ فَقَالَ لَيْسَ بِثِقَةٍ وَسَأَلْتُهُ عَنْ أَبِي الْحُوَيْرِثِ فَقَالَ لَيْسَ بِثِقَةٍ وَسَأَلْتُهُ عَنْ شُعْبَةَ الَّذِي رَوَى عَنْهُ ابْنُ أَبِي ذِئْبٍ فَقَالَ لَيْسَ بِثِقَةٍ وَسَأَلْتُهُ عَنْ حَرَامِ بْنِ عُثْمَانَ فَقَالَ لَيْسَ بِثِقَةٍ وَسَأَلْتُ مَالِكًا عَنْ هَؤُلَاءِ الْخَمْسَةِ فَقَالَ لَيْسُوا بِثِقَةٍ فِي حَدِيثِهِمْ وَسَأَلْتُهُ عَنْ رَجُلٍ آخَرَ نَسِيتُ اسْمَهُ فَقَالَ هَلْ رَأَيْتَهُ فِي كُتُبِي قُلْتُ لَا قَالَ لَوْ كَانَ ثِقَةً لَرَأَيْتَهُ فِي كُتُبِي."
            },
            {
                "hadithNo": "86",
                "chapterNo": "5",
                "hadithEnglish": "Al-Fadl bin Sahl narrated to me, he said: \"Yahya bin Ma'in narrated to me: 'Hajjaj narrated to us: Ibn Abi Dhi'b narrated to us, from Shurahbil bin Sa'd, and he was accused.'\"",
                "hadithArabic": "و حَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ قَالَ حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ شُرَحْبِيلَ بْنِ سَعْدٍ وَكَانَ مُتَّهَمًا."
            },
            {
                "hadithNo": "87",
                "chapterNo": "5",
                "hadithEnglish": "Muhammad bin 'Abdullah bin Quhzadh narrated to me, he said: \"I heard Abu Ishaq At-Talaqani say: 'I heard Ibn Al-Mubarak say: If I had been given the choice between entering Paradise and meeting 'Abdullah bin Muharrir, I would have chosen to meet him then enter Paradise. But when I did see him, I realized that camel dung was dearer to me than him.\"",
                "hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ قَالَ سَمِعْتُ أَبَا إِسْحَاقَ الطَّالَقَانِيَّ يَقُولُ سَمِعْتُ ابْنَ الْمُبَارَكِ يَقُولُ: لَوْ خُيِّرْتُ بَيْنَ أَنْ أَدْخُلَ الْجَنَّةَ وَبَيْنَ أَنْ أَلْقَى عَبْدَ اللَّهِ بْنَ مُحَرَّرٍ لَاخْتَرْتُ أَنْ أَلْقَاهُ ثُمَّ أَدْخُلَ الْجَنَّةَ فَلَمَّا رَأَيْتُهُ كَانَتْ بَعْرَةٌ أَحَبَّ إِلَيَّ مِنْهُ."
            },
            {
                "hadithNo": "88",
                "chapterNo": "5",
                "hadithEnglish": "Al-Fadl bin Sahl narrated to me: \"Walid bin Salih narrated to us: \"Ubaidullah bin 'Amr said: 'Zaid - meaning Ibn Abi Unaysah - said: 'Do not accept any reports from my brother.\"'",
                "hadithArabic": "و حَدَّثَنِي الْفَضْلُ بْنُ سَهْلٍ حَدَّثَنَا وَلِيدُ بْنُ صَالِحٍ قَالَ قَالَ عُبَيْدُ اللَّهِ بْنُ عَمْرٍو قَالَ زَيْدٌ يَعْنِي ابْنَ أَبِي أُنَيْسَةَ لَا تَأْخُذُوا عَنْ أَخِي."
            },
            {
                "hadithNo": "89",
                "chapterNo": "5",
                "hadithEnglish": "Ahmad bin Ibrahim Ad-Dawraqi narrated to me, he said: \"Abdus-Salam Al-Wabisi told me: 'Abdullah bin Ja'far Ar-Raqqi narrated to me, that 'Ubaidullah bin 'Amr said: Yahya bin Abi Unaysah was a liar.\"",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ قَالَ حَدَّثَنِي عَبْدُ السَّلَامِ الْوَابِصِيُّ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو قَالَ كَانَ يَحْيَى بْنُ أَبِي أُنَيْسَةَ كَذَّابًا."
            },
            {
                "hadithNo": "90",
                "chapterNo": "5",
                "hadithEnglish": "Ahmad bin Ibrahim narrated to me, he said : \"Sulaiman bin Harb narrated to me that Hammad bin Zaid said: Mention of Farqad was made in the presence of Ayyub, and he said: Farqad is not a person of Hadith.\"",
                "hadithArabic": "حَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ حَرْبٍ عَنْ حَمَّادِ بْنِ زَيْدٍ قَالَ ذُكِرَ فَرْقَدٌ عِنْدَ أَيُّوبَ فَقَالَ إِنَّ فَرْقَدًا لَيْسَ صَاحِبَ حَدِيثٍ."
            },
            {
                "hadithNo": "91",
                "chapterNo": "5",
                "hadithEnglish": "'Abdur-Rahman bin Bishr Al-'Abdi narrated to me, he said: \"I heard Yahya bin Sa'eed Al-Qattan say, when mention was made in his presence of Muhammad bin 'Abdullah bin 'Ubaid bin 'Umair Al-Laithi, that he was very weak (in narration). It was said to Yahya: 'Weaker than Ya'qub bin 'Ata'?' He said: 'Yes.' Then he said: 'I did not think that anyone would narrate from Muhammad bin 'Abdullah bin 'Ubaid bin 'Umair.\"'",
                "hadithArabic": "و حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ الْعَبْدِيُّ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ الْقَطَّانَ ذُكِرَ عِنْدَهُ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ اللَّيْثِيُّ فَضَعَّفَهُ جِدًّا، فَقِيلَ لِيَحْيَى: أَضْعَفُ مِنْ يَعْقُوبَ بْنِ عَطَاءٍ؟ قَالَ نَعَمْ ثُمَّ قَالَ: مَا كُنْتُ أَرَى أَنَّ أَحَدًا يَرْوِي عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ."
            },
            {
                "hadithNo": "92",
                "chapterNo": "5",
                "hadithEnglish": "Bishr bin Hakam narrated to me, he said: \"I heard Yahya bin Sa'eed Al-Qattan describe Hakim bin Jubair, 'Abdul-A'la, and Yahya bin Musa bin Dinar as weak (in narration) - he said: 'His Hadith is nothing' - and he classed Musa bin Dihqan and 'Eisa bin Abi 'Eisa Al-Madani as weak. And I heard Al-Hasan bin 'Eisa say: 'Ibn Al-Mubarak said to me: \"When you come to Jarir, write down all of his knowledge except for reports from three people: Do not write down from him reports from 'Ubaidah bin Mu'attib, As-Sarri bin lsma'il and Muhammad bin Salim.\"",
                "hadithArabic": "حَدَّثَنِي بِشْرُ بْنُ الْحَكَمِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ الْقَطَّانَ ضَعَّفَ حَكِيمَ بْنَ جُبَيْرٍ وَعَبْدَ الْأَعْلَى وَضَعَّفَ يَحْيَى بْنَ مُوسَى بْنِ دِينَارٍ قَالَ حَدِيثُهُ رِيحٌ وَضَعَّفَ مُوسَى بْنَ دِهْقَانَ وَعِيسَى بْنَ أَبِي عِيسَى الْمَدَنِيَّ قَالَ وَسَمِعْتُ الْحَسَنَ بْنَ عِيسَى يَقُولُ قَالَ لِي ابْنُ الْمُبَارَكِ إِذَا قَدِمْتَ عَلَى جَرِيرٍ فَاكْتُبْ عِلْمَهُ كُلَّهُ إِلَّا حَدِيثَ ثَلَاثَةٍ لَا تَكْتُبْ حَدِيثَ عُبَيْدَةَ بْنِ مُعَتِّبٍ وَالسَّرِيِّ بْنِ إِسْمَعِيلَ وَمُحَمَّدِ بْنِ سَالِمٍ."
            }
        ]
    }
]