[
  {
    "SurahNumber": "18",
    "AyahNumber": "1",
    "NoteID": "2325",
    "Body": "See n. 2324 to xvii. 111. The theme of the last Sura,\\n\\t\\t\\t\\tthat Allah is good and worthy of all praise from His\\n\\t\\t\\t\\tcreatures, to whom He has granted a clear revelation, is\\n\\t\\t\\t\\tcontinued in this Sura. The spirit of man makes gradual\\n\\t\\t\\t\\tprogress upwards, through the grace and mercy of Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "1",
    "NoteID": "2326",
    "Body": "Some people's idea of a Sacred Book is that it should be\\n\\t\\t\\t\\tfull of mysteries-dark corners, ambiguous expressions,\\n\\t\\t\\t\\twords so far removed from human speech that they cover\\n\\t\\t\\t\\tanything or nothing. Pagan oracles were couched in\\n\\t\\t\\t\\tlanguage which suggested one meaning to the hearer and\\n\\t\\t\\t\\tclaimed to have the very opposite meaning in the light of\\n\\t\\t\\t\\tevents which actually happened subsequently. They were\\n\\t\\t\\t\\tdistinctly crooked, not straight. In the next verse the\\n\\t\\t\\t\\tword \"Straight\" (qaiyim) is used to characterize the\\n\\t\\t\\t\\tQur-an, in contrast to this word \"crooked\" ('iwaj). See\\n\\t\\t\\t\\talso xix. 36 n. 2488."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "2",
    "NoteID": "2327",
    "Body": "Qaiyim: straight, that which has no bends and no corners\\n\\t\\t\\t\\tto mystify people, that which speaks clearly and\\n\\t\\t\\t\\tunambiguously, that which guides to the right path. Cf.\\n\\t\\t\\t\\tix. 36, where the adjective is used for a straight usage,\\n\\t\\t\\t\\tin contrast to usages, which tend to mystify and deceive\\n\\t\\t\\t\\tpeople. The Qur-an is above all things straight, clear,\\n\\t\\t\\t\\tand perspicuous. Its directions are plain for everyone to\\n\\t\\t\\t\\tunderstand. Any book that deals with the highest\\n\\t\\t\\t\\tmysteries of spiritual life must necessarily have\\n\\t\\t\\t\\tportions whose full meaning is clearer to some minds than\\n\\t\\t\\t\\tto others not so well prepared. But here there is nowhere\\n\\t\\t\\t\\tany mystification, any desire to wrap up things in dark\\n\\t\\t\\t\\tsayings repugnant to human reason. Allah's purpose is to\\n\\t\\t\\t\\tgive clear warning of spiritual dangers and lead up to\\n\\t\\t\\t\\tthe highest bliss."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "3",
    "NoteID": "2328",
    "Body": "Cf. iv. 122, xliii. 71, lxv. 11, xcviii. 8."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "4",
    "NoteID": "2329",
    "Body": "The warning is not only needed for those who deny Allah\\n\\t\\t\\t\\tor deny His Message, but also for those whose false ideas\\n\\t\\t\\t\\tof Allah degrade religion in supposing that Allah begot a\\n\\t\\t\\t\\tson, for Allah is One and is High above any ideas of\\n\\t\\t\\t\\tphysical reproduction."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "5",
    "NoteID": "2330",
    "Body": "The attribution of a son \"begotten\" to Allah has no basis\\n\\t\\t\\t\\tin fact or in reason. It is only a \"word\" or \"saying\"\\n\\t\\t\\t\\tthat issues out of their mouths. It is not even a dogma\\n\\t\\t\\t\\tthat is reasoned out or can be explained in any way that\\n\\t\\t\\t\\tis consistent with the sublime attributes of Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "6",
    "NoteID": "2331",
    "Body": "In a reasonable world the preaching of a reasonable Faith\\n\\t\\t\\t\\tlike that of Islam would win universal acceptance. But\\n\\t\\t\\t\\tthe world is not altogether reasonable. It caused great\\n\\t\\t\\t\\tdistress to the unselfish Preacher of Islam that his\\n\\t\\t\\t\\tMessage met with so much opposition. He wanted to point\\n\\t\\t\\t\\tthe way to salvation. He only got, in the Makkans period,\\n\\t\\t\\t\\tabuse from the chiefs of the Makkans-abuse and\\n\\t\\t\\t\\tpersecution, not only for himself but for the Truth which\\n\\t\\t\\t\\the was preaching. A heart less stout than his might have\\n\\t\\t\\t\\tbeen appalled at what seemed the hopeless task of\\n\\t\\t\\t\\treclaiming the world from falsehood, superstition,\\n\\t\\t\\t\\tselfishness, wrong, and oppression. He is here consoled,\\n\\t\\t\\t\\tand told that he was not to fret himself to death: he was\\n\\t\\t\\t\\tnobly doing his duty, and, as after-events showed, the\\n\\t\\t\\t\\tseed of Truth was already germinating, although this was\\n\\t\\t\\t\\tnot visible at the time. Besides, these \"chiefs\" and\\n\\t\\t\\t\\t\"leaders\" were only strutting in false plumes: their\\n\\t\\t\\t\\tglory was soon to fade for ever."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "7",
    "NoteID": "2332",
    "Body": "This world's goods-,worldly power, glory, wealth,\\n\\t\\t\\t\\tposition, and all that men scramble for,-are but a\\n\\t\\t\\t\\tfleeting show. The possession or want of them does not\\n\\t\\t\\t\\tbetoken a man's real value or position in the coming\\n\\t\\t\\t\\tworld, the world which is to endure. Yet they have their\\n\\t\\t\\t\\tuses. They test a man's sterling quality. He who becomes\\n\\t\\t\\t\\ttheir slave loses rank in the next world. He who uses\\n\\t\\t\\t\\tthem if he gets them, and does not fall into despair if\\n\\t\\t\\t\\the does not get them, shows his true mettle and quality.\\n\\t\\t\\t\\tHis conduct proclaims him."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "8",
    "NoteID": "2333",
    "Body": "The fairest sights on the earth will become as dust and\\n\\t\\t\\t\\twaste when this earth vanishes, and true spiritual values\\n\\t\\t\\t\\tare restored."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "9",
    "NoteID": "2334",
    "Body": "A wonderful story or allegory is now referred to. Its\\n\\t\\t\\t\\tlessons are: (1) the relativity of Time, (2) the\\n\\t\\t\\t\\tunreality of the position of oppressor and oppressed,\\n\\t\\t\\t\\tpersecutor and presecuted, on this earth, (3) the truth\\n\\t\\t\\t\\tof the final Resurrection, when true values will be\\n\\t\\t\\t\\trestored, and (4) the potency of Faith and Prayer to lead\\n\\t\\t\\t\\tto the Right."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "9",
    "NoteID": "2335",
    "Body": "The unbelieving Quraish were in the habit of putting\\n\\t\\t\\t\\tposers to the holy Prophet-questions which they got from\\n\\t\\t\\t\\tChristians and Jews, which they thought the Prophet would\\n\\t\\t\\t\\tbe unable to answer. In this way they hoped to discredit\\n\\t\\t\\t\\thim. One of these questions was about the floating\\n\\t\\t\\t\\tChristian story of the Seven Sleepers of Ephesus. The\\n\\t\\t\\t\\tProphet not only told them the main story but pointed out\\n\\t\\t\\t\\tthe variations that were current, and rebuked men for\\n\\t\\t\\t\\tdisputing about such details (xviii. 22). Most important\\n\\t\\t\\t\\tof all, he treated the story (under inspiration) as a\\n\\t\\t\\t\\tparable, pointing to lessons of the highest value. This\\n\\t\\t\\t\\tis Revelation in the highest sense of the term. The story\\n\\t\\t\\t\\tis recapitulated in n. 2337 below."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "9",
    "NoteID": "2336",
    "Body": "Raqim = Inscription. So interpreted by the Jalalain, and\\n\\t\\t\\t\\tthe majority of Commentators agree. See n. 2337, below.\\n\\t\\t\\t\\tOthers think it was the name of the dog: see xviii. 18,\\n\\t\\t\\t\\tand n. 2350 below."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "10",
    "NoteID": "2337",
    "Body": "The bare Christian story (without the spiritual lessons\\n\\t\\t\\t\\ttaught in the Qur-an) is told in Gibbon's Decline and\\n\\t\\t\\t\\tFall of the Roman Empire (end of chapter 33). In the\\n\\t\\t\\t\\treign of a Roman Emperor who persecuted the Christians,\\n\\t\\t\\t\\tseven Christian youths of Ephesus left the town and hid\\n\\t\\t\\t\\tthemselves in a cave in a mountain near by. They fell\\n\\t\\t\\t\\tasleep, and remained asleep for some generations or\\n\\t\\t\\t\\tcenturies. When the wall which sealed up the cave was\\n\\t\\t\\t\\tbeing demolished, the youths awoke. They still thought of\\n\\t\\t\\t\\tthe world in which they had previously lived. They had no\\n\\t\\t\\t\\tidea of the duration of time. But when one of them went\\n\\t\\t\\t\\tto the town to purchase provisions, he found that the\\n\\t\\t\\t\\twhole world had changed. The Christian religion, instead\\n\\t\\t\\t\\tof being persecuted was fashionable: in fact it was now\\n\\t\\t\\t\\tthe State religion. His dress and speech, and the money\\n\\t\\t\\t\\twhich he brought, seemed to belong to another world. This\\n\\t\\t\\t\\tattracted attention. The great ones of the land visited\\n\\t\\t\\t\\tthe Cave, and verified the tale by questioning the man's\\n\\t\\t\\t\\tCompanions. When the story became very popular and\\n\\t\\t\\t\\tcirculated throughout the Roman Empire, we may well\\n\\t\\t\\t\\tsuppose that an Inscription was put up at the mouth of\\n\\t\\t\\t\\tthe Cave. See verse 9 and n. 2336. This inscription was\\n\\t\\t\\t\\tprobably to be seen for many years afterwards, as Ephesus\\n\\t\\t\\t\\twas a famous city on the west coast of Asia Minor, about\\n\\t\\t\\t\\tforty to fifty miles south of Smyrna. Later on, the\\n\\t\\t\\t\\tKhalifa Wathiq (842-846 A.D.) sent an expedition to\\n\\t\\t\\t\\texamine and identify the locality, as he did about the\\n\\t\\t\\t\\tZul-Qarnain barrier in Central Asia. A popular story\\n\\t\\t\\t\\tcirculating from mouth to mouth would necessarily be\\n\\t\\t\\t\\tvague as to dates and vary very much in details.\\n\\t\\t\\t\\tSomewhere about the 6th century A.D. a Syriac writer\\n\\t\\t\\t\\treduced it to writing. He suggested that the youths were\\n\\t\\t\\t\\tseven in number; that they went to sleep in the reign of\\n\\t\\t\\t\\tthe Emperor Decius (who reigned from 249 to 251 A.D., and\\n\\t\\t\\t\\twho was a violent persecutor of Christianity); and that\\n\\t\\t\\t\\tthey awoke in the reign of Theodosius 11, who reigned\\n\\t\\t\\t\\tfrom 408 to 450 A.D. In our literature Decius is known as\\n\\t\\t\\t\\tDaqyanus (from the adjectival Latin from Decianus), and\\n\\t\\t\\t\\tthe name stands as a symbol of injustice and oppression,\\n\\t\\t\\t\\tand also of things old fashioned and out-of-date, as res\\n\\t\\t\\t\\tDecianae must have been two or three centuries after\\n\\t\\t\\t\\tDecius."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "10",
    "NoteID": "2338",
    "Body": "The youths hid in the cave, but they trusted in Allah,\\n\\t\\t\\t\\tand made over their whole case to Him in prayer. Then\\n\\t\\t\\t\\tthey apparently fell asleep, and knew nothing of what was\\n\\t\\t\\t\\thappening in the world outside."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "11",
    "NoteID": "2339",
    "Body": "Drew (a veil) over their ears: i.e., sealed their ears,\\n\\t\\t\\t\\tso that they heard nothing. As they were in the Cave they\\n\\t\\t\\t\\tsaw nothing. So they were completely cut off from the\\n\\t\\t\\t\\touter world. It was as if they had died, with their\\n\\t\\t\\t\\tknowledge and ideas remaining at the point of time when\\n\\t\\t\\t\\tthey had entered the Cave. It is as if a watch stops at\\n\\t\\t\\t\\tthe exact moment of some accident, and any one taking it\\n\\t\\t\\t\\tup afterwards can precisely fix the time of the accident."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "12",
    "NoteID": "2340",
    "Body": "Roused them: or raised them up from their sleep or\\n\\t\\t\\t\\twhatever condition they had fallen into (xviii, 18), so\\n\\t\\t\\t\\tthat they began to perceive the things around them, but\\n\\t\\t\\t\\tonly with the memories of the time at which they had\\n\\t\\t\\t\\tceased to be in touch with the world."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "12",
    "NoteID": "2341",
    "Body": "When they awoke to consciousness, they had lost all count\\n\\t\\t\\t\\tof time. Though they had all entered together, and lain\\n\\t\\t\\t\\ttogether in the same place for the same length of time,\\n\\t\\t\\t\\ttheir impressions of the time they had passed were quite\\n\\t\\t\\t\\tdifferent. Time is thus related to our own internal\\n\\t\\t\\t\\texperiences. We have to learn the lesson that men as good\\n\\t\\t\\t\\tas ourselves may yet differ as to their reactions to\\n\\t\\t\\t\\tcertain facts, and that in such matters disputes are\\n\\t\\t\\t\\tunseemly. It is best to say, \"Allah knows best\" (xviii.\\n\\t\\t\\t\\t19)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "13",
    "NoteID": "2342",
    "Body": "Their Faith carried them higher and higher on the road to\\n\\t\\t\\t\\tTruth. Faith is cumulative. Each step leads higher and\\n\\t\\t\\t\\thigher, by the grace and mercy of Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "14",
    "NoteID": "2343",
    "Body": "So that they were not afraid to speak out openly, and\\n\\t\\t\\t\\tprotest the truth of the Unity which they clearly saw in\\n\\t\\t\\t\\ttheir own minds and hearts."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "14",
    "NoteID": "2344",
    "Body": "We may suppose them to have taken their stand and made a\\n\\t\\t\\t\\tpublic protest before they betook themselves to the Cave\\n\\t\\t\\t\\t(xviii. 16). The story really begins at xviii. 13, and\\n\\t\\t\\t\\tthe verses xviii. 9-12 may be considered as introductory.\\n\\t\\t\\t\\tAs the emphasis is on spiritual lessons, the facts stated\\n\\t\\t\\t\\tin the introductory part are passed over lightly in the\\n\\t\\t\\t\\tstory."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "15",
    "NoteID": "2345",
    "Body": "Besides the heathen gods, the cult of the Emperors also\\n\\t\\t\\t\\tbecame fashionable in the Roman Empire in the first three\\n\\t\\t\\t\\tcenturies of the Christian Era. The statue of Diana\\n\\t\\t\\t\\t(Artemis) at Ephesus had been one of the wonders of the\\n\\t\\t\\t\\tancient world. The city was a great seaport and the\\n\\t\\t\\t\\tcapital of Roman Asia. We may therefore imagine how the\\n\\t\\t\\t\\theathen cults must have flourished there. St. Paul spent\\n\\t\\t\\t\\tthree years preaching there, and was mobbed and\\n\\t\\t\\t\\tassaulted, and compelled to leave (Acts, xix. 1-4)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "16",
    "NoteID": "2346",
    "Body": "That is, 'do not be afraid of anything: put your whole\\n\\t\\t\\t\\tcase in the hands of Allah: at present you are being\\n\\t\\t\\t\\tpersecuted; he will solve your difficulties and give you\\n\\t\\t\\t\\tease and comfort'. The public protest ends at verse 15.\\n\\t\\t\\t\\tIn verse 16 they are taking counsel among themselves.\\n\\t\\t\\t\\tAfter they go into the Cave, verse 17 introduces us to\\n\\t\\t\\t\\tthe scene where they are lying in the midst of the Cave\\n\\t\\t\\t\\tin tranquil confidence in Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "17",
    "NoteID": "2347",
    "Body": "In the latitude of Ephesus, 38 degrees north, i.e., well\\n\\t\\t\\t\\tabove the sun's northern declination, a cave opening to\\n\\t\\t\\t\\tnorth, would never have the heat of the sun within it, as\\n\\t\\t\\t\\tthe sunny side would be the south. If the youths lay on\\n\\t\\t\\t\\ttheir backs with their faces looking to the north, i.e.,\\n\\t\\t\\t\\ttowards the entrance of the Cave, the sun would rise on\\n\\t\\t\\t\\ttheir right side, declining to the south, and set on\\n\\t\\t\\t\\ttheir left sides, leaving them cool and comfortable."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "17",
    "NoteID": "2348",
    "Body": "The youths, having faith and trust in Allah, found safety\\n\\t\\t\\t\\tand refuge in the Cave. They were protected from the\\n\\t\\t\\t\\tpersecution and violence of the heathen. Their prayer\\n\\t\\t\\t\\t(xviii. 16) was heard."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "18",
    "NoteID": "2349",
    "Body": "Perhaps their eyes were open, even though their senses\\n\\t\\t\\t\\twere sealed in sleep. They turned about on their sides as\\n\\t\\t\\t\\tmen do in sleep."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "18",
    "NoteID": "2350",
    "Body": "The name of their dog is traditionally known as Qitmir,\\n\\t\\t\\t\\tbut see n. 2336 above."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "18",
    "NoteID": "2351",
    "Body": "This graphic picture of the sleepers explains the human\\n\\t\\t\\t\\tmechanism by which their safety was ensured by Allah from\\n\\t\\t\\t\\ttheir Pagan enemies."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "19",
    "NoteID": "2352",
    "Body": "This is the point of the story. Their own human\\n\\t\\t\\t\\timpressions were to be compared, each with the other.\\n\\t\\t\\t\\tThey were to be made to see that with the best goodwill\\n\\t\\t\\t\\tand the most honest enquiry they might reach different\\n\\t\\t\\t\\tconclusions; that they were not to waste their time in\\n\\t\\t\\t\\tvain controversies, but to get on to the main business of\\n\\t\\t\\t\\tlife; and that Allah alone had full knowledge of the\\n\\t\\t\\t\\tthings that seem to us so strange, or inconsistent, or\\n\\t\\t\\t\\tinexplicable, or that produce different impressions on\\n\\t\\t\\t\\tdifferent minds. If they entered the Cave in the morning\\n\\t\\t\\t\\tand woke up in the afternoon, one of them might well\\n\\t\\t\\t\\tthink they had been there only a few hours-only part of a\\n\\t\\t\\t\\tday. This relative or fallacious impression of Time also\\n\\t\\t\\t\\tgives us an inkling of the state when there will be no\\n\\t\\t\\t\\tTime, of the Resurrection when all our little impressions\\n\\t\\t\\t\\tof this life will be corrected by the final Reality. This\\n\\t\\t\\t\\tmystery of time has puzzled many contemplative minds. Cf.\\n\\t\\t\\t\\t\"Dark time that haunts us with the briefness of our days\"\\n\\t\\t\\t\\t(Thomas Wolfe in \"Of Time and the River\")."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "19",
    "NoteID": "2353",
    "Body": "They now give up barren controversy and come to the\\n\\t\\t\\t\\tpractical business of life. But their thoughts are\\n\\t\\t\\t\\tconditioned by the state of things that existed when they\\n\\t\\t\\t\\tentered the Cave. The money they carried was the money\\n\\t\\t\\t\\tcoined in the reign of the monarch who persecuted the\\n\\t\\t\\t\\tReligion of Unity and favoured the false cults of\\n\\t\\t\\t\\tPaganism."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "19",
    "NoteID": "2354",
    "Body": "Best food:, i.e., purest, most wholesome, perhaps also\\n\\t\\t\\t\\tmost suitable for those who rejected idol worship, i.e.,\\n\\t\\t\\t\\tnot dedicated to idols. For they still imagined the world\\n\\t\\t\\t\\tin the same state in which they had known it before they\\n\\t\\t\\t\\tentered the Cave."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "20",
    "NoteID": "2355",
    "Body": "They think that the world had not changed, and that the\\n\\t\\t\\t\\tfierce persecution they knew. was still raging, under\\n\\t\\t\\t\\twhich a man had to pay by his life for his religious\\n\\t\\t\\t\\tfaith, if he could not conform to Pagan worship."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "20",
    "NoteID": "2356",
    "Body": "That is, never succeed in keeping your religion. To\\n\\t\\t\\t\\tbecome a renegade, to give up the Truth which you have\\n\\t\\t\\t\\twon, simply on account of the fear of men, is the most\\n\\t\\t\\t\\tdespicable form of cowardice, and would rightly close the\\n\\t\\t\\t\\tdoor of salvation if strict justice were to be done. But\\n\\t\\t\\t\\teven then Allah's Mercy comes to the coward's aid so long\\n\\t\\t\\t\\tas the door of repentance is open."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "21",
    "NoteID": "2357",
    "Body": "Thus: in this way, by these means, i.e., by the sending\\n\\t\\t\\t\\tout of one of the Sleepers with the old money to the town\\n\\t\\t\\t\\tto buy provisions. His old-fashioned dress, appearance,\\n\\t\\t\\t\\tand speech, and the old uncurrent money which he brought,\\n\\t\\t\\t\\tat once drew the attention of people to him. When they\\n\\t\\t\\t\\tlearnt his story, they realised that Allah, Who can\\n\\t\\t\\t\\tprotect His servants thus and raise them up from sleep\\n\\t\\t\\t\\tafter such a long time, has power to raise up men for the\\n\\t\\t\\t\\tResurrection, and that His promise of goodness and mercy\\n\\t\\t\\t\\tto those who serve Him is true and was exemplified in\\n\\t\\t\\t\\tthis striking way. On the other hand, to the men of the\\n\\t\\t\\t\\tCave themselves, it became clear that Allah can change\\n\\t\\t\\t\\tthe situation before we are aware, and our hope in Him is\\n\\t\\t\\t\\tnot futile, and that even when we are on the brink of\\n\\t\\t\\t\\tdespair, a revolution is surely working in the world\\n\\t\\t\\t\\tbefore the world itself realises it."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "21",
    "NoteID": "2358",
    "Body": "The perversity of man is such that as soon as ever a\\n\\t\\t\\t\\tglimpse of truth becomes manifest, men fall into\\n\\t\\t\\t\\tcontroversies about it. The Sleepers could not judge\\n\\t\\t\\t\\tabout the duration of their stay in the Cave, but they\\n\\t\\t\\t\\twisely left the matter and attended to the urgent\\n\\t\\t\\t\\tbusiness of their lives. The townsfolk could not agree as\\n\\t\\t\\t\\tto the significance of the event; they fell to discussing\\n\\t\\t\\t\\timmaterial details. What sort of a memorial should they\\n\\t\\t\\t\\traise?-a house or a place of worship or a tablet? The\\n\\t\\t\\t\\tplace of worship was built. But the real significance was\\n\\t\\t\\t\\tmissed until explained in the Qur-an."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "22",
    "NoteID": "2359",
    "Body": "The controversy in after ages raged about the number of\\n\\t\\t\\t\\tthe Sleepers: were they three or five or seven? People\\n\\t\\t\\t\\tanswered, not from knowledge, but from conjecture.\\n\\t\\t\\t\\tGibbon's version, which has now become best known, makes\\n\\t\\t\\t\\tthe number of Sleepers seven. The point was immaterial:\\n\\t\\t\\t\\tthe real point was the spiritual lesson."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "22",
    "NoteID": "2360",
    "Body": "The true significance of the story is known only to a\\n\\t\\t\\t\\tfew. Most men discuss futile details, which are not in\\n\\t\\t\\t\\ttheir knowledge."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "22",
    "NoteID": "2361",
    "Body": "It is unprofitable to enter such immaterial controversies\\n\\t\\t\\t\\tand many others that have been waged about Religion by\\n\\t\\t\\t\\tshallow men from time immemorial. Yet, if there is a\\n\\t\\t\\t\\tmatter of clear knowledge from experience that matters,\\n\\t\\t\\t\\twe must openly proclaim it, that the world may be brought\\n\\t\\t\\t\\tto listen to Allah's Truth."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "22",
    "NoteID": "2362",
    "Body": "Vulgar story-mongers as such know little of the true\\n\\t\\t\\t\\tsignificance of stories and parables. We have a clear\\n\\t\\t\\t\\texposition in the Qur-an. What need is there to go into\\n\\t\\t\\t\\tdetails of the number of men in the Cave, or of the time\\n\\t\\t\\t\\tthey remained there?"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "24",
    "NoteID": "2363",
    "Body": "Verses 23 and 24 are parenthetical. We must never rely\\n\\t\\t\\t\\tupon our own resources so much as to forget Allah. If by\\n\\t\\t\\t\\tany chance we do forget, we must come back to Him and\\n\\t\\t\\t\\tkeep Him in remembrance, as did the Companions of the\\n\\t\\t\\t\\tCave."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "24",
    "NoteID": "2364",
    "Body": "In geometry the perfect circle is an ideal. Any given\\n\\t\\t\\t\\tcircle that we draw is not so perfect that we cannot draw\\n\\t\\t\\t\\tone closer to the ideal. So in our life, there is always\\n\\t\\t\\t\\tthe hope of drawing closer and closer to Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "25",
    "NoteID": "2365",
    "Body": "This verse should be read with the next verse. In the\\n\\t\\t\\t\\tfloating oral tradition the duration of time in the Cave\\n\\t\\t\\t\\twas given differently in different versions. When the\\n\\t\\t\\t\\ttradition was reduced to writing, some Christian writers\\n\\t\\t\\t\\t(e.g., Simeon Metaphrastes) named 372 years, some less.\\n\\t\\t\\t\\tIn round numbers 300 years in the solar Calendar would\\n\\t\\t\\t\\tamount to 309 in the lunar Calendar. But the next verse\\n\\t\\t\\t\\tpoints out that all these are mere conjectures: the\\n\\t\\t\\t\\tnumber is known to Allah alone. The authority on which\\n\\t\\t\\t\\tGibbon relies mentions two definite reigns, that of\\n\\t\\t\\t\\tDecius (249-251 A.D.) and that of Theodosius 11 (408-450\\n\\t\\t\\t\\tA.D.). Taking 250 and 450, we get an interval of 200\\n\\t\\t\\t\\tyears. But the point of the story does not lie in the\\n\\t\\t\\t\\tname of any given Emperor, but in the fact that the\\n\\t\\t\\t\\tbeginning of the period coincided with an Emperor who\\n\\t\\t\\t\\tpersecuted: the Emperor's name at the end of the period\\n\\t\\t\\t\\tmay be taken as approximately correct, because the story\\n\\t\\t\\t\\twas recorded within two generations afterwards. One of\\n\\t\\t\\t\\tthe worst Emperors to persecute the Christians was Nero\\n\\t\\t\\t\\twho reigned from 54 to 68. If we took the end of his\\n\\t\\t\\t\\treign (A.D. 68) as the initial point, and (say) 440 A.D.\\n\\t\\t\\t\\tas the final point, we get the 372 years of Simeon\\n\\t\\t\\t\\tMetaphrastes. But none of these writers knew any more\\n\\t\\t\\t\\tthan we do. Our best course is to follow the Quranic\\n\\t\\t\\t\\tinjunction, \"Say, Allah knows best how long they stayed\"\\n\\t\\t\\t\\t(xviii. 26). There is also a rebuke implied: 'do not\\n\\t\\t\\t\\timitate these men who love mischievous controversies!'\\n\\t\\t\\t\\tAfter all, we are given the narrative more as a parable\\n\\t\\t\\t\\tthan as a story."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "26",
    "NoteID": "2366",
    "Body": "Who are \"they\" in this sentence? They may be the\\n\\t\\t\\t\\tCompanions of the Cave, for they put themselves under the\\n\\t\\t\\t\\tprotection of Allah, and disowned all attribution of\\n\\t\\t\\t\\tpartners to Him. Or \"they\" may refer to the people in\\n\\t\\t\\t\\tgeneral who go wrong and become \"Mushriks\" i.e.,\\n\\t\\t\\t\\tattribute imaginary partners to Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "26",
    "NoteID": "2367",
    "Body": "His Command: i.e., Allah's sovereignty of the world, or\\n\\t\\t\\t\\tin His Judgment on the Day of Judgment."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "27",
    "NoteID": "2368",
    "Body": "His Words: His Commands, Decrees, Orders."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "28",
    "NoteID": "2369",
    "Body": "Cf. vi. 52 and n. 870. The true servants of Allah are\\n\\t\\t\\t\\tthose whose hearts are turned to Him morning, noon, and\\n\\t\\t\\t\\tnight, and who seek not worldly gain, but Allah's Grace,\\n\\t\\t\\t\\tAllah's own Self, His Presence and nearness. Even if they\\n\\t\\t\\t\\tare poor in this world's goods, their society gives far\\n\\t\\t\\t\\tmore inward and spiritual satisfaction than worldly\\n\\t\\t\\t\\tgrandeur or worldly attractions."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "28",
    "NoteID": "2370",
    "Body": "For those who stray from Allah's path, Allah's Grace is\\n\\t\\t\\t\\tever anxious: it seeks to reclaim them and bring them\\n\\t\\t\\t\\tback to the path. If such a one resists, and follows his\\n\\t\\t\\t\\town lusts, a point is reached when his case becomes\\n\\t\\t\\t\\thopeless. Allah's Grace does not then reach him, and he\\n\\t\\t\\t\\tis abandoned to his pride and insolence. Beware of\\n\\t\\t\\t\\tfollowing the example or advice of such a one or seeking\\n\\t\\t\\t\\this society, or hankering after his wretched idols."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "29",
    "NoteID": "2371",
    "Body": "Our choice in our limited Free-will involves a\\n\\t\\t\\t\\tcorresponding personal responsibility. We are offered the\\n\\t\\t\\t\\tTruth: again and again is it pressed on our attention. If\\n\\t\\t\\t\\twe reject it, we must take all the terrible consequences\\n\\t\\t\\t\\twhich are prefigured in the Fire of Hell. Its flames and\\n\\t\\t\\t\\troof will completely enclose us like a tent. Ordinarily\\n\\t\\t\\t\\tthere is water to quench the heat of thirst: here the\\n\\t\\t\\t\\tonly drink will be like molten brass, thick, heavy,\\n\\t\\t\\t\\tburning, sizzling. Before it reaches the mouth of the\\n\\t\\t\\t\\tunfortunates, drops of it will scald their faces as it is\\n\\t\\t\\t\\tpoured out."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "30",
    "NoteID": "2372",
    "Body": "The righteous will be rewarded, as has been said again\\n\\t\\t\\t\\tand again, beyond their merits: xxviii. 84: xxx. 39. Not\\n\\t\\t\\t\\ta single good deed of theirs will lose its reward, and\\n\\t\\t\\t\\tthe mercy of Allah will blot out their sins."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "31",
    "NoteID": "2373",
    "Body": "Heaven is figured by all the pictures of ease and comfort\\n\\t\\t\\t\\twhich we can imagine in our present state: Gardens:\\n\\t\\t\\t\\tperpetual springs of crystal water, which we can see as\\n\\t\\t\\t\\tin a landscape from above; the finest and most costly\\n\\t\\t\\t\\tornaments; the most beautiful clothes to wear; green is\\n\\t\\t\\t\\tthe colour mentioned, because it is the most refreshing\\n\\t\\t\\t\\tto the eye, and fits in well with the Garden; the wearer\\n\\t\\t\\t\\ttakes the choice of fine silk or heavy brocade; and for\\n\\t\\t\\t\\trest and comfort, high thrones of dignity on which the\\n\\t\\t\\t\\tblessed ones recline."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "31",
    "NoteID": "2374",
    "Body": "This picture is in parallel contrast to the picture of\\n\\t\\t\\t\\tMisery in the last verse."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "32",
    "NoteID": "2375",
    "Body": "Here is a simple parable of the contrast between two men.\\n\\t\\t\\t\\tOne was purse-proud, and forgot that what he had was from\\n\\t\\t\\t\\tAllah, by way of a trust and a trial in this life. The\\n\\t\\t\\t\\tother boasted of nothing: his trust was in Allah. The\\n\\t\\t\\t\\tworldly wealth of the first was destroyed, and he had\\n\\t\\t\\t\\tnothing left. The second was the happier in the end."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "34",
    "NoteID": "2376",
    "Body": "The two men began to compare notes. The arrogant one was\\n\\t\\t\\t\\tpuffed up with his possessions, his income, and his large\\n\\t\\t\\t\\tfamily and following, and thought in his self-\\n\\t\\t\\t\\tcomplacency that it would last for ever. He was also\\n\\t\\t\\t\\twrong in looking down on his Companion, who, though less\\n\\t\\t\\t\\taffluent, was the better man of the two."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "35",
    "NoteID": "2377",
    "Body": "It was not wealth that ruined him, but the attitude of\\n\\t\\t\\t\\this mind. He was unjust, not so much to his neighbour, as\\n\\t\\t\\t\\tto his own soul. In his love of the material, he forgot\\n\\t\\t\\t\\tor openly defied the spiritual. As verse 37 shows, he\\n\\t\\t\\t\\ttook his companion with him, to impress him with his own\\n\\t\\t\\t\\timportance, but the companion was unmoved."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "36",
    "NoteID": "2378",
    "Body": "Here comes out the grasping spirit of the materialist. In\\n\\t\\t\\t\\this mind \"better\" means more wealth and more power, of\\n\\t\\t\\t\\tthe kind he was enjoying in this life, although in\\n\\t\\t\\t\\treality, even what he had, rested on hollow foundations\\n\\t\\t\\t\\tand was doomed to perish and bring him down with it."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "37",
    "NoteID": "2379",
    "Body": "The three stages of man's creation: first dust, or clay,\\n\\t\\t\\t\\titself created out of nothing and forming the physical\\n\\t\\t\\t\\tbasis of his body; then, out of the produce of the earth\\n\\t\\t\\t\\tas incorporated in the parents body, the sperm drop (with\\n\\t\\t\\t\\tthe corresponding receptive element), and then when the\\n\\t\\t\\t\\tdifferent elements were mixed in due proportion, and the\\n\\t\\t\\t\\tsoul was breathed into him, the fashioned man. Cf.\\n\\t\\t\\t\\tlxxxvii. 2, and xv. 28-29."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "39",
    "NoteID": "2380",
    "Body": "The companion's argument divides itself into five parts.\\n\\t\\t\\t\\t(1) He remonstrates against the proud man denying Allah.\\n\\t\\t\\t\\t(2) He, from his own spiritual experience, proclaims that\\n\\t\\t\\t\\tAllah is One and that He is good. (3) He points out to\\n\\t\\t\\t\\thim the better way of enjoying Allah's gifts, with\\n\\t\\t\\t\\tgratitude to Him. (4) He expresses contentment and\\n\\t\\t\\t\\tsatisfaction in Allah's dealings with him. (5) He gives a\\n\\t\\t\\t\\twarning of the fleeting nature of this world's goods and\\n\\t\\t\\t\\tthe certainty of Allah's punishment for inordinate\\n\\t\\t\\t\\tvanity."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "41",
    "NoteID": "2381",
    "Body": "The punishment was that of thunderbolts (husbanan), but\\n\\t\\t\\t\\tthe general meaning of the word includes any punishment\\n\\t\\t\\t\\tby way of a reckoning (hisab), and I think that an\\n\\t\\t\\t\\tearthquake is also implied, as it alters water-courses,\\n\\t\\t\\t\\tdiverts channels underground, throws up silt and sand,\\n\\t\\t\\t\\tand covers large areas with ruin."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "42",
    "NoteID": "2382",
    "Body": "\"Fruits\", \"spent\" , \"twisting of the hands\", should all\\n\\t\\t\\t\\tbe understood in a wide metaphorical sense, as well as\\n\\t\\t\\t\\tthe literal sense. He had great income and satisfaction,\\n\\t\\t\\t\\twhich were all gone. What resources he had lavished on\\n\\t\\t\\t\\this property! His thoughts had been engrossed on it; his\\n\\t\\t\\t\\thopes had been built on it; it had become the absorbing\\n\\t\\t\\t\\tpassion of his life. If he had only looked to Allah,\\n\\t\\t\\t\\tinstead of to the ephemeral goods of this world!"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "42",
    "NoteID": "2383",
    "Body": "In this case, in his mind, there was his own Self and his\\n\\t\\t\\t\\tMammon as rivals to Allah!"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "43",
    "NoteID": "2384",
    "Body": "He had built up connections and obliged dependants, and\\n\\t\\t\\t\\twas proud of having his \"quiver full\". But where were all\\n\\t\\t\\t\\tthings when the reckoning came? He could not help\\n\\t\\t\\t\\thimself; how could others be expected to help him!"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "44",
    "NoteID": "2385",
    "Body": "All else is vanity, uncertainty, the sport of Time. The\\n\\t\\t\\t\\tonly hope or truth is from Allah. Other rewards and other\\n\\t\\t\\t\\tsuccesses are illusory: the best Reward and the best\\n\\t\\t\\t\\tSuccess come from Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "45",
    "NoteID": "2386",
    "Body": "Rain-water is a good thing in itself, but it does not\\n\\t\\t\\t\\tlast, and you can build no solid foundations on it. It is\\n\\t\\t\\t\\tsoon absorbed in the earth, and produces the flourishing\\n\\t\\t\\t\\tappearance of grass and vegetation-for a time. Soon these\\n\\t\\t\\t\\tdecay, and become as dry stubble, which the least wind\\n\\t\\t\\t\\tfrom any quarter will blow about like a thing of no\\n\\t\\t\\t\\timportance. The water is gone, and so is the vegetation\\n\\t\\t\\t\\tto which it lent a brave show of luxuriance temporarily.\\n\\t\\t\\t\\tSuch is the life of this world, contrasted with the inner\\n\\t\\t\\t\\tand real Life, which looks to the Hereafter-Allah is the\\n\\t\\t\\t\\tonly enduring Power we can look to, supreme over all."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "46",
    "NoteID": "2387",
    "Body": "Other things are fleeting: but Good Deeds have a lasting\\n\\t\\t\\t\\tvalue in the sight of Allah. They are best as (or for)\\n\\t\\t\\t\\trewards in two ways: (1) they flow from us by the Grace\\n\\t\\t\\t\\tof Allah, and are themselves rewards for our Faith: (2)\\n\\t\\t\\t\\tthey become the foundation of our hopes for the highest\\n\\t\\t\\t\\trewards in the Hereafter."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "47",
    "NoteID": "2388",
    "Body": "On the Day of Judgment none of our present landmarks will\\n\\t\\t\\t\\tremain."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "48",
    "NoteID": "2389",
    "Body": "We shall stand as we were created, with none of the\\n\\t\\t\\t\\tadventitious possessions that we collected in this life,\\n\\t\\t\\t\\twhich will all have vanished."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "48",
    "NoteID": "2390",
    "Body": "The sceptics will now at length be convinced of the\\n\\t\\t\\t\\tReality which will be upon them."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "49",
    "NoteID": "2391",
    "Body": "Personal responsibility, for all deeds in this life will\\n\\t\\t\\t\\tthen be enforced. But it will be done with perfect\\n\\t\\t\\t\\tjustice. Expressed in the forms of this world, it will\\n\\t\\t\\t\\tamount to a clear statement of all we did in this life;\\n\\t\\t\\t\\tthe record will be put before us to convince us. As it\\n\\t\\t\\t\\twill be a perfect record, with no omissions and no wrong\\n\\t\\t\\t\\tentries, it will be perfectly convincing. Where there is\\n\\t\\t\\t\\tpunishment, it has been earned by the wrong-doer's own\\n\\t\\t\\t\\tdeeds, not imposed on him unjustly."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "50",
    "NoteID": "2392",
    "Body": "Cf. ii. 34, where the story is told of the fall of\\n\\t\\t\\t\\tmankind through Adam. Here the point is referred to in\\n\\t\\t\\t\\torder to bring home the individual responsibility of the\\n\\t\\t\\t\\terring soul. Iblis is your enemy; you have been told his\\n\\t\\t\\t\\thistory; will you prefer to go to him rather than to the\\n\\t\\t\\t\\tmerciful Allah, your Creator and Cherisher? What a false\\n\\t\\t\\t\\texchange you would make!'"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "50",
    "NoteID": "2393",
    "Body": "Cf. vi. 100, n. 929."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "50",
    "NoteID": "2394",
    "Body": "Satan's progeny: we need not take the epithet only in a\\n\\t\\t\\t\\tliteral sense. All his followers are also his progeny."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "50",
    "NoteID": "2395",
    "Body": "Out of the limited free-will that man has, if he were to\\n\\t\\t\\t\\tchoose Evil instead of Good, Satan instead of Allah, what\\n\\t\\t\\t\\ta dreadful choice it would be! It would really be an evil\\n\\t\\t\\t\\texchange. For man is Allah's creature, cared for and\\n\\t\\t\\t\\tcherished by Him. He abandons his Cherisher to become the\\n\\t\\t\\t\\tslave of his enemy!"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "51",
    "NoteID": "2396",
    "Body": "Allah wants man's good: how can He take Evil for His\\n\\t\\t\\t\\tpartner?"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "52",
    "NoteID": "2397",
    "Body": "Some Commentators construe: \"And We shall make a\\n\\t\\t\\t\\tpartition between them\": i.e., the Evil ones will not\\n\\t\\t\\t\\teven be seen by their misguided followers, much as the\\n\\t\\t\\t\\tlatter may go on calling on them."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "54",
    "NoteID": "2398",
    "Body": "If men had not cultivated the habit of contention and\\n\\t\\t\\t\\tobstinacy, they would have found that the parables and\\n\\t\\t\\t\\tsimilitudes of Scripture had fully met their\\n\\t\\t\\t\\tdifficulties, and they would gladly have obeyed the call\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "55",
    "NoteID": "2399",
    "Body": "But man's obstinacy or contrariness asks or calls for a\\n\\t\\t\\t\\trepetition of what happened to the wicked and those who\\n\\t\\t\\t\\trejected Faith in ancient times. Out of curiosity, or by\\n\\t\\t\\t\\tway of challenge, they seem to court the Punishment and\\n\\t\\t\\t\\task that it be brought to pass at once. But it will come\\n\\t\\t\\t\\tsoon enough, and then they will think it too early! Cf.\\n\\t\\t\\t\\txiii. 6 and n. 1810."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "56",
    "NoteID": "2400",
    "Body": "The Prophets of Allah are not sent to humour us with\\n\\t\\t\\t\\tdialectics or satisfy the vulgar curiosity for miracles\\n\\t\\t\\t\\tor dark unusual things. There is no \"crookedness\" (xviii.\\n\\t\\t\\t\\t1) in their preaching. They come to preach the Truth,-not\\n\\t\\t\\t\\tin an abstract way, but with special reference to our\\n\\t\\t\\t\\tconduct. They give us the good news of salvation lest we\\n\\t\\t\\t\\tdespair in the presence of Sin, and to warn us clearly of\\n\\t\\t\\t\\tthe dangers of Evil. Vain controversies about words only\\n\\t\\t\\t\\tweaken their mission, or turn it into ridicule. The\\n\\t\\t\\t\\tungodly have a trick also of treating the earnest\\n\\t\\t\\t\\tpreaching to them itself as a jest and ridiculing it."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "57",
    "NoteID": "2401",
    "Body": "Considering the power of sin, and how it gets hold of the\\n\\t\\t\\t\\thearts of men, and considering all the wrongs that men\\n\\t\\t\\t\\thave done, it is the height of folly and injustice on\\n\\t\\t\\t\\ttheir part to turn away from warnings which are given\\n\\t\\t\\t\\texpressly for their good. But a stage of callousness is\\n\\t\\t\\t\\treached, when, by their own choice, they have rendered\\n\\t\\t\\t\\tthemselves impervious to Allah's Grace. At that stage a\\n\\t\\t\\t\\tveil is put over their hearts and they are left alone for\\n\\t\\t\\t\\ta time, that they may commune with themselves and perhaps\\n\\t\\t\\t\\trepent and seek Allah's Mercy again. If they do not, it\\n\\t\\t\\t\\tis their own loss. See next verse."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "58",
    "NoteID": "2402",
    "Body": "Min duni-hi: should we take the pronoun to refer to \"the\\n\\t\\t\\t\\tappointed time\" or to \"your Lord\" mentioned at the\\n\\t\\t\\t\\tbeginning of the verse? Most Commentators take the former\\n\\t\\t\\t\\tview, and I have translated accordingly. But I agree with\\n\\t\\t\\t\\tthose who take the latter view, and the better\\n\\t\\t\\t\\ttranslation would be: \"But they have their appointed\\n\\t\\t\\t\\ttime, and except with Allah, they will find no refuge.\"\\n\\t\\t\\t\\tThat means that even during the period allowed them, when\\n\\t\\t\\t\\tthey are left to wander astray as they have rejected\\n\\t\\t\\t\\tAllah's Grace, Allah's Mercy is open to them if they will\\n\\t\\t\\t\\trepent and return; but nothing but Allah's Mercy can save\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "59",
    "NoteID": "2403",
    "Body": "The instances of exemplary Punishment in former times\\n\\t\\t\\t\\twere also subject to this rule, that Allah gives plenty\\n\\t\\t\\t\\tof rope to the wicked, in case they might turn, repent,\\n\\t\\t\\t\\tand obtain His Mercy."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "60",
    "NoteID": "2404",
    "Body": "This episode in the story of Moses is meant to illustrate\\n\\t\\t\\t\\tfour points. (1) Moses was learned in all the wisdom of\\n\\t\\t\\t\\tthe Egyptians. Even so that wisdom did not comprehend\\n\\t\\t\\t\\teverything, even as the whole stock of the knowledge of\\n\\t\\t\\t\\tthe present day, in the sciences and the arts, and in\\n\\t\\t\\t\\tliterature, (if it could be supposed to be gathered in\\n\\t\\t\\t\\tone individual), does not include all knowledge. Divine\\n\\t\\t\\t\\tknowledge, as far as man is concerned, is unlimited. Even\\n\\t\\t\\t\\tafter Moses received his divine mission, his knowledge\\n\\t\\t\\t\\twas not so perfect that it could not receive further\\n\\t\\t\\t\\tadditions. (2) Constant effort is necessary to keep our\\n\\t\\t\\t\\tknowledge square with the march of time, and such effort\\n\\t\\t\\t\\tMoses is shown to be making. (3) The mysterious man he\\n\\t\\t\\t\\tmeets (xviii. 65 and n. 2411), to whom Tradition assigns\\n\\t\\t\\t\\tthe name of Khidhr (literally, Green), is the type of\\n\\t\\t\\t\\tthat knowledge which is ever in contact with life as it\\n\\t\\t\\t\\tis actually lived. (4) There are paradoxes in life;\\n\\t\\t\\t\\tapparent loss may be real gain; apparent cruelty may be\\n\\t\\t\\t\\treal mercy; returning good for evil may really be justice\\n\\t\\t\\t\\tand not generosity (xviii. 79-82). Allah's wisdom\\n\\t\\t\\t\\ttranscends all human calculation."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "60",
    "NoteID": "2405",
    "Body": "The most probable geographical location (if any is\\n\\t\\t\\t\\trequired in a story that is a parable) is where the two\\n\\t\\t\\t\\tarms of the Red Sea join together, viz., the Gulf of\\n\\t\\t\\t\\t'Aqaba and the Gulf of Suez. They enclose the Sinai\\n\\t\\t\\t\\tPeninsula, in which Moses and the Israelites spent many\\n\\t\\t\\t\\tyears in their wanderings."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "60",
    "NoteID": "2406",
    "Body": "Huqub means a long but indefinite space of time.\\n\\t\\t\\t\\tSometimes it is limited to 80 years."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "61",
    "NoteID": "2407",
    "Body": "literally, 'the Junction of (the space) between the two,'\\n\\t\\t\\t\\ti.e., the point at which the two seas were united."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "61",
    "NoteID": "2408",
    "Body": "Moses was to go and find a servant of Allah, who would\\n\\t\\t\\t\\tinstruct him in such knowledge as he had not already got.\\n\\t\\t\\t\\tHe was to take a fish with him. The place where he was to\\n\\t\\t\\t\\tmeet his mysterious Teacher would be indicated by the\\n\\t\\t\\t\\tfact that the fish would disappear when he got to that\\n\\t\\t\\t\\tplace."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "62",
    "NoteID": "2409",
    "Body": "When they came to the Junction of the Seas, Moses forgot\\n\\t\\t\\t\\tabout the fish, and his attendant forgot to tell him of\\n\\t\\t\\t\\tthe fact that he had seen the fish escaping into the sea\\n\\t\\t\\t\\tin a marvellous way. They passed on, but the stages now\\n\\t\\t\\t\\tbecame heavier and heavier, and more fatiguing to Moses."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "63",
    "NoteID": "2410",
    "Body": "The attendant actually saw the fish swimming away in the\\n\\t\\t\\t\\tsea, and yet \"forgot\" to tell his master. In his case the\\n\\t\\t\\t\\t\"forgetting\" was more than forgetting. Inertia had made\\n\\t\\t\\t\\thim refrain from telling the important news. In such\\n\\t\\t\\t\\tmatters inertia is almost as bad as active spite, the\\n\\t\\t\\t\\tsuggestion of Satan."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "65",
    "NoteID": "2411",
    "Body": "One of Our servants: his name is not mentioned in the\\n\\t\\t\\t\\tQur-an, but Tradition gives it as Khidhr. Round him have\\n\\t\\t\\t\\tgathered a number of picturesque folk tales, with which\\n\\t\\t\\t\\twe are not here concerned. \"Khidhr\" means \"Green\": his\\n\\t\\t\\t\\tknowledge is fresh and green, and drawn out of the living\\n\\t\\t\\t\\tsources of life for it is drawn from Allah's own\\n\\t\\t\\t\\tKnowledge. He is a mysterious being, who has to be sought\\n\\t\\t\\t\\tout. He has the secrets of some of the paradoxes of Life,\\n\\t\\t\\t\\twhich ordinary people do not understand, or understand in\\n\\t\\t\\t\\ta wrong sense, as we shall see further on. The nearest\\n\\t\\t\\t\\tequivalent figure in the literature of the People of the\\n\\t\\t\\t\\tBook is Melchizedek or Melchisedek (the Greek form in the\\n\\t\\t\\t\\tNew Testament). In Gen. xiv. 18-20, he appears as king of\\n\\t\\t\\t\\tSalem, priest of the Most High God: he blesses Abraham,\\n\\t\\t\\t\\tand Abraham gives him tithes."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "65",
    "NoteID": "2412",
    "Body": "Khidhr had two special gifts from Allah: (1) Mercy from\\n\\t\\t\\t\\tHim, and (2) Knowledge from Him too. The first freed him\\n\\t\\t\\t\\tfrom the ordinary incidents of daily human life; and the\\n\\t\\t\\t\\tsecond entitied him to interpret the inner meaning and\\n\\t\\t\\t\\tmystery of events, as we shall see further on."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "66",
    "NoteID": "2413",
    "Body": "Moses, not understanding the full import of what he was\\n\\t\\t\\t\\tasking, makes a simple request. He wants to learn\\n\\t\\t\\t\\tsomething of the special Knowledge which Allah had\\n\\t\\t\\t\\tbestowed on Khidhr."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "67",
    "NoteID": "2414",
    "Body": "Khidhr smiles, and says that there will be many things\\n\\t\\t\\t\\twhich Moses will see with him, which Moses will not\\n\\t\\t\\t\\tcompletely understand and which will make Moses\\n\\t\\t\\t\\timpatient. The highest knowledge often seems paradoxical\\n\\t\\t\\t\\tto those who have not the key to it."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "68",
    "NoteID": "2415",
    "Body": "Khidhr does not blame Moses. Each one of us can only\\n\\t\\t\\t\\tfollow our own imperfect lights to the best of our\\n\\t\\t\\t\\tjudgment, but if we have Faith, we are saved many false\\n\\t\\t\\t\\tsteps."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "69",
    "NoteID": "2416",
    "Body": "Moses has Faith. He adopts the true attitude of the\\n\\t\\t\\t\\tlearner to the Teacher, and promises to obey in all\\n\\t\\t\\t\\tthings, with the help of Allah. The Teacher is doubtful,\\n\\t\\t\\t\\tbut permits him to follow him on condition that he asks\\n\\t\\t\\t\\tno questions about anything until the Teacher himself\\n\\t\\t\\t\\tmentions it first."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "71",
    "NoteID": "2417",
    "Body": "The explanation follows in xviii. 79."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "74",
    "NoteID": "2418",
    "Body": "The explanation follows in xviii. 80-81."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "77",
    "NoteID": "2419",
    "Body": "The inhabitants were churlish. They broke the universal\\n\\t\\t\\t\\tEastern rule of hospitality to strangers, and thus showed\\n\\t\\t\\t\\tthemselves beyond the pale of ordinary human courtesies.\\n\\t\\t\\t\\tNote that they would have been expected to offer\\n\\t\\t\\t\\thospitality of themselves, unasked. Here Moses and his\\n\\t\\t\\t\\tcompanion actually had to ask for hospitality and were\\n\\t\\t\\t\\trefused point-blank."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "77",
    "NoteID": "2420",
    "Body": "As they were refused hospitality, they should, as\\n\\t\\t\\t\\tself-respecting men, have shaken the dust of the town off\\n\\t\\t\\t\\ttheir feet, or shown their indignation in some way.\\n\\t\\t\\t\\tInstead of that, Khidhr actually goes and does a\\n\\t\\t\\t\\tbenevolent act. He rebuilds for them a falling wall, and\\n\\t\\t\\t\\tnever asks for any compensation for it. Perhaps he\\n\\t\\t\\t\\temployed local workmen for it and paid them wages, thus\\n\\t\\t\\t\\tactually benefiting a town which had treated him and his\\n\\t\\t\\t\\tcompanion so shabbily! Moses is naturally surprised and\\n\\t\\t\\t\\tasks, \"Could you not at least have asked for the cost?\""
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "78",
    "NoteID": "2421",
    "Body": "The story and the interpretation are given with the\\n\\t\\t\\t\\tgreatest economy of words. It would repay us to search\\n\\t\\t\\t\\tfor the meaning in terms of our own inner and outer\\n\\t\\t\\t\\texperience."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "79",
    "NoteID": "2422",
    "Body": "They went on the boat, which was plying for hire. Its\\n\\t\\t\\t\\towners were not even ordinary men who plied for trade.\\n\\t\\t\\t\\tThey had been reduced to great poverty, perhaps from\\n\\t\\t\\t\\taffluent circumstances, and deserved great commiseration,\\n\\t\\t\\t\\tthe more so as they preferred an honest calling to\\n\\t\\t\\t\\tbegging for charity. They did not know, but Khidhr did,\\n\\t\\t\\t\\tthat that boat, perhaps a new one, had been marked down\\n\\t\\t\\t\\tto be commandeered by an unjust king who seized on every\\n\\t\\t\\t\\tboat he could get-it may have been, for warlike purposes.\\n\\t\\t\\t\\tIf this boat had been taken away from these\\n\\t\\t\\t\\tself-respecting men, they would have been reduced to\\n\\t\\t\\t\\tbeggary, with no resources left them. By a simple act of\\n\\t\\t\\t\\tmaking it unseaworthy, the boat was saved from seizure.\\n\\t\\t\\t\\tThe owners could repair it as soon as the danger was\\n\\t\\t\\t\\tpast. Khidhr probably paid liberally in fares, and what\\n\\t\\t\\t\\tseemed an unaccountably cruel act was the greatest act of\\n\\t\\t\\t\\tkindness he could do in the circumstances."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "80",
    "NoteID": "2423",
    "Body": "This seemed at first sight even a more cruel act than\\n\\t\\t\\t\\tscuttling the boat. But the danger was also greater.\\n\\t\\t\\t\\tKhidhr knew that the youth was a potential parricide. His\\n\\t\\t\\t\\tparents were worthy, pious people, who had brought him up\\n\\t\\t\\t\\twith love. He had apparently gone wrong. Perhaps he had\\n\\t\\t\\t\\talready been guilty of murders and robberies and had\\n\\t\\t\\t\\tescaped the law by subtleties and fraud. See next note."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "81",
    "NoteID": "2424",
    "Body": "The son was practically an outlaw,-a danger to the public\\n\\t\\t\\t\\tand a particular source of grief to his righteous\\n\\t\\t\\t\\tparents. Even so, his summary capital punishment would\\n\\t\\t\\t\\thave been unjustified if Khidhr had been acting on his\\n\\t\\t\\t\\town. But Khidhr was not acting on his own: see the latter\\n\\t\\t\\t\\tpart of the next verse. The plural \"we\" also implies that\\n\\t\\t\\t\\the was not acting on his own. He was acting on higher\\n\\t\\t\\t\\tauthority and removing a public scourge, who was also a\\n\\t\\t\\t\\tsource of extreme sorrow and humiliation to his parents.\\n\\t\\t\\t\\tHis parents are promised a better-behaved son who would\\n\\t\\t\\t\\tlove them and be a credit to them."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "82",
    "NoteID": "2425",
    "Body": "The wall was in a ruinous state. If it had fallen, the\\n\\t\\t\\t\\ttreasure buried beneath it would have been exposed and\\n\\t\\t\\t\\twould certainly have been looted, among so churlish and\\n\\t\\t\\t\\tselfish a people. See n. 2419 above. The treasure had\\n\\t\\t\\t\\tbeen collected and buried by a righteous man. It was not,\\n\\t\\t\\t\\tin any sense of the word, ill-gotten gains; it was buried\\n\\t\\t\\t\\texpressly in the interests of the orphans by their father\\n\\t\\t\\t\\tbefore his death. It was intended that the orphans should\\n\\t\\t\\t\\tgrow up and safely take possession of their heritage. It\\n\\t\\t\\t\\twas also expected that they would be righteous men like\\n\\t\\t\\t\\ttheir father, and use the treasure in good works and in\\n\\t\\t\\t\\tadvancing righteousness among an otherwise wicked\\n\\t\\t\\t\\tcommunity. There was thus both public and private\\n\\t\\t\\t\\tinterests involved in all the three incidents. In the\\n\\t\\t\\t\\tsecond incident Khidhr uses the word \"we\", showing that\\n\\t\\t\\t\\the was associating in his act the public authorities of\\n\\t\\t\\t\\tthe place, who had been eluded by the outlaw."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "82",
    "NoteID": "2426",
    "Body": "Age of full strength: Cf. xvii. 34 and n. 2218."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "82",
    "NoteID": "2427",
    "Body": "Those who act, not from a whim or a private impulse of\\n\\t\\t\\t\\ttheir own, but from higher authority, have to bear the\\n\\t\\t\\t\\tblame, for acts of the greatest wisdom and utility."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "83",
    "NoteID": "2428",
    "Body": "Literally, \"the Two-horned one\", the King with the Two\\n\\t\\t\\t\\tHorns, or the Lord of the Two Epochs. Who was he? In what\\n\\t\\t\\t\\tage, and where did he live? The Qur-an gives us no\\n\\t\\t\\t\\tmaterial on which we can base a positive answer. Nor is\\n\\t\\t\\t\\tit necessary to find an answer, as the story is treated\\n\\t\\t\\t\\tas a Parable. Popular opinion identifies Zul-qarnain with\\n\\t\\t\\t\\tAlexander the Great. An alternative suggestion is an\\n\\t\\t\\t\\tancient Persian king, or a pre-historic Himyarite King.\\n\\t\\t\\t\\tZul-qarnain was a most powerful king, but it was Allah,\\n\\t\\t\\t\\tWho, in His universal Plan, gave him power and provided\\n\\t\\t\\t\\thim with the ways and means for his great work. His sway\\n\\t\\t\\t\\textended over East and West, and over people of diverse\\n\\t\\t\\t\\tcivilisations. He was just and righteous, not selfish or\\n\\t\\t\\t\\tgrasping. He protected the weak and punished the unlawful\\n\\t\\t\\t\\tand the turbulent. Three of his expeditions are described\\n\\t\\t\\t\\tin the text, each embodying a great ethical idea involved\\n\\t\\t\\t\\tin the possession of kingship or power."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "84",
    "NoteID": "2429",
    "Body": "Great was his power and great were his opportunities\\n\\t\\t\\t\\t(\"ways and means\"), which he used for justice and\\n\\t\\t\\t\\trighteousness. But he recognised that his power and\\n\\t\\t\\t\\topportunities were given to him as a trust by Allah. He\\n\\t\\t\\t\\thad faith, and did not forget Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "86",
    "NoteID": "2430",
    "Body": "This is the first of the three episodes here mentioned,\\n\\t\\t\\t\\this expedition to the west. \"Reaching the setting of the\\n\\t\\t\\t\\tsun\" does not mean the extreme west, for there is no such\\n\\t\\t\\t\\tthing. West and East are relative terms. It means a\\n\\t\\t\\t\\twestern expedition terminated by a \"spring of murky\\n\\t\\t\\t\\twater.\" This has puzzled Commentators, and they have\\n\\t\\t\\t\\tunderstood this to mean the dark, tempestuous sea. If\\n\\t\\t\\t\\tZul-qarnain is Alexander the Great, the reference is\\n\\t\\t\\t\\teasily understood to be to Lychnitis (now Ochrida), west\\n\\t\\t\\t\\tof Macedonia. It is fed entirely by underground springs\\n\\t\\t\\t\\tin a limestone region, where the water is never very\\n\\t\\t\\t\\tclear."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "86",
    "NoteID": "2431",
    "Body": "He had great power and a great opportunity. He got\\n\\t\\t\\t\\tauthority over a turbulent and unruly people. Was he\\n\\t\\t\\t\\tgoing to be severe with them and chastise them, or was he\\n\\t\\t\\t\\tgoing to seek peace at any price, i.e., to wink at\\n\\t\\t\\t\\tviolence and injustice so long as it did not affect his\\n\\t\\t\\t\\tpower? He chose the better course, as described in the\\n\\t\\t\\t\\tnext verse. To protect the weak and the innocent, he\\n\\t\\t\\t\\tpunished the guilty and the headstrong, but he remembered\\n\\t\\t\\t\\talways that the true Punishment would come in the\\n\\t\\t\\t\\tHereafter-the true and final justice before the throne of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "87",
    "NoteID": "2432",
    "Body": "Though most powerful among kings, he remembered that his\\n\\t\\t\\t\\tpower was but human, and given by Allah. His punishments\\n\\t\\t\\t\\twere but tentative, to preserve the balance of this life\\n\\t\\t\\t\\tas he could appraise it. Even if his punishment was\\n\\t\\t\\t\\tcapital (\"wrong doer sent back to his Lord\") it was\\n\\t\\t\\t\\tnothing compared to the dire consequences of sin, in the\\n\\t\\t\\t\\tfinal Justice of Allah."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "88",
    "NoteID": "2433",
    "Body": "He never said like Pharaoh, \"I am your Lord Most High!\"\\n\\t\\t\\t\\t(lxxix. 24). On the contrary his punishments were humbly\\n\\t\\t\\t\\tregulated as not being final, and he laid more stress on\\n\\t\\t\\t\\tthe good he could do to those who lived normal lives in\\n\\t\\t\\t\\tfaith and righteousness. His rule was easy to them: he\\n\\t\\t\\t\\timposed no heavy tasks because of his power, but gave\\n\\t\\t\\t\\tevery opportunity to rich and poor for the exercise of\\n\\t\\t\\t\\tvirtue and goodness. Such is the spiritual lesson to be\\n\\t\\t\\t\\tlearned from the first episode."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "90",
    "NoteID": "2434",
    "Body": "We now come to the second episode. This is an expedition\\n\\t\\t\\t\\tto the east. \"Rising of the sun\" has a meaning\\n\\t\\t\\t\\tcorresponding to \"setting of the sun\" in xviii. 86, as\\n\\t\\t\\t\\texplained in n. 2430."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "90",
    "NoteID": "2435",
    "Body": "The people here lived very simple lives. Perhaps the\\n\\t\\t\\t\\tclimate was hot, and they required neither roofs over\\n\\t\\t\\t\\ttheir heads, nor much clothing to protect them from the\\n\\t\\t\\t\\tsun. What did he do with them? See next note."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "91",
    "NoteID": "2436",
    "Body": "They were a primitive people. He did not fuss over their\\n\\t\\t\\t\\tprimitiveness, but left them in the enjoyment of peace\\n\\t\\t\\t\\tand tranquillity in their own way. In this he was wise.\\n\\t\\t\\t\\tPower is apt to be intolerant and arrogant, and to\\n\\t\\t\\t\\tinterfere in everything that does not accord with its own\\n\\t\\t\\t\\tglorification. Not so Zul-qarnain. He recognised his own\\n\\t\\t\\t\\tlimitations in the sight of Allah: man never completely\\n\\t\\t\\t\\tunderstands his own position, but if he devoutly looks to\\n\\t\\t\\t\\tAllah, he will live and let live. This is the spiritual\\n\\t\\t\\t\\tlesson from the second episode."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "93",
    "NoteID": "2437",
    "Body": "Cf. xxi. 96."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "93",
    "NoteID": "2438",
    "Body": "It does not mean that they had no speech. It means that\\n\\t\\t\\t\\tthey did not understand the speech of the Conqueror. But\\n\\t\\t\\t\\tthey had parleys with him (through interpreters), as is\\n\\t\\t\\t\\tevident from the verses following (xviii. 94-98)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "94",
    "NoteID": "2439",
    "Body": "What we are mainly concerned with is its interpretation.\\n\\t\\t\\t\\tThe Conqueror had now arrived among a people who were\\n\\t\\t\\t\\tdifferent in speech and race from him, but not quite\\n\\t\\t\\t\\tprimitive, for they were skilled in the working of\\n\\t\\t\\t\\tmetals, and could furnish blocks (or bricks) of iron,\\n\\t\\t\\t\\tmelt metals with bellows or blow-pipes, and prepare\\n\\t\\t\\t\\tmolten lead (xviii. 96). Apparently they were a peaceable\\n\\t\\t\\t\\tand industrious race, much subject to incursions from\\n\\t\\t\\t\\twild tribes who are called Gog and Magog. Against these\\n\\t\\t\\t\\ttribes they were willing to purchase immunity by paying\\n\\t\\t\\t\\tthe Conqueror tribute in return for protection. The\\n\\t\\t\\t\\tpermanent protection they wanted was the closing of a\\n\\t\\t\\t\\tmountain gap through which the incursions were made."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "95",
    "NoteID": "2440",
    "Body": "Zul-qarnain was not greedy and did not want to impose a\\n\\t\\t\\t\\ttribute to be carried away from an industrious\\n\\t\\t\\t\\tpopulation. He understood the power which Allah had given\\n\\t\\t\\t\\thim, to involve duties and responsibilities on his\\n\\t\\t\\t\\tpart-the duty of protecting his subjects without imposing\\n\\t\\t\\t\\ttoo heavy a taxation on them. He would provide the motive\\n\\t\\t\\t\\tforce and organising skill. Would they obey him and\\n\\t\\t\\t\\tprovide the material and labour, so that they could close\\n\\t\\t\\t\\tthe gap with a strong barrier, probably with well-secured\\n\\t\\t\\t\\tgates? The word radm, translated \"Barrier,\" does not\\n\\t\\t\\t\\tnecessarily mean a wall, but rather suggests a blocked\\n\\t\\t\\t\\tdoor or entrance."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "96",
    "NoteID": "2441",
    "Body": "I understand the defences erected to have been a strong\\n\\t\\t\\t\\tbarrier of iron, with iron Gates. The jambs of the Gates\\n\\t\\t\\t\\twere constituted with blocks or bricks of iron, and the\\n\\t\\t\\t\\tinterstices filled up with molten lead, so as to form an\\n\\t\\t\\t\\timpregnable mass of metal. It may be that there was a\\n\\t\\t\\t\\tstone wall also, but that is not mentioned. There was\\n\\t\\t\\t\\tnone in the Iron Gate near Bukhara."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "96",
    "NoteID": "2442",
    "Body": "Made it (red) as fire. What does \"it\" refer to? Probably\\n\\t\\t\\t\\tto the iron, either in sheets or blocks, to be welded\\n\\t\\t\\t\\twith the molten lead."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "97",
    "NoteID": "2443",
    "Body": "The iron wall and gates and towers were sufficiently high\\n\\t\\t\\t\\tto prevent their being scaled and sufficiently strong\\n\\t\\t\\t\\twith welded metal to resist any attempt to dig through\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "98",
    "NoteID": "2444",
    "Body": "After all the effort which Zul-qarnain has made for their\\n\\t\\t\\t\\tprotection, he claims no credit for himself beyond that\\n\\t\\t\\t\\tof discharging his duty as a ruler. He turns their\\n\\t\\t\\t\\tattention to Allah, Who has provided the ways and means\\n\\t\\t\\t\\tby which they can be helped and protected. But all such\\n\\t\\t\\t\\thuman precautions are apt to become futile. The time must\\n\\t\\t\\t\\tcome when they will crumble into dust. Allah has said so\\n\\t\\t\\t\\tin His Revelation; and His word is true. And so the\\n\\t\\t\\t\\tlesson from the third episode is: Take human precautions\\n\\t\\t\\t\\tand do all in your power to protect yourselves from evil.\\n\\t\\t\\t\\tBut no protection is complete unless you seek the help\\n\\t\\t\\t\\tand grace of Allah. The best of our precautions must\\n\\t\\t\\t\\tcrumble to dust when the appointed Day arrives."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "99",
    "NoteID": "2445",
    "Body": "And so we pass on to the Last Days before the Great\\n\\t\\t\\t\\tSummons comes from Allah. All human barriers will be\\n\\t\\t\\t\\tswept away. There will be tumultuous rushes. The Trumpet\\n\\t\\t\\t\\twill be blown, and the Judgment will be set on foot."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "100",
    "NoteID": "2446",
    "Body": "If men had scoffed at Faith and the Hereafter, their eyes\\n\\t\\t\\t\\twill be opened now, and they will see the terrible\\n\\t\\t\\t\\tReality."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "101",
    "NoteID": "2447",
    "Body": "Those very men who refused to see the many Signs of Allah\\n\\t\\t\\t\\twhich in this world convey His Message and to hear the\\n\\t\\t\\t\\tWord of the Lord when it came to them, will then see\\n\\t\\t\\t\\twithout any mistake the consequences fully brought up\\n\\t\\t\\t\\tbefore them."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "103",
    "NoteID": "2448",
    "Body": "That is, those who prided themselves on their works in\\n\\t\\t\\t\\tthis life, and now find that those works are of no avail.\\n\\t\\t\\t\\tTheir loss is all the greater because they had a\\n\\t\\t\\t\\tmisplaced confidence in their own deeds or in the\\n\\t\\t\\t\\tassistance of false \"protectors\". Allah is the only\\n\\t\\t\\t\\tProtector: no one else's protection is of any use."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "104",
    "NoteID": "2449",
    "Body": "Many people have such a smug sense of self-righteousness\\n\\t\\t\\t\\tthat while they go on doing wrong, they think that they\\n\\t\\t\\t\\tare acquiring merit. So, in charity, all the elements\\n\\t\\t\\t\\tthat make for outward show or selfishness (as to get some\\n\\t\\t\\t\\tworldly advantage) nullify the deed of charity. In the\\n\\t\\t\\t\\tsame way hypocrites sometimes affect to be surprised that\\n\\t\\t\\t\\ttheir declared effort for somebody's good is not\\n\\t\\t\\t\\tappreciated, when they are really seeking some hidden\\n\\t\\t\\t\\tgain or false glory for themselves. The sincere are only\\n\\t\\t\\t\\tthose who believe in their spiritual responsibility and\\n\\t\\t\\t\\tact as in Allah's sight."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "105",
    "NoteID": "2450",
    "Body": "What weight can be attached to works behind which the\\n\\t\\t\\t\\tmotives are not pure, or are positively evil? They are\\n\\t\\t\\t\\teither wasted or count against those who seek to pass\\n\\t\\t\\t\\tthem off as meritorious!"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "106",
    "NoteID": "2451",
    "Body": "False motives, pretence, deception, and hypocrisy,\\n\\t\\t\\t\\tflourish because people do not take the higher life\\n\\t\\t\\t\\tseriously. In effect they treat it as a jest. Signs and\\n\\t\\t\\t\\tMessengers are sent as a special and personal Mercy from\\n\\t\\t\\t\\tAllah, and for such things the first person singular is\\n\\t\\t\\t\\tused as in this verse, even when it involves a sudden\\n\\t\\t\\t\\ttransition from the first person plural as in the last\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "107",
    "NoteID": "2452",
    "Body": "Firdaus in Persian means an enclosed place, a park. In\\n\\t\\t\\t\\ttechnical theological language the word is used for the\\n\\t\\t\\t\\tinner circle of Heaven, or the highest Heaven, the\\n\\t\\t\\t\\tdestination of those who perfectly fulfil both\\n\\t\\t\\t\\trequirements, viz.; a sound faith, and perfectly\\n\\t\\t\\t\\trighteous conduct. Small faults in either respect are\\n\\t\\t\\t\\tforgiven; the Mercy of Allah steps in."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "109",
    "NoteID": "2453",
    "Body": "The Words and Signs and Mercies of Allah are in all\\n\\t\\t\\t\\tCreation, and can never be fully set out in human\\n\\t\\t\\t\\tlanguage, however extended our means may be imagined to\\n\\t\\t\\t\\tbe."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "110",
    "NoteID": "2454",
    "Body": "Righteousness and true respect for Allah-which excludes\\n\\t\\t\\t\\tthe worship of anything else, whether idols, or deified\\n\\t\\t\\t\\tmen, or forces of nature, or faculties of man, or\\n\\t\\t\\t\\tSelf-these are the criteria of true worship."
  }
]
