[
  {
    "SurahNumber": "91",
    "AyahNumber": "1",
    "NoteID": "6147",
    "Body": "Six types are taken in three pairs, from Allah's mighty\\n\\t\\t\\t\\tworks in nature, as tokens or evidence of Allah's\\n\\t\\t\\t\\tprovidence and the contrasts in His sublime creation,\\n\\t\\t\\t\\twhich yet conduce to cosmic harmony (verses 1-6). Then\\n\\t\\t\\t\\t(verses 7-8) the soul of man, with internal order and\\n\\t\\t\\t\\tproportion in its capacities and faculties, as made by\\n\\t\\t\\t\\tAllah, is appealed to as having been endowed with the\\n\\t\\t\\t\\tpower of discriminating between right and wrong. Then the\\n\\t\\t\\t\\tconclusion is stated in verses 9-10, that man's success\\n\\t\\t\\t\\tor failure, prosperity or bankruptcy, would depend upon\\n\\t\\t\\t\\this keeping that soul pure or his corrupting it."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "2",
    "NoteID": "6148",
    "Body": "The first pair is the glorious sun, the source of our\\n\\t\\t\\t\\tlight and physical life, and the moon which follows or\\n\\t\\t\\t\\tacts as second to the sun for illuminating our world. The\\n\\t\\t\\t\\tmoon, when she is in the sky with the sun, is pale and\\n\\t\\t\\t\\tinconspicuous; in the sun's absence she shines with\\n\\t\\t\\t\\treflected light and may metaphorically be called the\\n\\t\\t\\t\\tsun's vicegerent. So with Revelation and the great\\n\\t\\t\\t\\tProphets who brought it; and the minor Teachers who\\n\\t\\t\\t\\tderive their light reflected, or perhaps doubly\\n\\t\\t\\t\\treflected, from the original source."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "3",
    "NoteID": "6149",
    "Body": "The next contrasted pair consists, not of luminaries, but\\n\\t\\t\\t\\tconditions, or periods of time, Day and Night. The Day\\n\\t\\t\\t\\treveals the sun's glory and the Night conceals it from\\n\\t\\t\\t\\tour sight. So there may be contrasts in our subjective\\n\\t\\t\\t\\treception of divine light, but it is there, working all\\n\\t\\t\\t\\tthe time, and must reappear in its own good time."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "5",
    "NoteID": "6150",
    "Body": "The next contrasted pair is the wonderful firmament on\\n\\t\\t\\t\\thigh, and the earth below our feet, stretching away to\\n\\t\\t\\t\\tour wide horizons. The sky gives us rain, and the earth\\n\\t\\t\\t\\tgives us food. Yet both work together; for the rain is\\n\\t\\t\\t\\tmoisture sucked up from the earth, and the food cannot\\n\\t\\t\\t\\tgrow without the heat and warmth of the sun. There are\\n\\t\\t\\t\\tmany other contrasts under this head; yet they all point\\n\\t\\t\\t\\tto unity."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "6",
    "NoteID": "6151",
    "Body": "The masdariya in Arabic, in this and the subsequent\\n\\t\\t\\t\\tclauses, is best translated in English by nouns. Thus\\n\\t\\t\\t\\twhat would literally be \"and the (wonderful) making or\\n\\t\\t\\t\\tconstruction of it\" or \"the fact of its (wonderful)\\n\\t\\t\\t\\tconstruction\" is, idiomatically, \"its (wonderful)\\n\\t\\t\\t\\tstructure.\" \"The (wide) spreading out\" of the earth is\\n\\t\\t\\t\\trendered \"its (wide) expanse,\" and so on."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "7",
    "NoteID": "6152",
    "Body": "Allah makes the soul, and gives it order, proportion, and\\n\\t\\t\\t\\trelative perfection, in order to adapt it for the\\n\\t\\t\\t\\tparticular circumstances in which it has to live its\\n\\t\\t\\t\\tlife. Cf. xxxii. 9. See also n. 120 to ii. 117. He\\n\\t\\t\\t\\tbreathes into it an understanding of what is sin,\\n\\t\\t\\t\\timpiety, wrong-doing and what is piety and right conduct,\\n\\t\\t\\t\\tin the special circumstances in which it may be placed.\\n\\t\\t\\t\\tThis is the most precious gift of all to man, the faculty\\n\\t\\t\\t\\tof distinguishing between right and wrong. After the six\\n\\t\\t\\t\\texternal evidences mentioned in verses 1-6 above, this\\n\\t\\t\\t\\tinternal evidence of Allah's goodness is mentioned as the\\n\\t\\t\\t\\tgreatest of all. By these various tokens man should learn\\n\\t\\t\\t\\tthat his success, his prosperity, his salvation depends\\n\\t\\t\\t\\ton himself,-on his keeping his soul pure as Allah made\\n\\t\\t\\t\\tit; and his failure, his decline, his perdition depends\\n\\t\\t\\t\\ton his soiling his soul by choosing evil."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "10",
    "NoteID": "6153",
    "Body": "This is the core of the Sura, and it is illustrated by a\\n\\t\\t\\t\\treference to the story of the Thamud in the following\\n\\t\\t\\t\\tverses."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "11",
    "NoteID": "6154",
    "Body": "The allusion to the story of the Thamud will be\\n\\t\\t\\t\\tunderstood by a reference to vii. 73-79; see specially n.\\n\\t\\t\\t\\t1044. Their prophet was Salih, but he had to deal with an\\n\\t\\t\\t\\tarrogant people, who oppressed the poor and denied them\\n\\t\\t\\t\\ttheir rights of watering and pasture for their cattle."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "12",
    "NoteID": "6155",
    "Body": "The prophet Salih was given a certain she-camel as a\\n\\t\\t\\t\\tSign, a test case, \"This she-camel of Allah is Sign unto\\n\\t\\t\\t\\tyou: so leave her to graze in Allah's earth and let her\\n\\t\\t\\t\\tcome to no harm, or ye shall be seized with a grievous\\n\\t\\t\\t\\tpunishment\" (vii. 73). But they plotted to kill her and\\n\\t\\t\\t\\tsent the most wicked man among them to dare and do that\\n\\t\\t\\t\\tdeed of impiety. It was probably when she came to drink\\n\\t\\t\\t\\tat the stream that she was hamstrung and killed. See\\n\\t\\t\\t\\txxvi. 155, and liv. 27."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "13",
    "NoteID": "6156",
    "Body": "That is, Salih: see last note."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "14",
    "NoteID": "6157",
    "Body": "The man who was deputed to do the impious deed of\\n\\t\\t\\t\\thamstringing the she-camel had of course the sympathy and\\n\\t\\t\\t\\tcooperation of the whole people. Only he was more daring\\n\\t\\t\\t\\tthan the rest."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "15",
    "NoteID": "6158",
    "Body": "This verse has been variously construed. I follow the\\n\\t\\t\\t\\tgeneral opinion in referring the pronoun \"Him\" to \"their\\n\\t\\t\\t\\tLord\" in the last verse and the pronoun \"its\" to the\\n\\t\\t\\t\\tPunishment that was meted out to all, high and low,\\n\\t\\t\\t\\tequally. In that case the meaning would be: God decreed\\n\\t\\t\\t\\tthe total destruction of the Thamud; in the case of\\n\\t\\t\\t\\tcreatures any such destruction might cause a loss to\\n\\t\\t\\t\\tthem, and they might fear the consequences of such loss\\n\\t\\t\\t\\tor destruction, but Allah has created and can create at\\n\\t\\t\\t\\twill, and there can be no question of any such\\n\\t\\t\\t\\tapprehension in His case. An alternative view is that\\n\\t\\t\\t\\t\"him\" refers to the prophet Salih, mentioned in verse 13.\\n\\t\\t\\t\\tThen the interpretation would be: Salih had no fear of\\n\\t\\t\\t\\tthe consequences for himself; he had warned the wicked\\n\\t\\t\\t\\taccording to his commission; he was saved by Allah's\\n\\t\\t\\t\\tmercy as a just and righteous man, and he left them with\\n\\t\\t\\t\\tregrets (vii. 79). Yet another alternative refers \"him\"\\n\\t\\t\\t\\tto the wicked man (mentioned in verse 12) who hamstrung\\n\\t\\t\\t\\tthe she-camel: he feared not the consequences of his\\n\\t\\t\\t\\tdeed."
  }
]
