[
  {
    "SurahNumber": "75",
    "AyahNumber": "1",
    "NoteID": "5809",
    "Body": "Cf. lxx. 40, and n. 5700. Here the point to be enforced\\n\\t\\t\\t\\tis understood. The appeal is made to two considerations:\\n\\t\\t\\t\\t(1) That every act has to be accounted for, and evil must\\n\\t\\t\\t\\thave its recompense at the Resurrection; and (2) that\\n\\t\\t\\t\\tman's own spirit has a conscience which would reproach\\n\\t\\t\\t\\thim for sin, if he did not suppress that inner voice."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "2",
    "NoteID": "5810",
    "Body": "Our doctors postulate three states or stages of the\\n\\t\\t\\t\\tdevelopment of the human soul: (1) Ammara (xii. 53),\\n\\t\\t\\t\\twhich is prone to evil, and, if not checked and\\n\\t\\t\\t\\tcontrolled, will lead to perdition; (2) Lawwama, as here,\\n\\t\\t\\t\\twhich feels conscious of evil, and resists it, asks for\\n\\t\\t\\t\\tAllah's grace and pardon after repentance and tries to\\n\\t\\t\\t\\tamend; it hopes to reach salvation; (3) Mutmainna (lxxxix\\n\\t\\t\\t\\t27), the highest stage of all, when it achieves full rest\\n\\t\\t\\t\\tand satisfaction. Our second stage may be compared to\\n\\t\\t\\t\\tConscience, except that in English usage Conscience is a\\n\\t\\t\\t\\tfaculty and not a stage in spiritual development."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "3",
    "NoteID": "5811",
    "Body": "The Unbelievers' usual cry is: \"What! when we are reduced\\n\\t\\t\\t\\tto bones and dust, how can our personality be called to\\n\\t\\t\\t\\taccount?\" (xvii. 49). The answer is: Allah has said so,\\n\\t\\t\\t\\tand He will do it; for the death here is not the end of\\n\\t\\t\\t\\tall things."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "4",
    "NoteID": "5812",
    "Body": "An idiom for the most delicate parts of his body."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "5",
    "NoteID": "5813",
    "Body": "It is bad enough not to repent of past sins. But the\\n\\t\\t\\t\\tevil-doer who rejects a Day of Reckoning and has no\\n\\t\\t\\t\\tconscience wants to go on in his career of sin and\\n\\t\\t\\t\\tjeopardise his future also."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "6",
    "NoteID": "5814",
    "Body": "The question is sceptical or derisive. He does not\\n\\t\\t\\t\\tbelieve that there is any chain of consequences in the\\n\\t\\t\\t\\tHereafter. He does not believe in a Hereafter."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "7",
    "NoteID": "5815",
    "Body": "At the Hour of Judgment the full light and glory of the\\n\\t\\t\\t\\tLord will shine, and the effulgence will daze man's eyes.\\n\\t\\t\\t\\tFor the world as we knew it will go to pieces and a new\\n\\t\\t\\t\\tWorld will come into being."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "8",
    "NoteID": "5816",
    "Body": "Not only will man's sight be dazed, but the great\\n\\t\\t\\t\\tluminaries themselves will lose their light. The moon\\n\\t\\t\\t\\twith its present reflected light will then cease to\\n\\t\\t\\t\\tshine. All reflected or relative truth or goodness will\\n\\t\\t\\t\\tsink into nothing before the true and Etemal Reality."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "9",
    "NoteID": "5817",
    "Body": "To the moon the sun is the original light, but the sun\\n\\t\\t\\t\\titself is a created light, and it will sink into\\n\\t\\t\\t\\tnothingness alongwith the moon. Both will be like empty\\n\\t\\t\\t\\tshells \"whose lights are fled, whose glories dead\",\\n\\t\\t\\t\\tbecause the Light of Allah now shines in full splendour\\n\\t\\t\\t\\tin a new World. See n. 4344 to xxxix. 69."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "13",
    "NoteID": "5818",
    "Body": "All good and bad deeds, positive and negative, i.e., all\\n\\t\\t\\t\\tsins of commission and omission, and all the good that a\\n\\t\\t\\t\\tman did and all the evil that he omitted, all the\\n\\t\\t\\t\\tinfluence that he radiated before him and all that he\\n\\t\\t\\t\\tleft behind him."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "14",
    "NoteID": "5819",
    "Body": "Cf. xxiv. 24, and n. 2976: \"On the Day when their\\n\\t\\t\\t\\ttongues, their hands, and their feet will bear witness\\n\\t\\t\\t\\tagainst them as to their actions. \" It is not what a man\\n\\t\\t\\t\\tsays about himself, or what others say of him, that\\n\\t\\t\\t\\tdetermines judgment about him. It is what he is in\\n\\t\\t\\t\\thimself. His own personality betrays him or commends him."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "16",
    "NoteID": "5820",
    "Body": "Cf. xx. 114, and n. 2639: \"Be not in haste with the\\n\\t\\t\\t\\tQur-an before its revelation to thee is completed.\" S.\\n\\t\\t\\t\\tlxxv. is an earlier revelation, and the shade of meaning\\n\\t\\t\\t\\tis slightly different. The immediate meaning was that the\\n\\t\\t\\t\\tholy Prophet was to allow the revelation conveyed to him\\n\\t\\t\\t\\tto sink into his mind and heart and not to be impatient\\n\\t\\t\\t\\tabout it; Allah would certainly complete it according to\\n\\t\\t\\t\\tHis Plan, and see that it was collected and preserved for\\n\\t\\t\\t\\tmen, and not lost; that the inspired one was to follow it\\n\\t\\t\\t\\tand recite it as the inspiration was conveyed to him; and\\n\\t\\t\\t\\tthat it carries its own explanation according to the\\n\\t\\t\\t\\tfaculties bestowed by Allah on man. The general meaning\\n\\t\\t\\t\\tfollows the same lines: we must not be impatient about\\n\\t\\t\\t\\tthe inspired Word; we must follow it as made clear to us\\n\\t\\t\\t\\tby the faculties given to us by Allah."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "20",
    "NoteID": "5821",
    "Body": "Cf. xxi. 37. Man loves haste and things of haste. For\\n\\t\\t\\t\\tthat reason he pins his faith on transitory things that\\n\\t\\t\\t\\tcome and go, and neglects the things of lasting moment,\\n\\t\\t\\t\\twhich come slowly, and whose true import will only be\\n\\t\\t\\t\\tfully seen in the Hereafter."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "22",
    "NoteID": "5822",
    "Body": "This passage (especially with reference to verses 26-28)\\n\\t\\t\\t\\twould seem to refer to what our Doctors call the Lesser\\n\\t\\t\\t\\tJudgment (Qiyamat-us-Sugra), which takes place\\n\\t\\t\\t\\timmediately after death, and not to the Greater or\\n\\t\\t\\t\\tGeneral Judgment, which may be supposed to be referred to\\n\\t\\t\\t\\tin such passages as occurs in S. lvi. There are other\\n\\t\\t\\t\\tpassages referring to the Lesser Judgment immediately\\n\\t\\t\\t\\tafter death; e.g., vii. 37 etc. If I understand aright,\\n\\t\\t\\t\\tthe punishment of sin takes place in three ways; (1) it\\n\\t\\t\\t\\tmay take place in this very life, but this may be\\n\\t\\t\\t\\tdeferred, to give the sinner respite; (2) it may be an\\n\\t\\t\\t\\tagony immediately after death; and (3) in the final\\n\\t\\t\\t\\tResurrection, when the whole of the present order gives\\n\\t\\t\\t\\tplace to a wholly new World: xiv, 48."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "26",
    "NoteID": "5823",
    "Body": "A symbolic picture of the agony of death."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "28",
    "NoteID": "5824",
    "Body": "He=the dying man, whose soul is referred to in verse 26\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "29",
    "NoteID": "5825",
    "Body": "When the soul has departed, the legs of the dead body are\\n\\t\\t\\t\\tplaced together in position, in preparation for the rites\\n\\t\\t\\t\\tpreliminary to the burial. Saq (literally, leg) may also\\n\\t\\t\\t\\tbe taken metaphorically to mean a calamity: calamity will\\n\\t\\t\\t\\tbe joined to calamity for the poor departed sinner's\\n\\t\\t\\t\\tsoul, as his life-story in this world is now done.\\n\\t\\t\\t\\tWilly-nilly, he will now have to go before the Throne of\\n\\t\\t\\t\\tJudgment."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "31",
    "NoteID": "5826",
    "Body": "His indictment in this and the succeeding verse consists\\n\\t\\t\\t\\tof four counts: (1) he neglected prayer; (2) he neglected\\n\\t\\t\\t\\tcharity; (3) he rejected Truth; and (4) he turned away.\\n\\t\\t\\t\\tIn lxxiv. 43-46, the four counts are (1) neglecting\\n\\t\\t\\t\\tprayer; (2) neglecting charity; (3) talking vanities; (4)\\n\\t\\t\\t\\tdenying the Day of Judgment; see n. 5803, Nos. (1) and\\n\\t\\t\\t\\t(2) are identical in both places, and Nos. (3) and (4)\\n\\t\\t\\t\\tare analogous. Rejecting the truth is equivalent to\\n\\t\\t\\t\\ttalking vanities and making an alliance with falsehoods.\\n\\t\\t\\t\\tDenying the Day of Judgment means behaving as if no\\n\\t\\t\\t\\taccount was to be given of our actions, i.e., turning\\n\\t\\t\\t\\taway from right conduct. An additional touch is found\\n\\t\\t\\t\\there in verse 33. See next note."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "33",
    "NoteID": "5827",
    "Body": "Conceit or arrogance is the root-cause of most Evil. By\\n\\t\\t\\t\\tthat cause fell Iblis: see ii. 34."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "36",
    "NoteID": "5828",
    "Body": "Sudan: has many implications: (1) uncontrolled, free to\\n\\t\\t\\t\\tdo what he likes: (2) without any moral responsibility;\\n\\t\\t\\t\\tnot accountable for his actions; (3) without a purpose,\\n\\t\\t\\t\\tuseless; (4) forsaken."
  },
  {
    "SurahNumber": "75",
    "AyahNumber": "37",
    "NoteID": "5829",
    "Body": "Cf. xxii. 5, where the argument is developed in greater\\n\\t\\t\\t\\tdetail. The briefer argument here may be stated thus. His\\n\\t\\t\\t\\tlowly animal origin makes him no higher than a brute; his\\n\\t\\t\\t\\tfetal development is still that of a brute animal; then\\n\\t\\t\\t\\tat some stage come human limbs and shape; the divine\\n\\t\\t\\t\\tspirit is poured into him, and he is fashioned in due\\n\\t\\t\\t\\tproportion for his higher destiny. Inspite of that the\\n\\t\\t\\t\\tmystery of sex remains in his nature: we are living\\n\\t\\t\\t\\tsouls, yet men and women. Allah Who creates these\\n\\t\\t\\t\\twonders,-has He not the power to bring the dead to life\\n\\t\\t\\t\\tat the Resurrection?"
  }
]
