[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "7",
        "bookName": "Friday Prayer",
        "bookNameArabic": "كتابُ الجمعة",
        "hadiths": [
            {
                "hadithNo": "1951",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that 'Abdullah said: \"I heard the Messenger of Allah (s.a.w) say: 'When one of you wants to come to Jumu'ah, let him perform Ghusl.\"'",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ وَمُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ قَالاَ أَخْبَرَنَا اللَّيْثُ ح وَحَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَأْتِىَ الْجُمُعَةَ فَلْيَغْتَسِلْ »."
            },
            {
                "hadithNo": "1952",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah (s.a.w) said, while he was standing on the Minbar: \"Whoever among you comes to Jumu'ah, let him perform Ghusl.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَا ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنِ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- أَنَّهُ قَالَ وَهُوَ قَائِمٌ عَلَى الْمِنْبَرِ « مَنْ جَاءَ مِنْكُمُ الْجُمُعَةَ فَلْيَغْتَسِلْ »."
            },
            {
                "hadithNo": "1953",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 1952) was narrated from Salim and 'Abdullah, the two sons of 'Abdullah bin 'Umar, from Ibn 'Umar, from the Prophet (s.a.w).",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى ابْنُ شِهَابٍ عَنْ سَالِمٍ وَعَبْدِ اللَّهِ ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنِ ابْنِ عُمَرَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمِثْلِهِ."
            },
            {
                "hadithNo": "1954",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Salim bin 'Abdullah that his father said: \"I heard the Messenger of Allah (s.a.w) say...\" a similar report (as no. 1952).",
                "hadithArabic": "وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ. بِمِثْلِهِ."
            },
            {
                "hadithNo": "1955",
                "chapterNo": "1",
                "hadithEnglish": "Salim bin 'Abdullah narrated from his father that while 'Umar bin Al-Kbattab was addressing the people on a Friday, one of the Companions of the Messenger of Allah (s.a.w) came in. 'Umar called out to him: \"What time is this?\" He said: \"I was busy today and I did not go back to my family when I heard the call, so I did no more than perform Wudu'.\" 'Umar said: \"Just Wudu' while you know that the Messenger of Allah (s.a.w) used to order Ghusl?\"",
                "hadithArabic": "وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ حَدَّثَنِى سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ. أَنَّ عُمَرَ بْنَ الْخَطَّابِ بَيْنَا هُوَ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ دَخَلَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَنَادَاهُ عُمَرُ أَيَّةُ سَاعَةٍ هَذِهِ فَقَالَ إِنِّى شُغِلْتُ الْيَوْمَ فَلَمْ أَنْقَلِبْ إِلَى أَهْلِى حَتَّى سَمِعْتُ النِّدَاءَ فَلَمْ أَزِدْ عَلَى أَنْ تَوَضَّأْتُ. قَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- كَانَ يَأْمُرُ بِالْغُسْلِ."
            },
            {
                "hadithNo": "1956",
                "chapterNo": "1",
                "hadithEnglish": "Abu Hurairah said: \"While 'Umar bin Al-Kbattab was addressing the people one Friday, 'Uthman bin 'Affan came in and 'Umar referred indirectly to him, saying: 'What is the matter with men who come late, after the call?' 'Uthman said: 'O Commander of the Believers! As soon as I heard the call, I performed Wudu', then I came.' 'Umar said: 'Just Wudu'? Did you not hear that the Messenger of Allah (s.a.w) said: \"When one of you comes to Jumu'ah, let him perform Ghusl?\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنِ الأَوْزَاعِىِّ قَالَ حَدَّثَنِى يَحْيَى بْنُ أَبِى كَثِيرٍ حَدَّثَنِى أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنِى أَبُو هُرَيْرَةَ قَالَ بَيْنَمَا عُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ عُثْمَانُ بْنُ عَفَّانَ فَعَرَّضَ بِهِ عُمَرُ فَقَالَ مَا بَالُ رِجَالٍ يَتَأَخَّرُونَ بَعْدَ النِّدَاءِ. فَقَالَ عُثْمَانُ يَا أَمِيرَ الْمُؤْمِنِينَ مَا زِدْتُ حِينَ سَمِعْتُ النِّدَاءَ أَنْ تَوَضَّأْتُ ثُمَّ أَقْبَلْتُ. فَقَالَ عُمَرُ وَالْوُضُوءَ أَيْضًا أَلَمْ تَسْمَعُوا رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « إِذَا جَاءَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ »."
            },
            {
                "hadithNo": "1957",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah (s.a.w) said: \"Ghusl on Friday is obligatory for everyone who has reached the age of puberty.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِى سَعِيدٍ الْخُدْرِىِّ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ »."
            },
            {
                "hadithNo": "1958",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Urwah bin Az-Zubair that 'Aishah said: \"The people used to come to Jumu'ah from their houses and from Al-'Awali. They would come wearing cloaks that had gotten dusty, and they smelled. One of them came to the Messenger of Allah (s.a.w) while he was at my house, and the Messenger of Allah (s.a.w) said: 'You should clean yourselves for this day of yours.\"'",
                "hadithArabic": "حَدَّثَنِى هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ وَأَحْمَدُ بْنُ عِيسَى قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى عَمْرٌو عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِى جَعْفَرٍ أَنَّ مُحَمَّدَ بْنَ جَعْفَرٍ حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ النَّاسُ يَنْتَابُونَ الْجُمُعَةَ مِنْ مَنَازِلِهِمْ مِنَ الْعَوَالِى فَيَأْتُونَ فِى الْعَبَاءِ وَيُصِيبُهُمُ الْغُبَارُ فَتَخْرُجُ مِنْهُمُ الرِّيحُ فَأَتَى رَسُولَ اللَّهِ -صلى الله عليه وسلم- إِنْسَانٌ مِنْهُمْ وَهُوَ عِنْدِى فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لَوْ أَنَّكُمْ تَطَهَّرْتُمْ لِيَوْمِكُمْ هَذَا »."
            },
            {
                "hadithNo": "1959",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Urwah that 'Aishah said: \"The people were workers and they did not have any servants, so they smelled bad. It was said to them: 'You should perform Ghusl on Fridays.\"'",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْ كَانَ النَّاسُ أَهْلَ عَمَلٍ وَلَمْ يَكُنْ لَهُمْ كُفَاةٌ فَكَانُوا يَكُونُ لَهُمْ تَفَلٌ فَقِيلَ لَهُمْ لَوِ اغْتَسَلْتُمْ يَوْمَ الْجُمُعَةِ."
            },
            {
                "hadithNo": "1960",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from 'Abdur-Rahman bin Abi Sa'eed Al-Khudri, from his father, that the Messenger of Allah (s.a.w) said: \"Ghusl on Fridays is obligatory for everyone who has reached the age of puberty, as well as using the Siwak and whatever perfume is available to him.\"\r\nBukair did not mention 'AbdurRal).\r\nman, and he said concerning\r\nperfume: \"even if it is women's\r\nperfume.\"",
                "hadithArabic": "وَحَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِىُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ سَعِيدَ بْنَ أَبِى هِلاَلٍ وَبُكَيْرَ بْنَ الأَشَجِّ حَدَّثَاهُ عَنْ أَبِى بَكْرِ بْنِ الْمُنْكَدِرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِى سَعِيدٍ الْخُدْرِىِّ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « غُسْلُ يَوْمِ الْجُمُعَةِ عَلَى كُلِّ مُحْتَلِمٍ وَسِوَاكٌ وَيَمَسُّ مِنَ الطِّيبِ مَا قَدَرَ عَلَيْهِ ». إِلاَّ أَنَّ بُكَيْرًا لَمْ يَذْكُرْ عَبْدَ الرَّحْمَنِ وَقَالَ فِى الطِّيبِ وَلَوْ مِنْ طِيبِ الْمَرْأَةِ."
            },
            {
                "hadithNo": "1961",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that he mentioned what the Prophet (s.a.w) said about performing Ghusl on Friday. Tawus said: \"I said to Ibn 'Abbas: 'And should he put on perfume or oil, if his family has some?' He said: 'I do not know about that.'\"",
                "hadithArabic": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِىُّ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ ح وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى إِبْرَاهِيمُ بْنُ مَيْسَرَةَ عَنْ طَاوُسٍ عَنِ ابْنِ عَبَّاسٍ أَنَّهُ ذَكَرَ قَوْلَ النَّبِىِّ -صلى الله عليه وسلم- فِى الْغُسْلِ يَوْمَ الْجُمُعَةِ. قَالَ طَاوُسٌ فَقُلْتُ لاِبْنِ عَبَّاسٍ وَيَمَسُّ طِيبًا أَوْ دُهْنًا إِنْ كَانَ عِنْدَ أَهْلِهِ قَالَ لاَ أَعْلَمُهُ."
            },
            {
                "hadithNo": "1962",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Ibn Juraij with this chain (a similar Hadith as no. 1961).",
                "hadithArabic": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ ح وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ كِلاَهُمَا عَنِ ابْنِ جُرَيْجٍ بِهَذَا الإِسْنَادِ."
            },
            {
                "hadithNo": "1963",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"It is the right of Allah over every Muslim that he should perform Ghusl every seven days, washing his head and his body.\"",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « حَقٌّ لِلَّهِ عَلَى كُلِّ مُسْلِمٍ أَنْ يَغْتَسِلَ فِى كُلِّ سَبْعَةِ أَيَّامٍ يَغْسِلُ رَأْسَهُ وَجَسَدَهُ »."
            },
            {
                "hadithNo": "1964",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"Whoever performs Ghusl for Janabah on Friday, then comes to the Masjid early, it is as if he sacrificed a camel. Whoever comes at the second hour, it is as if he sacrificed a cow. Whoever comes at the third hour, it is as if he sacrificed a horned ram. Whoever comes at the fourth hour, it is as if he sacrificed a chicken. Whoever comes at the fifth hour, it is as if he sacrificed an egg. Then when the Imam comes out, the Angels come in to listen to the reminder.\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ فِيمَا قُرِئَ عَلَيْهِ عَنْ سُمَىٍّ مَوْلَى أَبِى بَكْرٍ عَنْ أَبِى صَالِحٍ السَّمَّانِ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِى السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِى السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِى السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِى السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الْمَلاَئِكَةُ يَسْتَمِعُونَ الذِّكْرَ »."
            },
            {
                "hadithNo": "1965",
                "chapterNo": "4",
                "hadithEnglish": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said: \"If you say to your companion: 'Listen attentively' on a Friday, while the Imam is delivering the Khutbah, then you have engaged in idle speech.\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ قَالَ ابْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنِ ابْنِ شِهَابٍ أَخْبَرَنِى سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ . يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ »."
            },
            {
                "hadithNo": "1966",
                "chapterNo": "4",
                "hadithEnglish": "Abu Hurairah said: \"I heard the Messenger of Allah (s.a.w) say...\" a similar report (as no. 1965).",
                "hadithArabic": "وَحَدَّثَنِى عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِى أَبِى عَنْ جَدِّى حَدَّثَنِى عُقَيْلُ بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ قَارِظٍ وَعَنِ ابْنِ الْمُسَيَّبِ أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ. بِمِثْلِهِ."
            },
            {
                "hadithNo": "1967",
                "chapterNo": "4",
                "hadithEnglish": "Ibn Juraij narrated a similar Hadith (as no. 1965) from Ibn Shihab with both chains, except that Ibn Juraij said: \"Ibrahim bin 'Abdullah bin Qariz.\"",
                "hadithArabic": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى ابْنُ شِهَابٍ بِالإِسْنَادَيْنِ جَمِيعًا فِى هَذَا الْحَدِيثِ. مِثْلَهُ غَيْرَ أَنَّ ابْنَ جُرَيْجٍ قَالَ إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ قَارِظٍ."
            },
            {
                "hadithNo": "1968",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"If you say to your companion: 'Listen attentively' on a Friday, while the Imam is delivering the Khutbah, then you have engaged in idle speech.\"",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ. يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَقَدْ لَغِيتَ ». قَالَ أَبُو الزِّنَادِ هِىَ لُغَةُ أَبِى هُرَيْرَةَ وَإِنَّمَا هُوَ فَقَدْ لَغَوْتَ."
            },
            {
                "hadithNo": "1969",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) mentioned Friday and said: \"In it there is a time when, if a Muslims happens to pray at that time and ask Allah for something, He will give it to him.\" Qutaibah added in his report: \"And he gestured with his hand to indicate how short it is.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- ذَكَرَ يَوْمَ الْجُمُعَةِ فَقَالَ « فِيهِ سَاعَةٌ لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّى يَسْأَلُ اللَّهَ شَيْئًا إِلاَّ أَعْطَاهُ إِيَّاهُ ». زَادَ قُتَيْبَةُ فِى رِوَايَتِهِ وَأَشَارَ بِيَدِهِ يُقَلِّلُهَا"
            },
            {
                "hadithNo": "1970",
                "chapterNo": "5",
                "hadithEnglish": "It ·was narrated that Abu Hurairah said: \"Abu Al-Qasim (s.a.w) said: 'On Friday there is a time when, if a Muslim happens to stand and pray at that time, asking Allah for good, He will give it to him.' And he gestured with his hand to indicate how short it is.\"",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ -صلى الله عليه وسلم- « إِنَّ فِى الْجُمُعَةِ لَسَاعَةً لاَ يُوَافِقُهَا مُسْلِمٌ قَائِمٌ يُصَلِّى يَسْأَلُ اللَّهَ خَيْرًا إِلاَّ أَعْطَاهُ إِيَّاهُ ». وَقَالَ بِيَدِهِ يُقَلِّلُهَا يُزَهِّدُهَا."
            },
            {
                "hadithNo": "1971",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"Abu Al-Qasim (s.a.w) said:...\" a similar report (as no. 1970).",
                "hadithArabic": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِى عَدِىٍّ عَنِ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ -صلى الله عليه وسلم- بِمِثْلِهِ."
            },
            {
                "hadithNo": "1972",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"Abu Al-Qasim (s.a.w) said:...\" a similar report (as no. 1970, but with a different chain).",
                "hadithArabic": "وَحَدَّثَنِى حُمَيْدُ بْنُ مَسْعَدَةَ الْبَاهِلِىُّ حَدَّثَنَا بِشْرٌ - يَعْنِى ابْنَ مُفَضَّلٍ - حَدَّثَنَا سَلَمَةُ وَهُوَ ابْنُ عَلْقَمَةَ عَنْ مُحَمَّدٍ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ أَبُو الْقَاسِمِ -صلى الله عليه وسلم-. بِمِثْلِهِ."
            },
            {
                "hadithNo": "1973",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"On Friday there is a time when, if a Muslim happens to ask Allah for good at that time, He will give it to him.\" He said: \"And it is a short time.\"",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلاَّمٍ الْجُمَحِىُّ حَدَّثَنَا الرَّبِيعُ - يَعْنِى ابْنَ مُسْلِمٍ - عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- أَنَّهُ قَالَ « إِنَّ فِى الْجُمُعَةِ لَسَاعَةً لا يُوَافِقُهَا مُسْلِمٌ يَسْأَلُ اللَّهَ فِيهَا خَيْرًا إِلاَّ أَعْطَاهُ إِيَّاهُ ». قَالَ وَهِىَ سَاعَةٌ خَفِيفَةٌ."
            },
            {
                "hadithNo": "1974",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Abu Hurairah from the Prophet (s.a.w) ( a similar Hadith as no. 1973), but he did not say: \"and it is a short time.\"",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. وَلَمْ يَقُلْ وَهِىَ سَاعَةٌ خَفِيفَةٌ."
            },
            {
                "hadithNo": "1975",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Abu Burdah bin Abi Musa Al-Ash'ari said: 'Abdullah bin 'Umar said to me: \"Did you hear your father narrating from the Messenger of Allah (s.a.w) concerning the (special) time on Friday?\" I said: \"Yes, I heard him say: 'I heard the Messenger of Allah (s.a.w) say: It is between the time when the Imam sits down, until the prayer is over.'\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَعَلِىُّ بْنُ خَشْرَمٍ قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ مَخْرَمَةَ بْنِ بُكَيْرٍ ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ وَأَحْمَدُ بْنُ عِيسَى قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا مَخْرَمَةُ عَنْ أَبِيهِ عَنْ أَبِى بُرْدَةَ بْنِ أَبِى مُوسَى الأَشْعَرِىِّ قَالَ قَالَ لِى عَبْدُ اللَّهِ بْنُ عُمَرَ أَسَمِعْتَ أَبَاكَ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فِى شَأْنِ سَاعَةِ الْجُمُعَةِ قَالَ قُلْتُ نَعَمْ سَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « هِىَ مَا بَيْنَ أَنْ يَجْلِسَ الإِمَامُ إِلَى أَنْ تُقْضَى الصَّلاَةُ »."
            },
            {
                "hadithNo": "1976",
                "chapterNo": "6",
                "hadithEnglish": "Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'The best day on which the sun ever rises is Friday. On it Adam was created, on it he entered Paradise and on it he was expelled therefrom.\"'",
                "hadithArabic": "وَحَدَّثَنِى حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ أَخْبَرَنِى عَبْدُ الرَّحْمَنِ الأَعْرَجُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا »."
            },
            {
                "hadithNo": "1977",
                "chapterNo": "6",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"The best day on which the sun rises is Friday. On it Adam was created, on it he entered Paradise, on it he was expelled therefrom, and the Hour will not begin except on a Friday.\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا الْمُغِيرَةُ - يَعْنِى الْحِزَامِىَّ - عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- قَالَ « خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا وَلاَ تَقُومُ السَّاعَةُ إِلاَّ فِى يَوْمِ الْجُمُعَةِ »."
            },
            {
                "hadithNo": "1978",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'We are the last, but we will be the first on the Day of Resurrection, although every nation was given the Book before us, and we have been given it after them. This day which Allah has decreed for us, Allah has guided us to it, and the people come after us in this regard, the Jews on the next day and the Christians on the day after that.\"'",
                "hadithArabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « نَحْنُ الآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّ كُلَّ أُمَّةٍ أُوتِيَتِ الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ ثُمَّ هَذَا الْيَوْمُ الَّذِى كَتَبَهُ اللَّهُ عَلَيْنَا هَدَانَا اللَّهُ لَهُ فَالنَّاسُ لَنَا فِيهِ تَبَعٌ الْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ »."
            },
            {
                "hadithNo": "1979",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'We are the last but we will be the first on the Day of Resurrection...\"' a similar report (as no. 1978).",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِى الزِّنَادِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ وَابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « نَحْنُ الآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ ». بِمِثْلِهِ."
            },
            {
                "hadithNo": "1980",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'We are the last, but the first on the Day of Resurrection and we will be the first to enter Paradise, although they were given the Book before us and we were given it after them, but they differed and Allah guided us concerning that wherein they differed of the truth. This is their day concerning which they differed; Allah has guided us to it'\" - he (the narrator) said: \"Friday\" - \" 'this day is for us, the next day is for the Jews, and the day after that is for the Christians.'\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَزُهَيْرُ بْنُ حَرْبٍ قَالاَ حَدَّثَنَا جَرِيرٌ عَنِ الأَعْمَشِ عَنْ أَبِى صَالِحٍ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « نَحْنُ الآخِرُونَ الأَوَّلُونَ يَوْمَ الْقِيَامَةِ وَنَحْنُ أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ فَاخْتَلَفُوا فَهَدَانَا اللَّهُ لِمَا اخْتَلَفُوا فِيهِ مِنَ الْحَقِّ فَهَذَا يَوْمُهُمُ الَّذِى اخْتَلَفُوا فِيهِ هَدَانَا اللَّهُ لَهُ - قَالَ يَوْمُ الْجُمُعَةِ - فَالْيَوْمُ لَنَا وَغَدًا لِلْيَهُودِ وَبَعْدَ غَدٍ لِلنَّصَارَى »."
            },
            {
                "hadithNo": "1981",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Hammam bin Munabbih, the brother of Wahb bin Munabbih, said: \"This is what Abu Hurairah narrated to us from Muhammad the Messenger of Allah (s.a.w).\" He said: \"The Messenger of Allah (s.a.w) said: 'We are the last, but the first on the Day of Resurrection, although they were given the Book before us and we were given it after them. This is their day that was enjoined upon them but they differed concerning it, but Allah guided us to it, so they come after us in this regard: the Jews on the next day and the Christians on the day after.\"'",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ أَخِى وَهْبِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ مُحَمَّدٍ رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « نَحْنُ الآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ بَيْدَ أَنَّهُمْ أُوتُوا الْكِتَابَ مِنْ قَبْلِنَا وَأُوتِينَاهُ مِنْ بَعْدِهِمْ وَهَذَا يَوْمُهُمُ الَّذِى فُرِضَ عَلَيْهِمْ فَاخْتَلَفُوا فِيهِ فَهَدَانَا اللَّهُ لَهُ فَهُمْ لَنَا فِيهِ تَبَعٌ فَالْيَهُودُ غَدًا وَالنَّصَارَى بَعْدَ غَدٍ »."
            },
            {
                "hadithNo": "1982",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated from Abu Hurairah and from Rib'i bin Hirash that Hudhaifah said: \"The Messenger of Allah (s.a.w) said: 'Allah sent those who came before us astray from Friday, so the Jews had Saturday and the Christians had Sunday. Then Allah brought us, and Allah guided us to Friday, so there is Friday, Saturday, Sunday. Thus they will follow us on the Day of Resurrection. We are the last of the people of this world but will be the first on the Day of Resurrection, the first of all creatures to be judged.\"'",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كُرَيْبٍ وَوَاصِلُ بْنُ عَبْدِ الأَعْلَى قَالاَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِى مَالِكٍ الأَشْجَعِىِّ عَنْ أَبِى حَازِمٍ عَنْ أَبِى هُرَيْرَةَ وَعَنْ رِبْعِىِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ قَالاَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « أَضَلَّ اللَّهُ عَنِ الْجُمُعَةِ مَنْ كَانَ قَبْلَنَا فَكَانَ لِلْيَهُودِ يَوْمُ السَّبْتِ وَكَانَ لِلنَّصَارَى يَوْمُ الأَحَدِ فَجَاءَ اللَّهُ بِنَا فَهَدَانَا اللَّهُ لِيَوْمِ الْجُمُعَةِ فَجَعَلَ الْجُمُعَةَ وَالسَّبْتَ وَالأَحَدَ وَكَذَلِكَ هُمْ تَبَعٌ لَنَا يَوْمَ الْقِيَامَةِ نَحْنُ الآخِرُونَ مِنْ أَهْلِ الدُّنْيَا وَالأَوَّلُونَ يَوْمَ الْقِيَامَةِ الْمَقْضِىُّ لَهُمْ قَبْلَ الْخَلاَئِقِ ». وَفِى رِوَايَةِ وَاصِلٍ الْمَقْضِىُّ بَيْنَهُمْ."
            },
            {
                "hadithNo": "1983",
                "chapterNo": "7",
                "hadithEnglish": "It was narrated that Hudhaifah said: \"The Messenger of Allah (s.a.w) said: 'We have been guided to Friday and Allah sent those who came before us astray from it.\"' And he mentioned a Hadith similar to that of Ibn Fudail (no. 1982).",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ أَخْبَرَنَا ابْنُ أَبِى زَائِدَةَ عَنْ سَعْدِ بْنِ طَارِقٍ حَدَّثَنِى رِبْعِىُّ بْنُ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « هُدِينَا إِلَى الْجُمُعَةِ وَأَضَلَّ اللَّهُ عَنْهَا مَنْ كَانَ قَبْلَنَا ». فَذَكَرَ بِمَعْنَى حَدِيثِ ابْنِ فُضَيْلٍ."
            },
            {
                "hadithNo": "1984",
                "chapterNo": "8",
                "hadithEnglish": "Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'When Friday comes, at every door of the Masjid there stand Angels who write down (the names of) those whom come first, then those who come next. When the Imam sits down, the records are closed and they come to listen to the reminder (i.e., The Khutbah) Khutba. The likeness of the one who comes early is that of one who offered a camel, then of one who offered a cow, then of one who offered a ram, then of one who offered a chicken, then of one who offered an egg.'\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ وَعَمْرُو بْنُ سَوَّادٍ الْعَامِرِىُّ قَالَ أَبُو الطَّاهِرِ حَدَّثَنَا وَقَالَ الآخَرَانِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ عَنِ ابْنِ شِهَابٍ أَخْبَرَنِى أَبُو عَبْدِ اللَّهِ الأَغَرُّ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلاَئِكَةٌ يَكْتُبُونَ الأَوَّلَ فَالأَوَّلَ فَإِذَا جَلَسَ الإِمَامُ طَوَوُا الصُّحُفَ وَجَاءُوا يَسْتَمِعُونَ الذِّكْرَ وَمَثَلُ الْمُهَجِّرِ كَمَثَلِ الَّذِى يُهْدِى الْبَدَنَةَ ثُمَّ كَالَّذِى يُهْدِى بَقَرَةً ثُمَّ كَالَّذِى يُهْدِى الْكَبْشَ ثُمَّ كَالَّذِى يُهْدِى الدَّجَاجَةَ ثُمَّ كَالَّذِى يُهْدِى الْبَيْضَةَ »."
            },
            {
                "hadithNo": "1985",
                "chapterNo": "8",
                "hadithEnglish": "A similar report (as no. 1984) was narrated from Abu Hurairah, from the Prophet (s.a.w).",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَعَمْرٌو النَّاقِدُ عَنْ سُفْيَانَ عَنِ الزُّهْرِىِّ عَنْ سَعِيدٍ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- بِمِثْلِهِ."
            },
            {
                "hadithNo": "1986",
                "chapterNo": "8",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"At every door of the Masjid there stands an Angel who writes down the first one to come, then the next.\" He likened them to (the one who offered) a camel then in descending order, to (the one who offered) an egg. \"Then when the Imam sits down, the records are closed and they (the Angels) attend the reminder.\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ - يَعْنِى ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَكٌ يَكْتُبُ الأَوَّلَ فَالأَوَّلَ - مَثَّلَ الْجَزُورَ ثُمَّ نَزَّلَهُمْ حَتَّى صَغَّرَ إِلَى مَثَلِ الْبَيْضَةِ - فَإِذَا جَلَسَ الإِمَامُ طُوِيَتِ الصُّحُفُ وَحَضَرُوا الذِّكْرَ »."
            },
            {
                "hadithNo": "1987",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) said: \"Whoever performs Ghusl, then comes to Jumu'ah, and prays what is decreed for him, then listens attentively until the Khutbah is over, then prays with him (the Imam), will be forgiven (his sins) between that and the next Jumu'ah, and three days more.\"",
                "hadithArabic": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامٍ حَدَّثَنَا يَزِيدُ - يَعْنِى ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم- قَالَ « مَنِ اغْتَسَلَ ثُمَّ أَتَى الْجُمُعَةَ فَصَلَّى مَا قُدِّرَ لَهُ ثُمَّ أَنْصَتَ حَتَّى يَفْرُغَ مِنْ خُطْبَتِهِ ثُمَّ يُصَلِّىَ مَعَهُ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الأُخْرَى وَفَضْلَ ثَلاَثَةِ أَيَّامٍ »."
            },
            {
                "hadithNo": "1988",
                "chapterNo": "9",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Whoever performs Wudu' and performs Wudu' well, then comes to Jumu'ah and listens attentively, will be forgiven (his sins) between that and (the next) Jumu'ah, and three days in addition to that, but whoever touches the pebbles, then he has engaged in an idle action.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ عَنْ أَبِى صَالِحٍ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْجُمُعَةَ فَاسْتَمَعَ وَأَنْصَتَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ وَزِيَادَةُ ثَلاَثَةِ أَيَّامٍ وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَا »."
            },
            {
                "hadithNo": "1989",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"We used to pray with the Messenger of Allah (s.a.w), then we would go back and let our camels used for carrying water rest.\" Hasan (one of the narrators) said: \"I said to Ja'far: 'At what time was that?' He said: 'When the sun passed its zenith.\"'",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا نُصَلِّى مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- ثُمَّ نَرْجِعُ فَنُرِيحُ نَوَاضِحَنَا. قَالَ حَسَنٌ فَقُلْتُ لِجَعْفَرٍ فِى أَىِّ سَاعَةٍ تِلْكَ قَالَ زَوَالَ الشَّمْسِ."
            },
            {
                "hadithNo": "1990",
                "chapterNo": "10",
                "hadithEnglish": "Sulaiman bin Bilal narrated from Ja'far, from his father, that he asked Jabir bin 'Abdullah: \"When did the Messenger of Allah (s.a.w) pray Jumu'ah?\" He said: \"He used to pray, then we would go to our camels and let them rest.\" 'Abdullah added in his Hadith : \"When the sun had passed its zenith;\" and \"meaning, the camels that were used for carrying water.\"",
                "hadithArabic": "وَحَدَّثَنِى الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ ح وَحَدَّثَنِى عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِىُّ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ قَالاَ جَمِيعًا حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ أَنَّهُ سَأَلَ جَابِرَ بْنَ عَبْدِ اللَّهِ مَتَى كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يُصَلِّى الْجُمُعَةَ قَالَ كَانَ يُصَلِّى ثُمَّ نَذْهَبُ إِلَى جِمَالِنَا فَنُرِيحُهَا.\r\nزَادَ عَبْدُ اللَّهِ فِى حَدِيثِهِ حِينَ تَزُولُ الشَّمْسُ يَعْنِى النَّوَاضِحَ."
            },
            {
                "hadithNo": "1991",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated that Sahl said: \"We used not to take a nap or eat lunch until after Jumu'ah.\" Ibn Hujr added: \"at the time of the Messenger of Allah (s.a.w).\"",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ وَيَحْيَى بْنُ يَحْيَى وَعَلِىُّ بْنُ حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِى حَازِمٍ عَنْ أَبِيهِ عَنْ سَهْلٍ قَالَ مَا كُنَّا نَقِيلُ وَلاَ نَتَغَدَّى إِلاَّ بَعْدَ الْجُمُعَةِ - زَادَ ابْنُ حُجْرٍ - فِى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم-."
            },
            {
                "hadithNo": "1992",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated from Iyas bin Salamah bin Al-Akwa', that his father said: \"We used to pray Jumu'ah with the Messenger of Allah (s.a.w) when the sun passed its zenith, then we would go back and try to seek shade.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالاَ أَخْبَرَنَا وَكِيعٌ عَنْ يَعْلَى بْنِ الْحَارِثِ الْمُحَارِبِىِّ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الأَكْوَعِ عَنْ أَبِيهِ قَالَ كُنَّا نُجَمِّعُ مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- إِذَا زَالَتِ الشَّمْسُ ثُمَّ نَرْجِعُ نَتَتَبَّعُ الْفَىْءَ."
            },
            {
                "hadithNo": "1993",
                "chapterNo": "10",
                "hadithEnglish": "It was narrated from Iyas bin Salamah bin Al-Akwa' that his father said: \"We used to pray Jumu'ah with the Messenger of Allah (s.a.w), then we would go back and we could not find any wall offering shade.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا يَعْلَى بْنُ الْحَارِثِ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الأَكْوَعِ عَنْ أَبِيهِ قَالَ كُنَّا نُصَلِّى مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- الْجُمُعَةَ فَنَرْجِعُ وَمَا نَجِدُ لِلْحِيطَانِ فَيْئًا نَسْتَظِلُّ بِهِ."
            },
            {
                "hadithNo": "1994",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Ibn 'Umar said: \"The Messenger of Allah (s.a.w) used to deliver the Khutbah standing on Friday, then he would sit briefly, then he would stand up again.\" He said: \"As they do nowadays.\"",
                "hadithArabic": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِىُّ وَأَبُو كَامِلٍ الْجَحْدَرِىُّ جَمِيعًا عَنْ خَالِدٍ - قَالَ أَبُو كَامِلٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ - حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَخْطُبُ يَوْمَ الْجُمُعَةِ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ. قَالَ كَمَا يَفْعَلُونَ الْيَوْمَ."
            },
            {
                "hadithNo": "1995",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Jabir bin Samurah said: \"The Prophet used to give two Khutbah, sitting in between them. He would recite Qur'an and remind the people.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَحَسَنُ بْنُ الرَّبِيعِ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ حَدَّثَنَا أَبُو الأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَتْ لِلنَّبِىِّ -صلى الله عليه وسلم- خُطْبَتَانِ يَجْلِسُ بَيْنَهُمَا يَقْرَأُ الْقُرْآنَ وَيُذَكِّرُ النَّاسَ."
            },
            {
                "hadithNo": "1996",
                "chapterNo": "11",
                "hadithEnglish": "It was narrated that Simak said: \"Jabir bin Samurah told me: 'The Messenger of Allah (s.a.w) used to deliver the Khutbah standing, then he would it. Then he would stand up and deliver (another) Khutbah standing. Whoever told you that he used to deliver the Khutbah sitting was lying. By Allah, I prayed with him more than two thousand times.\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ سِمَاكٍ قَالَ أَنْبَأَنِى جَابِرُ بْنُ سَمُرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- كَانَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ قَائِمًا فَمَنْ نَبَّأَكَ أَنَّهُ كَانَ يَخْطُبُ جَالِسًا فَقَدْ كَذَبَ فَقَدْ وَاللَّهِ صَلَّيْتُ مَعَهُ أَكْثَرَ مِنْ أَلْفَىْ صَلاَةٍ."
            },
            {
                "hadithNo": "1997",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah that the Prophet (s.a.w) was delivering the Khutbah standing one Friday, when a caravan came from Ash-Sham. The people went towards it until there were only twelve men left, then this verse which is in Surat Al-Jumu'ah was revealed: \"And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing.\"",
                "hadithArabic": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ كِلاَهُمَا عَنْ جَرِيرٍ - قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ - عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سَالِمِ بْنِ أَبِى الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- كَانَ يَخْطُبُ قَائِمًا يَوْمَ الْجُمُعَةِ فَجَاءَتْ عِيرٌ مِنَ الشَّامِ فَانْفَتَلَ النَّاسُ إِلَيْهَا حَتَّى لَمْ يَبْقَ إِلاَّ اثْنَا عَشَرَ رَجُلاً فَأُنْزِلَتْ هَذِهِ الآيَةُ الَّتِى فِى الْجُمُعَةِ (وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا)"
            },
            {
                "hadithNo": "1998",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Husain with this chain (a similar Hadith as no. 1997), and he said: when the Messenger of Allah (s.a.w) was delivering a Khutbah, but he did not say, standing.",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ بِهَذَا الإِسْنَادِ قَالَ وَرَسُولُ اللَّهِ -صلى الله عليه وسلم- يَخْطُبُ. وَلَمْ يَقُلْ قَائِمًا."
            },
            {
                "hadithNo": "1999",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: We were with the Prophet (s.a.w) on a Friday when a caravan arrived. The people went out to it and no one was left except twelve men, of whom I was one. Then Allah revealed the words: \"And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing.\"",
                "hadithArabic": "وَحَدَّثَنَا رِفَاعَةُ بْنُ الْهَيْثَمِ الْوَاسِطِىُّ حَدَّثَنَا خَالِدٌ - يَعْنِى الطَّحَّانَ - عَنْ حُصَيْنٍ عَنْ سَالِمٍ وَأَبِى سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كُنَّا مَعَ النَّبِىِّ -صلى الله عليه وسلم- يَوْمَ الْجُمُعَةِ فَقَدِمَتْ سُوَيْقَةٌ قَالَ فَخَرَجَ النَّاسُ إِلَيْهَا فَلَمْ يَبْقَ إِلاَّ اثْنَا عَشَرَ رَجُلاً أَنَا فِيهِمْ - قَالَ - فَأَنْزَلَ اللَّهُ (وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا) إِلَى آخِرِ الآيَةِ."
            },
            {
                "hadithNo": "2000",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: While the Prophet (s.a.w) was standing on a Friday, a caravan arrived in Al-Madinah and the Companions of the Messenger of Allah (s.a.w) rushed towards it, until there was no one left with him except twelve men, among whom were Abu Bakr and 'Umar. Then this verse was revealed: \"And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْمَاعِيلُ بْنُ سَالِمٍ أَخْبَرَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ عَنْ أَبِى سُفْيَانَ وَسَالِمِ بْنِ أَبِى الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَيْنَا النَّبِىُّ -صلى الله عليه وسلم- قَائِمٌ يَوْمَ الْجُمُعَةِ إِذْ قَدِمَتْ عِيرٌ إِلَى الْمَدِينَةِ فَابْتَدَرَهَا أَصْحَابُ رَسُولِ اللَّهِ -صلى الله عليه وسلم- حَتَّى لَمْ يَبْقَ مَعَهُ إِلاَّ اثْنَا عَشَرَ رَجُلاً فِيهِمْ أَبُو بَكْرٍ وَعُمَرُ - قَالَ - وَنَزَلَتْ هَذِهِ الآيَةُ (وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا)"
            },
            {
                "hadithNo": "2001",
                "chapterNo": "12",
                "hadithEnglish": "It was narrated from Abu 'Ubaidah that Ka'b bin 'Ujrah entered the Masjid, and 'Abdur-Rahman bin Umm Al-Hakam was delivering the Khutbah while sitting. He said: Look at this evildoer who is delivering the Khutbah while sitting, when Allah says: \"And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing.\"",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِى عُبَيْدَةَ عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ دَخَلَ الْمَسْجِدَ وَعَبْدُ الرَّحْمَنِ بْنُ أُمِّ الْحَكَمِ يَخْطُبُ قَاعِدًا فَقَالَ انْظُرُوا إِلَى هَذَا الْخَبِيثِ يَخْطُبُ قَاعِدًا وَقَالَ اللَّهُ تَعَالَى (وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا)"
            },
            {
                "hadithNo": "2002",
                "chapterNo": "13",
                "hadithEnglish": "It was narrated from 'Abdullah bin 'Umar and Abu Hurairah, that they heard the Messenger of Allah (s.a.w) say, on the planks of his Minbar: \"People must cease neglecting Jumu'ah, or Allah will put a seal over their hearts and they will truly be among the negligent.\"",
                "hadithArabic": "وَحَدَّثَنِى الْحَسَنُ بْنُ عَلِىٍّ الْحُلْوَانِىُّ حَدَّثَنَا أَبُو تَوْبَةَ حَدَّثَنَا مُعَاوِيَةُ - وَهُوَ ابْنُ سَلاَّمٍ - عَنْ زَيْدٍ - يَعْنِى أَخَاهُ - أَنَّهُ سَمِعَ أَبَا سَلاَّمٍ قَالَ حَدَّثَنِى الْحَكَمُ بْنُ مِينَاءَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ وَأَبَا هُرَيْرَةَ حَدَّثَاهُ أَنَّهُمَا سَمِعَا رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ عَلَى أَعْوَادِ مِنْبَرِهِ « لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ وَدْعِهِمُ الْجُمُعَاتِ أَوْ لَيَخْتِمَنَّ اللَّهُ عَلَى قُلُوبِهِمْ ثُمَّ لَيَكُونُنَّ مِنَ الْغَافِلِينَ »."
            },
            {
                "hadithNo": "2003",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated that Jabir bin Samurah said: \"I used to pray with the Messenger of Allah (s.a.w), and his prayer was of moderate length and his Khutbah was of moderate length.\"",
                "hadithArabic": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كُنْتُ أُصَلِّى مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَكَانَتْ صَلاَتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا."
            },
            {
                "hadithNo": "2004",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated that Jabir bin Samurah said: \"I used to offer the prayers with the Messenger of Allah (s.a.w), and his prayer was of moderate length and his Khutbah was of moderate length.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَابْنُ نُمَيْرٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا زَكَرِيَّاءُ حَدَّثَنِى سِمَاكُ بْنُ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كُنْتُ أُصَلِّى مَعَ النَّبِىِّ -صلى الله عليه وسلم- الصَّلَوَاتِ فَكَانَتْ صَلاَتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا. وَفِى رِوَايَةِ أَبِى بَكْرٍ زَكَرِيَّاءُ عَنْ سِمَاكٍ."
            },
            {
                "hadithNo": "2005",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"When the Messenger of Allah (s.a.w) delivered a Khutbah, his eyes would turn red, his voice would become loud, and his anger would increase, until it was as if he was warning of an attacking army, saying: 'The enemy will attack in the morning or in the evening.' He said: 'The Hour and I have been sent like these two,' and he held his index finger and middle finger up together. And he would say: 'The best of speech is the Book of Allah, the best of guidance is the guidance of Muhammad, and the worst of matters are those which are newly-invented, and every innovation is a going astray.' Then he would say: 'I am closer to every believer than his own self. Whoever leaves behind wealth, it is for his family; whoever leaves behind a debt or dependents, then the responsibility of paying it off and of caring for them rests upon me.\"'",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- إِذَا خَطَبَ احْمَرَّتْ عَيْنَاهُ وَعَلاَ صَوْتُهُ وَاشْتَدَّ غَضَبُهُ حَتَّى كَأَنَّهُ مُنْذِرُ جَيْشٍ يَقُولُ « صَبَّحَكُمْ وَمَسَّاكُمْ ». وَيَقُولُ « بُعِثْتُ أَنَا وَالسَّاعَةَ كَهَاتَيْنِ ». وَيَقْرُنُ بَيْنَ إِصْبَعَيْهِ السَّبَّابَةِ وَالْوُسْطَى وَيَقُولُ « أَمَّا بَعْدُ فَإِنَّ خَيْرَ الْحَدِيثِ كِتَابُ اللَّهِ وَخَيْرُ الْهُدَى هُدَى مُحَمَّدٍ وَشَرُّ الأُمُورِ مُحْدَثَاتُهَا وَكُلُّ بِدْعَةٍ ضَلاَلَةٌ ». ثُمَّ يَقُولُ « أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ مَنْ تَرَكَ مَالاً فَلأَهْلِهِ وَمَنْ تَرَكَ دَيْنًا أَوْ ضَيَاعًا فَإِلَىَّ وَعَلَىَّ »."
            },
            {
                "hadithNo": "2006",
                "chapterNo": "14",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"In the Khutbah of the Prophet (s.a.w) on Friday, he would praise Allah, then he would say other things, raising his voice...\" a similar Hadith (as no. 2005).",
                "hadithArabic": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِى سُلَيْمَانُ بْنُ بِلاَلٍ حَدَّثَنِى جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ كَانَتْ خُطْبَةُ النَّبِىِّ -صلى الله عليه وسلم- يَوْمَ الْجُمُعَةِ يَحْمَدُ اللَّهَ وَيُثْنِى عَلَيْهِ ثُمَّ يَقُولُ عَلَى إِثْرِ ذَلِكَ وَقَدْ عَلاَ صَوْتُهُ. ثُمَّ سَاقَ الْحَدِيثَ بِمِثْلِهِ."
            },
            {
                "hadithNo": "2007",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated that Jabir said: \"The Messenger of Allah (s.a.w) used to address the people, praising Allah as He deserves to be praised, then he would say: 'Whomsoever Allah guides, none can lead astray, and whomsoever He sends astray, none can guide. The best of speech is the Book of Allah,\"' then he quoted a Hadith similar to that of Ath-Thaqafi.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ جَابِرٍ قَالَ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَخْطُبُ النَّاسَ يَحْمَدُ اللَّهَ وَيُثْنِى عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ يَقُولُ « مَنْ يَهْدِهِ اللَّهُ فَلاَ مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلاَ هَادِىَ لَهُ وَخَيْرُ الْحَدِيثِ كِتَابُ اللَّهِ ». ثُمَّ سَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِ الثَّقَفِىِّ."
            },
            {
                "hadithNo": "2008",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that Dimad came to Makkah. He was from (the tribe of) Azd Shanu'ah, and he used to treat people with Ruqya' (in the case of Jinn possession). He heard the fools among the people of Makkah saying that Muhammad was possessed. He said: \"If I see this man, perhaps Allah will heal him at my hands.\" So he met him and he said: \"O Muhammad, I treat people with Ruqya' in the case of Jinn possession, and Allah heals at my hands whomsoever He wills. Do you want that?\" The Messenger of Allah (s.a.w) said: \"Praise be to Allah, We praise Him and seek His help . Whomsoever Allah guides, none can lead astray, and whomsoever He sends astray, none can guide. I bear witness that there is none worthy of worship except Allah alone with no partner, and I bear witness that Muhammad is His slave and Messenger.\" Dimad said: \"Say these words of yours to me again.\" The Messenger of Allah (s.a.w) repeated them three times and (Dimad) said: \"I have heard the words of the soothsayers and the words of the magicians and the words of the poets, but I have never heard anything like these words of yours. You have scaled the heights of eloquence.\" He said: \"Give me your hand so that I may pledge allegiance to in Islam.\" So he gave him his pledge of allegiance, then the Messenger of Allah (s.a.w) said: \"And on behalf of your people.\" He said: \"And on behalf of my people.\" (The narration said:) The Messenger of Allah (s.a.w) sent out a raiding party and they passed by his people. The commander of the party said to his troops: \"Did you take anything from these people?\" One man said: \"I took a vessel for water from them.\" He said: \"Give it back, for these are the people of Dimad.\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْمُثَنَّى كِلاَهُمَا عَنْ عَبْدِ الأَعْلَى - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنِى عَبْدُ الأَعْلَى وَهُوَ أَبُو هَمَّامٍ - حَدَّثَنَا دَاوُدُ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ أَنَّ ضِمَادًا قَدِمَ مَكَّةَ وَكَانَ مِنْ أَزْدِ شَنُوءَةَ وَكَانَ يَرْقِى مِنْ هَذِهِ الرِّيحِ فَسَمِعَ سُفَهَاءَ مِنْ أَهْلِ مَكَّةَ يَقُولُونَ إِنَّ مُحَمَّدًا مَجْنُونٌ. فَقَالَ لَوْ أَنِّى رَأَيْتُ هَذَا الرَّجُلَ لَعَلَّ اللَّهَ يَشْفِيهِ عَلَى يَدَىَّ - قَالَ - فَلَقِيَهُ فَقَالَ يَا مُحَمَّدُ إِنِّى أَرْقِى مِنْ هَذِهِ الرِّيحِ وَإِنَّ اللَّهَ يَشْفِى عَلَى يَدِى مَنْ شَاءَ فَهَلْ لَكَ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنَّ الْحَمْدَ لِلَّهِ نَحْمَدُهُ وَنَسْتَعِينُهُ مَنْ يَهْدِهِ اللَّهُ فَلاَ مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلاَ هَادِىَ لَهُ وَأَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ أَمَّا بَعْدُ ». قَالَ فَقَالَ أَعِدْ عَلَىَّ كَلِمَاتِكَ هَؤُلاَءِ.\r\nفَأَعَادَهُنَّ عَلَيْهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم- ثَلاَثَ مَرَّاتٍ - قَالَ - فَقَالَ لَقَدْ سَمِعْتُ قَوْلَ الْكَهَنَةِ وَقَوْلَ السَّحَرَةِ وَقَوْلَ الشُّعَرَاءِ فَمَا سَمِعْتُ مِثْلَ كَلِمَاتِكَ هَؤُلاَءِ وَلَقَدْ بَلَغْنَ نَاعُوسَ الْبَحْرِ - قَالَ - فَقَالَ هَاتِ يَدَكَ أُبَايِعْكَ عَلَى الإِسْلاَمِ - قَالَ - فَبَايَعَهُ. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « وَعَلَى قَوْمِكَ ». قَالَ وَعَلَى قَوْمِى - قَالَ - فَبَعَثَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- سَرِيَّةً فَمَرُّوا بِقَوْمِهِ فَقَالَ صَاحِبُ السَّرِيَّةِ لِلْجَيْشِ هَلْ أَصَبْتُمْ مِنْ هَؤُلاَءِ شَيْئًا فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَصَبْتُ مِنْهُمْ مِطْهَرَةً. فَقَالَ رُدُّوهَا فَإِنَّ هَؤُلاَءِ قَوْمُ ضِمَادٍ."
            },
            {
                "hadithNo": "2009",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated that Wasil bin Hayyan said: \"Abu Wa'il said: Ammar addressed us and he spoke briefly but eloquently. When he came down (from the Minbar), we said: \"O Abu Al-Yaqzan, you spoke eloquently but briefly, would that you had made it longer.\" He said: \"I heard the Messenger of Allah (s.a.w) say: 'A man's lengthening his prayer and shortening his Khutbah is a sign of his understanding (of religion), so make your prayers lengthy and your Khutbah brief, for there is charm in eloquent speech.\"'",
                "hadithArabic": "حَدَّثَنِى سُرَيْجُ بْنُ يُونُسَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبْجَرَ عَنْ أَبِيهِ عَنْ وَاصِلِ بْنِ حَيَّانَ قَالَ قَالَ أَبُو وَائِلٍ خَطَبَنَا عَمَّارٌ فَأَوْجَزَ وَأَبْلَغَ فَلَمَّا نَزَلَ قُلْنَا يَا أَبَا الْيَقْظَانِ لَقَدْ أَبْلَغْتَ وَأَوْجَزْتَ فَلَوْ كُنْتَ تَنَفَّسْتَ. فَقَالَ إِنِّى سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقُولُ « إِنَّ طُولَ صَلاَةِ الرَّجُلِ وَقِصَرَ خُطْبَتِهِ مَئِنَّةٌ مِنْ فِقْهِهِ فَأَطِيلُوا الصَّلاَةَ وَاقْصُرُوا الْخُطْبَةَ وَإِنَّ مِنَ الْبَيَانِ سِحْرًا »."
            },
            {
                "hadithNo": "2010",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from 'Adiyy bin Hatim that a man gave a speech in the presence of the Prophet (s.a.w) and said: \"Whoever obeys Allah and His Messenger is rightly guided and whoever disobeys them has gone astray.\" The Messenger of Allah (s.a.w) said: \"What a bad Khatib you are. Say: 'and whoever disobeys Allah and His Messenger.\"' Ibn Numair said: \"And he did go astray.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالاَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ عَدِىِّ بْنِ حَاتِمٍ أَنَّ رَجُلاً خَطَبَ عِنْدَ النَّبِىِّ -صلى الله عليه وسلم- فَقَالَ مَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ رَشِدَ وَمَنْ يَعْصِهِمَا فَقَدْ غَوَى. فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « بِئْسَ الْخَطِيبُ أَنْتَ. قُلْ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ ». قَالَ ابْنُ نُمَيْرٍ فَقَدْ غَوِىَ."
            },
            {
                "hadithNo": "2011",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from Safwan bin Ya'la, from his father, that he heard the Prophet (s.a.w) reciting on the Minbar: \"And they will cry: \"O Malik (Keeper of Hell)!\"\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ الْحَنْظَلِىُّ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ - قَالَ قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ - عَنْ عَمْرٍو سَمِعَ عَطَاءً يُخْبِرُ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ أَبِيهِ أَنَّهُ سَمِعَ النَّبِىَّ -صلى الله عليه وسلم- يَقْرَأُ عَلَى الْمِنْبَرِ (وَنَادَوْا يَا مَالِكُ)"
            },
            {
                "hadithNo": "2012",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from 'Amrah bint 'Abdur-Rahman that a sister of 'Amrah said: \"I learned \"Qaf. By the Glorious Qur'an\" from the mouth of the Messenger of Allah (s.a.w) on Fridays, as he recited it from the Minbar every Friday.\"",
                "hadithArabic": "وَحَدَّثَنِى عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِىُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ أُخْتٍ لِعَمْرَةَ قَالَتْ أَخَذْتُ (ق وَالْقُرْآنِ الْمَجِيدِ) مِنْ فِى رَسُولِ اللَّهِ -صلى الله عليه وسلم- يَوْمَ الْجُمُعَةِ وَهُوَ يَقْرَأُ بِهَا عَلَى الْمِنْبَرِ فِى كُلِّ جُمُعَةٍ."
            },
            {
                "hadithNo": "2013",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from 'Amrah, from a sister of 'Amrah bint 'Abdur-Rahman, who was older than her... a Hadith similar to that of Sulaiman bin Bilal.",
                "hadithArabic": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ أُخْتٍ لِعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ كَانَتْ أَكْبَرَ مِنْهَا. بِمِثْلِ حَدِيثِ سُلَيْمَانَ بْنِ بِلاَلٍ."
            },
            {
                "hadithNo": "2014",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from 'Abdullah bin Muhammad bin Ma'n that a daughter of Harithah bin An-Nu'man said: \"I only memorized Surah Qaf from the mouth of the Messenger of Allah (s.a.w), when he recited it in his Khutbah every Friday, and our oven and the oven of the Messenger of Allah (s.a.w) were the same.\"",
                "hadithArabic": "حَدَّثَنِى مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ مَعْنٍ عَنْ بِنْتٍ لِحَارِثَةَ بْنِ النُّعْمَانِ قَالَتْ مَا حَفِظْتُ (ق) إِلاَّ مِنْ فِى رَسُولِ اللَّهِ -صلى الله عليه وسلم- يَخْطُبُ بِهَا كُلَّ جُمُعَةٍ. قَالَتْ وَكَانَ تَنُّورُنَا وَتَنُّورُ رَسُولِ اللَّهِ -صلى الله عليه وسلم- وَاحِدًا."
            },
            {
                "hadithNo": "2015",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated that Umm Hisham bint Harithah bin An-Nu'man said: \"Our oven and the oven of the Messenger of Allah (s.a.w) were the same for two years, or for one year and part of a year. And I only learned \"Surat Qaf. By the Glorious Qur'an\" from the tongue of the Messenger of Allah (s.a.w), who used to recite it every Friday from the Minbar, when he addressed the people.\"",
                "hadithArabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِى عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَنِى عَبْدُ اللَّهِ بْنُ أَبِى بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ الأَنْصَارِىُّ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ عَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ بْنِ النُّعْمَانِ قَالَتْ لَقَدْ كَانَ تَنُّورُنَا وَتَنُّورُ رَسُولِ اللَّهِ -صلى الله عليه وسلم- وَاحِدًا سَنَتَيْنِ أَوْ سَنَةً وَبَعْضَ سَنَةٍ وَمَا أَخَذْتُ (ق وَالْقُرْآنِ الْمَجِيدِ) إِلاَّ عَنْ لِسَانِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- يَقْرَؤُهَا كُلَّ يَوْمِ جُمُعَةٍ عَلَى الْمِنْبَرِ إِذَا خَطَبَ النَّاسَ."
            },
            {
                "hadithNo": "2016",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated from Husain that 'Umarah bin Ru'aibah saw Bishr bin Marwan on the Minbar raising his hands. He said: \"How ugly are these two hands. I saw the Messenger of Allah (s.a.w) doing no more than this with his hand,\" and he pointed with his index finger.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ عَنْ عُمَارَةَ بْنِ رُؤَيْبَةَ قَالَ رَأَى بِشْرَ بْنَ مَرْوَانَ عَلَى الْمِنْبَرِ رَافِعًا يَدَيْهِ فَقَالَ قَبَّحَ اللَّهُ هَاتَيْنِ الْيَدَيْنِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- مَا يَزِيدُ عَلَى أَنْ يَقُولَ بِيَدِهِ هَكَذَا. وَأَشَارَ بِإِصْبَعِهِ الْمُسَبِّحَةِ."
            },
            {
                "hadithNo": "2017",
                "chapterNo": "14",
                "hadithEnglish": "It was narrated that Husain bin 'Abdur-Rahman said: \"I saw Bishr bin Marwan on a Friday, raising his hands, and 'Umarah bin Ru'aibah said...\" and he mentioned something similar (to no. 2016).",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ رَأَيْتُ بِشْرَ بْنَ مَرْوَانَ يَوْمَ جُمُعَةٍ يَرْفَعُ يَدَيْهِ. فَقَالَ عُمَارَةُ بْنُ رُؤَيْبَةَ. فَذَكَرَ نَحْوَهُ."
            },
            {
                "hadithNo": "2018",
                "chapterNo": "15",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: \"While the Prophet (s.a.w) was delivering the Khutbah on a Friday, a man came and the Prophet (s.a.w) said to him: 'Have you prayed, O so-and-so?' He said: 'No.' He said: 'Get up and pray.'\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِىُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالاَ حَدَّثَنَا حَمَّادٌ - وَ هُوَ ابْنُ زَيْدٍ - عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَيْنَا النَّبِىُّ -صلى الله عليه وسلم- يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ لَهُ النَّبِىُّ -صلى الله عليه وسلم- « أَصَلَّيْتَ يَا فُلاَنُ ». قَالَ لاَ. قَالَ « قُمْ فَارْكَعْ »."
            },
            {
                "hadithNo": "2019",
                "chapterNo": "15",
                "hadithEnglish": "It was narrated from Jabir from the Prophet (s.a.w) as Hammad said (in no. 2018), and he did not mention \"the two Rak'ah.''",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَيَعْقُوبُ الدَّوْرَقِىُّ عَنِ ابْنِ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ عَمْرٍو عَنْ جَابِرٍ عَنِ النَّبِىِّ -صلى الله عليه وسلم- كَمَا قَالَ حَمَّادٌ وَلَمْ يَذْكُرِ الرَّكْعَتَيْنِ."
            },
            {
                "hadithNo": "2020",
                "chapterNo": "15",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"A man entered the Masjid while the Messenger of Allah (s.a.w) was delivering the Khutbah on a Friday, and he said: 'Did you pray?' He said: 'No.' He said: 'Get up and pray the two Rak'ah.'\" According to the report of Qutaibah he said: \"Pray two Rak'ah.''",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ قُتَيْبَةُ حَدَّثَنَا وَقَالَ إِسْحَاقُ أَخْبَرَنَا سُفْيَانُ عَنْ عَمْرٍو سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ دَخَلَ رَجُلٌ الْمَسْجِدَ وَرَسُولُ اللَّهِ -صلى الله عليه وسلم- يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَالَ « أَصَلَّيْتَ ». قَالَ لاَ. قَالَ « قُمْ فَصَلِّ الرَّكْعَتَيْنِ ». وَفِى رِوَايَةِ قُتَيْبَةَ قَالَ « صَلِّ رَكْعَتَيْنِ »."
            },
            {
                "hadithNo": "2021",
                "chapterNo": "15",
                "hadithEnglish": "Jabir bin 'Abdullah said: \"A man came while the Prophet (s.a.w) was on the Minbar on a Friday, delivering the Khutbah. He said to him: 'Have you prayed two Rak'ah?' He said: 'No.' He said: 'Pray.'\"",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِى عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ جَاءَ رَجُلٌ وَالنَّبِىُّ -صلى الله عليه وسلم- عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ يَخْطُبُ فَقَالَ لَهُ « أَرَكَعْتَ رَكْعَتَيْنِ ». قَالَ لاَ. فَقَالَ « ارْكَعْ »."
            },
            {
                "hadithNo": "2022",
                "chapterNo": "15",
                "hadithEnglish": "It was narrated from Jabir bin 'Abdullah that the Prophet (s.a.w) delivered a Khutbah and said: \"If one of you comes on a Friday and the Imam has come out, let him pray two Rak'ah.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ - وَهُوَ ابْنُ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ عَنْ عَمْرٍو قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- خَطَبَ فَقَالَ « إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ وَقَدْ خَرَجَ الإِمَامُ فَلْيُصَلِّ رَكْعَتَيْنِ »."
            },
            {
                "hadithNo": "2023",
                "chapterNo": "15",
                "hadithEnglish": "It was narrated that Jabir said: \"Sulaik Al-Ghatfani came one Friday while the Messenger of Allah (s.a.w) was sitting on the Minbar, and Sulaik sat down before praying. The Prophet (s.a.w) said to him: 'Have you prayed two Rak'ah?' He said: 'No.' He said: 'Get up and pray\r\nthem.\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ أَبِى الزُّبَيْرِ عَنْ جَابِرٍ أَنَّهُ قَالَ جَاءَ سُلَيْكٌ الْغَطَفَانِىُّ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ -صلى الله عليه وسلم- قَاعِدٌ عَلَى الْمِنْبَرِ فَقَعَدَ سُلَيْكٌ قَبْلَ أَنْ يُصَلِّىَ فَقَالَ لَهُ النَّبِىُّ -صلى الله عليه وسلم- « أَرَكَعْتَ رَكْعَتَيْنِ ». قَالَ لاَ. قَالَ « قُمْ فَارْكَعْهُمَا »."
            },
            {
                "hadithNo": "2024",
                "chapterNo": "15",
                "hadithEnglish": "It was narrated that Jabir bin 'Abdullah said: Sulaik Al-Ghatfani came on a Friday when the Messenger of Allah (s.a.w) was preaching, and he sat down. He said to him: 'O Sulaik, get up and pray two Rak'ah, and make them brief.' Then he said: 'If one of you comes on a Friday and the Imam is preaching, let him pray two Rak'ah and make them brief.'\"",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَلِىُّ بْنُ خَشْرَمٍ كِلاَهُمَا عَنْ عِيسَى بْنِ يُونُسَ - قَالَ ابْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى - عَنِ الأَعْمَشِ عَنْ أَبِى سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ جَاءَ سُلَيْكٌ الْغَطَفَانِىُّ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ -صلى الله عليه وسلم- يَخْطُبُ فَجَلَسَ فَقَالَ لَهُ « يَا سُلَيْكُ قُمْ فَارْكَعْ رَكْعَتَيْنِ وَتَجَوَّزْ فِيهِمَا - ثُمَّ قَالَ - إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ وَالإِمَامُ يَخْطُبُ فَلْيَرْكَعْ رَكْعَتَيْنِ وَلْيَتَجَوَّزْ فِيهِمَا »."
            },
            {
                "hadithNo": "2025",
                "chapterNo": "16",
                "hadithEnglish": "Abu Rifa'ah said: \"I came to the Prophet (s.a.w) while he was delivering a Khutbah and I said: 'O Messenger of Allah, here is a stranger who has come to ask you about his religion, for he does not know what his religion is.' The Messenger of Allah (s.a.w) turned to me and left his Khutbah. He came to me, and a chair was brought, I thought its legs were made of iron. The Messenger of Allah (s.a.w) sat on it and started telling me of what Allah had told him, then he went back and completed his Khutbah.\"",
                "hadithArabic": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ قَالَ قَالَ أَبُو رِفَاعَةَ انْتَهَيْتُ إِلَى النَّبِىِّ -صلى الله عليه وسلم- وَهُوَ يَخْطُبُ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ رَجُلٌ غَرِيبٌ جَاءَ يَسْأَلُ عَنْ دِينِهِ لاَ يَدْرِى مَا دِينُهُ - قَالَ - فَأَقْبَلَ عَلَىَّ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَتَرَكَ خُطْبَتَهُ حَتَّى انْتَهَى إِلَىَّ فَأُتِىَ بِكُرْسِىٍّ حَسِبْتُ قَوَائِمَهُ حَدِيدًا - قَالَ - فَقَعَدَ عَلَيْهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَجَعَلَ يُعَلِّمُنِى مِمَّا عَلَّمَهُ اللَّهُ ثُمَّ أَتَى خُطْبَتَهُ فَأَتَمَّ آخِرَهَا."
            },
            {
                "hadithNo": "2026",
                "chapterNo": "17",
                "hadithEnglish": "It was narrated that Ibn Abi Rafi' said: \"Marwan appointed Abu Hurairah in charge of Al-Madinah, and went out to Makkah. Abu Hurairah led us in prayer on Friday, and after Surat Al-Jumu'ah he recited: \"When the hypocrites come to you\" in the second Rak'ah. I caught up with Abu Hurairah when he left and said to him: 'You recited two Surah which 'Ali bin Abi Talib used to recite in Al-Kufah.' Abu Hurairah said: 'I heard the Messenger of Allah (s.a.w) reciting them on Fridays.'\"",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا سُلَيْمَانُ - وَهُوَ ابْنُ بِلاَلٍ - عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنِ ابْنِ أَبِى رَافِعٍ قَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ عَلَى الْمَدِينَةِ وَخَرَجَ إِلَى مَكَّةَ فَصَلَّى لَنَا أَبُو هُرَيْرَةَ الْجُمُعَةَ فَقَرَأَ بَعْدَ سُورَةِ الْجُمُعَةِ فِى الرَّكْعَةِ الآخِرَةِ (إِذَا جَاءَكَ الْمُنَافِقُونَ) - قَالَ - فَأَدْرَكْتُ أَبَا هُرَيْرَةَ حِينَ انْصَرَفَ فَقُلْتُ لَهُ إِنَّكَ قَرَأْتَ بِسُورَتَيْنِ كَانَ عَلِىُّ بْنُ أَبِى طَالِبٍ يَقْرَأُ بِهِمَا بِالْكُوفَةِ. فَقَالَ أَبُو هُرَيْرَةَ إِنِّى سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَقْرَأُ بِهِمَا يَوْمَ الْجُمُعَةِ."
            },
            {
                "hadithNo": "2027",
                "chapterNo": "17",
                "hadithEnglish": "It was narrated that 'Ubaidullah bin Abi Rafi' said: \"Marwan appointed Abu Hurairah\" a similar report, except that in the report of Hatim it says: \"He recited Surat Al-Jumu'ah in the first Sajdah and in the second: \"When the hypocrites come to you\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ قَالاَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ ح وَحَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ - يَعْنِى الدَّرَاوَرْدِىَّ - كِلاَهُمَا عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِى رَافِعٍ قَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ. بِمِثْلِهِ غَيْرَ أَنَّ فِى رِوَايَةِ حَاتِمٍ فَقَرَأَ بِسُورَةِ الْجُمُعَةِ فِى السَّجْدَةِ الأُولَى وَفِى الآخِرَةِ (إِذَا جَاءَكَ الْمُنَافِقُونَ) وَرِوَايَةُ عَبْدِ الْعَزِيزِ مِثْلُ حَدِيثِ سُلَيْمَانَ بْنِ بِلاَلٍ."
            },
            {
                "hadithNo": "2028",
                "chapterNo": "17",
                "hadithEnglish": "It was narrated that An-Nu'man bin Bashir said: \"For the Two ids and for Jumu'ah, the Messenger of Allah (s.a.w) used to recite in: \"Glorify the Name of your Lord, the Most High\" and: \"Has there come to you the narration of the overwhelming?\". He said: \"If id and Jumu'ah came together on the same day, he would recite them both in each of the two prayers.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ جَمِيعًا عَنْ جَرِيرٍ - قَالَ يَحْيَى أَخْبَرَنَا جَرِيرٌ - عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ مَوْلَى النُّعْمَانِ بْنِ بَشِيرٍ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَقْرَأُ فِى الْعِيدَيْنِ وَفِى الْجُمُعَةِ بِ (سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى) وَ (هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ) قَالَ وَإِذَا اجْتَمَعَ الْعِيدُ وَالْجُمُعَةُ فِى يَوْمٍ وَاحِدٍ يَقْرَأُ بِهِمَا أَيْضًا فِى الصَّلاَتَيْنِ."
            },
            {
                "hadithNo": "2029",
                "chapterNo": "17",
                "hadithEnglish": "It was narrated from Abu 'Awanah, from Ibrahim bin Muhammad bin Al-Muntashir with this chain (a similar Hadith as no. 2028).",
                "hadithArabic": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ بِهَذَا الإِسْنَادِ."
            },
            {
                "hadithNo": "2030",
                "chapterNo": "17",
                "hadithEnglish": "It was narrated that 'Ubaidullah bin 'Abdullah said: \"Ad-Dahhak bin Qais wrote to An-Nu'man bin Bashir, asking him what the Messenger of Allah (s.a.w) recited in Jumu'ah prayer apart from Surat Al-Jumu'ah. He said: 'He used to recite: Has there come to you the narration of the overwhelming?.\"'",
                "hadithArabic": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَ كَتَبَ الضَّحَّاكُ بْنُ قَيْسٍ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ يَسْأَلُهُ أَىَّ شَىْءٍ قَرَأَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَوْمَ الْجُمُعَةِ سِوَى سُورَةِ الْجُمُعَةِ فَقَالَ كَانَ يَقْرَأُ (هَلْ أَتَاكَ)"
            },
            {
                "hadithNo": "2031",
                "chapterNo": "18",
                "hadithEnglish": "It was narrated from Ibn 'Abbas that the Prophet (s.a.w) used to recite in Fajr prayer on Fridays: ''Alif Lam Mim. The revelation\" and: \"Has there not been over man a period of time...?\", and in Jumu'ah prayer the Prophet (s.a.w) used to recite Al-Jumu'ah and Al-Munafiqin.",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ سُفْيَانَ عَنْ مُخَوَّلِ بْنِ رَاشِدٍ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- كَانَ يَقْرَأُ فِى صَلاَةِ الْفَجْرِ يَوْمَ الْجُمُعَةِ (الم تَنْزِيلُ) السَّجْدَةُ وَ (هَلْ أَتَى عَلَى الإِنْسَانِ حِينٌ مِنَ الدَّهْرِ) وَأَنَّ النَّبِىَّ -صلى الله عليه وسلم- كَانَ يَقْرَأُ فِى صَلاَةِ الْجُمُعَةِ سُورَةَ الْجُمُعَةِ وَالْمُنَافِقِينَ."
            },
            {
                "hadithNo": "2032",
                "chapterNo": "18",
                "hadithEnglish": "A similar report (as no. 2031) was narrated from Sufyan with this chain.",
                "hadithArabic": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى ح وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ كِلاَهُمَا عَنْ سُفْيَانَ بِهَذَا الإِسْنَادِ. مِثْلَهُ."
            },
            {
                "hadithNo": "2033",
                "chapterNo": "18",
                "hadithEnglish": "A similar report (as no. 2031) was narrated from Mukhawwal with this chain concerning both prayers, as Sufyan said.",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُخَوَّلٍ بِهَذَا الإِسْنَادِ. مِثْلَهُ فِى الصَّلاَتَيْنِ كِلْتَيْهِمَا. كَمَا قَالَ سُفْيَانُ"
            },
            {
                "hadithNo": "2034",
                "chapterNo": "18",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) used to recite in Fajr on Fridays: ''Alif Lam Mim. The revelation \" and: \"Has there not been?\"",
                "hadithArabic": "حَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. أَنَّهُ كَانَ يَقْرَأُ فِى الْفَجْرِ يَوْمَ الْجُمُعَةِ ( الم تَنْزِيلُ) وَ (هَلْ أَتَى)"
            },
            {
                "hadithNo": "2035",
                "chapterNo": "18",
                "hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (s.a.w) used to recite in Fajr on Friday: ''Alif Lam Mim. The revelation\" in the first Rak'ah and: \"Has there not been over man a period of time when he was not a thing worth mentioning?\" in the second.",
                "hadithArabic": "حَدَّثَنِى أَبُو الطَّاهِرِ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ أَبِيهِ عَنِ الأَعْرَجِ عَنْ أَبِى هُرَيْرَةَ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- كَانَ يَقْرَأُ فِى الصُّبْحِ يَوْمَ الْجُمُعَةِ بِ (الم تَنْزِيلُ) فِى الرَّكْعَةِ الأُولَى وَفِى الثَّانِيَةِ ( هَلْ أَتَى عَلَى الإِنْسَانِ حِينٌ مِنَ الدَّهْرِ لَمْ يَكُنْ شَيْئًا مَذْكُورًا)"
            },
            {
                "hadithNo": "2036",
                "chapterNo": "19",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'When one of you has prayed Jumu'ah, let him pray four (Rak'ah) afterwards.\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِذَا صَلَّى أَحَدُكُمُ الْجُمُعَةَ فَلْيُصَلِّ بَعْدَهَا أَرْبَعًا »."
            },
            {
                "hadithNo": "2037",
                "chapterNo": "19",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'When you pray after Jumu'ah, pray four (Rak'ah).\"' 'Amr added in his report: Ibn Idris said: Suhail said: \"If you are in a hurry for any reason, then pray two in the Masjid and two when you go back.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِذَا صَلَّيْتُمْ بَعْدَ الْجُمُعَةِ فَصَلُّوا أَرْبَعًا ». - زَادَ عَمْرٌو فِى رِوَايَتِهِ قَالَ ابْنُ إِدْرِيسَ قَالَ سُهَيْلٌ فَإِنْ عَجِلَ بِكَ شَىْءٌ فَصَلِّ رَكْعَتَيْنِ فِى الْمَسْجِدِ وَرَكْعَتَيْنِ إِذَا رَجَعْتَ »."
            },
            {
                "hadithNo": "2038",
                "chapterNo": "19",
                "hadithEnglish": "It was narrated that Abu Hurairah said: \"The Messenger of Allah (s.a.w) said: 'Whoever among you wants to pray after Jumu'ah, let him pray four (Rak'ah).'\" In the Hadith of Jarir it does not say: \"among you.\"",
                "hadithArabic": "وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ ح وَحَدَّثَنَا عَمْرٌو النَّاقِدُ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ كِلاَهُمَا عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا ». وَلَيْسَ فِى حَدِيثِ جَرِيرٍ « مِنْكُمْ »."
            },
            {
                "hadithNo": "2039",
                "chapterNo": "19",
                "hadithEnglish": "It was narrated from 'Abdullah bin 'Umar that when he prayed Jumu'ah, he used to go and pray two Rak'ah in his house, then he said: \"The Messenger of Allah (s.a.w) used to do that.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رُمْحٍ قَالاَ أَخْبَرَنَا اللَّيْثُ ح وَحَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ أَنَّهُ كَانَ إِذَا صَلَّى الْجُمُعَةَ انْصَرَفَ فَسَجَدَ سَجْدَتَيْنِ فِى بَيْتِهِ ثُمَّ قَالَ كَانَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَصْنَعُ ذَلِكَ."
            },
            {
                "hadithNo": "2040",
                "chapterNo": "19",
                "hadithEnglish": "Yahya bin Yahya said: \"I heard from Malik, from Nafi', from 'Abdullah bin 'Umar that he described the voluntary prayer of the Prophet (s.a.w) and he said: 'He did not pray after Jumu'ah until he had left, so he would pray two Rak'ah in his house.'\" Yahya bin Yahya said: \"I think that I read it: 'So he would pray' or, I am sure of it.''",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ وَصَفَ تَطَوُّعَ صَلاَةِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ فَكَانَ لاَ يُصَلِّى بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّى رَكْعَتَيْنِ فِى بَيْتِهِ. قَالَ يَحْيَى أَظُنُّنِى قَرَأْتُ فَيُصَلِّى أَوْ أَلْبَتَّةَ."
            },
            {
                "hadithNo": "2041",
                "chapterNo": "19",
                "hadithEnglish": "It was narrated from Salim, from his father, that the Prophet (s.a.w) used to pray two Rak'ah after Jumu'ah.",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ نُمَيْرٍ قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا عَمْرٌو عَنِ الزُّهْرِىِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- كَانَ يُصَلِّى بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ."
            },
            {
                "hadithNo": "2042",
                "chapterNo": "19",
                "hadithEnglish": "'Umar bin 'Ata' bin Abi Al-Khuwar narrated that Nafi' bin Jubair sent him to As-Sa'ib, the son of the sister of Namir, to ask him about something that Mu'awiyah had said concerning his prayer, and he said: \"Yes, I prayed Jumu'ah with him in his enclosure, and when the Imam said the Salam, I stood up where I was and prayed. When he entered (his apartment) he sent for me and said: 'Do not repeat what you did. When you have prayed Jumu 'ah, do not offer another prayer after it until you have spoken or gone out, for the Messenger of Allah (s.a.w) enjoined that upon us, that we should not join one prayer to another until we had spoken or gone out.\"'",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنِ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِى عُمَرُ بْنُ عَطَاءِ بْنِ أَبِى الْخُوَارِ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَرْسَلَهُ إِلَى السَّائِبِ ابْنِ أُخْتِ نَمِرٍ يَسْأَلُهُ عَنْ شَىْءٍ رَآهُ مِنْهُ مُعَاوِيَةُ فِى الصَّلاَةِ فَقَالَ نَعَمْ. صَلَّيْتُ مَعَهُ الْجُمُعَةَ فِى الْمَقْصُورَةِ فَلَمَّا سَلَّمَ الإِمَامُ قُمْتُ فِى مَقَامِى فَصَلَّيْتُ فَلَمَّا دَخَلَ أَرْسَلَ إِلَىَّ فَقَالَ لاَ تَعُدْ لِمَا فَعَلْتَ إِذَا صَلَّيْتَ الْجُمُعَةَ فَلاَ تَصِلْهَا بِصَلاَةٍ حَتَّى تَكَلَّمَ أَوْ تَخْرُجَ فَإِنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- أَمَرَنَا بِذَلِكَ أَنْ لاَ تُوصَلَ صَلاَةٌ حَتَّى نَتَكَلَّمَ أَوْ نَخْرُجَ."
            },
            {
                "hadithNo": "2043",
                "chapterNo": "19",
                "hadithEnglish": "'Umar bin 'Ata' narrated that Nafi' bin Jubair sent him to As-Sa'ib bin Yazid, the son of the sister of Namir... and he quoted a similar Hadith (as no. 2042), except that he said: \"When he said the Taslim I stood up where I was,\" and he did not mention the Imam.",
                "hadithArabic": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِى عُمَرُ بْنُ عَطَاءٍ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَرْسَلَهُ إِلَى السَّائِبِ بْنِ يَزِيدَ ابْنِ أُخْتِ نَمِرٍ. وَسَاقَ الْحَدِيثَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ فَلَمَّا سَلَّمَ قُمْتُ فِى مَقَامِى وَلَمْ يَذْكُرِ الإِمَامَ."
            }
        ]
    }
]