[
  {
    "SurahNumber": "91",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "Lit., \"as it follows it (talaha)\", i.e., the sun.\\n\\t\\t\\t\\tAccording to the great philologist Al-Farra', who lived\\n\\t\\t\\t\\tin the second century after the hijrah, \"the meaning is\\n\\t\\t\\t\\tthat the moon derives its light from the sun\" (quoted by\\n\\t\\t\\t\\tRazi). This is also Raghib's interpretation of the above\\n\\t\\t\\t\\tphrase."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Lit., \"it\" - a pronoun apparently indicating \"the world\"\\n\\t\\t\\t\\tor \"the earth\" (Zamakhshari). It is to be noted that\\n\\t\\t\\t\\tverses {1-10} stress the polarity - both physical and\\n\\t\\t\\t\\tspiritual - inherent in all creation and contrasting with\\n\\t\\t\\t\\tthe oneness and uniqueness of the Creator."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "Lit., \"and that which has built it\" - i.e., the wondrous\\n\\t\\t\\t\\tqualities which are responsible for the harmony and\\n\\t\\t\\t\\tcoherence of the visible cosmos (which is evidently the\\n\\t\\t\\t\\tmeaning of the term sama' in this context). Similarly,\\n\\t\\t\\t\\tthe subsequent reference to the earth, which reads\\n\\t\\t\\t\\tliterally, \"that which has spread it out\", is apparently\\n\\t\\t\\t\\tan allusion to the qualities responsible for the beauty\\n\\t\\t\\t\\tand variety of its expanse."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "As in so many other instances, the term nafs, which has a\\n\\t\\t\\t\\tvery wide range of meanings (see first sentence of note\\n\\t\\t\\t\\t[1] on  4:1 ), denotes here the human self or personality\\n\\t\\t\\t\\tas a whole: that is, a being composed of a physical body\\n\\t\\t\\t\\tand that inexplicable life-essence loosely described as\\n\\t\\t\\t\\t\"soul\"."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "Lit., \"and that which has made [or \"formed\"] it (sawwaha)\\n\\t\\t\\t\\tin accordance with ...\", etc. For this particular\\n\\t\\t\\t\\tconnotation of the verb sawwa, see note [1] on  87:2 ,\\n\\t\\t\\t\\twhich represents the oldest Qur'anic instance of its use\\n\\t\\t\\t\\tin the above sense. The reference to man and that which\\n\\t\\t\\t\\tconstitutes the \"human personality\", as well as the\\n\\t\\t\\t\\timplied allusion to the extremely complex phenomenon of a\\n\\t\\t\\t\\tlife-entity in which bodily needs and urges, emotions and\\n\\t\\t\\t\\tintellectual activities are so closely intertwined as to\\n\\t\\t\\t\\tbe indissoluble, follows organically upon a call to\\n\\t\\t\\t\\tconsider the inexplicable grandeur of the universe - so\\n\\t\\t\\t\\tfar as it is perceptible and comprehensible to man - as a\\n\\t\\t\\t\\tcompelling evidence of God's creative power."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "Lit., \"and [consider] that which has inspired it with its\\n\\t\\t\\t\\timmoral doings (fujuraha) and its God-consciousness\\n\\t\\t\\t\\t(taqwaha)\" - i.e., the fact that man is equally liable to\\n\\t\\t\\t\\trise to great spiritual heights as to fall into utter\\n\\t\\t\\t\\timmorality is an essential characteristic of human nature\\n\\t\\t\\t\\tas such. In its deepest sense, man's ability to act\\n\\t\\t\\t\\twrongly is a concomitant to his ability to act rightly:\\n\\t\\t\\t\\tin other words, it is this inherent polarity of\\n\\t\\t\\t\\ttendencies which gives to every \"right\" choice a value\\n\\t\\t\\t\\tand, thus, endows man with moral free will (cf. in this\\n\\t\\t\\t\\tconnection note [16] on {7:24-25})."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "11",
    "NoteID": "7",
    "Body": "For the story of the tribe of Thamud, given here as an\\n\\t\\t\\t\\tillustration of man's potential wickedness, see {7:73-79}\\n\\t\\t\\t\\tand the corresponding notes."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "13",
    "NoteID": "8",
    "Body": "Regarding this \"she-camel belonging to God\", see surah\\n\\t\\t\\t\\t{7}, note [57]. For the particular reference to the\\n\\t\\t\\t\\tinjunction, \"Let her drink\", see  26:155  and the\\n\\t\\t\\t\\tcorresponding note [67]. The formulation of this passage\\n\\t\\t\\t\\tshows that the legend of the she-camel was well known in\\n\\t\\t\\t\\tpre-Islamic Arabia."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "14",
    "NoteID": "9",
    "Body": "For this rendering of 'aqaruha, see note [61] on  7:77 ."
  },
  {
    "SurahNumber": "91",
    "AyahNumber": "15",
    "NoteID": "10",
    "Body": "Implying that their total lack of compassion for God's\\n\\t\\t\\t\\tcreatures showed that they did not fear His retribution\\n\\t\\t\\t\\tand, hence, did not really believe in Him."
  }
]
