[
  {
    "BookCode": "AMH",
    "VolumeNumber": "11",
    "hadithNumber": "1",
    "sectionHeading": "The Fear Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yazid ibn Ruman from\\n\\t\\t\\t\\tSalih ibn Khawwat from someone who had prayed (the prayer\\n\\t\\t\\t\\tof fear) with the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, on the day of Dhat ar-Riqa that one\\n\\t\\t\\t\\tgroup had formed a row with him and one group had formed\\n\\t\\t\\t\\ta row opposite the enemy. He then prayed one raka with\\n\\t\\t\\t\\tthe group he was with, and then remained standing while\\n\\t\\t\\t\\tthey finished by themselves. They then left and formed a\\n\\t\\t\\t\\trow opposite the enemy, and then the other group came and\\n\\t\\t\\t\\the prayed the remaining raka of his prayer with them, and\\n\\t\\t\\t\\tthen remained sitting while they finished by themselves.\\n\\t\\t\\t\\tThen he said the taslim with them.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "11",
    "hadithNumber": "2",
    "sectionHeading": "The Fear Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tal-Qasim ibn Muhammad from Salih ibn Khawwat that Sahl\\n\\t\\t\\t\\tibn Abi Hathma related to him that the form of the prayer\\n\\t\\t\\t\\tof fear was that the imam stood with a group of his\\n\\t\\t\\t\\tcompanions, while another group faced the enemy. The imam\\n\\t\\t\\t\\tprayed one raka with them, including the prostration, and\\n\\t\\t\\t\\tthen stood. He remained standing while they completed the\\n\\t\\t\\t\\tremaining raka by themselves. They then said the taslim,\\n\\t\\t\\t\\tleft, and formed up opposite the enemy while the imam\\n\\t\\t\\t\\tremained standing. Then the others who had not prayed\\n\\t\\t\\t\\tcame forward and said the takbir behind the imam and he\\n\\t\\t\\t\\tprayed one raka with them, including the prostration. He\\n\\t\\t\\t\\tthen said the taslim, while they stood up and prayed the\\n\\t\\t\\t\\tremaining raka by themselves. Then they said the taslim.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "11",
    "hadithNumber": "3",
    "sectionHeading": "The Fear Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar, when asked about the fear prayer said, \"The\\n\\t\\t\\t\\timam and a group of people go forward and the imam prays\\n\\t\\t\\t\\ta raka with them, while another group, who have not yet\\n\\t\\t\\t\\tprayed, position themselves between him and the enemy.\\n\\t\\t\\t\\tWhen those who are with him have prayed a raka they draw\\n\\t\\t\\t\\tback to where those who have not prayed are, and do not\\n\\t\\t\\t\\tsay the taslim. Then those who have not prayed come\\n\\t\\t\\t\\tforward and pray a raka with him. Then the imam leaves,\\n\\t\\t\\t\\tas he has now prayed two rakas. Everyone else in the two\\n\\t\\t\\t\\tgroups stands and prays a raka by himself after the imam\\n\\t\\t\\t\\thas left. In this way each of the two groups will have\\n\\t\\t\\t\\tprayed two rakas. If the fear is greater than that, then\\n\\t\\t\\t\\tthe men pray standing on their feet or mounted, either\\n\\t\\t\\t\\tfacing the qibla or otherwise.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that Nafi said, \"I do not believe that\\n\\t\\t\\t\\tAbdullah ibn Umar related it from anyone other than the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "11",
    "hadithNumber": "4",
    "sectionHeading": "The Fear Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, did not pray dhuhr\\n\\t\\t\\t\\tand asr on the day of the Trench until after the sun had\\n\\t\\t\\t\\tset.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The hadith of al-Qasim ibn Muhammad from\\n\\t\\t\\t\\tSalih ibn Khawwat is the one I like most out of what I\\n\\t\\t\\t\\thave heard about the fear prayer.\"\\n\\t\\t\\t</p>"
  }
]
