[
  {
    "SurahNumber": "68",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Chronologically, this is the first appearance of any of\\n\\t\\t\\t\\tthe \"disjointed\" [i.e., single] letters (al-muqatta'at)\\n\\t\\t\\t\\twhich precede a number of the surahs of the Qur'an; for\\n\\t\\t\\t\\tthe various theories relating to these letters, see\\n\\t\\t\\t\\tAppendix II. The supposition of some of the early\\n\\t\\t\\t\\tcommentators (extensively quoted by Tabari) that the\\n\\t\\t\\t\\tletter n, pronounced nun, represents here an abbreviation\\n\\t\\t\\t\\tof the identically-pronounced noun which signifies both\\n\\t\\t\\t\\t\"great fish\" and \"inkwell\" has been convincingly rejected\\n\\t\\t\\t\\tby some of the most outstanding authorities (e.g.,\\n\\t\\t\\t\\tZamakhshari and Razi) on grammatical grounds."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "For the meaning of the adjurative particle wa at the\\n\\t\\t\\t\\tbeginning of this sentence, see first half of note [23]\\n\\t\\t\\t\\ton  74:32 . The mention of \"the pen\" is meant to recall\\n\\t\\t\\t\\tthe earliest Qur'anic revelation, namely, the first five\\n\\t\\t\\t\\tverses of surah {96} (\"The Germ-Cell\"), and thus to\\n\\t\\t\\t\\tstress the fact of Muhammad's prophethood. As regards the\\n\\t\\t\\t\\tsymbolic significance of the concept of \"the pen\", see\\n\\t\\t\\t\\t{96:3-5} and the corresponding note [3]."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "This is an allusion to the taunt with which most of\\n\\t\\t\\t\\tMuhammad's contemporaries greeted the beginning of his\\n\\t\\t\\t\\tpreaching, and with which they continued to deride him\\n\\t\\t\\t\\tfor many years. In its wider sense, the above passage\\n\\t\\t\\t\\trelates - as is so often the case in the Qur'an - not\\n\\t\\t\\t\\tmerely to the Prophet but also to all who followed or\\n\\t\\t\\t\\twill follow him: in this particular instance, to all who\\n\\t\\t\\t\\tbase their moral valuations on their belief in God and in\\n\\t\\t\\t\\tlife after death."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "The term khuluq, rendered by me as \"way of life\",\\n\\t\\t\\t\\tdescribes a person's \"character\", \"innate disposition\" or\\n\\t\\t\\t\\t\"nature\" in the widest sense of these concepts, as well\\n\\t\\t\\t\\tas \"habitual behaviour\" which becomes, as it were, one's\\n\\t\\t\\t\\t\"second nature\" (Taj al-'Arus). My identification of\\n\\t\\t\\t\\tkhuluq with \"way of life\" is based on the explanation of\\n\\t\\t\\t\\tthe above verse by 'Abd Allah ibn 'Abbas (as quoted by\\n\\t\\t\\t\\tTabari), stating that this term is here synonymous with\\n\\t\\t\\t\\tdin: and we must remember that one of the primary\\n\\t\\t\\t\\tsignificances of the latter term is \"a way [or \"manner\"]\\n\\t\\t\\t\\tof behaviour\" or \"of acting\" (Qamus). Moreover, we have\\n\\t\\t\\t\\tseveral well-authenticated Traditions according to which\\n\\t\\t\\t\\tMuhammad's widow 'A'ishah, speaking of the Prophet many\\n\\t\\t\\t\\tyears after his death, repeatedly stressed that \"his way\\n\\t\\t\\t\\tof life (khuluq) was the Qur'an\" (Muslim, Tabari and\\n\\t\\t\\t\\tHakim, on the authority of Sa'id ibn Hisham; Ibn Hanbal,\\n\\t\\t\\t\\tAbu Da'ud and Nasa'i, on the authority of Al-Hasan\\n\\t\\t\\t\\tal-Basri; Tabari, on the authority of Qatadah and Jubayr\\n\\t\\t\\t\\tibn Nufayl; and several other compilations)."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "9",
    "NoteID": "5",
    "Body": "I.e., \"they would like thee to be conciliatory in the\\n\\t\\t\\t\\tmatter of ethical principles and moral valuations,\\n\\t\\t\\t\\twhereupon they would reciprocate and desist from actively\\n\\t\\t\\t\\topposing thee\"."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "10",
    "NoteID": "6",
    "Body": "Lit., \"And\". The subsequently enumerated types of moral\\n\\t\\t\\t\\tdeficiency are, of course, mentioned only as examples of\\n\\t\\t\\t\\tthe type of man to whose likes or dislikes no\\n\\t\\t\\t\\tconsideration whatever should be shown."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "13",
    "NoteID": "7",
    "Body": "The term 'utul - derived from the verb 'atala, \"he\\n\\t\\t\\t\\tdragged [someone or something] in a rough and cruel\\n\\t\\t\\t\\tmanner\" - is used to describe a person combining within\\n\\t\\t\\t\\thimself the attributes of cruelty and greed; hence the\\n\\t\\t\\t\\tcomposite rendering adopted by me."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "13",
    "NoteID": "8",
    "Body": "The commentators give the most divergent interpretations\\n\\t\\t\\t\\tto the term zanim, which is evidently derived from the\\n\\t\\t\\t\\tnoun zanamah, denoting either of the two wattles, or\\n\\t\\t\\t\\tfleshy skin protuberances, hanging below the ears of a\\n\\t\\t\\t\\tgoat. Since these wattles do not seem to have any\\n\\t\\t\\t\\tphysiological function, the term zanim has come to\\n\\t\\t\\t\\tsignify \"someone [or \"something\"] not needed\" (Taj\\n\\t\\t\\t\\tal-'Arus): in other words, redundant or useless. It is,\\n\\t\\t\\t\\ttherefore, logical to assume that in the above context\\n\\t\\t\\t\\tthis term describes a person who is entirely useless in\\n\\t\\t\\t\\tthe social sense."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "15",
    "NoteID": "9",
    "Body": "The term banun (lit., \"children\" or \"sons\") is often used\\n\\t\\t\\t\\tin the Qur'an metonymically, denoting \"popular support\"\\n\\t\\t\\t\\tor \"many adherents\"; in conjunction with the term mal\\n\\t\\t\\t\\t(\"worldly goods\") it is meant to illustrate a certain\\n\\t\\t\\t\\tmentality which attributes a pseudo-religious\\n\\t\\t\\t\\tsignificance to wealth and influence, and regards these\\n\\t\\t\\t\\tvisible signs of worldly success as a post-factum\\n\\t\\t\\t\\tevidence of the \"righteousness\" of the person concerned\\n\\t\\t\\t\\tand, hence, of his not being in need of further guidance."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "16",
    "NoteID": "10",
    "Body": "Lit., \"We shall brand him on the snout\" (khurtum)\". All\\n\\t\\t\\t\\tcommentators point out that this idiomatic phrase has a\\n\\t\\t\\t\\tstrictly metaphorical meaning, namely, \"We shall\\n\\t\\t\\t\\tstigmatize him with indelible disgrace\" (cf. Lane II,\\n\\t\\t\\t\\t724, quoting both Raghib and Taj al-'Arus)."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "17",
    "NoteID": "11",
    "Body": "I.e., by bestowing on them affluence out of all\\n\\t\\t\\t\\tproportion to their moral deserts."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "18",
    "NoteID": "12",
    "Body": "I.e., they resolved upon their objective without the\\n\\t\\t\\t\\treservation, \"if God so wills\"; points to the first lesson\\n\\t\\t\\t\\tto be derived from this parable, as well as to its\\n\\t\\t\\t\\tconnection with the rhetorical question in verses {14-15}\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "24",
    "NoteID": "13",
    "Body": "Ever since Biblical times it has been understood that the\\n\\t\\t\\t\\tpoor have a right to a share in the harvest of the fields\\n\\t\\t\\t\\tand gardens owned by their more fortunate fellow-men (cf.\\n\\t\\t\\t\\t 6:141  - \"give [unto the poor] their due on\\n\\t\\t\\t\\tharvest-day\". The determination of the \"owners of the\\n\\t\\t\\t\\tgarden\" to deprive the poor of this right is the second\\n\\t\\t\\t\\ttype of sin to which the above parable points: and\\n\\t\\t\\t\\tinasmuch as it is a social sin, it connects with verses\\n\\t\\t\\t\\t{10-13}."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "28",
    "NoteID": "14",
    "Body": "This is obviously a reference to their failure to realize\\n\\t\\t\\t\\tthat nothing can come about unless the Almighty so wills\\n\\t\\t\\t\\t(verse {18})."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "32",
    "NoteID": "15",
    "Body": "Namely, His forgiveness."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "33",
    "NoteID": "16",
    "Body": "This connects with the first clause of verse {17} above,\\n\\t\\t\\t\\twhich, in its turn, contains an allusion to the mentality\\n\\t\\t\\t\\tspoken of in verses {14-15}."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "35",
    "NoteID": "17",
    "Body": "This is the earliest occurrence of the term muslimun\\n\\t\\t\\t\\t(sing. muslim) in the history of Qur'anic revelation.\\n\\t\\t\\t\\tThroughout this work, I have translated the terms muslim\\n\\t\\t\\t\\tand Islam in accordance with their original connotations,\\n\\t\\t\\t\\tnamely, \"one who surrenders [or \"has surrendered\"]\\n\\t\\t\\t\\thimself to God\", and \"man's self-surrender to God\"; the\\n\\t\\t\\t\\tsame holds good of all forms of the verb aslama occurring\\n\\t\\t\\t\\tin the Qur'an. It should be borne in mind that the\\n\\t\\t\\t\\t\"institutionalized\" use of these terms - that is, their\\n\\t\\t\\t\\texclusive application to the followers of the Prophet\\n\\t\\t\\t\\tMuhammad - represents a definitely post-Qur'anic\\n\\t\\t\\t\\tdevelopment and, hence, must be avoided in a translation\\n\\t\\t\\t\\tof the Qur'an."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "36",
    "NoteID": "18",
    "Body": "Sc., \"O you sinners\"."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "38",
    "NoteID": "19",
    "Body": "Lit., \"so that in it you [may] have all that you choose\\n\\t\\t\\t\\t[to have] - i.e., a moral justification of the claim that\\n\\t\\t\\t\\twhatever is considered \"expedient\" is eo ipso right."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "41",
    "NoteID": "20",
    "Body": "Lit., \"Or have they any associates?\" - i.e., wise people\\n\\t\\t\\t\\t('uqala') who would share their views and their way of\\n\\t\\t\\t\\tlife (Zamakhshari and Razi). Accordingly, the expression\\n\\t\\t\\t\\tshuraka'uhum in the next sentence has been rendered as\\n\\t\\t\\t\\t\"those supporters of theirs\"."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "42",
    "NoteID": "21",
    "Body": "Lit., \"when the shin[-bone] shall be bared\": i.e., when\\n\\t\\t\\t\\tman's innermost thoughts, feelings and motivations will\\n\\t\\t\\t\\tbe laid bare. The implication is that their erstwhile\\n\\t\\t\\t\\tclaim that whatever is \"expedient\" is morally justifiable\\n\\t\\t\\t\\t(see note [19] above), shall be revealed in all its\\n\\t\\t\\t\\tnakedness - namely, as something indefensible and\\n\\t\\t\\t\\tspiritually destructive."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "42",
    "NoteID": "22",
    "Body": "I.e., willingly, gladly humbling themselves before Him."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "44",
    "NoteID": "23",
    "Body": "I.e., to divine revelation in general, and to the tiding\\n\\t\\t\\t\\tof resurrection and judgment, in particular - the\\n\\t\\t\\t\\timplication being that God alone has the right to decide\\n\\t\\t\\t\\twhether or how to chastise them."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "44",
    "NoteID": "24",
    "Body": "Lit., \"without their knowing whence [it comes]\". The\\n\\t\\t\\t\\tabove sentence, as well as the next (verse {45}), are\\n\\t\\t\\t\\tfound in exactly the same formulation in {7:182-183}."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "45",
    "NoteID": "25",
    "Body": "The term \"subtle scheme\" (kayd) evidently circumscribes\\n\\t\\t\\t\\there God's unfathomable plan of creation of which man can\\n\\t\\t\\t\\tglimpse only isolated fragments and never the totality: a\\n\\t\\t\\t\\tplan in which every thing and happening has a definite\\n\\t\\t\\t\\tfunction, and nothing is accidental. (See in this\\n\\t\\t\\t\\tconnection note [11] on  10:5  - \"None of this has God\\n\\t\\t\\t\\tcreated without [an inner] truth\".) Indirectly, the above\\n\\t\\t\\t\\tpassage alludes to the question as to the reason why God\\n\\t\\t\\t\\tallows so many evil persons to enjoy their lives to the\\n\\t\\t\\t\\tfull, while so many of the righteous are allowed to\\n\\t\\t\\t\\tsuffer: the answer being that during his life in this\\n\\t\\t\\t\\tworld man cannot really understand where apparent\\n\\t\\t\\t\\thappiness and unhappiness ultimately lead to, and what\\n\\t\\t\\t\\trole they play in God's \"subtle scheme\" of creation."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "47",
    "NoteID": "26",
    "Body": "Sc., \"and that, therefore, they need not listen to divine\\n\\t\\t\\t\\trevelation.\" For the real significance of the term\\n\\t\\t\\t\\tal-ghayb - of which the above is undoubtedly the earliest\\n\\t\\t\\t\\tinstance in the chronology of Qur'anic revelation - see\\n\\t\\t\\t\\tsurah {2}, note [3]. Its use in the above context is\\n\\t\\t\\t\\tmeant to elucidate and further develop the idea already\\n\\t\\t\\t\\ttouched upon in  96:6  - \"man becomes grossly overweening\\n\\t\\t\\t\\twhenever he believes himself to be self-sufficient\". More\\n\\t\\t\\t\\tparticularly, the present passage points to the fallacy\\n\\t\\t\\t\\tof the arrogant belief that the solution of all the\\n\\t\\t\\t\\tmysteries of the universe is \"just around the corner\" and\\n\\t\\t\\t\\tthat man-centred science - epitomised in the reference to\\n\\t\\t\\t\\tits being \"written down\" - can and will teach its adepts\\n\\t\\t\\t\\thow to \"conquer nature\" and to attain to what they regard\\n\\t\\t\\t\\tas the good life."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "48",
    "NoteID": "27",
    "Body": "This is a reference to the Prophet Jonah - see  21:87 \\n\\t\\t\\t\\tand the corresponding notes [82] and [83]. As mentioned\\n\\t\\t\\t\\tin  37:140 , \"he fled like a runaway slave\" from the task\\n\\t\\t\\t\\twith which he had been entrusted by God, because his\\n\\t\\t\\t\\tpeople did not all at once accept his preaching as valid:\\n\\t\\t\\t\\tand so Muhammad is exhorted not to give in to despair or\\n\\t\\t\\t\\tanger at the opposition shown to him by most of his\\n\\t\\t\\t\\tcontemporaries in Mecca, but to persevere in his\\n\\t\\t\\t\\tprophetic mission."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "49",
    "NoteID": "28",
    "Body": "Cf.  37:143  - \"had he not been of those who [even in the\\n\\t\\t\\t\\tdeep darkness of their distress are able to] extol God's\\n\\t\\t\\t\\tlimitless glory\": i.e., who always remember God and pray\\n\\t\\t\\t\\tfor His forgiveness."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "49",
    "NoteID": "29",
    "Body": "Lit., \"while he was still blameworthy\", i.e., burdened\\n\\t\\t\\t\\twith sin and unredeemed by repentance: implying that but\\n\\t\\t\\t\\tfor God's grace he would have died as a sinner."
  }
]
