[
  {
    "SurahNumber": "43",
    "AyahNumber": "1",
    "Text": "Ha M'im."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "2",
    "Text": "By the Glorious Book."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "3",
    "Text": "We have revealed this Qur'an in the Arabic language so that you\\n\\t\\t\\tmay understand its meanings."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "4",
    "Text": "Surely, it is a transcript of the Mother Book in Our keeping,\\n\\t\\t\\twhich is sublime and full of wisdom."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "5",
    "Text": "Should We take this Reminder away from you and ignore you because\\n\\t\\t\\tyou are a nation who has transgressed all limits?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "6",
    "Text": "And how many Prophets have We sent among the ancient peoples?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "7",
    "Text": "Never did it happen that a Prophet came to his people and they\\n\\t\\t\\tdid not mock at him."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "8",
    "Text": "So We destroyed them, though they were stronger in power than\\n\\t\\t\\tthese people, and provided an example in the case of prior\\n\\t\\t\\tpeople."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "9",
    "Text": "If you ask them: \"Who has created the heavens and the earth?\"\\n\\t\\t\\tThey will surely say: \"They have been created by the All-Mighty,\\n\\t\\t\\tthe All-Knowledgeable.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "10",
    "Text": "The One Who has made the earth a resting place for you and traced\\n\\t\\t\\tout routs upon it so that you may find your ways."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "11",
    "Text": "The One Who sends down rain from the sky in due measure and\\n\\t\\t\\tthereby resurrects a dead land - that's how you shall be brought\\n\\t\\t\\tforth (raised to life again)."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "12",
    "Text": "The One Who has created all living things in pairs and made for\\n\\t\\t\\tyou the ships and cattle on which you ride"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "13",
    "Text": "so that you may firmly sit on their backs, then as you mount,\\n\\t\\t\\trecall the goodness of your Rabb and say: \"Glory be to Him Who\\n\\t\\t\\thas subjected these to Our use, otherwise We could not have\\n\\t\\t\\tbrought them under our control,"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "14",
    "Text": "and to our Rabb we shall all return.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "15",
    "Text": "Yet inspite of recognizing all this, they have made some of His\\n\\t\\t\\tservants to be a part of Him! Surely mankind is clearly\\n\\t\\t\\tungrateful."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "16",
    "Text": "Would Allah choose daughters (pagan Arabs believed that angels\\n\\t\\t\\twere the daughters of Allah) for Himself out of what He Himself\\n\\t\\t\\tcreates and gives you sons?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "17",
    "Text": "Yet when a new born-girl - the gender that they ascribe to the\\n\\t\\t\\tCompassionate - is announced to one of them, his face darkens and\\n\\t\\t\\the is filled with grief."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "18",
    "Text": "Do they ascribe to Allah, the female gender who is brought up\\n\\t\\t\\tamong trinkets and is unable to make herself clear in\\n\\t\\t\\tdisputation?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "19",
    "Text": "They regard the angels, who are themselves servants of the\\n\\t\\t\\tCompassionate, as female divinities. Did they witness their\\n\\t\\t\\tcreation? They should know that their testimony shall be noted\\n\\t\\t\\tdown and they shall be called to account for it."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "20",
    "Text": "They say: \"Had it been the will of the Compassionate, We should\\n\\t\\t\\tnever have worshipped them.\" They have no knowledge about that;\\n\\t\\t\\tthey are merely guessing."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "21",
    "Text": "Or have We given them a Book before this to which they hold\\n\\t\\t\\tauthority for their angel-worshipping?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "22",
    "Text": "The only argument they have is to say: \"We found our forefathers\\n\\t\\t\\tpracticing this faith and we are walking in their footsteps.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "23",
    "Text": "Even so, whenever We sent a Warner before you to forewarn a\\n\\t\\t\\tnation, its affluent people said: \"We found our forefathers\\n\\t\\t\\tpracticing this faith and surely we are going to follow their\\n\\t\\t\\tfootsteps.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "24",
    "Text": "Each Warner asked: \"What if I bring you better guidance than that\\n\\t\\t\\twhich your forefathers practiced?\" But they replied: \"Well! We\\n\\t\\t\\treject the faith with which you have been sent.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "25",
    "Text": "Consequently, We inflicted Our retribution on them; then see what\\n\\t\\t\\twas the end of those who disbelieved?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "26",
    "Text": "Behold! Ibrahim said to his father and his people: \"I renounce\\n\\t\\t\\tthe gods you worship,"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "27",
    "Text": "except Him Who created me, for He will surely guide me.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "28",
    "Text": "And he left this statement as an abiding precept among his\\n\\t\\t\\tdescendants, so that they should turn to it."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "29",
    "Text": "But they started worshipping others, and rather than punishing I\\n\\t\\t\\tkept on providing them and their forefathers the comfort of this\\n\\t\\t\\tlife, until there came to them the truth and a Rasool to expound\\n\\t\\t\\tit clearly."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "30",
    "Text": "But now when the truth has came to them, they say: \"This is magic\\n\\t\\t\\tand we do not believe it.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "31",
    "Text": "They also say: \"Why is this Qur'an not revealed to a man of great\\n\\t\\t\\timportance in the two towns (Makkah and Ta'if)\"?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "32",
    "Text": "Is it they who distribute the blessings of your Rabb? It is We\\n\\t\\t\\tWho distribute the means of their livelihood in the life of this\\n\\t\\t\\tworld, raising some in rank above others, so that one may take\\n\\t\\t\\tothers into his service. But the blessing of your Rabb is far\\n\\t\\t\\tgreater in value than the wealth of this world which they amass."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "33",
    "Text": "And were it not that all mankind might become one nation of\\n\\t\\t\\tunbelievers, We would have given those who disbelieve in the\\n\\t\\t\\tCompassionate (Allah), such houses whose roofs, stairways by\\n\\t\\t\\twhich they go to upper chambers all made with silver,"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "34",
    "Text": "and also the doors of their houses and couches on which they\\n\\t\\t\\trecline,"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "35",
    "Text": "along with ornaments of gold - for all these are nothing but\\n\\t\\t\\tmerely comforts of this worldly life. It is the life of the\\n\\t\\t\\thereafter which your Rabb has reserved for the righteous."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "36",
    "Text": "He who turns away from the remembrance (Reminder) of the\\n\\t\\t\\tCompassionate (Allah), We assign a shaitan for him, who becomes\\n\\t\\t\\this intimate companion."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "37",
    "Text": "- and turns such people away from the Right Path, while they\\n\\t\\t\\tthink that they are guided aright."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "38",
    "Text": "- Ultimately, when that person will come to Us on the Day of\\n\\t\\t\\tJudgement, he will say to his shaitan companion: \"I wish that I\\n\\t\\t\\twas far apart from you as the east is from the west: you turned\\n\\t\\t\\tout to be an evil companion.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "39",
    "Text": "Then it will be said to them: \"Well, you have already done wrong,\\n\\t\\t\\trealizing this fact today will avail you nothing, as you both are\\n\\t\\t\\tpartners in the same punishment."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "40",
    "Text": "O Prophet, can you make the deaf hear, or give direction to the\\n\\t\\t\\tblind or those who choose to remain in manifest error?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "41",
    "Text": "We shall surely inflict retribution on them, whether We take you\\n\\t\\t\\taway from this world,"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "42",
    "Text": "or let you see their end, which We have promised them: surely We\\n\\t\\t\\thave full power over them."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "43",
    "Text": "Therefore, hold fast to this Qur'an which is reveled to you,\\n\\t\\t\\tsurely you are on the Right Way."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "44",
    "Text": "In fact this Qur'an is a reminder for you and your people; and\\n\\t\\t\\tyou shall soon be questioned about it."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "45",
    "Text": "Ask those of Our Rasools whom We sent before you if We ever\\n\\t\\t\\tappointed other gods to be worshipped besides the Compassionate\\n\\t\\t\\tAllah?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "46",
    "Text": "We sent Musa with Our signs to Fir'on and his chiefs. He said to\\n\\t\\t\\tthem: \"I am a Rasool of the Rabb of the worlds.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "47",
    "Text": "When he showed them Our signs, they laughed at those signs."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "48",
    "Text": "Yet We showed them sign after sign each greater than the one\\n\\t\\t\\tpreceding it and We afflicted them with the scourge, so that they\\n\\t\\t\\tmight return to the Right Way."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "49",
    "Text": "Each time they were seized by a scourge, they requested Musa: \"O\\n\\t\\t\\tmagician! Pray to your Rabb for us by virtue of the covenant He\\n\\t\\t\\thas made with you; we shall surely accept your guidance.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "50",
    "Text": "But each time We lifted the scourge from them, they broke their\\n\\t\\t\\tpledge."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "51",
    "Text": "One day Fir'on made a proclamation among his people: \"O my\\n\\t\\t\\tpeople! Is not the kingdom of Egypt mine? Are not these rivers\\n\\t\\t\\tflowing beneath me? Can you not see?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "52",
    "Text": "Am I not better than this despicable wretch, who can hardly\\n\\t\\t\\texpress himself clearly?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "53",
    "Text": "If he is really a Rasool then Why have no gold bracelets been\\n\\t\\t\\tgiven to him, or angels sent down to accompany him?\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "54",
    "Text": "Thus did he incite his people and they obeyed him; surely they\\n\\t\\t\\twere a nation of transgressors."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "55",
    "Text": "At last when they provoked Us, We inflicted retribution on them\\n\\t\\t\\tand drowned them all,"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "56",
    "Text": "and made them a lesson and an example for the later generations."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "57",
    "Text": "When Maryam's son Isa (Jesus) is quoted as an example, your\\n\\t\\t\\tpeople raise a clamor at it,"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "58",
    "Text": "and say: \"Are Our gods better or is he?\" They cite this to you\\n\\t\\t\\tmerely to provoke you. They are but a quarrelsome people."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "59",
    "Text": "He (Jesus) was no more than a mortal whom We favored and made an\\n\\t\\t\\texample to the children of Israel."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "60",
    "Text": "Had it been Our will, We could create angels from you to succeed\\n\\t\\t\\tyou in the earth."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "61",
    "Text": "He (Jesus) is, in fact, a sign for the coming of the Hour of\\n\\t\\t\\tDoom. Therefore, have no doubt about its coming, follow me; this\\n\\t\\t\\tis the Right Way."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "62",
    "Text": "Let not shaitan mislead you, for he is your open enemy."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "63",
    "Text": "When Isa (Jesus) came with clear signs, he stated: \"I have\\n\\t\\t\\tbrought you wisdom, and to clarify some of those things about\\n\\t\\t\\twhich you have disputes: so fear Allah and obey me."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "64",
    "Text": "Surely it is Allah Who is my Rabb and your Rabb, so worship Him.\\n\\t\\t\\tThis is the Right Way.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "65",
    "Text": "Inspite of these teachings, the factions disagreed among\\n\\t\\t\\tthemselves; so woe to the wrongdoers from the punishment of a\\n\\t\\t\\tpainful Day."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "66",
    "Text": "Are they waiting for the Hour of Doom that it should come on them\\n\\t\\t\\tall of a sudden, without warning?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "67",
    "Text": "On that Day, even friends will become enemies to one another with\\n\\t\\t\\tthe exception of the righteous people."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "68",
    "Text": "\"O My devotees! Today you have nothing to fear or to regret,\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "69",
    "Text": "will be said to those who believed in Our revelations and became\\n\\t\\t\\tMuslims,"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "70",
    "Text": "\"Enter paradise, you and your spouses; you will be made happy.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "71",
    "Text": "There they shall be served with golden dishes and golden goblets,\\n\\t\\t\\tand they shall have everything that their souls can desire and\\n\\t\\t\\tall that their eyes can delight in - and it will be said to them:\\n\\t\\t\\t\"Now you shall abide therein forever."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "72",
    "Text": "You have inherited this paradise by virtue of your good deeds."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "73",
    "Text": "therein you shall have plenty of fruit to eat.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "74",
    "Text": "But the criminals will abide in the punishment of hell."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "75",
    "Text": "Their punishment will never be lightened, and they shall remain\\n\\t\\t\\tdespair therein."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "76",
    "Text": "We did not wrong them, but it is they who wronged themselves."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "77",
    "Text": "They will cry: \"O Malik (the keeper of hell)! Let your Rabb put\\n\\t\\t\\tand end to us.\" But he will answer: \"Nay! You are going to live\\n\\t\\t\\tforever.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "78",
    "Text": "We have brought you the truth, but most of you hate the truth."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "79",
    "Text": "If they have devised a plan to ruin you (O Muhammad), then surely\\n\\t\\t\\tWe too shall devise a plan to ruin them."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "80",
    "Text": "Do they think that We cannot hear their secret talks and their\\n\\t\\t\\tprivate converse? Of course We do, and Our messengers (angels)\\n\\t\\t\\twho are assigned to them, record it all."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "81",
    "Text": "O Prophet tell the Christians: \"If the Compassionate (Allah) had\\n\\t\\t\\ta son, I would be the first to worship him.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "82",
    "Text": "Glory be to the Rabb of the heavens and the earth, the Lord of\\n\\t\\t\\tthe Throne, He is above what they ascribe to Him."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "83",
    "Text": "So let them blunder and play until they face their Day, which has\\n\\t\\t\\tbeen promised to them."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "84",
    "Text": "It is He (Allah) Who is God in the heavens and God on earth; He\\n\\t\\t\\tis the All-Wise, the All-Knowledgeable."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "85",
    "Text": "Blessed is He to Whom belongs the dominion of the heavens and the\\n\\t\\t\\tearth and all that lies between them! He Alone has the knowledge\\n\\t\\t\\tof the Hour of Doom, and to Him you shall all be brought back."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "86",
    "Text": "And those to whom they invoke besides Him, have no power to\\n\\t\\t\\tintercede for them except those who testify to the truth by\\n\\t\\t\\tvirtue of knowledge."
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "87",
    "Text": "If you ask them Who created them, they will certainly say:\\n\\t\\t\\t\"Allah.\" How then are they deluded away from the truth?"
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "88",
    "Text": "Allah has heard the Prophet's cry: \"O Rabb! Surely these are a\\n\\t\\t\\tpeople who would not believe.\""
  },
  {
    "SurahNumber": "43",
    "AyahNumber": "89",
    "Text": "Therefore, O Prophet! Bear with them and wish them peace. They\\n\\t\\t\\tshall soon come to know the truth."
  }
]
