[
  {
    "SurahNumber": "84",
    "AyahNumber": "1",
    "NoteID": "6031",
    "Body": "The passing away of this world of sense to make way for a\\n\\t\\t\\t\\tnew World of Reality is here indicated by two Facts,\\n\\t\\t\\t\\twhich are themselves signs for a complete revolution in\\n\\t\\t\\t\\tour whole knowledge and experience. At the beginning of\\n\\t\\t\\t\\tS. lxxxii. and S. lxxxi, other Signs were used, to lead\\n\\t\\t\\t\\tup to the arguments there advanced. Here the two Signs\\n\\t\\t\\t\\tare: (1) the Sky being rent asunder and giving up its\\n\\t\\t\\t\\tsecrets, and (2) the Earth being flattened out from the\\n\\t\\t\\t\\tglobe it is, and giving up its secrets. See the following\\n\\t\\t\\t\\tnotes."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "2",
    "NoteID": "6032",
    "Body": "We may think that the heavens we see above us-high and\\n\\t\\t\\t\\tsacred, seemingly vast and limitless, eternal and\\n\\t\\t\\t\\ttimeless-are not created matter. But they are. And they\\n\\t\\t\\t\\tremain just so long as Allah wills it so, and not a\\n\\t\\t\\t\\tmoment longer. As soon as His Command issues for their\\n\\t\\t\\t\\tdissolution, they will obey and vanish, and all their\\n\\t\\t\\t\\tmystery will be emptied out. And it must necessarily be\\n\\t\\t\\t\\tso; their very nature as created beings requires that\\n\\t\\t\\t\\tthey must hearken to the voice of their Creator, even to\\n\\t\\t\\t\\tthe extent of their own extinction."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "3",
    "NoteID": "6033",
    "Body": "The Earth is a globe, enclosing within it many secrets\\n\\t\\t\\t\\tand mysteries-gold and diamonds in its mines, heat and\\n\\t\\t\\t\\tmagnetic forces in its entrails, and the bodies of\\n\\t\\t\\t\\tcountless generations of men buried within its soil. At\\n\\t\\t\\t\\tits dissolution all these contents will be disgorged: it\\n\\t\\t\\t\\twill lose its shape as a globe, and cease to exist."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "5",
    "NoteID": "6034",
    "Body": "See n. 6032. We think the earth so solid and real. All\\n\\t\\t\\t\\tour perishable things dissolve into the earth. But the\\n\\t\\t\\t\\tearth itself will dissolve into a truer Reality."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "5",
    "NoteID": "6035",
    "Body": "The substantive clause, to follow the two conditional\\n\\t\\t\\t\\tclauses preceding, may be filled up from the suggestion\\n\\t\\t\\t\\tcontained in lxxxii. 5."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "6",
    "NoteID": "6036",
    "Body": "This life is ever full of toil and misery, if looked at\\n\\t\\t\\t\\tas empty of the Eternal Hope which Revelation gives us.\\n\\t\\t\\t\\tHence the literature of pessimism in poetry and\\n\\t\\t\\t\\tphilosophy which thinking minds have poured forth in all\\n\\t\\t\\t\\tages, when that Hope was obscured to them. \"Our sweetest\\n\\t\\t\\t\\tsongs are those that tell of saddest thought.\" \"To each\\n\\t\\t\\t\\this suffering ; all are men condemned alike a groan!\" It\\n\\t\\t\\t\\tis the noblest men that have to \"scorn delights and live\\n\\t\\t\\t\\tlaborious days\" in this life. The good suffer on account\\n\\t\\t\\t\\tof their very goodness: the evil on account of their\\n\\t\\t\\t\\tEvil. But the balance will be set right in the end. Those\\n\\t\\t\\t\\tthat wept shall be made to rejoice, and those that went\\n\\t\\t\\t\\tabout thoughtlessly rejoicing, shall be made to weep for\\n\\t\\t\\t\\ttheir folly. They will all go to their account with Allah\\n\\t\\t\\t\\tand meet Him before His Throne of Judgment."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "7",
    "NoteID": "6037",
    "Body": "Right Hand. Cf. xvii 71. Then will be the fortunate ones,\\n\\t\\t\\t\\twho spent their lives in goodness and truth: for them the\\n\\t\\t\\t\\taccount will be made easy; for even after the balancing,\\n\\t\\t\\t\\tthey will receive more than their merits deserve, on\\n\\t\\t\\t\\taccount of the infinite grace, and mercy of Allah."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "9",
    "NoteID": "6038",
    "Body": "His people: should be understood in a large sense,\\n\\t\\t\\t\\tincluding of course all those nearest and dearest to him."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "10",
    "NoteID": "6039",
    "Body": "In lxix. 24, the wicked are given the Record in their\\n\\t\\t\\t\\tleft hand. But their hands will not be free. Sin will tie\\n\\t\\t\\t\\ttheir hands behind their back: and thus they can only\\n\\t\\t\\t\\treceive their Records in their left hand, behind their\\n\\t\\t\\t\\tback."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "11",
    "NoteID": "6040",
    "Body": "The wicked will cry for death and annihilation: but they\\n\\t\\t\\t\\twill neither live nor die: xx. 74."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "13",
    "NoteID": "6041",
    "Body": "The tables are now turned. His self-complacence and\\n\\t\\t\\t\\tself-conceit in his lower life will now give place to\\n\\t\\t\\t\\tweeping and gnashing of teeth! Cf. n. 6036 above."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "14",
    "NoteID": "6042",
    "Body": "Most of the Evil in this world is due to the false idea\\n\\t\\t\\t\\tthat man is irresponsible, or to a mad and thoughtless\\n\\t\\t\\t\\tindulgence of self. Man is not irresponsible. He is\\n\\t\\t\\t\\tresponsible for every deed, word, and thought of his, to\\n\\t\\t\\t\\this Maker, to Whom he has to return, to give an account\\n\\t\\t\\t\\tof himself. To remember this and act accordingly is to\\n\\t\\t\\t\\tachieve salvation; to forget or flout that responsibility\\n\\t\\t\\t\\tis to get into Hell."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "16",
    "NoteID": "6043",
    "Body": "The same form of adjuration as in lxix. 37. The\\n\\t\\t\\t\\tsubstantive statement is in verse 19 below: 'Ye shall\\n\\t\\t\\t\\tsurely travel from stage to stage\". Nothing in this life\\n\\t\\t\\t\\tis fixed, or will last. Three things are mentioned which\\n\\t\\t\\t\\ton the one hand have remained from age to age for as far\\n\\t\\t\\t\\tback as the memory of man can go, and yet each of them is\\n\\t\\t\\t\\tbut a short phase, gone as it were in the twinkling of an\\n\\t\\t\\t\\teye. See the following notes. So our life here is but a\\n\\t\\t\\t\\tfleeting show. Its completion is to be looked for\\n\\t\\t\\t\\telsewhere."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "16",
    "NoteID": "6044",
    "Body": "(1) The sun seems such a great reality that people\\n\\t\\t\\t\\tworshipped him as a divinity. The beautiful glow it\\n\\t\\t\\t\\tleaves when it sets is but momentary: it changes every\\n\\t\\t\\t\\tmoment and vanishes with the twilight."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "17",
    "NoteID": "6045",
    "Body": "(2) The Night is a phenomenon you see during almost half\\n\\t\\t\\t\\tevery twenty-four hours in ordinary latitudes. At\\n\\t\\t\\t\\tnightfall, all the wandering flocks and herds come home.\\n\\t\\t\\t\\tThe men scattered abroad for their livehood return home\\n\\t\\t\\t\\tto rest and sleep. The Night collects them in their\\n\\t\\t\\t\\thomes, and yet this phase of Homing lasts but a little\\n\\t\\t\\t\\twhile. Presently all is silent and still. So will it be\\n\\t\\t\\t\\twith our souls when this life is ended with our death. We\\n\\t\\t\\t\\tshall be collected in a newer and larger Homing."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "18",
    "NoteID": "6046",
    "Body": "(3) The astronomical Full Moon does not last a moment.\\n\\t\\t\\t\\tThe moment the moon is full, she begins to decline, and\\n\\t\\t\\t\\tthe moment she is in her \"inter-lunar swoon\", she begins\\n\\t\\t\\t\\ther career anew as a growing New Moon. So is man's life\\n\\t\\t\\t\\there below. It is not fixed or permanent, either in its\\n\\t\\t\\t\\tphysical phases, or even more strikingly, in its finer\\n\\t\\t\\t\\tphases, intellectual, emotional, or spiritual."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "19",
    "NoteID": "6047",
    "Body": "Man travels and ascends stage by stage. In lxvii. 3 the\\n\\t\\t\\t\\tsame word in the form tibaqan was used of the heavens, as\\n\\t\\t\\t\\tif they were in layers one above another. Man's spiritual\\n\\t\\t\\t\\tlife may similarly be compared to an ascent from one\\n\\t\\t\\t\\theaven to another."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "20",
    "NoteID": "6048",
    "Body": "Considering man's high destiny, and the fact that this\\n\\t\\t\\t\\tlife is but a stage or a sojourn for him, it might be\\n\\t\\t\\t\\texpected that he would cagerly embrace every opportunity\\n\\t\\t\\t\\tof welcoming Allah's Revelation and ascending by Faith to\\n\\t\\t\\t\\theights of spiritual wisdom. There is something wrong\\n\\t\\t\\t\\twith his will if he does not do so. Notice the transition\\n\\t\\t\\t\\tfrom the second person in verse 19, where there is a\\n\\t\\t\\t\\tdirect appeal to Allah's votaries, to the third person in\\n\\t\\t\\t\\tverses 20-21, where men who are rebels against Allah's\\n\\t\\t\\t\\tKingdom are spoken of as if they were aliens."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "21",
    "NoteID": "6049",
    "Body": "Prostrate. out of respect and humble gratitude to Allah."
  },
  {
    "SurahNumber": "84",
    "AyahNumber": "25",
    "NoteID": "6050",
    "Body": "Cf. xli. 8."
  }
]
