[
  {
    "SurahNumber": "86",
    "AyahNumber": "1",
    "NoteID": "6067",
    "Body": "The appeal here is to single Sign, viz.: the Sky with its\\n\\t\\t\\t\\tNight. Visitant; and the substantive proposition is in\\n\\t\\t\\t\\tverse 4: \"There is no soul but has a protector over it\".\\n\\t\\t\\t\\tIn the last Sura we considered the persecution of Allah's\\n\\t\\t\\t\\tvotaries, and how Allah protects them. Here the same\\n\\t\\t\\t\\ttheme is presented in another aspect. In the darkest sky\\n\\t\\t\\t\\tshines out most brilliantly the light of the most\\n\\t\\t\\t\\tbrilliant star. So in the night of spiritual darkness-\\n\\t\\t\\t\\twhether through ignorance or distress shines the glorious\\n\\t\\t\\t\\tstar of Allah's revelation. By the same token the man of\\n\\t\\t\\t\\tFaith and Truth has nothing to fear. Allah will protect\\n\\t\\t\\t\\tHis own."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "1",
    "NoteID": "6068",
    "Body": "This is explained in verse 3 below. The \"Star of piercing\\n\\t\\t\\t\\tbrightness\" is understood by some to be the Morning Star,\\n\\t\\t\\t\\tby others to be the planet Saturn, by others again to be\\n\\t\\t\\t\\tSirius, or the Pleiads or shooting stars. I think it is\\n\\t\\t\\t\\tbest to take the \"Star\" in the collective or generic\\n\\t\\t\\t\\tsense, for stars shine on every night in the year, and\\n\\t\\t\\t\\ttheir piercing brightness is most noticeable on the\\n\\t\\t\\t\\tdarkest night."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "4",
    "NoteID": "6069",
    "Body": "If man has a true spiritual understanding, he has nothing\\n\\t\\t\\t\\tto be afraid of. He is protected by Allah in many ways\\n\\t\\t\\t\\tthat he does not even know. He may be an insignificant\\n\\t\\t\\t\\tcreature as a mere animal, but his soul raises him to a\\n\\t\\t\\t\\tdignity above other creation. And all sorts of divine\\n\\t\\t\\t\\tforces guard and protect him."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "6",
    "NoteID": "6070",
    "Body": "See n. 5832. to lxxvi. 2. See also last note."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "7",
    "NoteID": "6071",
    "Body": "A man's seed is the quintessence of his body. It proceeds\\n\\t\\t\\t\\tfrom his loins, i.e., from his back between the hip-bones\\n\\t\\t\\t\\tand his ribs. His back-bone is the source and symbol of\\n\\t\\t\\t\\this strength and personality. In the spinal cord and in\\n\\t\\t\\t\\tthe brain is the directive energy of the central nervous\\n\\t\\t\\t\\tsystem, and this directs all action, organic and psychic.\\n\\t\\t\\t\\tThe spinal cord is continuous with the Medulla Oblongata\\n\\t\\t\\t\\tin the brain."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "8",
    "NoteID": "6072",
    "Body": "The Creator who can mingle the forces of psychic and\\n\\t\\t\\t\\tphysical muscular action in the creation of man, as\\n\\t\\t\\t\\texplained in the last note, can surely give a new life\\n\\t\\t\\t\\tafter physical death here, and restore man's personality\\n\\t\\t\\t\\tin the new world that will open out in the Hereafter."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "10",
    "NoteID": "6073",
    "Body": "In that new world, all our actions, motives, thoughts,\\n\\t\\t\\t\\tand imaginings of this life, however secret, will be\\n\\t\\t\\t\\tbrought into the open, and tested by the standards of\\n\\t\\t\\t\\tabsolute Truth, and not by false standards of custom,\\n\\t\\t\\t\\tprejudice, or partiality. In that severe test, any\\n\\t\\t\\t\\tadventitious advantages of this life will have no\\n\\t\\t\\t\\tstrength or force whatever, and cannot help in any way."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "11",
    "NoteID": "6074",
    "Body": "The Firmament above is always the same, and yet it\\n\\t\\t\\t\\tperforms its diurnal round, smoothly and punctually. So\\n\\t\\t\\t\\tdoes Allah's Revelation show forth the Truth, which like\\n\\t\\t\\t\\ta circle is ever true to its centre,-which is ever the\\n\\t\\t\\t\\tsame, though it revolves through the changing\\n\\t\\t\\t\\tcircumstances of our present life."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "12",
    "NoteID": "6075",
    "Body": "The earth seems hard, but springs can gush forth and\\n\\t\\t\\t\\tvegetables sprout through it and make it green and soft.\\n\\t\\t\\t\\tSo is Truth: hard perhaps to mortals, but through the\\n\\t\\t\\t\\tfertilising agency of Revelation, it allows our inner\\n\\t\\t\\t\\tpersonality to sprout and blossom forth."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "13",
    "NoteID": "6076",
    "Body": "See the last two notes. Revelation-Allah's Truth-can\\n\\t\\t\\t\\tpierce through the hardest crusts, and ever lead us back\\n\\t\\t\\t\\tto the centre and goal of our life: for it separates Good\\n\\t\\t\\t\\tfrom Evil definitely. It is not mere play or amusement,\\n\\t\\t\\t\\tany more than the Sky or the Earth is. It helps us in the\\n\\t\\t\\t\\thighest issues of our life."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "15",
    "NoteID": "6077",
    "Body": "Though Allah in His Mercy has provided a piercing light\\n\\t\\t\\t\\tto penetrate our spiritual darkness, and made our beings\\n\\t\\t\\t\\tresponsive to the growth of spiritual understanding, just\\n\\t\\t\\t\\tas the hard earth is responsive to the sprouting of a\\n\\t\\t\\t\\tseed or the gushing of a stream, yet there are evil,\\n\\t\\t\\t\\tunregenerate men who plot and scheme against the\\n\\t\\t\\t\\tbeneficent purpose of Allah. But their plots will be of\\n\\t\\t\\t\\tno avail, and Allah's Purpose will prevail. It happened\\n\\t\\t\\t\\tso with the Quraish who wanted to thwart the growth of\\n\\t\\t\\t\\tIslam. It will be so in all ages."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "16",
    "NoteID": "6078",
    "Body": "Cf. iii. 54."
  },
  {
    "SurahNumber": "86",
    "AyahNumber": "17",
    "NoteID": "6079",
    "Body": "Gentle forbearance with Evil shows our trust in Allah and\\n\\t\\t\\t\\tAllah's Plan: for it can never be frustrated. This does\\n\\t\\t\\t\\tnot mean that we should assist or compromise with evil,\\n\\t\\t\\t\\tor fail to put it down where we have the power. It means\\n\\t\\t\\t\\tpatience and humility where we have no visible power to\\n\\t\\t\\t\\tprevent Evil."
  }
]
