[
  {
    "SurahNumber": "36",
    "AyahNumber": "1",
    "NoteID": "3943",
    "Body": "Some Commentators take Ya to be the vocative particle,\\n\\t\\t\\t\\tand Sin to be the abbreviation of Insan, Sin being the\\n\\t\\t\\t\\tonly \"Firm Letter\" in the word. In that case it would be\\n\\t\\t\\t\\tan address to man. \"O man!\" But \"man\" in this connection\\n\\t\\t\\t\\tis understood to mean the Leader of man, the noblest of\\n\\t\\t\\t\\tmankind. Muhammad the Prophet of Allah. For this Sura\\n\\t\\t\\t\\tdeals mainly with the holy Prophet and his Message. But\\n\\t\\t\\t\\tno dogmatic assertion can be made about the Abbreviated\\n\\t\\t\\t\\tLetters, for which see Appendix I, following S. ii.\\n\\t\\t\\t\\tYa-Sin is usually treated as a title of the holy Prophet."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "2",
    "NoteID": "3944",
    "Body": "The best credentials of the holy Prophet are: (1) the\\n\\t\\t\\t\\trevelation which he brought (\"the Qur-an\"), and the\\n\\t\\t\\t\\theroic unselfish life which he led (\"on a Straight Way\").\\n\\t\\t\\t\\tThe appeal is therefore made on the testimony of these\\n\\t\\t\\t\\ttwo facts."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "5",
    "NoteID": "3945",
    "Body": "The Revelation again is characterised by two attributes\\n\\t\\t\\t\\twhich we find most helpful in contemplating about Allah.\\n\\t\\t\\t\\tIt has force and power: for Allah is Exalted in Might and\\n\\t\\t\\t\\table to enforce His Will. And it brings a Message of hope\\n\\t\\t\\t\\tand mercy; for Allah is Most Merciful. By its\\n\\t\\t\\t\\tcharacteristics we know that the Qur-an is from Allah."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "6",
    "NoteID": "3946",
    "Body": "The Quraish had received no Prophet before, and therefore\\n\\t\\t\\t\\tone of themselves was made the vehicle for the universal\\n\\t\\t\\t\\tMessage to the whole world."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "7",
    "NoteID": "3947",
    "Body": "Cf. vii. 30, and n. 1012; also xvii. 16, and n. 2193. If\\n\\t\\t\\t\\tpeople deliberately and obstinately refuse \"to believe\",\\n\\t\\t\\t\\ti.e., to receive guidance and admonition, the result must\\n\\t\\t\\t\\tbe that Allah's grace and mercy are withdrawn from them.\\n\\t\\t\\t\\tTheir own perversity inevitably blocks up all channels\\n\\t\\t\\t\\tfor their correction."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "8",
    "NoteID": "3948",
    "Body": "Man's misdeeds inevitably call forth the operation of\\n\\t\\t\\t\\tAllah's Law. The result of man's wilful disobedience is\\n\\t\\t\\t\\tnow described in a series of metaphors. (1) Refusal of\\n\\t\\t\\t\\tAllah's Light means less and less freedom of action for\\n\\t\\t\\t\\tman: the yoke of sin is fastened round man's neck, and it\\n\\t\\t\\t\\tgets more and more tightened, right up to the chin. (2)\\n\\t\\t\\t\\tThe head is forced up and kept in a stiff position, so\\n\\t\\t\\t\\tthat the mind becomes befogged. Moral obliquity taints\\n\\t\\t\\t\\tthe intellect. According to the Sanskrit proverb, \"When\\n\\t\\t\\t\\tdestruction comes near, understanding is turned upside\\n\\t\\t\\t\\tdown.\" According to the Latin proverb, \"Whom God wishes\\n\\t\\t\\t\\tto destroy, He first makes demented.\" In other words,\\n\\t\\t\\t\\tiniquity not only is folly, but leads deeper and deeper\\n\\t\\t\\t\\tinto folly, narrowness of vision, and blindness to the\\n\\t\\t\\t\\tfiner things of life. (3) This state of deprivation of\\n\\t\\t\\t\\tGrace leads to such a decline in spiritual vitality that\\n\\t\\t\\t\\tthe victim can neither progress nor turn back, as\\n\\t\\t\\t\\texplained in the next verse."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "9",
    "NoteID": "3949",
    "Body": "Their retreat is cut off and their progress is\\n\\t\\t\\t\\timpossible. Further the Light that should come from above\\n\\t\\t\\t\\tis cut off, so that they become totally devoid of any\\n\\t\\t\\t\\thope, and the last gleam of any spiritual understanding\\n\\t\\t\\t\\tis extinguished in them."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "10",
    "NoteID": "3950",
    "Body": "When the stage just described is reached, revelation or\\n\\t\\t\\t\\tspiritual teaching ceases to have any value for them. Why\\n\\t\\t\\t\\tthen preach? The answer is given in the verses following."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "11",
    "NoteID": "3951",
    "Body": "Cf. xxxv. 18. As far as those are concerned, who have\\n\\t\\t\\t\\tobstinately delivered themselves to evil, the preaching\\n\\t\\t\\t\\tof Allah's Message has no appeal, because their own will\\n\\t\\t\\t\\tshuts them out. But there are others who are anxious to\\n\\t\\t\\t\\thear Allah's Message and receive Allah's grace. They love\\n\\t\\t\\t\\tAllah and fear to offend against His holy Law, and their\\n\\t\\t\\t\\tfear is not merely superficial but deep-seated: for while\\n\\t\\t\\t\\tthey do not yet see Allah, nor do other people see them,\\n\\t\\t\\t\\tthey have the same sense of Allah's presence as if they\\n\\t\\t\\t\\tsaw Him, and their religion is not a mere pose, \"to be\\n\\t\\t\\t\\tseen of men\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "11",
    "NoteID": "3952",
    "Body": "See n. 3902 to xxxv. 18. Unseen is here adverbial: their\\n\\t\\t\\t\\treverence for Allah is unaffected by the fact that they\\n\\t\\t\\t\\tdo not see Him, or that other people do not observe them,\\n\\t\\t\\t\\tbecause their attitude arises out of a genuine love for\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "11",
    "NoteID": "3953",
    "Body": "To such persons the Message of Allah comes as a gospel or\\n\\t\\t\\t\\tgood news: because it shows them the way of forgiveness\\n\\t\\t\\t\\tfor anything wrong in their past, and it gives them the\\n\\t\\t\\t\\tpromise of a full reward in the future,-generous beyond\\n\\t\\t\\t\\tany deserts of their own, but arising out of Allah's\\n\\t\\t\\t\\tunbounded Bounty."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "12",
    "NoteID": "3954",
    "Body": "All this is possible, because there is the assurance of a\\n\\t\\t\\t\\tHereafter, in which Allah will be all-in-all, and evil\\n\\t\\t\\t\\twill no longer bestride the world, as the term of its\\n\\t\\t\\t\\trespite will have expired."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "12",
    "NoteID": "3955",
    "Body": "Our deeds, good and bad, go to Allah before us. They will\\n\\t\\t\\t\\tof course be brought to our account; but our account will\\n\\t\\t\\t\\talso be swelled by the example we left behind us and the\\n\\t\\t\\t\\tconsequences of our deeds, that will come into play or\\n\\t\\t\\t\\tcontinue to operate after our earthly life has ceased.\\n\\t\\t\\t\\tOur moral and spiritual responsibility is therefore much\\n\\t\\t\\t\\twider than as affects our own person."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "12",
    "NoteID": "3956",
    "Body": "Cf. ii. 124 and n. 124. All our account will be exactly\\n\\t\\t\\t\\tpreserved as in a book of record."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "13",
    "NoteID": "3957",
    "Body": "Many of the classical Commentators have supposed that the\\n\\t\\t\\t\\tCity referred to was Antioch. Now Antioch was one of the\\n\\t\\t\\t\\tmost important cities in North Syria in the first century\\n\\t\\t\\t\\tof the Christian era. It was a Greek city founded by\\n\\t\\t\\t\\tSeleucus Nicator, one of the successors of Alexander,\\n\\t\\t\\t\\tabout 300 B.C. in memory of his father Antiochus. It was\\n\\t\\t\\t\\tclose to the sea, and had its sea-port at Seleucia. Soon\\n\\t\\t\\t\\tafter Christ his disciples successfully preached there,\\n\\t\\t\\t\\tand they \"were called Christians first in Antioch\": Acts,\\n\\t\\t\\t\\txi. 26. It afterwards became the seat of a most important\\n\\t\\t\\t\\tBishopric of the Christian Church. In the story told here\\n\\t\\t\\t\\t\"by way of a parable\", the City rejected the Message, and\\n\\t\\t\\t\\tthe City was destroyed: xxxvi. 29. Following Ibn Kathir,\\n\\t\\t\\t\\tI reject the identification with Antioch decisively. No\\n\\t\\t\\t\\tname, or period, or place is mentioned in the text. The\\n\\t\\t\\t\\tsignificance of the story is in the lessons to be derived\\n\\t\\t\\t\\tfrom it as a parable, for which see the next note. That\\n\\t\\t\\t\\tis independent of name, time, or place."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "14",
    "NoteID": "3958",
    "Body": "Allah sends His messengers or teachers of Truth by ones\\n\\t\\t\\t\\tand twos, and where the opposition is great and He\\n\\t\\t\\t\\tconsiders it necessary, he supports them with others.\\n\\t\\t\\t\\tTheir mission is divine, but they do not claim to be more\\n\\t\\t\\t\\tthan men. This is used by the unjust and the ungodly as\\n\\t\\t\\t\\tif it were a reproach, whereas it should commend them to\\n\\t\\t\\t\\tmen, for mankind is glorified by such commission and by\\n\\t\\t\\t\\tAllah's Self-revelation. The Message is clearly expressed\\n\\t\\t\\t\\tin human language, but because it exposes all evil, men\\n\\t\\t\\t\\tthink it unlucky, as it checks their selfishness. It is\\n\\t\\t\\t\\toften the poorest and most despised of mankind, from the\\n\\t\\t\\t\\toutskirts or \"farthest parts of the City\", that accept\\n\\t\\t\\t\\tthe Message and are willing to work and die for it. The\\n\\t\\t\\t\\tstiff-necked resist and accomplish their own destruction."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "15",
    "NoteID": "3959",
    "Body": "Cf. Acts, xiv. 15, where Paul and Barnabas say, in the\\n\\t\\t\\t\\tcity of Lystra near the modern Konia, \"We also are men\\n\\t\\t\\t\\twith like passions with you, and preach unto you that ye\\n\\t\\t\\t\\tshould tum from these vanities...\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "15",
    "NoteID": "3960",
    "Body": "They not only reject the mission of the particular\\n\\t\\t\\t\\tmessengers, but they deny the possibility of Allah's\\n\\t\\t\\t\\tsending such mission. Note how they convict themselves of\\n\\t\\t\\t\\tinconsistency by using Allah's name \"Most Gracious\", even\\n\\t\\t\\t\\tthough they may mean it ironically!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "16",
    "NoteID": "3961",
    "Body": "Just as a Messenger whose credentials are doubted can\\n\\t\\t\\t\\trefer to the authority granted by his Principal, as the\\n\\t\\t\\t\\thighest proof of his mission, so these messengers of\\n\\t\\t\\t\\tAllah invoke the authority of Allah in proof of their\\n\\t\\t\\t\\tmission. In effect they say: \"The knowledge of Allah is\\n\\t\\t\\t\\tperfect, and He knows that our mission is from Him; if\\n\\t\\t\\t\\tyou do not, it is your own misfortune.\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "17",
    "NoteID": "3962",
    "Body": "Then they proceed to explain what their mission is. It is\\n\\t\\t\\t\\tnot to force them but to convince them. It is to proclaim\\n\\t\\t\\t\\topenly and clearly Allah's Law, which they were\\n\\t\\t\\t\\tbreaking,-to denounce their sins and to show them the\\n\\t\\t\\t\\tbetter path. If they were obstinate, it was their own\\n\\t\\t\\t\\tloss. If they were rebellious against Allah, the\\n\\t\\t\\t\\tpunishment rested with Allah."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "18",
    "NoteID": "3963",
    "Body": "Tair means a bird. Like the Roman augurs, the Arabs had a\\n\\t\\t\\t\\tsuperstition about deriving omens from birds. Cf. the\\n\\t\\t\\t\\tEnglish word \"auspicious\", from the Latin avis, a bird,\\n\\t\\t\\t\\tand specio, I see. From Tair (bird) came ta-taiyara, or\\n\\t\\t\\t\\tittaiyara, to draw evil omens. Because the prophets of\\n\\t\\t\\t\\tAllah denounced evil, the evil-doers thought that they\\n\\t\\t\\t\\tbrought ill-luck to them. As a matter of fact any evil\\n\\t\\t\\t\\tthat happened to them was the result of their own\\n\\t\\t\\t\\till-deeds. Cf. vii. 131, where the Egyptians ascribed\\n\\t\\t\\t\\ttheir calamities to the ill-luck brought by Moses: and\\n\\t\\t\\t\\txxvii. 47, where the Thamud ascribed ill-luck to the\\n\\t\\t\\t\\tpreaching of Salih."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "19",
    "NoteID": "3964",
    "Body": "'What ye call omens arise from your own iii-deeds. Do you\\n\\t\\t\\t\\tsuppose that a man who comes to warn you and teach you\\n\\t\\t\\t\\tthe better way brings you ill-luck? Fie upon you!'"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "19",
    "NoteID": "3965",
    "Body": "To call Good evil and accuse of falsehood men of truth\\n\\t\\t\\t\\twho come unselfishly to bring the message of the\\n\\t\\t\\t\\tbeneficent Mercy of Allah, is the very height of\\n\\t\\t\\t\\textravagance and transgression."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "20",
    "NoteID": "3966",
    "Body": "While the wealthy, influential, and fashionable men in\\n\\t\\t\\t\\tthe city were doubtful of Allah's providence and\\n\\t\\t\\t\\tsuperstitiously believed in Chance and evil omens, the\\n\\t\\t\\t\\tTruth was seen by a man in the outskirts of the City, a\\n\\t\\t\\t\\tman held in low esteem by the arrogant. He had believed,\\n\\t\\t\\t\\tand he wanted his City to believe. So, in Arabia, when\\n\\t\\t\\t\\tthe arrogant chiefs of the Quraish exiled the holy\\n\\t\\t\\t\\tProphet, it was men from Madinah and from the outskirts,\\n\\t\\t\\t\\twho welcomed him, believed in him, and supported his\\n\\t\\t\\t\\tmission in every way."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "21",
    "NoteID": "3967",
    "Body": "Prophets do not seek their own advantage. They serve\\n\\t\\t\\t\\tAllah and humanity. 'Their hope lies in the good pleasure\\n\\t\\t\\t\\tof Allah, to Whose service they are devoted. Cf. x. 72;\\n\\t\\t\\t\\txii. 104; etc."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "22",
    "NoteID": "3968",
    "Body": "The argument throughout is that of intense personal\\n\\t\\t\\t\\tconviction for the individual himself, coupled with an\\n\\t\\t\\t\\tappeal to his people to follow that conviction and get\\n\\t\\t\\t\\tthe benefit of the spiritual satisfaction which he has\\n\\t\\t\\t\\thimself achieved. He says in effect: 'how is it possible\\n\\t\\t\\t\\tfor me to do otherwise than to serve and adore my Maker?\\n\\t\\t\\t\\tI shall return to Him, and so will you, and all this\\n\\t\\t\\t\\tapplies to you as much as to me.' Note how effective is\\n\\t\\t\\t\\tthe transition from the personal experience to the\\n\\t\\t\\t\\tcollective appeal."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "23",
    "NoteID": "3969",
    "Body": "The next plea is that for exclusive service to Allah.\\n\\t\\t\\t\\t'Suppose it were proper to worship other gods-Mammon,\\n\\t\\t\\t\\tSelf, or imaginary deities set up as idols,-yet of what\\n\\t\\t\\t\\tbenefit would that be? All power is in Allah. In His\\n\\t\\t\\t\\tuniversal Plan, He may think fit to give me some sorrow\\n\\t\\t\\t\\tor punishment: would these subordinate deities be able to\\n\\t\\t\\t\\thelp me or intercede for me with Him? Not at all. What\\n\\t\\t\\t\\tuse would they be? In fact I should obviously be going\\n\\t\\t\\t\\tastray,-wandering from the true Path.'"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "25",
    "NoteID": "3970",
    "Body": "Again a transition from the assured personal conviction\\n\\t\\t\\t\\tto the appeal to all to profit by the speaker's\\n\\t\\t\\t\\texperience. 'I have found the fullest satisfaction for my\\n\\t\\t\\t\\tsoul in Allah. He is my God, but He is your God also. My\\n\\t\\t\\t\\texperience can be yours also. Will you not follow my\\n\\t\\t\\t\\tadvice, and prove for yourselves that the Lord is indeed\\n\\t\\t\\t\\tgood?'"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "26",
    "NoteID": "3971",
    "Body": "This godly and righteous man entered into the Garden.\\n\\t\\t\\t\\tPerhaps it is implied that he suffered martyrdom. But\\n\\t\\t\\t\\teven then his thoughts were always with his People. He\\n\\t\\t\\t\\tregretted their obstinacy and want of understanding, and\\n\\t\\t\\t\\twished even then that they might repent and obtain\\n\\t\\t\\t\\tsalvation, but they were obdurate and suffered for their\\n\\t\\t\\t\\tsins as we learn from verses 28-29 below."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "27",
    "NoteID": "3972",
    "Body": "This man was just a simple honest soul, but he heard and\\n\\t\\t\\t\\tobeyed the call of the prophets and obtained his\\n\\t\\t\\t\\tspiritual desire for himself and did best to obtain\\n\\t\\t\\t\\tsalvation for his people. For he loved his people and\\n\\t\\t\\t\\trespected his ancestral traditions as far as they were\\n\\t\\t\\t\\tgood, but had no hesitation in accepting the new Light\\n\\t\\t\\t\\twhen it came to him. All his past was forgiven him and he\\n\\t\\t\\t\\twas raised to dignity and honour in the Kingdom of\\n\\t\\t\\t\\tHeaven."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "29",
    "NoteID": "3973",
    "Body": "Allah's Justice or Punishment does not necessarily come\\n\\t\\t\\t\\twith pomp and circumstance, nor have the forces of human\\n\\t\\t\\t\\tevil or wickedness the power to require the exertion of\\n\\t\\t\\t\\tmighty spiritual forces to subdue them. A single mighty\\n\\t\\t\\t\\tBlast-either the rumbling of an earthquake, or a great\\n\\t\\t\\t\\tand violent wind-was sufficient in this case. Cf. xi. 67\\n\\t\\t\\t\\tand n. 1561 (which describes the fate of the Thamud;\\n\\t\\t\\t\\talso. n. 3463 to xxix. 40)."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "29",
    "NoteID": "3974",
    "Body": "Cf. xxi. 15. They had made a great deal of noise in their\\n\\t\\t\\t\\ttime, but they were reduced to silence, like spent ashes."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "30",
    "NoteID": "3975",
    "Body": "Cf. vi. 10 and many other passages of similar import.\\n\\t\\t\\t\\tIgnorant men mock at Allah's prophets, or any one who\\n\\t\\t\\t\\ttakes Religion seriously. But they do not reflect that\\n\\t\\t\\t\\tsuch levity reacts on themselves. Their own lives are\\n\\t\\t\\t\\truined and they cease to count. If they study history,\\n\\t\\t\\t\\tthey will see that countless generations were destroyed\\n\\t\\t\\t\\tbefore them because they did not take Truth seriously and\\n\\t\\t\\t\\tundermined the very basis of their individual and\\n\\t\\t\\t\\tcollective existence. The servants is here equivalent to\\n\\t\\t\\t\\t\"men\". Allah regrets the folly of men, especially as He\\n\\t\\t\\t\\tcherishes them as His own servants."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "31",
    "NoteID": "3976",
    "Body": "Not to them will they retum. What do the two pronouns\\n\\t\\t\\t\\tthem and they refer to? Commentators and translators have\\n\\t\\t\\t\\tconstrued them differently, and some of them evade the\\n\\t\\t\\t\\tquestion. To my mind the best construction seems to be:\\n\\t\\t\\t\\tthe generations which we have destroyed before the people\\n\\t\\t\\t\\taddressed ('do they not see?') will not be restored to\\n\\t\\t\\t\\tthe people addressed: generations (qurun) standing for\\n\\t\\t\\t\\tthe periods of prosperity and good fortune enjoyed by the\\n\\t\\t\\t\\tancestors. They have all been wiped out: they will never\\n\\t\\t\\t\\tbe restored, but all people will be brought before the\\n\\t\\t\\t\\tJudgment-seat for giving an account of their deeds."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "33",
    "NoteID": "3977",
    "Body": "Lest any one should say, 'if they are destroyed, how can\\n\\t\\t\\t\\tthey be brought before the Judgment-seat' a symbol is\\n\\t\\t\\t\\tpointed to. The earth is to all intents and purposes dead\\n\\t\\t\\t\\tin the winter, but Allah revives it in the spring. Cf.\\n\\t\\t\\t\\tii. 164, xxx. 19, and many other passages to that effect."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "34",
    "NoteID": "3978",
    "Body": "Date-palms and vines stand as symbols for fruit-trees of\\n\\t\\t\\t\\tall kinds, these being the characteristic fruits of\\n\\t\\t\\t\\tArabia. Grain was mentioned in the last verse; fruit is\\n\\t\\t\\t\\tmentioned now. All that is necessary for food and the\\n\\t\\t\\t\\tsatisfaction of the choicest palate is produced from what\\n\\t\\t\\t\\tlooks like inert soil, fertilised by rain and springs.\\n\\t\\t\\t\\tHere is wonderful evidence of the artistry and providence\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "35",
    "NoteID": "3979",
    "Body": "Literally, eat (akala). Cf. vii. 19, n. 1004 and v. 69,\\n\\t\\t\\t\\tn. 776. The same wide meaning of profit, satisfaction,\\n\\t\\t\\t\\tand enjoyment may be attached to the word \"eat\" in verse\\n\\t\\t\\t\\t33 above."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "35",
    "NoteID": "3980",
    "Body": "Man may till the soil and sow the seed, but the\\n\\t\\t\\t\\tproductive forces of nature were not made by man's hands.\\n\\t\\t\\t\\tThey are the handiwork and artistry of Allah, and are\\n\\t\\t\\t\\tevidence of Allah's providence for His creatures. See n.\\n\\t\\t\\t\\t3978 above."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "36",
    "NoteID": "3981",
    "Body": "The mystery of sex runs through all creation,-in man, in\\n\\t\\t\\t\\tanimal life, in vegetable life, and possibly in other\\n\\t\\t\\t\\tthings of which we have no knowledge. Then there are\\n\\t\\t\\t\\tpairs of opposite forces in nature, e.g., positive and\\n\\t\\t\\t\\tnegative electricity, etc. The atom itself consists of a\\n\\t\\t\\t\\tpositively charged nucleus or proton, surrounded by\\n\\t\\t\\t\\tnegatively charged electrons. The constitution of matter\\n\\t\\t\\t\\titself is thus referred to pairs of opposite energies."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "37",
    "NoteID": "3982",
    "Body": "\"Withdrawing the Day from the Night\" is a striking phrase\\n\\t\\t\\t\\tand very apt. The Day or the Light is the positive thing.\\n\\t\\t\\t\\tThe Night or Darkness is merely negative. We cannot\\n\\t\\t\\t\\twithdraw the negative. But if we withdraw the real thing,\\n\\t\\t\\t\\tthe positive, which filled the void, nothing is left but\\n\\t\\t\\t\\tthe void. The whole of this section deals with Signs or\\n\\t\\t\\t\\tSymbols,-things in the physical world around us, from\\n\\t\\t\\t\\twhich we can learn the deepest spiritual truths if we\\n\\t\\t\\t\\tearnestly apply ourselves to them."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "38",
    "NoteID": "3983",
    "Body": "Mustaqarr may mean: (1) a limit of time, a period\\n\\t\\t\\t\\tdetermined, as in vi. 67, or (2) a place of rest or\\n\\t\\t\\t\\tquiescence; or (3) a dwelling place, as in ii. 36. I\\n\\t\\t\\t\\tthink the first meaning is best applicable here; but some\\n\\t\\t\\t\\tCommentators take the second meaning. In that case the\\n\\t\\t\\t\\tsimile would be that of the sun running a race while he\\n\\t\\t\\t\\tis visible to us, and taking a rest during the night to\\n\\t\\t\\t\\tprepare himself to renew his race the following day. His\\n\\t\\t\\t\\tstay with the antipodes appears to us as his period of\\n\\t\\t\\t\\trest."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "39",
    "NoteID": "3984",
    "Body": "The lunar stations are the 28 divisons of the Zodiac,\\n\\t\\t\\t\\twhich are supposed to mark the daily course of the moon\\n\\t\\t\\t\\tin the heavens from the time of the new moon to the time\\n\\t\\t\\t\\twhen the moon fades away in her \"inter-lunar swoon\", an\\n\\t\\t\\t\\texpressive phrase coined by the poet Shelley."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "39",
    "NoteID": "3985",
    "Body": "'Urjun: a raceme of dates or of a date-palm; or the base\\n\\t\\t\\t\\tor lower part of the raceme. When it becomes old, it\\n\\t\\t\\t\\tbecomes yellow, dry, and withered, and curves up like a\\n\\t\\t\\t\\tsickle. Hence the comparison with the sickle-like\\n\\t\\t\\t\\tappearance of the new moon. The moon runs through all her\\n\\t\\t\\t\\tphases, increasing and decreasing, until she disappears,\\n\\t\\t\\t\\tand then reappears as a little thin curve."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "40",
    "NoteID": "3986",
    "Body": "Though the sun and the moon both traverse the belt of the\\n\\t\\t\\t\\tZodiac, and their motions are different, they never catch\\n\\t\\t\\t\\tup each other. When the sun and the moon are on the same\\n\\t\\t\\t\\tside and on a line with the earth there is a solar\\n\\t\\t\\t\\teclipse, and when on opposite side in a line, there is a\\n\\t\\t\\t\\tlunar eclipse, but there is no clash. Their Laws are\\n\\t\\t\\t\\tfixed by Allah, and form the subject of study in\\n\\t\\t\\t\\tastronomy. Similarly Night and Day follow each other, but\\n\\t\\t\\t\\tbeing opposites cannot coincide, a fit emblem of the\\n\\t\\t\\t\\topposition of Good and Evil, Truth and Falsehood: see\\n\\t\\t\\t\\talso n. 3982 above."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "40",
    "NoteID": "3987",
    "Body": "Cf. xxi. 33, and n. 2695. How beautifully the rounded\\n\\t\\t\\t\\tcourses of the planets and heavenly bodies are described,\\n\\t\\t\\t\\t\"swimming\" through space, with perfectly smooth motion!\\n\\t\\t\\t\\tAs Shakespeare expresses it, each \"in his motion like an\\n\\t\\t\\t\\tangel sings, Still quiring to the young-eyed cherubims!\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "41",
    "NoteID": "3988",
    "Body": "Besides the beauty of the Night, with the stars and the\\n\\t\\t\\t\\tplanets \"swimming\" in their rounded courses according to\\n\\t\\t\\t\\tperfect Law, suggesting both symmetry and harmony, there\\n\\t\\t\\t\\tare other Signs touching closely the life of man himself,\\n\\t\\t\\t\\tprojected through Time, in the past history of his race\\n\\t\\t\\t\\tand in his own personal experience. The past history of\\n\\t\\t\\t\\this race takes us to the story of the Flood, which is\\n\\t\\t\\t\\tsymbolical of Allah's justice and mercy. Noah's Ark was a\\n\\t\\t\\t\\t\"Sign to all People\": xxix. 15. Man's own personal\\n\\t\\t\\t\\texperience is appealed to in every ship afloat: see next\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "42",
    "NoteID": "3989",
    "Body": "The stately ships sailing through the seas, heavier than\\n\\t\\t\\t\\tair, yet carrying man and his goods safely and smoothly\\n\\t\\t\\t\\tacross the waters, are another Sign for man. Ships are\\n\\t\\t\\t\\tnot mentioned, but (vessels) like the Ark: they would\\n\\t\\t\\t\\tcover all kinds of sea-craft, but also the modern\\n\\t\\t\\t\\taircraft, which \"swims\" through air instead of through\\n\\t\\t\\t\\twater."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "43",
    "NoteID": "3990",
    "Body": "Were it not that Allah gives man the intelligence and\\n\\t\\t\\t\\tingenuity to construct and manage sea-craft and\\n\\t\\t\\t\\tair-craft, the natural laws of gravity would lead to the\\n\\t\\t\\t\\tdestruction of any who attempted to pass through sea or\\n\\t\\t\\t\\tair. It is the gift (mercy) of Allah that saves him."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "44",
    "NoteID": "3991",
    "Body": "Cf. xvi. 80. Allah has given man all these wonderful\\n\\t\\t\\t\\tthings in nature and utilities produced by the skill and\\n\\t\\t\\t\\tintelligence which Allah has given to man. Had it not\\n\\t\\t\\t\\tbeen for these gifts, man's life would have been\\n\\t\\t\\t\\tprecarious on sea or land or in the air. It is only\\n\\t\\t\\t\\tAllah's Mercy that saves man from destruction for man's\\n\\t\\t\\t\\town follies, and that saving or the enjoyment of these\\n\\t\\t\\t\\tutilities and conveniences he should not consider as\\n\\t\\t\\t\\teternal: they are only given for a time, in this life of\\n\\t\\t\\t\\tprobation."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "45",
    "NoteID": "3992",
    "Body": "Man should consider and beware of the consequences of his\\n\\t\\t\\t\\tpast, and guard against the consequences in his future.\\n\\t\\t\\t\\tThe present is only a fleeting moment poised between the\\n\\t\\t\\t\\tpast and the future, and gone even while it is being\\n\\t\\t\\t\\tmentioned or thought about. Man should review his whole\\n\\t\\t\\t\\tlife and prepare for the Hereafter. If he does so, Allah\\n\\t\\t\\t\\tis Merciful: He will forgive, and give strength for a\\n\\t\\t\\t\\tbetter and higher life in the future. But this kind of\\n\\t\\t\\t\\tteaching does not suit those steeped in this ephemeral\\n\\t\\t\\t\\tlife. They are bored, and turn away from it, to their own\\n\\t\\t\\t\\tloss."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "46",
    "NoteID": "3993",
    "Body": "The Signs of Allah are many, in His great world,-in\\n\\t\\t\\t\\tnature, in the heart of man, and in the Revelation sent\\n\\t\\t\\t\\tthrough His messengers. They turn away from all of them,\\n\\t\\t\\t\\tas a man who has ruined his eyesight turns away from the\\n\\t\\t\\t\\tlight."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "47",
    "NoteID": "3994",
    "Body": "To selfish men, the good may make an appeal, and say:\\n\\t\\t\\t\\t\"Look! Allah has given you wealth, or influence, or\\n\\t\\t\\t\\tknowledge, or talent. Why not spend some of it in\\n\\t\\t\\t\\tcharity, i.e., for the good of your fellow-creatures?\"\\n\\t\\t\\t\\tBut the selfish only think of themselves and laugh such\\n\\t\\t\\t\\tteaching to scorn."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "47",
    "NoteID": "3995",
    "Body": "They are too full of themselves to have a corner in their\\n\\t\\t\\t\\thearts for others. \"If\" they say, \"Allah gave them\\n\\t\\t\\t\\tnothing, why should we?\" There is arrogance in this as\\n\\t\\t\\t\\twell as blasphemy: arrogance in thinking that they are\\n\\t\\t\\t\\tfavoured because of their merits, and blasphemy in laying\\n\\t\\t\\t\\tthe blame of other people's misfortunes on Allah. They\\n\\t\\t\\t\\tfurther try to turn the tables on the Believers by\\n\\t\\t\\t\\tpretending that the Believers are entirely on a wrong\\n\\t\\t\\t\\ttrack. They forget that all men are on probation and\\n\\t\\t\\t\\ttrial: they hold their gifts on trust: those apparently\\n\\t\\t\\t\\tless favoured, in that they have fewer of this world's\\n\\t\\t\\t\\tgoods, may be really more fortunate, because they are\\n\\t\\t\\t\\tlearning patience, self-reliance, and the true value of\\n\\t\\t\\t\\tthings ephemeral which is apt to be very much exaggerated\\n\\t\\t\\t\\tin men's eyes."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "48",
    "NoteID": "3996",
    "Body": "In addition to the arrogance and blasphemy referred to in\\n\\t\\t\\t\\tthe last note, they not only refuse Faith, but they taunt\\n\\t\\t\\t\\tthe men of Faith as if the men of Faith were dealing in\\n\\t\\t\\t\\tfalsehood: \"If there is a Hereafter, tell us when it will\\n\\t\\t\\t\\tbe!\" The answer is: \"It will come sooner than you expect:\\n\\t\\t\\t\\tyou will yet be disputing about things of Faith and\\n\\t\\t\\t\\tneglecting your opportunities in Life, when the Hour will\\n\\t\\t\\t\\tsound, and you will have no time even to make your\\n\\t\\t\\t\\tdispositions in this life: you will be cut off from\\n\\t\\t\\t\\teveryone whom you thought to be near and dear to you, or\\n\\t\\t\\t\\table to help you!\""
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "51",
    "NoteID": "3997",
    "Body": "Traditionally, the angel who will sound the Trumpet is\\n\\t\\t\\t\\tIsrafil, but the name does not occur in the Qur-an. The\\n\\t\\t\\t\\tTrumpet is mentioned in many places: e.g., vi. 73;\\n\\t\\t\\t\\tlxxviii. 18, etc."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "52",
    "NoteID": "3998",
    "Body": "The dead will rise as in a stupor, and they will be\\n\\t\\t\\t\\tconfused in the new conditions! They will gradually\\n\\t\\t\\t\\tregain their memory and their personality. They will be\\n\\t\\t\\t\\treminded that Allah in His grace and mercy had already\\n\\t\\t\\t\\tannounced the Hereafter in their probationary lives, and\\n\\t\\t\\t\\tthe word of Allah's messengers, which then seemed so\\n\\t\\t\\t\\tstrange and remote, was true and was now being fulfilled!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "53",
    "NoteID": "3999",
    "Body": "Time and Space, as we know them here, will be no more.\\n\\t\\t\\t\\tThe whole gathering will be as in the twinkling of an\\n\\t\\t\\t\\teye. Cf. xxxvi. 49 above."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "54",
    "NoteID": "4000",
    "Body": "The Judgment will be on the highest standard of Justice\\n\\t\\t\\t\\tand Grace. Not the least merit will go unrewarded, though\\n\\t\\t\\t\\tthe reward will be for the righteous far more than their\\n\\t\\t\\t\\tdeserts. No penalty will be exacted but that which the\\n\\t\\t\\t\\tdoer himself by his past deeds brought on himself. Cf.\\n\\t\\t\\t\\txxviii. 84."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "55",
    "NoteID": "4001",
    "Body": "Notice the subtle gradation in the description. First, in\\n\\t\\t\\t\\tthis verse, we have the nature of the mise en scene and\\n\\t\\t\\t\\tthe nature of the joy therein. It will be a Garden i.e.,\\n\\t\\t\\t\\teverything agreeable to see and hear and feel and taste\\n\\t\\t\\t\\tand smell; delightfully green lawns and meadows, trees\\n\\t\\t\\t\\tand shrubs; the murmur of streams and the songs of birds:\\n\\t\\t\\t\\tthe delicate texture of flowers and leaves and the shapes\\n\\t\\t\\t\\tof beauty in clouds and mist; the flavours of fruits; and\\n\\t\\t\\t\\tthe perfumes of flowers and scents. The joy in the Garden\\n\\t\\t\\t\\twill be an active joy, without fatigue: whatever we do in\\n\\t\\t\\t\\tit, every employment in which we engage there, will be a\\n\\t\\t\\t\\tsource of joy without alloy."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "56",
    "NoteID": "4002",
    "Body": "Secondly, the joy or happiness is figured to be, not\\n\\t\\t\\t\\tsolitary, but shared by associates."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "57",
    "NoteID": "4003",
    "Body": "Thirdly, besides any external conditions of Bliss, the\\n\\t\\t\\t\\tBliss in the Hereafter has an inner quality."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "58",
    "NoteID": "4004",
    "Body": "Fourthly, we reach the highest grade of bliss, the\\n\\t\\t\\t\\tsalutation \"Peace!\" from Allah Most Merciful. Cf. x. 10.\\n\\t\\t\\t\\tThat Word sums up the attainment of the final Goal. For\\n\\t\\t\\t\\tit explains the nature of the Most High;-He is not only a\\n\\t\\t\\t\\tLord and Cherisher, but a Lord Whose supreme glory is\\n\\t\\t\\t\\tMercy, Peace, and Harmony!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "59",
    "NoteID": "4005",
    "Body": "Notice how this finely balanced passage, after reaching\\n\\t\\t\\t\\tthe summit of sublimity in describing the state of the\\n\\t\\t\\t\\tBlessed, in the word Salam, gradually takes us down to\\n\\t\\t\\t\\tcontemplate the state of the Sinners in a graduated\\n\\t\\t\\t\\tdescent. In the first place, it refers to their negative\\n\\t\\t\\t\\tstate, their state of isolation. From this Day of\\n\\t\\t\\t\\tJudgment, they will no longer have the chance of being\\n\\t\\t\\t\\twith the Blessed and perhaps of profiting spiritually by\\n\\t\\t\\t\\tthat proximity. The first feature of the Day of Judgment\\n\\t\\t\\t\\tis that it is a Day of Separation-of sorting out. Each\\n\\t\\t\\t\\tsoul now finds its own true level, as the period of\\n\\t\\t\\t\\tprobation is over."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "60",
    "NoteID": "4006",
    "Body": "Secondly, there is a gentle reproach to the wrong-doers,\\n\\t\\t\\t\\tmore in sorrow than in anger. They are addressed as\\n\\t\\t\\t\\t\"children of Adam\", to emphasise two facts, (1) that they\\n\\t\\t\\t\\thave disgraced their ancestry, for Adam after his Fall\\n\\t\\t\\t\\trepented and was forgiven, and the high Destiny of\\n\\t\\t\\t\\tmankind has been the prize open to all his descendants,\\n\\t\\t\\t\\tand (2) that Allah Most Merciful has throughout the ages\\n\\t\\t\\t\\tcontinued to warn mankind against the snares laid by\\n\\t\\t\\t\\tSatan, the avowed enemy of man, and that Allah's Grace\\n\\t\\t\\t\\twas ever on the watch to help all to freedom from those\\n\\t\\t\\t\\tsnares."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "61",
    "NoteID": "4007",
    "Body": "Thirdly, besides the negative warning, a positive Way was\\n\\t\\t\\t\\tshown to them-the Straight Way, the Way of those who\\n\\t\\t\\t\\treceive Allah's Grace and attain to Bliss, the Rope which\\n\\t\\t\\t\\twould save them from shipwreck, the Shield which would\\n\\t\\t\\t\\tsave them from assault, the key to the door of proximity\\n\\t\\t\\t\\tto Allah."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "62",
    "NoteID": "4008",
    "Body": "Fourthly, it is pointed out that they were given\\n\\t\\t\\t\\tUnderstanding ('aql), so that by their own faculties they\\n\\t\\t\\t\\tcould have judged their own best interests, and yet they\\n\\t\\t\\t\\tbetrayed or misused those faculties, and deliberately\\n\\t\\t\\t\\tthrew away their chance! And not only a few, but so many!\\n\\t\\t\\t\\tThey went gregariously to ruin in spite of the individual\\n\\t\\t\\t\\tcare which their Lord and Cherisher bestowed on them!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "63",
    "NoteID": "4009",
    "Body": "Fifthly, the naked fact is now placed before them,-the\\n\\t\\t\\t\\tHell,-the state of damnation, which they could so easily\\n\\t\\t\\t\\thave avoided!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "64",
    "NoteID": "4010",
    "Body": "As they deliberately and persistently rejected all\\n\\t\\t\\t\\tteaching, guidance, and warnings, they are now told to\\n\\t\\t\\t\\texperience the Fire of Punishment, for it is but the\\n\\t\\t\\t\\tconsequence of their own acts."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "65",
    "NoteID": "4011",
    "Body": "The ungodly will now be dumbfounded. They will be unable\\n\\t\\t\\t\\tto speak or offer any defence. (The consequences of all\\n\\t\\t\\t\\tacts, which follow according to Allah's Law, are, in\\n\\t\\t\\t\\tQuranic language, attributed to Allah). But their silence\\n\\t\\t\\t\\twill not matter. Their own hands and feet will speak\\n\\t\\t\\t\\tagainst them. \"Hands and feet\" in this connection are\\n\\t\\t\\t\\tsymbolical of all the instruments for action which they\\n\\t\\t\\t\\twere given in this life. The same extended meaning is to\\n\\t\\t\\t\\tbe understood for \"eyes\" in the following verse. Cf. also\\n\\t\\t\\t\\txli. 20- 21, where eyes, ears, and skins are all\\n\\t\\t\\t\\tmentioned as bearing witness against such as misused\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "66",
    "NoteID": "4012",
    "Body": "\"If it had been Our Will\": i.e., if such had been the\\n\\t\\t\\t\\tWill and Plan of Allah. If Allah had not intended to give\\n\\t\\t\\t\\tman his limited free-will, or power of choice, the case\\n\\t\\t\\t\\twould have been different: there would have been no moral\\n\\t\\t\\t\\tresponsibility which could have been enforced. They could\\n\\t\\t\\t\\thave had no sight or intelligence, and they could not\\n\\t\\t\\t\\thave been blamed for not seeing or understanding. But\\n\\t\\t\\t\\tsuch is not the case."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "67",
    "NoteID": "4013",
    "Body": "If Allah's Plan had been to grant no limited freedom of\\n\\t\\t\\t\\tchoice or will to men, He could have created them quite\\n\\t\\t\\t\\tdifferent, or could have transformed them into stationary\\n\\t\\t\\t\\tcreatures, either in physical form as in the case of\\n\\t\\t\\t\\ttrees, or in moral or spiritual qualities, where there\\n\\t\\t\\t\\twas no possibility either of progress or deterioration.\\n\\t\\t\\t\\tMan would then have been unable to reach the heights of\\n\\t\\t\\t\\tgrandeur which are now open to him, or, if he goes wrong,\\n\\t\\t\\t\\tto return through the door of repentance and mercy, and\\n\\t\\t\\t\\tstill pursue his path of ascent. But it was Allah's Plan\\n\\t\\t\\t\\tto give man all these privileges, and man must shoulder\\n\\t\\t\\t\\tall the responsibilities that go with them."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "68",
    "NoteID": "4014",
    "Body": "This connects on with the last verse. Everything is\\n\\t\\t\\t\\tpossible with Allah. If you doubt how man can be\\n\\t\\t\\t\\ttransformed from his present nature, contemplate the\\n\\t\\t\\t\\ttransformations he already undergoes in his present\\n\\t\\t\\t\\tnature at different ages. As a child powers of mind and\\n\\t\\t\\t\\tbody are still undeveloped. As he grows, they grow, and\\n\\t\\t\\t\\tcertain moral qualities, such as courage, daring, the\\n\\t\\t\\t\\twill to conquer, unfold themselves. In extreme old age\\n\\t\\t\\t\\tthese are again obscured, and a second childhood\\n\\t\\t\\t\\tsupervenes. The back of the man who walked proudly\\n\\t\\t\\t\\tstraight and erect is now bent. If these transformations\\n\\t\\t\\t\\ttake place even in his present nature and constitution,\\n\\t\\t\\t\\thow much easier was it for Allah to cast him in an\\n\\t\\t\\t\\timmobile mould? But Allah granted him instead the high\\n\\t\\t\\t\\tpossibilities and responsibilities referred to in the\\n\\t\\t\\t\\tlast note."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "69",
    "NoteID": "4015",
    "Body": "Cf. xxvi. 224 and n. 3237. Here \"Poetry\" is used as\\n\\t\\t\\t\\tconnoting fairy tales, imaginary descriptions, things\\n\\t\\t\\t\\tfutile, false, or obscure, such as decadent Poetry is,\\n\\t\\t\\t\\twhereas the Qur-an is a practical guide, true and clear."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "70",
    "NoteID": "4016",
    "Body": "\"Alive\", both in English and Arabic, means not only\\n\\t\\t\\t\\t\"having physical fife\", but having all the active\\n\\t\\t\\t\\tqualities which we associate with life. In religious\\n\\t\\t\\t\\tlanguage, those who are not responsive to the realities\\n\\t\\t\\t\\tof the spiritual world are no better than those who are\\n\\t\\t\\t\\tdead. The Message of Allah penetrates the hearts of those\\n\\t\\t\\t\\twho are alive in the spiritual sense."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "70",
    "NoteID": "4017",
    "Body": "Cf. xxviii. 63. If people reject Truth and Faith after\\n\\t\\t\\t\\tthey have been admonished and warned, the charge against\\n\\t\\t\\t\\tthem, of wilful rebellion, is proved. They cannot then\\n\\t\\t\\t\\tplead either ignorance or inadvertence."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "71",
    "NoteID": "4018",
    "Body": "If they are blind to other Signs of Allah, they can at\\n\\t\\t\\t\\tleast see the simple homely things of life in which they\\n\\t\\t\\t\\treceive so many benefits from Allah's mercy. How is it\\n\\t\\t\\t\\tthat wild animals can be domesticated, and in\\n\\t\\t\\t\\tdomestication can be so useful to man? Man can use them\\n\\t\\t\\t\\tfor riding or for drought; he can use their flesh for\\n\\t\\t\\t\\tfood and drink their milk; he can use their hair or wool.\\n\\t\\t\\t\\tCf. xvi. 66, 80: and xxiii. 21-22."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "73",
    "NoteID": "4019",
    "Body": "Such as skins for leather, furs for warmth, sheep's wool\\n\\t\\t\\t\\tor camel's hair for blankets or textiles, musk for\\n\\t\\t\\t\\tperfume, and so on."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "73",
    "NoteID": "4020",
    "Body": "The whole argument turns on this. 'Our teaching is for\\n\\t\\t\\t\\tyour own benefit. We confer all these blessings on you,\\n\\t\\t\\t\\tand yet ye turn away from the Giver of all, and run after\\n\\t\\t\\t\\tyour own vain imaginations!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "75",
    "NoteID": "4021",
    "Body": "There is some difference of opinion among Commentators as\\n\\t\\t\\t\\tto the exact meaning to be attached to this clause. As I\\n\\t\\t\\t\\tunderstand it, the meaning seems to be this. Man is apt\\n\\t\\t\\t\\tto forget or turn away from the true God, the source of\\n\\t\\t\\t\\tall the good which he enjoys, and to go after imaginary\\n\\t\\t\\t\\tpowers in the shape of gods, heroes, men, or abstract\\n\\t\\t\\t\\tthings like Science or Nature or Philosophy, or\\n\\t\\t\\t\\tsuperstitious things like Magic, or Good-Fortune or\\n\\t\\t\\t\\tIll-Fortune, or embodiments of his own selfish desires.\\n\\t\\t\\t\\tHe thinks that they might help him in this Life or in the\\n\\t\\t\\t\\tHereafter (if he believes in a Hereafter). But they\\n\\t\\t\\t\\tcannot help him: on the contrary all things that are\\n\\t\\t\\t\\tfalse will be brought up and condemned before Allah's\\n\\t\\t\\t\\tJudgment-seat, and the worshippers of the Falsehoods will\\n\\t\\t\\t\\talso be treated as a troop favouring the Falsehoods and\\n\\t\\t\\t\\ttherefore worthy of condemnation. The Falsehoods,\\n\\t\\t\\t\\ttherefore, instead of helping them, will contribute to\\n\\t\\t\\t\\ttheir condemnation."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "76",
    "NoteID": "4022",
    "Body": "If men are so foolish as to reject Allah, let not the men\\n\\t\\t\\t\\tof Allah grieve over it. They should do their duty, and\\n\\t\\t\\t\\tleave the rest to Allah. Allah knows all the open and\\n\\t\\t\\t\\tsecret motives that sway the wicked, and His Plan must\\n\\t\\t\\t\\tultimately prevail, however much appearances may be\\n\\t\\t\\t\\tagainst it at any given time."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "77",
    "NoteID": "4023",
    "Body": "Man's disobedience and folly are all the more surprising,\\n\\t\\t\\t\\tseeing that-apart from Allah's greatness and mercy-man is\\n\\t\\t\\t\\thimself such a puny creature, created out of something\\n\\t\\t\\t\\tthat is less than a drop in the vast ocean of Existence.\\n\\t\\t\\t\\tYet man has the hardihood to stand out and dispute with\\n\\t\\t\\t\\this Maker, and institute idle comparisons as in the next\\n\\t\\t\\t\\tverse!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "78",
    "NoteID": "4024",
    "Body": "That is, man thinks that Allah is like His creatures, who\\n\\t\\t\\t\\tat best have very limited powers, or man draws idle\\n\\t\\t\\t\\tparallels like that mentioned at the end of this verse.\\n\\t\\t\\t\\t'Who can give life to dry bones, and decomposed ones at\\n\\t\\t\\t\\tthat?' Man certainly cannot, and no power in nature can\\n\\t\\t\\t\\tdo that. But why compare the powers and capacities of\\n\\t\\t\\t\\tAllah's creatures with the powers and capacities of the\\n\\t\\t\\t\\tCreator? The first creation-out of nothing-is far more\\n\\t\\t\\t\\tdifficult for us to imagine than a second or subsequent\\n\\t\\t\\t\\tprocess for which there is already a basis. And Allah has\\n\\t\\t\\t\\tpower over all things."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "79",
    "NoteID": "4025",
    "Body": "Allah's creative artistry is evident in every phase of\\n\\t\\t\\t\\tnature, and it works every minute or second. The more man\\n\\t\\t\\t\\tunderstands himself and the things within his reach, the\\n\\t\\t\\t\\tmore he realises this. How foolish, then, for any one to\\n\\t\\t\\t\\tset imaginary limits to Allah's powers? There are more\\n\\t\\t\\t\\tways of creation than are dreamt of in man's imagination!"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "80",
    "NoteID": "4026",
    "Body": "Even older and more primitive than the method of striking\\n\\t\\t\\t\\tfire against steel and flint is the method of using twigs\\n\\t\\t\\t\\tof trees for the purpose. In the E.B., 14th edition. ix.\\n\\t\\t\\t\\t262, will be found a picture of British Guiana boys\\n\\t\\t\\t\\tmaking a fire by rotating a stick in a round hole in a\\n\\t\\t\\t\\tpiece of wood lying on the ground. The Arab method was to\\n\\t\\t\\t\\tuse a wooden instrument called the Zinad. It consisted of\\n\\t\\t\\t\\ttwo pieces to be rubbed together. The upper one was\\n\\t\\t\\t\\tcalled the 'Afar or Zand, and the lower the Markh. The\\n\\t\\t\\t\\tmarkh is a twig from a kind of spreading tree, the\\n\\t\\t\\t\\tCynanchuin viminale, of which the branches are bare,\\n\\t\\t\\t\\twithout leaves or thorns. When they are tangled together,\\n\\t\\t\\t\\tand a wind blows, they get ignited and strike fire\\n\\t\\t\\t\\t(Lane's Arabic Lexicon). In modern Arabic Zand is by\\n\\t\\t\\t\\tanalogy applied to the flint pierce used for striking\\n\\t\\t\\t\\tfire with steel."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "81",
    "NoteID": "4027",
    "Body": "Cf. lxxix. 27. Which is the more difficult to\\n\\t\\t\\t\\tcreate,-man, or the heavens and the earth, with all\\n\\t\\t\\t\\tcreatures? Allah created the heavens and the earth, with\\n\\t\\t\\t\\tall creatures, and He can create worlds and worlds like\\n\\t\\t\\t\\tthese in infinity. To Him it is small matter to raise you\\n\\t\\t\\t\\tup for the Hereafter."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "82",
    "NoteID": "4028",
    "Body": "And His creation is not dependent on time, or instruments\\n\\t\\t\\t\\tor means, or any conditions whatsoever. Existence waits\\n\\t\\t\\t\\ton His Will, or Plan, or Intention. The moment He wills a\\n\\t\\t\\t\\tthing, it becomes His Word or Command, and the thing\\n\\t\\t\\t\\tforthwith comes into existence. Cf. ii. 117; xvi. 40, n.\\n\\t\\t\\t\\t2066; etc."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "83",
    "NoteID": "4029",
    "Body": "All things were created by Allah; are maintained by Him;\\n\\t\\t\\t\\tand will go back to Him. But the point of special\\n\\t\\t\\t\\tinterest to man is that man will also be brought back to\\n\\t\\t\\t\\tAllah and is answerable to Him, and to Him alone. This\\n\\t\\t\\t\\tMessage is the core of Revelation; it explains the\\n\\t\\t\\t\\tmeaning of the Hereafter; and it fitly closes a Sura\\n\\t\\t\\t\\tspecially connected with the name (Ya-Sin) of the Holy\\n\\t\\t\\t\\tProphet."
  }
]
