[
  {
    "SurahNumber": "8",
    "AyahNumber": "1",
    "NoteID": "1178",
    "Body": "The occasion was the question of the division of the\\n\\t\\t\\t\\tbooty after the battle of Badr. See Introduction to this\\n\\t\\t\\t\\tSura."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "1",
    "NoteID": "1179",
    "Body": "Booty taken in a lawful and just war. It belongs to the\\n\\t\\t\\t\\tCause, in this case the Cause of Allah, as administered\\n\\t\\t\\t\\tby His Messenger. The chief thing is to remain staunch to\\n\\t\\t\\t\\tthe Cause of Allah, and have no differences among those\\n\\t\\t\\t\\twho stand for the Cause. Our internal relations must be\\n\\t\\t\\t\\tkept straight: they must not be disturbed by cupidity or\\n\\t\\t\\t\\tworldly considerations of gain, for any windfalls of this\\n\\t\\t\\t\\tkind should be outside our calculations."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "3",
    "NoteID": "1180",
    "Body": "Sustenance: The object is to warn off from the love of\\n\\t\\t\\t\\tbooty. To all true Believers Allah gives generous\\n\\t\\t\\t\\tsustenance in any case."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "5",
    "NoteID": "1181",
    "Body": "Just as: the comparison takes us back to the first clause\\n\\t\\t\\t\\tin verse 4: \"such in truth are the Believers\"-just as thy\\n\\t\\t\\t\\tLord also is just and true in ordering thee out to fight\\n\\t\\t\\t\\tagainst heavy odds, when the alternative was to fight\\n\\t\\t\\t\\tagainst the unarmed caravan which would have given thee\\n\\t\\t\\t\\tabundant booty almost without a fight. To appreciate the\\n\\t\\t\\t\\tfull meaning, remember that the word haqq, translated\\n\\t\\t\\t\\t\"truth\" means also \"right,\" \"just\", \"what is becoming.\"\\n\\t\\t\\t\\tThe true Believers believe in truth and do right in\\n\\t\\t\\t\\tobedience to Allah's command. So Allah also, in asking\\n\\t\\t\\t\\tthem to fight against odds, is not asking them to rush to\\n\\t\\t\\t\\tdestruction, but is providing them with an opportunity of\\n\\t\\t\\t\\tvindicating the truth in scorn of worldly advantage. And\\n\\t\\t\\t\\tHe made good His promise by giving them victory."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "6",
    "NoteID": "1182",
    "Body": "In verse 6 we have again the word \"truth\": some of the\\n\\t\\t\\t\\tBelievers disputed concerning \"the truth\": they did not\\n\\t\\t\\t\\tfeel sure that the course recommended was the right\\n\\t\\t\\t\\tcourse. They thought it would be certain destruction:\\n\\t\\t\\t\\tthey saw death almost staring them in the face."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "7",
    "NoteID": "1183",
    "Body": "Just before Badr there were two alternatives before the\\n\\t\\t\\t\\tMuslims in Madinah to save themselves from being\\n\\t\\t\\t\\toverwhelmed by the Makkan Quraish with all their\\n\\t\\t\\t\\tresources from the rich Syrian trade. One, which had\\n\\t\\t\\t\\tleast danger for the time being, and also promised much\\n\\t\\t\\t\\tbooty, was to fall upon the Quraish caravan returning\\n\\t\\t\\t\\tfrom Syria to Makkah richly laden, and led by Aba Sufyan\\n\\t\\t\\t\\twith only 40 men unarmed. From a wordly point of view\\n\\t\\t\\t\\tthis was the safest and most lucrative course. The other\\n\\t\\t\\t\\talternative, was to leave the booty out boldly against\\n\\t\\t\\t\\tthe well-armed and well-equipped Quraish army of 1,000\\n\\t\\t\\t\\tmen coming from Makkah. The Muslims had no more than 300\\n\\t\\t\\t\\tmen, ill-armed, to oppose this force. But if they could\\n\\t\\t\\t\\tdefeat it, it would shake the selfish autocracy which was\\n\\t\\t\\t\\tin possession of Makkah. By Allah's help they won a\\n\\t\\t\\t\\tsplendid victory, and the standard of Truth was\\n\\t\\t\\t\\testablished, never to be lowered again."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "9",
    "NoteID": "1184",
    "Body": "Cf. iii. 123, 125, 126. The number of angels, a thousand\\n\\t\\t\\t\\tat Badr and three thousand and five thousand at Uhud, is\\n\\t\\t\\t\\tequal to the strength of the enemy."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "10",
    "NoteID": "1185",
    "Body": "All help comes ultimately from Allah. In special cases it\\n\\t\\t\\t\\tmay take special forms to put heart into us, and to fit\\n\\t\\t\\t\\tin with our feelings and our psychology."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "11",
    "NoteID": "1186",
    "Body": "Cf. iii. 154 for Uhud. Calm (presence of mind) is\\n\\t\\t\\t\\tessential in battle and in 'ill posts of danger. If the\\n\\t\\t\\t\\tmind is too much in a state of excitement, it cannot\\n\\t\\t\\t\\tcarry out a well-considered or well-concerted plan. This\\n\\t\\t\\t\\tspirit of calm confidence on the part of the Muslims won\\n\\t\\t\\t\\tagainst the blustering violence of the Quraish."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "11",
    "NoteID": "1187",
    "Body": "The rain was welcome for many reasons. (1) Water was\\n\\t\\t\\t\\tscarce both for drinking and ablutions; (2) the muslim\\n\\t\\t\\t\\tband, without baggage or equipment or comforts, found\\n\\t\\t\\t\\tthat their thirst aggravated their fatigue; (3) the sand\\n\\t\\t\\t\\twas loose, and the rain consolidated it and enabled them\\n\\t\\t\\t\\t\"to plant their feet firmly.\""
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "11",
    "NoteID": "1188",
    "Body": "\"Stain of Satan\". Dirt is physically a symbol of evil,\\n\\t\\t\\t\\tand the Muslims were particular about ablutions before\\n\\t\\t\\t\\tprayer. But the rain also refreshed their spirits and\\n\\t\\t\\t\\tremoved any lurking doubts in their minds (suggestions of\\n\\t\\t\\t\\tthe Evil) that victory might be impossible in such\\n\\t\\t\\t\\tadverse circumstances."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "12",
    "NoteID": "1189",
    "Body": "The vulnerable parts of an armed man are above the neck.\\n\\t\\t\\t\\tA blow on the neck, face or head, finishes him off. If he\\n\\t\\t\\t\\thas armour it is difficult to get at his heart. But if\\n\\t\\t\\t\\this hands are put out of action, he is unable to wield\\n\\t\\t\\t\\this sword or lance or other weapon, and easily becomes a\\n\\t\\t\\t\\tprisoner."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "15",
    "NoteID": "1190",
    "Body": "The laws of Jihad are exactly similar to those enforced\\n\\t\\t\\t\\tby military virtue and discipline. Meet your enemy fairly\\n\\t\\t\\t\\tand squarely, not rashly, but after due preparation.\\n\\t\\t\\t\\tZahfan in the text (meeting in hostile array) implies a\\n\\t\\t\\t\\tslow and well-planned proceeding towards a hostile army.\\n\\t\\t\\t\\tWhen once in combat, carry it through: there is no room\\n\\t\\t\\t\\tfor second thoughts. Death or victory should be the motto\\n\\t\\t\\t\\tof every soldier: it may be death for himself\\n\\t\\t\\t\\tindividually, but if he has faith, there is triumph in\\n\\t\\t\\t\\teither case for his cause. Two exceptions are recognised:\\n\\t\\t\\t\\t(1) reculer pour mieux sauter, to go back in order to\\n\\t\\t\\t\\tjump forward; or to deceive the enemy by a feint; (2) if\\n\\t\\t\\t\\tan individual or body is, by the chances of battle,\\n\\t\\t\\t\\tisolated from his own force, he can fall back on his\\n\\t\\t\\t\\tforce in order to fight the battle. There is no virtue in\\n\\t\\t\\t\\tmere single-handedness. Each individual must use his life\\n\\t\\t\\t\\tand his resources to the best advantage for the common\\n\\t\\t\\t\\tcause."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "17",
    "NoteID": "1191",
    "Body": "When the battle began, the Holy Prophet prayed, and threw\\n\\t\\t\\t\\ta handful of dust or sand at the enemy, which, as\\n\\t\\t\\t\\tdescribed in traditions, struck the eyes of the enemy.\\n\\t\\t\\t\\tThis had a great psychological effect,"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "17",
    "NoteID": "1192",
    "Body": "Numerically the odds against the Muslims were three to\\n\\t\\t\\t\\tone. In other ways they were at a disadvantage: of arms\\n\\t\\t\\t\\tand equipment they had but little, while the enemy were\\n\\t\\t\\t\\twell-found: they were inexperienced, while the Quraish\\n\\t\\t\\t\\thad brought their foremost warriors. In all this there\\n\\t\\t\\t\\twas a test, but the test was accompanied by gracious\\n\\t\\t\\t\\tfavours of countless value: their Commander was one in\\n\\t\\t\\t\\twhom they had perfect faith, and for whom they were ready\\n\\t\\t\\t\\tto lay down their lives; the rain refreshed them; their\\n\\t\\t\\t\\tspirit was unshaken; and they were fighting in Allah's\\n\\t\\t\\t\\tcause. Thus the trial or test became itself a blessing."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "19",
    "NoteID": "1193",
    "Body": "Fath = victory, decision, judgment. The Quraish in Makkah\\n\\t\\t\\t\\thad prayed for victory: they were confident that their\\n\\t\\t\\t\\tsuperior numbers, equipment, and experience would be\\n\\t\\t\\t\\tdecisive. With a play on the word, they are told that the\\n\\t\\t\\t\\tdecision had come, and the victory-but not in the sense\\n\\t\\t\\t\\tthey had hoped for!"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "21",
    "NoteID": "1194",
    "Body": "Cf. ii. 93."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "22",
    "NoteID": "1195",
    "Body": "Cf. ii. 18."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "24",
    "NoteID": "1196",
    "Body": "There are two points to note. (1) Note that after Allah\\n\\t\\t\\t\\tand His Messenger are mentioned, the pronoun and verb in\\n\\t\\t\\t\\tthe next clause are singular: everything that Allah's\\n\\t\\t\\t\\tMessenger put forward as an injunction came by\\n\\t\\t\\t\\tinspiration from Allah: the Messenger made his will\\n\\t\\t\\t\\tcoincide completely with Allah's will. (2) We are asked\\n\\t\\t\\t\\tactively to give our response in deed and life to the\\n\\t\\t\\t\\tcall of duty and conscience, for that call leads to real\\n\\t\\t\\t\\tlife, the life eternal, even though it may apparently\\n\\t\\t\\t\\tmean in this world the loss of things that make life dear\\n\\t\\t\\t\\tor the loss of life itself. If we refer this to Jihad,\\n\\t\\t\\t\\ti.e., fighting in and for the Cause, both literally and\\n\\t\\t\\t\\tmetaphorically, the meaning becomes quite clear."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "24",
    "NoteID": "1197",
    "Body": "If the human heart is refractory and refuses to obey the\\n\\t\\t\\t\\tcall of Allah, that is not the end of the matter. Allah\\n\\t\\t\\t\\thas to be reckoned with. The refusal may be because there\\n\\t\\t\\t\\twas some pet human scheme which the heart of man was not\\n\\t\\t\\t\\twilling to give up for Allah's Cause. Will that scheme\\n\\t\\t\\t\\tcome to fruition by refusing to serve the higher Cause?\\n\\t\\t\\t\\tBy no means. Man proposes, but God disposes. If the\\n\\t\\t\\t\\tscheme or motive was perfectly secret from men, it was\\n\\t\\t\\t\\tnot secret from Allah. The heart is the innermost seat of\\n\\t\\t\\t\\tman's affections and desires: but Allah intervenes\\n\\t\\t\\t\\tbetween man and his heart."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "25",
    "NoteID": "1198",
    "Body": "Fitna has many meanings: (1) the root meaning is trial or\\n\\t\\t\\t\\ttemptation, as in ii. 102 and viii. 28; (2) an analogous\\n\\t\\t\\t\\tmeaning is trial or punishment, as in v. 71; (3) tumult\\n\\t\\t\\t\\tor oppression, as in ii. 193, and here: and in viii. 39\\n\\t\\t\\t\\t(4) there is here (viii. 25) the further shade of meaning\\n\\t\\t\\t\\tsuggested, discord, sedition, civil war. This warning\\n\\t\\t\\t\\tagainst internal discord or tumult was very necessary in\\n\\t\\t\\t\\tthe Civil Wars of early Islam, and was never more\\n\\t\\t\\t\\tnecessary than it is now. For it affects innocent and\\n\\t\\t\\t\\tguilty alike."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "26",
    "NoteID": "1199",
    "Body": "On the immediate occasion the Muslims were reminded that\\n\\t\\t\\t\\tthey were a small band in Makkah despised and rejected;\\n\\t\\t\\t\\tliving in a state of insecurity for their persons, their\\n\\t\\t\\t\\tlives, their property, and those of their dependents,\\n\\t\\t\\t\\tpersecuted and exiled and how by the grace of Allah they\\n\\t\\t\\t\\tfound a safe asylum in Madinah how they found friends and\\n\\t\\t\\t\\thelpers, how their many needs were cared for, and how at\\n\\t\\t\\t\\tlength they gathered strength and numbers enough to\\n\\t\\t\\t\\tdefeat the forces of godlessness, injustice, and\\n\\t\\t\\t\\toppression."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "27",
    "NoteID": "1200",
    "Body": "Trusts may be of various kinds: (1) property, goods,\\n\\t\\t\\t\\tcredit, etc.; (2) plans, confidences, secrets, etc.; (3)\\n\\t\\t\\t\\tknowledge, talents, opportunities, etc., which we are\\n\\t\\t\\t\\texpected to use for our fellowmen. Men may betray the\\n\\t\\t\\t\\ttrust of Allah and His Prophet by misusing property, or\\n\\t\\t\\t\\tabusing the confidence reposed in them, or the knowledge\\n\\t\\t\\t\\tor talents given to them. On that special occasion, when\\n\\t\\t\\t\\tthe plans for the protection of Allah's worshippers\\n\\t\\t\\t\\tagainst annihilation were of special importance, the\\n\\t\\t\\t\\tProphet's trust and confidence had to be guarded with\\n\\t\\t\\t\\tspecial care. Occasions for scrupulously respecting the\\n\\t\\t\\t\\ttrust and confidence of our fellow-men occur every day in\\n\\t\\t\\t\\tour life, and few of us can claim perfection in this\\n\\t\\t\\t\\trespect. Hence the special distinction of the Prophet of\\n\\t\\t\\t\\tAllah, who earned the title of Al-Amin, the one who was\\n\\t\\t\\t\\ttrue to every trust reposed in him."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "28",
    "NoteID": "1201",
    "Body": "A big family-many sons-was considered a source of power\\n\\t\\t\\t\\tand strength: iii. 10, 116. So in English, a man with\\n\\t\\t\\t\\tmany children is said to have his \"quiver full\": Cf.\\n\\t\\t\\t\\tPsalms, cxxvii. 4-5: \"As arrows are in the hands of a\\n\\t\\t\\t\\tmighty man, so are the children of thy youth. Happy is\\n\\t\\t\\t\\tthe man that hath his quiver full of them; they shall not\\n\\t\\t\\t\\tbe ashamed, but they shall speak with the enemies in the\\n\\t\\t\\t\\tgate.\" So with property and possessions: they add to a\\n\\t\\t\\t\\tman's dignity, power, and influence. But both possessions\\n\\t\\t\\t\\tand a large family are a temptation and a trial. They may\\n\\t\\t\\t\\tturn out to be a source of spiritual downfall, if they\\n\\t\\t\\t\\tare mishandled, or if the love of them excludes the love\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "29",
    "NoteID": "1202",
    "Body": "Cf. ii. 53 and ii. 185. The battle of Badr is called the\\n\\t\\t\\t\\tFurqan in Muslim theology, because it was the first trial\\n\\t\\t\\t\\tof strength by battle, in Islam, between the powers of\\n\\t\\t\\t\\tgood and evil. Evil was defeated, and those who had real\\n\\t\\t\\t\\tfaith were tested and sorted out from those who had not\\n\\t\\t\\t\\tfaith enough to follow the banner of Faith. See also\\n\\t\\t\\t\\tviii. 41 and n. 1210."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "30",
    "NoteID": "1203",
    "Body": "The plots against Al-Mustafa in Makkah aimed at three\\n\\t\\t\\t\\tthings. They were not only foiled, but Allah's wonderful\\n\\t\\t\\t\\tworking turned the tables, and brought good out of evil\\n\\t\\t\\t\\tin each case. (1) They tried to hold the Prophet in\\n\\t\\t\\t\\tsubjection in Makkah by putting pressure on his uncles,\\n\\t\\t\\t\\trelatives, and friends. But the more they persecuted, the\\n\\t\\t\\t\\tmore the little Muslim community grew in faith and\\n\\t\\t\\t\\tnumbers. (2) They tried to injure or slay him. But the\\n\\t\\t\\t\\twonderful example of his humility, perseverance, and\\n\\t\\t\\t\\tfearlessness furthered the cause of Islam. (3) They tried\\n\\t\\t\\t\\tto get him and his followers out of their homes. But they\\n\\t\\t\\t\\tfound a new home in Madinah from which they eventually\\n\\t\\t\\t\\treconquered not only Makkah but Arabia and the world.  A)\\n\\t\\t\\t\\tCf. iii. 54."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "31",
    "NoteID": "1204",
    "Body": "Cf. vi. 25."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "32",
    "NoteID": "1205",
    "Body": "This was actually a challenge thrown out by the Infidels\\n\\t\\t\\t\\tin Makkah not seriously but as a taunt. The answer is in\\n\\t\\t\\t\\tthe two following verses. Allah punishes in His own good\\n\\t\\t\\t\\ttime, not according to the foolish and frivolous taunts\\n\\t\\t\\t\\tof the Unbelievers. While the Holy Prophet was with them,\\n\\t\\t\\t\\the-the Mercy of the Worlds-conferred a certain amount of\\n\\t\\t\\t\\timmunity to them. There were also other Muslims, just men\\n\\t\\t\\t\\twho asked for forgiveness. And Allah keeps the door of\\n\\t\\t\\t\\trepentance and forgiveness open to all as long as they\\n\\t\\t\\t\\tmake it possible. But let them not be puffed up with\\n\\t\\t\\t\\tpride, or think that they have lasting immunity. What\\n\\t\\t\\t\\tbecame of Abu Jahl? He and some of his greatest warriors\\n\\t\\t\\t\\twere slain at Badr. The little autocratic clique that\\n\\t\\t\\t\\tprevented Muslims from access to the Sacred Mosque had\\n\\t\\t\\t\\ttheir punishment not long afterwards. They pretended to\\n\\t\\t\\t\\tbe its guardians. But were they? Could they be? Only the\\n\\t\\t\\t\\trighteous could be true guardians to Allah's places of\\n\\t\\t\\t\\tworship, and particularly to the Central House of the\\n\\t\\t\\t\\tKa'ba. It was to be a place of pure worship, while their\\n\\t\\t\\t\\tidolatrous worship was mere mummery,- whistling and\\n\\t\\t\\t\\tclapping of hands. All false worship advertises itself by\\n\\t\\t\\t\\tnoise and unseemly riot: it is said that the Pagans used\\n\\t\\t\\t\\tto go naked round the Ka'ba."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "37",
    "NoteID": "1206",
    "Body": "It is only when matters are brought to an issue that evil\\n\\t\\t\\t\\tis separated distinctly from the good. Then evil consorts\\n\\t\\t\\t\\twith evil, and good with good. The evil will be piled\\n\\t\\t\\t\\tinto a heap. When the cup is full, the punishment will\\n\\t\\t\\t\\tcome. There will be no mistake about it. The good should\\n\\t\\t\\t\\tnot be discouraged, because in fighting against them, all\\n\\t\\t\\t\\tforces of evil join together and pool their resources\\n\\t\\t\\t\\ttogether. The more they do so, the easier is the final\\n\\t\\t\\t\\tarbitrament. It is all in Allah's Plan."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "39",
    "NoteID": "1207",
    "Body": "Cf. ii. 193 and n."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "39",
    "NoteID": "1208",
    "Body": "If they cease from fighting and from the persecution of\\n\\t\\t\\t\\ttruth, Allah judges then by their actions and their\\n\\t\\t\\t\\tmotives, and would not wish that they should be harassed\\n\\t\\t\\t\\twith further hostility. But if they refuse all terms, the\\n\\t\\t\\t\\trighteous have nothing to fear: Allah will help and\\n\\t\\t\\t\\tprotect them."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "41",
    "NoteID": "1209",
    "Body": "The rule is that a fifth share is set apart for the Imam\\n\\t\\t\\t\\t(the Commander) and the rest is divided among the forces.\\n\\t\\t\\t\\tThe fifth share reserved is expressed to be for Allah and\\n\\t\\t\\t\\tthe Prophet, and for charitable purposes for those to\\n\\t\\t\\t\\twhom charity is due. Ultimately everything is at the\\n\\t\\t\\t\\tdisposal of Allah and His Prophet: viii. 1: but\\n\\t\\t\\t\\tfour-fifths are divided, and only one-fifth is retained\\n\\t\\t\\t\\tfor the special purposes. The Imam has discretion as to\\n\\t\\t\\t\\tthe mode of division. In the Prophet's life-time a\\n\\t\\t\\t\\tcertain portion was assigned to him and his near\\n\\t\\t\\t\\trelatives."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "41",
    "NoteID": "1210",
    "Body": "Testing: Furqan: Criterion between right and wrong,\\n\\t\\t\\t\\tdecision between the forces of faith and unbelief. The\\n\\t\\t\\t\\tbattle of Badr is called by this name. See viii. 29 and\\n\\t\\t\\t\\tn. 1202."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "41",
    "NoteID": "1211",
    "Body": "Allah's power is shown in the events detailed in the\\n\\t\\t\\t\\tthree verses following (vv. 42-44), leading to the\\n\\t\\t\\t\\tcomplete victory of the Muslims over the pagan Quraish."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "42",
    "NoteID": "1212",
    "Body": "The little Islamic force from Madinah went out to meet\\n\\t\\t\\t\\tthe big Makkan army, and they met on the two sides of a\\n\\t\\t\\t\\tvalley at Badr, while the Quraish caravan was on lower\\n\\t\\t\\t\\tground towards the sea, about 3 miles from Badr."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "42",
    "NoteID": "1213",
    "Body": "They were all at cross purposes. The caravan was making\\n\\t\\t\\t\\tfor Makkah, but scarcely thought it could get there. The\\n\\t\\t\\t\\tQuraish force was trying to save the caravan and then\\n\\t\\t\\t\\tannihilate the Muslims. The Muslims had decided to attack\\n\\t\\t\\t\\tthe Quraish army from Makkah which turned out to be big,\\n\\t\\t\\t\\tmore than three times their number. Yet the two forces\\n\\t\\t\\t\\tmet, precisely at the spot and at the time when a\\n\\t\\t\\t\\tdecisive battle should take place and the Muslims dispose\\n\\t\\t\\t\\tof the pretensions of the Makkans. If they had carefully\\n\\t\\t\\t\\tplanned a mutual appointment, they could not have carried\\n\\t\\t\\t\\tit out more precisely. On the Muslim side the few martyrs\\n\\t\\t\\t\\tknew that the victory was theirs and those who survived\\n\\t\\t\\t\\tthe battle enjoyed the fruits of the victory. On the\\n\\t\\t\\t\\tpagan side, both those who died and those who lived knew\\n\\t\\t\\t\\tfully the issue joined. Even psychologically both sides\\n\\t\\t\\t\\twent in with full determination to decide the issue."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "44",
    "NoteID": "1214",
    "Body": "The Muslim army though they knew their worldly\\n\\t\\t\\t\\tdisadvantage, did not realise the full odds against them.\\n\\t\\t\\t\\tThe Makkans came exulting in any case, and they despised\\n\\t\\t\\t\\tthe contemptible little force, opposed to them. Even\\n\\t\\t\\t\\tthough they thought the Muslim force was twice as great\\n\\t\\t\\t\\tas it was (iii. 13), still that number was contemptible,\\n\\t\\t\\t\\twhen taken with its poor equipment. Both these\\n\\t\\t\\t\\tpsychological visions subserved the main Plan, which was\\n\\t\\t\\t\\tto bring the matter to a decisive issue, whether the\\n\\t\\t\\t\\tPagans of Makkah were to continue their arrogant\\n\\t\\t\\t\\toppression, or the religion of Allah was to be\\n\\t\\t\\t\\testablished in freedom and honour."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "46",
    "NoteID": "1215",
    "Body": "A fine description of the Muslim virtues which make for\\n\\t\\t\\t\\tsuccess and whose loss brings about humiliation and\\n\\t\\t\\t\\tfailure. \"Power\": literally, \"wind\",-the favourable wind\\n\\t\\t\\t\\tfor a sailing ship."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "47",
    "NoteID": "1216",
    "Body": "A true description of the Makkan army which met its doom."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "48",
    "NoteID": "1217",
    "Body": "It is the way with the leaders of evil, when they find\\n\\t\\t\\t\\ttheir cause lost, that they wash their hands of their\\n\\t\\t\\t\\tfollowers and leave them in the lurch. They see more\\n\\t\\t\\t\\tclearly than their dupes. They are not simpletons: they\\n\\t\\t\\t\\tknow the consequences of the wrath of Allah. Satan's\\n\\t\\t\\t\\t\"fear\" of Allah is terror combined with hatred,-the very\\n\\t\\t\\t\\topposite of the feeling which is described in Taqwa viz.,\\n\\t\\t\\t\\tthe desire to avoid doing anything against Allah's will,\\n\\t\\t\\t\\tsuch desire being founded on trust in Allah and the love\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "49",
    "NoteID": "1218",
    "Body": "Cf. ii. 10 \"disease in the heart.\" Trust in Allah brings\\n\\t\\t\\t\\tits own reward: our eyes are opened, and we see how\\n\\t\\t\\t\\tgreat, good, and wise is the Cherisher of the Worlds.\\n\\t\\t\\t\\tOthers may sneer and despise. But the blessing of Allah\\n\\t\\t\\t\\tkeeps our minds fresh and our hearts contented."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "50",
    "NoteID": "1219",
    "Body": "In contrast to the taunt against those who trust in\\n\\t\\t\\t\\tAllah, \"that their religion has misled them,\" is shown\\n\\t\\t\\t\\tthe terrible punishment, after death, of those who\\n\\t\\t\\t\\tlaughed at Faith."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "51",
    "NoteID": "1220",
    "Body": "The punishment is shown to be due to their own deeds of\\n\\t\\t\\t\\twrong, because Allah is never unjust to the least of His\\n\\t\\t\\t\\tservants."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "53",
    "NoteID": "1221",
    "Body": "Allah bestows His grace freely, but He never withdraws it\\n\\t\\t\\t\\tarbitrarily. Before He changes their state and\\n\\t\\t\\t\\tcircumstances, an actual state of rebellion and contumacy\\n\\t\\t\\t\\thas arisen in their own souls, which brings about its\\n\\t\\t\\t\\tinevitable punishment."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "54",
    "NoteID": "1222",
    "Body": "Note that in verse 51, the words were that they rejected\\n\\t\\t\\t\\tthe Signs of Allah and were punished: here the words are\\n\\t\\t\\t\\tthat they treated the Signs as false and were\\n\\t\\t\\t\\tdestroyed:-a higher degree of guilt deserved a severer\\n\\t\\t\\t\\tpunishment."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "55",
    "NoteID": "1223",
    "Body": "In viii. 22 we were warned against \"the worst of beasts\\n\\t\\t\\t\\tin the sight of Allah\", who do not make use of their\\n\\t\\t\\t\\tfaculties of hearing, speaking and understanding, in the\\n\\t\\t\\t\\tservice of Allah, and in fact misuse their faculties to\\n\\t\\t\\t\\tblaspheme Allah. The same brute creatures are shone here\\n\\t\\t\\t\\tin another light: they are faithless both to Allah and\\n\\t\\t\\t\\tman."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "56",
    "NoteID": "1224",
    "Body": "The immediate occasion was the repeated treachery of the\\n\\t\\t\\t\\tBanu Quraiza after their treaties with the Muslims. But\\n\\t\\t\\t\\tthe general lesson remains, as noted in the two following\\n\\t\\t\\t\\tverses. Treachery in war is doubly wrong, for it\\n\\t\\t\\t\\tendangers so many lives. Such treachery should be\\n\\t\\t\\t\\tpunished in such a way that it gets no chance again. Not\\n\\t\\t\\t\\tonly the actual perpetrators but those who follow their\\n\\t\\t\\t\\tstandard should be rendered powerless. And the broken\\n\\t\\t\\t\\ttreaty should be denounced so that the innocent party can\\n\\t\\t\\t\\tat least fight on equal terms. From actual physical\\n\\t\\t\\t\\twarfare we can carry the same lesson to spiritual\\n\\t\\t\\t\\twarfare. A truce or understanding is possible with those\\n\\t\\t\\t\\twho respect definite principles, not with those who have\\n\\t\\t\\t\\tno principles and are merely out for oppression and\\n\\t\\t\\t\\twickedness. A) The purpose of the verse is to urge\\n\\t\\t\\t\\tMuslims to act against their enemies described above with\\n\\t\\t\\t\\ta severity and resoluteness which would serve as a\\n\\t\\t\\t\\tdeterrent to other enemies of Islam who might be inclined\\n\\t\\t\\t\\tto follow their example and act treacherously towards\\n\\t\\t\\t\\tMuslims."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "60",
    "NoteID": "1225",
    "Body": "The immediate occasion of this injunction was the\\n\\t\\t\\t\\tweakness of cavalary and appointments of war in the early\\n\\t\\t\\t\\tfights of Islam. But the general meaning follows. In\\n\\t\\t\\t\\tevery fight, physical, moral, or spiritual, arm yourself\\n\\t\\t\\t\\twith the best weapons and the best arms against your\\n\\t\\t\\t\\tenemy, so as to instil wholesome respect into him for you\\n\\t\\t\\t\\tand the Cause you stand for."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "60",
    "NoteID": "1226",
    "Body": "There are always lurking enemies whom you may not know,\\n\\t\\t\\t\\tbut whom Allah knows. It is your duty to be ready against\\n\\t\\t\\t\\tall, for the sacred Cause under whose banner you are\\n\\t\\t\\t\\tfighting."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "60",
    "NoteID": "1227",
    "Body": "Be always ready and put all your resources into your\\n\\t\\t\\t\\tCause. You do not do so in vain. Allah's reward will come\\n\\t\\t\\t\\tin various forms. He knows all, and His reward will\\n\\t\\t\\t\\talways be more generous than you can possibly think of."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "61",
    "NoteID": "1228",
    "Body": "While we must always be ready for the good fight lest it\\n\\t\\t\\t\\tbe forced on us, even in the midst of the fight we must\\n\\t\\t\\t\\talways be ready for peace if there is any inclination\\n\\t\\t\\t\\ttowards peace on the other side. There is no merit merely\\n\\t\\t\\t\\tin a fight by itself. It should be a joyful duty not for\\n\\t\\t\\t\\titself, but to establish the reign of peace and\\n\\t\\t\\t\\trighteousness and Allah's Law."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "62",
    "NoteID": "1229",
    "Body": "In working for peace there may be a certain risk of\\n\\t\\t\\t\\ttreachery on the other side. We must take that risk:\\n\\t\\t\\t\\tbecause the men of Faith have Allah's aid to count upon\\n\\t\\t\\t\\tand the strength of the united body of the righteous."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "63",
    "NoteID": "1230",
    "Body": "On the immediate occasion, the greatest miracle and most\\n\\t\\t\\t\\twonderful working of Allah's grace was the union of\\n\\t\\t\\t\\thearts produced among the jarring, war-like, excitable\\n\\t\\t\\t\\tclements of Arabia under the gentle, firm, and wise\\n\\t\\t\\t\\tguidance of Muhammad, the Messenger of Allah. At all\\n\\t\\t\\t\\ttimes we must pray to Allah for this gift above\\n\\t\\t\\t\\tall,-union, understanding, and pure and sincere affection\\n\\t\\t\\t\\tamong those who take Allah's name. With it there is\\n\\t\\t\\t\\tstrength and success. Without it there is humiliation,\\n\\t\\t\\t\\tslavery, and moral degradation. There may be many causes\\n\\t\\t\\t\\tof difference and dispute. The reconciliation can only\\n\\t\\t\\t\\tcome from the glory and wisdom of Allah."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "64",
    "NoteID": "1231",
    "Body": "The Believers: mere lip-profession of belief, or even the\\n\\t\\t\\t\\tkind of belief that does not result in action, is not\\n\\t\\t\\t\\tenough. To those whose belief is so sincere that it\\n\\t\\t\\t\\tresults in complete trust in Allah and in fearless action\\n\\t\\t\\t\\tin His service, the consequences on this earth do not\\n\\t\\t\\t\\tmatter. Allah's good pleasure is enough for them."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "65",
    "NoteID": "1232",
    "Body": "In a fight, odds of ten to one against any one are\\n\\t\\t\\t\\tappalling. But they do not daunt the men of faith.\\n\\t\\t\\t\\tWhether they personally win or die, their Cause prevails.\\n\\t\\t\\t\\tThey are sure to win: because (1) they have divine aid,\\n\\t\\t\\t\\tand (2) even humanly speaking, those who take up arms\\n\\t\\t\\t\\tagainst truth and righteousness are fools, and their\\n\\t\\t\\t\\tseeming power is but a broken reed."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "66",
    "NoteID": "1233",
    "Body": "Given equal conditions, Muslims on account of their faith\\n\\t\\t\\t\\tcould win against odds of ten to one. But where their\\n\\t\\t\\t\\torganization and equipment are weak, as was the case\\n\\t\\t\\t\\tabout the time of Badr, they were set a lighter task, and\\n\\t\\t\\t\\tasked to tackle no more than odds of two to one against\\n\\t\\t\\t\\tthem. As a matter of fact at Badr they won through\\n\\t\\t\\t\\tagainst odds of more than three to one."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "67",
    "NoteID": "1234",
    "Body": "An ordinary war may be for territory or trade, revenge or\\n\\t\\t\\t\\tmilitary glory,-all \"temporal goods of this world.\" Such\\n\\t\\t\\t\\ta war is condemned. But a Jihad is fought under strict\\n\\t\\t\\t\\tconditions laid down by Islam, and solely for the cause\\n\\t\\t\\t\\tof Allah. All baser motives, therefore are strictly\\n\\t\\t\\t\\texcluded. The gain in the shape of ransom from captives\\n\\t\\t\\t\\thas no place in such warfare. At the same time, if there\\n\\t\\t\\t\\thas been heavy loss of life already, captives may be\\n\\t\\t\\t\\ttaken, and it would be for the Imam to exercise his\\n\\t\\t\\t\\tdiscretion as to the time when it was safe to release\\n\\t\\t\\t\\tthem, and whether the release should be free or on parole\\n\\t\\t\\t\\tor on a fine by way of punishment. Destruction and\\n\\t\\t\\t\\tslaughter, however repugnant to a gentle soul like that\\n\\t\\t\\t\\tof Muhammad, were inevitable where evil tried to suppress\\n\\t\\t\\t\\tthe good. Even Jesus, whose mission was more limited, had\\n\\t\\t\\t\\tto say: \"Think not that I am come to send peace on earth:\\n\\t\\t\\t\\tI came not to send peace but a sword.\" (Matt. x. 34).\\n\\t\\t\\t\\tSeventy captives were taken at Badr, and it was decided\\n\\t\\t\\t\\tto take ransom for them. While the general principle of\\n\\t\\t\\t\\tfighting for the purpose of taking captives in order to\\n\\t\\t\\t\\tget their ransom is condemned, the particular action in\\n\\t\\t\\t\\tthis case was approved in vv. 68-71."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "68",
    "NoteID": "1235",
    "Body": "Though any motive of worldly gain, which may have been in\\n\\t\\t\\t\\tthe minds of some among the victorious Muslim army, is\\n\\t\\t\\t\\tcondemned as worthy of a severe penalty, what actually\\n\\t\\t\\t\\thappened is ascribed to the Plan of Allah, which was\\n\\t\\t\\t\\tpreordained. Among the prisoners taken were the Prophet's\\n\\t\\t\\t\\tuncle 'Abbas and Hadhrat 'Ali's brother, Aqil, who\\n\\t\\t\\t\\tafterwards became Muslims. 'Abbas was an ancestor of the\\n\\t\\t\\t\\tfounder of the celebrated 'Abbasi Dynasty which played\\n\\t\\t\\t\\tsuch a notable part in Islamic history. In his case the\\n\\t\\t\\t\\tpromise made in verse 70 was amply fulfilled. In the case\\n\\t\\t\\t\\tof all prisoners, if there was any good in their hearts,\\n\\t\\t\\t\\ttheir very fight against Islam and their capture led to\\n\\t\\t\\t\\ttheir being blessed with Islam. Thus does Allah's Plan\\n\\t\\t\\t\\twork in a marvellous way, and evolve good out of seeming\\n\\t\\t\\t\\tevil."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "69",
    "NoteID": "1236",
    "Body": "Enjoy: literally, eat. See vii. 19. n. 1004, and v. 66,\\n\\t\\t\\t\\tn. 776."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "70",
    "NoteID": "1237",
    "Body": "This is a consolation to the prisoners of war. In spite\\n\\t\\t\\t\\tof their previous hostility, Allah will forgive them in\\n\\t\\t\\t\\tHis mercy if there was any good in their hearts, and\\n\\t\\t\\t\\tconfer upon them a far higher gift than anything they\\n\\t\\t\\t\\thave ever lost. This gift in its highest sense would be\\n\\t\\t\\t\\tthe blessing of Islam, but even in a material sense,\\n\\t\\t\\t\\tthere was great good fortune awaiting them. Note how\\n\\t\\t\\t\\tcomprehensive is Allah's care. He encourages and\\n\\t\\t\\t\\tstrengthens the Muslims, at the same time condemning any\\n\\t\\t\\t\\tbaser motives that may have entered their minds, He\\n\\t\\t\\t\\tconsoles the prisoners of war and promises them better\\n\\t\\t\\t\\tthings if there is any good in them at all. And He offers\\n\\t\\t\\t\\tcomfort to those who have left their homes in His Cause,\\n\\t\\t\\t\\tand knits them into closer fellowship with those who have\\n\\t\\t\\t\\thelped them and sympathised with them."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "71",
    "NoteID": "1238",
    "Body": "If the kindness shown to them is abused by the prisoners\\n\\t\\t\\t\\tof war when they are released, it is not a matter for\\n\\t\\t\\t\\tdiscouragement to those who showed the kindness. Such\\n\\t\\t\\t\\tpersons have in their treachery shown already their\\n\\t\\t\\t\\ttreason to Allah, in that they took up arms against\\n\\t\\t\\t\\tAllah's Prophet, and sought to blot out the pure worship\\n\\t\\t\\t\\tof Allah. The punishment of defeat, which opened the eyes\\n\\t\\t\\t\\tof some of their comrades, evidently did not open their\\n\\t\\t\\t\\teyes. But Allah knows all, and in His wisdom will order\\n\\t\\t\\t\\tall things for the best. The Believers have done their\\n\\t\\t\\t\\tduty in showing such clemency as they could in the\\n\\t\\t\\t\\tcircumstances of war. For them \"Allah sufficeth\" (viii.\\n\\t\\t\\t\\t62)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "72",
    "NoteID": "1239",
    "Body": "The reference is to the Muhajirin and the Ansar, the\\n\\t\\t\\t\\tEmigrants and the Helpers, the people who forsook their\\n\\t\\t\\t\\thomes and adopted voluntary exile from Makkah in company\\n\\t\\t\\t\\twith their beloved Leader, and their good friends in\\n\\t\\t\\t\\tMadinah, who gave them asylum and every kind of\\n\\t\\t\\t\\tassistance, moral and material. Under the magnetic\\n\\t\\t\\t\\tpersonality of the Holy Prophet these two groups became\\n\\t\\t\\t\\tlike blood-brothers, and they were so treated in matters\\n\\t\\t\\t\\tof inheritance during the period when they were cut off\\n\\t\\t\\t\\tfrom their kith and kin."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "72",
    "NoteID": "1240",
    "Body": "The Believers (Muslims) were entitied to all assistance\\n\\t\\t\\t\\tin matters of religion. But if they were not strong\\n\\t\\t\\t\\tenough to suffer voluntary exile on behalf of the Cause\\n\\t\\t\\t\\tand make the personal sacrifices which their more ardent\\n\\t\\t\\t\\tbrethren in faith made, they could not reasonably ask for\\n\\t\\t\\t\\tpolitical or military assistance or protection."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "72",
    "NoteID": "1241",
    "Body": "If a community suffers voluntary exile on account of\\n\\t\\t\\t\\tpersecution and oppression, and some of its weaker\\n\\t\\t\\t\\tbrethren stay behind, holding fast to faith but not\\n\\t\\t\\t\\tprepared for the higher sacrifice, the exiles have still\\n\\t\\t\\t\\ta duty to help their weaker brethren in matters of\\n\\t\\t\\t\\treligion. The exiles, being at open war against the State\\n\\t\\t\\t\\twhich oppressed them, would be free to fight against such\\n\\t\\t\\t\\tState. But if the weaker brethren are in a State in\\n\\t\\t\\t\\tmutual alliance with the Community, the Community cannot\\n\\t\\t\\t\\tin honour interfere with that State, whether it is Muslim\\n\\t\\t\\t\\tor not. Presumably the alliance implies that the\\n\\t\\t\\t\\tgrievances of the weaker brethren will be redressed by\\n\\t\\t\\t\\tthe State itself. But it is not honourable to embarrass\\n\\t\\t\\t\\tyour own ally."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "73",
    "NoteID": "1242",
    "Body": "Evil consorts with evil. The good have all the more\\n\\t\\t\\t\\treason for drawing together and not only living in mutual\\n\\t\\t\\t\\tharmony, but being ready at all times to protect each\\n\\t\\t\\t\\tother. Otherwise the world will be given over to\\n\\t\\t\\t\\taggressions by unscrupulous people, and the good will\\n\\t\\t\\t\\tfail in their duty to establish Allah's Peace and to\\n\\t\\t\\t\\tstrengthen all the forces of truth and righteousness."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "74",
    "NoteID": "1243",
    "Body": "Believers who make all sacrifices in the Cause of Allah\\n\\t\\t\\t\\thave given the best possible proof of their Faith by\\n\\t\\t\\t\\ttheir actions. They have loved Allah much, and much will\\n\\t\\t\\t\\tbe forgiven them. What they sacrificed was, perhaps,\\n\\t\\t\\t\\tjudged by universal standards, of small value, but its\\n\\t\\t\\t\\tvalue will be estimated by the precious love behind it,\\n\\t\\t\\t\\tand its reward will be of no ordinary kind. It will not\\n\\t\\t\\t\\tbe a reward in the ordinary sense at all, for a reward is\\n\\t\\t\\t\\tgiven once for all. It will be a provision which last for\\n\\t\\t\\t\\tever, and is on the most generous scale."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "75",
    "NoteID": "1244",
    "Body": "Those who come into the fold last are none the less\\n\\t\\t\\t\\tbrethren in the fullest acceptation of the term. But any\\n\\t\\t\\t\\tspecial provisions made in the special circumstances of\\n\\t\\t\\t\\tthe first martyrs for the Cause will not of course apply\\n\\t\\t\\t\\tto them as the special circumstances which made them\\n\\t\\t\\t\\tnecessary have ceased to exist. See next note."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "75",
    "NoteID": "1245",
    "Body": "The Book of Allah,- i.e., the Eternal Decree, the\\n\\t\\t\\t\\tPreserved Tablet (lxxxv. 22). Blood-relationship and its\\n\\t\\t\\t\\trights and duties do not depend on special circumstances\\n\\t\\t\\t\\tof a temporary nature. Any temporary rights of mutual\\n\\t\\t\\t\\tinheritance established between the early Emigrants and\\n\\t\\t\\t\\tHelpers (n. 1239) would not apply after the revelation of\\n\\t\\t\\t\\tthis verse any more."
  }
]
