[
  {
    "SurahNumber": "37",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Regarding the adjurative particle wa and my rendering it\\n\\t\\t\\t\\tas \"Consider\", see first half of note [23] on  74:32 . -\\n\\t\\t\\t\\tMost of the classical commentators assume that verses\\n\\t\\t\\t\\t{1-3} refer to angels - an assumption which Abu Muslim\\n\\t\\t\\t\\tal-Isfahani (as quoted by Razi) rejects, stating that the\\n\\t\\t\\t\\tpassage refers to the true believers among human beings.\\n\\t\\t\\t\\tHowever, Razi advances yet another (and, to my mind, most\\n\\t\\t\\t\\tconvincing) interpretation, suggesting that what is meant\\n\\t\\t\\t\\there are the messages (ayat) of the Qur'an, which - in\\n\\t\\t\\t\\tthe commentator's words - \"deal with various subjects,\\n\\t\\t\\t\\tsome speaking of the evidence of God's oneness or of the\\n\\t\\t\\t\\tevidence of His omniscience, omnipotence and wisdom, and\\n\\t\\t\\t\\tsome setting forth the evidence of [the truth of]\\n\\t\\t\\t\\tprophetic revelation or of resurrection, while some deal\\n\\t\\t\\t\\twith man's duties and the laws [relating thereto], and\\n\\t\\t\\t\\tyet others are devoted to the teaching of high moral\\n\\t\\t\\t\\tprinciples; and these messages are arranged in accordance\\n\\t\\t\\t\\twith a coherent system above all [need of] change or\\n\\t\\t\\t\\talteration, so that they resemble beings or things\\n\\t\\t\\t\\tstanding 'in serried ranks'.\""
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "5",
    "NoteID": "2",
    "Body": "Sc., \"and of sunset\" (cf.  55:17  and the corresponding\\n\\t\\t\\t\\tnote [7]). The stress on the various \"points of sunrise\"\\n\\t\\t\\t\\t(al-mashariq) brings out the endless variety of all\\n\\t\\t\\t\\tcreated phenomena as contrasted with the oneness and\\n\\t\\t\\t\\tuniqueness of their Creator. The mention of \"the points\\n\\t\\t\\t\\tof sunrise\" and omission of \"the points of sunset\" in the\\n\\t\\t\\t\\twording (though not in the meaning) of the above phrase\\n\\t\\t\\t\\talludes, I believe, to the light-giving quality of the\\n\\t\\t\\t\\tQur'an spoken of in verses {1-3}."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "7",
    "NoteID": "3",
    "Body": "For an explanation of this passage, see note [16] on\\n\\t\\t\\t\\t 15:17 ."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "8",
    "NoteID": "4",
    "Body": "I.e., the angelic forces, whose \"speech\" is a metonym for\\n\\t\\t\\t\\tGod's decrees."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "10",
    "NoteID": "5",
    "Body": "Lit., \"excepting [or \"except that\"] anyone who ...\", etc.\\n\\t\\t\\t\\tHowever, as pointed out by some authorities (e.g.,\\n\\t\\t\\t\\tMughni), the particle illa is occasionally synonymous\\n\\t\\t\\t\\twith the simple conjunction wa, which in this case has\\n\\t\\t\\t\\tthe significance of \"but\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "10",
    "NoteID": "6",
    "Body": "For the meaning of this phrase, see note [17] on  15:18 .\\n\\t\\t\\t\\tAfter the stress on God's oneness in verses {4-5}, the\\n\\t\\t\\t\\tpassage comprising verses {6-10} points to the fact that\\n\\t\\t\\t\\thuman beings are precluded from really grasping the\\n\\t\\t\\t\\tvariety and depth of the universe created by Him. We have\\n\\t\\t\\t\\there an echo of  34:9  - \"Are they, then, not aware of\\n\\t\\t\\t\\thow little of the sky and the earth lies open before\\n\\t\\t\\t\\tthem, and how much is hidden from them?\" - and, thus, a\\n\\t\\t\\t\\tnew, oblique approach to the theme of resurrection, which\\n\\t\\t\\t\\tis taken up in the sequence in the form of an indirect\\n\\t\\t\\t\\tquestion."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "11",
    "NoteID": "7",
    "Body": "I.e., out of primitive substances existing in their\\n\\t\\t\\t\\telementary forms in and on the earth (see surah {23},\\n\\t\\t\\t\\tnote [4]) - substances which are as nothing when compared\\n\\t\\t\\t\\twith the complexity of \"the heavens and the earth and all\\n\\t\\t\\t\\tthat is between them\": hence, man's individual\\n\\t\\t\\t\\tresurrection is as nothing when compared with the\\n\\t\\t\\t\\tcreation of the multiform universe."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "12",
    "NoteID": "8",
    "Body": "I.e., at God's creative power as well as at the blind\\n\\t\\t\\t\\tarrogance of those who deny it."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "21",
    "NoteID": "9",
    "Body": "See note [6] on  77:13 ."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "22",
    "NoteID": "10",
    "Body": "According to almost all of the earliest authorities -\\n\\t\\t\\t\\tincluding 'Umar ibn al-Khattab, 'Abd Allah ibn Abbas,\\n\\t\\t\\t\\tQatadah, Mujahid, As Suddi, Said ibn Jubayr, Al-Hassan\\n\\t\\t\\t\\tal-Basri, etc., - the expression azwaj denotes here\\n\\t\\t\\t\\t\"people resembling one another [in their dispositions]\",\\n\\t\\t\\t\\tor \"people of the same kind\" or \"of the same ilk\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "27",
    "NoteID": "11",
    "Body": "Cf. the contrasting - though verbally identical - passage\\n\\t\\t\\t\\tin verses {50} ff. of the present surah. Whereas in the\\n\\t\\t\\t\\tlatter instance the verb yatasa'alun has its primary\\n\\t\\t\\t\\tconnotation of \"asking one another [about something]\", it\\n\\t\\t\\t\\tsignifies here \"demanding [something] of one another\" -\\n\\t\\t\\t\\tas the sequence shows, to assume responsibility for their\\n\\t\\t\\t\\terstwhile denial of the truth."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "28",
    "NoteID": "12",
    "Body": "I.e., \"claiming that what you were asking us to do was\\n\\t\\t\\t\\tright and good\". The idiomatic phrase \"approaching one\\n\\t\\t\\t\\tfrom the right\" is more or less synonymous with\\n\\t\\t\\t\\t\"pretending to give a morally good advice\", as well as\\n\\t\\t\\t\\t\"approaching another person from a position of power and\\n\\t\\t\\t\\tinfluence\" (Zamakhshari)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "32",
    "NoteID": "13",
    "Body": "For an explanation see {28:62-64} and the corresponding\\n\\t\\t\\t\\tnotes."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "36",
    "NoteID": "14",
    "Body": "Lit., \"for [or \"for the sake of\"] a mad poet\" - thus\\n\\t\\t\\t\\talluding to the allegation that the Qur'an is a product\\n\\t\\t\\t\\tof Muhammad's mind (see note [38] on  36:69 ). The\\n\\t\\t\\t\\treference to \"deities\" comprises, in this context,\\n\\t\\t\\t\\teverything that man may \"worship\" in both the literal and\\n\\t\\t\\t\\tthe metaphorical senses of this word."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "37",
    "NoteID": "15",
    "Body": "See surah {2}, note [5]. It is to be borne in mind that\\n\\t\\t\\t\\tthis refers to the fundamental teachings, which have\\n\\t\\t\\t\\talways been the same in every true religion, and not to\\n\\t\\t\\t\\tthe many time-bound laws evident in the earlier religious\\n\\t\\t\\t\\tcodes."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "40",
    "NoteID": "16",
    "Body": "Lit., \"sincere servants\". In contrast to the principle that \"a bad deed will be requited with no more than the like thereof\", implied in the preceding verse, the Qur'an states here that he who \"shall come [before God] with a good deed will receive ten times the like thereof\" (see 6:160)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "41",
    "NoteID": "17",
    "Body": "Lit., \"a known sustenance\". For a tentative explanation\\n\\t\\t\\t\\tof this phrase, see note [17] on  2:25 ."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "44",
    "NoteID": "18",
    "Body": "For my occasional rendering of the plural noun surur as\\n\\t\\t\\t\\t\"thrones of happiness\", see note [34] on  15:47 ."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "48",
    "NoteID": "19",
    "Body": "See note [46] on  38:52 , where the expression qasirat\\n\\t\\t\\t\\tat-tarf (lit., \"such as restrain their gaze\") appears for\\n\\t\\t\\t\\tthe first time in the chronology of Qur'anic revelation."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "49",
    "NoteID": "20",
    "Body": "This is an ancient Arabian figure of speech derived from\\n\\t\\t\\t\\tthe habit of the female ostrich, which buries its eggs in\\n\\t\\t\\t\\tthe sand for protection (Zamakhshari). Its particular\\n\\t\\t\\t\\tapplication to the women who attain to paradise becomes\\n\\t\\t\\t\\tclear from  56:34  ff., which states that all righteous\\n\\t\\t\\t\\twomen, irrespective of their age and condition at the\\n\\t\\t\\t\\ttime of death, will be resurrected as beautiful maidens."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "50",
    "NoteID": "21",
    "Body": "Cf. verse {27} above and the corresponding note [11].\\n\\t\\t\\t\\tLike the mutual reproaches of the sinners in that\\n\\t\\t\\t\\tpassage, the \"conversation\" of the blessed which follows\\n\\t\\t\\t\\there is, of course, allegorical, and is meant to stress\\n\\t\\t\\t\\tthe continuity of individual consciousness in the\\n\\t\\t\\t\\thereafter."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "62",
    "NoteID": "22",
    "Body": "According to the lexicographers, the noun zaqqum (which\\n\\t\\t\\t\\toccurs, apart from the present instance, in  44:43  and\\n\\t\\t\\t\\tin  56:52  as well) denotes any \"deadly food\"; hence, the\\n\\t\\t\\t\\texpression shajarat az-zaqqum, a symbol of hell, may be\\n\\t\\t\\t\\tappropriately rendered as \"the tree of deadly fruit\"\\n\\t\\t\\t\\t(undoubtedly identical with \"the tree cursed in this\\n\\t\\t\\t\\tQur'an\", mentioned in  17:60 ), symbolizing the fact that\\n\\t\\t\\t\\tthe otherworldly sufferings which the Qur'an describes as\\n\\t\\t\\t\\t\"hell\" are but the fruit - i.e., organic consequence - of\\n\\t\\t\\t\\tone's evil deeds done on earth."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "63",
    "NoteID": "23",
    "Body": "It cannot be often enough repeated that all Qur'anic\\n\\t\\t\\t\\treferences to hell and paradise - and, for that matter,\\n\\t\\t\\t\\tall descriptions of men's conditions in the hereafter -\\n\\t\\t\\t\\tare, of necessity, highly allegorical (see Appendix I)\\n\\t\\t\\t\\tand therefore liable to be grossly misunderstood if one\\n\\t\\t\\t\\ttakes them in their literal sense or, conversely,\\n\\t\\t\\t\\tinterprets them in an arbitrary manner (cf.  3:7  and the\\n\\t\\t\\t\\tcorresponding notes [5], [7] and [8]): and this, to my\\n\\t\\t\\t\\tmind, explains why the symbol of the \"tree of deadly\\n\\t\\t\\t\\tfruit\" - one of the metonyms for the suffering of the\\n\\t\\t\\t\\tsinners in the hereafter - has become \"a trial (fitnah)\\n\\t\\t\\t\\tfor evildoers\" (or \"for men\" in  17:60 ). See in this\\n\\t\\t\\t\\tconnection  74:31 , which is the earliest Qur'anic\\n\\t\\t\\t\\tinstance of this concept of \"trial\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "65",
    "NoteID": "24",
    "Body": "According to Zamakhsharl, \"this purely verbal metaphor\\n\\t\\t\\t\\t(isti'arah lafziyyah) is meant to express the ultimate in\\n\\t\\t\\t\\trepulsiveness and ugliness ... inasmuch as Satan is\\n\\t\\t\\t\\tconsidered to be the epitome of all that is evil\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "67",
    "NoteID": "25",
    "Body": "Lit., \"and upon it, behold, they will have an admixture\\n\\t\\t\\t\\t[or \"confusion\"] of hamim\". (For my rendering of the last\\n\\t\\t\\t\\tterm as \"burning despair\", see surah {6}, note [62].)"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "68",
    "NoteID": "26",
    "Body": "See surah {6}, note [31]."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "70",
    "NoteID": "27",
    "Body": "I.e., blind imitation (taqlid) of the - obviously absurd\\n\\t\\t\\t\\t- beliefs, valuations and customs of one's erring\\n\\t\\t\\t\\tpredecessors, and disregard of all evidence of the truth\\n\\t\\t\\t\\tsupplied by both reason and divine revelation, is here\\n\\t\\t\\t\\tshown to be the principal cause of the suffering referred\\n\\t\\t\\t\\tto in the preceding passage (Zamakhshari)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "74",
    "NoteID": "28",
    "Body": "Sc., \"and are, therefore, in need of prophetic guidance\":\\n\\t\\t\\t\\twhich explains the subsequent mention of stories relating\\n\\t\\t\\t\\tto several of the prophets. The story of Noah, which is\\n\\t\\t\\t\\tbriefly referred to here, appears in greater detail in\\n\\t\\t\\t\\t{11:25-48}."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "76",
    "NoteID": "29",
    "Body": "I.e., the Deluge."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "78",
    "NoteID": "30",
    "Body": "Lit., \"and we left upon him\", sc., \"this praise\" or\\n\\t\\t\\t\\t\"remembrance\", expressed in the salutation which follows."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "87",
    "NoteID": "31",
    "Body": "Abraham's argument goes thus: \"Do you believe in the\\n\\t\\t\\t\\texistence of a Creator and Lord of the universe?\" - a\\n\\t\\t\\t\\tquestion which his people were bound to answer in the\\n\\t\\t\\t\\taffirmative, since belief in a Supreme Deity was an\\n\\t\\t\\t\\tintegral part of their religion. The next stage of the\\n\\t\\t\\t\\targument would be: \"How, then, can you worship idols -\\n\\t\\t\\t\\tthe work of your own hands - side by side with the idea\\n\\t\\t\\t\\tof a Creator of the universe?\""
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "88",
    "NoteID": "32",
    "Body": "Obviously an allusion to his early, futile attempts at\\n\\t\\t\\t\\tidentifying God with the stars, the sun or the moon (see\\n\\t\\t\\t\\t{6:76-78})."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "89",
    "NoteID": "33",
    "Body": "Sc., \"at your worshipping idols instead of God\" (Ibn\\n\\t\\t\\t\\tKathir; cf. also Lane IV, 1384)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "93",
    "NoteID": "34",
    "Body": "A metonym for \"with all his strength\". For what happened\\n\\t\\t\\t\\tafterwards, see  21:58  ff."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "97",
    "NoteID": "35",
    "Body": "Lit.. \"a building\" or \"a structure\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "98",
    "NoteID": "36",
    "Body": "See surah {21}, note [64]."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "99",
    "NoteID": "37",
    "Body": "Lit., \"I shall go to my Sustainer: He will guide me.\""
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "101",
    "NoteID": "38",
    "Body": "I.e., Abraham's first-born son, Ishmael (Isma'il)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "102",
    "NoteID": "39",
    "Body": "Lit., \"attained to [the age of] walking [or \"striving\"]\\n\\t\\t\\t\\twith him\": evidently a metonym for the child's attaining\\n\\t\\t\\t\\tto an age when he could understand, and share in, his\\n\\t\\t\\t\\tfather's faith and aims."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "103",
    "NoteID": "40",
    "Body": "The above interpolation is, I believe, absolutely\\n\\t\\t\\t\\tnecessary for a proper understanding of this passage. As\\n\\t\\t\\t\\tpointed out repeatedly in these notes, the verb aslama\\n\\t\\t\\t\\tsignifies, in Qur'anic usage, \"he surrendered himself to\\n\\t\\t\\t\\tGod\", or \"to God's will\", even if there is no express\\n\\t\\t\\t\\tmention of God; hence, the dual form aslama occurring in\\n\\t\\t\\t\\tthe above verse might, on the face of it, have this\\n\\t\\t\\t\\tmeaning as well. Since, however, the sequence clearly\\n\\t\\t\\t\\tshows that it was not God's will that Ishmael should be\\n\\t\\t\\t\\tsacrificed, his and his father's \"self-surrender to God's\\n\\t\\t\\t\\twill\" can have in this context only a purely subjective\\n\\t\\t\\t\\tmeaning - namely \"to what they thought to be the will of\\n\\t\\t\\t\\tGod\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "105",
    "NoteID": "41",
    "Body": "I.e., the moral significance of Abraham's dream-vision\\n\\t\\t\\t\\tconsisted in a test of his readiness to sacrifice, at\\n\\t\\t\\t\\twhat he thought to be God's behest (see preceding note),\\n\\t\\t\\t\\tall that was dearest to him in life."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "106",
    "NoteID": "42",
    "Body": "I.e., a trial of this severity clearly implied that\\n\\t\\t\\t\\tAbraham would be capable to bear it, and thus constituted\\n\\t\\t\\t\\ta high moral distinction - in itself a reward from God."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "107",
    "NoteID": "43",
    "Body": "The epithet 'azim (\"tremendous\" or \"mighty\") renders it\\n\\t\\t\\t\\timprobable that this sacrifice refers to nothing but the\\n\\t\\t\\t\\tram which Abraham subsequently found and slaughtered in\\n\\t\\t\\t\\tIshmael's stead (Genesis xxii, 13). To my mind, the\\n\\t\\t\\t\\tsacrifice spoken of here is the one repeated every year\\n\\t\\t\\t\\tby countless believers in connection with the pilgrimage\\n\\t\\t\\t\\tto Mecca (al-hajj), which, in itself, commemorates the\\n\\t\\t\\t\\texperience of Abraham and Ishmael and constitutes one of\\n\\t\\t\\t\\tthe \"five pillars\" of Islam. (See {22:27-37}, as well as\\n\\t\\t\\t\\t{2:196-203}.)"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "108",
    "NoteID": "44",
    "Body": "See note [30] on verse {78}."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "113",
    "NoteID": "45",
    "Body": "I.e., commit evil. With this prediction the Qur'an\\n\\t\\t\\t\\trefutes, as in so many other places, the spurious\\n\\t\\t\\t\\tcontention of the Jews that they are \"the chosen people\"\\n\\t\\t\\t\\tby virtue of their descent from Abraham, Isaac and Jacob,\\n\\t\\t\\t\\tand therefore a priori \"assured\", as it were, of God's\\n\\t\\t\\t\\tacceptance. In other words, God's blessing a prophet or a\\n\\t\\t\\t\\tsaint does not, by itself, imply the conferment of any\\n\\t\\t\\t\\tspecial status on his descendants."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "114",
    "NoteID": "46",
    "Body": "I.e., in consideration of their own merit, and not\\n\\t\\t\\t\\tbecause of their descent from Abraham and Isaac (see\\n\\t\\t\\t\\tpreceding verse and note)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "117",
    "NoteID": "47",
    "Body": "I.e., \"the Torah, wherein there was guidance and light\\n\\t\\t\\t\\t... unto those who followed the Jewish faith\" ( 5:44 )."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "123",
    "NoteID": "48",
    "Body": "The Hebrew prophet Elijah (Ilyas in Arabic) is mentioned\\n\\t\\t\\t\\tin the Bible (I Kings xvii ff. and II Kings i-ii) as\\n\\t\\t\\t\\thaving lived in the Northern Kingdom of Israel during the\\n\\t\\t\\t\\treigns of Ahab and Ahaziah - i.e., in the ninth century\\n\\t\\t\\t\\tB.C. - and having been succeeded by Elisha (Al-Yasa' in\\n\\t\\t\\t\\tArabic). The above stress on his, too, having been \"one\\n\\t\\t\\t\\tof the message-bearers\" (min al-mursalin) recalls the\\n\\t\\t\\t\\tQur'anic principle that God makes \"no distinction between\\n\\t\\t\\t\\tany of His apostles\" (cf.  2:136  and {285},  3:84 ,\\n\\t\\t\\t\\t 4:152 , and the corresponding notes)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "125",
    "NoteID": "49",
    "Body": "As regards this rendering of ahsan al-khaliqin, see surah\\n\\t\\t\\t\\t{23}, note [6]. - The term ba'l (conventionally spelt\\n\\t\\t\\t\\tBaal in European languages) signified \"lord\" or \"master\"\\n\\t\\t\\t\\tin all branches of ancient Arabic, including Hebrew and\\n\\t\\t\\t\\tPhoenician; it was an honorific applied to every one of\\n\\t\\t\\t\\tthe many \"male\" deities worshipped by the ancient\\n\\t\\t\\t\\tSemites, especially in Syria and Palestine. In the Old\\n\\t\\t\\t\\tTestament this designation has sometimes the generic\\n\\t\\t\\t\\tconnotation of \"idol-worship\" - a sin into which,\\n\\t\\t\\t\\taccording to the Bible, the early Israelites often\\n\\t\\t\\t\\trelapsed."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "130",
    "NoteID": "50",
    "Body": "The form Il-Yasin in which this name appears in the above\\n\\t\\t\\t\\tverse is either a variant of Ilyas (Elijah) or, more\\n\\t\\t\\t\\tprobably, a plural - \"the Elijahs\" - meaning \"Elijah and\\n\\t\\t\\t\\this followers\" (Tabar', Zamakhshari, et al.). According\\n\\t\\t\\t\\tto Tabari, 'Abd Allah ibn Mas'ud used to read this verse\\n\\t\\t\\t\\tas \"Peace be upon Idrasin\", which, apart from giving us a\\n\\t\\t\\t\\tvariant or a plural of Idris (\"Idris and his followers\"),\\n\\t\\t\\t\\tlends support to the view that Idris and Ilyas are but\\n\\t\\t\\t\\ttwo designations of one and the same person, the Biblical\\n\\t\\t\\t\\tElijah. (See also note [41] on  19:56 .)"
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "134",
    "NoteID": "51",
    "Body": "See {7:80-84} and {11:69-83}."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "135",
    "NoteID": "52",
    "Body": "As is evident from  7:83  and  11:81 , that woman was\\n\\t\\t\\t\\tLot's wife, who had chosen to stay behind (cf. note [66]\\n\\t\\t\\t\\ton  7:83 )."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "137",
    "NoteID": "53",
    "Body": "Lit., \"you pass by them\", i.e., by the places where they\\n\\t\\t\\t\\tlived (see  15:76  and the corresponding note [55])."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "140",
    "NoteID": "54",
    "Body": "I.e., when he abandoned the mission with which he had\\n\\t\\t\\t\\tbeen entrusted by God (see surah {21}, note [83], which\\n\\t\\t\\t\\tgives the first part of Jonah's story), and thus, in the\\n\\t\\t\\t\\twords of the Bible (The Book of Jonah i, 3 and 10),\\n\\t\\t\\t\\tcommitted the sin of \"fleeing from the presence of the\\n\\t\\t\\t\\tLord\". In its primary significance, the infinitive noun\\n\\t\\t\\t\\tibaq (derived from the verb abaqa) denotes \"a slave's\\n\\t\\t\\t\\trunning-away from his master\"; and Jonah is spoken of as\\n\\t\\t\\t\\thaving \"fled like a runaway slave\" because - although he\\n\\t\\t\\t\\twas God's message-bearer - he abandoned his task under\\n\\t\\t\\t\\tthe stress of violent anger. The subsequent mention of\\n\\t\\t\\t\\t\"the laden ship\" alludes to the central, allegorical part\\n\\t\\t\\t\\tof Jonah's story. The ship ran into a storm and was about\\n\\t\\t\\t\\tto founder; and the mariners \"said everyone to his\\n\\t\\t\\t\\tfellow, Come and let us cast lots, that we may know for\\n\\t\\t\\t\\twhose cause this evil is upon us\" (The Book of Jonah i,\\n\\t\\t\\t\\t7) - a procedure to which Jonah agreed."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "141",
    "NoteID": "55",
    "Body": "Lit., \"he cast lots [with the mariners], and was among\\n\\t\\t\\t\\tthe losers\". According to the Biblical account (The Book\\n\\t\\t\\t\\tof Jonah i, 10-15), Jonah told them that he had \"fled\\n\\t\\t\\t\\tfrom the presence of the Lord\", and that it was because\\n\\t\\t\\t\\tof this sin of his that they all were now in danger of\\n\\t\\t\\t\\tdrowning. \"And he said unto them, Take me up, and cast me\\n\\t\\t\\t\\tforth into the sea; so shall the sea be calm unto you:\\n\\t\\t\\t\\tfor I know that for my sake this tempest is upon you....\\n\\t\\t\\t\\tSo they took up Jonah, and cast him forth into the sea:\\n\\t\\t\\t\\tand the sea ceased from her raging.\""
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "142",
    "NoteID": "56",
    "Body": "In all the three instances where Jonah's \"great fish\" is\\n\\t\\t\\t\\texplicitly mentioned in the Qur'an (as al-hut in the\\n\\t\\t\\t\\tabove verse and in  68:48 , and an-nun in  21:87 ), it\\n\\t\\t\\t\\tcarries the definite article al. This may possibly be due\\n\\t\\t\\t\\tto the fact that the legend of Jonah was and is so widely\\n\\t\\t\\t\\tknown that every reference to the allegory of \"the great\\n\\t\\t\\t\\tfish\" is presumed to be self-explanatory. The inside of\\n\\t\\t\\t\\tthe fish that \"swallowed\" Jonah apparently symbolizes the\\n\\t\\t\\t\\tdeep darkness of spiritual distress of which  21:87 \\n\\t\\t\\t\\tspeaks: the distress at having \"fled like a runaway\\n\\t\\t\\t\\tslave\" from his prophetic mission and, thus, \"from the\\n\\t\\t\\t\\tpresence of the Lord\". Parenthetically, the story is\\n\\t\\t\\t\\tmeant to show that, since \"man has been created weak\"\\n\\t\\t\\t\\t( 4:28 ), even prophets are not immune against all the\\n\\t\\t\\t\\tfailings inherent in human nature."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "143",
    "NoteID": "57",
    "Body": "I.e., to remember God and to repent: see  21:87 , which\\n\\t\\t\\t\\treveals in its very formulation the universal purport of\\n\\t\\t\\t\\tJonah's story."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "146",
    "NoteID": "58",
    "Body": "I.e., to shade and comfort him. Thus, rounding off the\\n\\t\\t\\t\\tallegory of Jonah and the fish, the Qur'an points out in\\n\\t\\t\\t\\tthe figurative manner so characteristic of its style that\\n\\t\\t\\t\\tGod, who can cause a plant to grow out of the most arid\\n\\t\\t\\t\\tand barren soil, can equally well cause a heart lost in\\n\\t\\t\\t\\tdarkness to come back to light and spiritual life."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "148",
    "NoteID": "59",
    "Body": "Cf. the reference to the people of Jonah in  10:98 . For\\n\\t\\t\\t\\tthe Biblical version of this story, see The Book of Jonah\\n\\t\\t\\t\\tiii."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "148",
    "NoteID": "60",
    "Body": "Lit., \"for a time\": i.e., for the duration of their\\n\\t\\t\\t\\tnatural lives (Razi; also Manar XI, 483)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "149",
    "NoteID": "61",
    "Body": "This reference to people who ascribe divinity to beings\\n\\t\\t\\t\\tother than God connects with verse 4 (\"verily, most\\n\\t\\t\\t\\tsurely, your God is One\") as well as with verses {69-70}\\n\\t\\t\\t\\t(\"behold, they found their forebears on a wrong way, and\\n\\t\\t\\t\\t[now] they make haste to follow in their footsteps\")."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "149",
    "NoteID": "62",
    "Body": "For an explanation of this passage, see {16:57-59} and\\n\\t\\t\\t\\tthe corresponding notes."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "151",
    "NoteID": "63",
    "Body": "Lit., \"they\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "153",
    "NoteID": "64",
    "Body": "Cf.  6:100  (\"they have invented for Him sons and\\n\\t\\t\\t\\tdaughters\") and the corresponding notes [87] and [88].\\n\\t\\t\\t\\tSee also note [49] on  17:40 , as well as {53:19-22} and\\n\\t\\t\\t\\tthe corresponding notes."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "154",
    "NoteID": "65",
    "Body": "T it. \"how do you judge?\""
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "158",
    "NoteID": "66",
    "Body": "Lit., \"they\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "158",
    "NoteID": "67",
    "Body": "See Appendix III. Whereas most of the classical\\n\\t\\t\\t\\tcommentators are of the opinion that the term al-jinnah\\n\\t\\t\\t\\tdenotes here the angels, since they - like all beings of\\n\\t\\t\\t\\tthis category - are imperceptible to man's senses, I\\n\\t\\t\\t\\tbelieve that the above verse refers to those intangible\\n\\t\\t\\t\\tforces of nature which elude all direct observation and\\n\\t\\t\\t\\tmanifest themselves only in their effects: hence their\\n\\t\\t\\t\\tdesignation, in this context, by the plural noun\\n\\t\\t\\t\\tal-jinnah, which primarily denotes \"that which is\\n\\t\\t\\t\\tconcealed from [man's] senses\". Inasmuch as people who\\n\\t\\t\\t\\trefuse to believe in God often tend to regard those\\n\\t\\t\\t\\telemental forces as mysteriously endowed with a\\n\\t\\t\\t\\tpurposeful creative power (cf. Bergson's concept of the\\n\\t\\t\\t\\telan vital), the Qur'an states that their votaries invent\\n\\t\\t\\t\\ta \"kinship\" between them and God, i.e., attribute to them\\n\\t\\t\\t\\tqualities and powers similar to His."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "158",
    "NoteID": "68",
    "Body": "For this metaphorical attribution of \"knowledge\" to the\\n\\t\\t\\t\\telemental forces of nature, see verses {164-166} and the\\n\\t\\t\\t\\tcorresponding note [71]."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "159",
    "NoteID": "69",
    "Body": "See note [88] on the last sentence of  6:100 ."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "163",
    "NoteID": "70",
    "Body": "True belief in God precludes all temptation to define Him\\n\\t\\t\\t\\twho is undefinable, or to associate, conceptually, anyone\\n\\t\\t\\t\\tor anything with Him; conversely, the blasphemy inherent\\n\\t\\t\\t\\tin such attempts destroys the potential value of one's\\n\\t\\t\\t\\tbelief in God and, thus, brings about the spiritual ruin\\n\\t\\t\\t\\tof the person concerned."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "164",
    "NoteID": "71",
    "Body": "The metaphorical \"saying\" that follows is in tune with\\n\\t\\t\\t\\tmany other Qur'anic passages which speak of even\\n\\t\\t\\t\\tinanimate objects as \"praising God\", e.g., \"The seven\\n\\t\\t\\t\\theavens extol His limitless glory, and the earth, and all\\n\\t\\t\\t\\tthat they contain\" ( 17:44 ), or \"We caused the mountains\\n\\t\\t\\t\\tto join David in extolling Our glory\" ( 21:79 ), or \"O\\n\\t\\t\\t\\tyou mountains! Sing with him the praise of God!\"\\n\\t\\t\\t\\t( 34:10 ); similarly, even the shadows of material things\\n\\t\\t\\t\\tare spoken of as \"prostrating themselves before God\"\\n\\t\\t\\t\\t( 16:48 )."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "168",
    "NoteID": "72",
    "Body": "Lit., \"a reminder (dhikr) from those of old\": see note\\n\\t\\t\\t\\t[27] on verses {69-70} above. Most of the commentators\\n\\t\\t\\t\\tassume that the term dhikr connotes here, as so often in\\n\\t\\t\\t\\tthe Qur'an, a \"divine writ\". In my opinion, however, it\\n\\t\\t\\t\\tis far more probable - because more in tune with the\\n\\t\\t\\t\\tcontext - that in this case it signifies an ancestral\\n\\t\\t\\t\\ttradition bearing on the (to them astonishing) message of\\n\\t\\t\\t\\tGod's oneness and uniqueness as promulgated by the\\n\\t\\t\\t\\tQur'an."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "175",
    "NoteID": "73",
    "Body": "I.e., as people who are bent on deceiving themselves. In\\n\\t\\t\\t\\tthis context, the verb basura (lit., \"he saw\" or \"became\\n\\t\\t\\t\\tseeing\") is used tropically, in the sense of \"seeing\\n\\t\\t\\t\\tmentally\" or \"gaining insight\"."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "175",
    "NoteID": "74",
    "Body": "I.e., they will realize the truth as well as the\\n\\t\\t\\t\\tsuffering which its rejection entails: obviously a\\n\\t\\t\\t\\treference to the Day of Judgment."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "176",
    "NoteID": "75",
    "Body": "This is an allusion to the sarcastic demand of the people\\n\\t\\t\\t\\twho refused to regard the Qur'an as a divine revelation,\\n\\t\\t\\t\\tto be punished forthwith \"if this be indeed the truth\\n\\t\\t\\t\\tfrom God\" (see  8:32  and the corresponding note)."
  },
  {
    "SurahNumber": "37",
    "AyahNumber": "177",
    "NoteID": "76",
    "Body": "Lit., \"when it alights in their courtyard, evil [or\\n\\t\\t\\t\\t\"hapless\"] is the morning of those...\", etc. In ancient\\n\\t\\t\\t\\tArabic usage, the idiomatic phrase \"chastisement [or\\n\\t\\t\\t\\t\"suffering\"] has alighted (nazala) in so-and-so's\\n\\t\\t\\t\\tcourtyard\" denotes its coming-down upon, or befalling,\\n\\t\\t\\t\\tthe person or persons concerned (Tabari). Similarly, the\\n\\t\\t\\t\\t\"morning\" (sabah) is a metonym for \"awakening\"."
  }
]
