[
  {
    "SurahNumber": "20",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "According to some commentators, the letters t and h\\n\\t\\t\\t\\t(pronounced ta ha) which introduce this surah belong to\\n\\t\\t\\t\\tthe group of al-muqatta'at - the \"single [or\\n\\t\\t\\t\\t\"disjointed\"] letters\" - which are prefixed to a number\\n\\t\\t\\t\\tof the Qur’anic surahs (see Appendix II). However, in the\\n\\t\\t\\t\\topinion of some of the Prophet’s Companions (e.g., Abd\\n\\t\\t\\t\\tAllah ibn Abbas) and a number of outstanding\\n\\t\\t\\t\\tpersonalities of the next generation (like Said ibn\\n\\t\\t\\t\\tJubayr, Mujahid, Qatadah, Al-Hasan al-Basri, Ikrimah,\\n\\t\\t\\t\\tAd-Dahhak, Al-Kalbi, etc.), ta ha is not just a\\n\\t\\t\\t\\tcombination of two single letters but a meaningful\\n\\t\\t\\t\\texpression of its own, signifying \"0 man\" (synonymous\\n\\t\\t\\t\\twith ya rajul) in both the Nabataean and Syriac branches\\n\\t\\t\\t\\tof the Arabic language (Tabari, Razi, Ibn Kathir), as\\n\\t\\t\\t\\twell as in the - purely Arabian - dialect of the Yemenite\\n\\t\\t\\t\\ttribe of 'Akk, as is evident from certain fragments of\\n\\t\\t\\t\\ttheir pre-Islamic poetry (quoted by Tabari and\\n\\t\\t\\t\\tZamakhshari). Tabari, in particular, gives his\\n\\t\\t\\t\\tunqualified support to the rendering of ta ha as \"0 man\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "I.e., the ethical discipline imposed upon man by the\\n\\t\\t\\t\\tteachings of the Qur’an is not meant to narrow down his\\n\\t\\t\\t\\tfeel of life, but, on the contrary, to enhance it by\\n\\t\\t\\t\\tdeepening his consciousness of right and wrong."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "For my rendering of the metaphorical term al-arsh as \"the\\n\\t\\t\\t\\tthrone of His almightiness\", see note [43] on  7:54 ."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "I.e., He knows not only man’s unspoken, conscious\\n\\t\\t\\t\\tthoughts but also all that goes on within his\\n\\t\\t\\t\\tsubconscious self."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "8",
    "NoteID": "5",
    "Body": "For an explanation of this rendering of al-asma'\\n\\t\\t\\t\\tal-husna, see surah {7}, note [145]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "9",
    "NoteID": "6",
    "Body": "Apart from two short references to Moses in earlier\\n\\t\\t\\t\\tsurahs ({53 :36} and {87: 19}), the narrative appearing\\n\\t\\t\\t\\tin verses {9-98} is undoubtedly the earliest Qur'anic\\n\\t\\t\\t\\texposition of the story of Moses as such. Its mention at\\n\\t\\t\\t\\tthis stage is connected with the reference to revelation\\n\\t\\t\\t\\tat the beginning of this surah (verses {2-4}) and,\\n\\t\\t\\t\\tgenerally, with the Qur'anic doctrine of the basic\\n\\t\\t\\t\\tideological unity of all revealed religions."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "10",
    "NoteID": "7",
    "Body": "From the sequence (here as well as in  27:7  and  28:29 )\\n\\t\\t\\t\\tit appears that Moses had lost his way in the desert:\\n\\t\\t\\t\\tprobably a symbolic allusion to his dawning awareness\\n\\t\\t\\t\\tthat he was in need of spiritual guidance. This part of\\n\\t\\t\\t\\tthe story relates to the period of his wanderings\\n\\t\\t\\t\\tsubsequent to his flight from Egypt (see  28:14  ff.).\\n\\t\\t\\t\\tRegarding the allegory of the \"fire\" - the \"burning bush\"\\n\\t\\t\\t\\tof the Bible - see note [7] on {27:7-8}."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "11",
    "NoteID": "8",
    "Body": "Lit., \"he was called\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "12",
    "NoteID": "9",
    "Body": "Whereas some commentators assume that the word tuwan (or\\n\\t\\t\\t\\ttawa) is the name of the \"hallowed valley\", Zamakhshari\\n\\t\\t\\t\\texplains it, more convincingly, as meaning \"twice\" (from\\n\\t\\t\\t\\ttawan or tiwan, \"twice done\")-i.e., \"twice-hallowed\" -\\n\\t\\t\\t\\tapparently because God's voice was heard in it and\\n\\t\\t\\t\\tbecause Moses was raised there to prophethood."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "14",
    "NoteID": "10",
    "Body": "Thus, conscious remembrance of God and of His oneness and\\n\\t\\t\\t\\tuniqueness is declared to be the innermost purpose, as\\n\\t\\t\\t\\twell as the intellectual justification of all true\\n\\t\\t\\t\\tprayer."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "15",
    "NoteID": "11",
    "Body": "I.e., the time of its coming."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "15",
    "NoteID": "12",
    "Body": "The expression \"what he strove for\" implies consciousness\\n\\t\\t\\t\\tof endeavour, and thus excludes involuntary actions (in\\n\\t\\t\\t\\tthe widest sense of the latter term, comprising\\n\\t\\t\\t\\teverything that is manifested in word or actual deed), as\\n\\t\\t\\t\\twell as involuntary omissions, irrespective of whether\\n\\t\\t\\t\\tthe relevant action or omission is morally good or bad.\\n\\t\\t\\t\\tBy enunciating the above principle within the context of\\n\\t\\t\\t\\tthe story of Moses, the Qur'an stresses the essential\\n\\t\\t\\t\\tidentity of the ethical concepts underlying all true\\n\\t\\t\\t\\treligions. (See also {53: 39} and the corresponding note\\n\\t\\t\\t\\t[32].)"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "16",
    "NoteID": "13",
    "Body": "Lit., \"in it\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "21",
    "NoteID": "14",
    "Body": "The miraculous transformation of the staff into a serpent\\n\\t\\t\\t\\thas, I believe, a mystic significance: it seems to be an\\n\\t\\t\\t\\tallusion to the intrinsic difference between appearance\\n\\t\\t\\t\\tand reality, and, consequently, to the spiritual insight\\n\\t\\t\\t\\tinto this difference bestowed by God on His chosen\\n\\t\\t\\t\\tservants (cf. the experience of Moses with the unnamed\\n\\t\\t\\t\\tsage described in (18:66-82}). This interpretation finds\\n\\t\\t\\t\\tstrong support in  27:10  and  28:31 , in both of which\\n\\t\\t\\t\\tplaces it is said that Moses saw the staff \"move rapidly,\\n\\t\\t\\t\\tas if it were a serpent (ka’annaha jann)\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "22",
    "NoteID": "15",
    "Body": "I.e., strangely luminescent by virtue of the prophethood\\n\\t\\t\\t\\tto which he had been raised. (See also note [85] on\\n\\t\\t\\t\\t 7:108 .)"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "24",
    "NoteID": "16",
    "Body": "This seems to be a reference to Pharaoh’s greatest sin,\\n\\t\\t\\t\\tnamely, his claim to divine status (cf.  28:38  and\\n\\t\\t\\t\\t 79:24 )."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "28",
    "NoteID": "17",
    "Body": "I.e., \"remove all impediment from my speech\" (cf. Exodus\\n\\t\\t\\t\\tiv, 10, \"I am slow of speech, and of a slow tongue\"),\\n\\t\\t\\t\\twhich would imply that he was not gifted with natural\\n\\t\\t\\t\\teloquence."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "29",
    "NoteID": "18",
    "Body": "This is the primary meaning of the term wazir (lit.,\\n\\t\\t\\t\\t\"burden-carrier\", derived from wizr, \"a burden\"); hence\\n\\t\\t\\t\\tits later - post-classical - application to government\\n\\t\\t\\t\\tministers."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "34",
    "NoteID": "19",
    "Body": "Lit., \"much\" or \"abundantly\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "37",
    "NoteID": "20",
    "Body": "Lit., \"at another time\", i.e., the time of Moses'\\n\\t\\t\\t\\tchildhood and youth, which is recalled in verses {38-40}.\\n\\t\\t\\t\\tFor a fuller explanation of the subsequent references to\\n\\t\\t\\t\\tthat period - the Pharaonic persecution of the children\\n\\t\\t\\t\\tof Israel and the killing of their new-born males, the\\n\\t\\t\\t\\trescue of the infant Moses and his adoption by Pharaoh's\\n\\t\\t\\t\\tfamily, his killing of the Egyptian, and his subsequent\\n\\t\\t\\t\\tflight from Egypt-see {28:3-21}, where the story is\\n\\t\\t\\t\\tnarrated in greater detail."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "39",
    "NoteID": "21",
    "Body": "Lit., \"take him\" (cf.  28:9 ). Pharaoh is described as an\\n\\t\\t\\t\\tenemy of God because of his overweening arrogance and\\n\\t\\t\\t\\tcruelty as well as his claim to the status of divinity\\n\\t\\t\\t\\t(see  79:24 ); and he was, unknowingly, an enemy of the\\n\\t\\t\\t\\tinfant Moses inasmuch as he hated and feared the people\\n\\t\\t\\t\\tto whom the latter belonged."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "39",
    "NoteID": "22",
    "Body": "I.e., \"under My protection and in accordance with the\\n\\t\\t\\t\\tdestiny which I have decreed for thee\": possibly a\\n\\t\\t\\t\\treference to Moses' upbringing within the cultural\\n\\t\\t\\t\\tenvironment of the royal palace and his subsequent\\n\\t\\t\\t\\tacquisition of the ancient wisdom of Egypt -\\n\\t\\t\\t\\tcircumstances which were to qualify him for his future\\n\\t\\t\\t\\tleadership and the special mission that God had in view\\n\\t\\t\\t\\tfor him."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "NoteID": "23",
    "Body": "For a fuller account, see  28:12 ."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "NoteID": "24",
    "Body": "As is implied here and in {28:12-13}, his own mother\\n\\t\\t\\t\\tbecame his wet-nurse."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "NoteID": "25",
    "Body": "Cf.  28:14 ."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "NoteID": "26",
    "Body": "For the details of this particular incident, which proved\\n\\t\\t\\t\\ta turning-point in the life of Moses, see {28:15-21}."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "NoteID": "27",
    "Body": "See {28:22-28}."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "44",
    "NoteID": "28",
    "Body": "Lit., \"or [that he might] fear\" - i.e., that there is\\n\\t\\t\\t\\tsome truth in the words of Moses. Since God knows the\\n\\t\\t\\t\\tfuture, the tentative form in the above phrase-\"so that\\n\\t\\t\\t\\the might (la'allahu) bethink himself\", etc.,-obviously\\n\\t\\t\\t\\tdoes not imply any \"doubt\" on God's part as to Pharoah's\\n\\t\\t\\t\\tfuture reaction: it implies no more than His command to\\n\\t\\t\\t\\tthe bearer of His message to address the sinner with a\\n\\t\\t\\t\\tview to the latter's bethinking himself: in other words,\\n\\t\\t\\t\\tit relates to the intention or hope with which the\\n\\t\\t\\t\\tmessage-bearer should approach his task (Razi). And since\\n\\t\\t\\t\\tevery Qur'anic narrative aims at bringing out an eternal\\n\\t\\t\\t\\ttruth or truths or at elucidating a universal principle\\n\\t\\t\\t\\tof human behaviour, it is evident that God's command to\\n\\t\\t\\t\\tMoses to speak to one particular sinner \"in a mild\\n\\t\\t\\t\\tmanner, so that he might [have a chance to] bethink\\n\\t\\t\\t\\thimself\" retains its validity for all times and all such\\n\\t\\t\\t\\tattempts at conversion."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "45",
    "NoteID": "29",
    "Body": "I.e., \"lest he prevent us, by banishing or killing us\\n\\t\\t\\t\\toutright, from delivering Thy message fully\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "47",
    "NoteID": "30",
    "Body": "Cf.  2:49 ,  7:141  and  14:6 . For a more detailed\\n\\t\\t\\t\\tdescription of this Pharaonic oppression of the\\n\\t\\t\\t\\tIsraelites, see Exodus i, X-22."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "50",
    "NoteID": "31",
    "Body": "In the original, this sentence appears in the past tense\\n\\t\\t\\t\\t(\"has given\" and \"has guided\"); but as it obviously\\n\\t\\t\\t\\trelates to the continuous process of God's creation, it\\n\\t\\t\\t\\tis independent of the concept of time and denotes, as in\\n\\t\\t\\t\\tso many other places in the Qur'an, an unceasing present.\\n\\t\\t\\t\\tThe term khalq signifies in this context not merely the\\n\\t\\t\\t\\tinner nature of a created thing or being but also the\\n\\t\\t\\t\\toutward form in which this nature manifests itself; hence\\n\\t\\t\\t\\tmy composite rendering of khalqahu as \"its true nature\\n\\t\\t\\t\\tand form\". The idea underlying the above sentence is\\n\\t\\t\\t\\texpressed for the first time in {87:2-3}, i.e., in a\\n\\t\\t\\t\\tsurah which belongs to the earliest period of Qur'anic\\n\\t\\t\\t\\trevelation."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "51",
    "NoteID": "32",
    "Body": "Sc., \"who used to worship a plurality of deities: are\\n\\t\\t\\t\\tthey, in thy view, irretrievably doomed?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "52",
    "NoteID": "33",
    "Body": "I.e., He alone decrees their destiny in the life to come,\\n\\t\\t\\t\\tfor He alone knows their motives and understands the\\n\\t\\t\\t\\tcause of their errors, and He alone can appreciate their\\n\\t\\t\\t\\tspiritual merits and demerits."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "52",
    "NoteID": "34",
    "Body": "According to Razi, the dialogue between Moses and Pharaoh\\n\\t\\t\\t\\tends here for the time being, with verses {53-55}\\n\\t\\t\\t\\trepresenting a direct Qur'anic discourse addressed to man\\n\\t\\t\\t\\tin general."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "53",
    "NoteID": "35",
    "Body": "I.e., \"has provided you with ways and means - both\\n\\t\\t\\t\\tmaterial and intellectual - to gain your livelihood on\\n\\t\\t\\t\\tearth and from it\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "53",
    "NoteID": "36",
    "Body": "Lit., \"pairs\" (azwaj), a term which in this context\\n\\t\\t\\t\\tapparently denotes \"kinds\"; but see also  13:3  and the\\n\\t\\t\\t\\tcorresponding note [7]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "55",
    "NoteID": "37",
    "Body": "Regarding the creation of man's body \"out of the earth\",\\n\\t\\t\\t\\tsee the second half of note [47] on {3: 59}, as well as\\n\\t\\t\\t\\tnote [24] on  15:26 ; its \"return into it\" signifies the\\n\\t\\t\\t\\tdissolution of this body, after death, into the\\n\\t\\t\\t\\telementary organic and inorganic substances of which it\\n\\t\\t\\t\\twas composed; and all these facts- creation, subsistence\\n\\t\\t\\t\\tand dissolution -contain the message of God's\\n\\t\\t\\t\\talmightiness, of the ephemeral nature of man's life on\\n\\t\\t\\t\\tearth, and of his future resurrection."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "56",
    "NoteID": "38",
    "Body": "Lit., We showed him\" (araynahu), i.e., Pharaoh. According\\n\\t\\t\\t\\tto Zamakhshari, Razi and Baydawi, this verb has here the\\n\\t\\t\\t\\tmeaning of \"We made him acquainted with\" or \"aware of\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "56",
    "NoteID": "39",
    "Body": "The messages alluded to here are both those entrusted\\n\\t\\t\\t\\tdirectly to Moses and the intangible \"messages\"\\n\\t\\t\\t\\tforthcoming from God's creation and referred to in the\\n\\t\\t\\t\\tpreceding passage."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "57",
    "NoteID": "40",
    "Body": "I.e., \"deprive us of our rule\" (cf.  7:110 )."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "59",
    "NoteID": "41",
    "Body": "Lit., \"the day of adornment\" - possibly the Egyptian New\\n\\t\\t\\t\\tYear's Day. The expression \"your tryst\" has the\\n\\t\\t\\t\\tconnotation of \"the tryst proposed by you\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "60",
    "NoteID": "42",
    "Body": "Lit., \"he decided upon his artful scheme\" (Jama'a\\n\\t\\t\\t\\tkaydahu): evidently an allusion to his summoning all the\\n\\t\\t\\t\\tgreatest sorcerers of Egypt (cf. {7:111-114})."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "61",
    "NoteID": "43",
    "Body": "I.e., by deliberately denying the truth of His messages."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "63",
    "NoteID": "44",
    "Body": "See note [40] above. The dual form refers to Moses and\\n\\t\\t\\t\\tAaron."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "63",
    "NoteID": "45",
    "Body": "Lit., \"your exemplary [or \"ideal\"] way of life\\n\\t\\t\\t\\t(tariqah)\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "64",
    "NoteID": "46",
    "Body": "Lit., \"in one [single] line\", i.e., in unison."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "64",
    "NoteID": "47",
    "Body": "Cf. {7: 113-114}."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "67",
    "NoteID": "48",
    "Body": "Lit., \"conceived fear within himself\". The implication is\\n\\t\\t\\t\\tthat the feat of the sorcerers was based on\\n\\t\\t\\t\\tmass-hallucination (cf.  7:116  - \"they cast a spell upon\\n\\t\\t\\t\\tthe people's eyes\"), a hallucination to which even Moses\\n\\t\\t\\t\\tsuccumbed for a while."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "69",
    "NoteID": "49",
    "Body": "Lit., \"wherever he may come\" - i.e., irrespective of\\n\\t\\t\\t\\twhether he aims at a good or at an evil end (Razi). The\\n\\t\\t\\t\\tabove statement implies a categorical condemnation of all\\n\\t\\t\\t\\tendeavours which fall under the heading of \"magic\",\\n\\t\\t\\t\\twhatever the intention of the person who devotes himself\\n\\t\\t\\t\\tto it. (In this connection, see also surah {2}, note\\n\\t\\t\\t\\t[84].)"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "70",
    "NoteID": "50",
    "Body": "Cf. {7:117-119}."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "70",
    "NoteID": "51",
    "Body": "See note [90] on  7:120 ."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "71",
    "NoteID": "52",
    "Body": "I.e., Moses (cf. note [91] on  7:123 )."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "71",
    "NoteID": "53",
    "Body": "Regarding the meaning of the stress on \"great numbers\",\\n\\t\\t\\t\\tforthcoming from the grammatical form of the verbs\\n\\t\\t\\t\\temployed by Pharaoh, see surah {7}, note [92]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "71",
    "NoteID": "54",
    "Body": "Sc., \"I or the God in whom you now believe\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "72",
    "NoteID": "55",
    "Body": "Or: \"thou canst end [for us] only this worldly life\". It\\n\\t\\t\\t\\tis to be noted that the verb qada signifies, among other\\n\\t\\t\\t\\tmeanings, \"he decreed\" as well as \"he ended [something]\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "73",
    "NoteID": "56",
    "Body": "Pharaoh (a title borne by every indigenous ruler of\\n\\t\\t\\t\\tEgypt) was considered to be a \"god-king\" and, thus, the\\n\\t\\t\\t\\tembodiment of the Egyptian religion, in which occult\\n\\t\\t\\t\\tpractices and magic played a very important role; hence,\\n\\t\\t\\t\\tevery one of his subjects was duty-bound to accept magic\\n\\t\\t\\t\\tas an integral part of the scheme of life."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "73",
    "NoteID": "57",
    "Body": "Lit., \"and the most abiding\", i.e., eternal: cf.\\n\\t\\t\\t\\t{55:26-27}."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "74",
    "NoteID": "58",
    "Body": "I.e., he will neither be reborn spiritually nor find\\n\\t\\t\\t\\tpeace through extinction (Baghawi, Baydawi). As is\\n\\t\\t\\t\\tapparent from the juxtaposition, in the next verse, of\\n\\t\\t\\t\\tthe term mujrim (rendered by me as \"one who is lost in\\n\\t\\t\\t\\tsin\") with that of mu'min (\"believer\"), the former term\\n\\t\\t\\t\\tis here applied to one who, in his lifetime, has\\n\\t\\t\\t\\tconsciously and persistently denied God (Baydawi)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "75",
    "NoteID": "59",
    "Body": "Thus the Qur'an implies - here as well as in many other\\n\\t\\t\\t\\tplaces - that the spiritual value of a person's faith\\n\\t\\t\\t\\tdepends on his doing righteous deeds as well: cf. the\\n\\t\\t\\t\\tstatement in  6:158  that on Judgment Day \"believing will\\n\\t\\t\\t\\tbe of no avail to any human being... who, while\\n\\t\\t\\t\\tbelieving, did no good works\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "77",
    "NoteID": "60",
    "Body": "I.e., after all the trials which the Israelites had to\\n\\t\\t\\t\\tundergo in Egypt, and after the plagues with which\\n\\t\\t\\t\\tPharaoh and his followers were afflicted (cf. {7\\n\\t\\t\\t\\t:130}ff.)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "77",
    "NoteID": "61",
    "Body": "Referring to the phrase \"strike out (idrib) for them a\\n\\t\\t\\t\\tdry path through the sea\", Tabari explains it as meaning\\n\\t\\t\\t\\t\"choose (ittakidh) for them a dry path\". See also\\n\\t\\t\\t\\t{26:63-66} and the corresponding notes [33] and [35]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "78",
    "NoteID": "62",
    "Body": "Lit., \"there overwhelmed them [that] of the sea which\\n\\t\\t\\t\\toverwhelmed them\" - expressing the inevitability of the\\n\\t\\t\\t\\tdoom which encompassed them."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "80",
    "NoteID": "63",
    "Body": "See note [38] on  19:52 . As regards God's \"covenant\"\\n\\t\\t\\t\\twith the children of Israel, see  2:63  and {83}."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "81",
    "NoteID": "64",
    "Body": "The reference to God's bestowal of \"manna (mann) and\\n\\t\\t\\t\\tquails (salwa)\" upon the Israelites during their\\n\\t\\t\\t\\twanderings in the Sinai Desert after their exodus from\\n\\t\\t\\t\\tEgypt is found in the Qur'an in two other places as well\\n\\t\\t\\t\\t(namely, in  2:57  and  7:160 ). According to Arab\\n\\t\\t\\t\\tphilologists, the term mann denotes not only the sweet,\\n\\t\\t\\t\\tresinous substance exuded by certain plants of the\\n\\t\\t\\t\\tdesert, but also everything that is \"bestowed as a\\n\\t\\t\\t\\tfavour\", i.e., without any effort on the part of the\\n\\t\\t\\t\\trecipient. Similarly, the term salwa signifies not merely\\n\\t\\t\\t\\t\"a quail\" or \"quails\", but also \"all that makes man\\n\\t\\t\\t\\tcontent and happy after privation\" (Qamus). Hence the\\n\\t\\t\\t\\tcombination of these two terms denotes, metonymically,\\n\\t\\t\\t\\tthe gift of sustenance freely bestowed by God upon the\\n\\t\\t\\t\\tfollowers of Moses."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "81",
    "NoteID": "65",
    "Body": "Or: \"do not behave in an overweening manner\" - i.e., \"do\\n\\t\\t\\t\\tnot attribute these favours to your own supposed\\n\\t\\t\\t\\texcellence on account of your descent from Abraham\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "81",
    "NoteID": "66",
    "Body": "There is almost complete unanimity among the classical\\n\\t\\t\\t\\tcommentators in that God's \"condemnation\" (ghadab, lit.,\\n\\t\\t\\t\\t\"wrath\") is a metonym for the inescapable retribution\\n\\t\\t\\t\\twhich man brings upon himself if he deliberately rejects\\n\\t\\t\\t\\tGod's guidance and \"transgresses the bounds of equity\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "83",
    "NoteID": "67",
    "Body": "This passage relates to the time of Moses' ascent of\\n\\t\\t\\t\\tMount Sinai, mentioned in  2:51  and  7:142 ."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "83",
    "NoteID": "68",
    "Body": "Lit., \"what has hastened thee ahead of thy people?\" -\\n\\t\\t\\t\\timplying that he should not have left them alone, without\\n\\t\\t\\t\\this personal guidance, at so early a stage in their\\n\\t\\t\\t\\tfreedom. In this inimitable elliptic manner the Qur'an\\n\\t\\t\\t\\talludes to the psychological fact that a community which\\n\\t\\t\\t\\tattains to political and social freedom after centuries\\n\\t\\t\\t\\tof bondage remains for a long time subject to the\\n\\t\\t\\t\\tdemoralizing influences of its past, and cannot all at\\n\\t\\t\\t\\tonce develop a spiritual and social discipline of its\\n\\t\\t\\t\\town."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "84",
    "NoteID": "69",
    "Body": "The classical commentators understand this phrase in its\\n\\t\\t\\t\\tphysical sense, i.e., \"they are coming up behind me and\\n\\t\\t\\t\\tare now close by\". Since, however, Moses was obviously\\n\\t\\t\\t\\tmeant to be alone on his ascent of Mount Sinai, I am of\\n\\t\\t\\t\\tthe opinion that his answer has a tropical sense,\\n\\t\\t\\t\\texpressing his assumption that the children of Israel\\n\\t\\t\\t\\twould follow his guidance even in his absence: an\\n\\t\\t\\t\\tassumption which proved erroneous, as shown in the\\n\\t\\t\\t\\tsequence."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "85",
    "NoteID": "70",
    "Body": "The designation as-sf~miri is undoubtedly an adjectival\\n\\t\\t\\t\\tnoun denoting the person's descent or origin. According\\n\\t\\t\\t\\tto one of the explanations advanced by Tabar~ and\\n\\t\\t\\t\\tZamakhsharl, it signifies \"a man of the Jewish clan of\\n\\t\\t\\t\\tthe Samirah\", i.e., the ethnic and religious group\\n\\t\\t\\t\\tdesignated in later times as the Samaritans (a small\\n\\t\\t\\t\\tremnant of whom is still living in Nablus, in Palestine).\\n\\t\\t\\t\\tSince that sect as such did not yet exist at the time of\\n\\t\\t\\t\\tMoses, it is possible that - as Ibn 'Abbas maintained\\n\\t\\t\\t\\t(Razi) - the person in question was one of the many\\n\\t\\t\\t\\tEgyptians who had been converted to the faith of Moses\\n\\t\\t\\t\\tand joined the Israelites on their exodus from Egypt (cf.\\n\\t\\t\\t\\tnote [92] on  7:124 ): in which case the designation\\n\\t\\t\\t\\tsamiri might be connected with the ancient Egyptian\\n\\t\\t\\t\\tshemer, \"a foreigner\" or \"stranger\". This surmise is\\n\\t\\t\\t\\tstrengthened by his introduction of the worship of the\\n\\t\\t\\t\\tgolden calf, undoubtedly an echo of the Egyptian cult of\\n\\t\\t\\t\\tApis (see note [113] on  7:148 ). In any case, it is not\\n\\t\\t\\t\\timpossible that the latter-day Samaritans descended - or\\n\\t\\t\\t\\twere reputed to descend - from this personality, whether\\n\\t\\t\\t\\tof Hebrew or of Egyptian origin; this might partly\\n\\t\\t\\t\\texplain the persistent antagonism between them and the\\n\\t\\t\\t\\trest of the Israelite community."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "86",
    "NoteID": "71",
    "Body": "Or, according to Zamakhsharl: \"Did, then, the time [of my\\n\\t\\t\\t\\tabsence] seem too long to you?\" (It is to be noted that\\n\\t\\t\\t\\tthe term 'ahd signifies a \"time\" or \"period\" as well as a\\n\\t\\t\\t\\t\"covenant\" or promise\".)"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "86",
    "NoteID": "72",
    "Body": "Lit., \"Or have you decided that condemnation by your\\n\\t\\t\\t\\tSustainer should fall due upon you?\"-i.e., \"are you\\n\\t\\t\\t\\tdetermined to disregard the consequences of your doings?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "87",
    "NoteID": "73",
    "Body": "It is mentioned in Exodus xii, 35 that, immediately\\n\\t\\t\\t\\tbefore their departure from Egypt, the Israelites\\n\\t\\t\\t\\t\"borrowed of the Egyptians jewels of silver and jewels of\\n\\t\\t\\t\\tgold\". This \"borrowing\" was obviously done under false\\n\\t\\t\\t\\tpretences, without any intention on the part of the\\n\\t\\t\\t\\tIsraelites to return the jewellery to its rightful\\n\\t\\t\\t\\towners: for, according to the Biblical statement (ibid.,\\n\\t\\t\\t\\tverse {36}), \"they spoiled [i.e., robbed] the Egyptians\"\\n\\t\\t\\t\\tby doing so. While it is noteworthy that the Old\\n\\t\\t\\t\\tTestament, in its present, corrupted form, does not\\n\\t\\t\\t\\tcondemn this behaviour, its iniquity seems to have\\n\\t\\t\\t\\tgradually dawned upon the Israelites, and so they decided\\n\\t\\t\\t\\tto get rid of those sinfully acquired ornaments (Baghawi,\\n\\t\\t\\t\\tZamakshari and - in one of his alternative\\n\\t\\t\\t\\tinterpretations - Razi)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "88",
    "NoteID": "74",
    "Body": "This interpolation is necessary in view of the change\\n\\t\\t\\t\\tfrom the direct speech in the preceding verse to the\\n\\t\\t\\t\\tindirect in this one and in the sequence."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "88",
    "NoteID": "75",
    "Body": "See surah {7}, note [113]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "88",
    "NoteID": "76",
    "Body": "An allusion to the fact that Moses had been brought up -\\n\\t\\t\\t\\tobviously as an Egyptian - at Pharaoh's court."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "90",
    "NoteID": "77",
    "Body": "Sc., \"and do not follow the Samaritan\". This is in sharp\\n\\t\\t\\t\\tcontrast to the Bible (Exodus xxxii, 1-5), which declares\\n\\t\\t\\t\\tAaron guilty of making and worshipping the golden calf."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "93",
    "NoteID": "78",
    "Body": "Cf. the last sentence of  7:142 , where Moses, before\\n\\t\\t\\t\\tleaving for Mount Sinai, exhorts Aaron to \"act\\n\\t\\t\\t\\trighteously\" (islih). In this connection see also Aaron's\\n\\t\\t\\t\\treply to Moses in  7:150 , as well as the corresponding\\n\\t\\t\\t\\tnote [117]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "94",
    "NoteID": "79",
    "Body": "See  7:150 ."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "94",
    "NoteID": "80",
    "Body": "Lit., \"to my word\" or \"to what I had said\" - evidently,\\n\\t\\t\\t\\tabout the importance of keeping the people united\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "96",
    "NoteID": "81",
    "Body": "It is to be noted that the verb basura (lit., \"he became\\n\\t\\t\\t\\tseeing\") has the tropical significance of \"he perceived\\n\\t\\t\\t\\t[something] mentally\", or \"he gained insight\" or \"he\\n\\t\\t\\t\\tunderstood\". Hence, Abu Muslim al-Isfahani (whose\\n\\t\\t\\t\\tinterpretation of the whole of this verse Razi analyzes\\n\\t\\t\\t\\tand finds most convincing) explains the above phrase as\\n\\t\\t\\t\\tmeaning, \"I realized what they [i.e., the rest of the\\n\\t\\t\\t\\tpeople] did not realize - namely, that some of thy\\n\\t\\t\\t\\tbeliefs, O Moses, were wrong\". It would seem that the\\n\\t\\t\\t\\tSamaritan objected to the idea of a transcendental,\\n\\t\\t\\t\\timperceivable God, and thought that the people ought to\\n\\t\\t\\t\\thave something more \"tangible\" to believe in. (See also\\n\\t\\t\\t\\tnext note.)"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "96",
    "NoteID": "82",
    "Body": "Contrary to the fanciful interpretations advanced by some\\n\\t\\t\\t\\tof the other commentators, Abu Muslim (as quoted by Razi)\\n\\t\\t\\t\\texplains the term athar (lit., \"vestige\" or \"trace\") in\\n\\t\\t\\t\\tits tropical sense of the \"practices and sayings\" or -\\n\\t\\t\\t\\tcollectively - the \"teachings\" of any person, and\\n\\t\\t\\t\\tparticularly of a prophet; thus, he makes it clear that\\n\\t\\t\\t\\tthe phrase qabadtu qabdatan min athari 'r-rasul\\n\\t\\t\\t\\tfa-nabadhtuha signifies \"I took hold of a handful [i.e.,\\n\\t\\t\\t\\t\"something\"] of the teachings of the Apostle, and\\n\\t\\t\\t\\tdiscarded it\": it being understood that \"the Apostle\"\\n\\t\\t\\t\\treferred to by the Samaritan in the third person is Moses\\n\\t\\t\\t\\thimself. (As already mentioned in the preceding note,\\n\\t\\t\\t\\tRazi unreservedly subsrcibes to Abu Muslim's\\n\\t\\t\\t\\tintepretation of this passage.)  In my opinion, the\\n\\t\\t\\t\\tSamaritan's rejection of a part of Moses' teachings is\\n\\t\\t\\t\\tmeant to explain the subconscious tendency underlying all\\n\\t\\t\\t\\tforms of idolatry and of the attribution of divine\\n\\t\\t\\t\\tqualities to things or beings other than God: a futile,\\n\\t\\t\\t\\tself-deceiving hope of bringing the Unpercievable closer\\n\\t\\t\\t\\tto one's limited perception by creating a tangible\\n\\t\\t\\t\\t\"image\" of the Divine Being or, at least, of something\\n\\t\\t\\t\\tthat could be conceived as His \"emanation\".  Inasmuch as\\n\\t\\t\\t\\tall such endeavours obscure rather than illuminate man's\\n\\t\\t\\t\\tunderstanding of God, they defeat their own purpose and\\n\\t\\t\\t\\tdestroy the misguided devotee's spiritual potential: and\\n\\t\\t\\t\\tthis is undoubtedly the purport of the story of the\\n\\t\\t\\t\\tgolden calf as given in the Qur'an."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "97",
    "NoteID": "83",
    "Body": "Lit., \"no touching\" - a metaphorical description of the\\n\\t\\t\\t\\tloneliness and the social ostracism in which he would\\n\\t\\t\\t\\thenceforth find himself."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "97",
    "NoteID": "84",
    "Body": "Lit., \"there is for thee an appointment which thou canst\\n\\t\\t\\t\\tnot fail to keep\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "99",
    "NoteID": "85",
    "Body": "The adverb kadhalika (\"thus\") which introduces this verse\\n\\t\\t\\t\\tis meant to stress the purpose of all Qur'anic references\\n\\t\\t\\t\\tto past events - be they historical or legendary - as\\n\\t\\t\\t\\twell as the manner in which the relevant stories are\\n\\t\\t\\t\\ttreated. Since the purpose underlying every Qur’anic\\n\\t\\t\\t\\tnarrative is, invariably, the illustration of certain\\n\\t\\t\\t\\tfundamental truths, the narrative as such is often\\n\\t\\t\\t\\tcondensed and elliptic, omitting all that has no direct\\n\\t\\t\\t\\tbearing on the point or points which the Qur’an means to\\n\\t\\t\\t\\tbring out. The term \"reminder\" alludes to the unceasing\\n\\t\\t\\t\\tguidance which God offers to man through His revelations."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "102",
    "NoteID": "86",
    "Body": "Lit., \"blue [of eye]\" - i.e., as if their eyes were\\n\\t\\t\\t\\tcovered with a bluish, opaque film."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "103",
    "NoteID": "87",
    "Body": "As in several other places in the Qur’an (e.g., in 2:259,\\n\\t\\t\\t\\t17:52, 18:19, 23:112-113, 30:55, 79:46, etc.), this and\\n\\t\\t\\t\\tthe next verse touch upon the illusory character of man’s\\n\\t\\t\\t\\tconsciousness of \"time\" and, thus, upon the relativity of\\n\\t\\t\\t\\tthe concept of \"time\" as such. The number \"ten\" is often\\n\\t\\t\\t\\tused in Arabic to denote \"a few\" (Razi)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "104",
    "NoteID": "88",
    "Body": "Signifying, in this context, \"We alone understand fully\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "106",
    "NoteID": "89",
    "Body": "Lit., \"leave it\" - the pronoun relating, by implication,\\n\\t\\t\\t\\tto the earth (Zamakhshari and Razi)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "107",
    "NoteID": "90",
    "Body": "In the eschatology of the Qur'an, the \"end of the world\"\\n\\t\\t\\t\\tdoes not signify an annihilation-i.e., reduction to\\n\\t\\t\\t\\tnothingness - of the physical universe but, rather, its\\n\\t\\t\\t\\tfundamental, cataclysmic transformation into something\\n\\t\\t\\t\\tthat men cannot now visualize. This is brought out in\\n\\t\\t\\t\\tmany allegorical allusions to the Last Day, e.g., in\\n\\t\\t\\t\\t 14:48 , which speaks of \"the Day when the earth shall be\\n\\t\\t\\t\\tchanged into another earth, as shall be the heavens\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "108",
    "NoteID": "91",
    "Body": "Lit., \"the caller in whom there will be no deviation (la\\n\\t\\t\\t\\t'iwaja lahu)\" - i.e., the summons to the Last Judgment."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "109",
    "NoteID": "92",
    "Body": "Regarding the Qur'anic concept of \"intercession\" on the\\n\\t\\t\\t\\tDay of Judgment, see note [7] on  10:3 . The \"word [of\\n\\t\\t\\t\\tfaith]\" referred to towards the end of the above verse is\\n\\t\\t\\t\\t- according to Ibn 'Abbas (as quoted by Baghawi) - a\\n\\t\\t\\t\\tmetonym for the belief that \"there is no deity save God\",\\n\\t\\t\\t\\ti.e., the realization of His oneness and uniqueness. See\\n\\t\\t\\t\\talso  19:87  and the corresponding note [74]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "110",
    "NoteID": "93",
    "Body": "For an explanation of this phrase - which occurs in\\n\\t\\t\\t\\texactly the same wording in  2:255 , {21: 28} and  22:76 \\n\\t\\t\\t\\tas well - see surah {2}, note [247]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "111",
    "NoteID": "94",
    "Body": "I.e., evildoing which has not been atoned for by\\n\\t\\t\\t\\trepentance before death (Razi). In this particular\\n\\t\\t\\t\\tcontext, it may be an allusion to the rejection of God's\\n\\t\\t\\t\\tguidance - His \"reminder\" - spoken of in verses {99-101}."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "112",
    "NoteID": "95",
    "Body": "Lit., \"no fear of [any] wrong\" - i.e., punishment for any\\n\\t\\t\\t\\tsin which he may have contemplated but not committed-\"and\\n\\t\\t\\t\\tneither of a diminution\", i.e., of his merit: cf. the\\n\\t\\t\\t\\ttwice-repeated statement in {16:96-97} that the righteous\\n\\t\\t\\t\\tshall be recompensed in the hereafter \"in accordance with\\n\\t\\t\\t\\tthe best that they ever did\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "113",
    "NoteID": "96",
    "Body": "As in verse {99} above - with which this passage connects\\n\\t\\t\\t\\t- the adverb kadhalika (\"thus\") refers to the method and\\n\\t\\t\\t\\tpurpose of the Qur'an."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "113",
    "NoteID": "97",
    "Body": "Lit., \"as an Arabic discourse (qur’an)\". See, in\\n\\t\\t\\t\\tparticular,  12:2 ,  13:37 ,  14:4  and  19:97 , as well\\n\\t\\t\\t\\tas the corresponding notes."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "113",
    "NoteID": "98",
    "Body": "Lit., \"so that they might be [or \"remain\"] God-conscious,\\n\\t\\t\\t\\tor that it create for them a remembrance\", i.e., of God.\\n\\t\\t\\t\\tThe verb ahdatha signifies \"he brought [something] into\\n\\t\\t\\t\\texistence\", i.e., newly or for the first time, while the\\n\\t\\t\\t\\tnoun dhikr denotes \"remembrance\" as well as the \"presence\\n\\t\\t\\t\\t[of something] in the mind\" (Raghib), i.e., awareness."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "114",
    "NoteID": "99",
    "Body": "Whenever the noun al-haqq is used as a designation of\\n\\t\\t\\t\\tGod, it signifies \"the Truth\" in the absolute, intrinsic\\n\\t\\t\\t\\tsense, eternally and immutably existing beyond the\\n\\t\\t\\t\\tephemeral, changing phenomena of His creation: hence,\\n\\t\\t\\t\\t\"the Ultimate Truth\". God’s attribute of al-malik, on the\\n\\t\\t\\t\\tother hand, denotes His absolute sway over all that\\n\\t\\t\\t\\texists and can, therefore, be suitably rendered as \"the\\n\\t\\t\\t\\tUltimate Sovereign\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "114",
    "NoteID": "100",
    "Body": "Lit., \"be not hasty with the Qur'an\" (see next note)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "114",
    "NoteID": "101",
    "Body": "Although it is very probable that - as most of the\\n\\t\\t\\t\\tclassical commentators point out - this exhortation was\\n\\t\\t\\t\\tin the first instance addressed to the Prophet Muhammad,\\n\\t\\t\\t\\tthere is no doubt that it applies to every person, at all\\n\\t\\t\\t\\ttimes, who reads the Qur’an. The idea underlying the\\n\\t\\t\\t\\tabove verse may be summed up thus: Since the Qur’an is\\n\\t\\t\\t\\tthe Word of God, all its component parts - phrases,\\n\\t\\t\\t\\tsentences, verses and surahs - form one integral,\\n\\t\\t\\t\\tcoordinated whole (cf. the last sentence of  25:32  and\\n\\t\\t\\t\\tthe corresponding note [27]). Hence, if one is really\\n\\t\\t\\t\\tintent on understanding the Qur’anic message, one must\\n\\t\\t\\t\\tbeware of a \"hasty approach\" - that is to say, of drawing\\n\\t\\t\\t\\thasty conclusions from isolated verses or sentences taken\\n\\t\\t\\t\\tout of their context - but should, rather, allow the\\n\\t\\t\\t\\twhole of the Qur'an to be revealed to one’s mind before\\n\\t\\t\\t\\tattempting to interpret singe aspects of its message.\\n\\t\\t\\t\\t(See also {75:16-19} and the corresponding notes.)"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "115",
    "NoteID": "102",
    "Body": "The relevant divine commandment - or, rather, warning -\\n\\t\\t\\t\\tis spelled out in verse {117}. The present passage\\n\\t\\t\\t\\tconnects with the statement in verse {99}, \"Thus do We\\n\\t\\t\\t\\trelate unto thee some of the stories of what happened in\\n\\t\\t\\t\\tthe past\", and is meant to show that negligence of\\n\\t\\t\\t\\tspiritual truths is one of the recurrent characteristics\\n\\t\\t\\t\\tof the human race (Razi), which is symbolized here - as\\n\\t\\t\\t\\tin many other places in the Qur'an - by Adam."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "116",
    "NoteID": "103",
    "Body": "See {2:30-34} and the corresponding notes, especially\\n\\t\\t\\t\\t[23], [25] and [26], as well as note [31] on  15:41 .\\n\\t\\t\\t\\tSince - as I have shown in those notes - the faculty of\\n\\t\\t\\t\\tconceptual thinking is man’s outstanding endowment, his\\n\\t\\t\\t\\t\"forgetting\" God’s commandment - resulting from a lack of\\n\\t\\t\\t\\tall \"firmness of purpose\" in the domain of ethics - is an\\n\\t\\t\\t\\tevidence of the moral weakness characteristic of the\\n\\t\\t\\t\\thuman race (cf.  4:28  - \"man has been created weak\"):\\n\\t\\t\\t\\tand this, in its turn, explains man s dependence on\\n\\t\\t\\t\\tunceasing divine guidance, as pointed out in verse {113}\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "117",
    "NoteID": "104",
    "Body": "Lit., \"so that thou wilt become unhappy\". Regarding the\\n\\t\\t\\t\\tsignificance of \"the garden spoken of here, see surah\\n\\t\\t\\t\\t{2}, note [27]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "118",
    "NoteID": "105",
    "Body": "Lit., \"be naked\": but in view of the statement in verse\\n\\t\\t\\t\\t{121} (as well as in {7: 22}) to the effect that only\\n\\t\\t\\t\\tafter their fall from grace did Adam and Eve become\\n\\t\\t\\t\\t\"conscious of their nakedness\", it is but logical to\\n\\t\\t\\t\\tassume that the words \"that thou shalt not... be naked\"\\n\\t\\t\\t\\thave a spiritual significance, implying that man, in his\\n\\t\\t\\t\\toriginal state of innocence, would not feel naked despite\\n\\t\\t\\t\\tall absence of clothing. (For the deeper implications of\\n\\t\\t\\t\\tthis allegory, see note [14] on  7:20 .)"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "120",
    "NoteID": "106",
    "Body": "This symbolic tree is designated in the Bible as \"the\\n\\t\\t\\t\\ttree of life\" and \"the tree of knowledge of good and\\n\\t\\t\\t\\tevil\" (Genesis ii, 9), while in the above Qur'anic\\n\\t\\t\\t\\taccount Satan speaks of it as \"the tree of life eternal\\n\\t\\t\\t\\t(al-khuld)\". Seeing that Adam and Eve did not achieve\\n\\t\\t\\t\\timmortality despite their tasting the forbidden fruit, it\\n\\t\\t\\t\\tis obvious that Satan's suggestion was, as it always is,\\n\\t\\t\\t\\tdeceptive. On the other hand, the Qur'an tells us nothing\\n\\t\\t\\t\\tabout the real nature of that \"tree\" beyond pointing out\\n\\t\\t\\t\\tthat it was Satan who described it - falsely - as \"the\\n\\t\\t\\t\\ttree of immortality\": and so we may assume that the\\n\\t\\t\\t\\tforbidden tree is simply an allegory of the limits which\\n\\t\\t\\t\\tthe Creator has set to man's desires and actions: limits\\n\\t\\t\\t\\tbeyond which he may not go without offending against his\\n\\t\\t\\t\\town, God-willed nature. Man's desire for immortality on\\n\\t\\t\\t\\tearth implies a wishful denial of death and resurrection,\\n\\t\\t\\t\\tand thus of the ultimate reality of what the Qur'an\\n\\t\\t\\t\\tdescribes as \"the hereafter\" or \"the life to come\"\\n\\t\\t\\t\\t(al-akhirah). This desire is intimately connected with\\n\\t\\t\\t\\tSatan's insinuation that it is within man's reach to\\n\\t\\t\\t\\tbecome the master of \"a kingdom that will never decay\":\\n\\t\\t\\t\\tin other words to become \"free\" of all limitations and\\n\\t\\t\\t\\tthus, in the last resort, of the very concept of God -\\n\\t\\t\\t\\tthe only concept which endows human life with real\\n\\t\\t\\t\\tmeaning and purpose."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "121",
    "NoteID": "107",
    "Body": "Regarding the symbolism of Adam and Eve's becoming\\n\\t\\t\\t\\t\"conscious of their nakedness\", see note [105] above as\\n\\t\\t\\t\\twell as the reference, in {7:2-27}, to \"the garment of\\n\\t\\t\\t\\tGod-consciousness\", the loss of which made man's\\n\\t\\t\\t\\tancestors \"aware of their nakedness\", i.e., of their\\n\\t\\t\\t\\tutter helplessness and, hence, their dependence on God."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "123",
    "NoteID": "108",
    "Body": "See surah {7}, note [16]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "124",
    "NoteID": "109",
    "Body": "I.e., sterile and spiritually narrow, without any real\\n\\t\\t\\t\\tmeaning or purpose: and this. as is indicated in the\\n\\t\\t\\t\\tsubsequent clause, will be a source of their suffering in\\n\\t\\t\\t\\tthe hereafter."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "127",
    "NoteID": "110",
    "Body": "Regarding this rendering of the phrase man asrafa, see\\n\\t\\t\\t\\tsurah {10}, note [21], in which I have discussed the\\n\\t\\t\\t\\tmeaning of the participial noun musrif, derived from the\\n\\t\\t\\t\\tsame verbal root."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "128",
    "NoteID": "111",
    "Body": "Lit., \"Is it, then, no guidance for them how many a\\n\\t\\t\\t\\tgeneration.. .\", etc. It is to be borne in mind that, in\\n\\t\\t\\t\\tQur'anic usage, the noun -tarn signifies not only \"a\\n\\t\\t\\t\\tgeneration\", but also - and rather more often-\"people\\n\\t\\t\\t\\tbelonging to one particular epoch\", i.e.. \"a\\n\\t\\t\\t\\tcivilization\" in the historical sense of this term."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "129",
    "NoteID": "112",
    "Body": "Lit., \"and a term set [by Him]\". This phrase, placed in\\n\\t\\t\\t\\tthe original at the end of the sentence, connects - as\\n\\t\\t\\t\\tmost of the classical commentators point out - with the\\n\\t\\t\\t\\topening clause of this verse, and has been rendered\\n\\t\\t\\t\\taccordingly."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "129",
    "NoteID": "113",
    "Body": "Cf.  10:11  and  16:61 ."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "130",
    "NoteID": "114",
    "Body": "Lit., \"at the sides [or \"extremities\"] of the day\". See\\n\\t\\t\\t\\tin this connection also  11:114  and the corresponding\\n\\t\\t\\t\\tnote [145]."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "131",
    "NoteID": "115",
    "Body": "Lit., \"groups [or \"kinds\"] of them\" (azwajan minhum).\\n\\t\\t\\t\\tAccording to most of the commentators, this relates to\\n\\t\\t\\t\\tthe deniers of the truth spoken of in the preceding\\n\\t\\t\\t\\tpassages; but since the above injunction has obviously a\\n\\t\\t\\t\\twider purport, condemning envy in general, I have\\n\\t\\t\\t\\trendered this expression as \"so many others\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "131",
    "NoteID": "116",
    "Body": "Implying that whatever God grants a person is an outcome\\n\\t\\t\\t\\tof divine wisdom and, therefore, truly appropriate to the\\n\\t\\t\\t\\tdestiny which God has decreed for that person.\\n\\t\\t\\t\\tAlternatively, the phrase may be understood as referring\\n\\t\\t\\t\\tto the life to come and the spiritual sustenance which\\n\\t\\t\\t\\tGod bestows upon the righteous."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "132",
    "NoteID": "117",
    "Body": "My interpolation of the words \"for Us\" is based on Razi’s\\n\\t\\t\\t\\tinterpretation of the above sentence: \"God makes it clear\\n\\t\\t\\t\\tthat He has enjoined this [i.e., prayer] upon men for\\n\\t\\t\\t\\ttheir own benefit alone, inasmuch as He Himself is\\n\\t\\t\\t\\tsublimely exalted above any [need of] benefits.\" In other\\n\\t\\t\\t\\twords, prayer must not be conceived as a kind of tribute\\n\\t\\t\\t\\tto a \"jealous God\" - as the Old Testament, in its present\\n\\t\\t\\t\\tcorrupted form, frequently describes Him - but solely as\\n\\t\\t\\t\\ta spiritual benefit for the person who prays."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "132",
    "NoteID": "118",
    "Body": "Lit., \"to God-consciousness\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "133",
    "NoteID": "119",
    "Body": "I.e., in proof of his prophetic mission: cf.  6:109  and\\n\\t\\t\\t\\tmany other instances in which the deniers of the truth\\n\\t\\t\\t\\tare spoken of as making their belief in the Qur'anic\\n\\t\\t\\t\\tmessage dependent on tangible \"miracles\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "133",
    "NoteID": "120",
    "Body": "I.e., \"Does not the Qur'an express the same fundamental\\n\\t\\t\\t\\ttruths as were expressed in the revelations granted to\\n\\t\\t\\t\\tthe earlier prophets?\" Beyond this, the above rhetorical\\n\\t\\t\\t\\tquestion contains an allusion to the predictions of the\\n\\t\\t\\t\\tadvent of Muhammad to be found in the earlier scriptures,\\n\\t\\t\\t\\te.g., in Deuteronomy xviii, 15 and 18 (discussed in my\\n\\t\\t\\t\\tnote [33] on  2:42 ) or in John xiv, 16, xv, 26 and xvi,\\n\\t\\t\\t\\t7, where Jesus speaks of the \"Comforter\" who is to come\\n\\t\\t\\t\\tafter him. (Regarding this latter prediction, see my note\\n\\t\\t\\t\\ton  61:6 .)"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "134",
    "NoteID": "121",
    "Body": "Cf.  6:131 ,  15:4  or {26:208-209}, where it is stressed\\n\\t\\t\\t\\tthat God never punishes man for any wrong committed in\\n\\t\\t\\t\\tignorance of what constitutes right and wrong in the\\n\\t\\t\\t\\tmoral sense - i.e., before making it possible for him to\\n\\t\\t\\t\\tavail himself of divine guidance."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "135",
    "NoteID": "122",
    "Body": "I.e., human nature is such that no man, whatever his\\n\\t\\t\\t\\tpersuasion or condition, can ever cease to hope that the\\n\\t\\t\\t\\tway of life chosen by him will prove to have been the\\n\\t\\t\\t\\tright way."
  }
]
