[
  {
    "SurahNumber": "74",
    "AyahNumber": "1",
    "NoteID": "5778",
    "Body": "In these wonderful early verses there is a double thread\\n\\t\\t\\t\\tof thought: (1) A particular occasion or person is\\n\\t\\t\\t\\treferred to; (2) a general spiritual lesson is taught. As\\n\\t\\t\\t\\tto (1), the Prophet was now past the stage of personal\\n\\t\\t\\t\\tcontemplation, lying down or sitting in his mantle; he\\n\\t\\t\\t\\twas now to go forth boldly to deliver his Message and\\n\\t\\t\\t\\tpublicly proclaim the Lord: his heart had always been\\n\\t\\t\\t\\tpurified, but now all his outward doings must be\\n\\t\\t\\t\\tdedicated to Allah, and conventional respect for\\n\\t\\t\\t\\tancestral customs or worship must be thrown aside; his\\n\\t\\t\\t\\twork as a Messenger was the most generous gift that could\\n\\t\\t\\t\\tflow from his personality, but no reward or appreciation\\n\\t\\t\\t\\twas to be expected from his people, but quite the\\n\\t\\t\\t\\tcontrary; there would be much call on his patience, but\\n\\t\\t\\t\\this contentment would arise from the good pleasure of\\n\\t\\t\\t\\tAllah. As to (2), similar stages arise in a minor degree\\n\\t\\t\\t\\tin the life of every good man, for which the Prophet's\\n\\t\\t\\t\\tlife is to be a universal pattern."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "4",
    "NoteID": "5779",
    "Body": "Possibly, in its immediate application, there is a\\n\\t\\t\\t\\treference to the dirt and filth which the Pagans used to\\n\\t\\t\\t\\tthrow at the Prophet to insult and persecute him."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "5",
    "NoteID": "5780",
    "Body": "Rujz or Rijz: abomination: usually understood to refer to\\n\\t\\t\\t\\tidolatry. It is even possible that there was an idol\\n\\t\\t\\t\\tcalled Rujz. But it has a wider signification, as\\n\\t\\t\\t\\tincluding a mental state opposed to true worship, a state\\n\\t\\t\\t\\tof doubt or indecision."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "6",
    "NoteID": "5781",
    "Body": "The legal and commercial formula is that you give in\\n\\t\\t\\t\\torder to receive. And usually you expect to receive what\\n\\t\\t\\t\\tis worth to you a little more than you give. The\\n\\t\\t\\t\\tspiritual consideration is that you give, but expect\\n\\t\\t\\t\\tnothing from the receiver. You serve Allah and Allah's\\n\\t\\t\\t\\tcreatures."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "7",
    "NoteID": "5782",
    "Body": "Our zeal for Allah's Cause itself requires that we should\\n\\t\\t\\t\\tnot be impatient, and that we should show constancy in\\n\\t\\t\\t\\tour efforts for His Cause. For we have faith, and we know\\n\\t\\t\\t\\tthat He is All-Good, All-Wise, and All-Powerful, and\\n\\t\\t\\t\\teverything will ultimately be right."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "9",
    "NoteID": "5783",
    "Body": "The Sinner's course is now shown in contrast to the\\n\\t\\t\\t\\tSeeker's. The Sinner may be self-complacent now: but what\\n\\t\\t\\t\\twill be his position when the Reckoning comes? Not easy,\\n\\t\\t\\t\\tindeed a Day of Distress!"
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "11",
    "NoteID": "5784",
    "Body": "The question of Justice and Punishment to men is for\\n\\t\\t\\t\\tAllah alone. For man at his best can see only one side of\\n\\t\\t\\t\\ttruth, and only Allah is All-Knowing. He alone can judge\\n\\t\\t\\t\\tthe limits of Justice and Mercy."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "11",
    "NoteID": "5785",
    "Body": "Man's adventitious advantages-wealth, power, position,\\n\\t\\t\\t\\ttalents-are not due to his own merits. They are gifts\\n\\t\\t\\t\\tfrom Allah, Who created him. In himself he came bare and\\n\\t\\t\\t\\talone."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "13",
    "NoteID": "5786",
    "Body": "The great ones of the earth may have wealth, a large\\n\\t\\t\\t\\tfollowing, sons by their side to defend them and do their\\n\\t\\t\\t\\tbidding and man-power to help them in their battles. Life\\n\\t\\t\\t\\tmay be smooth and agreeable to them. But their\\n\\t\\t\\t\\tresponsibility is to Allah."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "15",
    "NoteID": "5787",
    "Body": "The Sinner takes Allah's gifts as if they were his right.\\n\\t\\t\\t\\tThe more he gets, the more is he greedy. Yet to Allah's\\n\\t\\t\\t\\tSigns and revelations he is wilfully deaf or even openly\\n\\t\\t\\t\\trebellious. But he is only preparing the way for his own\\n\\t\\t\\t\\tundoing."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "17",
    "NoteID": "5788",
    "Body": "\"A mount of calamities\" or disasters: may be understood\\n\\t\\t\\t\\tas a phrase for cumulative disasters."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "19",
    "NoteID": "5789",
    "Body": "Cf. li. 10: \"Woe to the falsehood-mongers!\""
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "24",
    "NoteID": "5790",
    "Body": "The Commentators understand the reference to be to Walid\\n\\t\\t\\t\\tibn Mugaira, who was a wealthy Sybarite, Pagan to the\\n\\t\\t\\t\\tcore, and an inveterate enemy to the holy Prophet. He and\\n\\t\\t\\t\\tAbu Jahl did all they could, from the beginning of the\\n\\t\\t\\t\\tpreaching of Islam, to abuse and persecute the Preacher,\\n\\t\\t\\t\\tto run down his doctrine, and to injure those who\\n\\t\\t\\t\\tbelieved in it. But the meaning for us is much wider.\\n\\t\\t\\t\\tThere are Walids in all ages. They cannot understand\\n\\t\\t\\t\\tdivine inspiration, and seek to explain its wonderful\\n\\t\\t\\t\\tinfluence over the lives of men by some such unmeaning\\n\\t\\t\\t\\tformula as \"magic\". The eternal Hope is to them mere\\n\\t\\t\\t\\thuman delusion!"
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "26",
    "NoteID": "5791",
    "Body": "The Sinner's perversity can only end in the Fire of\\n\\t\\t\\t\\tPunishment. It enters his very being. See next note."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "28",
    "NoteID": "5792",
    "Body": "He is in a state in which he neither lives nor dies\\n\\t\\t\\t\\t(lxxxvii. 13). Looked at in another way, the things that\\n\\t\\t\\t\\tin a good man are meant to last and grow, are for the\\n\\t\\t\\t\\tsinner destroyed, and no part of his nature is left\\n\\t\\t\\t\\tuntouched. The brightness of his very manhood is darkened\\n\\t\\t\\t\\tand extinguished by sin."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "30",
    "NoteID": "5793",
    "Body": "The figure nineteen refers to angels appointed to guard\\n\\t\\t\\t\\tHell. See verse 31 below and the corresponding note."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "5794",
    "Body": "Cf. lxvi. 6, and n. 5540. There was a great volume of\\n\\t\\t\\t\\tangelology in the religious literature of the People of\\n\\t\\t\\t\\tthe Book (i.e., the Jews and Christians) to whom (among\\n\\t\\t\\t\\tothers) an appeal is made in this verse. The Essenes, a\\n\\t\\t\\t\\tJewish brotherhood with highly spiritual ideas; to which\\n\\t\\t\\t\\tperhaps the prophet Jesus himself belonged, had an\\n\\t\\t\\t\\textensive literature of angelology. In the Midrash also,\\n\\t\\t\\t\\twhich was a Jewish school of exegesis and mystical\\n\\t\\t\\t\\tinterpretation, there was much said about angels. The\\n\\t\\t\\t\\tEastern Christian sects contemporary with the birth of\\n\\t\\t\\t\\tIslam had borrowed and developed many of these ideas, and\\n\\t\\t\\t\\ttheir mystics owed much to the Gnostics and the Persian\\n\\t\\t\\t\\tapocalyptic systems. In the New Testament the relation of\\n\\t\\t\\t\\tthe angels with Fire is referred to more than once. In\\n\\t\\t\\t\\tRev. ix. 11 we have \"the angel of the bottomless pit,\\n\\t\\t\\t\\twhose naine in the Hebrew tongue is Abaddon, but in the\\n\\t\\t\\t\\tGreek tongue hath his name Apollyon\". In Rev. xiv. 18\\n\\t\\t\\t\\tthere is an \"angel which had power over fire\", and in\\n\\t\\t\\t\\tRev. xvi. 8 an angel has \"power ... given unto him to\\n\\t\\t\\t\\tscorch men with fire\". In the Old Testament (Daniel vii.\\n\\t\\t\\t\\t9-10) the essence of all angels is fire: thousand\\n\\t\\t\\t\\tthousands of them issued as a fiery stream from before\\n\\t\\t\\t\\tthe Ancient of Days, whose \"throne was like the fiery\\n\\t\\t\\t\\tflame, and His wheels as burning fire\"."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "5795",
    "Body": "The significance of numbers is a favourite theme with\\n\\t\\t\\t\\tsome writers, but I lay no stress on it. In Christian\\n\\t\\t\\t\\ttheology the number of the Beast, 666, in Rev. xiii. 18\\n\\t\\t\\t\\thas given rise to much controversy, and may refer only to\\n\\t\\t\\t\\tthe numerical value of the letters in the name of the\\n\\t\\t\\t\\tRoman Emperor Nero. In our own literature I think that we\\n\\t\\t\\t\\tought to avoid too much insistence on speculative\\n\\t\\t\\t\\tconjectures."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "5796",
    "Body": "There are four classes of people mentioned here. (1) The\\n\\t\\t\\t\\tMuslims will have their faith increased, because they\\n\\t\\t\\t\\tbelieve that all revelation is from Allah Most Merciful,\\n\\t\\t\\t\\tand all His forces will work in their favour. (2) The\\n\\t\\t\\t\\tPeople of the Book, those who had received previous\\n\\t\\t\\t\\trevelations of an analogous character, the Jews and\\n\\t\\t\\t\\tChristians, had numerous sects disputing with each other\\n\\t\\t\\t\\ton minute points of doctrine; but they will now, if they\\n\\t\\t\\t\\tbelieve, find rest from controversies in a broad\\n\\t\\t\\t\\tunderstanding of scripture. (3) Those in whose hearts is\\n\\t\\t\\t\\ta disease (see ii. 8-10, notes 33-34), the insincere\\n\\t\\t\\t\\tones, the hypocrites, will only be mystified, because\\n\\t\\t\\t\\tthey believe nothing and have rejected the grace and\\n\\t\\t\\t\\tmercy of Allah. (4) The Unbelievers have frankly done the\\n\\t\\t\\t\\tsame and must suffer similar consequences."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "31",
    "NoteID": "5797",
    "Body": "It is a necessary consequence of moral responsibility and\\n\\t\\t\\t\\tfreedom of choice in man, that he should be left free to\\n\\t\\t\\t\\tstray if he chooses to do so, in spite of all the warning\\n\\t\\t\\t\\tand the instruction he receives. Allah's channels of\\n\\t\\t\\t\\twarning and instruction-his spiritual forces-are\\n\\t\\t\\t\\tinfinite, as are His powers. No man can know them. But\\n\\t\\t\\t\\tthis warning or reminder is addressed to all mankind. All\\n\\t\\t\\t\\tthings are referred to Allah. But we must not attribute\\n\\t\\t\\t\\tevil to Him. In iv. 79 we are expressly told that the\\n\\t\\t\\t\\tgood comes from Allah, and the evil from ourselves."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "32",
    "NoteID": "5798",
    "Body": "An oath in human speech calls in evidence something\\n\\t\\t\\t\\tsacred in the heart of man. In Allah's Message, also,\\n\\t\\t\\t\\twhen delivered in human language, solemn emphasis is\\n\\t\\t\\t\\tindicated by an appeal to something striking among the\\n\\t\\t\\t\\tSigns of Allah, which will go straight to the human heart\\n\\t\\t\\t\\twhich is addressed. In each case the symbol of the appeal\\n\\t\\t\\t\\thas reference to the particular point enforced in the\\n\\t\\t\\t\\targument. Here we are asked to contemplate three\\n\\t\\t\\t\\twonderful phenomena, and they lead up to the conclusion\\n\\t\\t\\t\\tin verse 38. (1) The moon, next after the sun, is the\\n\\t\\t\\t\\tmost striking luminary to our sight. Its reflected light\\n\\t\\t\\t\\thas for us even a greater mystery than the direct light\\n\\t\\t\\t\\tof the sun, which looks to us like pure fire. The moon\\n\\t\\t\\t\\twas worshipped as a deity in times of darkness. But in\\n\\t\\t\\t\\treality, though she rules the night, her rays are only\\n\\t\\t\\t\\treflections, and are wanting in warmth and vitality. So\\n\\t\\t\\t\\tevery soul which looks up to a mere creature of Allah for\\n\\t\\t\\t\\ta sort of vicarious salvation is in spiritual darkness or\\n\\t\\t\\t\\terror; for the true source of spiritual light and life is\\n\\t\\t\\t\\tAllah, and Allah alone. For (2) the Night and (3) the\\n\\t\\t\\t\\tDawn, see the following note."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "33",
    "NoteID": "5799",
    "Body": "(2) The Night when it is illuminated by the Moon is light\\n\\t\\t\\t\\tin a sense, but it is really dark and must give place to\\n\\t\\t\\t\\t(3) the Dawn when it comes, as the harbinger of the Sun.\\n\\t\\t\\t\\tSo in spiritual matters, when every soul realises its own\\n\\t\\t\\t\\tresponsibility, it will look less and less to reflected\\n\\t\\t\\t\\tlights, and through the beauty of a dawn-like awakening,\\n\\t\\t\\t\\twill be prepared more and more for the splendour of the\\n\\t\\t\\t\\tlight of Allah Himself, the goal of the Heaven of our\\n\\t\\t\\t\\tdreams."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "35",
    "NoteID": "5800",
    "Body": "\"This is but one,\" etc. There are numerous Signs of\\n\\t\\t\\t\\tAllah, of which Judgment is one, and one of the mightiest\\n\\t\\t\\t\\tportents. Or the reference may be to the waning of the\\n\\t\\t\\t\\tMoon, the decline of the night, and the glorious sunrise,\\n\\t\\t\\t\\tas tokens or symbols of the world renewed when the\\n\\t\\t\\t\\tpresent transitory world passes away. According to some\\n\\t\\t\\t\\tcommentators \"This\" here refers to Hell."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "37",
    "NoteID": "5801",
    "Body": "Three interpretations are possible. (1) Those pressing\\n\\t\\t\\t\\tforward may be the Righteous, and those following behind\\n\\t\\t\\t\\tmay be the laggards, the Unbelievers, who reject Allah's\\n\\t\\t\\t\\tlove, care, and mercy. (2) Men of two kinds of\\n\\t\\t\\t\\ttemperament may be referred to: those who are always in\\n\\t\\t\\t\\tthe van and those who are always in the rear. Allah's\\n\\t\\t\\t\\tMessage is open to both. But there may be a danger to\\n\\t\\t\\t\\tboth: in the one case, over-confindence, or hope in wrong\\n\\t\\t\\t\\tthings: in the other case missing great opportunities so\\n\\t\\t\\t\\tthat their spiritual lives may be \"bound in shallows and\\n\\t\\t\\t\\tin miseries\". Extremes should be avoided. (3) Or it may\\n\\t\\t\\t\\tmean that the warning is effective only for those willing\\n\\t\\t\\t\\tto move forwards or backwards, as the case may be, but is\\n\\t\\t\\t\\tlost on the inert or the lethargic. For our moral and\\n\\t\\t\\t\\tspiritual progress, we have in some cases to go forwards,\\n\\t\\t\\t\\tbut in some cases we have to retreat from false\\n\\t\\t\\t\\tpositions. The hopeless case is that of the obstinate\\n\\t\\t\\t\\tman, whose heart is so dead that he dares not advance to\\n\\t\\t\\t\\tthe right or withdraw from the wrong."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "38",
    "NoteID": "5802",
    "Body": "Cf. lii. 21. Man cannot shift his responsibility to\\n\\t\\t\\t\\tvicarious saviours or saints. His redemption depends upon\\n\\t\\t\\t\\tthe grace of Allah, for which he should constantly and\\n\\t\\t\\t\\twhole-heartedly strive by means of right conduct. If he\\n\\t\\t\\t\\tdoes so he will be redeemed and he will join the\\n\\t\\t\\t\\tCompanions of the Right Hand."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "39",
    "NoteID": "5803",
    "Body": "Cf. n. 5223 to lvi. 3, and see lvi. 27-38. The Companions\\n\\t\\t\\t\\tof the Right Hand will be the Righteous or the Blessed in\\n\\t\\t\\t\\tthe Hereafter. Their grounds of merit will be Prayer,\\n\\t\\t\\t\\tCharity, Earnestness, and Faith in Allah's just Judgment:\\n\\t\\t\\t\\tall of which are within the reach of the humblest Seeker.\\n\\t\\t\\t\\tThey are not separate acts or virtues, but are all\\n\\t\\t\\t\\tinter-connected. At Judgment, the pledge of their soul\\n\\t\\t\\t\\twill be redeemed by Allah's Grace at the Taking of the\\n\\t\\t\\t\\tAccount."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "47",
    "NoteID": "5804",
    "Body": "Cf. xv. 99, and n. 2018. The Hour that is Certain is\\n\\t\\t\\t\\tusually taken to the Death."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "49",
    "NoteID": "5805",
    "Body": "If the Day of Judgment is inevitable, it is strange that\\n\\t\\t\\t\\tmen should not heed a plain warning, but go on as if they\\n\\t\\t\\t\\twere thoughtless and obstinate asses stampeding from a\\n\\t\\t\\t\\tlion. Instead of heeding the warning, they try to avoid\\n\\t\\t\\t\\tit. They are frightened at Allah's Word."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "52",
    "NoteID": "5806",
    "Body": "Cf. xvii. 93: \"Until thou send down to us a book, that we\\n\\t\\t\\t\\tcould read.\" The Unbelievers pretend in ridicule that\\n\\t\\t\\t\\tthey would believe if a special message written on open\\n\\t\\t\\t\\tscrolls and addressed to them severally were brought to\\n\\t\\t\\t\\tthem by a miracle! There is a disease in their hearts and\\n\\t\\t\\t\\tunderstandings. The Teacher's warning is plain, and\\n\\t\\t\\t\\tenough for any reasonable man who has the will to seek\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "55",
    "NoteID": "5807",
    "Body": "The Qur-an itself is the admonition-the latest among the\\n\\t\\t\\t\\trevealed Books of Allah. If man has the will to learn, he\\n\\t\\t\\t\\twill keep the Message always before Him, and Allah's\\n\\t\\t\\t\\tgrace will help him to carry it out in his conduct."
  },
  {
    "SurahNumber": "74",
    "AyahNumber": "56",
    "NoteID": "5808",
    "Body": "Righteousness as well as Forgiveness have their source in\\n\\t\\t\\t\\tAllah's Will. Man's Righteousness has no meaning except\\n\\t\\t\\t\\tin relation to the universal Will. For Taqwa see n. 26 to\\n\\t\\t\\t\\tii. 2. If we take the word here in the sense of \"the fear\\n\\t\\t\\t\\tof Allah\", the translation would be: \"He alone is worthy\\n\\t\\t\\t\\tto be feared, and He alone is entitled to grant\\n\\t\\t\\t\\tForgiveness.\""
  }
]
