[
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "1",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said \"Someone who\\n\\t\\t\\t\\tdoes jihad in the way of Allah is like someone who fasts\\n\\t\\t\\t\\tand prays constantly and who does not slacken from his\\n\\t\\t\\t\\tprayer and fasting until he returns.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "2",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Allah\\n\\t\\t\\t\\tguarantees either the Garden or a safe return to his home\\n\\t\\t\\t\\twith whatever he has obtained of reward or booty, for the\\n\\t\\t\\t\\tone who does jihad in His way, if it is solely jihad and\\n\\t\\t\\t\\ttrust in his promise that brings him out of his house.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "3",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAbu Salih as-Samman from Abu Hurayra that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Horses are a reward for one man, a protection for\\n\\t\\t\\t\\tanother, a burden for another. The one who has them as a\\n\\t\\t\\t\\treward is the one who dedicates them for use in the way\\n\\t\\t\\t\\tof Allah, and tethers them in a meadow or grassland.\\n\\t\\t\\t\\tWhatever the horse enjoys of the grassland or meadow in\\n\\t\\t\\t\\tthe length of its tether are good deeds for him. If it\\n\\t\\t\\t\\tbreaks its tether and goes over a hillock or two, its\\n\\t\\t\\t\\ttracks and droppings are good deeds for him. If it\\n\\t\\t\\t\\tcrosses a river and drinks from it while he did not mean\\n\\t\\t\\t\\tto allow it to drink it, that counts as good deeds for\\n\\t\\t\\t\\thim, and the horse is a reward for him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAnother man uses his horse to gain self reliance and\\n\\t\\t\\t\\tup-standingness and does not forget Allah's right on\\n\\t\\t\\t\\ttheir necks and backs (i.e. he does not ill treat or\\n\\t\\t\\t\\tover-work them). Horses are a protection for him .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAnother man uses them out of pride to show them off and\\n\\t\\t\\t\\tin hostility to the people of Islam. They are a burden on\\n\\t\\t\\t\\tthat man.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, was asked about donkeys, and he said, \"Nothing has\\n\\t\\t\\t\\tbeen revealed to me about them except this single\\n\\t\\t\\t\\tall-inclusive ayat, 'Whoever does an atom of good will\\n\\t\\t\\t\\tsee it, and whoever does an atom of evil, will see it.' \"\\n\\t\\t\\t\\t(Sura 99 Ayats 7,8) .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "4",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Abdullah ibn Abd ar-Rahman ibn\\n\\t\\t\\t\\tMamar al-Ansari that Ata ibn Yasar said that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Shall I tell you who has the best degree\\n\\t\\t\\t\\tamong people? A man who takes the rein of his horse to do\\n\\t\\t\\t\\tjihad in the way of Allah. Shall I tell you who has the\\n\\t\\t\\t\\tbest degree among people after him? A man who lives alone\\n\\t\\t\\t\\twith a few sheep, performs the prayer, pays the zakat,\\n\\t\\t\\t\\tand worships Allah without associating anything with\\n\\t\\t\\t\\thim.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "5",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t''Ubada ibn al-Walid ibn Ubada ibn as-Samit informed me\\n\\t\\t\\t\\tfrom his father that his grandfather (Ubada) said, 'We\\n\\t\\t\\t\\tmade a contract with the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, to hear and obey in ease\\n\\t\\t\\t\\tand hardship, enthusiasm and reluctance, and not to\\n\\t\\t\\t\\tdispute with people in authority and to speak or\\n\\t\\t\\t\\testablish the truth wherever we were without worrying\\n\\t\\t\\t\\tabout criticism.'\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "6",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Zayd ibn Aslam had\\n\\t\\t\\t\\tsaid that Ubayda ibn al-Jarrah had written to Umar ibn\\n\\t\\t\\t\\tal-Khattab mentioning to him a great array of Byzantine\\n\\t\\t\\t\\ttroops and the anxiety they were causing him. Umar ibn\\n\\t\\t\\t\\tal-Khattab wrote in reply to him, \"Whatever hardship\\n\\t\\t\\t\\tbefalls a believing slave, Allah will make an opening for\\n\\t\\t\\t\\thim after it, and a hardship will not overcome two eases.\\n\\t\\t\\t\\tAllah the Exalted says in His Book, 'O you who trust, be\\n\\t\\t\\t\\tpatient, and vie in patience; be steadfast and fear\\n\\t\\t\\t\\tAllah, perhaps you will profit.' \" (Sura 3 ayat 200).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "7",
    "sectionHeading": "Prohibition against Travelling with the Qur'an in Enemy Territory",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade travelling with a\\n\\t\\t\\t\\tQur'an in the land of the enemy. Malik commented, \"That\\n\\t\\t\\t\\tis out of fear that the enemy will get hold of it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "8",
    "sectionHeading": "Prohibition against Killing Women and Children in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that a son\\n\\t\\t\\t\\tof Kab ibn Malik (Malik believed that ibn Shihab said it\\n\\t\\t\\t\\twas Abd ar-Rahman ibn Kab) said, \"The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, forbade those\\n\\t\\t\\t\\twho fought ibn Abi Huqayq (a treacherous jew from Madina)\\n\\t\\t\\t\\tto kill women and children. He said that one of the men\\n\\t\\t\\t\\tfighting had said, 'The wife of ibn Abi Huqayq began\\n\\t\\t\\t\\tscreaming and I repeatedly raised my sword against her.\\n\\t\\t\\t\\tThen I would remember the prohibition of the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, so I\\n\\t\\t\\t\\twould stop. Had it not been for that, we would have been\\n\\t\\t\\t\\trid of her.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "9",
    "sectionHeading": "Prohibition against Killing Women and Children in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Ibn Umar\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, saw the corpse of a woman who had been\\n\\t\\t\\t\\tslain in one of the raids, and he disapproved of it and\\n\\t\\t\\t\\tforbade the killing of women and children.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "10",
    "sectionHeading": "Prohibition against Killing Women and Children in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAbu Bakr as-Siddiq was sending armies to ash-Sham. He\\n\\t\\t\\t\\twent for a walk with Yazid ibn Abi Sufyan who was the\\n\\t\\t\\t\\tcommander of one of the battalions. It is claimed that\\n\\t\\t\\t\\tYazid said to Abu Bakr, \"Will you ride or shall I get\\n\\t\\t\\t\\tdown?\" Abu Bakrsaid, \"I will not ride and you will not\\n\\t\\t\\t\\tget down. I intend these steps of mine to be in the way\\n\\t\\t\\t\\tof Allah.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThen Abu Bakr advised Yazid, \"You will find a people who\\n\\t\\t\\t\\tclaim to have totally given themselves to Allah. Leave\\n\\t\\t\\t\\tthem to what they claim to have given themselves. You\\n\\t\\t\\t\\twill find a people who have shaved the middle of their\\n\\t\\t\\t\\theads, strike what they have shaved with the sword.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"I advise you ten things: Do not kill women or children\\n\\t\\t\\t\\tor an aged, infirm person. Do not cut down fruit-bearing\\n\\t\\t\\t\\ttrees. Do not destroy an inhabited place. Do not\\n\\t\\t\\t\\tslaughter sheep or camels except for food. Do not burn\\n\\t\\t\\t\\tbees and do not scatter them. Do not steal from the\\n\\t\\t\\t\\tbooty, and do not be cowardly.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "11",
    "sectionHeading": "Prohibition against Killing Women and Children in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn Abd al-Aziz wrote to one of his governors, \"It\\n\\t\\t\\t\\thas been passed down to us that when the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, sent out\\n\\t\\t\\t\\ta raiding party, he would say to them, 'Make your raids\\n\\t\\t\\t\\tin the name of Allah in the way of Allah. Fight whoever\\n\\t\\t\\t\\tdenies Allah. Do not steal from the booty, and do not act\\n\\t\\t\\t\\ttreacherously. Do not mutilate and do not kill children.'\\n\\t\\t\\t\\tSay the same to your armies and raiding parties, Allah\\n\\t\\t\\t\\twilling. Peace be upon you.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "12",
    "sectionHeading": "Fulfilling Safe Conduct",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from a man of Kufa that\\n\\t\\t\\t\\tUmar ibn al-Khattab wrote to a lieutenant of an army\\n\\t\\t\\t\\twhich he had sent out, \"I have heard that it is the habit\\n\\t\\t\\t\\tof some of your men to chase an unbeliever till he takes\\n\\t\\t\\t\\trefuge in a high place. Then one man tells him in Persian\\n\\t\\t\\t\\tnot to be afraid, and when he comes up to him, he kills\\n\\t\\t\\t\\thim. By He in whose hand my self is, if I knew someone\\n\\t\\t\\t\\twho had done that, I would strike off his head.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, I heard Malik say, \"This tradition is not\\n\\t\\t\\t\\tunanimously agreed upon, so one does not act on it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik when asked whether safe conduct promised by gesture\\n\\t\\t\\t\\thad the same status as that promised by speech, said,\\n\\t\\t\\t\\t\"Yes. I think that one can request an army not to kill\\n\\t\\t\\t\\tsomeone by gesturing for safe conduct, because as far as\\n\\t\\t\\t\\tI am concerned, gesture has the same status as speech. I\\n\\t\\t\\t\\thave heard that Abdullah ibn Abbas said, 'There is no\\n\\t\\t\\t\\tpeople who betray a pledge, but that Allah gives their\\n\\t\\t\\t\\tenemies power over them.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "13",
    "sectionHeading": "Giving in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that when\\n\\t\\t\\t\\tAbdullah ibn Umar gave something in the way of Allah, he\\n\\t\\t\\t\\twould say to its owner, \"When you reach Wadi'l-Qura, (on\\n\\t\\t\\t\\tthe outskirts of Madina) then it is your affair.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "14",
    "sectionHeading": "Giving in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab used to say, \"When a man is given\\n\\t\\t\\t\\tsomething to use in a military expedition, and he brings\\n\\t\\t\\t\\tit to the battlefield, it is his.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who pledged himself to go on\\n\\t\\t\\t\\ta military campaign, equipped himself,and when he wanted\\n\\t\\t\\t\\tto go out, one or both of his parents prevented him. He\\n\\t\\t\\t\\tsaid, \"He should not contradict them. Let him put it off\\n\\t\\t\\t\\tfor another year. As for the equipment, I think that he\\n\\t\\t\\t\\tshould store it until he needs it. If he fears that it\\n\\t\\t\\t\\twill spoil, let him sell it and keep its price so that he\\n\\t\\t\\t\\tcan readily buy what is needed fora military expedition.\\n\\t\\t\\t\\tIf he is well-to-do, he will find the like of his\\n\\t\\t\\t\\tequipment when he goes out, so let him do what he likes\\n\\t\\t\\t\\twith his equipment.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "15",
    "sectionHeading": "Booty from War in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, sent a raiding party which included\\n\\t\\t\\t\\tAbdullah ibn Umar near Najd. They plundered many camels\\n\\t\\t\\t\\tand their portions were twelve or eleven camels each.\\n\\t\\t\\t\\tThey divided it up camel by camel.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "16",
    "sectionHeading": "Booty from War in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the heard Said ibn al-Musayyab say, \"When people in\\n\\t\\t\\t\\tmilitary expeditions divided the spoils, they made a\\n\\t\\t\\t\\tcamel equal to ten sheep.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about the paid labourer in military\\n\\t\\t\\t\\texpeditions, \"If he is present at the battle and is with\\n\\t\\t\\t\\tthe people in the battle and he is a free man, he has his\\n\\t\\t\\t\\tshare. If he is not present, he has no share.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik summed up, \"I think that the booty is only divided\\n\\t\\t\\t\\tamong free men who have been present at the battle. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "16",
    "sectionHeading": "Things on Which the Tax of One Fifth (Khumus) is Not Obligatory",
    "text": "<p>\\n\\t\\t\\t\\tMalik said about enemy soldiers who were found on the\\n\\t\\t\\t\\tseashore of a Muslim land, and they claimed that they\\n\\t\\t\\t\\twere merchants and that the sea had driven them ashore,\\n\\t\\t\\t\\twhile the Muslims were not able to verify any of that\\n\\t\\t\\t\\texcept that their ships were damaged, or they were\\n\\t\\t\\t\\tthirsty and had disembarked without the permission of the\\n\\t\\t\\t\\tMuslims, \"I think that it is up to the imam to give his\\n\\t\\t\\t\\topinion about them, and I do not think that the tax of\\n\\t\\t\\t\\tone fifth is taken from them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "16",
    "sectionHeading": "What It is Permissible for the Muslims to Eat Before the Spoils are Divided",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"I do not see that there is any harm in the\\n\\t\\t\\t\\tMuslims eating whatever food they come across in enemy\\n\\t\\t\\t\\tterritory before the spoils are divided.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I think that any camels, cattle and sheep\\n\\t\\t\\t\\t(taken as booty) are considered as food which the Muslims\\n\\t\\t\\t\\tcan eat in enemy territory. If they could not be eaten\\n\\t\\t\\t\\tuntil the people had gathered for the division and the\\n\\t\\t\\t\\tspoils had been distributed among them, that would be\\n\\t\\t\\t\\tharmful for the army. I do not see any objection to\\n\\t\\t\\t\\teating such things within acceptable limits. I do not\\n\\t\\t\\t\\tthink, however, that anyone should store up any of it to\\n\\t\\t\\t\\ttake back to his family.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked whether it was proper for a man who\\n\\t\\t\\t\\tobtained food in enemy territory and ate some of it and\\n\\t\\t\\t\\tmade provision so that there was some of it left over to\\n\\t\\t\\t\\tkeep and eat with his family, or to sell before he had\\n\\t\\t\\t\\tcome to his country and make use of its price. He said,\\n\\t\\t\\t\\t\"If he sells it while he is on a military expedition, I\\n\\t\\t\\t\\tthink that he should put its price into the booty of the\\n\\t\\t\\t\\tMuslims. If he takes it back to his country, I see no\\n\\t\\t\\t\\tobjection to his eating it and using it if it is a small\\n\\t\\t\\t\\tinsignificant thing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "17",
    "sectionHeading": "Returning to the Owner What has been Captured by the Enemy Before the  Spoils are Divided",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that it reached him that a\\n\\t\\t\\t\\tslave of Abdullah ibn Umar escaped and one of his horses\\n\\t\\t\\t\\twandered off, and the idol worshippers seized them. Then\\n\\t\\t\\t\\tthe Muslims recaptured them, and they were returned to\\n\\t\\t\\t\\tAbdullah ibn Umar, before the division of the spoils took\\n\\t\\t\\t\\tplace.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tI heard Malik say about muslim property that had been\\n\\t\\t\\t\\tseized by the enemy, \"If it is noticed before the\\n\\t\\t\\t\\tdistribution, then it is returned to itsowner. Whatever\\n\\t\\t\\t\\thas already been distributed is not returned to anyone.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik, when asked about a man whose young male slave was\\n\\t\\t\\t\\ttaken by the idol worshippers and then the Muslims\\n\\t\\t\\t\\tre-captured him, said, \"The owner is more entitled to him\\n\\t\\t\\t\\twithout having to pay his price or value or having to\\n\\t\\t\\t\\tincur any loss before the distribution takes place. If\\n\\t\\t\\t\\tthe distribution has already taken place then I think\\n\\t\\t\\t\\tthat the slave belongs to his master for his price if the\\n\\t\\t\\t\\tmaster wants him back.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tRegarding an umm walad of a Muslim man who has been taken\\n\\t\\t\\t\\tby the idol worshippers and then recaptured by the\\n\\t\\t\\t\\tMuslims and allotted in the distribution of spoils and\\n\\t\\t\\t\\tthen recognised by her master after the distribution,\\n\\t\\t\\t\\tMalik said, \"She is not to be enslaved. I think that the\\n\\t\\t\\t\\tImam should pay a  ransom for her for her master. If  he\\n\\t\\t\\t\\tdoes not do it, then her master must pay a ransom for her\\n\\t\\t\\t\\tand not leave her. I do not think that she should be made\\n\\t\\t\\t\\ta slave by whoever takes her and intercourse with her is\\n\\t\\t\\t\\tnot halal. She is in the position of a free woman because\\n\\t\\t\\t\\ther master would be required to pay compensation if she\\n\\t\\t\\t\\tinjured somebody and so she is in the same position (as a\\n\\t\\t\\t\\twife). He must not leave the mother of his son to be\\n\\t\\t\\t\\tenslaved nor may intercourse with her be made halal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who went to enemy territory\\n\\t\\t\\t\\tto pay ransom or to trade, and he bought a free man or a\\n\\t\\t\\t\\tslave, or they were given to him. He said, \"As for the\\n\\t\\t\\t\\tfree man, the price he buys him for is a debt against the\\n\\t\\t\\t\\tman and he is not made a slave. If the captive is given\\n\\t\\t\\t\\tto him freely, he is free and owes nothing unless the man\\n\\t\\t\\t\\tgave something in recompense for him. That is a debt\\n\\t\\t\\t\\tagainst the free man, the same as if a ransom had been\\n\\t\\t\\t\\tpaid for him. As for a slave, his former master can\\n\\t\\t\\t\\tchoose to take him back and pay his price to the man who\\n\\t\\t\\t\\tbought him or he can choose to leave him, as he wishes.\\n\\t\\t\\t\\tIf he was given to the man, the former master is more\\n\\t\\t\\t\\tentitled to him, and he owes nothing for him unless the\\n\\t\\t\\t\\tman gave something for him in recompense. Whatever he\\n\\t\\t\\t\\tgave for him is a loss against the master if he wants him\\n\\t\\t\\t\\tback.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "18",
    "sectionHeading": "Stripping the Slain of their Personal Effects in the Booty",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAmr ibn Kathir ibn Aflah from Abu Muhammad, the mawla of\\n\\t\\t\\t\\tAbu Qatada that Abu Qatada ibn Ribi said, \"We went out\\n\\t\\t\\t\\twith the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, in the year of Hunayn. When the armies\\n\\t\\t\\t\\tmet, the Muslims were put in disarray. I saw a man from\\n\\t\\t\\t\\tthe idol worshippers who had got the better of one of the\\n\\t\\t\\t\\tMuslims, so I circled round and came up behind him, and\\n\\t\\t\\t\\tstruck him with a sword on his shoulder-blade. He turned\\n\\t\\t\\t\\tto me and grabbed me so hard that I felt the smell of\\n\\t\\t\\t\\tdeath in it. Then death overcame him, and he let go of\\n\\t\\t\\t\\tme.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe continued, \"I met Umar ibn al-Khattab and said to him,\\n\\t\\t\\t\\t'What's going on with the people?' He replied, 'The\\n\\t\\t\\t\\tCommand of Allah.' Then the people took hold of the\\n\\t\\t\\t\\tbattle and the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, 'Whoever has killed one of the\\n\\t\\t\\t\\tdead and can prove it, can strip him of his personal\\n\\t\\t\\t\\teffects.' I stood up and said, 'Who will testify for me?'\\n\\t\\t\\t\\tand then I sat down. The Messenger of Allah repeated,\\n\\t\\t\\t\\t'Whoever has killed one of the dead and can prove it, can\\n\\t\\t\\t\\tstrip him of his personal effects.' I stood up and said,\\n\\t\\t\\t\\t'Who will testify for me?' then I sat down. Then he\\n\\t\\t\\t\\trepeated his statement a third time, so I stood up, and\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'What's the matter with you, Abu Qatada?' So\\n\\t\\t\\t\\tI related my story to him. A man said, 'He has spoken the\\n\\t\\t\\t\\ttruth, Messenger of Allah. I have the effects of that\\n\\t\\t\\t\\tslain person with me, so give him compensation for it,\\n\\t\\t\\t\\tMessenger of Allah.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Bakr said, 'No, by Allah! He did not intend that one\\n\\t\\t\\t\\tof the lions of Allah should fight for Allah and His\\n\\t\\t\\t\\tMessenger and then give you his spoils.' The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, 'He\\n\\t\\t\\t\\thas spoken the truth, hand it over to him.' He gave it to\\n\\t\\t\\t\\tme, and I sold the breast-plate and I bought a garden in\\n\\t\\t\\t\\tthe area of the Banu Salima with the money. It was my\\n\\t\\t\\t\\tfirst property, and I acquired it in Islam.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "19",
    "sectionHeading": "Stripping the Slain of their Personal Effects in the Booty",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad said that he had heard a man asking\\n\\t\\t\\t\\tibn Abbas about booty. Ibn Abbas said, \"Horses are part\\n\\t\\t\\t\\tof the booty and personal effects are as well.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThen the man repeated his question, and Ibn Abbas\\n\\t\\t\\t\\trepeated his answer. Then the man said, \"What are the\\n\\t\\t\\t\\tspoils which He, the Blessed, the Exalted, mentioned in\\n\\t\\t\\t\\tHis Book?\" He kept on asking until Ibn Abbas was on the\\n\\t\\t\\t\\tverge of being annoyed, then Ibn Abbas said, \"Do you know\\n\\t\\t\\t\\twho this man is like? Ibn Sabigh, who was beaten by Umar\\n\\t\\t\\t\\tibn al-Khattab because he was notorious for asking\\n\\t\\t\\t\\tfoolish questions.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether someone  who\\n\\t\\t\\t\\tkilled one of the enemy could keep the man's effects\\n\\t\\t\\t\\twithout the permission of the Imam. He said, \"No one can\\n\\t\\t\\t\\tdo that without the permission of the Imam. Only the Imam\\n\\t\\t\\t\\tcan make ijtihad. I have not heard that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, ever\\n\\t\\t\\t\\tsaid, 'Whoever kills someone can have his effects,' on\\n\\t\\t\\t\\tany other day than the day of Hunayn.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t3\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "20",
    "sectionHeading": "Awarding Bonuses from the Tax of One Fifth (Khumus)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad that Said\\n\\t\\t\\t\\tibn al-Musayyab said, \"People used to be given bonuses\\n\\t\\t\\t\\tfrom the Khumus.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the best of what I have heard on the\\n\\t\\t\\t\\tmatter.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about bonuses and whether they were taken\\n\\t\\t\\t\\tfrom the first of the spoils, and he said, \"That is only\\n\\t\\t\\t\\tdecided according to the ijtihad of the Imam. We do not\\n\\t\\t\\t\\thave a known reliable command about that other than it is\\n\\t\\t\\t\\tup to the ijtihad of the Sultan. I have not heard that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, gave bonuses in all his raids. I have only heard\\n\\t\\t\\t\\tthat he gave bonuses in one of them, namely the day of\\n\\t\\t\\t\\tHunayn. It depends on the ijtihad of the Imam whether\\n\\t\\t\\t\\tthey are taken from the first of the spoils or what is\\n\\t\\t\\t\\tafter it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "21",
    "sectionHeading": "The Share of the Spoils Allotted to Cavalry in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said that he had heard\\n\\t\\t\\t\\tthat Umar ibn Abd al-Aziz used to say, \"The man on\\n\\t\\t\\t\\thorse-back has two shares, and the man on foot has one.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"I continue to hear the same.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik, when asked whether a man who was present with\\n\\t\\t\\t\\tseveral horses took a share for all of them, said, \"I\\n\\t\\t\\t\\thave never heard that. I think that there is only a share\\n\\t\\t\\t\\tfor the horse on which he fought.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I think that foreign horses and half-breeds\\n\\t\\t\\t\\tare considered as horses because Allah, the Blessed, the\\n\\t\\t\\t\\tExalted, said in His Book, 'All horses, and mules, and\\n\\t\\t\\t\\tasses, for you to ride, and as an adornment.' (Sura16\\n\\t\\t\\t\\tayat 8). He said, the Mighty, the Majestic, 'Make ready\\n\\t\\t\\t\\tfor them whatever force and strings of horses you can, to\\n\\t\\t\\t\\tterrify thereby the enemy of Allah and your enemy.' (Sura\\n\\t\\t\\t\\t8 ayat 60). I think that foreign breeds and half-breeds\\n\\t\\t\\t\\tare considered as horses if the governor accepts them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tSaid ibn al-Musayyab was asked about working horses, and\\n\\t\\t\\t\\twhether there was zakat on them. He said, \"Is there any\\n\\t\\t\\t\\tzakat on horses.?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "22",
    "sectionHeading": "Stealing from the Spoils",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tSaid from Amr ibn Shuayb that when the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, came back\\n\\t\\t\\t\\tfrom Hunayn heading for al-Jiirrana, the people crowded\\n\\t\\t\\t\\taround so much to question him that his she-camel backed\\n\\t\\t\\t\\tinto a tree, which became entangled in his cloak and\\n\\t\\t\\t\\tpulled it off his back. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Return my cloak to\\n\\t\\t\\t\\tme. Are you afraid that I will not distribute among you\\n\\t\\t\\t\\twhat Allah has given you as spoils. By He in whose hand\\n\\t\\t\\t\\tmy self is! Had Allah given you spoils equal to the\\n\\t\\t\\t\\tnumber of acacia trees on the plain of Tihama, I would\\n\\t\\t\\t\\thave distributed it among you. You will not find me to be\\n\\t\\t\\t\\tmiserly, cowardly, or a liar.\" Then the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, got down\\n\\t\\t\\t\\tand stood among the people, and said, \"Hand over even the\\n\\t\\t\\t\\tneedle and thread, for stealing from the spoils is\\n\\t\\t\\t\\tdisgrace, fire, ignominy on the Day of Rising for people\\n\\t\\t\\t\\twho do it.\" Then he took a bit of camel fluff or\\n\\t\\t\\t\\tsomething from the ground and said, \"By He in whose hand\\n\\t\\t\\t\\tmy self is! What Allah has made spoils for you is not\\n\\t\\t\\t\\tmine - even the like of this! - except for the tax of one\\n\\t\\t\\t\\tfifth, and the tax of one fifth is returned to you.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "23",
    "sectionHeading": "Stealing from the Spoils",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Yahya ibn Habban from Ibn Abi Amra that Zayd\\n\\t\\t\\t\\tibn Khalid al-Juhani said, \"A man died on the day of\\n\\t\\t\\t\\tHunayn, and they mentioned him to the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace.\" Zayd claimed\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"You pray over your companion.\"\\n\\t\\t\\t\\t(i.e. he would not pray himself). The people's faces\\n\\t\\t\\t\\tdropped at that. Zayd claimed that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Your companion stole from the spoils taken in the way of\\n\\t\\t\\t\\tAllah.\" Zayd said, \"So we opened up his baggage and found\\n\\t\\t\\t\\tsome Jews' beads worth about two dirhams.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "24",
    "sectionHeading": "Stealing from the Spoils",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAbdullah ibn al-Mughira ibn Abi Burda al-Kinani that he\\n\\t\\t\\t\\thad heard that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, came to the people in their\\n\\t\\t\\t\\ttribes and made dua for them, but left out one of the\\n\\t\\t\\t\\ttribes. Abdullah related, \"The tribe found an onyx\\n\\t\\t\\t\\tnecklace in the saddle-bags of one of their men. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, came to them, and then did the takbir over them as\\n\\t\\t\\t\\tone does the takbir over the dead.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "25",
    "sectionHeading": "Stealing from the Spoils",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Thawr ibn Zayd\\n\\t\\t\\t\\tad-Dili from Abu'l-Ghayth Salim, the mawla of ibn Muti\\n\\t\\t\\t\\tthat Abu Hurayra said, \"We went out with the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, in the\\n\\t\\t\\t\\tyearof Khaybar. We did not capture any gold or silver\\n\\t\\t\\t\\texcept for personal effects, clothes, and baggage. Rifaa\\n\\t\\t\\t\\tibn Zayd presented a black slave boy to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, whose\\n\\t\\t\\t\\tname was Midam. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, made for Wadi'l-Qura, and when\\n\\t\\t\\t\\the arrived there, Midam was unsaddling the camel of the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, when a stray arrow struck and killed him. The\\n\\t\\t\\t\\tpeople said, 'Good luck to him! The Garden!' The\\n\\t\\t\\t\\tMessenger of Allah said, 'No! By He in whose hand my self\\n\\t\\t\\t\\tis! The cloak which he took from the spoils on the Day of\\n\\t\\t\\t\\tKhaybar before they were distributed will blaze with fire\\n\\t\\t\\t\\ton him.' When the people heard that, a man brought a\\n\\t\\t\\t\\tsandal-strap or two sandal-straps to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'A sandal-strap or two sandal-straps of\\n\\t\\t\\t\\tfire!' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "26",
    "sectionHeading": "Stealing from the Spoils",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the had heard that Abdullah ibn Abbas said, \"Stealing from\\n\\t\\t\\t\\tthe spoils does not appear in a people but that terror is\\n\\t\\t\\t\\tcast into their hearts. Fornication does not spread in a\\n\\t\\t\\t\\tpeople but that there is much death among them. A people\\n\\t\\t\\t\\tdo not lessen the measure and weight but that provision\\n\\t\\t\\t\\tis cut off from them. A people do not judge without right\\n\\t\\t\\t\\tbut that blood spreads among them. A people do not betray\\n\\t\\t\\t\\tthe pledge but that Allah gives their enemies power over\\n\\t\\t\\t\\tthem.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "27",
    "sectionHeading": "The Martyrs in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"By He in\\n\\t\\t\\t\\twhose hand my self is! I would like to fight in the way\\n\\t\\t\\t\\tof Allah and be killed, then be brought to life again so\\n\\t\\t\\t\\tI could be killed, and then be brought to life again so I\\n\\t\\t\\t\\tcould be killed.\" Abu Hurayra said three times, \"I\\n\\t\\t\\t\\ttestify to it by Allah!\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "28",
    "sectionHeading": "The Martyrs in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Allah laughs\\n\\t\\t\\t\\tat two men. One of them kills the other, but each of them\\n\\t\\t\\t\\twill enter the Garden: one fights in the way of Allah and\\n\\t\\t\\t\\tis killed, then Allah turns to the killer, so he fights\\n\\t\\t\\t\\t(in the way of Allah) and also becomes a martyr.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "29",
    "sectionHeading": "The Martyrs in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"By He in\\n\\t\\t\\t\\twhose hand my self is! None of you is wounded in the way\\n\\t\\t\\t\\tof Allah - and Allah knows best who is wounded in HisWay,\\n\\t\\t\\t\\tbut that when the Day of Rising comes, blood will gush\\n\\t\\t\\t\\tforth from his wound. It will be the colour of blood, but\\n\\t\\t\\t\\tits scent will be that of musk.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "30",
    "sectionHeading": "The Martyrs in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tUmar ibn al-Khattab used to say, \"O Allah! Do not let me\\n\\t\\t\\t\\tbe slain by the hand of a man who has prayed a single\\n\\t\\t\\t\\tprostration to You with which he will dispute with me\\n\\t\\t\\t\\tbefore You on the Day of Rising!\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "31",
    "sectionHeading": "The Martyrs in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSaid al-Maqburi from Abdullah ibn Abi Qatada that his\\n\\t\\t\\t\\tfather had said that a man came to the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, and said,\\n\\t\\t\\t\\t\"O Messenger of Allah! If I am killed in the way of\\n\\t\\t\\t\\tAllah, expectant for reward, sincere, advancing, and not\\n\\t\\t\\t\\tretreating, will Allah pardon my faults?\" The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Yes.\" When the man turned away, the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, called him - or\\n\\t\\t\\t\\tcommanded him and he was called to him. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\thim, \"What did you say?\" He repeated his words to him,\\n\\t\\t\\t\\tand the Prophet, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tsaid to him, \"Yes, except for the debt. Jibril said that\\n\\t\\t\\t\\tto me.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "32",
    "sectionHeading": "The Martyrs in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n-Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said over the martyrs of Uhud, \"I testify for\\n\\t\\t\\t\\tthem.\" Abu Bakr as-Siddiq said, \"Messenger of Allah! Are\\n\\t\\t\\t\\twe not their brothers? We entered Islam as they entered\\n\\t\\t\\t\\tIslam and we did jihad as they did jihad.\" The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Yes, but I do not know what you will do after me.\" Abu\\n\\t\\t\\t\\tBakr wept profusely and said, \"Are we really going to\\n\\t\\t\\t\\tout-live you!\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "33",
    "sectionHeading": "The Martyrs in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, was sitting by a grave which was being dug at\\n\\t\\t\\t\\tMadina. A man looked into the grave and said, 'An awful\\n\\t\\t\\t\\tbed for the mumin. 'The Messenger of Allah, may Allah\\n\\t\\t\\t\\tblesshim and grant him peace, said, 'Evil? What you have\\n\\t\\t\\t\\tsaid is absolutely wrong.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe man said, 'I didn't mean that, Messenger of Allah. I\\n\\t\\t\\t\\tmeant being killed in the way of Allah.' The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'Being killed in the way of Allah has no like! There is\\n\\t\\t\\t\\tno place on the earth which I would prefer my grave to be\\n\\t\\t\\t\\tthan here (meaning Madina). He repeated it three times.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "34",
    "sectionHeading": "Things in which Martyrdom Lies",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tUmar ibn al-Khattab used to say, \"O Allah! I ask you for\\n\\t\\t\\t\\tmartyrdom in Your way and death in the city of Your\\n\\t\\t\\t\\tMessenger!\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "35",
    "sectionHeading": "Things in which Martyrdom Lies",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tUmar ibn al-Khattab said, \"The nobility of the mumin is\\n\\t\\t\\t\\this taqwa. His deen is his noble descent. His manliness\\n\\t\\t\\t\\tis his good character. Boldness and cowardice are but\\n\\t\\t\\t\\tinstincts which Allah places wherever He wills. The\\n\\t\\t\\t\\tcoward shrinks from defending even his father and mother,\\n\\t\\t\\t\\tand the bold one fights for the sake of the combat not\\n\\t\\t\\t\\tfor the spoils. Being slain is but one way of meeting\\n\\t\\t\\t\\tdeath, and the martyr is the one who gives himself,\\n\\t\\t\\t\\texpectant of reward from Allah.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "36",
    "sectionHeading": "How to Wash the Martyr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that Umar ibn al-Khattab was washed and shrouded\\n\\t\\t\\t\\tand prayed over, yet he was a martyr, may Allah have\\n\\t\\t\\t\\tmercy on him .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "37",
    "sectionHeading": "How to Wash the Martyr",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard the\\n\\t\\t\\t\\tpeople of knowledge say that martyrs in the way of Allah\\n\\t\\t\\t\\twere not washed, nor were any of them prayed over. They\\n\\t\\t\\t\\twere buried in the garments in which they were slain.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the sunna for someone who is killed\\n\\t\\t\\t\\ton the battleground and is not reached until he is\\n\\t\\t\\t\\talready dead. Someone who is carried off and lives for as\\n\\t\\t\\t\\tlong as Allah wills after it, is washed and prayed over\\n\\t\\t\\t\\tas was Umar ibn al-Khattab.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "38",
    "sectionHeading": "What is Disliked to be done with Something Given in the Way of Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tUmar ibn al-Khattab in one year gave 40,000 camels as\\n\\t\\t\\t\\tmounts. Sometimes he would give one man a camel to\\n\\t\\t\\t\\thimself. Sometimes he would give one camel between two\\n\\t\\t\\t\\tmen to take them to Iraq. A man from Iraq came to him and\\n\\t\\t\\t\\tsaid, \"Give Suhaym and I a mount.''Umar ibn al-Khattab\\n\\t\\t\\t\\tsaid to him,\"l demand from you, by Allah!, is Suhaym a\\n\\t\\t\\t\\twater skin?\" He said, \"Yes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "39",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha that Anas ibn Malik had said that when the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, went to Quba, he visited Umm Haram bint Milhan and\\n\\t\\t\\t\\tshe fed him. Umm Haram was the wife of Ubada ibn\\n\\t\\t\\t\\tas-Samit. One day the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, had called on her and she had\\n\\t\\t\\t\\tfed him, and sat down to delouse his hair. The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, had\\n\\t\\t\\t\\tdozed and woke up smiling. Umm Haram said, \"What is\\n\\t\\t\\t\\tmaking you smile, Messenger of Allah?\" He said, \"Some of\\n\\t\\t\\t\\tmy community were presented to me, raiding in the way of\\n\\t\\t\\t\\tAllah. They were riding in the middle of the sea, kings\\n\\t\\t\\t\\ton thrones, or like kings on thrones.\" (Ishaq wasn't\\n\\t\\t\\t\\tsure). She said, \"O Messenger of Allah! Ask Allah to put\\n\\t\\t\\t\\tme among them!\" So he had made a dua for her, and put his\\n\\t\\t\\t\\thead down and slept. Then he had woken up smiling, and\\n\\t\\t\\t\\tshe said to him, \"Messenger of Allah, why are you\\n\\t\\t\\t\\tsmiling?\" He said, \"Some of my community were presented\\n\\t\\t\\t\\tto me, raiding in the way of Allah. They were kings on\\n\\t\\t\\t\\tthrones or like kings on thrones,\" as he had said in the\\n\\t\\t\\t\\tfirst one. She said, \"O Messenger of Allah! Ask Allah to\\n\\t\\t\\t\\tput me among them!\" He said, \"You are among the first.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIshaq added, \"She travelled on the sea in the time of\\n\\t\\t\\t\\tMuawiya, and when she landed, she was thrown from her\\n\\t\\t\\t\\tmount and killed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "40",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAbu Salih as-Samman from Abu Hurayra that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Had I not been concerned for my community, I would have\\n\\t\\t\\t\\tliked never to stay behind a raiding party going out in\\n\\t\\t\\t\\tthe way of Allah. However, I do not find the means to\\n\\t\\t\\t\\tcarry them to it, nor do they find anything on which to\\n\\t\\t\\t\\tride out and it is grievous for them that they should\\n\\t\\t\\t\\tstay behind me. I would like to fight in the way of Allah\\n\\t\\t\\t\\tand be killed, then brought to life so I could be killed\\n\\t\\t\\t\\tand then brought to life so I could be killed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "41",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"On the Day of Uhud, The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'Who will bring me\\n\\t\\t\\t\\tnews of Sad ibn al-Rabi al-Ansari?' a man said, 'Me,\\n\\t\\t\\t\\tMessenger of Allah!' So the man went around among the\\n\\t\\t\\t\\tslain, and Sad ibn al-Rabi said to him, 'What are you\\n\\t\\t\\t\\tdoing?' The man said to him, 'The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, sent me to bring him\\n\\t\\t\\t\\tnews of you.' He said, 'Go to him, and give him my\\n\\t\\t\\t\\tgreetings, and tell him that I have been stabbed twelve\\n\\t\\t\\t\\ttimes, and am mortally wounded. Tell your people that\\n\\t\\t\\t\\tthey will have no excuse with Allah if the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, is slain\\n\\t\\t\\t\\twhile one of them is still alive.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "42",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, stimulated people for jihad and mentioned the\\n\\t\\t\\t\\tGarden. One of the Ansar was eating some dates in his\\n\\t\\t\\t\\thand, and said, \"Am I so desirous of this world that I\\n\\t\\t\\t\\tshould sit until I finish them?\" He threw aside what was\\n\\t\\t\\t\\tin his hand and took his sword, and fought until he was\\n\\t\\t\\t\\tslain .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "43",
    "sectionHeading": "Stimulation of Desire for Jihad",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tMuadh ibn Jabal said, \"There are two military\\n\\t\\t\\t\\texpeditions. There is one military expedition in which\\n\\t\\t\\t\\tvaluables are spent, the contributor is willing, the\\n\\t\\t\\t\\tauthorities are obeyed, and corruption is avoided. That\\n\\t\\t\\t\\tmilitary expedition is all good. There is a military\\n\\t\\t\\t\\texpedition in which valuables are not spent, the\\n\\t\\t\\t\\tcontributor is not willing, the authorities are not\\n\\t\\t\\t\\tobeyed, and corruption is not avoided. The one who fights\\n\\t\\t\\t\\tin that military expedition does not return with reward.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "44",
    "sectionHeading": "Horses and Racing Them and Expending in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Blessing is in the forelocks\\n\\t\\t\\t\\tof horses until the Day of Rising.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "45",
    "sectionHeading": "Horses and Racing Them and Expending in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, held a race between horses which had\\n\\t\\t\\t\\tbeen made lean by training, from al-Hafya to\\n\\t\\t\\t\\tThaniyatu-lWada. He held a race between horses which had\\n\\t\\t\\t\\tnot been made lean from the Thaniya (a mountain pass near\\n\\t\\t\\t\\tMadina) to the mosque of the Banu Zurayq. Abdullah ibn\\n\\t\\t\\t\\tUmar was among those who raced them .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "46",
    "sectionHeading": "Horses and Racing Them and Expending in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said heard\\n\\t\\t\\t\\tSaid ibn al-Musayyab say, \"There is  no harm in placing\\n\\t\\t\\t\\tstakes on horses if a third horse enters it. The winner\\n\\t\\t\\t\\ttakes the stake, and there is no fine against the loser.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "47",
    "sectionHeading": "Horses and Racing Them and Expending in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, was seen wiping the face of his horse with his\\n\\t\\t\\t\\tcloak. He was questioned about it and said, \"I was\\n\\t\\t\\t\\treproached in the night about horses.\" i.e. not taking\\n\\t\\t\\t\\tcare of them.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "48",
    "sectionHeading": "Horses and Racing Them and Expending in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd at-Tawil from\\n\\t\\t\\t\\tAnas ibn Malik that when the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, went out to Khaybar,\\n\\t\\t\\t\\the arrived there at night, and when he came upon a people\\n\\t\\t\\t\\tby night, he did not attack until morning. In the\\n\\t\\t\\t\\tmorning, the jews came out with their spades and baskets.\\n\\t\\t\\t\\tWhen they saw him, they said, \"Muhammad! By Allah,\\n\\t\\t\\t\\tMuhammad and his army!\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said \"Allah is greater!\\n\\t\\t\\t\\tKhaybar is destroyed. When we come to a people, it is an\\n\\t\\t\\t\\tevil morning for those who have been warned . \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "49",
    "sectionHeading": "Horses and Racing Them and Expending in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tHumayd ibn Abd ar-Rahman ibn Awf from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Whoever hands over two of any type of\\n\\t\\t\\t\\tproperty in the way of Allah is called to the Garden,\\n\\t\\t\\t\\twith the words 'O slave of Allah! This is good!' Whoever\\n\\t\\t\\t\\tis among the people of prayer, is called from the gate of\\n\\t\\t\\t\\tprayer. Whoever is among the people of jihad is called\\n\\t\\t\\t\\tfrom the gate of jihad. Whoever is among the people of\\n\\t\\t\\t\\tsadaqa, is called from the gate of sadaqa. Whoever is\\n\\t\\t\\t\\tamong the people of fasting, is called from the gate of\\n\\t\\t\\t\\tthe well-watered. (Bab ar-Rayyan).\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Bakr as-Siddiq said, \"Messenger of Allah! Is it\\n\\t\\t\\t\\tabsolutely necessary that one be called from one of these\\n\\t\\t\\t\\tgates? Can someone be called from all of these gates?\" He\\n\\t\\t\\t\\tsaid, \"Yes, and I hope you are among them .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t21.20 Acquisition of the Land of Those who Surrender from\\n\\t\\t\\t\\tthe People of Dhimma\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "49",
    "sectionHeading": "Horses and Racing Them and Expending in Military Expeditions",
    "text": "<p>\\n\\t\\t\\t\\tMalik was asked whether, when an imam had accepted jizya\\n\\t\\t\\t\\tfrom a people and they gave it, he thought that the land\\n\\t\\t\\t\\tof one of them who surrendered belonged to him or whether\\n\\t\\t\\t\\this land and property belonged to the Muslims. Malik\\n\\t\\t\\t\\tsaid, \"That varies. As for the people of peace, if one of\\n\\t\\t\\t\\tthem surrenders, then he is entitled to his land and\\n\\t\\t\\t\\tproperty. As for the people of force who use force, if\\n\\t\\t\\t\\tone of them surrenders, his land and property belong to\\n\\t\\t\\t\\tthe Muslims because the people of force are overcome in\\n\\t\\t\\t\\ttheir towns, and it becomes booty for the Muslims. As for\\n\\t\\t\\t\\tthe people of peace, their property and selves are\\n\\t\\t\\t\\tprotected so that they make peace for them. Only what\\n\\t\\t\\t\\tthey have made peace for is obliged of them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "50",
    "sectionHeading": "Burial in One Grave by Necessity and Abu Bakr's, may Allah be Pleased with Him, Carrying Out the Promise of the Messenger of Allah, may Allah Bless Him and Grant Him Peace, After the Death of the Messenger, may Allah Bless Him and Grant Him Peace",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn Abi\\n\\t\\t\\t\\tSasaca that he had heard that Amr ibn al-Jamuh al-Ansari\\n\\t\\t\\t\\tand Abdullah ibn Umar al-Ansari, both of the tribe of\\n\\t\\t\\t\\tBanu Salami, had their grave uncovered by a flood. Their\\n\\t\\t\\t\\tgrave was part of what was left after the flood. They\\n\\t\\t\\t\\twere in the same grave, and they were among those\\n\\t\\t\\t\\tmartyred at Uhud. They were dug up so that they might be\\n\\t\\t\\t\\tmoved. They were found unchanged. It was as if they had\\n\\t\\t\\t\\tdied only the day before. One of them had been wounded,\\n\\t\\t\\t\\tand he had put his hand over his wound and had been\\n\\t\\t\\t\\tburied like that. His hand was pulled away from his wound\\n\\t\\t\\t\\tand released, and it returned to where it had been. It\\n\\t\\t\\t\\twas forty-six years between Uhud and the day they were\\n\\t\\t\\t\\tdug up.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in burying two or three men\\n\\t\\t\\t\\tin the same grave due to necessity. The oldest one is put\\n\\t\\t\\t\\tnext to the qibla.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "21",
    "hadithNumber": "51",
    "sectionHeading": "Burial in One Grave by Necessity and Abu Bakr's, may Allah be Pleased with Him, Carrying Out the Promise of the Messenger of Allah, may Allah Bless Him and Grant Him Peace, After the Death of the Messenger, may Allah Bless Him and Grant Him Peace",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman said, \"Property was sent to Abu Bakr as-Siddiq\\n\\t\\t\\t\\tfrom Bahrayn. He said, 'If someone had a promise or a\\n\\t\\t\\t\\tpledge with the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, let him come to me.' So Jabir ibn\\n\\t\\t\\t\\tAbdullah came to him, and he gave him three times as much\\n\\t\\t\\t\\tof it as would fill both hands.''\\n\\t\\t\\t</p>"
  }
]
