[
  {
    "SurahNumber": "98",
    "AyahNumber": "1",
    "NoteID": "6221",
    "Body": "The People of the Book immediately referred to are the\\n\\t\\t\\t\\tJews and the Christians, who had received scriptures in\\n\\t\\t\\t\\tthe same line of prophecy in which came our holy Prophet.\\n\\t\\t\\t\\tTheir scriptures should have prepared them for the advent\\n\\t\\t\\t\\tof the greatest and last of the Prophets. For the Jewish\\n\\t\\t\\t\\tscriptures promised to the Jews, cousins or brethren to\\n\\t\\t\\t\\tthe Arabs, a prophet like Moses: \"The Lord thy God will\\n\\t\\t\\t\\traise up unto thee a Prophet from the midst of thee, of\\n\\t\\t\\t\\tthy brethren, like unto me; unto him ye shall hearken\"\\n\\t\\t\\t\\t(Deut, xviii. 15). And Christ promised a Comforter (John.\\n\\t\\t\\t\\txiv. 16; xv. 26; and xvi. 7; see my n. 5438 to lxi. 6)\\n\\t\\t\\t\\talmost by name. The People of the Book fell from the\\n\\t\\t\\t\\ttrue, straight, and standard religion, into devious ways,\\n\\t\\t\\t\\tand would not come to the true Path until (they said)\\n\\t\\t\\t\\tthey were convinced by the arrival of the promised\\n\\t\\t\\t\\tProphet. But when the promised Prophet came in the person\\n\\t\\t\\t\\tof Muhammad, they rejected him, because they really did\\n\\t\\t\\t\\tnot seek for Truth but only followed their own fancies\\n\\t\\t\\t\\tand desires."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "1",
    "NoteID": "6222",
    "Body": "The Polytheists, the Pagans, had not previously believed\\n\\t\\t\\t\\tin any scriptures. But yet, when clear evidence came to\\n\\t\\t\\t\\tthem, they should have believed. Yet they rejected the\\n\\t\\t\\t\\tholy Prophet because they were not really searching for\\n\\t\\t\\t\\tTruth, but were only following their own fancies and\\n\\t\\t\\t\\tdesires."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "1",
    "NoteID": "6223",
    "Body": "The Clear Evidence was the holy Prophet himself, his\\n\\t\\t\\t\\tlife, his personality, and his teaching."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "2",
    "NoteID": "6224",
    "Body": "Cf. ii. 15 1."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "2",
    "NoteID": "6225",
    "Body": "Cf. lxxx. 13-16."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "3",
    "NoteID": "6226",
    "Body": "Qaiyim. straight, as opposed to crooked; standard as\\n\\t\\t\\t\\topposed to irregular; definite and permanent, as opposed\\n\\t\\t\\t\\tto casual or temporary. Cf. ix. 36; xii. 40; etc."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "4",
    "NoteID": "6227",
    "Body": "The responsibility of the People of the Book is greater\\n\\t\\t\\t\\tthan that of Pagans, because the People of the Book had\\n\\t\\t\\t\\tbeen prepared for the standard and straight Religion by\\n\\t\\t\\t\\tthe revelations which they had already received. Yet,\\n\\t\\t\\t\\twhen the clear evidence came in Islam, they resisted it,\\n\\t\\t\\t\\tAnd what is this standard and straight Religion, free of\\n\\t\\t\\t\\tall ambiguity, and free of all casual rights and\\n\\t\\t\\t\\tceremonies? They are summed up in three eternal\\n\\t\\t\\t\\tprinciples, as explained in the next verse and the next\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "5",
    "NoteID": "6228",
    "Body": "The three eternal principles of Religion are: (1) sincere\\n\\t\\t\\t\\tdevotion to Allah; (2) Prayer and Praise as drawing man\\n\\t\\t\\t\\tnearer to Allah; and (3) the service of Allah's creatures\\n\\t\\t\\t\\tby deeds of practical charity."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "5",
    "NoteID": "6229",
    "Body": "Hanif: see n. 134 to ii. 135."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "5",
    "NoteID": "6230",
    "Body": "See n. 6226 above."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "6",
    "NoteID": "6231",
    "Body": "To be given the faculty of discrimination between right\\n\\t\\t\\t\\tand wrong, and then to reject truth and right, is the\\n\\t\\t\\t\\tworst folly which a creature endowed with will can\\n\\t\\t\\t\\tcommit. It must necessarily bring its own punishment,\\n\\t\\t\\t\\twhether the creature calls himself one of the children of\\n\\t\\t\\t\\tAbraham or one of the redeemed of Christ, or whether he\\n\\t\\t\\t\\tgoes by the mere light of nature and reason as a Pagan.\\n\\t\\t\\t\\tHonour in the sight of Allah is not due to race or\\n\\t\\t\\t\\tcolour, but to sincere and righteous conduct (xlix. 13)."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "7",
    "NoteID": "6232",
    "Body": "Contrast this with the preceding verse. Human beings who\\n\\t\\t\\t\\tlive a life of faith and good deed justify the purpose of\\n\\t\\t\\t\\ttheir probation here. They attain the fulfilment of their\\n\\t\\t\\t\\thighest hopes."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "8",
    "NoteID": "6233",
    "Body": "The Good Pleasure of Allah is the final Bliss of\\n\\t\\t\\t\\tSalvation. The good pleasure is mutual; the truly saved\\n\\t\\t\\t\\tis he whose will has become completely identified with\\n\\t\\t\\t\\tAllah's universal will."
  },
  {
    "SurahNumber": "98",
    "AyahNumber": "8",
    "NoteID": "6234",
    "Body": "The fear of Allah is the fear to offend against His holy\\n\\t\\t\\t\\tlaw, the fear to do anything which is against His holy\\n\\t\\t\\t\\tWill. Such fear is akin to love; for with it dawns the\\n\\t\\t\\t\\tconsciousness of Allah's loving-care for all His\\n\\t\\t\\t\\tcreatures."
  }
]
