[
  {
    "SurahNumber": "7",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "The expression haraj (lit., \"straitness\" or \"tightness\")\\n\\t\\t\\t\\tis often used idiomatically to denote \"doubt\": and this\\n\\t\\t\\t\\tis, according to Ibn 'Abbas, Mujahid and Qatadah, the\\n\\t\\t\\t\\tmeaning of the term here (see Tabari, Zamakhshari,\\n\\t\\t\\t\\tBaghawi, Razi, Ibn Kathir). The construction of the whole\\n\\t\\t\\t\\tsentence makes it clear that the \"doubt\" does not relate\\n\\t\\t\\t\\tto the origin of the divine writ but to its purpose: and\\n\\t\\t\\t\\tthus, although ostensibly addressed to the Prophet, the\\n\\t\\t\\t\\tabove passage is meant to draw the attention of all whom\\n\\t\\t\\t\\tthe Qur'anic message may reach to the fact that it has a\\n\\t\\t\\t\\ttwofold objective - namely, to warn the rejectors of the\\n\\t\\t\\t\\ttruth and to guide those who already believe in it. Both\\n\\t\\t\\t\\tthe warning and the admonition are summarized in the\\n\\t\\t\\t\\tsequence."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "Some of the great Muslim thinkers, and particularly Ibn\\n\\t\\t\\t\\tHazm and Ibn Taymiyyah, maintain that the expression\\n\\t\\t\\t\\tawliya' (here rendered as \"masters\") denotes, in this\\n\\t\\t\\t\\tcontext \"authorities\" in the religious sense of the word,\\n\\t\\t\\t\\timplying a prohibition of attributing legal validity -\\n\\t\\t\\t\\tside by side with Qur'anic ordinances - to the subjective\\n\\t\\t\\t\\topinions of any person below the Prophet. See in this\\n\\t\\t\\t\\tconnection  5:101 , and the corresponding notes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "I.e., suddenly, when the people felt completely secure\\n\\t\\t\\t\\tand at ease. This passage connects with the obligation,\\n\\t\\t\\t\\tlaid down in the preceding two verses, to follow God's\\n\\t\\t\\t\\trevealed messages."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "5",
    "NoteID": "5",
    "Body": "Lit., \"their plea was nothing but that they said\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "Cf.  5:109 ."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "Lit., \"relate to them with knowledge\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "Lit., \"for that they were wont to act wrongfully with\\n\\t\\t\\t\\tregard to Our messages\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "The sequence of these two statements - \"We have created\\n\\t\\t\\t\\tyou [i.e., \"brought you into being as living organisms\"]\\n\\t\\t\\t\\tand then formed you\" [or \"given you your shape\", i.e., as\\n\\t\\t\\t\\thuman beings] - is meant to bring out the fact of man's\\n\\t\\t\\t\\tgradual development, in the individual sense, from the\\n\\t\\t\\t\\tembryonic stage to full-fledged existence, as well as of\\n\\t\\t\\t\\tthe evolution of the human race as such."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "11",
    "NoteID": "10",
    "Body": "As regards God's allegorical command to the angels to\\n\\t\\t\\t\\t\"prostrate themselves\" before Adam, see {2:30-34}, and\\n\\t\\t\\t\\tthe corresponding notes. The reference to all mankind\\n\\t\\t\\t\\twhich precedes the story of Adam in this surah makes it\\n\\t\\t\\t\\tclear that his name symbolizes, in this context, the\\n\\t\\t\\t\\twhole human race. Western scholars usually take it for\\n\\t\\t\\t\\tgranted that the name \"Iblis\" is a corruption of the\\n\\t\\t\\t\\tGreek word diabolos, from which the English \"devil\" is\\n\\t\\t\\t\\tderived. There is, however, not the slightest evidence\\n\\t\\t\\t\\tthat the pre-Islamic Arabs borrowed this or any other\\n\\t\\t\\t\\tmythological term from the Greeks - while, on the other\\n\\t\\t\\t\\thand, it is established that the Greeks derived a good\\n\\t\\t\\t\\tdeal of their mythological concepts (including various\\n\\t\\t\\t\\tdeities and their functions) from the much earlier\\n\\t\\t\\t\\tSouth-Arabian civilization (cf. Encyclopaedia of Islam I,\\n\\t\\t\\t\\t379 f.). One may, therefore, assume with something\\n\\t\\t\\t\\tapproaching certainty that the Greek diabolos is a\\n\\t\\t\\t\\tHellenized form of the Arabic name for the Fallen Angel,\\n\\t\\t\\t\\twhich, in turn, is derived from the root-verb ablasa, \"he\\n\\t\\t\\t\\tdespaired\" or \"gave up hope\" or \"became broken in spirit\"\\n\\t\\t\\t\\t(see Lane I, 248). The fact that the noun diabolos\\n\\t\\t\\t\\t(\"slanderer\" - derived from the verb diaballein, \"to\\n\\t\\t\\t\\tthrow [something] across\") is of genuinely Greek origin\\n\\t\\t\\t\\tdoes not, by itself, detract anything from this\\n\\t\\t\\t\\thypothesis: for it is conceivable that the Greeks, with\\n\\t\\t\\t\\ttheir well-known tendency to Hellenize foreign names,\\n\\t\\t\\t\\tidentified the name \"Iblls\" with the, to them, much more\\n\\t\\t\\t\\tfamiliar term diabolos. - As regards Iblis' statement, in\\n\\t\\t\\t\\tthe next verse, that he had been created \"out of fire\",\\n\\t\\t\\t\\tsee surah {38}, note [60]."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "16",
    "NoteID": "11",
    "Body": "Or: \"allowed me to fall into error\". The term aghwahu\\n\\t\\t\\t\\tdenotes both \"he caused [or \"allowed\"] him to err\" or \"he\\n\\t\\t\\t\\tcaused him to be disappointed\" or \"to fail in attaining\\n\\t\\t\\t\\this desire\" (cf. Lane VI, 2304f.). Since, in this case,\\n\\t\\t\\t\\tthe saying of Iblis refers to the loss of his erstwhile\\n\\t\\t\\t\\tposition among the angels, the rendering adopted by me\\n\\t\\t\\t\\tseems to be the most appropriate."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "17",
    "NoteID": "12",
    "Body": "Lit., \"from between their hands and from behind them\".\\n\\t\\t\\t\\tRegarding this idiomatic expression and my rendering of\\n\\t\\t\\t\\tit, see the similar phrase in  2:255  (\"He knows all that\\n\\t\\t\\t\\tlies open before men and all that is hidden from them\").\\n\\t\\t\\t\\tThe subsequent phrase \"from their right and from their\\n\\t\\t\\t\\tleft\" signifies \"from all directions and by all possible\\n\\t\\t\\t\\tmeans\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "19",
    "NoteID": "13",
    "Body": "See  2:35  and  20:120 , as well as the corresponding\\n\\t\\t\\t\\tnotes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "20",
    "NoteID": "14",
    "Body": "Lit., \"so as to make manifest to them that of their\\n\\t\\t\\t\\tnakedness which [hitherto] had been imperceptible to\\n\\t\\t\\t\\tthem\": an allegory of the state of innocence in which man\\n\\t\\t\\t\\tlived before his fall from grace - that is, before his\\n\\t\\t\\t\\tconsciousness made him aware of himself and of the\\n\\t\\t\\t\\tpossibility of choosing between alternative courses of\\n\\t\\t\\t\\taction, with all the attending temptations towards evil\\n\\t\\t\\t\\tand the misery which must follow a wrong choice."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "20",
    "NoteID": "15",
    "Body": "Lit., \"or [lest] you become of those who are enduring\":\\n\\t\\t\\t\\tthus instilling in them the desire to live forever and to\\n\\t\\t\\t\\tbecome, in this respect, like God. See note [106] on\\n\\t\\t\\t\\t 20:120 ."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "24",
    "NoteID": "16",
    "Body": "Sc., \"from this state of blessedness and innocence\". As\\n\\t\\t\\t\\tin the parallel account of this parable of the Fall in\\n\\t\\t\\t\\t{2:35-36}, the dual form of address changes at this stage\\n\\t\\t\\t\\tinto the plural, thus connecting once again with verse\\n\\t\\t\\t\\t{10} and the beginning of verse {11} of this surah, and\\n\\t\\t\\t\\tmaking it clear that the story of Adam and Eve is, in\\n\\t\\t\\t\\treality, an allegory of human destiny. In his earlier\\n\\t\\t\\t\\tstate of innocence man was unaware of the existence of\\n\\t\\t\\t\\tevil and, therefore, of the ever-present necessity of\\n\\t\\t\\t\\tmaking a choice between the many possibilities of action\\n\\t\\t\\t\\tand behaviour: in other words, he lived, like all other\\n\\t\\t\\t\\tanimals, in the light of his instincts alone. Inasmuch,\\n\\t\\t\\t\\thowever, as this innocence was only a condition of his\\n\\t\\t\\t\\texistence and not a virtue, it gave to his life a static\\n\\t\\t\\t\\tquality and thus precluded him from moral and\\n\\t\\t\\t\\tintellectual development The growth of his consciousness\\n\\t\\t\\t\\t- symbolized by the wilful act of disobedience to God's\\n\\t\\t\\t\\tcommand - changed all this. It transformed him from a\\n\\t\\t\\t\\tpurely instinctive being into a full-fledged human entity\\n\\t\\t\\t\\tas we know it - a human being capable of discerning\\n\\t\\t\\t\\tbetween right and wrong and thus of choosing his way of\\n\\t\\t\\t\\tlife. In this deeper sense, the allegory of the Fall does\\n\\t\\t\\t\\tnot describe a retrogressive happening but, rather, a new\\n\\t\\t\\t\\tstage of human development: an opening of doors to moral\\n\\t\\t\\t\\tconsiderations. By forbidding him to \"approach this\\n\\t\\t\\t\\ttree\", God made it possible for man to act wrongly - and\\n\\t\\t\\t\\ttherefore, to act rightly as well: and so man became\\n\\t\\t\\t\\tendowed with that moral free will which distinguishes him\\n\\t\\t\\t\\tfrom all other sentient beings. - Regarding the role of\\n\\t\\t\\t\\tSatan - or Iblis - as the eternal tempter of man, see\\n\\t\\t\\t\\tnote [26] on  2:34  and note [31] on  15:41 ."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "26",
    "NoteID": "17",
    "Body": "Lit., \"as plumage\" - a metaphorical expression derived\\n\\t\\t\\t\\tfrom the beauty of birds' plumage."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "26",
    "NoteID": "18",
    "Body": "Lit., \"this is [one] of God's messages, so that they...\",\\n\\t\\t\\t\\tetc."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "27",
    "NoteID": "19",
    "Body": "Lit., \"see you from where you do not see them\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "27",
    "NoteID": "20",
    "Body": "The interpolated word \"truly\" is implied in this phrase\\n\\t\\t\\t\\tin view of the subsequent reference to the erroneous\\n\\t\\t\\t\\tbeliefs of such people: for, although their beliefs are\\n\\t\\t\\t\\twrong, some of them are under the impression that the\\n\\t\\t\\t\\t\"shameful deeds\" subsequently referred to have been\\n\\t\\t\\t\\tenjoined by God. As for the \"satanic forces\" (shayatin),\\n\\t\\t\\t\\tit is to be remembered that this designation is applied\\n\\t\\t\\t\\tin the Qur'an to all kinds of wicked impulses or\\n\\t\\t\\t\\tpropensities that are \"near unto\" (i.e., in the hearts\\n\\t\\t\\t\\tof) those who do not truly believe in God see note [31]\\n\\t\\t\\t\\ton  14:22 : hence, the term shayatin occurring in verse\\n\\t\\t\\t\\t{30} below has been rendered as \"evil impulses\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "29",
    "NoteID": "21",
    "Body": "The term wajh (lit., \"face\") occurring here is often\\n\\t\\t\\t\\tused, in the abstract sense, to denote a person's entire\\n\\t\\t\\t\\tbeing or entire attention - as, for instance, in the\\n\\t\\t\\t\\tphrase aslamtu wajhi li'llahi, \"I have surrendered my\\n\\t\\t\\t\\twhole being unto God\" {3: 20}. The word masjid, which\\n\\t\\t\\t\\tusually signifies the time or place of prostration in\\n\\t\\t\\t\\tprayer (sujud), evidently stands in this context - as\\n\\t\\t\\t\\twell as in verse {31} below - for any act of worship."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "30",
    "NoteID": "22",
    "Body": "Lit., \"will have become incumbent upon them\" (haqqa\\n\\t\\t\\t\\t'alayhim), implying that this straying was an inevitable\\n\\t\\t\\t\\tconsequence of their own doings and attitudes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "31",
    "NoteID": "23",
    "Body": "Lit., \"take to your adornment (zinah)\". According to\\n\\t\\t\\t\\tRaghib (as quoted in Lane III, 1279 f ), the proper\\n\\t\\t\\t\\tmeaning of zinah is \"a [beautifying] thing that does not\\n\\t\\t\\t\\tdisgrace or render unseemly ... either in the present\\n\\t\\t\\t\\tworld or in that which is to come\": thus, it signifies\\n\\t\\t\\t\\tanything of beauty in both the physical and moral\\n\\t\\t\\t\\tconnotations of the word."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "32",
    "NoteID": "24",
    "Body": "By declaring that all good and beautiful things of life -\\n\\t\\t\\t\\ti.e., those which are not expressly prohibited - are\\n\\t\\t\\t\\tlawful to the believers, the Qur'an condemns, by\\n\\t\\t\\t\\timplication, all forms of life-denying asceticism,\\n\\t\\t\\t\\tworld-renunciation and self-mortification. While, in the\\n\\t\\t\\t\\tlife of this world, those good things are shared by\\n\\t\\t\\t\\tbelievers and unbelievers alike, they will be denied to\\n\\t\\t\\t\\tthe latter in the hereafter cf. verses {5-51} of this\\n\\t\\t\\t\\tsurah."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "34",
    "NoteID": "25",
    "Body": "Lit., \"for every community (ummah) there is a term\":\\n\\t\\t\\t\\ti.e., all people have a life-term decreed by God, during\\n\\t\\t\\t\\twhich they are at liberty to accept or to reject the\\n\\t\\t\\t\\tguidance offered them through revelation. The word ummah\\n\\t\\t\\t\\toften denotes \"living beings\" - in this context,\\n\\t\\t\\t\\t\"people\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "34",
    "NoteID": "26",
    "Body": "In Arabic usage, the term sa'ah (lit., \"hour\") signifies\\n\\t\\t\\t\\tnot merely the astronomical hour - i.e., the\\n\\t\\t\\t\\ttwenty-fourth part of a mean solar day - but also \"time\"\\n\\t\\t\\t\\tin an absolute sense, or any fraction of it, whether\\n\\t\\t\\t\\tlarge or small. In the above context, it has obviously\\n\\t\\t\\t\\tbeen used in the sense of \"a least fraction of time\" or\\n\\t\\t\\t\\t\"a single moment\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "37",
    "NoteID": "27",
    "Body": "Lit., \"their share of the [divine] decree (al-kitab) will\\n\\t\\t\\t\\treach them\": i.e., they will have in their lifetime, like\\n\\t\\t\\t\\tall other people, all the good or bad fortune envisaged\\n\\t\\t\\t\\tfor them in God's eternal decree. The \"messengers\"\\n\\t\\t\\t\\t(rusul) referred to in the next clause are, apparently,\\n\\t\\t\\t\\tthe angels of death."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "38",
    "NoteID": "28",
    "Body": "The terms \"first\" and \"last\" refer here either to a\\n\\t\\t\\t\\tsequence in time (\"those who came earlier\" and \"those who\\n\\t\\t\\t\\tcame later\") or in status (\"leaders\" and \"followers\");\\n\\t\\t\\t\\tand in both cases they relate, as the next sentence\\n\\t\\t\\t\\tindicates, to the evil influence which the former exerted\\n\\t\\t\\t\\ton the latter during their lifetime - either directly, as\\n\\t\\t\\t\\tleaders of thought and persons of distinction, or\\n\\t\\t\\t\\tindirectly, as forerunners in time, whose example was\\n\\t\\t\\t\\tfollowed by later generations."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "38",
    "NoteID": "29",
    "Body": "Lit., \"to everyone a double [suffering]\": i.e., for\r\\n\\t\\t\\t\\thaving gone astray and for having, by his example, led\r\\n\\t\\t\\t\\tothers astray. Cf.  16:25  - \"on Resurrection Day they\r\\n\\t\\t\\t\\tshall bear the full weight of their own burdens, as well\r\\n\\t\\t\\t\\tas some of the burdens of those ignorant ones whom they\r\\n\\t\\t\\t\\thave led astray\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "39",
    "NoteID": "30",
    "Body": "I.e., \"You went the wrong way, as we did, out of your own\\n\\t\\t\\t\\tfree will, and you bear the same responsibility as we\\n\\t\\t\\t\\tdo.\" Another possible interpretation is: \"You are not\\n\\t\\t\\t\\tsuperior to us because you have learnt nothing from our\\n\\t\\t\\t\\tmistakes.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "40",
    "NoteID": "31",
    "Body": "According to Ibn 'Abbas (as quoted by Razi), this\\n\\t\\t\\t\\tmetaphor signifies that God will not accept any of the\\n\\t\\t\\t\\tgood deeds of such sinners, nor their subsequent\\n\\t\\t\\t\\tsupplications."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "40",
    "NoteID": "32",
    "Body": "Lit., \"until (hatta) a twisted rope passes through a\\n\\t\\t\\t\\tneedle's eye\"; since this phrase is meant to express an\\n\\t\\t\\t\\timpossibility, the rendering of hatta as \"any more than\"\\n\\t\\t\\t\\tseems to be appropriate here. As for the word jamal\\n\\t\\t\\t\\toccurring in this sentence, there is hardly any doubt\\n\\t\\t\\t\\tthat its translation, in this context, as \"camel\" is\\n\\t\\t\\t\\terroneous. As pointed out by Zamakhshari (and confirmed\\n\\t\\t\\t\\tby other classical commentators, including Razi), Ibn\\n\\t\\t\\t\\t'Abbas used to read the word in the spelling jummal,\\n\\t\\t\\t\\twhich signifies \"a thick rope\" or \"a twisted cable\"; and\\n\\t\\t\\t\\tthe same reading is attributed to 'Ali ibn Abi Talib (Taj\\n\\t\\t\\t\\tal-'Arus). It is to be noted that there are also several\\n\\t\\t\\t\\tother dialectical spellings of this word, namely, jumal,\\n\\t\\t\\t\\tjuml, jumul and, finally, jamal (as in the\\n\\t\\t\\t\\tgenerally-accepted version of the Qur'an) - all of them\\n\\t\\t\\t\\tsignifying \"a thick, twisted rope\" (Jawhari), and all of\\n\\t\\t\\t\\tthem used in this sense by some of the Prophet's\\n\\t\\t\\t\\tCompanions or their immediate successors (tabi'un). Ibn\\n\\t\\t\\t\\t'Abbas is also quoted by Zamakhshari as having said that\\n\\t\\t\\t\\tGod could not have coined so inappropriate a metaphor as\\n\\t\\t\\t\\t\"a camel passing through a needle's eye\" - meaning that\\n\\t\\t\\t\\tthere is no relationship whatsoever between a camel and a\\n\\t\\t\\t\\tneedle's eye whereas, on the other hand, there is a\\n\\t\\t\\t\\tdefinite relationship between the latter and a rope\\n\\t\\t\\t\\t(which after all, is but an extremely thick thread). On\\n\\t\\t\\t\\tall accounts, therefore, the rendering of jamal as \"a\\n\\t\\t\\t\\ttwisted rope\" is, in this context, infinitely preferable\\n\\t\\t\\t\\tto that of \"a camel\". The fact that the latter rendering\\n\\t\\t\\t\\toccurs in a somewhat similar phrase in the Greek version\\n\\t\\t\\t\\tof the Synoptic Gospels (Matthew xix, 24, Mark x, 25 and\\n\\t\\t\\t\\tLuke xviii, 25) does not affect this contention. One\\n\\t\\t\\t\\tshould remember that the Gospels were originally composed\\n\\t\\t\\t\\tin Aramaic, the language of Palestine at the time of\\n\\t\\t\\t\\tJesus, and that those Aramaic texts are now lost. It is\\n\\t\\t\\t\\tmore than probable that, owing to the customary absence\\n\\t\\t\\t\\tof vowel signs in Aramaic writing, the Greek translator\\n\\t\\t\\t\\tmisunderstood the consonant spelling g-m-l (corresponding\\n\\t\\t\\t\\tto the Arabic j-m-l), and took it to mean \"a camel\": a\\n\\t\\t\\t\\tmistake repeated since, with regard to the above\\n\\t\\t\\t\\tQur'an-verse, by many Muslims and all non-Muslim\\n\\t\\t\\t\\torientalists as well."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "41",
    "NoteID": "33",
    "Body": "Lit., \"for them there will be a resting-place of [the\\n\\t\\t\\t\\tfires of] hell and, from above them, coverings\\n\\t\\t\\t\\t[thereof]\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "43",
    "NoteID": "34",
    "Body": "Lit., \"beneath them\": i.e., all blessings will be at\\n\\t\\t\\t\\ttheir command."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "44",
    "NoteID": "35",
    "Body": "Lit., \"an announcer\" (mu'adhdhin)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "46",
    "NoteID": "36",
    "Body": "The word hijab denotes anything that intervenes as an\\n\\t\\t\\t\\tobstacle between things or conceals one thing from\\n\\t\\t\\t\\tanother; it is used in both an abstract and a concrete\\n\\t\\t\\t\\tsense."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "46",
    "NoteID": "37",
    "Body": "The term al-a'raf (which gave to this surah its title)\\n\\t\\t\\t\\toccurs in the Qur'an only twice - namely, in the above\\n\\t\\t\\t\\tverse and in verse {48}. It is the plural of 'urf, which\\n\\t\\t\\t\\tprimarily denotes \"acknowledgement\" or \"discernment\", and\\n\\t\\t\\t\\tis also used to denote the highest, or most elevated,\\n\\t\\t\\t\\tpart of anything (because it is most easily discerned):\\n\\t\\t\\t\\tfor instance, the 'urf of a cock is the coxcomb, that of\\n\\t\\t\\t\\ta horse its mane, and so forth. On the basis of this\\n\\t\\t\\t\\tidiomatic usage, many commentators assume that the a'raf\\n\\t\\t\\t\\treferred to here are \"elevated places\", like the heights\\n\\t\\t\\t\\tof a wall or its ramparts, and identify it with the\\n\\t\\t\\t\\t\"barrier\" (hijab) mentioned at the end of the preceding\\n\\t\\t\\t\\tsentence. A far more likely interpretation, however, is\\n\\t\\t\\t\\tforthcoming from the primary significance of the word\\n\\t\\t\\t\\t'urf and its plural a'raf: namely, \"discernment\" and \"the\\n\\t\\t\\t\\tfaculty of discernment\", respectively. This\\n\\t\\t\\t\\tinterpretation has been adopted by some of the great,\\n\\t\\t\\t\\tearly commentators of the Qur'an, like Al-Hasan al-Basri\\n\\t\\t\\t\\tand Az-Zajjaj, whose views Razi quotes with evident\\n\\t\\t\\t\\tapproval. They state emphatically that the expression\\n\\t\\t\\t\\t'ala 'l-a'raf is synonymous with 'ala ma'rifah, that is,\\n\\t\\t\\t\\t\"possessing knowledge\" or \"endowed with the faculty of\\n\\t\\t\\t\\tdiscernment\" (i.e., between right and wrong), and that\\n\\t\\t\\t\\tthe persons thus described are those who in their\\n\\t\\t\\t\\tlifetime were able to discern between right and wrong\\n\\t\\t\\t\\t(\"recognizing each by its mark\"), but did not definitely\\n\\t\\t\\t\\tincline to either: in brief, the indifferent ones. Their\\n\\t\\t\\t\\tlukewarm attitude has prevented them from doing either\\n\\t\\t\\t\\tmuch good or much wrong - with the result that, as the\\n\\t\\t\\t\\tnext sentence shows, they deserve neither paradise nor\\n\\t\\t\\t\\thell. (Several Traditions to this effect are quoted by\\n\\t\\t\\t\\tTabari as well as by Ibn Kathir in their commentaries on\\n\\t\\t\\t\\tthis verse.) - The noun rijal (lit., \"men\") at the\\n\\t\\t\\t\\tbeginning of the next sentence as well as in verse {48}\\n\\t\\t\\t\\tobviously denotes \"persons\" of both sexes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "49",
    "NoteID": "38",
    "Body": "Implying either that the believers did not deserve God's\\n\\t\\t\\t\\tgrace or, alternatively, that God does not exist. The\\n\\t\\t\\t\\texpression \"you solemnly declared\" (lit., \"you said under\\n\\t\\t\\t\\toath\") is a metaphor for the unbelievers' utter\\n\\t\\t\\t\\tconviction in this respect."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "51",
    "NoteID": "39",
    "Body": "See  6:70  and the corresponding note [60]."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "52",
    "NoteID": "40",
    "Body": "Lit., \"with knowledge\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "53",
    "NoteID": "41",
    "Body": "In this context, the term ta'wil (which literally means\r\\n\\t\\t\\t\\t\"an endeavour to arrive at the final meaning [of a saying\r\\n\\t\\t\\t\\tor occurrence]\" - cf.  3:7 ) signifies the fulfilment of\r\\n\\t\\t\\t\\tthe warnings contained in the Qur'an: and in this sense\r\\n\\t\\t\\t\\tit connotes the \"unfolding of its final meaning\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "53",
    "NoteID": "42",
    "Body": "Cf. {6:27-28}."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "54",
    "NoteID": "43",
    "Body": "The conjunctive particle thumma which precedes this\\n\\t\\t\\t\\tclause does not always denote order in time (\"then\" or\\n\\t\\t\\t\\t\"thereupon\"). In cases where it is used to link parallel\\n\\t\\t\\t\\tstatements it has often the function of the simple\\n\\t\\t\\t\\tconjunction wa (\"and\") - as, for instance, in  2:29 \\n\\t\\t\\t\\t(\"and has applied His design...\", etc.) As regards the\\n\\t\\t\\t\\tterm 'arsh (lit., \"throne\" or \"seat of power\"), all\\n\\t\\t\\t\\tMuslim commentators, classical and modern, are\\n\\t\\t\\t\\tunanimously of the opinion that its metaphorical use in\\n\\t\\t\\t\\tthe Qur'an is meant to express God's absolute sway over\\n\\t\\t\\t\\tall His creation. It is noteworthy that in all the seven\\n\\t\\t\\t\\tinstances where God is spoken of in the Qur'an as\\n\\t\\t\\t\\t\"established on the throne of His almightiness\"  7:54 ,\\n\\t\\t\\t\\t 10:3 ,  13:2 ,  20:5 ,  25:59 ,  32:4  and  57:4 , this\\n\\t\\t\\t\\texpression is connected with a declaration of His having\\n\\t\\t\\t\\tcreated the universe. - The word yawm, commonly\\n\\t\\t\\t\\ttranslated as \"day\" - but rendered above as \"aeon\" - is\\n\\t\\t\\t\\tused in Arabic to denote any period, whether extremely\\n\\t\\t\\t\\tlong (\"aeon\") or extremely short (\"moment\"): its\\n\\t\\t\\t\\tapplication to an earthly \"day\" of twenty-four hours is\\n\\t\\t\\t\\tonly one of its many connotations. (Cf. in this respect\\n\\t\\t\\t\\tnote [26] above, where the meaning of sa'ah - lit.,\\n\\t\\t\\t\\t\"hour\" - is explained.)"
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "57",
    "NoteID": "44",
    "Body": "This is the key-sentence of the parable set forth in\\n\\t\\t\\t\\tverses {57-58}: by the exercise of the same life-giving\\n\\t\\t\\t\\tpower by which God causes plants to grow, He will\\n\\t\\t\\t\\tresurrect the dead at the end of time. The next sentence\\n\\t\\t\\t\\tcontinues the parable by likening those whose hearts are\\n\\t\\t\\t\\topen to the voice of truth to fertile earth, and those\\n\\t\\t\\t\\twho are bent on denying it, to barren earth."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "59",
    "NoteID": "45",
    "Body": "In continuation of the stress, in the preceding passages,\\n\\t\\t\\t\\ton God's omnipotence and transcendental oneness, verses\\n\\t\\t\\t\\t{59-93} refer to several of the earlier prophets, who\\n\\t\\t\\t\\tpreached the same truth, and whose names were familiar to\\n\\t\\t\\t\\tthe Arabs before the revelation of the Qur'an. Their\\n\\t\\t\\t\\tstories - beginning with that of Noah, who is considered\\n\\t\\t\\t\\tthe first apostle ever sent to mankind - are reduced here\\n\\t\\t\\t\\tto the warnings with which they unsuccessfully tried to\\n\\t\\t\\t\\tpersuade their people to worship God alone and to live\\n\\t\\t\\t\\trighteously."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "59",
    "NoteID": "46",
    "Body": "This refers either to the Day of Judgment or to the\\n\\t\\t\\t\\tapproaching deluge."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "64",
    "NoteID": "47",
    "Body": "Explaining this verse in his translation of the Qur'an,\\n\\t\\t\\t\\tMuhammad Ali rightly points out the latter \"does not\\n\\t\\t\\t\\tsupport the theory of a world deluge, for it plainly\\n\\t\\t\\t\\tstates ... that only people to whom Noah had delivered\\n\\t\\t\\t\\this message called him a liar, and ... were drowned ....\\n\\t\\t\\t\\tHence the deluge affected the territory of Noah's people,\\n\\t\\t\\t\\tnot the whole world, as the Bible would have us believe.\"\\n\\t\\t\\t\\tTo this may be added that the deluge spoken of in the\\n\\t\\t\\t\\tBible, in the myths of Sumeria and Babylonia, and,\\n\\t\\t\\t\\tfinally, in the Qur'an, most probably represents the\\n\\t\\t\\t\\tinundation, during the Ice Age, of the huge basin which\\n\\t\\t\\t\\ttoday is covered by the Mediterranean: an inundation\\n\\t\\t\\t\\twhich was due to the break-in of the Atlantic through the\\n\\t\\t\\t\\tland-barrier at the modern Gibraltar, and of the Black\\n\\t\\t\\t\\tSea through what is now the Dardanelles."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "65",
    "NoteID": "48",
    "Body": "Hud is said to have been the first Arabian prophet. He\\n\\t\\t\\t\\tmay be identical with the Biblical 'Eber, the ancestor of\\n\\t\\t\\t\\tthe Hebrews ('Ibrim) who - like most of the Semitic\\n\\t\\t\\t\\ttribes - had probably originated in South Arabia.\\n\\t\\t\\t\\t(References to 'Eber are found in Genesis x, 24-25 and\\n\\t\\t\\t\\txi, 14ff.) The ancient Arabian name Hud is still\\n\\t\\t\\t\\treflected in that of Jacob's son Judah (Yahudah in\\n\\t\\t\\t\\tHebrew) which provided the subsequent designation of the\\n\\t\\t\\t\\tJews. The name 'Eber - both in Hebrew and in its Arabic\\n\\t\\t\\t\\tform 'Abir - signifies \"one who crosses over\" (i.e., from\\n\\t\\t\\t\\tone territory to another), and may be a Biblical echo of\\n\\t\\t\\t\\tthe fact that this tribe \"crossed over\" from Arabia to\\n\\t\\t\\t\\tMesopotamia in pre-Abrahamic times. - The tribe of 'Ad,\\n\\t\\t\\t\\tto which Hud belonged (\"their brother Hud\"), inhabited\\n\\t\\t\\t\\tthe vast desert region known as Al-Ahqaf, between 'Uman\\n\\t\\t\\t\\tand Hadramawt, and was noted for its great power and\\n\\t\\t\\t\\tinfluence (see  89:8  - \"the like of whom has never been\\n\\t\\t\\t\\treared in all the land\"). It disappeared from history\\n\\t\\t\\t\\tmany centuries before the advent of Islam, but its memory\\n\\t\\t\\t\\talways remained alive in Arabian tradition."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "66",
    "NoteID": "49",
    "Body": "They considered him \"weak-minded\" because he expected\\n\\t\\t\\t\\tthem to give up their traditional beliefs and deities;\\n\\t\\t\\t\\tand a \"liar\", because he claimed to be a prophet of God."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "68",
    "NoteID": "50",
    "Body": "Lit., \"I am a trustworthy adviser to you\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "69",
    "NoteID": "51",
    "Body": "Lit., \"successors after Noah's people\" - i.e., the most\\n\\t\\t\\t\\tnumerous and powerful of all the tribes that descended\\n\\t\\t\\t\\tfrom Noah - \"and increased you abundantly in respect of\\n\\t\\t\\t\\t[your] natural endowment (khalq)\". The latter term also\\n\\t\\t\\t\\tsignifies \"power\" (Razi)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "71",
    "NoteID": "52",
    "Body": "A reference to their idolatry and obstinacy."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "71",
    "NoteID": "53",
    "Body": "Lit., \"names which you have named\" - i.e., the false\\n\\t\\t\\t\\tdeities, which have no real existence."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "71",
    "NoteID": "54",
    "Body": "Lit., \"I shall be, together with you, among those who\\n\\t\\t\\t\\twait.\""
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "72",
    "NoteID": "55",
    "Body": "As is shown in {69:6-8}, this destruction came about\\n\\t\\t\\t\\tthrough a violent sandstorm raging without a break for\\n\\t\\t\\t\\tseven nights and eight days."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "73",
    "NoteID": "7",
    "Body": "The Nabataean tribe of Thamud descended from the tribe of\r\\n\\t\\t\\t\\t'Ad mentioned in the preceding passage, and is,\r\\n\\t\\t\\t\\ttherefore, often referred to in pre-Islamic poetry as the\r\\n\\t\\t\\t\\t\"Second 'Ad\". Apart from Arabian sources, \"a series of\r\\n\\t\\t\\t\\tolder references, not of Arabian origin, confirm the\r\\n\\t\\t\\t\\thistorical existence of the name and people of Thamud.\r\\n\\t\\t\\t\\tThus the inscription of Sargon of the year 715 B.C.\r\\n\\t\\t\\t\\tmentions the Thamad among the people of eastern and\r\\n\\t\\t\\t\\tcentral Arabia subjected by the Assyrians. We also find\r\\n\\t\\t\\t\\tthe Thamudaei, Thamudenes mentioned in Aristo, Ptolemy,\r\\n\\t\\t\\t\\tand Pliny\" (Encyclopaedia of Islam IV, 736). At the time\r\\n\\t\\t\\t\\tof which the Qur'an speaks, the Thamud were settled in\r\\n\\t\\t\\t\\tthe northernmost Hijaz, near the confines of Syria.\r\\n\\t\\t\\t\\tRock-inscriptions attributed to them are still extant in\r\\n\\t\\t\\t\\tthe region of Al-Hijr. - As in the case of the 'Adite\r\\n\\t\\t\\t\\tprophet Hud - and the prophet Shu'ayb spoken of in verses\r\\n\\t\\t\\t\\t{85-93} of this surah - Salih is called the \"brother\" of\r\\n\\t\\t\\t\\tthe tribe because he belonged to it."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "73",
    "NoteID": "57",
    "Body": "The commentators cite various legends to the effect that\\n\\t\\t\\t\\tthis she-camel was of miraculous origin. Since neither\\n\\t\\t\\t\\tthe Qur'an nor any authentic Tradition provides the least\\n\\t\\t\\t\\tsupport for these legends, we must assume that they are\\n\\t\\t\\t\\tbased on the expression naqat Allah (\"God's she-camel\"),\\n\\t\\t\\t\\twhich has led some pious Muslims to fantastic\\n\\t\\t\\t\\tconjectures. However, as Rashid Rida' points out (Manar\\n\\t\\t\\t\\tVIII, 502), this expression denotes merely the fact that\\n\\t\\t\\t\\tthe animal in question was not owned by any one person,\\n\\t\\t\\t\\tand was therefore to be protected by the whole tribe; a\\n\\t\\t\\t\\tfurther, analogous expression is found in the words\\n\\t\\t\\t\\t\"God's earth\" in the same verse: an illustration of the\\n\\t\\t\\t\\tfact that everything belongs to God. The particular\\n\\t\\t\\t\\tstress placed by Salih on good treatment of this\\n\\t\\t\\t\\townerless animal - referred to in several places in the\\n\\t\\t\\t\\tQur'an - was obviously due to the cruel high-handedness\\n\\t\\t\\t\\tdisplayed by the tribe, who, as the next two verses show,\\n\\t\\t\\t\\twere wont to \"act wickedly on earth by spreading\\n\\t\\t\\t\\tcorruption\" and \"gloried in their arrogance towards all\\n\\t\\t\\t\\twho were deemed weak\": in other words, their treatment of\\n\\t\\t\\t\\tthe defenceless animal was to be a \"token\" of their\\n\\t\\t\\t\\tchange of heart or (as is made clear in  54:27 ) \"a test\\n\\t\\t\\t\\tfor them\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "74",
    "NoteID": "58",
    "Body": "Cf. the parallel expression in verse {69} above - \"heirs\\n\\t\\t\\t\\tto Noah's people\" - and the corresponding note. From all\\n\\t\\t\\t\\tthe historical references to the Thamud it is apparent\\n\\t\\t\\t\\tthat they were one of the greatest and most powerful Arab\\n\\t\\t\\t\\ttribes of their time."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "74",
    "NoteID": "59",
    "Body": "A reference to the elaborate rock-dwellings or tombs - to\\n\\t\\t\\t\\tbe seen to this day - which the Thamud carved out of the\\n\\t\\t\\t\\tcliffs west of Al-Hijr, in northern Hijaz, and\\n\\t\\t\\t\\tembellished with sculptures of animals as well as many\\n\\t\\t\\t\\tinscriptions attesting to the comparatively high degree\\n\\t\\t\\t\\tof their civilization and power. In popular Arabian\\n\\t\\t\\t\\tparlance, these rock-dwellings are nowadays called\\n\\t\\t\\t\\tMada'in Salih (\"The Towns of Salih\")."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "75",
    "NoteID": "60",
    "Body": "The contents of his message (lit., \"that with which he\\n\\t\\t\\t\\thas been sent\") appeared to them justification enough to\\n\\t\\t\\t\\taccept it on its merits, without the need of any esoteric\\n\\t\\t\\t\\t\"proof\" of Salih's mission. In a subtle way, this\\n\\t\\t\\t\\tstatement of faith has a meaning which goes far beyond\\n\\t\\t\\t\\tthe story of the Thamud. It is an invitation to the\\n\\t\\t\\t\\tsceptic who is unable to believe in the divine origin of\\n\\t\\t\\t\\ta religious message, to judge it on its intrinsic merits\\n\\t\\t\\t\\tand not to make his acceptance dependent on extraneous,\\n\\t\\t\\t\\tand objectively impossible, proofs of its origin: for\\n\\t\\t\\t\\tonly through the contents of a message can its truth and\\n\\t\\t\\t\\tvalidity be established."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "77",
    "NoteID": "61",
    "Body": "The verb 'aqara primarily denotes \"he hamstrung [an\\n\\t\\t\\t\\tanimal]\" - i.e., before slaughtering it, so that it might\\n\\t\\t\\t\\tnot run away. This barbarous custom was widely practiced\\n\\t\\t\\t\\tin pre-Islamic Arabia, so that 'aqr (\"hamstringing\")\\n\\t\\t\\t\\tgradually became synonymous with slaughtering in a cruel\\n\\t\\t\\t\\tmanner (Razi; see also Lane V, 2107 f.)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "78",
    "NoteID": "62",
    "Body": "Lit., \"they became, in their homes, prostrate on the\\n\\t\\t\\t\\tground\". The term rajfah which occurs at the beginning of\\n\\t\\t\\t\\tthis sentence signifies any violent commotion or\\n\\t\\t\\t\\ttrembling, and is often, though not always, applied to an\\n\\t\\t\\t\\tearthquake (rajfat al-ard). It is possible that the\\n\\t\\t\\t\\tearthquake mentioned here was accompanied by the volcanic\\n\\t\\t\\t\\teruption which at some time overtook the historical\\n\\t\\t\\t\\tdwelling-places of the Thamud tribe, and to which the\\n\\t\\t\\t\\textensive black lava-fields (harrah) of northern Hijaz,\\n\\t\\t\\t\\tand particularly near Mada'in Salih see note [59] above,\\n\\t\\t\\t\\tbear eloquent witness to this day."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "80",
    "NoteID": "63",
    "Body": "The story of Lot, Abraham's nephew (Lut in Arabic), is\\n\\t\\t\\t\\tgiven in greater detail in {11:69-83}."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "82",
    "NoteID": "64",
    "Body": "Lit., \"their answer was nothing but that they said\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "82",
    "NoteID": "65",
    "Body": "Lit., \"who purify themselves\"; also, \"who keep aloof from\\n\\t\\t\\t\\tunclean things\": here obviously used ironically. The\\n\\t\\t\\t\\tplural relates to Lot, his family and his followers cf.\\n\\t\\t\\t\\t 27:56 ."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "83",
    "NoteID": "66",
    "Body": "Contrary to the Biblical account, according to which\\n\\t\\t\\t\\tLot's wife only \"looked back\" inadvertently (Genesis xix,\\n\\t\\t\\t\\t26), the Qur'an makes it clear in  11:81  and  66:10 \\n\\t\\t\\t\\tthat she remained behind deliberately, being at heart one\\n\\t\\t\\t\\twith the sinning people of Sodom and having no faith in\\n\\t\\t\\t\\ther husband."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "85",
    "NoteID": "67",
    "Body": "Shu'ayb is said to be identical with Jethro, the\\n\\t\\t\\t\\tfather-in-law of Moses, also called in the Bible Reu-el\\n\\t\\t\\t\\t(Exodus ii, 18), meaning \"Faithful to God\". The region of\\n\\t\\t\\t\\tMadyan - the Midian of the Bible - extended from the\\n\\t\\t\\t\\tpresent-day Gulf of Aqabah westwards deep into the Sinai\\n\\t\\t\\t\\tPeninsula and to the mountains of Moab east of the Dead\\n\\t\\t\\t\\tSea; its inhabitants were Arabs of the Amorite group of\\n\\t\\t\\t\\ttribes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "85",
    "NoteID": "68",
    "Body": "Lit., \"do not diminish to people their things\" - an\\n\\t\\t\\t\\texpression which applies to physical possessions as well\\n\\t\\t\\t\\tas to moral and social rights. Regarding my interpolation\\n\\t\\t\\t\\tof \"in all your dealings\", see surah {6}, note [150]."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "86",
    "NoteID": "69",
    "Body": "Thus Zamakhshari and Razi, stressing the metaphorical\\n\\t\\t\\t\\tmeaning of the above phrase. Cf. a similar expression,\\n\\t\\t\\t\\tattributed to Satan, in verse {16} of this surah."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "89",
    "NoteID": "70",
    "Body": "Lit., \"inventing a lie about God\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "89",
    "NoteID": "71",
    "Body": "An expression of humility, and not of the idea that God\\n\\t\\t\\t\\tmight \"will\" them to blaspheme."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "89",
    "NoteID": "72",
    "Body": "Or: \"Thou art the best of all deciders\" - since the verb\\n\\t\\t\\t\\tfataha can also be rendered as \"he decided\". However,\\n\\t\\t\\t\\tShu'ayb's prayer could not have implied a request for\\n\\t\\t\\t\\tGod's \"decision\" (for there was no doubt in his mind as\\n\\t\\t\\t\\tto who was right), and therefore the primary significance\\n\\t\\t\\t\\tof iftah (\"lay open\") and fatih (\"one who lays open\",\\n\\t\\t\\t\\ti.e., the truth) is preferable."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "91",
    "NoteID": "73",
    "Body": "See note [62] above. Like the harrah once inhabited by\\n\\t\\t\\t\\tthe Thamud tribe, the adjoining region of Madyan (the\\n\\t\\t\\t\\tBiblical Midian) shows ample evidence of volcanic\\n\\t\\t\\t\\teruptions and earthquakes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "95",
    "NoteID": "74",
    "Body": "Lit. \"then We put good [things] in place of the bad\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "95",
    "NoteID": "75",
    "Body": "I.e., they regarded it as a normal course of events and\\n\\t\\t\\t\\tdid not draw any lesson from it."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "95",
    "NoteID": "76",
    "Body": "Cf. {6:42-45}."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "96",
    "NoteID": "77",
    "Body": "Thus the discourse returns to its starting-point at the\r\\n\\t\\t\\t\\tbeginning of this surah (verses {4-5}): namely, that the\r\\n\\t\\t\\t\\tdestruction which is bound to overtake any community (the\r\\n\\t\\t\\t\\tproper significance of the term qaryah in this context)\r\\n\\t\\t\\t\\twhich lives in opposition to the eternal moral verities\r\\n\\t\\t\\t\\tamounts, in the last resort, to self-annihilation: for\r\\n\\t\\t\\t\\tthis is the real meaning of God's \"taking them to task\r\\n\\t\\t\\t\\tthrough what (bi-ma) they themselves were doing\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "98",
    "NoteID": "78",
    "Body": "I.e., while they enjoy ease and a sense of security, and\r\\n\\t\\t\\t\\tare unaware of any danger that may threaten them (cf.\r\\n\\t\\t\\t\\tverse {4} of this surah)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "99",
    "NoteID": "79",
    "Body": "I.e., morally lost and, therefore, destined to perish.\\n\\t\\t\\t\\tThe term makr Allah (\"God's deep devising\") denotes here\\n\\t\\t\\t\\tHis unfathomable planning, which is alluded to elsewhere\\n\\t\\t\\t\\tin the Qur'an by the expression sunnat Allah (\"God's\\n\\t\\t\\t\\t[unchangeable] way\" - cf., in particular,  33:62 ,\\n\\t\\t\\t\\t 35:43  and  48:23 )."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "100",
    "NoteID": "80",
    "Body": "Lit., \"after its [former] people\". The people \"who have\\n\\t\\t\\t\\tinherited the earth\" are those now living."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "100",
    "NoteID": "81",
    "Body": "See surah {2}, note [7]. Here, again, we have an\\n\\t\\t\\t\\taffirmation that what the Qur'an describes as \"God's\\n\\t\\t\\t\\tpunishment\" (as well as \"God's reward\") is, in reality, a\\n\\t\\t\\t\\tconsequence of man's own doings, and not an arbitrary act\\n\\t\\t\\t\\tof God: it is \"by means of their sins\" (bi-dhunubihim)\\n\\t\\t\\t\\tthat God \"sets a seal\" upon the hearts of men. This\\n\\t\\t\\t\\tstatement is further elucidated at the end of verse\\n\\t\\t\\t\\t{101}."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "101",
    "NoteID": "82",
    "Body": "Lit., \"to which they had given the lie aforetime\": an\\n\\t\\t\\t\\tallusion to the instinctive unwillingness of most people\\n\\t\\t\\t\\tto give up the notions - positive or negative - to which\\n\\t\\t\\t\\tthey are accustomed."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "102",
    "NoteID": "83",
    "Body": "Thus Raghib explains the term 'ahd occurring in this\\n\\t\\t\\t\\tsentence. Its usual rendering as \"covenant\" or \"loyalty\\n\\t\\t\\t\\tto their covenant\" is entirely meaningless in this\\n\\t\\t\\t\\tcontext. Rashid Rida' widens Raghib's interpretation and\\n\\t\\t\\t\\tincludes in the above term man's instinctive ability to\\n\\t\\t\\t\\tdiscern between right and wrong and, thus, to follow the\\n\\t\\t\\t\\tdictates of his own conscience (Manar IX, 33 ff.).\\n\\t\\t\\t\\tRegarding the deeper implications of this expression, see\\n\\t\\t\\t\\tsurah {2}, note [19]."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "103",
    "NoteID": "84",
    "Body": "Lit., \"they did wrong to them\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "108",
    "NoteID": "85",
    "Body": "As is evident from  20:22 ,  27:12  and  28:32 , the hand\\n\\t\\t\\t\\tof Moses was \"[shining] white without blemish\", i.e.,\\n\\t\\t\\t\\tendowed with transcendent luminosity in token of his\\n\\t\\t\\t\\tprophethood - and not, as stated in the Bible (Exodus iv,\\n\\t\\t\\t\\t6), \"leprous as snow\". Regarding the possible mystic\\n\\t\\t\\t\\tsignificance of the miracle of the staff, see note [14]\\n\\t\\t\\t\\ton  20:21 ."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "110",
    "NoteID": "86",
    "Body": "I.e., \"deprive you of your rule\". The plural \"you\"\\n\\t\\t\\t\\trelates to Pharaoh and the ruling class."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "111",
    "NoteID": "87",
    "Body": "I.e., Aaron, who - as is mentioned in several other\\n\\t\\t\\t\\tplaces in the Qur'an - accompanied Moses on his mission."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "113",
    "NoteID": "88",
    "Body": "The particle la preceding the noun ajr (\"reward\")\\n\\t\\t\\t\\tindicates an emphasis which gives to this combination the\\n\\t\\t\\t\\tmeaning of \"great reward\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "117",
    "NoteID": "89",
    "Body": "Implying that the act of Moses was a genuine miracle,\\n\\t\\t\\t\\twhereas that of the sorcerers was a feat of make-believe\\n\\t\\t\\t\\tcf.  20:66 ."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "120",
    "NoteID": "90",
    "Body": "Lit., \"the sorcerers were thrown down\" - i.e., they fell\\n\\t\\t\\t\\tto the ground as if thrown by a superior force\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "123",
    "NoteID": "91",
    "Body": "This personal pronoun may refer either to God or to\\n\\t\\t\\t\\tMoses; but a similar expression in  20:71  and  26:49 \\n\\t\\t\\t\\tmakes it obvious that it refers here to Moses."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "124",
    "NoteID": "92",
    "Body": "The grammatical forms la-uqatti'anna and\\n\\t\\t\\t\\tla-usallibannakam must be rendered as \"most certainly\\n\\t\\t\\t\\tshall I cut off [your hands and feet] in great numbers\"\\n\\t\\t\\t\\tand \"crucify you in great numbers\": and this indicates\\n\\t\\t\\t\\tthat either the repentant sorcerers thus addressed were\\n\\t\\t\\t\\tmany or, alternatively, that they had a large following\\n\\t\\t\\t\\tamong the people of Egypt. The latter assumption seems to\\n\\t\\t\\t\\tbe corroborated by the Biblical reference to the fact\\n\\t\\t\\t\\tthat many Egyptians joined the Israelites in their exodus\\n\\t\\t\\t\\tfrom Egypt: \"And a mixed multitude went up also with\\n\\t\\t\\t\\tthem\" (Exodus xii, 38). As regards my rendering of min\\n\\t\\t\\t\\tkhilaf as \"because of [your] perverseness\", see surah\\n\\t\\t\\t\\t{5}, note [44] (last sentence)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "129",
    "NoteID": "93",
    "Body": "This is, in the above context, the first hint of the\\n\\t\\t\\t\\tinconstancy and weakness of faith for which the Qur'an so\\n\\t\\t\\t\\toften blames the children of Israel: and this, together\\n\\t\\t\\t\\twith what follows in verses {138-140} and {148} ff., is\\n\\t\\t\\t\\tthe reason why the story of Moses has been included here\\n\\t\\t\\t\\tamong the stories of the earlier prophets whose warnings\\n\\t\\t\\t\\twere neglected by their communities."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "129",
    "NoteID": "94",
    "Body": "I.e., \"He will judge you by your actions\". As is evident\\n\\t\\t\\t\\tfrom the reference, in verse {137} below, to the\\n\\t\\t\\t\\t\"patience in adversity\" which the children of Israel\\n\\t\\t\\t\\tsubsequently displayed, it would seem that the hope held\\n\\t\\t\\t\\tout to them by Moses helped them, once again, to overcome\\n\\t\\t\\t\\ttheir moral weakness; but, at the same time, his words\\n\\t\\t\\t\\t\"God will behold how you act\" imply a distinct warning."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "131",
    "NoteID": "95",
    "Body": "The phrase tatayyara bihi signifies \"he attributed an\\n\\t\\t\\t\\tevil omen to him\" or \"he augured evil from him\". It is\\n\\t\\t\\t\\tbased on the pre-Islamic Arab custom of divining the\\n\\t\\t\\t\\tfuture or establishing an omen from the flight of birds.\\n\\t\\t\\t\\tThus, the noun ta'ir (lit., \"a flying creature\" or \"a\\n\\t\\t\\t\\tbird\") is often used in classical Arabic to denote\\n\\t\\t\\t\\t\"destiny\" or \"fortune\", both good and evil, as in the\\n\\t\\t\\t\\tnext sentence of the above verse (\"their [evil] fortune\\n\\t\\t\\t\\thad been decreed by [lit., \"was with\"] God\"). Instances\\n\\t\\t\\t\\tof this tropical employment of the expressions ta'ir and\\n\\t\\t\\t\\ttayr and their verbal derivations are also found in\\n\\t\\t\\t\\t 3:49 ,  5:110 ,  17:13 ,  27:47 , {36:18-19}."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "133",
    "NoteID": "96",
    "Body": "For a description of these plagues, see Exodus vii-x."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "135",
    "NoteID": "97",
    "Body": "Lit., \"until a term which they should reach\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "137",
    "NoteID": "98",
    "Body": "Palestine is spoken of as \"blessed\" because it was the\\n\\t\\t\\t\\tland in which Abraham, Isaac and Jacob had lived, and\\n\\t\\t\\t\\tbecause so many other prophets were to appear there."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "137",
    "NoteID": "99",
    "Body": "The promise of God referred to here is the one given to\\n\\t\\t\\t\\tthe children of Israel through Moses see verses {128} and\\n\\t\\t\\t\\t{129}."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "137",
    "NoteID": "100",
    "Body": "The story of the suffering of the Israelites during their\\n\\t\\t\\t\\tbondage in Egypt, their deliverance through Moses, their\\n\\t\\t\\t\\tcrossing of the Red Sea (or, more probably, of what today\\n\\t\\t\\t\\tis known as the Gulf of Suez) and the destruction of\\n\\t\\t\\t\\tPharaoh and his hosts is narrated in considerable detail\\n\\t\\t\\t\\tin the Bible (Exodus i-xiv). The Qur'an, on the other\\n\\t\\t\\t\\thand, does not give us a consecutive narrative: for\\n\\t\\t\\t\\thistorical narrative as such is never its purpose.\\n\\t\\t\\t\\tWhenever the Qur'an refers to past events - whether\\n\\t\\t\\t\\trecorded in the Bible or alive in Arabian tradition - it\\n\\t\\t\\t\\tdoes so exclusively with a view to bringing out elements\\n\\t\\t\\t\\tthat are relevant to the ethical teachings which it\\n\\t\\t\\t\\tpropounds."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "138",
    "NoteID": "101",
    "Body": "The Qur'an does not say who those people were. It is,\\n\\t\\t\\t\\thowever, probable that they belonged to the group of\\n\\t\\t\\t\\tArabian tribes described in the Bible as \"Amalekites\",\\n\\t\\t\\t\\twho inhabited southernmost Palestine, the adjoining\\n\\t\\t\\t\\tregions of the Hijaz, and parts of the Sinai Peninsula."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "140",
    "NoteID": "102",
    "Body": "I.e., by having raised so many prophets out of their\\n\\t\\t\\t\\tmidst."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "141",
    "NoteID": "103",
    "Body": "Cf.  2:49 . It appears that this passage is part of\\n\\t\\t\\t\\tMoses' reminder to his people (Manar IX, 115 ff.); I have\\n\\t\\t\\t\\tbrought this out by interpolating \"he reminded them of\\n\\t\\t\\t\\tthis word of God\" between brackets."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "142",
    "NoteID": "104",
    "Body": "According to several of the Prophet's Companions, and\\n\\t\\t\\t\\tparticularly Ibn 'Abbas, the first thirty nights were to\\n\\t\\t\\t\\tbe spent by Moses in spiritual preparation, including\\n\\t\\t\\t\\tfasting, whereupon the Law would be revealed to him in\\n\\t\\t\\t\\tthe remaining ten (Zamakhshari and Razi; see also Manar\\n\\t\\t\\t\\tIX, 119 ff.). In Arabic usage, a period of time\\n\\t\\t\\t\\tdesignated as \"nights\" comprises the days as well."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "143",
    "NoteID": "105",
    "Body": "Lit., \"then, in time (sawfa) wilt thou see Me\". As these\\n\\t\\t\\t\\twords express the impossibility of man's seeing God -\\n\\t\\t\\t\\twhich is clearly implied in the Arabic construction - a\\n\\t\\t\\t\\tliteral rendering would not do justice to it."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "143",
    "NoteID": "106",
    "Body": "Since Moses was already a believer, his words do not\\n\\t\\t\\t\\tmerely allude to belief in God's existence but, rather,\\n\\t\\t\\t\\tbelief in the impossibility of man's seeing God (Ibn\\n\\t\\t\\t\\tKathir, on the authority of Ibn 'Abbas)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "144",
    "NoteID": "107",
    "Body": "Lit., \"by virtue of My messages\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "145",
    "NoteID": "108",
    "Body": "See surah {6}, note [156]."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "145",
    "NoteID": "109",
    "Body": "Lit., \"I will show you the abode of the iniquitous\". The\r\\n\\t\\t\\t\\trendering adopted by me corresponds to the\r\\n\\t\\t\\t\\tinterpretations given by Tabari (on the authority of\r\\n\\t\\t\\t\\tMujahid and Al-Hasan al-Basri) and by Ibn Kathir;\r\\n\\t\\t\\t\\tregarding the meaning of dar (\"abode\") in this context,\r\\n\\t\\t\\t\\tsee surah {6}, note [118]. Some of the commentators are\r\\n\\t\\t\\t\\tof the opinion that the above sentence concludes God's\r\\n\\t\\t\\t\\tadmonition to Moses, but the plural form of address in \"I\r\\n\\t\\t\\t\\twill show you\" makes it more probable that it is the\r\\n\\t\\t\\t\\tbeginning of a parenthetic passage connected, no doubt,\r\\n\\t\\t\\t\\twith the preceding one, but having a general import not\r\\n\\t\\t\\t\\tconfined to Moses."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "146",
    "NoteID": "110",
    "Body": "As so often in the Qur'an, God's \"causing\" the sinners to\\n\\t\\t\\t\\tsin is shown to be a consequence of their own behaviour\\n\\t\\t\\t\\tand the result of their free choice. By \"those who,\\n\\t\\t\\t\\twithout any right, behave haughtily on earth\" are\\n\\t\\t\\t\\tobviously meant people who think that their own judgment\\n\\t\\t\\t\\tas to what constitutes right and wrong is the only valid\\n\\t\\t\\t\\tone, and who therefore refuse to submit their personal\\n\\t\\t\\t\\tconcerns to the criterion of absolute (i.e., revealed)\\n\\t\\t\\t\\tmoral standards; cf. {96:6-7} - \"man becomes grossly\\n\\t\\t\\t\\toverweening whenever he believes himself to be\\n\\t\\t\\t\\tself-sufficient\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "147",
    "NoteID": "111",
    "Body": "Lit., \"to the meeting (liqa')\" - in the sense of its\\n\\t\\t\\t\\tbeing a pre-ordained fact."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "147",
    "NoteID": "112",
    "Body": "This is the end of the parenthetic passage beginning with\\n\\t\\t\\t\\tthe words, \"I will show you the way the iniquitous shall\\n\\t\\t\\t\\tgo\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "148",
    "NoteID": "113",
    "Body": "The golden calf of the Israelites was obviously a result\\n\\t\\t\\t\\tof centuries-old Egyptian influences. The Egyptians\\n\\t\\t\\t\\tworshipped at Memphis the sacred bull, Apis, which they\\n\\t\\t\\t\\tbelieved to be an incarnation of the god Ptah. A new Apis\\n\\t\\t\\t\\twas supposed always to be born at the moment when the old\\n\\t\\t\\t\\tone died, while the soul of the latter was believed to\\n\\t\\t\\t\\tpass into Osiris in the Realm of the Dead, to be\\n\\t\\t\\t\\thenceforth worshipped as Osiris-Apis (the \"Serapis\" of\\n\\t\\t\\t\\tthe Greco-Egyptian period). The \"lowing sound\" (khuwar)\\n\\t\\t\\t\\twhich the golden calf emitted was probably produced by\\n\\t\\t\\t\\twind effects, as was the case with some of the hollow\\n\\t\\t\\t\\tEgyptian temple effigies."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "149",
    "NoteID": "114",
    "Body": "Lit., \"when it was made to fall upon their hands\" - an\\n\\t\\t\\t\\tidiomatic phrase denoting intense remorse, probably\\n\\t\\t\\t\\tderived from the striking (\"falling\") of hand upon hand\\n\\t\\t\\t\\tas an expression of grief or regret."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "149",
    "NoteID": "115",
    "Body": "The whole of verse {149} is a parenthetic clause (jumlah\\n\\t\\t\\t\\tmu'taridah) referring to a later time - for the\\n\\t\\t\\t\\trepentance of the Israelites came after Moses' return\\n\\t\\t\\t\\tfrom Mount Sinai, of which the next verse speaks."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "150",
    "NoteID": "116",
    "Body": "Lit., \"outrun\". The expression \"one has outrun a matter\"\\n\\t\\t\\t\\tis synonymous with \"he has forsaken it\" or \"left it\\n\\t\\t\\t\\tundone\" (Zamakhshari)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "150",
    "NoteID": "117",
    "Body": "Lit., \"made me [or \"deemed me\"] utterly weak\". Contrary\\n\\t\\t\\t\\tto the Biblical account (Exodus xxxii, 1-5), the Qur'an\\n\\t\\t\\t\\tdoes not accuse Aaron of having actually participated in\\n\\t\\t\\t\\tmaking or worshipping the golden calf; his guilt\\n\\t\\t\\t\\tconsisted in having remained passive in the face of his\\n\\t\\t\\t\\tpeople's idolatry for fear of causing a split among them\\n\\t\\t\\t\\tcf. {20:92-94}."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "151",
    "NoteID": "118",
    "Body": "Sc., \"for my anger and my harshness\" (Razi)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "152",
    "NoteID": "119",
    "Body": "Throughout the Qur'an, this expression is used to\\n\\t\\t\\t\\tdescribe (a) the attribution of divine qualities to any\\n\\t\\t\\t\\tconcrete or imaginary object or person, and (b) the\\n\\t\\t\\t\\tmaking of false statements about God, His attributes, or\\n\\t\\t\\t\\tthe contents of His messages. In the above context it\\n\\t\\t\\t\\trefers to any false imagery which deflects man from the\\n\\t\\t\\t\\tworship of the One God."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "153",
    "NoteID": "120",
    "Body": "Lit., \"after it\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "154",
    "NoteID": "121",
    "Body": "According to the Bible (Exodus xxxii, 19), Moses broke\\n\\t\\t\\t\\tthe tablets when he threw them down in anger; the\\n\\t\\t\\t\\tQur'anic narrative, however, shows them as having\\n\\t\\t\\t\\tremained intact."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "155",
    "NoteID": "122",
    "Body": "Most of the commentators take rajfah to mean here\\n\\t\\t\\t\\t\"earthquake\", as it evidently does in other places in the\\n\\t\\t\\t\\tQur'an (e.g., in verses {78} and {91} of this surah).\\n\\t\\t\\t\\tHowever, it should be remembered that this noun denotes\\n\\t\\t\\t\\tany \"violent commotion\" or \"trembling\", from whatever\\n\\t\\t\\t\\tcause; and since there is no reason to suppose that in\\n\\t\\t\\t\\tthis context an earthquake is meant, we may assume that\\n\\t\\t\\t\\tthe violent trembling which seized the seventy elders was\\n\\t\\t\\t\\tcaused by their intense regret and fear of God's\\n\\t\\t\\t\\tpunishment."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "156",
    "NoteID": "123",
    "Body": "Cf.  6:12  (and the corresponding note [10]), as well as\\n\\t\\t\\t\\t 6:54 ."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "157",
    "NoteID": "124",
    "Body": "The interpolation of the words \"later on\" before the\\n\\t\\t\\t\\treference to the Gospel is necessitated by the fact that\\n\\t\\t\\t\\tthe whole of this passage is addressed to Moses and the\\n\\t\\t\\t\\tchildren of Israel, that is, long before the Gospel (in\\n\\t\\t\\t\\tthe Qur'anic sense of this term - cf. surah {3}, note\\n\\t\\t\\t\\t[4]) was revealed to Jesus. The stories of some of the\\n\\t\\t\\t\\tearlier prophets given in this surah - beginning with the\\n\\t\\t\\t\\tstory of Noah and ending with that of Moses and the\\n\\t\\t\\t\\tchildren of Israel - constitute a kind of introduction to\\n\\t\\t\\t\\tthis command to follow the \"unlettered Prophet\",\\n\\t\\t\\t\\tMuhammad. The stress on his having been \"unlettered\"\\n\\t\\t\\t\\t(ummi), i.e., unable to read and write, serves to bring\\n\\t\\t\\t\\tout the fact that all his knowledge of the earlier\\n\\t\\t\\t\\tprophets and of the messages transmitted by them was due\\n\\t\\t\\t\\tto divine inspiration alone, and not to a familiarity\\n\\t\\t\\t\\twith the Bible as such. For the Old Testament predictions\\n\\t\\t\\t\\tof the advent of the Prophet Muhammad (especially in\\n\\t\\t\\t\\tDeuteronomy xviii, 15 and 18), see surah {2}, note [33];\\n\\t\\t\\t\\tfor the New Testament prophecies to the same effect, see\\n\\t\\t\\t\\t 61:6  and the corresponding note [6]."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "157",
    "NoteID": "125",
    "Body": "A reference to the many severe rituals and obligations\\n\\t\\t\\t\\tlaid down in Mosaic Law, as well as to the tendency\\n\\t\\t\\t\\ttowards asceticism evident in the teachings of the\\n\\t\\t\\t\\tGospels. Thus the Qur'an implies that those \"burdens and\\n\\t\\t\\t\\tshackles\", intended as means of spiritual discipline for\\n\\t\\t\\t\\tparticular communities and particular stages of man's\\n\\t\\t\\t\\tdevelopment, will become unnecessary as soon as God's\\n\\t\\t\\t\\tmessage to man shall have achieved its final, universal\\n\\t\\t\\t\\tcharacter in the teachings of the Last Prophet, Muhammad."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "158",
    "NoteID": "126",
    "Body": "This verse, placed parenthetically in the midst of the\r\\n\\t\\t\\t\\tstory of Moses and the children of Israel, is meant to\r\\n\\t\\t\\t\\telucidate the preceding passage. Each of the earlier\r\\n\\t\\t\\t\\tprophets was sent to his, and only his, community: thus,\r\\n\\t\\t\\t\\tthe Old Testament addresses itself only to the children\r\\n\\t\\t\\t\\tof Israel; and even Jesus, whose message had a wider\r\\n\\t\\t\\t\\tbearing, speaks of himself as \"sent only unto the lost\r\\n\\t\\t\\t\\tsheep of the house of Israel\" (Matthew xv, 24). In\r\\n\\t\\t\\t\\tcontrast, the message of the Qur'an is universal - that\r\\n\\t\\t\\t\\tis, addressed to mankind as a whole - and is neither\r\\n\\t\\t\\t\\ttime-bound nor confined to any particular cultural\r\\n\\t\\t\\t\\tenvironment. It is for this reason that Muhammad, through\r\\n\\t\\t\\t\\twhom this message was revealed, is described in the\r\\n\\t\\t\\t\\tQur'an  21:107  as an evidence of \"[God's] grace towards\r\\n\\t\\t\\t\\tall the worlds\" (i.e. towards all mankind), and as \"the\r\\n\\t\\t\\t\\tSeal of all Prophets\" ( 33:40 ) - in other words, the last\r\\n\\t\\t\\t\\tof them."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "159",
    "NoteID": "127",
    "Body": "I.e., people like those spoken of in {3:113-115}. With\\n\\t\\t\\t\\tthis verse, the discourse returns to the moral history of\\n\\t\\t\\t\\tthe children of Israel. The stress on the fact that there\\n\\t\\t\\t\\thave always been righteous people among them is meant to\\n\\t\\t\\t\\tcontrast this righteousness with the rebellious\\n\\t\\t\\t\\tsinfulness which most of them displayed throughout their\\n\\t\\t\\t\\tBiblical history. It provides, at the same time, an\\n\\t\\t\\t\\tindication that, although the wrongdoing of some of its\\n\\t\\t\\t\\tmembers may sometimes plunge whole communities into\\n\\t\\t\\t\\tsuffering, God judges men individually, and not in\\n\\t\\t\\t\\tgroups."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "162",
    "NoteID": "128",
    "Body": "For an explanation of this and the preceding verse, see\\n\\t\\t\\t\\t{2:58-59}, and the corresponding notes."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "163",
    "NoteID": "129",
    "Body": "Lit., \"on a day when they did not keep Sabbath\". Under\\n\\t\\t\\t\\tMosaic Law, they were obliged to refrain from all work -\\n\\t\\t\\t\\tand, therefore, also from fishing - on Sabbath-days, with\\n\\t\\t\\t\\tthe result that the fish were more plentiful and would\\n\\t\\t\\t\\tcome closer to the shore on those days: and the\\n\\t\\t\\t\\tinhabitants of the town took this as an excuse to break\\n\\t\\t\\t\\tthe Sabbath-law. Since the Qur'an does not mention the\\n\\t\\t\\t\\tname of the town nor give any indication as to the\\n\\t\\t\\t\\thistorical period in which those offences were committed,\\n\\t\\t\\t\\tit may be assumed that the story of the Sabbath-breakers\\n\\t\\t\\t\\t(alluded to in several places in the Qur'an) is a general\\n\\t\\t\\t\\tillustration of the tendency, so often manifested by the\\n\\t\\t\\t\\tchildren of Israel, to offend against their religious\\n\\t\\t\\t\\tlaws in pursuit of their passions or for the sake of\\n\\t\\t\\t\\tworldly gain. Although, according to the teachings of\\n\\t\\t\\t\\tIslam, the Mosaic dispensation has since been abrogated,\\n\\t\\t\\t\\tthe Qur'an frequently points out its great role in the\\n\\t\\t\\t\\thistory of man's monotheistic beliefs, and stresses again\\n\\t\\t\\t\\tand again its (time-bound) importance as a means of\\n\\t\\t\\t\\tenforcing spiritual discipline on the children of Israel.\\n\\t\\t\\t\\tTheir repeated, deliberate breaches of the Mosaic Law are\\n\\t\\t\\t\\tshown as evidence of their rebellious attitude towards\\n\\t\\t\\t\\tthat discipline and, thus, towards God's commandments in\\n\\t\\t\\t\\tgeneral."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "164",
    "NoteID": "130",
    "Body": "Lit., \"a community\" - obviously people who, while not\\n\\t\\t\\t\\tactively protesting against the impiety of their\\n\\t\\t\\t\\tenvironment, did not themselves participate in this\\n\\t\\t\\t\\tprofanation of the Sabbath."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "164",
    "NoteID": "131",
    "Body": "Lit., \"they\" - an allusion to the really pious among\\n\\t\\t\\t\\tthem, such as are described in verse {159} above."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "165",
    "NoteID": "132",
    "Body": "Lit., \"who were forbidding the evil\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "166",
    "NoteID": "133",
    "Body": "According to Zamakhshari and Razi, the expression \"We\r\\n\\t\\t\\t\\tsaid unto them\" is here synonymous with \"We decreed with\r\\n\\t\\t\\t\\tregard to them\" - God's \"saying\" being in this case a\r\\n\\t\\t\\t\\tmetonym for a manifestation of His will. As for the\r\\n\\t\\t\\t\\tsubstance of God's decree, \"Be as apes despicable\", the\r\\n\\t\\t\\t\\tfamous tabi'i Mujahid explain it thus: \"[Only] their\r\\n\\t\\t\\t\\thearts were transformed, that is, they were not [really]\r\\n\\t\\t\\t\\ttransformed into apes: this is but a metaphor (mathal)\r\\n\\t\\t\\t\\tcoined by God with regard to them, similar to the\r\\n\\t\\t\\t\\tmetaphor of 'the ass carrying books' [ 62:5 ]\" (Tabari, in\r\\n\\t\\t\\t\\this commentary on  2:65 ; also Manar I, 343; VI, 448; and\r\\n\\t\\t\\t\\tIX, 379). A similar explanation is given by Raghib. It\r\\n\\t\\t\\t\\tshould be borne in mind that the expression \"like an ape\"\r\\n\\t\\t\\t\\tis often used in classical Arabic to describe a person\r\\n\\t\\t\\t\\twho is unable to restrain his gross appetites or\r\\n\\t\\t\\t\\tpassions."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "168",
    "NoteID": "134",
    "Body": "Lit., \"so that they might return [to righteousness]\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "169",
    "NoteID": "135",
    "Body": "I.e., for breaking God's commandments in their pursuit of\\n\\t\\t\\t\\tworldly gain: an allusion to their persistent belief that\\n\\t\\t\\t\\tthey are \"God's chosen people\" and that, no matter what\\n\\t\\t\\t\\tthey do, His forgiveness and grace are assured to them by\\n\\t\\t\\t\\tvirtue of their being Abraham's descendants."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "169",
    "NoteID": "136",
    "Body": "A reference to their erroneous idea that God's\\n\\t\\t\\t\\tforgiveness could be obtained without sincere repentance.\\n\\t\\t\\t\\tThe divine writ mentioned twice in this passage is\\n\\t\\t\\t\\tobviously the Bible."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "171",
    "NoteID": "137",
    "Body": "Lit., \"when We shook the mountain over them\": possibly a\\n\\t\\t\\t\\treference to an earthquake which took place at the time\\n\\t\\t\\t\\tof the revelation of the Law (the \"tablets\") to Moses."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "171",
    "NoteID": "138",
    "Body": "This is the end, so far as this surah is concerned, of\\n\\t\\t\\t\\tthe story of the children of Israel. In accordance with\\n\\t\\t\\t\\tthe method of the Qur'an, their story is made an\\n\\t\\t\\t\\tobject-lesson for all believers in God, of whatever\\n\\t\\t\\t\\tcommunity or time: and, therefore, the next passage\\n\\t\\t\\t\\tspeaks of the \"children of Adam\", that is, of the whole\\n\\t\\t\\t\\thuman race."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "172",
    "NoteID": "139",
    "Body": "In the original, this passage is in the past tense (\"He\\n\\t\\t\\t\\tbrought forth\", \"He asked them\", etc.) thus stressing the\\n\\t\\t\\t\\tcontinuous recurrence of the above metaphorical\\n\\t\\t\\t\\t\"question\" and \"answer\": a continuity which is more\\n\\t\\t\\t\\tclearly brought out in translation by the use of the\\n\\t\\t\\t\\tpresent tense. According to the Qur'an, the ability to\\n\\t\\t\\t\\tperceive the existence of the Supreme Power is inborn in\\n\\t\\t\\t\\thuman nature (fitrah); and it is this instinctive\\n\\t\\t\\t\\tcognition - which may or may not be subsequently blurred\\n\\t\\t\\t\\tby self-indulgence or adverse environmental influences -\\n\\t\\t\\t\\tthat makes every sane human being \"bear witness about\\n\\t\\t\\t\\thimself\" before God. As so often in the Qur'an, God's\\n\\t\\t\\t\\t\"speaking\" and man's \"answering\" is a metonym for the\\n\\t\\t\\t\\tcreative act of God and of man's existential response to\\n\\t\\t\\t\\tit."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "175",
    "NoteID": "140",
    "Body": "Lit., \"convey to them the tiding of him\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "175",
    "NoteID": "141",
    "Body": "Lit., \"he became one of those who have strayed into\\n\\t\\t\\t\\tgrievous error\". In the original, this whole verse is in\\n\\t\\t\\t\\tthe past tense; but since its obvious purport is the\\n\\t\\t\\t\\tstatement of a general truth (cf. Razi, on the authority\\n\\t\\t\\t\\tof Qatadah,'Ikrimah and Abu Muslim) and not, as some\\n\\t\\t\\t\\tcommentators assume, a reference to a particular person,\\n\\t\\t\\t\\tit is best rendered in the present tense. The kind of man\\n\\t\\t\\t\\tspoken of here is one who has understood the divine\\n\\t\\t\\t\\tmessage but, nevertheless, refuses to admit its truth\\n\\t\\t\\t\\tbecause - as is pointed out in the next verse - he\\n\\t\\t\\t\\t\"clings to the earth\", i.e., is dominated by a\\n\\t\\t\\t\\tmaterialistic, \"earthly\" outlook on life. (Cf. the\\n\\t\\t\\t\\tallegory of \"a creature out of the earth\" in  27:82 )."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "176",
    "NoteID": "142",
    "Body": "Because his attitudes are influenced only by what his\\n\\t\\t\\t\\tearth-bound desires represent to him as his immediate\\n\\t\\t\\t\\t\"advantages\" or \"disadvantages\", the type of man alluded\\n\\t\\t\\t\\tto in this passage is always - whatever the outward\\n\\t\\t\\t\\tcircumstances - a prey to a conflict between his reason\\n\\t\\t\\t\\tand his base urges and, thus, to inner disquiet and\\n\\t\\t\\t\\timaginary fears, and cannot attain to that peace of mind\\n\\t\\t\\t\\twhich a believer achieves through his faith."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "179",
    "NoteID": "143",
    "Body": "See Appendix III."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "179",
    "NoteID": "144",
    "Body": "Lit., \"they are farther astray\" - inasmuch as animals\\n\\t\\t\\t\\tfollow only their instincts and natural needs and are not\\n\\t\\t\\t\\tconscious of the possibility or necessity of a moral\\n\\t\\t\\t\\tchoice."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "180",
    "NoteID": "145",
    "Body": "This passage connects with the mention, at the end of the\\n\\t\\t\\t\\tpreceding verse, of \"the heedless ones\" who do not use\\n\\t\\t\\t\\ttheir faculty of discernment in the way intended for it\\n\\t\\t\\t\\tby God, and remain heedless of Him who comprises within\\n\\t\\t\\t\\tHimself all the attributes of perfection and represents,\\n\\t\\t\\t\\ttherefore, the Ultimate Reality. As regards the\\n\\t\\t\\t\\texpression al-asma' al-husna (lit., \"the most perfect [or\\n\\t\\t\\t\\t\"most goodly\"] names\"), which occurs in the Qur'an four\\n\\t\\t\\t\\ttimes - i.e., in the above verse as well as in  17:110 ,\\n\\t\\t\\t\\t 20:8  and  59:24  - it is to be borne in mind that the\\n\\t\\t\\t\\tterm ism is, primarily, a word applied to denote the\\n\\t\\t\\t\\tsubstance or the intrinsic attributes of an object under\\n\\t\\t\\t\\tconsideration, while the term al-husna is the plural form\\n\\t\\t\\t\\tof al-ahsan (\"that which is best\" or \"most goodly\").\\n\\t\\t\\t\\tThus, the combination al-asma' al-husna may be\\n\\t\\t\\t\\tappropriately rendered as \"the attributes of perfection\"\\n\\t\\t\\t\\t- a term reserved in the Qur'an for God alone."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "180",
    "NoteID": "146",
    "Body": "I.e., by applying them to other beings or objects or,\\n\\t\\t\\t\\talternatively, by trying to \"define\" God in\\n\\t\\t\\t\\tanthropomorphic terms and relationships, like \"father\" or\\n\\t\\t\\t\\t\"son\" (Razi)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "181",
    "NoteID": "147",
    "Body": "Sc., \"and they will be rewarded accordingly\". See verse\\n\\t\\t\\t\\t{159} above, where the righteous \"among the folk of\\n\\t\\t\\t\\tMoses\" are thus described. In this verse, the reference\\n\\t\\t\\t\\tis broadened to include the righteous of all times and\\n\\t\\t\\t\\tcommunities - that is, all those who are receptive to\\n\\t\\t\\t\\tGod's messages and live up to them by virtue of their\\n\\t\\t\\t\\tconviction that God is the Ultimate Reality."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "182",
    "NoteID": "148",
    "Body": "Lit., \"without their knowing whence [it comes]\". For an\\n\\t\\t\\t\\texplanation of the term kayd (\"subtle scheme\") occurring\\n\\t\\t\\t\\tin the next verse, see note [25] on  68:45 , where this\\n\\t\\t\\t\\tterm appears for the first time in Qur'anic revelation."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "184",
    "NoteID": "149",
    "Body": "Lit., \"Have they, then, not reflected\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "184",
    "NoteID": "150",
    "Body": "Because he enunciated a message that differed radically\r\\n\\t\\t\\t\\tfrom anything to which the Meccans had been accustomed,\r\\n\\t\\t\\t\\tthe Prophet was considered mad by many of his unbelieving\r\\n\\t\\t\\t\\tcontemporaries. The stress on his being \"their\r\\n\\t\\t\\t\\tfellow-man\" (sahibuhum - lit., \"their companion\") is\r\\n\\t\\t\\t\\tmeant to emphasize the fact that he is human, and thus to\r\\n\\t\\t\\t\\tcounteract any possible tendency on the part of his\r\\n\\t\\t\\t\\tfollowers to invest him with superhuman qualities: an\r\\n\\t\\t\\t\\targument which is more fully developed in verse {188}."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "185",
    "NoteID": "151",
    "Body": "Apart from a reminder of man's utter dependence on God,\\n\\t\\t\\t\\tthe implication of the above passage is this: Since\\n\\t\\t\\t\\teverything in the observable or intellectually\\n\\t\\t\\t\\tconceivable universe is obviously caused, it must have\\n\\t\\t\\t\\thad a beginning and, therefore, must also have an end.\\n\\t\\t\\t\\tFurthermore, since the universe is not eternal in the\\n\\t\\t\\t\\tsense of having had no beginning, and since it cannot\\n\\t\\t\\t\\tpossibly have evolved \"by itself\" out of nothing, and\\n\\t\\t\\t\\tsince \"nothingness\" is a concept devoid of all reality,\\n\\t\\t\\t\\twe are forced to predicate the existence of a Primary\\n\\t\\t\\t\\tCause which is beyond the limits of our experience and,\\n\\t\\t\\t\\thence, beyond the categories of our thought - that is,\\n\\t\\t\\t\\tthe existence of God: and this is the meaning of the\\n\\t\\t\\t\\t\"tiding\" to which this verse refers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "186",
    "NoteID": "152",
    "Body": "As in verse {178} above - and in many other places in the\\n\\t\\t\\t\\tQur'an - the expression \"he whom God lets [or \"causes\\n\\t\\t\\t\\tto\"] go astray\" indicates the natural law instituted by\\n\\t\\t\\t\\tGod (sunnat Allah), whereby a wilful neglect of one's\\n\\t\\t\\t\\tinborn, cognitive faculties unavoidably results in the\\n\\t\\t\\t\\tloss of all ethical orientation: that is, not an act of\\n\\t\\t\\t\\t\"predestination\" but a result of one's own choice. See\\n\\t\\t\\t\\talso surah {2}, note [7], and surah {14}, note [4]."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "187",
    "NoteID": "153",
    "Body": "The verb ahfa means \"he did [a thing] in an excessive\\n\\t\\t\\t\\tmeasure\" or \"he exceeded the usual bounds in doing\\n\\t\\t\\t\\t[something]\". In connection with an inquiry, and\\n\\t\\t\\t\\tespecially when followed by 'anhu or 'anha (\"about it\"),\\n\\t\\t\\t\\tit signifies \"he tried hard to gain insight [into\\n\\t\\t\\t\\tsomething] by persistently inquiring about it\". Thus,\\n\\t\\t\\t\\tused as a participle, it means \"one who has gained\\n\\t\\t\\t\\tinsight [into something] through persistent inquiry\". In\\n\\t\\t\\t\\tthe above context, the implication is that no amount of\\n\\t\\t\\t\\tinquiry or speculation can reveal to man - the prophets\\n\\t\\t\\t\\tincluded - the coming of the Last Hour before its actual\\n\\t\\t\\t\\tmanifestation."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "188",
    "NoteID": "154",
    "Body": "See  6:50 , as well as the corresponding note. The\\n\\t\\t\\t\\trepeated insistence in the Qur'an on the humanness of the\\n\\t\\t\\t\\tProphet is in tune with the doctrine that no created\\n\\t\\t\\t\\tbeing has or could have any share, however small, in any\\n\\t\\t\\t\\tof the Creator's qualities or powers. In logical\\n\\t\\t\\t\\tcontinuation of this argument, the next passage verses\\n\\t\\t\\t\\t{189-198} stresses the uniqueness and exclusiveness of\\n\\t\\t\\t\\tGod's creative powers."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "189",
    "NoteID": "155",
    "Body": "Lit., \"so that he might incline towards her\". For an\\n\\t\\t\\t\\texplanation of the terms \"one living entity\" and \"its\\n\\t\\t\\t\\tmate\", see  4:1 , and the corresponding note."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "190",
    "NoteID": "156",
    "Body": "Lit., \"they attribute to Him partners with regard to that\\n\\t\\t\\t\\twhich He has granted them\": i.e., many of them look upon\\n\\t\\t\\t\\tthe contributing factors of sound childbirth (like\\n\\t\\t\\t\\tpersonal care during pregnancy, medical assistance,\\n\\t\\t\\t\\teugenics, etc.) as something independent of God,\\n\\t\\t\\t\\tforgetting that all these contributing factors are - like\\n\\t\\t\\t\\tthe birth of the child itself - but an outcome of God's\\n\\t\\t\\t\\twill and grace: a manifestation of what the Qur'an calls\\n\\t\\t\\t\\t\"the way of God\" (sunnat Allah). Since this kind of\\n\\t\\t\\t\\tmental association of \"other\" factors with God is not\\n\\t\\t\\t\\treally intentional, it does not amount to the\\n\\t\\t\\t\\tunforgivable sin of shirk (\"the ascribing of divine\\n\\t\\t\\t\\tqualities to powers other than God\"); but it is close\\n\\t\\t\\t\\tenough to it to warrant the subsequent discourse on shirk\\n\\t\\t\\t\\tin the real meaning of this term."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "191",
    "NoteID": "157",
    "Body": "Lit., \"that which does not create anything\": a phrase\\n\\t\\t\\t\\texpressed in the singular, but having the plural meaning\\n\\t\\t\\t\\tof \"beings\" - that is, either animate beings (like saints\\n\\t\\t\\t\\tor supposedly \"divine\" personalities) or their inanimate\\n\\t\\t\\t\\trepresentations."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "193",
    "NoteID": "158",
    "Body": "Lit., \"do not follow you\". As regards my translation of\\n\\t\\t\\t\\tin tad'uhum ila 'l-huda as \"if you pray to them for\\n\\t\\t\\t\\tguidance\" (instead of the erroneous - but common -\\n\\t\\t\\t\\ttranslation \"if you invite [or \"call\"] them to\\n\\t\\t\\t\\tguidance\"), see Zamakhshari, Razi and Ibn Kathir. Cf.\\n\\t\\t\\t\\talso verse {198} below."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "194",
    "NoteID": "159",
    "Body": "Lit., \"servants\" ('ibad) - i.e., created beings\\n\\t\\t\\t\\tsubservient to God's will. This refers to saints living\\n\\t\\t\\t\\tor dead, as well as to inanimate objects of every\\n\\t\\t\\t\\tdescription, including idols, fetishes and\\n\\t\\t\\t\\trepresentational images - physical or mental - of saints\\n\\t\\t\\t\\tor deified persons."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "195",
    "NoteID": "160",
    "Body": "Lit., \"summon your [God -]partners\" see surah {6}, note\\n\\t\\t\\t\\t[15]."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "198",
    "NoteID": "161",
    "Body": "Lit., \"though thou seest them looking at thee\" - but\\n\\t\\t\\t\\tsince the pronoun \"them\" in tarahum (\"thou seest them\")\\n\\t\\t\\t\\trefers to mental images no less than to physical\\n\\t\\t\\t\\trepresentations, the verb must be understood in its\\n\\t\\t\\t\\tabstract sense of \"seeing with the mind\", i.e.,\\n\\t\\t\\t\\t\"considering\" or \"imagining\". In contrast with the\\n\\t\\t\\t\\tpreceding passages, which are addressed to those who\\n\\t\\t\\t\\tactually invoke false deities or images, the last\\n\\t\\t\\t\\tsentence is addressed to man in general, sinner and\\n\\t\\t\\t\\tbeliever alike: and this generalization is brought out by\\n\\t\\t\\t\\tchanging the form of address from \"you\" to \"thou\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "199",
    "NoteID": "162",
    "Body": "Lit., \"accept what is easily forthcoming [from man's\\n\\t\\t\\t\\tnature]\". According to Zamakhshari, khudh al-'afw means:\\n\\t\\t\\t\\t\"Accept what comes easily to thee [or \"what is willingly\\n\\t\\t\\t\\taccorded to thee\"] of the doings and the nature of men,\\n\\t\\t\\t\\tand make things easy [for them], without causing them\\n\\t\\t\\t\\tundue hardship (kulfah); and do not demand of them\\n\\t\\t\\t\\tefforts that may be too difficult for them.\" This\\n\\t\\t\\t\\tinterpretation - which has been adopted by many other\\n\\t\\t\\t\\tclassical commentators as well - is based on the\\n\\t\\t\\t\\tidentical explanation of the phrase khudh al 'afw by 'Abd\\n\\t\\t\\t\\tAllah ibn az-Zubayr and his brother 'Urwah (Bukhari), as\\n\\t\\t\\t\\twell as by 'A'ishah and, in the next generation, by\\n\\t\\t\\t\\tHisham ibn 'Urwah and Mujahid (see Tabari, Baghawi and\\n\\t\\t\\t\\tIbn Kathir). Thus, in accordance with the Qur'anic\\n\\t\\t\\t\\tstatements that \"man has been created weak\"  (4:28)  and\\n\\t\\t\\t\\tthat \"God does not burden any human being with more than\\n\\t\\t\\t\\the is well able to bear\" ( 2:286 ,  6:152 ,  7:42 ,\\n\\t\\t\\t\\t 23:62 ), the believer is admonished to make due\\n\\t\\t\\t\\tallowance for human nature and not to be too harsh with\\n\\t\\t\\t\\tthose who err. This admonition is the more remarkable as\\n\\t\\t\\t\\tit follows immediately upon a discourse on the most\\n\\t\\t\\t\\tunforgivable of all sins - the ascribing of divine powers\\n\\t\\t\\t\\tor qualities to anyone or anything but God."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "199",
    "NoteID": "163",
    "Body": "Lit., \"the ignorant ones\" - i.e., those who wilfully\\n\\t\\t\\t\\tremain deaf to moral truths, and not those who are simply\\n\\t\\t\\t\\tunaware of them."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "200",
    "NoteID": "164",
    "Body": "I.e., anger at the rejection of the truth by \"those who\\n\\t\\t\\t\\tchoose to remain ignorant\". The words \"to blind anger\"\\n\\t\\t\\t\\tinterpolated between brackets are based on a Tradition\\n\\t\\t\\t\\taccording to which the Prophet, after the revelation of\\n\\t\\t\\t\\tthe preceding verse calling for forbearance, exclaimed,\\n\\t\\t\\t\\t\"And what about [justified] anger, O my Sustainer?\" -\\n\\t\\t\\t\\twhereupon the above verse was revealed to him (Tabari,\\n\\t\\t\\t\\tZamakhshari, Razi, Ibn Kathir)."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "201",
    "NoteID": "165",
    "Body": "The noun ta'if (also forthcoming in the forms tayf and\\n\\t\\t\\t\\ttayyif denotes any ungraspable phantom, image or\\n\\t\\t\\t\\tsuggestion, as in a dream, or \"an imperceptible obsession\\n\\t\\t\\t\\twhich obscures the mind\" (Taj al-'Arus). Since, in the\\n\\t\\t\\t\\tabove context, it is described as coming from Satan, \"a\\n\\t\\t\\t\\tdark suggestion\" seems to be an appropriate rendering."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "202",
    "NoteID": "166",
    "Body": "I.e., by goading them to anger or trying to engage them\\n\\t\\t\\t\\tin futile argument. \"Their brethren\" are those who\\n\\t\\t\\t\\twilfully remain ignorant of the truth (with the pronoun\\n\\t\\t\\t\\treferring to the God-conscious). The conjunctive particle\\n\\t\\t\\t\\twa preceding this clause has here the meaning of\\n\\t\\t\\t\\t\"although\" or \"even though\"."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "203",
    "NoteID": "167",
    "Body": "Sc., \"if thou art really His apostle\" (cf.  6:37  and\\n\\t\\t\\t\\t{109}, and the corresponding notes). Some of the\\n\\t\\t\\t\\tcommentators assume that the term ayah - translated by me\\n\\t\\t\\t\\tas \"miracle\" - denotes here a verbal \"message\" which\\n\\t\\t\\t\\twould answer the objections of those who did not believe\\n\\t\\t\\t\\tin the Prophet. Since, however, the continuous revelation\\n\\t\\t\\t\\tof the Qur'an was full of such messages, the demand of\\n\\t\\t\\t\\tthe unbelievers must have related to some particular\\n\\t\\t\\t\\tmanifestation or \"proof\" of his divinely-inspired\\n\\t\\t\\t\\tmission: namely, to a concrete miracle which would\\n\\t\\t\\t\\testablish the truth of his claim in a supposedly\\n\\t\\t\\t\\t\"objective\" manner. In its wider implication, the above\\n\\t\\t\\t\\tverse relates to the primitive mentality of all who\\n\\t\\t\\t\\tregard miracles, and not the message itself, as the only\\n\\t\\t\\t\\tvalid \"proof\" of prophethood."
  },
  {
    "SurahNumber": "7",
    "AyahNumber": "206",
    "NoteID": "168",
    "Body": "Lit., \"those who are with thy Sustainer\": a metaphorical\\n\\t\\t\\t\\tdescription of utter God-consciousness."
  }
]
