[
  {
    "SurahNumber": "82",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "An allusion to the Last Hour, when the world as known to\\n\\t\\t\\t\\tman will come to an end and the ultimate reality of the\\n\\t\\t\\t\\thereafter will begin."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "5",
    "NoteID": "2",
    "Body": "I.e., what he has done and what he has omitted to do. An\\n\\t\\t\\t\\talternative rendering would be, \"what he has placed\\n\\t\\t\\t\\tforward and what he has placed behind\", i.e., what he\\n\\t\\t\\t\\tprized more and what less in his erstwhile, subjective\\n\\t\\t\\t\\tvaluation. Thus, at the moment of resurrection man will\\n\\t\\t\\t\\tsuddenly understand the true motivations and moral\\n\\t\\t\\t\\timplications of whatever he did - or consciously\\n\\t\\t\\t\\trefrained from doing - during his life in this world: and\\n\\t\\t\\t\\tthis applies to all the good deeds he did and the sins he\\n\\t\\t\\t\\trefrained from, as well as to all the sins he committed\\n\\t\\t\\t\\tand the good deeds he failed to do."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "6",
    "NoteID": "3",
    "Body": "A rhetorical question implying that no human being is\\n\\t\\t\\t\\tever entirely immune against \"that temptation to evil\\n\\t\\t\\t\\t(fitnah) which does not befall only those among you who\\n\\t\\t\\t\\tare bent on denying the truth\" (see  8:25  and the\\n\\t\\t\\t\\tcorresponding note [25]). The answer is given in verse\\n\\t\\t\\t\\t{9} below."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "I.e., \"endowed thee with all the qualities and abilities\\n\\t\\t\\t\\trelevant to the exigencies of thy individual life and thy\\n\\t\\t\\t\\tenvironment\"."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "Lit., \"made thee proportionate\", i.e., a being subject to\\n\\t\\t\\t\\tphysical needs and emotional urges, and at the same time\\n\\t\\t\\t\\tendowed with intellectual and spiritual perceptions: in\\n\\t\\t\\t\\tother words, a being in whom there is no inherent\\n\\t\\t\\t\\tconflict between the demands of \"the spirit and the\\n\\t\\t\\t\\tflesh\", since both these aspects of the human condition\\n\\t\\t\\t\\tare - as stressed in the next verse - God-willed and,\\n\\t\\t\\t\\ttherefore, morally justified."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "9",
    "NoteID": "6",
    "Body": "In view of the fact that the whole of this passage is\\n\\t\\t\\t\\taddressed to \"man\" or \"men\" in general, and not merely to\\n\\t\\t\\t\\tdeniers of the truth, I believe that the expression \"you\\n\\t\\t\\t\\tgive the lie\" does not, in this context, necessarily\\n\\t\\t\\t\\timply a conscious denial of God's ultimate judgment but,\\n\\t\\t\\t\\trather, a tendency inherent in most human beings to close\\n\\t\\t\\t\\tone's mind - occasionally or permanently, as the ease may\\n\\t\\t\\t\\tbe - to the prospect of having to answer before God for\\n\\t\\t\\t\\tone's doings: hence my rendering, \"you are tempted to\\n\\t\\t\\t\\tgive the lie\"."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "12",
    "NoteID": "7",
    "Body": "The classical commentators are of the opinion that we\\n\\t\\t\\t\\thave here a reference to the guardian angels who record,\\n\\t\\t\\t\\tallegorically, all of men's deeds. However. another\\n\\t\\t\\t\\texplanation has been suggested by me in my rendering of\\n\\t\\t\\t\\t{50:16-23} and elaborated in the corresponding notes\\n\\t\\t\\t\\t[11-16]. In consonance with that interpretation, the\\n\\t\\t\\t\\t\"watchful force\" (hafiz) set over every human being is\\n\\t\\t\\t\\this own conscience, which \"records\" all his motives and\\n\\t\\t\\t\\tactions in his subconscious mind. Since it is the most\\n\\t\\t\\t\\tprecious element in man's psyche, it is described in\\n\\t\\t\\t\\tverse {11} as \"noble\"."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "18",
    "NoteID": "8",
    "Body": "For my rendering of thumma at the beginning of this verse\\n\\t\\t\\t\\tas \"And once again\", see surah {6} note [31]. The\\n\\t\\t\\t\\trepetition of this rhetorical question is meant to\\n\\t\\t\\t\\tindicate that man's intellect and imagination cannot\\n\\t\\t\\t\\tpossibly answer it, since what is described as the Day of\\n\\t\\t\\t\\tJudgment will usher in a reality which as yet is wholly\\n\\t\\t\\t\\toutside our human experience and, therefore, cannot be\\n\\t\\t\\t\\tgrasped conceptually: hence, only allegory - and our own\\n\\t\\t\\t\\temotional response to it - can give us an inkling of what\\n\\t\\t\\t\\tthat reality might be."
  }
]
