[
  {
    "SurahNumber": "83",
    "AyahNumber": "3",
    "NoteID": "1",
    "Body": "This passage (verses 1-3) does not, of course, refer only\\n\\t\\t\\t\\tto commercial dealings but touches upon every aspect of\\n\\t\\t\\t\\tsocial relations, both practical and moral, applying to\\n\\t\\t\\t\\tevery individual's rights and obligations no less than to\\n\\t\\t\\t\\this physical possessions."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "7",
    "NoteID": "2",
    "Body": "According to some of the greatest philologists (e.g., Abu\\n\\t\\t\\t\\t'Ubaydah, as quoted in the Lisan al-'Arab), the term\\n\\t\\t\\t\\tsijjin is derived from - or even synonymous with - the\\n\\t\\t\\t\\tnoun sijn, which signifies \"a prison\". Proceeding from\\n\\t\\t\\t\\tthis derivation, some authorities attribute to sijjin the\\n\\t\\t\\t\\ttropical meaning of da'im, i.e., \"continuing\" or\\n\\t\\t\\t\\t\"lasting\" (ibid.). Thus, in its metaphorical application\\n\\t\\t\\t\\tto a sinner's \"record\", it is evidently meant to stress\\n\\t\\t\\t\\tthe latter's inescapable quality, as if its contents were\\n\\t\\t\\t\\tlastingly \"imprisoned\", i.e., set down indelibly, with no\\n\\t\\t\\t\\tpossibility of escaping from what they imply: hence my\\n\\t\\t\\t\\trendering of the phrase fi sijjin as \"[set down] in a\\n\\t\\t\\t\\tmode inescapable\". This interpretation is, to my mind,\\n\\t\\t\\t\\tfully confirmed by verse {9} below."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "12",
    "NoteID": "3",
    "Body": "Implying that a denial of ultimate responsibility before\\n\\t\\t\\t\\tGod - and, hence, of His judgment - is invariably\\n\\t\\t\\t\\tconducive to sinning and to transgression against all\\n\\t\\t\\t\\tmoral imperatives. (Although this and the next verse are\\n\\t\\t\\t\\tformulated in the singular, I am rendering them in the\\n\\t\\t\\t\\tplural inasmuch as this plurality is idiomatically\\n\\t\\t\\t\\tindicated by the word kull before the descriptive\\n\\t\\t\\t\\tparticiples mu'tad and athim, as well as by the use of a\\n\\t\\t\\t\\tstraight plural in verses {14} ff.)"
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "14",
    "NoteID": "4",
    "Body": "Lit., \"that which they were earning has covered their\\n\\t\\t\\t\\thearts with rust\": implying that their persistence in\\n\\t\\t\\t\\twrongdoing has gradually deprived them of all\\n\\t\\t\\t\\tconsciousness of moral responsibility and, hence, of the\\n\\t\\t\\t\\tability to visualize the fact of God's ultimate judgment."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "18",
    "NoteID": "5",
    "Body": "I.e., in contrast to the record of the wicked (see verse\\n\\t\\t\\t\\t{7} above). As regards the term 'illiyyun, it is said to\\n\\t\\t\\t\\tbe the plural of 'illi or 'illiyyah (\"loftiness\") or,\\n\\t\\t\\t\\talternatively, a plural which has no singular (Qamus, Taj\\n\\t\\t\\t\\tal-'Arus); in either case it is derived from the verb\\n\\t\\t\\t\\t'ala, which signifies \"[something] was [or \"became\"]\\n\\t\\t\\t\\thigh\" or \"lofty\" or - tropically - \"exalted\": thus in the\\n\\t\\t\\t\\twell-known idiomatic phrase, huwa min 'illiyyat qawmihi,\\n\\t\\t\\t\\t\"he is among the [most] exalted of his people\". In view\\n\\t\\t\\t\\tof this derivation, the plural 'illiyyun has evidently\\n\\t\\t\\t\\tthe intensive connotation of \"loftiness upon loftiness\"\\n\\t\\t\\t\\t(Taj al-'Arus) or \"a mode most lofty\"."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "21",
    "NoteID": "6",
    "Body": "I.e., by the prophets and saints of all times as well as\\n\\t\\t\\t\\tby the angels."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "23",
    "NoteID": "7",
    "Body": "Cf. 75:23 . As elsewhere in the Qur'an, the \"couches\" of\\n\\t\\t\\t\\tthe virtuous in paradise symbolize complete restfulness\\n\\t\\t\\t\\tand inner fulfilment."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "26",
    "NoteID": "8",
    "Body": "Lit., \"the end whereof (khitamuhu) will be musk\". My\\n\\t\\t\\t\\trendering of the above phrase reflects the interpretation\\n\\t\\t\\t\\tgiven to it by several authorities of the second\\n\\t\\t\\t\\tgeneration of Islam, and by Abu 'Ubaydah ibn al-Muthanna\\n\\t\\t\\t\\t(all of them quoted by Razi). The \"pure wine\" (rahiq) of\\n\\t\\t\\t\\tthe hereafter - which, contrary to the wine of this\\n\\t\\t\\t\\tworld, will carry \"the seal\" (i.e., the sanction) of God\\n\\t\\t\\t\\tbecause \"no headiness will be in it, and they will not\\n\\t\\t\\t\\tget drunk thereon\" ( 37:47 ) - is another symbol of\\n\\t\\t\\t\\tparadise, alluding, by means of comparisons with\\n\\t\\t\\t\\tsensations that can be experienced by man, to the\\n\\t\\t\\t\\totherworldly sensations of joy which, in a form\\n\\t\\t\\t\\tintensified beyond all human imagination, are in store\\n\\t\\t\\t\\tfor the righteous. Some of the great Muslim mystics\\n\\t\\t\\t\\t(e.g., Jalal ad-Din Rumi) see in that \"pure wine\" an\\n\\t\\t\\t\\tallusion to a spiritual vision of God: an interpretation\\n\\t\\t\\t\\twhich, I believe, is fully justified by the sequence."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "27",
    "NoteID": "9",
    "Body": "Whereas most of the classical commentators regard the\\n\\t\\t\\t\\tinfinitive noun tasnim as the proper name of one of the\\n\\t\\t\\t\\tallegorical \"fountains of paradise\", or, alternatively,\\n\\t\\t\\t\\trefrain from any definition of it, it seems to me that\\n\\t\\t\\t\\tthe derivation of tasnim from the verb sannama - \"he\\n\\t\\t\\t\\traised [something]\" or \"made [it] lofty\" - points,\\n\\t\\t\\t\\trather, to the effect which the \"wine\" of divine\\n\\t\\t\\t\\tknowledge will have on those who \"drink\" of it in\\n\\t\\t\\t\\tparadise. Hence, the tabi'i 'Ikrimah (as quoted by Razi)\\n\\t\\t\\t\\tequates tasnim with tashrif, \"that which is ennobling\" or\\n\\t\\t\\t\\t\"exalting\"."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "28",
    "NoteID": "10",
    "Body": "Cf. {76:5-6} and the corresponding notes."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "29",
    "NoteID": "11",
    "Body": "In the original, verses {29-33} are in the past tense, as\\n\\t\\t\\t\\tif viewed from the time-level of Judgment Day. However,\\n\\t\\t\\t\\tsince the preceding and the following passages (i.e.,\\n\\t\\t\\t\\tverses {18-28} and {34-36}) are formulated in the future\\n\\t\\t\\t\\ttense, verses {29-33} (which relate to life in this\\n\\t\\t\\t\\tworld) may be adequately rendered in the present tense."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "31",
    "NoteID": "12",
    "Body": "Lit., \"to their [own] people\"."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "33",
    "NoteID": "13",
    "Body": "Lit., \"they have not been sent as watchers over them\" -\\n\\t\\t\\t\\timplying that none who is devoid of faith has the right\\n\\t\\t\\t\\tto criticize the faith of any of his fellow-men."
  },
  {
    "SurahNumber": "83",
    "AyahNumber": "34",
    "NoteID": "14",
    "Body": "Speaking of the righteous, the Qur'an repeatedly stresses\\n\\t\\t\\t\\tthat on the Day of Judgment God \"shall have removed\\n\\t\\t\\t\\twhatever unworthy thoughts or feelings (ghill) may have\\n\\t\\t\\t\\tbeen [lingering] in their bosoms\" ( 7:43  and  15:47 ).\\n\\t\\t\\t\\tSince an expression of vengeful joy on the part of the\\n\\t\\t\\t\\tblest at the calamity which in the hereafter will befall\\n\\t\\t\\t\\tthe erstwhile sinners would certainly fall within the\\n\\t\\t\\t\\tcategory of \"unworthy feelings\", their \"laughing\" can\\n\\t\\t\\t\\tonly have a metaphorical meaning, denoting no more than a\\n\\t\\t\\t\\trealization of their own good fortune."
  }
]
