[
  {
    "SurahNumber": "38",
    "AyahNumber": "1",
    "NoteID": "4146",
    "Body": "Sad is a letter of the Arabic alphabet. It is used here\\n\\t\\t\\t\\tas an Abbreviated Letter, for which see Appendix I (at\\n\\t\\t\\t\\tthe end of Sura ii.). See also the second para, of n. 989\\n\\t\\t\\t\\tto vii. I for this particular letter. No dogmatism is\\n\\t\\t\\t\\tpermissible in trying to interpret Abbreviated Letters.\\n\\t\\t\\t\\tThis Sura is concerned mainly with the stories of David\\n\\t\\t\\t\\tand Solomon as illustrative of the relative positions of\\n\\t\\t\\t\\tspiritual and worldly power. Sale's note: \"it may stand\\n\\t\\t\\t\\tfor Solomon\": is a real howler; for in Arabic the letter\\n\\t\\t\\t\\tSad does not occur at all in the name of Solomon."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "1",
    "NoteID": "4147",
    "Body": "Full of admonition: the word zikr is far more\\n\\t\\t\\t\\tcomprehensive than any single word or phrase that I can\\n\\t\\t\\t\\tthink of in English: it implies (1) remembrance in a\\n\\t\\t\\t\\tspirit of reverence; (2) recital, celebrating the praises\\n\\t\\t\\t\\tof Allah; (3) teaching, admonition, warning; (4) Message,\\n\\t\\t\\t\\tRevelation, as in Ah-luz-zikr, \"those who possess the\\n\\t\\t\\t\\tMessage\" (xvi. 43, and n. 2069). Devotional exercises are\\n\\t\\t\\t\\talso called zikr, with reference to meaning (2) above."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "2",
    "NoteID": "4148",
    "Body": "The great root of Evil and Unbelief is Self-glory or\\n\\t\\t\\t\\tArrogance, as is pointed out in several places with\\n\\t\\t\\t\\tregard to Satan; cf. below, xxxviii. 74-76. This leads to\\n\\t\\t\\t\\tEnvy and opposition or a desire to start a peculiar\\n\\t\\t\\t\\tdoctrine or sect of one's own, instead of a desire to\\n\\t\\t\\t\\tfind common grounds of belief and life, which lead to the\\n\\t\\t\\t\\tReligion of Unity of Allah. This teaching of Unity was\\n\\t\\t\\t\\twhat the Pagans objected to in the holy Prophet (verse 5\\n\\t\\t\\t\\tbelow)!"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "3",
    "NoteID": "4149",
    "Body": "Teaching, Warning, Signs have been given by Allah to all\\n\\t\\t\\t\\tnations and at all times, and yet nations have rebelled\\n\\t\\t\\t\\tand gone wrong and suffered destruction. If only later\\n\\t\\t\\t\\tgenerations could learn that wrong-doing results in\\n\\t\\t\\t\\tself-destruction! For the justice of Allah merely carries\\n\\t\\t\\t\\tout the result of their own choice and actions. At any\\n\\t\\t\\t\\ttime during their probation they could repent and obtain\\n\\t\\t\\t\\tmercy, but their \"Self-glory and Separatism\" stand in the\\n\\t\\t\\t\\tway. Ultimately they do cry for a way of escape, but it\\n\\t\\t\\t\\tis then too late."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "4",
    "NoteID": "4150",
    "Body": "Their wonder is only stimulated. They are full of envy\\n\\t\\t\\t\\tand spite against one of themselves who has been chosen\\n\\t\\t\\t\\tby Allah to be His Messenger, and they vent their spite\\n\\t\\t\\t\\tby making all sorts of false accusations. The man who was\\n\\t\\t\\t\\tpre-eminent for truth and conscientious consideration,\\n\\t\\t\\t\\tthey call \"a sorcerer and a liar\"!"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "5",
    "NoteID": "4151",
    "Body": "And what is the offence of the Messenger of Unity? That\\n\\t\\t\\t\\the has made all their fantastic gods disappear; that in\\n\\t\\t\\t\\tplace of chaos he has brought harmony; that in place of\\n\\t\\t\\t\\tconflict he brings peace! It is a wonderful thing, but\\n\\t\\t\\t\\tnot in the sarcastic sense in which the Unbelievers scoff\\n\\t\\t\\t\\tat it!"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "6",
    "NoteID": "4152",
    "Body": "When the message of Islam was being preached in its\\n\\t\\t\\t\\tinfancy, and the Preacher and his followers were being\\n\\t\\t\\t\\tpersecuted by the Pagans, one of the devices adopted by\\n\\t\\t\\t\\tthe Pagan leaders was to get the Prophet's uncle Abu\\n\\t\\t\\t\\tTalib to denounce or renounce his beloved nephew. A\\n\\t\\t\\t\\tconference was held with Abu Talib for this purpose. On\\n\\t\\t\\t\\tits failure the leaders walked away, and began to\\n\\t\\t\\t\\tdiscredit the great movement by falsely giving out that\\n\\t\\t\\t\\tit was designed against their personal influence, and to\\n\\t\\t\\t\\tthrow power into the hands of the Prophet. Hadhrat\\n\\t\\t\\t\\t'Umar's conversion occurred in the sixth year of the\\n\\t\\t\\t\\tMission (seventh year before the Hijrat). The\\n\\t\\t\\t\\tcircumstances connected with it (see Introduction to S.\\n\\t\\t\\t\\txx.) greatly alarmed the Quraish chiefs, who, greedy of\\n\\t\\t\\t\\tautocracy themselves, confused the issue by accusing the\\n\\t\\t\\t\\trighteous Preacher of plotting against their power."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "7",
    "NoteID": "4153",
    "Body": "'Whatever may have been the case in the past', they said,\\n\\t\\t\\t\\t'our own immediate ancestors worshipped these idols in\\n\\t\\t\\t\\tMakkah and why should we give them up?' Self- complacency\\n\\t\\t\\t\\twas stronger with them than Truth; and so they call Truth\\n\\t\\t\\t\\t\"a made-up tale\"! Some Commentators interpret millat\\n\\t\\t\\t\\takhirat to refer to the last religion preached before\\n\\t\\t\\t\\tIslam, viz. Christianity, which had itself departed from\\n\\t\\t\\t\\tMonotheism to Trinity."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "8",
    "NoteID": "4154",
    "Body": "Here comes in envy. 'If a Message had to come, why should\\n\\t\\t\\t\\tit come to him, the orphan son of 'Abdullah, and not to\\n\\t\\t\\t\\tone of our own great men?'"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "8",
    "NoteID": "4155",
    "Body": "They have no clear idea of how Allah's Message comes! It\\n\\t\\t\\t\\tis not a worldly thing to be given to any one. It is a\\n\\t\\t\\t\\tdivine thing requiring spiritual preparation. If they\\n\\t\\t\\t\\tclose their eyes to it now, it will be brought home to\\n\\t\\t\\t\\tthem when they taste the consequences of their folly!"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "9",
    "NoteID": "4156",
    "Body": "If they set themselves to judge Allah, have they anything\\n\\t\\t\\t\\tto show comparable to Allah's Mercy and Power! He has\\n\\t\\t\\t\\tboth in infinite measure. Who are they to question the\\n\\t\\t\\t\\tgrant of His Mercy and Revelation to His own Chosen One?"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "10",
    "NoteID": "4157",
    "Body": "Weak and puny creatures though they are, they dare to\\n\\t\\t\\t\\traise their heads against the Omnipotent, as if they had\\n\\t\\t\\t\\tdominion over Creation and not He! If they had any power,\\n\\t\\t\\t\\tlet them mount up to heaven and use all the means they\\n\\t\\t\\t\\thave to that end, and see how they can frustrate Allah's\\n\\t\\t\\t\\tPurpose!"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "11",
    "NoteID": "4158",
    "Body": "Of course they cannot frustrate Allah's Purpose. In that\\n\\t\\t\\t\\tworld-they will be ignominiously routed, even if they\\n\\t\\t\\t\\tform the strongest confederacy of the Powers of Evil that\\n\\t\\t\\t\\tever could combine. Cf. the last clause of verse 13\\n\\t\\t\\t\\tbelow."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "12",
    "NoteID": "4159",
    "Body": "In their day, Noah's contemporaries, or the 'Ad and the\\n\\t\\t\\t\\tThamud, so frequently mentioned, or Pharaoh the mighty\\n\\t\\t\\t\\tking of Egypt, or the people to whom Lot was sent (cf.\\n\\t\\t\\t\\txxxvii. 75-82; vii. 65-73; vii. 103-137; vii. 80-84) were\\n\\t\\t\\t\\texamples of arrogance and rebellion against Allah: they\\n\\t\\t\\t\\trejected the divine Message brought by their messengers,\\n\\t\\t\\t\\tand they all came to an evil end. Will not their\\n\\t\\t\\t\\tposterity learn their lesson?"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "12",
    "NoteID": "4160",
    "Body": "The title of Pharaoh, \"Lord of the Stakes\", denotes power\\n\\t\\t\\t\\tand arrogance, in all or any of the following ways: (1)\\n\\t\\t\\t\\tthe stake makes a tent firm and stable, and is a symbol\\n\\t\\t\\t\\tof firmness and stability; (2) many stakes mean a large\\n\\t\\t\\t\\tcamp and a numerous army to fight; (3) impaling with\\n\\t\\t\\t\\tstakes was a cruel punishment resorted to by the Pharaohs\\n\\t\\t\\t\\tin arrogant pride of power."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "13",
    "NoteID": "4161",
    "Body": "Companions of the Wood; see xv. 78, and n. 2000."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "13",
    "NoteID": "4162",
    "Body": "Cf. above, verse 11, and n. 4158."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "14",
    "NoteID": "4163",
    "Body": "Cf. xv. 64, n. 1990; and xxii. 18."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "15",
    "NoteID": "4164",
    "Body": "Cf. xxxvi. 29, n. 3973."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "15",
    "NoteID": "4165",
    "Body": "Fawaq: delay, the interval between one milking of a\\n\\t\\t\\t\\tshe-camel, and another, either to give her a breathing\\n\\t\\t\\t\\tspace or to give her young time to suck,-or perhaps the\\n\\t\\t\\t\\tmilker to adjust his fingers. Such interval will be quite\\n\\t\\t\\t\\tshort. The derived meaning is that when the inevitable\\n\\t\\t\\t\\tjust punishment for sin arrives, it will not tarry, but\\n\\t\\t\\t\\tdo its work without delay."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "16",
    "NoteID": "4166",
    "Body": "Cf. xxvi. 204 and n. 3230. Those who do not believe in\\n\\t\\t\\t\\tthe Hereafter say ironically: \"Let us have our punishment\\n\\t\\t\\t\\tand sentence now: why delay it?\" The last verse and the\\n\\t\\t\\t\\tnext verse supply the commentary. As to those who mock,\\n\\t\\t\\t\\tthey will find out the truth soon enough, when it is too\\n\\t\\t\\t\\tlate for repentance or mercy. As to the prophets of\\n\\t\\t\\t\\tAllah, who are mocked, they must wait patiently for Allah\\n\\t\\t\\t\\tto fulfil His Plan: even men who had worldly strength and\\n\\t\\t\\t\\tpower, like David had to exercise infinite patience when\\n\\t\\t\\t\\tmocked by their contemporaries."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "17",
    "NoteID": "4167",
    "Body": "David was a man of exceptional strength, for even as a\\n\\t\\t\\t\\traw youth, he slew the Philistine giant Goliath. See ii.\\n\\t\\t\\t\\t249-252, and notes 286-87. Before that fight, he was\\n\\t\\t\\t\\tmocked by his enemies and chidden even by his own elder\\n\\t\\t\\t\\tbrother. But he relied upon Allah, and won through, and\\n\\t\\t\\t\\tafterwards became king."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "18",
    "NoteID": "4168",
    "Body": "See n. 2733 to xxi. 79. All nature sings in unison and\\n\\t\\t\\t\\tcelebrates the praises of Allah. David was given the gift\\n\\t\\t\\t\\tof music and psalmody, and therefore the hills and birds\\n\\t\\t\\t\\tare expressed as singing Allah's praises in unison with\\n\\t\\t\\t\\thim. The special hours when the hills and groves echo the\\n\\t\\t\\t\\tsongs of birds are in the evening and at dawn, when also\\n\\t\\t\\t\\tthe birds gather together, for those are respectively\\n\\t\\t\\t\\ttheir roosting hours and the hours of their concerted\\n\\t\\t\\t\\tflight for the day."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "19",
    "NoteID": "4169",
    "Body": "Note the mutual echo between this verse and verse 17\\n\\t\\t\\t\\tabove. The Arabic awwab is common to both, and it\\n\\t\\t\\t\\tfurnishes the rhyme or rhythm of the greater part of the\\n\\t\\t\\t\\tSura, thus echoing the main theme: 'Turn to Allah in\\n\\t\\t\\t\\tPrayer and Praise, for that is more than any worldly\\n\\t\\t\\t\\tpower or wisdom.'"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "20",
    "NoteID": "4170",
    "Body": "Cf. n. 2732 to xxi. 79 for David's sound judgment in\\n\\t\\t\\t\\tdecisions; he could also express himself aptly."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "21",
    "NoteID": "4171",
    "Body": "This story or Parable is not found in the Bible, unless\\n\\t\\t\\t\\tthe vision here described be considered as equivalent to\\n\\t\\t\\t\\tNathan's parable in 11 Samuel, xi, and xii. Baidhawi\\n\\t\\t\\t\\twould seem to favour that view, but other Commentators\\n\\t\\t\\t\\treject it. David was a pious man, and he had a\\n\\t\\t\\t\\twell-guarded private chamber (mihrab) for Prayer and\\n\\t\\t\\t\\tPraise."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "22",
    "NoteID": "4172",
    "Body": "David used to retire to his private chamber at stated\\n\\t\\t\\t\\ttimes for his devotions. One day, suddenly, his privacy\\n\\t\\t\\t\\twas invaded by two men, who had obtained access by\\n\\t\\t\\t\\tclimbing over a wall. David was frightened at the\\n\\t\\t\\t\\tapparition. But they said: \"We have come to seek thy\\n\\t\\t\\t\\tjustice as king: we are brothers, and we have a quarrel,\\n\\t\\t\\t\\twhich we wish thee to decide.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "23",
    "NoteID": "4173",
    "Body": "The brother who was most aggrieved said: \"This my brother\\n\\t\\t\\t\\thas a flock of ninety-nine sheep, and I have but one; yet\\n\\t\\t\\t\\the wants me to give up my one sheep to his keeping; and\\n\\t\\t\\t\\tmoreover he is not even fair-spoken. He talks like one\\n\\t\\t\\t\\tmeditating mischief, and he has not even the grace to ask\\n\\t\\t\\t\\tas an equal, or one sharing in a business or an\\n\\t\\t\\t\\tinheritance. What shall I do?\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "24",
    "NoteID": "4174",
    "Body": "The circumstances were mysterious; the accusation was\\n\\t\\t\\t\\tnoval; it was not clear why the unjust brother should\\n\\t\\t\\t\\talso have come with the complainant, risking his life in\\n\\t\\t\\t\\tclimbing the wall to evade the guard, and he certainly\\n\\t\\t\\t\\tsaid nothing. David took them literally, and began to\\n\\t\\t\\t\\tpreach about the falsehood and the fraud of men, who\\n\\t\\t\\t\\tshould be content with what they have, but who always\\n\\t\\t\\t\\tcovet more."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "24",
    "NoteID": "4175",
    "Body": "Especially, said David, is it wrong for brothers or men\\n\\t\\t\\t\\tin partnership to take advantage of each other; but how\\n\\t\\t\\t\\tfew are the men who are righteous? He had in his mind his\\n\\t\\t\\t\\town devotion and justice. But lo and behold! the men\\n\\t\\t\\t\\tdisappeared as mysteriously as they had come. It was then\\n\\t\\t\\t\\tthat David realised that the incident had been a trial or\\n\\t\\t\\t\\ttemptation-a test of his moral or spiritual fibre! Great\\n\\t\\t\\t\\tthough he was as a king, and just though he was as a\\n\\t\\t\\t\\tjudge, the moment that he thought of these things in\\n\\t\\t\\t\\tself- pride, his merit vanished. In himself he was as\\n\\t\\t\\t\\tother men: it was Allah's grace that gave him wisdom and\\n\\t\\t\\t\\tjustice, and he should have been humble in the sight of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "24",
    "NoteID": "4176",
    "Body": "Judged by ordinary standards, David had done no wrong; he\\n\\t\\t\\t\\twas a good and just king. Judged by the highest standard\\n\\t\\t\\t\\tof those nearest to Allah (Muqarraban, lvi. 11), the\\n\\t\\t\\t\\tthought of self-pride and self-righteousness had to be\\n\\t\\t\\t\\twashed off from him by his own act of self-realisation\\n\\t\\t\\t\\tand repentance. This was freely accepted by Allah, as the\\n\\t\\t\\t\\tnext verse shows. A) Some commentators say that David's\\n\\t\\t\\t\\tfault here was his hastiness in judging before hearing\\n\\t\\t\\t\\tthe case of the other party. When he realised his lapse,\\n\\t\\t\\t\\the fell down in repentance."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "26",
    "NoteID": "4177",
    "Body": "Cf. ii. 30, and n. 47. David's kingly power, and the\\n\\t\\t\\t\\tgifts of wisdom, justice, psalmody, and prophethood were\\n\\t\\t\\t\\tbestowed on him as a trust. These great gifts were not to\\n\\t\\t\\t\\tbe a matter of self-glory."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "26",
    "NoteID": "4178",
    "Body": "As stated in n. 1471 above, this vision and its moral are\\n\\t\\t\\t\\tnowhere to be found in the Bible. Those who think they\\n\\t\\t\\t\\tsee a resemblance to the Parable of the prophet Nathan (2\\n\\t\\t\\t\\tSamuel, xii. 1-12) have nothing to go upon but the\\n\\t\\t\\t\\tmention of the \"one ewe\" here and the \"one little\\n\\t\\t\\t\\tewe-lamb\" in Nathan's Parable. The whole story is here\\n\\t\\t\\t\\tdifferent, and the whole atmosphere is different. The\\n\\t\\t\\t\\tBiblical title given to David, \"a man after God's own\\n\\t\\t\\t\\theart\" is refuted by the Bible itself in the scandalous\\n\\t\\t\\t\\ttale of heinous crimes attributed to David in chapters xi\\n\\t\\t\\t\\tand xii. of 2 Samuel, viz., adultery, fraudulent dealing\\n\\t\\t\\t\\twith one of his own servants, and the contriving of his\\n\\t\\t\\t\\tmurder. Further, in chapter xiii, we have the story of\\n\\t\\t\\t\\trapes, incest, and fratricide in David's own household!\\n\\t\\t\\t\\tThe fact is that passages like those are mere chroniques\\n\\t\\t\\t\\tscandaleuses, i.e., narratives of scandalous crimes of\\n\\t\\t\\t\\tthe grossest character. The Muslim idea of David is that\\n\\t\\t\\t\\tof a man just and upright, endowed with all the virtues,\\n\\t\\t\\t\\tin whom even the least thought of self-elation has to be\\n\\t\\t\\t\\twashed off by repentance and forgiveness."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "27",
    "NoteID": "4179",
    "Body": "Cf. iii. 191. Unbelief is the subjective negation of a\\n\\t\\t\\t\\tbelief in Order, Beauty, Purpose, and Eternal Life.\\n\\t\\t\\t\\tUnbelief is to Faith as Chaos is to Cosmos, as the Fire\\n\\t\\t\\t\\tof Misery is to the Garden of Bliss."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "28",
    "NoteID": "4180",
    "Body": "The reference to the Hereafter at the end of verse 26\\n\\t\\t\\t\\tabove is of a piece with the whole tenor of this Sura,\\n\\t\\t\\t\\twhich deals with the superiority of the spiritual kingdom\\n\\t\\t\\t\\tand the Hereafter. If there were no Hereafter, how could\\n\\t\\t\\t\\tyou reconcile the inequalities of this world? Would not\\n\\t\\t\\t\\tthe Unbelievers be right in acting as if all Creation and\\n\\t\\t\\t\\tall life were futile? But there is a Hereafter and Allah\\n\\t\\t\\t\\twill not treat the Good and Evil alike. He is just and\\n\\t\\t\\t\\twill fully restore the balance disturbed in this life."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "29",
    "NoteID": "4181",
    "Body": "Revelation is not a mere chance or haphazard thing. It is\\n\\t\\t\\t\\ta real blessing-among the greatest that Allah has\\n\\t\\t\\t\\tbestowed on man. By meditation on it in an earnest spirit\\n\\t\\t\\t\\tman may learn of himself, and his relation to nature\\n\\t\\t\\t\\taround him and to Allah the Author of all. Men of\\n\\t\\t\\t\\tunderstanding may, by its help, resolve all genuine\\n\\t\\t\\t\\tdoubts that there may be in their minds, and learn the\\n\\t\\t\\t\\ttrue lessons of spiritual life."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "30",
    "NoteID": "4182",
    "Body": "The greatest in this life have yet need of this spiritual\\n\\t\\t\\t\\tblessing: without it all worldly good is futile.\\n\\t\\t\\t\\tReferring back to the story of David, we are now\\n\\t\\t\\t\\tintroduced to Solomon, who was a great king but greater\\n\\t\\t\\t\\tstill because he served Allah and turned to Him. The\\n\\t\\t\\t\\tQur-an, unlike the old Testament, represents Solomon as a\\n\\t\\t\\t\\trighteous king, not as an idolater, doing \"evil in the\\n\\t\\t\\t\\tsight of the Lord\" (1 Kings. xi. 6)."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "31",
    "NoteID": "4183",
    "Body": "The passages about David and Solomon have been variously\\n\\t\\t\\t\\tinterpreted by the Commentators. The versions which I\\n\\t\\t\\t\\thave suggested have good authority behind them, though I\\n\\t\\t\\t\\thave followed my own judgment in filling in the details."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "31",
    "NoteID": "4184",
    "Body": "Safinat: literally, horses that stand, when at ease, on\\n\\t\\t\\t\\tthree legs, firmly planted, with the hoof of the fourth\\n\\t\\t\\t\\tleg resting lightly on the ground. This would imply\\n\\t\\t\\t\\tbreeding and a steady temper, to match with their quality\\n\\t\\t\\t\\tof swiftness mentioned in the next clause."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "32",
    "NoteID": "4185",
    "Body": "The story is not found in the Old Testament. I interpret\\n\\t\\t\\t\\tit to mean that, like his father David, Solomon was also\\n\\t\\t\\t\\tmost meticulous in not allowing the least motive of self\\n\\t\\t\\t\\tto be mixed up with his spiritual virtues. He was fond of\\n\\t\\t\\t\\thorses; he had great armies and wealth; but he used them\\n\\t\\t\\t\\tall in Allah's service. Cf. xxvii. 19. n. 3259; xxvii.\\n\\t\\t\\t\\t40. n. 3276, etc. His battles were not fought for lust of\\n\\t\\t\\t\\tblood, but as Jihad in the cause of righteousness. His\\n\\t\\t\\t\\tlove of horses was not like that of a mere race-goer or\\n\\t\\t\\t\\tof a warrior: there was a spiritual element in it. He\\n\\t\\t\\t\\tloved by a kind of love which was spiritual,-the love of\\n\\t\\t\\t\\tthe highest Good. Some commentators interpret this verse\\n\\t\\t\\t\\tsaying that Soloman, peace be upon him, was so engrossed\\n\\t\\t\\t\\tin the inspection of his fine horses that he completely\\n\\t\\t\\t\\tforgot to say his 'Asr prayer before the sunset'."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "32",
    "NoteID": "4186",
    "Body": "His review of his fine horses was interrupted by his\\n\\t\\t\\t\\tevening devotions, but he resumed it after his devotions."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "33",
    "NoteID": "4187",
    "Body": "Like all lovers of horses, he patted them on their necks\\n\\t\\t\\t\\tand passed his hands over their fore-legs and was proud\\n\\t\\t\\t\\tof having them-not as vanities but as a \"lover of Good\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "34",
    "NoteID": "4188",
    "Body": "What was the trial of Solomon? All the power, wealth, and\\n\\t\\t\\t\\tglory, which were given to him were a spiritual trial to\\n\\t\\t\\t\\thim. They might have turned another man's head, but he\\n\\t\\t\\t\\twas staunch and true, and while he enjoyed and used all\\n\\t\\t\\t\\tthe power he had-over the jinns, men, and the forces of\\n\\t\\t\\t\\tnature, (see below), he kept his mind steady to the\\n\\t\\t\\t\\tservice of Allah. Cf. viii. 28, where \"your possessions\\n\\t\\t\\t\\tand your porgeny\" are declared to be \"but a trial\"."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "34",
    "NoteID": "4189",
    "Body": "\"The body on his throne\" has been variously interpreted.\\n\\t\\t\\t\\tThe interpretation that appeals more is the following:\\n\\t\\t\\t\\tSulaiman was at his utmost height of power and glory.\\n\\t\\t\\t\\tAllah Ta'ala tested him with a severe illness during\\n\\t\\t\\t\\twhich he was no more than a lifeless body on his throne.\\n\\t\\t\\t\\tHe came to realize how weak and powerless he was in the\\n\\t\\t\\t\\teyes of Allah. In this state of weakness and misery he\\n\\t\\t\\t\\tturned to Allah with humility and humbleness."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "35",
    "NoteID": "4190",
    "Body": "The seeking of worldly Power, even if intended to be used\\n\\t\\t\\t\\tfor Allah's service, has a little of Self in it. It may\\n\\t\\t\\t\\tbe quite legitimate and even meritorious in ordinary men,\\n\\t\\t\\t\\tbut even the thought of it in a Prophet is to be\\n\\t\\t\\t\\tapologised for. See a similar idea in the case of David\\n\\t\\t\\t\\texplained in n. 4176 to xxxviii. 24 above."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "35",
    "NoteID": "4191",
    "Body": "He asked for a Power that he would not misuse, though\\n\\t\\t\\t\\tothers might not be able to refrain from misusing\\n\\t\\t\\t\\tit,-such as power over forces of nature or forces of\\n\\t\\t\\t\\tviolence (see the next three verses)."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "35",
    "NoteID": "4192",
    "Body": "Cf. xxxviii. 9 above."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "36",
    "NoteID": "4193",
    "Body": "Cf. xxi. 81, and n. 2736."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "37",
    "NoteID": "4194",
    "Body": "Cf. xxi. 82, and n. 2738. Cf. also xxxiv. 12-13 and notes\\n\\t\\t\\t\\tthere: in the latter passage the spirits mentioned are\\n\\t\\t\\t\\tcalled Jinns. The divers were probably those employed in\\n\\t\\t\\t\\tpearl-fisheries."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "38",
    "NoteID": "4195",
    "Body": "Cf. xiv. 49, where the same expression \"bound together in\\n\\t\\t\\t\\tfetters\" is applied to Sinners on the Day of Judgment."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "39",
    "NoteID": "4196",
    "Body": "Allah bestowed such abundant powers and bounties on\\n\\t\\t\\t\\tSolomon that they could not be counted or measured: and\\n\\t\\t\\t\\the was free to give away anything he liked or keep\\n\\t\\t\\t\\tanything he liked. In this was great temptation for an\\n\\t\\t\\t\\tordinary man. Solomon as a prophet withstood it and asked\\n\\t\\t\\t\\tto be forgiven for power and such a kingdom as others\\n\\t\\t\\t\\tmight not be able to use lawfully. His earthly kingdom\\n\\t\\t\\t\\twent to pieces after his death. But his name and fame\\n\\t\\t\\t\\tendure. And what is more, he obtained a place among the\\n\\t\\t\\t\\tNearest Ones to Allah. See next verse."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "40",
    "NoteID": "4197",
    "Body": "The same words are used of David in xxxviii. 25 above,\\n\\t\\t\\t\\tthus symmetrically closing the argument about the two\\n\\t\\t\\t\\tgreatest kings in Israel."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "41",
    "NoteID": "4198",
    "Body": "For this passage, verses 41-44, Cf. xxi. 83-84."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "41",
    "NoteID": "4199",
    "Body": "The distress was of many kinds. See n. 2739 to xxi. 83.\\n\\t\\t\\t\\tHe suffered from loathsome sores; he lost his home, his\\n\\t\\t\\t\\tpossessions, and his family; and almost his balance of\\n\\t\\t\\t\\tmind. But he did not lose Faith but turned to Allah (see\\n\\t\\t\\t\\tverse 44 below), and the recuperative process began."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "42",
    "NoteID": "4200",
    "Body": "The recuperative process having begun, he was commanded\\n\\t\\t\\t\\tto strike the earth or a rock with his foot, and a\\n\\t\\t\\t\\tfountain or fountains gushed forth,-to give him a bath\\n\\t\\t\\t\\tand clean his body; to refresh his spirits; and to give\\n\\t\\t\\t\\thim drink and rest. This is a fresh touch, not mentioned\\n\\t\\t\\t\\tin S. xxi. or in the Book of Job, but adding beautifully\\n\\t\\t\\t\\tto our realisation of the picture."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "43",
    "NoteID": "4201",
    "Body": "Cf. xxi. 84, and notes 2739-2740."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "44",
    "NoteID": "4202",
    "Body": "In his worst distress Job was patient and constant in\\n\\t\\t\\t\\tfaith, but apparently his wife was not. According to the\\n\\t\\t\\t\\tBook of Job (ii. 9-10), \"Then said his wife unto him,\\n\\t\\t\\t\\tDost thou still retain thine integrity? Curse God, and\\n\\t\\t\\t\\tdie. But he said unto her, Thou speakest as one of the\\n\\t\\t\\t\\tfoolish women speaketh. What? Shall we receive good at\\n\\t\\t\\t\\tthe hand of God, and shall we not receive evil? In all\\n\\t\\t\\t\\tthis did not Job sin with his lips.\" He must have said in\\n\\t\\t\\t\\this haste to the woman that he would beat her: he is\\n\\t\\t\\t\\tasked now to correct her with only a wisp of grass, to\\n\\t\\t\\t\\tshow that he was gentle and humble as well as patient and\\n\\t\\t\\t\\tconstant."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "44",
    "NoteID": "4203",
    "Body": "Cf. xxxviii. 30 above, where similar words are spoken of\\n\\t\\t\\t\\tSolomon. Patience and constancy are also a form of\\n\\t\\t\\t\\tservice, if our attitude is due to an active faith in\\n\\t\\t\\t\\tAllah, and not mere passivity. So Milton in his Sonnet:\\n\\t\\t\\t\\t\"They also serve who only stand and wait. \""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "45",
    "NoteID": "4204",
    "Body": "In the last Sura (xxxvii. 83-113). Abraham and Isaac (and\\n\\t\\t\\t\\tby implication Jacob) were mentioned as resisting Evil\\n\\t\\t\\t\\tand winning through. Here they are mentioned as men with\\n\\t\\t\\t\\tspiritual power and vision. Israelite patriarchs, who\\n\\t\\t\\t\\tbore witness to the Gospel of the Hereafter, and were\\n\\t\\t\\t\\ttherefore a blessing to their people, for they taught the\\n\\t\\t\\t\\tTruth."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "48",
    "NoteID": "4205",
    "Body": "Isma'il, the Patriarch of the Arab race, was also\\n\\t\\t\\t\\tmentioned (xxxvii. 101-107) as a pattern of\\n\\t\\t\\t\\tself-sacrifice; now he is mentioned in the company of the\\n\\t\\t\\t\\tGood, i.e., of those who were a blessing to their people.\\n\\t\\t\\t\\tHere he is bracketed with Elisha (for whom see n. 906 to\\n\\t\\t\\t\\tvi. 86), and Zul-Kifl (for whom see n. 2743 to xxi. 85).\\n\\t\\t\\t\\tAll these three were examples of constancy and patience\\n\\t\\t\\t\\tunder suffering."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "49",
    "NoteID": "4206",
    "Body": "Some of the preeminent examples of the Elect and the Good\\n\\t\\t\\t\\thaving been mentioned, we have now a reference to the\\n\\t\\t\\t\\tRighteous as a body (rank and file as well as leaders)\\n\\t\\t\\t\\tand their future in the Hereafter as won by victory over\\n\\t\\t\\t\\tEvil."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "50",
    "NoteID": "4207",
    "Body": "The Final Bliss will not be a hole-and-corner thing, a\\n\\t\\t\\t\\tpale reflection of some Palace or Retreat, where mystery\\n\\t\\t\\t\\treigns behind closed doors. Its doors will be open, and\\n\\t\\t\\t\\tits inmates will be free to go in and out as they will,\\n\\t\\t\\t\\tbecause their wills will be purified and brought into\\n\\t\\t\\t\\taccord with the Universal Law."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "51",
    "NoteID": "4208",
    "Body": "See n. 4003 to xxxvi. 57."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "52",
    "NoteID": "4209",
    "Body": "Cf. xxxvii. 48 and n. 4064, and xxxvi. 56, n. 4002. As we\\n\\t\\t\\t\\tconceive happiness in this life, it is not complete if it\\n\\t\\t\\t\\tis only solitary. How we hanker after some one who can\\n\\t\\t\\t\\tshare in our highest joy! That feeling is also figured\\n\\t\\t\\t\\there."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "52",
    "NoteID": "4210",
    "Body": "To make the social happiness complete, we want\\n\\t\\t\\t\\tcompanionship of equal age. Age and youth cannot be happy\\n\\t\\t\\t\\ttogether. It is not suggested that in the Timeless state\\n\\t\\t\\t\\tfigured here, there will be old age; but if it is\\n\\t\\t\\t\\tpossible to conceive of temperamental differences then,\\n\\t\\t\\t\\tthe company will be so arranged that it will be\\n\\t\\t\\t\\tcongenial. Or we can accept the type of youth and\\n\\t\\t\\t\\tfreshness as common to all in that happy state."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "55",
    "NoteID": "4211",
    "Body": "This is in parallel contrast to the state of the Blessed\\n\\t\\t\\t\\tin xxxviii. 49 above."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "56",
    "NoteID": "4212",
    "Body": "Cf. xiv. 29. This continues the parallel contrast to the\\n\\t\\t\\t\\tstate of the Blessed already described."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "57",
    "NoteID": "4213",
    "Body": "Cf. x. 4, and n. 1390. The conjunction of the boiling\\n\\t\\t\\t\\tfluid with the dark, murky, intensely cold fluid\\n\\t\\t\\t\\theightenes the effect of the Penalty. In place of\\n\\t\\t\\t\\tharmony, there is the discord of extreme opposites. And\\n\\t\\t\\t\\tthe discord is not confined to this: it runs through the\\n\\t\\t\\t\\twhole idea of Hell. See the next verse."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "59",
    "NoteID": "4214",
    "Body": "The wonder is that so many people should embrace Evil,\\n\\t\\t\\t\\tand in so much hurry and eagerness! Here they may be\\n\\t\\t\\t\\twelcomed by the leaders of Evil, but in the final state\\n\\t\\t\\t\\tit will be the opposite of welcome. They will be followed\\n\\t\\t\\t\\twith reproaches and curses."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "60",
    "NoteID": "4215",
    "Body": "It is the nature of Evil to shift the blame on to others.\\n\\t\\t\\t\\tThe followers will reproach the leaders, but none can\\n\\t\\t\\t\\tescape personal responsibility for his own acts and\\n\\t\\t\\t\\tdeeds!"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "61",
    "NoteID": "4216",
    "Body": "Cf. vii. 38, and n. 1019. See also xi. 20. The evil ones\\n\\t\\t\\t\\tnow vent their spite on others. Here they ask for a\\n\\t\\t\\t\\tdouble penalty for their misleaders, but they forget\\n\\t\\t\\t\\ttheir own personal responsibility. In the next verse,\\n\\t\\t\\t\\tthey express their surprise that others have escaped the\\n\\t\\t\\t\\ttorments, which they themselves have earned!"
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "62",
    "NoteID": "4217",
    "Body": "The bad ones: i.e., the ones whom they (evil ones)\\n\\t\\t\\t\\tridiculed as fools sure to come to an evil end, because\\n\\t\\t\\t\\tthey refused to join in with the evil ones in their\\n\\t\\t\\t\\tplots. The values are now reversed. The good ones are\\n\\t\\t\\t\\tamong the Blessed, and are not to be seen in the \"Bed of\\n\\t\\t\\t\\tMisery\". The ridicule is now against the evil ones."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "64",
    "NoteID": "4218",
    "Body": "The mutual recriminations and spite are themselves a part\\n\\t\\t\\t\\tof the Penalty, for such feelings increase their\\n\\t\\t\\t\\tunhappiness."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "65",
    "NoteID": "4219",
    "Body": "Cf. xii. 39, where Joseph preaches to the men in prison.\\n\\t\\t\\t\\tThe one supreme Message of importance to mankind was (and\\n\\t\\t\\t\\tis) the Unity of Allah: that He is the Creator and\\n\\t\\t\\t\\tSustainer of all: that His Will is supreme; that He can\\n\\t\\t\\t\\tcarry out His Will without question, and no powers of\\n\\t\\t\\t\\tEvil can defeat it; and that He forgives by His grace\\n\\t\\t\\t\\tagain and again. This Message the holy Prophet came to\\n\\t\\t\\t\\tdeliver, and he delivered it."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "66",
    "NoteID": "4220",
    "Body": "In n. 2818 to xxii. 40, I have explained the full import\\n\\t\\t\\t\\tof 'Aziz as a title applied to Allah, and I have\\n\\t\\t\\t\\texpressed two of the leading ideas involved, in the two\\n\\t\\t\\t\\tlines here. The argument in this Sura turns upon the\\n\\t\\t\\t\\tcontrast between earthly Power and the Divine Power: the\\n\\t\\t\\t\\tone is impotent and the other is supreme."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "66",
    "NoteID": "4221",
    "Body": "Gaffar is the emphatic intensive form, and I have\\n\\t\\t\\t\\taccordingly translated it as \"forgiving again and again\".\\n\\t\\t\\t\\tCf. xx. 82."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "68",
    "NoteID": "4222",
    "Body": "The Message which is of supreme import to mankind,-from\\n\\t\\t\\t\\tthat they turn away. Instead of profiting by it, they\\n\\t\\t\\t\\tturn away to side issues, or unprofitable speculation:\\n\\t\\t\\t\\tsuch as: what is the origin of Evil; when will Judgment\\n\\t\\t\\t\\tcome? etc."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "69",
    "NoteID": "4223",
    "Body": "The hierarchy of angels in Heaven, discuss questions of\\n\\t\\t\\t\\thigh import in the Universe. Those are not necessarily\\n\\t\\t\\t\\trevealed to men, except in so far as it is good for men\\n\\t\\t\\t\\tto know, as in verses 71-85 below. But the chief thing\\n\\t\\t\\t\\tfor man is to know that Allah is Most Merciful, that He\\n\\t\\t\\t\\tforgives again and again, and that Evil has no power over\\n\\t\\t\\t\\tthose who trust in Allah."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "70",
    "NoteID": "4224",
    "Body": "Two things are implied in Mubin: (1) that the warning\\n\\t\\t\\t\\tshould be clear and perspicuous; there should be no\\n\\t\\t\\t\\tmincing of matters, no ambiguity, no compromise with\\n\\t\\t\\t\\tevil, vii. 184; (2) that the warning should be delivered\\n\\t\\t\\t\\tpublicly, before all people, in spite of opposition and\\n\\t\\t\\t\\tpersecution, xxvi. 115. Both these ideas I have tried to\\n\\t\\t\\t\\texpress in this passage."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "71",
    "NoteID": "4225",
    "Body": "Two passages may be compared with this: viz.: (1) ii.\\n\\t\\t\\t\\t30-39, where merely the first stages of the Rebellion\\n\\t\\t\\t\\tagainst Allah and its consequences to mankind are\\n\\t\\t\\t\\tmentioned, and (2) xv. 29-40, where the further intrusion\\n\\t\\t\\t\\tof evil in man's life here below is referred to, and an\\n\\t\\t\\t\\tassurance is given that Evil will have no power except\\n\\t\\t\\t\\tover those who yield to it. The latter is the passage\\n\\t\\t\\t\\tmost relevant here, as we are now dealing with the\\n\\t\\t\\t\\tspiritual power of Revelation to defeat the machinations\\n\\t\\t\\t\\tof Evil."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "71",
    "NoteID": "4226",
    "Body": "This shows that the material world round us was created\\n\\t\\t\\t\\tby Allah before Allah fashioned man and breathed of His\\n\\t\\t\\t\\tsoul into him. Geology also shows that man came on the\\n\\t\\t\\t\\tscene at a very late stage in the history of this planet."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "72",
    "NoteID": "4227",
    "Body": "See n. 1968 to xv. 29, where the spiritual significance\\n\\t\\t\\t\\tof this is explained."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "74",
    "NoteID": "4228",
    "Body": "Arrogance (self-love) is thus the root of Evil and of\\n\\t\\t\\t\\tUnfaith."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "75",
    "NoteID": "4229",
    "Body": "Man, as typified by Adam, is in himself nothing but frail\\n\\t\\t\\t\\tclay. But as fashioned by Allah's creative power into\\n\\t\\t\\t\\tsomething with Allah's spirit breathed into him, his\\n\\t\\t\\t\\tdignity is raised above that of the highest creatures."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "75",
    "NoteID": "4230",
    "Body": "If, then, Satan refuses, it is a rebellion against Allah.\\n\\t\\t\\t\\tIt arises from arrogance or haughtiness, an exaggerated\\n\\t\\t\\t\\tidea of Self. Or, it is asked, are you really\\n\\t\\t\\t\\tsufficiently high in rank to dispute with the Almighty?\\n\\t\\t\\t\\tOf course he was not."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "78",
    "NoteID": "4231",
    "Body": "See n. 1972 to xv. 35, where it is explained why the\\n\\t\\t\\t\\trespite is to the Day of Judgment. The whole of that\\n\\t\\t\\t\\tpassage in S. xv. forms a good commentary on this."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "79",
    "NoteID": "4232",
    "Body": "For the significance of the respite see n. 1973 to xv.\\n\\t\\t\\t\\t36."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "81",
    "NoteID": "4233",
    "Body": "It is not an indefinite respite. It is for a period\\n\\t\\t\\t\\tdefinitely limited, while this our Probation lasts in\\n\\t\\t\\t\\tthis world. It is part of the test as to how we use our\\n\\t\\t\\t\\tlimited free-will. After that, our whole existence will\\n\\t\\t\\t\\tbe on a different plane. The good will have been sorted\\n\\t\\t\\t\\tout, the chain of consequences of the present world will\\n\\t\\t\\t\\tbe broken, and \"a new Creation\" will have taken the place\\n\\t\\t\\t\\tof the present World."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "82",
    "NoteID": "4234",
    "Body": "This phrase, this oath of Satan, is a fresh point\\n\\t\\t\\t\\tintroduced in this passage, because here we are dealing\\n\\t\\t\\t\\twith Power-the Power of Good contrasted with Evil,-the\\n\\t\\t\\t\\tPower of Allah as contrasted with the power that we see\\n\\t\\t\\t\\tin our earthly affairs. Satan acknowledges that even his\\n\\t\\t\\t\\tPower, such as it is, has no reality except in so far as\\n\\t\\t\\t\\tit is permitted to operate by Allah in Allah's wise and\\n\\t\\t\\t\\tuniversal Plan, and that it cannot harm the true and\\n\\t\\t\\t\\tsincere worshippers of Allah."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "82",
    "NoteID": "4235",
    "Body": "See n. 1974 to xv. 39."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "84",
    "NoteID": "4236",
    "Body": "Cf. n. 1990 to xv. 64."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "85",
    "NoteID": "4237",
    "Body": "Cf. vii. 18; vii. 179; and xi. 119, n. 1623. The\\n\\t\\t\\t\\tpunishment of defiance, disobedience, and rebellion is\\n\\t\\t\\t\\tinevitable and just, and the followers who chose to\\n\\t\\t\\t\\tidentify themselves with the disobedience must suffer as\\n\\t\\t\\t\\twell as the leaders. Cf. x. 33."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "86",
    "NoteID": "4238",
    "Body": "Cf. xxv. 57; xxvi. 109; and many other passages. The\\n\\t\\t\\t\\tprophet of Allah neither seeks nor expects any reward\\n\\t\\t\\t\\tfrom men. On the contrary he suffers much at their hands.\\n\\t\\t\\t\\tHe is unselfish and offers his services under Allah's\\n\\t\\t\\t\\tinspiration. He is satisfied with the hope \"that each one\\n\\t\\t\\t\\twho will may take a straight Path to his Lord.\" That is\\n\\t\\t\\t\\this reward. And the reward he hopes for from Allah is\\n\\t\\t\\t\\tsimilarly unselfish. He earnestly hopes to win His Good\\n\\t\\t\\t\\tPleasure i.e. \"to see His Face.\""
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "86",
    "NoteID": "4239",
    "Body": "Mutakallif: a man who pretends to things that are not\\n\\t\\t\\t\\ttrue, or declares as facts things that do not exist, one\\n\\t\\t\\t\\twho takes upon himself tasks to which he is not equal.\\n\\t\\t\\t\\tTrue prophets are not people of that kind."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "87",
    "NoteID": "4240",
    "Body": "So far from there being any false or selfish motive in\\n\\t\\t\\t\\tthe Message proclaimed in Revelation, it is a healing\\n\\t\\t\\t\\tmercy to all mankind. More, it is in accord with all\\n\\t\\t\\t\\tparts of Allah's Creation, and makes us kin with all\\n\\t\\t\\t\\tCreation, the handiwork of the One True God."
  },
  {
    "SurahNumber": "38",
    "AyahNumber": "88",
    "NoteID": "4241",
    "Body": "There may be many things which we in our \"muddy vesture\\n\\t\\t\\t\\tof decay\" may not fully understand or take in. If we only\\n\\t\\t\\t\\tfollow the right Path, we shall arrive at the Goal in the\\n\\t\\t\\t\\tHereafter, and then everything will be dear to us."
  }
]
