[
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "1",
    "sectionHeading": "Joining Two Prayers when Settled and when Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Da'ud ibn al-Husayn\\n\\t\\t\\t\\tfrom al-Araj from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, joined\\n\\t\\t\\t\\tdhuhr and asr on his journey to Tabuk.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "2",
    "sectionHeading": "Joining Two Prayers when Settled and when Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zubayr al-Makki\\n\\t\\t\\t\\tfrom Abu't-Tufayl Amir ibn Wathila that Muadh ibn Jabal\\n\\t\\t\\t\\ttold him that they went out with the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, in the year of\\n\\t\\t\\t\\tTabuk, and the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, joined dhuhr with asr and maghrib\\n\\t\\t\\t\\twith isha. Muadh said, \"One day he delayed the prayer,\\n\\t\\t\\t\\tand then came out and prayed dhuhr and asr together. Then\\n\\t\\t\\t\\the said, 'Tomorrow you will come, insha' llah, to the\\n\\t\\t\\t\\tspring of Tabuk. But you will not get there until well\\n\\t\\t\\t\\tinto the morning. No one who arrives should touch any of\\n\\t\\t\\t\\tits water until I come.' We came to it and two men had\\n\\t\\t\\t\\tgot to it before us and the spring was dripping with a\\n\\t\\t\\t\\tlittle water. The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, asked them, 'Have you touched any of\\n\\t\\t\\t\\tits water?' They said, 'Yes.' The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, reviled them and\\n\\t\\t\\t\\tsaid what Allah wished him to say. Then they took water\\n\\t\\t\\t\\twith their hands from the spring little by little until\\n\\t\\t\\t\\tit had been collected in something. Then the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, washed\\n\\t\\t\\t\\this face and hands in it. Then he put it back into the\\n\\t\\t\\t\\tspring and the spring flowed with an abundance of water\\n\\t\\t\\t\\tand the people drew water from it. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, 'If\\n\\t\\t\\t\\tyou live long enough, Muadh, you will soon see this place\\n\\t\\t\\t\\tfilled with gardens.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "3",
    "sectionHeading": "Joining Two Prayers when Settled and when Travelling",
    "text": "<p>\\n\\t\\t\\t\\t3 Yahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, used to join maghrib and isha\\n\\t\\t\\t\\ttogether when it was urgent to travel.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "4",
    "sectionHeading": "Joining Two Prayers when Settled and when Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zubayr al-Makki\\n\\t\\t\\t\\tfrom Said ibn Jubayr that Abdullah ibn Abbas said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, prayed dhuhr and asr together and maghrib and isha\\n\\t\\t\\t\\ttogether, and not out of  fear nor because of\\n\\t\\t\\t\\ttravelling.\" Malik said, \"I believe that was during\\n\\t\\t\\t\\train.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "5",
    "sectionHeading": "Joining Two Prayers when Settled and when Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to join the prayer along with the amirs if\\n\\t\\t\\t\\tthey joined maghrib and isha in the rain.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "6",
    "sectionHeading": "Joining Two Prayers when Settled and when Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that he\\n\\t\\t\\t\\thad asked Salim ibn Abdullah, \"Can you join dhuhr and asr\\n\\t\\t\\t\\twhen travelling?\" He said, \"Yes, there is no harm in\\n\\t\\t\\t\\tthat. Haven't you seen the people pray on Arafa?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "7",
    "sectionHeading": "Joining Two Prayers when Settled and when Travelling",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that AIi\\n\\t\\t\\t\\tibn Husain used to say, \"The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, would join dhuhr and\\n\\t\\t\\t\\tasr if he wished to travel the same day, and he would\\n\\t\\t\\t\\tjoin maghrib and isha if he wished to travel the same\\n\\t\\t\\t\\tnight.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "8",
    "sectionHeading": "Shortening the Prayer in Travel",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from a man\\n\\t\\t\\t\\tof the family of Khalid ibn Asid that he said to Abdullah\\n\\t\\t\\t\\tibn Umar, \"Abu Abd ar-Rahman, we find the fear prayer and\\n\\t\\t\\t\\tthe prayer when settled mentioned in the Qur'an, but we\\n\\t\\t\\t\\tdo not find any mention of the travelling prayer in it.\"\\n\\t\\t\\t\\tIbn Umar said, \"Son of my brother!  Allah the Mighty and\\n\\t\\t\\t\\tMajestic sent us Muhammad, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, and we know nothing. We only do as we saw him\\n\\t\\t\\t\\tdoing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "9",
    "sectionHeading": "Shortening the Prayer in Travel",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Salih ibn Kaysan from\\n\\t\\t\\t\\tUrwa ibn az-Zubayr that A'isha, the wife of the Prophet,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"The\\n\\t\\t\\t\\tprayer was prescribed as two rakas, both when settled and\\n\\t\\t\\t\\twhen travelling. Then the travelling prayer was kept as\\n\\t\\t\\t\\tit was, and an increase was made in the prayer when\\n\\t\\t\\t\\tsettled. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "10",
    "sectionHeading": "Shortening the Prayer in Travel",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the said to Salim ibn Abdullah, \"What is the latest you\\n\\t\\t\\t\\thave seen your father delay maghrib while on a journey?\"\\n\\t\\t\\t\\tand Salim replied, \"One time the sun set when we were at\\n\\t\\t\\t\\tDhat al-Jaysh and he prayed maghrib at al-Aqiq.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "11",
    "sectionHeading": "Circumstances in Which the Prayer Has To Be Shortened",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar, shortened the prayer when he left for hajj or\\n\\t\\t\\t\\tumra at Dhu'l Hulayfa.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "12",
    "sectionHeading": "Circumstances in Which the Prayer Has To Be Shortened",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that his father rode to Rim and shortened\\n\\t\\t\\t\\tthe prayer on the journey.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That was about four mail-stages.\"\\n\\t\\t\\t\\t(approximately forty-eight miles).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "13",
    "sectionHeading": "Circumstances in Which the Prayer Has To Be Shortened",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Salim ibn\\n\\t\\t\\t\\tAbdullah that Abdullah ibn Umar rode to Dhat an-Nusub and\\n\\t\\t\\t\\tshortened the prayer on the journey.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There are four mail-stages between Dhat\\n\\t\\t\\t\\tan-Nusub and Madina.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "14",
    "sectionHeading": "Circumstances in Which the Prayer Has To Be Shortened",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Ibn Umar\\n\\t\\t\\t\\tthat he used to travel to Khaybar and he would shorten\\n\\t\\t\\t\\tthe prayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "15",
    "sectionHeading": "Circumstances in Which the Prayer Has To Be Shortened",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that Abdullah ibn Umar used to shorten the\\n\\t\\t\\t\\tprayer when he travelled for a whole day.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "16",
    "sectionHeading": "Circumstances in Which the Prayer Has To Be Shortened",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that he used to\\n\\t\\t\\t\\ttravel one mail-stage with Ibn Umar, and he would not\\n\\t\\t\\t\\tshorten the prayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "17",
    "sectionHeading": "Circumstances in Which the Prayer Has To Be Shortened",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Abbas used to shorten the prayer when he\\n\\t\\t\\t\\ttravelled a distance equivalent to that between Makka and\\n\\t\\t\\t\\tTa'if, and that between Makka and Usfan and that between\\n\\t\\t\\t\\tMakka and Jedda.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is four mail-stages, and to me that is\\n\\t\\t\\t\\tthe most preferable distance for shortening the prayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone who intends to travel does not\\n\\t\\t\\t\\tshorten the prayer until he has left the houses of the\\n\\t\\t\\t\\tvillage. And he does not do it in full until he comes to\\n\\t\\t\\t\\tthe first houses of the village, or is nearby.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "18",
    "sectionHeading": "The Prayer of a Traveller when Undecided whether to Remain in a Place or Not",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that Abdullah ibn Umar used to say, \"I pray\\n\\t\\t\\t\\tthe prayerof a traveller as long as I am undecided\\n\\t\\t\\t\\twhether to remain somewhere or not, even if I am detained\\n\\t\\t\\t\\tfor twelve nights.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "19",
    "sectionHeading": "The Prayer of a Traveller when Undecided whether to Remain in a Place or Not",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Ibn Umar\\n\\t\\t\\t\\tstayed in Makka for ten nights, shortening the prayer,\\n\\t\\t\\t\\texcept when he prayed it behind an imam, in which case he\\n\\t\\t\\t\\tfollowed the imam's prayer.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t9.5 Doing the Full Prayer when One Decides to Remain in a\\n\\t\\t\\t\\tPlace\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "20",
    "sectionHeading": "Doing the Full Prayer when One Decides to Remain in a Place",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ata al-Khurasani that\\n\\t\\t\\t\\the heard Said ibn al Musayyab say, \"A traveller who has\\n\\t\\t\\t\\tdecided to remain somewhere for four nights does the\\n\\t\\t\\t\\tprayer in full.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what I prefer most out of what I\\n\\t\\t\\t\\thave heard.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik when asked about the prayer of a prisoner, said,\\n\\t\\t\\t\\t\"It is the same as the prayer of a person who remains in\\n\\t\\t\\t\\tone place, except if he is travelling.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "21",
    "sectionHeading": "The Prayer of a Traveller when Imam, or Behind an Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah from his father that Umar ibn al-Khattab,\\n\\t\\t\\t\\twhen he went to Makka, used to lead them in prayer and do\\n\\t\\t\\t\\ttwo rakas and then say, \"People of Makka,complete the\\n\\t\\t\\t\\tprayer, we are a group travelling.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related the same as that to me from Malik from Zayd\\n\\t\\t\\t\\tibn Aslam from his father from Umar ibn al-Khattab.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "22",
    "sectionHeading": "The Prayer of a Traveller when Imam, or Behind an Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to pray four rakas behind the imam at Mina,\\n\\t\\t\\t\\tand when he prayed by himself he would pray two rakas.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "23",
    "sectionHeading": "The Prayer of a Traveller when Imam, or Behind an Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tSafwan said, \"Abdullah ibn Umar used to come and visit\\n\\t\\t\\t\\tAbdullah ibn Safwan and he would pray two rakas with us,\\n\\t\\t\\t\\tand when he went away we would stand and complete the\\n\\t\\t\\t\\tprayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "24",
    "sectionHeading": "Voluntary Prayers while Travelling, by Day and at Night, and Praying on a Riding Beast",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar never used to pray anything with the fard\\n\\t\\t\\t\\tprayer, either before it or after it, while travelling,\\n\\t\\t\\t\\texcept in the depths of the night. He would pray on the\\n\\t\\t\\t\\tground or on his mount, whichever way it was facing.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "25",
    "sectionHeading": "Voluntary Prayers while Travelling, by Day and at Night, and Praying on a Riding Beast",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad and Urwa ibn az-Zubayr and Abu Bakr\\n\\t\\t\\t\\tibn Abd ar Rahman used to pray nawafil when travelling.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked about voluntary prayers\\n\\t\\t\\t\\twhen travelling and he said, \"There is no harm in them,\\n\\t\\t\\t\\teither at night or during the day. I have heard that some\\n\\t\\t\\t\\tof the people of knowledge used to do that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "26",
    "sectionHeading": "Voluntary Prayers while Travelling, by Day and at Night, and Praying on a Riding Beast",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"I have heard from\\n\\t\\t\\t\\tNafi that Abdullah ibn Umar used to see his son,\\n\\t\\t\\t\\tUbaydullah ibn Abdullah, doing voluntary prayers on a\\n\\t\\t\\t\\tjourney,and he would not disapprove of it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "27",
    "sectionHeading": "Voluntary Prayers while Travelling, by Day and at Night, and Praying on a Riding Beast",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Amr ibn Yahya\\n\\t\\t\\t\\tal-Mazini from Abu'l-Hubab Said ibn Yasar that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"I saw the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, praying on a donkey while\\n\\t\\t\\t\\theading towards Khaybar.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "28",
    "sectionHeading": "Voluntary Prayers while Travelling, by Day and at Night, and Praying on a Riding Beast",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, used to pray on his\\n\\t\\t\\t\\tmount while travelling, whichever way it was facing.\\n\\t\\t\\t\\tAbdullah ibn Dinar said, \"Abdullah ibn Umar would also do\\n\\t\\t\\t\\tthat.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "29",
    "sectionHeading": "Voluntary Prayers while Travelling, by Day and at Night, and Praying on a Riding Beast",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"I saw Anas ibn Malik on a journey praying on a donkey\\n\\t\\t\\t\\tfacing away from the qibla. He did the raka and the sajda\\n\\t\\t\\t\\tby motioning with his head, without putting his face on\\n\\t\\t\\t\\tanything.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "30",
    "sectionHeading": "The Prayer of Duha",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Musa ibn Maysara from\\n\\t\\t\\t\\tAbu Murra, the mawla of Aqil ibn Abi Talib, that Umm Hani\\n\\t\\t\\t\\tbint Abi Talib told him that in the year of the conquest\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, prayed eight rakas, covering himself with one\\n\\t\\t\\t\\tgarment.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "31",
    "sectionHeading": "The Prayer of Duha",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah, that Abu Murra, the mawla of Aqil\\n\\t\\t\\t\\tibn Abi Talib, told him that he had heard Umm Hani bint\\n\\t\\t\\t\\tAbi Talib say, \"I went to the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, in the year of the\\n\\t\\t\\t\\tconquest and found him doing ghusl while his daughter\\n\\t\\t\\t\\tFatima, was screening him with a garment. I said to him,\\n\\t\\t\\t\\t'Peace be upon you' and he said, 'Who is that?' I\\n\\t\\t\\t\\treplied, 'Umm Hani bint Abi Talib,' and he said,\\n\\t\\t\\t\\t'Welcome, Umm Hani!'  When he had finished his ghusl, he\\n\\t\\t\\t\\tstood and prayed eight rakas, covering himself with one\\n\\t\\t\\t\\tgarment, and then came away. I said, 'Messenger of Allah,\\n\\t\\t\\t\\tthe son of my mother, AIi, says that he is determined to\\n\\t\\t\\t\\tkill so-and-so, son of Hubayra, a man I have placed under\\n\\t\\t\\t\\tmy protection.'  The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, 'We give protection to\\n\\t\\t\\t\\twhoever you have given protection to, Umm Hani.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tUmm Hani related that this incident happened in the\\n\\t\\t\\t\\tmorning.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "32",
    "sectionHeading": "The Prayer of Duha",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Urwa\\n\\t\\t\\t\\tibn az-Zubayr that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"I never once\\n\\t\\t\\t\\tsaw the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, doing the voluntary prayer of duha, but I\\n\\t\\t\\t\\tmyself do it. Sometimes the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, would refrain from a\\n\\t\\t\\t\\tpractice that he loved to do, fearing that people would\\n\\t\\t\\t\\tdo the same and it would become fard for them .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "33",
    "sectionHeading": "The Prayer of Duha",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tA'isha that she used to pray duha with eight rakas, and\\n\\t\\t\\t\\tshe would say, \"I would never stop doing them even if my\\n\\t\\t\\t\\tparents were to be brought back to life.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "34",
    "sectionHeading": "General Remarks concerning the Voluntary Prayer of Duha",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha from Anas ibn Malik that his grandmother,\\n\\t\\t\\t\\tMulayka, invited the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, for food and he ate some of it.\\n\\t\\t\\t\\tThen the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"Get up and I will lead you in\\n\\t\\t\\t\\tprayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAnas said, \"I stood up and took a woven mat belonging to\\n\\t\\t\\t\\tus that had become black through long use and sprinkled\\n\\t\\t\\t\\tit with water, and the Messengerof Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, stood on it. The orphan and I\\n\\t\\t\\t\\tformed a row behind him, and the old woman stood behind\\n\\t\\t\\t\\tus. He prayed two rakas with us and then left.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "35",
    "sectionHeading": "General Remarks concerning the Voluntary Prayer of Duha",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba said, \"I visited Umar\\n\\t\\t\\t\\tibn al-Khattab just before noon and found him praying a\\n\\t\\t\\t\\tvoluntary prayer. So I stood behind him, but he pulled me\\n\\t\\t\\t\\tnearer and put me next to him, on his right hand side,\\n\\t\\t\\t\\tand then Yarfa came and I moved back and we formed a row\\n\\t\\t\\t\\tbehind him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "36",
    "sectionHeading": "Warning against Passing in Front of Someone Praying",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAbd ar-Rahman ibn Abi Said al-Khudri from his father that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Do not let anyone pass in front of you when\\n\\t\\t\\t\\tyou are praying. Repel him as much as you can, and, if he\\n\\t\\t\\t\\trefuses, fight him, for he is only a shaytan.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "37",
    "sectionHeading": "Warning against Passing in Front of Someone Praying",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah from Busr ibn Said that Zayd ibn\\n\\t\\t\\t\\tKhalid al-Juhani sent him to Abu Juhaym to ask him what\\n\\t\\t\\t\\the had heard from the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, about passing in front of\\n\\t\\t\\t\\tsomeone praying. Abu Juhaym said, \"The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, 'If\\n\\t\\t\\t\\tthe one who passes in front of a man praying knew what he\\n\\t\\t\\t\\twas bringing upon himself it would be better for him to\\n\\t\\t\\t\\tstop for forty than to pass in front of him.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu'n-Nadr said, \"I do not know whether he said forty\\n\\t\\t\\t\\tdays or months or years.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "38",
    "sectionHeading": "Warning against Passing in Front of Someone Praying",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that Kab al-Ahbar said, \"If the person who\\n\\t\\t\\t\\tpassed in front of a man praying knew what he was\\n\\t\\t\\t\\tbringing on himself, it would be better for him to sink\\n\\t\\t\\t\\tinto the ground than to pass in front of him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "39",
    "sectionHeading": "Warning against Passing in Front of Someone Praying",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar used to disapprove of passing in front\\n\\t\\t\\t\\tof women while they were praying.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "40",
    "sectionHeading": "Warning against Passing in Front of Someone Praying",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar would neither pass in front of anyone, nor let\\n\\t\\t\\t\\tanyone pass in front of  him.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "41",
    "sectionHeading": "Permission to Pass in Front of Someone Praying",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud that Abdullah\\n\\t\\t\\t\\tibn Abbas said, \"I approached, riding on a donkey, while\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, was leading the people in prayer at Mina, and I\\n\\t\\t\\t\\twas, at that time, nearing puberty. I passed in front of\\n\\t\\t\\t\\tpart of the row, dismounted, sent the donkey off to\\n\\t\\t\\t\\tgraze, and then joined the row, and no one rebuked me for\\n\\t\\t\\t\\tdoing so.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "42",
    "sectionHeading": "Permission to Pass in Front of Someone Praying",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn Abi Waqqas used to pass in front of some of the\\n\\t\\t\\t\\trows while the prayer was in progress.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I consider that it is permissible to do that\\n\\t\\t\\t\\tif the iqama for the prayer has been said and the imam\\n\\t\\t\\t\\thas said the initial takbir and a man cannot find any way\\n\\t\\t\\t\\tinto the mosque except by going between the rows.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "43",
    "sectionHeading": "Permission to Pass in Front of Someone Praying",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Ali\\n\\t\\t\\t\\tibn Abi Talib said, \"Things that pass in front of a man\\n\\t\\t\\t\\tpraying do not break his prayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that Abdullah ibn Umar used to say, \"Things\\n\\t\\t\\t\\tthat pass in front of a man praying do not break his\\n\\t\\t\\t\\tprayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "44",
    "sectionHeading": "The Sutra of a Man Praying on a Journey",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Umar would use the animal he was riding as a\\n\\t\\t\\t\\tsutra when he prayed.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father used to pray in the desert without a sutra.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "45",
    "sectionHeading": "Brushing Away Small Stones in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu Jafar al-Qari\\n\\t\\t\\t\\tsaid, \"I saw Abdullah ibn Umar quickly brush away the\\n\\t\\t\\t\\tsmall stones from the place where he was going to put his\\n\\t\\t\\t\\tforehead as he was going down into sajda.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "46",
    "sectionHeading": "Brushing Away Small Stones in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\the had heard that Abu Dharr used to say, \"Brush away the\\n\\t\\t\\t\\tsmall stones with one sweep, but if you leave them it is\\n\\t\\t\\t\\tbetter than a red camel.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "47",
    "sectionHeading": "Straightening the Rows",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Umar ibn\\n\\t\\t\\t\\tal-Khattab used to order the rows to be straightened, and\\n\\t\\t\\t\\twhen they had come to him and told him that the rows were\\n\\t\\t\\t\\tstraight he would say the takbir.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "48",
    "sectionHeading": "Straightening the Rows",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from his paternal uncle,\\n\\t\\t\\t\\tAbu Suhayl ibn Malik, that his father said, \"I was with\\n\\t\\t\\t\\tUthman ibn Affan when the iqama was said for the prayer\\n\\t\\t\\t\\tand I was talking to him about being assigned a definite\\n\\t\\t\\t\\tallowance by him. I continued talking to him while he was\\n\\t\\t\\t\\tlevelling some small stones with his sandals, and then\\n\\t\\t\\t\\tsome men that he had entrusted to straighten the rows\\n\\t\\t\\t\\tcame and told him that the rows were straight. He said to\\n\\t\\t\\t\\tme, 'Line up in the row,' and then he said the takbir.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "49",
    "sectionHeading": "Placing One Hand on the Other in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abd al-Karim ibn\\n\\t\\t\\t\\tAbi'l-Mukhariq al-Basri said, \"Among things the Prophet,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said and did\\n\\t\\t\\t\\tare: 'As long as you do not feel ashamed, do whatever you\\n\\t\\t\\t\\twish', the placing of one hand on the other in prayer\\n\\t\\t\\t\\t(one places the right hand on the left), being quick to\\n\\t\\t\\t\\tbreak the fast, and delaying the meal before dawn.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "50",
    "sectionHeading": "Placing One Hand on the Other in the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Hazim ibn Dinar\\n\\t\\t\\t\\tthat Sahl ibn Sad said, \"People used to be ordered to\\n\\t\\t\\t\\tplace their right hands on their left forearms in the\\n\\t\\t\\t\\tprayer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Hazim added, \"I know for sure that Sahl traces that\\n\\t\\t\\t\\tback to the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "51",
    "sectionHeading": "Qunut in the Subh Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar did not say qunut in any of the prayers.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "52",
    "sectionHeading": "Prohibition against a Man Praying when Wishing to Relieve Himself",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Abdullah ibn al-Arqam used to lead his\\n\\t\\t\\t\\tcompanions in prayer. The time for prayer came one day\\n\\t\\t\\t\\tand he went to relieve himself. When he returned, he\\n\\t\\t\\t\\tsaid, \"I heard the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, say, 'If you wish to defecate,\\n\\t\\t\\t\\tyou should do so before the prayer.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "53",
    "sectionHeading": "Prohibition against a Man Praying when Wishing to Relieve Himself",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tUmar ibn al-Khattab said, \"You should not pray while you\\n\\t\\t\\t\\tare holding your bowels.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "54",
    "sectionHeading": "Waiting for The Prayer and Walking to It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The angels\\n\\t\\t\\t\\task for blessings on each one of you as long as he is in\\n\\t\\t\\t\\tthe place where he has prayed and has not discharged\\n\\t\\t\\t\\tanything. They say, 'Allah, forgive him. Allah have mercy\\n\\t\\t\\t\\ton him.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not consider that his words, 'has not\\n\\t\\t\\t\\tdischarged anything' refer to anything other than the\\n\\t\\t\\t\\tdischarges that break wudu.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "55",
    "sectionHeading": "Waiting for The Prayer and Walking to It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"You are in\\n\\t\\t\\t\\tprayer as long as the prayer detains you and there is\\n\\t\\t\\t\\tnothing that prevents you from returning to your family\\n\\t\\t\\t\\texcept the prayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "56",
    "sectionHeading": "Waiting for The Prayer and Walking to It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr, that Abu Bakr ibn Abd ar-Rahman used to say,\\n\\t\\t\\t\\t\"Someone who goes to the mosque in the morning or the\\n\\t\\t\\t\\tafternoon with no intention of going anywhere else,\\n\\t\\t\\t\\teither to learn good or teach it, is like someone who\\n\\t\\t\\t\\tdoes jihad in the way of Allah and returns with booty.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "57",
    "sectionHeading": "Waiting for The Prayer and Walking to It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nuaym ibn Abdullah\\n\\t\\t\\t\\tal-Mujmir that he heard Abu Hurayra say, \"If any one of\\n\\t\\t\\t\\tyou prays and then sits down in the spot where he has\\n\\t\\t\\t\\tprayed, the angels ask blessings on him saying, 'Allah,\\n\\t\\t\\t\\tforgive him. Allah, have mercy on him.' And if he moves\\n\\t\\t\\t\\tfrom the spot where he has prayed and sits elsewhere in\\n\\t\\t\\t\\tthe mosque waiting for the prayer, he remains in prayer\\n\\t\\t\\t\\tuntil he prays.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "58",
    "sectionHeading": "Waiting for The Prayer and Walking to It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from al Ala ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Yaqub from his father from Abu Hurayra that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Shall I tell you the things by which Allah\\n\\t\\t\\t\\terases wrong actions and by which he raises ranks:  the\\n\\t\\t\\t\\tcomplete and correct performance of wudu in adverse\\n\\t\\t\\t\\tconditions, a great number of steps towards the\\n\\t\\t\\t\\tmosque,and waiting after one prayer for the next prayer.\\n\\t\\t\\t\\tThat is the firm hold, that is the firm hold, that is the\\n\\t\\t\\t\\tfirm hold.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "59",
    "sectionHeading": "Waiting for The Prayer and Walking to It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"It is said that no-one except\\n\\t\\t\\t\\ta hypocrite leaves the mosque after the call to prayer,\\n\\t\\t\\t\\texcept for someone who intends to return.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "60",
    "sectionHeading": "Waiting for The Prayer and Walking to It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Amir ibn Abdullah ibn\\n\\t\\t\\t\\taz-Zubayr from Amr ibn Sulaymaz-Zuraqi from Abu\\n\\t\\t\\t\\tQatadaal-Ansari that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"When you enter the\\n\\t\\t\\t\\tmosque, you should pray two rakas before you sit down.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "61",
    "sectionHeading": "Waiting for The Prayer and Walking to It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'nNadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah, that Abu Salama ibn Abd ar-Rahman\\n\\t\\t\\t\\tasked him, \"Didn't I see your master sit down before\\n\\t\\t\\t\\tpraying after he had entered the mosque?\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu'n-Nadr said, \"By that he meant Umar ibn Ubaydullah,\\n\\t\\t\\t\\tand he was finding fault with him for sitting down before\\n\\t\\t\\t\\tpraying after he had come into the mosque.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"It is good to do that but\\n\\t\\t\\t\\tnot obligatory.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "62",
    "sectionHeading": "Placing the Hands Flat on the Surface by the Face when Prostrating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to place his palms flat on the surface\\n\\t\\t\\t\\twhere he put his forehead. Nafi said, \"I have seen him\\n\\t\\t\\t\\ttake his hands out from under his burnus on a very cold\\n\\t\\t\\t\\tday and place them on the ground.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "63",
    "sectionHeading": "Placing the Hands Flat on the Surface by the Face when Prostrating",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"When one of you puts his forehead\\n\\t\\t\\t\\ton the ground he should put his palms on the place where\\n\\t\\t\\t\\the puts his forehead. Then, when he rises, he should\\n\\t\\t\\t\\traise them, for the hands prostrate just as the face\\n\\t\\t\\t\\tprostrates.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "64",
    "sectionHeading": "Turning and Clapping when Necessary during the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Hazim Salama ibn\\n\\t\\t\\t\\tDinar from Sahl ibn Said as-Saidi that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, went to\\n\\t\\t\\t\\tthe tribe of Bani Amr ibn Awf to settle their disputes\\n\\t\\t\\t\\t.The time for the prayer came and the muadhdhin came to\\n\\t\\t\\t\\tAbu Bakr as-Siddiq and said, \"Could you lead the people\\n\\t\\t\\t\\tin prayer and I will say the iqama?\" He said, \"Yes,\" and\\n\\t\\t\\t\\tAbu Bakr prayed. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, came back while the people were\\n\\t\\t\\t\\tpraying, and approached and joined the row. People\\n\\t\\t\\t\\tclapped, but Abu Bakr did not turn round. The people\\n\\t\\t\\t\\tincreased their clapping, and Abu Bakr turned round and\\n\\t\\t\\t\\tsaw the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, and the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, indicated to him to stay in his\\n\\t\\t\\t\\tplace. Abu Bakr raised his hands and praised Allah that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, had told him to do that. Then  he drew back until\\n\\t\\t\\t\\the was in the row, and the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, stepped forward and led\\n\\t\\t\\t\\tthe prayer. When he had finished he said, \"Abu Bakr, what\\n\\t\\t\\t\\tstopped you from staying put like I told you?\" Abu Bakr\\n\\t\\t\\t\\tsaid, \"It is not for Ibn Abi Quhafa to pray in front of\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Why did I see you all clapping so much? If\\n\\t\\t\\t\\tsomething happens to you in the prayer you should say\\n\\t\\t\\t\\t'Subhana-llah' (Glory be to Allah), and when you say\\n\\t\\t\\t\\t'Subhana-llah' you will be heard. Clapping is only for\\n\\t\\t\\t\\twomen.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "65",
    "sectionHeading": "Turning and Clapping when Necessary during the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Ibn Umar\\n\\t\\t\\t\\twould never turn around when praying.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "66",
    "sectionHeading": "Turning and Clapping when Necessary during the Prayer",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu Jafar al-Qari\\n\\t\\t\\t\\tsaid, \"I was praying, and Abdullah ibn Umar was behind me\\n\\t\\t\\t\\tand I was not aware of it. Then I turned round and he\\n\\t\\t\\t\\tprodded me (in disapproval).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "67",
    "sectionHeading": "What to Do when Entering while the Imam is in Ruku",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Abu\\n\\t\\t\\t\\tUmama ibn Sahl ibn Hunayf said, \"Zayd ibn Thabit entered\\n\\t\\t\\t\\tthe mosque and found the people in ruku, so he went into\\n\\t\\t\\t\\truku and then moved slowly forward until he reached the\\n\\t\\t\\t\\trow.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "68",
    "sectionHeading": "What to Do when Entering while the Imam is in Ruku",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Masud used to move forward while in ruku.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "69",
    "sectionHeading": "Prayer on the Prophet, may Allah Bless Him and Grant Him Peace",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Hazim from his father that Amr ibn Sulaym az-Zuraqi\\n\\t\\t\\t\\tsaid, \"Abu Humayd as-Saidi told me that they asked the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, how they were to ask for blessings upon him and he\\n\\t\\t\\t\\treplied that they should say, 'O Allah, bless Muhammad\\n\\t\\t\\t\\tand his wives and his descendants asYou blessed the\\n\\t\\t\\t\\tfamily of Ibrahim, and give baraka to Muhammad and his\\n\\t\\t\\t\\twives and his descendants as You gave baraka to the\\n\\t\\t\\t\\tfamily of Ibrahim. You are worthy of Praise and\\n\\t\\t\\t\\tGlorious.'\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllahumma salli ala Muhammad wa azwajihi wa alihi kama\\n\\t\\t\\t\\tsallaita ala ali Ibrahim, wa barakaala Muhammad wa\\n\\t\\t\\t\\tazwajihi wa alihi kama baraktaalaali Ibrahim, innaka\\n\\t\\t\\t\\tHamidu'm - Majid.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "70",
    "sectionHeading": "Prayer on the Prophet, may Allah Bless Him and Grant Him Peace",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nuaym ibn Abdullah\\n\\t\\t\\t\\tal-Mujmirthat Muhammad ibn Abdullah ibn Zayd told him\\n\\t\\t\\t\\tthat Abu Masud al Ansari said, \"The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, came to us at\\n\\t\\t\\t\\tthe gathering of Sad ibn Ubada. Bashir ibn Sad said to\\n\\t\\t\\t\\thim, 'Allah has ordered us to ask for blessings on you,\\n\\t\\t\\t\\tMessenger of Allah. How should we do it?' The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace,\\n\\t\\t\\t\\tremained silent until we wished we had not asked him.\\n\\t\\t\\t\\tThen he told us to say, 'O Allah, bless Muhammad and the\\n\\t\\t\\t\\tfamily of Muhammad as You blessed Ibrahim, and give\\n\\t\\t\\t\\tbaraka to Muhammad and the family of Muhammad as You gave\\n\\t\\t\\t\\tbaraka to the family of Ibrahim. In all the worlds You\\n\\t\\t\\t\\tare worthy of Praise and Glorious,' and then give the\\n\\t\\t\\t\\ttaslim as you have learnt.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllahumma salli ala Muhammad wa ali Muhammad kama\\n\\t\\t\\t\\tsallaita Ibrahim, wa baraka ala Muhammad wa ali Muhammad\\n\\t\\t\\t\\tkama baraktaala ali Ibrahim. Fi'l alamin, innaka Hamidu'm\\n\\t\\t\\t\\t- Majid.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "71",
    "sectionHeading": "Prayer on the Prophet, may Allah Bless Him and Grant Him Peace",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Dinar\\n\\t\\t\\t\\tsaid, \"I saw Abdullah ibn Umar stop by the grave of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, and ask\\n\\t\\t\\t\\tfor blessings on the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and on Abu Bakr and Umar.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "72",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Ibn Umar\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, used to pray two rakas before dhuhr and\\n\\t\\t\\t\\ttwo rakas after it, two rakas after maghrib, in his\\n\\t\\t\\t\\thouse, and two rakas after isha. He did not pray after\\n\\t\\t\\t\\tjumua until he had left, and then he prayed two rakas.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "73",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Do you see\\n\\t\\t\\t\\tthe direction I am facing here? By Allah, neither your\\n\\t\\t\\t\\tconcentration nor your ruku is hidden from me. I can see\\n\\t\\t\\t\\tyou behind my back.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "74",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that when the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, used to go to Quba (to\\n\\t\\t\\t\\tpray), he would walk as well as ride.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "75",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tan-Numan ibn Murra that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said,\"What about\\n\\t\\t\\t\\tdrunkenness, stealing and adultery? \"That was before\\n\\t\\t\\t\\tanything had been revealed about them. They said, \"Allah\\n\\t\\t\\t\\tand His Messenger know best.\" He said, \"They are excesses\\n\\t\\t\\t\\tand in them is a punishment. And the worst of thieves is\\n\\t\\t\\t\\tthe one who steals his prayer.\" They said, \"How does he\\n\\t\\t\\t\\tsteal his prayer, Messenger of Allah?\" He replied, \"He\\n\\t\\t\\t\\tdoes not do ruku or sajda properly.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "76",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Do some of the prayers in\\n\\t\\t\\t\\tyour houses.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "77",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"When a sick man is unable to\\n\\t\\t\\t\\tprostrate he should motion with his head, and not raise\\n\\t\\t\\t\\tanything to his forehead.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "78",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman that if Abdullah ibn Umar arrived at the mosque\\n\\t\\t\\t\\tand the people had already prayed, he would begin with\\n\\t\\t\\t\\tthe obligatory prayer and not pray anything before it.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "79",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar passed by a man who was praying and said, \"Peace\\n\\t\\t\\t\\tbe upon you,\" and the man replied to him. Abdullah ibn\\n\\t\\t\\t\\tUmar returned to him and said, \"When someone says, 'Peace\\n\\t\\t\\t\\tbe upon you' to you while you are praying do not reply,\\n\\t\\t\\t\\tbut give a signal with your hand.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "80",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Someone who only remembers that he\\n\\t\\t\\t\\thas forgotten a prayer when he is praying the next prayer\\n\\t\\t\\t\\tbehind an imam, should pray the prayer he has forgotten\\n\\t\\t\\t\\tafter the imam has said the taslim, and then pray the\\n\\t\\t\\t\\tother one again.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "81",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Yahya ibn Habban that his paternal uncle\\n\\t\\t\\t\\tWasi ibn Habban said, \"I was praying, and Abdullah ibn\\n\\t\\t\\t\\tUmar was resting his back on the wall of the qibla. When\\n\\t\\t\\t\\tI had finished the prayer I turned towards him on my left\\n\\t\\t\\t\\thand side. Abdullah ibn Umar said, 'What stopped you from\\n\\t\\t\\t\\tturning away to your right?' I replied, 'I saw you and\\n\\t\\t\\t\\tturned towards you.' Abdullah said, 'You have spoken\\n\\t\\t\\t\\tcorrectly. People say that you should turn away to your\\n\\t\\t\\t\\tright, but when you pray, you can turn whichever way you\\n\\t\\t\\t\\twish. If you like, to your right, and if you like, to\\n\\t\\t\\t\\tyour left.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "82",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that one of the muhajirun in whom he saw no\\n\\t\\t\\t\\tharm asked Abdullah ibn Amr ibn al-As, \"Can I pray in a\\n\\t\\t\\t\\tplace where camels are watered?\" Abdullah replied, \"No,\\n\\t\\t\\t\\tbut you can pray in a sheep-pen.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "83",
    "sectionHeading": "How to Do the Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tibn al-Musayyab said, \"Which prayer is it when you remain\\n\\t\\t\\t\\tin the sitting position in every raka?'' Said said, \"It\\n\\t\\t\\t\\tis maghrib when you miss one raka, and that is the sunna\\n\\t\\t\\t\\tin all the prayers.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "84",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Amir ibn Abdullah ibn\\n\\t\\t\\t\\taz-Zubayr from Amr ibn Sulaym az-Zuraqi from Abu Qutada\\n\\t\\t\\t\\tal-Ansari that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, used to pray carrying Umama, who\\n\\t\\t\\t\\twas the daughter of his daughter Zaynab by Abu'l As ibn\\n\\t\\t\\t\\tRabia ibn Abd Shams. When he prostrated, he put her down,\\n\\t\\t\\t\\tand when he got up he carried her.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "85",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Abu'z-Zinad from al-Araj from\\n\\t\\t\\t\\tAbu Hurayra that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"A group of angels in the\\n\\t\\t\\t\\tnight and a group of angels in the day alternate with\\n\\t\\t\\t\\teach other among you, and gather together at the time of\\n\\t\\t\\t\\tthe asr and fajr prayers. Then those that have spent the\\n\\t\\t\\t\\tnight among you ascend, and He asks them, and He knows\\n\\t\\t\\t\\tbest, 'How did you leave my slaves?' and they say, 'When\\n\\t\\t\\t\\twe left them they were praying, and when we came to them\\n\\t\\t\\t\\tthey were praying.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "86",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father from A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, that the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Tell Abu Bakr to lead the people in prayer.\" A'isha\\n\\t\\t\\t\\tsaid, \"Messenger of Allah, when Abu Bakr stands in your\\n\\t\\t\\t\\tplace his voice does not reach the ears of the people\\n\\t\\t\\t\\tbecause of his weeping, so tell Umar to lead the people\\n\\t\\t\\t\\tin prayer.\" He said, \"Tell Abu Bakr to lead the people in\\n\\t\\t\\t\\tprayer.\" A'isha continued, \"I told Hafsa to tell him that\\n\\t\\t\\t\\twhen Abu Bakr stood in his place his voice did not reach\\n\\t\\t\\t\\tthe ears of the people because of his weeping, and that\\n\\t\\t\\t\\the should tell Umar to lead the people in prayer. Hafsa\\n\\t\\t\\t\\tdid so, and the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, 'You are the companions of\\n\\t\\t\\t\\tYusuf! (referring to the women who cut their hands when\\n\\t\\t\\t\\tthey saw the beauty of Yusuf). Tell Abu Bakr to lead the\\n\\t\\t\\t\\tpeople in prayer!' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha added that Hafsa said to her, \"I have never had\\n\\t\\t\\t\\tanything good from you!\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "87",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Ata\\n\\t\\t\\t\\tibn Yazid al-Laythi that Ubaydullah ibn Adi ibnal-Khiyar\\n\\t\\t\\t\\tsaid, \"Once when the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, was sitting with some people, a\\n\\t\\t\\t\\tman came to him and spoke secretly to him. Nobody knew\\n\\t\\t\\t\\twhat he had said until the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, disclosed that he had\\n\\t\\t\\t\\tasked for permission to kill one of the hypocrites. When\\n\\t\\t\\t\\the disclosed this, the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'Doesn't he testify\\n\\t\\t\\t\\tthat there is no god but Allah and that Muhammad is the\\n\\t\\t\\t\\tMessenger of Allah?'  The man replied, 'Of course, but he\\n\\t\\t\\t\\thasn't really done so.' He said, 'Doesn't he do the\\n\\t\\t\\t\\tprayer?' and the man replied, 'Of course, but he doesn't\\n\\t\\t\\t\\treally do the prayer.'\\tHe said, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, 'Those are the ones whom Allah has\\n\\t\\t\\t\\tforbidden me (to kill).' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "88",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"O Allah! Do not\\n\\t\\t\\t\\tmake my grave an idol that is worshipped. The anger on\\n\\t\\t\\t\\tthose who took the graves of their Prophets as places of\\n\\t\\t\\t\\tprostration was terrible.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "89",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tMahmud ibn Rabi al-Ansari that Utban ibn Malik, who was a\\n\\t\\t\\t\\tblind man, used to lead his people in prayer, and he said\\n\\t\\t\\t\\tto the Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, \"Sometimes it is dark and rainy and there is a\\n\\t\\t\\t\\tlot of water around outside, and I am a man who has lost\\n\\t\\t\\t\\this sight. Messenger of Allah, pray in a certain place in\\n\\t\\t\\t\\tmy house so that I can take it as a place to pray.\" The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, came to him and said, \"Where would you like me to\\n\\t\\t\\t\\tpray?\" He indicated a place to him and the Messengerof\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, prayed\\n\\t\\t\\t\\tthere.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "90",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abbad\\n\\t\\t\\t\\tibn Tamim from his paternal uncle that he saw the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, lying down in the mosque with one foot on top of\\n\\t\\t\\t\\tthe other.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tihn al-Musayyab that Umar ibn al Khattab and Uthman ibn\\n\\t\\t\\t\\tAffan, may Allah be pleased with them, used to do the\\n\\t\\t\\t\\tsame.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "91",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAbdullah ibn Masud said to a certain man, \"You are in a\\n\\t\\t\\t\\ttime when men of understanding (fuqaha) are many and\\n\\t\\t\\t\\tQur'an reciters are few, when the limits of behaviour\\n\\t\\t\\t\\tdefined in the Qur'an are guarded and its letters are\\n\\t\\t\\t\\tlost, when few people ask and many give, when they make\\n\\t\\t\\t\\tthe prayer long and the khutba short, and put their\\n\\t\\t\\t\\tactions before their desires. A time will come upon men\\n\\t\\t\\t\\twhen their fuqaha are few but their Qur'an reciters are\\n\\t\\t\\t\\tmany, when the letters of the Qur'an are guarded\\n\\t\\t\\t\\tcarefully but its limits are lost, when many ask but few\\n\\t\\t\\t\\tgive, when they make the khutba long but the prayer\\n\\t\\t\\t\\tshort, and put their desires before their actions.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "92",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"I have heard that the first of the actions of a slave to\\n\\t\\t\\t\\tbe considered on the day of rising is the prayer. If it\\n\\t\\t\\t\\tis accepted from him, the rest of his actions will be\\n\\t\\t\\t\\tconsidered, and if it is not accepted from him, none of\\n\\t\\t\\t\\this actions will be considered.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "92",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The actions\\n\\t\\t\\t\\twhich the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, loved most were those which were done\\n\\t\\t\\t\\tmost constantly.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "94",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard from\\n\\t\\t\\t\\tAmir ibn Sad ibn Abi Waqqas that his father said, \"There\\n\\t\\t\\t\\twere two brothers, one of whom died forty nights before\\n\\t\\t\\t\\tthe other. The merit of the first was being mentioned in\\n\\t\\t\\t\\tthe presence of the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, and he said, 'Wasn't the other\\n\\t\\t\\t\\tone a muslim?'\\tThey said, 'Of course, Messenger of\\n\\t\\t\\t\\tAllah, and there was no harm in him.'  The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'What will make you realise what his prayer has brought\\n\\t\\t\\t\\thim. The prayer is like a deep river of sweet water\\n\\t\\t\\t\\trunning by your door into which you plunge five times a\\n\\t\\t\\t\\tday. How much of your dirtiness do you think that will\\n\\t\\t\\t\\tleave? You do not realise what his prayer has brought\\n\\t\\t\\t\\thim.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "95",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that if\\n\\t\\t\\t\\tsome one passed by Ata ibn Yasar in the mosque with\\n\\t\\t\\t\\tsomething to trade, he would call him and ask, \"What is\\n\\t\\t\\t\\tthe matter with you? What do you want?\" If the man said\\n\\t\\t\\t\\tthat he wished to trade with him, he would say, \"You need\\n\\t\\t\\t\\tthe market of this world. This is the market of the next\\n\\t\\t\\t\\tworld.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "96",
    "sectionHeading": "Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab set aside an area near the mosque\\n\\t\\t\\t\\tcalled al-Butayha and said, \"Whoever wishes to talk\\n\\t\\t\\t\\tnonsense or recite poetry or raise his voice should go to\\n\\t\\t\\t\\tthat area.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "97",
    "sectionHeading": "Stimulation of the Desire for Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from his paternal uncle\\n\\t\\t\\t\\tAbu Suhayl ibn Malik that his father heard Talha ibn\\n\\t\\t\\t\\tUbaydullah say, \"Once one of the people of Najd came to\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace. He had dishevelled hair and although his voice\\n\\t\\t\\t\\tcould be heard we could not make out what he was saying\\n\\t\\t\\t\\tuntil he drew nearer and then we found he was asking\\n\\t\\t\\t\\tabout Islam. The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said to him, 'There are five prayers\\n\\t\\t\\t\\tduring the day and the night.' He said, 'Do I have to do\\n\\t\\t\\t\\tanything else besides that?'  The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, added, 'And fasting\\n\\t\\t\\t\\tthe month of Ramadan.'\\tHe said, 'Is there anything else\\n\\t\\t\\t\\tI have to do?'\\tHe said, 'No, except what you do of your\\n\\t\\t\\t\\town accord.'  The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, mentioned zakat. The man said, 'Is\\n\\t\\t\\t\\tthere anything else that I have to do?' He said, 'No,\\n\\t\\t\\t\\texcept what you do of your own accord.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe continued, \"The man went away saying, 'By Allah, I\\n\\t\\t\\t\\twon't do any more than this, nor will I do any less.' The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'That man will be successful, if he is\\n\\t\\t\\t\\ttelling the truth.'\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "9",
    "hadithNumber": "98",
    "sectionHeading": "Stimulation of the Desire for Prayer in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Shaytan ties\\n\\t\\t\\t\\tthree knots at the back of your head when you sleep, and\\n\\t\\t\\t\\the seals the place of each knot with 'You have a long\\n\\t\\t\\t\\tnight ahead, so sleep.' If you wake up and remember\\n\\t\\t\\t\\tAllah, a knot is untied. If you do wudu, a knot is\\n\\t\\t\\t\\tuntied. If you pray, a knot is untied, and morning finds\\n\\t\\t\\t\\tyou lively and in good spirits, and if not, morning finds\\n\\t\\t\\t\\tyou in bad spirits and lazy.\" \\n\\t\\t\\t</p>"
  }
]
