[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "31",
        "bookName": "Book of Lost Property",
        "bookNameArabic": "كتاب اللقطة",
        "hadiths": [
            {
                "hadithNo": "4498",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Zaid bin Khalid Al-Juhani said: A man came to the Prophet (s.a.w) and asked about picking up lost items. He said: \"Memorize the features of its bag and strap, and announce it for a year. Then if its owner comes (give it to him), otherwise it is yours.\" He said: What about a lost sheep? He (s.a.w) said: \"It is either for you or your brother or for the wolf.\" He said: What about a lost camel? He (s.a.w) said: \"What have you to do with it? It has its water supply and its feet, and it can come to the water and eat from the trees, until its master finds it.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِى عَبْدِ الرَّحْمَنِ عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِىِّ أَنَّهُ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَسَأَلَهُ عَنِ اللُّقَطَةِ فَقَالَ « اعْرِفْ عِفَاصَهَا وَوِكَاءَهَا ثُمَّ عَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ فَشَأْنَكَ بِهَا ». قَالَ فَضَالَّةُ الْغَنَمِ قَالَ « لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ». قَالَ فَضَالَّةُ الإِبِلِ قَالَ « مَا لَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ حَتَّى يَلْقَاهَا رَبُّهَا ». قَالَ يَحْيَى أَحْسِبُ قَرَأْتُ عِفَاصَهَا"
            },
            {
                "hadithNo": "4499",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Zaid bin Khalid Al-Juhani that a man asked the Messenger of Allah (s.a.w) about picking up lost items. He (s.a.w) said: \"Announce it for one year, then memorize the features of its strap and bag, then spend from it. Then if its owner comes, pay him back.\" He said: O Messenger of Allah, what about a lost sheep? He(s.a.w) said: \"Take it, for it will be either for you, for your brother or for the wolf.\" He said: o Messenger of Allah, what about a lost camel? He (the narrator) said: The Messenger of Allah (s.a.w) became so angry that his cheeks turned red - or his face turned red - and he (s.a.w) said: \"What have you to do with it? It has its feet and its water supply until its owner finds it.\"",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالَ ابْنُ حُجْرٍ أَخْبَرَنَا وَقَالَ الآخَرَانِ حَدَّثَنَا إِسْمَاعِيلُ - وَهْوَ ابْنُ جَعْفَرٍ - عَنْ رَبِيعَةَ بْنِ أَبِى عَبْدِ الرَّحْمَنِ عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِىِّ أَنَّ رَجُلاً سَأَلَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- عَنِ اللُّقَطَةِ فَقَالَ « عَرِّفْهَا سَنَةً ثُمَّ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا ثُمَّ اسْتَنْفِقْ بِهَا فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ ». فَقَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الْغَنَمِ قَالَ « خُذْهَا فَإِنَّمَا هِىَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ». فَقَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الإِبِلِ قَالَ فَغَضِبَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- حَتَّى احْمَرَّتْ وَجْنَتَاهُ - أَوِ احْمَرَّ وَجْهُهُ - ثُمَّ قَالَ « مَا لَكَ وَلَهَا مَعَهَا حِذَاؤُهَا وَسِقَاؤُهَا حَتَّى يَلْقَاهَا رَبُّهَا »."
            },
            {
                "hadithNo": "4500",
                "chapterNo": "0",
                "hadithEnglish": "Rabi'ah bin 'Abdur-Rahman narrated a Hadith like that of Malik (no. 4498) with this chain, except that he added: A man came to the Messenger of Allah (s.a.w) when I was with him and asked him about picking up lost items. And he said: 'Amr said in the Hadith: (The Prophet (s.a.w) said:) \"If no one comes looking for it, then spend it.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِى سُفْيَانُ الثَّوْرِىُّ وَمَالِكُ بْنُ أَنَسٍ وَعَمْرُو بْنُ الْحَارِثِ وَغَيْرُهُمْ أَنَّ رَبِيعَةَ بْنَ أَبِى عَبْدِ الرَّحْمَنِ حَدَّثَهُمْ بِهَذَا الإِسْنَادِ مِثْلَ حَدِيثِ مَالِكٍ غَيْرَ أَنَّهُ زَادَ قَالَ أَتَى رَجُلٌ رَسُولَ اللَّهِ -صلى الله عليه وسلم- وَأَنَا مَعَهُ فَسَأَلَهُ عَنِ اللُّقَطَةِ. قَالَ وَقَالَ عَمْرٌو فِى الْحَدِيثِ « فَإِذَا لَمْ يَأْتِ لَهَا طَالِبٌ فَاسْتَنْفِقْهَا »."
            },
            {
                "hadithNo": "4501",
                "chapterNo": "0",
                "hadithEnglish": "Zaid bin Khalid Al-Juhani said: A man came to the Messenger of Allah (s.a.w)... and he mentioned a Hadith like that of Isma'il bin Ja'far (no. 4499), except that he said: His face and forehead turned red and he became angry. And after the words ...'Announce it for a year\" he (the sub-narrator) added, \"then if its owner does not come, it is a trust with you.\"",
                "hadithArabic": "وَحَدَّثَنِى أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الأَوْدِىُّ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنِى سُلَيْمَانُ - وَهُوَ ابْنُ بِلاَلٍ - عَنْ رَبِيعَةَ بْنِ أَبِى عَبْدِ الرَّحْمَنِ عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ قَالَ سَمِعْتُ زَيْدَ بْنَ خَالِدٍ الْجُهَنِىَّ يَقُولُ أَتَى رَجُلٌ رَسُولَ اللَّهِ -صلى الله عليه وسلم-. فَذَكَرَ نَحْوَ حَدِيثِ إِسْمَاعِيلَ بْنِ جَعْفَرٍ. غَيْرَ أَنَّهُ قَالَ فَاحْمَارَّ وَجْهُهُ وَجَبِينُهُ وَغَضِبَ. وَزَادَ بَعْدَ قَوْلِهِ « ثُمَّ عَرِّفْهَا سَنَةً ». « فَإِنْ لَمْ يَجِئْ صَاحِبُهَا كَانَتْ وَدِيعَةً عِنْدَكَ »."
            },
            {
                "hadithNo": "4502",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Yazid, the freed slave of Al-Munba'ith, that he heard Zaid bin Khalid Al-Juhani, the Companion of the Messenger of Allah (s.a.w), say: The Messenger of Allah (s.a.w) was asked about picking up lost gold and silver. He (s.a.w) said: \"Memorize the features of its strap and bag, then announce it for one year. If you do not find [its owner] then spend it, but it is a trust with you. If some day its owner comes looking for it, then pay him back.\" And he asked him about a lost camel. He said: \"What have you to do with it? Let it be, for it has its feet and water supply with it, and it seeks water and eats the trees, until its master finds it.\" And he asked him about a lost sheep. He said: \"Take it, for it is either for you, for your brother or for the wolf.\"",
                "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا سُلَيْمَانُ - يَعْنِى ابْنَ بِلاَلٍ - عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ أَنَّهُ سَمِعَ زَيْدَ بْنَ خَالِدٍ الْجُهَنِىَّ صَاحِبَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- يَقُولُ سُئِلَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- عَنِ اللُّقَطَةِ الذَّهَبِ أَوِ الْوَرِقِ فَقَالَ « اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا ثُمَّ عَرِّفْهَا سَنَةً فَإِنْ لَمْ تَعْرِفْ فَاسْتَنْفِقْهَا وَلْتَكُنْ وَدِيعَةً عِنْدَكَ فَإِنْ جَاءَ طَالِبُهَا يَوْمًا مِنَ الدَّهْرِ فَأَدِّهَا إِلَيْهِ ». وَسَأَلَهُ عَنْ ضَالَّةِ الإِبِلِ فَقَالَ « مَا لَكَ وَلَهَا دَعْهَا فَإِنَّ مَعَهَا حِذَاءَهَا وَسِقَاءَهَا تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ حَتَّى يَجِدَهَا رَبُّهَا ». وَسَأَلَهُ عَنِ الشَّاةِ فَقَالَ « خُذْهَا فَإِنَّمَا هِىَ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ »."
            },
            {
                "hadithNo": "4503",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Yazid, the freed slave of Al-Munba'ith, from Zaid bin Khalid Al-Juhani, that a man asked the Prophet (s.a.w) about a lost camel. Rabi'ah added: He (s.a.w) became so angry that his cheeks turned red... and he quoted a Hadith similar to their (no. 4502), and added (that the Prophet (s.a.w) said:) \"If its owner comes and recognizes its bag, amount and strap, then give it to him, otherwise it is yours.\"",
                "hadithArabic": "وَحَدَّثَنِى إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا حَبَّانُ بْنُ هِلاَلٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنِى يَحْيَى بْنُ سَعِيدٍ وَرَبِيعَةُ الرَّأْىِ بْنُ أَبِى عَبْدِ الرَّحْمَنِ عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِىِّ أَنَّ رَجُلاً سَأَلَ النَّبِىَّ -صلى الله عليه وسلم- عَنْ ضَالَّةِ الإِبِلِ. زَادَ رَبِيعَةُ فَغَضِبَ حَتَّى احْمَرَّتْ وَجْنَتَاهُ. وَاقْتَصَّ الْحَدِيثَ بِنَحْوِ حَدِيثِهِمْ وَزَادَ « فَإِنْ جَاءَ صَاحِبُهَا فَعَرَفَ عِفَاصَهَا وَعَدَدَهَا وَوِكَاءَهَا فَأَعْطِهَا إِيَّاهُ وَإِلاَّ فَهْىَ لَكَ »."
            },
            {
                "hadithNo": "4504",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Zaid bin Khalid Al-Juhani said: The Messenger of Allah (s.a.w) was asked about picking up lost items. He said: \"Announce it for one year, then if it is not recognized (i.e., claimed), memorize the features of its bag and strap, then consume it, but if its owner comes, pay it back.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِى الضَّحَّاكُ بْنُ عُثْمَانَ عَنْ أَبِى النَّضْرِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِىِّ قَالَ سُئِلَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- عَنِ اللُّقَطَةِ فَقَالَ « عَرِّفْهَا سَنَةً فَإِنْ لَمْ تُعْتَرَفْ فَاعْرِفْ عِفَاصَهَا وَوِكَاءَهَا ثُمَّ كُلْهَا فَإِنْ جَاءَ صَاحِبُهَا فَأَدِّهَا إِلَيْهِ »."
            },
            {
                "hadithNo": "4505",
                "chapterNo": "0",
                "hadithEnglish": "Ad-Dahhak bin 'Uthman narrated it with this chain (a Hadith similar to no. 4504), and he said in the Hadith: \"If it is recognized, then pay it back, otherwise memorize the features of its strap, bag, container and amount.\"",
                "hadithArabic": "وَحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو بَكْرٍ الْحَنَفِىُّ حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ بِهَذَا الإِسْنَادِ وَقَالَ فِى الْحَدِيثِ « فَإِنِ اعْتُرِفَتْ فَأَدِّهَا وَإِلاَّ فَاعْرِفْ عِفَاصَهَا وَوِكَاءَهَا وَعَدَدَهَا »."
            },
            {
                "hadithNo": "4506",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated that Salamah bin Kuhayl said: I heard Suwaid bin Ghafalah say: I went out with Zaid bin Suhan and Salman bin Rabi'ah on a campaign, and I found a whip and picked it up. They said to me: Leave it. I said: No, but I will announce it. If its owner comes (I will give it to him), otherwise I will make use of it. I refused (to pay heed to them). When we came back from our campaign, it was decreed that I would go for Hajj. I came to AI-Madinah and met Ubayy bin Ka'b, and I told him about the whip and what they had said. He said: At the time of the Messenger of Allah (s.a.w) I found a moneybag in which there was one hundred Dinar. I brought it to the Messenger of Allah (s.a.w) and he said: \"Announce it for one year.\" So I announced it, but no one came forward to claim it. I came to him again and he said: \"Announce it for one year,\" but no one came forward to claim it. Then I came to him again and he said, \"Announce it for one year.\" So I announced it, but no one came forward to claim it. Then he said: \"Memorize its number, and the features of its bag and strap, then if its owner comes (give it to him), otherwise make use of it.\" So I made use of it. I met him in Makkah after that and he said: I do not know if it was three years or one year.",
                "hadithArabic": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح وَحَدَّثَنِى أَبُو بَكْرِ بْنُ نَافِعٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ سَمِعْتُ سُوَيْدَ بْنَ غَفَلَةَ قَالَ خَرَجْتُ أَنَا وَزَيْدُ بْنُ صُوحَانَ وَسَلْمَانُ بْنُ رَبِيعَةَ غَازِينَ فَوَجَدْتُ سَوْطًا فَأَخَذْتُهُ فَقَالاَ لِى دَعْهُ. فَقُلْتُ لاَ وَلَكِنِّى أُعَرِّفُهُ فَإِنْ جَاءَ صَاحِبُهُ وَإِلاَّ اسْتَمْتَعْتُ بِهِ. قَالَ فَأَبَيْتُ عَلَيْهِمَا فَلَمَّا رَجَعْنَا مِنْ غَزَاتِنَا قُضِىَ لِى أَنِّى حَجَجْتُ فَأَتَيْتُ الْمَدِينَةَ فَلَقِيتُ أُبَىَّ بْنَ كَعْبٍ فَأَخْبَرْتُهُ بِشَأْنِ السَّوْطِ وَبِقَوْلِهِمَا فَقَالَ إِنِّى وَجَدْتُ صُرَّةً فِيهَا مِائَةُ دِينَارٍ عَلَى عَهْدِ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فَأَتَيْتُ بِهَا رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « عَرِّفْهَا حَوْلاً ». قَالَ فَعَرَّفْتُهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا ثُمَّ أَتَيْتُهُ. فَقَالَ « عَرِّفْهَا حَوْلاً ». فَعَرَّفْتُهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا ثُمَّ أَتَيْتُهُ. فَقَالَ « عَرِّفْهَا حَوْلاً ». فَعَرَّفْتُهَا فَلَمْ أَجِدْ مَنْ يَعْرِفُهَا. فَقَالَ « احْفَظْ عَدَدَهَا وَوِعَاءَهَا وَوِكَاءَهَا فَإِنْ جَاءَ صَاحِبُهَا وَإِلاَّ فَاسْتَمْتِعْ بِهَا ». فَاسْتَمْتَعْتُ بِهَا. فَلَقِيتُهُ بَعْدَ ذَلِكَ بِمَكَّةَ فَقَالَ لاَ أَدْرِى بِثَلاَثَةِ أَحْوَالٍ أَوْ حَوْلٍ وَاحِدٍ."
            },
            {
                "hadithNo": "4507",
                "chapterNo": "0",
                "hadithEnglish": "Suwaid bin Ghafalah said: I went out with Zaid bin Suhan and Salman bin Rabi'ah, and I found a whip... and he narrated a similar Hadith (as no. 4506), up to the words: so I made use of it. Shu'bah (a sub-narrator) said: And I heard him ten years later saying: I announced it for one year.",
                "hadithArabic": "وَحَدَّثَنِى عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ الْعَبْدِىُّ حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِى سَلَمَةُ بْنُ كُهَيْلٍ أَوْ أَخْبَرَ الْقَوْمَ وَأَنَا فِيهِمْ قَالَ سَمِعْتُ سُوَيْدَ بْنَ غَفَلَةَ قَالَ خَرَجْتُ مَعَ زَيْدِ بْنِ صُوحَانَ وَسَلْمَانَ بْنِ رَبِيعَةَ فَوَجَدْتُ سَوْطًا. وَاقْتَصَّ الْحَدِيثَ بِمِثْلِهِ إِلَى قَوْلِهِ فَاسْتَمْتَعْتُ بِهَا. قَالَ شُعْبَةُ فَسَمِعْتُهُ بَعْدَ عَشْرِ سِنِينَ يَقُولُ عَرَّفَهَا عَامًا وَاحِدًا."
            },
            {
                "hadithNo": "4508",
                "chapterNo": "0",
                "hadithEnglish": "A Hadith like that of Shu'bah (no. 4507) was narrated from Salamah bin Kuhayl with this chain. In the Hadith of both of them it says: three years, except for Hammad bin Salamah, in whose Hadith it says: for two or three years. In the Hadith of Salman and Zaid bin Abi Unaysah and Hammad bin Salamah it says: \"If someone comes and describes to you its number, its bag and its strap, then give it to him.\" Sufyan added in the report of Waki': \"Otherwise, it is like your own property.\" In the report of Ibn Numair it says: \"Otherwise, make use of it.\"",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنِ الأَعْمَشِ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى جَمِيعًا عَنْ سُفْيَانَ ح وَحَدَّثَنِى مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّىُّ حَدَّثَنَا عُبَيْدُ اللَّهِ - يَعْنِى ابْنَ عَمْرٍو - عَنْ زَيْدِ بْنِ أَبِى أُنَيْسَةَ ح وَحَدَّثَنِى عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ كُلُّ هَؤُلاَءِ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ بِهَذَا الإِسْنَادِ. نَحْوَ حَدِيثِ شُعْبَةَ. وَفِى حَدِيثِهِمْ جَمِيعًا ثَلاَثَةَ أَحْوَالٍ إِلاَّ حَمَّادَ بْنَ سَلَمَةَ فَإِنَّ فِى حَدِيثِهِ عَامَيْنِ أَوْ ثَلاَثَةً. وَفِى حَدِيثِ سُفْيَانَ وَزَيْدِ بْنِ أَبِى أُنَيْسَةَ وَحَمَّادِ بْنِ سَلَمَةَ « فَإِنْ جَاءَ أَحَدٌ يُخْبِرُكَ بِعَدَدِهَا وَوِعَائِهَا وَوِكَائِهَا فَأَعْطِهَا إِيَّاهُ ». وَزَادَ سُفْيَانُ فِى رِوَايَةِ وَكِيعٍ « وَإِلاَّ فَهِىَ كَسَبِيلِ مَالِكَ ». وَفِى رِوَايَةِ ابْنِ نُمَيْرٍ « وَإِلاَّ فَاسْتَمْتِعْ بِهَا »."
            },
            {
                "hadithNo": "4509",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Abdur-Rahman bin 'Uthman At-Taimi that the Messenger of Allah (s.a.w) forbade picking up property lost by a pilgrim.",
                "hadithArabic": "حَدَّثَنِى أَبُو الطَّاهِرِ وَيُونُسُ بْنُ عَبْدِ الأَعْلَى قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِى عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الأَشَجِّ عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِىِّ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- نَهَى عَنْ لُقَطَةِ الْحَاجِّ."
            },
            {
                "hadithNo": "4510",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Zaid bin Khalid Al-Juhani that the Messenger of Allah (s.a.w) said: \"Whoever finds a lost item is himself lost, unless he announces it.\"",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الطَّاهِرِ وَيُونُسُ بْنُ عَبْدِ الأَعْلَى قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِى عَمْرُو بْنُ الْحَارِثِ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ أَبِى سَالِمٍ الْجَيْشَانِىِّ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِىِّ عَنْ رَسُولِ اللَّهِ -صلى الله عليه وسلم- أَنَّهُ قَالَ « مَنْ آوَى ضَالَّةً فَهُوَ ضَالٌّ مَا لَمْ يُعَرِّفْهَا »."
            },
            {
                "hadithNo": "4511",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Messenger of Allah (s.a.w) said: No one should milk the animals of another person without his permission. Would one of you like his store to be raided and his vessels to be broken into and his food to be taken? The udders of their livestock also store up food for them, so no one should milk the animals of another person without his permission.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « لاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ أَيُحِبُّ أَحَدُكُمْ أَنْ تُؤْتَى مَشْرُبَتُهُ فَتُكْسَرَ خِزَانَتُهُ فَيُنْتَقَلَ طَعَامُهُ إِنَّمَا تَخْزُنُ لَهُمْ ضُرُوعُ مَوَاشِيهِمْ أَطْعِمَتَهُمْ فَلاَ يَحْلُبَنَّ أَحَدٌ مَاشِيَةَ أَحَدٍ إِلاَّ بِإِذْنِهِ »."
            },
            {
                "hadithNo": "4512",
                "chapterNo": "2",
                "hadithEnglish": "A Hadith like that of Malik (no. 4511) was narrated from Nafi' from Ibn 'Umar, from the Prophet (s.a.w), except that in their Hadith it says: \"...to be thrown on the floor,\" except for Al-Laith bin Sa'd, in whose Hadith it says: \"...or his food to be taken,\" as in the report of Malik.",
                "hadithArabic": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ رُمْحٍ جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَلِىُّ بْنُ مُسْهِرٍ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنِى أَبِى كِلاَهُمَا عَنْ عُبَيْدِ اللَّهِ ح وَحَدَّثَنِى أَبُو الرَّبِيعِ وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَاعِيلُ - يَعْنِى ابْنَ عُلَيَّةَ - جَمِيعًا عَنْ أَيُّوبَ ح وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ أَيُّوبَ وَابْنُ جُرَيْجٍ عَنْ مُوسَى كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. نَحْوَ حَدِيثِ مَالِكٍ غَيْرَ أَنَّ فِى حَدِيثِهِمْ جَمِيعًا « فَيُنْتَثَلَ ». إِلاَّ اللَّيْثَ بْنَ سَعْدٍ فَإِنَّ فِى حَدِيثِهِ « فَيُنْتَقَلَ طَعَامُهُ ». كَرِوَايَةِ مَالِكٍ."
            },
            {
                "hadithNo": "4513",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Shurayh Al-'Adawi said: My ears heard and my eyes saw, when the Messenger of Allah (s.a.w) spoke and said: \"Whoever believes in Allah and the Last Day, let him honor his guest with full hospitality.\" They said: What is full hospitality, O Messenger of Allah? He said: \"One day and one night, and hospitality is for three days, and anything beyond that is charity towards him.\" And he (s.a.w) said: \"Whoever believes in Allah and the Last Day, let him speak well or else remain silent.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ سَعِيدِ بْنِ أَبِى سَعِيدٍ عَنْ أَبِى شُرَيْحٍ الْعَدَوِىِّ أَنَّهُ قَالَ سَمِعَتْ أُذُنَاىَ وَأَبْصَرَتْ عَيْنَاىَ حِينَ تَكَلَّمَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقَالَ « مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتَهُ ». قَالُوا وَمَا جَائِزَتُهُ يَا رَسُولَ اللَّهِ قَالَ « يَوْمُهُ وَلَيْلَتُهُ وَالضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ فَمَا كَانَ وَرَاءَ ذَلِكَ فَهُوَ صَدَقَةٌ عَلَيْهِ - وَقَالَ - مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ »."
            },
            {
                "hadithNo": "4514",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that Abu Shurayh Al-Khuza'i said: The Messenger of Allah (s.a.w) said: \"Hospitality is for three days, and full hospitality is for one day and one night. It is not permissible for a Muslim man to stay with his brother until he causes him to sin.\" They said: o Messenger of Allah, how could he cause him to sin? He said: \"When he stays with him until there is nothing left with which to entertain him.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ سَعِيدِ بْنِ أَبِى سَعِيدٍ الْمَقْبُرِىِّ عَنْ أَبِى شُرَيْحٍ الْخُزَاعِىِّ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « الضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ وَجَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ وَلاَ يَحِلُّ لِرَجُلٍ مُسْلِمٍ أَنْ يُقِيمَ عِنْدَ أَخِيهِ حَتَّى يُؤْثِمَهُ ». قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ يُؤْثِمُهُ قَالَ « يُقِيمُ عِنْدَهُ وَلاَ شَىْءَ لَهُ يَقْرِيهِ بِهِ »."
            },
            {
                "hadithNo": "4515",
                "chapterNo": "3",
                "hadithEnglish": "Abu Shurayh Al-Khuza'i said: My ears heard, my eyes saw and my heart understood, when the Messenger of Allah (s.a.w) spoke of it... and he narrated a Hadith like that of Al-Laith (no. 4513), in which he said: \"It is not permissible for any one of you to stay with his brother until he causes him to sin,\" as in the Hadith of Waki' (no.4514).",
                "hadithArabic": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو بَكْرٍ - يَعْنِى الْحَنَفِىَّ - حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ الْمَقْبُرِىُّ أَنَّهُ سَمِعَ أَبَا شُرَيْحٍ الْخُزَاعِىَّ يَقُولُ سَمِعَتْ أُذُنَاىَ وَبَصُرَ عَيْنِى وَوَعَاهُ قَلْبِى حِينَ تَكَلَّمَ بِهِ رَسُولُ اللَّهِ -صلى الله عليه وسلم-. فَذَكَرَ بِمِثْلِ حَدِيثِ اللَّيْثِ وَذَكَرَ فِيهِ « وَلاَ يَحِلُّ لأَحَدِكُمْ أَنْ يُقِيمَ عِنْدَ أَخِيهِ حَتَّى يُؤْثِمَهُ ». بِمِثْلِ مَا فِى حَدِيثِ وَكِيعٍ."
            },
            {
                "hadithNo": "4516",
                "chapterNo": "3",
                "hadithEnglish": "It was narrated that 'Uqbah bin 'Amir said: We said: O Messenger of Allah, you send us and we stay with people who do not show us hospitality. What do you think? The Messenger of Allah (s.a.w) said to us: \"If you stay with a people and they order that you be offered what is befitting to a guest, then accept it, and if they do not do that, then take from them the right of a guest that is due to him.\"",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِى حَبِيبٍ عَنْ أَبِى الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّهُ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّكَ تَبْعَثُنَا فَنَنْزِلُ بِقَوْمٍ فَلاَ يَقْرُونَنَا فَمَا تَرَى فَقَالَ لَنَا رَسُولُ اللَّهِ -صلى الله عليه وسلم- « إِنْ نَزَلْتُمْ بِقَوْمٍ فَأَمَرُوا لَكُمْ بِمَا يَنْبَغِى لِلضَّيْفِ فَاقْبَلُوا فَإِنْ لَمْ يَفْعَلُوا فَخُذُوا مِنْهُمْ حَقَّ الضَّيْفِ الَّذِى يَنْبَغِى لَهُمْ »."
            },
            {
                "hadithNo": "4517",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Abu Sa'eed Al-Khudri said: Whilst we were on a journey with the Prophet (s.a.w), a man came to him on a mount of his and started looking to his right and left. The Messenger of Allah (s.a.w) said: \"Whoever has a surplus mount, let him give it to one who has no mount, and whoever has surplus provisions, let him give them to one who has no provisions.\" He mentioned various kinds of wealth, until we thought that none of us had any right to any kind of surplus.",
                "hadithArabic": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا أَبُو الأَشْهَبِ عَنْ أَبِى نَضْرَةَ عَنْ أَبِى سَعِيدٍ الْخُدْرِىِّ قَالَ بَيْنَمَا نَحْنُ فِى سَفَرٍ مَعَ النَّبِىِّ -صلى الله عليه وسلم- إِذْ جَاءَ رَجُلٌ عَلَى رَاحِلَةٍ لَهُ قَالَ فَجَعَلَ يَصْرِفُ بَصَرَهُ يَمِينًا وَشِمَالاً فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « مَنْ كَانَ مَعَهُ فَضْلُ ظَهْرٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لاَ ظَهْرَ لَهُ وَمَنْ كَانَ لَهُ فَضْلٌ مِنْ زَادٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لاَ زَادَ لَهُ ». قَالَ فَذَكَرَ مِنْ أَصْنَافِ الْمَالِ مَا ذَكَرَ حَتَّى رَأَيْنَا أَنَّهُ لاَ حَقَّ لأَحَدٍ مِنَّا فِى فَضْلٍ."
            },
            {
                "hadithNo": "4518",
                "chapterNo": "5",
                "hadithEnglish": "Iyas bin Salamah narrated that his father said: We went out with the Messenger of Allah (s.a.w) on a campaign, and we faced hardship, so much so that we thought of slaughtering some of our mounts. The Prophet of Allah (s.a.w) ordered us to gather together our provisions, then we spread out a sheet of leather and he gathered together the people's provisions on that leather sheet. I measured it and found that it was the size of a spot where a goat could sit, and we were fourteen hundred men. We ate until we were all had our hunger satisfied, then we filled our bags. The Prophet of Allah (s.a.w) said: \"Is there any water for Wudu'?\" A man brought a small bucket in which there was a drop of water, and poured it into a bowl. We all did Wudu', using water plentifully, fourteen hundred men. Then after that eight men came and said: Is there any water for Wudu '? And the Messenger of Allah (s.a.w) said: \"(The water for) Wudu' is finished.\"",
                "hadithArabic": "حَدَّثَنِى أَحْمَدُ بْنُ يُوسُفَ الأَزْدِىُّ حَدَّثَنَا النَّضْرُ - يَعْنِى ابْنَ مُحَمَّدٍ الْيَمَامِىَّ - حَدَّثَنَا عِكْرِمَةُ - وَهُوَ ابْنُ عَمَّارٍ - حَدَّثَنَا إِيَاسُ بْنُ سَلَمَةَ عَنْ أَبِيهِ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- فِى غَزْوَةٍ فَأَصَابَنَا جَهْدٌ حَتَّى هَمَمْنَا أَنْ نَنْحَرَ بَعْضَ ظَهْرِنَا فَأَمَرَ نَبِىُّ اللَّهِ -صلى الله عليه وسلم- فَجَمَعْنَا مَزَاوِدَنَا فَبَسَطْنَا لَهُ نِطَعًا فَاجْتَمَعَ زَادُ الْقَوْمِ عَلَى النِّطَعِ قَالَ فَتَطَاوَلْتُ لأَحْزُرَهُ كَمْ هُوَ فَحَزَرْتُهُ كَرَبْضَةِ الْعَنْزِ وَنَحْنُ أَرْبَعَ عَشْرَةَ مِائَةً قَالَ فَأَكَلْنَا حَتَّى شَبِعْنَا جَمِيعًا ثُمَّ حَشَوْنَا جُرُبَنَا فَقَالَ نَبِىُّ اللَّهِ -صلى الله عليه وسلم- « فَهَلْ مِنْ وَضُوءٍ ». قَالَ فَجَاءَ رَجُلٌ بِإِدَاوَةٍ لَهُ فِيهَا نُطْفَةٌ فَأَفْرَغَهَا فِى قَدَحٍ فَتَوَضَّأْنَا كُلُّنَا نُدَغْفِقُهُ دَغْفَقَةً أَرْبَعَ عَشْرَةَ مِائَةً. قَالَ ثُمَّ جَاءَ بَعْدَ ذَلِكَ ثَمَانِيَةٌ فَقَالُوا هَلْ مِنْ طَهُورٍ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « فَرِغَ الْوَضُوءُ »."
            }
        ]
    }
]