[
  {
    "SurahNumber": "56",
    "AyahNumber": "1",
    "NoteID": "5222",
    "Body": "The Event Inevitable is the Hour of Judgment. People may\\n\\t\\t\\t\\tdoubt now whether it will come. But when it comes, as it\\n\\t\\t\\t\\twill come, suddenly upon them, it will come with such\\n\\t\\t\\t\\ttremendous reality that it will be burnt deep into the\\n\\t\\t\\t\\texperience of every soul. No one can then be deceived or\\n\\t\\t\\t\\tentertain false notions about it."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "3",
    "NoteID": "5223",
    "Body": "There will be a sorting out of Good and Evil. Or rather,\\n\\t\\t\\t\\t(verse 7 below), there will be three main classes. Among\\n\\t\\t\\t\\tthe Good there will be the specially exalted class, those\\n\\t\\t\\t\\tnearest to Allah (muqarrabun, lvi. 11-26), and the\\n\\t\\t\\t\\trighteous people generally, called the Companions of the\\n\\t\\t\\t\\tRight Hand (Ashab-ul-maimana, lvi. 27-40). And there will\\n\\t\\t\\t\\tbe those in agony, the Companions of the Left Hand\\n\\t\\t\\t\\t(Ashab-ul-mash-ama, lvi. 41-56). Many who were high and\\n\\t\\t\\t\\tmighty in this life will be brought low for their sins,\\n\\t\\t\\t\\tand many who were lowly but virtuous will be exalted to\\n\\t\\t\\t\\tvarious ranks and degrees. The old landmarks will be lost\\n\\t\\t\\t\\tin the inner world, as they will be in the outer world."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "5",
    "NoteID": "5224",
    "Body": "The old physical world will disappear in the New\\n\\t\\t\\t\\tCreation."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "7",
    "NoteID": "5225",
    "Body": "See n. 5223 above."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "10",
    "NoteID": "5226",
    "Body": "Foremost (in Faith)\": there are two meanings, and both\\n\\t\\t\\t\\tare implied (1) Those who have reached the highest degree\\n\\t\\t\\t\\tin spiritual understanding, such as the great prophets\\n\\t\\t\\t\\tand teachers of mankind, will also take precedence in the\\n\\t\\t\\t\\tHereafter. (2) Those who are the first in time-the\\n\\t\\t\\t\\tquickest and readiest-to accept Allah's Message-will have\\n\\t\\t\\t\\tthe first place in the Kingdom of Heaven. Verses 8, 9 and\\n\\t\\t\\t\\t10 mention the three main categories or classifications\\n\\t\\t\\t\\tafter Judgment. In the subsequent verses their happiness\\n\\t\\t\\t\\tor misery are described. This category, Foremost in\\n\\t\\t\\t\\tFaith, is nearest to Allah."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "11",
    "NoteID": "5227",
    "Body": "See n. 5223 above. Nearness to Allah is the test of the\\n\\t\\t\\t\\thighest Bliss."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "13",
    "NoteID": "5228",
    "Body": "Of great Prophets and Teachers there were many before the\\n\\t\\t\\t\\ttime of the holy Prophet Muhammad. As he was the last of\\n\\t\\t\\t\\tthe Prophets, he and the great Teachers under his\\n\\t\\t\\t\\tDispensation will be comparatively fewer in number, but\\n\\t\\t\\t\\ttheir teaching is the sum and flower of all mankind's\\n\\t\\t\\t\\tspiritual experience."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "15",
    "NoteID": "5229",
    "Body": "Cf. xv. 47; xxxvii. 44, Iii. 20, and xxxviii. 13."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "16",
    "NoteID": "5230",
    "Body": "But they will not be separate each in his own corner.\\n\\t\\t\\t\\tThey will face each other. For they are all one, and\\n\\t\\t\\t\\ttheir mutual society will be part of their Bliss."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "17",
    "NoteID": "5231",
    "Body": "Cf. lii. 24, and n. 5058. The youth and freshness with\\n\\t\\t\\t\\twhich the attendants will serve is a symbol of true\\n\\t\\t\\t\\tservice such as we may expect in the next world. That\\n\\t\\t\\t\\tfreshness will be perpetual, and not subject to any\\n\\t\\t\\t\\tmoods, or chances, or changes."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "19",
    "NoteID": "5232",
    "Body": "The Feast of Reason and the Flow of Soul are typified by\\n\\t\\t\\t\\tall that is best in the feasts in this imperfect world,\\n\\t\\t\\t\\tbut there will be none of the disadvantages incident to\\n\\t\\t\\t\\tsuch feasts in this world, such as satiety, aches,\\n\\t\\t\\t\\texcess, a sense of exhaustion, or loss of senses, etc.\\n\\t\\t\\t\\tCf. xxxvii. 47, and n. 4063. A goblet is a bowl without\\n\\t\\t\\t\\thandles; a beaker has a \"lip\" and a stem; \"cup\" is a\\n\\t\\t\\t\\tgeneral term."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "22",
    "NoteID": "5233",
    "Body": "Cf. xliv. 54, and n. 4729. The companionship of Beauty\\n\\t\\t\\t\\tand Grace is one of the highest pleasures of life. In\\n\\t\\t\\t\\tthis bodily life it takes bodily form. In the higher life\\n\\t\\t\\t\\tit takes a higher form."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "23",
    "NoteID": "5234",
    "Body": "Cf. lii. 24, where this description is applied to the\\n\\t\\t\\t\\tyouths who serve. See also n. 5058 there. In lvi. 78\\n\\t\\t\\t\\tbelow the adjective maknun is applied to the Qur-an, \"the\\n\\t\\t\\t\\twell guarded Book\"."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "25",
    "NoteID": "5235",
    "Body": "Cf. lii. 23. Apart from physical ills worldly feasts or\\n\\t\\t\\t\\tdelights are apt to suffer from vain or frivolous\\n\\t\\t\\t\\tdiscourse, idle boasting, foolish flattery, or phrases\\n\\t\\t\\t\\tpointed with secret venom or moral mischief. The negation\\n\\t\\t\\t\\tof these from the enjoyment of the Garden."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "26",
    "NoteID": "5236",
    "Body": "Qil is best translated \"saying\", rather than \"word\". For\\n\\t\\t\\t\\tthe saying is an act, a thought, a fact, which may be\\n\\t\\t\\t\\tembodied in a word, but which goes far beyond the word.\\n\\t\\t\\t\\tThe \"Peace of Allah\" is an atmosphere which sums up\\n\\t\\t\\t\\tHeaven even better than \"Bliss\"."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "28",
    "NoteID": "5237",
    "Body": "Lote-trees: see xxxiv. 16 n. 3814."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "29",
    "NoteID": "5238",
    "Body": "Talh: some understand by this the plantain or banana\\n\\t\\t\\t\\ttree, of which the fruit is borne in bunches, one tier\\n\\t\\t\\t\\tabove another; but the banana tree does not grow in\\n\\t\\t\\t\\tArabia and its ordinary Arabic name is Mauz; perhaps it\\n\\t\\t\\t\\tis better to understand a special kind of Acacia tree,\\n\\t\\t\\t\\twhich flowers profusely, the flowers appearing in tiers\\n\\t\\t\\t\\tone above another."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "33",
    "NoteID": "5239",
    "Body": "As it is not like earthly fruit, its season is not\\n\\t\\t\\t\\tlimited, nor is there any prohibition by law or custom or\\n\\t\\t\\t\\tcircumstance as to when or how it is to be consumed."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "35",
    "NoteID": "5240",
    "Body": "The pronoun in Arabic is in the feminine gender. It is\\n\\t\\t\\t\\tmade clear that these maidens for heavenly society will\\n\\t\\t\\t\\tbe of special creation,-of virginal purity, grace, and\\n\\t\\t\\t\\tbeauty, inspiring and inspired by love, with the question\\n\\t\\t\\t\\tof time and age eliminated,"
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "39",
    "NoteID": "5241",
    "Body": "This class-the righteous-will be a large company in\\n\\t\\t\\t\\tHeaven, belonging to all the ages of the world. Cf. n.\\n\\t\\t\\t\\t5228 to lvi. 13 above. Such is the unbounded Bounty of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "42",
    "NoteID": "5242",
    "Body": "Notice the parallelism in the contrast between those in\\n\\t\\t\\t\\tBliss and those in Misery. The description in each case\\n\\t\\t\\t\\tpursues the idea of contrast. The fierce Blast of Fire\\n\\t\\t\\t\\tand the Boiling Water are in contrast to the happy\\n\\t\\t\\t\\tLote-tree and the flowers and fruits in verses 28-29\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "43",
    "NoteID": "5243",
    "Body": "Even the Shades get a different quality in the Abode of\\n\\t\\t\\t\\tMisery: shades of black smoke in contrast to the cool and\\n\\t\\t\\t\\trefreshing long extended shades of trees by brooks in\\n\\t\\t\\t\\tverses 30-31 above."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "45",
    "NoteID": "5244",
    "Body": "Cf. xxxiv. 34, and xliii. 23. We must read verses 45-46\\n\\t\\t\\t\\ttogether. They had wealth and the good things of life,\\n\\t\\t\\t\\tbut they used them in self-indulgence and shameless\\n\\t\\t\\t\\tcrime, and now they are in humiliation. A) Wickedness\\n\\t\\t\\t\\tsupreme: i.e. their associating others with Allah in His\\n\\t\\t\\t\\tdivinity."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "47",
    "NoteID": "5245",
    "Body": "Their want of belief and ridicule of Allah's Message\\n\\t\\t\\t\\tcontrasts with the stern reality which they see around\\n\\t\\t\\t\\tthem now."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "50",
    "NoteID": "5246",
    "Body": "In xxvi, 38 (see n. 3159) the phrase \"a day well-known\"\\n\\t\\t\\t\\tis used for a solemn day of festival, when the multitude\\n\\t\\t\\t\\tof people gather together. The Day of Judgment is such a\\n\\t\\t\\t\\tday in the supreme sense of the word."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "52",
    "NoteID": "5247",
    "Body": "This is the Cursed Tree mentioned in xvii, 60, where see\\n\\t\\t\\t\\tn. 2250. Cf. also xxxvii. 62, n. 4072; and xliv. 43-46\\n\\t\\t\\t\\tand n. 4722."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "55",
    "NoteID": "5248",
    "Body": "A terrible picture of Misery in contrast to the\\n\\t\\t\\t\\tCompanionship of the Good, the True, and the Beautiful,\\n\\t\\t\\t\\ton raised couches, for the Companions of the Right Hand,\\n\\t\\t\\t\\tin verses 34-38 above."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "57",
    "NoteID": "5249",
    "Body": "Man is apt to forget his Creator, and even the fact that\\n\\t\\t\\t\\the, man, is a created being. The seed of his body, out of\\n\\t\\t\\t\\twhich his physical life starts, is not created by man,\\n\\t\\t\\t\\tbut by Allah in the process of the unfoldment of the\\n\\t\\t\\t\\tworld. Why will not man recognise and bear witness of\\n\\t\\t\\t\\tthis fact by a life of obedience to Allah's Law?"
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "60",
    "NoteID": "5250",
    "Body": "Just as Allah has created this life that we see, so He\\n\\t\\t\\t\\thas decreed that Death should be the common lot of all of\\n\\t\\t\\t\\tus. Surely, if He can thus give life and death, as we see\\n\\t\\t\\t\\tit, why should we refuse to believe that He can give us\\n\\t\\t\\t\\tother forms when this life is over? The Future Life,\\n\\t\\t\\t\\tthough indicated by what we know now, is to be on a\\n\\t\\t\\t\\twholly different plane."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "63",
    "NoteID": "5251",
    "Body": "Having appealed to our own nature within us, He appeals\\n\\t\\t\\t\\tnow to the external nature around us, which should be\\n\\t\\t\\t\\tevidence to us (1) of His loving care for us, and (2) of\\n\\t\\t\\t\\tits being due to causes other than those which we produce\\n\\t\\t\\t\\tand control. Three examples are given : (1) the seed\\n\\t\\t\\t\\twhich we sow in the soil; it is Allah's processes in\\n\\t\\t\\t\\tnature, which make it grow; (2) the water which we drink;\\n\\t\\t\\t\\tit is Allah's processes in nature, that send it down from\\n\\t\\t\\t\\tthe clouds as rain, and distribute it through springs and\\n\\t\\t\\t\\trivers: (3) the fire which we strike; it is again a proof\\n\\t\\t\\t\\tof Allah's Plan and Wisdom in nature."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "66",
    "NoteID": "5252",
    "Body": "The cultivator contracts debts for seed and gives labour\\n\\t\\t\\t\\tfor ploughing, sowing, watering, and weeding, in the hope\\n\\t\\t\\t\\tof reaping a harvest. Should he not give thanks to Allah\\n\\t\\t\\t\\twhen his harvest is in?"
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "70",
    "NoteID": "5253",
    "Body": "The wonder of the two streams of water, one sweet and the\\n\\t\\t\\t\\tother salt, constantly mingling, and yet always separate,\\n\\t\\t\\t\\tis referred to more than once. The never-ending circuit\\n\\t\\t\\t\\tis established by streams and rivers mingling with the\\n\\t\\t\\t\\tocean, the ocean sending forth mists and steam through a\\n\\t\\t\\t\\tprocess of evaporation which forms clouds, and the clouds\\n\\t\\t\\t\\tby condensation pouring forth rain to feed the streams\\n\\t\\t\\t\\tand rivers again: see notes 3111-2 to xxv. 53, and n.\\n\\t\\t\\t\\t5185 to lv. 19, and the further references given there."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "72",
    "NoteID": "5254",
    "Body": "The relation of Fire to Trees is intimate. In nearly all\\n\\t\\t\\t\\tthe fire that we burn, the fuel is derived from the wood\\n\\t\\t\\t\\tof trees. Even mineral coal is nothing but the wood of\\n\\t\\t\\t\\tprehistoric forests petrified under the earth through\\n\\t\\t\\t\\tgeological ages. Fire produced out of green trees is\\n\\t\\t\\t\\treferred to in xxxvi. 80; and n. 4026 there gives\\n\\t\\t\\t\\tinstances."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "73",
    "NoteID": "5255",
    "Body": "That is, the ordinary fire in this world is a reminder of\\n\\t\\t\\t\\tthe Great Fire of the next world to all those who heed\\n\\t\\t\\t\\tand reflect."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "73",
    "NoteID": "5256",
    "Body": "A fire in a desert is a sign of human habitation; by\\n\\t\\t\\t\\tfollowing it you may get human society and human comfort.\\n\\t\\t\\t\\tA fire, or light, or beacon in many places directs a\\n\\t\\t\\t\\ttraveller or the way. Lighthouses at sea and becons in\\n\\t\\t\\t\\tmodem aerodromes serve the same purpose for mariners and\\n\\t\\t\\t\\tairmen. Another parable about fire will be found in ii.\\n\\t\\t\\t\\t17-18, and n. 38."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "74",
    "NoteID": "5257",
    "Body": "Seeing all these Signs in nature man must turn to Allah\\n\\t\\t\\t\\tand do His Will."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "75",
    "NoteID": "5258",
    "Body": "Cf. liii. 1."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "76",
    "NoteID": "5259",
    "Body": "The glory of the firmament as it exists, and the wonder\\n\\t\\t\\t\\tof its passing away, are both evidence, to the discerning\\n\\t\\t\\t\\tmind, of the Future which Allah has prepared, but this\\n\\t\\t\\t\\tevidence can only be effective if men but knew, ie.,\\n\\t\\t\\t\\tturned their earnest attention to it."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "77",
    "NoteID": "5260",
    "Body": "Your attention is drawn to the momentous issues of the\\n\\t\\t\\t\\tFuture by the Qur-an. It is a Revelation described by\\n\\t\\t\\t\\tfour characteristics. (1) It is most honourable, karim,\\n\\t\\t\\t\\twhich implies, besides the fact that it is worthy of\\n\\t\\t\\t\\treceiving honour, that it confers great favours on those\\n\\t\\t\\t\\twho receive it. (2) It is well-guarded, maknun; precious\\n\\t\\t\\t\\tin itself, and well- preserved in its purity; see n. 5234\\n\\t\\t\\t\\tto lvi. 23; see also xv. 9, and n. 1944. (3) None but the\\n\\t\\t\\t\\tclean shall touch it,-dean in body, mind, thought,\\n\\t\\t\\t\\tintention, and soul; only such can achieve real contact\\n\\t\\t\\t\\twith its full meaning. (4) It is a Revelation from the\\n\\t\\t\\t\\tLord of the Worlds, and therefore universal for all."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "81",
    "NoteID": "5261",
    "Body": "The Message being such as is described in the last note,\\n\\t\\t\\t\\thow can any one ignore it or treat it with contempt or\\n\\t\\t\\t\\trefuse to allow it to improve his life?"
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "82",
    "NoteID": "5262",
    "Body": "The worst indictment of an enemy of Revelation would be\\n\\t\\t\\t\\tthat he should make Falsehood a source of filthy lucre\\n\\t\\t\\t\\tfor himself, or that he should let his precious life be\\n\\t\\t\\t\\tcorrupted by such unholy occupation."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "83",
    "NoteID": "5263",
    "Body": "There is a hiatus after \"why do ye not?\"-and two\\n\\t\\t\\t\\tparenthetical clauses,-after which the clause \"why do ye\\n\\t\\t\\t\\tnot?\" is resumed again in verse 86 below, with its\\n\\t\\t\\t\\tcomplement in verse 87. It is permissible to the\\n\\t\\t\\t\\ttranslator to add some such word as \"intervene\" here, to\\n\\t\\t\\t\\tmake the translation run smoothly."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "84",
    "NoteID": "5264",
    "Body": "The dying man's friends, relatives, and companions may be\\n\\t\\t\\t\\tsitting round him and quite close to him in his last\\n\\t\\t\\t\\tmoments, but Allah is nearer still at all times for He is\\n\\t\\t\\t\\tnearer than the man's own jugular vein (I. 16), and one\\n\\t\\t\\t\\tof Allah's own titles is \"Ever Near\" (xxxiv. 50)."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "86",
    "NoteID": "5265",
    "Body": "These words resume the sentence begun at verse 83 above\\n\\t\\t\\t\\tand interrupted by the two parenthetical clauses in\\n\\t\\t\\t\\tverses 84 and 85. See n. 5263 above."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "87",
    "NoteID": "5266",
    "Body": "The sentence may now be briefly paraphrased. 'If you\\n\\t\\t\\t\\tdisbelieve in Revelation and a future Judgment, and claim\\n\\t\\t\\t\\tto do what you like and be independent of Allah, how is\\n\\t\\t\\t\\tit you cannot call back a dying man's soul to his body\\n\\t\\t\\t\\twhen all of you congregate round him at his death-bed?\\n\\t\\t\\t\\tBut you are not independent of Judgment. There is a Day\\n\\t\\t\\t\\tof Account, when you will have to be judged by your deeds\\n\\t\\t\\t\\tin this life.'"
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "88",
    "NoteID": "5267",
    "Body": "See above. lvi. 11-26 and notes."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "89",
    "NoteID": "5268",
    "Body": "Raihan: sweet-smelling plants, as in Iv. 12. Here used as\\n\\t\\t\\t\\tan indication of Satisfaction and Delight."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "90",
    "NoteID": "5269",
    "Body": "See above, lvi. 27-38 and notes."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "91",
    "NoteID": "5270",
    "Body": "In lvi. 26 above the salutation of \"Peace, Peace!\" is\\n\\t\\t\\t\\taddressed to those Nearest to Allah. Here we learn that\\n\\t\\t\\t\\tit is also addressed to the Companions of the Right Hand.\\n\\t\\t\\t\\tBoth are in Gardens of Bliss; only the former have a\\n\\t\\t\\t\\thigher Dignity than the latter."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "92",
    "NoteID": "5271",
    "Body": "Cf. above, lvi. 51-55."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "95",
    "NoteID": "5272",
    "Body": "\"The assurance of the Hereafter\" is one of the strongest\\n\\t\\t\\t\\tfeatures of Faith. For without it the apparent\\n\\t\\t\\t\\tinequalities and injustices of this Life cannot be\\n\\t\\t\\t\\tsatisfactorily explained."
  },
  {
    "SurahNumber": "56",
    "AyahNumber": "96",
    "NoteID": "5273",
    "Body": "Cf. lvi. 74 above. That was the conclusion of the\\n\\t\\t\\t\\targument about the Future from the examples of Allah's\\n\\t\\t\\t\\tgoodness in nature. Now we have the conclusion of the\\n\\t\\t\\t\\tsame argument from Allah's revelation through His\\n\\t\\t\\t\\tinspired Messengers."
  }
]
