[
  {
    "SurahNumber": "68",
    "AyahNumber": "1",
    "NoteID": "5592",
    "Body": "Nun is an Abbreviated Letter: see Appendix I at the end\\n\\t\\t\\t\\tof S. ii. Nun may mean a fish, or an ink-holder, or it\\n\\t\\t\\t\\tmay be just the Arabic letter of the alphabet, N. In the\\n\\t\\t\\t\\tlast case, it may refer to either or both of the other\\n\\t\\t\\t\\tmeanings. Note also that the Arabic rhyme in this Sura\\n\\t\\t\\t\\tends in N. The reference to ink would be an appropriate\\n\\t\\t\\t\\tlink with the Pen in verse 1. The reference to the fish\\n\\t\\t\\t\\twould be appropriate with reference to the story of Jonah\\n\\t\\t\\t\\tin verses 48-50. Jonah's title is \"the Companion of the\\n\\t\\t\\t\\tFish\", (Zun-Nun, xxi. 87), as he was, in the story,\\n\\t\\t\\t\\tswallowed by the Fish."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "1",
    "NoteID": "5593",
    "Body": "The Pen and the Record are the symbolical foundations of\\n\\t\\t\\t\\tthe Revelation to man. The adjuration by the Pen disposes\\n\\t\\t\\t\\tof the flippant charge that Allah's Messenger was mad or\\n\\t\\t\\t\\tpossessed. For he spoke words of power, not incoherent,\\n\\t\\t\\t\\tbut full of meaning, and through the Record of the Pen,\\n\\t\\t\\t\\tthat meaning unfolds itself, in innumerable aspects to\\n\\t\\t\\t\\tcountless generations. Muhammad was the living Grace and\\n\\t\\t\\t\\tMercy of Allah, and his very nature exalted him above\\n\\t\\t\\t\\tabuse and persecution."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "2",
    "NoteID": "5594",
    "Body": "People usually call any one mad whose standards are\\n\\t\\t\\t\\tdifferent from their own. And madness is believed to be\\n\\t\\t\\t\\tdue to demoniacal possession, an idea distinctly in the\\n\\t\\t\\t\\tminds of the New Testament writers: for Luke speaks of a\\n\\t\\t\\t\\tman from whom the \"devils\" were cast out, as being then\\n\\t\\t\\t\\t\"clothed, and in his right mind\" (Luke, viii. 35)."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "3",
    "NoteID": "5595",
    "Body": "Instead of being out of his right mind, the Prophet of\\n\\t\\t\\t\\tAllah had been raised to a great spiritual dignity, a\\n\\t\\t\\t\\treward that was not like an earthly reward that passes\\n\\t\\t\\t\\taway, but one that was in the very core of his being, and\\n\\t\\t\\t\\twould never fail him in any circumstances. He was really\\n\\t\\t\\t\\tgranted a nature and character far above the shafts of\\n\\t\\t\\t\\tgrief or suffering, slander or persecution."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "5",
    "NoteID": "5596",
    "Body": "Though Al-Mustafa's nature raised him above the petty\\n\\t\\t\\t\\tspite of his contemporaries, an appeal is made to their\\n\\t\\t\\t\\treason and to the logic of events. Was it not his\\n\\t\\t\\t\\taccusers that were really mad? What happened to Walid ibn\\n\\t\\t\\t\\tMugaira, or Abu Jahl, or Abu Lahab? -and to Allah's\\n\\t\\t\\t\\tMessenger and those who followed his guidance? The\\n\\t\\t\\t\\tworld's history gives the answer. And the appeal is not\\n\\t\\t\\t\\tonly to his contemporaries, but for all time."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "7",
    "NoteID": "5597",
    "Body": "Men set up false standards of judgment. The right\\n\\t\\t\\t\\tstandard is that of Allah. For His knowledge is complete\\n\\t\\t\\t\\tand all-embracing; He reads hidden motives as well as\\n\\t\\t\\t\\tthings that appear before men's sight; and He knows the\\n\\t\\t\\t\\tpast history in which the roots of present actions are\\n\\t\\t\\t\\tembedded, as well as the future consequences of present\\n\\t\\t\\t\\tactions."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "8",
    "NoteID": "5598",
    "Body": "The enemies of Allah's truth are sometimes self-deceived.\\n\\t\\t\\t\\tBut quite often they have a glimmering of the truth in\\n\\t\\t\\t\\tspite of their desire to shut their eyes. Then they\\n\\t\\t\\t\\tcompromise, and they would like the preachers of\\n\\t\\t\\t\\tinconvenient truths to compromise with them. On those\\n\\t\\t\\t\\tterms there would be mutual laudation. This easy path of\\n\\t\\t\\t\\tmaking the best of both worlds is a real danger or\\n\\t\\t\\t\\ttemptation to the best of us, and we must be on our guard\\n\\t\\t\\t\\tagainst it if we would really enter into the company of\\n\\t\\t\\t\\tthe Righteous who submit their wills to the Will of\\n\\t\\t\\t\\tAllah. Abu Jahl freely offered impossible compromises to\\n\\t\\t\\t\\tthe holy Prophet."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "10",
    "NoteID": "5599",
    "Body": "The type of each of these hateful qualities is not\\n\\t\\t\\t\\tuncommon, though the combination of all in one man makes\\n\\t\\t\\t\\thim peculiarly despicable, as was Walid ibn Mugaira, who\\n\\t\\t\\t\\twas a ringleader in calumniating our Prophet and who came\\n\\t\\t\\t\\tto an evil end not long after the battle of Badr, in\\n\\t\\t\\t\\twhich he rceived injuries."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "10",
    "NoteID": "5600",
    "Body": "It is only liars who swear on all occasions, small or\\n\\t\\t\\t\\tgreat, because their word is not believed in. The true\\n\\t\\t\\t\\tman's word, according to the proverb, is as good as his\\n\\t\\t\\t\\tbond."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "13",
    "NoteID": "5601",
    "Body": "Besides the self-deciever and the easy-going man, there\\n\\t\\t\\t\\tis a third type, even more degraded. He has no idea of\\n\\t\\t\\t\\ttruth or sincerity. He is ready to swear friendship with\\n\\t\\t\\t\\tevery one and fidelity to every cause. But at the same\\n\\t\\t\\t\\tmoment he will slander and backbite, and cause mischief\\n\\t\\t\\t\\teven between good but credulous persons. Evil seems to be\\n\\t\\t\\t\\this goal, and good his evil. He will not only pursue evil\\n\\t\\t\\t\\tcourses himself but prevent other people from doing\\n\\t\\t\\t\\tright. When checked, he resorts to violence. In any case,\\n\\t\\t\\t\\the will intrude where he has no right, claiming\\n\\t\\t\\t\\trelationship or power or consideration in circles which\\n\\t\\t\\t\\twould gladly disown him. He is vain of his wealth or\\n\\t\\t\\t\\tbecause he has a large following at his beck and call.\\n\\t\\t\\t\\tReligion is to him merely old-fashioned superstition."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "14",
    "NoteID": "5602",
    "Body": "\"Because\" may connect with \"heed not\" in verse 10, or\\n\\t\\t\\t\\twith \"violent and cruel\" in verse 13. In the former case,\\n\\t\\t\\t\\twe construe: 'Pay no attention to despicable men of the\\n\\t\\t\\t\\tcharacter described, simply because they happen to have\\n\\t\\t\\t\\twealth or influence, or much backing in man-power'. In\\n\\t\\t\\t\\tthe latter case, we construe: 'the fellow is violent and\\n\\t\\t\\t\\tcruel, he is puffed up with his wealth or riches or\\n\\t\\t\\t\\tbacking in man-power'. In the eyes of Allah such a man is\\n\\t\\t\\t\\tin any case branded and marked out as a sinner."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "15",
    "NoteID": "5603",
    "Body": "Allah's Signs, by which He calls us, are everywhere-in\\n\\t\\t\\t\\tnature and in our very heart and soul. In Revelation,\\n\\t\\t\\t\\tevery verse is a Sign, for it stands symbolically for far\\n\\t\\t\\t\\tmore than it says. \"Sign\" (Ayat) thus becomes a technical\\n\\t\\t\\t\\tterm for a verse of the Qur-an."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "15",
    "NoteID": "5604",
    "Body": "Cf. vi. 25."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "16",
    "NoteID": "5605",
    "Body": "Literally, proboscis, the most sensitive limb of the\\n\\t\\t\\t\\telephant. The sinner makes himself a beast and can only\\n\\t\\t\\t\\tbe controlled by his snout."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "17",
    "NoteID": "5606",
    "Body": "\"Why do the wicked flourish?\" is a question asked in all\\n\\t\\t\\t\\tages. The answer is not simple. It must refer to (1) the\\n\\t\\t\\t\\tchoice left to man's will, (2) his moral responsibility,\\n\\t\\t\\t\\t(3) the need of his tuning his will to Allah's Will, (4)\\n\\t\\t\\t\\tthe patience of Allah, which allows the widest possible\\n\\t\\t\\t\\tchance for the operation of (5) His Mercy, and (6) in the\\n\\t\\t\\t\\tlast resort, to the nature of the Punishment, which is\\n\\t\\t\\t\\tnot a merely abrupt or arbitrary act, but a long, gradual\\n\\t\\t\\t\\tprocess, in which there is room for repentance at every\\n\\t\\t\\t\\tstage. All these points are illustrated in the remarkable\\n\\t\\t\\t\\tParable of the People of the Garden, which also\\n\\t\\t\\t\\tillustrates the greed, selfishness, and heedlessness of\\n\\t\\t\\t\\tman, as well as his tendency to throw the blame on others\\n\\t\\t\\t\\tif he can but think of a scapegoat. All these foibles are\\n\\t\\t\\t\\tshown, but the Mercy of Allah is boundless, and even\\n\\t\\t\\t\\tafter the worst sins and punishments, there may be hope\\n\\t\\t\\t\\tof an even better orchard than the one lost, if only the\\n\\t\\t\\t\\trepentance is true, and there is complete surrender to\\n\\t\\t\\t\\tAllah's Will. But if, in spite of ail this, there is no\\n\\t\\t\\t\\tsurrender of the will, then, indeed, the punishment in\\n\\t\\t\\t\\tthe Hereafter is something incomparably greater than the\\n\\t\\t\\t\\tlittle calamities in the Parable."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "18",
    "NoteID": "5607",
    "Body": "We must always remember, in all our plans, that they\\n\\t\\t\\t\\tdepend for their success on how far they accord with\\n\\t\\t\\t\\tAllah's Will and Plan. His universal Will is supreme over\\n\\t\\t\\t\\tall affairs. These foolish men had a secret plan to\\n\\t\\t\\t\\tdefraud the poor of their just rights, but they were put\\n\\t\\t\\t\\tinto a position where they could not do so. In trying to\\n\\t\\t\\t\\tfrustrate others, they were themselves frustrated."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "19",
    "NoteID": "5608",
    "Body": "It was a terrible storm that blew down and destroyed the\\n\\t\\t\\t\\tfruits and the trees. The whole place was changed out of\\n\\t\\t\\t\\tall recognition."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "22",
    "NoteID": "5609",
    "Body": "Awaking from sleep, they were not aware that the garden\\n\\t\\t\\t\\thad been destroyed by the storm overnight. They were in\\n\\t\\t\\t\\ttheir own selfish dreams: by going very early, they\\n\\t\\t\\t\\tthought they could cheat the poor of their share. See\\n\\t\\t\\t\\tnext note."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "24",
    "NoteID": "5610",
    "Body": "The poor man has a right in the harvest-whether as a\\n\\t\\t\\t\\tgleaner or as an artisan or a menial in an Eastern\\n\\t\\t\\t\\tvillage. The rich owners of the orchard in the Parable\\n\\t\\t\\t\\twanted to steal a march at an early hour and defeat this\\n\\t\\t\\t\\tright, but their greed was punished, so that it led to a\\n\\t\\t\\t\\tgreater loss to themselves. They wanted to cheat but had\\n\\t\\t\\t\\tnot the courage to face those they cheated, and by being\\n\\t\\t\\t\\tin the field before any one was up they wanted to make it\\n\\t\\t\\t\\tappear to the world that they were unconscious of any\\n\\t\\t\\t\\trights they were trampling on."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "26",
    "NoteID": "5611",
    "Body": "Their fond dreams were dispelled when they found that the\\n\\t\\t\\t\\tgarden had been changed out of all recognition. It was as\\n\\t\\t\\t\\tif they had come to some place other than their own\\n\\t\\t\\t\\tsmiling garden. Where they had expected to reap a rich\\n\\t\\t\\t\\tharvest, there was only a howling wilderness. They\\n\\t\\t\\t\\treflected. Their first thought was of their own personal\\n\\t\\t\\t\\tloss, the loss of their labour and the loss of their\\n\\t\\t\\t\\tcapital. They had plotted to keep out others from the\\n\\t\\t\\t\\tfruits: now, as it happened, the loss was their own."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "27",
    "NoteID": "5612",
    "Body": "Cf. lvi. 67. Also see last note."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "28",
    "NoteID": "5613",
    "Body": "This was not necessarily a righteous man, but there are\\n\\t\\t\\t\\tdegrees in guilt. He had warned them, but he had joined\\n\\t\\t\\t\\tin their unjust design."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "30",
    "NoteID": "5614",
    "Body": "When greed or injustice is punished people are ready to\\n\\t\\t\\t\\tthrow the blame on others. In this case, one particular\\n\\t\\t\\t\\tindividual may have seen the moral guilt of defying the\\n\\t\\t\\t\\tWill of Allah and the right of man, but if he shared in\\n\\t\\t\\t\\tthe enterprise in the hope of profit, he could not get\\n\\t\\t\\t\\tout of all responsibility."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "32",
    "NoteID": "5615",
    "Body": "If the repentance was true, there was hope. For Allah\\n\\t\\t\\t\\toften turns a great evil to our good. If not true, they\\n\\t\\t\\t\\tonly added hypocrisy to their other sins. The Parable\\n\\t\\t\\t\\tpresupposes that the garden came into the possession of\\n\\t\\t\\t\\tselfish men, who were so puffed up with their good\\n\\t\\t\\t\\tfortune that they forgot Allah. That meant that they also\\n\\t\\t\\t\\tbecame harsh to their fellow-creatures. In their\\n\\t\\t\\t\\tarrogance they plotted to get up early and defeat the\\n\\t\\t\\t\\tclaims of the poor at harvest time. They found their\\n\\t\\t\\t\\tgarden destroyed by a storm. Some reproached others, but\\n\\t\\t\\t\\tthose who sincerely repented obtained mercy. The \"better\\n\\t\\t\\t\\tgarden\" may have been the same garden, flourishing in a\\n\\t\\t\\t\\tfuture season under Allah's gift of abundance."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "33",
    "NoteID": "5616",
    "Body": "Even in this life the punishment for heedless or selfish\\n\\t\\t\\t\\tarrogance and sin comes suddenly when we least expect it.\\n\\t\\t\\t\\tBut there is always room for Allah's Mercy if we\\n\\t\\t\\t\\tsincerely repent. If the Punishment in this life seems to\\n\\t\\t\\t\\tus so stupefying, how much worse will it be in the\\n\\t\\t\\t\\tHereafter, when the Punishment will not be only for a\\n\\t\\t\\t\\tlimited time, and the time for repentance will have\\n\\t\\t\\t\\tpassed?"
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "34",
    "NoteID": "5617",
    "Body": "The Garden is a joy, but the joy of this Garden is the\\n\\t\\t\\t\\tsense of nearness to Allah."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "35",
    "NoteID": "5618",
    "Body": "The spiritual arrogance which rejects faith in Allah is\\n\\t\\t\\t\\tperhaps the worst Sin, because it makes itself impervious\\n\\t\\t\\t\\tto the Mercy of Allah, as a bed of clay is impervious to\\n\\t\\t\\t\\tthe absorption of water. It sets up its own standards and\\n\\t\\t\\t\\tits own will, but how can it measure or bind the Will of\\n\\t\\t\\t\\tAllah? It sets up its own fetishes,-idols, priests, gods,\\n\\t\\t\\t\\tor godlings. The fetishes may be even God-given gifts or\\n\\t\\t\\t\\tfaculties. Intellect or Science, if pushed up to the\\n\\t\\t\\t\\tposition of idols. If they are made rivals to Allah,\\n\\t\\t\\t\\tquestion them: Will they solve Allah's mysteries, or even\\n\\t\\t\\t\\tthe mysteries of Life and Soul?"
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "38",
    "NoteID": "5619",
    "Body": "It is clearly against both logic and justice that men of\\n\\t\\t\\t\\trighteousness should have the same End as men of sin.\\n\\t\\t\\t\\tEven in this life, man cannot command whatever he chooses\\n\\t\\t\\t\\tthough he is allowed a limited freedom of choice. How can\\n\\t\\t\\t\\the expect such a thing under a reign of perfect Justice\\n\\t\\t\\t\\tand Truth?"
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "39",
    "NoteID": "5620",
    "Body": "Nor can the Pagans plead that they have any special\\n\\t\\t\\t\\tCovenants with Allah which give them a favoured position\\n\\t\\t\\t\\tabove other mortals. The 'Chosen Race' idea of the Jews\\n\\t\\t\\t\\tis also condemned. It is quite true that a certain race\\n\\t\\t\\t\\tor group, on accountt of special aptitude may be chosen\\n\\t\\t\\t\\tby Allah to uphold His truth and preach it. But this is\\n\\t\\t\\t\\tconditional on their following Allah's Law. As soon as\\n\\t\\t\\t\\tthey become arrogant and selfish, they lose that\\n\\t\\t\\t\\tposition. They cannot have a perpetual and unconditional\\n\\t\\t\\t\\tlease till the Day of Judgment."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "41",
    "NoteID": "5621",
    "Body": "\"Partners\" in Godhead. as in the doctrine of the Trinity,\\n\\t\\t\\t\\tor indeed in any form of polytheism. Such a doctrine\\n\\t\\t\\t\\tdestroys the cardinal doctrine of the Unity of Allah."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "42",
    "NoteID": "5622",
    "Body": "\"The Day that the Shin shall be laid bair\", that is, when\\n\\t\\t\\t\\tmen are confronted with the stark reality of the Day of\\n\\t\\t\\t\\tJudgment. On that occasion men will be summoned to\\n\\t\\t\\t\\tadoration, not necessarily in words, but by the logic of\\n\\t\\t\\t\\tfacts, when the Reality will be fully manifest: the Glory\\n\\t\\t\\t\\twill be too dazzling for the Unbelievers, whose past\\n\\t\\t\\t\\tdeliberate refusal, when they had freedom to choose and\\n\\t\\t\\t\\tyet rejected, will stand in way."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "43",
    "NoteID": "5623",
    "Body": "Their past memories, combined with their present\\n\\t\\t\\t\\tposition, will then fill them with a sense of the deepest\\n\\t\\t\\t\\tdismay and humiliation. See last note."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "43",
    "NoteID": "5624",
    "Body": "Salimun: whole, in full possession of the power of\\n\\t\\t\\t\\tjudgment and will; not constrained, as they now will be,\\n\\t\\t\\t\\tby the Punishment staring them full in the face."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "44",
    "NoteID": "5625",
    "Body": "Notice, the transition between \"Me\" and \"We\" in this\\n\\t\\t\\t\\tverse, and again to \"I\" and \"My\" in the next verse. The\\n\\t\\t\\t\\tfirst person plural ordinarily used in the holy Qur-an as\\n\\t\\t\\t\\tAllah's Word, is the plural of respect. In Royal decrees\\n\\t\\t\\t\\tthe first person plural is always used. When the first\\n\\t\\t\\t\\tperson singular is used, it marks some special personal\\n\\t\\t\\t\\trelation, either of Mercy or favours (as in ii. 38 or ii.\\n\\t\\t\\t\\t150) or of punishment, as here. (Cf. n. 56. to ii. 38)."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "44",
    "NoteID": "5626",
    "Body": "Cf. vii. 182. and n. 1154-A. We must not be impatient if\\n\\t\\t\\t\\twe see the wicked flourish. It may be that the very\\n\\t\\t\\t\\tappearance of flourishing here may be a part of the\\n\\t\\t\\t\\tPunishment. There may be an eventual punishment by a sort\\n\\t\\t\\t\\tof Cataclysm; but evolutionary punishment is gradual and\\n\\t\\t\\t\\tsure. Allah may punish wicked people by granting them\\n\\t\\t\\t\\trespite and providing them worldly benefits in abundance,\\n\\t\\t\\t\\twhich encourages them in sin and transgression. So when\\n\\t\\t\\t\\tthey are finally seized by the Wrath of Allah they are\\n\\t\\t\\t\\tcaught suddenly and utterly unprepared, as it were, red\\n\\t\\t\\t\\thanded while engrossed in disbelief, a life of impiety\\n\\t\\t\\t\\tand open revolt against their Lord!"
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "46",
    "NoteID": "5627",
    "Body": "Cf. lii. 40, n. 5074. It costs the Unbelievers nothing to\\n\\t\\t\\t\\thear the Prophet, for the Prophet asks for no reward, and\\n\\t\\t\\t\\tindeed suffers for their benefit. Al-Mustafa is addressed\\n\\t\\t\\t\\tin the first instance, but there is always a universal\\n\\t\\t\\t\\tinterpretation. The righteous man asks for no reward for\\n\\t\\t\\t\\this preaching or example: if he did, the value would be\\n\\t\\t\\t\\ttoo great for the world to pay for. The Unbelievers\\n\\t\\t\\t\\tbehave as if they had the secret of the Unseen, but they\\n\\t\\t\\t\\tare empty triflers, for, if they only tried to formulate\\n\\t\\t\\t\\tspiritual laws, they would fail."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "47",
    "NoteID": "5628",
    "Body": "Cf. lii. 41, n. 5075. The Unseen is certainly not within\\n\\t\\t\\t\\ttheir knowledge or control. If it were, they could\\n\\t\\t\\t\\tclearly write it down for their own guidance or the\\n\\t\\t\\t\\tguidance of others. They should listen to the words of\\n\\t\\t\\t\\tinspiration, sent by the Knower of all things."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "48",
    "NoteID": "5629",
    "Body": "This was Zun-Nun, or Jonah, for whom see n. 2744 to xxi.\\n\\t\\t\\t\\t87-88. Cf. also xxxvii. 139-148 and the notes there.\\n\\t\\t\\t\\tJonah was asked to preach to the people of Nineveh, a\\n\\t\\t\\t\\twicked city. He met with hostility and persecution, fled\\n\\t\\t\\t\\tfrom his enemies, and took a boat. He was caught in a\\n\\t\\t\\t\\tstorm and thrown into the sea. He was swallowed by a fish\\n\\t\\t\\t\\tor whale, but he repented in his living prison, and was\\n\\t\\t\\t\\tforgiven. But the people of Nineveh were also forgiven,\\n\\t\\t\\t\\tfor they, too, repented. Here is a double allegory of\\n\\t\\t\\t\\tAllah's mercy and forgiveness, and a command to patience,\\n\\t\\t\\t\\tand complete and joyful submission to the Will of Allah."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "49",
    "NoteID": "5630",
    "Body": "Cf. xxxvii. 145-146, and n. 4126."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "50",
    "NoteID": "5631",
    "Body": "Jonah was chosen by Allah's Grace and Mercy to be Allah's\\n\\t\\t\\t\\tProphet to Nineveh. If in his human frailty he lost a\\n\\t\\t\\t\\tlittle patience, he suffered his punishment, but his true\\n\\t\\t\\t\\tand sincere repentance and recognition of Allah's\\n\\t\\t\\t\\tgoodness and mercy restored him from his physical. and\\n\\t\\t\\t\\tmental distress, and from the obscuration of the\\n\\t\\t\\t\\tspiritual Light in him."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "50",
    "NoteID": "5632",
    "Body": "Cf. iv. 69, n. 586. In the beautiful Company of the\\n\\t\\t\\t\\tRighteous there is room for all, of every grade of\\n\\t\\t\\t\\tspiritual advancement, from the highest to the most\\n\\t\\t\\t\\tordinary. But as in democratic politics every citizen's\\n\\t\\t\\t\\trights and status have complete recognition, so, in this\\n\\t\\t\\t\\tCompany, the badge of Righteousness is the bond, even\\n\\t\\t\\t\\tthough there may be higher degrees of knowledge or\\n\\t\\t\\t\\texperience."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "51",
    "NoteID": "5633",
    "Body": "Thee eyes of evil men look at a good man as if they would\\n\\t\\t\\t\\t\"eat him up\", or trip him up, or disturb him from his\\n\\t\\t\\t\\tposition of stability or firmness. They use all sorts of\\n\\t\\t\\t\\tterms of abuse-\"madman\" or \"one possessed by an evil\\n\\t\\t\\t\\tspirit\", and so on. Cf. lxviii. 2 above, and n. 5594. But\\n\\t\\t\\t\\tthe good man is unmoved, and takes his even course. The\\n\\t\\t\\t\\tMessage of Allah is true and will endure; and it is a\\n\\t\\t\\t\\tMessage to all Creation."
  },
  {
    "SurahNumber": "68",
    "AyahNumber": "52",
    "NoteID": "5634",
    "Body": "This is the extreme antithesis to madness or demoniacal\\n\\t\\t\\t\\tpossession. So far from the holy Prophet uttering words\\n\\t\\t\\t\\tdisjointed or likely to harm people, he was bringing the\\n\\t\\t\\t\\tMessage of true Reality, which was to be the cure of all\\n\\t\\t\\t\\tevil, in every kind of world. For the different kinds of\\n\\t\\t\\t\\tworlds see n. 20 to i. 2."
  }
]
