[
  {
    "SurahNumber": "90",
    "AyahNumber": "1",
    "NoteID": "6130",
    "Body": "The appeal to the close ties between the holy Prophet and\\n\\t\\t\\t\\this parent City of Makkah has been explained in the\\n\\t\\t\\t\\tIntroduction to this Sura. It is a symbol of man's own\\n\\t\\t\\t\\thistory. Man is born for toil and struggle, and this is\\n\\t\\t\\t\\tthe substantive proposition in verse 4 below, which this\\n\\t\\t\\t\\tappeal leads up to."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "2",
    "NoteID": "6131",
    "Body": "Hillun: an inhabitant, a man with lawful rights, a man\\n\\t\\t\\t\\tfreed from such obligations as would attach to a stranger\\n\\t\\t\\t\\tto the city, a freeman in a wider sense than the\\n\\t\\t\\t\\ttechnical sense to which the word is restricted in modern\\n\\t\\t\\t\\tusage. The Prophet should have been honoured in his\\n\\t\\t\\t\\tnative city. He was actually being persecuted. He should\\n\\t\\t\\t\\thave been loved, as a parent loves a child. Actually his\\n\\t\\t\\t\\tlife was being sought, and those who believed in him were\\n\\t\\t\\t\\tunder a ban. But time was to show that he was to come\\n\\t\\t\\t\\ttriumphant to his native city after having made Madinah\\n\\t\\t\\t\\tsacred by his life and work."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "3",
    "NoteID": "6132",
    "Body": "A parent loves a child: ordinarily the father is proud\\n\\t\\t\\t\\tand the mother, in spite of her birth-pains, experiences\\n\\t\\t\\t\\tsupreme joy when the child is born. But in abnormal\\n\\t\\t\\t\\tcircumstances there may be misunderstanding, even hatred\\n\\t\\t\\t\\tbetween parent and child. So Makkah cast out her most\\n\\t\\t\\t\\tglorious son, but it was only for a time. Makkah was\\n\\t\\t\\t\\tsound at heart; only her power had been usurped by an\\n\\t\\t\\t\\tignorant autocracy which passed away, and Makkah was to\\n\\t\\t\\t\\treceive back her glory at the hands of the son whom she\\n\\t\\t\\t\\thad rejected but whom she welcomed back later. And Makkah\\n\\t\\t\\t\\tretains for all time her sacred character as the centre\\n\\t\\t\\t\\tof Islam."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "4",
    "NoteID": "6133",
    "Body": "Cf. \"Man is born unto troubles as the sparks fly upward\"\\n\\t\\t\\t\\t(Job, v. 7); \"For all his days are sorrows, and his\\n\\t\\t\\t\\ttravail grief\" (Ecclesiastes, ii. 23). Man's life is full\\n\\t\\t\\t\\tof sorrow and vexation; but our text has a different\\n\\t\\t\\t\\tshade of meaning: man is born to strive and struggle; and\\n\\t\\t\\t\\tif he suffers from hardships, he must exercise patience,\\n\\t\\t\\t\\tfor Allah will make his way smooth for him (lxv. 7; xciv.\\n\\t\\t\\t\\t5-6). On the other hand no man should boast of worldly\\n\\t\\t\\t\\tgoods or worldly prosperity (see verses 5-7 below)."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "5",
    "NoteID": "6134",
    "Body": "See the end of last note. If a man has wealth, influence,\\n\\t\\t\\t\\tor power, he should not behave as if it is to last for\\n\\t\\t\\t\\tever, or as if he has no responsibility for his acts and\\n\\t\\t\\t\\tcan do what he likes. All his gifts and advantages are\\n\\t\\t\\t\\tgiven to him for trial. Allah, Who bestowed them on him,\\n\\t\\t\\t\\tcan take them away, and will do so if man fails in his\\n\\t\\t\\t\\ttrial."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "6",
    "NoteID": "6135",
    "Body": "The man who feels no responsibility and thinks that he\\n\\t\\t\\t\\tcan do what he likes in life forgets his responsibility\\n\\t\\t\\t\\tto Allah. He boasts of his wealth and scatters it about,\\n\\t\\t\\t\\tthinking that he can thus purchase the support of the\\n\\t\\t\\t\\tworld. For a time he may. But a rude awakening must come\\n\\t\\t\\t\\tsoon, for he bases his hopes on unsubstantial things. Or\\n\\t\\t\\t\\tif he spends his substance on self-indulgence, he is\\n\\t\\t\\t\\tweakening himself and putting himself into snares that\\n\\t\\t\\t\\tmust destroy him."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "7",
    "NoteID": "6136",
    "Body": "Allah watches him, and sees all his acts and motives, and\\n\\t\\t\\t\\tall the secret springs of his follies. But lest he should\\n\\t\\t\\t\\tthink the higher forces too remote for him, let him look\\n\\t\\t\\t\\twithin himself and use the faculties which Allah has\\n\\t\\t\\t\\tgiven him. See the next verses following."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "9",
    "NoteID": "6137",
    "Body": "The eyes give us the faculty of seeing, and may be taken\\n\\t\\t\\t\\tin both the literal and the metaphorical sense. In the\\n\\t\\t\\t\\tsame way the tongue gives us the faculty of tasting in\\n\\t\\t\\t\\tboth senses. Along with the lips, it also enables us to\\n\\t\\t\\t\\tspeak, to ask for information and seek guidance, and to\\n\\t\\t\\t\\tcelebrate the praises of Allah."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "10",
    "NoteID": "6138",
    "Body": "The two highways of life are: (1) the steep and difficult\\n\\t\\t\\t\\tpath of virtue, which is further described in the verses\\n\\t\\t\\t\\tfollowing, and (2) the easy path of vice, and the\\n\\t\\t\\t\\trejection of Allah, referred to in verses 19-20 below.\\n\\t\\t\\t\\tAllah has given us not only the faculties implied in the\\n\\t\\t\\t\\teyes, the tongue, and the lips, but has also given us the\\n\\t\\t\\t\\tjudgment by which we can choose our way; and He has sent\\n\\t\\t\\t\\tus Teachers and Guides, with Revelation, to show us the\\n\\t\\t\\t\\tright and difficult way."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "11",
    "NoteID": "6139",
    "Body": "In spite of the faculties with which Allah has endowed\\n\\t\\t\\t\\tman and the guidance which He has given him, man has been\\n\\t\\t\\t\\tremiss. By no means has he been eager to follow the steep\\n\\t\\t\\t\\tand difficult path which is for his own spiritual good.\\n\\t\\t\\t\\tCf. Matt. vii. 14: \"Strait is the gate, and narrow is the\\n\\t\\t\\t\\tway, which leadeth unto live, and few there be that find\\n\\t\\t\\t\\tit\"."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "13",
    "NoteID": "6140",
    "Body": "The difficult path of virtue is defined as the path of\\n\\t\\t\\t\\tcharity or unselfish love, and three specific instances\\n\\t\\t\\t\\tare given for our understanding: viz. (1) freeing the\\n\\t\\t\\t\\tbondman, (2) feeding the orphan, and (3) feeding the\\n\\t\\t\\t\\tindigent down in the dust."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "14",
    "NoteID": "6141",
    "Body": "Feed those who need it, both literally and figuratively;\\n\\t\\t\\t\\tbut do so especially when there is privation or famine."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "15",
    "NoteID": "6142",
    "Body": "All orphans should be fed and helped. But ordinary\\n\\t\\t\\t\\torphans will come under the indigent in verse 16 below.\\n\\t\\t\\t\\tThe orphans related to us have a special claim on us.\\n\\t\\t\\t\\tThey should be near and dear to us, and if charity begins\\n\\t\\t\\t\\tat home, they have the first claim on us."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "16",
    "NoteID": "6143",
    "Body": "Persons down in the dust can only be helped from motives\\n\\t\\t\\t\\tof pure charity, because nothing can be expected of\\n\\t\\t\\t\\tthem-neither praise nor advertisement nor any other\\n\\t\\t\\t\\tadvantage to the helper. Such help is help indeed. But\\n\\t\\t\\t\\tthere may be various degrees, and the help will be suited\\n\\t\\t\\t\\tto the needs."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "17",
    "NoteID": "6144",
    "Body": "Such practical charity and love will be the acid test of\\n\\t\\t\\t\\tFaith and the teaching of all virtues. The virtues are\\n\\t\\t\\t\\tsummed up under the names of Patience (the Arabic word\\n\\t\\t\\t\\tincludes constancy and self-restraint) and compassionate\\n\\t\\t\\t\\tkindness. Not only will they be the test by which the\\n\\t\\t\\t\\tsincerity of their Faith will be judged; they will be the\\n\\t\\t\\t\\tfruit which their Faith will constantly produce."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "18",
    "NoteID": "6145",
    "Body": "Cf. lvi. 27-40, also n. 5223. They will be those who\\n\\t\\t\\t\\tachieve salvation."
  },
  {
    "SurahNumber": "90",
    "AyahNumber": "19",
    "NoteID": "6146",
    "Body": "Cf. lvi. 41-56, also n. 5223. They will be the\\n\\t\\t\\t\\tunfortunate ones enveloped in the Fire of lasting\\n\\t\\t\\t\\tPenalty, heaped over them and all round them."
  }
]
