[
  {
    "SurahNumber": "8",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "The term nafl (of which anfal is the plural) denotes, in\\n\\t\\t\\t\\tits purely linguistic sense, \"an accretion or addition\\n\\t\\t\\t\\treceived beyond one's due\" or \"something given in excess\\n\\t\\t\\t\\tof one's obligation\" (from which latter meaning the term\\n\\t\\t\\t\\tsalat an-nafl - i.e., a \"supererogatory prayer\" - is\\n\\t\\t\\t\\tderived). In its plural form anfal, which occurs in the\\n\\t\\t\\t\\tQur'an only in the above verse, this word signifies\\n\\t\\t\\t\\t\"spoils of war\", inasmuch as such spoils are an\\n\\t\\t\\t\\tincidental accession above and beyond anything that a\\n\\t\\t\\t\\tmujahid (\"a fighter in God's cause\") is entitled to\\n\\t\\t\\t\\texpect. The statement that \"all spoils of war belong to\\n\\t\\t\\t\\tGod and the Apostle\" implies that no individual warrior\\n\\t\\t\\t\\thas a claim to any war booty: it is public property, to\\n\\t\\t\\t\\tbe utilized or distributed by the government of an\\n\\t\\t\\t\\tIslamic state in accordance with the principles laid down\\n\\t\\t\\t\\tin the Qur'an and the teachings of the Prophet. For\\n\\t\\t\\t\\tfurther details relating to the division of spoils of\\n\\t\\t\\t\\twar, see verse {41} of this surah. - The immediate\\n\\t\\t\\t\\toccasion of this revelation was the question of the booty\\n\\t\\t\\t\\tacquired by the Muslims in the battle of Badr (an account\\n\\t\\t\\t\\tof which is given in the introductory note to this\\n\\t\\t\\t\\tsurah); but the principle enunciated above is valid for\\n\\t\\t\\t\\tall times and circumstances."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "Lit., \"set to rights the relationship between yourselves\"\\n\\t\\t\\t\\t- i e., \"remain conscious of your brotherhood in faith\\n\\t\\t\\t\\tand banish all discord among yourselves\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "Lit., \"and whenever His messages are conveyed to them,\\n\\t\\t\\t\\tthey increase them in faith\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "See surah {2}, note [4]."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "I.e., in paradise. According to Razi, however, the \"most\\n\\t\\t\\t\\texcellent sustenance\" is a metonym for \"the spiritual\\n\\t\\t\\t\\traptures arising from the knowledge of God, the love of\\n\\t\\t\\t\\tHim, and the self-immersion (istighraq) in worshipping\\n\\t\\t\\t\\tHim\". In Razi's interpretation, this expression refers to\\n\\t\\t\\t\\tthe spiritual reward of faith in this world. Some\\n\\t\\t\\t\\tcommentators (cf. Manar IX, 597) regard the above\\n\\t\\t\\t\\tdefinition of true believers as the most important\\n\\t\\t\\t\\tpassage of this surah. - The phrase rendered by me as\\n\\t\\t\\t\\t\"theirs shall be great dignity\" reads, literally, \"they\\n\\t\\t\\t\\tshall have degrees\", namely, of excellence and dignity."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "I.e., after it had become clear that it was indeed God's\\n\\t\\t\\t\\twill that the Muslims should give open battle to the\\n\\t\\t\\t\\tQuraysh army. This reference to the antecedents of the\\n\\t\\t\\t\\tbattle of Badr (see the introductory note to this surah)\\n\\t\\t\\t\\tconnects with the admonition given in verse {1}, \"pay\\n\\t\\t\\t\\theed unto God and His Apostle\", as well as with the\\n\\t\\t\\t\\treminder, in verse {2}, that true believers place all\\n\\t\\t\\t\\ttheir trust in God. A few of the followers of the Prophet\\n\\t\\t\\t\\tdisliked the idea of giving battle to the main army of\\n\\t\\t\\t\\tthe Quraysh, instead of attacking the Meccan caravan\\n\\t\\t\\t\\treturning from Syria and thus of acquiring easy booty;\\n\\t\\t\\t\\tbut the majority of them immediately declared that they\\n\\t\\t\\t\\twould follow God's Apostle wherever he might lead them. -\\n\\t\\t\\t\\tSome of the commentators are inclined to relate the\\n\\t\\t\\t\\tadverbial particle kama (\"just as\" or \"even as\"),\\n\\t\\t\\t\\tintroducing this sentence, to the preceding passage and,\\n\\t\\t\\t\\tthus, to their duty to follow God's commands. Others,\\n\\t\\t\\t\\thowever, regard this interpretation as somewhat laboured,\\n\\t\\t\\t\\tand relate the comparison implied in kama to the first\\n\\t\\t\\t\\tclause of verse {6}, explaining the passage thus: \"Just\\n\\t\\t\\t\\tas some of the believers were averse to going forth from\\n\\t\\t\\t\\tMedina to give battle to the Quraysh, so, too, they would\\n\\t\\t\\t\\targue with thee as to whether it was really willed by\\n\\t\\t\\t\\tGod.\" This, in particular, was the view of Mujahid, whom\\n\\t\\t\\t\\tTabari quotes with approval in his commentary on this\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "Lit., \"while you would have liked the one which was not\\n\\t\\t\\t\\tpowerful to be yours\" - i.e., the caravan coming from\\n\\t\\t\\t\\tSyria, which was accompanied by only forty armed men and\\n\\t\\t\\t\\tcould, therefore, be attacked without great danger."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "7",
    "NoteID": "8",
    "Body": "The destruction of the Meccan army at Badr was the\\n\\t\\t\\t\\tprelude to the elimination, in the course of the next few\\n\\t\\t\\t\\tyears, of all opposition to Islam in its homeland: and it\\n\\t\\t\\t\\tis to this future fulfilment of God's promise that the\\n\\t\\t\\t\\tabove words refer. See also surah {11}, note [103]."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "8",
    "NoteID": "9",
    "Body": "The implication is that the truth of the Prophet's cause\\n\\t\\t\\t\\tcould not have been vindicated by the Muslims' overcoming\\n\\t\\t\\t\\tand plundering the rich caravan which was approaching\\n\\t\\t\\t\\tfrom the north. Although such an action would have\\n\\t\\t\\t\\tbenefited the Muslims materially, it would not have\\n\\t\\t\\t\\tlessened the strength of the pagan Quraysh: while, on the\\n\\t\\t\\t\\tother hand, the encounter at Badr with the main,\\n\\t\\t\\t\\theavily-armed Quraysh force, resulting as it did in a\\n\\t\\t\\t\\tdecisive victory of the Muslims, was destined to shatter\\n\\t\\t\\t\\tthe self-confidence of the enemy and thus to pave the way\\n\\t\\t\\t\\tfor the ultimate triumph of Islam in Arabia."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "10",
    "NoteID": "10",
    "Body": "\"On the day of the battle of Badr, the Prophet looked at\r\\n\\t\\t\\t\\this followers, who were three hundred-odd men, and he\r\\n\\t\\t\\t\\tlooked at those who were ascribing divinity to beings\r\\n\\t\\t\\t\\tother than God: and lo, they were more than one thousand.\r\\n\\t\\t\\t\\tThereupon God's Prophet turned towards the qiblah, raised\r\\n\\t\\t\\t\\this hands and thus implored his Sustainer: 'O God! Fulfil\r\\n\\t\\t\\t\\twhat Thou hast promised me! O God! If this little band of\r\\n\\t\\t\\t\\tthose who have surrendered themselves unto Thee is\r\\n\\t\\t\\t\\tdestroyed, Thou wilt not be worshipped on earth...'.\"\r\\n\\t\\t\\t\\tThis authentic Tradition, quoted by Muslim, Abu Da'ud,\r\\n\\t\\t\\t\\tTirmidhi, Ahmad ibn Hanbal, etc., appears also in a very\r\\n\\t\\t\\t\\tsimilar version in Bukhari's Sahih. It is said that the\r\\n\\t\\t\\t\\tabove Our'an-verse was revealed in response to the\r\\n\\t\\t\\t\\tProphet's prayer - whereupon he recited another, much\r\\n\\t\\t\\t\\tearlier verse ( 54:45 ): \"The hosts shall be routed, and\r\\n\\t\\t\\t\\tshall turn their backs [in flight]\" (Bukhari). - As\r\\n\\t\\t\\t\\tregards the promise of aid through thousands of angels,\r\\n\\t\\t\\t\\tsee {3:124-125}, where a similar promise - made on the\r\\n\\t\\t\\t\\toccasion of the battle of Uhud - is said to have been\r\\n\\t\\t\\t\\tuttered by the Prophet and thus, by implication,\r\\n\\t\\t\\t\\tconfirmed by God. The spiritual nature of this angelic\r\\n\\t\\t\\t\\taid is clearly expressed by the words, \"and God ordained\r\\n\\t\\t\\t\\tthis only as a glad tiding...\", etc. (See also surah {3},\r\\n\\t\\t\\t\\tnotes [93] and [94].)"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "11",
    "NoteID": "11",
    "Body": "I.e., before the battle of Badr. Regarding the\\n\\t\\t\\t\\tinterpretation of nu'as as \"inner calm\", see surah {3},\\n\\t\\t\\t\\tnote [112]. Here it refers to the spiritual quiet and\\n\\t\\t\\t\\tself-confidence of the believers in the face of\\n\\t\\t\\t\\toverwhelming odds."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "11",
    "NoteID": "12",
    "Body": "Lit., \"take away from you the pollution of Satan\".\r\\n\\t\\t\\t\\tImmediately before the beginning of the battle, the\r\\n\\t\\t\\t\\tMeccan army infested the wells of Badr, thus depriving\r\\n\\t\\t\\t\\tthe Muslims of water; and, under the influence of thirst,\r\\n\\t\\t\\t\\tsome of the latter fell prey to utter despair (here\r\\n\\t\\t\\t\\tsymbolized by \"Satan's unclean whisperings\") - when,\r\\n\\t\\t\\t\\tsuddenly, abundant rain fell and enabled them to satisfy\r\\n\\t\\t\\t\\ttheir thirst (Tabari, on the authority of Ibn 'Abbas)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "12",
    "NoteID": "13",
    "Body": "The phrase \"I am with you\" is addressed (through the\\n\\t\\t\\t\\tangels) to the believers - \"for, the purport of these\\n\\t\\t\\t\\twords was the removal of fear, since it was the Muslims,\\n\\t\\t\\t\\tand not the angels, who feared the deniers of the truth\"\\n\\t\\t\\t\\t(Razi)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "12",
    "NoteID": "14",
    "Body": "The following is, again, addressed to the believers\\n\\t\\t\\t\\t(Razi). {Verse 10} of this surah makes it clear that the\\n\\t\\t\\t\\taid of the angels was purely spiritual in nature; and\\n\\t\\t\\t\\tthere is no evidence anywhere in the Qur'an that they\\n\\t\\t\\t\\tdid, or were meant to, participate in the battle in a\\n\\t\\t\\t\\tphysical sense. In his commentary on the above verse,\\n\\t\\t\\t\\tRazi stresses this point repeatedly; among modern\\n\\t\\t\\t\\tcommentators, Rashid Rida' emphatically rejects the\\n\\t\\t\\t\\tlegendary notion that angels actually fought in this or\\n\\t\\t\\t\\tany other of the Prophet's battles (see Manar IX, 612\\n\\t\\t\\t\\tff.). It is mainly on the basis of Razi's interpretation\\n\\t\\t\\t\\tof this passage that I have interpolated, in several\\n\\t\\t\\t\\tplaces, explanatory clauses between brackets."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "12",
    "NoteID": "15",
    "Body": "I.e., \"destroy them utterly\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "13",
    "NoteID": "16",
    "Body": "Or: \"contended against\" (Baghawi). However, since the\\n\\t\\t\\t\\tprimary meaning of shaqqahu (\"he separated himself from\\n\\t\\t\\t\\thim\" or \"cut himself off from him\") comprises the\\n\\t\\t\\t\\tconcepts of both estrangement and opposition (Tabari,\\n\\t\\t\\t\\tZamakhshari, Razi), the rendering adopted by me seems to\\n\\t\\t\\t\\tbe the most suitable in this context."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "15",
    "NoteID": "17",
    "Body": "I.e., in flight: the implication being that in view of\\n\\t\\t\\t\\tGod's promise of victory no retreat is permissible. Since\\n\\t\\t\\t\\tthis verse (like the whole of this surah) relates\\n\\t\\t\\t\\tpredominantly to the battle of Badr, it may well be\\n\\t\\t\\t\\tpresumed that the above admonition forms part of the\\n\\t\\t\\t\\tmessage of encouragement beginning with the words, \"I am\\n\\t\\t\\t\\twith you\" (verse {12}), which God commanded the angels to\\n\\t\\t\\t\\tconvey to the believers before the battle. In accordance\\n\\t\\t\\t\\twith the didactic method of the Qur'an, however, the\\n\\t\\t\\t\\tmoral lesson contained in this verse is not confined to\\n\\t\\t\\t\\tthe historical occasion to which it refers, but has the\\n\\t\\t\\t\\tvalidity of a permanent law."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "17",
    "NoteID": "18",
    "Body": "Lit., \"you did not slay them\" - i.e., in the battle of\\n\\t\\t\\t\\tBadr, which ended with a complete victory of the Muslims."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "17",
    "NoteID": "19",
    "Body": "According to several Traditions, the Prophet cast, at the\\n\\t\\t\\t\\tbeginning of the battle, a handful of pebbles or dust in\\n\\t\\t\\t\\tthe direction of the enemy, thus symbolically indicating\\n\\t\\t\\t\\ttheir approaching defeat. However, none of these accounts\\n\\t\\t\\t\\tattains to the standard of authenticity described as\\n\\t\\t\\t\\tsahih (i.e., \"reliable\") by the great exponents of the\\n\\t\\t\\t\\tscience of Tradition ('ilm al-hadith), and cannot,\\n\\t\\t\\t\\ttherefore, satisfactorily explain the above Qur'anic\\n\\t\\t\\t\\tpassage (see Ibn Kathir's commentary on this verse, as\\n\\t\\t\\t\\twell as Manar IX, 620 f.). Since the verb rama (lit., \"he\\n\\t\\t\\t\\tcast\" or \"flung\") applies also to the act of \"shooting an\\n\\t\\t\\t\\tarrow\" or \"flinging a spear\", it might be explained here\\n\\t\\t\\t\\tas a reference to the Prophet's active participation in\\n\\t\\t\\t\\tthe battle. Alternatively, it may denote his \"casting\\n\\t\\t\\t\\tterror\", i.e., into the hearts of his enemies, by his and\\n\\t\\t\\t\\this followers' extreme valour. Whichever explanation is\\n\\t\\t\\t\\tadopted, the above verse implies that the victory of the\\n\\t\\t\\t\\tMuslims over the much more numerous and much better\\n\\t\\t\\t\\tequipped army of the Quraysh was due to God's grace\\n\\t\\t\\t\\talone: and, thus, it is a reminder to the faithful, of\\n\\t\\t\\t\\tall times, not to indulge in undue pride in any of their\\n\\t\\t\\t\\tachievements (which is the meaning of the \"test\"\\n\\t\\t\\t\\tmentioned in the next sentence)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "17",
    "NoteID": "20",
    "Body": "Lit., \"from Himself\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "19",
    "NoteID": "21",
    "Body": "There is no unanimity among the commentators as to\\n\\t\\t\\t\\twhether this verse is addressed to the believers or to\\n\\t\\t\\t\\ttheir opponents at Badr, that is, the pagan Quraysh.\\n\\t\\t\\t\\tWhile some of the commentators (e.g., Razi) are of the\\n\\t\\t\\t\\topinion that it is an admonition to the believers and\\n\\t\\t\\t\\tunderstand it in the sense rendered by me above, others\\n\\t\\t\\t\\tmaintain that it is a warning addressed to the Quraysh.\\n\\t\\t\\t\\tIn order to justify this view, they give to the word fath\\n\\t\\t\\t\\t(lit., \"opening\") occurring in the first sentence the\\n\\t\\t\\t\\tmeaning of \"judgment\" or \"decision\" (which is undoubtedly\\n\\t\\t\\t\\tpermissible from the linguistic point of view), and\\n\\t\\t\\t\\tarrive at the following rendering: \"If you have been\\n\\t\\t\\t\\tseeking a decision [O unbelievers] - a decision has now\\n\\t\\t\\t\\tindeed come unto you. And if you abstain [from making war\\n\\t\\t\\t\\ton God and His Apostle], it will be for your own good;\\n\\t\\t\\t\\tbut if you revert to it, We shall revert [to defeating\\n\\t\\t\\t\\tyou] - and never will your army be of any avail to you,\\n\\t\\t\\t\\thowever great its numbers: for, behold, God is with the\\n\\t\\t\\t\\tbelievers!\" As can be seen from this alternative\\n\\t\\t\\t\\trendering, the difference in interpretation pivots on the\\n\\t\\t\\t\\ttropical meaning which one gives to the words fath\\n\\t\\t\\t\\t(\"decision\" or \"victory\") and fi'ah (\"army\" or\\n\\t\\t\\t\\t\"community\"). As regards the latter, it is to be borne in\\n\\t\\t\\t\\tmind that its primary significance is \"a group\" or \"a\\n\\t\\t\\t\\tcongregated body of men\" - more or less synonymous with\\n\\t\\t\\t\\tta'ifah or jama'ah; it can, therefore, be used to denote\\n\\t\\t\\t\\t\"an army\" as well as \"a community\". Similarly, the\\n\\t\\t\\t\\texpression na'ud can be understood in either of two ways:\\n\\t\\t\\t\\tnamely, as meaning \"We shall revert [to defeating you]\" -\\n\\t\\t\\t\\tor, as in my rendering, \"We shall revoke [Our promise of\\n\\t\\t\\t\\taid]\" - addressed, in the one instance to the\\n\\t\\t\\t\\tunbelievers, and in the other, to the believers. (For the\\n\\t\\t\\t\\tuse of the verb 'ada in the sense of \"he revoked\", see\\n\\t\\t\\t\\tTaj al-'Arus; also Lane V, 2189.) But while both\\n\\t\\t\\t\\tinterpretations of the above verse are linguistically\\n\\t\\t\\t\\tjustified, the one adopted by me (and supported,\\n\\t\\t\\t\\taccording to Ibn Kathir, by Ubayy ibn Ka'b) is in greater\\n\\t\\t\\t\\tharmony with the context, inasmuch as both the preceding\\n\\t\\t\\t\\tand subsequent passages are unmistakably addressed to the\\n\\t\\t\\t\\tbelievers. Thus, the verse must be understood as a\\n\\t\\t\\t\\treminder to the Muslims that God will be with them only\\n\\t\\t\\t\\tso long as they remain firm in faith and righteous in\\n\\t\\t\\t\\taction, and that, however large their community may be in\\n\\t\\t\\t\\tthe future, they will be powerless unless they are true\\n\\t\\t\\t\\tbelievers."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "21",
    "NoteID": "22",
    "Body": "See  2:93  and  4:46 , and the corresponding notes. While\\n\\t\\t\\t\\tin the above-mentioned two instances the Jews are alluded\\n\\t\\t\\t\\tto, the present allusion is more general, and relates to\\n\\t\\t\\t\\tall people who have come to know and understand the\\n\\t\\t\\t\\tmessage of the Qur'an, but pay no heed to it."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "22",
    "NoteID": "23",
    "Body": "Lit., \"animals that walk or crawl\" (dawab, sing. dabbah),\\n\\t\\t\\t\\tincluding man as well."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "24",
    "NoteID": "24",
    "Body": "I.e., between a man's desires and the outward action that\\n\\t\\t\\t\\tmay result from those desires: indicating that God can\\n\\t\\t\\t\\tturn man away from what his heart urges him to do\\n\\t\\t\\t\\t(Raghib). In other words, it is God-consciousness alone\\n\\t\\t\\t\\tthat can prevent man from being misled by wrong desires\\n\\t\\t\\t\\tand, thus, from becoming like \"those deaf, those dumb\\n\\t\\t\\t\\tones who do not use their reason\" (verse {22} above); and\\n\\t\\t\\t\\tit is God-consciousness alone that can enable man to\\n\\t\\t\\t\\tfollow the call \"unto that which gives life\" - that is,\\n\\t\\t\\t\\tspiritual awareness of right and wrong and the will to\\n\\t\\t\\t\\tact accordingly."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "25",
    "NoteID": "25",
    "Body": "The term fitnah - here rendered as \"temptation to evil\" -\\n\\t\\t\\t\\tcomprises a wide range of concepts, e.g., \"seduction\" or\\n\\t\\t\\t\\t\"trial\" or \"test\" or \"an affliction whereby one is\\n\\t\\t\\t\\ttried\"; hence also \"confusion\" (as in  3:7  and  6:23 ),\\n\\t\\t\\t\\t\"discord\" or \"dissension\" (because it constitutes a\\n\\t\\t\\t\\t\"trial\" of human groupments), as well as \"persecution\"\\n\\t\\t\\t\\tand \"oppression\" (because it is an affliction which may\\n\\t\\t\\t\\tcause man to go astray and to lose his faith in spiritual\\n\\t\\t\\t\\tvalues - a meaning in which the word fitnah is used in\\n\\t\\t\\t\\t 2:191  and {193}); and, finally, \"sedition\" and \"civil\\n\\t\\t\\t\\twar\" (because it leads whole communities astray). Since\\n\\t\\t\\t\\tthe expression \"temptation to evil\" is applicable to all\\n\\t\\t\\t\\tthese meanings, it appears to be the most suitable in the\\n\\t\\t\\t\\tabove context: the idea being that it is not merely the\\n\\t\\t\\t\\tdeliberate deniers of spiritual truths who are exposed to\\n\\t\\t\\t\\tsuch a temptation, but that also people who are otherwise\\n\\t\\t\\t\\trighteous may fall prey to it unless they remain always,\\n\\t\\t\\t\\tand consciously, on their guard against anything that\\n\\t\\t\\t\\tmight lead them astray from the right course."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "26",
    "NoteID": "26",
    "Body": "A reference to the weakness of the believers in the early\\n\\t\\t\\t\\tdays of Islam, before their exodus from Mecca to Medina.\\n\\t\\t\\t\\tIn its wider meaning, it is a reminder to every community\\n\\t\\t\\t\\tof true believers, at all times, of their initial\\n\\t\\t\\t\\tweakness and numerical insignificance and their\\n\\t\\t\\t\\tsubsequent growth in numbers and influence."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "27",
    "NoteID": "27",
    "Body": "Lit., \"do not be false to your trusts, the while you\\n\\t\\t\\t\\tknow\". Regarding the deeper meaning of amanah (\"trust\"),\\n\\t\\t\\t\\tsee note [87] on  33:72 ."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "28",
    "NoteID": "28",
    "Body": "Inasmuch as love of worldly goods and a desire to protect\\n\\t\\t\\t\\tone's family may lead a person to transgression (and,\\n\\t\\t\\t\\tthus, to a betrayal of the moral values postulated in\\n\\t\\t\\t\\tGod's message), they are described as fitnah - which, in\\n\\t\\t\\t\\tthis context, is best rendered by the two words \"trial\\n\\t\\t\\t\\tand temptation\". This reminder connects with verse {25}\\n\\t\\t\\t\\tabove, \"beware of that temptation to evil which does not\\n\\t\\t\\t\\tbefall only those who are bent on denying the truth,\"\\n\\t\\t\\t\\tsince it is acquisitiveness and a desire to confer\\n\\t\\t\\t\\tbenefits on one's own family which often tempt an\\n\\t\\t\\t\\totherwise good person to offend against the rights of his\\n\\t\\t\\t\\tfellow-men. It is to be borne in mind that, contrary to\\n\\t\\t\\t\\tthe New Testament, the Our'an does not postulate a\\n\\t\\t\\t\\tcontempt for worldly attachments as a pre-requisite of\\n\\t\\t\\t\\trighteousness: it only demands of man that he should not\\n\\t\\t\\t\\tallow these attachments to deflect him from the pursuit\\n\\t\\t\\t\\tof moral verities."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "29",
    "NoteID": "29",
    "Body": "I.e., the faculty of moral valuation (Manar IX, 648). See\r\\n\\t\\t\\t\\talso surah {2}, note [38]."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "30",
    "NoteID": "30",
    "Body": "While the first sentence of this verse is a reference to\\n\\t\\t\\t\\tthe persecution to which the Prophet and his followers\\n\\t\\t\\t\\thad been exposed in Mecca before their exodus to Medina,\\n\\t\\t\\t\\tthis concluding passage points to the ever-recurring fact\\n\\t\\t\\t\\tof man's religious history that those who deny the truth\\n\\t\\t\\t\\tof divine revelation are always intent on rendering its\\n\\t\\t\\t\\tpreachers powerless or destroying them, either physically\\n\\t\\t\\t\\tor, figuratively, through ridicule."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "31",
    "NoteID": "31",
    "Body": "Cf.  6:25 . As regards the expression la-qulna - here\\n\\t\\t\\t\\trendered as \"we could certainly [ourselves] compose\" - it\\n\\t\\t\\t\\tis to be remembered that the verb qala does not always\\n\\t\\t\\t\\tsignify only \"he said\", but also \"he asserted\" or\\n\\t\\t\\t\\t\"expressed an opinion\", as well as - in connection with a\\n\\t\\t\\t\\tliterary production - \"he composed\": thus, qala shi'r\\n\\t\\t\\t\\tmeans \"he composed a poem\". In the above context, this\\n\\t\\t\\t\\texpression alludes to the oft-repeated (but never\\n\\t\\t\\t\\tfulfilled) boast of the pagan Quraysh that they could\\n\\t\\t\\t\\tproduce a poetic message comparable in merit to that of\\n\\t\\t\\t\\tthe Qur'an; in its wider sense, it is an allusion to the\\n\\t\\t\\t\\tattitude of many unbelievers towards revealed scriptures\\n\\t\\t\\t\\tin general."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "32",
    "NoteID": "32",
    "Body": "This sarcastic appeal of the unbelievers - referred to\\n\\t\\t\\t\\tseveral times in the Qur'an - is meant to stress their\\n\\t\\t\\t\\tconviction that the Qur'an is not a divine revelation.\\n\\t\\t\\t\\tAccording to Anas ibn Malik, these words were first\\n\\t\\t\\t\\tuttered by Abu Jahl, the Prophet's chief opponent at\\n\\t\\t\\t\\tMecca, who was killed in the battle of Badr (Bukhari)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "33",
    "NoteID": "33",
    "Body": "I.e., in Mecca, before the exodus to Medina."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "34",
    "NoteID": "34",
    "Body": "At the time of the revelation of this surah (the year 2\r\\n\\t\\t\\t\\tH.) Mecca was still in the possession of the hostile\r\\n\\t\\t\\t\\tQuraysh, and no Muslim was allowed to enter it. Owing to\r\\n\\t\\t\\t\\ttheir descent from Abraham, the Quraysh considered\r\\n\\t\\t\\t\\tthemselves entitled to the guardianship of the Ka'bah\r\\n\\t\\t\\t\\t(\"the Inviolable House of Worship\"), which had been built\r\\n\\t\\t\\t\\tby Abraham as the first temple ever dedicated to the One\r\\n\\t\\t\\t\\tGod (see surah {2}, note [102]). The Qur'an refutes this\r\\n\\t\\t\\t\\tcontention, just as it refutes the claim of the children\r\\n\\t\\t\\t\\tof Israel to being \"the chosen people\" by virtue of their\r\\n\\t\\t\\t\\tdescent from Abraham. (Cf. in this connection  2:124 ,\r\\n\\t\\t\\t\\tand especially the last sentence, \"My covenant does not\r\\n\\t\\t\\t\\tembrace the wrongdoers.\") Although they still retained a\r\\n\\t\\t\\t\\tmodicum of belief in God, the Quraysh had entirely\r\\n\\t\\t\\t\\tforsaken the unitarian faith of Abraham, thus forfeiting\r\\n\\t\\t\\t\\tany moral claim to the guardianship of the Temple\r\\n\\t\\t\\t\\t(al-bayt) built by him."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "35",
    "NoteID": "35",
    "Body": "I.e., devoid of all spiritual content. Some of the early\\n\\t\\t\\t\\tauthorities maintain that dancing around the Ka'bah,\\n\\t\\t\\t\\taccompanied by whistling and hand-clapping, was actually\\n\\t\\t\\t\\ta ritual practiced by the pre-Islamic Arabs. Although\\n\\t\\t\\t\\tthis explanation is quite plausible, it would appear from\\n\\t\\t\\t\\tthe context that the expression \"whistling and clapping\\n\\t\\t\\t\\tof hands\" is used here metaphorically, to denote the\\n\\t\\t\\t\\tspiritual emptiness of the religious rituals of people\\n\\t\\t\\t\\twho are wont to attribute a quasi-divine efficacy to all\\n\\t\\t\\t\\tmanner of circumstantial \"forces\" - like wealth, power,\\n\\t\\t\\t\\tsocial status, \"luck\", etc."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "35",
    "NoteID": "36",
    "Body": "The chastisement or suffering referred to here was their\\n\\t\\t\\t\\tcrushing defeat at Badr."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "38",
    "NoteID": "37",
    "Body": "I.e., from their endeavour to turn others way from the\\n\\t\\t\\t\\tpath of God and from waging war against the believers."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "38",
    "NoteID": "38",
    "Body": "Lit., \"the example (sunnah) of the people of old times\\n\\t\\t\\t\\thas already come to pass\": an allusion to the disasters\\n\\t\\t\\t\\tthat have overtaken, and are bound to overtake, those who\\n\\t\\t\\t\\tpersistently deny moral truths."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "39",
    "NoteID": "39",
    "Body": "I.e., until man is free to worship God. Cf. the identical\\n\\t\\t\\t\\tphrase in  2:193 , and the corresponding note. Both these\\n\\t\\t\\t\\tpassages stress self-defence - in the widest sense of\\n\\t\\t\\t\\tthis word - as the only justification of war."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "39",
    "NoteID": "40",
    "Body": "I.e., He knows their motives, and will requite them\\n\\t\\t\\t\\taccording to their merits."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "41",
    "NoteID": "41",
    "Body": "According to verse {1} of this surah, \"all spoils of war\\n\\t\\t\\t\\tbelong to God and the Apostle\", i.e., are to be\\n\\t\\t\\t\\tadministered by the authorities of an Islamic state in\\n\\t\\t\\t\\tthe interests of the common weal. Most of the great\\n\\t\\t\\t\\tIslamic jurists are of the opinion that whereas\\n\\t\\t\\t\\tfour-fifths of all spoils may either be distributed among\\n\\t\\t\\t\\tthose who actively took part in the war effort or may be\\n\\t\\t\\t\\totherwise utilized for the welfare of the community,\\n\\t\\t\\t\\tone-fifth must be reserved for the specific purposes\\n\\t\\t\\t\\tenumerated in the above verse, including a share \"for God\\n\\t\\t\\t\\tand the Apostle\" (which is obviously a metonym for a\\n\\t\\t\\t\\tgovernment that rules in accordance with the laws of the\\n\\t\\t\\t\\tQur'an and the teachings of God's Apostle); this latter\\n\\t\\t\\t\\tshare is to be used for the exigencies of state\\n\\t\\t\\t\\tadministration. Since a full discussion of this complex\\n\\t\\t\\t\\tjuridical problem would go far beyond the scope of these\\n\\t\\t\\t\\texplanatory notes, the reader is referred, in particular,\\n\\t\\t\\t\\tto Manar X, 4ff., where the views of the classical\\n\\t\\t\\t\\texponents of Islamic jurisprudence are summarized. - For\\n\\t\\t\\t\\tthe term ibn as-sabil occurring in this verse, see surah\\n\\t\\t\\t\\t{2}, note [145]. By \"the near of kin and the orphans\"\\n\\t\\t\\t\\tapparently the relatives of fallen combatants are meant\\n\\t\\t\\t\\tin this context."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "41",
    "NoteID": "42",
    "Body": "I.e., \"He can grant you victory or can withhold it from\\n\\t\\t\\t\\tyou\". The battle of Badr is described here as \"the day\\n\\t\\t\\t\\twhen the true was distinguished from the false\" (yawm\\n\\t\\t\\t\\tal-furqan) because on that occasion a small and poorly\\n\\t\\t\\t\\tarmed group of believers utterly destroyed an infinitely\\n\\t\\t\\t\\tbetter equipped army more than three times its number.\\n\\t\\t\\t\\tThe revelation referred to in this connection was God's\\n\\t\\t\\t\\tpromise of victory, given in verses {12-14} of this\\n\\t\\t\\t\\tsurah. (See also note [38] on  2:53 .)"
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "42",
    "NoteID": "43",
    "Body": "Before the beginning of the battle, the Prophet and his\\n\\t\\t\\t\\tfollowers were encamped in the northern part of the\\n\\t\\t\\t\\tvalley of Badr, nearest to Medina, while their enemies,\\n\\t\\t\\t\\thaving come from Mecca, occupied its southern part. The\\n\\t\\t\\t\\tMeccan trade caravan, coming from Syria under the\\n\\t\\t\\t\\tleadership of Abu Sufyan, was in the meantime proceeding\\n\\t\\t\\t\\tsouthwards through the coastal lowlands (see introductory\\n\\t\\t\\t\\tnote to this surah)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "42",
    "NoteID": "44",
    "Body": "This is a very free rendering of the elliptic phrase\\n\\t\\t\\t\\twhich runs, literally, thus: \"And if you had mutually\\n\\t\\t\\t\\tmade an appointment, you would indeed have failed to keep\\n\\t\\t\\t\\tthe appointment\" - i.e., for battle. As already mentioned\\n\\t\\t\\t\\tin the introductory note to this surah, most of the\\n\\t\\t\\t\\tProphet's followers had been under the impression that\\n\\t\\t\\t\\ttheir objective was the relatively weak trade caravan,\\n\\t\\t\\t\\tand some of them were dismayed at finding themselves face\\n\\t\\t\\t\\tto face with the powerful Quraysh army advancing from the\\n\\t\\t\\t\\tsouth."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "42",
    "NoteID": "45",
    "Body": "According to all the commentators, the words interpolated\\n\\t\\t\\t\\tby me between brackets are implied in this highly\\n\\t\\t\\t\\telliptical sentence. Literally translated, its last words\\n\\t\\t\\t\\tmight be rendered as \"a thing that was [already] done\":\\n\\t\\t\\t\\tmeaning that if God decrees a thing, it must inevitably\\n\\t\\t\\t\\tcome about, and may therefore be described as already\\n\\t\\t\\t\\tdone."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "42",
    "NoteID": "46",
    "Body": "Some of the great commentators understand this sentence\r\\n\\t\\t\\t\\tin a metaphorical sense, with \"destruction\" signifying\r\\n\\t\\t\\t\\tpersistence in denying the truth (kufr), and \"life\" being\r\\n\\t\\t\\t\\tsynonymous with faith. According to this interpretation,\r\\n\\t\\t\\t\\tthe above sentence would have the following meaning: \"...\r\\n\\t\\t\\t\\tso that the denial of the truth on the part of him who\r\\n\\t\\t\\t\\thas denied it, and the faith of him who has attained to\r\\n\\t\\t\\t\\tit, might become clearly evident\" (Zamakhshari); or \"let\r\\n\\t\\t\\t\\thim who is bent on denying the truth go on denying it\r\\n\\t\\t\\t\\tafter this clear evidence of God's will, and let him who\r\\n\\t\\t\\t\\thas attained to belief go on believing\" (Ibn Ishaq, as\r\\n\\t\\t\\t\\tquoted by Ibn Kathir). In my opinion, however, it is\r\\n\\t\\t\\t\\tpreferable to interpret the references to death and life\r\\n\\t\\t\\t\\tin their prima-facie (that is, not metaphorical) sense -\r\\n\\t\\t\\t\\tnamely, as applying to the death or survival of all who\r\\n\\t\\t\\t\\ttook part in the battle of Badr, believers and\r\\n\\t\\t\\t\\tunbelievers alike: the believers who fell in that battle\r\\n\\t\\t\\t\\tdied conscious of being martyrs in God's cause, and those\r\\n\\t\\t\\t\\twho survived could now clearly discern God's hand in\r\\n\\t\\t\\t\\ttheir victory; while the dead among the deniers of the\r\\n\\t\\t\\t\\ttruth had clearly given their lives for nothing, and\r\\n\\t\\t\\t\\tthose of them who survived must now realize that their\r\\n\\t\\t\\t\\tcrushing defeat was due, in the last resort, to something\r\\n\\t\\t\\t\\tinfinitely greater than the valour of the Muslims (cf.\r\\n\\t\\t\\t\\tverse {17}, and the corresponding notes)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "43",
    "NoteID": "47",
    "Body": "Lit., \"in thy dream\" - obviously relating to a dream\\n\\t\\t\\t\\twhich the Prophet had had just before the encounter at\\n\\t\\t\\t\\tBadr. We have no authentic Tradition to this effect, but\\n\\t\\t\\t\\tthe tabi'i Mujahid is quoted as having said, \"God had\\n\\t\\t\\t\\tshown the enemies to the Prophet, in a dream, as few; he\\n\\t\\t\\t\\tinformed his Companions accordingly, and this encouraged\\n\\t\\t\\t\\tthem greatly\" (Razi and Ibn Kathir, with minor variants)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "43",
    "NoteID": "48",
    "Body": "Lit., \"about the matter\" - i.e., about the advisability\\n\\t\\t\\t\\tof giving battle or retreating."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "44",
    "NoteID": "49",
    "Body": "See note [45] above. Since at the time of the actual\\n\\t\\t\\t\\tencounter the Muslims could no longer be in doubt as to\\n\\t\\t\\t\\tthe great number of the enemy force, the phrase \"He made\\n\\t\\t\\t\\tthem appear as few in your eyes\" has obviously a\\n\\t\\t\\t\\tmetaphorical meaning: it implies that, by that time, the\\n\\t\\t\\t\\tProphet's followers were so full of courage that the\\n\\t\\t\\t\\tenemy appeared insignificant to them. The Quraysh, on the\\n\\t\\t\\t\\tother hand, were so conscious of their own power and\\n\\t\\t\\t\\tnumerical superiority that the Muslims appeared but of\\n\\t\\t\\t\\tlittle account to them - a mistake which ultimately cost\\n\\t\\t\\t\\tthem the battle and a great number of lives."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "46",
    "NoteID": "50",
    "Body": "The relevant word is rih, which literally signifies\r\\n\\t\\t\\t\\t\"wind\"; it is used metaphorically to denote \"spirit\" or\r\\n\\t\\t\\t\\t\"moral strength\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "47",
    "NoteID": "51",
    "Body": "A reference to the Quraysh army which set forth from\\n\\t\\t\\t\\tMecca under the leadership of Abu Jahl in the conviction\\n\\t\\t\\t\\tthat they would destroy the Prophet and his followers.\\n\\t\\t\\t\\tThese words imply a warning to the believers, of all\\n\\t\\t\\t\\ttimes, never to go to war boastfully and for the sake of\\n\\t\\t\\t\\tempty glory."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "48",
    "NoteID": "52",
    "Body": "Lit., \"your neighbour\" - an expression derived from the\\n\\t\\t\\t\\tancient Arabian principle that a man is honour-bound to\\n\\t\\t\\t\\taid and protect his neighbours."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "48",
    "NoteID": "53",
    "Body": "This allegory of Satan's blandishments and of his\\n\\t\\t\\t\\tsubsequent abandonment of the sinner occurs, in a more\\n\\t\\t\\t\\tgeneral form, in  59:16 ."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "49",
    "NoteID": "54",
    "Body": "I.e., into thinking that in spite of their numerical\\n\\t\\t\\t\\tweakness and lack of arms, they could withstand the\\n\\t\\t\\t\\tpowerful Meccan army. The term din, often denoting\\n\\t\\t\\t\\t\"religion\", obviously stands here for the attitude one\\n\\t\\t\\t\\thas towards his religion: in another word, one's faith.\\n\\t\\t\\t\\t\"Those in whose hearts was disease\" is a reference to the\\n\\t\\t\\t\\tvacillating and faint-hearted among the Prophet's\\n\\t\\t\\t\\tfollowers, who were afraid of meeting the Quraysh in\\n\\t\\t\\t\\tbattle. - The particle idh which introduces this sentence\\n\\t\\t\\t\\thas often the meaning of \"when\"; in this case, however,\\n\\t\\t\\t\\tit signifies \"at the same time\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "50",
    "NoteID": "55",
    "Body": "Or: \".. . when the angels gather in death those who were\\n\\t\\t\\t\\tbent on denying the truth, they strike...\", etc. -\\n\\t\\t\\t\\tdepending on whether one attributes the pronoun in\\n\\t\\t\\t\\tyatawaffa to the angels, which gives the reading \"they\\n\\t\\t\\t\\tgather [them] in death\", or to God, in which case it\\n\\t\\t\\t\\tmeans \"He causes [them] to die\" (Zamakhshari and Razi). -\\n\\t\\t\\t\\tThe beating of the sinners' faces and backs is, according\\n\\t\\t\\t\\tto Razi, an allegory of their suffering in the life to\\n\\t\\t\\t\\tcome in consequence of their having denied the truth\\n\\t\\t\\t\\twhile alive in this world: \"They have utter darkness\\n\\t\\t\\t\\tbehind them and utter darkness before them - and this is\\n\\t\\t\\t\\tthe meaning of the words, '[the angels] strike their\\n\\t\\t\\t\\tfaces and their backs'.\" Most of the commentators assume\\n\\t\\t\\t\\tthat this passage refers specifically to the pagan\\n\\t\\t\\t\\tQuraysh who fell in the battle of Badr; but while it\\n\\t\\t\\t\\tundoubtedly does apply to them, there is no reason, in my\\n\\t\\t\\t\\topinion, to restrict its import to this particular\\n\\t\\t\\t\\thistorical event - especially in view of the subsequent\\n\\t\\t\\t\\tpassages (up to and including verse {55}), which\\n\\t\\t\\t\\tobviously refer to all who are \"bent on denying the\\n\\t\\t\\t\\ttruth\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "53",
    "NoteID": "56",
    "Body": "I.e., withdraw."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "53",
    "NoteID": "57",
    "Body": "For an explanation of the wide implications of this\\n\\t\\t\\t\\tstatement in the context of the law of cause and effect\\n\\t\\t\\t\\twhich God has decreed on His creation (and which is\\n\\t\\t\\t\\tdescribed elsewhere in the Qur'an as sunnat Allah, \"the\\n\\t\\t\\t\\tway of God\"), see my note on the phrase \"God does not\\n\\t\\t\\t\\tchange men's condition unless they change their inner\\n\\t\\t\\t\\tselves\" occurring in  13:11 ."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "55",
    "NoteID": "58",
    "Body": "Cf. verse {22} of this surah, where the same epithet is applied to human beings \"who do not use their reason\". In the present instance, it should be noted, the particle fa at the beginning of the phrase fa-hum la yu'minun has the meaning of \"and therefore\" (\"and therefore they do not believe\"): thus showing that lack of belief in spiritual verities is a consequence of one's being \"bent on denying the truth\". Expressed in positive terms, this amounts to the statement that belief in any ethical proposition depends on one's readiness to consider it on its merits and to admit the truth of whatever one's mind judges to be in conformity with other empirically or intuitively established truths. As regards the expression alladhina kafaru, the use of the past tense is meant here, as so often in the Qur'an, to stress the element of intention, and is, therefore, consistently rendered by me - wherever the context warrants it - as \"those who are bent on denying the truth\" (see also surah {2}, note [6])."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "56",
    "NoteID": "59",
    "Body": "Lit., \"every time\". The covenants referred to are\\n\\t\\t\\t\\tagreements between the Muslim community and non-Muslim\\n\\t\\t\\t\\tpolitical groupments. Although this passage is addressed,\\n\\t\\t\\t\\tin the first instance, to the Prophet, the \"thou\" relates\\n\\t\\t\\t\\there to every follower of the Qur'an and, thus, to the\\n\\t\\t\\t\\tMuslim community of all times. With the above verse, the\\n\\t\\t\\t\\tdiscourse returns to the subject of war with unbelievers\\n\\t\\t\\t\\tto which most of this surah is devoted. The reference to\\n\\t\\t\\t\\tthe unbelievers' \"breaking their covenants\" has two\\n\\t\\t\\t\\timplications: firstly, that the establishment of\\n\\t\\t\\t\\tcovenants (i.e. of peaceful relations) with non-Muslims\\n\\t\\t\\t\\tis not only permissible but, in fact, desirable (cf.\\n\\t\\t\\t\\tverse {61}); and, secondly, that the Muslims may resort\\n\\t\\t\\t\\tto war only if and when the other party is openly hostile\\n\\t\\t\\t\\tto them."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "57",
    "NoteID": "60",
    "Body": "Lit., \"put to flight, by means of them, those who come\\n\\t\\t\\t\\tafter them\"; or \"terrify through them those who follow\\n\\t\\t\\t\\tthem\": i.e., \"fight against them and inflict an exemplary\\n\\t\\t\\t\\tpunishment on them\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "58",
    "NoteID": "61",
    "Body": "The \"reason to fear treachery\" must not, of course, be\\n\\t\\t\\t\\tbased on mere surmise but on clear, objective evidence\\n\\t\\t\\t\\t(Tabari, Baghawi, Razi; also Manar X, 58)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "58",
    "NoteID": "62",
    "Body": "I.e., \"renounce the covenant in an equitable manner ('ala\\n\\t\\t\\t\\tsawa')\". Tabari explains this sentence thus: \"Before\\n\\t\\t\\t\\tmaking war on them, inform them that because of the clear\\n\\t\\t\\t\\tevidence of their treachery thou hast renounced the\\n\\t\\t\\t\\ttreaty which existed between thee and them, so that both\\n\\t\\t\\t\\tthou and they should know that thou art at war with\\n\\t\\t\\t\\tthem.\" Baghawi, in his commentary on this verse, gives an\\n\\t\\t\\t\\talmost identical interpretation and adds, \"so that they\\n\\t\\t\\t\\tshould not be under the false impression that thou hast\\n\\t\\t\\t\\trenounced the treaty after having started the war.\" Thus,\\n\\t\\t\\t\\tthe concluding sentence of this verse - \"God does not\\n\\t\\t\\t\\tlove the treacherous\" - is a warning to the believers as\\n\\t\\t\\t\\twell as to their enemies (Manar X, 58 f.)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "59",
    "NoteID": "63",
    "Body": "Lit., \"that they have outstripped\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "60",
    "NoteID": "64",
    "Body": "Lit., \"tethering of horses\" (ribat al-khayl): an\\n\\t\\t\\t\\texpression which signifies \"holding in readiness mounted\\n\\t\\t\\t\\ttroups at all points open to enemy invasion (thughur)\";\\n\\t\\t\\t\\thence, tropically, the over-all maintenance of military\\n\\t\\t\\t\\tpreparedness."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "60",
    "NoteID": "65",
    "Body": "Lit., \"God's enemy and your enemy\" - implying that every\\n\\t\\t\\t\\t\"enemy of God\" (i.e., everyone who deliberately opposes\\n\\t\\t\\t\\tand seeks to undermine the moral laws laid down by God)\\n\\t\\t\\t\\tis, eo ipso, an enemy of those who believe in Him."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "60",
    "NoteID": "66",
    "Body": "I.e., of resources, efforts and sacrifice of life."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "62",
    "NoteID": "67",
    "Body": "The implication is that \"even if they offer peace only\\n\\t\\t\\t\\twith a view to deceiving thee, this [offer of] peace must\\n\\t\\t\\t\\tbe accepted, since all judgment [of their intentions]\\n\\t\\t\\t\\tmust be based on outward evidence alone\" (Razi): in other\\n\\t\\t\\t\\twords, mere suspicion cannot be made an excuse for\\n\\t\\t\\t\\trejecting an offer of peace."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "62",
    "NoteID": "68",
    "Body": "Lit., \"and by the believers\": thus signifying the visible\\n\\t\\t\\t\\tmeans (wasitah) by which God succoured the Prophet."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "65",
    "NoteID": "69",
    "Body": "For an explanation of the phrase harrid al-mu'minin, see\r\\n\\t\\t\\t\\tsurah {4}, note [102]. Consistently with my\r\\n\\t\\t\\t\\tinterpretation, the words 'ala 'l-qital can be rendered\r\\n\\t\\t\\t\\there in either of two ways: \"[with a view] to fighting\"\r\\n\\t\\t\\t\\tor \"when fighting\". On the basis of the conventional\r\\n\\t\\t\\t\\tinterpretation of the verb harrid as \"urge\" or \"rouse\",\r\\n\\t\\t\\t\\tthe phrase could be translated as \"urge the believers to\r\\n\\t\\t\\t\\tfight\": but this, as I have pointed out in the earlier\r\\n\\t\\t\\t\\tnote referred to above, does not convey the true sense of\r\\n\\t\\t\\t\\tthis injunction."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "65",
    "NoteID": "70",
    "Body": "Some of the commentators see in this verse a divine\\n\\t\\t\\t\\tprediction, thus: \"If there be twenty of you..., they\\n\\t\\t\\t\\tshall overcome two hundred...\", etc. Since, however,\\n\\t\\t\\t\\thistory shows that the believers, even at the time of the\\n\\t\\t\\t\\tProphet, were not always victorious against such odds,\\n\\t\\t\\t\\tthe above view is not tenable. In order to understand\\n\\t\\t\\t\\tthis passage correctly, we must read it in close\\n\\t\\t\\t\\tconjunction with the opening sentence, \"Inspire the\\n\\t\\t\\t\\tbelievers to conquer all fear of death\", whereupon we\\n\\t\\t\\t\\tarrive at the meaning given in my rendering: namely, an\\n\\t\\t\\t\\texhortation to the believers to conquer all fear of death\\n\\t\\t\\t\\tand to be so patient in adversity that they might be able\\n\\t\\t\\t\\tto overcome an enemy many times their number (Razi; see\\n\\t\\t\\t\\talso Manar X, 87). The concluding words of this verse -\\n\\t\\t\\t\\t\"because they are people who cannot grasp it [i.e., the\\n\\t\\t\\t\\ttruth]\" - can be understood in either of two ways: (a) as\\n\\t\\t\\t\\tgiving an additional reason of the true believers'\\n\\t\\t\\t\\tsuperiority over \"those who are bent on denying the\\n\\t\\t\\t\\ttruth\" (alladhina kafaru), inasmuch as the latter, not\\n\\t\\t\\t\\tbelieving in the eternal verities and in life after\\n\\t\\t\\t\\tdeath, cannot rise to that enthusiasm and readiness for\\n\\t\\t\\t\\tself-sacrifice which distinguishes the true believers; or\\n\\t\\t\\t\\t(b) as explaining that \"those who are bent on denying the\\n\\t\\t\\t\\ttruth\" deny it simply because their spiritual deafness\\n\\t\\t\\t\\tand blindness prevents them from grasping it. To my mind,\\n\\t\\t\\t\\tthe second of these two interpretations is preferable,\\n\\t\\t\\t\\tand particularly so in view of the fact that the Qur'an\\n\\t\\t\\t\\toften explains in these terms the attitude of \"those who\\n\\t\\t\\t\\tdeny the truth\" (e.g., in  6:25 ,  7:179 ,  9:87 , etc.)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "66",
    "NoteID": "71",
    "Body": "This relates to the time at which the above verse was\\n\\t\\t\\t\\trevealed, namely, immediately after the battle of Badr (2\\n\\t\\t\\t\\tH.), when the Muslims were extremely weak both in numbers\\n\\t\\t\\t\\tand in equipment, and their community had not yet\\n\\t\\t\\t\\tattained to any significant degree of political\\n\\t\\t\\t\\torganization. Under those circumstances, the Qur'an says,\\n\\t\\t\\t\\tthey could not - nor could any Muslim community of later\\n\\t\\t\\t\\ttimes, in similar circumstances - be expected to bring\\n\\t\\t\\t\\tforth the effort and the efficiency required of a fully\\n\\t\\t\\t\\tdeveloped community of believers; but even so they should\\n\\t\\t\\t\\tbe able to stand up to an enemy twice their number. (The\\n\\t\\t\\t\\tproportions one to two, or - as in the preceding verse,\\n\\t\\t\\t\\tone to ten - are not, of course, to be taken literally;\\n\\t\\t\\t\\tas a matter of fact, the Muslims defeated at Badr a much\\n\\t\\t\\t\\tbetter armed army more than thrice their own number.) The\\n\\t\\t\\t\\treference to God's having \"lightened the burden\" imposed\\n\\t\\t\\t\\ton the believers in this respect makes it clear that both\\n\\t\\t\\t\\tthis and the preceding verse imply a divine command\\n\\t\\t\\t\\tcouched in terms of exhortation, and not a prediction of\\n\\t\\t\\t\\tevents to come (Razi)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "67",
    "NoteID": "72",
    "Body": "I.e., as an aftermath of a war in a just cause. As almost\\n\\t\\t\\t\\talways in the Qur'an, an injunction addressed to the\\n\\t\\t\\t\\tProphet is, by implication, binding on his followers as\\n\\t\\t\\t\\twell. Consequently, the above verse lays down that no\\n\\t\\t\\t\\tperson may be taken, or for any time retained, in\\n\\t\\t\\t\\tcaptivity unless he was taken prisoner in a jihad - that\\n\\t\\t\\t\\tis, a holy war in defence of the Faith or of freedom\\n\\t\\t\\t\\t(regarding which see surah {2}, note [167]) - and that,\\n\\t\\t\\t\\ttherefore, the acquisition of a slave by \"peaceful\"\\n\\t\\t\\t\\tmeans, and the keeping of a slave thus acquired, is\\n\\t\\t\\t\\tentirely prohibited: which, to all practical purposes,\\n\\t\\t\\t\\tamounts to a prohibition of slavery as a \"social\\n\\t\\t\\t\\tinstitution\". But even with regard to captives taken in\\n\\t\\t\\t\\twar, the Qur'an ordains (in  47:4 ) that they should be\\n\\t\\t\\t\\tfreed after the war is over."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "68",
    "NoteID": "73",
    "Body": "This is apparently a reference to the captives taken by\\n\\t\\t\\t\\tthe Muslims at Badr, and the discussions among the\\n\\t\\t\\t\\tProphet's followers as to what should be done with them.\\n\\t\\t\\t\\t'Umar ibn al-Khattab was of the opinion that they should\\n\\t\\t\\t\\tbe killed in revenge for their past misdeeds, and in\\n\\t\\t\\t\\tparticular for their persecution of the Muslims before\\n\\t\\t\\t\\tthe latters' exodus to Medina; Abu Bakr, on the other\\n\\t\\t\\t\\thand, pleaded for forgiveness and a release of the\\n\\t\\t\\t\\tprisoners against ransom, supporting his plea with the\\n\\t\\t\\t\\targument that such an act of mercy might induce some of\\n\\t\\t\\t\\tthem to realize the truth of Islam. The Prophet adopted\\n\\t\\t\\t\\tthe course of action advocated by Abu Bakr, and released\\n\\t\\t\\t\\tthe captives. (The relevant Traditions are quoted by most\\n\\t\\t\\t\\tof the commentators, and especially - with full\\n\\t\\t\\t\\tindication of the sources - by Tabari and Ibn Kathir.)\\n\\t\\t\\t\\tThe reference in the above verse to the \"tremendous\\n\\t\\t\\t\\tchastisement\" that might have befallen the Muslims \"but\\n\\t\\t\\t\\tfor a decree (kitab) from God that had already gone\\n\\t\\t\\t\\tforth\" - i.e., a course of action fore-ordained in God's\\n\\t\\t\\t\\tknowledge - makes it clear that the killing of the\\n\\t\\t\\t\\tcaptives would have been an awesome sin."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "70",
    "NoteID": "74",
    "Body": "I.e., \"If God finds in your hearts a disposition to\\n\\t\\t\\t\\trealize the truth of His message, He will bestow on you\\n\\t\\t\\t\\tfaith and, thus, the good of the life to come: and this\\n\\t\\t\\t\\twill outweigh by far your defeat in war and the loss of\\n\\t\\t\\t\\tso many of your friends and companions.\" Although these\\n\\t\\t\\t\\twords relate primarily to the pagan Quraysh taken\\n\\t\\t\\t\\tprisoner in the battle of Badr, they circumscribe the\\n\\t\\t\\t\\tIslamic attitude towards all unbelieving enemies who\\n\\t\\t\\t\\tmight fall into the believers' hands in the course of\\n\\t\\t\\t\\twar. For a further discussion of the problem of prisoners\\n\\t\\t\\t\\tof war, see  47:4 ."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "71",
    "NoteID": "75",
    "Body": "I.e., by falsely pretending to a change of heart and an\\n\\t\\t\\t\\tacceptance of Islam in order to be freed from the\\n\\t\\t\\t\\tobligation of paying ransom."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "71",
    "NoteID": "76",
    "Body": "Sc., \"and He can, if He so wills, do it again\". Thus, the\\n\\t\\t\\t\\tMuslims are enjoined, by implication, to accept the\\n\\t\\t\\t\\tdeclarations of the captives at their face value, and not\\n\\t\\t\\t\\tto be swayed by mere suspicion of their motives. The\\n\\t\\t\\t\\tpossibility of treachery on the part of those captives,\\n\\t\\t\\t\\tand even a later discovery that some of them had indeed\\n\\t\\t\\t\\tplayed false, should not induce the Muslims to deviate\\n\\t\\t\\t\\tfrom the course ordained by God."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "72",
    "NoteID": "77",
    "Body": "See surah {2}, note [203]. Historically, this expression\\n\\t\\t\\t\\trelates to the Meccan Muslims who migrated with the\\n\\t\\t\\t\\tProphet to Medina; but the sequence makes it clear that\\n\\t\\t\\t\\tthe definitions and injunctions provided by this verse\\n\\t\\t\\t\\tare in the nature of a general law, valid for all times.\\n\\t\\t\\t\\tWith all this, it should be noted that the hijrah\\n\\t\\t\\t\\treferred to here has a preponderantly physical\\n\\t\\t\\t\\tconnotation, implying an emigration from a non-Muslim\\n\\t\\t\\t\\tcountry to a country ruled by the Law of Islam."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "72",
    "NoteID": "78",
    "Body": "This refers, in the first instance, to the ansar at\\n\\t\\t\\t\\tMedina - that is, to the newly-converted Muslims of that\\n\\t\\t\\t\\ttown, who gave shelter and whole-hearted aid to the\\n\\t\\t\\t\\tmuhajirin (\"emigrants\") from Mecca before and after the\\n\\t\\t\\t\\tProphet's own migration thither: but, similar to the\\n\\t\\t\\t\\tspiritual meaning attaching to the terms hijrah and\\n\\t\\t\\t\\tmuhajir, the expression ansar transcends its purely\\n\\t\\t\\t\\thistorical connotation and applies to all believers who\\n\\t\\t\\t\\taid and give comfort to \"those who flee from evil unto\\n\\t\\t\\t\\tGod\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "72",
    "NoteID": "79",
    "Body": "I.e., those Muslims who, for some reason or other, remain\\n\\t\\t\\t\\toutside the political jurisdiction of the Islamic state.\\n\\t\\t\\t\\tSince not every non-Muslim country is necessarily a\\n\\t\\t\\t\\t\"domain of evil\", I am rendering the phrase wa-lam\\n\\t\\t\\t\\tyuhajiru as \"without having migrated [to your country]\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "72",
    "NoteID": "80",
    "Body": "Lit., \"to succour them in religion\": implying that they\\n\\t\\t\\t\\tare exposed to persecution on account of their religious\\n\\t\\t\\t\\tbeliefs."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "72",
    "NoteID": "81",
    "Body": "I.e., a treaty of alliance or of non-interference in each\\n\\t\\t\\t\\tother's internal affairs. Since in such cases an armed\\n\\t\\t\\t\\tintervention of the Islamic state in behalf of the Muslim\\n\\t\\t\\t\\tcitizens of a non-Muslim state would constitute a breach\\n\\t\\t\\t\\tof treaty obligations, the Islamic state is not allowed\\n\\t\\t\\t\\tto seek redress by force. A solution of the problem could\\n\\t\\t\\t\\tconceivably be brought about by negotiations between the\\n\\t\\t\\t\\ttwo states or, alternatively, by an emigration of the\\n\\t\\t\\t\\tpersecuted Muslims."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "73",
    "NoteID": "82",
    "Body": "The fact of their being bent on denying the truth of the\\n\\t\\t\\t\\tdivine message constitutes, as it were, a common\\n\\t\\t\\t\\tdenominator between them, and precludes the possibility\\n\\t\\t\\t\\tof their ever being real friends to the believers. This\\n\\t\\t\\t\\trefers, of course, to relations between communities, and\\n\\t\\t\\t\\tnot necessarily between individuals: hence my rendering\\n\\t\\t\\t\\tof the term awliya', in this context, as \"allies\"."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "74",
    "NoteID": "83",
    "Body": "See note [5] on verse {4} of this surah."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "75",
    "NoteID": "84",
    "Body": "Although the expression alladhina amanu (lit., \"those who\\n\\t\\t\\t\\thave come to believe\") is in the past tense, the words\\n\\t\\t\\t\\tmin ba'd (\"afterwards\" or \"henceforth\") indicate a future\\n\\t\\t\\t\\ttime in relation to the time at which this verse was\\n\\t\\t\\t\\trevealed: hence, the whole sentence beginning with\\n\\t\\t\\t\\talladhina amanu must be understood as referring to the\\n\\t\\t\\t\\tfuture (Manar X, 134f.; see also Razi's commentary on\\n\\t\\t\\t\\tthis verse)."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "75",
    "NoteID": "85",
    "Body": "I.e., they, too, shall belong to the brotherhood of\\n\\t\\t\\t\\tIslam, in which the faith held in common supplies the\\n\\t\\t\\t\\tdecisive bond between believer and believer."
  },
  {
    "SurahNumber": "8",
    "AyahNumber": "75",
    "NoteID": "86",
    "Body": "The classical commentators are of the opinion that this\r\\n\\t\\t\\t\\tlast clause refers to actual family relations, as\r\\n\\t\\t\\t\\tdistinct from the spiritual brotherhood based on a\r\\n\\t\\t\\t\\tcommunity of faith. According to these commentators, the\r\\n\\t\\t\\t\\tabove sentence abolished the custom which was prevalent\r\\n\\t\\t\\t\\tamong the early Muslims, whereby the ansar (\"the helpers\"\r\\n\\t\\t\\t\\t- i.e., the newly-converted Muslims of Medina) concluded,\r\\n\\t\\t\\t\\tindividually, symbolic ties of brotherhood with the\r\\n\\t\\t\\t\\tmuhajirin (\"the emigrants\" from Mecca), who, almost\r\\n\\t\\t\\t\\twithout exception, arrived at Medina in a state of\r\\n\\t\\t\\t\\tcomplete destitution: ties of brotherhood, that is, which\r\\n\\t\\t\\t\\tentitled every muhajir to a share in the property of his\r\\n\\t\\t\\t\\t\"brother\" from among the ansar, and, in the event of the\r\\n\\t\\t\\t\\tlatter's death, to a share in the inheritance left by\r\\n\\t\\t\\t\\thim. The above verse is said to have prohibited such\r\\n\\t\\t\\t\\tarrangements by stipulating that only actual close\r\\n\\t\\t\\t\\trelations should henceforth have a claim to inheritance.\r\\n\\t\\t\\t\\tTo my mind, however, this interpretation is not\r\\n\\t\\t\\t\\tconvincing. Although the expression ulu 'l-arham is\r\\n\\t\\t\\t\\tderived from the noun rahm (also spelt rihm and rahim),\r\\n\\t\\t\\t\\twhich literally signifies \"womb\", one should not forget\r\\n\\t\\t\\t\\tthat it is tropically used in the sense of \"kinship\",\r\\n\\t\\t\\t\\t\"relationship\" or \"close relationship\" in general (i.e.,\r\\n\\t\\t\\t\\tnot merely blood-relationship). Thus, \"in the classical\r\\n\\t\\t\\t\\tlanguage, ulu 'l-arham means any relations: and in law,\r\\n\\t\\t\\t\\tany relations that have no portion [of the inheritances\r\\n\\t\\t\\t\\ttermed fara'id]\" (Lane III, 1056, citing, among other\r\\n\\t\\t\\t\\tauthorities, the Taj al-'Arus). In the present instance,\r\\n\\t\\t\\t\\tthe reference to \"close relations\" comes at the end of a\r\\n\\t\\t\\t\\tpassage which centres on the injunction that the\r\\n\\t\\t\\t\\tbelievers must be \"the friends and protectors (awliya')\r\\n\\t\\t\\t\\tof one another\", and that all later believers shall,\r\\n\\t\\t\\t\\tsimilarly, be regarded as members of the Islamic\r\\n\\t\\t\\t\\tbrotherhood. If the reference to \"close relations\" were\r\\n\\t\\t\\t\\tmeant to be taken in its literal sense and conceived as\r\\n\\t\\t\\t\\talluding to laws of inheritance, it would be quite out of\r\\n\\t\\t\\t\\ttune with the rest of the passage, which stresses the\r\\n\\t\\t\\t\\tbonds of faith among true believers, as well as the moral\r\\n\\t\\t\\t\\tobligations arising from these bonds. In my opinion,\r\\n\\t\\t\\t\\ttherefore, the above verse has no bearing on laws of\r\\n\\t\\t\\t\\tinheritance, but is meant to summarize, as it were, the\r\\n\\t\\t\\t\\tlesson of the preceding verses: All true believers, of\r\\n\\t\\t\\t\\tall times, form one single community in the deepest sense\r\\n\\t\\t\\t\\tof this word; and all who are thus closely related in\r\\n\\t\\t\\t\\tspirit have the highest claim on one another in\r\\n\\t\\t\\t\\taccordance with God's decree that \"all believers are\r\\n\\t\\t\\t\\tbrethren\" ( 49:10 )."
  }
]
