[
  {
    "SurahNumber": "102",
    "AyahNumber": "1",
    "NoteID": "6257",
    "Body": "Acquisitiveness, that is, the passion for seeking an\\n\\t\\t\\t\\tincrease in wealth, position, the number of adherents or\\n\\t\\t\\t\\tfollowers or supporters, mass production and mass\\n\\t\\t\\t\\torganisation, may affect an individual as such, or it may\\n\\t\\t\\t\\taffect whole societies or nations. Other people's example\\n\\t\\t\\t\\tor rivalry in such things may aggravate the situation. Up\\n\\t\\t\\t\\tto a certain point it may be good and necessary. But when\\n\\t\\t\\t\\tit becomes inordinate and monopolises attention, it\\n\\t\\t\\t\\tleaves no time for higher things in life, and a clear\\n\\t\\t\\t\\twarning is here sounded from a moral point of view. Man\\n\\t\\t\\t\\tmay be engrossed in these things till death approaches,\\n\\t\\t\\t\\tand he looks back on a wasted life, as far as the higher\\n\\t\\t\\t\\tthings are concerned."
  },
  {
    "SurahNumber": "102",
    "AyahNumber": "2",
    "NoteID": "6258",
    "Body": "That is, until the time comes when you must lie down in\\n\\t\\t\\t\\tthe graves and leave and pomp and circumstance of an\\n\\t\\t\\t\\tempty life. The true Reality will then appear before you.\\n\\t\\t\\t\\tWhy not try to strive for a little understanding of that\\n\\t\\t\\t\\tReality in this very life?"
  },
  {
    "SurahNumber": "102",
    "AyahNumber": "5",
    "NoteID": "6259",
    "Body": "Three kinds of yaqin (certainty of knowledge) are\\n\\t\\t\\t\\tdescribed in n. 5673 to lxix. 51. The first is certainty\\n\\t\\t\\t\\tof mind or inference mentioned here: we hear from\\n\\t\\t\\t\\tsomeone, or we infer from something we know: this refers\\n\\t\\t\\t\\tto our own state of mind. If we instruct our minds in\\n\\t\\t\\t\\tthis way, we should value the deeper things of life\\n\\t\\t\\t\\tbetter, and not waste all our time in ephemeral things.\\n\\t\\t\\t\\tBut if we do not use our reasoning faculties now, we\\n\\t\\t\\t\\tshall yet see with our own eyes, the Penalty for our\\n\\t\\t\\t\\tsins. It will be certainty of sight. We shall see Hell.\\n\\t\\t\\t\\tSee next verse. But the absolute certainty of assured\\n\\t\\t\\t\\tTruth is that described in lxix. 51. That is not liable\\n\\t\\t\\t\\tto any human error or psychological defects."
  },
  {
    "SurahNumber": "102",
    "AyahNumber": "6",
    "NoteID": "6260",
    "Body": "See xix. 71-72, and n. 2518."
  },
  {
    "SurahNumber": "102",
    "AyahNumber": "8",
    "NoteID": "6261",
    "Body": "We shall be questioned, i.e., we shall be held\\n\\t\\t\\t\\tresponsible for every kind of joy we indulge in-whether\\n\\t\\t\\t\\tit was false pride or delight in things of no value, or\\n\\t\\t\\t\\tthings evil, or the enjoyment of things legitimate,-the\\n\\t\\t\\t\\tlast, to see whether we kept this within reasonable\\n\\t\\t\\t\\tbounds."
  }
]
