[
    {
        "type": "hadith",
        "name": "Sahih-Muslim",
        "bookCode": "SHM",
        "bookNo": "25",
        "bookName": "Book of Wills",
        "bookNameArabic": "كتاب الوصية",
        "hadiths": [
            {
                "hadithNo": "4204",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Ibn 'Umar that the Messenger of Allah (s.a.w) said: \"It is not right for a Muslim man who has anything that he wants to bequeath, to stay for more than two nights without having his will written with him.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِىُّ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا يَحْيَى - وَهُوَ ابْنُ سَعِيدٍ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِى نَافِعٌ عَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَىْءٌ يُرِيدُ أَنْ يُوصِىَ فِيهِ يَبِيتُ لَيْلَتَيْنِ إِلاَّ وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ »."
            },
            {
                "hadithNo": "4205",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from 'Ubaidullah (a Hadith similar to no. 4204) with this chain, except that they (the narrators) said: \"Who has anything to be bequeathed.\" And they did not say, \"Anything that he wants to bequeath.\"",
                "hadithArabic": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنِى أَبِى كِلاَهُمَا عَنْ عُبَيْدِ اللَّهِ بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُمَا قَالاَ « وَلَهُ شَىْءٌ يُوصِى فِيهِ ». وَلَمْ يَقُولاَ « يُرِيدُ أَنْ يُوصِىَ فِيهِ »."
            },
            {
                "hadithNo": "4206",
                "chapterNo": "0",
                "hadithEnglish": "A Hadith like that of 'Ubaidullah (no. 4205) was narrated from Nafi' from Ibn 'Umar, from the Prophet (s.a.w), and they said: \"Who has anything to be bequeathed.\" But in the Hadith of Ayyub it says: \"that he wants to bequeath,\" like the report of Yahya from 'Ubaidullah.",
                "hadithArabic": "وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِىُّ حَدَّثَنَا حَمَّادٌ يَعْنِى ابْنَ زَيْدٍ ح وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَاعِيلُ - يَعْنِى ابْنَ عُلَيَّةَ - كِلاَهُمَا عَنْ أَيُّوبَ ح وَحَدَّثَنِى أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ ح وَحَدَّثَنِى هَارُونُ بْنُ سَعِيدٍ الأَيْلِىُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِى أُسَامَةُ بْنُ زَيْدٍ اللَّيْثِىُّ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِى فُدَيْكٍ أَخْبَرَنَا هِشَامٌ - يَعْنِى ابْنَ سَعْدٍ - كُلُّهُمْ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنِ النَّبِىِّ -صلى الله عليه وسلم-. بِمِثْلِ حَدِيثِ عُبَيْدِ اللَّهِ وَقَالُوا جَمِيعًا « لَهُ شَىْءٌ يُوصِى فِيهِ ». إِلاَّ فِى حَدِيثِ أَيُّوبَ فَإِنَّهُ قَالَ « يُرِيدُ أَنْ يُوصِىَ فِيهِ ». كَرِوَايَةِ يَحْيَى عَنْ عُبَيْدِ اللَّهِ."
            },
            {
                "hadithNo": "4207",
                "chapterNo": "0",
                "hadithEnglish": "It was narrated from Salim, from his father, that he heard the Messenger of Allah (s.a.w) say: \"It is not right for a Muslim man who has anything to be bequeathed to stay for three nights without having his will written down with him.\" 'Abdullah bin 'Umar said: \"Since I heard the Messenger of Allah (s.a.w) say that, no night passed but I had my will with me.\"",
                "hadithArabic": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِى عَمْرٌو - وَهْوَ ابْنُ الْحَارِثِ - عَنِ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَىْءٌ يُوصِى فِيهِ يَبِيتُ ثَلاَثَ لَيَالٍ إِلاَّ وَوَصِيَّتُهُ عِنْدَهُ مَكْتُوبَةٌ ». قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ مَا مَرَّتْ عَلَىَّ لَيْلَةٌ مُنْذُ سَمِعْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ ذَلِكَ إِلاَّ وَعِنْدِى وَصِيَّتِى."
            },
            {
                "hadithNo": "4208",
                "chapterNo": "0",
                "hadithEnglish": "A Hadith like that of 'Amr bin Al-Harith (no. 4207) was narrated from Az-Zuhri with this chain.",
                "hadithArabic": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ ح وَحَدَّثَنِى عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِى أَبِى عَنْ جَدِّى حَدَّثَنِى عُقَيْلٌ ح وَحَدَّثَنَا ابْنُ أَبِى عُمَرَ وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كُلُّهُمْ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ. نَحْوَ حَدِيثِ عَمْرِو بْنِ الْحَارِثِ."
            },
            {
                "hadithNo": "4209",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from 'Amir bin Sa'd that his father said: \"The Messenger of Allah (s.a.w) visited me during the Farewell Pilgrimage, when I fell sick with a sickness that brought me close to death. I said: 'O Messenger of Allah, you can see how bad my sickness is, and I am wealthy, and no one will inherit from me except one daughter of mine. Can I give two-thirds of my wealth in charity?' He said: 'No.' I said: 'Can I give half of it in charity?' He said: 'No. (Give) one-third, and one-third is a lot. If you leave your heirs rich and wealthy, that is better for them than leaving them dependent and asking from people. You will never spend on maintenance, seeking thereby the Face of Allah, but you will be rewarded for it, even a morsel that you put in your wife's mouth.' I said: 'O Messenger of Allah, will I be left behind my companions?' He said: 'You will never be left behind by them and do a good deed, seeking thereby the Face of Allah, but it will increase you in status. Perhaps you will live until some people benefit from you and others are harmed by you. O Allah, complete the emigration of my Companions and do not cause them to tum back on their heels.' How unfortunate Sa'd bin Khawlah was.'\" He said: \"The Messenger of Allah (s.a.w) felt sorry for him because he died in Makkah.''",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنِ ابْنِ شِهَابٍ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَ عَادَنِى رَسُولُ اللَّهِ -صلى الله عليه وسلم- فِى حَجَّةِ الْوَدَاعِ مِنْ وَجَعٍ أَشْفَيْتُ مِنْهُ عَلَى الْمَوْتِ فَقُلْتُ يَا رَسُولَ اللَّهِ بَلَغَنِى مَا تَرَى مِنَ الْوَجَعِ وَأَنَا ذُو مَالٍ وَلاَ يَرِثُنِى إِلاَّ ابْنَةٌ لِى وَاحِدَةٌ أَفَأَتَصَدَّقُ بِثُلُثَىْ مَالِى قَالَ « لاَ ». قَالَ قُلْتُ أَفَأَتَصَدَّقُ بِشَطْرِهِ قَالَ « لاَ الثُّلُثُ وَالثُّلُثُ كَثِيرٌ إِنَّكَ أَنْ تَذَرَ وَرَثَتَكَ أَغْنِيَاءَ خَيْرٌ مِنْ أَنْ تَذَرَهُمْ عَالَةً يَتَكَفَّفُونَ النَّاسَ وَلَسْتَ تُنْفِقُ نَفَقَةً تَبْتَغِى بِهَا وَجْهَ اللَّهِ إِلاَّ أُجِرْتَ بِهَا حَتَّى اللُّقْمَةُ تَجْعَلُهَا فِى فِى امْرَأَتِكَ ». قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أُخَلَّفُ بَعْدَ أَصْحَابِى قَالَ « إِنَّكَ لَنْ تُخَلَّفَ فَتَعْمَلَ عَمَلاً تَبْتَغِى بِهِ وَجْهَ اللَّهِ إِلاَّ ازْدَدْتَ بِهِ دَرَجَةً وَرِفْعَةً وَلَعَلَّكَ تُخَلَّفُ حَتَّى يُنْفَعَ بِكَ أَقْوَامٌ وَيُضَرَّ بِكَ آخَرُونَ اللَّهُمَّ أَمْضِ لأَصْحَابِى هِجْرَتَهُمْ وَلاَ تَرُدَّهُمْ عَلَى أَعْقَابِهِمْ لَكِنِ الْبَائِسُ سَعْدُ ابْنُ خَوْلَةَ ». قَالَ رَثَى لَهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- مِنْ أَنْ تُوُفِّىَ بِمَكَّةَ."
            },
            {
                "hadithNo": "4210",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 4209) was narrated with this chain.",
                "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح وَحَدَّثَنِى أَبُو الطَّاهِرِ وَحَرْمَلَةُ قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِى يُونُسُ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كُلُّهُمْ عَنِ الزُّهْرِىِّ بِهَذَا الإِسْنَادِ نَحْوَهُ."
            },
            {
                "hadithNo": "4211",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Sa'd said: \"The Prophet (s.a.w) entered upon me to visit me (when I was sick)...\" and he narrated a Hadith like that of Az-Zuhri (no. 4210), but he did not mention what the Prophet (s.a.w) said about Sa'd bin Khawlah, but he said: \"He did not want to die in a land from which he had emigrated.''",
                "hadithArabic": "وَحَدَّثَنِى إِسْحَاقُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِىُّ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ سَعْدٍ قَالَ دَخَلَ النَّبِىُّ -صلى الله عليه وسلم- عَلَىَّ يَعُودُنِى. فَذَكَرَ بِمَعْنَى حَدِيثِ الزُّهْرِىِّ وَلَمْ يَذْكُرْ قَوْلَ النَّبِىِّ -صلى الله عليه وسلم- فِى سَعْدِ ابْنِ خَوْلَةَ غَيْرَ أَنَّهُ قَالَ وَكَانَ يَكْرَهُ أَنْ يَمُوتَ بِالأَرْضِ الَّتِى هَاجَرَ مِنْهَا."
            },
            {
                "hadithNo": "4212",
                "chapterNo": "1",
                "hadithEnglish": "Mus'ab bin Sa'd narrated that his father said: \"I fell sick and I sent word to the Prophet (s.a.w). I said: 'Let me divide my wealth as I wish,' but he refused. I said: 'Then half?' And he refused. I said: 'Then one-third?\"' He (the narrator) said: \"He remained silent after one-third.\" He said: \"After that, one-third was permissible.\"",
                "hadithArabic": "وَحَدَّثَنِى زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ حَدَّثَنِى مُصْعَبُ بْنُ سَعْدٍ عَنْ أَبِيهِ قَالَ مَرِضْتُ فَأَرْسَلْتُ إِلَى النَّبِىِّ -صلى الله عليه وسلم- فَقُلْتُ دَعْنِى أَقْسِمْ مَالِى حَيْثُ شِئْتُ فَأَبَى. قُلْتُ فَالنِّصْفُ فَأَبَى. قُلْتُ فَالثُّلُثُ قَالَ فَسَكَتَ بَعْدَ الثُّلُثِ. قَالَ فَكَانَ بَعْدُ الثُّلُثُ جَائِزًا."
            },
            {
                "hadithNo": "4213",
                "chapterNo": "1",
                "hadithEnglish": "A similar report (as no. 4212) was narrated from Simak with, but he did not say: \"After that, one-third was permissible.\"",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ بِهَذَا الإِسْنَادِ نَحْوَهُ. وَلَمْ يَذْكُرْ فَكَانَ بَعْدُ الثُّلُثُ جَائِزًا."
            },
            {
                "hadithNo": "4214",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from Mus'ab bin Sa'd that his father said: \"The Prophet (s.a.w) visited me (when I was sick) and I said: 'I will bequeath all my wealth.' He said: 'No.' I said: 'Then one-half.' He said: 'No.' I said: 'One-third?' He said: 'Yes, but one-third is a lot.\"'",
                "hadithArabic": "وَحَدَّثَنِى الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِىٍّ عَنْ زَائِدَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ مُصْعَبِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَ عَادَنِى النَّبِىُّ -صلى الله عليه وسلم- فَقُلْتُ أُوصِى بِمَالِى كُلِّهِ. قَالَ « لاَ ». قُلْتُ فَالنِّصْفُ. قَالَ « لاَ ». فَقُلْتُ أَبِالثُّلُثِ فَقَالَ « نَعَمْ وَالثُّلُثُ كَثِيرٌ »."
            },
            {
                "hadithNo": "4215",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated from three of the sons of Sa'd, from their father, that the Prophet (s.a.w) entered upon Sa'd to visit him (when he was sick) in Makkah, and he wept. He said: \"Why are you weeping?\" He said: \"I am afraid that I will die in the land from which I emigrated, as Sa'd bin Khawlah died.\" The Prophet (s.a.w) said: \"O Allah, heal Sa'd. O Allah, heal Sa'd,\" three times. He said: \"O Messenger of Allah, I have a lot of wealth, and only my daughter will inherit from me. Should I bequeath all my wealth?\" He said: \"No.\" He said: \"Then two-thirds?\" He said: \"No.\" He said: \"Then half?\" He said: \"No.\" He said: \"Then one-third?\" He said: \"One-third, but one-third is a lot. What you give of your wealth is charity, what you spend on your family is charity, what you give to . your wife to eat from your wealth is charity. If you leave your family well off, that is better for you than leaving them asking from people,\" and he gestured with his hand.",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِى عُمَرَ الْمَكِّىُّ حَدَّثَنَا الثَّقَفِىُّ عَنْ أَيُّوبَ السَّخْتِيَانِىِّ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِىِّ عَنْ ثَلاَثَةٍ مِنْ وَلَدِ سَعْدٍ كُلُّهُمْ يُحَدِّثُهُ عَنْ أَبِيهِ أَنَّ النَّبِىَّ -صلى الله عليه وسلم- دَخَلَ عَلَى سَعْدٍ يَعُودُهُ بِمَكَّةَ فَبَكَى قَالَ « مَا يُبْكِيكَ ». فَقَالَ قَدْ خَشِيتُ أَنْ أَمُوتَ بِالأَرْضِ الَّتِى هَاجَرْتُ مِنْهَا كَمَا مَاتَ سَعْدُ ابْنُ خَوْلَةَ. فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- « اللَّهُمَّ اشْفِ سَعْدًا اللَّهُمَّ اشْفِ سَعْدًا ». ثَلاَثَ مِرَارٍ. قَالَ يَا رَسُولَ اللَّهِ إِنَّ لِى مَالاً كَثِيرًا وَإِنَّمَا يَرِثُنِى ابْنَتِى أَفَأُوصِى بِمَالِى كُلِّهِ قَالَ « لاَ ».\r\nقَالَ فَبِالثُّلُثَيْنِ قَالَ « لاَ ». قَالَ فَالنِّصْفُ قَالَ « لاَ ». قَالَ فَالثُّلُثُ قَالَ « الثُّلُثُ وَالثُّلُثُ كَثِيرٌ إِنَّ صَدَقَتَكَ مِنْ مَالِكَ صَدَقَةٌ وَإِنَّ نَفَقَتَكَ عَلَى عِيَالِكَ صَدَقَةٌ وَإِنَّ مَا تَأْكُلُ امْرَأَتُكَ مِنْ مَالِكَ صَدَقَةٌ وَإِنَّكَ أَنْ تَدَعَ أَهْلَكَ بِخَيْرٍ - أَوْ قَالَ بِعَيْشٍ - خَيْرٌ مِنْ أَنْ تَدَعَهُمْ يَتَكَفَّفُونَ النَّاسَ ». وَقَالَ بِيَدِهِ."
            },
            {
                "hadithNo": "4216",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that three of the sons of Sa'd said: \"Sa'd fell sick in Makkah, and the Messenger of Allah (s.a.w) came to visit him...\" a Hadith like that of Ath-Thaqafi (no. 4215).",
                "hadithArabic": "وَحَدَّثَنِى أَبُو الرَّبِيعِ الْعَتَكِىُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِىِّ عَنْ ثَلاَثَةٍ مِنْ وَلَدِ سَعْدٍ قَالُوا مَرِضَ سَعْدٌ بِمَكَّةَ فَأَتَاهُ رَسُولُ اللَّهِ -صلى الله عليه وسلم- يَعُودُهُ. بِنَحْوِ حَدِيثِ الثَّقَفِىِّ."
            },
            {
                "hadithNo": "4217",
                "chapterNo": "1",
                "hadithEnglish": "Three of the sons of Sa'd bin Malik narrated, each of them narrating a Hadith like that of the others, that Sa'd fell sick in Makkah and the Prophet (s.a.w) came to visit him... a Hadith like that of 'Amr bin Sa'eed from Humaid Al-Himyari (no. 4215).",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الأَعْلَى حَدَّثَنَا هِشَامٌ عَنْ مُحَمَّدٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ حَدَّثَنِى ثَلاَثَةٌ مِنْ وَلَدِ سَعْدِ بْنِ مَالِكٍ كُلُّهُمْ يُحَدِّثُنِيهِ بِمِثْلِ حَدِيثِ صَاحِبِهِ فَقَالَ مَرِضَ سَعْدٌ بِمَكَّةَ فَأَتَاهُ النَّبِىُّ -صلى الله عليه وسلم- يَعُودُهُ. بِمِثْلِ حَدِيثِ عَمْرِو بْنِ سَعِيدٍ عَنْ حُمَيْدٍ الْحِمْيَرِىِّ."
            },
            {
                "hadithNo": "4218",
                "chapterNo": "1",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: \"Would that the people would reduce it from one-third to one-quarter, for the Messenger of Allah (s.a.w) said: 'One-third, and one-third is a lot.\"'",
                "hadithArabic": "حَدَّثَنِى إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِىُّ أَخْبَرَنَا عِيسَى يَعْنِى ابْنَ يُونُسَ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ نُمَيْرٍ كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنِ ابْنِ عَبَّاسٍ قَالَ لَوْ أَنَّ النَّاسَ غَضُّوا مِنَ الثُّلُثِ إِلَى الرُّبُعِ فَإِنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « الثُّلُثُ وَالثُّلُثُ كَثِيرٌ ». وَفِى حَدِيثِ وَكِيعٍ « كَبِيرٌ أَوْ كَثِيرٌ »."
            },
            {
                "hadithNo": "4219",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Abu Hurairah that a man said to the Prophet (s.a.w): \"My father died and he left behind some wealth but he did not make a will. Will it expiate for him if charity is given on his behalf?\" He said: \"Yes.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَعَلِىُّ بْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَجُلاً قَالَ لِلنَّبِىِّ -صلى الله عليه وسلم- إِنَّ أَبِى مَاتَ وَتَرَكَ مَالاً وَلَمْ يُوصِ فَهَلْ يُكَفِّرُ عَنْهُ أَنْ أَتَصَدَّقَ عَنْهُ قَالَ « نَعَمْ »."
            },
            {
                "hadithNo": "4220",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Aishah that a man said to the Prophet (s.a.w): \"My mother died suddenly and I think that if she could have spoken, she would have given charity. Will I have a reward if I give charity on her behalf?\" He said: \"Yes.\"",
                "hadithArabic": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ أَخْبَرَنِى أَبِى عَنْ عَائِشَةَ أَنَّ رَجُلاً قَالَ لِلنَّبِىِّ -صلى الله عليه وسلم- إِنَّ أُمِّىَ افْتُلِتَتْ نَفْسُهَا وَإِنِّى أَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ فَلِىَ أَجْرٌ أَنْ أَتَصَدَّقَ عَنْهَا قَالَ « نَعَمْ »."
            },
            {
                "hadithNo": "4221",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from 'Aishah that a man came to the Prophet (s.a.w) and said: \"O Messenger of Allah, my mother died suddenly and she did not leave a will. I think that if she could have spoken she would have given charity. Will she have a reward if I give charity on her behalf?\" He said: \"Yes.\"",
                "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَجُلاً أَتَى النَّبِىَّ -صلى الله عليه وسلم- فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّىَ افْتُلِتَتْ نَفْسُهَا وَلَمْ تُوصِ وَأَظُنُّهَا لَوْ تَكَلَّمَتْ تَصَدَّقَتْ أَفَلَهَا أَجْرٌ إِنْ تَصَدَّقْتُ عَنْهَا قَالَ « نَعَمْ »."
            },
            {
                "hadithNo": "4222",
                "chapterNo": "2",
                "hadithEnglish": "It was narrated from Hisham bin 'Urwah (a Hadith similar to no. 4221) with this chain. As for Abu Usamah and Rawh, in their Hadith it says: \"Will I have a reward?\" as Yahya bin Sa'eed said. As for Shu'aib and Ja'far, in their Hadith it says: \"Will she have a reward?\" as in the Hadith of Ibn Bishr.",
                "hadithArabic": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ ح وَحَدَّثَنِى الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ ح وَحَدَّثَنِى أُمَيَّةُ بْنُ بِسْطَامَ حَدَّثَنَا يَزِيدُ - يَعْنِى ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ - وَهُوَ ابْنُ الْقَاسِمِ - ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ بِهَذَا الإِسْنَادِ أَمَّا أَبُو أُسَامَةَ وَرَوْحٌ فَفِى حَدِيثِهِمَا فَهَلْ لِى أَجْرٌ كَمَا قَالَ يَحْيَى بْنُ سَعِيدٍ. وَأَمَّا شُعَيْبٌ وَجَعْفَرٌ فَفِى حَدِيثِهِمَا أَفَلَهَا أَجْرٌ كَرِوَايَةِ ابْنِ بِشْرٍ."
            },
            {
                "hadithNo": "4223",
                "chapterNo": "3",
                "hadithEnglish": "it was narrated from Abu Hurairah that the Messenger of Allah (s.a.w) said: \"When a man dies, all his good deeds come to an end except three: Ongoing charity, beneficial knowledge, or a righteous son who will pray for him.\"",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ - يَعْنِى ابْنَ سَعِيدٍ - وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ - هُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ عَنْ أَبِيهِ عَنْ أَبِى هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَالَ « إِذَا مَاتَ الإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلاَّ مِنْ ثَلاَثَةٍ إِلاَّ مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ »."
            },
            {
                "hadithNo": "4224",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated that Ibn 'Umar said: \"'Umar was given a share of land in Khaibar, and he came to the Prophet (s.a.w) to consult him about it. He said: 'O Messenger of Allah, I have been given a share of land at Khaibar and I have never been given any wealth that is more precious to me than it. What do you command me to do with it?' He said: \"If you wish, you can 'freeze' it and give it in charity.\" So 'Umar gave it in charity and stipulated that it was not to be sold, given as a gift or inherited, and he gave it in charity to the poor, relatives and slaves, for the cause of Allah and for wayfarers and guests; and there was no sin on the one appointed to look after it if he ate from it on a reasonable basis, and fed a friend without storing anything for the future.\" He said: \"I narrated this Hadith to Muhammad, when I reached the words \"without storing anything for the future,\" Muhammad said: Without storing it with a view to becoming rich. Ibn 'Awn said: \"The one who read this book, he told me, that in it are the words: 'Without storing it with a view to becoming rich.\"'",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ أَخْبَرَنَا سُلَيْمُ بْنُ أَخْضَرَ عَنِ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ أَصَابَ عُمَرُ أَرْضًا بِخَيْبَرَ فَأَتَى النَّبِىَّ -صلى الله عليه وسلم- يَسْتَأْمِرُهُ فِيهَا فَقَالَ يَا رَسُولَ اللَّهِ إِنِّى أَصَبْتُ أَرْضًا بِخَيْبَرَ لَمْ أُصِبْ مَالاً قَطُّ هُوَ أَنْفَسُ عِنْدِى مِنْهُ فَمَا تَأْمُرُنِى بِهِ قَالَ « إِنْ شِئْتَ حَبَسْتَ أَصْلَهَا وَتَصَدَّقْتَ بِهَا ». قَالَ فَتَصَدَّقَ بِهَا عُمَرُ أَنَّهُ لاَ يُبَاعُ أَصْلُهَا وَلاَ يُبْتَاعُ وَلاَ يُورَثُ وَلاَ يُوهَبُ. قَالَ فَتَصَدَّقَ عُمَرُ فِى الْفُقَرَاءِ وَفِى الْقُرْبَى وَفِى الرِّقَابِ وَفِى سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ وَالضَّيْفِ لاَ جُنَاحَ عَلَى مَنْ وَلِيَهَا أَنْ يَأْكُلَ مِنْهَا بِالْمَعْرُوفِ أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ. قَالَ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ مُحَمَّدًا فَلَمَّا بَلَغْتُ هَذَا الْمَكَانَ غَيْرَ مُتَمَوِّلٍ فِيهِ. قَالَ مُحَمَّدٌ غَيْرَ مُتَأَثِّلٍ مَالاً. قَالَ ابْنُ عَوْنٍ وَأَنْبَأَنِى مَنْ قَرَأَ هَذَا الْكِتَابَ أَنَّ فِيهِ غَيْرَ مُتَأَثِّلٍ مَالاً."
            },
            {
                "hadithNo": "4225",
                "chapterNo": "4",
                "hadithEnglish": "A similar report (as no. 4224) was narrated from Ibn 'Awn with this chain, except that in the Hadith of Ibn Abi Za'idah and Azhar it ends at the words: \"And feed a friend without storing anything for the future.\" And he did not mention what comes after that. The Hadith of Ibn Abi 'Adiyy includes what is mentioned by Sulaim: \"I narrated this Hadith to Muhammad...\"",
                "hadithArabic": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا ابْنُ أَبِى زَائِدَةَ ح وَحَدَّثَنَا إِسْحَاقُ أَخْبَرَنَا أَزْهَرُ السَّمَّانُ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِى عَدِىٍّ كُلُّهُمْ عَنِ ابْنِ عَوْنٍ بِهَذَا الإِسْنَادِ. مِثْلَهُ غَيْرَ أَنَّ حَدِيثَ ابْنِ أَبِى زَائِدَةَ وَأَزْهَرَ انْتَهَى عِنْدَ قَوْلِهِ « أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ ». وَلَمْ يُذْكَرْ مَا بَعْدَهُ. وَحَدِيثُ ابْنِ أَبِى عَدِىٍّ فِيهِ مَا ذَكَرَ سُلَيْمٌ قَوْلُهُ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ مُحَمَّدًا. إِلَى آخِرِهِ."
            },
            {
                "hadithNo": "4226",
                "chapterNo": "4",
                "hadithEnglish": "It was narrated from Ibn 'Umar that 'Umar said: \"I was given a share of the land of Khaibar, and I came to the Messenger of Allah (s.a.w) and said: 'I have been given a share of the land of Khaibar, and I have never acquired any wealth that is dearer to me or more precious than that ...\"' and he quoted a similar Hadith (as no. 4224), but he did not mention (the words): \"I narrated it to Muhammad,\" and what comes after that.",
                "hadithArabic": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِىُّ عُمَرُ بْنُ سَعْدٍ عَنْ سُفْيَانَ عَنِ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ عَنْ عُمَرَ قَالَ أَصَبْتُ أَرْضًا مِنْ أَرْضِ خَيْبَرَ فَأَتَيْتُ رَسُولَ اللَّهِ -صلى الله عليه وسلم- فَقُلْتُ أَصَبْتُ أَرْضًا لَمْ أُصِبْ مَالاً أَحَبَّ إِلَىَّ وَلاَ أَنْفَسَ عِنْدِى مِنْهَا. وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِهِمْ وَلَمْ يَذْكُرْ فَحَدَّثْتُ مُحَمَّدًا وَمَا بَعْدَهُ."
            },
            {
                "hadithNo": "4227",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Talhah bin Musarrif said: \"I asked 'Abdullah bin Abi Awfa: 'Did the Messenger of Allah (s.a.w) leave a will?' He said: 'No.' I said: 'Why is making a will prescribed for the Muslims, or why are they commanded to make wills?' He said: 'His final guidance was adherence to the Book of Allah.\"'",
                "hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِىُّ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِىٍّ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِى أَوْفَى هَلْ أَوْصَى رَسُولُ اللَّهِ -صلى الله عليه وسلم- فَقَالَ لاَ. قُلْتُ فَلِمَ كُتِبَ عَلَى الْمُسْلِمِينَ الْوَصِيَّةُ أَوْ فَلِمَ أُمِرُوا بِالْوَصِيَّةِ قَالَ أَوْصَى بِكِتَابِ اللَّهِ عَزَّ وَجَلَّ."
            },
            {
                "hadithNo": "4228",
                "chapterNo": "5",
                "hadithEnglish": "A similar report was narrated from Malik bin Maghwal (as no. 4227), except that in the Hadith of Waki' it says: \"I said: 'How come the people were commanded to make wills?\"' In the Hadith of Ibn Numair it says: \"How come it is prescribed for the Muslims to make wills?\"",
                "hadithArabic": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِى كِلاَهُمَا عَنْ مَالِكِ بْنِ مِغْوَلٍ بِهَذَا الإِسْنَادِ. مِثْلَهُ غَيْرَ أَنَّ فِى حَدِيثِ وَكِيعٍ قُلْتُ فَكَيْفَ أُمِرَ النَّاسُ بِالْوَصِيَّةِ وَفِى حَدِيثِ ابْنِ نُمَيْرٍ قُلْتُ كَيْفَ كُتِبَ عَلَى الْمُسْلِمِينَ الْوَصِيَّةُ"
            },
            {
                "hadithNo": "4229",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that 'Aishah said: \"The Messenger of Allah (s.a.w) did not leave behind a Dinar, a Dirham, a sheep nor a camel, and he did not bequeath anything.\"",
                "hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِى وَأَبُو مُعَاوِيَةَ قَالاَ حَدَّثَنَا الأَعْمَشُ عَنْ أَبِى وَائِلٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- دِينَارًا وَلاَ دِرْهَمًا وَلاَ شَاةً وَلاَ بَعِيرًا وَلاَ أَوْصَى بِشَىْءٍ."
            },
            {
                "hadithNo": "4230",
                "chapterNo": "5",
                "hadithEnglish": "A similar report (as no. 4229) was narrated from Al-A'mash with this chain.",
                "hadithArabic": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَعُثْمَانُ بْنُ أَبِى شَيْبَةَ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ كُلُّهُمْ عَنْ جَرِيرٍ ح وَحَدَّثَنَا عَلِىُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى - وَهُوَ ابْنُ يُونُسَ - جَمِيعًا عَنِ الأَعْمَشِ بِهَذَا الإِسْنَادِ. مِثْلَهُ."
            },
            {
                "hadithNo": "4231",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Al-Aswad bin Yazid said: \"They said in the presence of 'Aishah that 'Ali was bequeathed something by the Prophet (s.a.w). She said: 'When did he make a will for him? He was leaning on my chest' - or she said: 'in my lap - and he called for a bowl, then he fell into my lap and I did not realize that he had died. So when did he make a will for him?\"'",
                "hadithArabic": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ - وَاللَّفْظُ لِيَحْيَى - قَالَ أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ عَنِ ابْنِ عَوْنٍ عَنْ إِبْرَاهِيمَ عَنِ الأَسْوَدِ بْنِ يَزِيدَ قَالَ ذَكَرُوا عِنْدَ عَائِشَةَ أَنَّ عَلِيًّا كَانَ وَصِيًّا فَقَالَتْ مَتَى أَوْصَى إِلَيْهِ فَقَدْ كُنْتُ مُسْنِدَتَهُ إِلَى صَدْرِى - أَوْ قَالَتْ حَجْرِى - فَدَعَا بِالطَّسْتِ فَلَقَدِ انْخَنَثَ فِى حَجْرِى وَمَا شَعَرْتُ أَنَّهُ مَاتَ فَمَتَى أَوْصَى إِلَيْهِ؟"
            },
            {
                "hadithNo": "4232",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Sa'eed bin Jubair said: \"Ibn 'Abbas said: 'Thursday and what a Thursday!' Then he wept until his tears wet the pebbles. I said: 'O Abu 'Abbas, what about Thursday?' He said: 'The Messenger of Allah (s.a.w) took a tum for the worse, and he said: \"Come to me and I will dictate for you a document, so you will not go astray after I am gone.\" But they argued (about that), and it is not appropriate to argue in the presence of a Prophet. They said: \"What is the matter with him? Is he delirious? Try to find out what he means.\"He said: \"Let me be. The state in which I am now is better. I urge you to do three things: Expel the idolators from the Arabian Peninsula, and reward the delegations as I used to do.\" Then he remained silent about the third, or he said it, and I was caused to forget it.\"' Abu Ishaq [Ibrahim] said: \"Al-Hasan bin Bishr told us, Sufyan told us...\" this Hadith.",
                "hadithArabic": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَأَبُو بَكْرِ بْنُ أَبِى شَيْبَةَ وَعَمْرٌو النَّاقِدُ - وَاللَّفْظُ لِسَعِيدٍ - قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ الأَحْوَلِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ قَالَ ابْنُ عَبَّاسٍ يَوْمُ الْخَمِيسِ وَمَا يَوْمُ الْخَمِيسِ ثُمَّ بَكَى حَتَّى بَلَّ دَمْعُهُ الْحَصَى. فَقُلْتُ يَا ابْنَ عَبَّاسٍ وَمَا يَوْمُ الْخَمِيسِ قَالَ اشْتَدَّ بِرَسُولِ اللَّهِ -صلى الله عليه وسلم- وَجَعُهُ. فَقَالَ « ائْتُونِى أَكْتُبْ لَكُمْ كِتَابًا لاَ تَضِلُّوا بَعْدِى ». فَتَنَازَعُوا وَمَا يَنْبَغِى عِنْدَ نَبِىٍّ تَنَازُعٌ. وَقَالُوا مَا شَأْنُهُ أَهَجَرَ اسْتَفْهِمُوهُ. قَالَ « دَعُونِى فَالَّذِى أَنَا فِيهِ خَيْرٌ أُوصِيكُمْ بِثَلاَثٍ أَخْرِجُوا الْمُشْرِكِينَ مِنْ جَزِيرَةِ الْعَرَبِ وَأَجِيزُوا الْوَفْدَ بِنَحْوِ مَا كُنْتُ أُجِيزُهُمْ ». قَالَ وَسَكَتَ عَنِ الثَّالِثَةِ أَوْ قَالَهَا فَأُنْسِيتُهَا.\r\nقَالَ أَبُو إِسْحَاقَ إِبْرَاهِيمُ حَدَّثَنَا الْحَسَنُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا سُفْيَانُ بِهَذَا الْحَدِيثِ."
            },
            {
                "hadithNo": "4233",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated from Sa'd bin Jubair that Ibn 'Abbas said: \"Thursday and what a Thursday!\" Then his tears started to flow until I saw what looked like strings of pearls on his cheeks. He said: \"The Messenger of Allah (s.a.w) said: 'Bring me a shoulder blade and an inkpot' - or 'a tablet and an inkpot' - and I will dictate for you a document after which you will never go astray.' They said: 'The Messenger of Allah (s.a.w) is in a state of delirium.'\"",
                "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا وَكِيعٌ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ أَنَّهُ قَالَ يَوْمُ الْخَمِيسِ وَمَا يَوْمُ الْخَمِيسِ. ثُمَّ جَعَلَ تَسِيلُ دُمُوعُهُ حَتَّى رَأَيْتُ عَلَى خَدَّيْهِ كَأَنَّهَا نِظَامُ اللُّؤْلُؤِ. قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « ائْتُونِى بِالْكَتِفِ وَالدَّوَاةِ - أَوِ اللَّوْحِ وَالدَّوَاةِ - أَكْتُبْ لَكُمْ كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ أَبَدًا ». فَقَالُوا إِنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- يَهْجُرُ."
            },
            {
                "hadithNo": "4234",
                "chapterNo": "5",
                "hadithEnglish": "It was narrated that Ibn 'Abbas said: \"When the Messenger of Allah (s.a.w) was dying, there were men in the house among whom was 'Umar bin Al-Khattab. The Prophet (s.a.w) said: 'Come, let me dictate for you a document after which you will not go astray.' 'Umar said: 'The Messenger of Allah (s.a.w) is overcome with pain, and you have the Qur'an; the Book of Allah is sufficient for us.' The people in the house disagreed, and they argued. Some of them said: 'Come close and let the Messenger of Allah (s.a.w) dictate for you a document after which you will not go astray.' Others agreed with what 'Umar said. When their idle talk and argument in the presence of the Messenger of Allah (s.a.w) became too much, the Messenger of Allah (s.a.w) said: 'Get up and leave.'\" 'Ubaidullah said: \"Ibn 'Abbas used to say: 'What a calamity it was when the Messenger of Allah (s.a.w) was prevented from dictating that document for them because of their disagreement and noise.\"'",
                "hadithArabic": "وَحَدَّثَنِى مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ - قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ - أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِىِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ لَمَّا حُضِرَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- وَفِى الْبَيْتِ رِجَالٌ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ النَّبِىُّ -صلى الله عليه وسلم- « هَلُمَّ أَكْتُبْ لَكُمْ كِتَابًا لاَ تَضِلُّونَ بَعْدَهُ ». فَقَالَ عُمَرُ إِنَّ رَسُولَ اللَّهِ -صلى الله عليه وسلم- قَدْ غَلَبَ عَلَيْهِ الْوَجَعُ وَعِنْدَكُمُ الْقُرْآنُ حَسْبُنَا كِتَابُ اللَّهِ. فَاخْتَلَفَ أَهْلُ الْبَيْتِ فَاخْتَصَمُوا فَمِنْهُمْ مَنْ يَقُولُ قَرِّبُوا يَكْتُبْ لَكُمْ رَسُولُ اللَّهِ -صلى الله عليه وسلم- كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ. وَمِنْهُمْ مَنْ يَقُولُ مَا قَالَ عُمَرُ. فَلَمَّا أَكْثَرُوا اللَّغْوَ وَالاِخْتِلاَفَ عِنْدَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « قُومُوا ». قَالَ عُبَيْدُ اللَّهِ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ -صلى الله عليه وسلم- وَبَيْنَ أَنْ يَكْتُبَ لَهُمْ ذَلِكَ الْكِتَابَ مِنِ اخْتِلاَفِهِمْ وَلَغَطِهِمْ."
            }
        ]
    }
]