[
  {
    "SurahNumber": "93",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "The expression \"bright morning hours\" apparently\\n\\t\\t\\t\\tsymbolises the few and widely-spaced periods of happiness\\n\\t\\t\\t\\tin human life, as contrasted with the much greater length\\n\\t\\t\\t\\tof \"the night when it grows still and dark\", i.e., the\\n\\t\\t\\t\\textended periods of sorrow or suffering that, as a rule,\\n\\t\\t\\t\\tovershadow man's existence in this world (cf.  90:4 ).\\n\\t\\t\\t\\tThe further implication is that, as sure as morning\\n\\t\\t\\t\\tfollows night, God's mercy is bound to lighten every\\n\\t\\t\\t\\tsuffering, either in this world or in the life to come -\\n\\t\\t\\t\\tfor God has \"willed upon Himself the law of grace and\\n\\t\\t\\t\\tmercy\" ( 6:12  and {54})."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Sc., \"as the thoughtless might conclude in view of the\\n\\t\\t\\t\\tsuffering that He has willed thee to bear\"."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "6",
    "NoteID": "3",
    "Body": "Possibly an allusion to the fact that Muhammad was born a\\n\\t\\t\\t\\tfew months after his father's death, and that his mother\\n\\t\\t\\t\\tdied when he was only six years old. Apart from this,\\n\\t\\t\\t\\thowever, every human being is an \"orphan\" in one sense or\\n\\t\\t\\t\\tanother, inasmuch as everyone is \"created in a lonely\\n\\t\\t\\t\\tstate\" (cf.  6:94 ), and \"will appear before Him on\\n\\t\\t\\t\\tResurrection Day in a lonely state\" ({l9:95})."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "10",
    "NoteID": "4",
    "Body": "The term sa'il denotes, literally, \"one who asks\", which\\n\\t\\t\\t\\tsignifies not only a \"beggar\" but anyone who asks for\\n\\t\\t\\t\\thelp in a difficult situation, whether physical or moral,\\n\\t\\t\\t\\tor even for enlightenment."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "11",
    "NoteID": "5",
    "Body": "Sc., \"rather than of thy suffering\"."
  }
]
