[
  {
    "SurahNumber": "111",
    "AyahNumber": "1",
    "NoteID": "6294",
    "Body": "Abu Lahab, \"Father of Flame\", was the nick-name of an\\n\\t\\t\\t\\tuncle of the holy Prophet, from his fiery hot temper and\\n\\t\\t\\t\\this ruddy complexion. He was one of the most inveterate\\n\\t\\t\\t\\tenemies of early Islam. When the holy Prophet called\\n\\t\\t\\t\\ttogether the Quraish and his own kith and kin to come and\\n\\t\\t\\t\\tlisten to his preaching and his warning against the sins\\n\\t\\t\\t\\tof his people, the \"Father of Flame\" flared up and cursed\\n\\t\\t\\t\\tthe holy Prophet, saying \"Perdition to thee!\" According\\n\\t\\t\\t\\tto the English saying, \"the causeless curse will not\\n\\t\\t\\t\\tcome\". His words were futile, but his power and strength\\n\\t\\t\\t\\twere equally futile. The star of Islam rose higher and\\n\\t\\t\\t\\thigher every day, and its persecuters dwindled in\\n\\t\\t\\t\\tstrength and power. Many of the leaders of persecution\\n\\t\\t\\t\\tperished at Badr, and Abu Lahab himself perished a week\\n\\t\\t\\t\\tafter Badr, consumed with grief and his own fiery\\n\\t\\t\\t\\tpassions. Verse 3 was prophetic of his end in this very\\n\\t\\t\\t\\tlife, though it also refers to the Hereafter."
  },
  {
    "SurahNumber": "111",
    "AyahNumber": "4",
    "NoteID": "6295",
    "Body": "Abu Lahab's wife was a woman of equally passionate spite\\n\\t\\t\\t\\tand cruelty against the sacred person of the holy\\n\\t\\t\\t\\tProphet. She used to tie bundles of thorns with ropes of\\n\\t\\t\\t\\ttwisted palm-leaf fibre and carry them and strew them\\n\\t\\t\\t\\tabout on dark nights in the paths which the Prophet was\\n\\t\\t\\t\\texpected to take, in order to cause him bodily injury.\\n\\t\\t\\t\\t\"To carry firewood\" may also be symbolical for carrying\\n\\t\\t\\t\\ttales between people to embroil them. This was also one\\n\\t\\t\\t\\tof her vices. But she was laying up for herself another\\n\\t\\t\\t\\tkind of Fire and another kind of Rope, the Fire of\\n\\t\\t\\t\\tPunishment, and the Rope of Slavery to Evil. Thus does\\n\\t\\t\\t\\tEvil prepare its own fate. This is the general lesson of\\n\\t\\t\\t\\tsustained craft and cruel wrong-doing recoiling on the\\n\\t\\t\\t\\twrong-doer's head. See also Introduction to this Sura."
  }
]
