[
  {
    "SurahNumber": "3",
    "AyahNumber": "27",
    "NoteID": "272",
    "Body": "Verses 238-39 are parenthetical, introducing the subject\\n\\t\\t\\t\\tof prayer in danger. This is more fully dealt with in iv.\\n\\t\\t\\t\\t101-03."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "1",
    "NoteID": "342",
    "Body": "See note to ii. 1."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "2",
    "NoteID": "343",
    "Body": "Cf. ii. 255."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "3",
    "NoteID": "344",
    "Body": "In some editions the break between verses 3 and 4 occurs\\n\\t\\t\\t\\there in the middle of the sentence, but in the edition of\\n\\t\\t\\t\\tHafiz Uthmqan, followed by the Egyptian Concordance\\n\\t\\t\\t\\tFath-ur-Rahman, the break occurs at the word Furqan. In\\n\\t\\t\\t\\tverse-divisions our classicists have mainly folloved\\n\\t\\t\\t\\trhythm. As the word Furqan from this point of view is\\n\\t\\t\\t\\tparallel to the word Intiqam, which ends the next verse.\\n\\t\\t\\t\\tI have accepted the verse-division at Furqan as more in\\n\\t\\t\\t\\tconsonance with Quranic rhythm. It makes no real\\n\\t\\t\\t\\tdifference to the numbering of the verses, as there is\\n\\t\\t\\t\\tonly a question of whether one line should go into verse\\n\\t\\t\\t\\t3 or verse 4."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "3",
    "NoteID": "345",
    "Body": "Criterion: Furqan: for meaning see ii. 53 n. 68."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "6",
    "NoteID": "346",
    "Body": "Who can penetrate the mystery of life when a new life is\\n\\t\\t\\t\\tjust being born, except Allah? The reference to the\\n\\t\\t\\t\\tmystery of birth prepares us for the mystery of the birth\\n\\t\\t\\t\\tof Jesus mentioned in iii. 41 and the following verses."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "7",
    "NoteID": "347",
    "Body": "This passage gives us an important clue to the\\n\\t\\t\\t\\tinterpretation of the Holy Qur-an. Broadly speaking it\\n\\t\\t\\t\\tmay be divided into two portions, not given separately,\\n\\t\\t\\t\\tbut intermingled: viz. (1) the nucleus or foundation of\\n\\t\\t\\t\\tthe Book, literally \"the mother of the Book\"; (2) the\\n\\t\\t\\t\\tpart which is not entirely clear. It is very fascinating\\n\\t\\t\\t\\tto take up the latter, and exercise our ingenuity about\\n\\t\\t\\t\\tits meaning, but it refers to such profound matters that\\n\\t\\t\\t\\tare beyond human language and though people of wisdom may\\n\\t\\t\\t\\tget some light from it, no one should be dogmatic, as the\\n\\t\\t\\t\\tfinal meaning is known to Allah alone. The Commentators\\n\\t\\t\\t\\tusually understand the verses \"of established meaning\"\\n\\t\\t\\t\\t(muhkam) to refer to the categorical orders of the\\n\\t\\t\\t\\tShariat (or the Law), which are plain to everyone's\\n\\t\\t\\t\\tunderstanding. But perhaps the meaning is wider: the\\n\\t\\t\\t\\t\"mother of the Book\" must include the very foundation on\\n\\t\\t\\t\\twhich all Law rests, the essence of Allah's Message, as\\n\\t\\t\\t\\tdistinguished from the various illustrative parables,\\n\\t\\t\\t\\tallegories, and ordinances."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "7",
    "NoteID": "348",
    "Body": "One reading, rejected by the majority of Commentators,\\n\\t\\t\\t\\tbut accepted by Mujahid and others, would not make a\\n\\t\\t\\t\\tbreak at the point here marked Waq Lazim, but would run\\n\\t\\t\\t\\tthe two sentences together. In that case the construction\\n\\t\\t\\t\\twould run: \"No one knows its hidden meanings except Allah\\n\\t\\t\\t\\tand those who are firm in knowledge. They say\", etc."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "9",
    "NoteID": "349",
    "Body": "This is the prayer of those who are firmly grounded in\\n\\t\\t\\t\\tknowledge. The more they know the more they realise how\\n\\t\\t\\t\\tlittle they know. But they have Faith. The glimpses they\\n\\t\\t\\t\\tget of Truth they wish to hold fast in their hearts, and\\n\\t\\t\\t\\tthey pray to Allah to preserve them from deviating even\\n\\t\\t\\t\\tfrom what light they have got. They are sure of their\\n\\t\\t\\t\\teventual return to Allah, when all doubts will be solved."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "11",
    "NoteID": "350",
    "Body": "From the beginning of the world, sin, oppression,\\n\\t\\t\\t\\tarrogance, and want of Faith have gone together. The\\n\\t\\t\\t\\tPharaoh of the time of Moses relied upon his power, his\\n\\t\\t\\t\\tterritory, his armies, and his resources to mock at Moses\\n\\t\\t\\t\\tthe messenger of Allah and to oppress the people of\\n\\t\\t\\t\\tMoses. Allah saved the Israelite and punished their\\n\\t\\t\\t\\toppressors through many plagues and calamities."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "12",
    "NoteID": "351",
    "Body": "As Moses warned the Egyptians, so the warning is here\\n\\t\\t\\t\\tsounded to the Pagan Arabs, the Jews and the Christians,\\n\\t\\t\\t\\tand all who resisted Faith, that their resistance would\\n\\t\\t\\t\\tbe in vain. Already the battle of Badr (referred to in\\n\\t\\t\\t\\tthe next verse) had been a warning how Faith must conquer\\n\\t\\t\\t\\twith the help of Allah. The next few decades saw the\\n\\t\\t\\t\\tByzantine and the Persian Empires overthrown because of\\n\\t\\t\\t\\ttheir arrogance and their resistance to the Law of Allah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "13",
    "NoteID": "352",
    "Body": "This refers to the battle of Badr in Ramadhan in the\\n\\t\\t\\t\\tsecond year of the Hijra. The little exiled community of\\n\\t\\t\\t\\tMakkan Muslims, with their friends in Madinah had\\n\\t\\t\\t\\torganised themselves into a God-fearing community, but\\n\\t\\t\\t\\twere constantly in danger of being attacked by their\\n\\t\\t\\t\\tPagan enemies of Makkah in alliance with some of the\\n\\t\\t\\t\\tdisaffected elements (Jews and Hypocrites) in or near\\n\\t\\t\\t\\tMadinah itself. The design of the Makkans was to gather\\n\\t\\t\\t\\tall the resources they could, and with an overwhelming\\n\\t\\t\\t\\tforce, to crush and annihilate Muhammad and his party. To\\n\\t\\t\\t\\tthis end Abu Sufyan was leading a richly-laden caravan\\n\\t\\t\\t\\tfrom Syria to Makkah. He called for armed aid from\\n\\t\\t\\t\\tMakkah, The battle was fought in the plain of Badr, about\\n\\t\\t\\t\\t150 kilometers south-west of Madinah. The Muslim force\\n\\t\\t\\t\\tconsisted of only about 313 men, mostly ill-armed, but\\n\\t\\t\\t\\tthey were led by Muhammad, and they were fighting for\\n\\t\\t\\t\\ttheir Faith. The Makkan army, well-armed and\\n\\t\\t\\t\\twell-equipped, numbered over a thousand and had among its\\n\\t\\t\\t\\tleaders some of the most experienced warriors of Arabia,\\n\\t\\t\\t\\tincluding Abu Jahl, the inveterate foe and persecutor of\\n\\t\\t\\t\\tIslam. Against all odds the Muslims won a brilliant\\n\\t\\t\\t\\tvictory, and many of the enemy leaders, including Abu\\n\\t\\t\\t\\tJahl, were killed."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "13",
    "NoteID": "353",
    "Body": "It was impossible, without the miraculous aid of Allah,\\n\\t\\t\\t\\tfor such a small and ill-equipped force as was the Muslim\\n\\t\\t\\t\\tband, to defeat the large and well-found force of the\\n\\t\\t\\t\\tenemy. But their Faith, firmness, zeal, and discipline\\n\\t\\t\\t\\twon them divine aid. Enemy prisoners stated that the\\n\\t\\t\\t\\tenemy ranks saw the Muslim force to be many times larger\\n\\t\\t\\t\\tthan it was."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "14",
    "NoteID": "354",
    "Body": "The pleasures of this world are first enumerated: women\\n\\t\\t\\t\\tfor love; sons for strength and pride; hoarded riches,\\n\\t\\t\\t\\twhich procure all luxuries; the best and finest pedigree\\n\\t\\t\\t\\thorses; cattle, the measure of wealth in the ancient\\n\\t\\t\\t\\tworld, as well as the means and symbols of good farming\\n\\t\\t\\t\\tin the modern world; and broad acres of well-tilled land.\\n\\t\\t\\t\\tBy analogy, we may include, for our mechanized age,\\n\\t\\t\\t\\tmachines of all kinds,-tractors, motor- cars, aeroplanes,\\n\\t\\t\\t\\tthe best internal-combustion engines, etc., etc. In\\n\\t\\t\\t\\t\"heaped-up hoards of gold and silver,\" the Arabic word\\n\\t\\t\\t\\ttranslated hoards is quanatir plural of quintar, which\\n\\t\\t\\t\\tliterally means a Talent of 1.200 ounces of gold."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "15",
    "NoteID": "355",
    "Body": "Cf. ii. 25 and n. 44."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "17",
    "NoteID": "356",
    "Body": "Sabr (Sabirin) includes many shades of meaning: I have\\n\\t\\t\\t\\tspecified three here, viz., patience, firmness, and\\n\\t\\t\\t\\tself-control. See ii. 45 and ii. 153 and notes thereon."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "17",
    "NoteID": "357",
    "Body": "True servants of Allah are described in iii. 16 and 17.\\n\\t\\t\\t\\tThey have faith, humility, and hope (iii. 16); and they\\n\\t\\t\\t\\thave certain virtues (iii. 17) viz., (1) patience,\\n\\t\\t\\t\\tsteadfastness, self-restraint, and all that goes under\\n\\t\\t\\t\\tthe full definition of Sabr; this shows a certain\\n\\t\\t\\t\\tattitude of mind: (2) in all their dealings they are true\\n\\t\\t\\t\\tand sincere as they are also in their promises and words;\\n\\t\\t\\t\\tthis marks them out in social conduct: (3) further, their\\n\\t\\t\\t\\tspiritual worship is earnest and deep, an inner\\n\\t\\t\\t\\tcounterpart of their outward conduct; (4) their worship\\n\\t\\t\\t\\tof Allah shows itself in their love of their fellow-men,\\n\\t\\t\\t\\tfor they are ready and liberal in charity: and (5) their\\n\\t\\t\\t\\tself-discipline is so great that the first thing they do\\n\\t\\t\\t\\tevery morning is humbly to approach their God."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "18",
    "NoteID": "358",
    "Body": "Allah Himself speaks to us through His revelations\\n\\t\\t\\t\\t(through angels) and through His Creation, for all Nature\\n\\t\\t\\t\\tglorifies Allah. No thinking mind, if it only judges the\\n\\t\\t\\t\\tmatter fairly, can fail to find the same witness in his\\n\\t\\t\\t\\town heart and conscience. All this points to the Unity of\\n\\t\\t\\t\\tAllah, His exalted nature, and His wisdom."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "19",
    "NoteID": "359",
    "Body": "Bagyan: through envy, through selfish contumacy or\\n\\t\\t\\t\\tobstinacy, through sheer contrary-mindedness, or desire\\n\\t\\t\\t\\tto resist or rebel. Cf. ii. 90, and ii. 213."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "20",
    "NoteID": "360",
    "Body": "Wajh: whole self. See n. 114 to ii. 112."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "20",
    "NoteID": "361",
    "Body": "The People of the Book may be supposed to know something\\n\\t\\t\\t\\tabout the previous religious history of mankind. To them\\n\\t\\t\\t\\tthe appeal should be easy and intelligible, as all\\n\\t\\t\\t\\tReligion is one, and it is only being renewed in Islam.\\n\\t\\t\\t\\tBut the appeal is also made to the Pagan Arabs, who are\\n\\t\\t\\t\\tunlearned, and who can well be expected to follow the\\n\\t\\t\\t\\texample of one of their own, who received divine\\n\\t\\t\\t\\tenlightenment, and was able to bring new knowledge to\\n\\t\\t\\t\\tthem. A great many of both these classes did so. But the\\n\\t\\t\\t\\tfew who resisted Allah's grace, and actually threatened\\n\\t\\t\\t\\tand persecuted those who believed, are told that Allah\\n\\t\\t\\t\\twill look after His own."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "20",
    "NoteID": "362",
    "Body": "Note the literary skill in the argument as it proceeds.\\n\\t\\t\\t\\tThe mystery of birth faintly suggests that we are coming\\n\\t\\t\\t\\tto the story of Jesus. The exposition of the Book\\n\\t\\t\\t\\tsuggests that Islam is the same religion as that of the\\n\\t\\t\\t\\tPeople of the Book. Next we are told that the People of\\n\\t\\t\\t\\tthe Book made their religion one-sided, and through the\\n\\t\\t\\t\\tpriesthood of the family of Imran, we are brought to the\\n\\t\\t\\t\\tstory of Jesus, who was rejected by a body of the Jews as\\n\\t\\t\\t\\tMuhammad was rejected by a body of both Jews and\\n\\t\\t\\t\\tChristians."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "21",
    "NoteID": "363",
    "Body": "Right; haqq has many shades of meaning; (1) right, in the\\n\\t\\t\\t\\tsense of having a right to something; (2) right, in the\\n\\t\\t\\t\\tsense of straight conduct, as opposed to wrong; (3)\\n\\t\\t\\t\\ttruth; (4) justice. All these shades are implied here."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "21",
    "NoteID": "364",
    "Body": "Examples of the Prophets slain were: \"the righteous blood\\n\\t\\t\\t\\tshed upon the earth, from the blood of righteous Abel\\n\\t\\t\\t\\tunto the blood of Zacharias, son of Barachias, whom ye\\n\\t\\t\\t\\tslew between the temple and the altar\": Matt. xxiii. 35.\\n\\t\\t\\t\\tCf. Q. ii. 61. n. 75. Again, John the Baptist (Yahya,\\n\\t\\t\\t\\tnoble, chaste, a prophet, of the goodly company of the\\n\\t\\t\\t\\trighteous. Q. iii. 39), was bound, imprisoned, and\\n\\t\\t\\t\\tbeheaded, and his head presented to a dancing harlot:\\n\\t\\t\\t\\tMatt. xiv. 1-11."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "22",
    "NoteID": "365",
    "Body": "Cf. ii. 217. end."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "23",
    "NoteID": "366",
    "Body": "A portion of the Book. I conceive that Allah's revelation\\n\\t\\t\\t\\tas a whole throughout the ages is \"The Book\". The Law of\\n\\t\\t\\t\\tMoses, and the Gospel of Jesus were portions of the Book.\\n\\t\\t\\t\\tThe Qur-an completes the revelation and is par excellence\\n\\t\\t\\t\\tthe Book of Allah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "23",
    "NoteID": "367",
    "Body": "The Commentators mention a particular incident when a\\n\\t\\t\\t\\tdispute was submitted by the Jews for arbitration to the\\n\\t\\t\\t\\tHoly Prophet. He appealed to the authority of their own\\n\\t\\t\\t\\tbooks, but they tried to conceal and prevaricate. The\\n\\t\\t\\t\\tgeneral lesson is that the People of the Book should have\\n\\t\\t\\t\\tbeen the first to welcome in Muhammad the living exponent\\n\\t\\t\\t\\tof the Message of Allah as a whole, and some of them did\\n\\t\\t\\t\\tso: but others turned away from guilty arrogance, relying\\n\\t\\t\\t\\ton corrupted texts and doctrines forged out of their own\\n\\t\\t\\t\\tfancies, though they were not conformable to reason and\\n\\t\\t\\t\\tgood sense."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "24",
    "NoteID": "368",
    "Body": "Cf. Q. ii. 80."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "26",
    "NoteID": "368",
    "Body": "Cf. Q. ii. 80."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "27",
    "NoteID": "370",
    "Body": "True in many senses. In every twenty-four hours, night\\n\\t\\t\\t\\tmerges into day, and day into night, and there is no\\n\\t\\t\\t\\tclear boundary between them. In every solar year, the\\n\\t\\t\\t\\tnight gains on the day after the summer solstice, and the\\n\\t\\t\\t\\tday gains on the night after the winter solstice. But\\n\\t\\t\\t\\tfurther, if light and darkness are viewed as symbols of\\n\\t\\t\\t\\t(a) knowledge and ignorance, (b) happiness and misery,\\n\\t\\t\\t\\t(c) spiritual insight and spiritual blindness, Allah's\\n\\t\\t\\t\\tPlan or Will works here too as in the physical world, and\\n\\t\\t\\t\\tin His hand is all Good."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "27",
    "NoteID": "371",
    "Body": "We can interpret Dead and Living in even more senses than\\n\\t\\t\\t\\tDay and Night: death physical, intellectual, emotional,\\n\\t\\t\\t\\tspiritual. Life and Death may also apply to collective,\\n\\t\\t\\t\\tgroup, or national life. And who has ever solved the\\n\\t\\t\\t\\tmystery of Life? But Faith refers it to Allah's Will and\\n\\t\\t\\t\\tPlan."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "28",
    "NoteID": "373",
    "Body": "If Faith is a fundamental matter in our lives our\\n\\t\\t\\t\\tassociations and friendships will naturally be with those\\n\\t\\t\\t\\twho share our Faith. \"Evil communications corrupt good\\n\\t\\t\\t\\tmanners\": and evil company may corrupt Faith. In our\\n\\t\\t\\t\\tordinary every-day affairs of business, we are asked to\\n\\t\\t\\t\\tseek the help of Believers rather than Unbelievers. Only\\n\\t\\t\\t\\tin this way can our community be strong in organisation\\n\\t\\t\\t\\tand unity. But where there is no question of preference,\\n\\t\\t\\t\\tor where in self-defence we have to take the assistance\\n\\t\\t\\t\\tof those not belonging to our Faith, that is permissible.\\n\\t\\t\\t\\tIn any case we must not weaken our Brotherhood: we must\\n\\t\\t\\t\\ttry to make it stronger if possible."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "34",
    "NoteID": "374",
    "Body": "The Prophets in the Jewish-Christian-Muslim Dispensation\\n\\t\\t\\t\\tform one family literally. But the argument is wider. All\\n\\t\\t\\t\\tmen of faith form one family. If you love and obey Allah,\\n\\t\\t\\t\\tlove and obey His Messenger; your love, obedience and\\n\\t\\t\\t\\tdiscipline will be the test of your Faith."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "35",
    "NoteID": "375",
    "Body": "Now we begin the story of Jesus. As a prelude we have the\\n\\t\\t\\t\\tbirth of Mary and the parallel story of John the Baptist,\\n\\t\\t\\t\\tYahya the son of Zakariya. Yahya's mother Elisabeth was a\\n\\t\\t\\t\\tcousin of Mary the mother of Jesus (Luke i. 36), and\\n\\t\\t\\t\\ttherefore John and Jesus were cousins by blood, and there\\n\\t\\t\\t\\twas a spiritual cousinhood in their birth and career.\\n\\t\\t\\t\\tElisabeth was of the daughters of Aaron (Luke i. 5), of a\\n\\t\\t\\t\\tpriestly family which went back to Aaron the brother of\\n\\t\\t\\t\\tMoses and son of Imran. Her husband Zakariya was actually\\n\\t\\t\\t\\ta priest, and her cousin Mary was presumably also of a\\n\\t\\t\\t\\tpriestly family. By tradition Mary's mother was called\\n\\t\\t\\t\\tHannah (in Latin, Anna, and in English, Anne), and her\\n\\t\\t\\t\\tfather was called Imran. Hannah is therefore both a\\n\\t\\t\\t\\tdescendant of the priestly house of Imran and the wife of\\n\\t\\t\\t\\tImran,-\"a woman of Imran\" in a double sense,"
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "35",
    "NoteID": "376",
    "Body": "Muharrar = freed from all worldly affairs and specially\\n\\t\\t\\t\\tdedicated to Allah's service. She expected a son, who was\\n\\t\\t\\t\\tto be a special devotee, a miraculous son of the old age\\n\\t\\t\\t\\tof his parents, but Allah gave her instead a daughter.\\n\\t\\t\\t\\tBut that daughter was Mary the mother of Jesus, the\\n\\t\\t\\t\\tchosen one among the women: iii. 42."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "36",
    "NoteID": "377",
    "Body": "The mother of Mary expected a male child. Was she\\n\\t\\t\\t\\tdisappointed that it was a female child? No, for she had\\n\\t\\t\\t\\tFaith, and she knew that Allah's Plan was better than any\\n\\t\\t\\t\\twishes of hers. Mary was no ordinary girl: only Allah\\n\\t\\t\\t\\tknew what it was that her mother brought forth."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "36",
    "NoteID": "378",
    "Body": "The female child could not be devoted to Temple service\\n\\t\\t\\t\\tunder the Mosaic law, as she intended. But she was marked\\n\\t\\t\\t\\tout for a special destiny as a miracle-child, to be the\\n\\t\\t\\t\\tmother of the miracle-child Jesus. She was content to\\n\\t\\t\\t\\tseek Allah's protection for her against all evil. There\\n\\t\\t\\t\\tis a certain sense of pride in the girl on the part of\\n\\t\\t\\t\\tthe mother."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "37",
    "NoteID": "379",
    "Body": "Mary grew under Allah's special protection. Her\\n\\t\\t\\t\\tsustenance, under which we may include both her physical\\n\\t\\t\\t\\tneeds and her spiritual food, came from Allah, and her\\n\\t\\t\\t\\tgrowth was indeed a \"goodly growth\" which I have tried to\\n\\t\\t\\t\\texpress in the Text by the words \"purity and beauty\".\\n\\t\\t\\t\\tSome aprocryphal Christian writings say that she was\\n\\t\\t\\t\\tbrought up in the Temple to the age of twelve like a\\n\\t\\t\\t\\tdove, and that she was fed by angels."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "38",
    "NoteID": "380",
    "Body": "The birth of Mary, the mother of Jesus, of John the\\n\\t\\t\\t\\tBaptist, the precursor of Jesus, and of Jesus, the\\n\\t\\t\\t\\tprophet of Israel, whom Israel rejected, occurred in that\\n\\t\\t\\t\\torder chronologically, and are told in that order. They\\n\\t\\t\\t\\tare all inter-connected. Zakariya prayed for no ordinary\\n\\t\\t\\t\\tson. He and his wife were past the age of parenthood.\\n\\t\\t\\t\\tSeeing the growth of Mary, he prayed for some child from\\n\\t\\t\\t\\tAllah,- \"from Thee, a progeny that is pure\". To his\\n\\t\\t\\t\\tsurprise, he is given a son in the flesh, ushered in by a\\n\\t\\t\\t\\tspecial Sign."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "39",
    "NoteID": "381",
    "Body": "Notice: \"a Word from Allah\", not \"the Word of Allah\", the\\n\\t\\t\\t\\tepithet that mystical Christianity uses for Jesus. As\\n\\t\\t\\t\\tstated in iii. 59 below, Jesus was created by a miracle,\\n\\t\\t\\t\\tby Allah's word \"Be\", and he was."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "42",
    "NoteID": "382",
    "Body": "Mary the mother of Jesus was unique, in that she gave\\n\\t\\t\\t\\tbirth to a son by a special miracle, without the\\n\\t\\t\\t\\tintervention of the customary physical means. This of\\n\\t\\t\\t\\tcourse does not mean that she was more than human, any\\n\\t\\t\\t\\tmore than that her son was more than human. She had as\\n\\t\\t\\t\\tmuch need to pray to God as anyone else. The Christian\\n\\t\\t\\t\\tdogma, in all sects except the Unitarian, holds that\\n\\t\\t\\t\\tJesus was God and the son of God. The worship of Mary\\n\\t\\t\\t\\tbecame the practice in the Roman Catholic Church, which\\n\\t\\t\\t\\tcalls Mary the Mother of God. This seems to have been\\n\\t\\t\\t\\tendorsed by the Council of Ephesus in 431, in the century\\n\\t\\t\\t\\tbefore Muhammad was born to sweep way the corruptions of\\n\\t\\t\\t\\tthe Church of Christ. For 'alamin as meaning all nations,\\n\\t\\t\\t\\tsee iii. 96, n. 423."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "44",
    "NoteID": "383",
    "Body": "Things unseen: mystic, spiritual. The whole story has a\\n\\t\\t\\t\\tmystic meaning, and it would be unseemly to dispute or\\n\\t\\t\\t\\tspeculate about it."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "44",
    "NoteID": "384",
    "Body": "Literally, reeds : aqlam. For the Arab custom of casting\\n\\t\\t\\t\\tlots with arrows, see ii. 219, n. 241."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "44",
    "NoteID": "385",
    "Body": "Christian apocryphal writings mention the contention\\n\\t\\t\\t\\tbetween the priests as to the honor of taking charge of\\n\\t\\t\\t\\tMary, and how it was decided by means of rods or reeds in\\n\\t\\t\\t\\tfavour of Zakariya."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "45",
    "NoteID": "386",
    "Body": "Christ : Greek, Christos=anointed : kings and priests\\n\\t\\t\\t\\twere anointed to symbolise consecration to their office.\\n\\t\\t\\t\\tThe Hebrew and Arabic form is Masih."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "45",
    "NoteID": "387",
    "Body": "Nearest to God : Muqarrabin. Cf. Q. lvi, 11."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "46",
    "NoteID": "388",
    "Body": "The ministry of Jesus lasted only about three years, from\\n\\t\\t\\t\\t30 to 33 years of his age, when in the eyes of his\\n\\t\\t\\t\\tenemies he was crucified. But the Gospel of Luke (ii. 46)\\n\\t\\t\\t\\tdescribes him as disputing with the doctors in the Temple\\n\\t\\t\\t\\tat the age of 12, and even earlier, as a child, he was\\n\\t\\t\\t\\t\"strong in spirit, filled with wisdom\" (Luke ii. 40).\\n\\t\\t\\t\\tSome apocyphal Gospels describe him as preaching from\\n\\t\\t\\t\\tinfancy."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "47",
    "NoteID": "389",
    "Body": "She was addressed by angels, who gave her God's message.\\n\\t\\t\\t\\tIn reply she speaks as to God. In reply, apparently an\\n\\t\\t\\t\\tangel gives God's message."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "49",
    "NoteID": "390",
    "Body": "This miracle of the clay birds is found in some of the\\n\\t\\t\\t\\tapocryphal Gospels; those of curing the blind and the\\n\\t\\t\\t\\tlepers and raising the dead are in the canonical Gospels.\\n\\t\\t\\t\\tThe original Gospel (see iii. 48) was not the various\\n\\t\\t\\t\\tstories written afterwards by disciples, but the real\\n\\t\\t\\t\\tMessage taught direct by Jesus."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "49",
    "NoteID": "391",
    "Body": "This clause refers generally to a prophetic knowledge of\\n\\t\\t\\t\\twhat is not known to other people."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "52",
    "NoteID": "392",
    "Body": "The story of Jesus is told with special application to\\n\\t\\t\\t\\tthe time of the Prophet Muhammad. Note the word helpers\\n\\t\\t\\t\\t(Ansar) in this connection, and the reference to plotters\\n\\t\\t\\t\\tin iii. 54. It was the one Religion-the Religion of\\n\\t\\t\\t\\tAllah, which was in essence the religion of Abraham,\\n\\t\\t\\t\\tMoses, and Jesus. The argument runs: who do ye then now\\n\\t\\t\\t\\tmake divisions and reject the living Teacher? Islam is:\\n\\t\\t\\t\\tbowing to the Will of Allah. All who have faith should\\n\\t\\t\\t\\tbow to the Will of Allah and be Muslims."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "54",
    "NoteID": "393",
    "Body": "The Arabic Makara has both a bad and a good meaning, that\\n\\t\\t\\t\\tof making an intricate plan to carry out some secret\\n\\t\\t\\t\\tpurpose. The enemies of Allah are constantly doing that.\\n\\t\\t\\t\\tBut Allah-in whose hands is all good-has His plans also,\\n\\t\\t\\t\\tagainst which the evil ones will have no chance whatever."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "55",
    "NoteID": "394",
    "Body": "Read this with iv. 157, where it is said that \"whereas\\n\\t\\t\\t\\tthey slew him not nor they crucified him but it was made\\n\\t\\t\\t\\tdubious unto them. The guilt of the Jews remained, but\\n\\t\\t\\t\\tJesus was eventually taken up to Allah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "55",
    "NoteID": "395",
    "Body": "Jesus was charged by the Jews with blasphemy as claiming\\n\\t\\t\\t\\tto be Allah or the son of Allah. The Christians (except a\\n\\t\\t\\t\\tfew early sects which were annihilated by persecution,\\n\\t\\t\\t\\tand the modern sect of Unitarians), adopted the substance\\n\\t\\t\\t\\tof the claim, and made it the cornerstone of their faith.\\n\\t\\t\\t\\tAllah clears Jesus of such a charge or claim."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "55",
    "NoteID": "396",
    "Body": "Those who follow thee refers to those who followed Jesus\\n\\t\\t\\t\\tin contrast to the Jews who rejected him."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "55",
    "NoteID": "397",
    "Body": "All the controversies about dogma and faith will\\n\\t\\t\\t\\tdisappear when we appear before Allah. He will judge not\\n\\t\\t\\t\\tby what we profess but by what we are."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "59",
    "NoteID": "398",
    "Body": "After a description of the high position which Jesus\\n\\t\\t\\t\\toccupies as a prophet, we have a repudiation of the dogma\\n\\t\\t\\t\\tthat he was Allah, or the son of Allah, or anything more\\n\\t\\t\\t\\tthan a man. If it is said that he was born without a\\n\\t\\t\\t\\thuman father, Adam was also so born. Indeed Adam was born\\n\\t\\t\\t\\twithout either a human father or mother. As far as our\\n\\t\\t\\t\\tphysical bodies are concerned they are mere dust. In\\n\\t\\t\\t\\tAllah's sight Jesus was as dust just as Adam was or\\n\\t\\t\\t\\thumanity is. The greatness of Jesus arose from the divine\\n\\t\\t\\t\\tcommand \"Be\": for after that he was-more than dust - a\\n\\t\\t\\t\\tgreat Prophet and teacher."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "60",
    "NoteID": "399",
    "Body": "The truth does not necessarily come from priests, or from\\n\\t\\t\\t\\tthe superstitions of whole peoples. It comes from Allah,\\n\\t\\t\\t\\tand where there is a direct revelation, there is no room\\n\\t\\t\\t\\tfor doubt."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "61",
    "NoteID": "400",
    "Body": "In the year of Deputations, 10th of the Hijra, came a\\n\\t\\t\\t\\tChristian embassy from Najran (towards Yaman, about 150\\n\\t\\t\\t\\tmiles north of Sanaa). They were much impressed on\\n\\t\\t\\t\\thearing this passage of the Qur-an explaining thc true\\n\\t\\t\\t\\tposition of Christ, and they entered into tributary\\n\\t\\t\\t\\trelations with the new Muslim State. But ingrained habits\\n\\t\\t\\t\\tand customs prevented them from accepting Islam as a\\n\\t\\t\\t\\tbody. The Holy Prophet, firm in his faith, proposed a\\n\\t\\t\\t\\tMubahala, i.e., a solemn meeting, in which both sides\\n\\t\\t\\t\\tshould summon not only their men, but their women and\\n\\t\\t\\t\\tchildren, earnestly pray to Allah, and invoke the curse\\n\\t\\t\\t\\tof Allah on those who should lie. Those who had a pure\\n\\t\\t\\t\\tand sincere faith would not hesitate. The Christians\\n\\t\\t\\t\\tdeclined, and they were dismissed in a spirit of\\n\\t\\t\\t\\ttolerance with a promise of protection from the State in\\n\\t\\t\\t\\treturn for tribute."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "62",
    "NoteID": "401",
    "Body": "We are now in a position to deal with the questions which\\n\\t\\t\\t\\twe left over at ii. 87. Jesus is no more than a man. It\\n\\t\\t\\t\\tis against reason and revelation to call him Allah or the\\n\\t\\t\\t\\tson of Allah. He is called the son of Mary to emphasize\\n\\t\\t\\t\\tthis. He had no human father, as his birth was\\n\\t\\t\\t\\tmiraculous. But it is not this which raise him to his\\n\\t\\t\\t\\thigh position as a prophet, but because Allah called him\\n\\t\\t\\t\\tto his office. The praise is due to Allah, Who by His\\n\\t\\t\\t\\tword gave him spiritual strength-\"strengthened him with\\n\\t\\t\\t\\tthe Holy spirit. The miracles which surround his story\\n\\t\\t\\t\\trelate not only to the \"Clear Signs\" which he brought. It\\n\\t\\t\\t\\twas those who misunderstood him who obscured his clear\\n\\t\\t\\t\\tSigns and surrounded him with mysteries of their own\\n\\t\\t\\t\\tinvention."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "64",
    "NoteID": "402",
    "Body": "In the abstract the People of the Book would agree to all\\n\\t\\t\\t\\tthree propositions. In practice they fail. Apart from\\n\\t\\t\\t\\tdoctrinal lapses from the unity of the One True God,\\n\\t\\t\\t\\tthere is the question of a consecrated Priesthood (among\\n\\t\\t\\t\\tthe Jews it was hereditary also), as if a mere human\\n\\t\\t\\t\\tbeing-Cohen, or Pope, or Priest, or Brahman, could claim\\n\\t\\t\\t\\tsuperiority apart from his learning and the purity of his\\n\\t\\t\\t\\tlife, or could stand between man and Allah in some\\n\\t\\t\\t\\tspecial sense. The same remarks apply to the worship of\\n\\t\\t\\t\\tsaints. They may be pure and sincere, but no one can\\n\\t\\t\\t\\tprotect us or claim Lordship over us except Allah. For\\n\\t\\t\\t\\tRabb, see i. 2. n. Abraham was a true Prophet of Allah,\\n\\t\\t\\t\\tbut he could not be called a Jew or a Christian as he\\n\\t\\t\\t\\tlived long before the Law of Moses or the Gospel of Jesus\\n\\t\\t\\t\\twas revealed."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "66",
    "NoteID": "403",
    "Body": "The number of sects among the Jews and Christians shows\\n\\t\\t\\t\\tthat they wrangled and disputed even about some of the\\n\\t\\t\\t\\tmatters of their own religion, of which they should have\\n\\t\\t\\t\\thad some knowledge. But when they talk of Father Abraham,\\n\\t\\t\\t\\tthey are entirely out of court, as he lived before their\\n\\t\\t\\t\\tpeculiar systems were evolved."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "67",
    "NoteID": "404",
    "Body": "Cf. ii. 135 and the whole argument in that passage."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "71",
    "NoteID": "405",
    "Body": "There are many ways of preventing the access of people to\\n\\t\\t\\t\\tthe truth. One is to tamper with it, or trick it out in\\n\\t\\t\\t\\tcolours of falsehood: haf-truths are often more dangerous\\n\\t\\t\\t\\tthan obvious falsehoods. Another is to conceal it\\n\\t\\t\\t\\taltogether. Those who are jealous of a prophet of Allah,\\n\\t\\t\\t\\twhom they actually see before them, do not allow his\\n\\t\\t\\t\\tcredentials or virtues to be known, or vilify him, or\\n\\t\\t\\t\\tconceal facts which would attract people to him. When\\n\\t\\t\\t\\tpeople do this of set purpose, against their own light\\n\\t\\t\\t\\t(\"of which ye are yourselves witnesses\"), they are\\n\\t\\t\\t\\tdescending to the lowest depths of degradation, and they\\n\\t\\t\\t\\tare doing more harm to themselves than to anyone else."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "72",
    "NoteID": "406",
    "Body": "Wajh here has the sense of \"beginning\", early part. The\\n\\t\\t\\t\\tcynics who plotted against Islam actually asked their\\n\\t\\t\\t\\taccomplies to join the believers and then repudiate them."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "73",
    "NoteID": "407",
    "Body": "The two clauses following have been variously construed,\\n\\t\\t\\t\\tand some translations leave the sense ambiguous. I have\\n\\t\\t\\t\\tconstrued the conjunction \"an\" to mean \"lest\",\\tas it\\n\\t\\t\\t\\tundoubtedly does in vii. 172. 'an taqulu\", etc."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "73",
    "NoteID": "408",
    "Body": "Cf. ii. 76. The People of the Book were doubly annoyed at\\n\\t\\t\\t\\tthe Muslims: (1) that they should (being outside their\\n\\t\\t\\t\\tranks) receive Allah's revelations, and (2) that having\\n\\t\\t\\t\\treceived such revelations, they should be able to convict\\n\\t\\t\\t\\tthem out of their own scriptures before their Lord."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "75",
    "NoteID": "409",
    "Body": "Hoard of gold: qintar: a talent of 1,200 ounces of gold.\\n\\t\\t\\t\\tSee iii. 14. n. 354."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "75",
    "NoteID": "410",
    "Body": "Silver coin: dinar. In the later Roman Empire, the\\n\\t\\t\\t\\tdenarius was a small silver coin. It must have been\\n\\t\\t\\t\\tcurrent in Syria and the markets of Arabia in the time of\\n\\t\\t\\t\\tthe Prophet. It was the coin whose name is translated in\\n\\t\\t\\t\\tthe English Bible by the word penny. Matt. xxii, 19:\\n\\t\\t\\t\\thence the abbreviation of penny is d (= denarius). The\\n\\t\\t\\t\\tlater Arabian coin dinar coined by the Umaiyads, was a\\n\\t\\t\\t\\tgold coin after the pattern of the Byzantine (Roman)\\n\\t\\t\\t\\tdenarius aureus and weighed about 66349 grains troy, just\\n\\t\\t\\t\\ta little more than a half-sovereign."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "75",
    "NoteID": "411",
    "Body": "Every race imbued with race arrogance resorts to this\\n\\t\\t\\t\\tkind of moral or religious subterfuge. Even if its\\n\\t\\t\\t\\tmembers are usually honest or just among themselves, they\\n\\t\\t\\t\\tare contemptuous of those outside their circle, and cheat\\n\\t\\t\\t\\tand deceive them without any qualms of conscience. This\\n\\t\\t\\t\\tis a \"lie against Allah.\""
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "77",
    "NoteID": "412",
    "Body": "All our duties to our fellow creatures are referred to\\n\\t\\t\\t\\tthe service and faith we owe to Allah. But in the matter\\n\\t\\t\\t\\tof truth an appeal is made to our self-respect as\\n\\t\\t\\t\\tresponsible beings: is it becoming that we should be\\n\\t\\t\\t\\tfalse to our own word, to ourselves? And then we are\\n\\t\\t\\t\\treminded that the utmost we can gain by falsifying\\n\\t\\t\\t\\tAllah's word or being untrue to ourselves is but a\\n\\t\\t\\t\\tmiserable price. We get at best something very paltry as\\n\\t\\t\\t\\tthe price for selling our very souls."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "77",
    "NoteID": "413",
    "Body": "Even on sinners-ordinary sinners-Allah will look with\\n\\t\\t\\t\\tcompassion and mercy: He will speak words of kindness and\\n\\t\\t\\t\\tcleanse them of their sins. But those who are in active\\n\\t\\t\\t\\trebellion against Allah and sin against their own\\n\\t\\t\\t\\tlight,-what mercy can they expect?"
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "79",
    "NoteID": "414",
    "Body": "It is not in reason or in the nature of things that\\n\\t\\t\\t\\tAllah's messenger should preach against Allah. Jesus came\\n\\t\\t\\t\\tto preach and convey the true message of Allah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "80",
    "NoteID": "415",
    "Body": "Jesus was a prophet, and the Holy Spirit \"with which he\\n\\t\\t\\t\\twas strengthened\" was the Angel who brought the\\n\\t\\t\\t\\trevelations to him."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "81",
    "NoteID": "416",
    "Body": "Cf. ii. 63. n. 78. The argument is: You (People of the\\n\\t\\t\\t\\tBook) are bound by your own oaths, sworn solemnly in the\\n\\t\\t\\t\\tpresence of your own Prophets. In the Old Testament as it\\n\\t\\t\\t\\tnow exists, Muhammad is foretold in Deut. xviii. 18: and\\n\\t\\t\\t\\tthe rise of the Arab nation in Isaiah. xlii. 11. for\\n\\t\\t\\t\\tKedar was a son of Ismail and the name is used for the\\n\\t\\t\\t\\tArab nation: in the New Testament as it now exists.\\n\\t\\t\\t\\tMuhammad is foretold in the Gospel of St. John. xiv. 16,\\n\\t\\t\\t\\txv. 26, and xvi. 7: the future Comforter cannot be the\\n\\t\\t\\t\\tHoly Spirit as understood by Christians, because the Holy\\n\\t\\t\\t\\tSpirit already was present, helping and guiding Jesus.\\n\\t\\t\\t\\tThe Greek word translated \"Comforter\" is \"Paracletos\",\\n\\t\\t\\t\\twhich is an easy corruption from \"Periclytos\", which is\\n\\t\\t\\t\\talmost a literal translation of \"Muhammad\" or \"Ahmad\":\\n\\t\\t\\t\\tsee Q lxi. 6. Further, there were other Gospels that have\\n\\t\\t\\t\\tperished, but of which traces still remain, which were\\n\\t\\t\\t\\teven more specific in their reference to Muhammad; e.g.,\\n\\t\\t\\t\\tthe Gospel of St. Barnabas, of which an Italian\\n\\t\\t\\t\\ttranslation is extant in the State Library at Vienna. It\\n\\t\\t\\t\\twas edited in 1907 with an English translation by Mr.\\n\\t\\t\\t\\tLonsdale and Laura Ragg."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "83",
    "NoteID": "417",
    "Body": "Allah's Truth is manifest, and all that is good and true\\n\\t\\t\\t\\tand sane and normal accepts it with joy. But even where\\n\\t\\t\\t\\tthere is \"disease in the heart\" (Q. ii. 10), or judgment\\n\\t\\t\\t\\tis obscured by perversity, every creature must eventually\\n\\t\\t\\t\\tsee and acknowledge Allah and His power (ii. 167). Cf. R.\\n\\t\\t\\t\\tBridges: \"Testament of Beauty\": iv. 1419-22:-\"For God's\\n\\t\\t\\t\\tlove is unescapable as nature's environment, which if a\\n\\t\\t\\t\\tman ignore or think to thrust it off, he is the\\n\\t\\t\\t\\till-natured fool that runneth blindly on death.\" All\\n\\t\\t\\t\\tNature adores Allah, and Islam asks for nothing peculiar\\n\\t\\t\\t\\tor sectarian; it but asks that we follow our nature and\\n\\t\\t\\t\\tmake our will conformable to Allah's Will as seen in\\n\\t\\t\\t\\tNature, history, and revelation. Its message is\\n\\t\\t\\t\\tuniversal."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "85",
    "NoteID": "418",
    "Body": "The Muslim position is clear. The Muslim does not claim\\n\\t\\t\\t\\tto have a religion peculiar to himself. Islam is not a\\n\\t\\t\\t\\tsect or an ethnic religion. In its view all Religion is\\n\\t\\t\\t\\tone, for the Truth is one. It was the religion preached\\n\\t\\t\\t\\tby all the earlier Prophets. It was the truth taught by\\n\\t\\t\\t\\tall the inspired Books. In essence it amounts to a\\n\\t\\t\\t\\tconsciousness of the Will and Plan of Allah and a joyful\\n\\t\\t\\t\\tsubmission to that Will and Plan. If any one wants a\\n\\t\\t\\t\\treligion other than that, he is false to his own nature,\\n\\t\\t\\t\\tas he is false to Allah's Will and Plan. Such a one\\n\\t\\t\\t\\tcannot expect guidance, for he has deliberately renounced\\n\\t\\t\\t\\tguidance. (A) Cf. ii. 161-62."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "88",
    "NoteID": "418",
    "Body": "The Muslim position is clear. The Muslim does not claim\\n\\t\\t\\t\\tto have a religion peculiar to himself. Islam is not a\\n\\t\\t\\t\\tsect or an ethnic religion. In its view all Religion is\\n\\t\\t\\t\\tone, for the Truth is one. It was the religion preached\\n\\t\\t\\t\\tby all the earlier Prophets. It was the truth taught by\\n\\t\\t\\t\\tall the inspired Books. In essence it amounts to a\\n\\t\\t\\t\\tconsciousness of the Will and Plan of Allah and a joyful\\n\\t\\t\\t\\tsubmission to that Will and Plan. If any one wants a\\n\\t\\t\\t\\treligion other than that, he is false to his own nature,\\n\\t\\t\\t\\tas he is false to Allah's Will and Plan. Such a one\\n\\t\\t\\t\\tcannot expect guidance, for he has deliberately renounced\\n\\t\\t\\t\\tguidance. (A) Cf. ii. 161-62."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "92",
    "NoteID": "419",
    "Body": "The test of charity is: do you give something that you\\n\\t\\t\\t\\tvalue greatly, something that you love? If you give your\\n\\t\\t\\t\\tlife in a Cause, that is the greatest gift you can give.\\n\\t\\t\\t\\tIf you give yourself, that is, your personal efforts,\\n\\t\\t\\t\\tyour talents, your skill, your learning, that comes next\\n\\t\\t\\t\\tin degree. If you give your earnings, your property, your\\n\\t\\t\\t\\tpossessions, that is also a great gift; for many people\\n\\t\\t\\t\\tlove them even more than other things. And there are less\\n\\t\\t\\t\\ttangible things, such as position, reputation, the\\n\\t\\t\\t\\twell-being of those we love, the regard of those who can\\n\\t\\t\\t\\thelp us, etc. It is unselfishness that Allah demands, and\\n\\t\\t\\t\\tthere is no act of unselfishness, however small or\\n\\t\\t\\t\\tintangible, but is well within the knowledge of Allah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "93",
    "NoteID": "420",
    "Body": "The Arabs ate the flesh of the camel, which is lawful in\\n\\t\\t\\t\\tIslam, but it was prohibited by the Jewish Law of Moses\\n\\t\\t\\t\\t(Leviticus xi. 4). But that Law was very strict because\\n\\t\\t\\t\\tof the \"hardness of heart\" of Israel, because of Israel's\\n\\t\\t\\t\\tinsolence and iniquity (Q. vi. 146). Before it was\\n\\t\\t\\t\\tpromulgated Israel was free to choose its own food."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "95",
    "NoteID": "421",
    "Body": "The greater freedom of Islam in the matter of the\\n\\t\\t\\t\\tceremonial law, compared with the Mosaic Law, is not a\\n\\t\\t\\t\\treproach but a recommendation. We go back to an older\\n\\t\\t\\t\\tsource than Judaism,-the institutions of Abraham. By\\n\\t\\t\\t\\tcommon consent his Faith was sound, and he was certainly\\n\\t\\t\\t\\tnot a Pagan, a term contemptuously applied to the Arabs\\n\\t\\t\\t\\tby the Jews."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "96",
    "NoteID": "422",
    "Body": "Bakka: same as Makkah, perhaps an older name. The\\n\\t\\t\\t\\tfoundation of the Ka'ba goes back to Abraham."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "96",
    "NoteID": "423",
    "Body": "'Alamin: all the worlds (i. 2. ii), all kinds of beings;\\n\\t\\t\\t\\tall nations (iii. 42): all creatures (iii. 97),"
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "97",
    "NoteID": "424",
    "Body": "Station of Abraham: see ii. 125 and n. 125."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "97",
    "NoteID": "425",
    "Body": "See reference in last note."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "99",
    "NoteID": "426",
    "Body": "Cf. iii. 81."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "102",
    "NoteID": "427",
    "Body": "Fear is of many kinds: (1) the abject fear of the coward;\\n\\t\\t\\t\\t(2) the fear of a child or an inexperienced person in the\\n\\t\\t\\t\\tface of an unknown danger; (3) the fear of a reasonable\\n\\t\\t\\t\\tman who wishes to avoid harm to himself or to people whom\\n\\t\\t\\t\\the wishes to protect; (4) the reverence which is akin to\\n\\t\\t\\t\\tlove, for it fears to do anything which is not pleasing\\n\\t\\t\\t\\tto the object of love. The first is unworthy of man; the\\n\\t\\t\\t\\tsecond is necessary for one immature; the third is a\\n\\t\\t\\t\\tmanly precaution against evil as long as it is\\n\\t\\t\\t\\tunconquered; and the fourth is the seed-bed of\\n\\t\\t\\t\\trighteousness. Those mature in faith cultivate the\\n\\t\\t\\t\\tfourth: at earlier stages, the third or the second may be\\n\\t\\t\\t\\tnecessary; they are fear, but not the fear of Allah. The\\n\\t\\t\\t\\tfirst is a feeling of which anyone should be ashamed."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "102",
    "NoteID": "428",
    "Body": "Our whole being should be permeated with Islam: it is not\\n\\t\\t\\t\\ta mere veneer or outward show."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "103",
    "NoteID": "429",
    "Body": "The simile is that of people struggling in deep water, to\\n\\t\\t\\t\\twhom a benevolent Providence stretches out a strong and\\n\\t\\t\\t\\tunbreakable rope of rescue. If all hold fast to it\\n\\t\\t\\t\\ttogether, their mutual support adds to the chance of\\n\\t\\t\\t\\ttheir safety."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "103",
    "NoteID": "430",
    "Body": "Yathrib was torn with civil and tribal feuds and\\n\\t\\t\\t\\tdissensions before the Messenger of Allah set his feet on\\n\\t\\t\\t\\tits soil. After that, it became the City of the Prophet,\\n\\t\\t\\t\\tMadinah, and unmatched Brotherhood, and the pivot of\\n\\t\\t\\t\\tIslam. This poor quarrelsome world is a larger Yathrib:\\n\\t\\t\\t\\tcan we establish the sacred feet on its soil, and make it\\n\\t\\t\\t\\ta new and larger Madinah?"
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "104",
    "NoteID": "431",
    "Body": "Muflih, aflaha, falah: the root idea is attainment of\\n\\t\\t\\t\\tdesires; happiness, in this world and the next; success;\\n\\t\\t\\t\\tprosperity; freedom from anxiety, care, or a disturbed\\n\\t\\t\\t\\tstate of mind;-the opposite of\\t'azab in the next verse,\\n\\t\\t\\t\\twhich includes: failure; misery; punishment or penalty;\\n\\t\\t\\t\\tagony or anguish. The ideal Muslim community is happy,\\n\\t\\t\\t\\tuntroubled by conflicts or doubts, sure of itself,\\n\\t\\t\\t\\tstrong, united, and prosperous: because it invites to all\\n\\t\\t\\t\\tthat is good; enjoins the right; and forbids the wrong,-a\\n\\t\\t\\t\\tmaster-stroke of description in three clauses."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "106",
    "NoteID": "432",
    "Body": "The \"face\" (wajh) expresses our Personality, our inmost\\n\\t\\t\\t\\tbeing. White is the colour of Light; to become white is\\n\\t\\t\\t\\tto be illumined with Light, which stands for felicity,\\n\\t\\t\\t\\tthe rays of the glorious light of Allah. Black is the\\n\\t\\t\\t\\tcolour of darkness, sin, rebellion, misery; removal from\\n\\t\\t\\t\\tthe grace and light of Allah. These are the Signs of\\n\\t\\t\\t\\theaven and hell. The standard of decision in all\\n\\t\\t\\t\\tquestions is the justice of Allah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "109",
    "NoteID": "433",
    "Body": "Cf. ii. 210."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "110",
    "NoteID": "434",
    "Body": "The logical conclusion to a Universal Religion is a\\n\\t\\t\\t\\tnon-sectarian, non-racial, non-doctrinal, religion, which\\n\\t\\t\\t\\tIslam claims to be. For Islam is just submission to the\\n\\t\\t\\t\\tWill of Allah. This implies (1) Faith, (2) doing right,\\n\\t\\t\\t\\tbeing an example to others to do right, and having the\\n\\t\\t\\t\\tpower to see that the right prevails, (3) eschewing\\n\\t\\t\\t\\twrong, being an example to others to eschew wrong, and\\n\\t\\t\\t\\thaving the power to see that wrong and injustice are\\n\\t\\t\\t\\tdefeated. Islam therefore lives, not for itself, but for\\n\\t\\t\\t\\tmankind. The People of the Book, if only they had faith,\\n\\t\\t\\t\\twould be Muslims, for they have been prepared for Islam.\\n\\t\\t\\t\\tUnfortunately there is Unfaith, but it can never harm\\n\\t\\t\\t\\tthose who carry the banner of Faith and Right, which must\\n\\t\\t\\t\\talways be victorious."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "112",
    "NoteID": "435",
    "Body": "Dhuribat. I think there is a simile from the pitching of\\n\\t\\t\\t\\ta tent. Ordinarily a man's tent is a place of\\n\\t\\t\\t\\ttranquillity and honour for him. The tent of the wicked\\n\\t\\t\\t\\twherever they are found is ignominy, shame, and\\n\\t\\t\\t\\thumiliation. It is pity from Allah or from men that gives\\n\\t\\t\\t\\tthem protection when their pride has a fall. Using the\\n\\t\\t\\t\\tsame simile of tent in another way, their home will be\\n\\t\\t\\t\\tdestitution and misery."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "112",
    "NoteID": "436",
    "Body": "Cf. iii. 21, n. 363."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "113",
    "NoteID": "437",
    "Body": "In Islam we respect sincere faith and true righteousness\\n\\t\\t\\t\\tin accordance with the Qur-An and Sunnah. This verse,\\n\\t\\t\\t\\taccording to Commentators, refers to those People of the\\n\\t\\t\\t\\tBook who eventually embraced Islam."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "116",
    "NoteID": "438",
    "Body": "Cf. iii. 10."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "117",
    "NoteID": "439",
    "Body": "False \"spending\" may be either in false \"charity\" or in\\n\\t\\t\\t\\thaving a \"good time\". For the man who resists Allah's\\n\\t\\t\\t\\tpurpose, neither of them is any good. The essence of\\n\\t\\t\\t\\tcharity is faith and love. Where these are wanting,\\n\\t\\t\\t\\tcharity is no charity. Some baser motive is there:\\n\\t\\t\\t\\tostentation, or even worse, getting a person into the\\n\\t\\t\\t\\tgiver's power by a pretence of charity, something that is\\n\\t\\t\\t\\tconnected with the life of this grasping, material world.\\n\\t\\t\\t\\tWhat happens? You expect a good harvest. But \"while you\\n\\t\\t\\t\\tthink, good easy man, full surely your greatness is\\n\\t\\t\\t\\ta-ripening,\" there comes a nipping frost, and destroys\\n\\t\\t\\t\\tall your hopes. The frost is some calamity, or the fact\\n\\t\\t\\t\\tthat you are found out! Or perhaps it is \"High blown\\n\\t\\t\\t\\tpride,\" as in Shakespeare's Henry VIII. ii. 3. In your\\n\\t\\t\\t\\tdespair you may blame blind Fate or you may blame Allah!\\n\\t\\t\\t\\tBlind Fate does not exist, for there is Allah's\\n\\t\\t\\t\\tProvidence, which is just and good. The harm or injustice\\n\\t\\t\\t\\thas come, not from Allah, but from your own soul. You\\n\\t\\t\\t\\twronged your soul, and it suffered the frost. Your base\\n\\t\\t\\t\\tmotive brought you no good: it may have reduced you to\\n\\t\\t\\t\\tpoverty, shame, and disgrace. All the brave show of the\\n\\t\\t\\t\\twicked in this life is but a wind charged with evil to\\n\\t\\t\\t\\tthemselves."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "119",
    "NoteID": "440",
    "Body": "Islam gives you the complete revelation, \"the whole of\\n\\t\\t\\t\\tthe Book,\" though partial revelations have come in all\\n\\t\\t\\t\\tages. (Cf. iii. 23, and n. 366)."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "119",
    "NoteID": "441",
    "Body": "Cf. ii. 14."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "121",
    "NoteID": "442",
    "Body": "The battle of Uhud was a great testing time for the young\\n\\t\\t\\t\\tMuslim community. Their mettle and the wisdom and\\n\\t\\t\\t\\tstrength of their Leader were shown in the battle of Badr\\n\\t\\t\\t\\t(iii. 13 and note), in which the Makkan Pagans suffered a\\n\\t\\t\\t\\tcrushing defeat. The Makkans were determined to wipe off\\n\\t\\t\\t\\ttheir disgrace and to annihilate the Muslims in Madinah.\\n\\t\\t\\t\\tTo this end they collected a large force and marched to\\n\\t\\t\\t\\tMadinah. They numbered some 3,000 fighting men under Abu\\n\\t\\t\\t\\tSufyan, and they were so confident of victory that their\\n\\t\\t\\t\\twomen-folk came with them, and showed the most shameful\\n\\t\\t\\t\\tsavagery after the battle. To meet the threatened danger\\n\\t\\t\\t\\tthe Messenger of Allah, Muhammad Al-Mustafa, with his\\n\\t\\t\\t\\tusual foresight, courage, and initiative, resolved to\\n\\t\\t\\t\\ttake his station at the foot of Mount Uhud, which\\n\\t\\t\\t\\tdominates the city of Madinah some three miles to the\\n\\t\\t\\t\\tnorth. Early in the morning, on the 7th of Shawwal, A.H.\\n\\t\\t\\t\\t3 (January, 625), he made his dispositions for battle.\\n\\t\\t\\t\\tMadinah winters are notoriously rigorous, but the\\n\\t\\t\\t\\twarriors of Islam (700 to 1000 in number) were up early.\\n\\t\\t\\t\\tA torrent bed was to their south, and the passes in the\\n\\t\\t\\t\\thills at their back were filled with 50 archers to\\n\\t\\t\\t\\tprevent the enemy attack from the rear. The enemy were\\n\\t\\t\\t\\tset the task of attacking the walls of Madinah, with the\\n\\t\\t\\t\\tMuslims at their rear. In the beginning the battle went\\n\\t\\t\\t\\twell for the Muslims. The enemy wavered, but the Muslim\\n\\t\\t\\t\\tarchers, in disobedience of their orders, left their\\n\\t\\t\\t\\tposts to join in the pursuit and share in the booty.\\n\\t\\t\\t\\tThere was also treachery on the part of the 300\\n\\t\\t\\t\\t\"Hypocrites\" led by Abdullah ibn Ubai, who deserted. The\\n\\t\\t\\t\\tenemy took advantage of the opening left by the archers,\\n\\t\\t\\t\\tand there was severe hand-to-hand fighting, in which\\n\\t\\t\\t\\tnumbers told in favour of the enemy. Many of the\\n\\t\\t\\t\\tCompanions and Helpers were killed. But there was no\\n\\t\\t\\t\\trout. Among the Muslim martyrs was the gallant Hamza, a\\n\\t\\t\\t\\tbrother of the Prophet's father. The graves of the\\n\\t\\t\\t\\tmartyrs are still shown at Uhud. The Messenger himself\\n\\t\\t\\t\\twas wounded in his head and face, and one of his front\\n\\t\\t\\t\\tteeth was broken. Had it not been for his firmness,\\n\\t\\t\\t\\tcourage, and coolness, all would have been lost. As it\\n\\t\\t\\t\\twas, the prophet, in spite of his wound, and many of the\\n\\t\\t\\t\\twounded Muslims, inspired by his example, returned to the\\n\\t\\t\\t\\tfield next day, and Abu Sufyan and his Makkan army\\n\\t\\t\\t\\tthought it most prudent to withdraw. Madinah was saved,\\n\\t\\t\\t\\tbut a lesson in faith, constancy, firmness, and\\n\\t\\t\\t\\tsteadfastness was learnt by the Muslims."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "122",
    "NoteID": "443",
    "Body": "The two parties wavering in their minds were probably the\\n\\t\\t\\t\\tBanu Salma Khazraji and the Banu Haritha, but they\\n\\t\\t\\t\\trallied under the Prophet's inspiration. That incident\\n\\t\\t\\t\\tshows that man may be weak, but if he allows his weak\\n\\t\\t\\t\\twill to be governed by the example of men of God, he may\\n\\t\\t\\t\\tyet retrieve his weakness."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "123",
    "NoteID": "444",
    "Body": "Gratitude to Allah is not to be measured by words. It\\n\\t\\t\\t\\tshould show itself in conduct and life. If all the\\n\\t\\t\\t\\tMuslims had learnt the true lesson from the victory at\\n\\t\\t\\t\\tBadr, their archers would not have left the posts\\n\\t\\t\\t\\tappointed for them, nor the two tribes mentioned in the\\n\\t\\t\\t\\tlast note ever wavered in their faith."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "124",
    "NoteID": "445",
    "Body": "Read verse 124 with the following five verses, to get its\\n\\t\\t\\t\\tfull signification."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "125",
    "NoteID": "446",
    "Body": "Musawwim: this is the active voice of the verb, not to be\\n\\t\\t\\t\\tconfused with the passive voice in iii. 14, which has a\\n\\t\\t\\t\\tdifferent signification."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "126",
    "NoteID": "447",
    "Body": "Whatever happens, whether there is a miracle or not, all\\n\\t\\t\\t\\thelp proceeds from Allah. Man should not be so arrogant\\n\\t\\t\\t\\tas to suppose that his own resources will change the\\n\\t\\t\\t\\tcurrent of the world plan. Allah helps those who show\\n\\t\\t\\t\\tconstancy, courage, and discipline, and use all the human\\n\\t\\t\\t\\tmeans at their disposal, not those who fold their hands\\n\\t\\t\\t\\tand have no faith. But Allah's help is determined on\\n\\t\\t\\t\\tconsiderations exalted far above our petty human motive,\\n\\t\\t\\t\\tand by perfect wisdoms, of which we can have only faint\\n\\t\\t\\t\\tglimpses."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "127",
    "NoteID": "448",
    "Body": "A fringe of the Unbelievers: an extremity, an end, either\\n\\t\\t\\t\\tupper or lower. Here it may mean that the chiefs of the\\n\\t\\t\\t\\tMakkan Pagans, who had come to exterminate the Muslims\\n\\t\\t\\t\\twith such confidence, went back frustrated in their\\n\\t\\t\\t\\tpurpose. The shameless cruelty with which they and their\\n\\t\\t\\t\\twomen mutilated the Muslim corpses on the battle-field\\n\\t\\t\\t\\twill stand recorded to their eternal infamy. Perhaps it\\n\\t\\t\\t\\talso exposed their real nature to some of those who\\n\\t\\t\\t\\tfought for them. e.g., Khalid ibn Al-Walid, who not only\\n\\t\\t\\t\\taccepted Islam afterwards, but became one of the most\\n\\t\\t\\t\\tnotable champions of Islam. He was with the Muslims in\\n\\t\\t\\t\\tthe conquest of Makkah and later on, won distinguished\\n\\t\\t\\t\\thonours in Syria and 'Iraq."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "128",
    "NoteID": "449",
    "Body": "Uhud is as much a sign-post for Islam as Badr. For us in\\n\\t\\t\\t\\tthese latter days it carries an ever greater lesson.\\n\\t\\t\\t\\tAllah's help will come if we have faith, obedience,\\n\\t\\t\\t\\tdiscipline, unity, and the spirit of acting in\\n\\t\\t\\t\\trighteousness and justice. If we fail, His mercy is\\n\\t\\t\\t\\talways open to us. But it is also open to our enemies,\\n\\t\\t\\t\\tand those who seem to us His enemies. His Plan may be to\\n\\t\\t\\t\\tbring sinners to repentance, and to teach us\\n\\t\\t\\t\\trighteousness and wisdom through those who seem in our\\n\\t\\t\\t\\teyes to be rebellious or even defiant. There may be good\\n\\t\\t\\t\\tin them that He sees and we do not,-a humbling thought\\n\\t\\t\\t\\tthat must lead to our own self-examination and\\n\\t\\t\\t\\tself-improvement."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "130",
    "NoteID": "450",
    "Body": "Cf. ii. 275 and note. The last verse spoke of\\n\\t\\t\\t\\tforgiveness, even to enemies. If such mercy is granted by\\n\\t\\t\\t\\tAllah to erring sinners, how much more is it incumbent on\\n\\t\\t\\t\\tus, poor sinners to refrain from oppressing our\\n\\t\\t\\t\\tfellow-beings in need, in matters of mere material and\\n\\t\\t\\t\\tephemeral wealth? Usury is the opposite extreme of\\n\\t\\t\\t\\tcharity, unselfishness, striving, and giving of ourselves\\n\\t\\t\\t\\tin the service of Allah and of our fellow-men."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "130",
    "NoteID": "451",
    "Body": "Real prosperity consists, not in greed, but in\\n\\t\\t\\t\\tgiving,-the giving of ourselves and of our substance in\\n\\t\\t\\t\\tthe cause of Allah and Allah's truth and in the service\\n\\t\\t\\t\\tof Allah's creatures."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "133",
    "NoteID": "452",
    "Body": "The Fire (iii. 131) is, as always, contrasted with the\\n\\t\\t\\t\\tGarden,-in other words. Hell contrasted with Heaven, we\\n\\t\\t\\t\\tare told that its width alone is that of the whole of the\\n\\t\\t\\t\\theavens and the earth,-all the creation we can imagine."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "134",
    "NoteID": "453",
    "Body": "Another definition of the righteous (vv. 134-35). So far\\n\\t\\t\\t\\tfrom grasping material wealth, they give freely, of\\n\\t\\t\\t\\tthemselves and their substance, not only when they are\\n\\t\\t\\t\\twell-off and it is easy for them to do so, but also when\\n\\t\\t\\t\\tthey arc in difficulties, for other people may be in\\n\\t\\t\\t\\tdifficulties at the same time. They do not get ruffled in\\n\\t\\t\\t\\tadversity, or get angry when other people behave badly,\\n\\t\\t\\t\\tor their own good plans fail. On the contrary they\\n\\t\\t\\t\\tredouble their efforts. For the charity-or good deeds-is\\n\\t\\t\\t\\tall the more necessary in adversity. And they do not\\n\\t\\t\\t\\tthrow the blame on others. Even where such blame is due\\n\\t\\t\\t\\tand correction is necessary, their own mind is free from\\n\\t\\t\\t\\ta sense of grievance, for they forgive and cover other\\n\\t\\t\\t\\tmen's faults. This as far as other people are concerned.\\n\\t\\t\\t\\tBut we may be ourselves at fault, and perhaps we brought\\n\\t\\t\\t\\tsome calamity on ourselves. The righteous man is not\\n\\t\\t\\t\\tnecessarily perfect. In such circumstances his behaviour\\n\\t\\t\\t\\tis described in the next verse."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "135",
    "NoteID": "454",
    "Body": "The righteous man, when he finds he has fallen into sin\\n\\t\\t\\t\\tor error, does not whine or despair, but asks for Allah's\\n\\t\\t\\t\\tforgiveness, and his faith gives him hope. If he is\\n\\t\\t\\t\\tsincere, that means that he abandons his wrong conduct\\n\\t\\t\\t\\tand makes amends."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "135",
    "NoteID": "455",
    "Body": "Sin is a sort of oppression of ourselves by ourselves.\\n\\t\\t\\t\\tThis follows from the doctrine of personal\\n\\t\\t\\t\\tresponsibility, as opposed to that of blind fate or of an\\n\\t\\t\\t\\tangry God or gods lying in wait for revenge or injury on\\n\\t\\t\\t\\tmankind."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "137",
    "NoteID": "456",
    "Body": "Cf. Tennyson (In Memoriam): \"Our little systems have\\n\\t\\t\\t\\ttheir day. They have their day and cease to be: They are\\n\\t\\t\\t\\tbut broken lights of Thee, And Thou, 0 Lord! art more\\n\\t\\t\\t\\tthan they.\" Only Allah's Truth will last, and it will\\n\\t\\t\\t\\tgain the mastery in the end. If there is defeat, we must\\n\\t\\t\\t\\tnot be dejected, lose heart, or give up the struggle.\\n\\t\\t\\t\\tFaith means hope, activity, striving steadfastly on to\\n\\t\\t\\t\\tthe goal. Sunan: different ways by which the ancient\\n\\t\\t\\t\\tpeople like Ad, Thamud, the people of the Prophet Nuh\\n\\t\\t\\t\\twere treated because of their arrogance, disobedience and\\n\\t\\t\\t\\trejection of faith."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "140",
    "NoteID": "457",
    "Body": "These general considerations apply in particular to the\\n\\t\\t\\t\\tdisaster at Uhud. (1) In a fight for truth, if you are\\n\\t\\t\\t\\thurt, be sure the adversary has suffered hurt also, the\\n\\t\\t\\t\\tmore so as he has no faith to sustain him. (2) Success or\\n\\t\\t\\t\\tfailure in this world comes to all at varying times: we\\n\\t\\t\\t\\tmust not grumble, as we do not see the whole of Allah's\\n\\t\\t\\t\\tPlan. (3) Men's true mettle is known in adversity as gold\\n\\t\\t\\t\\tis assayed in fire; Cf. also iii. 154, n. 467. (4)\\n\\t\\t\\t\\tMartyrdom is in itself an honour and a privilege: how\\n\\t\\t\\t\\tglorious is the fame of Hamza the Martyr? (5) If there is\\n\\t\\t\\t\\tany dross in us, it will be purified by resistance and\\n\\t\\t\\t\\tstruggle. (6) When evil is given rope a little, it works\\n\\t\\t\\t\\tout its own destruction; the orgies of cruelty indulged\\n\\t\\t\\t\\tin by the Pagans after what they supposed to be their\\n\\t\\t\\t\\tvictory at Uhud filled up their cup of iniquity; it lost\\n\\t\\t\\t\\tthem the support and adherence of the best in their own\\n\\t\\t\\t\\tranks, and hastened the destruction of Paganism from\\n\\t\\t\\t\\tArabia. Cf. iii. 127 and ii. 448."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "142",
    "NoteID": "458",
    "Body": "The purge or purification was in two senses. (1) It\\n\\t\\t\\t\\tcleared out the Hypocrites from the ranks of the Muslim\\n\\t\\t\\t\\twarriors. (2) The testing-time strengthened the faith of\\n\\t\\t\\t\\tthe weak and wavering: for suffering has its own mission\\n\\t\\t\\t\\tin life. The Prophet's example-wounded but staunch, and\\n\\t\\t\\t\\tfirmer than ever-put new life into the Community."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "144",
    "NoteID": "460",
    "Body": "This verse primarily applies to the battle of Uhud, in\\n\\t\\t\\t\\tthe course of which a cry was raised that the Messenger\\n\\t\\t\\t\\twas slain. He had indeed been severely wounded, but\\n\\t\\t\\t\\tTalha, Abu Bakr, and Ali were at his side, and his own\\n\\t\\t\\t\\tunexampled bravery saved the Muslim army from a rout.\\n\\t\\t\\t\\tThis verse was recalled again by Abu Bakr when the\\n\\t\\t\\t\\tMessenger actually died a natural death eight years\\n\\t\\t\\t\\tlater, to remind people that Allah, Whose Message he\\n\\t\\t\\t\\tbrought, lives for ever. And have need to remember this\\n\\t\\t\\t\\tnow and often for two reasons: (1) when we feel inclined\\n\\t\\t\\t\\tto pay more than human honour to one who was the truest,\\n\\t\\t\\t\\tthe purest, and the greatest of men, and thus in a sense\\n\\t\\t\\t\\tto compound for our forgetting the spirit of his\\n\\t\\t\\t\\tteaching, and (2) when we feel depressed at the chances\\n\\t\\t\\t\\tand changes of time, and forget that Allah lives and\\n\\t\\t\\t\\twatches over us and over all His creatures now as in a\\n\\t\\t\\t\\thistory in the past and in the future."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "145",
    "NoteID": "461",
    "Body": "There is a slight touch of irony in this. As applied to\\n\\t\\t\\t\\tthe archers at Uhud, who deserted their post for the sake\\n\\t\\t\\t\\tof plunder, they might have got some plunder, but they\\n\\t\\t\\t\\tput themselves and the whole of their army into jeopardy.\\n\\t\\t\\t\\tFor a little worldly gain, they nearly lost their souls.\\n\\t\\t\\t\\tOn the other hand, those who took the long view and\\n\\t\\t\\t\\tfought with staunchness and discipline,-their reward was\\n\\t\\t\\t\\tswift and sure. If they died, they got the crown of\\n\\t\\t\\t\\tmartyrdom. If they lived, they were heroes honoured in\\n\\t\\t\\t\\tthis life and the next."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "152",
    "NoteID": "462",
    "Body": "The order was: not to leave the post and strictly to\\n\\t\\t\\t\\tmaintain discipline. Uhud was in the beginning a victory\\n\\t\\t\\t\\tfor the Muslims. Many of the enemy were slain, and they\\n\\t\\t\\t\\twere retiring when a part of the Muslims, against orders,\\n\\t\\t\\t\\tran in pursuit, attracted by the prospects of booty. See\\n\\t\\t\\t\\tnote to iii. 121."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "152",
    "NoteID": "463",
    "Body": "The disobedience seemed at first pleasant: they were\\n\\t\\t\\t\\tchasing the enemy, and there was the prospect of booty.\\n\\t\\t\\t\\tBut when the gap was noticed by the enemy, they turned\\n\\t\\t\\t\\tthe flank round the hill and nearly overwhelmed the\\n\\t\\t\\t\\tMuslims. Had it not been for Allah's grace, and the\\n\\t\\t\\t\\tfirmness of their Prophet and his immediate Companions,\\n\\t\\t\\t\\tthey would have been finished."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "153",
    "NoteID": "464",
    "Body": "It would seem that a party of horsemen led by the dashing\\n\\t\\t\\t\\tKhalid ibn Al-walid came through the gap in the passes\\n\\t\\t\\t\\twhere the Muslim archers should have been, and in the\\n\\t\\t\\t\\tconfusion that arose, the retreating foe rallied and\\n\\t\\t\\t\\tturned back on the Muslims. From the low ground on the\\n\\t\\t\\t\\tbank of the valley the Muslims retreated in their turn\\n\\t\\t\\t\\tand tried to gain the hill. They had a double loss: (1)\\n\\t\\t\\t\\tthey were baulked of the booty they had run after, and\\n\\t\\t\\t\\t(2) their own lives and the lives of their whole army\\n\\t\\t\\t\\twere in danger, and many lives were actually lost from\\n\\t\\t\\t\\ttheir ranks. Their own lives being in danger, they had\\n\\t\\t\\t\\thardly time to grieve for the general calamity. But it\\n\\t\\t\\t\\tsteadied them, and some of them stood the test."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "154",
    "NoteID": "465",
    "Body": "After the first surprise, when the enemy turned on them,\\n\\t\\t\\t\\ta great part of the Muslims did their best, and seeing\\n\\t\\t\\t\\ttheir mettle, the enemy withdrew to his camp. There was a\\n\\t\\t\\t\\tlull; the wounded had rest; those who had fought the hard\\n\\t\\t\\t\\tfight were visited by kindly Sleep, sweet Nature's nurse.\\n\\t\\t\\t\\tIn contrast to them was the band of Hypocrites, whose\\n\\t\\t\\t\\tbehaviour is described in the next note."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "154",
    "NoteID": "466",
    "Body": "The Hypocrites withdrew from the fighting. Apparently\\n\\t\\t\\t\\tthey had been among those who had been counselling the\\n\\t\\t\\t\\tdefence of Madinah within the walls instead of boldly\\n\\t\\t\\t\\tcoming out to meet the enemy. Their distress was caused\\n\\t\\t\\t\\tby their own mental state: the sleep of the just was\\n\\t\\t\\t\\tdenied them: and they continued to murmur of what might\\n\\t\\t\\t\\thave been. Only fools do so: wise men face actualities."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "154",
    "NoteID": "467",
    "Body": "That testing by Allah is not in order that it may add to\\n\\t\\t\\t\\tHis knowledge, for He knows all. It is in order to help\\n\\t\\t\\t\\tus subjectively, to mould our will, and purge us of any\\n\\t\\t\\t\\tgrosser motives, that will be searched out by calamity.\\n\\t\\t\\t\\tIf it is a hardened sinner, the test brings conviction\\n\\t\\t\\t\\tout of his own self. Cf. also iii. 140."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "155",
    "NoteID": "468",
    "Body": "It was the duty of all who were able to fight, to fight\\n\\t\\t\\t\\tin the sacred cause at Uhud. But a small section were\\n\\t\\t\\t\\ttimid; they were not quite as bad as those who railed\\n\\t\\t\\t\\tagainst Allah, or those who thoughtlessly disobeyed\\n\\t\\t\\t\\torders. But they still failed in their duty. It is our\\n\\t\\t\\t\\tinner motives that Allah regards. These timorous people\\n\\t\\t\\t\\twere forgiven by Allah. Perhaps they were given another\\n\\t\\t\\t\\tchance: perhaps they rose to it and did their duty then."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "156",
    "NoteID": "469",
    "Body": "It is want of faith that makes people afraid (1) of\\n\\t\\t\\t\\tmeeting death, (2) of doing their duty when it involves\\n\\t\\t\\t\\tdanger, as in travelling in order to earn an honest\\n\\t\\t\\t\\tliving, or fighting in a sacred cause. Such fear is part\\n\\t\\t\\t\\tof the punishment for want of faith. If you have faith,\\n\\t\\t\\t\\tthere is no fear in meeting death, for it brings you\\n\\t\\t\\t\\tnearer to your goal, nor in meeting danger for a\\n\\t\\t\\t\\tsufficient cause, because you know that the keys of life\\n\\t\\t\\t\\tand death are in Allah's hands. Nothing can happen\\n\\t\\t\\t\\twithout Allah's Will. If it is Allah's Will that you\\n\\t\\t\\t\\tshould die, your staying at home will not save you. If it\\n\\t\\t\\t\\tis His Will that you should live, the danger you incur in\\n\\t\\t\\t\\ta just cause brings you glory. Supposing it is His Will\\n\\t\\t\\t\\tthat you should lose your life in the danger, there are\\n\\t\\t\\t\\tthree considerations that would make you eager to meet\\n\\t\\t\\t\\tit: (1) dying in doing your duty is the best means of\\n\\t\\t\\t\\treaching Allah's Mercy; (2) the man of faith knows that\\n\\t\\t\\t\\the is not going to an unknown country of which he has no\\n\\t\\t\\t\\tnews; he is going nearer to Allah; and (3) he is being\\n\\t\\t\\t\\t\"brought together\" unto Allah; i.e., he will meet all his\\n\\t\\t\\t\\tdear ones in faith: instead of the separation which the\\n\\t\\t\\t\\tsouls without faith fear, he looks forward to a surer\\n\\t\\t\\t\\treunion than is possible in this life."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "157",
    "NoteID": "470",
    "Body": "Notice a beautiful little literary touch here. At first\\n\\t\\t\\t\\tsight you would expect the second person here (\"you could\\n\\t\\t\\t\\tamass\"), to match the second person in the earlier\\n\\t\\t\\t\\tclause. But remember that the second person in earlier\\n\\t\\t\\t\\tclause refers to the man of faith, and the third person\\n\\t\\t\\t\\tin the last line refers to the Unbelievers; as if it\\n\\t\\t\\t\\tsaid: \"Of course you as a man of faith would not be for\\n\\t\\t\\t\\thoarding riches: your wealth,-duty and the mercy of\\n\\t\\t\\t\\tAllah,-is far more precious than anything the Unbelievers\\n\\t\\t\\t\\tcan amass in their selfish lives. \""
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "159",
    "NoteID": "471",
    "Body": "The extremely gentle nature of Muhammad endeared him to\\n\\t\\t\\t\\tall, and it is reckoned as one of the Mercies of Allah.\\n\\t\\t\\t\\tOne of the Prophet's titles is \"A Mercy to all Creation.\"\\n\\t\\t\\t\\tAt no time was this gentleness, this mercy, this\\n\\t\\t\\t\\tlong-suffering with human weaknesses, more valuable than\\n\\t\\t\\t\\tafter a disaster like that at Uhud. It is a quality,\\n\\t\\t\\t\\twhich then, as always, bound and binds the souls of\\n\\t\\t\\t\\tcountless men to him."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "161",
    "NoteID": "472",
    "Body": "Besides the gentleness of his nature, Al-Mustafa was\\n\\t\\t\\t\\tknown from his earliest life for his trustworthiness.\\n\\t\\t\\t\\tHence his title of Al-Amin. Unscrupulous people often\\n\\t\\t\\t\\tread their own low motives into other men, and their\\n\\t\\t\\t\\taccusation, which is meant to injure, fastens on the\\n\\t\\t\\t\\tvarious virtues for which the man they attack is well\\n\\t\\t\\t\\tknown. Some of the Hypocrites after Uhud raised some\\n\\t\\t\\t\\tdoubts about the division of the spoils, thinking to sow\\n\\t\\t\\t\\tthe seeds of poison in the hearts of the men who had\\n\\t\\t\\t\\tdeserted their posts in their craving for booty. Those\\n\\t\\t\\t\\tlow suspicions were never believed in by any sensible\\n\\t\\t\\t\\tpeople, and they have no interest for us now. But the\\n\\t\\t\\t\\tgeneral principles here declared are of eternal value.\\n\\t\\t\\t\\t(1) Prophets of Allah do not act from unworthy motives.\\n\\t\\t\\t\\t(2) Those who act from such motives are the lowest of\\n\\t\\t\\t\\tcreatures, and they will make no profit, (3) A prophet of\\n\\t\\t\\t\\tAllah is not to be judged by the same standard as a\\n\\t\\t\\t\\tgreedy creature. (4) in Allah's eyes there are various\\n\\t\\t\\t\\tgrades of men, and we must try to understand and\\n\\t\\t\\t\\tappreciate such grades. If we trust our Leader, we shall\\n\\t\\t\\t\\tnot question his honesty without cause. If he is\\n\\t\\t\\t\\tdishonest, he is not fit to be a leader."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "164",
    "NoteID": "473",
    "Body": "Cf. ii. 151."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "165",
    "NoteID": "474",
    "Body": "If Uhud was a reverse to the Muslims, they had inflicted\\n\\t\\t\\t\\ta reverse twice as great on the Makkans at Badr. This\\n\\t\\t\\t\\treverse was not without Allah's permission, for He wanted\\n\\t\\t\\t\\tto test and purify the faith of those who followed Islam,\\n\\t\\t\\t\\tand to show them that they must strive and do all in\\n\\t\\t\\t\\ttheir power to deserve Allah's help. If they disobeyed\\n\\t\\t\\t\\torders and neglected discipline, they must attribute the\\n\\t\\t\\t\\tdisaster to themselves and not to Allah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "166",
    "NoteID": "475",
    "Body": "Test: literally know. See n. 467 to iii. 154."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "167",
    "NoteID": "476",
    "Body": "The testing of the Hypocrites was the searching out of\\n\\t\\t\\t\\ttheir motives and exposing them to the sight of their\\n\\t\\t\\t\\tbrethren, who might otherwise have been taken in. In the\\n\\t\\t\\t\\tfirst place they gave counsels of caution: in their minds\\n\\t\\t\\t\\tit was nothing but cowardice. In the second place, what\\n\\t\\t\\t\\tthey wished was not the good of the community but its\\n\\t\\t\\t\\tbeing placed in a contemptible position. When others were\\n\\t\\t\\t\\tfor self-sacrifice, they were for ease and fair words.\\n\\t\\t\\t\\tPretending to be Muslims, they were nearer to Unbelief.\\n\\t\\t\\t\\tIronically they pretended to know nothing of fighting,\\n\\t\\t\\t\\tand left their devout brethren to defend their faith and\\n\\t\\t\\t\\tideas. If that devout spirit did not appeal to them, they\\n\\t\\t\\t\\tmight at least have defended their city of Madinah when\\n\\t\\t\\t\\tit was threatened,-defended their hearths and homes as\\n\\t\\t\\t\\tgood citizens."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "169",
    "NoteID": "477",
    "Body": "A beautiful passage about the Martyrs in the cause of\\n\\t\\t\\t\\tTruth. They are not dead: they live,-and in a far higher\\n\\t\\t\\t\\tand deeper sense than in the life they have left. Even\\n\\t\\t\\t\\tthose who have no faith in the Hereafter honour those\\n\\t\\t\\t\\tthat die in their cause, with the crown of immortality in\\n\\t\\t\\t\\tthe minds and memories of generations unborn. But in\\n\\t\\t\\t\\tFaith we see a higher, truer, and less relative\\n\\t\\t\\t\\timmortality. Perhaps \"immortality\" is not the right word\\n\\t\\t\\t\\tin this connection, as it implies a continuation of this\\n\\t\\t\\t\\tlife. In their case, through the gateway of death, they\\n\\t\\t\\t\\tenter, the true real Life, as opposed to its shadow here."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "170",
    "NoteID": "478",
    "Body": "The Martyrs not only rejoice at the bliss they have\\n\\t\\t\\t\\tthemselves attained. The dear ones left behind are in\\n\\t\\t\\t\\ttheir thoughts: it is part of their glory that they have\\n\\t\\t\\t\\tsaved their dear ones from fear, sorrow, humiliation, and\\n\\t\\t\\t\\tgrief, in this life, even before they come to share in\\n\\t\\t\\t\\tthe glories of the Hereafter. Note how the refrain: \"on\\n\\t\\t\\t\\tthem shall be no fear, nor shall they grieve\": comes in\\n\\t\\t\\t\\there with a new and appropriate meaning. Besides other\\n\\t\\t\\t\\tthings, it means that the dear ones have no cause to\\n\\t\\t\\t\\tgrieve at the death of the Martyrs; rather have they\\n\\t\\t\\t\\tcause to rejoice."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "172",
    "NoteID": "479",
    "Body": "After the confusion at Uhud, men rallied round the\\n\\t\\t\\t\\tProphet. He was wounded, and they were wounded, but they\\n\\t\\t\\t\\twere all ready to fight again. Abu Sufyan with his\\n\\t\\t\\t\\tMakkans withdrew, but left a challenge with them to meet\\n\\t\\t\\t\\thim and his army again at the fair of Badr Sugra next\\n\\t\\t\\t\\tyear. The challenge was accepted, and a picked band of\\n\\t\\t\\t\\tMuslims under then-intrepid Leader kept the tryst, but\\n\\t\\t\\t\\tthe enemy did not come. They returned, not only unharmed,\\n\\t\\t\\t\\tbut enriched by the trade at the fair, and (it may be\\n\\t\\t\\t\\tpresumed) strengthened by the accession of new adherents\\n\\t\\t\\t\\tto their cause."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "178",
    "NoteID": "480",
    "Body": "That the cup of their iniquity may be full. The appetite\\n\\t\\t\\t\\tfor sin grows with what it feeds on. The natural result\\n\\t\\t\\t\\tis that the sinner sinks deeper into sin. If there is any\\n\\t\\t\\t\\tfreedom of will, this naturally follows, though Allah's\\n\\t\\t\\t\\tGrace is always ready for the repentant. If the Grace is\\n\\t\\t\\t\\trejected, the increase of iniquity makes the nature of\\n\\t\\t\\t\\tiniquity plainer to those who might otherwise be\\n\\t\\t\\t\\tattracted by its glitter. The working of Allah's Law is\\n\\t\\t\\t\\ttherefore both just and merciful. See also the next\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "179",
    "NoteID": "481",
    "Body": "The testing of good men by calamities and evil men by\\n\\t\\t\\t\\tleaving them in the enjoyment of good things is part of\\n\\t\\t\\t\\tthe trials of Allah, in which some freedom of choice is\\n\\t\\t\\t\\tleft to man. The psychological and subjective test is\\n\\t\\t\\t\\tunfailing, and the separation is effected partly by the\\n\\t\\t\\t\\toperation of the human wills, to which some freedom is\\n\\t\\t\\t\\tallowed. But it must be effected, if only in the\\n\\t\\t\\t\\tinterests of the good."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "179",
    "NoteID": "482",
    "Body": "Man in his weak state would be most miserable if he could\\n\\t\\t\\t\\tsee the secrets of the Future or the secrets of the\\n\\t\\t\\t\\tUnseen. But things are revealed to him from time to time\\n\\t\\t\\t\\tas may be expedient for him, by Messengers chosen for the\\n\\t\\t\\t\\tpurpose. Our duty is to hold fast by faith and lead a\\n\\t\\t\\t\\tgood life."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "180",
    "NoteID": "483",
    "Body": "The gifts are of all kinds: material gifts, such as\\n\\t\\t\\t\\twealth, property, strength of limbs, etc., or intangible\\n\\t\\t\\t\\tgifts, such as influence, birth in a given set,\\n\\t\\t\\t\\tintellect, skill, insight, etc., or spiritual gifts of\\n\\t\\t\\t\\tthe highest kind. The spending of all these things (apart\\n\\t\\t\\t\\tfrom what is necessary for ourselves) for those who need\\n\\t\\t\\t\\tthem, is charity, and purifies our own character. The\\n\\t\\t\\t\\twithholding of them (apart from our needs) is similarly\\n\\t\\t\\t\\tgreed and selfishness, and is strongly condemned."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "180",
    "NoteID": "484",
    "Body": "By an apt metaphor the miser is told that his wealth or\\n\\t\\t\\t\\tthe other gifts which he hoarded will cling round his\\n\\t\\t\\t\\tneck and do him no good. He will wish he could get rid of\\n\\t\\t\\t\\tthem, but he will not be able to do so. According to the\\n\\t\\t\\t\\tBiblical phrase in another connection they will hang like\\n\\t\\t\\t\\ta millstone round his neck (Matt. xviii. 6). The metaphor\\n\\t\\t\\t\\there is fuller. He hugged his wealth or his gifts about\\n\\t\\t\\t\\thim. They will become like a heavy collar, the badge of\\n\\t\\t\\t\\tslavery, round his neck. They will be tied tight and\\n\\t\\t\\t\\ttwisted, and they will give him pain and anguish instead\\n\\t\\t\\t\\tof pleasure. Cf. also xvii. 13."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "180",
    "NoteID": "485",
    "Body": "Another metaphor is now introduced. Material wealth or\\n\\t\\t\\t\\tproperty is only called ours during our short life here.\\n\\t\\t\\t\\tSo all gifts are ours in trust only; they ultimately\\n\\t\\t\\t\\trevert to Allah, to Whom belongs all that is in the\\n\\t\\t\\t\\theavens or on earth."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "181",
    "NoteID": "486",
    "Body": "In ii. 245 we read: \"Who is he that will loan to Allah a\\n\\t\\t\\t\\tbeautiful loan?\" In other places charity or spending in\\n\\t\\t\\t\\tthe way of Allah is metaphorically described as giving to\\n\\t\\t\\t\\tAllah. The Holy Prophet often used that expression in\\n\\t\\t\\t\\tappealing for funds to be spent in the way of Allah. The\\n\\t\\t\\t\\tscoffers mocked and said: \"So Allah is indigent and we\\n\\t\\t\\t\\tare rich!\" This blasphemy was of a piece with all their\\n\\t\\t\\t\\tconduct in history, in slaying the Prophets and men of\\n\\t\\t\\t\\tGod."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "181",
    "NoteID": "487",
    "Body": "For the expression \"slaying in defiance of right,\" Cf.\\n\\t\\t\\t\\tiii. 21, and iii. 112."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "182",
    "NoteID": "488",
    "Body": "Cf. ii. 95 and note."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "183",
    "NoteID": "489",
    "Body": "Burn sacrifices figured in the Mosaic Law, and in the\\n\\t\\t\\t\\treligious ceremonies long before Moses, but it is not\\n\\t\\t\\t\\ttrue that the Mosaic Law laid down a fire from heavens on\\n\\t\\t\\t\\ta burnt sacrifice as a test of the credentials of\\n\\t\\t\\t\\tProphets. Even if it had been so, did the Jews obey the\\n\\t\\t\\t\\tProphets who showed this Sign? In Leviticus ix. 23-24, we\\n\\t\\t\\t\\tare told a burnt offering prepared by Moses and Aaron:\\n\\t\\t\\t\\t\"and there came a fire out from before the Lord, and\\n\\t\\t\\t\\tconsumed upon the altar the burnt offering and the fat.\"\\n\\t\\t\\t\\tYet the people rebelled frequently against Moses. Abel's\\n\\t\\t\\t\\toffering (sacrifice) was probably a burnt offering: it\\n\\t\\t\\t\\twas accepted by Allah, and he was killed by Cain out of\\n\\t\\t\\t\\tjealousy: Gen. iv. 3-8. Mosaic sacrifices were no longer\\n\\t\\t\\t\\tneeded by the people of Jesus or the people of Muhammad."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "184",
    "NoteID": "490",
    "Body": "The three things mentioned in the Text are: (1) Clear\\n\\t\\t\\t\\tSigns (baiyinat); (2) zubur, and (3) kitab-il-Munir. The\\n\\t\\t\\t\\tsignification of (1) I have explained in the note to iii.\\n\\t\\t\\t\\t62, as far as they relate to Jesus. In a more general\\n\\t\\t\\t\\tsense, it means the clear evidence which Allah's dealings\\n\\t\\t\\t\\tfurnish about a Messenger of Allah having a true mission:\\n\\t\\t\\t\\te.g., Moses in relation to Pharaoh. (2) The word Zubur\\n\\t\\t\\t\\thas been translated as scriptures. It comes from the root\\n\\t\\t\\t\\tZabara which implies something hard. The commentators are\\n\\t\\t\\t\\tnot agreed, but the prophetic writings which seemed to\\n\\t\\t\\t\\tcontemporaries difficult to understand may well be meant\\n\\t\\t\\t\\there. David's psalms (Zabur, iv. 163) may also come under\\n\\t\\t\\t\\tthis description. As to (3), there is no doubt about the\\n\\t\\t\\t\\tliteral meaning of the words, \"the Book of\\n\\t\\t\\t\\tEnlightenment\". But what does it precisely refer to? I\\n\\t\\t\\t\\ttake it to mean the fundamental guide to conduct,-the\\n\\t\\t\\t\\tclear rules laid down in all Dispensations to help men to\\n\\t\\t\\t\\tlead good lives."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "185",
    "NoteID": "491",
    "Body": "The death of the body will give a taste of death to the\\n\\t\\t\\t\\tsoul when the soul separates from the body. The soul will\\n\\t\\t\\t\\tthen know that this life was but a probation. And seeming\\n\\t\\t\\t\\tinequalities will be adjusted finally on the Day of\\n\\t\\t\\t\\tJudgment."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "185",
    "NoteID": "492",
    "Body": "Cf. Longfellow's Psalm of Life: \"All this world's a\\n\\t\\t\\t\\tfleeting show. For man's illusion given\". The only\\n\\t\\t\\t\\treality will be when we have attained our final goal."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "186",
    "NoteID": "493",
    "Body": "Not wealth and possessions only (or want of them), are\\n\\t\\t\\t\\tthe means of our trial. All our personal talents,\\n\\t\\t\\t\\tknowledge, opportunities, and their opposites,-in fact\\n\\t\\t\\t\\teverything that happens to us and makes up our\\n\\t\\t\\t\\tpersonality is a means of our testing. So is our Faith:\\n\\t\\t\\t\\twe shall have to put up for it many insults from those\\n\\t\\t\\t\\twho do not share it."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "187",
    "NoteID": "494",
    "Body": "Truth-Allah's Message-comes to any man or nation as a\\n\\t\\t\\t\\tmatter of sacred trust. It should be broadcast and\\n\\t\\t\\t\\tpublished and taught and made clear to all within reach.\\n\\t\\t\\t\\tPrivileged priesthood at once erects a barrier. But\\n\\t\\t\\t\\tworse,-when such priesthood tampers with the truth,\\n\\t\\t\\t\\ttaking what suits it and ignoring the rest, it has sold\\n\\t\\t\\t\\tAllah's gift for a miserable ephemeral profit; how\\n\\t\\t\\t\\tmiserable, it will learn when retributive justice comes."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "187",
    "NoteID": "495",
    "Body": "Cf. ii. 101."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "188",
    "NoteID": "496",
    "Body": "A searching picture of the wordly wise! They may cause\\n\\t\\t\\t\\tmischief and misery to others, but gloat over any glory\\n\\t\\t\\t\\tit may bring them! They may trample down Allah's truths,\\n\\t\\t\\t\\tand enthrone false standards of worship. They may take\\n\\t\\t\\t\\tcredit for virtues they do not possess and seeming\\n\\t\\t\\t\\tsuccesses that come in spite of their despicable\\n\\t\\t\\t\\tdeceptions."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "190",
    "NoteID": "497",
    "Body": "See ii. 164. The two items mentioned here are just brief\\n\\t\\t\\t\\tsymbols recalling the six or seven mentioned in the other\\n\\t\\t\\t\\tpassage. And those too are but brief symbols and\\n\\t\\t\\t\\treminders of the glorious majesty of Allah and His\\n\\t\\t\\t\\tgoodness to man."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "191",
    "NoteID": "498",
    "Body": "That is, in all postures, which again is symbolical of\\n\\t\\t\\t\\tall circumstances, personal, social, economic, historical\\n\\t\\t\\t\\tand other."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "191",
    "NoteID": "499",
    "Body": "It is the thought of Salvation that connects all these\\n\\t\\t\\t\\tglories with man. Otherwise man would be a miserable,\\n\\t\\t\\t\\tcontemptible creature in these beauties and wonders of\\n\\t\\t\\t\\tNature. With his high destiny of Salvation he can be\\n\\t\\t\\t\\tlifted even higher than these glories!"
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "195",
    "NoteID": "500",
    "Body": "In Islam the equal status of the sexes is not only\\n\\t\\t\\t\\trecognised but insisted on. If sex distinction, which is\\n\\t\\t\\t\\ta distinction in nature, does not count in spiritual\\n\\t\\t\\t\\tmatters, still less of course would count artificial\\n\\t\\t\\t\\tdistinctions, such as rank, wealth, position, race,\\n\\t\\t\\t\\tcolour, birth, etc,"
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "195",
    "NoteID": "501",
    "Body": "Here, and in iii. 198 below, and in many places\\n\\t\\t\\t\\telsewhere, stress is laid on the fact that whatever gift,\\n\\t\\t\\t\\tor bliss will come to the righteous, its chief merit will\\n\\t\\t\\t\\tbe that it proceeds from Allah Himself. \"Nearness to\\n\\t\\t\\t\\tAllah\" expresses it better than any other term."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "200",
    "NoteID": "502",
    "Body": "The full meaning of Sabr is to be understood here, viz.:\\n\\t\\t\\t\\tPatience, perseverance, constancy, self-restraint,\\n\\t\\t\\t\\trefusing to be cowed down. These virtues we are to\\n\\t\\t\\t\\texercise for ourselves and in relation to others; we are\\n\\t\\t\\t\\tto set an example, so that others may vie with us, and we\\n\\t\\t\\t\\tare to vie with them, lest we fall short; in this way we\\n\\t\\t\\t\\tstrengthen each other and bind our mutual relations\\n\\t\\t\\t\\tcloser, in our common service to Allah."
  },
  {
    "SurahNumber": "3",
    "AyahNumber": "200",
    "NoteID": "503",
    "Body": "Prosperity (falah here and in other passages is to be\\n\\t\\t\\t\\tunderstood in a wide sense, including prosperity in our\\n\\t\\t\\t\\tmundane affairs as well as in spiritual progress. In both\\n\\t\\t\\t\\tcases it implies happiness and the attainment of our\\n\\t\\t\\t\\twishes, purified by the love of Allah."
  }
]
