[
  {
    "SurahNumber": "81",
    "AyahNumber": "3",
    "NoteID": "1",
    "Body": "See {20:105-107} and the corresponding note [90]; also\\n\\t\\t\\t\\tnote [63] on  14:48 ."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "5",
    "NoteID": "2",
    "Body": "I.e., when they crowd together in terror of the\\n\\t\\t\\t\\tmanifestation of the Last Hour, or - as Mu'tazili\\n\\t\\t\\t\\tcommentators maintain - in order to be indemnified by God\\n\\t\\t\\t\\tfor man's cruelty to them (Razi). It is also said that\\n\\t\\t\\t\\tthe animals which were loved by human beings will live in\\n\\t\\t\\t\\tthe hereafter together with those who loved them\\n\\t\\t\\t\\t(Zamakhshari). This interpretation is evidently based on\\n\\t\\t\\t\\t 6:38  - \"there is no beast that walks on earth and no\\n\\t\\t\\t\\tbird that flies on its two wings which is not [God's]\\n\\t\\t\\t\\tcreature like yourselves\" - followed almost immediately\\n\\t\\t\\t\\tby the words, \"Unto their Sustainer shall they [all] be\\n\\t\\t\\t\\tgathered.\""
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "7",
    "NoteID": "3",
    "Body": "I.e., when none will be able to divest himself of\\n\\t\\t\\t\\tresponsibility for his past deeds."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "9",
    "NoteID": "4",
    "Body": "The barbaric custom of burying female infants alive seems\\n\\t\\t\\t\\tto have been fairly widespread in pre-Islamic Arabia,\\n\\t\\t\\t\\talthough perhaps not to the extent as has been commonly\\n\\t\\t\\t\\tassumed. The motives were twofold: the fear that an\\n\\t\\t\\t\\tincrease of female offspring would result in economic\\n\\t\\t\\t\\tburdens, as well as fear of the humiliation frequently\\n\\t\\t\\t\\tcaused by girls being captured by a hostile tribe and\\n\\t\\t\\t\\tsubsequently preferring their captors to their parents\\n\\t\\t\\t\\tand brothers. Before Islam, one of the foremost opponents\\n\\t\\t\\t\\tof this custom was Zayd ibn 'Amr ibn Nufayl, a cousin of\\n\\t\\t\\t\\t'Umar ibn al-Khattab and spiritually a precursor of\\n\\t\\t\\t\\tMuhammad (cf. Bukhari, Fada'il Ashab an-Nabi, on the\\n\\t\\t\\t\\tauthority of 'Abd Allah ibn 'Umar); he died shortly\\n\\t\\t\\t\\tbefore Muhammad's call to prophethood (Fath al-Bari VII,\\n\\t\\t\\t\\t112). Another man, Sa'sa'ah ibn Najiyah at-Tamimi -\\n\\t\\t\\t\\tgrandfather of the poet Farazdaq - achieved equal fame as\\n\\t\\t\\t\\ta saviour of infants thus condemned to death; he later\\n\\t\\t\\t\\tembraced Islam. Ibn Khallikan (II, 197) mentions that\\n\\t\\t\\t\\tSa'sa'ah saved about thirty girls by paying ransom to\\n\\t\\t\\t\\ttheir parents."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "19",
    "NoteID": "5",
    "Body": "By \"calling to witness\", certain natural phenomena which\\n\\t\\t\\t\\tare familiar to man because of their permanent\\n\\t\\t\\t\\trecurrence, attention is drawn to the fact that what we\\n\\t\\t\\t\\tcall \"laws of nature\" are but the observable elements of\\n\\t\\t\\t\\tGod's plan of creation - a plan in which His revelations\\n\\t\\t\\t\\t(referred to in this and the subsequent verses) play a\\n\\t\\t\\t\\tdecisive role: and so, by implication, the divine writ\\n\\t\\t\\t\\tgranted to Muhammad is as intrinsically \"natural\" as any\\n\\t\\t\\t\\tother phenomenon, concrete or abstract, in the realm of\\n\\t\\t\\t\\tGod's creation."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "20",
    "NoteID": "6",
    "Body": "Lit., \"with Him of the throne of almightiness\". It is to\\n\\t\\t\\t\\tbe noted that the Qur'anic term 'arsh - of which the\\n\\t\\t\\t\\tabove is the earliest occurrence in the order of\\n\\t\\t\\t\\trevelation - invariably signifies God's absolute\\n\\t\\t\\t\\tsovereignty and almightiness (cf. note [43] on  7:54 )."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "22",
    "NoteID": "7",
    "Body": "See surah {68}, note [3]. The characterisation of\\n\\t\\t\\t\\tMuhammad as \"this fellow-man of yours\" is meant to stress\\n\\t\\t\\t\\this absolute humanness, and thus to counteract any\\n\\t\\t\\t\\tpossibility on the part of his followers to deify him.\\n\\t\\t\\t\\t(See also note [150] on  7:184 )."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "23",
    "NoteID": "8",
    "Body": "This is evidently a reference to the Prophet's vision of\\n\\t\\t\\t\\tthe Angel Gabriel which ended the break in revelation\\n\\t\\t\\t\\t(fatrat al-wahy) mentioned in the introductory note to\\n\\t\\t\\t\\tsurah {74}. See also  53:5  ff. and the corresponding\\n\\t\\t\\t\\tnotes."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "24",
    "NoteID": "9",
    "Body": "Sc., \"and so he conveys this revelation to you\"."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "25",
    "NoteID": "10",
    "Body": "For my occasional rendering of shaytan as \"satanic\\n\\t\\t\\t\\tforce\", see first half of note [16] on  15:17 ."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "29",
    "NoteID": "11",
    "Body": "I.e., \"you can will it only because God has willed to\\n\\t\\t\\t\\tshow you the right way by means of the positive instincts\\n\\t\\t\\t\\twhich He has implanted in you, as well as through the\\n\\t\\t\\t\\trevelations which He has bestowed on His prophets\":\\n\\t\\t\\t\\timplying that the choice of the right way is open to\\n\\t\\t\\t\\teveryone who is willing to avail himself of God's\\n\\t\\t\\t\\tuniversal guidance. (Cf. a similar passage in\\n\\t\\t\\t\\t{76:29-30}.)"
  }
]
