[
  {
    "SurahNumber": "2",
    "AyahNumber": "1",
    "Text": "Alif Lam M'im."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "2",
    "Text": "This is The Book in which there is no doubt. (Since its Author,\\n\\t\\t\\tAllah, the Creator of this universe, possesses complete\\n\\t\\t\\tknowledge, there is no room for doubt about its contents.) It is\\n\\t\\t\\ta guide for those who are God conscious,"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "3",
    "Text": "who believe in the Unseen, who establish Salah (five regular\\n\\t\\t\\tdaily prayers) and spend in charity out of what We have provided\\n\\t\\t\\tfor their sustenance;"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "4",
    "Text": "who believe in this Revelation (The Qur'an) which is sent to you\\n\\t\\t\\t(O Muhammad) and the Revelations which were sent before you\\n\\t\\t\\t(Torah, Psalms, Gospel...) and firmly believe in the Hereafter."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "5",
    "Text": "They are on True Guidance from their Rabb and they are the ones\\n\\t\\t\\twho will attain salvation."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "6",
    "Text": "In fact, as for those who reject Faith; it is the same, whether\\n\\t\\t\\tyou warn them or you don't, they will not believe."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "7",
    "Text": "Allah has sealed their hearts and their hearing, their eyes are\\n\\t\\t\\tcovered, and there is a grievous punishment for them."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "8",
    "Text": "There are some people who say: \"We believe in Allah and the Last\\n\\t\\t\\tDay\" yet they are not true believers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "9",
    "Text": "They try to deceive Allah and the believers. However, they\\n\\t\\t\\tdeceive none except themselves yet they do not realize it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "10",
    "Text": "There is a disease of deception in their heart; and Allah lets\\n\\t\\t\\ttheir disease increase, and they shall have painful punishment\\n\\t\\t\\tfor the lies they have told."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "11",
    "Text": "When it is said to them: \"Do not make mischief on earth,\" they\\n\\t\\t\\tsay: \"We make peace.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "12",
    "Text": "Be aware! They are the ones who make mischief but they do not\\n\\t\\t\\trealize it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "13",
    "Text": "When it is said to them: \"Believe as the others believe\" they\\n\\t\\t\\tsarcastically ask: \"Should we believe like fools?\" Be aware! They\\n\\t\\t\\tthemselves are the fools, if only they could understand."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "14",
    "Text": "When they meet the believers they say: \"We are believers,\" but\\n\\t\\t\\twhen they are alone with their shaitans, they say: \"We are really\\n\\t\\t\\twith you, we were only mocking the believers.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "15",
    "Text": "Allah will throw back their mockery on them and leave them alone\\n\\t\\t\\tin their trespasses; so they wander to and fro like blind."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "16",
    "Text": "These are the people who barter guidance for error: but their\\n\\t\\t\\tbargain is profitless and they are not going to be guided."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "17",
    "Text": "Their example is that of a man who kindled a fire; when it\\n\\t\\t\\tilluminated all around him Allah took away the light (their\\n\\t\\t\\teyesight) and left them in utter darkness: they could see\\n\\t\\t\\tnothing."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "18",
    "Text": "Deaf, dumb, and blind, they will never return to the Right Way."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "19",
    "Text": "Or another example is that of a dark storm-cloud in the sky\\n\\t\\t\\tcharged with thunder and lightning. They press their fingers into\\n\\t\\t\\ttheir ears at the sound of each stunning thunderclap for fear of\\n\\t\\t\\tdeath: Allah is encircling the unbelievers from all sides."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "20",
    "Text": "The lightning terrifies them as if it was going to snatch away\\n\\t\\t\\ttheir eyesight; whenever it flashes they walk on; when it becomes\\n\\t\\t\\tdark, they stand still. And if Allah wanted He could have totally\\n\\t\\t\\ttaken away their hearing and their sight; for Allah has power\\n\\t\\t\\tover everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "21",
    "Text": "O Mankind! Worship your Rabb Who created you and created those\\n\\t\\t\\twho came before you; by doing this you may expect to guard\\n\\t\\t\\tyourself against evil."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "22",
    "Text": "It is He Who has made the earth a floor for you and the sky a\\n\\t\\t\\tcanopy; and it is He Who sends down rain from the sky for the\\n\\t\\t\\tgrowth of fruits for your sustenance. Therefore, do not knowingly\\n\\t\\t\\tset up rivals to Allah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "23",
    "Text": "If you are in doubt as to whether the revelations which We have\\n\\t\\t\\tsent to Our servant (Muhammad) are from Us or not, then produce\\n\\t\\t\\tone Surah like this; and call your witnesses (gods that you call\\n\\t\\t\\tupon) besides Allah to assist you, if you are right in your\\n\\t\\t\\tclaim."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "24",
    "Text": "But if you are unable to do so, and you can never do so, then\\n\\t\\t\\tfear the Hell fire, whose fuel is men and stones which is\\n\\t\\t\\tprepared for the unbelievers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "25",
    "Text": "Give glad tidings to those who believe in this Book and do good\\n\\t\\t\\tdeeds in accordance with its teachings for them there will be\\n\\t\\t\\tGardens beneath which rivers flow. Whenever they will be given\\n\\t\\t\\tfruits to eat they will say: \"This is similar to the one we used\\n\\t\\t\\tto eat before on earth,\" for the fruits will resemble the fruits\\n\\t\\t\\ton the earth for their easy identification and enjoyment; and for\\n\\t\\t\\tthem there will be chaste virgin spouses, and they shall live\\n\\t\\t\\ttherein for ever."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "26",
    "Text": "Allah does not mind using the similitude of a gnat or an even\\n\\t\\t\\tmore insignificant creature to teach a lesson. Those who believe\\n\\t\\t\\tknow that it is the truth from their Rabb; but the unbelievers\\n\\t\\t\\tsay: \"What does Allah mean by such a similitude?\" By such a\\n\\t\\t\\tsimilitude Allah confounds many and enlightens many. He confounds\\n\\t\\t\\tnone except the transgressors:"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "27",
    "Text": "those who break Allah's Covenant after accepting it, and who cut\\n\\t\\t\\taside what Allah has ordered to be united and cause mischief on\\n\\t\\t\\tearth. It is they who are the losers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "28",
    "Text": "How can you deny Allah? Did He not give you life when you were\\n\\t\\t\\tlifeless; and will He not cause you to die and again bring you to\\n\\t\\t\\tlife; and will you not ultimately return to Him ?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "29",
    "Text": "It is He Who has created for you all that there is in the earth;\\n\\t\\t\\tand directed Himself towards the sky and fashioned it into seven\\n\\t\\t\\theavens. He has perfect knowledge of everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "30",
    "Text": "Note that occasion, when your Rabb said to the angels: I am going\\n\\t\\t\\tto place a vicegerent on earth. The angels said: \"Will You place\\n\\t\\t\\tthere one who will make mischief and shed blood while we sing\\n\\t\\t\\tYour praises and glorify Your name?\" Allah said: \"I know what you\\n\\t\\t\\tknow not.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "31",
    "Text": "He taught Adam the names of all things; then He presented the\\n\\t\\t\\tthings to the angels and said: \"Tell Me the names of those if\\n\\t\\t\\twhat you say is true?\" (Allah did this to show Adam's special\\n\\t\\t\\tqualities of learning and memory)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "32",
    "Text": "\"Glory to You,\" they replied, \"we have no knowledge except what\\n\\t\\t\\tYou have taught us: in fact You are the One who is perfect in\\n\\t\\t\\tknowledge and wisdom.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "33",
    "Text": "Allah said: \"O Adam! Tell them the names.\" When Adam told them\\n\\t\\t\\tthe names, Allah said: \"Did I not tell you that I know the\\n\\t\\t\\tsecrets of the heavens and the earth and I know what you reveal\\n\\t\\t\\tand what you conceal?\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "34",
    "Text": "When We ordered the angels: \"Prostrate before Adam in respect,\"\\n\\t\\t\\tthey all prostrated except Iblees (Shaitan) who refused in his\\n\\t\\t\\tarrogance and became a disbeliever."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "35",
    "Text": "To Adam We said: \"Dwell with your wife in Paradise and eat\\n\\t\\t\\tanything you want from its bountiful food from wherever you wish,\\n\\t\\t\\tbut do not approach this tree, or you shall both become\\n\\t\\t\\ttransgressors.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "36",
    "Text": "But Shaitan tempted them with the tree to disobey Allah's\\n\\t\\t\\tcommandment and caused them to be expelled from Paradise, and We\\n\\t\\t\\tsaid: \"Get out from here, some of you being enemies to others,\\n\\t\\t\\tand there is for you in the earth an abode and provisions for a\\n\\t\\t\\tspecified period.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "37",
    "Text": "Then Adam received appropriate words from his Rabb and repented,\\n\\t\\t\\tand Allah accepted his repentance. Surely Allah is the Most\\n\\t\\t\\tForgiving, the Most Merciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "38",
    "Text": "\"Get out from here all of you,\" We said at the time of Adam's\\n\\t\\t\\tdeparture from Paradise. \"There will come to you a guidance from\\n\\t\\t\\tMe, those who accept and follow it shall have nothing to fear or\\n\\t\\t\\tto regret."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "39",
    "Text": "But those who reject and defy Our revelations will be inmates of\\n\\t\\t\\tHellfire wherein they shall live forever.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "40",
    "Text": "O children of Israel! Remember My favors to you; fulfil your\\n\\t\\t\\tcovenant (firm Commitment) with Me and I will fulfil My covenant\\n\\t\\t\\twith you, that you should fear none but Me."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "41",
    "Text": "Believe in My revelations, which are confirming your scriptures;\\n\\t\\t\\tdo not be the first one to deny My revelations, and do not sell\\n\\t\\t\\tthem for a petty price, fear Me and Me alone."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "42",
    "Text": "Do not mix the Truth with falsehood, or knowingly conceal the\\n\\t\\t\\ttruth."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "43",
    "Text": "Establish Salah (prayers); give Zakah (charity); and bow down\\n\\t\\t\\twith those who bow down in worship."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "44",
    "Text": "Would you ask others to be righteous and forget to practice it\\n\\t\\t\\tyourselves? Even though you read your Holy Book? Have you no\\n\\t\\t\\tsense?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "45",
    "Text": "Seek Allah's help with patience and Salah: it is indeed hard to\\n\\t\\t\\tbe patient and to be punctual in offering Salah except for those\\n\\t\\t\\twho fear Allah,"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "46",
    "Text": "who are certain in their mind that they are going to meet their\\n\\t\\t\\tRabb and that they are going to return to Him for final\\n\\t\\t\\tjudgement."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "47",
    "Text": "O' Children of Israel! Remember the special favor which I\\n\\t\\t\\tbestowed upon You; that I exalted you above all other nations."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "48",
    "Text": "Guard yourselves against the day on which one soul shall not\\n\\t\\t\\tavail another, no intercession shall be accepted, no ransom shall\\n\\t\\t\\tbe taken and no help shall be given."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "49",
    "Text": "Remember how We delivered you from the people of Fir'on\\n\\t\\t\\t(Pharaoh): they had subjected you to severe torment, killing your\\n\\t\\t\\tsons and sparing your daughters; you were facing a tremendous\\n\\t\\t\\ttrial from your Rabb."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "50",
    "Text": "And We parted the Red Sea for you, taking you to safety, and\\n\\t\\t\\tdrowned Fir'on's people before your very eyes."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "51",
    "Text": "Remember when We communed with Musa (Moses) for forty nights and\\n\\t\\t\\tin his absence you took the calf for worship, thus committing a\\n\\t\\t\\twicked transgression."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "52",
    "Text": "Even then We forgave you, so that you might become grateful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "53",
    "Text": "We gave Musa (Moses) the Holy Book (Torah) and the criterion of\\n\\t\\t\\tright and wrong so that you might be rightly guided."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "54",
    "Text": "Remember when Musa returned with the Divine Book he said to his\\n\\t\\t\\tpeople: \"O my people! You have indeed grievously wronged\\n\\t\\t\\tyourselves by taking the calf for worship; so turn in repentance\\n\\t\\t\\tto your Creator and slay the culprits among you; that will be\\n\\t\\t\\tbest for you in His sight.\" He accepted your repentance; surely\\n\\t\\t\\tHe is the Forgiving, the Merciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "55",
    "Text": "Remember when you said: \"O Musa! We shall never believe you until\\n\\t\\t\\twe see Allah with our own eyes,\" a thunderbolt struck you while\\n\\t\\t\\tyou were looking on and you fell dead."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "56",
    "Text": "Then We raised you up after your death; so that you might be\\n\\t\\t\\tgrateful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "57",
    "Text": "And We even provided you the shade of clouds and sent down to you\\n\\t\\t\\tmanna (sweet dish) and salva (quail meat) saying: \"Eat of the\\n\\t\\t\\tgood things We have provided for you;\" in spite of these favors\\n\\t\\t\\tyour forefathers violated our commandments. However, by violating\\n\\t\\t\\tour commandments they did not harm Us, but they harmed their own\\n\\t\\t\\tsouls."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "58",
    "Text": "Remember when We said: \"Enter this town and eat whatever you wish\\n\\t\\t\\tto your hearts' content; make your way through the gates, with\\n\\t\\t\\thumility saying; 'we repent,' We shall forgive you your sins and\\n\\t\\t\\tWe shall increase the provisions for the righteous among you."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "59",
    "Text": "But the wrongdoers changed Our Words from that which they were\\n\\t\\t\\tasked to say, so We sent down a scourge from heaven as a\\n\\t\\t\\tpunishment for their transgression."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "60",
    "Text": "Remember the time when Musa (Moses) prayed for water for his\\n\\t\\t\\tpeople; We said: \"Strike the rock with your staff.\" Thereupon We\\n\\t\\t\\tcaused twelve springs to come out of that rock. Each tribe was\\n\\t\\t\\tassigned its own drinking-place. Then they were commanded: \"Eat\\n\\t\\t\\tand drink of what Allah has provided and do not create mischief\\n\\t\\t\\tin the land.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "61",
    "Text": "Remember when you said: \"O Musa (Moses)! We cannot endure one\\n\\t\\t\\tkind of food; call on your Rabb to give us a variety of food\\n\\t\\t\\twhich the earth produces, such as green-herbs, cucumbers, garlic,\\n\\t\\t\\tlentils, and onions. 'What?' Musa asked. 'Would you exchange the\\n\\t\\t\\tbetter for the worse? If that's what you want go back to some\\n\\t\\t\\tcity; there you will find what you have asked for. Gradually they\\n\\t\\t\\tbecame so degraded that shame and misery were brought upon them\\n\\t\\t\\tand they drew upon themselves the wrath of Allah; this was\\n\\t\\t\\tbecause they went on rejecting the commandments of Allah and\\n\\t\\t\\tkilled His prophets unjustly, furthermore, it was the consequence\\n\\t\\t\\tof their disobedience and transgression."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "62",
    "Text": "Rest assured that Believers (Muslims), Jews, Christians and\\n\\t\\t\\tSabians - whoever believes in Allah and the last day and perform\\n\\t\\t\\tgood deeds - will be rewarded by their Rabb; they will have\\n\\t\\t\\tnothing to fear or to regret."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "63",
    "Text": "Remember O Children of Israel when We took a covenant from you\\n\\t\\t\\tand when We lifted the Mount (Tur) over your heads saying: \"Hold\\n\\t\\t\\tfirmly to what We have given you (Torah) and follow the\\n\\t\\t\\tcommandments therein, so that you may guard yourself against\\n\\t\\t\\tevil.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "64",
    "Text": "But even after that you backed out; if there would not have been\\n\\t\\t\\tthe grace and mercy of Allah upon you, you surely would have been\\n\\t\\t\\tamong the losers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "65",
    "Text": "You very well know the story of those of you who transgressed in\\n\\t\\t\\tthe matter of the Sabbath; We ordered them: \"Be detested apes\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "66",
    "Text": "Thus, We made their fate an example to their own people and to\\n\\t\\t\\tsucceeding generations, and a lesson to those who are\\n\\t\\t\\tGod-conscious."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "67",
    "Text": "Remember the incident when Musa (Moses) said to his people:\\n\\t\\t\\t\"Allah commands you to sacrifice a cow,\" they replied, \"do you\\n\\t\\t\\tridicule us?\" Musa answered, \"I seek the protection of Allah from\\n\\t\\t\\tbeing one of the ignorant.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "68",
    "Text": "\"Request your Rabb,\" they said, \"to give us some details of that\\n\\t\\t\\tcow\". Musa replied: \"Allah says, the cow should neither be too\\n\\t\\t\\told nor too young but of middle age;\" do, therefore, what you are\\n\\t\\t\\tcommanded!"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "69",
    "Text": "\"Request your Rabb again\" they said, \"to clarify for us her\\n\\t\\t\\tcolor.\" Musa replied: \"Allah says, the said cow should be of a\\n\\t\\t\\trich and deep yellow color pleasing to the eyes.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "70",
    "Text": "Again they said: \"Request your Rabb to clarify for us the exact\\n\\t\\t\\ttype of cow she should be, for to us all cows look alike; if\\n\\t\\t\\tAllah wills, we shall be rightly guided.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "71",
    "Text": "Musa replied: \"Allah says, the said cow should have neither been\\n\\t\\t\\tused to till the soil nor water the fields; a healthy one free\\n\\t\\t\\tfrom any blemish.\" \"Now you have brought us the accurate\\n\\t\\t\\tdescription,\" they said. Then they slaughtered her, after they\\n\\t\\t\\thad nearly declined."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "72",
    "Text": "And remember another incident when you killed a man and started\\n\\t\\t\\tdisputing as to who killed him, Allah made it known what you\\n\\t\\t\\tconcealed."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "73",
    "Text": "So We said: \"Strike the dead body with a piece of the slaughtered\\n\\t\\t\\tcow.\" That's how Allah brought the dead to life to show you His\\n\\t\\t\\tSigns so that you may understand His power to restore life."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "74",
    "Text": "But even after seeing that your hearts became hard like a rock or\\n\\t\\t\\teven harder, for there are some rocks from which rivers gush out,\\n\\t\\t\\tand there are some which break asunder and water comes out of\\n\\t\\t\\tthem, and there are some which fall down with the fear of Allah.\\n\\t\\t\\tAnd Allah is not unaware of what you do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "75",
    "Text": "Do you, O Believers, still hope that they will believe in what\\n\\t\\t\\tyou say, when some of them have already heard the word of Allah\\n\\t\\t\\tand perverted it knowingly after they understood it?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "76",
    "Text": "When they meet the believers (Muslims) they say: \"We too are\\n\\t\\t\\tbelievers,\" but when they (people of the Book) meet each other in\\n\\t\\t\\tprivate they say: \"Would you disclose to the believers (Muslims)\\n\\t\\t\\twhat Allah has revealed to you? So that they (Muslims) may use it\\n\\t\\t\\tas an argument against you in the court of your Rabb? Have you no\\n\\t\\t\\tsense?\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "77",
    "Text": "Do they not really know that Allah knows what they conceal and\\n\\t\\t\\twhat they reveal?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "78",
    "Text": "Among them there are some illiterates who do not know their Holy\\n\\t\\t\\tBook; they follow their own desires and do nothing but\\n\\t\\t\\tconjecture."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "79",
    "Text": "Woe to those who write the Book with their own hands and then\\n\\t\\t\\tsay: \"This is from Allah,\" so that they may sell it for a petty\\n\\t\\t\\tprice! Woe to them for what their hands have written and woe to\\n\\t\\t\\tthem for what they have earned."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "80",
    "Text": "The Jews say: \"The fire shall not touch us except for a few\\n\\t\\t\\tdays.\" O Muhammad, say: \"Have you obtained such a promise from\\n\\t\\t\\tAllah which He would not break ? Or do you assert against Allah\\n\\t\\t\\twhat you do not know?\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "81",
    "Text": "Yea! Those who commit evil and become encircled in sin are the\\n\\t\\t\\tinmates of Hellfire; they shall live there forever."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "82",
    "Text": "As for those who believe and do good deeds, they will be the\\n\\t\\t\\tresidents of Paradise and live there forever."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "83",
    "Text": "Remember, We took a covenant (firm commitment) from the children\\n\\t\\t\\tof Israel: \"You shall worship none but Allah; be good to your\\n\\t\\t\\tparents, relatives, orphans and destitute, speak fair to the\\n\\t\\t\\tpeople, establish 'Salah', and pay 'Zakah.'\" But you broke the\\n\\t\\t\\tcovenant, except a few of you, and you paid no heed."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "84",
    "Text": "Also remember another covenant which We took from you: That you\\n\\t\\t\\tshall not shed blood among yourselves and you shall not expel\\n\\t\\t\\tyour own people from your homes; you confirmed it and you are\\n\\t\\t\\twitness to it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "85",
    "Text": "Yet there you are, killing your own people, expelling a group\\n\\t\\t\\tamongst you from their homes, backing each other with sin and\\n\\t\\t\\taggression; and if they come to you as captives, you trade them\\n\\t\\t\\tfor ransoms whereas their expulsion was unlawful for you to begin\\n\\t\\t\\twith. Do you believe in a part of your Holy Book and reject the\\n\\t\\t\\trest? So what other punishment do such people among you, who\\n\\t\\t\\tbehave like this, deserve, than disgrace in this world and to be\\n\\t\\t\\tdriven to grievous punishment on the Day of Judgment? Allah is\\n\\t\\t\\tnot unaware of what you do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "86",
    "Text": "Such are the people who trade the life of this world at the\\n\\t\\t\\texpense of the Hereafter; so neither their punishment shall be\\n\\t\\t\\tlightened nor shall they be helped."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "87",
    "Text": "To Musa (Moses) We gave the Book (Torah) and sent after him other\\n\\t\\t\\tRasools in succession; then We gave Isa (Jesus), the son of\\n\\t\\t\\tMaryam (Mary), clear Signs and strengthened him with the Holy\\n\\t\\t\\tSpirit (Gabriel). Why is it that whenever there came to you a\\n\\t\\t\\tRasool with a message which did not suit your desires, you became\\n\\t\\t\\tso arrogant that some you called impostors and others you killed!"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "88",
    "Text": "They say: \"Our hearts are in secure wrappers;\" but the fact of\\n\\t\\t\\tthe matter is that Allah has cursed them for their disbelief, so\\n\\t\\t\\tlittle is that which they believe."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "89",
    "Text": "Now when there has come to them a Book from Allah confirming the\\n\\t\\t\\tHoly Books of Torah and Gospel which they already have - even\\n\\t\\t\\tthough before this they used to pray for victory against the\\n\\t\\t\\tunbelievers - when there came to them that which they very well\\n\\t\\t\\trecognize, they knowingly rejected it; Allah's curse is on such\\n\\t\\t\\tdisbelievers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "90",
    "Text": "Ridiculous is the price for which they have sold away their\\n\\t\\t\\tsouls, that they deny Allah's revelation merely because of their\\n\\t\\t\\tgrudge, that Allah should send His grace (on an Israelite rather\\n\\t\\t\\tthan ) on whom He pleases from His servants (Muhammad)! They have\\n\\t\\t\\tdrawn on themselves wrath upon wrath, and for such disbelievers\\n\\t\\t\\tthere is a disgraceful punishment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "91",
    "Text": "When they are asked to believe in what Allah has revealed, they\\n\\t\\t\\treply: \"we only believe in what Allah has sent to us (Torah), and\\n\\t\\t\\twe reject what is beside that,\" while it is the truth confirming\\n\\t\\t\\ttheir own scriptures! Ask them, \"if you sincerely believe in what\\n\\t\\t\\twas sent to you , why did you kill the Prophets of Allah who were\\n\\t\\t\\tsent to you from amongst yourselves before?\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "92",
    "Text": "Musa (Moses) came to you with clear Signs, no sooner was he away\\n\\t\\t\\tfrom you, then you committed evil by worshipping the calf."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "93",
    "Text": "Remember that when We took a Covenant from you and We lifted the\\n\\t\\t\\tMount of Tur over your heads saying: \"Take what We have given you\\n\\t\\t\\tfirmly and listen to Our Commandments,\" you replied: \"we have\\n\\t\\t\\theard but we will not obey.\" So much was the love of that calf in\\n\\t\\t\\ttheir hearts due to their unbelief. O Muhammad, tell them: \"If\\n\\t\\t\\tyou are real believers, then why does your faith prompt you to do\\n\\t\\t\\tsuch evil things?\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "94",
    "Text": "Say O Muhammad: \"If the Home of the Hereafter is exclusively for\\n\\t\\t\\tyou and not for the rest of mankind, then wish for death if you\\n\\t\\t\\tare true in your claim!\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "95",
    "Text": "But they will never wish for death, because they are fully aware\\n\\t\\t\\tof the consequences of what they have sent before them for the\\n\\t\\t\\tHereafter. And Allah knows the mentality of the wrongdoers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "96",
    "Text": "You will find them the greediest of men for life, even greedier\\n\\t\\t\\tthan the mushrikin; each one of them wishes that he could be\\n\\t\\t\\tgiven a life of a thousand years; but the grant of such a life\\n\\t\\t\\twill not save them from the punishment, for Allah is watching\\n\\t\\t\\twhatever they do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "97",
    "Text": "Say O Muhammad: \"Whoever is the enemy of Jibra'el (Gabriel)\\n\\t\\t\\tshould know that he revealed this Qur'an to your heart by Allah's\\n\\t\\t\\tcommand, which confirms previous scriptures, and is a guidance\\n\\t\\t\\tand good news for the believers.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "98",
    "Text": "Let them know that whoever is an enemy to Allah, His angels, His\\n\\t\\t\\tRasools, Jibra'el (Gabriel) and Mika'el (Michael); Allah is an\\n\\t\\t\\tenemy to such unbelievers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "99",
    "Text": "We have sent down to you clear revelations: no one can deny them\\n\\t\\t\\texcept the transgressors."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "100",
    "Text": "Has it not been the case that every time they made a covenant a\\n\\t\\t\\tgroup of them threw it aside? But the fact is that most of them\\n\\t\\t\\tare faithless."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "101",
    "Text": "Whenever there came to them a Rasool from Allah confirming their\\n\\t\\t\\town Holy Book, a group from those to whom the Holy book were\\n\\t\\t\\tgiven cast off the Book of Allah behind their backs as if they\\n\\t\\t\\tknew nothing about it,"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "102",
    "Text": "and accepted what the shaitans falsely attributed to the kingdom\\n\\t\\t\\tof Sulaiman; not that Sulaiman was an unbeliever, it was the\\n\\t\\t\\tshaitans who were unbelievers: they taught witchcraft to the\\n\\t\\t\\tpeople and that which was revealed to the two angels, Harut and\\n\\t\\t\\tMarut in the city of Babylon. Yet these two angels never taught\\n\\t\\t\\tmagic to anyone without saying: \"We have been sent to tempt you;\\n\\t\\t\\tdo not renounce your faith.\" Inspite of this warning those people\\n\\t\\t\\tkept on learning, from the angels, the magic which could cause\\n\\t\\t\\tdiscord between husband and wife; although they could harm none\\n\\t\\t\\twith it except with Allah's permission. They learned, indeed,\\n\\t\\t\\twhat harmed them and did not profit them; even though they knew\\n\\t\\t\\tfully well that the buyers of magic would have no share in the\\n\\t\\t\\thappiness of the Hereafter. Surely, they sold their souls for a\\n\\t\\t\\tbad price, if they could understand it!"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "103",
    "Text": "If they would have believed (accepted Islam) and kept themselves\\n\\t\\t\\taway from evil, there would have been a better reward from Allah,\\n\\t\\t\\tif they could understand it!"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "104",
    "Text": "O Believers, do not say to our Rasool: \"Ra'ina\" (an ambiguous\\n\\t\\t\\tword for: \"Listen, may you become deaf\" or \"Our shepherd\" or in\\n\\t\\t\\tJudeo-Arabic language conveys the sense, \"our evil one.\") But say\\n\\t\\t\\t\"Unzurna\" (\"look upon\" us \"or pay attention\" to us) and listen to\\n\\t\\t\\thim carefully; and remember that there is a painful punishment\\n\\t\\t\\tfor the unbelievers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "105",
    "Text": "The unbelievers among the People of the Book, and the Mushrikin,\\n\\t\\t\\twould never wish that any good be sent down to you, O Muhammad,\\n\\t\\t\\tfrom your Rabb, but Allah chooses for His special Mercy whom He\\n\\t\\t\\tpleases, and Allah is the most Graceful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "106",
    "Text": "We do not abrogate any of Our verses of the Qur'an or cause it to\\n\\t\\t\\tbe forgotten except that We substitute it with something better\\n\\t\\t\\tor similar; don't you know that Allah has full power over\\n\\t\\t\\teverything?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "107",
    "Text": "Do you not know that to Allah belongs the dominion of the heavens\\n\\t\\t\\tand the earth, and that besides Allah you have no protector or\\n\\t\\t\\thelper!!"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "108",
    "Text": "Do you intend to ask questions from your Rasool (Muhammad) as\\n\\t\\t\\tMusa (Moses) was questioned before? But whoever barters belief\\n\\t\\t\\tfor unbelief, he indeed has lost the direction of the Right Way."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "109",
    "Text": "Many among the people of the Book (Jews and Christian) wish they\\n\\t\\t\\tcould somehow turn you back to unbelief; due to their selfish\\n\\t\\t\\tenvy, after the truth has become quite clear to them. Forgive\\n\\t\\t\\tthem and bear with them until Allah brings about His decision;\\n\\t\\t\\trest assured that Allah has power over everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "110",
    "Text": "Establish Salah and pay Zakah, and whatever good you send ahead\\n\\t\\t\\tof you to the Hereafter for yourselves, you shall find it with\\n\\t\\t\\tAllah; surely Allah is watching all your actions."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "111",
    "Text": "They say: \"None shall enter paradise except he who is a Jew or a\\n\\t\\t\\tChristian.\" These are their vain desires. Say O Muhammad: \"Let us\\n\\t\\t\\thave your proof if you are right in your claim.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "112",
    "Text": "Yea! Whoever submits himself entirely to Allah and is good to\\n\\t\\t\\tothers will be rewarded by his Rabb; he will have nothing to fear\\n\\t\\t\\tor to regret."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "113",
    "Text": "The Jews say: \"The Christians are not on the right track,\" and\\n\\t\\t\\tthe Christians say: \"It is the Jews who are not on the right\\n\\t\\t\\ttrack,\" yet both read their Holy Books (Torah or Gospel). And\\n\\t\\t\\tthose who have no knowledge of their Holy Books say like to what\\n\\t\\t\\tboth of them say; so Allah will judge between them in their\\n\\t\\t\\tdispute on the Day of Judgment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "114",
    "Text": "Who is more unjust than he who prevents people from the Masajid\\n\\t\\t\\t(place of worship) of Allah , forbids the mention of His name\\n\\t\\t\\ttherein, and strives to ruin them ? It is not proper for such\\n\\t\\t\\tpeople to enter in them except with His fear. For them there is\\n\\t\\t\\tdisgrace in this world and grievous punishment in the Hereafter."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "115",
    "Text": "To Allah belong the East and the West; whichever direction you\\n\\t\\t\\tturn your face there is the presence of Allah. Surely Allah is\\n\\t\\t\\tAll-Embracing and All-Knowing."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "116",
    "Text": "They say: \"Allah has taken to Himself a son;\" Allah is above such\\n\\t\\t\\tthings! Rather, to Him belongs all that is in the heavens and in\\n\\t\\t\\tthe earth; all are obedient to Him."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "117",
    "Text": "He is the Creator of the heavens and the earth ! When He decrees\\n\\t\\t\\ta thing, He needs only to say, \"Be,\" and there it becomes."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "118",
    "Text": "Those who have no knowledge ask: \"Why does Allah not speak to us\\n\\t\\t\\tface to face or send us a sign ?\" The same demand was made by\\n\\t\\t\\tthose before them: they all have the same mentality. We have\\n\\t\\t\\talready shown clear signs to those whose faith is firm."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "119",
    "Text": "What clearer sign could there be than this Book? We have sent you\\n\\t\\t\\t(O Muhammad) with the knowledge of the Truth and made you the\\n\\t\\t\\tbearer of good news and warning; now, you will not be called upon\\n\\t\\t\\tto answer about the actions of the companions of the blazing\\n\\t\\t\\tfire."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "120",
    "Text": "The Jews and the Christians will never be pleased with you, until\\n\\t\\t\\tyou follow their faith. O Muhammad, tell them : \"Allah's guidance\\n\\t\\t\\tis the only guidance;\" and if after all the knowledge you have\\n\\t\\t\\treceived, you yield to their desires, there shall be none to\\n\\t\\t\\tprotect you or help you from the wrath of Allah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "121",
    "Text": "Those to whom We have given the book and who read it as it ought\\n\\t\\t\\tto be read, they are the ones who believe in it; as for those who\\n\\t\\t\\treject it, they are for sure the losers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "122",
    "Text": "O Children of Israel! Remember the special favor which I bestowed\\n\\t\\t\\tupon you; that I exalted you above all other nations."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "123",
    "Text": "Guard yourselves against the day when one soul shall not avail\\n\\t\\t\\tanother, no ransom shall be taken, no intercession shall profit\\n\\t\\t\\tanyone, and no help shall be given."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "124",
    "Text": "Remember that when Ibrahim (Abraham) was tested by his Rabb with\\n\\t\\t\\tcertain commands, he fulfilled them. Allah said: \"Surely, I will\\n\\t\\t\\tmake you the leader of mankind.\" \"What about my offspring?\" Asked\\n\\t\\t\\tIbrahim. \"My pledge,\" said Allah, \"will not apply to the evil\\n\\t\\t\\tdoers.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "125",
    "Text": "Remember when We made the House (the Ka'bah) a center and\\n\\t\\t\\tsanctuary for mankind saying, \"Take the station of Ibrahim as a\\n\\t\\t\\tplace of prayer;\" We entrusted Ibrahim and Isma`il to cleanse Our\\n\\t\\t\\tHouse for those who walk around it, who meditate in it, and who\\n\\t\\t\\tkneel and prostrate in prayers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "126",
    "Text": "Ibrahim said: \"My Rabb make this (Makkah) a secure town and\\n\\t\\t\\tprovide its people with plenty of food from fruits, those of them\\n\\t\\t\\twho believe in Allah and the Last Day.\" He answered, \"As for\\n\\t\\t\\tthose who do not, I shall also provide for them in this life,\\n\\t\\t\\tthough in the Hereafter I shall drag them to the torture of\\n\\t\\t\\tHellfire and it is an evil destination indeed!\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "127",
    "Text": "Ibrahim (Abraham) and Isma`il (Ishmael) raised the foundations of\\n\\t\\t\\tthe House and dedicated it by saying: \"Accept this from us, O\\n\\t\\t\\tRabb, You are the one who hears all and knows all."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "128",
    "Text": "O Rabb, make us both Muslims (submissive to You); and make our\\n\\t\\t\\tdescendants a nation that will be Muslims (submissive to You).\\n\\t\\t\\tTeach us our rites of worship and forbear our shortcomings;\\n\\t\\t\\tsurely, You are the Acceptor of repentance, the Merciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "129",
    "Text": "O Rabb, appoint from among them a Rasool who shall recite to them\\n\\t\\t\\tYour Revelations and teach them the Book and the Wisdom and\\n\\t\\t\\tsanctify them; surely, You are the All-Mighty, the Wise.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "130",
    "Text": "Who but a foolish man would renounce the faith of Ibrahim? We\\n\\t\\t\\tchose him in this worldly life while in the Hereafter he will be\\n\\t\\t\\tamong the righteous."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "131",
    "Text": "When his Rabb asked him: \"Be a Muslim,\" he answered: \"I have\\n\\t\\t\\tbecome a Muslim to the Rabb of the worlds.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "132",
    "Text": "This was the legacy that Ibrahim left to his sons and so did\\n\\t\\t\\tYa'qoob (Jacob), when he said: \"O my sons! Allah has chosen for\\n\\t\\t\\tyou this Deen (way of life), therefore, die not unless you are\\n\\t\\t\\tMuslims.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "133",
    "Text": "Were you present when death approached Ya'qoob (Jacob)? He asked\\n\\t\\t\\this sons: \"Who will you worship after me?\" They replied: \"We will\\n\\t\\t\\tworship the same One God Who is your Rabb and the Rabb of your\\n\\t\\t\\tforefathers Ibrahim, Isma`il and Ishaq (Isaac), and to Him we all\\n\\t\\t\\tsubmit as Muslims.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "134",
    "Text": "They were a people that have passed away. They shall reap the\\n\\t\\t\\tfruits of what they did, and you shall for what you do. You shall\\n\\t\\t\\tnot be questioned about what they did."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "135",
    "Text": "Jews and Christians say: \"Be Jews or Christians, you shall then\\n\\t\\t\\tbe rightly guided.\" O Muhammad, say: \"By no means! We follow the\\n\\t\\t\\tfaith of Ibrahim, the upright one; and he was not one of the\\n\\t\\t\\tmushrikin.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "136",
    "Text": "Say: \"We believe in Allah and that which is revealed to us; and\\n\\t\\t\\twhat was revealed to Ibrahim (Abraham), Isma'il (Ishmael), Ishaq\\n\\t\\t\\t(Isaac), Ya'qoob (Jacob) and their descendants, and that which\\n\\t\\t\\twas given to Musa (Moses), Isa (Jesus) and other Prophets from\\n\\t\\t\\ttheir Rabb. We do not discriminate any of them, and to Allah we\\n\\t\\t\\thave surrendered ourselves (in Islam).\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "137",
    "Text": "So, if they accept Islam like you, they shall be rightly guided;\\n\\t\\t\\tif they reject it, they will surely fall into dissension (divide\\n\\t\\t\\tinto differing factions); Allah will be your sufficient defender\\n\\t\\t\\tagainst them, and He hears and knows everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "138",
    "Text": "Baptism is from Allah; and who is better than Allah in baptizing?\\n\\t\\t\\tHim do we worship."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "139",
    "Text": "Say, O Muhammad: \"Would you dispute with us concerning Allah, who\\n\\t\\t\\tis our Rabb and your Rabb as well? We shall be accountable to Him\\n\\t\\t\\tfor our deeds and you for yours; to Him alone we are devoted."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "140",
    "Text": "Do you claim that Ibrahim (Abraham), Isma'il (Ishmael), Ishaq\\n\\t\\t\\t(Isaac), Ya'qoob (Jacob) and their descendants were all Jews or\\n\\t\\t\\tChristians? Are you more knowledgeable than Allah?\" Who is more\\n\\t\\t\\twicked than the one who hides the testimony he has received from\\n\\t\\t\\tAllah? Allah is not unaware of what you do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "141",
    "Text": "That was a nation who has already passed away. They are\\n\\t\\t\\tresponsible for what they did and your are for what you do, you\\n\\t\\t\\tshall not be questioned about their deeds."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "142",
    "Text": "The foolish will ask: \"Why did they turn away from the Qiblah\\n\\t\\t\\t(the direction in prayer) towards which they used to face?\" O\\n\\t\\t\\tMuhammad, say: \"East and West belong to Allah; He guides whomever\\n\\t\\t\\tHe wishes to the Right Way.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "143",
    "Text": "We have made you a moderate Ummah (nation) so that you may\\n\\t\\t\\ttestify against mankind and that your own Rasool may testify\\n\\t\\t\\tagainst you. We decreed your former Qiblah only to distinguish\\n\\t\\t\\tthose who are the real followers of the Rasool from those who\\n\\t\\t\\twould back away from the faith. It was indeed a hard test except\\n\\t\\t\\tfor those whom Allah has guided. Allah wants not to make your\\n\\t\\t\\tfaith fruitless. Allah is Compassionate and Merciful to mankind."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "144",
    "Text": "O Muhammad, many a time We noticed you turning your face towards\\n\\t\\t\\theaven; now We will make you turn towards a Qiblah that will\\n\\t\\t\\tplease you. Turn your face during Salah towards the Sacred Mosque\\n\\t\\t\\t(Ka'bah); wherever you are turn your face in that direction. The\\n\\t\\t\\tpeople of the Book know this to be the truth from their Rabb.\\n\\t\\t\\tAllah is not unaware of what they do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "145",
    "Text": "Even if you give every proof to the people of the Book, they will\\n\\t\\t\\tnot accept your Qiblah, nor will you accept theirs. Neither of\\n\\t\\t\\tthem (the Jews and Christians) are the followers of each other's\\n\\t\\t\\tQiblah. If, after all the knowledge you have been given, you\\n\\t\\t\\tyield to their desires then surely you will be among the\\n\\t\\t\\twrongdoers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "146",
    "Text": "Those to whom We have given the Book (Jews and Christians)\\n\\t\\t\\trecognize this fact as they recognize their own children."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "147",
    "Text": "Nevertheless, a group of them deliberately conceal the truth. The\\n\\t\\t\\ttruth is from your Rabb; therefore, you should never be among the\\n\\t\\t\\tdoubters."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "148",
    "Text": "Everyone has a direction towards which he turns, therefore,\\n\\t\\t\\temulate one another in good deeds. Wherever you are, Allah will\\n\\t\\t\\tbring all of you together; Allah has power over all things."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "149",
    "Text": "From whatever place you come forth, turn your face during Salah\\n\\t\\t\\ttowards the Sacred Mosque; this is in fact a commandment from\\n\\t\\t\\tyour Rabb. Allah is not unaware of what you do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "150",
    "Text": "Again, whatever place you come forth, turn your face during Salah\\n\\t\\t\\ttowards the Sacred Mosque; and wherever you are, face towards it,\\n\\t\\t\\tso that people will not have any argument against you, except\\n\\t\\t\\tthose among them who are wrongdoers. Do not fear them; fear Me,\\n\\t\\t\\tso that I may perfect My favors to you and that you may be\\n\\t\\t\\trightly guided,"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "151",
    "Text": "just as We bestowed Our favor upon you When We sent among you a\\n\\t\\t\\tRasool of your own who recites to you Our revelations, sanctifies\\n\\t\\t\\tyou, teaches you the Book and wisdom, and teaches you that which\\n\\t\\t\\tyou did not know."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "152",
    "Text": "Therefore, remember Me, and I will remember you, be grateful to\\n\\t\\t\\tMe and never deny Me."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "153",
    "Text": "O' You who believe! Seek My help with patience and prayer:\\n\\t\\t\\tsurely, Allah is with those who are patient."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "154",
    "Text": "Do not say about those who are slain in the cause of Allah\\n\\t\\t\\t(martyrs), that they are dead. Nay, they are alive, but you do\\n\\t\\t\\tnot perceive it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "155",
    "Text": "We shall surely test your steadfastness with fear and famine,\\n\\t\\t\\twith loss of property, life and produce. Give good news to those\\n\\t\\t\\twho endure with patience;"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "156",
    "Text": "who, when afflicted with calamity, say: \"We belong to Allah and\\n\\t\\t\\tto Him we shall return.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "157",
    "Text": "Such are the people on whom there are blessings and Mercy from\\n\\t\\t\\tAllah; and they are the ones that are rightly guided."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "158",
    "Text": "Behold! Safa and Marwah (two hills in the Sacred Mosque) are\\n\\t\\t\\tamong the symbols of Allah. So anyone who performs Hajj or Umrah\\n\\t\\t\\t(pilgrimage) to the House, there is no blame if one goes around\\n\\t\\t\\tboth of them; and anyone who does good voluntarily should know\\n\\t\\t\\tthat surely Allah knows the grateful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "159",
    "Text": "Those who conceal the clear proofs and the guidance, after We\\n\\t\\t\\thave made it clear in the Book for mankind, will have Allah's\\n\\t\\t\\tcurse and that of those who are entitled to curse;"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "160",
    "Text": "except those who repent, reform and let the truth be known; I'll\\n\\t\\t\\taccept their repentance, for I am the Receiver of Repentance, the\\n\\t\\t\\tMerciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "161",
    "Text": "Surely those who are unbelievers and die while they are\\n\\t\\t\\tunbelievers, they are the ones on whom is the curse of Allah, the\\n\\t\\t\\tangels and all mankind,"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "162",
    "Text": "they will live in it forever; neither their punishment shall be\\n\\t\\t\\tlightened nor shall they be given respite."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "163",
    "Text": "Your God is one God; there is no one worthy of worship except\\n\\t\\t\\tHim, the Compassionate, the Merciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "164",
    "Text": "Surely, In the creation of the heavens and the earth; in the\\n\\t\\t\\talternation of the night and the day, in the sailing of the ships\\n\\t\\t\\tthrough the ocean for the profit of mankind; in the rain which\\n\\t\\t\\tAllah sends down from the skies, with which He revives the earth\\n\\t\\t\\tafter its death and spreads in it all kinds of animals, in the\\n\\t\\t\\tchange of the winds and the clouds between the sky and the earth\\n\\t\\t\\tthat are made subservient, there are signs for rational people."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "165",
    "Text": "There are some who worship other deities besides Allah\\n\\t\\t\\t(mushrikin), they love them as they should love Allah, whereas\\n\\t\\t\\tthe believers are strong in love for Allah. If those who are\\n\\t\\t\\tunjust could visualize (the Day of Judgement) when they will see\\n\\t\\t\\tthe chastisement, they would come to know for sure that all\\n\\t\\t\\tpowers belong to Allah and that Allah is stern in retribution."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "166",
    "Text": "On that Day those leaders who were being followed, when faced\\n\\t\\t\\twith their punishment, will renounce those who followed them and\\n\\t\\t\\tthe bonds which united them will break asunder."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "167",
    "Text": "The followers will say: \"If it could be possible for us to live\\n\\t\\t\\tagain, we would renounce them as they have renounced us today.\"\\n\\t\\t\\tThus Allah will show them the fruits of their deeds. They will\\n\\t\\t\\tsigh with regret, and shall not be able to come out of the Hell\\n\\t\\t\\tfire."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "168",
    "Text": "O Mankind! Eat of what is lawful and clean on the earth and do\\n\\t\\t\\tnot follow the footsteps of Shaitan, surely he is your open\\n\\t\\t\\tenemy."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "169",
    "Text": "He enjoins you to commit evil and indecency and to say certain\\n\\t\\t\\tthings against Allah about which you have no knowledge."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "170",
    "Text": "When it is said to them: \"Follow what Allah has revealed.\" They\\n\\t\\t\\treply: \"Nay! We will follow what our forefathers practiced.\"\\n\\t\\t\\tWell! Even if their forefathers had no sense at all and lacked\\n\\t\\t\\tguidance?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "171",
    "Text": "The parable of those who reject faith is like the cattle which,\\n\\t\\t\\tcall out to them as one may, hear nothing but a shout and a cry\\n\\t\\t\\tsince they are unable to understand; they are deaf, dumb and\\n\\t\\t\\tblind, and understand nothing."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "172",
    "Text": "O believers! Eat the clean things which We have provided you and\\n\\t\\t\\tgive thanks to Allah, if you worship only Him."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "173",
    "Text": "He has forbidden you to eat dead meat, blood, the flesh of swine,\\n\\t\\t\\tand that on which any name other than Allah has been invoked; but\\n\\t\\t\\tif someone is compelled by absolute necessity, intending neither\\n\\t\\t\\tto sin nor to transgress, he shall incur no sin. Surely Allah is\\n\\t\\t\\tForgiving, Merciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "174",
    "Text": "Surely those who conceal any part of the Book which Allah has\\n\\t\\t\\trevealed and sell His revelations for petty price (material\\n\\t\\t\\tgain), shall swallow nothing but fire into their bellies. On the\\n\\t\\t\\tDay of Resurrection Allah will neither speak to them nor purify\\n\\t\\t\\tthem and they shall have painful punishment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "175",
    "Text": "These are the kind of people who barter guidance for error and\\n\\t\\t\\tforgiveness for punishment. How stubborn are they to encounter\\n\\t\\t\\tHell fire!"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "176",
    "Text": "Their doom is because Allah has revealed the Book with the truth;\\n\\t\\t\\tsurely those who seek causes of dispute in the Book (The Qur'an)\\n\\t\\t\\tare in extreme schism (divergence)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "Text": "Righteousness is not whether you turn your face towards East or\\n\\t\\t\\tWest; but the righteousness is to believe in Allah, the Last Day,\\n\\t\\t\\tthe Angels, the Books and the Prophets, and to spend wealth out\\n\\t\\t\\tof love for Him on relatives, orphans, helpless, needy\\n\\t\\t\\ttravellers, those who ask for and on the redemption of captives;\\n\\t\\t\\tand to establish Salah (prayers), to pay Zakah (alms), to fulfill\\n\\t\\t\\tpromises when made, to be steadfast in distress, in adversity,\\n\\t\\t\\tand at the time of war. These people are the truthful and these\\n\\t\\t\\tare the pious."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "178",
    "Text": "O believers! Retaliation is prescribed for you in the cases of\\n\\t\\t\\tmurder: a free man for a free man, a slave for a slave, and a\\n\\t\\t\\tfemale for a female. But if anyone is pardoned by his aggrieved\\n\\t\\t\\tbrother, then bloodwit (a ransom for manslaughter) should be\\n\\t\\t\\tdecided according to the common law and payment should be made\\n\\t\\t\\twith gratitude. This is a concession and a mercy from your Rabb.\\n\\t\\t\\tNow, whoever exceeds the limits after this, shall have a painful\\n\\t\\t\\tpunishment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "179",
    "Text": "O men of understanding! There is security of life for you in the\\n\\t\\t\\tlaw of retaliation, so that you may learn self-restraint."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "180",
    "Text": "The will is made obligatory before the death of anyone of you who\\n\\t\\t\\tis leaving some property behinds to bequest it equitably to his\\n\\t\\t\\tparents and relatives. This is a duty incumbent on the righteous."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "181",
    "Text": "If anyone changes the bequest after hearing it, the sin of it\\n\\t\\t\\tthen is on those who make the change. Allah hears and knows\\n\\t\\t\\teverything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "182",
    "Text": "But there is no blame on the one who suspects an error or an\\n\\t\\t\\tinjustice on the part of the testator and brings about a\\n\\t\\t\\tsettlement among the parties. Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "183",
    "Text": "O believers! Fasting is prescribed for you as it was prescribed\\n\\t\\t\\tfor those before you so that you may learn self-restraint."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "184",
    "Text": "Fast the prescribed number of days; except if any of you is ill\\n\\t\\t\\tor on a journey, let him fast a similar number of days later. For\\n\\t\\t\\tthose who can not endure it for medical reasons, there is a\\n\\t\\t\\transom: the feeding of one poor person for each missed day. But\\n\\t\\t\\tif he feeds more of his own free will, it is better for him.\\n\\t\\t\\tHowever, if you truly understand the rationale of fasting, it is\\n\\t\\t\\tbetter for you to fast."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "185",
    "Text": "It is the month of Ramadhan in which the Qur'an was revealed, a\\n\\t\\t\\tguidance for mankind with clear teachings showing the Right Way\\n\\t\\t\\tand a criterion of truth and falsehood. Therefore, anyone of you\\n\\t\\t\\twho witnesses that month should fast therein, and whoever is ill\\n\\t\\t\\tor upon a journey shall fast a similar number of days later on.\\n\\t\\t\\tAllah intends your well-being and does not want to put you to\\n\\t\\t\\thardship. He wants you to complete the prescribed period so that\\n\\t\\t\\tyou should glorify His Greatness and render thanks to Him for\\n\\t\\t\\tgiving you guidance."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "186",
    "Text": "When my servants question you about Me, tell them that I am very\\n\\t\\t\\tclose to them. I answer the prayer of every suppliant when he\\n\\t\\t\\tcalls Me; therefore, they should respond to Me and put their\\n\\t\\t\\ttrust in Me, so that they may be rightly guided."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "Text": "It is made lawful for you to approach your wives during the night\\n\\t\\t\\tof the fast; they are an apparel for you and you for them. Allah\\n\\t\\t\\tknows that you were committing dishonesty to your souls. So He\\n\\t\\t\\thas relented towards you and pardoned you. Now, you may approach\\n\\t\\t\\tyour wives and seek what Allah has written for you. Eat and drink\\n\\t\\t\\tuntil the white thread of dawn appears to you distinct from the\\n\\t\\t\\tblack thread of night, then complete your fast till nightfall. Do\\n\\t\\t\\tnot approach your wives during I'htikaf (retreat in the mosques\\n\\t\\t\\tin last ten days of Ramadhan). These are the limits set by Allah:\\n\\t\\t\\tdo not ever violate them. Thus Allah makes His revelations clear\\n\\t\\t\\tto mankind so that they may guard themselves against evil."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "188",
    "Text": "Do not misappropriate one another's property unjustly, nor bribe\\n\\t\\t\\tthe judges, in order to misappropriate a part of other people's\\n\\t\\t\\tproperty, sinfully and knowingly."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "189",
    "Text": "They question you about the new moon. Tell them: it is to\\n\\t\\t\\tdetermine the periods of time for the benefit of mankind and for\\n\\t\\t\\tthe Hajj (pilgrimage). It is not righteous to enter your houses\\n\\t\\t\\tfrom the back doors during Hajj times. Righteousness is to fear\\n\\t\\t\\tAllah. Enter your houses through the proper doors and fear Allah\\n\\t\\t\\tso that you may prosper."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "190",
    "Text": "Fight in the cause of Allah with those who fight against you, but\\n\\t\\t\\tdo not exceed the limits. Allah does not like transgressors."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "191",
    "Text": "Kill them wherever they confront you in combat and drive them out\\n\\t\\t\\tof the places from which they have driven you. Though killing is\\n\\t\\t\\tbad, creating mischief is worse than killing. Do not fight them\\n\\t\\t\\twithin the precincts of the Sacred Mosque unless they attack you\\n\\t\\t\\tthere; but if they attack you put them to the sword; that is the\\n\\t\\t\\tpunishment for such unbelievers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "192",
    "Text": "If they cease hostility, then surely Allah is Forgiving,\\n\\t\\t\\tMerciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "193",
    "Text": "Fight against them until there is no more disorder and Allah's\\n\\t\\t\\tsupremacy is established. If they desist, let there be no\\n\\t\\t\\thostility except against the oppressors."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "194",
    "Text": "The Sacred month, in which fighting is prohibited, is to be\\n\\t\\t\\trespected if the same is respected by the enemy: sacred things\\n\\t\\t\\ttoo are subject to retaliation. Therefore, if anyone transgresses\\n\\t\\t\\ta prohibition and attacks you, retaliate with the same force.\\n\\t\\t\\tFear Allah, and bear in mind that Allah is with the righteous."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "195",
    "Text": "Give generously for the cause of Allah and do not cast yourselves\\n\\t\\t\\tinto destruction by your own hands. Be charitable: Allah loves\\n\\t\\t\\tthose who are charitable."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "Text": "Complete the Hajj (obligatory pilgrimage to Makkah) and the Umrah\\n\\t\\t\\t(optional visit to Makkah) for the sake of Allah. If you are\\n\\t\\t\\tprevented from proceeding then send such offering for sacrifice\\n\\t\\t\\tas you can afford and do not shave your head until the offerings\\n\\t\\t\\thave reached their destination. But if any of you is ill or has\\n\\t\\t\\tan ailment in his scalp which necessitates shaving, he must pay\\n\\t\\t\\transom either by fasting or feeding the poor or offering a\\n\\t\\t\\tsacrifice. If in peacetime anyone wants to take the advantage of\\n\\t\\t\\tperforming Umrah and Hajj together, he should make an offering\\n\\t\\t\\twhich he can afford; but if he lack the means, let him fast three\\n\\t\\t\\tdays during the Hajj and seven days on his return making ten days\\n\\t\\t\\tin all. This order is for the one whose household is not in the\\n\\t\\t\\tprecincts of the Sacred Mosque. Fear Allah and know that Allah is\\n\\t\\t\\tstrict in retribution."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "197",
    "Text": "Hajj is in the well known months. He who undertakes to perform it\\n\\t\\t\\tmust abstain from husband-wife relationship, obscene language,\\n\\t\\t\\tand wrangling during Hajj. Whatever good you do, Allah knows it.\\n\\t\\t\\tTake necessary provisions with you for the journey, and piety is\\n\\t\\t\\tthe best provision of all. Fear Me, O people endowed with\\n\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "198",
    "Text": "There is no blame on you if you seek the bounty of your Rabb\\n\\t\\t\\tduring this journey. When you return from Arafat (stop at\\n\\t\\t\\tMuzdalifah and) praise Allah near Mash'ar-il-Haram. Praise Him as\\n\\t\\t\\tHe has guided you, for before this you were from the people who\\n\\t\\t\\thad lost the Right Way."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "199",
    "Text": "Then return from where the others return and ask Allah's\\n\\t\\t\\tforgiveness; surely Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "200",
    "Text": "When you have fulfilled your sacred duties, praise Allah as you\\n\\t\\t\\tused to praise your forefathers or with deeper reverence. There\\n\\t\\t\\tare some who say: \"Our Rabb! Give us abundance in this world.\"\\n\\t\\t\\tSuch people will not have any share in the hereafter."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "201",
    "Text": "But there are others who say: \"Our Rabb! Give us the good life,\\n\\t\\t\\tboth in this world and in the Hereafter and save us from the\\n\\t\\t\\ttorment of the fire.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "202",
    "Text": "Such people shall have their due share in both worlds according\\n\\t\\t\\tto what they have earned, Allah is swift in settling the\\n\\t\\t\\taccounts."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "203",
    "Text": "Celebrate the praises of Allah during these appointed days. If\\n\\t\\t\\tanyone hastens to leave Mina after two days or stays there a day\\n\\t\\t\\tlonger there is no blame on him provided he spends these days in\\n\\t\\t\\tpiety. Fear Allah and remember that you will surely be gathered\\n\\t\\t\\tbefore Him."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "204",
    "Text": "Among the people there is one whose speech fascinates you in this\\n\\t\\t\\tworldly life; he may even call upon Allah to witness what is in\\n\\t\\t\\this heart, yet he is your staunch opponent."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "205",
    "Text": "And when he leaves you, he directs his efforts towards causing\\n\\t\\t\\tmischief in the land, destroying crops and cattle. Allah, Whom he\\n\\t\\t\\tmakes his witness, does not like mischief."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "206",
    "Text": "When it is said to him \"Fear Allah,\" arrogance carries him off to\\n\\t\\t\\tsin. Hell will be the proper place for such a person, which is\\n\\t\\t\\tindeed an evil refuge."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "207",
    "Text": "And among people there is one who would give away his life to\\n\\t\\t\\tseek the pleasure of Allah. Allah is affectionate to His\\n\\t\\t\\tdevotees."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "208",
    "Text": "O believers enter into Islam completely and do not follow the\\n\\t\\t\\tfootsteps of Shaitan, surely he is your clear-cut enemy."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "209",
    "Text": "If you falter after receiving the clear-cut message, then keep in\\n\\t\\t\\tmind that Allah is Mighty, Wise."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "210",
    "Text": "Are they waiting for Allah to come down to them in the shadow of\\n\\t\\t\\tclouds, along with the angels, and make His decision known?\\n\\t\\t\\tUltimately all matters will be presented to Allah for decision."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "211",
    "Text": "Ask the Children of Israel how many clear-cut signs We have given\\n\\t\\t\\tthem. Anyone who substitutes the favor of Allah (changes the\\n\\t\\t\\trevelations of Allah) after it has come to him, should know that\\n\\t\\t\\tAllah is strict in retribution."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "212",
    "Text": "The life of this world is charming to those who are unbelievers\\n\\t\\t\\tand they mock at those who believe, but they forget that those\\n\\t\\t\\twho fear Allah will rank above them on the Day of Resurrection;\\n\\t\\t\\tAllah gives sustenance without measure to whom He wants."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "213",
    "Text": "Mankind was one nation having one religion. Later when people\\n\\t\\t\\tinvented other religions, Allah appointed Prophets as bearers of\\n\\t\\t\\tgood news and warnings; and revealed to them the Book with the\\n\\t\\t\\tTrue Guidance to settle the matters of dispute between mankind.\\n\\t\\t\\tBut the very people to whom it was given, started disputes after\\n\\t\\t\\tthe clear arguments had come to them, because of rivalry between\\n\\t\\t\\tone another. Allah has guided the believers by His will to the\\n\\t\\t\\ttruth in those matters in which they had differences. Allah\\n\\t\\t\\tguides whom He pleases towards the Right Way."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "214",
    "Text": "Do you think that you will enter Paradise without any trials\\n\\t\\t\\twhile you have known the examples of those who passed away before\\n\\t\\t\\tyou? They were afflicted with suffering and adversity and were so\\n\\t\\t\\tviolently shaken up that even the Rasool and the believers with\\n\\t\\t\\thim cried out: \"When will Allah's help come?\" Then they were\\n\\t\\t\\tcomforted with the words, Be aware! Allah's help is ever close."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "215",
    "Text": "They ask you what they should spend in charity. Say: \"Whatever\\n\\t\\t\\tyou spend with a good heart, give it to parents, relatives,\\n\\t\\t\\torphans, the helpless, and travellers in need. Whatever good you\\n\\t\\t\\tdo, Allah is aware of it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "216",
    "Text": "Fighting has been made obligatory for you, much to your dislike.\\n\\t\\t\\tIt is quite possible that something which you don't like is good\\n\\t\\t\\tfor you and that something which you love is bad for you. Allah\\n\\t\\t\\tknows, and you do not."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "217",
    "Text": "They ask you about war in the Sacred Month. Tell them: \"fighting\\n\\t\\t\\tin this month is a heinous offence; but to prevent from the path\\n\\t\\t\\tof Allah, to deny Him, to prevent access and expel His\\n\\t\\t\\tworshippers from the Sacred Mosque is a more severe crime, since\\n\\t\\t\\tmischief is worse than killing in His sight. As for unbelievers:\\n\\t\\t\\tthey will not cease fighting until they succeed in turning you\\n\\t\\t\\tback from your religion if they can; and if any of you turns back\\n\\t\\t\\tfrom his religion and dies as an unbeliever, his deeds will\\n\\t\\t\\tbecome void in this life and in the hereafter. He will be the\\n\\t\\t\\tinmate of hellfire, to live in there forever."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "218",
    "Text": "Surely those who are believers, and migrated and struggled in the\\n\\t\\t\\tpath of Allah, they can hope for the mercy of Allah; and Allah is\\n\\t\\t\\tForgiving, Merciful.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "219",
    "Text": "They ask you about drinking and gambling. Tell them: \"There is\\n\\t\\t\\tgreat sin in both, although they may have some benefit for men;\\n\\t\\t\\tbut the sin is greater than the benefit.\" They ask you what they\\n\\t\\t\\tshould spend; tell them: \"Whatever you can.\" Thus Allah makes His\\n\\t\\t\\trevelations clear to you, so that you may reflect upon"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "220",
    "Text": "this world and the hereafter. They ask you about orphans. Tell\\n\\t\\t\\tthem: \"It is best to deal with them justly; you may become\\n\\t\\t\\tco-partners with them, after all they are your brethren; Allah\\n\\t\\t\\tknows who means harm and also who means their welfare. If Allah\\n\\t\\t\\thad wanted He could be hard on you in this matter, surely Allah\\n\\t\\t\\tis Mighty, Wise.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "221",
    "Text": "Do not marry mushrik women until they become believers; a\\n\\t\\t\\tbelieving slave woman is better than a free mushrik woman even\\n\\t\\t\\tthough she may be more attractive to you. Likewise, do not marry\\n\\t\\t\\tmushrik men until they become believers: a believing slave is\\n\\t\\t\\tbetter than a free mushrik even though he may be more pleasing to\\n\\t\\t\\tyou. These mushrikin invite you to hell fire while Allah invites\\n\\t\\t\\tyou towards paradise and forgiveness by His grace. He makes His\\n\\t\\t\\trevelations clear to mankind so that they may take heed."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "222",
    "Text": "They ask you about menstruation. \"Tell them: This is a\\n\\t\\t\\tdiscomfort; therefore, keep away from women (do not have sexual\\n\\t\\t\\tintercourse) during their menstrual periods and do not approach\\n\\t\\t\\tthem until they are clean again. When they have cleansed\\n\\t\\t\\tthemselves then you may approach them in the manner Allah has\\n\\t\\t\\tenjoined for you. Surely Allah loves those who turn to Him in\\n\\t\\t\\trepentance and keep themselves clean."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "223",
    "Text": "Your wives are your tilth; so go to your tilth when you like.\\n\\t\\t\\tTake care of your future and refrain from the displeasure of\\n\\t\\t\\tAllah. Bear in mind that you shall meet Him in the Hereafter, and\\n\\t\\t\\tgive good news to the believers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "224",
    "Text": "Do not use Allah's name in your oaths as an excuse to prevent you\\n\\t\\t\\tfrom dealing justly, guarding against evil and making peace\\n\\t\\t\\tbetween people; Allah hears and knows everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "225",
    "Text": "Allah will not hold you accountable for what is inadvertent in\\n\\t\\t\\tyour oaths, but He will hold you accountable for what you\\n\\t\\t\\tintended in your hearts; Allah is Forgiving, Forbearing."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "226",
    "Text": "Those who renounce conjugal relationship with their wives on oath\\n\\t\\t\\thave a limitation of four months. If they reconcile and restore\\n\\t\\t\\ttheir relationship, surely Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "227",
    "Text": "But if they decide to divorce them, they may do so, surely Allah\\n\\t\\t\\thears and knows everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "228",
    "Text": "Divorced women must keep themselves waiting for three menstrual\\n\\t\\t\\tperiods, it is not lawful for them to hide what Allah has created\\n\\t\\t\\tin their wombs if they believe in Allah and the Last Day. In such\\n\\t\\t\\tcases their husbands have a right to take them back in that\\n\\t\\t\\tperiod if they desire reconciliation. Women have rights similar\\n\\t\\t\\tto those exercised against them in an equitable manner, although\\n\\t\\t\\tmen have a status (degree of responsibility) above them. Allah is\\n\\t\\t\\tMighty, Wise."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "229",
    "Text": "Pronouncement of revocable divorce is only allowed twice: then\\n\\t\\t\\tshe should be allowed to stay with honor or let go with kindness\\n\\t\\t\\tafter the third pronouncement. It is not lawful for husbands to\\n\\t\\t\\ttake anything back which they have given them except when both\\n\\t\\t\\tparties fear that they may not be able to follow the limits set\\n\\t\\t\\tby Allah; then if you fear that they both will not be able to\\n\\t\\t\\tkeep the limits of Allah, there is no blame if, by mutual\\n\\t\\t\\tagreement the wife compensates the husband to obtain divorce.\\n\\t\\t\\tThese are the limits set by Allah; do not transgress them, and\\n\\t\\t\\tthose who transgress the limits of Allah are the wrongdoers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "230",
    "Text": "So if a husband divorces his wife three times, it is not lawful\\n\\t\\t\\tfor him to remarry her until after she has married another man\\n\\t\\t\\tand gotten divorced. In that case there is no blame on either of\\n\\t\\t\\tthem if they reunite in marriage, provided they think that they\\n\\t\\t\\tcan keep the limits of Allah. Such are the limits of Allah which\\n\\t\\t\\tHe makes clear to the people of understanding."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "231",
    "Text": "When you divorce women and they have reached the end of their\\n\\t\\t\\twaiting period ('Iddat) either allow them to stay with honor or\\n\\t\\t\\tlet them go with kindness; but you should not retain them to harm\\n\\t\\t\\tthem or to take undue advantage; if anyone does that he wrongs\\n\\t\\t\\this own soul. Do not take Allah's revelations as a joke. Remember\\n\\t\\t\\tthe favors of Allah upon you and the fact that He sent down the\\n\\t\\t\\tBook and Wisdom for your guidance. Fear Allah and know that Allah\\n\\t\\t\\thas knowledge of everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "232",
    "Text": "When you have divorced women and they have reached the end of\\n\\t\\t\\ttheir waiting period do not prevent them from marrying their\\n\\t\\t\\tprospective husbands if they have come to an honorable agreement.\\n\\t\\t\\tThis is enjoined on everyone amongst you who believes in Allah\\n\\t\\t\\tand the Last Day. This is more virtuous and chaste for you; Allah\\n\\t\\t\\tknows what you do not know."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "233",
    "Text": "The mothers shall breast-feed their offspring for two whole years\\n\\t\\t\\tif the father wishes the breast-feeding to be completed. The\\n\\t\\t\\treasonable cost of their maintenance and clothing will be the\\n\\t\\t\\tresponsibility of the child's father. No one should be charged\\n\\t\\t\\twith more than they can afford. Neither a mother should be made\\n\\t\\t\\tto suffer on account of her child nor a father on account of his\\n\\t\\t\\tchild. The father's heirs are under the same obligation. But if\\n\\t\\t\\twith mutual agreement they both decide to wean the child there is\\n\\t\\t\\tno blame on them. If you decide to have a foster-mother for your\\n\\t\\t\\toffspring there is no blame on you provided you pay what you have\\n\\t\\t\\tpromised to pay in an honorable manner. Fear Allah and beware\\n\\t\\t\\tthat Allah observes your actions."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "234",
    "Text": "As for those of you who die and leave widows behind, let them\\n\\t\\t\\tabstain from marriage for four months and ten days: when they\\n\\t\\t\\thave reached the end of this period, there is no blame on you for\\n\\t\\t\\twhat they do for themselves in a decent manner. Allah is aware of\\n\\t\\t\\twhat you do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "235",
    "Text": "There is no blame on you if you make a proposal of marriage\\n\\t\\t\\tduring their waiting period openly or keep it in your hearts.\\n\\t\\t\\tAllah knows that you will naturally cherish them in your hearts;\\n\\t\\t\\thowever, be careful not to make any secret agreement, and if you\\n\\t\\t\\twish to marry, speak to them in an honorable manner. Do not\\n\\t\\t\\tconfirm the marriage tie until the prescribed waiting period\\n\\t\\t\\texpires. You should know that Allah is aware of what is in your\\n\\t\\t\\thearts, so fear Him. Bear in mind that Allah is Forgiving,\\n\\t\\t\\tForbearing."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "236",
    "Text": "There is no blame on you if you divorce women before the marriage\\n\\t\\t\\tis consummated or the dowry is settled. Pay them something\\n\\t\\t\\tanyhow, the rich man according to his means and poor according to\\n\\t\\t\\this, a reasonable amount in all fairness. This is an obligation\\n\\t\\t\\ton the righteous people."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "237",
    "Text": "And if you divorce them before the marriage is consummated but\\n\\t\\t\\tafter the fixation of a dowry, give them half of their dowry\\n\\t\\t\\tunless the woman wants to waive it or the man in whose hand is\\n\\t\\t\\tthe marriage tie is generous enough (to pay the dowry in full).\\n\\t\\t\\tIt is more appropriate that the man should act generously. Do not\\n\\t\\t\\tforget to show kindness to each other. Surely Allah observes your\\n\\t\\t\\tactions."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "238",
    "Text": "Guard your Salah (obligatory regular prayers) especially the\\n\\t\\t\\tmiddle Salah and stand up with true devotion to Allah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "239",
    "Text": "If you are in danger, pray on foot or while riding; and when you\\n\\t\\t\\tare safe, remember Allah in the manner that He has taught you\\n\\t\\t\\twhich you did not know before."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "240",
    "Text": "Those of you who die and leave widows should bequeath for them a\\n\\t\\t\\tyear's maintenance without causing them to leave their homes; but\\n\\t\\t\\tif they leave the residence on their own there is no blame on you\\n\\t\\t\\tfor what they chose for themselves in a fair way. Allah is\\n\\t\\t\\tMighty, Wise."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "241",
    "Text": "Reasonable provisions must also be made for divorced women. That\\n\\t\\t\\tis an obligation upon those who fear Allah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "242",
    "Text": "That's how Allah makes His Revelations clear to you so that you\\n\\t\\t\\tmay understand."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "243",
    "Text": "Have you reflected on the case of thousands of people\\n\\t\\t\\t(Israelites) who fled their homes for fear of death? Allah said\\n\\t\\t\\tto them: \"Die\" (gave them death). Then He gave them life again.\\n\\t\\t\\tSurely Allah is bountiful to mankind, but most of the people are\\n\\t\\t\\tungrateful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "244",
    "Text": "O believers, fight in the path of Allah without fear of death and\\n\\t\\t\\tbear in mind that Allah hears and knows everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "245",
    "Text": "Who will loan to Allah a beautiful loan which Allah will increase\\n\\t\\t\\tmany fold? Allah alone can decrease and increase wealth, and to\\n\\t\\t\\tHim you all shall return."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "246",
    "Text": "Have you not reflected on what the leaders of the children of\\n\\t\\t\\tIsrael demanded from one of their Prophets after the death of\\n\\t\\t\\tMusa (Moses)? \"Appoint for us a king,\" they said, \"and we will\\n\\t\\t\\tfight in the cause of Allah.\" The Prophet replied: \"What if you\\n\\t\\t\\trefuse to fight when you are ordered to do so?\" They replied,\\n\\t\\t\\t\"How could we refuse to fight in the cause of Allah, while we\\n\\t\\t\\talong with our children were driven out of our homes?\" But when,\\n\\t\\t\\ton their demand, they were ordered to fight, all refused except a\\n\\t\\t\\tfew of them. Allah knows the evildoers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "247",
    "Text": "Their Prophet told them: \"Allah has appointed Talut to be your\\n\\t\\t\\tking.\" They replied: \"How can he be our king when some of us are\\n\\t\\t\\tmore deserving than him? Besides he is not rich.\" The Prophet\\n\\t\\t\\tsaid: \"Allah has chosen him to rule over you and blessed him with\\n\\t\\t\\tknowledge and stature. Allah grants kingship to whom He pleases\\n\\t\\t\\tand Allah has boundless knowledge.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "248",
    "Text": "Furthermore, their Prophet told them: \"The sign of his\\n\\t\\t\\tappointment as a king is that there will come to you the chest in\\n\\t\\t\\twhich there is tranquillity from your Rabb and the residue of\\n\\t\\t\\trelics which the family of Musa (Moses) and the family of Haroon\\n\\t\\t\\t(Aaron) left behind, and that chest will be carried by the\\n\\t\\t\\tangels. Surely therein is a sign for you if you are true\\n\\t\\t\\tbelievers.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "249",
    "Text": "When Talut marched forth with his army, he announced: \"Allah will\\n\\t\\t\\ttest you at a certain river; anyone who will drink from its water\\n\\t\\t\\tshall cease to be my soldier, and those who will not drink to\\n\\t\\t\\tquench their thirst with its water except a sip or so from the\\n\\t\\t\\thollow of their hands shall fight on my side.\" They all drank\\n\\t\\t\\tfrom it, inspite of this warning, except a few of them. When he\\n\\t\\t\\tand those who believed with him crossed the river, they said: \"We\\n\\t\\t\\thave no power left this day against Jalut (Goliath) and his\\n\\t\\t\\twarriors.\" But the believers, who knew they would meet Allah,\\n\\t\\t\\treplied: \"It has often happened that a small group, by the grace\\n\\t\\t\\tof Allah, has vanquished a mighty army. Allah is with those who\\n\\t\\t\\tendure with patience.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "250",
    "Text": "When they advanced to face Jalut (Goliath) and his warriors, they\\n\\t\\t\\tprayed: \"Our Rabb! Fill our hearts with steadfastness, make our\\n\\t\\t\\tsteps firm, and help us (give us victory) against the\\n\\t\\t\\tunbelievers.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "251",
    "Text": "By Allah's will they put the unbelievers to flight, and Dawood\\n\\t\\t\\t(David) killed Jalut. Allah gave Dawood the kingdom and wisdom\\n\\t\\t\\tand taught him what else He pleased. If Allah had not been\\n\\t\\t\\trepelling one set of people by the might of others, there would\\n\\t\\t\\tindeed be disorder on earth, but Allah is Gracious to all the\\n\\t\\t\\tworlds."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "252",
    "Text": "These are the revelations of Allah; We recite them to you in\\n\\t\\t\\ttruth. Surely you, O Muhammad, are one of Our Rasools."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "253",
    "Text": "JUZ : 3    These are the Rasools (which We have sent for the\\n\\t\\t\\tguidance of mankind). We have exalted some above others. To some\\n\\t\\t\\tAllah spoke directly; others He raised high in ranks; to Isa\\n\\t\\t\\t(Jesus) the son of Maryem (Mary) We gave clear Signs and\\n\\t\\t\\tsupported him with the Holy Spirit. If Allah wished the people\\n\\t\\t\\twho received the clear signs would not have fought against each\\n\\t\\t\\tother; but they disputed as a result, there were some who\\n\\t\\t\\tbelieved while others rejected. Yet If Allah wanted, they would\\n\\t\\t\\tnot have fought each other; but Allah does what He intends."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "254",
    "Text": "O believers! Spend out of the sustenance which We have provided\\n\\t\\t\\tfor you before the arrival of that Day when there will be no\\n\\t\\t\\tbargaining, friendship or intercession. It is the unbelievers who\\n\\t\\t\\tare wrongdoers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "255",
    "Text": "Allah! There is no god but Him: the Living, the Eternal. He\\n\\t\\t\\tneither slumbers nor sleeps. To Him belongs all that is in the\\n\\t\\t\\tHeavens and the Earth. Who can intercede with Him without His\\n\\t\\t\\tpermission? He knows what is before them and what is behind them.\\n\\t\\t\\tThey cannot gain access to any thing out of His knowledge except\\n\\t\\t\\twhat He pleases. His throne is more vast than the heavens and the\\n\\t\\t\\tearth, and guarding of these both does not fatigue Him. He is the\\n\\t\\t\\tExalted, the Supreme."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "256",
    "Text": "There is no compulsion in religion. True guidance has been made\\n\\t\\t\\tclearly distinct from error. Therefore, whoever renounce 'Taghut'\\n\\t\\t\\t(forces of Shaitan) and believes in Allah has grasped the firm\\n\\t\\t\\thand-hold that will never break. Allah, Whose hand-hold you have\\n\\t\\t\\tgrasped, hears all and knows all."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "257",
    "Text": "Allah is the Wali (Protector) of those who believe, He brings\\n\\t\\t\\tthem out of the depth of darkness and lead them into the light.\\n\\t\\t\\tAs for the unbelievers, whose wali (protector) is Taghut (forces\\n\\t\\t\\tof Shaitan), he takes them out of the light and leads them into\\n\\t\\t\\tthe depths of darkness. As a result they will become the\\n\\t\\t\\tcompanions of the Hell fire and shall live therein forever."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "258",
    "Text": "Have you ever reflected upon the one (Namrud), to whom Allah had\\n\\t\\t\\tgiven him kingdom, who argued with Ibrahim (Abraham) about his\\n\\t\\t\\tRabb. When Ibrahim said: \"My Rabb is He Who has power to give\\n\\t\\t\\tlife and to cause death.\" He replied: \"I too have the power to\\n\\t\\t\\tgive life and to cause death.\" Ibrahim said: \"Well, Allah causes\\n\\t\\t\\tthe sun to rise from the east; just make it rise from the west.\"\\n\\t\\t\\tThus the unbeliever was confounded; Allah does not guide the\\n\\t\\t\\tevildoers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "259",
    "Text": "Or take another example of the one (Prophet Ezra) who passed by a\\n\\t\\t\\ttown which has fallen down upon its roofs. He exclaimed: \"How can\\n\\t\\t\\tAllah bring this dead township back to life?\" Thereupon Allah\\n\\t\\t\\tcaused him to die, and after one hundred years brought him back\\n\\t\\t\\tto life. Allah asked: \"How long did you remained here?\" Ezra\\n\\t\\t\\treplied: \"Perhaps a day or part of a day.\" Allah said: \"Nay! You\\n\\t\\t\\thave remain here for one hundred years: now just have a look at\\n\\t\\t\\tyour food and drink; they have not rotten; and then look at your\\n\\t\\t\\tdonkey and see that his very bones have decayed. We have done\\n\\t\\t\\tthis to make you a Sign for mankind. Look at the bones of your\\n\\t\\t\\tdonkey how We bring them together then clothe them with flesh and\\n\\t\\t\\tbring him back to life! When this all was shown clearly to him he\\n\\t\\t\\tsaid: \"Now I know that Allah has power over everything.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "260",
    "Text": "Yet another example is when Ibrahim said: \"My Rabb! Show me how\\n\\t\\t\\tyou give life to the dead.\" He replied: \"Have you no faith in\\n\\t\\t\\tthis?\" Ibrahim humbly submitted: \"Yes! But I ask this to reassure\\n\\t\\t\\tmy heart.\" Allah said: \"Take four birds; train them to follow\\n\\t\\t\\tyour direction, cut their bodies into pieces and scatter those\\n\\t\\t\\tpieces on hilltops then call them back; Allah will bring them\\n\\t\\t\\tback to life and they will come to you right away. Thus you will\\n\\t\\t\\tknow that Allah is All-powerful and Wise.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "261",
    "Text": "The parable of those who spend their wealth in the way of Allah\\n\\t\\t\\tis that of a grain that sprouts into seven ears, each bearing one\\n\\t\\t\\thundred grains. Allah gives manifold increase to whom He wishes.\\n\\t\\t\\tAllah has boundless knowledge."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "262",
    "Text": "Those who spend their wealth in the cause of Allah and do not\\n\\t\\t\\tfollow their charity with reminders of their generosity or injure\\n\\t\\t\\tthe feeling of the recipient, shall get their reward from their\\n\\t\\t\\tRabb; they shall have nothing to fear or to regret."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "263",
    "Text": "Kind words and forgiveness are better than charity followed by\\n\\t\\t\\tinjury. Allah is Self-sufficient, Forbearing."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "264",
    "Text": "O believers! Do not make your charity worthless by reminders of\\n\\t\\t\\tyour generosity or by injury to the recipients feelings, like\\n\\t\\t\\tthose who spend their wealth to be seen by people and believe\\n\\t\\t\\tneither in Allah nor in the Last Day. Their parable is like a\\n\\t\\t\\thard barren rock covered with thin layer of soil; a heavy rain\\n\\t\\t\\tfalls, leaving it just a bare stone. Such people will not gain\\n\\t\\t\\tany reward that they thought they had earned. Allah does not\\n\\t\\t\\tguide the unbelievers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "265",
    "Text": "The example of those who spend their wealth to seek the pleasure\\n\\t\\t\\tof Allah and to strengthen their souls is like a garden on a high\\n\\t\\t\\tand fertile ground: when heavy rain falls on it, it yields up\\n\\t\\t\\ttwice its normal produce; and if no rain falls, a light moisture\\n\\t\\t\\tis sufficient. Whatever you do is in the sight of Allah."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "266",
    "Text": "Would anyone of you like that his garden, which is full of palm\\n\\t\\t\\ttrees, grape vines, and all kinds of fruits and watered by\\n\\t\\t\\trunning streams, be blasted and consumed by a fiery whirlwind at\\n\\t\\t\\tthe time when he has become too old and his children are too\\n\\t\\t\\tfeeble to earn anything? Thus Allah makes His revelations clear\\n\\t\\t\\tto you so that you may think over them."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "267",
    "Text": "O believers, spend in Allah's Way the best portion of the wealth\\n\\t\\t\\tyou have lawfully earned and that which We have produced for you\\n\\t\\t\\tfrom the earth, and do not pick out for charity those worthless\\n\\t\\t\\tthings that you yourselves would not accept but with closed eyes.\\n\\t\\t\\tBear in mind that Allah is Self-Sufficient, Praiseworthy."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "268",
    "Text": "Shaitan threatens you with poverty and prompts you to commit what\\n\\t\\t\\tis indecent, while Allah promises you His forgiveness and\\n\\t\\t\\tbounties, and Allah has boundless knowledge."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "269",
    "Text": "He grants wisdom to whom He pleases; and whoever is granted\\n\\t\\t\\twisdom is indeed given a great wealth, yet none except people of\\n\\t\\t\\tunderstanding learn a lesson from it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "270",
    "Text": "Whatever you spend in charity or whatever vow you make, surely\\n\\t\\t\\tAllah knows it. The wrongdoers shall have no helpers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "271",
    "Text": "To give charity in public is good, but to gives the poor in\\n\\t\\t\\tprivate is better and will remove from you some of your sins.\\n\\t\\t\\tAllah is aware of your actions."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "272",
    "Text": "O Prophet, you are not responsible for their guidance, it is\\n\\t\\t\\tAllah Who guides whom He pleases. Whatever wealth you spend in\\n\\t\\t\\tcharity, it is to your own advantage; provided you give to seek\\n\\t\\t\\tthe pleasure of Allah. Whatever wealth you spend for the sake of\\n\\t\\t\\tAllah, will be paid back to you in full, and you will not be\\n\\t\\t\\twronged."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "273",
    "Text": "Charity is for those needy people who are engaged so much in the\\n\\t\\t\\tcause of Allah that they cannot move about in the land to earn\\n\\t\\t\\ttheir livelihood: the ignorant think that they are wealthy on\\n\\t\\t\\taccount of their modest behavior. You can recognize them by their\\n\\t\\t\\tlook because they do not make insistent demands on people.\\n\\t\\t\\tWhatever you spend on them, surely Allah knows it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "274",
    "Text": "Those who spend their wealth in charity by night and day,\\n\\t\\t\\tsecretly and openly, they will have their reward from their Rabb.\\n\\t\\t\\tThey shall have nothing to fear or to regret."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "275",
    "Text": "Those who live on usury will not rise up before Allah except like\\n\\t\\t\\tthose who are driven to madness by the touch of Shaitan. That is\\n\\t\\t\\tbecause they claim: \"Trading is no different than usury, but\\n\\t\\t\\tAllah has made trading lawful and usury unlawful. He who has\\n\\t\\t\\treceived the admonition from his Rabb and has mended his way may\\n\\t\\t\\tkeep his previous gains; Allah will be his judge. Those who turn\\n\\t\\t\\tback (repeat this crime), they shall be the inmates of hellfire\\n\\t\\t\\twherein they will live for ever."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "276",
    "Text": "Allah has laid His curse on usury and blessed charity to prosper.\\n\\t\\t\\tAllah does not love any ungrateful sinner."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "277",
    "Text": "Those who believe and do good deeds, establish regular prayers,\\n\\t\\t\\tand give regular charity will have their reward with their Rabb.\\n\\t\\t\\tThey will have nothing to fear or to regret."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "278",
    "Text": "O You who believe! Fear Allah and waive what is still due to you\\n\\t\\t\\tfrom usury if you are indeed believers;"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "279",
    "Text": "or war shall be declared against you by Allah and His Rasool. If\\n\\t\\t\\tyou repent, you may retain your principal, causing no loss to\\n\\t\\t\\tdebtor and suffering no loss."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "280",
    "Text": "If the debtor is in a difficulty, grant him time till it is easy\\n\\t\\t\\tfor him to repay; but if you waive the sum by way of charity it\\n\\t\\t\\twill be better for you, if you understand it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "281",
    "Text": "Fear the Day when you shall all return to Allah; when every one\\n\\t\\t\\tshall be paid in full what they have earned and none shall be\\n\\t\\t\\tdealt with unjustly."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "Text": "O believers! When you deal with each other in lending for a fixed\\n\\t\\t\\tperiod of time, put it in writing. Let a scribe write it down\\n\\t\\t\\twith justice between the parties. The scribe, who is given the\\n\\t\\t\\tgift of literacy by Allah, should not refuse to write; he is\\n\\t\\t\\tunder obligation to write. Let him who incurs the liability\\n\\t\\t\\t(debtor) dictate, fearing Allah his Rabb and not diminishing\\n\\t\\t\\tanything from the settlement. If the borrower is mentally unsound\\n\\t\\t\\tor weak or is unable to dictate himself, let the guardian of his\\n\\t\\t\\tinterests dictate for him with justice. Let two witnesses from\\n\\t\\t\\tamong you bear witness to all such documents, if two men cannot\\n\\t\\t\\tbe found, then one man and two women of your choice should bear\\n\\t\\t\\twitness, so that if one of the women forgets anything the other\\n\\t\\t\\tmay remind her. The witnesses must not refuse when they are\\n\\t\\t\\tcalled upon to do so. You must not be averse to writing (your\\n\\t\\t\\tcontract) for a future period, whether it is a small matter or\\n\\t\\t\\tbig. This action is more just for you in the sight of Allah,\\n\\t\\t\\tbecause it facilitates the establishment of evidence and is the\\n\\t\\t\\tbest way to remove all doubts; but if it is a common commercial\\n\\t\\t\\ttransaction concluded on the spot among yourselves, there is no\\n\\t\\t\\tblame on you if you do not put it in writing. You should have\\n\\t\\t\\twitnesses when you make commercial transactions. Let no harm be\\n\\t\\t\\tdone to the scribe or witnesses; and if you do so, you shall be\\n\\t\\t\\tguilty of transgression. Fear Allah; it is Allah that teaches you\\n\\t\\t\\tand Allah has knowledge of everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "283",
    "Text": "If you are on a journey and cannot find a scribe to write down\\n\\t\\t\\tthe transaction, then transect your business by taking possession\\n\\t\\t\\tof a pledge. If one of you entrust another with a pledge, let the\\n\\t\\t\\ttrustee deliver the pledged property to its owner, and let him\\n\\t\\t\\tfear Allah, his Rabb. Do not conceal testimony, and whoever\\n\\t\\t\\tconceals it, his heart is surely sinful. Allah is aware of all\\n\\t\\t\\tyour actions."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "284",
    "Text": "To Allah belongs all that is in the heavens and in the earth.\\n\\t\\t\\tWhether you reveal what is in your minds or conceal it, Allah\\n\\t\\t\\twill call you to account for it. He, however, has full authority\\n\\t\\t\\tto pardon or punish anyone He pleases. Allah has complete power\\n\\t\\t\\tover everything."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "285",
    "Text": "The Rasool has believed in the Guidance which has been revealed\\n\\t\\t\\tto him from his Rabb and so do the Believers. They all believe in\\n\\t\\t\\tAllah, His angels, His books and His Rasools. They say we do not\\n\\t\\t\\tdiscriminate against anyone of His Rasools. And they say: \"We\\n\\t\\t\\thear and we obey. Grant us Your forgiveness, O Rabb; to You we\\n\\t\\t\\tshall all return.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "286",
    "Text": "Allah does not burden any human being with more than he can bear.\\n\\t\\t\\tEveryone will enjoy the credit of his deeds and suffer the debits\\n\\t\\t\\tof his evil-doings.\\tThe believers say: \"Our Rabb! Do not\\n\\t\\t\\tpunish us if we forget or make a mistake. Our Rabb! Do not place\\n\\t\\t\\ton us a burden as You placed on those before us. Our Rabb! Lay\\n\\t\\t\\tnot on us the kind of burden that we have no strength to bear.\\n\\t\\t\\tPardon us, Forgive us, Have mercy on us. You are our Protector,\\n\\t\\t\\thelp us against the unbelievers.\""
  }
]
