[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/041001",
        "Body":  "Ha. Mim."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/041010",
        "Body":  "He placed therein firm hills rising above it, and blessed it and\n\t\t\tmeasured therein its sustenance in four Days, alike for (all) who\n\t\t\task;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/041011",
        "Body":  "Then turned He to the heaven when it was smoke, and said unto it\n\t\t\tand unto the earth: Come both of you, willingly or loth. They\n\t\t\tsaid: We come, obedient."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/041012",
        "Body":  "Then He ordained them seven heavens in two Days and inspired in\n\t\t\teach heaven its mandate; and we decked the nether heaven with\n\t\t\tlamps, and rendered it inviolable. That is the measuring of the\n\t\t\tMighty, the Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/041013",
        "Body":  "But if they turn away, then say: I warn you of a thunderbolt like\n\t\t\tthe thunderbolt (which fell of old upon the tribes) of Aad and\n\t\t\tThamud;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/041014",
        "Body":  "When their messengers came unto them from before them and behind\n\t\t\tthem, saying: Worship none but Allah! they said: If our Lord had\n\t\t\twilled, He surely would have sent down angels (unto us), so lo!\n\t\t\twe are disbelievers in that wherewith ye have been sent."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/041015",
        "Body":  "As for Aad, they were arrogant in the land without right, and\n\t\t\tthey said: Who is mightier than us in power? Could they not see\n\t\t\tthat Allah Who created them, He was mightier than them in power?\n\t\t\tAnd they denied Our revelations."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/041016",
        "Body":  "Therefor We let loose on them a raging wind in evil days, that We\n\t\t\tmight make them taste the torment of disgrace in the life of the\n\t\t\tworld. And verily the doom of the Hereafter will be more\n\t\t\tshameful, and they will not be helped."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/041017",
        "Body":  "And as for Thamud, We gave them guidance, but they preferred\n\t\t\tblindness to the guidance, so the bolt of the doom of humiliation\n\t\t\tovertook them because of what they used to earn."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/041018",
        "Body":  "And We delivered those who believed and used to keep their duty\n\t\t\tto Allah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/041019",
        "Body":  "And (make mention of) the day when the enemies of Allah are\n\t\t\tgathered unto the Fire, they are driven on"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/041002",
        "Body":  "A revelation from the Beneficent, the Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/041020",
        "Body":  "Till, when they reach it, their ears and their eyes and their\n\t\t\tskins testify against them as to what they used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/041021",
        "Body":  "And they say unto their skins: Why testify ye against us? They\n\t\t\tsay: Allah hath given us speech Who giveth speech to all things,\n\t\t\tand Who created you at the first, and unto Whom ye are returned."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/041022",
        "Body":  "Ye did not hide yourselves lest your ears and your eyes and your\n\t\t\tskins should testify against you, but ye deemed that Allah knew\n\t\t\tnot much of what ye did."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/041023",
        "Body":  "That, your thought which ye did think about your Lord, hath\n\t\t\truined you; and ye find yourselves (this day) among the lost."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/041024",
        "Body":  "And though they are resigned, yet the Fire is still their home;\n\t\t\tand if they ask for favor, yet they are not of those unto whom\n\t\t\tfavor can be shown."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/041025",
        "Body":  "And We assigned them comrades (in the world), who made their\n\t\t\tpresent and their past fair seeming unto them. And the Word\n\t\t\tconcerning nations of the jinn and humankind who passed away\n\t\t\tbefore them hath effect for them. Verily they are the losers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/041026",
        "Body":  "Those who disbelieve say: Heed not this Qur\u0027an, and drown the\n\t\t\thearing of it; haply ye may conquer."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/041027",
        "Body":  "But verily We shall cause those who disbelieve to taste an awful\n\t\t\tdoom, and verily We shall requite them the worst of what they\n\t\t\tused to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/041028",
        "Body":  "That is the reward of Allah\u0027s enemies: the Fire. Therein is their\n\t\t\timmortal home; payment forasmuch as they denied Our revelations."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/041029",
        "Body":  "And those who disbelieve will say: Our Lord! Show us these who\n\t\t\tbeguiled us of the jinn and humankind. We will place them\n\t\t\tunderneath our feet that they may be among the nethermost."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/041003",
        "Body":  "A scripture whereof the verses are expounded, a Lecture in Arabic\n\t\t\tfor people who have knowledge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/041030",
        "Body":  "Lo! those who say: Our Lord is Allah, and afterward are upright,\n\t\t\tthe angels descend upon them, saying: Fear not nor grieve, but\n\t\t\tbear good tidings of the paradise which ye are promised."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/041031",
        "Body":  "We are your protecting friends in the life of the world and in\n\t\t\tthe Hereafter. There ye will have (all) that your souls desire,\n\t\t\tand there ye will have (all) for which ye pray."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/041032",
        "Body":  "A gift of welcome from the Forgiving, the Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/041033",
        "Body":  "And who is better in speech than him who prayeth unto his Lord\n\t\t\tand doeth right, and saith: Lo! I am of those who surrender (unto\n\t\t\tHim)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/041034",
        "Body":  "The good deed and the evil deed are not alike. Repel the evil\n\t\t\tdeed with one which is better, then lo! he, between whom and thee\n\t\t\tthere was enmity (will become) as though he was a bosom friend."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/041035",
        "Body":  "But none is granted it save those who are steadfast, and none is\n\t\t\tgranted it save the owner of great happiness."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/041036",
        "Body":  "And if a whisper from the devil reach thee (O Muhammad) then seek\n\t\t\trefuge in Allah. Lo! He is the Hearer, the Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/041037",
        "Body":  "And of His portents are the night and the day and the sun and the\n\t\t\tmoon. Adore not the sun nor the moon; but adore Allah Who created\n\t\t\tthem, if it is in truth Him whom ye worship."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/041038",
        "Body":  "But if they are too proud still those who are with thy Lord\n\t\t\tglorify Him night and day, and tire not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/041039",
        "Body":  "And of His portents (is this): that thou seest the earth lowly,\n\t\t\tbut when We send down water thereon it thrilleth and groweth. Lo!\n\t\t\tHe who quickeneth it is verily the Quickener of the dead. Lo! He\n\t\t\tis Able to do all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/041004",
        "Body":  "Good tidings and a warning. But most of them turn away so that\n\t\t\tthey hear not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/041040",
        "Body":  "Lo! those who distort Our revelations are not hid from Us. Is he\n\t\t\twho is hurled into the Fire better, or he who cometh secure on\n\t\t\tthe Day of Resurrection? Do what ye will. Lo! He is Seer of what\n\t\t\tye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/041041",
        "Body":  "Lo! those who disbelieve in the Reminder when it cometh unto them\n\t\t\t(are guilty), for lo! it is an unassailable Scripture."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/041042",
        "Body":  "Falsehood cannot come at it from before it or behind it. (It is)\n\t\t\ta revelation from the Wise, the Owner of Praise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/041043",
        "Body":  "Naught is said unto thee (Muhammad) save what was said unto the\n\t\t\tmessengers before thee. Lo! thy Lord is owner of forgiveness, and\n\t\t\towner (also) of dire punishment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/041044",
        "Body":  "And if We had appointed it a Lecture in a foreign tongue they\n\t\t\twould assuredly have said: If only its verses were expounded (so\n\t\t\tthat we might understand)? What! A foreign tongue and an Arab?\n\t\t\tSay unto them (O Muhammad): For those who believe it is a\n\t\t\tguidance and a healing; and as for those who disbelieve, there is\n\t\t\ta deafness in their ears, and it is blindness for them. Such are\n\t\t\tcalled to from afar."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/041045",
        "Body":  "And We verily gave Moses the Scripture, but there hath been\n\t\t\tdispute concerning it; and but for a Word that had already gone\n\t\t\tforth from thy Lord, it would ere now have been judged between\n\t\t\tthem; but lo! they are in hopeless doubt concerning it."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/041046",
        "Body":  "Whoso doeth right it is for his soul, and whoso doeth wrong it is\n\t\t\tagainst it. And thy Lord is not at all a tyrant to His slaves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/041047",
        "Body":  "Unto Him is referred (all) knowledge of the Hour. And no fruits\n\t\t\tburst forth from their sheaths, and no female carrieth or\n\t\t\tbringeth forth but with His knowledge. And on the day when He\n\t\t\tcalleth unto them: Where are now My partners? they will say: We\n\t\t\tconfess unto Thee, not one of us is a witness (for them)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/041048",
        "Body":  "And those to whom they used to cry of old have failed them, and\n\t\t\tthey perceive they have no place of refuge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/041049",
        "Body":  "Man tireth not of praying for good, and if all toucheth him, then\n\t\t\the is disheartened, desperate."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/041005",
        "Body":  "And they say: Our hearts are protected from that unto which thou\n\t\t\t(O Muhammad) callest us, and in our ears there is a deafness, and\n\t\t\tbetween us and thee there is a veil. Act, then. Lo! we also shall\n\t\t\tbe acting."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/041050",
        "Body":  "And verily, if We cause him to taste mercy after some hurt that\n\t\t\thath touched him, he will say: This is my own; and I deem not\n\t\t\tthat the Hour will ever rise, and if I am brought back to my\n\t\t\tLord, I surely shall be better off with Him--But We verily shall\n\t\t\ttell those who disbelieve (all) that they did, and We verily\n\t\t\tshall make them taste hard punishment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/041051",
        "Body":  "When We show favor unto man, he withdraweth and turneth aside,\n\t\t\tbut when ill toucheth him then he aboundeth in prayer."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/041052",
        "Body":  "Bethink you: If it is from Allah and ye reject it--Who is further\n\t\t\tastray than one who is at open feud (with Allah)?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/041053",
        "Body":  "We shall show them Our portents on the horizons and within\n\t\t\tthemselves until it will be manifest unto them that it is the\n\t\t\tTruth. Doth not thy Lord suffice, since He is Witness over all\n\t\t\tthings?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/041054",
        "Body":  "How! Are they still in doubt about the meeting with their Lord?\n\t\t\tLo! Is not He surrounding all things?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/041006",
        "Body":  "Say (unto them O Muhammad): I am only a mortal like you. It is\n\t\t\tinspired in me that your God is One God, therefor take the\n\t\t\tstraight path unto Him and seek forgiveness of Him. And woe unto\n\t\t\tthe idolaters,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/041007",
        "Body":  "Who give not the poor due, and who are disbelievers in the\n\t\t\tHereafter."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/041008",
        "Body":  "Lo! as for those who believe and do good works, for them is a\n\t\t\treward enduring."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "41",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/041009",
        "Body":  "Say (O Muhammad, unto the idolaters): Disbelieve ye verily in Him\n\t\t\tWho created the earth in two Days, and ascribe ye unto Him\n\t\t\trivals? He (and none else) is the Lord of the Worlds."
    }
]
