[
  {
    "BookCode": "AMH",
    "VolumeNumber": "53",
    "hadithNumber": "1",
    "sectionHeading": "Behaviour in the Greeting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"The one riding greets the one walking, and\\n\\t\\t\\t\\twhen one of a group of people gives a greeting, it is\\n\\t\\t\\t\\tenough for all of them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "53",
    "hadithNumber": "2",
    "sectionHeading": "Behaviour in the Greeting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Wahb ibn Kaysan that\\n\\t\\t\\t\\tMuhammad ibn Amr ibn Ata said, \"I was sitting with\\n\\t\\t\\t\\tAbdullah ibn Abbas when a Yemeni man came in. He said,\\n\\t\\t\\t\\t'Peace be upon you, and the mercy of Allah and His\\n\\t\\t\\t\\tblessing' (as-salamu alaykum wa rahmatullahi wa\\n\\t\\t\\t\\tbarakatuhu), and then he added something more to that.\\n\\t\\t\\t\\tIbn Abbas said (and at that time his eyesight had gone),\\n\\t\\t\\t\\t'Who is this?' People said, 'This is a Yemeni who has\\n\\t\\t\\t\\tcome to see you,' and they introduced him. Ibn Abbas\\n\\t\\t\\t\\tsaid, 'The greeting ends with the word blessing.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked, \"Does one greet a\\n\\t\\t\\t\\twoman?\" He said, \"As for an old woman, I do not\\n\\t\\t\\t\\tdisapprove of it. As for a young woman, I do not like\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "53",
    "hadithNumber": "3",
    "sectionHeading": "Greeting Jews and Christians",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tthat Abdullah ibn Umar said that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"When a\\n\\t\\t\\t\\tjew greets you, and says 'Death to you' (as-samu alaykum)\\n\\t\\t\\t\\tsay, 'And to you.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"Malik was asked whether a person who greeted\\n\\t\\t\\t\\ta jew or christian, should apologise for it. He said,\\n\\t\\t\\t\\t'No'.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "53",
    "hadithNumber": "4",
    "sectionHeading": "General Section on the Greeting.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha from Abu Murra, the mawla of Aqil ibn Abi\\n\\t\\t\\t\\tTalib from Abu Waqid al-Laythi that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\tsitting in the mosque with some people when three people\\n\\t\\t\\t\\tcame in. Two came toward the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, and one went away.\\n\\t\\t\\t\\tWhen the two stopped at the assembly of the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, they gave\\n\\t\\t\\t\\tthe greeting. One of them saw a gap in the circle and sat\\n\\t\\t\\t\\tin it. The other sat down behind the circle. The third\\n\\t\\t\\t\\tturned away and left. When the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, finished, he said,\\n\\t\\t\\t\\t\"Shall I tell you about three people? One of them sought\\n\\t\\t\\t\\tshelter with Allah, so Allah gave him shelter. The other\\n\\t\\t\\t\\twas shy, so Allah was shy to him. The other turned away,\\n\\t\\t\\t\\tso Allah turned away from him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "53",
    "hadithNumber": "5",
    "sectionHeading": "General Section on the Greeting.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha that Anas ibn Malik heard Umar ibn\\n\\t\\t\\t\\tal-Khattab return the greeting of a man who greeted him.\\n\\t\\t\\t\\tThen Umar asked the man, \"How are you?\" He said, \"I\\n\\t\\t\\t\\tpraise Allah to you.\" (Ahmadu ilayka Allah) Umar said,\\n\\t\\t\\t\\t\"That is what I wanted from you.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "53",
    "hadithNumber": "6",
    "sectionHeading": "General Section on the Greeting.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ishaq ibn Abdullah\\n\\t\\t\\t\\tibn Abi Talha that at-Tufayl ibn Ubayy ibn Kab told him\\n\\t\\t\\t\\tthat he visited Abdullah ibn Umar one morning and went\\n\\t\\t\\t\\tout with him to the market, and when they were out,\\n\\t\\t\\t\\tAbdullah ibn Umar did not pass by anyone selling poor\\n\\t\\t\\t\\tmerchandise or selling commodities or a needy person or\\n\\t\\t\\t\\tanyone but that he greeted them.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAt-Tufayl said, \"I came to Abdullah ibn Umar one day and\\n\\t\\t\\t\\the asked me to follow him to the market. I said to him,\\n\\t\\t\\t\\t'What will you do in the market if you will not stop to\\n\\t\\t\\t\\tsell nor seek any goods or barter with them or sit in any\\n\\t\\t\\t\\tof the assemblies or market?' Abdullah ibn Umar said that\\n\\t\\t\\t\\twe should sit down and talk, and then he explained, 'Abu\\n\\t\\t\\t\\tBatni, (lit. father of the belly, at-Tufayl had a\\n\\t\\t\\t\\tprominent stomach), we go out in the morning only for the\\n\\t\\t\\t\\tsake of the greeting. We greet whomever we meet.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "53",
    "hadithNumber": "7",
    "sectionHeading": "General Section on the Greeting.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that a\\n\\t\\t\\t\\tman greeted Abdullah ibn Umar. He said, \"Peace be upon\\n\\t\\t\\t\\tyou and the mercy of Allah and his barakat, on and on.\"\\n\\t\\t\\t\\tAbdullah ibn Umar said to him, \"And on you, a thousand\\n\\t\\t\\t\\ttimes,\" as if he disliked that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "53",
    "hadithNumber": "8",
    "sectionHeading": "General Section on the Greeting.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that when\\n\\t\\t\\t\\tone entered an unoccupied house, one should say, \"Peace\\n\\t\\t\\t\\tbe upon us and on the slaves of Allah, who are salih.\"\\n\\t\\t\\t\\t(As-salamu alayna wa ala ibadillahi's-saliheen).O\\n\\t\\t\\t</p>"
  }
]
