[
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "1",
    "Text": "They ask you &#761;O Prophet&#762; regarding the spoils of war. Say, &ldquo;Their distribution is decided by Allah and His Messenger. So be mindful of Allah, settle your affairs, and obey Allah and His Messenger if you are &#761;true&#762; believers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "2",
    "Text": "The &#761;true&#762; believers are only those whose hearts tremble at the remembrance of Allah, whose faith increases when His revelations are recited to them, and who put their trust in their Lord."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "3",
    "Text": "&#761;They are&#762; those who establish prayer and donate from what We have provided for them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "4",
    "Text": "It is they who are the true believers. They will have elevated ranks, forgiveness, and an honourable provision from their Lord."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "5",
    "Text": "Similarly, when your Lord brought you &#761;O Prophet&#762; out of your home for a just cause, a group of believers was totally against it."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "6",
    "Text": "They disputed with you about the truth after it had been made clear, as if they were being driven to death with their eyes wide open."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "7",
    "Text": "&#761;Remember, O &nbsp;believers,&#762; when Allah promised &#761;to give&#762; you the upper hand over either target, you wished to capture the unarmed party.<span class='fn' foot_note=29151>1</span>&nbsp;But it was Allah&rsquo;s Will&nbsp;to establish the truth by His Words and uproot the disbelievers;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "8",
    "Text": "to firmly establish the truth and wipe out falsehood&mdash;even to the dismay of the wicked."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "9",
    "Text": "&#761;Remember&#762; when you cried out to your Lord for help, He answered, &ldquo;I will reinforce you with a thousand angels&mdash;followed by many others.&rdquo;<span class='fn' foot_note=29152>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "10",
    "Text": "And Allah made this a sign of victory and reassurance to your hearts. Victory comes only from Allah. Surely Allah is Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "11",
    "Text": "&#761;Remember&#762; when He caused drowsiness to overcome you, giving you serenity.<span class='fn' foot_note=29153>1</span>&nbsp;And He sent down rain from the sky to purify you, free you from Satan&rsquo;s whispers, strengthen your hearts, and make &#761;your&#762; steps firm."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "12",
    "Text": "&#761;Remember, O &nbsp;Prophet,&#762; when your Lord revealed to the angels, &ldquo;I am with you. So make the believers stand firm. I will cast horror into the hearts of the disbelievers. So strike their necks and strike their fingertips.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "13",
    "Text": "This is because they defied Allah and His Messenger. And whoever defies Allah and His Messenger, then &#761;know that&#762; Allah is surely severe in punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "14",
    "Text": "That &#761;worldly punishment&#762; is yours, so taste it! Then the disbelievers will suffer the torment of the Fire."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "15",
    "Text": "O believers! When you face the disbelievers in battle, never turn your backs to them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "16",
    "Text": "And whoever does so on such an occasion&mdash;unless it is a manoeuvre or to join their own troops&mdash;will earn the displeasure of Allah, and their home will be Hell. What an evil destination!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "17",
    "Text": "It was not you &#761;believers&#762; who killed them, but it was Allah Who did so. Nor was it you &#761;O Prophet&#762; who threw &#761;a handful of sand at the disbelievers&#762;,<span class='fn' foot_note=29154>1</span>&nbsp;but it was Allah Who did so, rendering the believers a great favour. Surely Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "18",
    "Text": "As such, Allah frustrates the evil plans of the disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "19",
    "Text": "If you &#761;Meccans&#762; sought judgment, now it has come to you. And if you cease, it will be for your own good. But if you persist, We will persist. And your forces&mdash;no matter how numerous they might be&mdash;will not benefit you whatsoever. For Allah is certainly with the believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "20",
    "Text": "O believers! Obey Allah and His Messenger and do not turn away from him while you hear &#761;his call&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "21",
    "Text": "Do not be like those who say, &ldquo;We hear,&rdquo; but in fact they are not listening."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "22",
    "Text": "Indeed, the worst of all beings in the sight of Allah are the &#761;wilfully&#762; deaf and dumb, who do not understand.<span class='fn' foot_note=29155>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "23",
    "Text": "Had Allah known any goodness in them, He would have certainly made them hear. &#761;But&#762; even if He had made them hear, they would have surely turned away heedlessly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "24",
    "Text": "O believers! Respond to Allah and His Messenger when he calls you to that which gives you life. And know that Allah stands between a person and their heart, and that to Him you will all be gathered."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "25",
    "Text": "Beware of a trial that will not only affect the wrongdoers among you. And know that Allah is severe in punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "26",
    "Text": "Remember when you had been vastly outnumbered and oppressed in the land,<span class='fn' foot_note=29156>1</span>&nbsp;constantly in fear of attacks by your enemy, then He sheltered you, strengthened you with His help, and provided you with good things so perhaps you would be thankful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "27",
    "Text": "O believers! Do not betray Allah and the Messenger, nor betray your trusts knowingly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "28",
    "Text": "And know that your wealth and your children are only a test and that with Allah is a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "29",
    "Text": "O believers! If you are mindful of Allah, He will grant you a standard &#761;to distinguish between right and wrong&#762;, absolve you of your sins, and forgive you. And Allah is the Lord of infinite bounty."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "30",
    "Text": "And &#761;remember, O &nbsp;Prophet,&#762; when the disbelievers conspired to capture, kill, or exile you. They planned, but Allah also planned. And Allah is the best of planners."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "31",
    "Text": "Whenever Our revelations are recited to them, they challenge &#761;you&#762;, &ldquo;We have already heard &#761;the recitation&#762;. If we wanted, we could have easily produced something similar. This &#761;Quran&#762; is nothing but ancient fables!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "32",
    "Text": "And &#761;remember&#762; when they prayed, &ldquo;O Allah! If this is indeed the truth from You, then rain down stones upon us from the sky or overcome us with a painful punishment.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "33",
    "Text": "But Allah would never punish them while you &#761;O Prophet&#762; were in their midst. Nor would He ever punish them if they prayed for forgiveness."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "34",
    "Text": "And why should Allah not punish them while they hinder pilgrims from the Sacred Mosque, claiming to be its rightful guardians? None has the right to guardianship except those mindful &#761;of Allah&#762;, but most pagans do not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "35",
    "Text": "Their prayer at the Sacred House was nothing but whistling and clapping. So taste the punishment for your disbelief."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "36",
    "Text": "Surely the disbelievers spend their wealth to hinder others from the Path of Allah. They will continue to spend to the point of regret. Then they will be defeated and the disbelievers will be driven into Hell,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "37",
    "Text": "so Allah may separate the evil from the good. He will pile up the evil ones all together and then cast them into Hell. They are the &#761;true&#762; losers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "38",
    "Text": "Tell the disbelievers that if they desist, their past will be forgiven. But if they persist, then they have an example in those destroyed before them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "39",
    "Text": "Fight against them until there is no more persecution&mdash;and &#761;your&#762; devotion will be entirely to Allah. But if they desist, then surely Allah is All-Seeing of what they do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "40",
    "Text": "And if they do not comply, then know that Allah is your Protector. What an excellent Protector, and what an excellent Helper!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "41",
    "Text": "Know that whatever spoils you take, one-fifth is for Allah and the Messenger, his close relatives, orphans, the poor, and &#761;needy&#762; travellers, if you &#761;truly&#762; believe in Allah and what We revealed to Our servant on that decisive day when the two armies met &#761;at Badr&#762;. And Allah is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "42",
    "Text": "&#761;Remember&#762; when you were on the near side of the valley, your enemy on the far side, and the caravan was below you. Even if the two armies had made an appointment &#761;to meet&#762;, both would have certainly missed it.<span class='fn' foot_note=29157>1</span>&nbsp;Still it transpired so Allah may establish what He had destined&mdash;that those who were to perish and those who were to survive might do so after the truth had been made clear to both. Surely Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "43",
    "Text": "&#761;Remember, O &nbsp;Prophet,&#762; when Allah showed them in your dream as few in number. Had He shown them to you as many, you &#761;believers&#762; would have certainly faltered and disputed in the matter. But Allah spared you &#761;from that&#762;. Surely He knows best what is &#761;hidden&#762; in the heart."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "44",
    "Text": "Then when your armies met, Allah made them appear as few in your eyes, and made you appear as few in theirs, so Allah may establish what He had destined. And to Allah &#761;all&#762; matters will be returned &#761;for judgment&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "45",
    "Text": "O believers! When you face an enemy, stand firm and remember Allah often so you may triumph."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "46",
    "Text": "Obey Allah and His Messenger and do not dispute with one another, or you would be discouraged and weakened. Persevere! Surely Allah is with those who persevere."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "47",
    "Text": "Do not be like those &#761;pagans&#762; who left their homes arrogantly, only to be seen by people and to hinder others from Allah&rsquo;s Path. And Allah is Fully Aware of what they do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "48",
    "Text": "And &#761;remember&#762; when Satan made their &#761;evil&#762; deeds appealing to them, and said, &ldquo;No one can overcome you today. I am surely by your side.&rdquo; But when the two forces faced off, he cowered and said, &ldquo;I have absolutely nothing to do with you. I certainly see what you do not see. I truly fear Allah, for Allah is severe in punishment.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "49",
    "Text": "&#761;Remember&#762; when the hypocrites and those with sickness in their hearts said, &ldquo;These &#761;believers&#762; are deluded by their faith.&rdquo; But whoever puts their trust in Allah, surely Allah is Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "50",
    "Text": "If only you could see when the angels take the souls of the disbelievers, beating their faces and backs, &#761;saying,&#762; &ldquo;Taste the torment of burning!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "51",
    "Text": "This is &#761;the reward&#762; for what your hands have done. And Allah is never unjust to &#761;His&#762; servants.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "52",
    "Text": "Their fate is that of the people of Pharaoh and those before them&mdash;they all disbelieved in Allah&rsquo;s signs, so Allah seized them for their sins. Indeed, Allah is All-Powerful, severe in punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "53",
    "Text": "This is because Allah would never discontinue His favour to a people until they discontinue their faith. Surely Allah is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "54",
    "Text": "That was the case with Pharaoh&rsquo;s people and those before them&mdash;they all rejected the signs of their Lord, so We destroyed them for their sins and drowned Pharaoh&rsquo;s people. They were all wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "55",
    "Text": "Indeed, the worst of all beings in the sight of Allah are those who persist in disbelief, never to have faith&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "56",
    "Text": "&#761;namely&#762; those with whom you &#761;O Prophet&#762; have entered into treaties, but they violate them every time, not fearing the consequences."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "57",
    "Text": "If you ever encounter them in battle, make a fearsome example of them, so perhaps those who would follow them may be deterred."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "58",
    "Text": "And if you &#761;O Prophet&#762; see signs of betrayal by a people, respond by openly terminating your treaty with them. Surely Allah does not like those who betray."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "59",
    "Text": "Do not let those disbelievers<span class='fn' foot_note=29158>1</span>&nbsp;think they are not within reach. They will have no escape."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "60",
    "Text": "Prepare against them what you &#761;believers&#762; can of &#761;military&#762; power and cavalry to deter Allah&rsquo;s enemies and your enemies as well as other enemies unknown to you but known to Allah. Whatever you spend in the cause of Allah will be paid to you in full and you will not be wronged."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "61",
    "Text": "If the enemy is inclined towards peace, make peace with them. And put your trust in Allah. Indeed, He &#761;alone&#762; is the All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "62",
    "Text": "But if their intention is only to deceive you, then Allah is certainly sufficient for you. He is the One Who has supported you with His help and with the believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "63",
    "Text": "He brought their hearts together. Had you spent all the riches in the earth, you could not have united their hearts. But Allah has united them. Indeed, He is Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "64",
    "Text": "O &nbsp;Prophet! Allah is sufficient for you and for the believers who follow you."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "65",
    "Text": "O Prophet! Motivate the believers to fight. If there are twenty steadfast among you, they will overcome two hundred. And if there are one hundred of you, they will overcome one thousand of the disbelievers, for they are a people who do not comprehend."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "66",
    "Text": "Now Allah has lightened your burden, for He knows that there is weakness in you. So if there are a hundred steadfast among you, they will overcome two hundred. And if there be one thousand, they will overcome two thousand, by Allah&rsquo;s Will. And Allah is with the steadfast."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "67",
    "Text": "It is not fit for a prophet that he should take captives until he has thoroughly subdued the land. You &#761;believers&#762; settled with the fleeting gains of this world,<span class='fn' foot_note=29159>1</span>&nbsp;while Allah&rsquo;s aim &#761;for you&#762; is the Hereafter. Allah is Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "68",
    "Text": "Had it not been for a prior decree from Allah,<span class='fn' foot_note=29160>1</span>&nbsp;you would have certainly been disciplined with a tremendous punishment for whatever &#761;ransom&#762; you have taken."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "69",
    "Text": "Now enjoy what you have taken, for it is lawful and good. And be mindful of Allah. Surely Allah is All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "70",
    "Text": "O Prophet! Tell the captives in your custody, &ldquo;If Allah finds goodness in your hearts, He will give you better than what has been taken from you, and forgive you. For Allah is All-Forgiving, Most Merciful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "71",
    "Text": "But if their intention is only to betray you &#761;O Prophet&#762;, they sought to betray Allah before. But He gave you power over them. And Allah is All-Knowing, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "72",
    "Text": "Those who believed, emigrated, and strived with their wealth and lives in the cause of Allah, as well as those who gave them shelter and help&mdash;they are truly guardians of one another. As for those who believed but did not emigrate, you have no obligations to them until they emigrate. But if they seek your help &#761;against persecution&#762; in faith, it is your obligation to help them, except against people bound with you in a treaty. Allah is All-Seeing of what you do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "73",
    "Text": "As for the disbelievers, they are guardians of one another. And unless you &#761;believers&#762; act likewise, there will be great oppression and corruption in the land."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "74",
    "Text": "Those who believed, migrated, and struggled in the cause of Allah, and those who gave &#761;them&#762; shelter and help, they are the true believers. They will have forgiveness and an honourable provision."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "8",
    "AyahNumber": "75",
    "Text": "And those who later believed, migrated, and struggled alongside you, they are also with you. But only blood relatives are now entitled to inherit from one another,&nbsp;as ordained by Allah. Surely Allah has &#761;full&#762; knowledge of everything.<span class='fn' foot_note=29161>1</span>"
  }
]
