[
  {
    "SurahNumber": "71",
    "AyahNumber": "1",
    "NoteID": "5705",
    "Body": "Noah's mission is referred to in many places. See\\n\\t\\t\\t\\tspecially xi. 25-49 and notes. His contemporaries had\\n\\t\\t\\t\\tcompletely abandoned the moral law. A purge had to be\\n\\t\\t\\t\\tmade, and the great Flood made it. This gives a new\\n\\t\\t\\t\\tstarting point in history for Noah's People,-i.e., for\\n\\t\\t\\t\\tthe remnant saved in the Ark."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "2",
    "NoteID": "5706",
    "Body": "His Warning was to be both clear (i.e., unambiguous) and\\n\\t\\t\\t\\topen (i.e., publicly proclaimed). Both these meanings are\\n\\t\\t\\t\\timplied in Mubin. Cf. lxvii. 26. The meaning of the\\n\\t\\t\\t\\tWarning was obviously that if they had repented, they\\n\\t\\t\\t\\twould have obtained mercy."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "3",
    "NoteID": "5707",
    "Body": "Three aspects of man's duty are emphasized: (1) true\\n\\t\\t\\t\\tworship with heart and soul; (2) God-fearing recognition\\n\\t\\t\\t\\tthat all evil must lead to self-deterioration and\\n\\t\\t\\t\\tJudgment; (3) hence repentance and amendment of life, and\\n\\t\\t\\t\\tobedience to good men's counsels."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "4",
    "NoteID": "5708",
    "Body": "Allah gives respite freely; but it is for Him to give it.\\n\\t\\t\\t\\tHis command is definite and final; neither man nor any\\n\\t\\t\\t\\tother authority can alter or in any way modify it. If we\\n\\t\\t\\t\\tcould only realise this to the full in our inmost soul,\\n\\t\\t\\t\\tit would be best for us and lead to our happiness."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "6",
    "NoteID": "5709",
    "Body": "When convincing arguments and warnings are placed before\\n\\t\\t\\t\\tsinners, there are two kinds of reactions. Those who are\\n\\t\\t\\t\\twise receive admonition, repent, and bring forth fruits\\n\\t\\t\\t\\tof repentance, i.e., amend their lives and turn to Allah.\\n\\t\\t\\t\\tOn the other hand, those who are callous to any advice\\n\\t\\t\\t\\ttake it up as a reproach, fly farther and farther from\\n\\t\\t\\t\\trighteousness, and shut out more and more the channels\\n\\t\\t\\t\\tthrough which Allah's healing Grace can reach them and\\n\\t\\t\\t\\twork for them."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "7",
    "NoteID": "5710",
    "Body": "The literal meaning would be that, just as they thrust\\n\\t\\t\\t\\ttheir fingers into their ears to prevent the voice of the\\n\\t\\t\\t\\tadmonisher reaching them, so they covered their bodies\\n\\t\\t\\t\\twith their garments that the light of truth should not\\n\\t\\t\\t\\tpenetrate to them and that they should not even be seen\\n\\t\\t\\t\\tby the Prophet."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "9",
    "NoteID": "5711",
    "Body": "Noah used all the resources of the earnest preacher: he\\n\\t\\t\\t\\tdinned the Message of Allah into their ears; he spoke in\\n\\t\\t\\t\\tpublic places; and he took individuals into his\\n\\t\\t\\t\\tconfidence, and appealed privately to them; but all in\\n\\t\\t\\t\\tvain."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "11",
    "NoteID": "5712",
    "Body": "They had perhaps been suffering from drought or famine.\\n\\t\\t\\t\\tIf they had taken the message in the right way, the rain\\n\\t\\t\\t\\twould have been a blessing to them. They took it in the\\n\\t\\t\\t\\twrong way, and the rain was a curse to them, for it\\n\\t\\t\\t\\tflooded the country and drowned the wicked generation. In\\n\\t\\t\\t\\tthe larger Plan, it was a blessing all the same; for it\\n\\t\\t\\t\\tpurged the world, and gave it a new start, morally and\\n\\t\\t\\t\\tspiritually."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "12",
    "NoteID": "5713",
    "Body": "Each of these blessings-rain and crops, wealth and\\n\\t\\t\\t\\tman-power, flourishing gardens, and perennial streams-are\\n\\t\\t\\t\\tindications of prosperity, and have not only a material\\n\\t\\t\\t\\tbut also a spiritual meaning. Note the last point,\\n\\t\\t\\t\\t\"rivers of flowing water\". The perennial springs make the\\n\\t\\t\\t\\tprosperity as it were permanent: they indicate a settled\\n\\t\\t\\t\\tpopulation, honest and contented, and enjoying their\\n\\t\\t\\t\\tblessings here on earth as the foretaste of the eternal\\n\\t\\t\\t\\tjoys of heaven. A) I.e., why don't you fear Allah's\\n\\t\\t\\t\\tMajesty, His greatness and consequent punishment for your\\n\\t\\t\\t\\tsinfulness, and hope for His mercy, kindness and reward\\n\\t\\t\\t\\tfor your faith and good deeds. The words of the verse\\n\\t\\t\\t\\tcontain the twin strands-fear and hope-simultaneously."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "14",
    "NoteID": "5714",
    "Body": "Cf. xxii. 5, and notes 2773-2777; also xxiii. 12-17, and\\n\\t\\t\\t\\tnotes 2872-2875. The meaning here may be even wider. Man\\n\\t\\t\\t\\tin his various states exhibits various wonderful\\n\\t\\t\\t\\tqualities or capacities, mental and spiritual, that may\\n\\t\\t\\t\\tbe compared with the wonderful workings of nature on the\\n\\t\\t\\t\\tearth and in the heavens. Will he not then be grateful\\n\\t\\t\\t\\tfor these Mercies and turn to Allah, Who created all\\n\\t\\t\\t\\tthese marvels?"
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "15",
    "NoteID": "5715",
    "Body": "See n. 5559 to lxvii. 3."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "16",
    "NoteID": "5716",
    "Body": "Cf. xxv. 61, where the sun is referred to as the glorious\\n\\t\\t\\t\\tLamp of the heavens: \"Blessed is He Who made the\\n\\t\\t\\t\\tConstellations in the skies, and placed therein a lamp,\\n\\t\\t\\t\\tand a moon giving light.\""
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "17",
    "NoteID": "5717",
    "Body": "Cf. iii. 37, where the growth of the child Mary the\\n\\t\\t\\t\\tMother of Jesus is described by the same word nabat,\\n\\t\\t\\t\\tordinarily denoting the growth of plants and trees. The\\n\\t\\t\\t\\tsimile is that of a seed sown, that germinates, grows,\\n\\t\\t\\t\\tand dies, and goes back to the earth. In man, there is\\n\\t\\t\\t\\tthe further process of the Resurrection. Cf. also xx. 55."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "19",
    "NoteID": "5718",
    "Body": "Cf. xx. 53."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "20",
    "NoteID": "5719",
    "Body": "Fijaj implies valley-roads or passes between mountains.\\n\\t\\t\\t\\tThough there are mountain chains on the earth, Allah's\\n\\t\\t\\t\\tartistry has provided even in such regions, valleys and\\n\\t\\t\\t\\tchannels by which men may go about. Mountain roads\\n\\t\\t\\t\\tusually follow the valleys. A) Sinners always resent it\\n\\t\\t\\t\\tas a reproach that righteous men should speak to them for\\n\\t\\t\\t\\ttheir own good. They prefer smooth flatterers, and they\\n\\t\\t\\t\\tworship power even though the depositaries of power are\\n\\t\\t\\t\\tselfish men, who neither profit themselves nor profit\\n\\t\\t\\t\\tothers by the wealth and man-power that they collect\\n\\t\\t\\t\\tround themselves. They forget that mere material things\\n\\t\\t\\t\\tmay be a delusion and a snare unless the moral and\\n\\t\\t\\t\\tspiritual factor behind them sanctifies them."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "22",
    "NoteID": "5720",
    "Body": "Having got material resources the wicked devise plots to\\n\\t\\t\\t\\tget rid of the righteous whose presence is a reproach to\\n\\t\\t\\t\\tthem. For a time their plots may seem tremendous and have\\n\\t\\t\\t\\tthe appearance of success, but they can never defeat\\n\\t\\t\\t\\tAllah's Purpose."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "23",
    "NoteID": "5721",
    "Body": "For an account of how these Pagan gods and superstitions\\n\\t\\t\\t\\tconnected with them originated, and how they became\\n\\t\\t\\t\\tadopted into the Arabian Pagan Pantheon."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "24",
    "NoteID": "5722",
    "Body": "Such Pagan superstitions and cults do not add to human\\n\\t\\t\\t\\tknowledge or human well-being. They only increase error\\n\\t\\t\\t\\tand wrong-doing. For example, how much lewdness resulted\\n\\t\\t\\t\\tfrom the Greek and Roman Saturnalia! And how much\\n\\t\\t\\t\\tlewdness results from ribald Holi songs! This is the\\n\\t\\t\\t\\tnatural result, and Noah in his bitterness of spirit\\n\\t\\t\\t\\tprays that Allah's grace may be cut off from men who hug\\n\\t\\t\\t\\tthem to their hearts. They mislead others: let them miss\\n\\t\\t\\t\\ttheir own mark! See also verse 28 below."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "25",
    "NoteID": "5723",
    "Body": "The Punishment of sin seizes the soul from every side and\\n\\t\\t\\t\\tin every form. Water (drowning) indicates death by\\n\\t\\t\\t\\tsuffocation, through the nose, ears, eyes, mouth, throat,\\n\\t\\t\\t\\tand lung. Fire has the opposite effects: it burns the\\n\\t\\t\\t\\tskin, the limbs, the flesh, the brains, the bones, and\\n\\t\\t\\t\\tevery part of the body. So the destruction wrought by sin\\n\\t\\t\\t\\tis complete from all points of view. And yet it is not\\n\\t\\t\\t\\tdeath (xx. 74); for death would be a merciful release\\n\\t\\t\\t\\tfrom the Penalty, and the soul steeped in sin has closed\\n\\t\\t\\t\\tthe gates of Allah's Mercy on itself. There they will\\n\\t\\t\\t\\tabide, unless and \"except as Allah willeth\" (vi. 128).\\n\\t\\t\\t\\tFor time and eternity, as we conceive them now, have no\\n\\t\\t\\t\\tmeaning in the wholly new world."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "26",
    "NoteID": "5724",
    "Body": "The Flood was sent in order to purge all sin. The prayer\\n\\t\\t\\t\\tof Noah is not vindicfive. It simply means, \"Cut off all\\n\\t\\t\\t\\tthe roots of sin\". See next note."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "28",
    "NoteID": "5725",
    "Body": "Indeed he prays for himself, his parents, his guests, and\\n\\t\\t\\t\\tall who in earnest faith turn to Allah, in all ages and\\n\\t\\t\\t\\tin all places. Praying for their forgiveness is also\\n\\t\\t\\t\\tpraying for the destruction of sin."
  },
  {
    "SurahNumber": "71",
    "AyahNumber": "28",
    "NoteID": "5726",
    "Body": "This is slightly different in form from verse 24 above,\\n\\t\\t\\t\\twhere see n. 5722. See also last note."
  }
]
