[
  {
    "SurahNumber": "16",
    "AyahNumber": "1",
    "NoteID": "2019",
    "Body": "This is an answer to the taunt of the Pagans, who said;\\n\\t\\t\\t\\t\"If there is a god, the One True God, as you say, with\\n\\t\\t\\t\\tunified control, why does He not punish the wrong-doers\\n\\t\\t\\t\\tat once?\" The answer is; \"The decree of Allah will\\n\\t\\t\\t\\tinevitably come to pass; it will come soon enough; when\\n\\t\\t\\t\\tit comes, you will wish it were delayed; how foolish of\\n\\t\\t\\t\\tyou to wish even to cut off your last hope of\\n\\t\\t\\t\\tforgiveness?\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "2",
    "NoteID": "2020",
    "Body": "The Pagans, with their multiplicity of gods and\\n\\t\\t\\t\\tgoddesses, good and evil, could play one off against\\n\\t\\t\\t\\tanother. That is mere mockery of religion. With such\\n\\t\\t\\t\\tconceptions, man cannot understand the Unity of Design in\\n\\t\\t\\t\\tthe Universe nor realise the Power and Glory of the One\\n\\t\\t\\t\\tTrue God, to Whom alone worship and service are due."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "3",
    "NoteID": "2021",
    "Body": "Not for sport, or fortuitously and without Design. Cf.\\n\\t\\t\\t\\txv. 85. Surely the Unity of Design in Creation also\\n\\t\\t\\t\\tproves the Unity of Allah their Creator."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "4",
    "NoteID": "2022",
    "Body": "Man's physical origin is lowly. Yet do men go back to\\n\\t\\t\\t\\tmaterial things, and neglect or dispute about the highest\\n\\t\\t\\t\\tthings in Life."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "5",
    "NoteID": "2023",
    "Body": "Why will you go back to material things, considering that\\n\\t\\t\\t\\tmaterial things are made subservient to your use and\\n\\t\\t\\t\\tenjoyment in various ways as suggested in the clauses\\n\\t\\t\\t\\tthat follow."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "5",
    "NoteID": "2024",
    "Body": "From wool, and hair, and skins, and milk. Camel's hair\\n\\t\\t\\t\\tmakes warm robes and blankets; and certain kinds of goats\\n\\t\\t\\t\\tyield hair which makes similar fabrics. Sheep yield wool,\\n\\t\\t\\t\\tand llamas alpaca for similar uses. The skins and furs of\\n\\t\\t\\t\\tmany animals yield warm raiment or make warm rugs or\\n\\t\\t\\t\\tbedding. The females of many of these animals yield good\\n\\t\\t\\t\\twarm milk, a nourishing and wholesome diet. Then the\\n\\t\\t\\t\\tflesh of many of these animals is good to eat. There are\\n\\t\\t\\t\\tother uses, which the animals serve, and which are\\n\\t\\t\\t\\treferred to later."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "6",
    "NoteID": "2025",
    "Body": "The good man is proud of his cattle and is good to them.\\n\\t\\t\\t\\tAs they go to, and return from, pasture, morning and\\n\\t\\t\\t\\tevening, he has a sense of his power and wealth and their\\n\\t\\t\\t\\tbeauty and docility. Will not man turn from these\\n\\t\\t\\t\\tmaterial facts to the great spiritual truths and purpose\\n\\t\\t\\t\\tbehind them?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "7",
    "NoteID": "2026",
    "Body": "The cattle and animals also carry loads, and thus make\\n\\t\\t\\t\\tinter-communication between different lands easy. But for\\n\\t\\t\\t\\tthem there would have been many difficulties, not only\\n\\t\\t\\t\\tphysical, but psychological. Weary men carrying loads are\\n\\t\\t\\t\\tin no mood for social and spiritual intercourse. This\\n\\t\\t\\t\\tintercourse is made possible by the kindness and mercy of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "8",
    "NoteID": "2027",
    "Body": "Horse, mules, and donkeys as well as other animals may be\\n\\t\\t\\t\\tbeasts of burden, but they may also be pedigree animals\\n\\t\\t\\t\\tbred for beauty and for all those more refined uses, such\\n\\t\\t\\t\\tas processions, in which grace and elegance is the\\n\\t\\t\\t\\tpredominant feature."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "8",
    "NoteID": "2028",
    "Body": "If we examine the history of transport, there have been\\n\\t\\t\\t\\tvast changes through the ages, from rude pack animals to\\n\\t\\t\\t\\tfine equipages, and then through mechanical contrivances,\\n\\t\\t\\t\\tsuch means of transport as elegant coaches, tramways and\\n\\t\\t\\t\\trailways, useful motor lorries and Rolls-Royce cars, and\\n\\t\\t\\t\\tair-ships and aeroplanes of all descriptions. At any\\n\\t\\t\\t\\tgiven point of time, many of these were yet unknown to\\n\\t\\t\\t\\tman. Nor can we suppose the limit to have been reached\\n\\t\\t\\t\\tnow or that it will ever be reached at any future time.\\n\\t\\t\\t\\tThrough the mind and ingenuity of man it is Allah that\\n\\t\\t\\t\\tcreates new things hitherto unknown to man."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "9",
    "NoteID": "2029",
    "Body": "Through material things \"the Way\" does always lead to\\n\\t\\t\\t\\tAllah. But some minds are so obsessed with material\\n\\t\\t\\t\\tthings that they miss the pointers to the spiritual.\\n\\t\\t\\t\\tAllah could have forced all to the true Way, but in His\\n\\t\\t\\t\\tWill and Plan is the training of man's will, and that is\\n\\t\\t\\t\\tdone by the Signs in nature and Revelation."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "11",
    "NoteID": "2030",
    "Body": "The least thought and study of nature will show you\\n\\t\\t\\t\\tAllah's wise and benign Providence in making the\\n\\t\\t\\t\\tprocesses of nature subserve man's use and refined life.\\n\\t\\t\\t\\tA higher degree of intelligence and study is required\\n\\t\\t\\t\\t(\"men who are wise\") to understand Allah's Signs to man\\n\\t\\t\\t\\tin the processes connected with the heavenly bodies\\n\\t\\t\\t\\t(verse 12). And a still higher spiritual understanding\\n\\t\\t\\t\\t(\"men who celebrate His praises\" with gratitude) to\\n\\t\\t\\t\\trealise the marvellous gradations, colours, and nuances\\n\\t\\t\\t\\tin the creatures on this little globe of ours (verse 13),\\n\\t\\t\\t\\tReason this out carefully."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "12",
    "NoteID": "2031",
    "Body": "The Night and the Day are caused by astronomical\\n\\t\\t\\t\\trotations. What is important for man to note is how Allah\\n\\t\\t\\t\\thas given intelligence to man to make use of this\\n\\t\\t\\t\\talternation for work and rest; how man can, as soon as he\\n\\t\\t\\t\\trises from the primitive stage, get over their\\n\\t\\t\\t\\tinequalities by artificial illuminants, such as vegetable\\n\\t\\t\\t\\tor mineral oils, coal, gas, or electricity, which\\n\\t\\t\\t\\tultimately are derived from the stored-up energy of the\\n\\t\\t\\t\\tsun; how the sun's heat can be tempered by various\\n\\t\\t\\t\\tartificial means and can be stored up for use by man as\\n\\t\\t\\t\\trequired, how man can be independent of the tides caused\\n\\t\\t\\t\\tby the moon and the sun, which formerly controlled\\n\\t\\t\\t\\tnavigation, but which no longer stand in man's way, with\\n\\t\\t\\t\\this artificial harbours and great sea-going ships, how\\n\\t\\t\\t\\tnavigation was formerly subject to direct observation of\\n\\t\\t\\t\\tthe Polar Star and other stars, but how the magnetic\\n\\t\\t\\t\\tneedle and charts have now completely altered the\\n\\t\\t\\t\\tposition, and man can calculate and to a certain extent\\n\\t\\t\\t\\tcontrol magnetic variations, etc. In such ways the sun,\\n\\t\\t\\t\\tthe moon, and the stars themselves become useful servants\\n\\t\\t\\t\\tto him, all by Allah's gift and His Command, without\\n\\t\\t\\t\\twhich there would have been no laws governing them and no\\n\\t\\t\\t\\tintelligence to make use of them."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "13",
    "NoteID": "2032",
    "Body": "Whose heart has not been moved by the glorious gradation\\n\\t\\t\\t\\tof colours in the sunset clouds? The gradations are\\n\\t\\t\\t\\tinfinite, and it is only the eye of an artist that can\\n\\t\\t\\t\\texpress their collective beauty. They are but a type of\\n\\t\\t\\t\\tthe infinite variety and gradation of qualities in the\\n\\t\\t\\t\\tspiritual sphere even in the little space of our own\\n\\t\\t\\t\\tglobe. The big things that can be measured and defined\\n\\t\\t\\t\\thave been spoken of before. Here we have mention of the\\n\\t\\t\\t\\tsubtle nuances in the spiritual world which can only be\\n\\t\\t\\t\\tperceived by men who are so high in spiritual insight\\n\\t\\t\\t\\tthat their only reaction is to \"cerebrate the praises of\\n\\t\\t\\t\\tAllah\" in gratitude for His infinite Mercies."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "13",
    "NoteID": "2033",
    "Body": "Read again n. 2030 above, and see how subtly we are led\\n\\t\\t\\t\\tup from the perception of the big to the perception of\\n\\t\\t\\t\\tthe subtle and delicate colours and qualities in the\\n\\t\\t\\t\\tspiritual world."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "14",
    "NoteID": "2034",
    "Body": "We have gone up in a climax of material things from the\\n\\t\\t\\t\\tbig to the subtle in the sky and the earth. Here we have\\n\\t\\t\\t\\tanother climax as regard the things of the sea. We get\\n\\t\\t\\t\\tthe delicate flesh of fishes and marine creatures of all\\n\\t\\t\\t\\tkinds; we get the treasures of the deep; pearls, coral,\\n\\t\\t\\t\\tamber, and things of that kind; and we have the stately\\n\\t\\t\\t\\tships ploughing the waves, for maritime commerce and\\n\\t\\t\\t\\tintercourse, for unifying mankind, and for realising the\\n\\t\\t\\t\\tspiritual bounty of Allah which can best be expressed by\\n\\t\\t\\t\\tthe boundless ocean."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "14",
    "NoteID": "2035",
    "Body": "Connoisseurs know the delicate flavours of sea fish, such\\n\\t\\t\\t\\tas the pomfret of the Indian Ocean, the herring of the\\n\\t\\t\\t\\tNorth Atlantic, the mullet of Marseilles, and many\\n\\t\\t\\t\\tanother kind. Tari, translated \"fresh and tender,\" also\\n\\t\\t\\t\\trefers to the soft moist nature of fresh fish. It is\\n\\t\\t\\t\\tanother wonder of Allah that salt water should produce\\n\\t\\t\\t\\tflesh or such fresh, tender, and delicate flavour."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "14",
    "NoteID": "2036",
    "Body": "Diving for pearls-in both the primitive and the more\\n\\t\\t\\t\\tadvanced form-is another instance of man's power over\\n\\t\\t\\t\\tapparently inaccessible depths of the sea."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "14",
    "NoteID": "2037",
    "Body": "After the material benefits which we get from the sea, we\\n\\t\\t\\t\\tare asked to consider things of higher import to the\\n\\t\\t\\t\\tspirit of man. There is the beautiful ship which stands\\n\\t\\t\\t\\tas the symbol of international commerce and intercourse,\\n\\t\\t\\t\\tthings that may be of material benefit, but which have a\\n\\t\\t\\t\\thigher aspect in unifying man and making his civilisation\\n\\t\\t\\t\\tmore universal. These are first steps in seeking of the\\n\\t\\t\\t\\t\"bounty of Allah\" through the sea. But there are higher\\n\\t\\t\\t\\taspects. Navigation and international intercourse\\n\\t\\t\\t\\tincrease knowledge, which in its higher aspects should\\n\\t\\t\\t\\tclean the mind and make it fitter to approach Allah. The\\n\\t\\t\\t\\tsalt water, which covers nearly 72 percent of the surface\\n\\t\\t\\t\\tof the Globe, is itself a purifying and sanitary agent,\\n\\t\\t\\t\\tand is a good symbol of the higher bounties of Allah,\\n\\t\\t\\t\\twhich are as boundless as the Ocean."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "15",
    "NoteID": "2038",
    "Body": "Cf. xiii. 3 and xv. 19. Here and elsewhere the earth is\\n\\t\\t\\t\\tspoken of as a spacious carpet beneath our feet and the\\n\\t\\t\\t\\thills as a steadying agent to keep the carpet from\\n\\t\\t\\t\\trolling or shaking about. In lxxvii. 7 they are spoken of\\n\\t\\t\\t\\tas pegs or stakes."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "15",
    "NoteID": "2039",
    "Body": "In this passage (xvi. 15-16) we have the metaphor of the\\n\\t\\t\\t\\tfixed mountains further allegorised. In these verses the\\n\\t\\t\\t\\tkey-words are indicated by the symbols for man's Guidance\\n\\t\\t\\t\\t(tahtadun). First, the physical symbols are indicated;\\n\\t\\t\\t\\tthe mountains that stand firm and do not change from day\\n\\t\\t\\t\\tto day in the landscape, unlike shifting sand-dunes, or\\n\\t\\t\\t\\tthe coast line of the sea, or rivers and streams, which\\n\\t\\t\\t\\tfrequently change their courses, then we have rivers and\\n\\t\\t\\t\\troads, which are more precise and therefore more useful,\\n\\t\\t\\t\\tthough less permanent; then we have 'alamat (sign-posts),\\n\\t\\t\\t\\tany kinds of signs erected by man, like direction posts,\\n\\t\\t\\t\\tlight-houses or beacons, or provided in nature, as tall\\n\\t\\t\\t\\ttrees, etc.; and finally, we have the pole-star, and now\\n\\t\\t\\t\\tthe magnetic needle, with its variations marked on\\n\\t\\t\\t\\tnavigation charts. All these are symbols for the higher\\n\\t\\t\\t\\tGuidance which Allah provides for the spirit of man. See\\n\\t\\t\\t\\tnext note."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "16",
    "NoteID": "2040",
    "Body": "See last note. Let us exmaine the completed allegory. As\\n\\t\\t\\t\\tthere are beacons, landmarks and signs to show the way to\\n\\t\\t\\t\\tmen on the earth, so in the spiritual world. And it is\\n\\t\\t\\t\\tultimately Allah Who provides them, and this is His\\n\\t\\t\\t\\tcrowning Mercy. Like the mountains there are spiritual\\n\\t\\t\\t\\tLandmarks in the missions of the Great Prophets: they\\n\\t\\t\\t\\tshould guide us, or teach us, to guide ourselves, and not\\n\\t\\t\\t\\tshake hither and thither like a ship without a rudder or\\n\\t\\t\\t\\tpeople without Faith. As rivers and streams mark out\\n\\t\\t\\t\\ttheir channels, smoothing out levels so we have wholesome\\n\\t\\t\\t\\tLaws and Customs established, to help us in our lives.\\n\\t\\t\\t\\tThen we have the examples of Great Men as further\\n\\t\\t\\t\\tsign-posts: \"Lives of great men all remind us, We can\\n\\t\\t\\t\\tmake our lives sublime.\" In long-distance travel, the\\n\\t\\t\\t\\tpole-star and the magnetic needle are our guides; so in\\n\\t\\t\\t\\tour long-distance journey to the other world, we have\\n\\t\\t\\t\\tultimately to look to heavenly guidance or its reflection\\n\\t\\t\\t\\tin Allah's Revelation."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "17",
    "NoteID": "2041",
    "Body": "The supreme majesty of Allah have been set out in His\\n\\t\\t\\t\\tfavours of all kinds, it will be seen at once that the\\n\\t\\t\\t\\tworship of any other than Allah is meaningless and\\n\\t\\t\\t\\tridiculous. Shall we not take the hint and understand?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "18",
    "NoteID": "2042",
    "Body": "Of all Allah's favours innumerable, His Mercy and\\n\\t\\t\\t\\tForgiveness in the spiritual plane is the greatest, and\\n\\t\\t\\t\\tof eternal value to us in our future Lives."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "20",
    "NoteID": "2043",
    "Body": "Allah is the only Creator and the Ultimate Reality.\\n\\t\\t\\t\\tEverything else is created by Him, and reflects His\\n\\t\\t\\t\\tglory. How foolish then to worship any other than Allah!"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "21",
    "NoteID": "2044",
    "Body": "Idols are dead wood or stone. If men worship stars, or\\n\\t\\t\\t\\theroes, or prophets, or great men, they too have no life\\n\\t\\t\\t\\texcept that which was given by Allah. In themselves they\\n\\t\\t\\t\\tare lifeless. If they worship figments of the\\n\\t\\t\\t\\timagination, they are reflections in a double degree, and\\n\\t\\t\\t\\thave no life in themselves. All these things will be\\n\\t\\t\\t\\traised up on the Last Day, in order that false\\n\\t\\t\\t\\tworshippers may be confronted with them. But they\\n\\t\\t\\t\\tthemselves cannot tell when that Day will be."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "22",
    "NoteID": "2045",
    "Body": "Everything points to Allah, the One True Eternal God. If\\n\\t\\t\\t\\tso, there is a Hereafter, for He has declared it. In so\\n\\t\\t\\t\\tfar as people do not believe this, the fault is in their\\n\\t\\t\\t\\tWill; they do not wish to believe, and the motive behind\\n\\t\\t\\t\\tis arrogance, the sin which brought about the fall of\\n\\t\\t\\t\\tIblis: ii. 34."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "23",
    "NoteID": "2046",
    "Body": "Cf. xvi, 19, where the same words refer to man generally.\\n\\t\\t\\t\\tWhether he conceals or reveals what is in his heart,\\n\\t\\t\\t\\tAllah knows it, and as Allah is Oft-Forgiving. Most\\n\\t\\t\\t\\tMerciful, His grace is available as His highest favour if\\n\\t\\t\\t\\tman will take it. Here the reference is to those who\\n\\t\\t\\t\\t\"refuse to know\", who reject Allah's guidance out of\\n\\t\\t\\t\\tarrogance. Allah \"loveth not the arrogant\". Such men\\n\\t\\t\\t\\tdeprive themselves of Allah's grace."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "24",
    "NoteID": "2047",
    "Body": "When the arrogant Unbelievers are referred to some\\n\\t\\t\\t\\tdefinite argument or illustration from Scripture, they\\n\\t\\t\\t\\tdismiss it contemptuously with the remark: \"Tales of the\\n\\t\\t\\t\\tancients!\" In this, they are not only playing with their\\n\\t\\t\\t\\town conscience, but misleading others, with perhaps less\\n\\t\\t\\t\\tknowledge than themselves."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "25",
    "NoteID": "2048",
    "Body": "Their responsibility or crime is twofold: (1) that they\\n\\t\\t\\t\\trejected Allah's Message, and (2) that they misled\\n\\t\\t\\t\\tothers. Their Penalty will also be double. In vi. 164, we\\n\\t\\t\\t\\tare told that \"no bearer of burdens can bear the burden\\n\\t\\t\\t\\tof another\". This is against the doctrine of vicarious\\n\\t\\t\\t\\tatonement. Every man is responsible for his own sins; but\\n\\t\\t\\t\\tthe sin of misleading others is a sin of the misleader\\n\\t\\t\\t\\thimself, and he must suffer the penalty for that also,\\n\\t\\t\\t\\twithout relieving those misled, of their responsibility."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "26",
    "NoteID": "2049",
    "Body": "Evil will always devise plots against the Prophets of\\n\\t\\t\\t\\tAllah. So was it with Al-Mustafa, and so was it with the\\n\\t\\t\\t\\tProphets before him. But the imposing structures which\\n\\t\\t\\t\\tthe ungodly build up (metaphorically) collapse at the\\n\\t\\t\\t\\tCommand of Allah, and they are often punished from\\n\\t\\t\\t\\tquarters from which they least expected punishment. For\\n\\t\\t\\t\\texample, the Quraish were confident in their numbers,\\n\\t\\t\\t\\ttheir organisations, and their superior equipment. But on\\n\\t\\t\\t\\tthe field of Badr they collapsed where they expected\\n\\t\\t\\t\\tvictory."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "27",
    "NoteID": "2050",
    "Body": "The worshippers of false gods (ungodly, the Unbelievers)\\n\\t\\t\\t\\twill be unable to reply when brought before the Judgment\\n\\t\\t\\t\\tSeat. The comment of those \"endued with knowledge\"-the\\n\\t\\t\\t\\tProphets and Teachers whom they had rejected-will be by\\n\\t\\t\\t\\tway of indictment and explanation of the position of\\n\\t\\t\\t\\tthose before the Judgment Seat."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "28",
    "NoteID": "2051",
    "Body": "That is, those who died in a state of Kufr, or rebellion\\n\\t\\t\\t\\tagainst Allah, which was really wrong-doing against their\\n\\t\\t\\t\\town souls."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "28",
    "NoteID": "2052",
    "Body": "The excuse is a mere pretence. At first they were too\\n\\t\\t\\t\\tdazed to reply. When they reply, they cannot deny the\\n\\t\\t\\t\\tfacts, but resort to the sinner's excuse of saying that\\n\\t\\t\\t\\tthey sinned through ignorance, and that their motives\\n\\t\\t\\t\\twere not wrong. Such a plea raises a question of hidden\\n\\t\\t\\t\\tthoughts which are difficult to appraise before a human\\n\\t\\t\\t\\ttribunal. But here they are before their Divine Author,\\n\\t\\t\\t\\tWho knows every secret of their souls, and before Whom no\\n\\t\\t\\t\\tfalse plea can be of any value. So they are condemned."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "30",
    "NoteID": "2053",
    "Body": "The contrast and parallelism is with xvi. 24, where the\\n\\t\\t\\t\\tungodly in their levity and their deliberate rejection of\\n\\t\\t\\t\\tguidance find no profit from Allah's Revelation."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "30",
    "NoteID": "2054",
    "Body": "Unlike the ungodly, the good find good everywhere,-in\\n\\t\\t\\t\\tthis world and in the Hereafter; because they understand\\n\\t\\t\\t\\tand are in accord with the truths around them."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "32",
    "NoteID": "2055",
    "Body": "In a state of purity: from the evils of this world, from\\n\\t\\t\\t\\twant of faith and want of grace. Purity from such evil is\\n\\t\\t\\t\\tthe mark of true Islam, and those who die in such purity\\n\\t\\t\\t\\twill be received into Felicity with a salutation of\\n\\t\\t\\t\\tPeace."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "33",
    "NoteID": "2056",
    "Body": "That is, until death comes to them, or some Punishment in\\n\\t\\t\\t\\tthis life, itself, which precludes them from repentance,\\n\\t\\t\\t\\tand the Mercy of Allah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "35",
    "NoteID": "2057",
    "Body": "The old, old argument: if Allah is All-Powerful, why did\\n\\t\\t\\t\\tHe not force all persons to His Will? This ignores the\\n\\t\\t\\t\\tlimited Free-will granted to man, which is the whole\\n\\t\\t\\t\\tbasis of Ethics. Allah gives man every opportunity of\\n\\t\\t\\t\\tknowing and understanding things, but He does not force\\n\\t\\t\\t\\thim, for that would be against the whole Plan on which\\n\\t\\t\\t\\tour present Life is constituted."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "35",
    "NoteID": "2058",
    "Body": "The Pagan Arabs prescribed various arbitrary prohibitions\\n\\t\\t\\t\\tin the matter of meat; see vi. 143-145. These, of course,\\n\\t\\t\\t\\tare not recognised by Islam, which also removed some of\\n\\t\\t\\t\\tthe restrictions of the Jewish Law; vi. 146. The general\\n\\t\\t\\t\\tmeaning, however, is far wider. Men erect their own\\n\\t\\t\\t\\ttaboos and prohibitions, barriers and restrictions, and\\n\\t\\t\\t\\tascribe them to Religion. This is wrong, and more\\n\\t\\t\\t\\tconsonant with Pagan practice than with Islam."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "35",
    "NoteID": "2059",
    "Body": "Clear Message: Mubin: in three senses; (1) a Message\\n\\t\\t\\t\\tclear and unambiguous; (2) one that makes all things\\n\\t\\t\\t\\tclear to those who try to understand, because it accords\\n\\t\\t\\t\\twith their own nature as created by Allah; (3) one\\n\\t\\t\\t\\tpreached openly and to everyone."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "36",
    "NoteID": "2060",
    "Body": "Even though Allah's Signs are everywhere in Nature and in\\n\\t\\t\\t\\tmen's own conscience, yet in addition Allah has sent\\n\\t\\t\\t\\thuman Messengers to every People to call their attention\\n\\t\\t\\t\\tto the Good and turn them from Evil. So they cannot\\n\\t\\t\\t\\tpretend that Allah has abandoned them or that He does not\\n\\t\\t\\t\\tcare what they do. His divine Grace always invites their\\n\\t\\t\\t\\twill to choose the right."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "36",
    "NoteID": "2061",
    "Body": "While some people accept the guidance of the divine\\n\\t\\t\\t\\tGrace, others so surrender themselves to Evil that it\\n\\t\\t\\t\\tmust necessarily follow that Evil obtains a grip over\\n\\t\\t\\t\\tthem. They have only to travel through Time or Space to\\n\\t\\t\\t\\tsee the end of those who abandoned their lights and\\n\\t\\t\\t\\tsurrendered to Evil and Error. For haqqat and the meaning\\n\\t\\t\\t\\tof haqq in this connection cf. xv. 64."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "37",
    "NoteID": "2062",
    "Body": "When once Allah's Grace is rejected by any one, such a\\n\\t\\t\\t\\tperson loses all help and guidance. Such persons are then\\n\\t\\t\\t\\toutside Allah's Grace, and therefore they are outside\\n\\t\\t\\t\\tguidance."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "38",
    "NoteID": "2063",
    "Body": "The strongest oath of the Pagan Arabs would be by the\\n\\t\\t\\t\\tSupreme Allah; less strong oaths would be by their\\n\\t\\t\\t\\tsubordinate deities, or their ancestors, or other things\\n\\t\\t\\t\\tthey valued or held sacred."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "38",
    "NoteID": "2064",
    "Body": "The usual Pagan creed is: 'If there is a God, it does not\\n\\t\\t\\t\\tfollow that He will raise us up; why should He?' The\\n\\t\\t\\t\\tanswer is twofold: (1) Allah has promised it, and Allah's\\n\\t\\t\\t\\tpromise is true; (2) He must finally manifest the Truth\\n\\t\\t\\t\\tto them, convict them of their falsehood, and enforce\\n\\t\\t\\t\\ttheir personal responsibility (xvi. 39)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "39",
    "NoteID": "2065",
    "Body": "See the last note."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "40",
    "NoteID": "2066",
    "Body": "Allah's \"Word\" is in itself the Deed, Allah's Promise is\\n\\t\\t\\t\\tin itself the Truth. There is no interposition of Time or\\n\\t\\t\\t\\tCondition between His Will and its consequences, for He\\n\\t\\t\\t\\tis the Ultimate Reality. He is independent of the\\n\\t\\t\\t\\tproximate or material causes, for He Himself creates them\\n\\t\\t\\t\\tand establishes their Laws as He pleases."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "41",
    "NoteID": "2067",
    "Body": "There is no merit in suffering exile (hijrat) in itself.\\n\\t\\t\\t\\tTo have any merit, it must be; (1) in the cause of Allah,\\n\\t\\t\\t\\tand (2) after such an oppression as forces the sufferer\\n\\t\\t\\t\\tto choose between Allah and man. When these conditions\\n\\t\\t\\t\\tare fulfilled, the exiles are entitled to the highest\\n\\t\\t\\t\\thonour, as having made a great sacrifice in the cause of\\n\\t\\t\\t\\tAllah. Such were the early Muslim exiles to Abyssinia;\\n\\t\\t\\t\\tsuch were the later exiles to Madinah before the Prophet\\n\\t\\t\\t\\thimself left his home in Makkah and went to Madinah; and\\n\\t\\t\\t\\tsuch were the exiles who went with the Prophet or\\n\\t\\t\\t\\tfollowed him. At all these stages, his approval or advice\\n\\t\\t\\t\\twas always obtained, either specifically or generally."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "43",
    "NoteID": "2068",
    "Body": "Allah's prophets were always men, not angels; and their\\n\\t\\t\\t\\tdistinction was the inspiration they received."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "43",
    "NoteID": "2069",
    "Body": "If the Pagan Arabs, who were ignorant of religious and\\n\\t\\t\\t\\tother history, wondered how a man from among themselves\\n\\t\\t\\t\\tcould receive inspiration and bring a Message from Allah,\\n\\t\\t\\t\\tlet them ask the Jews, who had also received Allah's\\n\\t\\t\\t\\tMessage earlier through Moses, whether Moses was a man,\\n\\t\\t\\t\\tor an angel, or a god. They would learn that Moses was a\\n\\t\\t\\t\\tman like themselves, but inspired by Allah. \"Those who\\n\\t\\t\\t\\tpossess the Message\" may also mean any men of Wisdom, who\\n\\t\\t\\t\\twere qualified to have an opinion in such matters."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "44",
    "NoteID": "2070",
    "Body": "As the People of the Book had received \"Clear Signs\" and\\n\\t\\t\\t\\tinspired Books before, so also Allah's Message came to\\n\\t\\t\\t\\tthe Prophet Muhammad through the Qur-an, which superseded\\n\\t\\t\\t\\tthe earlier revelations, already corrupted in the hands\\n\\t\\t\\t\\tof their followers."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "45",
    "NoteID": "2071",
    "Body": "Cf. xvi. 26. The wicked plot against Prophets of Allah in\\n\\t\\t\\t\\tsecret, forgetting that every hidden thought of theirs is\\n\\t\\t\\t\\tknown to Allah, and that for every thought and action of\\n\\t\\t\\t\\ttheirs they will have to account to Allah. And Allah's\\n\\t\\t\\t\\tpunishment can seize them in various ways. Four are\\n\\t\\t\\t\\tenumerated here. (1) They may be swallowed up in the\\n\\t\\t\\t\\tearth like Qarun, whose story is told in xxviii. 76-81.\\n\\t\\t\\t\\tHe was swallowed up in the earth while he was arrogantly\\n\\t\\t\\t\\texulting on the score of his wealth. (2) It may be that,\\n\\t\\t\\t\\tlike Haman, the prime minister of Pharaoh, they are\\n\\t\\t\\t\\tplotting against Allah, when they are themselves\\n\\t\\t\\t\\toverwhelmed by some dreadful calamity; xi. 36-38, xxix.\\n\\t\\t\\t\\t39-40. The case of Pharaoh is also in point. He was\\n\\t\\t\\t\\tdrowned while he was arrogantly hoping to frustrate\\n\\t\\t\\t\\tAllah's plans for Israel; x. 90-92. For (3) and (4) see\\n\\t\\t\\t\\tthe next two notes."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "46",
    "NoteID": "2072",
    "Body": "(3) Or the punishment may come to people away from their\\n\\t\\t\\t\\thomes and humble them in their pride. It so happened to\\n\\t\\t\\t\\tAbu Jahl, who came exulting in his pride to the Battle of\\n\\t\\t\\t\\tBadr (A.H. 2). His army was three times the size of the\\n\\t\\t\\t\\tMuslim army from Madinah. But it suffered a crushing\\n\\t\\t\\t\\tdefeat, and he himself was ignominiously slain."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "47",
    "NoteID": "2073",
    "Body": "(4) Or, as often happens, the punishment comes slowly and\\n\\t\\t\\t\\timperceptibly, the power of the enemies of Allah being\\n\\t\\t\\t\\twasted gradually, until it is extinguished. This happened\\n\\t\\t\\t\\tto the Makkans during the eight years of the Prophet's\\n\\t\\t\\t\\texile. The conquest of Makkah was bloodless, because the\\n\\t\\t\\t\\tpower of the enemy had gradually vanished. The Prophet\\n\\t\\t\\t\\twas thus able to show the unexampled generosity and\\n\\t\\t\\t\\tclemency which he showed on that occasion, for two of\\n\\t\\t\\t\\tAllah's attributes are expressed in the titles \"Full of\\n\\t\\t\\t\\tkindness\" (Ra-uf) and \"Full of mercy\" (Rahim)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "48",
    "NoteID": "2074",
    "Body": "I take \"things\" here to be inanimate things, for the next\\n\\t\\t\\t\\tverse speaks of living, \"moving creatures\" and angels. By\\n\\t\\t\\t\\ta metaphor even such inanimate things are spoken of as\\n\\t\\t\\t\\trecognising Allah and humbly worshipping Him. Even their\\n\\t\\t\\t\\tshadows turn round from right and left according to the\\n\\t\\t\\t\\tlight from above, and they humbly prostrate themselves on\\n\\t\\t\\t\\tthe ground to celebrate the praises of Allah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "49",
    "NoteID": "2075",
    "Body": "Moving creatures, i.e., living creatures, \"All that is in\\n\\t\\t\\t\\tthe heavens or earth,\" includes every created thing. And\\n\\t\\t\\t\\tcreated things are mentioned in three classes: inanimate\\n\\t\\t\\t\\tthings, ordinary living things, and angels. Even the\\n\\t\\t\\t\\thighest angels are not arrogant; they bow down and serve\\n\\t\\t\\t\\ttheir Lord, and so does all Creation."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "50",
    "NoteID": "2076",
    "Body": "Allah is so high above the highest of His creatures, that\\n\\t\\t\\t\\tthey all look up to him in awe and reverence. And they\\n\\t\\t\\t\\tjoyfully do their duty in serving Him. This is the\\n\\t\\t\\t\\tmeaning of the \"fear of the Lord.\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "51",
    "NoteID": "2077",
    "Body": "The ancient Persians believed in two powers in the\\n\\t\\t\\t\\tUniverse, one good and the other evil. The Pagan Arabs\\n\\t\\t\\t\\talso had pairs of deities: e.g., Jibr (Sorcery) and Tagut\\n\\t\\t\\t\\t(Evil), referred to in iv. 51, n. 573, or the idols on\\n\\t\\t\\t\\tSafa and Marwa referred to in n. 160 to ii. 158: their\\n\\t\\t\\t\\tnames were Isaf and Naila."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "52",
    "NoteID": "2078",
    "Body": "The Pagans might have a glimmering of the One True God,\\n\\t\\t\\t\\tbut they had also a haunting fear of malevolent Powers of\\n\\t\\t\\t\\tEvil. They are told that such fears are groundless. Evil\\n\\t\\t\\t\\thas no power over those who trust in Allah: xv. 42. The\\n\\t\\t\\t\\tonly fear they should have is that of the Wrath of Allah.\\n\\t\\t\\t\\tTo the righteous all good things come from Allah, and\\n\\t\\t\\t\\tthey have no fear in their hearts."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "53",
    "NoteID": "2079",
    "Body": "Which shows that the natural tendency of man is to seek\\n\\t\\t\\t\\tAllah, the only Power which can truly relieve distress."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "56",
    "NoteID": "2080",
    "Body": "Idols and fictitious gods are certainly things of which\\n\\t\\t\\t\\tthey have no knowledge, idols being lifeless things of\\n\\t\\t\\t\\twhose life or doings no knowledge is possible, and\\n\\t\\t\\t\\tfictitious gods being but figments of their imagination."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "56",
    "NoteID": "2081",
    "Body": "Cf. vi. 136-140, 142-144, and v. 103. The Pagans, in\\n\\t\\t\\t\\tassigning and dedicating some of their children, or some\\n\\t\\t\\t\\tof their cattle, or some of the produce of their fields,\\n\\t\\t\\t\\tto their false gods as sharers with the true Supreme God,\\n\\t\\t\\t\\tmade themselves doubly ridiculous; first, because every\\n\\t\\t\\t\\tgood thing that they valued was given to them by Allah,\\n\\t\\t\\t\\tand how could they patronisingly assign to Him a share of\\n\\t\\t\\t\\tHis own gifts?-and secondly, because they brought in\\n\\t\\t\\t\\tother gods as sharers, who had no existence whatever!\\n\\t\\t\\t\\tBesides, the cattle and produce was given for their\\n\\t\\t\\t\\tphysical sustenance and the children for their social and\\n\\t\\t\\t\\tspiritual sustenance, and how can they, poor creatures,\\n\\t\\t\\t\\tgive sustenance to Allah?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "57",
    "NoteID": "2082",
    "Body": "Some of the Pagan Arabs called angels the daughters of\\n\\t\\t\\t\\tAllah. In their own life they hated to have daughters, as\\n\\t\\t\\t\\texplained in the next two verses. They practised female\\n\\t\\t\\t\\tinfanticide. In their state of perpetual war sons were a\\n\\t\\t\\t\\tsource of strength to them; daughters only made them\\n\\t\\t\\t\\tsubject to humiliating raids!"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "59",
    "NoteID": "2083",
    "Body": "\"It\", in this and the following clause, refers\\n\\t\\t\\t\\tgrammatically to the \"news\" (ma bushshira bihi). In\\n\\t\\t\\t\\tmeaning it refers to the \"female child\"-by the figure of\\n\\t\\t\\t\\tspeech known as metonymy."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "59",
    "NoteID": "2084",
    "Body": "Cf. lxxxi- 8-9. The practice of female infanticide is\\n\\t\\t\\t\\tcondemned in scathing terms. Female children used to be\\n\\t\\t\\t\\tburied alive by the Pagan Arabs."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "59",
    "NoteID": "2085",
    "Body": "It was an evil choice to decide on. Either alternative-to\\n\\t\\t\\t\\tkeep the poor girl as a thing of sufferance and contempt,\\n\\t\\t\\t\\tbringing disgrace on the family, or to get rid of it by\\n\\t\\t\\t\\tburying it alive-was cruel and indefensible."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "60",
    "NoteID": "2086",
    "Body": "The word mathal ordinarily denotes a similitude, but in\\n\\t\\t\\t\\tthe context of the present verse, especially with\\n\\t\\t\\t\\treference to Allah, it signifies His sublime attributes\\n\\t\\t\\t\\trather than a similitude. Cf. xxx. 27."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "61",
    "NoteID": "2087",
    "Body": "Allah's decree works without fail. If He were to punish\\n\\t\\t\\t\\tfor every wrong or shortcoming, not a single living\\n\\t\\t\\t\\tcreature on earth would escape punishment. But in His\\n\\t\\t\\t\\tinfinite mercy and forgiveness, He gives respite: He\\n\\t\\t\\t\\tprovides time for repentance. If the repentance is\\n\\t\\t\\t\\tforthcoming. Allah's Mercy is forthcoming without fail,\\n\\t\\t\\t\\tif not, the punishment comes inevitably on the expiry of\\n\\t\\t\\t\\tthe Term. The sinner cannot anticipate it by an insolent\\n\\t\\t\\t\\tchallenge, nor can he delay it when the time arrives. Let\\n\\t\\t\\t\\thim not think that the respite given him may mean that he\\n\\t\\t\\t\\tcan do what he likes, and that he can escape scot-free\\n\\t\\t\\t\\tfrom the consequences."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "62",
    "NoteID": "2088",
    "Body": "See above, xvi. 57-58 and notes."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "62",
    "NoteID": "2089",
    "Body": "The philosophy of Pleasure (Hedonism) assumes that\\n\\t\\t\\t\\tworldly enjoyment is good in itself and that there is\\n\\t\\t\\t\\tnothing beyond. But it can be shown, even on its own\\n\\t\\t\\t\\tground, that every act has its inevitable consequences.\\n\\t\\t\\t\\tNo Good can spring out of Evil. For falsehood and wrong\\n\\t\\t\\t\\tthe agony of the Fire is waiting, and the boastful\\n\\t\\t\\t\\tvotaries of Falsehood will be the first to fall into it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "63",
    "NoteID": "2090",
    "Body": "In all ages and among all Peoples Allah sent His\\n\\t\\t\\t\\tMessengers to teach the Truth and point the way to\\n\\t\\t\\t\\trighteousness. But the allurements of Evil seemed always\\n\\t\\t\\t\\tattractive, and many men preferred their own ways and the\\n\\t\\t\\t\\tways of their ancestors to the more difficult path of\\n\\t\\t\\t\\trectitude. This happened again in the time of Al-Mustafa,\\n\\t\\t\\t\\tand will always happen as long as men succumb to Evil."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "64",
    "NoteID": "2091",
    "Body": "But the path of duty before Allah's Messenger is clear.\\n\\t\\t\\t\\tHe is sent with the Revelation (the Qur-an) for three\\n\\t\\t\\t\\texpress purposes; (1) that he should bring about unity\\n\\t\\t\\t\\tamong the jarring sects, for the Gospel of Unity, while\\n\\t\\t\\t\\tpreaching the One True God, leads also to the unity of\\n\\t\\t\\t\\tmankind; (2) that the revelation should be a guide to\\n\\t\\t\\t\\tright conduct; and (3) that it should show the path of\\n\\t\\t\\t\\trepentance and Salvation, and thus be the highest mercy\\n\\t\\t\\t\\tto erring sinners."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "65",
    "NoteID": "2092",
    "Body": "When the earth with all its vegetation is well-nigh dead,\\n\\t\\t\\t\\tparched and shrivelled up, a vivifying shower of rain\\n\\t\\t\\t\\tfrom above gives it new life. This natural phenomenon is\\n\\t\\t\\t\\ta sign of Allah's infinite power, especially of His power\\n\\t\\t\\t\\tto resurrect the dead, and thereafter muster them for\\n\\t\\t\\t\\tjudgment."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "66",
    "NoteID": "2093",
    "Body": "The spiritual sustenance which Allah gives is typified by\\n\\t\\t\\t\\tthe wonderful ways of sustenance in the physical world,\\n\\t\\t\\t\\twhich figure forth Allah's providence and loving care for\\n\\t\\t\\t\\tHis creation. And the wonderful transformations in the\\n\\t\\t\\t\\tphysical world, which all tend to the benefit of man, are\\n\\t\\t\\t\\talso Signs of His supreme wisdom. In the previous verse\\n\\t\\t\\t\\train was mentioned, which gives new life to dead nature.\\n\\t\\t\\t\\tIn this and the following two verses our attention is\\n\\t\\t\\t\\tdrawn to milk, the products of the date and the vine, and\\n\\t\\t\\t\\thoney."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "66",
    "NoteID": "2094",
    "Body": "Their; in the Arabic, it is \"its\", in the singular\\n\\t\\t\\t\\tnumber, for two reasons: (1) cattle is the generic\\n\\t\\t\\t\\tplural, and may be treated as a singular noun; (2) the\\n\\t\\t\\t\\tinstructive Sign is in cattle collectively, but the milk\\n\\t\\t\\t\\tis the product of each single individual."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "66",
    "NoteID": "2095",
    "Body": "Milk is a secretion in the female body, like other\\n\\t\\t\\t\\tsecretions, but more specialised. Is it not wonderful\\n\\t\\t\\t\\tthat the same food, eaten by males and females, produces\\n\\t\\t\\t\\tin the latter, when they have young, the wholesome and\\n\\t\\t\\t\\tcomplete food, known as milk? Then, when cattle are tamed\\n\\t\\t\\t\\tand specially bred for milk, the supply of milk is vastly\\n\\t\\t\\t\\tgreater than is necessary for their young and lasts for a\\n\\t\\t\\t\\tlonger time than during the period they give suck to\\n\\t\\t\\t\\ttheir young. And it is a wholesome and agreeable diet for\\n\\t\\t\\t\\tman. It is pure, as typified by its whiteness. Yet it is\\n\\t\\t\\t\\ta secretion like other secretions, between the excretions\\n\\t\\t\\t\\twhich the body rejects as worthless and the precious\\n\\t\\t\\t\\tblood-stream which circulates within the body and is the\\n\\t\\t\\t\\tsymbol of life itself to the animal which produces it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "67",
    "NoteID": "2096",
    "Body": "There are wholesome drinks and foods that can be got out\\n\\t\\t\\t\\tof the date-palm and the vine: e.g., non-alcoholic drinks\\n\\t\\t\\t\\tfrom the date and the grape, vinegar, date-sugar,\\n\\t\\t\\t\\tgrape-sugar, and dates and grapes themselves for eating.\\n\\t\\t\\t\\tIf sakar is taken in the sense of fermented wine, it\\n\\t\\t\\t\\twould refer to the time before intoxicants were\\n\\t\\t\\t\\tprohibited, for this is a Makkan Sura and the prohibition\\n\\t\\t\\t\\tcame in Madinah. In such a case it would imply a subtle\\n\\t\\t\\t\\tdisapproval of the use of intoxicants and mark the first\\n\\t\\t\\t\\tof a series of steps that in time culminated in total\\n\\t\\t\\t\\tprohibition."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "68",
    "NoteID": "2097",
    "Body": "Auha: wahyun ordinarily means inspiration, the Message\\n\\t\\t\\t\\tput into the mind or heart by Allah. Here the Bee's\\n\\t\\t\\t\\tinstinct is referred to Allah's teaching, which it\\n\\t\\t\\t\\tundoubtedly is. In xcix. 5, it is applied to the earth;\\n\\t\\t\\t\\twe shall discuss the precise meaning when we come to that\\n\\t\\t\\t\\tpassage. The honey-comb, itself, with its hexagonal\\n\\t\\t\\t\\tcells, geometrically perfect, is a wonderful structure,\\n\\t\\t\\t\\tand is well called buyut, homes. And the way the bee\\n\\t\\t\\t\\tfinds out inaccessible places, in the hills, in the\\n\\t\\t\\t\\ttrees, and even among the habitations of men, is one of\\n\\t\\t\\t\\tthe marvels of Allah's working in His Creation."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "69",
    "NoteID": "2098",
    "Body": "The bee assimilates the juice of various kinds of flowers\\n\\t\\t\\t\\tand fruit, and forms within its body the honey which it\\n\\t\\t\\t\\tstores in its cells of wax. The different kinds of food\\n\\t\\t\\t\\tfrom which it makes its honey give different colours to\\n\\t\\t\\t\\tthe honey, e.g., it is dark-brown, light-brown, yellow,\\n\\t\\t\\t\\twhite, and so on. The taste and flavour also varies, as\\n\\t\\t\\t\\tin the case of heather honey, the honey formed from\\n\\t\\t\\t\\tscented flowers, and so on. As food it is sweet and\\n\\t\\t\\t\\twholesome, and it is used in medicine. Note that while\\n\\t\\t\\t\\tthe instinctive individual acts are described in the\\n\\t\\t\\t\\tsingular number, the produce of \"their bodies\" is\\n\\t\\t\\t\\tdescribed in the plural, as the result of their\\n\\t\\t\\t\\tcollective effort."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "69",
    "NoteID": "2099",
    "Body": "Zululan: two meanings are possible; (1) ways easy and\\n\\t\\t\\t\\tspacious, referring to the unerring way in which bees\\n\\t\\t\\t\\tfind their way from long distances to their combs; and\\n\\t\\t\\t\\t(2) the idea of humility and obedience in them."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "70",
    "NoteID": "2100",
    "Body": "Besides the mystery and beauty of the many processes\\n\\t\\t\\t\\tgoing on in the working of Allah's Creation, there is the\\n\\t\\t\\t\\twonderful life of man himself on this earth; how he is\\n\\t\\t\\t\\tcreated as a child; how he grows in intelligence and\\n\\t\\t\\t\\tknowledge; and how his soul is taken back and his body\\n\\t\\t\\t\\tsuffers dissolution. In some cases he lives so long that\\n\\t\\t\\t\\the falls into a feeble old age like a second childhood;\\n\\t\\t\\t\\the forgets what he learnt and seems almost to go back in\\n\\t\\t\\t\\tTime. Is not all this wonderful, and evidence of the\\n\\t\\t\\t\\tKnowledge and Power of Allah?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "70",
    "NoteID": "2101",
    "Body": "Our attention having been called to the remarkable\\n\\t\\t\\t\\ttransformations in life and nature, by which the\\n\\t\\t\\t\\tKnowledge and Power of Allah work out His beneficient\\n\\t\\t\\t\\tPlan for His creatures, we are reminded that man at best\\n\\t\\t\\t\\tis but a feeble creature, but for the grace of Allah. We\\n\\t\\t\\t\\tthen pass on in the next Section to the differences in\\n\\t\\t\\t\\tthe gifts which men themselves enjoy, distinguishing them\\n\\t\\t\\t\\tinto so many categories. How much greater is the\\n\\t\\t\\t\\tdifference between the created things and their Creator?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "71",
    "NoteID": "2102",
    "Body": "Even in the little differences in gifts, which men enjoy\\n\\t\\t\\t\\tfrom Allah, men with superior gifts are not going to\\n\\t\\t\\t\\tabandon them so as to be equal with men of inferior\\n\\t\\t\\t\\tgifts, whom, perhaps, they hold in subjection. They will\\n\\t\\t\\t\\tnever deny their own superiority. How then (as the\\n\\t\\t\\t\\targument is pursued in the two following verses), can\\n\\t\\t\\t\\tthey ignore the immense difference between the Creator\\n\\t\\t\\t\\tand created things, and make the latter, in their\\n\\t\\t\\t\\tthoughts, partners with Allah?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "72",
    "NoteID": "2103",
    "Body": "Of your nature: or of yourselves. Cf. iv. 1 and n. 504,\\n\\t\\t\\t\\tSelf, or Personality, or Soul, all imply a bundle of\\n\\t\\t\\t\\tattributes, capacities, predilections, and dispositions,\\n\\t\\t\\t\\twhich we may sum up in the word Nafs, or nature. Woman\\n\\t\\t\\t\\twas made to be (1) a mate or companion for man; (2)\\n\\t\\t\\t\\texcept for sex, of the same nature as man, and therefore,\\n\\t\\t\\t\\twith the same moral and religious rights and duties; and\\n\\t\\t\\t\\t(3) she is not to be considered a source of all evil or\\n\\t\\t\\t\\tsin, as the Christian monks characterised her but rather\\n\\t\\t\\t\\tas a blessing, one of the favours (Ni'mat) of Allah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "72",
    "NoteID": "2104",
    "Body": "Hafadat: collective plural, grandchildren, and\\n\\t\\t\\t\\tdescendants. The root hafada also implies obedient\\n\\t\\t\\t\\tservice and ministration. Just as the sons (first\\n\\t\\t\\t\\tmentioned) should be a source of strength, so daughters\\n\\t\\t\\t\\tand grandchildren should serve and contribute to the\\n\\t\\t\\t\\thappiness of fathers and grandparents, and are to be\\n\\t\\t\\t\\tlooked upon as further blessings."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "73",
    "NoteID": "2105",
    "Body": "\"Sustenance\" (rizq) in all this passage (xvi. 65-74), as\\n\\t\\t\\t\\telsewhere, implies all that is necessary for man's life\\n\\t\\t\\t\\tand growth, physical, mental, moral, and spiritual. Milk,\\n\\t\\t\\t\\tfruit, and honey are examples of physical gifts, with a\\n\\t\\t\\t\\tmetaphorical reference to mental and moral health; family\\n\\t\\t\\t\\tlife is an example of moral and social and (ultimately)\\n\\t\\t\\t\\tspiritual opportunities in the life of man; and in xvi.\\n\\t\\t\\t\\t65 is an example of rain in the physical world as a type\\n\\t\\t\\t\\tof Allah's revelation in the spiritual world."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "74",
    "NoteID": "2106",
    "Body": "Cf. xvi. 60 above, and n. 2086. One instance of false\\n\\t\\t\\t\\tsimilitudes is where Pagans say their gods are mere types\\n\\t\\t\\t\\tof symbols, or where men pray to men as Intercessors."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "75",
    "NoteID": "2107",
    "Body": "The first parable is of two men, one of whom is a slave\\n\\t\\t\\t\\tcompletely under the dominion of another, with no powers\\n\\t\\t\\t\\tof any sort, and another a free man, who is gifted in\\n\\t\\t\\t\\tevery way, and is most generous in bestowing out of his\\n\\t\\t\\t\\topulent wealth (material as well as intangible),\\n\\t\\t\\t\\tprivately and publicly, without let or hindrance; for he\\n\\t\\t\\t\\tis his own master and owes no account to any one. The\\n\\t\\t\\t\\tfirst is like the imaginary gods which men set\\n\\t\\t\\t\\tup,-whether powers of nature, which have no independent\\n\\t\\t\\t\\texistence but are manifestations of Allah, or deified\\n\\t\\t\\t\\theroes or men, who can do nothing of their own authority\\n\\t\\t\\t\\tbut are subject to the Will and Power of Allah; the\\n\\t\\t\\t\\tsecond describes in a faint way the position of Allah,\\n\\t\\t\\t\\tthe Self-Subsistent, to Whom belongs the dominion of all\\n\\t\\t\\t\\tthat is in heaven and earth, and Who bestows freely of\\n\\t\\t\\t\\tHis gifts on all His creatures."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "76",
    "NoteID": "2108",
    "Body": "In the second Parable, one man is dumb; he can explain\\n\\t\\t\\t\\tnothing, and he can certainly do nothing; he is only a\\n\\t\\t\\t\\twearisome burden to his master, no matter what his master\\n\\t\\t\\t\\tasks him to do; or perhaps he is really harmful instead\\n\\t\\t\\t\\tof bringing any good; such are idols (literal and\\n\\t\\t\\t\\tmetaphorical) when taken as false gods. The other man is\\n\\t\\t\\t\\tin a position to command, and he commands what is just\\n\\t\\t\\t\\tand righteous; not only his commands but his doings also\\n\\t\\t\\t\\tare on the path of righteousness. Such are the qualities\\n\\t\\t\\t\\tof Allah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "76",
    "NoteID": "2109",
    "Body": "The gist of the argument is that those who deviate from\\n\\t\\t\\t\\tthe worship of Allah commit twofold treason. (1) They do\\n\\t\\t\\t\\tnot recognise the immense difference between the Creator\\n\\t\\t\\t\\tand created things, although, in their own little selfish\\n\\t\\t\\t\\tlives, they are tenacious of any little differences there\\n\\t\\t\\t\\tmay be between themselves and other fellow-creatures not\\n\\t\\t\\t\\tso gifted. (2) They are guilty of gross ingratitude in\\n\\t\\t\\t\\tforgetting that the source of goodness and power is\\n\\t\\t\\t\\tAllah, to Whom alone they owe all the gifts they enjoy in\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "77",
    "NoteID": "2110",
    "Body": "The key to all things-not only those which we see and\\n\\t\\t\\t\\tunderstand, but those which we do not see or of which we\\n\\t\\t\\t\\thave no idea-is with Allah, Whose knowledge and power are\\n\\t\\t\\t\\tsupreme."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "77",
    "NoteID": "2111",
    "Body": "Lures of this world and its fleeting pleasures often make\\n\\t\\t\\t\\tman forget that the life hereafter is an imminent\\n\\t\\t\\t\\treality. Many of those who claim to believe in the life\\n\\t\\t\\t\\tto come act and behave as if it belonged to a distant\\n\\t\\t\\t\\tfuture, and had no relevance to their present activities\\n\\t\\t\\t\\tand mode of living. The Qur-An repeatedly reminds man\\n\\t\\t\\t\\tthat the Hour of Reckoning is not a distant possibility,\\n\\t\\t\\t\\tbut very close to man, and could come to pass any moment.\\n\\t\\t\\t\\tThe wisest course for man, therefore, is to be always\\n\\t\\t\\t\\talert and watchful and steer clear of all forms of sin\\n\\t\\t\\t\\tand impiety, for when the Promised Hour comes it will\\n\\t\\t\\t\\tcome all of a sudden and without any prior notice. See\\n\\t\\t\\t\\talso x. 45; xxx. 55, xlv. 35."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "78",
    "NoteID": "2112",
    "Body": "Literally, 'hearts,' which are considered the centres of\\n\\t\\t\\t\\tthe affections, and in Arabic idiom, of intelligence\\n\\t\\t\\t\\talso. We should therefore give thanks to Allah, not to\\n\\t\\t\\t\\timaginary deities or powers or forces."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "79",
    "NoteID": "2113",
    "Body": "All the wonderful things in creation are due to the\\n\\t\\t\\t\\tartistry, power, and wisdom of Allah. Such is the flight\\n\\t\\t\\t\\tof birds in mid-air. So also are the inventions and\\n\\t\\t\\t\\tdiscoveries, due to man's intelligence, in the next\\n\\t\\t\\t\\tverse; for man's intelligence is a gift direct from\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "80",
    "NoteID": "2114",
    "Body": "Man's social, intellectual, and spiritual gifts make, of\\n\\t\\t\\t\\this permanent dwellings, homes of rest and quiet, of\\n\\t\\t\\t\\trefinement and the purer affections, which are the types,\\n\\t\\t\\t\\tin this earthly life, of the highest spiritual Good, the\\n\\t\\t\\t\\tlove of Allah. The pure Home thus becomes the type of the\\n\\t\\t\\t\\thighest spiritual Destiny of man. And these capacities in\\n\\t\\t\\t\\tman are the gifts of Allah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "80",
    "NoteID": "2115",
    "Body": "When man travels, he wants temporary dwellings, tents,\\n\\t\\t\\t\\twhich he can make of the skins of animals, or of the\\n\\t\\t\\t\\tfabrics of vegetable fibres, similar to the skins of\\n\\t\\t\\t\\tanimals. These tents are easy to carry when moving, and\\n\\t\\t\\t\\teasy to pitch during halts."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "80",
    "NoteID": "2116",
    "Body": "Suf, wool, is what we get from sheep. Sha'r, hair, is\\n\\t\\t\\t\\twhat we get from goats or similar animals, for weaving\\n\\t\\t\\t\\tinto fabrics. Wabar is the soft camel's hair of which,\\n\\t\\t\\t\\talso, fabrics are woven; they may be considered\\n\\t\\t\\t\\tintermediate between the other two; by extension and\\n\\t\\t\\t\\tanalogy the term may be applied to furs and such things,\\n\\t\\t\\t\\tby way of illustration."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "80",
    "NoteID": "2117",
    "Body": "All such articles of refined luxury, and useful articles\\n\\t\\t\\t\\tof comfort and convenience only last for a while, but\\n\\t\\t\\t\\tthey must be considered as Allah's gifts."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "81",
    "NoteID": "2118",
    "Body": "For example, trees, gardens, the roofs of houses; also\\n\\t\\t\\t\\tfrom another point of view, the fact that the sun's rays\\n\\t\\t\\t\\tat various times and in various parts of the earth, come\\n\\t\\t\\t\\tobliquely, thus causing shadow along with sunshine. In\\n\\t\\t\\t\\tthe hills there are caves and grottoes."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "81",
    "NoteID": "2119",
    "Body": "Our clothes protect us from heat and cold, just as our\\n\\t\\t\\t\\tarmour protects us from the hurt which we might otherwise\\n\\t\\t\\t\\treceive in battle."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "81",
    "NoteID": "2120",
    "Body": "All these blessings, which have both a physical and (by\\n\\t\\t\\t\\tpromoting the good of man) a spiritual purpose, should\\n\\t\\t\\t\\tteach us to rally to Allah and tune our will with His\\n\\t\\t\\t\\tUniversal Will, which is another name for Islam."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "83",
    "NoteID": "2121",
    "Body": "'Arafa is distinguished from 'alima is implying a\\n\\t\\t\\t\\tspecific discernment (or recognition) of various\\n\\t\\t\\t\\tqualities and uses. All mankind recognised the value of\\n\\t\\t\\t\\tthe blessings they enjoy, but in forgetting or disobeying\\n\\t\\t\\t\\ttheir Author, the wicked show gross ingratitude; for in\\n\\t\\t\\t\\tpractice they deny their obligation to Him for those\\n\\t\\t\\t\\tblessings."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "84",
    "NoteID": "2122",
    "Body": "To each People is sent Allah's Messenger or Teacher, to\\n\\t\\t\\t\\tpoint out the right way. There may be one, or there may\\n\\t\\t\\t\\tbe many. Such a Messenger (Rasul) will be a witness that\\n\\t\\t\\t\\tAllah's Truth was preached to all peoples in express\\n\\t\\t\\t\\tterms, in addition to the Signs of Allah everywhere in\\n\\t\\t\\t\\tnature. There will then be no room for excuses of any\\n\\t\\t\\t\\tkind. Those who rejected Allah after repeated warnings\\n\\t\\t\\t\\tcannot reasonably ask for more respite, as they had every\\n\\t\\t\\t\\tkind of respite during their life of probation; nor can\\n\\t\\t\\t\\tthey now take refuge behind Allah's Grace, which they had\\n\\t\\t\\t\\trepeatedly rejected. A) That is, they will not be allowed\\n\\t\\t\\t\\tto seek grace by repentance. Cf. xxx. 57, xlv. 35."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "85",
    "NoteID": "2123",
    "Body": "When the terrible Penalty is actually on them, it is too\\n\\t\\t\\t\\tlate for repentance and for asking for Mercy. Justice\\n\\t\\t\\t\\tmust take its course."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "86",
    "NoteID": "2124",
    "Body": "The worshippers of false gods will try to shift the\\n\\t\\t\\t\\tresponsibility from their own shoulders to that of the\\n\\t\\t\\t\\tfalse gods. They will suggest (though they will not have\\n\\t\\t\\t\\tthe courage for such a bare-faced lie) that they were\\n\\t\\t\\t\\tmisled by the false gods. But their lying suggestion will\\n\\t\\t\\t\\tbe contradicted and thrown back at them as explained in\\n\\t\\t\\t\\tthe next note."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "87",
    "NoteID": "2125",
    "Body": "In so far as the false gods were real things, such as\\n\\t\\t\\t\\tdeified men or forces of nature, they will openly\\n\\t\\t\\t\\tdisclaim them and then (as always) show their submission\\n\\t\\t\\t\\tto Allah. In so far as the false gods were the invention\\n\\t\\t\\t\\tof the fancy of the idolaters, they will leave their\\n\\t\\t\\t\\tworshippers in the lurch, for they will be shown as\\n\\t\\t\\t\\tnon-existent."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "89",
    "NoteID": "2126",
    "Body": "To the thought expressed in xvi. 84 above, is added\\n\\t\\t\\t\\tanother detail here. Not only will there be witnesses\\n\\t\\t\\t\\tfrom Peoples, but the witnesses will be men from amongst\\n\\t\\t\\t\\tthe Peoples themselves, men of their own kith and kin,\\n\\t\\t\\t\\twho understood them and explained Allah's Message in\\n\\t\\t\\t\\ttheir own language. The Prophet Muhammad will be witness\\n\\t\\t\\t\\tagainst all those who rejected the Message he brought.\\n\\t\\t\\t\\tFor those who believe in him of (all races and peoples),\\n\\t\\t\\t\\tthe Book which he brought will be an explanation, a\\n\\t\\t\\t\\tguide, a mercy and a Gospel."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "90",
    "NoteID": "2127",
    "Body": "Justice is a comprehensive term, and may include all the\\n\\t\\t\\t\\tvirtues of cold philosophy. But religion asks for\\n\\t\\t\\t\\tsomething warmer and more human, the doing of good deeds\\n\\t\\t\\t\\teven where perhaps they are not strictly demanded by\\n\\t\\t\\t\\tjustice, such as returning good for ill, or obliging\\n\\t\\t\\t\\tthose who in worldly language \"have no claim\" on you; and\\n\\t\\t\\t\\tof course a fortiori the fulfilling of the claims of\\n\\t\\t\\t\\tthose whose claims are recognised in social life.\\n\\t\\t\\t\\tSimilarly the opposites are to be avoided; everything\\n\\t\\t\\t\\tthat is recognised as shameful, and everything that is\\n\\t\\t\\t\\treally unjust, and any inward rebellion against Allah's\\n\\t\\t\\t\\tLaw or our own conscience in its most sensitive form."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "91",
    "NoteID": "2128",
    "Body": "The immediate reference may or may not be to the oath of\\n\\t\\t\\t\\tfidelity to the Prophet taken at 'Aqaba fourteen months\\n\\t\\t\\t\\tbefore the Hijra and repeated a little later: see v. 7,\\n\\t\\t\\t\\tand n. 705. But the general meaning is much wider. And\\n\\t\\t\\t\\tthis may be viewed in two aspects (1) Every oath taken,\\n\\t\\t\\t\\tor covenant made, is a Covenant before Allah, and should\\n\\t\\t\\t\\tbe faithfully observed. In this it approaches in meaning\\n\\t\\t\\t\\tto v. 1. (2) In particular, every Muslim makes, by the\\n\\t\\t\\t\\tprofession, of his Faith, a Covenant with Allah, and he\\n\\t\\t\\t\\tconfirms that Covenant every time he repeats that\\n\\t\\t\\t\\tprofession. He should therefore faithfully observe the\\n\\t\\t\\t\\tduties taught to him by Islam."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "92",
    "NoteID": "2129",
    "Body": "The Covenant which binds us in the spiritual world makes\\n\\t\\t\\t\\tus strong, like strands of fluffy cotton spun into a\\n\\t\\t\\t\\tstrong thread. It also gives us a sense of security\\n\\t\\t\\t\\tagainst much evil in this world. It costs a woman much\\n\\t\\t\\t\\tlabour and skill to spin good strong yarn. She would be\\n\\t\\t\\t\\tfoolish indeed, after she has spun such yam, to untwist\\n\\t\\t\\t\\tits constituent strands and break them into flimsy\\n\\t\\t\\t\\tpieces."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "92",
    "NoteID": "2130",
    "Body": "Here tattakhithun is used as an adverb to qualify the\\n\\t\\t\\t\\tnegative command takunu at the beginning of the verse."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "92",
    "NoteID": "2131",
    "Body": "Do not make your religion merely a game of making your\\n\\t\\t\\t\\town party numerically strong by alliances cemented by\\n\\t\\t\\t\\toaths, which you readily break when a more numerous party\\n\\t\\t\\t\\toffers you its alliance. The Quraish were addicted to\\n\\t\\t\\t\\tthis vice, and in international politics at the present\\n\\t\\t\\t\\tday, this seems to be almost a standard of national\\n\\t\\t\\t\\tself-respect and international skill. Islam teaches\\n\\t\\t\\t\\tnobler ethics for individuals and nations. A Covenant\\n\\t\\t\\t\\tshould be looked upon as a solemn thing, not to be\\n\\t\\t\\t\\tentered into except with the sincerest intention of\\n\\t\\t\\t\\tcarrying it out; and it is binding even if large numbers\\n\\t\\t\\t\\tare ranged against it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "92",
    "NoteID": "2132",
    "Body": "Disagreements need not necessarily cause conflict where\\n\\t\\t\\t\\tthe parties are sincere and honest and do not wish to\\n\\t\\t\\t\\ttake advantage of one another. In such cases they do not\\n\\t\\t\\t\\tgo by numbers, groupings, and alliances, but by just\\n\\t\\t\\t\\tconduct as in the sight of Allah. Honest differences will\\n\\t\\t\\t\\tbe removed when all things are made clear in the\\n\\t\\t\\t\\tHereafter."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "93",
    "NoteID": "2133",
    "Body": "Cf. xiv. 4 and n. 1875. Allah's Will and Plan, in\\n\\t\\t\\t\\tallowing limited free-will to man, is, not to force man's\\n\\t\\t\\t\\twill, but to give all guidance, and leave alone those who\\n\\t\\t\\t\\treject that guidance, in case they should repent and come\\n\\t\\t\\t\\tback into Grace. But in all cases, in so far as we are\\n\\t\\t\\t\\tgiven the choice, we shall be called to account for all\\n\\t\\t\\t\\tour actions. \"Leaving to stray\" does not mean that we can\\n\\t\\t\\t\\tdo what we please. Our personal responsibility remains."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "94",
    "NoteID": "2134",
    "Body": "In xvi. 92, above, the motive for false and fraudulent\\n\\t\\t\\t\\tcovenants was pointed out with reprobation. Now are\\n\\t\\t\\t\\tpointed out the consequences, viz., (1) to others, if\\n\\t\\t\\t\\tthey had not been deceived, they might have walked firmly\\n\\t\\t\\t\\ton the Path, but now they lose faith and perhaps commit\\n\\t\\t\\t\\tlike frauds for which you will be responsible; (2) to\\n\\t\\t\\t\\tyourselves; you have not only gone wrong yourselves; but\\n\\t\\t\\t\\thave set others on the wrong path; and you deserve a\\n\\t\\t\\t\\tdouble Penalty. Perhaps the \"evil consequences\" refer to\\n\\t\\t\\t\\tthis world, and the \"Wrath\" to the Hereafter."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "95",
    "NoteID": "2135",
    "Body": "Any possible gain that you can make by breaking your\\n\\t\\t\\t\\tCovenant and thus breaking Allah's Law must necessarily\\n\\t\\t\\t\\tbe miserable; while your own benefit is far greater in\\n\\t\\t\\t\\tobeying Allah's Will and doing right."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "96",
    "NoteID": "2136",
    "Body": "What comparison can there possibly be between spiritual\\n\\t\\t\\t\\tGood, which will endure forever, and any temporal\\n\\t\\t\\t\\tadvantage which you may snatch in this world, which will\\n\\t\\t\\t\\tfade and vanish in no time? And then, Allah's generosity\\n\\t\\t\\t\\tis unbounded. He rewards you, not acording to your\\n\\t\\t\\t\\tmerits, but according to the very best of your actions."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "97",
    "NoteID": "2137",
    "Body": "Faith, if sincere, means right conduct. When these two\\n\\t\\t\\t\\tconfirm each other, Allah's grace transforms our life.\\n\\t\\t\\t\\tInstead of being troubled and worried, we have peace and\\n\\t\\t\\t\\tcontentment; instead of being assailed at every turn by\\n\\t\\t\\t\\tfalse alarms and the assaults of evil, we enjoy calm and\\n\\t\\t\\t\\tattain purity. The transformation is visible in this life\\n\\t\\t\\t\\titself, but the \"reward\" in terms of the Hereafter will\\n\\t\\t\\t\\tbe far beyond our deserts."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "97",
    "NoteID": "2138",
    "Body": "The same ending as in the previous verse deepens the\\n\\t\\t\\t\\toverall effect bringing home the message forcefully and\\n\\t\\t\\t\\tbeautifully. The argument is completed and rounded off."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "98",
    "NoteID": "2139",
    "Body": "Evil has no authority or influence on those who put their\\n\\t\\t\\t\\ttrust in Allah. It is good to express that trust in\\n\\t\\t\\t\\toutward actions, and a formal expression of it-as in the\\n\\t\\t\\t\\tformula, \"I seek Allah's protection from Evil\"-helps us.\\n\\t\\t\\t\\tMan is weak at best, and he should seek strength for his\\n\\t\\t\\t\\twill in Allah's help and protection."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "101",
    "NoteID": "2140",
    "Body": "See ii. 106, and n. 107. The doctrine of progressive\\n\\t\\t\\t\\trevelation from age to age and time to time does not mean\\n\\t\\t\\t\\tthat Allah's fundamental Law changes. It is not fair to\\n\\t\\t\\t\\tcharge a Prophet of Allah with forgery because the\\n\\t\\t\\t\\tMessage as revealed to him is in a different form from\\n\\t\\t\\t\\tthat revealed before, when the core of the Truth is the\\n\\t\\t\\t\\tsame, for it comes from Allah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "102",
    "NoteID": "2141",
    "Body": "The title of the Angel Gabriel, through whom the\\n\\t\\t\\t\\trevelations came down."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "102",
    "NoteID": "2142",
    "Body": "The People of the Book, if they had true faith, were\\n\\t\\t\\t\\tthemselves strengthened in their faith and cleared of\\n\\t\\t\\t\\ttheir doubts and difficulties by the revelations brought\\n\\t\\t\\t\\tby Al-Mustafa; and all whether People of the Book or\\n\\t\\t\\t\\tnot-who came within the fold of Islam, found the Qur-an a\\n\\t\\t\\t\\tGuide and a Gospel, i.e., a substitute for the Mosaic Law\\n\\t\\t\\t\\tand for the Christian Gospel, which had both been\\n\\t\\t\\t\\tcorrupted."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "103",
    "NoteID": "2143",
    "Body": "The wicked attribute to Prophets of Allah just such\\n\\t\\t\\t\\tmotives and springs of action as they themselves would be\\n\\t\\t\\t\\tguilty of in such circumstances. The Pagans and those who\\n\\t\\t\\t\\twere hostile to the revelation of Allah in Islam could\\n\\t\\t\\t\\tnot and cannot understand how such wonderful words could\\n\\t\\t\\t\\tflow from the tongue of the Holy Prophet. They must need\\n\\t\\t\\t\\tto postulate some human teacher. Unfortunately for their\\n\\t\\t\\t\\tpostulate, any possible human teacher they could think of\\n\\t\\t\\t\\twould be poor in Arabic speech if he had all the\\n\\t\\t\\t\\tknowledge that the Qur-an reveals of previous\\n\\t\\t\\t\\trevelations. Apart from that, even the most eloquent Arab\\n\\t\\t\\t\\tcould not, and cannot, produce anything of the eloquence,\\n\\t\\t\\t\\twidth, and depth of Quranic teaching, as is evident from\\n\\t\\t\\t\\tevery verse of the Book."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "105",
    "NoteID": "2144",
    "Body": "It is clearly those who raise the cry of forgery that are\\n\\t\\t\\t\\tguilty of falsehood, as there is not the least basis or\\n\\t\\t\\t\\teven plausibility in their suggestion."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "106",
    "NoteID": "2145",
    "Body": "The exception refers to a case like that of 'Ammar, whose\\n\\t\\t\\t\\tfather Yasir and mother Sumayya, were subjected to\\n\\t\\t\\t\\tunspeakable tortures for their belief in Islam, but never\\n\\t\\t\\t\\trecanted. 'Ammar, suffering under tortures himself and\\n\\t\\t\\t\\this mind acted on by the sufferings of his parents,\\n\\t\\t\\t\\tuttered a word construed as recantation, though his heart\\n\\t\\t\\t\\tnever wavered and he came back at once to the Prophet,\\n\\t\\t\\t\\twho consoled him for his pain and confirmed his faith."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "108",
    "NoteID": "2146",
    "Body": "Cf. ii. 7. On account of their iniquities and their want\\n\\t\\t\\t\\tof Faith their hearts and their senses become impervious\\n\\t\\t\\t\\tto Allah's grace, and they run headlong to perdition."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "110",
    "NoteID": "2147",
    "Body": "I take this verse to refer to such men as were originally\\n\\t\\t\\t\\twith the Pagans but afterwards joined Islam, suffered\\n\\t\\t\\t\\thardships and exile, and fought and struggled in the\\n\\t\\t\\t\\tCause, with patience and constance. Their past would be\\n\\t\\t\\t\\tblotted out and forgiven. Men like Khalid ibn Walid were\\n\\t\\t\\t\\tnumbered with the foremost heroes of Islam. In that case\\n\\t\\t\\t\\tthis verse would be a Madinah verse, though the Sura as a\\n\\t\\t\\t\\twhole is Makkan. Perhaps it would be better to read, with\\n\\t\\t\\t\\tsome Commentators, fatanu in the active voice rather than\\n\\t\\t\\t\\tfutinu in the passive voice, and translate \"after\\n\\t\\t\\t\\tinflicting trials and persecutions (on Muslim).\" Notice\\n\\t\\t\\t\\tthe parallelism in construction between this verse and\\n\\t\\t\\t\\tverse 119 below."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "111",
    "NoteID": "2148",
    "Body": "When the Reckoning comes, each soul will stand on its own\\n\\t\\t\\t\\tpersonal responsibility. No one else can help it. Full\\n\\t\\t\\t\\tjustice will be done, and all the seeming inequalities of\\n\\t\\t\\t\\tthis world will be redressed."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "112",
    "NoteID": "2149",
    "Body": "The reference may be to any of the cities or populations\\n\\t\\t\\t\\tin ancient or modern times, which were favoured with\\n\\t\\t\\t\\tsecurity and other blessings from Allah, but which\\n\\t\\t\\t\\trebelled from Allah's Law and tasted the inevitable\\n\\t\\t\\t\\tpenalty, even in the midst of their iniquities. Some\\n\\t\\t\\t\\tCommentators see here a reference to the city of Makkah\\n\\t\\t\\t\\tunder Pagan control. See next note."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "112",
    "NoteID": "2150",
    "Body": "There is a double metaphor: (1) the tasting of hunger and\\n\\t\\t\\t\\tterror after the abundant supplies and the full security\\n\\t\\t\\t\\twhich it had enjoyed; and (2) the complete enfolding of\\n\\t\\t\\t\\tthe City as with a garment, by these two scourges, hunger\\n\\t\\t\\t\\tand a state of subjective alarm. If the reference is to\\n\\t\\t\\t\\tMakkah shortly before its fall to the Muslims, the\\n\\t\\t\\t\\t\"hunger\" was the seven years' severe famine which\\n\\t\\t\\t\\tafflicted it, and the alarm was the constant fear in the\\n\\t\\t\\t\\tminds of the Pagans that their day was done. Peace and\\n\\t\\t\\t\\tprosperity were restored after the re-entry of the\\n\\t\\t\\t\\tProphet."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "114",
    "NoteID": "2151",
    "Body": "Ingratitude for Allah's sustenance (in the literal and\\n\\t\\t\\t\\tfigurative senses) may be shown in various ways, e.g.,\\n\\t\\t\\t\\t(1) by forgetting or refusing to acknowledge the true\\n\\t\\t\\t\\tsource of the bounty, viz., Allah, (2) by misusing or\\n\\t\\t\\t\\tmisapplying the bounty, as by committing excesses in\\n\\t\\t\\t\\tthings lawful, or refusing to share them with others of\\n\\t\\t\\t\\tAllah's creatures when the need arises, or (3) by falsely\\n\\t\\t\\t\\tascribing to Allah any prohibitions we may set up for\\n\\t\\t\\t\\tourselves for special reasons or because of our special\\n\\t\\t\\t\\tidiosyncrasies."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "115",
    "NoteID": "2152",
    "Body": "Cf. ii. 173 and notes, v. 3-4, and vi. 121 and 138-146."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "116",
    "NoteID": "2153",
    "Body": "Men are apt to create taboos for themselves, out of\\n\\t\\t\\t\\tsuperstition, and often for selfish ends, and enforce\\n\\t\\t\\t\\tthem in the name of religion. Nothing can be more\\n\\t\\t\\t\\treprehensible."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "118",
    "NoteID": "2154",
    "Body": "See vi. 146 and n. The further prohibitions to them were\\n\\t\\t\\t\\ta punishment for their hardness of hearts, and not a\\n\\t\\t\\t\\tfavour."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "119",
    "NoteID": "2155",
    "Body": "See above, xvi. 110 and n. 2147. The parallelism in\\n\\t\\t\\t\\tconstruction confirms the suggestion of the alternative\\n\\t\\t\\t\\treading which is made in that note. The similarity of\\n\\t\\t\\t\\texpressions also rounds off the argument, as by a refrain\\n\\t\\t\\t\\tin poetry. What follows now in this Sura is an\\n\\t\\t\\t\\texhortation to right conduct."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "120",
    "NoteID": "2156",
    "Body": "Ummat: a model, pattern, example for imitation; but the\\n\\t\\t\\t\\tidea that he was an Ummat in himself, standing alone\\n\\t\\t\\t\\tagainst his world, should not be lost sight of. See next\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "120",
    "NoteID": "2157",
    "Body": "The Gospel of Unity has been the comer-stone of spiritual\\n\\t\\t\\t\\tTruth for all time. In this respect Abraham is the model\\n\\t\\t\\t\\tand fountain-head for the world of western Asia and its\\n\\t\\t\\t\\tspiritual descendants all over the world. Abraham was\\n\\t\\t\\t\\tamong a people (the Chaldeans) who worshipped stars and\\n\\t\\t\\t\\thad forsaken the Gospel of Unity. He was among them but\\n\\t\\t\\t\\tnot of them. He suffered persecution, and left his home\\n\\t\\t\\t\\tand his people, and settled in the land of Canaan."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "122",
    "NoteID": "2158",
    "Body": "Cf. ii. 113."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "124",
    "NoteID": "2159",
    "Body": "If Abraham's Way was the right way, the Jews were ready\\n\\t\\t\\t\\twith the taunt, \"Why don't you then observe the Sabbath?\"\\n\\t\\t\\t\\tThe answer is twofold. (1) The Sabbath has nothing to do\\n\\t\\t\\t\\twith Abraham. It was instituted with the Law of Moses\\n\\t\\t\\t\\tbecause of Israel's hardness of heart (ii. 74); for they\\n\\t\\t\\t\\tconstantly disputed with their Prophet Moses (iii 108),\\n\\t\\t\\t\\tand there were constantly among them afterwards men who\\n\\t\\t\\t\\tbroke the Sabbath (ii. 65, and n. 79). (2) Which was the\\n\\t\\t\\t\\ttrue Sabbath Day? The Jews observe Saturday. The\\n\\t\\t\\t\\tChristians, who include the Old Testament in their\\n\\t\\t\\t\\tinspired Scripture, observe Sunday, and a sect among them\\n\\t\\t\\t\\t(the Seventh Day Adventists) disagree, and observe\\n\\t\\t\\t\\tSaturday. So there is disagreement among the People of\\n\\t\\t\\t\\tthe Book. Let them dispute among themselves. Their\\n\\t\\t\\t\\tdispute will not be settled till the Day of Judgment.\\n\\t\\t\\t\\tMeanwhile, Muslims are emancipated from such stringent\\n\\t\\t\\t\\trestrictions. For them there is certainly the Day of\\n\\t\\t\\t\\tUnited Prayer on Friday, but it is in no sense like the\\n\\t\\t\\t\\tJewish or the Scotch Sabbath!"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "124",
    "NoteID": "2160",
    "Body": "Cf. ii. 113."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "125",
    "NoteID": "2161",
    "Body": "In this wonderful passage are laid down principles of\\n\\t\\t\\t\\treligious preaching, which are good for all time. But\\n\\t\\t\\t\\twhere are the Teachers with such qualifications? We must\\n\\t\\t\\t\\tinvite all to the Way of Allah, and expound His Universal\\n\\t\\t\\t\\tWill; we must do it with wisdom and discretion, meeting\\n\\t\\t\\t\\tpeople on their own ground and convincing them with\\n\\t\\t\\t\\tillustrations from their own knowledge and experience,\\n\\t\\t\\t\\twhich may be very narrow, or very wide. Our preaching\\n\\t\\t\\t\\tmust be, not dogmatic, not self-regarding, not offensive,\\n\\t\\t\\t\\tbut gentle, considerate, and such as would attract their\\n\\t\\t\\t\\tattention. Our manner and our arguments should not be\\n\\t\\t\\t\\tacrimonious, but modelled on the most courteous and the\\n\\t\\t\\t\\tmost gracious example, so that the hearer may say to\\n\\t\\t\\t\\thimself, \"This man is not dealing merely with dialectics;\\n\\t\\t\\t\\the is not trying to get a rise out of me; he is sincerely\\n\\t\\t\\t\\texpounding the faith that is in him, and his motive is\\n\\t\\t\\t\\tthe love of man and the love of Allah.\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "125",
    "NoteID": "2162",
    "Body": "It may be that the Preacher sometimes says to himself,\\n\\t\\t\\t\\t\"What is the use of teaching these people? they have made\\n\\t\\t\\t\\tup their minds, or they are obstinate; or they are only\\n\\t\\t\\t\\ttrying to catch me out,\" Let him not yield to such a\\n\\t\\t\\t\\tthought. Who knows how the seed of the Word of Allah may\\n\\t\\t\\t\\tgerminate in people's minds? It is not for man to look\\n\\t\\t\\t\\tfor results. Man's inner thoughts are known best to\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "126",
    "NoteID": "2163",
    "Body": "In the context this passage refers to controversies and\\n\\t\\t\\t\\tdiscussions, but the words are wide enough to cover all\\n\\t\\t\\t\\thuman struggles, disputes, and fights. In strictest\\n\\t\\t\\t\\tequity you are not entitled to give a worse blow than is\\n\\t\\t\\t\\tgiven to you. Lest you should think that such patience\\n\\t\\t\\t\\tonly gives an advantage to the adversary, you are told\\n\\t\\t\\t\\tthat the contrary is the case, the advantage is with the\\n\\t\\t\\t\\tpatient, the self-possessed, those who do not lose their\\n\\t\\t\\t\\ttemper or forget their own principles of conduct."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "127",
    "NoteID": "2164",
    "Body": "In the previous verse are laid down the principles of\\n\\t\\t\\t\\tconduct in controversy for all Muslims; 'if you catch\\n\\t\\t\\t\\tthem out, you are not entitled to strike a heavier blow\\n\\t\\t\\t\\tthan you received, but it is better to restrain yourself\\n\\t\\t\\t\\tand be patient.' There patience was recommended. In this\\n\\t\\t\\t\\tverse a command is directly addressed to the Prophet. 'Do\\n\\t\\t\\t\\tthou be patient.' It is a command: his standard as the\\n\\t\\t\\t\\tGreat Teacher is much higher; and he carried out in his\\n\\t\\t\\t\\tlife. His patience and self-restraint were under\\n\\t\\t\\t\\tcircumstances of extraordinary provocation. In his human\\n\\t\\t\\t\\twisdom it may sometimes have seemed questionable whether\\n\\t\\t\\t\\tforbearance and self-restraint might not be human\\n\\t\\t\\t\\tweaknesses; he had to defend his people as well as\\n\\t\\t\\t\\thimself against the enemy's persecutions. He is told here\\n\\t\\t\\t\\tthat he need not entertain any such fears. Patience (with\\n\\t\\t\\t\\tconstancy) in those circumstances was in accordance with\\n\\t\\t\\t\\tAllah's own command. Nor was he to grieve if they\\n\\t\\t\\t\\trejected Allah's Message; the Prophet had done his duty\\n\\t\\t\\t\\twhen he boldly and openly proclaimed it. Nor was his\\n\\t\\t\\t\\theart to be troubled if they hatched secret plots against\\n\\t\\t\\t\\thimself and his people, Allah would protect them."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "128",
    "NoteID": "2165",
    "Body": "And the Sura ends with the highest consolation which the\\n\\t\\t\\t\\trighteous can receive; the assurance that Allah is with\\n\\t\\t\\t\\tthem. A double qualification is indicated for so high an\\n\\t\\t\\t\\thonour,-(1) that they should not yield to human passion\\n\\t\\t\\t\\tor anger or impatience, and (2) that they should go on\\n\\t\\t\\t\\twith constancy doing good all around them. To attain to\\n\\t\\t\\t\\tthe Presence of Allah in the sense of \"I am with you\" is\\n\\t\\t\\t\\tthe culmination of the righteous man's aspiration."
  }
]
