[
  {
    "SurahNumber": "2",
    "AyahNumber": "1",
    "NoteID": "25",
    "Body": "These are abbreviated letters, the Muqattaat, on which a\\n\\t\\t\\t\\tgeneral discussion will be found in Appendix I (to be\\n\\t\\t\\t\\tprinted at the end of this Sura)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "2",
    "NoteID": "26",
    "Body": "Taqwa and the verbs and nouns connected with the root,\\n\\t\\t\\t\\tsignify: (1) the fear of God which according to the\\n\\t\\t\\t\\twriter of Proverbs (i.7) in the Old Testament is the\\n\\t\\t\\t\\tbeginning of Wisdom; (2) restraint, or guarding one's\\n\\t\\t\\t\\ttongue, hand, and heart from evil; (3) hence\\n\\t\\t\\t\\trighteousness, piety good conduct.  All these ideas are\\n\\t\\t\\t\\timplied; in the translation, only one or other of these\\n\\t\\t\\t\\tideas can be indicated according to the context.  See\\n\\t\\t\\t\\talso xivii 17; and ixxiv 56, n.5808."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "3",
    "NoteID": "27",
    "Body": "All bounties proceed from God.\\tThey may be physical\\n\\t\\t\\t\\tgifts, e.g., food, clothing, houses, gardens, wealth,\\n\\t\\t\\t\\tetc. or intangible gifts, e.g., influence, power, birth\\n\\t\\t\\t\\tand the opportunities flowing from it, health, talents,\\n\\t\\t\\t\\tetc. or spiritual gifts, e.g, insight into good and evil,\\n\\t\\t\\t\\tunderstanding of men, the capacity for love, etc.  We are\\n\\t\\t\\t\\tto use all in humility and moderation.\\tBut we are also\\n\\t\\t\\t\\tto give out of every one of them something that\\n\\t\\t\\t\\tcontributes to the well-being of others.  We are to be\\n\\t\\t\\t\\tneither ascetics nor luxurious sybarites, neither selfish\\n\\t\\t\\t\\tmisers nor thoughless prodigals."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "4",
    "NoteID": "28",
    "Body": "Righteousness comes from a secure faith, from sincere\\n\\t\\t\\t\\tdevotion to God, and from unselfish service to Man."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "5",
    "NoteID": "29",
    "Body": "Prosperity must be taken as referring to all the kinds of\\n\\t\\t\\t\\tbounty which we discussed in the note to ii. 3 above. \\n\\t\\t\\t\\tThe right use of one kind leads to an increase in that\\n\\t\\t\\t\\tand other kinds, and that is prosperity."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "6",
    "NoteID": "30",
    "Body": "Kafara kufr, kafr, and derivative forms of the word,\\n\\t\\t\\t\\timply a deliberate rejection of Faith as opposed to a\\n\\t\\t\\t\\tmistaken idea of God or faith, which is not inconsistent\\n\\t\\t\\t\\twith an earnest desire to see the truth.  Where there is\\n\\t\\t\\t\\tsuch desire, the grace and mercy of God gives guidance. \\n\\t\\t\\t\\tBut that guidance is not efficacious when it is\\n\\t\\t\\t\\tdeliberately rejected and the possibility of rejection\\n\\t\\t\\t\\tfollows from the grant of free will.  The consequence of\\n\\t\\t\\t\\tthe rejection is that the spiritual faculties become dead\\n\\t\\t\\t\\tor impervious to better influences.  See also n. 93 to\\n\\t\\t\\t\\tii.88."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "7",
    "NoteID": "31",
    "Body": "All actions are referred to God.  Therefore, when we get\\n\\t\\t\\t\\tthe penalty of our deliberate sin, and our senses become\\n\\t\\t\\t\\timpervious to good, the penalty is referred to the\\n\\t\\t\\t\\tjustice of God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "7",
    "NoteID": "32",
    "Body": "The penalty here is the opposite of the prosperity\\n\\t\\t\\t\\treferred to in n 5.  As we go down the path of sin, our\\n\\t\\t\\t\\tpenalty gathers momentum, just as goodness brings its own\\n\\t\\t\\t\\tcapacity for greater goodness."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "8",
    "NoteID": "33",
    "Body": "We now come to a third class of people, the hypocrites. \\n\\t\\t\\t\\tThey are untrue to themselves, and therefore their hearts\\n\\t\\t\\t\\tare diseased (ii. 10). The disease tends to spread, like\\n\\t\\t\\t\\tall evil. They are curable but if they harden their\\n\\t\\t\\t\\thearts, they soon pass into the category of those who\\n\\t\\t\\t\\tdeliberately reject light."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "10",
    "NoteID": "34",
    "Body": "The insincere man who thinks he can get the best of both\\n\\t\\t\\t\\tworlds by compromising with good and evil only increased\\n\\t\\t\\t\\tthe disease of his heart, because he is not true to\\n\\t\\t\\t\\thimself.  Even the good which comes to him he can pervert\\n\\t\\t\\t\\tto evil.  So the rain which fills out the ear of corn or\\n\\t\\t\\t\\tlends fragrance to the rose also lends strength to the\\n\\t\\t\\t\\tthorn or adds strength to the poison of the deadly\\n\\t\\t\\t\\tnight-shade."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "12",
    "NoteID": "35",
    "Body": "Much mischief is caused (sometimes unwittingly) by people\\n\\t\\t\\t\\twho think that they have a mission of peace, when they\\n\\t\\t\\t\\thave not even a true perception of right and wrong.  By\\n\\t\\t\\t\\ttheir blind arrogance they depress the good and encourage\\n\\t\\t\\t\\tthe evil."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "13",
    "NoteID": "36",
    "Body": "This is another phase of the hypocrite and the cynic. \\n\\t\\t\\t\\t\"Faith\" he says, \"is good enough to fools.\"  But his\\n\\t\\t\\t\\tcynicism may be the greatest folly in the eyes of God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "14",
    "NoteID": "37",
    "Body": "A deeper phase of insincerity is actual duplicity.  But\\n\\t\\t\\t\\tit never pays in the end.  If we compare such a man to a\\n\\t\\t\\t\\ttrader, he loses in the bargain."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "17",
    "NoteID": "38",
    "Body": "The man wanted light; he only kindled a fire.  It\\n\\t\\t\\t\\tproduced a blaze, and won the applause of all around. \\n\\t\\t\\t\\tBut it did not last long.  When the flame when out as was\\n\\t\\t\\t\\tinevitable, the darkness was worse than before.  And they\\n\\t\\t\\t\\tall lost their way.  So hypocrisy, deception, arrogant\\n\\t\\t\\t\\tcompromise with evil, cynicism, or duplicity may win\\n\\t\\t\\t\\ttemporary applause.  But the true light of faith and\\n\\t\\t\\t\\tsincerity is wanting, and therefore it must mislead and\\n\\t\\t\\t\\truin all concerned.  In the consternation they cannot\\n\\t\\t\\t\\tspeak or hear each other, and of course they cannot see;\\n\\t\\t\\t\\tso they end like the deliberate rejecters of Faith (ii.\\n\\t\\t\\t\\t7), wildly groping about, dumb, deaf and blind."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "19",
    "NoteID": "39",
    "Body": "A wonderfully graphic and powerful simile applying to\\n\\t\\t\\t\\tthose who reject Faith. In their self-sufficiency they\\n\\t\\t\\t\\tare undisturbed normally.  But what happens when a great\\n\\t\\t\\t\\tstorm breaks over them?  They cover their ears against\\n\\t\\t\\t\\tthunder-claps and the lightning nearly blinds them.  They\\n\\t\\t\\t\\tare in mortal fear, but God encompasses them around -\\n\\t\\t\\t\\teven them, for He at all times encompasses all.  He gives\\n\\t\\t\\t\\tthem rope.  In the intervals of deafening noise and\\n\\t\\t\\t\\tblinding flashes, there are moments of steady light and\\n\\t\\t\\t\\tthese creatures take advantage of them, but again they\\n\\t\\t\\t\\tare plunged into darkness.  Perhaps they curse; perhaps\\n\\t\\t\\t\\tthey think that the few moments of effective light are\\n\\t\\t\\t\\tdue to their own intelligence!\\tHow much wiser would they\\n\\t\\t\\t\\tbe if they humbled themselves and sought the light of\\n\\t\\t\\t\\tGod!"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "21",
    "NoteID": "40",
    "Body": "For Taqwa see ii. 2 n. 26.  I connect this dependent\\n\\t\\t\\t\\tclause with \"adore, etc.\" above, though it could be\\n\\t\\t\\t\\tconnected with \"created\".  According to my construction\\n\\t\\t\\t\\tthe argument will be as follows.  Adoration is the act of\\n\\t\\t\\t\\tthe highest and humblest reverence and worship.  When you\\n\\t\\t\\t\\tget into that relationship with God, Who is your Creator\\n\\t\\t\\t\\tand Guardian, your faith produces works of righteousness.\\n\\t\\t\\t\\t It is a chance given you:  will you exercise your free\\n\\t\\t\\t\\twill and take it?  If you do, your whole nature will be\\n\\t\\t\\t\\ttransformed."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "22",
    "NoteID": "41",
    "Body": "Further proofs of God's goodness to you are given in this\\n\\t\\t\\t\\tverse.\\tYour whole life, physical and spiritual, depends\\n\\t\\t\\t\\tupon Him.  The spiritual is figured by the Canopy of\\n\\t\\t\\t\\tHeaven.  The truth has been brought plainly before you. \\n\\t\\t\\t\\tWill you still resist it and go after false gods, the\\n\\t\\t\\t\\tcreation of your own fancy?  The false gods may be idols,\\n\\t\\t\\t\\tsupersititions, Self, or even great or glorious things\\n\\t\\t\\t\\tlike Poetry, Art, or Science, when set up as rivals to\\n\\t\\t\\t\\tGod.  They may be pride of race, pride of birth, pride of\\n\\t\\t\\t\\twealth or position, pride of power, pride of learning, or\\n\\t\\t\\t\\teven spiritual pride."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "23",
    "NoteID": "42",
    "Body": "How do we know that there is revelation, and that is from\\n\\t\\t\\t\\tGod?  Here is a concrete test.\\tThe Teacher of God's\\n\\t\\t\\t\\tTruth has placed before you many Suras. Can you produce\\n\\t\\t\\t\\tone like it?  If there is any one besides God, who can\\n\\t\\t\\t\\tinspire spiritual truth in such noble language, produce\\n\\t\\t\\t\\tyour evidence.\\tOr is it that your doubts are merely\\n\\t\\t\\t\\targumentative, refractory, against your own inner light,\\n\\t\\t\\t\\tor conscience?\\tAll true revelation is itself a miracle,\\n\\t\\t\\t\\tand stands on its own merits."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "24",
    "NoteID": "43",
    "Body": "If by your own efforts you cannot match the spiritual\\n\\t\\t\\t\\tlight, and yet contumaciously reject spiritual Faith,\\n\\t\\t\\t\\tthen there will be a fire in your souls, the Punishment\\n\\t\\t\\t\\tthat burns up all your cherished idols.  Perhaps you will\\n\\t\\t\\t\\tat least fear this penalty, which your self-loving souls\\n\\t\\t\\t\\tcan understand.  This fire consumes both the worshippers\\n\\t\\t\\t\\tof the False and the Idols which they falsely worship. \\n\\t\\t\\t\\tCan this bring them to their senses?  Its power is not\\n\\t\\t\\t\\tonly over the feeling, palpitating heart of man (heart in\\n\\t\\t\\t\\ta spiritual sense, as it persists long after the physical\\n\\t\\t\\t\\theart), but he cannot escape from it even if he imagines\\n\\t\\t\\t\\thimself reduced to inertness like sticks or stones; for\\n\\t\\t\\t\\tit is all-devouring."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "25",
    "NoteID": "44",
    "Body": "This is the antithesis to the last verse.  If fire is the\\n\\t\\t\\t\\tsymbol of Punishment, the Garden is the symbol of\\n\\t\\t\\t\\tfelicity.  And what can be more delightful than a Garden\\n\\t\\t\\t\\twhere you observe from a picturesque height a beautiful\\n\\t\\t\\t\\tlandscape round you, - rivers flowing with cyrstal water,\\n\\t\\t\\t\\tand fruit trees of which the choicest fruit is before\\n\\t\\t\\t\\tyou.  The fruit of goodness is goodness, similar, but\\n\\t\\t\\t\\tchoicer in every degree of ascent.  You think it is the\\n\\t\\t\\t\\tsame, but it is because of your past experiences and\\n\\t\\t\\t\\tassociations of memory.  Then there is companionship.  If\\n\\t\\t\\t\\tsex is suggested, its physical associations are at once\\n\\t\\t\\t\\tnegatived by the addition of the word Mutahharatun \"pure\\n\\t\\t\\t\\tand holy.\"  The Arabic epithet is in the intensive form,\\n\\t\\t\\t\\tand must be translated by two adjectives denoting purity\\n\\t\\t\\t\\tin the highest degree.\\tThe Companionship is that of\\n\\t\\t\\t\\tsouls and applies to both sexes in the physical world of\\n\\t\\t\\t\\tmen and women.\\tAnd this felicity is not a mere passing\\n\\t\\t\\t\\tphase but will abide beyond the realms of Time."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "26",
    "NoteID": "45",
    "Body": "The word for \"the lowest\" in the original Arabic means a\\n\\t\\t\\t\\tgnat, a byword in the Arabic language for the weakest of\\n\\t\\t\\t\\tcreatures.  In xxix 41, which was revealed before this\\n\\t\\t\\t\\tSura, the similtutde of the Spider was used, and\\n\\t\\t\\t\\tsimilarly in xxii 73, there is the similitude of the Fly.\\n\\t\\t\\t\\t For similitudes taken from magnificent forces of nature,\\n\\t\\t\\t\\texpressed in exalted language, see ii. 19 above.  To God\\n\\t\\t\\t\\tall His creation has some special meaning appropriate to\\n\\t\\t\\t\\titself, and some of what we consider the lowest creatures\\n\\t\\t\\t\\thave wonderful aptitudes, e.g., the spider of the fly. \\n\\t\\t\\t\\tParables like these may be an occasion of stumbling to\\n\\t\\t\\t\\tthose \"who forsake the path\"; in other words those who\\n\\t\\t\\t\\tdeliberately shut their eyes to God's Signs, and their\\n\\t\\t\\t\\tPenalty is attributed to God, the Cause of all causes. \\n\\t\\t\\t\\tBut lest there should be misunderstanding, it is\\n\\t\\t\\t\\timmediately added that the stumbling and offence only\\n\\t\\t\\t\\toccur as the result of the sinner's own choice of the\\n\\t\\t\\t\\twrong course. Verses 26 and 27 form one sentence and\\n\\t\\t\\t\\tshould be read together.  \"Forsaking the path\" is defined\\n\\t\\t\\t\\tin ii. 27, viz., breaking solemn covenants which the\\n\\t\\t\\t\\tsinner's own soul had ratified, causing division among\\n\\t\\t\\t\\tmankind, who were meant to be one brotherhood, and doing\\n\\t\\t\\t\\tas much mischief as possible in the life on this earth,\\n\\t\\t\\t\\tfor the life beyond will be on another plane, where no\\n\\t\\t\\t\\trope will be given to evil."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "28",
    "NoteID": "46",
    "Body": "In the preceeding verses God has used various arguments. \\n\\t\\t\\t\\tHe has recalled His goodness (ii. 21-22); resolved doubts\\n\\t\\t\\t\\t(ii. 23); plainly set forth the penalty of wrong-doing\\n\\t\\t\\t\\t(ii. 24); given glad tidings (ii. 25), shown how\\n\\t\\t\\t\\tmisunderstandings arise from a deliberate rejection of\\n\\t\\t\\t\\tthe light and breach of the Covenant (ii. 26-27).  Now\\n\\t\\t\\t\\t(ii. 28-29) He pleads with His creatures and appeals to\\n\\t\\t\\t\\ttheir own subjective feelings.\\tHe brought you into\\n\\t\\t\\t\\tbeing.\\tThe mysteries of life and death are in His hands.\\n\\t\\t\\t\\t When you die on this earth, that is not the end.  You\\n\\t\\t\\t\\twere of Him, and you must return to Him.  Look around you\\n\\t\\t\\t\\tand realize your own dignity; it is from Him.  The\\n\\t\\t\\t\\timmeasurable depths of space above and around you may\\n\\t\\t\\t\\tstagger you.  They are part of His plan.  What you have\\n\\t\\t\\t\\timagined as the seven firmaments (and any other scheme\\n\\t\\t\\t\\tyou may construct) bears witness to His design of order\\n\\t\\t\\t\\tand perfection, for His knowledge (unlike yours) is\\n\\t\\t\\t\\tall-comprehending.  And yet will you deliberately reject\\n\\t\\t\\t\\tor obscure or deaden the faculty of Faith which has been\\n\\t\\t\\t\\tput into you?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "30",
    "NoteID": "47",
    "Body": "It would seem that the angels, though holy and pure, and\\n\\t\\t\\t\\tendued with power from God, yet represented only one side\\n\\t\\t\\t\\tof Creation.  We may imagine them without passion or\\n\\t\\t\\t\\temotion, of which the highest flower is love.  If man was\\n\\t\\t\\t\\tto be endued with emotions, those emotions would lead him\\n\\t\\t\\t\\tto the highest and drag him to the lowest.  The power of\\n\\t\\t\\t\\twill or choosing would have to go with them, in order\\n\\t\\t\\t\\tthat man might steer his own bark.  This power of will\\n\\t\\t\\t\\t(when used aright) gave him to some extent a mastery over\\n\\t\\t\\t\\this own fortunes and over nature, thus bringing him\\n\\t\\t\\t\\tnearer to the God-like nature which has supreme mastery\\n\\t\\t\\t\\tand will. We may suppose the angels had no independent\\n\\t\\t\\t\\twills of their own; their perfection in other ways\\n\\t\\t\\t\\treflected God's perfection but could not raise them to\\n\\t\\t\\t\\tthe dignity of vicegerency.  The perfect vicegerent is he\\n\\t\\t\\t\\twho has the power of initiative himself, but whose\\n\\t\\t\\t\\tindependent action always reflects perfectly the will of\\n\\t\\t\\t\\this Principal.\\tThe distinction is expressed by\\n\\t\\t\\t\\tShakespeare (Sonnet 94) in those fine lines: \"They are\\n\\t\\t\\t\\tthe lords and owners of their faces.  Others but stewards\\n\\t\\t\\t\\tof their excellence.\"  The angels in their one-sidedness\\n\\t\\t\\t\\tsaw only the mischief consequent on the misuse of the\\n\\t\\t\\t\\temotional nature by man; perhaps they also, being without\\n\\t\\t\\t\\temotions, did not understand the whole of God's nature,\\n\\t\\t\\t\\twhich gives and asks for love.\\tIn humility and true\\n\\t\\t\\t\\tdevotion to God, they remonstrate; we must not imagine\\n\\t\\t\\t\\tthe least tinge of jealousy, as they are without emotion.\\n\\t\\t\\t\\t This mystery of love being above them, they are told\\n\\t\\t\\t\\tthat they do not know and they acknowledge (in ii. 32\\n\\t\\t\\t\\tbelow) not their fault (for there is no question of\\n\\t\\t\\t\\tfault) but their imperfection of knowledge.  At the same\\n\\t\\t\\t\\ttime, the matter is brought home to them when the actual\\n\\t\\t\\t\\tcapacities of man are shown to them (ii. 31, 33)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "31",
    "NoteID": "48",
    "Body": "The literal words in Arabic throughout this passage are:\\n\\t\\t\\t\\t\"The names of things\" which commentators take to mean the\\n\\t\\t\\t\\tinner nature and qualities of things, and things here\\n\\t\\t\\t\\twould include feelings.  The whole passage is charged\\n\\t\\t\\t\\twith mystic meaning.  The particular qualities or\\n\\t\\t\\t\\tfeelings which were outside the nature of angels were put\\n\\t\\t\\t\\tby God into the nature of man.\\tMan was thus able to love\\n\\t\\t\\t\\tand understand love, and thus plan and initiate, as\\n\\t\\t\\t\\tbecomes the office of vicegerent.  The angels\\n\\t\\t\\t\\tacknowledged this.  These things they could only know\\n\\t\\t\\t\\tfrom the outside, but they had faith, or belief in the\\n\\t\\t\\t\\tUnseen.  And they knew that God saw all - what others\\n\\t\\t\\t\\tsee, what others do not see, what others may even wish to\\n\\t\\t\\t\\tconceal.  Man has many qualities which are latent or\\n\\t\\t\\t\\twhich he may wish to suppress or conceal, to his own\\n\\t\\t\\t\\tdetriment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "34",
    "NoteID": "49",
    "Body": "The Arabic may also be translated: \"They bowed down,\\n\\t\\t\\t\\texcept Iblis.\" In that case Iblis (Satan) would be one of\\n\\t\\t\\t\\tthe angels.  But the theory of fallen angels is not\\n\\t\\t\\t\\tusually accepted in Muslim theology.  In xviii, 50 Iblis\\n\\t\\t\\t\\tis spoken of as a Jinn.  We shall discuss later the\\n\\t\\t\\t\\tmeaning of this word."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "35",
    "NoteID": "50",
    "Body": "Was the Garden of Eden a place on this earth?  Obviously\\n\\t\\t\\t\\tnot.  For, in verse 36 below, it was after the Fall that\\n\\t\\t\\t\\tthe sentence was pronounced: \"On earth will be your\\n\\t\\t\\t\\tdwelling.\"  Before the Fall, we must suppose Man to be on\\n\\t\\t\\t\\tanother plane altogether - of felicity, innocence, trust,\\n\\t\\t\\t\\ta spiritual existence, with the negation of enmity, want\\n\\t\\t\\t\\tof faith, and all evil.  Perhaps Time and Space also did\\n\\t\\t\\t\\tnot exist, and the Garden is allegorical as well as the\\n\\t\\t\\t\\ttree.  The forbidden tree was not the tree of knowledge\\n\\t\\t\\t\\tfor man was given in that perfect state fuller knowledge\\n\\t\\t\\t\\tthan he has now (ii. 31); it was the tree of Evil, which\\n\\t\\t\\t\\the was forbidden not only to eat of, but even to\\n\\t\\t\\t\\tapproach."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "35",
    "NoteID": "51",
    "Body": "\"Zulm\" in Arabic implies harm, wrong, injustice, or\\n\\t\\t\\t\\ttransgression, and may have reference to oneself; when\\n\\t\\t\\t\\tthe wrong is done to others it implies tyranny and\\n\\t\\t\\t\\toppression; the idea of wrong naturally connects itself\\n\\t\\t\\t\\twith darkness, which is another shade of meaning carried\\n\\t\\t\\t\\twith the root word."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "36",
    "NoteID": "52",
    "Body": "\"Iblis\" in ii. 34 is apparently the Power of Evil, with\\n\\t\\t\\t\\tthe root idea of desperateness of rebillion. \"Satan\" in\\n\\t\\t\\t\\tthis verse is the Power of Evil, with the root idea of\\n\\t\\t\\t\\tperversity or enmity.  Note the appropriateness of the\\n\\t\\t\\t\\tterm on each occasion.\\tAlso, \"slipping\" from the Garden\\n\\t\\t\\t\\tdenotes the idea of Evil gradually tempting man from a\\n\\t\\t\\t\\thigher to a lower state."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "36",
    "NoteID": "53",
    "Body": "God's decree is the result of man's action.  Note the\\n\\t\\t\\t\\ttransition in Arabic from the singular number in ii. 33,\\n\\t\\t\\t\\tto the dual in ii. 35, and the plural here, which I have\\n\\t\\t\\t\\tindicated in English by \"All ye people.\"  Evidently Adam\\n\\t\\t\\t\\tis the type of all mankind, and the sexes go together in\\n\\t\\t\\t\\tall spiritual matters.\\tMoreover, the expulsion applied\\n\\t\\t\\t\\tto Adam, Eve, and Satan, and the Arabic plural is\\n\\t\\t\\t\\tappropriate for any number greater than two."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "36",
    "NoteID": "54",
    "Body": "Man's sojourn in this lower state, where he is partly an\\n\\t\\t\\t\\tanimal of this earth, is for a time.  But he must fulfil\\n\\t\\t\\t\\this lower duties also, for they too are a part of his\\n\\t\\t\\t\\tspiritual training."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "37",
    "NoteID": "55",
    "Body": "As \"names\" in verse 31 above is used for the \"nature of\\n\\t\\t\\t\\tthings\", so \"words\" here mean \"inspiration\" \"spiritual\\n\\t\\t\\t\\tknowledge\".  The Arabic word used for \"learn\" here\\n\\t\\t\\t\\timplies some effort on his part to which God's Grace\\n\\t\\t\\t\\tresponded."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "38",
    "NoteID": "56",
    "Body": "Note the transition from the plural \"We\" at the beginning\\n\\t\\t\\t\\tof the verse to the singular \"Me\" later in the same verse\\n\\t\\t\\t\\tGod speaks of Himself usually in the first person plural\\n\\t\\t\\t\\t\"We\" it is the plural of respect and honour and is used\\n\\t\\t\\t\\tin human language in Royal proclamations and decrees. \\n\\t\\t\\t\\tBut where a special personal relationship is expressed\\n\\t\\t\\t\\tthe singular, \"I\" or \"Me\" is used Cf. xxvi. 52, etc."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "39",
    "NoteID": "57",
    "Body": "But if the soul, in spite of the Oft-Returning Mercy of\\n\\t\\t\\t\\tGod, rejects the higher light and goes on sinning against\\n\\t\\t\\t\\tthat light, the inevitable consequence must be the\\n\\t\\t\\t\\tspiritual Fire.  It is not merely a fortuitous incident. \\n\\t\\t\\t\\tAs his rejection was deliberate and definite, so the\\n\\t\\t\\t\\tconsequences must be of an abiding character."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "40",
    "NoteID": "58",
    "Body": "The appeal is made to Israel subjectively in terms of\\n\\t\\t\\t\\ttheir own tradition.  You claim to be a favoured nation;\\n\\t\\t\\t\\thave you forgotten My favours?\\tYou claim a special\\n\\t\\t\\t\\tCovenant with Me: I have fulfilled My part of the\\n\\t\\t\\t\\tCovenant by bringing you out of the land of bondage and\\n\\t\\t\\t\\tgiving you Canaan, the land \"flowing with milk and honey\"\\n\\t\\t\\t\\thow have you fulfilled your part of the Covenent?  Do you\\n\\t\\t\\t\\tfear for your national existence?  If you fear Me,\\n\\t\\t\\t\\tnothing else will matter."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "41",
    "NoteID": "59",
    "Body": "You receive revelations before: now comes one confirming\\n\\t\\t\\t\\tit: its first appeal should be to you: are you to be the\\n\\t\\t\\t\\tfirst to reject it?  And reject it for what? God's Signs\\n\\t\\t\\t\\tare worth more than all your paltry considerations.  And\\n\\t\\t\\t\\tthe standard of duty and righteousness is to be taken\\n\\t\\t\\t\\tfrom God, and not from priests and customs."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "43",
    "NoteID": "60",
    "Body": "The argument is still primarily addressed to the Jews,\\n\\t\\t\\t\\tbut is of universal application, as in all the teachings\\n\\t\\t\\t\\tof the Quran.  The chief feature of Jewish worship was\\n\\t\\t\\t\\tand is the bowing of the head."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "45",
    "NoteID": "61",
    "Body": "The Arabic word Sabr implies many shades of meaning,\\n\\t\\t\\t\\twhich it is impossible to comprehend in one English word.\\n\\t\\t\\t\\t It implies (1) patience in the sense of being thorough,\\n\\t\\t\\t\\tnot hasty; (2) patient perseverance, constancy,\\n\\t\\t\\t\\tsteadfastness, firmness of purpose; (3) systematic as\\n\\t\\t\\t\\topposed to spasmodic or chance action; (4) a cheerful\\n\\t\\t\\t\\tattitude of resignation and understanding in sorrow,\\n\\t\\t\\t\\tdefeat, or suffering, as opposed to murmuring or\\n\\t\\t\\t\\trebellion, but saved from mere passivity or listlessness,\\n\\t\\t\\t\\tby the element of constancy or steadfastness."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "47",
    "NoteID": "62",
    "Body": "These words are recapitulated from ii. 40, which\\n\\t\\t\\t\\tintroduced a general account of God's favours to Israel;\\n\\t\\t\\t\\tnow we are introduced to a particular account of\\n\\t\\t\\t\\tincidents in Israel's history.\\tEach incident is\\n\\t\\t\\t\\tintroduced by the Arabic word \"Iz\", which is indicated in\\n\\t\\t\\t\\tthe translation by \"Remember\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "48",
    "NoteID": "63",
    "Body": "Before passing to particular incidents, the conclusion is\\n\\t\\t\\t\\tstated.  Be on your guard; do not think that special\\n\\t\\t\\t\\tfavours exempt you from the personal responsibility of\\n\\t\\t\\t\\teach soul."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "49",
    "NoteID": "64",
    "Body": "The bondage of Egypt was indeed a tremendous trial.  Even\\n\\t\\t\\t\\tthe Egyptians' wish to spare the lives of Israel's\\n\\t\\t\\t\\tfemales when the males were slaughtered, added to the\\n\\t\\t\\t\\tbitterness of Israel.  Their hatred was cruel, but their\\n\\t\\t\\t\\t\"love\" was still more cruel.  About the hard tasks, see\\n\\t\\t\\t\\tExod. i. 14: \"They made their lives bitter with hard\\n\\t\\t\\t\\tbondage, in mortar and in brick, and in all manner of\\n\\t\\t\\t\\tservice in the field; all their service, wherein they\\n\\t\\t\\t\\tmade them serve, was with rigour.\" Pharaoh's taskmasters\\n\\t\\t\\t\\tgave no straw, yet ordered the Israelites to make bricks\\n\\t\\t\\t\\twithout straw: Exod. v 5-19.  Pharoah's decree was:\\n\\t\\t\\t\\t\"Every son that is born ye shall cast into the river, and\\n\\t\\t\\t\\tevery daughter ye shall save alive\":  Exod. i. 22.  It\\n\\t\\t\\t\\twas in consequence of this decree that Moses was hidden\\n\\t\\t\\t\\tthree months after he was born, and when he could be\\n\\t\\t\\t\\thidden no longer, he was put into an ark of bulrushes and\\n\\t\\t\\t\\tcast into the Nile, where he was found by Pharoah's\\n\\t\\t\\t\\tdaughter and wife (xxviii. 9), and adopted into the\\n\\t\\t\\t\\tfamily: Exod. ii. 2-10. Cf. xx. 37-40.\\tThus Moses was\\n\\t\\t\\t\\tbrought up by the enemies of his people.  He was chosen\\n\\t\\t\\t\\tby God to deliver his people, and God's wisdom made the\\n\\t\\t\\t\\tlearning and experience and even cruelties of the\\n\\t\\t\\t\\tEgyptian enemies themselves to contribute to the\\n\\t\\t\\t\\tsalvation of his people."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "50",
    "NoteID": "65",
    "Body": "When the Israelites at last escaped from Egypt, they were\\n\\t\\t\\t\\tpursued by Pharaoh and his host.  By a miracle the\\n\\t\\t\\t\\tIsraelites crossed the Red Sea, but the host of Pharaoh\\n\\t\\t\\t\\twas drowned: Exod. xiv. 5-31."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "51",
    "NoteID": "66",
    "Body": "This was after the Ten Commandments and the Laws and\\n\\t\\t\\t\\tOrdinances had been given on Mount Sinai: Moses was asked\\n\\t\\t\\t\\tup into the Mount, and he was there forty days and forty\\n\\t\\t\\t\\tnights: Exod. xxiv. 18.  But the people got impatient of\\n\\t\\t\\t\\tthe delay, made a calf of melted gold, and offered\\n\\t\\t\\t\\tworship ande sacrifice to it: Exod. xxxii 1-8."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "52",
    "NoteID": "67",
    "Body": "Moses prayed for his people, and God forgave them.  This\\n\\t\\t\\t\\tis the language of the Qur-an.\\tThe Old Testament version\\n\\t\\t\\t\\tis rougher: \"The Lord reprented of the evil which He\\n\\t\\t\\t\\tthought to do unto His people\": Exod. xxxii. 14.  The\\n\\t\\t\\t\\tMuslim position has always been that the Jewish (and\\n\\t\\t\\t\\tChristian) scriptures as they stand cannot be traced\\n\\t\\t\\t\\tdirect to Moses or Jesus, but are later compilations. \\n\\t\\t\\t\\tModern scholarship and Higher Criticism has left no doubt\\n\\t\\t\\t\\ton the subject.  But the stories in these traditional\\n\\t\\t\\t\\tbooks may be used in an appeal to those who use them:\\n\\t\\t\\t\\tonly they should be spiritualized, as they are here, and\\n\\t\\t\\t\\tespecially in ii. 5 below."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "53",
    "NoteID": "68",
    "Body": "God's revelation, the expression of God's Will, is the\\n\\t\\t\\t\\ttrue standard of right and wrong.  It may be in a Book or\\n\\t\\t\\t\\tin God's dealings in history.  All these may be called\\n\\t\\t\\t\\tHis Signs or Miracles.\\tIn this passage some commentators\\n\\t\\t\\t\\ttake the Scripture and the Criterion (Furqan) to be\\n\\t\\t\\t\\tidentical.  Others take them to be two distinct things: \\n\\t\\t\\t\\tScripture being the written Book and the Criterion being\\n\\t\\t\\t\\tother Signs.  I agree with the latter view.  The word\\n\\t\\t\\t\\tFurqan also occurs in xxi. 48 in connection with Moses\\n\\t\\t\\t\\tand Aaron and in the first verse of Sura xxv, as well as\\n\\t\\t\\t\\tin its title, in connection with Muhammad.  As Aaron\\n\\t\\t\\t\\treceived no Book, Furqan must mean the other Signs. \\n\\t\\t\\t\\tMustafa had both the Book and the other Signs: perhaps\\n\\t\\t\\t\\there too we take the other Signs as supplementing the\\n\\t\\t\\t\\tBook.  Cf. Wordsworth's \"Arbiter undisturbed of right and\\n\\t\\t\\t\\twrong.\"  (Prelude, Book 4)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "54",
    "NoteID": "69",
    "Body": "Moses's speech may be construed literally, as translated,\\n\\t\\t\\t\\tin which case it reproduces Exod. xxxii 27-28 but in a\\n\\t\\t\\t\\tmuch softened form, for the Old Testament says:  \"Go in\\n\\t\\t\\t\\tand out from gate to gate throughout the camp, and slay\\n\\t\\t\\t\\tevery man his brother and every man his companion, and\\n\\t\\t\\t\\tevery man his neighbor... and there fell of the people\\n\\t\\t\\t\\tthat day 3,000 men.\"  A more spiritualized version would\\n\\t\\t\\t\\tbe that the order for slaying was given by way of trial,\\n\\t\\t\\t\\tbut was withdrawn, for God turned to them in forgiveness.\\n\\t\\t\\t\\t A still more spiritualized way of construing it would be\\n\\t\\t\\t\\tto take \"anfusakum\" as meaning \"souls\" not \"selves\". \\n\\t\\t\\t\\tThen the sense of Moses's speech (abbreviated) would be: \\n\\t\\t\\t\\t\"By the worship of the calf you have wronged your own\\n\\t\\t\\t\\tsouls; repent: mortify (=slay) your souls now: it will be\\n\\t\\t\\t\\tbetter in the sight of God.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "55",
    "NoteID": "70",
    "Body": "We have hitherto had instances from the Jewish\\n\\t\\t\\t\\ttraditional Taurat (or Pentateuch).  Now we have some\\n\\t\\t\\t\\tinstances from Jewish traditions in the Talmud, or body\\n\\t\\t\\t\\tof exposition in the Jewish theological schools.  They\\n\\t\\t\\t\\tare based on the Jewish scriptures, but add many\\n\\t\\t\\t\\tmarvellous details and homilies.  As to seeing God, we\\n\\t\\t\\t\\thave in Exod. xxxiii 20: \"And He said, Thou canst not see\\n\\t\\t\\t\\tMy face: for there shall no man see Me and live.\"  The\\n\\t\\t\\t\\tpunishment for insisting on seeing God was therefore\\n\\t\\t\\t\\tdeath; but those who rejected faith were forgiven, and\\n\\t\\t\\t\\tyet they were ungrateful."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "57",
    "NoteID": "71",
    "Body": "Manna=Hebrew, Manhu: Arabic Mahuwa? - What is it?  In\\n\\t\\t\\t\\tExod. xvi. 14 it is described as \"a small round thing as\\n\\t\\t\\t\\tsmall as the hoar frost on the ground.\"  It usually\\n\\t\\t\\t\\trotted if left over till next day; it melted in the hot\\n\\t\\t\\t\\tsun; the amount necessary for each man was about an Omer,\\n\\t\\t\\t\\ta Hebrew measure of capacity equal to about 2| quarts. \\n\\t\\t\\t\\tThis is the Hebrew account, probably distorted by\\n\\t\\t\\t\\ttraditional exaggeration.  The actual Manna found to this\\n\\t\\t\\t\\tday in the Sinai region is a gummy saccharine secretion\\n\\t\\t\\t\\tfound on a species of Tamarisk.  It is produced by the\\n\\t\\t\\t\\tpuncture of a species of insect like the cochineal, just\\n\\t\\t\\t\\tas lac is produced by the puncture of the lac insect on\\n\\t\\t\\t\\tcertain trees in India.  As to quails, large flights of\\n\\t\\t\\t\\tthem are driven by winds in the Eastern Mediterranean in\\n\\t\\t\\t\\tcertain seasons of the year, as was witnessed during the\\n\\t\\t\\t\\tGreat War of 1914-1918 by many Indian officers who\\n\\t\\t\\t\\tcampaigned between Egypt and Palestine."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "58",
    "NoteID": "72",
    "Body": "This probably refers to Shittim.  It was the \"town of\\n\\t\\t\\t\\tacacias,\" just east of the Jordan, where the Israelites\\n\\t\\t\\t\\twere guilty of debauchery and the worship of and\\n\\t\\t\\t\\tsacrifice to false gods (Num. xxv. 1-2, also 8-9); a\\n\\t\\t\\t\\tterrible punishment ensued, including the plague of which\\n\\t\\t\\t\\t24,000 died.  The word which the transgressors changed\\n\\t\\t\\t\\tmay have been a pass-word.  In the Arabic text it is\\n\\t\\t\\t\\t\"Hittatun\" which implies humility and a prayer of\\n\\t\\t\\t\\tforgiveness, a fitting emblem to distinguish them from\\n\\t\\t\\t\\ttheir enemies.\\tFrom this particular incident a more\\n\\t\\t\\t\\tgeneral lesson may be drawn; in the hour of triumph we\\n\\t\\t\\t\\tare to behave humbly as in God's sight, and our conduct\\n\\t\\t\\t\\tshould be exemplary according to God's word; otherwise\\n\\t\\t\\t\\tour arrogance will draw its own punishment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "60",
    "NoteID": "73",
    "Body": "Here we have a reference to the tribal organization of\\n\\t\\t\\t\\tthe Jews, which played a great part in their forty years'\\n\\t\\t\\t\\tmarch through the Arabian deserts (Num. i. and ii.) and\\n\\t\\t\\t\\ttheir subsequent settlement in the land of Canaan (Josh.\\n\\t\\t\\t\\txxii. and xiv.).  The twelve tribes were derived from the\\n\\t\\t\\t\\tsons of Jacob, whose name was changed to Israel (soldier\\n\\t\\t\\t\\tof God) after he had wrestled, says Jewish tradition,\\n\\t\\t\\t\\twith God (Genesis xxxii. 28).  Israel had twelve sons\\n\\t\\t\\t\\t(Gen. xxxv. 22-26), including Levi and Joseph.\\tThe\\n\\t\\t\\t\\tdescendants of these twelve sons were the \"Children of\\n\\t\\t\\t\\tIsrael.\"  Levi's family got the priesthood and the care\\n\\t\\t\\t\\tof the Tabernacle; they were exempted from military\\n\\t\\t\\t\\tduties for which the census was taken (Nu. i. 47-53), and\\n\\t\\t\\t\\ttherefore from the distribution of Land in Canaan (Josh.\\n\\t\\t\\t\\txiv. 3); they were distributed among all the Tribes, and\\n\\t\\t\\t\\twere really a privileged caste and not numbered among the\\n\\t\\t\\t\\tTribes; Moses and Aaron belonged to the house of Levi. \\n\\t\\t\\t\\tOn the other hand Joseph, on account of the high position\\n\\t\\t\\t\\tto which he rose in Egypt as the Pharoah's minister, was\\n\\t\\t\\t\\tthe progenitor of two tribes, one in the name of each of\\n\\t\\t\\t\\this two sons Ephraim and Manasseh.  Thus there were\\n\\t\\t\\t\\ttwelve Tribes in all, as Levi was cut out and Joseph\\n\\t\\t\\t\\trepresented two tribes.  Their having fixed stations and\\n\\t\\t\\t\\twatering places in camp and fixed territorial areas later\\n\\t\\t\\t\\tin the Promised Land prevented confusion and mutual\\n\\t\\t\\t\\tjealousies and is pointed to as an evidence of the\\n\\t\\t\\t\\tProvidence of God acting through His prophet Moses.  Cf.\\n\\t\\t\\t\\talso vii. 160."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "61",
    "NoteID": "74",
    "Body": "The declension of the word Misr in the Arabic text here\\n\\t\\t\\t\\tshows that it is treated as a common noun meaning any\\n\\t\\t\\t\\ttown, but this is not conclusive, and the reference may\\n\\t\\t\\t\\tbe to the Egypt of Pharoah.  The Tanwin expressing\\n\\t\\t\\t\\tindefiniteness may mean \"any Egypt\", i.e., any country as\\n\\t\\t\\t\\tfertile as Egypt.  There is here a subtle reminiscence as\\n\\t\\t\\t\\twell as a severe reproach.  The rebellious children of\\n\\t\\t\\t\\tIsrael murmured at the sameness of the food they got in\\n\\t\\t\\t\\tthe desert.  They were evidently hankering after the\\n\\t\\t\\t\\tdelicacies of the Egypt which they had left, although\\n\\t\\t\\t\\tthey should have known that the only thing certain for\\n\\t\\t\\t\\tthem in Egypt was their bondage and harsh treatment. \\n\\t\\t\\t\\tMoses's reproach to them was twofold: (1) Such variety of\\n\\t\\t\\t\\tfoods you can get in any town; would you, for their sake,\\n\\t\\t\\t\\tsell your freedom?  Is not freedom better than delicate\\n\\t\\t\\t\\tfood?  (2) In front is the rich Promised Land, which you\\n\\t\\t\\t\\tare reluctant to march to; behind is Egypt, the land of\\n\\t\\t\\t\\tbondage.  Which is better?  Would you exchange the better\\n\\t\\t\\t\\tfor the worse?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "61",
    "NoteID": "75",
    "Body": "From here the argument becomes more general.  They got\\n\\t\\t\\t\\tthe Promished Land.  But they continued to rebel against\\n\\t\\t\\t\\tGod.  And their humiliation and misery became a national\\n\\t\\t\\t\\tdisaster.  They were carried in captivity to Assyria. \\n\\t\\t\\t\\tThey were restored under the Persians, but still remained\\n\\t\\t\\t\\tunder the Persian yoke, and they were under the yoke of\\n\\t\\t\\t\\tthe Greeks, the Romans, and Araba.  They were scattered\\n\\t\\t\\t\\tall over the earth, and have been a wandering people ever\\n\\t\\t\\t\\tsince, because they rejected faith, slew God's messengers\\n\\t\\t\\t\\tand went on transgressing."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "62",
    "NoteID": "76",
    "Body": "Latest researches have revealed a small remnant of a\\n\\t\\t\\t\\treligious community numbering about 2,000 souls in Lower\\n\\t\\t\\t\\tIraq, near Basra.  In Arabic they are called Subbi\\n\\t\\t\\t\\t(plural Subba).  They are also called Sabians and\\n\\t\\t\\t\\tNasoraeans; or Mandaeans, or Christians of St. John. \\n\\t\\t\\t\\tThey claim to be Gnostics, of Knowers of the Great Life. \\n\\t\\t\\t\\tThey dress in white, and believe in frequent immersions\\n\\t\\t\\t\\tin water.  Their Book Ginza is in a dialect of Aramaic. \\n\\t\\t\\t\\tThey have theories of Darkness and Light as in\\n\\t\\t\\t\\tZoroastrianism.  They use the name Uardan (Jordan) for\\n\\t\\t\\t\\tany river.  They live in peace and harmony among their\\n\\t\\t\\t\\tMuslim neighbors.  They resemble the Sabi-un mentioned in\\n\\t\\t\\t\\tthe Qur-an but are not probably identical with them."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "62",
    "NoteID": "77",
    "Body": "CF. ii. 38, where the same phrase occurs.  And it recurs\\n\\t\\t\\t\\tagain and again afterwards.  The point of the verse is\\n\\t\\t\\t\\tthat Islam does not teach an exclusive doctrine, and is\\n\\t\\t\\t\\tnot meant exclusively for one people.  The Jews claimed\\n\\t\\t\\t\\tthis for themselves, and the Christians in their own\\n\\t\\t\\t\\torigin were a sect of the Jews. Even the modern organized\\n\\t\\t\\t\\tChristian churches, though they have been, consciously or\\n\\t\\t\\t\\tunconsciously, influenced by the Time-spirit, including\\n\\t\\t\\t\\tthe historical fact of Islam, yet cling to the idea of\\n\\t\\t\\t\\tVicarious Atonement, which means that all who do not\\n\\t\\t\\t\\tbelieve in it or who lived previously to the death of\\n\\t\\t\\t\\tChrist are at a disadvantage spiritually before the\\n\\t\\t\\t\\tThrone of God.\\tThe attitude of Islam is entirely\\n\\t\\t\\t\\tdifferent.  Islam existed before the preaching of\\n\\t\\t\\t\\tMuhammad on this earth: the Qur-an expressly calls\\n\\t\\t\\t\\tAbraham a Muslim (iii. 67).  Its teaching (submission to\\n\\t\\t\\t\\tGod's will) has been and will be the teaching of Religion\\n\\t\\t\\t\\tfor all time and for all peoples."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "63",
    "NoteID": "78",
    "Body": "The Mountain of Sinai (Tur-u-Sinin) a prominent mountain\\n\\t\\t\\t\\tin the Arabian desert, in the peninsula between the two\\n\\t\\t\\t\\tarms of the Red Sea.  Here the Ten Commandments and the\\n\\t\\t\\t\\tLaw were given to Moses.  Hence it is now called the\\n\\t\\t\\t\\tMountain of Moses (Jabal Musa).  The Israelites encamped\\n\\t\\t\\t\\tat the foot of it for nearly a year.  The Covenant was\\n\\t\\t\\t\\ttaken from them under many portents (Exod. xix.\\n\\t\\t\\t\\t5,8,16,18), which are described in Jewish tradition in\\n\\t\\t\\t\\tgreat detail.  Under thunder and lightening the mountain\\n\\t\\t\\t\\tmust indeed have appeared an awe-inspiring sight above to\\n\\t\\t\\t\\tthe Camp at its foot.  And the people solemnly entered\\n\\t\\t\\t\\tinto the Covenant: all the people answered together and\\n\\t\\t\\t\\tsaid, \"All that the Lord hath spoken we will do.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "65",
    "NoteID": "79",
    "Body": "The punishment for breach of the Sabbath under the Mosaic\\n\\t\\t\\t\\tlaw was death.\\t\"Every one that defieth it (the Sabbath)\\n\\t\\t\\t\\tshall surely be put to death; for whosoever doeth any\\n\\t\\t\\t\\twork therein, that soul shall be cut off from among his\\n\\t\\t\\t\\tpeople.\" (Exod. xxxi. 14).  There must have been a Jewish\\n\\t\\t\\t\\ttradition about a whole fishing community in a seaside\\n\\t\\t\\t\\ttown, which persisted in breaking the Sabbath and were\\n\\t\\t\\t\\tturned into apes; cf. vii. 163-166.  Or should we\\n\\t\\t\\t\\ttranslate in both these passages.  \"Be as apes\", instead\\n\\t\\t\\t\\tof \"Be apes\"?  This is the suggestion of Maulvi Muhammad\\n\\t\\t\\t\\tAli on this passage, on the authority of Mujabid and Ibn\\n\\t\\t\\t\\tJarir Tabari. The punishment would be, not for the breach\\n\\t\\t\\t\\tof the Sabbath in itself, but for their contumacious\\n\\t\\t\\t\\tdefiance of the Law."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "67",
    "NoteID": "80",
    "Body": "This story or parable of the heifer in ii. 67-71 should\\n\\t\\t\\t\\tbe read with the parable of the dead man brought to life\\n\\t\\t\\t\\tin ii. 72-73.  The stories were accepted in Jewish\\n\\t\\t\\t\\ttraditions, which are themselves based on certain\\n\\t\\t\\t\\tsacrificial directions in the Old Testament.  The heifer\\n\\t\\t\\t\\tstory of Jewish tradition is based on Num. xix. 1-10, in\\n\\t\\t\\t\\twhich Moses and Aaron ordered the Israelites to sacrifice\\n\\t\\t\\t\\ta red heifer without spot or blemish; her body was to be\\n\\t\\t\\t\\tburnt and the ashes were to be kept for the purification\\n\\t\\t\\t\\tof the congregation from sin.  The parable of the dead\\n\\t\\t\\t\\tman we shall refer to later. The lesson of the heifer\\n\\t\\t\\t\\tparable is plain. Moses announced the sacrifice the the\\n\\t\\t\\t\\tIsraelites, and they treated it as a jest. When Moses\\n\\t\\t\\t\\tcontinued solemnly to ask fo the sacrifice, they put him\\n\\t\\t\\t\\toff on one pretext and another, asking a number of\\n\\t\\t\\t\\tquestions which they could have answered themeselves if\\n\\t\\t\\t\\tthey had listened to Moses's directions. Their questions\\n\\t\\t\\t\\twere carping criticisms rather than the result of a\\n\\t\\t\\t\\tdesire for information. It was a mere thin pretence that\\n\\t\\t\\t\\tthey were genuinely seeking for guidance. When at last\\n\\t\\t\\t\\tthey were driven into a corner, they made the sacrifice,\\n\\t\\t\\t\\tbut the will was wanting, which would have made the\\n\\t\\t\\t\\tsacrifice efficacious for purification from sin. The real\\n\\t\\t\\t\\treason for their prevarications was their guilty\\n\\t\\t\\t\\tconscience, as we see in the parable of the dead man (ii.\\n\\t\\t\\t\\t72-73)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "72",
    "NoteID": "81",
    "Body": "In Deut. xxi. 1-9 it is ordained that if the body of a\\n\\t\\t\\t\\tslain man be found in a field and the slayer is not\\n\\t\\t\\t\\tknown, a heifer shall be beheaded, and the elders of the\\n\\t\\t\\t\\tcity next to the slain man's domicile shall wash their\\n\\t\\t\\t\\thands over the heifer and say that they neither did the\\n\\t\\t\\t\\tdeed nor saw it done, thus clearing themselves from the\\n\\t\\t\\t\\tblood-guilt. The Jewish story based on this was that in a\\n\\t\\t\\t\\tcertain case of this kind, every one tried to clear\\n\\t\\t\\t\\thimself of guilt and lay the blame at the door of others.\\n\\t\\t\\t\\tIn the first place they tried to prevaricate and prevent\\n\\t\\t\\t\\ta heifer being slain as in the last parable. When she was\\n\\t\\t\\t\\tslain, Allah by a miracle disclosed the really guilty\\n\\t\\t\\t\\tperson. A portion of the sacrificed heifer was ordered to\\n\\t\\t\\t\\tbe placed on the corpse, which came to life and disclosed\\n\\t\\t\\t\\tthe whole story of the crime.  The lesson of this parable\\n\\t\\t\\t\\tis that men may try to hide their crimes individually or\\n\\t\\t\\t\\tcollectively, but Allah will bring them to light in\\n\\t\\t\\t\\tunexpected ways. Applying this further to Jewish national\\n\\t\\t\\t\\thistory, the argument is developed in the following\\n\\t\\t\\t\\tverses that the Children of Israel played fast and loose\\n\\t\\t\\t\\twith their own rites and traditions, but they ould not\\n\\t\\t\\t\\tthus evade the consequences of their own sin."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "74",
    "NoteID": "82",
    "Body": "The sinner's heart gets harder and harder.  It is even\\n\\t\\t\\t\\tharder than rocks, of which a beautiful poetical allegory\\n\\t\\t\\t\\tis placed before us.  In nature we think there is nothing\\n\\t\\t\\t\\tharder than rocks.  But there are rocks that weep\\n\\t\\t\\t\\tvoluntarily, like repentant hearts that come to God of\\n\\t\\t\\t\\ttheir own accord; such are the rocks from which rivers\\n\\t\\t\\t\\tand springs flow spontaneously, sometimes in small\\n\\t\\t\\t\\ttrickles, sometimes in big volumes.  Then there are rocks\\n\\t\\t\\t\\twhich have to be split or dug into or blown up with\\n\\t\\t\\t\\tdynamite, and underneath we find abundant waters, as in\\n\\t\\t\\t\\twells beneath rocky soil.  Such are the hearts of a less\\n\\t\\t\\t\\tdegree of fineness, which yet melt into tears when some\\n\\t\\t\\t\\tgreat blow or calamity calls the mind to higher things. \\n\\t\\t\\t\\tAnd lastly, there are the rocks which slip or sink by\\n\\t\\t\\t\\tgeological pressure or in an earthquake, and send forth\\n\\t\\t\\t\\tlarge spouts of water, as happened, for example, in the\\n\\t\\t\\t\\tBihar earthquake of 1934; such sinking or quaking may be\\n\\t\\t\\t\\tpoetically ascribed to fear.  So there are hearts which\\n\\t\\t\\t\\twill come to God by no higher motive than fear, but yet\\n\\t\\t\\t\\tfear will melt them into tears of repentance. But the\\n\\t\\t\\t\\thardened sinner is worse than all these.  His case is\\n\\t\\t\\t\\tworse than that of rocks, for nothing will melt him."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "76",
    "NoteID": "83",
    "Body": "The immediate argument applies to the Jews of Medina, but\\n\\t\\t\\t\\tthe more general argument applies to the people of Faith\\n\\t\\t\\t\\tand the people without Faith, as we shall see below.  If\\n\\t\\t\\t\\tthe Muslims of Medina ever entertained the hope that the\\n\\t\\t\\t\\tJews in their city would as a body welcome Muhammad\\n\\t\\t\\t\\tMustafa as the Prophet prophesied in their own books,\\n\\t\\t\\t\\tthey were mistaken.  In Deut. xviii. 18, they read: \"I\\n\\t\\t\\t\\twill raise them up a Prophet from among their brethren,\\n\\t\\t\\t\\tlike unto thee.\" (i.e., like unto Moses) which was\\n\\t\\t\\t\\tinterpreted by some of their doctors as referring to\\n\\t\\t\\t\\tMuhammad, and they came into Islam.  The Arabs are a\\n\\t\\t\\t\\tkindred branch of the Semitic family, and are correctly\\n\\t\\t\\t\\tdescribed in relation to the Jews as \"their brethren\";\\n\\t\\t\\t\\tand there is no question that there was not another\\n\\t\\t\\t\\tProphet \"like unto Moses\" until Muhammad came; in fact\\n\\t\\t\\t\\tthe postcript of Deuteronomy, which was written many\\n\\t\\t\\t\\tcenturies after Moses, says: \"There arose not a prophet\\n\\t\\t\\t\\tsince in Israel like unto Moses, whom the Lord knew face\\n\\t\\t\\t\\tto face.\" But the Jews as a body were jealous of\\n\\t\\t\\t\\tMuhammad, and played a double part.  When the Muslim\\n\\t\\t\\t\\tcommunity began to grow stronger they pretended to be of\\n\\t\\t\\t\\tthem, but really tried to keep back any knowledge of\\n\\t\\t\\t\\ttheir own Scriptures from them, lest they should be\\n\\t\\t\\t\\tbeaten by their own arguments. The more general\\n\\t\\t\\t\\tinterpretation holds good in all ages. Faith and Unfaith\\n\\t\\t\\t\\tare pitted against each other. Faith has to struggle\\n\\t\\t\\t\\tagainst power, position, organization, and privilege.\\n\\t\\t\\t\\tWhen it gains ground, Unfaith comes forward insincerely\\n\\t\\t\\t\\tand claims fellowship. But in its own mind it is jealous\\n\\t\\t\\t\\tof the armoury of sience and knowledge which Faith brings\\n\\t\\t\\t\\tinto the service of Allah.  But Allah knows all, and if\\n\\t\\t\\t\\tthe people of Faith will only seek knowledge sincerely\\n\\t\\t\\t\\twherefver they can find it,-even as far afield as China,\\n\\t\\t\\t\\tas Muhammad said, they can defeat Unfaith on its own\\n\\t\\t\\t\\tground. [Even though the directive that Muslims should\\n\\t\\t\\t\\tderive knowledge regardless of its location is an\\n\\t\\t\\t\\tacceptable proposition from the Islamic viewpoint, the\\n\\t\\t\\t\\ttradition to which the author refers here is not\\n\\t\\t\\t\\tauthentic]."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "78",
    "NoteID": "84",
    "Body": "The argument of i. 76 is continued.  The Jews wanted to\\n\\t\\t\\t\\tkeep back knowledge, but what knowledge had they?  Many\\n\\t\\t\\t\\tof them, even if they could read, were no better than\\n\\t\\t\\t\\tilliterates, for they knew not their own true Scriptures,\\n\\t\\t\\t\\tbut read into them what they wanted, or at best their own\\n\\t\\t\\t\\tconjectures.  They palmed off their own writings for the\\n\\t\\t\\t\\tMessage of God.  Perhaps it brought them profit for the\\n\\t\\t\\t\\ttime being; but it was a miserable profit if they \"gained\\n\\t\\t\\t\\tthe whole world and lost their own souls\" (Matt. xvi.\\n\\t\\t\\t\\t26).  \"Writing with their own hands\" means inventing\\n\\t\\t\\t\\tbooks themselves, which had no divine authority. The\\n\\t\\t\\t\\tgeneral argument is similar. Unfaith erects its own false\\n\\t\\t\\t\\tgods. It attributes things to causes which only exist in\\n\\t\\t\\t\\tits own imagination. Sometimes it even indulges in actual\\n\\t\\t\\t\\tdishonest traffic in the ignorance of the multitude. It\\n\\t\\t\\t\\tmay pay for a time, but the bubble always bursts."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "80",
    "NoteID": "85",
    "Body": "The Jews in their arrogance might say: Whatever the\\n\\t\\t\\t\\tterror of Hell may be for other people, our sins will be\\n\\t\\t\\t\\tforgiven, because we are the children of Abraham; at\\n\\t\\t\\t\\tworst, we shall suffer a short definite punishment and\\n\\t\\t\\t\\tthen be restored to the \"bosom of Abraham\".  This bubble\\n\\t\\t\\t\\tis pricked here.  Read this verse with ii. 81-82. The\\n\\t\\t\\t\\tgeneral application is also clear. If Unfaith claims some\\n\\t\\t\\t\\tspecial prerogative, such as race, \"civilation,\"\\n\\t\\t\\t\\tpolitical power, historical experience, and so on, these\\n\\t\\t\\t\\twill not avail in Allah's sight. His promise is sure, but\\n\\t\\t\\t\\tHis promise is for those who seek Allah in Faith, and\\n\\t\\t\\t\\tshow it in their conduct."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "81",
    "NoteID": "86",
    "Body": "This is many degrees worse than merely falling into evil:\\n\\t\\t\\t\\tit is going out to \"earn evil\" as the Arabic text has it,\\n\\t\\t\\t\\ti.e., to seek gain in evil.  Such a perverse attitude\\n\\t\\t\\t\\tmeans that the moral and spiritual fortress erected\\n\\t\\t\\t\\taround us by the Grace of God is voluntarily surrendered\\n\\t\\t\\t\\tby us and demolished by Evil, which erects its own\\n\\t\\t\\t\\tfortress, so that access to Good may be more and more\\n\\t\\t\\t\\tdifficult."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "83",
    "NoteID": "87",
    "Body": "So far from the Covenant being of the kind you suggest in\\n\\t\\t\\t\\tii. 80, the real Covenant is about the moral law, which\\n\\t\\t\\t\\tis set out in ii. 83.  This moral law is universal and if\\n\\t\\t\\t\\tyou break it, no privileges will lighten your punishment\\n\\t\\t\\t\\tor help you in any way (ii. 86).  \"Speak fair to the\\n\\t\\t\\t\\tpeople\" not only means outward courtesy from the leaders\\n\\t\\t\\t\\tto the meanest among the people, but the protection of\\n\\t\\t\\t\\tthe people from being exploited, deceived, defrauded, or\\n\\t\\t\\t\\tdoped with things to lull their intelligence."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "84",
    "NoteID": "88",
    "Body": "Verse 83 referred to the universal moral law.  This verse\\n\\t\\t\\t\\t84 refers to its application under a special Covenant\\n\\t\\t\\t\\tentered into with the Jews of Medina by the new-born\\n\\t\\t\\t\\tMuslim Commonwealth under its Guide and teacher Muhammad.\\n\\t\\t\\t\\t This Covenant is given in Ibn Hisham's Sivat-ur-Rasul,\\n\\t\\t\\t\\tand comments on it will be found in Ameer Ali's Spirit of\\n\\t\\t\\t\\tIslam (London 1922), pp. 57-61.  It was entered into in\\n\\t\\t\\t\\tthe second year of the Hijra, and was treacherously\\n\\t\\t\\t\\tbroken by the Jews almost immediately afterwards."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "85",
    "NoteID": "89",
    "Body": "I understand \"ransom them\" here to mean \"take ransom for\\n\\t\\t\\t\\tthem\" though most of the Commentators take it to mean\\n\\t\\t\\t\\t\"give ransom for them\".  Mustafa had made a Pact which,\\n\\t\\t\\t\\tif it had been faithfully observed by all parties, would\\n\\t\\t\\t\\thave brought a reign of law and order for Medina.  But\\n\\t\\t\\t\\tsome of the treacherous Jews never intended to observe\\n\\t\\t\\t\\tits terms.  They fought and slew each other and not only\\n\\t\\t\\t\\tbanished those who were obnoxious to them but intrigued\\n\\t\\t\\t\\twith their enemies. If by chance they came back into\\n\\t\\t\\t\\ttheir hands as captives, they demanded ransom for them to\\n\\t\\t\\t\\treturn to their homes although they had no right to\\n\\t\\t\\t\\tbanish them at all.  If we understand by \"ransom them\"\\n\\t\\t\\t\\tpay \"ransom for them to release them from the hands of\\n\\t\\t\\t\\ttheir enemies,\" it would mean that they did this pious\\n\\t\\t\\t\\tact for show, although they were themselves the authors\\n\\t\\t\\t\\tof their unlawful banishment.  I think the former makes\\n\\t\\t\\t\\tbetter sense."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "87",
    "NoteID": "89",
    "Body": "I understand \"ransom them\" here to mean \"take ransom for\\n\\t\\t\\t\\tthem\" though most of the Commentators take it to mean\\n\\t\\t\\t\\t\"give ransom for them\".  Mustafa had made a Pact which,\\n\\t\\t\\t\\tif it had been faithfully observed by all parties, would\\n\\t\\t\\t\\thave brought a reign of law and order for Medina.  But\\n\\t\\t\\t\\tsome of the treacherous Jews never intended to observe\\n\\t\\t\\t\\tits terms.  They fought and slew each other and not only\\n\\t\\t\\t\\tbanished those who were obnoxious to them but intrigued\\n\\t\\t\\t\\twith their enemies. If by chance they came back into\\n\\t\\t\\t\\ttheir hands as captives, they demanded ransom for them to\\n\\t\\t\\t\\treturn to their homes although they had no right to\\n\\t\\t\\t\\tbanish them at all.  If we understand by \"ransom them\"\\n\\t\\t\\t\\tpay \"ransom for them to release them from the hands of\\n\\t\\t\\t\\ttheir enemies,\" it would mean that they did this pious\\n\\t\\t\\t\\tact for show, although they were themselves the authors\\n\\t\\t\\t\\tof their unlawful banishment.  I think the former makes\\n\\t\\t\\t\\tbetter sense."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "87",
    "NoteID": "90",
    "Body": "As to the birth of Jesus, cf. xix. 16-34.  Why is he\\n\\t\\t\\t\\tcalled the \"Son of Mary\"? What are his \"clear signs\"? \\n\\t\\t\\t\\tWhat is the \"holy spirit\" by which he was strenghtened? \\n\\t\\t\\t\\tWe reserve to a later state a discussion of the Quranic\\n\\t\\t\\t\\tteaching on these questions.  See iii. 62, n. 401."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "87",
    "NoteID": "91",
    "Body": "Notice the sudden transition from the past tense in \"some\\n\\t\\t\\t\\tye called imposters\" to the present tense in \"others ye\\n\\t\\t\\t\\tslay.\"\\tThere is a double significance. First, reviewing\\n\\t\\t\\t\\tthe long course of Jewish history, we have come to the\\n\\t\\t\\t\\ttime of Jesus; they have often given the lie to God's\\n\\t\\t\\t\\tApostles, and even now they are trying to slay Jesus. \\n\\t\\t\\t\\tSecondly, extending the review of that history to the\\n\\t\\t\\t\\ttime of Muhammad, they are even now trying to take the\\n\\t\\t\\t\\tlife of that holy Apostle.  This would be literally true\\n\\t\\t\\t\\tat the time the words were promulgated to the people. \\n\\t\\t\\t\\tAnd this transition leads on naturally to the next verse,\\n\\t\\t\\t\\twhich refers to the actual conditions before Muhammad in\\n\\t\\t\\t\\tMedina in the second year of the Hijra. Sections 11/13\\n\\t\\t\\t\\t(ii. 87-121) refer to the People of the Book generally,\\n\\t\\t\\t\\tJews and Christians. Even where Moses and the Law of\\n\\t\\t\\t\\tSinai are referred to, those traditions are common to\\n\\t\\t\\t\\tboth Jews and Christians. The argument is about the\\n\\t\\t\\t\\tpeople who ought to have learnt from previous Revelations\\n\\t\\t\\t\\tand welcomed Muhammad's teaching, and yet they both took\\n\\t\\t\\t\\tup an attitude of arrogant rejection."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "88",
    "NoteID": "92",
    "Body": "The Jews in their arrogance claimed that all wisdom and\\n\\t\\t\\t\\tall knowledge of God were enclosed in their hearts.  But\\n\\t\\t\\t\\tthere were more things in heaven and earth than were\\n\\t\\t\\t\\tdreamt of in their philosophy.\\tTheir claim was not only\\n\\t\\t\\t\\tarrogance but blasphemy.  In reality they were men\\n\\t\\t\\t\\twithout Faith.\\t(I take Gulfan here to be the plural of\\n\\t\\t\\t\\tGilafun the wrapping or cover of a book, in which the\\n\\t\\t\\t\\tbook is preserved.) As usual, there is a much wider\\n\\t\\t\\t\\tmeaning. How many people at all times and among all\\n\\t\\t\\t\\tnations close their hearts to any extension of knowlege\\n\\t\\t\\t\\tor spiritual influence because of some little fragment\\n\\t\\t\\t\\twhich they have got and which they think is the whole of\\n\\t\\t\\t\\tAllah's Truth? Such an attitude shows really want of\\n\\t\\t\\t\\tfaith and is a blasphemous limitation of Allah's\\n\\t\\t\\t\\tunlimited spiritual gifts to His creatures. [According to\\n\\t\\t\\t\\tanother view, the verse refers to the Jewish claim that a\\n\\t\\t\\t\\tcovering had been placed over their hearts which\\n\\t\\t\\t\\tprevented them from grasping the message of the Prophet\\n\\t\\t\\t\\t(peace be on him). See Ibn Kathir's commentary on the\\n\\t\\t\\t\\tverse. See also verse iv. 155.]"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "88",
    "NoteID": "93",
    "Body": "The root kafara has many shades of meaning: (1) to deny\\n\\t\\t\\t\\tGod's goodness, to be ungrateful, (2) to reject Faith,\\n\\t\\t\\t\\tdeny His revelation, (3) to blaspheme, to ascribe some\\n\\t\\t\\t\\tlimitation or attribute to God which is derogatory to His\\n\\t\\t\\t\\tnature. In a translation, one shade or another must be\\n\\t\\t\\t\\tput forward according to the context, but all are\\n\\t\\t\\t\\timplied."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "89",
    "NoteID": "94",
    "Body": "The Jews, who pretended to be so superior to the people\\n\\t\\t\\t\\twithout Faith - the Gentiles - should have been the first\\n\\t\\t\\t\\tto recognize the new Truth - or the Truth renewed - which\\n\\t\\t\\t\\tit was Muhammad's mission to bring because it was so\\n\\t\\t\\t\\tsimilar in form and language to what they had already\\n\\t\\t\\t\\treceived.  But they had more arrogance than faith.  It is\\n\\t\\t\\t\\tthis want of faith that brings on the curse, i.e.,\\n\\t\\t\\t\\tdeprives us (if we adopt such an attitude) of the\\n\\t\\t\\t\\tblessings of God. Again the lesson applies to a much\\n\\t\\t\\t\\twider circle than the Jews. We are all apt, in our\\n\\t\\t\\t\\tperverseness, to reject an appeal form our brother even\\n\\t\\t\\t\\tmore summarily than one from an outsider. If we have a\\n\\t\\t\\t\\tglimmering of the truth, we are apt to make ourselves\\n\\t\\t\\t\\timpervious to further truth, and thus lose the benefit of\\n\\t\\t\\t\\tAllah's Grace."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "90",
    "NoteID": "95",
    "Body": "Racial arrogance made the Jews averse to the reception of\\n\\t\\t\\t\\tTruth when it came through a servant of God, not of their\\n\\t\\t\\t\\town race.  Again the lesson is wider.  Is that averseness\\n\\t\\t\\t\\tunknown in our own times, and among other races?  Yet how\\n\\t\\t\\t\\tcan a race or a people set bounds to God's choice?  God\\n\\t\\t\\t\\tis the Creater and Cherisher of all races and all worlds."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "91",
    "NoteID": "96",
    "Body": "Even the race argument is often flimsy and hollow\r\\n\\t\\t\\t\\tpretext.  Did not the Jews reject Prophets of their own\r\\n\\t\\t\\t\\trace who told them unpleasant truths?  And do not other\r\\n\\t\\t\\t\\tnations do likewise?  The real trouble is selfishness,\r\\n\\t\\t\\t\\tnarrowness, a mean dislike of anything which runs counter\r\\n\\t\\t\\t\\tto habits, customs or inclinations."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "93",
    "NoteID": "97",
    "Body": "Cf. the introductory words of ii. 63 which are the same\\n\\t\\t\\t\\tas the introductory words here but the argument is\\n\\t\\t\\t\\tdeveloped in a different direction in the two places.  In\\n\\t\\t\\t\\tii. 63, after they are reminded of the solemn Covenant\\n\\t\\t\\t\\tunder the towering height of Mount Sinai they are told\\n\\t\\t\\t\\thow they broke the Covenant in after ages.  Here, after\\n\\t\\t\\t\\tthey are reminded of the same solemn Covenant, they are\\n\\t\\t\\t\\ttold that even then they never meant to observe it. \\n\\t\\t\\t\\tTheir thought is expressed in biting words of sarcasm. \\n\\t\\t\\t\\tThey said in words: \"All that the Lord hath spoken we\\n\\t\\t\\t\\twill do\"  But they said in their hearts: \"We shall\\n\\t\\t\\t\\tdisobey\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "93",
    "NoteID": "98",
    "Body": "What they should have said was: \"We hear and we obey\"\\n\\t\\t\\t\\tthis is the attitude of the true men of Faith (ii. 285)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "93",
    "NoteID": "99",
    "Body": "After the Commandments and the Law had been given at\\n\\t\\t\\t\\tMount Sinai, and the people had solemnly given their\\n\\t\\t\\t\\tCovenant,  Moses went up to the Mount, and in his\\n\\t\\t\\t\\tabsence, the people made the golden calf.  When Moses\\n\\t\\t\\t\\treturned, his anger waxed hot.\\t\"He took the Calf which\\n\\t\\t\\t\\tthey had made, and burnt it in the fire, and ground it to\\n\\t\\t\\t\\tpowder, and strewed it upon the water, and made the\\n\\t\\t\\t\\tchildren of Israel drink of it.\"  (Exod. xxxii. 20). \\n\\t\\t\\t\\tThis incident is interpreted in the Qur-an allegorically.\\n\\t\\t\\t\\t The Calf is the symbol of disobedience, rebellion, want\\n\\t\\t\\t\\tof faith.  It was like a taint of poison.  Their\\n\\t\\t\\t\\tpunishment was to swallow the taint of poison which they\\n\\t\\t\\t\\thad themselves produced.  They swallowed it not into\\n\\t\\t\\t\\ttheir stomachs, but into their hearts, their very being. \\n\\t\\t\\t\\tThey had to mortify and humble themselves in the sight of\\n\\t\\t\\t\\tGod, as was shown in another allegory based on the Jewish\\n\\t\\t\\t\\tnarrative (see ii. 54 and note, above)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "95",
    "NoteID": "100",
    "Body": "The phrase \"What their hands have sent on before them\"\\n\\t\\t\\t\\tfrequently occurs in the Qur-an.  Here, and in many\\n\\t\\t\\t\\tplaces, it refers to sins.  In such passages as lxxviii.\\n\\t\\t\\t\\t40, or lxxxi. 14, it is implied that both good and bad\\n\\t\\t\\t\\tdeeds go before us to the judgement seat of God before we\\n\\t\\t\\t\\tdo ourselves.  In ii. 110, it is the good that goes\\n\\t\\t\\t\\tbefore us.  Our deeds are personified.\\tThey are\\n\\t\\t\\t\\twitnesses for or against us, and they always go before\\n\\t\\t\\t\\tus.  Their good or bad influence begins to operate before\\n\\t\\t\\t\\twe even know it.  This is more general than the New\\n\\t\\t\\t\\tTestament idea in the First Epistle of St. Paul to\\n\\t\\t\\t\\tTimothy, v. 24: \"Some men's sins are open beforehand,\\n\\t\\t\\t\\tgoing before to judgment; and some men they follow\\n\\t\\t\\t\\tafter.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "97",
    "NoteID": "101",
    "Body": "A party of the Jews in the time of Muhammad ridiculed the\\n\\t\\t\\t\\tMuslim belief that Gabriel brought down revelations to\\n\\t\\t\\t\\tMuhammad Mustafa.  Michael was called in their books \"the\\n\\t\\t\\t\\tgreat prince which standeth for the children of thy\\n\\t\\t\\t\\tpeople\": (Daniel xiii. 1).  The vision of Gabriel\\n\\t\\t\\t\\tinspired fear (Daniel, viii. 16-17). But this pretence -\\n\\t\\t\\t\\tthat Michael was their friend and Gabriel their enemy -\\n\\t\\t\\t\\twas merely a manifestation of their unbelief in angels,\\n\\t\\t\\t\\tapostles, and God Himself; and such unbelief could not\\n\\t\\t\\t\\twin the love of God.  In any case it was disingenuous to\\n\\t\\t\\t\\tsay that they believed in one angel and not in another.\\n\\t\\t\\t\\tMuhammad's inspiration was through visions of Gabriel. \\n\\t\\t\\t\\tMuhammad had been helped to the highest spiritual light,\\n\\t\\t\\t\\tand the message which he delivered and his spotless\\n\\t\\t\\t\\tintegrity and exemplary life were manifest Signs which\\n\\t\\t\\t\\tevery one could understand except those who were\\n\\t\\t\\t\\tobstinate and perverse.  Besides, the verses of the\\n\\t\\t\\t\\tQur-an were in themselves reasonable and clear."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "101",
    "NoteID": "102",
    "Body": "I think that by \"the Book of God\" here is meant, not the\\n\\t\\t\\t\\tQur-an, but the Book which the People of the Book had\\n\\t\\t\\t\\tbeen given, viz., the previous Revelations. The argument\\n\\t\\t\\t\\tis that Muhammad's Message was similar to Revelations\\n\\t\\t\\t\\twhich they had already received, and if they had looked\\n\\t\\t\\t\\tinto their own Books honestly and sincerely, they would\\n\\t\\t\\t\\thave found proofs in them to show that the new Message\\n\\t\\t\\t\\twas true and from God.\\tBut they ignored their own Books\\n\\t\\t\\t\\tor twisted or distorted them according to their own\\n\\t\\t\\t\\tfancies.  Worse, they followed something which was\\n\\t\\t\\t\\tactually false and mischeivous and inspired by the evil\\n\\t\\t\\t\\tone.  Such was the belief in magic and sorcery.  These\\n\\t\\t\\t\\tare described in the next verse in terms referring to the\\n\\t\\t\\t\\tbeliefs and practices of the \"People of the Book.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "102",
    "NoteID": "103",
    "Body": "This is a continuation of the argument in ii. 101.  The\\n\\t\\t\\t\\tPeople of the Book, instead of sticking to the plain\\n\\t\\t\\t\\tBooks of Revelations, and seeking to do the will of God\\n\\t\\t\\t\\tran after all sorts of occult knowledge, most of which\\n\\t\\t\\t\\twas false and evil.  Many wonderful tales of occult power\\n\\t\\t\\t\\tattributed the power of Solomon to magic.  But Solomon\\n\\t\\t\\t\\tdealt in not arts of evil.  It was the powers of evil\\n\\t\\t\\t\\tthat pretended to force the laws of nature and the will\\n\\t\\t\\t\\tof God; such a pretense is plainly blasphemy."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "102",
    "NoteID": "104",
    "Body": "This verse has been interpreted variously.  Whe were\\n\\t\\t\\t\\tHarut and Marut?  What did they teach?\\tWhy did they\\n\\t\\t\\t\\tteach it?  The view which commends itself to me is that\\n\\t\\t\\t\\tof the Tafsir Haqqani following Baidhawi and the Tafsir\\n\\t\\t\\t\\tKabir.\\tThe word \"angels\" as applied to Harut and Marut\\n\\t\\t\\t\\tis figurative.\\tIt means \"good men, of knowledge, science\\n\\t\\t\\t\\t(or wisdom) and power.\"  In modern language the word\\n\\t\\t\\t\\t\"angel\" is applied to a good and beautiful woman.  The\\n\\t\\t\\t\\tearlier tradition made angels masculine, and applied to\\n\\t\\t\\t\\tthem the attributes which I have mentioned, along with\\n\\t\\t\\t\\tthe attribute of beauty, which was implied in goodness,\\n\\t\\t\\t\\tknowledge, wisdom, and power."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "102",
    "NoteID": "105",
    "Body": "What the evil ones learnt from Harut and Marut (see last\\n\\t\\t\\t\\tnote) they turned to evil.  When mixed with fraud and\\n\\t\\t\\t\\tdeception, it appeared as charms and spells of love\\n\\t\\t\\t\\tpotions.  They did nothing but cause discord between the\\n\\t\\t\\t\\tsexes.\\tBut of course their power was limited to the\\n\\t\\t\\t\\textent to which God permitted the evil to work, for His\\n\\t\\t\\t\\tgrace protected all who sought His guidance and repented\\n\\t\\t\\t\\tand returned to Him.  But apart from the harm that these\\n\\t\\t\\t\\tfalse pretenders might do to others, the chief harm which\\n\\t\\t\\t\\tthey did was to their own souls.  They sold themselves\\n\\t\\t\\t\\tinto slavery to the Evil One, as is shown in the allegory\\n\\t\\t\\t\\tof Goethe's Faust.  That allegory dealt with the\\n\\t\\t\\t\\tindividual soul.  Here the tragedy is shown to occur not\\n\\t\\t\\t\\tonly to individuals but to whole groups of people, for\\n\\t\\t\\t\\texample, the People of the Book.  Indeed the story might\\n\\t\\t\\t\\tbe extended indefinitely."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "104",
    "NoteID": "105",
    "Body": "What the evil ones learnt from Harut and Marut (see last\\n\\t\\t\\t\\tnote) they turned to evil.  When mixed with fraud and\\n\\t\\t\\t\\tdeception, it appeared as charms and spells of love\\n\\t\\t\\t\\tpotions.  They did nothing but cause discord between the\\n\\t\\t\\t\\tsexes.\\tBut of course their power was limited to the\\n\\t\\t\\t\\textent to which God permitted the evil to work, for His\\n\\t\\t\\t\\tgrace protected all who sought His guidance and repented\\n\\t\\t\\t\\tand returned to Him.  But apart from the harm that these\\n\\t\\t\\t\\tfalse pretenders might do to others, the chief harm which\\n\\t\\t\\t\\tthey did was to their own souls.  They sold themselves\\n\\t\\t\\t\\tinto slavery to the Evil One, as is shown in the allegory\\n\\t\\t\\t\\tof Goethe's Faust.  That allegory dealt with the\\n\\t\\t\\t\\tindividual soul.  Here the tragedy is shown to occur not\\n\\t\\t\\t\\tonly to individuals but to whole groups of people, for\\n\\t\\t\\t\\texample, the People of the Book.  Indeed the story might\\n\\t\\t\\t\\tbe extended indefinitely."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "106",
    "NoteID": "107",
    "Body": "The word which I have translated by the word\\n\\t\\t\\t\\t\"revelations\" is Ayat.\\tSee C.41 and n. 15.  It is not\\n\\t\\t\\t\\tonly used for verses of the Qur-an, but in a general\\n\\t\\t\\t\\tsense for God's revelations, as in ii. 39 and for other\\n\\t\\t\\t\\tSigns of God in history or nature, or miracles, as in ii.\\n\\t\\t\\t\\t61.  It has even been used for human signs and tokens of\\n\\t\\t\\t\\twonder, as, for example, monuments or landmarks built by\\n\\t\\t\\t\\tthe ancient people of Ad (xxvi. 128).  What is the\\n\\t\\t\\t\\tmeaning here?  If we take it in a general sense, it means\\n\\t\\t\\t\\tthat God's Message from age to age is always the same,\\n\\t\\t\\t\\tbut that its form may differ according to the needs and\\n\\t\\t\\t\\texigencies of the time.  That form was different as given\\n\\t\\t\\t\\tto Moses and then to Jesus and then to Muhammad. Some\\n\\t\\t\\t\\tcommentators apply it also to the Ayat of the Qur-an. \\n\\t\\t\\t\\tThere is nothing derogatory in this if we believe in\\n\\t\\t\\t\\tprogressive revelation.  In iii. 7 we are told distinctly\\n\\t\\t\\t\\tabout the Qur-an, that some of its verses are basic or\\n\\t\\t\\t\\tfundamental, and others are allegorical, and it is\\n\\t\\t\\t\\tmischievous to treat the allegorical verses and follow\\n\\t\\t\\t\\tthem (literally).  On the other hand, it is absurd to\\n\\t\\t\\t\\ttreat such a verse as ii. 115 as if it were abrograted by\\n\\t\\t\\t\\tii. 144 about the Qibla.  We turn to the Qibla, but we do\\n\\t\\t\\t\\tnot believe that God is only in one place.  He is\\n\\t\\t\\t\\teverywhere.  See second note to ii. 144."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "108",
    "NoteID": "108",
    "Body": "Moses was contantly harassed with foolish, impertinent,\\n\\t\\t\\t\\tor disingenuous questions by his own people.  We must not\\n\\t\\t\\t\\tfollow that bad example.  Questions should be asked only\\n\\t\\t\\t\\tfor real instruction."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "108",
    "NoteID": "109",
    "Body": "\"Even way\": the Arabic word sawaa signifies smoothness as\\n\\t\\t\\t\\topposed to roughness: symmetry as opposed to want of\\n\\t\\t\\t\\tplan; equality or proportion as opposed to want of\\n\\t\\t\\t\\tdesign; rectitude as opposed to crookedness; a mean as\\n\\t\\t\\t\\topposed to extremes; and fitness for the object held in\\n\\t\\t\\t\\tview as opposed to faultiness."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "109",
    "NoteID": "110",
    "Body": "There words are used in the Qur-an, with a meaning akin\\n\\t\\t\\t\\tto \"forgive\" but each with a different shade of meaning. \\n\\t\\t\\t\\tAfa (here translated \"forgive\") means to forget, to\\n\\t\\t\\t\\tobliterate from one's mind.  Safaha (here translated\\n\\t\\t\\t\\t\"overlook\") means to turn away from, to ignore, to treat\\n\\t\\t\\t\\ta matter as if it did not affect one. Gafara (which does\\n\\t\\t\\t\\tnot occur in this verse) means to cover up something as\\n\\t\\t\\t\\tGod does to our sins with His grace; this word is\\n\\t\\t\\t\\tparticularly appropriate in God's attribute of Gaffar,\\n\\t\\t\\t\\tthe One who forgives again and again."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "109",
    "NoteID": "111",
    "Body": "The word Amr is comprehensive and includes (1) an order\\n\\t\\t\\t\\tor command as in xcvi. 12; or (2) a purpose, design, will\\n\\t\\t\\t\\tas in xviii. 82; or (3) affairs, working, doing, carrying\\n\\t\\t\\t\\tout or execution of a design, as in lxxxix 5.  In many\\n\\t\\t\\t\\tcases some of these meanings run together."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "109",
    "NoteID": "112",
    "Body": "Note how this phrase, seemingly repeated from ii. 106,\\n\\t\\t\\t\\tand occurring in many other places, has an appropriate\\n\\t\\t\\t\\tsignification in each place.  In ii. 106 we were told\\n\\t\\t\\t\\tabout progressive revelation, how the same thing may take\\n\\t\\t\\t\\tdifferent forms and seeming human infirmity contribute to\\n\\t\\t\\t\\tthe fulfillment of God's design, for God's power is\\n\\t\\t\\t\\tunlimited.  Here we are told to be patient and forgiving\\n\\t\\t\\t\\tagainst envy and injustice: this too may be fulfilling\\n\\t\\t\\t\\tGod's purpose, for His power is infinite."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "110",
    "NoteID": "113",
    "Body": "Cf. ii. 95 n."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "112",
    "NoteID": "114",
    "Body": "The word translated \"self\" is Wajh, a comprehensive\\n\\t\\t\\t\\tArabic word.  It means (1) literally \"face\" but it may\\n\\t\\t\\t\\timply (2) countenance or favour, as in xcii. 20; (3)\\n\\t\\t\\t\\thonour, glory, Presence as applied to God, as in ii. 115\\n\\t\\t\\t\\tand perhaps also in lv. 27; (4) cause, sake (\"for the\\n\\t\\t\\t\\tsake of\") as in lxxvi 8; (5) the first part, the\\n\\t\\t\\t\\tbeginning as in iii. 71; (6) nature, inner being,\\n\\t\\t\\t\\tessence, self, as in v. 111, xxviii 88, and perhaps also\\n\\t\\t\\t\\tin lv. 27.  Here I understand meaning 6; the face\\n\\t\\t\\t\\texpresses the personality or the whole inner self of man."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "112",
    "NoteID": "115",
    "Body": "This phrase comes in aptly in its own context many times.\\n\\t\\t\\t\\t In this Sura it occurs in 11, 38, 62, 112, 262, 274, and\\n\\t\\t\\t\\t277.  It serves the same purpose as a refrain in a very\\n\\t\\t\\t\\twell-arranged song, or a motif in Wagner's powerful\\n\\t\\t\\t\\tmusic."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "113",
    "NoteID": "116",
    "Body": "It is a sure sign of ignorance and prejudice when you\\n\\t\\t\\t\\tstudy the same book as another or a similar one and yet\\n\\t\\t\\t\\tare absolutely intolerant of the meaning which the other\\n\\t\\t\\t\\tdraws from it.\\tYou should know better, but you speak\\n\\t\\t\\t\\tlike the ignorant.  In this case the primary reference in\\n\\t\\t\\t\\tthe word \"ignorant\" may be to the Pagan Arabs."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "114",
    "NoteID": "117",
    "Body": "There were actually Pagans in Mecca who tried to shut out\\n\\t\\t\\t\\tthe Muslim Arabs from the Ka'ba, the universal place of\\n\\t\\t\\t\\tArab worship.  The Pagans themselves called it the House\\n\\t\\t\\t\\tof God.  With what face could they exclude the Muslims,\\n\\t\\t\\t\\twho wanted to worship the true God instead of worshipping\\n\\t\\t\\t\\tidols?\\tIf these Pagans had succeeded, they would only\\n\\t\\t\\t\\thave caused violent divisions among the Arabs and\\n\\t\\t\\t\\tdestroyed the sanctity and the very existence of the\\n\\t\\t\\t\\tKa'ba."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "115",
    "NoteID": "118",
    "Body": "The word translated \"Presence\" is Wajh, literally \"face.\"\\n\\t\\t\\t\\t- See note to ii. 112 above."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "116",
    "NoteID": "119",
    "Body": "It is a derogation from the glory of God - in fact it is\\n\\t\\t\\t\\tblasphemy - to say that God begets sons, like a man or an\\n\\t\\t\\t\\tanimal.  The Christian doctrine is here emphatically\\n\\t\\t\\t\\trepudiated.  If words have any meaning, it would mean an\\n\\t\\t\\t\\tattribution of God of a material nature, and of the lower\\n\\t\\t\\t\\tanimal functions of sex.  In a spiritual sense, we are\\n\\t\\t\\t\\tall children of God.  And all Creation celebrates His\\n\\t\\t\\t\\tglory.\\tVerse 117 should be read with this to complete\\n\\t\\t\\t\\tthe argument."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "117",
    "NoteID": "120",
    "Body": "The previous verse told us that everything in heaven and\\n\\t\\t\\t\\tearth celebrates the glory of God.  Lest anyone should\\n\\t\\t\\t\\tthink that the heavens and the earth were themselves\\n\\t\\t\\t\\tprimeval and eternal, we are now told that they\\n\\t\\t\\t\\tthemselves are creatures of God's will and design.  Cf\\n\\t\\t\\t\\tvi. 102, where the word bada'a is used as here for the\\n\\t\\t\\t\\tcreation of the heavens and the earth, and khalaqa is\\n\\t\\t\\t\\tused for the creation of all things.  Bada'a goes back to\\n\\t\\t\\t\\tthe very primal beginning, as far as we can conceive it. \\n\\t\\t\\t\\tThe materialists might say that primeval matter was\\n\\t\\t\\t\\teternal; other things, i.e., the forms and shapes as we\\n\\t\\t\\t\\tsee them now, were called into being at some time or\\n\\t\\t\\t\\tother, and will perish.  When they perish, they dissolve\\n\\t\\t\\t\\tinto primeval matter again, which stands as the base of\\n\\t\\t\\t\\tall existence. We go further back.  We say that if we\\n\\t\\t\\t\\tpostulate such primeval matter, it owes its origin itself\\n\\t\\t\\t\\tto God\\tWho is the final basis of existence, the Cause of\\n\\t\\t\\t\\tall Causes.  If this is conceded, we proceed to argue\\n\\t\\t\\t\\tthat the process of Creation is not then completed.  \"All\\n\\t\\t\\t\\tthings in the heavens and on the earth\" are created by\\n\\t\\t\\t\\tgradual processes.  In \"things\" we include abstract as\\n\\t\\t\\t\\twell as material things.  We see the abstract things and\\n\\t\\t\\t\\tideas actually growing before us.  But that also is God's\\n\\t\\t\\t\\tcreation, to which we can apply the word khalaqa, for in\\n\\t\\t\\t\\tit is involved the idea of measuring, fitting it into a\\n\\t\\t\\t\\tscheme of other things. Cf. liv. 49; also xxv. 59.  Here\\n\\t\\t\\t\\tcomes in what we know as the process of evolution.  On\\n\\t\\t\\t\\tthe other hand, the \"amr\" (=Command, Direction, Design)\\n\\t\\t\\t\\tis a single thing, unrelated to Time, \"like the twinkling\\n\\t\\t\\t\\tof an eye\" (liv. 50). Another word to note in this\\n\\t\\t\\t\\tconnection is ja'ala \"making\" which seems to imply new\\n\\t\\t\\t\\tshapes and forms, new dispositions, as the making of the\\n\\t\\t\\t\\tSigns of the Zodiac in the heavens, or the setting out of\\n\\t\\t\\t\\tthe sun and moon for light, or the establishment of the\\n\\t\\t\\t\\tsuccession of day and night (xxv 61-62).  A further\\n\\t\\t\\t\\tprocess with regard to the soul is described in the word\\n\\t\\t\\t\\tsawwa, bringing it to perfection (xci. 7) but this we\\n\\t\\t\\t\\tshall discuss in its place.  Fatara (xlii. 11) implies,\\n\\t\\t\\t\\tlike bada'a, the creating of a thing out of nothing and\\n\\t\\t\\t\\tafter no preexisting similitude, but perhaps fatara\\n\\t\\t\\t\\timplies the creation of primeval matter to which further\\n\\t\\t\\t\\tprocesses have to be applied later, as when one prepares\\n\\t\\t\\t\\tdough but leaves the leavining to be done after.  Badaa\\n\\t\\t\\t\\t(without the 'ain), xxx. 27, implies beginning the\\n\\t\\t\\t\\tprocess of creation; this is made further clear in xxxii.\\n\\t\\t\\t\\t7 where the beginning of the creation of pristine man\\n\\t\\t\\t\\tfrom clay refers to his physical body, leaving the\\n\\t\\t\\t\\tfurther processes of reproduction and the breathing in of\\n\\t\\t\\t\\tthe soul to be described in subsequent verses.\\tLastly,\\n\\t\\t\\t\\tbaraa is creation implying liberation from pre-existing\\n\\t\\t\\t\\tmatter or circumstance, e.g, man's body from clay (lix.\\n\\t\\t\\t\\t24) or a calamity from previously existing circumstances\\n\\t\\t\\t\\t(lvii. 22).  See also vi. 94, n. 916; vi. 98, n. 923;\\n\\t\\t\\t\\tlix. 24, nn. 5405-6."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "123",
    "NoteID": "122",
    "Body": "Verses 122-123 repeat verses 47-48 (except for a slight\\n\\t\\t\\t\\tverbal variation in ii. 123 which does not affect the\\n\\t\\t\\t\\tsense).  The argument about the favours to Israel is thus\\n\\t\\t\\t\\tbeautifully rounded off, and we now proceed to the\\n\\t\\t\\t\\targument in favour of the Arabs as succeeding to the\\n\\t\\t\\t\\tspiritual inheritance of Abraham."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "124",
    "NoteID": "123",
    "Body": "Kalimat: literally \"words\" here used in the mystic sense\\n\\t\\t\\t\\tof God's Will or Decree or Purpose.  This verse may be\\n\\t\\t\\t\\ttaken to be the sum of the verses following.  In\\n\\t\\t\\t\\teverything Abraham fulfilled God's wish: he purified\\n\\t\\t\\t\\tGod's house; he built the sacred refuge of the Ka'ba; he\\n\\t\\t\\t\\tsubmitted his will to God's, and thus became the type of\\n\\t\\t\\t\\tIslam.\\tHe was promised the leadership of the world; he\\n\\t\\t\\t\\tpleaded for his progeny, and his prayer was granted, with\\n\\t\\t\\t\\tthe limitation that if his progeny was false to God,\\n\\t\\t\\t\\tGod's promise did not reach the people who proved\\n\\t\\t\\t\\tthemselves false."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "125",
    "NoteID": "125",
    "Body": "The Ka'ba, the House of God.  Its foundation goes back by\\n\\t\\t\\t\\tArab tradition to Abraham.  Its fourfold character is\\n\\t\\t\\t\\there referred to. (1) It was the centre to which all the\\n\\t\\t\\t\\tArab tribes resorted for trade, for poetic contests, and\\n\\t\\t\\t\\tfor worship, (2) It was sacred territory and was\\n\\t\\t\\t\\trespected by friend and foe alike. At certain seasons,\\n\\t\\t\\t\\tall fighting was and is forbidden within it limits, and\\n\\t\\t\\t\\teven arms are not allowed to be carried and no game or\\n\\t\\t\\t\\tother thing is allowed to be killed.  Like the Cities of\\n\\t\\t\\t\\tRefuge under the Mosaic Dispensation to which manslayers\\n\\t\\t\\t\\tcould flee (Num. xxxv. 6) or the Sanctuaries in Mediaeval\\n\\t\\t\\t\\tEurope, to which criminals could not be pursued.  Mecca\\n\\t\\t\\t\\twas recognized by Arab custom as inviolable for the\\n\\t\\t\\t\\tpursuit of revenge or violence.  (3) It was a place of\\n\\t\\t\\t\\tprayer; even today there is a Station of Abraham within\\n\\t\\t\\t\\tthe enclosure where Abraham was supposed to have prayed. \\n\\t\\t\\t\\t(4) It must be held pure and sacred for all purposes."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "125",
    "NoteID": "126",
    "Body": "Four rites are here enumerated, which have now acquired a\\n\\t\\t\\t\\ttechnical meaning. (1) Compassing the sacred territory,\\n\\t\\t\\t\\tor going round the Ka'ba: Tawaf.  There are special\\n\\t\\t\\t\\tguides who take pilgrims and visitors round.  (2)\\n\\t\\t\\t\\tRetiring to the place as a spiritual retreat, for\\n\\t\\t\\t\\tcontemplation and prayer: Itikat.  (3) The posture of\\n\\t\\t\\t\\tbending the back in prayer: Ruku. (4) The posture of\\n\\t\\t\\t\\tprostrating oneself on the ground in prayer: Sujud.  The\\n\\t\\t\\t\\tprotection of the holy territory is for all, but special\\n\\t\\t\\t\\tcleanliness and purity is required for the sake of the\\n\\t\\t\\t\\tdevotees who undertake these rites."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "126",
    "NoteID": "127",
    "Body": "The root salama in the word Islam implies (among other\\n\\t\\t\\t\\tideas) the idea of Peace, and therefore when Mecca is the\\n\\t\\t\\t\\tcity of Islam, it is also the City of Peace. The same\\n\\t\\t\\t\\troot occurs in the latter part of the name Jerusalem, the\\n\\t\\t\\t\\tJewish City of Peace.  When the day of Jerusalem passed\\n\\t\\t\\t\\t(see verse 134 or 141 below),  Mecca became the \"New\\n\\t\\t\\t\\tJerusalem\" - or rather the old and original \"City of\\n\\t\\t\\t\\tPeace\" restored and made universal."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "126",
    "NoteID": "128",
    "Body": "The territory of Mecca is barren and rocky, compared\\n\\t\\t\\t\\twith, say Taif, a city 70-75 miles east of Mecca.  A\\n\\t\\t\\t\\tprayer for the prosperity of Mecca therefore includes a\\n\\t\\t\\t\\tprayer for the good things of material life.  This is the\\n\\t\\t\\t\\tliteral meaning.  But note that the opposition in this\\n\\t\\t\\t\\tverse is between the fruits of the Garden for the\\n\\t\\t\\t\\trighteous and the torments of the Fire for the evil ones\\n\\t\\t\\t\\t- a spiritual allegory of great force and aptness."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "129",
    "NoteID": "129",
    "Body": "How beautiful this prayer is, and how aptly it comes in\\n\\t\\t\\t\\there in the argument! Such Paganism or star-worship or\\n\\t\\t\\t\\tplanet-worship as there was in Abraham's time was first\\n\\t\\t\\t\\tcleared out of Mecca by Abraham.  This is the chief\\n\\t\\t\\t\\tmeaning of \"sanctification\" or purification in ii. 125,\\n\\t\\t\\t\\talthough of course physical cleanliness is (in physical\\n\\t\\t\\t\\tconditions) a necessary element of purification in the\\n\\t\\t\\t\\thigher sense.  Abraham and his elder son Ismail then\\n\\t\\t\\t\\tbuilt the Ka'ba and established the rites and usages of\\n\\t\\t\\t\\tthe sacred city.  He was thus the founder of the original\\n\\t\\t\\t\\tIslam (which is as old as mankind) in Arabia.  As becomes\\n\\t\\t\\t\\ta devout man, he offers and dedicates the work to God in\\n\\t\\t\\t\\thumble supplication, addressing Him as the All-Hearing\\n\\t\\t\\t\\tand the All-Knowing.  He then asks for a blessing on\\n\\t\\t\\t\\thimself and his progeny generally, both the children of\\n\\t\\t\\t\\this eldest-born Ismail and his younger son Isaac.  With\\n\\t\\t\\t\\tprophetic vision he foresees that there will be\\n\\t\\t\\t\\tcorruption and backsliding in both branches of his\\n\\t\\t\\t\\tfamily: Mecca will house 360 idols, and Jerusalem will\\n\\t\\t\\t\\tbecome a harlot city (Ezekiel xvi. 15), a city of\\n\\t\\t\\t\\tabomination.  But the light of Islam will shine, and\\n\\t\\t\\t\\treclaim the lost people in both branches and indeed in\\n\\t\\t\\t\\tall the world.\\tSo he prays for God's mercy, addressing\\n\\t\\t\\t\\tHim as the Oft-Returning Most Merciful.  And finally he\\n\\t\\t\\t\\tforesees in Mecca an Apostle teaching the people as one\\n\\t\\t\\t\\t\"of their own\", and in their own beautiful Arabic\\n\\t\\t\\t\\tlanguage; he asks for a blessing on Muhammad's ministry,\\n\\t\\t\\t\\tappealing to the Power and Wisdom of God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "130",
    "NoteID": "130",
    "Body": "Istafa: chose; chose because of purity; chose and\\n\\t\\t\\t\\tpurified.  It is the same root from which Mustafa is\\n\\t\\t\\t\\tderived, one of the titles of Muhammad."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "133",
    "NoteID": "131",
    "Body": "The whole of the Children of Israel are called to witness\\n\\t\\t\\t\\tone of their slogans, that they worshipped \"the God of\\n\\t\\t\\t\\ttheir fathers.\"  The idea in their minds got narrowed\\n\\t\\t\\t\\tdown to that of a tribal God.  But they are reminded that\\n\\t\\t\\t\\ttheir ancestors had the principle of Islam in them - the\\n\\t\\t\\t\\tworship of the One True and Universal God.  The death-bed\\n\\t\\t\\t\\tscene is described in Jewish tradition."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "133",
    "NoteID": "132",
    "Body": "\"Fathers\" means ancestors, and include uncles,\\n\\t\\t\\t\\tgrand-uncles, as well as direct ascendants."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "134",
    "NoteID": "133",
    "Body": "I have made a free paraphrase of what would read\\n\\t\\t\\t\\tliterally: \"Ye shall not be asked about what they used to\\n\\t\\t\\t\\tdo.\"  On the Day of Judgment each soul would have to\\n\\t\\t\\t\\tanswer for its own deeds: it cannot claim merit from\\n\\t\\t\\t\\tothers, nor be answerable for the crimes or sins of\\n\\t\\t\\t\\tothers.  Here the argument is: if the Jews or Christians\\n\\t\\t\\t\\tclaim the merits of Father Abraham and the Patriarchs or\\n\\t\\t\\t\\tof Jesus, we cannot follow them.  Because there were\\n\\t\\t\\t\\trighteous men in the past, it cannot help us unless we\\n\\t\\t\\t\\tare ourselves righteous.  The doctrine of personal\\n\\t\\t\\t\\tresponsibility is a cardinal feature of Islam."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "135",
    "NoteID": "134",
    "Body": "Hanif: inclined to right opinion, orthodox (in the\\n\\t\\t\\t\\tliteral meaning of the Greed words), firm in faith, sound\\n\\t\\t\\t\\tand well-balanced, true.  Perhaps the last word, True,\\n\\t\\t\\t\\tsums up most of the other shades."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "137",
    "NoteID": "136",
    "Body": "We are thus in the true line of those who follow the one\\n\\t\\t\\t\\tand indivisible Message of the One God, wherever\\n\\t\\t\\t\\tdelivered.  If others narrow it or corrupt it, it is they\\n\\t\\t\\t\\twho have left the faith and created a division or schism.\\n\\t\\t\\t\\t But God sees and knows all.  And He will protect His\\n\\t\\t\\t\\town, and His support will be infinitely more precious\\n\\t\\t\\t\\tthan the support which men can give."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "138",
    "NoteID": "137",
    "Body": "Sibgat: baptism: the root-meaning implies a dye or\\n\\t\\t\\t\\tcolour; apparently the Arab Christians mixed a dye or\\n\\t\\t\\t\\tcolour in the baptismal water, signifying  that the\\n\\t\\t\\t\\tbaptized person got a new colour in life.  We do not\\n\\t\\t\\t\\tbelieve that it is necessary to be baptized to be saved. \\n\\t\\t\\t\\tOur higher baptism is the \"Baptism\" of God, by which we\\n\\t\\t\\t\\ttake on a colour (sumbolically) of God, and absorb His\\n\\t\\t\\t\\tgoodness in us."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "140",
    "NoteID": "138",
    "Body": "The alternative is with the question in the last verse. \\n\\t\\t\\t\\tDo you dispute with us although we worship the same God\\n\\t\\t\\t\\tas you and claim that ours is the same religion as that\\n\\t\\t\\t\\tof your ancestors?  Or do you really assert that Abraham\\n\\t\\t\\t\\tand his son and his sons' sons, who founded the Tribes\\n\\t\\t\\t\\tlong before Moses, followed your Jewish religion as you\\n\\t\\t\\t\\tknow it?  History of course proves that claim absurd.  If\\n\\t\\t\\t\\tthe Christians claim that these Patriarchs knew of and\\n\\t\\t\\t\\tfollowed the teaching of Jesus, the claim is still more\\n\\t\\t\\t\\tabsurd, - except in the sense of Islam that God's\\n\\t\\t\\t\\tteaching is one in all ages."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "141",
    "NoteID": "139",
    "Body": "Verse 134 began a certain argument, which is now rounded\\n\\t\\t\\t\\toff in the same words in this verse.  To use a musical\\n\\t\\t\\t\\tterm, the motif is now completed.  The argument is that\\n\\t\\t\\t\\tit is wrong to claim a monoply for God's Message: it is\\n\\t\\t\\t\\tthe same for all peoples and in all ages: if it undergoes\\n\\t\\t\\t\\tlocal variations or variations according to times and\\n\\t\\t\\t\\tseasons those variations pass away.  This leads to the\\n\\t\\t\\t\\targument in the remainder of the Sura that with the\\n\\t\\t\\t\\trenewal of the Message and the birth of a new People, a\\n\\t\\t\\t\\tnew symbolism and new ordinances become appropriate, and\\n\\t\\t\\t\\tthey are now expounded."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "142",
    "NoteID": "140",
    "Body": "Nas - People, the unthinking multitude that sway to and\\n\\t\\t\\t\\tfro, instead of being firm in God's Way.  The reference\\n\\t\\t\\t\\there is to the idolaters, the Hypocrites, and the party\\n\\t\\t\\t\\tof Jews who were constantly seeking to \"entangle in their\\n\\t\\t\\t\\ttalk\" Mustafa and his disciples in Medina even as the\\n\\t\\t\\t\\tPharisees and the Sadducees of Jesus's day tried to\\n\\t\\t\\t\\tentangle Jesus (Matt. xxii, 15, 23)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "142",
    "NoteID": "141",
    "Body": "Nas - People, the unthinking multitude that sway to and\\n\\t\\t\\t\\tfro, instead of being firm in God's Way.  The reference\\n\\t\\t\\t\\there is to the idolaters, the Hypocrites, and the party\\n\\t\\t\\t\\tof Jews who were constantly seeking to \"entangle in their\\n\\t\\t\\t\\ttalk\" Mustafa and his disciples in Medina even as the\\n\\t\\t\\t\\tPharisees and the Sadducees of Jesus's day tried to\\n\\t\\t\\t\\tentangle Jesus (Matt. xxii, 15, 23)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "143",
    "NoteID": "142",
    "Body": "Thus:  By giving you a Qibla of your own, most ancient in\\n\\t\\t\\t\\thistory, and most modern as a symbol of your organisation\\n\\t\\t\\t\\tas a new nation (Ummat)."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "143",
    "NoteID": "143",
    "Body": "Justly balanced:  The essence of Islam is to avoid all\\n\\t\\t\\t\\textravagances on either side.  It is a sober, practical\\n\\t\\t\\t\\treligion.  But the Arabic word (wasat) also implies a\\n\\t\\t\\t\\ttouch of the literal meaning of Intermediacy. \\n\\t\\t\\t\\tGeographically Arabia is in an intermediate position in\\n\\t\\t\\t\\tthe Old World, as was proved in history by the rapid\\n\\t\\t\\t\\texpansion of Islam, north, south, west and east."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "143",
    "NoteID": "144",
    "Body": "Witnesses:  When two persons dispute, they advance\\n\\t\\t\\t\\textravagant claims.  A just witness comes between them,\\n\\t\\t\\t\\tand brings the light of reason to bear on them, pruning\\n\\t\\t\\t\\tall their selfish extravagances.  So the mission of Islam\\n\\t\\t\\t\\tis to curb, for instance, the extreme formalism of the\\n\\t\\t\\t\\tMosaic law and the extreme \"other-worldiness\" professed\\n\\t\\t\\t\\tby Christianity.  The witness must be unselfish, equipped\\n\\t\\t\\t\\twith first-hand knowledge, and ready to intervene in the\\n\\t\\t\\t\\tcause of justice.  Such is the position claimed by Islam\\n\\t\\t\\t\\tamong rival systems.  Similarly, within Islam itself, the\\n\\t\\t\\t\\tposition of witness to whom disputants can appeal is held\\n\\t\\t\\t\\tby Muhammad Mustafa."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "143",
    "NoteID": "145",
    "Body": "The Qibla of Jerusalem might itself have seemed strange\\n\\t\\t\\t\\tto the Arabs, and the change from it to the Ka'ba might\\n\\t\\t\\t\\thave seemed strange after they had become used to the\\n\\t\\t\\t\\tother.\\tIn reality one direction or another, or east or\\n\\t\\t\\t\\twest, in itself did no matter, as God is in all places,\\n\\t\\t\\t\\tand is independent of Time and Place. What mattered was\\n\\t\\t\\t\\tthe sense of discipline, on which Islam lays so much\\n\\t\\t\\t\\tstress: which of us is willing to follow the directions\\n\\t\\t\\t\\tof the chosen Apostle of God? Mere quibbles about\\n\\t\\t\\t\\tnon-essential matters are tested by this."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "143",
    "NoteID": "146",
    "Body": "What became of prayer with the Jerusalem Qibla?  It was\\n\\t\\t\\t\\tequally efficacious before the new Qibla was ordained. \\n\\t\\t\\t\\tGod regards our faith:\\tevery act of true and genuine\\n\\t\\t\\t\\tfaith is efficacious with Him, even if formalists pick\\n\\t\\t\\t\\tholes in such acts."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "144",
    "NoteID": "147",
    "Body": "This shows the sincere desire of Mustafa to seek light\\n\\t\\t\\t\\tfrom above in the matter of the Qibla.\\tUntil the\\n\\t\\t\\t\\torganisation of his own People into a well-knit\\n\\t\\t\\t\\tcommunity, with its distinctive laws and ordinances, he\\n\\t\\t\\t\\tfollowed a practice based on the fact that the Jews and\\n\\t\\t\\t\\tChristians looked upon Jerusalem as a sacred city.  But\\n\\t\\t\\t\\tthere was no universal Qibla among them.  Some Jews\\n\\t\\t\\t\\tturned towards Jerusalem, especially during the\\n\\t\\t\\t\\tCaptivity, as we shall see later.  At the time of our\\n\\t\\t\\t\\tProphet, Jerusalem was in the hands of the Byzantine\\n\\t\\t\\t\\tEmpire, which was Christian.  But the Christians oriented\\n\\t\\t\\t\\ttheir churches to the East (hence the word \"orientation\")\\n\\t\\t\\t\\twhich is a point of the compass, and not the direction of\\n\\t\\t\\t\\tany sacred place.  The fact of the altar being in the\\n\\t\\t\\t\\tEast does not mean that every worshipper has his face to\\n\\t\\t\\t\\tthe east; for, according at least to modern practice, the\\n\\t\\t\\t\\tseats in a church are so placed that different\\n\\t\\t\\t\\tworshippers may face in different directions.  The\\n\\t\\t\\t\\tPreacher of Unity naturally wanted, in this as in other\\n\\t\\t\\t\\tmatters, a symbol of complete unity, and his heart was\\n\\t\\t\\t\\tnaturally delighted when the Qibla towards the Ka'ba was\\n\\t\\t\\t\\tsettled.  Its connection with Abraham gave it great\\n\\t\\t\\t\\tantiquity; its character of being an Arab centre made it\\n\\t\\t\\t\\tappropriate when the Message came in Arabic, and was\\n\\t\\t\\t\\tpreached through the union of the Arabs; at the time it\\n\\t\\t\\t\\twas adopted, the little Muslim community was shut out of\\n\\t\\t\\t\\tit, being exiles in Medina, but it became a symbol of\\n\\t\\t\\t\\thope and eventual triumph, of which Muhammad lived to see\\n\\t\\t\\t\\tthe fulfilment; and it also became the centre and\\n\\t\\t\\t\\tgathering ground of all peoples in the universal\\n\\t\\t\\t\\tpilgrimage, which was instituted with it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "144",
    "NoteID": "148",
    "Body": "The sacred Mosque: The Ka'ba in the sacred city of Mecca.\\n\\t\\t\\t\\t It is not correct to suggest that the command making the\\n\\t\\t\\t\\tKa'ba the Qibla abrogates ii. 115, where it is stated\\n\\t\\t\\t\\tthat East and West belong to God, and He is everywhere. \\n\\t\\t\\t\\tThis is perfectly true at all times, before and after the\\n\\t\\t\\t\\tinstitution of the Qibla.  As if to emphasise this, the\\n\\t\\t\\t\\tsame words about East and West are repeated in this very\\n\\t\\t\\t\\tpassage; see ii, 142 above.  Where the Itqan mentions\\n\\t\\t\\t\\tmansukh in this connection, I am sorry I cannot follow\\n\\t\\t\\t\\tthat opinion, unless mansukh is defined in a special way,\\n\\t\\t\\t\\tas some of the commentators do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "144",
    "NoteID": "149",
    "Body": "Glimmerings of such a Qibla were already foreshadowed in\\n\\t\\t\\t\\tJewish and Christian practice but its universality was\\n\\t\\t\\t\\tonly perfected in Islam."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "145",
    "NoteID": "150",
    "Body": "See n. 147 to ii. 144 above.  The Jews and Christians had\\n\\t\\t\\t\\ta glimmering of the Qibla idea, but in their attitude of\\n\\t\\t\\t\\tself-sufficiency they were not likely to welcome the\\n\\t\\t\\t\\tQibla idea as perfected in Islam.  Nor is Islam, after\\n\\t\\t\\t\\tthe fuller knowledge which it has received, likely to\\n\\t\\t\\t\\trevert to the uncertain, imperfect, and varying ideas of\\n\\t\\t\\t\\torientation held previously."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "146",
    "NoteID": "151",
    "Body": "The People of the Book should have known all this as well\\n\\t\\t\\t\\tas \"they knew their own sons\", as their past traditions\\n\\t\\t\\t\\tand teaching should have made them receptive of the new\\n\\t\\t\\t\\tmessage.  Some commentators construe the demonstrative\\n\\t\\t\\t\\tpronoun \"this\" to refer to the Apostle.  In that case the\\n\\t\\t\\t\\tinterpretation would be:  The People of the Book know\\n\\t\\t\\t\\tMuhammad as well as they know their own sons; they know\\n\\t\\t\\t\\thim to be true and upright; they know him to be in the\\n\\t\\t\\t\\tline of Abraham; they know him to correspond to the\\n\\t\\t\\t\\tdescription of the prophet foretold among themselves; but\\n\\t\\t\\t\\tselfishness induces some of them to act against their own\\n\\t\\t\\t\\tknowledge and conceal the truth."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "148",
    "NoteID": "153",
    "Body": "The question is how we are to construe the pronoun huwa\\n\\t\\t\\t\\tin the original. The alternative translation would be:\\n\\t\\t\\t\\t\"To each is a goal to which he turns.\"\\tThe simile of\\n\\t\\t\\t\\tlife being a race in which we all zealously run forward\\n\\t\\t\\t\\tto the one goal, viz., the goal of good, may be applied \\n\\t\\t\\t\\tindividually and nationally. This supplies another\\n\\t\\t\\t\\targument of the Ka'ba Qibla, viz., the unity of goal,\\n\\t\\t\\t\\twith diversity of races, traditions and temperaments."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "147",
    "NoteID": "154",
    "Body": "The simile of a race is continued, and so the Qibla\\n\\t\\t\\t\\tcommand is repeated from that point of view.  In ii. 144\\n\\t\\t\\t\\tit was mentioned as the new symbol of the new nation\\n\\t\\t\\t\\t(Muslim): now it is shown as the symbol of Good, at which\\n\\t\\t\\t\\twe should all aim, from whichever point we started, e.g.,\\n\\t\\t\\t\\tas Jews or Christians, or our individual point of view;\\n\\t\\t\\t\\tthe Qibla will unite us as a symbol of the Goal of the\\n\\t\\t\\t\\tFuture.  In ii. 150 below, it is repeated:  First for the\\n\\t\\t\\t\\tindividual, on the ground of uniformity and the removal\\n\\t\\t\\t\\tof all occasions of dispute and argument; and secondly\\n\\t\\t\\t\\tfor the Muslim people, on the same ground, as a matter of\\n\\t\\t\\t\\tdiscipline.  There is another little harmony in the\\n\\t\\t\\t\\tmatter of the repetitions. Note that the race and\\n\\t\\t\\t\\tstarting point argument begins at ii. 149 and is rounded\\n\\t\\t\\t\\toff in the latter part of ii. 150.  The latter argument\\n\\t\\t\\t\\tincludes the former, and is more widely worded:\\n\\t\\t\\t\\t\"wheresoever ye are\":  which in the Arabic expression\\n\\t\\t\\t\\twould imply three things; in whatever circumstances ye\\n\\t\\t\\t\\tare, or at whatever time ye are, or in whatever place ye\\n\\t\\t\\t\\tare.  I have spoken before of a sort of musical harmony\\n\\t\\t\\t\\tin verbal repetitions:\\there there is a sort of pictorial\\n\\t\\t\\t\\tharmony, as of a larger circle symmetrically including a\\n\\t\\t\\t\\tsmaller concentric circle."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "149",
    "NoteID": "154",
    "Body": "The simile of a race is continued, and so the Qibla\\n\\t\\t\\t\\tcommand is repeated from that point of view.  In ii. 144\\n\\t\\t\\t\\tit was mentioned as the new symbol of the new nation\\n\\t\\t\\t\\t(Muslim): now it is shown as the symbol of Good, at which\\n\\t\\t\\t\\twe should all aim, from whichever point we started, e.g.,\\n\\t\\t\\t\\tas Jews or Christians, or our individual point of view;\\n\\t\\t\\t\\tthe Qibla will unite us as a symbol of the Goal of the\\n\\t\\t\\t\\tFuture.  In ii. 150 below, it is repeated:  First for the\\n\\t\\t\\t\\tindividual, on the ground of uniformity and the removal\\n\\t\\t\\t\\tof all occasions of dispute and argument; and secondly\\n\\t\\t\\t\\tfor the Muslim people, on the same ground, as a matter of\\n\\t\\t\\t\\tdiscipline.  There is another little harmony in the\\n\\t\\t\\t\\tmatter of the repetitions. Note that the race and\\n\\t\\t\\t\\tstarting point argument begins at ii. 149 and is rounded\\n\\t\\t\\t\\toff in the latter part of ii. 150.  The latter argument\\n\\t\\t\\t\\tincludes the former, and is more widely worded:\\n\\t\\t\\t\\t\"wheresoever ye are\":  which in the Arabic expression\\n\\t\\t\\t\\twould imply three things; in whatever circumstances ye\\n\\t\\t\\t\\tare, or at whatever time ye are, or in whatever place ye\\n\\t\\t\\t\\tare.  I have spoken before of a sort of musical harmony\\n\\t\\t\\t\\tin verbal repetitions:\\there there is a sort of pictorial\\n\\t\\t\\t\\tharmony, as of a larger circle symmetrically including a\\n\\t\\t\\t\\tsmaller concentric circle."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "151",
    "NoteID": "155",
    "Body": "This verse should be read with ii. 150., of which the\\n\\t\\t\\t\\tsentence is here completed.  The argument is that in the\\n\\t\\t\\t\\tgrant of the Ka'ba Qibla, God was perfecting religion and\\n\\t\\t\\t\\tfulfilling the prayer for the future made by Abraham.\\n\\t\\t\\t\\tThat prayer was threefold:  (1) That Mecca should be made\\n\\t\\t\\t\\ta sacred Sanctuary (ii.  126); (2) that a truly believing\\n\\t\\t\\t\\t(Muslim) nation should be raised, with places of devotion\\n\\t\\t\\t\\tthere (ii 128); and (3) that an Apostle should be sent\\n\\t\\t\\t\\tamong the Arabs with certain qualities (ii. 129), which\\n\\t\\t\\t\\tare set out there and again repeated here to complete the\\n\\t\\t\\t\\targument."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "152",
    "NoteID": "156",
    "Body": "The word \"remember\" is too pale a word for zikr, which\\n\\t\\t\\t\\thas now acquired a large number of associations in our\\n\\t\\t\\t\\treligious literature, especially Sufi literature. In its\\n\\t\\t\\t\\tverbal signification it implies: to remember; to praise\\n\\t\\t\\t\\tby frequently mentioning; to rehearse; to celebrate or\\n\\t\\t\\t\\tcommemorate; to make much of; to cherish the memory of as\\n\\t\\t\\t\\ta precious possession.\\tIn Sufi devotions zikr represents\\n\\t\\t\\t\\tboth a solemn ritual and a spiritual state of mind or\\n\\t\\t\\t\\theart, in which the devotee seeks to realise the presence\\n\\t\\t\\t\\tof God.  Thus there is zikr of the mind and zikr of the\\n\\t\\t\\t\\theart.\\tFor beginners the one may lead to the other, but\\n\\t\\t\\t\\tin many cases the two may be simultaneous.  There is a\\n\\t\\t\\t\\tsubtler distinction, between the zikr that is open, and\\n\\t\\t\\t\\tthe zikr that is secret, corresponding to the two doors\\n\\t\\t\\t\\tof the heart, the fleshly and the spiritual.  In English\\n\\t\\t\\t\\tsome account (very imperfect) of zikr will be found in\\n\\t\\t\\t\\tHughe's Dictionary of Islam, covering over 14 columns."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "153",
    "NoteID": "157",
    "Body": "See ii. 45 and n.  An additional meaning implied in sabr\\n\\t\\t\\t\\tis self-restraint. Haqqani defines it in his Tafsir as\\n\\t\\t\\t\\tfollowing Reason and restraining Fear, Anger, and Desire.\\n\\t\\t\\t\\t What can be a higher reward for patience, perseverance,\\n\\t\\t\\t\\tself-restraint and constancy than that God should be with\\n\\t\\t\\t\\tus?  For this promise opens the door to every kind of\\n\\t\\t\\t\\tspiritual well-being."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "154",
    "NoteID": "158",
    "Body": "The \"patient perseverance and prayer\" mentioned in the\\n\\t\\t\\t\\tlast verse is not mere passivity.  It is active striving\\n\\t\\t\\t\\tin the way of Truth, which is the way of God. Such\\n\\t\\t\\t\\tstriving is the spending of one's self in God's way,\\n\\t\\t\\t\\teither through our property or through our own lives, or\\n\\t\\t\\t\\tthe lives of those nearest and dearest to us, or it may\\n\\t\\t\\t\\tbe the loss of all the fruits of a lifetime's labour not\\n\\t\\t\\t\\tonly in material goods but in some intellectual or moral\\n\\t\\t\\t\\tgain, some position which seemed in our eyes to be\\n\\t\\t\\t\\teminently desirable in itself, but which we must\\n\\t\\t\\t\\tcheerfully sacrifice if necessary for the Cause.  With\\n\\t\\t\\t\\tsuch sacrifice, our apparent loss may be our real gain:\\n\\t\\t\\t\\the that loses his life may really gain it; and the\\n\\t\\t\\t\\trewards or \"fruits\" that seem lost were mere impediments\\n\\t\\t\\t\\ton our path to real inward progress."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "155",
    "NoteID": "159",
    "Body": "The glad tidings are the blessings of God in ii. 157 or\\n\\t\\t\\t\\t(which is the same thing) the promise in ii. 153 that God\\n\\t\\t\\t\\twill be with them."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "158",
    "NoteID": "160",
    "Body": "The virtue of patient perseverance in faith leads to the\\n\\t\\t\\t\\tmention of two symbolic monuments of that virtue.  These\\n\\t\\t\\t\\tare the two little hills of Safa and Marwa now absorbed\\n\\t\\t\\t\\tin the city of Mecca, and close to the well of Zam-zam. \\n\\t\\t\\t\\tHere, according to tradition, the lady Hajar, mother of\\n\\t\\t\\t\\tthe infant Ismail, prayed for water in the parched\\n\\t\\t\\t\\tdesert, and in her eager quest round these hills, she\\n\\t\\t\\t\\tfound her prayer answered and saw the Zam-zam spring. \\n\\t\\t\\t\\tUnfortunately the Pagan Arabs had placed a male and a\\n\\t\\t\\t\\tfemale idol here, and their gross and superstitious rites\\n\\t\\t\\t\\tcaused offence to the early Muslims.  They felt some\\n\\t\\t\\t\\thesitation in going round these places during the\\n\\t\\t\\t\\tPilgrimage.  As a matter of fact they should have known\\n\\t\\t\\t\\tthat the Ka'ba (the House of God) had been itself defiled\\n\\t\\t\\t\\twith idols, and was sanctified again by the purity of\\n\\t\\t\\t\\tMuhammad's life and teaching.  The lesson is that the\\n\\t\\t\\t\\tmost sacred things may be turned to the basest uses; that\\n\\t\\t\\t\\twe are not therefore necessarily to ban a thing misused;\\n\\t\\t\\t\\tthat if our intentions and life are pure, God will\\n\\t\\t\\t\\trecognise them even if the world cast stones at us\\n\\t\\t\\t\\tbecause of some evil associations which they join with\\n\\t\\t\\t\\twhat we do, or with the people we associate with, or with\\n\\t\\t\\t\\tthe places which claim our reverence."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "158",
    "NoteID": "161",
    "Body": "The House - the Sacred Mosque, the Ka'ba.  The Season of\\n\\t\\t\\t\\tregular Hajj culminates in the visit to Arafat on the\\n\\t\\t\\t\\tninth day of the month of Zul-hajj, followed by the\\n\\t\\t\\t\\tcircumambulation of the Ka'ba.\\tA visit to the Sacred\\n\\t\\t\\t\\tMosque and the performance of the rites of pilgrimage at\\n\\t\\t\\t\\tany other time is called an Umra.  The symbolic rites are\\n\\t\\t\\t\\tthe same in either case, except that the Arafat rites are\\n\\t\\t\\t\\tomitted in the Umra.  The Safa and Marwa are included\\n\\t\\t\\t\\tamong the Monuments, as pointing to one of the highest of\\n\\t\\t\\t\\tMuslim virtues."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "158",
    "NoteID": "162",
    "Body": "The impulse should be to Good; if once we are sure of\\n\\t\\t\\t\\tthis, we must obey it without hesitation, whatever people\\n\\t\\t\\t\\tmay say."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "159",
    "NoteID": "163",
    "Body": "Those entitled to curse: i.e., angels and mankind (see\\n\\t\\t\\t\\tii. 161 below): the cursed ones will deprive themselves\\n\\t\\t\\t\\tof the protection of God and of the angels, who are the\\n\\t\\t\\t\\tPowers of God, and of the good wishes of mankind, because\\n\\t\\t\\t\\tby contumaciously rejecting Faith, they not only sin\\n\\t\\t\\t\\tagainst God but are false to their own manhood, which God\\n\\t\\t\\t\\tcreated in the \"best of moulds\" (Q xcv. 4).  The terrible\\n\\t\\t\\t\\tcurses denounced in the Old Testament are set out in\\n\\t\\t\\t\\tDeut. xxviii. 15-68.  There is one difference.\\tHere it\\n\\t\\t\\t\\tis for the deliberate rejection of Faith, a theological\\n\\t\\t\\t\\tterm for the denying of our higher nature.  There it is\\n\\t\\t\\t\\tfor a breach of the lease part of the ceremonial Law."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "162",
    "NoteID": "164",
    "Body": "Therein - in the curse.  A curse is not a matter of\\n\\t\\t\\t\\twords: it is a terrible spiritual state, opposite to the\\n\\t\\t\\t\\tstate of Grace.  Can man curse?  Not of course in the\\n\\t\\t\\t\\tsame sense in which we speak of the curse of God.  A mere\\n\\t\\t\\t\\tverbal curse is of no effect.  Hence the English saying:\\n\\t\\t\\t\\t\"A causeless curse will not come.\"  But if men are\\n\\t\\t\\t\\toppressed or unjustly treated, their cries can ascend to\\n\\t\\t\\t\\tGod in prayer, and then it becomes God's \"wrath\" or\\n\\t\\t\\t\\tcurse, the deprivation of God's Grace as regards the\\n\\t\\t\\t\\twrong-doer."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "163",
    "NoteID": "165",
    "Body": "Where the terrible consequences of Evil, i.e., the\\n\\t\\t\\t\\trejection of God, are mentioned, there is always stress\\n\\t\\t\\t\\tlaid on God's attributes of Grace and Mercy. In this case\\n\\t\\t\\t\\tUnity is also stressed, because we have just been told\\n\\t\\t\\t\\tabout the Qibla symbol of unity and are about to pass the\\n\\t\\t\\t\\ttheme of unity in diversity, in Nature and in the social\\n\\t\\t\\t\\tlaws of human society."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "164",
    "NoteID": "166",
    "Body": "This magnificent Nature passage stands out like a hill in\\n\\t\\t\\t\\ta landscape, enhancing the beauty of our view, and\\n\\t\\t\\t\\tpreparing us for the every-day laws and ordinances which\\n\\t\\t\\t\\tfollow."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "165",
    "NoteID": "167",
    "Body": "Everything around and within us points to unity of\\n\\t\\t\\t\\tpurpose and design, - points to God.  Yet there are\\n\\t\\t\\t\\tfoolish persons (unrighteous - those who deliberately use\\n\\t\\t\\t\\tthe choice given them to go wrong).  They think something\\n\\t\\t\\t\\telse is equal to God. Perhaps they even do lip service to\\n\\t\\t\\t\\tGod.  If only the unrighteous could see the consequences,\\n\\t\\t\\t\\tthey would see the terrible Penalty, and that all Power\\n\\t\\t\\t\\tis in God's hands, not in that of any one else.  Who are\\n\\t\\t\\t\\tthese others who are used as fetishes by the misguided? \\n\\t\\t\\t\\tIt may be: (1) creatures of their own imagination, or of\\n\\t\\t\\t\\ttheir faculties misused; the idea lying behind Idols is\\n\\t\\t\\t\\takin to this, for no intelligent idol-worshipper owns to\\n\\t\\t\\t\\tworshipping stocks and stones; or (2) good leaders whose\\n\\t\\t\\t\\tnames have been misused out of perversity to erect them\\n\\t\\t\\t\\tto a position of equality with God; or (3) Powers of evil\\n\\t\\t\\t\\tthat deliberately mislead. When it comes to the\\n\\t\\t\\t\\tinevitable consequences of blasphemy and the rejection of\\n\\t\\t\\t\\tGod, the eyes of all are opened and these false and\\n\\t\\t\\t\\tartificial relations dissolve.\\tThe idea which was\\n\\t\\t\\t\\tcreated into a fetish disowns its follower, i.e. is seen\\n\\t\\t\\t\\tto have no reasonable basis in the life of the follower,\\n\\t\\t\\t\\tand the follower is forced to renounce it as false.  The\\n\\t\\t\\t\\tgood ones would take an unholy delight in exposing the\\n\\t\\t\\t\\tfacts.\\tThe Reality is now irresistible but alas!  at\\n\\t\\t\\t\\twhat cost?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "167",
    "NoteID": "168",
    "Body": "Our deeds are irrevocable and we must pass through the\\n\\t\\t\\t\\tFire of repentance and regrets."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "168",
    "NoteID": "169",
    "Body": "We now come to the regulations about food.  First (ii.\\n\\t\\t\\t\\t168-71) we have an appeal to all people, Muslims, Pagans,\\n\\t\\t\\t\\tas well as the People of the Book; then (ii. 172-73) to\\n\\t\\t\\t\\tthe Muslims specially; then (ii 174-76) to the sort of\\n\\t\\t\\t\\tmen who then (as some do now) either believe in too much\\n\\t\\t\\t\\tformalism or believe in no restrictions at all.  Islam\\n\\t\\t\\t\\tfollows the Golden Mean.  All well-regulated societies\\n\\t\\t\\t\\tlay down reasonable limitations.  These become incumbent\\n\\t\\t\\t\\ton all loyal members of any given society, and show what\\n\\t\\t\\t\\tis \"lawful\" in that society.  But if the limitations are\\n\\t\\t\\t\\treasonable, as they should be, the \"lawful\" will also\\n\\t\\t\\t\\tcoincide more and more with what is \"good.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "171",
    "NoteID": "170",
    "Body": "If you reject all faith, the highest wisdom and the most\\n\\t\\t\\t\\tsalutary regulations are lost on you.  You are like \"dumb\\n\\t\\t\\t\\tdriven cattle\" who can merely hear calls, but cannot\\n\\t\\t\\t\\tdistinguish intelligently between shades of meaning or\\n\\t\\t\\t\\tsubtle differences of values."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "171",
    "NoteID": "171",
    "Body": "Cf ii. 18, where we are told that the rejectors of faith\\n\\t\\t\\t\\tare \"deaf, dumb and blind: they will not return to the\\n\\t\\t\\t\\tpath.\"\\tHere the consequence of their not using their\\n\\t\\t\\t\\tsenses is that they have no wisdom.  In each context\\n\\t\\t\\t\\tthere is just the appropriate deduction."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "172",
    "NoteID": "172",
    "Body": "Gratitude for God's gifts is one form of worship."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "173",
    "NoteID": "173",
    "Body": "Dead meat: maitat: carrion; animal that dies of itself;\\n\\t\\t\\t\\tthe original Arabic has a slightly wider meaning given to\\n\\t\\t\\t\\tit in Fiqh (Religious Law); anything that dies of itself\\n\\t\\t\\t\\tand is not expressly killed for food with the Takbir duly\\n\\t\\t\\t\\tpronounced on it.  But there are exceptions, e.g., fish\\n\\t\\t\\t\\tand locusts are lawful, though they have not been made\\n\\t\\t\\t\\tspecially halal with the Takbir.  But even fish or\\n\\t\\t\\t\\tlocusts as carrion would be obviously ruled out."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "173",
    "NoteID": "174",
    "Body": "For prohibited foods, cf. also Q. v. 4-5; vi. 121,\\n\\t\\t\\t\\t138-146; etc.  The teachers of Fiqh (Religious Law) work\\n\\t\\t\\t\\tout the details with great elaboration.  My purpose is to\\n\\t\\t\\t\\tpresent general principles, not technical details. \\n\\t\\t\\t\\tCarrion or dead meat and blood as articles of food would\\n\\t\\t\\t\\tobviously cause disgust to any refined person.\\tSo would\\n\\t\\t\\t\\tswine's flesh where the swine live on offal.  Where swine\\n\\t\\t\\t\\tare fed artifically on clean food, the objections remain:\\n\\t\\t\\t\\t(1) that they are filthy animals in other respects, and\\n\\t\\t\\t\\tthe flesh of filthy animals taken as food affects the\\n\\t\\t\\t\\teater; (2) that swine's flesh has more fat than\\n\\t\\t\\t\\tmuscle-building material; and (3) that it is more liable\\n\\t\\t\\t\\tto disease than other kinds of meat; e.g., trichinosis,\\n\\t\\t\\t\\tcharacterised by hair-like worms in the muscular tissue. \\n\\t\\t\\t\\tAs to food dedicated to idols or false gods, it is\\n\\t\\t\\t\\tobviously unseemly for the Children of Unity to partake\\n\\t\\t\\t\\tof it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "174",
    "NoteID": "175",
    "Body": "\"They eat nothing but fire into their bellies\" is a\\n\\t\\t\\t\\tliteral translation that produces an effect of rude\\n\\t\\t\\t\\tinelegance which is not in the Arabic words.  Even in the\\n\\t\\t\\t\\tmatter of food and drinks, the mission of Islam is to\\n\\t\\t\\t\\tavoid the extremes of lawlessness on the one hand and\\n\\t\\t\\t\\textreme formalism on the other.  It has laid down a few\\n\\t\\t\\t\\tsimple and very reasonable rules.  Their infraction\\n\\t\\t\\t\\tcauses loss of health or physical powers in any case. \\n\\t\\t\\t\\tBut if there is further a spirit of subjective rebellion\\n\\t\\t\\t\\tor fraud - passing off in the name of religion something\\n\\t\\t\\t\\twhich is far from the purpose - the consequences become\\n\\t\\t\\t\\talso moral and spiritual.  Then it becomes a sin against\\n\\t\\t\\t\\tFaith and Spirit.  Continuing the physical simile, we\\n\\t\\t\\t\\tactually swallow fire into ourselves.  Imagine the\\n\\t\\t\\t\\ttorments which we should have if we swallowed fire into\\n\\t\\t\\t\\tour physical body!  They would be infinitely worse in our\\n\\t\\t\\t\\tspiritual state, and they would go on to the Day of\\n\\t\\t\\t\\tResurrection, when we shall be deprived even of the words\\n\\t\\t\\t\\twhich the Judge speaks to a reasonable culprit, and we\\n\\t\\t\\t\\tshall certainly not win His Grace and Mercy."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "176",
    "NoteID": "176",
    "Body": "From the mere physical regulation we are at once lifted\\n\\t\\t\\t\\tup into the sphere of morals and faith.  For the one acts\\n\\t\\t\\t\\tand reacts on the other.  If we are constantly carping at\\n\\t\\t\\t\\twholesome regulations, we shall do nothing but cause\\n\\t\\t\\t\\tdivision and schisms among the people, and ordered\\n\\t\\t\\t\\tsociety would tend to break up."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "NoteID": "177",
    "Body": "As if to emphasise again a warning against deadening\\n\\t\\t\\t\\tformalism, we are given a beautiful description of the\\n\\t\\t\\t\\trighteous and God-fearing man.\\tHe should obey salutary\\n\\t\\t\\t\\tregulation, but he should fix his gaze on the love of God\\n\\t\\t\\t\\tand the love of his fellow-men.  We are given four heads:\\n\\t\\t\\t\\t(1) our faith should be true and sincere; (2) we must be\\n\\t\\t\\t\\tprepared to show it in deeds of charity to our fellowmen;\\n\\t\\t\\t\\t(3) we must be good citizens, supporting social\\n\\t\\t\\t\\torganisation; and (4) our own individual soul must be\\n\\t\\t\\t\\tfirm and unshaken in all circumstances.  They are\\n\\t\\t\\t\\tinterconnected, and yet can be viewed separately."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "NoteID": "178",
    "Body": "Faith is not merely a matter of words.\\tWe must realise\\n\\t\\t\\t\\tthe presence and goodness of God.  When we do so, the\\n\\t\\t\\t\\tscales fall from our eyes: all the falsities and fleeting\\n\\t\\t\\t\\tnature of the Present cease to enslave us, for we see the\\n\\t\\t\\t\\tLast Day as if it were today.  We also see God's working\\n\\t\\t\\t\\tin His world and in us; His Powers (angels), His\\n\\t\\t\\t\\tMessengers and His Message are no longer remote from us,\\n\\t\\t\\t\\tbut come within our experience."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "NoteID": "179",
    "Body": "Practical deeds of charity are of value when they proceed\\n\\t\\t\\t\\tfrom love, and from no other motive.  In this respect,\\n\\t\\t\\t\\talso, our duties take various forms, which are shown in\\n\\t\\t\\t\\treasonable gradation: our kith and kin; orphans\\n\\t\\t\\t\\t(including any persons who are without support or help);\\n\\t\\t\\t\\tpeople who are in real need but who never ask (it is our\\n\\t\\t\\t\\tduty to find them out, and they come before those who\\n\\t\\t\\t\\task); the stranger, who is entitled to laws of\\n\\t\\t\\t\\thospitality; the people who ask and are entitled to ask,\\n\\t\\t\\t\\ti.e., not merely lazy beggars, but those who seek our\\n\\t\\t\\t\\tassistance in some form or another (it is our duty to\\n\\t\\t\\t\\trespond to them); and the slaves (we must do all we can\\n\\t\\t\\t\\tto give or buy their freedom).\\tSlavery has many\\n\\t\\t\\t\\tinsidious forms, and all are included."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "NoteID": "180",
    "Body": "Charity and piety in individual cases do not complete our\\n\\t\\t\\t\\tduties.  In prayer and charity, we must also look to our\\n\\t\\t\\t\\torganised efforts: where there is a Muslim State, these\\n\\t\\t\\t\\tare made through the State, in facilities for public\\n\\t\\t\\t\\tprayer, and public assistance, and for the maintenance of\\n\\t\\t\\t\\tcontracts and fair dealing in all matters."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "177",
    "NoteID": "181",
    "Body": "Then come the Muslim virtues of firmness and patience. \\n\\t\\t\\t\\tThey are to \"preserve the dignity of man, with soul\\n\\t\\t\\t\\terect\" (Burns).  Three sets of circumstances are\\n\\t\\t\\t\\tspecially mentioned for the exercise of this virtue: (1)\\n\\t\\t\\t\\tbodily pain or suffering, (2) adversities or injuries of\\n\\t\\t\\t\\tall kinds, deserved and underserved and (3) periods of\\n\\t\\t\\t\\tpublic panic, such as war, violence, pestilence, etc."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "178",
    "NoteID": "182",
    "Body": "Note first that this verse and the next make it clear\\n\\t\\t\\t\\tthat Islam has much mitigated the horrors of the\\n\\t\\t\\t\\tpre-Islamic custom of retaliation.  In order to meet the\\n\\t\\t\\t\\tstrict claims of justice, equality is prescribed, with a\\n\\t\\t\\t\\tstrong recommendation for mercy and forgiveness.  To\\n\\t\\t\\t\\ttranslate qisas, therefore, by retaliation, is I think\\n\\t\\t\\t\\tincorrect.  The Latin legal term Lex Talionsis may come\\n\\t\\t\\t\\tnear it, but even that is modified here.  In any case it\\n\\t\\t\\t\\tis best to avoid technical terms for things that are very\\n\\t\\t\\t\\tdifferent.  \"Retaliation\" in English has a wider meaning,\\n\\t\\t\\t\\tequivalent almost to returning evil for evil, and would\\n\\t\\t\\t\\tmore fitly apply to the blood-feuds of the Days of\\n\\t\\t\\t\\tIgnorance.  Islam says: if you must take a life for a\\n\\t\\t\\t\\tlife, at least there should be some measure of equality\\n\\t\\t\\t\\tin it; the killing of the slave of a tribe should not\\n\\t\\t\\t\\tinvolve a blood feud where many free men would be killed;\\n\\t\\t\\t\\tbut the law of mercy, where it can be obtained by\\n\\t\\t\\t\\tconsent, with reasonable compensation, would be better."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "178",
    "NoteID": "183",
    "Body": "The jurists have carefully laid down that the law of\\n\\t\\t\\t\\tqisas refers to murder only.  Qisas is not applicable to\\n\\t\\t\\t\\tmanslaughter, due to a mistake or an accident. There,\\n\\t\\t\\t\\tthere would be no capital punishment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "178",
    "NoteID": "184",
    "Body": "The brother: the term is perfectly general; all men are\\n\\t\\t\\t\\tbrothers in Islam.  In this, and in all questions of\\n\\t\\t\\t\\tinheritance, females have similar rights to males, and\\n\\t\\t\\t\\ttherefore the masculine gender imports both sexes.  Here\\n\\t\\t\\t\\twe are considering the rights of the heirs in the light\\n\\t\\t\\t\\tof the larger brotherhood.  In ii.  178-79 we have the\\n\\t\\t\\t\\trights of the heirs to life (as it were): in ii. 180-82\\n\\t\\t\\t\\twe proceed to the heirs to property."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "178",
    "NoteID": "185",
    "Body": "The demand should be such as can be met by the party\\n\\t\\t\\t\\tconcerned, i.e., within his means, and reasonable\\n\\t\\t\\t\\taccording to justice and good conscience.  For example, a\\n\\t\\t\\t\\tdemand could not be made affecting the honour of a woman\\n\\t\\t\\t\\tor a man.  The whole penalty can be remitted if the\\n\\t\\t\\t\\taggrieved party agrees, out of brotherly love. In meeting\\n\\t\\t\\t\\tthat demand the culprit or his friends should equally be\\n\\t\\t\\t\\tgenerous and recognise the good-will of the other side. \\n\\t\\t\\t\\tThere should be no subterfuges, no bribes, no unseemly\\n\\t\\t\\t\\tby-play: otherwise the whole intention of mercy and peace\\n\\t\\t\\t\\tis lost."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "180",
    "NoteID": "186",
    "Body": "There are rules of course for the disposal of intestate\\n\\t\\t\\t\\tproperty.  But it is a good thing that a dying man or\\n\\t\\t\\t\\twoman should, of his own free-will, think of his parents\\n\\t\\t\\t\\tand his next of kin, not in a spirit of injustice to\\n\\t\\t\\t\\tother, but in a spirit of love and reverence for those\\n\\t\\t\\t\\twho have cherished him.  He must, however, do it\\n\\t\\t\\t\\t\"according to reasonable usage\": the limitations will be\\n\\t\\t\\t\\tseen further on."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "182",
    "NoteID": "187",
    "Body": "A verbal will is allowed, but it is expected that the\\n\\t\\t\\t\\ttestator will be just to his heirs and not depart from\\n\\t\\t\\t\\twhat is considered equitable.  For this reason definite\\n\\t\\t\\t\\tshares were laid down for heirs later (see Q. iv. 11,\\n\\t\\t\\t\\tetc.).\\tThese define or limit the testamentary power, but\\n\\t\\t\\t\\tdo not abrogate it.  For example, amongst kin there are\\n\\t\\t\\t\\tpersons, e.g., an orphan grandson in the presence of\\n\\t\\t\\t\\tsurviving sons) who would not inherit under the intestate\\n\\t\\t\\t\\tscheme, and the testator might like to provide for them. \\n\\t\\t\\t\\tAgain, there may be outsiders for whom he may wish to\\n\\t\\t\\t\\tprovide, and jurists have held that he has powers of\\n\\t\\t\\t\\tdisposition up to one-third of his property.  But he must\\n\\t\\t\\t\\tnot be partial to one heir at the expense of another, or\\n\\t\\t\\t\\tattempt to defeat lawful creditors.  If he tries to do\\n\\t\\t\\t\\tthis, those who are witnesses to his oral disposition may\\n\\t\\t\\t\\tinterfere in two ways. One way would be to persuade the\\n\\t\\t\\t\\ttestator to change his bequest before he dies. The other\\n\\t\\t\\t\\tway would be after death, to get the interested parties\\n\\t\\t\\t\\ttogether and ask them to agree to a more equitable\\n\\t\\t\\t\\tarrangement.  In such a case they are acting in good\\n\\t\\t\\t\\tfaith, and there is no fraud.  They are doing nothing\\n\\t\\t\\t\\twrong. Islam approves of every lawful device for keeping\\n\\t\\t\\t\\tbrethren at peace, without litigation and quarrels. \\n\\t\\t\\t\\tExcept for this, the changing of the provisions of a Will\\n\\t\\t\\t\\tis a crime, as it is under all Law."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "183",
    "NoteID": "188",
    "Body": "As it was prescribed: this does not mean that the Muslim\\n\\t\\t\\t\\tfast is like the other fasts previously observed, in the\\n\\t\\t\\t\\tnumber of days, in the time or manner of the fast, or in\\n\\t\\t\\t\\tother incidents; it only means that the principle of\\n\\t\\t\\t\\tself-denial by fasting is not a new one."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "184",
    "NoteID": "189",
    "Body": "This verse should be read with the following verses,\\n\\t\\t\\t\\t185-88, in order that the incidents of the physical fast\\n\\t\\t\\t\\tmay be fully understood with reference to its spiritual\\n\\t\\t\\t\\tmeaning."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "184",
    "NoteID": "190",
    "Body": "Illness and journey must not be interpreted in an elastic\\n\\t\\t\\t\\tsense: they must be such as to cause real pain or\\n\\t\\t\\t\\tsuffering if the fast were observed.  For journeys, a\\n\\t\\t\\t\\tminimum standard of three marches is prescribed by  some\\n\\t\\t\\t\\tCommentators:  others make it more precise by naming a\\n\\t\\t\\t\\tdistance of 16 farsakhs, equivalent to 48 miles.  A\\n\\t\\t\\t\\tjourney of 8 or 9 miles on foot is more tiring than a\\n\\t\\t\\t\\tsimilar one by bullock cart.  There are various degrees\\n\\t\\t\\t\\tof fatigue in riding a given distance on horseback or by\\n\\t\\t\\t\\tcamel or in a comfortable train or by motor car or by\\n\\t\\t\\t\\tsteamer, aeroplane, or airship.  In my opinion the\\n\\t\\t\\t\\tstandard must depend on the means of locomotion and on\\n\\t\\t\\t\\tthe relative resources of the traveller.  It is better to\\n\\t\\t\\t\\tdetermine it in each case according to circumstances."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "184",
    "NoteID": "191",
    "Body": "Those who can do it with hardship: such as aged people,\\n\\t\\t\\t\\tor persons specially circumstanced.  The Shafiis would\\n\\t\\t\\t\\tinclude a woman expecting a child, or one who is nursing\\n\\t\\t\\t\\ta baby, but on this point opinion is not unanimous, some\\n\\t\\t\\t\\tholding that they ought to put in the fasts later, when\\n\\t\\t\\t\\tthey can."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "185",
    "NoteID": "192",
    "Body": "Judgment (between right and wrong): Furqan - the\\n\\t\\t\\t\\tcriterion or standard by which we judge between right and\\n\\t\\t\\t\\twrong.\\tSee ii. 53 n."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "185",
    "NoteID": "193",
    "Body": "The regulations are again and again coupled with an\\n\\t\\t\\t\\tinsistence on two things: (a) the facilities and\\n\\t\\t\\t\\tconcessions given, and (b) the spiritual significance of\\n\\t\\t\\t\\tthe fast, without which it is like an empty shell without\\n\\t\\t\\t\\ta kernel.  If we relise this, we shall look upon\\n\\t\\t\\t\\tRamadhan, not as a burden, but as a blessing, and shall\\n\\t\\t\\t\\tbe duly grateful for the lead given to us in this matter."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "186",
    "NoteID": "194",
    "Body": "These verses 186 and 188 are not foreign to the subject\\n\\t\\t\\t\\tof Ramadhan, but emphasise its spiritual aspect.  Here we\\n\\t\\t\\t\\tare told of Prayer and the nearness of God, and in 188 we\\n\\t\\t\\t\\tare asked not to \"eat up\" other people's substance."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "195",
    "Body": "Men and women are each other's garments: i.e., they are\\n\\t\\t\\t\\tfor mutual support, mutual comfort, and mutual\\n\\t\\t\\t\\tprotection, fitting into each other as a garment fits the\\n\\t\\t\\t\\tbody.  A garment also is both for show and concealment. \\n\\t\\t\\t\\tThe question of sex is always delicate to handle: here we\\n\\t\\t\\t\\tare told that even in such matters a clear, open, and\\n\\t\\t\\t\\thonest course is better than fraud or self-deception. \\n\\t\\t\\t\\tThe sex instinct is classed with eating and drinking, an\\n\\t\\t\\t\\tanimal thing to be restrained, but not to be ashamed of. \\n\\t\\t\\t\\tThe three things are prohibited during the fast by day,\\n\\t\\t\\t\\tbut permitted after the fast is broken at night till the\\n\\t\\t\\t\\tnext fast commences."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "196",
    "Body": "There is difference of opinion as to the exact meaning of\\n\\t\\t\\t\\tthis.  I would connect this as a parallel clause with the\\n\\t\\t\\t\\tclause \"eat and drink\", which follows, all three being\\n\\t\\t\\t\\tgoverned by \"until the white thread\", etc.  That is, all\\n\\t\\t\\t\\tthree things must stop when the fast begins again in the\\n\\t\\t\\t\\tearly morning.\\tOr it may mean: What is permitted is well\\n\\t\\t\\t\\tenough, but seek the higher things ordained for you."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "197",
    "Body": "Those in touch with Nature know the beautiful effects of\\n\\t\\t\\t\\tearly dawn.  First appear thin white indefinable streaks\\n\\t\\t\\t\\tof light in the east; then a dark zone supervenes;\\n\\t\\t\\t\\tfollowed by a beautiful pinkish white zone clearly\\n\\t\\t\\t\\tdefined from the dark.\\tThis is the true dawn; after that\\n\\t\\t\\t\\tthe fast begins."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "198",
    "Body": "Till the night appears: From the actual practice of the\\n\\t\\t\\t\\tHoly Apostle, this is rightly interpreted to mean: \"Till\\n\\t\\t\\t\\tsunset.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "199",
    "Body": "Retreat to the Mosques by night after the fast is broken\\n\\t\\t\\t\\tis specially recommended towards the end of Ramadham, so\\n\\t\\t\\t\\tthat all carnal temptations may be avoided."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "187",
    "NoteID": "200",
    "Body": "I construe these limits as applying to the whole of the\\n\\t\\t\\t\\tregulations about fasts."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "188",
    "NoteID": "201",
    "Body": "Besides the three primal physical needs of man, which are\\n\\t\\t\\t\\tapt to make him greedy, there is a fourth greed in\\n\\t\\t\\t\\tsociety, the greed of wealth and property. The purpose of\\n\\t\\t\\t\\tfasts is not completed until this fourth greed is also\\n\\t\\t\\t\\trestrained.  Ordinarily honest men are content if they\\n\\t\\t\\t\\trefrain from robbery, theft, or embezzlement.  Two more\\n\\t\\t\\t\\tsubtle forms of the greed are mentioned here. One is\\n\\t\\t\\t\\twhere one uses one's own property for corrupting others -\\n\\t\\t\\t\\tjudges or those in authority - so as to obtain some\\n\\t\\t\\t\\tmaterial gain even under the cover and protection of the\\n\\t\\t\\t\\tlaw.  The words translated \"other people's property\" may\\n\\t\\t\\t\\talso mean \"public property\".  A still more subtle form is\\n\\t\\t\\t\\twhere we use our own property or property under our own\\n\\t\\t\\t\\tcontrol - \"among yourselves\" in the Text - for vain or\\n\\t\\t\\t\\tfrivolous uses.  Under the Islamic standard this is also\\n\\t\\t\\t\\tgreed. Property carries with it its own responsibilities.\\n\\t\\t\\t\\t If we fail to understand or fulfil them, we have not\\n\\t\\t\\t\\tlearnt the full lesson of self-denial by fasts."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "189",
    "NoteID": "202",
    "Body": "There were many superstitions connected with the New\\n\\t\\t\\t\\tMoon, as there are to the present day.\\tWe are told to\\n\\t\\t\\t\\tdisregard such superstitions.  As a measure of time,\\n\\t\\t\\t\\twhere the lunar calendar is used, the New Moon is one\\n\\t\\t\\t\\tgreat sign, for which people watch with eagerness. \\n\\t\\t\\t\\tMuslim festivals, including the Pilgrimage, are fixed by\\n\\t\\t\\t\\tthe appearance of the New Moon.  The Arabs, among other\\n\\t\\t\\t\\tsuperstitions, had one which made them enter their houses\\n\\t\\t\\t\\tby the back door during or after the Pilgrimage.  This is\\n\\t\\t\\t\\tdisapproved, for there is no virtue in any such\\n\\t\\t\\t\\tartificial restrictions.  All virtue proceeds from the\\n\\t\\t\\t\\tlove and fear of God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "189",
    "NoteID": "203",
    "Body": "This is a Muslim proverb now, and much might be written\\n\\t\\t\\t\\tabout its manifold meanings.  A few may be notes here. \\n\\t\\t\\t\\t(1) If you enter a society, respect its manners and\\n\\t\\t\\t\\tcustoms.  (2) If you want to achieve an object\\n\\t\\t\\t\\thonourably, go about it openly and not \"by a backdoor\". \\n\\t\\t\\t\\t(3) Do not beat about the bush.  (4) If you wish success\\n\\t\\t\\t\\tin an undertaking, provide all the necessary instruments\\n\\t\\t\\t\\tfor it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "190",
    "NoteID": "204",
    "Body": "War is only permissible in self-defence, and under\\n\\t\\t\\t\\twell-defined limits.  When undertaken, it must be pushed\\n\\t\\t\\t\\twith vigour, but not relentlessly, but only to restore\\n\\t\\t\\t\\tpeace and freedom for the worship of God.  In any case\\n\\t\\t\\t\\tstrict limits must not be transgressed: women, children,\\n\\t\\t\\t\\told and infirm men should not be molested, nor trees and\\n\\t\\t\\t\\tcrops cut down, nor peace withheld when the enemy comes\\n\\t\\t\\t\\tto terms."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "191",
    "NoteID": "205",
    "Body": "This passage is illustrated by the events that happened\\n\\t\\t\\t\\tat Hudaibiya in the sixth year of the Hijra, though it is\\n\\t\\t\\t\\tnot clear that it was revealed on that occasion.  The\\n\\t\\t\\t\\tMuslims were by this time a strong and influential\\n\\t\\t\\t\\tcommunity. Many of them were exiles from Mecca, where the\\n\\t\\t\\t\\tPagans had established an intolerant autocracy,\\n\\t\\t\\t\\tpersecuting Muslims, preventing them from visiting their\\n\\t\\t\\t\\thomes, and even keeping them out by force from performing\\n\\t\\t\\t\\tthe Pilgrimage during the universally recognised period\\n\\t\\t\\t\\tof truce.  This was intolerance, oppression, and\\n\\t\\t\\t\\tautocracy to the last degree, and the mere readiness of\\n\\t\\t\\t\\tthe Muslims to enforce their rights as Arab citizens\\n\\t\\t\\t\\tresulted without bloodshed in an agreement which the\\n\\t\\t\\t\\tMuslims faithfully observed.  The Pagans, however, had no\\n\\t\\t\\t\\tscruples in breaking faith, and it is unnecessary here to\\n\\t\\t\\t\\tgo into subsequent events."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "191",
    "NoteID": "206",
    "Body": "Suppress faith: in the narrower as well as the larger\\n\\t\\t\\t\\tsense.\\tIf they want forcibly to prevent you from\\n\\t\\t\\t\\texercising your sacred rites, they have declared war on\\n\\t\\t\\t\\tyour religion, and it would be cowardice to ignore the\\n\\t\\t\\t\\tchallenge or to fail in rooting out the tyranny."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "193",
    "NoteID": "207",
    "Body": "Justice and faith.  The Arabic word is Din, which is\\n\\t\\t\\t\\tcomprehensive.\\tIt implies the ideas of indebtedness,\\n\\t\\t\\t\\tduty, obedience, judgment, justice, faith, religion,\\n\\t\\t\\t\\tcustomary rites, etc.  The clause means: \"until there is\\n\\t\\t\\t\\tDin for God.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "193",
    "NoteID": "208",
    "Body": "If the opposite party cease to persecute you, your\\n\\t\\t\\t\\thostility ends with them as a party, but it does not\\n\\t\\t\\t\\tmean, that you become friends to oppression.  Your fight\\n\\t\\t\\t\\tis against wrong; there should be no rancour against men."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "194",
    "NoteID": "209",
    "Body": "Haram - prohibited, sacred.  The month of Pilgrimage\\n\\t\\t\\t\\t(Zul-hajj) was a sacred month, in which warfare was\\n\\t\\t\\t\\tprohibited by Arab custom.  The month preceding (Zul-qad)\\n\\t\\t\\t\\tand the month following (Muharram) were included in the\\n\\t\\t\\t\\tprohibition, and Muharram was specially called al-Haram. \\n\\t\\t\\t\\tPossibly Muharram is meant in the first line, and the\\n\\t\\t\\t\\tother months and other prohibited things in \"all things\\n\\t\\t\\t\\tprohibited\".  In Rajab, also, war was prohibited.  If the\\n\\t\\t\\t\\tpagan enemies of Islam broke that custom and made war in\\n\\t\\t\\t\\tthe prohibited months, the Muslims were free also to\\n\\t\\t\\t\\tbreak that custom but only to the same extent as the\\n\\t\\t\\t\\tother broke it. Similarly the territory of Mecca was\\n\\t\\t\\t\\tsacred, in which war was prohibited.  If the enemies of\\n\\t\\t\\t\\tIslam broke that custom, the Muslims were free to do so\\n\\t\\t\\t\\tto that extent.  Any convention is useless if one party\\n\\t\\t\\t\\tdoes not respect it.  There must be a law of equality. \\n\\t\\t\\t\\tOr perhaps the word reciprocity may express it better."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "194",
    "NoteID": "210",
    "Body": "At the same time the Muslims are commanded to exercise\\n\\t\\t\\t\\tself-restraint as much as possible.  Force is a dangerous\\n\\t\\t\\t\\tweapon.  It may have to be used for self-defence or\\n\\t\\t\\t\\tself-preservation, but we must always remember that\\n\\t\\t\\t\\tself-restraint is pleasing in the eyes of God.\\tEven when\\n\\t\\t\\t\\twe are fighting, it should be for a principle, not out of\\n\\t\\t\\t\\tpassion."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "195",
    "NoteID": "211",
    "Body": "Every fight requires the wherewithals for the fight, the\\n\\t\\t\\t\\t\"sinews of war\".  If the war is just and in the cause of\\n\\t\\t\\t\\tGod, all who have wealth must spend it freely.\\tThat may\\n\\t\\t\\t\\tbe their contribution to the Cause, in addition to their\\n\\t\\t\\t\\tpersonal effort, or if for any reason they are unable to\\n\\t\\t\\t\\tfight.\\tIf they hug their wealth, perhaps their own hands\\n\\t\\t\\t\\tare helping in their own self destruction. Or if their\\n\\t\\t\\t\\twealth is being spent, not in the Cause of God, but in\\n\\t\\t\\t\\tsomething which pleases their fancy, it may be that the\\n\\t\\t\\t\\tadvantage goes to the enemy, and they are by their action\\n\\t\\t\\t\\thelping their own destruction.\\tIn all things, their\\n\\t\\t\\t\\tstandard should be, not selfishness, but the good of\\n\\t\\t\\t\\ttheir brethren, for such good is pleasing to God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "212",
    "Body": "See ii. 158, n. 161.  The Hajj is the complete\\n\\t\\t\\t\\tpilgrimage, of which the chief rites are during the first\\n\\t\\t\\t\\tten days of the month of Zul-hajj.  The umra is a less\\n\\t\\t\\t\\tformal pilgrimage at any time of the year.  In either\\n\\t\\t\\t\\tcase, the intending pilgrim commences by putting on a\\n\\t\\t\\t\\tsimple garment of unsewn cloth in two pieces when he is\\n\\t\\t\\t\\tsome distance yet from Mecca.  The putting on of the\\n\\t\\t\\t\\tpilgrim garb (ihram) is symbolical of his renouncing the\\n\\t\\t\\t\\tvanities of the world.\\tAfter this and until the end of\\n\\t\\t\\t\\tthe pilgrimage he must not wear other clothes, or\\n\\t\\t\\t\\tornaments, anoint his hair, use perfumes, hunt, or do\\n\\t\\t\\t\\tother prohibited acts. The completion of the pilgrimage\\n\\t\\t\\t\\tis symbolised by the shaving of the head for men, and the\\n\\t\\t\\t\\tcutting off of a few locks of the hair of the head for\\n\\t\\t\\t\\twomen, the putting off of the ihram and the resumption of\\n\\t\\t\\t\\tthe ordinary dress."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "213",
    "Body": "If any one is taken ill after putting on the ihram, so\\n\\t\\t\\t\\tthat he has to put on other clothes, or if he has trouble\\n\\t\\t\\t\\tor skin disease in his head or insects in his hair, and\\n\\t\\t\\t\\the has to shave his head before completion, he should\\n\\t\\t\\t\\tfast (three days, say the Commentators), or feed the\\n\\t\\t\\t\\tpoor, or offer sacrifice."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "214",
    "Body": "When this was revealed, the city of Mecca was in the\\n\\t\\t\\t\\thands of the enemies of Islam, and the regulations about\\n\\t\\t\\t\\tthe fighting and the pilgrimage came together and were\\n\\t\\t\\t\\tinterconnected.  But the revelation provides, as always,\\n\\t\\t\\t\\tfor the particular occasion, and also for normal\\n\\t\\t\\t\\tconditions.  Mecca soon passed out of the hands of the\\n\\t\\t\\t\\tenemies of Islam.  People sometimes came long distances\\n\\t\\t\\t\\tto Mecca before the pilgrimage season began.  Having\\n\\t\\t\\t\\tperformed the umra, they stayed on for the formal Hajj. \\n\\t\\t\\t\\tIn case the pilgrim had spent his money, he is shown what\\n\\t\\t\\t\\the can do, rich or poor, and yet hold his head high among\\n\\t\\t\\t\\this fellows, as having performed all rites as prescribed."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "215",
    "Body": "For residents in Mecca the question does not arise.  They\\n\\t\\t\\t\\tare there every day, and there is no question of umra for\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "196",
    "NoteID": "216",
    "Body": "This closes the section about the duties of fighting and\\n\\t\\t\\t\\tintroduces the connected question of pilgrimage in a sort\\n\\t\\t\\t\\tof transition.\\tFighting is connected with fear, and\\n\\t\\t\\t\\twhile it is meritorious to obey God, we are warned that\\n\\t\\t\\t\\twe must not allow our selfish passions to carry us away,\\n\\t\\t\\t\\tbecause it is in such times of stress that our spirit is\\n\\t\\t\\t\\ttested.  Verse 195 ended with a benediction for those who\\n\\t\\t\\t\\tdo good.  This verse ends with a warning to those who\\n\\t\\t\\t\\ttake advantage of God's cause to transgress the limits,\\n\\t\\t\\t\\tfor the punishment is equally sure.  The next verse shows\\n\\t\\t\\t\\tus the pitfalls we must avoid in a large concourse of\\n\\t\\t\\t\\tpeople."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "197",
    "NoteID": "217",
    "Body": "The months well known: the months of Shawwal, Zul-qa'da,\\n\\t\\t\\t\\tand Zul-hijja (up to the 10th or the 13th) are set apart\\n\\t\\t\\t\\tfor the rites of Hajj.\\tThat is to say, the first rites\\n\\t\\t\\t\\tmay begin as early as the beginning of Shawwal, with a\\n\\t\\t\\t\\tdefinite approach to Mecca, but the chief rites are\\n\\t\\t\\t\\tconcentrated on the first ten days of Zul-hijja, and\\n\\t\\t\\t\\tspecially on the 8th, 9th and 10th of that month, when\\n\\t\\t\\t\\tthe concourse of pilgrims reaches its height.  The chief\\n\\t\\t\\t\\trites may be briefly enumerated: (1) the wearing of the\\n\\t\\t\\t\\tpilgrim garment (ihram) from certain points definitely\\n\\t\\t\\t\\tfixed on all the roads to Mecca; after this the\\n\\t\\t\\t\\tpilgrimage prohibitions come into operation and the\\n\\t\\t\\t\\tpilgrim is dedicated to worship and prayer and the denial\\n\\t\\t\\t\\tof vanities: (2) the going round the Ka'ba seven times\\n\\t\\t\\t\\t(tawaf), typifying activity, with the kissing of the\\n\\t\\t\\t\\tlittle Black Stone built into the wall, the symbol of\\n\\t\\t\\t\\tconcentration in the love of God; (3) After a short\\n\\t\\t\\t\\tprayer at the Station of Abraham (Q. ii. 125), the\\n\\t\\t\\t\\tpilgrim goes to the hills Safa and Marwa (Q. ii. 158),\\n\\t\\t\\t\\tthe symbols of patience and perserverance; (4) the great\\n\\t\\t\\t\\tSermon (Khutba) on the 7th of Zul-hijja, when the whole\\n\\t\\t\\t\\tassembly listens to an exposition of the meaning of Hajj;\\n\\t\\t\\t\\t(5) the visit on the eighth, of the whole body of\\n\\t\\t\\t\\tpilgrims to the Valley of Mina (about six miles north of\\n\\t\\t\\t\\tMecca), where the pilgrims halt and stay the night,\\n\\t\\t\\t\\tproceeding on the ninth to the plain and hill of Arafat,\\n\\t\\t\\t\\tabout five miles further north, which commemorates the\\n\\t\\t\\t\\treunion of Adam and Eve after their wanderings, and is\\n\\t\\t\\t\\talso called the Mount of Mercy; (6) the tenth day, the Id\\n\\t\\t\\t\\tDay, the day of Sacrifice, when the sacrifice is offered\\n\\t\\t\\t\\tin the Valley of Mina, and the symbolic ceremony of\\n\\t\\t\\t\\tcasting seven stones at the Evil One is performed on the\\n\\t\\t\\t\\tfirst occasion; it is continued on subsequent days; both\\n\\t\\t\\t\\trites are connected with the story of Abraham; this is\\n\\t\\t\\t\\tthe Id-ul-Adhha; note that the ceremony is symbolically\\n\\t\\t\\t\\tconnected with the rejection of evil in thought, word,\\n\\t\\t\\t\\tand deed.  This closes the Pilgrimage, but a stay of two\\n\\t\\t\\t\\tor three days after this is recommended, and this is\\n\\t\\t\\t\\tcalled Tashriq."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "197",
    "NoteID": "218",
    "Body": "It is recommended that pilgrims should come with\\n\\t\\t\\t\\tprovisions, so that they should not be compelled to\\n\\t\\t\\t\\tresort to begging.  But, as usual, our thought is\\n\\t\\t\\t\\tdirected at once from the physical to the spiritual.  If\\n\\t\\t\\t\\tprovisions are required for a journey on earth, how much\\n\\t\\t\\t\\tmore important to provide for the final journey into the\\n\\t\\t\\t\\tfuture world?  The best of such provisions is right\\n\\t\\t\\t\\tconduct, which is the same as the fear of God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "198",
    "NoteID": "219",
    "Body": "Legitimate trade is allowed, in the interests both of the\\n\\t\\t\\t\\thonest trader, who can thus meet his own expenses, and of\\n\\t\\t\\t\\tthe generality of pilgrims, who would otherwise be\\n\\t\\t\\t\\tgreatly inconvenienced for the necessaries of life.  But\\n\\t\\t\\t\\tthe profit must be sought as from the \"bounty of God\". \\n\\t\\t\\t\\tThere should be no profiteering, or trade \"tricks\".  Good\\n\\t\\t\\t\\thonest trade is a form of service to the community, and\\n\\t\\t\\t\\ttherefore to God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "198",
    "NoteID": "220",
    "Body": "About midway between Arafat and Mina (see n. 217 to ii.\\n\\t\\t\\t\\t197) is a place called Muzdalifa where the Holy Apostle\\n\\t\\t\\t\\toffered up a long prayer.  It has thus become a Sacred\\n\\t\\t\\t\\tMonument and pilgrims are directed to follow that example\\n\\t\\t\\t\\ton their return.  A special reason for this is given in\\n\\t\\t\\t\\tthe note following."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "198",
    "NoteID": "221",
    "Body": "Certain arrogant tribes living in Mecca used not to go to\\n\\t\\t\\t\\tArafat with the crowd but to stop short at Muzdalifa. \\n\\t\\t\\t\\tThey are rebuked for their arrogance and told that they\\n\\t\\t\\t\\tmust perform all the rites like the rest of the pilgrims.\\n\\t\\t\\t\\t There is equality in Islam."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "199",
    "NoteID": "222",
    "Body": "See the last note.  Towards the end of the Pilgrimage the\\n\\t\\t\\t\\tcrowd is very great, and if any people loitered after\\n\\t\\t\\t\\tArafat, it would cause great confusion and inconvenience.\\n\\t\\t\\t\\t The pace has therefore to be quick for every one, a very\\n\\t\\t\\t\\tsalutary regulation.  Every member of the crowd must\\n\\t\\t\\t\\tthink of the comfort and convenience of the whole mass."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "200",
    "NoteID": "223",
    "Body": "After the Pilgrimage, in Pagan times, the pilgrims used\\n\\t\\t\\t\\tto gather in assemblies in which the praises of ancestors\\n\\t\\t\\t\\twere sung.  As the whole of the pilgrimage rites were\\n\\t\\t\\t\\tspiritualised in Islam, so this aftermath of the\\n\\t\\t\\t\\tpilgrimage was also spiritualised.  It was recommended\\n\\t\\t\\t\\tfor pilgrims to stay on two or three days after the\\n\\t\\t\\t\\tpilgrimage, but they must use them in prayer and praise\\n\\t\\t\\t\\tto God.  See ii. 203 below."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "200",
    "NoteID": "224",
    "Body": "If you hasten to get all the good things of the world,\\n\\t\\t\\t\\tand only think of them and pray for them, you would lose\\n\\t\\t\\t\\tthe higher things of the future.  The proper Muslim\\n\\t\\t\\t\\tattitude is neither to renounce this would nor to be so\\n\\t\\t\\t\\tengrossed in it as to forget the spiritual future."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "202",
    "NoteID": "225",
    "Body": "Our spiritual account is counting up, both on the debit\\n\\t\\t\\t\\tand credit side.  In worldly accounts, both our profits\\n\\t\\t\\t\\tand our losses may be delayed.\\tBut in God's books there\\n\\t\\t\\t\\tis no delay.  Our actions go before us.  (See ii. 95. n)"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "203",
    "NoteID": "226",
    "Body": "The Appointed Days: the three days after the tenth, when\\n\\t\\t\\t\\tthe pilgrims stay on in the Valley of Mina for prayer and\\n\\t\\t\\t\\tpraise.  They are the days of Tashriq (see ii. 200, n.\\n\\t\\t\\t\\t223).  It is optional for pilgrims to leave on the second\\n\\t\\t\\t\\tor third day."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "204",
    "NoteID": "227",
    "Body": "The two contrasted types of men mentioned in ii. 200 and\\n\\t\\t\\t\\t201 are here further particularised: the glib hypocrite\\n\\t\\t\\t\\twho appears worldly-wise but plans harm, contrasted with\\n\\t\\t\\t\\tthe sincere believer who is prepared to suffer martyrdom\\n\\t\\t\\t\\tfor his faith.\\tThe Commentators give names of people who\\n\\t\\t\\t\\texemplified these types.  The mischief maker has a smooth\\n\\t\\t\\t\\ttongue and indulges in plausible talk with many oaths. \\n\\t\\t\\t\\tHe appears to be worldly-wise, and though you may despise\\n\\t\\t\\t\\thim for his worldiness, you may not realise his frauds. \\n\\t\\t\\t\\tBehind your back he is an implacable  enemy.  He stirs up\\n\\t\\t\\t\\tquarrels, and causes all sorts of mischief to you or your\\n\\t\\t\\t\\tfriends.  He can never win God's love, and we are warned\\n\\t\\t\\t\\tagainst his tricks."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "206",
    "NoteID": "228",
    "Body": "According to the English saying, \"As you have made your\\n\\t\\t\\t\\tbed, so you must lie in it.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "207",
    "NoteID": "229",
    "Body": "This second type of man, - firm, sincere, devoted,\\n\\t\\t\\t\\twilling to give his life for the faith that is in him -\\n\\t\\t\\t\\twas common in early Islam.  Such men were its pillars. \\n\\t\\t\\t\\tThrough persecution, obloquy, torture, threat to their\\n\\t\\t\\t\\town lives or the lives of those dear to them, they stood\\n\\t\\t\\t\\tby their leader, and many of them gave their lives.  That\\n\\t\\t\\t\\tis what established Islam.  We are asked in the next\\n\\t\\t\\t\\tverse to follow this type and shun the other or evil\\n\\t\\t\\t\\ttype.  If we do that, our Cause is safe."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "209",
    "NoteID": "230",
    "Body": "If you backslide after the conviction has been brought\\n\\t\\t\\t\\thome to you, you may cause some inconvenience to the\\n\\t\\t\\t\\tCause, or to those who counted upon you, but do not be so\\n\\t\\t\\t\\tarrogant as to suppose that you will defeat God's Power\\n\\t\\t\\t\\tand Wisdom. The loss will be your own."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "210",
    "NoteID": "231",
    "Body": "If faith is wanting, all sorts of excuses are made to\\n\\t\\t\\t\\tresist the appeal of God. They might and do say: \"Oh yes!\\n\\t\\t\\t\\twe shall believe if God appears to us with His angels in\\n\\t\\t\\t\\tHis glory!\"  In other words they want to settle the\\n\\t\\t\\t\\tquestion in their way, and not in God's way.  That will\\n\\t\\t\\t\\tnot do.  The decision in all questions belongs to God. \\n\\t\\t\\t\\tIf we are true to Him, we wait for His times and seasons,\\n\\t\\t\\t\\tand do not expect Him to wait on ours."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "211",
    "NoteID": "232",
    "Body": "The Israelites under Moses were shown God's glory and\\n\\t\\t\\t\\tmany clear Signs and yet they went after their own ways,\\n\\t\\t\\t\\tand preferred their own whims and fancies.  So do people\\n\\t\\t\\t\\tin all ages.  But let them not deceive themselves.  God's\\n\\t\\t\\t\\tjustice is sure, and when it comes, it will be strict and\\n\\t\\t\\t\\tunmistakable to those who reject His grace."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "211",
    "NoteID": "233",
    "Body": "Cf. ii. 196 (end) where the question was of those who do\\n\\t\\t\\t\\tnot fear God.  Here the question is of those who reject\\n\\t\\t\\t\\tGod's Signs."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "212",
    "NoteID": "234",
    "Body": "God's gifts in this world seem unequal, and sometimes\\n\\t\\t\\t\\tthose get them who seem to deserve them least.\\tGod's\\n\\t\\t\\t\\tbounty is unlimited to the just as well as the unjust. \\n\\t\\t\\t\\tIn His wisdom He may give to whomsoever He pleases.  The\\n\\t\\t\\t\\taccount is not taken now, but will be taken in the end,\\n\\t\\t\\t\\twhen the balance will be redressed."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "215",
    "NoteID": "235",
    "Body": "Three questions arise in charity: (1) What shall we give?\\n\\t\\t\\t\\t(2) to whom shall we give? and (3) how shall we give? \\n\\t\\t\\t\\tThe answer is here.  Give anything that is good, useful,\\n\\t\\t\\t\\thelpful, valuable.  It may be property or money; it may\\n\\t\\t\\t\\tbe a helping hand; it may be advice; it may be a kind\\n\\t\\t\\t\\tword; \"whatever ye do that is good\" is charity.  On the\\n\\t\\t\\t\\tother hand, if you throw away what is useless, there is\\n\\t\\t\\t\\tno charity in it.  Or if you give something with a\\n\\t\\t\\t\\tharmful intent, e.g., a sword to a madman, or a drug or\\n\\t\\t\\t\\tsweets or even money to someone whom you want to entrap\\n\\t\\t\\t\\tor corrupt, it is no charity but a gift of damnation.  To\\n\\t\\t\\t\\twhom should you give?  It may be tempting to earn the\\n\\t\\t\\t\\tworld's praise by a gift that will be talked about, but\\n\\t\\t\\t\\tare you meeting the needs of those who have the first\\n\\t\\t\\t\\tclaim on you?  If you are not, you are like a person who\\n\\t\\t\\t\\tdefrauds creditors: it is no charity.  Every gift is\\n\\t\\t\\t\\tjudged by its unselfish character: the degree of need or\\n\\t\\t\\t\\tclaim is a factor which you should consider; if you\\n\\t\\t\\t\\tdisregard it, there is something selfish behind it.  How\\n\\t\\t\\t\\tshould it be given?  As in the sight of God; thus shuts\\n\\t\\t\\t\\tout all pretence, show, and insincerity."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "216",
    "NoteID": "236",
    "Body": "To fight in the cause of Truth is one of the highest\\n\\t\\t\\t\\tforms of charity.  What can you offer that is more\\n\\t\\t\\t\\tprecious than your own life?  But here again the\\n\\t\\t\\t\\tlimitations come in.  If you are a mere brawler, or a\\n\\t\\t\\t\\tselfish aggressive person, or a vainglorious bully, you\\n\\t\\t\\t\\tdeserve the highest censure.  If you offer your life to\\n\\t\\t\\t\\tthe righteous Iman, who is only guided by God, you are an\\n\\t\\t\\t\\tunselfish here.  God knows the value of things better\\n\\t\\t\\t\\tthan you do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "217",
    "NoteID": "237",
    "Body": "Prohibited Month: See ii. 194, n. 209."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "217",
    "NoteID": "238",
    "Body": "The intolerance and persecution of the Pagan clique at\\n\\t\\t\\t\\tMecca caused untold hardships to the holy Messenger of\\n\\t\\t\\t\\tIslam and his early disciples.\\tThey bore all with\\n\\t\\t\\t\\tmeekness and long-suffering patience until the holy one\\n\\t\\t\\t\\tpermitted them to take up arms in self-defence.  Then\\n\\t\\t\\t\\tthey were twitted with breach of the custom about\\n\\t\\t\\t\\tProhibited Months, though they were driven to fight\\n\\t\\t\\t\\tduring that period against their own feeling in self\\n\\t\\t\\t\\tdefence.  But their enemies not only forced them to\\n\\t\\t\\t\\tengage in actual warfare, but interfered with their\\n\\t\\t\\t\\tconscience, persecuted them and their families, openly\\n\\t\\t\\t\\tinsulted and denied God, kept out the Muslim Arabs from\\n\\t\\t\\t\\tthe Sacred Mosque, and exiled them.  Such violence and\\n\\t\\t\\t\\tintolerance are deservedly called worse than slaughter."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "217",
    "NoteID": "239",
    "Body": "Cf. ii. 191, 193, where a similar phrase occurs.  Fitna -\\n\\t\\t\\t\\ttrial, temptation, as in ii. 102; or tumult, sedition,\\n\\t\\t\\t\\toppression, as here; M.M.A., H.G.S., and M.P. translate\\n\\t\\t\\t\\t\"persecution\" in this passage, which is also legitimate,\\n\\t\\t\\t\\tseeing that persecution is the suppression of some\\n\\t\\t\\t\\topinion by violence, force, or threats."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "219",
    "NoteID": "240",
    "Body": "Wine: Khamr: literally understood to mean the fermented\\n\\t\\t\\t\\tjuice of the grape; applied by analogy to all fermented\\n\\t\\t\\t\\tliquor, and by further analogy to any intoxicating liquor\\n\\t\\t\\t\\tor drug.  There may possible be some benefit in it, but\\n\\t\\t\\t\\tthe harm is greater than the benefit, especially  if we\\n\\t\\t\\t\\tlook at it from a social as well as an individual point\\n\\t\\t\\t\\tof view."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "219",
    "NoteID": "241",
    "Body": "Gambling: maisir: literally, a means of getting something\\n\\t\\t\\t\\ttoo easily, getting a profit without working for it;\\n\\t\\t\\t\\thence gambling.  That is the principle on which gambling\\n\\t\\t\\t\\tis prohibited.\\tThe form must familiar to the Arabs was\\n\\t\\t\\t\\tgambling by casting lots by means of arrows, on the\\n\\t\\t\\t\\tprinciple of a lottery: the arrows were marked, and\\n\\t\\t\\t\\tserved the same purpose as a modern lottery ticket. \\n\\t\\t\\t\\tSomething e.g., the carcase of a slaughtered animal, was\\n\\t\\t\\t\\tdivided into unequal parts.  The marked arrows were drawn\\n\\t\\t\\t\\tfrom a bag.  Some were blank and those who drew them got\\n\\t\\t\\t\\tnothing.  Others indicated prizes, which were big or\\n\\t\\t\\t\\tsmall.\\tWhether you got a big share or a small share, or\\n\\t\\t\\t\\tnothing, depended on pure luck, unless that was fraud\\n\\t\\t\\t\\talso on the part of some persons concerned.  The\\n\\t\\t\\t\\tprinciple on which the objection is based is: that, even\\n\\t\\t\\t\\tif there is no fraud, you gain what you have not earned,\\n\\t\\t\\t\\tor lose on a mere chance.  Dice and wagering are rightly\\n\\t\\t\\t\\theld to be within the definition of gambling.  But\\n\\t\\t\\t\\tinsurance is not gambling, when conducted on business\\n\\t\\t\\t\\tprinciples.  Here the basis for calculation is statistics\\n\\t\\t\\t\\ton a large scale, from which mere chance is eliminated. \\n\\t\\t\\t\\tThe insurers themselves pay premia in proportion to\\n\\t\\t\\t\\trisks, exactly and statistically calculated."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "219",
    "NoteID": "242",
    "Body": "Hoarding is no use either to ourselves, or to any one\\n\\t\\t\\t\\telse.  We should use the wealth we need; any\\n\\t\\t\\t\\tsuperfluities we must spend in good works or in charity."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "220",
    "NoteID": "243",
    "Body": "Gambling and intemperance are social as ell as individual\\n\\t\\t\\t\\tsins.  They may ruin us in our ordinary every-day worldly\\n\\t\\t\\t\\tlife, as well as our spiritual future.\\tIn case it is\\n\\t\\t\\t\\tsuggested that there is no harm in a little indulgence,\\n\\t\\t\\t\\twe are asked to think over all its aspects, social and\\n\\t\\t\\t\\tindividual, - worldly and spiritual."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "221",
    "NoteID": "246",
    "Body": "Marriage is a most intimate communion, and the mystery of\\n\\t\\t\\t\\tsex finds its highest fulfilment when intimate spiritual\\n\\t\\t\\t\\tharmony is combined with the physical link. If religion\\n\\t\\t\\t\\tis at all a real influence in life to both parties or to\\n\\t\\t\\t\\teither party, a difference in this vital matter must\\n\\t\\t\\t\\taffect the lives of both more profoundly than differences\\n\\t\\t\\t\\tof birth, race, language, or position in life.\\tIt is\\n\\t\\t\\t\\ttherefore only right that the parties to be married\\n\\t\\t\\t\\tshould have the same spiritual outlook.  If two person\\n\\t\\t\\t\\tlove each other, their outlook in the highest things of\\n\\t\\t\\t\\tlife must be the same.\\tNote that religion is not here a\\n\\t\\t\\t\\tmere label or a matter of custom or birth.  The two\\n\\t\\t\\t\\tpersons may have been born in different religions, but\\n\\t\\t\\t\\tif, by their mutual influence, they come to see the truth\\n\\t\\t\\t\\tin the same way, they must openly accept the same rites\\n\\t\\t\\t\\tand the same social brotherhood.  Otherwise the position\\n\\t\\t\\t\\twill become impossible individually and socially."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "222",
    "NoteID": "247",
    "Body": "Azan: hurt, pollution.\\tBoth aspects must be remembered. \\n\\t\\t\\t\\tPhysical cleanliness and purity make for health, bodily\\n\\t\\t\\t\\tand spiritual.\\tBut the matter should be looked at from\\n\\t\\t\\t\\tthe woman's point of view as well as the man's.  To her\\n\\t\\t\\t\\tthere is danger of hurt, and she should have every\\n\\t\\t\\t\\tconsideration.\\tIn the animal world, instinct is a guide\\n\\t\\t\\t\\twhich is obeyed.  Man should in this respect be better:\\n\\t\\t\\t\\the is often worse."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "222",
    "NoteID": "248",
    "Body": "Haithu: A comprehensive word referring to manner, time,\\n\\t\\t\\t\\tor place.  The most delicate matters are here referred to\\n\\t\\t\\t\\tin the most discreet and yet helpful terms.  In sex\\n\\t\\t\\t\\tmorality, manner, time, and place are all important: and\\n\\t\\t\\t\\tthe highest standards are set by social laws, by our own\\n\\t\\t\\t\\trefined instinct of mutual consideration, and above all,\\n\\t\\t\\t\\tby the light shed by the highest Teachers form the wisdom\\n\\t\\t\\t\\twhich they receive from our Maker, Who loves purity and\\n\\t\\t\\t\\tcleanliness in all things."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "223",
    "NoteID": "249",
    "Body": "Sex is not a thing to be ashamed of, or to be treated\\n\\t\\t\\t\\tlightly, or to be indulged to excess.  It is as solemn a\\n\\t\\t\\t\\tfact as any in life.  It is compared to a husbandman's\\n\\t\\t\\t\\ttilth; it is a serious affair to him; he sows the seed in\\n\\t\\t\\t\\torder to reap the harvest.  But he chooses his own time\\n\\t\\t\\t\\tand mode of cultivation.  He does not sow out of season\\n\\t\\t\\t\\tnor cultivate in a manner which will injure or exhaust\\n\\t\\t\\t\\tthe soul.  He is wise and considerate and does not run\\n\\t\\t\\t\\triot.  Coming from the simile to human beings, every kind\\n\\t\\t\\t\\tof mutual consideration is required, but above all, we\\n\\t\\t\\t\\tmust remember that even in these matters there is a\\n\\t\\t\\t\\tspiritual aspect.  We must never forget our souls, and\\n\\t\\t\\t\\tthat we are responsible to God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "223",
    "NoteID": "250",
    "Body": "Our highest spiritual ambition should be the hope of\\n\\t\\t\\t\\tmeeting God.  To uphold such a hope is to give glad\\n\\t\\t\\t\\ttidings to people of faith.  It would only be unrepentant\\n\\t\\t\\t\\tsinners who would fear the meeting.  Note how the most\\n\\t\\t\\t\\tsensuous matters are discussed frankly, and immediately\\n\\t\\t\\t\\ttaken up into the loftiest regions of spiritual\\n\\t\\t\\t\\tupliftment."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "224",
    "NoteID": "251",
    "Body": "The Arabs had many special kinds of oaths, for each of\\n\\t\\t\\t\\twhich they had a special name in their language.  Some of\\n\\t\\t\\t\\tthem related to sex matters, and caused misunderstanding,\\n\\t\\t\\t\\talienation, division, or separation between husband and\\n\\t\\t\\t\\twife. This and the following three verses refer to them. \\n\\t\\t\\t\\tIn ii. 224 we are first of all told in perfectly general\\n\\t\\t\\t\\tterms that we are not to make an oath in the name of God\\n\\t\\t\\t\\tan excuse for not doing the right thing when it is\\n\\t\\t\\t\\tpointed out to us, or for refraining from doing something\\n\\t\\t\\t\\twhich will bring people together.  If we were swayed by\\n\\t\\t\\t\\tanger or passion or mere caprice, God knows our inmost\\n\\t\\t\\t\\thearts, and right conduct and not obstinacy or quibbling\\n\\t\\t\\t\\tis what He demands from us."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "225",
    "NoteID": "252",
    "Body": "It has been held that thoughtless oaths, if there is no\\n\\t\\t\\t\\tintention behind them, can be expiated by an act of\\n\\t\\t\\t\\tcharity."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "227",
    "NoteID": "253",
    "Body": "Verses 225-27 should be read together with verse 224. \\n\\t\\t\\t\\tThe latter, though it is perfectly general, leads up to\\n\\t\\t\\t\\tthe other three."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "228",
    "NoteID": "254",
    "Body": "Islam tries to maintain the married state as far as\\n\\t\\t\\t\\tpossible, especially where children are concerned, but it\\n\\t\\t\\t\\tis against the restriction of the liberty of men and\\n\\t\\t\\t\\twomen in such vitally important matters as love and\\n\\t\\t\\t\\tfamily life.  It will check hasty action as far as\\n\\t\\t\\t\\tpossible and leave the door to reconciliation open at\\n\\t\\t\\t\\tmany stages.  Even after divorce a suggestion of\\n\\t\\t\\t\\treconciliation is made, subject to certain precautions\\n\\t\\t\\t\\t(mentioned in the following verses) against thoughtless\\n\\t\\t\\t\\taction.  A period of waiting (iddat) for three monthly\\n\\t\\t\\t\\tcourses is prescribed, in order to see if the marriage\\n\\t\\t\\t\\tconditionally dissolved is likely to result in issue. \\n\\t\\t\\t\\tBut this is not necessary where the divorced woman is a\\n\\t\\t\\t\\tvirgin: Q. xxxiii. 49.\\tIt is definitely declared that\\n\\t\\t\\t\\twomen and men shall have similar rights against each\\n\\t\\t\\t\\tother."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "228",
    "NoteID": "255",
    "Body": "The difference in economic position between the sexes\\n\\t\\t\\t\\tmakes the man's rights and liabilities a little greater\\n\\t\\t\\t\\tthan the woman's  Q. iv. 34 refers to the duty of the man\\n\\t\\t\\t\\tto maintain the woman, and to a certain difference in\\n\\t\\t\\t\\tnature between the sexes.  Subject to this, the sexes are\\n\\t\\t\\t\\ton terms of equality in law, and in certain matters the\\n\\t\\t\\t\\tweaker sex is entitled to special protection."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "229",
    "NoteID": "256",
    "Body": "Where divorce for mutual incompatibility is allowed,\\n\\t\\t\\t\\tthere is danger that the parties might act hastily, then\\n\\t\\t\\t\\trepent, and again wish to separate.  To prevent such\\n\\t\\t\\t\\tcaprisious action repeatedly, a limit is prescribed.  Two\\n\\t\\t\\t\\tdivorces (with a reconciliation between) are allowed. \\n\\t\\t\\t\\tAfter that the parties must definitely make up their\\n\\t\\t\\t\\tminds, either to dissolve their union permanently, or to\\n\\t\\t\\t\\tlive honourable lives together in mutual love and\\n\\t\\t\\t\\tforbearance - to \"hold together on equitable terms,\"\\n\\t\\t\\t\\tneither party worrying the other nor grumbling or evading\\n\\t\\t\\t\\tthe duties and responsibilities of marriage."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "229",
    "NoteID": "257",
    "Body": "If a separation is inevitable, the parties should not\\n\\t\\t\\t\\tthrow mud at each other, but recognise what is right and\\n\\t\\t\\t\\thonourable on a consideration of all the circumstances. \\n\\t\\t\\t\\tIn any case a man is not allowed to ask back for any\\n\\t\\t\\t\\tgifts or property he may have given to the wife.  This is\\n\\t\\t\\t\\tfor the protection of the economically weaker sex.  Lest\\n\\t\\t\\t\\tthat protective provision itself work against the woman's\\n\\t\\t\\t\\tfreedom, an exception is made in the next clause."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "229",
    "NoteID": "258",
    "Body": "All the prohibitions and limits prescribed here are in\\n\\t\\t\\t\\tthe interest of good and honourable lives for both sides,\\n\\t\\t\\t\\tand in the interests of a clean and honourable social\\n\\t\\t\\t\\tlife, without public or private scandals.  If there is\\n\\t\\t\\t\\tany fear that in safeguarding her economic rights, her\\n\\t\\t\\t\\tvery freedom of person may suffer, the husband refusing\\n\\t\\t\\t\\tthe dissolution of marriage, and perhaps treating her\\n\\t\\t\\t\\twith cruelty, then, in such exceptional cases, it is\\n\\t\\t\\t\\tpermissible to give some material consideration to the\\n\\t\\t\\t\\thusband, but the need and equity of this should be\\n\\t\\t\\t\\tsubmitted to the judgment of impartial judges, i.e.,\\n\\t\\t\\t\\tproperly constituted courts.  A divorce of this kind is\\n\\t\\t\\t\\tcalled khula."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "229",
    "NoteID": "259",
    "Body": "Wrong (themselves as well as others): Zalimun: for the\\n\\t\\t\\t\\troot meaning of zulm see n. 51. ii. 35."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "255",
    "NoteID": "259",
    "Body": "Wrong (themselves as well as others): Zalimun: for the\\n\\t\\t\\t\\troot meaning of zulm see n. 51. ii. 35."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "230",
    "NoteID": "260",
    "Body": "This is in continuation of the first sentence of ii. 229.\\n\\t\\t\\t\\t Two divorces followed by re-union are permissible; the\\n\\t\\t\\t\\tthird time the divorce becomes irrevocable, until the\\n\\t\\t\\t\\twoman marries some other man and he divorces her.  This\\n\\t\\t\\t\\tis to set an almost impossible condition.  The lesson is:\\n\\t\\t\\t\\tif a man loves a woman he should not allow a sudden gust\\n\\t\\t\\t\\tof temper or anger to induce him to take hasty action.\\n\\t\\t\\t\\tWhat happens after two divorces, if the man takes her\\n\\t\\t\\t\\tback?  See n. 261 to ii. 231."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "231",
    "NoteID": "261",
    "Body": "If the man takes back his wife after two divorces, he\\n\\t\\t\\t\\tmust do so only on equitable terms, i.e., he must not put\\n\\t\\t\\t\\tpressure on the woman to prejudice her rights in any way,\\n\\t\\t\\t\\tand they must live clean and honourable lives, respecting\\n\\t\\t\\t\\teach other's personalities.  There are here two\\n\\t\\t\\t\\tconditional clauses: (1) when ye divorce women, and (2)\\n\\t\\t\\t\\twhen they fulfil their Iddat: followed by two\\n\\t\\t\\t\\tconsequential clauses, (3) take them back on equitable\\n\\t\\t\\t\\tterms, or (4) set them free with kindness.  The first is\\n\\t\\t\\t\\tconnected with the third and the second with the fourth. \\n\\t\\t\\t\\tTherefore if the husband wishes to resume the marital\\n\\t\\t\\t\\trelations, he need not wait for Iddat.\\tBut if he does\\n\\t\\t\\t\\tnot so wish, she is free to marry someone else after\\n\\t\\t\\t\\tIddat.\\tFor the meaning of Iddat see n. 254 above."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "231",
    "NoteID": "262",
    "Body": "Let no one think that the liberty given to him can be\\n\\t\\t\\t\\tused for his own selfish ends.\\tIf he uses the law for\\n\\t\\t\\t\\tthe injury of the weaker party, his own moral and\\n\\t\\t\\t\\tspiritual nature suffers."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "231",
    "NoteID": "263",
    "Body": "These difficult questions of sex relations are often\\n\\t\\t\\t\\ttreated as a joke.  But they profoundly affect our\\n\\t\\t\\t\\tindividual lives, the lives of our children, and the\\n\\t\\t\\t\\tpurity and well-being of the society in which we live. \\n\\t\\t\\t\\tThis aspect of the question is reiterated again and\\n\\t\\t\\t\\tagain."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "231",
    "NoteID": "264",
    "Body": "Rehearse: zikr. Cf. ii. 151 and n. 156.  We are asked to\\n\\t\\t\\t\\tremember in our own minds, and to proclaim and praise,\\n\\t\\t\\t\\tand be proud of God's favours on us.  His favours are\\n\\t\\t\\t\\timmeasurable; not the least are His Revelations, and the\\n\\t\\t\\t\\twisdom which He has given to us to enable us to judge and\\n\\t\\t\\t\\tact up to His guidance."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "232",
    "NoteID": "265",
    "Body": "The termination of a marriage bond is a most serious\\n\\t\\t\\t\\tmatter for family and social life.  And every lawful\\n\\t\\t\\t\\tdivorce is approved which can equitably bring back those\\n\\t\\t\\t\\twho have lived together, provided only there is mutual\\n\\t\\t\\t\\tlove and they can live on honourable terms with each\\n\\t\\t\\t\\tother.\\tIf these conditions are fulfilled, it is not\\n\\t\\t\\t\\tright for outsiders to prevent or hinder re-union.  They\\n\\t\\t\\t\\tmay be swayed by property or other considerations.  This\\n\\t\\t\\t\\tverse was occasioned by an actual case that was referred\\n\\t\\t\\t\\tto the holy Apostle in his life-time."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "233",
    "NoteID": "266",
    "Body": "As this comes in the midst of the regulations on divorce,\\n\\t\\t\\t\\tit applies primarily to cases of divorce, where some\\n\\t\\t\\t\\tdefinite rule is necessary, as the father and mother\\n\\t\\t\\t\\twould not, on account of the divorce, probably be on good\\n\\t\\t\\t\\tterms, and the interests of the children must be\\n\\t\\t\\t\\tsafeguarded.  As, however, the wording is perfectly\\n\\t\\t\\t\\tgeneral, it has been held that the principle applies\\n\\t\\t\\t\\tequally to the father and mother in wedlock: each must\\n\\t\\t\\t\\tfulfil his or her part in the fostering of the child.  On\\n\\t\\t\\t\\tthe other hand, it is provided that the child shall not\\n\\t\\t\\t\\tbe used as an excuse for driving a hard bargain on either\\n\\t\\t\\t\\tside.  By mutual consent they can agree to some source\\n\\t\\t\\t\\tthat is reasonable and equitable, both as regards the\\n\\t\\t\\t\\tperiod before weaning (the maximum being two years) and\\n\\t\\t\\t\\tthe engagement of a wet-nurse, or (by analogy) for\\n\\t\\t\\t\\tartificial feeding.  But the mother's privileges must not\\n\\t\\t\\t\\tbe curtailed simply because by mutual consent she does\\n\\t\\t\\t\\tnot nurse the baby.  In a matter of this kind the\\n\\t\\t\\t\\tultimate appeal must be to godliness, for all legal\\n\\t\\t\\t\\tremedies are imperfect and may be misused."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "234",
    "NoteID": "267",
    "Body": "The 'Iddat of widowhood (four months and ten days) is\\n\\t\\t\\t\\tlonger than the 'Iddat of divorce (three monthly courses,\\n\\t\\t\\t\\tii. 228).  In the latter the only consideration is to\\n\\t\\t\\t\\tascertain if there is any unborn issues of the marriage\\n\\t\\t\\t\\tdissolved.  This is clear from xxxiii. 49, where it is\\n\\t\\t\\t\\tlaid down that there is no 'Iddat for virgin divorces. \\n\\t\\t\\t\\tIn the former there is in addition the consideration of\\n\\t\\t\\t\\tmourning and respect for the deceased husband.\\tIn either\\n\\t\\t\\t\\tcase, if it is proved that there is unborn issue, there\\n\\t\\t\\t\\tis of course no question of remarriage for the woman\\n\\t\\t\\t\\tuntil it is born and for a reasonable time afterwards. \\n\\t\\t\\t\\tMeanwhile here maintenance on a reasonable scale is\\n\\t\\t\\t\\tchargeable to the late husband or his estate."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "235",
    "NoteID": "268",
    "Body": "A definite contract of remarriage for the woman during\\n\\t\\t\\t\\ther period of 'Iddat of widowhood is forbidden as\\n\\t\\t\\t\\tobviously unseemly, as also any secrecy in such matters. \\n\\t\\t\\t\\tIt would bind the woman at a time when she is not fitted\\n\\t\\t\\t\\tto exercise her fullest judgment.  But circumstances may\\n\\t\\t\\t\\tarise when an offer (open for future consideration but\\n\\t\\t\\t\\tnot immediately decided) may be to her interests, and\\n\\t\\t\\t\\tthis is permissible.  In mystic interpretation the\\n\\t\\t\\t\\tcherishing of love in one's heart without outward show or\\n\\t\\t\\t\\treward is the true test of sincerity and devotion."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "237",
    "NoteID": "269",
    "Body": "The law declares that in such a case half the dower fixed\\n\\t\\t\\t\\tshall be paid by the man to the woman.\\tBut it is open to\\n\\t\\t\\t\\tthe woman to remit the half due to her or to the man to\\n\\t\\t\\t\\tremit the half which he is entitled to deduct, and thus\\n\\t\\t\\t\\tpay the whole."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "237",
    "NoteID": "270",
    "Body": "Him in whose hands is the marriage tie: According to\\n\\t\\t\\t\\tHanafi doctrine this is the husband himself, who can\\n\\t\\t\\t\\tordinarily by his act dissolve the marriage.  It\\n\\t\\t\\t\\ttherefore behooves him to be all the more liberal to the\\n\\t\\t\\t\\twoman and pay her the full dower even if the marriage was\\n\\t\\t\\t\\tnot consummated."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "238",
    "NoteID": "271",
    "Body": "The Middle Prayer: Salutul-wusta: may be translated \"the\\n\\t\\t\\t\\tbest or the most excellent prayer.\"  Authorities differ\\n\\t\\t\\t\\tas to the exact meaning of this phrase. The weight of\\n\\t\\t\\t\\tauthorities seems to be in favour of interpreting this as\\n\\t\\t\\t\\tthe 'Asr prayer in the middle of the afternoon.  This is\\n\\t\\t\\t\\tapt to be most neglected, and yet this is the most\\n\\t\\t\\t\\tnecessary, to remind us of God in the midst of our\\n\\t\\t\\t\\tworldly affairs.  There is special Sura, entitled 'Asr,\\n\\t\\t\\t\\tof which the mystic meaning is appropriately dealt with\\n\\t\\t\\t\\tunder that  Sura."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "239",
    "NoteID": "272",
    "Body": "Verses 238-39 are parenthetical, introducing the subject\\n\\t\\t\\t\\tof prayer in danger. This is more fully dealt with in iv.\\n\\t\\t\\t\\t101-03."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "240",
    "NoteID": "273",
    "Body": "Opinions differ whether the provision (of a year's\\n\\t\\t\\t\\tmaintenance, with residence) for a widow is abrogated by\\n\\t\\t\\t\\tthe share which the widow gets (one-eighth or one-\\n\\t\\t\\t\\tfourth) as an heir (Q.iv.12).  I do not think it is.  The\\n\\t\\t\\t\\tbequest (where made) takes effect as a charge on the\\n\\t\\t\\t\\tproperty, but the widow can leave the house before the\\n\\t\\t\\t\\tyear is out, and presumably the maintenance then ceases."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "243",
    "NoteID": "274",
    "Body": "We now return to the subject of Jihad, which we left at\\n\\t\\t\\t\\tn. 214-216.  We are to be under no illusion about it.  If\\n\\t\\t\\t\\twe are not prepared to fight for our faith, with our\\n\\t\\t\\t\\tlives and all our resources, both our lives and our\\n\\t\\t\\t\\tresources will be wiped out by our enemies.  As to life,\\n\\t\\t\\t\\tGod gave it, and a coward is not likely to save it.  It\\n\\t\\t\\t\\thas happened again and again in history that men who\\n\\t\\t\\t\\ttamely submitted to be driven from their homes although\\n\\t\\t\\t\\tthey were more numerous than their enemies had the\\n\\t\\t\\t\\tsentence of death pronounced on them for their cowardice,\\n\\t\\t\\t\\tand they deserved it.  But God gives further and further\\n\\t\\t\\t\\tchances in His mercy.  This is a lesson to every\\n\\t\\t\\t\\tgeneration.  The Commentators differ as to the exact\\n\\t\\t\\t\\tepisode referred to, but the wording is perfectly\\n\\t\\t\\t\\tgeneral, and so is the lesson to be learnt from it."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "244",
    "NoteID": "275",
    "Body": "For God's cause we must fight, but never to satisfy our\\n\\t\\t\\t\\town selfish passions or greed, for the warning is\\n\\t\\t\\t\\trepeated: \"God heareth and knoweth all things\" all deeds,\\n\\t\\t\\t\\twords and motives are perfectly open before Him, however\\n\\t\\t\\t\\twe might conceal them from men or even from ourselves. \\n\\t\\t\\t\\tSee ii. 216, n. 236."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "245",
    "NoteID": "276",
    "Body": "Spending in the cause of God is called metaphorically \"a\\n\\t\\t\\t\\tbeautiful loan\".  It is excellent in many ways: (1) it\\n\\t\\t\\t\\tshows a beautiful spirit of self-denial; (2) in other\\n\\t\\t\\t\\tloans there may be a doubt as to the safety of your\\n\\t\\t\\t\\tcapital or any return thereon; here you give in the Lord\\n\\t\\t\\t\\tof All, in Whose hands are the keys of want or plenty;\\n\\t\\t\\t\\tgiving you may have manifold blessings, and withholding\\n\\t\\t\\t\\tyou may even lose what you have.  If we remember that our\\n\\t\\t\\t\\tgoal is God, can we turn away from His cause?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "246",
    "NoteID": "277",
    "Body": "The next generation after Moses and Aaron was ruled by\\n\\t\\t\\t\\tJoshua, who crossed the Jordan and settled the tribes in\\n\\t\\t\\t\\tPalestine.  His rule lasted for 25 years, after which\\n\\t\\t\\t\\tthere was a period of 320 years when the Israelites had a\\n\\t\\t\\t\\tchequered history.  They were not united among\\n\\t\\t\\t\\tthemselves, and suffered many reverses at the hands of\\n\\t\\t\\t\\tthe Midianites, Amalekites and other tribes of Palestine.\\n\\t\\t\\t\\t They frequently lapsed into idolatry and deserted the\\n\\t\\t\\t\\tworship of the true God.  From time to time a leader\\n\\t\\t\\t\\tappeared among them who assumed dictatorial powers.\\n\\t\\t\\t\\tActing under a sort of theocratic commission from God, he\\n\\t\\t\\t\\tpointed out their backsliding, re-united them under His\\n\\t\\t\\t\\tbanner, and restored, from time to time and place to\\n\\t\\t\\t\\tplace, the power of Israel.  These dictators are called\\n\\t\\t\\t\\tJudges in the English translation of the Old Testament. \\n\\t\\t\\t\\tThe last of their line was Samuel, who marks the\\n\\t\\t\\t\\ttransition towards the line of Kings on the one hand and\\n\\t\\t\\t\\tof the later Prophets on the other.  He may be dated\\n\\t\\t\\t\\tapproximately about the 11th century B.C."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "246",
    "NoteID": "278",
    "Body": "This was Samuel.  In his time Israel had suffered from\\n\\t\\t\\t\\tmuch corruption within and many reverses without.  The\\n\\t\\t\\t\\tPhilistines had made a great attack and defeated Israel\\n\\t\\t\\t\\twith great slaughter.  The Israelites, instead of relying\\n\\t\\t\\t\\ton Faith and their own valour and cohesion, brought out\\n\\t\\t\\t\\ttheir most sacred possession, the Ark of the Covenant, to\\n\\t\\t\\t\\thelp them in the fight.  But the enemy captured it,\\n\\t\\t\\t\\tcarried it away, and retained it for seven months.  The\\n\\t\\t\\t\\tIsraelites forgot that wickedness cannot screen itself\\n\\t\\t\\t\\tbehind a sacred relic.\\tNor can a sacred relic help the\\n\\t\\t\\t\\tenemies of faith.  The enemy found that the Ark brought\\n\\t\\t\\t\\tnothing but misfortune for themselves, and were glad to\\n\\t\\t\\t\\tabondon it.  It apparently remained twenty years in the\\n\\t\\t\\t\\tvillage (qarya) of Yaarim (Kirjath-jeafim): I. Samuel,\\n\\t\\t\\t\\tvii. 2.  Meanwhile the people pressed Samuel to appoint\\n\\t\\t\\t\\tthem a king.  They thought that a king would cure all\\n\\t\\t\\t\\ttheir ills, whereas what was wanting was a spirit of\\n\\t\\t\\t\\tunion and discipline and a readiness on their part to\\n\\t\\t\\t\\tfight in the cause of God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "246",
    "NoteID": "279",
    "Body": "Samuel knew as a Prophet that the people were fickle and\\n\\t\\t\\t\\tonly wanted to cover their own want of union and true\\n\\t\\t\\t\\tspirit by asking for a king.  They replied with spirit in\\n\\t\\t\\t\\twords, but when it came to action, they failed.  They hid\\n\\t\\t\\t\\tthemselves in caves and rocks, or ran away, and even\\n\\t\\t\\t\\tthose who remained \"followed him trembling\": I. Samuel,\\n\\t\\t\\t\\txiii 6-7."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "247",
    "NoteID": "280",
    "Body": "Talut is the Arabic name for Saul, who was tall and\\n\\t\\t\\t\\thandsome, but belonged to the tribe of Bejamin, the\\n\\t\\t\\t\\tsmallest tribe in Israel.  His worldly belongings were\\n\\t\\t\\t\\tslender, and it was when he went out to search for some\\n\\t\\t\\t\\tasses which had been lost from his father's house that he\\n\\t\\t\\t\\tmet Samuel and was anointed king by him. The people's\\n\\t\\t\\t\\tfickleness appeared immediately he was named.  They\\n\\t\\t\\t\\traised all sorts of petty objections to him.  The chief\\n\\t\\t\\t\\tconsideration in their minds was selfishness: each one\\n\\t\\t\\t\\twanted to be leader and king himself, instead of desiring\\n\\t\\t\\t\\tsincerely the good of the people as a whole, as a leader\\n\\t\\t\\t\\tshould do."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "248",
    "NoteID": "281",
    "Body": "Ark of the Covenant: Tabut: a chest of acacia wood\\n\\t\\t\\t\\tcovered and lined with pure gold, about 6ft x 3ft x 3ft. \\n\\t\\t\\t\\tSee Exod xxv. 10-22.  It was to contain the \"testimony of\\n\\t\\t\\t\\tGod\", or the Ten Commandments engraved on stone, with\\n\\t\\t\\t\\trelics of Moses and Aaron.  Its Gold lid was to be the\\n\\t\\t\\t\\t\"Mercy Seat\" with two cherubims of beaten gold, with\\n\\t\\t\\t\\twings oustretched.  This was a sacred possession to\\n\\t\\t\\t\\tIsrael. It was lost to the enemy in the early part of\\n\\t\\t\\t\\tSamuel's ministry; see n. 278 to ii. 246; when it came\\n\\t\\t\\t\\tback, it remained in a village for twenty years and was\\n\\t\\t\\t\\tapparently taken to the capital when kingship was\\n\\t\\t\\t\\tinstituted.  It thus became a symbol of unity and\\n\\t\\t\\t\\tauthority."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "248",
    "NoteID": "282",
    "Body": "Security: sakina-safety, tranquility, peace.  Later\\n\\t\\t\\t\\tJewish writings use the same word for a symbol of God's\\n\\t\\t\\t\\tGlory in the Tabernacle or tent in which the Ark was\\n\\t\\t\\t\\tkept, or in the Temple when it was built by Solomon."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "248",
    "NoteID": "283",
    "Body": "Carried by angels:  these words refer to the Tabut or\\n\\t\\t\\t\\tArk, the cherubims with outstretched wings on the lid may\\n\\t\\t\\t\\twell be supposed to carry the security or peace which the\\n\\t\\t\\t\\tArk symbolised."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "251",
    "NoteID": "283",
    "Body": "Carried by angels:  these words refer to the Tabut or\\n\\t\\t\\t\\tArk, the cherubims with outstretched wings on the lid may\\n\\t\\t\\t\\twell be supposed to carry the security or peace which the\\n\\t\\t\\t\\tArk symbolised."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "249",
    "NoteID": "284",
    "Body": "A Commander is hampered by a large force if it is not in\\n\\t\\t\\t\\tperfect discipline and does not whole-heartedly believe\\n\\t\\t\\t\\tin its Commander.  He must get rid of all the doubtful\\n\\t\\t\\t\\tones, as did Gideon before Saul, and Henry V. in\\n\\t\\t\\t\\tShakespeare's story long afterwards.  Saul used the same\\n\\t\\t\\t\\ttest as Gideon; he gave a certain order when crossing a\\n\\t\\t\\t\\tstream; the greater part disobeyed, and were sent back.\\n\\t\\t\\t\\tGideon's story will be found in Judges, vii. 2-7."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "249",
    "NoteID": "285",
    "Body": "Even in the small band that remained faithful, there were\\n\\t\\t\\t\\tsome who were appalled by the number of the enemy when\\n\\t\\t\\t\\tthey met him face to face, and saw the size and strength\\n\\t\\t\\t\\tof the enemy Commander, the giant Goliath (Jalut).  But\\n\\t\\t\\t\\tthere was a very small band who were determined to face\\n\\t\\t\\t\\tall odds because they had perfect confidence in God and\\n\\t\\t\\t\\tin the cause for which they were fighting.  They were for\\n\\t\\t\\t\\tmaking a firm stand and seeking God's help.  Of that\\n\\t\\t\\t\\tnumber was David; see next note."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "251",
    "NoteID": "286",
    "Body": "Note how the whole story is compressed into a few words\\n\\t\\t\\t\\tas regards narration, but its spiritual lessons are dwelt\\n\\t\\t\\t\\tupon from many points of view.\\tThe Old Testament is\\n\\t\\t\\t\\tmainly interested in the narrative, which is full of\\n\\t\\t\\t\\tdetail, but says little about the universal truths of\\n\\t\\t\\t\\twhich every true story is a parable. The Qur-an assumes\\n\\t\\t\\t\\tthe story, but tells the parable."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "251",
    "NoteID": "287",
    "Body": "David was not only a shepherd, a warrior, a king, a wise\\n\\t\\t\\t\\tman, and a prophet, but was also endowed with the gifts\\n\\t\\t\\t\\tof poetry and music.  His Psalms (sabur) are still\\n\\t\\t\\t\\textant."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "253",
    "NoteID": "289",
    "Body": "Different gifts and different modes of procedure are\\n\\t\\t\\t\\tprescribed to God's Apostles in different ages, and\\n\\t\\t\\t\\tperhaps their degrees are different though it is not for\\n\\t\\t\\t\\tus mortals, with our imperfect knowledge to make any\\n\\t\\t\\t\\tdifference between one and another of God's Apostles (ii.\\n\\t\\t\\t\\t136).  As this winds up the argument about fighting,\\n\\t\\t\\t\\tthree illustrations are given from the past, how it\\n\\t\\t\\t\\taffected God's Messengers.  To Moses God spoke in clouds\\n\\t\\t\\t\\tof glory; he led his men for forty years through the\\n\\t\\t\\t\\twilderness, mainly fighting against the unbelief of his\\n\\t\\t\\t\\town people; he organised them to fight with the sword for\\n\\t\\t\\t\\tPalestine, but was raised to God's mercy before his\\n\\t\\t\\t\\tenterprise ripened, and it fell to Joshua to carry out\\n\\t\\t\\t\\this plan.  David, though a mere shepherd boy, was chosen\\n\\t\\t\\t\\tby God. He overthrew the greatest warrior of his time,\\n\\t\\t\\t\\tbecame a king, and waged successful wars, being also a\\n\\t\\t\\t\\tprophet, a poet, and a musician.  Jesus was \"strengthened\\n\\t\\t\\t\\twith the holy spirit\": he was given no weapons to fight\\n\\t\\t\\t\\tand his mission was of a more limited character.  In\\n\\t\\t\\t\\tMuhammad's mission these and other characters were\\n\\t\\t\\t\\tcombined.  Gentler than Jesus, he organised on a vaster\\n\\t\\t\\t\\tscale than Moses and from Medina he ruled and gave laws,\\n\\t\\t\\t\\tand the Qur-an has a vaster scope than the Psalms of\\n\\t\\t\\t\\tDavid."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "253",
    "NoteID": "290",
    "Body": "Moses:\\tsee note above."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "253",
    "NoteID": "291",
    "Body": "There is a two-fold sense: they were raised to high posts\\n\\t\\t\\t\\tof honour, and they rose by degrees.  I take the\\n\\t\\t\\t\\treference to be to David."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "253",
    "NoteID": "292",
    "Body": "Cf. ii 87.  See n. 401 to iii. 62."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "253",
    "NoteID": "293",
    "Body": "If some power of choice was to be given to man, his\\n\\t\\t\\t\\tselfishness inevitably caused divisions.  It must not be\\n\\t\\t\\t\\tsupposed that it frustrates God's Plan.  He carries it\\n\\t\\t\\t\\tout as He will."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "254",
    "NoteID": "294",
    "Body": "Spend, i.e, give away in chartiy, or employ in good\\n\\t\\t\\t\\tworks, but do not hoard. Good works would in Islam\\n\\t\\t\\t\\tinclude everything that advances the good of one that is\\n\\t\\t\\t\\tin need whether a neighbor or a stranger or that advances\\n\\t\\t\\t\\tthe good of the community or even the good of the person\\n\\t\\t\\t\\thimself to whom God has given the bounty.  But it must be\\n\\t\\t\\t\\treal good and there should be no admixture of baser\\n\\t\\t\\t\\tmotives, such as vainglory, or false indulgence, or\\n\\t\\t\\t\\tencouragement of idleness, or playing off one person\\n\\t\\t\\t\\tagainst another.  The bounties include mental and\\n\\t\\t\\t\\tspiritual gifts as well as wealth and material gifts."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "254",
    "NoteID": "295",
    "Body": "Cf. ii. 123 and ii. 48."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "255",
    "NoteID": "296",
    "Body": "This is the Ayat-ul-Kursi the \"Verse of the Throne\".  Who\\n\\t\\t\\t\\tcan translate its glorious meaning, or reproduce the\\n\\t\\t\\t\\trhythm of its well-chosen and comprehensive words.  Even\\n\\t\\t\\t\\tin the original Arabic the meaning seems to be greater\\n\\t\\t\\t\\tthan can be expressed in words."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "255",
    "NoteID": "297",
    "Body": "After we realise that His life is absolute Life.  His\\n\\t\\t\\t\\tBeing is absolute Being, while others are contingent and\\n\\t\\t\\t\\tevanescent, our ideas of heaven and earth vanish like\\n\\t\\t\\t\\tshadows.  What is behind that shadow is He.  Such reality\\n\\t\\t\\t\\tas our heavens and our earth possess is a reflection of\\n\\t\\t\\t\\tHis absolute Reality.  The pantheist places the wrong\\n\\t\\t\\t\\taccent when he says that everything is He.  The truth is\\n\\t\\t\\t\\tbetter expressed when we say that everything is His.  How\\n\\t\\t\\t\\tthen can any creatures stand before Him as of right, and\\n\\t\\t\\t\\tclaim to intercede for a fellow-creature?  In the first\\n\\t\\t\\t\\tplace both are His, and He cares as much for one as for\\n\\t\\t\\t\\tthe other.  In the second place, they are both dependent\\n\\t\\t\\t\\ton His will and command.  But He in His Wisdom and Plan\\n\\t\\t\\t\\tmay grade his creatures and give one superiority over\\n\\t\\t\\t\\tanother. Then by His will and permission such a one may\\n\\t\\t\\t\\tintercede or help according to the laws and duties laid\\n\\t\\t\\t\\ton him.  God's knowledge is absolute, and is not\\n\\t\\t\\t\\tconditioned by Time or Space.  To us, His creatures,\\n\\t\\t\\t\\tthese conditions always apply.\\tHis knowledge and our\\n\\t\\t\\t\\tknowledge are therefore in different categories, and our\\n\\t\\t\\t\\tknowledge only gets some reflection of Reality when it\\n\\t\\t\\t\\taccords with His Will and Plan."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "255",
    "NoteID": "298",
    "Body": "Throne; seat, power, knowledge, symbol of authority.  In\\n\\t\\t\\t\\tour thoughts we exhaust everything when we say \"the\\n\\t\\t\\t\\theavens and the earth\".  Well, then in everything is the\\n\\t\\t\\t\\tworking of God's power, and will, and authority. \\n\\t\\t\\t\\tEverything of course includes spiritual things as well as\\n\\t\\t\\t\\tthings of sense. Cf. Wordsworth's fine outburst in\\n\\t\\t\\t\\t\"Tintern Abbey\": \"Whose dwelling is the light of setting\\n\\t\\t\\t\\tsuns, And the round ocean and the living air, And in the\\n\\t\\t\\t\\tblue sky, and in the mind of man: A motion and a spirit\\n\\t\\t\\t\\tthat impels alll thinking things, all objects of all\\n\\t\\t\\t\\tthought, And rolls through all things.\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "256",
    "NoteID": "300",
    "Body": "Compulsion is incompatible with religion; because 1)\\n\\t\\t\\t\\treligion depends upon faith and will, and these would be\\n\\t\\t\\t\\tmeaningless if induced by force; 2) Truth and Error have\\n\\t\\t\\t\\tbeen so clearly shown up by the mercy of God that there\\n\\t\\t\\t\\tshould be no doubt in the minds of any persons of\\n\\t\\t\\t\\tgoodwill as to the fundamentals of faith; 3) God's\\n\\t\\t\\t\\tprotection is continuous and His Plan is always to lead\\n\\t\\t\\t\\tus from the depths of darkness into the clearest light."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "256",
    "NoteID": "301",
    "Body": "Hand-hold: something which the hands can grasp for safety\\n\\t\\t\\t\\tin a moment of danger. It may be a loop or a handle, or\\n\\t\\t\\t\\tanchor.  If it is without flaw, so that there is no\\n\\t\\t\\t\\tdanger of breaking, our safety is absolutely assured so\\n\\t\\t\\t\\tlong as we hold fast to it.  Our safety then depends on\\n\\t\\t\\t\\tour own will and faith; God's help and protection will\\n\\t\\t\\t\\talways be unfailing if we hold firmly to God and trust in\\n\\t\\t\\t\\tHim."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "258",
    "NoteID": "302",
    "Body": "The three verses 258-260 have been the subject of much\\n\\t\\t\\t\\tcontroversy as to the exact meaning to be attached to the\\n\\t\\t\\t\\tincidents and the precise persons alluded to, whose names\\n\\t\\t\\t\\tare not mentioned.  M.M.A's learned notes give some\\n\\t\\t\\t\\tindication of the points at issue.  In such matters,\\n\\t\\t\\t\\twhere the Qur-an has given no names and the Holy Apostle\\n\\t\\t\\t\\thas himself given no indication, it seems to me useless\\n\\t\\t\\t\\tto speculate, and still worse to put forward positive\\n\\t\\t\\t\\topinions.  In questions of learning, speculations are\\n\\t\\t\\t\\toften interesting.  But it seems to me that the meaning\\n\\t\\t\\t\\tof the Qur-an is so wide and universal that we are in\\n\\t\\t\\t\\tdanger of missing the real and eternal meaning if we go\\n\\t\\t\\t\\ton disputing about minor points.  All three incidents are\\n\\t\\t\\t\\tsuch as may happen again and again in any prophet's\\n\\t\\t\\t\\tlifetime, and be seen in impersonal vision at any time. \\n\\t\\t\\t\\tHere they are connected with Mustafa's vision as shown by\\n\\t\\t\\t\\tthe opening words of verse 258."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "258",
    "NoteID": "303",
    "Body": "The first point illustrated is the pride of power, and\\n\\t\\t\\t\\tthe impotence of human power as against God's power.  The\\n\\t\\t\\t\\tperson who disputed with Abraham may have been Nimrod or\\n\\t\\t\\t\\tsome ruler in Babylonia, or indeed elsewhere.  I name\\n\\t\\t\\t\\tBabylonia as it was the original home of Abraham (Ur of\\n\\t\\t\\t\\tthe Chaldees), and Babylon prided herself on her arts and\\n\\t\\t\\t\\tsciences in the ancient world.\\tScience can do many\\n\\t\\t\\t\\twonderful things; it could then; it can now.  But the\\n\\t\\t\\t\\tmystery of Life baffled science then, as it continues to\\n\\t\\t\\t\\tbaffle science now, after many centuries of progress. \\n\\t\\t\\t\\tAbraham had faith and referred back everything to the\\n\\t\\t\\t\\ttrue Cause of Causes.  A sceptical ruler might jestingly\\n\\t\\t\\t\\tsay: \"I have the power of life and death\".  A man of\\n\\t\\t\\t\\tscience might say: \"We have investigated the laws of life\\n\\t\\t\\t\\tand death.\"  Different kinds of powers lie in the hands\\n\\t\\t\\t\\tof kings and men of knowledge.\\tThe claim in both cases\\n\\t\\t\\t\\tis true in a very limited sense.  But Abraham confounded\\n\\t\\t\\t\\tthe claimer by going back to fundamentals.  \"If you had\\n\\t\\t\\t\\tthe ultimate power, why could you not make the sun rise\\n\\t\\t\\t\\tfrom the West?\""
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "259",
    "NoteID": "304",
    "Body": "This incident is referred variously (1) to Ezekiel's\\n\\t\\t\\t\\tvision of dry bones (Ezekiel, xxxvii. 1-10, (2) to\\n\\t\\t\\t\\tNehemiah's visit to Jerusalem in ruins after the\\n\\t\\t\\t\\tCaptivity, and to its re-building (Hehemiah, i. 12-20): \\n\\t\\t\\t\\tand (3) to Uzair, or Ezra, or Esdras, the scribe, priest,\\n\\t\\t\\t\\tand reformer, who was sent by the Persian King after the\\n\\t\\t\\t\\tCaptivity to Jerusalem, and about whom there are many\\n\\t\\t\\t\\tJewish legends.  As to (1), there are only four words in\\n\\t\\t\\t\\tthis verse about bones.  As to (2) and (3), there is\\n\\t\\t\\t\\tnothing specific to connect this verse with either.  The\\n\\t\\t\\t\\twording is perfectly general, and we must understand it\\n\\t\\t\\t\\tas general.  I think it does refer not only to\\n\\t\\t\\t\\tindividual, but to national, death, and resurrection."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "259",
    "NoteID": "305",
    "Body": "A man is in despair when he sees the destruction of a\\n\\t\\t\\t\\twhole people, city, or civilization.  But God can cause\\n\\t\\t\\t\\tresurrection, as He has done many times in history, and\\n\\t\\t\\t\\tas He will do at the final Resurrection.  Time is nothing\\n\\t\\t\\t\\tbefore God.  The doubter thinks that he has been dead or\\n\\t\\t\\t\\t\"tarried thus\" a day or less when the period has been a\\n\\t\\t\\t\\tcentury.  On the other hand, the food and drink which he\\n\\t\\t\\t\\tleft behind is intact, and as fresh as it was when he\\n\\t\\t\\t\\tleft it.  But the donkey is not only dead, but nothing\\n\\t\\t\\t\\tbut bones is left of it.  And before the man's eyes, the\\n\\t\\t\\t\\tbones are reunited, clothed with flesh and blood, and\\n\\t\\t\\t\\trestored to life.  Moral:  (1) Time is nothing to God;\\n\\t\\t\\t\\t(2) It affects different things in different ways; (3)\\n\\t\\t\\t\\tThe keys of life and death are in God's hands; (4) Man's\\n\\t\\t\\t\\tpower is nothing; his faith should be in God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "260",
    "NoteID": "306",
    "Body": "Verse 258, we saw, illustrated by God's power over Life\\n\\t\\t\\t\\tand Death, contrasted with man's vain boasts or\\n\\t\\t\\t\\timaginings.  Verse 259 illustrated how Time is immaterial\\n\\t\\t\\t\\tto God's working; things, individuals and nations are\\n\\t\\t\\t\\tsubject to laws of life and death, which are under God's\\n\\t\\t\\t\\tcomplete control, however much we may be misled by\\n\\t\\t\\t\\tappearances.  Now in Verse 200 we are shown the power of\\n\\t\\t\\t\\twisdom and love:  if man can tame birds so that they know\\n\\t\\t\\t\\thim and fly to him, how much more will God's creatures\\n\\t\\t\\t\\tobey His call at the Resurrection?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "260",
    "NoteID": "307",
    "Body": "Abraham had complete faith in God's power, but he wanted,\\n\\t\\t\\t\\twith God's permission, to give an explanation of that\\n\\t\\t\\t\\tfaith to his own heart and mind.  Where I have translated\\n\\t\\t\\t\\t\"satisfy my own understanding\", the literal translation\\n\\t\\t\\t\\twould be \"satisfy my own heart\"."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "260",
    "NoteID": "308",
    "Body": "A portion of them:  Juz-an.  The received Commentators\\n\\t\\t\\t\\tunderstand this to mean that the birds were to be cut up\\n\\t\\t\\t\\tand pieces of them were to be put on the hills. The\\n\\t\\t\\t\\tcutting up or killing is not mentioned, but they say that\\n\\t\\t\\t\\tit is implied by an ellipsis, as the question is how God\\n\\t\\t\\t\\tgives life to the dead.  Of the modern Muslim\\n\\t\\t\\t\\tCommentators, M.P. is non-committal, but H.G.S. and\\n\\t\\t\\t\\tM.M.A. understand that the birds were not killed, but\\n\\t\\t\\t\\tthat a \"portion\" here means a unit, single birds were\\n\\t\\t\\t\\tplaced on the hills, and they flew to the one who tamed\\n\\t\\t\\t\\tthem.  This last view commends itself to me, as the\\n\\t\\t\\t\\tcutting up of the birds to pieces is nowhere mentioned,\\n\\t\\t\\t\\tunless we understand the word for \"Taming\" in an unusual\\n\\t\\t\\t\\tand almost impossible sense."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "263",
    "NoteID": "309",
    "Body": "A very high standard is set for charity.  (1) It must be\\n\\t\\t\\t\\tin the way of God.  (2) It must expect no reward in this\\n\\t\\t\\t\\tworld.\\t(3) It must not be followed by references or\\n\\t\\t\\t\\treminders to the act of charity.  (4) Still less should\\n\\t\\t\\t\\tany annoyance or injury be caused to the recipient; e.g.\\n\\t\\t\\t\\tby boasting that the giver relieved the person in the\\n\\t\\t\\t\\thour of need.  Indeed, the kindness and the spirit which\\n\\t\\t\\t\\tturns a blind eye to other people's faults or\\n\\t\\t\\t\\tshort-comings is the essence of charity:  these things\\n\\t\\t\\t\\tare better than charity if charity is spoilt by tricks\\n\\t\\t\\t\\tthat do harm.  At the same time, while no reward is to be\\n\\t\\t\\t\\texpected, there is abundant reward from God - material,\\n\\t\\t\\t\\tmoral, and spiritual - according to His own good pleasure\\n\\t\\t\\t\\tand plan.  If we spend in the way of God, it is not as if\\n\\t\\t\\t\\tGod was in need of our charity.  On the contrary our\\n\\t\\t\\t\\tshort-comings are so great that we require His utmost\\n\\t\\t\\t\\tforbearance before any good that we can do can merit His\\n\\t\\t\\t\\tpraise or reward.  Our motives are so mixed that our best\\n\\t\\t\\t\\tmay really be very poor if judged by a very strict\\n\\t\\t\\t\\tstandard."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "264",
    "NoteID": "310",
    "Body": "False charity, \"to be seen of men\", is really no charity.\\n\\t\\t\\t\\t It is worse, for it betokens a disbelief in God and the\\n\\t\\t\\t\\tHereafter.  \"God seeth well whatever ye do\" (ii. 265). \\n\\t\\t\\t\\tIt is compared to a hard barren rock on which by chance\\n\\t\\t\\t\\thas fallen a little soil.  Good rain, which renders\\n\\t\\t\\t\\tfertile soil more fruitful, washes away the little soil\\n\\t\\t\\t\\twhich this rock had, and exposes its nakedness.  What\\n\\t\\t\\t\\tgood can hypocrites derive even from the little wealth\\n\\t\\t\\t\\tthey may have amassed?"
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "265",
    "NoteID": "311",
    "Body": "True charity is like a field with good soil on a high\\n\\t\\t\\t\\tsituation.  It catches good showers of rain, the moisture\\n\\t\\t\\t\\tpenetrates the soil, and yet its elevated situation keeps\\n\\t\\t\\t\\tit well-drained, and healthy favorable conditions\\n\\t\\t\\t\\tincrease its output enormously.  But supposing even that\\n\\t\\t\\t\\tthe rain is not abundant, it catches dew and makes the\\n\\t\\t\\t\\tmost of any little moisture it can get, and that is\\n\\t\\t\\t\\tsufficient for it.  So a man of true charity is\\n\\t\\t\\t\\tspiritually helathy; he is best suited to attract the\\n\\t\\t\\t\\tbounties of God, which he does not hoard selfishly but\\n\\t\\t\\t\\tcirculates freely.  In lean times he still produces good\\n\\t\\t\\t\\tworks, and is content with what he has.  He looks to\\n\\t\\t\\t\\tGod's pleasure and the strengthening of his own soul."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "266",
    "NoteID": "312",
    "Body": "The truly spiritual nature of charity having been\\n\\t\\t\\t\\texplained in three parables (ii. 261, 264, 265) a fourth\\n\\t\\t\\t\\tparable is now added, explaining its bearing on the whole\\n\\t\\t\\t\\tof our life.  Suppose we had a beautiful garden\\n\\t\\t\\t\\twell-watered and fertile, with delightful views of\\n\\t\\t\\t\\tstreams, and a haven of rest for mind and body; suppose\\n\\t\\t\\t\\told age were creeping in on us, and our children were\\n\\t\\t\\t\\teither too young to look after themselves or too feeble\\n\\t\\t\\t\\tin health; how should we feel if a sudden whirlwind came\\n\\t\\t\\t\\twith lightning or fire in its train, and burnt it up;\\n\\t\\t\\t\\tthus blasting whe whole of our hopes for the present and\\n\\t\\t\\t\\tfor the future, and destroying the result of all our\\n\\t\\t\\t\\tlabor and savings in the past?\\tWell, this life of ours\\n\\t\\t\\t\\tis a probation.  We may work hard, we may save, we may\\n\\t\\t\\t\\thave good luck. We may make ourselves a goodly pleasance,\\n\\t\\t\\t\\tand have ample means of support for ourselves and our\\n\\t\\t\\t\\tchildren.  A great whirlwind charged with lightning and\\n\\t\\t\\t\\tfire comes and burns up the whole show.  We are too old\\n\\t\\t\\t\\tto begin again:  our children are too young or feeble to\\n\\t\\t\\t\\thelp us to repair the mischief.  Our chance is lost,\\n\\t\\t\\t\\tbecause we did not provide against such a contingency. \\n\\t\\t\\t\\tThe whirlwind is the \"wrath to come\";  the provision\\n\\t\\t\\t\\tagainst it is a life of true charity and righteousness,\\n\\t\\t\\t\\twhich is the only source of true and lasting happiness in\\n\\t\\t\\t\\tthis world and the next.  Without it we are subject to\\n\\t\\t\\t\\tall the vicissitudes of this uncertain life.  We may even\\n\\t\\t\\t\\tspoil our so-called \"charity\" by insisting on the\\n\\t\\t\\t\\tobligation which others owe to us or by doing some harm,\\n\\t\\t\\t\\tbecause our motives are not pure."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "266",
    "NoteID": "313",
    "Body": "Not strong (enough):  dhu'afa-u:  literally weak,\\n\\t\\t\\t\\tdecrepit, infirm, possibly referring to both health and\\n\\t\\t\\t\\twill or character."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "267",
    "NoteID": "314",
    "Body": "According to the English proverb \"Charity covers a\\n\\t\\t\\t\\tmultitude of sins\".  Such a sentiment is strongly\\n\\t\\t\\t\\tdisapproved in Islam.  Charity has value only if (1)\\n\\t\\t\\t\\tsomething good and valuable is given, (2) which has been\\n\\t\\t\\t\\thonorably earned or acquired by the giver, or (3) which\\n\\t\\t\\t\\tis produced in nature and can be referred to as a bounty\\n\\t\\t\\t\\tof God.  (1) May include such things as are of use and\\n\\t\\t\\t\\tvalue to others though they may be of less use to us or\\n\\t\\t\\t\\tsuperfluous to us on account of our having acquired\\n\\t\\t\\t\\tsomething more suitable for our station in life; for\\n\\t\\t\\t\\texample, discarded clothes, or an old horse or a used\\n\\t\\t\\t\\tmotor car; but if the horse is vicious, or the car engine\\n\\t\\t\\t\\tso far gone that it is dangerous to use, then the gift is\\n\\t\\t\\t\\tworse than useless; it is positively harmful and the\\n\\t\\t\\t\\tgiver is a wrong-doer.\\t(2) Applies to fraudulent\\n\\t\\t\\t\\tcompany-promoters, who earn great credit by giving away\\n\\t\\t\\t\\tcharity in some of their ill-gotten gains, or to robbers\\n\\t\\t\\t\\t(even if they call themselves by high-sounding names) who\\n\\t\\t\\t\\t\"rob peter to pay Paul\".  Islam will have nothing to do\\n\\t\\t\\t\\twith tainted property.\\tIts economic code requires that\\n\\t\\t\\t\\tevery gain should be honest and honorable.  Even\\n\\t\\t\\t\\t\"charity\" would not cover or destroy the taint.  (3) Lays\\n\\t\\t\\t\\tdown a test in cases of a doubtful gain.  Can we refer to\\n\\t\\t\\t\\tit as a gift of God?  Obviously the produce of honest\\n\\t\\t\\t\\tlabour or agriculture can be so referred to.  In modern\\n\\t\\t\\t\\tcommerce and speculation there is much of quite the\\n\\t\\t\\t\\tcontrary character, and charity will not cover the taint.\\n\\t\\t\\t\\tSome kind of art, skill, or talent are God-given:  it is\\n\\t\\t\\t\\tthe highest kind of charity to teach them or share their\\n\\t\\t\\t\\tproduct.  Others are the contrary:  they are bad or\\n\\t\\t\\t\\ttainted.  In the same way some professions or services\\n\\t\\t\\t\\tmay be tainted, if these tend to do moral harm."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "267",
    "NoteID": "315",
    "Body": "The preceding note tries to indicate some of the things\\n\\t\\t\\t\\twhich are bad or tainted.  We should not even think of\\n\\t\\t\\t\\tacquiring them for ourselves, soothing our conscience by\\n\\t\\t\\t\\tthe salve that we shall practice charity out of them."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "267",
    "NoteID": "316",
    "Body": "Closed eyes imply disgust or connivance because of some\\n\\t\\t\\t\\tfeature which we would not openly acknowledge."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "267",
    "NoteID": "317",
    "Body": "To dedicate tainted things to God is a dishonor to God,\\n\\t\\t\\t\\tWho is independent of all wants, and Who is worthy of all\\n\\t\\t\\t\\thonor and praise."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "268",
    "NoteID": "318",
    "Body": "Good and evil draw us opposite ways and by opposite\\n\\t\\t\\t\\tmotives, and the contrast is well marked out in charity. \\n\\t\\t\\t\\tWhen we think of doing some real act of  kindness or\\n\\t\\t\\t\\tcharity, we are assailed with doubts and fear of\\n\\t\\t\\t\\timpoverishment; but Evil supports any tendency to\\n\\t\\t\\t\\tselfishness, greed, or even to extravagant expenditure\\n\\t\\t\\t\\tfor show, or self-indulgence, or unseemly appetites.  On\\n\\t\\t\\t\\tthe other hand, God draws us on to all that is kind and\\n\\t\\t\\t\\tgood, for that way lies the forgiveness of our sins, and\\n\\t\\t\\t\\tgreater real prosperity and satisfaction.  No kind or\\n\\t\\t\\t\\tgenerous act ever ruined anyone.  It is false generosity\\n\\t\\t\\t\\tthat is sometimes shown as leading to ruin.  As God knows\\n\\t\\t\\t\\tall our motives and cares for all, and has everything in\\n\\t\\t\\t\\tHis power, it is obvious which course a wise man will\\n\\t\\t\\t\\tchoose.  But wisdom is rare, and it is only wisdom that\\n\\t\\t\\t\\tcan appreciate true well-being and distinguish it from\\n\\t\\t\\t\\tthe false appearance of well-being."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "271",
    "NoteID": "319",
    "Body": "It is better to seek no publicity in charity.  But if it\\n\\t\\t\\t\\tis known there is no harm.  If it is for public purposes,\\n\\t\\t\\t\\tit must necessarily be known, and a pedantic show of\\n\\t\\t\\t\\tconcealment may itself be a fault.  The harm of publicity\\n\\t\\t\\t\\tlies in motives of ostentation.  We can better reach the\\n\\t\\t\\t\\treally deserving poor by quietly seeking for them.  The\\n\\t\\t\\t\\tspiritual benefit enures to our own souls, provided our\\n\\t\\t\\t\\tmotives are pure, and we are really seeking the good\\n\\t\\t\\t\\tpleasure of God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "272",
    "NoteID": "320",
    "Body": "In connection with charity this means that we must\\n\\t\\t\\t\\trelieve those really in need, whether they are good or\\n\\t\\t\\t\\tbad, on the right path or not, Muslims or otherwise. It\\n\\t\\t\\t\\tis not for us to judge in these matters.  God will give\\n\\t\\t\\t\\tlight according to His wisdom.\\tIncidentally it adds a\\n\\t\\t\\t\\tfurther meaning to the command, \"Let there be no\\n\\t\\t\\t\\tcompulsion in religion\" (ii 256).  For compulsion may not\\n\\t\\t\\t\\tonly be by force, but by economic necessity.  In matters\\n\\t\\t\\t\\tof religion we must not even compel by a bribe of\\n\\t\\t\\t\\tcharity.  The chief motive in charity should be God's\\n\\t\\t\\t\\tpleasure and our own spiritual good.  This was addressed\\n\\t\\t\\t\\tin the first instance to Mustafa in Medina, but it is of\\n\\t\\t\\t\\tuniversal application."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "272",
    "NoteID": "321",
    "Body": "See note to ii 112.  Wajh means literally: face,\\n\\t\\t\\t\\tcountenance; hence, favour, glory, Self, Presence."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "273",
    "NoteID": "322",
    "Body": "Indiscriminate acts of so-called charity are condemned as\\n\\t\\t\\t\\tthey may do more harm than good (see ii 262).  The real\\n\\t\\t\\t\\tbeneficiaries of charity are here indicated. They must be\\n\\t\\t\\t\\tin want.  And the want must be due to some honorable\\n\\t\\t\\t\\tcause.\\tFor example, they may be doing some unpaid\\n\\t\\t\\t\\tservice, such as teaching, or acquiring knowledge or\\n\\t\\t\\t\\tskill, or be in exile for their faith, or in other ways\\n\\t\\t\\t\\tbe prevented from seeking employment or doing strenuous\\n\\t\\t\\t\\twork.  \"God's cause\" must not be narrowly interpreted. \\n\\t\\t\\t\\tAll sincere and real service to humanity comes within the\\n\\t\\t\\t\\tdefinition.  Such men do not beg from door to door.  It\\n\\t\\t\\t\\tis the duty of those who are well-to-do, or of the Public\\n\\t\\t\\t\\tPurse, to find them out."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "274",
    "NoteID": "323",
    "Body": "We recapitulate the beauty of charity (i.e. unselfish\\n\\t\\t\\t\\tgiving of one's self or one's goods) before we come to\\n\\t\\t\\t\\tits opposite, i.e. the selfish grasping greed of usury\\n\\t\\t\\t\\tagainst those in need or distress.  Charity instead of\\n\\t\\t\\t\\timpoverishing you will enrich you; you will have more\\n\\t\\t\\t\\thappiness and less fear.  Contrast it with what follows,\\n\\t\\t\\t\\t- the degredation of the grasping usurer."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "275",
    "NoteID": "324",
    "Body": "Usury is condemned and prohibited in the strongest\\n\\t\\t\\t\\tpossible terms.  There can be no question about the\\n\\t\\t\\t\\tprohibition.  When we come to the definition of Usury\\n\\t\\t\\t\\tthere is room for difference of opinion.  Hadhrat 'Umar,\\n\\t\\t\\t\\taccording to Ibn Kathir, felt some difficulty in the\\n\\t\\t\\t\\tmatter, as the Apostle left this world before the details\\n\\t\\t\\t\\tof the question were settled.  This was one of the three\\n\\t\\t\\t\\tquestions on which he wished he had more light from the\\n\\t\\t\\t\\tProphet.  Our 'Ulama, ancient and modern, have worked out\\n\\t\\t\\t\\ta great body of literature on Usury, based mainly on\\n\\t\\t\\t\\teconomic conditions as they existed at the rise of Islam."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "275",
    "NoteID": "325",
    "Body": "An apt simile:\\twhereas legitimate trade or industry\\n\\t\\t\\t\\tincreases the prosperity and stability of men and\\n\\t\\t\\t\\tnations, a dependence on Usury would merely encourage a\\n\\t\\t\\t\\trace of idlers, cruel blood-suckers, and worthless\\n\\t\\t\\t\\tfellows who do not know their own good and are therefore\\n\\t\\t\\t\\takin to madmen."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "275",
    "NoteID": "326",
    "Body": "Owing to the fact that interest occupies a central\\n\\t\\t\\t\\tposition in modern economic life, and specially since\\n\\t\\t\\t\\tinterest is the very life blood of the existing financial\\n\\t\\t\\t\\tinstitutions, a number of Muslims have been inclined to\\n\\t\\t\\t\\tinterpret it in a manner which is radically different\\n\\t\\t\\t\\tfrom the understanding of Muslim scholars throughout the\\n\\t\\t\\t\\tlast fourteen centuries and is also sharply in conflict\\n\\t\\t\\t\\twith the categorical statements of the Prophet (peace be\\n\\t\\t\\t\\ton him). According to Islamic teachings any excess on the\\n\\t\\t\\t\\tcapital is riba (interest). Islam accepts no distinction,\\n\\t\\t\\t\\tin so far as prohibition is concerned, between reasonable\\n\\t\\t\\t\\tand exorbitant rates of interest, and thus what came to\\n\\t\\t\\t\\tbe regarded as the difference between usury and interest;\\n\\t\\t\\t\\tnor between returns on bonus for consumption and those\\n\\t\\t\\t\\tfor production purposes and so on."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "277",
    "NoteID": "327",
    "Body": "The contrast between charity and unlawful grasping of\\n\\t\\t\\t\\twealth began at ii. 274, where this phrase occurs as a\\n\\t\\t\\t\\ttheme.\\tHere the theme finishes with the same phrase. \\n\\t\\t\\t\\tThe following four verses refer to further concessions on\\n\\t\\t\\t\\tbehalf of debtors, as creditors are asked to (a) give up\\n\\t\\t\\t\\teven claims arising out of the past on account of usury,\\n\\t\\t\\t\\tand (b) give time for payment of capital if necessary, or\\n\\t\\t\\t\\t(c) to write off the debt altogether as an act of\\n\\t\\t\\t\\tcharity."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "279",
    "NoteID": "328",
    "Body": "This is not war for opinions, but an ultimatum of war for\\n\\t\\t\\t\\tthe liberation of debtors unjustly dealt with and\\n\\t\\t\\t\\toppressed."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "329",
    "Body": "The first part of the verse deals with transactions\\n\\t\\t\\t\\tinvolving future payment or future consideration, and the\\n\\t\\t\\t\\tsecond part with transactions in which payment and\\n\\t\\t\\t\\tdelivery are made on the spot.\\tExamples of the former\\n\\t\\t\\t\\tare if goods are bought now and payment is promised at a\\n\\t\\t\\t\\tfixed time and place in the future, or if cash is paid\\n\\t\\t\\t\\tnow and delivery is contracted for at a fixed time and\\n\\t\\t\\t\\tplace in the future.  In such cases a written document is\\n\\t\\t\\t\\trecommended, but it is held that the words later on in\\n\\t\\t\\t\\tthis verse, that it is \"juster . . . more suitable as\\n\\t\\t\\t\\tevidence, and more convenient to prevent doubts\", etc.\\n\\t\\t\\t\\timply that it is not obligatory in law.  Examples of the\\n\\t\\t\\t\\tlatter kind - cash payment and delivery on the spot -\\n\\t\\t\\t\\trequire no evidence in writing, but apparently oral\\n\\t\\t\\t\\twitnesses to such transactions are recommended."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "330",
    "Body": "The scribe in such matters assumes a fiduciary capacity: \\n\\t\\t\\t\\the should therefore remember to act as in the presence of\\n\\t\\t\\t\\tGod, with full justice to both parties. The art of\\n\\t\\t\\t\\twriting he should look upon as a gift from God, and he\\n\\t\\t\\t\\tshould use it as in His service.  In an illiterate\\n\\t\\t\\t\\tpopulation the scribe's position is still more\\n\\t\\t\\t\\tresponsible."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "331",
    "Body": "Possibly the person \"mentally deficient, or weak, or\\n\\t\\t\\t\\tunable to dictate\", may also be incapable of making a\\n\\t\\t\\t\\tvalid contract, and the whole duty would be on his\\n\\t\\t\\t\\tguardian, who again must act in perfect good faith, not\\n\\t\\t\\t\\tonly protecting but vigilantly promoting  the interests\\n\\t\\t\\t\\tof his ward."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "332",
    "Body": "It is desirable that the men (or women) who are chosen as\\n\\t\\t\\t\\twitness should be from the circle to which the parties\\n\\t\\t\\t\\tbelong, as they would best be able to understand the\\n\\t\\t\\t\\ttransaction, and be most easily available if their\\n\\t\\t\\t\\tevidence is required in future."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "282",
    "NoteID": "333",
    "Body": "Commercial morality is here taught on the highest plane\\n\\t\\t\\t\\tand yet in the most practical manner, both as regards the\\n\\t\\t\\t\\tbargains to be made, the evidence to be provided, the\\n\\t\\t\\t\\tdoubts to be avoided, and the duties and rights of\\n\\t\\t\\t\\tscribes and witnesses.\\tProbity even in worldly matters\\n\\t\\t\\t\\tis to be, not a mere matter of convenience or policy, but\\n\\t\\t\\t\\ta matter of conscience and religious duty.  Even our\\n\\t\\t\\t\\tevery-day transactions are to be carried out as in the\\n\\t\\t\\t\\tpresence of God."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "283",
    "NoteID": "334",
    "Body": "A pledge or security stands on its own independent\\n\\t\\t\\t\\tfooting, though it is a very convenient form of closing\\n\\t\\t\\t\\tthe bargain where the parties cannot trust each other,\\n\\t\\t\\t\\tand cannot get a written agreement with proper witnesses."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "283",
    "NoteID": "335",
    "Body": "The law of Deposit implies great trust in the Depositary\\n\\t\\t\\t\\ton the part of the Depositor.  The Depositary becomes a\\n\\t\\t\\t\\ttrustee, and the doctrine of Trust can be further\\n\\t\\t\\t\\tdeveloped on that basis.  The trustee's duty is to guard\\n\\t\\t\\t\\tthe interests of the person on whose behalf he holds the\\n\\t\\t\\t\\ttrust and to render back the property and accounts when\\n\\t\\t\\t\\trequired according to the terms of the trust.  This duty\\n\\t\\t\\t\\tagain is linked to the sanction of Religion, which\\n\\t\\t\\t\\trequires a higher standard than Law."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "283",
    "NoteID": "336",
    "Body": "It sometimes happens that if some inconvenient piece of\\n\\t\\t\\t\\tevidence is destroyed or concealed, we gain a great\\n\\t\\t\\t\\tadvantage materially.  We are warned not to yield to such\\n\\t\\t\\t\\ta temptation.  The concealment of evidence has a serious\\n\\t\\t\\t\\teffect on our own moral and spiritual life, for it taints\\n\\t\\t\\t\\tthe very source of higher life, as typified by the heart.\\n\\t\\t\\t\\t The heart is also the seat of our secrets.  We are told\\n\\t\\t\\t\\tthat the sin will reach our most secret being, though the\\n\\t\\t\\t\\tsin may not be visible or open to the world.  Further,\\n\\t\\t\\t\\tthe heart is in the seat of our affections, and false\\n\\t\\t\\t\\tdealing taints all our affections."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "285",
    "NoteID": "337",
    "Body": "This Sura started with the question of Faith (ii 3-4),\\n\\t\\t\\t\\tshowed us various aspects of Faith and the denial of\\n\\t\\t\\t\\tFaith, gave us ordinances for the new People of Islam as\\n\\t\\t\\t\\ta community, and now rounds off the argument again with a\\n\\t\\t\\t\\tconfession of Faith and of its practical manifestation in\\n\\t\\t\\t\\tconduct (\"we hear and we obey\"), and closes on a note of\\n\\t\\t\\t\\thumility, so that we may confess our sins, ask for\\n\\t\\t\\t\\tforgiveness, and pray for God's help and guidance."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "285",
    "NoteID": "338",
    "Body": "Cf ii 136 and ii 253, n. 289.  It is not for us to make\\n\\t\\t\\t\\tany distinction between one and another of God's\\n\\t\\t\\t\\tapostles:  we must honor them all equally, though we know\\n\\t\\t\\t\\tthat God in His wisdom sent them with different kinds of\\n\\t\\t\\t\\tmission and gave them different degrees of rank."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "285",
    "NoteID": "339",
    "Body": "When our faith and conduct are sincere, we realize how\\n\\t\\t\\t\\tfar from perfection we are, and we humbly pray to God for\\n\\t\\t\\t\\tthe forgiveness of our sins.  We feel that God imposes no\\n\\t\\t\\t\\tburden on us that we cannot bear, and with this\\n\\t\\t\\t\\trealization in our hearts and in the confession of our\\n\\t\\t\\t\\tlips, we go to Him and ask for His help and guidance."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "286",
    "NoteID": "340",
    "Body": "Cf. ii. 233.  In that verse the burden was in terms of\\n\\t\\t\\t\\tmaterial wealth:  here it is in terms of spiritual duty. \\n\\t\\t\\t\\tAssured by God that He will accept from each soul just\\n\\t\\t\\t\\tsuch duty as it has the ability to offer, we pray further\\n\\t\\t\\t\\ton for the fulfilment of that promise."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "286",
    "NoteID": "341",
    "Body": "We must not be arrogant, and think that because God has\\n\\t\\t\\t\\tgranted us His favor and mercy we have no need to exert\\n\\t\\t\\t\\tourselves, or that we are ourselves superior to those\\n\\t\\t\\t\\tbefore us.  On the contrary, knowing how much they\\n\\t\\t\\t\\tfailed, we pray that our burdens should be lightened, and\\n\\t\\t\\t\\twe confess our realization that we have all the greater\\n\\t\\t\\t\\tneed for God's mercy and forgiveness.  And so we end the\\n\\t\\t\\t\\twhole argument of the Sura with a prayer for God's help,\\n\\t\\t\\t\\tnot in our own selfish ends, but in our resolve to uphold\\n\\t\\t\\t\\tGod's truth against all Unbelief."
  },
  {
    "SurahNumber": "2",
    "AyahNumber": "286",
    "NoteID": "342",
    "Body": "See note to ii. 1."
  }
]
