[
  {
    "SurahNumber": "40",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "5",
    "NoteID": "2",
    "Body": "Cf. {38:12-14}, where some of those who were \"leagued\\n\\t\\t\\t\\ttogether\" (al-ahzab) are enumerated; also verses {30} ff.\\n\\t\\t\\t\\tof this surah."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "Lit., \"each community schemed against their apostle\"."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "7",
    "NoteID": "4",
    "Body": "Lit, \"around it\": cf. Zamakhshari's explanation of the\\n\\t\\t\\t\\texpression hawlaha occurring in  27:8  in the sense of\\n\\t\\t\\t\\t\"near it\". In his commentary on the verse which we are\\n\\t\\t\\t\\tnow considering, Baydawi states explicitly that the\\n\\t\\t\\t\\t\"bearing\" of God's throne of almightiness (al-'arsh - see\\n\\t\\t\\t\\tnote [43] on  7:54 ) must be understood in a metaphorical\\n\\t\\t\\t\\tsense: \"Their carrying it and surrounding it [or \"being\\n\\t\\t\\t\\tnear it\"] is a metaphor of their being mindful of it and\\n\\t\\t\\t\\tacting in accordance therewith (majaz 'an hifzihim\\n\\t\\t\\t\\twa-tadbirihim lahu), or a metonym (kinayah) for their\\n\\t\\t\\t\\tcloseness to the Lord of the Throne, their dignity in His\\n\\t\\t\\t\\tsight, and their being instrumental in the realization of\\n\\t\\t\\t\\tHis will.\" My rendering of the above verse reflects\\n\\t\\t\\t\\tBaydawi's interpretation. - As regards the beings which\\n\\t\\t\\t\\tare said to be close to the throne of God's almightiness,\\n\\t\\t\\t\\tmost of the classical commentators obviously basing their\\n\\t\\t\\t\\tview on the symbolic image of \"the angels surrounding the\\n\\t\\t\\t\\tthrone of [God's] almightiness\" on the Day of Judgment\\n\\t\\t\\t\\t( 39:75 ) - think in this instance, too, exclusively of\\n\\t\\t\\t\\tangels. But whereas it cannot be denied that the present\\n\\t\\t\\t\\tverse refers also to angels, it does not follow that it\\n\\t\\t\\t\\trefers exclusively to them. In its abstract connotation,\\n\\t\\t\\t\\tthe verb hamala frequently signifies \"he bore [or \"took\\n\\t\\t\\t\\tupon himself\"] the responsibility [for something]\": and\\n\\t\\t\\t\\tso it is evident that it applies here not only to angels\\n\\t\\t\\t\\tbut also to all human beings who are conscious of the\\n\\t\\t\\t\\ttremendous implications of the concept of God's\\n\\t\\t\\t\\talmightiness, and hence feel morally responsible for\\n\\t\\t\\t\\ttranslating this consciousness into the reality of their\\n\\t\\t\\t\\town and their fellow-beings' lives."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "8",
    "NoteID": "5",
    "Body": "See note [45] on  38:50 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "10",
    "NoteID": "6",
    "Body": "Lit., \"they will be called\" or \"summoned\"."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "10",
    "NoteID": "7",
    "Body": "I.e., \"on realizing, belatedly, your past sinfulness\"."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "10",
    "NoteID": "8",
    "Body": "Since it is impossible to attribute to God a purely human\\n\\t\\t\\t\\temotion, \"God's loathing\" of those sinners is obviously a\\n\\t\\t\\t\\tmetonym for His rejection of them (Razi), similar to the\\n\\t\\t\\t\\tmetonymic use of the expression \"God's wrath (ghadab)\" in\\n\\t\\t\\t\\tthe sense of His condemnation (see first sentence of note\\n\\t\\t\\t\\t[4] on  1:7 )."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "I.e., \"Thou hast brought us to life on earth, and then\\n\\t\\t\\t\\thast caused us to die; thereupon Thou hast resurrected\\n\\t\\t\\t\\tus, and now hast condemned us to spiritual death in\\n\\t\\t\\t\\tconsequence of our wilful spiritual blindness on earth.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "12",
    "NoteID": "10",
    "Body": "An answer to the sinners' question at the end of the\\n\\t\\t\\t\\tpreceding verse may be found in the following extremely\\n\\t\\t\\t\\twell-authenticated, parabolic saying of the Prophet: \"[On\\n\\t\\t\\t\\tthe Day of Judgment,] those who deserve paradise will\\n\\t\\t\\t\\tenter paradise, and those who deserve the fire, the fire.\\n\\t\\t\\t\\tThereupon God, the Sublimely Exalted, will say, 'Take out\\n\\t\\t\\t\\t[of the fire] everyone in whose heart there was as much\\n\\t\\t\\t\\tof faith [or, in some versions, \"as much of good\"] as a\\n\\t\\t\\t\\tgrain of mustard seed!' And so they will be taken out of\\n\\t\\t\\t\\tit, already blackened, and will be thrown into the River\\n\\t\\t\\t\\tof Life; and then they will come to life [lit., 'sprout']\\n\\t\\t\\t\\tas a herb sprouts by the side of a stream: and didst thou\\n\\t\\t\\t\\tnot see how it comes out, yellow and budding?\" (Bukhari,\\n\\t\\t\\t\\ton the authority of Abu Sa'id al-Khudri, in Kitab al-Iman\\n\\t\\t\\t\\tand Kitab Bad' al-Khalq; also Muslim, Nasai and Ibn\\n\\t\\t\\t\\tHanbal.) The characterization as \"yellow and budding\" -\\n\\t\\t\\t\\ti.e., tender and of light colour - indicates the\\n\\t\\t\\t\\tfreshness of new life in the pardoned sinner. This, of\\n\\t\\t\\t\\tcourse, has nothing to do with the sinners' futile -\\n\\t\\t\\t\\tbecause meaningless - request on Judgment Day to be given\\n\\t\\t\\t\\ta \"second chance\" on earth (Cf. {6:27-28} or  32:12 ).\\n\\t\\t\\t\\tSee also last but one sentence of  6:128  and the\\n\\t\\t\\t\\tcorresponding note [114]."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "15",
    "NoteID": "11",
    "Body": "Lit., He of the throne of almightiness\". For the meaning\\n\\t\\t\\t\\tof the term 'arsh, see note [43] on  7:54 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "15",
    "NoteID": "12",
    "Body": "Lit., the Day of the Meeting\". - For my rendering of\\n\\t\\t\\t\\tar-ruh as inspiration, see note [2] on  16:2 , as well as\\n\\t\\t\\t\\tnote [71] on  2:87 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "18",
    "NoteID": "13",
    "Body": "Regarding the problem of \"intercession\" (shafaah) and its\\n\\t\\t\\t\\tmeaning in the Qur an, see note [7] on  10:3 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "19",
    "NoteID": "14",
    "Body": "God's omniscience is shown here as the reason why there\\n\\t\\t\\t\\tcan be no intercession with Him in the commonly-accepted\\n\\t\\t\\t\\tsense of this term (cf. surah {10}, note [27])."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "20",
    "NoteID": "15",
    "Body": "I.e., saints, whether real or imaginary, or angels. (The\\n\\t\\t\\t\\tpronoun alladhina is used only with reference to sentient\\n\\t\\t\\t\\tbeings endowed with reason.)"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "24",
    "NoteID": "16",
    "Body": "As regards Qarun, who is said to have been a follower -\\n\\t\\t\\t\\tand subsequently an opponent - of Moses, see  28:76  ff.,\\n\\t\\t\\t\\tas well as the corresponding note [84]. For a discussion\\n\\t\\t\\t\\tof the name Haman, see note [6] on  28:6 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "25",
    "NoteID": "17",
    "Body": "Lit., \"those who have come to believe with him\"."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "26",
    "NoteID": "18",
    "Body": "My interpolation of the word \"alleged\", is necessitated\\n\\t\\t\\t\\tby the obvious sarcasm of Pharaoh's remark."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "28",
    "NoteID": "19",
    "Body": "Cf. the parable of the believer in {36:20-27} and, in\\n\\t\\t\\t\\tparticular, the corresponding note 15."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "28",
    "NoteID": "20",
    "Body": "Lit., \"a liar\". As regards my rendering of musrif as \"one\\n\\t\\t\\t\\twho wastes [or \"has wasted\"] his own self\", see note [21]\\n\\t\\t\\t\\ton the last sentence of  10:12 . Thus, the anonymous\\n\\t\\t\\t\\tbeliever spoken of here argues that the message brought\\n\\t\\t\\t\\tby Moses is so convincing that, by itself, it is a proof\\n\\t\\t\\t\\tof his not being \"one who wastes his own self\" - i.e.,\\n\\t\\t\\t\\tdestroys himself spiritually - by a spurious claim to\\n\\t\\t\\t\\tdivine inspiration."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "29",
    "NoteID": "21",
    "Body": "Thus alluding to the reasons underlying his intention to\\n\\t\\t\\t\\tkill Moses, expressed in verse {26}."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "31",
    "NoteID": "22",
    "Body": "I.e., those sinners were not wronged by what befell them\\n\\t\\t\\t\\tin this world: they had deserved it. The next two verses\\n\\t\\t\\t\\trefer to the Day of Judgment."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "33",
    "NoteID": "23",
    "Body": "See note [152] on  7:186  and note [4] on  14:4 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "34",
    "NoteID": "24",
    "Body": "Thus not only refusing to acknowledge Joseph's\\n\\t\\t\\t\\tprophethood, but also denying the possibility of any\\n\\t\\t\\t\\tprophet being sent by God (Zamakhshari). It would seem\\n\\t\\t\\t\\tthat Joseph had been accepted in Egypt as a prophet only\\n\\t\\t\\t\\tby the ruling class, the Hyksos, who were of Arab origin;\\n\\t\\t\\t\\tspoke a language closely related to Hebrew (cf. surah\\n\\t\\t\\t\\t{12}, note [44]), and were, therefore, emotionally and\\n\\t\\t\\t\\tculturally predisposed towards the spirit of Joseph's\\n\\t\\t\\t\\tmission, while the rest of the population was and\\n\\t\\t\\t\\tremained hostile to the faith preached by him."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "35",
    "NoteID": "25",
    "Body": "Lit., \"without any authority [or \"evidence\"] having come\\n\\t\\t\\t\\tto them\": i.e., without having any cogent evidence that\\n\\t\\t\\t\\twould support their \"denial\" of the fact of revelation. -\\n\\t\\t\\t\\tThe verb jadala primarily denotes \"he argued\"; followed\\n\\t\\t\\t\\tby the particle fi (\"with regard to\" or \"about\") it has\\n\\t\\t\\t\\tthe meaning of \"contesting\" the truth of something, or\\n\\t\\t\\t\\t\"calling it in question\"."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "35",
    "NoteID": "26",
    "Body": "Lit., \"on the heart of every arrogant, self-exalting\\n\\t\\t\\t\\t[person]\". For an explanation of God's \"sealing\" an\\n\\t\\t\\t\\tinveterate sinner's heart. see note [7] on  2:7 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "37",
    "NoteID": "27",
    "Body": "See surah {28}, notes [6] and [37]."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "40",
    "NoteID": "28",
    "Body": "I.e., beyond any earthly imagination. The concept of rizq\\n\\t\\t\\t\\t(expressed in the verb yurzaqun) has here its full\\n\\t\\t\\t\\tsignificance of all that is good and of benefit to a\\n\\t\\t\\t\\tliving being, comprising things material as well as\\n\\t\\t\\t\\tintellectual and spiritual; hence my rendering of\\n\\t\\t\\t\\tyurzaqun (lit., \"they will be given sustenance\") as \"they\\n\\t\\t\\t\\tshall be blest with good\"."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "41",
    "NoteID": "29",
    "Body": "Lit., \"what is the matter with me\": an expression of\\n\\t\\t\\t\\tastonishment at the incongruity of the two attitudes\\n\\t\\t\\t\\treferred to in the sequence."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "42",
    "NoteID": "30",
    "Body": "I.e., because there is no reality whatsoever in those\\n\\t\\t\\t\\tsupposedly \"divine\" beings or forces (Zamakhshari)."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "46",
    "NoteID": "31",
    "Body": "I.e., of which they had been warned, day-in and day-out,\\n\\t\\t\\t\\tby prophets and believers like the one spoken of in this\\n\\t\\t\\t\\tpassage."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "47",
    "NoteID": "32",
    "Body": "Cf.  14:21  and the corresponding notes [28] and [29]."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "49",
    "NoteID": "33",
    "Body": "I.e., the angelic forces that are to watch over the\\n\\t\\t\\t\\tsuffering of the sinners in the hereafter: perhaps an\\n\\t\\t\\t\\tallegory of the belated awakening of the latters'\\n\\t\\t\\t\\tconscience."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "50",
    "NoteID": "34",
    "Body": "According to the classical commentators, this answer\\n\\t\\t\\t\\timplies no more than a refusal on the part of the\\n\\t\\t\\t\\t\"keepers of hell\" to intercede for the doomed sinners,\\n\\t\\t\\t\\ttelling them, as it were, \"Pray yourselves, if you can.\"\\n\\t\\t\\t\\tIt seems to me, however, that we have here an indirect\\n\\t\\t\\t\\tallusion to the sinners' erstwhile, blasphemous devotion\\n\\t\\t\\t\\tto false objects of worship and false values - the\\n\\t\\t\\t\\tmeaning being, \"Pray now to those imaginary powers to\\n\\t\\t\\t\\twhich you were wont to ascribe a share in God's divinity,\\n\\t\\t\\t\\tand see whether they can help you!\" This interpretation\\n\\t\\t\\t\\tfinds support in the next sentence, which speaks of the\\n\\t\\t\\t\\tdelusion (dalal) inherent in the prayers of \"those who\\n\\t\\t\\t\\tdeny the truth\", i.e., during their life on earth - for,\\n\\t\\t\\t\\tobviously, on the Day of Judgment all such delusions will\\n\\t\\t\\t\\thave disappeared."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "51",
    "NoteID": "35",
    "Body": "See note [71] on  39:69 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "52",
    "NoteID": "36",
    "Body": "Lit., \"the evil of the [otherworldly] abode\". As regards\\n\\t\\t\\t\\tthe term la'nah, its primary significance is\\n\\t\\t\\t\\t\"estrangement\" or \"rejection\"; in Qur'anic terminology it\\n\\t\\t\\t\\tdenotes \"rejection from all that is good\" (Lisan\\n\\t\\t\\t\\tal-'Arab) and, specifically, \"estrangement from God's\\n\\t\\t\\t\\tgrace\" (Zamakhshari)."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "54",
    "NoteID": "37",
    "Body": "Sc., \"and thus, too, have We bestowed Our revelation upon\\n\\t\\t\\t\\tMuhammad\". This connects with the opening words of verse\\n\\t\\t\\t\\t{51}, \"We shall indeed succour Our apostles and those who\\n\\t\\t\\t\\thave attained to faith\", thus explaining the purport of\\n\\t\\t\\t\\tthe preceding story of the believer who stood up for\\n\\t\\t\\t\\tMoses. The reference to \"those [of the children of\\n\\t\\t\\t\\tIsrael] who were endowed with insight\" and therefore\\n\\t\\t\\t\\tcould benefit from the message of Moses, is undoubtedly\\n\\t\\t\\t\\tmeant to remind the followers of the Our'an that this\\n\\t\\t\\t\\tdivine writ, too, is for \"those who are endowed with\\n\\t\\t\\t\\tinsight\" (ulu 'l-albab), for \"people who think\" (qawm\\n\\t\\t\\t\\tyatafakkarun), and \"people who use their reason\" (qawm ya'qilun)."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "55",
    "NoteID": "38",
    "Body": "According to all classical commentators, the above\\n\\t\\t\\t\\tpassage is addressed in the first instance to the Prophet\\n\\t\\t\\t\\tand, through him, to every believer. As regards the\\n\\t\\t\\t\\tProphet himself, see note [41] on the last sentence of\\n\\t\\t\\t\\t 24:31 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "56",
    "NoteID": "39",
    "Body": "See note [25] above."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "56",
    "NoteID": "40",
    "Body": "Lit., \"which they will never [be able to] reach\" or\\n\\t\\t\\t\\t\"fulfil\". This is a reference to the conceit which makes\\n\\t\\t\\t\\tmany agnostics think that man is \"self-sufficient\" and\\n\\t\\t\\t\\tthat, therefore, there are no limits to what he may yet\\n\\t\\t\\t\\tachieve, and no need to assume that he is responsible to\\n\\t\\t\\t\\ta higher Power. Cf. in this connection {96:6-7}, which is\\n\\t\\t\\t\\tone of the earliest Qur'anic revelations: \"Nay, verily,\\n\\t\\t\\t\\tman becomes grossly overweening whenever he believes\\n\\t\\t\\t\\thimself to be self-sufficient.\" And since this\\n\\t\\t\\t\\t\"self-sufficiency\" is entirely illusory, those who build\\n\\t\\t\\t\\ttheir world-view on it \"will never be able to satisfy\\n\\t\\t\\t\\ttheir overweening conceit\". (Cf. also the reference to\\n\\t\\t\\t\\t\"arrogant, self-exalting hearts\" in verse {35} above.)"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "57",
    "NoteID": "41",
    "Body": "I.e., of the universe as a whole. By stressing the fact\\n\\t\\t\\t\\tthat man is only a small, insignificant part of the\\n\\t\\t\\t\\tuniverse, the Qur'an points out the absurdity of the\\n\\t\\t\\t\\tman-centred world-view alluded to in the preceding verse."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "59",
    "NoteID": "42",
    "Body": "I.e., refuse to admit to themselves that the world as\\n\\t\\t\\t\\tthey know it could ever come to an end: which is another\\n\\t\\t\\t\\taspect of the \"overweening conceit\" spoken of in verse\\n\\t\\t\\t\\t{56} above."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "60",
    "NoteID": "43",
    "Body": "Cf.  2:186 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "61",
    "NoteID": "44",
    "Body": "See note [77] on  27:86 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "62",
    "NoteID": "45",
    "Body": "Sc., \"O you who deny this truth!\" For my above rendering\\n\\t\\t\\t\\tof tu'fakun, see note [90] on the last sentence of\\n\\t\\t\\t\\t 5:75 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "63",
    "NoteID": "46",
    "Body": "See surah {29}, note [45]."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "64",
    "NoteID": "47",
    "Body": "I.e., in accordance with the exigencies of human life.\\n\\t\\t\\t\\tSee also note [9] on the first sentence of  7:11 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "67",
    "NoteID": "48",
    "Body": "See note [4] on  23:12 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "67",
    "NoteID": "49",
    "Body": "Or: \"a term known [only to Him]\" - cf.  6:2  and the\\n\\t\\t\\t\\tcorresponding note [2]."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "69",
    "NoteID": "50",
    "Body": "Lit., \"how they are turned away\" - i.e., from the truth:\\n\\t\\t\\t\\tin this case, from all the observable evidence of God's\\n\\t\\t\\t\\talmightiness and creative activity."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "70",
    "NoteID": "51",
    "Body": "Since, as the Qur'an so often points out, the fundamental\\n\\t\\t\\t\\ttruths set forth in all divine revelations are the same,\\n\\t\\t\\t\\ta rejection of the last of them amounts to a rejection of\\n\\t\\t\\t\\tall the preceding ones."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "71",
    "NoteID": "52",
    "Body": "For an explanation of the allegory of \"shackles\" and\\n\\t\\t\\t\\t\"chains\", see note [13] on  13:5 , note [44] on the last\\n\\t\\t\\t\\tbut one sentence of  34:33 , and notes [6] and [7] on\\n\\t\\t\\t\\t 36:8 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "72",
    "NoteID": "53",
    "Body": "Thus Mujahid (as quoted by Tabari) explains the verb\\n\\t\\t\\t\\tyusjarun. As regards my rendering of hamim as \"burning\\n\\t\\t\\t\\tdespair\", see surah {6}, note [62]."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "74",
    "NoteID": "54",
    "Body": "Lit., \"we have not been invoking aforetime any [real]\\n\\t\\t\\t\\tthing\": thus realizing, belatedly, the intrinsic\\n\\t\\t\\t\\tnothingness of all those imaginary powers and values -\\n\\t\\t\\t\\tincluding the belief in man's alleged self-sufficiency\\n\\t\\t\\t\\tand greatness - to which they paid homage in life."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "74",
    "NoteID": "55",
    "Body": "I.e., by allowing them to pursue illusions and foolish\\n\\t\\t\\t\\tfancies in consequence of their unwillingness to\\n\\t\\t\\t\\tacknowledge the self-evident truth of God's existence and\\n\\t\\t\\t\\tuniqueness and of man's utter dependence on Him. For a\\n\\t\\t\\t\\tdiscussion of the problem of God's \"letting\" a sinner go\\n\\t\\t\\t\\tastray, see note [4] on  14:4 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "77",
    "NoteID": "56",
    "Body": "See the almost identical passage in  10:46 , as well as\\n\\t\\t\\t\\tthe corresponding notes [66] and [67]."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "78",
    "NoteID": "57",
    "Body": "I.e., in the Qur'an."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "78",
    "NoteID": "58",
    "Body": "See  6:109  - \"Miracles are in the power of God alone\" -\\n\\t\\t\\t\\tand the corresponding note [94]. Both passages (6:109 and\\n\\t\\t\\t\\tthe present one) relate to the futile demand of\\n\\t\\t\\t\\tMuhammad's opponents to be shown a miracle in proof of\\n\\t\\t\\t\\tthe divine origin of the Qur'an - the implication being\\n\\t\\t\\t\\tthat it is not God's will to convince the deniers of the\\n\\t\\t\\t\\ttruth by means of what is commonly regarded as miracles\\n\\t\\t\\t\\t\"."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "78",
    "NoteID": "59",
    "Body": "Lit., \"when God's command comes\", i.e., whether it be in\\n\\t\\t\\t\\tthis world or on the Day of Judgment: a reference to the\\n\\t\\t\\t\\tretribution spoken of in verse {77} above."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "78",
    "NoteID": "60",
    "Body": "I.e., in this case, divine revelation as such. For the\\n\\t\\t\\t\\tabove rendering of al-mubtilun, see note [47] on the last\\n\\t\\t\\t\\tsentence of  29:48 ."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "79",
    "NoteID": "61",
    "Body": "I.e., by providing in a wondrous manner the means of\\n\\t\\t\\t\\tman's subsistence, and by endowing him with the miracle\\n\\t\\t\\t\\tof a creative intellect which enables him to make\\n\\t\\t\\t\\tfruitful use of so many natural phenomena. (This passage\\n\\t\\t\\t\\tconnects with the statement implied in verse {78} that\\n\\t\\t\\t\\t\"miracles are in the power of God alone\": see note [58].)"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "80",
    "NoteID": "62",
    "Body": "The \"other benefits\" are both concrete and abstract in\\n\\t\\t\\t\\ttheir nature: concrete benefits like wool, skins, etc.,\\n\\t\\t\\t\\tand abstract ones like beauty (cf. {16:6-8}, as well as\\n\\t\\t\\t\\tSolomon's reverence for the God-created beauty of horses\\n\\t\\t\\t\\texpressed in {38:31-33}) or the all-time companionship of\\n\\t\\t\\t\\tman and dog symbolized in the legend of the Men of the\\n\\t\\t\\t\\tCave ( 18:18  and {22})."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "80",
    "NoteID": "63",
    "Body": "Lit., \"a need in your bosoms\" [or \"hearts\"]: i.e., a\\n\\t\\t\\t\\tgenuine need."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "83",
    "NoteID": "64",
    "Body": "I.e., they were fully satisfied with their own\\n\\t\\t\\t\\tempirically or speculatively acquired or inherited\\n\\t\\t\\t\\tknowledge; and so, in their arrogant conviction that man\\n\\t\\t\\t\\tis \"self-sufficient\" and, therefore, not in need of any\\n\\t\\t\\t\\tguidance by a Power beyond the reach of human perception,\\n\\t\\t\\t\\tthey rejected whatever ethical and spiritual truths were\\n\\t\\t\\t\\toffered them by the prophets."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "83",
    "NoteID": "65",
    "Body": "I.e., the idea of God's existence and inescapable\\n\\t\\t\\t\\tjudgment: see  6:10  and the corresponding note [9]."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "84",
    "NoteID": "66",
    "Body": "I.e., the God-willed, catastrophic breakdown of their\\n\\t\\t\\t\\tsociety and civilization in consequence of their\\n\\t\\t\\t\\tpersistent rejection of all spiritual values."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "84",
    "NoteID": "67",
    "Body": "This evidently includes their past belief in man's\\n\\t\\t\\t\\tsupposedly \"unlimited possibilities\" and the illusory\\n\\t\\t\\t\\tconviction that one day he would achieve \"mastery over\\n\\t\\t\\t\\tnature\"."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "85",
    "NoteID": "68",
    "Body": "I.e., firstly, because this belated faith could not\\n\\t\\t\\t\\tunmake a reality which had already come into being, and,\\n\\t\\t\\t\\tsecondly, because it could not contribute to their\\n\\t\\t\\t\\tspiritual growth inasmuch as it was not an outcome of\\n\\t\\t\\t\\tfree choice but had been, rather, forced on them by the\\n\\t\\t\\t\\tshock of an irreversible calamity."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "85",
    "NoteID": "69",
    "Body": "The \"way of God\" (sunnat Allah) is the Qur'anic term for\\n\\t\\t\\t\\tthe totality of natural laws instituted by the Creator:\\n\\t\\t\\t\\tin this case, the law that faith has no spiritual value\\n\\t\\t\\t\\tunless it arises out of a genuine, inner enlightenment."
  }
]
