[
  {
    "SurahNumber": "15",
    "AyahNumber": "1",
    "NoteID": "1932",
    "Body": "For these letters, see Appendix 1."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "1",
    "NoteID": "1933",
    "Body": "Cf. x. 1. and n. 1382."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "1",
    "NoteID": "1934",
    "Body": "Note how appropriately the different phrases in which the\\n\\t\\t\\t\\tQur-an is characterised bring out its different aspects\\n\\t\\t\\t\\tas a Revelation. Let us just consider the phrases used at\\n\\t\\t\\t\\tthe beginning of the six A.L.M. Suras of which this is\\n\\t\\t\\t\\tthe last in order of arrangement. In x.1 we read, \"Ayats\\n\\t\\t\\t\\t(or verses or Signs) of the Book of Wisdom\", the theme\\n\\t\\t\\t\\tbeing the wonders of Allah's creation, and its relation\\n\\t\\t\\t\\tto His Revelation. In xi. 1 we read, \"a Book, with verses\\n\\t\\t\\t\\tbasic or fundamental, further explained in detail\": the\\n\\t\\t\\t\\ttheme is Allah's Justice and punishment, to preserve the\\n\\t\\t\\t\\tfundamental scheme of His Laws. In xii. 1 we read, \"The\\n\\t\\t\\t\\tSymbols verses of the Perspicuous Book\"; the wonderful\\n\\t\\t\\t\\tunfolding of Allah's Plan is explained in Joseph's story.\\n\\t\\t\\t\\tIn xiii. 1 we read, \"The Signs (or verses) of the Book\":\\n\\t\\t\\t\\tthe contrasts in the modes of Allah's Revelation and its\\n\\t\\t\\t\\treception by man are pointed out, but not illustrated by\\n\\t\\t\\t\\tdetailed examples as in Joseph's perspicuous story. In\\n\\t\\t\\t\\txiv. 1 we read, \"A Book revealed to lead out of darkness\\n\\t\\t\\t\\tinto light\": the theme being Abraham's prayer for man to\\n\\t\\t\\t\\tbe rescued from the darkness of false worship into the\\n\\t\\t\\t\\tlight of Unity. Here,in xv.1 we read, \"Ayats (or verses)\\n\\t\\t\\t\\tof Revelation,-of a Qur-an that makes things clear (or\\n\\t\\t\\t\\tperspicuous)\": the theme being an explanation of evil,\\n\\t\\t\\t\\tand how Allah's Truth is protected from it."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "2",
    "NoteID": "1935",
    "Body": "The time must inevitably come when those who allow\\n\\t\\t\\t\\tthemselves to be deceived by falsehood or deliberately\\n\\t\\t\\t\\tbreak Allah's Law will find themselves in a terrible\\n\\t\\t\\t\\tplight. They will then wish, ardently and again and\\n\\t\\t\\t\\tagain, that they had sought Allah's Will and walked in\\n\\t\\t\\t\\tthe light of Truth. That time may be early or late,-in\\n\\t\\t\\t\\tthis life, or at death, or at the Day of Judgment, but it\\n\\t\\t\\t\\tmust come. Man's own highest interest requires that he\\n\\t\\t\\t\\tshould awake to the Reality before it is too late for\\n\\t\\t\\t\\trepentance."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "3",
    "NoteID": "1936",
    "Body": "Literally, \"to eat\", Cf. v. 66 and n. 776."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "3",
    "NoteID": "1937",
    "Body": "The foolish and the wicked set great store by the\\n\\t\\t\\t\\tpleasures of this world. In their pride they think they\\n\\t\\t\\t\\thave all knowledge. In the fulness of knowledge they will\\n\\t\\t\\t\\tsee how wrong they were. Meanwhile those who have\\n\\t\\t\\t\\treceived the Light should not for a single moment wonder\\n\\t\\t\\t\\tat the apparent prosperity of the ungodly in this world.\\n\\t\\t\\t\\tThey should leave them alone, confident in the goodness\\n\\t\\t\\t\\tand justice of Allah."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "4",
    "NoteID": "1938",
    "Body": "Kitabun ma'lum: literally, \"a writing known\". There are\\n\\t\\t\\t\\tmany shades of meaning implied, (1) For every people, as\\n\\t\\t\\t\\tfor every individual, there is a definite Term assigned:\\n\\t\\t\\t\\ttheir faculty of choice gives them the opportunity of\\n\\t\\t\\t\\tmoulding their will according to Allah's Will, and thus\\n\\t\\t\\t\\tidentifying themselves with Allah's Universal Law. During\\n\\t\\t\\t\\tthat Term they will be given plenty of rope; after that\\n\\t\\t\\t\\tTerm is past, there will be no opportunity for\\n\\t\\t\\t\\trepentance. (2) Neither the righteous nor the ungodly can\\n\\t\\t\\t\\thasten or delay the doom: Allah's Will must prevail, and\\n\\t\\t\\t\\tHe is All-Wise. (3) The destruction of a people is not an\\n\\t\\t\\t\\tarbitrary punishment from Allah: the people bring it on\\n\\t\\t\\t\\tthemselves by their own choice; for the fixed Law or\\n\\t\\t\\t\\tDecree of Allah is always made known to them beforehand,\\n\\t\\t\\t\\tand in many ways."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "5",
    "NoteID": "1939",
    "Body": "Cf. vii. 34. Also see the last note."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "6",
    "NoteID": "1940",
    "Body": "Al-Mustafa was accused by the ungodly of being mad or\\n\\t\\t\\t\\tpossessed, because he spoke of higher things than they\\n\\t\\t\\t\\tknew, and acted from motives purer and nobler than they\\n\\t\\t\\t\\tcould understand. So, in a minor degree, is the lot of\\n\\t\\t\\t\\tall the righteous in the presence of an ungodly world.\\n\\t\\t\\t\\tTheir motives, actions, words, hopes, and aspirations are\\n\\t\\t\\t\\tunintelligible to their fellows, and they are accused of\\n\\t\\t\\t\\tbeing mad or out of their senses. But they know that they\\n\\t\\t\\t\\tare on the right path, and it is the ungodly who are\\n\\t\\t\\t\\treally acting against their own best interests."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "7",
    "NoteID": "1941",
    "Body": "Cf. vi. 8-9, and notes 840, 841. On the part of the\\n\\t\\t\\t\\tunbelievers, this is a mere taunt. They neither believe\\n\\t\\t\\t\\tin Allah nor in angels nor in revelation nor in any but\\n\\t\\t\\t\\tmaterial things. It is ridiculous to suppose that they\\n\\t\\t\\t\\tcould be taken seriously."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "8",
    "NoteID": "1942",
    "Body": "Angels are not sent down to satisfy the whim or curiosity\\n\\t\\t\\t\\tof the unbelievers. They are sent to bring inspiration to\\n\\t\\t\\t\\tAllah's messengers and to execute Allah's decrees."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "8",
    "NoteID": "1943",
    "Body": "If the angels were to appear before the ungodly, it would\\n\\t\\t\\t\\tmean that they came to execute just punishment, and then\\n\\t\\t\\t\\tthere would be no hope of respite possible for the\\n\\t\\t\\t\\tungodly."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "9",
    "NoteID": "1944",
    "Body": "The purity of the text of the Qur-an through fourteen\\n\\t\\t\\t\\tcenturies is a foretaste of the eternal care with which\\n\\t\\t\\t\\tAllah's Truth is guarded through all ages. All\\n\\t\\t\\t\\tcorruptions, inventions, and accretions pass away, but\\n\\t\\t\\t\\tAllah's pure and holy Truth will never suffer eclipse\\n\\t\\t\\t\\teven though the whole world mocked at it and were bent on\\n\\t\\t\\t\\tdestroying it."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "10",
    "NoteID": "1945",
    "Body": "Shiya'un, plural of Shi'atun = a sect, a religious\\n\\t\\t\\t\\tdivision. Mankind sees fragments of Truth at a time, and\\n\\t\\t\\t\\tis apt to fall into fragments and divisions. All true\\n\\t\\t\\t\\tmessengers of Allah come to reconcile these fragments or\\n\\t\\t\\t\\tdivisions, for they preach the true Gospel of Unity. So\\n\\t\\t\\t\\tcame Al-Mustafa to bring back to Unity the many jarring\\n\\t\\t\\t\\tsects among the Jews, Christians, and Pagans. His mission\\n\\t\\t\\t\\twas held up to ridicule, but so was the mission of his\\n\\t\\t\\t\\tpredecessors. Mockery itself should not discourage the\\n\\t\\t\\t\\tpreachers of Truth."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "12",
    "NoteID": "1946",
    "Body": "If evil and disbelief exist in the world, we must not be\\n\\t\\t\\t\\timpatient or lose our faith. We must recognise that if\\n\\t\\t\\t\\tsuch things are permitted, they are part of the Universal\\n\\t\\t\\t\\tPlan and purpose of Allah, Who is All-Wise and All-Good,\\n\\t\\t\\t\\tbut Whose wisdom and goodness we cannot fully fathom. One\\n\\t\\t\\t\\tconsolation we have, and that is stated in the next verse\\n\\t\\t\\t\\tand the next note."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "13",
    "NoteID": "1947",
    "Body": "Sects, divisions, and systems invented by men tend to\\n\\t\\t\\t\\tpass away, but Allah's pure Truth of Unity endures for\\n\\t\\t\\t\\tever. This we see in history when we study it on a large\\n\\t\\t\\t\\tscale. Cf. the parable in xiv. 24-26 Khalat: I have\\n\\t\\t\\t\\ttranslated it here in the same sense as in xiii. 30 x.\\n\\t\\t\\t\\t102, and other places. Some Commentators give it a\\n\\t\\t\\t\\tslightly different shade of meaning. The other meaning is\\n\\t\\t\\t\\tseen in xlviii. 23."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "14",
    "NoteID": "1948",
    "Body": "Cf. vi. 35. The spiritual kingdom is open to all to\\n\\t\\t\\t\\tenter. But the entrance is not a mere matter of physical\\n\\t\\t\\t\\tmovement. It is a question of a total change of heart.\\n\\t\\t\\t\\tEvil must cease to be evil, before it can see or enjoy\\n\\t\\t\\t\\tGood. If we could suppose Evil, like Bottom the weaver,\\n\\t\\t\\t\\tto be \"translated\" or in some way carried up to heaven,\\n\\t\\t\\t\\tit would only think that the Truth was an illusion, and\\n\\t\\t\\t\\tthe reality was mere witchery. The taint is in its very\\n\\t\\t\\t\\tnature, which must first be purified and rendered fit for\\n\\t\\t\\t\\tthe reception of light, truth, and bliss."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "16",
    "NoteID": "1949",
    "Body": "Evil having been described, not as an external thing, but\\n\\t\\t\\t\\tas a taint of the soul, we have in this section a\\n\\t\\t\\t\\tglorious account of the purity and beauty of Allah's\\n\\t\\t\\t\\tCreation. Evil is a blot on it, not a normal feature of\\n\\t\\t\\t\\tit. Indeed, the normal feature is the guard which Allah\\n\\t\\t\\t\\thas put on it, to protect it from evil."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "16",
    "NoteID": "1950",
    "Body": "In the countless millions of stars in the universe which\\n\\t\\t\\t\\twe see, the first step in our astronomical knowledge is\\n\\t\\t\\t\\tto find marvellous order, beauty, and harmony, on a scale\\n\\t\\t\\t\\tof grandeur which we appreciate more and more as our\\n\\t\\t\\t\\tknowledge increases. The first broad belt that we\\n\\t\\t\\t\\tdistinguish is the Zodiac, which marks the sun's path\\n\\t\\t\\t\\tthrough the heavens year after year and the limit of the\\n\\t\\t\\t\\twanderings of the moon and the planets. We make twelve\\n\\t\\t\\t\\tdivisions of it and call them Signs of the Zodiac. Each\\n\\t\\t\\t\\tmarks the solar path through the heavens as we see it,\\n\\t\\t\\t\\tmonth after month. We can thus mark off the seasons in\\n\\t\\t\\t\\tour solar year, and express in definite laws the most\\n\\t\\t\\t\\timportant facts in meteorology, agriculture, seasonal\\n\\t\\t\\t\\twinds, and tides. Then there are the mansions of the\\n\\t\\t\\t\\tmoon, the mapping out of the Constellations, and the\\n\\t\\t\\t\\tother marvellous facts of the heavens, some of which\\n\\t\\t\\t\\taffect our physical life on this earth. But the highest\\n\\t\\t\\t\\tlessons we can draw from them are spiritual. The author\\n\\t\\t\\t\\tof this wonderful Order and Beauty is One, and He alone\\n\\t\\t\\t\\tis entitled to our worship."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "17",
    "NoteID": "1951",
    "Body": "Taking the physical heavens, we can imagine the supreme\\n\\t\\t\\t\\tmelody of harmony- guarded from every disturbing force."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "17",
    "NoteID": "1952",
    "Body": "Rajim: driven away with stones, rejected, accursed. Cf.\\n\\t\\t\\t\\tiii. 36."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "18",
    "NoteID": "1953",
    "Body": "Cf. lxxii. 8-9."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "18",
    "NoteID": "1954",
    "Body": "A shooting star. Cf. xxxvii. 10."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "19",
    "NoteID": "1955",
    "Body": "Majesty, order, beauty and harmony are shown in all\\n\\t\\t\\t\\tAllah's Creation, but especially in the heavens. Coming\\n\\t\\t\\t\\tnearer to man, Allah's care for man and His goodness are\\n\\t\\t\\t\\tshown (besides His other qualities) in His creation of\\n\\t\\t\\t\\tthe earth. In highly poetical language, the earth is\\n\\t\\t\\t\\tdescribed as spread out like a carpet, on which the hills\\n\\t\\t\\t\\tact as weights to keep it steady."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "19",
    "NoteID": "1956",
    "Body": "And every kind of thing is produced on the earth in due\\n\\t\\t\\t\\tbalance and measure. The mineral kingdom supports the\\n\\t\\t\\t\\tvegetable and they in their turn support the animal, and\\n\\t\\t\\t\\tthere is a link of mutual dependence between them. Excess\\n\\t\\t\\t\\tis eliminated. The waste of one is made the food of\\n\\t\\t\\t\\tanother, and vice versa. And this is a chain of gradation\\n\\t\\t\\t\\tand inter-dependence."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "20",
    "NoteID": "1957",
    "Body": "See last note. 'We provide sustenance of every kind,\\n\\t\\t\\t\\tphysical, mental, spiritual, etc., for you (i.e. for\\n\\t\\t\\t\\tmankind). But We do more. We provide for everyone of Our\\n\\t\\t\\t\\tcreatures. And there are those of which mankind is not\\n\\t\\t\\t\\teven cognisant. We provide for them also. There are those\\n\\t\\t\\t\\twho may at first sight appear hostile to man, or whom man\\n\\t\\t\\t\\tmay consider hostile, such as wild and noxious animals.\\n\\t\\t\\t\\tThey are Our creatures, and We provide for them also, as\\n\\t\\t\\t\\tthey are Our creatures. But there is due order and\\n\\t\\t\\t\\tbalance in the economy of Our universal Plan.'"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "21",
    "NoteID": "1958",
    "Body": "Khaza'in: treasures; store-houses; places where valuable\\n\\t\\t\\t\\tthings are accumulated, from which supplies are\\n\\t\\t\\t\\tdistributed from time to time as need arises."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "21",
    "NoteID": "1959",
    "Body": "All the wonderful gifts and forces and energies which we\\n\\t\\t\\t\\tsee in the world around us have their sources and\\n\\t\\t\\t\\tfountain-heads with Allah, the Creator and Sustainer of\\n\\t\\t\\t\\tthe Worlds. And what we see, or perceive or imagine is\\n\\t\\t\\t\\tjust a small portion of what exists. That portion is sent\\n\\t\\t\\t\\tout to us and to our world according to our needs or its\\n\\t\\t\\t\\tneeds from time to time as the occasion arises. It is\\n\\t\\t\\t\\tstrictly limited according to rule and plan. Its source\\n\\t\\t\\t\\tis unlimited and inexhaustible. In the same way the\\n\\t\\t\\t\\tforces which we see operating around us, in nature or in\\n\\t\\t\\t\\tthe spiritual world, according to laws which we can grasp\\n\\t\\t\\t\\tand, ascertain, are mere derived forces, in the 2nd, 3rd,\\n\\t\\t\\t\\tor nth degree. Their source and ultimate fountain head is\\n\\t\\t\\t\\twith Allah."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "22",
    "NoteID": "1960",
    "Body": "Lawaqih, plural of laqih, from laqaha, to impregnate or\\n\\t\\t\\t\\tfecundate the female date-palm by putting the pollen of\\n\\t\\t\\t\\tthe male tree on to the ovaries of the female tree. The\\n\\t\\t\\t\\tdate palm is uni-sexual. The wind performs this office\\n\\t\\t\\t\\tfor many flowers. Here, by a bold metaphor, its\\n\\t\\t\\t\\tfecundating quality is transferred to the clouds, which\\n\\t\\t\\t\\tby means of rain produce all kinds of fruit, grain, and\\n\\t\\t\\t\\tvegetation. The clouds as vapour are manipulated by the\\n\\t\\t\\t\\twinds, which set up atmospheric currents resulting in\\n\\t\\t\\t\\tcondensation and the descent of rain. Note the\\n\\t\\t\\t\\tappropriateness of the little article \"then\", showing the\\n\\t\\t\\t\\tconnection of winds with rain."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "22",
    "NoteID": "1961",
    "Body": "Cf. the previous verse, and n. 1958. Man may store water\\n\\t\\t\\t\\tin cisterns, tanks, lakes, and head-waters of canals. But\\n\\t\\t\\t\\the has no control over its original sources, which are\\n\\t\\t\\t\\tthe clouds, which by the help of the winds, act as the\\n\\t\\t\\t\\tgrand distributors of water over wide spaces of the\\n\\t\\t\\t\\tworld's surface."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "22",
    "NoteID": "1962",
    "Body": "This verse must be understood as furnishing an example of\\n\\t\\t\\t\\tillustration of what is said in the last verse."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "23",
    "NoteID": "1963",
    "Body": "Note how the argument has mounted up from xv. 16 onwards\\n\\t\\t\\t\\tto xv. 23-from things most remote from man to things\\n\\t\\t\\t\\ttouching his inmost being, and each of them in its own\\n\\t\\t\\t\\tway is a wonderful instance of Allah's glory and\\n\\t\\t\\t\\tgoodness, and the beauty, order and harmony of His\\n\\t\\t\\t\\tcreation. First, the heavens, the zodiacal Signs, the\\n\\t\\t\\t\\tstars , and the mysterious phenomena that we see above\\n\\t\\t\\t\\tus; then the earth, and the perfect balance of life and\\n\\t\\t\\t\\tforces therein, with man as an important factor, but not\\n\\t\\t\\t\\tthe only factor; then, the inexhaustible sources of\\n\\t\\t\\t\\tenergy, of which Allah alone is the Provider, but which\\n\\t\\t\\t\\tcome to us in measured proportions, as needed; and\\n\\t\\t\\t\\tlastly, Life and Death itself, which will pass away but\\n\\t\\t\\t\\tAllah will remain. A noble passage, and a fine\\n\\t\\t\\t\\tvindication of Allah's wisdom and providence in dealing\\n\\t\\t\\t\\twith His creatures."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "23",
    "NoteID": "1964",
    "Body": "Literally, \"We are the Heirs, or Inheritors,\" Cf. iii.\\n\\t\\t\\t\\t180; \"To Allah belongs the heritage of the heavens and\\n\\t\\t\\t\\tthe earth.\" See also the latter part of n. 988 to vi.\\n\\t\\t\\t\\t165."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "24",
    "NoteID": "1965",
    "Body": "Meaning may be: \"those who preceded you in point of time\\n\\t\\t\\t\\tand those who come after you in point of time; they are\\n\\t\\t\\t\\tall known to Allah, and He will gather them all together\\n\\t\\t\\t\\ton the Day of Judgment.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "26",
    "NoteID": "1966",
    "Body": "Salsal.- dry clay which produces a sound, like pottery.\\n\\t\\t\\t\\tCf. iv. 14. Taking verses 26 and 29 together, I\\n\\t\\t\\t\\tunderstand the meaning to be: that man's body was formed\\n\\t\\t\\t\\tfrom wet clay moulded into shape and then dried until it\\n\\t\\t\\t\\tcould emit sound; that it was then further fashioned and\\n\\t\\t\\t\\tcompleted; that into the animal form thus fashioned was\\n\\t\\t\\t\\tbreathed the spirit from Allah, which gave it a\\n\\t\\t\\t\\tsuperiority over other Creation: and that the order for\\n\\t\\t\\t\\tobeisance was then given."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "27",
    "NoteID": "1967",
    "Body": "Cf. vi. 100 and n. 929."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "29",
    "NoteID": "1968",
    "Body": "Among other passages where the creation of Adam is\\n\\t\\t\\t\\treferred to, cf. the following; ii. 30-39; vii. 11-25.\\n\\t\\t\\t\\tNote that here the emphasis is on three points: (1) the\\n\\t\\t\\t\\tbreathing from Allah's spirit into man i.e., the faculty\\n\\t\\t\\t\\tof God-like knowledge and will, which, if rightly used,\\n\\t\\t\\t\\twould give man superiority over other creatures: (2) the\\n\\t\\t\\t\\torigin of evil in arrogance and jealousy on the part of\\n\\t\\t\\t\\tSatan, who saw only the lower side of man (his clay) and\\n\\t\\t\\t\\tfailed to see the higher side, the faculty brought in\\n\\t\\t\\t\\tfrom the spirit of Allah; (3) that this evil only touches\\n\\t\\t\\t\\tthose who yield to it, and has no power over Allah's\\n\\t\\t\\t\\tsincere servants, purified by His grace (xv. 40, 42).\\n\\t\\t\\t\\tAdam is not here mentioned by name, but only Man."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "31",
    "NoteID": "1969",
    "Body": "Cf. n. 49 to ii. 34."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "31",
    "NoteID": "1970",
    "Body": "Iblis: the name has in it the root-idea of desperateness\\n\\t\\t\\t\\tor rebellion. Cf. n. 52 to ii. 36."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "31",
    "NoteID": "1971",
    "Body": "Apparently Iblis's arrogance had two grounds: (1) that\\n\\t\\t\\t\\tman was made of clay while he was made of fire; (2) that\\n\\t\\t\\t\\the did not wish to do what others did. Both grounds were\\n\\t\\t\\t\\tfalse; (1) because man had the spirit of Allah breathed\\n\\t\\t\\t\\tinto him; (2) because contempt of the angels who obeyed\\n\\t\\t\\t\\tAllah's words showed not Iblis's superiority but his\\n\\t\\t\\t\\tinferiority."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "35",
    "NoteID": "1972",
    "Body": "After the Day of Judgment the whole constitution of the\\n\\t\\t\\t\\tuniverse will be different. There will be a new world\\n\\t\\t\\t\\taltogether, on a wholly different plane. (Cf. xxi. 104)."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "36",
    "NoteID": "1973",
    "Body": "What was this respite? The curse on Iblis remained, i.e.\\n\\t\\t\\t\\the was deprived of Allah's grace and became in the\\n\\t\\t\\t\\tspiritual world what an outlaw is in a political kingdom.\\n\\t\\t\\t\\tAn earthly kingdom may not be able to catch and destroy\\n\\t\\t\\t\\tan outlaw. But Allah is Omnipotent, and such power as\\n\\t\\t\\t\\tIblis may have can only come through the respite granted\\n\\t\\t\\t\\tby Allah. The respite then is what is expressed in xv. 39\\n\\t\\t\\t\\tbelow. In Allah's grant of limited free-will to man is\\n\\t\\t\\t\\timplied the faculty of choosing between good and evil,\\n\\t\\t\\t\\tand the faculty is exercised through the temptations and\\n\\t\\t\\t\\tallurements put forward by Satan, \"the open enemy\" of\\n\\t\\t\\t\\tman. This is for the period of man's probation on this\\n\\t\\t\\t\\tearth. Even so, no temptations have power over the\\n\\t\\t\\t\\tsincere worshippers of Allah, who are purified by His\\n\\t\\t\\t\\tgrace."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "39",
    "NoteID": "1974",
    "Body": "Agwaitani: 'thrown me out of the way, put me in the\\n\\t\\t\\t\\twrong': Cf. vii. 16. Satan cannot be straight or truthful\\n\\t\\t\\t\\teven before Allah. By his own arrogance and rebellion he\\n\\t\\t\\t\\tfell; he attributes this to Allah. Between Allah's\\n\\t\\t\\t\\trighteous judgment and Satan's snares and temptations\\n\\t\\t\\t\\tthere cannot be the remotest comparison. Yet he presumes\\n\\t\\t\\t\\tto put them on an equal footing. He is taking advantage\\n\\t\\t\\t\\tof the respite."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "39",
    "NoteID": "1975",
    "Body": "Iblis (the Satan) is powerless against Allah. He turns\\n\\t\\t\\t\\ttherefore against man."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "41",
    "NoteID": "1976",
    "Body": "To be sincere in the worship of Allah is to obtain\\n\\t\\t\\t\\tpurification from all stain of evil and exemption from\\n\\t\\t\\t\\tall influence of evil. It changes the whole nature of\\n\\t\\t\\t\\tman. After that, evil cannot touch him. Evil will\\n\\t\\t\\t\\tacknowledge him to be beyond its power and will not even\\n\\t\\t\\t\\ttempt him. Apart from such purified souls, everyone who\\n\\t\\t\\t\\tworships Allah invites Allah's grace to protect him. But\\n\\t\\t\\t\\tif he puts himself in the way of wrong and deliberately\\n\\t\\t\\t\\tchooses evil, he must take the consequences. The blame is\\n\\t\\t\\t\\tnot even on Satan, the power of evil, it is on the sinner\\n\\t\\t\\t\\thimself, who puts himself into his power; xiv. 22: xv.\\n\\t\\t\\t\\t42."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "44",
    "NoteID": "1977",
    "Body": "The ways of sin are numerous, and if they are classified\\n\\t\\t\\t\\tinto seven, each of them points to a Gate that leads to\\n\\t\\t\\t\\tHell."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "47",
    "NoteID": "1978",
    "Body": "Cf. vii. 43, and n. 1021. The hearts and minds will be so\\n\\t\\t\\t\\tpurified that all past rancour, jealousy, or sense of\\n\\t\\t\\t\\tinjury will be obliterated. The true Brotherhood will be\\n\\t\\t\\t\\trealised there, when each will have his own dignity,\\n\\t\\t\\t\\tthere will be no question of invidious comparisons; each\\n\\t\\t\\t\\twill face the others with joy and confidence. There will\\n\\t\\t\\t\\tbe no sense of toil or fatigue, and the joy will last for\\n\\t\\t\\t\\tever."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "49",
    "NoteID": "1979",
    "Body": "We must realise both sides of Allah's attributes: His\\n\\t\\t\\t\\tmercy, grace, and forgiveness are unbounded; if we reject\\n\\t\\t\\t\\tall this, His justice and punishment will also be beyond\\n\\t\\t\\t\\tall that we can conceive."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "51",
    "NoteID": "1980",
    "Body": "In illustration of the contrasts between Good and Evil,\\n\\t\\t\\t\\tand the consequences that flow from them, we have now a\\n\\t\\t\\t\\treference to four incidents from the past, viz.: (1) an\\n\\t\\t\\t\\tincident from the story of Abraham; (2) from that of Lot,\\n\\t\\t\\t\\tnephew of Abraham, and the end of the Cities of the\\n\\t\\t\\t\\tPlain, which he was sent to warn; (3) the People of the\\n\\t\\t\\t\\tWood; and (4) the People of the Rocky Tract (Hijr), after\\n\\t\\t\\t\\twhom this Sura is called. As usual, the recital of\\n\\t\\t\\t\\tAllah's abounding grace comes first."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "52",
    "NoteID": "1981",
    "Body": "For a full understanding of this reference to the angels\\n\\t\\t\\t\\twho were Abraham's guests and came to announce the birth\\n\\t\\t\\t\\tof a son to him in his old age, read xi. 69-73 and notes.\\n\\t\\t\\t\\tThe appearance of two strangers of uncommon appearance,\\n\\t\\t\\t\\twho refused to partake of the host's sumptuous\\n\\t\\t\\t\\thospitality, made Abraham at first suspicious and afraid."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "53",
    "NoteID": "1982",
    "Body": "The birth of a son in old age, to a sonless father was\\n\\t\\t\\t\\tglad tidings to Abraham personally. The birth of a son\\n\\t\\t\\t\\tendowed with widsom promised something infinitely more.\\n\\t\\t\\t\\tConsidering that the angels were divine messengers, the\\n\\t\\t\\t\\twisdom referred to was divine wisdom, and the event\\n\\t\\t\\t\\tbecame an event of prime importance in the world's\\n\\t\\t\\t\\treligious history. For Abraham became, through his\\n\\t\\t\\t\\tprogeny, the root of the three great universal religions,\\n\\t\\t\\t\\tdiffused throughout the world."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "56",
    "NoteID": "1983",
    "Body": "Cf. xi. 69."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "57",
    "NoteID": "1984",
    "Body": "When cordial understanding was established between\\n\\t\\t\\t\\tAbraham and his guests and probably when the guests were\\n\\t\\t\\t\\tabout to depart, Abraham put a question to them: \"What is\\n\\t\\t\\t\\tthe mission on which you are going?\" It was further\\n\\t\\t\\t\\timplied: \"Is there anything I can do to help?\" But no.\\n\\t\\t\\t\\tThe mission was one of Punishment for abominable sins.\\n\\t\\t\\t\\tNote that the mention of Allah's Wrath is always linked\\n\\t\\t\\t\\twith that of Allah's Mercy, and the Mercy comes first.\\n\\t\\t\\t\\tThe same angels that came to punish Sodom and Gomorrah\\n\\t\\t\\t\\twere charged first to give the good news of Allah's Mercy\\n\\t\\t\\t\\tto Abraham in the shape of a long line of Teachers of\\n\\t\\t\\t\\tRighteousness."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "58",
    "NoteID": "1985",
    "Body": "The Cities of the Plain round the Dead Sea, which to this\\n\\t\\t\\t\\tday is called the Bahr Lut. They were given to\\n\\t\\t\\t\\tunspeakable abominations. Read in this connection xi. 77-\\n\\t\\t\\t\\t83 and notes."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "59",
    "NoteID": "1986",
    "Body": "Here, again, Allah's saving Grace is linked with His\\n\\t\\t\\t\\tWrath, and is mentioned first."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "60",
    "NoteID": "1987",
    "Body": "See xi. 81, and n. 1577."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "61",
    "NoteID": "1988",
    "Body": "Al means people who adhere to the ways and teaching of a\\n\\t\\t\\t\\tgreat Teacher; e.g., Al-u-Muhammad: it does not\\n\\t\\t\\t\\tnecessarily mean race or descendants. Ahl (xv. 65 below)\\n\\t\\t\\t\\tusually implies \"household\" but may be taken in an\\n\\t\\t\\t\\textended sense to include People generally, see xv. 67.\\n\\t\\t\\t\\tQaum (xv. 62) may be any collection or aggregate of\\n\\t\\t\\t\\tpeople. In xi. 70 the hostile inhabitants of the Cities\\n\\t\\t\\t\\tof the Plain are called the qaum-u-Lut (the People of\\n\\t\\t\\t\\tLut). Ashab (companions) refers to a Group rather than to\\n\\t\\t\\t\\ta People: Cf. xv; 78."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "63",
    "NoteID": "1989",
    "Body": "The unusual appearance of the angels struck Lot as it had\\n\\t\\t\\t\\tstruck Abraham. Knowing the abominable vices to which the\\n\\t\\t\\t\\tCities were addicted, he feared to entertain handsome\\n\\t\\t\\t\\tyoung men. They at once disclosed their mission to him.\\n\\t\\t\\t\\tIn effect they said: \"You, Lot, have been preaching in\\n\\t\\t\\t\\tvain to these wicked Cities. When you warn them of their\\n\\t\\t\\t\\tinevitable end: Destruction, they laugh and doubt. Now\\n\\t\\t\\t\\ttheir doubt will be resolved. Their destruction will be\\n\\t\\t\\t\\taccomplished before the morning.\""
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "64",
    "NoteID": "1990",
    "Body": "Al-Haqq: the Punishment which is justly and inevitably\\n\\t\\t\\t\\tdue, which must certainly come to pass. Cf. xxii. 18."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "66",
    "NoteID": "1991",
    "Body": "As the last remnants of the wicked were to be cut off,\\n\\t\\t\\t\\tand as the Mercy of Allah wished to save every true soul\\n\\t\\t\\t\\twho might be with Lot, Allah's decree was made known to\\n\\t\\t\\t\\tLot, so that he might save his adherents."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "67",
    "NoteID": "1992",
    "Body": "They were addicted to unnatural crime, and the news of\\n\\t\\t\\t\\tthe advent of handsome youg men inflamed them. How true\\n\\t\\t\\t\\tit is that at the very verge of destruction, men rush\\n\\t\\t\\t\\tblindly to their fate, and cut off any last hope of\\n\\t\\t\\t\\trepentence and mercy for themselves. Cf. xv. 72 below."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "70",
    "NoteID": "1993",
    "Body": "I understand the meaning to be that Lot, the only\\n\\t\\t\\t\\trighteous man in the City, had frequently remonstrated\\n\\t\\t\\t\\twith the inhabitants against their unnatural crimes, and\\n\\t\\t\\t\\tthey had forbidden him to speak to them again on behalf\\n\\t\\t\\t\\tof any one, \"as if\" (they might tauntingly say) \"he was\\n\\t\\t\\t\\tthe protector of all and sundry.\" Some Commentators\\n\\t\\t\\t\\tunderstand the verse to mean: 'Did we not forbid thee to\\n\\t\\t\\t\\tentertain any strangers?'"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "71",
    "NoteID": "1994",
    "Body": "Cf. xi. 78, n. 1575. \"My daughters\" in the mouth of a\\n\\t\\t\\t\\tvenerable man may mean young girls of the City, which\\n\\t\\t\\t\\twould be appropriate considering the large number of men\\n\\t\\t\\t\\twho came to besiege Lot's house."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "72",
    "NoteID": "1995",
    "Body": "The wild, mad fury of passion and sin attains its own\\n\\t\\t\\t\\tdestruction and cuts off the last hope of repentance or\\n\\t\\t\\t\\tmercy."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "73",
    "NoteID": "1996",
    "Body": "As-Saihat, the mighty Blast, is mentioned as accompanying\\n\\t\\t\\t\\tearthquakes: Cf. xi. 67-94. Here it was the violent wind\\n\\t\\t\\t\\tand noise accompanying the shower of brimstones, possibly\\n\\t\\t\\t\\twith some volcanic action."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "74",
    "NoteID": "1997",
    "Body": "Cf. xi. 82 and notes, in which the word Sijjil and its\\n\\t\\t\\t\\torigin are explained."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "76",
    "NoteID": "1998",
    "Body": "The Cities of Sodom and Gomorrah were utterly destroyed,\\n\\t\\t\\t\\tand even their precise position cannot be identified. But\\n\\t\\t\\t\\tthe brimstone plain of the tract still exists, right on\\n\\t\\t\\t\\tthe highway between Arabia and Syria. To the traveller in\\n\\t\\t\\t\\tthe neighbourhood of the Dead Sea the whole locality\\n\\t\\t\\t\\tpresents a scene of dismal desolation which truly\\n\\t\\t\\t\\tsuggests the awful punishment for unspeakable crimes."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "77",
    "NoteID": "1999",
    "Body": "Verse 75 refers to all who have the intelligence to grasp\\n\\t\\t\\t\\tthe Signs of Allah. Verses 76-77 specially refer to those\\n\\t\\t\\t\\twho use the Arabia-Syria highroad. The desolation is\\n\\t\\t\\t\\tspecially brought home to them."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "78",
    "NoteID": "2000",
    "Body": "\"Companions of the Wood\": As-hab ul Aikati. Perhaps Aika\\n\\t\\t\\t\\tis after all a proper noun, the name of a town or tract.\\n\\t\\t\\t\\tWho were the Companions of the Aika? They are mentioned\\n\\t\\t\\t\\tfour times in the Qur-an, viz., here, and in xxvi.\\n\\t\\t\\t\\t176-191; xxxviii. 13; and 1. 14. The only passage in\\n\\t\\t\\t\\twhich any details are given is xxvi. 176-191. There we\\n\\t\\t\\t\\tare told that their Prophet was Shu'aib, and other\\n\\t\\t\\t\\tdetails given correspond to those of the Madyan, to whom\\n\\t\\t\\t\\tShu'aib was sent as Prophet;, see vii. 85-93. In my notes\\n\\t\\t\\t\\tto that passage I have discussed the question of Shu'aib\\n\\t\\t\\t\\tand the Madyan people. It is reasonable to suppose that\\n\\t\\t\\t\\tthe Companions of the Wood were either the same as the\\n\\t\\t\\t\\tMadyan, or a Group among them or in their neighbourhood."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "79",
    "NoteID": "2001",
    "Body": "Both: i.e., The Cities of the Plain and the Companions of\\n\\t\\t\\t\\tthe Aika."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "80",
    "NoteID": "2002",
    "Body": "\"The Rocky Tract\" is undoubtedly a geographical name. On\\n\\t\\t\\t\\tthe maps of Arabia will be found a tract called the Hijr,\\n\\t\\t\\t\\tnorth of Medinah, Jabal Hijr is about 150 miles north of\\n\\t\\t\\t\\tMadinah. The tract would fall on the highway to Syria.\\n\\t\\t\\t\\tThis was the country of the Thamud. For them and the\\n\\t\\t\\t\\tcountry see vii. 73, n. 1043."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "82",
    "NoteID": "2003",
    "Body": "Remains of these rock edifices in the Hijr are still\\n\\t\\t\\t\\tfound, and the City of Petra is not more than 380 miles\\n\\t\\t\\t\\tfrom Jabal Hijr. See n. 1043 to vii. 73. \"Petra\" in Greek\\n\\t\\t\\t\\tmeans \"Rock\". For the Inscriptions found there, and their\\n\\t\\t\\t\\tsignificance, see Appendix IV to S. xxvi."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "83",
    "NoteID": "2004",
    "Body": "The mighty rumbling noise and wind accompanying an\\n\\t\\t\\t\\tearthquake. See vii. 78, n. 1047."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "85",
    "NoteID": "2005",
    "Body": "Allah's Creation is all for a true, just, and righteous\\n\\t\\t\\t\\tpurpose. Cf. x. 5. It is not for mere whim or sport. xxi.\\n\\t\\t\\t\\t16."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "85",
    "NoteID": "2006",
    "Body": "The Hour will not be long delayed when the true Design\\n\\t\\t\\t\\tand Pattern of Life will be manifest. We must not be\\n\\t\\t\\t\\timpatient, if there appear to be, to our limited vision,\\n\\t\\t\\t\\tapparent injustices. We must bear and forbear, and as far\\n\\t\\t\\t\\tas our own personal feelings are concerned, we must\\n\\t\\t\\t\\toverlook other people's faults with \"a gracious\\n\\t\\t\\t\\tforgiveness\"."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "86",
    "NoteID": "2007",
    "Body": "Khallaq: the emphatic intensive form, as meaning the\\n\\t\\t\\t\\tCreator, Who is perfect in His skill and knowledge, and\\n\\t\\t\\t\\tWhose creation answers perfectly to His design. Therefore\\n\\t\\t\\t\\tno one should think that anything has gone wrong in\\n\\t\\t\\t\\tAllah's creation. What may seem out of joint is merely\\n\\t\\t\\t\\tthe result of our short-sighted standards. It often\\n\\t\\t\\t\\thappens that what appears to us to be evil or imperfect\\n\\t\\t\\t\\tor unjust is a reflection of our own imperfect minds. See\\n\\t\\t\\t\\tthe next two verses and notes."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "87",
    "NoteID": "2008",
    "Body": "The Seven Oft-repeated Verses are usually understood to\\n\\t\\t\\t\\tbe the Opening Sura, the Fatiha. They sum up the whole\\n\\t\\t\\t\\tteaching of the Qur-an. What can be a more precious gift\\n\\t\\t\\t\\tto a Muslim than the glorious Qur-an or any Sura of it?\\n\\t\\t\\t\\tWorldly wealth, honour, possessions, or anything else,\\n\\t\\t\\t\\tsinks into insignificance in comparison with it."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "88",
    "NoteID": "2009",
    "Body": "It may be that other people have worldly goods which\\n\\t\\t\\t\\tworldly men envy. Do they necessarily bring happiness?\\n\\t\\t\\t\\tEven the temporary pleasure that they may give is not\\n\\t\\t\\t\\tunmixed with spiritual poisons, and even so, will not\\n\\t\\t\\t\\tlast. The man of God looks with wistful eyes at other\\n\\t\\t\\t\\tthings,-the favour and countenance of Allah."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "88",
    "NoteID": "2010",
    "Body": "The Prophet of Allah, in his human love and sympathy, may\\n\\t\\t\\t\\tgrieve over certain classes of people who are puffed up\\n\\t\\t\\t\\twith false notions and callous to the Message of Allah.\\n\\t\\t\\t\\tBut he should not make himself unhappy. There is no flaw\\n\\t\\t\\t\\tin Allah's Plan, and it must prevail. This was addressed\\n\\t\\t\\t\\tin the first instance to Al-Mustafa, but in a minor\\n\\t\\t\\t\\tdegree, it applies to all righteous men."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "88",
    "NoteID": "2011",
    "Body": "The metaphor is from a bird who lowers her wing in tender\\n\\t\\t\\t\\tsolicitude for her little ones. Cf. xvii. 24, where it is\\n\\t\\t\\t\\tapplied to \"lowering the wing\" to aged parents."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "89",
    "NoteID": "2012",
    "Body": "In the ministry of Al-Mustafa there was no mincing of\\n\\t\\t\\t\\tmatters, no compromises with evil. Evil was denounced in\\n\\t\\t\\t\\tunambiguous terms. Mubin implies both openness and\\n\\t\\t\\t\\tclearness, i.e. freedom from ambiguity."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "90",
    "NoteID": "2013",
    "Body": "The Commentators differ as to the precise signification\\n\\t\\t\\t\\tof verses 90 and 91. Are the persons referred to in the\\n\\t\\t\\t\\ttwo verses the same, or different? And who were they? I\\n\\t\\t\\t\\tadopt the view, for which there is good authority, that\\n\\t\\t\\t\\tthe two classes of persons were different but similar.\\n\\t\\t\\t\\tVerse 90, I think, refers to the Jews and Christians, who\\n\\t\\t\\t\\ttook out of Scripture what suited them, and ignored or\\n\\t\\t\\t\\trejected the rest: ii. 85, 101. For verse 91 see next\\n\\t\\t\\t\\tnote."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "91",
    "NoteID": "2014",
    "Body": "The Makkan Pagans, in the early days of Islam, in order\\n\\t\\t\\t\\tto dishonour and ridicule the Qur-an, divided what was so\\n\\t\\t\\t\\tfar revealed, into bits, and apportioned them to people\\n\\t\\t\\t\\tcoming on pilgrimage to Makkah by different routes,\\n\\t\\t\\t\\tslandering and abusing the Prophet of Allah."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "93",
    "NoteID": "2015",
    "Body": "Those who ridicule Scripture in any form will all be\\n\\t\\t\\t\\tcalled to account for their insolence, for they are all\\n\\t\\t\\t\\talike."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "95",
    "NoteID": "2016",
    "Body": "If the whole world is ranged against the Prophet of\\n\\t\\t\\t\\tAllah, as was at one time the case with the Prophet, and\\n\\t\\t\\t\\tscoffs at all that is sacred, the sense of Allah's\\n\\t\\t\\t\\tpresence and protection outweighs all. And after all, the\\n\\t\\t\\t\\tscoffers are creatures of a day. Soon will they find\\n\\t\\t\\t\\ttheir level, and be undeceived as to all their\\n\\t\\t\\t\\tfalsehoods. But the Truth of Allah endures for ever."
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "97",
    "NoteID": "2017",
    "Body": "Literally, 'that thy breast is constrained.'"
  },
  {
    "SurahNumber": "15",
    "AyahNumber": "99",
    "NoteID": "2018",
    "Body": "Yaqin: Certainty; the Hour that is Certain; death."
  }
]
