[
  {
    "SurahNumber": "70",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Lit., \"An inquirer inquired\" or \"might inquire\"."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "In view of the fact that many of \"those who deny the\\n\\t\\t\\t\\ttruth\" - and, by implication, do evil in consequence of\\n\\t\\t\\t\\tthat deliberate denial - prosper in this world, a doubter\\n\\t\\t\\t\\tmight well ask whether or when this state of affairs will\\n\\t\\t\\t\\treally be reversed and the values adjusted in accord with\\n\\t\\t\\t\\tdivine justice. An answer to the \"whether\" is given in\\n\\t\\t\\t\\tthe second paragraph of verse {2}; and to the \"when\",\\n\\t\\t\\t\\telliptically, at the end of verse {4}."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "Lit., \"He of the [many] ascents\": a metonymical phrase\\n\\t\\t\\t\\timplying that there are many ways by which man can\\n\\t\\t\\t\\t\"ascend\" to a comprehension of God's existence, and thus\\n\\t\\t\\t\\tto spiritual \"nearness\" to Him - and that, therefore, it\\n\\t\\t\\t\\tis up to each human being to avail himself of any of the\\n\\t\\t\\t\\tways leading towards Him (cf.  76:3 )."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "For my rendering of ruh as \"inspiration\", see surah {16},\\n\\t\\t\\t\\tnote [2]. The \"ascent\" of the angels and of all\\n\\t\\t\\t\\tinspiration may be understood in the same sense as the\\n\\t\\t\\t\\tfrequently-occurring phrase \"all things go back to God\\n\\t\\t\\t\\t[as their source]\" (Razi)."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "The very concept of \"time\" is meaningless in relation to\\n\\t\\t\\t\\tGod, who is timeless and infinite: cf. note [63] on the\\n\\t\\t\\t\\tlast sentence of  22:47  - \"in thy Sustainer's sight a\\n\\t\\t\\t\\tday is like a thousand years of your reckoning\": in other\\n\\t\\t\\t\\twords, a day, or an aeon, or a thousand years, or fifty\\n\\t\\t\\t\\tthousand years are alike to Him, having an apparent\\n\\t\\t\\t\\treality only within the created world and none with the\\n\\t\\t\\t\\tCreator. And since in the hereafter time will cease to\\n\\t\\t\\t\\thave a meaning for man as well, it is irrelevant to ask\\n\\t\\t\\t\\tas to \"when\" the evildoers will be chastised and the\\n\\t\\t\\t\\trighteous given their due."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "Lit., \"they\"."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "19",
    "NoteID": "7",
    "Body": "Lit., \"man has been created restless (halu'an)\" - that\\n\\t\\t\\t\\tis, endowed with an inner restlessness which may equally\\n\\t\\t\\t\\twell drive him to fruitful achievement or to chronic\\n\\t\\t\\t\\tdiscontent and frustration. In other words, it is the\\n\\t\\t\\t\\tmanner in which man utilizes this God-willed endowment\\n\\t\\t\\t\\tthat determines whether it shall have a positive or a\\n\\t\\t\\t\\tnegative character. The subsequent two verses ({20} and\\n\\t\\t\\t\\t{21}) allude to the latter, while verses {22-25} show\\n\\t\\t\\t\\tthat only true spiritual and moral consciousness can\\n\\t\\t\\t\\tmould that inborn restlessness into a positive force, and\\n\\t\\t\\t\\tthus bring about inner stability and abiding contentment."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "20",
    "NoteID": "8",
    "Body": "The participle jazu' - derived from the verb jazi'a -\\n\\t\\t\\t\\tcombines the concepts of \"lacking patience\" and\\n\\t\\t\\t\\t\"lamenting over one's misfortune\", and is therefore the\\n\\t\\t\\t\\tcontrary of sabr (Jawhari)."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "22",
    "NoteID": "9",
    "Body": "This, I believe, is the meaning of the expression\\n\\t\\t\\t\\tal-musallin (lit., \"the praying ones\"), which evidently\\n\\t\\t\\t\\tdoes not relate here to the mere ritual of prayer but,\\n\\t\\t\\t\\trather, as the next verse shows, to the attitude of mind\\n\\t\\t\\t\\tand the spiritual need underlying it. In this sense it\\n\\t\\t\\t\\tconnects with the statement in verse {19} that \"man is\\n\\t\\t\\t\\tborn with a restless disposition\" which, when rightly\\n\\t\\t\\t\\tused, leads him towards conscious spiritual growth, as\\n\\t\\t\\t\\twell as to freedom from all self-pity and selfishness."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "25",
    "NoteID": "10",
    "Body": "Sc., \"but do not or cannot beg\": see Razi's comments on a\\n\\t\\t\\t\\tsimilar phrase in  51:19 , quoted in my corresponding\\n\\t\\t\\t\\tnote [12]."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "28",
    "NoteID": "11",
    "Body": "This warning against pharisaic self-righteousness implies\\n\\t\\t\\t\\tthat however \"good\" a person may be, there is always a\\n\\t\\t\\t\\tpossibility of his or her having done a moral wrong\\n\\t\\t\\t\\t(e.g., an injury to a fellow-being) and then conveniently\\n\\t\\t\\t\\t\"forgotten\" this sin. Elliptically, this warning contains\\n\\t\\t\\t\\ta call to increasing consciousness in all one's doings -\\n\\t\\t\\t\\tfor, \"temptation to evil (fitnah) does not befall only\\n\\t\\t\\t\\tthose who are bent on denying the truth\"  8:25 , but may\\n\\t\\t\\t\\talso befall people who are otherwise righteous."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "29",
    "NoteID": "12",
    "Body": "Lit., \"who guard their private parts\"."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "30",
    "NoteID": "13",
    "Body": "See the identical passage in {23:5-7}, as well as the\\n\\t\\t\\t\\tcorresponding note [3], in which I have fully explained\\n\\t\\t\\t\\tthe reasons for my rendering of the phrase aw ma malakat\\n\\t\\t\\t\\taymanuhum as \"that is those whom they rightfully possess\\n\\t\\t\\t\\t[through wedlock]\". As regards this interpretation, see\\n\\t\\t\\t\\talso Razi's comments on  4:24 , as well as one of the\\n\\t\\t\\t\\talternative interpretations of that verse advanced by\\n\\t\\t\\t\\tTabari on the authority of Ibn 'Abbas and Mujahid."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "37",
    "NoteID": "14",
    "Body": "This, again, connects with the statement in verse {19},\\n\\t\\t\\t\\t\"man is born with a restless disposition\" (see note [7]\\n\\t\\t\\t\\tabove). People who do not want to see the truth of God's\\n\\t\\t\\t\\texistence and have, therefore, no solid basis on which to\\n\\t\\t\\t\\tbuild their world-view, are, by the same token, unable to\\n\\t\\t\\t\\tconceive any definite standards of personal and social\\n\\t\\t\\t\\tethics. Hence, whenever they are confronted with anyone's\\n\\t\\t\\t\\tpositive assertion of faith, they \"run about to and fro\"\\n\\t\\t\\t\\tin spiritual confusion, trying, in order to justify\\n\\t\\t\\t\\tthemselves intellectually, to demolish the premises of\\n\\t\\t\\t\\tthat faith by means of many-sided, contradictory\\n\\t\\t\\t\\targuments - an endeavour depicted in the metaphor \"coming\\n\\t\\t\\t\\tupon thee from the right and from the left\"; and since\\n\\t\\t\\t\\tthey derive all their strength from a conformity with\\n\\t\\t\\t\\tshallow mass-opinions, they can do this only \"in crowds\"."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "38",
    "NoteID": "15",
    "Body": "I.e., \"Do they hope to achieve inner peace and fulfilment\\n\\t\\t\\t\\tby 'disproving' another person's faith?\""
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "39",
    "NoteID": "16",
    "Body": "Namely, out of \"dust\", - i.e., out of the same primitive\\n\\t\\t\\t\\torganic and inorganic substances as are found in and on\\n\\t\\t\\t\\tthe earth: the implication being that only spiritual\\n\\t\\t\\t\\tconsciousness and endeavour can raise man above the mere\\n\\t\\t\\t\\tmaterial form of his existence, and thus enable him to\\n\\t\\t\\t\\tachieve the inner fulfilment metaphorically described\\n\\t\\t\\t\\there as \"a garden of bliss\"."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "40",
    "NoteID": "17",
    "Body": "I.e., of all the variation, throughout the solar year, of\\n\\t\\t\\t\\tthe points at which the sun \"rises\" and \"sets\": thus\\n\\t\\t\\t\\tstressing the fact that He is the Ultimate Cause of all\\n\\t\\t\\t\\torbital movement in the universe and, hence, its Creator\\n\\t\\t\\t\\t(cf.  37:5  and  55:17 )."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "41",
    "NoteID": "18",
    "Body": "The implication is that it is not His will to replace\\n\\t\\t\\t\\t\"those who are bent on denying the truth\" in this world,\\n\\t\\t\\t\\tby believers, inasmuch as such a \"replacement\" would not\\n\\t\\t\\t\\tbe in accord with His design of multiform human\\n\\t\\t\\t\\texistence, in which faith is always challenged and tested\\n\\t\\t\\t\\tby unbelief, and vice versa."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "42",
    "NoteID": "19",
    "Body": "I.e., their philosophising about a supposedly \"uncreated\"\\n\\t\\t\\t\\tworld and a hypothetical \"self-generation\" of life, as\\n\\t\\t\\t\\twell as their blatant \"denial\", unsupported by any\\n\\t\\t\\t\\tfactual evidence, of a life after death or even of the\\n\\t\\t\\t\\texistence of God."
  },
  {
    "SurahNumber": "70",
    "AyahNumber": "44",
    "NoteID": "20",
    "Body": "The concept of \"again and again\" - i.e., by a succession,\\n\\t\\t\\t\\tthrough the ages, of prophetic revelations - is implied\\n\\t\\t\\t\\tin the auxiliary verb kanu, which usually connotes\\n\\t\\t\\t\\trepetition and/or duration."
  }
]
