[
  {
    "SurahNumber": "12",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "See Appendix II."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "The participial adjective mubin may denote an attribute\\n\\t\\t\\t\\tof the noun which it qualifies (\"clear\", \"manifest\",\\n\\t\\t\\t\\t\"obvious\", etc.) as well as its function (\"making clear\"\\n\\t\\t\\t\\tor \"manifesting\", i.e. the truth), either of which\\n\\t\\t\\t\\tmeanings is dictated by its context. In the consensus of\\n\\t\\t\\t\\tauthoritative opinion, both these meanings are comprised\\n\\t\\t\\t\\tin the above instance; consequently, a compound phrase is\\n\\t\\t\\t\\tnecessary in order to render the term appropriately."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "This, according to Zamakhshari, is the meaning of\\n\\t\\t\\t\\tla'allakum ta'qilun in the above context. Although they\\n\\t\\t\\t\\twere in the first instance addressed to the Arabian\\n\\t\\t\\t\\tcontemporaries of the Prophet, these two verses apply to\\n\\t\\t\\t\\tall people, whatever their origin, who understand the\\n\\t\\t\\t\\tArabic language. They are meant to impress upon everyone\\n\\t\\t\\t\\twho listens to or reads the Qur'an that its appeal is\\n\\t\\t\\t\\tdirected, primarily, to man's reason, and that \"feeling\"\\n\\t\\t\\t\\talone can never provide a sufficient basis of faith. (See\\n\\t\\t\\t\\talso  13:37  and  14:4 , as well as the corresponding\\n\\t\\t\\t\\tnotes.)"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "Or: \"By Our having revealed\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "3",
    "NoteID": "5",
    "Body": "Lit., \"with the best explanation (ahsan al-iqtisas)\".\\n\\t\\t\\t\\tThis rendering is very close to the interpretation given\\n\\t\\t\\t\\tby Zamakhshari: \"We set forth this Qur'an unto thee in\\n\\t\\t\\t\\tthe best way in which it could be set forth.\" According\\n\\t\\t\\t\\tto Razi, it may safely be assumed that the adjective\\n\\t\\t\\t\\t\"best\" refers not to the contents of \"that which is set\\n\\t\\t\\t\\tforth\" - i.e., the particular story narrated in this\\n\\t\\t\\t\\tsurah - but rather to the manner in which the Qur'an (or\\n\\t\\t\\t\\tthis particular surah) is set forth: and herein he agrees\\n\\t\\t\\t\\twith Zamakhshari. It should be borne in mind that the\\n\\t\\t\\t\\tverb qassa (the infinitive nouns of which are qasas and\\n\\t\\t\\t\\tiqtisas) signifies, primarily, \"he followed step by step\"\\n\\t\\t\\t\\tor \"by degrees\", and, subsequently, \"he related [a piece\\n\\t\\t\\t\\tof news or a story] as though he followed its traces\":\\n\\t\\t\\t\\thence, \"he expounded [it] gradually\" or \"he explained\\n\\t\\t\\t\\t[it]\" (cf. Lane VII, 2526, quoting the Qamus and the Taj\\n\\t\\t\\t\\tal-'Arus with specific reference to the above verse). If,\\n\\t\\t\\t\\ton the other hand, the infinitive noun qasas is regarded\\n\\t\\t\\t\\tas synonymous, in this context, with qissah (\"story\" or\\n\\t\\t\\t\\t\"narrative\"), the above sentence might be rendered as \"We\\n\\t\\t\\t\\tnarrate unto thee the best of narratives\", i.e., the\\n\\t\\t\\t\\tsubsequent story of Joseph. In my opinion, however, the\\n\\t\\t\\t\\trendering \"We explain it [i.e., the Qur'an] in the best\\n\\t\\t\\t\\tpossible way\" is preferable inasmuch as it fully\\n\\t\\t\\t\\tcoincides with the two opening verses of this surah,\\n\\t\\t\\t\\twhich state, in effect, that the Qur'an is\\n\\t\\t\\t\\tself-explanatory."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "3",
    "NoteID": "6",
    "Body": "At this point in his commentary, Razi draws the reader's\\n\\t\\t\\t\\tattention to  42:52  \"thou didst not know what revelation\\n\\t\\t\\t\\tis, nor what faith [implies]\": a passage similar in\\n\\t\\t\\t\\tpurport to the closing words of the above verse: hence my\\n\\t\\t\\t\\taddition, between brackets, of the phrase \"of what\\n\\t\\t\\t\\trevelation is\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "4",
    "NoteID": "7",
    "Body": "The particle idh is usually a time-reference, and can in\\n\\t\\t\\t\\tmost cases be translated as \"when\". Occasionally,\\n\\t\\t\\t\\thowever, it is used as a corroborative particle meant to\\n\\t\\t\\t\\tdraw the reader's (or hearer's) attention to the sudden\\n\\t\\t\\t\\toccurrence of a thing (Mughni, Qamus, Taj al-'Arus),\\n\\t\\t\\t\\tor-as is often the case in the Qur'an-to a turn in the\\n\\t\\t\\t\\tdiscourse: and in such instances it is suitably rendered\\n\\t\\t\\t\\tas \"lo\" or \"now\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "5",
    "NoteID": "8",
    "Body": "See surah {11}, note [65]."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "5",
    "NoteID": "9",
    "Body": "As in the Biblical account of Joseph's story, the Qur'an\\n\\t\\t\\t\\tshows that Jacob did not fail to understand the meaning\\n\\t\\t\\t\\tof his son's dream-vision of future greatness, with the\\n\\t\\t\\t\\televen stars symbolizing his brothers, and the sun and\\n\\t\\t\\t\\tthe moon his parents. But whereas the Bible quotes the\\n\\t\\t\\t\\tfather as \"rebuking\" his son (Genesis xxxvii, 10) in the\\n\\t\\t\\t\\tobvious assumption that the dream was an outcome of\\n\\t\\t\\t\\twishful thinking, the Qur'an makes it clear that Jacob -\\n\\t\\t\\t\\twho was himself a prophet - at once realized its\\n\\t\\t\\t\\tprophetic quality and its deeper implications."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "6",
    "NoteID": "10",
    "Body": "Lit., \"sayings\" or \"tidings\" (ahadith). Most of the\\n\\t\\t\\t\\tcommentators assume that this refers specifically to\\n\\t\\t\\t\\tJoseph's future ability to interpret dreams; but Razi\\n\\t\\t\\t\\tpoints out that in this context the term hadith (of which\\n\\t\\t\\t\\tahadith is the plural) may be synonymous with hadith\\n\\t\\t\\t\\t(\"something that newly comes into existence\", i.e., \"an\\n\\t\\t\\t\\tevent\" or \"a happening\"). This is, to my mind, much more\\n\\t\\t\\t\\tconvincing than a mere reference to dream-interpretation,\\n\\t\\t\\t\\tthe more so as the term ta'wil is often used in the\\n\\t\\t\\t\\tQur'an (e.g., in  3:7 ,  10:39  or  18:78 ) in the sense\\n\\t\\t\\t\\tof \"final meaning\", \"inner meaning\" or \"real meaning\" of\\n\\t\\t\\t\\ta happening or statement or thing, as distinct from its\\n\\t\\t\\t\\toutward, prima-facie appearance. The use of the particle\\n\\t\\t\\t\\tmin (\"of\") before the term ta'wil indicates that absolute\\n\\t\\t\\t\\tknowledge of what a thing or event implies rests with God\\n\\t\\t\\t\\talone (cf.  3:7  - \"none save God knows its final\\n\\t\\t\\t\\tmeaning\"), and that even God's elect, the prophets -\\n\\t\\t\\t\\talbeit their vision is much wider than that of ordinary\\n\\t\\t\\t\\tmen - are granted only a partial insight into the\\n\\t\\t\\t\\tmysteries of God's creation."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "7",
    "NoteID": "11",
    "Body": "Lit., \"those who inquire\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "8",
    "NoteID": "12",
    "Body": "Lit., \"a company\" or \"group\". Benjamin was Joseph's full\\n\\t\\t\\t\\tbrother - both being sons of Jacob's wife Rachel - whereas\\n\\t\\t\\t\\tthe other ten were only his half-brothers."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "8",
    "NoteID": "13",
    "Body": "Lit., \"is in most obvious error\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "9",
    "NoteID": "14",
    "Body": "The phrase interpolated by me within brackets -\\n\\t\\t\\t\\treflecting the unconscious irony in the attitude of\\n\\t\\t\\t\\tJoseph's brethren - is based on the consensus of most of\\n\\t\\t\\t\\tthe classical commentators."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "10",
    "NoteID": "15",
    "Body": "Sc., \"and take him with them to a faraway land\" (cf. the\\n\\t\\t\\t\\tpreceding verse). The term jubb - rendered by me as\\n\\t\\t\\t\\t\"well\" - is usually applied to a desert well simply cut\\n\\t\\t\\t\\tthrough the earth or through rock and not cased with\\n\\t\\t\\t\\tstone: the implication being that this particular well\\n\\t\\t\\t\\tdid not contain enough water to drown Joseph, but was\\n\\t\\t\\t\\tdeep enough to hide him from sight."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "15",
    "NoteID": "16",
    "Body": "See verses {89-90} of this surah."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "18",
    "NoteID": "17",
    "Body": "Apparently Jacob did not believe the tale of the wolf\\n\\t\\t\\t\\tbut, knowing his sons' envy of Joseph, at once realized\\n\\t\\t\\t\\tthat it was they themselves who had done grievous harm to\\n\\t\\t\\t\\thim. Nevertheless - as is evident from Jacob's expression\\n\\t\\t\\t\\tof hope in verse {83} of this surah - he was not quite\\n\\t\\t\\t\\tconvinced that Joseph was really dead."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "18",
    "NoteID": "18",
    "Body": "Lit., \"it is to God that I turn for aid against what you\\n\\t\\t\\t\\tare describing\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "19",
    "NoteID": "19",
    "Body": "According to the Bible (Genesis xxxvii, 25), they were\\n\\t\\t\\t\\t\"Ishmaelites\" - i.e., Arabs - who \"came from Gilead with\\n\\t\\t\\t\\ttheir camels bearing spicery and balm and myrrh, going to\\n\\t\\t\\t\\tcarry it down to Egypt\". (Gilead is the Biblical name for\\n\\t\\t\\t\\tthe region east of the Jordan.)"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "19",
    "NoteID": "20",
    "Body": "Lit., \"O good news!\""
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "21",
    "NoteID": "21",
    "Body": "The Qur'an does not mention his name or position; but a\\n\\t\\t\\t\\tlater reference to him (in verse {30} below) as al-'aziz\\n\\t\\t\\t\\t(\"the great [or \"mighty\"] one\") points to his having been\\n\\t\\t\\t\\ta high official or a nobleman."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "21",
    "NoteID": "22",
    "Body": "See note [10] above."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "24",
    "NoteID": "23",
    "Body": "The interpolated phrase \"and he would have succumbed\",\\n\\t\\t\\t\\tis, according to Zamakhshari, implied in the above\\n\\t\\t\\t\\tsentence. In his commentary on this verse, he further\\n\\t\\t\\t\\tpoints out that the moral significance of \"virtue\"\\n\\t\\t\\t\\tconsists in one's inner victory over a wrongful desire,\\n\\t\\t\\t\\tand not in the absence of such a desire. Cf. the\\n\\t\\t\\t\\twell-known saying of the Prophet, recorded, on the\\n\\t\\t\\t\\tauthority of Abu Hurayrah, by Bukhari and Muslim: \"God,\\n\\t\\t\\t\\texalted be He, says: 'If a servant of Mine [merely]\\n\\t\\t\\t\\tdesires to do a good deed, I shall count this [desire] as\\n\\t\\t\\t\\ta good deed; and if he does it, I shall count it tenfold.\\n\\t\\t\\t\\tAnd if he desires to commit a bad deed, but does not\\n\\t\\t\\t\\tcommit it, I shall count this as a good deed, seeing that\\n\\t\\t\\t\\the refrained from it only for My sake...'\" - i.e., in\\n\\t\\t\\t\\tconsequence of a moral consideration (which, in the\\n\\t\\t\\t\\tpresent instance, is described as \"an evidence of God's\\n\\t\\t\\t\\ttruth\")."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "24",
    "NoteID": "24",
    "Body": "Lit., \"he was among Our sincere servants\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "26",
    "NoteID": "25",
    "Body": "Lit., \"a present one (shahid) from her household\\n\\t\\t\\t\\ttestified\" - i.e., suggested a test on these lines. Here,\\n\\t\\t\\t\\tagain, the Qur'anic narrative differs from the story as\\n\\t\\t\\t\\ttold in the Bible, since according to the latter (Genesis\\n\\t\\t\\t\\txxxix, 19-20), the husband immediately believed the false\\n\\t\\t\\t\\taccusation and cast Joseph into prison; the episodes\\n\\t\\t\\t\\trelated in verses {26-34} of this surah do not appear in\\n\\t\\t\\t\\tthe Biblical account."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "29",
    "NoteID": "26",
    "Body": "Lit., \"turn aside from this\". According to almost all the\\n\\t\\t\\t\\tcommentators, the meaning is, \"do not mention this to\\n\\t\\t\\t\\tanyone\", the implication being that the husband was\\n\\t\\t\\t\\tprepared to forgive and forget."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "30",
    "NoteID": "27",
    "Body": "Lit., \"we see her indeed in obvious error\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "31",
    "NoteID": "28",
    "Body": "The expression muttaka'- lit., \"a place where one\\n\\t\\t\\t\\treclines [while eating]\", i.e., a \"cushioned couch\" -\\n\\t\\t\\t\\tseems to have been used here tropically to denote a\\n\\t\\t\\t\\t\"luxurious [or \"sumptuous\"] repast\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "31",
    "NoteID": "29",
    "Body": "Lit., \"they deemed him [i.e.. his beauty] great\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "32",
    "NoteID": "30",
    "Body": "Lit., \"become one of those who are humiliated\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "33",
    "NoteID": "31",
    "Body": "Lit., \"incline towards them\", it should, however, be\\n\\t\\t\\t\\tborne in mind that the verb saba combines the concepts of\\n\\t\\t\\t\\tinclination, yearning and amorous indulgence (cf. Lane\\n\\t\\t\\t\\tIV, 1649); hence my rendering."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "34",
    "NoteID": "32",
    "Body": "Lit., \"turned away their guile from him\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "35",
    "NoteID": "33",
    "Body": "Lit., \"it occurred to them'."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "35",
    "NoteID": "34",
    "Body": "Thus, according to the Qur'an, Joseph was imprisoned not\\n\\t\\t\\t\\tbecause his master believed him to be guilty, but\\n\\t\\t\\t\\tbecause, in his weakness, he wanted to appease his wife,\\n\\t\\t\\t\\t\"being entirely submissive to her, and behaving like a\\n\\t\\t\\t\\triding-camel whose reins she held in her hand\"\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "36",
    "NoteID": "35",
    "Body": "Lit., \"entered the prison with him\". According to the\\n\\t\\t\\t\\tBiblical account (not contradicted by the Qur'an), they\\n\\t\\t\\t\\twere the King's cup-bearer and baker, both of them\\n\\t\\t\\t\\timprisoned for unspecified offences."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "36",
    "NoteID": "36",
    "Body": "This is the meaning given by Baghawi, Zamakhshari and\\n\\t\\t\\t\\tBaydawi to the expression al-muhsinin in the above\\n\\t\\t\\t\\tcontext, adopting the tropical use of the verb ahsana in\\n\\t\\t\\t\\tthe sense of \"he knew [something]\" or \"he knew [it]\\n\\t\\t\\t\\twell\". Thus, the Qur'an indicates here in its elliptic\\n\\t\\t\\t\\tmanner that Joseph's reputation for wisdom and\\n\\t\\t\\t\\tdream-interpretation preceded him to prison."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "37",
    "NoteID": "37",
    "Body": "Lit., \"the real meaning thereof\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "37",
    "NoteID": "38",
    "Body": "Joseph wants to avail himself of this opportunity to\\n\\t\\t\\t\\tguide his two fellow-prisoners towards the true faith;\\n\\t\\t\\t\\tand so, while promising that he would explain their\\n\\t\\t\\t\\tdreams presently, he asks them to listen first to a short\\n\\t\\t\\t\\tdiscourse on the oneness of God."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "38",
    "NoteID": "39",
    "Body": "Since God is almighty and self-sufficient, it is not for\\n\\t\\t\\t\\tHis sake that man is warned not to ascribe divine\\n\\t\\t\\t\\tqualities to aught beside Him: the absolute condemnation\\n\\t\\t\\t\\tof this sin is solely designed to benefit man by freeing\\n\\t\\t\\t\\thim from all superstition, and thus enhancing his dignity\\n\\t\\t\\t\\tas a conscious, rational being."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "39",
    "NoteID": "40",
    "Body": "Lit., \"better\", obviously in the sense of \"better\\n\\t\\t\\t\\tconforming to the demands of reason\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "39",
    "NoteID": "41",
    "Body": "The expression mutafarriqun connotes plurality as well as\\n\\t\\t\\t\\tseparateness-in this context, separateness in respect of\\n\\t\\t\\t\\tqualities, functions and degrees."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "40",
    "NoteID": "42",
    "Body": "Lit., \"names which you have named\" - i.e., \"figments of\\n\\t\\t\\t\\tyour own imagination\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "40",
    "NoteID": "43",
    "Body": "Cf. the last sentence of  30:30 ."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "43",
    "NoteID": "44",
    "Body": "This king seems to have been one of the six Hyksos rulers\\n\\t\\t\\t\\twho dominated Egypt from about 1700 to 1580 B.C., after\\n\\t\\t\\t\\thaving invaded the country from the east by way of the\\n\\t\\t\\t\\tSinai Peninsula. The name of this dynasty, which was\\n\\t\\t\\t\\tundoubtedly of foreign origin, is derived from the\\n\\t\\t\\t\\tEgyptian hiq shasu or heku shoswet, meaning \"rulers of\\n\\t\\t\\t\\tnomad lands\", or - according to the late Egyptian\\n\\t\\t\\t\\thistorian Manetho - \"shepherd kings\": all of which points\\n\\t\\t\\t\\tto their having been Arabs who, despite the fact that\\n\\t\\t\\t\\tbefore their invasion of Egypt they were already\\n\\t\\t\\t\\twell-established in Syria, had to a large extent\\n\\t\\t\\t\\tpreserved their bedouin mode of life. This would explain\\n\\t\\t\\t\\tthe confidence which the king mentioned in this story was\\n\\t\\t\\t\\tlater to place in Joseph, the Hebrew, and the subsequent\\n\\t\\t\\t\\tsettlement of the latter's family (and, thus, of what in\\n\\t\\t\\t\\tdue course became the Israelite nation) in Egypt: for it\\n\\t\\t\\t\\tmust be borne in mind that the Hebrews, too, descended\\n\\t\\t\\t\\tfrom one of the many bedouin tribes who some centuries\\n\\t\\t\\t\\tearlier had migrated from the Arabian Peninsula to\\n\\t\\t\\t\\tMesopotamia and later to Syria (cf. surah {7}, note\\n\\t\\t\\t\\t[48]); and that the language of the Hyksos must have been\\n\\t\\t\\t\\tvery akin to Hebrew, which, after all, is but an ancient\\n\\t\\t\\t\\tArabian dialect."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "44",
    "NoteID": "45",
    "Body": "Lit., \"confusing medleys (adghath) of dreams\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "45",
    "NoteID": "46",
    "Body": "According to almost all the authorities, the noun ummah\\n\\t\\t\\t\\tdenotes here \"a time\" or \"a long period of time\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "45",
    "NoteID": "47",
    "Body": "The cup-bearer obviously addresses the assembly as a\\n\\t\\t\\t\\twhole, and not the King alone: hence the plural \"you\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "49",
    "NoteID": "48",
    "Body": "Or: \"will be granted rain\" - depending on whether one\\n\\t\\t\\t\\tconnects the verbal form yughath with either of the\\n\\t\\t\\t\\tinfinitive nouns ghayth (\"rain\") or ghawth (\"deliverance\\n\\t\\t\\t\\tfrom distress\"). Although the crops of Egypt depend\\n\\t\\t\\t\\tentirely on the annual Nile floods, the water-level of\\n\\t\\t\\t\\tthe river is, in its turn, contingent upon the quantity\\n\\t\\t\\t\\tof rainfall at its upper reaches."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "51",
    "NoteID": "49",
    "Body": "Evidently, the King wanted to find out whether they had\\n\\t\\t\\t\\tpreviously been encouraged by Joseph, or whether he was\\n\\t\\t\\t\\ttruly innocent. The noun khatb denotes \"something that\\n\\t\\t\\t\\tone has in view\" or \"desires\" or \"seeks to obtain\"; and\\n\\t\\t\\t\\tso the expression ma khatbukunna (lit., \"what was it that\\n\\t\\t\\t\\tyou [really] had in view\") may be suitably rendered as\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "51",
    "NoteID": "50",
    "Body": "Lit., \"the wife of the great one (al-'aziz)\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "52",
    "NoteID": "51",
    "Body": "Some of the commentators (e.g., Ibn Kathir and, among the\\n\\t\\t\\t\\tmoderns, Rashid Rida' in Manar XII, 323 f.) regard this\\n\\t\\t\\t\\tand the next verse as a continuation of the woman's\\n\\t\\t\\t\\tconfession; but the great majority of the classical\\n\\t\\t\\t\\tauthorities, including Tabari, Baghawi and Zamakhshari\\n\\t\\t\\t\\tattribute the speech that follows unequivocally - and, in\\n\\t\\t\\t\\tmy opinion, most convincingly - to Joseph: hence my\\n\\t\\t\\t\\tinterpolation at the beginning of this verse."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "52",
    "NoteID": "52",
    "Body": "Lit., \"in [his] absence\" or \"in secret\" (bi'l-ghayb)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "53",
    "NoteID": "53",
    "Body": "Lit., \"is indeed wont to command [the doing of] evil\" -\\n\\t\\t\\t\\ti.e., is filled with impulses which often conflict with\\n\\t\\t\\t\\twhat the mind regards as a moral good. This is obviously\\n\\t\\t\\t\\ta reference to the statement in verse {24} above - \"she\\n\\t\\t\\t\\tdesired him, and he desired her; [and he would have\\n\\t\\t\\t\\tsuccumbed,] had he not seen [in this temptation] an\\n\\t\\t\\t\\tevidence of his Sustainer's truth\" - as well as to\\n\\t\\t\\t\\tJoseph's prayer in verse {33}, \"unless Thou turn away\\n\\t\\t\\t\\ttheir guile from me, I might yet yield to their allure\".\\n\\t\\t\\t\\t(See also note [23] above.) Joseph's stress on the\\n\\t\\t\\t\\tweakness inherent in human nature is a sublime expression\\n\\t\\t\\t\\tof humility on the part of one who himself had overcome\\n\\t\\t\\t\\tthat very weakness: for, as the sequence shows, he\\n\\t\\t\\t\\tattributes his moral victory not to himself but solely to\\n\\t\\t\\t\\tthe grace and mercy of God."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "53",
    "NoteID": "54",
    "Body": "Lit., \"except those upon whom...\", etc. According to most\\n\\t\\t\\t\\tof the commentators, the pronoun ma (lit., \"that which\")\\n\\t\\t\\t\\tis here synonymous with man (\"he who\" or \"those who\")."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "55",
    "NoteID": "55",
    "Body": "By making this request, Joseph wanted to assure an\\n\\t\\t\\t\\tefficient build-up of grain reserves during the coming\\n\\t\\t\\t\\tyears of plenty, knowing well that they would be followed\\n\\t\\t\\t\\tby seven years of scarcity. It is obvious from the\\n\\t\\t\\t\\tsequence that his request was granted, and that he was\\n\\t\\t\\t\\table to fulfil the task which he had set himself."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "56",
    "NoteID": "56",
    "Body": "I.e., sometimes in this world as well, but invariably in\\n\\t\\t\\t\\tthe hereafter, as the sequence shows."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "57",
    "NoteID": "57",
    "Body": "Lit., \"for those who have attained to faith...\", etc."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "58",
    "NoteID": "58",
    "Body": "I.e., to buy wheat from the stores which Joseph had\\n\\t\\t\\t\\taccumulated during the seven years of plenty: for all the\\n\\t\\t\\t\\tcountries in the vicinity of Egypt were by now affected\\n\\t\\t\\t\\tby the famine which he had predicted, and Egypt alone had\\n\\t\\t\\t\\ta surplus, the distribution of which he supervised\\n\\t\\t\\t\\tpersonally (cf. Genesis xli, 54-57)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "59",
    "NoteID": "59",
    "Body": "Lit., \"a brother of yours from your father\" - i.e., their\\n\\t\\t\\t\\thalf-brother Benjamin, who was Joseph's full brother\\n\\t\\t\\t\\t(their mother having been Rachel, Jacob's favourite\\n\\t\\t\\t\\twife), whereas the other ten had different mothers.\\n\\t\\t\\t\\tBenjamin, the youngest of Jacob's children, had not\\n\\t\\t\\t\\taccompanied his brothers on their first journey to Egypt,\\n\\t\\t\\t\\tbut they had presumably mentioned him in the course of\\n\\t\\t\\t\\ttheir conversation with Joseph."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "62",
    "NoteID": "60",
    "Body": "I.e., the goods which they had bartered for wheat (Ibn\\n\\t\\t\\t\\tKathir): a very plausible explanation in view of the fact\\n\\t\\t\\t\\tthat barter was the most common form of trade in those\\n\\t\\t\\t\\tancient times."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "62",
    "NoteID": "61",
    "Body": "Lit., \"so that they may perceive them when they come back\\n\\t\\t\\t\\tto their family, [and] that they may return\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "63",
    "NoteID": "62",
    "Body": "Lit., \"measure [of grain]\", here used metonymically in an\\n\\t\\t\\t\\tallusion to Joseph's words (verse {60})."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "64",
    "NoteID": "63",
    "Body": "Lit., \"not otherwise than\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "65",
    "NoteID": "64",
    "Body": "It would seem that Joseph used to allot to foreign buyers\\n\\t\\t\\t\\tof grain one camel-load per person."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "67",
    "NoteID": "65",
    "Body": "Probably in order not to attract undue attention in the\\n\\t\\t\\t\\tforeign land and possibly fall prey to intrigues. See in\\n\\t\\t\\t\\tthis connection note [68] below."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "68",
    "NoteID": "66",
    "Body": "Lit., \"when\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "68",
    "NoteID": "67",
    "Body": "As is shown in the sequence, they and their father were\\n\\t\\t\\t\\tto suffer severe distress before their adventures came to\\n\\t\\t\\t\\ta happy conclusion."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "68",
    "NoteID": "68",
    "Body": "Lit., \"it [i.e., his request that they should enter the\\n\\t\\t\\t\\tcity by different gates] had been but a desire in Jacob's\\n\\t\\t\\t\\theart (nafs), which he [thus] satisfied\". In other words,\\n\\t\\t\\t\\twhen he gave his sons this advice, he followed only an\\n\\t\\t\\t\\tinstinctive, humanly-understandable urge, and did not\\n\\t\\t\\t\\treally expect that any outward precaution would by itself\\n\\t\\t\\t\\thelp them: for, as he himself pointed out on parting,\\n\\t\\t\\t\\t\"judgment as to what is to happen rests with none but\\n\\t\\t\\t\\tGod\". This stress on man's utter dependence on God - a\\n\\t\\t\\t\\tfundamental tenet of Islam - explains why Jacob's advice\\n\\t\\t\\t\\t(which in itself is not relevant to the story) has been\\n\\t\\t\\t\\tmentioned in the above Qur'anic narrative."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "68",
    "NoteID": "69",
    "Body": "This interpolated clause is based on Zamakhshari's\\n\\t\\t\\t\\tinterpretation of the above reference to Jacob's having\\n\\t\\t\\t\\tbeen \"endowed with knowledge\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "69",
    "NoteID": "70",
    "Body": "Thus, contrary to the Biblical account, Joseph is stated\\n\\t\\t\\t\\there to have disclosed his identity to Benjamin long\\n\\t\\t\\t\\tbefore he revealed himself to his ten half-brothers. The\\n\\t\\t\\t\\twords \"their past doings\" obviously refer to their\\n\\t\\t\\t\\ttreacherous behaviour towards himself which Joseph had\\n\\t\\t\\t\\tnow presumably disclosed to Benjamin."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "70",
    "NoteID": "71",
    "Body": "Lit.. \"an announcer\" (mu'adhdhin) - a noun derived from\\n\\t\\t\\t\\tthe verbal form adhdhana(\"he announced\" or \"proclaimed\"\\n\\t\\t\\t\\tor \"called out publicly\")."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "70",
    "NoteID": "72",
    "Body": "Commenting on this verse, Razi says: \"Nowhere in the\\n\\t\\t\\t\\tQur'an is it stated that they made this accusation on\\n\\t\\t\\t\\tJoseph's orders; the circumstantial evidence shows rather\\n\\t\\t\\t\\t(al-aqrab ila zahir al-hal) that they did this of their\\n\\t\\t\\t\\town accord: for, when they had missed the drinking-cup,\\n\\t\\t\\t\\t[these servants of Joseph remembered that] nobody had\\n\\t\\t\\t\\tbeen near it [except the sons of Jacob], and so it\\n\\t\\t\\t\\toccurred to them that it was they who had taken it.\"\\n\\t\\t\\t\\tAnalogous views are also advanced by Tabari and\\n\\t\\t\\t\\tZamakhshari in their comments on the last words of verse\\n\\t\\t\\t\\t{76} below. This extremely plausible explanation\\n\\t\\t\\t\\tcontrasts sharply with the Biblical account of this\\n\\t\\t\\t\\tincident (Genesis xliv), according to which the false\\n\\t\\t\\t\\taccusation was part of an inexplicable \"stratagem\"\\n\\t\\t\\t\\tdevised by Joseph. If we discard - as we must - this part\\n\\t\\t\\t\\tof the Biblical version, it is far more logical to assume\\n\\t\\t\\t\\tthat Joseph who had been granted by the King full\\n\\t\\t\\t\\tauthority over all that belonged to the latter (see verse\\n\\t\\t\\t\\t{56} above), had placed the royal cup as a present in the\\n\\t\\t\\t\\tbag of his favourite brother; and that he did this\\n\\t\\t\\t\\tsecretly, without informing his servants, because he did\\n\\t\\t\\t\\tnot want anyone, least of all his ten half-brothers, to\\n\\t\\t\\t\\tknow his predilection for Benjamin. For a further\\n\\t\\t\\t\\texplanation of this incident and of its ethical relevance\\n\\t\\t\\t\\twithin the context of Joseph's story, see note [77]\\n\\t\\t\\t\\tbelow."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "71",
    "NoteID": "73",
    "Body": "Lit.. \"They said. turning towards them\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "75",
    "NoteID": "74",
    "Body": "Most of the commentators (relying, perhaps on Exodus\\n\\t\\t\\t\\txxii, 3) assume that this was the customary punishment\\n\\t\\t\\t\\tfor theft among the ancient Hebrews. Razi, however,\\n\\t\\t\\t\\tsuggests that this last sentence may not be a part of the\\n\\t\\t\\t\\tbrothers' answer but a confirmatory remark made by the\\n\\t\\t\\t\\tEgyptian herald, meaning, \"[In fact,] thus do we\\n\\t\\t\\t\\t[Egyptians] requite the doers of such wrong\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "76",
    "NoteID": "75",
    "Body": "Lit., \"with their bags\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "76",
    "NoteID": "76",
    "Body": "Lit., \"he brought it out\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "76",
    "NoteID": "77",
    "Body": "The meaning of this story is now clear: it is a further\\n\\t\\t\\t\\tillustration of the basic doctrine that \"judgment [as to\\n\\t\\t\\t\\twhat is to happen] rests with none but God\" (verse {67}\\n\\t\\t\\t\\tabove). Joseph had wanted to keep Benjamin with himself,\\n\\t\\t\\t\\tbut under the law of Egypt he could not do this without\\n\\t\\t\\t\\tthe consent of his half-brothers, who were the legal\\n\\t\\t\\t\\tguardians of their minor brother; and they - bound as\\n\\t\\t\\t\\tthey were by the solemn promise given to their father -\\n\\t\\t\\t\\twould certainly not have agreed to Benjamin's remaining\\n\\t\\t\\t\\tbehind. The only other alternative open to Joseph was to\\n\\t\\t\\t\\tdisclose his identity to them; but since he was not yet\\n\\t\\t\\t\\tprepared to go so far, he was obliged to allow Benjamin\\n\\t\\t\\t\\tto depart with his brothers. The accidental discovery of\\n\\t\\t\\t\\this gift, entirely unexpected by Joseph (see note [72]\\n\\t\\t\\t\\tabove), changed everything: for now Benjamin appeared to\\n\\t\\t\\t\\tbe guilty of theft, and under the law of the land Joseph\\n\\t\\t\\t\\twas entitled to claim him as his slave, and thus to keep\\n\\t\\t\\t\\thim in his house. The words, \"In this way did We contrive\\n\\t\\t\\t\\t(kidna) for Joseph [the attainment of his heart's\\n\\t\\t\\t\\tdesire]\", referring to the incident of the cup, indicate\\n\\t\\t\\t\\tthat its final outcome was neither planned nor even\\n\\t\\t\\t\\tforeseen by Joseph."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "77",
    "NoteID": "78",
    "Body": "The reference is obviously to Benjamin's full brother,\\n\\t\\t\\t\\tJoseph. In the absence of any indication that the latter\\n\\t\\t\\t\\thad ever before been accused of theft, it is reasonable\\n\\t\\t\\t\\tto assume that the brothers, unaware of the fact that\\n\\t\\t\\t\\tthey were standing before Joseph, simply wanted to vilify\\n\\t\\t\\t\\thim in order to dissociate themselves more effectively\\n\\t\\t\\t\\tfrom Benjamin, who now appeared to have been convicted of\\n\\t\\t\\t\\ttheft."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "77",
    "NoteID": "79",
    "Body": "Lit., \"Joseph concealed it within himself and did not\\n\\t\\t\\t\\treveal it to them; he said...\", etc.  According to almost\\n\\t\\t\\t\\tall the commentators, the pronoun \"it\" refers to Joseph's\\n\\t\\t\\t\\tsubsequent \"saying\" or, rather, thought, indicated by the\\n\\t\\t\\t\\tverb \"he said\" (i.e., within himself); hence my free\\n\\t\\t\\t\\trendering of this phrase."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "77",
    "NoteID": "80",
    "Body": "Lit., \"of what you attribute\", i.e., to Joseph and\\n\\t\\t\\t\\tBenjamin - sc., \"since you yourselves have stolen Joseph\\n\\t\\t\\t\\tfrom his father\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "80",
    "NoteID": "81",
    "Body": "Lit., \"know\" - but since this expression denotes here\\n\\t\\t\\t\\tremembrance rather than knowledge in the proper sense of\\n\\t\\t\\t\\tthe word, it can be suitably translated as above."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "80",
    "NoteID": "82",
    "Body": "I.e., \"enables me to win back my brother Benjamin\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "81",
    "NoteID": "83",
    "Body": "I.e., the finding of the King's cup in Benjamin's bag\\n\\t\\t\\t\\t(Baghawi and Zamakhshari)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "81",
    "NoteID": "84",
    "Body": "Lit., \"We were not guardians over that which was beyond\\n\\t\\t\\t\\tthe reach of [our] perception\": i.e., \"at the time when\\n\\t\\t\\t\\twe gave you our pledge regarding Benjamin, we did not\\n\\t\\t\\t\\tknow that he would steal\" (Zamakhshari)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "83",
    "NoteID": "85",
    "Body": "I.e., Benjamin and the eldest son (who had remained in\\n\\t\\t\\t\\tEgypt) as well as Joseph, of whose alleged death Jacob\\n\\t\\t\\t\\twas never fully convinced (cf. note [17])."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "84",
    "NoteID": "86",
    "Body": "Lit., \"white\": i.e., dim with the tears that filled them\\n\\t\\t\\t\\t(Razi). Although Jacob was now deprived of three of his\\n\\t\\t\\t\\tsons, his grief for Joseph was the most acute because he\\n\\t\\t\\t\\twas the only one of the three of whom Jacob did not know\\n\\t\\t\\t\\twhether he was dead or alive."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "86",
    "NoteID": "87",
    "Body": "Namely, that \"judgment as to what is to happen rests with\\n\\t\\t\\t\\tnone but God\", and that \"all who have trust [in His\\n\\t\\t\\t\\texistence] must place their trust in Him alone\" (verse\\n\\t\\t\\t\\t{67}): the twin ideas which underlie the whole of this\\n\\t\\t\\t\\tsurah, and which Jacob now seeks to impress upon his\\n\\t\\t\\t\\tsons. In addition to this, his remembrance of Joseph's\\n\\t\\t\\t\\tprophetic dream (verse {4}) and his own conviction at the\\n\\t\\t\\t\\ttime that his beloved son would be elected by God for His\\n\\t\\t\\t\\tspecial grace (verse {6}), fills Jacob with renewed hope\\n\\t\\t\\t\\tthat Joseph is still alive (Razi and Ibn Kathir): and\\n\\t\\t\\t\\tthis explains the directives which he gives his sons in\\n\\t\\t\\t\\tthe next sentence."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "87",
    "NoteID": "88",
    "Body": "According to most of the commentators, especially Ibn\\n\\t\\t\\t\\t'Abbas (as quoted by Tabari and others), the term rawh is\\n\\t\\t\\t\\there synonymous with rahmah (\"grace\" or \"mercy\"). Since\\n\\t\\t\\t\\tit is linguistically related to the noun ruh (\"breath of\\n\\t\\t\\t\\tlife\" or \"spirit\"), and has also the metonymic\\n\\t\\t\\t\\tsignificance of \"rest\" (rahah) from grief and sadness\\n\\t\\t\\t\\t(Taj al-'Arus), the most appropriate rendering would seem\\n\\t\\t\\t\\tto be \"life-giving mercy\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "88",
    "NoteID": "89",
    "Body": "I.e., goods which they intended to barter for grain (see\\n\\t\\t\\t\\tnote [60] above)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "89",
    "NoteID": "90",
    "Body": "Lit., \"know\" (see note [81])."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "89",
    "NoteID": "91",
    "Body": "By coupling his own name with that of Benjamin he\\n\\t\\t\\t\\tpossibly hinted at his brothers' early envy and hatred of\\n\\t\\t\\t\\tthe two sons of Rachel (cf. verse {8} of this surah and\\n\\t\\t\\t\\tthe corresponding note [12]); alternatively, the mention\\n\\t\\t\\t\\tof Benjamin may have been due to the readiness with which\\n\\t\\t\\t\\tthey accepted the \"evidence\" of the latter's guilt (verse\\n\\t\\t\\t\\t{77})."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "90",
    "NoteID": "92",
    "Body": "Lit., \"whoever is...\", etc."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "93",
    "NoteID": "93",
    "Body": "Lit., \"he will become seeing [again]\" - i.e., \"he will\\n\\t\\t\\t\\tcease to weep for me and the dimness of his sight caused\\n\\t\\t\\t\\tby unhappiness and constant weeping will disappear on\\n\\t\\t\\t\\tlearning that I am alive\": thus may be summed up Razi's\\n\\t\\t\\t\\texplanation of the above sentence. According to him,\\n\\t\\t\\t\\tthere is no compelling reason to assume that Jacob had\\n\\t\\t\\t\\tbecome really blind from grief. - The phrase \"lay it over\\n\\t\\t\\t\\tmy father's face\" could also be rendered as \"lay it\\n\\t\\t\\t\\tbefore my father\", since the term wajh (lit., \"face\") is\\n\\t\\t\\t\\toften used in classical Arabic to denote, metonymically,\\n\\t\\t\\t\\tone's whole personality, or whole being."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "94",
    "NoteID": "94",
    "Body": "Lit., \"had departed\", i.e., from Egypt."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "96",
    "NoteID": "95",
    "Body": "See verse {86} above."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "99",
    "NoteID": "96",
    "Body": "According to the Biblical account - not contradicted by\\n\\t\\t\\t\\tthe Qur'an - Joseph's mother Rachel had died while giving\\n\\t\\t\\t\\tbirth to Benjamin. We may, therefore, assume that the\\n\\t\\t\\t\\t\"mother\" implied in the term \"parents\" was another of\\n\\t\\t\\t\\tJacob's wives, who had brought up Joseph and Benjamin;\\n\\t\\t\\t\\tthis would be in consonance with the ancient Arabian\\n\\t\\t\\t\\tcustom of applying the designation \"mother\" to a\\n\\t\\t\\t\\tfoster-mother."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "100",
    "NoteID": "97",
    "Body": "Lit., \"onto the throne (al-'arsh)\", in the metaphorical\\n\\t\\t\\t\\tsense of this word."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "100",
    "NoteID": "98",
    "Body": "According to 'Abd Allah ibn 'Abbas (as quoted by Razi),\\n\\t\\t\\t\\tthe personal pronoun in \"before Him\" relates to God,\\n\\t\\t\\t\\tsince it is inconceivable that Joseph would have allowed\\n\\t\\t\\t\\this parents to prostrate themselves before himself."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "100",
    "NoteID": "99",
    "Body": "The fulfilment of Joseph's childhood dream consisted in\\n\\t\\t\\t\\tthe high dignity with which he was now invested and in\\n\\t\\t\\t\\tthe fact that his parents and his brothers had come from\\n\\t\\t\\t\\tCanaan to Egypt for his sake: for \"no reasonable person\\n\\t\\t\\t\\tcan expect that the fulfilment of a dream should be an\\n\\t\\t\\t\\texact replica of the dream itself\" (Razi, alluding to the\\n\\t\\t\\t\\tsymbolic prostration of the eleven stars, the sun and the\\n\\t\\t\\t\\tmoon mentioned in verse {4} of this surah)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "100",
    "NoteID": "100",
    "Body": "As regards my rendering of latif as \"unfathomable\", see\\n\\t\\t\\t\\tsurah {6}, note [89]. In the present instance, this term\\n\\t\\t\\t\\tsupplies a further accent, as it were, on the theme\\n\\t\\t\\t\\t\"judgment as to what is to happen rests with none but\\n\\t\\t\\t\\tGod\" (verse {67})."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "101",
    "NoteID": "101",
    "Body": "Lit., \"of dominion\", indicating that absolute power and\\n\\t\\t\\t\\tabsolute dominion belong to God alone."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "101",
    "NoteID": "102",
    "Body": "See note [10] on verse {6} of this surah."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "102",
    "NoteID": "103",
    "Body": "Lit., \"with them\"."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "108",
    "NoteID": "104",
    "Body": "It is impossible to render the expression 'ala basirah in\\n\\t\\t\\t\\ta more concise manner. Derived from the verb basura or\\n\\t\\t\\t\\tbasira (\"he became seeing\" or \"he saw\"), the noun basirah\\n\\t\\t\\t\\t(as also the verb) has the abstract connotation of\\n\\t\\t\\t\\t\"seeing with one's mind\": and so it signifies \"the\\n\\t\\t\\t\\tfaculty of understanding based on conscious insight\" as\\n\\t\\t\\t\\twell as, tropically, \"an evidence accessible to the\\n\\t\\t\\t\\tintellect\" or \"verifiable by the intellect\". Thus, the\\n\\t\\t\\t\\t\"call to God\" enunciated by the Prophet is described here\\n\\t\\t\\t\\tas the outcome of a conscious insight accessible to, and\\n\\t\\t\\t\\tverifiable by, man's reason: a statement which\\n\\t\\t\\t\\tcircumscribes to perfection the Qur'anic approach to all\\n\\t\\t\\t\\tquestions of faith, ethics and morality, and is echoed\\n\\t\\t\\t\\tmany times in expressions like \"so that you might use\\n\\t\\t\\t\\tyour reason\" (la'allakum ta'qilun), or \"will you not,\\n\\t\\t\\t\\tthen, use your reason?\" (a fa-la ta'qilun), or \"so that\\n\\t\\t\\t\\tthey might understand [the truth]\" (la'allahum yafqahun),\\n\\t\\t\\t\\tor \"so that you might think\" (la'allakum tatafakkarun);\\n\\t\\t\\t\\tand, finally, in the oft-repeated declaration that the\\n\\t\\t\\t\\tmessage of the Qur'an as such is meant specifically \"for\\n\\t\\t\\t\\tpeople who think\" (li-qawmin yatafakkarun)."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "109",
    "NoteID": "105",
    "Body": "This is an answer to the objection often raised by\\n\\t\\t\\t\\tunbelievers that a mortal like themselves could not have\\n\\t\\t\\t\\tbeen entrusted with God's message to man."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "110",
    "NoteID": "106",
    "Body": "Lit., \"until\" (hatta). This connects with the reference\\n\\t\\t\\t\\tto earlier apostles in the first sentence of the\\n\\t\\t\\t\\tpreceding verse: the implication being (according to\\n\\t\\t\\t\\tZamakhshari) that they used to suffer for a long time\\n\\t\\t\\t\\tbefore they were vindicated by God."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "110",
    "NoteID": "107",
    "Body": "Lit., \"thought that they had been given the lie\" - i.e.,\\n\\t\\t\\t\\teither by their people, who regarded the apostles'\\n\\t\\t\\t\\texpectation of God's succour as mere wishful thinking, or\\n\\t\\t\\t\\tby the harsh reality which seemed to contradict those\\n\\t\\t\\t\\tapostles' own hopes of speedy help from God\\n\\t\\t\\t\\t(Zamakhshari). Commenting on this verse,'Abd Allah\\n\\t\\t\\t\\tibn'Abbas used to quote  2:214  - \"so shaken were they\\n\\t\\t\\t\\tthat the apostle, and the believers with him, would\\n\\t\\t\\t\\texclaim, 'When will God s succour come?' (ibid.)"
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "111",
    "NoteID": "108",
    "Body": "Lit., \"in their stories\" - i.e., the stories of the\\n\\t\\t\\t\\tprophets."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "111",
    "NoteID": "109",
    "Body": "I.e., the Qur'an as a whole (Baghawi and Zamakhshari).\\n\\t\\t\\t\\tThe passage that follows connects with verses {102-105}."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "111",
    "NoteID": "110",
    "Body": "Lit., \"but\" - denoting here the impossibility of its having\\n\\t\\t\\t\\tbeen invented by Muhammad."
  },
  {
    "SurahNumber": "12",
    "AyahNumber": "111",
    "NoteID": "111",
    "Body": "I.e., everything that man may need for his spiritual\\n\\t\\t\\t\\twelfare. See also  10:37  and the corresponding note [60]"
  }
]
