[
  {
    "SurahNumber": "34",
    "AyahNumber": "1",
    "Text": "Praise be to Allah to Whom belongs all that is in the heavens and\\n\\t\\t\\tthe earth! To Him be praise in the hereafter. He is the Wise, the\\n\\t\\t\\tAware."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "2",
    "Text": "He has the knowledge of all that goes into the earth and that\\n\\t\\t\\twhich comes out of it; and all that comes down from heaven and\\n\\t\\t\\tthat ascends to it. He is the Merciful, the Forgiving."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "3",
    "Text": "The unbelievers say: \"The Hour of Doom will never come to us.\"\\n\\t\\t\\tTell them: \"Nay! By my Rabb, the Knower of the unseen, it shall\\n\\t\\t\\tcertainly come upon you. Nothing, even equal an atom, in the\\n\\t\\t\\theavens or the earth is hidden from Him; nor there is anything\\n\\t\\t\\tsmaller or greater than that, but is recorded in the Clear Book."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "4",
    "Text": "The Hour is going to come and the Day of Judgement shall be\\n\\t\\t\\testablished, to reward those who have believed and done good\\n\\t\\t\\tdeeds; it is them for whom there is forgiveness and an honorable\\n\\t\\t\\tsustenance.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "5",
    "Text": "As for those who strive to discredit Our revelations, there will\\n\\t\\t\\tbe a humiliating painful punishment."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "6",
    "Text": "Those to whom knowledge has been given can see that the\\n\\t\\t\\trevelations send down to you from your Rabb are the Truth and it\\n\\t\\t\\tguides to the Way of the Almighty, the Praise Worthy."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "7",
    "Text": "The unbelievers say to the people: \"Shall we point out to you a\\n\\t\\t\\tman who claims that when your body will disintegrate and mangle\\n\\t\\t\\tinto dust you shall be raised to life again?"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "8",
    "Text": "Has he forged a lie against Allah or is he mad?\" Nay! In fact\\n\\t\\t\\tthose who do not believe in the Hereafter are doomed, for they\\n\\t\\t\\tare in gross error."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "9",
    "Text": "Do they not see the sky and the earth that surrounds them from\\n\\t\\t\\tfront and from behind? If We want, We can cave in the earth to\\n\\t\\t\\tswallow them up or let the fragments of the sky fall upon them.\\n\\t\\t\\tSurely there is a sign in this for every devotee that turns to\\n\\t\\t\\tAllah in repentance."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "10",
    "Text": "We bestowed Our blessings on Dawood and commanded: \"O mountains!\\n\\t\\t\\tJoin him in singing My rhymes,\" and a similar command was given\\n\\t\\t\\tto the birds. We made iron soft for him"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "11",
    "Text": "saying: \"make coats of armor measuring out the links in mail and\\n\\t\\t\\tO people of Dawood, do good deeds; surely I am watching over all\\n\\t\\t\\tof your actions.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "12",
    "Text": "And We made the winds subservient to Sulaiman, which made a\\n\\t\\t\\tmonth's journey in the morning and a month's journey in the\\n\\t\\t\\tevening; and We made a fountain of molten copper to flow for him;\\n\\t\\t\\tand subdued Jinns for him who worked in front of him by the leave\\n\\t\\t\\tof his Rabb; and if any of them turned aside from Our command, We\\n\\t\\t\\tmade Him taste the punishment of the blazing fire."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "13",
    "Text": "They worked for him as he desired: making arches, images, basins\\n\\t\\t\\tas large as reservoirs and built-in cooking cauldrons. We said:\\n\\t\\t\\t\"O Family of Dawood! Work gratefully.\" Only a few of My devotees\\n\\t\\t\\tare truly grateful."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "14",
    "Text": "When We decreed Sulaiman's death he was leaning on his staff. The\\n\\t\\t\\tjinns did not know that he was dead until the termite ate away\\n\\t\\t\\this staff and fell down. Thus it became clear to the jinns that\\n\\t\\t\\tif they had known the unseen, they would not have continued in\\n\\t\\t\\tthe humiliating punishment of their task."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "15",
    "Text": "For the people of Saba (Sheba, presently a town in Yeman) there\\n\\t\\t\\twas indeed a sign in their dwelling place: two gardens - one to\\n\\t\\t\\tthe right and one to the left. It was said to them: \"Eat of what\\n\\t\\t\\tyour Rabb has given you and render thanks to Him. Pleasant is\\n\\t\\t\\tyour land and forgiving is your Rabb.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "16",
    "Text": "But they gave no heed. So We let loose upon them the waters of\\n\\t\\t\\tthe dam (called Ma'arib) and We converted their two gardens into\\n\\t\\t\\tthe gardens producing bitter fruit, tamarisks and a few lot\\n\\t\\t\\tbushes."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "17",
    "Text": "Thus did We requite them for their disbelief; and never do We\\n\\t\\t\\tpunish any but the ungrateful!"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "18",
    "Text": "Between them and the towns which We had blessed (Syria and\\n\\t\\t\\tPalestine), We placed other towns in prominent positions so that\\n\\t\\t\\tthey could journey to and fro in measured stages. We said:\\n\\t\\t\\t\"Travel through them by day and night in complete security.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "19",
    "Text": "But they prayed: \"Our Rabb! Make our journeys longer.\" Thereby\\n\\t\\t\\tthey wronged their souls and We made them merely a tale that is\\n\\t\\t\\ttold and dispersed them in scattered fragments. Surely there is a\\n\\t\\t\\tsign in this for every patient, grateful person."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "20",
    "Text": "In their case, Iblees' (Satan's) suspicions proved true, as they\\n\\t\\t\\tall followed him except a small group of the believers,"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "21",
    "Text": "even though he had no authority over them. It all happened\\n\\t\\t\\tbecause We wanted to see who among them believed in the hereafter\\n\\t\\t\\tand who is in doubt concerning it. Your Rabb is watching over all\\n\\t\\t\\tthings."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "22",
    "Text": "O Prophet, say to the mushrikin: \"Call on those deities whom you\\n\\t\\t\\tpray besides Allah - they do not have power over an atom's weight\\n\\t\\t\\tof anything in the heavens or earth, nor have they any share in\\n\\t\\t\\teither, nor is any of them a helper to Allah.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "23",
    "Text": "No intercession before Allah can avail anyone except for the one\\n\\t\\t\\tfor whom He permits. Until when terror will be removed from their\\n\\t\\t\\thearts, they shall ask the intercessors: \"What has your Rabb\\n\\t\\t\\tordained?\" They will answer: \"The Truth,\" He is the Most High,\\n\\t\\t\\tthe Great."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "24",
    "Text": "O Prophet, ask them: \"Who provides your sustenance from the\\n\\t\\t\\theavens and the earth?\" If they do not answer, then say: \"It is\\n\\t\\t\\tAllah! Certainly one of us; either we or you are rightly guided\\n\\t\\t\\tor in manifest error.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "25",
    "Text": "Further, tell them: \"You shall not be questioned about our errors\\n\\t\\t\\tnor shall we be questioned about your actions.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "26",
    "Text": "Say: \"Our Rabb will bring us all together, then He will rightly\\n\\t\\t\\tjudge between us. He is the Judge Who knows everything.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "27",
    "Text": "Say: \"Show me those whom you have made associate gods with Him.\\n\\t\\t\\tNay! By no means can you do it. Allah Alone is the Almighty, the\\n\\t\\t\\tWise\"."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "28",
    "Text": "O Prophet, We have sent you to the entire mankind, to give them\\n\\t\\t\\tgood news and forewarn them, but most men do not know."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "29",
    "Text": "They ask you: \"When will this promise of resurrection be\\n\\t\\t\\tfulfilled, if you are telling the truth?\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "30",
    "Text": "Tell them: \"For you the appointment of a day is fixed, which you\\n\\t\\t\\tcan neither postpone for a moment nor bring it early.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "31",
    "Text": "The disbelievers say: \"We shall never believe in this Qur'an, nor\\n\\t\\t\\tin the scriptures which came before it.\" If you could only see\\n\\t\\t\\twhen these wrongdoers will be made to stand before their Rabb,\\n\\t\\t\\ttossing accusing words on one another! Those who had been\\n\\t\\t\\tdespised as weaklings will say to the arrogant: \"If it were not\\n\\t\\t\\tfor you, we would certainly have been believers.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "32",
    "Text": "The arrogant will say to those despised weaklings: \"Did we block\\n\\t\\t\\tyou off from guidance when it came to you? Nay! Rather you\\n\\t\\t\\tyourselves were guilty.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "33",
    "Text": "Those despised weaklings will say to the arrogant: \"No! It was\\n\\t\\t\\tyou who plotted day and night, bidding us to disbelieve in Allah\\n\\t\\t\\tand to set up equals with Him,\" - They will feel ashamed once\\n\\t\\t\\tthey see the punishment, and We shall put yokes on the necks of\\n\\t\\t\\tthose disbelievers; can there be any other reward except for what\\n\\t\\t\\tthey did?"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "34",
    "Text": "Whenever We have sent a Warner to a town, its wealthy residents\\n\\t\\t\\thave said: \"We surely disbelieve in what you are sent with\"."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "35",
    "Text": "They say: \"We have more wealth and children, which indicates that\\n\\t\\t\\tour gods are happy with us so we shall never be punished.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "36",
    "Text": "O Prophet tell them: \"Surely my Rabb gives abundantly to whom He\\n\\t\\t\\twills and sparingly to whom He pleases, but most people do not\\n\\t\\t\\tunderstand this.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "37",
    "Text": "It is neither your wealth nor your children which bring you\\n\\t\\t\\tcloser to Us even one jot, but those who believe and do good\\n\\t\\t\\tdeeds; for them, there will be a double reward for their deeds\\n\\t\\t\\tand in high mansions shall they live in peace."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "38",
    "Text": "As for those who strive in opposing Our revelations, they shall\\n\\t\\t\\tbe brought for punishment."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "39",
    "Text": "O Prophet tell them: \"Surely my Rabb gives abundantly to whom He\\n\\t\\t\\tpleases and sparingly to whom He wills. Whatever you spend in\\n\\t\\t\\tcharity, He will pay you back. He is the best of those who\\n\\t\\t\\tprovide sustenance."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "40",
    "Text": "One Day He will gather them all together and ask the angels: \"Was\\n\\t\\t\\tit you that these people used to worship?\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "41",
    "Text": "They will respond: \"Glory be to You! Our tie is with You - as a\\n\\t\\t\\tprotector - not with them; but they used to worship the jinns and\\n\\t\\t\\tit was them in whom most of these people believed.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "42",
    "Text": "On that Day you will be helpless to profit or harm one another.\\n\\t\\t\\tTo the wrongdoers We shall say: \"Taste the punishment of the fire\\n\\t\\t\\twhich you persistently denied.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "43",
    "Text": "Today when Our clear revelations are recited to them, they say:\\n\\t\\t\\t\"This man only wants to turn you away from those gods to whom\\n\\t\\t\\tyour forefathers have been worshipping.\" Others say: \"This Qur'an\\n\\t\\t\\tis nothing but an invented falsehood.\" While yet others, who deny\\n\\t\\t\\tthe truth when it comes to them, say: \"This is nothing but plain\\n\\t\\t\\tmagic.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "44",
    "Text": "In fact, neither had We given them books to study, nor had We\\n\\t\\t\\tsent to them any Warner before you."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "45",
    "Text": "Those who have gone before them also denied - these Arabs have\\n\\t\\t\\tnot received one tenth of what We had granted them - yet when\\n\\t\\t\\tthey denied My Rasools, see how terrible was My scourge."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "46",
    "Text": "O Prophet say: \"I would ask you one thing. For Allah's sake!\\n\\t\\t\\tThink individually or consult one another and ponder whether your\\n\\t\\t\\tcompanion Muhammad is really mad? You yourself will come to the\\n\\t\\t\\tconclusion that he is nothing but a Warner to you to forewarn you\\n\\t\\t\\tof a sever punishment.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "47",
    "Text": "Tell them: \"I do not ask you for any recompense, even though what\\n\\t\\t\\tI preach is all in your interest. My reward is only due from\\n\\t\\t\\tAllah and He is a witness over everything.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "48",
    "Text": "Say: \"In fact my Rabb reveals to me the truth, and He is the\\n\\t\\t\\tKnower of all hidden realities.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "49",
    "Text": "Say: \"The truth has arrived and falsehood neither originates nor\\n\\t\\t\\trestores anything.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "50",
    "Text": "Say: \"If I am in error, the loss is surely mine and if I am\\n\\t\\t\\tright, it is because of what my Rabb has revealed to me. Surely\\n\\t\\t\\tHe hears all and is very close.\""
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "51",
    "Text": "If you could only see the disbelievers on the Day of Judgement\\n\\t\\t\\twhen they will be in a state of confusion! On that Day there will\\n\\t\\t\\tbe no escape; and they will be seized from a nearby place."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "52",
    "Text": "Then they will say: \"We believe in it (the Truth brought by the\\n\\t\\t\\tProphet\": but how could they attain the Faith from such a far\\n\\t\\t\\tdistant place."
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "53",
    "Text": "They had disbelieved in it before - and they had sneered at the\\n\\t\\t\\tunseen when they were far away during their life on earth?"
  },
  {
    "SurahNumber": "34",
    "AyahNumber": "54",
    "Text": "A barrier will be placed between them and what they desired to\\n\\t\\t\\thave as was done with the similar people before them; for they\\n\\t\\t\\twere indeed involved in a misleading suspicion."
  }
]
