[
  {
    "SurahNumber": "50",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Chronologically, the above is the second occurrence\\n\\t\\t\\t\\t(after surah {68}) of one of the disjointed\\n\\t\\t\\t\\tletter-symbols which precede some of the Qur'anic surahs.\\n\\t\\t\\t\\tFor the theories relating to these symbols, see Appendix\\n\\t\\t\\t\\tII. As regards my rendering of the adjurative particle wa\\n\\t\\t\\t\\twhich opens the next sentence as \"Consider\", see first\\n\\t\\t\\t\\thalf of note [23] on  74:32 , where this adjuration\\n\\t\\t\\t\\tappears for the first time in the chronological order of\\n\\t\\t\\t\\trevelation."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "This is the earliest Qur'anic mention - repeated again\\n\\t\\t\\t\\tand again in other places - of people's \"deeming it\\n\\t\\t\\t\\tstrange\" that a purportedly divine message should have\\n\\t\\t\\t\\tbeen delivered by someone \"from their own midst\", i.e., a\\n\\t\\t\\t\\tmortal like themselves. Although it is undoubtedly, in\\n\\t\\t\\t\\tthe first instance, a reference to the negative attitude\\n\\t\\t\\t\\tof the Meccan pagans to Muhammad's call, its frequent\\n\\t\\t\\t\\trepetition throughout the Qur'an has obviously an\\n\\t\\t\\t\\timplication going far beyond that historical reference:\\n\\t\\t\\t\\tit points to the tendency common to many people, at all\\n\\t\\t\\t\\tstages of human development, to distrust any religious\\n\\t\\t\\t\\tstatement that is devoid of all exoticism inasmuch as it\\n\\t\\t\\t\\tis enunciated by a person sharing the social and cultural\\n\\t\\t\\t\\tbackground of those whom he addresses, and because the\\n\\t\\t\\t\\tmessage itself relies exclusively - as the Qur'an does -\\n\\t\\t\\t\\ton an appeal to man's reason and moral sense. Hence, the\\n\\t\\t\\t\\tQur'an explicitly mentions people's \"objections\" to a\\n\\t\\t\\t\\tprophet \"who eats food [like ordinary mortals] and goes\\n\\t\\t\\t\\tabout in the market-places\" ( 25:7 , see also note [16]\\n\\t\\t\\t\\ton  25:20 )."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "Lit., \"what the earth diminishes of them\" - implying that\\n\\t\\t\\t\\tGod's promise of resurrection takes the fact of the dead\\n\\t\\t\\t\\tbodies' decomposition fully into account. Consequently,\\n\\t\\t\\t\\tresurrection will be like \"a new creation\" (cf.\\n\\t\\t\\t\\t 10:4,  21:104 ,  30:11 ,  85:13 , etc.), recalling the\\n\\t\\t\\t\\trecurrent process of creation and re-creation visible in\\n\\t\\t\\t\\tall organic nature (cf.  10:34 .  27:64 .  30:27 )."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "Since they reject a priori all thought of life after\\n\\t\\t\\t\\tdeath, they are perplexed by the lack of any answer to\\n\\t\\t\\t\\tthe \"why\" and \"what for\" of man's life, by the evident\\n\\t\\t\\t\\tinequality of human destinies, and by what appears to\\n\\t\\t\\t\\tthem as a senseless, blind cruelty of nature: problems\\n\\t\\t\\t\\twhich can be resolved only against the background of a\\n\\t\\t\\t\\tbelief in a continuation of life after bodily \"death\"\\n\\t\\t\\t\\tand, hence, in the existence of a purpose and a plan\\n\\t\\t\\t\\tunderlying all creation."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "Lit., \"and it has no gaps [or \"breaks\"] whatever\"."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "12",
    "NoteID": "6",
    "Body": "See note [33] on  25:38 ."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "13",
    "NoteID": "7",
    "Body": "The term \"brethren\" (ikhwan) is used here metonymically,\\n\\t\\t\\t\\tdenoting a group of people who share the same views or,\\n\\t\\t\\t\\talternatively, the same environment. Since the people\\n\\t\\t\\t\\treferred to formed Lot's social environment (cf.  7:83 \\n\\t\\t\\t\\tor {11:77-83}), they are described as his \"brethren\"\\n\\t\\t\\t\\talthough his moral concepts and inclinations were\\n\\t\\t\\t\\tentirely different from theirs."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "14",
    "NoteID": "8",
    "Body": "Regarding \"the people of Tubba'\", see  44:37  and the\\n\\t\\t\\t\\tcorresponding note. The \"dwellers of the wooded dales\"\\n\\t\\t\\t\\tare the people of Madyan (the Biblical Midian), as is\\n\\t\\t\\t\\tevident from  26:176  ff. Their story is found in the\\n\\t\\t\\t\\tQur'an in several places; for the most detailed version,\\n\\t\\t\\t\\tsee {11:84-95}."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "15",
    "NoteID": "9",
    "Body": "I.e., by the creation of the universe or, more\\n\\t\\t\\t\\tspecifically, of man."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "15",
    "NoteID": "10",
    "Body": "Lit., \"they\"."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "17",
    "NoteID": "11",
    "Body": "The first part of the above sentence - i.e., the phrase\\n\\t\\t\\t\\tyatalaqqa al-mutalaqqiyan - may be understood in either\\n\\t\\t\\t\\tof two senses: \"the two that are meant to receive do\\n\\t\\t\\t\\treceive\", or \"the two that aim at meeting each other do\\n\\t\\t\\t\\tmeet\". The classical commentators adopt, as a rule, the\\n\\t\\t\\t\\tfirst sense and, consequently, interpret the passage\\n\\t\\t\\t\\tthus: \"...the two angels that are charged with recording\\n\\t\\t\\t\\tman's doings do record them, sitting on his right and on\\n\\t\\t\\t\\this left\". In my opinion, however, the second of the two\\n\\t\\t\\t\\tpossible meanings (\"the two that aim at meeting each\\n\\t\\t\\t\\tother\") corresponds better with the preceding verse,\\n\\t\\t\\t\\twhich speaks of what man's innermost self (nafs)\\n\\t\\t\\t\\t\"whispers within him\", i.e., voices his subconscious\\n\\t\\t\\t\\tdesires. Thus, \"the two that aim at meeting\" are, I\\n\\t\\t\\t\\tbelieve, the two demands of, or, more properly, the two\\n\\t\\t\\t\\tfundamental motive forces within man's nature: his\\n\\t\\t\\t\\tprimal, instinctive urges and desires, both sensual and\\n\\t\\t\\t\\tnon-sensual (all of them comprised in the modern\\n\\t\\t\\t\\tpsychological term \"libido\"), on the one side, and his\\n\\t\\t\\t\\treason, both intuitive and reflective, on the other. The\\n\\t\\t\\t\\t\"sitting (qa'id) on the right and on the left\" is, to my\\n\\t\\t\\t\\tmind, a metaphor for the conflicting nature of these dual\\n\\t\\t\\t\\tforces which strive for predominance within every human\\n\\t\\t\\t\\tbeing: hence, my rendering of qa'id as \"contending\". This\\n\\t\\t\\t\\tinterpretation is, moreover, strongly supported by the\\n\\t\\t\\t\\treference, in verse {21}, to man's appearing on Judgment\\n\\t\\t\\t\\tDay with \"that which drives and that which bears witness\"\\n\\t\\t\\t\\t- a phrase which undoubtedly alludes to man's instinctive\\n\\t\\t\\t\\turges as well as his conscious reason (see note [14]\\n\\t\\t\\t\\tbelow)."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "18",
    "NoteID": "12",
    "Body": "I.e., his conscience. The \"uttering of a word\" is\\n\\t\\t\\t\\tconceptually connected with the \"whispering\" within man's\\n\\t\\t\\t\\tpsyche spoken of in the preceding verse."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "19",
    "NoteID": "13",
    "Body": "I.e., full insight into one's own self."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "21",
    "NoteID": "14",
    "Body": "Lit., \"with that which drives (sa'iq) and that which\\n\\t\\t\\t\\tbears witness (shahid)\".  While the former term evidently\\n\\t\\t\\t\\tcircumscribes man's primal urges - and particularly those\\n\\t\\t\\t\\twhich drive him into unrestrained self-indulgence and,\\n\\t\\t\\t\\tthus, into sin - the term shahid (rendered by me as\\n\\t\\t\\t\\t\"conscious mind\") alludes here to the awakening of the\\n\\t\\t\\t\\tdeeper layers of man's consciousness, leading to a sudden\\n\\t\\t\\t\\tperception of his own moral reality - the \"lifting of the\\n\\t\\t\\t\\tveil\" referred to in the next verse - which forces him to\\n\\t\\t\\t\\t\"bear witness\" against himself (cf.  17:14, 24:24,\\n\\t\\t\\t\\t 36:65,  41:20  ff.)."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "23",
    "NoteID": "15",
    "Body": "Lit., \"his intimate companion\" (qarinuhu). The term qarin\\n\\t\\t\\t\\tdenotes something that is \"connected\", \"linked\" or\\n\\t\\t\\t\\t\"intimately associated\" with another thing (cf. 41:25 \\n\\t\\t\\t\\tand  43:36 , where qarin is rendered as \"[one's] other\\n\\t\\t\\t\\tself\"). In the present instance - read together with\\n\\t\\t\\t\\tverse {21} - the term apparently denotes \"one part\" of\\n\\t\\t\\t\\tman, namely, his awakened moral consciousness."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "23",
    "NoteID": "16",
    "Body": "I.e., the sinner's reason will plead that he had always\\n\\t\\t\\t\\tbeen more or less conscious, and perhaps even critical,\\n\\t\\t\\t\\tof the urges and appetites that drove him into evildoing:\\n\\t\\t\\t\\tbut, as is shown in the sequence, this belated and,\\n\\t\\t\\t\\ttherefore, morally ineffective rational cognition does\\n\\t\\t\\t\\tnot diminish but, rather, enhances the burden of man's\\n\\t\\t\\t\\tguilt."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "24",
    "NoteID": "17",
    "Body": "In this instance, as well as in verse {26}, the\\n\\t\\t\\t\\timperative \"cast\" has the dual form (alqiya). As many\\n\\t\\t\\t\\tclassical philologists (and almost all of the\\n\\t\\t\\t\\tcommentators) point out, this is linguistically\\n\\t\\t\\t\\tpermissable for the sake of special stress, and is\\n\\t\\t\\t\\tequivalent to an emphatic repetition of the imperative in\\n\\t\\t\\t\\tquestion. Alternatively, the dual form may be taken as\\n\\t\\t\\t\\tindicative of an actual duality thus addressed: namely,\\n\\t\\t\\t\\tthe two manifestations within man's psyche alluded to in\\n\\t\\t\\t\\tverse {17} and described in verse {21} as sa'iq and\\n\\t\\t\\t\\tshahid (see note [14] above), both of which, in their\\n\\t\\t\\t\\tinteraction, are responsible for his spiritual downfall\\n\\t\\t\\t\\tand, hence, for his suffering in the life to come."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "26",
    "NoteID": "18",
    "Body": "This relates not merely to the veneration of real or\\n\\t\\t\\t\\timaginary beings or forces to which one ascribes divine\\n\\t\\t\\t\\tqualities, but also to the \"worship\" of false values and\\n\\t\\t\\t\\timmoral concepts to which people often adhere with an\\n\\t\\t\\t\\talmost religious fervour."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "27",
    "NoteID": "19",
    "Body": "Lit., as in verse {23}, \"his intimate companion\" (qarin):\\n\\t\\t\\t\\tbut whereas there it may be taken as denoting man's moral\\n\\t\\t\\t\\tconsciousness or reason (cf. note [15] above), in the\\n\\t\\t\\t\\tpresent instance the \"speaker\" is obviously its\\n\\t\\t\\t\\tcounterpart, namely, the complex of the sinner's\\n\\t\\t\\t\\tinstinctive urges and inordinate, unrestrained\\n\\t\\t\\t\\tappetitites summarized in the term sa'iq (\"that which\\n\\t\\t\\t\\tdrives\") and often symbolized as shaytan (\"satan\" or\\n\\t\\t\\t\\t\"satanic force\": see Razi's remarks quoted in note [31]\\n\\t\\t\\t\\ton  14:22 .) In this sense, the term qarin has the same\\n\\t\\t\\t\\tconnotation as in  41:25  and  43:36 ."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "27",
    "NoteID": "20",
    "Body": "Lit., \"him\" or \"it\" - referring to man's faculty of\\n\\t\\t\\t\\tconscious, controlling reason (shahid)."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "27",
    "NoteID": "21",
    "Body": "I.e., man's evil impulses and appetites cannot gain\\n\\t\\t\\t\\tascendancy unless his conscious mind goes astray from\\n\\t\\t\\t\\tmoral verities: and this explains the purport, in the\\n\\t\\t\\t\\tpresent context, of verses {24-25} above."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "31",
    "NoteID": "22",
    "Body": "Lit., \"brought near to\"."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "33",
    "NoteID": "23",
    "Body": "See last sentence of  24:31  and the corresponding note\\n\\t\\t\\t\\t[41]."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "34",
    "NoteID": "24",
    "Body": "Lit., \"the Day of Abiding\"."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "36",
    "NoteID": "25",
    "Body": "This connects with verses {12-14} above. It should be\\n\\t\\t\\t\\tborne in mind that in ancient Arabic usage the term \\n\\t\\t\\t\\tqarn - here rendered as \"generation\" - often denotes \"a\\n\\t\\t\\t\\tperiod of time succeeding another\": hence, a \"century\",\\n\\t\\t\\t\\tor \"people of one and the same period\" and, finally, a\\n\\t\\t\\t\\t\"civilization\" in the historical sense of this word. That\\n\\t\\t\\t\\tthis last significance is intended here becomes evident\\n\\t\\t\\t\\tfrom the sequence."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "36",
    "NoteID": "26",
    "Body": "Lit., \"they wandered searching (naqqabu) in the lands: Is\\n\\t\\t\\t\\tthere any place of refuge?\" - implying that after the\\n\\t\\t\\t\\tdestruction of their civilization they could do no more\\n\\t\\t\\t\\tthan strive for bare survival."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "37",
    "NoteID": "27",
    "Body": "Thus Zamakhshari; literally, the phrase reads, \"who has a\\n\\t\\t\\t\\theart\"."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "37",
    "NoteID": "28",
    "Body": "Lit., \"or lends ear and is withal a witness (wa-huwa\\n\\t\\t\\t\\tshahid)\", which latter phrase Zamakhshari explains as\\n\\t\\t\\t\\tmeaning \"is present with his intellect\", i.e., with a\\n\\t\\t\\t\\tconscious mind. (Cf. the same use of the term shahid in\\n\\t\\t\\t\\tverse {21}.) The conjunctive particle \"or\" (aw) which\\n\\t\\t\\t\\tprecedes the above clause does not signify an alternative\\n\\t\\t\\t\\tbut has - as is often the case in Qur'anic usage - an\\n\\t\\t\\t\\texplanatory function, similar to phrases like \"that is\"\\n\\t\\t\\t\\tor \"in other words\", followed by an amplification of what\\n\\t\\t\\t\\twas said before."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "38",
    "NoteID": "29",
    "Body": "The whole of this passage (verses {36-38}) stresses God's\\n\\t\\t\\t\\tomnipotence, which can be perceived by \"anyone whose\\n\\t\\t\\t\\theart is wide-awake\". The above reference to God's having\\n\\t\\t\\t\\tcreated the universe \"in six aeons\" is the oldest in the\\n\\t\\t\\t\\tchronology of Qur'anic revelation. In this connection it\\n\\t\\t\\t\\tis to be noted that in ancient Arabic usage the term yawm\\n\\t\\t\\t\\tdoes not always denote the twenty-four hours of the\\n\\t\\t\\t\\tearthly \"day\", but is also applied to any period of time,\\n\\t\\t\\t\\thowever long or short. In the cosmic sense in which it is\\n\\t\\t\\t\\tused here and elsewhere in the Qur'an, the plural ayyam\\n\\t\\t\\t\\tis best rendered as \"aeons\". The mention of the\\n\\t\\t\\t\\timpossibility of God's ever being \"wearied\" by the\\n\\t\\t\\t\\tprocess of creation connects the present passage with\\n\\t\\t\\t\\tverse {15} of this surah and, thus, alludes to God's\\n\\t\\t\\t\\tpower to resurrect the dead."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "39",
    "NoteID": "30",
    "Body": "Sc., \"regarding the alleged 'impossibility' of\\n\\t\\t\\t\\tresurrection\"."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "39",
    "NoteID": "31",
    "Body": "I.e., \"remember His almightiness at all times of day\"."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "40",
    "NoteID": "32",
    "Body": "Lit.. \"at the ends (adbar) of prostration\"."
  },
  {
    "SurahNumber": "50",
    "AyahNumber": "41",
    "NoteID": "33",
    "Body": "Lit., \"from a place nearby\" - i.e., from within man\\n\\t\\t\\t\\thimself: an echo of verse {15}, \"We are closer to him\\n\\t\\t\\t\\tthan his neck-vein\". The \"call\" spoken of here is\\n\\t\\t\\t\\tevidently the call of death, for which man should always\\n\\t\\t\\t\\tbe prepared."
  }
]
