[
  {
    "SurahNumber": "87",
    "AyahNumber": "1",
    "NoteID": "6080",
    "Body": "The word \"Lord\" by itself is an inadequate rendering here\\n\\t\\t\\t\\tfor Rabb. For it implies cherishing, guarding from harm,\\n\\t\\t\\t\\tsustaining, granting all the means and opportunities of\\n\\t\\t\\t\\tdevelopment. See n. 20 to i. 2. For shortness, perhaps\\n\\t\\t\\t\\t\"Guardian-Lord\" will be sufficient in the Text."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "2",
    "NoteID": "6081",
    "Body": "The story of Creation is wonderful and continuous. There\\n\\t\\t\\t\\tare several processes which we contemplate in glorifying\\n\\t\\t\\t\\tAllah's name. First, He brings us into being. Secondly,\\n\\t\\t\\t\\tHe endows us with forms and faculties exactly suited to\\n\\t\\t\\t\\twhat is expected of us, and to the environments in which\\n\\t\\t\\t\\tour life will be cast, giving to everything due order and\\n\\t\\t\\t\\tproportion."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "3",
    "NoteID": "6082",
    "Body": "Thirdly, He has ordained laws and decrees, by which we\\n\\t\\t\\t\\tcan develop ourselves and fit ourselves into His whole\\n\\t\\t\\t\\tscheme of evolution for all His Creation. He has measured\\n\\t\\t\\t\\texactly the needs of all, and given us instincts and\\n\\t\\t\\t\\tphysical predispositions which fit into His decrees.\\n\\t\\t\\t\\tFourthly, He gives us guidance, so that we are not the\\n\\t\\t\\t\\tsport of mechanical laws. Our reason and our will are\\n\\t\\t\\t\\texercised, that we may reach the higher destiny of man."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "4",
    "NoteID": "6083",
    "Body": "Fifthly, after maturity comes decay. But even in that\\n\\t\\t\\t\\tdecay, as when green pasture tums to stubble, we subserve\\n\\t\\t\\t\\tother ends. In so far as we are animals, we share these\\n\\t\\t\\t\\tprocesses with other forms of material Creation, animal,\\n\\t\\t\\t\\tvegetable, and even mineral, which all have their\\n\\t\\t\\t\\tappointed laws of growth and decay. But man's higher\\n\\t\\t\\t\\tdestiny is referred to in subsequent verses."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "6",
    "NoteID": "6084",
    "Body": "The soul, as it reaches the Light of Allah, makes gradual\\n\\t\\t\\t\\tprogress, like a man going from darkness into light. So\\n\\t\\t\\t\\tthe Qur-an was revealed by stages. So all revelation from\\n\\t\\t\\t\\tAllah comes by stages. As usual, there are two parallel\\n\\t\\t\\t\\tmeanings: (1) that connected with the occasion of direct\\n\\t\\t\\t\\tinspiration to the holy Prophet; and (2) the more general\\n\\t\\t\\t\\tMessage to mankind for all time. Everyone who understands\\n\\t\\t\\t\\tthe Message must declare it, in words, and still more, in\\n\\t\\t\\t\\this conduct."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "6",
    "NoteID": "6085",
    "Body": "The particular occasion was an assurance to the Prophet,\\n\\t\\t\\t\\tthat though he was unleftered, the Message given to him\\n\\t\\t\\t\\twould be preserved in his heart and in the hearts of men.\\n\\t\\t\\t\\tThe more general sense is that mankind, having once\\n\\t\\t\\t\\tseized great spiritual truths, will hold fast to them,\\n\\t\\t\\t\\texcept as qualified in the following verse."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "7",
    "NoteID": "6086",
    "Body": "There can be no question of this having any reference to\\n\\t\\t\\t\\tthe abrogation of any verses of the Qur-an. For this Sura\\n\\t\\t\\t\\tis one of the earliest revealed, being placed about\\n\\t\\t\\t\\teighth according to the most accepted chronological\\n\\t\\t\\t\\torder. While the basic principles of Allah's Law remain\\n\\t\\t\\t\\tthe same, its form, expression, and application have\\n\\t\\t\\t\\tvaried from time to time, e.g., from Moses to Jesus, and\\n\\t\\t\\t\\tfrom Jesus to Muhammad. It is one of the beneficent\\n\\t\\t\\t\\tmercies of Allah that we should forget some things of the\\n\\t\\t\\t\\tpast, lest our minds become confused and our development\\n\\t\\t\\t\\tis retarded. Besides, Allah knows what is manifest and\\n\\t\\t\\t\\twhat is hidden, and His Will and Plan work with supreme\\n\\t\\t\\t\\twisdom and goodness."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "8",
    "NoteID": "6087",
    "Body": "The Path of Islam is simple and easy. It depends on no\\n\\t\\t\\t\\tabstruse mysteries or self-mortifications, but on\\n\\t\\t\\t\\tstraight and manly conduct in accordance with the laws of\\n\\t\\t\\t\\tman's nature as implanted in him by Allah (xxx. 30). On\\n\\t\\t\\t\\tthe other hand, spiritual perfection may be most\\n\\t\\t\\t\\tdifficult, for it involves complete surrender on our part\\n\\t\\t\\t\\tto Allah in all our affairs, thoughts, and desires: but\\n\\t\\t\\t\\tafter that surrender Allah's Grace will make our path\\n\\t\\t\\t\\teasy."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "9",
    "NoteID": "6088",
    "Body": "This is not so strong as the Biblical phrase, \"Cast not\\n\\t\\t\\t\\tpearls before swine\" (Man. vii. 6). The cases where\\n\\t\\t\\t\\tadmonition does produce spiritual profit and where it\\n\\t\\t\\t\\tdoes not, are mentioned below in verses 10 and 11-13\\n\\t\\t\\t\\trespectively. Allah's Message should be proclaimed to\\n\\t\\t\\t\\tall: but particular and personal admonitions are also due\\n\\t\\t\\t\\tto those who attend and in whose hearts is the fear of\\n\\t\\t\\t\\tAllah; in the case of those who run away from it and\\n\\t\\t\\t\\tdishonour it, such particular and personal admonition is\\n\\t\\t\\t\\tuseless. They are the unfortunate ones who prepare their\\n\\t\\t\\t\\town ruin."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "12",
    "NoteID": "6089",
    "Body": "The Great Fire is the final Penalty or Disaster in the\\n\\t\\t\\t\\tHereafter, as contrasted with the minor Penalties or\\n\\t\\t\\t\\tDisasters from which all evil suffers from within in this\\n\\t\\t\\t\\tvery life."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "13",
    "NoteID": "6090",
    "Body": "A terrible picture of those who ruin their whole future\\n\\t\\t\\t\\tby evil lives here below. They introduce a discord into\\n\\t\\t\\t\\tCreation, while life should be one great universal\\n\\t\\t\\t\\tconcord. And their past clings to them as part of their\\n\\t\\t\\t\\town will. They are not even like the dry swarthy stubble\\n\\t\\t\\t\\tmentioned in verse 5 above, which grew naturally out of\\n\\t\\t\\t\\tthe luscious pasture, for they have grown harmful, in\\n\\t\\t\\t\\tdefiance of their own nature. \"Neither die nor five\": Cf.\\n\\t\\t\\t\\txx. 74."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "14",
    "NoteID": "6091",
    "Body": "Prosper. in the highest sense; attain to Bliss or\\n\\t\\t\\t\\tSalvation; as opposed to \"enter the Fire\"."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "14",
    "NoteID": "6092",
    "Body": "The first process in godliness is to cleanse ourselves in\\n\\t\\t\\t\\tbody, mind, and soul. Then we shall be in a fit state to\\n\\t\\t\\t\\tsee and proclaim the Glory of Allah. That leads us to our\\n\\t\\t\\t\\tactual absorption in Praise and Prayer."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "18",
    "NoteID": "6093",
    "Body": "The law of righteousness and godliness is not a new law,\\n\\t\\t\\t\\tnor are the vanity and short duration of this world\\n\\t\\t\\t\\tpreached here for the first time. But spiritual truths\\n\\t\\t\\t\\thave to be renewed and reiterated again and again."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "19",
    "NoteID": "6094",
    "Body": "No Book of Abraham has come down to us. But the Old\\n\\t\\t\\t\\tTestament recognises that Abraham was a prophet (Gen. xx.\\n\\t\\t\\t\\t7). There is a book in Greek, which has been translated\\n\\t\\t\\t\\tby Mr. G.H. Box, called the Testament of Abraham\\n\\t\\t\\t\\t(published by the Society for the Promotion of Christian\\n\\t\\t\\t\\tKnowledge, London, 1927). It seems to be a Greek\\n\\t\\t\\t\\ttranslation of a Hebrew original. The Greek Text was\\n\\t\\t\\t\\tprobably written in the second Christian century, in\\n\\t\\t\\t\\tEgypt, but in its present form it probably goes back only\\n\\t\\t\\t\\tto the 9th or 10th Century. It was popular among the\\n\\t\\t\\t\\tChristians. Perhaps the Jewish Midrash also refers to a\\n\\t\\t\\t\\tTestament of Abraham."
  },
  {
    "SurahNumber": "87",
    "AyahNumber": "19",
    "NoteID": "6095",
    "Body": "The original Revelation of Moses, of which the Present\\n\\t\\t\\t\\tPentateuch is a surviving recension. See Appendix 11, The\\n\\t\\t\\t\\tpresent Gospels do not come under the definition of the\\n\\t\\t\\t\\t\"earliest\" Books. Nor could they be called \"Books of\\n\\t\\t\\t\\tJesus': they were written not by him, but about him, and\\n\\t\\t\\t\\tlong after his death."
  }
]
