[
  {
    "SurahNumber": "94",
    "AyahNumber": "1",
    "NoteID": "6188",
    "Body": "Cf. the prayer of Moses in xx. 25. The breast is\\n\\t\\t\\t\\tsymbolically the seat of knowledge and the highest\\n\\t\\t\\t\\tfeelings of love and affection, the treasure-house in\\n\\t\\t\\t\\twhich are stored the jewels of that quality of human\\n\\t\\t\\t\\tcharacter which approaches nearest to the divine. The\\n\\t\\t\\t\\tholy Prophet's human nature had been purified, expanded,\\n\\t\\t\\t\\tand elevated, so that he became a Mercy to all Creation.\\n\\t\\t\\t\\tSuch a nature could afford to ignore the lower motives of\\n\\t\\t\\t\\tordinary humanity which caused shameful attacks to be\\n\\t\\t\\t\\tmade on him. Its strength and courage could also bear the\\n\\t\\t\\t\\tburden of the galling work which it had to do in\\n\\t\\t\\t\\tdenouncing sin, subduing it, and protecting Allah's\\n\\t\\t\\t\\tcreatures from its oppression."
  },
  {
    "SurahNumber": "94",
    "AyahNumber": "2",
    "NoteID": "6189",
    "Body": "See last note. It is indeed a grievous and galling burden\\n\\t\\t\\t\\tfor a man to fight single-handed against sin. But Allah\\n\\t\\t\\t\\tsends His grace and aid, and that burden is removed, or\\n\\t\\t\\t\\tconverted into joy and triumph in the service of the One\\n\\t\\t\\t\\tTrue God."
  },
  {
    "SurahNumber": "94",
    "AyahNumber": "4",
    "NoteID": "6190",
    "Body": "The Prophet's virtues, the magnanimity of his character,\\n\\t\\t\\t\\tand his love for mankind were fully recognised even in\\n\\t\\t\\t\\this lifetime, and his name stands highest among the\\n\\t\\t\\t\\theroic leaders of mankind. The phrase used here is more\\n\\t\\t\\t\\tcomprehensive in meaning than that used for various\\n\\t\\t\\t\\tprophets in xxxvii. 119 etc.; \"We left this blessing for\\n\\t\\t\\t\\tthem among generations to come in later times\"."
  },
  {
    "SurahNumber": "94",
    "AyahNumber": "5",
    "NoteID": "6191",
    "Body": "This verse is repeated for extra emphasis. Whatever\\n\\t\\t\\t\\tdifficulties or troubles are encountered by men, Allah\\n\\t\\t\\t\\talways provides a solution, a way out, a relief, a way to\\n\\t\\t\\t\\tlead to ease and happiness, if we only follow His Path\\n\\t\\t\\t\\tand show our Faith by patience and well-doing. The\\n\\t\\t\\t\\tsolution or relief does not merely come after the\\n\\t\\t\\t\\tDifficulty: it is provided with it. I understand the\\n\\t\\t\\t\\tdefinite article in al-'usr in a generic sense, and\\n\\t\\t\\t\\ttranslate: \"every difficulty\". In xcii. 7, I have\\n\\t\\t\\t\\ttranslated Yusr as Bliss, and in xcii. 10 'Usr as Misery."
  },
  {
    "SurahNumber": "94",
    "AyahNumber": "7",
    "NoteID": "6192",
    "Body": "When thou art free: or when thou art relieved. The words\\n\\t\\t\\t\\tunderstood may be: from thy immediate task, that of\\n\\t\\t\\t\\tpreaching to men, denouncing sin, and encouraging\\n\\t\\t\\t\\trighteousness; or, from the difficulties that confronted\\n\\t\\t\\t\\tthee. When that happens, that does not finish the labours\\n\\t\\t\\t\\tof the man of Allah. It is only one step to them. He has\\n\\t\\t\\t\\tconstantly and insistently to go on. When there is rest\\n\\t\\t\\t\\tfrom the task of instructing the world, the contact with\\n\\t\\t\\t\\tthe spiritual kingdom continues, and indeed it becomes\\n\\t\\t\\t\\tmore intimate and concentrated."
  },
  {
    "SurahNumber": "94",
    "AyahNumber": "8",
    "NoteID": "6193",
    "Body": "The kingdom of Allah is everything. Other things are\\n\\t\\t\\t\\tincidental, and really do not matter. Worldly greatness\\n\\t\\t\\t\\tor success may be a means to an end, but it may also be a\\n\\t\\t\\t\\thindrance to true spiritual greatness. Allah is the goal\\n\\t\\t\\t\\tof the righteous man's whole attention and desire."
  }
]
