[
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "The plural \"you\" indicates that the whole community is thus addressed."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "2",
    "Body": "See  2:228  and the corresponding notes, especially note\\n\\t\\t\\t\\t[215]. - Most of the great jurists hold the view that the\\n\\t\\t\\t\\trequired three pronouncements of divorce, which make it\\n\\t\\t\\t\\tfinal and irrevocable (cf. first paragraph of  2:229 ,\\n\\t\\t\\t\\tmust be made singly, i.e., spaced over the waiting-period\\n\\t\\t\\t\\tof three months, so as to give the husband time to\\n\\t\\t\\t\\treconsider his intention, and thus to prevent a hasty act\\n\\t\\t\\t\\twhich might be subsequently regretted. This provision is\\n\\t\\t\\t\\tin tune with the well-authenticated saying of the\\n\\t\\t\\t\\tProphet, \"In the sight of God, the most hateful of all\\n\\t\\t\\t\\tthings allowed (abghad al-halali) is divorce\" (Abu Da'ud,\\n\\t\\t\\t\\ton the authority of 'Abd Allah ibn 'Umar). In other\\n\\t\\t\\t\\twords, divorce is just barely permissible, and must not\\n\\t\\t\\t\\tbe resorted to unless it is absolutely evident that\\n\\t\\t\\t\\tnothing can save the marriage from utter hopelessness."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "3",
    "Body": "I.e. during the waiting-period. As shown in verse {6}\\n\\t\\t\\t\\tbelow, during that period the husband is fully\\n\\t\\t\\t\\tresponsible for the maintenance of the wife whom he is\\n\\t\\t\\t\\tdivorcing in accordance with the standard of living\\n\\t\\t\\t\\tobserved during their married life."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "4",
    "Body": "E.g., by their husbands' failure to provide for their\\n\\t\\t\\t\\tmaintenance. (This particular injunction does not imply a\\n\\t\\t\\t\\tprohibition of a divorced woman's leaving her home of her\\n\\t\\t\\t\\town free will.)"
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "5",
    "Body": "Implying that in such a case she may be lawfully turned\\n\\t\\t\\t\\tout of her marital home. Regarding the term fahishah\\n\\t\\t\\t\\t(\"immoral conduct\"), see surah {4}, note [14]."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "1",
    "NoteID": "6",
    "Body": "According to Ibn 'Abbas (as quoted by Razi) and several\\n\\t\\t\\t\\tother authorities (see Ibn Kathir), this is an allusion\\n\\t\\t\\t\\tto the possibility of reconciliation and, hence, a\\n\\t\\t\\t\\tresumption of marital relations before the divorce\\n\\t\\t\\t\\tbecomes final (see surah {2}, second part of verse {228}\\n\\t\\t\\t\\tand first paragraph of {229})."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "2",
    "NoteID": "7",
    "Body": "Lit., \"from yourselves\": i.e., persons who are\\n\\t\\t\\t\\tsufficiently acquainted with the circumstances of the\\n\\t\\t\\t\\tcase."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "2",
    "NoteID": "8",
    "Body": "Sc., that the relevant decision has not been made in a\\n\\t\\t\\t\\tfrivolous spirit."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "3",
    "NoteID": "9",
    "Body": "Lit., \"whence he does not expect\". It is to be noted that\\n\\t\\t\\t\\tthe relative pronoun man (\"whoever\" or \"everyone who\") -\\n\\t\\t\\t\\talthough grammatically requiring the use of the masculine\\n\\t\\t\\t\\tgender in the verbs or pronouns to which it relates -\\n\\t\\t\\t\\tapplies to persons of either sex, as is evidenced by\\n\\t\\t\\t\\tinnumerable passages in the Qur'an: hence, the present\\n\\t\\t\\t\\tpassage, too, including the sentence that follows, must\\n\\t\\t\\t\\tbe understood as relating to the women as well as to the\\n\\t\\t\\t\\tmen in question; and the same holds good of verses {5}\\n\\t\\t\\t\\tand {11} below."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "4",
    "NoteID": "10",
    "Body": "I.e., for any physiological reason whatever."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "4",
    "NoteID": "11",
    "Body": "Lit., \"He grants ease out of his condition\" - i.e., makes\\n\\t\\t\\t\\this condition easy: the implication being that\\n\\t\\t\\t\\tGod-consciousness makes it easy for the believer to\\n\\t\\t\\t\\tsubmit gladly to whatever God may decree."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "6",
    "NoteID": "12",
    "Body": "Lit., \"let them dwell wherever you dwell\" - i.e.,\\n\\t\\t\\t\\ttropically, \"let them share fully your standard of\\n\\t\\t\\t\\tliving\"."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "6",
    "NoteID": "13",
    "Body": "E.g., for reasons of her health, or because she intends\\n\\t\\t\\t\\tto remarry, etc."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "6",
    "NoteID": "14",
    "Body": "I.e., at the father's expense: see  2:233  and the\\n\\t\\t\\t\\tcorresponding notes [219] and [220]."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "7",
    "NoteID": "15",
    "Body": "Lit., \"out of\"."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "8",
    "NoteID": "16",
    "Body": "This connects with, and stresses, the fact that all the\\n\\t\\t\\t\\tpreceding injunctions are divinely ordained."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "9",
    "NoteID": "17",
    "Body": "See note [4] on  64:5 ."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "12",
    "NoteID": "18",
    "Body": "See surah {2}, note [20]."
  },
  {
    "SurahNumber": "65",
    "AyahNumber": "12",
    "NoteID": "19",
    "Body": "Lit., \"the command\". The verbal form yatanazzalu implies\\n\\t\\t\\t\\trecurrence and continuity; its combination with the noun\\n\\t\\t\\t\\tal-amr reflects the concept of God's unceasing creative\\n\\t\\t\\t\\tactivity."
  }
]
