[
  {
    "SurahNumber": "85",
    "AyahNumber": "2",
    "NoteID": "1",
    "Body": "I.e., the Day of Resurrection."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "By creating the universe, God \"bears witness\", as it\\n\\t\\t\\t\\twere, to His Own almightiness and uniqueness: cf.  3:18 \\n\\t\\t\\t\\t- \"God [Himself] bears witness that there is no deity\\n\\t\\t\\t\\tsave Him\" - and the corresponding note [11]."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "For an explanation of this rendering of qutila, see note\\n\\t\\t\\t\\t[9] on {74:19-20}."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "Lit., \"those responsible (ashab) for the pit of fire\\n\\t\\t\\t\\tabounding in fuel\". In order to explain this parabolic\\n\\t\\t\\t\\tpassage, the commentators interpret it - quite\\n\\t\\t\\t\\tunnecessarily - in the past tense, and advance the most\\n\\t\\t\\t\\tcontradictory legends meant to \"identify\", those\\n\\t\\t\\t\\tevildoers in historical terms. The result is a medley of\\n\\t\\t\\t\\tstories ranging from Abraham's experiences with his\\n\\t\\t\\t\\tidolatrous contemporaries (cf. {21:68-70}) to the\\n\\t\\t\\t\\tBiblical legend of Nebuchadnezzar's attempt to burn three\\n\\t\\t\\t\\tpious Israelites in a fiery furnace (The Book of Daniel\\n\\t\\t\\t\\tiii, 19 ff.), or the persecution, in the sixth century,\\n\\t\\t\\t\\tof the Christians of Najran by the King of Yemen, Dhu\\n\\t\\t\\t\\tNawas (who was a Jew by religion), or the entirely\\n\\t\\t\\t\\tapocryphal story of a Zoroastrian king who burnt to death\\n\\t\\t\\t\\tthose of his subjects who refused to accept his dictum\\n\\t\\t\\t\\tthat a marriage of brother and sister was \"permitted by\\n\\t\\t\\t\\tGod\"; and so forth. None of these legends needs, of\\n\\t\\t\\t\\tcourse, to be seriously considered in this context. As a\\n\\t\\t\\t\\tmatter of fact, the very anonymity of the evildoers\\n\\t\\t\\t\\treferred to in the above Qur'anic passage shows that we\\n\\t\\t\\t\\thave here a parable and not an allusion to \"historical\"\\n\\t\\t\\t\\tor even legendary events. The persecutors are people who\\n\\t\\t\\t\\thaving no faith whatsoever, hate to see faith in others\\n\\t\\t\\t\\t(see verse {8} below); the \"pit of fire\" is a metaphor\\n\\t\\t\\t\\tfor the persecution of the latter by the former a\\n\\t\\t\\t\\tphenomenon not restricted to any particular time or to a\\n\\t\\t\\t\\tparticular people but recurring in many forms and in\\n\\t\\t\\t\\tvarying degrees of intensity throughout recorded history."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "Lit., \"as they sit over it, the while they witness all\\n\\t\\t\\t\\tthat they are doing...\", etc."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "10",
    "NoteID": "6",
    "Body": "Lit., \"through burning\"."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "11",
    "NoteID": "7",
    "Body": "This is almost certainly the earliest Qur'anic reference\\n\\t\\t\\t\\tto \"gardens through which running waters flow\" as an\\n\\t\\t\\t\\tallegory of the bliss which awaits the righteous in the\\n\\t\\t\\t\\thereafter."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "15",
    "NoteID": "8",
    "Body": "Lit., \"He of the sublime throne of almightiness (al-'arsh\\n\\t\\t\\t\\tal-majid)\". For my rendering of al-'arsh as \"the throne\\n\\t\\t\\t\\tof almightiness\", see  7:54  and the corresponding note\\n\\t\\t\\t\\t[43]."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "18",
    "NoteID": "9",
    "Body": "Sc., \"both of which were destroyed because of their\\n\\t\\t\\t\\tsins\". The story of Pharaoh and his forces, and their\\n\\t\\t\\t\\tdestruction by drowning, is referred to many times in the\\n\\t\\t\\t\\tQur'an; for the story of the Thamud see, in particular,\\n\\t\\t\\t\\t 7:73  ff. and the corresponding notes [56-62]."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "20",
    "NoteID": "10",
    "Body": "Lit., \"from behind them\", an idiomatic phrase denoting a\\n\\t\\t\\t\\thappening imperceptible to those whom it closely\\n\\t\\t\\t\\tconcerns."
  },
  {
    "SurahNumber": "85",
    "AyahNumber": "22",
    "NoteID": "11",
    "Body": "Lit., \"upon a well-guarded tablet (lawh mahfuz)\" - a\\n\\t\\t\\t\\tdescription of the Qur'an to be found only in this one\\n\\t\\t\\t\\tinstance. Although some commentators take it in its\\n\\t\\t\\t\\tliteral sense and understand by it an actual \"heavenly\\n\\t\\t\\t\\ttablet\" upon which the Qur'an is inscribed since all\\n\\t\\t\\t\\teternity, to many others the phrase has always had a\\n\\t\\t\\t\\tmetaphorical meaning: namely, an allusion to the\\n\\t\\t\\t\\timperishable quality of this divine writ. This\\n\\t\\t\\t\\tinterpretation is pointedly mentioned as justified by,\\n\\t\\t\\t\\te.g., Tabari, Baghawi, Razi or Ibn Kathir, all of whom\\n\\t\\t\\t\\tagree that the phrase \"upon a well-guarded tablet\"\\n\\t\\t\\t\\trelates to God's promise that the Qur'an would never be\\n\\t\\t\\t\\tcorrupted, and would remain free of all arbitrary\\n\\t\\t\\t\\tadditions, diminutions and textual changes. See in this\\n\\t\\t\\t\\tconnection also  15:9  and the corresponding note [10]."
  }
]
