[
  {
    "SurahNumber": "28",
    "AyahNumber": "1",
    "Text": "Tua Sin M'im."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "2",
    "Text": "These are the verses of the Glorious Book that makes the things\\n\\t\\t\\tclear."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "3",
    "Text": "In all truth, We narrate to you some information about Musa\\n\\t\\t\\t(Moses) and Fir'on (Pharaoh) for the instruction of the\\n\\t\\t\\tbelievers."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "4",
    "Text": "The fact is that Fir'on elevated himself in the land and divided\\n\\t\\t\\tits residents into groups, one group of which he persecuted,\\n\\t\\t\\tputting their sons to death and sparing only their females.\\n\\t\\t\\tIndeed he was one of the mischief-makers."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "5",
    "Text": "But We wanted to favor those who were oppressed in the land, and\\n\\t\\t\\tmake them leaders, and make them the heirs,"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "6",
    "Text": "establish them in the land, and show Fir'on, Haman and their\\n\\t\\t\\twarriors at their hands the same which they feared."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "7",
    "Text": "So We revealed Our will to the mother of Musa: \"Suckle him, and\\n\\t\\t\\twhen you feel any danger to his life, cast him into the river\\n\\t\\t\\twithout any fear or grief; for We shall certainly restore him to\\n\\t\\t\\tyou and make him one of Our Rasools.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "8",
    "Text": "We made Fir'on's family pick him up from the river: it was\\n\\t\\t\\tintended that Musa may become their adversary and a cause of\\n\\t\\t\\ttheir sorrow; for Fir'on, Haman and their warriors were all\\n\\t\\t\\tsinners."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "9",
    "Text": "The wife of Fir'on said: \"This child may become the comfort of\\n\\t\\t\\tthe eyes for me and for you. Do not kill him. He may prove useful\\n\\t\\t\\tto us or it may be that we will adopt him as our son.\" They were\\n\\t\\t\\tunaware of the result of what they were doing."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "10",
    "Text": "On the other hand, the heart of Musa's mother was sorely\\n\\t\\t\\ttroubled. She would have disclosed as to who he was, had We not\\n\\t\\t\\tstrengthened her heart so that she might become one of the true\\n\\t\\t\\tbelievers."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "11",
    "Text": "She said to Musa's sister: \"Go, and follow him.\" So she (Musa's\\n\\t\\t\\tsister) watched him from a distance in such a way that the other\\n\\t\\t\\tdid not notice it."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "12",
    "Text": "We had already ordained that he would refuse to suck any foster\\n\\t\\t\\tmother. His sister came to Fir'on's wife and said: \"Shall I point\\n\\t\\t\\tout to you a house whose people will take care of him for you and\\n\\t\\t\\tthey will be sincere to him?\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "13",
    "Text": "Thus did We restore him to his mother that her eye might be\\n\\t\\t\\tcomforted, that she might not grieve and that she might know that\\n\\t\\t\\tthe promise of Allah is true. Yet most of the people do not\\n\\t\\t\\tunderstand."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "14",
    "Text": "When he reached maturity and became full-grown, We bestowed on\\n\\t\\t\\thim wisdom and knowledge. Thus do We reward the righteous."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "15",
    "Text": "One day he entered the city at a time when its, people were not\\n\\t\\t\\tyet active, he found two men reaching to each others throats; one\\n\\t\\t\\twas from his own race and the other of his foes. The man of his\\n\\t\\t\\town race appealed for his help against his foe, thereupon Musa\\n\\t\\t\\tgave his foe a blow which killed him. On seeing what he has done\\n\\t\\t\\the said: \"This is the work of Shaitan, surely he is an enemy that\\n\\t\\t\\topenly misleads.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "16",
    "Text": "Then he prayed: \"O my Rabb! I have indeed wronged my soul, please\\n\\t\\t\\tforgive me.\" So Allah forgave him, surely He is the Forgiving,\\n\\t\\t\\tthe Merciful."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "17",
    "Text": "Musa promised: \"O my Rabb! After this favor that You have\\n\\t\\t\\tbestowed on me, I shall never be a helping hand to the\\n\\t\\t\\tcriminals.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "18",
    "Text": "Next morning as he was walking in the city in fear and caution,\\n\\t\\t\\tsuddenly he saw the same man who he had helped the day before\\n\\t\\t\\tcried out to him again for help. Musa replied: \"You are certainly\\n\\t\\t\\ta misguided person.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "19",
    "Text": "Then when Musa was about to lay his hands on a man who was an\\n\\t\\t\\tenemy to both of them, he cried out: \"O Musa! Do you intend to\\n\\t\\t\\tkill me as you killed a person yesterday? You only want to become\\n\\t\\t\\ta tyrant in the land and have no intention of reforming\\n\\t\\t\\tanything.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "20",
    "Text": "At that time, there came a man running from the other end of the\\n\\t\\t\\tcity and said: \"O Musa! The chiefs are plotting to kill you,\\n\\t\\t\\ttherefore, run away, surely I am your well wisher.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "21",
    "Text": "Hearing this, Musa left that place in fear and caution, praying:\\n\\t\\t\\t\"O my Rabb! Deliver me from the nation of wrongdoers.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "22",
    "Text": "As he made his way towards Madyan, he said: \"Soon my Rabb shall\\n\\t\\t\\tguide me to the Right Way.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "23",
    "Text": "When he arrived at the well of Madyan, he saw a multitude of men\\n\\t\\t\\twatering their flocks, and besides them two women who were\\n\\t\\t\\tkeeping their flocks back. He asked: \"What is the problem?\" They\\n\\t\\t\\treplied: \"We cannot water our flocks until the shepherds take\\n\\t\\t\\taway their flocks from the water, because we are weak and our\\n\\t\\t\\tfather is a very old man.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "24",
    "Text": "So he watered their flocks for them and went back to the shade\\n\\t\\t\\tand prayed: \"O Rabb! Surely I am in desperate need of whatever\\n\\t\\t\\tgood that You may send down to me.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "25",
    "Text": "Soon after that, one of the two women came to him walking\\n\\t\\t\\tbashfully and said: \"My father is calling you. He wishes to\\n\\t\\t\\treward you for watering our flocks for us.\" When Musa came to him\\n\\t\\t\\tand narrated his story, the old man said: \"Have no fear. You have\\n\\t\\t\\tescaped from those wicked people.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "26",
    "Text": "One of the daughters said: \"Father, hire this man. The best that\\n\\t\\t\\tone can hire is a man who is strong and trustworthy.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "27",
    "Text": "The old man said to Musa: \"I am willing to give you one of my\\n\\t\\t\\tdaughters in marriage if you stay in my service for eight years;\\n\\t\\t\\tbut you may complete ten if you wish. I do not want to put you in\\n\\t\\t\\ttrouble; Allah willing, you will find me one of the righteous.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "28",
    "Text": "Musa replied: \"So be it an agreement between me and you.\\n\\t\\t\\tWhichever of the two terms I complete, let there be no compulsion\\n\\t\\t\\ton me. Allah is the witness to what we have agreed upon.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "29",
    "Text": "After completing the term of his agreement, when Musa (Moses) was\\n\\t\\t\\ttravelling with his family, he saw a fire in the direction of\\n\\t\\t\\tMount Tur. He said to his family: \"Stay here, I saw a fire, I\\n\\t\\t\\thope to bring some information from there or a lighted torch with\\n\\t\\t\\twhich you may warm yourselves.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "30",
    "Text": "But when he reached there, a voice called out to him from the\\n\\t\\t\\tright side of the valley of the blessed spot from a tree ,\\n\\t\\t\\tsaying: \"O Musa, surely I am Allah the Rabb of the Worlds.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "31",
    "Text": "Then Allah commanded, \"Throw down your staff.\" When Musa saw that\\n\\t\\t\\tthe staff was writhing like a snake, he turned his back and fled,\\n\\t\\t\\tand did not even look behind. Allah said, \"O Musa, come back and\\n\\t\\t\\tdo not fear; you are quite safe."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "32",
    "Text": "Now put your hand into your pocket: it will come out shining\\n\\t\\t\\twhite without any harm to you - whenever you feel afraid, draw\\n\\t\\t\\tyour hand towards yourself to ward off fear - these are two\\n\\t\\t\\tcredentials from your Rabb towards Fir'on and his chiefs, surely\\n\\t\\t\\tthey are wicked people.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "33",
    "Text": "Musa submitted: \"Rabb! I have killed one of them: I fear that\\n\\t\\t\\tthey will put me to death."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "34",
    "Text": "My brother Haroon (Aaron), he is more eloquent in speech than I:\\n\\t\\t\\tsend him with me as a helper to confirm my words; I fear that\\n\\t\\t\\tthey will treat me as a liar.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "35",
    "Text": "Allah replied: \"We will certainly strengthen your arm with your\\n\\t\\t\\tbrother and give both of you such authority that they shall not\\n\\t\\t\\tbe able to harm you. Now proceed with Our signs. You, and those\\n\\t\\t\\twho follow you, will surely triumph.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "36",
    "Text": "When Musa (Moses) came to them (Fir'on and his chiefs) with Our\\n\\t\\t\\tclear signs and invited them to Islam, they said: \"This is\\n\\t\\t\\tnothing but baseless sorcery; we never heard such a thing in the\\n\\t\\t\\ttime of our forefathers.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "37",
    "Text": "Musa stated: \"My Rabb knows best who it is that comes with\\n\\t\\t\\tguidance from Him and who will gain the reward of the hereafter;\\n\\t\\t\\tsurely the wrongdoers will not attain felicity.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "38",
    "Text": "Fir'on said: \"O Chiefs! You have no other god that I know of,\\n\\t\\t\\texcept myself. O Haman! Bake for me bricks from clay and build me\\n\\t\\t\\ta high tower so that I may climb it to see the God of Musa; most\\n\\t\\t\\tsurely I think him to be one of the liars.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "39",
    "Text": "He and his warriors were arrogant in the land without any right;\\n\\t\\t\\tthey thought that they would never be brought back to Us."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "40",
    "Text": "So We seized him and his warriors, and flung them into the sea.\\n\\t\\t\\tSee what was the end of wrongdoers?"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "41",
    "Text": "We made them leaders who started calling people to hellfire, but\\n\\t\\t\\ton the Day of Resurrection they will not get any help."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "42",
    "Text": "We laid a curse on them in this world, and on the Day of\\n\\t\\t\\tResurrection they will be of the despised."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "43",
    "Text": "We gave Musa (Moses) the Book (Torah), after We had destroyed the\\n\\t\\t\\tformer generations, an eye opener, a guide, and a blessing so\\n\\t\\t\\tthat they may be reminded."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "44",
    "Text": "O Muhammad, you were not present on the western side of the\\n\\t\\t\\tmountain when We gave Musa the Law, nor did you witness that\\n\\t\\t\\tevent."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "45",
    "Text": "We raised many generations and a long time has passed over them;\\n\\t\\t\\tyou were not living among the people of Madyan, reciting to them\\n\\t\\t\\tOur revelations; but it is We Who are sending to you the news of\\n\\t\\t\\tthat time."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "46",
    "Text": "Nor were you at the side of the mountain of Tur when We called\\n\\t\\t\\tout to Musa, but it is your Rabb's mercy that you are being given\\n\\t\\t\\tthis information so that you may forewarn a nation to whom no\\n\\t\\t\\tWarner had come before you. Maybe they will take heed,"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "47",
    "Text": "so that they may not be able to say, when a disaster befalls them\\n\\t\\t\\ton account of their misdeeds: \"Our Rabb, had You sent us a\\n\\t\\t\\tRasool, we should have followed Your revelations and became the\\n\\t\\t\\tbelievers.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "48",
    "Text": "Now that the Truth has come to them from Us, they are saying:\\n\\t\\t\\t\"Why is he (Muhammad) not given the like of what was given to\\n\\t\\t\\tMusa?\" Have they not rejected that which was given to Musa\\n\\t\\t\\tbefore? They claim: \"These (Torah and Qur'an) are the two works\\n\\t\\t\\tof sorcery complementing each other!\" And they say: \"We believe\\n\\t\\t\\tin neither.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "49",
    "Text": "Ask them: \"Bring a Book from Allah which is a better guide than\\n\\t\\t\\tthese two, I will follow it, if what you say be true!\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "50",
    "Text": "So if they do not meet this demand, you should know that they\\n\\t\\t\\tonly follow their own desires. And who is more misguided than the\\n\\t\\t\\tone who follows his own desires rather than the guidance from\\n\\t\\t\\tAllah? In fact, Allah does not guide such wrongdoing people."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "51",
    "Text": "We have conveyed Our Word to them over and over again in order\\n\\t\\t\\tthat they may take heed."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "52",
    "Text": "Those to whom the scriptures were given before this (Jews and\\n\\t\\t\\tChristians), they do recognize the Truth and believe in this\\n\\t\\t\\t(Qur'an)."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "53",
    "Text": "When it is recited to them they say: \"We believe in it, surely\\n\\t\\t\\tthis is the Truth from our Rabb: indeed we were Muslims even\\n\\t\\t\\tbefore this.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "54",
    "Text": "They are the ones who will be given their reward twice, because\\n\\t\\t\\tthey have endured with fortitude, repelling evil with good and\\n\\t\\t\\tgiving in charity out of what We have given them."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "55",
    "Text": "When they hear vain talk, they withdraw from it saying: \"Our\\n\\t\\t\\tdeeds are for us and yours for you; peace be on to you: we do not\\n\\t\\t\\tdesire the way of ignorant.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "56",
    "Text": "O Prophet, you cannot give guidance to whom you wish, it is Allah\\n\\t\\t\\tWho gives guidance to whom He pleases, and He is quite aware of\\n\\t\\t\\tthose who are guided."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "57",
    "Text": "Those who do not wish to be guided say: \"If we go along with you\\n\\t\\t\\tand accept this guidance, we shall be driven out from our land.\"\\n\\t\\t\\tBut have We not given them a secure sanctuary to which are\\n\\t\\t\\tbrought the fruits of all kinds as a provision from Us? But most\\n\\t\\t\\tof them have no knowledge."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "58",
    "Text": "How many towns have We destroyed who once flourished in their\\n\\t\\t\\teconomy? Just see those dwellings of theirs, only a few of which\\n\\t\\t\\thave been inhabited after them; at last We Alone became their\\n\\t\\t\\tinheritors."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "59",
    "Text": "Your Rabb would never destroy the towns until He had sent in\\n\\t\\t\\ttheir metropolis a Rasool, proclaiming to them Our revelations;\\n\\t\\t\\tand We would not destroy towns except when their dwellers had\\n\\t\\t\\tbecome wrongdoers."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "60",
    "Text": "The things which you have been given are but the provisions and\\n\\t\\t\\tadornments of this worldly life; and that which is with Allah is\\n\\t\\t\\tbetter and more lasting. Why don't you use your common sense?"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "61",
    "Text": "Can a person to whom We have made a handsome promise and he is\\n\\t\\t\\tsure to receive it, be like the one to whom We have only given\\n\\t\\t\\tthe provisions of this world and he is scheduled to be presented\\n\\t\\t\\ton the Day of Resurrection for punishment?"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "62",
    "Text": "Let them not forget that Day when We shall call them and ask:\\n\\t\\t\\t\"Where are those whom you deemed to be My associates?\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "63",
    "Text": "Those who are proven guilty as charged will say: \"Our Rabb! These\\n\\t\\t\\tare the ones whom we led astray; we led them astray as we were\\n\\t\\t\\tastray ourselves. However, we plead our innocence before You; it\\n\\t\\t\\twas not us that they worshipped.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "64",
    "Text": "Then they will be told: \"Appeal to your shoraka' (associate\\n\\t\\t\\tgods),\" so they will appeal them but will get no answer. They\\n\\t\\t\\twill see the punishment and wish that they had accepted guidance."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "65",
    "Text": "Let them also not forget that, on that Day, He will call them and\\n\\t\\t\\task: \"How did you answer Our Rasools?\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "66",
    "Text": "They will be so confused on that Day that they will not even ask\\n\\t\\t\\tone another."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "67",
    "Text": "However, the one who has repented in this life, and believed, and\\n\\t\\t\\tdone good deeds may hope to be among those who will achieve\\n\\t\\t\\tsalvation."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "68",
    "Text": "Your Rabb creates whatever He wills and chooses for His work whom\\n\\t\\t\\tHe pleases. It is not for them (mushrikin) to choose and assign\\n\\t\\t\\tthe powers of Allah to whom they want. Glory be to Allah! He is\\n\\t\\t\\tfar above the shirk that these people commit."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "69",
    "Text": "Your Rabb knows all that they conceal in their hearts and all\\n\\t\\t\\tthat they reveal."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "70",
    "Text": "He is Allah; there is no god but Him. Praise belongs to Him in\\n\\t\\t\\tthis world and in the hereafter: His is the Judgement and to Him\\n\\t\\t\\tyou all shall be brought back."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "71",
    "Text": "O Prophet, ask them: \"Have you ever considered that if Allah were\\n\\t\\t\\tto make the night perpetual till the Day of Resurrection, which\\n\\t\\t\\tdeity other than Allah could bring you light?\" Will you not\\n\\t\\t\\tlisten?"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "72",
    "Text": "Ask them again: \"Have you ever considered that if Allah were to\\n\\t\\t\\tmake the day perpetual till the Day of Resurrection, which deity\\n\\t\\t\\tother than Allah could bring you the night in which you could\\n\\t\\t\\trest? Will you not see?"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "73",
    "Text": "It is out of His mercy that He has made for you the night that\\n\\t\\t\\tyou may rest in it, and the day that you may seek His bounty, so\\n\\t\\t\\tthat you may render thanks."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "74",
    "Text": "They should be mindful of that Day when He will call them and\\n\\t\\t\\task: \"Where are those deities whom you deemed My associates?\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "75",
    "Text": "And We shall bring forth a witness from every nation and ask:\\n\\t\\t\\t\"Bring your proof about other deities besides Me.\" Then they\\n\\t\\t\\tshall come to know that in reality there is only One God, Allah,\\n\\t\\t\\tand gods of their own inventions have left them in the lurch.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "76",
    "Text": "The fact is that Qarun (Korah) was one of Musa's people, but he\\n\\t\\t\\trebelled against them. We had given him such treasures that their\\n\\t\\t\\tvery keys were a heavy burden to a band of strong men. When his\\n\\t\\t\\tpeople said to him: \"Do not exult, for Allah does not love the\\n\\t\\t\\texultant."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "77",
    "Text": "Rather seek, by means of what Allah has given you, to attain the\\n\\t\\t\\tabode of the hereafter, while not neglecting your share in this\\n\\t\\t\\tworld. Be good to others as Allah has been good to you, and do\\n\\t\\t\\tnot seek mischief in the land, for Allah does not love the\\n\\t\\t\\tmischief makers.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "78",
    "Text": "He replied: \"All that I have been given is by virtue of the\\n\\t\\t\\tknowledge that I possess.\" Did he (Qarun) not know that Allah had\\n\\t\\t\\tdestroyed many people before, who were mightier in strength and\\n\\t\\t\\tgreater in riches than him? But the criminals are not called to\\n\\t\\t\\taccount immediately for their sins."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "79",
    "Text": "One day he came out before his people in his worldly glitter.\\n\\t\\t\\tThose who sought the life of this world said: \"Would that we had\\n\\t\\t\\tthe like of Qarun's fortune! He is indeed a very lucky man.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "80",
    "Text": "But those who were endowed with knowledge said: \"Alas for you!\\n\\t\\t\\tBetter is the reward of Allah for him that has faith and does\\n\\t\\t\\tgood deeds; but none shall attain it save those who endured with\\n\\t\\t\\tfortitude.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "81",
    "Text": "Then We caused the earth to swallow him, together with his\\n\\t\\t\\tdwelling, and he had no host to help him against Allah; nor was\\n\\t\\t\\the able to defend himself."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "82",
    "Text": "Now the same people who envied him for his lot the day before,\\n\\t\\t\\tbegan to say: \"Alas! We had forgotten that it is indeed Allah Who\\n\\t\\t\\tenlarges the provision for whom He wills and restricts it from\\n\\t\\t\\twhom He pleases. If Allah had not been gracious to us, He could\\n\\t\\t\\thave caused the earth to swallow us too. Alas! We did not\\n\\t\\t\\tremember that the disbelievers never attain felicity.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "83",
    "Text": "As for the abode of the Hereafter, We have reserved it for those\\n\\t\\t\\twho seek neither glory nor corruption in the earth; the ultimate\\n\\t\\t\\tgood is for the righteous."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "84",
    "Text": "Anyone who brings a good deed shall have something even better;\\n\\t\\t\\twhile anyone who brings an evil deed will find that those who\\n\\t\\t\\tperform evil deeds will be punished only to the extent of their\\n\\t\\t\\tmisdeeds."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "85",
    "Text": "O Prophet, rest assured that He Who charged you with The Qur'an\\n\\t\\t\\twill bring you to the best destination. Say: \"My Rabb best knows\\n\\t\\t\\thim who has brought guidance and him who is in manifest error.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "86",
    "Text": "You (O Muhammad) never expected that the Book would be revealed\\n\\t\\t\\tto you. Only through your Rabb's mercy has it been revealed to\\n\\t\\t\\tyou: therefore do not be a helper in any way to the unbelievers."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "87",
    "Text": "Let no one turn you away from the revelations of Allah now that\\n\\t\\t\\tthey have been revealed to you. Invite people to your Rabb and be\\n\\t\\t\\tnot of the mushrikin (who join other deities with Allah)."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "88",
    "Text": "Invoke no other god besides Allah. There is no god but Him.\\n\\t\\t\\tEverything is perishable except Him. To him belongs the judgement\\n\\t\\t\\tand to him will you all be returned."
  }
]
