[
  {
    "SurahNumber": "47",
    "AyahNumber": "1",
    "Text": "Those who disbelieve and obstruct Allah's Way, He will render\\n\\t\\t\\ttheir deeds fruitless."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "2",
    "Text": "As for those who believe and do good deeds and believe in what is\\n\\t\\t\\trevealed to Muhammad - the truth from their Rabb - He will remove\\n\\t\\t\\tfrom them their evils and improve their condition."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "3",
    "Text": "This is because the unbelievers follow falsehood, while the\\n\\t\\t\\tbelievers follow the truth from their Rabb. Thus, Allah cites\\n\\t\\t\\ttheir similitudes for mankind."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "4",
    "Text": "Therefore, when you meet the unbelievers in the battlefield smite\\n\\t\\t\\ttheir necks and, when you have thoroughly subdued them, then take\\n\\t\\t\\tprisoners of war and bind them firmly. After the war lay down her\\n\\t\\t\\tburdens, then you have the choice whether you show them favor or\\n\\t\\t\\taccept ransom. Thus are you commanded. If Allah wanted, He\\n\\t\\t\\tHimself could have punished them; but He adopted this way so that\\n\\t\\t\\tHe may test some of you by means of others. As for those who are\\n\\t\\t\\tslain in the cause of Allah, He will never let their deeds be\\n\\t\\t\\tlost."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "5",
    "Text": "Soon He will guide them, improve their condition"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "6",
    "Text": "and admit them to the paradise which He has announced for them."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "7",
    "Text": "O believers! If you help the cause of Allah, He will help you and\\n\\t\\t\\testablish your feet firmly."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "8",
    "Text": "As for the unbelievers, they shall be consigned to perdition, and\\n\\t\\t\\tHe will bring their deeds to nothing."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "9",
    "Text": "That is because they hate the revelations of Allah; therefore, He\\n\\t\\t\\trendered their deeds fruitless."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "10",
    "Text": "Have they not traveled through the land and see what was the end\\n\\t\\t\\tof those who have gone before them? Allah destroyed them utterly\\n\\t\\t\\tand a similar fate awaits these unbelievers."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "11",
    "Text": "This is because Allah is the Protector of the believers while the\\n\\t\\t\\tunbelievers have no protector."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "12",
    "Text": "Surely Allah will admit those who believe and do good deeds to\\n\\t\\t\\tgardens beneath which rivers flow. While those who are\\n\\t\\t\\tunbelievers, they are to enjoy only this life and eat as cattle\\n\\t\\t\\teat; but in the hereafter, the fire shall be their abode."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "13",
    "Text": "How many cities which were mightier than your city which has\\n\\t\\t\\tdriven you out, have We destroyed for their disbelief, and there\\n\\t\\t\\twas none to save them?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "14",
    "Text": "Can he who follows the clear guidance from his Rabb be compared\\n\\t\\t\\tto him who is led by his own desires and whose foul deeds seem\\n\\t\\t\\tfair to him?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "15",
    "Text": "Here is the parable of the paradise which the righteous have been\\n\\t\\t\\tpromised: it has rivers the water of which will never be\\n\\t\\t\\tstagnant, rivers of milk whose taste never changes, rivers of\\n\\t\\t\\twine delicious to those who drink, and rivers of honey pure and\\n\\t\\t\\tclear. In it they will have all kinds of fruits, as well as\\n\\t\\t\\tforgiveness from their Rabb. Can such people be compared to those\\n\\t\\t\\twho shall dwell in hell forever, and they will be given scalding\\n\\t\\t\\twater which will cut their intestines into pieces?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "16",
    "Text": "Some of them indeed listen to you but no sooner do they leave\\n\\t\\t\\tyour presence than they ask those endowed with knowledge: \"What\\n\\t\\t\\twas it that he said just now?\" Such are the men upon whose hearts\\n\\t\\t\\tAllah has set a seal, and who follow their own desires."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "17",
    "Text": "As for those who follow the Right Way, Allah will increase their\\n\\t\\t\\tguidance and bestow on them their righteousness."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "18",
    "Text": "Are they waiting for the Hour of Doom to overtake them all of a\\n\\t\\t\\tsudden? Do they not know that its signs have already come and\\n\\t\\t\\twhen it will actually overtake them, what chance will they have\\n\\t\\t\\tto benefit then by this admonition?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "19",
    "Text": "Therefore, you should know that there is no god but Allah;\\n\\t\\t\\timplore Him to forgive your sins and to forgive the believing men\\n\\t\\t\\tand believing women; for Allah knows your activities and your\\n\\t\\t\\tresting places."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "20",
    "Text": "The believers were asking: \"Why is not a Surah revealed allowing\\n\\t\\t\\tus to fight?\" But when a decisive Surah carrying the order of\\n\\t\\t\\tallowing them to fight is revealed, you saw those in whose hearts\\n\\t\\t\\twas a disease looking at you like the one under the shadow of\\n\\t\\t\\tdeath. Woe to them!"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "21",
    "Text": "On their tongues is the promise of obedience and good talk, so if\\n\\t\\t\\tthey would have proved their promise with Allah when the final\\n\\t\\t\\tcommand was given, it would have been better for them."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "22",
    "Text": "Now what can be expected of you if you are put in authority,\\n\\t\\t\\tother than to do evil in the land and violate the ties of blood."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "23",
    "Text": "Such are those whom Allah has cursed and made them deaf and\\n\\t\\t\\tblinded their sight."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "24",
    "Text": "Will they not ponder upon the Qur'an? Are there locks upon their\\n\\t\\t\\thearts?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "25",
    "Text": "Those who turn back to unbelief after the guidance has become\\n\\t\\t\\tclear are seduced by Shaitan who gives them false hopes."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "26",
    "Text": "That is why they said to those who showed an aversion to what\\n\\t\\t\\tAllah has revealed: \"We shall obey you in some matters,\" and\\n\\t\\t\\tAllah knows their secret talks."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "27",
    "Text": "Then what will they do when the angels carry off their souls,\\n\\t\\t\\tsmiting their faces and their backs?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "28",
    "Text": "That will happen because they followed the way that called for\\n\\t\\t\\tthe wrath of Allah and hated to adopt the way of His pleasure,\\n\\t\\t\\ttherefore He made all their deeds void."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "29",
    "Text": "Do those in whose hearts is a disease think that Allah will not\\n\\t\\t\\treveal their malice?"
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "30",
    "Text": "Had We so pleased, We could have pointed them out to you and you\\n\\t\\t\\twould have recognized them promptly by their faces. But you will\\n\\t\\t\\tsurely know them by the tone of their speech. Allah knows all of\\n\\t\\t\\tyour actions."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "31",
    "Text": "We shall put you to test until We know the valiant and the\\n\\t\\t\\tresolute among you, and test all that is said about you."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "32",
    "Text": "The unbelievers who obstruct others from the Way of Allah and\\n\\t\\t\\tdisputed the Rasool after the guidance has become clear to them\\n\\t\\t\\tshall in no way harm Allah; as a result, he will bring their\\n\\t\\t\\tdeeds to nothing."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "33",
    "Text": "O believers! Obey Allah and obey His Rasool, and do not let your\\n\\t\\t\\tdeeds come to nothing."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "34",
    "Text": "Those who disbelieve and obstruct the Way of Allah and die while\\n\\t\\t\\tthey were still disbelievers, Allah will never forgive them."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "35",
    "Text": "Therefore, do not be fainthearted crying for peace, for you will\\n\\t\\t\\tsurely gain the upper hand. Allah is on your side and will never\\n\\t\\t\\tlet your deeds be wasted."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "36",
    "Text": "The life of this world is but play and amusement. If you believe\\n\\t\\t\\tand follow the way of piety, He will grant you your rewards and\\n\\t\\t\\twill not ask you to give up your possessions."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "37",
    "Text": "If He were to demand all of your possessions and press you for\\n\\t\\t\\tit, you would grow stingy, and He would bring out all your\\n\\t\\t\\tmalice."
  },
  {
    "SurahNumber": "47",
    "AyahNumber": "38",
    "Text": "Behold, you are those who are being asked to give in the cause of\\n\\t\\t\\tAllah. Yet some of you are stingy, whereas whoever is stingy to\\n\\t\\t\\tHis cause, is in fact stingy to himself. Allah is self\\n\\t\\t\\tsufficient, it is you who are needy. If you turn away He will\\n\\t\\t\\treplace you by some other folk; who will not be like you."
  }
]
