[
  {
    "SurahNumber": "48",
    "AyahNumber": "1",
    "NoteID": "4866",
    "Body": "This is best referred to the Treaty of Hudaibiya, for\\n\\t\\t\\t\\twhich see the Introduction to this Sura. By this Treaty\\n\\t\\t\\t\\tthe Makkan Quraish, after many years of unrelenting\\n\\t\\t\\t\\tconflict with Islam, at length recognised Islam as (what\\n\\t\\t\\t\\tthey thought) an equal power with themselves. In reality\\n\\t\\t\\t\\tthe door was then opened for the free spread of Islam\\n\\t\\t\\t\\tthroughout Arabia and thence through the world."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "2",
    "NoteID": "4867",
    "Body": "See n. 4428 to xi. 55, and Cf. xlvii, 19. Any mistakes of\\n\\t\\t\\t\\tthe past were now rectified, and any future ones\\n\\t\\t\\t\\tprevented by the free scope now offered, by the act of\\n\\t\\t\\t\\tthe Quraish Pagans themselves, to the recognition and\\n\\t\\t\\t\\tfree promulgation of Islam."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "3",
    "NoteID": "4868",
    "Body": "Three objects or results of the Treaty are mentioned: (1)\\n\\t\\t\\t\\tforgiveness, which is equivalent to Mercy, (2) fulfilment\\n\\t\\t\\t\\tof the dignity of Prophethood with the dignity of an\\n\\t\\t\\t\\teffective and recognised position in Arabia; (3) opening\\n\\t\\t\\t\\tup a straight way leading to Islam, by access to Makkah\\n\\t\\t\\t\\tfrom next year, Makkah being the symbolic centre of\\n\\t\\t\\t\\tIslam. These three are summed up in the comprehensive\\n\\t\\t\\t\\tphrase \"powerful (or effective) help\"."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "4",
    "NoteID": "4869",
    "Body": "The results were achieved by tranquillity, calmness, and\\n\\t\\t\\t\\tcool courage among the 1400 to 1500 unarmed men who\\n\\t\\t\\t\\taccompanied the Prophet to Hudaibiya and who were\\n\\t\\t\\t\\tthreatened with violence by the excited Quraish leaders\\n\\t\\t\\t\\tof Makkah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "4",
    "NoteID": "4870",
    "Body": "It is a casuistical question to ask. Are there degrees in\\n\\t\\t\\t\\tFaith? The plain meaning is that believers will see one\\n\\t\\t\\t\\tSign of Allah after another, and with each their Faith is\\n\\t\\t\\t\\tconfirmed. During all the long years of persecution and\\n\\t\\t\\t\\tconflict they had Faith, but when they see their old\\n\\t\\t\\t\\tenemies actually coming out to negotiate with them, their\\n\\t\\t\\t\\tFaith is justified, fulfilled, and confirmed: and they\\n\\t\\t\\t\\tturn in gratitude to Allah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "4",
    "NoteID": "4871",
    "Body": "There are visible forces which you see in the physical\\n\\t\\t\\t\\tworld. Men fight with armed forces, and the Muslims had\\n\\t\\t\\t\\tto defend themselves with arms also, and not without\\n\\t\\t\\t\\tsuccess."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "5",
    "NoteID": "4872",
    "Body": "This clause is coordinated to the previous clause, \"'That\\n\\t\\t\\t\\tthey may add Faith to their Faith\". The intervening\\n\\t\\t\\t\\twords, \"For to Allah...and Wisdom\" are parenthetical. The\\n\\t\\t\\t\\tthird coordinate clause comes in the next verse, \"And\\n\\t\\t\\t\\tthat He may punish...\". The skeleton construction will\\n\\t\\t\\t\\tbe, \"Allah sends down calm courage to Believers in order\\n\\t\\t\\t\\tthat they may be confirmed in their Faith; that they may\\n\\t\\t\\t\\tqualify for the Bliss of Heaven; and that the evil ones\\n\\t\\t\\t\\tmay receive the punishment they deserve.\""
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "6",
    "NoteID": "4873",
    "Body": "They will be encircled (or hemmed in) by Evil."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "6",
    "NoteID": "4874",
    "Body": "That is, deprived them of His Grace, on account of their\\n\\t\\t\\t\\tcontinued rejection of it."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "7",
    "NoteID": "4875",
    "Body": "These words are repeated (with a slight change) from the\\n\\t\\t\\t\\tparenthetical clause in verse 4. to emphasize the\\n\\t\\t\\t\\tassertion as a substantive proposition, that fighting and\\n\\t\\t\\t\\tvisible forces in the physical world are not the only\\n\\t\\t\\t\\tforces with which Allah works out His Plan. The invisible\\n\\t\\t\\t\\tforces are more important as they were at Hudaibiya. The\\n\\t\\t\\t\\tslight difference is instructive; in the parenthetical\\n\\t\\t\\t\\tclause, Allah's Knowledge was emphasized, and in the\\n\\t\\t\\t\\tsubstantive clause it is Allah's Power. Knowledge plans,\\n\\t\\t\\t\\tand Power executes."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "8",
    "NoteID": "4876",
    "Body": "The Prophet came in order to establish Faith in Allah and\\n\\t\\t\\t\\ttrue worship. We can view him in three capacities: (1) as\\n\\t\\t\\t\\ta witness to help the weak if they were oppressed and\\n\\t\\t\\t\\tcheck the strong if they did wrong; (2) as a giver of the\\n\\t\\t\\t\\tGlad Tidings of Allah's Grace and Mercy to those who\\n\\t\\t\\t\\trepented and lived good lives; and (3) as one who warned\\n\\t\\t\\t\\tsinners of the consequences of their sin. A) The words\\n\\t\\t\\t\\t\"assist and honour\" refer to the Prophet (peace be on\\n\\t\\t\\t\\thim) whereas in the phrase \"celebrating praise\" clearly\\n\\t\\t\\t\\tthe reference is to Allah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "9",
    "NoteID": "4876",
    "Body": "The Prophet came in order to establish Faith in Allah and\\n\\t\\t\\t\\ttrue worship. We can view him in three capacities: (1) as\\n\\t\\t\\t\\ta witness to help the weak if they were oppressed and\\n\\t\\t\\t\\tcheck the strong if they did wrong; (2) as a giver of the\\n\\t\\t\\t\\tGlad Tidings of Allah's Grace and Mercy to those who\\n\\t\\t\\t\\trepented and lived good lives; and (3) as one who warned\\n\\t\\t\\t\\tsinners of the consequences of their sin. A) The words\\n\\t\\t\\t\\t\"assist and honour\" refer to the Prophet (peace be on\\n\\t\\t\\t\\thim) whereas in the phrase \"celebrating praise\" clearly\\n\\t\\t\\t\\tthe reference is to Allah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "10",
    "NoteID": "4877",
    "Body": "In the Hudaibiya negotiations, when it was uncertain\\n\\t\\t\\t\\twhether the Quraish would treat well or ill the Prophet's\\n\\t\\t\\t\\tdelegate to Makkah, there was a great wave of feeling in\\n\\t\\t\\t\\tthe Muslim camp of 1400 to 1500 men. They came with great\\n\\t\\t\\t\\tenthusiasm and swore their fealty to the Prophet, by\\n\\t\\t\\t\\tplacing hand on hand according to the Arab custom: see\\n\\t\\t\\t\\tparagraph 3 of the Introduction to this Sura. This in\\n\\t\\t\\t\\titself was a wonderful demonstration of moral and\\n\\t\\t\\t\\tmaterial strength, a true Victory: it is called Bai'at ur\\n\\t\\t\\t\\tRidhwan (Fealty of Allah's Good Pleasure) in Islamic\\n\\t\\t\\t\\tHistory. They placed their hands on the Prophet's hand,\\n\\t\\t\\t\\tbut the Hand of Allah was above them, and He accepted\\n\\t\\t\\t\\ttheir Fealty. 'Alaihu is an archaic form for 'Alaihi."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "11",
    "NoteID": "4878",
    "Body": "When the Prophet started from Madinah on the Makkah\\n\\t\\t\\t\\tjourney which ended in Hudaibiya, he asked all Muslims to\\n\\t\\t\\t\\tjoin him in the pious undertaking, and he had a splendid\\n\\t\\t\\t\\tresponse. But some of the desert tribes hung back and\\n\\t\\t\\t\\tmade excuses. Their faith was but lukewarm, and they did\\n\\t\\t\\t\\tnot want to share in any trouble which the Makkah might\\n\\t\\t\\t\\tgive to the unarmed Muslims on pilgrimage. Their excuse\\n\\t\\t\\t\\tthat they were engaged in looking after their flocks and\\n\\t\\t\\t\\therds and their families was an after-thought, and in any\\n\\t\\t\\t\\tcase made after the return of the Prophet and his party\\n\\t\\t\\t\\twith enhanced prestige to Madinah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "11",
    "NoteID": "4879",
    "Body": "They said this with their tongues, but no thought of\\n\\t\\t\\t\\tpiety was in their hearts."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "11",
    "NoteID": "4880",
    "Body": "Their false excuse was based on a calculation of worldly\\n\\t\\t\\t\\tprofit and loss. But what about the spiritual loss in\\n\\t\\t\\t\\tdetaching themselves from the holy Prophet or spiritual\\n\\t\\t\\t\\tprofit in joining in the splendidly loyal feelings of\\n\\t\\t\\t\\tservice and obedience which were demonstrated at\\n\\t\\t\\t\\tHudaibiya? And in any case they need not think that all\\n\\t\\t\\t\\ttheir real and secret motives were not known to Allah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "12",
    "NoteID": "4881",
    "Body": "Their faith was so shaky that they thought the worst\\n\\t\\t\\t\\twould happen, and that the Makkan Quraish would destroy\\n\\t\\t\\t\\tthe unarmed band. In their heart of hearts they would not\\n\\t\\t\\t\\thave been sorry, because they were steeped in wickedness\\n\\t\\t\\t\\tand rejoiced in the sufferings of others. But such\\n\\t\\t\\t\\tpersons will burn in the fire of their own\\n\\t\\t\\t\\tdisappointment."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "14",
    "NoteID": "4882",
    "Body": "Evil must inevitably have its punishment, but there is\\n\\t\\t\\t\\tone way of escape, viz., through repentance and the Mercy\\n\\t\\t\\t\\tof Allah. Allah's Justice will punish, but Allah's Mercy\\n\\t\\t\\t\\twill forgive; and the Mercy is the predominant feature in\\n\\t\\t\\t\\tAllah's universe: \"He is Oft-Forgiving, Most Merciful.\""
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "15",
    "NoteID": "4883",
    "Body": "Now comes out another motive behind the minds of the\\n\\t\\t\\t\\tlaggards. The journey for pilgrimage had no promise of\\n\\t\\t\\t\\twar booty. If at any future time there should be a\\n\\t\\t\\t\\tpromise of booty they would come! But that is to reverse\\n\\t\\t\\t\\tAllah's law and decree. Jihad is not for personal gain or\\n\\t\\t\\t\\tbooty: see S. viii. and Introduction to S. viii.,\\n\\t\\t\\t\\tparagraph 2. On the contrary Jihad is hard striving, in\\n\\t\\t\\t\\twar and peace, in the Cause of Allah."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "15",
    "NoteID": "4884",
    "Body": "Not thus: i.e., not on those terms; not if your object is\\n\\t\\t\\t\\tonly to gain booty."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "15",
    "NoteID": "4885",
    "Body": "See viii. 1, and n. 1179."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "15",
    "NoteID": "4886",
    "Body": "The desert Arabs loved fighting and plunder and\\n\\t\\t\\t\\tunderstood such motives for war. The higher motives\\n\\t\\t\\t\\tseemed to be beyond them. Like ignorant men they\\n\\t\\t\\t\\tattributed petty motives or motives of jealousy if they\\n\\t\\t\\t\\twere kept out of the vulgar circle of fighting for\\n\\t\\t\\t\\tplunder. But they had to be schooled, and they were\\n\\t\\t\\t\\tschooled to higher ideas of discipline, self-sacrifice,\\n\\t\\t\\t\\tand striving hard for a Cause."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "16",
    "NoteID": "4887",
    "Body": "While they are reproached for their supineness in the\\n\\t\\t\\t\\tmarch which led to Hudaibiya, where there was danger but\\n\\t\\t\\t\\tno prospect of booty, they are promised, if they learn\\n\\t\\t\\t\\tdiscipline, to be allowed to follow the Banner of Islam\\n\\t\\t\\t\\twhere (as happened later in the Persian and Byzantine\\n\\t\\t\\t\\tWars) there was real fighting with formidable and\\n\\t\\t\\t\\twell-organised armies."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "16",
    "NoteID": "4888",
    "Body": "Cf. xxvii. 33."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "16",
    "NoteID": "4890",
    "Body": "There may be neither fighting nor booty. But all who obey\\n\\t\\t\\t\\tthe call to Jihad with perfect discipline will get the\\n\\t\\t\\t\\tRewards of the Hereafter. The blind, the maimed, and the\\n\\t\\t\\t\\tinfirm will of course be exempted from active compliance\\n\\t\\t\\t\\twith the Call, but they can render such services as are\\n\\t\\t\\t\\twithin their power, and then they will not he excluded\\n\\t\\t\\t\\tfrom the reward."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "17",
    "NoteID": "4890",
    "Body": "There may be neither fighting nor booty. But all who obey\\n\\t\\t\\t\\tthe call to Jihad with perfect discipline will get the\\n\\t\\t\\t\\tRewards of the Hereafter. The blind, the maimed, and the\\n\\t\\t\\t\\tinfirm will of course be exempted from active compliance\\n\\t\\t\\t\\twith the Call, but they can render such services as are\\n\\t\\t\\t\\twithin their power, and then they will not he excluded\\n\\t\\t\\t\\tfrom the reward."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "18",
    "NoteID": "4891",
    "Body": "The noun from the verb radhiya is Ridhwan (Good\\n\\t\\t\\t\\tPleasure); hence the name of this Bai'at, Bai'at ur\\n\\t\\t\\t\\tRidhwan, the Fealty of Allah's Good Pleasure: see n. 4877\\n\\t\\t\\t\\tto xlviii. 10."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "18",
    "NoteID": "4892",
    "Body": "The great ceremony of the Fealty of Allah's Good Pleasure\\n\\t\\t\\t\\ttook place while the holy Prophet sat under a tree in the\\n\\t\\t\\t\\tplain of Hudaibiya."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "18",
    "NoteID": "4893",
    "Body": "Or tested: see n. 4855 to xlvii. 31."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "18",
    "NoteID": "4894",
    "Body": "Sakina=Peace, calm, sense of security and confidence,\\n\\t\\t\\t\\ttranquillity. Cf. above xlviii. 4, and n. 4869. The same\\n\\t\\t\\t\\tword is used in connection with the battle of Hunain in\\n\\t\\t\\t\\tix. 26, and in connection with the Cave of Thaur at an\\n\\t\\t\\t\\tearly stage in the Hijrat: ix. 40."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "18",
    "NoteID": "4895",
    "Body": "The Treaty of Hudaibiya itself was a \"speedy Victory\": it\\n\\t\\t\\t\\tfollowed immediately after the Bai'at."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "20",
    "NoteID": "4896",
    "Body": "The gains so far seen from the Bai'at and their calm and\\n\\t\\t\\t\\tdisciplined behaviour were certainly great: in the rapid\\n\\t\\t\\t\\tspread of Islam, in the clearance from the Sacred House\\n\\t\\t\\t\\tof the idolatrous autocracy, and in the universal\\n\\t\\t\\t\\tacceptance of the Message of Allah in Arabia."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "20",
    "NoteID": "4897",
    "Body": "The first fruits of the Bai'at were the victory or treaty\\n\\t\\t\\t\\tof Hudaibiya, the cessation for the time being of the\\n\\t\\t\\t\\thostility of the Makkan Quraish, and the opening out of\\n\\t\\t\\t\\tthe way to Makkah. These things are implied in the\\n\\t\\t\\t\\tphrase, \"He has restrained the hands of men from you.\""
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "20",
    "NoteID": "4898",
    "Body": "Hudaibiya (in both the Bai'at and the Treaty) was truly a\\n\\t\\t\\t\\tsign-post for the Believers: it showed the solidarity of\\n\\t\\t\\t\\tIslam, and the position which the Muslims had won in the\\n\\t\\t\\t\\tArab world."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "21",
    "NoteID": "4899",
    "Body": "Other gains: these are usually referred to the later\\n\\t\\t\\t\\tvictories of Islam, but we must view them not merely in\\n\\t\\t\\t\\ttheir political or material aspect, but chiefly in the\\n\\t\\t\\t\\trise of Islam as a world power morally and spiritually."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "22",
    "NoteID": "4900",
    "Body": "Their morale was now truly broken."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "23",
    "NoteID": "4901",
    "Body": "Cf. xxxiii. 62."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "24",
    "NoteID": "4902",
    "Body": "Little incidents had taken place that might have plunged\\n\\t\\t\\t\\tthe Quraish and the Muslims from Madinah into a fight. On\\n\\t\\t\\t\\tthe one hand, the Quraish were determined to keep out the\\n\\t\\t\\t\\tMuslims, which they had no right to do: and on the other\\n\\t\\t\\t\\thand, the Muslims, though unarmed, had sworn to stand\\n\\t\\t\\t\\ttogether, and if they had counter-attacked they could\\n\\t\\t\\t\\thave forced their entrance to the Ka'ba, the centre of\\n\\t\\t\\t\\tMakkah. But Allah restrained both sides from anything\\n\\t\\t\\t\\tthat would have violated the Peace of the Sanctuary, and\\n\\t\\t\\t\\tafter the Treaty was signed, all danger was past."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "4903",
    "Body": "The Muslims from Madinah had brought the animals for\\n\\t\\t\\t\\tsacrifice with them, and had put on the Ihram or\\n\\t\\t\\t\\tpilgrim's garb (see n. 217 to ii. 197), but they were not\\n\\t\\t\\t\\tonly prevented from entering Makkah, but were also\\n\\t\\t\\t\\tprevented from sending the sacrificial animals to the\\n\\t\\t\\t\\tplace of sacrifice in Makkah, as they could have done\\n\\t\\t\\t\\tunder ii. 196. The sacrifice was therefore actually\\n\\t\\t\\t\\toffered at Hudaibiya."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "4904",
    "Body": "There were at the time in Makkah believing Muslims, men\\n\\t\\t\\t\\tand women, and the faith of some of them was unknown to\\n\\t\\t\\t\\ttheir brethren from Madinah. Had a fight taken place in\\n\\t\\t\\t\\tMakkah, even though the Muslims had been successful, they\\n\\t\\t\\t\\twould unwittingly have killed some of these unknown\\n\\t\\t\\t\\tMuslims, and thus would unwittingly have been guilty of\\n\\t\\t\\t\\tshedding Muslim blood. This was prevented by the Treaty."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "4905",
    "Body": "Allah works according to His wise and holy Will and Plan,\\n\\t\\t\\t\\tand not according to what seems to us, in the excitement\\n\\t\\t\\t\\tof human life, to be the obvious course of things. By\\n\\t\\t\\t\\tpreventing a fight He saved many valuable lives, not only\\n\\t\\t\\t\\tof Muslims but also of some who became Muslims afterwards\\n\\t\\t\\t\\tand served Islam. He grants His Mercy on far higher\\n\\t\\t\\t\\tstandards than man in his limited horizon can see."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "25",
    "NoteID": "4906",
    "Body": "If the party from Madinah could have distinguished\\n\\t\\t\\t\\tMuslims from non-Muslims among the Makkans, they might\\n\\t\\t\\t\\thave been allowed to enter and punish the pagan Quraish\\n\\t\\t\\t\\tfor their inordinate vanity and gross breach of the\\n\\t\\t\\t\\tunwritten law of the land. But in the actual\\n\\t\\t\\t\\tcircumstances the best solution was the Treaty of\\n\\t\\t\\t\\tHudaibiya."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "26",
    "NoteID": "4907",
    "Body": "While the Unbelievers were blustering and excited, and\\n\\t\\t\\t\\tmeticulously objected to introductory words such as \"In\\n\\t\\t\\t\\tthe name of Allah, Most Gracious, Most Merciful (they did\\n\\t\\t\\t\\tnot like the titles), the Prophet remained calm and\\n\\t\\t\\t\\tcollected, and got the substance of their demands\\n\\t\\t\\t\\tembodied in the Treaty without worrying about words. Even\\n\\t\\t\\t\\tthough the terms of the Treaty appeared to the\\n\\t\\t\\t\\tcompanions, at first, to be unfair to Muslims, they\\n\\t\\t\\t\\tremained faithful to their Leader and showed trust in his\\n\\t\\t\\t\\tbetter judgment, a trust that was vindicated by the\\n\\t\\t\\t\\tevents that followed."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "26",
    "NoteID": "4908",
    "Body": "Cf. above xlviii. 18, and n. 4894."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "26",
    "NoteID": "4909",
    "Body": "It=Tranquillity. Their calmness amid much provocation was\\n\\t\\t\\t\\ta gift of Allah; they had earned a right to it by their\\n\\t\\t\\t\\tobedience and discipline, and showed themselves well\\n\\t\\t\\t\\tworthy of it."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "27",
    "NoteID": "4910",
    "Body": "The Prophet had had a dream that he had entered the\\n\\t\\t\\t\\tSacred Mosque at Makkah, just before he decided on the\\n\\t\\t\\t\\tjourney which resulted in the Treaty of Hudaibiya. By it\\n\\t\\t\\t\\the and his people could enter next year without the least\\n\\t\\t\\t\\tmolestation and in the full customary garb, with head\\n\\t\\t\\t\\tshaved or hair cut short, and all the customary minor\\n\\t\\t\\t\\trites of pilgrimage."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "27",
    "NoteID": "4911",
    "Body": "See above, xlviii. 18, and n. 4895."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "28",
    "NoteID": "4912",
    "Body": "The divine disposition of events in the coming of Islam\\n\\t\\t\\t\\tand its promulgation by the holy Prophet are themselves\\n\\t\\t\\t\\tevidence of the truth of Islam and its all-reaching\\n\\t\\t\\t\\tcharacter; for there is nothing which it has not\\n\\t\\t\\t\\tinfluenced. See also lxi. 9, n. 5442."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "4913",
    "Body": "Cf. ix. 128. The devotees of Allah wage unceasing war\\n\\t\\t\\t\\tagainst evil, for themselves, and for others; but to\\n\\t\\t\\t\\ttheir own brethren in faith-especially the weaker ones-\\n\\t\\t\\t\\tthey are mild and compassionate: they seek out every\\n\\t\\t\\t\\topportunity to sympathise with them and help them."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "4914",
    "Body": "Their humility is before Allah and His Apostle and all\\n\\t\\t\\t\\twho have authority from Allah, but they yield no power or\\n\\t\\t\\t\\tpomp, nor do they worship worldly show or glitter. Nor is\\n\\t\\t\\t\\ttheir humility before Allah a mere show for men."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "4915",
    "Body": "The traces of their earnestness and humility are engraved\\n\\t\\t\\t\\ton their faces, i.e., penetrate their inmost being, the\\n\\t\\t\\t\\tface being the outward sign of the inner man. If we take\\n\\t\\t\\t\\tit in its literal sense, the traces might mean the marks\\n\\t\\t\\t\\tleft by repeated prostration on their foreheads.\\n\\t\\t\\t\\tMoreover, a good man's face alone shows in him the grace\\n\\t\\t\\t\\tand light of Allah; he is gentle, kind and forbearing,\\n\\t\\t\\t\\tever helpful, relying on Allah and possessing a blessed\\n\\t\\t\\t\\tPeace and Calmness (Sakina, xlviii. 26) that can come\\n\\t\\t\\t\\tfrom no other source."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "4916",
    "Body": "In the Book of Moses, which is now found in a corrupt\\n\\t\\t\\t\\tform in the Pentateuch, the posture of humility in prayer\\n\\t\\t\\t\\tis indicated by prostration: e.g., Moses and Aaron \"fell\\n\\t\\t\\t\\tupon their faces\", Num. xvi. 22."
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "4917",
    "Body": "The similitude in the Gospel is about how the good seed\\n\\t\\t\\t\\tis sown and grows gradually, even beyond the expectation\\n\\t\\t\\t\\tof the sower: \"the seed should spring and grow up, he\\n\\t\\t\\t\\tknoweth not how; for the earth bringeth forth fruit of\\n\\t\\t\\t\\therself; first the blade, then the ear, after that the\\n\\t\\t\\t\\tfull corn in the ear\": Mark. iv. 27-28. Thus Islam was\\n\\t\\t\\t\\tpreached by the holy Prophet; the seed seemed to human\\n\\t\\t\\t\\teyes lost in the ground; but it put forth its shoot, and\\n\\t\\t\\t\\tgrew, and became strong, until it was able to stand on\\n\\t\\t\\t\\tits own legs, and its worst enemies recognised its\\n\\t\\t\\t\\texistence and its right to live. Note how much more\\n\\t\\t\\t\\tcomplete the parable is in the Qur-an. The mentality of\\n\\t\\t\\t\\tthe sowers of the seed is expressed in beautiful terms:\\n\\t\\t\\t\\tits growth and strength filled them \"with wonder and\\n\\t\\t\\t\\tdelight.\""
  },
  {
    "SurahNumber": "48",
    "AyahNumber": "29",
    "NoteID": "4918",
    "Body": "I construe the particle \"li\" as expressing not the\\n\\t\\t\\t\\tobject, but the result. The result of the wonderful\\n\\t\\t\\t\\tgrowth of Islam in numbers and strength was that its\\n\\t\\t\\t\\tenemies were confounded, and raged furiously within their\\n\\t\\t\\t\\town minds, a contrast to the satisfaction, wonder, and\\n\\t\\t\\t\\tdelight of the Prophet and his Companions. The pronoun in\\n\\t\\t\\t\\t\"rage at them\" of course refers to the Prophet and his\\n\\t\\t\\t\\tCompanions, and goes back to the earlier words, \"on their\\n\\t\\t\\t\\tfaces\" etc."
  }
]
