[
  {
    "SurahNumber": "25",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Almost all the commentators give this meaning to the term\\n\\t\\t\\t\\tal-furqan. In the above context it denotes the Qur'an as\\n\\t\\t\\t\\twell as the phenomenon of divine revelation as such. (For\\n\\t\\t\\t\\tan amplified interpretation of this term by Muhammad\\n\\t\\t\\t\\t'Abduh, see note [38] on  2:53 .) The verbal form nazzala\\n\\t\\t\\t\\timplies gradualness both in time (\"successively\") and in\\n\\t\\t\\t\\tmethod (\"step by step\")."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "See note [133] on  17:111 ."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "I.e., in accordance with the function assigned by Him to\\n\\t\\t\\t\\teach individual thing or phenomenon: cf. the oldest\\n\\t\\t\\t\\tformulation of this idea in {87:2-3}."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "3",
    "NoteID": "4",
    "Body": "I.e., whether they be inanimate \"representations\" of\\n\\t\\t\\t\\timaginary deities, or personified forces of nature or\\n\\t\\t\\t\\tdeified human beings, or simplv figments of the\\n\\t\\t\\t\\timagination."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "4",
    "NoteID": "5",
    "Body": "Implying that the Qur'an, or most of it, is based on\\n\\t\\t\\t\\tJudaeo-Christian teachings allegedly communicated to\\n\\t\\t\\t\\tMuhammad by some unnamed foreigners (cf.  16:103  and the\\n\\t\\t\\t\\tcorresponding notes, especially note [130]) or,\\n\\t\\t\\t\\talternatively, by various Arab converts to Judaism or\\n\\t\\t\\t\\tChristianity; furthermore, that Muhammad had either\\n\\t\\t\\t\\tdeceived himself into believing that the Qur'an was a\\n\\t\\t\\t\\tdivine revelation, or had deliberately - knowing that it\\n\\t\\t\\t\\twas not so - attributed it to God."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "4",
    "NoteID": "6",
    "Body": "Lit., \"and thus, indeed, have they come with [or\\n\\t\\t\\t\\t\"brought\"] a perversion of the truth\" [which obviously is\\n\\t\\t\\t\\tthe meaning of zulm in this context] \"and a falsehood\".\\n\\t\\t\\t\\tWhereas it is generally assumed that this clause\\n\\t\\t\\t\\tconstitutes a Qur'anic rebuttal of the malicious\\n\\t\\t\\t\\tallegation expressed in the preceding clause, I am of the\\n\\t\\t\\t\\topinion that it forms part of that allegation, making the\\n\\t\\t\\t\\tmythical \"helpers\" of Muhammad co-responsible, as it\\n\\t\\t\\t\\twere, for the \"invention\" of the Qur'an."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "5",
    "NoteID": "7",
    "Body": "Because it was known to his contemporaries that he was\\n\\t\\t\\t\\tunlettered (ummi) and could not read and write."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "8",
    "NoteID": "8",
    "Body": "A sarcastic allusion to the \"gardens of paradise\" of\\n\\t\\t\\t\\twhich the Qur'an so often speaks. (Cf.  13:38  and the\\n\\t\\t\\t\\tcorresponding notes [74] and [75]; also  5:75  and\\n\\t\\t\\t\\t{21:7-8}.)"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "12",
    "NoteID": "9",
    "Body": "Lit., \"When it shall see them from a far-off place\": a\\n\\t\\t\\t\\tmetaphorical allusion, it would seem, to the moment of\\n\\t\\t\\t\\ttheir death on earth. As in many other instances, we are\\n\\t\\t\\t\\tgiven here a subtle verbal hint of the allegorical nature\\n\\t\\t\\t\\tof the Qur'anic descriptions of conditions in the life to\\n\\t\\t\\t\\tcome by a rhetorical \"transfer\" of man's faculty of\\n\\t\\t\\t\\tseeing to the object of his seeing: a usage which\\n\\t\\t\\t\\tZamakhshari explicitly characterizes as metaphorical\\n\\t\\t\\t\\t('ala sabil al-majaz)."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "13",
    "NoteID": "10",
    "Body": "For a tentative explanation of the allegory of the\\n\\t\\t\\t\\tsinners' being \"linked together\" in hell, see my note\\n\\t\\t\\t\\t[64] on  14:49 . As regards the \"tight space\" into which\\n\\t\\t\\t\\tthey will be flung, Zamakhshari remarks: \"Distress is\\n\\t\\t\\t\\taccompanied by [a feeling of] constriction, just as\\n\\t\\t\\t\\thappiness is accompanied by [a feeling of] spaciousness;\\n\\t\\t\\t\\tand because of this, God has described paradise as being\\n\\t\\t\\t\\t'as vast as the heavens and the earth' [ 3:133 ].\""
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "14",
    "NoteID": "11",
    "Body": "Although the concept of \"extinction\" (thubur) implies\\n\\t\\t\\t\\tfinality and is, therefore, unrepeatable, the sinners'\\n\\t\\t\\t\\tpraying for \"many extinctions\" is used here as a metonym\\n\\t\\t\\t\\tfor their indescribable suffering and a corresponding,\\n\\t\\t\\t\\tindescribable desire for a final escape."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "17",
    "NoteID": "12",
    "Body": "This passage connects elliptically with verse {3} above."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "17",
    "NoteID": "13",
    "Body": "The rhetorical \"question\" which follows is obviously\\n\\t\\t\\t\\taddressed to wrongfully deified rational beings - i.e.,\\n\\t\\t\\t\\tprophets or saints - and not, as some commentators\\n\\t\\t\\t\\tassume, to lifeless idols which, as it were, \"will be\\n\\t\\t\\t\\tmade to speak\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "18",
    "NoteID": "14",
    "Body": "Sc., \"and so it would have been morally impossible for us\\n\\t\\t\\t\\tto ask others to worship us\". On the other hand, Ibn\\n\\t\\t\\t\\tKathir understands the expression \"for us\" (lana) as\\n\\t\\t\\t\\tdenoting \"us human beings\" in general, and not merely the\\n\\t\\t\\t\\tspeakers - in which case the sentence could be rendered\\n\\t\\t\\t\\tthus: \"It is not right for us [human beings] to take...\",\\n\\t\\t\\t\\tetc. In either case, the above allegorical\\n\\t\\t\\t\\t\"question-and-answer\" - repeated in many variations\\n\\t\\t\\t\\tthroughout the Qur'an - is meant to stress, in a dramatic\\n\\t\\t\\t\\tmanner, the moral odiousness and intellectual futility of\\n\\t\\t\\t\\tattributing divine qualities to any being other than God."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "18",
    "NoteID": "15",
    "Body": "This is the meaning of hatta (lit., \"till\" or \"until\") in\\n\\t\\t\\t\\tthe present context."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "20",
    "NoteID": "16",
    "Body": "This elliptic passage undoubtedly alludes to the fact\\n\\t\\t\\t\\tthat the appearance of each new prophet had, as a rule, a\\n\\t\\t\\t\\ttwofold purpose: firstly, to convey a divinely-inspired\\n\\t\\t\\t\\tethical message to man, and thus to establish a criterion\\n\\t\\t\\t\\tof right and wrong or a standard by which to discern the\\n\\t\\t\\t\\ttrue from the false (al-furqan, as stated in the first\\n\\t\\t\\t\\tverse of this surah); and, secondly, to be a means of\\n\\t\\t\\t\\ttesting men's moral perceptions and dispositions as\\n\\t\\t\\t\\tmanifested in their reactions to the prophet's message -\\n\\t\\t\\t\\tthat is, their willingness or unwillingness to accept it\\n\\t\\t\\t\\ton the basis of its intrinsic merit without demanding or\\n\\t\\t\\t\\teven expecting any \"supernatural\" proof of its divine\\n\\t\\t\\t\\torigin. Indirectly, in its deepest sense, this passage\\n\\t\\t\\t\\timplies that not only a prophet but every human being is,\\n\\t\\t\\t\\tby virtue of his social existence, a means whereby the\\n\\t\\t\\t\\tmoral qualities of his fellow-men are put to a test:\\n\\t\\t\\t\\thence, some of the earliest commentators (among them\\n\\t\\t\\t\\tTabari) give to the above phrase the connotation of \"We\\n\\t\\t\\t\\tcaused you human beings to be a means of testing one\\n\\t\\t\\t\\tanother\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "20",
    "NoteID": "17",
    "Body": "I.e., \"you men\" or, more specifically, \"you whom the\\n\\t\\t\\t\\tmessage of the Qur'an has reached\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "21",
    "NoteID": "18",
    "Body": "Lit., \"who do not hope for [i.e., expect] a meeting with\\n\\t\\t\\t\\tUs\": the implication being that they do not believe in\\n\\t\\t\\t\\tresurrection and, consequently, do not expect to be\\n\\t\\t\\t\\tjudged by God in after-life."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "22",
    "NoteID": "19",
    "Body": "I.e., on Judgment Day, when \"all will have been decided\"\\n\\t\\t\\t\\t(cf.  6:8 )."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "24",
    "NoteID": "20",
    "Body": "Lit.. \"will be happiest as regards their abode, and best\\n\\t\\t\\t\\tas regards their place of repose\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "27",
    "NoteID": "21",
    "Body": "Lit., \"taken a path with the apostle\". The terms \"the\\n\\t\\t\\t\\tapostle\" and \"the evildoer\" are here obviously used in\\n\\t\\t\\t\\ttheir generic sense, applying to all of God's apostles\\n\\t\\t\\t\\tand all who consciously reject their guidance. Similarly,\\n\\t\\t\\t\\tthe expression \"so-and-so\" (fulan) occurring in the next\\n\\t\\t\\t\\tverse circumscribes any person or personified influence\\n\\t\\t\\t\\tresponsible for leading a human being astray."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "29",
    "NoteID": "22",
    "Body": "For the implication of the term \"Satan\" as used here, see\\n\\t\\t\\t\\tnote [10] on  2:14 , first half of note [16] on  15:17 ,\\n\\t\\t\\t\\tas well as note [31] on  14:22 ."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "30",
    "NoteID": "23",
    "Body": "My interpolation of the words \"on that Day\" and the\\n\\t\\t\\t\\t(linguistically permissible) attribution of futurity to\\n\\t\\t\\t\\tthe past-tense verb qala is based on the identical\\n\\t\\t\\t\\tinterpretation of the above phrase by great commentators\\n\\t\\t\\t\\tlike Abu Muslim (as quoted by Razi) or Baghawi."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "30",
    "NoteID": "24",
    "Body": "I.e., as mere wishful thinking and, therefore, of no\\n\\t\\t\\t\\taccount, or as something that in the course of time has\\n\\t\\t\\t\\t\"ceased to be relevant\". Since many of those whom the\\n\\t\\t\\t\\tmessage of the Qur'an has reached did and do regard it as\\n\\t\\t\\t\\ta divine revelation and therefore as most \"relevant\" in\\n\\t\\t\\t\\tevery sense of the word, it is obvious that the\\n\\t\\t\\t\\texpression \"my people\" cannot possibly denote here all of\\n\\t\\t\\t\\tthe Prophet's community (either in the national or in the\\n\\t\\t\\t\\tideological sense of this word), but signifies only such\\n\\t\\t\\t\\tof his nominal followers as have lost all real faith in\\n\\t\\t\\t\\tthe Qur'anic message: hence the necessity of\\n\\t\\t\\t\\tinterpolating the (elliptically implied) words \"some of\"\\n\\t\\t\\t\\tbefore \"my people\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "31",
    "NoteID": "25",
    "Body": "Cf. {6: 112}, which refers in very similar terms to the\\n\\t\\t\\t\\tevil forces (shayatin) against which every prophet has\\n\\t\\t\\t\\thad to contend. The \"glittering half-truths meant to\\n\\t\\t\\t\\tdelude the mind\" spoken of in that verse are exemplified\\n\\t\\t\\t\\tin the present passage, prophetically, by the deceptive\\n\\t\\t\\t\\targument that the Qur'an, having been enunciated fourteen\\n\\t\\t\\t\\tcenturies ago, must now be considered \"obsolete\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "32",
    "NoteID": "26",
    "Body": "Lit., \"in one piece\" or \"as one statement\" (jumlatan\\n\\t\\t\\t\\twahidatan) - implying, in the view of the opponents of\\n\\t\\t\\t\\tIslam, that the gradual, step-by-step revelation of the\\n\\t\\t\\t\\tQur'an points to its having been \"composed\" by Muhammad\\n\\t\\t\\t\\tto suit his changing personal and political requirements."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "32",
    "NoteID": "27",
    "Body": "I.e., free of all inner contradictions (cf.  4:82 ). See\\n\\t\\t\\t\\talso  39:23 , where the Qur'an is spoken of as \"fully\\n\\t\\t\\t\\tconsistent within itself\". The concise phrase rattalnahu\\n\\t\\t\\t\\ttartilan comprises the parallel concepts of \"putting the\\n\\t\\t\\t\\tcomponent parts [of a thing] together and arranging them\\n\\t\\t\\t\\twell\" as well as \"endowing it with inner consistency\".\\n\\t\\t\\t\\tInasmuch as full consistency and freedom from\\n\\t\\t\\t\\tcontradictions in a message spread over twenty-three\\n\\t\\t\\t\\tyears of a life as full of movement and drama as that of\\n\\t\\t\\t\\tthe Prophet does give a clear indication of its\\n\\t\\t\\t\\tGod-inspired quality, it is bound to strengthen the faith\\n\\t\\t\\t\\tof every thinking believer: and herein lies, according to\\n\\t\\t\\t\\tthe Qur'an itself, the deepest reason for its slow,\\n\\t\\t\\t\\tgradual revelation. (When applied to the reciting of the\\n\\t\\t\\t\\tQur'an - as in  73:4  - the term tartil refers to the\\n\\t\\t\\t\\tmeasured diction and the thoughtful manner in which it\\n\\t\\t\\t\\tought to be enunciated.)"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "33",
    "NoteID": "28",
    "Body": "Lit., \"come to thee with a parable (mathal)\" - i.e., with\\n\\t\\t\\t\\tall manner of seemingly plausible parabolic objections\\n\\t\\t\\t\\t(exemplified in verses {7-8}, {21} and {32} of this surah\\n\\t\\t\\t\\tas well as in many other places in the Qur'an) meant to\\n\\t\\t\\t\\tthrow doubt on Muhammad's claim to prophethood and,\\n\\t\\t\\t\\thence, on the God-inspired character of the Qur'anic\\n\\t\\t\\t\\tmessage."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "33",
    "NoteID": "29",
    "Body": "Sc., \"of the problem or problems involved\": an allusion\\n\\t\\t\\t\\tto the self-explanatory character of the Qur'an.\\n\\t\\t\\t\\tThroughout this section (verses {30-34}) the personal\\n\\t\\t\\t\\tpronoun \"thou\" (in the forms \"thy\" and \"thee\") relates\\n\\t\\t\\t\\tnot only to the Prophet but also to every one of his\\n\\t\\t\\t\\tfollowers at all times."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "34",
    "NoteID": "30",
    "Body": "I.e., in utter spiritual abasement (Razi, mentioning some\\n\\t\\t\\t\\tother commentators as well)."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "34",
    "NoteID": "31",
    "Body": "Cf.  17:72  and the corresponding note [87]."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "35",
    "NoteID": "32",
    "Body": "For this rendering of the term wazlr, see note [18] on\\n\\t\\t\\t\\t 20:29 . The mention, at this place, of Moses and Aaron -\\n\\t\\t\\t\\tand of Noah, etc., in the following verses - is intended\\n\\t\\t\\t\\tto remind us of the statement in verse {31} above that\\n\\t\\t\\t\\t\"against every prophet We have set up enemies from among\\n\\t\\t\\t\\tthose who are lost in sin\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "38",
    "NoteID": "33",
    "Body": "Regarding the tribes of 'Ad and Thamud, see surah {7},\\n\\t\\t\\t\\tnotes [48] and [56]. As for Ar-Rass, a town of that name\\n\\t\\t\\t\\texists to this day in the Central-Arabian province of\\n\\t\\t\\t\\tAl-Qasim; in the ancient times referred to it seems to\\n\\t\\t\\t\\thave been inhabited by descendants of the Nabataean tribe\\n\\t\\t\\t\\tof Thamud (Tabari). There is, however, no agreement among\\n\\t\\t\\t\\tthe commentators as to the real meaning of this name or\\n\\t\\t\\t\\tdesignation; Razi cites several of the current,\\n\\t\\t\\t\\tconflicting interpretations and rejects all of them as\\n\\t\\t\\t\\tpurely conjectural."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "39",
    "NoteID": "34",
    "Body": "Sc., \"which they failed to heed\". For my rendering of\\n\\t\\t\\t\\tmathal, in this context, as \"lesson\", see note [104] on\\n\\t\\t\\t\\t 17:89 ."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "40",
    "NoteID": "35",
    "Body": "A reference to Sodom and its destruction by a rain of\\n\\t\\t\\t\\t\"stone-hard blows of chastisement pre-ordained\" (see\\n\\t\\t\\t\\t 11:82  and the corresponding note [114]). The phrase\\n\\t\\t\\t\\t\"they have come across\" may be understood in either of\\n\\t\\t\\t\\ttwo ways: (a) in its literal sense of \"chancing upon\" or\\n\\t\\t\\t\\t\"passing by\", in which case it applies to the Prophet's\\n\\t\\t\\t\\tcontemporaries and opponents, the pagan Meccans, whose\\n\\t\\t\\t\\tcustomary caravan route to Syria passed close by the Dead\\n\\t\\t\\t\\tSea and the probable site of Sodom and Gomorrah; or (b)\\n\\t\\t\\t\\tin the tropical sense of \"becoming aware [of something]\"\\n\\t\\t\\t\\tthrough reading or hearsay - in which case it may be\\n\\t\\t\\t\\ttaken to refer to people of all times, and to the fact\\n\\t\\t\\t\\tthat the story of Sodom and Gomorrah is part and parcel\\n\\t\\t\\t\\tof mankind's moral heritage."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "40",
    "NoteID": "36",
    "Body": "Lit., \"they were wont not to look forward to [i.e., to\\n\\t\\t\\t\\texpect or believe in] resurrection\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "44",
    "NoteID": "37",
    "Body": "Lit., \"they are farther astray from the path [of truth]\":\\n\\t\\t\\t\\tsee note [144] on  7:179 ."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "46",
    "NoteID": "38",
    "Body": "I.e., \"We cause it to contract in accordance with the\\n\\t\\t\\t\\t'laws of nature' which We Ourselves have instituted.\" As\\n\\t\\t\\t\\tin so many other instances in the Qur'an, the abrupt\\n\\t\\t\\t\\tchange from the third-person pronoun \"He\" to \"We\" is\\n\\t\\t\\t\\tmeant to illustrate the fact that God is undefinable, and\\n\\t\\t\\t\\tthat it is only the inadequacy of human speech - and,\\n\\t\\t\\t\\thence, of the human mind - that makes it necessary to\\n\\t\\t\\t\\trefer to the Supreme Being by pronouns which in relaity\\n\\t\\t\\t\\tare applicable only to finite, created \"persons\" (cf.\\n\\t\\t\\t\\tForeword, note [2])."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "50",
    "NoteID": "39",
    "Body": "Lit., \"have We turned it over (sarrafnahu) among them\": a\\n\\t\\t\\t\\treference to the frequent many-faceted reiteration, in\\n\\t\\t\\t\\tthe Qur'an as well as in earlier revelations, of all the\\n\\t\\t\\t\\tevidence unmistakably pointing to the existence of a\\n\\t\\t\\t\\tconscious Creator (Zamakhshari)."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "51",
    "NoteID": "40",
    "Body": "Sc., \"but We have willed instead that Muhammad be Our\\n\\t\\t\\t\\tlast prophet and, hence, a warner unto all people for all\\n\\t\\t\\t\\ttimes to come\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "53",
    "NoteID": "41",
    "Body": "The noun bahr, usually signifying \"sea\", is also applied\\n\\t\\t\\t\\tto large agglomerations of sweet water, like rivers,\\n\\t\\t\\t\\tlakes, etc.; in the above context, the dual al-bahrayn\\n\\t\\t\\t\\tdenotes \"the two great bodies [or \"kinds\"] of water\" -\\n\\t\\t\\t\\tthe salty and the sweet - existing side by side on earth."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "53",
    "NoteID": "42",
    "Body": "I.e., has caused them - as if by an invisible barrier -\\n\\t\\t\\t\\tto remain distinct in kind despite their continuous\\n\\t\\t\\t\\tmeeting and mingling in the oceans: an indirect reminder\\n\\t\\t\\t\\tof God's planning creativeness inherent in the cyclic\\n\\t\\t\\t\\ttransformation of water - its evaporation from the salty\\n\\t\\t\\t\\tseas, followed by a formation of clouds, their\\n\\t\\t\\t\\tcondensation into rain and snow which feed springs and\\n\\t\\t\\t\\trivers, and its return to the seas. Some Muslim mystics\\n\\t\\t\\t\\tsee in this stress on the two kinds of water an allegory\\n\\t\\t\\t\\tof the gulf - and, at the same time, interaction -\\n\\t\\t\\t\\tbetween man's spiritual perceptions, on the one hand, and\\n\\t\\t\\t\\this worldly needs and passions, on the other."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "54",
    "NoteID": "43",
    "Body": "See second half of  21:30  where the creation of \"every\\n\\t\\t\\t\\tliving thing out of water\" is spoken of, as well as\\n\\t\\t\\t\\t 24:45 , which mentions in this connection the entire\\n\\t\\t\\t\\tanimal world (including, of course, man)."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "54",
    "NoteID": "44",
    "Body": "I.e., has enabled him to attribute spiritual value to,\\n\\t\\t\\t\\tand to derive strength from, his organic and social\\n\\t\\t\\t\\trelationships."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "55",
    "NoteID": "45",
    "Body": "Lit., \"they\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "59",
    "NoteID": "46",
    "Body": "See note [43] on the first sentence of  7:54 ."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "59",
    "NoteID": "47",
    "Body": "I.e., \"ask God Himself\": since He alone holds the keys to\\n\\t\\t\\t\\tthe mysteries of the universe, it is only by observing\\n\\t\\t\\t\\tHis creation and listening to His revealed messages that\\n\\t\\t\\t\\tman can obtain a glimpse, however distant, of God's Own\\n\\t\\t\\t\\treality."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "61",
    "NoteID": "48",
    "Body": "See  10:5 , where the sun is spoken of as \"a [source of]\\n\\t\\t\\t\\tradiant light\", explained in the corresponding note [10].\\n\\t\\t\\t\\tFor my rendering of buruj as \"great constellations\", see\\n\\t\\t\\t\\tnote [15] on  15:16 ."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "62",
    "NoteID": "49",
    "Body": "Lit., \"or\" (aw) - a particle which obviously does not\\n\\t\\t\\t\\tdenote here an alternative but, rather, an explanatory\\n\\t\\t\\t\\tamplification, similar to the expression \"in other\\n\\t\\t\\t\\twords\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "63",
    "NoteID": "50",
    "Body": "Sc., \"with the aim to ridicule them or to argue against\\n\\t\\t\\t\\ttheir beliefs\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "67",
    "NoteID": "51",
    "Body": "In the Qur'an, the verb anfaqa (and the corresponding\\n\\t\\t\\t\\tnoun nafaqah) has usually this connotation."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "68",
    "NoteID": "52",
    "Body": "See surah {6}, note [148]."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "68",
    "NoteID": "53",
    "Body": "Lit., \"he who does that (dhalika)\", i.e., any of the\\n\\t\\t\\t\\tthree sins referred to in this verse. (For my translation\\n\\t\\t\\t\\tof zina as \"adultery\", see surah {24}, note [2].)"
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "72",
    "NoteID": "54",
    "Body": "Implying that neither do they themselves ever bear false\\n\\t\\t\\t\\twitness (i.e., in the widest sense of this expression,\\n\\t\\t\\t\\ttell any lie), nor do they knowingly take part in\\n\\t\\t\\t\\tanything that is based on falsehood (Razi)."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "73",
    "NoteID": "55",
    "Body": "Explaining this verse, Zamakhshari remarks that whereas\\n\\t\\t\\t\\tthe average run of people approach the divine writ with a\\n\\t\\t\\t\\tmere outward show of eagerness, \"throwing themselves upon\\n\\t\\t\\t\\tit\" for the sake of appearances but, in reality, not\\n\\t\\t\\t\\tmaking the least attempt to understand the message as\\n\\t\\t\\t\\tsuch and, hence, remaining deaf and blind to its contents\\n\\t\\t\\t\\t- the truly God-conscious are deeply desirous of\\n\\t\\t\\t\\tunderstanding it, and therefore \"listen to it with\\n\\t\\t\\t\\twide-awake ears and look into it with seeing eyes\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "74",
    "NoteID": "56",
    "Body": "I.e., by living a righteous life."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "77",
    "NoteID": "57",
    "Body": "Lit., \"were it not for your prayer\", which term Ibn\\n\\t\\t\\t\\t'Abbas (as quoted by Tabari) equates in this context with\\n\\t\\t\\t\\t\"faith\"."
  },
  {
    "SurahNumber": "25",
    "AyahNumber": "77",
    "NoteID": "58",
    "Body": "I.e., \"unless you repent, this sin will determine your\\n\\t\\t\\t\\tspiritual destiny in the life to come\"."
  }
]
