[
  {
    "SurahNumber": "36",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Whereas some of the classical commentators incline to the\\n\\t\\t\\t\\tview that the letters y-s (pronounced ya sin) with which\\n\\t\\t\\t\\tthis surah opens belong to the category of the mysterious\\n\\t\\t\\t\\tletter-symbols (al-muqatta'at) introducing a number of\\n\\t\\t\\t\\tQur'anic chapters (see Appendix II), Abd Allah ibn 'Abbas\\n\\t\\t\\t\\tstates that they actually represent two distinct words,\\n\\t\\t\\t\\tnamely the exclamatory particle ya (\"O\") and sin, which\\n\\t\\t\\t\\tin the dialect of the tribe of Tayy' is synonymous with\\n\\t\\t\\t\\tinsan (\"human being\" or \"man\"): hence, similar to the two\\n\\t\\t\\t\\tsyllables ta ha in surah {20}, ya sin denotes \"O thou\\n\\t\\t\\t\\thuman being!\" This interpretation has been accepted by\\n\\t\\t\\t\\t'Ikrimah, Ad-Dahhak, Al-Hasan al-Basri, Sa'id ibn Jubayr,\\n\\t\\t\\t\\tand other early Qur'an-commentators (see Tabari, Baghawi,\\n\\t\\t\\t\\tZamakhshari, Baydawi, Ibn Kathir, etc.). According to\\n\\t\\t\\t\\tZamakhshari, it would seem that the syllable sln is an\\n\\t\\t\\t\\tabbreviation of unaysin, the diminutive form of insan\\n\\t\\t\\t\\tused by the Tayy' in exclamations. (It is to be borne in\\n\\t\\t\\t\\tmind that in classical Arabic a diminutive is often\\n\\t\\t\\t\\texpressive of no more than endearment: e.g., ya bunayya,\\n\\t\\t\\t\\twhich does not necessarily signify \"O my little son\" but,\\n\\t\\t\\t\\trather, \"my dear son\" irrespective of the son's age.) On\\n\\t\\t\\t\\tthe whole, we may safely assume that the words ya sin\\n\\t\\t\\t\\tapostrophize the Prophet Muhammad, who is explicitly\\n\\t\\t\\t\\taddressed in the sequence, and are meant to stress - as\\n\\t\\t\\t\\tthe Qur'an so often does - the fact of his and all other\\n\\t\\t\\t\\tapostles' humanness."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "This statement explains the adjurative particle wa\\n\\t\\t\\t\\t(rendered by me as \"Consider\") at the beginning of the\\n\\t\\t\\t\\tpreceding verse - namely: \"Let the wisdom apparent in the\\n\\t\\t\\t\\tQur'an serve as an evidence of the fact that thou art an\\n\\t\\t\\t\\tapostle of God\". As regards my rendering of al-qur'an\\n\\t\\t\\t\\tal-haklm as \"this Qur'an full of wisdom\", see note [2] on\\n\\t\\t\\t\\t 10:1 ."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "rf  14:50  - \"if I am on the right path, it is but by\\n\\t\\t\\t\\tvirtue of what my Sustainer reveals unto me\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "6",
    "NoteID": "4",
    "Body": "Cf. {6:131-132}. In the wider sense of this expression,\\n\\t\\t\\t\\tthe \"forefathers\" may be a metonym for a community's\\n\\t\\t\\t\\tcultural past: hence, the reference to those\\n\\t\\t\\t\\t\"forefathers\" not having been \"warned\" (i.e., against\\n\\t\\t\\t\\tevil) evidently alludes to the defectiveness of the\\n\\t\\t\\t\\tethical heritage of people who have become estranged from\\n\\t\\t\\t\\ttrue moral values."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "Lit., \"has come true\", the past tense indicating the\\n\\t\\t\\t\\tinevitability of its \"coming true\" - i.e., taking effect."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "Zamakhshari: \"[This is] an allegory of their deliberate\\n\\t\\t\\t\\tdenial of the truth.\" See note [13] on  13:5  and note\\n\\t\\t\\t\\t[44] on  34:33 ."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "8",
    "NoteID": "7",
    "Body": "Sc., \"and they cannot see the right way\" (Razi); their\\n\\t\\t\\t\\t\"forced-up heads\" symbolize also their arrogance. On the\\n\\t\\t\\t\\tother hand, God's \"placing shackles\" around the sinners'\\n\\t\\t\\t\\tnecks is a metaphor similar to His \"sealing their hearts\\n\\t\\t\\t\\tand their hearing\", spoken of in  2:7  and explained in\\n\\t\\t\\t\\tthe corresponding note [7]. The same applies to the\\n\\t\\t\\t\\tmetaphor of the \"barriers\" and the \"veiling\" mentioned in\\n\\t\\t\\t\\tthe next verse."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "Sc., \"so that they can neither advance nor go back\": a\\n\\t\\t\\t\\tmetaphor of utter spiritual stagnation."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "Lit., \"who is following the reminder\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "14",
    "NoteID": "10",
    "Body": "As is usual with such passages, the commentators advance\\n\\t\\t\\t\\tvarious speculations as to the \"identity\" of the town and\\n\\t\\t\\t\\tthe apostles. Since, however, the story is clearly\\n\\t\\t\\t\\tdescribed as a parable, it must be understood as such and\\n\\t\\t\\t\\tnot as an historical narrative. It seems to me that we\\n\\t\\t\\t\\thave here an allegory of the three great monotheistic\\n\\t\\t\\t\\treligions, successively propounded by Moses, Jesus and\\n\\t\\t\\t\\tMuhammad, and embodying, essentially, the same spiritual\\n\\t\\t\\t\\ttruths. The \"township\" (qaryah) mentioned in the parable\\n\\t\\t\\t\\trepresents, I think, the common cultural environment\\n\\t\\t\\t\\twithin which these three religions appeared. The apostles\\n\\t\\t\\t\\tof the first two are said to have been sent \"together\",\\n\\t\\t\\t\\timplying that the teachings of both were - and are -\\n\\t\\t\\t\\tanchored in one and the same scripture, the Old Testament\\n\\t\\t\\t\\tof the Bible. When, in the course of time, their impact\\n\\t\\t\\t\\tproved insufficient to mould the ethical attitude of the\\n\\t\\t\\t\\tpeople or peoples concerned, God \"strengthened\" them by\\n\\t\\t\\t\\tmeans of His final message, conveyed to the world by the\\n\\t\\t\\t\\tthird and last of the apostles, Muhammad."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "15",
    "NoteID": "11",
    "Body": "Cf.  6:91  - \"no true understanding of God have they when\\n\\t\\t\\t\\tthey say, 'Never has God revealed anything unto man.'\"\\n\\t\\t\\t\\tSee also  34:31  and the corresponding note [38]. Both\\n\\t\\t\\t\\tthese passages, as well as the one above, allude to\\n\\t\\t\\t\\tpeople who like to think of themselves as \"believing\" in\\n\\t\\t\\t\\tGod without, however, allowing their \"belief\" to\\n\\t\\t\\t\\tinterfere in the practical concerns of their lives: and\\n\\t\\t\\t\\tthis they justify by conceding to religion no more than a\\n\\t\\t\\t\\tvaguely emotional role, and by refusing to admit the fact\\n\\t\\t\\t\\tof objective revelation - for the concept of revelation\\n\\t\\t\\t\\tinvariably implies a promulgation by God, of absolute\\n\\t\\t\\t\\tmoral values and, thus, a demand for one's self-surrender\\n\\t\\t\\t\\tto them."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "18",
    "NoteID": "12",
    "Body": "For an explanation of the phrase tatayyarna bikum, see\\n\\t\\t\\t\\tsurah {7}, note [95]."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "19",
    "NoteID": "13",
    "Body": "Cf.  17:13  - \"every human being's destiny (ta'ir) have\\n\\t\\t\\t\\tWe tied to his neck\" - and the corresponding note [17]."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "19",
    "NoteID": "14",
    "Body": "For this rendering of musrifun (sing. musrif), see note\\n\\t\\t\\t\\t[21] on the last sentence of  10:1 "
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "26",
    "NoteID": "15",
    "Body": "I.e., by the apostles or, more probably (in view of the\\n\\t\\t\\t\\tallegorical character of this story), by his own insight.\\n\\t\\t\\t\\tThe intervention of the man who \"came running from the\\n\\t\\t\\t\\tfarthest end of the city\" is evidently a parable of the\\n\\t\\t\\t\\ttruly believing minority in every religion, and of their\\n\\t\\t\\t\\tdesperate, mostly unavailing endeavours to convince their\\n\\t\\t\\t\\terring fellow-men that God-consciousness alone can save\\n\\t\\t\\t\\thuman life from futility."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "30",
    "NoteID": "16",
    "Body": "Lit., \"Oh, the regrets upon the bondmen\" (al-'ibad) -\\n\\t\\t\\t\\tsince all human beings, good or bad, are God's \"bondmen\".\\n\\t\\t\\t\\tThis phrase alludes to the Day of Judgment - which is\\n\\t\\t\\t\\tdescribed in  19:39  as \"the Day of Regrets\" - as well as\\n\\t\\t\\t\\tto the fact, repeatedly stressed in the Qur'an, that most\\n\\t\\t\\t\\thuman beings choose to remain deaf to the voice of truth,\\n\\t\\t\\t\\tand thus condemn themselves to spiritual death."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "31",
    "NoteID": "17",
    "Body": "I.e., to the people now living. As in many other Qur'anic\\n\\t\\t\\t\\tpassages, the term qarn, which literally signifies a\\n\\t\\t\\t\\t\"generation\" or \"people living at the same period\", has\\n\\t\\t\\t\\tin this context the wider meaning of \"society\", or\\n\\t\\t\\t\\t\"civilization\" in the historical connotation of these\\n\\t\\t\\t\\tterms. Thus, the downfall and utter disappearance of past\\n\\t\\t\\t\\tsocieties and civilizations is here linked to their\\n\\t\\t\\t\\tspiritual frivolity and consequent moral failure. A\\n\\t\\t\\t\\tfurther lesson to be drawn from this parable is the\\n\\t\\t\\t\\timplied conclusion that the majority of people in every\\n\\t\\t\\t\\tsociety, at all times (our own included), refuse to be\\n\\t\\t\\t\\tguided by moral considerations, regarding them as opposed\\n\\t\\t\\t\\tto their conventional mode of life and their pursuit of\\n\\t\\t\\t\\tmaterialistic values - with the result that \"never has an\\n\\t\\t\\t\\tapostle come to them without their deriding him\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "36",
    "NoteID": "18",
    "Body": "Lit., \"who has created all the pairs out of whatever the\\n\\t\\t\\t\\tearth produces, and out of themselves, and out of that of\\n\\t\\t\\t\\twhich they have no knowledge\": a reference to the\\n\\t\\t\\t\\tpolarity evident in all creation, both animate and\\n\\t\\t\\t\\tinanimate, which expresses itself in the existence of\\n\\t\\t\\t\\tantithetic and yet complementary forces, like the\\n\\t\\t\\t\\tsexuality in human beings, animals and plants, light and\\n\\t\\t\\t\\tdarkness, heat and cold, positive and negative magnetism\\n\\t\\t\\t\\tand electricity, the positive and negative charges\\n\\t\\t\\t\\t(protons and electrons) in the structure of the atom, and\\n\\t\\t\\t\\tso forth. (It is to be borne in mind that the noun zawj\\n\\t\\t\\t\\tdenotes both \"a pair\" and \"one of a pair\", as explained\\n\\t\\t\\t\\tin note [7] on {13:3.}) The mention of \"that of which\\n\\t\\t\\t\\tthey have no knowledge\" evidently relates to things or\\n\\t\\t\\t\\tphenomena not yet understood by man but potentially\\n\\t\\t\\t\\twithin the range of his comprehension: hence my\\n\\t\\t\\t\\tinterpolation, between brackets, of the words \"as yet\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "38",
    "NoteID": "19",
    "Body": "In the generally-accepted reading, this phrase is spelled\\n\\t\\t\\t\\tli-mustagarrin laha, which may be rendered as above or,\\n\\t\\t\\t\\tmore conventionally, as \"to its point of rest\", i.e., the\\n\\t\\t\\t\\ttime (or point) of the daily sunset (Razi). However, Abd\\n\\t\\t\\t\\tAllah ibn Masud is reliably reported to have read these\\n\\t\\t\\t\\twords as la mustaqarra laha (Zamakhshari), which gives us\\n\\t\\t\\t\\tthe meaning of \"it runs [on its course] without having\\n\\t\\t\\t\\tany rest\", i.e., unceasingly."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "39",
    "NoteID": "20",
    "Body": "This is, in a condensed form, the meaning of the noun\\n\\t\\t\\t\\t'urjun - the raceme of the date-palm, which, when old and\\n\\t\\t\\t\\tdry, becomes slender and curves like a crescent (cf. Lane\\n\\t\\t\\t\\tV, 1997)."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "40",
    "NoteID": "21",
    "Body": "Lit., \"nor does the night outrun [or \"outstrip\"] the\\n\\t\\t\\t\\tday\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "41",
    "NoteID": "22",
    "Body": "Lit., \"in the laden ship\": a generic singular with a\\n\\t\\t\\t\\tplural significance. The term \"offspring\" denotes here\\n\\t\\t\\t\\tthe human race as a whole (cf. the recurring expression\\n\\t\\t\\t\\t\"children of Adam\")."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "42",
    "NoteID": "23",
    "Body": "Cf.  16:8  and the corresponding note [6]. In both of\\n\\t\\t\\t\\tthese passages man's ingenuity is shown to be a direct\\n\\t\\t\\t\\tmanifestation of God's creativeness."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "45",
    "NoteID": "24",
    "Body": "For an explanation of this rendering of the above phrase,\\n\\t\\t\\t\\tsee surah {2}, note [247]. In the present instance it\\n\\t\\t\\t\\tapparently denotes men's conscious doings as well as\\n\\t\\t\\t\\ttheir unconscious or half-conscious motivations."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "46",
    "NoteID": "25",
    "Body": "Or: \"no sign of their Sustainer's signs\" - since the noun\\n\\t\\t\\t\\tayah, repeated several times in the preceding passage,\\n\\t\\t\\t\\tdenotes \"a message\" as well as \"a sign\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "47",
    "NoteID": "26",
    "Body": "In Qur'anic usage, the verb anfaqa (lit., \"he spent\")\\n\\t\\t\\t\\tinvariably signifies one's spending on others, or for the\\n\\t\\t\\t\\tgood of others, whatever the motive. The ethical\\n\\t\\t\\t\\timportance of this \"spending on others\" is frequently\\n\\t\\t\\t\\tstressed in the Qur'an, and is embodied in the concept of\\n\\t\\t\\t\\tzakah, which denotes \"purifying dues\" or, in its broader\\n\\t\\t\\t\\tsense, \"charity\" (see note [34] on  2:43 )."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "49",
    "NoteID": "27",
    "Body": "Lit., \"they wait for nothing but a single blast...\", etc."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "56",
    "NoteID": "28",
    "Body": "In the Qur'anic descriptions of paradise, the term zill\\n\\t\\t\\t\\t(\"shade\") and its plural zilal is often used as a\\n\\t\\t\\t\\tmetaphor for \"happiness\" - thus, for instance, in  4:57 ,\\n\\t\\t\\t\\twhere zill zalil signifies \"happiness abounding\" (see\\n\\t\\t\\t\\tsurah {4}, note [74]) - while the \"couches\" on which the\\n\\t\\t\\t\\tblessed are to recline are obviously a symbol of inner\\n\\t\\t\\t\\tfulfilment and peace of mind, as pointed out by Razi in\\n\\t\\t\\t\\this comments on  18:31  and  55:54 ."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "58",
    "NoteID": "29",
    "Body": "This composite expression is, I believe, the nearest\\n\\t\\t\\t\\tapproach in English to the concept of salam in the above\\n\\t\\t\\t\\tcontext. For a further explanation of this term, see note\\n\\t\\t\\t\\t[29] on  5:16 , where salam is rendered as \"salvation\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "60",
    "NoteID": "30",
    "Body": "For the meaning of what the Qur'an describes as \"worship\\n\\t\\t\\t\\tof Satan\", see note [33] on  19:44 ."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "63",
    "NoteID": "31",
    "Body": "The phrase \"This, then, is the hell\" points to the fact\\n\\t\\t\\t\\tthat the sinners' realization of their having gone astray\\n\\t\\t\\t\\tdespite repeated warnings by the prophets will, in\\n\\t\\t\\t\\titself, be a source of intense suffering ('adhab) in the\\n\\t\\t\\t\\tlife to come. The element of repetition or persistence is\\n\\t\\t\\t\\timplied in the use of the auxiliary verb kuntum both here\\n\\t\\t\\t\\tand in the next verse."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "65",
    "NoteID": "32",
    "Body": "A metaphor for their being unable really to excuse or\\n\\t\\t\\t\\tdefend their past actions and attitudes."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "66",
    "NoteID": "33",
    "Body": "Lit., \"We could surely have effaced their eyes\": a\\n\\t\\t\\t\\tmetaphor for \"We could have created them morally blind\"\\n\\t\\t\\t\\tand, thus, devoid of all sense of moral responsibility -\\n\\t\\t\\t\\twhich, in its turn, would constitute a negation of all\\n\\t\\t\\t\\tspiritual value in human life as such. (Cf.  2:20  - \"if\\n\\t\\t\\t\\tGod so willed, He could indeed take away their hearing\\n\\t\\t\\t\\tand their sight\".)"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "66",
    "NoteID": "34",
    "Body": "In this instance - as, e.g., in  20:96  - the verb basura\\n\\t\\t\\t\\t(\"he became seeing\" or \"he saw\") is obviously used in its\\n\\t\\t\\t\\ttropical sense of \"perceiving [something] mentally\".\\n\\t\\t\\t\\tAccording to Ibn 'Abbas, as quoted by Tabari, the phrase\\n\\t\\t\\t\\tanna yubsirun signifies \"how could they perceive the\\n\\t\\t\\t\\ttruth\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "67",
    "NoteID": "35",
    "Body": "Lit., \"transformed [or \"transmuted\"] them\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "67",
    "NoteID": "36",
    "Body": "I.e., if it had been God's will that men should have no\\n\\t\\t\\t\\tfreedom of will or moral choice, He would have endowed\\n\\t\\t\\t\\tthem from the very beginning with a spiritually and\\n\\t\\t\\t\\tmorally stationary nature, entirely rooted in their\\n\\t\\t\\t\\tinstincts (\"in their places\"), devoid of all urge to\\n\\t\\t\\t\\tadvance, and incapable either of positive development or\\n\\t\\t\\t\\tof retreat from a wrong course."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "68",
    "NoteID": "37",
    "Body": "I.e., man should never postpone his exercise of moral\\n\\t\\t\\t\\tchoice - for if human beings are superior creatures\\n\\t\\t\\t\\tinasmuch as they have been endowed with the faculty of\\n\\t\\t\\t\\tdiscernment and a wide measure of free will, let them\\n\\t\\t\\t\\talso remember that \"man has been created weak\" ( 4:28 )\\n\\t\\t\\t\\tand liable to decline still further in old age, so that\\n\\t\\t\\t\\tthe time at his disposal is short."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "69",
    "NoteID": "38",
    "Body": "This passage resumes the theme enunciated in the opening\\n\\t\\t\\t\\tverses of this surah, namely, the revelation of the\\n\\t\\t\\t\\tQur'an. As in  26:224 , we have here an allusion to the\\n\\t\\t\\t\\tallegation of Muhammad's opponents, in his own as well as\\n\\t\\t\\t\\tin later times, that what he described as divine\\n\\t\\t\\t\\trevelation was in reality an outcome of his own poetic\\n\\t\\t\\t\\tinvention. This the Qur'an refutes by alluding to the\\n\\t\\t\\t\\tfundamental difference between poetry - especially Arabic\\n\\t\\t\\t\\tpoetry - and divine revelation as exemplified by the\\n\\t\\t\\t\\tQur'an: whereas in the former the meaning is often\\n\\t\\t\\t\\tsubordinated to the rhythm and the melody of language, in\\n\\t\\t\\t\\tthe Qur'an the exact opposite is the case, inasmuch as\\n\\t\\t\\t\\there the choice of words, their sound and their position\\n\\t\\t\\t\\tin the sentence - and, hence, its rhythm and melody - are\\n\\t\\t\\t\\talways subordinated to the meaning intended. (Cf. also\\n\\t\\t\\t\\t 26:225  and the corresponding note [100].)"
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "69",
    "NoteID": "39",
    "Body": "For this composite rendering of the adjective mubin, see\\n\\t\\t\\t\\tsurah {12}, note [2]. Literally, the above phrase reads,\\n\\t\\t\\t\\t\"a reminder and a [divine] discourse...\". etc., with the\\n\\t\\t\\t\\tconjunctive particle wa (\"and\") being used here, as in\\n\\t\\t\\t\\t 15:1 , to point out that the Qur'an is an integral\\n\\t\\t\\t\\telement in the process of divine revelation."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "70",
    "NoteID": "40",
    "Body": "Lit., \"may come [or \"be proved\"] true\", i.e., on the Day\\n\\t\\t\\t\\tof Judgment (cf. verse {7} of this surah )."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "71",
    "NoteID": "41",
    "Body": "I.e., \"which We alone have or could have created\"\\n\\t\\t\\t\\t(Zamakhshari and Razl). The above metaphorical expression\\n\\t\\t\\t\\tis based on the concept of \"handiwork\" in its widest\\n\\t\\t\\t\\tsense, abstract as well as concrete."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "72",
    "NoteID": "42",
    "Body": "Lit., \"made them submissive (dhallalnaha ) to them\":\\n\\t\\t\\t\\timplying also that man is morally responsible for the\\n\\t\\t\\t\\tmanner in which he uses or misuses them."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "74",
    "NoteID": "43",
    "Body": "Or: \"other deities beside God\" - alluding, in either\\n\\t\\t\\t\\tcase, to objects of worship consciously conceived as such\\n\\t\\t\\t\\t- i.e., idols, imaginary deities, deified persons,\\n\\t\\t\\t\\tsaints, etc. - as well as to abstract concepts like\\n\\t\\t\\t\\tpower, wealth or \"luck\", which may not be consciously\\n\\t\\t\\t\\t\"worshipped\" but are nevertheless often revered in an\\n\\t\\t\\t\\talmost idolatrous fashion. The verb ittakhadhu (lit.,\\n\\t\\t\\t\\t\"they took [or \"have taken\"] for themselves\"), used in\\n\\t\\t\\t\\tthe Qur'an in this and in similar contexts, is\\n\\t\\t\\t\\tparticularly suited for the wide range of meanings\\n\\t\\t\\t\\talluded to inasmuch as it bears the connotation of\\n\\t\\t\\t\\tadopting something - whether it be concrete or abstract -\\n\\t\\t\\t\\tfor one's own use or adoration."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "75",
    "NoteID": "44",
    "Body": "Lit.. \"them\"."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "77",
    "NoteID": "45",
    "Body": "See similar passage in  16:4 , as well as the\\n\\t\\t\\t\\tcorresponding note [5]. Completing the interpretation\\n\\t\\t\\t\\tadvanced in his (and Zamakhshari's) commentary on the\\n\\t\\t\\t\\tabove-mentioned verse, Razi equates here the term khasim\\n\\t\\t\\t\\t(lit., \"contender in argument\") with the highest\\n\\t\\t\\t\\tmanifestation of what is described as natiq (\"articulate\\n\\t\\t\\t\\t[or \"rational\"] being\")."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "78",
    "NoteID": "46",
    "Body": "Lit., \"he coins for Us a simile (mathal)\" - an elliptic\\n\\t\\t\\t\\tallusion to the unwillingness of \"those who deny the\\n\\t\\t\\t\\ttruth\" to conceive of a transcendental Being,\\n\\t\\t\\t\\tfundamentally different from all that is graspable by\\n\\t\\t\\t\\tman's senses or imagination, and having powers beyond all\\n\\t\\t\\t\\tcomparison with those which are available to any of the\\n\\t\\t\\t\\tcreated beings. (Cf.  42:11 , \"there is nothing like unto\\n\\t\\t\\t\\tHim\", and  112:4 , \"there is nothing that could be\\n\\t\\t\\t\\tcompared with Him\".) Since they are enmeshed in a\\n\\t\\t\\t\\tmaterialistic outlook on life, such people deny - as the\\n\\t\\t\\t\\tsequence shows - all possibility of resurrection, which\\n\\t\\t\\t\\tamounts to a denial of God's creative powers and, in the\\n\\t\\t\\t\\tfinal analysis, of His existence."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "80",
    "NoteID": "47",
    "Body": "Cf. the ancient Arabian proverb, \"In every tree there is\\n\\t\\t\\t\\ta fire\" (Zamakhshari): evidently an allusion to the\\n\\t\\t\\t\\tmetamorphosis of green - i e., water-containing - plants\\n\\t\\t\\t\\tinto fuel, be it through desiccation or man-made\\n\\t\\t\\t\\tcarbonization (charcoal), or by a millenial, subterranean\\n\\t\\t\\t\\tprocess of decomposition into oil or coal. In a spiritual\\n\\t\\t\\t\\tsense, this \"fire\" seems also to symbolize the God-given\\n\\t\\t\\t\\twarmth and light of human reason spoken of in verse {77}\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "36",
    "AyahNumber": "82",
    "NoteID": "48",
    "Body": "This is the meaning of the phrase innama amruhu - the\\n\\t\\t\\t\\tterm amr being synonymous, in this instance, with sha'n\\n\\t\\t\\t\\t(\"state [or \"manner\"] of being\"). The exclusiveness of\\n\\t\\t\\t\\tGod's creative Being is stressed by the restrictive\\n\\t\\t\\t\\tparticle innama."
  }
]
