[
  {
    "SurahNumber": "66",
    "AyahNumber": "1",
    "NoteID": "5529",
    "Body": "The Prophet's household was not like other households.\\n\\t\\t\\t\\tThe Consorts of Purity were expected to hold a higher\\n\\t\\t\\t\\tstandard in behaviour and reticence than ordinary women,\\n\\t\\t\\t\\tas they had higher work to perform. See n. 3706 to\\n\\t\\t\\t\\txxxiii. 28. But they were human beings after all, and\\n\\t\\t\\t\\twere subject to the weaknesses of their sex, and they\\n\\t\\t\\t\\tsometimes failed. The commentators usually cite the\\n\\t\\t\\t\\tfollowing incident in connection with the revelation of\\n\\t\\t\\t\\tthese verses. It is narrated from 'Aisha, the wife of the\\n\\t\\t\\t\\tholy Prophet (peace be on him) by Bukhari, Muslim, Nasai.\\n\\t\\t\\t\\tAbu Dawud and others that the holy Prophet usually\\n\\t\\t\\t\\tvisited all his wives daily after 'Asr Prayer. Once it so\\n\\t\\t\\t\\thappened that he stayed longer than usual at the quarters\\n\\t\\t\\t\\tof Zainab bint Jahsh, for she had received from somewhere\\n\\t\\t\\t\\tsome honey which the holy Prophet liked very much. \"At\\n\\t\\t\\t\\tthis\", says 'Aisha, \"I felt jealous, and Hafsa, Sawda,\\n\\t\\t\\t\\tSafiya, and I agreed among ourselves that when he visits\\n\\t\\t\\t\\tus each of us would tell him that a peculiar odour came\\n\\t\\t\\t\\tfrom his mouth as a result of what he had eaten, for we\\n\\t\\t\\t\\tknew that he was particularly sensitive to offensive\\n\\t\\t\\t\\tsmells\". So when his wives hinted at it, he vowed that he\\n\\t\\t\\t\\twould never again use honey. Thereupon these verses were\\n\\t\\t\\t\\trevealed reminding him that he should not declare to\\n\\t\\t\\t\\thimself unlawful that which Allah had made lawful to him.\\n\\t\\t\\t\\tThe important point to bear in mind is that he was at\\n\\t\\t\\t\\tonce rectified by revelation, which reinforces the fact\\n\\t\\t\\t\\tthat the prophets are always under divine protection, and\\n\\t\\t\\t\\teven the slightest lapse on their part is never left\\n\\t\\t\\t\\tuncorrected."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "1",
    "NoteID": "5530",
    "Body": "The tender words of admonition addressed to the Consorts\\n\\t\\t\\t\\tin xxxiii. 28-34 explain the situation far better than\\n\\t\\t\\t\\tany comments can express. If the holy Prophet had been a\\n\\t\\t\\t\\tmere husband in the ordinary sense of the term, he could\\n\\t\\t\\t\\tnot have held the balance even between his private\\n\\t\\t\\t\\tfeelings and his public duties. But he was not an\\n\\t\\t\\t\\tordinary husband, and he abandoned his renunciation on\\n\\t\\t\\t\\this realisation of the higher duties with which he was\\n\\t\\t\\t\\tcharged, and which required conciliation with firmness."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "2",
    "NoteID": "5531",
    "Body": "Cf. ii. 224. If your vows prevent you from doing good, or\\n\\t\\t\\t\\tacting rightly, or making peace between persons, you\\n\\t\\t\\t\\tshould expiate the vow, but not refrain from your good\\n\\t\\t\\t\\tdeed."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "3",
    "NoteID": "5532",
    "Body": "Who these two consorts were, and what was the matter in\\n\\t\\t\\t\\tconfidence which was disclosed, we are not expressly\\n\\t\\t\\t\\ttold, but the facts mentioned in n. 5529 above will help\\n\\t\\t\\t\\tus to understand this passage. The sacred words imply\\n\\t\\t\\t\\tthat the matter was of great importance as to the\\n\\t\\t\\t\\tprinciple involved, but that the details were not of\\n\\t\\t\\t\\tsufficient importance for permanent record. For the\\n\\t\\t\\t\\tlessons to be drawn, see the notes following."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "3",
    "NoteID": "5533",
    "Body": "The moral we have to draw is manifold. (1) If anything is\\n\\t\\t\\t\\ttold us in confidence, especially by one at the head of\\n\\t\\t\\t\\taffairs, we must not divulge it to our closest friend.\\n\\t\\t\\t\\t(2) If such divulgence is made in the most secret\\n\\t\\t\\t\\twhispers, Allah's Plan is such that it will come to light\\n\\t\\t\\t\\tand expose those guilty of breach of confidence. (3) The\\n\\t\\t\\t\\tbreach of confidence must inevitably redound to the shame\\n\\t\\t\\t\\tof the guilty party."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "4",
    "NoteID": "5534",
    "Body": "There are further lessons. (4) Both the party betraying\\n\\t\\t\\t\\tconfidence and that encouraging the betrayal must purge\\n\\t\\t\\t\\ttheir conduct by repentance. (5) Frank repentance would\\n\\t\\t\\t\\tbe what their hearts and conscience themselves would\\n\\t\\t\\t\\tdictate and they must not resist such amends on account\\n\\t\\t\\t\\tof selfish obstinacy. (6) If they were to resist frank\\n\\t\\t\\t\\trepentance and amends, they are only abetting each\\n\\t\\t\\t\\tother's wrong, and they cannot prevail against all the\\n\\t\\t\\t\\tmoral forces which will be ranged on the side of the\\n\\t\\t\\t\\tright."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "4",
    "NoteID": "5535",
    "Body": "Do not forget the dual meaning: immediate, in application\\n\\t\\t\\t\\tto the holy Prophet, and general, being the lesson which\\n\\t\\t\\t\\twe ought all to learn. The holy Prophet could not be\\n\\t\\t\\t\\tinjured by any persons doing anything against him even\\n\\t\\t\\t\\tthough they might unconsciously put him in great\\n\\t\\t\\t\\tjeopardy: for Allah, the Angel Gabriel (who was the\\n\\t\\t\\t\\tMessenger to him), and the whole Community, would protect\\n\\t\\t\\t\\thim,-to say nothing of the army of angels or hidden\\n\\t\\t\\t\\tspiritual forces that always guarded him. Cf. xxxiii. 56.\\n\\t\\t\\t\\tThe general lemon for us is that the good man's\\n\\t\\t\\t\\tprotection is that of the moral forces around him; it is\\n\\t\\t\\t\\tdivine protection, against which human weakness or folly\\n\\t\\t\\t\\twill have no power."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "5",
    "NoteID": "5536",
    "Body": "From the case of two in verse 4, we now come to the case\\n\\t\\t\\t\\tof all the Consorts generally, in verse 5. Cf. xxxiii.\\n\\t\\t\\t\\t28-30. Their duties and responsibilities were higher than\\n\\t\\t\\t\\tthose of other women, and therefore their failure would\\n\\t\\t\\t\\talso be more serious. This is only hypothetical, in order\\n\\t\\t\\t\\tto show us the virtues expected of them: faith and\\n\\t\\t\\t\\tdevotion, worship and service, readiness for travel or\\n\\t\\t\\t\\thijrat, whether they were young or old, new to married\\n\\t\\t\\t\\tlife or otherwise. From them again the more general\\n\\t\\t\\t\\tapplication follows-to all women in Islam."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "5",
    "NoteID": "5537",
    "Body": "Saihat: literally, those who travel. Here it means those\\n\\t\\t\\t\\twho fast. Note that the spiritual virtues are named in\\n\\t\\t\\t\\tthe descending order: submitting their wills (Islam),\\n\\t\\t\\t\\tfaith and devotion, turning ever to worship and faith,\\n\\t\\t\\t\\tand performing other rites, or perhaps being content with\\n\\t\\t\\t\\tasceticism. And this applies to all women, maiden girls\\n\\t\\t\\t\\tor women of mature experience who were widows or\\n\\t\\t\\t\\tseparated from previous husbands by divorce."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "6",
    "NoteID": "5538",
    "Body": "Note how we have been gradually led up in admonition from\\n\\t\\t\\t\\ttwo Consorts to all consorts, to all women, to all\\n\\t\\t\\t\\tBelievers, and to all men and women. We must carefully\\n\\t\\t\\t\\tguard not only our own conduct, but the conduct of our\\n\\t\\t\\t\\tfamilies, and of all who are near and dear to us. For the\\n\\t\\t\\t\\tissues are most Serious, and the consequences of a fall\\n\\t\\t\\t\\tare most terrible."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "6",
    "NoteID": "5539",
    "Body": "\"A Fire whose fuel is Men and Stones.\" Cf. ii. 24. This\\n\\t\\t\\t\\tis a terrible Fire: not merely like the physical fire\\n\\t\\t\\t\\twhich burns wood or charcoal or substances like that, and\\n\\t\\t\\t\\tconsumes them. This Fire will have for its fuel men who\\n\\t\\t\\t\\tdo wrong and are as hard hearted as stones, or stone\\n\\t\\t\\t\\tIdols as symbolical of all the unbending Falsehoods in\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "6",
    "NoteID": "5540",
    "Body": "Cf. lxxiv. 31. We think of the angel nature as gentle and\\n\\t\\t\\t\\tbeautiful, but in another aspect perfection includes\\n\\t\\t\\t\\tjustice, fidelity, discipline, and the firm execution of\\n\\t\\t\\t\\tduty according to lawful commands. So, in the attributes\\n\\t\\t\\t\\tof Allah Himself, Justice and Mercy, Kindness and\\n\\t\\t\\t\\tCorrection are not contradictory but complementary. An\\n\\t\\t\\t\\tearthly ruler will be unkind to his loyal subjects if he\\n\\t\\t\\t\\tdoes not punish evil-doers."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "7",
    "NoteID": "5541",
    "Body": "'This is no hardship or injustice imposed on you. It is\\n\\t\\t\\t\\tall but the fruit of your own deeds; the result of your\\n\\t\\t\\t\\town deliberate choice.'"
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "8",
    "NoteID": "5542",
    "Body": "The opposition of sex against sex, individual or\\n\\t\\t\\t\\tconcerted, having been condemned , we are now exhorted to\\n\\t\\t\\t\\tturn to the Light, and to realise that the good and\\n\\t\\t\\t\\trighteous can retain their integrity even though their\\n\\t\\t\\t\\tmates, in spite of all their example and precept, remain\\n\\t\\t\\t\\tin evil and sin."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "8",
    "NoteID": "5543",
    "Body": "Whatever may have been the faults of the past, unite in\\n\\t\\t\\t\\tgood deeds, and abandon petty sectional jealousies, and\\n\\t\\t\\t\\tAllah will remove your difficulties and distresses, and\\n\\t\\t\\t\\tall the evils from which you suffer. Indeed He will grant\\n\\t\\t\\t\\tyou the Bliss of Heaven and save you from any humiliation\\n\\t\\t\\t\\twhich you may have brought on yourselves by your conduct\\n\\t\\t\\t\\tand on the revered Prophet and Teacher whose name you\\n\\t\\t\\t\\tprofessed to take."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "8",
    "NoteID": "5544",
    "Body": "See lvii. 12, and n. 5288. The darkness of evil will be\\n\\t\\t\\t\\tdispelled, and the Light of Allah will be realised by\\n\\t\\t\\t\\tthem more and more. But even so they will not be content:\\n\\t\\t\\t\\tfor they will pray for the least taint of evil to be\\n\\t\\t\\t\\tremoved from them, and perfection to be granted to them.\\n\\t\\t\\t\\tIn that exalted state they will be within reach of\\n\\t\\t\\t\\tperfection,-not by their own merits, but by the infinite\\n\\t\\t\\t\\tMercy and Power of Allah."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "9",
    "NoteID": "5545",
    "Body": "See ix. 73, where the same words introduce the argument\\n\\t\\t\\t\\tagainst the Hypocrites. Here they introduce the argument\\n\\t\\t\\t\\tagainst wickedness, which, though given the privilege of\\n\\t\\t\\t\\tassociation with goodness and piety, persisted in wicked\\n\\t\\t\\t\\tdeeds, and in favour of those noble souls, which, though\\n\\t\\t\\t\\ttied to wickedness; retained their purity and integrity.\\n\\t\\t\\t\\tTwo examples of each kind are given,-of women, as this\\n\\t\\t\\t\\tSura is mainly concerned with women."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "10",
    "NoteID": "5546",
    "Body": "Read Noah's story in xi. 36-48. Evidently his\\n\\t\\t\\t\\tcontemporary world had got so corrupt that it needed a\\n\\t\\t\\t\\tgreat Flood to purge it. \"None of the people will believe\\n\\t\\t\\t\\texcept those who have believed already. So grieve no\\n\\t\\t\\t\\tlonger over their evil deeds.\" But there were evil ones\\n\\t\\t\\t\\tin his own family. A foolish and undutiful son is\\n\\t\\t\\t\\tmentioned in xi. 42-46. Poor Noah tried to save him and\\n\\t\\t\\t\\tpray for him as one \"of his family\"; but the answer came:\\n\\t\\t\\t\\t\"he is not of thy family; for his conduct is\\n\\t\\t\\t\\tunrighteous\". We might expect such a son to have a mother\\n\\t\\t\\t\\tlike him, and here we are told that it was so. Noah's\\n\\t\\t\\t\\twife was also false to the standards of her husband, and\\n\\t\\t\\t\\tperished in this world and in the Hereafter."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "10",
    "NoteID": "5547",
    "Body": "The wife of Lot has already been mentioned more than\\n\\t\\t\\t\\tonce. See xi. 81, and n. 1577; vii. 83, and n. 1051; etc.\\n\\t\\t\\t\\tThe world around her was wicked, and she sympathised with\\n\\t\\t\\t\\tand followed that wicked world, rather than her righteous\\n\\t\\t\\t\\thusband. She suffered the fate of her wicked world."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "10",
    "NoteID": "5548",
    "Body": "\"Betrayed their husbands\": not in sex, but in the vital\\n\\t\\t\\t\\tspiritual matters of truth and conduct. They had the high\\n\\t\\t\\t\\tprivilege of the most intimate relationship with the\\n\\t\\t\\t\\tnoblest spirits of their age: but if they failed to rise\\n\\t\\t\\t\\tto the height of their dignity, their relationship did\\n\\t\\t\\t\\tnot save them. They could not plead that they were the\\n\\t\\t\\t\\twives of pious husbands. They had to enter Hell like any\\n\\t\\t\\t\\tother wicked women. There is personal responsibility\\n\\t\\t\\t\\tbefore Allah. One soul cannot claim the merits of\\n\\t\\t\\t\\tanother, any more than one pure soul can be injured by\\n\\t\\t\\t\\tassociation with a corrupt soul. The pure one should keep\\n\\t\\t\\t\\tits purity intact. See the next two examples."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "11",
    "NoteID": "5549",
    "Body": "Traditionally she is known as 'Asiya, one of the four\\n\\t\\t\\t\\tperfect women, the other three being Mary the mother of\\n\\t\\t\\t\\tJesus, Khadija the wife of the holy Prophet, and Fatima\\n\\t\\t\\t\\this daughter. Pharaoh is the type of arrogance,\\n\\t\\t\\t\\tgodlessness, and wickedness. For his wife to have\\n\\t\\t\\t\\tpreserved her Faith, her humility, and her righteousness\\n\\t\\t\\t\\twas indeed a great spiritual triumph. She was probably\\n\\t\\t\\t\\tthe same who saved the life of the infant Moses: xxviii.\\n\\t\\t\\t\\t9."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "11",
    "NoteID": "5550",
    "Body": "Her spiritual vision was directed to Allah, rather than\\n\\t\\t\\t\\tto the worldly grandeur of Pharaoh's court. It is\\n\\t\\t\\t\\tprobable that her prayer implies a desire for martyrdom,\\n\\t\\t\\t\\tand it may be that she attained her crown of martyrdom."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "12",
    "NoteID": "5551",
    "Body": "'Imran was traditionally the name of the father of Mary\\n\\t\\t\\t\\tthe mother of Jesus: see n. 375 to iii. 35. She was one\\n\\t\\t\\t\\tof the purest of women, though the Jews accused her\\n\\t\\t\\t\\tfalsely of unchastity: cf. xix. 27-28."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "12",
    "NoteID": "5552",
    "Body": "Cf. xxi. 91. As a virgin she gave birth to Jesus: xix.\\n\\t\\t\\t\\t16-29. In xxxii. 9, it is said of Adam's progeny, man,\\n\\t\\t\\t\\tthat Allah \"fashioned him in due proportion, and breathed\\n\\t\\t\\t\\tinto him something of His spirit\". In xv. 29, similar\\n\\t\\t\\t\\twords are used with reference to Adam. The virgin birth\\n\\t\\t\\t\\tshould not therefore be supposed to imply that Allah was\\n\\t\\t\\t\\tthe father of Jesus in the sense in which Greek mythology\\n\\t\\t\\t\\tmakes Zeus the father of Apollo by Latona or of Minos by\\n\\t\\t\\t\\tEuropa. And yet that is the doctrine to which the\\n\\t\\t\\t\\tChristian idea of \"the only begotten Son of God\" leads."
  },
  {
    "SurahNumber": "66",
    "AyahNumber": "12",
    "NoteID": "5553",
    "Body": "Mary had true faith and testified her faith in the\\n\\t\\t\\t\\tprophet Jesus and in his revelation as well as in the\\n\\t\\t\\t\\trevelations which he came to confirm (and to foreshadow).\\n\\t\\t\\t\\tShe was of the company of the Devout of all ages. The\\n\\t\\t\\t\\tfact that Qanitin (devout) is not here in the feminine\\n\\t\\t\\t\\tgender implies that the highest spiritual dignity is\\n\\t\\t\\t\\tindependent of sex. And so we close the lesson of this\\n\\t\\t\\t\\tSura, that while sex is a fact of our physical existence,\\n\\t\\t\\t\\tthe sexes should act in harmony and cooperation for in\\n\\t\\t\\t\\tthe highest spiritual matters we are all one. \"We made\\n\\t\\t\\t\\ther and her son a Sign for all peoples. Verily this\\n\\t\\t\\t\\tBrotherhood of yours is a single Brotherhood and I am\\n\\t\\t\\t\\tyour Lord and Cherisher: therefore serve Me and no other\"\\n\\t\\t\\t\\t(xxi. 91-92)."
  }
]
