[
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "1",
    "sectionHeading": "The Dua for Madina and Its People",
    "text": "<p>\\n\\t\\t\\t\\tYahya ibn Yahya related to me from Ishaq ibn Abdullah ibn\\n\\t\\t\\t\\tAbi Talha al-Ansari from Anas ibn Malik that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"O Allah! Bless them in their measure, and\\n\\t\\t\\t\\tbless them in their sa and mudd.\" He meant the people of\\n\\t\\t\\t\\tMadina.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "2",
    "sectionHeading": "The Dua for Madina and Its People",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Suhayl ibn Abi Salih\\n\\t\\t\\t\\tfrom his father that Abu Hurayra said, \"When people saw\\n\\t\\t\\t\\tthe first fruits of the season, they brought them to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, took them and said, 'O Allah! Bless us\\n\\t\\t\\t\\tin our fruits. Bless us in our city. Bless us in our sa\\n\\t\\t\\t\\tand bless us in our mudd. O Allah! Ibrahim is Your slave,\\n\\t\\t\\t\\tYour Khalil and Your Prophet. I am Your slave and Your\\n\\t\\t\\t\\tProphet. He prayed to You for Makka. I pray to You for\\n\\t\\t\\t\\tMadina for the like of what He prayed to You for Makka,\\n\\t\\t\\t\\tand the like of it with it.' Then he called the smallest\\n\\t\\t\\t\\tchild he saw and gave him the fruits.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "3",
    "sectionHeading": "Residing in Madina and Leaving It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Qatan ibn Wahb ibn\\n\\t\\t\\t\\tUmayr ibn al-Ajda that Yuhannas, the mawla of az-Zubayr\\n\\t\\t\\t\\tibn al-Awwam informed him that he was sitting with\\n\\t\\t\\t\\tAbdullah ibn Umar during the troubles (at the time of\\n\\t\\t\\t\\tal-Hajaj ibn Yusuf) . A female mawla of his came and\\n\\t\\t\\t\\tgreeted him. She said, \"I want to leave, Abu Abd\\n\\t\\t\\t\\tar-Rahman. The time is harsh for us.\" Abdullah ibn Umar\\n\\t\\t\\t\\tsaid to her, \"Sit down, O you with little knowledge, for\\n\\t\\t\\t\\tI have heard the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, say, 'No one will be patient in\\n\\t\\t\\t\\thunger and hardship in it (Madina) except that I will be\\n\\t\\t\\t\\ta witness or intercede for him on the Day of Rising.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "4",
    "sectionHeading": "Residing in Madina and Leaving It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn\\n\\t\\t\\t\\tal-Munkadir from Jabir ibn Abdullah that a Bedouin took\\n\\t\\t\\t\\tan oath of allegiance in Islam with the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace. A fever\\n\\t\\t\\t\\tbefell the Bedouin at Madina. He came to the Messenger of\\n\\t\\t\\t\\tAllah, and said, \"Messenger of Allah, release me from my\\n\\t\\t\\t\\tpledge.\" The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, refused. Then he came to him again and\\n\\t\\t\\t\\tsaid, \"Release me from my pledge.\" The Messenger of Allah\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, refused. Then he\\n\\t\\t\\t\\tcame again and said, \"Release me from my pledge.\" He\\n\\t\\t\\t\\trefused. Then he came again and said, \"Release me from my\\n\\t\\t\\t\\tpledge.\" He refused. The Bedouin left and the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Madina is like the blacksmith's furnace. It removes the\\n\\t\\t\\t\\timpurities and purifies the good.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "5",
    "sectionHeading": "Residing in Madina and Leaving It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Yahya ibn Said said, \"I heard\\n\\t\\t\\t\\tAbu'l-Hubab Said ibn Yasar say that he heard Abu Hurayra\\n\\t\\t\\t\\tsay that he heard the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, say, 'I was ordered to a town\\n\\t\\t\\t\\twhich will eat up towns. They used to say, 'Yathrib,' but\\n\\t\\t\\t\\tit is Madina. It removes the bad people like the\\n\\t\\t\\t\\tblacksmith's furnace removes impurities from the iron.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "6",
    "sectionHeading": "Residing in Madina and Leaving It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Hisham ibn Urwa from his father\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"No one leaves Madina preferring\\n\\t\\t\\t\\tto live elsewhere, but that Allah will give it better\\n\\t\\t\\t\\tthan him in place of him .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "7",
    "sectionHeading": "Residing in Madina and Leaving It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Hisham ibn Urwa from his father\\n\\t\\t\\t\\tfrom Abdullah ibn az-Zubayr that Sufyan ibn Abi Zuhayr\\n\\t\\t\\t\\tsaid, \"I heard the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, say, 'Yemen will be conquered\\n\\t\\t\\t\\tand the people will be attracted to it, taking their\\n\\t\\t\\t\\tfamilies and whoever obeys them. Madina would have been\\n\\t\\t\\t\\tbetter for them, had they but known. Ash-Sham will be\\n\\t\\t\\t\\tconquered and people will be attracted to it, taking\\n\\t\\t\\t\\ttheir families and whoever obeys them. Madina would have\\n\\t\\t\\t\\tbeen better for them, had they but known. Iraq will be\\n\\t\\t\\t\\tconquered and people will be attracted to it, taking\\n\\t\\t\\t\\ttheir families and whoever obeys them. Madina would have\\n\\t\\t\\t\\tbeen better for them, had they but known.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "8",
    "sectionHeading": "Residing in Madina and Leaving It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Himas from his\\n\\t\\t\\t\\tpaternal uncle from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Madina will be left in the best way that it is until a\\n\\t\\t\\t\\tdog or wolf enters it and urinates on one of the pillars\\n\\t\\t\\t\\tof the mosque or on the mimbar.\" They asked, \"Messenger\\n\\t\\t\\t\\tof Allah! Who will have the fruit at that time?\" He\\n\\t\\t\\t\\treplied, \"Animals seeking food, birds and wild beasts.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "9",
    "sectionHeading": "Residing in Madina and Leaving It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that when Umar ibn\\n\\t\\t\\t\\tAbd al-Aziz left Madina, he turned towards it and wept.\\n\\t\\t\\t\\tThen he said, \"O Muzahim! Do you fear that we might be\\n\\t\\t\\t\\tamong those that Madina casts off?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "10",
    "sectionHeading": "The Making a Haram of Madina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Amr, the mawla of\\n\\t\\t\\t\\tal-Muttalib from Anas ibn Malik that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, saw Uhud\\n\\t\\t\\t\\tand said, \"This is a mountain which loves us and we love\\n\\t\\t\\t\\tit. O Allah! Ibrahim made Makka Haram, and I will make\\n\\t\\t\\t\\twhat is between the two tracts of black stones (in\\n\\t\\t\\t\\tMadina) a Haram.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "11",
    "sectionHeading": "The Making a Haram of Madina",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Said ibn\\n\\t\\t\\t\\tal-Musayyab that Abu Hurayra said, \"Had I seen a gazelle\\n\\t\\t\\t\\tat Madina, I would have left it to graze and would not\\n\\t\\t\\t\\thave frightened it. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'What is between the\\n\\t\\t\\t\\ttwo tracts of black stones is a Haram.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "12",
    "sectionHeading": "The Making a Haram of Madina",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yunus ibn Yusuf from Ata ibn\\n\\t\\t\\t\\tYasar that Abu Ayyub al-Ansari found some boys who had\\n\\t\\t\\t\\tdriven a fox into a corner, and he chased them away from\\n\\t\\t\\t\\tit.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I only know that he said, 'Is this done in\\n\\t\\t\\t\\tthe Haram of the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace?' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "13",
    "sectionHeading": "The Making a Haram of Madina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from a man who said, \"Zayd\\n\\t\\t\\t\\tibn Thabit came across me while I was at al-Aswaf (on the\\n\\t\\t\\t\\toutskirts of Madina). I had captured a hawk. He took it\\n\\t\\t\\t\\tfrom my hands and set it free.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "14",
    "sectionHeading": "The Epidemic of Madina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, umm al-muminin said, \"When the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, came to Madina, Abu Bakr and Bilal came down with\\n\\t\\t\\t\\ta fever. I visited them and said, 'Father, how are you?\\n\\t\\t\\t\\tBilal, how are you?'\" She continued, \"When Abu Bakr's\\n\\t\\t\\t\\tfever worsened he would say, 'Every man is struck down\\n\\t\\t\\t\\tamong his people in the morning - death is nearer than\\n\\t\\t\\t\\tthe strap of his sandal.'\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWhen it left Bilal, he raised his voice and said, 'Would\\n\\t\\t\\t\\tthat I knew whether I will spend a night at the valley of\\n\\t\\t\\t\\tMakka with the idhkhir herb and jalil herb around me.\\n\\t\\t\\t\\tWill I go one day to the waters of Majinna? Will the\\n\\t\\t\\t\\tmountains of Shama and Tafil appear to me?' \" '\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA'isha continued, \"I went to the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, and informed him. He\\n\\t\\t\\t\\tsaid, 'O Allah! Make us love Madina as much as we love\\n\\t\\t\\t\\tMakka or even more. Make it sound and bless us in our sa\\n\\t\\t\\t\\tand mudd. Remove its fever and put it in al-Juhfa.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "15",
    "sectionHeading": "The Epidemic of Madina",
    "text": "<p>\\n\\t\\t\\t\\tMalik said that Yahya ibn Said had related to him that\\n\\t\\t\\t\\tA'isha said that Amir ibn Fuhayra had said at the time of\\n\\t\\t\\t\\tthe epidemic, \"I have seen death before tasting it, the\\n\\t\\t\\t\\tcoward's destination is from above him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "16",
    "sectionHeading": "The Epidemic of Madina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nuaym ibn Abdullah\\n\\t\\t\\t\\tal-Mujmir that Abu Hurayra said, \"The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, 'There are\\n\\t\\t\\t\\tangels at the entries of Madina, and neither plague nor\\n\\t\\t\\t\\tthe Dajjal will enter it.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "17",
    "sectionHeading": "The Expulsion of the Jews from Madina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ismail ibn Abi Hakim\\n\\t\\t\\t\\tthat he heard Umar ibn Abd al-Aziz say, \"One of the last\\n\\t\\t\\t\\tthings that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said was, 'May Allah fight the jews\\n\\t\\t\\t\\tand the christians. They took the graves of their\\n\\t\\t\\t\\tProphets as places of prostration . Two deens shall not\\n\\t\\t\\t\\tco-exist in the land of the Arabs.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "18",
    "sectionHeading": "The Expulsion of the Jews from Madina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Two deens shall not co-exist in the Arabian\\n\\t\\t\\t\\tPeninsula.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that Ibn Shihab said, ''Umar ibn al-Khattab\\n\\t\\t\\t\\tsearched for information about that until he was\\n\\t\\t\\t\\tabsolutely convinced that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, had said, 'Two deens\\n\\t\\t\\t\\tshall not co-exist in the Arabian Peninsula,' and he\\n\\t\\t\\t\\ttherefore expelled the jews from Khaybar.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "19",
    "sectionHeading": "The Expulsion of the Jews from Madina",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, ''Umar ibn al-Khattab expelled the jews from\\n\\t\\t\\t\\tNajran (a jewish settlement in the Yemen) and Fadak (a\\n\\t\\t\\t\\tjewish settlement thirty miles from Madina). When the\\n\\t\\t\\t\\tjews of Khaybar left, they did not take any fruit or\\n\\t\\t\\t\\tland. The jews of Fadak took half the fruit and half the\\n\\t\\t\\t\\tland, because the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, had made a settlement with them for\\n\\t\\t\\t\\tthat. So Umar entrusted to them the value in gold,\\n\\t\\t\\t\\tsilver, camels, ropes and saddle bags of half the fruit\\n\\t\\t\\t\\tand half the land, and handed the value over to them and\\n\\t\\t\\t\\texpelled them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "20",
    "sectionHeading": "Concerning Madina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, came in view of Uhud and said,\\n\\t\\t\\t\\t\"This is a mountain which loves us and we love it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "21",
    "sectionHeading": "Concerning Madina",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tAbd ar-Rahman ibn al-Qasim that Aslam, the mawla of Umar\\n\\t\\t\\t\\tibn al-Khattab informed him that he had visited Abdullah\\n\\t\\t\\t\\tibn Ayyash al-Makhzumi. He saw that he had some nabidh\\n\\t\\t\\t\\twith him and he was at that moment on the way to Makka.\\n\\t\\t\\t\\tAslam said to him, ''Umar ibn al-Khattab loves this\\n\\t\\t\\t\\tdrink.\" Abdullah ibn Ayyash therefore carried a great\\n\\t\\t\\t\\tdrinking bowl and brought it to Umar ibn al-Khattab and\\n\\t\\t\\t\\tplaced it before him. Umar brought it near to him and\\n\\t\\t\\t\\tthen raised his head. Umar said, \"This drink is good,\" so\\n\\t\\t\\t\\the drank some of it and then passed it to a man on his\\n\\t\\t\\t\\tright. When Abdullah turned to go, Umar ibn al-Khattab\\n\\t\\t\\t\\tcalled him and asked, \"Are you the person who says that\\n\\t\\t\\t\\tMakka is better than Madina?\" Abdullah said, \"I said that\\n\\t\\t\\t\\tit was the Haram of Allah, and His place of security, and\\n\\t\\t\\t\\tHis House was in it.\" Umar said, \"I am not saying\\n\\t\\t\\t\\tanything about the House of Allah or His Haram.\" Then\\n\\t\\t\\t\\tUmar repeated \"Are you the person who says that Makka is\\n\\t\\t\\t\\tbetter than Madina?\" He replied, \"I said that it was the\\n\\t\\t\\t\\tHaram of Allah and His place of security, and His House\\n\\t\\t\\t\\twas in it.\" Umar said, \"I am not saying anything about\\n\\t\\t\\t\\tthe House of Allah and His Haram.\" Then Abdullah left.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "22",
    "sectionHeading": "About the Plague",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abd\\n\\t\\t\\t\\tal-Hamid ibn Abd ar-Rahman ibn Zayd ibn al-Khattab from\\n\\t\\t\\t\\tAbdullah ibn Abdullah ibn al-Harith ibn Nawfal from\\n\\t\\t\\t\\tAbdullah ibn Abbas that Umar ibn al-Khattab set out for\\n\\t\\t\\t\\tash Sham and when he was at Sargh, near Tabuk, the\\n\\t\\t\\t\\tcommanders of the army, Abu Ubayda ibn al-Jarrah and his\\n\\t\\t\\t\\tcompanions, met him and told him that the plague had\\n\\t\\t\\t\\tbroken out in ash-Sham. Ibn Abbas said, \"Umar ibn\\n\\t\\t\\t\\tal-Khattab said, 'all the first Muhajir unto me.' He\\n\\t\\t\\t\\tassembled them and asked them for advice, informing them\\n\\t\\t\\t\\tthat the plague had broken out in ash Sham. They\\n\\t\\t\\t\\tdisagreed. Some said, 'You have set out for something,\\n\\t\\t\\t\\tand we do not think that you should leave it.' Others\\n\\t\\t\\t\\tsaid, 'You have the companions of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and the rest of the people\\n\\t\\t\\t\\twith you, and we do not think that you should send them\\n\\t\\t\\t\\ttowards this plague.' Umar said, 'Leave me.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThen he said, 'Summon the Ansar to me.' They were\\n\\t\\t\\t\\tsummoned and he asked them for advice. They acted as the\\n\\t\\t\\t\\tMuhajirun had and disagreed as they had disagreed. He\\n\\t\\t\\t\\tsaid, 'Leave me.' \"Then he said, 'Summon to me whoever is\\n\\t\\t\\t\\there of the aged men of Quraysh from the Muhajirun of the\\n\\t\\t\\t\\tconquest.' He summoned them and not one of them differed.\\n\\t\\t\\t\\tThey said, 'We think that you should withdraw the people\\n\\t\\t\\t\\tand not send them towards the plague.' Umar called out to\\n\\t\\t\\t\\tthe people, 'I am leaving by camel in the morning,' so\\n\\t\\t\\t\\tthey set out. Abu Ubayda said, 'Is it flight from the\\n\\t\\t\\t\\tdecree of Allah?' Umar said, 'Better that someone other\\n\\t\\t\\t\\tthan you had said it, Abu Ubayda. Yes. We flee from the\\n\\t\\t\\t\\tdecree of Allah to the decree of Allah. What would you\\n\\t\\t\\t\\tthink if these camels had gone down into a valley which\\n\\t\\t\\t\\thad two slopes, one of them fertile, and the other\\n\\t\\t\\t\\tbarren. If you pastured in the fertile part, wouldn't you\\n\\t\\t\\t\\tpasture them by the decree of Allah? If you pastured them\\n\\t\\t\\t\\tin the barren part, wouldn't you pasture them by the\\n\\t\\t\\t\\tdecree of Allah?'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t''Abd ar-Rahman ibn Awf arrived and he had been off doing\\n\\t\\t\\t\\tsomething and he said, 'I have some knowledge of this. I\\n\\t\\t\\t\\theard the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, say, \"If you hear about it in a land, do\\n\\t\\t\\t\\tnot go forward to it. If it comes upon a land and you are\\n\\t\\t\\t\\tin it, then do not depart in flight from it.\" ' Umar\\n\\t\\t\\t\\tpraised Allah and then set off.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "23",
    "sectionHeading": "About the Plague",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn\\n\\t\\t\\t\\tal-Munkadir and from Salim ibn Abi'n-Nadr, the mawla of\\n\\t\\t\\t\\tUmar ibn Ubaydullah that Amir ibn Sad ibn Abi Waqqas\\n\\t\\t\\t\\theard his father ask Usama ibn Zayd, \"Have you heard\\n\\t\\t\\t\\tanything from the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, about the plague?\" Usama said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'The plague is a punishment that was sent\\n\\t\\t\\t\\tdown on a party of the Banu Israil or whoever was before\\n\\t\\t\\t\\tthem. When you hear of it in a land, do not enter it. If\\n\\t\\t\\t\\tit comes upon a land and you are in it, do not depart in\\n\\t\\t\\t\\tflight from it.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that Abu'n-Nadr said, \"That is, do not depart\\n\\t\\t\\t\\twith no other intention but flight.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "24",
    "sectionHeading": "About the Plague",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tAbdullah ibn Amir ibn Rabia that Umar ibn al-Khattab went\\n\\t\\t\\t\\tout to ash-Sham. When he came to Sargh, near Tabuk, he\\n\\t\\t\\t\\theard that the plague had broken out in ash-Sham. Abd\\n\\t\\t\\t\\tar-Rahman ibn Awf told him that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, \"If you\\n\\t\\t\\t\\thear that a land has a plague in it, do not go forward to\\n\\t\\t\\t\\tit. If it comes upon a land which you are in, do not\\n\\t\\t\\t\\tdepart in flight from it.\" Umar ibn al-Khattab came back\\n\\t\\t\\t\\tfrom Sargh.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "25",
    "sectionHeading": "About the Plague",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Salim\\n\\t\\t\\t\\tibn Abdullah that Umar ibn al-Khattab turned people back\\n\\t\\t\\t\\tat Sargh according to the hadith of Abd ar-Rahman ibn\\n\\t\\t\\t\\tAwf.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "45",
    "hadithNumber": "26",
    "sectionHeading": "About the Plague",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"I heard that Umar\\n\\t\\t\\t\\tibn al-Khattab said, 'A night in Rukba (a valley near\\n\\t\\t\\t\\tTaif,) is more preferable to me than ten nights in\\n\\t\\t\\t\\tash-Sham.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"He meant to lengthen and preserve their\\n\\t\\t\\t\\tlives because of the severity of the plague in ash-Sham\\n\\t\\t\\t\\t.\"\\n\\t\\t\\t</p>"
  }
]
