[
  {
    "BookCode": "AMH",
    "VolumeNumber": "35",
    "hadithNumber": "1",
    "sectionHeading": "Cases in which Pre-emption is Possible",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab and from Abu Salama ibn Abd ar-Rahman ibn\\n\\t\\t\\t\\tAwf that the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, decreed for partners the right of\\n\\t\\t\\t\\tpreemption in property which had not been divided up.\\n\\t\\t\\t\\tWhen boundaries had been fixed between them, then there\\n\\t\\t\\t\\twas no right of pre-emption.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the sunna about which there is no\\n\\t\\t\\t\\tdispute among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "35",
    "hadithNumber": "2",
    "sectionHeading": "Cases in which Pre-emption is Possible",
    "text": "<p>\\n\\t\\t\\t\\tMalik said that he heard that Said ibn al-Musayyab, when\\n\\t\\t\\t\\tasked about pre-emption and whether there was a sunna in\\n\\t\\t\\t\\tit, said, \"Yes. Pre-emption is in houses and land, and it\\n\\t\\t\\t\\tis only between partners.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "35",
    "hadithNumber": "3",
    "sectionHeading": "Cases in which Pre-emption is Possible",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he heard the like of that from\\n\\t\\t\\t\\tSulayman ibn Yasar.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who bought out one of the\\n\\t\\t\\t\\tpartners in a shared property, by paying the man with an\\n\\t\\t\\t\\tanimal, a slave, a slave-girl, or the equivalent of that\\n\\t\\t\\t\\tin goods. Then another partner decided to exercise his\\n\\t\\t\\t\\tright of pre-emption after that, and he found that the\\n\\t\\t\\t\\tslave or slave-girl had died, and no one knew what her\\n\\t\\t\\t\\tvalue had been. The buyer claimed, \"The value of the\\n\\t\\t\\t\\tslave or slave-girl was 100 dinars.\" The partner with the\\n\\t\\t\\t\\tright of pre-emption claimed, \"The value was 50 dinars.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The buyer takes an oath that the value of\\n\\t\\t\\t\\twhat he payed was 100 dinars. Then if the one with the\\n\\t\\t\\t\\tright of pre-emption wishes, he can compensate him, or\\n\\t\\t\\t\\telse he can leave it, unless he can bring a clear proof\\n\\t\\t\\t\\tthat the slave or slave-girl's value is less than what\\n\\t\\t\\t\\tthe buyer said. If someone gives away his portion of a\\n\\t\\t\\t\\tshared house or land and the recipient repays him for it\\n\\t\\t\\t\\tby cash or goods, the partners can take it by pre-emption\\n\\t\\t\\t\\tif they wish and pay off the recipient the value of what\\n\\t\\t\\t\\the gave in dinars or dirhams. If someone makes a gift of\\n\\t\\t\\t\\this portion of a shared house or land, and does not take\\n\\t\\t\\t\\tany remuneration and does not seek to, and a partner\\n\\t\\t\\t\\twants to take it for its value, he cannot do so as long\\n\\t\\t\\t\\tas the original partner has not been given recompense for\\n\\t\\t\\t\\tit. If there is any recompense, the one with the right of\\n\\t\\t\\t\\tpre-emption can have it for the price of the recompense.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who bought into a piece of shared\\n\\t\\t\\t\\tland for a price on credit, and one of the partners\\n\\t\\t\\t\\twanted to possess it by right of pre-emption . Malik\\n\\t\\t\\t\\tsaid, \"If it seems likely that the partner can meet the\\n\\t\\t\\t\\tterms, he has right of pre-emption for the same credit\\n\\t\\t\\t\\tterms. If it is feared that he will not be able to meet\\n\\t\\t\\t\\tthe terms, but he can bring a wealthy and reliable\\n\\t\\t\\t\\tguarantor of equal standing to the one who bought into\\n\\t\\t\\t\\tthe land, he can also take possession.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A person's absence does not sever his right\\n\\t\\t\\t\\tof pre-emption. Even if he is a way for a long time,\\n\\t\\t\\t\\tthere is no time limit after which the right of\\n\\t\\t\\t\\tpreemption is cut off.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man left land to a number of his\\n\\t\\t\\t\\tchildren, then one of them who had a child died and the\\n\\t\\t\\t\\tchild of the deceased sold his right in that land, the\\n\\t\\t\\t\\tbrother of the seller was more entitled to pre-empt him\\n\\t\\t\\t\\tthan his paternal uncles, the partners of his father.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what is done in our community.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Pre-emption is shared between partners\\n\\t\\t\\t\\taccording to their existing shares. Each of them takes\\n\\t\\t\\t\\taccording to his portion. If it is small, he has little.\\n\\t\\t\\t\\tIf it is great, it is according to that. That is if they\\n\\t\\t\\t\\tare tenacious and contend with each other about it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for a man who buys out the share of one\\n\\t\\t\\t\\tof his partners, and one of the other partners says, 'I\\n\\t\\t\\t\\twill take a portion according to my share,' and the first\\n\\t\\t\\t\\tpartner says, 'If you wish to take all the preemption, I\\n\\t\\t\\t\\twill give it up to you. If you wish to leave it, then\\n\\t\\t\\t\\tleave it.' If the first partner gives him the choice and\\n\\t\\t\\t\\thands it over to him, the second partner can only take\\n\\t\\t\\t\\tall the pre-emption or give it back. If he takes it, he\\n\\t\\t\\t\\tis entitled to it. If not, he has nothing.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who bought land, and developed it\\n\\t\\t\\t\\tby planting trees or digging a well etc., and then\\n\\t\\t\\t\\tsomeone came, and seeing that he had a right in the land,\\n\\t\\t\\t\\twanted to take possession of it by pre-emption. Malik\\n\\t\\t\\t\\tsaid \"He has no right of preemption unless he compensates\\n\\t\\t\\t\\tthe other for his expenditure. If he gives him the price\\n\\t\\t\\t\\tof what he has developed, he is entitled to pre-emption .\\n\\t\\t\\t\\tIf not, he has no right in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that someone who sold off his portion of a\\n\\t\\t\\t\\tshared house or land and then, on learning that some one\\n\\t\\t\\t\\twith a right of pre-emption was to take possession by\\n\\t\\t\\t\\tthat right, asked the buyer to revoke the sale, and he\\n\\t\\t\\t\\tdid so, did not have the right to do that. The pre-emptor\\n\\t\\t\\t\\thas more right to the property for the price for which he\\n\\t\\t\\t\\tsold it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIn the case of some one who bought along with a section\\n\\t\\t\\t\\tof a shared house or land, an animal and goods (that were\\n\\t\\t\\t\\tnot shared), so that when any one demanded his right of\\n\\t\\t\\t\\tpre-emption in the house or land he said, \"Take what I\\n\\t\\t\\t\\thave bought altogether, for I bought it altogether,\"\\n\\t\\t\\t\\tMalik said, \"The pre-emptor need only take possession of\\n\\t\\t\\t\\tthe house or land. Each thing the man bought is assessed\\n\\t\\t\\t\\taccording to its share of the lump sum the man paid. Then\\n\\t\\t\\t\\tthe pre-emptor takes possession of his right for a price\\n\\t\\t\\t\\twhich is appropriate on that basis. He does not take any\\n\\t\\t\\t\\tanimals or goods unless he wants to do that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone sells a section of shared land,\\n\\t\\t\\t\\tand one of those who have the right of preemption\\n\\t\\t\\t\\tsurrenders it to the buyer and another refuses to do\\n\\t\\t\\t\\tother than take his pre-emption, the one who refuses to\\n\\t\\t\\t\\tsurrender has to take all the preemption, and he cannot\\n\\t\\t\\t\\ttake according to his right and leave what remains.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIn the case where one of a number of partners in one\\n\\t\\t\\t\\thouse sold his share when all his partners were away\\n\\t\\t\\t\\texcept for one man, the one present was given the choice\\n\\t\\t\\t\\tof either taking the pre-emption or leaving it, and he\\n\\t\\t\\t\\tsaid, 'I will take my portion and leave the portions of\\n\\t\\t\\t\\tmy partners until they are present. If they take it, that\\n\\t\\t\\t\\tis that. If they leave it, I will take all the\\n\\t\\t\\t\\tpre-emption,' Malik said, 'He can only take it all or\\n\\t\\t\\t\\tleave it. If his partners come, they can take from him or\\n\\t\\t\\t\\tleave it as they wish. If this is offered to him and he\\n\\t\\t\\t\\tdoes not accept, I think that he has no pre-emption.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "35",
    "hadithNumber": "4",
    "sectionHeading": "Cases in Which Pre-Emption Is Not Possible",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik related from Muhammad ibn Umara\\n\\t\\t\\t\\tfrom Abu Bakr ibn Hazm that Uthman ibn Affan said, \"When\\n\\t\\t\\t\\tboundaries are fixed in land, there is no pre-emption in\\n\\t\\t\\t\\tit. There is no pre-emption in a well or in male palm\\n\\t\\t\\t\\ttrees. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what is done in our community.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no pre-emption in a road, whether\\n\\t\\t\\t\\tor not it is practical to divide it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community is that there\\n\\t\\t\\t\\tis no pre-emption in the courtyard of a house, whether or\\n\\t\\t\\t\\tnot it is practical to divide it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who bought into a shared property\\n\\t\\t\\t\\tprovided that he had the option of withdrawal and the\\n\\t\\t\\t\\tpartners of the seller wanted to take what their partner\\n\\t\\t\\t\\twas selling by pre-emption before the buyer had exercised\\n\\t\\t\\t\\this option. Malik said, \"They cannot do that until the\\n\\t\\t\\t\\tbuyer has taken possession and the sale is confirmed for\\n\\t\\t\\t\\thim. When the sale is confirmed, they have the right of\\n\\t\\t\\t\\tpre-emption.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who bought land and it remained\\n\\t\\t\\t\\tin his hands for some time. Then a man came and saw that\\n\\t\\t\\t\\the had a share of the land by inheritance. Malik said,\\n\\t\\t\\t\\t\"If the man's right of inheritance is established, he\\n\\t\\t\\t\\talso has a right of preemption. If the land has produced\\n\\t\\t\\t\\ta crop, the crop belongs to the buyer until the day when\\n\\t\\t\\t\\tthe right of the other is established, because he has\\n\\t\\t\\t\\ttended what was planted against being destroyed or being\\n\\t\\t\\t\\tcarried away by a flood.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik continued, \"If the time has been long, or the\\n\\t\\t\\t\\twitnesses are dead or the seller has died, or the buyer\\n\\t\\t\\t\\thas died, or they are both alive and the basis of the\\n\\t\\t\\t\\tsale and purchase has been forgotten because of the\\n\\t\\t\\t\\tlength of time, pre-emption is discontinued. A man only\\n\\t\\t\\t\\ttakes his right by inheritance which has been established\\n\\t\\t\\t\\tfor him. If his situation differs from this, because the\\n\\t\\t\\t\\tsale transaction is recent and he sees that the seller\\n\\t\\t\\t\\thas concealed the price in order to sever his right of\\n\\t\\t\\t\\tpre-emption, the value of the land is estimated, and he\\n\\t\\t\\t\\tbuys the land for that price by his right of pre-emption.\\n\\t\\t\\t\\tThen the buildings, plants, or structures which are extra\\n\\t\\t\\t\\tto the land are looked at, so he is in the position of\\n\\t\\t\\t\\tsome one who bought the land for a known price, and then\\n\\t\\t\\t\\tafter that built on it and planted. The owner of\\n\\t\\t\\t\\tpre-emption takes possession after that is included.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Pre-emption is applied to the property of\\n\\t\\t\\t\\tthe deceased as it is applied to the property of the\\n\\t\\t\\t\\tliving. If the family of the deceased fear to break up\\n\\t\\t\\t\\tthe property of the deceased, then they share it and sell\\n\\t\\t\\t\\tit, and they have no pre-emption in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no pre-emption among us in a slave\\n\\t\\t\\t\\tor a slave-girl or a camel, a cow, sheep, or any animal,\\n\\t\\t\\t\\tnor in clothes or a well which does not have any\\n\\t\\t\\t\\tuncultivated land around it. Pre-emption is in what can\\n\\t\\t\\t\\tbe usefully divided, and in land in which boundaries\\n\\t\\t\\t\\toccur. As for what cannot be usefully divided, there is\\n\\t\\t\\t\\tno pre-emption in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Some one who buys land in which people who\\n\\t\\t\\t\\tare present have a right of pre-emption, refers them to\\n\\t\\t\\t\\tthe Sultan and either they claim their right or the\\n\\t\\t\\t\\tSultan surrenders it to him. If he were to leave them,\\n\\t\\t\\t\\tand not refer their situation to the Sultan and they knew\\n\\t\\t\\t\\tabout his purchase, and then they left it until a long\\n\\t\\t\\t\\ttime had passed and then came demanding their\\n\\t\\t\\t\\tpre-emption, I do not think that they would have it.\"\\n\\t\\t\\t</p>"
  }
]
