[
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "1",
    "sectionHeading": "Command to Write Testaments",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Nafi from Abdullah ibn Umar that\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"It is the duty of a muslim man who has\\n\\t\\t\\t\\tsomething to be given as a bequest not to spend two\\n\\t\\t\\t\\tnights without writing a will about it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed-on way of doing things\\n\\t\\t\\t\\tin our community is that when the testator writes\\n\\t\\t\\t\\tsomething in health or illness as a bequest, and it has\\n\\t\\t\\t\\tfreeing slaves or things other than that in it, he can\\n\\t\\t\\t\\talter it in any way he chooses, until he is on his\\n\\t\\t\\t\\tdeathbed. If he prefers to abandon a bequest or change\\n\\t\\t\\t\\tit, he can do so unless he has made a slave mudabbar (to\\n\\t\\t\\t\\tbe freed after his death). If he has made him mudabbar,\\n\\t\\t\\t\\tthere is no way to change what he has made mudabbar. He\\n\\t\\t\\t\\tis allowed to change his testament because the Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"It is the duty of a muslim man who has something to be\\n\\t\\t\\t\\tgiven as a bequest not to spend two nights without\\n\\t\\t\\t\\twriting a will about it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik explained, \"Had the testator not been able to\\n\\t\\t\\t\\tchange his will nor what was mentioned in it about\\n\\t\\t\\t\\tfreeing slaves, each testator might withhold making\\n\\t\\t\\t\\tbequests from his property, whether in freeing slaves or\\n\\t\\t\\t\\tother than it. A man gives a bequest in his health and in\\n\\t\\t\\t\\this travelling.\" (i.e. he does not wait till his death\\n\\t\\t\\t\\tbed ) .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik summed up, \"The way of doing things in our\\n\\t\\t\\t\\tcommunity about which there is no dispute is that he can\\n\\t\\t\\t\\tchange whatever he likes of that except for the\\n\\t\\t\\t\\tmudabbar.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "2",
    "sectionHeading": "Permissibility of the Bequest of the Child, the Simpleton, the Lunatic and the Idiot",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abdullah ibn Abi Bakr ibn Hazm\\n\\t\\t\\t\\tthat Amr ibn Sulaym az-Zuraqi informed his father that it\\n\\t\\t\\t\\thad been said to Umar ibn al-Khattab, \"There is here an\\n\\t\\t\\t\\tadolescent boy who has not yet reached puberty. He is\\n\\t\\t\\t\\tfrom the Ghassan tribe and his heir is in ash-Sham. He\\n\\t\\t\\t\\thas property. Here he only has the daughter of one of his\\n\\t\\t\\t\\tpaternal uncles.\" Umar ibn al-Khattab instructed, \"Let\\n\\t\\t\\t\\thim leave her a bequest.\" He willed her a property called\\n\\t\\t\\t\\tthe well of Jusham.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"That property was sold for 30,000 dirhams,\\n\\t\\t\\t\\tand the daughter of the paternal uncle to whom he willed\\n\\t\\t\\t\\tit was the mother of Amr ibn Sulaym az-Zuraqi.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "3",
    "sectionHeading": "Permissibility of the Bequest of the Child, the Simpleton, the Lunatic and the Idiot",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said from Abu Bakr ibn\\n\\t\\t\\t\\tHazm that a boy from Ghassan was dying in Madina while\\n\\t\\t\\t\\this heir was in Syria. That was mentioned to Umar ibn\\n\\t\\t\\t\\tal-Khattab. It was said to him, \"So-and-so is dying.\\n\\t\\t\\t\\tShall he make a bequest?\" He said, \"Let him make a\\n\\t\\t\\t\\tbequest.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya ibn Said said that Abu Bakr had said, \"He was a boy\\n\\t\\t\\t\\tof ten or twelve years.\" Yahya said, \"He willed the well\\n\\t\\t\\t\\tof Jusham, and his people sold it for 30,000 dirhams.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"The generally\\n\\t\\t\\t\\tagreed-on way of doing things in our community is that a\\n\\t\\t\\t\\tsimpleton, an idiot, or a lunatic who recovers at times,\\n\\t\\t\\t\\tcan make wills if they have enough of their wits about\\n\\t\\t\\t\\tthem to recognise what they will. Someone who has not\\n\\t\\t\\t\\tenough wits to recognise what he wills, and is overcome\\n\\t\\t\\t\\tin his intellect, cannot make a bequest.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "4",
    "sectionHeading": "Limiting the Bequest to One-Third of the Estate",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Amir ibn Sad ibn\\n\\t\\t\\t\\tAbi Waqqas that his father said, \"The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, came to me to\\n\\t\\t\\t\\ttreat me for a pain which became hard to bear in the year\\n\\t\\t\\t\\tof the farewell hajj. I said, 'Messenger of Allah, you\\n\\t\\t\\t\\tcan see how far the pain has reached me. I have property\\n\\t\\t\\t\\tand only my daughter inherits from me. Shall I give two\\n\\t\\t\\t\\tthirds of my property as sadaqa?' The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, 'No.' I\\n\\t\\t\\t\\tsaid, 'Half?' He said, 'No.' Then the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, 'A third,\\n\\t\\t\\t\\tand a third is a lot. Leaving your heirs rich is better\\n\\t\\t\\t\\tthan leaving them poor to beg from people. You never\\n\\t\\t\\t\\tspend anything on maintenance desiring the Face of Allah\\n\\t\\t\\t\\tby it, but that you are rewarded for it, even what you\\n\\t\\t\\t\\tappoint for your wife.' Sad said, 'Messenger of Allah,\\n\\t\\t\\t\\twill I be left here in Makka after my companions have\\n\\t\\t\\t\\tdeparted for Madina?' The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'If you are left\\n\\t\\t\\t\\tbehind, and do sound deeds you will increase your degree\\n\\t\\t\\t\\tand elevation by them. Perhaps you will be left behind so\\n\\t\\t\\t\\tthat some people may benefit by you and others may be\\n\\t\\t\\t\\tharmed by you. O Allah! complete their hijra for my\\n\\t\\t\\t\\tcompanions, and do not turn them back on their heels. The\\n\\t\\t\\t\\tunfortunate one is Said ibn Khawla.' The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, was\\n\\t\\t\\t\\tdistressed on his account for he had died at Makka.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik speak about a man who\\n\\t\\t\\t\\twilled a third of his property to a man and said as well,\\n\\t\\t\\t\\t\"My slave will serve so-and-so (another man) for as long\\n\\t\\t\\t\\tas he lives, then he is free,\" then that was looked into,\\n\\t\\t\\t\\tand the slave was found to be a third of the property of\\n\\t\\t\\t\\tthe deceased. Malik said, \"The service of the slave is\\n\\t\\t\\t\\tevaluated. Then the two of them divide it between them.\\n\\t\\t\\t\\tThe one who was willed a third takes his third, as a\\n\\t\\t\\t\\tshare, and the one who was willed the service of the\\n\\t\\t\\t\\tslave takes what was evaluated for him of the slave's\\n\\t\\t\\t\\tservice. Each of them takes, from the service of the\\n\\t\\t\\t\\tslave or from his wage if he has a wage, according to his\\n\\t\\t\\t\\tshare. If the one who was given the service of the slave\\n\\t\\t\\t\\tfor as long as he lived dies, then the slave is freed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik speak about someone who\\n\\t\\t\\t\\twilled his third and said \"So-and-so has such-and-such,\\n\\t\\t\\t\\tand so-and-so has such-and-such,\" naming some of his\\n\\t\\t\\t\\tproperty, and his heirs protested that it was more than a\\n\\t\\t\\t\\tthird.\" Malik said, \"The heirs then have an option\\n\\t\\t\\t\\tbetween giving the beneficiaries their full bequests and\\n\\t\\t\\t\\ttaking the rest of the property of the deceased, or\\n\\t\\t\\t\\tbetween dividing among the beneficiaries the third of the\\n\\t\\t\\t\\tproperty of the deceased and surrendering to them their\\n\\t\\t\\t\\tthird. If they wish, their rights in it reach as far as\\n\\t\\t\\t\\tthey reach.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "4",
    "sectionHeading": "Dealing with the Property of the Pregnant Woman, the Sick Person and Someone Present in Battle",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"The best of what I\\n\\t\\t\\t\\thave heard about the testament of a pregnant woman and\\n\\t\\t\\t\\tabout what settlements she is permitted in her property\\n\\t\\t\\t\\tis that the pregnant woman is like the sick person. When\\n\\t\\t\\t\\tthe illness is light, and one does not fear for the sick\\n\\t\\t\\t\\tperson, he does with his property what he likes. If the\\n\\t\\t\\t\\tillness is such that his life is feared for, he can only\\n\\t\\t\\t\\tdispose of a third of his estate.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"It is the same with a woman who is pregnant.\\n\\t\\t\\t\\tThe beginning of pregnancy is good news and joy. It is\\n\\t\\t\\t\\tnot illness and no fear because Allah the Blessed, the\\n\\t\\t\\t\\tExalted, said in His Book, 'We gave her good news of\\n\\t\\t\\t\\tIshaq and after Ishaq, Yaqub.' (Sura ll ayat 71). And He\\n\\t\\t\\t\\tsaid, 'She bore a light burden and passed by with it, but\\n\\t\\t\\t\\twhen she became heavy, they called upon Allah, their\\n\\t\\t\\t\\tLord, \"If you give us a good-doing son, we will be among\\n\\t\\t\\t\\tthe thankful.\" '(Sura 7 ayat 189).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"When a pregnant woman becomes heavy, she is only\\n\\t\\t\\t\\tpermitted to dispose of a third of her estate. The\\n\\t\\t\\t\\tbeginning of this restriction is after six months. Allah,\\n\\t\\t\\t\\tthe Blessed, the Exalted, said in His Book, 'Mothers\\n\\t\\t\\t\\tsuckle their children for two complete years.' And He\\n\\t\\t\\t\\tsaid, 'his bearing and weaning are thirty months.' (Sura\\n\\t\\t\\t\\t2 ayat 233).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"When six months have passed for the pregnant woman from\\n\\t\\t\\t\\tthe day she conceived, she is only permitted to dispose\\n\\t\\t\\t\\tof a third of her property.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"A man who is\\n\\t\\t\\t\\tadvancing in the row for battle, can only dispose of a\\n\\t\\t\\t\\tthird of his property. He is in the same position as a\\n\\t\\t\\t\\tpregnant woman or an ill person who is feared for, as\\n\\t\\t\\t\\tlong as he is in that situation.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "4",
    "sectionHeading": "Bequests to Heirs and Right of Possession",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"This ayat is\\n\\t\\t\\t\\tabrogated. It is the word of Allah, the Blessed, the\\n\\t\\t\\t\\tExalted, 'If he leaves goods, the testament is for\\n\\t\\t\\t\\tparents and kinsmen.' What came down about the division\\n\\t\\t\\t\\tof the fixed shares of inheritance in the Book of Allah,\\n\\t\\t\\t\\tthe Mighty, the Exalted, abrogated it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"The established\\n\\t\\t\\t\\tsunna with us, in which there is no dispute, is that it\\n\\t\\t\\t\\tis not permitted for a testator to make a bequest (in\\n\\t\\t\\t\\taddition to the fixed share) in favour of an heir, unless\\n\\t\\t\\t\\tthe other heirs permit him. If some of them permit him\\n\\t\\t\\t\\tand others refuse, he is allowed to diminish the share of\\n\\t\\t\\t\\tthose who have given their permission. Those who refuse\\n\\t\\t\\t\\ttake their full share from the inheritance.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik speak about an invalid who\\n\\t\\t\\t\\tmade a bequest and asked his heirs to give him permission\\n\\t\\t\\t\\tto make a bequest when he was so ill that he only had\\n\\t\\t\\t\\tcommand of a third of his property, and they gave him\\n\\t\\t\\t\\tpermission to leave some of his heirs more than his\\n\\t\\t\\t\\tthird. Malik said, \"They cannot revoke that. Had they\\n\\t\\t\\t\\tbeen permitted to do so, every heir would have done that,\\n\\t\\t\\t\\tand then, when the testator died, they would take that\\n\\t\\t\\t\\tfor themselves and prevent him from bequeathing his third\\n\\t\\t\\t\\tand what was permitted to him with respect to his\\n\\t\\t\\t\\tproperty.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If he asks permission of his heirs to grant\\n\\t\\t\\t\\ta bequest to an heir while he is well and they give him\\n\\t\\t\\t\\tpermission, that is not binding on them. The heirs can\\n\\t\\t\\t\\trescind that if they wish. That is because when a man is\\n\\t\\t\\t\\twell, he is entitled to all his property and can do what\\n\\t\\t\\t\\the wishes with it. If he wishes, he can spend all of it.\\n\\t\\t\\t\\tHe can spend it and give sadaqa with it or give it to\\n\\t\\t\\t\\twhomever he likes. His asking permission of his heirs is\\n\\t\\t\\t\\tpermitted for the heirs, when they give him permission\\n\\t\\t\\t\\twhen authority over all his property is closed off from\\n\\t\\t\\t\\thim and nothing outside of the third is permitted to him,\\n\\t\\t\\t\\tand when they are more entitled to the two-thirds of his\\n\\t\\t\\t\\tproperty than he is himself. That is when their\\n\\t\\t\\t\\tpermission becomes relevant. If he asks one of the heirs\\n\\t\\t\\t\\tto give his inheritance to him when he is dying, and the\\n\\t\\t\\t\\their agrees and then the dying man does not dispose of it\\n\\t\\t\\t\\tat all, it is returned to the one who gave it unless the\\n\\t\\t\\t\\tdeceased said to him, 'So-and-so - (one of his heirs) -\\n\\t\\t\\t\\tis weak, and I would like you to give him your\\n\\t\\t\\t\\tinheritance.' So he gives it to him. That is permitted\\n\\t\\t\\t\\twhen the deceased specified it for him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a man gives the dying man free use of\\n\\t\\t\\t\\this share of the inheritance, and the dying man\\n\\t\\t\\t\\tdistributes some of it and some remains, it is returned\\n\\t\\t\\t\\tto the giver, after the man has died.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik speak about someone who\\n\\t\\t\\t\\tmade a bequest and mentioned that he had given one of his\\n\\t\\t\\t\\theirs something which he had not taken possession of, so\\n\\t\\t\\t\\tthe heirs refused to permit that. Malik said, \"That gift\\n\\t\\t\\t\\treturns to the heirs as inheritance according to the Book\\n\\t\\t\\t\\tof Allah because the deceased did not mean that to be\\n\\t\\t\\t\\ttaken out of the third and the heirs do not have a\\n\\t\\t\\t\\tportion in the third (which the dying man is allowed to\\n\\t\\t\\t\\tbequeath).\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "5",
    "sectionHeading": "Effeminate Men and Custody of Children",
    "text": "<p>\\n\\t\\t\\t\\tMalik said from Hisham ibn Urwa from his father that an\\n\\t\\t\\t\\teffeminate man was with Umm Salama, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace. He said\\n\\t\\t\\t\\tto Abdullah ibn Abi Umayya while the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, was listening.\\n\\t\\t\\t\\t\"Abdullah! If Allah grants you victory over Ta'if\\n\\t\\t\\t\\ttomorrow, I will lead you to the daughter of Ghailan. She\\n\\t\\t\\t\\thas four folds on her front and eight folds on her back.\"\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"This sort of man should not enter freely\\n\\t\\t\\t\\twith you.\" (It was customary to allow men with no sexual\\n\\t\\t\\t\\tinclination to enter freely where there were women).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "6",
    "sectionHeading": "Effeminate Men and Custody of Children",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Yahya ibn Said said that he\\n\\t\\t\\t\\theard al-Qasim ibn Muhammad say, \"A woman of the Ansar\\n\\t\\t\\t\\twas married to Umar ibn al-Khattab. She bore Asim ibn\\n\\t\\t\\t\\tUmar to him, and then he separated from her. Umar came to\\n\\t\\t\\t\\tQuba and found his son Asim playing in the courtyard of\\n\\t\\t\\t\\tthe mosque. He took him by the arm and placed him before\\n\\t\\t\\t\\thim on his mount. The grandmother of the child saw him\\n\\t\\t\\t\\tand argued with Umar about the child so they went to Abu\\n\\t\\t\\t\\tBakr as-Siddiq. Umar said, 'My son.' The woman said, 'My\\n\\t\\t\\t\\tson.' Abu Bakr said, 'Do not interfere between a child\\n\\t\\t\\t\\tand its mother.' Umar did not repeat his words.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"This is what I would\\n\\t\\t\\t\\thave done in that situation.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "6",
    "sectionHeading": "Liability for Defect Goods",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that he heard Malik speak about a man who\\n\\t\\t\\t\\tbought goods - animals or clothes or wares, and the sale\\n\\t\\t\\t\\twas found not to be permitted so it was revoked and the\\n\\t\\t\\t\\tone who had taken the goods was ordered to return the\\n\\t\\t\\t\\towner his goods. Malik said, \"The owner of the goods only\\n\\t\\t\\t\\thas their value on the day they were taken from him, and\\n\\t\\t\\t\\tnot on the day they are returned to him. That is because\\n\\t\\t\\t\\tthe man is liable for them from the day he took them and\\n\\t\\t\\t\\twhatever loss is in them after that is against him. For\\n\\t\\t\\t\\tthat reason, their increase and growth are also his. A\\n\\t\\t\\t\\tman may take the goods at a time when they are selling\\n\\t\\t\\t\\twell and are in demand, and then have to return them at a\\n\\t\\t\\t\\ttime when they have fallen in price and no one wants\\n\\t\\t\\t\\tthem. For instance, the man may take the goods from the\\n\\t\\t\\t\\tother man, and sell them for ten dinars or keep them\\n\\t\\t\\t\\twhile their price is that. Then he may have to return\\n\\t\\t\\t\\tthem while their price is only a dinar. He should not go\\n\\t\\t\\t\\toff with nine dinars from the man's property. Or perhaps\\n\\t\\t\\t\\tthey are taken by the man, and he sells them for a dinar\\n\\t\\t\\t\\tor keeps them, while their price is only a dinar, then he\\n\\t\\t\\t\\thas to return them, and their value on the day he returns\\n\\t\\t\\t\\tthem is ten dinars. The one who took them does not have\\n\\t\\t\\t\\tto pay nine dinars from his property to the owner. He is\\n\\t\\t\\t\\tonly obliged to pay the value of what he took possession\\n\\t\\t\\t\\tof on the day it was taken .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"Part of what clarifies this is that when a\\n\\t\\t\\t\\tthief steals goods, only their price on the day he stole\\n\\t\\t\\t\\tthem is looked at. If cutting off the hand is necessary\\n\\t\\t\\t\\tbecause of it, that is done. If the cutting off is\\n\\t\\t\\t\\tdelayed, either because the thief is imprisoned until his\\n\\t\\t\\t\\tsituation is examined or he flees and then is caught, the\\n\\t\\t\\t\\tdelay of the cutting off of the hand does not make the\\n\\t\\t\\t\\thadd, which was obliged for him on the day he stole, fall\\n\\t\\t\\t\\tfrom him even if those goods become cheap after that. Nor\\n\\t\\t\\t\\tdoes delay oblige cutting off the hand if it was not\\n\\t\\t\\t\\tobliged on the day he took those goods, even if they\\n\\t\\t\\t\\tbecome expensive after that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "7",
    "sectionHeading": "General Chapter on Making Judgement and Shying Away From It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said that Abu'd-Darda\\n\\t\\t\\t\\twrote to Salman al-Farsi, \"Come immediately to the holy\\n\\t\\t\\t\\tland.\" Salman wrote back to him, \"Land does not make\\n\\t\\t\\t\\tanyone holy. Man's deeds make him holy. I have heard that\\n\\t\\t\\t\\tyou were put up as a doctor to treat and cure people. If\\n\\t\\t\\t\\tyou are innocent, then may you have delight! If you are a\\n\\t\\t\\t\\tquack, then beware lest you kill a man and enter the\\n\\t\\t\\t\\tFire!\" When Abu'd-Darda judged between two men, and they\\n\\t\\t\\t\\tturned from him to go, he would look at them and say,\\n\\t\\t\\t\\t\"Come back to me, and tell me your story again. A quack!\\n\\t\\t\\t\\tBy Allah!\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"If someone makes use\\n\\t\\t\\t\\tof a slave, without permission of its master, in anything\\n\\t\\t\\t\\timportant to him, whose like has a fee, he is liable for\\n\\t\\t\\t\\twhat befalls the slave if anything befalls him. If the\\n\\t\\t\\t\\tslave is safe and his master asks for his wage for what\\n\\t\\t\\t\\the has done, that is the master's right. This is what is\\n\\t\\t\\t\\tdone in our community.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say about a slave who is\\n\\t\\t\\t\\tpart free and part enslaved, \"His property is suspended\\n\\t\\t\\t\\tin his hand and he cannot begin anything with it. He eats\\n\\t\\t\\t\\tfrom it and clothes himself in an approved fashion. If he\\n\\t\\t\\t\\tdies, his property belongs to the one to whom he is in\\n\\t\\t\\t\\tslavery.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"The way of doing\\n\\t\\t\\t\\tthings in our community is that a parent can take his\\n\\t\\t\\t\\tchild to account for what he spends on him from the day\\n\\t\\t\\t\\tthe child has property, cash or goods, if the parent\\n\\t\\t\\t\\twants that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "8",
    "sectionHeading": "General Chapter on Making Judgement and Shying Away From It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Umar ibn Abd ar-Rahman ibn Dalaf\\n\\t\\t\\t\\tal-Muzani from his father that a man from the Juhayna\\n\\t\\t\\t\\ttribe used to buy camels before people set out for hajj\\n\\t\\t\\t\\tand sell them at a higher price. Then he travelled\\n\\t\\t\\t\\tquickly and used to arrive in Makka before the others who\\n\\t\\t\\t\\tset out for hajj. He went bankrupt and his situation was\\n\\t\\t\\t\\tput before Umar ibn al-Khattab, who said, \"O People!\\n\\t\\t\\t\\tal-Usayfi, al-Usayfi of the Juhayna, was satisfied with\\n\\t\\t\\t\\this deen and his trust because it was said of him that he\\n\\t\\t\\t\\tarrived before the others on hajj. He used to incur debts\\n\\t\\t\\t\\twhich he was not careful to repay, so all of his property\\n\\t\\t\\t\\thas been eaten up by it. Whoever has a debt against him,\\n\\t\\t\\t\\tlet him come to us tomorrow and we will divide his\\n\\t\\t\\t\\tproperty between his creditors. Beware of debts! Their\\n\\t\\t\\t\\tbeginning is a worry and their end is destitution. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "8",
    "sectionHeading": "About Damages and Injuries Caused by Slaves",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"The sunna with us\\n\\t\\t\\t\\tabout the crime of slaves is that the hand is not cut off\\n\\t\\t\\t\\tfor any harm that a slave causes a man, or something he\\n\\t\\t\\t\\tpilfers, or something guarded which he steals, or hanging\\n\\t\\t\\t\\tdates he cuts down or ruins, or steals. That is against\\n\\t\\t\\t\\tthe slave's person and does not exceed the price of the\\n\\t\\t\\t\\tslave whether it is little or much. If his master wishes\\n\\t\\t\\t\\tto give the value of what the slave took or ruined, or\\n\\t\\t\\t\\tpay the blood-price for the injury, he pays it and keeps\\n\\t\\t\\t\\this slave. If he wishes to surrender him, he surrenders\\n\\t\\t\\t\\thim, and none of that is against him. The master has the\\n\\t\\t\\t\\toption in that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "37",
    "hadithNumber": "9",
    "sectionHeading": "What is Permitted of Gifts",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Ibn Shihab from Said ibn\\n\\t\\t\\t\\tal-Musayyab that Uthman ibn Affan said, \"If someone gives\\n\\t\\t\\t\\tsomething to his small child who is not old enough to\\n\\t\\t\\t\\tlook after it himself, and in order that his gift might\\n\\t\\t\\t\\tbe permitted he makes the gift public and has it\\n\\t\\t\\t\\twitnessed, the gift is permitted, even if the father\\n\\t\\t\\t\\tkeeps charge of it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community is that if a\\n\\t\\t\\t\\tman gives his small child some gold or silver and then\\n\\t\\t\\t\\tdies and he has it in his own keeping, the child has none\\n\\t\\t\\t\\tof it unless the father set it aside in coin or placed it\\n\\t\\t\\t\\twith a man to keep for the son. If he does that, it is\\n\\t\\t\\t\\tpermitted for the son.\"\\n\\t\\t\\t</p>"
  }
]
