[
  {
    "SurahNumber": "30",
    "AyahNumber": "1",
    "Text": "Alif Lam M'im."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "2",
    "Text": "The Romans have been defeated (by the Persians, in Syria - A.D.\\n\\t\\t\\t615; the Prophet Muhammad's sympathies were with the Romans who\\n\\t\\t\\twere Christians, while the pagan Arabs were on the side of the\\n\\t\\t\\tPersians who were idol worshippers)"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "3",
    "Text": "in the neighboring land, but they, after this defeat, will soon\\n\\t\\t\\tbe victorious"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "4",
    "Text": "within a few years. The command lies with Allah in the past\\n\\t\\t\\tinstance as well as in the future. On that day the believers will\\n\\t\\t\\trejoice"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "5",
    "Text": "for the victory of the Romans as well as their own victory\\n\\t\\t\\tagainst the pagans with the help of Allah. He helps whom He\\n\\t\\t\\tpleases and He is the All-Mighty, the Most Merciful."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "6",
    "Text": "This is the promise of Allah and Allah never breaks His promise;\\n\\t\\t\\tbut most people do not know."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "7",
    "Text": "They only know the outward show of this world's life, but they\\n\\t\\t\\tare heedless about the life to come."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "8",
    "Text": "Have they not considered in their own minds that Allah created\\n\\t\\t\\tthe heavens and the earth and all that lies between them for a\\n\\t\\t\\tjust reason and for a specified time? But the truth is that many\\n\\t\\t\\tamong mankind do not believe in the meeting with their Rabb (the\\n\\t\\t\\tDay of Resurrection)!"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "9",
    "Text": "Have they not traveled through the earth and seen what was the\\n\\t\\t\\tend of those before them? They were superior in strength than\\n\\t\\t\\tthese; they tilled the soil and built on it more than these have\\n\\t\\t\\tever built. There came to them their Rasools with clear signs\\n\\t\\t\\t(but they rejected them to the detriment of their own\\n\\t\\t\\tdestruction): it was not Allah Who wronged them, but they wronged\\n\\t\\t\\ttheir own souls."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "10",
    "Text": "Evil was the outcome for those who committed evil, rejected the\\n\\t\\t\\trevelations of Allah and kept ridiculing them!"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "11",
    "Text": "It is Allah Who originates creation; then repeats it, and then to\\n\\t\\t\\tHim you shall be brought back."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "12",
    "Text": "On the Day when the Hour of Judgement will be established, the\\n\\t\\t\\tcriminals shall be in despair."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "13",
    "Text": "None of their shoraka' (gods which they had set up besides\\n\\t\\t\\tAllah), will be there to intercede for them and they themselves\\n\\t\\t\\twill disown their shoraka'."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "14",
    "Text": "On that Day when the Hour of Judgement will be established,\\n\\t\\t\\tmankind will be sorted out."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "15",
    "Text": "Those who have embraced the faith and have done good deeds shall\\n\\t\\t\\tbe made happy in a garden of paradise."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "16",
    "Text": "And those who have rejected Faith, denied Our revelations and the\\n\\t\\t\\tmeeting of the hereafter shall be presented for punishment."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "17",
    "Text": "Therefore, glorify Allah in the evening and in the morning"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "18",
    "Text": "- all praise is due to Him in the heavens and the earth - so\\n\\t\\t\\tglorify Him in the late afternoon and when the day begins to\\n\\t\\t\\tdecline."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "19",
    "Text": "He brings out the living from the dead and the dead from the\\n\\t\\t\\tliving, and gives life to the earth after its death. Likewise you\\n\\t\\t\\tshall be brought forth to life after your death."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "20",
    "Text": "Of His signs, one is that He created you from dust; and then\\n\\t\\t\\tbehold you men are scattered throughout the earth."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "21",
    "Text": "And of His signs, another one is that He created for you mates\\n\\t\\t\\tfrom among yourselves that you may find comfort with them, and He\\n\\t\\t\\tplanted love and kindness in your hearts; surely there are signs\\n\\t\\t\\tin this for those who think about it."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "22",
    "Text": "And yet others of His signs are the creation of the heavens and\\n\\t\\t\\tthe earth, and the difference of your languages and colors;\\n\\t\\t\\tsurely there are signs in this for the knowledgeable."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "23",
    "Text": "And among His signs is your sleep at night and quest for His\\n\\t\\t\\tbounty during the day; surly there are signs in this for those\\n\\t\\t\\twho pay heed."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "24",
    "Text": "And of His signs is the showing of lightning, in which there is\\n\\t\\t\\tfear as well as hope, and He sends down rainwater from the sky\\n\\t\\t\\tand with it gives life to the earth after its death; surely there\\n\\t\\t\\tare signs in this for those who use their common sense."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "25",
    "Text": "And of His signs are the firmly standing heaven and earth by His\\n\\t\\t\\tcommand; then as soon as He will summon you out of the earth, you\\n\\t\\t\\tshall come forth at one call."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "26",
    "Text": "To Him belongs everything that is in the heavens and the earth;\\n\\t\\t\\tall are obedient to Him."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "27",
    "Text": "He it is Who originates creation, then repeats it; and it is easy\\n\\t\\t\\tfor Him. To Him belongs the highest similitude in the heavens and\\n\\t\\t\\tthe earth, and He is the All-Mighty, the All-Wise."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "28",
    "Text": "We give you an example from your own lives. Do you let your\\n\\t\\t\\tslaves be equal partners in the wealth which We have given you?\\n\\t\\t\\tDo you fear them as you fear each other? Thus do We spell out Our\\n\\t\\t\\trevelations for those who use their common sense."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "29",
    "Text": "Nay! The wrongdoers are led by their own appetites, without real\\n\\t\\t\\tknowledge. So who can guide those whom Allah leaves astray? They\\n\\t\\t\\twill have no helpers."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "30",
    "Text": "Therefore, stand firm in your devotion to the upright faith - the\\n\\t\\t\\tnature made by Allah, the one on which mankind is created - and\\n\\t\\t\\tthe laws of Nature ordained by Allah cannot be changed. That is\\n\\t\\t\\tthe standard of true faith, but most among mankind do not know."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "31",
    "Text": "Turn in repentance to Him, fear Him, establish Salah (regular\\n\\t\\t\\tfive times daily prayers) and do not be of the mushrikin"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "32",
    "Text": "those who divide their religion into sects and become separate\\n\\t\\t\\tgroups, each group rejoicing in its own circle."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "33",
    "Text": "When an affliction befalls the people, they turn in prayer to\\n\\t\\t\\ttheir Rabb in repentance. But when He let them taste a blessing\\n\\t\\t\\tfrom Him, lo! Some of them start committing shirk,"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "34",
    "Text": "showing no gratitude for What We have given them. Enjoy\\n\\t\\t\\tyourselves; soon you will find out your folly."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "35",
    "Text": "Have We sent down to them an authority, that speaks of the shirk\\n\\t\\t\\twhich they are committing?"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "36",
    "Text": "When We give mankind a taste of blessing, they rejoice, but when\\n\\t\\t\\tsome evil afflicts them because of their own misdeeds, lo! They\\n\\t\\t\\tare in despair."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "37",
    "Text": "Do they not see that it is Allah Who gives abundantly to whom He\\n\\t\\t\\tpleases and sparingly to whom He wills? Surely there are signs in\\n\\t\\t\\tthis example for those who believe."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "38",
    "Text": "O believers, give what is due to your relatives, the needy and\\n\\t\\t\\tthe traveller in need. That is best for those who seek the\\n\\t\\t\\tpleasure of Allah and it is they who will attain felicity."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "39",
    "Text": "That usury which you give to increase the wealth of people, does\\n\\t\\t\\tnot increase with Allah: but the Zakah that you give to seek the\\n\\t\\t\\tpleasure of Allah, shall be repaid to you many times over."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "40",
    "Text": "It is Allah Who has created you, then provides you your daily\\n\\t\\t\\tbread, then He causes you to die, and then He will bring you back\\n\\t\\t\\tto life. Is there any of your shoraka' (associates you have set\\n\\t\\t\\tup besides Allah) who can do any of these things? Glory be to\\n\\t\\t\\tHim, and exalted be He above the shirk these people commit."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "41",
    "Text": "Mischief (war between Roman and Persian empires) has appeared in\\n\\t\\t\\tthe land and the sea in consequence of man's own misdeeds.\\n\\t\\t\\tThrough such wars Allah let people taste the fruit of their\\n\\t\\t\\tdeeds, so that they may turn back from evil."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "42",
    "Text": "O Prophet, tell them: \"Travel through the earth and see what was\\n\\t\\t\\tthe end of those who have passed away before you: most of them\\n\\t\\t\\twere mushrikin (worshipped other gods besides Allah)\"."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "43",
    "Text": "Therefore stand firm in your devotion to the true faith before\\n\\t\\t\\tthat Day arrives on which there will be no chance of averting\\n\\t\\t\\tfrom Allah. On that Day, they shall be divided in two groups."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "44",
    "Text": "Those who disbelieved will bear the burden of their disbelief,\\n\\t\\t\\tand those who have done good deeds will be made ready for their\\n\\t\\t\\thome in paradise,"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "45",
    "Text": "so that He may, out of His mercy, reward those who have believed\\n\\t\\t\\tand done good deeds. Surely He does not like the disbelievers."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "46",
    "Text": "Of His signs is that He sends the winds as bearers of good news,\\n\\t\\t\\tand that He may let you taste His blessing, and your ships may\\n\\t\\t\\tsail by His command, and that you may seek of His bounty, and\\n\\t\\t\\tthat you may be grateful."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "47",
    "Text": "We sent before you Rasools to their respective people, and they\\n\\t\\t\\tbrought them clear signs. Some rejected them while others\\n\\t\\t\\tbelieved, then We subjected the guilty ones to Our retribution\\n\\t\\t\\tand We aided the believers - it is due on Us to help the\\n\\t\\t\\tBelievers."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "48",
    "Text": "It is Allah Who sends the winds to raise the clouds, then He\\n\\t\\t\\tspreads them in the sky and breaks them into fragments as He\\n\\t\\t\\tpleases, then you see raindrops falling from their midst. When He\\n\\t\\t\\tshowers this rain upon those of His servants whom He pleases, lo!\\n\\t\\t\\tThey are filled with joy,"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "49",
    "Text": "though before its coming they may have lost all hope."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "50",
    "Text": "Just look at the traces of Allah's Mercy! How He gives life to\\n\\t\\t\\tthe earth after its death. Surely the same way He will give life\\n\\t\\t\\tto the dead; for He has power over all things."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "51",
    "Text": "And if We send a wind which turns their crops yellow, behold they\\n\\t\\t\\twill become even more firm in their disbelief."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "52",
    "Text": "O Prophet, you cannot make the dead hear you, nor can you make\\n\\t\\t\\tthe deaf hear your call especially when they have turned their\\n\\t\\t\\tbacks and are running away;"
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "53",
    "Text": "nor can you guide the blind out of their error. None will hear\\n\\t\\t\\tyou save those who believe in Our revelations and submit\\n\\t\\t\\tthemselves as Muslims."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "54",
    "Text": "It is Allah Who has created you in a state of helplessness as a\\n\\t\\t\\tbaby, then gave you strength to come out of helplessness in\\n\\t\\t\\tyouth, then after strength again helplessness and grey hair in\\n\\t\\t\\told age. He creates whatever He wills and it is He Who is the\\n\\t\\t\\tAll-knowing, the Almighty."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "55",
    "Text": "On the Day when the Hour of Judgement will be established, the\\n\\t\\t\\tcriminals will swear that they did not stay in this world more\\n\\t\\t\\tthan an hour; thus are they ever deluded."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "56",
    "Text": "But those who are given knowledge and faith will say: \"In fact\\n\\t\\t\\tyou have stayed, according to the Book of Allah, till the Day of\\n\\t\\t\\tResurrection and this is the Day of Resurrection: but you were\\n\\t\\t\\tnot aware.\""
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "57",
    "Text": "On that Day, no excuse of theirs will avail the wrongdoers, nor\\n\\t\\t\\twill they be allowed to seek forgiveness."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "58",
    "Text": "The fact is that We have set forth every kind of example for men\\n\\t\\t\\tin this Qur'an, but whatever sign you may bring, the unbelievers\\n\\t\\t\\tare sure to say: \"You are preaching falsehood.\""
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "59",
    "Text": "Thus Allah set a seal on the hearts of those who do not use their\\n\\t\\t\\tcommon sense."
  },
  {
    "SurahNumber": "30",
    "AyahNumber": "60",
    "Text": "So O Prophet, have patience: surely the promise of Allah is true;\\n\\t\\t\\tand do not let those, who themselves have no certainty of faith,\\n\\t\\t\\tshake your firmness."
  }
]
