[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/048001",
        "Body":  "Lo! We have given thee (O Muhammad) a signal victory,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/048010",
        "Body":  "Lo! those who swear allegiance unto thee (Muhammad), swear\n\t\t\tallegiance only unto Allah. The Hand of Allah is above their\n\t\t\thands. So whosoever breaketh his oath, breaketh it only to his\n\t\t\tsoul\u0027s hurt; while whosoever keepeth his covenant with Allah, on\n\t\t\thim will He bestow immense reward."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/048011",
        "Body":  "Those of the wandering Arabs who were left behind will tell thee:\n\t\t\tOur possessions and our households occupied us, so ask\n\t\t\tforgiveness for us! They speak with their tongues that which is\n\t\t\tnot in their hearts. Say: Who can avail you aught against Allah,\n\t\t\tif he intend you hurt or intend you profit? Nay, but Allah is\n\t\t\tever Aware of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/048012",
        "Body":  "Nay, but ye deemed that the messenger and the believers would\n\t\t\tnever return to their own folk, and that was made fair seeming in\n\t\t\tyour hearts, and ye did think an evil thought, and ye were\n\t\t\tworthless folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/048013",
        "Body":  "And as for him who believeth not in Allah and His messenger Lo!\n\t\t\tWe have prepared a flame for disbelievers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/048014",
        "Body":  "And Allah\u0027s is the Sovereignty of the heavens and the earth. He\n\t\t\tforgiveth whom He will, and punisheth whom He will. And Allah is\n\t\t\tever Forgiving, Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/048015",
        "Body":  "Those who were left behind will say, when ye set forth to capture\n\t\t\tbooty: Let us go with you. They fain would change the verdict of\n\t\t\tAllah. Say (unto them, O Muhammad): Ye shall not go with us. Thus\n\t\t\thath Allah said beforehand. Then they will say: Ye are envious of\n\t\t\tus. Nay, but they understand not, save a little."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/048016",
        "Body":  "Say unto those of the wandering Arabs who were left behind: Ye\n\t\t\twill be called against a folk of mighty prowess, to fight them\n\t\t\tuntil they surrender; and if ye obey, Allah will give you a fair\n\t\t\treward; but if ye turn away as ye did turn away before, He will\n\t\t\tpunish you with a painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/048017",
        "Body":  "There is no blame for the blind, nor is there blame for the lame,\n\t\t\tnor is there blame for the sick (that they go not forth to war).\n\t\t\tAnd whoso obeyeth Allah and His messenger, He will make him enter\n\t\t\tGardens underneath which rivers flow; and whoso turneth back, him\n\t\t\twill He punish with a painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/048018",
        "Body":  "Allah was well pleased with the believers when they swore\n\t\t\tallegiance unto thee beneath the tree, and He knew what was in\n\t\t\ttheir hearts, and He sent down peace of reassurance on them, and\n\t\t\thath rewarded them with a near victory;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/048019",
        "Body":  "And much booty that they will capture. Allah is ever Mighty,\n\t\t\tWise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/048002",
        "Body":  "That Allah may forgive thee of thy sin that which is past and\n\t\t\tthat which is to come, and may perfect His favor unto thee, and\n\t\t\tmay guide thee on a right path,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/048020",
        "Body":  "Allah promiseth you much booty that ye will capture, and hath\n\t\t\tgiven you this in advance, and hath withheld men\u0027s hands from\n\t\t\tyou, that it may be a token for the believers, and that He may\n\t\t\tguide you on a right path."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/048021",
        "Body":  "And other (gain), which ye have not been able to achieve, Allah\n\t\t\twill compass it. Allah is Able to do all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/048022",
        "Body":  "And if those who disbelieve join battle with you they will take\n\t\t\tto flight, and afterward they will find no protecting friend nor\n\t\t\thelper."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/048023",
        "Body":  "It is the law of Allah which hath taken course aforetime. Thou\n\t\t\twilt not find for the law of Allah aught of power to change."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/048024",
        "Body":  "And He it is Who hat withheld men\u0027s hands from you, and hath\n\t\t\twithheld your hands from them, in the valley of Mecca, after He\n\t\t\thad made you victors over them. Allah is Seer of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/048025",
        "Body":  "These it was who disbelieved and debarred you from the Inviolable\n\t\t\tPlace of Worship, and debarred the offering from reaching its\n\t\t\tgoal. And if it had not been for believing men and believing\n\t\t\twomen, whom ye know not--lest ye should tread them under foot and\n\t\t\tthus incur guilt for them unknowingly; that Allah might bring\n\t\t\tinto His mercy whom He will--If (the believers and the\n\t\t\tdisbelievers) had been clearly separated We verily had punished\n\t\t\tthose of them who disbelieved with painful punishment."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/048026",
        "Body":  "When those who disbelieve had set up in their hearts zealotry,\n\t\t\tthe zealotry of the Age of Ignorance, then Allah sent down His\n\t\t\tpeace of reassurance upon His messenger and upon the believers\n\t\t\tand imposed on them the word of self restraint, for they were\n\t\t\tworthy of it and meet for it. And Allah is Aware of all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/048027",
        "Body":  "Allah hath fulfilled the vision for His messenger in very truth.\n\t\t\tYe shall indeed enter the Inviolable Place of Worship, if Allah\n\t\t\twill, secure, (having your hair) shaven and cut, not fearing. But\n\t\t\tHe knoweth that which ye know not, and hath given you a near\n\t\t\tvictory beforehand."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/048028",
        "Body":  "He it is Who hath sent His messenger with the guidance and the\n\t\t\treligion of truth, that He may cause it to prevail over all\n\t\t\treligion. And Allah sufficeth as a witness."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/048029",
        "Body":  "Muhammad is the messenger of Allah. And those with him are hard\n\t\t\tagainst the disbelievers and merciful among themselves. Thou (O\n\t\t\tMuhammad) seest them bowing and falling prostrate (in worship),\n\t\t\tseeking bounty from Allah and (His) acceptance. The mark of them\n\t\t\tis on their foreheads from the traces of prostration. Such is\n\t\t\ttheir likeness in the Torah and their likeness in the Gospel like\n\t\t\tas sown corn that sendeth forth its shoot and strengtheneth it\n\t\t\tand riseth firm upon its stalk, delighting the sowers that He may\n\t\t\tenrage the disbelievers with (the sight of) them. Allah hath\n\t\t\tpromised, unto such of them as believe and do good works,\n\t\t\tforgiveness and immense reward."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/048003",
        "Body":  "And that Allah may help thee with strong help--"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/048004",
        "Body":  "He it is Who sent down peace of reassurance into the hearts of\n\t\t\tthe believers that they might add faith unto their faith. Allah\u0027s\n\t\t\tare the hosts of the heavens and the earth, and Allah is ever\n\t\t\tKnower, Wise--"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/048005",
        "Body":  "That He may bring the believing men and the believing women into\n\t\t\tGardens underneath which rivers flow, wherein they will abide,\n\t\t\tand may remit from them their evil deeds.--That, in the sight of\n\t\t\tAllah, is the supreme triumph--"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/048006",
        "Body":  "And may punish the hypocritical men and the hypocritical women,\n\t\t\tand the idolatrous men and the idolatrous women, who think an\n\t\t\tevil thought concerning Allah. For them is the evil turn of\n\t\t\tfortune, and Allah is wroth against them and hath cursed them,\n\t\t\tand hath made ready for them hell, a hapless journey\u0027s end."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/048007",
        "Body":  "Allah\u0027s are the hosts of the heavens and the earth, and Allah is\n\t\t\tever Mighty, Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/048008",
        "Body":  "Lo! We have sent thee (O Muhammad) as a witness and a bearer of\n\t\t\tgood tidings and a warner,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "48",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/048009",
        "Body":  "That ye (mankind) may believe in Allah and His messenger, and may\n\t\t\thonor Him, and may revere Him, and may glorify Him at early dawn\n\t\t\tand at the close of day."
    }
]
