[
  {
    "SurahNumber": "93",
    "AyahNumber": "1",
    "NoteID": "6175",
    "Body": "The full morning light of the sun, when his splendour\\n\\t\\t\\t\\tshines forth in contrast with the night which has passed.\\n\\t\\t\\t\\tCf. xci. 1. The growing hours of morning light, from\\n\\t\\t\\t\\tsunrise to noon, are the true type of the growth of\\n\\t\\t\\t\\tspiritual life and work, while the stillness of the night\\n\\t\\t\\t\\tis, to those who know, only a preparation for it. We are\\n\\t\\t\\t\\tnot to imagine that the stillness or quiescence of the\\n\\t\\t\\t\\tnight is wasted, or means stagnation in our spiritual\\n\\t\\t\\t\\tlife. The stillness may seem lonely, but we are not\\n\\t\\t\\t\\talone, nor forsaken by Allah. Nor is such preparation,\\n\\t\\t\\t\\twithout immediate visible results, a sign of Allah's\\n\\t\\t\\t\\tdispleasure."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "2",
    "NoteID": "6176",
    "Body": "Cf. xcii. 1-2. There Night is mentioned first, and Day\\n\\t\\t\\t\\tsecond, to enforce the lesson of contrasts: the veil of\\n\\t\\t\\t\\tthe night naturally comes first before the splendour of\\n\\t\\t\\t\\tdaylight is revealed. Here the argument is different: the\\n\\t\\t\\t\\tgrowing hours of morning light are the main things and\\n\\t\\t\\t\\tare mentioned first; while the hours of preparation and\\n\\t\\t\\t\\tquiescence, which are subordinate, come second."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "3",
    "NoteID": "6177",
    "Body": "As usual, there is the particular assurance to the Holy\\n\\t\\t\\t\\tProphet, and the general asssurance to mankind: see the\\n\\t\\t\\t\\tIntroduction to this Sura. The early years of the\\n\\t\\t\\t\\tProphet's ministry might well have seemed blank. After\\n\\t\\t\\t\\tinspiration there were days and periods of waiting. A\\n\\t\\t\\t\\tsense of loneliness might well have weighed on his mind.\\n\\t\\t\\t\\tHis own tribe of the Quraish jeered at him, taunted and\\n\\t\\t\\t\\tthreatened him, and slandered and persecuted him as well\\n\\t\\t\\t\\tas those who believe in him. But his faith was never\\n\\t\\t\\t\\tshaken, not even to the extent of that cry of agony of\\n\\t\\t\\t\\tJesus: \"My God! why hast Thou forsaken me?\": (Mark, xvi.\\n\\t\\t\\t\\t34). Much less did it enter the Prophet's mind to think\\n\\t\\t\\t\\tthat Allah was angry with him, as the taunts of his\\n\\t\\t\\t\\tenemies suggested."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "3",
    "NoteID": "6178",
    "Body": "See last note. The more general meaning is similar. To\\n\\t\\t\\t\\tthe man who prepares for spiritual work and spiritual\\n\\t\\t\\t\\tgrowth the chief thing is typified by the growing hours\\n\\t\\t\\t\\tof the morning. He should not be discouraged, nor\\n\\t\\t\\t\\tovercome with a sense of loneliness in his early\\n\\t\\t\\t\\tstruggles or difficulties. The end will crown his work.\\n\\t\\t\\t\\tAllah's care is always around him. If unsympathetic or\\n\\t\\t\\t\\thostile critics laugh at him or taunt him with being,\\n\\t\\t\\t\\t\"mad\" or \"old-fashioned\" or \"ploughing his lonely\\n\\t\\t\\t\\tfurrow\", his steady faith will uphold him. He will never\\n\\t\\t\\t\\tbelieve that his earnest and sincere devotion to Allah,\\n\\t\\t\\t\\twhatever be its results in this world, can be anything\\n\\t\\t\\t\\tbut pleasing to Allah."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "4",
    "NoteID": "6179",
    "Body": "To the truly devout man, each succeeding moment is better\\n\\t\\t\\t\\tthan the one preceding it. In this sense the \"hereafter\"\\n\\t\\t\\t\\trefers not only to the Future Life after death, but also\\n\\t\\t\\t\\tto \"the soul of goodness in things\" in this very life.\\n\\t\\t\\t\\tFor even though some outward trappings of this\\n\\t\\t\\t\\tshadow-world may be wanting, his soul is filled with more\\n\\t\\t\\t\\tand more satisfaction as he goes on."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "5",
    "NoteID": "6180",
    "Body": "Allah's good pleasure is sure when we serve Him. But we\\n\\t\\t\\t\\tare assured that even our feelings of doubt and suffering\\n\\t\\t\\t\\twill vanish, and we shall have a sense of complete\\n\\t\\t\\t\\tsatisfaction, contentment, and active pleasure when our\\n\\t\\t\\t\\twill is identified with the Will of Allah."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "6",
    "NoteID": "6181",
    "Body": "Judge the future from the past. Allah has been good to\\n\\t\\t\\t\\tyou in your past experience: trust to His goodness in the\\n\\t\\t\\t\\tfuture also. Again, there is a particular and a general\\n\\t\\t\\t\\tmeaning. Three facts are taken from the holy Prophet's\\n\\t\\t\\t\\touter life by way of illustration. Metaphorically they\\n\\t\\t\\t\\talso apply to us. And further, the outer facts are\\n\\t\\t\\t\\tthemselves types for the spiritual life. See notes below."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "6",
    "NoteID": "6182",
    "Body": "(1) There is the case of the orphan, literally and\\n\\t\\t\\t\\tfiguratively. Our holy Prophet was himself an orphan. His\\n\\t\\t\\t\\tfather Abdullah died young before the child was born,\\n\\t\\t\\t\\tleaving a little property. The Prophet's mother Amina was\\n\\t\\t\\t\\tin ailing health, and he was chiefly brought up by his\\n\\t\\t\\t\\tnurse Halima. His mother herself died when he was only\\n\\t\\t\\t\\tsix years old. His aged grandfather Abdul Muttalib\\n\\t\\t\\t\\ttreated him as his own son, but died two years later.\\n\\t\\t\\t\\tTherefore his uncle Abu Talib treated him as his own son.\\n\\t\\t\\t\\tHe was thus an orphan in more senses than one, and yet\\n\\t\\t\\t\\tthe love he received from each one of these persons was\\n\\t\\t\\t\\tgreater than ordinary parental love."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "7",
    "NoteID": "6183",
    "Body": "(2) The holy Prophet was born in the midst of the\\n\\t\\t\\t\\tidolatry and polytheism of Makkah, in a family which was\\n\\t\\t\\t\\tthe custodian of this false worship. He wandered in quest\\n\\t\\t\\t\\tof Unity and found it by the guidance of Allah. There is\\n\\t\\t\\t\\tno implication whatever of sin or error on his part. But\\n\\t\\t\\t\\twe may err and find ourselves wandering in mazes of\\n\\t\\t\\t\\terror, in thought, motive, or understanding: we must pray\\n\\t\\t\\t\\tfor Allah's grace ever to give us guidance. The Arabic\\n\\t\\t\\t\\troot dhalla has various shades of meaning. In i. 7, I\\n\\t\\t\\t\\thave translated it by the verb \"stray\". In liii. 2 the\\n\\t\\t\\t\\tProphet is defended from the charge of being \"astray\" or\\n\\t\\t\\t\\tstraying in mind. In xii. 9 and xii. 95 Jacob's sons use\\n\\t\\t\\t\\tthe word for their aged father, to suggest that he was\\n\\t\\t\\t\\tsenile and wandering in mind. In xxxii. 10 it is used of\\n\\t\\t\\t\\tthe dead, and I have translated \"hidden and lost\" (in the\\n\\t\\t\\t\\tearth)."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "8",
    "NoteID": "6184",
    "Body": "(3) The holy Prophet inherited not much wealth and was\\n\\t\\t\\t\\tpoor. The true, pure, and sincere love of Khadija not\\n\\t\\t\\t\\tonly raised him above want, but made him independent of\\n\\t\\t\\t\\tworldly needs in his later life, enabling him to devote\\n\\t\\t\\t\\this whole time to the service of Allah. So do we all find\\n\\t\\t\\t\\tourselves in some want or another, which, if we work\\n\\t\\t\\t\\twhole-heartedly and sincerely is supplied to us by the\\n\\t\\t\\t\\tgrace of Allah. When we have found the Way, it is a\\n\\t\\t\\t\\tlaborious task to climb up in our poverty of spiritual\\n\\t\\t\\t\\tequipment: Allah will give us spiritual riches in love\\n\\t\\t\\t\\tand knowledge."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "9",
    "NoteID": "6185",
    "Body": "Verses 9-11 carry on, to a step further, the triple\\n\\t\\t\\t\\targument of verses 6-8, as explained in the preceding\\n\\t\\t\\t\\tnotes. The Prophet treated all orphans with tender\\n\\t\\t\\t\\taffection and respect, setting an example to his\\n\\t\\t\\t\\tcontemporaries, who frequently took advantage of the\\n\\t\\t\\t\\thelpless position of orphans, and in any case looked upon\\n\\t\\t\\t\\tthem as subordinate creatures to be repressed and kept in\\n\\t\\t\\t\\ttheir place. Such an attitude is common in all ages.\\n\\t\\t\\t\\tHelpless creatures ought, on the contrary, to be treated\\n\\t\\t\\t\\tas sacred trusts, whether they are orphans, or\\n\\t\\t\\t\\tdependants, or creatures of any kind unable to assert\\n\\t\\t\\t\\tthemselves, either through age, sex, social rank,\\n\\t\\t\\t\\tartificial conditions, or any cause whatever."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "10",
    "NoteID": "6186",
    "Body": "Then there are the people who come with petitions,-who\\n\\t\\t\\t\\thave to ask for something. They may be genuine beggars\\n\\t\\t\\t\\tasking for financial help, or ignorant people asking for\\n\\t\\t\\t\\tknowledge, or timid people asking for some lead or\\n\\t\\t\\t\\tencouragement. The common attitude is to scorn them or\\n\\t\\t\\t\\trepulse them. The scorn may be shown even when alms or\\n\\t\\t\\t\\tassistance is given to them. Such an attitude is wrong.\\n\\t\\t\\t\\tCharity is of no moral value without sympathy and love.\\n\\t\\t\\t\\tNor is it charity to give to idle sturdy professional\\n\\t\\t\\t\\tbeggars, for show or to get rid of them. They are mere\\n\\t\\t\\t\\tparasites on society. Every petition should be examined\\n\\t\\t\\t\\tand judged on its merits."
  },
  {
    "SurahNumber": "93",
    "AyahNumber": "11",
    "NoteID": "6187",
    "Body": "Besides the petitioners, who ask for help, there is the\\n\\t\\t\\t\\tcase of those who do not ask but are nevertheless\\n\\t\\t\\t\\tpoor-poor but contented in worldly goods, or poor in\\n\\t\\t\\t\\tknowledge or resources and not even knowing that they are\\n\\t\\t\\t\\tpoor. If you are bountifully endowed by Allah, your duty\\n\\t\\t\\t\\tis to make that Bounty spread far and wide. Proclaim it\\n\\t\\t\\t\\tand share it, as the holy Prophet always did. We all\\n\\t\\t\\t\\treceive Allah's grace and guidance in some degree or\\n\\t\\t\\t\\tother. We all owe it as a duty to our fellow-men to be\\n\\t\\t\\t\\tkind and helpful to those less endowed in any respect\\n\\t\\t\\t\\tthan ourselves."
  }
]
