[
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "1",
    "Text": "Alif-L&atilde;m-M&#297;m-&#7778;&atilde;d."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "2",
    "Text": "&#761;This is&#762; a Book sent down to you &#761;O Prophet&#762;&mdash;do not let anxiety into your heart regarding it&mdash;so with it you may warn &#761;the disbelievers&#762;, and as a reminder to the believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "3",
    "Text": "Follow what has been sent down to you from your Lord, and do not take others as guardians besides Him. How seldom are you mindful!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "4",
    "Text": "&#761;Imagine&#762; how many societies We have destroyed! Our torment took them by surprise &#761;while sleeping&#762; at night or midday."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "5",
    "Text": "Their only cry&mdash;when overwhelmed by Our torment&mdash;was, &ldquo;We have indeed been wrongdoers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "6",
    "Text": "We will surely question those who received messengers and We will question the messengers &#761;themselves&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "7",
    "Text": "Then We will give them a full account with sure knowledge&mdash;for We were never absent."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "8",
    "Text": "The weighing on that Day will be just. As for those whose scale will be heavy &#761;with good deeds&#762;, &#761;only&#762; they will be successful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "9",
    "Text": "But those whose scale is light, they have doomed themselves for wrongfully denying Our signs."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "10",
    "Text": "We have indeed established you on earth and provided you with a means of livelihood. &#761;Yet&#762; you seldom give any thanks."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "11",
    "Text": "Surely We created you,<span class='fn' foot_note=29120>1</span>&nbsp;then shaped you, then said to the angels, &ldquo;Prostrate before Adam,&rdquo; so they all did&mdash;but not Ibl&icirc;s,<span class='fn' foot_note=29121>2</span>&nbsp;who refused to prostrate with the others."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "12",
    "Text": "Allah asked, &ldquo;What prevented you from prostrating when I commanded you?&rdquo; He replied, &ldquo;I am better than he is: You created me from fire and him from clay.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "13",
    "Text": "Allah said, &ldquo;Then get down from Paradise! It is not for you to be arrogant here. So get out! You are truly one of the disgraced.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "14",
    "Text": "He appealed, &ldquo;Then delay my end until the Day of their resurrection.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "15",
    "Text": "Allah said, &ldquo;You are delayed &#761;until the appointed Day&#762;.&rdquo;<span class='fn' foot_note=29122>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "16",
    "Text": "He said, &ldquo;For leaving me to stray I will lie in ambush for them on Your Straight Path."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "17",
    "Text": "I will approach them from their front, their back, their right, their left, and then You will find most of them ungrateful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "18",
    "Text": "Allah said, &ldquo;Get out of Paradise! You are disgraced and rejected! I will certainly fill up Hell with you and your followers all together.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "19",
    "Text": "&#761;Allah said,&#762; &ldquo;O Adam! Live with your wife in Paradise and eat from wherever you please, but do not approach this tree, or else you will be wrongdoers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "20",
    "Text": "Then Satan tempted them in order to expose what was hidden of their nakedness. He said, &ldquo;Your Lord has forbidden this tree to you only to prevent you from becoming angels or immortals.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "21",
    "Text": "And he swore to them, &ldquo;I am truly your sincere advisor.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "22",
    "Text": "So he brought about their fall through deception. And when they tasted of the tree, their nakedness was exposed to them, prompting them to cover themselves with leaves from Paradise. Then their Lord called out to them, &ldquo;Did I not forbid you from that tree and &#761;did I not&#762; tell you that Satan is your sworn enemy?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "23",
    "Text": "They replied, &ldquo;Our Lord! We have wronged ourselves. If You do not forgive us and have mercy on us, we will certainly be losers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "24",
    "Text": "Allah said, &ldquo;Descend as enemies to each other.<span class='fn' foot_note=29123>1</span>&nbsp;You will find in the earth a residence and provision for your appointed stay.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "25",
    "Text": "He added, &ldquo;There you will live, there you will die, and from there you will be resurrected.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "26",
    "Text": "O children of Adam! We have provided for you clothing to cover your nakedness and as an adornment. However, the best clothing is righteousness. This is one of Allah&rsquo;s bounties, so perhaps you will be mindful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "27",
    "Text": "O children of Adam! Do not let Satan deceive you as he tempted your parents out of Paradise and caused their cover to be removed in order to expose their nakedness. Surely he and his soldiers watch you from where you cannot see them. We have made the devils allies of those who disbelieve."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "28",
    "Text": "Whenever they commit a shameful deed,<span class='fn' foot_note=29124>1</span>&nbsp;they say, &ldquo;We found our forefathers doing it and Allah has commanded us to do it.&rdquo; Say, &ldquo;No! Allah never commands what is shameful. How can you attribute to Allah what you do not know?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "29",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;My Lord has commanded uprightness and dedication &#761;to Him alone&#762; in worship, calling upon Him with sincere devotion. Just as He first brought you into being, you will be brought to life again.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "30",
    "Text": "He has guided some, while others are destined to stray. They have taken devils as their masters instead of Allah&mdash;thinking they are &#761;rightly&#762; guided."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "31",
    "Text": "O Children of Adam! Dress properly whenever you are at worship. Eat and drink, but do not waste. Surely He does not like the wasteful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "32",
    "Text": "Ask, &#761;O Prophet,&#762; &ldquo;Who has forbidden the adornments and lawful provisions Allah has brought forth for His servants?&rdquo; Say, &ldquo;They are for the enjoyment of the believers in this worldly life, but they will be exclusively theirs on the Day of Judgment.<span class='fn' foot_note=29125>1</span>&nbsp;This is how We make Our revelations clear for people of knowledge.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "33",
    "Text": "Say, &ldquo;My Lord has only forbidden open and secret indecencies, sinfulness, unjust aggression, associating &#761;others&#762; with Allah &#761;in worship&#762;&mdash;a practice He has never authorized&mdash;and attributing to Allah what you do not know.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "34",
    "Text": "For each community there is an appointed term. When their time arrives, they can neither delay it for a moment, nor could they advance it."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "35",
    "Text": "O children of Adam! When messengers from among yourselves come to you reciting My revelations&mdash;whoever shuns evil and mends their ways, there will be no fear for them, nor will they grieve."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "36",
    "Text": "But those who receive Our revelations with denial and arrogance will be the residents of the Fire. They will be there forever."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "37",
    "Text": "Who does more wrong than those who fabricate lies against Allah or deny His revelations? They will receive what is destined for them,<span class='fn' foot_note=29126>1</span>&nbsp;until Our messenger-angels arrive to take their souls, asking them, &ldquo;Where are those &#761;false gods&#762; you used to invoke besides Allah?&rdquo; They will cry, &ldquo;They have failed us,&rdquo; and they will confess against themselves that they were indeed disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "38",
    "Text": "Allah will say, &ldquo;Enter the Fire along with the &#761;evil&#762; groups of jinn and humans that preceded you.&rdquo; Whenever a group enters Hell, it will curse the preceding one until they are all gathered inside, the followers will say about their leaders, &ldquo;Our Lord! They have misled us, so multiply their torment in the Fire.&rdquo; He will answer, &ldquo;It has already been multiplied for all, but you do not know.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "39",
    "Text": "Then the leaders will say to their followers, &ldquo;You were no better than us! So taste the torment for what you used to commit.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "40",
    "Text": "Surely those who receive our revelations with denial and arrogance, the gates of heaven will not be opened for them, nor will they enter Paradise until a camel passes through the eye of a needle. This is how We reward the wicked."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "41",
    "Text": "Hell will be their bed; flames will be their cover. This is how We reward the wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "42",
    "Text": "As for those who believe and do good&mdash;We never require of any soul more than what it can afford&mdash;it is they who will be the residents of Paradise. They will be there forever."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "43",
    "Text": "We will remove whatever bitterness they had in their hearts.<span class='fn' foot_note=29127>1</span>&nbsp;Rivers will flow under their feet. And they will say, &ldquo;Praise be to Allah for guiding us to this. We would have never been guided if Allah had not guided us. The messengers of our Lord had certainly come with the truth.&rdquo; It will be announced to them, &ldquo;This is Paradise awarded to you for what you used to do.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "44",
    "Text": "The residents of Paradise will call out to the residents of the Fire, &ldquo;We have certainly found our Lord&rsquo;s promise to be true. Have you too found your Lord&rsquo;s promise to be true?&rdquo; They will reply, &ldquo;Yes, we have!&rdquo; Then a caller will announce to both, &ldquo;May Allah&rsquo;s condemnation be upon the wrongdoers,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "45",
    "Text": "those who hindered &#761;others&#762; from Allah&rsquo;s Way, strived to make it &#761;appear&#762; crooked, and disbelieved in the Hereafter.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "46",
    "Text": "There will be a barrier between Paradise and Hell. And on the heights &#761;of that barrier&#762; will be people<span class='fn' foot_note=29128>1</span>&nbsp;who will recognize &#761;the residents of&#762; both by their appearance.<span class='fn' foot_note=29129>2</span>&nbsp;They will call out to the residents of Paradise, &ldquo;Peace be upon you!&rdquo; They will have not yet entered Paradise, but eagerly hope to."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "47",
    "Text": "When their eyes will turn towards the residents of Hell, they will pray, &ldquo;Our Lord! Do not join us with the wrongdoing people.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "48",
    "Text": "Those on the heights will call out to some &#761;tyrants in the Fire&#762;, who they will recognize by their appearance, saying, &ldquo;Your large numbers and arrogance are of no use &#761;today&#762;!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "49",
    "Text": "Are these &#761;humble believers&#762; the ones you swore would never be shown Allah&rsquo;s mercy?&rdquo; &#761;Finally, those on the heights will be told:&#762; &ldquo;Enter Paradise! There will be no fear for you, nor will you grieve.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "50",
    "Text": "The residents of the Fire will then cry out to the residents of Paradise, &ldquo;Aid us with some water or any provision Allah has granted you.&rdquo; They will reply, &ldquo;Allah has forbidden both to the disbelievers,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "51",
    "Text": "those who took this<span class='fn' foot_note=29130>1</span>&nbsp;faith &#761;of Islam&#762; as mere amusement and play and were deluded by &#761;their&#762; worldly life.&rdquo; &#761;Allah will say,&#762; &ldquo;Today We will ignore them just as they ignored the coming of this Day of theirs and for rejecting Our revelations.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "52",
    "Text": "We have certainly brought them a Book which We explained with knowledge&mdash;a guide and mercy for those who believe."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "53",
    "Text": "Do they only await the fulfilment &#761;of its warning&#762;? The Day it will be fulfilled, those who ignored it before will say, &ldquo;The messengers of our Lord certainly came with the truth. Are there any intercessors who can plead on our behalf? Or can we be sent back so we may do &#761;good,&#762; unlike what we used to do?&rdquo; They will have certainly ruined themselves, and whatever &#761;gods&#762; they fabricated will fail them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "54",
    "Text": "Indeed your Lord is Allah Who created the heavens and the earth in six Days,<span class='fn' foot_note=29131>1</span>&nbsp;then established Himself on the Throne. He makes the day and night overlap in rapid succession. He created the sun, the moon, and the stars&mdash;all subjected by His command. The creation and the command belong to Him &#761;alone&#762;. Blessed is Allah&mdash;Lord of all worlds!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "55",
    "Text": "Call upon your Lord humbly and secretly. Surely He does not like the transgressors."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "56",
    "Text": "Do not spread corruption in the land after it has been set in order. And call upon Him with hope and fear. Indeed, Allah&rsquo;s mercy is always close to the good-doers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "57",
    "Text": "He is the One Who sends the winds ushering in His mercy. When they bear heavy clouds, We drive them to a lifeless land and then cause rain to fall, producing every type of fruit. Similarly, We will bring the dead to life, so perhaps you will be mindful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "58",
    "Text": "The fertile land produces abundantly by the Will of its Lord, whereas the infertile land hardly produces anything. This is how We vary &#761;Our&#762; lessons to those who are thankful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "59",
    "Text": "Indeed, We sent Noah to his people. He said, &ldquo;O my people! Worship Allah&mdash;you have no other god except Him. I truly fear for you the torment of a tremendous Day.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "60",
    "Text": "But the chiefs of his people said, &ldquo;We surely see that you are clearly misguided.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "61",
    "Text": "He replied, &ldquo;O my people! I am not misguided! But I am a messenger from the Lord of all worlds,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "62",
    "Text": "conveying to you my Lord&rsquo;s messages and giving you &#761;sincere&#762; advice. And I know from Allah what you do not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "63",
    "Text": "Do you find it astonishing that a reminder should come to you from your Lord through one of your own, warning you, so you may beware and perhaps be shown mercy?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "64",
    "Text": "But they rejected him, so We saved him and those with him in the Ark, and drowned those who rejected Our signs. They were certainly a blind people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "65",
    "Text": "And to the people of &rsquo;&Acirc;d We sent their brother H&ucirc;d. He said, &ldquo;O my people! Worship Allah&mdash;you have no other god except Him. Will you not then fear Him?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "66",
    "Text": "The disbelieving chiefs of his people responded, &ldquo;We surely see you as a fool, and we certainly think you are a liar.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "67",
    "Text": "H&ucirc;d replied, &ldquo;O my people! I am no fool! But I am a messenger from the Lord of all worlds,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "68",
    "Text": "conveying to you my Lord&rsquo;s messages. And I am your sincere advisor."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "69",
    "Text": "Do you find it astonishing that a reminder should come to you from your Lord through one of your own so he may warn you? Remember that He made you successors after the people of Noah and increased you greatly in stature. So remember Allah&rsquo;s favours, so you may be successful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "70",
    "Text": "They said, &ldquo;Have you come to us so that we would worship Allah alone and abandon what our forefathers used to worship? Then bring us what you threaten us with, if what you say is true!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "71",
    "Text": "He said, &ldquo;You will certainly be subjected to your Lord&rsquo;s torment and wrath. Do you dispute with me regarding the so-called gods which you and your forefathers have made up&mdash;a practice Allah has never authorized? Then wait! I too am waiting with you.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "72",
    "Text": "So We saved him and those with him by Our mercy and uprooted those who denied Our signs. They were not believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "73",
    "Text": "And to the people of Tham&ucirc;d We sent their brother &#7778;&acirc;li&#7717;. He said, &ldquo;O my people! Worship Allah&mdash;you have no other god except Him. A clear proof has come to you from your Lord: this is Allah&rsquo;s she-camel as a sign to you. So leave her to graze &#761;freely&#762; on Allah&rsquo;s land and do not harm her, or else you will be overcome by a painful punishment."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "74",
    "Text": "Remember when He made you successors after &rsquo;&Acirc;d and established you in the land&mdash;&#761;and&#762; you built palaces on its plains and carved homes into mountains. So remember Allah&rsquo;s favours, and do not go about spreading corruption in the land.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "75",
    "Text": "The arrogant chiefs of his people asked the lowly who believed among them, &ldquo;Are you certain that &#7778;&acirc;li&#7717; has been sent by his Lord?&rdquo; They replied, &ldquo;We certainly believe in what he has been sent with.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "76",
    "Text": "The arrogant said, &ldquo;We surely reject what you believe in.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "77",
    "Text": "Then they killed the she-camel&mdash;defying their Lord&rsquo;s command&mdash;and challenged &#761;&#7778;&acirc;li&#7717;&#762;, &ldquo;Bring us what you threaten us with, if you are &#761;truly&#762; one of the messengers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "78",
    "Text": "Then an &#761;overwhelming&#762; earthquake struck them, and they fell lifeless in their homes."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "79",
    "Text": "So he turned away from them, saying, &ldquo;O my people! Surely I conveyed to you my Lord&rsquo;s message and gave you &#761;sincere&#762; advice, but you do not like &#761;sincere&#762; advisors.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "80",
    "Text": "And &#761;remember&#762; when Lot scolded &#761;the men of&#762; his people, &#761;saying,&#762; &ldquo;Do you commit a shameful deed that no man has ever done before?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "81",
    "Text": "You lust after men instead of women! You are certainly transgressors.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "82",
    "Text": "But his people&rsquo;s only response was to say, &ldquo;Expel them from your land! They are a people who wish to remain chaste!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "83",
    "Text": "So We saved him and his family except his wife, who was one of the doomed."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "84",
    "Text": "We poured upon them a rain &#761;of brimstone&#762;. See what was the end of the wicked!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "85",
    "Text": "And to the people of Midian We sent their brother Shu&rsquo;aib. He said, &ldquo;O my people! Worship Allah&mdash;you have no other god except Him. A clear proof has already come to you from your Lord. So give just measure and weight, do not defraud people of their property, nor spread corruption in the land after it has been set in order. This is for your own good, if you are &#761;truly&#762; believers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "86",
    "Text": "And do not lie in ambush on every road&mdash;threatening and hindering those who believe in Allah from His Path and striving to make it &#761;appear&#762; crooked. Remember when you were few, then He increased you in number. And consider the fate of the corruptors!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "87",
    "Text": "If some of you do believe in what I have been sent with while others do not, then be patient until Allah judges between us. He is the Best of Judges.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "88",
    "Text": "The arrogant chiefs of his people threatened, &ldquo;O Shu&rsquo;aib! We will certainly expel you and your fellow believers from our land, unless you return to our faith.&rdquo; He replied, &ldquo;Even if we hate it?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "89",
    "Text": "We would surely be fabricating a lie against Allah if we were to return to your faith after Allah has saved us from it. It does not befit us to return to it unless it is the Will of Allah, our Lord. Our Lord has encompassed everything in &#761;His&#762; knowledge. In Allah we trust. Our Lord! Judge between us and our people with truth. You are the best of those who judge.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "90",
    "Text": "The disbelieving chiefs of his people threatened, &ldquo;If you follow Shu&rsquo;aib, you will surely be losers!&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "91",
    "Text": "Then an &#761;overwhelming&#762; earthquake struck them and they fell lifeless in their homes."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "92",
    "Text": "Those who rejected Shu&rsquo;aib were &#761;wiped out&#762; as if they had never lived there. Those who rejected Shu&rsquo;aib were the true losers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "93",
    "Text": "He turned away from them, saying, &ldquo;O my people! Indeed, I have delivered to you the messages of my Lord and gave you &#761;sincere&#762; advice. How can I then grieve for those who chose to disbelieve?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "94",
    "Text": "Whenever We sent a prophet to a society, We afflicted its &#761;disbelieving&#762; people with suffering and adversity, so perhaps they would be humbled."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "95",
    "Text": "Then We changed their adversity to prosperity until they flourished and argued &#761;falsely&#762;, &ldquo;Our forefathers &#761;too&#762; had been visited by adversity and prosperity.&rdquo;<span class='fn' foot_note=29132>1</span>&nbsp;So We seized them by surprise, while they were unaware."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "96",
    "Text": "Had the people of those societies been faithful and mindful &#761;of Allah&#762;, We would have overwhelmed them with blessings from heaven and earth. But they disbelieved, so We seized them for what they used to commit."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "97",
    "Text": "Did the people of those societies feel secure that Our punishment would not come upon them by night while they were asleep?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "98",
    "Text": "Or did they feel secure that Our punishment would not come upon them by day while they were at play?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "99",
    "Text": "Did they feel secure against Allah&rsquo;s planning? None would feel secure from Allah&rsquo;s planning except the losers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "100",
    "Text": "Is it not clear to those who take over the land after &#761;the destruction of&#762; its former residents that&mdash;if We will&mdash;We can punish them &#761;too&#762; for their sins and seal their hearts so they will not hear &#761;the truth&#762;?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "101",
    "Text": "We have narrated to you &#761;O Prophet&#762; some of the stories of those societies. Surely, their messengers came to them with clear proofs, but still they would not believe in what they had already denied. This is how Allah seals the hearts of the disbelievers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "102",
    "Text": "We did not find most of them true to their covenant. Rather, We found most of them truly rebellious."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "103",
    "Text": "Then after them We sent Moses with Our signs to Pharaoh and his chiefs, but they wrongfully rejected them. See what was the end of the corruptors!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "104",
    "Text": "And Moses said, &ldquo;O Pharaoh! I am truly a messenger from the Lord of all worlds,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "105",
    "Text": "obliged to say nothing about Allah except the truth. Indeed, I have come to you with clear proof from your Lord, so let the children of Israel go with me.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "106",
    "Text": "Pharaoh said, &ldquo;If you have come with a sign, then bring it if what you say is true.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "107",
    "Text": "So Moses threw down his staff and&mdash;behold!&mdash;it became a real snake."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "108",
    "Text": "Then he drew his hand &#761;out of his collar&#762; and it was &#761;shining&#762; white for all to see."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "109",
    "Text": "The chiefs of Pharaoh&rsquo;s people said, &ldquo;He is indeed a skilled magician,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "110",
    "Text": "who seeks to drive you from your land.&rdquo; &#761;So Pharaoh asked,&#762; &ldquo;What do you propose?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "111",
    "Text": "They replied, &ldquo;Let him and his brother wait and send mobilizers to all cities"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "112",
    "Text": "to bring you every clever magician.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "113",
    "Text": "The magicians came to Pharaoh, saying, &ldquo;Shall we receive a &#761;suitable&#762; reward if we prevail?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "114",
    "Text": "He replied, &ldquo;Yes, and you will certainly be among those closest to me.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "115",
    "Text": "They asked, &ldquo;O Moses! Will you cast, or shall we be the first to cast?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "116",
    "Text": "Moses said, &ldquo;You first.&rdquo; So when they did, they deceived the eyes of the people, stunned them, and made a great display of magic."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "117",
    "Text": "Then We inspired Moses, &ldquo;Throw down your staff,&rdquo; and&mdash;behold!&mdash;it devoured the objects of their illusion!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "118",
    "Text": "So the truth prevailed and their illusions failed."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "119",
    "Text": "So Pharaoh and his people were defeated right there and put to shame."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "120",
    "Text": "And the magicians fell down, prostrating."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "121",
    "Text": "They declared, &ldquo;We &#761;now&#762; believe in the Lord of all worlds&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "122",
    "Text": "the Lord of Moses and Aaron.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "123",
    "Text": "Pharaoh threatened, &ldquo;How dare you believe in him before I give you permission? This must be a conspiracy you devised in the city to drive out its people, but soon you will see."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "124",
    "Text": "I will certainly cut off your hands and feet on opposite sides, then crucify you all.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "125",
    "Text": "They responded, &ldquo;Surely to our Lord we will &#761;all&#762; return."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "126",
    "Text": "Your rage towards us is only because we believed in the signs of our Lord when they came to us. Our Lord! Shower us with perseverance, and let us die while submitting &#761;to You&#762;.&rdquo;<span class='fn' foot_note=29133>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "127",
    "Text": "The chiefs of Pharaoh&rsquo;s people protested, &ldquo;Are you going to leave Moses and his people free to spread corruption in the land and abandon you and your gods?&rdquo; He responded, &ldquo;We will kill their sons and keep their women.<span class='fn' foot_note=29134>1</span>&nbsp;We will completely dominate them.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "128",
    "Text": "Moses reassured his people, &ldquo;Seek Allah&rsquo;s help and be patient. Indeed, the earth belongs to Allah &#761;alone&#762;. He grants it to whoever He chooses of His servants. The ultimate outcome belongs &#761;only&#762; to the righteous.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "129",
    "Text": "They complained, &ldquo;We have always been oppressed&mdash;before and after you came to us &#761;with the message&#762;.&rdquo; He replied, &ldquo;Perhaps your Lord will destroy your enemy and make you successors in the land to see what you will do.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "130",
    "Text": "Indeed, We afflicted Pharaoh&rsquo;s people with famine and shortage of crops so they might come back &#761;to their senses&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "131",
    "Text": "In times of prosperity, they said, &ldquo;This is what we deserve,&rdquo; but in adversity, they blamed it on Moses and those with him.<span class='fn' foot_note=29135>1</span>&nbsp;Surely all is destined by Allah. Yet most of them did not know."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "132",
    "Text": "They said, &ldquo;No matter what sign you may bring to deceive us, we will never believe in you.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "133",
    "Text": "So We plagued them with floods, locusts, lice, frogs, and blood&mdash;all as clear signs, but they persisted in arrogance and were a wicked people."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "134",
    "Text": "When tormented, they pleaded, &ldquo;O Moses! Pray to your Lord on our behalf, by virtue of the covenant He made with you. If you help remove this torment from us, we will certainly believe in you and let the Children of Israel go with you.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "135",
    "Text": "But as soon as We removed the torment from them&mdash;until they met their inevitable fate<span class='fn' foot_note=29136>1</span>&mdash;they broke their promise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "136",
    "Text": "So We inflicted punishment upon them, drowning them in the sea for denying Our signs and being heedless of them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "137",
    "Text": "And &#761;so&#762; We made the oppressed people successors of the eastern and western lands, which We had showered with blessings. &#761;In this way&#762; the noble Word of your Lord was fulfilled for the Children of Israel for what they had endured. And We destroyed what Pharaoh and his people constructed and what they established."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "138",
    "Text": "We brought the Children of Israel across the sea and they came upon a people devoted to idols. They demanded, &ldquo;O Moses! Make for us a god like their gods.&rdquo; He replied, &ldquo;Indeed, you are a people acting ignorantly!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "139",
    "Text": "What they follow is certainly doomed to destruction and their deeds are in vain.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "140",
    "Text": "He added, &ldquo;Shall I seek for you a god other than Allah, while He has honoured you above the others?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "141",
    "Text": "And &#761;remember&#762; when We rescued you from the people of Pharaoh, who afflicted you with dreadful torment&mdash;killing your sons and keeping your women. That was a severe test from your Lord."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "142",
    "Text": "We appointed for Moses thirty nights then added another ten&mdash;completing his Lord&rsquo;s term of forty nights. Moses commanded his brother Aaron, &ldquo;Take my place among my people, do what is right, and do not follow the way of the corruptors.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "143",
    "Text": "When Moses came at the appointed time and his Lord spoke to him, he asked, &ldquo;My Lord! Reveal Yourself to me so I may see You.&rdquo; Allah answered, &ldquo;You cannot see Me! But look at the mountain. If it remains firm in its place, only then will you see Me.&rdquo; When his Lord appeared to the mountain, He levelled it to dust and Moses collapsed unconscious. When he recovered, he cried, &ldquo;Glory be to You! I turn to You in repentance and I am the first of the believers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "144",
    "Text": "Allah said, &ldquo;O Moses! I have &#761;already&#762; elevated you above all others by My messages and speech.<span class='fn' foot_note=29137>1</span>&nbsp;So hold firmly to what I have given you and be grateful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "145",
    "Text": "We wrote for him on the Tablets &#761;the fundamentals&#762; of everything; commandments and explanations of all things. &#761;We commanded,&#762; &ldquo;Hold to this firmly and ask your people to take the best of it.<span class='fn' foot_note=29138>1</span>&nbsp;I will soon show &#761;all of&#762; you the home of the rebellious.<span class='fn' foot_note=29139>2</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "146",
    "Text": "I will turn away from My signs those who act unjustly with arrogance in the land. And even if they were to see every sign, they still would not believe in them. If they see the Right Path, they will not take it. But if they see a crooked path, they will follow it. This is because they denied Our signs and were heedless of them."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "147",
    "Text": "The deeds of those who deny Our signs and the meeting &#761;with Allah&#762; in the Hereafter will be in vain. Will they be rewarded except for what they have done?&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "148",
    "Text": "In the absence of Moses, his people made from their &#761;golden&#762; jewellery an idol of a calf that made a lowing sound. Did they not see that it could neither speak to them nor guide them to the &#761;Right&#762; Path? Still they took it as a god and were wrongdoers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "149",
    "Text": "Later, when they were filled with remorse and realized they had gone astray, they cried, &ldquo;If our Lord does not have mercy on us and forgive us, we will certainly be losers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "150",
    "Text": "Upon Moses&rsquo; return to his people, &#761;totally&#762; furious and sorrowful, he said, &ldquo;What an evil thing you committed in my absence! Did you want to hasten your Lord&rsquo;s torment?&rdquo; Then he threw down the Tablets and grabbed his brother by the hair, dragging him closer. Aaron pleaded, &ldquo;O son of my mother! The people overpowered me and were about to kill me. So do not &#761;humiliate me and&#762; make my enemies rejoice, nor count me among the wrongdoing people.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "151",
    "Text": "Moses prayed, &ldquo;My Lord! Forgive me and my brother! And admit us into Your mercy. You are the Most Merciful of the merciful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "152",
    "Text": "Those who worshipped the calf will certainly be afflicted with Allah&rsquo;s wrath as well as disgrace in the life of this world. This is how We reward those who invent falsehood."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "153",
    "Text": "But those who commit evil, then repent and become &#761;true&#762; believers, your Lord will certainly be All-Forgiving, Most-Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "154",
    "Text": "When Moses&rsquo; anger subsided, he took up the Tablets whose text contained guidance and mercy for those who stand in awe of their Lord."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "155",
    "Text": "Moses chose seventy men from among his people for Our appointment and, when they were seized by an earthquake,<span class='fn' foot_note=29140>1</span>&nbsp;he cried, &ldquo;My Lord! Had You willed, You could have destroyed them long ago, and me as well. Will You destroy us for what the foolish among us have done? This is only a test from You&mdash;by which You allow whoever you will to stray and guide whoever You will. You are our Guardian. So forgive us and have mercy on us. You are the best forgiver."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "156",
    "Text": "Ordain for us what is good in this life and the next. Indeed, we have turned to You &#761;in repentance&#762;.&rdquo; Allah replied, &ldquo;I will inflict My torment on whoever I will. But My mercy encompasses everything. I will ordain mercy for those who shun evil, pay alms-tax, and believe in Our revelations."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "157",
    "Text": "&ldquo;&#761;They are&#762; the ones who follow the Messenger, the unlettered Prophet, whose description they find in their Torah and the Gospel.<span class='fn' foot_note=29141>1</span>&nbsp;He commands them to do good and forbids them from evil, permits for them what is lawful and forbids to them what is impure, and relieves them from their burdens and the shackles that bound them. &#761;Only&#762; those who believe in him, honour and support him, and follow the light sent down to him will be successful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "158",
    "Text": "Say, &#761;O Prophet,&#762; &ldquo;O humanity! I am Allah&rsquo;s Messenger to you all. To Him &#761;alone&#762; belongs the kingdom of the heavens and the earth. There is no god &#761;worthy of worship&#762; except Him. He gives life and causes death.&rdquo; So believe in Allah and His Messenger, the unlettered Prophet, who believes in Allah and His revelations. And follow him, so you may be &#761;rightly&#762; guided."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "159",
    "Text": "There are some among the people of Moses who guide with the truth and establish justice accordingly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "160",
    "Text": "We divided them into twelve tribes&mdash;each as a community. And We revealed to Moses, when his people asked for water, &ldquo;Strike the rock with your staff.&rdquo; Then twelve springs gushed out. Each tribe knew its drinking place. We shaded them with clouds and sent down to them manna and quails,<span class='fn' foot_note=29142>1</span>&nbsp;&#761;saying&#762;, &ldquo;Eat from the good things We have provided for you.&rdquo; They &#761;certainly&#762; did not wrong Us, but wronged themselves."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "161",
    "Text": "And &#761;remember&#762; when it was said to them, &ldquo;Enter this city &#761;of Jerusalem&#762; and eat from wherever you please. Say, &lsquo;Absolve us,&rsquo; and enter the gate with humility. We will forgive your sins, &#761;and&#762; We will multiply the reward for the good-doers.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "162",
    "Text": "But the wrongdoers among them changed the words they were commanded to say. So We sent down a punishment from the heavens upon them for their wrongdoing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "163",
    "Text": "Ask them &#761;O Prophet&#762; about &#761;the people of&#762; the town which was by the sea, who broke the Sabbath.<span class='fn' foot_note=29143>1</span>&nbsp;During the Sabbath, &#761;abundant&#762; fish would come to them clearly visible, but on other days the fish were never seen. In this way We tested them for their rebelliousness."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "164",
    "Text": "When some of &#761;the righteous among&#762; them questioned &#761;their fellow Sabbath-keepers&#762;, &ldquo;Why do you &#761;bother to&#762; warn those &#761;Sabbath-breakers&#762; who will either be destroyed or severely punished by Allah?&rdquo; They replied, &ldquo;Just to be free from your Lord&rsquo;s blame, and so perhaps they may abstain.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "165",
    "Text": "When they ignored the warning they were given, We rescued those who used to warn against evil and overtook the wrongdoers with a dreadful punishment for their rebelliousness."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "166",
    "Text": "But when they stubbornly persisted in violation, We said to them, &ldquo;Be disgraced apes!&rdquo;<span class='fn' foot_note=29144>1</span>&nbsp;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "167",
    "Text": "And &#761;remember, O &nbsp;Prophet,&#762; when your Lord declared that He would send against them others who would make them suffer terribly until the Day of Judgment. Indeed, your Lord is swift in punishment, but He is certainly All-Forgiving, Most Merciful."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "168",
    "Text": "We dispersed them through the land in groups&mdash;some were righteous, others were less so. We tested them with prosperity and adversity, so perhaps they would return &#761;to the Right Path&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "169",
    "Text": "Then they were succeeded by other generations who inherited the Scripture. They indulged in unlawful gains, claiming, &ldquo;We will be forgiven &#761;after all&#762;.&rdquo; And if similar gain came their way, they would seize it. Was a covenant not taken from them in the Scripture that they would not say anything about Allah except the truth? And they were already well-versed in its teachings. But the &#761;eternal&#762; Home of the Hereafter is far better for those mindful &#761;of Allah&#762;. Will you not then understand?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "170",
    "Text": "As for those who firmly abide by the Scripture and establish prayer&mdash;surely We never discount the reward of those acting righteously."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "171",
    "Text": "And &#761;remember&#762; when We raised the mountain over them as if it were a cloud and they thought it would fall on them.<span class='fn' foot_note=29145>1</span>&nbsp;&#761;We said,&#762; &ldquo;Hold firmly to that &#761;Scripture&#762; which&nbsp;We have given you and observe its teachings so perhaps you will become mindful &#761;of Allah&#762;.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "172",
    "Text": "And &#761;remember&#762; when your Lord brought forth from the loins of the children of Adam their descendants and had them testify regarding themselves. &#761;Allah asked,&#762; &ldquo;Am I not your Lord?&rdquo; They replied, &ldquo;Yes, You are! We testify.&rdquo; &#761;He cautioned,&#762; &ldquo;Now you have no right to say on Judgment Day, &lsquo;We were not aware of this.&rsquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "173",
    "Text": "Nor say, &lsquo;It was our forefathers who had associated others &#761;with Allah in worship&#762; and we, as their descendants, followed in their footsteps. Will you then destroy us for the falsehood they invented?&rsquo;&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "174",
    "Text": "This is how We make our signs clear, so perhaps they will return &#761;to the Right Path&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "175",
    "Text": "And relate to them &#761;O Prophet&#762; the story of the one to whom We gave Our signs, but he abandoned them, so Satan took hold of him, and he became a deviant.<span class='fn' foot_note=29146>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "176",
    "Text": "If We had willed, We would have elevated him with Our signs, but he clung to this life&mdash;following his evil desires. His example is that of a dog: if you chase it away, it pants, and if you leave it, it &#761;still&#762; pants. This is the example of the people who deny Our signs.<span class='fn' foot_note=29147>1</span>&nbsp;So narrate &#761;to them&#762; stories &#761;of the past&#762;, so perhaps they will reflect."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "177",
    "Text": "What an evil example of those who denied Our signs! They &#761;only&#762; wronged their own souls."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "178",
    "Text": "Whoever Allah guides is truly guided. And whoever He leaves to stray, they are the &#761;true&#762; losers."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "179",
    "Text": "Indeed, We have destined many jinn and humans for Hell. They have hearts they do not understand with, eyes they do not see with, and ears they do not hear with. They are like cattle. In fact, they are even less guided! Such &#761;people&#762; are &#761;entirely&#762; heedless."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "180",
    "Text": "Allah has the Most Beautiful Names. So call upon Him by them, and keep away from those who abuse His Names.<span class='fn' foot_note=29148>1</span>&nbsp;They will be punished for what they used to do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "181",
    "Text": "And among those We created is a group that guides with the truth and establishes justice accordingly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "182",
    "Text": "As for those who deny Our signs, We will gradually draw them to destruction in ways they cannot comprehend."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "183",
    "Text": "I &#761;only&#762; delay their end for a while, but My planning is flawless."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "184",
    "Text": "Have they not ever given it a thought? Their fellow man<span class='fn' foot_note=29149>1</span>&nbsp;is not insane. He is only sent with a clear warning."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "185",
    "Text": "Have they ever reflected on the wonders of the heavens and the earth, and everything Allah has created, and that perhaps their end is near? So what message after this &#761;Quran&#762; would they believe in?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "186",
    "Text": "Whoever Allah allows to stray, none can guide, leaving them to wander blindly in their defiance."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "187",
    "Text": "They ask you &#761;O Prophet&#762; regarding the Hour, &ldquo;When will it be?&rdquo; Say, &ldquo;That knowledge is only with my Lord. He alone will reveal it when the time comes. It is too tremendous for the heavens and the earth and will only take you by surprise.&rdquo; They ask you as if you had full knowledge of it. Say, &ldquo;That knowledge is only with Allah, but most people do not know.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "188",
    "Text": "Say, &ldquo;I have no power to benefit or protect myself, except by the Will of Allah. If I had known the unknown, I would have benefited myself enormously, and no harm would have ever touched me. I am only a warner and deliverer of good news for those who believe.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "189",
    "Text": "He is the One Who created you from a single soul, then from it made its spouse so he may find comfort in her. After he had been united with her, she carried a light burden that developed gradually. When it grew heavy, they prayed to Allah, their Lord, &ldquo;If you grant us good offspring, we will certainly be grateful.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "190",
    "Text": "But when He granted their descendants good offspring, they associated false gods in what He has given them. Exalted is Allah above what they associate &#761;with Him&#762;!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "191",
    "Text": "Do they associate &#761;with Allah&#762; those &#761;idols&#762; which cannot create anything, but are in fact created;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "192",
    "Text": "which cannot help them, or even help themselves?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "193",
    "Text": "And if you &#761;idolaters&#762; call upon them for guidance, they cannot respond to you. It is all the same whether you call them or remain silent."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "194",
    "Text": "Those &#761;idols&#762; you invoke besides Allah are created beings like yourselves. So call upon them and see if they will answer you, if your claims are true!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "195",
    "Text": "Do they have feet to walk with? Or hands to hold with? Or eyes to see with? Or ears to hear with? Say, &#761;O Prophet,&#762; &ldquo;Call upon your associate-gods and conspire against me without delay!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "196",
    "Text": "&ldquo;Indeed, my Protector is Allah Who has revealed this Book. For He &#761;alone&#762; protects the righteous."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "197",
    "Text": "But those &#761;false gods&#762; you call besides Him can neither help you nor even themselves.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "198",
    "Text": "If you &#761;idolaters&#762; call them to guidance, they cannot hear. And you &#761;O Prophet&#762; may see them facing towards you, but they cannot see."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "199",
    "Text": "Be gracious, enjoin what is right, and turn away from those who act ignorantly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "200",
    "Text": "If you are tempted by Satan, then seek refuge with Allah. Surely He is All-Hearing, All-Knowing."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "201",
    "Text": "Indeed, when Satan whispers to those mindful &#761;of Allah&#762;, they remember &#761;their Lord&#762; then they start to see &#761;things&#762; clearly."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "202",
    "Text": "But the devils persistently plunge their &#761;human&#762; associates<span class='fn' foot_note=29150>1</span>&nbsp;deeper into wickedness, sparing no effort."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "203",
    "Text": "If you &#761;O Prophet&#762; do not bring them a sign &#761;which they demanded&#762;, they ask, &ldquo;Why do you not make it yourself?&rdquo; Say, &ldquo;I only follow what is revealed to me from my Lord. This &#761;Quran&#762; is an insight from your Lord&mdash;a guide and a mercy for those who believe.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "204",
    "Text": "When the Quran is recited, listen to it attentively and be silent, so you may be shown mercy."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "205",
    "Text": "Remember your Lord inwardly with humility and reverence and in a moderate tone of voice, both morning and evening. And do not be one of the heedless."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "7",
    "AyahNumber": "206",
    "Text": "Surely those &#761;angels&#762; nearest to your Lord are not too proud to worship Him. They glorify Him. And to Him they prostrate."
  }
]
