[
  {
    "SurahNumber": "64",
    "AyahNumber": "1",
    "NoteID": "5479",
    "Body": "Cf. lxii. 1, and n. 5449. All things by their very\\n\\t\\t\\t\\texistence proclaim the Glory and the Praises of Allah. He\\n\\t\\t\\t\\thas dominion over all things, but He uses His dominion\\n\\t\\t\\t\\tfor just and praiseworthy ends. He has power over all\\n\\t\\t\\t\\tthings: therefore He can combine justice with mercy, and\\n\\t\\t\\t\\tHis Plan and Purpose cannot be frustrated by the\\n\\t\\t\\t\\texistence of Evil along with Good in His Kingdom."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "2",
    "NoteID": "5480",
    "Body": "It is not that He does not see Rebellion and Evil, nor\\n\\t\\t\\t\\tthat He cannot punish them. He created all things pure\\n\\t\\t\\t\\tand good, and if evil crept in by the grant of a limited\\n\\t\\t\\t\\tfree-will by Him, it is not unforeseen: it is in His wise\\n\\t\\t\\t\\tand universal Plan, for giving man a chance of rising\\n\\t\\t\\t\\thigher and ever higher."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "3",
    "NoteID": "5481",
    "Body": "Cf. xl. 64, and n. 4440: also vii. 11 and n. 996. In\\n\\t\\t\\t\\taddition to the beauty and grandeur of all God's\\n\\t\\t\\t\\tCreation, He has endowed man with special aptitudes,\\n\\t\\t\\t\\tfaculties and capacities, and special excellencies which\\n\\t\\t\\t\\traise him at his best to the position of vicegerent on\\n\\t\\t\\t\\tearth. \"Beautiful\" also includes the idea of \"adapted to\\n\\t\\t\\t\\tthe ends for which they were created\"."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "3",
    "NoteID": "5482",
    "Body": "\"The final Return\": not only of mankind, but of all\\n\\t\\t\\t\\tthings created, whether material or in the realm of ideas\\n\\t\\t\\t\\tand events. All things return to Allah: as they derive\\n\\t\\t\\t\\ttheir origin from Him, so is the return or destination of\\n\\t\\t\\t\\tall of them to Allah."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "4",
    "NoteID": "5483",
    "Body": "Not only does He create and develop and sustain all\\n\\t\\t\\t\\tthings; but all thoughts, motives, feelings, ideas, and\\n\\t\\t\\t\\tevents are known to Him. Therefore we must not imagine\\n\\t\\t\\t\\tthat, if some evil seems to go unpunished, it is not\\n\\t\\t\\t\\tknown to Him or has escaped His notice. His Plan is wise\\n\\t\\t\\t\\tand good in its fullest compass: sometimes we do not see\\n\\t\\t\\t\\tits wisdom and goodness because we see only a broken\\n\\t\\t\\t\\tfragment of it, as our own intelligence is narrow."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "5",
    "NoteID": "5484",
    "Body": "\"The evil result of their conduct\" begins to manifest\\n\\t\\t\\t\\titself in this very life, either in external events, or\\n\\t\\t\\t\\tin internal restlessness and agonies of conscience. But\\n\\t\\t\\t\\tits culminating force will be seen in the \"grievous\\n\\t\\t\\t\\tPenalty\" of the Hereafter."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "6",
    "NoteID": "5485",
    "Body": "This is referred to in a more expanded form in xiv. 9-11,\\n\\t\\t\\t\\twhich see."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "6",
    "NoteID": "5486",
    "Body": "Their obedience is not necessary to Allah, nor will their\\n\\t\\t\\t\\trejection of Truth affect the validity of Truth or injure\\n\\t\\t\\t\\tthe progress of Truth. Allah is free of all needs or\\n\\t\\t\\t\\tdependence on any circumstance whatever. He sends His\\n\\t\\t\\t\\tMessage for the good of mankind, and it is man who\\n\\t\\t\\t\\tsuffers by ignoring, rejecting, or opposing it."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "7",
    "NoteID": "5487",
    "Body": "In other words, they think that there is no future life,\\n\\t\\t\\t\\tand no responsibility for our actions beyond what we see\\n\\t\\t\\t\\tin the present life. If that were true, all the profits\\n\\t\\t\\t\\tof fraud and roguery, which remain unpunished in this\\n\\t\\t\\t\\tworld-and many do remain unpunished in this world-will\\n\\t\\t\\t\\tremain with the wicked; and all the losses and pain\\n\\t\\t\\t\\tsuffered by integrity and righteousness, if they find no\\n\\t\\t\\t\\tcompensation in this life, will never find any\\n\\t\\t\\t\\tcompensation. This would be an odd result in a world of\\n\\t\\t\\t\\tjustice. We are taught that this is not true,-that it is\\n\\t\\t\\t\\tcertain that the balance will be redressed in a better\\n\\t\\t\\t\\tfuture world; that there will be a resurrection of what\\n\\t\\t\\t\\twe call the dead; and that on that occasion the full\\n\\t\\t\\t\\timport of all we did will be made plain to us, and our\\n\\t\\t\\t\\tmoral and spiritual responsibility will be fully\\n\\t\\t\\t\\tenforced."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "8",
    "NoteID": "5488",
    "Body": "\"The Light which We have sent down\": i.e., the light of\\n\\t\\t\\t\\tRevelation, the fight of conscience, the light of reason,\\n\\t\\t\\t\\tand every kind of true light by which we may know Allah\\n\\t\\t\\t\\tand His Will. If we play false with any such lights, it\\n\\t\\t\\t\\tis fully known to Allah."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "9",
    "NoteID": "5489",
    "Body": "The Day of Judgment will truly be \"a Day of Mutual Loss\\n\\t\\t\\t\\tand Gain\", as the title of this Sura indicates. Men who\\n\\t\\t\\t\\tthought they were laying up riches will find themselves\\n\\t\\t\\t\\tpaupers in the Kingdom of Heaven. Men who thought they\\n\\t\\t\\t\\twere acquiring good by wrong-doing will find their\\n\\t\\t\\t\\tefforts were wasted; xviii. 104. On the other hand the\\n\\t\\t\\t\\tmeek and lowly of this life will acquire great dignity\\n\\t\\t\\t\\tand honour in the next; the despised ones doing good here\\n\\t\\t\\t\\twill be the accepted ones there; the persecuted righteous\\n\\t\\t\\t\\twill be in eternal happiness. The two classes will as it\\n\\t\\t\\t\\twere change their relative positions."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "9",
    "NoteID": "5490",
    "Body": "\"Remove from them their ills\". The ills may be sins,\\n\\t\\t\\t\\tfaults, mistakes, or evil tendencies; Allah will of His\\n\\t\\t\\t\\tgrace cover them up, and blot out the account against\\n\\t\\t\\t\\tthem; or they may be sorrows, sufferings, or\\n\\t\\t\\t\\tdisappointments: Allah may even change the evil of such\\n\\t\\t\\t\\tpersons into good, their apparent calamities into\\n\\t\\t\\t\\topportunities for spiritual advancement: xxv. 70. This is\\n\\t\\t\\t\\tbecause of their sincere Faith as evidenced by their\\n\\t\\t\\t\\trepentance and amendment."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "9",
    "NoteID": "5491",
    "Body": "\"Gardens\" the place of the highest Bliss, see ii. 25, n.\\n\\t\\t\\t\\t44; xiii. 35; xlvii. 15."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "11",
    "NoteID": "5492",
    "Body": "What we consider calamities may be blessings in disguise.\\n\\t\\t\\t\\tPain in the body is often a signal of something wrong,\\n\\t\\t\\t\\twhich we can cure by remedial measures. So in the moral\\n\\t\\t\\t\\tand spiritual world, we should in all circumstances hold\\n\\t\\t\\t\\tfirmly to the faith that nothing happens without Allah's\\n\\t\\t\\t\\tknowledge and leave; and therefore there must be some\\n\\t\\t\\t\\tjustice and wisdom according to His great universal Plan.\\n\\t\\t\\t\\tOur duty is to find out our own shortcomings and remedy\\n\\t\\t\\t\\tthem. If we try to do so in all sincerity of heart, Allah\\n\\t\\t\\t\\twill give us guidance."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "12",
    "NoteID": "5493",
    "Body": "The Messenger comes to guide and teach, not to force and\\n\\t\\t\\t\\tcompel. The Messenger's teaching is clear and\\n\\t\\t\\t\\tunambiguous, and it is open and free to all. Cf. also v.\\n\\t\\t\\t\\t95."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "14",
    "NoteID": "5494",
    "Body": "In some cases the demands of families, i.e., wife and\\n\\t\\t\\t\\tchildren may conflict with a man's moral and spiritual\\n\\t\\t\\t\\tconvictions and duties. In such cases he must guard\\n\\t\\t\\t\\tagainst the abandonment of his convictions, duties, and\\n\\t\\t\\t\\tideals to their requests or desires. But he must not\\n\\t\\t\\t\\ttreat them harshly. He must make reasonable provision for\\n\\t\\t\\t\\tthem, and if they persist in opposing his clear duties\\n\\t\\t\\t\\tand convictions, he must forgive them and not expose them\\n\\t\\t\\t\\tto shame or ridicule, while at the same time holding on\\n\\t\\t\\t\\tto his clear duty. Such cases occurred when godly men\\n\\t\\t\\t\\tundertook exile from their native city of Makkah to\\n\\t\\t\\t\\tfollow the Faith in Madinah. In some cases their families\\n\\t\\t\\t\\tmurmured, but all came right in the end."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "14",
    "NoteID": "5495",
    "Body": "For the different words for \"forgiveness\", see n. 110 to\\n\\t\\t\\t\\tii. 109."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "15",
    "NoteID": "5496",
    "Body": "Children may be a \"trial\" in many senses: (1) their\\n\\t\\t\\t\\tdifferent ways of looking at things may cause you to\\n\\t\\t\\t\\treflect, and to turn to the highest things of eternal\\n\\t\\t\\t\\timportance; (2) their relationship with you and with each\\n\\t\\t\\t\\tother may confront you with problems far more complicated\\n\\t\\t\\t\\tthan those in separate individual lives, and thus become\\n\\t\\t\\t\\ta test of your own strength of character and sense of\\n\\t\\t\\t\\tresponsibility; (3) their conflict with your ideals (see\\n\\t\\t\\t\\tn. 5494 above) may vex your spirit, but may at the same\\n\\t\\t\\t\\ttime search out your fidelity to Allah; and (4) their\\n\\t\\t\\t\\taffection for you and your affection for them, may be a\\n\\t\\t\\t\\tsource of strength for you if it is pure, just as it may\\n\\t\\t\\t\\tbe a danger if it is based on selfish or unworthy\\n\\t\\t\\t\\tmotives. So also riches and worldly goods have their\\n\\t\\t\\t\\tadvantages as well as dangers."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "16",
    "NoteID": "5497",
    "Body": "\"Fear Allah\" combined with \"as much as you can\" obviously\\n\\t\\t\\t\\tmeans: \"lead lives of self-restraint and righteousness\":\\n\\t\\t\\t\\tthe usual meaning of Taqwa: see n. 26 to ii. 2."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "16",
    "NoteID": "5498",
    "Body": "Charity is meant to help and do good to other people who\\n\\t\\t\\t\\tneed it. But it has the highest subjective value for the\\n\\t\\t\\t\\tperson who gives it. Like mercy \"it blesseth him that\\n\\t\\t\\t\\tgives and him that takes\". It purifies the giver's soul:\\n\\t\\t\\t\\tthe affection that he pours out is for his own spiritual\\n\\t\\t\\t\\tbenefit and progress. Cf. Coleridge: \"He prayeth best who\\n\\t\\t\\t\\tloveth best all things both great and small, for the\\n\\t\\t\\t\\tGreat God Who loveth us, Who made and loveth all\"."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "16",
    "NoteID": "5499",
    "Body": "Cf. lix. 9. Our worst enemy is within ourselves,-the\\n\\t\\t\\t\\tgrasping selfishness which would deprive others of their\\n\\t\\t\\t\\tjust rights or seize things which do not properly belong\\n\\t\\t\\t\\tto it. If we can get over this covetous selfishness, we\\n\\t\\t\\t\\tachieve real Prosperity in justice and truth."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "17",
    "NoteID": "5500",
    "Body": "Cf. ii. 245 and n. 276. Our Charity or Love is called a\\n\\t\\t\\t\\tloan to Allah, which not only increases our credit\\n\\t\\t\\t\\taccount manifold, but obtains for us the forgiveness of\\n\\t\\t\\t\\tour sins, and the Capacity for increased service in the\\n\\t\\t\\t\\tfuture."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "17",
    "NoteID": "5501",
    "Body": "Cf. xiv. 5, n. 1877; and xxxv. 30, n. 3917. Allah's\\n\\t\\t\\t\\tappreciation of our service or our love goes far deeper\\n\\t\\t\\t\\tthan its intrinsic merits or its specific expression on\\n\\t\\t\\t\\tour side. His reward is beyond our deserts, and passes\\n\\t\\t\\t\\tover out defects. He judges by our motives, which He can\\n\\t\\t\\t\\tread through and through: see next verse."
  },
  {
    "SurahNumber": "64",
    "AyahNumber": "18",
    "NoteID": "5502",
    "Body": "Allah's Appreciation and Forbearing Kindness can reach so\\n\\t\\t\\t\\tfar beyond our merits, because (1) His universal\\n\\t\\t\\t\\tknowledge comprehends hidden motives, which others cannot\\n\\t\\t\\t\\tsee in us; (2) His power is so great that He can afford\\n\\t\\t\\t\\tto reward even the unworthy; and (3) His Wisdom is so\\n\\t\\t\\t\\tgreat that He can turn even our weakness into our\\n\\t\\t\\t\\tstrength."
  }
]
