[
  {
    "BookCode": "AMH",
    "VolumeNumber": "44",
    "hadithNumber": "1",
    "sectionHeading": "Beginning With the People Seeking Blood Revenge in the Oath",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Layla ibn\\n\\t\\t\\t\\tAbdullah ibn Abd ar-Rahman ibn Sahl from Sahl ibn Abi\\n\\t\\t\\t\\tHathma that some of the great men of his people informed\\n\\t\\t\\t\\thim that Abdullah ibn Sahl and Muhayyisa went out to\\n\\t\\t\\t\\tKhaybar because extreme poverty had overtaken them.\\n\\t\\t\\t\\tMuhayyisa returned and said that Abdullah ibn Sahl had\\n\\t\\t\\t\\tbeen killed and thrown in a shallow well or spring. The\\n\\t\\t\\t\\tjews came and he said, \"By Allah! You have killed him.\"\\n\\t\\t\\t\\tThey said, \"By Allah! We have not killed him!\" Then he\\n\\t\\t\\t\\tmade for his people and mentioned that to them. Then he,\\n\\t\\t\\t\\this brother Huwayyisa, who was older than him, and Abd\\n\\t\\t\\t\\tar-Rahman, set out. Muhayyisa began to speak, as he had\\n\\t\\t\\t\\tbeen at Khaybar. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said to him, \"The greater first,\\n\\t\\t\\t\\tthe greater first,\" meaning in age. So Huwayyisa spoke\\n\\t\\t\\t\\tand then Muhayyisa spoke. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Either they\\n\\t\\t\\t\\tpay your companion's blood-money or we will declare war\\n\\t\\t\\t\\tagainst them.\" The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, wrote that to them and they\\n\\t\\t\\t\\twrote, \"By Allah, we did not kill him!\" The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\tHuwayyisa, Muhayyisa, and Abd ar-Rahman, \"Do you swear\\n\\t\\t\\t\\tand claim the blood of your companion?\" They said, \"No.\"\\n\\t\\t\\t\\tHe said, \"Shall the jews swear to you?\" They said, \"But\\n\\t\\t\\t\\tthey are not muslims.\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, gave blood-money from his\\n\\t\\t\\t\\town property, and sent them one hundred camels to their\\n\\t\\t\\t\\thouse.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tSahl added, \"A red camel among them kicked me.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "44",
    "hadithNumber": "2",
    "sectionHeading": "Beginning With the People Seeking Blood Revenge in the Oath",
    "text": "<p>\\n\\t\\t\\t\\tYahya said from Malik from Yahya ibn Said that Bushayr\\n\\t\\t\\t\\tibn Yasar informed him that Abdullah ibn Sahl al-Ansari\\n\\t\\t\\t\\tand Muhayyisa ibn Masud went out to Khaybar, and they\\n\\t\\t\\t\\tseparated on their various businesses and Abdullah ibn\\n\\t\\t\\t\\tSahl was killed. Muhayyisa, and his brother Huwayyisa and\\n\\t\\t\\t\\tAbd ar-Rahman ibn Sahl went to the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and Abd ar-Rahman began to\\n\\t\\t\\t\\tspeak before his brother. The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The older\\n\\t\\t\\t\\tfirst, the older first. \\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tTherefore Huwayyisa and then Muhayyisa spoke and\\n\\t\\t\\t\\tmentioned the affair of Abdullah ibn Sahl. The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said\\n\\t\\t\\t\\tto them, \"Do you swear with fifty oaths and claim the\\n\\t\\t\\t\\tblood-money of your companion or the life of the\\n\\t\\t\\t\\tmurderer?\" They said, \"Messenger of Allah, we did not see\\n\\t\\t\\t\\tit and we were not present.\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Will you\\n\\t\\t\\t\\tacquit the jews for fifty oaths?' They said, \"Messenger\\n\\t\\t\\t\\tof Allah, how can we accept the oaths of a people who are\\n\\t\\t\\t\\tkafirun?\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya ibn Said said, \"Bushayr ibn Yasar claimed that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, paid the blood-money from his own property.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tin our community and that which I heard from whoever I am\\n\\t\\t\\t\\tcontent with, concerning the oath of qasama, and upon\\n\\t\\t\\t\\twhich the past and present imams agree, is that those who\\n\\t\\t\\t\\tclaim revenge begin with the oaths and swear. The oath\\n\\t\\t\\t\\tfor revenge is only obligatory in two situations. Either\\n\\t\\t\\t\\tthe slain person says, 'My blood is against so-and-so,'\\n\\t\\t\\t\\tor the relatives entitled to the blood bring a partial\\n\\t\\t\\t\\tproof of it that is not irrefutable against the one who\\n\\t\\t\\t\\tis the object of the blood-claim. This obliges taking an\\n\\t\\t\\t\\toath on the part of those who claim the blood against\\n\\t\\t\\t\\tthose who are the object of the blood-claim. With us,\\n\\t\\t\\t\\tswearing is only obliged in these two situations.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the sunna in which there is no\\n\\t\\t\\t\\tdispute with us and which is still the behaviour of the\\n\\t\\t\\t\\tpeople. The people who claim blood begin the swearings,\\n\\t\\t\\t\\twhether it is an intentional killing or an accident.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, began with Banu Harith in the case\\n\\t\\t\\t\\tof the killing of their kinsman murdered at Khaybar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If those who make the claim swear, they\\n\\t\\t\\t\\tdeserve the blood of their kinsman and whoever they swear\\n\\t\\t\\t\\tagainst is slain. Only one man can be killed in the\\n\\t\\t\\t\\tqasama. Two cannot be killed in it. Fifty men from the\\n\\t\\t\\t\\tblood-relatives must swear fifty oaths. If their number\\n\\t\\t\\t\\tis less or some of them draw back, they can repeat their\\n\\t\\t\\t\\toaths, unless one of the relatives of the murdered man\\n\\t\\t\\t\\twho deserves blood and who is permitted to pardon it,\\n\\t\\t\\t\\tdraws back. If one of these draws back, there is no way\\n\\t\\t\\t\\tto revenge.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The oaths can be made by\\n\\t\\t\\t\\tthose of them who remain if one of them draws back who is\\n\\t\\t\\t\\tnot permitted to pardon. If one of the blood-relatives\\n\\t\\t\\t\\tdraws back who is permitted to pardon, even if he is only\\n\\t\\t\\t\\tone, more oaths can not be made after that by the\\n\\t\\t\\t\\tblood-relatives. If that occurs, the oaths can be on\\n\\t\\t\\t\\tbehalf of the one against whom the claim is made. So\\n\\t\\t\\t\\tfifty of the men of his people swear fifty oaths. If\\n\\t\\t\\t\\tthere are not fifty men, more oaths can be made by those\\n\\t\\t\\t\\tof them who already swore. If there is only the\\n\\t\\t\\t\\tdefendant, he swears fifty oaths and is acquitted.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"One distinguishes between\\n\\t\\t\\t\\tswearing for blood and oaths for one's rights. When a man\\n\\t\\t\\t\\thas a money-claim against another man, he seeks to verify\\n\\t\\t\\t\\this due. When a man wants to kill another man, he does\\n\\t\\t\\t\\tnot kill him in the midst of people. He keeps to a place\\n\\t\\t\\t\\taway from people. Had there only been swearing in cases\\n\\t\\t\\t\\twhere there is a clear proof and had one acted in it as\\n\\t\\t\\t\\tone acts about one's rights (i.e. needing witnesses), the\\n\\t\\t\\t\\tright of blood retribution would have been lost and\\n\\t\\t\\t\\tpeople would have been swift to take advantage of it when\\n\\t\\t\\t\\tthey learned of the decision on it. However, the\\n\\t\\t\\t\\trelatives of the murdered man were allowed to initiate\\n\\t\\t\\t\\tswearing so that people might restrain themselves from\\n\\t\\t\\t\\tblood and the murderer might beware lest he was put into\\n\\t\\t\\t\\ta situation like that (i.e. qasama) by the statement of\\n\\t\\t\\t\\tthe murdered man.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"Malik said about a people of whom a certain\\n\\t\\t\\t\\tnumber are suspected of murder and the relatives of the\\n\\t\\t\\t\\tmurdered man ask them to take oaths and they are\\n\\t\\t\\t\\tnumerous, so they ask that each man swears fifty oaths on\\n\\t\\t\\t\\this own behalf. The oaths are not divided out between\\n\\t\\t\\t\\tthem according to their number and they are not acquitted\\n\\t\\t\\t\\tunless each man among them swears fifty oaths on his own\\n\\t\\t\\t\\tbehalf.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the best I have heard about the\\n\\t\\t\\t\\tmatter.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"Swearing goes to the paternal relatives of the\\n\\t\\t\\t\\tslain. They are the blood-relatives who swear against the\\n\\t\\t\\t\\tkiller and by whose swearing he is killed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "44",
    "hadithNumber": "2",
    "sectionHeading": "Blood-Relatives Who are Permitted to Swear in the Intentional Act",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The way of doing things in\\n\\t\\t\\t\\tour community about which there is no dispute is that\\n\\t\\t\\t\\twomen do not swear in the swearing for the intentional\\n\\t\\t\\t\\tact. If the murdered man only has female relatives, the\\n\\t\\t\\t\\twomen have no right to swear for blood and no pardon in\\n\\t\\t\\t\\tmurder.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said about a man who is murdered,\\n\\t\\t\\t\\t\"If the paternal relatives of the murdered man or his\\n\\t\\t\\t\\tmawali say, 'We swear and we demand our companion's\\n\\t\\t\\t\\tblood,' that is their right.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the women want to pardon him, they cannot\\n\\t\\t\\t\\tdo that. The paternal relatives and mawali are entitled\\n\\t\\t\\t\\tto do that more than them because they are the ones who\\n\\t\\t\\t\\tdemand blood and swear for it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the paternal relatives or mawali pardon\\n\\t\\t\\t\\tafter they demand blood and the women refuse and say, 'We\\n\\t\\t\\t\\twill not abandon our right against the murderer of our\\n\\t\\t\\t\\tcompanion,' the women are more entitled to that because\\n\\t\\t\\t\\twhoever takes retaliation is more entitled than the one\\n\\t\\t\\t\\twho leaves it among the women and paternal relatives when\\n\\t\\t\\t\\tthe murder is established and killing obliged.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"At least two claimants must swear in murder.\\n\\t\\t\\t\\tThe oaths are repeated by them until they swear fifty\\n\\t\\t\\t\\toaths, then they have the right to blood. That is how\\n\\t\\t\\t\\tthings are done in our community.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When people beat a man and he dies in their\\n\\t\\t\\t\\thands, they are all slain for him. If he dies after their\\n\\t\\t\\t\\tbeating, there is swearing. If there is swearing, it is\\n\\t\\t\\t\\tonly against one man and only he is slain. We have never\\n\\t\\t\\t\\tknown the swearing to be against more than one man.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a slave who had his hand or foot broken\\n\\t\\t\\t\\tand then the break mended . He said, \"The one who injured\\n\\t\\t\\t\\thim is not obliged to pay anything. If that break causes\\n\\t\\t\\t\\thim loss or scar, the one who injured him must pay\\n\\t\\t\\t\\taccording to what he diminished of the value of the\\n\\t\\t\\t\\tslave.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community about\\n\\t\\t\\t\\tretaliation between slaves is that it is like retaliation\\n\\t\\t\\t\\tbetween freemen. The life of the slave-girl for the life\\n\\t\\t\\t\\tof the slave, and her injury for his injury. When a slave\\n\\t\\t\\t\\tintentionally kills a slave, the master of the murdered\\n\\t\\t\\t\\tslave has a choice. If he wishes, he kills him, and if he\\n\\t\\t\\t\\twishes, he takes the blood-money. If he takes the\\n\\t\\t\\t\\tblood-money, he takes the value of his slave. If the\\n\\t\\t\\t\\towner of the slave who killed wishes to give the value of\\n\\t\\t\\t\\tthe murdered slave, he does it. If he wishes, he\\n\\t\\t\\t\\tsurrenders his slave. If he surrenders him, he is not\\n\\t\\t\\t\\tobliged to do anything other than that. When the owner of\\n\\t\\t\\t\\tthe murdered slave takes the slave who murdered and is\\n\\t\\t\\t\\tsatisifed with him, he must not kill him. All\\n\\t\\t\\t\\tretaliations between slaves for cutting off of the hand\\n\\t\\t\\t\\tand foot and such things are dealt with in the same way\\n\\t\\t\\t\\tas in the murder.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a muslim slave who injures a jew or\\n\\t\\t\\t\\tchristian, \"If the master of the slave wishes to pay\\n\\t\\t\\t\\tblood-money for him according to the injury, he does it.\\n\\t\\t\\t\\tOr else he surrenders him and he is sold, and the jew or\\n\\t\\t\\t\\tchristian is given the blood-money of the injury or all\\n\\t\\t\\t\\tthe price of the slave if the blood-money is greater than\\n\\t\\t\\t\\this price. The jew or christian is not given a muslim\\n\\t\\t\\t\\tslave.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "44",
    "hadithNumber": "2",
    "sectionHeading": "Swearing in Manslaughter",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The way of doing things in\\n\\t\\t\\t\\tour community about Yahya said that Malik said, \"The\\n\\t\\t\\t\\tprocedure in swearing in manslaughter is that those who\\n\\t\\t\\t\\tclaim blood swear and it becomes due by their swearing.\\n\\t\\t\\t\\tThey swear fifty oaths, and there is blood-money for them\\n\\t\\t\\t\\taccording to the division of their inheritances. If it is\\n\\t\\t\\t\\tnot possible to divide up the oaths which they swear\\n\\t\\t\\t\\tbetween them evenly, one looks to the one who has most of\\n\\t\\t\\t\\tthose oaths against him, and that oath is obliged against\\n\\t\\t\\t\\thim.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the slain man only has female heirs, they\\n\\t\\t\\t\\tswear and take the blood-money. If he only has one male\\n\\t\\t\\t\\their, he swears fifty oaths and takes the blood-money.\\n\\t\\t\\t\\tThat is only in the accidental killing, not in the\\n\\t\\t\\t\\tintentional one.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "44",
    "hadithNumber": "2",
    "sectionHeading": "Inheritance in Cases of Qasama",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"When the relatives of the\\n\\t\\t\\t\\tdeceased accept the blood-money then it is inherited\\n\\t\\t\\t\\taccording to the Book of Allah. Daughters of the dead man\\n\\t\\t\\t\\tinherit and so do sisters, and whichever women would\\n\\t\\t\\t\\tinherit from him ordinarily.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIf the women do not take all his inheritance, then what\\n\\t\\t\\t\\tremains goes to the agnatic relations who most deserve to\\n\\t\\t\\t\\tinherit from him in conjunction with the women.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When one of the heirs of a man killed by\\n\\t\\t\\t\\tmistake attempts to take his due from the blood-money\\n\\t\\t\\t\\twhile his companions are absent, he may not do that, and\\n\\t\\t\\t\\the has no right to any of the blood-money, however large\\n\\t\\t\\t\\tor small, unless the qasama has been completed by him. If\\n\\t\\t\\t\\the swears fifty oaths then he has the right to his\\n\\t\\t\\t\\tportion of the blood-money. That is because the\\n\\t\\t\\t\\tblood-money is not established as due without there being\\n\\t\\t\\t\\tfifty oaths, and the blood-money is not established as\\n\\t\\t\\t\\tdue unless the responsibility for the blood is\\n\\t\\t\\t\\testablished. If any one of the heirs comes after that he\\n\\t\\t\\t\\tswears a number of the oaths commensurate with his\\n\\t\\t\\t\\tfraction of the inheritance and takes his right until all\\n\\t\\t\\t\\tthe heirs exact their complete right. If a maternal uncle\\n\\t\\t\\t\\tcomes he has one sixth and must swear one sixth of the\\n\\t\\t\\t\\tfifty oaths. So whoever swears may take his due from the\\n\\t\\t\\t\\tblood-money and whoever abstains annuls his right. If one\\n\\t\\t\\t\\tof the heirs is absent or is a child who has not reached\\n\\t\\t\\t\\tpuberty, those who are present swear fifty oaths and if\\n\\t\\t\\t\\tthe one who was absent comes after that or the child\\n\\t\\t\\t\\treaches puberty, they swear. and they swear according to\\n\\t\\t\\t\\ttheir due of the blood-money and according to their\\n\\t\\t\\t\\tshares of inheritance from it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"This is the best I have\\n\\t\\t\\t\\theard on the matter.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "44",
    "hadithNumber": "2",
    "sectionHeading": "Swearing for Blood-Revenge in Cases Involving Slaves",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"What is done in our\\n\\t\\t\\t\\tcommunity about slaves is that when a slave is struck\\n\\t\\t\\t\\tintentionally or accidentally and the master brings a\\n\\t\\t\\t\\twitness, he swears with his witness one oath and then he\\n\\t\\t\\t\\thas the value of the slave. There is no swearing for\\n\\t\\t\\t\\trevenge in slaves, accidentally or intentionally, and I\\n\\t\\t\\t\\thave not heard any of the people of knowledge say that\\n\\t\\t\\t\\tthere was.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a slave is killed intentionally or\\n\\t\\t\\t\\taccidentally, the master of the slave who is slain has no\\n\\t\\t\\t\\tswearing or oath. The master cannot demand his right\\n\\t\\t\\t\\texcept with a fair proof or a witness if he swears with\\n\\t\\t\\t\\tone witness.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"This is the best of what I\\n\\t\\t\\t\\thave heard on the matter.''\\n\\t\\t\\t</p>"
  }
]
