[
  {
    "SurahNumber": "49",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "I.e., \"do not allow your own desires to have precedence\"."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "This has both a literal and a figurative meaning: literal\\n\\t\\t\\t\\tin the case of the Prophet's Companions, and figurative\\n\\t\\t\\t\\tfor them as well as for believers of later times -\\n\\t\\t\\t\\timplying that one's personal opinions and predilections\\n\\t\\t\\t\\tmust not be allowed to overrule the clear-cut legal\\n\\t\\t\\t\\tordinances and/or moral stipulations promulgated by the\\n\\t\\t\\t\\tProphet (cf.  4:65  and the corresponding note [84])."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "2",
    "NoteID": "3",
    "Body": "I.e., address him, or (in later times) speak of him, with\\n\\t\\t\\t\\tunbecoming familiarity."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "While this relates in the first instance to the Prophet,\\n\\t\\t\\t\\tit may also be taken to apply to any supreme leader of\\n\\t\\t\\t\\tthe community (amir al-mu'minin) who acts as the\\n\\t\\t\\t\\tProphet's successor (khalifah) and rules in his name,\\n\\t\\t\\t\\ti.e., under the aegis of Islamic Law. (As regards the\\n\\t\\t\\t\\tProphet himself, the above exhortation to reverent\\n\\t\\t\\t\\tbehaviour implies, in the view of many outstanding\\n\\t\\t\\t\\tIslamic thinkers, a prohibition to \"call out to him\" when\\n\\t\\t\\t\\tvisiting his tomb.)"
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "I.e., verify the truth before giving credence to any such\\n\\t\\t\\t\\treport or rumour. The tale-bearer is characterized as\\n\\t\\t\\t\\t\"iniquitous\" because the very act of spreading\\n\\t\\t\\t\\tunsubstantiated rumours affecting the reputation of other\\n\\t\\t\\t\\tpersons constitutes a spiritual offence."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "6",
    "NoteID": "6",
    "Body": "Thus, after laying stress in the preceding verses on the\\n\\t\\t\\t\\treverence due to God's message-bearer - and, by\\n\\t\\t\\t\\timplication, to every righteous leader of the community -\\n\\t\\t\\t\\tthe discourse turns to the moral imperative of\\n\\t\\t\\t\\tsafeguarding the honour and reputation of every member of\\n\\t\\t\\t\\tthe community, man and woman alike. This principle is\\n\\t\\t\\t\\ttaken up, more explicitly, in verse {12}."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "7",
    "NoteID": "7",
    "Body": "Sc., \"and he ought to be an example for you as regards\\n\\t\\t\\t\\tyour behaviour towards one another\": i.e., he would not\\n\\t\\t\\t\\taccept rashly a hearsay tale affecting the honour of\\n\\t\\t\\t\\tthird persons, but would either refuse to listen to it\\n\\t\\t\\t\\taltogether or, should a clarification become necessary in\\n\\t\\t\\t\\tthe interests of the community, would insist on\\n\\t\\t\\t\\tascertaining the truth objectively."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "7",
    "NoteID": "8",
    "Body": "Lit., \"in many a case (amr)\": the implication being that,\\n\\t\\t\\t\\tmore often than not, man is prone to give credence to\\n\\t\\t\\t\\tmalicious rumours devoid of any real evidence."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "9",
    "NoteID": "9",
    "Body": "The expression \"fighting\" comprises in this context all\\n\\t\\t\\t\\tmodes of discord and contention, both in word and deed,\\n\\t\\t\\t\\tevidently as a consequence of the slanderous rumours\\n\\t\\t\\t\\tspoken of in verse {6} above."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "9",
    "NoteID": "10",
    "Body": "I.e., that the believers should act as brethren (see next\\n\\t\\t\\t\\tverse)."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "10",
    "NoteID": "11",
    "Body": "The plural noun ikhwah (\"brethren\" or \"brotherhood\") has\\n\\t\\t\\t\\there, of course, a purely ideological connotation,\\n\\t\\t\\t\\tcomprising men and women alike; the same applies to the\\n\\t\\t\\t\\tsubsequent mention of \"your two brethren\"."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "11",
    "NoteID": "12",
    "Body": "The implication is that believers, whether men or women,\\n\\t\\t\\t\\tshall never deride one another (Zamakhshari, Baydawi)."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "11",
    "NoteID": "13",
    "Body": "This applies no less to the faith of the one who insults\\n\\t\\t\\t\\tthan to that of the insulted (Razi): cf.  6:82  -\\n\\t\\t\\t\\t\"[those] who have not obscured their faith by\\n\\t\\t\\t\\twrongdoing\"."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "12",
    "NoteID": "14",
    "Body": "I.e., guesswork that may lead to unfounded suspicion of\\n\\t\\t\\t\\tanother person's motives: see note [22] on  24:19 ."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "13",
    "NoteID": "15",
    "Body": "I.e., \"We have created every one of you out of a father\\n\\t\\t\\t\\tand a mother\"  (Zamakhshari, Razi, Baydawi) - implying\\n\\t\\t\\t\\tthat this equality of biological origin is reflected in\\n\\t\\t\\t\\tthe equality of the human dignity common to all."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "13",
    "NoteID": "16",
    "Body": "I.e., know that all belong to one human family, without\\n\\t\\t\\t\\tany inherent s uperiority of one over another\\n\\t\\t\\t\\t(Zamakhshari). This connects with the exhortation, in the\\n\\t\\t\\t\\tpreceding two verses, to respect and safeguard each\\n\\t\\t\\t\\tother's dignity. In other words, men's evolution into\\n\\t\\t\\t\\t\"nations and tribes\" is meant to foster rather than to\\n\\t\\t\\t\\tdiminish their mutual desire to understand and appreciate\\n\\t\\t\\t\\tthe essential human oneness underlying their outward\\n\\t\\t\\t\\tdifferentiations; and, correspondingly, all racial,\\n\\t\\t\\t\\tnational or tribal prejudice ('asabiyyah) is condemned -\\n\\t\\t\\t\\timplicitly in the Qur'an, and most explicitly by the\\n\\t\\t\\t\\tProphet (see second half of note [15] on  28:15 ). In\\n\\t\\t\\t\\taddition, speaking of people's boasting of their national\\n\\t\\t\\t\\tor tribal past, the Prophet said: \"Behold, God has\\n\\t\\t\\t\\tremoved from you the arrogance of pagan ignorance\\n\\t\\t\\t\\t(jahiliyyah) with its boast of ancestral glories. Man is\\n\\t\\t\\t\\tbut a God-conscious believer or an unfortunate sinner.\\n\\t\\t\\t\\tAll people are children of Adam, and Adam was created out\\n\\t\\t\\t\\tof dust.\" (Fragment of a hadith quoted by Tirmidhi and\\n\\t\\t\\t\\tAbu Da'ud, on the authority of Abu Hurayrah.)"
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "14",
    "NoteID": "17",
    "Body": "Inasmuch as this is evidently an allusion to the intense\\n\\t\\t\\t\\ttribalism of the bedouin and their \"pride of descent\"\\n\\t\\t\\t\\t(Razi), the above verse connects with the preceding\\n\\t\\t\\t\\tcondemnation of all tribal preferences and prejudices,\\n\\t\\t\\t\\tand with the call for their abandonment as a prerequisite\\n\\t\\t\\t\\tof true faith. Primarily, this relates to the bedouin\\n\\t\\t\\t\\tcontemporaries of the Prophet, but its import is general\\n\\t\\t\\t\\tand timeless."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "14",
    "NoteID": "18",
    "Body": "I.e., \"your own deeds, in distinction from the supposed\\n\\t\\t\\t\\t'glorious deeds' of your ancestors, which count for\\n\\t\\t\\t\\tnothing in His sight\"."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "15",
    "NoteID": "19",
    "Body": "Lit., \"and thereafter have had no doubt\"."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "16",
    "NoteID": "20",
    "Body": "Like the preceding passage, this, too, is addressed in\\n\\t\\t\\t\\tthe first instance to certain contemporaries of the\\n\\t\\t\\t\\tProphet, but its meaning extends to all people, at all\\n\\t\\t\\t\\ttimes, who think that their mere profession of faith and\\n\\t\\t\\t\\toutward adherence to its formalities makes them\\n\\t\\t\\t\\t\"believers\"."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "17",
    "NoteID": "21",
    "Body": "Lit., \"They\" (see preceding note)."
  },
  {
    "SurahNumber": "49",
    "AyahNumber": "17",
    "NoteID": "22",
    "Body": "I.e., \"by professing to be thy followers\"."
  }
]
