[
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "1",
    "Text": "All praise is for Allah, the Originator of the heavens and the earth, Who made angels &#761;as His&#762; messengers with wings&mdash;two, three, or four. He increases in creation whatever He wills. Surely Allah is Most Capable of everything."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "2",
    "Text": "Whatever mercy Allah opens up for people, none can withhold it. And whatever He withholds, none but Him can release it. For He is the Almighty, All-Wise."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "3",
    "Text": "O humanity! Remember Allah&rsquo;s favours upon you. Is there any creator other than Allah who provides for you from the heavens and the earth? There is no god &#761;worthy of worship&#762; except Him. How can you then be deluded &#761;from the truth&#762;?"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "4",
    "Text": "If you are rejected by them, so too were messengers before you. And to Allah &#761;all&#762; matters will be returned &#761;for judgment&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "5",
    "Text": "O humanity! Indeed, Allah&rsquo;s promise is true. So do not let the life of this world deceive you, nor let the Chief Deceiver<span class='fn' foot_note=29681>1</span>&nbsp;deceive you about Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "6",
    "Text": "Surely Satan is an enemy to you, so take him as an enemy. He only invites his followers to become inmates of the Blaze."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "7",
    "Text": "Those who disbelieve will have a severe punishment. But those who believe and do good will have forgiveness and a great reward."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "8",
    "Text": "Are those whose evil-doing is made so appealing to them that they deem it good &#761;like those who are rightly guided&#762;? &#761;It is&#762; certainly Allah &#761;Who&#762; leaves to stray whoever He wills, and guides whoever He wills. So do not grieve yourself to death over them &#761;O Prophet&#762;. Surely Allah is All-Knowing of what they do."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "9",
    "Text": "And it is Allah Who sends the winds, which then stir up &#761;vapour, forming&#762; clouds, and then We drive them to a lifeless land, giving life to the earth after its death. Similar is the Resurrection."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "10",
    "Text": "Whoever seeks honour and power, then &#761;let them know that&#762; all honour and power belongs to Allah. To Him &#761;alone&#762; good words ascend, and righteous deeds are raised up by Him. As for those who plot evil, they will suffer a severe punishment. And the plotting of such &#761;people&#762; is doomed &#761;to fail&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "11",
    "Text": "And &#761;it is&#762; Allah &#761;Who&#762; created you from dust,<span class='fn' foot_note=29682>1</span>&nbsp;then &#761;developed you&#762; from a sperm-drop, then made you into pairs.<span class='fn' foot_note=29683>2</span>&nbsp;No female ever conceives or delivers without His knowledge. And no one&rsquo;s life is made long or cut short but is &#761;written&#762; in a Record.<span class='fn' foot_note=29684>3</span>&nbsp;That is certainly easy for Allah."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "12",
    "Text": "The two bodies of water are not alike: one is fresh, palatable, and pleasant to drink and the other is salty and bitter. Yet from them both you eat tender seafood and extract ornaments to wear. And you see the ships ploughing their way through both, so you may seek His bounty and give thanks &#761;to Him&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "13",
    "Text": "He merges the night into the day and the day into the night, and has subjected the sun and the moon, each orbiting for an appointed term. That is Allah&mdash;your Lord! All authority belongs to Him. But those &#761;idols&#762; you invoke besides Him do not possess even the skin of a date stone."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "14",
    "Text": "If you call upon them, they cannot hear your calls. And if they were to hear, they could not respond to you. On the Day of Judgment they will disown your worship &#761;of them&#762;. And no one can inform you &#761;O Prophet&#762; like the All-Knowledgeable."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "15",
    "Text": "O humanity! It is you who stand in need of Allah, but Allah &#761;alone&#762; is the Self-Sufficient, Praiseworthy."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "16",
    "Text": "If He willed, He could eliminate you and produce a new creation."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "17",
    "Text": "And that is not difficult for Allah &#761;at all&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "18",
    "Text": "No soul burdened with sin will bear the burden of another. And if a sin-burdened soul cries for help with its burden, none of it will be carried&mdash;even by a close relative. You &#761;O Prophet&#762; can only warn those who stand in awe of their Lord without seeing Him<span class='fn' foot_note=29685>1</span>&nbsp;and establish prayer. Whoever purifies themselves, they only do so for their own good. And to Allah is the final return."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "19",
    "Text": "Those blind &#761;to the truth&#762; and those who can see are not equal,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "20",
    "Text": "nor are the darkness and the light,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "21",
    "Text": "nor the &#761;scorching&#762; heat and the &#761;cool&#762; shade.<span class='fn' foot_note=29686>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "22",
    "Text": "Nor are the dead and the living equal. Indeed, Allah &#761;alone&#762; makes whoever He wills hear, but you &#761;O Prophet&#762; can never make those in the graves hear &#761;your call&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "23",
    "Text": "You are only a warner."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "24",
    "Text": "We have surely sent you with the truth as a deliverer of good news and a warner. There is no community that has not had a warner.<span class='fn' foot_note=29687>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "25",
    "Text": "If they deny you, so did those before them. Their messengers came to them with clear proofs, divine Books, and enlightening Scriptures.<span class='fn' foot_note=29688>1</span>"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "26",
    "Text": "Then I seized those who persisted in disbelief. How severe was My response!"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "27",
    "Text": "Do you not see that Allah sends down rain from the sky with which We bring forth fruits of different colours? And in the mountains are streaks of varying shades of white, red, and raven black;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "28",
    "Text": "just as people, living beings, and cattle are of various colours as well. Of all of Allah&rsquo;s servants, only the knowledgeable &#761;of His might&#762; are &#761;truly&#762; in awe of Him. Allah is indeed Almighty, All-Forgiving."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "29",
    "Text": "Surely those who recite the Book of Allah, establish prayer, and donate from what We have provided for them&mdash;secretly and openly&mdash;&#761;can&#762; hope for an exchange that will never fail,"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "30",
    "Text": "so that He will reward them in full and increase them out of His grace. He is truly All-Forgiving, Most Appreciative."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "31",
    "Text": "The Book We have revealed to you &#761;O Prophet&#762; is the truth, confirming what came before it.<span class='fn' foot_note=29689>1</span>&nbsp;Surely Allah is All-Aware, All-Seeing of His servants."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "32",
    "Text": "Then We granted the Book to those We have chosen from Our servants. Some of them wrong themselves, some follow a middle course, and some are foremost in good deeds by Allah&rsquo;s Will. That is &#761;truly&#762; the greatest bounty."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "33",
    "Text": "They will enter the Gardens of Eternity, where they will be adorned with bracelets of gold and pearls, and their clothing will be silk."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "34",
    "Text": "And they will say, &ldquo;Praise be to Allah, Who has kept away from us all &#761;causes of&#762; sorrow. Our Lord is indeed All-Forgiving, Most Appreciative."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "35",
    "Text": "&#761;He is the One&#762; Who&mdash;out of His grace&mdash;has settled us in the Home of Everlasting Stay, where we will be touched by neither fatigue nor weariness.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "36",
    "Text": "As for the disbelievers, they will have the Fire of Hell, where they will not be &#761;allowed to be&#762; finished by death, nor will its torment be lightened for them. This is how We reward every &#761;stubborn&#762; disbeliever."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "37",
    "Text": "There they will be &#761;fervently&#762; screaming, &ldquo;Our Lord! Take us out &#761;and send us back&#762;. We will do good, unlike what we used to do.&rdquo; &#761;They will be told,&#762; &ldquo;Did We not give you lives long enough so that whoever wanted to be mindful could have done so? And the warner came to you. So taste &#761;the punishment&#762;, for the wrongdoers have no helper.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "38",
    "Text": "Indeed, Allah is the Knower of the unseen of the heavens and the earth. He surely knows best what is &#761;hidden&#762; in the heart."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "39",
    "Text": "He is the One Who has placed you as successors on earth. So whoever disbelieves will bear &#761;the burden of&#762; their own disbelief. The disbelievers&rsquo; denial only increases them in contempt in the sight of their Lord, and it will only contribute to their loss."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "40",
    "Text": "Ask &#761;them, O &nbsp;Prophet&#762;, &ldquo;Have you considered your associate-gods which you invoke besides Allah? Show me what they have created on earth! Or do they have a share in &#761;the creation of&#762; the heavens? Or have We given the polytheists a Book, which serves as a clear proof for them? In fact, the wrongdoers promise each other nothing but delusion.&rdquo;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "41",
    "Text": "Indeed, Allah &#761;alone&#762; keeps the heavens and the earth from falling apart. If they were to fall apart, none but Him could hold them up. He is truly Most Forbearing, All-Forgiving."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "42",
    "Text": "They swore by Allah their most solemn oaths that if a warner were to come to them, they would certainly be better guided than any other community. Yet when a warner did come to them, it only drove them farther away&mdash;"
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "43",
    "Text": "behaving arrogantly in the land and plotting evil. But evil plotting only backfires on those who plot. Are they awaiting anything but the fate of those &#761;destroyed&#762; before? You will find no change in the way of Allah, nor will you find it diverted &#761;to someone else&#762;."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "44",
    "Text": "Have they not travelled throughout the land to see what was the end of those &#761;destroyed&#762; before them? They were far superior in might. But there is nothing that can escape Allah in the heavens or the earth. He is certainly All-Knowing, Most Capable."
  },
  {
    "BookCode": "MKT",
    "SurahNumber": "35",
    "AyahNumber": "45",
    "Text": "If Allah were to punish people &#761;immediately&#762; for what they have committed, He would not have left a single living being on earth. But He delays them for an appointed term. And when their time arrives, then surely Allah is All-Seeing of His servants."
  }
]
