[
  {
    "SurahNumber": "113",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "The term al-falaq (\"the light of dawn\" or \"the rising\\n\\t\\t\\t\\tdawn\") is often used tropically to describe \"the\\n\\t\\t\\t\\temergence of the truth after [a period of] uncertainty\"\\n\\t\\t\\t\\t(Taj al-'Arus): hence, the appellation \"Sustainer of the\\n\\t\\t\\t\\trising dawn\" implies that God is the source of all\\n\\t\\t\\t\\tcognition of truth, and that one's \"seeking refuge\" with\\n\\t\\t\\t\\tHim is synonymous with striving after truth."
  },
  {
    "SurahNumber": "113",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "I.e., the darkness of despair, or of approaching death.\\n\\t\\t\\t\\tIn all these four verses ({2-5}), the term \"evil\" (sharr)\\n\\t\\t\\t\\thas not only an objective but also a subjective\\n\\t\\t\\t\\tconnotation - namely, fear of evil."
  },
  {
    "SurahNumber": "113",
    "AyahNumber": "4",
    "NoteID": "3",
    "Body": "Lit., \"of those that blow (an-naffathat) upon knots\": an\\n\\t\\t\\t\\tidiomatic phrase current in pre-Islamic Arabia and,\\n\\t\\t\\t\\thence, employed in classical Arabic to designate all\\n\\t\\t\\t\\tsupposedly occult endeavours; it was probably derived\\n\\t\\t\\t\\tfrom the practice of \"witches\" and \"sorcerers\" who used\\n\\t\\t\\t\\tto tie a string into a number of knots while blowing upon\\n\\t\\t\\t\\tthem and murmuring magic incantations. The feminine\\n\\t\\t\\t\\tgender of naffathat does not, as Zamakhshari and Razi\\n\\t\\t\\t\\tpoint out, necessarily indicate \"women\", but may well\\n\\t\\t\\t\\trelate to \"human beings\" (anfus, sing. nafs, a noun that\\n\\t\\t\\t\\tis grammatically feminine). In his explanation of the\\n\\t\\t\\t\\tabove verse, Zamakhshari categorically rejects all belief\\n\\t\\t\\t\\tin the reality and effectiveness of such practices, as\\n\\t\\t\\t\\twell as of the concept of \"magic\" as such. Similar views\\n\\t\\t\\t\\thave been expressed - albeit in a much more elaborate\\n\\t\\t\\t\\tmanner, on the basis of established psychological\\n\\t\\t\\t\\tfindings - by Muhammad 'Abduh and Rashid Rida' (see Manar\\n\\t\\t\\t\\tI, 398 ff.). The reason why the believer is enjoined to\\n\\t\\t\\t\\t\"seek refuge with God\" from such practices despite their\\n\\t\\t\\t\\tpalpable irrationality is - according to Zamakhshari - to\\n\\t\\t\\t\\tbe found in the inherent sinfulness of such endeavours\\n\\t\\t\\t\\t(see surah {2}, note [84]), and in the mental danger in\\n\\t\\t\\t\\twhich they may involve their author."
  },
  {
    "SurahNumber": "113",
    "AyahNumber": "5",
    "NoteID": "4",
    "Body": "I.e., from the effects - moral and social - which another\\n\\t\\t\\t\\tperson's envy may have on one's life, as well as from\\n\\t\\t\\t\\tsuccumbing oneself to the evil of envy. In this\\n\\t\\t\\t\\tconnection, Zamakhshari quotes a saying of the Caliph\\n\\t\\t\\t\\t'Umar ibn 'Abd al-'Aziz (called \"the Second 'Umar\" on\\n\\t\\t\\t\\taccount of his piety and integrity): \"I cannot think of\\n\\t\\t\\t\\tany wrongdoer (zalim) who is more likely to be the\\n\\t\\t\\t\\twronged one (mazlum) than he who envies another.\""
  }
]
