[
  {
    "SurahNumber": "63",
    "AyahNumber": "1",
    "NoteID": "5466",
    "Body": "The hypocrite element, if one exists in any society, is a\\n\\t\\t\\t\\tsource of weakness and a danger to its health and its\\n\\t\\t\\t\\tvery existence. When the holy Prophet came to Madinah in\\n\\t\\t\\t\\tHijrat, his arrival was welcome to all the patriotic\\n\\t\\t\\t\\tcitizens: it not only united them in common life and\\n\\t\\t\\t\\thealed their old differences, but it brought honour and\\n\\t\\t\\t\\tlight to them in the person of the greatest living\\n\\t\\t\\t\\tProphet. But there were some baser elements filled with\\n\\t\\t\\t\\tenvy. Such hopes as they had entertained of attaining\\n\\t\\t\\t\\tpower and leadership by playing on the animosities of the\\n\\t\\t\\t\\tfactions were now dashed to the ground. They now began to\\n\\t\\t\\t\\twork underground. For fear of the majority they dared not\\n\\t\\t\\t\\toppose the new growing Brotherhood of Righteousness. They\\n\\t\\t\\t\\ttried to undermine it by intriguing secretly with its\\n\\t\\t\\t\\tenemies and swearing openly its loyalty to the holy\\n\\t\\t\\t\\tProphet. They were thoroughly unmasked and discredited at\\n\\t\\t\\t\\tthe battle of Uhud. See iii. 167, and n. 476."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "2",
    "NoteID": "5467",
    "Body": "Cf. lviii. 16 and n. 5358. When they say that Muhammad is\\n\\t\\t\\t\\tthe Prophet of Allah, it is Allah's own truth: but what\\n\\t\\t\\t\\tis in their hearts? Nothing but falsehood."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "3",
    "NoteID": "5468",
    "Body": "Cf. ii. 7. Their double-dealing has fogged their\\n\\t\\t\\t\\tunderstanding. In Arabic the heart is taken to be the\\n\\t\\t\\t\\tseat of understanding as well as of affection."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "4",
    "NoteID": "5468",
    "Body": "Cf. ii. 7. Their double-dealing has fogged their\\n\\t\\t\\t\\tunderstanding. In Arabic the heart is taken to be the\\n\\t\\t\\t\\tseat of understanding as well as of affection."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "4",
    "NoteID": "5470",
    "Body": "Good timber is strong in itself and can support roofs and\\n\\t\\t\\t\\tbuildings. Hollow timber is useless, and has to be\\n\\t\\t\\t\\tpropped up against other things. The Hypocrites are like\\n\\t\\t\\t\\trotten timber. They have no firm character themselves,\\n\\t\\t\\t\\tand for others they are unsafe props to rely upon."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "4",
    "NoteID": "5471",
    "Body": "Their conscience always troubles them. If any cry is\\n\\t\\t\\t\\traised, they immediately get alarmed, and think it is\\n\\t\\t\\t\\tagainst themselves. Such men are worse than open enemies."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "5",
    "NoteID": "5472",
    "Body": "Even hypocrisy like other sins can be forgiven by\\n\\t\\t\\t\\trepentance and amendment, provided there is a will and\\n\\t\\t\\t\\tearnest desire to turn from evil and seek the Grace of\\n\\t\\t\\t\\tAllah. In this case there was none."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "6",
    "NoteID": "5473",
    "Body": "The stiff-necked rejecters of Allah's Truth have made a\\n\\t\\t\\t\\twide gulf between themselves and Allah's Grace. No prayer\\n\\t\\t\\t\\tfor them will help them. In the attitude of rebellion and\\n\\t\\t\\t\\ttransgression they cannot obtain Allah's forgiveness."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "7",
    "NoteID": "5474",
    "Body": "The Muhajirun, who had come to be with the holy Prophet\\n\\t\\t\\t\\tin Madinah in exile, were received, helped, entertained\\n\\t\\t\\t\\tby the Ansar (Helpers). The Hypocrites in Madinah did not\\n\\t\\t\\t\\tlike this, and tried in underhand ways to dissuade the\\n\\t\\t\\t\\tgood folk of Madinah from doing all they could for the\\n\\t\\t\\t\\texiles. But their tricks did not succeed. The small\\n\\t\\t\\t\\tMuslim communirty grew from strength to strength until\\n\\t\\t\\t\\tthey were able to stand on their own resources and\\n\\t\\t\\t\\tgreatly to augment the resources of their hosts as well.\\n\\t\\t\\t\\tIt is goodness that produces strength and prosperity, and\\n\\t\\t\\t\\tAllah holds the keys of the treasures of man's\\n\\t\\t\\t\\twell-being. It is not for Allah's enemies to dole out or\\n\\t\\t\\t\\twithhold the unbounded treasures of Allah."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "8",
    "NoteID": "5475",
    "Body": "Words of this import were spoken by 'Abdullah ibn Ubai,\\n\\t\\t\\t\\tthe leader of the Madinah Hypocrites, to or about the\\n\\t\\t\\t\\tExiles, in the course of the expedition against the Banu\\n\\t\\t\\t\\tMustaliq in the fourth or fifth year of the Hijra. He had\\n\\t\\t\\t\\thopes of leadership which were disappointed by the coming\\n\\t\\t\\t\\tto Madinah of a man far greater than he. So he arrogated\\n\\t\\t\\t\\tto himself and his clique the title of \"the more\\n\\t\\t\\t\\thonourable (element)\" and slightingly spoke of the\\n\\t\\t\\t\\tEmigrants as the \"meaner\" element that had intruded from\\n\\t\\t\\t\\toutside."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "9",
    "NoteID": "5476",
    "Body": "Riches and human resources of all kinds are but fleeting\\n\\t\\t\\t\\tsources of enjoyment. They should not turn away the good\\n\\t\\t\\t\\tman from his devotion to Allah. \"Remembrance of Allah\"\\n\\t\\t\\t\\tincludes every act of service and goodness, every kind\\n\\t\\t\\t\\tthought and kind deed, for this is the service and\\n\\t\\t\\t\\tsacrifice which Allah requires of us. If we fail in this,\\n\\t\\t\\t\\tthe loss is our own, not any one else's: for it stunts\\n\\t\\t\\t\\tour own spiritual growth."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "10",
    "NoteID": "5477",
    "Body": "\"Substance\" or \"Sustenance\". Whatever good we enjoy comes\\n\\t\\t\\t\\tfrom Allah, and it is our duty to use some of it in the\\n\\t\\t\\t\\tservice of others, for that is Charity and the service of\\n\\t\\t\\t\\tAllah. Every unselfish act is Charity. And we must not\\n\\t\\t\\t\\tpostpone our good resolutions to the future. Death may\\n\\t\\t\\t\\tcome suddenly on us, and we cannot then be allowed to\\n\\t\\t\\t\\tplead for more time. Every present moment calls urgently\\n\\t\\t\\t\\tfor its good deed."
  },
  {
    "SurahNumber": "63",
    "AyahNumber": "11",
    "NoteID": "5478",
    "Body": "When our limited period of probation is over, we cannot\\n\\t\\t\\t\\tjustly ask for more time, nor will more time be given to\\n\\t\\t\\t\\tus then. Procrastination is itself a fault, and Allah\\n\\t\\t\\t\\tknows every hidden thought and motive in our minds."
  }
]
