[
  {
    "SurahNumber": "18",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Lit., \"and has not given it any deviousness\". The term\\n\\t\\t\\t\\t'iwaj signifies \"crookedness\", \"tortuousness\" or\\n\\t\\t\\t\\t\"deviation\" (e.g., from a path), as well as \"distortion\"\\n\\t\\t\\t\\tor \"deviousness\" in the abstract sense of these words.\\n\\t\\t\\t\\tThe above phrase is meant to establish the direct,\\n\\t\\t\\t\\tunambiguous character of the Qur’an and to stress its\\n\\t\\t\\t\\tfreedom from all obscurities and internal contradictions:\\n\\t\\t\\t\\tcf.  4:82 - \"Had it issued from any but God, they would\\n\\t\\t\\t\\tsurely have found in it many an inner contradiction!\""
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "5",
    "NoteID": "2",
    "Body": "Most of the classical commentators (and, as far as I am\\n\\t\\t\\t\\taware, all the earlier translators of the Qur'an) relate\\n\\t\\t\\t\\tthe pronoun in bihi to the assertion that \"God has taken\\n\\t\\t\\t\\tunto Himself a son\", and hence take the phrase to mean,\\n\\t\\t\\t\\t\"They have no knowledge of it\", i.e., no knowledge of\\n\\t\\t\\t\\tsuch a happening. However, this interpretation is weak\\n\\t\\t\\t\\tinasmuch as absence of knowledge does not necessarily\\n\\t\\t\\t\\timply an objective negation of the fact to which it\\n\\t\\t\\t\\trelates. It is, therefore, obvious that bihi cannot\\n\\t\\t\\t\\tsignify \"of it\": it signifies \"of Him\", and relates to\\n\\t\\t\\t\\tGod. Hence, the phrase must be rendered as above -\\n\\t\\t\\t\\tmeaning that they who make such a preposterous claim have\\n\\t\\t\\t\\tno real knowledge of Him, since they attribute to the\\n\\t\\t\\t\\tSupreme Being something that is attributable only to\\n\\t\\t\\t\\tcreated, imperfect beings. This interpretation is\\n\\t\\t\\t\\tsupported, in an unequivocal manner, by Tabari and, as an\\n\\t\\t\\t\\talternative, by Baydawi."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "6",
    "NoteID": "3",
    "Body": "Lit., \"it may well be that thou wilt...\", etc. However,\\n\\t\\t\\t\\tthe particle la'alla does not, in this context, indicate\\n\\t\\t\\t\\ta possibility but, rather, a rhetorical question implying\\n\\t\\t\\t\\ta reproach for the attitude referred to (Maraghi XIII,\\n\\t\\t\\t\\t116)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "6",
    "NoteID": "4",
    "Body": "This rhetorical question is addressed, in the first\\n\\t\\t\\t\\tinstance, to the Prophet, who was deeply distressed by\\n\\t\\t\\t\\tthe hostility which his message aroused among the pagan\\n\\t\\t\\t\\tMeccans, and suffered agonies of apprehension regarding\\n\\t\\t\\t\\ttheir spiritual fate. Beyond that, however, it applies to\\n\\t\\t\\t\\teveryone who, having become convinced of the truth of an\\n\\t\\t\\t\\tethical proposition, is dismayed at the indifference with\\n\\t\\t\\t\\twhich his social environment reacts to it."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "Lit., \"We have made all that exists on earth as its\\n\\t\\t\\t\\tadornment in order that We might put them [i.e., all\\n\\t\\t\\t\\thuman beings] to a test\": meaning that God lets them\\n\\t\\t\\t\\treveal their real characters in their respective\\n\\t\\t\\t\\tattitudes - moral or immoral - towards the material goods\\n\\t\\t\\t\\tand benefits which the world offers them. In further\\n\\t\\t\\t\\tanalysis, this passage implies that the real motive\\n\\t\\t\\t\\tunderlying men's refusal to believe in God's spiritual\\n\\t\\t\\t\\tmessage (see preceding verse) is almost always their\\n\\t\\t\\t\\texcessive, blind attachment to the good of this world,\\n\\t\\t\\t\\tcombined with a false pride in what they regard as their\\n\\t\\t\\t\\town achievements (cf.  16:22  and the corresponding note\\n\\t\\t\\t\\t[15])."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "9",
    "NoteID": "6",
    "Body": "This interpolation establishes the elliptically implied\\n\\t\\t\\t\\tconnection between the long passage that follows and the\\n\\t\\t\\t\\tpreceding two verses."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "9",
    "NoteID": "7",
    "Body": "Lit., \"that the Men of the Cave... were more wondrous...\", etc. - the implication being that the allegory or parable based on this story is entirely in tune with the ethical doctrine propounded in the Qur'an as a whole, and therefore not \"more wondrous\" than any other of its statements. - As regards the story of the Men of the Cave as such, most of the commentators incline to the view that it relates to a phase in early Christian history - namely, the persecution of the Christians by Emperor Decius in the third century. Legend has it that some young Christians of Ephesus, accompanied by their dog, withdrew into a secluded cave in order to be able to live in accordance with their faith, and remained there, miraculously asleep for a great length of time (according to some accounts, referred to in verse 25 of this surah, for about three centuries). When they finally awoke - unaware of the long time during which they had lain asleep - they sent one of their company to the town to purchase some food. In the meantime the situation had changed entirely: Christianity was no longer persecuted and had even become the official religion of the Roman Empire. The ancient coin (dating from the reign of Decius) with which the young man wanted to pay for his purchases immediately aroused curiosity; people began to question the stranger, and the story of the Men of the Cave and their miraculous sleep came to light.\n\nAs already mentioned, the majority of the classical commentators rely on this Christian legend in their endeavour to interpret the Qur'anic reference (in verses {9-26}) to the Men of the Cave. It seems, however, that the Christian formulation of this theme is a later development of a much older oral tradition - a tradition which, in fact, goes back to pre-Christian, Jewish sources. This is evident from several well-authenticated ahadith (mentioned by all the classical commentators), according to which it was the Jewish rabbis (ahbar) of Medina who induced the Meccan opponents of Muhammad to \"test his veracity\" by asking him to explain, among other problems, the story of the Men of the Cave.\n\nReferring to these ahadith, Ibn Kathir remarks in his commentary on verse {13} of this surah: \"It has been said that they were followers of Jesus the son of Mary, but God knows it better: it is obvious that they lived much earlier than the Christian period - for, had they been Christians, why should the Jewish rabbis have been intent on preserving their story, seeing that the Jews had cut themselves off from all friendly communion with them [i.e., the Christians]?\" We may, therefore, safely assume that the legend of the Men of the Cave - stripped of its Christian garb and the superimposed Christian background - is, substantially, of Jewish origin. If we discard the later syncretic additions and reduce the story to its fundamentals - voluntary withdrawal from the world, agelong \"sleep\" in a secluded cave and a miraculous \"awakening\" after an indeterminate period of time - we have before us a striking allegory relating to a movement which played an important role in Jewish religious history during the centuries immediately preceding and following the advent of Jesus: namely, the ascetic Essene Brotherhood (to which, as I have pointed out in note [42] on 3:52, Jesus himself may have belonged), and particularly that of its branches which lived in self-imposed solitude in the vicinity of the Dead Sea and has recently, after the discovery of the Dead Sea Scrolls, come to be known as the \"Qumran community\". The expression ar-raqim occurring in the above Qur'an-verse (and rendered by me as \"scriptures\") lends strong support to this theory. As recorded by Tabari, some of the earliest authorities - and particularly Ibn 'Abbas - regarded this expression as synonymous with marqum (\"something that is written\") and hence with kitab (\"a writ\" or \"a scripture\"); and Razi adds that \"all rhetoricians and Arabic philologists assert that ar-raqim signifies [the same as] al-kitab\". Since it is historically established that the members of the Qumran community - the strictest group among the Essenes - devoted themselves entirely to the study, the copying and the preservation of the sacred scriptures, and since they lived in complete seclusion from the rest of the world and were highly admired for their piety and moral purity, it is more than probable that their mode of life made so strong an impression on the imagination of their more worldly co-religionists that it became gradually allegorized in the story of the Men of the Cave who \"slept\" – that is, were cut off from the outside world - for countless years, destined to be \"awakened\" after their spiritual task was done.\n\nBut whatever the source of this legend, and irrespective of whether it is of Jewish or Christian origin, the fact remains that it is used in the Qur'an in a purely parabolic sense: namely, as an illustration of God's power to bring about death (or \"sleep\") and resurrection (or \"awakening\"); and, secondly, as an allegory of the piety that induces men to abandon a wicked or frivolous world in order to keep their faith unsullied, and of God's recognition of that faith by His bestowal of a spiritual awakening which transcends time and death."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "10",
    "NoteID": "8",
    "Body": "Lit., \"and provide for us, out of our condition (min\\n\\t\\t\\t\\tamrina), consciousness of what is right\" - which latter\\n\\t\\t\\t\\tphrase gives the meaning of the term rushd in this\\n\\t\\t\\t\\tcontext. This passage is a kind of introduction to the\\n\\t\\t\\t\\tallegory of the Men of the Cave, giving a broad outline\\n\\t\\t\\t\\tof what is expounded more fully in verses {13} ff."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "11",
    "NoteID": "9",
    "Body": "I.e., God caused them to remain cut off - physically or\\n\\t\\t\\t\\tmetaphorically - from the sounds and the bustle of the\\n\\t\\t\\t\\toutside world. The classical commentators take the above\\n\\t\\t\\t\\tphrase to mean that God \"veiled their ears with sleep\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "12",
    "NoteID": "10",
    "Body": "Or: \"sent them forth\" - which may indicate a return to\\n\\t\\t\\t\\tthe active life of this world."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "12",
    "NoteID": "11",
    "Body": "Lit., \"so that We might take cognizance of\": but since\\n\\t\\t\\t\\tGod embraces all past, present and future with His\\n\\t\\t\\t\\tknowledge, His \"taking cognizance\" of an event denotes\\n\\t\\t\\t\\tHis causing it to come into being and, thus, allowing it\\n\\t\\t\\t\\tto become known by His creatures: hence, \"marking it out\"\\n\\t\\t\\t\\tto the world."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "12",
    "NoteID": "12",
    "Body": "Lit., \"which of the two parties\" - alluding,\\n\\t\\t\\t\\tmetonymically, to the two viewpoints mentioned in verse\\n\\t\\t\\t\\t{19} below - \"was better at computing the time-span.. .\",\\n\\t\\t\\t\\tetc.: it should, however, be borne in mind that the verb\\n\\t\\t\\t\\tahsa does not merely signify \"he computed\" or \"reckoned\",\\n\\t\\t\\t\\tbut also \"he understood\" or \"comprehended\" (Taj\\n\\t\\t\\t\\tal~'Arus). Since a \"computing\" of the time which those\\n\\t\\t\\t\\tseekers after truth had spent in the cave could have no\\n\\t\\t\\t\\tparticular bearing on the ethical implications of this\\n\\t\\t\\t\\tparable, ahsa has here obviously the meaning of \"better\\n\\t\\t\\t\\tat comprehending\" or \"showing a better comprehension\" -\\n\\t\\t\\t\\tnamely, of the spiritual meaning of the time-lapse\\n\\t\\t\\t\\tbetween their \"falling asleep\" and their \"awakening\" (see\\n\\t\\t\\t\\tnote [25] below)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "13",
    "NoteID": "13",
    "Body": "I.e., without the many legendary embellishments which, in\\n\\t\\t\\t\\ttimes past, have obscured the purport of this story or\\n\\t\\t\\t\\tparable."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "13",
    "NoteID": "14",
    "Body": "Lit., \"We increased [or \"advanced\"] them in guidance\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "14",
    "NoteID": "15",
    "Body": "Lit., \"when they stood up\" - i.e., stood up to their\\n\\t\\t\\t\\tmisguided fellow-men, or to the rulers who persecuted the\\n\\t\\t\\t\\tbelievers (see note [7])."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "15",
    "NoteID": "16",
    "Body": "Lit., \"Why do they not.. .\", etc., in the form of a\\n\\t\\t\\t\\trhetorical query introducing a new sentence."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "15",
    "NoteID": "17",
    "Body": "Lit., \"any clear evidence [or \"authority\"] in their\\n\\t\\t\\t\\tsupport\". The adjective bayyin (\"clear\", \"obvious\",\\n\\t\\t\\t\\t\"manifest\") implies an evidence accessible to reason."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "15",
    "NoteID": "18",
    "Body": "I.e., invents imaginary deities and thus gives the lie to\\n\\t\\t\\t\\tthe truth of His oneness and uniqueness, or even denies\\n\\t\\t\\t\\tHis existence altogether."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "16",
    "NoteID": "19",
    "Body": "The term mirfaq signifies \"anything by which one\\n\\t\\t\\t\\tbenefits\", whether concrete or abstract; in this context\\n\\t\\t\\t\\tit has obviously a spiritual connotation, marking the\\n\\t\\t\\t\\tyoung men’s abandonment of the world and withdrawal into\\n\\t\\t\\t\\tutter seclusion."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "17",
    "NoteID": "20",
    "Body": "Lit., \"while they were in a broad cleft thereof\". The\\n\\t\\t\\t\\tcave evidently opened to the north, so that the heat of\\n\\t\\t\\t\\tthe sun never disturbed them: and this, I believe is an\\n\\t\\t\\t\\techo of the many Qur'anic allusions to the happiness of\\n\\t\\t\\t\\tthe righteous in paradise, symbolized by its \"everlasting\\n\\t\\t\\t\\tshade\" (see, in particular, surah {4}, note [74], on the\\n\\t\\t\\t\\tmetaphorical use of the term zill in the sense of\\n\\t\\t\\t\\t\"happiness\")."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "18",
    "NoteID": "21",
    "Body": "I.e., an accidental onlooker would immediately have felt\\n\\t\\t\\t\\tthe mystic, awe-inspiring aura that surrounded the Men of\\n\\t\\t\\t\\tthe Cave, and would have become conscious that he stood\\n\\t\\t\\t\\tbefore God's elect (Tabari, Razi, Ibn Kathir, Baydawi)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "19",
    "NoteID": "22",
    "Body": "See note [10] above."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "19",
    "NoteID": "23",
    "Body": "It seems to me that the prefix li in li-yatasa'alu (which\\n\\t\\t\\t\\tmost commentators take to mean \"so that they might ask\\n\\t\\t\\t\\tone another\") is not a particle denoting a purpose (\"so\\n\\t\\t\\t\\tthat\") but, rather, a lam al-'aqibah - that is, a particle\\n\\t\\t\\t\\tindicating no more than a causal sequence - which in this\\n\\t\\t\\t\\tcontext may be brought out by the phrase \"and they\\n\\t\\t\\t\\tbegan...\", etc."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "19",
    "NoteID": "24",
    "Body": "Cf. {2: 259}, where exactly the same question is asked\\n\\t\\t\\t\\tand exactly the same wondering answer is given in the\\n\\t\\t\\t\\tparable of the man whom God caused to be dead for a\\n\\t\\t\\t\\thundred years and thereupon brought back to life. The\\n\\t\\t\\t\\tstriking verbal identity of question and answer in the\\n\\t\\t\\t\\ttwo passages is obviously not accidental: it points, in a\\n\\t\\t\\t\\tdeliberately revealing manner, to the identity of the\\n\\t\\t\\t\\tidea underlying these two allegories: namely, God's power\\n\\t\\t\\t\\tto \"bring forth the living out of that which is dead, and\\n\\t\\t\\t\\tthe dead out of that which is alive\" ({3: 27}, {6: 95},\\n\\t\\t\\t\\t{10: 31}, {30: 19}), i.e., to create life, to cause it to\\n\\t\\t\\t\\tdisappear and then to resurrect it. Beyond this, the\\n\\t\\t\\t\\tabove verse alludes to the deceptive, purely earthbound\\n\\t\\t\\t\\tcharacter of the human concept of \"time\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "19",
    "NoteID": "25",
    "Body": "I.e., they understood - in contrast to their companions,\\n\\t\\t\\t\\twho were merely concerned about what had actually\\n\\t\\t\\t\\thappened to them - that the lapse of time between their\\n\\t\\t\\t\\t\"falling asleep\" and their \"awakening\" had no reality of\\n\\t\\t\\t\\tits own and no meaning, just as it has no reality or\\n\\t\\t\\t\\tmeaning in connection with a human being's death and\\n\\t\\t\\t\\tsubsequent resurrection (cf.  17:52  and the\\n\\t\\t\\t\\tcorresponding note [59]): and this explains the reference\\n\\t\\t\\t\\tto the \"two viewpoints\" (lit., \"two parties\") in verse\\n\\t\\t\\t\\t{12} above."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "20",
    "NoteID": "26",
    "Body": "During their \"sleep\", time had stood still for the Men of\\n\\t\\t\\t\\tthe Cave, and so they assumed that the outside world had\\n\\t\\t\\t\\tremained unchanged and was, as before, hostile to them. -\\n\\t\\t\\t\\tAt this point, the story as such ends abruptly (for, as\\n\\t\\t\\t\\twe know, the Qur'an is never concerned with narratives\\n\\t\\t\\t\\tfor their own sake) and is revealed in the sequence as an\\n\\t\\t\\t\\tallegory of death and resurrection and of the relativity\\n\\t\\t\\t\\tof \"time\" as manifested in man's consciousness."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "21",
    "NoteID": "27",
    "Body": "I.e., by means of the legend which has grown up around\\n\\t\\t\\t\\tthe Men of the Cave and, more particularly, by means of\\n\\t\\t\\t\\tthe allegoric use which the Qur'an makes of this legend."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "21",
    "NoteID": "28",
    "Body": "Lit., \"given knowledge about them [to others]\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "21",
    "NoteID": "29",
    "Body": "Lit., \"debate their case (amrahum) among themselves\": an\\n\\t\\t\\t\\tindication of the fact that the legend of the Men of the\\n\\t\\t\\t\\tCave occupied men's minds for a long time, leading to\\n\\t\\t\\t\\tmany discussions and conflicting interpretations. The\\n\\t\\t\\t\\tnext sentence explains why God has \"drawn [people's]\\n\\t\\t\\t\\tattention\" to this story in the context of the Qur'an."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "21",
    "NoteID": "30",
    "Body": "This, to my mind, is the meaning of the expression\\n\\t\\t\\t\\t'alayhim (lit., \"over them\") occurring here as well as in\\n\\t\\t\\t\\tthe subsequent reference to the building of a house of\\n\\t\\t\\t\\tworship at the suggestion of those \"whose opinion\\n\\t\\t\\t\\tprevailed in the end\" (alladhina ghalabu 'ala amrihim)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "22",
    "NoteID": "31",
    "Body": "The future tense in sayaqulun points once again to the\\n\\t\\t\\t\\tlegendary character of the story as such, and implies\\n\\t\\t\\t\\tthat all speculation about its details is irrelevant to\\n\\t\\t\\t\\tits parabolic, ethical purport."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "22",
    "NoteID": "32",
    "Body": "I.e., for the sake of the self-evident ethical lesson to\\n\\t\\t\\t\\tbe derived from their story: an allusion to the first\\n\\t\\t\\t\\tparagraph of verse {21} above."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "24",
    "NoteID": "33",
    "Body": "According to almost all of the commentators, this\\n\\t\\t\\t\\tparenthetic passage (verses {23-24}) is primarily\\n\\t\\t\\t\\taddressed to the Prophet, who, on being asked by some of\\n\\t\\t\\t\\tthe pagan Quraysh as to what \"really\" happened to the Men\\n\\t\\t\\t\\tof the Cave, is said to have replied, \"I shall give you\\n\\t\\t\\t\\tmy answer tomorrow\" - whereupon revelation was\\n\\t\\t\\t\\ttemporarily withheld from him in token of God's\\n\\t\\t\\t\\tdisapproval; in the second instance, this exhortation\\n\\t\\t\\t\\texpresses a general principle addressed to all believers."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "25",
    "NoteID": "34",
    "Body": "This obviously connects with the \"idle guesses\" mentioned\\n\\t\\t\\t\\tin the first paragraph of verse {22} above - guesses\\n\\t\\t\\t\\trefuted by the subsequent statements, \"My Sustainer knows\\n\\t\\t\\t\\tbest how many they were\" in verse {22}, and \"God knows\\n\\t\\t\\t\\tbest how long they remained [there]\" in verse {26}. This\\n\\t\\t\\t\\twas, in particular, the view of 'Abd Allah ibn Mas'ud,\\n\\t\\t\\t\\twhose copy of the Qur'an is said to have contained the\\n\\t\\t\\t\\twords, \"And they [i.e., some people] said, 'They\\n\\t\\t\\t\\tremained...',\" etc. (which was probably a marginal,\\n\\t\\t\\t\\texplanatory remark added by Ibn Mas'ud), as well as of\\n\\t\\t\\t\\tQatadah and of Matar al-Warraq (Tabari, Zamakhshari and\\n\\t\\t\\t\\tIbn Kathir). My interpolation, at the beginning of the\\n\\t\\t\\t\\tverse, of the words \"some people asserted\" is based on\\n\\t\\t\\t\\tthe word qalu (\"they said\") used by Ibn Mas'ud in his\\n\\t\\t\\t\\tmarginal note."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "27",
    "NoteID": "35",
    "Body": "According to Razi, it is on this passage, among others,\\n\\t\\t\\t\\tthat the great Qur'an-commentator Abu Muslim al-Isfahani\\n\\t\\t\\t\\tbased his rejection of the so-called \"doctrine of\\n\\t\\t\\t\\tabrogation\" discussed in my note [87] on {2: 106}."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "28",
    "NoteID": "36",
    "Body": "For an explanation of this verse, see  6:52  and the\\n\\t\\t\\t\\tcorresponding note [41]."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "28",
    "NoteID": "37",
    "Body": "See surah {2}, note [7]. Zamakshari and Razi explain the\\n\\t\\t\\t\\tverb aghfalna - agreeably with Qur'anic doctrine - as\\n\\t\\t\\t\\tmeaning \"whom We have found to be heedless\". (See also my\\n\\t\\t\\t\\tnote [4] on the second part of  14:4 .)"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "28",
    "NoteID": "38",
    "Body": "Lit., \"and whose case (amr) was one of abandonment of [or\\n\\t\\t\\t\\t\"transgression against\"] all bounds [of what is right]\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "29",
    "NoteID": "39",
    "Body": "Thus Razi explains the expression az-zalimun (lit., \"the\\n\\t\\t\\t\\tevildoers\") in the above context."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "29",
    "NoteID": "40",
    "Body": "The expression suradiq - rendered by me as \"billowing\\n\\t\\t\\t\\tfolds\" - literally denotes an awning or the outer covering\\n\\t\\t\\t\\tof a tent, and alludes here to the billowing \"walls of\\n\\t\\t\\t\\tsmoke\" that will surround the sinners (Zamakhshari): a\\n\\t\\t\\t\\tsymbolism meant to stress the inescapability of their\\n\\t\\t\\t\\tsuffering in the hereafter (Razi)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "31",
    "NoteID": "41",
    "Body": "Like all other Qur'anic descriptions of happenings in the\\n\\t\\t\\t\\thereafter, the above reference to the \"adornment\" of the\\n\\t\\t\\t\\tbelievers with gold and jewels and silk (cf. similar\\n\\t\\t\\t\\tpassages in  22:23 ,  35:33  and  76:21 ) and their\\n\\t\\t\\t\\t\"reclining upon couches (ara'ik)\" is obviously an\\n\\t\\t\\t\\tallegory - in this case, an allegory of the splendour,\\n\\t\\t\\t\\tthe ever-fresh life (symbolized by \"green garments\"), and\\n\\t\\t\\t\\tthe restful fulfilment that awaits them in result of the\\n\\t\\t\\t\\tmany acts of self-denial which their faith had imposed on\\n\\t\\t\\t\\tthem during their earthly life. - Referring to the\\n\\t\\t\\t\\tsymbolism of these joys of paradise Razi draws our\\n\\t\\t\\t\\tattention to the difference in the construction of the\\n\\t\\t\\t\\ttwo parts of this clause: the first part is in the\\n\\t\\t\\t\\tpassive form (\"they will be adorned...\") and the second,\\n\\t\\t\\t\\tin the active (\"they will wear...\"). In his opinion, the\\n\\t\\t\\t\\tactive form alludes to what the righteous will have\\n\\t\\t\\t\\tearned by virtue of their deeds, whereas the passive form\\n\\t\\t\\t\\tdenotes all that will be bestowed on them by God above\\n\\t\\t\\t\\tand beyond their deserts."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "32",
    "NoteID": "42",
    "Body": "This parable connects with verses {7-8} of this surah,\\n\\t\\t\\t\\tand serves as an illustration of the statement that \"all\\n\\t\\t\\t\\tbeauty on earth is a means by which God puts men to a\\n\\t\\t\\t\\ttest\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "36",
    "NoteID": "43",
    "Body": "Lit., \"brought back [or \"referred\"] to my Sustainer\" -\\n\\t\\t\\t\\ti.e., for judgment."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "37",
    "NoteID": "44",
    "Body": "See second half of note [47] on {3: 59}, and note [4] on\\n\\t\\t\\t\\t{23: 12}."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "38",
    "NoteID": "45",
    "Body": "Lit., \"I shall not [or \"do not\"] associate anyone [or\\n\\t\\t\\t\\t\"anything\"] with my Sustainer\" - i.e., \"I cannot\\n\\t\\t\\t\\tassociate in my mind wealth or poverty with any power or\\n\\t\\t\\t\\tcreative cause other than Him\" (Qiffal, as quoted by\\n\\t\\t\\t\\tRazi)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "39",
    "NoteID": "46",
    "Body": "For an explanation of my rendering of law-la as \"alas\",\\n\\t\\t\\t\\tsee note [119] on {10: 98}."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "43",
    "NoteID": "47",
    "Body": "Lit.. \"he had no host whatever\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "44",
    "NoteID": "48",
    "Body": "Lit., \"the best as regards the consequence\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "46",
    "NoteID": "49",
    "Body": "Lit., \"are better in thy Sustainer's sight as regards\\n\\t\\t\\t\\tmerit, and better as regards hope\". The expression\\n\\t\\t\\t\\tal-baqiyat as-salihat (\"good deeds, the fruit whereof\\n\\t\\t\\t\\tendures forever\") occurs in the Qur'an twice - in the\\n\\t\\t\\t\\tabove verse as well as in {19: 76}."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "48",
    "NoteID": "50",
    "Body": "I.e., to those who in their lifetime denied the truth of\\n\\t\\t\\t\\tresurrection."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "48",
    "NoteID": "51",
    "Body": "Cf.  6:94 ."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "50",
    "NoteID": "52",
    "Body": "This short reference to the oft-repeated allegory of\\n\\t\\t\\t\\tGod's command to the angels to \"prostrate themselves\\n\\t\\t\\t\\tbefore Adam\" is meant, in the above context, to stress\\n\\t\\t\\t\\tman's inborn faculty of conceptual thinking (see {2:\\n\\t\\t\\t\\t31-34} and the corresponding notes) and, thus, his\\n\\t\\t\\t\\tability and obligation to discern between right and\\n\\t\\t\\t\\twrong. Since man's deliberate choice of a morally wrong\\n\\t\\t\\t\\tcourse - of which the preceding passages speak - is\\n\\t\\t\\t\\talmost invariably due to his exaggerated attachment to\\n\\t\\t\\t\\tthe allurements of worldly life, attention is drawn here\\n\\t\\t\\t\\tto the fact that this attachment is the means by which\\n\\t\\t\\t\\tSatan (or Iblis) induces man to forgo all moral\\n\\t\\t\\t\\tconsiderations and thus brings about his spiritual ruin."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "50",
    "NoteID": "53",
    "Body": "Denoting, in this instance, the angels (see Appendix\\n\\t\\t\\t\\tIII)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "50",
    "NoteID": "54",
    "Body": "Lit., \"his offspring\" - a metonym for all who follow him."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "50",
    "NoteID": "55",
    "Body": "Lit., \"for the evildoers\". As regards Satan's symbolic\\n\\t\\t\\t\\t\"rebellion\" against God, see note [26] on  2:34  and note\\n\\t\\t\\t\\t[31] on  15:41 ."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "51",
    "NoteID": "56",
    "Body": "I.e., \"since they are but created beings, and not\\n\\t\\t\\t\\tco-existent with Me, how can you take them for your\\n\\t\\t\\t\\tmasters?\"-an allusion to the beings, real or imaginary,\\n\\t\\t\\t\\tto which men ascribe divine qualities, either consciously\\n\\t\\t\\t\\tor (as in the case of one's submission to the\\n\\t\\t\\t\\t\"whisperings of Satan\") by subconscious implication."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "51",
    "NoteID": "57",
    "Body": "Since God is almighty, all-knowing and self-sufficient,\\n\\t\\t\\t\\tthe belief that any being or power could have a \"helping\"\\n\\t\\t\\t\\tshare in His divinity, or could \"mediate\" between Him and\\n\\t\\t\\t\\tman, causes the latter to go utterly astray."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "52",
    "NoteID": "58",
    "Body": "Lit., \"those partners of Mine whom you supposed [to\\n\\t\\t\\t\\texist]\": see note [15] on  6:22 ."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "52",
    "NoteID": "59",
    "Body": "Or: \"a gulf [or \"a barrier\"] of perdition\": an allusion\\n\\t\\t\\t\\tto the wide gulf of unreality that separates those\\n\\t\\t\\t\\tsinners from the blasphemous figments of their\\n\\t\\t\\t\\timagination or, more probably, the gulf that separates\\n\\t\\t\\t\\tthem from the saintly persons whom they were wont to\\n\\t\\t\\t\\tworship despite the fact that the latter had never made\\n\\t\\t\\t\\tany claim to divine status (Zamakhshari and Razi in one\\n\\t\\t\\t\\tof their alternative interpretations, with specific\\n\\t\\t\\t\\tmention of Jesus and Mary)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "54",
    "NoteID": "60",
    "Body": "Cf. note [104] on {17: 89}, explaining my translation of\\n\\t\\t\\t\\tmathal, in this context, as \"lesson\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "55",
    "NoteID": "61",
    "Body": "Lit., \"face to face\" or \"in the future\" (Zamakhshari) -\\n\\t\\t\\t\\tboth these meanings of qubulan being comprised in the\\n\\t\\t\\t\\tconcept of \"the hereafter\" or \"the life to come\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "57",
    "NoteID": "62",
    "Body": "I.e., persevering in his unrighteous behaviour (Razi)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "57",
    "NoteID": "63",
    "Body": "Lit., \"to guidance\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "58",
    "NoteID": "64",
    "Body": "Lit., \"He would indeed hasten the punishment for\\n\\t\\t\\t\\tthem\"-the implication being that He invariably allows\\n\\t\\t\\t\\tthem time to repent and mend their ways."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "58",
    "NoteID": "65",
    "Body": "Cf. somewhat similar passages in  16:61  and  35:45 . The\\n\\t\\t\\t\\t\"time-limit\" (maw'id) signifies, in this context, the end\\n\\t\\t\\t\\tof the sinners' life on earth or - as in the next verse -\\n\\t\\t\\t\\tthe \"point of no return\" beyond which God does not allow\\n\\t\\t\\t\\tthem to sin with impunity."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "59",
    "NoteID": "66",
    "Body": "Lit., \"when [or \"after\"] they had been doing wrong\" -\\n\\t\\t\\t\\ti.e., persistently and for a long time."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "60",
    "NoteID": "67",
    "Body": "The particle idh (which usually signifies \"when\", but is,\\n\\t\\t\\t\\tI believe, properly rendered here as \"lo!\") often serves\\n\\t\\t\\t\\tin the Qur'an to draw attention to a sudden turn in the\\n\\t\\t\\t\\tdiscourse, without, however, involving a break in the\\n\\t\\t\\t\\tcontinuity of thought. In this instance, it evidently\\n\\t\\t\\t\\tmarks a connection with verse {54} above (\"many facets\\n\\t\\t\\t\\thave We given in this Qur'an to every kind of lesson\\n\\t\\t\\t\\t[designed] for [the benefit of] mankind\"), and introduces\\n\\t\\t\\t\\tan allegory meant to illustrate the fact that knowledge,\\n\\t\\t\\t\\tand particularly spiritual knowledge, is inexhaustible,\\n\\t\\t\\t\\tso that no human being- not even a prophet- can ever\\n\\t\\t\\t\\tclaim to possess answers to all the questions that\\n\\t\\t\\t\\tperplex man throughout his life. (This idea is brought\\n\\t\\t\\t\\tout fully in the last two verses of this surah.) The\\n\\t\\t\\t\\tsubsequent parable of Moses and his quest for knowledge\\n\\t\\t\\t\\t(verses {60-82}) has become, in the course of time, the\\n\\t\\t\\t\\tnucleus of innumerable legends with which we are not\\n\\t\\t\\t\\tconcerned here. We have, however, a Tradition on the\\n\\t\\t\\t\\tauthority of Ubayy ibn Ka'b (recorded in several versions\\n\\t\\t\\t\\tby Bukhari, Muslim and Tirmidhi), according to which\\n\\t\\t\\t\\tMoses was rebuked by God for having once asserted that he\\n\\t\\t\\t\\twas the wisest of all men, and was subsequently told\\n\\t\\t\\t\\tthrough revelation that a \"servant of God\" who lived at\\n\\t\\t\\t\\tthe \"junction of the two seas\" was far superior to him in\\n\\t\\t\\t\\twisdom. When Moses expressed his eagerness to find that\\n\\t\\t\\t\\tman, God commanded him to \"take a fish in a basket\" and\\n\\t\\t\\t\\tto go on and on until the fish would disappear: and its\\n\\t\\t\\t\\tdisappearance was to be a sign that the goal had been\\n\\t\\t\\t\\treached. - There is no doubt that this Tradition is a\\n\\t\\t\\t\\tkind of allegorical introduction to our Qur'anic parable.\\n\\t\\t\\t\\tThe \"fish\" mentioned in the latter as well as in the\\n\\t\\t\\t\\tabove-mentioned hadith is an ancient religious symbol,\\n\\t\\t\\t\\tpossibly signifying divine knowledge or life eternal. As\\n\\t\\t\\t\\tfor the \"junction of the two seas\", which many of the\\n\\t\\t\\t\\tearly commentators endeavoured to \"identify\" in\\n\\t\\t\\t\\tgeographical terms (ranging from the meeting of the Red\\n\\t\\t\\t\\tSea and the Indian Ocean at the Bab al-Mandab to that of\\n\\t\\t\\t\\tthe Mediterranean Sea and the Atlantic Ocean at the\\n\\t\\t\\t\\tStraits of Gibraltar), Baydawi offers, in his commentary\\n\\t\\t\\t\\ton verse {60}, a purely allegorical explanation: the \"two\\n\\t\\t\\t\\tseas\" represent the two sources or streams of knowledge -\\n\\t\\t\\t\\tthe one obtainable through the observation and\\n\\t\\t\\t\\tintellectual coordination of outward phenomena ('ilm\\n\\t\\t\\t\\taz-zahir), and the other through intuitive, mystic\\n\\t\\t\\t\\tinsight ('ilm al-batin) - the meeting of which is the\\n\\t\\t\\t\\treal goal of Moses' quest."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "60",
    "NoteID": "68",
    "Body": "Lit., \"young man\" (fata) - a term applied, in early Arabic\\n\\t\\t\\t\\tusage, to one's servant (irrespective of his age).\\n\\t\\t\\t\\tAccording to tradition, it was Joshua, who was to become\\n\\t\\t\\t\\tthe leader of the Israelites after the death of Moses."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "61",
    "NoteID": "69",
    "Body": "Lit., \"burrowing [into it]\". Their forgetting the\\n\\t\\t\\t\\tsymbolic \"fish\" (see last third of note [67]) is perhaps\\n\\t\\t\\t\\tan allusion to man's frequently forgetting that God is\\n\\t\\t\\t\\tthe ultimate source of all knowledge and life."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "63",
    "NoteID": "70",
    "Body": "Lit., \"Didst thou see?\" Although formulated as a\\n\\t\\t\\t\\tquestion, this idiomatic phrase often expresses-as does\\n\\t\\t\\t\\tits modern equivalent, \"Would you believe it?\"-no more\\n\\t\\t\\t\\tthan a sudden remembrance of, or surprise at, an unusual\\n\\t\\t\\t\\tor absurd happening."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "63",
    "NoteID": "71",
    "Body": "Lit., \"made me forget it lest I remember it\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "64",
    "NoteID": "72",
    "Body": "I.e., the disappearance of the fish indicated the point\\n\\t\\t\\t\\tat which their quest was to end (see note [67])."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "65",
    "NoteID": "73",
    "Body": "In the Tradition on the authority of Ubayy ibn Ka'b\\n\\t\\t\\t\\t(referred to in note [67]) this mysterious sage is spoken\\n\\t\\t\\t\\tof as Al-Khadir or Al-Khidr, meaning \"the Green One\".\\n\\t\\t\\t\\tApparently this is an epithet rather than a name,\\n\\t\\t\\t\\timplying (according to popular legend) that his wisdom\\n\\t\\t\\t\\twas ever-fresh (\"green\") and imperishable: a notion which\\n\\t\\t\\t\\tbears out the assumption that we have here an allegoric\\n\\t\\t\\t\\tfigure symbolizing the utmost depth of mystic insight\\n\\t\\t\\t\\taccessible to man."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "68",
    "NoteID": "74",
    "Body": "Lit., \"that thou dost not encompass with [thy] experience\\n\\t\\t\\t\\t(khubran)\": according to Razi, an allusion to the fact\\n\\t\\t\\t\\tthat even a prophet like Moses did not fully comprehend\\n\\t\\t\\t\\tthe inner reality of things (haqa'iq al-ashya' kama\\n\\t\\t\\t\\thiya); and, more generally, to man's lack of equanimity\\n\\t\\t\\t\\twhenever he is faced with something that he has never yet\\n\\t\\t\\t\\texperienced or cannot immediately comprehend. In the last\\n\\t\\t\\t\\tanalysis, the above verse implies - as is brought out\\n\\t\\t\\t\\tfully in Moses' subsequent experiences - that appearance\\n\\t\\t\\t\\tand reality do not always coincide; beyond that, it\\n\\t\\t\\t\\ttouches in a subtle manner upon the profound truth that\\n\\t\\t\\t\\tman cannot really comprehend or even visualize anything\\n\\t\\t\\t\\tthat has no counterpart - at least in its component\\n\\t\\t\\t\\telements - in his own intellectual experience: and this\\n\\t\\t\\t\\tis the reason for the Qur'anic use of metaphor and\\n\\t\\t\\t\\tallegory with regard to \"all that is beyond the reach of\\n\\t\\t\\t\\ta created being's perception\" (al-ghayb)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "71",
    "NoteID": "75",
    "Body": "Lit., \"he\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "77",
    "NoteID": "76",
    "Body": "Lit., \"asked its people\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "79",
    "NoteID": "77",
    "Body": "Lit., \"to cause a fault in it\" - i.e., to make it\\n\\t\\t\\t\\ttemporarily unserviceable."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "80",
    "NoteID": "78",
    "Body": "Lit., \"we feared\" - but it should be borne in mind that,\\n\\t\\t\\t\\tbeyond this primary meaning, the verb khashiya sometimes\\n\\t\\t\\t\\tdenotes \"he had reason to fear\" and, consequently, \"he\\n\\t\\t\\t\\tknew\", i.e., that something bad would happen (Taj\\n\\t\\t\\t\\tal-'Arus, with specific reference to the above verse):\\n\\t\\t\\t\\tand so we may assume that the sage's expression of \"fear\"\\n\\t\\t\\t\\twas synonymous with positive \"knowledge\" gained through\\n\\t\\t\\t\\toutward evidence or through mystic insight (the latter\\n\\t\\t\\t\\tbeing more probable, as indicated by his statement in the\\n\\t\\t\\t\\tsecond paragraph of the next verse, \"I did not do [any\\n\\t\\t\\t\\tof] this of my own accord\")."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "82",
    "NoteID": "79",
    "Body": "I.e., left to them as an inheritance. Presumably that\\n\\t\\t\\t\\ttreasure would have been exposed to view if the wall had\\n\\t\\t\\t\\tbeen allowed to tumble down, and would have been stolen\\n\\t\\t\\t\\tby the avaricious village folk, who had shown their true\\n\\t\\t\\t\\tcharacter by refusing all hospitality to weary\\n\\t\\t\\t\\ttravellers."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "82",
    "NoteID": "80",
    "Body": "Implying that whatever he had done was done under the\\n\\t\\t\\t\\timpulsion of a higher truth - the mystic insight which\\n\\t\\t\\t\\trevealed to him the reality behind the outward appearance\\n\\t\\t\\t\\tof things and made him a conscious particle in God's\\n\\t\\t\\t\\tunfathomable plan: and this explains the use of the\\n\\t\\t\\t\\tplural \"we\" in verses {80-81}, as well as the direct\\n\\t\\t\\t\\tattribution, in the first paragraph of verse {82}, of a\\n\\t\\t\\t\\tconcrete human action to God's will (Razi)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "83",
    "NoteID": "81",
    "Body": "Lit., \"I will convey unto you a remembrance [or\\n\\t\\t\\t\\t\"mention\"] of him\" - i.e., something that is worthy of\\n\\t\\t\\t\\tremembrance and mention: which, I believe, is an allusion\\n\\t\\t\\t\\tto the parabolic character of the subsequent story and\\n\\t\\t\\t\\tthe fact that is is confined, like the preceding parable\\n\\t\\t\\t\\tof Moses and the unknown sage, to a few fundamental,\\n\\t\\t\\t\\tspiritual truths.- the epithet Dhu 'l-Qarnayn signifies\\n\\t\\t\\t\\t\"the Two-Horned One\" or \"He of the Two Epochs\", since the\\n\\t\\t\\t\\tnoun - qarn has the meaning of \"horn\" as well as of\\n\\t\\t\\t\\t\"generation\" or \"epoch\" or \"age\" or \"century\". The\\n\\t\\t\\t\\tclassical commentators incline to the first of these\\n\\t\\t\\t\\tmeanings (\"the Two-Horned\"); and in this they appear to\\n\\t\\t\\t\\thave been influenced by the ancient Middle-Eastern\\n\\t\\t\\t\\timagery of \"horns\" as symbols of power and greatness,\\n\\t\\t\\t\\talthough the Qur'an itself does not offer any warrant for\\n\\t\\t\\t\\tthis interpretation. In fact, the term - qarn (and its\\n\\t\\t\\t\\tplural qurun) occurs in the Qur'an - apart from the\\n\\t\\t\\t\\tcombination Dhu 'l-Qarnayn appearing in verses {83}, {86}\\n\\t\\t\\t\\tand {94} of this surah - twenty times: and each time it\\n\\t\\t\\t\\thas the meaning of \"generation\" in the sense of people\\n\\t\\t\\t\\tbelonging to one particular epoch or civilization.\\n\\t\\t\\t\\tHowever, since the allegory of Dhu 'l-Qarnayn is meant to\\n\\t\\t\\t\\tillustrate the qualities of a powerful and just ruler, it\\n\\t\\t\\t\\tis possible to assume that this designation is an echo of\\n\\t\\t\\t\\tthe above-mentioned ancient symbolism, which - being\\n\\t\\t\\t\\tfamiliar to the Arabs from very early times-had acquired\\n\\t\\t\\t\\tidiomatic currency in their language long before the\\n\\t\\t\\t\\tadvent of Islam. Within the context of our Qur'anic\\n\\t\\t\\t\\tallegory, the \"two horns\" may be taken to denote the two\\n\\t\\t\\t\\tsources of power with which Dhu 'l-Qarnayn is said to\\n\\t\\t\\t\\thave been endowed: namely, the worldly might and prestige\\n\\t\\t\\t\\tof kingship as well as the spiritual strength resulting\\n\\t\\t\\t\\tfrom his faith in God. This last point is extremely\\n\\t\\t\\t\\timportant- for it is precisely the Qur'anic stress on his\\n\\t\\t\\t\\tfaith in God that makes it impossible to identify Dhu\\n\\t\\t\\t\\t'l-Qarnayn, as most of the commentators do, with\\n\\t\\t\\t\\tAlexander the Great (who is represented on some of his\\n\\t\\t\\t\\tcoins with two horns on his head) or with one or another\\n\\t\\t\\t\\tof the pre-Islamic, Himyaritic kings of Yemen. All those\\n\\t\\t\\t\\thistoric personages were pagans and worshipped a\\n\\t\\t\\t\\tplurality of deities as a matter of course, whereas our\\n\\t\\t\\t\\tDhu 'l-Qarnayn is depicted as a firm believer in the One\\n\\t\\t\\t\\tGod: indeed, it is this aspect of his personality that\\n\\t\\t\\t\\tprovides the innermost reason of the Qur'anic allegory.\\n\\t\\t\\t\\tWe must, therefore, conclude that the latter has nothing\\n\\t\\t\\t\\tto do with history or even legend, and that its sole\\n\\t\\t\\t\\tpurport is a parabolic discourse on faith and ethics,\\n\\t\\t\\t\\twith specific reference to the problem of worldly power\\n\\t\\t\\t\\t(see the concluding passage in the introductory note to\\n\\t\\t\\t\\tthis surah)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "84",
    "NoteID": "82",
    "Body": "According to Ibn 'Abbes, Mujahid, Sa'id ibn Jubayr,\\n\\t\\t\\t\\t'Ikrimah, Qatadah and Ad-Dahhak (all of them quoted by\\n\\t\\t\\t\\tIbn Kathir), the term sabab - lit., \"a means to achieve\\n\\t\\t\\t\\t[anything]\" - denotes, in this context, the knowledge of\\n\\t\\t\\t\\tthe right means for the achievement of a particular end."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "85",
    "NoteID": "83",
    "Body": "Lit., \"he followed [the right] means\": i.e., he never\\n\\t\\t\\t\\temployed wrong means to achieve even a righteous goal."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "86",
    "NoteID": "84",
    "Body": "I.e., the westernmost point of his expedition (Razl)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "86",
    "NoteID": "85",
    "Body": "Or: \"abundance of water\" - which, according to many\\n\\t\\t\\t\\tphilologists (cf. Taj al-'Arus), is one of the meanings\\n\\t\\t\\t\\tof 'ayn (primarily denoting a \"spring\"). As for my\\n\\t\\t\\t\\trendering of the phrase \"he found it (wajadaha)\\n\\t\\t\\t\\tsetting...\", etc., as \"it appeared to him that it was\\n\\t\\t\\t\\tsetting\", see Razi and Ibn Kathir, both of whom point out\\n\\t\\t\\t\\tthat we have here a metaphor based on the common optical\\n\\t\\t\\t\\tillusion of the sun's \"disappearing into the sea\"; and\\n\\t\\t\\t\\tRazi explains this, correctly, by the fact that the earth\\n\\t\\t\\t\\tis spherical. (It is interesting to note that, according\\n\\t\\t\\t\\tto him, this explanation was already advanced in the - now\\n\\t\\t\\t\\tlost - Qur'an-commentary of Abu 'Ali al-Jubba'i, the famous\\n\\t\\t\\t\\tMu'tazili scholar who died in 303 H., which corresponds\\n\\t\\t\\t\\tto 915 or 916 of the Christian era.)"
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "86",
    "NoteID": "86",
    "Body": "This divine permission to choose between two possible\\n\\t\\t\\t\\tcourses of action is not only a metonymic statement of\\n\\t\\t\\t\\tthe freedom of will accorded by God to man, but\\n\\t\\t\\t\\testablishes also the important legal principle of\\n\\t\\t\\t\\tistihsan (social or moral preference) open to a ruler or\\n\\t\\t\\t\\tgovernment in deciding as to what might be conducive to\\n\\t\\t\\t\\tthe greatest good (maslahah) of the community as a whole:\\n\\t\\t\\t\\tand this is the first \"lesson\" of the parable of\\n\\t\\t\\t\\tDhu'l-Qarnayn."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "87",
    "NoteID": "87",
    "Body": "Cf.  11:117  and the corresponding note [149]."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "87",
    "NoteID": "88",
    "Body": "I.e., in the hereafter - implying that nothing that\\n\\t\\t\\t\\tpertains to the life to come could ever be imagined or\\n\\t\\t\\t\\tdefined in terms of human experience."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "88",
    "NoteID": "89",
    "Body": "Since righteous behaviour is the norm expected of man,\\n\\t\\t\\t\\tthe laws relating thereto must not be too demanding - which\\n\\t\\t\\t\\tis another lesson to be drawn from this parable."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "89",
    "NoteID": "90",
    "Body": "For this rendering of the particle thumma, see surah {6},\\n\\t\\t\\t\\tnote [31]."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "90",
    "NoteID": "91",
    "Body": "I.e., the easternmost point of his expedition (similar to\\n\\t\\t\\t\\tthe expression \"the setting of the sun\" in verse {86})."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "91",
    "NoteID": "92",
    "Body": "This is Razi's interpretation of the isolated expression\\n\\t\\t\\t\\tkadhalika (\"thus\" or \"thus it was\") occurring here. It\\n\\t\\t\\t\\tobviously relates to the primitive, natural state of\\n\\t\\t\\t\\tthose people who needed no clothes to protect them from\\n\\t\\t\\t\\tthe sun, and to the (implied) fact that Dhu 'l-Qarnayn\\n\\t\\t\\t\\tleft them as he had found them, being mindful not to\\n\\t\\t\\t\\tupset their mode of life and thus to cause them misery."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "91",
    "NoteID": "93",
    "Body": "Lit., \"all that was with him\" - i.e., his resolve not to\\n\\t\\t\\t\\t\"corrupt [or \"change\"] God's creation\" (cf. the second\\n\\t\\t\\t\\thalf of my note [141] on {4: 119}) - which, I believe, is\\n\\t\\t\\t\\ta further ethical lesson to be derived from this parable."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "93",
    "NoteID": "94",
    "Body": "This is generally assumed to be the Caucasus. However,\\n\\t\\t\\t\\tsince neither the Qur'an nor any authentic Tradition says\\n\\t\\t\\t\\tanything about the location of these \"two\\n\\t\\t\\t\\tmountain-barriers\" or the people who lived there, we can\\n\\t\\t\\t\\tsafely dismiss all the speculations advanced by the\\n\\t\\t\\t\\tcommentators on this score as irrelevant, the more so as\\n\\t\\t\\t\\tthe story of Dhu 'I-Qarnayn aims at no more than the\\n\\t\\t\\t\\tillustration of certain ethical principles in a parabolic\\n\\t\\t\\t\\tmanner."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "94",
    "NoteID": "95",
    "Body": "This is the form in which these names (in Arabic, Yajuj\\n\\t\\t\\t\\tand Majuj) have achieved currency in all European\\n\\t\\t\\t\\tlanguages on the basis of certain vague references to\\n\\t\\t\\t\\tthem in the Bible (Genesis x, 2, I Chronicles i, 5,\\n\\t\\t\\t\\tEzekiel xxxviii, 2 and xxxix, 6, Revelation of St. John\\n\\t\\t\\t\\txx, 8). Most of the post-classical commentators identify\\n\\t\\t\\t\\tthese tribes with the Mongols and Tatars (see note [100]\\n\\t\\t\\t\\tbelow)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "95",
    "NoteID": "96",
    "Body": "It is generally assumed that the phrase \"that wherein my\\n\\t\\t\\t\\tSustainer has so securely established me (makkanni)\"\\n\\t\\t\\t\\trefers to the power and wealth bestowed on him; but it is\\n\\t\\t\\t\\tmuch more probable - and certainly more consistent with\\n\\t\\t\\t\\tthe ethical tenor of the whole parable of Dhu ‘l-Qarnayn\\n\\t\\t\\t\\t- that it refers to God’s guidance rather than to worldly\\n\\t\\t\\t\\tpossessions."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "96",
    "NoteID": "97",
    "Body": "Lit., \"Blow!\""
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "97",
    "NoteID": "98",
    "Body": "Lit., \"they\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "98",
    "NoteID": "99",
    "Body": "Lit., \"my Sustainer's promise\"."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "98",
    "NoteID": "100",
    "Body": "Some of the classical commentators (e.g., Tabari) regard\\n\\t\\t\\t\\tthis as a prediction of a definite, historic event:\\n\\t\\t\\t\\tnamely, the future break-through of the savage tribes of\\n\\t\\t\\t\\t\"Gog and Magog\", who are conceived of as identical with\\n\\t\\t\\t\\tthe Mongols and Tatars (see note [95] above). This\\n\\t\\t\\t\\t\"identification\" is mainly based on a well-authenticated\\n\\t\\t\\t\\tTradition - recorded by Ibn Hanbal, Bukhari and Muslim -\\n\\t\\t\\t\\twhich tells us that the Apostle of God had a prophetic\\n\\t\\t\\t\\tdream to which he referred on awakening, with an\\n\\t\\t\\t\\texclamation of distress: \"There is no deity save God! Woe\\n\\t\\t\\t\\tunto the Arabs from a misfortune that is approaching: a\\n\\t\\t\\t\\tlittle gap has been opened today in the rampart of Gog\\n\\t\\t\\t\\tand Magog!\" Ever since the late Middle Ages, Muslims have\\n\\t\\t\\t\\tbeen inclined to discern in this dream a prediction of\\n\\t\\t\\t\\tthe great Mongol invasion in the thirteenth century,\\n\\t\\t\\t\\twhich destroyed the Abbasid Empire and, thus, the\\n\\t\\t\\t\\tpolitical power of the Arabs. However, the mention, in\\n\\t\\t\\t\\tverses {99-101} of this surah, of \"the Day\" - i.e., the\\n\\t\\t\\t\\tDay of Judgment - in connection with \"Gog and Magog\"\\n\\t\\t\\t\\tshows that \"the time appointed by my Sustainer\" relates\\n\\t\\t\\t\\tto the coming of the Last Hour, when all works of man\\n\\t\\t\\t\\twill be destroyed. But since none of the Qur'anic\\n\\t\\t\\t\\treferences to the \"approach\" or the \"nearness\" of the\\n\\t\\t\\t\\tLast Hour has anything to do with the human concept of\\n\\t\\t\\t\\ttime, it is possible to accept both of the above\\n\\t\\t\\t\\tinterpretations as equally valid in the sense that the\\n\\t\\t\\t\\t\"coming of the Last Hour\" comprises an indefinite - and,\\n\\t\\t\\t\\tin human terms, perhaps even immensely long - span of\\n\\t\\t\\t\\ttime, and that the break-through of the godless forces of\\n\\t\\t\\t\\t\"Gog and Magog\" was to be one of the signs of its\\n\\t\\t\\t\\tapproach. And, finally, it is most logical to assume\\n\\t\\t\\t\\t(especially on the basis of {21: 96-97}) that the terms\\n\\t\\t\\t\\tYajuj and Majuj are purely allegorical, applying not to\\n\\t\\t\\t\\tany specific tribes or beings but to a series of social\\n\\t\\t\\t\\tcatastrophes which would cause a complete destruction of\\n\\t\\t\\t\\tman's civilization before the coming of the Last Hour."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "99",
    "NoteID": "101",
    "Body": "I.e., on the Day of Judgment alluded to in the preceding\\n\\t\\t\\t\\tverse."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "102",
    "NoteID": "102",
    "Body": "This is an allusion not only to the worship of created\\n\\t\\t\\t\\tbeings or forces of nature, but also to the popular\\n\\t\\t\\t\\tbelief that saints, whether alive or dead, could\\n\\t\\t\\t\\teflfectively \"intercede\" with God in behalf of anyone\\n\\t\\t\\t\\twhom He has rejected."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "102",
    "NoteID": "103",
    "Body": "I.e., of God's oneness and uniqueness, and hence of the\\n\\t\\t\\t\\tfact that no created being can have any \"influence\" on\\n\\t\\t\\t\\tGod's judgment."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "105",
    "NoteID": "104",
    "Body": "Although each of their good actions will be taken into\\n\\t\\t\\t\\taccount on Judgment Day in accordance with the Qur'anic\\n\\t\\t\\t\\tstatement that \"he who shall have done an atom's weight\\n\\t\\t\\t\\tof good, shall behold it\" ({99: 7}), the above verse\\n\\t\\t\\t\\timplies that whatever good such sinners may do is far\\n\\t\\t\\t\\toutweighed by their godlessness (Al-Qadi 'Iyad, as quoted\\n\\t\\t\\t\\tby Razi)."
  },
  {
    "SurahNumber": "18",
    "AyahNumber": "109",
    "NoteID": "105",
    "Body": "Lit., \"if We were to produce the like of it [i.e., of the\\n\\t\\t\\t\\tsea] in addition\". It is to be noted that, as pointed out\\n\\t\\t\\t\\tby Zamakhshari, the term al-bahr (\"the sea\") is used here\\n\\t\\t\\t\\tin a generic sense, comprising all the seas that exist:\\n\\t\\t\\t\\thence, the expression \"the like of it\" has been rendered\\n\\t\\t\\t\\tby me as \"sea upon sea\". (See also  31:27 )."
  }
]
