[
  {
    "SurahNumber": "26",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "The letters ta, sin and mim are among the mysterious,\\n\\t\\t\\t\\tdisjointed letter-symbols (al-muqatta'at) preceding some\\n\\t\\t\\t\\tof the chapters of the Qur'an (see Appendix II)."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "2",
    "NoteID": "2",
    "Body": "See surah {12}, note [2]."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "See notes [3] and [4] on  18:6 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "Inasmuch as the spiritual value of man's faith depends on\\n\\t\\t\\t\\tits being an outcome of free choice and not of\\n\\t\\t\\t\\tcompulsion, the visible or audible appearance of a\\n\\t\\t\\t\\t\"message from the skies\" would, by its very obviousness,\\n\\t\\t\\t\\tnullify the element of free choice and, therefore,\\n\\t\\t\\t\\tdeprive man's faith in that message of all its moral\\n\\t\\t\\t\\tsignificance."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "See {6:4-5} and the corresponding note [4]."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "9",
    "NoteID": "6",
    "Body": "The above two verses appear eight times in this surah.\\n\\t\\t\\t\\tApart from the present instance, they conclude, like a\\n\\t\\t\\t\\trefrain, each of the subsequent seven stories of earlier\\n\\t\\t\\t\\tprophets, which - by means of their, in places, almost\\n\\t\\t\\t\\tidentical phrasing - are meant to stress the essential\\n\\t\\t\\t\\tidentity of the ethical teachings of all the prophets, as\\n\\t\\t\\t\\twell as to illustrate the statement, in verse {5}, that a\\n\\t\\t\\t\\trejection of God's messages is a recurrent phenomenon in\\n\\t\\t\\t\\tthe history of mankind despite the fact that His\\n\\t\\t\\t\\texistence is clearly manifested in all living creation."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "11",
    "NoteID": "7",
    "Body": "Lit., \"Will they not be [or \"become\"] conscious [of me]?\"\\n\\t\\t\\t\\tZamakhshari and Razi understand this rhetorical question\\n\\t\\t\\t\\tin the sense apparent in my rendering, namely, as a\\n\\t\\t\\t\\tstatement of fact."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "13",
    "NoteID": "8",
    "Body": "Cf. {20:25-34} and the corresponding notes. In the\\n\\t\\t\\t\\tpresent context, stress is laid on the deep humility of\\n\\t\\t\\t\\tMoses, who considered himself incapable of fulfilling the\\n\\t\\t\\t\\ttask for which he had been chosen, and asked God to\\n\\t\\t\\t\\tentrust it to Aaron instead."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "14",
    "NoteID": "9",
    "Body": "Sc., \"and thus frustrate my mission\". This is a reference\\n\\t\\t\\t\\tto Moses' killing of the Egyptian which was the cause of\\n\\t\\t\\t\\this subsequent flight from his native land (cf.  28:15 \\n\\t\\t\\t\\tff.)"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "19",
    "NoteID": "10",
    "Body": "Lit., \"thou didst commit thy deed which thou hast\\n\\t\\t\\t\\tcommited\" - a construction meant to express the speaker's\\n\\t\\t\\t\\tutter condemnation of the deed referred to: hence, my\\n\\t\\t\\t\\tinterpolation of the word \"heinous\". As regards the above\\n\\t\\t\\t\\tallusions to Moses' childhood and youth at Pharaoh's\\n\\t\\t\\t\\tcourt, the manslaughter committed by him, and his flight\\n\\t\\t\\t\\tfrom Egypt, see {28:4-22}."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "21",
    "NoteID": "11",
    "Body": "As is shown in {28:15-16}, after having killed the\\n\\t\\t\\t\\tEgyptian, Moses suddenly realized that he had committed a\\n\\t\\t\\t\\tgrievous sin (see also note [15] on the last two\\n\\t\\t\\t\\tsentences of  28:15 )."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "22",
    "NoteID": "12",
    "Body": "See {28:4-5}."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "23",
    "NoteID": "13",
    "Body": "A reference to the terms in which Moses was to - and\\n\\t\\t\\t\\tapparently did - announce his mission (see verse {16}\\n\\t\\t\\t\\tabove)."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "24",
    "NoteID": "14",
    "Body": "Sc., \"by the evidence of His creative will in all that\\n\\t\\t\\t\\texists\": this proposition being, I believe, the main\\n\\t\\t\\t\\treason for a repetition of the story of Moses in the\\n\\t\\t\\t\\tpresent surah. (Cf. also verse {28} above.)"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "25",
    "NoteID": "15",
    "Body": "Lit., \"Do you not hear?\" - a rhetorical question meant to\\n\\t\\t\\t\\tconvey astonishment, indignation or derision, which may\\n\\t\\t\\t\\tbe idiomatically rendered in translation as above."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "28",
    "NoteID": "16",
    "Body": "Cf. {2:1-15}."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "29",
    "NoteID": "17",
    "Body": "In the religion of ancient Egypt, the king (or \"Pharaoh\",\\n\\t\\t\\t\\tas each of the rulers was styled) represented an\\n\\t\\t\\t\\tincarnation of the divine principle, and was considered\\n\\t\\t\\t\\tto be a god in his own right. Hence, a challenge to his\\n\\t\\t\\t\\tdivinity implied a challenge to the prevalent religious\\n\\t\\t\\t\\tsystem as a whole."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "30",
    "NoteID": "18",
    "Body": "For this rendering of the term mubin, see note [2] on\\n\\t\\t\\t\\t 12:1 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "33",
    "NoteID": "19",
    "Body": "See {7:107-108} and the corresponding note [85], as well\\n\\t\\t\\t\\tas  20:22 ,  27:12  and  28:32 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "35",
    "NoteID": "20",
    "Body": "Cf. {7:109-110} and the corresponding note [86]."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "40",
    "NoteID": "21",
    "Body": "There is no doubt that these \"sorcerers\" were priests of\\n\\t\\t\\t\\tthe official Amon cult, in which magic played an\\n\\t\\t\\t\\timportant role. Thus, their victory over Moses would\\n\\t\\t\\t\\tconstitute a public vindication of the state religion."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "41",
    "NoteID": "22",
    "Body": "See note [88] on  7:113 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "44",
    "NoteID": "23",
    "Body": "The reason for their premature sense of triumph is given\\n\\t\\t\\t\\tin  7:116  (\"they cast a spell upon the people’s eyes,\\n\\t\\t\\t\\tand struck them with awe\") and {20:66-67} (\"by virtue of\\n\\t\\t\\t\\ttheir sorcery, their [magic] ropes and staffs seemed to\\n\\t\\t\\t\\thim to be moving rapidly; and in his heart, Moses became\\n\\t\\t\\t\\tapprehensive\")."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "45",
    "NoteID": "24",
    "Body": "See note [89] on  7:117 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "49",
    "NoteID": "25",
    "Body": "See note [91] on  7:123 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "49",
    "NoteID": "26",
    "Body": "I.e., \"he is so superior a sorcerer that he could be your\\n\\t\\t\\t\\tteacher\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "49",
    "NoteID": "27",
    "Body": "See notes [44] and [45] on {5: 33}, and note [92] on\\n\\t\\t\\t\\t 7:124 , which explain the repeated stress on \"great\\n\\t\\t\\t\\tnumbers\" in the above sentence."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "52",
    "NoteID": "28",
    "Body": "I.e., after the period of plagues with which the\\n\\t\\t\\t\\tEgyptians were visited (cf.  7:130  ff.)."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "54",
    "NoteID": "29",
    "Body": "Lit., \"a small band\": Zamakhshari, however, suggests that\\n\\t\\t\\t\\tin this context the adjective qalilun is expressive of\\n\\t\\t\\t\\tcontempt, and does not necessarily denote \"few in\\n\\t\\t\\t\\tnumbers\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "56",
    "NoteID": "30",
    "Body": "Thus the Qur'an illustrates the psychological truth that,\\n\\t\\t\\t\\tas a rule, a dominant nation is unable really to\\n\\t\\t\\t\\tunderstand the desire for liberty on the part of the\\n\\t\\t\\t\\tgroup or groups which it oppresses, and therefore\\n\\t\\t\\t\\tattributes their rebelliousness to no more than\\n\\t\\t\\t\\tunreasonable hatred and blind envy of the strong."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "58",
    "NoteID": "31",
    "Body": "This is apparently an allusion to the honourable state\\n\\t\\t\\t\\tand the prosperity which the children of Israel had\\n\\t\\t\\t\\tenjoyed in Egypt for a few generations after the time of\\n\\t\\t\\t\\tJoseph - i.e., before a new Egyptian dynasty dispossessed\\n\\t\\t\\t\\tthem of their wealth and reduced them to the bondage from\\n\\t\\t\\t\\twhich Moses was to free them. In the above passage,\\n\\t\\t\\t\\tPharaoh seeks to justify his persecution of the\\n\\t\\t\\t\\tIsraelites by emphasizing their dislike (real of alleged)\\n\\t\\t\\t\\tof the Egyptians."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "59",
    "NoteID": "32",
    "Body": "This parenthetical sentence echoes the allusion, in\\n\\t\\t\\t\\t 7:137 , to the period of prosperity and honour which the\\n\\t\\t\\t\\tchildren of Israel were to enjoy in Palestine after their\\n\\t\\t\\t\\tsufferings in Egypt. The reference to \"heritage\" is, in\\n\\t\\t\\t\\tthis and in similar contexts, a metonym for God's\\n\\t\\t\\t\\tbestowal on the oppressed of a life of well-being and\\n\\t\\t\\t\\tdignity."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "63",
    "NoteID": "33",
    "Body": "See {20: 77} and the corresponding note [61]. Cf. also\\n\\t\\t\\t\\tthe Biblical account (Exodus xiv, 21), according to which\\n\\t\\t\\t\\t\"the Lord caused the sea to go back by a strong east wind\\n\\t\\t\\t\\tall that night, and made the sea dry land, and the waters\\n\\t\\t\\t\\twere divided\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "64",
    "NoteID": "34",
    "Body": "Lit., \"the others\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "66",
    "NoteID": "35",
    "Body": "From various indications in the Bible (in particular,\\n\\t\\t\\t\\tExodus xiv, 2 and 9), it appears that the miracle of the\\n\\t\\t\\t\\tcrossing of the Red Sea took place at the north-western\\n\\t\\t\\t\\textremity of what is known today as the Gulf of Suez. In\\n\\t\\t\\t\\tthose ancient times it was not as deep as it is now, and\\n\\t\\t\\t\\tin some respects may have resembled the shallow part of\\n\\t\\t\\t\\tthe North Sea between the mainland and the Frisian\\n\\t\\t\\t\\tIslands, with its total ebbs which lay bare the sandbanks\\n\\t\\t\\t\\tand make them temporarily passable, followed by sudden,\\n\\t\\t\\t\\tviolent tides which submerge them entirely."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "68",
    "NoteID": "36",
    "Body": "See note [6] on verses {8-9}."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "69",
    "NoteID": "37",
    "Body": "I.e., to the kind of people spoken of in verses {3-8} of\\n\\t\\t\\t\\tthis surah."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "74",
    "NoteID": "38",
    "Body": "The particle bal at the beginning of the sentence\\n\\t\\t\\t\\texpresses astonishment. Thus, evading a direct answer to\\n\\t\\t\\t\\tAbraham's criticism of idol-worship, his people merely\\n\\t\\t\\t\\tstress its antiquity, forgetting - as Zamakhshari points\\n\\t\\t\\t\\tout - that \"ancient usage and precedence in time are no\\n\\t\\t\\t\\tproof of [a concept's] soundness\". Razi, for his part,\\n\\t\\t\\t\\tstates that the above verse represents \"one of the\\n\\t\\t\\t\\tstrongest [Qur'anic] indications of the immorality\\n\\t\\t\\t\\t(fasad) inherent in [the principle of] taqlid'', i.e.,\\n\\t\\t\\t\\tthe blind, unquestioning adoption of religious concepts\\n\\t\\t\\t\\tor practices on the basis of one's uncritical faith in no\\n\\t\\t\\t\\tmore than the \"authority\" of a scholar or religious\\n\\t\\t\\t\\tleader."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "84",
    "NoteID": "39",
    "Body": "Lit., \"grant me a language of truth among the others\" or\\n\\t\\t\\t\\t\"the later ones\". For alternative interpretations of this\\n\\t\\t\\t\\tphrase, see note [36] on  19:50 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "86",
    "NoteID": "40",
    "Body": "Cf. {19:47-48}."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "87",
    "NoteID": "41",
    "Body": "Sc., \"by letting me see my father among the damned\"\\n\\t\\t\\t\\t(Zamakhshari)."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "93",
    "NoteID": "42",
    "Body": "Or: \"beside God\". Whenever the relative pronoun ma (\"that\\n\\t\\t\\t\\twhich\" or \"all that which\") is used in the Qur'an with\\n\\t\\t\\t\\treference to false objects of worship, it indicates not\\n\\t\\t\\t\\tmerely inanimate things (like idols, fetishes, supposedly\\n\\t\\t\\t\\t\"holy\" relics, etc.) or falsely deified saints, dead or\\n\\t\\t\\t\\talive, but also forces of nature, real or imaginary, as\\n\\t\\t\\t\\twell as man's \"worship\" of wealth, power, social\\n\\t\\t\\t\\tposition, etc. (See also {10:28-29} and the corresponding\\n\\t\\t\\t\\tnotes.)"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "94",
    "NoteID": "43",
    "Body": "Lit., \"into it\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "95",
    "NoteID": "44",
    "Body": "Cf. {2: 24}- \"the fire whose fuel is human beings and\\n\\t\\t\\t\\tstones\" - and the corresponding note [16]. The \"hosts of\\n\\t\\t\\t\\tIblis\" are the forces of evil (\"satan \") frequently\\n\\t\\t\\t\\tmentioned in the Qur'an in connection with man's sinning\\n\\t\\t\\t\\t(see note [10] on  2:14 , the first half of note [16] on\\n\\t\\t\\t\\t{15: 17}, as well as note [52] on  19:68 ; also cf.\\n\\t\\t\\t\\t 19:83  and the corresponding note [72])."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "96",
    "NoteID": "45",
    "Body": "Lit., \"while they quarrel with one another\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "99",
    "NoteID": "46",
    "Body": "Lit., \"yet none but those guilty ones (al-mujrimun) have\\n\\t\\t\\t\\tled us astray\": cf.  7:38 , {33:67-68}, {38:60-61} and\\n\\t\\t\\t\\tthe corresponding notes."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "102",
    "NoteID": "47",
    "Body": "Lit., \"would that there were a return for us\". See also\\n\\t\\t\\t\\t{6:27-28} and the corresponding note."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "104",
    "NoteID": "48",
    "Body": "Sc., \"and He may grant forgiveness to whomever He wills\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "111",
    "NoteID": "49",
    "Body": "See note [47] on  11:27 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "113",
    "NoteID": "50",
    "Body": "This is obviously a retort to the unbelievers' suggestion\\n\\t\\t\\t\\t(elliptically implied here) that those \"abject\" followers\\n\\t\\t\\t\\tof Noah had declared their faith in him, not out of\\n\\t\\t\\t\\tconviction, but only in order to gain some material\\n\\t\\t\\t\\tadvantages. Noah's answer embodies a cardinal principle\\n\\t\\t\\t\\tof Qur'anic ethics and, hence, of Islamic Law: No human\\n\\t\\t\\t\\tbeing has the right to sit in judgment on another\\n\\t\\t\\t\\tperson's faith or hidden motives; whereas God knows what\\n\\t\\t\\t\\tis in the hearts of men, society may judge only by\\n\\t\\t\\t\\texternal evidence (az-zahir), which comprises a person's\\n\\t\\t\\t\\twords as well as deeds. Thus, if anyone says, \"I am a\\n\\t\\t\\t\\tbeliever\", and does not act or speak in a manner\\n\\t\\t\\t\\tcontradicting his professed faith, the community must\\n\\t\\t\\t\\tconsider him a believer."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "116",
    "NoteID": "51",
    "Body": "Lit., \"thou wilt surely be among those who are stoned [to\\n\\t\\t\\t\\tdeath]\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "118",
    "NoteID": "52",
    "Body": "Or: \"decide Thou with a [clear] decision between me and\\n\\t\\t\\t\\tthem\". My choice of the primary significance of iftah\\n\\t\\t\\t\\t(\"lay open\", i.e., the truth) has been explained in note\\n\\t\\t\\t\\t[72] on the last sentence of  7:89 "
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "120",
    "NoteID": "53",
    "Body": "The story of Noah and his people, as well as of the\\n\\t\\t\\t\\tDeluge, is given in greater detail in {11:25-48}."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "121",
    "NoteID": "54",
    "Body": "For the message specifically alluded to here, see verses\\n\\t\\t\\t\\t{111-115}, as well as note [50] above."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "124",
    "NoteID": "55",
    "Body": "See  7:65  and the corresponding note [48]."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "128",
    "NoteID": "56",
    "Body": "The noun ayah, which primarily denotes \"a sign\" or \"a\\n\\t\\t\\t\\ttoken\", evidently refers here to the ancient Semitic\\n\\t\\t\\t\\tcustom of worshipping the tribal gods on hilltops, which\\n\\t\\t\\t\\twere crowned to this end by sacrificial altars or\\n\\t\\t\\t\\tmonuments, each of them devoted to a particular deity:\\n\\t\\t\\t\\thence my rendering of ayah, in this particular context,\\n\\t\\t\\t\\tas \"altars\" (in the plural)."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "129",
    "NoteID": "57",
    "Body": "The meaning could be either \"hoping that you might live\\n\\t\\t\\t\\tin them forever\", or \"that you might gain immortal renown\\n\\t\\t\\t\\tfor having built them\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "130",
    "NoteID": "58",
    "Body": "The term jabbar, when applied to man, as a rule denotes\\n\\t\\t\\t\\tone who is haughty, overbearing, exorbitant and cruel,\\n\\t\\t\\t\\tand does not submit to any moral restraints in his\\n\\t\\t\\t\\tdealings with those who are weaker than himself.\\n\\t\\t\\t\\tSometimes (as, e.g., in  11:59  or  14:15 ) this term is\\n\\t\\t\\t\\tused to describe a person's negative ethical attitude,\\n\\t\\t\\t\\tand in that case it may be rendered as \"enemy of the\\n\\t\\t\\t\\ttruth\". In the present instance, however, stress is laid\\n\\t\\t\\t\\ton the tyrannical behaviour of the tribe of 'Ad,\\n\\t\\t\\t\\tevidently relating to their warlike conflicts with other\\n\\t\\t\\t\\tpeople: and in this sense it expresses a Qur'anic\\n\\t\\t\\t\\tprohibition, valid for all times, of all unnecessary\\n\\t\\t\\t\\tcruelty in warfare, coupled with the positive,\\n\\t\\t\\t\\tclearly-implied injuction to subordinate every act of war\\n\\t\\t\\t\\t- as well as the decision to wage war as such - to moral\\n\\t\\t\\t\\tconsiderations and restraints."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "132",
    "NoteID": "59",
    "Body": "Lit., \"with all that you know\" or \"that you are [or\\n\\t\\t\\t\\t\"might be\"] aware of\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "137",
    "NoteID": "60",
    "Body": "Lit., \"the innate habit of the earlier people\\n\\t\\t\\t\\t(al-awwalin)\". The noun khuluq denotes one’s \"nature\" in\\n\\t\\t\\t\\tthe sense of \"innate disposition\" (tabi'ah)or \"moral\\n\\t\\t\\t\\tcharacter\" (Taj al-'Arus); hence the use of this term to\\n\\t\\t\\t\\tdescribe \"that to which one clings\", i.e., one’s \"innate\\n\\t\\t\\t\\thabit\" or \"custom\", and, in a specific sense, one’s\\n\\t\\t\\t\\treligion (ibid.)."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "139",
    "NoteID": "61",
    "Body": "The message referred to here is contained in verses\\n\\t\\t\\t\\t{128-130}, which point out the three cardinal sins\\n\\t\\t\\t\\tresulting from man's inordinate striving for power:\\n\\t\\t\\t\\tworship of anything apart from God, self-admiring search\\n\\t\\t\\t\\tfor \"glory\", and cruelty or harshness towards one's\\n\\t\\t\\t\\tfellow-men."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "142",
    "NoteID": "62",
    "Body": "For the story of Salih and the tribe of Thamud, see\\n\\t\\t\\t\\t 7:73  and the corresponding note [56]; also, the version\\n\\t\\t\\t\\tappearing in {11:61-68}."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "146",
    "NoteID": "63",
    "Body": "Lit., \"of what is here\", i.e., on earth. In the original,\\n\\t\\t\\t\\tthis question has a direct form, thus: \"Will you be left\\n\\t\\t\\t\\tsecure...?\", etc. (See also note [69] below.)"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "149",
    "NoteID": "64",
    "Body": "See note [59] on  7:74 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "154",
    "NoteID": "65",
    "Body": "Tabari: \"...that is to say, 'with an indication (dalalah)\\n\\t\\t\\t\\tand a proof that thou art to be trusted as regards thy\\n\\t\\t\\t\\tclaim that thou hast been sent to us by God'.\""
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "155",
    "NoteID": "66",
    "Body": "Cf. the second paragraph of  7:73  - \"This she-camel\\n\\t\\t\\t\\tbelonging to God shall be a token for you\" - and the\\n\\t\\t\\t\\tcorresponding note [57], which explains that the \"token\"\\n\\t\\t\\t\\tspoken of by Salih was to consist in the manner in which\\n\\t\\t\\t\\tthe tribe would treat the animal."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "155",
    "NoteID": "67",
    "Body": "Lit., \"on a day appointed\", which may mean either \"each\\n\\t\\t\\t\\ton a day appointed\" (i.e., by turns), or, more probably -\\n\\t\\t\\t\\tbecause more in consonance with the tribal customs of\\n\\t\\t\\t\\tancient Arabia - \"on the days appointed for the watering\\n\\t\\t\\t\\tof camels\": implying that on those days the ownerless\\n\\t\\t\\t\\tshe-camel should receive a full share of water side by\\n\\t\\t\\t\\tside with the herds and flocks belonging to the tribe."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "157",
    "NoteID": "68",
    "Body": "Lit., \"they became regretful\". For my rendering of\\n\\t\\t\\t\\t'aqaruha as \"they cruelly slaughtered her\", see note [61]\\n\\t\\t\\t\\ton  7:77 ."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "158",
    "NoteID": "69",
    "Body": "In my opinion, the specific message alluded to here\\n\\t\\t\\t\\trelates, in the first instance, to the individual\\n\\t\\t\\t\\tperson's emotional reluctance to visualize the limited,\\n\\t\\t\\t\\ttransitory character of his own life on earth (hinted at\\n\\t\\t\\t\\tin verses {146-149} above) and, hence, the judgment that\\n\\t\\t\\t\\tawaits everyone in the life to come; and, secondly, to\\n\\t\\t\\t\\tthe element of compassion for all other living beings as\\n\\t\\t\\t\\ta basis of true morality."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "160",
    "NoteID": "70",
    "Body": "The story of Lot and the sinful people among whom he\\n\\t\\t\\t\\tlived is narrated in greater detail in {11:69-83}."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "171",
    "NoteID": "71",
    "Body": "As is evident from  7:83 ,  11:81 ,  27:57  and\\n\\t\\t\\t\\t{29:32-33}, the old woman was Lots' wife - a native of\\n\\t\\t\\t\\tSodom - who chose to remain with her own people instead\\n\\t\\t\\t\\tof accompanying her husband, whom she thus betrayed (cf.\\n\\t\\t\\t\\talso  66:10 )."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "173",
    "NoteID": "72",
    "Body": "See  11:82  and the corresponding note [114]."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "173",
    "NoteID": "73",
    "Body": "Or, in the past tense: \"dire was the rain upon those who\\n\\t\\t\\t\\thad been warned\" - in which case this sentence would\\n\\t\\t\\t\\trefer specifically to the sinful people of Sodom and\\n\\t\\t\\t\\tGomorrah. However, it is much more probable that its\\n\\t\\t\\t\\tpurport is general (see note [115] on the last sentence\\n\\t\\t\\t\\tof  11:83 ). Zamakhshari's interpretation of the above\\n\\t\\t\\t\\tsentence is analogous to mine."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "177",
    "NoteID": "74",
    "Body": "See note [67] on the first sentence of  7:85 . The story\\n\\t\\t\\t\\tof Shu'ayb and the people of Madyan (the \"wooded dales\")\\n\\t\\t\\t\\tis given in greater detail in {11:84-95}."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "183",
    "NoteID": "75",
    "Body": "Cf. sBrah {7}, note [68]."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "184",
    "NoteID": "76",
    "Body": "An allusion to the ephemeral character of man’s life on\\n\\t\\t\\t\\tearth and, by implication, to God’s judgment."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "186",
    "NoteID": "77",
    "Body": "Lit., \"that thou art indeed one of the liars\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "189",
    "NoteID": "78",
    "Body": "This may refer either to the physical darkness which\\n\\t\\t\\t\\toften accompanies volcanic eruptions and earthquakes\\n\\t\\t\\t\\t(which, as shown in  7:91 , overtook the people of\\n\\t\\t\\t\\tMadyan), or to the spiritual darkness and gloom which\\n\\t\\t\\t\\tcomes in the wake of belated regrets."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "191",
    "NoteID": "79",
    "Body": "With this refrain ends the cycle of seven stories showing\\n\\t\\t\\t\\tthat spiritual truth in all its manifestations - whether\\n\\t\\t\\t\\tit relates to an intellectual realization of God’s\\n\\t\\t\\t\\texistence, to a refusal to regard power, wealth or fame\\n\\t\\t\\t\\tas real values, or to the virtues of compassion and\\n\\t\\t\\t\\tkindness towards all that lives on earth - has at all\\n\\t\\t\\t\\ttimes been unacceptable to the overwhelming majority of\\n\\t\\t\\t\\tmankind, and has always been submerged under the average\\n\\t\\t\\t\\tman’s blindness and deafness of heart. The very\\n\\t\\t\\t\\trepetition of phrases, sentences and situations in all of\\n\\t\\t\\t\\tthe above stories - or, rather, in the above versions of\\n\\t\\t\\t\\tthese oft-narrated stories - tends to bring home to us\\n\\t\\t\\t\\tthe fact that the human situation as such never really\\n\\t\\t\\t\\tchanges, and that, in consequence, those who preach the\\n\\t\\t\\t\\ttruth must always struggle against human greed,\\n\\t\\t\\t\\tpower-hunger and proneness to self-adulation."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "192",
    "NoteID": "80",
    "Body": "Thus the discourse returns to the theme enunciated at the\\n\\t\\t\\t\\tbeginning of this surah, namely, the phenomenon of divine\\n\\t\\t\\t\\trevelation as exemplified in the Qur’an, and men’s\\n\\t\\t\\t\\treactions to it."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "194",
    "NoteID": "81",
    "Body": "According to almost all the classical commentators, the\\n\\t\\t\\t\\texpression ar-ruh al-amin (lit., \"the faithful [or\\n\\t\\t\\t\\t\"trustworthy\"] spirit\") is a designation of Gabriel, the\\n\\t\\t\\t\\tAngel of Revelation, who, by virtue of his purely\\n\\t\\t\\t\\tspiritual, functional nature, is incapable of sinning and\\n\\t\\t\\t\\tcannot, therefore, be other than utterly faithful to the\\n\\t\\t\\t\\ttrust reposed in him by God (cf.  16:50 ). On the other\\n\\t\\t\\t\\thand, since the term ruh is often used in the Qur'an in\\n\\t\\t\\t\\tthe sense of \"divine inspiration\" (see surah {2}, note\\n\\t\\t\\t\\t[71], and surah {16}, note [2]), it may have this latter\\n\\t\\t\\t\\tmeaning in the above context as well, especially in view\\n\\t\\t\\t\\tof the statement that it had \"alighted from on high upon\\n\\t\\t\\t\\tthe heart\" of the Prophet."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "195",
    "NoteID": "82",
    "Body": "See  14:4  - \"never have We sent forth any apostle\\n\\t\\t\\t\\totherwise than [with a message] in his own people’s\\n\\t\\t\\t\\ttongue\" - and the corresponding note [3]. That the\\n\\t\\t\\t\\tmessage of the Qur'an is, nevertheless, universal has\\n\\t\\t\\t\\tbeen stressed in many of its verses (e.g., in  7:158  or\\n\\t\\t\\t\\t 25:1 ). The other prophets mentioned in the Qur'an who\\n\\t\\t\\t\\t\"preached in the Arabic tongue\" were Ishmael, Hud, Salih\\n\\t\\t\\t\\tand Shu'ayb, all of them Arabians. In addition, if we\\n\\t\\t\\t\\tbear in mind that Hebrew and Aramaic are but ancient\\n\\t\\t\\t\\tArabic dialects, all the Hebrew prophets may be included\\n\\t\\t\\t\\tamong \"those who preached in the Arabic tongue\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "196",
    "NoteID": "83",
    "Body": "Lit., \"in the scriptures (zubur, sing. zabur) of the\\n\\t\\t\\t\\tancients\" (see surah {21}, note [101]). This\\n\\t\\t\\t\\tinterpretation of the above verse - advanced among others\\n\\t\\t\\t\\tby Zamakhshari and Baydawi (and, according to the former,\\n\\t\\t\\t\\tattributed to Imam Abu Hanifah as well) - is in full\\n\\t\\t\\t\\tconsonance with the oft-repeated Qur'anic doctrine that\\n\\t\\t\\t\\tthe basic teachings revealed to Muhammad are in their\\n\\t\\t\\t\\tpurport (ma'ani) identical with those preached by the\\n\\t\\t\\t\\tearlier prophets. Another, more popular interpretation\\n\\t\\t\\t\\tis, \"...this [Qur'an] has been mentioned [or \"foretold\"]\\n\\t\\t\\t\\tin the earlier scriptures\" (see in this connection note\\n\\t\\t\\t\\t[33] on  2:42  and - with particular reference to a\\n\\t\\t\\t\\tprediction made by Jesus - note [6] on  61:6 )."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "197",
    "NoteID": "84",
    "Body": "I.e., for those who disbelieve in the prophethood of\\n\\t\\t\\t\\tMuhammad."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "197",
    "NoteID": "85",
    "Body": "Sc., \"and in consequence have become Muslims\": for\\n\\t\\t\\t\\tinstance, 'Abd Allah ibn Salam, Ka'b ibn Malik and other\\n\\t\\t\\t\\tlearned Jews of Medina in the lifetime of the Prophet,\\n\\t\\t\\t\\tKa'b al-Ahbar the Yemenite and a number of his\\n\\t\\t\\t\\tcompatriots during the reign of 'Umar, and countless\\n\\t\\t\\t\\tothers throughout the world who embraced Islam in the\\n\\t\\t\\t\\tcourse of centuries. The reason why only learned Jews and\\n\\t\\t\\t\\tnot learned Christians as well are spoken of in this\\n\\t\\t\\t\\tcontext lies in the fact that - contrary to the Torah,\\n\\t\\t\\t\\twhich still exists, albeit in a corrupted form - the\\n\\t\\t\\t\\toriginal revelation granted to Jesus has been lost (see\\n\\t\\t\\t\\tsurah {3}, note [4]) and cannot, therefore, be cited in\\n\\t\\t\\t\\tevidence of the basic identity of his teachings with\\n\\t\\t\\t\\tthose of the Qur'an."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "199",
    "NoteID": "86",
    "Body": "As the Qur'an points out in many places, most of the\\n\\t\\t\\t\\tMeccan contemporaries of Muhammad refused in the\\n\\t\\t\\t\\tbeginning to believe in his prophethood on the ground\\n\\t\\t\\t\\tthat God could not have entrusted \"a man from among\\n\\t\\t\\t\\tthemselves\" with His message: and this in spite of the\\n\\t\\t\\t\\tfact that the Qur'an was expressed \"in the clear Arabic\\n\\t\\t\\t\\ttongue\", which they could fully understand: but (so the\\n\\t\\t\\t\\targument goes) if the Prophet had been a foreigner, and\\n\\t\\t\\t\\this message expressed in a non-Arabic tongue, they would\\n\\t\\t\\t\\thave been even less prepared to accept it- for then they\\n\\t\\t\\t\\twould have had the legitimate excuse that they were\\n\\t\\t\\t\\tunable to understand it (cf.  41:44 )."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "200",
    "NoteID": "87",
    "Body": "I.e., not to take root in their hearts, but to \"go into\\n\\t\\t\\t\\tone ear and out of the other\". As regards Clod's\\n\\t\\t\\t\\t\"causing\" this to happen, see surah {2}, note [7], and\\n\\t\\t\\t\\tsurah {14}, note [4]."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "203",
    "NoteID": "88",
    "Body": "I.e., a second chance in life."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "204",
    "NoteID": "89",
    "Body": "For this sarcastic demand of the unbelievers, see  6:57 \\n\\t\\t\\t\\tand  8:32 , as well as the corresponding notes; also\\n\\t\\t\\t\\tverse {187} of the present surah."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "209",
    "NoteID": "90",
    "Body": "Lit., \"unless it had its warners by way of a reminder\":\\n\\t\\t\\t\\tsee  6:131 ,  15:4 ,  20:134 , and the corresponding\\n\\t\\t\\t\\tnotes."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "210",
    "NoteID": "91",
    "Body": "During the early years of his prophetic mission, some of\\n\\t\\t\\t\\tMuhammad's Meccan opponents tried to explain the\\n\\t\\t\\t\\trhetorical beauty and persuasiveness of the Qur'an by\\n\\t\\t\\t\\tinsinuating that he was a soothsayer (kahin) in communion\\n\\t\\t\\t\\twith all manner of dark forces and evil spirits\\n\\t\\t\\t\\t(shayatin)."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "213",
    "NoteID": "92",
    "Body": "The conjunctive particle fa at the beginning of this\\n\\t\\t\\t\\tsentence (rendered here as \"hence\") evidently connects\\n\\t\\t\\t\\twith verse {208} above. As shown in note [94] below, the\\n\\t\\t\\t\\twhole of the present passage is addressed to man in\\n\\t\\t\\t\\tgeneral."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "214",
    "NoteID": "93",
    "Body": "A believer is morally obliged to preach the truth to all\\n\\t\\t\\t\\twhom he can reach, but obviously he must begin with those\\n\\t\\t\\t\\twho are nearest to him, and especially those who\\n\\t\\t\\t\\trecognize his authority."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "215",
    "NoteID": "94",
    "Body": "For an explanation of the metaphorical expression \"lower\\n\\t\\t\\t\\tthy wing\"-rendered by me as \"spread the wings of thy\\n\\t\\t\\t\\ttenderness\" - see  17:24  and the corresponding note\\n\\t\\t\\t\\t[28]. The phrase \"all of the believers who follow thee\"\\n\\t\\t\\t\\tshows that (contrary to the assumption of most of the\\n\\t\\t\\t\\tcommentators) the above passage is not addressed to the\\n\\t\\t\\t\\tProphet - since all who believe in him are, by\\n\\t\\t\\t\\tdefinition, his followers, and vice versa - but to\\n\\t\\t\\t\\teveryone who chooses to be guided by the Qur'an, and who\\n\\t\\t\\t\\tis herewith called upon to extend his loving kindness and\\n\\t\\t\\t\\tcare to all believers who may \"follow\" him, i.e., who may\\n\\t\\t\\t\\tregard him as spiritually or intellectually superior or\\n\\t\\t\\t\\tmore experienced. This interpretation also explains verse\\n\\t\\t\\t\\t{213} above: for whereas the exhortation contained in\\n\\t\\t\\t\\tthat verse is meaningful with regard to all who may\\n\\t\\t\\t\\tlisten to or read the Qur'an, it would be meaningless\\n\\t\\t\\t\\twith reference to its Prophet, for whom the principle of\\n\\t\\t\\t\\tGod's oneness and uniqueness was the unquestionable\\n\\t\\t\\t\\tbeginning and end of all truth."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "218",
    "NoteID": "95",
    "Body": "According to Mujahid (as quoted by Tabari), this means\\n\\t\\t\\t\\t\"wherever thou mayest be\". Other commentators take it to\\n\\t\\t\\t\\tmean \"when thou standest up for prayer\", but this seems\\n\\t\\t\\t\\tto be too narrow an interpretation."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "219",
    "NoteID": "96",
    "Body": "I.e., among the believers, as contrasted with those who\\n\\t\\t\\t\\t\"disobey thee\" (see verse {216} above)."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "222",
    "NoteID": "97",
    "Body": "The term affak, which literally denotes \"a great [or\\n\\t\\t\\t\\t\"habitual\"] liar\", has here the meaning of \"one who lies\\n\\t\\t\\t\\tto himself\": this is brought out in the next verse, which\\n\\t\\t\\t\\tstresses the psychological fact that most of such\\n\\t\\t\\t\\tself-deceivers readily lie to others as well."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "223",
    "NoteID": "98",
    "Body": "Lit., \"most of them are lying\"."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "224",
    "NoteID": "99",
    "Body": "An allusion to the fact that some of the pagan Arabs\\n\\t\\t\\t\\tregarded the Qur'an as a product of Muhammad's supposedly\\n\\t\\t\\t\\tpoetic mind. (See also  36:69  and the corresponding\\n\\t\\t\\t\\tnotes [38] and [39].)"
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "225",
    "NoteID": "100",
    "Body": "The idiomatic phrase hama fi widyan (lit., \"he wandered\\n\\t\\t\\t\\t[or \"roamed\"] through valleys\") is used, as most of the\\n\\t\\t\\t\\tcommentators point out, to describe a confused or aimless\\n\\t\\t\\t\\t- and often self-contradictory - play with words and\\n\\t\\t\\t\\tthoughts. In this context it is meant to stress the\\n\\t\\t\\t\\tdifference between the precision of the Qur'an, which is\\n\\t\\t\\t\\tfree from all inner contradictions (cf. note [97] on\\n\\t\\t\\t\\t 4:82 ), and the vagueness often inherent in poetry."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "227",
    "NoteID": "101",
    "Body": "Thus the Qur'an makes it clear that a true believer may\\n\\t\\t\\t\\tfight only in self-defence: cf. {22:39-40}, the earliest\\n\\t\\t\\t\\treference to war as such, and {2:190-194}, where the\\n\\t\\t\\t\\tcircumstances making war fully justified are further\\n\\t\\t\\t\\telaborated."
  },
  {
    "SurahNumber": "26",
    "AyahNumber": "227",
    "NoteID": "102",
    "Body": "Lit., \"by what [kind of] turning they will turn\"."
  }
]
