[
  {
    "SurahNumber": "14",
    "AyahNumber": "1",
    "Text": "Alif L'am Ra. O Muhammad! This is a Book which We have revealed\\n\\t\\t\\tto you so that you may bring mankind out of utter darkness (ways\\n\\t\\t\\tof ignorance) to the light; by the leave of their Rabb, to the\\n\\t\\t\\tWay of the Mighty, the Praiseworthy (Allah),"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "2",
    "Text": "the One to Whom belongs all that is in the heavens and the earth.\\n\\t\\t\\tWoe to the unbelievers, for they will be sternly punished."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "3",
    "Text": "They are the ones who love the life of this world more than the\\n\\t\\t\\thereafter, who debar others from the Way of Allah and seek to\\n\\t\\t\\tmake it crooked: they have gone far astray into error."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "4",
    "Text": "We have not sent any Rasool except that he speaks the language of\\n\\t\\t\\this own people, so that he could explain to them clearly. Then\\n\\t\\t\\tAllah leaves in error whom He will and guides whom He pleases: He\\n\\t\\t\\tis the Mighty, the Wise."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "5",
    "Text": "We sent Musa with Our signs, saying: \"Lead your people out of\\n\\t\\t\\tutter darkness into light, and remind them to learn lessons from\\n\\t\\t\\tthe Days of Allah (Divine history).\" Surely there are signs in\\n\\t\\t\\tthis for every steadfast, thankful person."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "6",
    "Text": "Recall! When Musa said to his people: \"Remember Allah's favor to\\n\\t\\t\\tyou when He delivered you from the people of Fir'on (Pharaoh),\\n\\t\\t\\twho subjected you to cruel afflictions, putting your sons to\\n\\t\\t\\tdeath and sparing your females, and in this there was a\\n\\t\\t\\ttremendous trial from your Rabb.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "7",
    "Text": "Remember that your Rabb had forewarned: \"If you are grateful, I\\n\\t\\t\\twill bestow abundance upon you, but if you are ungrateful (then\\n\\t\\t\\tyou should know that) My punishment will be terrible indeed.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "8",
    "Text": "Musa said: \"If you and all the dwellers of the earth become\\n\\t\\t\\tthankless, you should know that He does not stand in need of any\\n\\t\\t\\tof you, surely Allah is the Self-sufficient, Praiseworthy.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "9",
    "Text": "Have you not heard the information of those who passed away\\n\\t\\t\\tbefore you, the people of Nuh (Noah), `Ad and Thamud, and those\\n\\t\\t\\twho came after them? Allah Alone knows them. Their Rasools came\\n\\t\\t\\tto them with clear signs; but they bit their hands with their\\n\\t\\t\\tmouths and said: \"Certainly we reject the Message with which you\\n\\t\\t\\thave been sent and certainly we strongly doubt the faith to which\\n\\t\\t\\tyou invite us.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "10",
    "Text": "Their Rasools responded: \"Are you doubting the existence of\\n\\t\\t\\tAllah, Who is the Creator of the heavens and the earth? He is the\\n\\t\\t\\tOne Who invites you so that He may forgive your sins and give you\\n\\t\\t\\trespite till your appointed term.\" They said: \"You are nothing\\n\\t\\t\\tbut a human like us! You only wish to turn us away from the\\n\\t\\t\\tworship of those deities whom our forefathers used to worship.\\n\\t\\t\\tBring us some clear sign.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "11",
    "Text": "Their Rasools said to them: \"It is true that we are human like\\n\\t\\t\\tyourselves, but Allah bestows His grace of appointing a Rasool on\\n\\t\\t\\tsuch of His servants as He pleases. It is not in our power to\\n\\t\\t\\tbring you any sign except by Allah's permission, and in Allah let\\n\\t\\t\\tthe believers put their trust."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "12",
    "Text": "What reason do we have not to put our trust in Allah, when He has\\n\\t\\t\\talready guided us to the ways of our lives? We shall certainly\\n\\t\\t\\tendure your persecution patiently, and those who want to put\\n\\t\\t\\ttheir trust, should put their trust in Allah.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "13",
    "Text": "Finally the unbelievers said to their Rasools: \"Return to our\\n\\t\\t\\treligion or we will expel you from our land.\" But their Rabb\\n\\t\\t\\trevealed His will to them: \"We shall destroy the wrongdoers"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "14",
    "Text": "and give you the land to dwell in after they are gone! This is\\n\\t\\t\\tthe reward for the ones who dread My eminence and fear My\\n\\t\\t\\tthreats.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "15",
    "Text": "The Rasools called for judgement, (and when the judgement was\\n\\t\\t\\tpassed) every tyrant opposer of the Truth was disappointed."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "16",
    "Text": "Hell is next for him wherein he will be given festering water to\\n\\t\\t\\tdrink;"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "17",
    "Text": "he will sip, but never will be able to swallow. Death will\\n\\t\\t\\tsurround him from all sides, yet he will not die; beyond that\\n\\t\\t\\tthere will be horrible punishment."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "18",
    "Text": "The parable of the deeds of those who deny their Rabb is that\\n\\t\\t\\ttheir deeds are like ashes which the wind scatters on a stormy\\n\\t\\t\\tday; they will gain nothing from their deeds, and this is to\\n\\t\\t\\tstray far away from the goal of getting back to Paradise."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "19",
    "Text": "Do you not see that Allah has based the creation of the heavens\\n\\t\\t\\tand the earth on Truth? That He can destroy you if He wills and\\n\\t\\t\\tbring into being a new creation?"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "20",
    "Text": "That is not at all difficult for Allah."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "21",
    "Text": "When all people appear before Allah, those who were weak in the\\n\\t\\t\\tworld will say to those who thought themselves mighty: \"We were\\n\\t\\t\\tyour followers. Now! Can you do anything to relieve us from the\\n\\t\\t\\tpunishment of Allah?\" They will reply: \"Had Allah given us\\n\\t\\t\\tguidance, we would have guided you. Now it makes no difference\\n\\t\\t\\twhether we panic or bear it with patience, for there is no escape\\n\\t\\t\\tfor us.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "22",
    "Text": "Once the matter has been decided, Shaitan will say: \"In fact, the\\n\\t\\t\\tpromises which Allah made to you were all true; I too made some\\n\\t\\t\\tpromises to you but failed to keep any of them. However, I had no\\n\\t\\t\\tpower over you. I just invited you, and you accepted my\\n\\t\\t\\tinvitation. Now! Do not blame me, but blame yourselves. I cannot\\n\\t\\t\\thelp you, nor you can help me. I reject what you did before; that\\n\\t\\t\\tyou associated me with Allah. Certainly such wrongdoers will have\\n\\t\\t\\tpainful punishment.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "23",
    "Text": "Those who believe and do good deeds will be admitted to Paradise,\\n\\t\\t\\tbeneath which rivers flow, to live therein forever with the\\n\\t\\t\\tpermission of their Rabb, and their greetings therein will be:\\n\\t\\t\\t\"Peace!\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "24",
    "Text": "Do you not see how Allah gave the example of comparing a good\\n\\t\\t\\tword with a good tree, whose roots are firm and its branches are\\n\\t\\t\\tin the sky?"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "25",
    "Text": "It yields its fruits in every season by Allah's leave. Allah\\n\\t\\t\\tcites these examples for men so that they may learn a lesson from\\n\\t\\t\\tthem."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "26",
    "Text": "But the example of an evil word is that of an evil tree, which is\\n\\t\\t\\ttorn out from the earth and has no stability."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "27",
    "Text": "With firm words, Allah makes the believers steadfast in the life\\n\\t\\t\\tof this world and in the hereafter; but Allah lets the wrongdoers\\n\\t\\t\\tgo astray. Allah does what He pleases."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "28",
    "Text": "Have you not seen those people who have responded to the favors\\n\\t\\t\\tof Allah with ingratitude and drive their people into the House\\n\\t\\t\\tof Perdition?"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "29",
    "Text": "Which is hell! Wherein they shall burn, an evil place to live."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "30",
    "Text": "They set up equals with Allah to mislead people from His Way.\\n\\t\\t\\tTell them: \"Well, you may enjoy yourself for a while, but your\\n\\t\\t\\tfinal destination is going to be hellfire.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "31",
    "Text": "O Prophet, tell My devotees who have believed, to establish Salah\\n\\t\\t\\t(regular five times daily prayers) and spend in charity openly\\n\\t\\t\\tand secretly out of the sustenance which We have given them,\\n\\t\\t\\tbefore the coming of that Day in which there will neither be\\n\\t\\t\\ttrading nor any friendship."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "32",
    "Text": "It is Allah , Who has created the heavens and the earth. He sends\\n\\t\\t\\tdown water from the sky with which He brings forth fruits for\\n\\t\\t\\tyour sustenance. He has made the ships subservient to you, that\\n\\t\\t\\tthey may sail through the sea by His command; and likewise the\\n\\t\\t\\trivers are made for your benefit."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "33",
    "Text": "The sun and the moon are also assigned for your benefit, which\\n\\t\\t\\tsteadfastly pursue their courses, to cause the night and the day\\n\\t\\t\\tfor your benefit."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "34",
    "Text": "He has given you all that you could ask for and if you want to\\n\\t\\t\\tcount the favors of Allah, you will never be able to count them.\\n\\t\\t\\tIn fact, man is unjust, thankless."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "35",
    "Text": "Remember when Ibrahim (Abraham) said: \"My Rabb! Make this city a\\n\\t\\t\\tcity of peace and save me and my sons from the worship of idols."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "36",
    "Text": "O Rabb! They have indeed led many people astray (and they might\\n\\t\\t\\tled my descendants astray as well). Therefore, only those who\\n\\t\\t\\tfollow my ways belong to me and I leave those to You who disobey\\n\\t\\t\\tme; surely You are Forgiving, Merciful."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "37",
    "Text": "Our Rabb! I have settled some of my offspring in a barren valley\\n\\t\\t\\tnear Your Sacred House. Our Rabb! I have done this in the hope\\n\\t\\t\\tthat they would establish Salah, therefore, turn the hearts of\\n\\t\\t\\tthe people toward them and provide them with fruits so that they\\n\\t\\t\\tmay give thanks."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "38",
    "Text": "Our Rabb! Certainly You know what we conceal and what we reveal.\\n\\t\\t\\tIn fact, nothing in the earth or in heaven is hidden from Allah."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "39",
    "Text": "Praise be to Allah who has given me Isma`il (Ishmael) and Ishaq\\n\\t\\t\\t(Isaac) in my old age. Indeed my Rabb hears all prayers."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "40",
    "Text": "O Rabb! Make me and my descendants establish Salah. Our Rabb!\\n\\t\\t\\tAccept my prayer."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "41",
    "Text": "Our Rabb! Forgive me and my parents and all believers on the Day\\n\\t\\t\\twhen the accountability will take place.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "42",
    "Text": "Never think that Allah is unaware of what these unjust people are\\n\\t\\t\\tdoing. He is only deferring their case to that Day when their\\n\\t\\t\\teyes will be fixedly open,"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "43",
    "Text": "they will be running in terror with their heads uplifted, staring\\n\\t\\t\\tbut seeing nothing and their hearts utterly vacant."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "44",
    "Text": "O Muhammad forewarn mankind of the Day when Our punishment will\\n\\t\\t\\tovertake them; when the wrongdoers will say: \"Our Rabb! Give us a\\n\\t\\t\\tlittle more respite: we will answer Your call and follow the\\n\\t\\t\\tRasools!\" But it will be said to them, \"Are you not the same\\n\\t\\t\\tpeople who once swore that you would never suffer a decline?"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "45",
    "Text": "When you lived among those people who had wronged their souls, it\\n\\t\\t\\twas explained to you how We dealt with them and We even described\\n\\t\\t\\tfor you their examples.\""
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "46",
    "Text": "They hatched their plots but their plots were well within the\\n\\t\\t\\tsight of Allah, even though these were such which could move\\n\\t\\t\\tmountains."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "47",
    "Text": "Never think that Allah will break the promise which He made to\\n\\t\\t\\tHis Rasools: surely Allah is Mighty in power, the Lord of\\n\\t\\t\\tRetribution."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "48",
    "Text": "Warn them of the Day when the earth will be changed to a\\n\\t\\t\\tdifferent earth and the heavens as well, and all of them will\\n\\t\\t\\tstand before Allah, the One, the Irresistible;"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "49",
    "Text": "and on that Day you will see the criminals bound together in\\n\\t\\t\\tchains,"
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "50",
    "Text": "their garments will be made of tar and their faces will be\\n\\t\\t\\tcovered with flames."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "51",
    "Text": "Allah will requite each soul according to its deeds; surely Allah\\n\\t\\t\\tis swift in taking the account."
  },
  {
    "SurahNumber": "14",
    "AyahNumber": "52",
    "Text": "This is a proclamation for mankind: let them take warning\\n\\t\\t\\ttherefrom; let them know that He is the One and Only - worthy of\\n\\t\\t\\tworship - and let the men of understanding learn a lesson."
  }
]
