[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/063001",
        "Body":  "When the hypocrites come unto thee (O Muhammad), they say: We\n\t\t\tbear witness that thou art indeed Allah\u0027s messenger. And Allah\n\t\t\tknoweth that thou art indeed His messenger, and Allah beareth\n\t\t\twitness that the Hypocrites are speaking falsely."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/063010",
        "Body":  "And spend of that wherewith We have provided you before death\n\t\t\tcometh unto one of you and he saith: My Lord! If only thou\n\t\t\twouldst reprieve me for a little while, then I would give alms\n\t\t\tand be among the righteous."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/063011",
        "Body":  "But Allah reprieveth no soul when its term cometh, and Allah is\n\t\t\tAware of what ye do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/063002",
        "Body":  "They make their faith a pretext that they may turn (men) from the\n\t\t\tway of Allah. Verily evil is that which they are wont to do,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/063003",
        "Body":  "That is because they believed, then disbelieved, therefore their\n\t\t\thearts are sealed so that they understand not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/063004",
        "Body":  "And when thou seest them their figures please thee; and if they\n\t\t\tspeak thou givest ear unto their speech. (They are) as though\n\t\t\tthey were blocks of wood in striped cloaks. They deem every shout\n\t\t\tto be against them. They are the enemy, so beware of them. Allah\n\t\t\tconfound them! How they are perverted!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/063005",
        "Body":  "And when it is said unto them: Come! The messenger of Allah will\n\t\t\task forgiveness for you! they avert their faces and thou seest\n\t\t\tthem turning away, disdainful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/063006",
        "Body":  "Whether thou ask forgiveness for them or ask not forgiveness for\n\t\t\tthem, Allah will not forgive them. Lo! Allah guideth not the\n\t\t\tevil-living folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/063007",
        "Body":  "They it is who say: Spend not on behalf of those (who dwell) with\n\t\t\tAllah\u0027s messenger that they may disperse (and go away from you);\n\t\t\twhen Allah\u0027s are the treasures of the heavens and the earth; but\n\t\t\tthe hypocrites comprehend not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/063008",
        "Body":  "They say: Surely, if we return to Al Madinah the mightier will\n\t\t\tsoon drive out the weaker; when might belongeth to Allah and to\n\t\t\tHis messenger and the believers; but the hypocrites know not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "63",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/063009",
        "Body":  "O ye who believe! Let not your wealth nor your children distract\n\t\t\tyou from remembrance of Allah. Those who do so, they are the\n\t\t\tlosers."
    }
]
