[
  {
    "SurahNumber": "21",
    "AyahNumber": "1",
    "NoteID": "2662",
    "Body": "Every minute sees them nearer to their doom, and yet they\\n\\t\\t\\t\\tare sadly heedless, and even actively turn away from the\\n\\t\\t\\t\\tMessage that would save them."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "2",
    "NoteID": "2663",
    "Body": "In each age, when the Message of Allah is renewed, the\\n\\t\\t\\t\\tvery people who should have known better and welcomed the\\n\\t\\t\\t\\trenewal and the sweeping away of human cobwebs, either\\n\\t\\t\\t\\treceive it with amused self-superiority, which later tums\\n\\t\\t\\t\\tto active hostility, or with careless indifference."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "3",
    "NoteID": "2664",
    "Body": "Allah's Message is free and open, in the full light of\\n\\t\\t\\t\\tday. His enemies plot against it in secrecy, lest their\\n\\t\\t\\t\\town false motives be exposed. Their jealousy prevents\\n\\t\\t\\t\\tthem from accepting a \"man like themselves\" as a teacher\\n\\t\\t\\t\\tor warner or guide."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "3",
    "NoteID": "2665",
    "Body": "Literally, \"in a state in which you (actually) see (that\\n\\t\\t\\t\\tit is witchcraft)\". When Allah's Messenger is proved to\\n\\t\\t\\t\\tbe above them in moral worth, in true insight, in\\n\\t\\t\\t\\tearnestness and power of eloquence, they accuse him of\\n\\t\\t\\t\\twitchcraft, a word which may mean nothing, or perhaps\\n\\t\\t\\t\\tsome mysterious deceitful arts."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "4",
    "NoteID": "2666",
    "Body": "Notice that in the usual Arabic texts (that is, according\\n\\t\\t\\t\\tto the Qiraat of Hafs) the word qala is here and in xxi.\\n\\t\\t\\t\\t112 below, as well as in xxiii. 112, spelt differently\\n\\t\\t\\t\\tfrom the usual spelling of the word in other places (e.g.\\n\\t\\t\\t\\tin xx. 125-126). Qul is the reading of the Basra Qiraat,\\n\\t\\t\\t\\tmeaning, \"Say thou\" in the imperative. If we construe \"he\\n\\t\\t\\t\\tsays\", the pronoun refers to \"this (one)\" in the\\n\\t\\t\\t\\tpreceding verse, viz.: the Prophet. But more than one\\n\\t\\t\\t\\tCommentator understands the meaning in the imperative,\\n\\t\\t\\t\\tand I agree with them. The point is merely one of verbal\\n\\t\\t\\t\\tconstruction. The meaning is the same in either case. See\\n\\t\\t\\t\\tn. 2948 to xxiii. 112."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "4",
    "NoteID": "2667",
    "Body": "Every word, whether whispered in secret (as in xxi. 3\\n\\t\\t\\t\\tabove) or spoken openly, is known to Allah. Let not the\\n\\t\\t\\t\\twrong-doers imagine that their secret plots are secret to\\n\\t\\t\\t\\tthe Knower of all things."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "5",
    "NoteID": "2668",
    "Body": "The charges against Allah's inspired Messenger are heaped\\n\\t\\t\\t\\tup, \"Magic!\" says one: that means, \"We don't understand\\n\\t\\t\\t\\tit!\" Says another, \"Oh! but we know! he is a mere dreamer\\n\\t\\t\\t\\tof confused dreams!\" If the \"dreams\" fit in with real\\n\\t\\t\\t\\tthings and vital experiences, another will suggest, \"Oh\\n\\t\\t\\t\\tyes! why drag in supernatural agencies? he is clever\\n\\t\\t\\t\\tenough to forge it himself!\" Or another suggests, \"He is\\n\\t\\t\\t\\ta poet! Poets can invent things and say them in beautiful\\n\\t\\t\\t\\twords!\" Another interposes, \"What we should like to see\\n\\t\\t\\t\\tis miracles, like those we read of in stories of the\\n\\t\\t\\t\\tProphets of old!\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "6",
    "NoteID": "2669",
    "Body": "'If such miracles as you read of failed to convince\\n\\t\\t\\t\\tUnbelievers of old, what chance is there that these\\n\\t\\t\\t\\tUnbelievers will believe? Miracles may come, but they are\\n\\t\\t\\t\\tno cures for Unbelief."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "7",
    "NoteID": "2670",
    "Body": "See xvi. 43 and n. 2069. This answers the Unbelievers'\\n\\t\\t\\t\\ttaunt, \"he is just a man like ourselves!\" True, but all\\n\\t\\t\\t\\tmessengers sent by Allah were men, not angels or another\\n\\t\\t\\t\\tkind of beings, who could not understand men or whom men\\n\\t\\t\\t\\tcould not understand."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "8",
    "NoteID": "2671",
    "Body": "As men they were subject to all the laws governing the\\n\\t\\t\\t\\tphysical bodies of men. They ate and drank, and their\\n\\t\\t\\t\\tbodies perished in death."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "9",
    "NoteID": "2672",
    "Body": "But, however difficult (or impossible) their mission may\\n\\t\\t\\t\\thave appeared to them, or to the world at first, they won\\n\\t\\t\\t\\tthrough eventually, even those who seemed to have been\\n\\t\\t\\t\\tdefeated. Examples are given in the latter part of this\\n\\t\\t\\t\\tSura, especially in xxi. 51-93. They were delivered from\\n\\t\\t\\t\\tthe Wrath which overtook the Unbelievers, as were those\\n\\t\\t\\t\\twith them who accepted Allah's Message and placed\\n\\t\\t\\t\\tthemselves in conformity with His Will and Plan. That is\\n\\t\\t\\t\\tthe meaning of \"whom We willed.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "12",
    "NoteID": "2673",
    "Body": "When they had every chance of repentance and reform, they\\n\\t\\t\\t\\trejected Allah's Message, and perhaps even put up an open\\n\\t\\t\\t\\tdefiance. When they actually began to feel the Wrath\\n\\t\\t\\t\\tcoming, they began to flee, but it was too late! Besides,\\n\\t\\t\\t\\twhere could they flee to from the Wrath of Allah? Hence\\n\\t\\t\\t\\tthe ironical appeal to them in the next verse: better go\\n\\t\\t\\t\\tback to your luxuries and what you thought were your\\n\\t\\t\\t\\tpermanent homes! Cf. Christ's saying in the present\\n\\t\\t\\t\\tGospel of St. Matthew (iii. 7): \"O generation of vipers,\\n\\t\\t\\t\\twho hath warned you to flee from the Wrath to come?\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "13",
    "NoteID": "2674",
    "Body": "See last note. 'You thought your homes so comfortable:\\n\\t\\t\\t\\twhy don't you go back to them? You will be called to\\n\\t\\t\\t\\taccount. Perhaps there may be rewards to be given you,\\n\\t\\t\\t\\twho knows?' This irony is itself the beginning of the\\n\\t\\t\\t\\tPunishment. But the ungodly now see how wrong they had\\n\\t\\t\\t\\tbeen. But their signs and regrets now avail them nothing.\\n\\t\\t\\t\\tIt is too late. They are lost, and nothing can save them."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "15",
    "NoteID": "2675",
    "Body": "The two similes present two different aspects of the\\n\\t\\t\\t\\tlamentation of the ungodly. When they really see the\\n\\t\\t\\t\\tWrath to come, there is a stampede, but where can they go\\n\\t\\t\\t\\tto? Their lamentation is now the only mark of their life.\\n\\t\\t\\t\\tBut it dies away, as corn vanishes from a field that is\\n\\t\\t\\t\\tbeing mown, or as a dying fire is slowly extinguished!\\n\\t\\t\\t\\tThey do not die. They wish they were dead! (lxxviii. 40)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "16",
    "NoteID": "2676",
    "Body": "The Hindu doctrine of Lila, that all things were created\\n\\t\\t\\t\\tfor sport, is here negatived. But more: with Allah we\\n\\t\\t\\t\\tmust not associate any ideas but those of Truth,\\n\\t\\t\\t\\tRighteousness, Mercy, Justice, and the other attributes\\n\\t\\t\\t\\timplied in His Beautiful Names. He does not jest nor play\\n\\t\\t\\t\\twith His creatures."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "17",
    "NoteID": "2677",
    "Body": "If such an idea as that of play or pastime had been\\n\\t\\t\\t\\tpossible with regard to Allah, and if He had wished\\n\\t\\t\\t\\treally to indulge in pastime, He would have done it with\\n\\t\\t\\t\\tcreatures of Light nearest to Him, not with the lowly\\n\\t\\t\\t\\tmaterial creation that we see around us."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "18",
    "NoteID": "2678",
    "Body": "Such as that (1) Allah has partners (xxi.22), or (2) that\\n\\t\\t\\t\\tHe has begotten a son (xxi. 26), or (3) has daughters\\n\\t\\t\\t\\t(xvi. 57), or any other superstitions derogatory to the\\n\\t\\t\\t\\tdignity and glory of Allah."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "19",
    "NoteID": "2679",
    "Body": "The pure angelic hosts, whom we imagine to be glorious\\n\\t\\t\\t\\tcreatures of light, high in Heavens, near the Throne of\\n\\t\\t\\t\\tAllah Himself, are yet His creatures, and serve Him\\n\\t\\t\\t\\twithout ceasing, and are proud to do so. Such is the\\n\\t\\t\\t\\tmajesty of Allah Most High."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "21",
    "NoteID": "2680",
    "Body": "The different kinds of false gods whom people raise from\\n\\t\\t\\t\\ttheir imagination are now referred to. In verses 21-23,\\n\\t\\t\\t\\tthe reference is to the gods of the earth, whether idols\\n\\t\\t\\t\\tor local godlings, or deified heroes, or animals or trees\\n\\t\\t\\t\\tor forces of the nature around us, which men have from\\n\\t\\t\\t\\ttime to time worshipped. These, as deities, have no life\\n\\t\\t\\t\\texcept what their worshippers give to them."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "21",
    "NoteID": "2681",
    "Body": "The answer of course is \"no\". No one but Allah can raise\\n\\t\\t\\t\\tthe dead to life. The miracle in the story of Jesus (iii.\\n\\t\\t\\t\\t49 and v. 113) was \"by Allah's leave\". It was a miracle\\n\\t\\t\\t\\tof Allah, not one of Jesus by his own power or will."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "22",
    "NoteID": "2682",
    "Body": "After the false gods of the earth (verse 21), are\\n\\t\\t\\t\\tmentioned the false gods in the heavens and the earth,\\n\\t\\t\\t\\tlike those in the Greek Pantheon (verse 22), who\\n\\t\\t\\t\\tquarrelled and fought and slandered each other and made\\n\\t\\t\\t\\ttheir Olympus a perfect bear-garden!"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "23",
    "NoteID": "2683",
    "Body": "Allah is Self-Subsisting. All His creatures are\\n\\t\\t\\t\\tresponsible to Him and dependent on Him there is no other\\n\\t\\t\\t\\tbeing to whom He can be responsible or on whom He can be\\n\\t\\t\\t\\tdependent."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "24",
    "NoteID": "2684",
    "Body": "See above. n. 2682, where two kinds of false worship are\\n\\t\\t\\t\\tnoted. Now we are warned against a third danger, the\\n\\t\\t\\t\\tworship of false gods of any sort. Pagan man is prolific\\n\\t\\t\\t\\tof creating abstract images for worship, including Self\\n\\t\\t\\t\\tor abstract Intelligence or Power. In verse 26 below is\\n\\t\\t\\t\\tmentioned a fourth kind of false worship, which imagines\\n\\t\\t\\t\\tthat Allah begets sons or daughters."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "24",
    "NoteID": "2685",
    "Body": "This verse should be read with the next. All reason\\n\\t\\t\\t\\trevolts against the idea of conflicting gods, and points\\n\\t\\t\\t\\tto Unity in Creation and Unity in Godhead. This is not\\n\\t\\t\\t\\tonly the Message of Islam (\"those with me\") but the\\n\\t\\t\\t\\tmessage of all prophets who came before the holy Prophet\\n\\t\\t\\t\\tMuhammad (\"those before me\"), and the line of prophets\\n\\t\\t\\t\\twas closed with him. The Message given to every prophet\\n\\t\\t\\t\\tin all ages was that of Unity as the fundamental basis of\\n\\t\\t\\t\\tOrder and Design in the world, material, moral, and\\n\\t\\t\\t\\tspiritual."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "26",
    "NoteID": "2686",
    "Body": "This refers both to the Trinitarian superstition that\\n\\t\\t\\t\\tAllah has begotten a son, and to the Arab superstition\\n\\t\\t\\t\\tthat the angels were daughters of Allah. All such\\n\\t\\t\\t\\tsuperstitions are derogatory to the glory of Allah. The\\n\\t\\t\\t\\tprophets and the angels are no more than servants of\\n\\t\\t\\t\\tAllah: they are raised high in honour, and therefore they\\n\\t\\t\\t\\tdeserve our highest respect, but not our worship."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "27",
    "NoteID": "2687",
    "Body": "They never say anything before they receive Allah's\\n\\t\\t\\t\\tcommand to say it, and their acts are similarly\\n\\t\\t\\t\\tconditioned. This is also the teaching of Jesus as\\n\\t\\t\\t\\treported in the Gospel of St. John (xii. 49-50): \"For I\\n\\t\\t\\t\\thave not spoken of myself: but the Father which sent me,\\n\\t\\t\\t\\tHe gave me a commandment, what I should say, and what I\\n\\t\\t\\t\\tshould speak. And I know that His commandment is life\\n\\t\\t\\t\\teverlasting: whatsoever I speak therefore, even as the\\n\\t\\t\\t\\tFather said unto me, so I speak.\" If rightly understood,\\n\\t\\t\\t\\t\"Father\" has the same meaning as our \"Rabb\", Sustainer\\n\\t\\t\\t\\tand Cherisher, not Begetter or Progenitor."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "28",
    "NoteID": "2688",
    "Body": "Cf. xx. 109. Those who have conformed to the Will of\\n\\t\\t\\t\\tAllah and obeyed His Law, thus winning the stamp of His\\n\\t\\t\\t\\tapproval."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "28",
    "NoteID": "2689",
    "Body": "They: the usual interpretation refers the pronoun to the\\n\\t\\t\\t\\tservants of Allah who intercede: it may also refer to\\n\\t\\t\\t\\tthose on whose behalf intercession is made: they do not\\n\\t\\t\\t\\ttake it as a matter of course, but stand in due awe and\\n\\t\\t\\t\\treverence of Allah's great glory and mercy."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "30",
    "NoteID": "2690",
    "Body": "The evolution of the ordered worlds as we see them is\\n\\t\\t\\t\\thinted at. As man's intellectual gaze over the physical\\n\\t\\t\\t\\tworld expands, he sees more and more how Unity is the\\n\\t\\t\\t\\tdominating note in Allah's wonderful Universe. Taking the\\n\\t\\t\\t\\tsolar system alone, we know that the maximum intensity of\\n\\t\\t\\t\\tsun-spots corresponds with the maximum intensity of\\n\\t\\t\\t\\tmagnetic storms on this earth. The universal law of\\n\\t\\t\\t\\tgravitation seems to bind all mass together. Physical\\n\\t\\t\\t\\tfacts point to the throwing off of planets from vast\\n\\t\\t\\t\\tquantities of diffused nebular matter, of which the\\n\\t\\t\\t\\tcentral condensed core is a sun."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "30",
    "NoteID": "2691",
    "Body": "About 72 per cent, of the surface of our Globe is still\\n\\t\\t\\t\\tcovered with water, and it has been estimated that if the\\n\\t\\t\\t\\tinequalities on the surface were all levelled, the whole\\n\\t\\t\\t\\tsurface would be under water, as the mean elevation of\\n\\t\\t\\t\\tland sphere-level would be 7,000- 10,000 feet below the\\n\\t\\t\\t\\tsurface of the ocean. This shows the predominance of\\n\\t\\t\\t\\twater on our Globe. That all life began in the water is\\n\\t\\t\\t\\talso a conclusion to which our latest knowledge in\\n\\t\\t\\t\\tbiological science points. Apart from the fact that\\n\\t\\t\\t\\tprotoplasm, the original basis of living matter, is\\n\\t\\t\\t\\tliquid or semi-liquid and in a state of constant flux and\\n\\t\\t\\t\\tinstability, there is the fact that land animals, like\\n\\t\\t\\t\\tthe higher vertebrates, including man, show, in their\\n\\t\\t\\t\\tembryological history, organs like those of fishes,\\n\\t\\t\\t\\tindicating the watery origin of their original habitat.\\n\\t\\t\\t\\tThe constitution of protoplasm is about 80 to 85 per cent\\n\\t\\t\\t\\tof water."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "31",
    "NoteID": "2692",
    "Body": "Cf. xvi. 15 and n. 2038. Lest it should shake with them:\\n\\t\\t\\t\\there \"them\" refers back to \"they\" at the end of the\\n\\t\\t\\t\\tpreceding verse, meaning \"Unbelievers\". It might be\\n\\t\\t\\t\\tmankind in general, but the pointed address to those who\\n\\t\\t\\t\\tdo not realise and understand Allah's mercies is\\n\\t\\t\\t\\tappropriate, to drive home to them the fact that it is\\n\\t\\t\\t\\tAllah's well-ordered providence that protects them\\n\\t\\t\\t\\tnormally from cataclysms like earthquakes, but that they\\n\\t\\t\\t\\tcould for their iniquities be destroyed in an instant, as\\n\\t\\t\\t\\tthe 'Ad and the Thamfid were destroyed before them. As\\n\\t\\t\\t\\tpointed out in n. 2691 above, if the surface of the earth\\n\\t\\t\\t\\twere levelled up, it would all be under water, and\\n\\t\\t\\t\\ttherefore the firm mountains are a further source of\\n\\t\\t\\t\\tsecurity of life which has evolved in terrestrial forms.\\n\\t\\t\\t\\tThough the mountains may seem impassable barriers, yet\\n\\t\\t\\t\\tAllah's providence has provided broad passes between them\\n\\t\\t\\t\\tto afford highways for human communications."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "31",
    "NoteID": "2693",
    "Body": "In both the literal and the figurative sense. Literally\\n\\t\\t\\t\\tthese natural mountain highways direct men in the way\\n\\t\\t\\t\\tthey should go. Figuratively, these wonderful instances\\n\\t\\t\\t\\tof Allah's providence should turn men's thoughts to the\\n\\t\\t\\t\\ttrue guidance of Allah in life."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "32",
    "NoteID": "2694",
    "Body": "Canopy well guarded: the heavens form a canopy that is\\n\\t\\t\\t\\tsecure from falling down: they also form a sublime\\n\\t\\t\\t\\tspectacle and a Mystery that man can only faintly reach.\\n\\t\\t\\t\\tCf. also xv. 17."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "33",
    "NoteID": "2695",
    "Body": "I have indicated, unlike most translators, the metaphor\\n\\t\\t\\t\\tof swimming implied in the original words: how beautiful\\n\\t\\t\\t\\tit is to contemplate the heavenly bodies swimming through\\n\\t\\t\\t\\tspace (or ether) in their rounded courses before our\\n\\t\\t\\t\\tgaze!"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "34",
    "NoteID": "2696",
    "Body": "Life on this planet without death has not been granted to\\n\\t\\t\\t\\tany man. The taunt of the Unbelievers at the holy Prophet\\n\\t\\t\\t\\twas therefore futile. Could any of them live without\\n\\t\\t\\t\\tdeath at some time or other? Could they name any one who\\n\\t\\t\\t\\tdid?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "35",
    "NoteID": "2697",
    "Body": "Cf. iii. 185. and n. 491. The soul does not die, but when\\n\\t\\t\\t\\tit separates from the body at the death of the body, the\\n\\t\\t\\t\\tsoul gets a taste of death. In our life of probation on\\n\\t\\t\\t\\tthis earth, our virtue and faith are tested by many\\n\\t\\t\\t\\tthings: some are tested by calamities, and some by the\\n\\t\\t\\t\\tgood things of this life. If we prove our true mettle, we\\n\\t\\t\\t\\tpass our probation with success. In any case all must\\n\\t\\t\\t\\treturn to Allah, and then will our life be appraised at\\n\\t\\t\\t\\tits true value."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "36",
    "NoteID": "2698",
    "Body": "To the godly man the issue between false worship and true\\n\\t\\t\\t\\tworship is a very serious matter. To the sceptics and\\n\\t\\t\\t\\tunbelievers it is only a joke. They take it lightly, and\\n\\t\\t\\t\\tlaugh at the godly man. They not only laugh at him, but\\n\\t\\t\\t\\tthey blaspheme when the name of the One True God is\\n\\t\\t\\t\\tmentioned. The reply to this is in the next verse."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "37",
    "NoteID": "2699",
    "Body": "Haste is in the very bone and marrow of man. If he is\\n\\t\\t\\t\\tgranted respite for his own sake, in order that he may\\n\\t\\t\\t\\thave a further chance of repentance and coming back to\\n\\t\\t\\t\\tAllah, he says impatiently and incredulously: \"Bring on\\n\\t\\t\\t\\tthe Punishment quickly, that I may see if what you say is\\n\\t\\t\\t\\ttrue!\" Alas, it is too true! When the Punishment actually\\n\\t\\t\\t\\tcomes near and he sees it, he will not want it hastened.\\n\\t\\t\\t\\tHe will want more time and further delay! Poor creature\\n\\t\\t\\t\\tof haste!"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "39",
    "NoteID": "2700",
    "Body": "They would not be so unreasonable if they only realised\\n\\t\\t\\t\\tthe terrible future for them! The Fire will envelop them\\n\\t\\t\\t\\ton all sides, and no help will then be possible. Is it\\n\\t\\t\\t\\tnot best for them now to turn and repent? The Punishment\\n\\t\\t\\t\\tmay come too suddenly, as is said in the next verse."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "41",
    "NoteID": "2701",
    "Body": "The same verse occurs at vi. 10, where see n. 843. 'What\\n\\t\\t\\t\\tthey are mocking at now will be in a position to mock\\n\\t\\t\\t\\tthem in due time.'"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "42",
    "NoteID": "2702",
    "Body": "'Allah is most Gracious: if, in spite of His great mercy,\\n\\t\\t\\t\\tyou are so rebellious and depraved as to incur His Wrath,\\n\\t\\t\\t\\twho is there who can save you? His Wrath can descend on\\n\\t\\t\\t\\tyou at any time, by night or by day.'"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "43",
    "NoteID": "2703",
    "Body": "Ashhaba: to join as companion: with 'an or min it has\\n\\t\\t\\t\\talso the meaning of to defend or remove from someone. The\\n\\t\\t\\t\\tfull signification can only be got by a long paraphrase:\\n\\t\\t\\t\\t'they are not fit to be mentioned in the same breath with\\n\\t\\t\\t\\tUs, nor can they be defended from Us.'"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "44",
    "NoteID": "2704",
    "Body": "'Umr or 'Umur: age, generation, period, time, life. Here\\n\\t\\t\\t\\t\"period\" is most appropriate, as it covers many\\n\\t\\t\\t\\tgenerations, \"these men and their fathers.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "44",
    "NoteID": "2705",
    "Body": "The particular signification is that Islam spread from\\n\\t\\t\\t\\tthe outer borders, social and geographical, gradually\\n\\t\\t\\t\\tinwards. The social fringe was the humbler people, such\\n\\t\\t\\t\\tas slaves and poor men. The geographical reference is to\\n\\t\\t\\t\\tMadinah and tribes away from the Makkah centre. The proud\\n\\t\\t\\t\\tand unbelieving Quraish were the last to come in when the\\n\\t\\t\\t\\tcircle was gradually drawn tighter and tighter around\\n\\t\\t\\t\\tthem. The general signification applies to all times.\\n\\t\\t\\t\\tAllah's Truth makes its way first among the poor and the\\n\\t\\t\\t\\tlowly, those whose minds are unsoiled by prejudices of\\n\\t\\t\\t\\tfalse pride or false knowledge, but it gradually hems in\\n\\t\\t\\t\\tthe obstinate, until it prevails in the end."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "45",
    "NoteID": "2706",
    "Body": "According to the English saying: \"none is so deaf as\\n\\t\\t\\t\\tthose who will not hear\". When they deliberately shut\\n\\t\\t\\t\\ttheir ears to warning from the Merciful Allah, meant for\\n\\t\\t\\t\\ttheir own good, the responsibility is their own. But\\n\\t\\t\\t\\ttheir cowardice is shown in the next verse by their\\n\\t\\t\\t\\tbehaviour when the first breath of the Wrath reaches\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "47",
    "NoteID": "2707",
    "Body": "Not the smallest action, word, thought, motive, or\\n\\t\\t\\t\\tpredilection but must come into the account of Allah. Cf.\\n\\t\\t\\t\\tBrowning (in Rabbi Ben Ezra): \"But all, the world's\\n\\t\\t\\t\\tcoarse thumb And finger failed to plumb, So passed in\\n\\t\\t\\t\\tmaking up the main account; All instincts immature. All\\n\\t\\t\\t\\tpurposes unsure. That weighed not as his work, yet\\n\\t\\t\\t\\tswelled the man's account; Thoughts hardly to be packed\\n\\t\\t\\t\\tInto a narrow act. Fancies that broke through language\\n\\t\\t\\t\\tand escaped; All I could never be, All, men ignored in\\n\\t\\t\\t\\tme, This, I was worth to God, Whose wheel the pitcher\\n\\t\\t\\t\\tshaped.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "47",
    "NoteID": "2708",
    "Body": "The literalism of Sale has here excelled itself: he\\n\\t\\t\\t\\ttranslates, \"and there will be sufficient accountants\\n\\t\\t\\t\\twith us\"! What is meant is that when Allah takes account,\\n\\t\\t\\t\\tHis accounting will be perfect: there will be no flaw in\\n\\t\\t\\t\\tit, as there may be in earthly accountants, who require\\n\\t\\t\\t\\tother people's help in some matters of account which they\\n\\t\\t\\t\\tdo not understand for want of knowledge of that\\n\\t\\t\\t\\tparticular department they are dealing with. Allah's\\n\\t\\t\\t\\tknowledge is perfect, and therefore His justice will be\\n\\t\\t\\t\\tperfect also; for He will not fail to take into account\\n\\t\\t\\t\\tall the most intangible things that determine conduct and\\n\\t\\t\\t\\tcharacter. See last note. There is no contradiction\\n\\t\\t\\t\\tbetween this and xviii. 104-105, where it is said that\\n\\t\\t\\t\\tmen of vain works, i.e., shallow hypocritical deeds, will\\n\\t\\t\\t\\thave no weight attached to their deeds, In fact the two\\n\\t\\t\\t\\tcorrespond."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "48",
    "NoteID": "2709",
    "Body": "Cf- ii. 53 and n. 68, where the meaning of Furqan is\\n\\t\\t\\t\\tdiscussed. Here three things are mentioned as given to\\n\\t\\t\\t\\tMoses and Aaron: (1) The Criterion for judgment: this\\n\\t\\t\\t\\tmight well be the wonderful Proofs they saw of Allah's\\n\\t\\t\\t\\tgoodness and glory from which they could have no doubt as\\n\\t\\t\\t\\tto Allah's will and command; (2) the Light; this was the\\n\\t\\t\\t\\tinner enlightenment of their soul, such as comes from\\n\\t\\t\\t\\tinspiration: and (3) the Message, the Book, the original\\n\\t\\t\\t\\tBook of Moses, which Aaron as his lieutenant would also\\n\\t\\t\\t\\tuse as a guide for his people."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "49",
    "NoteID": "2710",
    "Body": "Note the three kinds of fear mentioned in xxi. 48-49.\\n\\t\\t\\t\\tTaqwa is the fear of running counter to the will of\\n\\t\\t\\t\\tAllah; it is akin to the love of Him; for we fear to\\n\\t\\t\\t\\toffend those we love; it results in right conduct, and\\n\\t\\t\\t\\tthose who entertain it are \"those who would do right\".\\n\\t\\t\\t\\tThen there is Khayat, the fear of Allah, lest the person\\n\\t\\t\\t\\twho entertains it may be found, in his inmost thoughts,\\n\\t\\t\\t\\tto be short of the standard which Allah wishes for him;\\n\\t\\t\\t\\tthis is also righteous but in a less high degree than\\n\\t\\t\\t\\tTaqwa which is akin to love. And thirdly, there is the\\n\\t\\t\\t\\tfear of consequences on the Day of Judgment (ishfaq);\\n\\t\\t\\t\\tthis also may lead to righteousness, but is on a still\\n\\t\\t\\t\\tlower plane. Perhaps the three correspond to the\\n\\t\\t\\t\\tCriterion, the Light, and the Message (or Warning) of the\\n\\t\\t\\t\\tlast verse."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "50",
    "NoteID": "2711",
    "Body": "Here is a Prophet and a Book, greater than Moses and his\\n\\t\\t\\t\\tBook. Are you going to reject him and it?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "51",
    "NoteID": "2712",
    "Body": "Rushd: right conduct, corresponding in action to the\\n\\t\\t\\t\\tquality expressed in the epithet Hanif (sound or true in\\n\\t\\t\\t\\tFaith) applied to Abraham in ii. 135 and elsewhere."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "51",
    "NoteID": "2713",
    "Body": "Hence Abraham's title \"Friend of Allah\" (Khalil-ullah):\\n\\t\\t\\t\\tiv. 125."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "52",
    "NoteID": "2714",
    "Body": "Reference is made to Abraham in many places. In xix.\\n\\t\\t\\t\\t42-49 it was with reference to his relations to his\\n\\t\\t\\t\\tfather: the problem was how a righteous man should deal\\n\\t\\t\\t\\twith his father, when his duty to his father conflicts\\n\\t\\t\\t\\twith his duty to Allah. Here the problem is: how a\\n\\t\\t\\t\\trighteous man should deal with evil and overcome it; how\\n\\t\\t\\t\\the should fight against evil, and if he is subjected to\\n\\t\\t\\t\\tthe fire of persecution, how his firmness draws Allah's\\n\\t\\t\\t\\tMercy, and the very troubles he is placed in become his\\n\\t\\t\\t\\tcomfort and joy."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "55",
    "NoteID": "2715",
    "Body": "Abraham looked at life with a serious eye, and his people\\n\\t\\t\\t\\ttook it light-heartedly. He was devoted to Truth, and\\n\\t\\t\\t\\tthey cared more for ancestral custom. In the conflict he\\n\\t\\t\\t\\tseemed to be in their power. But he was fearless, and he\\n\\t\\t\\t\\ttriumphed by Allah's Grace."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "56",
    "NoteID": "2716",
    "Body": "For the various words for \"creation\" see n. 120 to ii.\\n\\t\\t\\t\\t117, where fatara is explained and differentiated from\\n\\t\\t\\t\\tother words of similar meaning."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "57",
    "NoteID": "2717",
    "Body": "He wants to convince them of the powerlessness of their\\n\\t\\t\\t\\tidols. But he does not do it underhand. He tells them\\n\\t\\t\\t\\tthat he is going to do something when once they are gone\\n\\t\\t\\t\\tand their backs are turned to the idols,-as much as to\\n\\t\\t\\t\\tsay that the idols are dependent on their care and\\n\\t\\t\\t\\tattention. Apparently the people are amused and want to\\n\\t\\t\\t\\tsee what he does. So they leave him to his own devices."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "58",
    "NoteID": "2718",
    "Body": "He was enacting a scene, to make the people ashamed of\\n\\t\\t\\t\\tworshipping senseless stocks and stones. He left the\\n\\t\\t\\t\\tbiggest idol untouched and broke the others to pieces, as\\n\\t\\t\\t\\tif a fight had taken place between the idols, and the\\n\\t\\t\\t\\tbiggest had smashed the others. Would they turn to the\\n\\t\\t\\t\\tsurviving idol and ask him how it all happened?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "60",
    "NoteID": "2719",
    "Body": "Different groups of people are speaking. Those who were\\n\\t\\t\\t\\tnot present at Abraham's speech in verse 57 ask, \"who has\\n\\t\\t\\t\\tdone this?\" Those who were, at once name him, whereupon a\\n\\t\\t\\t\\tformal council of the people was held, and Abraham was\\n\\t\\t\\t\\tarraigned."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "62",
    "NoteID": "2720",
    "Body": "They asked him the formal question. There was no mystery\\n\\t\\t\\t\\tabout it. He had already openly threatened to do\\n\\t\\t\\t\\tsomething to the idols, and people who had heard his\\n\\t\\t\\t\\tthreats were there. He now continues his ironic taunt to\\n\\t\\t\\t\\tthe idol-worshippers. 'You ask me! Why don't you ask the\\n\\t\\t\\t\\tidols? Doesn't it look as if this big fellow has smashed\\n\\t\\t\\t\\tthe smaller ones in a quarrel?' If they do not ask the\\n\\t\\t\\t\\tidols, they confess that the idols have not intelligence\\n\\t\\t\\t\\tenough to answer! This argument is developed in verses\\n\\t\\t\\t\\t64-67. Note that while the false worshippers laughed at\\n\\t\\t\\t\\this earnestness, he pays them out by a grim practical\\n\\t\\t\\t\\tjoke, which at the same time advances the cause of Truth."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "64",
    "NoteID": "2721",
    "Body": "Abraham's biting irony cut them to the quick. What could\\n\\t\\t\\t\\tthey say? They turned to each other. Some among them\\n\\t\\t\\t\\tthought he had the best of the argument. They were not\\n\\t\\t\\t\\tkeen on idolatry, and they told their fellows that it was\\n\\t\\t\\t\\tuseless arguing with Abraham. They all hung their heads\\n\\t\\t\\t\\tin shame. But presently they thought they would face out\\n\\t\\t\\t\\tAbraham, and take his words literally. They said, \"You\\n\\t\\t\\t\\tknow quite well that idols do not speak!\" This was\\n\\t\\t\\t\\tprecisely what Abraham wanted them to say, and he\\n\\t\\t\\t\\tdelivered his final blow! See n. 2723 below."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "65",
    "NoteID": "2722",
    "Body": "Literally, \"they were turned down on their heads\" which\\n\\t\\t\\t\\tmay suggest a metaphorical somersault, i.e., they\\n\\t\\t\\t\\trecovered from their dawning shame for idolatry and were\\n\\t\\t\\t\\tprepared to argue it out with the youth Abraham. But I\\n\\t\\t\\t\\tthink there is better authority for the interpretation I\\n\\t\\t\\t\\thave adopted."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "67",
    "NoteID": "2723",
    "Body": "As soon as they admitted in so many words that the idols\\n\\t\\t\\t\\tcould not speak, Abraham delivered his final attack:\\n\\t\\t\\t\\t'Then why do you worship useless impotent creatures?'\\n\\t\\t\\t\\tAfter that, there remains nothing but the argument of\\n\\t\\t\\t\\tviolence, which they proceed to exercise, being the party\\n\\t\\t\\t\\tin power. 'Burn him at the stake' is an easy cry! But it\\n\\t\\t\\t\\twas not Abraham that suffered: it was his persecutors\\n\\t\\t\\t\\t(xxi. 70)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "69",
    "NoteID": "2724",
    "Body": "The nature of fire, by all the physical laws of matter,\\n\\t\\t\\t\\tis to be hot. The fire became cool, and a means of safety\\n\\t\\t\\t\\tfor Abraham."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "69",
    "NoteID": "2725",
    "Body": "Can we form any idea of the place where he passed through\\n\\t\\t\\t\\tthe furnace, and the stage in his career at which this\\n\\t\\t\\t\\thappened? He was born in Ur of the Chaldees, a place on\\n\\t\\t\\t\\tthe lower reaches of the Euphrates, not a hundred miles\\n\\t\\t\\t\\tfrom the Persian Gulf. This was the cradle, or one of the\\n\\t\\t\\t\\tcradles, of human civilisation. Astronomy was studied\\n\\t\\t\\t\\there in very ancient times, and the worship of the sun,\\n\\t\\t\\t\\tmoon, and stars was the prevailing form of religion.\\n\\t\\t\\t\\tAbraham revolted against this quite early in life, and\\n\\t\\t\\t\\this argument is referred to in vi. 74-82. They also had\\n\\t\\t\\t\\tidols in their temples, probably idols representing\\n\\t\\t\\t\\theavenly bodies and celestial winged creatures. He was\\n\\t\\t\\t\\tstill a youth (xxi. 60) when he broke the idols. This was\\n\\t\\t\\t\\tstage No. 2. After this he was marked down as a rebel and\\n\\t\\t\\t\\tpersecuted. Perhaps some years passed before the incident\\n\\t\\t\\t\\tof his being thrown into the Fire (xxi. 68-69) took\\n\\t\\t\\t\\tplace. Traditionally the Fire incident is referred to a\\n\\t\\t\\t\\tking called Nimrud, about whom see n. 1565 to xi. 69. If\\n\\t\\t\\t\\tNimrud's capital was in Assyria, near Nineveh (site near\\n\\t\\t\\t\\tmodern Mosul), we may suppose either that the king's rule\\n\\t\\t\\t\\textended over the whole of Mesopotamia, or that Abraham\\n\\t\\t\\t\\twandered north through Babylonia to Assyria. Various\\n\\t\\t\\t\\tstratagems were devised to get rid of him (xxi. 70), but\\n\\t\\t\\t\\the was saved by the mercy of Allah. The final break came\\n\\t\\t\\t\\twhen he was probably a man of mature age and could speak\\n\\t\\t\\t\\tto his father with some authority. This incident is\\n\\t\\t\\t\\treferred to in xix. 41-48. He now left his ancestral\\n\\t\\t\\t\\tlands, and avoiding the Syrian desert, came to the\\n\\t\\t\\t\\tfertile lands of Aram or Syria, and so south to Canaan,\\n\\t\\t\\t\\twhen the incident of xi. 69-76 took place. It is some\\n\\t\\t\\t\\tyears after this that we may suppose he built the Ka'ba\\n\\t\\t\\t\\twith Isma'il (ii, 124-29), and his prayer in xiv. 35-41\\n\\t\\t\\t\\tmay be referred to the same time. His visit to Egypt\\n\\t\\t\\t\\t(Gen. xii. 10) is not referred to in the Qur-an."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "70",
    "NoteID": "2726",
    "Body": "As they could not get rid of him by open punishment, they\\n\\t\\t\\t\\ttried secret plans, but were foiled throughout. It was\\n\\t\\t\\t\\tnot he that lost, but they. On the contrary he left them\\n\\t\\t\\t\\tand prospered and became the progenitor of great peoples."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "71",
    "NoteID": "2727",
    "Body": "The land of Aram or Syria, which in its widest\\n\\t\\t\\t\\tconnotation includes Canaan or Palestine. Syria is a\\n\\t\\t\\t\\twell-watered fertile land, with a Mediterranean\\n\\t\\t\\t\\tsea-coast, on which the famous commercial cities of Tyre\\n\\t\\t\\t\\tand Sidon were situated. Its population is very mixed, as\\n\\t\\t\\t\\tit has been a bone of contention between all the great\\n\\t\\t\\t\\tkingdoms and empires of Western Asia and Egypt, and\\n\\t\\t\\t\\tEuropean interest in it dates from the most ancient\\n\\t\\t\\t\\ttimes."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "72",
    "NoteID": "2728",
    "Body": "Nafilat has many meanings: (1) booty; (2) extra work or\\n\\t\\t\\t\\tprayer; (3) extra or additional gift; (4) grandson. The\\n\\t\\t\\t\\ttwo last significations are implied here. Not only was\\n\\t\\t\\t\\tAbraham given a son in his old age; he was given not only\\n\\t\\t\\t\\tIsaac, but several sons, the chief being Isma'il and\\n\\t\\t\\t\\tIsaac, who both joined in burying him (Gen. xxv. 9); and\\n\\t\\t\\t\\the also saw grandsons. Isma'il is specially mentioned\\n\\t\\t\\t\\tlater (xxi. 85) apart from Isaac's line, on account of\\n\\t\\t\\t\\this special importance for Islam."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "73",
    "NoteID": "2729",
    "Body": "The spiritual lesson from this passage may be\\n\\t\\t\\t\\trecapitulated. The righteous man makes no compromise with\\n\\t\\t\\t\\tevil. If the votaries of evil laugh at him he pays them\\n\\t\\t\\t\\tin their own coin, but he stands firmly by his\\n\\t\\t\\t\\tprinciples. His firmness causes some confusion among the\\n\\t\\t\\t\\tfollowers of evil, and he openly declares the faith that\\n\\t\\t\\t\\tis in him. They try, openly and secretly, to injure or\\n\\t\\t\\t\\tkill him, but Allah protects him, while evil perishes\\n\\t\\t\\t\\tfrom its own excesses."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "74",
    "NoteID": "2730",
    "Body": "Lot's people were given to unspeakable abominations. His\\n\\t\\t\\t\\tmission was to preach to them. He withstood Evil, but\\n\\t\\t\\t\\tthey rejected him. They were punished, but he and his\\n\\t\\t\\t\\tfollowers were saved. See xv. 61-74; xi. 77-82; and vii.\\n\\t\\t\\t\\t80-84. A) The date of Noah was many centuries before that\\n\\t\\t\\t\\tof Abraham."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "76",
    "NoteID": "2731",
    "Body": "The contemporaries of Noah were given to Unbelief,\\n\\t\\t\\t\\toppression of the poor, and vain disputations. He carried\\n\\t\\t\\t\\tAllah's Message to them, and standing fast in faith,\\n\\t\\t\\t\\tbuilt the Ark, in which he was saved with his followers\\n\\t\\t\\t\\tfrom the Flood, while the wicked were drowned. See xi.\\n\\t\\t\\t\\t25-48."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "79",
    "NoteID": "2732",
    "Body": "The sheep, on account of the negligence of the shepherd,\\n\\t\\t\\t\\tgot into a cultivated field (or vineyard) by night and\\n\\t\\t\\t\\tate up the young plants or their tender shoots, causing\\n\\t\\t\\t\\tdamage, to the extent of perhaps a whole year's crop.\\n\\t\\t\\t\\tDavid was king, and in his seat of judgment he considered\\n\\t\\t\\t\\tthe matter so serious that he awarded the owner of the\\n\\t\\t\\t\\tfield the sheep themselves in compensation for his\\n\\t\\t\\t\\tdamage. The Roman law of the Twelve Tables might have\\n\\t\\t\\t\\tapproved of this decision, and on the same principle was\\n\\t\\t\\t\\tbuilt up the Deodand doctrine of English Law, now\\n\\t\\t\\t\\tobsolete. His son Solomon, a mere boy of eleven, thought\\n\\t\\t\\t\\tof a better decision, where the penalty would better fit\\n\\t\\t\\t\\tthe offence. The loss was the loss of the fruits or\\n\\t\\t\\t\\tproduce of the field of vineyard: the corpus of the\\n\\t\\t\\t\\tproperty was not lost. Solomon's suggestion was that the\\n\\t\\t\\t\\towner of the field or vineyard should not take the sheep\\n\\t\\t\\t\\taltogether but only detain them long enough to recoup his\\n\\t\\t\\t\\tactual damage, from the milk, wool, and possibly young of\\n\\t\\t\\t\\tthe sheep, and then retum the sheep to the shepherd.\\n\\t\\t\\t\\tDavid's merit was that he accepted the suggestion, even\\n\\t\\t\\t\\tthough it came from a little boy: Solomon's merit was\\n\\t\\t\\t\\tthat he distinguished between corpus and income, and\\n\\t\\t\\t\\tthough a boy, was not ashamed to put his case before his\\n\\t\\t\\t\\tfather. But in either case it was Allah Who inspired the\\n\\t\\t\\t\\ttrue realisation of justice. He was present and witnessed\\n\\t\\t\\t\\tthe affair, as He is present all the time."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "79",
    "NoteID": "2733",
    "Body": "Whatever is in the heavens and the earth celebrates the\\n\\t\\t\\t\\tpraises of Allah: xvii. 44; Ivii. 1; xvi. 48-50. Even the\\n\\t\\t\\t\\t\"thunder repeateth His praises\": xiii. 13. All nature\\n\\t\\t\\t\\tever sings the praises of Allah. David sang in his\\n\\t\\t\\t\\tPsalms, cxlviii. 7-10: \"Praise the Lord from the earth,\\n\\t\\t\\t\\tye ... mountains and all hills; ... creeping things and\\n\\t\\t\\t\\tflying fowl!\" All nature sings to Allah's glory, in\\n\\t\\t\\t\\tunison with David, and angels, and men of God. Cf. xxxiv.\\n\\t\\t\\t\\t10 and xxxviii. 18-19."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "80",
    "NoteID": "2734",
    "Body": "The making of coats of mails is attributed to David. It\\n\\t\\t\\t\\tis defensive armour, and therefore its discovery and\\n\\t\\t\\t\\tsupply is associated with deeds of righteousness in\\n\\t\\t\\t\\txxxiv. 10-11, in contrast with the deadly weapons which\\n\\t\\t\\t\\tman invents for offensive purposes. Indeed, all fighting,\\n\\t\\t\\t\\tunless in defence of righteousness, is mere \"violence.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "80",
    "NoteID": "2735",
    "Body": "David's good work then was: (1) he was open to learn\\n\\t\\t\\t\\twisdom wherever it came from; (2) he sang the praises of\\n\\t\\t\\t\\tAllah, in unison with all nature; (3) he made defensive\\n\\t\\t\\t\\tarmour. But all these things he did, because of the\\n\\t\\t\\t\\tfaculties which Allah had given him, and we must be\\n\\t\\t\\t\\tgrateful for this and for all things to Allah."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "81",
    "NoteID": "2736",
    "Body": "Cf. xxxiv. 12, and xxxviii. 36-38, This has been\\n\\t\\t\\t\\tinterpreted to mean that Solomon had miraculous power\\n\\t\\t\\t\\tover the winds, and he could make them obey his order. In\\n\\t\\t\\t\\tany case the power behind was, and is, from Allah, Who\\n\\t\\t\\t\\thas granted man intelligence and the faculties by which\\n\\t\\t\\t\\the can tame the more unruly forces of nature."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "81",
    "NoteID": "2737",
    "Body": "Evidently Palestine, in which was Solomon's capital,\\n\\t\\t\\t\\tthough his influence extended for north in Syria."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "82",
    "NoteID": "2738",
    "Body": "It was Allah's power ultimately, Who granted him wisdom.\\n\\t\\t\\t\\tSolomon tamed the jinns with Wisdom."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "83",
    "NoteID": "2739",
    "Body": "Job (Ayub) was a prosperous man, with faith in Allah,\\n\\t\\t\\t\\tliving somewhere in the north-east comer of Arabia. He\\n\\t\\t\\t\\tsuffers from a number of calamities: his cattle are\\n\\t\\t\\t\\tdestroyed, his servants slain by the sword, and his\\n\\t\\t\\t\\tfamily crushed under his roof. But he holds fast to his\\n\\t\\t\\t\\tfaith in Allah. As a further calamity he is covered with\\n\\t\\t\\t\\tloathsome sores from head to foot. He loses his peace of\\n\\t\\t\\t\\tmind, and he curses the day he was born. His false\\n\\t\\t\\t\\tfriends come and attribute his afflictions to sin. These\\n\\t\\t\\t\\t\"Job's comforters\" are no comforters at all, and he\\n\\t\\t\\t\\tfurther loses his balance of mind, but Allah recalls to\\n\\t\\t\\t\\thim all His mercies, and he resumes his humility and\\n\\t\\t\\t\\tgives up self-justification. He is restored to\\n\\t\\t\\t\\tprosperity, with twice as much as he had before; his\\n\\t\\t\\t\\tbrethren and friends come back to him; he had a new\\n\\t\\t\\t\\tfamily of seven sons and three fair daughters. He lived\\n\\t\\t\\t\\tto a good old age, and saw four generations of\\n\\t\\t\\t\\tdescendants. All this is recorded in the Book of Job in\\n\\t\\t\\t\\tthe Old Testament. Of all the Hebrew writings, the Hebrew\\n\\t\\t\\t\\tof this Book comes nearest to Arabic. The account given\\n\\t\\t\\t\\tin the Biblical sources and the image that it projects of\\n\\t\\t\\t\\tProphet Job is decidedly different from that found in the\\n\\t\\t\\t\\tQur-an and the Hadith, which present him as a prophet and\\n\\t\\t\\t\\tbrilliant example of dignified patience becoming of a\\n\\t\\t\\t\\tgreat Prophet of Allah ever trustful in Him and His\\n\\t\\t\\t\\tpromises. Nothing could be farther from truth than saying\\n\\t\\t\\t\\tthat he lost his peace of mind or resorted to curses\\n\\t\\t\\t\\tduring the period of his trial."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "84",
    "NoteID": "2740",
    "Body": "Job is the pattern of humility, patience, and faith in\\n\\t\\t\\t\\tAllah. It was with these weapons that he fought and\\n\\t\\t\\t\\tconquered evil."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "85",
    "NoteID": "2741",
    "Body": "Isma'il is mentioned specially, apart from the line which\\n\\t\\t\\t\\tdescended through Isaac (xxi. 72), as he was the founder\\n\\t\\t\\t\\tof a separate and greater Ummat. His sufferings began in\\n\\t\\t\\t\\tinfancy (see n. 160 to ii. 158); but his steady constancy\\n\\t\\t\\t\\tand submission to the will of Allah were specially shown\\n\\t\\t\\t\\twhen he earned the title of \"Sacrifice to Allah\" (see n.\\n\\t\\t\\t\\t2506 to xix. 54). That was the particular quality of his\\n\\t\\t\\t\\tconstancy and patience."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "85",
    "NoteID": "2742",
    "Body": "For Idris see n. 2508 to xix. 56. He was in a high\\n\\t\\t\\t\\tstation in life, but that did not spoil him. He was\\n\\t\\t\\t\\tsincere and true, and that was the particular quality of\\n\\t\\t\\t\\this constancy and patience."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "85",
    "NoteID": "2743",
    "Body": "Zul-kifl would literally mean \"possessor of, or giving, a\\n\\t\\t\\t\\tdouble requital or portion\"; or else, \"one who used a\\n\\t\\t\\t\\tcloak of double thickness,\" that being one of the\\n\\t\\t\\t\\tmeanings of Kifl. The Commentators differ in opinion as\\n\\t\\t\\t\\tto who is meant, why the title is applied to him, and the\\n\\t\\t\\t\\tpoint of his being grouped with Isma'il and Idris for\\n\\t\\t\\t\\tconstancy and patience. I think the best suggestion is\\n\\t\\t\\t\\tthat afforded by Karsten Niebuhr in his Reisebeschreibung\\n\\t\\t\\t\\tnach Arabian, Copenhagen, 1778, ii. 264-266, as quoted in\\n\\t\\t\\t\\tthe Encyclopaedia of Islam under \"Dhul-Kifl\". He visited\\n\\t\\t\\t\\tMeshad 'All in 'Iraq, and also the little town called\\n\\t\\t\\t\\tKefil, midway between Najaf and Hilla (Babylon). Kefil,\\n\\t\\t\\t\\the says, is the Arabic form of Ezekiel. The shrine of\\n\\t\\t\\t\\tEzekiel was there, and the Jews came to it on pilgrimage.\\n\\t\\t\\t\\tIf we accept \"Zul-kifl\" to be not an epithet, but an\\n\\t\\t\\t\\tArabicised form of \"Ezekiel\", it fits the context.\\n\\t\\t\\t\\tEzekiel was a prophet in Israel who was carried away to\\n\\t\\t\\t\\tBabylon by Nebuchadnezzar after his second attack on\\n\\t\\t\\t\\tJerusalem (about B.C. 599). His Book is included in the\\n\\t\\t\\t\\tEnglish Bible (Old Testament). He was chained and bound,\\n\\t\\t\\t\\tand put into prison, and for a time he was dumb (Ezekiel,\\n\\t\\t\\t\\tiii. 25-26). He bore all with patience and constancy, and\\n\\t\\t\\t\\tcontinued to reprove boldly the evils in Israel. In a\\n\\t\\t\\t\\tburning passage he denounces false leaders in words which\\n\\t\\t\\t\\tare eternally true: \"Woe be to the shepherds of Israel\\n\\t\\t\\t\\tthat do feed themselves! Should not the shepherds feed\\n\\t\\t\\t\\tthe flocks? Ye eat the fat, and ye clothe you with the\\n\\t\\t\\t\\twool, ye kill them that are fed: but ye feed not the\\n\\t\\t\\t\\tflock. The diseased have ye not strengthened, neither\\n\\t\\t\\t\\thave ye healed that which was sick, neither have ye bound\\n\\t\\t\\t\\tup that which was broken ...... etc. (Ezekiel, xxxiv.\\n\\t\\t\\t\\t2-4). Zul-kifl is again mentioned in xxxviii. 48 along\\n\\t\\t\\t\\twith Isma'il and Elisha."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "87",
    "NoteID": "2744",
    "Body": "Zun-nun. \"the man of the Fish or the Whale\", is the title\\n\\t\\t\\t\\tof Jonah (Yunus), because he was swallowed by a large\\n\\t\\t\\t\\tFish or Whale. He was the prophet raised to warn the\\n\\t\\t\\t\\tAssyrian capital Nineveh. For Nineveh see n. 1478 to x.\\n\\t\\t\\t\\t98. His story is told in xxxvii. 139-149. When his first\\n\\t\\t\\t\\twarning was unheeded by the people, he denounced Allah's\\n\\t\\t\\t\\twrath on them. But they repented and Allah forgave them\\n\\t\\t\\t\\tfor the time being. Jonah, meanwhile, departed in wrath,\\n\\t\\t\\t\\tdiscouraged at the apparent failure of his mission. He\\n\\t\\t\\t\\tshould have remained in the most discouraging\\n\\t\\t\\t\\tcircumstances, and relied on the power of Allah; for\\n\\t\\t\\t\\tAllah had power both over Nineveh and over the Messenger\\n\\t\\t\\t\\tHe had sent to Nineveh. He went away to the sea and took\\n\\t\\t\\t\\ta ship, but apparently the sailors threw him out as a man\\n\\t\\t\\t\\tof bad omen in a storm. He was swallowed by a big Fish\\n\\t\\t\\t\\t(or Whale), but in the depth of the darkness, he cried to\\n\\t\\t\\t\\tAllah and confessed his weakness. The \"darkness\" may be\\n\\t\\t\\t\\tinterpreted both physically and spiritually; physically,\\n\\t\\t\\t\\tas the darkness of the night and the storm and the Fish's\\n\\t\\t\\t\\tbody; spiritually as the darkness in his soul, his\\n\\t\\t\\t\\textreme distress in the situation which he had brought on\\n\\t\\t\\t\\thimself. Allah Most Gracious forgave him. He was cast out\\n\\t\\t\\t\\tashore; he was given the shelter of a plant in his state\\n\\t\\t\\t\\tof mental and physical lassitude. He was refreshed and\\n\\t\\t\\t\\tstrengthened, and the work of his mission prospered. Thus\\n\\t\\t\\t\\the overcame all his disappointment by repentance and\\n\\t\\t\\t\\tFaith, and Allah accepted him."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "89",
    "NoteID": "2745",
    "Body": "See xix. 2-15, and iii. 38-41. Zakariya was a priest;\\n\\t\\t\\t\\tboth he and his wife were devout and punctilious in their\\n\\t\\t\\t\\tduties. They were old, and they had no son. He was\\n\\t\\t\\t\\ttroubled in mind, not so much by the vulgar desire to\\n\\t\\t\\t\\thave a son to carry on his line, but because he felt that\\n\\t\\t\\t\\this people were not unselfishly devout, and there would\\n\\t\\t\\t\\tbe no sincere work for Allah unless he could train up\\n\\t\\t\\t\\tsomeone himself. He was given a son Yahya (John the\\n\\t\\t\\t\\tBaptist), who added to the devout reputation of the\\n\\t\\t\\t\\tfamily, for he is called \"noble, chaste, and a prophet,\"\\n\\t\\t\\t\\t(iii. 39). All three, father, mother, and son, were made\\n\\t\\t\\t\\tworthy of each other, and they repelled evil by their\\n\\t\\t\\t\\tdevout emulation in virtue."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "89",
    "NoteID": "2746",
    "Body": "'It is not that I crave a personal heir to myself: all\\n\\t\\t\\t\\tthings go back to Thee, and Thou art the best of\\n\\t\\t\\t\\tinheritors: but I see no one around me sincere enough to\\n\\t\\t\\t\\tcarry on my work for Thee; wilt Thou give me one whom I\\n\\t\\t\\t\\tcan train?'"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "90",
    "NoteID": "2747",
    "Body": "Aslaha = to improve, to mend, to reform, to make better.\\n\\t\\t\\t\\tHere, with reference to Zakariya's wife, the\\n\\t\\t\\t\\tsignification is twofold: (1) that her barrenness would\\n\\t\\t\\t\\tbe removed, so that she could become a mother; and (2)\\n\\t\\t\\t\\ther spiritual dignity should be raised in becoming the\\n\\t\\t\\t\\tmother of John the Baptist; and by implication his also,\\n\\t\\t\\t\\tin becoming the father of John."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "91",
    "NoteID": "2748",
    "Body": "Mary the mother of Jesus. Chastity was her special\\n\\t\\t\\t\\tvirtue: with a son of virgin birth, she and Jesus became\\n\\t\\t\\t\\ta miracle to all nations. That was the virtue with which\\n\\t\\t\\t\\tthey (both Mary and Jesus) resisted evil."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "92",
    "NoteID": "2749",
    "Body": "Ummat: this is best translated by Brotherhood here.\\n\\t\\t\\t\\t\"Community\", \"race\", and \"nation,\" and \"people\" are words\\n\\t\\t\\t\\twhich import other ideas and do not quite correspond to\\n\\t\\t\\t\\t\"Ummat\". \"Religion\" and \"Way of Life\" are derived\\n\\t\\t\\t\\tmeanings, which could be used in other passages, but are\\n\\t\\t\\t\\tless appropriate here. Our attention has been drawn to\\n\\t\\t\\t\\tpeople of very different temperaments and virtues, widely\\n\\t\\t\\t\\tdifferent in time, race, language, surroundings, history,\\n\\t\\t\\t\\tand work to be performed, but forming the closest\\n\\t\\t\\t\\tbrotherhood as being men and women united in the highest\\n\\t\\t\\t\\tservice of Allah. They prefigure the final and perfected\\n\\t\\t\\t\\tBrotherhood of Islam."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "93",
    "NoteID": "2750",
    "Body": "Allah's Message was and ever is one; and His Messengers\\n\\t\\t\\t\\ttreated it as one. It is people of narrower views who\\n\\t\\t\\t\\tcome later and trade on the earlier names, that break up\\n\\t\\t\\t\\tthe Message and the Brotherhood into jarring camps and\\n\\t\\t\\t\\tsects."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "94",
    "NoteID": "2751",
    "Body": "Allah gives credit for every act of righteousness,\\n\\t\\t\\t\\thowever small: when combined with sincere Faith in Allah,\\n\\t\\t\\t\\tit becomes the stepping stone to higher and higher\\n\\t\\t\\t\\tthings. It is never lost."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "95",
    "NoteID": "2752",
    "Body": "But when wickedness comes to such a pass that the Wrath\\n\\t\\t\\t\\tof Allah descends, as it did on Sodom, the case becomes\\n\\t\\t\\t\\thopeless. The righteous were warned and delivered before\\n\\t\\t\\t\\tthe Wrath descended. But those destroyed will not get\\n\\t\\t\\t\\tanother chance, as they flouted all previous chances.\\n\\t\\t\\t\\tThey will only be raised at the approach of the Day of\\n\\t\\t\\t\\tJudgment."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "96",
    "NoteID": "2753",
    "Body": "For Gog and Magog see n. 2439 to xviii. 92. The name\\n\\t\\t\\t\\tstands for wild and lawless tribes who will break their\\n\\t\\t\\t\\tbarriers and swarm through the earth. This will be one of\\n\\t\\t\\t\\tthe prognostications of the approaching Judgment."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "97",
    "NoteID": "2754",
    "Body": "Cf. xiv. 42."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "99",
    "NoteID": "2755",
    "Body": "The ultimate proof of Truth and Falsehood will be that\\n\\t\\t\\t\\tTruth will endure and come to its own, while Falsehood\\n\\t\\t\\t\\twill be destroyed. And so the men who worshipped Truth\\n\\t\\t\\t\\twill come to their own, while those who worshipped\\n\\t\\t\\t\\tFalsehood will be in a Fire of Punishment they could\\n\\t\\t\\t\\tscarcely have imagined before. In that state there will\\n\\t\\t\\t\\tbe nothing but regrets and sighs and groans, and these\\n\\t\\t\\t\\tevil sounds will drown everything else."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "101",
    "NoteID": "2756",
    "Body": "In contrast to the misery of those who rejected Truth and\\n\\t\\t\\t\\tRight, will be the happiness of those who accepted it.\\n\\t\\t\\t\\tThe good will not hear the least sound of the groans of\\n\\t\\t\\t\\tevil. Their true soul's desires will be fulfilled-not\\n\\t\\t\\t\\ttemporarily as in this world, but in a permanent form."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "103",
    "NoteID": "2757",
    "Body": "The Judgment and balancing of accounts will be a mighty\\n\\t\\t\\t\\tTerror to the evil-doers. But it will cause, to the\\n\\t\\t\\t\\trighteous, not grief or anxiety, but hope and happiness,\\n\\t\\t\\t\\tfor now they will be in a congenial atmosphere, and will\\n\\t\\t\\t\\tsee the fulfilment of their ideals in the meeting and\\n\\t\\t\\t\\tgreeting of the angels, preparatory to their enjoyment of\\n\\t\\t\\t\\tthe supreme Bliss-seeing the Face of Allah."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "104",
    "NoteID": "2758",
    "Body": "The world-the universe-as we know it, will be folded up\\n\\t\\t\\t\\tlike a scroll of parchment, for it will have done its\\n\\t\\t\\t\\twork. If Allah created all this world out of nothing, He\\n\\t\\t\\t\\tcan create an entirely new heaven and a new earth, on a\\n\\t\\t\\t\\tplane of which we can form no conception in our present\\n\\t\\t\\t\\tlife. And He will do so, for that is His promise."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "105",
    "NoteID": "2759",
    "Body": "Zabur: the Book of the Psalms of David. The name of David\\n\\t\\t\\t\\tis expressly mentioned in connection with the Zabur in\\n\\t\\t\\t\\tiv. 163 and xvii. 55, although there the indefinite\\n\\t\\t\\t\\tarticle is applied to the word as meaning a Book of\\n\\t\\t\\t\\tScripture. See Psalms xxv. 13, \"his seed shall inherit\\n\\t\\t\\t\\tthe earth\"; xxxvii. 11, \"the meek shall inherit the\\n\\t\\t\\t\\tearth\" (quoted by Jesus in Matt. v.3); and xxxvii. 29,\\n\\t\\t\\t\\t\"the righteous shall inherit the land.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "105",
    "NoteID": "2760",
    "Body": "The same promise occurs in the Pentateuch, Exod. xxxii.\\n\\t\\t\\t\\t13."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "106",
    "NoteID": "2761",
    "Body": "The culmination of Allah's Revelation is in the Qur-an,\\n\\t\\t\\t\\twhich confirms previous scriptures, corrects the errors\\n\\t\\t\\t\\twhich men introduced into them, and explains many points\\n\\t\\t\\t\\tin detail for all who seek for right worship and service\\n\\t\\t\\t\\tto Allah-whether they inherit the previous Books (\"People\\n\\t\\t\\t\\tof the Book\") or not. It is a universal Message."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "107",
    "NoteID": "2762",
    "Body": "There is no question now of race or nation, of a \"chosen\\n\\t\\t\\t\\tpeople\" or the \"seed of Abraham\"; or the \"seed of David\";\\n\\t\\t\\t\\tor of Hindu Arya-varta; of Jew or Gentile, Arab or 'Ajam\\n\\t\\t\\t\\t(non-Arab), Turk or Tajik, European or Asiatic, White or\\n\\t\\t\\t\\tColoured; Aryan, Semitic, Mongolian, or African; or\\n\\t\\t\\t\\tAmerican, Australian, or Polynesian. To all men and\\n\\t\\t\\t\\tcreatures other than men who have any spiritual\\n\\t\\t\\t\\tresponsibility, the principles universally apply."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "108",
    "NoteID": "2763",
    "Body": "'Not my God only, but also your God; for there is but One\\n\\t\\t\\t\\tGod, the Universal Lord, Who made and loves and cherishes\\n\\t\\t\\t\\tall.'"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "109",
    "NoteID": "2764",
    "Body": "'If you do not realise the significance of the Message, I\\n\\t\\t\\t\\tat least have done my duty. I have given the Good News\\n\\t\\t\\t\\tfor the Righteous and the Warning for the Unjust, without\\n\\t\\t\\t\\tfavour or partiality, and without abating one jot of the\\n\\t\\t\\t\\ttruth, openly and squarely for all. Do not ask me when\\n\\t\\t\\t\\tthe Good News and the Warning will be fulfilled. That is\\n\\t\\t\\t\\tfor Allah to decide, not for me or for you to know.'"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "110",
    "NoteID": "2765",
    "Body": "The Messenger of Allah freely and impartially teaches all\\n\\t\\t\\t\\thow to carry out Allah's Will and live a good life. If\\n\\t\\t\\t\\tsome of them are hypocrites and come into the Ummat\\n\\t\\t\\t\\t(Brotherhood) from baser motives and not the pure motives\\n\\t\\t\\t\\tof the love of Allah, their motives and conduct will be\\n\\t\\t\\t\\tjudged by Allah and not by men."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "111",
    "NoteID": "2766",
    "Body": "In the same way if men who come into the Brotherhood from\\n\\t\\t\\t\\tpure motives and yet feel aggrieved that those outside\\n\\t\\t\\t\\tare better off from a worldly point of view, they are\\n\\t\\t\\t\\twrong. It may be that the fleeting enjoyment of this\\n\\t\\t\\t\\tworld's goods is but a trial, and they should be grateful\\n\\t\\t\\t\\tfor being saved from temptation."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "112",
    "NoteID": "2767",
    "Body": "See above, n. 2666 to xxi. 4. The better reading is \"Say\"\\n\\t\\t\\t\\tin the imperative, rather than \"He (the Prophet) said (or\\n\\t\\t\\t\\tsays)\" in the indicative mood. Note that, on that\\n\\t\\t\\t\\tconstruction, there are three distinct things which the\\n\\t\\t\\t\\tProphet is asked to say: viz.: (1) the statement in\\n\\t\\t\\t\\tverses 109-11, addressed to those who turn away from the\\n\\t\\t\\t\\tMessage; (2) the prayer addressed to Allah in the first\\n\\t\\t\\t\\tpart of verse 112; and (3) the advice given indirectly to\\n\\t\\t\\t\\tthe Believers, in the second part of verse 112. I have\\n\\t\\t\\t\\tmarked these divisions by means of inverted commas."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "112",
    "NoteID": "2768",
    "Body": "That is, Allah's judgment as between the Teacher and\\n\\t\\t\\t\\tthose who refuse his Message, or between the righteous\\n\\t\\t\\t\\tand those who taunt them for their poverty, will be the\\n\\t\\t\\t\\ttrue one, and both the Teacher and the Ummat must leave\\n\\t\\t\\t\\tthe judgment to Allah."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "112",
    "NoteID": "2769",
    "Body": "Blasphemy is a dreadful sin. We must guard ourselves from\\n\\t\\t\\t\\tit. But as regards others, if we cannot prevent it, we\\n\\t\\t\\t\\tmust pray to Allah for assistance and not rely upon\\n\\t\\t\\t\\tcarnal weapons."
  }
]
