[
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "1",
    "sectionHeading": "Qirad.",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Zayd ibn Aslam that his father\\n\\t\\t\\t\\tsaid, \"Abdullah and Ubaydullah, the sons of Umar ibn\\n\\t\\t\\t\\tal-Khattab went out with the army to Iraq. On the way\\n\\t\\t\\t\\thome, they passed by Abu Musa al-Ashari who was the amir\\n\\t\\t\\t\\tof Basra. He greeted them and made them welcome, and told\\n\\t\\t\\t\\tthem that if there was anything he could do to help them,\\n\\t\\t\\t\\the would do it. Then he said, 'There is some of the\\n\\t\\t\\t\\tproperty of Allah which I want to send to the amir\\n\\t\\t\\t\\tal-muminin, so I will lend it to you, and you can buy\\n\\t\\t\\t\\twares from Iraq and sell them in Madina. Then give the\\n\\t\\t\\t\\tprincipal to the amir al-muminin, and you keep the\\n\\t\\t\\t\\tprofit.' They said that they would like to do it, and so\\n\\t\\t\\t\\the gave them the money and wrote to Umar ibn al-Khattab\\n\\t\\t\\t\\tto take the money from them. When they came to sell they\\n\\t\\t\\t\\tmade a profit, and when they paid the principal to Umar\\n\\t\\t\\t\\the asked, 'Did he lend everyone in the army the like of\\n\\t\\t\\t\\twhat he lent you?' They said, 'No.' Umar ibn al-Khattab\\n\\t\\t\\t\\tsaid, 'He made you the loan, because you are the sons of\\n\\t\\t\\t\\tthe amir al-muminin, so pay the principal and the\\n\\t\\t\\t\\tprofit.' Abdullah was silent. Ubaydullah said, 'You do\\n\\t\\t\\t\\tnot need to do this, amir al-muminin. Had the principal\\n\\t\\t\\t\\tdecreased or been destroyed, we would have guaranteed\\n\\t\\t\\t\\tit.' Umar said, 'Pay it.' Abdullah was silent, and\\n\\t\\t\\t\\tUbaydullah repeated it. A man who was sitting with Umar\\n\\t\\t\\t\\tsaid, 'Amir al-muminin, better that you make it a qirad.\\n\\t\\t\\t\\t'Umar said, 'I have made it qirad.' Umar then took the\\n\\t\\t\\t\\tprincipal and half of the profit, and Abdullah and\\n\\t\\t\\t\\tUbaydullah, the sons of Umar ibn al-Khattab took half of\\n\\t\\t\\t\\tthe profit.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "2",
    "sectionHeading": "Qirad.",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from al-Ala ibn Abd ar-Rahman from\\n\\t\\t\\t\\this father from his father that Uthman ibn Affan gave him\\n\\t\\t\\t\\tsome money as qirad to use provided the profit was shared\\n\\t\\t\\t\\tbetween them.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "3",
    "sectionHeading": "What Is Permitted in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The recognised and permitted form of qirad\\n\\t\\t\\t\\tis that a man take capital from an associate to use. He\\n\\t\\t\\t\\tdoes not guarantee it and in travelling pays out of the\\n\\t\\t\\t\\tcapital for food and clothes and what he makes good use\\n\\t\\t\\t\\tof, according to the amount of capital. That is, when he\\n\\t\\t\\t\\ttravels to do the work and the capital can support it. If\\n\\t\\t\\t\\the remains with his people, he does not have expenses or\\n\\t\\t\\t\\tclothing from the capital.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in the two parties in a\\n\\t\\t\\t\\tqirad helping each other by way of a favour when it is\\n\\t\\t\\t\\tacceptable to them both.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in the investor of the\\n\\t\\t\\t\\tcapital buying some of the goods from the agent in the\\n\\t\\t\\t\\tqirad if that is acceptable and without conditions.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor making a qirad loan to a\\n\\t\\t\\t\\tman and his slave, to be used by both. He said, \"That is\\n\\t\\t\\t\\tpermitted, and there is no harm in it because the profit\\n\\t\\t\\t\\tis property for his slave, and the profit is not for the\\n\\t\\t\\t\\tmaster until he takes it from him. It is like the rest of\\n\\t\\t\\t\\this earnings.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "4",
    "sectionHeading": "What Is Not Permitted in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"When a man owes money to another man and he\\n\\t\\t\\t\\tasks him to let it stay with him as a quirad, that is\\n\\t\\t\\t\\tdisapproved of until the creditor receives his property.\\n\\t\\t\\t\\tThen he can make it a qirad loan or keep it. That is\\n\\t\\t\\t\\tbecause the debtor may be in a tight situation, and want\\n\\t\\t\\t\\tto delay it to increase it for him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who made a qirad loan to a\\n\\t\\t\\t\\tman, and some of the principal was lost before he used\\n\\t\\t\\t\\tit, and then he used it and made a profit. The agent\\n\\t\\t\\t\\twanted to make the principal the remainder of the money\\n\\t\\t\\t\\tafter what was lost from it. Malik said, \"His statement\\n\\t\\t\\t\\tis not accepted, and the principal is made up to its\\n\\t\\t\\t\\toriginal amount from his profit. Then they divide what\\n\\t\\t\\t\\tremains after the principal has been repaid according to\\n\\t\\t\\t\\tthe conditions of the qirad.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Qirad loan is only good in gold or silver\\n\\t\\t\\t\\tcoin and it is never permitted in any kind of wares or\\n\\t\\t\\t\\tgoods or articles.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There are certain transactions which if a\\n\\t\\t\\t\\tlong span of time passes after the transaction takes\\n\\t\\t\\t\\tplace, its revocation becomes unacceptable. As for usury,\\n\\t\\t\\t\\tthere is never anything except its rejection whether it\\n\\t\\t\\t\\tis a little or a lot. What is permitted in other than it\\n\\t\\t\\t\\tis not permitted in it because Allah, the Blessed and the\\n\\t\\t\\t\\tExalted, said in His Book, 'If you repent, you have your\\n\\t\\t\\t\\tcapital back, not wronging and not wronged. ' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t32.4 Conditions Permitted in Qirad\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "5",
    "sectionHeading": "What Is Not Permitted in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik spoke about an investor who made a\\n\\t\\t\\t\\tqirad loan and stipulated to the agent that only certain\\n\\t\\t\\t\\tgoods should be bought with his money or he forbade\\n\\t\\t\\t\\tcertain goods which he named to be bought. He said,\\n\\t\\t\\t\\t\"There is no harm in an investor making a condition on an\\n\\t\\t\\t\\tagent in qirad not to buy a certain kind of animal or\\n\\t\\t\\t\\tgoods which he specifies. It is disapproved of for an\\n\\t\\t\\t\\tinvestor to make as a condition on an agent in qirad that\\n\\t\\t\\t\\the only buy certain goods unless the goods which he\\n\\t\\t\\t\\torders him to buy are in plentiful supply and do not fail\\n\\t\\t\\t\\teither in winter or summer. There is no harm in that\\n\\t\\t\\t\\tcase.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who loaned qirad money and\\n\\t\\t\\t\\tstipulated that something of the profit should be his\\n\\t\\t\\t\\talone without the agent sharing in it. He said, \"That is\\n\\t\\t\\t\\tnot good, even if it is only one dirham unless he\\n\\t\\t\\t\\tstipulates that half the profit is his and half the\\n\\t\\t\\t\\tprofit is the agent's or a third or a fourth or whatever.\\n\\t\\t\\t\\tWhen he names a percentage, whether great or small,\\n\\t\\t\\t\\teverything specified by that is halal. This is the qirad\\n\\t\\t\\t\\tof the muslims.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"It is also not good if the investor stipulates\\n\\t\\t\\t\\tthat one dirham or more of the profit is purely his, with\\n\\t\\t\\t\\tout the agent sharing it and then what remains of the\\n\\t\\t\\t\\tprofit is to be divided in half between them. That is not\\n\\t\\t\\t\\tthe qirad of the Muslims.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "6",
    "sectionHeading": "Conditions Not Permitted in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The person who puts up the\\n\\t\\t\\t\\tprincipal must not stipulate that he has something of the\\n\\t\\t\\t\\tprofit alone without the agent sharing in it, nor must\\n\\t\\t\\t\\tthe agent stipulate that he has something of the profit\\n\\t\\t\\t\\talone without the investor sharing. In qirad, there is no\\n\\t\\t\\t\\tsale, no rent, no work, no advance, and no convenience\\n\\t\\t\\t\\twhich one party specifies to himself without the other\\n\\t\\t\\t\\tparty sharing unless one party allows it to the other\\n\\t\\t\\t\\tunconditionally as a favour and that is alright to both.\\n\\t\\t\\t\\tNeither of the parties should make a condition over the\\n\\t\\t\\t\\tother which increases him in gold or silver or food over\\n\\t\\t\\t\\tthe other party.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"If any of that enters the qirad, it becomes\\n\\t\\t\\t\\thire, and hire is only good with known and fixed terms.\\n\\t\\t\\t\\tThe agent should not stipulate when he takes the\\n\\t\\t\\t\\tprincipal that he repay or commission anyone with the\\n\\t\\t\\t\\tgoods, nor that he take any of them for himself. When\\n\\t\\t\\t\\tthere is a profit, and it is time to separate the\\n\\t\\t\\t\\tcapital, then they divide the profit according to the\\n\\t\\t\\t\\tterms of the contract. If the principal does not increase\\n\\t\\t\\t\\tor there is a loss, the agent does not have to make up\\n\\t\\t\\t\\tfor what he spent on himself or for the loss. That falls\\n\\t\\t\\t\\tto the investor from the principal. Qirad is permitted\\n\\t\\t\\t\\tupon whatever terms the investor and the agent make a\\n\\t\\t\\t\\tmutual agreement, of half the profit, or a third or a\\n\\t\\t\\t\\tfourth or whatever.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not permitted for the agent to\\n\\t\\t\\t\\tstipulate that he use the qirad money for a certain\\n\\t\\t\\t\\tnumber of years and that it not be taken from him during\\n\\t\\t\\t\\tthat time.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"It is not good for the investor to stipulate\\n\\t\\t\\t\\tthat the qirad money should not be returned for a certain\\n\\t\\t\\t\\tnumber of years which are specified, because the qirad is\\n\\t\\t\\t\\tnot for a term. The investor loans it to an agent to use\\n\\t\\t\\t\\tfor him. If it seems proper to either of them to abandon\\n\\t\\t\\t\\tthe project and the money is coin, and nothing has been\\n\\t\\t\\t\\tbought with it, it can be abandoned, and the investor\\n\\t\\t\\t\\ttakes his money back. If it seems proper to the investor\\n\\t\\t\\t\\tto take the qirad loan back after goods have been\\n\\t\\t\\t\\tpurchased with it, he cannot do so until the buyer has\\n\\t\\t\\t\\tsold the goods and they have become money. If it seems\\n\\t\\t\\t\\tproper to the agent to return the loan, and it has been\\n\\t\\t\\t\\tturned to goods he cannot do so until he has sold them.\\n\\t\\t\\t\\tHe returns the loan in cash as he took it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not good for the investor to stipulate\\n\\t\\t\\t\\tthat the agent pay any zakat due from his portion of the\\n\\t\\t\\t\\tprofit in particular, because the investor by stipulating\\n\\t\\t\\t\\tthat, stipulates fixed increase for himself from the\\n\\t\\t\\t\\tprofit because the portion of zakat he would be liable\\n\\t\\t\\t\\tfor by his portion of the profit, is removed from him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"It is not permitted for the investor to stipulate to the\\n\\t\\t\\t\\tagent to only buy from so-and-so, referring to a specific\\n\\t\\t\\t\\tman. That is not permitted because by doing so he would\\n\\t\\t\\t\\tbecome his hireling for a wage.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor in qirad who stipulated a\\n\\t\\t\\t\\tguarantee for an amount of money from the agent, \"The\\n\\t\\t\\t\\tinvestor is not permitted to stipulate conditions about\\n\\t\\t\\t\\this principal other than the conditions on which qirad is\\n\\t\\t\\t\\tbased or according to the precedent of the sunna of the\\n\\t\\t\\t\\tMuslims. If the principal is increased by the condition\\n\\t\\t\\t\\tof guarantee, the investor has increased his share of the\\n\\t\\t\\t\\tprofit because of the position of the guarantee. But the\\n\\t\\t\\t\\tprofit is only to be divided according to what it would\\n\\t\\t\\t\\thave been had the loan been given without the guarantee.\\n\\t\\t\\t\\tIf the principal is destroyed, I do not think that the\\n\\t\\t\\t\\tagent has a guarantee held against him because the\\n\\t\\t\\t\\tstipulation of guarantees in qirad is null and void.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who gave qirad money to a\\n\\t\\t\\t\\tman and the man stipulated that he would only buy palms\\n\\t\\t\\t\\tor animals with it because he sought to eat the dates or\\n\\t\\t\\t\\tthe offspring of the animals and he kept them for some\\n\\t\\t\\t\\ttime to use for himself. He said, \"That is not permitted.\\n\\t\\t\\t\\tIt is not the sunna of the Muslims in qirad unless he\\n\\t\\t\\t\\tbuys it and then sells it as other goods are sold.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in the agent stipulating on\\n\\t\\t\\t\\tthe investor a slave to help him provided that the slave\\n\\t\\t\\t\\tstands to gain along with him out of the investment, and\\n\\t\\t\\t\\twhen the slave only helps him with the investment, not\\n\\t\\t\\t\\twith anything else.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "7",
    "sectionHeading": "Qirad In Wares",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"No one should make a qirad\\n\\t\\t\\t\\tloan except in coin, because the loan must not be in\\n\\t\\t\\t\\twares, since loaning wares can only be worked in one of\\n\\t\\t\\t\\ttwo ways: Either the owner of the wares says to the\\n\\t\\t\\t\\tborrower, 'Take these wares and sell them. Buy and sell\\n\\t\\t\\t\\twith the capital realized according to qirad.' The\\n\\t\\t\\t\\tinvestor stipulates increase for himself from the sale of\\n\\t\\t\\t\\this goods and what relieves him of expenses in selling\\n\\t\\t\\t\\tit. Or else he says, 'Barter with these goods and sell.\\n\\t\\t\\t\\tWhen you are through, buy for me the like of my goods\\n\\t\\t\\t\\twhich I gave you. If there is increase, it is between you\\n\\t\\t\\t\\tand me. 'It may happen that the investor gives the goods\\n\\t\\t\\t\\tto the agent at a time in which they are in demand and\\n\\t\\t\\t\\texpensive, and then the agent returns them while they are\\n\\t\\t\\t\\tcheap and he might have bought them for only a third of\\n\\t\\t\\t\\tthe original price or even less than that. The agent then\\n\\t\\t\\t\\thas a profit of half the amount by which the price of the\\n\\t\\t\\t\\twares has decreased as his portion of the profit. Or he\\n\\t\\t\\t\\tmight take the wares at a time when their price is low,\\n\\t\\t\\t\\tand make use of them until he has a lot of money. Then\\n\\t\\t\\t\\tthose wares become expensive and their price rises when\\n\\t\\t\\t\\the returns them, so he buys them for all that he has so\\n\\t\\t\\t\\tthat all his work and concern have been in vain. This is\\n\\t\\t\\t\\tan uncertain transaction and is not good. If, however,\\n\\t\\t\\t\\tthat is not known until it has happened, then the wage an\\n\\t\\t\\t\\tagent in qirad would be paid for selling that, is looked\\n\\t\\t\\t\\tat and he is given it for his concern. Then the money is\\n\\t\\t\\t\\tqirad from the day the money became cash and collected as\\n\\t\\t\\t\\tcoin and it is returned as a qirad like that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "8",
    "sectionHeading": "Hire in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik spoke about a man who made a qirad\\n\\t\\t\\t\\tloan to a man and he bought wares with it and transported\\n\\t\\t\\t\\tthem to a commercial centre. It was not profitable to\\n\\t\\t\\t\\tsell them and the agent feared a loss if he sold them, so\\n\\t\\t\\t\\the hired transport to take them to another city, and he\\n\\t\\t\\t\\tsold them there and made a loss, and the cost of the hire\\n\\t\\t\\t\\twas greater than the principal.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the agent can pay the cost of the hire\\n\\t\\t\\t\\tfrom what the capital realized, his way is that. Whatever\\n\\t\\t\\t\\tportion of the hire is not covered by the principal, the\\n\\t\\t\\t\\tagent must pay it. The investor is not answerable for any\\n\\t\\t\\t\\tof it. That is because the investor only ordered him to\\n\\t\\t\\t\\ttrade with the principal. The investor is not answerable\\n\\t\\t\\t\\tfor other than the principal. Had the investor been\\n\\t\\t\\t\\tliable, it would have been an additional loss to him on\\n\\t\\t\\t\\ttop of the principal which he invested. The agent cannot\\n\\t\\t\\t\\tput that on to the investor.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "9",
    "sectionHeading": "Overstepping in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik spoke about an investor who made a\\n\\t\\t\\t\\tqirad loan to a man, who used it and made a profit. Then\\n\\t\\t\\t\\tthe man bought with all the profit a slave-girl and he\\n\\t\\t\\t\\thad intercourse with her and she became pregnant by him,\\n\\t\\t\\t\\tand so the capital decreased. Malik said, \"If he has\\n\\t\\t\\t\\tmoney, the price of the slave-girl is taken from his\\n\\t\\t\\t\\tproperty, and the capital is restored by it. If there is\\n\\t\\t\\t\\tsomething left over after the money is paid, it is\\n\\t\\t\\t\\tdivided between them according to the first qirad. If he\\n\\t\\t\\t\\tcannot pay it, the slave-girl is sold so that the capital\\n\\t\\t\\t\\tis restored from her price.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who made a qirad loan to a\\n\\t\\t\\t\\tman, and the agent spent more than the amount of the\\n\\t\\t\\t\\tqirad loan when buying goods with it and paid the\\n\\t\\t\\t\\tincrease from his own money. Malik said, \"The investor\\n\\t\\t\\t\\thas a choice if the goods are sold for a profit or loss\\n\\t\\t\\t\\tor if they are not sold. If he wishes to take the goods,\\n\\t\\t\\t\\the takes them and pays the agent back what he put in for\\n\\t\\t\\t\\tthem. If the agent refuses, the investor is a partner for\\n\\t\\t\\t\\this share of the price in increase and decrease according\\n\\t\\t\\t\\tto what the agent paid extra for them from himself.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an agent who took qirad money from a\\n\\t\\t\\t\\tman and then gave it to another man to use as a qirad\\n\\t\\t\\t\\twithout the consent of the investor. He said, \"The agent\\n\\t\\t\\t\\tis responsible for the property. If it is decreased, he\\n\\t\\t\\t\\tis responsible for the loss. If there is profit, the\\n\\t\\t\\t\\tinvestor has his stipulation of the profit, and then the\\n\\t\\t\\t\\tagent has his stipulation of what remains of the money.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an agent who exceeded and borrowed some\\n\\t\\t\\t\\tof what he had of qirad in money and he bought goods for\\n\\t\\t\\t\\thimself with it. Malik said, \"If he has a profit, the\\n\\t\\t\\t\\tprofit is divided according to the condition between them\\n\\t\\t\\t\\tin the qirad. If he has a loss, he is responsible for the\\n\\t\\t\\t\\tloss.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about an investor who paid qirad money to a\\n\\t\\t\\t\\tman, and the agent borrowed some of the cash and bought\\n\\t\\t\\t\\tgoods for himself with it, \"The investor of the capital\\n\\t\\t\\t\\thas a choice. If he wishes, he shares with him in the\\n\\t\\t\\t\\tgoods according to the qirad, and if he wishes, he frees\\n\\t\\t\\t\\thimself of them, and takes all of the principal back from\\n\\t\\t\\t\\tthe agent. That is what is done with some one who\\n\\t\\t\\t\\toversteps.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "10",
    "sectionHeading": "Expenses Permitted in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik spoke about an investor who made a\\n\\t\\t\\t\\tqirad loan to a man.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"When the investment is large, the travelling\\n\\t\\t\\t\\texpenses of the agent are taken from it. He can use it to\\n\\t\\t\\t\\teat and clothe himself in an acceptable fashion according\\n\\t\\t\\t\\tto the size of the investment. If it saves him trouble,\\n\\t\\t\\t\\the can take a wage from some of the capital, if it is\\n\\t\\t\\t\\tlarge, and he cannot support himself. There are certain\\n\\t\\t\\t\\tjobs which an agent or his like are not responsible for,\\n\\t\\t\\t\\tamongst them are collecting debts, transporting the\\n\\t\\t\\t\\tgoods, loading up and so forth. He can hire from the\\n\\t\\t\\t\\tcapital someone to do that for him. The agent should not\\n\\t\\t\\t\\tspend from the capital nor clothe himself from it while\\n\\t\\t\\t\\the resides with his family. It is only permitted for him\\n\\t\\t\\t\\tto have expenses when he travels for the investment. The\\n\\t\\t\\t\\texpenses are taken from the capital. If he is only\\n\\t\\t\\t\\ttrading with the property in the city in which he\\n\\t\\t\\t\\tresides, he has no expenses from the capital and no\\n\\t\\t\\t\\tclothing.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who paid qirad money to a\\n\\t\\t\\t\\tman, and the agent went out with it and with his own\\n\\t\\t\\t\\tcapital. He said, \"The expenses come from the qirad and\\n\\t\\t\\t\\tfrom his own capital according to their proportions.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "11",
    "sectionHeading": "Expenses Not Permitted in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik spoke about an agent who had qirad\\n\\t\\t\\t\\tmoney with him and he spent from it and clothed himself.\\n\\t\\t\\t\\tHe said, \"He cannot give away any of it, and neither a\\n\\t\\t\\t\\tbeggar nor anyone else is to be given any of it and he\\n\\t\\t\\t\\tdoes not pay anyone compensation from it. If he meets\\n\\t\\t\\t\\tsome people, and they bring out food and he brings out\\n\\t\\t\\t\\tfood, I hope that that will be permitted to him if he\\n\\t\\t\\t\\tdoes not intend to bestow something on them. If he\\n\\t\\t\\t\\tintends that or what is like  that without the permission\\n\\t\\t\\t\\tof the investor, he must get the sanction of the investor\\n\\t\\t\\t\\tfor it. If he sanctions it, there is no harm. If he\\n\\t\\t\\t\\trefuses to sanction it, he must repay it with like if he\\n\\t\\t\\t\\thas something which is suitable as compensation.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "12",
    "sectionHeading": "Debts in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The generally agreed on way\\n\\t\\t\\t\\tof doing things among us about an investor who pays qirad\\n\\t\\t\\t\\tmoney to an agent to buy goods, and the agent then sells\\n\\t\\t\\t\\tthe goods for a price to be paid later, and has a profit\\n\\t\\t\\t\\tin the transaction, then the agent dies before he has\\n\\t\\t\\t\\treceived payment, is that if his heirs want to take that\\n\\t\\t\\t\\tmoney, they have their father's stipulated portion from\\n\\t\\t\\t\\tthe profit. That is theirs if they are trustworthy to\\n\\t\\t\\t\\ttake the payment. If they dislike to collect it from the\\n\\t\\t\\t\\tdebtor and they refer him to the investor, they are not\\n\\t\\t\\t\\tobliged to collect it and there is nothing against them\\n\\t\\t\\t\\tand nothing for them by their surrendering it to the\\n\\t\\t\\t\\tinvestor. If they do collect it, they have a share of it\\n\\t\\t\\t\\tand expenses like their father had. They are in the\\n\\t\\t\\t\\tposition of their father. If they are not trustworthy to\\n\\t\\t\\t\\tdo so, they can bring someone reliable and trustworthy to\\n\\t\\t\\t\\tcollect the money. If he collects all the capital and all\\n\\t\\t\\t\\tthe profit, they are in the position of their father.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who paid qirad money to a\\n\\t\\t\\t\\tman provided that he used it and was responsible for any\\n\\t\\t\\t\\tdelayed payment for which he sold it. He said, \"This is\\n\\t\\t\\t\\tobligatory on the agent. If he sells it for delayed\\n\\t\\t\\t\\tpayment, he is responsible for it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "13",
    "sectionHeading": "Goods in the Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik spoke about an investor who gave\\n\\t\\t\\t\\tqirad money to a man, and then the man sought a loan from\\n\\t\\t\\t\\tthe investor or the investor borrowed money from the\\n\\t\\t\\t\\tagent, or the investor left goods with the agent to sell\\n\\t\\t\\t\\tfor him, or the investor gave the agent dinars to buy\\n\\t\\t\\t\\tgoods with. Malik said, \"There is no harm if the investor\\n\\t\\t\\t\\tleaves his goods with him knowing that if the agent did\\n\\t\\t\\t\\tnot have his money and he had asked a similar thing of\\n\\t\\t\\t\\thim, he would have still done it because of the\\n\\t\\t\\t\\tbrotherhood between them or because it would have been no\\n\\t\\t\\t\\tbother to him and that had the agent refused that, he\\n\\t\\t\\t\\twould not have removed his capital from him. Or if the\\n\\t\\t\\t\\tagent had borrowed from the investor or carried his goods\\n\\t\\t\\t\\tfor him and he knew that if the investor had not had his\\n\\t\\t\\t\\tcapital with him, he would have still done the same for\\n\\t\\t\\t\\thim, and had he refused that to him, he would not have\\n\\t\\t\\t\\treturned his capital to him. If that is true between both\\n\\t\\t\\t\\tof them and it is in the way of a favour between them and\\n\\t\\t\\t\\tit is not a condition in the terms of the qirad, it is\\n\\t\\t\\t\\tpermitted and there is no harm in it. If a condition\\n\\t\\t\\t\\tcomes into it, or it is feared that the agent is only\\n\\t\\t\\t\\tdoing it for the investor in order to safeguard the\\n\\t\\t\\t\\tcapital in his possession, or the investor is only doing\\n\\t\\t\\t\\tit because the agent has taken his capital and will not\\n\\t\\t\\t\\treturn it to him, that is not permitted in qirad and it\\n\\t\\t\\t\\tis part of what the people of knowledge forbid.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "14",
    "sectionHeading": "Loans in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik spoke about a man who loaned\\n\\t\\t\\t\\tanother man money and then the debtor asked him to leave\\n\\t\\t\\t\\tit with him as a qirad. Malik said, \"I do not like that\\n\\t\\t\\t\\tunless he takes his money back from him, and then pays it\\n\\t\\t\\t\\tto him as a qirad if he wishes or if he wishes keep it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who paid a man qirad money\\n\\t\\t\\t\\tand the man told him that it was collected with him and\\n\\t\\t\\t\\tasked him to write it for him as a loan. He said, \"I do\\n\\t\\t\\t\\tnot like that unless he takes his money from him and then\\n\\t\\t\\t\\tlends it to him or keeps it as he wishes. That is only\\n\\t\\t\\t\\tout of fear that he has lost some of it, and wants to\\n\\t\\t\\t\\tdefer it so that he can make up what has been lost of it.\\n\\t\\t\\t\\tThat is disapproved of and is not permitted and it is not\\n\\t\\t\\t\\tgood.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "15",
    "sectionHeading": "Accounting in Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik spoke about an investor paying\\n\\t\\t\\t\\tqirad money to an agent who made a profit and then wanted\\n\\t\\t\\t\\tto take his share of the profit and the investor was\\n\\t\\t\\t\\taway. He said, \"He should not take any of it unless the\\n\\t\\t\\t\\tinvestor is present. If he takes something from it, he is\\n\\t\\t\\t\\tresponsible for it until it is accounted for in the\\n\\t\\t\\t\\tdivision of the capital.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not permitted for the parties involved\\n\\t\\t\\t\\tin a qirad to account and divide property which is away\\n\\t\\t\\t\\tfrom them until the capital is present, and the investor\\n\\t\\t\\t\\tis given the principal in full. Then they divide the\\n\\t\\t\\t\\tprofit into their agreed portions.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man taking qirad money, and buying\\n\\t\\t\\t\\tgoods with it while he had a debt. His creditors sought\\n\\t\\t\\t\\tand found him while he was in a city away from the\\n\\t\\t\\t\\tinvestor, and he had profitable merchandise whose good\\n\\t\\t\\t\\tquality was clear. They wanted him to sell the\\n\\t\\t\\t\\tmerchandise for them so that they could take his share of\\n\\t\\t\\t\\tthe profit. Malik said, \"None of the profit of the qirad\\n\\t\\t\\t\\tis taken until the investor is present. He takes his\\n\\t\\t\\t\\tprincipal and then the profit is divided mutually between\\n\\t\\t\\t\\tthem.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who put qirad money with an\\n\\t\\t\\t\\tagent and he used it and had a profit. Then the principal\\n\\t\\t\\t\\twas set aside and the profit divided. He took his share\\n\\t\\t\\t\\tand added the share of the investor to his principal in\\n\\t\\t\\t\\tthe presence of witnesses he had called. Malik said, \"It\\n\\t\\t\\t\\tis not permitted to divide the profit unless the investor\\n\\t\\t\\t\\tis present. If he has taken something here turns it until\\n\\t\\t\\t\\tthe investor has  received the principal in full. Then\\n\\t\\t\\t\\twhat remains is divided into their respective portions.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who put qirad money with an\\n\\t\\t\\t\\tagent. The agent used it and then came to the investor\\n\\t\\t\\t\\tand said, \"This is your portion of the profit, and I have\\n\\t\\t\\t\\ttaken the like of it for myself, and I have retained your\\n\\t\\t\\t\\tprincipal in full.\" Malik said, \"I do not like that,\\n\\t\\t\\t\\tunless all the capital is present, the principal is there\\n\\t\\t\\t\\tand he knows that it is complete and he receives it. Then\\n\\t\\t\\t\\tthey divide the profit between them. He returns the\\n\\t\\t\\t\\tprincipal to him if he wishes, or he keeps it. The\\n\\t\\t\\t\\tpresence of the principal is necessary out of fear that\\n\\t\\t\\t\\tthe agent might have lost some of it, and so may want it\\n\\t\\t\\t\\tnot to be removed from him and to keep it in his hand.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "32",
    "hadithNumber": "16",
    "sectionHeading": "A General View of Qirad",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik spoke about an investor who put\\n\\t\\t\\t\\tqirad money with an agent who bought goods with it, and\\n\\t\\t\\t\\tthe investor told him to sell them. The agent said that\\n\\t\\t\\t\\the did not see any way to sell at that time and they\\n\\t\\t\\t\\tquarrelled about it. He said, \"One does not look at the\\n\\t\\t\\t\\tstatement of either of them. The people of experience and\\n\\t\\t\\t\\tinsight concerning such goods are asked about these\\n\\t\\t\\t\\tgoods. If they can see anyway of selling them they are\\n\\t\\t\\t\\tsold for them. If they think it is time to wait, they\\n\\t\\t\\t\\tshould wait.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who took qirad money from an\\n\\t\\t\\t\\tinvestor and used it and when the investor asked him for\\n\\t\\t\\t\\this money, he said that he had it in full. When he held\\n\\t\\t\\t\\thim to his settlement he admitted that \"Such-and-such of\\n\\t\\t\\t\\tit was lost with me,\" and he named an amount of money. \"I\\n\\t\\t\\t\\ttold you that so that you would leave it with me.\" Malik\\n\\t\\t\\t\\tsaid, \"He does not benefit by denying it after he had\\n\\t\\t\\t\\tconfirmed that he had it all . He is answerable by his\\n\\t\\t\\t\\tconfession against himself unless he produces evidence\\n\\t\\t\\t\\tabout the loss of that property which confirms his\\n\\t\\t\\t\\tstatement. If he does not produce an acceptable reason he\\n\\t\\t\\t\\tis answerable by his confession, and his denial does not\\n\\t\\t\\t\\tavail him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Similarly, had he said, 'I have had\\n\\t\\t\\t\\tsuch-and-such a profit from the capital,' and then the\\n\\t\\t\\t\\towner of the capital asked him to pay him the principal\\n\\t\\t\\t\\tand his profit, and he said that he had not had any\\n\\t\\t\\t\\tprofit in it and had said that only so it might be left\\n\\t\\t\\t\\tin his possession, it does not benefit him. He is taken\\n\\t\\t\\t\\tto account for what he affirmed unless he brings\\n\\t\\t\\t\\tacceptable proof of his word, so that the first statement\\n\\t\\t\\t\\tis not binding on him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an investor who put qirad money with an\\n\\t\\t\\t\\tagent who made a profit with it. The agent said, \"I took\\n\\t\\t\\t\\tthe qirad from you provided that I would have\\n\\t\\t\\t\\ttwo-thirds.\" The owner of the capital says, \"I gave you a\\n\\t\\t\\t\\tqirad provided that you had a third.\" Malik said, \"The\\n\\t\\t\\t\\tword is the word of the agent, and he must take an oath\\n\\t\\t\\t\\ton that if what he says resembles the known practice of\\n\\t\\t\\t\\tqirad or is close to it. If he brings a matter which is\\n\\t\\t\\t\\tunacceptable and people do not make qirads like that, he\\n\\t\\t\\t\\tis not believed, and it is judged to be according to how\\n\\t\\t\\t\\ta qirad like it would normally be.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who gave a man one hundred dinars\\n\\t\\t\\t\\tas a qirad. He bought goods with it and then went to pay\\n\\t\\t\\t\\tthe one hundred dinars to the owner of the goods and\\n\\t\\t\\t\\tfound that they had been stolen. The investor says, \"Sell\\n\\t\\t\\t\\tthe goods. If there is anything over, it is mine. If\\n\\t\\t\\t\\tthere is a loss, it is against you because you lost it.\"\\n\\t\\t\\t\\tThe agent says, \"Rather you must fulfil what the seller\\n\\t\\t\\t\\tis owed. I bought them with your capital which you gave\\n\\t\\t\\t\\tme.\" Malik said, \"The agent is obliged to pay the price\\n\\t\\t\\t\\tto the seller and the investor is told, 'If you wish, pay\\n\\t\\t\\t\\tthe hundred dinars to the agent and the goods are between\\n\\t\\t\\t\\tyou. The qirad is according to what the first hundred was\\n\\t\\t\\t\\tbased on. If you wish, you are free of the goods.' If the\\n\\t\\t\\t\\thundred dinars are paid to the agent, it is a qirad\\n\\t\\t\\t\\taccording to the conditions of the first qirad. If he\\n\\t\\t\\t\\trefuses, the goods belong to the agent and he must pay\\n\\t\\t\\t\\ttheir price.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about two people in a qirad who settled up\\n\\t\\t\\t\\tand the agent still had some of the goods which he used -\\n\\t\\t\\t\\tthreadbare cloth or a waterskin or the like of that.\\n\\t\\t\\t\\tMalik said, \"Any of that which is insignificant is of no\\n\\t\\t\\t\\timportance and belongs to the agent. I have not heard\\n\\t\\t\\t\\tanyone give a decision calling for the return of that.\\n\\t\\t\\t\\tAnything which has a price is returned. If it is\\n\\t\\t\\t\\tsomething which has value like an animal, camel, coarse\\n\\t\\t\\t\\tcloth or the like of that which fetches a price, I think\\n\\t\\t\\t\\tthat he should return what he has remaining of such\\n\\t\\t\\t\\tthings unless the owner overlooks it.\" \\n\\t\\t\\t</p>"
  }
]
