[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/035001",
        "Body":  "Praise be to Allah, the Creator of the heavens and the earth, who\n\t\t\tappointeth the angels messengers having wings two, three and\n\t\t\tfour. He multiplieth in creation what He will. Lo! Allah is Able\n\t\t\tto do all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/035010",
        "Body":  "Whoso desireth power (should know that) all power belongeth to\n\t\t\tAllah. Unto Him good words ascend, and the pious deed doth He\n\t\t\texalt; but those who plot iniquities, theirs will be an awful\n\t\t\tdoom; and the plotting of such (folk) will come to naught."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/035011",
        "Body":  "Allah created you from dust, then from a little fluid, then He\n\t\t\tmade you pairs (the male and female). No female beareth or\n\t\t\tbringeth forth save with His knowledge. And no one groweth old\n\t\t\twho groweth old, nor is aught lessened of his life, but it is\n\t\t\trecorded in a Book. Lo! that is easy for Allah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/035012",
        "Body":  "And two seas are not alike: this, fresh, sweet, food to drink,\n\t\t\tthis (other) bitter, salt. And from them both ye eat fresh meat\n\t\t\tand derive the ornament that ye wear. And thou seest the ship\n\t\t\tcleaving them with its prow that ye may seek of His bounty, and\n\t\t\tthat haply ye may give thanks."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/035013",
        "Body":  "He maketh the night to pass into the day and He maketh the day to\n\t\t\tpass into the night. He hath subdued the sun and moon to service.\n\t\t\tEach runneth unto an appointed term. Such is Allah, your lord;\n\t\t\tHis is the Sovereignty; and those unto whom ye pray instead of\n\t\t\tHim own not so much as the white spot on a date stone."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/035014",
        "Body":  "If ye pray unto them they hear not your prayer, and if they heard\n\t\t\tthey could not grant it you. On the Day of Resurrection they will\n\t\t\tdisown association with you. None can inform you like Him Who is\n\t\t\tAware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/035015",
        "Body":  "O mankind! Ye are the poor in your relation to Allah. And Allah!\n\t\t\tHe is the Absolute, the Owner of Praise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/035016",
        "Body":  "If He will, He can be rid of you and bring (instead of you) some\n\t\t\tnew creation."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/035017",
        "Body":  "That is not a hard thing for Allah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/035018",
        "Body":  "And no burdened soul can bear another\u0027s burden, and if one heavy\n\t\t\tladen crieth for (help with) his load, naught of it will be\n\t\t\tlifted even though he (unto whom he crieth) be of kin. Thou\n\t\t\twarnest only those who fear their Lord in secret, and have\n\t\t\testablished worship. He who groweth (in goodness), groweth only\n\t\t\tfor himself, (he cannot by his merit redeem others). Unto Allah\n\t\t\tis the journeying."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/035019",
        "Body":  "The blind man is not equal with the seer;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/035002",
        "Body":  "That which Allah openeth unto mankind of mercy none can withhold\n\t\t\tit; and that which He withholdeth none can release thereafter. He\n\t\t\tis the Mighty, the Wise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/035020",
        "Body":  "Nor is darkness (tantamount to) light;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/035021",
        "Body":  "Nor is the shadow equal with the sun\u0027s full heat;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/035022",
        "Body":  "Nor are the living equal with the dead. Lo! Allah maketh whom He\n\t\t\twill to hear. Thou canst not reach those who are in the graves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/035023",
        "Body":  "Thou art but a warner."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/035024",
        "Body":  "Lo! We have sent thee with the Truth, a bearer of glad tidings\n\t\t\tand a warner; and there is not a nation but a warner hath passed\n\t\t\tamong them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/035025",
        "Body":  "And if they deny thee: those before them also denied. Their\n\t\t\tmessengers came unto them with clear proofs (of Allah\u0027s\n\t\t\tsovereignty), and with the Psalms and the Scripture giving light."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/035026",
        "Body":  "Then seized I those who disbelieved, and how intense was My\n\t\t\tabhorrence!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/035027",
        "Body":  "Hast thou not seen that Allah causeth water to fall from the sky,\n\t\t\tand We produce therewith fruit of divers hues; and among the\n\t\t\thills are streaks white and red, of divers hues, and (others)\n\t\t\traven black;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/035028",
        "Body":  "And of men and beasts and cattle, in like manner, divers hues?\n\t\t\tThe erudite among His bondsmen fear Allah alone. Lo! Allah is\n\t\t\tMighty, Forgiving."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/035029",
        "Body":  "Lo! those who read the Scripture of Allah, and establish worship,\n\t\t\tand spend of that which We have bestowed on them secretly and\n\t\t\topenly, they look forward to imperishable gain,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/035003",
        "Body":  "O mankind! Remember Allah\u0027s grace toward you! Is there any\n\t\t\tcreator other than Allah who provideth for you from the sky and\n\t\t\tthe earth? There is no God save Him. Whither then are ye turned?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/035030",
        "Body":  "That He will pay them their wages and Increase them of His grace.\n\t\t\tLo! He is Forgiving, Responsive."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/035031",
        "Body":  "As for that which We inspire in thee of the Scripture, it is the\n\t\t\tTruth confirming that which was (revealed) before it. Lo! Allah\n\t\t\tis indeed Observer, Seer of his slaves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/035032",
        "Body":  "Then We gave the Scripture as inheritance unto those whom We\n\t\t\telected of our bondmen. But of them are some who wrong themselves\n\t\t\tand of them are some who are lukewarm and of them are some who\n\t\t\toutstrip (others) through good deeds, by Allah\u0027s leave. That is\n\t\t\tthe great favor!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/035033",
        "Body":  "Gardens of Eden! They enter them wearing armlets of gold and\n\t\t\tpearl and their raiment therein is silk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/035034",
        "Body":  "And they say: Praise be to Allah who hath put grief away from us.\n\t\t\tLo! Our Lord is Forgiving, Bountiful,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/035035",
        "Body":  "Who, of His grace, hath installed us in the mansion of eternity,\n\t\t\twhere toil toucheth us not nor can weariness affect us."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/035036",
        "Body":  "But as for those who disbelieve, for them is fire of hell; it\n\t\t\ttaketh not complete effect upon them so that they can die, nor is\n\t\t\tits torment lightened for them. Thus We punish every ingrate."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/035037",
        "Body":  "And they cry for help there, (saying): Our Lord! Release us; we\n\t\t\twill do right, not (the wrong) that we used to do. Did not We\n\t\t\tgrant you a life long enough for who reflected to reflect\n\t\t\ttherein? And the warner came unto you. Now taste (the flavor of\n\t\t\tyour deeds), for evil doers have no helper."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/035038",
        "Body":  "Lo! Allah is the knower of the Unseen of the heavens and the\n\t\t\tearth. Lo! He is Aware of the secret of (men\u0027s) breasts."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/035039",
        "Body":  "He it is who hath made you regents in the earth; so he who\n\t\t\tdisbelieveth, his disbelief be on his own head. Their disbelief\n\t\t\tincreaseth for the disbelievers, in their Lord\u0027s sight, naught\n\t\t\tsave abhorrence. Their disbelief increaseth for the disbelievers\n\t\t\tnaught save loss."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/035004",
        "Body":  "And if they deny thee, (O Muhammad), messengers (of Allah) were\n\t\t\tdenied before thee. Unto Allah all things are brought back."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/035040",
        "Body":  "Say: Have ye seen your partner gods to whom ye pray beside Allah?\n\t\t\tShow me what they created of the earth! Or have they any portion\n\t\t\tin the heavens? Or have We given them a Scripture so that they\n\t\t\tact on clear proof therefrom? Nay, the evil-doers promise one\n\t\t\tanother only to deceive."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/035041",
        "Body":  "Lo! Allah graspeth the heavens and the earth that they deviate\n\t\t\tnot, and if they were to deviate there is not one that could\n\t\t\tgrasp them after Him. Lo! He is ever Clement, Forgiving."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/035042",
        "Body":  "And they swore by Allah, their most binding oath, that if a\n\t\t\twarner came unto them they would be more tractable than any of\n\t\t\tthe nations; yet, when a warner came unto them it aroused in them\n\t\t\tnaught save repugnance,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/035043",
        "Body":  "(Shown in their) behaving arrogantly in the land and plotting\n\t\t\tevil; and the evil plot encloseth but the men who make it. Then,\n\t\t\tcan they expect aught save the treatment of the folk of old? Thou\n\t\t\twilt not find for Allah\u0027s way of treatment any substitute, nor\n\t\t\twilt thou find for Allah\u0027s way of treatment aught of power to\n\t\t\tchange."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/035044",
        "Body":  "Have they not travelled in the land and seen the nature of the\n\t\t\tconsequence for those who were before them, and they were\n\t\t\tmightier than these in power? Allah is not such that aught in the\n\t\t\theavens or in the earth escapeth Him. Lo! He is the Wise, the\n\t\t\tMighty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/035045",
        "Body":  "If Allah took mankind to task by that which they deserve, He\n\t\t\twould not leave a living creature on the surface of the earth;\n\t\t\tbut He reprieveth them unto an appointed term, and when their\n\t\t\tterm cometh--then verily (they will know that) Allah is ever Seer\n\t\t\tof His slaves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/035005",
        "Body":  "O mankind! Lo! the promise of Allah is true. So let not the life\n\t\t\tof the world beguile you, and let not the (avowed) beguiler\n\t\t\tbeguile you with regard to Allah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/035006",
        "Body":  "Lo! the devil is an enemy for you, so treat him as an enemy. He\n\t\t\tonly summoneth his faction to be owners of the Earning Fire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/035007",
        "Body":  "Those who disbelieve, theirs will be an awful doom; and those who\n\t\t\tbelieve and do good works, theirs will be forgiveness and a great\n\t\t\treward."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/035008",
        "Body":  "Is he, the evil of whose deeds is made fair seeming unto him so\n\t\t\tthat he deemeth it good, (other than Satan\u0027s dupe)? Allah verily\n\t\t\tsendeth whom He will astray, and guideth whom He will, so let not\n\t\t\tthy soul expire in sighings for them. Lo! Allah is Aware of what\n\t\t\tthey do!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "35",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/035009",
        "Body":  "And Allah it is who sendeth the winds and they raise a cloud;\n\t\t\tthen We lead it unto a dead land and revive therewith the earth\n\t\t\tafter its death. Such is the Resurrection."
    }
]
