[
  {
    "SurahNumber": "54",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "Most of the commentators see in this verse a reference to\\n\\t\\t\\t\\ta phenomenon said to have been witnessed by several of\\n\\t\\t\\t\\tthe Prophet's contemporaries. As described in a number of\\n\\t\\t\\t\\treports going back to some Companions, the moon appeared\\n\\t\\t\\t\\tone night as if split into two distinct parts. While\\n\\t\\t\\t\\tthere is no reason to doubt the subjective veracity of\\n\\t\\t\\t\\tthese reports, it is possible that what actually happened\\n\\t\\t\\t\\twas an unusual kind of partial lunar eclipse, which\\n\\t\\t\\t\\tproduced an equally unusual optical illusion. But\\n\\t\\t\\t\\twhatever the nature of that phenomenon, it is practically\\n\\t\\t\\t\\tcertain that the above Qur'an-verse does not refer to it\\n\\t\\t\\t\\tbut, rather, to a future event: namely, to what will\\n\\t\\t\\t\\thappen when the Last Hour approaches. (The Qur'an\\n\\t\\t\\t\\tfrequently employs the past tense to denote the future,\\n\\t\\t\\t\\tand particularly so in passages which speak of the coming\\n\\t\\t\\t\\tof the Last Hour and of Resurrection Day; this use of the\\n\\t\\t\\t\\tpast tense is meant to stress the certainty of the\\n\\t\\t\\t\\thappening to which the verb relates.) Thus, Raghib\\n\\t\\t\\t\\tregards it as fully justifiable to interpret the phrase\\n\\t\\t\\t\\tinshaqqa 'l-qamar (\"the moon is split asunder\") as\\n\\t\\t\\t\\tbearing on the cosmic cataclysm - the end of the world as\\n\\t\\t\\t\\twe know it - that will occur before the coming of\\n\\t\\t\\t\\tResurrection Day (see art. shaqq in the  Mufradat). As\\n\\t\\t\\t\\tmentioned by Zamakhshari, this interpretation has the\\n\\t\\t\\t\\tsupport of some of the earlier commentators; and it is,\\n\\t\\t\\t\\tto my mind, particularly convincing in view of the\\n\\t\\t\\t\\tjuxtaposition, in the above Qur'an-verse, of the moon's\\n\\t\\t\\t\\t\"splitting asunder\" and the approach of the Last Hour.\\n\\t\\t\\t\\t(In this connection we must bear in mind the fact that\\n\\t\\t\\t\\tnone of the Qur'anic allusions to the \"nearness\" of the\\n\\t\\t\\t\\tLast Hour and the Day of Resurrection is based on the\\n\\t\\t\\t\\thuman concept of \"time\".)"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "3",
    "NoteID": "2",
    "Body": "Lit., \"they have given [it] the lie\": an allusion to the\\n\\t\\t\\t\\tprediction of the Last Hour and the Day of Resurrection.\\n\\t\\t\\t\\tThe use of the past tense indicates conscious intent or\\n\\t\\t\\t\\tdetermination (cf. surah {2}, note [6]). For my rendering\\n\\t\\t\\t\\tof sihr as \"delusion\", see surah {74}, note [12]."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "3",
    "NoteID": "3",
    "Body": "Lit., \"everything is settled in its [own] being\": i.e.,\\n\\t\\t\\t\\teverything has an intrinsic reality (haqiqah) of its own,\\n\\t\\t\\t\\tand is bound to reveal that reality either in this world\\n\\t\\t\\t\\tor in the next (Baghawi on the authority of Al-Kalbi);\\n\\t\\t\\t\\thence, everything must have a purpose or \"goal\" of its\\n\\t\\t\\t\\town (Zamakhshari). These two - mutually complementary -\\n\\t\\t\\t\\tinterpretations reflect the repeated Qur'anic statement\\n\\t\\t\\t\\tthat everything that exists or happens has a meaning and\\n\\t\\t\\t\\ta purpose: cf.  3:191 ,  10:5  and  38:27  (particularlv,\\n\\t\\t\\t\\tsee note [11] on  10:5 ). In the present context, the\\n\\t\\t\\t\\tphrase relates both to the truth referred to in the\\n\\t\\t\\t\\tpreceeding verses and to its rejection by those who are\\n\\t\\t\\t\\t\"wont to follow [but] their own desires\"."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "4",
    "NoteID": "4",
    "Body": "Lit., \"in which there was a restraint\": i.e., many an\\n\\t\\t\\t\\tindication, in observable nature, of God's creative and\\n\\t\\t\\t\\tre-creative power, as well as many a tiding, through\\n\\t\\t\\t\\tGod-inspired prophets, of a continuation of life after\\n\\t\\t\\t\\tbodily death and, therefore, of the fact that a person's\\n\\t\\t\\t\\tattitudes and doings in this world must have definite\\n\\t\\t\\t\\tconsequences in the life to come."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "6",
    "NoteID": "5",
    "Body": "Lit., \"something not known (nukur)\" - that is, \"something\\n\\t\\t\\t\\tthat human beings cannot know [i.e., visualize] because\\n\\t\\t\\t\\tthey have never met with anything like it\" (Zamakhshari)."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "9",
    "NoteID": "6",
    "Body": "See {11:25-48}, where the story of Noah and the Flood is\\n\\t\\t\\t\\tgiven in greater detail."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "14",
    "NoteID": "7",
    "Body": "I.e., \"under Our protection\". The reference to Noah's ark\\n\\t\\t\\t\\tas \"made of mere planks and nails\" is meant to stress the\\n\\t\\t\\t\\tfrailty of this - as well as any other - human\\n\\t\\t\\t\\tcontrivance."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "15",
    "NoteID": "8",
    "Body": "See {36:41-42} and the corresponding notes [22] and [23].\\n\\t\\t\\t\\tLiterally, the above phrase reads, \"We have left them [or\\n\\t\\t\\t\\t\"such\"] as a sign...\", etc. According to Ibn Kathir, the\\n\\t\\t\\t\\tpronoun ha in taraknaha relates to \"ships in a generic\\n\\t\\t\\t\\tsense\" (jins as-sufun), and quotes in this connection the\\n\\t\\t\\t\\tabove-mentioned passage ({36:41-42}); hence my\\n\\t\\t\\t\\tinterpolation, between brackets, of the words \"floating\\n\\t\\t\\t\\tvessels\". The \"sign\" spoken of here alludes to God's\\n\\t\\t\\t\\thaving endowed man's mind with inventiveness and, thus,\\n\\t\\t\\t\\twith the ability to widen the scope of his life through\\n\\t\\t\\t\\tconscious effort."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "15",
    "NoteID": "9",
    "Body": "Lit., \"And is there any that will...\", etc. The above\\n\\t\\t\\t\\tsentence recurs several times, like a refrain, in this\\n\\t\\t\\t\\tsurah."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "16",
    "NoteID": "10",
    "Body": "Lit., \"how was My [causing] suffering ('adhabi) and My\\n\\t\\t\\t\\twarnings\" - i.e., after the warnings. Although this\\n\\t\\t\\t\\tsentence is phrased in the past tense, its purport is\\n\\t\\t\\t\\tevidently timeless."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "17",
    "NoteID": "11",
    "Body": "The noun dhikr primarily denotes \"remembrance\", or - as\\n\\t\\t\\t\\tdefined by Raghib - the \"presence [of something] in the\\n\\t\\t\\t\\tmind\". Conceptually, and as used in the above context as\\n\\t\\t\\t\\twell as in verses {22}, {32} and {40}, this term\\n\\t\\t\\t\\tcomprises the twin notions of understanding and\\n\\t\\t\\t\\tremembering, i.e., bearing something in mind."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "20",
    "NoteID": "12",
    "Body": "As mentioned in {69:6-8}, this wind - obviously an\\n\\t\\t\\t\\texceptionally violent sandstorm - raged without break for\\n\\t\\t\\t\\tseven nights and eight days. For particulars of the tribe\\n\\t\\t\\t\\tof 'Ad, see second half of note [48] on  7:65 ."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "24",
    "NoteID": "13",
    "Body": "For the general implication of this rhetorical question,\\n\\t\\t\\t\\tsee note [2] on  50:2 . For the story of the tribe of\\n\\t\\t\\t\\tThamud, their prophet Salih, and the incident of the\\n\\t\\t\\t\\tshe-camel, see {7:73-79}, {11:61-68}, {26:141-158}, and\\n\\t\\t\\t\\tthe corresponding notes."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "26",
    "NoteID": "14",
    "Body": "I.e., soon. In classical Arabic, the term ghadan\\n\\t\\t\\t\\t(\"tomorrow\") often applies to a relatively near future,\\n\\t\\t\\t\\tsignifying \"tomorrow\" (in its literal sense) as well as\\n\\t\\t\\t\\t\"in time\" or \"soon\". Hence - as pointed out by all\\n\\t\\t\\t\\tauthorities - it may have been used in the above context\\n\\t\\t\\t\\twith reference to the Last Hour, which in the first verse\\n\\t\\t\\t\\tof this very surah is spoken of as having \"drawn near\"."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "27",
    "NoteID": "15",
    "Body": "For this and other Qur'anic references to the she-camel\\n\\t\\t\\t\\tthat was to be \"let loose as a test\" for the Thamud, see\\n\\t\\t\\t\\tsurah {7}, note [57]. God's \"letting her loose\" is in\\n\\t\\t\\t\\tthis context evidently synonymous with \"allowing her to\\n\\t\\t\\t\\tbecome\" a test."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "28",
    "NoteID": "16",
    "Body": "I.e., between their own herds and the ownerless\\n\\t\\t\\t\\tshe-camel: see  26:155 and the corresponding note [67]."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "29",
    "NoteID": "17",
    "Body": "For the above rendering of 'aqara, see note [61] on\\n\\t\\t\\t\\t 7:77 ."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "31",
    "NoteID": "18",
    "Body": "See note [98] on  11:67 ."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "34",
    "NoteID": "19",
    "Body": "Sc., \"of chastisement\": see   11:82  and the\\n\\t\\t\\t\\tcorresponding note [114]. - The story of Lot and the\\n\\t\\t\\t\\tpeople among whom he dwelt is mentioned in several\\n\\t\\t\\t\\tplaces, most extensively in {11:69-83}."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "37",
    "NoteID": "20",
    "Body": "See {11:77-79} and the corresponding notes."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "37",
    "NoteID": "21",
    "Body": "According to Ibn 'Abbes (as quoted by Razi), the\\n\\t\\t\\t\\texpression tams al-'ayn (\"deprivation of sight\") denotes\\n\\t\\t\\t\\there a \"veiling [of something] from one's consciousness\"\\n\\t\\t\\t\\t(hajb 'an al-idrak). Hence, the phrase tamasna a'yunahum\\n\\t\\t\\t\\tmay be understood to mean that God deprived them, in\\n\\t\\t\\t\\tconsequence of their evil propensities, of all moral\\n\\t\\t\\t\\tinsight (cf.  36:66  and the corresponding notes), and\\n\\t\\t\\t\\tthus made them liable - as the sequence shows - to\\n\\t\\t\\t\\tundergo bitter suffering in this world and in the next."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "42",
    "NoteID": "22",
    "Body": "Lit., \"We gripped them with the grip of an almighty . .\\n\\t\\t\\t\\t.\", etc. The special - and concluding - mention of\\n\\t\\t\\t\\t\"Pharaoh's folk\" is due to the fact that the Egyptians\\n\\t\\t\\t\\twere the most highly developed and powerful nation in the\\n\\t\\t\\t\\tantiquity to which this and the preceding passages refer."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "43",
    "NoteID": "23",
    "Body": "Lit., \"your deniers of the truth\"."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "43",
    "NoteID": "24",
    "Body": "See surah {21}, note [101]."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "44",
    "NoteID": "25",
    "Body": "The reasoning which underlies this thought may be summed\\n\\t\\t\\t\\tup thus: \"We who reject these so-called divine\\n\\t\\t\\t\\trevelations represent a very large body of opinion; and\\n\\t\\t\\t\\tbecause our views are held by so many, they are obviously\\n\\t\\t\\t\\tright and, therefore, bound to triumph in the end.\" In\\n\\t\\t\\t\\tother words, the people characterized as \"deniers of the\\n\\t\\t\\t\\ttruth\" draw their assurance from the mere fact of their\\n\\t\\t\\t\\tbeing representative of the \"majority opinion\" - a\\n\\t\\t\\t\\tself-delusion based on a purely materialistic outlook on\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "45",
    "NoteID": "26",
    "Body": "The fact that the Prophet recited this verse just before\\n\\t\\t\\t\\tthe battle of Badr (see Note [10] on  8:10 ) has caused\\n\\t\\t\\t\\tmost of the commentators to assume that it had been\\n\\t\\t\\t\\trevealed as a specific prophecy of the future victory of\\n\\t\\t\\t\\tthe Muslims over the pagan Quraysh. While this is\\n\\t\\t\\t\\tpossible, I believe, nevertheless, that the above passage\\n\\t\\t\\t\\thas the much wider, timeless meaning explained in the\\n\\t\\t\\t\\tpreceding note. This view finds strong support in the\\n\\t\\t\\t\\tsubsequent verses, which speak of the evil otherworldly\\n\\t\\t\\t\\tconsequences of deliberate sinning, quite apart from the\\n\\t\\t\\t\\tsocial and moral defeat, in this world, of the sinful\\n\\t\\t\\t\\tcommunity as a whole."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "46",
    "NoteID": "27",
    "Body": "Lit., \"the time appointed for them\" (maw'iduhum)."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "47",
    "NoteID": "28",
    "Body": "See verse {24} above."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "48",
    "NoteID": "29",
    "Body": "See note [83] on  33:66  as well as note [30] on  25:34 ."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "50",
    "NoteID": "30",
    "Body": "I.e., there is no time lag and no conceptual difference\\n\\t\\t\\t\\tbetween God's  \"willing\" the creation of a thing and His\\n\\t\\t\\t\\t\"creating\" it, for \"when He wills a thing to be, He but\\n\\t\\t\\t\\tsays unto it, 'Be'- and it is\" ( 2:117 ,  3:47 ,  16:40 ,\\n\\t\\t\\t\\t 19:35 ,  36:82  and  40:68 ). The comparison with the\\n\\t\\t\\t\\t\"twinkling of an eye\" is, of course, merely idiomatic,\\n\\t\\t\\t\\ti.e., based on the human concept of something\\n\\t\\t\\t\\tinstantaneous. In the present context this is - as the\\n\\t\\t\\t\\tsequence shows - an allusion to the rapidity with which\\n\\t\\t\\t\\tGod can, if He so wills, destroy a sinful community."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "52",
    "NoteID": "31",
    "Body": "I.e., the ancient revealed scriptures (az-zubur) had made\\n\\t\\t\\t\\tthe meaning of good and evil absolutely clear to them,\\n\\t\\t\\t\\tbut they wilfully disregarded or even consciously\\n\\t\\t\\t\\trejected that teaching. The above verse implies, firstly,\\n\\t\\t\\t\\tthat the basic ethical teachings of all revealed\\n\\t\\t\\t\\treligions are essentially identical, and, secondly, that\\n\\t\\t\\t\\tGod \"would never destroy a community for [its] wrongdoing\\n\\t\\t\\t\\tso long as its people are still unaware [of the meaning\\n\\t\\t\\t\\tof right and wrong]\" (see · {131-132}\\n\\t\\t\\t\\t 15:4 ,{26:208-209}. and the corresponding notes)."
  }
]
