[
  {
    "SurahNumber": "78",
    "AyahNumber": "2",
    "NoteID": "5889",
    "Body": "Great News: usually understood to mean the News or\\n\\t\\t\\t\\tMessage of the Resurrection or the Hereafter, about which\\n\\t\\t\\t\\tthere are various schools of thought among the Jews and\\n\\t\\t\\t\\tChristians and other nations. There is practically\\n\\t\\t\\t\\tnothing about the Resurrection in the Old Testament, and\\n\\t\\t\\t\\tthe Jewish sect of Sadducees even in the time of Christ\\n\\t\\t\\t\\tdenied the Resurrection altogether. The Pagan ideas of a\\n\\t\\t\\t\\tfuture life-if any-varied from place to place and from\\n\\t\\t\\t\\ttime to time. Even in the early Christian Church, as we\\n\\t\\t\\t\\tlearn from Paul's First Epistle to the Corinthians, there\\n\\t\\t\\t\\twere contentions in that little community (1,\\n\\t\\t\\t\\tCorinthians, i. 11), and some definitely denied the\\n\\t\\t\\t\\tresurrection of the dead (ib., xv. 12). Great News may\\n\\t\\t\\t\\talso be translated Great Message or a Message Supreme as\\n\\t\\t\\t\\tI have translated at xxxviii. 67. In that case it would\\n\\t\\t\\t\\trefer to the Qur-an, or the Message of Revelation, or the\\n\\t\\t\\t\\tMessage of the Holy Prophet, about which there was great\\n\\t\\t\\t\\tcontention in those days. As this Message also lays great\\n\\t\\t\\t\\tstress on the Day of Judgment and the Resurrection, the\\n\\t\\t\\t\\tpractical result by either mode of interpretation amounts\\n\\t\\t\\t\\tto the same."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "6",
    "NoteID": "5890",
    "Body": "See n. 2038 to xvi. 15. Cf. also xiii. 3 and xv. 19. The\\n\\t\\t\\t\\tspacious expanse of the earth may be compared to a\\n\\t\\t\\t\\tcarpet, to which the mountains act as pegs. The Signs of\\n\\t\\t\\t\\tAllah are thus enumerated: the great panorama of outer\\n\\t\\t\\t\\tnature (verses 6-7); the creation of Man in pairs, with\\n\\t\\t\\t\\tthe succession of rest and work fitting in with the\\n\\t\\t\\t\\tsuccession of night and day (verses 8-11); the firmaments\\n\\t\\t\\t\\tabove, with their splendid lights (verses 12-13); and the\\n\\t\\t\\t\\tclouds and rain and abundant harvests, which knit sky and\\n\\t\\t\\t\\tearth and man together (verses 14-16). These point to\\n\\t\\t\\t\\tAllah, and Allah's Message points to the Future Life."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "10",
    "NoteID": "5891",
    "Body": "The darkness of the night is as a covering. Just as a\\n\\t\\t\\t\\tcovering protects us from exposure to cold or heat, so\\n\\t\\t\\t\\tthis covering gives us spiritual respite from the buffets\\n\\t\\t\\t\\tof the material world, and from the tiring activities of\\n\\t\\t\\t\\tour own inner exertions. The rest in sleep (in verse 9)\\n\\t\\t\\t\\tis supplemented by the covering of the night with which\\n\\t\\t\\t\\twe are provided by Allah."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "11",
    "NoteID": "5892",
    "Body": "\"Subsistence\" in English only partly covers the idea of\\n\\t\\t\\t\\tma'ash, which includes every kind of life activity. The\\n\\t\\t\\t\\tDay is specially illuminated, so runs the figure of\\n\\t\\t\\t\\tspeech, in order that these life-activities of all kinds\\n\\t\\t\\t\\tmay be fully exercised."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "12",
    "NoteID": "5893",
    "Body": "See n. 5526 to lxv. 12 and n. 2876 to xxiii. 17, also\\n\\t\\t\\t\\txxxvii. 6 and notes there."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "13",
    "NoteID": "5894",
    "Body": "That is, the sun. Cf. xxv. 61; xxxiii. 46 (where it is\\n\\t\\t\\t\\tused metaphorically for the holy Prophet); and lxxi. 16."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "14",
    "NoteID": "5895",
    "Body": "Note how the evidences of Allah and His beneficence arc\\n\\t\\t\\t\\tset out in four groups. (1) Look to external nature on\\n\\t\\t\\t\\tthe earth around you (verses 6-7); (2) your own nature,\\n\\t\\t\\t\\tphysical, mental and spiritual (verses 8-11); (3) the\\n\\t\\t\\t\\tstarry heavens, and the glory of the sun (verses 12-13);\\n\\t\\t\\t\\tand (4) the interdependence of earth, air, and sky in the\\n\\t\\t\\t\\tcycle of water, clouds, rain, corn and gardens, all\\n\\t\\t\\t\\tserving in their several ways to further the whole plan\\n\\t\\t\\t\\tof the World as it affects us. Can you not then believe\\n\\t\\t\\t\\tthat a Creator who does this will sort out Good and Evil\\n\\t\\t\\t\\ton an appointed Day with real justice and power?"
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "17",
    "NoteID": "5896",
    "Body": "Cf. xxxvii. 21, n. 4047, and xxxvi. 59, n. 4005 (end),\\n\\t\\t\\t\\tThe Day of Judgment is the Day of Sorting Out, as between\\n\\t\\t\\t\\tGood and Evil."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "18",
    "NoteID": "5897",
    "Body": "The angel charged with the sounding of the Trumpet is\\n\\t\\t\\t\\tIsrafil. It will herald Judgment. Cf. 1. 20; also xxxix.\\n\\t\\t\\t\\t68, and n. 4343; and lxix. 13, n. 5648."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "19",
    "NoteID": "5898",
    "Body": "A sign that the present order of things will have ceased\\n\\t\\t\\t\\tto exist, and a new world will have come into being. Such\\n\\t\\t\\t\\ta figure applies to the heavens in this verse and to the\\n\\t\\t\\t\\tearth in the next verse. The mystery of what is beyond\\n\\t\\t\\t\\tthe heavens will have vanished through the doors which\\n\\t\\t\\t\\twill then be opened. The solid mountains, as we suppose\\n\\t\\t\\t\\tthem to be, will have vanished like an unsubstantial\\n\\t\\t\\t\\tmirage."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "21",
    "NoteID": "5899",
    "Body": "Hell, the embodiment of evil, is lying in wait like an\\n\\t\\t\\t\\tambush for every one. We should be on our guard. For the\\n\\t\\t\\t\\ttransgressors, those who have wilfully rebelled against\\n\\t\\t\\t\\tAllah, it will be a definite destination, from which\\n\\t\\t\\t\\tthere is no return, except, it may be, after ages, i.e.,\\n\\t\\t\\t\\tunless Allah so wills: Cf. vi. 128, and n. 951."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "25",
    "NoteID": "5900",
    "Body": "Cf. x. 4, and n. 1390; also xxxviii. 57, and n. 4213."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "26",
    "NoteID": "5901",
    "Body": "Their transgressions go on progressively as they refuse\\n\\t\\t\\t\\tto repent and turn to Allah. The fire of misery begins to\\n\\t\\t\\t\\tblaze forth more and more fiercely, an there is nothing\\n\\t\\t\\t\\tto cool that blaze; their food and drink themselves are\\n\\t\\t\\t\\ttainted with the disorder of contradictory\\n\\t\\t\\t\\telements,-boiling hot drink, with intensely cold, murky,\\n\\t\\t\\t\\tand disgusting fluids. These are fitting punishments for\\n\\t\\t\\t\\ttheir crimes, which are inconsistent with the pure and\\n\\t\\t\\t\\tgentle mould in which Allah had originally cast their\\n\\t\\t\\t\\tnature."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "27",
    "NoteID": "5902",
    "Body": "It was not isolated acts, but a continued course of evil\\n\\t\\t\\t\\tconduct; they repudiated the moral and spiritual\\n\\t\\t\\t\\tresponsibility for their lives; and they impudently\\n\\t\\t\\t\\tcalled Truth itself by false names and disdained Allah's\\n\\t\\t\\t\\tSigns, which were vouchsafed for their instruction. These\\n\\t\\t\\t\\tare not mere impressions; these are hard facts \"preserved\\n\\t\\t\\t\\ton record\", so that every deed can have its due weight in\\n\\t\\t\\t\\tmaking up the account."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "30",
    "NoteID": "5903",
    "Body": "Just as there is a progressive deterioration in the\\n\\t\\t\\t\\tsinner's soul when he surrenders himself to evil, so\\n\\t\\t\\t\\tthere is a progressive increase in the Penalty which he\\n\\t\\t\\t\\tsuffers."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "31",
    "NoteID": "5904",
    "Body": "This is true Salvation. It is not only safety and\\n\\t\\t\\t\\tfelicity, but the attainment of the final Goal, the\\n\\t\\t\\t\\tsupreme Achievement, the Fulfilment of the highest in\\n\\t\\t\\t\\thuman nature, the satisfaction of the true and pure\\n\\t\\t\\t\\tdesires of the heart,-seeing the \"Face of Allah\". See n.\\n\\t\\t\\t\\t4733 to xliv. 57."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "32",
    "NoteID": "5905",
    "Body": "The supreme Achievement, or the Fulfilment of the Heart's\\n\\t\\t\\t\\tDesires, spoken of in the last verse, is now described in\\n\\t\\t\\t\\tthree illustrations (verses 32-34), as further explained\\n\\t\\t\\t\\tby two negatives (verse 35). The first is the enclosed\\n\\t\\t\\t\\tFruit-Garden, represented by the Grape. The Garden in its\\n\\t\\t\\t\\tmany aspects is the most frequent expression adopted for\\n\\t\\t\\t\\tBliss. The most carefully-tended Garden is a\\n\\t\\t\\t\\tFruit-Garden, with walls all round to protect it, and the\\n\\t\\t\\t\\tmost characteristic fruit mentioned here is the luscious\\n\\t\\t\\t\\tGrape."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "33",
    "NoteID": "5906",
    "Body": "The second is maidens of Equal Age."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "34",
    "NoteID": "5907",
    "Body": "The third, the Cup, takes us partly to the Grapes\\n\\t\\t\\t\\tmentioned in verse 32 and partly to the Springs or Rivers\\n\\t\\t\\t\\tmentioned with the Garden in so many places."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "35",
    "NoteID": "5908",
    "Body": "The explanation of the three illustrations is made\\n\\t\\t\\t\\tfurther clear by the two negatives. (1) There will be no\\n\\t\\t\\t\\ttalk of vanities, such as are usually associated on this\\n\\t\\t\\t\\tearth with pleasant Gardens, Companions of equal age, or\\n\\t\\t\\t\\tgenerous Cups nowing in Assemblies. (2) There will be no\\n\\t\\t\\t\\tUntruth or Falsehood. Insincerity or Hollowness there.\\n\\t\\t\\t\\tEverything will be on a plane of absolute Truth and\\n\\t\\t\\t\\tReality."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "36",
    "NoteID": "5909",
    "Body": "The Recompense is not exactly a Reward in proportion to\\n\\t\\t\\t\\tmerit, but is rather a Gift or a Bounty from the\\n\\t\\t\\t\\tMerciful-a Gift most amply sufficient to satisfy all\\n\\t\\t\\t\\tdesire on that plane of purity. \"A Gift (amply)\\n\\t\\t\\t\\tsufficient\" might almost be translated: a liberal and\\n\\t\\t\\t\\tbountiful gift. Cf. the phrase, A 'ta fa ahsaba= he gave\\n\\t\\t\\t\\tgenerously, or bountifully."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "37",
    "NoteID": "5910",
    "Body": "No one has the right or the power to argue with Allah\\n\\t\\t\\t\\tabout the Gifts which He may bestow on His devotees\\n\\t\\t\\t\\tbeyond their deserts, (verse 36 above) or about the\\n\\t\\t\\t\\tPenalty which His justice may inflict for sin or\\n\\t\\t\\t\\twrong-doing. He is high above all Creation. But He is\\n\\t\\t\\t\\talso Most Gracious. Therefore He may permit special\\n\\t\\t\\t\\tDignitaries, of honour in His eyes, to plead for sinners,\\n\\t\\t\\t\\tbut they will only plead in truth and righteousness: see\\n\\t\\t\\t\\tverse 38 below."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "38",
    "NoteID": "5911",
    "Body": "The Spirit: see n. 5677 to lxx. 4. Some Commentators\\n\\t\\t\\t\\tunderstand by \"the Spirit\" the angel Gabriel as he is\\n\\t\\t\\t\\tcharged specially with bringing Messages to human\\n\\t\\t\\t\\tprophets: see xxi. 193, n. 3224."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "38",
    "NoteID": "5912",
    "Body": "See n. 5910 above. No one has the right to speak before\\n\\t\\t\\t\\tthe Judgment-Seat; but certain great Dignitaries may be\\n\\t\\t\\t\\tgiven permission to plead for mercy for sinners, and they\\n\\t\\t\\t\\twill only so plead if the mercy is not negatory of\\n\\t\\t\\t\\tAllah's universal justice."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "39",
    "NoteID": "5913",
    "Body": "Cf. lxix. 1 and n. 5635. Judgment is sure to come, and\\n\\t\\t\\t\\tTruth will then be free from all veils. Why should not\\n\\t\\t\\t\\tman, therefore, now in this life of probation, turn back\\n\\t\\t\\t\\tto Allah, and understand and do His Will?"
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "40",
    "NoteID": "5914",
    "Body": "Is Judgment very near? Yes. There are three stages of\\n\\t\\t\\t\\tJudgment. (1) Many of our sins and wrong-doings find\\n\\t\\t\\t\\ttheir penalty in this very life. It may not be an open or\\n\\t\\t\\t\\tstriking event, but it corrodes the soul and conscience\\n\\t\\t\\t\\tall the time. Let us therefore tum back to Allah in\\n\\t\\t\\t\\trepentance and ask for forgiveness. (2) Where the Penalty\\n\\t\\t\\t\\tis not actually perceived or is not visible in this life,\\n\\t\\t\\t\\tDeath is considered the Lesser Judgment for each\\n\\t\\t\\t\\tindividual soul: see n. 5822 to lxxv. 22. Death may come\\n\\t\\t\\t\\tto anyone at any time, and we must all be ready for it.\\n\\t\\t\\t\\t(3) Then there is the final Judgment, when the whole of\\n\\t\\t\\t\\tthe present order passes away, and there is a New World.\\n\\t\\t\\t\\tTime as we know it will not exist. Fifty thousand years\\n\\t\\t\\t\\tas we reckon now will be but as a Day: lxx. 4. According\\n\\t\\t\\t\\tto those standards even this Final Judgment is quite\\n\\t\\t\\t\\tnear, and we must prepare for it. For it will be too late\\n\\t\\t\\t\\tthen for repentance."
  },
  {
    "SurahNumber": "78",
    "AyahNumber": "40",
    "NoteID": "5915",
    "Body": "The Unbeliever, the Rejecter of Allah, will then find\\n\\t\\t\\t\\thimself in a world of absolute Reality, in which there\\n\\t\\t\\t\\twill be no place for him. He will neither live nor die:\\n\\t\\t\\t\\txx. 74. He will wish that he could be reduced to\\n\\t\\t\\t\\tnothingness, but even that would not be possible."
  }
]
