[
  {
    "SurahNumber": "40",
    "AyahNumber": "1",
    "Text": "Ha M'im."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "2",
    "Text": "The revelation of this Book is from Allah, the Almighty, the\\n\\t\\t\\tAll-Knowledgeable,"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "3",
    "Text": "the forgiver of sins, the Acceptor of repentance, the Stern in\\n\\t\\t\\tpunishment and the Lord of bounty; there is no god except Him, to\\n\\t\\t\\tWhom all shall return."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "4",
    "Text": "None dispute the revelations of Allah but those who disbelieve;\\n\\t\\t\\tso let not their affluent activity in the land deceive you."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "5",
    "Text": "Before them the people of Nuh denied the Message and so did other\\n\\t\\t\\tgroups after them. Every nation plotted against its Prophet,\\n\\t\\t\\tseized him and sought to refute the truth through false\\n\\t\\t\\targuments; but I smote them, and how terrible was My retribution!"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "6",
    "Text": "Thus shall the Word of your Rabb be proved true against the\\n\\t\\t\\tdisbelievers; they are the inmates of hellfire."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "7",
    "Text": "Those angels who bear the Throne of Allah and those who stand\\n\\t\\t\\taround it glorify their Rabb with His praises, believe in Him and\\n\\t\\t\\timplore forgiveness for the believers, saying: \"Our Rabb! You\\n\\t\\t\\tembrace all things with your mercy and knowledge. Forgive those\\n\\t\\t\\twho repent and follow Your Way, and save them from the punishment\\n\\t\\t\\tof the blazing fire."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "8",
    "Text": "O Rabb, admit them to the gardens of Eden which You have promised\\n\\t\\t\\tthem together with all the righteous among their fathers, their\\n\\t\\t\\twives and their descendants. You are the All-Mighty, All-Wise."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "9",
    "Text": "Deliver them from all evil. He whom You will deliver from the\\n\\t\\t\\tpunishment of their sins on that Day will surely earn Your Mercy\\n\\t\\t\\tand that will surely be the highest achievement."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "10",
    "Text": "On the Day of Judgement it will be said to the disbelievers:\\n\\t\\t\\t\"Allah's hatred towards you was far greater - during your worldly\\n\\t\\t\\tlife when you were called to the Faith and you used to refuse -\\n\\t\\t\\tthan your hatred of yourselves.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "11",
    "Text": "They will say: \"Our Rabb! Twice have You made us die and twice\\n\\t\\t\\thave You given us life. We now confess our sins. Is there any way\\n\\t\\t\\tout?\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "12",
    "Text": "They shall be answered: \"You are facing this fate because when\\n\\t\\t\\tyou were asked to believe in Allah, the One and Only, you\\n\\t\\t\\tdisbelieved; but when you were asked to commit shirk (associate\\n\\t\\t\\tother partners with Him), you believed. Today judgement rests\\n\\t\\t\\twith Allah, the Supreme, the Great.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "13",
    "Text": "It is He Who shows you His signs and sends down sustenance from\\n\\t\\t\\tthe heavens for you. Yet, none learns a lesson, from the\\n\\t\\t\\tobservation of these signs, except those who turn to Him."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "14",
    "Text": "So invoke Allah with sincere devotion to Him (worship none but\\n\\t\\t\\tHim) however much the unbelievers may dislike it."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "15",
    "Text": "Possessor of the Highest Rank, the Master of the Throne of\\n\\t\\t\\tAuthority sends down the Spirit by His command on those of His\\n\\t\\t\\tservants whom He chooses, that he (the Prophet who received the\\n\\t\\t\\trevelations) may warn mankind of the Day when they shall meet\\n\\t\\t\\tHim."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "16",
    "Text": "The Day when they all shall come forth from their graves with\\n\\t\\t\\tnothing hidden from Allah. It will be asked: \"Whose is the\\n\\t\\t\\tKingdom today?\" No one shall dare to speak, and Allah Himself\\n\\t\\t\\twill say: \"It is Allah's, the One, the Irresistible."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "17",
    "Text": "Today every soul shall be rewarded for whatever it has earned;\\n\\t\\t\\ttoday there shall be no injustice; surely Allah is swift in\\n\\t\\t\\tsettling accounts.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "18",
    "Text": "O Prophet, warn them of the Day that is drawing near, when the\\n\\t\\t\\thearts will leap up to the throats with grief; when the\\n\\t\\t\\twrongdoers will have neither friend nor intercessor who could be\\n\\t\\t\\tgiven heed to."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "19",
    "Text": "Allah knows the furtive looks and the secret thoughts,"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "20",
    "Text": "and Allah will judge with all fairness. As for those whom the\\n\\t\\t\\tunbelievers invoke besides Him, will not be in a position to\\n\\t\\t\\tjudge at all. Surely it is Allah Alone Who Hears all and Sees\\n\\t\\t\\tall."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "21",
    "Text": "Have they not travelled through the land and seen what was the\\n\\t\\t\\tend of those who have gone before them? They were far greater in\\n\\t\\t\\tpower than these and left great traces in the land: but Allah\\n\\t\\t\\tseized them for their sins and there was none to protect them\\n\\t\\t\\tfrom Allah."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "22",
    "Text": "That was because there came to them their Rasools with clear\\n\\t\\t\\trevelations and they denied them: so Allah seized them. Mighty is\\n\\t\\t\\tHe indeed and stern is His retribution."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "23",
    "Text": "Indeed We sent Musa with Our signs and a clear authority,"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "24",
    "Text": "to Fir'on (Pharaoh) Haman and Qarun (Korah); but they called him\\n\\t\\t\\t'a sorcerer, a liar'."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "25",
    "Text": "Then, when he brought them the truth from Us, they said: \"Kill\\n\\t\\t\\tthe sons of those who share his faith and spare only their\\n\\t\\t\\tfemales.\" But futile were the schemes of the unbelievers."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "26",
    "Text": "Finally Fir'on said: \"Let me kill Musa; and let him invoke his\\n\\t\\t\\tRabb! I fear that he may change your religion or that he may\\n\\t\\t\\tcause mischief to appear in the land.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "27",
    "Text": "Musa said: \"I have indeed taken refuge in my Rabb and your Rabb\\n\\t\\t\\tfrom every arrogant one who does not believes in the Day of\\n\\t\\t\\tReckoning.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "28",
    "Text": "At this, a believer from among the relatives of Fir'on, who had\\n\\t\\t\\tkept his faith hidden, said: \"Will you kill a man merely because\\n\\t\\t\\the says: `My Rabb is Allah, specially when he has brought you\\n\\t\\t\\tclear signs from your Rabb? If he is lying, may his lie be on his\\n\\t\\t\\thead; but if he is speaking the truth, then some of the dreadful\\n\\t\\t\\tthings he is threatening you with may very well fall on you.\\n\\t\\t\\tSurely Allah does not guide the one who is a lying transgressor."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "29",
    "Text": "O my people! You are the rulers and are dominant in the land\\n\\t\\t\\ttoday: but who will help us against the scourge of Allah, should\\n\\t\\t\\tit befall us?\" Fir'on said: \"I am pointing out to you only what I\\n\\t\\t\\tsee and I am guiding you only towards the right way.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "30",
    "Text": "Then the person who was a true believer said: \"O my people! In\\n\\t\\t\\tfact I fear for you the day of disaster like of what befell prior\\n\\t\\t\\tpeople,"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "31",
    "Text": "such as the people of Nuh, `Ad and Thamud and those who came\\n\\t\\t\\tafter them, and Allah does not intend to wrong His servants."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "32",
    "Text": "And O my People! I fear for you the Day of wailing,"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "33",
    "Text": "when you will turn your backs and flee, when there will be none\\n\\t\\t\\tto protect you from Allah. The one to whom Allah lets go astray,\\n\\t\\t\\tshall have none to guide him."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "34",
    "Text": "Do you remember that long time before this, Yusuf came to you\\n\\t\\t\\twith clear signs, but you ever remained in doubt concerning to\\n\\t\\t\\twhat he brought; and when he died you said: 'After him, Allah\\n\\t\\t\\twill never send another Rasool.' Thus Allah confounds the ones\\n\\t\\t\\twho are the doubting transgressors,"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "35",
    "Text": "who dispute the revelations of Allah having no authority\\n\\t\\t\\tvouchsafed to them. Such an attitude is disgusting in the sight\\n\\t\\t\\tof Allah and of the believers. Thus Allah seals up the heart of\\n\\t\\t\\tevery arrogant transgressor.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "36",
    "Text": "After hearing this, Fir'on said: \"O Haman! Build me a high tower\\n\\t\\t\\tthat I may attain the means of access,"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "37",
    "Text": "an access to the heavens, so that I may see the God of Musa, I am\\n\\t\\t\\tconvinced that he is lying.\" Thus Fir'on was seduced by his foul\\n\\t\\t\\tdeeds and he turned away from the Right Way. The schemes of\\n\\t\\t\\tFir'on led him to nothing but destruction."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "38",
    "Text": "The man who was true believer, said: \"O my people! Follow me, I\\n\\t\\t\\tshall guide you to the Right Way."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "39",
    "Text": "O my people! The life of this world is only temporary enjoyment,\\n\\t\\t\\twhile the abode of hereafter is everlasting."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "40",
    "Text": "The one who does evil shall be recompensed to the extent of the\\n\\t\\t\\tevil done; and the one who is a believer and does good deeds,\\n\\t\\t\\twhether man or woman, shall enter the paradise and therein\\n\\t\\t\\treceive sustenance without measure."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "41",
    "Text": "And O my people! How is it that I call you to salvation, while\\n\\t\\t\\tyou call me to the fire?"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "42",
    "Text": "You bid me to deny Allah and worship other gods I know nothing\\n\\t\\t\\tof; while I bid you to worship the All-Mighty, the All-Forgiving."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "43",
    "Text": "No doubt you call me towards those who can be invoked neither in\\n\\t\\t\\tthis world nor in the hereafter. In fact, we all have to return\\n\\t\\t\\tback to Allah and the transgressors are the ones who shall go to\\n\\t\\t\\thell."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "44",
    "Text": "So bear in mind what I have told you, I am entrusting my affairs\\n\\t\\t\\tto Allah, surely Allah is ever watchful over His servants.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "45",
    "Text": "So Allah saved that believer from all those evil plots that the\\n\\t\\t\\tpeople devised against him, and the people of Fir'on were\\n\\t\\t\\tovertaken by a horrible scourge."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "46",
    "Text": "It is the fire of hell before which they are presented morning\\n\\t\\t\\tand evening, and on the Day when the time of their Judgment will\\n\\t\\t\\tcome, it will be commanded: \"Make the people of Fir'on (Pharaoh)\\n\\t\\t\\tto enter the severest punishment.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "47",
    "Text": "Then imagine that time when these people will start arguing with\\n\\t\\t\\teach other in the fire, and the weak followers will say to the\\n\\t\\t\\tarrogant leaders: \"We were your followers: can you now save us\\n\\t\\t\\tfrom some of these flames?\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "48",
    "Text": "The arrogant leaders will reply: \"We are all in it together!\\n\\t\\t\\tAllah has already judged between His servants.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "49",
    "Text": "Also imagine when the dwellers of fire will ask the Keepers of\\n\\t\\t\\thell: \"Pray to your Rabb for relieving our punishment at least\\n\\t\\t\\tfor one day!\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "50",
    "Text": "The Keepers of hell will ask: \"Did there not come to you Rasools\\n\\t\\t\\twith clear revelations?\" \"Yes,\" they will answer. The Keepers of\\n\\t\\t\\thell will say: \"Then pray yourselves.\" But vain shall be the\\n\\t\\t\\tprayer of the disbelievers."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "51",
    "Text": "We surely will help Our Rasools and the believers both in this\\n\\t\\t\\tworld's life and on the Day when the witnesses will take a stand\\n\\t\\t\\tto testify."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "52",
    "Text": "On that Day, no excuses shall avail the wrongdoers. The curse\\n\\t\\t\\tshall be their lot and the worst place will be their home."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "53",
    "Text": "As you can see We gave Musa the Book of guidance and We made the\\n\\t\\t\\tchildren of Israel to inherit that Book,"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "54",
    "Text": "which was a guide and an admonition to the people of\\n\\t\\t\\tunderstanding."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "55",
    "Text": "So be patient, the promise of Allah is true. Implore forgiveness\\n\\t\\t\\tfor your sins and celebrate the praises of your Rabb evening and\\n\\t\\t\\tmorning."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "56",
    "Text": "Those who dispute the revelations of Allah with no authority\\n\\t\\t\\tbestowed on them; they nurture in their hearts arrogant ambitions\\n\\t\\t\\twhich they shall never attain. Therefore, seek refuge with Allah;\\n\\t\\t\\tIt is He Who hears all and sees all."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "57",
    "Text": "Certainly the creation of the heavens and the earth is a greater\\n\\t\\t\\ttask than the creation of men; yet most people do not understand."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "58",
    "Text": "The blind and those who can see are not alike, nor are the\\n\\t\\t\\tbelievers who do good deeds equal to the wicked; yet you seldom\\n\\t\\t\\tthink."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "59",
    "Text": "The hour of Doom is sure to come, there is no doubt about it; yet\\n\\t\\t\\tmost people do not believe it."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "60",
    "Text": "And your Rabb says: \"Call on Me, I will answer your prayers.\\n\\t\\t\\tSurely those who are too arrogant to worship Me shall soon enter\\n\\t\\t\\thell in humiliation.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "61",
    "Text": "It is Allah Who has made for you the night to rest in and the day\\n\\t\\t\\tto see your way around. Surely Allah is bountiful to mankind, yet\\n\\t\\t\\tmost of the people are not thankful."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "62",
    "Text": "Such is Allah your Rabb, the Creator of all things. There is no\\n\\t\\t\\tgod but Him. None has the right to be worshipped except Him, so\\n\\t\\t\\thow are you being deluded?"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "63",
    "Text": "Thus were deluded those who denied the revelations of Allah."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "64",
    "Text": "It is Allah Who has made the earth a resting place for you, and\\n\\t\\t\\tthe sky a canopy. He has molded your bodies and molded them well,\\n\\t\\t\\tand has provided you with good things. Such is Allah your Rabb.\\n\\t\\t\\tSo glory be to Allah, the Rabb of the worlds."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "65",
    "Text": "He is the Ever-Living. There is no god but Him. Therefore call\\n\\t\\t\\tupon Him with your sincere devotion. Praise be to Allah, the Rabb\\n\\t\\t\\tof the worlds."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "66",
    "Text": "O Prophet, tell them: \"I have been forbidden to invoke those whom\\n\\t\\t\\tyou invoke besides Allah. How can I do this when clear\\n\\t\\t\\trevelations have come to me from my Rabb, and I have been\\n\\t\\t\\tcommanded to submit myself to the Rabb of the worlds.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "67",
    "Text": "It is He Who has created you from dust, then from a sperm, then\\n\\t\\t\\tfrom a leechlike mass, then He delivers you from the womb of your\\n\\t\\t\\tmother as a child, then He makes you grow to reach the age of\\n\\t\\t\\tfull strength, then He makes you grow to reach an old age -\\n\\t\\t\\tthough some of you die earlier - so that you may complete your\\n\\t\\t\\tappointed term and grow in wisdom."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "68",
    "Text": "It is He Who gives you life and causes you to die. It is He Who\\n\\t\\t\\twhen He decides to do something, needs only to say: \"Be,\" and it\\n\\t\\t\\tis."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "69",
    "Text": "Do you not see how those who argue about the revelations of Allah\\n\\t\\t\\tturn away from the Right Way?"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "70",
    "Text": "Those who have denied the Book and the Message which We have sent\\n\\t\\t\\tthrough Our Rasools shall soon come to know the truth when they\\n\\t\\t\\twill be cast into the fire of hell:"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "71",
    "Text": "when, with yokes and chains around their necks, they shall be\\n\\t\\t\\tdragged"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "72",
    "Text": "through scalding fluid and burned in the fire of hell."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "73",
    "Text": "Then they shall be asked: \"Where are those gods whom you invoked\\n\\t\\t\\tin worship"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "74",
    "Text": "besides Allah?\" They will answer: \"They have forsaken us, now we\\n\\t\\t\\thave come to know that those to whom we used to invoke, were in\\n\\t\\t\\tfact nothing.\" Thus Allah confounds the disbelievers."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "75",
    "Text": "It will be said: \"You have met this fate because during your life\\n\\t\\t\\ton earth, you took delight in things other than the truth and you\\n\\t\\t\\tled a wanton life."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "76",
    "Text": "Now enter the gates of hell to live therein forever. What an evil\\n\\t\\t\\tabode will be for the arrogant!\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "77",
    "Text": "So be patient, O Prophet, Allah's promise is true. Whether We let\\n\\t\\t\\tyou witness the evil consequences with which they are being\\n\\t\\t\\tthreatened, or We recall you before We smite them, in any case,\\n\\t\\t\\tthey shall all return to Us."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "78",
    "Text": "O Prophet, We have sent many Rasools before you; of them there\\n\\t\\t\\tare some whose stories We have relayed to you and others whose\\n\\t\\t\\tstories We have not relayed to you. It was not possible for any\\n\\t\\t\\tof those Rasools to bring a sign except by the leave of Allah.\\n\\t\\t\\tThen when the command of Allah came, the matter was decided with\\n\\t\\t\\tjustice, and it was the wrongdoers who suffered the loss."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "79",
    "Text": "It is Allah Who has provided you with cattle, that you may use\\n\\t\\t\\tsome for riding and some for food;"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "80",
    "Text": "and there are also other advantages in them for you; they take\\n\\t\\t\\tyou where you wish to go carrying you on their backs as ships\\n\\t\\t\\tcarry you by the sea."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "81",
    "Text": "Thus, He shows you His signs; then, which signs of Allah you will\\n\\t\\t\\tdeny?"
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "82",
    "Text": "Have they never travelled through the earth and seen what was the\\n\\t\\t\\tend of those who have gone before them? They were more in number\\n\\t\\t\\tand superior in strength than these and they have left behind\\n\\t\\t\\tgreat traces of their power in the land; yet all that they did\\n\\t\\t\\twas of no avail to them."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "83",
    "Text": "When their Rasools came to them with clear revelations, they\\n\\t\\t\\tproudly boasted about their own knowledge; but the very\\n\\t\\t\\tforewarned scourge at which they mocked, hemmed them in."
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "84",
    "Text": "When they saw Our scourge, they cried out: \"We believe in Allah,\\n\\t\\t\\tthe One and Only, and we reject all those gods whom we used to\\n\\t\\t\\tassociate with Him.\""
  },
  {
    "SurahNumber": "40",
    "AyahNumber": "85",
    "Text": "But after seeing Our scourge, their professing the faith (Islam)\\n\\t\\t\\twas of no use to them; such was the practice of Allah in dealing\\n\\t\\t\\twith His servants in the past, and thus the disbelievers were\\n\\t\\t\\tlost."
  }
]
