[
  {
    "SurahNumber": "27",
    "AyahNumber": "1",
    "NoteID": "3240",
    "Body": "See n. 3137 to xxvi. 1."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "2",
    "NoteID": "3241",
    "Body": "Revelation is here presented in three aspects: (1) it\\n\\t\\t\\t\\texplains things, the attributes of Allah, our own\\n\\t\\t\\t\\tposition, and the world around; (2) it directs us to\\n\\t\\t\\t\\tright conduct and keeps us from evil; and (3) to those\\n\\t\\t\\t\\twho have Faith and accept its guidance, it gives the good\\n\\t\\t\\t\\tnews of forgiveness, purification, and the achievement of\\n\\t\\t\\t\\tsalvation."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "4",
    "NoteID": "3242",
    "Body": "Those who reject Allah and follow Evil have a good\\n\\t\\t\\t\\tconceit of themselves. Their deeds are pleasing to no one\\n\\t\\t\\t\\telse. As they have rejected Allah's guidance, they are\\n\\t\\t\\t\\tallowed to hug their own self-conceit, and given further\\n\\t\\t\\t\\trespite for repentance. But they follow their own whims\\n\\t\\t\\t\\tand wander about in distraction, as they have no\\n\\t\\t\\t\\tstandards such as guide the godly."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "5",
    "NoteID": "3243",
    "Body": "The account will then be made up, and they will be found\\n\\t\\t\\t\\tto be terribly in loss. They will be the worst in loss,\\n\\t\\t\\t\\tfor all their self-complacency."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "7",
    "NoteID": "3244",
    "Body": "Cf. xx. 9-24. Both there and here there is a reference to\\n\\t\\t\\t\\tthe dawn of Revelation in the heart of Moses. The points\\n\\t\\t\\t\\tthere emphasised will be found in the notes to that\\n\\t\\t\\t\\tpassage. Here the emphasis is on the wonderful nature of\\n\\t\\t\\t\\tthe Fire and the wonderful way in which Moses was\\n\\t\\t\\t\\ttransformed at the touch of the Light. He was travelling\\n\\t\\t\\t\\tin the Sinai desert with his family. Seeking ordinary\\n\\t\\t\\t\\tlight, he came upon a Light which took him to the highest\\n\\t\\t\\t\\tsigns of Allah. No doubt all his inner history had\\n\\t\\t\\t\\tprepared him for his great destiny. It is the inner\\n\\t\\t\\t\\thistory that matters, and not the place or position of a\\n\\t\\t\\t\\tman in the eyes of his ordinary fellows."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "8",
    "NoteID": "3245",
    "Body": "Those: in the original the pronoun is in the singular,\\n\\t\\t\\t\\t\"man\", which is often used with a plural meaning."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "10",
    "NoteID": "3246",
    "Body": "Moses was now transported into an entirely new world.\\n\\t\\t\\t\\tWhat he had taken to be an ordinary fire was a gleam of\\n\\t\\t\\t\\tthe heavenly light. His own rod or staff was no longer\\n\\t\\t\\t\\tthe dead piece of wood that had hitherto supported him.\\n\\t\\t\\t\\tIt became instinct with life, a life that moved, and had\\n\\t\\t\\t\\tthe power of offence and defence in it, as all living\\n\\t\\t\\t\\tGood must have in its fight with Evil. His own\\n\\t\\t\\t\\ttransformation is described in the next note."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "10",
    "NoteID": "3247",
    "Body": "In this great, new, wonderful world, that was opening out\\n\\t\\t\\t\\tto Moses, he had to get his vision adjusted to his new\\n\\t\\t\\t\\tsurroundings, as an ordinary man has to adjust his sight\\n\\t\\t\\t\\tbefore he can see in any very strong light that is new to\\n\\t\\t\\t\\thim. The staff which had become alive as a snake\\n\\t\\t\\t\\tfrightened him: yet it was to be his own instrument of\\n\\t\\t\\t\\twork in his new mission. All fear was to be cast out of\\n\\t\\t\\t\\this mind, as befitted a man chosen by Allah."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "11",
    "NoteID": "3248",
    "Body": "His slaying the Egyptian (n. 3146 to xxvi. 14), however\\n\\t\\t\\t\\tdefensible from certain aspects, was yet something from\\n\\t\\t\\t\\this past that had to be washed off, and Allah,\\n\\t\\t\\t\\tOft-Forgiving, Most Merciful, did it out of His abounding\\n\\t\\t\\t\\tGrace. Nay, more; he was given a pure, Radiant Hand, as a\\n\\t\\t\\t\\tSign from Allah, as stated in the next verse."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "12",
    "NoteID": "3249",
    "Body": "Cf. xx. 22. There the expression is: \"Draw thy hand close\\n\\t\\t\\t\\tto thy side.\" As far as the physical act is concerned,\\n\\t\\t\\t\\tthe expressions there and here mean the same thing. Moses\\n\\t\\t\\t\\thad a loose-fitting robe. If he put his hand within the\\n\\t\\t\\t\\tfolds of the robe, it would go to his bosom on the side\\n\\t\\t\\t\\tof his body opposite to that from which his hand came;\\n\\t\\t\\t\\ti.e., if it was his right hand it would go to the left\\n\\t\\t\\t\\tside of his bosom. The hand comes out white and radiant,\\n\\t\\t\\t\\twithout a stain. Ordinarily if the skin becomes white it\\n\\t\\t\\t\\tis a sign of disease or leprosy. Here it was the\\n\\t\\t\\t\\topposite. It was a sign of radiance and glory from the\\n\\t\\t\\t\\thigher Light."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "12",
    "NoteID": "3250",
    "Body": "The nine Signs: see n. 1091 to vii. 133."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "13",
    "NoteID": "3251",
    "Body": "The Signs should have clearly opened the eyes of any\\n\\t\\t\\t\\tpersons who honestly examined them and thought about\\n\\t\\t\\t\\tthem. Those who rejected them were perverse and were\\n\\t\\t\\t\\tgoing against their own light and inner conviction. That\\n\\t\\t\\t\\twas the aggravating feature of their sin."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "15",
    "NoteID": "3252",
    "Body": "Cf. xxi. 78-82. \"Knowledge\" means such knowledge as leads\\n\\t\\t\\t\\tup to the higher things in life, the Wisdom that was\\n\\t\\t\\t\\tshown in their decisions and judgments, and the\\n\\t\\t\\t\\tunderstanding that enabled them to fulfil their mission\\n\\t\\t\\t\\tin life. They were both just men and prophets of Allah.\\n\\t\\t\\t\\tThe Bible, as we have it, is inconsistent: on the one\\n\\t\\t\\t\\thand it calls David \"a man after God's own heart\" (I\\n\\t\\t\\t\\tSamuel, xiii. 14, and Acts xiii. 22); and the Christians\\n\\t\\t\\t\\tacclaim Christ as a son of David; but on the other hand,\\n\\t\\t\\t\\thorrible crimes are ascribed to him, which, if he had\\n\\t\\t\\t\\tcommitted them, would make him a monster of cruelty and\\n\\t\\t\\t\\tinjustice. About Solomon, too, while he is described as a\\n\\t\\t\\t\\tglorious king, there are stories of his lapses into sin\\n\\t\\t\\t\\tand idolatry. The Muslim teaching considers them both to\\n\\t\\t\\t\\tbe men of piety and wisdom, and high in spiritual\\n\\t\\t\\t\\tknowledge."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "15",
    "NoteID": "3253",
    "Body": "They ascribed, as was proper, their knowledge, wisdom,\\n\\t\\t\\t\\tand power to the only true Source of all good, Allah."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "16",
    "NoteID": "3254",
    "Body": "The point is that Solomon not only inherited his father's\\n\\t\\t\\t\\tkingdom but his spiritual insight and the prophetic\\n\\t\\t\\t\\toffice, which do not necessarily go from father to son."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "16",
    "NoteID": "3255",
    "Body": "Speech of Birds. The spoken word in human speech is\\n\\t\\t\\t\\tdifferent from the means of communication which birds and\\n\\t\\t\\t\\tanimals have between each other. But no man can doubt\\n\\t\\t\\t\\tthat they have means of communication with each other, if\\n\\t\\t\\t\\the only observes the orderly flight of migratory birds or\\n\\t\\t\\t\\tthe regulated behaviour of ants, bees, and other\\n\\t\\t\\t\\tcreatures who live in communities. The wisdom of Solomon\\n\\t\\t\\t\\tconsisted in understanding these things-in the animal\\n\\t\\t\\t\\tworld and in the lower fringes of human intelligence."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "16",
    "NoteID": "3256",
    "Body": "\"Everything\": Solomon was a king of power and authority;\\n\\t\\t\\t\\toutside his kingdom he had influence among many\\n\\t\\t\\t\\tneighbouring peoples; he had knowledge of birds, and\\n\\t\\t\\t\\tbeasts and plants; he was just and wise, and understood\\n\\t\\t\\t\\tmen; and above all, he had spiritual insight, which\\n\\t\\t\\t\\tbrought him near to Allah. Thus he had something of all\\n\\t\\t\\t\\tkinds of desirable gifts. And with true gratitude he\\n\\t\\t\\t\\treferred them to Allah, the Giver of all gifts."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "17",
    "NoteID": "3257",
    "Body": "Besides the literal meaning, there are two symbolical\\n\\t\\t\\t\\tmeanings. (1) All his subjects of varying grades of\\n\\t\\t\\t\\tintelligence, taste, and civilization, were kept in due\\n\\t\\t\\t\\torder and cooperation, by his discipline, justice, and\\n\\t\\t\\t\\tgood government. (2) The gifts of various kinds, which he\\n\\t\\t\\t\\tpossessed (see last note), he used in proper order and\\n\\t\\t\\t\\tcoordination, as if they were a well disciplined army,\\n\\t\\t\\t\\tthus getting the best possible results from them."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "18",
    "NoteID": "3258",
    "Body": "This verse and the next, read together, suggest the\\n\\t\\t\\t\\tsymbolical meaning as predominant. The ant, to outward\\n\\t\\t\\t\\tappearance, is a very small and humble creature. In the\\n\\t\\t\\t\\tgreat pomp and circumstances of the world, she (generic\\n\\t\\t\\t\\tfeminine in Arabic) may be neglected or even trampled on\\n\\t\\t\\t\\tby a people who mean her no harm. Yet, by her wisdom, she\\n\\t\\t\\t\\tcarries on her own life within her own sphere\\n\\t\\t\\t\\t(\"habitations\") unmolested, and makes a useful\\n\\t\\t\\t\\tcontribution to the economy of the world. So there is\\n\\t\\t\\t\\troom for the humblest people in the spiritual world."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "19",
    "NoteID": "3259",
    "Body": "The counterpart to the position of the humble ant is the\\n\\t\\t\\t\\tposition of a great king like Solomon. He prays that his\\n\\t\\t\\t\\tpower and wisdom and all other gifts may be used for\\n\\t\\t\\t\\trighteousness and for the benefit of all around him. The\\n\\t\\t\\t\\tant being in his thoughts, we may suppose that he means\\n\\t\\t\\t\\tparticularly in his prayer that he may not even\\n\\t\\t\\t\\tunwittingly tread on humble beings in his preoccupations\\n\\t\\t\\t\\twith the great things of the world."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "19",
    "NoteID": "3260",
    "Body": "The righteousness which pleases the world is often very\\n\\t\\t\\t\\tdifferent from the righteousness which pleases Allah.\\n\\t\\t\\t\\tSolomon prays that he may always take Allah's Will as his\\n\\t\\t\\t\\tstandard, rather than the standards of men."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "19",
    "NoteID": "3261",
    "Body": "In the Kingdom of Allah, righteousness is the badge of\\n\\t\\t\\t\\tcitizenship. And although there are great and noble\\n\\t\\t\\t\\tgrades (see n. 586 to iv. 69), the base of that\\n\\t\\t\\t\\tcitizenship is the universal brotherhood of\\n\\t\\t\\t\\trighteousness. The greatest in that Kingdom are glad and\\n\\t\\t\\t\\tproud to pray for that essential badge."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "20",
    "NoteID": "3262",
    "Body": "Solomon was no idle or easy-going king. He kept all his\\n\\t\\t\\t\\torganisation strictly up to the mark, both his armies\\n\\t\\t\\t\\tliterally and his forces (metaphorically). His most\\n\\t\\t\\t\\tmobile arm was the Birds, who were light on the wing and\\n\\t\\t\\t\\tflew and saw everything like efficient scouts. One day he\\n\\t\\t\\t\\tmissed the Hoopoe in his muster. The Hoopoe is a light,\\n\\t\\t\\t\\tgraceful creature, with elegant plumage of many colours,\\n\\t\\t\\t\\tand a beautiful yellow crest on his head, which entities\\n\\t\\t\\t\\thim to be called a royal bird."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "22",
    "NoteID": "3263",
    "Body": "Saba may reasonably be identified with the Biblical Sheba\\n\\t\\t\\t\\t(I Kings x. 1-10). It is further referred to in the Sura\\n\\t\\t\\t\\tcalled after its name: xxxiv. 15-20. It was a city in\\n\\t\\t\\t\\tYemen, said to have been three days' journey (say 50\\n\\t\\t\\t\\tmiles) from the city of San'a. A recent German explorer,\\n\\t\\t\\t\\tDr. Hans Helfritz, claims to have located it in what is\\n\\t\\t\\t\\tnow Hadhramaut territory. The famous dam of Maarib made\\n\\t\\t\\t\\tthe country very prosperous, and enabled it to attain a\\n\\t\\t\\t\\thigh degree of civilization (\"provided with every\\n\\t\\t\\t\\trequisite\" in the next verse). The Queen of Sheba\\n\\t\\t\\t\\ttherefore rightly held up her head high until she beheld\\n\\t\\t\\t\\tthe glories of Solomon."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "23",
    "NoteID": "3264",
    "Body": "The Queen of Sheba (by name Bilqis in Arabian tradition)\\n\\t\\t\\t\\tcame apparently from Yemen, but she had affinities with\\n\\t\\t\\t\\tAbyssinia and possibly ruled over Abyssinia also. The\\n\\t\\t\\t\\tHabasha tribe (after whom Abyssinia was named) came from\\n\\t\\t\\t\\tYemen. Between the southern coast of Yemen and the\\n\\t\\t\\t\\tnorth-eastern coast of Abyssinia there are only the\\n\\t\\t\\t\\tStraits of Bab-al-Mandab, barely twenty miles across. In\\n\\t\\t\\t\\tthe 10th or llth century B.C. there were frequent\\n\\t\\t\\t\\tinvasions of Abyssinia from Arabia, and Solomon's reign\\n\\t\\t\\t\\tof 40 years is usually synchronised with B.C. 992 to 952.\\n\\t\\t\\t\\tThe Sabaean and Himyarite alphabets in which we find the\\n\\t\\t\\t\\tsouth Arabian pre-Islamic inscriptions, passed into\\n\\t\\t\\t\\tEthiopic, the language of Abyssinia. The Abyssinians\\n\\t\\t\\t\\tpossess a traditional history called \"The Book of the\\n\\t\\t\\t\\tGlory of Kings\" (Kebra Nagast), which has been translated\\n\\t\\t\\t\\tfrom Ethiopic into English by Sir E.A. Wallis Budge\\n\\t\\t\\t\\t(Oxford, 1932). It gives an account of the Queen of Sheba\\n\\t\\t\\t\\tand her only son Menyelek I, as founders of the\\n\\t\\t\\t\\tAbyssinian dynasty."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "23",
    "NoteID": "3265",
    "Body": "Provided with every requisite: I take this to refer not\\n\\t\\t\\t\\tonly to the abundance of spices and gems and gold in her\\n\\t\\t\\t\\tcountry, but to sciences and arts, as well."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "24",
    "NoteID": "3266",
    "Body": "The ancient religion of the people of Saba (the Himyar or\\n\\t\\t\\t\\tSabaeans) consisted in the worship of the heavenly\\n\\t\\t\\t\\tbodies, the sun, the planets, and the stars. Possibly the\\n\\t\\t\\t\\tcult was connected with that of Chaldaea, the home-land\\n\\t\\t\\t\\tof Abraham: see vi. 75-79 and notes thereon. Yemen had\\n\\t\\t\\t\\teasy access to Mesopotamia and the Persian Gulf by way of\\n\\t\\t\\t\\tthe sea, as well as with Abyssinia. That accounts for the\\n\\t\\t\\t\\tChristians of Najran and the Jewish dynasty of kings\\n\\t\\t\\t\\t(e.g. Zu-Nuwas, d. 525 A.D.) who persecuted them in the\\n\\t\\t\\t\\tcentury before Islam,-also for the Christian Abyssinian\\n\\t\\t\\t\\tGovernor Abraha and his discomfiture in the year of the\\n\\t\\t\\t\\tProphet's birth (S.cv.), say 570 A.D. Jewish-Christian\\n\\t\\t\\t\\tinfluences were powerful in Arabia in the sixth century\\n\\t\\t\\t\\tof the Christian era. The religion of these Sabaeans\\n\\t\\t\\t\\t(written in Arabic with a Sin) should not be confounded\\n\\t\\t\\t\\twith that of the Sabians (with a Sad), as to whom see n.\\n\\t\\t\\t\\t76 to ii. 62."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "25",
    "NoteID": "3267",
    "Body": "The false worship of the Sabaeans is here exposed in\\n\\t\\t\\t\\tthree ways: (1) that they were self-satisfied with their\\n\\t\\t\\t\\town human achievements, instead of looking up to Allah;\\n\\t\\t\\t\\tand (2) that the light of the heavenly bodies which they\\n\\t\\t\\t\\tworshipped was only dependent on the true Light of Allah,\\n\\t\\t\\t\\twhich extends over heaven and earth; the Creator should\\n\\t\\t\\t\\tbe worshipped rather than His Creation; and (3) Allah\\n\\t\\t\\t\\tknows the hidden secrets of men's minds as well as the\\n\\t\\t\\t\\tobjects which they openly profess: are false worshippers\\n\\t\\t\\t\\treally only worshipping their own selves, or the \"sins\\n\\t\\t\\t\\tthey have a mind to\" and are therefore afraid to go to\\n\\t\\t\\t\\tAllah, Who knows all?"
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "26",
    "NoteID": "3268",
    "Body": "The messenger (Hoopoe) is a pious bird, as befits a\\n\\t\\t\\t\\tmessenger of Solomon. After mentioning the false worship\\n\\t\\t\\t\\tof the Sabaeans, he pronounces the Creed of Unity, and\\n\\t\\t\\t\\temphasises Allah's attribute as Lord of the Great Throne,\\n\\t\\t\\t\\tin order to make it clear that whatever may be the\\n\\t\\t\\t\\tmagnificence of a human throne such as he has described\\n\\t\\t\\t\\t(in verse 23), he is not in any way misled from his\\n\\t\\t\\t\\tloyalty to Solomon, the exponent of the true Religion of\\n\\t\\t\\t\\tUnity."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "27",
    "NoteID": "3269",
    "Body": "Solomon does not doubt his messenger's plea that he has\\n\\t\\t\\t\\tscouted a new country, but wants to test whether he has\\n\\t\\t\\t\\tloosened the rein of his imagination in describing its\\n\\t\\t\\t\\tsplendours or its worship."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "30",
    "NoteID": "3270",
    "Body": "Solomon expressly begins his letter with the formula of\\n\\t\\t\\t\\tthe true and universal Religion of Unity, and he invites\\n\\t\\t\\t\\tto the true Faith the new people with whom he establishes\\n\\t\\t\\t\\thonourable relations, not for worldly conquest but for\\n\\t\\t\\t\\tthe spreading of the Light of Allah."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "34",
    "NoteID": "3271",
    "Body": "The character of Queen Bilqis, as disclosed here, is that\\n\\t\\t\\t\\tof a ruler enjoying great wealth and dignity, and the\\n\\t\\t\\t\\tfull confidence of her subjects. She does nothing without\\n\\t\\t\\t\\tconsulting her Council, and her Council are ready to\\n\\t\\t\\t\\tcarry out her commands in all things. Her people are\\n\\t\\t\\t\\tmanly, loyal, and contented, and ready to take the field\\n\\t\\t\\t\\tagainst any enemy of their country. But their queen is\\n\\t\\t\\t\\tprudent in policy, and is not willing to embroil her\\n\\t\\t\\t\\tcountry in war. She has the discrimination to see that\\n\\t\\t\\t\\tSolomon is not like ordinary kings who conquer by\\n\\t\\t\\t\\tviolence. Perhaps in her heart she has a ray of the\\n\\t\\t\\t\\tdivine light already, though her people are yet Pagans.\\n\\t\\t\\t\\tShe wishes to carry her people with her in whatever she\\n\\t\\t\\t\\tdoes, because she is as loyal to them as they are to her.\\n\\t\\t\\t\\tAn exchange of presents would probably establish better\\n\\t\\t\\t\\trelations between the two kingdoms. And perhaps she\\n\\t\\t\\t\\tanticipates some spiritual understanding also, a hope\\n\\t\\t\\t\\twhich was afterwards realised. In Bilqis we have a\\n\\t\\t\\t\\tpicture of womanhood, gentle, prudent, and able to tame\\n\\t\\t\\t\\tthe wider passions of her subjects."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "36",
    "NoteID": "3272",
    "Body": "Poor Bilqis! she thought she had arranged with womanly\\n\\t\\t\\t\\ttact to conciliate Solomon, and at the same time pacify\\n\\t\\t\\t\\ther warlike subjects! But the effect of the embassy with\\n\\t\\t\\t\\tpresents was the very opposite. Solomon took it as an\\n\\t\\t\\t\\tinsult that she should send her presents instead of her\\n\\t\\t\\t\\tsubmission to the true Religion! He flung back the\\n\\t\\t\\t\\tpresents at her, as much as to say, \"Let these baubles\\n\\t\\t\\t\\tdelight your own hearts! Allah has blessed me with plenty\\n\\t\\t\\t\\tof worldly goods, and something infinitely better, viz.;\\n\\t\\t\\t\\tHis Light and Guidance! Why do you say nothing about\\n\\t\\t\\t\\tthat?\""
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "38",
    "NoteID": "3273",
    "Body": "The throne is symbolical of power and dignity. So far her\\n\\t\\t\\t\\tthrone was based on material wealth: Solomon is going to\\n\\t\\t\\t\\talter it to a basis of Faith and the Religion of Unity."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "39",
    "NoteID": "3274",
    "Body": "Ifrit: a large, powerful jinn."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "40",
    "NoteID": "3275",
    "Body": "Solomon was thankful to Allah that he had men endowed\\n\\t\\t\\t\\twith such power, and he had the throne of Bilqis\\n\\t\\t\\t\\ttransported to his Court and transformed as he desired,\\n\\t\\t\\t\\twithout Bilqis even knowing it."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "40",
    "NoteID": "3276",
    "Body": "If Solomon had been ungrateful to Allah, i.e., if he had\\n\\t\\t\\t\\tworked for his own selfish or worldly ends, he could have\\n\\t\\t\\t\\tused the brute strength of 'Ifrit to add to his worldly\\n\\t\\t\\t\\tstrength and glory. Instead of it he uses the higher\\n\\t\\t\\t\\tmagic of the Book,-Of the Spirit-to transform the throne\\n\\t\\t\\t\\tof Bilqis for her highest good, which means also the\\n\\t\\t\\t\\thighest good of her subjects, by the divine Light. He had\\n\\t\\t\\t\\tthe two alternatives, and he chooses the better, and he\\n\\t\\t\\t\\tthus shows his gratitude to Allah for the Grace He had\\n\\t\\t\\t\\tgiven him."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "40",
    "NoteID": "3277",
    "Body": "Man's gratitude to Allah is not a thing that benefits\\n\\t\\t\\t\\tAllah, for Allah is high above all needs: it benefits a\\n\\t\\t\\t\\tman's own soul and gives him higher rank in the life to\\n\\t\\t\\t\\tcome. Per contra, man's ingratitude will not detract from\\n\\t\\t\\t\\tAllah's Glory and Honour or the value of Allah's generous\\n\\t\\t\\t\\tgifts to man: for Allah is supreme in honour, glory, and\\n\\t\\t\\t\\tgenerosity. Karim in Arabic involves all three\\n\\t\\t\\t\\tsignifications."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "41",
    "NoteID": "3278",
    "Body": "The throne having been disguised, it will be a test to\\n\\t\\t\\t\\tsee whether Bilqis recognises it as her own or not."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "42",
    "NoteID": "3279",
    "Body": "Bilqis stands the test. She knows it was her throne, yet\\n\\t\\t\\t\\tnot exactly the same, for it was now much better. And she\\n\\t\\t\\t\\tis proud of her good fortune, and acknowledges, for\\n\\t\\t\\t\\therself and her people, with gratitude, the light which\\n\\t\\t\\t\\twas given to them by Allah, by which they recognised\\n\\t\\t\\t\\tAllah's prophet in Solomon, and received the true\\n\\t\\t\\t\\tReligion with all their will and heart and soul."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "43",
    "NoteID": "3280",
    "Body": "Some Commentators and Translators adopt an alternative\\n\\t\\t\\t\\tconstruction for the last clause of the last verse and\\n\\t\\t\\t\\tthe first clause of this verse. They understand the\\n\\t\\t\\t\\tformer to be spoken by Solomon and to mean, 'we had\\n\\t\\t\\t\\tknowledge of Allah's Message and accepted it before her.'\\n\\t\\t\\t\\tThey understand the latter to mean, 'the worship of\\n\\t\\t\\t\\tothers besides Allah diverted her (from the true\\n\\t\\t\\t\\tReligion).' If we accept the construction adopted in this\\n\\t\\t\\t\\tTranslation, the visit to Solomon confirmed the true\\n\\t\\t\\t\\tFaith of Bilqis and prevented her from lapsing into her\\n\\t\\t\\t\\tancestral false worship."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "44",
    "NoteID": "3281",
    "Body": "Bilqis, having been received with honour on her arrival,\\n\\t\\t\\t\\tand having accepted the transformation of her throne,\\n\\t\\t\\t\\tplaced presumably in an outer building of the Palace, is\\n\\t\\t\\t\\tasked to enter the great Palace itself. Its floor was\\n\\t\\t\\t\\tmade of slabs of smooth polished glass, that glistened\\n\\t\\t\\t\\tlike water. She thought it was water, and tucked up her\\n\\t\\t\\t\\tclothes to pass through it, showing her bare feet and\\n\\t\\t\\t\\tankles. This was a very undignified position for a woman,\\n\\t\\t\\t\\tespecially one of the position of a Queen. Solomon\\n\\t\\t\\t\\timmediately told her the real facts, when she felt\\n\\t\\t\\t\\tgrateful, and joined herself with Solomon in praising\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "44",
    "NoteID": "3282",
    "Body": "A gentle leader points out the truth. Instead of\\n\\t\\t\\t\\tresenting it, the new entrant is grateful; acknowledges\\n\\t\\t\\t\\this own mistake freely and frankly; and heartily joins\\n\\t\\t\\t\\twith the Teacher in the worship of Allah, the Source of\\n\\t\\t\\t\\tall truth and knowledge."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "45",
    "NoteID": "3283",
    "Body": "The main story of the Thamud, who were broken up into two\\n\\t\\t\\t\\tfactions, the rich oppressing the poor and keeping them\\n\\t\\t\\t\\tout of the good things of life and the test case of the\\n\\t\\t\\t\\tShe-camel, will be found in xxvi. 141-159 and the notes\\n\\t\\t\\t\\tthereon. The point here is the secret plot of the nine\\n\\t\\t\\t\\tmen against the Prophet of Allah, whose teaching, they\\n\\t\\t\\t\\tthought, brought them ill-luck; but what they called\\n\\t\\t\\t\\till-luck was the just punishment from Allah for their own\\n\\t\\t\\t\\till-deeds. Their plot was foiled, and the whole\\n\\t\\t\\t\\tcommunity, which was involved in evil, was destroyed."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "46",
    "NoteID": "3284",
    "Body": "Cf. xiii. 6. The evil-doers were really hastening on\\n\\t\\t\\t\\ttheir own punishment by their feuds against the poor. The\\n\\t\\t\\t\\tadvocates of justice were not bringing ill-luck to them.\\n\\t\\t\\t\\tThey were showing the way to ward it off. Their own\\n\\t\\t\\t\\tinjustice was bringing on their disaster."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "47",
    "NoteID": "3285",
    "Body": "All evil unpunished is not evil condoned, but evil given\\n\\t\\t\\t\\ta chance for reform. They are on trial, by the mercy of\\n\\t\\t\\t\\tAllah. What they call \"ill omen\" is really the just\\n\\t\\t\\t\\tpunishment for their ill-deeds, and that punishment rests\\n\\t\\t\\t\\twith Allah."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "48",
    "NoteID": "3286",
    "Body": "They had made up their minds to wage a relentless war\\n\\t\\t\\t\\tagainst justice. They did not destroy justice, but\\n\\t\\t\\t\\tjustice destroyed them."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "49",
    "NoteID": "3287",
    "Body": "A most dastardly plot, because (1) it was to be secret,\\n\\t\\t\\t\\t(2) by night, (3) taking their victims unawares, and (4)\\n\\t\\t\\t\\tbecause careful provision was made that they should all\\n\\t\\t\\t\\ttell lies together, saying that they knew nothing about\\n\\t\\t\\t\\tit, in order to evade the vengeance which Salih's heirs\\n\\t\\t\\t\\t(if any were left) or his tribe might want to exact! And\\n\\t\\t\\t\\tyet such were exactly the plots laid against the holy\\n\\t\\t\\t\\tProphet himself."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "50",
    "NoteID": "3288",
    "Body": "Cf. iii. 54. Their secret plotting is all known to Allah,\\n\\t\\t\\t\\tbut of Allah's just and beneficent plans they know\\n\\t\\t\\t\\tnothing. And the wicked must come to an evil end."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "54",
    "NoteID": "3289",
    "Body": "The story of Lut is referred to elsewhere. The passages\\n\\t\\t\\t\\tto which reference may be made here are: xxvi. 160-175,\\n\\t\\t\\t\\tand vii. 80-84. But the point emphasised here is that the\\n\\t\\t\\t\\tcrime of the Cities of the Plain was against their own\\n\\t\\t\\t\\tnature, and they saw its enormity, and yet they indulged\\n\\t\\t\\t\\tin it. Can degradation go further? His wife was not\\n\\t\\t\\t\\tapparently a Believer. Her previous sympathy with the\\n\\t\\t\\t\\tsinful people \"destined her\" (verse 57 below) to a\\n\\t\\t\\t\\tmiserable end, as she lagged behind and shared in the\\n\\t\\t\\t\\tdestruction of her kinsfolk."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "55",
    "NoteID": "3290",
    "Body": "The ignorance referred to here is the spiritual\\n\\t\\t\\t\\tIgnorance, the Ignorance of how grossness and sins that\\n\\t\\t\\t\\tbring shame on their own physical and moral nature are\\n\\t\\t\\t\\tdoomed to destroy them: it is their own loss. That they\\n\\t\\t\\t\\tknew the iniquity of their sins has already been stated\\n\\t\\t\\t\\tin the last verse. That knowledge makes their spiritual\\n\\t\\t\\t\\tIgnorance all the more culpable, just as a man\\n\\t\\t\\t\\tconsciously deceiving people by half-truths is a greater\\n\\t\\t\\t\\tliar than a man who tells lies inadvertently."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "56",
    "NoteID": "3291",
    "Body": "Cf. vii. 82-84. Instead of being ashamed on account of\\n\\t\\t\\t\\tthe consciousness of their own guilt, they attack the\\n\\t\\t\\t\\tpure ones with their sarcasms, as if not they but the\\n\\t\\t\\t\\tpure ones were in the wrong in trying to set them on the\\n\\t\\t\\t\\tright way."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "59",
    "NoteID": "3292",
    "Body": "Allah's revelation having been described as Light,\\n\\t\\t\\t\\tGuidance, and Mercy, we ought all to be grateful to Allah\\n\\t\\t\\t\\tfor vouchsafing His revelation. We ought also to\\n\\t\\t\\t\\tappreciate the services of Allah's Messengers, who are\\n\\t\\t\\t\\tchosen to deliver Ms Message: we ought to send\\n\\t\\t\\t\\tsalutations of Peace on them, instead of plotting, as the\\n\\t\\t\\t\\twicked do, for their removal or persecution, or\\n\\t\\t\\t\\tbanishment or death. For these Prophets of Allah undergo\\n\\t\\t\\t\\tevery kind of hardship and forego every kind of advantage\\n\\t\\t\\t\\tor pleasure in life for serving mankind. And Allah is\\n\\t\\t\\t\\ttruth and goodness, and all our fancies of false worship\\n\\t\\t\\t\\tare falsehoods and evils. Shall we prefer falsehood and\\n\\t\\t\\t\\tevil to truth and goodness?"
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "60",
    "NoteID": "3293",
    "Body": "The order, beauty, and grandeur of the Universe are\\n\\t\\t\\t\\tappealed to. They show unity of design and purpose. How\\n\\t\\t\\t\\tcan unjust, ignorant, foolish, heedless, false men think\\n\\t\\t\\t\\tof a multiplicity of gods, or of any god, besides the One\\n\\t\\t\\t\\tTrue God?"
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "60",
    "NoteID": "3294",
    "Body": "To make a single seed germinate and grow into a tree is\\n\\t\\t\\t\\tbeyond man's power. When it comes to a great\\n\\t\\t\\t\\twell-laid-out garden of beauty and delight, no one would\\n\\t\\t\\t\\tthink it grew up of itself without a Gardener's\\n\\t\\t\\t\\tconsummate art. And the orchard is more than the trees in\\n\\t\\t\\t\\tit: there is design and beauty in their arrangement:\\n\\t\\t\\t\\tproper spaces have to be left between them for the growth\\n\\t\\t\\t\\tof their roots, for the aeration of the soil beneath\\n\\t\\t\\t\\tthem, and for the penetration of air and sunlight between\\n\\t\\t\\t\\ttheir branches. How can any one then think of the\\n\\t\\t\\t\\twonderful Universe as a whole, without thinking of the\\n\\t\\t\\t\\tfar higher Unity of Design, the evidence of the One True\\n\\t\\t\\t\\tAllah?"
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "61",
    "NoteID": "3295",
    "Body": "Cf. xvi. 15 and notes 2038 and 2039. The terra firma, the\\n\\t\\t\\t\\tflowing water, and the cycle of water circulation-sea,\\n\\t\\t\\t\\tvapour, clouds, rain, rivers, and sea again,-all one and\\n\\t\\t\\t\\tyet all distinct, with a sort of wonderful barrier\\n\\t\\t\\t\\tbetween salt water and fresh water: can man see all this\\n\\t\\t\\t\\tand yet be ignorant of Allah?"
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "61",
    "NoteID": "3296",
    "Body": "Cf. xxv. 53 and notes 3111 and 3112."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "62",
    "NoteID": "3297",
    "Body": "Besides the evidence of external nature, there is the\\n\\t\\t\\t\\tstill more intimate evidence in man's inner conscience\\n\\t\\t\\t\\tand heart. Allah listens to man's cry of agony and\\n\\t\\t\\t\\trelieves his suffering, and He has given him superiority\\n\\t\\t\\t\\tover other creation on this earth, through his mind and\\n\\t\\t\\t\\tsoul. Is man then going to run after inferior beings and\\n\\t\\t\\t\\tforget Allah?"
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "62",
    "NoteID": "3298",
    "Body": "Cf. vi. 165, n. 988."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "63",
    "NoteID": "3299",
    "Body": "Cf. xxv. 48, n. 3104. After external nature, our\\n\\t\\t\\t\\tattention was drawn to our inner consciousness; after\\n\\t\\t\\t\\tthat, it is drawn here to our social and collective life,\\n\\t\\t\\t\\tin which we use the forces of nature for international\\n\\t\\t\\t\\tintercourse, trade, agriculture, production, and economic\\n\\t\\t\\t\\twell-being generally. In the next verse, we are asked to\\n\\t\\t\\t\\tcontemplate creation from its primeval stages, through\\n\\t\\t\\t\\tits intermediate processes, to the final Destiny in a new\\n\\t\\t\\t\\tCreation-a new heaven and a new earth."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "64",
    "NoteID": "3300",
    "Body": "Cf. x. 34, and n. 1428."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "64",
    "NoteID": "3301",
    "Body": "Sustenance: of course in the spiritual as well as the\\n\\t\\t\\t\\tmaterial sense."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "64",
    "NoteID": "3302",
    "Body": "All the arguments point to the Unity of Allah: there is\\n\\t\\t\\t\\tnone whatever against it."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "65",
    "NoteID": "3303",
    "Body": "The existence of Allah is certain. But nothing else can\\n\\t\\t\\t\\tbe known with certainty to our knowledge. He has told us\\n\\t\\t\\t\\tof the Hereafter, and therefore we know it is true. But\\n\\t\\t\\t\\tthose who do not believe in Allah,-what knowledge or\\n\\t\\t\\t\\tcertainty can they have? Even when it is actually coming,\\n\\t\\t\\t\\tthey will not have the sense to perceive it."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "66",
    "NoteID": "3304",
    "Body": "The Unbelievers are generally materialists, who cannot go\\n\\t\\t\\t\\tbeyond the evidence of their physical senses. As to a\\n\\t\\t\\t\\tspiritual vision of the future, their physical senses\\n\\t\\t\\t\\twould only leave them in doubt and uncertainty, while\\n\\t\\t\\t\\ttheir rejection of the spiritual light makes them blind\\n\\t\\t\\t\\taltogether to the next world."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "69",
    "NoteID": "3305",
    "Body": "Even if the Unbelievers are unwilling to take any\\n\\t\\t\\t\\tdoctrine, they have only to observe what has actually\\n\\t\\t\\t\\thappened on the earth, and they will see that evil always\\n\\t\\t\\t\\tcame to an evil end, and that Truth and righteousness\\n\\t\\t\\t\\tultimately won."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "70",
    "NoteID": "3306",
    "Body": "Cf. xvi. 127, and n. 2164. 'The righteous need not worry\\n\\t\\t\\t\\tover the unjust. The plots of the unjust can never defeat\\n\\t\\t\\t\\tor deflect the purpose of Allah."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "72",
    "NoteID": "3307",
    "Body": "The Unbelievers-or even men of half-hearted faith-may\\n\\t\\t\\t\\tsay, \"Why worry over distant future events? Take the day\\n\\t\\t\\t\\tas it comes!\" But that is a fallacy. Judgment is certain,\\n\\t\\t\\t\\tand it may be that this very hour may be the hour of doom\\n\\t\\t\\t\\tfor any given individual. This is the hour of repentance\\n\\t\\t\\t\\tand amendment. For Allah wishes well to all mankind in\\n\\t\\t\\t\\tspite of their ingratitude."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "75",
    "NoteID": "3308",
    "Body": "Cf. xxii. 70, xxxvi. 12, lvii. 22."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "76",
    "NoteID": "3309",
    "Body": "The Jews had numerous sects. Some were altogether out of\\n\\t\\t\\t\\tthe pale, e.g., the Samaritans, who had a separate Taurat\\n\\t\\t\\t\\tof their own: they hated the other Jews and were hated by\\n\\t\\t\\t\\tthem. But even in the orthodox body, there were several\\n\\t\\t\\t\\tsects, of which the following may be mentioned: (1) the\\n\\t\\t\\t\\tPharisees, who were literalists, formalists, and\\n\\t\\t\\t\\tfatalists, and had a large body of traditional\\n\\t\\t\\t\\tliterature, with which they overlaid the Law of Moses;\\n\\t\\t\\t\\t(2) the Sadducees, who were rationalists, and seemed to\\n\\t\\t\\t\\thave doubted the doctrine of the Resurrection or of a\\n\\t\\t\\t\\tHereafter; (3) the Essenes, who practised a sort of\\n\\t\\t\\t\\tCommunism and Asceticism and prohibited marriage. About\\n\\t\\t\\t\\tmany of their doctrines they had bitter disputes, which\\n\\t\\t\\t\\twere settled by the Qur-an, which supplemented and\\n\\t\\t\\t\\tperfected the Law of Moses. It also explained clearly the\\n\\t\\t\\t\\tattributes of Allah and the nature of Revelation, and the\\n\\t\\t\\t\\tdoctrine of the Hereafter."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "78",
    "NoteID": "3310",
    "Body": "Decree: hukm: the disputes between rival sects can only\\n\\t\\t\\t\\tbe settled by the Decree of Allah,-(1) in the form of a\\n\\t\\t\\t\\tRevelation, as was done by the Qur-an, or (2) by the\\n\\t\\t\\t\\tlogic of events, for hundreds of sects have been\\n\\t\\t\\t\\textinguished and forgotten in the course of time, and (3)\\n\\t\\t\\t\\tin the Decree of Judgment in the Hereafter, when all\\n\\t\\t\\t\\tjarring sects will at length see their errors."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "80",
    "NoteID": "3311",
    "Body": "The Prophet's responsibility was to preach and show the\\n\\t\\t\\t\\tway. Men and women of goodwill had faith and accepted the\\n\\t\\t\\t\\tMessage. But he was not responsible for the obstinacy and\\n\\t\\t\\t\\tperversity of men who turned away from Allah's Signs and\\n\\t\\t\\t\\trejected the Truth."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "82",
    "NoteID": "3312",
    "Body": "The Word: the Decree or Sentence, the Decision to end the\\n\\t\\t\\t\\trespite and restore the true values of right and wrong in\\n\\t\\t\\t\\ta new world: their cup of iniquity will then have been\\n\\t\\t\\t\\tfull."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "82",
    "NoteID": "3313",
    "Body": "The Beast will be one of the Signs of the Last Days to\\n\\t\\t\\t\\tcome, before the present World passes away and the new\\n\\t\\t\\t\\tWorld is brought into being. If taklimuhum is read\\n\\t\\t\\t\\tinstead of tukallimuhum, it would mean that the Beast\\n\\t\\t\\t\\twould wound them."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "84",
    "NoteID": "3314",
    "Body": "The charge against them will be: 'You had no knowledge,\\n\\t\\t\\t\\tand yet you arrogantly rejected My Signs: is that true,\\n\\t\\t\\t\\tor have you any plea in your defence?'"
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "85",
    "NoteID": "3315",
    "Body": "There will be no plea, because the charge will be only\\n\\t\\t\\t\\ttoo true. The Decree will be passed and executed."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "86",
    "NoteID": "3316",
    "Body": "Night, Day, Rest, and Light: both in the literal and the\\n\\t\\t\\t\\tsymbolic sense. Any one with a scrap of faith or\\n\\t\\t\\t\\tspiritual insight could see that the Night is blessing\\n\\t\\t\\t\\twhen used for rest and a curse when used to cover\\n\\t\\t\\t\\tignorance or sin; and that the Day is for work and\\n\\t\\t\\t\\tenlightenment, and its misuse is gross ingratitude to\\n\\t\\t\\t\\tAllah. Or, understand Truth and practise Righteousness\\n\\t\\t\\t\\twhile it is yet Light and the Message of Allah is here to\\n\\t\\t\\t\\tguide you: for there comes the Night when Endeavour will\\n\\t\\t\\t\\tcease and there will be no room for Repentance."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "87",
    "NoteID": "3317",
    "Body": "Arrogance will flee with Ignorance, and Self will see\\n\\t\\t\\t\\titself in its true place-that of humility and\\n\\t\\t\\t\\tlowliness-when the scales of ignorance fall from its\\n\\t\\t\\t\\teyes."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "88",
    "NoteID": "3318",
    "Body": "This is so in the present phase of phenomenal things,\\n\\t\\t\\t\\tboth literally and figuratively. There seems nothing more\\n\\t\\t\\t\\tfirm or fixed or permanent than the \"eternal hills\": yet\\n\\t\\t\\t\\twhen the new order of things comes and the new World is\\n\\t\\t\\t\\tbrought into being, they will be as flimsy and\\n\\t\\t\\t\\tunsubstantial as clouds. So, in the revaluation of things\\n\\t\\t\\t\\tin the Hereafter persons or things or ideas that seem so\\n\\t\\t\\t\\tgreat and so firmly established now will pass away like\\n\\t\\t\\t\\tmere fancies and give way to the Reality of Allah."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "88",
    "NoteID": "3319",
    "Body": "Atqana: to arrange or dispose of things with art, or so\\n\\t\\t\\t\\tas to obtain the most perfect results. The present\\n\\t\\t\\t\\tphenomenal world and the Future that is to be, all have a\\n\\t\\t\\t\\tdefinite object and purpose in the Plan of Allah, Who\\n\\t\\t\\t\\tknows perfectly what we are, what we do, what we think,\\n\\t\\t\\t\\tand what we need. Who can praise His artistry enough?"
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "90",
    "NoteID": "3320",
    "Body": "Headlong: it may be that the very things of which we were\\n\\t\\t\\t\\tproudest, which we considered foremost in our present\\n\\t\\t\\t\\torder of the world, will be the first to go into the\\n\\t\\t\\t\\tFire, as they are but the window-dressing (=faces) of\\n\\t\\t\\t\\tEvil."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "90",
    "NoteID": "3321",
    "Body": "There will be no punishment except such as has been\\n\\t\\t\\t\\tdeserved by actual conduct in the present life of\\n\\t\\t\\t\\tprobation."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "91",
    "NoteID": "3322",
    "Body": "The Lord of this City. This was spoken in Makkah say\\n\\t\\t\\t\\tabout the 5th year before the Hijrat, when the holy\\n\\t\\t\\t\\tProphet and his adherents were being persecuted as\\n\\t\\t\\t\\tenemies to the cult of Makkah. So far from being against\\n\\t\\t\\t\\tthe true spirit of the holy City of Makkah, it was\\n\\t\\t\\t\\tactually in furtherance of that spirit, which had been\\n\\t\\t\\t\\toverlaid by the idolatries and abominations of the Pagan\\n\\t\\t\\t\\tQuraish. They are told that the new Teaching is from the\\n\\t\\t\\t\\tLord of Makkah itself, the One True God, Who had\\n\\t\\t\\t\\tsanctified it in the time of Abraham. Lest they should\\n\\t\\t\\t\\tthink that it was a local or tribal or narrow cult, it is\\n\\t\\t\\t\\tadded that He is not only Lord of this City, but Lord of\\n\\t\\t\\t\\tthe Worlds, \"to Whom belong all things\". It is a\\n\\t\\t\\t\\tuniversal message; but how sad it would be if the\\n\\t\\t\\t\\tMakkans, among whom it came first, were to reject it?"
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "92",
    "NoteID": "3323",
    "Body": "The duty of the Prophet and his adherents was, first, to\\n\\t\\t\\t\\taccept Islam and become themselves shining examples of\\n\\t\\t\\t\\tAllah's grace and mercy, as they in fact were, and\\n\\t\\t\\t\\tsecondly to preach that message and spread that Light to\\n\\t\\t\\t\\tall around. It was not for them to force it on unwilling\\n\\t\\t\\t\\tpeople: for any who rejected it would find their own\\n\\t\\t\\t\\tspiritual loss in such rejection. But they must clearly\\n\\t\\t\\t\\twarn them of the consequences."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "93",
    "NoteID": "3324",
    "Body": "In a few years after that, many wonderful things happened\\n\\t\\t\\t\\tthat removed the doubts of the doubters and confirmed the\\n\\t\\t\\t\\tfaith of the Believers. They showed how the logic of\\n\\t\\t\\t\\tevents proved the true mission of the holy Prophet. Other\\n\\t\\t\\t\\tthings some minds may not be able to grasp. But the logic\\n\\t\\t\\t\\tof events is for all to see."
  },
  {
    "SurahNumber": "27",
    "AyahNumber": "93",
    "NoteID": "3325",
    "Body": "Trials and tribulations, persecution and exile, and the\\n\\t\\t\\t\\tpatient endurance and constancy with which they were met\\n\\t\\t\\t\\tby the Believers-all are known to Allah and will be\\n\\t\\t\\t\\tcredited to their account."
  }
]
