[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/010001",
        "Body":  "Alif. Lam. Ra. These are verses of the wise Scripture."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/010010",
        "Body":  "Their prayer therein will be: Glory be to Thee, O Allah! and\n\t\t\ttheir greeting therein will be: Peace. And the conclusion of\n\t\t\ttheir prayer will be: Praise be to Allah, Lord of the Worlds!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "100",
        "Recitation":  "Alafasy_128kbps/010100",
        "Body":  "It is not for any soul to believe save by the permission of\n\t\t\tAllah. He hath set uncleanness upon those who have no sense."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "101",
        "Recitation":  "Alafasy_128kbps/010101",
        "Body":  "Say: Behold what is in the heavens and the earth! But revelations\n\t\t\tand warnings avail not folk who will not believe."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "102",
        "Recitation":  "Alafasy_128kbps/010102",
        "Body":  "What expect they save the like of the days of those who passed\n\t\t\taway before them? Say: Expect then! I am with you among the\n\t\t\texpectant."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "103",
        "Recitation":  "Alafasy_128kbps/010103",
        "Body":  "Then shall We save Our messengers and the believers, in like\n\t\t\tmanner (as of old). It is incumbent upon Us to save believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "104",
        "Recitation":  "Alafasy_128kbps/010104",
        "Body":  "Say (O Muhammad): O mankind! If ye are in doubt of my religion,\n\t\t\tthen (know that) I worship not those whom ye worship instead of\n\t\t\tAllah, but I worship Allah who causeth you to die, and I have\n\t\t\tbeen commanded to be of the believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "105",
        "Recitation":  "Alafasy_128kbps/010105",
        "Body":  "And, (O Muhammad) set thy purpose resolutely for religion, as a\n\t\t\tman by nature upright, and be not of those who ascribe partners\n\t\t\t(to Allah)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "106",
        "Recitation":  "Alafasy_128kbps/010106",
        "Body":  "And cry not, beside Allah, unto that which cannot profit thee nor\n\t\t\thurt thee, for if thou didst so then wert thou of the\n\t\t\twrong-doers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "107",
        "Recitation":  "Alafasy_128kbps/010107",
        "Body":  "If Allah aflicteth thee with some hurt, there is none who can\n\t\t\tremove it save Him; and if He desireth good for thee, there is\n\t\t\tnone who can repel His bounty.\tHe striketh with it whom He will\n\t\t\tof His bondmen. He is the Forgiving, the Merciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "108",
        "Recitation":  "Alafasy_128kbps/010108",
        "Body":  "Say: O mankind! Now hath the Truth from your Lord come unto you.\n\t\t\tSo whosoever is guided, is guided only for (the food of) his\n\t\t\tsoul, and whosoever erreth erreth only against it. And I am not a\n\t\t\twarder over you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "109",
        "Recitation":  "Alafasy_128kbps/010109",
        "Body":  "And (O Muhammad) follow that which is inspired in thee, and\n\t\t\tforbear until Allah give judgment. And He is the Best of Judges."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/010011",
        "Body":  "If Allah were to hasten on for men the ill (that they have earned\n\t\t\t) as they would hasten on the good, their respite would already\n\t\t\thave expired. But We suffer those who look not for the meeting\n\t\t\twith Us to wander blindly on in their contumacy."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/010012",
        "Body":  "And if misfortune touch a man he crieth unto Us, (while\n\t\t\treclining) on his side, or sitting or standing, but when We have\n\t\t\trelieved him of the misfortune he goeth his way as though he had\n\t\t\tnot cried unto Us because of a misfortune that afflicted him.\n\t\t\tThus is what they do made (seeming) fair unto the prodigal."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/010013",
        "Body":  "We destroyed the generations before you when they did wrong; and\n\t\t\ttheir messengers (from Allah) came unto them with clear proofs\n\t\t\t(of His Sovereignty) but they would not believe. Thus do We\n\t\t\treward the guilty folk:"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/010014",
        "Body":  "Then We appointed you viceroys in the earth after them, that We\n\t\t\tmight see how ye behave."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/010015",
        "Body":  "And when Our clear revelations are recited unto them they who\n\t\t\tlook not for the meeting with Us say: Bring a Lecture other than\n\t\t\tthis, or change it. Say (O Muhammad): It is not for me to change\n\t\t\tit of my own accord. I only follow that which is inspired in me.\n\t\t\tLo! If I disobey my Lord I fear the retribution of an awful Day."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/010016",
        "Body":  "Say: If Allah had so willed I should not have recited it to you\n\t\t\tnor would He have made it known to you. I dwelt among you a whole\n\t\t\tlifetime before it (came to me). Have ye then no sense?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/010017",
        "Body":  "Who doeth greater wrong than he who inventeth a lie concerning\n\t\t\tAllah and denieth His revelations? Lo! the guilty never are\n\t\t\tsuccessful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/010018",
        "Body":  "They worship beside Allah that which neither hurteth them nor\n\t\t\tprofiteth them, and they say: These are our intercessors with\n\t\t\tAllah. Say: Would ye inform Allah of (something) that He knoweth\n\t\t\tnot in the heavens or in the earth? Praised be He and high\n\t\t\texalted above all that ye associate (with Him)!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/010019",
        "Body":  "Mankind were but one community; then they differed; and had it\n\t\t\tnot been for a word that had already gone forth from thy Lord, it\n\t\t\thad been judged between them in respect of that wherein they\n\t\t\tdiffer."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/010002",
        "Body":  "Is it a wonder for mankind that We have inspired a man among\n\t\t\tthem, saying: Warn mankind and bring unto those who believe the\n\t\t\tgood tidings that they have a sure footing with their Lord? The\n\t\t\tdisbelievers say: Lo! this is a mere wizard."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/010020",
        "Body":  "And they will say: If only a portent were sent down upon him from\n\t\t\this Lord! Then say (O Muhammad): The Unseen belongeth to Allah.\n\t\t\tSo wait! Lo, I am waiting with you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/010021",
        "Body":  "And when We cause mankind to taste of mercy after some adversity\n\t\t\twhich had afflicted them, behold! they have some plot against Our\n\t\t\trevelations. Say: Allah is more swift in plotting. Lo! Our\n\t\t\tmessengers write down that which ye plot."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/010022",
        "Body":  "He it is Who maketh you to go on the land and the sea till, when\n\t\t\tye are in the ships and they sail with them with a fair breeze\n\t\t\tand they are glad therein, a storm wind reacheth them and the\n\t\t\twave cometh unto them from every side and they deem that they are\n\t\t\toverwhelmed therein; (then) they cry unto Allah, making their\n\t\t\tfaith pure for Him only; If Thou deliver us from this, we truly\n\t\t\twill be of the thankful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/010023",
        "Body":  "Yet when He hath delivered them, behold! they rebel in the earth\n\t\t\twrongfully. O mankind! Your rebellion is only against yourselves.\n\t\t\t(Ye have) enjoyment of the life of the world; then unto Us is\n\t\t\tyour return and We shall proclaim unto you what ye used to do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/010024",
        "Body":  "The similitude of the life of the world is only as water which We\n\t\t\tsend down from the sky, then the earth\u0027s growth of that which men\n\t\t\tand cattle eat mingleth with it till, when the earth hath taken\n\t\t\ton her ornaments and is embellished, and her people deem that\n\t\t\tthey are masters of her, Our commandment cometh by night or by\n\t\t\tday and we make it as reaped corn as if it had not flourished\n\t\t\tyesterday. Thus do We expound the revelations for people who\n\t\t\treflect."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/010025",
        "Body":  "And Allah summoneth to the abode of peace, and leadeth whom He\n\t\t\twill to a straight path."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/010026",
        "Body":  "For those who do good is the best (reward) and more (thereto).\n\t\t\tNeither dust nor ignominy cometh near their faces. Such are\n\t\t\trightful owners of the Garden; they will abide therein."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/010027",
        "Body":  "And those who earn ill deeds, (for them) requital of each ill\n\t\t\tdeed by the like thereof; and ignominy overtaketh them. They have\n\t\t\tno protector from Allah. As if their faces had been covered with\n\t\t\ta cloak of darkest night. Such are rightful owners of the Fire;\n\t\t\tthey will abide therein."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/010028",
        "Body":  "On the day when We gather them all together, then We say unto\n\t\t\tthose who ascribed partners (unto Us): Stand back, ye and your\n\t\t\t(pretended) partners (of Allah)! And We separate them, the one\n\t\t\tfrom the other, and their (pretended) partners say: It was not us\n\t\t\tye worshipped."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/010029",
        "Body":  "Allah sufficeth as a witness between us and you, that we were\n\t\t\tunaware of your worship."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/010003",
        "Body":  "Lo! your Lord is Allah Who created the heavens and the earth in\n\t\t\tsix days, then He established Himself upon the Throne, directing\n\t\t\tall things. There is no intercessor (with Him) save after His\n\t\t\tpermission. That is Allah, your Lord, so worship Him. Oh, will ye\n\t\t\tnot remind?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/010030",
        "Body":  "There doth every soul experience that which it did aforetime, and\n\t\t\tthey are returned unto Allah, their rightful Lord, and that which\n\t\t\tthey used to invent hath failed them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/010031",
        "Body":  "Say (unto them, O Muhammad): Who provideth for you from the sky\n\t\t\tand the earth, or Who owneth hearing and sight; and Who bringeth\n\t\t\tforth the living from the dead and bringeth forth the dead from\n\t\t\tthe living; and Who directeth the course? They will say: Allah.\n\t\t\tThen say: Will ye not then keep your duty (unto Him)?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/010032",
        "Body":  "Such then is Allah, your rightful Lord. After the Truth what is\n\t\t\tthere saving error? How then are ye turned away!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/010033",
        "Body":  "Thus is the Word of thy Lord justified concerning those who do\n\t\t\twrong: that they believe not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/010034",
        "Body":  "Say : Is there of your partners (whom ye ascribe unto Allah) one\n\t\t\tthat produceth Creation and then reproduceth it? Say: Allah\n\t\t\tproduceth creation, then reproduceth it. How then, are ye misled!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/010035",
        "Body":  "Say: Is there of your partners (whom ye ascribe unto Allah) one\n\t\t\tthat leadeth to the Truth? Say: Allah leadeth to the Truth. Is He\n\t\t\tWho leadeth to the Truth more deserving that He should be\n\t\t\tfollowed, or he who findeth not the way unless he (himself) be\n\t\t\tguided. What aileth you? How judge ye?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/010036",
        "Body":  "Most of them follow naught but conjecture. Assuredly conjecture\n\t\t\tcan by no means take the place of truth. Lo! Allah is Aware of\n\t\t\twhat they do."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/010037",
        "Body":  "And this Quran is not such as could ever be invented in despite\n\t\t\tof Allah; but it is a confirmation of that which was before it\n\t\t\tand an exposition of that which is decreed for mankind-- Therein\n\t\t\tis no doubt--from the Lord of the Worlds."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/010038",
        "Body":  "Or say they: He hath invented it? Say: Then bring a surah like\n\t\t\tunto it, and call (for help) on all ye can besides Allah, if ye\n\t\t\tare truthful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/010039",
        "Body":  "Nay, but they denied that, the knowledge whereof they could not\n\t\t\tcompass, and whereof the interpretation (in events) hath not yet\n\t\t\tcome unto them. Even so did those before them deny. Then see what\n\t\t\twas the consequence for the wrongdoers!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/010004",
        "Body":  "Unto Him is the return of all of you; it is a promise of Allah in\n\t\t\ttruth. Lo! He produceth creation, then reproduceth it, that He\n\t\t\tmay reward those who believe and do good works with equity;\n\t\t\twhile, as for those who disbelieve, theirs will be a boiling\n\t\t\tdrink and painful doom because they disbelieved."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/010040",
        "Body":  "And of them is he who believeth therein, and of them is he who\n\t\t\tbelieveth not therein, and thy Lord is best aware of the\n\t\t\tcorrupters."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/010041",
        "Body":  "And if they deny thee, say: Unto me my work, and unto you your\n\t\t\twork. Ye are innocent of what I do, and I am innocent of what ye\n\t\t\tdo."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/010042",
        "Body":  "And of them are some who listen unto thee. But canst thou make\n\t\t\tthe deaf to hear even though they apprehend not?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/010043",
        "Body":  "And of them is he who looketh toward thee. But canst thou guide\n\t\t\tthe blind even though they see not?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/010044",
        "Body":  "Lo! Allah wrongeth not mankind in aught; but mankind wrong\n\t\t\tthemselves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/010045",
        "Body":  "And on the day when He shall gather them together, (when it will\n\t\t\tseem) as though they had tarried but an hour of the day,\n\t\t\trecognizing one another, those will verily have perished who\n\t\t\tdenied the meeting with Allah and were not guided."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/010046",
        "Body":  "Whether We let thee (O Muhammad) behold something of that which\n\t\t\tWe promise them or (whether We) cause thee to die, still unto Us\n\t\t\tis their return, and Allah, moreover, is Witness over what they\n\t\t\tdo."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/010047",
        "Body":  "And for every nation there is a messenger. And when their\n\t\t\tmessenger cometh (on the Day of Judgment) it will be judged\n\t\t\tbetween them fairly, and they will not be wronged."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/010048",
        "Body":  "And they say: When will this promise be fulfilled, if ye are\n\t\t\ttruthful?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/010049",
        "Body":  "Say: I have no power to hurt or benefit myself, save that which\n\t\t\tAllah willeth. For every nation there is an appointed time. When\n\t\t\ttheir time cometh, then they cannot put it off an hour, nor\n\t\t\thasten (it)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/010005",
        "Body":  "He it is who appointed the sun a splendor and the moon a light,\n\t\t\tand measured for her stages, that ye might know the number of the\n\t\t\tyears, and the reckoning. Allah created not (all) that save in\n\t\t\ttruth. He detaileth the revelations for people who have\n\t\t\tknowledge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/010050",
        "Body":  "Say: Have ye thought: When His doom cometh unto you as a raid by\n\t\t\tnight, or in the (busy) day; what is there of it that the guilty\n\t\t\tones desire to hasten?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/010051",
        "Body":  "Is it (only) then, when it hath befallen you, that ye will\n\t\t\tbelieve? What! (Believe) now, when (until now) ye have been\n\t\t\thastening it on (through disbelief)?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/010052",
        "Body":  "Then will it be said unto those who dealt unjustly: Taste the\n\t\t\ttorment of eternity. Are ye requited aught save what ye used to\n\t\t\tearn?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/010053",
        "Body":  "And they ask thee to inform them (saying): Is it true? Say: Yea,\n\t\t\tby my Lord, verily it is true, and ye cannot escape."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/010054",
        "Body":  "And if each soul that doeth wrong had all that is in the earth it\n\t\t\twould seek to ransom itself therewith; and they will feel remorse\n\t\t\twithin them, when they see the doom. But it hath been judged\n\t\t\tbetween them fairly and they are not wronged."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/010055",
        "Body":  "Lo! verily all that is in the heavens and the earth is Allah\u0027s.\n\t\t\tLo! verily Allah\u0027s promise is true. But most of them know not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/010056",
        "Body":  "He quickeneth and giveth death, and unto Him ye will be returned."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/010057",
        "Body":  "O mankind! There hath come unto you an exhortation from your\n\t\t\tLord, a balm for that which is in the breasts, a guidance and a\n\t\t\tmercy for believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/010058",
        "Body":  "Say: In the bounty of Allah and in His mercy: therein let them\n\t\t\trejoice. It is better than what they hoard."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/010059",
        "Body":  "Say: Have ye considered what provision Allah hath sent down for\n\t\t\tyou, how ye have made of it lawful and unlawful? Say: Hath Allah\n\t\t\tpermitted you, or do ye invent a lie concerning Allah?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/010006",
        "Body":  "Lo! in the difference of day and night and all that Allah hath\n\t\t\tcreated in the heavens and the earth are portents, verily, for\n\t\t\tfolk who ward off (evil)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/010060",
        "Body":  "And what think those who invent a lie concerning Allah (will be\n\t\t\ttheir plight) upon the Day of Resurrection? Lo! Allah truly is\n\t\t\tBountiful toward mankind, but most of them give not thanks."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/010061",
        "Body":  "And thou (Muhammad) art not occupied with any business and thou\n\t\t\trecitest not a lecture from this (Scripture), and ye ( mankind)\n\t\t\tperform no act, but We are Witness of you when ye are engaged\n\t\t\ttherein. And not an atom\u0027s weight in the earth or in the sky\n\t\t\tescapeth your Lord, nor what is less than that or greater than\n\t\t\tthat, but it is (written) in a clear Book."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/010062",
        "Body":  "Lo! verily the friends of Allah are (those) on whom fear (cometh)\n\t\t\tnot, nor do they grieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/010063",
        "Body":  "Those who believe and keep their duty (to Allah),"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/010064",
        "Body":  "Theirs are good tidings in the life of the world and in the\n\t\t\tHereafter. There is no changing the Words of Allah that is the\n\t\t\tSupreme Triumph."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/010065",
        "Body":  "And let not their speech grieve thee (O Muhammad). Lo! power\n\t\t\tbelongeth wholly to Allah. He is the Hearer, the Knower."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/010066",
        "Body":  "Lo! is it not unto Allah that belongeth whosoever is in the\n\t\t\theavens and whosoever is in the earth? Those who follow aught\n\t\t\tinstead of Allah follow not (His) partners. They follow only a\n\t\t\tconjecture, and they do but guess."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/010067",
        "Body":  "He it is who hath appointed for you the night that ye should rest\n\t\t\ttherein and the day giving sight. Lo! herein verily are portents\n\t\t\tfor a folk that heed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/010068",
        "Body":  "They say: Allah hath taken (unto Him) a son. Glorified be He! He\n\t\t\thath no needs! His is all that is in the heavens and all that is\n\t\t\tin the earth. Ye have no warrant for this. Tell ye concerning\n\t\t\tAllah that which ye know not?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/010069",
        "Body":  "Say: Verily those who invent a lie concerning Allah will not\n\t\t\tsucceed."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/010007",
        "Body":  "Lo! those who expect not the meeting with Us but desire the life\n\t\t\tof the world and feel secure therein, and those who are\n\t\t\tneglectful of Our revelations,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/010070",
        "Body":  "This world\u0027s portion (will be theirs), then unto Us is their\n\t\t\treturn. Then We make them taste a dreadful doom because they used\n\t\t\tto disbelieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/010071",
        "Body":  "Recite unto them the story of Noah, when he told his people: O my\n\t\t\tpeople! If my sojourn (here) and my reminding you by Allah\u0027s\n\t\t\trevelations are an offence unto you, in Allah have I put my\n\t\t\ttrust, so decide upon your course of action, you and your\n\t\t\tpartners. Let not your course of action be in doubt, for you.\n\t\t\tThen have at me, give me no respite."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/010072",
        "Body":  "But if ye are averse I have asked of you no wage. My wage is the\n\t\t\tconcern of Allah only, and I am commanded to be of those who\n\t\t\tsurrender (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/010073",
        "Body":  "But they denied him, so We saved him and those with him in the\n\t\t\tship, and made them viceroys (in the earth), while We drowned\n\t\t\tthose who denied Our revelations. See then the nature of the\n\t\t\tconsequence for those who had been warned."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/010074",
        "Body":  "Then, after him, We sent messengers unto their folk, and they\n\t\t\tbrought them clear proofs. But they were not ready to believe in\n\t\t\tthat which they before denied. Thus print We on the hearts of the\n\t\t\ttransgressors."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/010075",
        "Body":  "Then, after them, We sent Moses and Aaron unto Pharaoh and his\n\t\t\tchiefs with Our revelations, but they were arrogant and were a\n\t\t\tguilty folk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/010076",
        "Body":  "And when the Truth from Our presence came unto them, they said:\n\t\t\tThis is mere magic."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/010077",
        "Body":  "Moses said: Speak ye (so) of the Truth when it hath come unto\n\t\t\tyou? Is this magic? Now magicians thrive not."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/010078",
        "Body":  "They said: Hast thou come unto us to pervert us from that (faith)\n\t\t\tin which we found our fathers, and that you two may own the place\n\t\t\tof greatness in the land? We will not believe you two."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "79",
        "Recitation":  "Alafasy_128kbps/010079",
        "Body":  "And Pharaoh said: Bring every cunning wizard unto me."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/010008",
        "Body":  "Their home will be the Fire because of what they used to earn."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "80",
        "Recitation":  "Alafasy_128kbps/010080",
        "Body":  "And when the wizards came, Moses said unto them: Cast your cast!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "81",
        "Recitation":  "Alafasy_128kbps/010081",
        "Body":  "And when they had cast, Moses said: That which ye have brought is\n\t\t\tmagic. Lo! Allah will make it vain. Lo! Allah upholdeth not the\n\t\t\twork of mischief makers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "82",
        "Recitation":  "Alafasy_128kbps/010082",
        "Body":  "And Allah will vindicate the Truth by His words, however much the\n\t\t\tguilty be averse."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "83",
        "Recitation":  "Alafasy_128kbps/010083",
        "Body":  "But none trusted Moses, save some scions of his people, (and they\n\t\t\twere) in fear of Pharaoh and their chiefs, that they would\n\t\t\tpersecute them. Lo! Pharaoh was verily a tyrant in the land, and\n\t\t\tLo! he verily was of the wanton."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "84",
        "Recitation":  "Alafasy_128kbps/010084",
        "Body":  "And Moses said: O my people! If ye have believed in Allah then\n\t\t\tput trust in Him, if ye have indeed surrendered (unto Him)!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "85",
        "Recitation":  "Alafasy_128kbps/010085",
        "Body":  "They said: In Allah we put trust. Our Lord! Oh, make us not a\n\t\t\tlure for the wrongdoing folk;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "86",
        "Recitation":  "Alafasy_128kbps/010086",
        "Body":  "And, of Thy mercy, save us from the folk that disbelieve."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "87",
        "Recitation":  "Alafasy_128kbps/010087",
        "Body":  "And We inspired Moses and his brother, (saying): Appoint houses\n\t\t\tfor your people in Egypt and make your houses oratories, and\n\t\t\testablish worship. And give good news to the believers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "88",
        "Recitation":  "Alafasy_128kbps/010088",
        "Body":  "And Moses said: Our Lord! Lo! Thou hast given Pharaoh and his\n\t\t\tchiefs splendor and riches in the life of the world, Our Lord!\n\t\t\tthat they may lead men astray from Thy way. Our Lord! Destroy\n\t\t\ttheir riches and harden their hearts so that they believe not\n\t\t\ttill they see the painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "89",
        "Recitation":  "Alafasy_128kbps/010089",
        "Body":  "He said: Your prayer is heard. Do ye twain keep to the straight\n\t\t\tpath, and follow not the road of those who have no knowledge."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/010009",
        "Body":  "Lo! those who believe and do good works, their Lord guideth them\n\t\t\tby their faith. Rivers will] flow beneath them in the Gardens of\n\t\t\tDelight,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "90",
        "Recitation":  "Alafasy_128kbps/010090",
        "Body":  "And We brought the Children of Israel across the sea, and Pharaoh\n\t\t\twith his hosts pursued them in rebellion and transgression, till,\n\t\t\twhen the (fate of) drowning overtook him, he exclaimed: I believe\n\t\t\tthat there is no God save Him in whom the Children of Israel\n\t\t\tbelieve, and I am of those who surrender (unto Him)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "91",
        "Recitation":  "Alafasy_128kbps/010091",
        "Body":  "What! Now! When hitherto thou hast rebelled and been of the\n\t\t\twrong-doers?"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "92",
        "Recitation":  "Alafasy_128kbps/010092",
        "Body":  "But this day We save thee in thy body that thou mayest be a\n\t\t\tportent for those after thee. Lo! most of mankind are heedless of\n\t\t\tOur portents."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "93",
        "Recitation":  "Alafasy_128kbps/010093",
        "Body":  "And We verify did allot unto the Children of Israel a fixed\n\t\t\tabode, and did provide them with good things; and they differed\n\t\t\tnot until knowledge came unto them. Lo! thy Lord will judge\n\t\t\tbetween them on the Day of Resurrection concerning that wherein\n\t\t\tthey used to differ."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "94",
        "Recitation":  "Alafasy_128kbps/010094",
        "Body":  "And if thou (Muhammad) art in doubt concerning that which We\n\t\t\treveal unto thee, then question those who read the Scripture\n\t\t\t(that was) before thee. Verily the Truth from thy Lord hath come\n\t\t\tunto thee. So be not thou of the waverers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "95",
        "Recitation":  "Alafasy_128kbps/010095",
        "Body":  "And be not thou of those who deny the revelations of Allah, for\n\t\t\tthen wert thou of the losers."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "96",
        "Recitation":  "Alafasy_128kbps/010096",
        "Body":  "Lo! those for whom the word of thy Lord (concerning sinners) hath\n\t\t\teffect will not believe,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "97",
        "Recitation":  "Alafasy_128kbps/010097",
        "Body":  "Though every token come unto them, till they see the painful\n\t\t\tdoom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "98",
        "Recitation":  "Alafasy_128kbps/010098",
        "Body":  "If only there had been a community (of all those that were\n\t\t\tdestroyed of old) that believed and profited by its belief as did\n\t\t\tthe folk of Jonah. When they believed We drew off from them the\n\t\t\ttorment of disgrace in the life of the world and gave them\n\t\t\tcomfort for a while."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "10",
        "AyahNumber":  "99",
        "Recitation":  "Alafasy_128kbps/010099",
        "Body":  "And if thy Lord willed, all who are in the earth would have\n\t\t\tbelieved together. Wouldst thou (Muhammad) compel men until they\n\t\t\tare believers?"
    }
]
