[
  {
    "SurahNumber": "9",
    "AyahNumber": "1",
    "NoteID": "1246",
    "Body": "Baraat: usually translated \"immunity\". I do not think\\n\\t\\t\\t\\tthat word correctly represents the Arabic word in this\\n\\t\\t\\t\\tcontext. I retain it as I cannot think of any single\\n\\t\\t\\t\\tEnglish word as an equivalent. The general sense is\\n\\t\\t\\t\\texplained in the introduction to this Sura. In verse 3\\n\\t\\t\\t\\tbelow I use the periphrasis \"dissolve treaty\\n\\t\\t\\t\\tobligations,\" which goes some way to explain the meaning.\\n\\t\\t\\t\\tThe Pagans and enemies of Islam frequently made treaties\\n\\t\\t\\t\\tof mutual alliance with the Muslims. The Muslims\\n\\t\\t\\t\\tscrupulously observed their part, but the Pagans violated\\n\\t\\t\\t\\ttheir part again and again when it suited them. After\\n\\t\\t\\t\\tsome years, experience it became imperative to denounce\\n\\t\\t\\t\\tsuch treaties altogether. This was done in due form, with\\n\\t\\t\\t\\tfour months' notice, and a chance was given to those who\\n\\t\\t\\t\\tfaithfully observed their pledges, to continue their\\n\\t\\t\\t\\talliance."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "2",
    "NoteID": "1247",
    "Body": "Four Months: Some Commentators understand by this the\\n\\t\\t\\t\\tfour forbidden months in which warfare by ancient Arabian\\n\\t\\t\\t\\tcustom was unlawful, viz., Rajab, Zul-qa'dah, Zul-hijjah,\\n\\t\\t\\t\\tand Muharram: See ii. 194 n. But it is better to take the\\n\\t\\t\\t\\tsignification of the four months immediately following\\n\\t\\t\\t\\tthe Declaration. Assuming that the Sura was promulgated\\n\\t\\t\\t\\tearly in Shawwal (see Introduction), the four months\\n\\t\\t\\t\\twould be Shawwal, Zul-qa'dah, Zul-hijjah, and Muharram,\\n\\t\\t\\t\\tof which the last three would also be the customary\\n\\t\\t\\t\\tProhibited Months."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "3",
    "NoteID": "1248",
    "Body": "The great day of Hajj is either the 9th of Zul-hijjah\\n\\t\\t\\t\\t('Arafa), or the 10th (the Day of Sacrifice)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "4",
    "NoteID": "1249",
    "Body": "The sacred duty of fulfilling all obligations of every\\n\\t\\t\\t\\tkind, to Muslims and non Muslims, in public as well as\\n\\t\\t\\t\\tprivate life, is a cardinal feature of Muslim ethics. The\\n\\t\\t\\t\\tquestion what is to be done with those who abuse this\\n\\t\\t\\t\\tprinciple by failing in their duty but expect the Muslims\\n\\t\\t\\t\\tto do their part is not to be solved (in the case of\\n\\t\\t\\t\\ttreaties) by a general denunciation of treaties but by a\\n\\t\\t\\t\\tcareful consideration of the cases where there has been\\n\\t\\t\\t\\tfidelity and not treachery. There we are enjoined to give\\n\\t\\t\\t\\tthe strictest fidelity, as it is a part of righteousness\\n\\t\\t\\t\\tand our duty to Allah."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "5",
    "NoteID": "1250",
    "Body": "The emphasis is on the first clause; it is only when the\\n\\t\\t\\t\\tfour months of grace are past, and the other party show\\n\\t\\t\\t\\tno signs of desisting from their treacherous designs by\\n\\t\\t\\t\\tright conduct, that the state of war supervenes-between\\n\\t\\t\\t\\tFaith and Unfaith."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "5",
    "NoteID": "1251",
    "Body": "When war becomes inevitable, it must be prosecuted with\\n\\t\\t\\t\\tvigour. According to the English phrase, you cannot fight\\n\\t\\t\\t\\twith kid gloves. The fighting may take the form of\\n\\t\\t\\t\\tkilling, capture, or siege, or ambush and other\\n\\t\\t\\t\\tstratagems. But even then there is room for repentance\\n\\t\\t\\t\\tand amendment on the part of the guilty party, and if\\n\\t\\t\\t\\tthat takes place, our duty is forgiveness and the\\n\\t\\t\\t\\testablishment of peace."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "5",
    "NoteID": "1252",
    "Body": "The repentance must be sincere, and that is shown by\\n\\t\\t\\t\\tconduct-a religious spirit of true prayer and charity. In\\n\\t\\t\\t\\tthat case we are not to bar the gate against the\\n\\t\\t\\t\\trepentant. On the contrary we must do all we can to make\\n\\t\\t\\t\\ttheir way easy, remembering that Allah is Oft-forgiving,\\n\\t\\t\\t\\tMost Merciful."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "6",
    "NoteID": "1253",
    "Body": "Even among the enemies of Islam, actively fighting\\n\\t\\t\\t\\tagainst Islam, there may be individuals who may be in a\\n\\t\\t\\t\\tposition to require protection. Full asylum is to be\\n\\t\\t\\t\\tgiven to them, and opportunities provided for hearing the\\n\\t\\t\\t\\tWord of Allah. If they accept the Word, they become\\n\\t\\t\\t\\tMuslims and brethren, and no further question arises. If\\n\\t\\t\\t\\tthey do not see their way to accept Islam, they will\\n\\t\\t\\t\\trequire double protection: (1) from the Islamic forces\\n\\t\\t\\t\\topenly fighting against their people, and (2) from their\\n\\t\\t\\t\\town people, as they detached themselves from them. Both\\n\\t\\t\\t\\tkinds of protection should be ensured for them, and they\\n\\t\\t\\t\\tshould be safely escorted to a place where they can be\\n\\t\\t\\t\\tsafe. Such persons only err through ignorance, and there\\n\\t\\t\\t\\tmay be much good in them."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "6",
    "NoteID": "1254",
    "Body": "Maaman: place or opportunity of being secure from all\\n\\t\\t\\t\\tharm."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "7",
    "NoteID": "1255",
    "Body": "In this section we have the reasons why the treaties with\\n\\t\\t\\t\\ttreacherous Pagan foes were denounced. The clause\\n\\t\\t\\t\\tintroducing the exception is a parenthetical clause. The\\n\\t\\t\\t\\tword \"Pagans\" must be connected with verse 8 which\\n\\t\\t\\t\\tfollows. In that verse the word kaifa resumes the clause\\n\\t\\t\\t\\tintroduced by the word kaifa at the beginning of verse 7.\\n\\t\\t\\t\\tThe exceptional Pagan tribes which remained true to their\\n\\t\\t\\t\\tword were the Banu Hamza and the Banu Kinana, who swore\\n\\t\\t\\t\\ttheir treaty near the Sacred Mosque and faithfully\\n\\t\\t\\t\\tobserved it. They were to be given the full benefit of\\n\\t\\t\\t\\ttheir fidelity even though their kindred tribes were\\n\\t\\t\\t\\ttreacherous."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "8",
    "NoteID": "1256",
    "Body": "The exceptions having been stated parenthetically in\\n\\t\\t\\t\\tverse 7, the indictment of the general mass of Pagan\\n\\t\\t\\t\\ttribes is now set out briefly but fully and convincingly.\\n\\t\\t\\t\\tAfter that kind of behaviour how can treaty be possible\\n\\t\\t\\t\\twith them? The counts are: (1) that whenever they got a\\n\\t\\t\\t\\tslight advantage, they disregarded the ties both of\\n\\t\\t\\t\\tkinship and of covenant as against the Muslims because of\\n\\t\\t\\t\\ttheir Faith, thus proving doubly treacherous; (2) that\\n\\t\\t\\t\\tthey spoke fair words, but had venom in their hearts; (3)\\n\\t\\t\\t\\tthat their attitude was one of rebellion against their\\n\\t\\t\\t\\tplighted word; (4) that they disregarded the solemn words\\n\\t\\t\\t\\tof Allah for some miserable worldly gain; (5) that they\\n\\t\\t\\t\\ttried to prevent other people from coming to the Way of\\n\\t\\t\\t\\tAllah. The first clause is repeated again as the last\\n\\t\\t\\t\\tclause, to emphasise their double treachery, and round\\n\\t\\t\\t\\toff the argument."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "8",
    "NoteID": "1257",
    "Body": "Among the Arabs the ties of kinship were so strong as to\\n\\t\\t\\t\\tbe almost unbreakable. The Pagan Arabs went out of their\\n\\t\\t\\t\\tway to break them in the case of the Muslims, who were\\n\\t\\t\\t\\tkith and kin to them. Besides the bond of kinship there\\n\\t\\t\\t\\twas the further bond of their plighted oath in the\\n\\t\\t\\t\\tTreaty. They broke that oath because the other parties\\n\\t\\t\\t\\twere Muslims!"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "10",
    "NoteID": "1258",
    "Body": "The catalogue of their sins being set out, it is clear\\n\\t\\t\\t\\tthat they were aggressors in the worst possible ways; and\\n\\t\\t\\t\\twar became inevitable."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "11",
    "NoteID": "1259",
    "Body": "The chance of repentance and mercy to the worst enemies\\n\\t\\t\\t\\tis again emphasised, in order that people with any\\n\\t\\t\\t\\tunderstanding may not be misled into thinking that war\\n\\t\\t\\t\\twas an easy or light matter. This emphasis is balanced by\\n\\t\\t\\t\\tthe emphasis in the next verse on the causes which made\\n\\t\\t\\t\\twar inevitable for those with any self-respect."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "12",
    "NoteID": "1260",
    "Body": "Not only did the enemies break their oaths shamelessly,\\n\\t\\t\\t\\tbut they even taunted the Muslims on their Faith and the\\n\\t\\t\\t\\t\"simple-minded\" way in which they continued to respect\\n\\t\\t\\t\\ttheir part of the treaty, as if they were afraid to\\n\\t\\t\\t\\tfight!"
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "13",
    "NoteID": "1261",
    "Body": "The argument now takes a new turn. An appeal is made to\\n\\t\\t\\t\\tthe Muslims on various grounds: (1) the shameless\\n\\t\\t\\t\\tdisregard of treaties by the enemy, (2) the under-hand\\n\\t\\t\\t\\tplots to discredit the Holy Prophet, and turn him out of\\n\\t\\t\\t\\tMadinah as he had been turned out of Makkah, (3) the\\n\\t\\t\\t\\taggressive taken by the Quraish and their confederates in\\n\\t\\t\\t\\tMadinah after the treaty of Hudaibiya (A.H. 6,\\n\\t\\t\\t\\tZul-qa'dah. Feb. 628), (4) the manly attitude that fears\\n\\t\\t\\t\\tAllah rather than men, and (5) the need to prove our\\n\\t\\t\\t\\tsincere faith by test and trial and struggle and\\n\\t\\t\\t\\tsacrifice (ix. 16)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "14",
    "NoteID": "1262",
    "Body": "Heal the breasts of believers, i.e., of wounds that they\\n\\t\\t\\t\\tmay have sustained from the assaults, taunts, and cruelty\\n\\t\\t\\t\\tof the enemy."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "15",
    "NoteID": "1263",
    "Body": "When the victory comes and the wounds are healed, a great\\n\\t\\t\\t\\tpeace comes to the hearts of those who have suffered,\\n\\t\\t\\t\\tstriven, and struggled. The fighting was necessity forced\\n\\t\\t\\t\\tby injustice and oppression. When Allah's Law is\\n\\t\\t\\t\\testablished, the fire of indignation is quelled, and the\\n\\t\\t\\t\\ttrue Peace of Islam is attained."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "15",
    "NoteID": "1264",
    "Body": "Allah's mercy is unlimited. When evil is destroyed, many\\n\\t\\t\\t\\tof those who were enticed by evil will come into the fold\\n\\t\\t\\t\\tof truth and righteousness, and the cessation of war and\\n\\t\\t\\t\\tconflict will bring peace, certainly to those who fought\\n\\t\\t\\t\\tfor the right, but also possibly to those whose eyes have\\n\\t\\t\\t\\tbeen opened to the working of Allah's Law and who in\\n\\t\\t\\t\\thealing reconciliation become members of the Brotherhood\\n\\t\\t\\t\\tof Peace in Islam."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "16",
    "NoteID": "1265",
    "Body": "We must all be tested and tried, but Allah knows our\\n\\t\\t\\t\\tinmost hearts, and He will support those who strive in\\n\\t\\t\\t\\tHis way, out of sincere love for Him, His Prophet, and\\n\\t\\t\\t\\tthe body of the true men of faith."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "17",
    "NoteID": "1266",
    "Body": "'Amara as applied to mosques implies the following ideas:\\n\\t\\t\\t\\t(1) to build or repair: (2) to maintain in fitting\\n\\t\\t\\t\\tdignity: (3) to visit for purposes of devotion: and (4)\\n\\t\\t\\t\\tfill with light and life and activity. For brevity I have\\n\\t\\t\\t\\tonly used \"maintain\" in the Translation. Before the\\n\\t\\t\\t\\tpreaching of Islam the Pagans built, repaired, and\\n\\t\\t\\t\\tmaintained the Mosque, and celebrated Pagan ceremonies in\\n\\t\\t\\t\\tit. They made an income out of it. Islam protested, and\\n\\t\\t\\t\\tthe Pagans ejected Muslims and their Leader from Makkah\\n\\t\\t\\t\\tand shut them out from the Ka'ba itself. When the Muslims\\n\\t\\t\\t\\twere strong enough to re-take Makkah (A.H. 8), they\\n\\t\\t\\t\\tpurified the Mosque and re-established the worship of the\\n\\t\\t\\t\\ttrue God. If they became Muslims, it was a different\\n\\t\\t\\t\\tmatter. The further question arose: should they be\\n\\t\\t\\t\\tallowed to visit it and practise their unseemly Pagan\\n\\t\\t\\t\\trites? Obviously this would be derogatory to the dignity\\n\\t\\t\\t\\tand honour of the Mosque, and was forbidden. This was the\\n\\t\\t\\t\\tparticular occasion to which the verse refers. The\\n\\t\\t\\t\\tgeneral deduction is clear. A house of Allah is a place\\n\\t\\t\\t\\tof sincere devotion, not a theatre for vulgar rites nor a\\n\\t\\t\\t\\tsource of worldly income. Only sincere Believers have a\\n\\t\\t\\t\\tright of entry. Who the sincere Believers are, is\\n\\t\\t\\t\\texplained in the next verse."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "18",
    "NoteID": "1267",
    "Body": "See the previous note. Sincere Believers are those who\\n\\t\\t\\t\\thave faith in Allah and the future, and have a spirit of\\n\\t\\t\\t\\tdevotion and charity-a true and abiding spirit, not\\n\\t\\t\\t\\tmerely isolated acts now and again. Moreover they must\\n\\t\\t\\t\\tnot bow to worldly greed or amibition, which produces\\n\\t\\t\\t\\tfear of worldly power."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "18",
    "NoteID": "1268",
    "Body": "Others may call themselves by what names they like. True\\n\\t\\t\\t\\tguidance is shown by the tests here indicated."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "19",
    "NoteID": "1269",
    "Body": "Giving drinks of cold water to thirsty pilgrims, and\\n\\t\\t\\t\\tdoing material services to a mosque are meritorious acts,\\n\\t\\t\\t\\tbut they are only external. If they do not touch the\\n\\t\\t\\t\\tsoul, their value is slight. Far greater, in the sight of\\n\\t\\t\\t\\tAllah, are Faith, Endeavour, and self- surrender to\\n\\t\\t\\t\\tAllah. Men who practise these will obtain honour in the\\n\\t\\t\\t\\tsight of Allah. Allah's light and guidance comes to them,\\n\\t\\t\\t\\tand not to those self-sufficient beings who think that a\\n\\t\\t\\t\\tlittle show of what the world considers piety is enough."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "20",
    "NoteID": "1270",
    "Body": "Here is a good description of Jihad. It may require\\n\\t\\t\\t\\tfighting in Allah's cause, its a form of self-sacrifice.\\n\\t\\t\\t\\tBut its essence consists in (1) a true and sincere Faith,\\n\\t\\t\\t\\twhich so fixes its gaze on Allah, that all selfish or\\n\\t\\t\\t\\tworldly motives seem paltry and fade away, and (2) an\\n\\t\\t\\t\\tearnest and ceaseless activity, involving the sacrifice\\n\\t\\t\\t\\t(if need be) of life, person, or property, in the service\\n\\t\\t\\t\\tof Allah. Mere brutal fighting is opposed to the whole\\n\\t\\t\\t\\tspirit of Jihad, while the sincere scholar's pen or\\n\\t\\t\\t\\tpreacher's voice or wealthy man's contributions may be\\n\\t\\t\\t\\tthe most valuable forms of Jihad."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "22",
    "NoteID": "1271",
    "Body": "Those who strive and suffer in Allah's cause are promised\\n\\t\\t\\t\\t(1) a mercy specially from Himself, (2) His own good\\n\\t\\t\\t\\tpleasure, (3) gardens of perpetual delight, (4) the\\n\\t\\t\\t\\tsupreme reward. Allah's own nearness. These are in\\n\\t\\t\\t\\tgradation: (1) is a special mercy, higher than flows out\\n\\t\\t\\t\\tto all creatures: (2) is a consciousness of Allah's good\\n\\t\\t\\t\\tpleasure, which raises the soul above itself: (3) is that\\n\\t\\t\\t\\tstate of permanent assurance, and (4) is the final bliss,\\n\\t\\t\\t\\twhich is the sight of Allah Himself."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "24",
    "NoteID": "1272",
    "Body": "Man's heart clings to (1) his own kith and kin-parents,\\n\\t\\t\\t\\tchildren, brothers and sisters, husbands or wives, or\\n\\t\\t\\t\\tother relatives, (2) wealth and prosperity, (3) commerce\\n\\t\\t\\t\\tor means of profit and gain, or (4) noble buildings, for\\n\\t\\t\\t\\tdignity or comfort. If these are a hindrance in Allah's\\n\\t\\t\\t\\tcause, we have to choose which we love most. We must love\\n\\t\\t\\t\\tAllah even if it involves the sacrifice of all else."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "24",
    "NoteID": "1273",
    "Body": "If we love our earthly ties and comforts , profits and\\n\\t\\t\\t\\tpleasures, more than we love Allah, and therefore fail to\\n\\t\\t\\t\\trespond to Allah's conciousness it is not Allah's cause\\n\\t\\t\\t\\twhich will suffer. Allah's purpose will be accomplished,\\n\\t\\t\\t\\twith or without us. But our failure to respond to His\\n\\t\\t\\t\\twill must leave us bereft of grace and guidance: \"for\\n\\t\\t\\t\\tAllah guides not the rebellious.\"  This is of universal\\n\\t\\t\\t\\tapplication. But it was strikingly illustrated in the\\n\\t\\t\\t\\tcase of those faithful ones who obeyed the Prophet's\\n\\t\\t\\t\\tcall, left the comfort of their homes in Makkah and\\n\\t\\t\\t\\tsuffered exile in Madinah, gave up their trade and their\\n\\t\\t\\t\\tpossessions, strove and fought for Allah's cause,\\n\\t\\t\\t\\tsometimes against their own kith and kin or their own\\n\\t\\t\\t\\ttribesmen who were enemies of Islam. They won through.\\n\\t\\t\\t\\tOthers were not prepared for such sacrifice, but their\\n\\t\\t\\t\\tfailure did not stop the accomplishment of Allah's plan\\n\\t\\t\\t\\tand purpose."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "25",
    "NoteID": "1274",
    "Body": "Hunain is on the road to Taif from Makkah about fourteen\\n\\t\\t\\t\\tmiles to the east of Makkah. It is a valley in the\\n\\t\\t\\t\\tmountainous country between Makkah and Taif. Immediately\\n\\t\\t\\t\\tafter the conquest of Makkah, (A.H. 8), the Pagan\\n\\t\\t\\t\\tidolaters, who were surprised and chagrined at the\\n\\t\\t\\t\\twonderful reception which Islam was receiving, organised\\n\\t\\t\\t\\ta great gathering near Taif to concert plans for\\n\\t\\t\\t\\tattacking the Prophet. The Hawazin and the Thaqif tribes\\n\\t\\t\\t\\ttook the lead and prepared a great expedition for Makkah,\\n\\t\\t\\t\\tboasting of their strength and military skill. There was\\n\\t\\t\\t\\ton the other hand a wave of confident enthusiasm among\\n\\t\\t\\t\\tthe Muslims at Makkah, in which the new Muslims joined.\\n\\t\\t\\t\\tThe enemy forces numbered about 4,000 but the Muslim\\n\\t\\t\\t\\tforce reached a total of ten or twelve thousand, as every\\n\\t\\t\\t\\tone wished to join. The battle was joined at Hunain, as\\n\\t\\t\\t\\tdescribed in the next note."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "25",
    "NoteID": "1275",
    "Body": "For the first time the Muslims had at Hunain tremendous\\n\\t\\t\\t\\todds in their favour. But this itself constituted a\\n\\t\\t\\t\\tdanger. Many in their ranks had more enthusiasm than\\n\\t\\t\\t\\twisdom, more a spirit of elation than of faith and\\n\\t\\t\\t\\tconfidence in the righteousness of their cause. The enemy\\n\\t\\t\\t\\thad the advantage of knowing the ground thoroughly. They\\n\\t\\t\\t\\tlaid an ambush in which the advance guard of the Muslim\\n\\t\\t\\t\\tforces was caught. The country is hilly, in which the\\n\\t\\t\\t\\tenemy concealed himself. As soon as the Muslim vanguard\\n\\t\\t\\t\\tentered the Hunain valley, the enemy fell upon them with\\n\\t\\t\\t\\tfury and caused havoc with their arrows from their places\\n\\t\\t\\t\\tof concealment. In such ground the numbers of the Muslims\\n\\t\\t\\t\\twere themselves a disadvantage. Many were slain, and many\\n\\t\\t\\t\\tturned back in confusion and retreat. But the Prophet, as\\n\\t\\t\\t\\tever, was calm in his wisdom and faith. He rallied his\\n\\t\\t\\t\\tforces and inflicted the most crushing defeat on the\\n\\t\\t\\t\\tenemy."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "26",
    "NoteID": "1276",
    "Body": "Sakina: calm, peace, security, tranquillity. Cf. ii. 248.\\n\\t\\t\\t\\tThe Prophet never approved of over-weening confidence, or\\n\\t\\t\\t\\treliance merely upon human strength, or human resources\\n\\t\\t\\t\\tor numbers. In the hour of danger and seeming disaster,\\n\\t\\t\\t\\the was perfectly calm, and with cool courage relied upon\\n\\t\\t\\t\\tthe help of Allah, Whose standard he carried. His\\n\\t\\t\\t\\tcalmness inspired all around him, and stopped the rout of\\n\\t\\t\\t\\tthose who had turned their backs. It was with Allah's\\n\\t\\t\\t\\thelp that they won, and their victory was complete. They\\n\\t\\t\\t\\tfollowed it up with an energetic pursuit of the enemies,\\n\\t\\t\\t\\tcapturing their camps, their flocks and herds, and their\\n\\t\\t\\t\\tfamilies, whom they had boastfully brought with them in\\n\\t\\t\\t\\texpectation of an easy victory."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "27",
    "NoteID": "1277",
    "Body": "Examples of Allah's mercy and grace in difficult\\n\\t\\t\\t\\tcircumstances in one case illustrate His grace and mercy\\n\\t\\t\\t\\tat all times to those who have faith."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "28",
    "NoteID": "1278",
    "Body": "Unclean: because Muslims are enjoined to be strict in\\n\\t\\t\\t\\tcleanliness, as well as in purity of mind and heart, so\\n\\t\\t\\t\\tthat their word can be relied upon."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "28",
    "NoteID": "1279",
    "Body": "This year of theirs: there is a two-fold meaning: (1) now\\n\\t\\t\\t\\tthat you have complete control of Makkah and are, charged\\n\\t\\t\\t\\twith the purity of worship there, shut out all impurity\\n\\t\\t\\t\\tfrom this year: (2) you have seen how the Pagans have\\n\\t\\t\\t\\tbehaved this year; their year of power and misuse of that\\n\\t\\t\\t\\tpower may be called their year; it is over, and now you\\n\\t\\t\\t\\tMuslims are responsible."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "28",
    "NoteID": "1280",
    "Body": "The concourse in Makkah added to the profits of trade and\\n\\t\\t\\t\\tcommerce. \"But fear not,\" we are told: \"the Pagans are a\\n\\t\\t\\t\\twaning power, bound to disappear, and you should\\n\\t\\t\\t\\tstrengthen your own community, that they may more than\\n\\t\\t\\t\\tcounter-balance the apparent loss of custom; and Allah\\n\\t\\t\\t\\thas other means of improving your economic position.\"\\n\\t\\t\\t\\tThis actually happened. The Pagans were extinguished from\\n\\t\\t\\t\\tArabia, and the concourse of pilgrims from all parts of\\n\\t\\t\\t\\tthe world increased the numbers more than a hundred-fold.\\n\\t\\t\\t\\tHere is commonsense, wisdom, and statesmanship, even if\\n\\t\\t\\t\\twe look at it from a purely human point of view."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "29",
    "NoteID": "1281",
    "Body": "Jizya: the root meaning is compensation. The derived\\n\\t\\t\\t\\tmeaning, which became the technical meaning, was a\\n\\t\\t\\t\\tpoll-tax levied from those who did not accept Islam, but\\n\\t\\t\\t\\twere willing to live under the protection of Islam, and\\n\\t\\t\\t\\twere thus tacitly willing to submit to its ideals being\\n\\t\\t\\t\\tenforced in the Muslim State. There was no amount\\n\\t\\t\\t\\tpermanently fixed for it. It was in acknowledgment that\\n\\t\\t\\t\\tthose whose religion was tolerated would in their turn\\n\\t\\t\\t\\tnot interfere with the preaching and progress of Islam.\\n\\t\\t\\t\\tImam Shafi'i suggests one dinar per year, which would be\\n\\t\\t\\t\\tthe Arabian gold dinar of the Muslim States. The tax\\n\\t\\t\\t\\tvaried in amount, and there were exemptions for the poor,\\n\\t\\t\\t\\tfor females and children (according to Abu Hanifa), for\\n\\t\\t\\t\\tslaves, and for monks and hermits. Being a tax on\\n\\t\\t\\t\\table-bodied males of military age, it was in a sense a\\n\\t\\t\\t\\tcommutation for military service. But see the next note."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "29",
    "NoteID": "1282",
    "Body": "'An Yadin (literally, from the hand) has been variously\\n\\t\\t\\t\\tinterpreted. The hand being the symbol of power and\\n\\t\\t\\t\\tauthority. I accept the interpretation \"in token of\\n\\t\\t\\t\\twilling submission.\" The Jizya was thus partly symbolic\\n\\t\\t\\t\\tand partly a commutation for military service, but as the\\n\\t\\t\\t\\tamount was insignificant and the exemptions numerous, its\\n\\t\\t\\t\\tsymbolic character predominated. See the last note."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "30",
    "NoteID": "1283",
    "Body": "In n. 718 to v. 18, 1 have quoted passages from the Old\\n\\t\\t\\t\\tTestament, showing how freely the expression \"sons of\\n\\t\\t\\t\\tAllah\" was used by the Jews. A sect of them called 'Uzair\\n\\t\\t\\t\\ta son of Allah, according to Baidhawl. In Appendix II\\n\\t\\t\\t\\t(Sura v.) I have shown that the constitution of Judaism\\n\\t\\t\\t\\tdates from 'Uzair (Ezra). The Christians still call\\n\\t\\t\\t\\tChrist the Son of Allah."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "30",
    "NoteID": "1284",
    "Body": "Taking men for gods or sons of Allah was not a new thing.\\n\\t\\t\\t\\tAll ancient mythologies have fables of that kind. There\\n\\t\\t\\t\\twas less excuse for such blasphemies after the Prophets\\n\\t\\t\\t\\tof Allah had clearly explained out true relation to Allah\\n\\t\\t\\t\\tthan in the times of primitive ignorance and\\n\\t\\t\\t\\tsuperstition."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "30",
    "NoteID": "1285",
    "Body": "Cf. v. 75."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "31",
    "NoteID": "1286",
    "Body": "Ahbar: doctors of law; priests; learned men. Cf. v. 44.\\n\\t\\t\\t\\twhere they are associated with Rabbis. Ruhban: monks,\\n\\t\\t\\t\\tascetics, anchorites, men who have renounced the world;\\n\\t\\t\\t\\twhere there is a celibate clergy, the term can be applied\\n\\t\\t\\t\\tto them as well as to members of monastic orders. It is\\n\\t\\t\\t\\talso permissible to apply the term to \"saints\", where\\n\\t\\t\\t\\tthey are deified or credited with divine powers, or where\\n\\t\\t\\t\\tpeople pray to them as they do in the Roman Catholic\\n\\t\\t\\t\\tChurch."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "31",
    "NoteID": "1287",
    "Body": "Priest worship, and the worship of saints and ascetics is\\n\\t\\t\\t\\ta form of superstition to which men have been prone in\\n\\t\\t\\t\\tall ages. The growth of Jewish superstition is shown in\\n\\t\\t\\t\\tthe Talmud, and of Christian superstition in the doctrine\\n\\t\\t\\t\\tof papal infallibility and the worship of saints. The\\n\\t\\t\\t\\tmere idea of a separate order of priesthood to stand\\n\\t\\t\\t\\tbetween Allah and man and be the exclusive repository of\\n\\t\\t\\t\\tAllah's secrets is derogatory to the goodness and\\n\\t\\t\\t\\tall-pervading grace of Allah. The worship of  \"lords many\\n\\t\\t\\t\\tand gods many\" was not confined only to the Pagans. The\\n\\t\\t\\t\\tdeification of the son of Mary is put here in a special\\n\\t\\t\\t\\tclause by itself, as it held (and still holds) in its\\n\\t\\t\\t\\tthrall a large portion of civilised humanity."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "31",
    "NoteID": "1288",
    "Body": "Cf. vi. 100."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "32",
    "NoteID": "1289",
    "Body": "With their mouths: there is a twofold meaning: (1) the\\n\\t\\t\\t\\told-fashioned open oil lamps were extinguished by blowing\\n\\t\\t\\t\\twith the mouth; the Unbelievers would like to blow out\\n\\t\\t\\t\\tAllah's Light as it is a cause of offence to them; (2)\\n\\t\\t\\t\\tfalse teachers and preachers distort the Message of Allah\\n\\t\\t\\t\\tby the false words of their mouth. Their wish is to put\\n\\t\\t\\t\\tout the light of Truth for they are people of darkness;\\n\\t\\t\\t\\tbut Allah will perfect His Light, i.e., make it shine all\\n\\t\\t\\t\\tthe brighter in the eyes of men. His Light in itself is\\n\\t\\t\\t\\tever perfect, but it will penetrate the hearts of men\\n\\t\\t\\t\\tmore and more, and so become more and more perfect for\\n\\t\\t\\t\\tthem."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "33",
    "NoteID": "1290",
    "Body": "Every religion which commends itself widely to human\\n\\t\\t\\t\\tbeings and lasts through some space of time has a glimpse\\n\\t\\t\\t\\tof Truth in it. But Islam being the perfect light of\\n\\t\\t\\t\\tTruth is bound to prevail. As the greater Light, through\\n\\t\\t\\t\\tits own strength, outshines all lesser lights, so will\\n\\t\\t\\t\\tIslam outshine all else, in spite of the displeasure of\\n\\t\\t\\t\\tthose to whom light is an offence. See also xlviii. 28,\\n\\t\\t\\t\\tn. 4912, and lxi. 9, n. 5442."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "34",
    "NoteID": "1291",
    "Body": "Bil-batili = in falsehood, i.e., by false means,\\n\\t\\t\\t\\tpretences, or in false or vain things. This was\\n\\t\\t\\t\\tstrikingly exemplified in the history of Mediaeval\\n\\t\\t\\t\\tEurope. Though the disease is apt to attack all peoples\\n\\t\\t\\t\\tand organisations at all times. Priests got rich by\\n\\t\\t\\t\\tissuing indulgences and dispensations; they made their\\n\\t\\t\\t\\toffice a stepping stone to worldly power and possessions.\\n\\t\\t\\t\\tEven the Monastic Orders, which took vows of poverty for\\n\\t\\t\\t\\tindividuals grew rich with corporate property, until\\n\\t\\t\\t\\ttheir wealth became a scandal, even among their own\\n\\t\\t\\t\\tnations."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "34",
    "NoteID": "1292",
    "Body": "Misuse of wealth, property, and resources is frequently\\n\\t\\t\\t\\tcondemned, and in three ways: (1) do not acquire anything\\n\\t\\t\\t\\twrongfully or on false pretences; (2) do not hoard or\\n\\t\\t\\t\\tbury or amass wealth for its own sake but use it freely\\n\\t\\t\\t\\tfor good, whether for yourself or for your neighbours;\\n\\t\\t\\t\\tand (3) be particularly careful not to waste it for idle\\n\\t\\t\\t\\tpurposes, but only so that it may fructify for the good\\n\\t\\t\\t\\tof the people."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "35",
    "NoteID": "1293",
    "Body": "Gold and silver, symbolising wealth which these people\\n\\t\\t\\t\\tcherished even more than the good pleasure of their Lord,\\n\\t\\t\\t\\twill not only be the cause but the instrument whereby\\n\\t\\t\\t\\tthey would receive a grievous punishment."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "35",
    "NoteID": "1294",
    "Body": "The voice enforces the moral: \"did you expect\\n\\t\\t\\t\\tsatisfaction or salvation from the treasures that you\\n\\t\\t\\t\\tmisused? Behold! they add to your torment!\""
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "36",
    "NoteID": "1295",
    "Body": "This and the following verse must be read together. They\\n\\t\\t\\t\\tcondemn the arbitrary and selfish conduct of the Pagan\\n\\t\\t\\t\\tArabs, who, because there was a long-established custom\\n\\t\\t\\t\\tof observing four months as those in which fighting was\\n\\t\\t\\t\\tforbidden, changed the months about or added or deducted\\n\\t\\t\\t\\tmonths when it suited them, to get an unfair advantage\\n\\t\\t\\t\\tover the enemy. The four Prohibited Months were:\\n\\t\\t\\t\\tZul-qa'dah, Zul- hijjah, Muharram, and Rajab. If it\\n\\t\\t\\t\\tsuited them they postponed one of these months, and so a\\n\\t\\t\\t\\tprohibited month became an ordinary month: while their\\n\\t\\t\\t\\topponents might hesitate to fight, they got an undue\\n\\t\\t\\t\\tadvantage. It also upset the security of the Month of\\n\\t\\t\\t\\tPilgrimage. This very ancient usage made for fair dealing\\n\\t\\t\\t\\tall round, and its infraction by the Pagans is condemned.\\n\\t\\t\\t\\tThe question of a solar astronomical year as against the\\n\\t\\t\\t\\tlunar Islamic year does not arise here. But it may be\\n\\t\\t\\t\\tnoted that the Arab year was roughly luni solar like the\\n\\t\\t\\t\\tHindu year, the months being lunar and the intercalation\\n\\t\\t\\t\\tof a month every three years brought the year nearly but\\n\\t\\t\\t\\tnot accurately up to the solar reckoning. From the year\\n\\t\\t\\t\\tof the Farewell Pilgrimage (A.H.10) the Islamic year was\\n\\t\\t\\t\\tdefinitely fixed as a purely lunar year of roughly 354\\n\\t\\t\\t\\tdays, the months being calculated by the actual\\n\\t\\t\\t\\tappearance of the moon. After that, every month of the\\n\\t\\t\\t\\tIslamic year came about 11 days earlier in the solar\\n\\t\\t\\t\\tyear, and thus the Islamic months travelled all round the\\n\\t\\t\\t\\tseasons and the solar year."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "36",
    "NoteID": "1296",
    "Body": "The Muslims were at a disadvantage on account of their\\n\\t\\t\\t\\tscruples about the Prohibited Months. They are told not\\n\\t\\t\\t\\tto wrong themselves in this. If the Pagans fought in all\\n\\t\\t\\t\\tmonths on one pretence or another, they were allowed to\\n\\t\\t\\t\\tdefend themselves in all months. But self-restraint was\\n\\t\\t\\t\\t(as always) recommended as far as possible."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "37",
    "NoteID": "1297",
    "Body": "To meddle with an old-established custom of close time\\n\\t\\t\\t\\tfor warfare during Prohibited or Sacred Months was not\\n\\t\\t\\t\\tonly a demonstration of the Unbelievers against the\\n\\t\\t\\t\\tMuslims on account of their Faith, but was wrong and\\n\\t\\t\\t\\tunjust in itself, as it abolished a wholesome check on\\n\\t\\t\\t\\tunregulated warfare, and prejudiced the law-abiding side\\n\\t\\t\\t\\tby arbitrary decisions."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "37",
    "NoteID": "1298",
    "Body": "Cf. vi. 122. The lawless man thinks he is doing a great\\n\\t\\t\\t\\tthing in getting the better of those who are careful to\\n\\t\\t\\t\\tobserve a law they believe in. But the lawless man loses\\n\\t\\t\\t\\tthe guidance of Faith he will therefore lose in the end."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "38",
    "NoteID": "1299",
    "Body": "The immediate reference is to the expeditions to Tabuk\\n\\t\\t\\t\\t(A.H. 9), for which see the Introduction to this Sura.\\n\\t\\t\\t\\tBut the lesson is perfectly general. When a call is made\\n\\t\\t\\t\\ton behalf of a great cause, the fortunate ones are those\\n\\t\\t\\t\\twho have the privilege of responding to the call. The\\n\\t\\t\\t\\tunfortunate ones are those who are so engrossed in their\\n\\t\\t\\t\\tparochial affairs that they turn a deaf ear to the\\n\\t\\t\\t\\tappeal. They are suffering from a spiritual disease."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "38",
    "NoteID": "1300",
    "Body": "The choice is between two courses: will you choose a\\n\\t\\t\\t\\tnoble adventure and the glorious privilege of following\\n\\t\\t\\t\\tyour spiritual leader, or grovel in the earth for some\\n\\t\\t\\t\\tsmall worldly gain or for fear of worldly loss? The\\n\\t\\t\\t\\tpeople who hesitated to follow the call of Tabuk were\\n\\t\\t\\t\\tdeterred by (1) the heat of the summer, in which the\\n\\t\\t\\t\\texpedition was undertaken on account of the threat to the\\n\\t\\t\\t\\texistence of the little community, and (2) the fear of\\n\\t\\t\\t\\tlosing the fruit harvest, which was ripe for gathering."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "39",
    "NoteID": "1301",
    "Body": "Tanfiru= go forth, march onward, be ready to strive and\\n\\t\\t\\t\\tsuffer. For this is the condition of all progress in the\\n\\t\\t\\t\\tspiritual and moral, as well as in the physical, world.\\n\\t\\t\\t\\tAccording to the homely English proverb, God helps those\\n\\t\\t\\t\\twho help themselves. Inactivity and lethargy are fatal.\\n\\t\\t\\t\\tNo one can rest on his oars. Man is not necessary to\\n\\t\\t\\t\\tAllah, but Allah is necessary to man. If a nation\\n\\t\\t\\t\\treceives favours and fails to deserve them, it will be\\n\\t\\t\\t\\treplaced by another: as has so often happened in history.\\n\\t\\t\\t\\tWe may take this as a special warning to Islamic nations."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "1302",
    "Body": "The Tabuk expedition was not a failure. Though some\\n\\t\\t\\t\\thesitated, many more joined in. But a more striking\\n\\t\\t\\t\\texample was when the Prophet was hunted out of Makkah and\\n\\t\\t\\t\\tperformed his famous Hijrat. His enemies plotted for his\\n\\t\\t\\t\\tlife. He had already sent his followers on to Madinah.\\n\\t\\t\\t\\tAli had volunteered to face his enemies in his house. His\\n\\t\\t\\t\\tsingle companion was Abu Bakr. They two concealed\\n\\t\\t\\t\\tthemselves in the cave of Thaur, three miles from Makkah,\\n\\t\\t\\t\\tfor three nights, with the enemy prowling around in great\\n\\t\\t\\t\\tnumbers in fruitless search of them. \"We are but two,\"\\n\\t\\t\\t\\tsaid Abu Bakr. \"Nay,\" said Muhammad, \"for Allah is with\\n\\t\\t\\t\\tus.\" Faith gave their minds peace, and Allah gave them\\n\\t\\t\\t\\tsafety. They reached Madinah, and a glorious chapter\\n\\t\\t\\t\\topened for Islam. The forces that helped them were not\\n\\t\\t\\t\\tseen, but their power was irresistible."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "1303",
    "Body": "\"The second of two,\" which afterwards became Abu Bakr's\\n\\t\\t\\t\\tproud title."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "1304",
    "Body": "Cf. ix. 26."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "40",
    "NoteID": "1305",
    "Body": "The superlatives in the Arabic I have rendered by the\\n\\t\\t\\t\\tperiphrasis, \"humbled to the depths\" and \"exalted to the\\n\\t\\t\\t\\theights,\" as they accord better with the genius of the\\n\\t\\t\\t\\tEnglish language. The enemies of Islam had boasted that\\n\\t\\t\\t\\tthey would root it out: the result showed them up as\\n\\t\\t\\t\\tridiculous and despicable."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "41",
    "NoteID": "1306",
    "Body": "Whether equipped lightly or heavily: to be taken both\\n\\t\\t\\t\\tliterally and metaphorically. All were invited, and they\\n\\t\\t\\t\\twere to bring such resources as they had, light- armed or\\n\\t\\t\\t\\theavy-armed, on foot or mounted, experienced men for\\n\\t\\t\\t\\tposts of danger, raw men for duties for which they were\\n\\t\\t\\t\\tfit. All would and should help. Even those who were too\\n\\t\\t\\t\\told or feeble to go could contribute such money or\\n\\t\\t\\t\\tresources as they had."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "42",
    "NoteID": "1307",
    "Body": "The arts and excuses of the Hypocrites are here exposed.\\n\\t\\t\\t\\tIf there had been booty in sight or an easy walk-over,\\n\\t\\t\\t\\tthey would have come. All their oaths are false, and in\\n\\t\\t\\t\\ttaking the false oaths they are destroying their\\n\\t\\t\\t\\tspiritual life. Indeed the backsliders are jeopardising\\n\\t\\t\\t\\ttheir own physical lives in hanging back. If the enemy\\n\\t\\t\\t\\tsucceeded, they would all suffer."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "43",
    "NoteID": "1308",
    "Body": "Literally, \"Allah give thee forgiveness!\" But there is no\\n\\t\\t\\t\\tquestion of fault here, and Imam Razi understands the\\n\\t\\t\\t\\texpression to mean an exclamation,-as one might say in\\n\\t\\t\\t\\tEnglish, \"God bless you!\" In Shakespeare \"God save you!\"\\n\\t\\t\\t\\tis a simple friendly greeting, without any question of\\n\\t\\t\\t\\tdanger: e.g., in \"Much Ado about Nothing.\" iii. 2, 82.\\n\\t\\t\\t\\tNote that in 0. iii. 152, last clause, \"forgiveness\" is\\n\\t\\t\\t\\tput in juxtaposition to \"grace\" as having closely allied\\n\\t\\t\\t\\tmeanings. What the Holy Prophet had done in the Tabuk\\n\\t\\t\\t\\texpedition was that he had been granting exemptions which\\n\\t\\t\\t\\tmay appear from a military point of view too liberal. He\\n\\t\\t\\t\\twas not actuated by motives of kindness as well as\\n\\t\\t\\t\\tpolicy:- kindness, because, in the urgency of the moment\\n\\t\\t\\t\\the did not wish any one who had a real excuse to be\\n\\t\\t\\t\\trefused exemption: and policy, because, if any one did\\n\\t\\t\\t\\tnot come with hearty good-will, he would be a burden\\n\\t\\t\\t\\tinstead of a help to the army. The policy was justified,\\n\\t\\t\\t\\tbecause in fact 30,000 men or more followed him. But that\\n\\t\\t\\t\\tdid not in any way justify the slackers, and in a review\\n\\t\\t\\t\\tof the position, the slackers and hypocrites are justly\\n\\t\\t\\t\\tcondemned."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "45",
    "NoteID": "1309",
    "Body": "Doubt takes away all stability of conduct, while Faith\\n\\t\\t\\t\\tmakes a man firm in action and cool and collected in\\n\\t\\t\\t\\tmind."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "47",
    "NoteID": "1310",
    "Body": "Khilal has more than one meaning, but I follow the\\n\\t\\t\\t\\tinterpretation of Ragib and the majority of accepted\\n\\t\\t\\t\\tCommentators, who take it to mean \"in your midst\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "48",
    "NoteID": "1311",
    "Body": "Evil plotters against Truth are only too glad to get an\\n\\t\\t\\t\\topportunity of meddling from within with affairs which\\n\\t\\t\\t\\tthey want to spoil or upset. They plot from outside, but\\n\\t\\t\\t\\tthey like to get into the inner circle, that their\\n\\t\\t\\t\\tchances of intrigue may be all the greater. They are,\\n\\t\\t\\t\\thowever, unwilling to incur any danger or any\\n\\t\\t\\t\\tself-sacrifice. Their whole activities are directed to\\n\\t\\t\\t\\tmischief. Great wisdom is required in a leader to deal\\n\\t\\t\\t\\twith such a situation, and the best of such leaders must\\n\\t\\t\\t\\tneed divine guidance, as was forthcoming in this case."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "49",
    "NoteID": "1312",
    "Body": "Fitnat, as explained in n. 1198, viii. 25, may mean\\n\\t\\t\\t\\teither trial or temptation, or else tumult, turmoil, or\\n\\t\\t\\t\\tsedition. The Commentators here take the former meaning,\\n\\t\\t\\t\\tand explain that some Hypocrites claimed exemption from\\n\\t\\t\\t\\tservice in the Tabuk expedition in the direction of Syria\\n\\t\\t\\t\\ton the plea that they could not withstand the charms of\\n\\t\\t\\t\\tSyrian women and ought best to stay at home. The answer\\n\\t\\t\\t\\tis: \"But you have already fallen into temptation here by\\n\\t\\t\\t\\trefusing service and disobeying the call.\" But perhaps\\n\\t\\t\\t\\tthe other meaning of \"turmoil\" may also be permissible as\\n\\t\\t\\t\\ta secondary echo; in that case they object to be drawn\\n\\t\\t\\t\\tinto the turmoil of war, but they are told that they are\\n\\t\\t\\t\\talready in a moral turmoil in advancing a disingenuous\\n\\t\\t\\t\\tplea. In using the English word \"trial\" in the\\n\\t\\t\\t\\ttranslation, I have also had in my mind the two shades of\\n\\t\\t\\t\\tmeaning associated with that word in English."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "52",
    "NoteID": "1313",
    "Body": "The waiting of the Unbelievers and that of the Believers\\n\\t\\t\\t\\tare in different senses. The Unbelievers wish for\\n\\t\\t\\t\\tdisaster to the Believers, but the Believers will either\\n\\t\\t\\t\\tconquer or die as martyrs in the Cause, in either case\\n\\t\\t\\t\\thappy in the issue. The Believers expect punishment for\\n\\t\\t\\t\\tthe Unbelievers for their infidelity, either through\\n\\t\\t\\t\\ttheir own instrumentality, or in some other way in\\n\\t\\t\\t\\tAllah's Plan, and the Unbelievers would not like it in\\n\\t\\t\\t\\teither case. Cf. vi. 158."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "53",
    "NoteID": "1314",
    "Body": "The Hypocrites, who secretly plotted against Islam, might\\n\\t\\t\\t\\tsometimes (and they did) make a show of making some\\n\\t\\t\\t\\tcontribution to the Cause in order to keep up their\\n\\t\\t\\t\\tpretence. Their contributions were not acceptable,\\n\\t\\t\\t\\twhether they seemed to give willingly or unwillingly,\\n\\t\\t\\t\\tbecause rebellion and disobedience were in their hearts.\\n\\t\\t\\t\\tThree reasons are specifically given for their rejection,\\n\\t\\t\\t\\tin the next verse: (1) they did not believe; (2) their\\n\\t\\t\\t\\tprayers were not earnest, but for mere show: and (3) in\\n\\t\\t\\t\\treality their hearts were not behind the contributions\\n\\t\\t\\t\\twhich they offered. Nothing is acceptable to Allah which\\n\\t\\t\\t\\tdoes not proceed from a pure and sincere heart."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "55",
    "NoteID": "1315",
    "Body": "If they appeared to be prosperous, with their purses and\\n\\t\\t\\t\\ttheir quivers full (metaphorically), they were not to be\\n\\t\\t\\t\\tenvied. In reality their wealth and their sons might\\n\\t\\t\\t\\tthemselves be a snare: Cf. viii. 28. On this particular\\n\\t\\t\\t\\toccasion this was proved to the hilt. The wealth of the\\n\\t\\t\\t\\tPagans filled them with pride, darkened their\\n\\t\\t\\t\\tunderstanding, and led to their destruction. Their sons\\n\\t\\t\\t\\tand followers adopted the Faith which their fathers had\\n\\t\\t\\t\\tfought against, much to the chagrin of the fathers, whose\\n\\t\\t\\t\\tspiritual death was even worse than their discomfiture in\\n\\t\\t\\t\\tthis world."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "55",
    "NoteID": "1316",
    "Body": "Cf. iii. 176-178."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "57",
    "NoteID": "1317",
    "Body": "Jamaha = to be ungovernable, to run like a runaway horse,\\n\\t\\t\\t\\tto rush madly and obstinately."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "58",
    "NoteID": "1318",
    "Body": "Sadaqa = alms, that which is given in Allah's name,\\n\\t\\t\\t\\tmainly to the poor and needy, and for the cognate\\n\\t\\t\\t\\tpurposes specified in the next verse but one: Zakat is\\n\\t\\t\\t\\tthe regular and obligatory charity in an organised Muslim\\n\\t\\t\\t\\tcommunity, usually 2 1/2 per cent, of merchandise and 10\\n\\t\\t\\t\\tper cent, on the fruits of the earth. There is a vast\\n\\t\\t\\t\\tbody of literature on this subject. The main points may\\n\\t\\t\\t\\tbe studied in the Hidaya tilfuru of Shaikh Burhanud-din\\n\\t\\t\\t\\t'All. As against zakat the term sadaqah has a much wider\\n\\t\\t\\t\\tconnotation, and is inclusive of zakat as in the verse 60\\n\\t\\t\\t\\tof this Sura."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "59",
    "NoteID": "1319",
    "Body": "Selfish men think that charitable funds are fair game for\\n\\t\\t\\t\\traids, but the Islamic standards on this subject are very\\n\\t\\t\\t\\thigh. The enforcement of such standards is always\\n\\t\\t\\t\\tunpopular, and even the Holy Prophet was subjected to\\n\\t\\t\\t\\tobloquy and slander for his strictness to principle. In\\n\\t\\t\\t\\tdoubtful cases, claimants who are disappointed should not\\n\\t\\t\\t\\tblame the principles or those who enforce them, but put\\n\\t\\t\\t\\ttheir trust in Allah, whose bounties are unbounded, and\\n\\t\\t\\t\\tare given to all, whether rich or poor, according to\\n\\t\\t\\t\\ttheir needs and their deserts. For every one it is\\n\\t\\t\\t\\texcellent advice to say: deserve before you desire."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "60",
    "NoteID": "1320",
    "Body": "Alms or charitable gifts are to be given to the poor and\\n\\t\\t\\t\\tthe needy and those who are employed in their service.\\n\\t\\t\\t\\tThat is, charitable funds are not to be diverted to other\\n\\t\\t\\t\\tuses, but the genuine expenses of administering charity\\n\\t\\t\\t\\tare properly chargeable to such funds. Who are the needy?\\n\\t\\t\\t\\tBesides the ordinary indigent, there are certain classes\\n\\t\\t\\t\\tof people whose need is great and should be relieved.\\n\\t\\t\\t\\tThose mentioned here are: (1) men who have been weaned\\n\\t\\t\\t\\tfrom hostility to Truth, who would probably be persecuted\\n\\t\\t\\t\\tby their former associates, and require assistance until\\n\\t\\t\\t\\tthey establish new connections in their new environment:\\n\\t\\t\\t\\t(2) those in bondage, literally and figuratively:\\n\\t\\t\\t\\tcaptives of war must be redeemed: slaves should be helped\\n\\t\\t\\t\\tto freedom-, those in the bondage of ignorance or\\n\\t\\t\\t\\tsuperstition or unfavourable environment should be helped\\n\\t\\t\\t\\tto freedom to develop their own gifts: (3) those who are\\n\\t\\t\\t\\theld in the grip of debt should be helped to economic\\n\\t\\t\\t\\tfreedom: (4) those who are struggling and striving in\\n\\t\\t\\t\\tAllah's Cause by teaching or fighting or in duties\\n\\t\\t\\t\\tassigned to them by the Islamic State, who are thus\\n\\t\\t\\t\\tunable to earn their ordinary living: and (5) strangers\\n\\t\\t\\t\\tstranded on the way. All these have a claim to charity.\\n\\t\\t\\t\\tThey should be relieved by individual or organised\\n\\t\\t\\t\\teffort, but in a responsible way. In this verse, the word\\n\\t\\t\\t\\tsadaqat refers to obligatory charity (zakat). See n. 1318\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "61",
    "NoteID": "1321",
    "Body": "The assonance of the Arabic words \"Y-zuna\" and \"uzunun\"\\n\\t\\t\\t\\tis of course lost in the Translation. But the sense\\n\\t\\t\\t\\tremains. Detractors of the Prophet said. \"O! he listens\\n\\t\\t\\t\\tto everybody!\" \"Yes,\" is the answer, \"he listens for\\n\\t\\t\\t\\ttheir good: he is a mercy and a blessing to all men of\\n\\t\\t\\t\\tFaith, but specially to you (who are addressed).\" The\\n\\t\\t\\t\\tgeneral statement is emphasised for the particular people\\n\\t\\t\\t\\taddressed."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "64",
    "NoteID": "1322",
    "Body": "The dissection of the motives of the Hypocrites alarmed\\n\\t\\t\\t\\tthem. For it meant that they would fail in their policy\\n\\t\\t\\t\\tof having the best of both worlds and undermining the\\n\\t\\t\\t\\tloyalty of the weaker members of the Muslim community. So\\n\\t\\t\\t\\tthey turn it off as a jest. But they are sharply rebuked:\\n\\t\\t\\t\\t\"Can you make such solemn matters subjects of playful\\n\\t\\t\\t\\tjokes? Fie upon you! You are found out, and your guile is\\n\\t\\t\\t\\tof no effect.\""
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "66",
    "NoteID": "1323",
    "Body": "See last note. Hypocrisy is a half-way house, a state of\\n\\t\\t\\t\\tindecision in the choice between good and evil. Those who\\n\\t\\t\\t\\tdefinitely range themselves with good obtain forgiveness:\\n\\t\\t\\t\\tthose who pass definitely to evil suffer the penalties of\\n\\t\\t\\t\\tevil."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "67",
    "NoteID": "1324",
    "Body": "Literally, \"the Hypocrites... are of each other\". The\\n\\t\\t\\t\\tforms of hypocrisy may vary, but they are all alike, and\\n\\t\\t\\t\\tthey understand each other's hypocrisy. They hold\\n\\t\\t\\t\\ttogether."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "67",
    "NoteID": "1325",
    "Body": "The English phrase \"close-fisted\" would cover only a part\\n\\t\\t\\t\\tof the meaning. The hand is the symbol of power, help,\\n\\t\\t\\t\\tand assistance. This may be financial, or it may be in\\n\\t\\t\\t\\tother ways. The Hypocrites pretend a great deal, but are\\n\\t\\t\\t\\tof no use or real help to any one."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "67",
    "NoteID": "1326",
    "Body": "Cf. vii. 51. and n. 1029. They ignore Allah: and Allah\\n\\t\\t\\t\\twill ignore them."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "68",
    "NoteID": "1327",
    "Body": "\"Curse,\" here as elsewhere, is deprivation of grace and\\n\\t\\t\\t\\tmercy, brought about by the rejection of Allah by the\\n\\t\\t\\t\\tUnbelievers."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "70",
    "NoteID": "1328",
    "Body": "The story of Noah is told in vii. 59-64: of 'Ad in vii.\\n\\t\\t\\t\\t65-72; and of Thamud in vii. 73-79; of Abraham in\\n\\t\\t\\t\\tnumerous places, but see specially vi. 74-82; of\\n\\t\\t\\t\\tMidianites in vii. 85-93; and of Lot and the Cities of\\n\\t\\t\\t\\tthe Plain overthrown for their wickedness, in vii. 80-84."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "70",
    "NoteID": "1329",
    "Body": "In the case of Noah and Abraham, the word I have\\n\\t\\t\\t\\ttranslated as \"people of...\" is qaum: these prophets were\\n\\t\\t\\t\\tmessengers each to his own people or nation, as was also\\n\\t\\t\\t\\tHud to the 'Ad people and Salih to the Thamud people. The\\n\\t\\t\\t\\tword used for the Midianities is As-hab-i-Madyan, which I\\n\\t\\t\\t\\thave translated \"men of Midian\" for want of a better\\n\\t\\t\\t\\tword. The Midianites were for the greater part of their\\n\\t\\t\\t\\thistory nomads, with pasture grounds but no settled\\n\\t\\t\\t\\tterritory or town. The town of Madyan on the Gulf of\\n\\t\\t\\t\\t'Aqaba refers to much later times when the Midianites as\\n\\t\\t\\t\\ta people had ceased to count. See n. 1053 to vii, 85."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "70",
    "NoteID": "1330",
    "Body": "The Cities of Plain, Sodom and Gomorrah, to whom Lot\\n\\t\\t\\t\\tpreached in vain to desist from their abominations: vii.\\n\\t\\t\\t\\t80-84."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "74",
    "NoteID": "1331",
    "Body": "The reference is to a plot made by the Prophet's enemies\\n\\t\\t\\t\\tto kill him when he was returning from Tabuk. The plot\\n\\t\\t\\t\\tfailed. It was all the more dastardly in that some of the\\n\\t\\t\\t\\tconspirators were among the men of Madinah who were\\n\\t\\t\\t\\tenriched by the general prosperity that followed the\\n\\t\\t\\t\\tpeace and good government established through Islam in\\n\\t\\t\\t\\tMadinah. Trade flourished: justice was firmly\\n\\t\\t\\t\\tadministered with an even hand. And the only return that\\n\\t\\t\\t\\tthese men could make was a return of evil for good. That\\n\\t\\t\\t\\twas their revenge, because Islam aimed at suppressing\\n\\t\\t\\t\\tselfishness, stood for the rights of the poorest and\\n\\t\\t\\t\\thumblest, and judged worth by righteousness rather than\\n\\t\\t\\t\\tby birth or position."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "77",
    "NoteID": "1332",
    "Body": "If men are false to their covenants and words, the\\n\\t\\t\\t\\tnatural consequence will be hypocrisy to cover their\\n\\t\\t\\t\\tfalsehood. Such consequences will last till the Day of\\n\\t\\t\\t\\tJudgment, when they will have to account for their deeds.\\n\\t\\t\\t\\tThey may think that they are deceiving men by their\\n\\t\\t\\t\\thypocrisy, but they cannot deceive Allah, to Whom all\\n\\t\\t\\t\\ttheir most secret thoughts and plots and doings are\\n\\t\\t\\t\\tknown."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "79",
    "NoteID": "1333",
    "Body": "When financial help is necessary for the Cause, every\\n\\t\\t\\t\\tMuslim contributes what he can. Those who can afford\\n\\t\\t\\t\\tlarge sums are proud to bring them in of their own\\n\\t\\t\\t\\tfree-will, and those who are very poor contribute their\\n\\t\\t\\t\\tmite or their labour. Both kinds of gifts are equally\\n\\t\\t\\t\\tprecious because of the faith and good-will behind them,\\n\\t\\t\\t\\tand only cynics will laugh at the scantiness of the one\\n\\t\\t\\t\\tor the lavishness of the other. Sometimes they not only\\n\\t\\t\\t\\tlaugh, but attribute wrong motives to the givers. Such\\n\\t\\t\\t\\tconduct is here reprimanded."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "80",
    "NoteID": "1334",
    "Body": "An awful warning for those who actively oppose the Cause\\n\\t\\t\\t\\tof Allah. The Holy Prophet was by nature full of mercy\\n\\t\\t\\t\\tand forgiveness. He prayed for his enemies. But in such a\\n\\t\\t\\t\\tcase even his prayers are nullified by their attitude of\\n\\t\\t\\t\\trejecting Allah."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "81",
    "NoteID": "1335",
    "Body": "The Tabuk expedition had to be undertaken hurriedly in\\n\\t\\t\\t\\tthe heat of summer, because of a threat or fear of\\n\\t\\t\\t\\tByzantine invasion. They marched from Madinah about the\\n\\t\\t\\t\\tmonth of September or October in the solar calendar."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "82",
    "NoteID": "1336",
    "Body": "They may sneer or ridicule or rejoice now: that will be\\n\\t\\t\\t\\tonly for a little: much will they have to weep for\\n\\t\\t\\t\\tafterwards."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "84",
    "NoteID": "1337",
    "Body": "On the death of a Muslim, it is the pious duty of every\\n\\t\\t\\t\\tneighbouring Muslim who can, to assist in the simple\\n\\t\\t\\t\\tfuneral ceremonies,-the prayer for mercy before the body\\n\\t\\t\\t\\tis consigned to the grave, and the consignment of the\\n\\t\\t\\t\\tbody to the grave, by a simple, solemn, and dignified\\n\\t\\t\\t\\tritual. For those who have shown hostility to Islam, this\\n\\t\\t\\t\\twould not be seemly and is forbidden."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "85",
    "NoteID": "1338",
    "Body": "Except for the omission of a single word (\"life\"), this\\n\\t\\t\\t\\tverse repeats verse 55 above. But the repetition\\n\\t\\t\\t\\tindicates the harmonious closing of the same argument in\\n\\t\\t\\t\\ttwo aspects. In ix. 55 it occurred in connection with the\\n\\t\\t\\t\\treasons for refusing to receive the contributions of such\\n\\t\\t\\t\\tpersons to the expenses of an enterprise which though\\n\\t\\t\\t\\tvital to Islam's defence was secretly opposed by such\\n\\t\\t\\t\\tpersons. Here (in ix. 85) it is a question of refusing to\\n\\t\\t\\t\\tparticipate in the obsequies of such persons after their\\n\\t\\t\\t\\tdeath: it is natural to omit the word \"life\" in this\\n\\t\\t\\t\\tcase."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "87",
    "NoteID": "1339",
    "Body": "Khawalif, plural of khalifa, those (feminine) who remain\\n\\t\\t\\t\\tbehind at home when the men go to war: women. There is a\\n\\t\\t\\t\\tstinging taunt in this, a suggestion that such men were\\n\\t\\t\\t\\tcowards, preferring to remain behind like women when\\n\\t\\t\\t\\tstiff work was to be done by men in defending their\\n\\t\\t\\t\\thomes. They were not only cowards, but fools: as they did\\n\\t\\t\\t\\tnot understand their own best interests. If the enemy got\\n\\t\\t\\t\\tthe better of their brethren, they would themselves be\\n\\t\\t\\t\\tcrushed. \"Their hearts are sealed\": the habits of\\n\\t\\t\\t\\tcowardice and hypocrisy which they have adopted have\\n\\t\\t\\t\\tbecome their second nature."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "88",
    "NoteID": "1340",
    "Body": "\"Good things,\" and \"prosperity,\" are to be understood\\n\\t\\t\\t\\tboth in the physical and in the highest spiritual sense\\n\\t\\t\\t\\tas the next verse makes clear."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "89",
    "NoteID": "1341",
    "Body": "In this verse there is a reminiscence, but not an exact\\n\\t\\t\\t\\trepetition, of verse 72 above. This balances the parallel\\n\\t\\t\\t\\trepetition or reminiscence in verse 85 above. See n.\\n\\t\\t\\t\\t1338. The symmetry of the argument is thus completed, as\\n\\t\\t\\t\\tregards the Hypocrites of Madinah before we pass on to\\n\\t\\t\\t\\tconsider the case of the Hypocrites among the desert\\n\\t\\t\\t\\tBedouins in section 12."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "90",
    "NoteID": "1342",
    "Body": "Not only had the Hypocrites a nest in Madinah, but their\\n\\t\\t\\t\\ttactics affected some of the village or desert Bedouins,\\n\\t\\t\\t\\twho loved war and would have followed a standard of war\\n\\t\\t\\t\\teven if no question of Faith or a sacred Cause was\\n\\t\\t\\t\\tinvolved. But some of them, though professing Islam, were\\n\\t\\t\\t\\tfrightened by the hardships of the Tabuk expedition and\\n\\t\\t\\t\\tthe prospect of meeting the trained armies of the great\\n\\t\\t\\t\\tRoman (Byzantine) Empire. They made all sorts of lying\\n\\t\\t\\t\\texcuses, but really their want of faith made them\\n\\t\\t\\t\\tineligible for being enlisted in a sacred Cause, in the\\n\\t\\t\\t\\tterms of ix. 46-47 and ix. 53-54. Some came to make\\n\\t\\t\\t\\texcuses: other did not even come , but sat at home,\\n\\t\\t\\t\\tignoring the summons."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "91",
    "NoteID": "1343",
    "Body": "Though active service in person or by contributing\\n\\t\\t\\t\\tresources is expected in emergencies of every person who\\n\\t\\t\\t\\tbelieves in the Cause, there are some who must\\n\\t\\t\\t\\tnecessarily be exempted without the least blame attaching\\n\\t\\t\\t\\tto them. Such would be those who are weak in body on\\n\\t\\t\\t\\taccount of age, sex, infirmity, or illness. Personal\\n\\t\\t\\t\\tservice in their case is out of the question, but they\\n\\t\\t\\t\\tcould contribute towards expenses if they are able. But\\n\\t\\t\\t\\tif they are too poor to afford even such assistance, they\\n\\t\\t\\t\\tare excused. But in all cases the motive must be sincere,\\n\\t\\t\\t\\tand there should be a desire to serve and do such duty as\\n\\t\\t\\t\\tthey can. With such motives people are doing good or\\n\\t\\t\\t\\tright in whatever form they express their service:\\n\\t\\t\\t\\tsometimes, in Milton's words, \"they also serve who only\\n\\t\\t\\t\\tstand and wait.\" In any case their purity of motive would\\n\\t\\t\\t\\tget Allah's grace and forgiveness, and we must not\\n\\t\\t\\t\\tcriticise even if we thought they might have done more."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "92",
    "NoteID": "1344",
    "Body": "Hamala, yahmilu, here seems to mean: to provide means of\\n\\t\\t\\t\\ttransport, viz., mounts (horses, camels, etc.) for\\n\\t\\t\\t\\triding, and perhaps beasts of burden for carrying\\n\\t\\t\\t\\tequipment and baggage, suitable to the rank of those\\n\\t\\t\\t\\tconcerned. It may possibly mean other facilities for\\n\\t\\t\\t\\tgetting about, such as boots and shoes, or provisions:\\n\\t\\t\\t\\tfor an army's march depends upon all these things. Where\\n\\t\\t\\t\\tpeople fight as volunteers for a cause, without an\\n\\t\\t\\t\\textensive war fund, those who can afford it provide such\\n\\t\\t\\t\\tthings for themselves, but those without means, yet\\n\\t\\t\\t\\tanxious to serve, have to be left behind. Their\\n\\t\\t\\t\\tdisappointment is in proportion to their eagerness to\\n\\t\\t\\t\\tserve."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "93",
    "NoteID": "1345",
    "Body": "Cf. ix. 87, where similar phrases are used for a similar\\n\\t\\t\\t\\tshirking of duty by towns-folk, while here we are\\n\\t\\t\\t\\tconsidering the desert folk. It is not only a duty, but a\\n\\t\\t\\t\\tprecious privilege, to serve a great Cause by personal\\n\\t\\t\\t\\tself-sacrifice. Those who shirk such an opportunity know\\n\\t\\t\\t\\tnot what they miss."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "98",
    "NoteID": "1346",
    "Body": "The payments refer to the regular Charity established by\\n\\t\\t\\t\\tIslam-the obligatory alms. If you look upon them as a\\n\\t\\t\\t\\tfine or a burden, their virtue is lost. If you rejoice\\n\\t\\t\\t\\tthat you have there an opportunity of helping the\\n\\t\\t\\t\\tCommunity to maintain its standards of public assistance\\n\\t\\t\\t\\tand to suppress the unseemly beggary and loathsome\\n\\t\\t\\t\\timportunity whose relief is only governed by motives of\\n\\t\\t\\t\\tgetting rid of awkward obstacles on the way, then your\\n\\t\\t\\t\\toutlook is entirely different. You wish for organised and\\n\\t\\t\\t\\teffective efforts to solve the problems of human poverty\\n\\t\\t\\t\\tand misery. In doing so, you get nearer to Allah, and you\\n\\t\\t\\t\\tearn the good wishes and prayers of godly men, led by our\\n\\t\\t\\t\\tholy Leader Al-Mustafa."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "99",
    "NoteID": "1347",
    "Body": "The Mercy of Allah is always present, as the sun is\\n\\t\\t\\t\\talways shining. But when we have prepared ourselves to\\n\\t\\t\\t\\treceive it, we come to the full enjoyment of it, as a man\\n\\t\\t\\t\\twho was in a shade comes out by his effort into the open,\\n\\t\\t\\t\\tand basks in sunshine."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "100",
    "NoteID": "1348",
    "Body": "The vanguard of Islam-those in the first rank-are those\\n\\t\\t\\t\\twho dare and suffer for the Cause and never flinch. The\\n\\t\\t\\t\\tfirst historical examples are the Muhajirs and the Ansar.\\n\\t\\t\\t\\tThe Muhajirs-those who forsook their homes in Makkah and\\n\\t\\t\\t\\tmigrated to Madinah, the Holy Prophet being among the\\n\\t\\t\\t\\tlast to leave the post of danger, are mentioned first.\\n\\t\\t\\t\\tThen come the Ansar, the Helpers, the citizens of Madinah\\n\\t\\t\\t\\twho invited them, welcomed them, and gave them aid, and\\n\\t\\t\\t\\twho formed the pivot of the new Community. Then are\\n\\t\\t\\t\\tmentioned all who follow them in good deeds: not only the\\n\\t\\t\\t\\tearly heroes and ordinary men and women who had been\\n\\t\\t\\t\\tCompanions of the Prophet or had seen him, but men and\\n\\t\\t\\t\\twomen in all ages who have lived noble lives. In spite of\\n\\t\\t\\t\\tall their sacrifice and suffering they rejoice in the\\n\\t\\t\\t\\tprecious gift of the Good Pleasure of Allah, and their\\n\\t\\t\\t\\tSalvation is the Supreme Felicity which such Good\\n\\t\\t\\t\\tPleasure gives."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "100",
    "NoteID": "1349",
    "Body": "Note the description of the final accomplishment of the\\n\\t\\t\\t\\tdestiny of man. In mathematical science it would be like\\n\\t\\t\\t\\ta letter or formula which would sum up a long course of\\n\\t\\t\\t\\treasoning. In this very Sura it occurs before in ix. 72\\n\\t\\t\\t\\tand ix. 89, where see n. 1341."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "101",
    "NoteID": "1350",
    "Body": "The desert Arabs were not all simple folk. There were\\n\\t\\t\\t\\tcunning hypocrites among them: both among certain tribes\\n\\t\\t\\t\\tencamped round about Madinah and certain others in\\n\\t\\t\\t\\tMadinah itself."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "101",
    "NoteID": "1351",
    "Body": "Their punishment in this world was double, viz., not only\\n\\t\\t\\t\\tin their discomfiture, but because in their obstinate\\n\\t\\t\\t\\tignorance, they failed to understand the accomplished\\n\\t\\t\\t\\tfacts, while cleverer men realised that their hostility\\n\\t\\t\\t\\tto Islam was hopeless. In addition to their discomfiture\\n\\t\\t\\t\\tin this life, they would have to meet the penalties to\\n\\t\\t\\t\\tcome."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "102",
    "NoteID": "1352",
    "Body": "There were some whose will was weak and succumbed to\\n\\t\\t\\t\\tevil, although there was much good in them. To them is\\n\\t\\t\\t\\theld out the promise of forgiveness if they would repent\\n\\t\\t\\t\\tand undertake all acts of Muslim charity, which would\\n\\t\\t\\t\\tpurify their souls, aided by the prayers of Allah's\\n\\t\\t\\t\\tMessenger. Then would they get the Peace that comes from\\n\\t\\t\\t\\tpurity and right conduct."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "105",
    "NoteID": "1353",
    "Body": "The repentant should be encouraged, after their\\n\\t\\t\\t\\trepentance, to amend their conduct. The kindly interest\\n\\t\\t\\t\\tof their brethren in them will strengthen them in virtue\\n\\t\\t\\t\\tand blot out their past. When they go back into Eternity,\\n\\t\\t\\t\\tthey will understand the healing grace which saved them,\\n\\t\\t\\t\\tjust as the evil ones will then have their eyes opened to\\n\\t\\t\\t\\tthe real truth of their spiritual degradation (ix. 94).\\n\\t\\t\\t\\tThe similar words, in verse 84 and here, clench the\\n\\t\\t\\t\\tcontrast."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "106",
    "NoteID": "1354",
    "Body": "Three categories of men are mentioned, whose faith was\\n\\t\\t\\t\\ttested and found wanting in the Tabuk affair, but their\\n\\t\\t\\t\\tcharacteristics are perfectly general, and we may here\\n\\t\\t\\t\\tconsider them in their general aspects: (1) the deep-dyed\\n\\t\\t\\t\\thypocrites, who when found out make excuses because\\n\\t\\t\\t\\totherwise they will suffer ignominy; they are\\n\\t\\t\\t\\tunregenerate and obstinate, and there is no hope for them\\n\\t\\t\\t\\t(ix. 101); (2) there are those who have lapsed into evil,\\n\\t\\t\\t\\tbut are not altogether evil; they repent and amend, and\\n\\t\\t\\t\\tare accepted (ix. 102-105); and (3) there are doubtful\\n\\t\\t\\t\\tcases, but Allah will judge them (ix. 106). A fourth\\n\\t\\t\\t\\tcategory is mentioned in ix. 107, which will be discussed\\n\\t\\t\\t\\tlater."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "107",
    "NoteID": "1355",
    "Body": "Three categories of Hypocrites having already been\\n\\t\\t\\t\\tmentioned (n. 1354), a fourth class of insidious\\n\\t\\t\\t\\tevil-doers is now mentioned, whose type is illustrated in\\n\\t\\t\\t\\tthe story of the Qubaa \"Mosque of mischief (dhirar)\".\\n\\t\\t\\t\\tQubaa is a suburb of Madinah about three miles to the\\n\\t\\t\\t\\tsouth-east. When the Holy Prophet arrived at Madinah for\\n\\t\\t\\t\\tHijrat, he rested four days in Qubaa before entering the\\n\\t\\t\\t\\ttown of Madinah. Here was built the first mosque, the\\n\\t\\t\\t\\t\"Mosque of Piety\" to which he frequently came during his\\n\\t\\t\\t\\tsubsequent stay in Madinah. Taking advantage of these\\n\\t\\t\\t\\tsacred associations, some Hypocrites of the Tribe of Bani\\n\\t\\t\\t\\tGanam built an opposition mosque in Qubaa, pretending to\\n\\t\\t\\t\\tadvance Islam. In reality they were in league with a\\n\\t\\t\\t\\tnotorious enemy of Islam, one Abu 'Amir, who had fought\\n\\t\\t\\t\\tagainst Islam at Uhud and who was now, after the battle\\n\\t\\t\\t\\tof Hunain (A.H. 9), in Syria: his confederates wanted a\\n\\t\\t\\t\\tmosque for him to come to, but it would only be a source\\n\\t\\t\\t\\tof mischief and division, and the scheme was disapproved."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "107",
    "NoteID": "1356",
    "Body": "Abu 'Amir, surnamed the Rahib (Monk), as he had been in\\n\\t\\t\\t\\ttouch with Christian monks. See last note."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "108",
    "NoteID": "1357",
    "Body": "The original \"Mosque of Piety\" built by the Holy Prophet\\n\\t\\t\\t\\thimself."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "108",
    "NoteID": "1358",
    "Body": "The true Muslim must be pure in body, mind, and heart.\\n\\t\\t\\t\\tHis motives should always be sincere, and his religion\\n\\t\\t\\t\\twithout any alloy of worldy gain."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "109",
    "NoteID": "1359",
    "Body": "A man who builds his life on Piety (which includes\\n\\t\\t\\t\\tsincerity and the purity of all motives) and his hopes on\\n\\t\\t\\t\\tthe Good Pleasure of Allah, builds on a firm foundation\\n\\t\\t\\t\\tof rock that will never be shaken. In contrast to him is\\n\\t\\t\\t\\tthe man who builds on a shifting sand-cliff on the brink\\n\\t\\t\\t\\tof an abyss, already undermined by forces which he does\\n\\t\\t\\t\\tnot see. The cliff and the foundations all crumble to\\n\\t\\t\\t\\tpieces along with him, and he is plunged into the Fire of\\n\\t\\t\\t\\tmisery from which there is no escape."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "110",
    "NoteID": "1360",
    "Body": "\"Their hearts cut to pieces\" i.e., they meet their death.\\n\\t\\t\\t\\tThe parable is continued further. The heart of man is the\\n\\t\\t\\t\\tseat of his hopes and fears, the foundation of his moral\\n\\t\\t\\t\\tand spiritual life. If that foundation is on an\\n\\t\\t\\t\\tundermined sand-cliff already crumbling to pieces, what\\n\\t\\t\\t\\tsecurity or stability can he have? He is being shaken by\\n\\t\\t\\t\\talarms and suspicions and superstitions, until like the\\n\\t\\t\\t\\tedge of a sand-cliff they are cut clean away and fall\\n\\t\\t\\t\\tinto a heap of ruin and his spiritual life and all its\\n\\t\\t\\t\\tland-marks are destroyed."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "111",
    "NoteID": "1361",
    "Body": "In a human bargain both sides give something and receive\\n\\t\\t\\t\\tsome advantage. In the divine bargain of Allah with man,\\n\\t\\t\\t\\tAllah takes man's will and soul and his wealth and goods,\\n\\t\\t\\t\\tand gives him in return ever-lasting Felicity. Man fights\\n\\t\\t\\t\\tin Allah's Cause and carries out His will. All that he\\n\\t\\t\\t\\thas to give up is the ephemeral things of this world,\\n\\t\\t\\t\\twhile he gains eternal salvation, the fulfilment of his\\n\\t\\t\\t\\thighest spiritual hopes,-a supreme achievement indeed."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "111",
    "NoteID": "1362",
    "Body": "We offer our whole selves and our possessions to Allah,\\n\\t\\t\\t\\tand Allah gives us Salvation. This is the true doctrine\\n\\t\\t\\t\\tof redemption: and we are taught that this is the\\n\\t\\t\\t\\tdoctrine not only of the Qur-an but of the earlier\\n\\t\\t\\t\\tRevelations,-the original Law of Moses and the original\\n\\t\\t\\t\\tGospel of Jesus. Any other view of redemption is rejected\\n\\t\\t\\t\\tby Islam, especially that of corrupted Christianity,\\n\\t\\t\\t\\twhich thinks that some other person suffered for our sins\\n\\t\\t\\t\\tand we are redeemed by his blood. It is our\\n\\t\\t\\t\\tself-surrender that counts, not other people's merits.\\n\\t\\t\\t\\tOur complete self-surrender may include fighting for the\\n\\t\\t\\t\\tcause, both spiritual and physical. As regards actual\\n\\t\\t\\t\\tfighting with the sword there has been some difference in\\n\\t\\t\\t\\ttheological theories at different times, but very little\\n\\t\\t\\t\\tin the practice of those who framed those theories. The\\n\\t\\t\\t\\tJewish wars were ruthless wars of extermination. The Old\\n\\t\\t\\t\\tTestament does not mince matters on this subject. In the\\n\\t\\t\\t\\tNew Testament St. Paul, in commending the worthy fruits\\n\\t\\t\\t\\tof Faith, mentions Gideon, Barak, and other warriors of\\n\\t\\t\\t\\tthe Old Testament as his ideals, \"Who through faith\\n\\t\\t\\t\\tsubdued kingdoms... waxed valiant in fight, turned to\\n\\t\\t\\t\\tflight the armies of the aliens...\" (Hebrews, xi. 32-34).\\n\\t\\t\\t\\tThe monkish morality of the Gospels in their present form\\n\\t\\t\\t\\thas never been followed by any self-respecting Christian\\n\\t\\t\\t\\tor other nation in history. Nor is it common-sense to\\n\\t\\t\\t\\tignore lust of blood in unregenerate man as a form of\\n\\t\\t\\t\\tevil which has to be combated \"within the limits, set by\\n\\t\\t\\t\\tAllah\" (Q. ix. 112)."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "112",
    "NoteID": "1363",
    "Body": "We are to rejoice that by giving up such small things as\\n\\t\\t\\t\\tourselves and our possessions we are to be rewarded with\\n\\t\\t\\t\\tsuch a great thing as the eternal life of felicity. The\\n\\t\\t\\t\\ttruly righteous, whose lives in various aspects are\\n\\t\\t\\t\\tdescribed in this verse, do so rejoice. The good news is\\n\\t\\t\\t\\tto be proclaimed to all Believers, including the weakest\\n\\t\\t\\t\\tamong us, so that they may profit by that example."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "113",
    "NoteID": "1364",
    "Body": "This is usually understood to refer to the prayer for the\\n\\t\\t\\t\\tdead, (1) if they died unrepentant after Islam was\\n\\t\\t\\t\\tpreached to them, (2) if they actively resisted or\\n\\t\\t\\t\\topposed the Faith to the last."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "114",
    "NoteID": "1365",
    "Body": "Abraham and his unbelieving father are referred to in vi.\\n\\t\\t\\t\\t74. Apparently when Abraham was convinced that the\\n\\t\\t\\t\\tconditions mentioned in the last note applied to his\\n\\t\\t\\t\\tfather, he gave up praying for him, as the physical bond\\n\\t\\t\\t\\twas cut off by the spiritual hostility. For the promise\\n\\t\\t\\t\\tto pray for his father, see xix. 47."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "114",
    "NoteID": "1366",
    "Body": "Abraham was loyal and tender-hearted, and bore with much\\n\\t\\t\\t\\tthat he disapproved, being in this a prototype of\\n\\t\\t\\t\\tAl-Mustafa, and it must have gone against his grain to\\n\\t\\t\\t\\tcut off relations in that way. But it would obviously be\\n\\t\\t\\t\\twrong for a human being to entreat Allah for mercy on\\n\\t\\t\\t\\tpeople who had finally rejected Allah."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "115",
    "NoteID": "1367",
    "Body": "Allah's clear commands are given, so that Believers may\\n\\t\\t\\t\\tnot be misled by their human frailty into unbecoming\\n\\t\\t\\t\\tconduct."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "117",
    "NoteID": "1368",
    "Body": "Cf. ix. 100. The Muhajirs were the people who originally\\n\\t\\t\\t\\tforsook their homes in Makkah and followed Al-Mustafa in\\n\\t\\t\\t\\texile to Madinah. The Ansar were the Madinah people who\\n\\t\\t\\t\\treceived them with honour and hospitality into their\\n\\t\\t\\t\\tcity. Both these groups were staunch supporters of Islam,\\n\\t\\t\\t\\tand proved their Faith by great sacrifices. But in the\\n\\t\\t\\t\\tdifficult days of the Tabuk expedition some of them, not\\n\\t\\t\\t\\tperversely, but out of lethargy and human weakness, had\\n\\t\\t\\t\\tfailed to follow the standard. They were forgiven, and\\n\\t\\t\\t\\tthey afterwards acquitted themselves with zeal."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "117",
    "NoteID": "1369",
    "Body": "Note that the \"swerving from duty\" was merely an\\n\\t\\t\\t\\tinclination due to the weakness of human nature in the\\n\\t\\t\\t\\tface of new difficulties: that it only affected a part of\\n\\t\\t\\t\\tthe men for a time: and that it was overcome even in\\n\\t\\t\\t\\ttheir case by the grace of Allah, so that they all did\\n\\t\\t\\t\\ttheir duty, and were freely forgiven their incipient\\n\\t\\t\\t\\tweakness, which they conquered. There were three\\n\\t\\t\\t\\texceptions, which are referred to in the next verse."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "118",
    "NoteID": "1370",
    "Body": "Left behind: i.e., the acceptance of their repentance was\\n\\t\\t\\t\\tdelayed. Among the Faithful, the largest number consisted\\n\\t\\t\\t\\tof those who were perfectly staunch and ever ready to do\\n\\t\\t\\t\\ttheir duty. They obtained the love and good pleasure of\\n\\t\\t\\t\\tAllah. Next came a few who wavered because their will was\\n\\t\\t\\t\\tweak and they were daunted by the dangers and\\n\\t\\t\\t\\tdifficulties that faced them; Allah's saving grace\\n\\t\\t\\t\\tprotected them and they conquered their weakness, and did\\n\\t\\t\\t\\tnot fail in their duty; Allah forgave them and accepted\\n\\t\\t\\t\\ttheir repentance. Lastly, in the illustration taken from\\n\\t\\t\\t\\tthe Tabuk affair, there were some who actually failed in\\n\\t\\t\\t\\ttheir duty, not from contumacy or ill-will, but from\\n\\t\\t\\t\\tthoughtlessness, slackness, and human weakness: they\\n\\t\\t\\t\\tactually failed to obey the Holy Prophet's summons, and\\n\\t\\t\\t\\twere naturally called on to explain, and were excluded\\n\\t\\t\\t\\tfrom the life of the Community. Their mental state is\\n\\t\\t\\t\\there described graphically. Though the earth is spacious,\\n\\t\\t\\t\\tto them it was constrained. In their own souls they had a\\n\\t\\t\\t\\tfeeling of constraint. In worldly affluence they felt\\n\\t\\t\\t\\tpoor in spirit. They realised that they could not flee\\n\\t\\t\\t\\tfrom Allah, but could only find solace and refuge in\\n\\t\\t\\t\\tcoming back to Him. They freely repented and showed it in\\n\\t\\t\\t\\ttheir deeds, and Allah freely forgave them and took them\\n\\t\\t\\t\\tto His grace. Though illustrated by the particular\\n\\t\\t\\t\\texamples of Ka'b, Mararah and Hilal, the lesson is\\n\\t\\t\\t\\tperfectly general and is good for all times."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "120",
    "NoteID": "1371",
    "Body": "Again, the illustration is that of Tabuk, but the lesson\\n\\t\\t\\t\\tis general. We must not hold our own comfort or lives\\n\\t\\t\\t\\tdearer than that of our leader, nor desert him in the\\n\\t\\t\\t\\thour of danger. If we have true devotion, we shall hold\\n\\t\\t\\t\\tour own lives or comfort cheap in comparison to his. But\\n\\t\\t\\t\\twhatever service we render to the Cause of Allah, and\\n\\t\\t\\t\\twhatever sufferings, hardships, or injuries we endure, or\\n\\t\\t\\t\\twhatever resources we spend for the Cause,-all goes to\\n\\t\\t\\t\\traise our degree in the spiritual world. Nothing is lost.\\n\\t\\t\\t\\tOur reward is far greater in worth than any little\\n\\t\\t\\t\\tservice we can render, or any little hardship we can\\n\\t\\t\\t\\tsuffer, or any little contributions we can make to the\\n\\t\\t\\t\\tCause. We \"painfuly attain to joy\"."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "121",
    "NoteID": "1372",
    "Body": "Cut across a valley: this is specially mentioned, as\\n\\t\\t\\t\\tdenoting an individual act of herosim, dash, or bravery.\\n\\t\\t\\t\\tTo march with the troops along valleys, tread paths of\\n\\t\\t\\t\\tdanger along with our Comrades, is good and praiseworthy:\\n\\t\\t\\t\\tNotice that both the things mentioned in this verse,- the\\n\\t\\t\\t\\tspending of resources and the dashing across a valley-are\\n\\t\\t\\t\\tindividual acts, while those mentioned in the last verse\\n\\t\\t\\t\\tare collective acts, which are in some ways easier. The\\n\\t\\t\\t\\tindividual acts having been mentioned, the next verse\\n\\t\\t\\t\\tfollows naturally."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "122",
    "NoteID": "1373",
    "Body": "Fighting may be inevitable, and where a call is made by\\n\\t\\t\\t\\tthe ruler of an Islamic State, it should be obeyed. But\\n\\t\\t\\t\\tfighting is not to be glorified to the exclusion of all\\n\\t\\t\\t\\telse. Even among those who are able to go forth, a party\\n\\t\\t\\t\\tshould remain behind-for purposes of study, so that when\\n\\t\\t\\t\\tthe fighters return home, their minds may be attuned\\n\\t\\t\\t\\tagain to the more normal interests of religious life,\\n\\t\\t\\t\\tunder properly instructed teachers. The students and\\n\\t\\t\\t\\tteachers are soldiers of the Jiha4d in their spirit of\\n\\t\\t\\t\\tobedience and discipline."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "123",
    "NoteID": "1374",
    "Body": "When conflict becomes inevitable, the first thing is to\\n\\t\\t\\t\\tclear our surroundings of all evil, for it is only evil\\n\\t\\t\\t\\tthat we can rightly fight. To evil we must put up a stout\\n\\t\\t\\t\\tand stiff resistance. Mealy-mouthed compromises are not\\n\\t\\t\\t\\tright for soldiers of truth and righteousness. They are\\n\\t\\t\\t\\toften a compound of cowardice, weariness, greed, and\\n\\t\\t\\t\\tcorruptibility."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "124",
    "NoteID": "1375",
    "Body": "The incompatibility of Unfaith and Faith are contrasted\\n\\t\\t\\t\\tin this section in respect of revelation and the divine\\n\\t\\t\\t\\tteacher. The Unbelievers laugh at revelation, and say to\\n\\t\\t\\t\\teach other mockingly: \"Does this increase your faith?\" To\\n\\t\\t\\t\\tthe Believer every new aspect of Allah's truth as\\n\\t\\t\\t\\trevealed increases his faith, and wonder, and gratitude.\\n\\t\\t\\t\\tHe rejoices, because he gets added strength for life and\\n\\t\\t\\t\\tachievement."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "125",
    "NoteID": "1376",
    "Body": "Cf. ii. 10 and several similar passages. Just as the\\n\\t\\t\\t\\tlight, which to healthy eyes gives enlightenment, causes\\n\\t\\t\\t\\tpain to the diseased eye, which emits unclean matter, so\\n\\t\\t\\t\\tto those spiritually diseased. Allah's grace is\\n\\t\\t\\t\\tunwelcome, and they put forth more doubts to cover their\\n\\t\\t\\t\\tdisease. And they die in their disease, and of their\\n\\t\\t\\t\\tdiscase. Note the aptness of the metaphor."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "126",
    "NoteID": "1377",
    "Body": "Yet, in spite of their infidelity, one or two chances are\\n\\t\\t\\t\\tgiven them every year. The door is not closed to them.\\n\\t\\t\\t\\tYet they deliberately turn away, and take no heed of all\\n\\t\\t\\t\\tthe warnings which their own nature and the teaching and\\n\\t\\t\\t\\texample of good men should give them."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "127",
    "NoteID": "1378",
    "Body": "Even the Unbelievers, in their heart and conscience, feel\\n\\t\\t\\t\\tuncomfortable when they turn away from Faith and Truth,\\n\\t\\t\\t\\tand therefore their turning aside is figured by furtive\\n\\t\\t\\t\\tglances, such as we may suppose literally to have been\\n\\t\\t\\t\\tcast by the Hypocrites in the assemblies of the Holy\\n\\t\\t\\t\\tProphet. Then they slink away, feeling superior in their\\n\\t\\t\\t\\tminds. And yet, if they only knew it, their contumacy\\n\\t\\t\\t\\tdeprives them of Allah's grace and light. They are\\n\\t\\t\\t\\tturning Grace away, and when Allah withdraws it\\n\\t\\t\\t\\taltogether, they perish utterly."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "128",
    "NoteID": "1379",
    "Body": "The tender heart of the Teacher is grieved that any among\\n\\t\\t\\t\\this flock should rush headlong to ruin. He watches\\n\\t\\t\\t\\tardently over them, and whenever any of them show signs\\n\\t\\t\\t\\tof Faith, his kindness and mercy surround him and rejoice\\n\\t\\t\\t\\tover him."
  },
  {
    "SurahNumber": "9",
    "AyahNumber": "129",
    "NoteID": "1380",
    "Body": "But if the Message is rejected, he still proclaims the\\n\\t\\t\\t\\tburning Faith of his heart, which is unquenchable. Allah\\n\\t\\t\\t\\tis sufficient to all. To trust Him is to find the\\n\\t\\t\\t\\taccomplishment of all spiritual desire. His grandeur is\\n\\t\\t\\t\\tfigured by a lofty Throne, supreme in glory! Thus have we\\n\\t\\t\\t\\tbeen led, through a notable incident in Al-Mustafa's\\n\\t\\t\\t\\tearthly career, to truths of the highest spiritual\\n\\t\\t\\t\\timport."
  }
]
