[
  {
    "SurahNumber": "11",
    "AyahNumber": "1",
    "Text": "Alif Lam Ra. This Book, whose verses are perfected and issued in\\n\\t\\t\\tdetail by the One Who is All-Wise, All-Aware."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "2",
    "Text": "Teaches that you should worship none but Allah - indeed I am a\\n\\t\\t\\tWarner and bearer of good news from Him to you."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "3",
    "Text": "You should seek forgiveness of your Rabb and turn to Him in\\n\\t\\t\\trepentance; He will grant you good provisions till an appointed\\n\\t\\t\\tterm, and bestow His grace on everyone who has merit! But if you\\n\\t\\t\\tturn away (pay no heed), I fear for you the punishment of a Great\\n\\t\\t\\tDay."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "4",
    "Text": "To Allah you shall all return and He has power over everything."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "5",
    "Text": "Behold! They cover up their chests to conceal their thoughts from\\n\\t\\t\\tHim! Beware! Even when they cover themselves with their garments,\\n\\t\\t\\tHe knows what they conceal and what they reveal; for He knows\\n\\t\\t\\teven the inmost secrets of the chests."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "6",
    "Text": "There is no moving creature on Earth whose sustenance is not\\n\\t\\t\\tprovided by Allah. He knows its living and its resting place, and\\n\\t\\t\\tall that is recorded in a glorious Book."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "7",
    "Text": "He is the One Who created the heavens and the earth in six\\n\\t\\t\\tperiods - at the time when His Throne was rested on the water -\\n\\t\\t\\tso that He may test to find out which of you is the best in\\n\\t\\t\\tdeeds. Now if you tell them:\" You shall indeed be raised up after\\n\\t\\t\\tdeath,\" the unbelievers would certainly say: \"This is nothing but\\n\\t\\t\\tsheer magic!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "8",
    "Text": "And if We put off their punishment till an appointed time, they\\n\\t\\t\\tare sure to ask: \"What is holding it back?\" Beware! When the Day\\n\\t\\t\\tof that punishment comes, nothing will hold it back from them and\\n\\t\\t\\tthey will be completely encircled by that which they are\\n\\t\\t\\tridiculing."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "9",
    "Text": "If We let man taste any mercy from Us, then withdraw it from him,\\n\\t\\t\\the becomes despairing, ungrateful."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "10",
    "Text": "But if We let him taste any favor after adversity has afflicted\\n\\t\\t\\thim, then he says: \"All my sorrows are gone from me,\" and he\\n\\t\\t\\tbecomes jubilantly arrogant."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "11",
    "Text": "The exception is for those people who are steadfast and do good\\n\\t\\t\\tdeeds; they are the ones who will have forgiveness and a great\\n\\t\\t\\treward."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "12",
    "Text": "O Prophet, be on your guard lest you omit to recite some things\\n\\t\\t\\twhich are being revealed to you feeling distressed in your heart\\n\\t\\t\\tthat they might say: \"Why has no treasure been sent down to him,\\n\\t\\t\\tor why has no angel come with him?\" You should know that you are\\n\\t\\t\\tnothing but a Warner! It is Allah Who is the Custodian of\\n\\t\\t\\teverything."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "13",
    "Text": "Do they say: \"He has made up the Qur'an himself.\" Say to them:\\n\\t\\t\\t\"Make up ten Surahs like this and call to your aid whomsoever you\\n\\t\\t\\tcan, including your gods whom you worship, besides Allah if what\\n\\t\\t\\tyou say is true."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "14",
    "Text": "But if those gods fail to answer you, then you should know that\\n\\t\\t\\t(they are false gods and that) this (Book) is revealed with the\\n\\t\\t\\tknowledge of Allah, and that there is no god but Him! Will you\\n\\t\\t\\tthen become Muslims?\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "15",
    "Text": "Those who desire the life of this world and its splendors, they\\n\\t\\t\\tare given full reward of their deeds therein and shall not be\\n\\t\\t\\tdiminished."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "16",
    "Text": "They are the ones who will have nothing in the hereafter except\\n\\t\\t\\tHellfire. There they shall come to know that their deeds were\\n\\t\\t\\tfruitless and their actions were worthless."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "17",
    "Text": "Can they be like those who have clear revelations from their Rabb\\n\\t\\t\\tand to whom a witness from Himself recites it, and they have the\\n\\t\\t\\tBook of Musa before them - a guidance and a blessing? Can such\\n\\t\\t\\tpeople deny the revelation of Al- Qur'an? No of course not,\\n\\t\\t\\trather such people will believe in this, but those factions who\\n\\t\\t\\tdo not believe shall have their promised place in the Hellfire.\\n\\t\\t\\tSo, O Prophet, do not be in any doubt about it; it is the Truth\\n\\t\\t\\tfrom your Rabb, even though most people do not believe so."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "18",
    "Text": "Who can be more wrong than the one who forges a lie against\\n\\t\\t\\tAllah? Such people will be brought before their Rabb, and the\\n\\t\\t\\twitnesses will say: \"These are the ones who lied against their\\n\\t\\t\\tRabb.\" Beware! The Curse of Allah is on those wrongdoers"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "19",
    "Text": "who hinder others from the path of Allah and seek to make it\\n\\t\\t\\tcrooked, and who deny the hereafter."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "20",
    "Text": "These people cannot frustrate His plan in the land and there is\\n\\t\\t\\tnone to protect them besides Allah. Their punishment shall be\\n\\t\\t\\tdoubled, for they could neither hear others who speak the Truth\\n\\t\\t\\tnor see the Truth for themselves."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "21",
    "Text": "They are the ones who have lost their own souls, and the fancies\\n\\t\\t\\tthey invented have left them in the lurch."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "22",
    "Text": "No doubt they will be the greatest losers in the Hereafter."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "23",
    "Text": "As for those who believe and do good deeds and humble themselves\\n\\t\\t\\tbefore their Rabb, they will be residents of paradise to live\\n\\t\\t\\ttherein forever."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "24",
    "Text": "The example of these two kinds of people is like two men, one of\\n\\t\\t\\twhom is blind and deaf, and the other who can see and hear. Are\\n\\t\\t\\tthey equal when compared? Will you not then learn a lesson from\\n\\t\\t\\tthis example?"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "25",
    "Text": "We sent Nuh to his people. Nuh said: \"I have come to warn you\\n\\t\\t\\tplainly,"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "26",
    "Text": "not to worship anyone except Allah; otherwise I am afraid for you\\n\\t\\t\\tthe punishment of a painful Day.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "27",
    "Text": "In answer to this, the chiefs of the unbelievers among his people\\n\\t\\t\\tsaid: \"We see you as no more than merely a human being like\\n\\t\\t\\tourselves: and we see that no one has followed you except the\\n\\t\\t\\tmeanest among us, whose judgement abilities are immature, and we\\n\\t\\t\\tfind nothing in you which gives you superiority over us: in fact\\n\\t\\t\\twe think that you are a liar.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "28",
    "Text": "He said: \"O my people, look! If I am given clear proof from my\\n\\t\\t\\tRabb, and He has bestowed on me His grace, although it be hidden\\n\\t\\t\\tfrom you, can we compel you to accept it against your will?"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "29",
    "Text": "O my people! I do not ask you any wealth for this work, for none\\n\\t\\t\\tbut Allah can reward me. I am not going to drive away those who\\n\\t\\t\\tbelieve; for they will surely meet their Rabb. But I can see that\\n\\t\\t\\tyou are acting out of ignorance."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "30",
    "Text": "And O my people! Who will save me from Allah, if I drive them\\n\\t\\t\\taway? Don't you understand this simple thing?"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "31",
    "Text": "I do not say that I possess the Treasures of Allah, nor do I say\\n\\t\\t\\tthat I have knowledge of the unseen, nor do I claim to be an\\n\\t\\t\\tangel; nor do I say of those who are mean in your eyes, that\\n\\t\\t\\tAllah will not grant them any good - Allah knows best what is in\\n\\t\\t\\ttheir hearts - for if I utter any thing like this, then I will\\n\\t\\t\\tindeed become a wrongdoer.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "32",
    "Text": "They said: \"O Nuh! You have argued with us and argued too much,\\n\\t\\t\\tnow bring upon us the scourge with which you threaten us, if what\\n\\t\\t\\tyou say is true.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "33",
    "Text": "He replied: \" Allah will surely bring it on you if He pleases and\\n\\t\\t\\tthen you will not be able to escape from it!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "34",
    "Text": "My counsel will not profit you, much as I desire to give you good\\n\\t\\t\\tcounsel, if Allah wants to leave you astray; He is your Rabb, and\\n\\t\\t\\tto Him you shall return.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "35",
    "Text": "Do the unbelievers say \"He (Muhammad) himself has forged all\\n\\t\\t\\tthis?\" Say to them: \"If I have indeed forged it, then its sin is\\n\\t\\t\\ton me! And I am clear of the sins which you are committing for\\n\\t\\t\\tnot believing it.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "36",
    "Text": "And it was revealed to Nuh: \"None of your people will believe\\n\\t\\t\\tnow, other than those who have already believed. So do not grieve\\n\\t\\t\\tat their evil deeds."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "37",
    "Text": "Build an ark under Our supervision in accordance with Our\\n\\t\\t\\trevelation, and beware not to plead with Me on behalf of those\\n\\t\\t\\twho are wrongdoers: for they are all to be drowned in the flood.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "38",
    "Text": "So he started to build the ark; and whenever the chiefs of his\\n\\t\\t\\tpeople passed by him they laughed at him. He said: \"Laugh at us\\n\\t\\t\\tnow if you will, soon the time is going to come when we too will\\n\\t\\t\\tlaugh at you as you are laughing at us."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "39",
    "Text": "Soon you will come to know who will be seized by a humiliating\\n\\t\\t\\tscourge, and who is afflicted with everlasting punishment.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "40",
    "Text": "Finally when Our Command came and the water from Al-Tannur (a\\n\\t\\t\\tparticular oven marked as a starting point to warn Nuh in order\\n\\t\\t\\tto get him ready to board the ark) gushed forth! We said to Nuh:\\n\\t\\t\\t\"Take into the Ark a pair from every species, your family -\\n\\t\\t\\texcept those against whom the Word has already gone forth - and\\n\\t\\t\\tthe believers and those who believed with him were only a few.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "41",
    "Text": "Thus he said: \"Embark in it, in the name of Allah in whose hands\\n\\t\\t\\tis its sailing and its stopping; surely my Rabb is Forgiving,\\n\\t\\t\\tMerciful.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "42",
    "Text": "As the ark floated with them on board over the mountainous waves\\n\\t\\t\\tand Nuh called out to his son, who stood apart: \"O my son! Embark\\n\\t\\t\\twith us and be not with the unbelievers!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "43",
    "Text": "He replied: \"I will take refuge on some mountain, which will save\\n\\t\\t\\tme from the flood.\" Nuh said: \"None shall be secure today from\\n\\t\\t\\tthe judgement of Allah, except the one on whom He has mercy!\" And\\n\\t\\t\\tthereupon a wave came between them and he (Nuh's son) became\\n\\t\\t\\tamong one of those who drowned."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "44",
    "Text": "Finally, Allah said: \"O earth! Swallow up your water,\" and \"O\\n\\t\\t\\tsky! Cease your rain.\" The floodwater abated and the judgement\\n\\t\\t\\twas carried out. The ark rested on Mount Al-Judi and it was said:\\n\\t\\t\\t\"Gone are the wrongdoing people!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "45",
    "Text": "Nuh called out to his Rabb saying: \"O my Rabb! My son is of my\\n\\t\\t\\tfamily, and surely Your promise is true and You are the most just\\n\\t\\t\\tof all Judges!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "46",
    "Text": "Allah replied: \"O Nuh! In fact he is not of your family; for he\\n\\t\\t\\tis not of righteous conduct. So do not ask Me anything of which\\n\\t\\t\\tyou have no knowledge! I admonish you, lest you become one of the\\n\\t\\t\\tignorant!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "47",
    "Text": "Nuh said: \"My Rabb! I seek refuge in You for asking You that of\\n\\t\\t\\twhich I have no knowledge; and unless You forgive me and have\\n\\t\\t\\tmercy on me, I shall surely be lost!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "48",
    "Text": "It was said: \"O Nuh! Disembark (from the ark) with Our peace and\\n\\t\\t\\tblessings on you and on the peoples who are with you. As for\\n\\t\\t\\tother people, We shall grant them the provisions of life for some\\n\\t\\t\\ttime, and if they do not behave righteously, then they shall have\\n\\t\\t\\ta painful punishment from Us.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "49",
    "Text": "O Muhammad, these are some of the facts from the unseen history\\n\\t\\t\\twhich We have now revealed to you: neither you nor your people\\n\\t\\t\\tknew about it before. So have patience; surely the end is for the\\n\\t\\t\\trighteous."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "50",
    "Text": "To the people of 'Ad We sent their brother Hud. He said: \"O my\\n\\t\\t\\tpeople! Worship Allah, you have no god but Him; otherwise you are\\n\\t\\t\\tjust making things up."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "51",
    "Text": "O my people! I do not ask you any reward for my services; for\\n\\t\\t\\tnone can reward me except my creator. Will you not then use your\\n\\t\\t\\tcommon sense?"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "52",
    "Text": "And O my people! Seek forgiveness of your Rabb and turn to Him in\\n\\t\\t\\trepentance. He will send you from the sky abundant rain and He\\n\\t\\t\\twill add strength to your strength. So do not turn away like\\n\\t\\t\\tcriminals.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "53",
    "Text": "They said: \"O Hud! You have given us no clear proof. We are\\n\\t\\t\\tneither going to desert our gods just on your word, nor we are\\n\\t\\t\\tgoing to believe in you."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "54",
    "Text": "We rather believe that perhaps some of our gods have afflicted\\n\\t\\t\\tyou with evil.\" He said: \"Allah is my witness and let you also be\\n\\t\\t\\tmy witness that I am done with your shirk of worshipping other\\n\\t\\t\\tdeities besides Him."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "55",
    "Text": "So let all of you scheme against me if you will, and give me no\\n\\t\\t\\trespite."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "56",
    "Text": "I have put my trust in Allah, Who is my Rabb and your Rabb. There\\n\\t\\t\\tis no living creature (in the Earth) whose destiny is not\\n\\t\\t\\tcontrolled by Him. Indeed straight is the Way of my Rabb."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "57",
    "Text": "Now, even if you turn away, I have at least conveyed the message\\n\\t\\t\\twith which I was sent to you. Since you have denied Him, my Rabb\\n\\t\\t\\twill raise up some other people in your place, and you cannot\\n\\t\\t\\tharm Him in any way. Indeed my Rabb is watching over everything.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "58",
    "Text": "When Our judgement came to pass, We saved Hud and those who\\n\\t\\t\\tbelieved with him through a special grace from Us - We did save\\n\\t\\t\\tthem from a horrifying scourge."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "59",
    "Text": "Such were the people of 'Ad. They denied the revelations of their\\n\\t\\t\\tRabb, disobeyed His Rasool, and followed the command of every\\n\\t\\t\\tstubborn oppressor."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "60",
    "Text": "They were followed by a curse in this world, and cursed they\\n\\t\\t\\tshall be on the Day of Resurrection. Beware! 'Ad denied their\\n\\t\\t\\tRabb. Beware! Gone are 'Ad, the people of Hud."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "61",
    "Text": "To the Thamud people, We sent their brother Saleh. He said: \"O my\\n\\t\\t\\tpeople! Worship Allah, you have no god but Him. It is He Who\\n\\t\\t\\tcreated you from the Earth and made it a dwelling place for you.\\n\\t\\t\\tSo seek forgiveness from Him and turn to Him in repentance.\\n\\t\\t\\tSurely my Rabb is very close, ready to answer.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "62",
    "Text": "They said: \"O Saleh! Till now you were the one in whom we had\\n\\t\\t\\tgreat expectations! Would you now forbid us the worship of what\\n\\t\\t\\tour forefathers worshipped? Indeed, we strongly doubt that to\\n\\t\\t\\twhich you are calling us.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "63",
    "Text": "He said: \"O my people! Tell me, if I have a clear proof from my\\n\\t\\t\\tRabb and He has granted me mercy from Himself - who then will\\n\\t\\t\\thelp me against Allah if I disobey Him? What would you add other\\n\\t\\t\\tthan to make me lose even more?"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "64",
    "Text": "And O my people! This she-camel of Allah is a sign for you. Leave\\n\\t\\t\\ther to pasture on Allah's earth and do not molest her lest a\\n\\t\\t\\tswift scourge should fall upon you!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "65",
    "Text": "But, even after the warning, they hamstring her. So he said: \"You\\n\\t\\t\\thave but three days to enjoy your homes, that is a promise which\\n\\t\\t\\twill not be repudiated!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "66",
    "Text": "When Our Judgement came to pass, We saved Saleh and those who\\n\\t\\t\\tbelieved with him, through a special grace from Us, from the\\n\\t\\t\\tdisgrace of that Day. Indeed your Rabb is All-Strong, All-Mighty."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "67",
    "Text": "A terrible blast overtook the wrongdoers and by the morning they\\n\\t\\t\\twere laying with their faces down in their homes,"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "68",
    "Text": "as if they had never flourished there. Beware! Thamud denied\\n\\t\\t\\ttheir Rabb. Gone are the people of Thamud."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "69",
    "Text": "Our Messengers came to Ibrahim (Abraham) with good news. They\\n\\t\\t\\tsaid \"Peace be upon you.\" He answered \"Peace be upon you too,\"\\n\\t\\t\\tand hastened to entertain them with a roasted calf."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "70",
    "Text": "But when he saw their hands were not extended towards it, he felt\\n\\t\\t\\tuneasy with them and started to be afraid of them. They said: \"Do\\n\\t\\t\\tnot fear. We have been sent to the people of Lut.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "71",
    "Text": "His wife, who was standing there, laughed when We gave her good\\n\\t\\t\\tnews of Allah's giving her a son Ishaq (Isaac) and after him a\\n\\t\\t\\tgrandson Ya'qoob (Jacob)."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "72",
    "Text": "She said: \"O wonder! (An expression to indicate surprise) Shall I\\n\\t\\t\\tbear a child now when I have become an old woman and my husband\\n\\t\\t\\thas become well advanced in age? This is indeed a strange thing!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "73",
    "Text": "They said: \"Do you wonder at Allah's decree? May Allah's mercy\\n\\t\\t\\tand His blessings be upon you, O residents of the household; for\\n\\t\\t\\tHe is indeed worthy of all praise, full of all glory.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "74",
    "Text": "When the fear of Ibrahim was gone as the good news (of his son\\n\\t\\t\\tand grand son) came to him, he began to plead with Us for the\\n\\t\\t\\tpeople of Lut."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "75",
    "Text": "Indeed Ibrahim was forbearing, tenderhearted and devout."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "76",
    "Text": "The angels said: \"O Ibrahim! Leave this topic. The decree of your\\n\\t\\t\\tRabb has already been issued, now there must come to them a\\n\\t\\t\\tpunishment that cannot be averted!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "77",
    "Text": "When Our messengers, in the form of beautiful young men, came to\\n\\t\\t\\tLut, he became upset about them, for he felt helpless to offer\\n\\t\\t\\tthem protection against his nation's many violent homosexual men.\\n\\t\\t\\tHe said: \"This is a critical day.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "78",
    "Text": "No sooner did the guests come to him than his people, long\\n\\t\\t\\taddicted to evil practices, came rushing towards him. He said: \"O\\n\\t\\t\\tmy people! Here are my daughters - they are purer for you. Now,\\n\\t\\t\\tfear Allah and do not humiliate me by insulting my guests. Is\\n\\t\\t\\tthere not even one good man among you?\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "79",
    "Text": "They said: \"Well you know, we have no right to your daughters.\\n\\t\\t\\tYou know fully well what we want.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "80",
    "Text": "He said: \"I wish I had power to suppress you or could find some\\n\\t\\t\\tpowerful support.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "81",
    "Text": "The messengers said: \"O Lut! We are the messengers of your Rabb.\\n\\t\\t\\tThey will not be able to harm you. Now, take your family and get\\n\\t\\t\\tout of this town while yet a part of the night remains - and let\\n\\t\\t\\tnone of you turn back - except your wife, who should be left\\n\\t\\t\\tbehind. She will face the same fate as they. Their scheduled time\\n\\t\\t\\tof doom is the morning. Is not the morning very close?\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "82",
    "Text": "When Our Judgement came to pass, We turned the cities upside down\\n\\t\\t\\tand rained down on them brimstones of baked clay, layer upon\\n\\t\\t\\tlayer,"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "83",
    "Text": "specially marked by your Rabb. Such scourge is not far off from\\n\\t\\t\\tthe wrongdoers!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "84",
    "Text": "To the people of Median We sent their brother Shu'aib. He said:\\n\\t\\t\\t\"O my people! Worship Allah, you have no god but Him. Do not give\\n\\t\\t\\tshort measure and weight. Although I see you in prosperity today,\\n\\t\\t\\tI fear for you the scourge of a Day that will encircle you."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "85",
    "Text": "O my people! Give full measure and weight in all fairness. Do not\\n\\t\\t\\tdefraud people of their goods and do not spread mischief in the\\n\\t\\t\\tland."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "86",
    "Text": "What remains with Allah is better for you if you are true\\n\\t\\t\\tbelievers, and I am not set up as a guardian over you.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "87",
    "Text": "They said: \"Oh Shu'aib! Does your Salah (prayer) command you that\\n\\t\\t\\twe give up all those deities whom our forefathers worshiped or\\n\\t\\t\\tthat we have no right of doing what we like with our own goods?\\n\\t\\t\\tFor sure, you are the only gracious and righteous man left in the\\n\\t\\t\\tland!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "88",
    "Text": "He said: \"O my people! You see, if I have a clear sign from my\\n\\t\\t\\tRabb and He has given me good sustenance from Himself how can I,\\n\\t\\t\\tthen, be a party to your evil and unlawful practices? I do not\\n\\t\\t\\twant to oppose you in what I am forbidding you. I desire nothing\\n\\t\\t\\tbut to reform so far as I can manage. My success in this task\\n\\t\\t\\tdepends entirely on the help of Allah; in Him do I trust and to\\n\\t\\t\\tHim do I turn for everything."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "89",
    "Text": "O my people! Let not my dispute with you bring upon you the doom\\n\\t\\t\\tsimilar to that of the people of Nuh or of Hud or of Saleh, nor\\n\\t\\t\\tare the people of Lut far off from you;"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "90",
    "Text": "seek forgiveness of your Rabb and turn to Him in repentance; for\\n\\t\\t\\tmy Rabb is indeed Merciful, Affectionate.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "91",
    "Text": "They said: \"O Shu'aib! We do not comprehend much of what you say.\\n\\t\\t\\tIn fact, we see that you are a powerless person among us. Were it\\n\\t\\t\\tnot for your family, we certainly would have stoned you, for you\\n\\t\\t\\tare not strong enough to prevail against us.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "92",
    "Text": "He said: \"O my people! Do you regard my family to be more\\n\\t\\t\\tpowerful than Allah, that you have disregarded Him totally as a\\n\\t\\t\\tthing cast behind your back? Surely my Rabb encompasses all that\\n\\t\\t\\tyou do."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "93",
    "Text": "O my people! You keep on doing your way, and I shall keep up\\n\\t\\t\\tmine: soon you will find out who receives the disgraceful\\n\\t\\t\\tpunishment and who is a liar! Wait if you will; I too am waiting\\n\\t\\t\\twith you!\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "94",
    "Text": "When Our judgement came to pass, We delivered Shu'aib and those\\n\\t\\t\\twho believed with him through Our special mercy. A mighty blast\\n\\t\\t\\tseized the wrongdoers and they lay dead with their faces down in\\n\\t\\t\\ttheir homes by the morning,"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "95",
    "Text": "as if they had never flourished there. Behold! Like Thamud, gone\\n\\t\\t\\tare the people of Median!"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "96",
    "Text": "We sent Musa with Our signs and clear authority"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "97",
    "Text": "to Fir'on (Pharaoh) and his chiefs; but they followed the command\\n\\t\\t\\tof Fir'on, and the command of Fir'on was not right."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "98",
    "Text": "He will be in front of his people on the Day of Resurrection, and\\n\\t\\t\\twill bring them down to Hell. How awful will be the place to\\n\\t\\t\\twhich they will be brought?"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "99",
    "Text": "A curse followed them in this life, and a curse will follow them\\n\\t\\t\\ton the Day of Resurrection. What an evil reward for one to\\n\\t\\t\\treceive."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "100",
    "Text": "These are the stories of the nations which We relate to you; of\\n\\t\\t\\tthem some have survived and some have ceased to exist."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "101",
    "Text": "We were not unjust to them, but they were unjust to themselves.\\n\\t\\t\\tThe deities they invoked beside Allah did not avail them when the\\n\\t\\t\\tjudgement of your Rabb came to pass; they added nothing to their\\n\\t\\t\\tlot but perdition."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "102",
    "Text": "Such is the scourge of your Rabb when He seizes a sinful town;\\n\\t\\t\\tindeed, His seizure is terrible and painful."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "103",
    "Text": "In fact, there is a sign in this for those who fear the\\n\\t\\t\\tpunishment of the hereafter; that is a Day in which mankind will\\n\\t\\t\\tbe gathered together and that will be a Day of Testimony."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "104",
    "Text": "We do not delay it but to the appointed deadline."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "105",
    "Text": "When the Day will come, no one shall dare to speak except with\\n\\t\\t\\tHis permission. Of them, some will be damned and some will be\\n\\t\\t\\tblessed."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "106",
    "Text": "Those who are damned shall be in the fire; in there, they will\\n\\t\\t\\thave only sighs and sobs."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "107",
    "Text": "They will dwell therein as long as the heavens and the earth\\n\\t\\t\\tshall last, unless your Rabb ordain otherwise; surely your Rabb\\n\\t\\t\\tis the mighty doer of what He intends."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "108",
    "Text": "As for those who are blessed, they shall be in paradise. They\\n\\t\\t\\twill dwell therein as long as the heavens and the earth shall\\n\\t\\t\\tlast, unless your Rabb ordain otherwise; an award which shall\\n\\t\\t\\tnever be taken away."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "109",
    "Text": "Therefore, have no doubt concerning the deities they worship, for\\n\\t\\t\\tthey blindly imitate the worship of those deities whom their\\n\\t\\t\\tforefathers used to worship before them; and surely, We shall\\n\\t\\t\\tgive them their share of punishment in full without any\\n\\t\\t\\tabatement."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "110",
    "Text": "We certainly gave the Book to Musa (Moses), but differences arose\\n\\t\\t\\tabout it; had not a Word gone forth from your Rabb, the matter\\n\\t\\t\\twould have been decided between them regarding those differences.\\n\\t\\t\\tIt is a fact that they are in suspicious doubt about this,"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "111",
    "Text": "and it is also a fact that your Rabb will give them full measure\\n\\t\\t\\tfor their deeds, for He is fully aware of what they do."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "112",
    "Text": "Therefore, stand firm on the Right Way as you are commanded,\\n\\t\\t\\ttogether with those who have turned from unbelief to belief in\\n\\t\\t\\tAllah, and do not transgress; surely, He is watching all that you\\n\\t\\t\\tdo."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "113",
    "Text": "Do not be inclined to those who are unjust, lest you be seized by\\n\\t\\t\\tthe fire; and you will not have any protector besides Allah, nor\\n\\t\\t\\tyou shall be helped."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "114",
    "Text": "Establish Salah ( prayers) at the two ends of the day and in the\\n\\t\\t\\tearly part of the night. Indeed virtues remove evils. This is a\\n\\t\\t\\treminder for the mindful."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "115",
    "Text": "Be patient; for sure Allah does not let the reward of the\\n\\t\\t\\trighteous be wasted."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "116",
    "Text": "Why were there not among the generations before you, good persons\\n\\t\\t\\twho could forbid the people from making mischief in the land,\\n\\t\\t\\texcept a few of those whom We delivered from among them? The\\n\\t\\t\\twrongdoers, however, pursued the worldly pleasure they were\\n\\t\\t\\tprovided, and became confirmed criminals."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "117",
    "Text": "It is not possible that your Rabb would destroy the towns\\n\\t\\t\\tunjustly while their habitants were to mend their ways."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "118",
    "Text": "If your Rabb had so willed, He would have certainly made mankind\\n\\t\\t\\tone single nation but that is not what He wants, so they will\\n\\t\\t\\tcontinue to differ"
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "119",
    "Text": "except those on whom He has bestowed His mercy; and that very\\n\\t\\t\\tfreedom of choice and action is the whole purpose of their\\n\\t\\t\\tcreation. That is how the Word of your Rabb, that He will fill\\n\\t\\t\\tHell with jinns and human beings all together, will be fulfilled."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "120",
    "Text": "All these stories of the prior Rasools that We relate to you (O\\n\\t\\t\\tMuhammad) are to strengthen your heart therewith; through these\\n\\t\\t\\tyou have received the knowledge of reality and the believers have\\n\\t\\t\\tgotten admonition and a reminder."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "121",
    "Text": "As for those who are unbelievers, say to them: \"Do whatever you\\n\\t\\t\\twant, and so shall we."
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "122",
    "Text": "Wait if you will! Sure, we too shall wait.\""
  },
  {
    "SurahNumber": "11",
    "AyahNumber": "123",
    "Text": "Allah Alone has the knowledge of what is hidden in the heavens\\n\\t\\t\\tand the earth, and everything shall ultimately return to Him for\\n\\t\\t\\tdecision; Therefore, worship Him and put your trust in Him, and\\n\\t\\t\\tyour Rabb is not unmindful of what you do."
  }
]
