[
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/022001",
        "Body":  "O mankind! Fear your Lord. Lo! the earthquake of the Hour (of\n\t\t\tDoom) is a tremendous thing."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/022010",
        "Body":  "(And unto him it will be said): This is for that which thy two\n\t\t\thands have sent before, and because Allah is no oppressor of His\n\t\t\tslaves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/022011",
        "Body":  "And among mankind is he who worshippeth Allah upon a narrow marge\n\t\t\tso that if good befalleth him he is content therewith, but if a\n\t\t\ttrial befalleth him, he falleth away utterly. He loseth both the\n\t\t\tworld and the Hereafter. That is the sheer loss."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/022012",
        "Body":  "He calleth, beside Allah, unto that which hurteth him not nor\n\t\t\tbenefiteth him. That is the far error."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/022013",
        "Body":  "He calleth unto him whose harm is nearer than his benefit; verily\n\t\t\tan evil patron and verily an evil friend!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/022014",
        "Body":  "Lo! Allah causeth those who believe and do good works to enter\n\t\t\tthe Gardens underneath which rivers flow. Lo! Allah doth what He\n\t\t\tintendeth."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/022015",
        "Body":  "Whoso is wont to think (through envy) that Allah will not give\n\t\t\thim (Muhammad) victory in the world and the Hereafter (and is\n\t\t\tenraged at the thought of his victory), let him stretch a rope up\n\t\t\tto the roof (of his dwelling), and let him hang himself. Then let\n\t\t\thim see whether his strategy dispelleth that whereat he rageth!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/022016",
        "Body":  "Thus We reveal it as plain revelations, and verily Allah guideth\n\t\t\twhom He will."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/022017",
        "Body":  "Lo! those who believe (this Revelation), and those who are Jews,\n\t\t\tand the Sabaeans and the Christians and the Magians and the\n\t\t\tidolaters--Lo! Allah will decide between them on the Day of\n\t\t\tResurrection. Lo! Allah is Witness over all things."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/022018",
        "Body":  "Hast thou not seen that unto Allah payeth adoration whosoever is\n\t\t\tin the heavens and whosoever is in the earth, and the sun, and\n\t\t\tthe moon, and the stars, and the hills, and the trees, and the\n\t\t\tbeasts, and many of mankind, while there are many unto whom the\n\t\t\tdoom is justly due. He whom Allah scorneth, there is none to give\n\t\t\thim honor. Lo! Allah doeth what He will."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/022019",
        "Body":  "These twain (the believers and the disbelievers) are two\n\t\t\topponents who contend concerning their Lord. But as for those who\n\t\t\tdisbelieve, garments of fire will be cut out for them; boiling\n\t\t\tfluid will be poured down on their heads."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/022002",
        "Body":  "On the day when ye behold it, every nursing mother will forget\n\t\t\ther nursling and every pregnant one will be delivered of her\n\t\t\tburden, and thou (Muhammad) wilt see mankind as drunken, yet they\n\t\t\twill not be drunken, but the Doom of Allah will be strong (upon\n\t\t\tthem)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/022020",
        "Body":  "Whereby that which is in their bellies, and their skins too, will\n\t\t\tbe melted;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/022021",
        "Body":  "And for them are hooked rods of iron."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/022022",
        "Body":  "Whenever, in their anguish, they would go forth from thence they\n\t\t\tare driven back therein and (it is said unto them): Taste the\n\t\t\tdoom of burning."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/022023",
        "Body":  "Lo! Allah will cause those who believe and do good works to enter\n\t\t\tGardens underneath which rivers flow, wherein they will be\n\t\t\tallowed armlets of gold, and pearls, and their raiment therein\n\t\t\twill be silk."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/022024",
        "Body":  "They are guided unto gentle speech; they are guided unto the path\n\t\t\tof the Glorious One."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "25",
        "Recitation":  "Alafasy_128kbps/022025",
        "Body":  "Lo! those who disbelieve and bar (men) from the way of Allah and\n\t\t\tfrom the Inviolable Place of Worship, which We have appointed for\n\t\t\tmankind together, the dweller therein and the nomad; whosoever\n\t\t\tseeketh wrongful partiality therein, him We shall cause to taste\n\t\t\ta painful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "26",
        "Recitation":  "Alafasy_128kbps/022026",
        "Body":  "And (remember) when We prepared for Abraham the place of the\n\t\t\t(holy) House, saying: Ascribe thou no thing as partner unto Me,\n\t\t\tand purify My House for those who make the round (thereof) and\n\t\t\tthose who stand and those who bow and make prostration."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "27",
        "Recitation":  "Alafasy_128kbps/022027",
        "Body":  "And proclaim unto mankind the Pilgrimage. They will come unto\n\t\t\tthee on foot and on every lean camel; they will come from every\n\t\t\tdeep ravine."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "28",
        "Recitation":  "Alafasy_128kbps/022028",
        "Body":  "That they may witness things that are of benefit to them, and\n\t\t\tmention the name of Allah on appointed days over the beast of\n\t\t\tcattle that He hath bestowed upon them. Then eat thereof and feed\n\t\t\ttherewith the poor unfortunate."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "29",
        "Recitation":  "Alafasy_128kbps/022029",
        "Body":  "Then let them make an end of their unkemptness and pay their vows\n\t\t\tand go around the ancient House."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/022003",
        "Body":  "Among mankind is he who disputeth concerning Allah without\n\t\t\tknowledge, and followeth each froward devil;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "30",
        "Recitation":  "Alafasy_128kbps/022030",
        "Body":  "That (is the command). And whoso magnifieth the sacred things of\n\t\t\tAllah, it will be well for him in the sight of his Lord. The\n\t\t\tcattle are lawful unto you save that which hath been told you. So\n\t\t\tshun the filth of idols, and shun lying speech."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "31",
        "Recitation":  "Alafasy_128kbps/022031",
        "Body":  "Turning unto Allah (only), not ascribing partners unto Him; for\n\t\t\twhoso ascribeth partners unto Allah, it is as if he had fallen\n\t\t\tfrom the sky and the birds had snatched him or the wind had blown\n\t\t\thim to a far off place."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "32",
        "Recitation":  "Alafasy_128kbps/022032",
        "Body":  "That (is the command). And whoso magnifieth the offerings\n\t\t\tconsecrated to Allah, it surely is from devotion of the hearts."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "33",
        "Recitation":  "Alafasy_128kbps/022033",
        "Body":  "Therein are benefits for you for an appointed term; and afterward\n\t\t\tthey are brought for sacrifice unto the ancient House."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "34",
        "Recitation":  "Alafasy_128kbps/022034",
        "Body":  "And for every nation have We appointed a ritual, that they may\n\t\t\tmention the name of Allah over the beast of cattle that He hath\n\t\t\tgiven them for food; and your God is One God, therefor surrender\n\t\t\tunto Him. And give good tidings (O Muhammad) to the humble."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "35",
        "Recitation":  "Alafasy_128kbps/022035",
        "Body":  "Whose hearts fear when Allah is mentioned, and the patient of\n\t\t\twhatever may befall them, and those who establish worship and who\n\t\t\tspend of that We have bestowed on them."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "36",
        "Recitation":  "Alafasy_128kbps/022036",
        "Body":  "And the camels! We have appointed them among the ceremonies of\n\t\t\tAllah. Therein ye have much good. So mention the name of Allah\n\t\t\tover them when they are drawn up in lines. Then when their flanks\n\t\t\tfall (dead), eat thereof and feed the beggar and the suppliant.\n\t\t\tThus have We made them subject unto you, that haply ye may give\n\t\t\tthanks."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "37",
        "Recitation":  "Alafasy_128kbps/022037",
        "Body":  "Their flesh and their blood reach not Allah, but the devotion\n\t\t\tfrom you reacheth Him. Thus have We made them subject unto you\n\t\t\tthat ye may magnify Allah that He hath guided you. And give good\n\t\t\ttidings (O Muhammad) to the good."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "38",
        "Recitation":  "Alafasy_128kbps/022038",
        "Body":  "Lo! Allah defendeth those who are true. Lo! Allah loveth not each\n\t\t\ttreacherous ingrate."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "39",
        "Recitation":  "Alafasy_128kbps/022039",
        "Body":  "Sanction is given unto those who fight because they have been\n\t\t\twronged; and Allah is indeed Able to give them victory;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/022004",
        "Body":  "For him it is decreed that whoso taketh him for friend, be verily\n\t\t\twill mislead him and will guide him to the punishment of the\n\t\t\tFlame."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "40",
        "Recitation":  "Alafasy_128kbps/022040",
        "Body":  "Those who have been driven from their homes unjustly only because\n\t\t\tthey said: Our Lord is Allah--For had it not been for Allah\u0027s\n\t\t\trepelling some men by means of others, cloisters and churches and\n\t\t\toratories and mosques, wherein the name of Allah is oft\n\t\t\tmentioned, would assuredly have been pulled down. Verily Allah\n\t\t\thelpeth one who helpeth Him. Lo! Allah is Strong, Almighty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "41",
        "Recitation":  "Alafasy_128kbps/022041",
        "Body":  "Those who, if We give them power in the land, establish worship\n\t\t\tand pay the poor due and enjoin kindness and forbid iniquity. And\n\t\t\tAllah\u0027s is the sequel of events."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "42",
        "Recitation":  "Alafasy_128kbps/022042",
        "Body":  "If they deny thee (Muhammad), even so the folk of Noah, and (the\n\t\t\ttribes of) Aad and Thamud, before thee, denied (Our messengers);"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "43",
        "Recitation":  "Alafasy_128kbps/022043",
        "Body":  "And the folk of Abraham and the folk of Lot;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "44",
        "Recitation":  "Alafasy_128kbps/022044",
        "Body":  "(And) the dwellers in Midian. And Moses was denied; but I\n\t\t\tindulged the disbelievers a long while, then I seized them, and\n\t\t\thow (terrible) was My abhorrence!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "45",
        "Recitation":  "Alafasy_128kbps/022045",
        "Body":  "How many a township have We destroyed while it was sinful, so\n\t\t\tthat it lieth (to this day) in, and (how many) a deserted well\n\t\t\tand lofty tower!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "46",
        "Recitation":  "Alafasy_128kbps/022046",
        "Body":  "Have they not travelled in the land, and have they hearts\n\t\t\twherewith to feel and ears wherewith to hear? For indeed it is\n\t\t\tnot the eyes that grow blind, but it is the hearts, which are\n\t\t\twithin the bosoms, that grow blind."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "47",
        "Recitation":  "Alafasy_128kbps/022047",
        "Body":  "And they will bid thee hasten on the Doom, and Allah faileth not\n\t\t\tHis promise, but lo! a Day with Allah is as a thousand years of\n\t\t\twhat ye reckon."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "48",
        "Recitation":  "Alafasy_128kbps/022048",
        "Body":  "And how many a township did I suffer long though it was sinful!\n\t\t\tThen I grasped it. Unto Me is the return."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "49",
        "Recitation":  "Alafasy_128kbps/022049",
        "Body":  "Say: O mankind! I am only a plain warner unto you."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/022005",
        "Body":  "O mankind! if ye are in doubt concerning the Resurrection, then\n\t\t\tlo! We have created you from dust, then from a drop of seed, then\n\t\t\tfrom a clot, then from a little lump of flesh shapely and\n\t\t\tshapeless, that We may make (it) clean for you. And We cause what\n\t\t\tWe will to remain in the wombs for an appointed time, and\n\t\t\tafterward We bring you forth as infants, then (give you growth)\n\t\t\tthat ye attain your full strength. And among you there is he who\n\t\t\tdieth (young), and among you there is he who is brought back to\n\t\t\tthe most abject time of life, so that, after knowledge, he\n\t\t\tknoweth naught. And thou (Muhammad) seest the earth barren, but\n\t\t\twhen We send down water thereon, it doth thrill and swell and put\n\t\t\tforth every lovely kind (of growth)."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "50",
        "Recitation":  "Alafasy_128kbps/022050",
        "Body":  "Those who believe and do good works, for them pardon and a rich\n\t\t\tprovision;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "51",
        "Recitation":  "Alafasy_128kbps/022051",
        "Body":  "While those who strive to thwart Our revelations, such are\n\t\t\trightful owners of the Fire."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "52",
        "Recitation":  "Alafasy_128kbps/022052",
        "Body":  "Never sent We a messenger or a Prophet before thee but when He\n\t\t\trecited (the message) Satan proposed (opposition) in respect of\n\t\t\tthat which he recited thereof. But Allah abolisheth that which\n\t\t\tSatan proposeth. Then Allah establisheth His revelations. Allah\n\t\t\tis Knower, Wise;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "53",
        "Recitation":  "Alafasy_128kbps/022053",
        "Body":  "That He may make that which the devil proposeth a temptation for\n\t\t\tthose in whose hearts is a disease, and those whose hearts are\n\t\t\thardened--Lo! the evil-doers are in open schism--"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "54",
        "Recitation":  "Alafasy_128kbps/022054",
        "Body":  "And that those who have been given knowledge may know that it is\n\t\t\tthe truth from thy Lord, so that they may believe therein and\n\t\t\ttheir hearts may submit humbly unto Him. Lo! Allah verily is\n\t\t\tguiding those who believe unto a right path."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "55",
        "Recitation":  "Alafasy_128kbps/022055",
        "Body":  "And those who disbelieve will not cease to be in doubt thereof\n\t\t\tuntil the Hour come upon them unawares, or there come unto them\n\t\t\tthe doom of a disastrous day."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "56",
        "Recitation":  "Alafasy_128kbps/022056",
        "Body":  "The Sovereignty on that day will be Allah\u0027s. He will judge\n\t\t\tbetween them. Then those who believed and did good works will be\n\t\t\tin Gardens of Delight,"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "57",
        "Recitation":  "Alafasy_128kbps/022057",
        "Body":  "While those who disbelieved and denied Our revelations, for them\n\t\t\twill be a shameful doom."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "58",
        "Recitation":  "Alafasy_128kbps/022058",
        "Body":  "Those who fled their homes for the cause of Allah and then were\n\t\t\tslain or died, Allah verily will provide for them a good\n\t\t\tprovision. Lo! Allah, He verily is Best of all who make\n\t\t\tprovision."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "59",
        "Recitation":  "Alafasy_128kbps/022059",
        "Body":  "Assuredly He will cause them to enter by an entry that they will\n\t\t\tlove. Lo! Allah verily is Knower, Indulgent."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/022006",
        "Body":  "That is because Allah, He is the Truth. Lo! He quickeneth the\n\t\t\tdead, and lo! He is Able to do all things;"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "60",
        "Recitation":  "Alafasy_128kbps/022060",
        "Body":  "That (is so). And whoso hath retaliated with the like of that\n\t\t\twhich he was made to suffer and then hath (again) been wronged,\n\t\t\tAllah will succour him. Lo! Allah verily is Mild, Forgiving."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "61",
        "Recitation":  "Alafasy_128kbps/022061",
        "Body":  "That is because Allah maketh the night to pass into the day and\n\t\t\tmaketh the day to pass into the night, and because Allah is\n\t\t\tHearer, Seer."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "62",
        "Recitation":  "Alafasy_128kbps/022062",
        "Body":  "That is because Allah, He is the True, and that whereon they call\n\t\t\tinstead of Him, it is the False, and because Allah, He is the\n\t\t\tHigh, the Great."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "63",
        "Recitation":  "Alafasy_128kbps/022063",
        "Body":  "Seest thou not how Allah sendeth down water from the sky and then\n\t\t\tthe earth becometh green upon the morrow? Lo! Allah is Subtile,\n\t\t\tAware."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "64",
        "Recitation":  "Alafasy_128kbps/022064",
        "Body":  "Unto Him belongeth all that is in the heavens and all that is in\n\t\t\tthe earth. Lo! Allah, He verily is the Absolute, the Owner of\n\t\t\tPraise."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "65",
        "Recitation":  "Alafasy_128kbps/022065",
        "Body":  "Hast thou not seem how Allah hath made all that is in the earth\n\t\t\tsubservient unto you? And the sap runneth upon the sea by His\n\t\t\tcommand, and He holdeth back the heaven from falling on the earth\n\t\t\tunless by His leave. Lo! Allah is, for mankind, Full of Pity,\n\t\t\tMerciful."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "66",
        "Recitation":  "Alafasy_128kbps/022066",
        "Body":  "And He it is Who gave you life, then He will cause you to die,\n\t\t\tand then will give you life (again). Lo! man is verily an\n\t\t\tingrate."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "67",
        "Recitation":  "Alafasy_128kbps/022067",
        "Body":  "Unto each nation have We given sacred rites which they are to\n\t\t\tperform; so let them not dispute with thee of the matter, but\n\t\t\tsummon thou unto thy Lord. Lo! thou indeed followest right\n\t\t\tguidance."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "68",
        "Recitation":  "Alafasy_128kbps/022068",
        "Body":  "And if thy wrangle with thee, say: Allah is best aware of what ye\n\t\t\tdo."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "69",
        "Recitation":  "Alafasy_128kbps/022069",
        "Body":  "Allah will judge between you on the Day of Resurrection\n\t\t\tconcerning that wherein ye used to differ."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/022007",
        "Body":  "And because the Hour will come, there is no doubt thereof; and\n\t\t\tbecause Allah will raise those who are in the graves."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "70",
        "Recitation":  "Alafasy_128kbps/022070",
        "Body":  "Hast thou not known that Allah knoweth all that is in the heaven\n\t\t\tand the earth? Lo! it is in a record. Lo! that is easy for Allah."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "71",
        "Recitation":  "Alafasy_128kbps/022071",
        "Body":  "And they worship instead of Allah that for which no warrant hath\n\t\t\tbeen revealed unto them, and that whereof they have no knowledge.\n\t\t\tFor evil-doers there is no helper."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "72",
        "Recitation":  "Alafasy_128kbps/022072",
        "Body":  "And when Our revelations are recited unto them, thou knowest the\n\t\t\tdenial in the faces of those who disbelieve; they all but attack\n\t\t\tthose who recite Our revelations unto them. Say: Shall I proclaim\n\t\t\tunto you worse than that? The Fire! Allah hath promised it for\n\t\t\tthose who disbelieve. A hapless journey\u0027s end!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "73",
        "Recitation":  "Alafasy_128kbps/022073",
        "Body":  "O mankind! A similitude is coined, so pay ye heed to it: Lo!\n\t\t\tthose on whom ye call beside Allah will never create a fly though\n\t\t\tthey combine together for the purpose. And if the fly took\n\t\t\tsomething from them, they could not rescue it from him. So weak\n\t\t\tare (both) the seeker and the sought!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "74",
        "Recitation":  "Alafasy_128kbps/022074",
        "Body":  "They measure not Allah His rightful measure. Lo! Allah is Strong,\n\t\t\tAlmighty."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "75",
        "Recitation":  "Alafasy_128kbps/022075",
        "Body":  "Allah chooseth from the angels messengers, and (also) from\n\t\t\tmankind. Lo! Allah is Hearer, Seer."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "76",
        "Recitation":  "Alafasy_128kbps/022076",
        "Body":  "He knoweth all that is before them and all that is behind them,\n\t\t\tand unto Allah all things are returned."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "77",
        "Recitation":  "Alafasy_128kbps/022077",
        "Body":  "O, ye who believe! Bow down and prostrate yourselves, and worship\n\t\t\tyour Lord, and do good, that haply ye may prosper."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "78",
        "Recitation":  "Alafasy_128kbps/022078",
        "Body":  "And strive for Allah with the endeavor which is His right. He\n\t\t\thath chosen you and hath not laid upon you in religion any\n\t\t\thardship; the faith of your father Abraham (is yours). He hath\n\t\t\tnamed you Muslims of old time and in this (Scripture), that the\n\t\t\tmessenger may be a witness against you, and that ye may be\n\t\t\twitnesses against mankind. So establish worship, pay the poor\n\t\t\tdue, and hold fast to Allah. He is your Protecting Friend. A\n\t\t\tblessed Patron and a blessed Helper!"
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/022008",
        "Body":  "And among mankind is he who disputeth concerning Allah without\n\t\t\tknowledge or guidance or a Scripture giving light."
    },
    {
        "BookCode":  "PIK",
        "SurahNumber":  "22",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/022009",
        "Body":  "Turning away in pride to beguile (men) from the way of Allah. For\n\t\t\thim in this world is ignominy, and on the Day of Resurrection We\n\t\t\tmake him taste the doom of burning."
    }
]
