[
  {
    "SurahNumber": "54",
    "AyahNumber": "1",
    "Text": "The Hour of Doom is drawing near, the moon has split asunder;\\n\\t\\t\\twhich is a clear proof that the same thing can happen to the\\n\\t\\t\\tearth."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "2",
    "Text": "Yet when they see a sign, the unbelievers turn their backs and\\n\\t\\t\\tsay: \"This is an ingenious magic.\""
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "3",
    "Text": "They deny this and keep on following their own fancies.\\n\\t\\t\\tUltimately every matter shall be laid to rest."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "4",
    "Text": "There has already come to them the information of former nations\\n\\t\\t\\tcontaining enough deterrents"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "5",
    "Text": "and profound wisdom to serve as a warning, but warnings are of no\\n\\t\\t\\tuse to these people."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "6",
    "Text": "Therefore, O Prophet, let them be. On the Day when the caller\\n\\t\\t\\twill call them to a terrible event."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "7",
    "Text": "They shall come out from their graves, like swarming locusts,\\n\\t\\t\\twith downcast eyes,"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "8",
    "Text": "rushing towards the caller and the same unbelievers will cry:\\n\\t\\t\\t\"This is indeed an awful Day!\""
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "9",
    "Text": "Long before them, the people of Nuh (Noah) disbelieved. They\\n\\t\\t\\trejected Our servant, called him a madman and drove him out."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "10",
    "Text": "After admonishing the people for 950 years, finally he cried out:\\n\\t\\t\\t\"Help me, O Rabb, I have been overcomed!\""
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "11",
    "Text": "So We opened the gates of heaven with pouring rain"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "12",
    "Text": "and caused the earth to burst with gushing springs, and the\\n\\t\\t\\twaters met to fulfill the decreed end."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "13",
    "Text": "We carried him in an Ark built with planks and nails,"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "14",
    "Text": "which drifted on under Our care: a reward for him (Noah) who was\\n\\t\\t\\tdenied by the unbelievers."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "15",
    "Text": "We have left that Ark as a sign, so is there any who would take\\n\\t\\t\\tadmonition?"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "16",
    "Text": "How terrible was My scourge and how clear My warning!"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "17",
    "Text": "We have indeed made the Qur'an very easy to understand the\\n\\t\\t\\tadmonition: but is there any who would take admonition?"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "18",
    "Text": "Likewise the people of 'Ad did not believe then how terrible was\\n\\t\\t\\tMy scourge and how clear My Warning!"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "19",
    "Text": "We let loose on them a tornado, on the day of their bitter\\n\\t\\t\\tmisfortune,"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "20",
    "Text": "which snatched them off like trunks of uprooted palm-trees."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "21",
    "Text": "How terrible was My scourge and how clear My warning!"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "22",
    "Text": "We have indeed made the Qur'an very easy to understand the\\n\\t\\t\\tadmonition, so is there any who would take admonition?"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "23",
    "Text": "The people of Thamud disbelieved Our warning,"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "24",
    "Text": "saying: \"Are we to follow a human who stands alone among us? That\\n\\t\\t\\twould surely be an error and madness."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "25",
    "Text": "Was he the only person among us to receive this warning? Nay! He\\n\\t\\t\\tis indeed an insolent liar.\""
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "26",
    "Text": "To Our Rasool Saleh, We said: \"Tomorrow they shall find out who\\n\\t\\t\\tis an insolent liar."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "27",
    "Text": "We are going to send the she-camel as a trial for them.\\n\\t\\t\\tTherefore, watch them and have patience."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "28",
    "Text": "Tell them that the water must be shared between them and the\\n\\t\\t\\tshe-camel, and each will come to the water at its own turn."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "29",
    "Text": "At last the people of Thamud called out to one of their\\n\\t\\t\\tcompanions, who took the responsibility and hamstrung her."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "30",
    "Text": "Then how terrible was My scourge and how clear My warning!"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "31",
    "Text": "We let loose on them one mighty blast and they became like the\\n\\t\\t\\ttrampled twigs used by a fence builder."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "32",
    "Text": "We have indeed made the Qur'an very easy to understand the\\n\\t\\t\\tadmonition, so is there any who would take admonition?"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "33",
    "Text": "Another example is the people of Lut (Lot) who disbelieved Our\\n\\t\\t\\twarning."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "34",
    "Text": "We let loose on them a stone-charged tornado which spared none\\n\\t\\t\\texcept Lut's household, whom We saved by early dawn"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "35",
    "Text": "through Our grace. Thus do We reward those who give thanks."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "36",
    "Text": "Lut did warn them of Our scourge but they doubted his warnings."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "37",
    "Text": "They even sought to snatch away his guests from him but We\\n\\t\\t\\tblinded their eyes, and said: \"Now taste My punishment and the\\n\\t\\t\\tresult of disbelieving My warning.\""
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "38",
    "Text": "At daybreak they were overtaken by a lasting punishment"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "39",
    "Text": "as if to say: \"Now taste My punishment and the result of\\n\\t\\t\\tdisbelieving My warning.\""
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "40",
    "Text": "We have indeed made the Qur'an very easy to understand the\\n\\t\\t\\tadmonition, so is there any who would take admonition?"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "41",
    "Text": "My warnings also came to the people of Fir'on (Pharaoh)."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "42",
    "Text": "They disbelieved all Our signs. Consequently, We seized them the\\n\\t\\t\\tway a mighty powerful competent would seize."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "43",
    "Text": "O Qureysh, are your unbelievers better than they were, or have\\n\\t\\t\\tyou been granted an immunity in the Sacred Books?"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "44",
    "Text": "Or, do they say: \"Acting together, we can defend ourselves?\""
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "45",
    "Text": "Soon will their multitude be routed and put to flight."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "46",
    "Text": "Nay! The Hour of Judgment is the time promised to deal with them.\\n\\t\\t\\tThat hour will be the most grievous and bitter."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "47",
    "Text": "Yet, surely the wicked people persist in error and madness."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "48",
    "Text": "On that Day when they will be dragged into the fire with their\\n\\t\\t\\tfaces downwards, We shall say: \"Feel the touch of hell!\""
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "49",
    "Text": "Surely We have created everything in perfect estimation (destiny\\n\\t\\t\\tand purpose)."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "50",
    "Text": "We command but once and Our will is done in the twinkling of an\\n\\t\\t\\teye."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "51",
    "Text": "O disbelievers, We have already destroyed many like you. Will you\\n\\t\\t\\tnot take admonition?"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "52",
    "Text": "All that they do is being added to their record books:"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "53",
    "Text": "every action, small and big is being noted down."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "54",
    "Text": "Surely the righteous will be in the midst of gardens and rivers,"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "55",
    "Text": "a place of true honor, in the presence of Almighty Sovereign."
  }
]
