[
  {
    "SurahNumber": "107",
    "AyahNumber": "1",
    "NoteID": "6281",
    "Body": "Din may mean either (1) the Judgment to come, the\\n\\t\\t\\t\\tresponsibility in the moral and spiritual world, for all\\n\\t\\t\\t\\tactions done by men, or (2) Faith, Religion, the\\n\\t\\t\\t\\tprinciples of right and wrong in spiritual matters, which\\n\\t\\t\\t\\toften conflict with selfish desires or predilections. It\\n\\t\\t\\t\\tis men who deny Faith or future responsibility, that\\n\\t\\t\\t\\ttreat the helpless with contempt and lead arrogant\\n\\t\\t\\t\\tselfish lives."
  },
  {
    "SurahNumber": "107",
    "AyahNumber": "3",
    "NoteID": "6282",
    "Body": "The Charity or Love which feeds the indigent at the\\n\\t\\t\\t\\texpense of Self is a noble form of virtue, which is\\n\\t\\t\\t\\tbeyond the reach of men who are so callous as even to\\n\\t\\t\\t\\tdiscourage or forbid or look down upon the virtue of\\n\\t\\t\\t\\tcharity or kindness in others."
  },
  {
    "SurahNumber": "107",
    "AyahNumber": "5",
    "NoteID": "6283",
    "Body": "True worship does not consist in the mere form of prayer,\\n\\t\\t\\t\\twithout the heart and mind being earnestly applied to\\n\\t\\t\\t\\tseek the realisation of the presence of Allah, and to\\n\\t\\t\\t\\tunderstand and do His holy Will."
  },
  {
    "SurahNumber": "107",
    "AyahNumber": "6",
    "NoteID": "6284",
    "Body": "Cf. iv. 142: \"When they stand up to prayer, they stand\\n\\t\\t\\t\\twithout earnestness, to be seen of men, but little do\\n\\t\\t\\t\\tthey hold Allah in remembrance.\""
  },
  {
    "SurahNumber": "107",
    "AyahNumber": "7",
    "NoteID": "6285",
    "Body": "Hypocrites make a great show of hollow acts of goodness,\\n\\t\\t\\t\\tdevotion, and charity. But they fail signally if you test\\n\\t\\t\\t\\tthem by little acts of neighbourly help or charity, the\\n\\t\\t\\t\\tthousand little courtesies and kindnesses of daily life,\\n\\t\\t\\t\\tthe supply of needs which cost little but mean much."
  }
]
