[
  {
    "SurahNumber": "72",
    "AyahNumber": "1",
    "NoteID": "1",
    "Body": "I.e., had heard and accepted it: this being the meaning,\\n\\t\\t\\t\\tin the above context, of the verbal form istama'a. - As\\n\\t\\t\\t\\tregards the various meanings attributable to the plural\\n\\t\\t\\t\\tnoun jinn (rendered by me here as \"unseen beings\"), see\\n\\t\\t\\t\\tAppendix III. As pointed out there, the jinn are referred\\n\\t\\t\\t\\tto in the Qur'an in many connotations. In a few cases -\\n\\t\\t\\t\\te.g., in the present instance and in {46:29-32} - this\\n\\t\\t\\t\\texpression may possibly signify \"hitherto unseen beings\",\\n\\t\\t\\t\\tnamely, strangers who had never before been seen by the\\n\\t\\t\\t\\tpeople among and to whom the Qur'an was then being\\n\\t\\t\\t\\trevealed. From  46:30  (which evidently relates to the\\n\\t\\t\\t\\tsame occurrence as the present one) it transpires that\\n\\t\\t\\t\\tthe jinn in question were followers of the Mosaic faith,\\n\\t\\t\\t\\tinasmuch as they refer to the Qur'an as \"a revelation\\n\\t\\t\\t\\tbestowed from on high after [that of] Moses\", thus\\n\\t\\t\\t\\tpointedly omitting any mention of the intervening\\n\\t\\t\\t\\tprophet, Jesus, and equally pointedly (in verse {3} of\\n\\t\\t\\t\\tthe present surah) stressing their rejection of the\\n\\t\\t\\t\\tChristian concept of the Trinity. All this leads one to\\n\\t\\t\\t\\tthe assumption that they may have been Jews from distant\\n\\t\\t\\t\\tparts of what is now the Arab world, perhaps from Syria\\n\\t\\t\\t\\tor even Mesopotamia. (Tabari mentions in several places\\n\\t\\t\\t\\tthat the jinn referred to in this surah as well as in\\n\\t\\t\\t\\t 46:29  ff. hailed from Nasibin, a town on the upper\\n\\t\\t\\t\\treaches of the Euphrates.) I should, however, like to\\n\\t\\t\\t\\tstress that my explanation of this occurrence is purely\\n\\t\\t\\t\\ttentative."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "4",
    "NoteID": "2",
    "Body": "If we accept the supposition that the beings spoken of\\n\\t\\t\\t\\there were Jewish strangers, the \"outrageous things\"\\n\\t\\t\\t\\t(shatat) which they mention would appear to be an\\n\\t\\t\\t\\tallusion to the deep-set belief of the Jews that they\\n\\t\\t\\t\\twere \"God's chosen people\" - a belief which the Qur'an\\n\\t\\t\\t\\tconsistently rejects, and of which the new converts now\\n\\t\\t\\t\\tdivested themselves."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "5",
    "NoteID": "3",
    "Body": "In this and the next verse, the term jinn (rendered here\\n\\t\\t\\t\\tas \"invisible forces\") apparently refers to what is\\n\\t\\t\\t\\tdescribed as \"occult powers\" or, rather, to a person's\\n\\t\\t\\t\\tpreoccupation with them (see Appendix III). Irrespective\\n\\t\\t\\t\\tof whether these \"forces\" are real or mere products of\\n\\t\\t\\t\\thuman imagination, they \"tell lies about God\" inasmuch as\\n\\t\\t\\t\\tthey induce their devotees to conceive all manner of\\n\\t\\t\\t\\tfantastic, arbitrary notions about the \"nature\" of His\\n\\t\\t\\t\\tBeing and of His alleged relations with the created\\n\\t\\t\\t\\tuniverse: notions exemplified in all mystery-religions,\\n\\t\\t\\t\\tin the various gnostic and theosophical systems, in\\n\\t\\t\\t\\tcabalistic Judaism, and in the many medieval offshoots of\\n\\t\\t\\t\\teach of them."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "6",
    "NoteID": "4",
    "Body": "Lit., \"that men (rijal) from among the humans used to\\n\\t\\t\\t\\t(kana) seek refuge with men from among the jinn\". Since\\n\\t\\t\\t\\tthe reference to \"the humans\" (al-ins) applies to men and\\n\\t\\t\\t\\twomen, the expression rijal is obviously used here - as\\n\\t\\t\\t\\tso often in the Qur'an - in the sense of \"some persons\"\\n\\t\\t\\t\\tor \"certain kinds\" of people. \"Seeking refuge\" is\\n\\t\\t\\t\\tsynonymous with seeking help, protection or the\\n\\t\\t\\t\\tsatisfaction of physical or spiritual needs; in the\\n\\t\\t\\t\\tcontext of the above passage, this is evidently an\\n\\t\\t\\t\\tallusion to the hope of \"certain kinds of humans\" that\\n\\t\\t\\t\\tthe occult powers to which they have turned would\\n\\t\\t\\t\\tsuccessfully guide them through life, and thus make it\\n\\t\\t\\t\\tunnecessary for them to look forward to the coming of a\\n\\t\\t\\t\\tnew prophet."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "7",
    "NoteID": "5",
    "Body": "Thus Tabari (on the authority of Al-Kalbi) and Ibn\\n\\t\\t\\t\\tKathir. The overwhelming majority of the Jews were\\n\\t\\t\\t\\tconvinced that no prophet would be raised after those who\\n\\t\\t\\t\\twere explicitly mentioned in the Old Testament: hence\\n\\t\\t\\t\\ttheir rejection of Jesus and, of course, Muhammad, and\\n\\t\\t\\t\\ttheir \"reaching out towards heaven\" (see next verse) in\\n\\t\\t\\t\\torder to obtain a direct insight into God's plan of\\n\\t\\t\\t\\tcreation."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "8",
    "NoteID": "6",
    "Body": "The above may be understood as alluding not only,\\n\\t\\t\\t\\tmetaphorically, to the arrogant Jewish belief in their\\n\\t\\t\\t\\tbeing \"God's chosen people\", but also, more factually, to\\n\\t\\t\\t\\ttheir old inclination to, and practice of, astrology as a\\n\\t\\t\\t\\tmeans to foretell the future. Apart from this - and in a\\n\\t\\t\\t\\tmore general sense - their \"reaching out towards heaven\"\\n\\t\\t\\t\\tmay be a metaphorical description of a state of mind\\n\\t\\t\\t\\twhich causes man to regard himself as \"self-sufficient\"\\n\\t\\t\\t\\tand to delude himself into thinking that he is bound to\\n\\t\\t\\t\\tachieve mastery over his own fate."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "8",
    "NoteID": "7",
    "Body": "See notes [16] and [17] on {15:17-18}."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "9",
    "NoteID": "8",
    "Body": "I.e., \"we failed notwithstanding our status as\\n\\t\\t\\t\\tdescendants of Abraham, and despite all our ability and\\n\\t\\t\\t\\tlearning\"."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "9",
    "NoteID": "9",
    "Body": "As the sequence shows (and as has been pointed out in\\n\\t\\t\\t\\tnote [17] on  15:18), this relates to all attempts at\\n\\t\\t\\t\\tpredicting the future by means of astrology or esoteric\\n\\t\\t\\t\\tcalculations, or at influencing the course of future\\n\\t\\t\\t\\tevents by means of \"occult sciences\"."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "10",
    "NoteID": "10",
    "Body": "Thus, as in verses {2} and {21} of this surah,\\n\\t\\t\\t\\t\"consciousness of what is right\" (rashad or rushd) is\\n\\t\\t\\t\\tequated with the opposite of evil fortune, i.e., with\\n\\t\\t\\t\\thappiness."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "15",
    "NoteID": "11",
    "Body": "With this assertion ends, according to all classical\\n\\t\\t\\t\\tcommentators, the \"confession of faith\" of the beings\\n\\t\\t\\t\\tdescribed at the beginning of this passage as jinn.\\n\\t\\t\\t\\tWhatever be the real meaning of this term in the present\\n\\t\\t\\t\\tinstance - whether it signifies \"unseen beings\" of a\\n\\t\\t\\t\\tnature unknown to man or, alternatively, a group of\\n\\t\\t\\t\\thumans from distant lands - matters little, for the\\n\\t\\t\\t\\tcontext makes it abundantly clear that the \"speech\" of\\n\\t\\t\\t\\tthose beings is but a parable of the guidance which the\\n\\t\\t\\t\\tQur'an offers to a mind intent on attaining to\\n\\t\\t\\t\\t\"consciousness of what is right\"."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "16",
    "NoteID": "12",
    "Body": "Lit., \"water abundant\": a metaphor of happiness, echoing\\n\\t\\t\\t\\tthe allegorical reference, so frequently occurring in the\\n\\t\\t\\t\\tQur'an, to the \"running waters\" of paradise (Abu Muslim,\\n\\t\\t\\t\\tquoted by Razi)."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "17",
    "NoteID": "13",
    "Body": "I.e., God's bestowal of blessings is not just a \"reward\"\\n\\t\\t\\t\\tof righteousness but, rather, a test of man's remaining\\n\\t\\t\\t\\tconscious of, and therefore grateful to, Him."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "18",
    "NoteID": "14",
    "Body": "Lit., \"the places of worship\" (al-masajid): i.e., worship\\n\\t\\t\\t\\tas such."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "19",
    "NoteID": "15",
    "Body": "Lit., \"would almost be upon him in crowds (libad, sing.\\n\\t\\t\\t\\tlibdah)\" - i.e., with a view to \"extinguishing God's\\n\\t\\t\\t\\t[guiding] light\" (Tabari, evidently alluding to  9:32 ).\\n\\t\\t\\t\\tMost of the commentators assume that the above verse\\n\\t\\t\\t\\trefers to the Prophet Muhammad and the hostility shown to\\n\\t\\t\\t\\thim by his pagan contemporaries. While this may have been\\n\\t\\t\\t\\tso in the first instance, it is obvious that the passage\\n\\t\\t\\t\\thas a general import as well, alluding to the hostility\\n\\t\\t\\t\\tshown by the majority of people, at all times and in all\\n\\t\\t\\t\\tsocieties, to a minority or an individual who stands up\\n\\t\\t\\t\\tfor a self-evident - but unpopular - moral truth. (In\\n\\t\\t\\t\\torder to be understood fully, the above verse should be\\n\\t\\t\\t\\tread in conjunction with {19:73-74} and the corresponding\\n\\t\\t\\t\\tnotes."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "23",
    "NoteID": "16",
    "Body": "Lit., \"except through an announcement\" (illa balaghan). In this instance, however, the particle illa is evidently a contraction of in la (\"if not\"): thus, the above phrase signifies \"if I do not [or \"if should fail to\"] convey...\", etc. (Tabari, Zamakhshari, Razi)."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "23",
    "NoteID": "17",
    "Body": "This obviously relates to \"those who are bent on denying\\n\\t\\t\\t\\tthe truth\" - i.e., consciously - and thus destroy their\\n\\t\\t\\t\\town spiritual identity. The people alluded to in this\\n\\t\\t\\t\\tparticular instance are those who \"would gladly overwhelm\\n\\t\\t\\t\\tGod's servant with their crowds\" (verse {l9})."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "24",
    "NoteID": "18",
    "Body": "I.e., on the Day of Judgment. Cf. the second paragraph of\\n\\t\\t\\t\\t 19:75 , which is similarly phrased."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "24",
    "NoteID": "19",
    "Body": "Lit., \"is weaker as to helpers and less in numbers\" -\\n\\t\\t\\t\\ti.e., less significant despite its greater numbers."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "26",
    "NoteID": "20",
    "Body": "The possessive pronoun \"His\" in the phrase 'ala ghaybihi\\n\\t\\t\\t\\tevidently indicates God's exclusive knowledge of \"that\\n\\t\\t\\t\\twhich is beyond the perception of any created being\"\\n\\t\\t\\t\\t(al-ghayb): hence the above, somewhat free, rendering of\\n\\t\\t\\t\\tthis truly untranslatable phrase."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "27",
    "NoteID": "21",
    "Body": "Cf.  3:179  - \"And it is not God's will to give you\\n\\t\\t\\t\\tinsight into that which is beyond the reach of human\\n\\t\\t\\t\\tperception: but [to that end] God elects whomsoever He\\n\\t\\t\\t\\twills from among His apostles\"."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "27",
    "NoteID": "22",
    "Body": "For an explanation of this rendering of the phrase min\\n\\t\\t\\t\\tbayni yadayhi wa-min khalfihi (lit., \"from between his\\n\\t\\t\\t\\thands and from behind him\"), see note [247] on  2:255 .\\n\\t\\t\\t\\tIn the present context the phrase implies that the very\\n\\t\\t\\t\\tfact of his being graced by divine revelation protects\\n\\t\\t\\t\\tevery apostle, spiritually, in all concerns of his life,\\n\\t\\t\\t\\tirrespective of whether these concerns are obvious to him\\n\\t\\t\\t\\tor are beyond his ken."
  },
  {
    "SurahNumber": "72",
    "AyahNumber": "28",
    "NoteID": "23",
    "Body": "Lit., \"all that is with them\", i.e., of knowledge and\\n\\t\\t\\t\\twisdom."
  }
]
