[
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "1",
    "sectionHeading": "Mention of Blood-Money",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Muhammad ibn Amr ibn Hazm from his father that in a\\n\\t\\t\\t\\tletter which the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, sent to Amr ibn Hazm about\\n\\t\\t\\t\\tblood-money he wrote that it was one hundred camels for a\\n\\t\\t\\t\\tlife, one hundred camels for a nose if completely\\n\\t\\t\\t\\tremoved, a third of the blood-money for a wound in the\\n\\t\\t\\t\\tbrain, the same as that for a belly wound, fifty for an\\n\\t\\t\\t\\teye, fifty for a hand, fifty for a foot, ten camels for\\n\\t\\t\\t\\teach finger, and five for teeth, and five for a head\\n\\t\\t\\t\\twound which laid bare the bone.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "2",
    "sectionHeading": "Procedure in Blood-Money",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Umar ibn\\n\\t\\t\\t\\tal-Khattab estimated the full blood-money for the people\\n\\t\\t\\t\\tof urban areas. For those who had gold, he made it one\\n\\t\\t\\t\\tthousand dinars. and for those who had silver he made it\\n\\t\\t\\t\\tten thousand dirhams.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The people of gold are the people of\\n\\t\\t\\t\\tash-Sham and the people of Egypt. The people of silver\\n\\t\\t\\t\\tare the people of Iraq \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that the\\n\\t\\t\\t\\tblood-money was divided into instalments over three or\\n\\t\\t\\t\\tfour years.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Three is the most preferable to me of what I\\n\\t\\t\\t\\thave heard on that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tin our community is that camels are not accepted from the\\n\\t\\t\\t\\tpeople of cities for blood-money nor is gold or silver\\n\\t\\t\\t\\taccepted from the desert people. Silver is not accepted\\n\\t\\t\\t\\tfrom the people of gold and gold is not accepted from the\\n\\t\\t\\t\\tpeople of silver.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "2",
    "sectionHeading": "The Blood-Money for Murder, When Accepted and the Criminal Act of the Insane",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said, \"The\\n\\t\\t\\t\\tfull blood-money for murder when it is accepted is\\n\\t\\t\\t\\ttwenty-five yearlings, twenty-five two-year-olds,\\n\\t\\t\\t\\ttwenty-five four-year-olds, and twenty-five\\n\\t\\t\\t\\tfive-year-olds.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "3",
    "sectionHeading": "The Blood-Money for Murder, When Accepted and the Criminal Act of the Insane",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tMarwan ibn al-Hakam wrote to Muawiya ibn Abi Sufyan that\\n\\t\\t\\t\\ta madman was brought to him who had killed a man. Muawiya\\n\\t\\t\\t\\twrote to him, \"Tie him up and do not inflict any\\n\\t\\t\\t\\tretaliation on him. There is no retaliation against a\\n\\t\\t\\t\\tmadman.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about an adult and a child when they murder a\\n\\t\\t\\t\\tman together, \"The adult is killed and the child pays\\n\\t\\t\\t\\thalf the full blood-money.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is like that with a freeman and a slave\\n\\t\\t\\t\\twhen they murder a slave. The slave is killed and the\\n\\t\\t\\t\\tfreeman pays half of his value.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "4",
    "sectionHeading": "The Blood-Money for Manslaughter",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Irak\\n\\t\\t\\t\\tibn Malik and Sulayman ibn Yasar that a man of the Banu\\n\\t\\t\\t\\tSad ibn Layth was running a horse and it trod on the\\n\\t\\t\\t\\tfinger of a man from the Juhayna tribe. It bled\\n\\t\\t\\t\\tprofusely, and he died. Umar ibn al-Khattab said to those\\n\\t\\t\\t\\tagainst whom the claim was made. \"Do you swear by Allah\\n\\t\\t\\t\\twith fifty oaths that he did not die of it?\" They refused\\n\\t\\t\\t\\tand stopped themselves from doing it. He said to the\\n\\t\\t\\t\\tothers, \"Will you take an oath?\" They refused, so Umar\\n\\t\\t\\t\\tibn al-Khattab gave a judgement that the Banu Sad had to\\n\\t\\t\\t\\tpay half the full blood-money.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"One does not act on this.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab, Sulayman\\n\\t\\t\\t\\tibn Yasar, and Rabia ibn Abi Abd ar-Rahman said, \"The\\n\\t\\t\\t\\tblood-money of manslaughter is twenty yearlings, twenty\\n\\t\\t\\t\\ttwo-year-olds, twenty male two-year-olds, twenty\\n\\t\\t\\t\\tfour-year-olds, and twenty five-year-olds.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way with us is that\\n\\t\\t\\t\\tthere is no retaliation against children. Their intention\\n\\t\\t\\t\\tis accidental. The hudud are not obliged for them if they\\n\\t\\t\\t\\thave not yet reached puberty. If a child kills someone it\\n\\t\\t\\t\\tis only accidentally. Had a child and an adult killed a\\n\\t\\t\\t\\tfree man accidentally, each of them pays half the full\\n\\t\\t\\t\\tblood-money.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A person who kills someone accidentally pays\\n\\t\\t\\t\\tblood-money with his property and there is no retaliation\\n\\t\\t\\t\\tagainst him. That money is like anything else from the\\n\\t\\t\\t\\tdead man's property and his debt is paid with it and he\\n\\t\\t\\t\\tis allowed to make a bequest from it. If he has a total\\n\\t\\t\\t\\tproperty of which the blood-money is a third and then the\\n\\t\\t\\t\\tblood-money is relinquished, that is permitted to him. If\\n\\t\\t\\t\\tall the property he has is his blood-money, he is\\n\\t\\t\\t\\tpermitted to relinquish a third of it and to make that a\\n\\t\\t\\t\\tbequest.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "4",
    "sectionHeading": "The Blood-Money for Accidental Injury",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that the generally agreed on way of\\n\\t\\t\\t\\tdoing things amongst the community about an accident is\\n\\t\\t\\t\\tthat there is no blood-money until the victim is better.\\n\\t\\t\\t\\tIf a man's bone, either a hand, or a foot, or another\\n\\t\\t\\t\\tpart of his body, is broken accidentally and it heals and\\n\\t\\t\\t\\tbecomes sound and returns to its form, there is no\\n\\t\\t\\t\\tblood-money for it. If the limb is impaired or there is a\\n\\t\\t\\t\\tscar on it, there is blood-money for it according to the\\n\\t\\t\\t\\textent that it is impaired.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If that part of the body has a specific\\n\\t\\t\\t\\tblood-money mentioned by the Prophet, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, it is according to what the Prophet,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, specified. If it\\n\\t\\t\\t\\tis part of what does not have a specific blood-money for\\n\\t\\t\\t\\tit mentioned by the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, and if there is no previous sunna about\\n\\t\\t\\t\\tit or specific blood-money, one uses ijtihad about it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no blood-money for an accidental\\n\\t\\t\\t\\tbodily injury when the wound heals and returns to its\\n\\t\\t\\t\\tform. If there is any scar or mark in that, ijtihad is\\n\\t\\t\\t\\tused about it except for the belly-wound. There is a\\n\\t\\t\\t\\tthird of the blood-money of a life for it. \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no blood-money for the wound which\\n\\t\\t\\t\\tsplinters a bone in the body, and it is like the wound to\\n\\t\\t\\t\\tthe body which lays bare the bone.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tin our community is that when the doctor performs a\\n\\t\\t\\t\\tcircumcision and cuts off the glans, he must pay the full\\n\\t\\t\\t\\tblood-money. That is because it is an accident which the\\n\\t\\t\\t\\ttribe is responsible for, and the full blood money is\\n\\t\\t\\t\\tpayable for all that in which a doctor errs or exceeds,\\n\\t\\t\\t\\twhen it is not intentional.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "4",
    "sectionHeading": "The Blood-Money of Women",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"The blood-money for a woman\\n\\t\\t\\t\\tis the same as for a man up to one third of the\\n\\t\\t\\t\\tblood-money. Her finger is like his finger, her tooth is\\n\\t\\t\\t\\tlike his tooth, her injury which lays bare the bone is\\n\\t\\t\\t\\tlike his, and her head wound which splinters the bone is\\n\\t\\t\\t\\tlike his.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab and also\\n\\t\\t\\t\\tUrwa ibn az-Zubayr said the same as Said ibn al-Musayyab\\n\\t\\t\\t\\tsaid about a woman. Her blood-money from a man is the\\n\\t\\t\\t\\tsame up to a third of the blood-money of a man. If what\\n\\t\\t\\t\\tshe is owed exceeds a third of the blood-money of the\\n\\t\\t\\t\\tman, she is given up to half of the blood-money of a man.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of that is that she has\\n\\t\\t\\t\\tblood-money for a head wound that lays bare the bone and\\n\\t\\t\\t\\tone that splinters the bone and for what is less than the\\n\\t\\t\\t\\tbrain wound and the belly wound and the like of that of\\n\\t\\t\\t\\tthose which obliges a third of the blood-money or more.\\n\\t\\t\\t\\tIf the amount owed her exceeds that, her blood-money in\\n\\t\\t\\t\\tthat is half of the blood-money of a man.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard Ibn Shihab\\n\\t\\t\\t\\tsay, \"The precedent of the sunna when a man injures a\\n\\t\\t\\t\\twoman is that he must pay the blood-money for that injury\\n\\t\\t\\t\\tand there is no retaliation against him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is an accidental injury, when a man\\n\\t\\t\\t\\tstrikes a woman and hits with a blow what he did not\\n\\t\\t\\t\\tintend, for instance, if he struck her with a whip and\\n\\t\\t\\t\\tcut her eye open and the like of that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a woman who has a husband and children\\n\\t\\t\\t\\twho are not from her paternal relatives or her people,\\n\\t\\t\\t\\tthat since he is from another tribe, there is no\\n\\t\\t\\t\\tblood-money against her husband for her criminal action,\\n\\t\\t\\t\\tnor any against her children if they are not from her\\n\\t\\t\\t\\tpeople, nor any against her maternal brothers when they\\n\\t\\t\\t\\tare not from her paternal relations or her people. These\\n\\t\\t\\t\\tare entitled to her inheritance but only the paternal\\n\\t\\t\\t\\trelations have paid blood-money from since the time of\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace. Until today it is like that with the mawla of a\\n\\t\\t\\t\\twoman. The inheritance they leave goes to the children of\\n\\t\\t\\t\\tthe woman even if they are not from her tribe, but the\\n\\t\\t\\t\\tblood-money of the criminal act of the mawla is only\\n\\t\\t\\t\\tagainst her tribe.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "5",
    "sectionHeading": "The Blood-Money for the Foetus",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tSalama ibn Abd ar-Rahman ibn Awf from Abu Hurayra that a\\n\\t\\t\\t\\twoman from the Hudhayl tribe threw a stone at a woman\\n\\t\\t\\t\\tfrom the same tribe, and she had a miscarriage. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, gave a judgement that a slave or slave-girl of\\n\\t\\t\\t\\tfair complexion and excellence should be given to her.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "6",
    "sectionHeading": "The Blood-Money for the Foetus",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, gave a judgement that the\\n\\t\\t\\t\\tcompensation for a foetus killed in its mother's womb was\\n\\t\\t\\t\\ta slave or slave-girl of fair complexion and excellence.\\n\\t\\t\\t\\tThe one against whom the judgement was given said, \"Why\\n\\t\\t\\t\\tshould I pay damages for that which did not drink or eat\\n\\t\\t\\t\\tor speak or make any cry. The like of that is nothing.\"\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"This is only one of the brothers of the\\n\\t\\t\\t\\tdiviners.\" He disapproved of the rhyming speech of the\\n\\t\\t\\t\\tman's declaration.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman said, \"The slave of fair complexion and\\n\\t\\t\\t\\texcellence is estimated at fifty dinars or six hundred\\n\\t\\t\\t\\tdirhams. The blood-money of a free muslim woman is five\\n\\t\\t\\t\\thundred dinars or six thousand dirhams.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The blood-money of the foetus of a free\\n\\t\\t\\t\\twoman is a tenth of her blood-money. The tenth is fifty\\n\\t\\t\\t\\tdinars or six hundred dirhams.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have not heard anyone dispute that there\\n\\t\\t\\t\\tis no slave in compensation for the foetus until it\\n\\t\\t\\t\\tleaves its mother's womb and falls still-born from her\\n\\t\\t\\t\\twomb . \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I heard that if the foetus comes out of its\\n\\t\\t\\t\\tmother's womb alive and then dies, the full blood-money\\n\\t\\t\\t\\tis due for it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The foetus is not alive unless it cries at\\n\\t\\t\\t\\tbirth. If it comes out of its mother's womb and cries out\\n\\t\\t\\t\\tand then dies, the complete blood-money is due for it. We\\n\\t\\t\\t\\tthink that the slave-girl's foetus has a tenth of the\\n\\t\\t\\t\\tprice of the slave-girl.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a woman murders a man or woman, and the\\n\\t\\t\\t\\tmurderess is pregnant, retaliation is not taken against\\n\\t\\t\\t\\ther until she has given birth. If a woman who is pregnant\\n\\t\\t\\t\\tis killed intentionally or unintentionally, the one who\\n\\t\\t\\t\\tkilled her is not obliged to pay anything for her foetus.\\n\\t\\t\\t\\tIf she is murdered, then the one who killed her is killed\\n\\t\\t\\t\\tand there is no blood-money for her foetus. If she is\\n\\t\\t\\t\\tkilled accidentally, the tribe obliged to pay on behalf\\n\\t\\t\\t\\tof her killer pays her blood-money, and there is no\\n\\t\\t\\t\\tblood-money for the foetus.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me, \"Malik was asked about the foetus of\\n\\t\\t\\t\\tthe christian or jewish woman which was aborted. He said,\\n\\t\\t\\t\\t'I think that there is a tenth of the blood-money of the\\n\\t\\t\\t\\tmother for it.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "6",
    "sectionHeading": "Injuries For Which There is Full Blood-Money",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tibn al-Musayyab used to say, \"The full blood-money is\\n\\t\\t\\t\\tpayable for cutting off both lips, but when the lower one\\n\\t\\t\\t\\tonly is cut off, two-thirds of the blood-money is due for\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he asked Ibn Shihab\\n\\t\\t\\t\\tabout the one-eyed man who gouged out the eye of a\\n\\t\\t\\t\\thealthy person. Ibn Shihab said, \"If the healthy person\\n\\t\\t\\t\\twants to take retaliation from him, he can have his\\n\\t\\t\\t\\tretaliation. If he prefers, he has blood-money of one\\n\\t\\t\\t\\tthousand dinars, twelve thousand dirhams.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that full\\n\\t\\t\\t\\tblood-money was payable for both of a pair of anything in\\n\\t\\t\\t\\ta man that occurred in pairs, and the tongue had full\\n\\t\\t\\t\\tblood-money. The ears, when their hearing departed, had\\n\\t\\t\\t\\tfull blood-money, whether or not they were cut off, and a\\n\\t\\t\\t\\tman's penis had full blood-money and the testicles had\\n\\t\\t\\t\\tfull blood-money.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that the\\n\\t\\t\\t\\tbreasts of a woman had full blood-money.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The least of that are the eyebrows and a\\n\\t\\t\\t\\tman's breasts.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community when a man is\\n\\t\\t\\t\\tinjured in his extremities to an extent that obliges\\n\\t\\t\\t\\tpayment of more than the amount of his full blood-money,\\n\\t\\t\\t\\tis that it is his right. If his hands, feet, and eyes are\\n\\t\\t\\t\\tall injured, he has three full blood-moneys.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about the sound eye of a one-eyed man when it\\n\\t\\t\\t\\tis accidentally gouged out, \"The full blood-money is\\n\\t\\t\\t\\tpayable for it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "6",
    "sectionHeading": "The Blood-Money for an Eye whose Sight is Lost",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSulayman ibn Yasar that Zayd ibn Thabit used to say,\\n\\t\\t\\t\\t\"When the eye remains but the sight is lost, one hundred\\n\\t\\t\\t\\tdinars are payable for it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"Malik was asked about cutting off the lower\\n\\t\\t\\t\\tlid of the eye and the bone around the eye. He said,\\n\\t\\t\\t\\t'There is only ijtihad in that unless the vision of the\\n\\t\\t\\t\\teye is impaired. He is entitled to an amount that is\\n\\t\\t\\t\\tcompatible to the extent the vision of the eye has been\\n\\t\\t\\t\\timpaired.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"What is done in our\\n\\t\\t\\t\\tcommunity about removing the bad eye of a one-eyed man\\n\\t\\t\\t\\twhen it has already been blinded and still remains there\\n\\t\\t\\t\\tin its place and the paralyzed hand when it is cut off,\\n\\t\\t\\t\\tis that there is only ijtihad in that, and there is no\\n\\t\\t\\t\\tprescribed blood-money.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "6",
    "sectionHeading": "The Blood-Money for Head Wounds",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said heard\\n\\t\\t\\t\\tSulayman ibn Yasar mention that a face wound in which the\\n\\t\\t\\t\\tbone was bared was like a head wound in which the bone\\n\\t\\t\\t\\twas bared, unless the face was scarred by the wound. Then\\n\\t\\t\\t\\tthe blood-money is increased by one half of the\\n\\t\\t\\t\\tblood-money of the head wound in which the skin was bared\\n\\t\\t\\t\\tso that seventy five dinars are payable for it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community is that the\\n\\t\\t\\t\\thead wound with splinters has fifteen camels.\" He\\n\\t\\t\\t\\texplained, \"The head wound with splinters is that from\\n\\t\\t\\t\\twhich pieces of bone fly off and which does not reach the\\n\\t\\t\\t\\tbrain. It can be in the head or the face.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tin our community, is that there is no retaliation for a\\n\\t\\t\\t\\twound to the brain or a belly wound, and Ibn Shihab has\\n\\t\\t\\t\\tsaid, 'There is no retaliation for a wound to the brain.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik explained, \"The wound to the brain is what pierces\\n\\t\\t\\t\\tthe bones to the brain. This type of wound only occurs in\\n\\t\\t\\t\\tthe head. It is that which reaches the brain when the\\n\\t\\t\\t\\tbones are pierced.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community is that there\\n\\t\\t\\t\\tis no blood-money paid on any head wound less than one\\n\\t\\t\\t\\twhich lays bare the skull. Blood-money is payable only\\n\\t\\t\\t\\tfor the head wound that bares the bone and what is worse\\n\\t\\t\\t\\tthan that. That is because the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, stopped at the head\\n\\t\\t\\t\\twound which bared the bone in his letter to Amr ibn Hazm.\\n\\t\\t\\t\\tHe made it five camels. The imams, past and present, have\\n\\t\\t\\t\\tnot made any blood-money payable for injuries less than\\n\\t\\t\\t\\tthe head wound which bares the bone.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said, that\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"For every piercing wound in\\n\\t\\t\\t\\tany of the organs or limbs of the body, one third of the\\n\\t\\t\\t\\tblood-money of that limb is payable.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik related to me, \"Ibn Shihab did not think and nor do\\n\\t\\t\\t\\tI, that there is a generally agreed on way of doing\\n\\t\\t\\t\\tthings regarding a piercing wound in any of the organs or\\n\\t\\t\\t\\tlimbs of the body, but I think that there is ijtihad in\\n\\t\\t\\t\\tthe case. The imam uses ijtihad in it, and there is no\\n\\t\\t\\t\\tgenerally agreed on way of doing things in our community\\n\\t\\t\\t\\tabout it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community about the\\n\\t\\t\\t\\twound to the brain and the wound which splinters the\\n\\t\\t\\t\\tbone, and the wound that bares the bone is that they\\n\\t\\t\\t\\tapply only to the head and face. Whatever of that occurs\\n\\t\\t\\t\\tin the body only has ijtihad in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not think the lower jaw and the nose\\n\\t\\t\\t\\tare part of the head in their injury because they are\\n\\t\\t\\t\\tseparate bones, and except for them the head is one\\n\\t\\t\\t\\tbone.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman that Abdullah ibn az-Zubayr allowed retaliation\\n\\t\\t\\t\\tfor a head wound which splintered the bone.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "6",
    "sectionHeading": "The Blood-Money for Fingers",
    "text": "<p>\\n\\t\\t\\t\\tibn Abi Abd ar-Rahman said, \"I asked Said ibn al\\n\\t\\t\\t\\tMusayyab, 'How much for the finger of a woman?' He said,\\n\\t\\t\\t\\t'Ten camels' I said, 'How much for two fingers?' He said,\\n\\t\\t\\t\\t'Twenty camels.' I said, 'How much for three?' He said,\\n\\t\\t\\t\\t'Thirty camels.' I said, 'How much for four?' He said,\\n\\t\\t\\t\\t'Twenty camels.' I said, 'When her wound is greater and\\n\\t\\t\\t\\ther affliction stronger, is her blood-money then less?'\\n\\t\\t\\t\\tHe said, 'Are you an Iraqi?' I said, 'Rather, I am a\\n\\t\\t\\t\\tscholar who seeks to verify things, or an ignorant man\\n\\t\\t\\t\\twho seeks to learn.' Said said, 'It is the sunna, my\\n\\t\\t\\t\\tnephew.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community about all the\\n\\t\\t\\t\\tfingers of the hand being cut off is that its blood-money\\n\\t\\t\\t\\tis complete. That is because when five fingers are cut,\\n\\t\\t\\t\\ttheir blood-money is the blood-money of the hand: fifty\\n\\t\\t\\t\\tcamels. Each finger has ten camels.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The reckoning of the fingers is thirty-three\\n\\t\\t\\t\\tdinars for each fingertip, and that is three and a third\\n\\t\\t\\t\\tshares of camels.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "7",
    "sectionHeading": "General Section on the Blood-Money for Teeth",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tMuslim ibn Jundub from Aslam, the mawla of Umar ibn\\n\\t\\t\\t\\tal-Khattab that Umar ibn al-Khattab decided on a camel\\n\\t\\t\\t\\tfor a molar, a camel for a collar-bone, and a camel for a\\n\\t\\t\\t\\trib.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said heard\\n\\t\\t\\t\\tSaid ibn al-Musayyab say, ''Umar ibn al-Khattab decided\\n\\t\\t\\t\\ton a camel for each molar, and Muawiya ibn Abi Sufyan\\n\\t\\t\\t\\tdecided on five camels for each molar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tSaid ibn al-Musayyab said, \"The blood-money is less in\\n\\t\\t\\t\\tthe judgement of Umar ibn al-Khattab and more in the\\n\\t\\t\\t\\tjudgement of Muawiya. Had it been me, I would have made\\n\\t\\t\\t\\tit two camels for each molar. That is the fair\\n\\t\\t\\t\\tblood-money, and every one who strives with ijtihad is\\n\\t\\t\\t\\trewarded.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSaid ibn al-Musayyab used to say,' 'When a tooth is\\n\\t\\t\\t\\tstruck and becomes black, there is complete blood-money\\n\\t\\t\\t\\tfor it. If it falls out after it becomes black, there is\\n\\t\\t\\t\\talso the complete blood-money for it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "8",
    "sectionHeading": "Procedure in the Blood-Money for Teeth",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Da'ud ibn al-Husayn\\n\\t\\t\\t\\tthat Abu Ghatafan ibn Tarif al-Murri informed him that\\n\\t\\t\\t\\tMarwan ibn al-Hakam sent him to Abdullah ibn Abbas to ask\\n\\t\\t\\t\\thim what there was for the molar. Abdullah ibn Abbas\\n\\t\\t\\t\\tsaid, \"There are five camels for it.\" He said, \"Marwan\\n\\t\\t\\t\\tsent me back again to Abdullah ibn Abbas.'' He said, \"Do\\n\\t\\t\\t\\tyou make front teeth like molars?\" Abdullah ibn Abbas\\n\\t\\t\\t\\tsaid, \"It is enough that you take the fingers as the\\n\\t\\t\\t\\texample for that, their blood-moneys being all the same.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father made all the teeth the same in the blood-money\\n\\t\\t\\t\\tand did not prefer any kind over others.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community is that the\\n\\t\\t\\t\\tfront teeth, molars, and eye-teeth have the same\\n\\t\\t\\t\\tblood-money. That is because the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, 'The tooth has\\n\\t\\t\\t\\tfive camels.' The molar is one of the teeth and he did\\n\\t\\t\\t\\tnot prefer any kind over the others.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "8",
    "sectionHeading": "The Blood-Money for Injuries to Slaves",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab and Sulayman ibn Yasar said, \"The\\n\\t\\t\\t\\thead wound of the slave in which the bone is bared is a\\n\\t\\t\\t\\ttwentieth of his price.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Marwan ibn\\n\\t\\t\\t\\tal-Hakam gave a decision about a slave who was injured\\n\\t\\t\\t\\tthat the person who injured him had to pay what he had\\n\\t\\t\\t\\tdiminished of the value of the slave.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community is that for\\n\\t\\t\\t\\tthe head wound of a slave that bares the bone, there is a\\n\\t\\t\\t\\ttwentieth of his price. The head wound which splinters\\n\\t\\t\\t\\tthe bone is three twentieths of his price. Both the wound\\n\\t\\t\\t\\tto the brain and the belly wound are a third of his\\n\\t\\t\\t\\tprice. Besides these four, any other types of injury that\\n\\t\\t\\t\\tdecrease the price of the slave are considered after the\\n\\t\\t\\t\\tslave is better and well, and one sees what the value of\\n\\t\\t\\t\\tthe slave is after his injury and what his value whole\\n\\t\\t\\t\\twas before he had the injury. Then the one who injured\\n\\t\\t\\t\\thim pays the difference between the two values.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "8",
    "sectionHeading": "The Blood-Money of the People of Protection (Dhimma)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he heard that Umar\\n\\t\\t\\t\\tibn Abd al-Aziz gave a decision that when a jew or\\n\\t\\t\\t\\tchristian was killed, his blood-money was half the\\n\\t\\t\\t\\tblood-money of a free muslim.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community, is that a\\n\\t\\t\\t\\tmuslim is not killed for a kafir unless the muslim kills\\n\\t\\t\\t\\thim by deceit. Then he is killed for it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSulayman ibn Yasar said, \"The blood-money of a magian is\\n\\t\\t\\t\\teight hundred dirhams.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is what is done in our community.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The blood-monies of the jew, christian, and\\n\\t\\t\\t\\tmagian in their injuries, is according to the injury of\\n\\t\\t\\t\\tthe muslims in their blood-moneys. The head wound is a\\n\\t\\t\\t\\ttwentieth of his full blood-money. The wound that opens\\n\\t\\t\\t\\tthe head is a third of his blood-money. The belly-wound\\n\\t\\t\\t\\tis a third of his blood-money. All their injuries are\\n\\t\\t\\t\\taccording to this calculation.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "8",
    "sectionHeading": "Blood-Money that has to be Paid as an Individual",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa that\\n\\t\\t\\t\\this father said, \"The tribe is not obliged to pay\\n\\t\\t\\t\\tblood-money for intentional murder. They pay blood-money\\n\\t\\t\\t\\tfor accidental killing.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ibn Shihab said, \"The\\n\\t\\t\\t\\tprecedent of the sunna is that the tribe are not liable\\n\\t\\t\\t\\tfor any blood-money of an intentional killing unless they\\n\\t\\t\\t\\twish that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said the\\n\\t\\t\\t\\tsame as that.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that Ibn Shihab said, \"The precedent of the\\n\\t\\t\\t\\tsunna in the intentional murder is that when the\\n\\t\\t\\t\\trelatives of the murdered person relinquish retaliation,\\n\\t\\t\\t\\tthe blood-money is owed by the murderer from his own\\n\\t\\t\\t\\tproperty unless the tribe helps him with it willingly.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community is that the\\n\\t\\t\\t\\tblood-money is not obliged against the tribe until it has\\n\\t\\t\\t\\treached a third of the full amount and upwards. Whatever\\n\\t\\t\\t\\treaches a third is against the tribe, and whatever is\\n\\t\\t\\t\\tbelow a third, is against the property of the one who did\\n\\t\\t\\t\\tthe injury.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things about which there is\\n\\t\\t\\t\\tno dispute among us, in the case of someone who has the\\n\\t\\t\\t\\tblood-money accepted from him in intentional murder or in\\n\\t\\t\\t\\tany injury in which there is retaliation, is that that\\n\\t\\t\\t\\tblood-money is not due from the tribe unless they wish\\n\\t\\t\\t\\tit. The blood-money for that is from the property of the\\n\\t\\t\\t\\tmurderer or the injurer if he has property. If he does\\n\\t\\t\\t\\tnot have any property, it is a debt against him, and none\\n\\t\\t\\t\\tof it is owed by the tribe unless they wish.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The tribe does not pay blood-money to anyone\\n\\t\\t\\t\\twho injures himself, intentionally or accidentally. This\\n\\t\\t\\t\\tis the opinion of the people of fiqh in our community. I\\n\\t\\t\\t\\thave not heard that anyone has made the tribe liable for\\n\\t\\t\\t\\tany blood-money incurred by intentional acts. Part of\\n\\t\\t\\t\\twhat is well-known of that is that Allah, the Blessed,\\n\\t\\t\\t\\tand the Exalted, said in His Book, 'Whoever has something\\n\\t\\t\\t\\tpardoned him by his brother, should follow it with what\\n\\t\\t\\t\\tis accepted and pay it with good will' (Sura 2 ayat 178)\\n\\t\\t\\t\\tThe commentary on that - in our view - and Allah knows\\n\\t\\t\\t\\tbest, is that whoever gives his brother something of the\\n\\t\\t\\t\\tblood-money, should follow it with what is accepted and\\n\\t\\t\\t\\tpay him with good will.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a child who had no property and a woman\\n\\t\\t\\t\\twho had no property. He said, \"When one of them causes an\\n\\t\\t\\t\\tinjury below a third of the blood-money, it is taken on\\n\\t\\t\\t\\tbehalf of the child and woman from their personal\\n\\t\\t\\t\\tproperty, if they have property from which it may be\\n\\t\\t\\t\\ttaken. If not, the injury which each of them has caused\\n\\t\\t\\t\\tis a debt against them. The tribe does not have to pay\\n\\t\\t\\t\\tany of it and the father of a child is not liable for the\\n\\t\\t\\t\\tblood-money of an injury caused by the child and he is\\n\\t\\t\\t\\tnot responsible for it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things in our community\\n\\t\\t\\t\\tabout which there is no dispute, is that when a slave is\\n\\t\\t\\t\\tkilled, the value for him is that of the day on which he\\n\\t\\t\\t\\twas killed. The tribe of the murderer is not liable for\\n\\t\\t\\t\\tany of the value of the slave, great or small. That is\\n\\t\\t\\t\\tthe responsibility of the one who struck him from his own\\n\\t\\t\\t\\tpersonal property as far as it covers. If the value of\\n\\t\\t\\t\\tthe slave is the blood-money or more, that is against him\\n\\t\\t\\t\\tin his property. That is because the slave is a certain\\n\\t\\t\\t\\ttype of goods.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "9",
    "sectionHeading": "Inheritance of Blood-Money and Dealing Harshly in Taking It",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Umar\\n\\t\\t\\t\\tibn al-Khattab demanded of the people at Mina, \"If anyone\\n\\t\\t\\t\\thas knowledge of blood-money, let him inform me.\"\\n\\t\\t\\t\\tAd-Dahhak ibn Sufyan al-Kilabi stood up and said, \"The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, wrote to me that the wife of Ashyam ad-Dibabi\\n\\t\\t\\t\\tinherited from the blood-money of her husband.\" Umar ibn\\n\\t\\t\\t\\tal-Khattab said to him, \"Go into the tent until I come to\\n\\t\\t\\t\\tyou.\" When Umar ibn al-Khattab came in, ad-Dahhak told\\n\\t\\t\\t\\thim about it and Umar ibn al-Khattab gave a decision\\n\\t\\t\\t\\tbased on that.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Shihab said, \"The killing of Ashyam was accidental.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "10",
    "sectionHeading": "Inheritance of Blood-Money and Dealing Harshly in Taking It",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said from Amr ibn\\n\\t\\t\\t\\tShuayb that a man of the Banu Mudlij called Qatada threw\\n\\t\\t\\t\\ta sword at his son and it struck his thigh. The wound\\n\\t\\t\\t\\tbled profusely and he died. Suraqa ibn Jusham came to\\n\\t\\t\\t\\tUmar ibn al-Khattab and mentioned that to him Umar said\\n\\t\\t\\t\\tto him, \"At the watering place of Qudayd count one\\n\\t\\t\\t\\thundred and twenty camels and wait until I come to you.\"\\n\\t\\t\\t\\tWhen Umar ibn al-Khattab came to him, he took thirty\\n\\t\\t\\t\\tfour-year-old camels, thirty five-year-old camels, and\\n\\t\\t\\t\\tforty pregnant camels from them. Then he said, \"Where is\\n\\t\\t\\t\\tthe brother of the slain man?\" He said, \"Here.\" He said,\\n\\t\\t\\t\\t\"Take them. The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, 'The killer gets nothing.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that he had heard that Said ibn al-Musayyab\\n\\t\\t\\t\\tand Sulayman ibn Yasar were asked, \"Does one deal more\\n\\t\\t\\t\\tharshly in taking the blood-money in the sacred month?\"\\n\\t\\t\\t\\tThey said, \"No. But it is increased in it because of\\n\\t\\t\\t\\tviolating the month.\" It was said to Said, \"Does one\\n\\t\\t\\t\\tincrease for the wound as one increases for the life?\" He\\n\\t\\t\\t\\tsaid, \"Yes.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"I think that they meant the same as what\\n\\t\\t\\t\\tUmar ibn al-Khattab did with respect to the blood-money\\n\\t\\t\\t\\tof the Mudliji when he struck his son.\" (i.e. giving 120\\n\\t\\t\\t\\tcamels instead of 100).\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "11",
    "sectionHeading": "Inheritance of Blood-Money and Dealing Harshly in Taking It",
    "text": "<p>\\n\\t\\t\\t\\t11 Malik related to me from Yahya ibn Said from Urwa ibn\\n\\t\\t\\t\\taz-Zubayr that a man of the Ansar called Uhayha ibn\\n\\t\\t\\t\\tal-Julah had a young paternal uncle who was younger than\\n\\t\\t\\t\\thim and who was living with his maternal uncles. Uhayha\\n\\t\\t\\t\\ttook him and killed him. His maternal uncles said, \"We\\n\\t\\t\\t\\tbrought him up from a baby to a youth till he stood firm\\n\\t\\t\\t\\ton his feet, and we have had the right of a man taken\\n\\t\\t\\t\\tfrom us by his paternal uncle.\" Urwa said, \"For that\\n\\t\\t\\t\\treason a killer does not inherit from the one he killed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things about which there is\\n\\t\\t\\t\\tno dispute is that the intentional murderer does not\\n\\t\\t\\t\\tinherit anything of the blood-money of the person he has\\n\\t\\t\\t\\tmurdered or any of his property. He does not stop anyone\\n\\t\\t\\t\\twho has a share of inheritance from inheriting. The one\\n\\t\\t\\t\\twho kills accidentally does not inherit anything of the\\n\\t\\t\\t\\tblood-money and there is dispute as to whether or not he\\n\\t\\t\\t\\tinherits from the dead person's property because there is\\n\\t\\t\\t\\tno suspicion that he killed him for his inheritance and\\n\\t\\t\\t\\tin order to take his property. I prefer that he inherit\\n\\t\\t\\t\\tfrom the dead person's property and not inherit from the\\n\\t\\t\\t\\tblood-money.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "12",
    "sectionHeading": "General Section on Blood-Money",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab and Abu Salama ibn Abd ar-Rahman from Abu\\n\\t\\t\\t\\tHurayra that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"The wound of an animal is of\\n\\t\\t\\t\\tno account and no compensation is due for it. The well is\\n\\t\\t\\t\\tof no account and no compensation is due for it. The mine\\n\\t\\t\\t\\tis of no account and no compensation is due for it and a\\n\\t\\t\\t\\tfifth is due for buried treasures.\" (Al-kanz: see Book\\n\\t\\t\\t\\t17).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Everyone leading an animal by the halter,\\n\\t\\t\\t\\tdriving it, and riding it is responsible for what the\\n\\t\\t\\t\\tanimal strikes unless the animal kicks out without\\n\\t\\t\\t\\tanything being done to it to make it kick out. Umar ibn\\n\\t\\t\\t\\tal-Khattab imposed the blood-money on a person who was\\n\\t\\t\\t\\texercising his horse.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is more fitting that a person leading an\\n\\t\\t\\t\\tanimal by the halter, driving it, or riding it incur a\\n\\t\\t\\t\\tloss than a person who is exercising his horse.\" (See\\n\\t\\t\\t\\thadith 4 of this book).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community about a person\\n\\t\\t\\t\\twho digs a well on a road or ties up an animal or does\\n\\t\\t\\t\\tthe like of that on a road used by muslims, is that since\\n\\t\\t\\t\\twhat he has done is included in that which he is not\\n\\t\\t\\t\\tpermitted to do in such a place, he is liable for\\n\\t\\t\\t\\twhatever injury or other thing arises from that action.\\n\\t\\t\\t\\tThe blood-money of that which is less than a third of the\\n\\t\\t\\t\\tfull blood-money is owed from his own personal property.\\n\\t\\t\\t\\tWhatever reaches a third or more, is owed by his tribe.\\n\\t\\t\\t\\tAny such things that he does which he is permitted to do\\n\\t\\t\\t\\ton the muslims' road are something for which he has no\\n\\t\\t\\t\\tliability or loss. Part of that is a hole which a man\\n\\t\\t\\t\\tdigs to collect rain, and the beast from which the man\\n\\t\\t\\t\\talights for some need and leaves standing on the road.\\n\\t\\t\\t\\tThere is no penalty against anyone for this.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who went down a well, and another\\n\\t\\t\\t\\tman followed behind him, and the lower one pulled the\\n\\t\\t\\t\\thigher one and they fell into the well and both died He\\n\\t\\t\\t\\tsaid, \"The tribe of the one who pulled him in is\\n\\t\\t\\t\\tresponsible for the blood-money.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a child whom a man ordered to go down\\n\\t\\t\\t\\tinto a well or to climb a palm tree and he died as a\\n\\t\\t\\t\\tresult. He said, \"The one who ordered him is liable for\\n\\t\\t\\t\\twhatever befalls him, be it death or something else.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things in our community\\n\\t\\t\\t\\tabout which there is no dispute is that women and\\n\\t\\t\\t\\tchildren are not obliged to pay blood-money together with\\n\\t\\t\\t\\tthe tribe in the blood-moneys which the tribe must pay.\\n\\t\\t\\t\\tThe blood-money is only obligatory for a man who has\\n\\t\\t\\t\\treached puberty.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that the tribe could bind themselves to the\\n\\t\\t\\t\\tblood-money of mawali if they wished. If they refused,\\n\\t\\t\\t\\tthey were people of the diwan or were cut off from their\\n\\t\\t\\t\\tpeople. In the time of the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, people paid the\\n\\t\\t\\t\\tblood-money to each other as well as in the time of Abu\\n\\t\\t\\t\\tBakr as-Siddiq before there was a diwan. The diwan was in\\n\\t\\t\\t\\tthe time of Umar ibn al-Khattab. No one other than one's\\n\\t\\t\\t\\tpeople and the ones holding the wala' paid blood-money\\n\\t\\t\\t\\tfor one because the wala' was not transferable and\\n\\t\\t\\t\\tbecause the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"The wala' belongs to the one who sets\\n\\t\\t\\t\\tfree.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The wala' is an established relationship.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community about animals\\n\\t\\t\\t\\tthat are injured is that the person who causes the injury\\n\\t\\t\\t\\tpays whatever of their value has been diminished.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man condemned to death and one of the\\n\\t\\t\\t\\tother hudud befell him, \"He is not punished for it. That\\n\\t\\t\\t\\tis because the killing overrides all of that, except for\\n\\t\\t\\t\\tslander. The slander remains hanging over the one to whom\\n\\t\\t\\t\\tit was said because it will be said to him, 'Why do you\\n\\t\\t\\t\\tnot flog the one who slandered you?' I think that the\\n\\t\\t\\t\\tcondemned man is flogged with the hadd before he is\\n\\t\\t\\t\\tkilled, and then he is killed. I do not think that any\\n\\t\\t\\t\\tretaliation is inflicted on him for any injury except\\n\\t\\t\\t\\tkilling because killing overrides all of that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community is that when a\\n\\t\\t\\t\\tmurdered person is found among the main body of a people\\n\\t\\t\\t\\tin a village or other place, the house or place of the\\n\\t\\t\\t\\tnearest people to him is not responsible. That is because\\n\\t\\t\\t\\tthe murdered person can be slain and then cast at the\\n\\t\\t\\t\\tdoor of some people to shame them by it. No one is\\n\\t\\t\\t\\tresponsible for the like of that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a group of people who fight with each\\n\\t\\t\\t\\tother and when the fight is broken up, a man is found\\n\\t\\t\\t\\tdead or wounded, and it is not known who did it, \"The\\n\\t\\t\\t\\tbest of what is heard about that is that there is\\n\\t\\t\\t\\tblood-money for him, and the blood-money is against the\\n\\t\\t\\t\\tpeople who argued with him. If the injured or slain\\n\\t\\t\\t\\tperson is not from either of the two parties, his\\n\\t\\t\\t\\tblood-money is against both of the two parties together.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "13",
    "sectionHeading": "Killing Secretly by Trickery and Sorcery",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSaid ibn al-Musayyab that Umar ibn al-Khattab killed five\\n\\t\\t\\t\\tor seven people for one man whom they had killed secretly\\n\\t\\t\\t\\tby trickery. Umar said, \"Had all the people of Sana\\n\\t\\t\\t\\tjoined forces against him, I would have killed them all.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "14",
    "sectionHeading": "Killing Secretly by Trickery and Sorcery",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Sad ibn Zurara that he had heard that\\n\\t\\t\\t\\tHafsa, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, killed one of\\ther slave-girls who had\\n\\t\\t\\t\\tused sorcery against her. She was a mudabbara. Hafsa gave\\n\\t\\t\\t\\tthe order, and she was killed.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The sorcerer is the one who uses sorcery for\\n\\t\\t\\t\\thimself and no one else uses that for him. It is like the\\n\\t\\t\\t\\tone about whom Allah, the Blessed, the Exalted, said in\\n\\t\\t\\t\\tHis Book, 'They know the one who devotes himself to it\\n\\t\\t\\t\\twill have no share in the Next World.' (Sura 2 ayat 102)\\n\\t\\t\\t\\tI think that that person is killed if he does that\\n\\t\\t\\t\\thimself.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "15",
    "sectionHeading": "What Is Obligatory for Intentional Injury",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Umar ibn Husayn, the\\n\\t\\t\\t\\tmawla of A'isha bint Qudama, that Abd al-Malik ibn Marwan\\n\\t\\t\\t\\timposed retaliation against a man who killed a mawla with\\n\\t\\t\\t\\ta stick and so the mawla's patron killed the man with a\\n\\t\\t\\t\\tstick.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tin our community about which there is no dispute is that\\n\\t\\t\\t\\twhen a man strikes another man with a stick or hits him\\n\\t\\t\\t\\twith a rock or intentionally strikes him causing his\\n\\t\\t\\t\\tdeath, that is an intentional injury and there is\\n\\t\\t\\t\\tretaliation for it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Intentional murder with us is that a man\\n\\t\\t\\t\\tintentionally goes to a man and strikes him until his\\n\\t\\t\\t\\tlife goes. Part of intentional injury also is that a man\\n\\t\\t\\t\\tstrikes a man in a quarrel between them. He leaves him\\n\\t\\t\\t\\twhile he is alive, and he bleeds to death and so dies.\\n\\t\\t\\t\\tThere is retaliation for that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What is done in our community is that a\\n\\t\\t\\t\\tgroup of free men are killed for the intentional murder\\n\\t\\t\\t\\tof one free man, and a group of women for one woman, and\\n\\t\\t\\t\\ta group of slaves for one slave.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "15",
    "sectionHeading": "Retaliation in Killing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tMarwan ibn al-Hakam wrote to Muawiya ibn Abi Sufyan to\\n\\t\\t\\t\\tmention to him that a drunkard was brought to him who had\\n\\t\\t\\t\\tkilled a man. Muawiya wrote to him to kill him in\\n\\t\\t\\t\\tretaliation for the dead man.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The best of what I have\\n\\t\\t\\t\\theard on the interpretation of this ayat, the word of\\n\\t\\t\\t\\tAllah, the Blessed, the Exalted, 'The free man for the\\n\\t\\t\\t\\tfree man and the slave for the slave - these are men and\\n\\t\\t\\t\\tthe woman for the woman,' (Sura 2 ayat 178) is that\\n\\t\\t\\t\\tretaliation is between women as it is between men. The\\n\\t\\t\\t\\tfree woman is killed for the free woman as the free man\\n\\t\\t\\t\\tis killed for the free man. The slave-girl is slain for\\n\\t\\t\\t\\tthe slave-girl as the slave is slain for the slave.\\n\\t\\t\\t\\tRetaliation is between women as it is between men. That\\n\\t\\t\\t\\tis because Allah, the Blessed, the Exalted, said in His\\n\\t\\t\\t\\tBook, 'We have written for them in it that it is a life\\n\\t\\t\\t\\tfor a life and an eye for an eye, a nose for a nose, and\\n\\t\\t\\t\\tan ear for an ear, and a tooth for a tooth, and for\\n\\t\\t\\t\\twounds there is retaliation.' (Sura 5 ayat 48) Allah, the\\n\\t\\t\\t\\tBlessed, the Exalted, mentioned that it is a life for a\\n\\t\\t\\t\\tlife. It is the life of a free woman for the life of a\\n\\t\\t\\t\\tfree man, and her injury for his injury.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who held a man fast for another\\n\\t\\t\\t\\tman to hit, and he died on the spot, \"If he held him and\\n\\t\\t\\t\\the thought that he meant to kill him, the two of them are\\n\\t\\t\\t\\tboth killed for him. If he held him and he thought that\\n\\t\\t\\t\\the meant to beat him as people sometimes do, and he did\\n\\t\\t\\t\\tnot think that he meant to kill him, the murderer is\\n\\t\\t\\t\\tslain and the one who held him is punished with a very\\n\\t\\t\\t\\tsevere punishment and jailed for a year. There is no\\n\\t\\t\\t\\tkilling against him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who murdered a man intentionally\\n\\t\\t\\t\\tor gouged out his eye intentionally, and then was slain\\n\\t\\t\\t\\tor had his eye gouged out himself before retaliation was\\n\\t\\t\\t\\tinflicted on him, \"There is no blood-money nor\\n\\t\\t\\t\\tretaliation against him. The right of the one who was\\n\\t\\t\\t\\tkilled or had his eye gouged out goes when the thing\\n\\t\\t\\t\\twhich he is claiming as retaliation goes. It is the same\\n\\t\\t\\t\\twith a man who murders another man intentionally and then\\n\\t\\t\\t\\tthe murderer dies. When the murderer dies, the one\\n\\t\\t\\t\\tseeking blood-revenge has nothing of blood-money or\\n\\t\\t\\t\\tanything else. That is by the word of Allah, the Blessed\\n\\t\\t\\t\\tthe Exalted, 'Retaliation is written for you in killing.\\n\\t\\t\\t\\tThe free man for the free man and the slave for the\\n\\t\\t\\t\\tslave.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"He only has retaliation against the one who\\n\\t\\t\\t\\tkilled him. If the man who murdered him dies, he has no\\n\\t\\t\\t\\tretaliation or blood-money.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no retaliation held against a free\\n\\t\\t\\t\\tman by a slave for any injury. The slave is killed for\\n\\t\\t\\t\\tthe free man when he intentionally murders him. The free\\n\\t\\t\\t\\tman is not slain for the slave, even if he murders him\\n\\t\\t\\t\\tintentionally. It is the best of what I have heard.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "15",
    "sectionHeading": "Pardoning Murder",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he saw whomever he\\n\\t\\t\\t\\twas satisfied with among the people of knowledge say\\n\\t\\t\\t\\tabout a man who willed that his murderer be pardoned when\\n\\t\\t\\t\\the murdered him intentionally, \"That is permitted for\\n\\t\\t\\t\\thim. He is more entitled to the man's blood than any of\\n\\t\\t\\t\\this relatives after him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who pardoned murder, after he had\\n\\t\\t\\t\\tclaimed his right and it was obliged for him, \"There is\\n\\t\\t\\t\\tno blood-money against the murderer unless the one who\\n\\t\\t\\t\\tpardons him stipulates that when he pardons him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about the murderer when he was pardoned, \"He\\n\\t\\t\\t\\tis flogged one hundred lashes and jailed for a year.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a man murders intentionally and there\\n\\t\\t\\t\\tis a clear proof of that, and the murdered man has sons\\n\\t\\t\\t\\tand daughters and the sons pardon and the daughters\\n\\t\\t\\t\\trefuse to pardon, the pardon of the sons is permitted in\\n\\t\\t\\t\\topposition to the daughters and there is no authority for\\n\\t\\t\\t\\tthe daughters with the sons in demanding blood and\\n\\t\\t\\t\\tpardoning.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "15",
    "sectionHeading": "Retaliation in Injury",
    "text": "<p>\\n\\t\\t\\t\\tYahya said that Malik said, \"The generally agreed on way\\n\\t\\t\\t\\tof doing things in our community is that retaliation is\\n\\t\\t\\t\\ttaken from someone who breaks someone's hand or foot\\n\\t\\t\\t\\tintentionally and not blood-money.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Retaliation is not inflicted on anyone until\\n\\t\\t\\t\\tthe wound of the injured party has healed. Then\\n\\t\\t\\t\\tretaliation is inflicted on him. If the wound of the\\n\\t\\t\\t\\tperson on whom the retaliation has been inflicted is like\\n\\t\\t\\t\\tthe first person's wound when it heals, it is\\n\\t\\t\\t\\tretaliation. If the wound of the one on whom the\\n\\t\\t\\t\\tretaliation has been inflicted becomes worse or he dies,\\n\\t\\t\\t\\tthere is nothing held against the one who has taken\\n\\t\\t\\t\\tretaliation. If the wound of the person on whom the\\n\\t\\t\\t\\tretaliation has been inflicted heals and the injured\\n\\t\\t\\t\\tparty is paralysed or his injury has healed but he has a\\n\\t\\t\\t\\tscar, defect, or blemish, the person on whom the\\n\\t\\t\\t\\tretaliation has been inflicted does not have his hand\\n\\t\\t\\t\\tbroken again and further retaliation is not taken for his\\n\\t\\t\\t\\tinjury.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"But there is blood-money from him according to\\n\\t\\t\\t\\twhat he has impaired or maimed of the hand of the injured\\n\\t\\t\\t\\tparty. The bodily injury is also like that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a man intentionally goes to his wife\\n\\t\\t\\t\\tand gouges out her eye or breaks her hand or cuts off her\\n\\t\\t\\t\\tfinger or such like, and does it intentionally,\\n\\t\\t\\t\\tretaliation is inflicted on him. As for a man who strikes\\n\\t\\t\\t\\this wife with a rope or a whip and hits what he did not\\n\\t\\t\\t\\tmean to hit or does what he did not intend to do, he pays\\n\\t\\t\\t\\tblood-money for what he has struck according to this\\n\\t\\t\\t\\tprinciple, and retaliation is not inflicted on him.\" \\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Abu\\n\\t\\t\\t\\tBakr ibn Muhammd ibn Amr ibn Hazm took retaliation for\\n\\t\\t\\t\\tthe breaking of a leg.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "43",
    "hadithNumber": "15",
    "sectionHeading": "The Blood-Money and Crime of the Slave Set Free and from Whom his Former Master does Not Inherit",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tSulayman ibn Yasar that a slave was set free by one of\\n\\t\\t\\t\\tthe people on hajj and his master had abandoned the right\\n\\t\\t\\t\\tto inherit from him. The ex-slave then killed a man from\\n\\t\\t\\t\\tthe Banu A'idh tribe. An A'idhi, the father of the slain\\n\\t\\t\\t\\tman came to Umar ibn al-Khattab seeking the blood-money\\n\\t\\t\\t\\tof his son. Umar said, \"He has no blood-money.\" The\\n\\t\\t\\t\\tA'idhi said, -What would you think if it had been my son\\n\\t\\t\\t\\twho killed him?\" Umar said, \"Then you would pay his\\n\\t\\t\\t\\tblood-money.\" He said, \"He is then like the black and\\n\\t\\t\\t\\twhite Arqam snake. If it is left, it devours and if it is\\n\\t\\t\\t\\tkilled, it takes revenge.\"\\n\\t\\t\\t</p>"
  }
]
