[
  {
    "SurahNumber": "81",
    "AyahNumber": "1",
    "NoteID": "5969",
    "Body": "Verses 1 to 13 are conditional clauses, and the\\n\\t\\t\\t\\tsubstantive clause is in verse 14. The time will come\\n\\t\\t\\t\\twhen nature's processes as we know them will cease to\\n\\t\\t\\t\\tfunction, and the soul will only then know by self\\n\\t\\t\\t\\tconviction the results of its actions. With reference to\\n\\t\\t\\t\\tan individual soul, its resurrection is its supreme\\n\\t\\t\\t\\tcrisis: the whole world of sense, and even of imagination\\n\\t\\t\\t\\tand reason, melts away, and its whole spiritual scroll is\\n\\t\\t\\t\\tlaid bare before it."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "1",
    "NoteID": "5970",
    "Body": "The conditional clauses are twelve, in two groups of six.\\n\\t\\t\\t\\tThe first six affect the outer or physical life of man;\\n\\t\\t\\t\\tthe last six, his inmost spiritual life. Let us take them\\n\\t\\t\\t\\tone by one. (1) The biggest factor affecting us in the\\n\\t\\t\\t\\texternal physical World is the light, heat, and perhaps\\n\\t\\t\\t\\telectric or magnetic energy of the sun. The sun is the\\n\\t\\t\\t\\tsource of all the light, heat, and energy, and indeed the\\n\\t\\t\\t\\tsource and support of all the physical life that we know.\\n\\t\\t\\t\\tIt is the biggest factor and yet most remote from us in\\n\\t\\t\\t\\tour solar system. Yet the sources of our inner spiritual\\n\\t\\t\\t\\tlife will be greater and more lasting, for they will\\n\\t\\t\\t\\tsurvive it. The sun as the center of our solar system\\n\\t\\t\\t\\talso stands as a symbol of the present order of things.\\n\\t\\t\\t\\tThe physical forces, as defined in Newton's laws of\\n\\t\\t\\t\\tMatter and Attraction, will also break up with the\\n\\t\\t\\t\\tbreak-up of the sun."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "2",
    "NoteID": "5971",
    "Body": "(2) Next after the sun, we can derive faint lights from\\n\\t\\t\\t\\tthe innumerable stars in the firmament. For all the ages\\n\\t\\t\\t\\tof which we have any record, these stars have remained\\n\\t\\t\\t\\tfixed. Nothing can be more fixed; yet they can and will\\n\\t\\t\\t\\tfail."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "3",
    "NoteID": "5972",
    "Body": "Cf. lxxviii. 20. (3) On our own earth the mountains-the\\n\\t\\t\\t\\t\"eternal hills\"-seem the most striking examples of\\n\\t\\t\\t\\tstability; yet they will be swept away like a mirage, as\\n\\t\\t\\t\\tif they had never existed."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "4",
    "NoteID": "5973",
    "Body": "(4) The type of Arab property, as well as the type of the\\n\\t\\t\\t\\tArab pet, was the camel, and the most precious camel was\\n\\t\\t\\t\\tthe she-camel just about to be delivered of her young.\\n\\t\\t\\t\\tShe would in normal times be most sedulously cared for.\\n\\t\\t\\t\\tBut when all our landmarks of this life vanish, even she\\n\\t\\t\\t\\twould be left untended. Nothing would then be as it is\\n\\t\\t\\t\\tnow."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "5",
    "NoteID": "5974",
    "Body": "(5) In the present world, the wild animals fear each\\n\\t\\t\\t\\tother, and they all fear man and normally keep away from\\n\\t\\t\\t\\thuman habitations. But when this order passes away, there\\n\\t\\t\\t\\twill be scarcely any differentiation between human\\n\\t\\t\\t\\thabitations and the wilds of the forests."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "6",
    "NoteID": "5975",
    "Body": "See lii. 6 and n. 5041. (6) The oceans, which now keep\\n\\t\\t\\t\\ttheir bounds, will surge and boil over, and overwhelm all\\n\\t\\t\\t\\tlandmarks. At present the waters seem to have reached\\n\\t\\t\\t\\ttheir fixed and normal levels, but the whole equilibrium\\n\\t\\t\\t\\twill then be disturbed. Such will be the complete wreck\\n\\t\\t\\t\\tof this transitory world, at the approach of the dawn of\\n\\t\\t\\t\\tthe permanent Reality. But these are physical symbols,\\n\\t\\t\\t\\trelating to the outer nature surrounding the physical\\n\\t\\t\\t\\tnature of man. The remaining six. viz.,: the 7th to the\\n\\t\\t\\t\\t12th, describe the ordering of the new World, from which\\n\\t\\t\\t\\tall present seeming incongruities will be removed."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "7",
    "NoteID": "5976",
    "Body": "Cf. lvi. 7, where the sorting out into three classes is\\n\\t\\t\\t\\tmentioned, viz.,: Those Nearest to Allah, the Companions\\n\\t\\t\\t\\tof the Right Hand, and the Companions of the Left Hand.\\n\\t\\t\\t\\tThat was a sort of broad general division. The meaning in\\n\\t\\t\\t\\tthis passage is wider, (7) Whereas in this world of\\n\\t\\t\\t\\tprobation, good is mixed with evil, knowledge with\\n\\t\\t\\t\\tignorance, power with arrogance, and so on, in the new\\n\\t\\t\\t\\tworld of Reality, all true values will be restored, and\\n\\t\\t\\t\\tlike will consort with like, for it will be a world of\\n\\t\\t\\t\\tperfect Peace, Harmony, and Justice."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "9",
    "NoteID": "5977",
    "Body": "(8) In this world of sin and sorrow, much unjust\\n\\t\\t\\t\\tsuffering is caused, and innocent lives sacrificed,\\n\\t\\t\\t\\twithout a trace being left, by which offenders can be\\n\\t\\t\\t\\tbrought to justice. A striking example before the Quraish\\n\\t\\t\\t\\twas female infanticide: cf. xvi. 58-59, and n. 2084. The\\n\\t\\t\\t\\tcrime was committed in the guise of social plausibility\\n\\t\\t\\t\\tin secret collusion, and no question was asked here. But\\n\\t\\t\\t\\tin the world of Justice, full questions will be asked,\\n\\t\\t\\t\\tand the victim herself-dumb here-will be able to give\\n\\t\\t\\t\\tevidence, for she had committed no crime herself. The\\n\\t\\t\\t\\tproofs will be drawn from the very means used for\\n\\t\\t\\t\\tconcealment."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "10",
    "NoteID": "5978",
    "Body": "(9) The Scrolls recording the deeds of men, good or bad,\\n\\t\\t\\t\\twill then be laid open before all. cf. 1. 17-18, n. 4954;\\n\\t\\t\\t\\talso lxxxii. 11-12. In the present phenomenal world,\\n\\t\\t\\t\\tthings may be concealed; but in the world of absolute\\n\\t\\t\\t\\tReality, every secret is opened out, good or bad. The\\n\\t\\t\\t\\twhole tale of acts, omissions, motives, imponderable\\n\\t\\t\\t\\tspiritual hurt, neglect, or help will be laid bare."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "11",
    "NoteID": "5979",
    "Body": "The Sky, or Heaven as standing for both the Blazing Fre\\n\\t\\t\\t\\tand the Garden, the Home of the Hereafter. (10) Just as\\n\\t\\t\\t\\twhen an animal is skinned, its real flesh and blood and\\n\\t\\t\\t\\tinner organs become visible, without any outer coating to\\n\\t\\t\\t\\thold them together, so the inmost state of every soul\\n\\t\\t\\t\\twill then become plain."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "12",
    "NoteID": "5980",
    "Body": "(11) Then will burn the Blazing Fire of the Hell, worse\\n\\t\\t\\t\\tthan the fiercest fire."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "13",
    "NoteID": "5981",
    "Body": "(12) Lastly the Garden will come in sight, not yet\\n\\t\\t\\t\\tattained, but visible, or \"brought near\". For the scales\\n\\t\\t\\t\\thave fallen from the eyes, and the soul knows itself."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "14",
    "NoteID": "5983",
    "Body": "This is the conclusion. It is only on such conditions\\n\\t\\t\\t\\tthat the soul reaches its full realization. Put forward:\\n\\t\\t\\t\\tcf. \"the Deeds which his hands have sent forth\" in\\n\\t\\t\\t\\tlxxviii. 40."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "15",
    "NoteID": "5984",
    "Body": "Cf. lvi. 75, n. 5258, for the witness that the heavenly\\n\\t\\t\\t\\tbodies bear to the power, beauty, and goodness of Allah,\\n\\t\\t\\t\\tin sending His Revelation. See n. 5798 to lxxiv. 32, for\\n\\t\\t\\t\\tthe significance of an adjuration in the Qur-an."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "15",
    "NoteID": "5985",
    "Body": "The appeal here is made to three things, the Planets, the\\n\\t\\t\\t\\tNight, and the Dawn. (1) The Planets have a retrograde\\n\\t\\t\\t\\tand a forward motion, and, during occultation, hide or\\n\\t\\t\\t\\tdisappear behind the sun or moon, or are otherwise\\n\\t\\t\\t\\tinvisible or appear stationary. They behave differently\\n\\t\\t\\t\\tfrom the millions of stars around them. Yet they are not\\n\\t\\t\\t\\tmere erratic bodies, but obey definite laws, and evidence\\n\\t\\t\\t\\tthe power and wisdom of Allah."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "17",
    "NoteID": "5986",
    "Body": "How the Night gradually declines after its height at\\n\\t\\t\\t\\tmidnight! It seems gradually to steal away, and as Dawn\\n\\t\\t\\t\\tapproaches, to merge into Day. So a soul in spiritual\\n\\t\\t\\t\\tdarkness gradually awakes to its spiritual Dawn through\\n\\t\\t\\t\\tRevelation."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "18",
    "NoteID": "5987",
    "Body": "The slow \"breathing out\" of the darkness by the Dawn,\\n\\t\\t\\t\\tshows us, by beautiful imagery, that these wonderful\\n\\t\\t\\t\\toperations, of which people in their ignorance are\\n\\t\\t\\t\\tfrightened if they have to do with darkness, are really\\n\\t\\t\\t\\tbeneficent operations of Allah. They have nothing to do\\n\\t\\t\\t\\twith evil spirits, or witches, or magic. For three\\n\\t\\t\\t\\tquestions were actually raised about the holy Prophet's\\n\\t\\t\\t\\tMinistry by the ignorant. (1) Did his wonderful works\\n\\t\\t\\t\\tcome from himself and not from Allah? (2) Was he\\n\\t\\t\\t\\tpossessed of an evil spirit? In other words, was he mad?\\n\\t\\t\\t\\tFor that was the theory of madness then current. (3) Was\\n\\t\\t\\t\\the a soothsayer, or necromancer, or magician? For he had\\n\\t\\t\\t\\tvirtues, powers and eloquence, so extraordinary that they\\n\\t\\t\\t\\tcould not understand him."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "19",
    "NoteID": "5988",
    "Body": "They are told here that all their three theories were\\n\\t\\t\\t\\tfoolish. The Revelation was really from Allah. Their\\n\\t\\t\\t\\twonder should cease if they observe the daily miracles\\n\\t\\t\\t\\tworked round them in nature. The bringer of Allah's\\n\\t\\t\\t\\tMessage was the angel Gabriel, and not an evil spirit."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "20",
    "NoteID": "5989",
    "Body": "Not only was the bringer of the Revelation, Gabriel, an\\n\\t\\t\\t\\thonorable Messenger, incapable of deceit, but he had, in\\n\\t\\t\\t\\tthe angelic kingdom, rank and authority before Allah's\\n\\t\\t\\t\\tThrone, and he could convey an authoritative divine\\n\\t\\t\\t\\tMessage. He was, like the holy Prophet, faithful to his\\n\\t\\t\\t\\ttrust; and therefore there could be no question of the\\n\\t\\t\\t\\tMessage being delivered in any other way than exactly\\n\\t\\t\\t\\taccording to the divine Will and Purpose. These epithets\\n\\t\\t\\t\\tcould apply to the Prophet himself, but in view of verse\\n\\t\\t\\t\\t23 below, it is best to understand them of Gabriel."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "22",
    "NoteID": "5990",
    "Body": "After describing the credentials of the Archangel\\n\\t\\t\\t\\tGabriel, the Text now appeals to the people to consider\\n\\t\\t\\t\\ttheir own \"Companion\", the Prophet, who had been born\\n\\t\\t\\t\\tamong them and had lived with them, and was known to be\\n\\t\\t\\t\\tan honorable, truthful, and trustworthy man. If Gabriel\\n\\t\\t\\t\\twas the one who brought the Message to him, then there\\n\\t\\t\\t\\twas no question of demoniacal possession. And the Prophet\\n\\t\\t\\t\\thad seen him in his inspired vision \"in the clear\\n\\t\\t\\t\\thorizon\"."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "23",
    "NoteID": "5991",
    "Body": "Read along with this the whole passage in liii. 1-18 and\\n\\t\\t\\t\\tnotes there; specially n. 5092, where the two occasions\\n\\t\\t\\t\\tare mentioned when there was a vision of inspiration:\\n\\t\\t\\t\\t\"For truly did he see, of the Signs of his Lord, the\\n\\t\\t\\t\\tGreatest\" (liii. 18)."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "24",
    "NoteID": "5992",
    "Body": "Such would be the words of a soothsayer, guarded,\\n\\t\\t\\t\\tambiguous, and misleading. Here everything was clear,\\n\\t\\t\\t\\tsane, true, and under divine inspiration."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "25",
    "NoteID": "5993",
    "Body": "Such as evil suggestions of envy, spite, greed,\\n\\t\\t\\t\\tselfishness, or other vices. On the contrary the teaching\\n\\t\\t\\t\\tof the Qur-an is beneficent, pointing to the Right Way,\\n\\t\\t\\t\\tthe Way of Allah. Rajim: literally, driven away with\\n\\t\\t\\t\\tstones, rejected with complete ignominy. Cf. xv. 17. The\\n\\t\\t\\t\\trite of throwing stones in the valley of Mina at the\\n\\t\\t\\t\\tclose of the Makkan Pilgrimage [see n. 217 (6) to ii.\\n\\t\\t\\t\\t197] suggests symbolically that the Pilgrim emphatically,\\n\\t\\t\\t\\tdefinitely, and finally rejects all Evil."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "26",
    "NoteID": "5994",
    "Body": "It has been shown that this is no word of a mortal, but\\n\\t\\t\\t\\tthat it is full of divine wisdom; that its teaching is\\n\\t\\t\\t\\tnot that of a madman, but sane to the core and in\\n\\t\\t\\t\\taccordance with human needs; that it freely and clearly\\n\\t\\t\\t\\tdirects you to the right Path and forbids you the Path of\\n\\t\\t\\t\\tevil. Why then hesitate? Accept the divine Grace; repent\\n\\t\\t\\t\\tof your sins; and come to the higher Life."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "27",
    "NoteID": "5995",
    "Body": "It is not meant for one class or race; it is universal,\\n\\t\\t\\t\\tand is addressed to all the Worlds. For the meaning of\\n\\t\\t\\t\\t\"Worlds\", see n. 20 to i. 2."
  },
  {
    "SurahNumber": "81",
    "AyahNumber": "28",
    "NoteID": "5996",
    "Body": "Cf. lxxiv. 55-56. Allah is the Cherisher of the Worlds,\\n\\t\\t\\t\\tLord of Grace and Mercy, and His guidance is open to all\\n\\t\\t\\t\\twho have the will to profit by it. But that will must be\\n\\t\\t\\t\\texercised in conformity with Allah's Will (verse 29).\\n\\t\\t\\t\\tSuch conformity is Islam. Verse 28 points to human\\n\\t\\t\\t\\tfree-will and responsibility; verse 29 to its\\n\\t\\t\\t\\tlimitations. Both extremes, viz., cast-iron Determinism\\n\\t\\t\\t\\tand an idea of Chaotic Free-will, are condemned."
  }
]
