[
  {
    "SurahNumber": "28",
    "AyahNumber": "1",
    "NoteID": "3326",
    "Body": "See n. 3137 to xxvi. 1."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "2",
    "NoteID": "3327",
    "Body": "See n. 3138 to xxvi. 2."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "3",
    "NoteID": "3328",
    "Body": "The part of the story of Moses told here is how Moses and\\n\\t\\t\\t\\this mother were guided in the child's infancy, that even\\n\\t\\t\\t\\tas he grew up, he might be prepared for his high destiny;\\n\\t\\t\\t\\thow in youth he trusted Allah in the most awkward\\n\\t\\t\\t\\tsituations and sought His help; how he fled into exile,\\n\\t\\t\\t\\tand yet found love and support because of his well-doing:\\n\\t\\t\\t\\tand how, when he was called to his mission, he received\\n\\t\\t\\t\\tAllah's favour, which defeated all the plots of his\\n\\t\\t\\t\\tenemies. Thus Allah's Plan works continuously in the web\\n\\t\\t\\t\\tof events. Those who have faith will thus see the hand of\\n\\t\\t\\t\\tAllah in everything and welcome the light that comes to\\n\\t\\t\\t\\tthem by Revelation. With such a Faith there is no room\\n\\t\\t\\t\\tfor Chance or blind Fate."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "4",
    "NoteID": "3329",
    "Body": "For a king or ruler to make invidious distinctions\\n\\t\\t\\t\\tbetween his subjects, and specially to depress or oppress\\n\\t\\t\\t\\tany particular class of his subjects, is a dereliction of\\n\\t\\t\\t\\this kingly duties, for which he is responsible to Allah.\\n\\t\\t\\t\\tPharaoh and his clique were intoxicated with pride of\\n\\t\\t\\t\\trace and pride of material civilization, and grievously\\n\\t\\t\\t\\toppressed the Israelites. Pharaoh decreed that all male\\n\\t\\t\\t\\tsons born to his Israelite subjects should be killed, and\\n\\t\\t\\t\\tthe females kept alive for the pleasure of the Egyptians.\\n\\t\\t\\t\\tMoses was saved in a wonderful way, as related further."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "5",
    "NoteID": "3330",
    "Body": "What Pharaoh wished was to crush them. But Allah's Plan\\n\\t\\t\\t\\twas to protect them as they were weak, and indeed to make\\n\\t\\t\\t\\tthem custodians and leaders in His Faith, and to give\\n\\t\\t\\t\\tthem in inheritance a land \"flowing with milk and honey\".\\n\\t\\t\\t\\tHere they were established in authority for such time as\\n\\t\\t\\t\\tthey followed Allah's Law. As regards Pharaoh and his\\n\\t\\t\\t\\tministers and hosts, they were to be shown that they\\n\\t\\t\\t\\twould suffer, at the hands of the Israelites, the very\\n\\t\\t\\t\\tcalamities against which they were so confidently taking\\n\\t\\t\\t\\tprecautions for themselves."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "6",
    "NoteID": "3331",
    "Body": "Haman was evidently Pharaoh's minister, not to be\\n\\t\\t\\t\\tconfounded with a Haman who is mentioned in the Old\\n\\t\\t\\t\\tTestament (Esther iii.1), as a minister of Ahasuerus\\n\\t\\t\\t\\t(Xerxes) King of Persia, the same who invaded Greece, and\\n\\t\\t\\t\\truled from B.C. 485 to 464."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "6",
    "NoteID": "3332",
    "Body": "Pharaoh was trying to kill the Israelites. Instead, the\\n\\t\\t\\t\\tPlagues of Egypt, invoked by Moses, killed thousands of\\n\\t\\t\\t\\tEgyptians (vii. 133, and notes 1091-92), because \"they\\n\\t\\t\\t\\twere steeped in arrogance,-a people given to sin.\" In\\n\\t\\t\\t\\tpursuing the Israelites in their flight, Pharaoh and his\\n\\t\\t\\t\\tarmy were themselves overwhelmed in the sea."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "7",
    "NoteID": "3333",
    "Body": "The Egyptian midwives had orders to kill Israelite\\n\\t\\t\\t\\tbabies. Moses was saved from them, and his mother nursed\\n\\t\\t\\t\\tthe infant at her breast herself. But when the danger of\\n\\t\\t\\t\\tdiscovery was imminent, she put him into a chest or\\n\\t\\t\\t\\tbasket, and floated him on the river Nile. It flowed by\\n\\t\\t\\t\\tthe King's palace, and the chest with the baby was picked\\n\\t\\t\\t\\tup, as related further on. The mother had no cause to\\n\\t\\t\\t\\tfear or grieve afterwards, as the child grew up under her\\n\\t\\t\\t\\ttender care and became afterwards one of the Prophets of\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "8",
    "NoteID": "3334",
    "Body": "This was the Plan of Providence: that the wicked might\\n\\t\\t\\t\\tcast a net round themselves by fostering the man who was\\n\\t\\t\\t\\tto bring them to naught and be the instrument of their\\n\\t\\t\\t\\tpunishment,-or (looking at it from the other side) that\\n\\t\\t\\t\\tMoses might learn all the wisdom of the Egyptians in\\n\\t\\t\\t\\torder to expose all that was hollow and wicked in it."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "9",
    "NoteID": "3335",
    "Body": "He was a darling to look at, and Pharaoh had apparently\\n\\t\\t\\t\\tno son, but only a daughter, who afterwards shared his\\n\\t\\t\\t\\tthrone. This is on the supposition that the Pharaoh was\\n\\t\\t\\t\\tThothmes."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "9",
    "NoteID": "3336",
    "Body": "In all life Providence so orders things that Evil is\\n\\t\\t\\t\\tdefeated by its own weapons. Not only is it defeated, but\\n\\t\\t\\t\\tit actually, though unwittingly, advances the cause of\\n\\t\\t\\t\\tGood!"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "10",
    "NoteID": "3337",
    "Body": "The mother's heart felt the gaping void at parting from\\n\\t\\t\\t\\ther son; but her Faith in Allah's Providence kept her\\n\\t\\t\\t\\tfrom betraying herself."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "12",
    "NoteID": "3338",
    "Body": "For you: i.e., on your behalf. Thus Moses got the benefit\\n\\t\\t\\t\\tof his mother's milk as well as the prestige and the\\n\\t\\t\\t\\topportunities of being brought up in the royal family,\\n\\t\\t\\t\\twith the best of teachers to teach him Egyptian wisdom.\\n\\t\\t\\t\\tIn addition, there was the comfort to his mother."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "13",
    "NoteID": "3339",
    "Body": "Allah's promise is always true, but short-sighted people,\\n\\t\\t\\t\\tif they are a little thwarted in their plan, do not\\n\\t\\t\\t\\tunderstand that Allah's wisdom, power, and goodness are\\n\\t\\t\\t\\tfar more comprehensive than any little plans which they\\n\\t\\t\\t\\tmay form."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "14",
    "NoteID": "3340",
    "Body": "Full age may be taken to be mature youth, say between 18\\n\\t\\t\\t\\tand 30 years of age. By that time a person is fully\\n\\t\\t\\t\\testablished in life; his physical build is completed, and\\n\\t\\t\\t\\this mental and moral habits are formed. In this case, as\\n\\t\\t\\t\\tMoses was good at heart, true and loyal to his people,\\n\\t\\t\\t\\tand obedient and just to those among whom he lived, he\\n\\t\\t\\t\\twas granted wisdom and knowledge from on high, to be used\\n\\t\\t\\t\\tfor the times of conflict which were coming for him. His\\n\\t\\t\\t\\tinternal development being complete, he now goes out into\\n\\t\\t\\t\\tthe outer world, where he is again tried and proved,\\n\\t\\t\\t\\tuntil he gets his divine commission."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "15",
    "NoteID": "3341",
    "Body": "That may have been either the time of the noontime\\n\\t\\t\\t\\tsiesta, when all business is suspended even now in Egypt,\\n\\t\\t\\t\\tor the time of night, when people are usually asleep. The\\n\\t\\t\\t\\tlatter is more probable, in view of verse 18 below. But\\n\\t\\t\\t\\tthere is also another suggestion. A guest in a Palace is\\n\\t\\t\\t\\tnot free to wander about at will in the plebeian quarters\\n\\t\\t\\t\\tof the City at all sorts of hours, and this applies even\\n\\t\\t\\t\\tmore to an inmate of the Palace brought up as a son.\\n\\t\\t\\t\\tMoses was therefore visiting the City privately and\\n\\t\\t\\t\\teluding the guards. His object may have been to see for\\n\\t\\t\\t\\thimself how things were going on; perhaps he had heard\\n\\t\\t\\t\\tthat his people were being oppressed, as we may suppose\\n\\t\\t\\t\\tthat he had retained contact with his mother."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "15",
    "NoteID": "3342",
    "Body": "His object was apparently to strike him so as to release\\n\\t\\t\\t\\tthe Israelite, not to kill the Egyptian, In fact he\\n\\t\\t\\t\\tkilled the Egyptian. This was unfortunate in more ways\\n\\t\\t\\t\\tthan one. His visit to the City was clandestine; he had\\n\\t\\t\\t\\ttaken the side of the weaker and despised party; and he\\n\\t\\t\\t\\thad taken the life of an Egyptian. He was full of regrets\\n\\t\\t\\t\\tand repentance, and he prayed to Allah, and obtained\\n\\t\\t\\t\\tAllah's forgiveness."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "17",
    "NoteID": "3343",
    "Body": "He takes a conscious and solemn vow to dedicate himself\\n\\t\\t\\t\\tto Allah, and to do nothing that may in any way assist\\n\\t\\t\\t\\tthose who were doing wrong. This was his general idea,\\n\\t\\t\\t\\tbut no plan had yet shaped itself in his mind, until a\\n\\t\\t\\t\\tsecond catastrophe brought matters to a head, and he was\\n\\t\\t\\t\\tplunged in adventure."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "18",
    "NoteID": "3344",
    "Body": "The man was an Israelite. But Moses was himself in a\\n\\t\\t\\t\\tdistracted mood, for the reasons given in n. 3342 above,\\n\\t\\t\\t\\tand he was exasperated at this public appeal to him\\n\\t\\t\\t\\tagain."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "19",
    "NoteID": "3345",
    "Body": "When Moses considered further that the Egyptian was\\n\\t\\t\\t\\tunjust, he was going to intervene again, when he received\\n\\t\\t\\t\\ta double warning, one from the Egyptian who was fighting,\\n\\t\\t\\t\\tand the other from some man (Israelite or Egyptian) who\\n\\t\\t\\t\\twas friendly to him, as explained below. We may suppose\\n\\t\\t\\t\\tthat after the first day's fight, there had been a great\\n\\t\\t\\t\\tdeal of talk in the bazars, both among Israelites and\\n\\t\\t\\t\\tEgyptians. Probably the Israelites were elated at finding\\n\\t\\t\\t\\ta champion-perhaps more elated than they should have\\n\\t\\t\\t\\tbeen, and in a provocative mood, which deserved Moses's\\n\\t\\t\\t\\trebuke. Probably the Egyptians had discussed who this new\\n\\t\\t\\t\\tchampion was, and had already apprised the Palace, to\\n\\t\\t\\t\\twhich Moses had not dared to retum."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "19",
    "NoteID": "3346",
    "Body": "The Egyptian saw the situation. He said to Moses: 'Are\\n\\t\\t\\t\\tyou going to do the same with me? You are nothing but a\\n\\t\\t\\t\\tbully! And you talk of setting things right! That is what\\n\\t\\t\\t\\tyou should do if you were true to yourself!'"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "20",
    "NoteID": "3347",
    "Body": "Apparently rumours had reached the Palace, a Council had\\n\\t\\t\\t\\tbeen held, and the death of Moses had been suggested."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "21",
    "NoteID": "3348",
    "Body": "Moses saw that his position was now untenable, both in\\n\\t\\t\\t\\tthe Palace and in the City, and indeed anywhere in\\n\\t\\t\\t\\tPharaoh's territory. So he suffered voluntary exile. But\\n\\t\\t\\t\\the did not know where to go to. His mind was in a state\\n\\t\\t\\t\\tof agitation. But he turned to Allah and prayed. He got\\n\\t\\t\\t\\tconsolation, and felt that after all it was no hardship\\n\\t\\t\\t\\tto leave Egypt, where there was so much injustice and\\n\\t\\t\\t\\toppression."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "22",
    "NoteID": "3349",
    "Body": "East of Lower Egypt, for about 300 miles, runs the Sinai\\n\\t\\t\\t\\tPeninsula, bounded on the south by the Gulf of Suez, and\\n\\t\\t\\t\\ton the north by what was the Isthmus of Suez, now cut by\\n\\t\\t\\t\\tthe Suez Canal. Over the Isthmus ran the highroad to\\n\\t\\t\\t\\tPalestine and Syria, but a fugitive could not well take\\n\\t\\t\\t\\tthat road, as the Egyptians were after him. If he could,\\n\\t\\t\\t\\tafter crossing the Isthmus, plunge into the Sinai desert,\\n\\t\\t\\t\\teast or south-east, he would be in the Midianite\\n\\t\\t\\t\\tterritory, where the people would be Arabs and not\\n\\t\\t\\t\\tEgyptians. He turned thither, and again prayed to Allah\\n\\t\\t\\t\\tfor guidance."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "23",
    "NoteID": "3350",
    "Body": "The first thing that a wanderer in a desert would make\\n\\t\\t\\t\\tfor would be an oasis where he could get water from a\\n\\t\\t\\t\\tspring or well, the shade of trees against the scorching\\n\\t\\t\\t\\tsun, and some human company. The Midianite watering place\\n\\t\\t\\t\\twas probably a deep well, as surface springs are rare in\\n\\t\\t\\t\\tsandy deserts, where the water level is low, unless there\\n\\t\\t\\t\\twas a hill from which issued a spring."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "23",
    "NoteID": "3351",
    "Body": "Here is a pretty little idyll, told in the fewest and\\n\\t\\t\\t\\tmost beautiful words possible. Moses arrives at an oasis\\n\\t\\t\\t\\tin the desert, weary and travel worn, with his mind full\\n\\t\\t\\t\\tof anxiety and uncertainty owing to his recent\\n\\t\\t\\t\\texperiences in Egypt. He was thirsty and would naturally\\n\\t\\t\\t\\tseek water. At the well or spring he found shepherds (or\\n\\t\\t\\t\\tperhaps goat-herds) watering their flocks. As a stranger\\n\\t\\t\\t\\tit was not for him to thrust himself among them. He\\n\\t\\t\\t\\twaited under the shade of a tree until they should\\n\\t\\t\\t\\tfinish. He noticed two damsels, also waiting with their\\n\\t\\t\\t\\tflocks, which they had come to water. His chivalry was\\n\\t\\t\\t\\troused. He went at once among the goat-herds, made a\\n\\t\\t\\t\\tplace for the flocks of the damsels, gave them water, and\\n\\t\\t\\t\\tthen resumed his place in the shade. They were modest\\n\\t\\t\\t\\tmaidens, and had given him in three Arabic words the key\\n\\t\\t\\t\\tof the whole situation. 'Abu- na shaikhun Kabirun our\\n\\t\\t\\t\\tfather is a very old man, and therefore cannot come to\\n\\t\\t\\t\\twater the flocks; we therefore do the work; we could not\\n\\t\\t\\t\\tvery well thrust ourselves among these men.'"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "24",
    "NoteID": "3352",
    "Body": "The maidens are gone, with smiles on their lips and\\n\\t\\t\\t\\tgratitude in their hearts. What were the reflections of\\n\\t\\t\\t\\tMoses as he returned to the shade of the tree? He\\n\\t\\t\\t\\treturned thanks to Allah for the bright little vision\\n\\t\\t\\t\\twhich he had just seen. Had he done a good deed? Precious\\n\\t\\t\\t\\twas the opportunity he had had. He had slaked his thirst.\\n\\t\\t\\t\\tBut he was a homeless wanderer and had a longing in his\\n\\t\\t\\t\\tsoul, which he dared not put into words. Those shepherds\\n\\t\\t\\t\\twere no company for him. He was truly like a beggar in\\n\\t\\t\\t\\tdesperate need. For any little good that came his way, he\\n\\t\\t\\t\\twas grateful. But what was this?-this vision of a\\n\\t\\t\\t\\tcomfortable household, presided over by an old man rich\\n\\t\\t\\t\\tin flocks and herds, and richer still in two daughters,\\n\\t\\t\\t\\tas modest as they were beautiful? Perhaps he would never\\n\\t\\t\\t\\tsee them again! But Allah was preparing another surprise\\n\\t\\t\\t\\tfor him."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "25",
    "NoteID": "3353",
    "Body": "Scarcely had he rested, when one of the damsels came\\n\\t\\t\\t\\tback, walking with bashful grace! Modestly she gave her\\n\\t\\t\\t\\tmessage. 'My father is grateful for what you did for us.\\n\\t\\t\\t\\tHe invites you, that he may thank you personally, and at\\n\\t\\t\\t\\tleast give some return for your kindness.'"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "25",
    "NoteID": "3354",
    "Body": "Nothing could have been more welcome than such a message,\\n\\t\\t\\t\\tand through such a messenger. Moses went of course, and\\n\\t\\t\\t\\tsaw the old man. He found such a well-ordered patriarchal\\n\\t\\t\\t\\thousehold. The old man was happy in his daughters and\\n\\t\\t\\t\\tthey in him. There was mutual confidence. They had\\n\\t\\t\\t\\tevidently described the stranger to him in terms which\\n\\t\\t\\t\\tmade his welcome a foregone conclusion. On the other hand\\n\\t\\t\\t\\tMoses had allowed his imagination to paint the father in\\n\\t\\t\\t\\tsomething of the glorious colours in which his daughters\\n\\t\\t\\t\\thad appeared to him like an angelic vision. The two men\\n\\t\\t\\t\\tgot to be friends at once. Moses told the old man his\\n\\t\\t\\t\\tstory,-who he was, how he was brought up, and what\\n\\t\\t\\t\\tmisfortunes had made him quit Egypt. Perhaps the whole\\n\\t\\t\\t\\thousehold, including the daughters, listened breathlessly\\n\\t\\t\\t\\tto his tale. Perhaps their wonder and admiration were\\n\\t\\t\\t\\tmingled with a certain amount of pity-perhaps with some\\n\\t\\t\\t\\tmore tender feeling in the case of the girl who had been\\n\\t\\t\\t\\tto fetch him. In any case the stranger had won his place\\n\\t\\t\\t\\tin their hearts. The old man, the head of the household,\\n\\t\\t\\t\\tassured him of hospitality and safety under his roof. As\\n\\t\\t\\t\\tone with a long experience of life he congratulated him\\n\\t\\t\\t\\ton his escape. 'Who would live among unjust people? It is\\n\\t\\t\\t\\tas well you are free of them!'"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "26",
    "NoteID": "3355",
    "Body": "A little time passes. A guest after all cannot stay for\\n\\t\\t\\t\\tever. They all feel that it would be good to have him\\n\\t\\t\\t\\twith them permanently. The girl who had given her heart\\n\\t\\t\\t\\tto him had spoken their unspoken thoughts. Why not employ\\n\\t\\t\\t\\thim to tend the flocks? The father was old, and a young\\n\\t\\t\\t\\tman was wanted to look after the flocks. And-there may be\\n\\t\\t\\t\\tother possibilities."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "26",
    "NoteID": "3356",
    "Body": "Strong and trusty: Moses had proved himself to be both,\\n\\t\\t\\t\\tand these were the very qualities which a woman most\\n\\t\\t\\t\\tadmires in the man she loves."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "27",
    "NoteID": "3357",
    "Body": "A little time passed, and at length the father broached\\n\\t\\t\\t\\tthe subject of marriage. It was not for the fugitive to\\n\\t\\t\\t\\tsuggest a permanent tie, especially when, in the wealth\\n\\t\\t\\t\\tof this world, the girl's family was superior, and they\\n\\t\\t\\t\\thad an established position, while he was a mere\\n\\t\\t\\t\\twanderer. The father asked if he would marry one of the\\n\\t\\t\\t\\tdaughters and stay with them for at least eight years, or\\n\\t\\t\\t\\tif he liked, ten years, but the longer term was at his\\n\\t\\t\\t\\toption. If he brought no dower, his service for that\\n\\t\\t\\t\\tperiod was more than sufficient in lieu of dower. The\\n\\t\\t\\t\\tparticular girl intended was no doubt tacitly settled\\n\\t\\t\\t\\tlong before, by the mutual attraction of the young hearts\\n\\t\\t\\t\\tthemselves. Moses was glad of the proposal, and accepted\\n\\t\\t\\t\\tit. They ratified it in the most solemn manner, by\\n\\t\\t\\t\\tappealing to Allah. The old man, knowing the worth of his\\n\\t\\t\\t\\tson-in-law, solemnly assured him that in any event he\\n\\t\\t\\t\\twould not take advantage of his position to be a hard\\n\\t\\t\\t\\ttask-master or to insist on anything inconsistent with\\n\\t\\t\\t\\tMoses's interests, should a new future open out to him.\\n\\t\\t\\t\\tAnd a new and glorious future was awaiting him after his\\n\\t\\t\\t\\tapprenticeship."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "28",
    "NoteID": "3358",
    "Body": "In patriarchal society it was not uncommon to have a\\n\\t\\t\\t\\tmarriage bargain of this kind conditional on a certain\\n\\t\\t\\t\\tterm of service. In this case the episode conveys two\\n\\t\\t\\t\\tlessons. (1) A man destined to be a messenger of Allah is\\n\\t\\t\\t\\tyet a man, and must pass through the ups and downs of\\n\\t\\t\\t\\tlife like any other man: only he will do it with more\\n\\t\\t\\t\\tgrace and distinction than other men. (2) The beautiful\\n\\t\\t\\t\\trelations in love and marriage may themselves be a\\n\\t\\t\\t\\tpreparation for the highest spiritual destiny that may\\n\\t\\t\\t\\tawait a Messenger of Allah. A woman need not necessarily\\n\\t\\t\\t\\tbe a snare and a temptation: she may be the understanding\\n\\t\\t\\t\\thelp-mate that the Lady Khadija was to the holy Prophet."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "29",
    "NoteID": "3359",
    "Body": "The episode in the desert, full of human interest, now\\n\\t\\t\\t\\tcloses, and we come to the threshold of the sacred Call\\n\\t\\t\\t\\tto the divine ministry of Moses. Here we may compare this\\n\\t\\t\\t\\tpassage with that in xxvii. 7-14 and previous passages.\\n\\t\\t\\t\\tIn this passage we are told, after reference to Moses's\\n\\t\\t\\t\\tpreparation for his high destiny, of the particular sin\\n\\t\\t\\t\\tof Arrogance and Sacrilege of which Pharaoh was guilty\\n\\t\\t\\t\\t(xxviii 38-39), how it was punished, and with what\\n\\t\\t\\t\\tinstruments in the hands of Moses and Pharaoh. The notes\\n\\t\\t\\t\\ton the earlier passage should be read, as explanations\\n\\t\\t\\t\\talready given need not now be repeated."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "29",
    "NoteID": "3360",
    "Body": "Note how the transition is effected from the happy life\\n\\t\\t\\t\\tof Moses to the new prophetic mission."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "30",
    "NoteID": "3361",
    "Body": "We are to suppose the appearance of a bush burning but\\n\\t\\t\\t\\tnot consumed (Exod. iii. 2), a device adopted by the\\n\\t\\t\\t\\tScottish Church in its armorial bearings. Scotland\\n\\t\\t\\t\\tapparently took that emblem and motto (Nec tamen\\n\\t\\t\\t\\tconsumebatur, 'nevertheless it was not consumed') from\\n\\t\\t\\t\\tthe Synod of the Reformed Church of France, which had\\n\\t\\t\\t\\tadopted it in 1583. (I am indebted for this information\\n\\t\\t\\t\\tto the Rev. D.Y. Robertson, Chaplain of the Church of\\n\\t\\t\\t\\tScotland in Simla). The real explanation of the Burning\\n\\t\\t\\t\\tBush will be found in xxvii. 8, n. 3245."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "31",
    "NoteID": "3362",
    "Body": "The verbal meaning is: 'you have nothing to fear from\\n\\t\\t\\t\\twhat appears to be a snake: it is a snake, not for you,\\n\\t\\t\\t\\tbut for Pharaoh.' But there is a deeper meaning besides.\\n\\t\\t\\t\\tMoses had now been called to a higher prophetic mission.\\n\\t\\t\\t\\tHe had to meet the hatred of the Egyptians and circumvent\\n\\t\\t\\t\\ttheir trickery and magic. He had now the security of\\n\\t\\t\\t\\tFaith: in all dangers and difficulties Allah would guide\\n\\t\\t\\t\\tand protect him, for he was actually in Allah's service,\\n\\t\\t\\t\\tone of the Elect."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "32",
    "NoteID": "3363",
    "Body": "Literally, \"draw thy wing close to thy side, (away) from\\n\\t\\t\\t\\tfear\". When a bird is frightened, it ruffles its wings\\n\\t\\t\\t\\tand prepares to fly away, but when it is calm and\\n\\t\\t\\t\\tcomposed, it sits with its wings drawn close to its\\n\\t\\t\\t\\tsides, showing a mind secure from danger. Cf. also n.\\n\\t\\t\\t\\t2550 to xx. 22."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "33",
    "NoteID": "3364",
    "Body": "It is not that Moses is not reassured from all fear on\\n\\t\\t\\t\\taccount of the apparent snake which his rod had become,\\n\\t\\t\\t\\tor from the sacred and unfamiliar surroundings in which\\n\\t\\t\\t\\the found himself. On this point his heart has been\\n\\t\\t\\t\\tcompletely assured. But he is still new to his mission,\\n\\t\\t\\t\\tand the future is obscure to his mind. Pharaoh was after\\n\\t\\t\\t\\thim, to take his life, and apparently with good cause,\\n\\t\\t\\t\\tbecause one of Pharaoh's men had been slain at his hands.\\n\\t\\t\\t\\tAnd now he is commanded to go to Pharaoh and rebuke him\\n\\t\\t\\t\\tand his Chiefs. The inner doubts and difficulties of his\\n\\t\\t\\t\\thuman mind he frankly lays before his Lord, and asks for\\n\\t\\t\\t\\ta little human and visible support, which is granted him\\n\\t\\t\\t\\tat once, viz.; the help of his brother Aaron."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "35",
    "NoteID": "3365",
    "Body": "To touch you: to approach you anywhere near, in the\\n\\t\\t\\t\\twonders and Signs that you will show them under the\\n\\t\\t\\t\\tdivine authority with which you are invested."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "35",
    "NoteID": "3366",
    "Body": "The potency of Allah's Light is such that its divine rays\\n\\t\\t\\t\\treach the humblest of those who seek after Him. The\\n\\t\\t\\t\\tProphets can certainly work wonders, but their sincere\\n\\t\\t\\t\\tfollowers in Faith can do so also in their own spheres.\\n\\t\\t\\t\\tWonders may appeal to people, but they are not the\\n\\t\\t\\t\\thighest signs of Allah's workings, and they are around us\\n\\t\\t\\t\\tevery day in our lives."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "36",
    "NoteID": "3367",
    "Body": "This is what Moses was thinking of when he had said:\\n\\t\\t\\t\\t\"They may accuse me of falsehood\". To accuse the purest\\n\\t\\t\\t\\tTruth of lying is a favourite trick of those whose chief\\n\\t\\t\\t\\tstock-in-trade is deception and sorcery and catching the\\n\\t\\t\\t\\tattention of the vulgar by arts adapted to their ignorant\\n\\t\\t\\t\\tminds!"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "36",
    "NoteID": "3368",
    "Body": "'As to this higher talk of the worship of the One true\\n\\t\\t\\t\\tGod, why, our ancestors have worshipped power and\\n\\t\\t\\t\\tpatronage, as concentrated in Pharaoh, from the most\\n\\t\\t\\t\\tancient times!'"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "37",
    "NoteID": "3369",
    "Body": "Cf. vi. 135. The only argument in such a case is an\\n\\t\\t\\t\\tappeal to Allah, and to the ultimate Future. Both of\\n\\t\\t\\t\\tthese appeals require Faith. But even if you do not rely\\n\\t\\t\\t\\ton anything so high, you can see that Falsehood or evils\\n\\t\\t\\t\\tcrystallised in ancestral customs are not going to do any\\n\\t\\t\\t\\tone any good."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "38",
    "NoteID": "3370",
    "Body": "Pharaoh claimed, himself, to be God,-not only one god\\n\\t\\t\\t\\tamong many, but the only god: \"I am your Lord Most High\":\\n\\t\\t\\t\\tlxxix. 24. At any rate he did not see why his people\\n\\t\\t\\t\\tshould worship any one but him."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "38",
    "NoteID": "3371",
    "Body": "I understand his speech to his minister Haman to be\\n\\t\\t\\t\\tsarcastic. But some Commentators have taken it very\\n\\t\\t\\t\\tseriously and imagined that he actually thought of\\n\\t\\t\\t\\treaching the heavens by building lofty towers."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "39",
    "NoteID": "3372",
    "Body": "They did not believe in the Hereafter. They did not\\n\\t\\t\\t\\tunderstand that every deed must have its inevitable\\n\\t\\t\\t\\tconsequence, good, or evil, unless the Grace of Allah\\n\\t\\t\\t\\tintervenes to save us from ourselves!"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "40",
    "NoteID": "3373",
    "Body": "Pharaoh and his hosts were drowned in the sea in their\\n\\t\\t\\t\\tpursuit of the Israelites: see vii. 130-136. They are the\\n\\t\\t\\t\\ttype of men who lead-only to Destruction. They invite,\\n\\t\\t\\t\\tnot to Peace and Happiness, but to the Fire of Wrath,\\n\\t\\t\\t\\tmutual Envy, and Hatred."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "42",
    "NoteID": "3374",
    "Body": "Power and patronage may be lauded by sycophants and\\n\\t\\t\\t\\tselfish place-hunters; but when they are misused, and\\n\\t\\t\\t\\twhen their exposure causes their fall, they suffer\\n\\t\\t\\t\\tignominy even in this life. If they manage to escape\\n\\t\\t\\t\\texposure while alive, it often happens that they are\\n\\t\\t\\t\\tfound out after their death, and the curses of many\\n\\t\\t\\t\\tgenerations follow those whose oppressions and\\n\\t\\t\\t\\twrong-doing spoiled the fair face of Allah's earth. But\\n\\t\\t\\t\\teven this is nothing to the true Punishment that will\\n\\t\\t\\t\\tcome in the Hereafter. There, true values will be\\n\\t\\t\\t\\trestored, and some of the highest and mightiest will be\\n\\t\\t\\t\\tin the lowest depths of degradation."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "43",
    "NoteID": "3375",
    "Body": "After the destruction of the Pharaonic Tyranny and other\\n\\t\\t\\t\\tsimilar Tyrannies before them, Allah began a new age of\\n\\t\\t\\t\\tRevelation, the age of Moses and his Book. Humanity began\\n\\t\\t\\t\\tas it were with a clean slate again. It was a full\\n\\t\\t\\t\\tRevelation (or Shari'at) which may be looked at from\\n\\t\\t\\t\\tthree points of view: (1) as Light or Insight for men, so\\n\\t\\t\\t\\tthat they should not grope in darkness; (2) as a Guide to\\n\\t\\t\\t\\tshow them the Way, so that they should not be misled into\\n\\t\\t\\t\\twrong Paths; and (3) as a Mercy from Allah, so that by\\n\\t\\t\\t\\tfollowing the Way they may receive Allah's Forgiveness\\n\\t\\t\\t\\tand Grace. In vi. 91, we have a reference to Light and\\n\\t\\t\\t\\tGuidance in connection with the Revelation of Moses, and\\n\\t\\t\\t\\tin vi. 154 we have a reference to Guidance and Mercy in\\n\\t\\t\\t\\tthe same connection. Here all three are combined, with\\n\\t\\t\\t\\tthe substitution of Basair for Nur. Basair is the plural\\n\\t\\t\\t\\tof Basirat, and may also be translated Proofs, as I have\\n\\t\\t\\t\\tdone in vi. 104 Cf. also vii. 203, n. 1175, where the\\n\\t\\t\\t\\tword is translated \"Lights\"."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "44",
    "NoteID": "3376",
    "Body": "The Sinai Peninsula is in the north-west corner of\\n\\t\\t\\t\\tArabia. But the reference here is, I think, to the\\n\\t\\t\\t\\twestern side of the valley of Tuwa. Mount Tur, where\\n\\t\\t\\t\\tMoses received his prophetic commission, is on the\\n\\t\\t\\t\\twestern side of the valley."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "45",
    "NoteID": "3377",
    "Body": "That is, there were many generations that passed between\\n\\t\\t\\t\\tMoses and the holy Prophet. Yet he knew by inspiration of\\n\\t\\t\\t\\tthe events of those times. Even if he had lived then, he\\n\\t\\t\\t\\tcould not have known the events that took place among the\\n\\t\\t\\t\\tMidianites, except by inspiration, as he did not dwell\\n\\t\\t\\t\\tamong them."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "45",
    "NoteID": "3378",
    "Body": "'Though thou wast not among the Midianites, Our\\n\\t\\t\\t\\tinspiration has told thee of the momentous events that\\n\\t\\t\\t\\ttook place among them when Moses was with them. This is\\n\\t\\t\\t\\titself a Sign that should make thy people understand.'"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "46",
    "NoteID": "3379",
    "Body": "This people was the Quraish. 'Though thou didst not see\\n\\t\\t\\t\\thow Moses was invested with the prophetic office at Mount\\n\\t\\t\\t\\tTur, thou hast had similar experience thyself, and We\\n\\t\\t\\t\\thave sent thee to the Quraish to warn them of all their\\n\\t\\t\\t\\tsins, and to repent and come into the Faith'."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "47",
    "NoteID": "3380",
    "Body": "Now that a warner has come among them with all the\\n\\t\\t\\t\\tauthority that previous Messengers possessed and with all\\n\\t\\t\\t\\tthe knowledge which can only come by divine inspiration,\\n\\t\\t\\t\\tthey have no excuse left whatever. They cannot say, \"No\\n\\t\\t\\t\\twarner came to us.\" If any evil comes to them, as the\\n\\t\\t\\t\\tinevitable result of their ill-deeds, they cannot blame\\n\\t\\t\\t\\tAllah and say that they were not warned. Cf. xx. 134."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "48",
    "NoteID": "3381",
    "Body": "When a Revelation is sent to them, in the Qur-an, adapted\\n\\t\\t\\t\\tto all their needs and the needs of the time they live\\n\\t\\t\\t\\tin, they hark back to antiquity. The holy Prophet was in\\n\\t\\t\\t\\tmany respects like Moses, but the times in which he lived\\n\\t\\t\\t\\twere different from the times of Moses, and his age did\\n\\t\\t\\t\\tnot suffer from the deceptions of sorcery, like that of\\n\\t\\t\\t\\tMoses. The remedies which his age and future ages\\n\\t\\t\\t\\trequired (for his Message was universal) were different.\\n\\t\\t\\t\\tHis miracle of the Qur-an was different and most\\n\\t\\t\\t\\tpermanent than the Rod and the Radiant-White Hand of\\n\\t\\t\\t\\tMoses. But supposing that the Quraish had been humoured\\n\\t\\t\\t\\tin their insincere demands, would they have believed? Did\\n\\t\\t\\t\\tthey believe in Moses ? They were only put up by the Jews\\n\\t\\t\\t\\tto make objections which they themselves did not believe\\n\\t\\t\\t\\tin."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "48",
    "NoteID": "3382",
    "Body": "Moses was called a sorcerer by the Egyptians, and the\\n\\t\\t\\t\\twonderful words of the Qur-an were called sorcery by the\\n\\t\\t\\t\\tQuraish. As the Qur-an confirmed the Message of Moses,\\n\\t\\t\\t\\tthe Quraish objectors said that they were in collusion.\\n\\t\\t\\t\\tThe Quraish did not believe in Allah's Revelation at all."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "50",
    "NoteID": "3383",
    "Body": "They were challenged to produce something better, to be a\\n\\t\\t\\t\\tguide in life. But as they could not, it was evident that\\n\\t\\t\\t\\ttheir objections were fractious. They were only following\\n\\t\\t\\t\\ttheir own selfish lusts of power, monopoly, and\\n\\t\\t\\t\\texploitation of the poor and ignorant. How can such\\n\\t\\t\\t\\tpeople receive guidance?"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "51",
    "NoteID": "3384",
    "Body": "Before this the Quraish might have said that the Word of\\n\\t\\t\\t\\tAllah had come to the Hebrews in their tongue or in\\n\\t\\t\\t\\tGreek, which was used by the Hebrews in the time of\\n\\t\\t\\t\\tJesus. Now that Word is brought to their own doors, in\\n\\t\\t\\t\\ttheir own Arabic tongue, by a man of their own race and\\n\\t\\t\\t\\tfamily. Surely they have no excuse now for remaining\\n\\t\\t\\t\\tstrangers to the higher moral and spiritual law."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "53",
    "NoteID": "3385",
    "Body": "There were Christians and Jews who recognised that Islam\\n\\t\\t\\t\\twas a logical and natural development of Allah's\\n\\t\\t\\t\\trevelations as given in earlier ages, and they not only\\n\\t\\t\\t\\twelcomed and accepted Islam, but claimed, and rightly,\\n\\t\\t\\t\\tthat they had always been Muslims. In that sense Adam,\\n\\t\\t\\t\\tNoah, Abraham, Moses, and Jesus had all been Muslims."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "54",
    "NoteID": "3386",
    "Body": "Their credit is twofold, in that before they knew Islam,\\n\\t\\t\\t\\tthey followed the earlier Law in truth and sincerity, and\\n\\t\\t\\t\\twhen they were offered Islam, they readily recognised and\\n\\t\\t\\t\\taccepted it, suffered in patient perseverance for its\\n\\t\\t\\t\\tsake, and brought forth the fruits of righteousness."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "55",
    "NoteID": "3387",
    "Body": "The righteous do not encourage idle talk or foolish\\n\\t\\t\\t\\targuments about things sacred. If they find themselves in\\n\\t\\t\\t\\tsome company in which such things are fashionable, they\\n\\t\\t\\t\\tleave politely. Their only rejoinder is: \"We are\\n\\t\\t\\t\\tresponsible for our deeds, and you for yours; we have no\\n\\t\\t\\t\\till-will against you; we wish you well, and that is why\\n\\t\\t\\t\\twe wish you to know of the knowledge we have received;\\n\\t\\t\\t\\tafter that knowledge you cannot expect us to go back to\\n\\t\\t\\t\\tthe Ignorance which we have left.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "56",
    "NoteID": "3388",
    "Body": "The immediate occasion for this was the death of Abu\\n\\t\\t\\t\\tTalib, an uncle whom the holy Prophet loved dearly and\\n\\t\\t\\t\\twho had befriended and protected him. The Prophet was\\n\\t\\t\\t\\tnaturally anxious that he should die in the profession of\\n\\t\\t\\t\\tthe true Faith, but the pagan Quraish leaders persuaded\\n\\t\\t\\t\\thim to remain true to the faith of his fathers. This was\\n\\t\\t\\t\\tan occasion of disappointment and grief to the Prophet.\\n\\t\\t\\t\\tWe are told that in such circumstances we should not\\n\\t\\t\\t\\tgrieve. All whom we love do not necessarily share our\\n\\t\\t\\t\\tviews or beliefs. We must not judge. Allah will guide\\n\\t\\t\\t\\twhom He pleases and as He pleases. He alone knows the\\n\\t\\t\\t\\ttrue inwardness of things."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "57",
    "NoteID": "3389",
    "Body": "Some Quraish said: \"We see the truth of Islam, but if we\\n\\t\\t\\t\\tabandon our people, we shall lose our hold on the land,\\n\\t\\t\\t\\tand other people will dispossess us.\" The answer is\\n\\t\\t\\t\\ttwofold, one literal and the other of deeper import. (1)\\n\\t\\t\\t\\t'Your land? Why, the sanctuary of Makkah is sacred and\\n\\t\\t\\t\\tsecure because Allah has made it so. If you obey Allah's\\n\\t\\t\\t\\tWord, you will be strengthened, not weakened.' (2)\\n\\t\\t\\t\\t'Makkah is the symbol of the Fortress of Spiritual\\n\\t\\t\\t\\tWell-being. The Fruit of every Deed comes or should come\\n\\t\\t\\t\\tas a tribute to Spiritual Well-being. What are you afraid\\n\\t\\t\\t\\tof? It is Allah's Fortress. The more you seek Allah, the\\n\\t\\t\\t\\tstronger you are in the Fortress.'"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "58",
    "NoteID": "3390",
    "Body": "A life of ease and plenty is nothing to boast of. Yet\\n\\t\\t\\t\\tpeoples or cities or civilisations grow insolently proud\\n\\t\\t\\t\\tof such things. There were many such in the past, which\\n\\t\\t\\t\\tare now mere names! Their very sites are deserted in most\\n\\t\\t\\t\\tcases, or buried in the debris of ages. India is full of\\n\\t\\t\\t\\tsuch sites nearly everywhere. The sites of Harappa and\\n\\t\\t\\t\\tMohenjo Daro are the most ancient hitherto unearthed in\\n\\t\\t\\t\\tIndia, and they are themselves in layers covering\\n\\t\\t\\t\\tcenturies of time! And how many more there may be, of\\n\\t\\t\\t\\twhich we do not know even names! Fatehpur-Sikri was a\\n\\t\\t\\t\\tmagnificent ruin within a single generation. And there\\n\\t\\t\\t\\tare thousands of Qasbas once flourishing and now reduced\\n\\t\\t\\t\\tto small villages or altogether deserted. But God is\\n\\t\\t\\t\\tmerciful and just. He does not destroy or degrade a\\n\\t\\t\\t\\tpeople until they have had full opportunities of turning\\n\\t\\t\\t\\tin repentance to Him and they have deliberately rejected\\n\\t\\t\\t\\tHis Law and continued in the practice of iniquity."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "60",
    "NoteID": "3391",
    "Body": "The good things of this life have their uses and serve\\n\\t\\t\\t\\ttheir convenience. But they are fleeting and their value\\n\\t\\t\\t\\tis infinitely lower than that of Truth and Justice and\\n\\t\\t\\t\\tSpiritual Well-being, the gifts which come as it were\\n\\t\\t\\t\\tfrom Allah. No wise soul will be absorbed in the one and\\n\\t\\t\\t\\tneglect the other, or will hesitate for a moment if it\\n\\t\\t\\t\\tcomes to be a choice between them."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "61",
    "NoteID": "3392",
    "Body": "The two classes of people are: (1) those who have faith\\n\\t\\t\\t\\tin the goodly promise of Allah to the righteous, and who\\n\\t\\t\\t\\tare doing everything in life to reach the fulfilment of\\n\\t\\t\\t\\tthat promise, i.e., those who believe and work\\n\\t\\t\\t\\trighteousness, and (2) those who are ungrateful for such\\n\\t\\t\\t\\tgood things in this life as Allah has bestowed on them,\\n\\t\\t\\t\\tby worshipping wealth or power or other symbols or idols\\n\\t\\t\\t\\tof their fancy, i.e., those who reject Faith and lead\\n\\t\\t\\t\\tevil lives, for which they will have to answer in the\\n\\t\\t\\t\\tHereafter. The two classes are poles asunder, and their\\n\\t\\t\\t\\tfuture is described below."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "63",
    "NoteID": "3393",
    "Body": "This and the next verse are concerned with the\\n\\t\\t\\t\\texamination of those who neglected truth and\\n\\t\\t\\t\\trighteousness and went after the worship of false gods.\\n\\t\\t\\t\\tThese were the \"partners\" they associated with Allah. In\\n\\t\\t\\t\\tso far as they were embodied in false or wicked leaders,\\n\\t\\t\\t\\tthe leaders will disown responsibility for them. 'We\\n\\t\\t\\t\\tourselves went wrong, and they followed our example,\\n\\t\\t\\t\\tbecause it suited them: they worshipped, not us, but\\n\\t\\t\\t\\ttheir own lusts.'"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "63",
    "NoteID": "3394",
    "Body": "Cf. x. 28 False worship often names others, but really it\\n\\t\\t\\t\\tis the worship of Self. The others whom they name will\\n\\t\\t\\t\\thave nothing to do with them when the awful Penalty\\n\\t\\t\\t\\tstands in the sight of both. Then each wrong-doer will\\n\\t\\t\\t\\thave to look to his own case. The wicked will then\\n\\t\\t\\t\\trealise the gravity of the situation and wish that they\\n\\t\\t\\t\\thad accepted the true guidance of Allah's Messengers."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "65",
    "NoteID": "3395",
    "Body": "Now we come to the examination of those who rejected or\\n\\t\\t\\t\\tpersecuted Allah's Messengers on the earth. It may be the\\n\\t\\t\\t\\tsame men as those mentioned in xxviii. 62-64, but this is\\n\\t\\t\\t\\ta different count in the charge."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "66",
    "NoteID": "3396",
    "Body": "In their utter confusion and despair their minds will be\\n\\t\\t\\t\\tblank. The past will seem to them unreal, and the present\\n\\t\\t\\t\\tunintelligible, and they will not even be able to consult\\n\\t\\t\\t\\teach other, as every one's state will be the same."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "68",
    "NoteID": "3397",
    "Body": "As He pleases: according to His own Will and Plan. Allah\\n\\t\\t\\t\\tis not dependent on other people for advice or help. He\\n\\t\\t\\t\\thas no partners. All creation is an act of His Will, and\\n\\t\\t\\t\\tno one can direct Him how or why certain things should\\n\\t\\t\\t\\tbe, because He is supreme in wisdom and knowledge. He\\n\\t\\t\\t\\tchooses His messengers also by His own unfettered choice.\\n\\t\\t\\t\\tInspiration or spiritual knowledge and dignity cannot be\\n\\t\\t\\t\\tjudged of by our relative or temporary standards. Worldly\\n\\t\\t\\t\\tgreatness or even wisdom do not necessarily go with\\n\\t\\t\\t\\tspiritual insight."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "69",
    "NoteID": "3398",
    "Body": "Men may form all sorts of vain wishes or conceal their\\n\\t\\t\\t\\tdesigns. But Allah's Will is supreme, and nothing can\\n\\t\\t\\t\\twithstand its fulfilment."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "71",
    "NoteID": "3399",
    "Body": "In the physical world the Night and the Day are both\\n\\t\\t\\t\\tblessings, the one for rest and the other for work, and\\n\\t\\t\\t\\tthe alternation itself is one of the mercies of Allah,\\n\\t\\t\\t\\tand none but He can give us these blessings. If we were\\n\\t\\t\\t\\tperpetually resting, or screened from the light, our\\n\\t\\t\\t\\tfaculties would be blunted and we should be worse than\\n\\t\\t\\t\\tdead. If we were perpetually working, we should be tired,\\n\\t\\t\\t\\tand we should also be dead in another way. This daily\\n\\t\\t\\t\\tmiracle keeps us alive and prepares us, in this our\\n\\t\\t\\t\\tprobationary life, for our final destiny in the\\n\\t\\t\\t\\tHereafter. In the same way our spiritual strivings\\n\\t\\t\\t\\trequire periodical alternations of rest in the form of\\n\\t\\t\\t\\tattention to our temporal concerns: hence the\\n\\t\\t\\t\\tjustification of a good and pure life on the plane of\\n\\t\\t\\t\\tthis earth also. Also, in the world's history, there are\\n\\t\\t\\t\\tperiods when a living messenger stimulates intense\\n\\t\\t\\t\\tspiritual activity, and periods when it is comparatively\\n\\t\\t\\t\\tquiescent (the so-called Dark Ages); but both are\\n\\t\\t\\t\\texamples of the working of Allah's Plan of wisdom and\\n\\t\\t\\t\\tmercy. But this applies only up to the Day of Judgment.\\n\\t\\t\\t\\tAfter that we shall be on another plane altogether."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "72",
    "NoteID": "3400",
    "Body": "In verse 71 was mentioned a \"perpetual Night,\" for which\\n\\t\\t\\t\\tthe faculty of \"hearkening\" was appropriate, as all light\\n\\t\\t\\t\\twas shut out. In this verse a perpetual Day is mentioned,\\n\\t\\t\\t\\tfor which the faculty of \"seeing\" is appropriate. Through\\n\\t\\t\\t\\tmany doors can the higher knowledge enter our souls.\\n\\t\\t\\t\\tShall we not use each of them as the occasion demands?"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "74",
    "NoteID": "3401",
    "Body": "Cf. xxviii. 62 above. The reminiscence of the words\\n\\t\\t\\t\\tcloses and rounds off the argument of this Section."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "75",
    "NoteID": "3402",
    "Body": "Cf. iv. 41. The Prophet from each People or Nation will\\n\\t\\t\\t\\tbear testimony that he preached the true gospel of Unity,\\n\\t\\t\\t\\tand the People who rejected him will be asked to show the\\n\\t\\t\\t\\tProof or authority on which they rejected him: Cf. ii.\\n\\t\\t\\t\\t111."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "75",
    "NoteID": "3403",
    "Body": "In that new world, all the fancies or lies, which had\\n\\t\\t\\t\\tbeen invented in this world of reflected or relative\\n\\t\\t\\t\\ttruths mixed with illusions, will have vanished, and left\\n\\t\\t\\t\\tthose in the lurch who relied on them. Cf. vi. 24."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "76",
    "NoteID": "3404",
    "Body": "Qarun is identified with the Korah of the English Bible.\\n\\t\\t\\t\\tHis story is told in Num. xvi. 1-35. He and his\\n\\t\\t\\t\\tfollowers, numbering 250 men, rose in rebellion against\\n\\t\\t\\t\\tMoses and Aaron, on the ground that their position and\\n\\t\\t\\t\\tfame in the congregation entitled them to quality in\\n\\t\\t\\t\\tspiritual matters with the Priests,-that they were as\\n\\t\\t\\t\\tholy as any, and they claimed to burn incense at the\\n\\t\\t\\t\\tsacred Altar reserved for the Priests. They had an\\n\\t\\t\\t\\texemplary punishment: \"the earth opened her mouth, and\\n\\t\\t\\t\\tswallowed them up, and their houses, and all the men that\\n\\t\\t\\t\\tappertained unto Korah, and all their goods: they, and\\n\\t\\t\\t\\tall that appertained to them, went down alive into the\\n\\t\\t\\t\\tpit, and the earth closed upon them: and they perished\\n\\t\\t\\t\\tfrom among the congregation.\""
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "76",
    "NoteID": "3405",
    "Body": "Qarun's boundless wealth is described in the Midrashim,\\n\\t\\t\\t\\tor the Jewish compilations based on the oral teachings of\\n\\t\\t\\t\\tthe Synagogues, which however exaggerate the weight of\\n\\t\\t\\t\\tthe keys to be the equivalent of the load of 300 mules!"
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "76",
    "NoteID": "3406",
    "Body": "Usbat: a body of men, here used indefinitely. It usually\\n\\t\\t\\t\\timplies a body of 10 to 40 men. The old-fashioned keys\\n\\t\\t\\t\\twere big and heavy, and if there were hundreds of\\n\\t\\t\\t\\ttreasure-chests, the keys must have been a great weight.\\n\\t\\t\\t\\tAs they were travelling in the desert, the treasures were\\n\\t\\t\\t\\tpresumably left behind in Egypt, and only the keys were\\n\\t\\t\\t\\tcarried. The disloyal Qarun had left his heart in Egypt,\\n\\t\\t\\t\\twith his treasures."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "77",
    "NoteID": "3407",
    "Body": "That is, 'spend your wealth in charity and good works. It\\n\\t\\t\\t\\tis Allah Who has given it to you, and you should spend it\\n\\t\\t\\t\\tin Allah's cause. Nor should you forget the legitimate\\n\\t\\t\\t\\tneeds of this life, as misers do, and most people become\\n\\t\\t\\t\\tmisers who think too exclusively of their wealth'. If\\n\\t\\t\\t\\twealth is not used properly, there are three evils that\\n\\t\\t\\t\\tfollow: (1) its possessor may be a miser and forget all\\n\\t\\t\\t\\tclaims due to himself and those about him; (2) he may\\n\\t\\t\\t\\tforget the higher needs of the poor and needy, or the\\n\\t\\t\\t\\tgood causes which require support; and (3) he may even\\n\\t\\t\\t\\tmisspend on occasions and cause a great deal of harm and\\n\\t\\t\\t\\tmischief. Apparently Qarun had all three vices."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "78",
    "NoteID": "3408",
    "Body": "He was so blind and arrogant that he thought that his own\\n\\t\\t\\t\\tmerit, knowledge, and skill or cleverness had earned him\\n\\t\\t\\t\\this wealth, and that now, on account of it, he was\\n\\t\\t\\t\\tsuperior to everybody else and was entitied to ride\\n\\t\\t\\t\\trough-shod over them. Fool!-he was soon pulled up by\\n\\t\\t\\t\\tAllah."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "78",
    "NoteID": "3409",
    "Body": "Even Qarun was given a long run of enjoyment with his\\n\\t\\t\\t\\tfabulous wealth before he had to be removed for the\\n\\t\\t\\t\\tmischief he was doing."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "79",
    "NoteID": "3410",
    "Body": "When he was in the hey-day of his glory, worldly people\\n\\t\\t\\t\\tenvied him and thought how happy they would be if they\\n\\t\\t\\t\\twere in his place. Not so the people of wisdom and\\n\\t\\t\\t\\tdiscernment. They knew a more precious and lasting\\n\\t\\t\\t\\twealth, which is described in the next verse."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "81",
    "NoteID": "3411",
    "Body": "See n. 3404 above. Cf. also xvi. 45 and n. 2071. Besides\\n\\t\\t\\t\\tthe obvious moral in the literal interpretation of the\\n\\t\\t\\t\\tstory, that material wealth is fleeting and may be a\\n\\t\\t\\t\\ttemptation and a cause of fall, there are some\\n\\t\\t\\t\\tmetaphorical implications that occur to me. (1) Material\\n\\t\\t\\t\\twealth has no value in itself, but only a relative and\\n\\t\\t\\t\\tlocal value. (2) In body he was with Israel in the\\n\\t\\t\\t\\twilderness, but his heart was in Egypt with its fertility\\n\\t\\t\\t\\tand its slavery. Such is the case of many hypocrites, who\\n\\t\\t\\t\\tlike to be seen in righteous company but whose thoughts,\\n\\t\\t\\t\\tlongings, and doing are inconsistent with such company.\\n\\t\\t\\t\\t(3) There is no good in this life but comes from Allah.\\n\\t\\t\\t\\tTo think otherwise is to set up a false god besides\\n\\t\\t\\t\\tAllah, Our own merits are so small that they should never\\n\\t\\t\\t\\tbe the object of our idolatry. (4) If Qarun on account of\\n\\t\\t\\t\\this wealth was setting himself up in rivalry with Moses\\n\\t\\t\\t\\tand Aaron, he was blind to the fact that spiritual\\n\\t\\t\\t\\tknowledge is far above any little cleverness in worldly\\n\\t\\t\\t\\taffairs. Mob-leaders have no position before spiritual\\n\\t\\t\\t\\tguides."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "82",
    "NoteID": "3412",
    "Body": "Provision or Sustenance, both literally and figuratively:\\n\\t\\t\\t\\twealth and material things in life as well as the things\\n\\t\\t\\t\\tthat sustain our higher and spiritual faculties. The\\n\\t\\t\\t\\trabble, that admired Qarun's wealth when he was in\\n\\t\\t\\t\\tworldly prosperity, now sees the other side of the\\n\\t\\t\\t\\tquestion and understands that there are other gifts more\\n\\t\\t\\t\\tprecious and desirable, and that these may actually be\\n\\t\\t\\t\\twithheld from men who enjoy wealth and worldly\\n\\t\\t\\t\\tprosperity. In fact it is false prosperity, or no\\n\\t\\t\\t\\tprosperity in the real sense of the word, which is\\n\\t\\t\\t\\twithout spiritual well-being."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "83",
    "NoteID": "3413",
    "Body": "High-handedness or arrogance, as opposed to submission to\\n\\t\\t\\t\\tthe Will of Allah, Islam. Mischief, as opposed to doing\\n\\t\\t\\t\\tgood, bringing forth fruits of righteousness. It is the\\n\\t\\t\\t\\trighteous who will win in the end."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "84",
    "NoteID": "3414",
    "Body": "A good deed has its sure reward, and that reward will be\\n\\t\\t\\t\\tbetter than the merits of the doer. An evil deed may be\\n\\t\\t\\t\\tforgiven by repentance, but in any case will not be\\n\\t\\t\\t\\tpunished with a severer penalty than justice demands."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "85",
    "NoteID": "3415",
    "Body": "That is: order in His wisdom and mercy that the Qur-an\\n\\t\\t\\t\\tshould be revealed, containing guidance for conduct in\\n\\t\\t\\t\\tthis life and the next, and further ordered that it\\n\\t\\t\\t\\tshould be read out and taught and its principles observed\\n\\t\\t\\t\\tin practice. It is because of this teaching and preaching\\n\\t\\t\\t\\tthat the holy Prophet was persecuted, but as Allah sent\\n\\t\\t\\t\\tthe Qur-an, He will see that those who follow it will not\\n\\t\\t\\t\\teventually suffer, but be restored to happiness in the\\n\\t\\t\\t\\tPlace of Return, for which see next note."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "85",
    "NoteID": "3416",
    "Body": "Place of Return: (1) a title of Makkah; (2) the occasion\\n\\t\\t\\t\\twhen we shall be restored to the Presence of our Lord. It\\n\\t\\t\\t\\tis said that this verse was revealed at Juhfa, on the\\n\\t\\t\\t\\troad from Makkah to Madinah, a short distance from Makkah\\n\\t\\t\\t\\ton the Hijrat journey. The Prophet was sad at heart, and\\n\\t\\t\\t\\tthis was given as consolation to him. If this was the\\n\\t\\t\\t\\tparticular occasion, the general meaning would refer the\\n\\t\\t\\t\\tPlace of Return to the occasion of the Resurrection, when\\n\\t\\t\\t\\tall true values will be restored, however they may be\\n\\t\\t\\t\\tdisturbed by the temporary interference of evil in this\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "86",
    "NoteID": "3418",
    "Body": "Revelation and the preaching of Truth may in the\\n\\t\\t\\t\\tbeginning bring persecution, conflict, and sorrow in its\\n\\t\\t\\t\\ttrain; but in reality it is the truest mercy from Allah,\\n\\t\\t\\t\\twhich comes even without our expecting it, as it came to\\n\\t\\t\\t\\tthe Prophets without their consciously asking for it.\\n\\t\\t\\t\\tThis is proved in the history of Moses related in this\\n\\t\\t\\t\\tSura, and the history of the holy Prophet which it is\\n\\t\\t\\t\\tmeant to illustrate."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "86",
    "NoteID": "3419",
    "Body": "If Allah's Message is unpalatable to evil and is rejected\\n\\t\\t\\t\\tby it, those who accept it may (in their natural human\\n\\t\\t\\t\\tfeelings) sometimes wonder that such should be the case,\\n\\t\\t\\t\\tand whether it is really Allah's Will that the conflict\\n\\t\\t\\t\\twhich ensues should be pursued. Any such hesitation would\\n\\t\\t\\t\\tlend unconscious support to the aggressions of evil and\\n\\t\\t\\t\\tshould be discarded. The servant of Allah stands forth\\n\\t\\t\\t\\tboldly as His Mujahid (fighter of the good fight), daring\\n\\t\\t\\t\\tall, and knowing that Allah is behind him."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "87",
    "NoteID": "3420",
    "Body": "The soldier of Allah, having taken up the fight against\\n\\t\\t\\t\\tevil, and knowing that he is in touch with the true\\n\\t\\t\\t\\tLight, never yields an inch of ground. He is always to\\n\\t\\t\\t\\tthe fore in inviting others to his own ranks, but he\\n\\t\\t\\t\\thimself refuses to be with those who worship anything\\n\\t\\t\\t\\telse but Allah."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "88",
    "NoteID": "3421",
    "Body": "This sums up the lesson of the whole Sura. The only\\n\\t\\t\\t\\tEternal Reality is Allah. The whole phenomenal world is\\n\\t\\t\\t\\tsubject to flux and change and will pass away, but He\\n\\t\\t\\t\\twill endure for ever."
  },
  {
    "SurahNumber": "28",
    "AyahNumber": "85",
    "NoteID": "3617",
    "Body": "Allah's greatness and infinitude are such that He can\\n\\t\\t\\t\\tcreate and cherish not only a whole mass, but each\\n\\t\\t\\t\\tindividual soul, and He can follow its history and doings\\n\\t\\t\\t\\tuntil the final Judgment. This shows not only Allah's\\n\\t\\t\\t\\tglory and Omniscience and Omnipotence: it also shows the\\n\\t\\t\\t\\tvalue of each individual soul in His eyes, and lifts\\n\\t\\t\\t\\tindividual responsibility right up into relations with\\n\\t\\t\\t\\tHim."
  }
]
