[
  {
    "SurahNumber": "16",
    "AyahNumber": "1",
    "Text": "Allah's commandment has come, so do not seek to hurry it on.\\n\\t\\t\\tGlory be to Him and Exalted be He above the shirk (associating\\n\\t\\t\\tother gods with Allah) that they practice!"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "2",
    "Text": "He sends down His angels with inspiration of His Command to whom\\n\\t\\t\\tHe pleases of His servants, saying: \"Warn the people that there\\n\\t\\t\\tis no one else worthy of worship except Me, therefore fear Me.\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "3",
    "Text": "He has created the heavens and the earth to manifest the Truth;\\n\\t\\t\\tExalted be He above the shirk that they practice."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "4",
    "Text": "He created man from a drop of semen, yet he is an open contender."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "5",
    "Text": "He created cattle, which provide you clothing, food, and other\\n\\t\\t\\tbenefits."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "6",
    "Text": "How pleasant they look to you when you bring them home in the\\n\\t\\t\\tevening and drive them to pasture in the morning."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "7",
    "Text": "They carry your heavy loads to far-off towns that you could not\\n\\t\\t\\totherwise reach without painful toil; indeed your Rabb is Kind\\n\\t\\t\\tand Merciful."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "8",
    "Text": "He has also created horses, mules, and donkeys for you to ride\\n\\t\\t\\tand put on show, and He has created other things which are beyond\\n\\t\\t\\tyour knowledge."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "9",
    "Text": "It is up to Allah to show the Right Way, when there exist some\\n\\t\\t\\tcrooked ways. If Allah wanted He could have guided you all."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "10",
    "Text": "It is He Who sends down water from the sky, which provides\\n\\t\\t\\tdrinking water for you and brings forth fodder to pasture your\\n\\t\\t\\tcattle."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "11",
    "Text": "With it He grows for you crops, olives, date-palms, grapes, and\\n\\t\\t\\tevery kind of fruit: surely there is a great sign in this for\\n\\t\\t\\tthose who think."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "12",
    "Text": "He has subjected to your service the night and the day, the sun\\n\\t\\t\\tand the moon: and likewise the stars also serve you by His\\n\\t\\t\\tcommand: surely there are signs in this for people who use their\\n\\t\\t\\tcommon sense."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "13",
    "Text": "In the Earth He has created things of different colors: surely\\n\\t\\t\\tthere is a sign in this for those who want to learn a lesson."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "14",
    "Text": "It is He Who has subjected the sea to your service, that you may\\n\\t\\t\\teat fresh meat therefrom and that you may bring out of it\\n\\t\\t\\tornaments to wear; and you see that ships plough their course\\n\\t\\t\\tthrough it. He has done all this so that you may seek His bounty\\n\\t\\t\\tand so that you may pay thanks to Him."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "15",
    "Text": "He has set mountains on the earth - lest it should move away with\\n\\t\\t\\tyou. He also made rivers and roads so that you may find your way;"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "16",
    "Text": "and likewise made landmarks and the stars for your guidance."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "17",
    "Text": "Is then, He, Who has created all this, like one who cannot\\n\\t\\t\\tcreate? Why don't you understand?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "18",
    "Text": "If you want to count the favors of Allah, you will never be able\\n\\t\\t\\tto number them; surely Allah is Forgiving, Merciful,"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "19",
    "Text": "and Allah knows what you conceal and what you reveal."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "20",
    "Text": "Those whom they invoke besides Allah have created nothing, but\\n\\t\\t\\tare themselves created."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "21",
    "Text": "They are dead, not living; they do not even know when they will\\n\\t\\t\\tbe raised to life again."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "22",
    "Text": "Your God is One God; as for those who do not believe in the\\n\\t\\t\\thereafter, they have faithless hearts and are puffed up with\\n\\t\\t\\tarrogance."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "23",
    "Text": "Allah surely knows what they conceal and what they reveal;\\n\\t\\t\\tcertainly He does not love the arrogant."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "24",
    "Text": "When they are asked: \"What is it, that your Rabb has revealed?\"\\n\\t\\t\\tThey say: \"Fictitious stories of the ancients!\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "25",
    "Text": "Let them bear their own burden in full and that of those whom\\n\\t\\t\\tthey have misled in their ignorance. Alas! Evil is the\\n\\t\\t\\tresponsibility they are taking."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "26",
    "Text": "Those before them also plotted against the Truth, but Allah shook\\n\\t\\t\\ttheir edifice through its foundation, and its roof caved in on\\n\\t\\t\\tthem; and the torment came at them from where they did not even\\n\\t\\t\\tsuspect."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "27",
    "Text": "Then on the Day of Judgment He will humiliate them and say:\\n\\t\\t\\t\"Where are those deities you associated with Me concerning whom\\n\\t\\t\\tyou used to dispute with the true believers?\" Those who have been\\n\\t\\t\\tgiven knowledge will say: \"Today there will be shame and sorrow\\n\\t\\t\\tfor the unbelievers,\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "28",
    "Text": "- those whom the angels cause to die while they were still\\n\\t\\t\\tengaged in doing injustice to their own souls. At the time of\\n\\t\\t\\tdeath they offer submission, saying: \"We were not doing anything\\n\\t\\t\\twrong.\" The angels will reply: \"O Yea! How dare you deny!\\n\\t\\t\\tCertainly Allah is aware of what you were doing."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "29",
    "Text": "Now go ahead and enter the gates of Hell, there you will abide\\n\\t\\t\\tforever.\" In fact, very awful will be the abode of the arrogant."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "30",
    "Text": "On the other hand when the righteous people are asked: \" What is\\n\\t\\t\\tit that your Rabb has revealed?\" They say: \"That which is the\\n\\t\\t\\tbest.\" Good is the reward for such righteous people in this world\\n\\t\\t\\tand the home of the hereafter will be even better. How splendid\\n\\t\\t\\twill be the home for the righteous"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "31",
    "Text": "- Gardens of Eden will they enter, beneath which rivers flow,\\n\\t\\t\\thaving therein all that they wish to have. Thus shall Allah\\n\\t\\t\\treward the righteous,"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "32",
    "Text": "- such pious people the angels cause to die, saying: \"Peace be\\n\\t\\t\\tupon you! Enter the paradise because of the good deeds you have\\n\\t\\t\\tdone.\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "33",
    "Text": "Are these unbelievers waiting for the angels to come down to take\\n\\t\\t\\ttheir lives or the commandment of your Rabb to come to pass for\\n\\t\\t\\ttheir doom? So did those who went before them. It was not Allah\\n\\t\\t\\twho was unjust to them, but they were unjust to themselves."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "34",
    "Text": "At the end, the evil results of their deeds overtook them, and\\n\\t\\t\\tthe very scourge at which they mocked, hemmed them in."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "35",
    "Text": "The mushrikin say: \"If Allah wanted, neither we nor our\\n\\t\\t\\tforefathers would have worshipped any one else but Him, nor made\\n\\t\\t\\tanything unlawful without His will.\" Such excuses were put\\n\\t\\t\\tforward also by those who went before them. Yet Rasools have no\\n\\t\\t\\tmore responsibility than to convey the Message clearly."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "36",
    "Text": "No doubt We raised in every nation a Rasool, saying: \"Serve Allah\\n\\t\\t\\tand keep away from Taghut (Satanic forces).\" After that, Allah\\n\\t\\t\\tguided some of them while deviation proved true against the\\n\\t\\t\\tothers. So travel through the earth and see what was the end of\\n\\t\\t\\tthose who denied Our Message."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "37",
    "Text": "No matter how eager you may be for their guidance, you should\\n\\t\\t\\tknow that Allah does not guide those whom He let go astray and\\n\\t\\t\\tsuch people will have no helpers."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "38",
    "Text": "They solemnly swear their strongest oaths by Allah: \"Allah will\\n\\t\\t\\tnever raise the dead to life.\" Why not? It is a promise which He\\n\\t\\t\\thas made binding on Himself, though most among mankind may not\\n\\t\\t\\tknow it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "39",
    "Text": "It will be fulfilled so that He may manifest to them the Truth\\n\\t\\t\\tabout which they differ, and so that the rejecters of Truth may\\n\\t\\t\\tknow that they were indeed liars."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "40",
    "Text": "As for its possibility, when We intend to do anything which We\\n\\t\\t\\twant, We need only say, \"Be,\" and it is."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "41",
    "Text": "For those who migrated for the sake of Allah after persecution,\\n\\t\\t\\tWe will certainly provide them a good abode in this life and the\\n\\t\\t\\treward of the hereafter will be much greater, if they but knew\\n\\t\\t\\twhat a happy end awaits"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "42",
    "Text": "those who bear ills with patience and put their trust in their\\n\\t\\t\\tRabb."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "43",
    "Text": "The Rasools We sent before you, O Muhammad, and to whom We\\n\\t\\t\\trevealed Our Message, were also human beings. You (O people of\\n\\t\\t\\tMakkah), may ask those who have the Reminder (The people of the\\n\\t\\t\\tBook), if you don't know this fact yourself."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "44",
    "Text": "We sent those Rasools with clear signs and scriptures; and now We\\n\\t\\t\\thave sent down the reminder to you (O Muhammad), so that you may\\n\\t\\t\\texplain clearly to mankind as to what was sent to them so that\\n\\t\\t\\tthey may think about it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "45",
    "Text": "Do those who plot evil deeds feel secure that Allah will not cave\\n\\t\\t\\tin the earth beneath them or that the scourge will not come to\\n\\t\\t\\tthem from directions that they did not suspect?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "46",
    "Text": "Or that He may not seize them in the course of their journey\\n\\t\\t\\tleaving no way for their escape?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "47",
    "Text": "Or that He may seize them after alerting them about the danger?\\n\\t\\t\\tYet your Rabb is Beneficent, Merciful."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "48",
    "Text": "Do they not see how every object that Allah has created casts its\\n\\t\\t\\tshadow right and left, prostrating itself to Allah in all\\n\\t\\t\\thumility?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "49",
    "Text": "To Allah prostrate all the creatures of the heavens and the\\n\\t\\t\\tearth, including the angels; and they are not arrogant:"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "50",
    "Text": "they fear their Rabb Who is above them, and they do whatever they\\n\\t\\t\\tare commanded to do."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "51",
    "Text": "Allah has commanded: \"You shall not worship two gods: there\\n\\t\\t\\texists only One God, I am the One Whom you should fear.\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "52",
    "Text": "To Him belongs whatever is in the heavens and the earth and His\\n\\t\\t\\tDeen (laws or ways of life) is followed in the universe - would\\n\\t\\t\\tyou then fear any one other than Allah?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "53",
    "Text": "Whatever blessings you enjoy are from Allah, and when touched by\\n\\t\\t\\tdistress, He is the One to Whom you cry for help."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "54",
    "Text": "Yet no sooner does He relieve you from the distress than some of\\n\\t\\t\\tyou begin to associate others with Him,"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "55",
    "Text": "as if to show their ingratitude for the favors that We bestow on\\n\\t\\t\\tthem! Enjoy yourselves; soon you will come to know the\\n\\t\\t\\tconsequences."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "56",
    "Text": "They set aside a portion of what We have provided them with, for\\n\\t\\t\\tthose deities about whom they know nothing. By Allah! You shall\\n\\t\\t\\tmost certainly be questioned about the lies you fabricate."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "57",
    "Text": "They ascribe daughters to Allah - Glory be to Him! - But for\\n\\t\\t\\tthemselves, they would like to have what they desire (sons)."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "58",
    "Text": "Whenever the news of a female child is announced to any one of\\n\\t\\t\\tthem, his face darkens and he chokes with inward gloom."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "59",
    "Text": "He hides himself from his people because of the bad news he has\\n\\t\\t\\theard, asking himself whether he should retain her with disgrace\\n\\t\\t\\tor bury her in the dust. Beware! Evil is the judgement they make\\n\\t\\t\\tabout Allah."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "60",
    "Text": "Those who do not believe in the hereafter set an evil example,\\n\\t\\t\\twhile Allah applies the highest example, for He is the Mighty,\\n\\t\\t\\tthe Wise."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "61",
    "Text": "If Allah were to punish mankind for its wrongdoing, He would not\\n\\t\\t\\tleave even an animal around the wrongdoers, but He gives them\\n\\t\\t\\trespite for an appointed time. But when their appointed time\\n\\t\\t\\tcomes, they can neither stay behind for a moment nor can they go\\n\\t\\t\\tbefore it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "62",
    "Text": "They attribute to Allah what they themselves hate. Their tongues\\n\\t\\t\\tmouth the lie that they will have a good reward. Let there be no\\n\\t\\t\\tdoubt: the only thing they will have is hell, and they will be\\n\\t\\t\\tsent ahead of the others."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "63",
    "Text": "By Allah! We sent Rasools before you (O Muhammad) to other\\n\\t\\t\\tnations; but shaitan made their deeds seem fair to them so they\\n\\t\\t\\tdid not believe, he is their patron today, and they shall have a\\n\\t\\t\\tpainful punishment."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "64",
    "Text": "We have revealed to you the Book (The Qur'an) so that you may\\n\\t\\t\\tclearly explain to them the reality of those things in which they\\n\\t\\t\\tdiffer - it is a guidance and blessing for those people who\\n\\t\\t\\tbelieve."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "65",
    "Text": "Allah sends down water from the sky, and with it gives life to\\n\\t\\t\\tthe land after it has been dead (this Qur'an is being sent to\\n\\t\\t\\tserve the same purpose). Surely in this example there is a sign\\n\\t\\t\\tfor those who listen."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "66",
    "Text": "Surely there is a lesson for you in cattle. We give you to drink\\n\\t\\t\\tof what is in their bellies, between bowels and blood - pure milk\\n\\t\\t\\t- pleasant for those who drink it."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "67",
    "Text": "Likewise in the fruits of the date-palm and the grapes, from\\n\\t\\t\\twhich you derive intoxicants and wholesome food, certainly there\\n\\t\\t\\tis a sign for those people who use their common sense."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "68",
    "Text": "Behold! Your Rabb inspired the bees to build their hives in the\\n\\t\\t\\tmountains, in the trees, and in anything which men may build for\\n\\t\\t\\tbeekeeping,"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "69",
    "Text": "and feed on every kind of fruit and follow the smooth ways of\\n\\t\\t\\tyour Rabb. From its belly comes forth a syrup of different\\n\\t\\t\\tcolors, which contains a healing for mankind. Certainly in this\\n\\t\\t\\tthere is a sign for those who think."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "70",
    "Text": "Allah is the One Who created you, then He causes you to die;\\n\\t\\t\\tthere are some amongst you whose lives are prolonged to an abject\\n\\t\\t\\told age so that they know nothing after having known much. In\\n\\t\\t\\tfact Allah is the All-Knowing , Almighty."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "71",
    "Text": "Allah has made some of you excel in sustenance over the others;\\n\\t\\t\\tthose who are so favored, do not give away their sustenance to\\n\\t\\t\\ttheir slaves so as to make them their equals. How can you think\\n\\t\\t\\tthat Allah will allow other deities to be His equals? Would they\\n\\t\\t\\trefuse to acknowledge the favors of Allah?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "72",
    "Text": "It is Allah Who has made for you mates from your own species and\\n\\t\\t\\tHe is the One Who gives you sons and grandsons through those\\n\\t\\t\\twives, and provides for you good things to eat: will they then,\\n\\t\\t\\tafter knowing all that, believe that falsehood and disbelieve\\n\\t\\t\\tAllah's favors?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "73",
    "Text": "They worship those deities other than Allah, who neither provide\\n\\t\\t\\tthem anything for sustenance from the heavens or the earth, nor\\n\\t\\t\\thave any power to do so?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "74",
    "Text": "Therefore, compare none with Allah. Surely Allah knows and you do\\n\\t\\t\\tnot know."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "75",
    "Text": "Allah gives you another example of two men: one of them is a\\n\\t\\t\\tslave, the property of the other, and has no power over anything;\\n\\t\\t\\tand the other man is one on whom We have bestowed Our bounty,\\n\\t\\t\\tfrom which he freely spends secretly and openly. Ask them: \"Are\\n\\t\\t\\tthose two men equal?\" Praise be to Allah - most of them do not\\n\\t\\t\\tunderstand this simple thing."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "76",
    "Text": "Well! Allah gives you another example of two men: one of them is\\n\\t\\t\\tdumb and has no ability do anything - a burden on his master -\\n\\t\\t\\twhenever he sends him on an errand, he does nothing useful. Can\\n\\t\\t\\the be equal to the one who executes orders properly and follows\\n\\t\\t\\tthe directions in a Right Way?"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "77",
    "Text": "Allah Alone has knowledge of the unseen things of the Heavens and\\n\\t\\t\\tthe Earth. As for the taking place of the Hour of Judgment, it\\n\\t\\t\\twill be like a twinkling of an eye or even quicker: surely Allah\\n\\t\\t\\thas power over everything."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "78",
    "Text": "Allah brought you forth from the wombs of your mothers when you\\n\\t\\t\\tknew nothing, and He gave you hearing, sight and intelligence so\\n\\t\\t\\tthat you may give thanks to Him."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "79",
    "Text": "Do they not see the birds, that wing their flight in the air\\n\\t\\t\\ttowards the sky? Who holds them up but Allah? Surely in this\\n\\t\\t\\tthere are signs for the true believers."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "80",
    "Text": "Allah has made your homes the place for your rest, and animal\\n\\t\\t\\tskins for tents like houses so that you may find them light when\\n\\t\\t\\tyou travel and easy to pitch when you stop; while from their\\n\\t\\t\\twool, fur, and hair He provides you household items and articles\\n\\t\\t\\tof convenience for your prescribed term of life."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "81",
    "Text": "Allah has provided you shades from the sun out of what He has\\n\\t\\t\\tcreated. He has granted you resorts in the mountains, has granted\\n\\t\\t\\tyou garments to protect yourselves from heat; and coats of armor\\n\\t\\t\\tto protect you during your wars. Thus He completes his favors to\\n\\t\\t\\tyou, so that you may become Muslims."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "82",
    "Text": "If they still give no heed to you O Muhammad, you need not worry,\\n\\t\\t\\tfor your duty is only to convey the message clearly."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "83",
    "Text": "They recognize the favors of Allah, yet they deny them; most of\\n\\t\\t\\tthem are ungrateful disbelievers."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "84",
    "Text": "Do they realize what will happen on that Day when We shall call a\\n\\t\\t\\twitness from every nation? Then the unbelievers will neither be\\n\\t\\t\\tallowed to put forward any excuse nor will they receive any\\n\\t\\t\\tfavor."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "85",
    "Text": "When the wrongdoers face the punishment, it will neither be\\n\\t\\t\\tlightened for them nor will they be granted a delay."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "86",
    "Text": "When the mushrikin see their deities whom they associated with\\n\\t\\t\\tAllah, they will say: \"Our Rabb! Here are our 'associate gods'\\n\\t\\t\\twhom we used to invoke besides You.\" At this their deities will\\n\\t\\t\\ttoss their statement back at them saying: \"You are liars!\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "87",
    "Text": "They shall tender their submission to Allah that Day: and the\\n\\t\\t\\tgods of their own inventions will leave them in the lurch."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "88",
    "Text": "As for those who disbelieve and debar others from the Way of\\n\\t\\t\\tAllah, We shall punish them all the more for their misdeeds."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "89",
    "Text": "O Muhammad, warn them about that Day when We shall call a witness\\n\\t\\t\\tfrom every nation to testify against it, and We shall call you O\\n\\t\\t\\tMuhammad to testify against your people: that is why We have sent\\n\\t\\t\\tdown to you this Book (The Qur'an) to explain everything - a\\n\\t\\t\\tguide, a blessing and good news for Muslims."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "90",
    "Text": "Allah commands doing justice, doing good to others, and giving to\\n\\t\\t\\tnear relatives, and He forbids indecency, wickedness, and\\n\\t\\t\\trebellion: He admonishes you so that you may take heed."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "91",
    "Text": "Fulfill the covenant of Allah when you have pledged to do so, and\\n\\t\\t\\tdo not break your oaths after you have sworn them; for swearing\\n\\t\\t\\tin His name you have made Allah your surety; surely Allah has\\n\\t\\t\\tknowledge of all your actions."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "92",
    "Text": "Do not behave like that woman who had spun her yarn strongly and\\n\\t\\t\\tthen had herself broken it into pieces; nor take your oaths for\\n\\t\\t\\tmutual deceit so that one people may take undue advantage over\\n\\t\\t\\tthe other, for Allah puts you to trial by these oaths; and on the\\n\\t\\t\\tDay of Judgment He will certainly reveal to you the truth about\\n\\t\\t\\twhich you differed."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "93",
    "Text": "If Allah wanted, He could have made you all one nation, but He\\n\\t\\t\\tlets go astray whom He wants and guides whom He pleases: but most\\n\\t\\t\\tcertainly you will be questioned about all your actions."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "94",
    "Text": "O believers! Do not take oaths to deceive each other, lest your\\n\\t\\t\\tfoot slip after being firmly fixed upon guidance; and taste the\\n\\t\\t\\tevil consequences for debarring others from the Way of Allah and\\n\\t\\t\\tincur a mighty punishment."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "95",
    "Text": "Do not sell the covenant of Allah for a petty price. Certainly\\n\\t\\t\\tAllah's reward is far better than all your gain, if you but knew\\n\\t\\t\\tit."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "96",
    "Text": "Whatever is with you is transitory and what is with Allah is\\n\\t\\t\\teverlasting. We will certainly reward those who are patient\\n\\t\\t\\taccording to the noblest of their deeds."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "97",
    "Text": "Whoever does righteous deeds, whether male or female, provided he\\n\\t\\t\\tis a believer, We shall surely grant him a new life, a life that\\n\\t\\t\\tis good, and We will certainly reward such people according to\\n\\t\\t\\tthe noblest of their deeds in the hereafter."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "98",
    "Text": "When you recite The Qur'an, seek Allah's protection from the\\n\\t\\t\\taccursed Shaitan,"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "99",
    "Text": "surely he has no authority over those who believe and put their\\n\\t\\t\\ttrust in their Rabb."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "100",
    "Text": "His authority is only over those who befriend him and commit\\n\\t\\t\\tshirk by his temptation."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "101",
    "Text": "When We substitute one verse in favor of another to elaborate\\n\\t\\t\\twith different examples - and Allah knows best what He reveals in\\n\\t\\t\\tstages - they say: \"You are but a forger.\" The fact is that most\\n\\t\\t\\tof them do not understand."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "102",
    "Text": "Say, \"The Holy Spirit (Gabriel) has brought it down piecemeal\\n\\t\\t\\tintact from your Rabb to strengthen the faith of the believers,\\n\\t\\t\\tand to give guidance and good news to the Muslims.\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "103",
    "Text": "We know very well what they say about you, O Muhammad: \"A certain\\n\\t\\t\\tman teaches him.\" But the man they allude to speaks a foreign\\n\\t\\t\\tlanguage while this (The Qur'an) is in eloquent Arabic."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "104",
    "Text": "In fact, Allah does not show guidance to those who do not believe\\n\\t\\t\\tin His revelations and they will have a painful punishment."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "105",
    "Text": "Surely those who do not believe in the revelations of Allah, are\\n\\t\\t\\tthe ones who forge the falsehood and they are the ones who are\\n\\t\\t\\tliars!"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "106",
    "Text": "Anyone who is forced to deny faith after its acceptance, while\\n\\t\\t\\this heart remains loyal to the faith shall be absolved; but any\\n\\t\\t\\twho denies faith willingly after its acceptance and open his\\n\\t\\t\\tbreast to unbelief, shall incur the wrath of Allah and shall be\\n\\t\\t\\tsternly punished."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "107",
    "Text": "This is because such people love the life of this world more than\\n\\t\\t\\tthe hereafter, and that Allah does not guide those who knowingly\\n\\t\\t\\treject faith."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "108",
    "Text": "Such are those whose hearts, ears and eyes are sealed by Allah;\\n\\t\\t\\tand they are the ones who are heedless."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "109",
    "Text": "There is no doubt that in the hereafter they will be the losers."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "110",
    "Text": "On the other hand, Allah is most surely forgiving and\\n\\t\\t\\tcompassionate towards those who had to leave their homes after\\n\\t\\t\\tbeing persecuted because of their faith, struggled hard and\\n\\t\\t\\tremained steadfastly patient."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "111",
    "Text": "On the Day of Judgement every soul will come pleading for itself\\n\\t\\t\\tand every soul will be paid in full for what it has done, and\\n\\t\\t\\tthey shall not be dealt with unjustly."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "112",
    "Text": "Allah gives you an example of a town which was enjoying security\\n\\t\\t\\tand peace, receiving its provisions in abundance from every\\n\\t\\t\\tquarter, but it became ungrateful to the favors of Allah. As a\\n\\t\\t\\tresult, Allah made its residents taste the consequences of their\\n\\t\\t\\tdoings, through inflicting upon them misfortunes of hunger and\\n\\t\\t\\tfear."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "113",
    "Text": "A Rasool was sent to them from among themselves, but they denied\\n\\t\\t\\thim; so the punishment overtook them because they were\\n\\t\\t\\twrongdoers."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "114",
    "Text": "So eat of the good and lawful things which Allah has provided for\\n\\t\\t\\tyou; and be grateful to Allah for His favors, if you are sincere\\n\\t\\t\\tin His worship."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "115",
    "Text": "He has only forbidden you to eat carrion (meat of dead a body),\\n\\t\\t\\tblood, pork, and that over which any name other than Allah has\\n\\t\\t\\tbeen invoked. But if one is forced by necessity, intending\\n\\t\\t\\tneither to break the Divine Law nor to transgress limits, then\\n\\t\\t\\tsurely Allah is Forgiving, Merciful."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "116",
    "Text": "You shall not falsely declare with your tongues: \"This is lawful,\\n\\t\\t\\tand that is forbidden,\" in order to ascribe false things to\\n\\t\\t\\tAllah, for those who forge lies against Allah will never prosper."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "117",
    "Text": "Brief is their enjoyment of this life, and they shall have a\\n\\t\\t\\tpainful punishment."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "118",
    "Text": "To the Jews, We prohibited those things which We have already\\n\\t\\t\\tmentioned to you, and it was not We Who imposed the hardships on\\n\\t\\t\\tthem but they imposed those hardships on themselves."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "119",
    "Text": "Yet your Rabb is forgiving and merciful towards those who do\\n\\t\\t\\tsomething wrong through ignorance, but later repent and mend\\n\\t\\t\\ttheir ways."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "120",
    "Text": "In fact Ibrahim (Abraham) was a nation in himself, an upright man\\n\\t\\t\\tobedient to Allah, and he was not of the mushrikin."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "121",
    "Text": "He was always grateful for the favors of Allah, Who chose him and\\n\\t\\t\\tguided him to a Right Way."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "122",
    "Text": "We gave him a good life in this world, and in the hereafter he\\n\\t\\t\\twill be among the righteous."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "123",
    "Text": "And now We have revealed to you Our will, saying: \"Follow the\\n\\t\\t\\tfaith of Ibrahim the upright, he was not of the mushrikin.\""
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "124",
    "Text": "As for the Sabbath, it was ordained for those who differed about\\n\\t\\t\\tits observance. Surely your Rabb will judge between them on the\\n\\t\\t\\tDay of Judgment about that over which they differ."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "125",
    "Text": "Call people to the Way of your Rabb with wisdom and best advice,\\n\\t\\t\\tand reason with them, if you have to, in the most courteous\\n\\t\\t\\tmanner: for your Rabb knows best who strays from His Way and He\\n\\t\\t\\tknows best who is rightly guided."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "126",
    "Text": "If you have to retaliate, let your retaliation be commensurate\\n\\t\\t\\twith the wrong which was done to you; but if you endure with\\n\\t\\t\\tpatience, the best reward indeed is for those who endure with\\n\\t\\t\\tpatience."
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "127",
    "Text": "Be patient - for your patience is not but with the help of Allah\\n\\t\\t\\t- do not grieve over them and do not distress yourself because of\\n\\t\\t\\ttheir plots,"
  },
  {
    "SurahNumber": "16",
    "AyahNumber": "128",
    "Text": "for Allah is with those who fear Him and adopt the righteous\\n\\t\\t\\tattitude."
  }
]
