[
  {
    "SurahNumber": "82",
    "AyahNumber": "1",
    "NoteID": "5997",
    "Body": "Cf. the passage lxxxi. 1-14 and notes. For the three\\n\\t\\t\\t\\tparallel interpretations, see the Introduction to the\\n\\t\\t\\t\\tSura. There are four conditional clauses here, and the\\n\\t\\t\\t\\tsubstantive clause is in verse 5. In S. lxxxi, there were\\n\\t\\t\\t\\t12 conditional clauses, and the conclusion was, similar,\\n\\t\\t\\t\\tbut not expressed in precisely the same terms. See lxxii.\\n\\t\\t\\t\\t5. n. 6002 below. The physical world as we see it now\\n\\t\\t\\t\\twill be destroyed before the final Day of Judgment,\\n\\t\\t\\t\\testablishing the true Reality. In the following four\\n\\t\\t\\t\\tclauses we have a reference to the Lesser Judgment, the\\n\\t\\t\\t\\tindividual dawn of the true Reality at Death."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "1",
    "NoteID": "5998",
    "Body": "Cf. lxxiii. 18, n. 5769. The beautiful blue sky overhead,\\n\\t\\t\\t\\twhich we take for granted in sunshine and storm, will be\\n\\t\\t\\t\\tshattered to pieces before the New World is established.\\n\\t\\t\\t\\tThe partition which seems at present to divide things\\n\\t\\t\\t\\tdivine from this phenomenal world has to be shattered\\n\\t\\t\\t\\tbefore each soul knows the reality about itself."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "2",
    "NoteID": "5999",
    "Body": "Cf. lxxxi. 2, where the word for \"stars\" (Nujum) is\\n\\t\\t\\t\\tdifferent, and the verb is different. Najm has reference\\n\\t\\t\\t\\tto brightness, and the verb 'losing their lustre\" was\\n\\t\\t\\t\\tappropriate there, to show the opposite, Kaukab (used\\n\\t\\t\\t\\there) has more the meaning of a star as fixed in a\\n\\t\\t\\t\\tcostellation; and the opposite of a fixed and definite\\n\\t\\t\\t\\torder is \"scattered\", the verb used here. In fact,\\n\\t\\t\\t\\tthroughout this passage, the dominating idea is the\\n\\t\\t\\t\\tdistrubance of order and symmetry. The metaphor behind\\n\\t\\t\\t\\tthe scattering of the constellations is that in the\\n\\t\\t\\t\\tpresent order of things we see many things associated\\n\\t\\t\\t\\ttogether, e.g., rank with honour, wealth with comfort,\\n\\t\\t\\t\\tetc. In the New World this will be seen to have merely\\n\\t\\t\\t\\tfortuitous."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "3",
    "NoteID": "6000",
    "Body": "Cf. lxxxi. 6, \"when the oceans boil over with a swell\".\\n\\t\\t\\t\\tHere, \"are suffered to burst forth\" expresses the end of\\n\\t\\t\\t\\tthe present order of things. This may be in two ways, (1)\\n\\t\\t\\t\\tThe barrier which keeps within their respective bounds\\n\\t\\t\\t\\tthe various streams of salt and fresh water (lv. 20, n.\\n\\t\\t\\t\\t5185) will be removed; (2) the Ocean will overwhelm the\\n\\t\\t\\t\\twhole Globe."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "4",
    "NoteID": "6001",
    "Body": "This item is not mentioned in lxxxi. 1-14. Here it is\\n\\t\\t\\t\\tintroduced to show that the whole order of things will be\\n\\t\\t\\t\\tso reversed that even Death will not be Death. We think\\n\\t\\t\\t\\tthere is tranquillity in Death: but there will be no\\n\\t\\t\\t\\ttranquillity. Literally, and figuratively, Death will be\\n\\t\\t\\t\\tthe beginning of a new Life. What we think to be Death\\n\\t\\t\\t\\twill bring forth Life."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "5",
    "NoteID": "6002",
    "Body": "Sent Forward and kept back: may mean: the deeds of\\n\\t\\t\\t\\tcommission and omission in this life. Or the Arabic words\\n\\t\\t\\t\\tmay also be translated: sent forward and left behind:\\n\\t\\t\\t\\ti.e., the spiritual possibilities which it sent forward\\n\\t\\t\\t\\tfor its other life, and the physical things on which it\\n\\t\\t\\t\\tprided itself in this life, but which it had to leave\\n\\t\\t\\t\\tbehind in this fife. Or else, the things it put first and\\n\\t\\t\\t\\tthe things it put last in importance may change places in\\n\\t\\t\\t\\tthe new world of Reality. \"The first shall be last and\\n\\t\\t\\t\\tthe last shall be first\"."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "7",
    "NoteID": "6003",
    "Body": "Cf. xv. 29. Allah not only created man, but fashioned him\\n\\t\\t\\t\\tin due proportions, giving him extraordinary capacities,\\n\\t\\t\\t\\tand the means wherewith he can fulfil his high destiny."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "7",
    "NoteID": "6004",
    "Body": "See n. 834 to vi. 1. Having given a limited free-will, He\\n\\t\\t\\t\\tgave us a just bias through our reason and our spiritual\\n\\t\\t\\t\\tfaculties. If we err, it is our will that is at fault."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "8",
    "NoteID": "6005",
    "Body": "By \"Form\" (Surat) here I understand the general shape of\\n\\t\\t\\t\\tthings in which any given personality is placed,\\n\\t\\t\\t\\tincluding his physical and social environments, his gifts\\n\\t\\t\\t\\tof mind and spirit, and all that goes to make up his\\n\\t\\t\\t\\touter and inner life. The Grace of Allah is shown in all\\n\\t\\t\\t\\tthese things, for His Will is formed from perfect\\n\\t\\t\\t\\tknowledge, wisdom, and goodness."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "9",
    "NoteID": "6006",
    "Body": "The goodness and mercies of Allah, and His constant\\n\\t\\t\\t\\twatchful care of all His creatures should make men\\n\\t\\t\\t\\tgrateful, instead of which they turn away from the Right\\n\\t\\t\\t\\tand deny the Day of Sorting Out, the Day when every\\n\\t\\t\\t\\taction performed here will find its fulfilment in just\\n\\t\\t\\t\\treward or punishment."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "10",
    "NoteID": "6007",
    "Body": "Besides the faculties given to man to guide him, and the\\n\\t\\t\\t\\tForm and Personality through which he can rise by stages\\n\\t\\t\\t\\tto the Presence of Allah, there are spiritual agencies\\n\\t\\t\\t\\taround him to help and protect him, and to note down his\\n\\t\\t\\t\\tRecord, so that perfect justice may be done to him at the\\n\\t\\t\\t\\tend. For these Guardian Angels, see 1. 17-18, and n.\\n\\t\\t\\t\\t4954."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "15",
    "NoteID": "6008",
    "Body": "I understand this relative clause to govern \"the Fire\",\\n\\t\\t\\t\\ti.e., the Punishment. It will be postponed as long as\\n\\t\\t\\t\\tpossible, to give the Sinner every chance of repentance\\n\\t\\t\\t\\tand amendment. But once the period of probation is past,\\n\\t\\t\\t\\tit will be irrevocable. There will be no going back from\\n\\t\\t\\t\\tit. By inference, the Righteous may individually reach\\n\\t\\t\\t\\tsome stage of Bliss at once, possibly in this life,\\n\\t\\t\\t\\tpossibly after death, though the Final Judgment will be\\n\\t\\t\\t\\tthe general and complete cessation of this fleeting world\\n\\t\\t\\t\\tand the creation of the world of Eternity."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "18",
    "NoteID": "6009",
    "Body": "We can speak of Rewards and Punishments, the Fruits of\\n\\t\\t\\t\\tActions, the Resurrection and the Tribunal, the\\n\\t\\t\\t\\tRestoration of True Values, the Elimination of all Wrong,\\n\\t\\t\\t\\tand a hundred other phrases. They might serve to\\n\\t\\t\\t\\tintroduce our minds vaguely to a new World, of which they\\n\\t\\t\\t\\tcannot possibly form any adequate conception under\\n\\t\\t\\t\\tpresent conditions. The question is repeated in verses\\n\\t\\t\\t\\t17-18 to emphasize this difficulty, and a simple answer\\n\\t\\t\\t\\tis suggested, as explained in the next note."
  },
  {
    "SurahNumber": "82",
    "AyahNumber": "19",
    "NoteID": "6010",
    "Body": "The answer is suggested by a negative proposition: 'No\\n\\t\\t\\t\\tsoul shall have power to do aught for another'. This is\\n\\t\\t\\t\\tfull of meaning. Personal responsibility will be fully\\n\\t\\t\\t\\tenforced. In this world we all depend on one another\\n\\t\\t\\t\\tproximately, though our ultimate dependence is always on\\n\\t\\t\\t\\tAllah, now and for ever. But here a father helps a son\\n\\t\\t\\t\\tforward; husband and wife influence each other's\\n\\t\\t\\t\\tdestinies; human laws and institutions may hold large\\n\\t\\t\\t\\tmasses of mankind under their grip; falsehood and evil\\n\\t\\t\\t\\tmay seem to flourish for a time, because a certain amount\\n\\t\\t\\t\\tof limited free-will has been granted to man. This period\\n\\t\\t\\t\\twill be all over then. The good and the pure will have\\n\\t\\t\\t\\tbeen separated from the evil and the rebellious; the\\n\\t\\t\\t\\tlatter will have been rendered inert, and the former will\\n\\t\\t\\t\\thave been so perfected that their wills will be in\\n\\t\\t\\t\\tcomplete consonance with Allah's Universal Will. The\\n\\t\\t\\t\\tCommand, thence forward, will be wholly with Allah."
  }
]
