{
    "2788": {
        "bookNumber": 16,
        "hadithNumber": 2788,
        "enghadithText": "Narrated Mikhnaf ibn Sulaym: We were staying with the Messenger of Allah (ﷺ) at Arafat; he said: O people, every family must offer a sacrifice and an atirah. Do you know what the atirah is? It is what you call the Rajab sacrifice. Abu Dawud said: 'Atirah has been abrogated, and this tradition is an abrogated one",
        "gradeName": "Al-Albani",
        "gradeValue": "Hasan",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ، ح وَحَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا بِشْرٌ، عَنْ عَبْدِ اللَّهِ بْنِ عَوْنٍ، عَنْ عَامِرٍ أَبِي رَمْلَةَ، قَالَ أَخْبَرَنَا مِخْنَفُ بْنُ سُلَيْمٍ، قَالَ وَنَحْنُ وُقُوفٌ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِعَرَفَاتٍ قَالَ ‏ \"‏ يَا أَيُّهَا النَّاسُ إِنَّ عَلَى كُلِّ أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أُضْحِيَةً وَعَتِيرَةً أَتَدْرُونَ مَا الْعَتِيرَةُ هَذِهِ الَّتِي يَقُولُ النَّاسُ الرَّجَبِيَّةُ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ الْعَتِيرَةُ مَنْسُوخَةٌ هَذَا خَبَرٌ مَنْسُوخٌ ‏.‏"
    },
    "2789": {
        "bookNumber": 16,
        "hadithNumber": 2789,
        "enghadithText": "Narrated Abdullah ibn Amr ibn al-'As: The Prophet (ﷺ) said: I have been commanded to celebrate festival ('Id) on the day of sacrifice, which Allah, Most High, has appointed for this community. A man said: If I do not find except a she-goat or a she-camel borrowed for milk or other benefits, should I sacrifice it? He said: No, but you should clip your hair , and nails, trim your moustaches, and shave your pubes. This is all your sacrifice in the eyes of Allah, Most High",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْقِتْبَانِيُّ، عَنْ عِيسَى بْنِ هِلاَلٍ الصَّدَفِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏\"‏ أُمِرْتُ بِيَوْمِ الأَضْحَى عِيدًا جَعَلَهُ اللَّهُ عَزَّ وَجَلَّ لِهَذِهِ الأُمَّةِ ‏\"‏ ‏.‏ قَالَ الرَّجُلُ أَرَأَيْتَ إِنْ لَمْ أَجِدْ إِلاَّ أُضْحِيَةً أُنْثَى أَفَأُضَحِّي بِهَا قَالَ ‏\"‏ لاَ وَلَكِنْ تَأْخُذُ مِنْ شَعْرِكَ وَأَظْفَارِكَ وَتَقُصُّ شَارِبَكَ وَتَحْلِقُ عَانَتَكَ فَتِلْكَ تَمَامُ أُضْحِيَتِكَ عِنْدَ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏"
    },
    "2790": {
        "bookNumber": 16,
        "hadithNumber": 2790,
        "enghadithText": "Narrated Hanash: I saw Ali sacrificing two rams; so I asked him: What is this? He replied. The Messenger of Allah (ﷺ) enjoined upon me to sacrifice on his behalf, so that is what I am doing",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي الْحَسْنَاءِ، عَنِ الْحَكَمِ، عَنْ حَنَشٍ، قَالَ رَأَيْتُ عَلِيًّا يُضَحِّي بِكَبْشَيْنِ فَقُلْتُ مَا هَذَا فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَوْصَانِي أَنْ أُضَحِّيَ عَنْهُ فَأَنَا أُضَحِّي عَنْهُ ‏.‏"
    },
    "2791": {
        "bookNumber": 16,
        "hadithNumber": 2791,
        "enghadithText": "Narrated Umm Salamah: The Prophet (ﷺ) as saying: If anyone has sacrificial animal and intends to sacrifice it, and he sights the new moon of Dhul-Hajjah, he must not take any of his hair and nails until he sacrifices Abu Dawud said: The name of 'Amr b. Muslim in the chain narrated by Malik and Muhammad b. 'Amr is disputed. Some say that it is 'Umar and the majority holds that it is 'Amr. Abu Dawud said: He is 'Amr b. Muslim b. Ukaimah al-Laithi al-Jundu'i",
        "gradeName": "Al-Albani",
        "gradeValue": "Hasan Sahih",
        "arabhadithText": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنَا عَمْرُو بْنُ مُسْلِمٍ اللَّيْثِيُّ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ أُمَّ سَلَمَةَ، تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَ لَهُ ذِبْحٌ يَذْبَحُهُ فَإِذَا أَهَلَّ هِلاَلُ ذِي الْحِجَّةِ فَلاَ يَأْخُذَنَّ مِنْ شَعْرِهِ وَلاَ مِنْ أَظْفَارِهِ شَيْئًا حَتَّى يُضَحِّيَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ اخْتَلَفُوا عَلَى مَالِكٍ وَعَلَى مُحَمَّدِ بْنِ عَمْرٍو فِي عَمْرِو بْنِ مُسْلِمٍ قَالَ بَعْضُهُمْ عُمَرُ وَأَكْثَرُهُمْ قَالَ عَمْرٌو ‏.‏ قَالَ أَبُو دَاوُدَ وَهُوَ عَمْرُو بْنُ مُسْلِمِ بْنِ أُكَيْمَةَ اللَّيْثِيُّ الْجُنْدَعِيُّ ‏.‏"
    },
    "2792": {
        "bookNumber": 16,
        "hadithNumber": 2792,
        "enghadithText": "Narrated 'Aishah:The Prophet (Saws) ordered a horned ram with black legs, black belly and black round the eyes, and it was brought from him to sacrifice. He said: 'Aishah, get the knife then he said: Sharpen it with a stone. So I did. He took it, then take the ram he placed it on the ground and slaughtered it. He then said: In the name of Allah. O Allah, accept it for Muhammad, Muhammad's family and Muhammad's people. Then he sacrificed it",
        "gradeName": "Al-Albani",
        "gradeValue": "Hasan",
        "arabhadithText": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ، حَدَّثَنِي أَبُو صَخْرٍ، عَنِ ابْنِ قُسَيْطٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِكَبْشٍ أَقْرَنَ يَطَأُ فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ وَيَبْرُكُ فِي سَوَادٍ فَأُتِيَ بِهِ فَضَحَّى بِهِ فَقَالَ ‏\"‏ يَا عَائِشَةُ هَلُمِّي الْمُدْيَةَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ اشْحَذِيهَا بِحَجَرٍ ‏\"‏ ‏.‏ فَفَعَلَتْ فَأَخَذَهَا وَأَخَذَ الْكَبْشَ فَأَضْجَعَهُ وَذَبَحَهُ وَقَالَ ‏\"‏ بِسْمِ اللَّهِ اللَّهُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمِنْ أُمَّةِ مُحَمَّدٍ ‏\"‏ ‏.‏ ثُمَّ ضَحَّى بِهِ صلى الله عليه وسلم ‏.‏"
    },
    "2793": {
        "bookNumber": 16,
        "hadithNumber": 2793,
        "enghadithText": "Narrated Anas:The Prophet (ﷺ) sacrificed seven camels standing with his own hand, and sacrificed at Medina two horned rams which were white with black markings",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وُهَيْبٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَحَرَ سَبْعَ بَدَنَاتٍ بِيَدِهِ قِيَامًا وَضَحَّى بِالْمَدِينَةِ بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ ‏.‏"
    },
    "2794": {
        "bookNumber": 16,
        "hadithNumber": 2794,
        "enghadithText": "Narrated Anas:The Prophet (ﷺ) sacrificed two horned rams which were white with black markings, slaughtered, and uttered: \"Allah is Most Great.\" and mentioned Allah's name and placed his foot on their sides",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ضَحَّى بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ يَذْبَحُ وَيُكَبِّرُ وَيُسَمِّي وَيَضَعُ رِجْلَهُ عَلَى صَفْحَتِهِمَا ‏.‏"
    },
    "2795": {
        "bookNumber": 16,
        "hadithNumber": 2795,
        "enghadithText": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) sacrificed two horned rams which were white with black markings and had been castrated. When he made them face the qiblah, he said: I have turned my face towards Him. Who created the heavens and the earth, following Abraham's religion, the true in faith, and I am not one of the polytheists. My prayer, and my service of sacrifice, my life and my death are all for Allah, the Lord of the Universe, Who has no partner. That is what I was commanded to do, and I am one of the Muslims. O Allah it comes from Thee and is given to Thee from Muhammad and his people. In the name of Allah, and Allah is Most Great. He then made sacrifice",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، حَدَّثَنَا عِيسَى، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي عَيَّاشٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ ذَبَحَ النَّبِيُّ صلى الله عليه وسلم يَوْمَ الذَّبْحِ كَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ مُوجَأَيْنِ فَلَمَّا وَجَّهَهُمَا قَالَ ‏ \"‏ إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ عَلَى مِلَّةِ إِبْرَاهِيمَ حَنِيفًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ إِنَّ صَلاَتِي وَنُسُكِي وَمَحْيَاىَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لاَ شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ اللَّهُمَّ مِنْكَ وَلَكَ عَنْ مُحَمَّدٍ وَأُمَّتِهِ بِاسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ ‏\"‏ ‏.‏ ثُمَّ ذَبَحَ ‏.‏"
    },
    "2796": {
        "bookNumber": 16,
        "hadithNumber": 2796,
        "enghadithText": "Narrated AbuSa'id al-Khudri: The Messenger of Allah (ﷺ) used to sacrifice a choice, horned ram with black round the eyes, the mouth and the feet",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا حَفْصٌ، عَنْ جَعْفَرٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُضَحِّي بِكَبْشٍ أَقْرَنَ فَحِيلٍ يَنْظُرُ فِي سَوَادٍ وَيَأْكُلُ فِي سَوَادٍ وَيَمْشِي فِي سَوَادٍ ‏.‏"
    },
    "2797": {
        "bookNumber": 16,
        "hadithNumber": 2797,
        "enghadithText": "Narrated Jabir:The Messenger of Allah (ﷺ) as saying: Sacrifice only a full-grown animal unless it is difficult for you, in which case sacrifice a lamb",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَذْبَحُوا إِلاَّ مُسِنَّةً إِلاَّ أَنْ يَعْسُرَ عَلَيْكُمْ فَتَذْبَحُوا جَذَعَةً مِنَ الضَّأْنِ ‏\"‏ ‏.‏"
    },
    "2798": {
        "bookNumber": 16,
        "hadithNumber": 2798,
        "enghadithText": "Narrated Zayd ibn Khalid al-Juhani: The Messenger of Allah (ﷺ) distributed sacrificial animals among his Companions. He gave me a kid (of less than a year). I took it to him and said: This is a kid. He said: Sacrifice it. so I sacrificed it",
        "gradeName": "Al-Albani",
        "gradeValue": "Hasan Sahih",
        "arabhadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ صُدْرَانَ، حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، حَدَّثَنِي عُمَارَةُ بْنُ عَبْدِ اللَّهِ بْنِ طُعْمَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالَ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي أَصْحَابِهِ ضَحَايَا فَأَعْطَانِي عَتُودًا جَذَعًا - قَالَ - فَرَجَعْتُ بِهِ إِلَيْهِ فَقُلْتُ لَهُ إِنَّهُ جَذَعٌ ‏.‏ قَالَ ‏ \"‏ ضَحِّ بِهِ ‏\"‏ ‏.‏ فَضَحَّيْتُ بِهِ ‏.‏"
    },
    "2799": {
        "bookNumber": 16,
        "hadithNumber": 2799,
        "enghadithText": "Narrated 'Asim b. Kulaib: On the authority of his father: We were with a man from the Companions of the Prophet (ﷺ) called Mujashi' who belonged to Banu Sulaim. There was a scarcity if goats (in those days). He commanded a man to announce (among the people); so he announced that the Messenger of Allah (ﷺ) used to say: A lamb may be given as full payent for that for which has full-grown animal is payment. Abu Dawud said: His name is Mujashi' b. Mas'ud",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا الثَّوْرِيُّ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، قَالَ كُنَّا مَعَ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم يُقَالُ لَهُ مُجَاشِعٌ مِنْ بَنِي سُلَيْمٍ فَعَزَّتِ الْغَنَمُ فَأَمَرَ مُنَادِيًا فَنَادَى أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ ‏ \"‏ إِنَّ الْجَذَعَ يُوَفِّي مِمَّا يُوَفِّي مِنْهُ الثَّنِيُّ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَهُوَ مُجَاشِعُ بْنُ مَسْعُودٍ ‏.‏"
    },
    "2800": {
        "bookNumber": 16,
        "hadithNumber": 2800,
        "enghadithText": "Narrated Al-Bara' bin 'Azib:The Messenger of Allah (ﷺ) delivered a sermon to us on the day of sacrifice after the prayer. He said: If anyone prays like our prayer, and sacrifices like our sacrifice, his sacrifice is all right. If anyone sacrifices before the prayer (for 'Id), that is goat meant for flesh. Abu Burdah b. Niyar stood up and said: Messenger of Allah, I swear by Allah, I sacrificed before I went for prayer. I thought it was the day of eating and drinking; so I made haste, and ate myself, and supplied flesh to my family and neighbors. The Messenger of Allah (ﷺ) said: That is a goat meant for eating flesh. He said: I have a kid (of less than a year) which is better than two goats meant for flesh. Will it be valid from me ? He said: Yes, but it will not be valid for anyone after you",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، حَدَّثَنَا مَنْصُورٌ، عَنِ الشَّعْبِيِّ، عَنِ الْبَرَاءِ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ النَّحْرِ بَعْدَ الصَّلاَةِ فَقَالَ ‏\"‏ مَنْ صَلَّى صَلاَتَنَا وَنَسَكَ نُسُكَنَا فَقَدْ أَصَابَ النُّسُكَ وَمَنْ نَسَكَ قَبْلَ الصَّلاَةِ فَتِلْكَ شَاةُ لَحْمٍ ‏\"‏ ‏.‏ فَقَامَ أَبُو بُرْدَةَ بْنُ نِيَارٍ فَقَالَ يَا رَسُولَ اللَّهِ وَاللَّهِ لَقَدْ نَسَكْتُ قَبْلَ أَنْ أَخْرُجَ إِلَى الصَّلاَةِ وَعَرَفْتُ أَنَّ الْيَوْمَ يَوْمُ أَكْلٍ وَشُرْبٍ فَتَعَجَّلْتُ فَأَكَلْتُ وَأَطْعَمْتُ أَهْلِي وَجِيرَانِي ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تِلْكَ شَاةُ لَحْمٍ ‏\"‏ ‏.‏ فَقَالَ إِنَّ عِنْدِي عَنَاقًا جَذَعَةً وَهِيَ خَيْرٌ مِنْ شَاتَىْ لَحْمٍ فَهَلْ تُجْزِئُ عَنِّي قَالَ ‏\"‏ نَعَمْ وَلَنْ تُجْزِئَ عَنْ أَحَدٍ بَعْدَكَ ‏\"‏ ‏.‏"
    },
    "2801": {
        "bookNumber": 16,
        "hadithNumber": 2801,
        "enghadithText": "Narrated Al-Bara' ibn Azib: A maternal uncle of mine called AbuBurdah sacrificed before the prayer (for 'Id). The Messenger of Allah (ﷺ) said: Your goat is meant for flesh. He said: Messenger of Allah, I have a domestic kid with me. He said: Sacrifice it, but it is not valid for any man other than you",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا خَالِدٌ، عَنْ مُطَرِّفٍ، عَنْ عَامِرٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ ضَحَّى خَالٌ لِي يُقَالُ لَهُ أَبُو بُرْدَةَ قَبْلَ الصَّلاَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ شَاتُكَ شَاةُ لَحْمٍ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي دَاجِنًا جَذَعَةً مِنَ الْمَعْزِ فَقَالَ ‏\"‏ اذْبَحْهَا وَلاَ تَصْلُحُ لِغَيْرِكَ ‏\"‏ ‏.‏"
    },
    "2802": {
        "bookNumber": 16,
        "hadithNumber": 2802,
        "enghadithText": "Narrated Ubayd ibn Firuz: I asked al-Bara' ibn Azib: What should be avoided in sacrificial animals? He said: The Messenger of Allah (ﷺ) stood among us, and my fingers are smaller than his fingers, and my fingertips are smaller than his fingertips. He said (pointing with his fingers): Four (types of animals) should be avoided in sacrifice: A One-eyed animal which has obviously lost the sight of one eye, a sick animal which is obviously sick, a lame animal which obviously limps and an animal with a broken leg with no marrow. I also detest an animal which has defective teeth. He said: Leave what you detest, but do not make it illegal for anyone. Abu Dawud said: (By a lean animal mean) and animal which has no marrow",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عُبَيْدِ بْنِ فَيْرُوزَ، قَالَ سَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ مَا لاَ يَجُوزُ فِي الأَضَاحِي فَقَالَ قَامَ فِينَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصَابِعِي أَقْصَرُ مِنْ أَصَابِعِهِ وَأَنَامِلِي أَقْصَرُ مِنْ أَنَامِلِهِ فَقَالَ ‏\"‏ أَرْبَعٌ لاَ تَجُوزُ فِي الأَضَاحِي الْعَوْرَاءُ بَيِّنٌ عَوَرُهَا وَالْمَرِيضَةُ بَيِّنٌ مَرَضُهَا وَالْعَرْجَاءُ بَيِّنٌ ظَلْعُهَا وَالْكَسِيرُ الَّتِي لاَ تَنْقَى ‏\"‏ ‏.‏ قَالَ قُلْتُ فَإِنِّي أَكْرَهُ أَنْ يَكُونَ فِي السِّنِّ نَقْصٌ ‏.‏ قَالَ ‏\"‏ مَا كَرِهْتَ فَدَعْهُ وَلاَ تُحَرِّمْهُ عَلَى أَحَدٍ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ لَيْسَ لَهَا مُخٌّ ‏.‏"
    },
    "2803": {
        "bookNumber": 16,
        "hadithNumber": 2803,
        "enghadithText": "Narrated Yazid Dhu Misr : I came to Utbah ibn AbdusSulami and said: AbulWalid, I went out seeking sacrificial animals. I did not find anything which attracted me except an animal whose teeth have fallen. So I abominated it. What do you say (about it)? He said: Why did you not bring it to me? He said: Glory be to Allah: Is if lawful for you and not lawful for me? He said: Yes, you doubt and I do not doubt. The Messenger of Allah (ﷺ) has forbidden an animal whose ear has been uprooted so much so that its hole appears (outwardly), and an animal whose horn has broken from the root, and an animal which has totally lost the sight of its eye, and an animal which is so thin and weak that it cannot go with the herd, and an animal with a broken leg",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، قَالَ أَخْبَرَنَا ح، وَحَدَّثَنَا عَلِيُّ بْنُ بَحْرِ بْنِ بَرِّيٍّ، حَدَّثَنَا عِيسَى، - الْمَعْنَى - عَنْ ثَوْرٍ، حَدَّثَنِي أَبُو حُمَيْدٍ الرُّعَيْنِيُّ، أَخْبَرَنِي يَزِيدُ، ذُو مِصْرٍ قَالَ أَتَيْتُ عُتْبَةَ بْنَ عَبْدٍ السُّلَمِيَّ فَقُلْتُ يَا أَبَا الْوَلِيدِ إِنِّي خَرَجْتُ أَلْتَمِسُ الضَّحَايَا فَلَمْ أَجِدْ شَيْئًا يُعْجِبُنِي غَيْرَ ثَرْمَاءَ فَكَرِهْتُهَا فَمَا تَقُولُ قَالَ أَفَلاَ جِئْتَنِي بِهَا ‏.‏ قُلْتُ سُبْحَانَ اللَّهِ تَجُوزُ عَنْكَ وَلاَ تَجُوزُ عَنِّي قَالَ نَعَمْ إِنَّكَ تَشُكُّ وَلاَ أَشُكُّ إِنَّمَا نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْمُصْفَرَّةِ وَالْمُسْتَأْصَلَةِ وَالْبَخْقَاءِ وَالْمُشَيَّعَةِ وَالْكَسْرَاءِ فَالْمُصْفَرَّةُ الَّتِي تُسْتَأْصَلُ أُذُنُهَا حَتَّى يَبْدُوَ سِمَاخُهَا وَالْمُسْتَأْصَلَةُ الَّتِي اسْتُؤْصِلَ قَرْنُهَا مِنْ أَصْلِهِ وَالْبَخْقَاءُ الَّتِي تَبْخَقُ عَيْنُهَا وَالْمُشَيَّعَةُ الَّتِي لاَ تَتْبَعُ الْغَنَمَ عَجْفًا وَضَعْفًا وَالْكَسْرَاءُ الْكَسِيرَةُ ‏.‏"
    },
    "2804": {
        "bookNumber": 16,
        "hadithNumber": 2804,
        "enghadithText": "Narrated Ali ibn AbuTalib: The Messenger of Allah (ﷺ) enjoined upon us to pay great attention to the eye and both ears, and not to sacrifice a one-eyed animal, and an animal with a slit which leaves something hanging at the front or back of the ear, or with a lengthwise slit with a perforation in the ear. I asked AbuIshaq: Did he mention an animal with broken horns and uprooted ears? He said: No. I said: 'What is the Muqabalah ?' He replied: 'It has been cut from the back of its ear.' I said: 'What about the Sharqa'? He replied: 'The ear has been split.' I said: 'What about the Kharqa'? He replied: 'A hole is made (in its ears) as a distinguishing mark",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ شُرَيْحِ بْنِ النُّعْمَانِ، - وَكَانَ رَجُلَ صِدْقٍ - عَنْ عَلِيٍّ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَسْتَشْرِفَ الْعَيْنَ وَالأُذُنَيْنِ وَلاَ نُضَحِّيَ بِعَوْرَاءَ وَلاَ مُقَابَلَةٍ وَلاَ مُدَابَرَةٍ وَلاَ خَرْقَاءَ وَلاَ شَرْقَاءَ ‏.‏ قَالَ زُهَيْرٌ فَقُلْتُ لأَبِي إِسْحَاقَ أَذَكَرَ عَضْبَاءَ قَالَ لاَ ‏.‏ قُلْتُ فَمَا الْمُقَابَلَةُ قَالَ يُقْطَعُ طَرَفُ الأُذُنِ ‏.‏ قُلْتُ فَمَا الْمُدَابَرَةُ قَالَ يُقْطَعُ مِنْ مُؤَخَّرِ الأُذُنِ ‏.‏ قُلْتُ فَمَا الشَّرْقَاءُ قَالَ تُشَقُّ الأُذُنُ ‏.‏ قُلْتُ فَمَا الْخَرْقَاءُ قَالَ تُخْرَقُ أُذُنُهَا لِلسِّمَةِ ‏.‏"
    },
    "2805": {
        "bookNumber": 16,
        "hadithNumber": 2805,
        "enghadithText": "Narrated Ali ibn AbuTalib: The Prophet (ﷺ) prohibited to sacrifice an animal with a slit ear and broken horn. Abu Dawud said: The narrator Jurayy (b. Kulaib) is Sadusi, and belongs to Basrah. No one narrated traditions from him except Qatadah",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ الدَّسْتَوَائِيُّ، وَيُقَالُ، لَهُ هِشَامُ بْنُ سَنْبَرٍ عَنْ قَتَادَةَ، عَنْ جُرَىِّ بْنِ كُلَيْبٍ، عَنْ عَلِيٍّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يُضَحَّى بِعَضْبَاءِ الأُذُنِ وَالْقَرْنِ ‏.‏ قَالَ أَبُو دَاوُدَ جُرَىٌّ سَدُوسِيٌّ بَصْرِيٌّ لَمْ يُحَدِّثْ عَنْهُ إِلاَّ قَتَادَةُ ‏.‏"
    },
    "2806": {
        "bookNumber": 16,
        "hadithNumber": 2806,
        "enghadithText": "Narrated Qatadah:I asked Sa'id b. al-Musayyab: What is meant by animal with a slit ear and broken horn ? He replied: Half and more than half",
        "gradeName": "Al-Albani",
        "gradeValue": "Maqtu",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، قَالَ قُلْتُ لِسَعِيدِ بْنِ الْمُسَيَّبِ مَا الأَعْضَبُ قَالَ النِّصْفُ فَمَا فَوْقَهُ ‏.‏"
    },
    "2807": {
        "bookNumber": 16,
        "hadithNumber": 2807,
        "enghadithText": "Narrated Jabir bin ‘Abdullah :We performed tamattu' during the lifetime of the Messenger of Allah (ﷺ), sacrificed a cow for seven and a camel for seven people. We shared them",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا هُشَيْمٌ، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا نَتَمَتَّعُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم نَذْبَحُ الْبَقَرَةَ عَنْ سَبْعَةٍ وَالْجَزُورَ عَنْ سَبْعَةٍ نَشْتَرِكُ فِيهَا ‏.‏"
    },
    "2808": {
        "bookNumber": 16,
        "hadithNumber": 2808,
        "enghadithText": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) said: A cow serves for seven, and a camel serves for seven",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ قَيْسٍ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ الْبَقَرَةُ عَنْ سَبْعَةٍ وَالْجَزُورُ عَنْ سَبْعَةٍ ‏\"‏ ‏.‏"
    },
    "2809": {
        "bookNumber": 16,
        "hadithNumber": 2809,
        "enghadithText": "Narrated Jabir ibn Abdullah: We sacrificed along with the Messenger of Allah (ﷺ) at al-Hudaybiyyah a camel for seven and a cow for seven people",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ قَالَ نَحَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْحُدَيْبِيَةِ الْبَدَنَةَ عَنْ سَبْعَةٍ وَالْبَقَرَةَ عَنْ سَبْعَةٍ ‏.‏"
    },
    "2810": {
        "bookNumber": 16,
        "hadithNumber": 2810,
        "enghadithText": "Narrated Jabir ibn Abdullah: I witnessed sacrificing along with the Messenger of Allah (ﷺ) at the place of prayer. When he finished his sermon, he descended from his pulpit, and a ram was brought to him. The Messenger of Allah (ﷺ) slaughtered it with his hand, and said: In the name of Allah, Allah, is Most Great. This is from me and from those who did not sacrifice from my community",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي الإِسْكَنْدَرَانِيَّ - عَنْ عَمْرٍو، عَنِ الْمُطَّلِبِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ شَهِدْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الأَضْحَى بِالْمُصَلَّى فَلَمَّا قَضَى خُطْبَتَهُ نَزَلَ مِنْ مِنْبَرِهِ وَأُتِيَ بِكَبْشٍ فَذَبَحَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ وَقَالَ ‏ \"‏ بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ هَذَا عَنِّي وَعَمَّنْ لَمْ يُضَحِّ مِنْ أُمَّتِي ‏\"‏ ‏.‏"
    },
    "2811": {
        "bookNumber": 16,
        "hadithNumber": 2811,
        "enghadithText": "Narrated Ibn 'Umar:The Prophet (ﷺ) used to slaughter his sacrificial animal at the place of prayer. Ibn 'Umar used to do so",
        "gradeName": "Al-Albani",
        "gradeValue": "Hasan Sahih",
        "arabhadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، أَنَّ أَبَا أُسَامَةَ، حَدَّثَهُمْ عَنْ أُسَامَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَذْبَحُ أُضْحِيَتَهُ بِالْمُصَلَّى وَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ ‏.‏"
    },
    "2812": {
        "bookNumber": 16,
        "hadithNumber": 2812,
        "enghadithText": "Narrated 'Aishah:Some people of desert came at the time of sacrifice in the time of Apostle of Allah (ﷺ). The Messenger of Allah (ﷺ) said: Store up for three days and give the rest as sadaqah (alms). After than the people said to the Messenger of Allah (ﷺ): Messenger of Allah, the people used to benefit from their sacrifices, take and dissolve fat from them, and make water-bags (from their skins). The Messenger of Allah (ﷺ) said: What is that ? or whatever he said: They said: Messenger of Allah (ﷺ), you have prohibited to preserve the meat of sacrifice after three days. The Messenger of Allah (ﷺ) said: I prohibited you due to a body of people who came to you. Now eat, give it as sadaqah (alms), and store up",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، قَالَتْ سَمِعْتُ عَائِشَةَ، تَقُولُ دَفَّ نَاسٌ مِنْ أَهْلِ الْبَادِيَةِ حَضْرَةَ الأَضْحَى فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ ادَّخِرُوا الثُّلُثَ وَتَصَدَّقُوا بِمَا بَقِيَ ‏\"‏ ‏.‏ قَالَتْ فَلَمَّا كَانَ بَعْدَ ذَلِكَ قِيلَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ لَقَدْ كَانَ النَّاسُ يَنْتَفِعُونَ مِنْ ضَحَايَاهُمْ وَيَجْمُلُونَ مِنْهَا الْوَدْكَ وَيَتَّخِذُونَ مِنْهَا الأَسْقِيَةَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَمَا ذَاكَ ‏\"‏ ‏.‏ أَوْ كَمَا قَالَ قَالُوا يَا رَسُولَ اللَّهِ نَهَيْتَ عَنْ إِمْسَاكِ لُحُومِ الضَّحَايَا بَعْدَ ثَلاَثٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا نَهَيْتُكُمْ مِنْ أَجْلِ الدَّافَّةِ الَّتِي دَفَّتْ عَلَيْكُمْ فَكُلُوا وَتَصَدَّقُوا وَادَّخِرُوا ‏\"‏ ‏.‏"
    },
    "2813": {
        "bookNumber": 16,
        "hadithNumber": 2813,
        "enghadithText": "Narrated Nubayshah: The Prophet (ﷺ) said: We forbade you to eat their meat for more than three days in order that you might have abundance; now Allah has produced abundance, so you may eat, store up and seek reward. Beware, these days are days of eating, drinking and remembrance of Allah, Most High",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي الْمَلِيحِ، عَنْ نُبَيْشَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّا كُنَّا نَهَيْنَاكُمْ عَنْ لُحُومِهَا أَنْ تَأْكُلُوهَا فَوْقَ ثَلاَثٍ لِكَىْ تَسَعَكُمْ فَقَدْ جَاءَ اللَّهُ بِالسَّعَةِ فَكُلُوا وَادَّخِرُوا وَاتَّجِرُوا أَلاَ وَإِنَّ هَذِهِ الأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏"
    },
    "2814": {
        "bookNumber": 16,
        "hadithNumber": 2814,
        "enghadithText": "Narrated Thawban:The Messenger of Allah (ﷺ) sacrificed during a journey and then said: Thawban, mend the meat of this goat. I then kept on supplying its meat until we reached Medina",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ، حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ أَبِي الزَّاهِرِيَّةِ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ ثَوْبَانَ، قَالَ ضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏ \"‏ يَا ثَوْبَانُ أَصْلِحْ لَنَا لَحْمَ هَذِهِ الشَّاةِ ‏\"‏ ‏.‏ قَالَ فَمَا زِلْتُ أُطْعِمُهُ مِنْهَا حَتَّى قَدِمْنَا الْمَدِينَةَ ‏.‏"
    },
    "2815": {
        "bookNumber": 16,
        "hadithNumber": 2815,
        "enghadithText": "Narrated Shaddad b. Aws:There are two characteristics that I heard the Messenger of Allah (ﷺ) say: Allah has decreed that everything should be done in a good way, so when you kill use a good method. The version of the narrators other than Muslim says: \"So kill in a good manner.\" And when you slaughter, you should use a good method, for one of you should sharpen his knife, and give the animal as little pain as possible",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ، عَنْ شَدَّادِ بْنِ أَوْسٍ، قَالَ خَصْلَتَانِ سَمِعْتُهُمَا مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ كَتَبَ الإِحْسَانَ عَلَى كُلِّ شَىْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا ‏\"‏ ‏.‏ قَالَ غَيْرُ مُسْلِمٍ يَقُولُ ‏\"‏ فَأَحْسِنُوا الْقِتْلَةَ وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ وَلْيُرِحْ ذَبِيحَتَهُ ‏\"‏ ‏.‏"
    },
    "2816": {
        "bookNumber": 16,
        "hadithNumber": 2816,
        "enghadithText": "Narrated Hisham b. Zaid:I entered upon al-Hakam b. Ayyub along with Anas. He saw some youths or boys who had set up a hen and shooting at it. Anas said: The Messenger of Allah (ﷺ) forbade to kill an animal in confinement",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، قَالَ دَخَلْتُ مَعَ أَنَسٍ عَلَى الْحَكَمِ بْنِ أَيُّوبَ فَرَأَى فِتْيَانًا أَوْ غِلْمَانًا قَدْ نَصَبُوا دَجَاجَةً يَرْمُونَهَا فَقَالَ أَنَسٌ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تُصْبَرَ الْبَهَائِمُ ‏.‏"
    },
    "2817": {
        "bookNumber": 16,
        "hadithNumber": 2817,
        "enghadithText": "Narrated Ibn 'Abbas:The verse: \"So eat of (meats) on which Allah's name hath been pronounced\" and the verse: \"Eat not of (meats) on which Allah's name hath not been pronounced\" were abrogated, meaning an exception was made therein by the verse: \"The food of the people of the Book is lawful unto you and yours is lawful unto them",
        "gradeName": "Al-Albani",
        "gradeValue": "Hasan",
        "arabhadithText": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ، حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ، عَنْ أَبِيهِ، عَنْ يَزِيدَ النَّحْوِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ ‏{‏ فَكُلُوا مِمَّا ذُكِرَ اسْمُ اللَّهِ عَلَيْهِ ‏}‏ ‏{‏ وَلاَ تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ ‏}‏ فَنُسِخَ وَاسْتَثْنَى مِنْ ذَلِكَ فَقَالَ ‏{‏ وَطَعَامُ الَّذِينَ أُوتُوا الْكِتَابَ حِلٌّ لَكُمْ وَطَعَامُكُمْ حِلٌّ لَهُمْ ‏}‏ ‏.‏"
    },
    "2818": {
        "bookNumber": 16,
        "hadithNumber": 2818,
        "enghadithText": "Narrated Abdullah ibn Abbas: explaining the verse \"But the evil ones ever inspire their friend to contend with you\" They used to say: Do not eat which Allah killed, but eat which you slaughtered. So Allah revealed the verse: \"Eat not of (meats) on which Allah's name hath not been pronounced\"...to the end of the verse",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، أَخْبَرَنَا إِسْرَائِيلُ، حَدَّثَنَا سِمَاكٌ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ ‏{‏ وَإِنَّ الشَّيَاطِينَ لَيُوحُونَ إِلَى أَوْلِيَائِهِمْ ‏}‏ يَقُولُونَ مَا ذَبَحَ اللَّهُ فَلاَ تَأْكُلُوا وَمَا ذَبَحْتُمْ أَنْتُمْ فَكُلُوا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَلاَ تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ ‏}‏ ‏.‏"
    },
    "2819": {
        "bookNumber": 16,
        "hadithNumber": 2819,
        "enghadithText": "Narrated Abdullah ibn Abbas: The Jews came to the Prophet (ﷺ) and said: We eat which we kill but we do not eat which Allah kills? So Allah revealed: \"Eat not of (meats) on which Allah's name hath not been pronounced.\" to the end of the verse",
        "gradeName": "Al-Albani",
        "gradeValue": "Munqar",
        "arabhadithText": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عِمْرَانُ بْنُ عُيَيْنَةَ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَتِ الْيَهُودُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا نَأْكُلُ مِمَّا قَتَلْنَا وَلاَ نَأْكُلُ مِمَّا قَتَلَ اللَّهُ فَأَنْزَلَ اللَّهُ ‏{‏ وَلاَ تَأْكُلُوا مِمَّا لَمْ يُذْكَرِ اسْمُ اللَّهِ عَلَيْهِ ‏}‏ إِلَى آخِرِ الآيَةِ ‏.‏"
    },
    "2820": {
        "bookNumber": 16,
        "hadithNumber": 2820,
        "enghadithText": "Narrated Abdullah ibn Abbas: The Messenger of Allah (ﷺ) forbade to eat (the meat of animals) slaughtered by the bedouins for vainglory and pride. Abu Dawud said: The narrator Ghundar narrated this tradition as a saying of Ibn 'Abbas (and not of the Prophet)",
        "gradeName": "Al-Albani",
        "gradeValue": "Hasan Sahih",
        "arabhadithText": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، عَنْ عَوْفٍ، عَنْ أَبِي رَيْحَانَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَكْلِ مُعَاقَرَةِ الأَعْرَابِ ‏.‏ قَالَ أَبُو دَاوُدَ اسْمُ أَبِي رَيْحَانَةَ عَبْدُ اللَّهِ بْنُ مَطَرٍ وَغُنْدَرٌ أَوْقَفَهُ عَلَى ابْنِ عَبَّاسٍ ‏.‏"
    },
    "2821": {
        "bookNumber": 16,
        "hadithNumber": 2821,
        "enghadithText": "Narrated Rafi' b. Khadij:I came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, we shall meet the enemy tomorrow and we have no knives with us. May we kill with a sharp-edged white stone (flint) and with splinter of a staff ? The Messenger of Allah (ﷺ) said: Hasten in slaughtering it. When Allah's name is mentioned you may eat what is killed by anything which causes the blood to flow except tooth and claw. I shall tell you about it. The tooth is a bone, and the claw is the knife of Abyssinians. Some people hastened and went forward, they made haste and got booty, while the Messenger of Allah (ﷺ) was in the rear and they setup cooking pots. The Messenger of Allah (ﷺ) passed by over the cooking pots. He ordered to turn them over. He then divided (the spoils of war) between them, and gave them a camel for ten goats in equation. One of the camels of the people ran away, and they had no horses with them at that time. A man shot an arrow at it, and Allah prevented it from escaping. The Prophet (ﷺ) said: Among animals (i.e. camels) there are some which bolt like wild animals ; so when any of them does so, do with it like this",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا أَبُو الأَحْوَصِ، حَدَّثَنَا سَعِيدُ بْنُ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، رَافِعِ بْنِ خَدِيجٍ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا نَلْقَى الْعَدُوَّ غَدًا وَلَيْسَ مَعَنَا مُدًى أَفَنَذْبَحُ بِالْمَرْوَةِ وَشِقَّةِ الْعَصَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَرِنْ أَوْ أَعْجِلْ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ فَكُلُوا مَا لَمْ يَكُنْ سِنًّا أَوْ ظُفْرًا وَسَأُحَدِّثُكُمْ عَنْ ذَلِكَ أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفْرُ فَمُدَى الْحَبَشَةِ ‏\"‏ ‏.‏ وَتَقَدَّمَ بِهِ سَرَعَانٌ مِنَ النَّاسِ فَتَعَجَّلُوا فَأَصَابُوا مِنَ الْغَنَائِمِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي آخِرِ النَّاسِ فَنَصَبُوا قُدُورًا فَمَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْقُدُورِ فَأَمَرَ بِهَا فَأُكْفِئَتْ وَقَسَمَ بَيْنَهُمْ فَعَدَلَ بَعِيرًا بِعَشْرِ شِيَاهٍ وَنَدَّ بَعِيرٌ مِنْ إِبِلِ الْقَوْمِ وَلَمْ يَكُنْ مَعَهُمْ خَيْلٌ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ اللَّهُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا فَعَلَ مِنْهَا هَذَا فَافْعَلُوا بِهِ مِثْلَ هَذَا ‏\"‏ ‏.‏"
    },
    "2822": {
        "bookNumber": 16,
        "hadithNumber": 2822,
        "enghadithText": "Narrated Muhammad ibn Safwan or Safwan ibn Muhammad: I hunted two hares and slaughtered them with a flint. I asked the Messenger of Allah (ﷺ) about them. He permitted me to eat them",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، أَنَّ عَبْدَ الْوَاحِدِ بْنَ زِيَادٍ، وَحَمَّادًا، حَدَّثَاهُمْ - الْمَعْنَى، وَاحِدٌ، - عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنْ مُحَمَّدِ بْنِ صَفْوَانَ، أَوْ صَفْوَانَ بْنِ مُحَمَّدٍ قَالَ اصَّدْتُ أَرْنَبَيْنِ فَذَبَحْتُهُمَا بِمَرْوَةٍ فَسَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْهُمَا فَأَمَرَنِي بِأَكْلِهِمَا ‏.‏"
    },
    "2823": {
        "bookNumber": 16,
        "hadithNumber": 2823,
        "enghadithText": "Narrated Ata' ibn Yasar: A man of Banu Harith was pasturing a pregnant she-camel in one of the ravines of Uhud, (he saw that) it was about to die; he could find nothing to slaughter it; he took a stake and stabbed it in the upper part of its breast until he made its blood flow. He then came to the Prophet (ﷺ) and informed him about that, and he ordered him to eat it",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ رَجُلٍ، مِنْ بَنِي حَارِثَةَ أَنَّهُ كَانَ يَرْعَى لِقْحَةً بِشِعْبٍ مِنْ شِعَابِ أُحُدٍ فَأَخَذَهَا الْمَوْتُ فَلَمْ يَجِدْ شَيْئًا يَنْحَرُهَا بِهِ فَأَخَذَ وَتَدًا فَوَجَأَ بِهِ فِي لَبَّتِهَا حَتَّى أُهْرِيقَ دَمُهَا ثُمَّ جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرَهُ بِذَلِكَ فَأَمَرَهُ بِأَكْلِهَا ‏.‏"
    },
    "2824": {
        "bookNumber": 16,
        "hadithNumber": 2824,
        "enghadithText": "Narrated Adi ibn Hatim: I said: Messenger of Allah, tell me when one of us catches game and has no knife; may he slaughter with a flint and a splinter of stick. He said: Cause the blood to flow with whatever you like and mention Allah's name",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ مُرِّيِّ بْنِ قَطَرِيٍّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ أَحَدُنَا أَصَابَ صَيْدًا وَلَيْسَ مَعَهُ سِكِّينٌ أَيَذْبَحُ بِالْمَرْوَةِ وَشِقَّةِ الْعَصَا فَقَالَ ‏ \"‏ أَمْرِرِ الدَّمَ بِمَا شِئْتَ وَاذْكُرِ اسْمَ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏"
    },
    "2825": {
        "bookNumber": 16,
        "hadithNumber": 2825,
        "enghadithText": "Narrated AbulUshara': AbulUshara' reported on the authority of his father: He asked: Messenger of Allah, is the slaughtering to be done only in the upper part of the breast and the throat? The Messenger of Allah (ﷺ) replied: If you pierced its thigh, it would serve you. Abu Dawud said: This is the way suitable for slaughtering an animal which has fallen into a well or runs loose",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي الْعُشَرَاءِ، عَنْ أَبِيهِ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ أَمَا تَكُونُ الذَّكَاةُ إِلاَّ مِنَ اللَّبَّةِ أَوِ الْحَلْقِ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَوْ طَعَنْتَ فِي فَخِذِهَا لأَجْزَأَ عَنْكَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا لاَ يَصْلُحُ إِلاَّ فِي الْمُتَرَدِّيَةِ وَالْمُتَوَحِّشِ ‏.‏"
    },
    "2826": {
        "bookNumber": 16,
        "hadithNumber": 2826,
        "enghadithText": "Narrated Abdullah ibn Abbas: Ibn Isa added: (Ibn Abbas) and AbuHurayrah said: The Messenger of Allah (ﷺ) forbade the devil's sacrifice. AbuIsa added in his version: This refers to the slaughtered animal whose skin cut off, and is then left to die without its jugular veins being severed",
        "gradeName": "Al-Albani",
        "gradeValue": "Daif",
        "arabhadithText": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، وَالْحَسَنُ بْنُ عِيسَى، مَوْلَى ابْنِ الْمُبَارَكِ عَنِ ابْنِ الْمُبَارَكِ، عَنْ مَعْمَرٍ، عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، - زَادَ ابْنُ عِيسَى - وَأَبِي هُرَيْرَةَ قَالاَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ شَرِيطَةِ الشَّيْطَانِ ‏.‏ زَادَ ابْنُ عِيسَى فِي حَدِيثِهِ وَهِيَ الَّتِي تُذْبَحُ فَيُقْطَعُ الْجِلْدُ وَلاَ تُفْرَى الأَوْدَاجُ ثُمَّ تُتْرَكُ حَتَّى تَمُوتَ ‏.‏"
    },
    "2827": {
        "bookNumber": 16,
        "hadithNumber": 2827,
        "enghadithText": "Narrated AbuSa'id al-Khudri: I asked the Messenger of Allah (ﷺ) about the embryo. He replied: Eat it if you wish. Musaddad's version says: we said: Messenger of Allah, we slaughter a she-camel, a cow and a sheep, and we find an embryo in its womb. Shall we throw it away or eat it? He replied: Eat it if you wish for the slaughter of its mother serves its slaughter",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا الْقَعْنَبِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، ح وَحَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا هُشَيْمٌ، عَنْ مُجَالِدٍ، عَنْ أَبِي الْوَدَّاكِ، عَنْ أَبِي سَعِيدٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْجَنِينِ فَقَالَ ‏\"‏ كُلُوهُ إِنْ شِئْتُمْ ‏\"‏ ‏.‏ وَقَالَ مُسَدَّدٌ قُلْنَا يَا رَسُولَ اللَّهِ نَنْحَرُ النَّاقَةَ وَنَذْبَحُ الْبَقَرَةَ وَالشَّاةَ فَنَجِدُ فِي بَطْنِهَا الْجَنِينَ أَنُلْقِيهِ أَمْ نَأْكُلُهُ قَالَ ‏\"‏ كُلُوهُ إِنْ شِئْتُمْ فَإِنَّ ذَكَاتَهُ ذَكَاةُ أُمِّهِ ‏\"‏ ‏.‏"
    },
    "2828": {
        "bookNumber": 16,
        "hadithNumber": 2828,
        "enghadithText": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) said: The slaughter of embryo is included when its mother is slaughtered",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ، حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ رَاهَوَيْهِ، حَدَّثَنَا عَتَّابُ بْنُ بَشِيرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي زِيَادٍ الْقَدَّاحُ الْمَكِّيُّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ ذَكَاةُ الْجَنِينِ ذَكَاةُ أُمِّهِ ‏\"‏ ‏.‏"
    },
    "2829": {
        "bookNumber": 16,
        "hadithNumber": 2829,
        "enghadithText": "Narrated 'Aishah:(the narrator Musa did not mention the words \"from 'Aishah\" in his version from Hammad, and al-Qa'nabi also did not mention the word \"from 'Aishah\" in his version from Malik). They (the people) said: Messenger of Allah, there are people here, recent converts from polytheism, who bring us meat and we do not know whether or not they mentioned Allah's name over it. The Messenger of Allah (ﷺ) said: Mention Allah's name and eat",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، ح وَحَدَّثَنَا الْقَعْنَبِيُّ، عَنْ مَالِكٍ، ح وَحَدَّثَنَا يُوسُفُ بْنُ مُوسَى، حَدَّثَنَا سُلَيْمَانُ بْنُ حَيَّانَ، وَمُحَاضِرٌ، - الْمَعْنَى - عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، وَلَمْ يَذْكُرَا عَنْ حَمَّادٍ، وَمَالِكٍ، عَنْ عَائِشَةَ، أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ قَوْمًا حَدِيثُو عَهْدٍ بِالْجَاهِلِيَّةِ يَأْتُونَنَا بِلُحْمَانٍ لاَ نَدْرِي أَذَكَرُوا اسْمَ اللَّهِ عَلَيْهَا أَمْ لَمْ يَذْكُرُوا أَفَنَأْكُلُ مِنْهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ سَمُّوا اللَّهَ وَكُلُوا ‏\"‏ ‏.‏"
    },
    "2830": {
        "bookNumber": 16,
        "hadithNumber": 2830,
        "enghadithText": "Narrated Nubayshah: A man called the Messenger of Allah (ﷺ): We used to sacrifice Atirah in pre-Islamic days during Rajab; so what do you command us? He said: Sacrifice for the sake of Allah in any month whatever; obey Allah, Most High, and feed(the people). He said: We used to sacrifice a Fara' in pre-Islamic days, so what do you command us? He said: On every pasturing animal there is a Fara' which is fed by your cattle till it becomes strong and capable of carrying load. The narrator Nasr said (in his version): When it becomes capable of carrying load of the pilgrims, you may slaughter it and give its meat as charity (sadaqah). The narrator Khalid's version says: You (may give it) to the travellers, for it is better. Khalid said: I asked AbuQilabah: How many pasturing animals? He replied: One hundred",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، ح وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، عَنْ بِشْرِ بْنِ الْمُفَضَّلِ، - الْمَعْنَى - حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمَلِيحِ، قَالَ قَالَ نُبَيْشَةُ نَادَى رَجُلٌ رَسُولَ اللَّهِ صلى الله عليه وسلم إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا قَالَ ‏\"‏ اذْبَحُوا لِلَّهِ فِي أَىِّ شَهْرٍ كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"‏ ‏.‏ قَالَ إِنَّا كُنَّا نُفْرِعُ فَرَعًا فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ ‏\"‏ فِي كُلِّ سَائِمَةٍ فَرَعٌ تَغْذُوهُ مَاشِيَتُكَ حَتَّى إِذَا اسْتَحْمَلَ ‏\"‏ ‏.‏ قَالَ نَصْرٌ ‏\"‏ اسْتَحْمَلَ لِلْحَجِيجِ ذَبَحْتَهُ فَتَصَدَّقْتَ بِلَحْمِهِ ‏\"‏ ‏.‏ قَالَ خَالِدٌ أَحْسَبُهُ قَالَ ‏\"‏ عَلَى ابْنِ السَّبِيلِ فَإِنَّ ذَلِكَ خَيْرٌ ‏\"‏ ‏.‏ قَالَ خَالِدٌ قُلْتُ لأَبِي قِلاَبَةَ كَمِ السَّائِمَةُ قَالَ مِائَةٌ ‏.‏"
    },
    "2831": {
        "bookNumber": 16,
        "hadithNumber": 2831,
        "enghadithText": "Narrated Abu Hurairah:Prophet (ﷺ) sa saying: There is no fara' and 'atirah",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، أَخْبَرَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ فَرَعَ وَلاَ عَتِيرَةَ ‏\"‏ ‏.‏"
    },
    "2832": {
        "bookNumber": 16,
        "hadithNumber": 2832,
        "enghadithText": "Narrated Sa'id:Fara' was the first animal born to them (the Arabs) which they sacrificed",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih Maqtu",
        "arabhadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، قَالَ الْفَرَعُ أَوَّلُ النِّتَاجِ كَانَ يُنْتَجُ لَهُمْ فَيَذْبَحُونَهُ ‏.‏"
    },
    "2833": {
        "bookNumber": 16,
        "hadithNumber": 2833,
        "enghadithText": "Narrated 'Aishah: The Messenger of Allah (ﷺ) used to sacrifice goat out of every fifty goats. Abu Dawud said: Fara' means the first baby camel born (to the Arabs). They used to sacrifice it for their idols, and then eat it, and its skin was thrown on a tree. 'Atira was a sacrifice made during the first ten days of Rajab",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ حَفْصَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ كُلِّ خَمْسِينَ شَاةً شَاةٌ ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ بَعْضُهُمُ الْفَرَعُ أَوَّلُ مَا تُنْتَجُ الإِبِلُ كَانُوا يَذْبَحُونَهُ لِطَوَاغِيتِهِمْ ثُمَّ يَأْكُلُونَهُ وَيُلْقَى جِلْدُهُ عَلَى الشَّجَرِ وَالْعَتِيرَةُ فِي الْعَشْرِ الأُوَلِ مِنْ رَجَبٍ ‏.‏"
    },
    "2834": {
        "bookNumber": 16,
        "hadithNumber": 2834,
        "enghadithText": "Narrated Umm Kurz al-Ka'biyyah: I heard the Messenger of Allah (ﷺ) say: Two resembling sheep are to be sacrificed for a boy and one for a girl. AbuDawud said: I heard Ahmad (ibn Hanbal) say: The Arabic word mukafi'atani means equal (in age) or resembling each other",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ، عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ عَنِ الْغُلاَمِ شَاتَانِ مُكَافِئَتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ سَمِعْتُ أَحْمَدَ قَالَ مُكَافِئَتَانِ أَىْ مُسْتَوِيَتَانِ أَوْ مُقَارِبَتَانِ ‏.‏"
    },
    "2835": {
        "bookNumber": 16,
        "hadithNumber": 2835,
        "enghadithText": "Narrated Umm Kurz: I heard the Prophet (nay peace be upon him) say: Let the birds stay in their roosts. She said: I also heard him say: Two sheep are to be sacrificed for a boy and one for a girl, but it does you no harm whether they are male or female",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، عَنْ أَبِيهِ، عَنْ سِبَاعِ بْنِ ثَابِتٍ، عَنْ أُمِّ كُرْزٍ، قَالَتْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ أَقِرُّوا الطَّيْرَ عَلَى مَكِنَاتِهَا ‏\"‏ ‏.‏ قَالَتْ وَسَمِعْتُهُ يَقُولُ ‏\"‏ عَنِ الْغُلاَمِ شَاتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ لاَ يَضُرُّكُمْ أَذُكْرَانًا كُنَّ أَمْ إِنَاثًا ‏\"‏ ‏.‏"
    },
    "2836": {
        "bookNumber": 16,
        "hadithNumber": 2836,
        "enghadithText": "Narrated Umm Kurz: The Messenger of Allah (ﷺ) said: Two sheep which resemble each other are to be sacrificed for a boy and one for a girl. Abu Dawud said: This is a sound tradition, and the tradition narrated by Sufyan is misunderstanding",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، عَنْ سِبَاعِ بْنِ ثَابِتٍ، عَنْ أُمِّ كُرْزٍ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ عَنِ الْغُلاَمِ شَاتَانِ مِثْلاَنِ وَعَنِ الْجَارِيَةِ شَاةٌ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هَذَا هُوَ الْحَدِيثُ وَحَدِيثُ سُفْيَانَ وَهَمٌ ‏.‏"
    },
    "2837": {
        "bookNumber": 16,
        "hadithNumber": 2837,
        "enghadithText": "Narrated Samurah ibn Jundub: The Prophet (ﷺ) said: A boy is in pledge for his Aqiqah. Sacrifice is made for him on the seventh day, his head is shaved and is smeared with blood. When Qatadah was asked about smearing with blood, how that should be done, he said: When you cut the head (i.e. throat) of the animal (meant for Aqiqah), you may take a few hair of it, place them on its veins, and then place them in the middle of the head of the infant, so that the blood flows on the hair (of the infant) like a threat. Then its head may be washed and shaved off. Abu Dawud said: In narrating the word \"is smeared with blood\" (yudamma) there is a misunderstanding on the part of Hammam. Abu Dawud said: Hammam has been opposed in narrating the words \"is smeared with blood\". This is misunderstanding of Hammam. They narrated he word \"he is given a name (yusamma) and Hammam narrated it \"is smeared with blood\" (yudamma). Abu Dawud said: This tradition is not followed",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ كُلُّ غُلاَمٍ رَهِينَةٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ السَّابِعِ وَيُحْلَقُ رَأْسُهُ وَيُدَمَّى ‏\"‏ ‏.‏ فَكَانَ قَتَادَةُ إِذَا سُئِلَ عَنِ الدَّمِ كَيْفَ يُصْنَعُ بِهِ قَالَ إِذَا ذَبَحْتَ الْعَقِيقَةَ أَخَذْتَ مِنْهَا صُوفَةً وَاسْتَقْبَلْتَ بِهِ أَوْدَاجَهَا ثُمَّ تُوضَعُ عَلَى يَافُوخِ الصَّبِيِّ حَتَّى يَسِيلَ عَلَى رَأْسِهِ مِثْلُ الْخَيْطِ ثُمَّ يُغْسَلُ رَأْسُهُ بَعْدُ وَيُحْلَقُ ‏.‏ قَالَ أَبُو دَاوُدَ وَهَذَا وَهَمٌ مِنْ هَمَّامٍ ‏\"‏ وَيُدَمَّى ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ خُولِفَ هَمَّامٌ فِي هَذَا الْكَلاَمِ وَهُوَ وَهَمٌ مِنْ هَمَّامٍ وَإِنَّمَا قَالُوا ‏\"‏ يُسَمَّى ‏\"‏ ‏.‏ فَقَالَ هَمَّامٌ ‏\"‏ يُدَمَّى ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَلَيْسَ يُؤْخَذُ بِهَذَا ‏.‏"
    },
    "2838": {
        "bookNumber": 16,
        "hadithNumber": 2838,
        "enghadithText": "Narrated Samurah ibn Jundub: The Prophet (ﷺ) said: A boy is in pledge for his Aqiqah, Sacrifice is made for him on the seventh day, his head is shaved and he is given name. Abu Dawud said: The word wa yusamma is sounder as narrated by Salam b. Abi Muti' from Qatadah, and narrated by Iyas b. Daghfal and Ash'ath from al-Hassan who narrated wa yusamma (and he is given a name)",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ كُلُّ غُلاَمٍ رَهِينَةٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ وَيُحْلَقُ وَيُسَمَّى ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ وَيُسَمَّى أَصَحُّ كَذَا قَالَ سَلاَّمُ بْنُ أَبِي مُطِيعٍ عَنْ قَتَادَةَ وَإِيَاسُ بْنُ دَغْفَلٍ وَأَشْعَثُ عَنِ الْحَسَنِ ‏.‏ قَالَ ‏\"‏ وَيُسَمَّى ‏\"‏ ‏.‏ وَرَوَاهُ أَشْعَثُ عَنِ الْحَسَنِ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ وَيُسَمَّى ‏\"‏ ‏.‏"
    },
    "2839": {
        "bookNumber": 16,
        "hadithNumber": 2839,
        "enghadithText": "Narrated Salman b. 'Amir al-Dabbi:The Messenger of Allah (ﷺ) as saying: Along with a boy there is an 'Aqiqah, so shed blood on his behalf, and remove injury from him",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ حَفْصَةَ بِنْتِ سِيرِينَ، عَنِ الرَّبَابِ، عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَعَ الْغُلاَمِ عَقِيقَتُهُ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الأَذَى ‏\"‏ ‏.‏"
    },
    "2840": {
        "bookNumber": 16,
        "hadithNumber": 2840,
        "enghadithText": "Narrated Al-Hasan:To remove the injury is the shaving of the head",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih Maqtu",
        "arabhadithText": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنِ الْحَسَنِ، أَنَّهُ كَانَ يَقُولُ إِمَاطَةُ الأَذَى حَلْقُ الرَّأْسِ ‏.‏"
    },
    "2841": {
        "bookNumber": 16,
        "hadithNumber": 2841,
        "enghadithText": "Narrated Abdullah ibn Abbas: The Messenger of Allah (ﷺ) sacrificed a ram for both al-Hasan and al-Husayn each (Allah be pleased with them)",
        "gradeName": "Al-Albani",
        "gradeValue": "Sahih",
        "arabhadithText": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَقَّ عَنِ الْحَسَنِ وَالْحُسَيْنِ كَبْشًا كَبْشًا ‏.‏"
    },
    "2842": {
        "bookNumber": 16,
        "hadithNumber": 2842,
        "enghadithText": "Narrated 'Amr b. Suh'aib: On his father's authority, said that his grandfather that the Messenger of Allah (ﷺ) was asked about the aqiqah. He replied: Allah does not like the breaking of ties (uquq), as though he disliked the name. And he said: If anyone has a child born to him and wishes to offer a sacrifice on its behalf, he may offer two resembling sheep for a boy and one for a girl. And he was asked about fara'. He replied: Fara' is right. If you leave it (i.e. let it grow till it becomes a healthy camel of one year or two years, then you give it to a widow or give it in the path of Allah for using it as a riding beast, it is better than slaughtering it at the age when its meat is stuck to its hair, and you turn over your milking vessel and annoy your she-camel)",
        "gradeName": "Al-Albani",
        "gradeValue": "Hasan",
        "arabhadithText": "حَدَّثَنَا الْقَعْنَبِيُّ، حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم ح وَحَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ حَدَّثَنَا عَبْدُ الْمَلِكِ - يَعْنِي ابْنَ عَمْرٍو - عَنْ دَاوُدَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ أُرَاهُ عَنْ جَدِّهِ قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْعَقِيقَةِ فَقَالَ ‏\"‏ لاَ يُحِبُّ اللَّهُ الْعُقُوقَ ‏\"‏ ‏.‏ كَأَنَّهُ كَرِهَ الاِسْمَ وَقَالَ ‏\"‏ مَنْ وُلِدَ لَهُ وَلَدٌ فَأَحَبَّ أَنْ يَنْسُكَ عَنْهُ فَلْيَنْسُكْ عَنِ الْغُلاَمِ شَاتَانِ مُكَافِئَتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ ‏\"‏ ‏.‏ وَسُئِلَ عَنِ الْفَرَعِ قَالَ ‏\"‏ وَالْفَرَعُ حَقٌّ وَأَنْ تَتْرُكُوهُ حَتَّى يَكُونَ بَكْرًا شُغْزُبًّا ابْنَ مَخَاضٍ أَوِ ابْنَ لَبُونٍ فَتُعْطِيَهُ أَرْمَلَةً أَوْ تَحْمِلَ عَلَيْهِ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنْ أَنْ تَذْبَحَهُ فَيَلْزَقَ لَحْمُهُ بِوَبَرِهِ وَتُكْفِئَ إِنَاءَكَ وَتُوَلِّهَ نَاقَتَكَ ‏\"‏ ‏.‏"
    },
    "2843": {
        "bookNumber": 16,
        "hadithNumber": 2843,
        "enghadithText": "Narrated Buraydah ibn al-Hasib: When a boy was born to one of us in the pre-Islamic period, we sacrificed a sheep and smeared his head with its blood; but when Allah brought Islam, we sacrificed a sheep, shaved his head and smeared his head with saffron",
        "gradeName": "Al-Albani",
        "gradeValue": "Hasan Sahih",
        "arabhadithText": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ، حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ، حَدَّثَنِي أَبِي، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، قَالَ سَمِعْتُ أَبِي بُرَيْدَةَ، يَقُولُ كُنَّا فِي الْجَاهِلِيَّةِ إِذَا وُلِدَ لأَحَدِنَا غُلاَمٌ ذَبَحَ شَاةً وَلَطَخَ رَأْسَهُ بِدَمِهَا فَلَمَّا جَاءَ اللَّهُ بِالإِسْلاَمِ كُنَّا نَذْبَحُ شَاةً وَنَحْلِقُ رَأْسَهُ وَنَلْطَخُهُ بِزَعْفَرَانٍ ‏.‏"
    }
}