[
  {
    "SurahNumber": "20",
    "AyahNumber": "1",
    "NoteID": "2534",
    "Body": "For an explanation see the Introduction to this Sura."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "2",
    "NoteID": "2535",
    "Body": "Allah's revelation may cause some human trouble for two\\n\\t\\t\\t\\treasons: (1) it checks man's selfishness and narrowness\\n\\t\\t\\t\\tof view, and (2) it annoys the wicked and causes them to\\n\\t\\t\\t\\tjeer and persecute. These are mere incidental things, due\\n\\t\\t\\t\\tto man's own shortcomings. As far as the trouble is\\n\\t\\t\\t\\tconcerned, the revelation is meant to give a warning, so\\n\\t\\t\\t\\tthat persecutors may be reclaimed, (and of course for men\\n\\t\\t\\t\\tof faith it is comfort and consolation, though that point\\n\\t\\t\\t\\tdoes not arise in this context)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "5",
    "NoteID": "2536",
    "Body": "Cf. x. 3. n. 1386. If things seem to be wrong in our\\n\\t\\t\\t\\timperfect vision on this earth, we must remember Allah,\\n\\t\\t\\t\\tWho encompasses all Creation and sits on the throne of\\n\\t\\t\\t\\tGrace and Mercy, is in command, and our Faith tells us\\n\\t\\t\\t\\tthat all must be right. Allah's authority is not like an\\n\\t\\t\\t\\tauthority on earth, which may be questioned, or which may\\n\\t\\t\\t\\tnot last. His authority is \"firmly established\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "6",
    "NoteID": "2537",
    "Body": "An exhaustive definition of everything we can conceive\\n\\t\\t\\t\\tof-what is in the heavens, on the earth, or between, or\\n\\t\\t\\t\\twithin the bowels of the earth."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "7",
    "NoteID": "2538",
    "Body": "There are two or three implications. (1) Whatever you\\n\\t\\t\\t\\tprofess, or say aloud, gives no information to Allah: He\\n\\t\\t\\t\\tknows not only what is secret and perhaps unknown to\\n\\t\\t\\t\\tothers, but what people take special care to conceal. (2)\\n\\t\\t\\t\\tIt does you no good to make insincere professions: your\\n\\t\\t\\t\\thidden motives are known to Him, Who alone matters. (3)\\n\\t\\t\\t\\tIf you read the Word of Allah, or if you pray to Allah,\\n\\t\\t\\t\\tit is not necessary to raise your voice: in either case,\\n\\t\\t\\t\\tAllah will judge you by your inner thoughts which are\\n\\t\\t\\t\\tlike an open book to Him."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "8",
    "NoteID": "2539",
    "Body": "Cf. xvii. 110 and n. 2322. Allah is The One and the most\\n\\t\\t\\t\\tbeautiful things we can think of are referable to Him.\\n\\t\\t\\t\\tHis names refer to His attributes which are like titles\\n\\t\\t\\t\\tof Honour and Glory."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "9",
    "NoteID": "2540",
    "Body": "The story of Moses in its different incidents is told in\\n\\t\\t\\t\\tmany places in the Qur-an, and in each case the phase\\n\\t\\t\\t\\tmost appropriate in the context is referred to or\\n\\t\\t\\t\\temphasised. In ii. 49-61, it was a phase from the\\n\\t\\t\\t\\treligious history of mankind; in vii. 103-162, it was a\\n\\t\\t\\t\\tphase from the story of the Ummat (or nation) of Israel,\\n\\t\\t\\t\\tand the story was continued to the times after Moses, in\\n\\t\\t\\t\\txvii. 101-103, we have a picture of the decline of a soul\\n\\t\\t\\t\\tin the arrogance of Pharaoh; here, in xx. 9-24, we have a\\n\\t\\t\\t\\tpicture of the rise of a soul in the commission given to\\n\\t\\t\\t\\tMoses from Allah; in xx. 25-36, we have his spiritual\\n\\t\\t\\t\\trelationship with his brother Aaron; in xx. 37-40, we\\n\\t\\t\\t\\thave his spiritual relation with his mother and sister,\\n\\t\\t\\t\\tand his upbringing; in xx. 41-76, we have his spiritual\\n\\t\\t\\t\\tcombat with Pharaoh; and in xx. 77-98, we have his\\n\\t\\t\\t\\tspiritual combat with his own people, the Israelites. For\\n\\t\\t\\t\\tother incidents, consult the Index."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "10",
    "NoteID": "2541",
    "Body": "A fire: It appeared like an ordinary fire, which always\\n\\t\\t\\t\\tbetokens the presence of men in a desert or a lonely\\n\\t\\t\\t\\tplace. Moses made for it alone, to fetch the wherewithal\\n\\t\\t\\t\\tfor making a fire for his family, and perhaps to find\\n\\t\\t\\t\\tsome direction as to the way, from the people he should\\n\\t\\t\\t\\tmeet there. But it was not an ordinary fire. It was a\\n\\t\\t\\t\\tBurning Bush: a Sign of the Glory of Allah."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "10",
    "NoteID": "2542",
    "Body": "The spiritual history of Moses begins here. It was the\\n\\t\\t\\t\\tbeginning of his mission. His physical life, infancy, and\\n\\t\\t\\t\\tupbringing are referred to later on, to illustrate\\n\\t\\t\\t\\tanother point. Moses, when he grew up, left the palace of\\n\\t\\t\\t\\tPharaoh and went to the Midianite people, in the Sinai\\n\\t\\t\\t\\tpeninsula. He married among them, and was now travelling\\n\\t\\t\\t\\twith his family, when he was called to his mission by\\n\\t\\t\\t\\tAllah. He went to look for a fire for comfort and\\n\\t\\t\\t\\tguidance. He found a higher and holier comfort and\\n\\t\\t\\t\\tguidance. The whole passage is full of portent meaning,\\n\\t\\t\\t\\twhich is reflected in the short rhymed verses in the\\n\\t\\t\\t\\toriginal."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "12",
    "NoteID": "2543",
    "Body": "The shoes are to be put off as a mark of respect. Moses\\n\\t\\t\\t\\twas now to put away his mere worldly interests, he having\\n\\t\\t\\t\\tbeen chosen by Allah, the Most High."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "12",
    "NoteID": "2544",
    "Body": "This was the valley just below Mount Sinai, where\\n\\t\\t\\t\\tsubsequently he was to receive the Torah."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "15",
    "NoteID": "2545",
    "Body": "The first need is to mend our lives and worship and serve\\n\\t\\t\\t\\tAllah, as in the last verse. The next is to realise the\\n\\t\\t\\t\\tmeaning of the Hereafter, when every soul will get the\\n\\t\\t\\t\\tmeed of its conduct in this life."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "15",
    "NoteID": "2546",
    "Body": "Ukhfi may mean either \"keep it hidden\", or \"make it\\n\\t\\t\\t\\tmanifest\", and the Commentators have taken, some one\\n\\t\\t\\t\\tmeaning and some the other. If the first is taken, it\\n\\t\\t\\t\\tmeans that the exact hour or day when the Judgment comes\\n\\t\\t\\t\\tis hidden from man; if the second, it means that the fact\\n\\t\\t\\t\\tof the Judgment to come is made known, that man may\\n\\t\\t\\t\\tremember and take warning. I think that both meanings are\\n\\t\\t\\t\\timplied."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "16",
    "NoteID": "2547",
    "Body": "Moses had yet to meet the formidable opposition of the\\n\\t\\t\\t\\tarrogant, Pharaoh and his proud Egyptians, and latter,\\n\\t\\t\\t\\tthe rebellion of his own people. In receiving his\\n\\t\\t\\t\\tcommission, he is warned of both dangers. This relates to\\n\\t\\t\\t\\tman's own soul: when once the light reaches him, let him\\n\\t\\t\\t\\thold fast to it lest he perish. He will be beset with\\n\\t\\t\\t\\tdangers of all kinds around him...the worst will be the\\n\\t\\t\\t\\tdanger of unbelieving people who seem to thrive on their\\n\\t\\t\\t\\tselfishness and in following their own vain desires!"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "18",
    "NoteID": "2548",
    "Body": "Now comes the miracle of the rod. First of all, the\\n\\t\\t\\t\\tattention of Moses himself is drawn to it, and he thinks\\n\\t\\t\\t\\tof the ordinary uses to which he puts it in his daily\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "20",
    "NoteID": "2549",
    "Body": "Cf. vii. 107, where a different word (thu'ban) is used\\n\\t\\t\\t\\tfor \"snake\", and the qualifying adjective is \"plain (for\\n\\t\\t\\t\\tall to see)\". The scene there is before Pharaoh and his\\n\\t\\t\\t\\tmagicians and people: the object is to show the\\n\\t\\t\\t\\thollowness of their magic by a miracle: the rod appears\\n\\t\\t\\t\\tbefore them as a long and creeping writhing serpent. Here\\n\\t\\t\\t\\tthere is a sign to present Allah's power to Moses's mind\\n\\t\\t\\t\\tand understanding: the rod becomes a Haiy (a live snake),\\n\\t\\t\\t\\tand its active motion is what is most to be impressed on\\n\\t\\t\\t\\tthe mind of Moses, for there were no other spectators."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "22",
    "NoteID": "2550",
    "Body": "The second of the greater Miracles shown to Moses was the\\n\\t\\t\\t\\t\"White (shining) Hand\". Ordinarily, when the skin becomes\\n\\t\\t\\t\\twhite, it is a sign of disease, leprosy or something\\n\\t\\t\\t\\tloathsome. Here there was no question of disease: on the\\n\\t\\t\\t\\tcontrary, the hand was glorified, and it shone as with a\\n\\t\\t\\t\\tdivine light. Such a miracle was beyond Egyptian or human\\n\\t\\t\\t\\tmagic."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "24",
    "NoteID": "2551",
    "Body": "Moses, having been spiritually prepared now gets his\\n\\t\\t\\t\\tdefinite commission to go to Pharaoh and point out the\\n\\t\\t\\t\\terror of his ways. So inordinate was Pharaoh's vanity\\n\\t\\t\\t\\tthat he had it in his mind to say: \"I am your Lord Most\\n\\t\\t\\t\\tHigh!\" (lxxix. 24)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "25",
    "NoteID": "2552",
    "Body": "The breast is reputed to be the seat of knowledge and\\n\\t\\t\\t\\taffections. The gift of the highest spiritual insight is\\n\\t\\t\\t\\twhat he prays for first. Cf. xciv. 1. This was the most\\n\\t\\t\\t\\turgent in point of time. There are three other things he\\n\\t\\t\\t\\talso asks for: viz. (1) Allah's help in his task, which\\n\\t\\t\\t\\tat first appears difficult to him, (2) the gift of\\n\\t\\t\\t\\teloquence, and the removal of the impediment from his\\n\\t\\t\\t\\tspeech; and (3) the counsel and constant attendance with\\n\\t\\t\\t\\thim of his brother Aaron, whom he loved and trusted, for\\n\\t\\t\\t\\the would otherwise be alone among the Egyptians."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "27",
    "NoteID": "2553",
    "Body": "Literally, \"Loosen a knot from my tongue\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "31",
    "NoteID": "2554",
    "Body": "Literally, \"Strengthen my back with him\". A man's\\n\\t\\t\\t\\tstrength lies in his back and backbone so that he can\\n\\t\\t\\t\\tstand erect and boldly face his tasks."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "33",
    "NoteID": "2555",
    "Body": "The requests that Moses makes are inspired, not by\\n\\t\\t\\t\\tearthly but by spiritual motives. The motive, expressed\\n\\t\\t\\t\\tin the most general terms, is to glorify Allah, not in an\\n\\t\\t\\t\\toccasional way, but systematically and continuously,\\n\\t\\t\\t\\t\"without stint\". \"The clauses in this verse and the next,\\n\\t\\t\\t\\ttaken together, govern all the requests he makes, from\\n\\t\\t\\t\\tverse 25 to verse 32."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "35",
    "NoteID": "2556",
    "Body": "The celebration of Allah's praise and remembrance is one\\n\\t\\t\\t\\tform of showing gratitude on the part of Moses for the\\n\\t\\t\\t\\tGrace which Allah has bestowed upon him."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "38",
    "NoteID": "2557",
    "Body": "The story is not told, but only those salient points\\n\\t\\t\\t\\trecapitulated which bear on the upbringing and work of\\n\\t\\t\\t\\tMoses. Long after the age of Joseph, who had been a Wazir\\n\\t\\t\\t\\tto one of the Pharaohs, there came on the throne of Egypt\\n\\t\\t\\t\\ta Pharaoh who hated the Israelites and wanted them\\n\\t\\t\\t\\tannihilated. He ordered Israelite male children to be\\n\\t\\t\\t\\tkilled when they were born. Moses's mother hid him for a\\n\\t\\t\\t\\ttime, but when further concealment was impossible, a\\n\\t\\t\\t\\tthought came into her mind that she should put her child\\n\\t\\t\\t\\tinto a chest and send the chest floating down the Nile.\\n\\t\\t\\t\\tThis was not merely a foolish fancy of hers. It was\\n\\t\\t\\t\\tAllah's Plan to bring up Moses in all the learning of the\\n\\t\\t\\t\\tEgyptians, in order that that learning itself should be\\n\\t\\t\\t\\tused to expose what was wrong in it and to advance the\\n\\t\\t\\t\\tglory of Allah. The chest was floated into the river\\n\\t\\t\\t\\tNile. It flowed on into a stream that passed through\\n\\t\\t\\t\\tPharaoh's Garden. It was picked up by Pharaoh's people\\n\\t\\t\\t\\tand the child was adopted by Pharaoh's wife. See xxviii.\\n\\t\\t\\t\\t4-13."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "39",
    "NoteID": "2558",
    "Body": "Pharaoh was an enemy to Allah, because he was puffed up\\n\\t\\t\\t\\tand he blasphemed, claiming to be God himself. He was an\\n\\t\\t\\t\\tenemy to the child Moses, because he hated the Israelites\\n\\t\\t\\t\\tand wanted to have their male children killed; also\\n\\t\\t\\t\\tbecause Moses stood for Allah's revelation to come."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "39",
    "NoteID": "2559",
    "Body": "Allah made the child comely and lovable, and he attracted\\n\\t\\t\\t\\tthe love of the very people who, on general grounds,\\n\\t\\t\\t\\twould have killed him."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "39",
    "NoteID": "2560",
    "Body": "See n. 2558 above. By making the child Moses so\\n\\t\\t\\t\\tattractive as to be adopted into Pharaoh's household, not\\n\\t\\t\\t\\tonly was Moses brought up in the best way possible from\\n\\t\\t\\t\\tan earthly point of view, but Allah's special Providence\\n\\t\\t\\t\\tlooked after him in bringing his mother to him, as stated\\n\\t\\t\\t\\tin the next verse, and thus nourishing him on his\\n\\t\\t\\t\\tmother's milk and keeping him in touch with his family."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "NoteID": "2561",
    "Body": "We may suppose that the anxious mother, after the child\\n\\t\\t\\t\\twas floated on the water, sent the child's sister to\\n\\t\\t\\t\\tfollow the chest from the bank and see where and by whom\\n\\t\\t\\t\\tit was picked up. When it was picked up by Pharaoh's own\\n\\t\\t\\t\\tfamily and they seemed to love the child, she appeared\\n\\t\\t\\t\\tlike a stranger before them, and said, \"Shall I search\\n\\t\\t\\t\\tout a good wet-nurse for the child, that she may rear the\\n\\t\\t\\t\\tchild you are going to adopt?\" That was exactly what they\\n\\t\\t\\t\\twanted. She ran home and told her mother. The mother was\\n\\t\\t\\t\\tdelighted to come and fold the infant in her arms again\\n\\t\\t\\t\\tand feed it at her own breast, and all openly and without\\n\\t\\t\\t\\tany concealment."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "NoteID": "2562",
    "Body": "The mother's eyes had, we may imagine, been sore with\\n\\t\\t\\t\\tscalding tears at the separation from her baby. Now they\\n\\t\\t\\t\\twere cooled: a phrase meaning that her heart was\\n\\t\\t\\t\\tcomforted."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "NoteID": "2563",
    "Body": "Years passed. The child grew up. In outward learning he\\n\\t\\t\\t\\twas of the house of Pharaoh. In his inner soul and\\n\\t\\t\\t\\tsympathy he was of Israel. One day, he went to the\\n\\t\\t\\t\\tIsraelite colony and saw all the Egyptian oppression\\n\\t\\t\\t\\tunder which Israel laboured. He saw an Egyptian smiting\\n\\t\\t\\t\\tan Israelite, apparently with impunity. Moses felt\\n\\t\\t\\t\\tbrotherly sympathy and smote the Egyptian. He did not\\n\\t\\t\\t\\tintend to kill him, but in fact the Egyptian died of the\\n\\t\\t\\t\\tblow. When this became known, his position in Pharaoh's\\n\\t\\t\\t\\thousehold became impossible. So he fled out of Egypt, and\\n\\t\\t\\t\\twas only saved by Allah's grace. He fled to the Sinai\\n\\t\\t\\t\\tPeninsula, to the land of the Midianites, and had various\\n\\t\\t\\t\\tadventures. He married one of the daughters of the\\n\\t\\t\\t\\tMidianite chief, and lived with the Medianites for many\\n\\t\\t\\t\\tyears, as an Egyptian stranger. He had many trials and\\n\\t\\t\\t\\ttemptations, but he retained his integrity of character."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "40",
    "NoteID": "2564",
    "Body": "See last note. After many years spent in a quiet life,\\n\\t\\t\\t\\tgrazing his father-in-law's flocks, he came one day to\\n\\t\\t\\t\\tthe valley of Tuwa underneath the great mountain mass of\\n\\t\\t\\t\\tSinai, called Tur (in Arabic). The peak on the Arabian\\n\\t\\t\\t\\tside (where Moses was) was called Horeb by the Hebrews.\\n\\t\\t\\t\\tThen was fulfilled Allah's Plan: he saw the fire in the\\n\\t\\t\\t\\tdistance, and when he went up, he was addressed by Allah\\n\\t\\t\\t\\tand chosen to be Allah's Messenger for that age."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "42",
    "NoteID": "2565",
    "Body": "We may suppose that Moses had fled alone to the land of\\n\\t\\t\\t\\tMidian, and that he had now come alone (with his family\\n\\t\\t\\t\\tbut not with his brother) to Tuwa, as described in n.\\n\\t\\t\\t\\t2542 above. When he was honoured with his mission, and\\n\\t\\t\\t\\twas granted his request that his brother Aaron should\\n\\t\\t\\t\\taccompany him, we may suppose that he took steps to get\\n\\t\\t\\t\\tAaron to come to him, and their meeting was in Tuwa. Some\\n\\t\\t\\t\\ttime may be supposed to have elapsed before they were in\\n\\t\\t\\t\\tEgypt, and then they prayed, and received these\\n\\t\\t\\t\\tdirections in their Egyptian home. Aaron was either an\\n\\t\\t\\t\\telder or a younger brother, we are not told which. In\\n\\t\\t\\t\\teither case he was born when the ban on Israelite\\n\\t\\t\\t\\tnew-born babes was not in operation. Moses had been out\\n\\t\\t\\t\\tof touch with him, and it speaks greatly for his family\\n\\t\\t\\t\\taffection that he remembered him and prayed for his\\n\\t\\t\\t\\tcomradeship in the most serious spiritual work of his\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "43",
    "NoteID": "2566",
    "Body": "Their mission was in the first instance to Pharaoh and to\\n\\t\\t\\t\\tthe Egyptians, and then to lead Israel out of Egypt."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "43",
    "NoteID": "2567",
    "Body": "Compare the same phrase in xx. 24. Having glanced at the\\n\\t\\t\\t\\tearly life of Moses we come back now to the time when\\n\\t\\t\\t\\tMoses's actual ministry begins. The earlier personal\\n\\t\\t\\t\\tstory of Moses is rounded off."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "44",
    "NoteID": "2568",
    "Body": "So far Pharaoh in his inordinate vanity had forgotten\\n\\t\\t\\t\\thimself and forgotten how small a creature he was before\\n\\t\\t\\t\\tAllah. This was to be brought to his recollection, so\\n\\t\\t\\t\\tthat he might perhaps repent and believe, or at least be\\n\\t\\t\\t\\tdeterred by fear from \"transgressing all bounds\". Some\\n\\t\\t\\t\\tmen eschew wrong from sincere love of Allah and\\n\\t\\t\\t\\tunderstanding of their fellow-men, and some (of coarser\\n\\t\\t\\t\\tminds) from the fear of consequences. Even the latter\\n\\t\\t\\t\\tconduct may be a step to the former."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "45",
    "NoteID": "2569",
    "Body": "They were now in Egypt (see n. 2565 above) and therefore\\n\\t\\t\\t\\tin the power of the Pharaoh. The local atmosphere called\\n\\t\\t\\t\\tfor the greatest courage and firmness on their part to\\n\\t\\t\\t\\tcarry out the dangerous mission which had been entrusted\\n\\t\\t\\t\\tto them."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "47",
    "NoteID": "2570",
    "Body": "The Children of Israel were subjected to all sorts of\\n\\t\\t\\t\\toppression and indignities. They were given hard tasks;\\n\\t\\t\\t\\ttheir leaders were unjustly beaten; they were forced to\\n\\t\\t\\t\\tmake bricks without straw; and they \"groaned in bondage\"\\n\\t\\t\\t\\t(Exod. v. 6-19. vi. 5)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "47",
    "NoteID": "2571",
    "Body": "Allah, in His infinite Mercy, always offers Peace to the\\n\\t\\t\\t\\tmost hardened sinners, even those who are warring against\\n\\t\\t\\t\\tHim. But, as stated in the next verse, their defiance\\n\\t\\t\\t\\tcannot go on with impunity indefinitely. The punishment\\n\\t\\t\\t\\tmust inevitably come for sin, whether the sinner is great\\n\\t\\t\\t\\tor small."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "49",
    "NoteID": "2572",
    "Body": "Notice how subtly Pharaoh rejects the implication in\\n\\t\\t\\t\\tMoses's speech, in which Moses had referred to \"thy Lord\"\\n\\t\\t\\t\\t(verse 47). Pharaoh implicitly repudiates the suggestion\\n\\t\\t\\t\\tthat the God who had sent Moses and Aaron could possibly\\n\\t\\t\\t\\tbe Pharaoh's Lord. He asks insolently, \"Who is this Lord\\n\\t\\t\\t\\tof yours, of Whom ye speak as having sent you?\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "50",
    "NoteID": "2573",
    "Body": "The answer of Moses is straightforward, dignified, and\\n\\t\\t\\t\\tilluminating. He will not dispute about \"my Lord\" or\\n\\t\\t\\t\\t\"your Lord,\" the God of Israel, or the God of Egypt. He\\n\\t\\t\\t\\tand his brother were proud to serve \"our Lord,\" but He\\n\\t\\t\\t\\twas the universal Lord and Cherisher, the One and Only\\n\\t\\t\\t\\tGod, Who had created all beings and all things. It was\\n\\t\\t\\t\\tfrom Him that each created thing derived its form and\\n\\t\\t\\t\\tnature, including such free-will and power as man had\\n\\t\\t\\t\\tgot. He, Pharaoh, was subject to the same condition. In\\n\\t\\t\\t\\torder that the free-will should be rightly exercised,\\n\\t\\t\\t\\tAllah had given guidance through His Messengers, and His\\n\\t\\t\\t\\tSigns. Moses and Aaron stood as such Messengers, with\\n\\t\\t\\t\\tsuch Signs. Will Pharaoh now understand and do right?"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "51",
    "NoteID": "2574",
    "Body": "But Pharaoh was not the man to accept teaching from the\\n\\t\\t\\t\\tdespised Israelite-one, too, who in his eyes was a\\n\\t\\t\\t\\trenegade from the higher Egyptian civilisation. \"If,\" he\\n\\t\\t\\t\\tsays in effect, \"there is only one God, to Whom all\\n\\t\\t\\t\\tthings are referred, this is a new religion. What of the\\n\\t\\t\\t\\treligion of our ancestors? Were they wrong in worshipping\\n\\t\\t\\t\\tthe Egyptian gods? And if they were wrong, are they in\\n\\t\\t\\t\\tmisery now? He wanted to trap Moses into a scathing\\n\\t\\t\\t\\tdenunciation of his ancestors, which would at once have\\n\\t\\t\\t\\tdeprived him of the sympathy or the hearing of the\\n\\t\\t\\t\\tEgyptian crowd."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "52",
    "NoteID": "2575",
    "Body": "Moses did not fall into the trap. He remembered the\\n\\t\\t\\t\\tinjunction given to him to speak mildly (xx. 44). He\\n\\t\\t\\t\\tspeaks mildly, but does not in any way whittle down the\\n\\t\\t\\t\\ttruth. He said in effect: 'Allah's knowledge is perfect,\\n\\t\\t\\t\\tas if, with men, it were a record. For men may make\\n\\t\\t\\t\\tmistakes or may not remember, but Allah never mistakes\\n\\t\\t\\t\\tand never forgets. But Allah is not only All-Knowing: He\\n\\t\\t\\t\\tis also All-Good. Look around you: the whole earth is\\n\\t\\t\\t\\tspread out like a carpet. Men go to and fro in it freely.\\n\\t\\t\\t\\tHe sends abundance of water from the skies, which comes\\n\\t\\t\\t\\tdown in Nile floods and fertilises the whole soil of\\n\\t\\t\\t\\tEgypt, and feeds men and animals.'"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "53",
    "NoteID": "2576",
    "Body": "Sabil means not only a road, but would include\\n\\t\\t\\t\\twater-roads or channels, and in modern conditions,\\n\\t\\t\\t\\tairways-in fact all means of communication."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "53",
    "NoteID": "2577",
    "Body": "This seems to be outside the speech of Moses, and\\n\\t\\t\\t\\tconnects itself with the following verses 54-56, as part\\n\\t\\t\\t\\tof the Word of Allah, expanding the speech of Moses and\\n\\t\\t\\t\\texplaining the working of Allah's Providence in nature."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "53",
    "NoteID": "2578",
    "Body": "Azwaj: we might translate here (as in xv. 88) by\\n\\t\\t\\t\\t\"classes\" instead of \"pairs\"; but as sex in plants seems\\n\\t\\t\\t\\tto be referred to elsewhere (see xiii. 3, and n. 1804), I\\n\\t\\t\\t\\ttranslate \"pairs\"."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "55",
    "NoteID": "2579",
    "Body": "The verse ought really to go into the last Section."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "56",
    "NoteID": "2580",
    "Body": "This is a sort of general introduction to the\\n\\t\\t\\t\\tconfrontation between Moses and Pharaoh. The Signs are\\n\\t\\t\\t\\tnot only the countering of the fraudulent magic of Egypt\\n\\t\\t\\t\\twith real miracles, but the subsequent Plagues (not\\n\\t\\t\\t\\tmentioned here) and the Crossing of the Red Sea by\\n\\t\\t\\t\\tIsrael."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "57",
    "NoteID": "2581",
    "Body": "The Egyptians accused Moses of a design to deprive them\\n\\t\\t\\t\\tof their land, and of exercising black magic. Both\\n\\t\\t\\t\\tcharges were palpably false. What Moses wanted to do was\\n\\t\\t\\t\\tto free his people from bondage. The Egyptians had all\\n\\t\\t\\t\\tthe power in their possession. As to magic, the Egyptians\\n\\t\\t\\t\\tjudged Moses by themselves. They accused the Prophet of\\n\\t\\t\\t\\tAllah of doing the same, though both his outlook and the\\n\\t\\t\\t\\tsource of his strength were altogether different."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "58",
    "NoteID": "2582",
    "Body": "Suwan: literally, 'equal, even'. It has been construed to\\n\\t\\t\\t\\tmean: (1) a place equally distant for both sides, a\\n\\t\\t\\t\\tcentral place, or (2) equally convenient to both sides,\\n\\t\\t\\t\\tor (3) an open level plain, where the people can collect\\n\\t\\t\\t\\twith ease. All these are possible meanings, but the one I\\n\\t\\t\\t\\thave adopted is more comprehensive, and includes the\\n\\t\\t\\t\\tothers, viz.: (4) a place where both sides shall have\\n\\t\\t\\t\\teven chances. \"a fair place,\" as Palmer loconically\\n\\t\\t\\t\\ttranslates it."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "59",
    "NoteID": "2583",
    "Body": "A great day of a Temple Festival, when the temples and\\n\\t\\t\\t\\tstreets were decorated, and people were on holiday, free\\n\\t\\t\\t\\tfrom work. Moses makes this appointment in order to\\n\\t\\t\\t\\tcollect as large a number as possible, for his first duty\\n\\t\\t\\t\\tis to preach the Truth. And he apparently did it with\\n\\t\\t\\t\\tsome effect with some Egyptians (xx. 70, 72-76), though\\n\\t\\t\\t\\tthe Pharaoh and his high and mighty officers rejected the\\n\\t\\t\\t\\tTruth and afterwards paid the Penality."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "60",
    "NoteID": "2584",
    "Body": "Pharaoh was apparently taken aback at Moses appointing a\\n\\t\\t\\t\\tsolemn day of public Festival, when there would be a\\n\\t\\t\\t\\tlarge concourse and there would be sure to be some people\\n\\t\\t\\t\\tnot in the Court clique, who might be critical of\\n\\t\\t\\t\\tPharaoh's own sorcerers. But probably there was something\\n\\t\\t\\t\\tmore in their dark counsels, something unfair and wicked,\\n\\t\\t\\t\\tto which Moses refers in his speech in the next verse."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "61",
    "NoteID": "2585",
    "Body": "Moses had some idea of their trickery and deceit. They\\n\\t\\t\\t\\twould palm off their fraudulent magic as coming from\\n\\t\\t\\t\\tAllah or from their gods! He warns them that their tricks\\n\\t\\t\\t\\twill stand exposed, and their hopes will be defeated."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "62",
    "NoteID": "2586",
    "Body": "They knew that they had here to deal with no ordinary\\n\\t\\t\\t\\tman, but a man with powers above what they could conceive\\n\\t\\t\\t\\tof. But evil always thinks evil. Judging Moses and Aaron\\n\\t\\t\\t\\tby their own standards, they thought that these two were\\n\\t\\t\\t\\talso tricksters, with some tricks superior to their own.\\n\\t\\t\\t\\tAll they had to do was to stand together, and they must\\n\\t\\t\\t\\twin. I construe xx. 63-64 to be private talk among\\n\\t\\t\\t\\tthemselves, followed by their open challenge to Moses in\\n\\t\\t\\t\\txx. 65."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "63",
    "NoteID": "2587",
    "Body": "Cf. xx. 104. 'Your most cherished institutions,'\\n\\t\\t\\t\\ti.e.,'your ancestral and time-honoured religion and\\n\\t\\t\\t\\tmagic'. Muthla, feminine of Amthal, most distinguished,\\n\\t\\t\\t\\thonoured, cherished. Tariqat=way of life, institutions,\\n\\t\\t\\t\\tconduct."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "64",
    "NoteID": "2588",
    "Body": "Presumably Pharaoh was in this secret conference, and he\\n\\t\\t\\t\\tpromises the most lavish rewards to the magicians if they\\n\\t\\t\\t\\tovercome Moses. See vii. 114. That-but I think more than\\n\\t\\t\\t\\tthat-is implied. That day was to be the crisis: if they\\n\\t\\t\\t\\twon then, they would win all along, and Moses and his\\n\\t\\t\\t\\tpeople would be crushed."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "66",
    "NoteID": "2589",
    "Body": "Their bag of tricks was so clever that it imposed upon\\n\\t\\t\\t\\tall beholders. Their ropes and their rods were thrown,\\n\\t\\t\\t\\tand seemed to move about like snakes. So realistic was\\n\\t\\t\\t\\tthe effect that even Moses felt the least bit of doubt in\\n\\t\\t\\t\\this own mind. He of course had no tricks, and he relied\\n\\t\\t\\t\\tentirely on Allah."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "67",
    "NoteID": "2590",
    "Body": "The concerted attack of evil is sometimes so well\\n\\t\\t\\t\\tcontrived from all points that falsehood appears and is\\n\\t\\t\\t\\tacclaimed as the truth. The believer of truth is\\n\\t\\t\\t\\tisolated, and a sort of moral dizziness creeps over his\\n\\t\\t\\t\\tmind. But by Allah's grace Faith asserts itself, gives\\n\\t\\t\\t\\thim confidence, and points out the specific truths which\\n\\t\\t\\t\\twill dissipate and destroy the teeming brood of\\n\\t\\t\\t\\tfalsehood."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "69",
    "NoteID": "2591",
    "Body": "The meaning may be either (1) that falsehood and trickery\\n\\t\\t\\t\\tmay have their day, but they cannot win everywhere,\\n\\t\\t\\t\\tespecially in the presence of Truth, or (2) that trickery\\n\\t\\t\\t\\tand magic must come to an evil end."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "70",
    "NoteID": "2592",
    "Body": "Cf. this passage with vii. 120-126 and the notes thereon."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "71",
    "NoteID": "2593",
    "Body": "Pharaoh accuses his sorcerers who have been converted, of\\n\\t\\t\\t\\thaving been in league with Moses all the time, and in\\n\\t\\t\\t\\tfact of having been led and taught by him! So arrogance\\n\\t\\t\\t\\tand evil cannot conceive of Allah's worlds and worlds of\\n\\t\\t\\t\\tbeauty and truth beyond its own narrow vision! It is\\n\\t\\t\\t\\ttruly blind and its very cleverness deludes it to wander\\n\\t\\t\\t\\tfar from the truth."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "72",
    "NoteID": "2594",
    "Body": "Clear Signs: the miracles, the personality of the\\n\\t\\t\\t\\tMessengers of Allah, the logic of events as they unfolded\\n\\t\\t\\t\\tthemselves, and the light of inner conviction in their\\n\\t\\t\\t\\town conscience. There are in addition the Signs and\\n\\t\\t\\t\\tProofs of Allah in nature, which are referred to in many\\n\\t\\t\\t\\tplaces, e.g., xx. 53-54."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "72",
    "NoteID": "2595",
    "Body": "Thus was the first part of the mission of Moses-that to\\n\\t\\t\\t\\tthe Egyptians-fulfilled. See n. 1083 to vii. 126."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "73",
    "NoteID": "2596",
    "Body": "The magic mummery, and deceptions which pertained to\\n\\t\\t\\t\\tEgyptian Pagan religion became a creed, a State article\\n\\t\\t\\t\\tof faith, to which all citizens were compelled to bow,\\n\\t\\t\\t\\tand which its priests were compelled actively to\\n\\t\\t\\t\\tpractise. And Pharaoh was at the head of the whole\\n\\t\\t\\t\\tsystem-the high priest or the supreme god. With justice,\\n\\t\\t\\t\\ttherefore, do the converted magicians lay the blame on\\n\\t\\t\\t\\tPharaoh, effectively negativing Pharaoh's disingenuous\\n\\t\\t\\t\\tcharge that they had been in league with Moses. These\\n\\t\\t\\t\\tfalsehoods and deceptions-combined in many cases with\\n\\t\\t\\t\\thorrid cruelties, open and secret,-were common to many\\n\\t\\t\\t\\tPagan systems. Some of them have been investigated in\\n\\t\\t\\t\\tdetail in Sir John G. Frazer' Golden Bough."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "74",
    "NoteID": "2597",
    "Body": "The verses xx. 74-76 are best construed as comments on\\n\\t\\t\\t\\tthe story of the converted Egyptians who had \"purified\\n\\t\\t\\t\\tthemselves (from evil)\". But some construe them as a\\n\\t\\t\\t\\tcontinuation of their speech."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "76",
    "NoteID": "2598",
    "Body": "As the Egyptian magicians had done when they confessed\\n\\t\\t\\t\\tthe One True God."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "77",
    "NoteID": "2599",
    "Body": "Time passes, and at last Moses is commanded to leave\\n\\t\\t\\t\\tEgypt with his people by night. They were to cross the\\n\\t\\t\\t\\tRed Sea into the Sinai Peninsula. They were told to have\\n\\t\\t\\t\\tno fear of Pharaoh or of the sea or of the unknown desert\\n\\t\\t\\t\\tcountry of Sinai into which they were going. They crossed\\n\\t\\t\\t\\tdry-shod, while Pharaoh who came in pursuit with his\\n\\t\\t\\t\\ttroops was overwhelmed by the sea. He and his men all\\n\\t\\t\\t\\tperished. There is no emphasis on this episode here. But\\n\\t\\t\\t\\tthe emphasis is laid on the hard task which Moses had\\n\\t\\t\\t\\twith his own people after he had delivered them from the\\n\\t\\t\\t\\tEgyptian bondage."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "79",
    "NoteID": "2600",
    "Body": "It is the duty of kings and leaders to give the right\\n\\t\\t\\t\\tlead of their people. Instead of that, the evil ones\\n\\t\\t\\t\\tamong them lead them astray and are the cause of the\\n\\t\\t\\t\\twhole of the people perishing."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "80",
    "NoteID": "2601",
    "Body": "Right side: Cf. xix. 52, and n. 2504, towards the end.\\n\\t\\t\\t\\tThe Arabian side of Sinai (Jabal Musa) was the place\\n\\t\\t\\t\\twhere Moses first received his commission before going to\\n\\t\\t\\t\\tEgypt, and also where he received the Torah after the\\n\\t\\t\\t\\tExodus from Egypt."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "81",
    "NoteID": "2602",
    "Body": "Cf. ii. 57 and n. 71; and vii. 160. I should like to\\n\\t\\t\\t\\tconstrue this not only literally but also metaphorically.\\n\\t\\t\\t\\t'Allah has looked after you and saved you. He has given\\n\\t\\t\\t\\tyou ethical and spiritual guidance. Enjoy the fruits of\\n\\t\\t\\t\\tall this, but do not become puffed up and rebellious\\n\\t\\t\\t\\t(another meaning in the root Taga); otherwise the Wrath\\n\\t\\t\\t\\tof Allah is sure to descend on you.'"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "81",
    "NoteID": "2603",
    "Body": "This gives the key-note to Moses's constant tussle with\\n\\t\\t\\t\\this own people, and introduces immediately afterwards the\\n\\t\\t\\t\\tincident of the golden calf."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "83",
    "NoteID": "2604",
    "Body": "This was when Moses was up on the Mount for forty days\\n\\t\\t\\t\\tand forty nights: ii. 51, and n. 66. Moses had left the\\n\\t\\t\\t\\telders of Israel with Aaron behind him: Exod. xxiv. 14.\\n\\t\\t\\t\\tWhile he was in a state of ecstatic honour on the Mount,\\n\\t\\t\\t\\this people were enacting strange scenes down below. They\\n\\t\\t\\t\\twere tested and tried, and they failed in the trial. They\\n\\t\\t\\t\\tmade a golden calf for worship, as described below. See\\n\\t\\t\\t\\talso vii. 148-150 and notes."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "85",
    "NoteID": "2605",
    "Body": "Who was this Samiri? If it was his personal name, it was\\n\\t\\t\\t\\tsufficiently near the meaning of the original root-word\\n\\t\\t\\t\\tto have the definite article attached to it: Cf. the name\\n\\t\\t\\t\\tof the Khalifa Mu'tasim (Al-Mu'tasim). What was the root\\n\\t\\t\\t\\tfor \"Samiri\"? If we look to old Egyptian, we have\\n\\t\\t\\t\\tShemer=A stranger, foreigner (Sir E.A. Wallis Budge's\\n\\t\\t\\t\\tEgyptian Hieroglyphic Dictionary, 1920,p. 815 b). As the\\n\\t\\t\\t\\tIsraelites had just left Egypt, they might quite well\\n\\t\\t\\t\\thave among them an Egyptianised Hebrew bearing that\\n\\t\\t\\t\\tnickname. That the name Shemer was subsequently not\\n\\t\\t\\t\\tunknown among the Hebrews is clear from the Old\\n\\t\\t\\t\\tTestament. In I Kings, xvi. 21 we read that Omri, king of\\n\\t\\t\\t\\tIsrael, the northern portion of the divided kingdom, who\\n\\t\\t\\t\\treigned about 903-896 B.C., built a new city, Samaria, on\\n\\t\\t\\t\\ta hill which he bought from Shemer, the owner of the\\n\\t\\t\\t\\thill, for two talents of silver. See also Renan: History\\n\\t\\t\\t\\tof Israel, ii. 210. For a further discussion of the word,\\n\\t\\t\\t\\tsee n. 2608 below."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "86",
    "NoteID": "2606",
    "Body": "There are two promises referred to in this verse, the\\n\\t\\t\\t\\tpromise of Allah and the promise of the people of Israel.\\n\\t\\t\\t\\tThey form one Convenant, which was entered into through\\n\\t\\t\\t\\ttheir leader Moses. See xx. 80, and ii. 63, n. 78.\\n\\t\\t\\t\\tAllah's promise was to protect them and lead them to the\\n\\t\\t\\t\\tPromised Land, and their promise was to obey Allah's Law\\n\\t\\t\\t\\tand His commandments."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "87",
    "NoteID": "2607",
    "Body": "Cf. Exod. xii. 35-36: the Israelites, before they left\\n\\t\\t\\t\\tEgypt, borrowed from the Egyptians \"jewels of silver and\\n\\t\\t\\t\\tjewels of gold, and raiment\"; and \"they spoiled the\\n\\t\\t\\t\\tEgyptians\" i.e., stripped them of all their valuable\\n\\t\\t\\t\\tjewellery. Note that the answer of the backsliders is\\n\\t\\t\\t\\tdisingenuous in various ways. (1) The Samiri was no doubt\\n\\t\\t\\t\\tresponsible for suggesting the making of the golden calf,\\n\\t\\t\\t\\tbut they could not on that account disclaim\\n\\t\\t\\t\\tresponsibility for themselves: the burden of the sin is\\n\\t\\t\\t\\ton him who commits it, and he cannot pretend that he was\\n\\t\\t\\t\\tpowerless to avoid it. (2) At most the weight of the gold\\n\\t\\t\\t\\tthey carried could not have been heavy even if one or two\\n\\t\\t\\t\\tmen carried it, but would have been negligible if\\n\\t\\t\\t\\tdistributed. (3) Gold is valuable, and it is not likely\\n\\t\\t\\t\\tthat if they wanted to disburden themselves of it, they\\n\\t\\t\\t\\thad any need to light a furnace, melt it, and cast it\\n\\t\\t\\t\\tinto the shape of a calf."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "87",
    "NoteID": "2608",
    "Body": "See n. 2605 about the Samiri. If the Egyptian origin of\\n\\t\\t\\t\\tthe root is not accepted we have a Hebrew origin in\\n\\t\\t\\t\\t\"Shomer\" a guard, watchman, sentinel. The Samiri may have\\n\\t\\t\\t\\tbeen a watchman, in fact or by nickname."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "88",
    "NoteID": "2609",
    "Body": "See. n. 1113 to vii. 148, where the same words are used\\n\\t\\t\\t\\tand explained."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "88",
    "NoteID": "2610",
    "Body": "See n. 1114 to vii. 148."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "88",
    "NoteID": "2611",
    "Body": "Moses has forgotten: i.e., 'forgotten both us and his\\n\\t\\t\\t\\tgod. He has been gone for so many days. He is searching\\n\\t\\t\\t\\tfor a god on the Mount when his god is really here!' This\\n\\t\\t\\t\\tis spoken by the Samiri and his partisans, but the people\\n\\t\\t\\t\\tas a whole accepted it, and it therefore, becomes their\\n\\t\\t\\t\\tspeech."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "89",
    "NoteID": "2612",
    "Body": "This is a parenthetical comment. How blind the people\\n\\t\\t\\t\\twere! They had seen Signs of the true living God, and yet\\n\\t\\t\\t\\tthey were willing to worship this dead image! The true\\n\\t\\t\\t\\tliving God had spoken in definite words of command, while\\n\\t\\t\\t\\tthis calf could only emit some sounds of lowing, which\\n\\t\\t\\t\\twere themselves contrived by the fraud of the priests.\\n\\t\\t\\t\\tThis image could do neither good nor harm, while Allah\\n\\t\\t\\t\\twas the Cherisher and Sustainer of the Universe, Whose\\n\\t\\t\\t\\tMercy was unbounded and Whose Wrath was terrible."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "90",
    "NoteID": "2613",
    "Body": "\"Resist this temptation: you are being tested in this. Do\\n\\t\\t\\t\\tnot follow after the semi-Egyptian Samiri, but obey me.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "90",
    "NoteID": "2614",
    "Body": "The Bible story makes Aaron the culprit, which is\\n\\t\\t\\t\\tinconsistent with his office as the high priest of Allah\\n\\t\\t\\t\\tand the right hand of Moses. See n. 1116 to vii. 150. Our\\n\\t\\t\\t\\tversion is more consistent, and explains in the Samiri\\n\\t\\t\\t\\tthe lingering influences of the Egyptian cult of Osiris\\n\\t\\t\\t\\tthe bull-god."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "91",
    "NoteID": "2615",
    "Body": "Obviously Aaron's speech in the last verse, and the\\n\\t\\t\\t\\trebels' defiance in this verse, were spoken before the\\n\\t\\t\\t\\treturn of Moses from the Mount."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "91",
    "NoteID": "2616",
    "Body": "The rebels had so little faith that they had given Moses\\n\\t\\t\\t\\tup for lost, and never expected to see him again."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "93",
    "NoteID": "2617",
    "Body": "Moses, when he came back, was full of anger and grief.\\n\\t\\t\\t\\tHis speech to Aaron is one of rebuke, and he was also\\n\\t\\t\\t\\tinclined to handle him roughly: see next verse. The order\\n\\t\\t\\t\\the refers to is that stated in vii. 142, \"Act for me\\n\\t\\t\\t\\tamongst my people: do right, and follow not the way of\\n\\t\\t\\t\\tthose who do mischief.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "94",
    "NoteID": "2618",
    "Body": "Cf. vii. 150."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "94",
    "NoteID": "2619",
    "Body": "This reply of Aaron's is in no way inconsistent with the\\n\\t\\t\\t\\treply as noted in vii. 150. On the contrary there is a\\n\\t\\t\\t\\tdramatic aptness in the different points emphasised on\\n\\t\\t\\t\\teach occasion. In S. vii. we were discussing the Ummat of\\n\\t\\t\\t\\tIsrael, and Aaron rightly says, \"The people did indeed\\n\\t\\t\\t\\treckon me as naught, and went near to slay me!\" In\\n\\t\\t\\t\\taddition, \"Let not the enemies rejoice over my\\n\\t\\t\\t\\tmisfortune\" he is referring by implication to his\\n\\t\\t\\t\\tbrother's wish to maintain unity among the peopic. Here\\n\\t\\t\\t\\tthe unity is the chief point to emphasise: we are dealing\\n\\t\\t\\t\\twith the Samiri as mischief-monger, and he could best be\\n\\t\\t\\t\\tdealt with by Moses, who proceeds to do so."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "95",
    "NoteID": "2620",
    "Body": "Moses now turns to the Samiri, and the Samiri's reply in\\n\\t\\t\\t\\tthe next verse sums up his character in a few wonderful\\n\\t\\t\\t\\tstrokes of character-painting. The lesson of the whole of\\n\\t\\t\\t\\tthis episode is the fall of a human soul that nominally\\n\\t\\t\\t\\tcomes to Allah's Truth in a humble position but makes\\n\\t\\t\\t\\tmischief when and as it finds occasion. It is no less\\n\\t\\t\\t\\tdangerous and culpable than the arrogant soul, typified\\n\\t\\t\\t\\tby Pharaoh, which gets into high places and makes its\\n\\t\\t\\t\\tleadership the cause of ruin of a whole nation."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "96",
    "NoteID": "2621",
    "Body": "This answer of the Samiri is a fine example of unblushing\\n\\t\\t\\t\\teffrontery, careful evasion of issues, and invented\\n\\t\\t\\t\\tfalsehoods. He takes upon himself to pretend that he had\\n\\t\\t\\t\\tfar more insight than anybody else: he saw what the crowd\\n\\t\\t\\t\\tdid not see. He saw something supernatural. \"The\\n\\t\\t\\t\\tMessenger\" is construed by many Commentators to mean the\\n\\t\\t\\t\\tangel Gabriel. Rasul (plural, rusul) is used in several\\n\\t\\t\\t\\tplaces for \"angels\" e.g., in xi. 69, 77; xix. 19; and\\n\\t\\t\\t\\txxxv. 1. But if we take it to mean the Messenger Moses,\\n\\t\\t\\t\\tit means that the Samiri saw something sacred or\\n\\t\\t\\t\\tsupernatural in his footprints: perhaps he thinks a\\n\\t\\t\\t\\tlittle flattery would make Moses forgive him. The dust\\n\\t\\t\\t\\tbecame sacred, and his throwing it into the calf made the\\n\\t\\t\\t\\tcalf utter a lowing sound! As if that was the point at\\n\\t\\t\\t\\tissue! He does not answer the charge of making an image\\n\\t\\t\\t\\tfor worship. But finally, with arrogant effrontery, he\\n\\t\\t\\t\\tsays, \"Well, that is what my soul suggested to me, and\\n\\t\\t\\t\\tthat should be enough!\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "97",
    "NoteID": "2622",
    "Body": "He and his kind were to become social lepers,\\n\\t\\t\\t\\tuntouchables; perhaps also sufficiently arrogant to hold\\n\\t\\t\\t\\tothers at arm's length, and say \"Noli me tangere\" (touch\\n\\t\\t\\t\\tme not) ."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "97",
    "NoteID": "2623",
    "Body": "Namely, the promised Wrath of Allah: see xx. 81. lxxxix.\\n\\t\\t\\t\\t25."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "97",
    "NoteID": "2624",
    "Body": "The cast effigy was destroyed. Thus ends the Samiri's\\n\\t\\t\\t\\tstory, of which the lessons are indicated in n. 2620\\n\\t\\t\\t\\tabove. It may be interesting to pursue the\\n\\t\\t\\t\\ttransformations of the word Samiri in later times. For\\n\\t\\t\\t\\tits origin see notes 2605 and 2608 above. Whether the\\n\\t\\t\\t\\troot of Samiri was originally Egyptian or Hebrew does not\\n\\t\\t\\t\\taffect the later history. Four facts may be noted. (1)\\n\\t\\t\\t\\tThere was a man bearing a name of that kind at the time\\n\\t\\t\\t\\tof Moses, and he led a revolt against Moses and was\\n\\t\\t\\t\\tcursed by Moses. (2) In the time of King Omri (903-896\\n\\t\\t\\t\\tB.C.) of the northern kingdom of Israel, there was a man\\n\\t\\t\\t\\tcalled Shemer, from whom, according to the Bible, was\\n\\t\\t\\t\\tbought a hill on which was built the new capital of the\\n\\t\\t\\t\\tkingdom, the town of Samaria. (3) The name of the hill\\n\\t\\t\\t\\twas Shomer (= watchman, vigilant guardian), and that form\\n\\t\\t\\t\\tof the name also appears as the name of a man (see II\\n\\t\\t\\t\\tKings xii. 21); some authorities think the town was\\n\\t\\t\\t\\tcalled after the hill and not after the man (Hastings's\\n\\t\\t\\t\\tEncyclopaedia of Religion and Ethics), but this is for\\n\\t\\t\\t\\tour present purposes immaterial. (4) There was and is a\\n\\t\\t\\t\\tdissenting community of Israelites called Samaritans, who\\n\\t\\t\\t\\thave their own separate Pentateuch and Targum, who claim\\n\\t\\t\\t\\tto be the true Children of Israel, and who hold the\\n\\t\\t\\t\\tOrthodox Jews in contempt as the latter hold them in\\n\\t\\t\\t\\tcontempt; they claim to be the true guardians (Shomerim)\\n\\t\\t\\t\\tof the Law, and that is probably the true origin of the\\n\\t\\t\\t\\tname Samaritan, which may go further back in time than\\n\\t\\t\\t\\tthe foundation of the town of Samaria. I think it\\n\\t\\t\\t\\tprobable that the schism originated from the time of\\n\\t\\t\\t\\tMoses, and that the curse of Moses on the Samiri explains\\n\\t\\t\\t\\tthe position."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "99",
    "NoteID": "2625",
    "Body": "Thus superseding previous revelations; for this (the\\n\\t\\t\\t\\tQur-an) is direct from Allah, and is not a second-hand\\n\\t\\t\\t\\texposition on other men's authority."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "101",
    "NoteID": "2626",
    "Body": "Cf. vi. 31. If people are so immersed in the evanescent\\n\\t\\t\\t\\tfalsehoods of this life as to turn away from the True and\\n\\t\\t\\t\\tthe Eternal, they will have a rude awakening when the\\n\\t\\t\\t\\tJudgment comes. These very things that they thought so\\n\\t\\t\\t\\tenjoyable here-taking advantage of others, material\\n\\t\\t\\t\\tself-indulgence, nursing grievances instead of doing\\n\\t\\t\\t\\tgood, etc., etc.,-will be a grievous burden to them that\\n\\t\\t\\t\\tday, which they will not be able to escape or lighten."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "102",
    "NoteID": "2627",
    "Body": "Zurq=having eyes different from the normal colour, which\\n\\t\\t\\t\\tin the East is black and white; having blue eyes, or eyes\\n\\t\\t\\t\\tafflicted with dimness or blindness, or squint; hence\\n\\t\\t\\t\\tmataphorically, blear-eyed (with terror)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "103",
    "NoteID": "2628",
    "Body": "Faced with eternity they will realise that their life on\\n\\t\\t\\t\\tthis earth, or the interval between their sin and their\\n\\t\\t\\t\\tpunishment, had a duration which practically amounted to\\n\\t\\t\\t\\tnothing. They express this by the phrase \"ten days\", but\\n\\t\\t\\t\\ttheir wiser heads think that even this is an\\n\\t\\t\\t\\tover-estimate. It was but a brief day!"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "104",
    "NoteID": "2629",
    "Body": "Cf. xx. 63 and n. 2587. Note that it is the shrewdest and\\n\\t\\t\\t\\tmost versed in Life who will say this, because they will\\n\\t\\t\\t\\tbe the first to see the true situation."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "105",
    "NoteID": "2630",
    "Body": "In the last verse, it was the deceptiveness and\\n\\t\\t\\t\\trelativity of Time that was dealt with. Here we come to\\n\\t\\t\\t\\tthe question of space, solidity, bulk. The question was\\n\\t\\t\\t\\tactually put to the holy Prophet: what will become of the\\n\\t\\t\\t\\tsolid Mountains, or in the English phrase, \"the eternal\\n\\t\\t\\t\\thills\"? They are no more substantial than anything else\\n\\t\\t\\t\\tin this temporal world. When the \"new world\", (xiii. 5)\\n\\t\\t\\t\\tof which Unbelievers doubted, is actually in being, the\\n\\t\\t\\t\\tmountains will cease to exist. We can imagine the scene\\n\\t\\t\\t\\tof judgment as a level plain, in which there are no ups\\n\\t\\t\\t\\tand downs and no places of concealment. All is straight\\n\\t\\t\\t\\tand level, without corners, mysteries, or lurking doubts."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "105",
    "NoteID": "2631",
    "Body": "The one word nasafa carries the ideas of (1) tearing up\\n\\t\\t\\t\\tby the roots, (2) scattering like chaff or dust, and (3)\\n\\t\\t\\t\\twinnowing. Its twofold repetition here intensifies its\\n\\t\\t\\t\\tmeaning."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "108",
    "NoteID": "2632",
    "Body": "The Caller: the angel whose voice will call and direct\\n\\t\\t\\t\\tall souls."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "108",
    "NoteID": "2633",
    "Body": "A beautiful personification of hushed Sound. First there\\n\\t\\t\\t\\tis the loud blast of the Trumpet. Then there is the\\n\\t\\t\\t\\tstillness and hush of awe and reverence: only the tramp\\n\\t\\t\\t\\tof the ranks marching along will be heard."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "109",
    "NoteID": "2634",
    "Body": "Cf. ii. 255 in the Verse of the Throne. Here man is in\\n\\t\\t\\t\\tthe accusative case governed by tanfa'u, and it is better\\n\\t\\t\\t\\tto construe as I have done. That is, intercession will\\n\\t\\t\\t\\tbenefit no one except those for whom Allah has granted\\n\\t\\t\\t\\tpermission, and whose word (of repentance) is true and\\n\\t\\t\\t\\tsincere, and therefore acceptable to Allah. Others\\n\\t\\t\\t\\tconstrue: no intercession will avail, except by those to\\n\\t\\t\\t\\twhom Allah has granted permission, and whose word (of\\n\\t\\t\\t\\tintercession) is acceptable to Allah. In that case the\\n\\t\\t\\t\\ttwo distinct clauses have no distinct meanings."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "110",
    "NoteID": "2635",
    "Body": "Cf.ii. 255 and n. 297. The slight difference in\\n\\t\\t\\t\\tphraseology (which I have tried to preserve in the\\n\\t\\t\\t\\tTranslation) will be understood as a beauty when we\\n\\t\\t\\t\\treflect that here our attention is directed to the Day of\\n\\t\\t\\t\\tJudgment, and in ii. 255 the wording is general, and\\n\\t\\t\\t\\tapplies to our present state also."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "111",
    "NoteID": "2636",
    "Body": "The metaphor of the burden of sin which the unjust carry\\n\\t\\t\\t\\ton their backs is referred to in xx. 100-101 (see n.\\n\\t\\t\\t\\t2626), in vi. 31, and in other passages. Note that all\\n\\t\\t\\t\\tfaces, those of the just as well as of the unjust, will\\n\\t\\t\\t\\tbe humble before Allah: the best of us can claim no merit\\n\\t\\t\\t\\tequal to Allah's Grace. But the just will have Hope:\\n\\t\\t\\t\\twhile the unjust, now that the curtain of Reality has\\n\\t\\t\\t\\trisen, will be in absolute Despair!"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "112",
    "NoteID": "2637",
    "Body": "See the last note. Unlike the unjust, the righteous, who\\n\\t\\t\\t\\thave come with Faith, will now find their Faith\\n\\t\\t\\t\\tjustified: not only will they be free from any fear of\\n\\t\\t\\t\\tharm, but they will be rewarded to the full, or, as has\\n\\t\\t\\t\\tbeen said in other passages, where His bounty rather than\\n\\t\\t\\t\\tHis justice is emphasised, they will get more than their\\n\\t\\t\\t\\tdue reward (iii. 27; xxxix. 10)."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "113",
    "NoteID": "2638",
    "Body": "The Qur-an is in clear Arabic, so that even an unlearned\\n\\t\\t\\t\\tpeople like the Arabs might understand and profit by its\\n\\t\\t\\t\\twarnings, and the rest of the world may learn through\\n\\t\\t\\t\\tthem, as they did in the first few centuries of Islam and\\n\\t\\t\\t\\tmay do again when we Muslims show ourselves worthy to\\n\\t\\t\\t\\texplain and exemplify its meaning. The evil are warned\\n\\t\\t\\t\\tthat they may repent; the good are confirmed in their\\n\\t\\t\\t\\tFaith and strengthened by their remembrance of Him."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "114",
    "NoteID": "2639",
    "Body": "Allah is above every human event or desire. His purpose\\n\\t\\t\\t\\tis universal. But He is the Truth, the absolute Truth;\\n\\t\\t\\t\\tand His kingdom is the true kingdom, that can carry out\\n\\t\\t\\t\\tits will. That Truth unfolds itself gradually, as it did\\n\\t\\t\\t\\tin the gradual revelation of the Qur-an to the holy\\n\\t\\t\\t\\tProphet. But even after it was completed in a volume, its\\n\\t\\t\\t\\ttrue meaning and purpose only gradually unfold themselves\\n\\t\\t\\t\\tto any given individual or nation. No one should be\\n\\t\\t\\t\\timpatient about it. On the contrary, we should always\\n\\t\\t\\t\\tpray for increase in our own knowledge, which can never\\n\\t\\t\\t\\tat any given moment be complete."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "115",
    "NoteID": "2640",
    "Body": "The spiritual fall of two individual souls, Pharaoh and\\n\\t\\t\\t\\tthe Samiri, having been referred to, the one through\\n\\t\\t\\t\\toverweening arrogance, and the other through a spirit of\\n\\t\\t\\t\\tmischief and false harking back to the past, our\\n\\t\\t\\t\\tattention is now called to the prototype of Evil (satan)\\n\\t\\t\\t\\twho tempted Adam, the original Man, and to the fact that\\n\\t\\t\\t\\tthough man was clearly warned that satan is his enemy and\\n\\t\\t\\t\\twill only effect his ruin, he showed so little firmness\\n\\t\\t\\t\\tthat he succumbed to it at once at the first opportunity."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "117",
    "NoteID": "2641",
    "Body": "See last note. The story is referred to in order to draw\\n\\t\\t\\t\\tattention to man's folly in rushing into the arms of\\n\\t\\t\\t\\tsatan though he had been clearly forewarned."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "118",
    "NoteID": "2642",
    "Body": "Not only had the warning been given that satan is an\\n\\t\\t\\t\\tenemy to man and will effect his destruction, but it was\\n\\t\\t\\t\\tclearly pointed out that all his needs were being met in\\n\\t\\t\\t\\tthe Garden of Happiness. Food and clothing, drink and\\n\\t\\t\\t\\tshelter, were amply provided for."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "120",
    "NoteID": "2643",
    "Body": "The suggestion of satan is clever, as it always is: it is\\n\\t\\t\\t\\tfalse, and at the same time plausible. It is false,\\n\\t\\t\\t\\tbecause (1) that felicity was not temporary, like the\\n\\t\\t\\t\\tlife of this world, and (2) they were supreme in the\\n\\t\\t\\t\\tGarden, and a \"kingdom\" such as was dangled before them\\n\\t\\t\\t\\twould only add to their sorrows. It was plausible,\\n\\t\\t\\t\\tbecause (1) nothing had been said to them about Eternity,\\n\\t\\t\\t\\tas the opposite of Eternity was not yet known, and (2)\\n\\t\\t\\t\\tthe sweets of Power arise from the savour of Self, and\\n\\t\\t\\t\\tSelf is an alluring (if false) attraction that misleads\\n\\t\\t\\t\\tthe Will."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "121",
    "NoteID": "2644",
    "Body": "Hitherto they knew no evil. Now, when disobedience to\\n\\t\\t\\t\\tAllah had sullied their soul and torn off the garment,\\n\\t\\t\\t\\ttheir sullied Self appeared to themselves in all its\\n\\t\\t\\t\\tnakedness and ugliness, and they had to resort to\\n\\t\\t\\t\\texternal things (leaves of the Garden) to cover the\\n\\t\\t\\t\\tshame."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "121",
    "NoteID": "2645",
    "Body": "Adam had been given the will to choose, and he chose\\n\\t\\t\\t\\twrong, and was about to be lost when Allah's Grace came\\n\\t\\t\\t\\tto his aid. His repentance was accepted, and Allah chose\\n\\t\\t\\t\\thim for His Mercy, as stated in the next verse."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "123",
    "NoteID": "2646",
    "Body": "The little variations between this passage and ii. 38 are\\n\\t\\t\\t\\tinstructive, as showing how clearly the particular\\n\\t\\t\\t\\targument is followed in each case. Here ihbita ('get ye\\n\\t\\t\\t\\tdown') is in the dual number, and refers to the two\\n\\t\\t\\t\\tindividual souls, our common ancestors."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "123",
    "NoteID": "2647",
    "Body": "For the same reason as in the last note, we have here the\\n\\t\\t\\t\\tconsequences of Guidance to the individual, viz.: being\\n\\t\\t\\t\\tsaved from going astray or from falling into misery and\\n\\t\\t\\t\\tdespair. In ii. 38, the consequences expressed, though\\n\\t\\t\\t\\tthey apply to the individual, are also appropriate taken\\n\\t\\t\\t\\tcollectively: \"on them shall be no fear, nor shall they\\n\\t\\t\\t\\tgrieve.\""
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "124",
    "NoteID": "2648",
    "Body": "Again, as in the last two verses, there is a variation\\n\\t\\t\\t\\tfrom the previous passage (ii. 39). The consequences of\\n\\t\\t\\t\\tthe rejection of Allah's guidance are here expressed more\\n\\t\\t\\t\\tindividually: a life narrowed down, and a blindness that\\n\\t\\t\\t\\twill persist beyond this life. \"A life narrowed down\" has\\n\\t\\t\\t\\tmany implications: (1) it is a life from which all the\\n\\t\\t\\t\\tbeneficent influences of Allah's wide world are excluded;\\n\\t\\t\\t\\t(2) in looking exclusively to the \"good things\" of this\\n\\t\\t\\t\\tlife, it misses the true Reality."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "125",
    "NoteID": "2649",
    "Body": "Because Allah gave him physical sight in this life for\\n\\t\\t\\t\\ttrial, he thinks he should be favoured in the real world,\\n\\t\\t\\t\\tthe world that matters! He misused his physical sight and\\n\\t\\t\\t\\tmade himself blind for the other world."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "126",
    "NoteID": "2650",
    "Body": "'You were deliberately blind to Allah's Signs: now you\\n\\t\\t\\t\\twill not see Allah's favours, and will be excluded from\\n\\t\\t\\t\\tHis Grace.'"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "127",
    "NoteID": "2651",
    "Body": "Blindness in the world of enduring Reality is far worse\\n\\t\\t\\t\\tthan physical blindness in the world of probation."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "128",
    "NoteID": "2652",
    "Body": "Cf. xx. 54. This phrase concluded the argument of Moses\\n\\t\\t\\t\\twith Pharaoh about Pharaoh's blindness to Allah and the\\n\\t\\t\\t\\tSigns of Allah. Now it concludes the more general\\n\\t\\t\\t\\targument about men, concerning whom the saying arose:\\n\\t\\t\\t\\t'none are so blind as those who will not sec.'"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "129",
    "NoteID": "2653",
    "Body": "Cf. x. 19 and n. 1407; also xi. 110. In Allah's holy plan\\n\\t\\t\\t\\tand Purpose, there is a wise adjustment of all interests,\\n\\t\\t\\t\\tand a merciful chance and respite given to all, the\\n\\t\\t\\t\\tunjust as well as the just, and His decree or word\\n\\t\\t\\t\\tabides. The most wicked have a term appointed for them\\n\\t\\t\\t\\tfor respite. Had it not been so, the punishment must\\n\\t\\t\\t\\tnecessarily have descended on them immediately for their\\n\\t\\t\\t\\tevil deeds."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "130",
    "NoteID": "2654",
    "Body": "All good men must be patient with what seems to them evil\\n\\t\\t\\t\\taround them. That does not mean that they should sit\\n\\t\\t\\t\\tstill and do nothing to destroy evil; for the fight\\n\\t\\t\\t\\tagainst evil is one of the cardinal points in Islam. What\\n\\t\\t\\t\\tthey are told is that they must not be impatient: they\\n\\t\\t\\t\\tmust pray to Allah and commune with Him, so that their\\n\\t\\t\\t\\tpatience and faith may be strengthened, and they may be\\n\\t\\t\\t\\table the better to grapple with evil. For they thus not\\n\\t\\t\\t\\tonly get strength in this world but pleasure of Allah in\\n\\t\\t\\t\\tthe Hereafter as well."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "130",
    "NoteID": "2655",
    "Body": "Taraf, plural atraf, may mean sides, ends, extremities.\\n\\t\\t\\t\\tIf the day be compared to a tubular figure standing\\n\\t\\t\\t\\terect, the top and bottom are clearly marked, but the\\n\\t\\t\\t\\tsides are not so clearly marked: they would be atraf\\n\\t\\t\\t\\t(plural), not tarafain (dual). Now the prayer before\\n\\t\\t\\t\\tsunrise is clearly Fajr; that before sunset is Asr: \"part\\n\\t\\t\\t\\tof the hours of the night\" would indicate Magrib (early\\n\\t\\t\\t\\tnight, just after sunset), and Isha, before going to bed.\\n\\t\\t\\t\\tThere is left Zuhr, which is in the indefinite side or\\n\\t\\t\\t\\tmiddle of the day : it may be soon after the sun's\\n\\t\\t\\t\\tdecline from noon, but there is considerable latitude\\n\\t\\t\\t\\tabout the precise hour. The majority of Commentators\\n\\t\\t\\t\\tinterpret in favour of the five Canonical prayers, and\\n\\t\\t\\t\\tsome include optional prayers. But I think the words are\\n\\t\\t\\t\\teven more comprehensive. A good man's life is all one\\n\\t\\t\\t\\tsweet Song of Praise to Allah."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "131",
    "NoteID": "2656",
    "Body": "The good things of this life make a brave show, but they\\n\\t\\t\\t\\tare as nothing compared with the good of the Hereafter.\\n\\t\\t\\t\\tBoth are provided by Allah. But the former are given to\\n\\t\\t\\t\\tthe just and the unjust as a test and trial, and in any\\n\\t\\t\\t\\tcase will pass away; while the latter come specially from\\n\\t\\t\\t\\tAllah for His devoted servants, and are incomparably of\\n\\t\\t\\t\\tmore value and will last through eternity."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "132",
    "NoteID": "2657",
    "Body": "Sustenance, in the sense of the ordinary needs of life,\\n\\t\\t\\t\\tthe man of Allah does not worry about. That is provided\\n\\t\\t\\t\\tby Allah for all, the just and the unjust. But the\\n\\t\\t\\t\\tspecial provision, the Real Sustenance, the spiritual\\n\\t\\t\\t\\tfruit, is for a righteous life in the service of Allah."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "133",
    "NoteID": "2658",
    "Body": "The question or plea of the Unbelievers is disingenuous.\\n\\t\\t\\t\\tMany Signs have come with this Revelation. But the one\\n\\t\\t\\t\\tthat should have appealed to those who believed in former\\n\\t\\t\\t\\trevelations and should have convinced them was what was\\n\\t\\t\\t\\tin their own books."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "134",
    "NoteID": "2659",
    "Body": "If the Sign mentioned in the last note did not convince\\n\\t\\t\\t\\tthem, it would mean that they were not true to their own\\n\\t\\t\\t\\tfaith. They were not straight with themselves. In justice\\n\\t\\t\\t\\tthey should have been punished for their falsehood. But\\n\\t\\t\\t\\tthey were given further respite. Or they would again have\\n\\t\\t\\t\\targued in a circle, and said: \"If only Allah had sent us\\n\\t\\t\\t\\ta living messenger we should have believed!\" The living\\n\\t\\t\\t\\tmessenger they flout because they want a Sign. The Sign\\n\\t\\t\\t\\tthey wish to ignore, because they want a living\\n\\t\\t\\t\\tmessenger!"
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "135",
    "NoteID": "2660",
    "Body": "If people will not be true to their own lights, what\\n\\t\\t\\t\\tfurther argument is left? The Prophet of Allah can only\\n\\t\\t\\t\\tsay: \"Let us wait the issue: my faith tells me that\\n\\t\\t\\t\\tAllah's Truth must prevail.\" Cf. ix. 52."
  },
  {
    "SurahNumber": "20",
    "AyahNumber": "135",
    "NoteID": "2661",
    "Body": "Cf. xix. 43. The straight and even Way must endure, and\\n\\t\\t\\t\\tshow that the man who follows it has received true\\n\\t\\t\\t\\tguidance. All falsehood and crookedness must ultimately\\n\\t\\t\\t\\tdisappear."
  }
]
