[
  {
    "Section": "Introducing Islam",
    "BookCode": "GIT",
    "SectionHead": "Islam and Muslims",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe name of this religion is Islam, the root of which is\\n\\t\\t\\t\\tSilm and Salam which means peace. Salam may also mean\\n\\t\\t\\t\\tgreeting one another with peace. One of the beautiful\\n\\t\\t\\t\\tnames of God is that He is the Peace. It means more than\\n\\t\\t\\t\\tthat: submission to the One God, and to live in peace\\n\\t\\t\\t\\twith the Creator, within one's self, with other people\\n\\t\\t\\t\\tand with the environment. Thus, Islam is a total system\\n\\t\\t\\t\\tof living. A Muslim is supposed to live in peace and\\n\\t\\t\\t\\tharmony with all these segments; hence, a Muslim is any\\n\\t\\t\\t\\tperson anywhere in the world whose obedience, allegiance,\\n\\t\\t\\t\\tand loyalty are to God, the Lord of the Universe.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introducing Islam",
    "BookCode": "GIT",
    "SectionHead": "Muslims and Arabs",
    "SecNoValue": "2",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe followers of Islam are called Muslims. Muslims are\\n\\t\\t\\t\\tnot to be confused with Arabs. Muslims may be Arabs,\\n\\t\\t\\t\\tTurks, Persians, Indians, Pakistanis, Malaysians,\\n\\t\\t\\t\\tIndonesians, Europeans, Africans, Americans, Chinese, or\\n\\t\\t\\t\\tother nationalities.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAn Arab could be a Muslim, a Christian, a Jew or an\\n\\t\\t\\t\\tatheist. Any person who adopts the Arabic language is\\n\\t\\t\\t\\tcalled an Arab. However, the language of the Qur'an (the\\n\\t\\t\\t\\tHoly Book of Islam) is Arabic. Muslims all over the world\\n\\t\\t\\t\\ttry to learn Arabic so that they may be able to read the\\n\\t\\t\\t\\tQur'an and understand its meaning. They pray in the\\n\\t\\t\\t\\tlanguage of the Qur'an, namely Arabic.\\tSupplications to\\n\\t\\t\\t\\tGod could be in any language.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWhile there are one billion Muslims in the world there\\n\\t\\t\\t\\tare about 200 million Arabs. Among them, approximately\\n\\t\\t\\t\\tten percent are not Muslims. Thus Arab Muslims constitute\\n\\t\\t\\t\\tonly about twenty percent of the Muslim population of the\\n\\t\\t\\t\\tworld.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introducing Islam",
    "BookCode": "GIT",
    "SectionHead": "Allah the One and the Only God",
    "SecNoValue": "3",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAllah is the name of the One and Only God. Allah has\\n\\t\\t\\t\\tninety-nine beautiful names, such as: The Gracious, The\\n\\t\\t\\t\\tMerciful, The Beneficent, The Creator, The All-Knowing,\\n\\t\\t\\t\\tThe All-Wise, The Lord of the Universe, The First, The\\n\\t\\t\\t\\tLast, and others.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe is the Creator of all human beings. He is the God for\\n\\t\\t\\t\\tthe Christians, the Jews, the Muslims, the Buddhists, the\\n\\t\\t\\t\\tHindus, the atheists, and others.  Muslims worship God\\n\\t\\t\\t\\twhose name is Allah. They put their trust in Him and they\\n\\t\\t\\t\\tseek His help and His guidance.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introducing Islam",
    "BookCode": "GIT",
    "SectionHead": "Muhammad",
    "SecNoValue": "4",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tMuhammad was chosen by God to deliver His Message of\\n\\t\\t\\t\\tPeace, namely Islam.  He was born in 570 C.E. (Common\\n\\t\\t\\t\\tEra) in Makkah, Arabia. He was entrusted with the Message\\n\\t\\t\\t\\tof Islam when he was at the age of forty years. The\\n\\t\\t\\t\\trevelation that he received is called the Qur'an, while\\n\\t\\t\\t\\tthe message is called Islam.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMuhammad is the very last Prophet of God to mankind. He\\n\\t\\t\\t\\tis the final Messenger of God. His message was and is\\n\\t\\t\\t\\tstill to the Christians, the Jews and the rest of\\n\\t\\t\\t\\tmankind. He was sent to those religious people to inform\\n\\t\\t\\t\\tthem about the true mission of Jesus, Moses, Jacob,\\n\\t\\t\\t\\tIsaac, and Abraham.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMuhammad is considered to be the summation and the\\n\\t\\t\\t\\tculmination of all the prophets and messengers that came\\n\\t\\t\\t\\tbefore him. He purified the previous messages from\\n\\t\\t\\t\\tadulteration and completed the Message of God for all\\n\\t\\t\\t\\thumanity. He was entrusted with the power of explaining,\\n\\t\\t\\t\\tinterpreting and living the teaching of the Qur'an.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introducing Islam",
    "BookCode": "GIT",
    "SectionHead": "Source of Islam",
    "SecNoValue": "5",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe legal sources of Islam are the Qur'an and the Hadith.\\n\\t\\t\\t\\tThe Qur'an is the exact word of God; its authenticity,\\n\\t\\t\\t\\toriginality and totality are intact.  The Hadith is the\\n\\t\\t\\t\\treport of the sayings, deeds and approvals of the Prophet\\n\\t\\t\\t\\tMuhammad. The Prophet's sayings and deeds are called\\n\\t\\t\\t\\tSunnah. The Seerah is the writings of followers of\\n\\t\\t\\t\\tMuhammad about the life of the Prophet. Hence, it is the\\n\\t\\t\\t\\tlife history of the Prophet Muhammad which provides\\n\\t\\t\\t\\texamples of daily living for Muslims.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introducing Islam",
    "BookCode": "GIT",
    "SectionHead": "Some Islamic Principles",
    "SecNoValue": "6",
    "SubSec": "NULL",
    "Text": "<ul><li>\\n\\t\\t\\t\\t\\tOneness of God: He is One and the Only One. He is\\n\\t\\t\\t\\t\\tnot two in one or three in one. This means that\\n\\t\\t\\t\\t\\tIslam rejects the idea of trinity or such a unity\\n\\t\\t\\t\\t\\tof God which implies more than one God in one.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tOneness of mankind: People are created equal in\\n\\t\\t\\t\\t\\tfront of the Law of God. There is no superiority\\n\\t\\t\\t\\t\\tfor one race over another. God made us of\\n\\t\\t\\t\\t\\tdifferent colors, nationalities, languages and\\n\\t\\t\\t\\t\\tbeliefs so as to test who is going to be better\\n\\t\\t\\t\\t\\tthan others. No one can claim that he is better\\n\\t\\t\\t\\t\\tthan others. It is only God Who knows who is\\n\\t\\t\\t\\t\\tbetter. It depends on piety and righteousness.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tOneness of Messengers and the Message: Muslims\\n\\t\\t\\t\\t\\tbelieve that God sent different messengers\\n\\t\\t\\t\\t\\tthroughout the history of mankind. All came with\\n\\t\\t\\t\\t\\tthe same message and the same teachings. It was\\n\\t\\t\\t\\t\\tthe people who misunderstood and misinterpreted\\n\\t\\t\\t\\t\\tthem. Muslims believe in Noah, Abraham, Isaac,\\n\\t\\t\\t\\t\\tIsmail, Jacob, Moses, David, Jesus, and Muhammad.\\n\\t\\t\\t\\t\\tThe Prophets of Christianity and Judaism are\\n\\t\\t\\t\\t\\tindeed the Prophets of Islam.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tAngels and the Day of Judgment: Muslims believe\\n\\t\\t\\t\\t\\tthat there are unseen creatures such as angels\\n\\t\\t\\t\\t\\tcreated by God in the universe for special\\n\\t\\t\\t\\t\\tmissions. Muslims believe that there is a Day of\\n\\t\\t\\t\\t\\tJudgment when all people of the world throughout\\n\\t\\t\\t\\t\\tthe history of mankind till the last day of life\\n\\t\\t\\t\\t\\ton earth, are to be brought for accounting,\\n\\t\\t\\t\\t\\treward and punishment.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tInnocence of Man at Birth: Muslim believe that\\n\\t\\t\\t\\t\\tpeople are born free of sin. It is only after\\n\\t\\t\\t\\t\\tthey reach the age of puberty and it is only\\n\\t\\t\\t\\t\\tafter they commit sins that they are to be\\n\\t\\t\\t\\t\\tcharged for their mistakes.  No one is\\n\\t\\t\\t\\t\\tresponsible for or can take the responsibility\\n\\t\\t\\t\\t\\tfor the sins of others. However, the door of\\n\\t\\t\\t\\t\\tforgiveness through true repentance is always\\n\\t\\t\\t\\t\\topen.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tState and Religion: Muslims believe that Islam is\\n\\t\\t\\t\\t\\ta total and a complete way of life. It\\n\\t\\t\\t\\t\\tencompasses all aspects of life. As such, the\\n\\t\\t\\t\\t\\tteachings of Islam do not separate religion from\\n\\t\\t\\t\\t\\tpolitics. As a matter of fact, state and religion\\n\\t\\t\\t\\t\\tare under the obedience of Allah through the\\n\\t\\t\\t\\t\\tteachings of Islam. Hence, economic and social\\n\\t\\t\\t\\t\\ttransactions, as well as educational and\\n\\t\\t\\t\\t\\tpolitical systems are also part of the teachings\\n\\t\\t\\t\\t\\tof Islam.\\n\\t\\t\\t\\t</li></ul>"
  },
  {
    "Section": "Introducing Islam",
    "BookCode": "GIT",
    "SectionHead": "Practices of Islam",
    "SecNoValue": "7",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tGod instructed the Muslims to practice what they believe\\n\\t\\t\\t\\tin. In Islam there are five pillars, namely:\\n\\t\\t\\t</p><ul><li>\\n\\t\\t\\t\\t\\tCreed (Shahada): The verbal commitment and pledge\\n\\t\\t\\t\\t\\tthat there is only One God and that Muhammad is\\n\\t\\t\\t\\t\\tthe Messenger of God, is considered to be the\\n\\t\\t\\t\\t\\tCreed of Islam.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tPrayers (Salat): The performance of the five\\n\\t\\t\\t\\t\\tdaily prayers is required of Muslims.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tFasting (Saum): Fasting is total abstinence from\\n\\t\\t\\t\\t\\tfood, liquids and intimate intercourse (between\\n\\t\\t\\t\\t\\tmarried couples) from dawn to sunset during the\\n\\t\\t\\t\\t\\tentire month of Ramadan.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tPurifying Tax (Zakat): This is an annual payment\\n\\t\\t\\t\\t\\tof a certain percentage of a Muslim's property\\n\\t\\t\\t\\t\\twhich is distributed among the poor or other\\n\\t\\t\\t\\t\\trightful beneficiaries.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tPilgrimage (Hajj): The performance of pilgrimage\\n\\t\\t\\t\\t\\tto Makkah is required once in a life time if\\n\\t\\t\\t\\t\\tmeans are available. Hajj is in part in memory of\\n\\t\\t\\t\\t\\tthe trials and tribulations of Prophet Abraham,\\n\\t\\t\\t\\t\\this wife Hagar and his eldest son Prophet\\n\\t\\t\\t\\t\\tIshmael.\\n\\t\\t\\t\\t</li></ul>"
  },
  {
    "Section": "Introducing Islam",
    "BookCode": "GIT",
    "SectionHead": "Other Related Aspects",
    "SecNoValue": "8",
    "SubSec": "NULL",
    "Text": "<ul><li>\\n\\t\\t\\t\\t\\tCalendar: Islamic practices are based on the\\n\\t\\t\\t\\t\\tlunar calendar. However, Muslims also use the\\n\\t\\t\\t\\t\\tGregorian calendar in their daily religious\\n\\t\\t\\t\\t\\tlives. Hence, the Islamic calendar includes both\\n\\t\\t\\t\\t\\tthe common era and the migration (Higra) year of\\n\\t\\t\\t\\t\\tthe Prophet of Islam from Makkah to Madinah in\\n\\t\\t\\t\\t\\tthe year of 623 C.E.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tCelebrations (Eid): Muslims have two celebrations\\n\\t\\t\\t\\t\\t(Eid); namely, Eid of Sacrifice and Eid of\\n\\t\\t\\t\\t\\tFast-Breaking. The Eid of Sacrifice is in\\n\\t\\t\\t\\t\\tremembrance of the sacrifice to be by Prophet\\n\\t\\t\\t\\t\\tAbraham of his son. The Eid of Fast-Breaking\\n\\t\\t\\t\\t\\tcomes at the end of the month of fasting,\\n\\t\\t\\t\\t\\tRamadan.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tDiets: Islam allows Muslims to eat everything\\n\\t\\t\\t\\t\\twhich is good for the health. It restricts\\n\\t\\t\\t\\t\\tcertain items such as pork and its by-products,\\n\\t\\t\\t\\t\\talcohol and any narcotic or addictive drugs.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tPlace of Worship: The place of worship is called\\n\\t\\t\\t\\t\\tMosque or Masjid.  There are three holy places of\\n\\t\\t\\t\\t\\tworship for the Muslims in the world.  These are:\\n\\t\\t\\t\\t\\tMosque of Kaaba in Makkah, Mosque of the Prophet\\n\\t\\t\\t\\t\\tMuhammad in Madinah, and Masjid Aqsa, adjacent to\\n\\t\\t\\t\\t\\tthe Dome of the Rock in Jerusalem. A Muslim may\\n\\t\\t\\t\\t\\tpray any where in the world whether in a Mosque,\\n\\t\\t\\t\\t\\ta house, an office, or outside. The whole world\\n\\t\\t\\t\\t\\tis a place of worship. It is preferable that\\n\\t\\t\\t\\t\\tMuslims pray in a congregation, however, he/she\\n\\t\\t\\t\\t\\tmay pray individually anywhere.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tHolidays: The holy day of the Muslims is Friday.\\n\\t\\t\\t\\t\\tIt is considered to be sacred and the Day of\\n\\t\\t\\t\\t\\tJudgment will take place on Friday. Muslims join\\n\\t\\t\\t\\t\\ttogether shortly after noon on Friday for the\\n\\t\\t\\t\\t\\tFriday congregational prayer in a Mosque. A\\n\\t\\t\\t\\t\\tleader (Imam) gives a sermon (Khutba) and leads\\n\\t\\t\\t\\t\\tthe congregational prayer.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tDistribution of Muslims in North America: There\\n\\t\\t\\t\\t\\tare approximately five million Muslims in North\\n\\t\\t\\t\\t\\tAmerica and are distributed in its major cities\\n\\t\\t\\t\\t\\tsuch as New York, Detroit, Boston, Toledo,\\n\\t\\t\\t\\t\\tChicago, Los Angeles, San Francisco, Houston,\\n\\t\\t\\t\\t\\tCedar Rapids (Iowa), Toronto, Montreal, Ottawa,\\n\\t\\t\\t\\t\\tEdmonton, Vancouver, Windsor, Winnipeg, Calgary,\\n\\t\\t\\t\\t\\tand others.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tContributions in North America: Muslims are not\\n\\t\\t\\t\\t\\testablished in North America. Sears Tower and the\\n\\t\\t\\t\\t\\tJohn Hancock buildings in Chicago were designed\\n\\t\\t\\t\\t\\tby a Muslim chief architect, originally from\\n\\t\\t\\t\\t\\tBangladesh.  Muslims have established academic\\n\\t\\t\\t\\t\\tinstitutions, community centers and\\n\\t\\t\\t\\t\\torganizations, schools and places of worship.\\n\\t\\t\\t\\t\\tThey live in peace and harmony among themselves\\n\\t\\t\\t\\t\\tand among other groups of people in the society.\\n\\t\\t\\t\\t\\tThe rate of crime among Muslims is very minimal.\\n\\t\\t\\t\\t\\tMuslims in North America are highly educated and\\n\\t\\t\\t\\t\\tthey have added to the success of American\\n\\t\\t\\t\\t\\tscientific and technological fields.\\n\\t\\t\\t\\t</li></ul><p>\\n\\t\\t\\t\\tThe Muslims of the early period of the Islamic era were\\n\\t\\t\\t\\tpioneers in medicine, chemistry, physics, geography,\\n\\t\\t\\t\\tnavigation, arts, poetry, mathematics, algebra,\\n\\t\\t\\t\\tlogarithms, calculus, etc. They contributed to the\\n\\t\\t\\t\\tRenaissance of Europe and world civilization.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introducing Islam",
    "BookCode": "GIT",
    "SectionHead": "Non-Muslims",
    "SecNoValue": "9",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tMuslims are required to respect all those who are\\n\\t\\t\\t\\tfaithful and God conscious people, namely those who\\n\\t\\t\\t\\treceived messages. Christians and Jews are called People\\n\\t\\t\\t\\tof the Book. Muslims are asked to call upon the People of\\n\\t\\t\\t\\tthe Book for common terms, namely, to worship One God,\\n\\t\\t\\t\\tand to work together for the solutions of the many\\n\\t\\t\\t\\tproblems in the society.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tChristians and Jews lived peacefully with Muslims\\n\\t\\t\\t\\tthroughout centuries in the Middle East and other Asian\\n\\t\\t\\t\\tand African countries. The second Caliph Umar, did not\\n\\t\\t\\t\\tpray in the church in Jerusalem so as not to give the\\n\\t\\t\\t\\tMuslims an excuse to take it over. Christians entrusted\\n\\t\\t\\t\\tthe Muslims, and as such the key of the Church in\\n\\t\\t\\t\\tJerusalem is still in the hands of the Muslims.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tJews fled from Spain during the Inquisition, and they\\n\\t\\t\\t\\twere welcomed by the Muslims. They settled in the heart\\n\\t\\t\\t\\tof the Islamic Caliphate. They enjoyed positions of power\\n\\t\\t\\t\\tand authority.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThroughout the Muslim world, churches, synagogues and\\n\\t\\t\\t\\tmissionary schools were built within the Muslim\\n\\t\\t\\t\\tneighborhoods. These places were protected by Muslims\\n\\t\\t\\t\\teven during the contemporary crises in the Middle East.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introduction to Islam",
    "BookCode": "GIT",
    "SectionHead": "The Meaning of Islam",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": "<p>\r\\n\\t\\t\\t\\tISLAM is derived from the Arabic root \"SALEMA\": peace,\r\\n\\t\\t\\t\\tpurity, submission and obedience. In the religious sense,\r\\n\\t\\t\\t\\tIslam means submission to the will of God and obedience\r\\n\\t\\t\\t\\tto His law.\r\\n\\t\\t\\t</p><p>\r\\n\\t\\t\\t\\tEverything and every phenomenon in the world, other than\r\\n\\t\\t\\t\\tman is administered TOTALLY by God-made laws i.e. they\r\\n\\t\\t\\t\\tare obedient to God and submissive to His laws i.e. they\r\\n\\t\\t\\t\\tare in the STATE OF ISLAM. Man possesses the quality of\r\\n\\t\\t\\t\\tintelligence and choice, thus he is invited to submit to\r\\n\\t\\t\\t\\tthe good will of God and obey His law ie. become a\r\\n\\t\\t\\t\\tMuslim. Submission to the good will of God, together with\r\\n\\t\\t\\t\\tobedience to His beneficial law, i.e. becoming a Muslim\r\\n\\t\\t\\t\\tis the best safeguard for man's peace and harmony.\r\\n\\t\\t\\t</p><p>\r\\n\\t\\t\\t\\tIslam dates back to the edge of Adam and its message has\r\\n\\t\\t\\t\\tbeen conveyed to man by God's Prophets and Messengers\r\\n\\t\\t\\t\\tincluding Abrahim, Moses, Jesus and Muhammad.  Islam's\r\\n\\t\\t\\t\\tmessage has been restored and enforced in the last stage\r\\n\\t\\t\\t\\tof the religious evolution by God's last Prophet and\r\\n\\t\\t\\t\\tMessenger Muhammad.\r\\n\\t\\t\\t</p><p>\r\\n\\t\\t\\t\\tThe word Allah in the Arabic language means God, or more\r\\n\\t\\t\\t\\taccurately The One and Only Eternal God, Creator of\r\\n\\t\\t\\t\\tthe Universe, Lord of all lords, King of all kings,\r\\n\\t\\t\\t\\tMost Compassionate, Most Merciful.  The word Allah to mean\r\\n\\t\\t\\t\\tGod is also used by Arabic speaking Jews and Christians.\r\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introduction to Islam",
    "BookCode": "GIT",
    "SectionHead": "Articles of Faith",
    "SecNoValue": "2",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tA muslim believes in ONE GOD, Supreme and Eternal,\\n\\t\\t\\t\\tInfinite and Mighty, Merciful and Compassionate, Creator\\n\\t\\t\\t\\tand Provider. God has no father nor mother, no sons nor\\n\\t\\t\\t\\twas He fathered.  None equal to Him. He is God of all\\n\\t\\t\\t\\tmankind, not of a special tribe or race.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tGod is High and Supreme but He is very near to the pious\\n\\t\\t\\t\\tthoughtful believers; He answers their prayers and help\\n\\t\\t\\t\\tthem. He loves the people who love Him and forgives their\\n\\t\\t\\t\\tsins. He gives them peace, happiness, knowledge and\\n\\t\\t\\t\\tsuccess.  God is the Loving and the Provider, the\\n\\t\\t\\t\\tGenerous, and the Benevolent, the Rich and the\\n\\t\\t\\t\\tIndependent the Forgiving and the Clement, the Patient\\n\\t\\t\\t\\tand the Appreciative, the Unique and the Protector, the\\n\\t\\t\\t\\tJudge and the Peace. God's attributes are mentioned in\\n\\t\\t\\t\\tthe Quran.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tGod creates in man the mind to understand, the soul and\\n\\t\\t\\t\\tconscience to be good and righteous, the feelings and\\n\\t\\t\\t\\tsentiments to be kind and humane. If we try to count His\\n\\t\\t\\t\\tfavours upon us, we cannot, because they are countless.\\n\\t\\t\\t\\tIn return for all the great favours and mercy, God does\\n\\t\\t\\t\\tnot need anything from us, because He is Needless and\\n\\t\\t\\t\\tIndependent. God asks us to know Him, to love Him and to\\n\\t\\t\\t\\tenforce His law for our benefit and our own benefit and\\n\\t\\t\\t\\tour own good.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim believes in all the Messengers and Prophets of\\n\\t\\t\\t\\tGod without any discrimination. All messengers were\\n\\t\\t\\t\\tmortals, human beings, endowed with Divine revelations\\n\\t\\t\\t\\tand appointed by God to teach mankind. The Holy Quran\\n\\t\\t\\t\\tmentions the names of 25 messengers and prophets and\\n\\t\\t\\t\\tstates that there are others. These include Noah,\\n\\t\\t\\t\\tAbrahim, Ishmael, Isaac, Moses, Jesus and Muhammad. Their\\n\\t\\t\\t\\tmessage is the same and it is Islam and it came from One\\n\\t\\t\\t\\tand the Same Source; God, and it is to submit to His will\\n\\t\\t\\t\\tand to obey His law; i.e., to become a Muslim.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim believes in all scriptures and revelations of\\n\\t\\t\\t\\tGod, as they were complete and in their original\\n\\t\\t\\t\\tversions.  Allah, the Creator, has not left man without\\n\\t\\t\\t\\tguidance for the conduct of his life. Revelations were\\n\\t\\t\\t\\tgiven to guide the people to the right path of Allah and\\n\\t\\t\\t\\tsent down to selected people, the prophet and messengers,\\n\\t\\t\\t\\tto convey it to their fellow men.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe message of all the prophet and messengers is the\\n\\t\\t\\t\\tsame.  They all asked the people of their time to obey\\n\\t\\t\\t\\tand worship Allah and none other. Abrahim, Moses, David,\\n\\t\\t\\t\\tJesus and Muhammad who were revealed their own book of\\n\\t\\t\\t\\tAllah, were sent at different times to bring back\\n\\t\\t\\t\\tstraying human being from deviation to Right Course.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Quran is the sacred book of the Muslims. It is the\\n\\t\\t\\t\\tlast book of guidance from Allah, sent down to Muhammad,\\n\\t\\t\\t\\tpeace be upon him, through the angel Jibraeel (Gabriel). \\n\\t\\t\\t\\tEvery word of it is the word of Allah. It was revealed\\n\\t\\t\\t\\tover a period of 23 years in the Arabic language. It\\n\\t\\t\\t\\tcontains 114 Surahs (chapters) and over 6000 verses.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Quran deals with man and his ultimate goal in life.\\n\\t\\t\\t\\tIts teachings cover all areas of this life and the life\\n\\t\\t\\t\\tafter death.  It contains principles, doctrines and\\n\\t\\t\\t\\tdirections for every sphere of human life. The theme of\\n\\t\\t\\t\\tthe Quran broadly consists of three fundamental ideas:\\n\\t\\t\\t\\tOneness of Allah, Prophethood and life after death. The\\n\\t\\t\\t\\tsuccess of human beings on this earth and in the life\\n\\t\\t\\t\\thereafter depends on obedience to the Quranic teaching.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Quran is unrivalled in its recording and prservation.\\n\\t\\t\\t\\t The astonishing fact about this book of Allah is that it\\n\\t\\t\\t\\thas remained unchanged even to a dot over the past\\n\\t\\t\\t\\tfourteen hundred years. No scholar has questioned the\\n\\t\\t\\t\\tfact that the Quran today is the same as it was revealed.\\n\\t\\t\\t\\t Muslims till today memorize the Quran word by word as a\\n\\t\\t\\t\\twhole or in part. Today, the Quran is the only authentic\\n\\t\\t\\t\\tand complete book of Allah. Allah is protecting it from\\n\\t\\t\\t\\tbeing lost, corrupted or concealed.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThere are purely spiritual and splendid beings created by\\n\\t\\t\\t\\tAllah. They require no food or drink or sleep.\\tThey have\\n\\t\\t\\t\\tno physical desires nor material needs. Angels spend\\n\\t\\t\\t\\ttheir time in the service of Allah.  Each charged with a\\n\\t\\t\\t\\tcertain duty. Angle cannot be seen by the naked eyes.\\n\\t\\t\\t\\tKnowledge and the truth are not entirely confined to\\n\\t\\t\\t\\tsensory knowledge or sensory perception alone.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim believe in the Day of the Judgement. This world\\n\\t\\t\\t\\tas we know it will come to an end and the dead will rise\\n\\t\\t\\t\\tto stand for their final and fair trial. On that day, all\\n\\t\\t\\t\\tmen and women from Adam to the last person will be\\n\\t\\t\\t\\tresurrected from the state of death for judgement. \\n\\t\\t\\t\\tEverything we do, say, make, intend and think are\\n\\t\\t\\t\\taccounted for and kept in accurate records. They are\\n\\t\\t\\t\\tbrought up on the Day of Judgement.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOne who believe in life after death is not expected to\\n\\t\\t\\t\\tbehave against the Will of Allah.  He will always bear in\\n\\t\\t\\t\\tmind that Allah is watching all his actions and the\\n\\t\\t\\t\\tangles are recording them.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tPeople with good records will be generously rewarded and\\n\\t\\t\\t\\twarmly welcomed to Allah's Heaven. People with bad\\n\\t\\t\\t\\trecords will be fairly punished and cast into Hell. The\\n\\t\\t\\t\\treal nature of Heaven and Hell are known to Allah only,\\n\\t\\t\\t\\tbut they are described by Allah in man's familiar terms\\n\\t\\t\\t\\tin the Quran.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIf some good deeds are seen not to get full appreciation\\n\\t\\t\\t\\tand credit in this life, they will receive full\\n\\t\\t\\t\\tcompensation and be widely acknowledged on the Day of\\n\\t\\t\\t\\tJudgement. If some people who commit sins, neglect Allah\\n\\t\\t\\t\\tand indulge in immoral activities, seem SUPERFICIALLY\\n\\t\\t\\t\\tsuccessful and prosperous in this life, absolute justice\\n\\t\\t\\t\\twill be done to them on the Day of Judgement.  The time\\n\\t\\t\\t\\tof the Day of Judgement is only known to Allah and Allah\\n\\t\\t\\t\\talone.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim believes in Qadaa and Qadar which related to the\\n\\t\\t\\t\\tultimate power of Allah.  Qadaa and Qadar means the\\n\\t\\t\\t\\tTimeless Knowledge of Allah and His power to plan and\\n\\t\\t\\t\\texecute His plans.  Allah is not indifferent to this\\n\\t\\t\\t\\tworld nor is He neutral to it.\\tIt implies that\\n\\t\\t\\t\\teverything on this earth originates from the one and only\\n\\t\\t\\t\\tcreator who is also the Sustainer and the sole source of\\n\\t\\t\\t\\tguidance.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAllah is Wise, Just and Loving and whatever He does must\\n\\t\\t\\t\\thave a good motive, although we may fail sometimes to\\n\\t\\t\\t\\tunderstand it fully.  We should have strong faith in\\n\\t\\t\\t\\tAllah and accept whatever He does because our knowledge\\n\\t\\t\\t\\tis limited and our thinking is based on individual\\n\\t\\t\\t\\tconsideration, whereas His knowledge is limitless and He\\n\\t\\t\\t\\tplans on a universal basis. Man should think, plan and\\n\\t\\t\\t\\tmake sound choice, but if things do not happen the way he\\n\\t\\t\\t\\twants, he should not lose faith and surrender himself to\\n\\t\\t\\t\\tmental strains or shattering worries.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim believe that the purpose of life is to worship\\n\\t\\t\\t\\tAllah.\\tWorshipping Allah does not mean we spend our\\n\\t\\t\\t\\tentire lives in constant seclusion and absolute\\n\\t\\t\\t\\tmeditation. To worship Allah is to live life according to\\n\\t\\t\\t\\tHis commands, not to run away from it.\\tTo worship Allah\\n\\t\\t\\t\\tis to know Him, to love Him, to obey His commands, to\\n\\t\\t\\t\\tenforce His laws in every aspect of life, to serve His\\n\\t\\t\\t\\tcause by doing right and shunning evil and to be just to\\n\\t\\t\\t\\tHim, to ourselves and to our fellow human beings.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim believes that human being enjoys an especially\\n\\t\\t\\t\\thigh ranking status in the hierarchy of all known\\n\\t\\t\\t\\tcreatures. Man occupies this distinguished position\\n\\t\\t\\t\\tbecause he alone is gifted with rational faculties and\\n\\t\\t\\t\\tspiritual aspirations as well as powers of action. Man is\\n\\t\\t\\t\\tnot a condemned race from birth to death, but a dignified\\n\\t\\t\\t\\tbeing potentially capable of good and noble achievements.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim also believes that every person is born muslim.\\n\\t\\t\\t\\tEvery person is endowed by Allah with spiritual potential\\n\\t\\t\\t\\tand intellectual inclination that can make him a good\\n\\t\\t\\t\\tMuslim. Every person's birth takes place according to the\\n\\t\\t\\t\\twill of Allah in realization of His plans and in\\n\\t\\t\\t\\tsubmission to His commands.  Every person is born FREE\\n\\t\\t\\t\\tFROM SIN. When the person reaches the age of maturity and\\n\\t\\t\\t\\tif he is sane, he become accountable for all his deeds\\n\\t\\t\\t\\tand intentions.  Man is free from sin until he commits\\n\\t\\t\\t\\tsin. There is no inherited sin, no original sin. Adam\\n\\t\\t\\t\\tcommitted the first sin, he prayed to Allah for pardon\\n\\t\\t\\t\\tand Allah granted Adam pardon.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim believes that man must work out his salvation\\n\\t\\t\\t\\tthrough the guidance of Allah.\\tNo one can act on behalf\\n\\t\\t\\t\\tof another or intercede between him and Allah. In order\\n\\t\\t\\t\\tto obtain salvation, a person must combine faith and\\n\\t\\t\\t\\taction, belief and practice. Faith without doing good\\n\\t\\t\\t\\tdeeds is as insufficient as doing good deeds without\\n\\t\\t\\t\\tfaith.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAlso, a Muslim believes that Allah does not hold any\\n\\t\\t\\t\\tperson responsible until he has shown him the Right Way.\\n\\t\\t\\t\\tIf people do not know and have no way of knowing about\\n\\t\\t\\t\\tIslam, they will not be responsible for failing to be\\n\\t\\t\\t\\tMuslim.  Every Muslim must preach Islam in words and\\n\\t\\t\\t\\taction.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim believes that faith is not complete when it is\\n\\t\\t\\t\\tfollowed blindly or accepted unquestioningly. Man must\\n\\t\\t\\t\\tbuild his faith on well-grounded convictions beyond any\\n\\t\\t\\t\\treasonable doubt and above uncertainty.  Islam insures\\n\\t\\t\\t\\tfreedom to believe and forbids compulsion in religion\\n\\t\\t\\t\\t(one of the oldest synagogues and one of the oldest\\n\\t\\t\\t\\tchurches in the worlds is in Muslim countries).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim believes that the Quran is the word of Allah\\n\\t\\t\\t\\trevealed to prophet Muhammad through the Angel Gabriel.\\n\\t\\t\\t\\tThe Quran was revealed from Allah on various occasions to\\n\\t\\t\\t\\tanswer questions, solve problems, settle disputes and to\\n\\t\\t\\t\\tbe man's best guide to the truth. The Quran was revealed\\n\\t\\t\\t\\tin Arabic and it is still in its original and complete\\n\\t\\t\\t\\tArabic version until today. It is memorized by millions.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tA Muslim also believes in a clear distinction between the\\n\\t\\t\\t\\tQuran and the Traditions (called Hadits) of the Prophet\\n\\t\\t\\t\\tMuhammad.  Whereas, the Quran is the word of Allah, the\\n\\t\\t\\t\\tTraditions of Prophet Muhammad (hadits i.e.:  his\\n\\t\\t\\t\\tteachings, sayings, and actions) are the practical\\n\\t\\t\\t\\tinterpretations of the Quran. Both the Quran and the\\n\\t\\t\\t\\tHadits of Prophet Muhammad are the primary sources of\\n\\t\\t\\t\\tknowledge in Islam.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introduction to Islam",
    "BookCode": "GIT",
    "SectionHead": "Application of Faith",
    "SecNoValue": "3",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tGod has laid down for a Muslim four major exercises of\\n\\t\\t\\t\\tfaith, some are daily, some weekly, some monthly, some\\n\\t\\t\\t\\tannually and some are required as a minimum of once in a\\n\\t\\t\\t\\tlifetime. These exercises of faith are to serve man's\\n\\t\\t\\t\\tspiritual purposes, satisfy his human needs and to mark\\n\\t\\t\\t\\this whole life with a Divine touch.  These major\\n\\t\\t\\t\\texercises of faith are:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tPraying, to the Creator on a daily basis, is the best way\\n\\t\\t\\t\\tto cultivate in a man a sound personality and to\\n\\t\\t\\t\\tactualize his aspiration. Allah does not need man's\\n\\t\\t\\t\\tprayer because He is free of all needs. Salah is for our\\n\\t\\t\\t\\tbenefit which are immeasurable and the blessings are\\n\\t\\t\\t\\tbeyond imagination.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIn salah, every muscle of the body joins the soul and the\\n\\t\\t\\t\\tmind in the worship and glory of Allah. Salah is an act\\n\\t\\t\\t\\tof worship.  It is a matchless and unprecedented formula\\n\\t\\t\\t\\tof intellectual meditation and spiritual devotion, of\\n\\t\\t\\t\\tmoral elevation and physical exercise, all combined.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOffering of salah is obligatory upon every Muslim male\\n\\t\\t\\t\\tand female who is sane, mature and in case of women free\\n\\t\\t\\t\\tfrom menstruation and confinement due to child birth.\\n\\t\\t\\t\\tRequirements of salah: performing of ablution (Wudu),\\n\\t\\t\\t\\tpurity of the whole body, clothes and ground used for\\n\\t\\t\\t\\tprayer, dressing properly and having (or declaring) the\\n\\t\\t\\t\\tintention and facing the Qiblah; the direction of the\\n\\t\\t\\t\\tKa'bah at Mecca.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tObligatory Salah: Five daily salahs, the Friday's noon\\n\\t\\t\\t\\tcongregation salah and the funeral salah.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHighly recommended salah: Those accompanying the\\n\\t\\t\\t\\tobligatory salah and the two great festival salahs.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOptional salah: Voluntary salah during the day and night.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tTimes of Obligatory Salah:\\n\\t\\t\\t</p><ul><li>\\n\\t\\t\\t\\t\\tEarly Morning - after dawn and before sunrise.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tNoon - after the sun begins to decline from its\\n\\t\\t\\t\\t\\tzenith until it is about midway on its course to\\n\\t\\t\\t\\t\\tset.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tMid-afternoon - after the expiration of the noon\\n\\t\\t\\t\\t\\tsalah time until sunset.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tSunset - immediately after sunset until the red\\n\\t\\t\\t\\t\\tglow in the western horizon disappears.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tEvening - after the expiration of the sunset\\n\\t\\t\\t\\t\\tsalah until dawn.\\n\\t\\t\\t\\t</li></ul><p>\\n\\t\\t\\t\\tSalah should be offered in its due time, unless there is\\n\\t\\t\\t\\ta reasonable excuse.  Delayed obligatory salah must be\\n\\t\\t\\t\\tmade up. In addition to the prescribed salah, a Muslim\\n\\t\\t\\t\\texpressed gratitude to God and appreciation of His\\n\\t\\t\\t\\tfavours and asks for His mercy all the time.  Especially\\n\\t\\t\\t\\tat times of, for example: childbirth, marriage, going to\\n\\t\\t\\t\\tor rising from bed, leaving and returning to his home,\\n\\t\\t\\t\\tstarting a journey or entering a city, riding or driving,\\n\\t\\t\\t\\tbefore or after eating or drinking, harvesting, visiting\\n\\t\\t\\t\\tgraveyards and at time of distress and sickness.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tFasting is abstaining completely from eating, drinking,\\n\\t\\t\\t\\tintimate sexual contacts and smoking from the break of\\n\\t\\t\\t\\tdawn till sunset.  It is a matchless Islamic institution\\n\\t\\t\\t\\twhich teaches man the principle of sincere love to God.\\n\\t\\t\\t\\tFasting teaches man a creative sense of hope, devotion,\\n\\t\\t\\t\\tpatience, unselfishness, moderation, willpower, wise\\n\\t\\t\\t\\tsaving, sound budgeting, mature adaptability, healthy\\n\\t\\t\\t\\tsurvival, discipline, spirit of social belonging, unity\\n\\t\\t\\t\\tand brotherhood.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tObligatory fasting is done once a year for the period of\\n\\t\\t\\t\\tthe month of Ramadan; the ninth month of the Islamic\\n\\t\\t\\t\\tyear.  Recommended fasting every Monday and Thursday of\\n\\t\\t\\t\\tevery week, three days in the middle of each Islamic\\n\\t\\t\\t\\tmonth, six days after Ramadan following the Feast Day and\\n\\t\\t\\t\\ta few days of the two months before Ramadan.  Fasting of\\n\\t\\t\\t\\tRamadan is a worship act which is obligatory on every\\n\\t\\t\\t\\tadult Muslim, male or female if he/she mentally and\\n\\t\\t\\t\\tphysically fit and not on a journey. Exception:  women\\n\\t\\t\\t\\tduring their period of menstruation and while nursing\\n\\t\\t\\t\\ttheir child and also in case of travel and sickness.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tCharity giving is an act of worship and spiritual\\n\\t\\t\\t\\tinvestment. The lateral meaning of Zakah is purity and it\\n\\t\\t\\t\\trefers to the annual amount in kind or coin which a\\n\\t\\t\\t\\tMuslim with means must distribute among the rightful\\n\\t\\t\\t\\tbeneficiaries.\\tZakah does not only purifies the property\\n\\t\\t\\t\\tof the contributor but also purifies his heart from\\n\\t\\t\\t\\tselfishness and greed.\\tIt also purifies the heart of the\\n\\t\\t\\t\\trecipient from envy and jealousy, from hatred and\\n\\t\\t\\t\\tuneasiness and it fosters instead good-will and warm\\n\\t\\t\\t\\twishes for the contributors.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tZakah has a deep humanitarian and social-political value;\\n\\t\\t\\t\\tfor example, it frees society from class welfare, from\\n\\t\\t\\t\\till feelings and distrust and from corruption.\\tAlthough\\n\\t\\t\\t\\tIslam does not hinder private enterprise or condemn\\n\\t\\t\\t\\tprivate possession, it does not tolerate selfish and\\n\\t\\t\\t\\tgreedy capitalism.  Islam adopts a moderate but positive\\n\\t\\t\\t\\tand effective course between individual and society,\\n\\t\\t\\t\\tbetween the citizen and the state, between capitalism and\\n\\t\\t\\t\\tsocialism, between materialism and spiritualism.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tZakah is paid on the net balance after paying personal\\n\\t\\t\\t\\texpenses, family expenses, due credits, taxes, etc. Every\\n\\t\\t\\t\\tMuslim, male or female who at the end of the year is in\\n\\t\\t\\t\\tpossession of the equivalent of 85 g of gold (approx.\\n\\t\\t\\t\\t$1400 in 1990) or more in cash or articles of trade, must\\n\\t\\t\\t\\tgive Zakah at minimum rate of 2.5%.  Taxes paid to\\n\\t\\t\\t\\tgovernment do not substitute for this religious duty. \\n\\t\\t\\t\\tContributor should not seek pride or fame but if\\n\\t\\t\\t\\tdisclosing his name and his contribution is likely to\\n\\t\\t\\t\\tencourage others, it is acceptable to do so.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe recipient of Zakah are: the poor, the needy, the new\\n\\t\\t\\t\\tMuslim converts, the Muslim prisoners of war (to liberate\\n\\t\\t\\t\\tthem), Muslim in debt. Also employees appointed to\\n\\t\\t\\t\\tcollect Zakah, Muslim in service of research or study or\\n\\t\\t\\t\\tpropagation of Islam, wayfarers who are foreigners in\\n\\t\\t\\t\\tneed of help.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIt is a pilgrimage to Mecca, at least once in a lifetime\\n\\t\\t\\t\\tand it is obligatory upon every Muslim male and female\\n\\t\\t\\t\\twho is mentally, physically and financially fit.  It is\\n\\t\\t\\t\\tthe largest annual convention of faith on earth (in 1989:\\n\\t\\t\\t\\t2.5 million). Peace is the dominant theme.  Peace with\\n\\t\\t\\t\\tAllah, with one's soul, with one another, with all living\\n\\t\\t\\t\\tcreatures.  To disturb the peace of anyone or any\\n\\t\\t\\t\\tcreature in any shape or form is strictly prohibited.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMuslim from all walks of life, from every corner of the\\n\\t\\t\\t\\tglobe assemble in Mecca in response to the call of Allah.\\n\\t\\t\\t\\tThere is no royalty but loyalty of all to Allah, the\\n\\t\\t\\t\\tCreator. It is to commemorate the Divine rituals observed\\n\\t\\t\\t\\tby the Prophet Abrahim and his son Ishmael, who are the\\n\\t\\t\\t\\tfirst pilgrim to the house of Allah on earth; the Ka'bah.\\n\\t\\t\\t\\t It is also to remember the grad assembly of the Day of\\n\\t\\t\\t\\tJudgement when people will stand equal before Allah.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMuslims go to Mecca in glory of Allah, not to worship a\\n\\t\\t\\t\\tman.  The visit to the tomb of Prophet Muhammad at Madena\\n\\t\\t\\t\\tis highly recommended but not essential in making the\\n\\t\\t\\t\\tHajj valid and complete.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Introduction to Islam",
    "BookCode": "GIT",
    "SectionHead": "Islam is a Code of Life",
    "SecNoValue": "4",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIt is a Muslim belief that Muhammad's mission was for the\\n\\t\\t\\t\\twhole world and for all the time; because:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe mission of Muhammad, as well as of other prophets who\\n\\t\\t\\t\\tbrought the universal message of Islam, does not end with\\n\\t\\t\\t\\tthe announcement of the message.  He has to guide the\\n\\t\\t\\t\\tpeople by explaining to them the implications of the\\n\\t\\t\\t\\tIslamic creed, the morale code, the divine injunctions\\n\\t\\t\\t\\tand commandment, and the form of worship that sustains\\n\\t\\t\\t\\tthe whole system. He has to exemplify the faith so others\\n\\t\\t\\t\\tcan pattern their participation in the evolution of\\n\\t\\t\\t\\tIslamic culture and civilization. The believers must grow\\n\\t\\t\\t\\tunder his guidance into an organized community so that\\n\\t\\t\\t\\tAllah's word will prevail over all other words.\\n\\t\\t\\t</p><ul><li>\\n\\t\\t\\t\\t\\tSpiritual Life:  prayer (salah), fasting, charity\\n\\t\\t\\t\\t\\tgiving (zakah), pilgrimage (hajj), love for Allah\\n\\t\\t\\t\\t\\tand His Messenger, love for truth and humanity\\n\\t\\t\\t\\t\\tfor the sake of Allah, hope and trust in Allah at\\n\\t\\t\\t\\t\\tall times and doing good for the sake of Allah.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tIntellectual Life:  True knowledge based on clear\\n\\t\\t\\t\\t\\tproof and indisputable evidence acquired by\\n\\t\\t\\t\\t\\texperience or experiment or by both. The Quran\\n\\t\\t\\t\\t\\tpoints to the rich sources of knowledge in the\\n\\t\\t\\t\\t\\twhole universe. Islam demands faith in Allah on\\n\\t\\t\\t\\t\\tthe basis of knowledge and research and leaves\\n\\t\\t\\t\\t\\twide open all field of thought before the\\n\\t\\t\\t\\t\\tintellect to penetrate as far it can reach.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tPersonal Life: purity and cleanliness, a healthy\\n\\t\\t\\t\\t\\tdiet, proper clothing, proper behaviour, and good\\n\\t\\t\\t\\t\\thealthy sexual relations within marriage.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tFamily Life: A family is a human social group\\n\\t\\t\\t\\t\\twhose members are bound together by the bond of\\n\\t\\t\\t\\t\\tblood ties and/or marital relationship and\\n\\t\\t\\t\\t\\tnothing else (adoption, mutual alliance, common\\n\\t\\t\\t\\t\\tlaw, trial marriage...etc.). Marriage is a\\n\\t\\t\\t\\t\\treligious duty on all who are capable of meeting\\n\\t\\t\\t\\t\\tits responsibilities. Each member of the family\\n\\t\\t\\t\\t\\thas rights and obligations.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tSocial Life: Man is ordained by Allah to extend\\n\\t\\t\\t\\t\\this utmost help and kindness to other family\\n\\t\\t\\t\\t\\tmembers, relations, servants and neighbours.  No\\n\\t\\t\\t\\t\\tsuperiority on account of class, colour, origin\\n\\t\\t\\t\\t\\tor wealth. Humanity represents one family\\n\\t\\t\\t\\t\\tspringing from the one and the same father and\\n\\t\\t\\t\\t\\tmother. The unity of the humanity is not only in\\n\\t\\t\\t\\t\\tits origin but also in its ultimate aims.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tEconomical Life: Earning one's living through\\n\\t\\t\\t\\t\\tdecent labour is not only a duty but a great\\n\\t\\t\\t\\t\\tvirtue as well.  Earning is man's private\\n\\t\\t\\t\\t\\tpossession.  The individual is responsible for\\n\\t\\t\\t\\t\\tthe prosperity of the state and the state is\\n\\t\\t\\t\\t\\tresponsible for the security of the individual. \\n\\t\\t\\t\\t\\tThe Islamic economic system is not based on\\n\\t\\t\\t\\t\\tarithmetical calculations alne but also on moral\\n\\t\\t\\t\\t\\tand principles. Man comes to this world\\n\\t\\t\\t\\t\\tempty-handed and departs empty-handed. The real\\n\\t\\t\\t\\t\\towner of things is Allah alone. Man is simply a\\n\\t\\t\\t\\t\\ttrustee.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tPolitical Life: The sovereignty in the Islamic\\n\\t\\t\\t\\t\\tState belongs to Allah; the people exercise it by\\n\\t\\t\\t\\t\\ttrust from Him to enforce His laws. The ruler is\\n\\t\\t\\t\\t\\tonly an acting executive chosen by the people to\\n\\t\\t\\t\\t\\tserve them according to Allah's law.  The State\\n\\t\\t\\t\\t\\tis to administer justice and provide security for\\n\\t\\t\\t\\t\\tall citizens. Rulers and administrators must be\\n\\t\\t\\t\\t\\tchosen from the best qualified citizens. If an\\n\\t\\t\\t\\t\\tadministration betrays the trust of Allah and the\\n\\t\\t\\t\\t\\tpeople, it has to be replaced.\\tNon-Muslim can\\n\\t\\t\\t\\t\\tadminister their personal life of marriage,\\n\\t\\t\\t\\t\\tdivorce, foods and inheritance according to the\\n\\t\\t\\t\\t\\tIslamic law or to their own religious teachings. \\n\\t\\t\\t\\t\\tThey may pay Zakah or a different tax tributes\\n\\t\\t\\t\\t\\t\"Jizyah\". They are entitled to full protection\\n\\t\\t\\t\\t\\tand security of the State including freedom of\\n\\t\\t\\t\\t\\treligion.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tInternational Life: Man has a common origin,\\n\\t\\t\\t\\t\\thuman status and aim.  Other people's interests\\n\\t\\t\\t\\t\\tand right to life, honour and property are\\n\\t\\t\\t\\t\\trespected as long as the right of Muslim are in\\n\\t\\t\\t\\t\\ttact. Transgression is forbidden.  War is only\\n\\t\\t\\t\\t\\tjustified if the state security is endangered. \\n\\t\\t\\t\\t\\tDuring war, destruction of crops, animals and\\n\\t\\t\\t\\t\\thomes, killing non-fighting women, children and\\n\\t\\t\\t\\t\\taged people are forbidden.\\n\\t\\t\\t\\t</li></ul>"
  },
  {
    "Section": "Introduction to Islam",
    "BookCode": "GIT",
    "SectionHead": "Source",
    "SecNoValue": "5",
    "SubSec": "NULL",
    "Text": "<ul><li>\\n\\t\\t\\t\\t\\tSayyid Abu Al-'Ala Maududi, Islam:  Its Meaning\\n\\t\\t\\t\\t\\tand Message, in M.  Tariq Quraishi (ed.),\\n\\t\\t\\t\\t\\tAmerican Trust Publications, Indianapolis,\\n\\t\\t\\t\\t\\tIndiana, 1984, 12-14.\\n\\t\\t\\t\\t</li><li>\\n\\t\\t\\t\\t\\tIslam, An Introduction.  Undated.  Compiled by\\n\\t\\t\\t\\t\\tDr.  Mohammed Ibrahim Elmasry c/o KW Islamic\\n\\t\\t\\t\\t\\tAssociation, P.O. Box 823, Waterloo, Ontario,\\n\\t\\t\\t\\t\\tCANADA N2J 4C2, (519) 885-2225.\\n\\t\\t\\t\\t</li></ul>"
  },
  {
    "Section": "Prophet Muhammad's Last Sermon",
    "BookCode": "GIT",
    "SectionHead": "Prophet Muhammad's Last Sermon",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\tThis Sermon was delivered on the Ninth Day of Dhul Hijjah 10\\n\\t\\t\\tA.H in the Uranah Valley of mount Arafat\\n\\t\\t</p><p>\\n\\t\\t\\t\"O People, lend me an attentive ear, for I don't know whether,\\n\\t\\t\\tafter this year, I shall ever be amongst you again. Therefore\\n\\t\\t\\tlisten to what I am saying to you carefully and take these\\n\\t\\t\\twords to those who could not be present here today.\\n\\t\\t</p><p>\\n\\t\\t\\tO People, just as you regard this month, this day, this city as\\n\\t\\t\\tSacred, so regard the life and property of every Muslim as a\\n\\t\\t\\tsacred trust. Return the goods entrusted to you to their rightful\\n\\t\\t\\towners. Hurt no one so that no one may hurt you. Remember that\\n\\t\\t\\tyou will indeed meet your Lord, and that He will indeed reckon\\n\\t\\t\\tyour deeds. Allah has forbidden you to take usury (Interest),\\n\\t\\t\\ttherefore all interest obligation shall henceforth be waived...\\n\\t\\t</p><p>\\n\\t\\t\\tBeware of Satan, for your safety of your religion. He has lost\\n\\t\\t\\tall hope that he will ever be able to lead you astray in big\\n\\t\\t\\tthings, so beware of following him in small things.\\n\\t\\t</p><p>\\n\\t\\t\\tO People, it is true that you have certain rights with regard to\\n\\t\\t\\tyour women, but they also have right over you. If they abide by\\n\\t\\t\\tyour right then to them belongs the right to  be fed and clothed\\n\\t\\t\\tin kindness. Do treat your women well and be kind to them for\\n\\t\\t\\tthey are your partners and comitted helpers. And it is your right\\n\\t\\t\\tthat they do not make friends with any one of whom you do not\\n\\t\\t\\tapprove, as well as never to commit adultery.\\n\\t\\t</p><p>\\n\\t\\t\\tO People, listen to me in earnest, whorship Allah, say your five\\n\\t\\t\\tdaily prayers (Salah), fast during the month of Ramadhan, and\\n\\t\\t\\tgive your wealth in Zakat. Perform Hajj if you can afford to. You\\n\\t\\t\\tknow that every Muslim is the brother of another Muslim. You\\n\\t\\t\\tare all equal. Nobody has superiority over other except by\\n\\t\\t\\tpiety and good action.\\n\\t\\t</p><p>\\n\\t\\t\\tRemember, one day you will appear before Allah and answer for\\n\\t\\t\\tyour deeds. So beware, do not astray from the path of\\n\\t\\t\\trighteousness after I am gone.\\n\\t\\t</p><p>\\n\\t\\t\\tO People, no prophet or apostle will come after me and no new\\n\\t\\t\\tfaith will be born. Reason well, therefore, O People, and\\n\\t\\t\\tunderstand my words which I convey to you. I leave behind me two\\n\\t\\t\\tthings, the Qur'an and my example, the Sunnah and if you follow\\n\\t\\t\\tthese you will never go astray.\\n\\t\\t</p><p>\\n\\t\\t\\tAll those who listen to me shall pass on my words to others and\\n\\t\\t\\tthose to others again; and may the last ones understand my words\\n\\t\\t\\tbetter than those who listen to me direcly. Be my witness oh\\n\\t\\t\\tAllah that I have conveyed your message to your people.\"\\n\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Introduction",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIslam is a religion based upon the surrender to God who is One.\\nThe very name of the religion, al-Islam in Arabic, means at once\\n\\t\\t\\t\\tsubmission and peace, for it is in submitting to God's Will that\\n\\t\\t\\t\\thuman beings gain peace in their lives in this world and in the\\n\\t\\t\\t\\thereafter. The message of Islam concerns God, who in Arabic is\\n\\t\\t\\t\\tcalled Allah, and it addresses itself to humanity's most profound\\n\\t\\t\\t\\tnature. It concerns men and women as they were created by\\n\\t\\t\\t\\tGod--not as fallen beings. Islam therefore considers itself to be\\n\\t\\t\\t\\tnot an innovation but a reassertion of the universal truth of all\\n\\t\\t\\t\\trevelation which is God's Oneness.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Prophets",
    "SecNoValue": "2",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThis truth was asserted by the prophets of old and especially by\\n\\t\\t\\t\\tAbraham, the father of monotheism. Islam reveres all of these\\n\\t\\t\\t\\tprophets including not only Abraham, who is the father of the\\n\\t\\t\\t\\tArabs as well as of the Jews, but also Moses and Christ. The\\n\\t\\t\\t\\tProphet and Messenger of God, Muhammad--may peace and blessings\\n\\t\\t\\t\\tbe upon him, his family and his companions, was the last of this\\n\\t\\t\\t\\tlong line of prophets and Islam is the last religion until the\\n\\t\\t\\t\\tDay of Judgement. It is the final expression of the Abrahamic\\n\\t\\t\\t\\ttradition. One should in fact properly speak of the\\n\\t\\t\\t\\tJudeo-Christian-Islamic tradition, for Islam shares with the\\n\\t\\t\\t\\tother Abrahamic religions their sacred history, the basic ethical\\n\\t\\t\\t\\tteachings contained in the Ten Commandments and above all, belief\\n\\t\\t\\t\\tin the One God. And it renews and repeats the true beliefs of\\n\\t\\t\\t\\tJews and Christians whose scriptures are mentioned as divinely\\n\\t\\t\\t\\trevealed books in Islam's own sacred book, the Quran.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Quran",
    "SecNoValue": "3",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tFor Muslims, or followers of Islam, the Quran is the actual Word\\n\\t\\t\\t\\tof God revealed through the archangel Gabriel to the Prophet of\\n\\t\\t\\t\\tIslam during the twenty-three-year period of his prophetic\\n\\t\\t\\t\\tmission. It was revealed in the Arabic language as a sonoral\\n\\t\\t\\t\\trevelation which the Prophet repeated to his companions. Arabic\\n\\t\\t\\t\\tbecame therefore the language of Islam even for non-Arab Muslims.\\n\\t\\t\\t\\tUnder the direction of the Prophet, the verses and chapters were\\n\\t\\t\\t\\torganized in the order known to Muslims to this day. There is\\n\\t\\t\\t\\tonly one text of the Quran accepted by all schools of Islamic\\n\\t\\t\\t\\tthought and there are no variants.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Quran is the central sacred reality of Islam. The sound of\\n\\t\\t\\t\\tthe Quran is the first and last sound that a Muslim hears in this\\n\\t\\t\\t\\tlife. As the direct Word of God and the embodiment of God's Will,\\n\\t\\t\\t\\tthe Quran is considered as the guide par excellence for the life\\n\\t\\t\\t\\tof Muslims. It is the source of all Islamic doctrines and ethics.\\n\\t\\t\\t\\tBoth the intellectual aspects of Islam and Islamic Law have their\\n\\t\\t\\t\\tsource in the Quran. Perhaps there is no book revered by any\\n\\t\\t\\t\\thuman collectivity as much as the Quran is revered by Muslims.\\n\\t\\t\\t\\tEssentially a religion of the book, Islam sees all authentic\\n\\t\\t\\t\\treligions as being associated with a scripture. That is why\\n\\t\\t\\t\\tMuslims call Christians and Jews the \"people of the book\".\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThroughout all its chapters and verses, the Quran emphasizes the\\n\\t\\t\\t\\tsignificance of knowledge and encourages Muslims to learn and to\\n\\t\\t\\t\\tacquire knowledge not only of God's laws and religious\\n\\t\\t\\t\\tinjunctions, but also of the world of nature. The Quran refers,\\n\\t\\t\\t\\tin a language rich in its varied terminology, to the importance\\n\\t\\t\\t\\tof seeing, contemplating, and reasoning about the world of\\n\\t\\t\\t\\tcreation and its diverse phenomena. It places the gaining of\\n\\t\\t\\t\\tknowledge as the highest religious activity, one that is most\\n\\t\\t\\t\\tpleasing in God's eyes. That is why wherever the message of the\\n\\t\\t\\t\\tQuran was accepted and understood, the quest for knowledge\\n\\t\\t\\t\\tflourished.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Prophet of Islam",
    "SecNoValue": "4",
    "SubSec": "Early Years",
    "Text": "<p>\\n\\t\\t\\t\\t\\tAt that time the Arabs followed a form of idolatry, each\\n\\t\\t\\t\\t\\ttribe keeping its own idols at the Ka'bah, the cubical\\n\\t\\t\\t\\t\\tstructure built originally by Abraham to celebrate the\\n\\t\\t\\t\\t\\tglory of the One God. But the monotheistic message of\\n\\t\\t\\t\\t\\tAbraham had long become forgotten among the general\\n\\t\\t\\t\\t\\tpopulation of the Arabian peninsula. The young Muhammad,\\n\\t\\t\\t\\t\\thowever, was a believer in the One God all of his life\\n\\t\\t\\t\\t\\tand never participated in the idolatrous practices of his\\n\\t\\t\\t\\t\\ttribe.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Prophet of Islam",
    "SecNoValue": "4",
    "SubSec": "Angel Gabriel",
    "Text": "<p>\\n\\t\\t\\t\\t\\tWhen forty years old, during one of the retreats which he\\n\\t\\t\\t\\t\\tmade habitually in a cave on top of a mountain outside\\n\\t\\t\\t\\t\\tMakkah, Muhammad first saw the archangel Gabriel who\\n\\t\\t\\t\\t\\trevealed God's Word to him, the Quran, and announced that\\n\\t\\t\\t\\t\\tMuhammad is the messenger of God. For the next thirteen\\n\\t\\t\\t\\t\\tyears he preached the Word of God to the Makkans,\\n\\t\\t\\t\\t\\tinviting them to abandon idolatry and accept the religion\\n\\t\\t\\t\\t\\tof Oneness. A few accepted his call but most Makkans,\\n\\t\\t\\t\\t\\tespecially those of his own tribe, opposed him violently,\\n\\t\\t\\t\\t\\tseeing in the new religion a grave danger to their\\n\\t\\t\\t\\t\\teconomic as well as social domination based upon their\\n\\t\\t\\t\\t\\tcontrol of the Ka'bah. But the Prophet continued to call\\n\\t\\t\\t\\t\\tthe people to Islam and gradually a larger number of men\\n\\t\\t\\t\\t\\tand women began to accept the faith and submit themselves\\n\\t\\t\\t\\t\\tto its teachings. As a result, persecution of Muslims\\n\\t\\t\\t\\t\\tincreased until the Prophet was forced to send some of\\n\\t\\t\\t\\t\\this companions to Abyssinia where they were protected by\\n\\t\\t\\t\\t\\tthe Christian king.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Prophet of Islam",
    "SecNoValue": "4",
    "SubSec": "Early days of Islam",
    "Text": "<p>\\n\\t\\t\\t\\t\\tThe Makkan period was also one of intense spiritual\\n\\t\\t\\t\\t\\texperience for the Prophet and the noble companions who\\n\\t\\t\\t\\t\\tformed the nucleus of the new religious community which\\n\\t\\t\\t\\t\\twas soon to spread worldwide. It was during this period\\n\\t\\t\\t\\t\\tthat God ordered the direction of prayers to be changed\\n\\t\\t\\t\\t\\tfrom Jerusalem to Makkah. To this day Jerusalem remains\\n\\t\\t\\t\\t\\talong with Makkah and Madinah one of the holiest cities\\n\\t\\t\\t\\t\\tof Islam.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Prophet of Islam",
    "SecNoValue": "4",
    "SubSec": "Migration",
    "Text": "<p>\\n\\t\\t\\t\\t\\tIn 622 A. D. the Prophet was ordered by God to migrate to\\n\\t\\t\\t\\t\\tYathrib, a city north of Makkah. He followed the Divine\\n\\t\\t\\t\\t\\tCommand and left with his followers for that city which\\n\\t\\t\\t\\t\\thenceforth was known as \"The City of the Prophet\"\\n\\t\\t\\t\\t\\t(Madinat al-nabi) or simply Madinah. This event was so\\n\\t\\t\\t\\t\\tmomentous that the Islamic calendar begins with this\\n\\t\\t\\t\\t\\tmigration (hijrah).\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tIn Madinah, the Prophet established the first Islamic\\n\\t\\t\\t\\t\\tsociety which has served as the model for all later\\n\\t\\t\\t\\t\\tIslamic societies. Several battles took place against the\\n\\t\\t\\t\\t\\tinvading Makkans which the Muslims won against great\\n\\t\\t\\t\\t\\todds. Soon more tribes began to join Islam and within a\\n\\t\\t\\t\\t\\tfew years most of Arabia had embraced the religion of\\n\\t\\t\\t\\t\\tIslam.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Prophet of Islam",
    "SecNoValue": "4",
    "SubSec": "Victory at Makkah",
    "Text": "<p>\\n\\t\\t\\t\\t\\tAfter many trials and eventually successive victories,\\nthe Prophet returned triumphantly to Makkah where the\\n\\t\\t\\t\\t\\tpeople embraced Islam at last. He forgave all his former\\n\\t\\t\\t\\t\\tenemies and marched to the Ka'bah, where he ordered his\\n\\t\\t\\t\\t\\tcompanion and cousin 'Ali to join him in destroying all\\n\\t\\t\\t\\t\\tthe idols. The Prophet reconstituted the rite of\\n\\t\\t\\t\\t\\tpilgrimage as founded by Abraham. The Prophet then\\n\\t\\t\\t\\t\\treturned to Madinah and made another pilgrimage to\\n\\t\\t\\t\\t\\tMakkah. It was upon returning from this last pilgrimage\\n\\t\\t\\t\\t\\tthat he delivered his farewell address. Soon he fell ill\\n\\t\\t\\t\\t\\tand after three days died in 632 A. D. in Madinah where\\n\\t\\t\\t\\t\\the was buried in the chamber of his house next to the\\n\\t\\t\\t\\t\\tfirst mosque of Islam.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Prophet of Islam",
    "SecNoValue": "4",
    "SubSec": "NULL",
    "Text": ""
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Sunnah (practices) of the Prophet",
    "SecNoValue": "5",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe practices and traditions (Sunnah) of the Prophet which\\n\\t\\t\\t\\tincludes his sayings (Hadith) became the guide for Muslims in the\\n\\t\\t\\t\\tunderstanding of the Quran and the practice of their religion.\\n\\t\\t\\t\\tThe Quran itself asserts that God has chosen in the Prophet an\\n\\t\\t\\t\\texample for Muslims to follow. Besides this emulation of the\\n\\t\\t\\t\\tProphet in all aspects of life and thought, his sayings were\\n\\t\\t\\t\\tassembled by various scholars. Finally they were codified in\\n\\t\\t\\t\\tbooks of Hadith where the authentic were separated from the\\n\\t\\t\\t\\tspurious. The Sunnah has always remained, after the Quran, the\\n\\t\\t\\t\\tsecond source of everything Islamic.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "What is the Islamic Religion?",
    "SecNoValue": "6",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAccording to a famous saying of the Prophet Islam consists of\\n\\t\\t\\t\\tfive pillars which are as follows: affirmation of the faith\\n\\t\\t\\t\\t(shahadah), that is, witnessing that La ilaha illa'Llah (There is\\n\\t\\t\\t\\tno divinity but Allah) and Muhammadun rasul Allah (Muhammad is\\n\\t\\t\\t\\tthe Messenger of Allah); the five daily prayers (al-salat) which\\n\\t\\t\\t\\tMuslims perform facing Makkah; fasting (al-sawm) from dawn to\\n\\t\\t\\t\\tsunset during the month of Ramadan; making the pilgrimage to\\n\\t\\t\\t\\tMakkah (al-hajj) at least once in a lifetime if one's financial\\n\\t\\t\\t\\tand physical conditions permit it; and paying a 2 1/2% tax\\n\\t\\t\\t\\t(al-zakat) on one's capital which is used for the needs of the\\n\\t\\t\\t\\tcommunity. Muslims are also commanded to exhort others to perform\\n\\t\\t\\t\\tgood acts and to abstain from evil. Ethics lies at the heart of\\n\\t\\t\\t\\tIslamic teachings and all men and women are expected to act\\n\\t\\t\\t\\tethically towards each other at all times. As the Prophet has\\n\\t\\t\\t\\tsaid, \"None of you is a believer until you love for your brother\\n\\t\\t\\t\\twhat you love for yourself.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAs for faith according to Islam (al-iman), it means having faith\\n\\t\\t\\t\\tin God, His angels, His books, His messengers, the Day of\\n\\t\\t\\t\\tJudgment and God's determination of human destiny. It is\\n\\t\\t\\t\\timportant to understand that the definition of al-iman refers to\\n\\t\\t\\t\\tbooks and prophets in the plural thus pointing directly to the\\n\\t\\t\\t\\tuniversality of revelation and respect for other religions\\n\\t\\t\\t\\temphasized so much in the Quran. There is also the important\\n\\t\\t\\t\\tconcept, al-ihsan or virtue, which means to worship God as if one\\n\\t\\t\\t\\tsees Him, knowing that even if one does not see Him, He sees us.\\n\\t\\t\\t\\tIt means to remember God at all times and marks the highest level\\n\\t\\t\\t\\tof being a Muslim.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "Islamic Law (al-Shari'ah)",
    "SecNoValue": "7",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIslam possesses a religious law called al-Shari'ah in Arabic\\n\\t\\t\\t\\twhich governs the life of Muslims and which Muslims consider to\\n\\t\\t\\t\\tbe the embodiment of the Will of God. The Shari'ah is contained\\n\\t\\t\\t\\tin principle in the Quran as elaborated and complemented by the\\n\\t\\t\\t\\tSunnah. On the basis of these principles the schools of law which\\n\\t\\t\\t\\tare followed by all Muslims to this day were developed early in\\n\\t\\t\\t\\tIslamic history. This Law, while being rooted in the sources of\\n\\t\\t\\t\\tthe Islamic revelation, is a living body of law which caters to\\n\\t\\t\\t\\tthe needs of Islamic society .\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIslamic laws are essentially preventative and are not based on\\n\\t\\t\\t\\tharsh punishment except as a last measure. The faith of the\\n\\t\\t\\t\\tMuslim causes him to have respect for the rights of others and\\n\\t\\t\\t\\tIslamic Law is such that it prevents transgression from taking\\n\\t\\t\\t\\tplace in most instances. That is why what people consider to be\\n\\t\\t\\t\\tharsh punishments are so rarely in need of being applied.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "The Spread of Islam",
    "SecNoValue": "8",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tFrom the oasis cities of Makkah and Madinah in the Arabian\\n\\t\\t\\t\\tdesert, the message of Islam went forth with electrifying speed.\\n\\t\\t\\t\\tWithin half a century of the Prophet's death, Islam had spread to\\n\\t\\t\\t\\tthree continents. Islam is not, as some imagine in the West, a\\n\\t\\t\\t\\treligion of the sword nor did it spread primarily by means of\\n\\t\\t\\t\\twar. It was only within Arabia, where a crude form of idolatry\\n\\t\\t\\t\\twas rampant, that Islam was propagated by warring against those\\n\\t\\t\\t\\ttribes which did not accept the message of God--whereas\\n\\t\\t\\t\\tChristians and Jews were not forced to convert. Outside of Arabia\\n\\t\\t\\t\\talso the vast lands conquered by the Arab armies in a short\\n\\t\\t\\t\\tperiod became Muslim not by force of the sword but by the appeal\\n\\t\\t\\t\\tof the new religion. It was faith in One God and emphasis upon\\n\\t\\t\\t\\tHis Mercy that brought vast numbers of people into the fold of\\n\\t\\t\\t\\tIslam. The new religion did not coerce people to convert. Many\\n\\t\\t\\t\\tcontinued to remain Jews and Christians and to this day important\\n\\t\\t\\t\\tcommunities of the followers of these faiths are found in Muslim\\n\\t\\t\\t\\tlands.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMoreover, the spread of Islam was not limited to its miraculous\\n\\t\\t\\t\\tearly expansion outside of Arabia. During later centuries the\\n\\t\\t\\t\\tTurks embraced Islam peacefully as did a large number of the\\n\\t\\t\\t\\tpeople of the Indian subcontinent and the Malay-speaking world.\\n\\t\\t\\t\\tIn Africa also, Islam has spread during the past two centuries\\n\\t\\t\\t\\teven under the mighty power of European colonial rulers. Today\\n\\t\\t\\t\\tIslam continues to grow not only in Africa but also in Europe and\\n\\t\\t\\t\\tAmerica where Muslims now comprise a notable minority.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "The Religion of Islam",
    "BookCode": "WOI",
    "SectionHead": "NULL",
    "SecNoValue": "NULL",
    "SubSec": "NULL",
    "Text": "\"This day have I perfected your religion for you and completed My\\n\\t\\t\\tfavor unto you, and have chosen for you as your religion Islam.\"\\n\\t\\t\\t(Quran, Surah 5.3)"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "General Characteristics of Islamic Civilization",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIslam was destined to become a world religion and to create a\\n\\t\\t\\t\\tcivilization which stretched from one end of the globe to the\\n\\t\\t\\t\\tother. Already during the early Muslim caliphates, first the\\n\\t\\t\\t\\tArabs, then the Persians and later the Turks set about to create\\n\\t\\t\\t\\tclassical Islamic civilization. Later, in the 13th century, both\\n\\t\\t\\t\\tAfrica and India became great centers of Islamic civilization and\\n\\t\\t\\t\\tsoon thereafter Muslim kingdoms were established in the\\n\\t\\t\\t\\tMalay-Indonesian world while Chinese Muslims flourished\\n\\t\\t\\t\\tthroughout China.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "Global religion",
    "SecNoValue": "2",
    "SubSec": "NULL",
    "Text": "<p>\r\\n\\t\\t\\t\\tIslam is a religion for all people from whatever race or\r\\n\\t\\t\\t\\tbackground they might be. That is why Islamic civilization is\r\\n\\t\\t\\t\\tbased on a unity which stands completely against any racial or\r\\n\\t\\t\\t\\tethnic discrimination. Such major racial and ethnic groups as the\r\\n\\t\\t\\t\\tArabs, Persians, Turks, Africans, Indians, Chinese and Malays in\r\\n\\t\\t\\t\\taddition to numerous smaller units embraced Islam and contributed\r\\n\\t\\t\\t\\tto the building of Islamic civilization. Moreover, Islam was not\r\\n\\t\\t\\t\\topposed to learning from the earlier civilizations and\r\\n\\t\\t\\t\\tincorporating their science, learning, and culture into its own\r\\n\\t\\t\\t\\tworld view, as long as they did not oppose the principles of\r\\n\\t\\t\\t\\tIslam. Each ethnic and racial group which embraced Islam made its\r\\n\\t\\t\\t\\tcontribution to the one Islamic civilization to which everyone\r\\n\\t\\t\\t\\tbelonged. The sense of brotherhood and sisterhood was so much\r\\n\\t\\t\\t\\temphasized that it overcame all local attachments to a particular\r\\n\\t\\t\\t\\ttribe, race, or language--all of which became subservient to the\r\\n\\t\\t\\t\\tuniversal brotherhood and sisterhood of Islam.\r\\n\\t\\t\\t</p><p>\r\\n\\t\\t\\t\\tThe global civilization thus created by Islam permitted people of\r\\n\\t\\t\\t\\tdiverse ethnic backgrounds to work together in cultivating\r\\n\\t\\t\\t\\tvarious arts and sciences. Although the civilization was\r\\n\\t\\t\\t\\tprofoundly Islamic, even non-Muslim \"people of the book\"\r\\n\\t\\t\\t\\tparticipated in the intellectual activity whose fruits belonged\r\\n\\t\\t\\t\\tto everyone. The scientific climate was reminiscent of the\r\\n\\t\\t\\t\\tpresent situation in America where scientists and men and women\r\\n\\t\\t\\t\\tof learning from all over the world are active in the advancement\r\\n\\t\\t\\t\\tof knowledge which belongs to everyone.\r\\n\\t\\t\\t</p><p>\r\\n\\t\\t\\t\\tThe global civilization created by Islam also succeeded in\r\\n\\t\\t\\t\\tactivating the mind and thought of the people who entered its\r\\n\\t\\t\\t\\tfold. As a result of Islam, the nomadic Arabs became\r\\n\\t\\t\\t\\ttorch-bearers of science and learning. The Persians who had\r\\n\\t\\t\\t\\tcreated a great civilization before the rise of Islam\r\\n\\t\\t\\t\\tnevertheless produced much more science and learning in the\r\\n\\t\\t\\t\\tIslamic period than before. The same can be said of the Turks and\r\\n\\t\\t\\t\\tother peoples who embraced Islam. The religion of Islam was\r\\n\\t\\t\\t\\titself responsible not only for the creation of a world\r\\n\\t\\t\\t\\tcivilization in which people of many different ethnic backgrounds\r\\n\\t\\t\\t\\tparticipated, but it played a central role in developing\r\\n\\t\\t\\t\\tintellectual and cultural life on a scale not seen before. For\r\\n\\t\\t\\t\\tsome eight hundred years Arabic remained the major intellectual\r\\n\\t\\t\\t\\tand scientific language of the world. During the centuries\r\\n\\t\\t\\t\\tfollowing the rise of Islam, Muslim dynasties ruling in various\r\\n\\t\\t\\t\\tparts of the Islamic world bore witness to the flowering of\r\\n\\t\\t\\t\\tIslamic culture and thought. In fact this tradition of\r\\n\\t\\t\\t\\tintellectual activity was eclipsed only at the beginning of\r\\n\\t\\t\\t\\tmodern times as a result of the weakening of faith among Muslims\r\\n\\t\\t\\t\\tcombined with external domination. And today this activity has\r\\n\\t\\t\\t\\tbegun anew in many parts of the Islamic world now that the\r\\n\\t\\t\\t\\tMuslims have regained their political independence.\r\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "A Brief History of Islam: The Rightly Guided Caliphs",
    "SecNoValue": "3",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tUpon the death of the Prophet, Abu Bakr, the friend of the\\n\\t\\t\\t\\tProphet and the first adult male to embrace Islam, became caliph.\\n\\t\\t\\t\\tAbu Bakr ruled for two years to be succeeded by 'Umar who was\\n\\t\\t\\t\\tcaliph for a decade and during whose rule Islam spread\\n\\t\\t\\t\\textensively east and west conquering the Persian empire, Syria\\n\\t\\t\\t\\tand Egypt. It was 'Umar who marched on foot at the end of the\\n\\t\\t\\t\\tMuslim army into Jerusalem and ordered the protection of\\n\\t\\t\\t\\tChristian sites. 'Umar also established the first public treasury\\n\\t\\t\\t\\tand a sophisticated financial administration. He established many\\n\\t\\t\\t\\tof the basic practices of Islamic government.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'Umar was succeeded by 'Uthman who ruled for some twelve years\\n\\t\\t\\t\\tduring which time the Islamic expansion continued. He is also\\n\\t\\t\\t\\tknown as the caliph who had the definitive text of the Noble\\n\\t\\t\\t\\tQuran copied and sent to the four corners of the Islamic world.\\n\\t\\t\\t\\tHe was in turn succeeded by 'Ali who is known to this day for his\\n\\t\\t\\t\\teloquent sermons and letters, and also for his bravery. With his\\n\\t\\t\\t\\tdeath the rule of the \"rightly guided\" caliphs, who hold a\\n\\t\\t\\t\\tspecial place of respect in the hearts of Muslims, came to an\\n\\t\\t\\t\\tend.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "The Caliphates",
    "SecNoValue": "4",
    "SubSec": "Umayyad",
    "Text": "<p>\\n\\t\\t\\t\\t\\tThe Umayyad caliphate established in 661 was to last for\\n\\t\\t\\t\\t\\tabout a century. During this time Damascus became the\\n\\t\\t\\t\\t\\tcapital of an Islamic world which stretched from the\\n\\t\\t\\t\\t\\twestern borders of China to southern France. Not only did\\n\\t\\t\\t\\t\\tthe Islamic conquests continue during this period through\\n\\t\\t\\t\\t\\tNorth Africa to Spain and France in the West and to Sind,\\n\\t\\t\\t\\t\\tCentral Asia and Transoxiana in the East, but the basic\\n\\t\\t\\t\\t\\tsocial and legal institutions of the newly founded\\n\\t\\t\\t\\t\\tIslamic world were established.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "The Caliphates",
    "SecNoValue": "4",
    "SubSec": "Abbasids",
    "Text": "<p>\\n\\t\\t\\t\\t\\tThe Abbasids, who succeeded the Umayyads, shifted the\\n\\t\\t\\t\\t\\tcapital to Baghdad which soon developed into an\\n\\t\\t\\t\\t\\tincomparable center of learning and culture as well as\\n\\t\\t\\t\\t\\tthe administrative and political heart of a vast world.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tThey ruled for over 500 years but gradually their power\\n\\t\\t\\t\\t\\twaned and they remained only symbolic rulers bestowing\\n\\t\\t\\t\\t\\tlegitimacy upon various sultans and princes who wielded\\n\\t\\t\\t\\t\\tactual military power. The Abbasid caliphate was finally\\n\\t\\t\\t\\t\\tabolished when Hulagu, the Mongol ruler, captured Baghdad\\n\\t\\t\\t\\t\\tin 1258, destroying much of the city including its\\n\\t\\t\\t\\t\\tincomparable libraries.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tWhile the Abbasids ruled in Baghdad, a number of powerful\\n\\t\\t\\t\\t\\tdynasties such as the Fatimids, Ayyubids and Mamluks held\\n\\t\\t\\t\\t\\tpower in Egypt, Syria and Palestine. The most important\\n\\t\\t\\t\\t\\tevent in this area as far as the relation between Islam\\n\\t\\t\\t\\t\\tand the Western world was concerned was the series of\\n\\t\\t\\t\\t\\tCrusades declared by the Pope and espoused by various\\n\\t\\t\\t\\t\\tEuropean kings. The purpose, although political, was\\n\\t\\t\\t\\t\\toutwardly to recapture the Holy Land and especially\\n\\t\\t\\t\\t\\tJerusalem for Christianity. Although there was at the\\n\\t\\t\\t\\t\\tbeginning some success and local European rule was set up\\n\\t\\t\\t\\t\\tin parts of Syria and Palestine, Muslims finally\\n\\t\\t\\t\\t\\tprevailed and in 1187 Saladin, the great Muslim leader,\\n\\t\\t\\t\\t\\trecaptured Jerusalem and defeated the Crusaders.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "The Caliphates",
    "SecNoValue": "4",
    "SubSec": "NULL",
    "Text": ""
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "North Africa and Spain",
    "SecNoValue": "5",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tWhen the Abbasids captured Damascus, one of the Umayyad princes\\n\\t\\t\\t\\tescaped and made the long journey from there to Spain to found\\n\\t\\t\\t\\tUmayyad rule there, thus beginning the golden age of Islam in\\n\\t\\t\\t\\tSpain. Cordoba was established as the capital and soon became\\n\\t\\t\\t\\tEurope's greatest city not only in population but from the point\\n\\t\\t\\t\\tof view of its cultural and intellectual life. The Umayyads ruled\\n\\t\\t\\t\\tover two centuries until they weakened and were replaced by local\\n\\t\\t\\t\\trulers.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMeanwhile in North Africa, various local dynasties held sway\\n\\t\\t\\t\\tuntil two powerful Berber dynasties succeeded in uniting much of\\n\\t\\t\\t\\tNorth Africa and also Spain in the 12th and 13th centuries. After\\n\\t\\t\\t\\tthem this area was ruled once again by local dynasties such as\\n\\t\\t\\t\\tthe Sharifids of Morocco who still rule in that country. As for\\n\\t\\t\\t\\tSpain itself, Muslim power continued to wane until the last\\n\\t\\t\\t\\tMuslim dynasty was defeated in Granada in 1492 thus bringing\\n\\t\\t\\t\\tnearly eight hundred years of Muslim rule in Spain to an end.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "Islamic History after the Mongol Invasion",
    "SecNoValue": "6",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe Mongols devastated the eastern lands of Islam and ruled from\\n\\t\\t\\t\\tthe Sinai Desert to India for a century. But they soon converted\\n\\t\\t\\t\\tto Islam and became known as the Il-Khanids. They were in turn\\n\\t\\t\\t\\tsucceeded by Timur and his descendents who made Samarqand their\\n\\t\\t\\t\\tcapital and ruled from 1369 to 1500. The sudden rise of Timur\\n\\t\\t\\t\\tdelayed the formation and expansion of the Ottoman empire but\\n\\t\\t\\t\\tsoon the Ottomans became the dominant power in the Islamic world.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "Ottoman Empire",
    "SecNoValue": "7",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tFrom humble origins the Turks rose to dominate over the whole of\\n\\t\\t\\t\\tAnatolia and even parts of Europe. In 1453 Mehmet the Conqueror\\n\\t\\t\\t\\tcaptured Constantinople and put an end to the Byzantine empire.\\nThe Ottomans conquered much of eastern Europe and nearly the whole\\n\\t\\t\\t\\tof the Arab world, only Morocco and Mauritania in the West and\\n\\t\\t\\t\\tYemen, Hadramaut and parts of the Arabian peninsula remaining\\n\\t\\t\\t\\tbeyond their control. They reached their zenith of power with\\n\\t\\t\\t\\tSuleyman the Magnificent whose armies reached Hungary and\\n\\t\\t\\t\\tAustria. From the 17th century onward with the rise of Western\\n\\t\\t\\t\\tEuropean powers and later Russia, the power of the Ottomans began\\n\\t\\t\\t\\tto wane. But they nevertheless remained a force to be reckoned\\n\\t\\t\\t\\twith until the First World War when they were defeated by the\\nWestern nations. Soon thereafter Kamal Ataturk gained power in\\n\\t\\t\\t\\tTurkey and abolished the six centuries of rule of the Ottomans in\\n\\t\\t\\t\\t1924.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "Persia",
    "SecNoValue": "8",
    "SubSec": "NULL",
    "Text": "<p>\\nWhile the Ottomans were concerned mostly with the western front of\\n\\t\\t\\t\\ttheir empire, to the east in Persia a new dynasty called the\\n\\t\\t\\t\\tSafavids came to power in 1502. The Safavids established a\\n\\t\\t\\t\\tpowerful state of their own which flourished for over two\\n\\t\\t\\t\\tcenturies and became known for the flowering of the arts. Their\\n\\t\\t\\t\\tcapital, Isfahan, became one of the most beautiful cities with\\n\\t\\t\\t\\tits blue tiled mosques and exquisite houses. The Afghan invasion\\n\\t\\t\\t\\tof 1736 put an end to Safavid rule and prepared the independence\\n\\t\\t\\t\\tof Afghanistan which occurred formally in the 19th century. Persia\\nitself fell into turmoil until Nader Shah, the last Oriental\\n\\t\\t\\t\\tconqueror, reunited the country and even conquered India. But the\\n\\t\\t\\t\\trule of the dynasty established by him was short-lived. The Zand\\n\\t\\t\\t\\tdynasty soon took over to be overthrown by the Qajars in 1779 who\\n\\t\\t\\t\\tmade Tehran their capital and ruled until 1921 when they were in\\n\\t\\t\\t\\tturn replaced by the Pahlavis.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "India",
    "SecNoValue": "9",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAs for India, Islam entered into the land east of the Indus River\\n\\t\\t\\t\\tpeacefully. Gradually Muslims gained political power beginning in\\n\\t\\t\\t\\tthe early 13th century. But this period which marked the\\n\\t\\t\\t\\texpansion of both Islam and Islamic culture came to an end with\\n\\t\\t\\t\\tthe conquest of much of India in 1526 by Babur, one of the\\n\\t\\t\\t\\tTimurid princes. He established the powerful Mogul empire which\\n\\t\\t\\t\\tproduced such famous rulers as Akbar, Jahangir, and Shah Jahan\\n\\t\\t\\t\\tand which lasted, despite the gradual rise of British power in\\n\\t\\t\\t\\tIndia, until 1857 when it was officially abolished.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "Malaysia and Indonesia",
    "SecNoValue": "10",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tFarther east in the Malay world, Islam began to spread in the\\n12th century in northern Sumatra and soon Muslim kingdoms were\\n\\t\\t\\t\\testablished in Java, Sumatra and mainland Malaysia. Despite the\\n\\t\\t\\t\\tcolonization of the Malay world, Islam spread in that area\\n\\t\\t\\t\\tcovering present day Indonesia, Malaysia, the southern\\n\\t\\t\\t\\tPhilippines and southern Thailand, and is still continuing in\\n\\t\\t\\t\\tislands farther east.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "Africa",
    "SecNoValue": "11",
    "SubSec": "NULL",
    "Text": "<p>\\nAs far as Africa is concerned, Islam entered into East Africa at\\n\\t\\t\\t\\tthe very beginning of the Islamic period but remained confined to\\n\\t\\t\\t\\tthe coast for some time, only the Sudan and Somaliland becoming\\n\\t\\t\\t\\tgradually both Arabized and Islamized. West Africa felt the\\n\\t\\t\\t\\tpresence of Islam through North African traders who traveled\\n\\t\\t\\t\\twith their camel caravans south of the Sahara. By the 14th\\n\\t\\t\\t\\tcentury there were already Muslim sultanates in such areas as\\n\\t\\t\\t\\tMali, and Timbuctu in West Africa and Harar in East Africa had\\nbecome seats of Islamic learning.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tGradually Islam penetrated both inland and southward. There also\\n\\t\\t\\t\\tappeared major charismatic figures who inspired intense\\n\\t\\t\\t\\tresistance against European domination. The process of the\\n\\t\\t\\t\\tIslamization of Africa did not cease during the colonial period\\n\\t\\t\\t\\tand continues even today with the result that most Africans are\\n\\t\\t\\t\\tnow Muslims carrying on a tradition which has had practically as\\n\\t\\t\\t\\tlong a history in certain areas of sub-Saharan Africa as Islam\\n\\t\\t\\t\\titself.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam A World Civilization",
    "BookCode": "WOI",
    "SectionHead": "NULL",
    "SecNoValue": "NULL",
    "SubSec": "NULL",
    "Text": "\"Thus We have appointed you a middle nation, that you may be\\n\\t\\t\\twitnesses upon mankind.\" (Quran, Surah II: 143)"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "The Attitude of the Quran and the Prophet toward Knowledge",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIslam is a religion based upon knowledge for it is ultimately\\n\\t\\t\\t\\tknowledge of the Oneness of God combined with faith and total\\n\\t\\t\\t\\tcommitment to Him that saves man. The text of the Quran is\\n\\t\\t\\t\\treplete with verses inviting man to use his intellect, to ponder,\\n\\t\\t\\t\\tto think and to know, for the goal of human life is to discover\\n\\t\\t\\t\\tthe Truth which is none other than worshipping God in His\\n\\t\\t\\t\\tOneness. The Hadith literature is also full of references to the\\n\\t\\t\\t\\timportance of knowledge. Such sayings of the Prophet as \"Seek\\n\\t\\t\\t\\tknowledge even in China\", \"Seek knowledge from the cradle to the\\n\\t\\t\\t\\tgrave\", and \"Verily the men of knowledge are the inheritors of\\n\\t\\t\\t\\tthe prophets\", have echoed throughout the history of Islam and\\n\\t\\t\\t\\tincited Muslims to seek knowledge wherever it might be found.\\n\\t\\t\\t\\tDuring most of its history, Islamic civilization has been witness\\n\\t\\t\\t\\tto a veritable celebration of knowledge. That is why every\\n\\t\\t\\t\\ttraditional Islamic city possessed public and private libraries\\n\\t\\t\\t\\tand some cities like Cordoba and Baghdad boasted of libraries\\n\\t\\t\\t\\twith over 400,000 books. Such cities also had bookstores, some of\\n\\t\\t\\t\\twhich sold a large number of titles. That is also why the scholar\\n\\t\\t\\t\\thas always been held in the highest esteem in Islamic society.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Integration of the Pre-Islamic Sciences",
    "SecNoValue": "2",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAs Islam spread northward into Syria, Egypt, and the Persian\\n\\t\\t\\t\\tempire, it came face to face with the sciences of antiquity whose\\n\\t\\t\\t\\theritage had been preserved in centers which now became a part of\\n\\t\\t\\t\\tthe Islamic world. Alexandria had been a major center of sciences\\n\\t\\t\\t\\tand learning for centuries. The Greek learning cultivated in\\n\\t\\t\\t\\tAlexandria was opposed by the Byzantines who had burned its\\n\\t\\t\\t\\tlibrary long before the advent of Islam. The tradition of\\n\\t\\t\\t\\tAlexandrian learning did not die, however. It was transferred to\\n\\t\\t\\t\\tAntioch and from there farther east to such cities as Edessa by\\n\\t\\t\\t\\teastern Christians who stood in sharp opposition to Byzantium and\\n\\t\\t\\t\\twished to have their own independent centers of learning.\\n\\t\\t\\t\\tMoreover, the Persian king, Shapur I, had established Jundishapur\\n\\t\\t\\t\\tin Persia as a second great center of learning matching Antioch.\\n\\t\\t\\t\\tHe even invited Indian physicians and mathematicians to teach in\\n\\t\\t\\t\\tthis major seat of learning, in addition to the Christian\\n\\t\\t\\t\\tscholars who taught in Syriac as well as the Persians whose\\n\\t\\t\\t\\tmedium of instruction was Pahlavi.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tOnce Muslims established the new Islamic order during the Umayyad\\n\\t\\t\\t\\tperiod, they turned their attention to these centers of learning\\n\\t\\t\\t\\twhich had been preserved and sought to acquaint themselves with\\n\\t\\t\\t\\tthe knowledge taught and cultivated in them. They therefore set\\n\\t\\t\\t\\tabout with a concerted effort to translate the philosophical and\\n\\t\\t\\t\\tscientific works which were available to them from not only Greek\\n\\t\\t\\t\\tand Syriac (which was the language of eastern Christian scholars)\\n\\t\\t\\t\\tbut also from Pahlavi, the scholarly language of pre-Islamic\\n\\t\\t\\t\\tPersia, and even from Sanskrit. Many of the accomplished\\n\\t\\t\\t\\ttranslators were Christian Arabs such as Hunayn ibn Ishaq, who\\n\\t\\t\\t\\twas also an outstanding physician, and others Persians such as\\n\\t\\t\\t\\tIbn Muqaffa', who played a major role in the creation of the new\\n\\t\\t\\t\\tArabic prose style conducive to the expression of philosophical\\n\\t\\t\\t\\tand scientific writings. The great movement of translation lasted\\n\\t\\t\\t\\tfrom the beginning of the 8th to the end of the 9th century,\\n\\t\\t\\t\\treaching its peak with the establishment of the House of Wisdom\\n\\t\\t\\t\\t(Bayt alhikmah) by the caliph al-Ma'mun at the beginning of the\\n\\t\\t\\t\\t9th century.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe result of this extensive effort of the Islamic community to\\n\\t\\t\\t\\tconfront the challenge of the presence of the various\\n\\t\\t\\t\\tphilosophies and sciences of antiquity and to understand and\\n\\t\\t\\t\\tdigest them in its own terms and according to its own world view\\n\\t\\t\\t\\twas the translation of a vast corpus of writings into Arabic.\\n\\t\\t\\t\\tMost of the important philosophical and scientific works of\\n\\t\\t\\t\\tAristotle and his school, much of Plato and the Pythagorean\\n\\t\\t\\t\\tschool, and the major works of Greek astronomy, mathematics and\\n\\t\\t\\t\\tmedicine such as the Almagest of Ptolemy, the Elements of Euclid,\\n\\t\\t\\t\\tand the works of Hippocrates and Galen, were all rendered into\\n\\t\\t\\t\\tArabic. Furthermore, important works of astronomy, mathematics\\n\\t\\t\\t\\tand medicine were translated from Pahlavi and Sanskrit. As a\\n\\t\\t\\t\\tresult, Arabic became the most important scientific language of\\n\\t\\t\\t\\tthe world for many centuries and the depository of much of the\\n\\t\\t\\t\\twisdom and the sciences of antiquity.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Muslims did not translate the scientific and philosophical\\n\\t\\t\\t\\tworks of other civilizations out of fear of political or economic\\n\\t\\t\\t\\tdomination but because the structure of Islam itself is based\\n\\t\\t\\t\\tupon the primacy of knowledge. Nor did they consider these forms\\n\\t\\t\\t\\tof knowing as \"un-lslamic\" as long as they confirmed the doctrine\\n\\t\\t\\t\\tof God's Oneness which Islam considers to have been at the heart\\n\\t\\t\\t\\tof every authentic revelation from God. Once these sciences and\\n\\t\\t\\t\\tphilosophies confirmed the principle of Oneness, the Muslims\\n\\t\\t\\t\\tconsidered them as their own. They made them part of their world\\n\\t\\t\\t\\tview and began to cultivate the Islamic sciences based on what\\n\\t\\t\\t\\tthey had translated, analyzed, criticized, and assimilated,\\n\\t\\t\\t\\trejecting what was not in conformity with the Islamic perspective\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Mathematical Sciences and Physics",
    "SecNoValue": "3",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe Muslim mind has always been attracted to the mathematical\\n\\t\\t\\t\\tsciences in accordance with the \"abstract\" character of the\\n\\t\\t\\t\\tdoctrine of Oneness which lies at the heart of Islam. The\\n\\t\\t\\t\\tmathematical sciences have traditionally included astronomy,\\n\\t\\t\\t\\tmathematics itself and much of what is called physics today.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Astronomy",
    "SecNoValue": "4",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIn astronomy the Muslims integrated the astronomical traditions\\n\\t\\t\\t\\tof the Indians, Persians, the ancient Near East and especially\\n\\t\\t\\t\\tthe Greeks into a synthesis which began to chart a new chapter in\\n\\t\\t\\t\\tthe history of astronomy from the 8th century onward. The\\n\\t\\t\\t\\tAlmagest of Ptolemy, whose very name in English reveals the\\n\\t\\t\\t\\tArabic origin of its Latin translation, was thoroughly studied\\n\\t\\t\\t\\tand its planetary theory criticized by several astronomers of\\n\\t\\t\\t\\tboth the eastern and western lands of Islam leading to the major\\n\\t\\t\\t\\tcritique of the theory by Nasir al-Din al-Tusi and his students,\\n\\t\\t\\t\\tespecially Qutb alDin al-Shirazi, in the 13th century.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Muslims also observed the heavens carefully and discovered\\n\\t\\t\\t\\tmany new stars. The book on stars of 'Abd al-Rahman al-Sufi was\\n\\t\\t\\t\\tin fact translated into Spanish by Alfonso X el Sabio and had a\\n\\t\\t\\t\\tdeep influence upon stellar toponymy in European languages. Many\\n\\t\\t\\t\\tstar names in English such as Aldabaran still recall their Arabic\\n\\t\\t\\t\\torigin. The Muslims carried out many fresh observations which\\n\\t\\t\\t\\twere contained in astronomical tables called zij. One of the\\n\\t\\t\\t\\tacutest of these observers was al-Battani whose work was followed\\n\\t\\t\\t\\tby numerous others. The zij of al-Ma'mun observed in Baghdad, the\\n\\t\\t\\t\\tHakimite zij of Cairo, the Toledan Tables of alZarqali and his\\n\\t\\t\\t\\tassociates, the ll-Khanid zij of Nasir al-Din al-Tusi observed in\\n\\t\\t\\t\\tMaraghah, and the zij of Ulugh-Beg from Samarqand are among the\\n\\t\\t\\t\\tmost famous Islamic astronomical tables. They wielded a great\\n\\t\\t\\t\\tdeal of influence upon Western astronomy up to the time of Tycho\\n\\t\\t\\t\\tBrahe. The Muslims were in fact the first to create an\\n\\t\\t\\t\\tastronomical observatory as a scientific institution, this being\\n\\t\\t\\t\\tthe observatory of Maraghah in Persia established by al-Tusi.\\n\\t\\t\\t\\tThis was indirectly the model for the later European\\n\\t\\t\\t\\tobservatories . Many astronomical instruments were developed by\\n\\t\\t\\t\\tMuslims to carry out observation, the most famous being the\\n\\t\\t\\t\\tastrolabe. There existed even mechanical astrolabes perfected by\\n\\t\\t\\t\\tIbn Samh which must be considered as the ancestor of the\\n\\t\\t\\t\\tmechanical clock.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAstronomical observations also had practical applications\\n\\t\\t\\t\\tincluding not only finding the direction of Makkah for prayers,\\n\\t\\t\\t\\tbut also devising almanacs (the word itself being of Arabic\\n\\t\\t\\t\\torigin). The Muslims also applied their astronomical knowledge to\\n\\t\\t\\t\\tquestions of time-keeping and the calendar. The most exact solar\\n\\t\\t\\t\\tcalendar existing to this day is the Jalali calendar devised\\n\\t\\t\\t\\tunder the direction of 'Umar Khayyam in the 12th century and\\n\\t\\t\\t\\tstill in use in Persia and Afghanistan.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Mathematics, Algebra",
    "SecNoValue": "5",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAs for mathematics proper, like astronomy, it received its direct\\n\\t\\t\\t\\timpetus from the Quran not only because of the mathematical\\n\\t\\t\\t\\tstructure related to the text of the Sacred Book, but also\\n\\t\\t\\t\\tbecause the laws of inheritance delineated in the Quran require\\n\\t\\t\\t\\trather complicated mathematical solutions. Here again Muslims\\n\\t\\t\\t\\tbegan by integrating Greek and Indian mathematics. The first\\n\\t\\t\\t\\tgreat Muslim mathematician, al-Khwarazmi, who lived in the 9th\\n\\t\\t\\t\\tcentury, wrote a treatise on arithmetic whose Latin translation\\n\\t\\t\\t\\tbrought what is known as Arabic numerals to the West. To this day\\n\\t\\t\\t\\tguarismo, derived from his name, means figure or digit in Spanish\\n\\t\\t\\t\\twhile algorithm is still used in English. Al-Khwarazmi is also\\n\\t\\t\\t\\tthe author of the first book on algebra. This science was\\n\\t\\t\\t\\tdeveloped by Muslims on the basis of earlier Greek and Indian\\n\\t\\t\\t\\tworks of a rudimentary nature. The very name algebra comes from\\n\\t\\t\\t\\tthe first part of the name of the book of al-Khwarazmi, entitled\\n\\t\\t\\t\\tKirah al-jahr wa'l-muqabalah. Abu Kamil al-Shuja' discussed\\n\\t\\t\\t\\talgebraic equations with five unknowns. The science was further\\n\\t\\t\\t\\tdeveloped by such figures as al-Karaji until it reached its peak\\n\\t\\t\\t\\twith Khayyam who classified by kind and class algebraic equations\\n\\t\\t\\t\\tup to the third degree.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Geometry",
    "SecNoValue": "6",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe Muslims also excelled in geometry as reflected in their art.\\n\\t\\t\\t\\tThe brothers Banu Musa who lived in the 9th century may be said\\n\\t\\t\\t\\tto be the first outstanding Muslim geometers while their\\n\\t\\t\\t\\tcontemporary Thabit ibn Qurrah used the method of exhaustion,\\n\\t\\t\\t\\tgiving a glimpse of what was to become integral calculus. Many\\n\\t\\t\\t\\tMuslim mathematicians such as Khayyam and al-Tusi also dealt with\\n\\t\\t\\t\\tthe fifth postulate of Euclid and the problems which follow if\\n\\t\\t\\t\\tone tries to prove this postulate within the confines of\\n\\t\\t\\t\\tEuclidean geometry.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Trigonometry",
    "SecNoValue": "7",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAnother branch of mathematics developed by Muslims is\\n\\t\\t\\t\\ttrigonometry which was established as a distinct branch of\\n\\t\\t\\t\\tmathematics by al-Biruni. The Muslim mathematicians, especially\\n\\t\\t\\t\\tal-Battani, Abu'l-Wafa', Ibn Yunus and Ibn al-Haytham, also\\n\\t\\t\\t\\tdeveloped spherical astronomy and applied it to the solution of\\n\\t\\t\\t\\tastronomical problems.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Number Theory",
    "SecNoValue": "8",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe love for the study of magic squares and amicable numbers led\\n\\t\\t\\t\\tMuslims to develop the theory of numbers. Al-Khujandi discovered\\n\\t\\t\\t\\ta particular case of Fermat's theorem that \"the sum of two cubes\\n\\t\\t\\t\\tcannot be another cube\", while alKaraji analyzed arithmetic and\\n\\t\\t\\t\\tgeometric progressions such as: 1^3+2^3+3^3+...+n^3=(\\n\\t\\t\\t\\t1+2+3+...+n)^2.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAl-Biruni also dealt with progressions while Ghiyath al-Din\\n\\t\\t\\t\\tJamshid al-Kashani brought the study of number theory among\\n\\t\\t\\t\\tMuslims to its peak.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Physics, Balance, Projectile Motion, Optics",
    "SecNoValue": "9",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIn the field of physics the Muslims made contributions in\\n\\t\\t\\t\\tespecially three domains. The first was the measurement of\\n\\t\\t\\t\\tspecific weights of objects and the study of the balance\\n\\t\\t\\t\\tfollowing upon the work of Archimedes. In this domain the\\n\\t\\t\\t\\twritings of al-Biruni and al-Khazini stand out. Secondly they\\n\\t\\t\\t\\tcriticized the Aristotelian theory of projectile motion and tried\\n\\t\\t\\t\\tto quantify this type of motion. The critique of Ibn Sina,\\n\\t\\t\\t\\tAbu'l-Barakat al-Baghdadi, Ibn Bajjah and others led to the\\n\\t\\t\\t\\tdevelopment of the idea of impetus and momentum and played an\\n\\t\\t\\t\\timportant role in the criticism of Aristotelian physics in the\\n\\t\\t\\t\\tWest up to the early writings of Galileo. Thirdly there is the\\n\\t\\t\\t\\tfield of optics in which the Islamic sciences produced in Ibn\\n\\t\\t\\t\\tal-Haytham (the Latin Alhazen) who lived in the 11th century, the\\n\\t\\t\\t\\tgreatest student of optics between Ptolemy and Witelo. Ibn\\n\\t\\t\\t\\tal-Haytham's main work on optics, the Kitah al-manazir, was also\\n\\t\\t\\t\\twell known in the West as Thesaurus opticus. Ibn al-Haytham\\n\\t\\t\\t\\tsolved many optical problems, one of which is named after him,\\n\\t\\t\\t\\tstudied the property of lenses, discovered the camera obscura,\\n\\t\\t\\t\\texplained correctly the process of vision, studied the structure\\n\\t\\t\\t\\tof the eye, and explained for the first time why the sun and the\\n\\t\\t\\t\\tmoon appear larger on the horizon. His interest in optics was\\n\\t\\t\\t\\tcarried out two centuries later by Qutb al-Din al-Shirazi and\\n\\t\\t\\t\\tKamal al-Din al-Farisi. It was Qutb al-Din who gave the first\\n\\t\\t\\t\\tcorrect explanation of the formation of the rainbow.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Experimental Method",
    "SecNoValue": "10",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIt is important to recall that in physics as in many other fields\\n\\t\\t\\t\\tof science the Muslims observed, measured and carried out\\n\\t\\t\\t\\texperiments. They must be credited with having developed what\\n\\t\\t\\t\\tcame to be known later as the experimental method.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Medical Sciences",
    "SecNoValue": "11",
    "SubSec": "Rhazes Anatomy Smallpox Antiseptic Psychosomatic Medicine",
    "Text": "<p>\\n\\t\\t\\t\\t\\tThe Paradise of Wisdom (Firdaws al-hikmah ) by 'Ali ibn\\n\\t\\t\\t\\t\\tRabban al-Tabari, who synthesized the Hippocratic and\\n\\t\\t\\t\\t\\tGalenic traditions of medicine with those of India and\\n\\t\\t\\t\\t\\tPersia. His student, Muhammad ibn Zakariyya' al-Razi (the\\n\\t\\t\\t\\t\\tLatin Rhazes), was one of the greatest of physicians who\\n\\t\\t\\t\\t\\temphasized clinical medicine and observation. He was a\\n\\t\\t\\t\\t\\tmaster of prognosis and psychosomatic medicine and also\\n\\t\\t\\t\\t\\tof anatomy. He was the first to identify and treat\\n\\t\\t\\t\\t\\tsmallpox, to use alcohol as an antiseptic and make\\n\\t\\t\\t\\t\\tmedical use of mercury as a purgative. His Kitab al-hawi\\n\\t\\t\\t\\t\\t(Continens) is the longest work ever written in Islamic\\n\\t\\t\\t\\t\\tmedicine and he was recognized as a medical authority in\\n\\t\\t\\t\\t\\tthe West up to the 18th century.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Medical Sciences",
    "SecNoValue": "11",
    "SubSec": "The Canon of Medicine and Meningitis",
    "Text": "<p>\\n\\t\\t\\t\\t\\tThe greatest of all Muslim physicians, however, was Ibn\\n\\t\\t\\t\\t\\tSina who was called \"the prince of physicians\" in the\\n\\t\\t\\t\\t\\tWest. He synthesized Islamic medicine in his major\\n\\t\\t\\t\\t\\tmasterpiece, al-Qanun fi'l tibb (The Canon of Medicine),\\n\\t\\t\\t\\t\\twhich is the most famous of all medical books in history.\\n\\t\\t\\t\\t\\tIt was the final authority in medical matters in Europe\\n\\t\\t\\t\\t\\tfor nearly six centuries and is still taught wherever\\n\\t\\t\\t\\t\\tIslamic medicine has survived to this day in such lands\\n\\t\\t\\t\\t\\tas Pakistan and India. Ibn Sina discovered many drugs and\\n\\t\\t\\t\\t\\tidentified and treated several ailments such as\\n\\t\\t\\t\\t\\tmeningitis but his greatest contribution was in the\\n\\t\\t\\t\\t\\tphilosophy of medicine. He created a system of medicine\\n\\t\\t\\t\\t\\twithin which medical practice could be carried out and in\\n\\t\\t\\t\\t\\twhich physical and psychological factors, drugs and diet\\n\\t\\t\\t\\t\\tare combined.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Medical Sciences",
    "SecNoValue": "11",
    "SubSec": "Pulmonary Circulation",
    "Text": "<p>\\n\\t\\t\\t\\t\\tAfter Ibn Sina, Islamic medicine divided into several\\n\\t\\t\\t\\t\\tbranches. In the Arab world Egypt remained a major center\\n\\t\\t\\t\\t\\tfor the study of medicine, especially ophthalmology which\\n\\t\\t\\t\\t\\treached its peak at the court of al-Hakim. Cairo\\n\\t\\t\\t\\t\\tpossessed excellent hospitals which also drew physicians\\n\\t\\t\\t\\t\\tfrom other lands including Ibn Butlan, author of the\\n\\t\\t\\t\\t\\tfamous Calendar of Health, and Ibn Nafis who discovered\\n\\t\\t\\t\\t\\tthe lesser or pulmonary circulation of the blood long\\n\\t\\t\\t\\t\\tbefore Michael Servetus, who is usually credited with the\\n\\t\\t\\t\\t\\tdiscovery.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Medical Sciences",
    "SecNoValue": "11",
    "SubSec": "Gynecology",
    "Text": "<p>\\n\\t\\t\\t\\t\\tAs for the western lands of Islam including Spain, this\\n\\t\\t\\t\\t\\tarea was likewise witness to the appearance of\\n\\t\\t\\t\\t\\toutstanding physicians such as Sa'd al-Katib of Cordoba\\n\\t\\t\\t\\t\\twho composed a treatise on gynecology, and the greatest\\n\\t\\t\\t\\t\\tMuslim figure in surgery, the 12th century Abu'l-Qasim\\n\\t\\t\\t\\t\\tal-Zahrawi (the Latin Albucasis) whose medical\\n\\t\\t\\t\\t\\tmasterpiece Kitab al-tasrif was well known in the West as\\n\\t\\t\\t\\t\\tConcessio. One must also mention the Ibn Zuhr family\\n\\t\\t\\t\\t\\twhich produced several outstanding physicians and Abu\\n\\t\\t\\t\\t\\tMarwan 'Abd al-Malik who was the Maghrib's most\\n\\t\\t\\t\\t\\toutstanding clinical physician. The well known Spanish\\n\\t\\t\\t\\t\\tphilosophers, Ibn Tufayl and Ibn Rushd, were also\\n\\t\\t\\t\\t\\toutstanding physicians.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tIslamic medicine continued in Persia and the other\\n\\t\\t\\t\\t\\teastern lands of the Islamic world under the influence of\\n\\t\\t\\t\\t\\tIbn Sina with the appearance of major Persian medical\\n\\t\\t\\t\\t\\tcompendia such as the Treasury of Sharaf al-Din\\n\\t\\t\\t\\t\\tal-Jurjani and the commentaries upon the Canon by Fakhr\\n\\t\\t\\t\\t\\tal-Din al-Razi and Qutb al-Din al-Shirazi. Even after the\\n\\t\\t\\t\\t\\tMongol invasion, medical studies continued as can be seen\\n\\t\\t\\t\\t\\tin the work of Rashid al-Din Fadlallah, and for the first\\n\\t\\t\\t\\t\\ttime there appeared translations of Chinese medicine and\\n\\t\\t\\t\\t\\tinterest in acupuncture among Muslims. The Islamic\\n\\t\\t\\t\\t\\tmedical tradition was revived in the Safavid period when\\n\\t\\t\\t\\t\\tseveral diseases such as whooping cough were diagnosed\\n\\t\\t\\t\\t\\tand treated for the first time and much attention was\\n\\t\\t\\t\\t\\tpaid to pharmacology. Many Persian doctors such as 'Ayn\\n\\t\\t\\t\\t\\tal-Mulk of Shiraz also travelled to India at this time to\\n\\t\\t\\t\\t\\tusher in the golden age of Islamic medicine in the\\n\\t\\t\\t\\t\\tsubcontinent and to plant the seed of the Islamic medical\\n\\t\\t\\t\\t\\ttradition which continues to flourish to this day in the\\n\\t\\t\\t\\t\\tsoil of that land.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Medical Sciences",
    "SecNoValue": "11",
    "SubSec": "Major Hospitals",
    "Text": "<p>\\n\\t\\t\\t\\t\\tThe Ottoman world was also an arena of great medical\\n\\t\\t\\t\\t\\tactivity derived from the heritage of Ibn Sina. The\\n\\t\\t\\t\\t\\tOttoman Turks were especially known for the creation of\\n\\t\\t\\t\\t\\tmajor hospitals and medical centers. These included not\\n\\t\\t\\t\\t\\tonly units for the care of the physically ill, but also\\n\\t\\t\\t\\t\\twards for patients with psychological ailments. The\\n\\t\\t\\t\\t\\tOttomans were also the first to receive the influence of\\n\\t\\t\\t\\t\\tmodem European medicine in both medicine and\\n\\t\\t\\t\\t\\tpharmacology.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tIn mentioning Islamic hospitals it is necessary to\\n\\t\\t\\t\\t\\tmention that all major Islamic cities had hospitals; some\\n\\t\\t\\t\\t\\tlike those of Baghdad were teaching hospitals while some\\n\\t\\t\\t\\t\\tlike the Nasiri hospital of Cairo had thousands of beds\\n\\t\\t\\t\\t\\tfor patients with almost any type of illness. Hygiene in\\n\\t\\t\\t\\t\\tthese hospitals was greatly emphasized and al-Razi had\\n\\t\\t\\t\\t\\teven written a treatise on hygiene in hospitals. Some\\n\\t\\t\\t\\t\\thospitals also specialized in particular diseases\\n\\t\\t\\t\\t\\tincluding psychological ones. Cairo even had a hospital\\n\\t\\t\\t\\t\\twhich specialized in patients having insomnia.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Medical Sciences",
    "SecNoValue": "11",
    "SubSec": "NULL",
    "Text": ""
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Pharmacology",
    "SecNoValue": "12",
    "SubSec": "NULL",
    "Text": "<p>\\nIslamic medical authorities were also always concerned with the\\n\\t\\t\\t\\tsignificance of pharmacology and many important works such as the\\n\\t\\t\\t\\tCanon have whole books devoted to the subject. The Muslims became\\n\\t\\t\\t\\their not only to the pharmacological knowledge of the Greeks as\\n\\t\\t\\t\\tcontained in the works of Dioscorides, but also the vast herbal\\npharmacopoeias of the Persians and Indians. They also studied the\\n\\t\\t\\t\\tmedical effects of many drugs, especially herbs, themselves. The\\n\\t\\t\\t\\tgreatest contributions in this field came from Maghribi\\n\\t\\t\\t\\tscientists such as Ibn Juljul, Ibn al-Salt and the most original\\nof Muslim pharmacologist, the 12th century scientist,\\n\\t\\t\\t\\tal-Ghafiqi, whose Book of Simple Drugs provides the best\\n\\t\\t\\t\\tdescriptions of the medical properties of plants known to\\n\\t\\t\\t\\tMuslims. Islamic medicine combined the use of drugs for medical\\n\\t\\t\\t\\tpurposes with dietary considerations and a whole lifestyle\\n\\t\\t\\t\\tderived from the teachings of Islam to create a synthesis which\\n\\t\\t\\t\\thas not died out to this day despite the introduction of modem\\n\\t\\t\\t\\tmedicine into most of the Islamic world.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Natural History and Geography",
    "SecNoValue": "13",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe vast expanse of the Islamic world enabled the Muslims to\\n\\t\\t\\t\\tdevelop natural history based not only on the Mediterranean\\n\\t\\t\\t\\tworld, as was the case of the Greek natural historians, but also\\n\\t\\t\\t\\ton most of the Eurasian and even African land masses. Knowledge\\n\\t\\t\\t\\tof minerals, plants and animals was assembled from areas as far\\n\\t\\t\\t\\taway as the Malay world and synthesized for the first time by Ibn\\n\\t\\t\\t\\tSina in his Kitab al-Shifa' (The Book of Healing). Such major\\n\\t\\t\\t\\tnatural historians as al-Mas'udi intertwined natural and human\\n\\t\\t\\t\\thistory. Al-Biruni likewise in his study of India turned to the\\n\\t\\t\\t\\tnatural history and even geology of the region, describing\\n\\t\\t\\t\\tcorrectly the sedimentary nature of the Ganges basin. He also\\n\\t\\t\\t\\twrote the most outstanding Muslim work on mineralogy.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Botany, Zoology",
    "SecNoValue": "14",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAs for botany, the most important treatises were composed in the\\n\\t\\t\\t\\t12th century in Spain with the appearance of the work of\\n\\t\\t\\t\\tal-Ghafiqi. This is also the period when the best known Arabic\\n\\t\\t\\t\\twork on agriculture, the Kitab al-falahah, was written. The\\n\\t\\t\\t\\tMuslims also showed much interest in zoology especially in horses\\n\\t\\t\\t\\tas witnessed by the classical text of al-Jawaliqi, and in falcons\\n\\t\\t\\t\\tand other hunting birds. The works of al-Jahiz and al-Damiri are\\n\\t\\t\\t\\tespecially famous in the field of zoology and deal with the\\n\\t\\t\\t\\tliterary, moral and even theological dimensions of the study of\\n\\t\\t\\t\\tanimals as well as the purely zoological aspects of the subject.\\n\\t\\t\\t\\tThis is also true of a whole class of writings on the \"wonders of\\n\\t\\t\\t\\tcreation\" of which the book of Abu Yahya al-Qazwini, the 'Aja'ih\\n\\t\\t\\t\\tal-makhluqat (The Wonders of Creation) is perhaps the most\\n\\t\\t\\t\\tfamous.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Geography",
    "SecNoValue": "15",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tLikewise in geography, Muslims were able to extend their horizons\\n\\t\\t\\t\\tfar beyond the world of Ptolemy. As a result of travel over land\\n\\t\\t\\t\\tand by sea and the facile exchange of ideas made possible by the\\n\\t\\t\\t\\tunified structure of the Islamic world and the hajj which enables\\n\\t\\t\\t\\tpilgrims from all over the Islamic world to gather and exchange\\n\\t\\t\\t\\tideas in addition to visiting the House of God, a vast amount of\\n\\t\\t\\t\\tknowledge of areas from the Pacific to the Atlantic was\\n\\t\\t\\t\\tassembled. The Muslim geographers starting with al-Khwarazmi, who\\n\\t\\t\\t\\tlaid the foundation of this science among Muslims in the 9th\\n\\t\\t\\t\\tcentury, began to study the geography of practically the whole\\n\\t\\t\\t\\tglobe minus the Americas, dividing the earth into the traditional\\n\\t\\t\\t\\tseven climes each of which they studied carefully from both a\\n\\t\\t\\t\\tgeographical and climactic point of view. They also began to draw\\n\\t\\t\\t\\tmaps some of which reveal with remarkable accuracy many features\\n\\t\\t\\t\\tsuch as the origin of the Nile, not discovered in the West until\\n\\t\\t\\t\\tmuch later. The foremost among Muslim geographers was Abu\\n\\t\\t\\t\\t'Abdallah al-Idrisi, who worked at the court of Roger II in\\n\\t\\t\\t\\tSicily and who dedicated his famous book, Kitab al-rujari (The\\n\\t\\t\\t\\tBook of Roger) to him. His maps are among the great achievements\\n\\t\\t\\t\\tof Islamic science. It was in fact with the help of Muslim\\n\\t\\t\\t\\tgeographers and navigators that Magellan crossed the Cape of Good\\n\\t\\t\\t\\tHope into the Indian Ocean. Even Columbus made use of their\\n\\t\\t\\t\\tknowledge in his discovery of America.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Chemistry",
    "SecNoValue": "16",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe very name alchemy as well as its derivative chemistry come\\n\\t\\t\\t\\tfrom the Arabic al-kimiya'. The Muslims mastered Alexandrian and\\n\\t\\t\\t\\teven certain elements of Chinese alchemy and very early in their\\n\\t\\t\\t\\thistory, produced their greatest alchemist, Jabir ibn Hayyan (the\\n\\t\\t\\t\\tLatin Geber) who lived in the 8th century. Putting the\\n\\t\\t\\t\\tcosmological and symbolic aspects of alchemy aside, one can\\n\\t\\t\\t\\tassert that this art led to much experimentation with various\\n\\t\\t\\t\\tmaterials and in the hands of Muhammad ibn Zakariyya' al-Razi was\\n\\t\\t\\t\\tconverted into the science of chemistry. To this day certain\\n\\t\\t\\t\\tchemical instruments such as the alembic (al-'anbiq) still bear\\n\\t\\t\\t\\ttheir original Arabic names and the mercury-sulphur theory of\\n\\t\\t\\t\\tIslamic alchemy remains as the foundation of the acid-base theory\\n\\t\\t\\t\\tof chemistry. Al-Razi's division of materials into animal,\\n\\t\\t\\t\\tvegetable and mineral is still prevalent and a vast body of\\n\\t\\t\\t\\tknowledge of materials accumulated by Islamic alchemists and\\n\\t\\t\\t\\tchemists has survived over the centuries in both East and West.\\n\\t\\t\\t\\tFor example the use of dyes in objects of Islamic art ranging\\n\\t\\t\\t\\tfrom carpets to miniatures or the making of glass have much to do\\n\\t\\t\\t\\twith this branch of learning which the West learned completely\\n\\t\\t\\t\\tfrom Islamic sources since alchemy was not studied and practiced\\n\\t\\t\\t\\tin the West before the translation of Arabic texts into Latin in\\n\\t\\t\\t\\tthe 11th century .\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Technology",
    "SecNoValue": "17",
    "SubSec": "NULL",
    "Text": "<p>\\nIslam inherited the millennial experience in various forms of\\n\\t\\t\\t\\ttechnology from the peoples who entered the fold of Islam and the\\n\\t\\t\\t\\tnations which became part of Dar al-Islam. A wide range of\\n\\t\\t\\t\\ttechnological knowledge, from the building of water wheels by the\\n\\t\\t\\t\\tRomans to the underground water system by the Persians, became\\n\\t\\t\\t\\tpart and parcel of the technology of the newly founded order.\\n\\t\\t\\t\\tMuslims also imported certain kinds of technology from the Far\\n\\t\\t\\t\\tEast such as paper which they brought from China and whose\\n\\t\\t\\t\\ttechnology they later transmitted to the West. They also\\n\\t\\t\\t\\tdeveloped many forms of technology on the basis of earlier\\n\\t\\t\\t\\texisting knowledge such as the metallurgical art of making the\\n\\t\\t\\t\\tfamous Damascene swords, an art which goes back to the making of\\n\\t\\t\\t\\tsteel several thousand years before on the Iranian plateau.\\n\\t\\t\\t\\tLikewise Muslims developed new architectural techniques of\\n\\t\\t\\t\\tvaulting, methods of ventilation, preparations of dyes,\\n\\t\\t\\t\\ttechniques of weaving, technologies related to irrigation and\\n\\t\\t\\t\\tnumerous other forms of technology, some of which survive to this\\n\\t\\t\\t\\tday.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Man and Nature",
    "SecNoValue": "18",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIn general Islamic civilization emphasized the harmony between\\n\\t\\t\\t\\tman and nature as seen in the traditional design of Islamic\\n\\t\\t\\t\\tcities. Maximum use was made of natural elements and forces, and\\n\\t\\t\\t\\tmen built in harmony with, not in opposition to nature. Some of\\n\\t\\t\\t\\tthe Muslim technological feats such as dams which have survived\\n\\t\\t\\t\\tfor over a millenium, domes which can withstand earthquakes, and\\n\\t\\t\\t\\tsteel which reveals incredible metallurgical know-how, attest to\\n\\t\\t\\t\\tthe exceptional attainment of Muslims in many fields of\\n\\t\\t\\t\\ttechnology. In fact it was a vastly superior technology that\\n\\t\\t\\t\\tfirst impressed the Crusaders in their unsuccessful attempt to\\n\\t\\t\\t\\tcapture the Holy Land and much of this technology was brought\\n\\t\\t\\t\\tback by the Crusaders to the rest of Europe.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Architecture",
    "SecNoValue": "19",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tOne of the major achievements of Islamic civilization is\\n\\t\\t\\t\\tarchitecture which combines technology Treatises on natural and\\n\\t\\t\\t\\tart. The great masterpieces of Islamic architecture from the\\n\\t\\t\\t\\tCordoba Mosque and the Dome of\\tthe Rock in Jerusalem to the Taj\\n\\t\\t\\t\\tMahal in India, scientists were often display this perfect\\n\\t\\t\\t\\twedding between the artistic illustrated with detailed principles\\n\\t\\t\\t\\tof Islam and remarkable technological know-how. Much of the\\n\\t\\t\\t\\toutstanding medieval facilitate teaching of the architecture of\\n\\t\\t\\t\\tthe West is in fact indebted to the techniques of Islamic\\n\\t\\t\\t\\tarchitecture. When one views the Notre Dame in Paris or some\\n\\t\\t\\t\\tother Gothic cathedral, one is reminded of the building\\n\\t\\t\\t\\ttechniques which travelled from Muslim Cordoba northward. Gothic\\n\\t\\t\\t\\tarches as well as interior courtyards of so many medieval and\\n\\t\\t\\t\\tRenaissance European structures remind the viewer of the Islamic\\n\\t\\t\\t\\tarchitectural examples from which they originally drew. In fact\\n\\t\\t\\t\\tthe great medieval European architectural tradition is one of the\\n\\t\\t\\t\\telements of Western civilization most directly linked with the\\nIslamic world, while the presence of Islamic architecture can\\n\\t\\t\\t\\talso be directly experienced in the Moorish style found not only\\n\\t\\t\\t\\tin Spain and Latin America, but in the southwestern United States\\n\\t\\t\\t\\tas well.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "Influence of Islamic Science and Learning Upon the West",
    "SecNoValue": "20",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe oldest university in the world which is still functioning is\\n\\t\\t\\t\\tthe eleven hundred-year-old Islamic university of Fez, Morocco,\\n\\t\\t\\t\\tknown as the Qarawiyyin. This old tradition of Islamic learning\\n\\t\\t\\t\\tinfluenced the West greatly through Spain. In this land where\\n\\t\\t\\t\\tMuslims, Christians and Jews lived for the most part peacefully\\n\\t\\t\\t\\tfor many centuries, translations began to be made in the 11th\\n\\t\\t\\t\\tcentury mostly in Toledo of Islamic works into Latin often\\n\\t\\t\\t\\tthrough the intermediary of Jewish scholars most of whom knew\\n\\t\\t\\t\\tArabic and often wrote in Arabic. As a result of these\\n\\t\\t\\t\\ttranslations, Islamic thought and through it much of Greek\\n\\t\\t\\t\\tthought became known to the West and Western schools of learning\\n\\t\\t\\t\\tbegan to flourish. Even the Islamic educational system was\\n\\t\\t\\t\\temulated in Europe and to this day the term chair in a university\\n\\t\\t\\t\\treflects the Arabic kursi (literally seat) upon which a teacher\\n\\t\\t\\t\\twould sit to teach his students in the madrasah (school of higher\\n\\t\\t\\t\\tlearning). As European civilization grew and reached the high\\n\\t\\t\\t\\tMiddle Ages, there was hardly a field of learning or form of art,\\n\\t\\t\\t\\twhether it was literature or architecture, where there was not\\n\\t\\t\\t\\tsome influence of Islam present. Islamic learning became in this\\n\\t\\t\\t\\tway part and parcel of Western civilization even if with the\\n\\t\\t\\t\\tadvent of the Renaissance, the West not only turned against its\\n\\t\\t\\t\\town medieval past but also sought to forget the long relation it\\n\\t\\t\\t\\thad had with the Islamic world, one which was based on\\n\\t\\t\\t\\tintellectual respect despite religious opposition.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam, Knowledge and Science",
    "BookCode": "WOI",
    "SectionHead": "NULL",
    "SecNoValue": "NULL",
    "SubSec": "NULL",
    "Text": "\"He has taught you that which [heretofore] you knew not.\" (Quran,\\n\\t\\t\\tSurah II: 239)"
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "Aftermath of the Colonial Period",
    "SecNoValue": "1",
    "SubSec": "Arab",
    "Text": "<p>\\n\\t\\t\\t\\t\\tIt was only after the Second World War and the\\n\\t\\t\\t\\t\\tdismemberment of the British, French, Dutch and Spanish\\n\\t\\t\\t\\t\\tempires that the rest of the Islamic world gained its\\n\\t\\t\\t\\t\\tindependence. In the Arab world, Syria and Lebanon became\\n\\t\\t\\t\\t\\tindependent at the end of the war as did Libya and the\\n\\t\\t\\t\\t\\tsheikdoms around the Gulf and the Arabian Sea by the\\n\\t\\t\\t\\t\\t1960's. The North African countries of Tunisia, Morocco\\n\\t\\t\\t\\t\\tand Algeria had to fight a difficult and, in the case of\\n\\t\\t\\t\\t\\tAlgeria, long and protracted war to gain their freedom\\n\\t\\t\\t\\t\\twhich did not come until a decade later for Tunisia and\\n\\t\\t\\t\\t\\tMorocco and two decades later for Algeria. Only Palestine\\n\\t\\t\\t\\t\\tdid not become independent but was partitioned in 1948\\n\\t\\t\\t\\t\\twith the establishment of the state of Israel.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "Aftermath of the Colonial Period",
    "SecNoValue": "1",
    "SubSec": "India",
    "Text": "<p>\\n\\t\\t\\t\\t\\tIn India Muslims participated in the freedom movement\\n\\t\\t\\t\\t\\tagainst British rule along with Hindus and when\\n\\t\\t\\t\\t\\tindependence finally came in 1947, they were able to\\n\\t\\t\\t\\t\\tcreate their own homeland, Pakistan, which came into\\n\\t\\t\\t\\t\\tbeing for the sake of Islam and became the most populated\\n\\t\\t\\t\\t\\tMuslim state although many Muslims remained in India. In\\n\\t\\t\\t\\t\\t1971, however, the two parts of the state broke up, East\\n\\t\\t\\t\\t\\tPakistan becoming Bangladesh. \\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "Aftermath of the Colonial Period",
    "SecNoValue": "1",
    "SubSec": "Far East",
    "Text": "<p>\\n\\t\\t\\t\\t\\tFarther east still, the Indonesians finally gained their\\n\\t\\t\\t\\t\\tindependence from the Dutch and the Malays theirs from\\n\\t\\t\\t\\t\\tBritain. At first Singapore was part of Malaysia but it\\n\\t\\t\\t\\t\\tseparated in 1963 to become an independent state. Small\\n\\t\\t\\t\\t\\tcolonies still persisted in the area and continued to\\n\\t\\t\\t\\t\\tseek their independence, the kingdom of Brunei becoming\\n\\t\\t\\t\\t\\tindependent as recently as 1984.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "Aftermath of the Colonial Period",
    "SecNoValue": "1",
    "SubSec": "Africa",
    "Text": "<p>\\n\\t\\t\\t\\t\\tIn Africa also major countries with large or majority\\n\\t\\t\\t\\t\\tMuslim populations such as Nigeria, Senegal and Tanzania\\n\\t\\t\\t\\t\\tbegan to gain their independence in the 1950's and 1960's\\n\\t\\t\\t\\t\\twith the result that by the end of the decade of the 60's\\n\\t\\t\\t\\t\\tmost parts of the Islamic world were formed into\\n\\t\\t\\t\\t\\tindependent national states. There were, however,\\n\\t\\t\\t\\t\\texceptions. The Muslim states in the Soviet Union failed\\n\\t\\t\\t\\t\\tto gain their autonomy or independence. The same holds\\ntrue for Sinkiang (called Eastern Turkestan by Muslim\\n\\t\\t\\t\\t\\tgeographers) while in Eritrea and the southern\\n\\t\\t\\t\\t\\tPhilippines Muslim independence movements still continue.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "Aftermath of the Colonial Period",
    "SecNoValue": "1",
    "SubSec": "National States",
    "Text": "<p>\\n\\t\\t\\t\\t\\tWhile the world of Islam has entered into the modern\\n\\t\\t\\t\\t\\tworld in the form of national states, continuous attempts\\n\\t\\t\\t\\t\\tare made to create closer cooperation within the Islamic\\n\\t\\t\\t\\t\\tworld as a whole and to bring about greater unity. This\\n\\t\\t\\t\\t\\tis seen not only in the meetings of the Muslim heads of\\n\\t\\t\\t\\t\\tstate and the establishment of the OIC (Organization of\\n\\t\\t\\t\\t\\tIslamic Countries) with its own secretariat, but also in\\n\\t\\t\\t\\t\\tthe creation of institutions dealing with the whole of\\n\\t\\t\\t\\t\\tthe Islamic world. Among the most important of these is\\n\\t\\t\\t\\t\\tthe Muslim World League (Rabitat al-alam al-Islami ) with\\n\\t\\t\\t\\t\\tits headquarters in Makkah. Saudi Arabia has in fact\\n\\t\\t\\t\\t\\tplayed a pivotal role in the creation and maintenance of\\n\\t\\t\\t\\t\\tsuch organizations.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "Aftermath of the Colonial Period",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": ""
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "Revival and Reassertion of Islam",
    "SecNoValue": "2",
    "SubSec": "Reform Organizations",
    "Text": "<p>\r\\n\\t\\t\\t\\t\\tMoreover, as Western influence began to penetrate more\r\\n\\t\\t\\t\\t\\tdeeply into the fiber of Islamic society, organizations\r\\n\\t\\t\\t\\t\\tgradually grew up whose goal was to reform society in\r\\n\\t\\t\\t\\t\\tpractice along Islamic lines and prevent its\r\\n\\t\\t\\t\\t\\tsecularization. These included the Muslim Brotherhood\r\\n\\t\\t\\t\\t\\t(Ikhwan al-muslimin) founded in Egypt and with branches\r\\n\\t\\t\\t\\t\\tin many Muslim countries, and the Jama'at-i Islami of\r\\n\\t\\t\\t\\t\\tPakistan founded by the influential Mawlana Mawdudi.\r\\n\\t\\t\\t\\t\\tThese organizations have been usually peaceful and have\r\\n\\t\\t\\t\\t\\tsought to reestablish an Islamic order through education.\r\\n\\t\\t\\t\\t\\tDuring the last two decades, however, as a result of the\r\\n\\t\\t\\t\\t\\tfrustration of many Muslims in the face of pressures\r\\n\\t\\t\\t\\t\\tcoming from a secularized outside world, some have sought\r\\n\\t\\t\\t\\t\\tto reject the negative aspects of Western thought and\r\\n\\t\\t\\t\\t\\tculture and to return to an Islamic society based\r\\n\\t\\t\\t\\t\\tcompletely on the application of the Shari 'ah. Today in\r\\n\\t\\t\\t\\t\\tevery Muslim country there are strong movements to\r\\n\\t\\t\\t\\t\\tpreserve and propagate Islamic teachings. In countries\r\\n\\t\\t\\t\\t\\tsuch as Saudi Arabia Islamic Law is already being applied\r\\n\\t\\t\\t\\t\\tand in fact is the reason for the prosperity, development\r\\n\\t\\t\\t\\t\\tand stability of the country. In other countries where\r\\n\\t\\t\\t\\t\\tIslamic Law is not being applied, however, most of the\r\\n\\t\\t\\t\\t\\teffort of Islamic movements is spent in making possible\r\\n\\t\\t\\t\\t\\tthe full application of the Shari'ah so that the nation\r\\n\\t\\t\\t\\t\\tcan enjoy prosperity along with the fulfillment of the\r\\n\\t\\t\\t\\t\\tfaith of its people. In any case the widespread desire\r\\n\\t\\t\\t\\t\\tfor Muslims to have the religious law of Islam applied\r\\n\\t\\t\\t\\t\\tand to reassert their religious values and their own\r\\n\\t\\t\\t\\t\\tidentity must not be equated with exceptional violent\r\\n\\t\\t\\t\\t\\teruptions which do exist but which are usually treated\r\\n\\t\\t\\t\\t\\tsensationally and taken out of proportion by the mass\r\\n\\t\\t\\t\\t\\tmedia in the West.\r\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "Revival and Reassertation of Islam",
    "SecNoValue": "2",
    "SubSec": "NULL",
    "Text": ""
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "Education and Science in the Islamic World",
    "SecNoValue": "3",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIn seeking to live successfully in the modern world, in\\n\\t\\t\\t\\tindependence and according to Islamic principles, Muslim\\n\\t\\t\\t\\tcountries have been emphasizing a great deal the significance of\\n\\t\\t\\t\\tthe role of education and the importance of mastering Western\\n\\t\\t\\t\\tscience and technology. Already in the 19th century, certain\\n\\t\\t\\t\\tMuslim countries such as Egypt, Ottoman Turkey and Persia\\n\\t\\t\\t\\testablished institutions of higher learning where the modem\\n\\t\\t\\t\\tsciences and especially medicine were taught. During this century\\n\\t\\t\\t\\teducational institutions at all levels have proliferated\\n\\t\\t\\t\\tthroughout the Islamic world. Nearly every science ranging from\\n\\t\\t\\t\\tmathematics to biology as well as various fields of modern\\n\\t\\t\\t\\ttechnology are taught in these institutions and some notable\\n\\t\\t\\t\\tscientists have been produced by the Islamic world, men and women\\n\\t\\t\\t\\twho have often combined education in these institutions with\\n\\t\\t\\t\\ttraining in the West.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIn various parts of the Islamic world there is, however, a sense\\n\\t\\t\\t\\tthat educational institutions must be expanded and also have\\n\\t\\t\\t\\ttheir standards improved to the level of the best institutions in\\nthe world in various fields of learning especially science and\\n\\t\\t\\t\\ttechnology. At the same time there is an awareness that the\\n\\t\\t\\t\\teducational system must be based totally on Islamic principles\\n\\t\\t\\t\\tand the influence of alien cultural and ethical values and norms,\\n\\t\\t\\t\\tto the extent that they are negative, be diminished. To remedy\\n\\t\\t\\t\\tthis problem a number of international Islamic educational\\n\\t\\t\\t\\tconferences have been held, the first one in Makkah in 1977, and\\n\\t\\t\\t\\tthe foremost thinkers of the Islamic world have been brought\\n\\t\\t\\t\\ttogether to study and ponder over the question of the relation\\n\\t\\t\\t\\tbetween Islam and modern science. This is an ongoing process\\n\\t\\t\\t\\twhich is at the center of attention in many parts of the Islamic\\n\\t\\t\\t\\tworld and which indicates the significance of educational\\n\\t\\t\\t\\tquestions in the Islamic world today.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Islam In The Modern World",
    "BookCode": "WOI",
    "SectionHead": "NULL",
    "SecNoValue": "NULL",
    "SubSec": "NULL",
    "Text": "\"Most surely man is in loss, except those who believe and do\\n\\t\\t\\tgood, and enjoin on each other truth, and enjoin on each other\\n\\t\\t\\tpatience.\" (Quran, Surah CIII: 2-3)."
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What is Islam?",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIslam is not a new religion, but the same truth that God revealed\\n\\t\\t\\t\\tthrough all His prophets to every people. For a fifth of the\\n\\t\\t\\t\\tworld's population, Islam is both a religion and a complete way\\n\\t\\t\\t\\tof life. Muslims follow a religion of peace, mercy, and\\n\\t\\t\\t\\tforgiveness, and the majority have nothing to do with the\\n\\t\\t\\t\\textremely grave events which have come to be associated with\\n\\t\\t\\t\\ttheir faith.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Who are the Muslims?",
    "SecNoValue": "2",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tOne billion people from a vast range of races, nationalities and\\n\\t\\t\\t\\tcultures across the globe--from the southern Philippines to\\n\\t\\t\\t\\tNigeria--are united by their common Islamic faith. About 18% live\\n\\t\\t\\t\\tin the Arab world; the world's largest Muslim community is in\\n\\t\\t\\t\\tIndonesia; substantial parts of Asia and most of Africa are\\n\\t\\t\\t\\tMuslim, while significant minorities are to be found in the\\n\\t\\t\\t\\tSoviet Union, China, North and South America, and Europe.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What do Muslims believe?",
    "SecNoValue": "3",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tMuslims believe in One, Unique, Incomparable God; in the Angels\\n\\t\\t\\t\\tcreated by Him; in the prophets through whom His revelations were\\n\\t\\t\\t\\tbrought to mankind; in the Day of Judgement and individual\\n\\t\\t\\t\\taccountability for actions; in God's complete authority over\\n\\t\\t\\t\\thuman destiny and in life after death. Muslims believe in a chain\\n\\t\\t\\t\\tof prophets starting with Adam and including Noah, Abraham,\\n\\t\\t\\t\\tIshmael, Isaac, Jacob, Joseph, Job, Moses, Aaron, David, Solomon,\\n\\t\\t\\t\\tElias, Jonah, John the Baptist, and Jesus, peace be upon them.\\n\\t\\t\\t\\tBut God's final message to man, a reconfirmation of the eternal\\n\\t\\t\\t\\tmessage and a summing-up of all that has gone before was revealed\\n\\t\\t\\t\\tto the Prophet Muhammad (SAW) through Gabriel. \\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "How does someone become a Muslim?",
    "SecNoValue": "4",
    "SubSec": "NULL",
    "Text": "<p>\r\\n\\t\\t\\t\\tSimply by saying 'There is no god apart from God, and Muhammad is\r\\n\\t\\t\\t\\tthe Messenger of God.' By this declaration the believer announces\r\\n\\t\\t\\t\\this or her faith in all God's messengers, and the scriptures they\r\\n\\t\\t\\t\\tbrought.\r\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What does 'Islam' mean?",
    "SecNoValue": "5",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe Arabic word 'Islam' simply means 'submission', and derives\\n\\t\\t\\t\\tfrom a word meaning 'peace'. In a religious context it means\\n\\t\\t\\t\\tcomplete submission to the will of God. 'Mohammedanism' is thus a\\n\\t\\t\\t\\tmisnomer because it suggests that Muslims worship Muhammad (SAW)\\n\\t\\t\\t\\trather than God. 'Allah' is the Arabic name for God, which is\\n\\t\\t\\t\\tused by Arab Muslims and Christians alike.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Why does Islam often seem strange?",
    "SecNoValue": "6",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIslam may seem exotic or even extreme in the modern world.\\n\\t\\t\\t\\tPerhaps this is because religion does not dominate everyday life\\n\\t\\t\\t\\tin the West today, whereas Muslims have religion always uppermost\\n\\t\\t\\t\\tin their minds, and make no division between secular and sacred.\\n\\t\\t\\t\\tThey believe that the Divine Law, the Shari'a, should be taken\\n\\t\\t\\t\\tvery seriously, which is why issues related to religion are still\\n\\t\\t\\t\\tso important.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Do Islam and Christianity have different origins?",
    "SecNoValue": "7",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tNo. Together with Judaism, they go back to the prophet and\\n\\t\\t\\t\\tpatriarch Abraham, and their three prophets are directly\\n\\t\\t\\t\\tdescended from his sons--Muhammad (SAW) from the eldest, Ishmael,\\n\\t\\t\\t\\tand Moses and Jesus, peace be upon them, from Isaac. Abraham\\n\\t\\t\\t\\testablished the settlement which today is the city of Makkah, and\\n\\t\\t\\t\\tbuilt the Ka'ba towards which all Muslims turn when they pray.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What is the Ka'ba?",
    "SecNoValue": "8",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe Ka'ba is the place of worship which God commanded Abraham and\\n\\t\\t\\t\\tIshmael to build over four thousand years ago. The building was\\n\\t\\t\\t\\tconstructed of stone on what many believe was the original site\\n\\t\\t\\t\\tof a sanctuary established by Adam. God commanded Abraham to\\n\\t\\t\\t\\tsummon all mankind to visit this place, and when pilgrims go\\n\\t\\t\\t\\tthere today they say 'At Thy service, O Lord', in response to\\n\\t\\t\\t\\tAbraham's summons.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Who is Muhammad?",
    "SecNoValue": "9",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tMuhammad (SAW) was born in Makkah in the year 570, at a time when\\n\\t\\t\\t\\tChristianity was not yet fully established in Europe. Since his\\n\\t\\t\\t\\tfather died before his birth, and his mother shortly afterwards,\\n\\t\\t\\t\\the was raised by his uncle from the respected tribe of Quraysh.\\n\\t\\t\\t\\tAs he grew up, he became known for his truthfulness, generosity\\n\\t\\t\\t\\tand sincerity, so that he was sought after for his ability to\\n\\t\\t\\t\\tarbitrate in disputes. The historians describe him as calm and\\n\\t\\t\\t\\tmeditative.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMuhammad (SAW) was of a deeply religious nature, and had long\\n\\t\\t\\t\\tdetested the decadence of his society. It became his habit to\\n\\t\\t\\t\\tmeditate from time to time in the Cave of Hira near the summit of\\n\\t\\t\\t\\tJabal al-Nur, the 'Mountain of Light' near Makkah.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "How did he become a prophet and a messenger of God?",
    "SecNoValue": "10",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAt the age of 40, while engaged in a meditative retreat, Muhammad\\n\\t\\t\\t\\treceived his first revelation from God through the Angel Gabriel.\\n\\t\\t\\t\\tThis revelation, which continued for twenty-three years, is known\\n\\t\\t\\t\\tas the Quran.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAs soon as he began to recite the words he heard from Gabriel,\\n\\t\\t\\t\\tand to preach the truth which God had revealed to him, he and his\\n\\t\\t\\t\\tsmall group of followers suffered bitter persecution, which grew\\n\\t\\t\\t\\tso fierce that in the year 622 God gave them the command to\\n\\t\\t\\t\\temigrate. This event, the Hijra, 'migration', in which they left\\n\\t\\t\\t\\tMakkah for the city of Madinah some 260 miles to the north, marks\\n\\t\\t\\t\\tthe beginning of the Muslim calendar.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAfter several years, the Prophet (SAW) and his followers were\\n\\t\\t\\t\\table to return to Makkah, where they forgave their enemies and\\n\\t\\t\\t\\testablished Islam definitively. Before the Prophet (SAW) died at\\n\\t\\t\\t\\tthe age of 63, the greater part of Arabia was Muslim, and within\\n\\t\\t\\t\\ta century of his death Islam had spread to Spain in the West and\\n\\t\\t\\t\\tas far East as China.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "How did the spread of Islam affect the world?",
    "SecNoValue": "11",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAmong the reasons for the rapid and peaceful spread of Islam was\\n\\t\\t\\t\\tthe simplicity of its doctrine. Islam calls for faith in only One\\n\\t\\t\\t\\tGod worthy of worship. It also repeatedly instructs man to use\\n\\t\\t\\t\\this powers of intelligence and observation.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWithin a few years, great civilizations and universities were\\n\\t\\t\\t\\tflourishing, for according to the Prophet (SAW) 'seeking\\n\\t\\t\\t\\tknowledge is an obligation for every Muslim man and woman'. The\\n\\t\\t\\t\\tsynthesis of Eastern and Western ideas and of new thought with\\n\\t\\t\\t\\told, brought about great advances in medicine, mathematics,\\n\\t\\t\\t\\tphysics, astronomy, geography, architecture, art, literature, and\\n\\t\\t\\t\\thistory. Many crucial systems such as algebra, the Arabic\\n\\t\\t\\t\\tnumerals, and also the concept of the zero (vital to the\\n\\t\\t\\t\\tadvancement of mathematics), were transmitted to medieval Europe\\n\\t\\t\\t\\tfrom Islam. Sophisticated instruments which were to make possible\\n\\t\\t\\t\\tthe European voyages of discovery were developed, including the\\n\\t\\t\\t\\tastrolabe, the quadrant and good navigational maps.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Prophet (SAW) said, 'Seek knowledge even into China': the Hui\\n\\t\\t\\t\\tShen mosque was built in the seventh century.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What is the Quran?",
    "SecNoValue": "12",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe Quran is a record of the exact words revealed by God through\\n\\t\\t\\t\\tthe Angel Gabriel to the Prophet Muhammad (SAW). It was memorized\\n\\t\\t\\t\\tby Muhammad (SAW) and then dictated to his Companions, and\\n\\t\\t\\t\\twritten down by scribes, who cross-checked it during his\\n\\t\\t\\t\\tlifetime. Not one word of its 114 chapters, Suras, has been\\n\\t\\t\\t\\tchanged over the centuries, so that the Quran is in every detail\\n\\t\\t\\t\\tthe unique and miraculous text which was revealed to Muhammad\\n\\t\\t\\t\\t(SAW) fourteen centuries ago.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What is the Quran about?",
    "SecNoValue": "13",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe Quran, the last revealed Word of God, is the prime source of\\n\\t\\t\\t\\tevery Muslim's faith and practice. It deals with all the subjects\\n\\t\\t\\t\\twhich concern us as human beings: wisdom, doctrine, worship, and\\n\\t\\t\\t\\tlaw, but its basic theme is the relationship between God and His\\n\\t\\t\\t\\tcreatures. At the same time it provides guidelines for a just\\n\\t\\t\\t\\tsociety, proper human conduct and an equitable economic system.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Are there any other sacred sources?",
    "SecNoValue": "14",
    "SubSec": "Examples of the Prophet's sayings",
    "Text": "<p>\\n\\t\\t\\t\\t\\tThe Prophet (SAW) said:\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\t'God has no mercy on one who has no mercy for others.'\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\t'None of you truly believes until he wishes for his\\n\\t\\t\\t\\t\\tbrother what he wishes for himself.'\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\t'He who eats his fill while his neighbor goes without\\n\\t\\t\\t\\t\\tfood is not a believer.'\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\t'The truthful and trusty businessman is associated with\\n\\t\\t\\t\\t\\tthe prophets the saints, and the martyrs.'\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\t'Powerful is not he who knocks the other down, indeed\\n\\t\\t\\t\\t\\tpowerful is he who controls himself in a fit of anger.'\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\t'God does not judge according to your bodies and\\n\\t\\t\\t\\t\\tappearances but He scans your hearts and looks into your\\n\\t\\t\\t\\t\\tdeeds.'\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\t'A man walking along a path felt very thirsty. Reaching a\\n\\t\\t\\t\\t\\twell he descended into it, drank his fill and came up.\\n\\t\\t\\t\\t\\tThen he saw a dog with its tongue hanging out, trying to\\n\\t\\t\\t\\t\\tlick up mud to quench its thirst. The man saw that the\\n\\t\\t\\t\\t\\tdog was feeling the same thirst as he had felt so he went\\n\\t\\t\\t\\t\\tdown into the well again and filled his shoe with water\\n\\t\\t\\t\\t\\tand gave the dog a drink. God forgave his sins for this\\n\\t\\t\\t\\t\\taction.' The Prophet (SAW) was asked: 'Messenger of God,\\n\\t\\t\\t\\t\\tare we rewarded for kindness towards animals?' He said,\\n\\t\\t\\t\\t\\t'There is a reward for kindness to every living thing.'\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\t(From the hadith collections of Bukhari, Muslim, Tirmidhi\\n\\t\\t\\t\\t\\tand Bayhaqi.)\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Are there any other sacred sources?",
    "SecNoValue": "14",
    "SubSec": "NULL",
    "Text": ""
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What are the 'Five Pillars' of Islam?",
    "SecNoValue": "15",
    "SubSec": "First Pillar: Faith",
    "Text": "<p>\\n\\t\\t\\t\\t\\tThere is no god worthy of worship except God and Muhammad\\n\\t\\t\\t\\t\\tis His messenger. This declaration of faith is called the\\n\\t\\t\\t\\t\\tShahada, a simple formula which all the faithful\\n\\t\\t\\t\\t\\tpronounce. In Arabic, the first part is la ilaha\\n\\t\\t\\t\\t\\tilla'Llah - 'there is no god except God'; ilaha (god) can\\n\\t\\t\\t\\t\\trefer to anything which we may be tempted to put in place\\n\\t\\t\\t\\t\\tof God--wealth, power, and the like. Then comes\\n\\t\\t\\t\\t\\tilla'Llah: 'except God', the source of all Creation. The\\n\\t\\t\\t\\t\\tsecond part of the Shahada is Muhammadun rasulu'Llah:\\n\\t\\t\\t\\t\\t'Muhammad is the messenger of God.' A message of guidance\\n\\t\\t\\t\\t\\thas come through a man like ourselves.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What are the 'Five Pillars' of Islam?",
    "SecNoValue": "15",
    "SubSec": "Second Pillar: Prayer",
    "Text": "<p>\\n\\t\\t\\t\\t\\tSalat is the name for the obligatory prayers which are\\n\\t\\t\\t\\t\\tperformed five times a day, and are a direct link between\\n\\t\\t\\t\\t\\tthe worshipper and God. There is no hierarchical\\n\\t\\t\\t\\t\\tauthority in Islam, and no priests, so the prayers are\\n\\t\\t\\t\\t\\tled by a learned person who knows the Quran, chosen by\\n\\t\\t\\t\\t\\tthe congregation. These five prayers contain verses from\\n\\t\\t\\t\\t\\tthe Quran, and are said in Arabic, the language of the\\n\\t\\t\\t\\t\\tRevelation, but personal supplication can be offered in\\n\\t\\t\\t\\t\\tone's own language.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tPrayers are said at dawn, noon, mid-afternoon, sunset and\\n\\t\\t\\t\\t\\tnightfall, and thus determine the rhythm of the entire\\n\\t\\t\\t\\t\\tday. Although it is preferable to worship together in a\\n\\t\\t\\t\\t\\tmosque, a Muslim may pray almost anywhere, such as in\\n\\t\\t\\t\\t\\tfields, offices, factories and universities. Visitors to\\n\\t\\t\\t\\t\\tthe Muslim world are struck by the centrality of prayers\\n\\t\\t\\t\\t\\tin daily life.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tA translation of the Call to Prayer is:\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\t'God is most great. God is most great. God is most great.\\n\\t\\t\\t\\t\\tGod is most great. I testify that there is no god except\\n\\t\\t\\t\\t\\tGod. I testify that there is no god except God. I testify\\n\\t\\t\\t\\t\\tthat Muhammad is the messenger of God. I testify that\\n\\t\\t\\t\\t\\tMuhammad is the messenger of God. Come to prayer! Come to\\n\\t\\t\\t\\t\\tprayer! Come to success (in this life and the Hereafter)!\\n\\t\\t\\t\\t\\tCome to success! God is most great. God is most great.\\n\\t\\t\\t\\t\\tThere is no god except God.'\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tOnce Muslims prayed towards Jerusalem, but during the\\n\\t\\t\\t\\t\\tProphet's lifetime it was changed to Makkah. From the\\n\\t\\t\\t\\t\\tminbar, the pulpit, the Imam who leads the prayer gives\\n\\t\\t\\t\\t\\tthe sermon at the Friday noon community prayers.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What are the 'Five Pillars' of Islam?",
    "SecNoValue": "15",
    "SubSec": "Third Pillar: Zakat ",
    "Text": "<p>\\n\\t\\t\\t\\t\\tOne of the most important principles of Islam is that all\\n\\t\\t\\t\\t\\tthings belong to God, and that wealth is therefore held\\n\\t\\t\\t\\t\\tby human beings in trust. The word zakat means both\\n\\t\\t\\t\\t\\t'purification' and 'growth'. Our possessions are purified\\n\\t\\t\\t\\t\\tby setting aside a proportion for those in need, and,\\n\\t\\t\\t\\t\\tlike the pruning of plants, this cutting back balances\\n\\t\\t\\t\\t\\tand encourages new growth.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tEach Muslim calculates his or her own zakat individually.\\n\\t\\t\\t\\t\\tFor most purposes this involves the payment each year of\\n\\t\\t\\t\\t\\ttwo and a half percent of one's capital.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tA pious person may also give as much as he or she pleases\\n\\t\\t\\t\\t\\tas sadaqa, and does so preferably in secret. Although\\n\\t\\t\\t\\t\\tthis word can be translated as 'voluntary charity' it has\\n\\t\\t\\t\\t\\ta wider meaning. The Prophet (SAW) said: 'Even meeting\\n\\t\\t\\t\\t\\tyour brother with a cheerful face is charity.'\\n\\t\\t\\t\\t</p><p>\\nThe Prophet (SAW) said: 'Charity is a necessity for every\\n\\t\\t\\t\\t\\tMuslim.' He was asked: 'What if a person has nothing?'\\nThe Prophet (SAW) replied: 'He should work with his own\\n\\t\\t\\t\\t\\thands for his benefit and then give something out of such\\n\\t\\t\\t\\t\\tearnings in charity.' The Companions asked: 'What if he\\n\\t\\t\\t\\t\\tis not able to work?' The Prophet (SAW) said: 'He should\\n\\t\\t\\t\\t\\thelp poor and needy persons.' The Companions further\\n\\t\\t\\t\\t\\tasked 'What if he cannot do even that?' The Prophet (SAW)\\n\\t\\t\\t\\t\\tsaid 'He should urge others to do good.' The Companions\\n\\t\\t\\t\\t\\tsaid 'What if he lacks that also?' The Prophet (SAW) said\\n\\t\\t\\t\\t\\t'He should check himself from doing evil. That is also\\n\\t\\t\\t\\t\\tcharity.'\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What are the 'Five Pillars' of Islam?",
    "SecNoValue": "15",
    "SubSec": "Fourth Pillar: The Fast",
    "Text": "<p>\\n\\t\\t\\t\\t\\tEvery year in the month of Ramadan, all Muslims fast from\\n\\t\\t\\t\\t\\tfirst light until sundown, abstaining from food, drink,\\n\\t\\t\\t\\t\\tand sexual relations. Those who are sick, elderly, or on\\na journey, and women who are pregnant or nursing are\\n\\t\\t\\t\\t\\tpermitted to break the fast and make up an equal number\\n\\t\\t\\t\\t\\tof days later in the year. If they are physically unable\\n\\t\\t\\t\\t\\tto do this, they must feed a needy person for every day\\n\\t\\t\\t\\t\\tmissed. Children begin to fast (and to observe the\\n\\t\\t\\t\\t\\tprayer) from puberty, although many start earlier.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tAlthough the fast is most beneficial to the health, it is\\nregarded principally as a method of self-purification. By\\n\\t\\t\\t\\t\\tcutting oneself off from worldly comforts, even for a\\n\\t\\t\\t\\t\\tshort time, a fasting person gains true sympathy with\\n\\t\\t\\t\\t\\tthose who go hungry as well as growth in one's spiritual\\n\\t\\t\\t\\t\\tlife.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What are the 'Five Pillars' of Islam?",
    "SecNoValue": "15",
    "SubSec": "Fifth Pillar: The Pilgrimage (Hajj)",
    "Text": "<p>\\n\\t\\t\\t\\t\\tThe annual pilgrimage to Makkah, the Hajj, is an\\n\\t\\t\\t\\t\\tobligation only for those who are physically and\\n\\t\\t\\t\\t\\tfinancially able to perform it. Nevertheless, about two\\n\\t\\t\\t\\t\\tmillion people go to Makkah each year from every comer of\\n\\t\\t\\t\\t\\tthe globe providing a unique opportunity for those of\\n\\t\\t\\t\\t\\tdifferent nations to meet one another. Although Makkah is\\n\\t\\t\\t\\t\\talways filled with visitors, the annual Hajj begins in\\n\\t\\t\\t\\t\\tthe twelfth month of the Islamic year (which is lunar,\\n\\t\\t\\t\\t\\tnot solar, so that Hajj and Ramadan fall sometimes in\\n\\t\\t\\t\\t\\tsummer, sometimes in winter). Pilgrims wear special\\n\\t\\t\\t\\t\\tclothes: simple garments which strip away distinctions of\\n\\t\\t\\t\\t\\tclass and culture, so that all stand equal before God.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tThe rites of the Hajj, which are of Abrahamic origin,\\n\\t\\t\\t\\t\\tinclude circling the Ka'ba seven times, and going seven\\n\\t\\t\\t\\t\\ttimes between the mountains of Safa and Marwa as did\\n\\t\\t\\t\\t\\tHagar during her search for water. Then the pilgrims\\n\\t\\t\\t\\t\\tstand together on the wide plain of Arafa and join in\\n\\t\\t\\t\\t\\tprayers for God's forgiveness, in what is often thought\\n\\t\\t\\t\\t\\tof as a preview of the Last Judgement.\\n\\t\\t\\t\\t</p><p>\\nIn previous centuries the Hajj was an arduous undertaking.\\n\\t\\t\\t\\t\\tToday, however, Saudi Arabia provides millions of people\\n\\t\\t\\t\\t\\twith water, modem transport, and the most up-to-date\\n\\t\\t\\t\\t\\thealth facilities.\\n\\t\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\\tThe close of the Hajj is marked by a festival, the Eid\\n\\t\\t\\t\\t\\tal-Adha, which is celebrated with prayers and the\\n\\t\\t\\t\\t\\texchange of gifts in Muslim communities everywhere. This,\\n\\t\\t\\t\\t\\tand the Eid al-Fitr, a feast-day commemorating the end of\\n\\t\\t\\t\\t\\tRamadan, are the main festivals of the Muslim calendar.\\n\\t\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What are the 'Five Pillars' of Islam?",
    "SecNoValue": "15",
    "SubSec": "NULL",
    "Text": ""
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Does Islam tolerate other beliefs?",
    "SecNoValue": "16",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe Quran says: God forbids you not, with regards to those who\\n\\t\\t\\t\\tfight you not for [your] faith nor drive you out of your homes,\\n\\t\\t\\t\\tfrom dealing kindly and justly with them; for God loveth those\\n\\t\\t\\t\\twho are just. (Quran, 60.8)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIt is one function of Islamic law to protect the privileged\\n\\t\\t\\t\\tstatus of minorities, and this is why non-Muslim places of\\n\\t\\t\\t\\tworship have flourished all over the Islamic world. History\\n\\t\\t\\t\\tprovides many examples of Muslim tolerance towards other faiths:\\n\\t\\t\\t\\twhen the caliph Omar entered Jerusalem in the year 634, Islam\\n\\t\\t\\t\\tgranted freedom of worship to all religious communities in the\\n\\t\\t\\t\\tcity.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIslamic law also permits non-Muslim minorities to set up their own\\n\\t\\t\\t\\tcourts, which implement family laws drawn up by the minorities\\n\\t\\t\\t\\tthemselves.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWhen the caliph Omar took Jerusalem from the Byzantines, he\\n\\t\\t\\t\\tinsisted on entering the city with only a small number of his\\n\\t\\t\\t\\tcompanions. Proclaiming to the inhabitants that their lives and\\n\\t\\t\\t\\tproperty were safe, and that their places of worship would never\\n\\t\\t\\t\\tbe taken from them, he asked the Christian patriarch Sophronius\\n\\t\\t\\t\\tto accompany him on a visit to all the holy places.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Patriarch invited him to pray in the Church of the Holy\\n\\t\\t\\t\\tSepulchre, but he preferred to pray outside its gates, saying\\n\\t\\t\\t\\tthat if he accepted, later generations of Muslims might use his\\n\\t\\t\\t\\taction as an excuse to turn it into a mosque. Above is the mosque\\n\\t\\t\\t\\tbuilt on the spot where Omar did pray.\\n\\t\\t\\t</p><p>\\nAccording to Islam, man is not born in 'original sin'. He is God's\\n\\t\\t\\t\\tvicegerent on earth. Every child is born with the fitra, an\\n\\t\\t\\t\\tinnate disposition towards virtue, knowledge, and beauty. Islam\\n\\t\\t\\t\\tconsiders itself to be the 'primordial religion', din al-hanif,\\n\\t\\t\\t\\tit seeks to return man to his original, true nature in which he\\n\\t\\t\\t\\tis in harmony with creation, inspired to do good, and confirming\\n\\t\\t\\t\\tthe Oneness of God.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What do Muslims think about Jesus?",
    "SecNoValue": "17",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tMuslims respect and revere Jesus (SAW) and await his Second\\n\\t\\t\\t\\tComing. They consider him one of the greatest of God's messengers\\n\\t\\t\\t\\tto mankind. A Muslim never refers to him simply as 'Jesus', but\\n\\t\\t\\t\\talways adds the phrase 'upon him be peace'. The Quran confirms\\n\\t\\t\\t\\this virgin birth (a chapter of the Quran is entitled 'Mary'), and\\n\\t\\t\\t\\tMary is considered the purest woman in all creation. The Quran\\n\\t\\t\\t\\tdescribes the Annunciation as follows:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'Behold!' the Angel said, 'God has chosen you, and purified you,\\n\\t\\t\\t\\tand chosen you above the women of all nations. O Mary, God gives\\n\\t\\t\\t\\tyou good news of a word from Him, whose name shall be the\\n\\t\\t\\t\\tMessiah, Jesus son of Mary, honored in this world and the\\n\\t\\t\\t\\tHereafter, and one of those brought near to God. He shall speak\\n\\t\\t\\t\\tto the people from his cradle and in maturity, and shall be of\\n\\t\\t\\t\\tthe righteous.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tShe said: 'O my Lord! How shall I have a son when no man has\\n\\t\\t\\t\\ttouched me?' He said: 'Even so; God creates what He will. When He\\n\\t\\t\\t\\tdecrees a thing He says to it, \"Be!\" and it is.' (Quran, 3.42-7)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tJesus (SAW) was born miraculously through the same power which\\n\\t\\t\\t\\thad brought Adam (SAW) into being without a father:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tTruly, the likeness of Jesus with God is as the likeness of Adam.\\n\\t\\t\\t\\tHe created him of dust, and then said to him, 'Be!' and he was.\\n\\t\\t\\t\\t(3.59)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tDuring his prophetic mission Jesus (SAW) performed many miracles.\\n\\t\\t\\t\\tThe Quran tells us that he said:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'I have come to you with a sign from your Lord: I make for you\\n\\t\\t\\t\\tout of clay, as it were, the figure of a bird, and breathe into\\n\\t\\t\\t\\tit and it becomes a bird by God's leave. And I heal the blind,\\n\\t\\t\\t\\tand the lepers, and I raise the dead by God's leave.' (3.49)\\n\\t\\t\\t</p><p>\\nNeither Muhammad (SAW) nor Jesus (SAW) came to change the basic\\n\\t\\t\\t\\tdoctrine of the belief in One God, brought by earlier prophets,\\n\\t\\t\\t\\tbut to confirm and renew it. In the Quran Jesus (SAW) is reported\\n\\t\\t\\t\\tas saying that he came:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'To attest the law which was before me. And to make lawful to you\\nthat of what was forbidden you; I have come to you with a sign\\n\\t\\t\\t\\tfrom your Lord, so fear God and obey Me.' (3:5O)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Prophet Muhammad (SAW) said:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'Whoever believes there is no god but God, alone without partner,\\n\\t\\t\\t\\tthat Muhammad (SAW) is His messenger, that Jesus is the servant\\n\\t\\t\\t\\tand messenger of God, His word breathed into Mary and a spirit\\n\\t\\t\\t\\temanating from Him, and that Paradise and Hell are true, shall be\\n\\t\\t\\t\\treceived by God into Heaven.' (Hadith from Bukhari)\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Why is the family so important to Muslims?",
    "SecNoValue": "18",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe family is the foundation of Islamic society. The peace and\\n\\t\\t\\t\\tsecurity offered by a stable family unit is greatly valued, and\\n\\t\\t\\t\\tseen as essential for the spiritual growth of its members. A\\n\\t\\t\\t\\tharmonious social order is created by the existence of extended\\n\\t\\t\\t\\tfamilies; children are treasured, and rarely leave home until the\\n\\t\\t\\t\\ttime they marry.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What about Muslim women ?",
    "SecNoValue": "19",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIslam sees a woman, whether single or married, as an individual\\n\\t\\t\\t\\tin her own right, with the right to own and dispose of her\\n\\t\\t\\t\\tproperty and earnings. A marriage dowry is given by the groom to\\n\\t\\t\\t\\tthe bride for her own personal use, and she keeps her own family\\n\\t\\t\\t\\tname rather than taking her husband's.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tBoth men and women are expected to dress in a way which is modest\\n\\t\\t\\t\\tand dignified; the traditions of female dress found in some\\n\\t\\t\\t\\tMuslim countries are often the expression of local customs.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Messenger of God said:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'The most perfect in faith amongst believers is he who is best in\\n\\t\\t\\t\\tmanner and kindest to his wife.'\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Can a Muslim have more than one wife?",
    "SecNoValue": "20",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe religion of Islam was revealed for all societies and all\\n\\t\\t\\t\\ttimes and so accommodates widely differing social requirements.\\n\\t\\t\\t\\tCircumstances may warrant the taking of another wife but the\\n\\t\\t\\t\\tright is granted, according to the Quran, only on condition that\\n\\t\\t\\t\\tthe husband is scrupulously fair.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "Is an Islamic marriage like a Christian marriage?",
    "SecNoValue": "21",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tA Muslim marriage is not a 'sacrament', but a simple, legal\\n\\t\\t\\t\\tagreement in which either partner is free to include conditions.\\n\\t\\t\\t\\tMarriage customs thus vary widely from country to country. As a\\n\\t\\t\\t\\tresult, divorce is not common, although it is not forbidden as a\\n\\t\\t\\t\\tlast resort. According to Islam, no Muslim girl can be forced to\\n\\t\\t\\t\\tmarry against her will: her parents will simply suggest young men\\n\\t\\t\\t\\tthey think may be suitable.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "How do Muslims treat the elderly?",
    "SecNoValue": "22",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIn the Islamic world there are no old people's homes. The strain\\n\\t\\t\\t\\tof caring for one's parents in this most difficult time of their\\n\\t\\t\\t\\tlives is considered an honor and blessing, and an opportunity for\\n\\t\\t\\t\\tgreat spiritual growth. God asks that we not only pray for our\\n\\t\\t\\t\\tparents, but act with limitless compassion, remembering that when\\n\\t\\t\\t\\twe were helpless children they preferred us to themselves.\\n\\t\\t\\t\\tMothers are particularly honored: the Prophet (SAW) taught that\\n\\t\\t\\t\\t'Paradise lies at the feet of mothers'. When they reach old age,\\n\\t\\t\\t\\tMuslim parents are treated mercifully, with the same kindness and\\n\\t\\t\\t\\tselflessness.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIn Islam, serving one's parents is a duty second only to prayer,\\n\\t\\t\\t\\tand it is their right to expect it. It is considered despicable\\n\\t\\t\\t\\tto express any irritation when, through no fault of their own,\\n\\t\\t\\t\\tthe old become difficult.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Quran says: Your Lord has commanded that you worship none but\\n\\t\\t\\t\\tHim, and be kind to parents. If either or both of them reach old\\n\\t\\t\\t\\tage with you, do not say 'uff' to them or chide them, but speak\\n\\t\\t\\t\\tto them in terms of honor and kindness. Treat them with humility,\\n\\t\\t\\t\\tand say, 'My Lord! Have mercy on them, for they did care for me\\n\\t\\t\\t\\twhen I was little'. (17.23-4)\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "How do Muslims view death?",
    "SecNoValue": "23",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tLike Jews and Christians, Muslims believe that the present life\\n\\t\\t\\t\\tis only a trial preparation for the next realm of existence.\\n\\t\\t\\t\\tBasic articles of faith include: the Day of Judgement,\\n\\t\\t\\t\\tresurrection, Heaven and Hell. When a Muslim dies, he or she is\\n\\t\\t\\t\\twashed, usually by a family member, wrapped in a clean white\\n\\t\\t\\t\\tcloth, and buried with a simple prayer preferably the same day.\\n\\t\\t\\t\\tMuslims consider this one of the final services they can do for\\n\\t\\t\\t\\ttheir relatives, and an opportunity to remember their own brief\\n\\t\\t\\t\\texistence here on earth. The Prophet (SAW) taught that three\\n\\t\\t\\t\\tthings can continue to help a person even after death; charity\\n\\t\\t\\t\\twhich he had given, knowledge which he had taught and prayers on\\n\\t\\t\\t\\ttheir behalf by a righteous child.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What does Islam say about war?",
    "SecNoValue": "24",
    "SubSec": "NULL",
    "Text": "<p>\\nLike Christianity, Islam permits fighting in self-defense, in\\n\\t\\t\\t\\tdefense of religion, or on the part of those who have been\\n\\t\\t\\t\\texpelled forcibly from their homes. It lays down strict rules of\\n\\t\\t\\t\\tcombat which include prohibitions against harming civilians and\\n\\t\\t\\t\\tagainst destroying crops, trees and livestock. As Muslims see it,\\n\\t\\t\\t\\tinjustice would be triumphant in the world if good men were not\\n\\t\\t\\t\\tprepared to risk their lives in a righteous cause. The Quran\\n\\t\\t\\t\\tsays:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'Fight in the cause of God against those who fight you, but do\\n\\t\\t\\t\\tnot transgress limits. God does not love transgressors.' (2.190)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'If they seek peace, then seek you peace. And trust in God for He\\n\\t\\t\\t\\tis the One that heareth and knoweth all things.' (8.61)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tWar, therefore, is the last resort, and is subject to the\\n\\t\\t\\t\\trigorous conditions laid down by the sacred law. The term jihad\\n\\t\\t\\t\\tliterally means 'struggle', and Muslims believe that there are\\n\\t\\t\\t\\ttwo kinds of jihad. The other jihad is the inner struggle which\\n\\t\\t\\t\\teveryone wages against egotistic desires, for the sake of\\n\\t\\t\\t\\tattaining inner peace.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What about food?",
    "SecNoValue": "25",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tAlthough much simpler than the dietary law followed by Jews and\\n\\t\\t\\t\\tthe early Christians, the code which Muslims observe forbids the\\nconsumption of pig meat or any kind of intoxicating drink. The\\n\\t\\t\\t\\tProphet taught that 'your body has rights over you', and the\\n\\t\\t\\t\\tconsumption of wholesome food and the leading of a healthy\\n\\t\\t\\t\\tlifestyle are seen as religious obligations.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Prophet (SAW) said: 'Ask God for certainty [of faith] and\\n\\t\\t\\t\\twell-being; for after certainty, no one is given any gift better\\n\\t\\t\\t\\tthan health!'\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What is Islam's presence in the United States?",
    "SecNoValue": "26",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tIt is almost impossible to generalize about American Muslims:\\n\\t\\t\\t\\tconverts, immigrants, factory workers, doctors; all are making\\n\\t\\t\\t\\ttheir own contribution to America's future. This complex\\n\\t\\t\\t\\tcommunity is unified by a common faith, underpinned by a\\n\\t\\t\\t\\tcountrywide network of a thousand mosques.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMuslims were early arrivals in North America. By the eighteenth\\n\\t\\t\\t\\tcentury there were many thousands of them, working as slaves on\\n\\t\\t\\t\\tplantations. These early communities, cut off from their heritage\\n\\t\\t\\t\\tand families, inevitably lost their Islamic identity as time went\\n\\t\\t\\t\\tby. Today many Afro-American Muslims play an important role in\\n\\t\\t\\t\\tthe Islamic community.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe nineteenth century, however, saw the beginnings of an influx\\n\\t\\t\\t\\tof Arab Muslims, most of whom settled in the major industrial\\n\\t\\t\\t\\tcenters where they worshipped in hired rooms. The early twentieth\\n\\t\\t\\t\\tcentury witnessed the arrival of several hundred thousand Muslims\\nfrom Eastern Europe: the first Albanian mosque was opened in Maine\\n\\t\\t\\t\\tin 1915; others soon followed, and a group of Polish Muslims\\n\\t\\t\\t\\topened a mosque in Brooklyn in 1928.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIn 1947 the Washington Islamic Center was founded during the term\\n\\t\\t\\t\\tof President Truman, and several nationwide organizations were\\n\\t\\t\\t\\tset up in the fifties. The same period saw the establishment of\\n\\t\\t\\t\\tother communities whose lives were in many ways modeled after\\n\\t\\t\\t\\tIslam. More recently, numerous members of these groups have\\n\\t\\t\\t\\tentered the fold of Muslim orthodoxy. Today there are about five\\n\\t\\t\\t\\tmillion Muslims in America.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "How does Islam guarantee human rights?",
    "SecNoValue": "27",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tFreedom of conscience is laid down by the Quran itself: 'There is\\n\\t\\t\\t\\tno compulsion in religion'. (2.256)\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe life and property of all citizens in an Islamic state are\\n\\t\\t\\t\\tconsidered sacred whether a person is Muslim or not.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tRacism is incomprehensible to Muslims, for the Quran speaks of\\n\\t\\t\\t\\thuman equality in the following terms:\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t'O mankind! We created you from a single soul, male and female,\\n\\t\\t\\t\\tand made you into nations and tribes, so that you may come to\\n\\t\\t\\t\\tknow one another. Truly, the most honored of you in God 's sight\\n\\t\\t\\t\\tis the greatest of you in piety. God is All-Knowing, All-Aware'.\\n\\t\\t\\t\\t(49.13)\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Frequently Asked Questions about Islam",
    "BookCode": "WOI",
    "SectionHead": "What is the makeup of The Muslim World?",
    "SecNoValue": "28",
    "SubSec": "NULL",
    "Text": "<p>\\n\\t\\t\\t\\tThe Muslim population of the world is around one billion. Most\\n\\t\\t\\t\\tMuslims live east of Karachi. 30% of Muslims live in the Indian\\n\\t\\t\\t\\tsubcontinent, 20 % in Sub-Saharan Africa, 17% in Southeast Asia,\\n\\t\\t\\t\\t18% in the Arab world, 10% in the Soviet Union and China. Turkey,\\n\\t\\t\\t\\tIran and Afghanistan comprise 10% of the non-Arab Middle East.\\n\\t\\t\\t\\tAlthough there are Muslim minorities in almost every area\\n\\t\\t\\t\\tincluding Latin America and Australia, they are most numerous in\\nthe Soviet Union, India, and central Africa. There are 5 million\\n\\t\\t\\t\\tMuslims in the United States.\\n\\t\\t\\t</p>"
  },
  {
    "Section": "Pilgrimage",
    "BookCode": "PGM",
    "SectionHead": "Pilgrimage",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": "<p>The Hajj (pilgrimage to Mecca) is the fifth of the fundamental Muslim practices and institutions known as the five pillars of Islam.  Pilgrimage is not undertaken in Islam to the shrines of saints, to monasteries for help from holy men, or to sights where miracles are supposed to have occurred, even though we may see many Muslims do this.  Pilgrimage is made to the Kaaba, found in the sacred city of Mecca in Saudia, the 'House of God,' whose sanctity rests in that the Prophet Abraham built it for the worship of God.  God rewarded him by attributing the House to himself, in essence honoring it, and by making it the devotional epicenter which all Muslims face when offering the prayers (salah).  The rites of pilgrimage are performed today exactly as did by Abraham, and after him by Prophet Muhammad, may God praise them.\r\\nPilgrimage is viewed as a particularly meritorious activity.  Pilgrimage serves as a penance - the ultimate forgiveness for sins, devotion, and intense spirituality.</p><p>The pilgrimage to Mecca, the most sacred city in Islam, is required of all physically and financially able Muslims once in their life.  The pilgrimage rite begins a few months after Ramadan, on the 8th day of the last month of the Islamic year of Dhul-Hijjah, and ends on the 13th day.  Mecca is the center towards which the Muslims converge once a year, meet and refresh in themselves the faith that all Muslims are equal and deserve the love and sympathy of others, irrespective of their race or ethnic origin.  The racial harmony fostered by Hajj is perhaps best captured by Malcolm X on his historic pilgrimage:\r\\n'Every one of the thousands at the airport, about to leave for Jeddah, was dressed this way.  You could be a king or a peasant and no one would know.  Some powerful personages, who were discreetly pointed out to me, had on the same thing I had on.  Once thus dressed, we all had begun intermittently calling out \"Labbayka! (Allahumma) Labbayka!\" (At your service, O Lord!) Packed in the plane were white, black, brown, red, and yellow people, blue eyes and blond hair, and my kinky red hair - all together, brothers!  All honoring the same God, all in turn giving equal honor to each other . . .\r\\nThat is when I first began to reappraise the 'white man'. It was when I first began to perceive that 'white man', as commonly used, means complexion only secondarily; primarily it described attitudes and actions.</p><p>In America, 'white man' meant specific attitudes and actions toward the black man, and toward all other non-white men.  But in the Muslim world, I had seen that men with white complexions were more genuinely brotherly than anyone else had ever been.  That morning was the start of a radical alteration in my whole outlook about 'white' men.\r\\nThere were tens of thousands of pilgrims, from all over the world.  They were of all colors, from blue-eyed blonds to black-skinned Africans.  But we were all participating in the same ritual displaying a spirit of unity and brotherhood that my experiences in America had led me to believe never could exist between the white and the non-white...  America needs to understand Islam, because this is the one religion that erases from its society the race problem.  Throughout my travels in the Muslim world, I have met, talked to, and even eaten with people who in America would have been considered white - but the 'white' attitude was removed from their minds by the religion of Islam.  I have never before seen sincere and true brotherhood practiced by all colors together, irrespective of their color.\"</p><p>Thus the pilgrimage unites the Muslims of the world into one international fraternity.  More than two million persons perform the Hajj each year, and the rite serves as a unifying force in Islam by bringing followers of diverse backgrounds together in worship.  In some Muslim societies, once a believer has made the pilgrimage, he is often labeled with the title 'hajji' ; this, however, is a cultural, rather than religious custom.  Finally, the Hajj is a manifestation of the belief in the unity of God - all the pilgrims worship and obey the commands of the One God.</p><p>At certain stations on the caravan routes to Mecca, or when the pilgrim passes the point nearest to those stations, the pilgrim enters the state of purity known as ihram. In this state, the certain 'normal' actions of the day and night become impermissible for the pilgrims, such as covering the head, clipping the fingernails, and wearing normal clothing in regards to men. Males remove their clothing and don the garments specific to this state of ihram, two white seamless sheets that are wrapped around the body.  All this increases the reverence and sanctity of the pilgrimage, the city of Mecca, and month of Dhul-Hijjah. There are 5 stations, one on the coastal plains northwest of Mecca towards Egypt and one south towards Yemen, while three lie north or eastwards towards Medina, Iraq and al-Najd.  The simple garb signifies the equality of all humanity in God's sight, and the removal of all worldly affections.  After entering the state of ihram, the pilgrim proceeds to Mecca and awaits the start of the Hajj.  On the 7th of Dhu al-Hijjah the pilgrim is reminded of his duties, and at the commence of the ritual, which takes place between the 8th and the 12th days of the month, the pilgrim visits the holy places outside Mecca - Arafah, Muzdalifah, and Minaa - and sacrifices an animal in commemoration of Abraham's sacrifice.  The pilgrim then shortens or shaves their head, and, after throwing seven stones at specific pillars at Minaa on three or four successive days, and heads for the central mosque where he walks seven times around the sacred sanctuary, or Kaaba, in the Great Mosque, and ambulates, walking and running, seven times between the two small hills of Mt. Safaa and Mt. Marwah.  Discussing the historical or spiritual significance of each rite is beyond the scope of this introductory article.</p><p>Apart from Hajj, the \"minor pilgrimage\" or umrah is undertaken by Muslims during the rest of the year.  Performing the umrah does not fulfill the obligation of Hajj.  It is similar to the major and obligatory Islamic pilgrimage (hajj), and pilgrims have the choice of performing the umrah separately or in combination with the Hajj.  As in the Hajj, the pilgrim begins the umrah by assuming the state of ihram.  They enter Mecca and circle the sacred shrine of the Kaaba seven times.  He may then touch the Black Stone, if he can, pray behind the Maqam Ibrahim, drink the holy water of the Zamzam spring.  The ambulation between the hills of Safa and Marwah seven times and the shortening or shaving of the head complete the umrah.</p>"
  },
  {
    "Section": "Summary",
    "BookCode": "WOI",
    "SectionHead": "Summary",
    "SecNoValue": "1",
    "SubSec": "NULL",
    "Text": "The Islamic world remains today a vast land stretching from the\r\\n\\t\\t\\tAtlantic to the Pacific, with an important presence in Europe and\r\\n\\t\\t\\tAmerica, animated by the teachings of Islam and seeking to assert\r\\n\\t\\t\\tits own identity. Despite the presence of nationalism and various\r\\n\\t\\t\\tsecular ideologies in their midst, Muslims wish to live in the\r\\n\\t\\t\\tmodern world but without simply imitating blindly the ways\r\\n\\t\\t\\tfollowed by the West. The Islamic world wishes to live at peace\r\\n\\t\\t\\twith the West as well as the East but at the same time not to be\r\\n\\t\\t\\tdominated by them. It wishes to devote its resources and energies\r\\n\\t\\t\\tto building a better life for its people on the basis of the\r\\n\\t\\t\\tteachings of Islam and not to squander its resources in either\r\\n\\t\\t\\tinternal or external conflicts. It seeks finally to create better\r\\n\\t\\t\\tunderstanding with the West and to be better understood by the\r\\n\\t\\t\\tWest. The destinies of the Islamic world and the West cannot be\r\\n\\t\\t\\ttotally separated and therefore it is only in understanding each\r\\n\\t\\t\\tother better that they can serve their own people more\r\\n\\t\\t\\tsuccessfully and also contribute to a better life for the whole\r\\n\\t\\t\\tof humanity."
  }
]
