[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/063001",
        "Body":  "When the Hypocrites come to thee they say \"We bear witness that\n\t\t\tthou art indeed the Apostle of Allah.\" Yea Allah knoweth that\n\t\t\tthou art indeed His Apostle and Allah beareth witness that the\n\t\t\tHypocrites are indeed liars. \u003cspan class=\u0027fn\u0027\u003e5466\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/063010",
        "Body":  "And spend something (in charity) out of the substance which We\n\t\t\thave bestowed on you before death should come to any of you and\n\t\t\the should say \"O my Lord! why didst thou not give me respite for\n\t\t\ta little while? I should then have given (largely) in charity and\n\t\t\tI should have been one of the doers of good.\" \u003cspan class=\u0027fn\u0027\u003e5477\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/063011",
        "Body":  "But to no soul will Allah grant respite when the time appointed\n\t\t\t(for it) has come: and Allah is well-acquainted with (all) that\n\t\t\tye do. \u003cspan class=\u0027fn\u0027\u003e5478\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/063002",
        "Body":  "They have made their oaths a screen (for their misdeeds): thus\n\t\t\tthey obstruct (men) from the Path of Allah: truly evil are their\n\t\t\tdeeds. \u003cspan class=\u0027fn\u0027\u003e5467\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/063003",
        "Body":  "That is because they believed then they rejected Faith: so a seal\n\t\t\twas set on their hearts: therefore they understand not.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5468\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/063004",
        "Body":  "When thou lookest at them their exteriors please thee; and when\n\t\t\tthey speak thou listenest to their words.  They are as (worthless\n\t\t\tas hollow) pieces of timber propped up (unable to stand on their\n\t\t\town). They think that every cry is against them.  They are the\n\t\t\tenemies; so beware of them.  The curse of Allah be on them! How\n\t\t\tare they deluded (away from the Truth)! \u003cspan class=\u0027fn\u0027\u003e5468\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5470\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5471\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/063005",
        "Body":  "And when it is said to them \"Come the Apostle of Allah will pray\n\t\t\tfor your forgiveness\" they turn aside their heads and thou\n\t\t\twouldst see them turning away their faces in arrogance.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5472\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/063006",
        "Body":  "It is equal to them whether thou pray for their forgiveness or\n\t\t\tnot. Allah will not forgive them.  Truly Allah guides not\n\t\t\trebellious transgressors. \u003cspan class=\u0027fn\u0027\u003e5473\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/063007",
        "Body":  "They are the ones who say \"Spend nothing on those who are with\n\t\t\tAllah\u0027s Apostle to the end that they may disperse (and quit\n\t\t\tMadinah).  But to Allah belong the treasures of the heavens and\n\t\t\tthe earth; but the Hypocrites understand not. \u003cspan class=\u0027fn\u0027\u003e5474\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/063008",
        "Body":  "They say \"If we return to Madinah surely the more honorable\n\t\t\t(element) will expel there from the meaner.\" But honor belongs to\n\t\t\tAllah and His Apostle and to the Believers; but the Hypocrites\n\t\t\tknow not. \u003cspan class=\u0027fn\u0027\u003e5475\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "63",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/063009",
        "Body":  "O ye who believe! let not your riches or your children divert you\n\t\t\tfrom the remembrance of Allah.\tIf any act thus the loss is their\n\t\t\town. \u003cspan class=\u0027fn\u0027\u003e5476\u003c/span\u003e"
    }
]
