[
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "1",
    "sectionHeading": "Non-Returnable Deposits",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from a reliable source\\n\\t\\t\\t\\tfrom Amr ibn Shuayb from his father from his father's\\n\\t\\t\\t\\tfather that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade transactions in which\\n\\t\\t\\t\\tnonrefundable deposits were paid.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is, in our opinion, but Allah knows\\n\\t\\t\\t\\tbest, that for instance, a man buys a slave or slave-girl\\n\\t\\t\\t\\tor rents an animal and then says to the person from whom\\n\\t\\t\\t\\the bought the slave or leased the animal, 'I will give\\n\\t\\t\\t\\tyou a dinar or a dirham or whatever on the condition that\\n\\t\\t\\t\\tif I actually take the goods or ride what I have rented\\n\\t\\t\\t\\tfrom you, then what I have given you already goes towards\\n\\t\\t\\t\\tpayment of the goods or hire of the animal. If I do not\\n\\t\\t\\t\\tpurchase the goods or hire the animal, then what I have\\n\\t\\t\\t\\tgiven you is yours without liability on your part.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"According to the way of doing things with us\\n\\t\\t\\t\\tthere is nothing wrong in bartering an arabic speaking\\n\\t\\t\\t\\tmerchant slave for abyssinian slaves or any other type\\n\\t\\t\\t\\tthat are not his equal in eloquence, trading, shrewdness,\\n\\t\\t\\t\\tand know-how. There is nothing wrong in bartering one\\n\\t\\t\\t\\tslave like this for two or more other slaves with a\\n\\t\\t\\t\\tstated delay in the terms if he is clearly different. If\\n\\t\\t\\t\\tthere is no appreciable difference between the slaves,\\n\\t\\t\\t\\ttwo should not be bartered for one with a stated delay in\\n\\t\\t\\t\\tthe terms even if their racial type is different.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is nothing wrong in selling what has\\n\\t\\t\\t\\tbeen bought in such a transaction before taking\\n\\t\\t\\t\\tpossession of all of it as long as you receive the price\\n\\t\\t\\t\\tfor it from some one other than the original owner.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"An addition to the price must not be made\\n\\t\\t\\t\\tfor a foetus in the womb of its mother when she is sold\\n\\t\\t\\t\\tbecause that is gharar (an uncertain transaction). It is\\n\\t\\t\\t\\tnot known whether the child will be male or female,\\n\\t\\t\\t\\tgood-looking or ugly, normal or handicapped, alive or\\n\\t\\t\\t\\tdead. All these things will affect the price.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that in a transaction where a slave or\\n\\t\\t\\t\\tslave-girl was bought for one hundred dinars with a\\n\\t\\t\\t\\tstated credit period that if the seller regretted the\\n\\t\\t\\t\\tsale there was nothing wrong in him asking the buyer to\\n\\t\\t\\t\\trevoke it for ten dinars which he would pay him\\n\\t\\t\\t\\timmediately or after a period and he would forgo his\\n\\t\\t\\t\\tright to the hundred dinars which he was owed.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"However, if the buyer regrets and asks the\\n\\t\\t\\t\\tseller to revoke the sale of a slave or slave-girl in\\n\\t\\t\\t\\tconsideration of which he will pay an extra ten dinars\\n\\t\\t\\t\\timmediately or on credit terms, extended beyond the\\n\\t\\t\\t\\toriginal term, that should not be done. It is disapproved\\n\\t\\t\\t\\tof because it is as if, for instance, the seller is\\n\\t\\t\\t\\tbuying the one hundred dinars which is not yet due on a\\n\\t\\t\\t\\tyear's credit term before the year expires for a\\n\\t\\t\\t\\tslave-girl and ten dinars to be paid immediately or on\\n\\t\\t\\t\\tcredit term longer than the year. This falls into the\\n\\t\\t\\t\\tcategory of selling gold for gold when delayed terms\\n\\t\\t\\t\\tenter into it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that it was not proper for a man to sell a\\n\\t\\t\\t\\tslave-girl to another man for one hundred dinars on\\n\\t\\t\\t\\tcredit and then to buy her back for more than the\\n\\t\\t\\t\\toriginal price or on a credit term longer than the\\n\\t\\t\\t\\toriginal term for which he sold her. To understand why\\n\\t\\t\\t\\tthat was disapproved of in that case, the example of a\\n\\t\\t\\t\\tman who sold a slave-girl on credit and then bought her\\n\\t\\t\\t\\tback on a credit term longer than the original term was\\n\\t\\t\\t\\tlooked at. He might have sold her for thirty dinars with\\n\\t\\t\\t\\ta month to pay and then buy her back for sixty dinars\\n\\t\\t\\t\\twith a year or half a year to pay. The outcome would only\\n\\t\\t\\t\\tbe that his goods would have returned to him just like\\n\\t\\t\\t\\tthey were and the other party would have given him thirty\\n\\t\\t\\t\\tdinars on a month's credit against sixty dinars on a year\\n\\t\\t\\t\\tor half a year's credit. That was not to be done.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "2",
    "sectionHeading": "Wealth of Slaves",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that Umar ibn al-Khattab said, \"If a slave who\\n\\t\\t\\t\\thas wealth is sold, that wealth belongs to the seller\\n\\t\\t\\t\\tunless the buyer stipulates its inclusion.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed upon way of doing\\n\\t\\t\\t\\tthings among us is that if the buyer stipulates the\\n\\t\\t\\t\\tinclusion of the slave's property whether it be cash,\\n\\t\\t\\t\\tdebts, or goods of known or unknown value, then they\\n\\t\\t\\t\\tbelong to the buyer, even if the slave possesses more\\n\\t\\t\\t\\tthan that for which he was purchased, whether he was\\n\\t\\t\\t\\tbought for cash, as payment for a debt, or in exchange\\n\\t\\t\\t\\tfor goods. This is possible because a master is not asked\\n\\t\\t\\t\\tto pay zakat on his slave's property. If a slave has a\\n\\t\\t\\t\\tslave-girl, it is halal for him to have intercourse with\\n\\t\\t\\t\\ther by his right of possession. If a slave is freed or\\n\\t\\t\\t\\tput under contract (kitaba) to purchase his freedom, then\\n\\t\\t\\t\\this property goes with him. If he becomes bankrupt, his\\n\\t\\t\\t\\tcreditors take his property and his master is not liable\\n\\t\\t\\t\\tfor any of his debts.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "3",
    "sectionHeading": "Built-In Liability Agreements",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tibn Muhammad ibn Amr ibn Hazm that Aban ibn Uthman and\\n\\t\\t\\t\\tHisham ibn Ismail used to mention in their khutbas\\n\\t\\t\\t\\tbuilt-in liability agreements in the sale of slaves, to\\n\\t\\t\\t\\tcover both a three day period and a similar clause\\n\\t\\t\\t\\tcovering a year. Malik explained, \"The defects a lave or\\n\\t\\t\\t\\tslave-girl are found to have from the time they are\\n\\t\\t\\t\\tbought until the end of the three days are the\\n\\t\\t\\t\\tresponsibility of the seller. The year agreement is to\\n\\t\\t\\t\\tcover insanity, leprosy, and loss of limbs due to\\n\\t\\t\\t\\tdisease. After a year, the seller is free from any\\n\\t\\t\\t\\tliability.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said,\"An inheritor or someone else who sells a\\n\\t\\t\\t\\tslave or slave-girl without any such built-in guarantee\\n\\t\\t\\t\\tis not responsible for any fault in the slave and there\\n\\t\\t\\t\\tis no liability agreement held against him unless he was\\n\\t\\t\\t\\taware of a fault and concealed it. If he was aware of a\\n\\t\\t\\t\\tfault, the lack of guarantee does not protect him. The\\n\\t\\t\\t\\tpurchase is returned. In our view, built-in liability\\n\\t\\t\\t\\tagreements only apply to the purchase of slaves.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "4",
    "sectionHeading": "Defects in Slaves",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tSalim ibn Abdullah that Abdullah ibn Umar sold one of his\\n\\t\\t\\t\\tslaves for eight hundred dirhams with the stipulation\\n\\t\\t\\t\\tthat he was not responsible for defects. The person who\\n\\t\\t\\t\\tbought the slave complained to Abdullah ibn Umar that the\\n\\t\\t\\t\\tslave had a disease which he had not told him about. They\\n\\t\\t\\t\\targued and went to Uthman ibn Affan for a decision . The\\n\\t\\t\\t\\tman said, \"He sold me a slave with a disease which he did\\n\\t\\t\\t\\tnot tell me about.\" Abdullah said, \"I sold to him with\\n\\t\\t\\t\\tthe stipulation that I was not responsible.\" Uthman ibn\\n\\t\\t\\t\\tAffan decided that Abdullah ibn Umar should take an oath\\n\\t\\t\\t\\tthat he had sold the slave without knowing that he had\\n\\t\\t\\t\\tany disease. Abdullah ibn Umar refused to take the oath,\\n\\t\\t\\t\\tso the slave was returned to him and recovered his health\\n\\t\\t\\t\\tin his possession. Abdullah sold him afterwards for 1500\\n\\t\\t\\t\\tdirhams.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed upon way of doing\\n\\t\\t\\t\\tthings among us about a man who buys a female slave and\\n\\t\\t\\t\\tshe becomes pregnant, or who buys a slave and then frees\\n\\t\\t\\t\\thim, or if there is any other such matter which has\\n\\t\\t\\t\\talready happened so that he cannot return his purchase,\\n\\t\\t\\t\\tand a clear proof is established that there was a fault\\n\\t\\t\\t\\tin that purchase when it was in the hands of the seller\\n\\t\\t\\t\\tor the fault is admitted by the seller or someone else,\\n\\t\\t\\t\\tis that the slave or slave-girl is assessed for its value\\n\\t\\t\\t\\twith the fault it is found to have had on the day of\\n\\t\\t\\t\\tpurchase and the buyer is refunded,from what he paid,the\\n\\t\\t\\t\\tdifference between the price of a slave who is sound and\\n\\t\\t\\t\\ta slave with such a defect.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed upon way of doing\\n\\t\\t\\t\\tthings among us regarding a man who buys a slave and then\\n\\t\\t\\t\\tfinds out that the slave has a defect for which he can be\\n\\t\\t\\t\\treturned and meanwhile another defect has happened to the\\n\\t\\t\\t\\tslave whilst in his possession, is that if the defect\\n\\t\\t\\t\\twhich occurred to the slave in his possession has harmed\\n\\t\\t\\t\\thim, like loss of a limb, loss of an eye, or something\\n\\t\\t\\t\\tsimilar, then he has a choice. If he wants, he can have\\n\\t\\t\\t\\tthe price of the slave reduced commensurate with the\\n\\t\\t\\t\\tdefect (he bought him with ) according to the prices on\\n\\t\\t\\t\\tthe day he bought him, or if he likes, he can pay\\n\\t\\t\\t\\tcompensation for the defect which the slave has suffered\\n\\t\\t\\t\\tin his possession and return him. The choice is up to\\n\\t\\t\\t\\thim. If the slave dies in his possession, the slave is\\n\\t\\t\\t\\tvalued with the defect which he had on the day of his\\n\\t\\t\\t\\tpurchase. It is seen what his price would really have\\n\\t\\t\\t\\tbeen. If the price of the slave on the day of purchase\\n\\t\\t\\t\\twithout fault was 100 dinars, and his price on the day of\\n\\t\\t\\t\\tpurchase with fault would have been 80 dinars, the price\\n\\t\\t\\t\\tis reduced by the difference. These prices are assessed\\n\\t\\t\\t\\taccording to the market value on the day the slave was\\n\\t\\t\\t\\tpurchased . \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed upon way of doing\\n\\t\\t\\t\\tthings among us is that if a man returns a slave girl in\\n\\t\\t\\t\\twhom he has found a defect and he has already had\\n\\t\\t\\t\\tintercourse with her, he must pay what he has reduced of\\n\\t\\t\\t\\ther price if she was a virgin. If she was not a virgin,\\n\\t\\t\\t\\tthere is nothing against his having had intercourse with\\n\\t\\t\\t\\ther because he had charge of her.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed upon way of doing\\n\\t\\t\\t\\tthings among us regarding a person, whether he is an\\n\\t\\t\\t\\tinheritor or not, who sells a slave, slave-girl, or\\n\\t\\t\\t\\tanimal without a liability agreement is that he is not\\n\\t\\t\\t\\tresponsible for any defect in what he sold unless he knew\\n\\t\\t\\t\\tabout the fault and concealed it. If he knew that there\\n\\t\\t\\t\\twas a fault and concealed it, his declaration that he was\\n\\t\\t\\t\\tfree of responsibility does not absolve him, and what he\\n\\t\\t\\t\\tsold is returned to him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a situation where a slave-girl was\\n\\t\\t\\t\\tbartered for two other slave-girls and then one of the\\n\\t\\t\\t\\tslave-girls was found to have a defect for which she\\n\\t\\t\\t\\tcould be returned. He said, \"The slave-girl worth two\\n\\t\\t\\t\\tother slave-girls is valued for her price. Then the other\\n\\t\\t\\t\\ttwo slave-girls are valued, ignoring the defect which the\\n\\t\\t\\t\\tone of them has. Then the price of the slave-girl sold\\n\\t\\t\\t\\tfor two slave-girls is divided between them according to\\n\\t\\t\\t\\ttheir prices so that the proportion of each of them in\\n\\t\\t\\t\\ther price is arrived at - to the higher priced one\\n\\t\\t\\t\\taccording to her higher price, and to the other according\\n\\t\\t\\t\\tto her value. Then one looks at the one with the defect,\\n\\t\\t\\t\\tand the buyer is refunded according to the amount her\\n\\t\\t\\t\\tshare is affected by the defect, be it little or great.\\n\\t\\t\\t\\tThe price of the two slave-girls is based on their market\\n\\t\\t\\t\\tvalue on the day that they were bought.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who bought a slave and hired him\\n\\t\\t\\t\\tout on a long-term or short-term basis and then found out\\n\\t\\t\\t\\tthat the slave had a defect which necessitated his\\n\\t\\t\\t\\treturn. He said that if the man returned the slave\\n\\t\\t\\t\\tbecause of the defect, he kept the hire and revenue.\\n\\t\\t\\t\\t\"This is the way in which things are done in our city.\\n\\t\\t\\t\\tThat is because, had the man bought a slave who then\\n\\t\\t\\t\\tbuilt a house for him, and the value of the house was\\n\\t\\t\\t\\tmany times the price of the slave, and he then found that\\n\\t\\t\\t\\tthe slave had a defect for which he could be returned,\\n\\t\\t\\t\\tand he\\twas returned, he would not have to make payment\\n\\t\\t\\t\\tfor the work the slave had done for him. Similarly, he\\n\\t\\t\\t\\twould keep any revenue from hiring him out, because he\\n\\t\\t\\t\\thad charge of him. This is the way of doing things among\\n\\t\\t\\t\\tus.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things among us when\\n\\t\\t\\t\\tsomeone buys several slaves in one lot and then finds\\n\\t\\t\\t\\tthat one of them has been stolen, or has a defect, is\\n\\t\\t\\t\\tthat he looks at the one he finds has been stolen or the\\n\\t\\t\\t\\tone in which he finds a defect. If he is the pick of\\n\\t\\t\\t\\tthose slaves, or the most expensive, or it was for his\\n\\t\\t\\t\\tsake that he bought them, or he is the one in whom people\\n\\t\\t\\t\\tsee the most excellence, then the whole sale is returned.\\n\\t\\t\\t\\tIf the one who is found to be stolen or to have a defect\\n\\t\\t\\t\\tis not the pick of the slaves, and he did not buy them\\n\\t\\t\\t\\tfor his sake, and there is no special virtue which people\\n\\t\\t\\t\\tsee in him, the one who is found to have a defect or to\\n\\t\\t\\t\\thave been stolen is returned as he is, and the buyer is\\n\\t\\t\\t\\trefunded his portion of the total price.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "5",
    "sectionHeading": "What is Done about Slave-Girls when Purchased and Conditions Made about Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud told him that\\n\\t\\t\\t\\tAbdullah ibn Masud bought a slave-girl from his wife,\\n\\t\\t\\t\\tZaynab Ath Thaqafiyya. She made a condition to him, that\\n\\t\\t\\t\\tif he bought her, she could always buy her back for the\\n\\t\\t\\t\\tprice that he paid. Abdullah ibn Masud asked Umar ibn\\n\\t\\t\\t\\tal-Khattab about that and Umar ibn al-Khattab said, \"Do\\n\\t\\t\\t\\tnot go near her while anyone has a condition concerning\\n\\t\\t\\t\\ther over you.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "6",
    "sectionHeading": "What is Done about Slave-Girls when Purchased and Conditions Made about Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar would say, \"A man should not have intercourse\\n\\t\\t\\t\\twith a slave girl except one whom, if he wished, he could\\n\\t\\t\\t\\tsell, if he wished, he could give away, if he wished, he\\n\\t\\t\\t\\tcould keep, if he wished, he could do with her what he\\n\\t\\t\\t\\twanted .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that a man who bought a slave-girl on\\n\\t\\t\\t\\tcondition that he did not sell her, give her away, or do\\n\\t\\t\\t\\tsomething of that nature, was not to have intercourse\\n\\t\\t\\t\\twith her. That was because he was not permitted to sell\\n\\t\\t\\t\\ther or to give her away, so if he did not own that from\\n\\t\\t\\t\\ther, he did not have complete ownership of her because an\\n\\t\\t\\t\\texception had been made concerning her by the hand of\\n\\t\\t\\t\\tsomeone else. If that sort of condition entered into it,\\n\\t\\t\\t\\tit was a messy situation, and the sale was not\\n\\t\\t\\t\\trecommended.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "7",
    "sectionHeading": "Prohibition against Intercourse with Slave-Girls Who Have Husbands",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tAbdullah ibn Amir gave Uthman ibn Affan a slave-girl who\\n\\t\\t\\t\\thad a husband whom he had purchased at Basra. Uthman\\n\\t\\t\\t\\tsaid, \"I will not go near her until her husband separates\\n\\t\\t\\t\\tfrom her.\" Ibn Amir compensated the husband and he\\n\\t\\t\\t\\tseparated from her.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "8",
    "sectionHeading": "Prohibition against Intercourse with Slave-Girls Who Have Husbands",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tSalama ibn Abd ar-Rahman ibn Awf that Abd ar-Rahman ibn\\n\\t\\t\\t\\tAwf bought a slave-girl and found that she had a husband,\\n\\t\\t\\t\\tso he returned her.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "9",
    "sectionHeading": "Ownership of the Fruit of Trees which have been Sold.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"If palm trees are sold after\\n\\t\\t\\t\\tthey have been pollinated, the fruit belongs to the\\n\\t\\t\\t\\tseller unless the buyer makes a stipulation about its\\n\\t\\t\\t\\tinclusion.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "10",
    "sectionHeading": "Prohibition against Selling Fruit until It starts to Ripen",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Ibn Umar\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, forbade selling fruit until it had\\n\\t\\t\\t\\tstarted to ripen. He forbade the transaction to both\\n\\t\\t\\t\\tbuyer and seller.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "11",
    "sectionHeading": "Prohibition against Selling Fruit until It starts to Ripen",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd at-Tawil from\\n\\t\\t\\t\\tAnas ibn Malik that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade selling fruit\\n\\t\\t\\t\\tuntil it had become mellow. He was asked, \"Messenger\\n\\t\\t\\t\\tofAllah! What do you mean by become mellow?\" He said,\\n\\t\\t\\t\\t\"When it becomes rosy.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, added, \"Allah may prevent the fruit from maturing,\\n\\t\\t\\t\\tso how can you take payment from your brother for it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "12",
    "sectionHeading": "Prohibition against Selling Fruit until It starts to Ripen",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'r-Rijal Muhammad\\n\\t\\t\\t\\tibn Abd ar-Rahman ibn Haritha from his mother, Amra bint\\n\\t\\t\\t\\tAbd ar-Rahman that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade selling fruit\\n\\t\\t\\t\\tuntil it was clear of blight. Malik said, \"Selling fruit\\n\\t\\t\\t\\tbefore it has begun to ripen is an uncertain transaction\\n\\t\\t\\t\\t(gharar) .\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "13",
    "sectionHeading": "Prohibition against Selling Fruit until It starts to Ripen",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from\\n\\t\\t\\t\\tKharija ibn Zayd ibn Thabit that Zayd ibn Thabit did not\\n\\t\\t\\t\\tsell fruit until the Pleiades were visible, at the end of\\n\\t\\t\\t\\tMay.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things among us about\\n\\t\\t\\t\\tselling melons, cucumbers, water-melons, and carrots is\\n\\t\\t\\t\\tthat it is halal to sell them when it is clear that they\\n\\t\\t\\t\\thave begun to ripen. Then the buyer has what grows until\\n\\t\\t\\t\\tthe season is over. There is no specific timing laid down\\n\\t\\t\\t\\tfor that because the time is well known with people, and\\n\\t\\t\\t\\tit may happen that the crop will be affected by blight\\n\\t\\t\\t\\tand put a premature end to the season. If blight strikes\\n\\t\\t\\t\\tand a third or more of the crop is damaged, an allowance\\n\\t\\t\\t\\tfor that is deducted from the price of purchase.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "14",
    "sectionHeading": "The Sale of Ariyas",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar from Zayd ibn Thabit that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, allowed\\n\\t\\t\\t\\tthe holder of an ariya to barter the dates on the palm\\n\\t\\t\\t\\tfor the amount of dried dates it was estimated that the\\n\\t\\t\\t\\tpalms would produce.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Da'ud ibn al-Husayn\\n\\t\\t\\t\\tfrom Abu Sufyan, the mawla of Ibn Abi Ahmad, from Abu\\n\\t\\t\\t\\tHurayra that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, allowed the produce of an ariya to\\n\\t\\t\\t\\tbe bartered for an estimation of what the produce would\\n\\t\\t\\t\\tbe when the crop was less than five awsuq or equal to\\n\\t\\t\\t\\tfive awsuq. Da'ud wasn't sure whether he said five awsuq\\n\\t\\t\\t\\tor less than five.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, ''Ariyas can be sold for an estimation of\\n\\t\\t\\t\\twhat amount of dried dates will be produced. The crop is\\n\\t\\t\\t\\texamined and estimated while still on the palm. This is\\n\\t\\t\\t\\tallowed because it comes into the category of delegation\\n\\t\\t\\t\\tof responsibility, handing over rights, and involving a\\n\\t\\t\\t\\tpartner. Had it been like a form of sale, no one would\\n\\t\\t\\t\\thave made someone else a partner in the produce until it\\n\\t\\t\\t\\twas ready nor would he have renounced his right to any of\\n\\t\\t\\t\\tit or put someone in charge of it until the buyer had\\n\\t\\t\\t\\ttaken possession.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "15",
    "sectionHeading": "How Crop Damage Affects Sales of Agricultural Produce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu'r-Rijal Muhammad\\n\\t\\t\\t\\tibn Abd ar-Rahman heard his mother, Amra bint Abd\\n\\t\\t\\t\\tar-Rahman say, \"A man bought the fruit of an enclosed\\n\\t\\t\\t\\torchard in the time of the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and he tended it while\\n\\t\\t\\t\\tstaying on the land. It became clear to him that there\\n\\t\\t\\t\\twas going to be some loss. He asked the owner of the\\n\\t\\t\\t\\torchard to reduce the price for him or to revoke the\\n\\t\\t\\t\\tsale, but the owner made an oath not to do so. The mother\\n\\t\\t\\t\\tof the buyer went to the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, and told him about it. The\\n\\t\\t\\t\\tMessengerof Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'By this oath, he has sworn not to do good.'\\n\\t\\t\\t\\tThe owner of the orchard heard about it and went to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and said, 'Messenger of Allah, the choice is his.'\\n\\t\\t\\t\\t\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "16",
    "sectionHeading": "How Crop Damage Affects Sales of Agricultural Produce",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn Abd al-Aziz decided in a case to make a\\n\\t\\t\\t\\treduction for crop damage.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is what we do in the situation.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added, \"Crop damage is whatever causes loss of a\\n\\t\\t\\t\\tthird or more for the purchaser. Anything less is not\\n\\t\\t\\t\\tcounted as crop damage.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "17",
    "sectionHeading": "What is Permissible in Keeping Back a Portion of the Fruit",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abd\\n\\t\\t\\t\\tar-Rahman that al-Qasim ibn Muhammad would sell produce\\n\\t\\t\\t\\tfrom his orchard and keep some of it aside.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "18",
    "sectionHeading": "What is Permissible in Keeping Back a Portion of the Fruit",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abi Bakr\\n\\t\\t\\t\\tthat his grandfather, Muhammad ibn Amr ibn Hazm sold the\\n\\t\\t\\t\\tfruit of an orchard of his called al-Afraq, for 4,000\\n\\t\\t\\t\\tdirhams, and he kept aside 800 dirhams' worth of dry\\n\\t\\t\\t\\tdates.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "19",
    "sectionHeading": "What is Permissible in Keeping Back a Portion of the Fruit",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'r-Rijal, Muhammad\\n\\t\\t\\t\\tibn Abdar-Rahman ibn Haritha that his mother, Amra bint\\n\\t\\t\\t\\tAbd ar-Rahman used to sell her fruit and keep some of it\\n\\t\\t\\t\\taside.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed upon way of doing\\n\\t\\t\\t\\tthings among us is that when a man sells the fruit of his\\n\\t\\t\\t\\torchard, he can keep aside up to a third of the fruit,\\n\\t\\t\\t\\tbut that is not to be exceeded. There is no harm in what\\n\\t\\t\\t\\tis less than a third.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik added that he thought there was no harm for a man\\n\\t\\t\\t\\tto sell the fruit of his orchard and keep aside only the\\n\\t\\t\\t\\tfruit of a certain palm-tree or palm-trees which he had\\n\\t\\t\\t\\tchosen and whose number he had specified, because the\\n\\t\\t\\t\\towner was only keeping aside certain fruit of his own\\n\\t\\t\\t\\torchard and everything else he sold.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "20",
    "sectionHeading": "What is Not Recommended in the Sale of Dates",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tAta ibn Yasar said, \"The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'Dried dates for\\n\\t\\t\\t\\tdried dates is like for like.' It was said to him, 'Your\\n\\t\\t\\t\\tagent in Khaybar takes one sa for two.' The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'all him to me.' So he was called for. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, asked,\\n\\t\\t\\t\\t'Do you take one sa for two?' He replied, 'Messengerof\\n\\t\\t\\t\\tAllah! Why should they sell me good dates for assorted\\n\\t\\t\\t\\tlow quality dates, sa for sa!' The Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, 'Sell the\\n\\t\\t\\t\\tassorted ones for dirhams, and then buy the good ones\\n\\t\\t\\t\\twith those dirhams.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "21",
    "sectionHeading": "What is Not Recommended in the Sale of Dates",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd al-Hamid ibn\\n\\t\\t\\t\\tSuhayl ibn Abd ar-Rahman ibn Awf from Said ibn\\n\\t\\t\\t\\tal-Musayyab from Abu Said al-Khudri and from Abu Hurayra\\n\\t\\t\\t\\tthat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, appointed a man as an agent in Khaybar,\\n\\t\\t\\t\\tand he brought him some excellent dates. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said to\\n\\t\\t\\t\\thim, \"Are all the dates of Khaybar like this?\" He\\n\\t\\t\\t\\tsaid,\"No. By Allah, Messenger of Allah! We take a sa of\\n\\t\\t\\t\\tthis kind for two sa or two sa for three.\" The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Do not do that. Sell the assorted ones for dirhams and\\n\\t\\t\\t\\tthen buy the good ones with the dirhams.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "22",
    "sectionHeading": "What is Not Recommended in the Sale of Dates",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Yazid\\n\\t\\t\\t\\tthat Zayd ibn Ayyash told him that he had once asked Sad\\n\\t\\t\\t\\tibn Abi Waqqas about selling white wheat for a type of\\n\\t\\t\\t\\tgood barley. Sad asked him which was the better and when\\n\\t\\t\\t\\the told him the white wheat, he forbade the transaction.\\n\\t\\t\\t\\tSad said, \"I heard the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, being asked about selling\\n\\t\\t\\t\\tdried dates for fresh dates, and the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, 'Do the\\n\\t\\t\\t\\tdates diminish in size when they become dry?' When he was\\n\\t\\t\\t\\ttold that they did, he forbade that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "23",
    "sectionHeading": "Muzabana and Muhaqala",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade muzabana. Muzabana was\\n\\t\\t\\t\\tselling fresh dates for dried dates by measure, and\\n\\t\\t\\t\\tselling grapes for raisins by measure.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "24",
    "sectionHeading": "Muzabana and Muhaqala",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Da'ud ibn al-Husayn\\n\\t\\t\\t\\tfrom Abu Sufyan, the mawla of Ibn Abi Ahmad, from Abu\\n\\t\\t\\t\\tSaid al-Khudri that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade muzabana and\\n\\t\\t\\t\\tmuhaqala. Muzabana was selling fresh dates for dried\\n\\t\\t\\t\\tdates while they were still on the trees. Muhaqala was\\n\\t\\t\\t\\trenting land in exchange for wheat.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "25",
    "sectionHeading": "Muzabana and Muhaqala",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade muzabana and\\n\\t\\t\\t\\tmuhaqala. Muzabana was selling fresh dates for dried\\n\\t\\t\\t\\tdates. Muhaqala was buying unharvested wheat in exchange\\n\\t\\t\\t\\tfor threshed wheat and renting land in exchange for\\n\\t\\t\\t\\twheat.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIbn Shihab added that he had asked Said ibn al-Musayyab\\n\\t\\t\\t\\tabout renting land for gold and silver. He said, \"There\\n\\t\\t\\t\\tis no harm in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade muzabana. The explanation of\\n\\t\\t\\t\\tmuzabana is that it is buying something whose number,\\n\\t\\t\\t\\tweight and measure is not known with something whose\\n\\t\\t\\t\\tnumber, weight or measure is known, for instance, if a\\n\\t\\t\\t\\tman has a stack of food whose measure is not known,\\n\\t\\t\\t\\teither of wheat, dates, or whatever food, or the man has\\n\\t\\t\\t\\tgoods of wheat, date kernels, herbs, safflower, cotton,\\n\\t\\t\\t\\tflax, silk, and does not know its measure or weight or\\n\\t\\t\\t\\tnumber and then a buyer approaches him and proposes that\\n\\t\\t\\t\\the weigh or measure or count the goods, but, before he\\n\\t\\t\\t\\tdoes, he specifies a certain weight, or measure, or\\n\\t\\t\\t\\tnumber and guarantees to pay the price for that amount,\\n\\t\\t\\t\\tagreeing that whatever falls short of that amount is a\\n\\t\\t\\t\\tloss against him and whatever is in excess of that amount\\n\\t\\t\\t\\tis a gain for him. That is not a sale. It is taking risks\\n\\t\\t\\t\\tand it is an uncertain transaction. It falls into the\\n\\t\\t\\t\\tcategory of gambling because he is not buying something\\n\\t\\t\\t\\tfrom him for something definite which he pays. Everything\\n\\t\\t\\t\\twhich resembles this is also forbidden.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that another example of that was, for\\n\\t\\t\\t\\tinstance, a man proposing to another man, \"You have\\n\\t\\t\\t\\tcloth. I will guarantee you from this cloth of yours so\\n\\t\\t\\t\\tmany hooded cloaks, the measureof each cloak to be\\n\\t\\t\\t\\tsuch-and-such, (naming a measurement). Whatever loss\\n\\t\\t\\t\\tthere is, is against me and I will fulfill you the\\n\\t\\t\\t\\tspecified amount and whatever excess there is, is mine.\"\\n\\t\\t\\t\\tOr perhaps the man proposed, \"I will guarantee you from\\n\\t\\t\\t\\tthis cloth of yours so many shirts, the measurement of\\n\\t\\t\\t\\teach shirt to be such-and-such, and whatever loss there\\n\\t\\t\\t\\tis, is against me and I will fulfill the specified amount\\n\\t\\t\\t\\tand whatever excess there is, is mine.\" Or perhaps a man\\n\\t\\t\\t\\tproposed to a man who had cattle or camel hides, \"I will\\n\\t\\t\\t\\tcut up these hides of yours into sandals on a pattern I\\n\\t\\t\\t\\twill show you. Whatever falls short of a hundred pairs, I\\n\\t\\t\\t\\twill make up its loss and whatever is over is mine\\n\\t\\t\\t\\tbecause I guaranteed you.\" Another example was that a man\\n\\t\\t\\t\\tsay to a man who had ben-nuts, \"I will press these nuts\\n\\t\\t\\t\\tof yours. Whatever falls short of such-and-such a weight\\n\\t\\t\\t\\tby the pound, I will make it up, and whatever is more\\n\\t\\t\\t\\tthan that is mine.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that all this and whatever else was like it or\\n\\t\\t\\t\\tresembled it was in the category of muzabana, which was\\n\\t\\t\\t\\tneither good nor permitted. It was also the same case for\\n\\t\\t\\t\\ta man to say to a man, who had fodder leaves, date\\n\\t\\t\\t\\tkernels, cotton, flax, herbs or safflower, \"I will buy\\n\\t\\t\\t\\tthese leaves from you in exchange for such-and-such a sa,\\n\\t\\t\\t\\t(indicating leaves which are pounded like his leaves) . .\\n\\t\\t\\t\\tor these date kernels for such-and-such a sa of kernels\\n\\t\\t\\t\\tlike them, and the like of that in the case of safflower,\\n\\t\\t\\t\\tcotton, flax and herbs.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"All this is what we have described of\\n\\t\\t\\t\\tmuzabana.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "26",
    "sectionHeading": "General Remarks about Selling Produce at its Source",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in buying dates from\\n\\t\\t\\t\\tspecified trees or a specified orchard or buying milk\\n\\t\\t\\t\\tfrom specified sheep when the buyer starts to take them\\n\\t\\t\\t\\tas soon as he has payed the price. That is like buying\\n\\t\\t\\t\\toil from a container. A man buys some of it for a dinar\\n\\t\\t\\t\\tor two and gives his gold and stipulates that it be\\n\\t\\t\\t\\tmeasured out for him. There is no harm in that. If the\\n\\t\\t\\t\\tcontainer breaks and the oil is wasted, the buyer has his\\n\\t\\t\\t\\tgold back and there is no transaction between them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in everything which is\\n\\t\\t\\t\\ttaken right away as it is, like fresh milk and fresh\\n\\t\\t\\t\\tpicked dates which the buyer can take on a day-to-day\\n\\t\\t\\t\\tbasis. If the supply runs out before the buyer has what\\n\\t\\t\\t\\the has paid for in full, the seller gives him back the\\n\\t\\t\\t\\tportion of the gold that is owed to him, or else the\\n\\t\\t\\t\\tbuyer takes other goods from him to the value of what he\\n\\t\\t\\t\\tis owed and which they mutually agree about. The buyer\\n\\t\\t\\t\\tshould stay with the seller until he has taken it. It is\\n\\t\\t\\t\\tdisapproved of for the seller to leave because the\\n\\t\\t\\t\\ttransaction would then come into the forbidden category\\n\\t\\t\\t\\tof a debt for a debt. If a stated time period for payment\\n\\t\\t\\t\\tor delivery enters into the transaction, it is also\\n\\t\\t\\t\\tdisapproved. Delay and deferment are not permitted in it,\\n\\t\\t\\t\\tand are only acceptable when it is standard practice on\\n\\t\\t\\t\\tdefinite terms by which the seller guarantees it to the\\n\\t\\t\\t\\tbuyer, but this is not to be from one specific orchard or\\n\\t\\t\\t\\tfrom any specific ewes.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked about a man who bought an orchard from\\n\\t\\t\\t\\tanother man in which there were various types of\\n\\t\\t\\t\\tpalm-trees - excellent ajwa palms, good kabis palms, adhq\\n\\t\\t\\t\\tpalms and othertypes. The seller kept aside from the sale\\n\\t\\t\\t\\tthe produce of a certain palm of his choice. Malik said,\\n\\t\\t\\t\\t\"That is not good because if he does that, and keeps\\n\\t\\t\\t\\taside, for instance, dates of the ajwa variety whose\\n\\t\\t\\t\\tyield would be 15 sa, and he picks the dates of the kabis\\n\\t\\t\\t\\tin their place, and the yield of their dates is 10 sa or\\n\\t\\t\\t\\the picks the ajwa which yield 15 sa and leaves the kabis\\n\\t\\t\\t\\twhich yield 10 sa, it is as if he bought the ajwa for the\\n\\t\\t\\t\\tkabis making allowances for their difference of quality.\\n\\t\\t\\t\\tThis is the same as if a man dealing with a man who has\\n\\t\\t\\t\\theaps of dates before him - a heap of 15 sa of ajwa, a\\n\\t\\t\\t\\theap of 10 sa of kabis, and a heap of 12 sa of cadhq,\\n\\t\\t\\t\\tgives the owner of the dates a dinar to let him choose\\n\\t\\t\\t\\tand take whichever of the heaps he likes.\" Malik said,\\n\\t\\t\\t\\t\"That is not good.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik was asked what a man who bought fresh dates from\\n\\t\\t\\t\\tthe owner of an orchard and advanced him a dinar was\\n\\t\\t\\t\\tentitled to if the crop was spoilt. Malik said, \"The\\n\\t\\t\\t\\tbuyer makes a reckoning with the owner of the orchard and\\n\\t\\t\\t\\ttakes what is due to him of the dinar. If the buyer has\\n\\t\\t\\t\\ttaken two-thirds of a dinar's worth of dates, he gets\\n\\t\\t\\t\\tback the third of a dinar which is owed him. If the buyer\\n\\t\\t\\t\\thas taken three-quarters of a dinar's worth of dates,\\n\\t\\t\\t\\tthen he gets back the quarter which is owed to him, or\\n\\t\\t\\t\\tthey come to a mutual agreement, and the buyer takes what\\n\\t\\t\\t\\tis owed him from his dinar from the owner of the orchard\\n\\t\\t\\t\\tin something else of his choosing. If, for instance, he\\n\\t\\t\\t\\tprefers to take dry dates or some other goods, he takes\\n\\t\\t\\t\\tthem according to what is due. If he takes dry dates or\\n\\t\\t\\t\\tsome other goods, he should stay with him until he has\\n\\t\\t\\t\\tbeen paid in full.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the same situation as hiring out a\\n\\t\\t\\t\\tspecified riding-camel or hiring out a slave tailor,\\n\\t\\t\\t\\tcarpenter or some other kind of worker or letting a house\\n\\t\\t\\t\\tand taking payment in advance for the hire of the slave\\n\\t\\t\\t\\tor the rent of the house or camel. Then an accident\\n\\t\\t\\t\\thappens to what has been hired resulting in death or\\n\\t\\t\\t\\tsomething else. The owner of the camel, slave or house\\n\\t\\t\\t\\treturns what remains of the rent of the camel, the hire\\n\\t\\t\\t\\tof the slave or the rent of the house to the one who\\n\\t\\t\\t\\tadvanced him the money, and the owner reckons what will\\n\\t\\t\\t\\tsettle that up in full. If, for instance, he has provided\\n\\t\\t\\t\\thalf of what the man paid for, he returns the remaining\\n\\t\\t\\t\\thalf of what he advanced, or according to whatever amount\\n\\t\\t\\t\\tis due.\" Malik said, \"Paying in advance for something\\n\\t\\t\\t\\twhich is on hand is only good when the buyer takes\\n\\t\\t\\t\\tpossession of what he has paid for as soon as he hands\\n\\t\\t\\t\\tover the gold, whether it be slave, camel, or house, or\\n\\t\\t\\t\\tin the case of dates, he starts to pick them as soon as\\n\\t\\t\\t\\the has paid the money.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tIt is not good that there be any deferment or credit in\\n\\t\\t\\t\\tsuch a transaction.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"An example illustrating what is disapproved\\n\\t\\t\\t\\tof in this situation is that, for instance, a man may say\\n\\t\\t\\t\\tthat he will pay someone in advance for the use of his\\n\\t\\t\\t\\tcamel to ride in the hajj, and the hajj is still some\\n\\t\\t\\t\\ttime off, or he may say something similar to that about a\\n\\t\\t\\t\\tslave or a house. When he does that, he only pays the\\n\\t\\t\\t\\tmoney in advance on the understanding that if he finds\\n\\t\\t\\t\\tthe camel to be sound at the time the hire is due to\\n\\t\\t\\t\\tbegin, he will take it by virtue of what he has already\\n\\t\\t\\t\\tpaid. If an accident, or death, or something happens to\\n\\t\\t\\t\\tthe camel, then he will get his money back and the money\\n\\t\\t\\t\\the paid in advance will be considered as a loan.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is distinct from someone who takes\\n\\t\\t\\t\\timmediate possession of what he rents or hires, so that\\n\\t\\t\\t\\tit does not fall into the category of 'uncertainty,' or\\n\\t\\t\\t\\tdisapproved payment in advance. That is following a\\n\\t\\t\\t\\tcommon practice. An example of that is that a man buys a\\n\\t\\t\\t\\tslave, or slave-girl, and takes possession of them and\\n\\t\\t\\t\\tpays their price. If something happens to them within the\\n\\t\\t\\t\\tperiod of the year indemnification contract, he takes his\\n\\t\\t\\t\\tgold back from the one from whom he bought it. There is\\n\\t\\t\\t\\tno harm in that. This is the precedent of the sunna in\\n\\t\\t\\t\\tthe matter of selling slaves.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Someone who rents a specified slave, or\\n\\t\\t\\t\\thires a specified camel, for a future date, at which time\\n\\t\\t\\t\\the will take possession of the camel or slave, has not\\n\\t\\t\\t\\tacted properly because he did not take possession of what\\n\\t\\t\\t\\the rented or hired, nor is he advancing a loan which the\\n\\t\\t\\t\\tperson is responsible to pay back.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "27",
    "sectionHeading": "Selling Fruit",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us is that some one who buys some fruit, fresh or\\n\\t\\t\\t\\tdry, should not resell it until he gets full possession\\n\\t\\t\\t\\tof it. He should not barter things of the same type,\\n\\t\\t\\t\\texcept hand to hand. Whatever can be made into dry fruit\\n\\t\\t\\t\\tto be stored and eaten, should not be bartered for its\\n\\t\\t\\t\\town kind, except hand to hand, like for like, when it is\\n\\t\\t\\t\\tthe same kind of fruit. In the case of two different\\n\\t\\t\\t\\tkinds of fruit, there is no harm in bartering two of one\\n\\t\\t\\t\\tkind for one of another, hand to hand on the spot. It is\\n\\t\\t\\t\\tnot good to set delayed terms. As for produce which is\\n\\t\\t\\t\\tnot dried and stored but is eaten fresh like water melon,\\n\\t\\t\\t\\tcucumber, melon, carrots, citron, medlars, pomegranates,\\n\\t\\t\\t\\tand soon, which when dried no longer counts as fruit, and\\n\\t\\t\\t\\tis not a thing which is stored up as is fruit, I think\\n\\t\\t\\t\\tthat it is quite proper to barter such things two for one\\n\\t\\t\\t\\tof the same variety hand to hand. If no term enters into\\n\\t\\t\\t\\tit, there is no harm in it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "28",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"The Messenger of Allah, mayAllah bless him and grant him\\n\\t\\t\\t\\tpeace, ordered the two Sads to sell a vessel made of\\n\\t\\t\\t\\teither gold or silver from the booty. They either sold\\n\\t\\t\\t\\teach three units of weight for four units of weight of\\n\\t\\t\\t\\tcoins or each four units of weight for three units of\\n\\t\\t\\t\\tweight or coins. The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said to them, 'You have taken\\n\\t\\t\\t\\tusury, so return it.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "29",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Musa ibn Abi Tamim\\n\\t\\t\\t\\tfrom Abu'l Hubab Said ibn Yasar from Abu Hurayra that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"A dinar for a dinar, a dirham for a dirham,\\n\\t\\t\\t\\tno excess between the two.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "30",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abu Said\\n\\t\\t\\t\\tal-Khudri that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Do not sell gold for gold\\n\\t\\t\\t\\texcept like for like and do not increase one part over\\n\\t\\t\\t\\tanother part. Do not sell silver for silver, except like\\n\\t\\t\\t\\tfor like and do not increase one part over another part.\\n\\t\\t\\t\\tDo not sell some of it which is not there for some of it\\n\\t\\t\\t\\twhich is.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "31",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Humayd ibn Qays\\n\\t\\t\\t\\tal-Makki that Mujahid said, \"I was with Abdullah ibn Umar\\n\\t\\t\\t\\tand an artisan came to him and said, 'Abu Abd ar-Rahman -\\n\\t\\t\\t\\tI fashion gold and then sell what I have made for more\\n\\t\\t\\t\\tthan its weight. I take an amount equivalent to the work\\n\\t\\t\\t\\tof my hand.' Abdullah forbade him to do that, so the\\n\\t\\t\\t\\tartisan repeated the question to him, and Abdullah\\n\\t\\t\\t\\tcontinued to forbid him until he came to the door of the\\n\\t\\t\\t\\tmosque or to an animal that he intended to mount. Then\\n\\t\\t\\t\\tAbdullah ibn Umar said, 'A dinar for a dinar, and a\\n\\t\\t\\t\\tdirham for a dirham. There is no increase between them.\\n\\t\\t\\t\\tThis is the command of ourProphet to us and our advice to\\n\\t\\t\\t\\tyou.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "32",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard from his\\n\\t\\t\\t\\tgrandfather, Malik ibn Abi Amir that Uthman ibn Affan\\n\\t\\t\\t\\tsaid, \"The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said to me, 'Do not sell a dinar for two\\n\\t\\t\\t\\tdinars nor a dirham for two dirhams.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "33",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that Muawiya ibn Abi Sufyan sold a gold or\\n\\t\\t\\t\\tsilver drinking-vessel for more than its weight.\\n\\t\\t\\t\\tAbu'dDarda said, \"I heard the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbidding such\\n\\t\\t\\t\\tsales except like for like.\" Muawiya said to him, \"I\\n\\t\\t\\t\\tdon't see any harm in it.\" Abu'd-Darda said to him, \"Who\\n\\t\\t\\t\\twill excuse me from Muawiya? I tell him something from\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and he gives me his own opinion! I will not live\\n\\t\\t\\t\\tin the same land as you!\" Then Abu'd-Darda went to Umar\\n\\t\\t\\t\\tibn al-Khattab and mentioned that to him. Umar ibn\\n\\t\\t\\t\\tal-Khattab therefore wrote to Muawiya, \"Do not sell it\\n\\t\\t\\t\\texcept like for like, weight for weight.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "34",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that Umar ibn al-Khattab said, \"Do not sell gold\\n\\t\\t\\t\\tfor gold except like for like, and do not increase one\\n\\t\\t\\t\\tpart over another part. Do not sell silver for silver\\n\\t\\t\\t\\texcept like for like, and do not increase one part over\\n\\t\\t\\t\\tanother part. Do not sell silver for gold, one of them at\\n\\t\\t\\t\\thand and the other to be given later. If someone seeks to\\n\\t\\t\\t\\tdelay paying you until he has been to his house, do not\\n\\t\\t\\t\\tleave him. I fear rama for you.\" Rama is usury.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "35",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that Umar ibn al-Khattab said, \"Do\\n\\t\\t\\t\\tnot sell gold for gold except like for like. Do not\\n\\t\\t\\t\\tincrease part of it over another part. Do not sell silver\\n\\t\\t\\t\\tfor silver except like for like, and do not increase part\\n\\t\\t\\t\\tof it over another part. Do not sell some of it which is\\n\\t\\t\\t\\tthere for some of it which is not. If someone asks you to\\n\\t\\t\\t\\twait for payment until he has been to his house, do not\\n\\t\\t\\t\\tleave him. I fear rama for you.\" Rama is usury.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "36",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tal-Oasim ibn Muhammad said, ''Umar ibn al-Khattab said,\\n\\t\\t\\t\\t'A dinar for a dinar, and a dirham for adirham, and a sa\\n\\t\\t\\t\\tfor a sa. Something to be collected later is not to be\\n\\t\\t\\t\\tsold for something at hand. ' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "37",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu'z-Zinad heard\\n\\t\\t\\t\\tSaid ibn al-Musayyab say, \"There is usury only in gold or\\n\\t\\t\\t\\tsilver or what is weighed or measured of what is eaten or\\n\\t\\t\\t\\tdrunk.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "37",
    "sectionHeading": "Selling Gold for Silver, Minted and Unminted",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said heard\\n\\t\\t\\t\\tSaid ibn al-Musayyab say, \"Keeping gold and silver out of\\n\\t\\t\\t\\tcirculation is part of working corruption in the land.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in buying gold with silver\\n\\t\\t\\t\\tor silver with gold without measuring if it is unminted\\n\\t\\t\\t\\tor a piece of jewellery which has been made. Counted\\n\\t\\t\\t\\tdirhams and counted dinars should not be bought without\\n\\t\\t\\t\\treckoning until they are known and counted. To abandon\\n\\t\\t\\t\\tnumber and buy them at random would only be to speculate.\\n\\t\\t\\t\\tThat is not part of the business transactions of Muslims.\\n\\t\\t\\t\\tAs for what is weighed of unminted objects and jewellery,\\n\\t\\t\\t\\tthere is no harm in buying such things without measuring.\\n\\t\\t\\t\\tTo buy them without measuring is like buying wheat, dried\\n\\t\\t\\t\\tdates, and such food-stuffs, which are sold without\\n\\t\\t\\t\\tmeasuring, even though things like them are measured \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about buying a Qur'an, a sword or a signet\\n\\t\\t\\t\\tring which had some gold or silver work on it with dinars\\n\\t\\t\\t\\tor dirhams. He said, \"The value of the object bought with\\n\\t\\t\\t\\tdinars, which has gold in it is looked at. If the value\\n\\t\\t\\t\\tof the gold is up to one-third of the price, it is\\n\\t\\t\\t\\tpermitted and there is no harm in it if the sale is hand\\n\\t\\t\\t\\tto hand and there is no deferment in it. When something\\n\\t\\t\\t\\tis bought with silver which has silver in it, the value\\n\\t\\t\\t\\tis looked at. If the value of the silver is one-third, it\\n\\t\\t\\t\\tis permitted and there is no harm in it if the sale is\\n\\t\\t\\t\\thand to hand. That is still the way of doing things among\\n\\t\\t\\t\\tus.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "38",
    "sectionHeading": "Money-Changing",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Malik\\n\\t\\t\\t\\tibn Aus ibn al-Hadathan an-Nasri that one time he asked\\n\\t\\t\\t\\tto exchange 100 dinars. He said, \"Talha ibn Ubaydullah\\n\\t\\t\\t\\tcalled me over and we made a mutual agreement that he\\n\\t\\t\\t\\twould make an exchange for me. He took the gold and\\n\\t\\t\\t\\tturned it about in his hand, and then said, 'I can't do\\n\\t\\t\\t\\tit until my treasurer brings the money to me from\\n\\t\\t\\t\\tal-Ghaba.' Umar ibn al-Khattab was listening and Umar\\n\\t\\t\\t\\tsaid, 'By Allah! Do not leave him until you have taken it\\n\\t\\t\\t\\tfrom him!' Then he said, 'The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Gold for\\n\\t\\t\\t\\tsilver is usury except hand to hand. Wheat for wheat is\\n\\t\\t\\t\\tusury except hand to hand. Dates for dates is usury\\n\\t\\t\\t\\texcept hand to hand. Barley for barley is usury except\\n\\t\\t\\t\\thand to hand.\" \"'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When a man buys dirhams with dinars and then\\n\\t\\t\\t\\tfinds a bad dirham among them and wants to return it, the\\n\\t\\t\\t\\texchange of the dinars breaks down, and he returns the\\n\\t\\t\\t\\tsilver and takes back his dinars. The explanation of what\\n\\t\\t\\t\\tis disapproved of in that is that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said, 'Gold for\\n\\t\\t\\t\\tsilver is usury except hand to hand.' and Umar ibn\\n\\t\\t\\t\\tal-Khattab said, 'If someone asks you to wait to be paid\\n\\t\\t\\t\\tuntil he has gone back to his house, do not leave him.'\\n\\t\\t\\t\\tWhen he returns a dirham to him from the exchange after\\n\\t\\t\\t\\the has left him, it is like a debt or something deferred.\\n\\t\\t\\t\\tFor that reason, it is disapproved of, and the exchange\\n\\t\\t\\t\\tcollapses. Umar ibn al-Khattab wanted that all gold,\\n\\t\\t\\t\\tsilver and food should not be sold for goods to be paid\\n\\t\\t\\t\\tlater. He did not want there to be any delay or deferment\\n\\t\\t\\t\\tin any such sale, whether it involved one commodity or\\n\\t\\t\\t\\tdifferent sorts of commodities.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "39",
    "sectionHeading": "Selling Gold for Gold and Silver for Silver by Weight",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yazid ibn Abdullah\\n\\t\\t\\t\\tibn Qusayt saw Said ibn al-Musayyab sell gold\\n\\t\\t\\t\\tcounterpoising for gold. He poured his gold into one pan\\n\\t\\t\\t\\tof the scales, and the man with whom he was\\n\\t\\t\\t\\tcounterpoising put his gold in the other pan of the scale\\n\\t\\t\\t\\tand when the tongue of the scales was balanced, they took\\n\\t\\t\\t\\tand gave.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"According to the way things are done among\\n\\t\\t\\t\\tus there is no harm in selling gold for gold, and silver\\n\\t\\t\\t\\tfor silver by counterpoising weight, even if 11 dinars\\n\\t\\t\\t\\tare taken for 10 dinars hand to hand, when the weight of\\n\\t\\t\\t\\tgold is equal, coin for coin, even if the number is\\n\\t\\t\\t\\tdifferent. Dirhams in such a situation are treated the\\n\\t\\t\\t\\tsame way as dinars.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If, when counterpoising gold for gold or\\n\\t\\t\\t\\tsilver for silver, there is a difference of weight, one\\n\\t\\t\\t\\tparty should not give the other the value of the\\n\\t\\t\\t\\tdifference in silver or something else. Such a\\n\\t\\t\\t\\ttransaction is ugly and a means to usury because if one\\n\\t\\t\\t\\tof the parties were permitted to take the difference for\\n\\t\\t\\t\\ta separate price, it could be as if he had bought it\\n\\t\\t\\t\\tseparately, so he would be permitted. Then it would be\\n\\t\\t\\t\\tpossible for him to ask for  many times the value of the\\n\\t\\t\\t\\tdifference in order to permit the completion of the\\n\\t\\t\\t\\ttransaction between the two parties.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If he had really been sold the difference\\n\\t\\t\\t\\twithout anything else with it, he would not have taken it\\n\\t\\t\\t\\tfor a tenth of the price for which he took it in order to\\n\\t\\t\\t\\tput a 'legal front' on the transaction. This leads to\\n\\t\\t\\t\\tallowing what is forbidden . The matter is forbidden.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that it was not good when counterpoising to\\n\\t\\t\\t\\tgive good old gold coins and put along with them unminted\\n\\t\\t\\t\\tgold in exchange for worn kufic gold, which was unpopular\\n\\t\\t\\t\\tand to then treat the exchange as like for like.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The commentary on why that is disapproved is\\n\\t\\t\\t\\tthat the owner of the good gold uses the excellence of\\n\\t\\t\\t\\this old gold coins as an excuse to throw in the unminted\\n\\t\\t\\t\\tgold with it. Had it not been for the superiority of his\\n\\t\\t\\t\\t(good) gold over the gold of the other party, the other\\n\\t\\t\\t\\tparty would not have counterpoised the unminted gold for\\n\\t\\t\\t\\this kufic gold, and the deal would have been refused.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"It is like a man wanting to buy three sa of ajwa dried\\n\\t\\t\\t\\tdates for two sa and a mudd of kabis dates, and on being\\n\\t\\t\\t\\ttold that it was not good, then offering two sa of kabis\\n\\t\\t\\t\\tand a sa of poor dates desiring to make the sale\\n\\t\\t\\t\\tpossible. That is not good because the owner of the ajwa\\n\\t\\t\\t\\tshould not give him a sa of ajwa for a sa of poor dates.\\n\\t\\t\\t\\tHe would only give him that because of the excellence of\\n\\t\\t\\t\\tkabis dates.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"Or it is like a man asking some one to sell him three sa\\n\\t\\t\\t\\tof white wheat for two and a half sa of Syrian wheat, and\\n\\t\\t\\t\\tbeing told that it was not good except like for like, and\\n\\t\\t\\t\\tso offering two sa of wheat and one sa of barley\\n\\t\\t\\t\\tintending to make the sale possible between them. That is\\n\\t\\t\\t\\tnot good because no one would have given a sa of barley\\n\\t\\t\\t\\tfor a sa of white wheat had that sa been by itself. It\\n\\t\\t\\t\\twas only given because of the excellence of Syrian wheat\\n\\t\\t\\t\\tover the white wheat. This is not good. It is the same as\\n\\t\\t\\t\\tthe case of the unminted gold.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Where gold, silver and food, things which\\n\\t\\t\\t\\tshould only be sold like for like, are concerned,\\n\\t\\t\\t\\tsomething disliked and of poor quality should not be put\\n\\t\\t\\t\\twith something good and desirable in order to make the\\n\\t\\t\\t\\tsale possible and to make a bad situation halal. When\\n\\t\\t\\t\\tsomething of desirable quality is put with something of\\n\\t\\t\\t\\tpoor quality and it is only included so that its\\n\\t\\t\\t\\texcellence in quality is noticed, something is being sold\\n\\t\\t\\t\\twhich if it had been sold on its own, would not have been\\n\\t\\t\\t\\taccepted and to which the buyer would not have paid any\\n\\t\\t\\t\\tattention. It is only accepted by the buyer because of\\n\\t\\t\\t\\tthe superiority of what comes with it over his own goods.\\n\\t\\t\\t\\tTransactions involving gold, silver, or food, must not\\n\\t\\t\\t\\thave anything of this description enter into them. If the\\n\\t\\t\\t\\towner of the poor quality goods wants to sell them, he\\n\\t\\t\\t\\tsells them on their own, and does not put anything with\\n\\t\\t\\t\\tthem. There is no harm if it is like that.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "40",
    "sectionHeading": "Buying on Delayed Terms and Re-Selling for Less on More Immediate Terms",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Someone who buys food, must\\n\\t\\t\\t\\tnot resell it until he takes delivery of it all.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "41",
    "sectionHeading": "Buying on Delayed Terms and Re-Selling for Less on More Immediate Terms",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Someone who\\n\\t\\t\\t\\tbuys food, must not sell it until he takes possession of\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "42",
    "sectionHeading": "Buying on Delayed Terms and Re-Selling for Less on More Immediate Terms",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"In the time of the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, we used to buy\\n\\t\\t\\t\\tfood. He sent orders for us to move our purchases from\\n\\t\\t\\t\\tthe place in which we purchased them to another place\\n\\t\\t\\t\\tbefore we re-sold them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "43",
    "sectionHeading": "Buying on Delayed Terms and Re-Selling for Less on More Immediate Terms",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Hakim ibn\\n\\t\\t\\t\\tHizam traded in food for people as Umar ibn al-Khattab\\n\\t\\t\\t\\thad ordered him to do. Hakim re-sold the food before he\\n\\t\\t\\t\\thad taken delivery of it. That reached Umar ibn\\n\\t\\t\\t\\tal-Khattab and he revoked the sale and said, \"Do not sell\\n\\t\\t\\t\\tfood which you have purchased until you take delivery of\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "44",
    "sectionHeading": "Buying on Delayed Terms and Re-Selling for Less on More Immediate Terms",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\treceipts were given to people in the time of Marwan ibn\\n\\t\\t\\t\\tal-Hakam for the produce of the market at al-Jar. People\\n\\t\\t\\t\\tbought and sold the receipts among themselves before they\\n\\t\\t\\t\\ttook delivery of the goods. Zayd Thabit and one of the\\n\\t\\t\\t\\tCompanions of the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, went to Marwan ibn al-Hakam and\\n\\t\\t\\t\\tsaid, \"Marwan! Do you make usury halal?\" He said, \"I seek\\n\\t\\t\\t\\trefuge with Allah! What is that?\" He said, \"These\\n\\t\\t\\t\\treceipts which people buy and sell before they take\\n\\t\\t\\t\\tdelivery of the goods.\" Marwan therefore sent a guard to\\n\\t\\t\\t\\tfollow them and to take them from people's hands and\\n\\t\\t\\t\\treturn them to their owners.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "45",
    "sectionHeading": "Buying on Delayed Terms and Re-Selling for Less on More Immediate Terms",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that a\\n\\t\\t\\t\\tman wanted to buy food from a man in advance. The man who\\n\\t\\t\\t\\twanted to sell the food to him went with him to the\\n\\t\\t\\t\\tmarket, and he began to show him heaps, saying, \"Which\\n\\t\\t\\t\\tone would you like me to buy for you.\" The buyer said to\\n\\t\\t\\t\\thim, \"Are you selling me what you do not have?\" So they\\n\\t\\t\\t\\tcame to Abdullah ibn Umarand mentioned that to him.\\n\\t\\t\\t\\tAbdallah ibn Umar said to the buyer, \"Do not buy from him\\n\\t\\t\\t\\twhat he does not have.\" He said to the seller, \"Do not\\n\\t\\t\\t\\tsell what you do not have.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "46",
    "sectionHeading": "Buying on Delayed Terms and Re-Selling for Less on More Immediate Terms",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said heard\\n\\t\\t\\t\\tJamil ibn Abd ar-Rahman the Muadhdhin say to Said ibn\\n\\t\\t\\t\\tal-Musayyab, \"I am a man who buys whatever Allah wills of\\n\\t\\t\\t\\tthe receipts for the provisions which people are offered\\n\\t\\t\\t\\tat al-Jar. I want to take payment for goods that I\\n\\t\\t\\t\\tguarantee to deliver at a future date.\" Said said to him,\\n\\t\\t\\t\\t\"Do you intend to settle these things with receipts for\\n\\t\\t\\t\\tprovisions you have bought?\" He said, \"Yes.\" So he\\n\\t\\t\\t\\tforbade that.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us in which there is no dispute, about buying food\\n\\t\\t\\t\\t- wheat, barley, durra-sorghum, pearl millet, or any\\n\\t\\t\\t\\tpulse or anything resembling pulses on which zakat is\\n\\t\\t\\t\\tobliged, or condiments of any sort - oil, ghee, honey,\\n\\t\\t\\t\\tvinegar, cheese, sesame oil, milk and so on, is that the\\n\\t\\t\\t\\tbuyer should not re-sell any of that until he has taken\\n\\t\\t\\t\\tpossession and complete delivery of it.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "47",
    "sectionHeading": "What is Disapproved in Selling Food with Delayed Payment or Delivery",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abu'z-Zinad heard\\n\\t\\t\\t\\tSa'id ibn al-Musayyab andSulayman ibn Yasar forbid a man\\n\\t\\t\\t\\tto sell wheat for gold on delayed terms and then to buy\\n\\t\\t\\t\\tdried dates with the gold before he had taken delivery of\\n\\t\\t\\t\\tthe gold.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "48",
    "sectionHeading": "What is Disapproved in Selling Food with Delayed Payment or Delivery",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Kathir ibn Farqad\\n\\t\\t\\t\\tasked Abu Bakr ibn Muhammad ibn Amr ibn Hazm about a man\\n\\t\\t\\t\\twho sold food to be delivered at a future date to a man\\n\\t\\t\\t\\tfor gold and then with the gold, he bought dates before\\n\\t\\t\\t\\the had taken delivery of the gold. He disapproved of that\\n\\t\\t\\t\\tand forbade it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab the like\\n\\t\\t\\t\\tof that.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, ''Said ibn al-Musayyab, Sulayman ibn Yasar,\\n\\t\\t\\t\\tAbu Bakr ibn Muhammad ibn Amr ibn Hazm, and Ibn Shihab\\n\\t\\t\\t\\tforbade that a man sell wheat for gold and then buy dates\\n\\t\\t\\t\\twith that gold before he had received the gold from the\\n\\t\\t\\t\\ttransaction in which he sold the wheat. There is no harm\\n\\t\\t\\t\\tfor someone to buy dates on delayed terms, on the\\n\\t\\t\\t\\tstrength of the gold for which he sold the wheat, from\\n\\t\\t\\t\\tsomeone other than the person to whom he sold the wheat\\n\\t\\t\\t\\tbefore taking possession of the gold, and to refer the\\n\\t\\t\\t\\tone from whom he bought the dates to his debtor who\\n\\t\\t\\t\\tbought the wheat, for the gold he is owed for the dates.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I asked more than one of the people of\\n\\t\\t\\t\\tknowledge about that and they did not see any harm in\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "49",
    "sectionHeading": "Pre-payment on Food",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said that there was no harm in a man making an\\n\\t\\t\\t\\tadvance to another man for food, with a set description\\n\\t\\t\\t\\tand price until a set date, as long as it was not in\\n\\t\\t\\t\\tcrops, or dates which had not begun to ripen.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things among us concerning\\n\\t\\t\\t\\tsomeone who makes an advance for foodstuffs at a known\\n\\t\\t\\t\\trate until a stated date, and the date arrives and he\\n\\t\\t\\t\\tfinds that there is not enough of what he was sold with\\n\\t\\t\\t\\tthe seller to fulfill his order, and so he revokes the\\n\\t\\t\\t\\tsale, is that he must only take back the silver, gold, or\\n\\t\\t\\t\\tprice which he paid exactly. He does not buy anything\\n\\t\\t\\t\\telse from the man for the same price until he has got\\n\\t\\t\\t\\tback what he paid. That is because if he took something\\n\\t\\t\\t\\telse besides the price which he paid him or exchanged it\\n\\t\\t\\t\\tfor goods other than the goods which he bought from him,\\n\\t\\t\\t\\tit would be selling food before getting delivery of it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade selling food before getting\\n\\t\\t\\t\\tdelivery of it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that it was not good if the buyer regretted\\n\\t\\t\\t\\this purchase and asked the seller to revoke the sale for\\n\\t\\t\\t\\thim and he would not press him immediately for what he\\n\\t\\t\\t\\thad paid. The people of knowledge forbade that. That was\\n\\t\\t\\t\\tbecause when the food was made ready for the buyer by the\\n\\t\\t\\t\\tseller, the buyer deferred his due from the seller in\\n\\t\\t\\t\\torder that he might revoke the sale for him. That was the\\n\\t\\t\\t\\tsale of food with delayed terms before taking delivery of\\n\\t\\t\\t\\tthe food.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of that is that when the\\n\\t\\t\\t\\tdate of delivery comes and the buyer dislikes the food,\\n\\t\\t\\t\\tthe seller takes by it money to be paid later and so it\\n\\t\\t\\t\\tis not revocation. Revocation is that in which neither\\n\\t\\t\\t\\tthe buyer nor the seller is increased. When increase\\n\\t\\t\\t\\toccurs by deferment of payment for a time period, or by\\n\\t\\t\\t\\tanything which increases one of them over the other or\\n\\t\\t\\t\\tanything which gives one of them profit, it is not\\n\\t\\t\\t\\trevocation. When either of them do that, revocation\\n\\t\\t\\t\\tbecomes a sale. There is an indulgence for revocation,\\n\\t\\t\\t\\tpartnership, and transfer, as long as i ncrease,\\n\\t\\t\\t\\tdecrease, or deferment does not come into them. If\\n\\t\\t\\t\\tincrease, decrease, or deferment comes into it, it\\n\\t\\t\\t\\tbecomes a sale. Whatever makes a sale halal makes it\\n\\t\\t\\t\\thalal and whatever makes a sale haram makes it haram.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone pays in advance for Syrian wheat,\\n\\t\\t\\t\\tthere is no harm if he takes a load after the term falls\\n\\t\\t\\t\\tdue.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is the same with whoever advances for any\\n\\t\\t\\t\\tkind of thing. There is no harm in him taking better than\\n\\t\\t\\t\\twhatever he has made an advance for or worse than it\\n\\t\\t\\t\\tafter the agreed delivery date. The explanation of that\\n\\t\\t\\t\\tis that if, for instance, a man advances for a certain\\n\\t\\t\\t\\tweight of wheat. There is no harm if he decides to take\\n\\t\\t\\t\\tsome barley or Syrian wheat. If he has made an advance\\n\\t\\t\\t\\tfor good dates, there is no harm if he decides to take\\n\\t\\t\\t\\tpoor quality dates. If he paid in advance for red\\n\\t\\t\\t\\traisins, there is no harm if he takes black ones, when it\\n\\t\\t\\t\\thappens after the agreed delivery date, and when the\\n\\t\\t\\t\\tmeasure of what he takes is like the measure of what he\\n\\t\\t\\t\\tpaid for in advance.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "50",
    "sectionHeading": "Bartering Food for Food with No Increase between Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSulayman ibn Yasar said, \"The fodder of the donkeys of\\n\\t\\t\\t\\tSaad ibn Abi Waqqas ran out and so he told his slave to\\n\\t\\t\\t\\ttake some of the family's wheat and buy barley with it,\\n\\t\\t\\t\\tand to only take a like quantity.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "51",
    "sectionHeading": "Bartering Food for Food with No Increase between Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Sulayman\\n\\t\\t\\t\\tibn Yasar told him that one time the fodder of the\\n\\t\\t\\t\\tanimals of Abd ar-Rahman ibn al-Aswad ibn Abd Yaghuth was\\n\\t\\t\\t\\tfinished so he said  to his slave, \"Take some of your\\n\\t\\t\\t\\tfamily's wheat as food and buy with it barley, and take\\n\\t\\t\\t\\tonly a like quantity.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "52",
    "sectionHeading": "Bartering Food for Food with No Increase between Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard the same\\n\\t\\t\\t\\tas that from al-Qasim ibn Muhammad from Ibn Muayqib\\n\\t\\t\\t\\tad-Dawsi.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the way of doing things among us . \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us is that wheat is not sold for wheat, dates for\\n\\t\\t\\t\\tdates, wheat for dates, dates for raisins, wheat for\\n\\t\\t\\t\\traisins, nor any kind of food sold for food at all,\\n\\t\\t\\t\\texcept from hand to hand. If there is any sort of delayed\\n\\t\\t\\t\\tterms in the transaction, it is not good. It is haram.\\n\\t\\t\\t\\tCondiments are not bartered except from hand to hand.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Food and condiments are not bartered when\\n\\t\\t\\t\\tthey are the same type, two of one kind for one of the\\n\\t\\t\\t\\tother. A mudd of wheat is not sold for two mudds of\\n\\t\\t\\t\\twheat, nor a mudd of dates for two mudds of dates, nor a\\n\\t\\t\\t\\tmudd of raisins for two mudds of raisins, nor is anything\\n\\t\\t\\t\\tof that sort done with grains and condiments when they\\n\\t\\t\\t\\tare of one kind, even if it is hand to hand.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"This is the same position as silver for silver and gold\\n\\t\\t\\t\\tfor gold. No increase is halal in the transaction, and\\n\\t\\t\\t\\tonly like for like, from hand to hand is halal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If there is a clear difference in foodstuffs\\n\\t\\t\\t\\twhich are measured and weighed, there is no harm in\\n\\t\\t\\t\\ttaking two of one kind for one of another, hand to hand.\\n\\t\\t\\t\\tThere is no harm in taking a sa of dates for two sa of\\n\\t\\t\\t\\twheat, and a sa of dates for two sa of raisins, and a sa\\n\\t\\t\\t\\tof wheat for two sa of ghee. If the two sorts in the\\n\\t\\t\\t\\ttransaction are different, there is no harm in two for\\n\\t\\t\\t\\tone or more than that from hand to hand. If delayed terms\\n\\t\\t\\t\\tenter into the sale, it is not halal .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not halal to trade a heap of wheat for\\n\\t\\t\\t\\ta heap of wheat. There is no harm in a heap of wheat for\\n\\t\\t\\t\\ta heap of dates, from hand to hand. That is because there\\n\\t\\t\\t\\tis no harm in buying wheat with dates without precise\\n\\t\\t\\t\\tmeasurement.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"With kinds of foods and condiments that\\n\\t\\t\\t\\tdiffer from each other, and the difference is clear,\\n\\t\\t\\t\\tthere is no harm in bartering one kind for another,\\n\\t\\t\\t\\twithout precise measurement from hand to hand. If delayed\\n\\t\\t\\t\\tterms enter into the sale, there is no good in it.\\n\\t\\t\\t\\tBartering such things without precise measurement is like\\n\\t\\t\\t\\tbuying it with gold and silver without measuring\\n\\t\\t\\t\\tprecisely.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is because you buy wheat with silver\\n\\t\\t\\t\\twithout measuring precisely, and dates with gold without\\n\\t\\t\\t\\tmeasuring precisely, and it is halal. There is no harm in\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not good for someone to make a heap of\\n\\t\\t\\t\\tfood, knowing its measure and then to sell it as if it\\n\\t\\t\\t\\thad not been measured precisely, concealing its measure\\n\\t\\t\\t\\tfrom the buyer. If the buyer wants to return that food to\\n\\t\\t\\t\\tthe seller, he can, because he concealed its measure and\\n\\t\\t\\t\\tso it is an uncertain transaction. This is done with any\\n\\t\\t\\t\\tkind of food or other goods whose measure and number the\\n\\t\\t\\t\\tseller knows, and which he then sells without measurement\\n\\t\\t\\t\\tand the buyer does not know that. If the buyer wants to\\n\\t\\t\\t\\treturn that to the seller, he can return t. The people of\\n\\t\\t\\t\\tknowledge still forbid such a transaction.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no good in selling one round loaf\\n\\t\\t\\t\\tof bread for two round loaves, nor large for small when\\n\\t\\t\\t\\tsome of them are bigger than others. When care is taken\\n\\t\\t\\t\\tthat they are like for like, there is no harm in the\\n\\t\\t\\t\\tsale, even if they are not weighed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not good to sell a mudd of butter and\\n\\t\\t\\t\\ta mudd of milk for two mudds of butter. This is like what\\n\\t\\t\\t\\twe described of selling dates when two sa of kabis and a\\n\\t\\t\\t\\tsa of poor quality dates were sold for three sa of ajwa\\n\\t\\t\\t\\tdates after the buyer had said to the seller, 'Two sa of\\n\\t\\t\\t\\tkabis dates for three sa of ajwa dates is not good,' and\\n\\t\\t\\t\\tthen he did that to make the transaction possible. The\\n\\t\\t\\t\\towner of the milk puts the milk with his butter so that\\n\\t\\t\\t\\the can use the superiority of his butter over the butter\\n\\t\\t\\t\\tof the other party to put his milk in with it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Flour for wheat is like for like, and there\\n\\t\\t\\t\\tis no harm in that. That is if he does not mix up\\n\\t\\t\\t\\tanything with the flour and sell it for wheat, like for\\n\\t\\t\\t\\tlike. Had he put half a mudd of flour and half of wheat,\\n\\t\\t\\t\\tand then sold that for a mudd of wheat, it would be like\\n\\t\\t\\t\\twhat we described, and it would not be good because he\\n\\t\\t\\t\\twould want to use the superiority of his good wheat to\\n\\t\\t\\t\\tput flour along with it. Such a transaction is not good.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "53",
    "sectionHeading": "General Section on Selling Food ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Muhammad ibn Abdullah\\n\\t\\t\\t\\tibn Abi Maryam asked Said ibn al-Musayyab's advice. \"I am\\n\\t\\t\\t\\ta man who buys food with receipts from al-Jar. Perhaps I\\n\\t\\t\\t\\twill buy something for a dinar and half a dirham, and\\n\\t\\t\\t\\twill be given food for a half.\" Said said, \"No. You give\\n\\t\\t\\t\\ta dirham, and take the rest in food.\" (A half dirham did\\n\\t\\t\\t\\tnot exist as a coin.)\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "54",
    "sectionHeading": "General Section on Selling Food ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tMuhammad Sirin used to say, \"Do not sell grain on the\\n\\t\\t\\t\\tears until it is white.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone buys food for a known price to be\\n\\t\\t\\t\\tdelivered at a stated date, and when the date comes, the\\n\\t\\t\\t\\tone who owes the food says, 'I do not have any food, sell\\n\\t\\t\\t\\tme the food which I owe you with delayed terms.' The\\n\\t\\t\\t\\towner of the food says, 'This is not good, because the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade selling food until the deal was\\n\\t\\t\\t\\tcompleted.' The one who owes the food says to his\\n\\t\\t\\t\\tcreditor, 'Sell me any kind of food on delayed terms\\n\\t\\t\\t\\tuntil I discharge the debt to you.' This is not good\\n\\t\\t\\t\\tbecause he gives him food and then he returns it to him.\\n\\t\\t\\t\\tThe gold which he gave him becomes the price of that\\n\\t\\t\\t\\twhich is his right against him and the food which he gave\\n\\t\\t\\t\\thim becomes what clears what is between them. If they do\\n\\t\\t\\t\\tthat, it becomes the sale of food before the deal is\\n\\t\\t\\t\\tcomplete.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who was owed food which he had\\n\\t\\t\\t\\tpurchased from a man and this man was owed the like of\\n\\t\\t\\t\\tthat food by another man. The one who owed the food said\\n\\t\\t\\t\\tto his creditor, \"I will refer you to my debtor who owes\\n\\t\\t\\t\\tme the same amount of food as I owe you, so that you may\\n\\t\\t\\t\\tobtain the food which I owe you .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the man who had to deliver the food, had\\n\\t\\t\\t\\tgone out, and bought the food to pay off his creditor,\\n\\t\\t\\t\\tthat is not good. That is selling food before taking\\n\\t\\t\\t\\tpossession of it. If the food is an advance which falls\\n\\t\\t\\t\\tdue at that particular time, there is no harm in paying\\n\\t\\t\\t\\toff his creditor with it because that is nota sale. It is\\n\\t\\t\\t\\tnot halal to sell food before receiving it in full since\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade that. However, the people of knowledge\\n\\t\\t\\t\\tagree that there is no harm in partnership, transfer of\\n\\t\\t\\t\\tresponsibility and revocation in sales of food and other\\n\\t\\t\\t\\tgoods.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is because the people of knowledge\\n\\t\\t\\t\\tconsider it as a favour rendered. They do not consider it\\n\\t\\t\\t\\tas a sale. It is like a man lending light dirhams. He is\\n\\t\\t\\t\\tthen paid back in dirhams of full weight, and so gets\\n\\t\\t\\t\\tback more than he lent. That is halal for him and\\n\\t\\t\\t\\tpermitted. Had a man bought defective dirhams from him as\\n\\t\\t\\t\\tbeing the full weight, that would not be halal. Had it\\n\\t\\t\\t\\tbeen stipulated to him that he lend full weight in\\n\\t\\t\\t\\tdirhams, and then he gave faulty ones, that would not be\\n\\t\\t\\t\\thalal for him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "55",
    "sectionHeading": "General Section on Selling Food ",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"Another example of that is that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade the sale called muzabana and granted an\\n\\t\\t\\t\\tindulgence in the ariya for computing the equivalent in\\n\\t\\t\\t\\tdates. It was distinguished between them that the\\n\\t\\t\\t\\tmuzabana-sale was based on shrewdness and trade, and the\\n\\t\\t\\t\\tariya sale was based on a favour rendered, and there was\\n\\t\\t\\t\\tno shrewdness in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A man must not buy food for a fourth, a\\n\\t\\t\\t\\tthird, or a fraction of a dirham on the basis that he be\\n\\t\\t\\t\\tgiven that food on credit. There is no harm in a man\\n\\t\\t\\t\\tbuying food for a fraction of a dirham on credit and then\\n\\t\\t\\t\\the gives a dirham and takes goods with what remains of\\n\\t\\t\\t\\this dirham because he gave the fraction he owed as\\n\\t\\t\\t\\tsilver, and took goods to make up the rest of his dirham.\\n\\t\\t\\t\\tThere is no harm in that transaction.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in a man placing a dirham\\n\\t\\t\\t\\twith another man and then taking from him known goods for\\n\\t\\t\\t\\ta fourth, third, or a known fraction. If there was not a\\n\\t\\t\\t\\tknown price on the goods and the man said, 'I will take\\n\\t\\t\\t\\tthem from you for the price of each day,' this is not\\n\\t\\t\\t\\thalal because there is uncertainty. It might be less one\\n\\t\\t\\t\\ttime, and more another time, and they would not part with\\n\\t\\t\\t\\ta known sale.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone sells some food without measuring\\n\\t\\t\\t\\tprecisely and does not exclude any of it from the sale\\n\\t\\t\\t\\tand then it occurs to him to buy some of it, it is not\\n\\t\\t\\t\\tgood for him to buy any of it except what it would be\\n\\t\\t\\t\\tpermitted for him to exclude from it. That is a third or\\n\\t\\t\\t\\tless. If it is more than a third, it becomes muzabana and\\n\\t\\t\\t\\tis disapproved. He must only purchase from what he would\\n\\t\\t\\t\\tbe permitted to exclude, and he is only permitted to\\n\\t\\t\\t\\texclude a third or less than that. This is the way of\\n\\t\\t\\t\\tdoing things in which there is no dispute with us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "56",
    "sectionHeading": "Hoarding and Raising Prices by Stock-Piling.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab said, \"There is no hoarding in our\\n\\t\\t\\t\\tmarket, and men who have excess gold in their hands\\n\\t\\t\\t\\tshould not buy up one of Allah's provisions which he has\\n\\t\\t\\t\\tsent to our courtyard and then hoard it up against us.\\n\\t\\t\\t\\tSomeone who brings imported goods through great fatigue\\n\\t\\t\\t\\tto himself in the summer and winter, that person is the\\n\\t\\t\\t\\tguest of Umar. Let him sell what Allah wills and keep\\n\\t\\t\\t\\twhat Allah wills.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "57",
    "sectionHeading": "Hoarding and Raising Prices by Stock-Piling.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yunus ibn Yusuf from\\n\\t\\t\\t\\tSaid ibn al-Musayyab that Umar ibn al-Khattab passed by\\n\\t\\t\\t\\tHatab ibn Abi Baltaa who was underselling some of his\\n\\t\\t\\t\\traisins in the market. Umar ibn al-Khattab said to him,\\n\\t\\t\\t\\t\"Either increase the price or leave our market.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "58",
    "sectionHeading": "Hoarding and Raising Prices by Stock-Piling.",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUthman ibn Affan forbade hoarding .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "59",
    "sectionHeading": "What is Permitted in Selling Some Animals for Others and Making an Advance for Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Salih ibn Kaysan from\\n\\t\\t\\t\\tHasan ibn Muhammad ibn Ali ibn Abi Talib that Ali ibn Abi\\n\\t\\t\\t\\tTalib sold one of his camels called Usayfir for 20 camels\\n\\t\\t\\t\\tto be delivered later.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "60",
    "sectionHeading": "What is Permitted in Selling Some Animals for Others and Making an Advance for Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar bought a female riding-camel for four camels and\\n\\t\\t\\t\\the guaranteed to give them in full to the buyer at\\n\\t\\t\\t\\tar-Rabadha.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "61",
    "sectionHeading": "What is Permitted in Selling Some Animals for Others and Making an Advance for Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik asked Ibn Shihab about\\n\\t\\t\\t\\tselling animals, two for one with delayed terms. He said,\\n\\t\\t\\t\\t\"There is no harm in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us is that there is no harm in bartering a camel\\n\\t\\t\\t\\tfor a camel like it and adding some dirhams to the\\n\\t\\t\\t\\texchange, from hand to hand. There is no harm in\\n\\t\\t\\t\\tbartering a camel for a camel like it with some dirhams\\n\\t\\t\\t\\ton top of the exchange, the camels to be exchanged from\\n\\t\\t\\t\\thand to hand, and the dirhams to be paid within a\\n\\t\\t\\t\\tperiod.\" He said, \"There is no good however in bartering\\n\\t\\t\\t\\ta camel for a camel like it with some dirhams on top of\\n\\t\\t\\t\\tit, with the dirhams paid in cash and the camel to be\\n\\t\\t\\t\\tdelivered later. If both the camel and the dirhams are\\n\\t\\t\\t\\tdeferred there is no good in that either.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in buying a riding camel\\n\\t\\t\\t\\twith two or more pack-camels, if they are from inferior\\n\\t\\t\\t\\tstock. There is no harm in bartering two of them for one\\n\\t\\t\\t\\twith delayed terms, if they are different and their\\n\\t\\t\\t\\tdifference is clear. If they resemble each other whether\\n\\t\\t\\t\\ttheir species are different or not, two are not to be\\n\\t\\t\\t\\ttaken for one with delayed terms.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of what is disapproved of in\\n\\t\\t\\t\\tthat, is that a camel should not be bought with two\\n\\t\\t\\t\\tcamels when there is no distinction between them in speed\\n\\t\\t\\t\\tor hardiness. If this is according to what I have\\n\\t\\t\\t\\tdescribed to you, then one does not buy two of them for\\n\\t\\t\\t\\tone with delayed terms. There is no harm in selling those\\n\\t\\t\\t\\tof them you buy before you complete the deal to somebody\\n\\t\\t\\t\\tother than the one from whom you bought them if you get\\n\\t\\t\\t\\tthe price in cash.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is permitted for someone to advance\\n\\t\\t\\t\\tsomething on animals for a fixed term and describe the\\n\\t\\t\\t\\tamount and pay its price in cash. Whatever the buyer and\\n\\t\\t\\t\\tseller have described is obliged for them. That is still\\n\\t\\t\\t\\tpermitted behaviour between people and what the people of\\n\\t\\t\\t\\tknowledge in our land do.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "62",
    "sectionHeading": "What Is Not Permitted in the Sale of Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malih from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade the transaction called habal\\n\\t\\t\\t\\talhabala. It was a transaction which the people of\\n\\t\\t\\t\\tJahiliya practised. A man would buy the unborn offspring\\n\\t\\t\\t\\tof the unborn offspring of a she-camel.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "63",
    "sectionHeading": "What Is Not Permitted in the Sale of Animals",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tibn al-Musayyab said, \"There is no usury in animals.\\n\\t\\t\\t\\tThere are three things forbidden in animals: al-madamin,\\n\\t\\t\\t\\tal-malaqih and habal al-habala. Al-madamin is the sale of\\n\\t\\t\\t\\twhat is in the wombs of female camels. Al-malaqih is the\\n\\t\\t\\t\\tsale of the breeding qualities of camels\" (i.e. for\\n\\t\\t\\t\\tstud).\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"No one should buy a specified animal when it\\n\\t\\t\\t\\tis concealed from him or in another place, even if he has\\n\\t\\t\\t\\talready seen it, very recently or not so recently, and\\n\\t\\t\\t\\twas pleased enough with it to pay its price in cash.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is disapproved of because the seller\\n\\t\\t\\t\\tmakes use of the price and it is not known whether or not\\n\\t\\t\\t\\tthose goods are found to be as the buyer saw them or not.\\n\\t\\t\\t\\tFor that reason, it is disapproved of. There is no harm\\n\\t\\t\\t\\tin it if it is described and guaranteed.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "64",
    "sectionHeading": "Selling Animals in Exchange for Meat",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tSaid ibn al-Musayyab that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbade bartering\\n\\t\\t\\t\\tlive animals for meat.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "65",
    "sectionHeading": "Selling Animals in Exchange for Meat",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Da'ud ibn al-Husayn\\n\\t\\t\\t\\tthat he heard Said ibn alMusayyab say, \"Part of the\\n\\t\\t\\t\\tgambling of the people of Jahiliya was bartering live\\n\\t\\t\\t\\tanimals for slaughtered meat, for instance one live sheep\\n\\t\\t\\t\\tfor two slaughtered sheep.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "66",
    "sectionHeading": "Selling Animals in Exchange for Meat",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad that Said\\n\\t\\t\\t\\tibn al-Musayyab said, \"Bartering live animals for dead\\n\\t\\t\\t\\tmeat is forbidden.\" Abu'z-Zinad said, \"I said to Said ibn\\n\\t\\t\\t\\tMusayyab, 'What do you think of a man buying an old camel\\n\\t\\t\\t\\tfor 10 sheep?' \" Said said, \"If he buys it to slaughter\\n\\t\\t\\t\\tit, there is no good in it.\" Abu'z-Zinad added, \"All the\\n\\t\\t\\t\\tpeople (i.e. companions) that I have seen forbade\\n\\t\\t\\t\\tbartering live animals for meat.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu'z-Zinad said, \"This used to be written in the\\n\\t\\t\\t\\tappointment letters of governors in the time of Aban ibn\\n\\t\\t\\t\\tUthman and Hisham ibn Ismail.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "67",
    "sectionHeading": "Selling Meat for Meat",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"It is the generally agreed on way of doing\\n\\t\\t\\t\\tthings among us that the meat of camels, cattle, sheep\\n\\t\\t\\t\\tand so on is not to be bartered one for one, except like\\n\\t\\t\\t\\tfor like, weight for weight, from hand to hand. There is\\n\\t\\t\\t\\tno harm in that. If it is not weighed, then it is\\n\\t\\t\\t\\testimated to be like for like from hand to hand.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in bartering the meat of\\n\\t\\t\\t\\tfish for the meat of camels, cattle, and sheep and so on\\n\\t\\t\\t\\ttwo or more for one, from hand to hand. If delayed terms\\n\\t\\t\\t\\tenter the transaction however, there is no good in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I think that poultry is different from the\\n\\t\\t\\t\\tmeat of cattle and fish. I see no harm in selling some of\\n\\t\\t\\t\\tit for something different, more of one than another,\\n\\t\\t\\t\\tfrom hand to hand. None of that is to be sold on delayed\\n\\t\\t\\t\\tterms.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "68",
    "sectionHeading": "Selling dogs",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tBakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham from Abu\\n\\t\\t\\t\\tMasud al-Ansari that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, forbade the sale price of\\n\\t\\t\\t\\ta dog, the earnings of a prostitute and the earnings of a\\n\\t\\t\\t\\tfortune teller.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tBy the earnings of a prostitute he meant what a woman was\\n\\t\\t\\t\\tgiven for fornication. The earnings of a fortune teller\\n\\t\\t\\t\\twere what he was given to tell a fortune.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I disapprove of the price of a dog, whether\\n\\t\\t\\t\\tit is a hunting dog or otherwise because the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, forbade\\n\\t\\t\\t\\tthe price of a dog.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "69",
    "sectionHeading": "Advance and Sale of Some Goods for Others",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade 'selling and lending.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of what that meant is that\\n\\t\\t\\t\\tone man says to another, 'I will take your goods for\\n\\t\\t\\t\\tsuch-and-such if you lend me such-and-such.' If they\\n\\t\\t\\t\\tagree to a transaction in this manner, it is not\\n\\t\\t\\t\\tpermitted. If the one who stipulates the loan abandons\\n\\t\\t\\t\\this stipulation, then the sale is permitted.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in exchanging linen from\\n\\t\\t\\t\\tShata, for garments from Itribi, or Qass, or Ziqa. Or the\\n\\t\\t\\t\\tcloth of Herat or Merv for Yemeni cloaks and shawls and\\n\\t\\t\\t\\tsuch like as one for two or three, from hand to hand or\\n\\t\\t\\t\\twith delayed terms. If the goods are of the same kind,\\n\\t\\t\\t\\tand deferment enters into the transaction, there is no\\n\\t\\t\\t\\tgood in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not good unless they are different,\\n\\t\\t\\t\\tand the difference between them is clear. When they\\n\\t\\t\\t\\tresemble each other, even if the names are different, do\\n\\t\\t\\t\\tnot take two for one with delayed terms, for instance two\\n\\t\\t\\t\\tgarments of Herat for one from Merv or Quhy with delayed\\n\\t\\t\\t\\tterms, ortwo garments of Furqub for one from Shata. All\\n\\t\\t\\t\\tthese sorts are of the same description, so do not buy\\n\\t\\t\\t\\ttwo for one, on delayed terms.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in selling what you buy of\\n\\t\\t\\t\\tthings of this nature, before you complete the deal, to\\n\\t\\t\\t\\tsome one other than the person from whom you purchased\\n\\t\\t\\t\\tthem if the price was paid in cash.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "70",
    "sectionHeading": "The Advance on Goods",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad said, ''I heard Abdullah ibn Abbas\\n\\t\\t\\t\\tsay, when a man asked him about a man making an advance\\n\\t\\t\\t\\ton some garments and then wanting to sell them back\\n\\t\\t\\t\\tbefore taking possession of them, 'That is silver for\\n\\t\\t\\t\\tsilver,' and he disapproved of it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Our opinion is - and Allah knows best that\\n\\t\\t\\t\\twas because he wanted to sell them to the person from\\n\\t\\t\\t\\twhom he had bought them for more than the price for which\\n\\t\\t\\t\\the bought them. Had he sold them to some one other than\\n\\t\\t\\t\\tthe person from whom he had purchased them, there would\\n\\t\\t\\t\\tnot have been any harm in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us concerning making an advance for slaves, cattle\\n\\t\\t\\t\\tor goods is that when all of what is to be sold is\\n\\t\\t\\t\\tdescribed and an advance is made for them for a date, and\\n\\t\\t\\t\\tthe date falls due, the buyer does not sell any of that\\n\\t\\t\\t\\tto the person from whom he has purchased it for more than\\n\\t\\t\\t\\tthe price which he advanced for it before he has taken\\n\\t\\t\\t\\tfull possession of what he has advanced for. It is usury\\n\\t\\t\\t\\tif he does. If the buyer gives the seller dinars or\\n\\t\\t\\t\\tdirhams and he profits with them, then, when the goods\\n\\t\\t\\t\\tcome to the buyer and he does not take them into his\\n\\t\\t\\t\\tpossession but sells them back to their owner for more\\n\\t\\t\\t\\tthan what he advanced for them, the outcome is that what\\n\\t\\t\\t\\the has advanced has returned to him and has been\\n\\t\\t\\t\\tincreased for him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone advances gold or silver for\\n\\t\\t\\t\\tdescribed animals or goods which are to be delivered\\n\\t\\t\\t\\tbefore a named date, and the date arrives, or it is\\n\\t\\t\\t\\tbefore or after the date, there is no harm in the buyer\\n\\t\\t\\t\\tselling those goods to the seller, for other goods, to be\\n\\t\\t\\t\\ttaken immediately and not delayed, no matter how\\n\\t\\t\\t\\textensive the amount of those goods is, except in the\\n\\t\\t\\t\\tcase of food because it is not halal to sell it before he\\n\\t\\t\\t\\thas full possession of it. The buyer can sell those goods\\n\\t\\t\\t\\tto some one other than the person from whom he purchased\\n\\t\\t\\t\\tthem for gold or silver or any goods. He takes possession\\n\\t\\t\\t\\tof it and does not defer it because if he defers it, that\\n\\t\\t\\t\\tis ugly and there enters into the transaction what is\\n\\t\\t\\t\\tdisapproved of: delay for delay. Delay for delay is to\\n\\t\\t\\t\\tsell a debt against one man for a debt against another\\n\\t\\t\\t\\tman.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone advances for goods to be\\n\\t\\t\\t\\tdelivered after a time, and those goods are neither\\n\\t\\t\\t\\tsomething to be eaten nor drunk, he can sell them to\\n\\t\\t\\t\\twhomever he likes for cash or goods, before he takes\\n\\t\\t\\t\\tdelivery of them, to some one other than the person from\\n\\t\\t\\t\\twhom he purchased them. He must not sell them to the\\n\\t\\t\\t\\tperson from whom he bought them except in exchange for\\n\\t\\t\\t\\tgoods which he takes possession of immediately and does\\n\\t\\t\\t\\tnot defer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If the delivery date for the goods has not\\n\\t\\t\\t\\tarrived, there is no harm in selling them to the original\\n\\t\\t\\t\\towner for goods which are clearly different and which he\\n\\t\\t\\t\\ttakes immediate possession of and does not defer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about the case of a man who advanced dinars\\n\\t\\t\\t\\tor dirhams for four specified pieces of cloth to be\\n\\t\\t\\t\\tdelivered before a specified time and when the term fell\\n\\t\\t\\t\\tdue, he demanded delivery from the seller and the seller\\n\\t\\t\\t\\tdid not have them. He found that the seller had cloth but\\n\\t\\t\\t\\tinferior quality, and the seller said that he would give\\n\\t\\t\\t\\thim eight of those cloths. Malik said, \"There is no harm\\n\\t\\t\\t\\tin that if he takes the cloths which he offers him before\\n\\t\\t\\t\\tthey separate. It is not good if delayed terms enter into\\n\\t\\t\\t\\tthe transaction. It is also not good if that is before\\n\\t\\t\\t\\tthe end of the term, unless he sells him cloth which is\\n\\t\\t\\t\\tnotthetypeof cloth for which he made an advance.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "71",
    "sectionHeading": "Selling Copper and Iron and Such Things which are Weighed",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us about whatever is weighed but is not gold or\\n\\t\\t\\t\\tsilver, i.e. copper, brass, lead, black lead, iron,\\n\\t\\t\\t\\therbs, figs, cotton, and any such things that are\\n\\t\\t\\t\\tweighed, is that there is no harm in bartering all those\\n\\t\\t\\t\\tsorts of things two for one, hand to hand. There is no\\n\\t\\t\\t\\tharm in taking a ritl of iron for two ritls of iron, and\\n\\t\\t\\t\\ta ritl of brass for two ritls of brass.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no good in two for one of one sort\\n\\t\\t\\t\\twith delayed terms. There is no harm in taking two of one\\n\\t\\t\\t\\tsort for one of another on delayed terms, if the two\\n\\t\\t\\t\\tsorts are clearly different. If both sorts resemble each\\n\\t\\t\\t\\tother but their names are different, like lead and black\\n\\t\\t\\t\\tlead, brass and yellow brass, I disapprove of taking two\\n\\t\\t\\t\\tof one sort for one of the other on delayed terms.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"When buying something of this nature, there\\n\\t\\t\\t\\tis no harm in selling It beforetaking possession of it to\\n\\t\\t\\t\\tsome one other than the person from whom it was\\n\\t\\t\\t\\tpurchased, if the price is taken immediately and if it\\n\\t\\t\\t\\twas bought originally by measure or weight. If it was\\n\\t\\t\\t\\tbought without measuring, it should be sold to someone\\n\\t\\t\\t\\tother than the person from whom it was bought, for cash\\n\\t\\t\\t\\tor with delayed terms. That is because goods have to be\\n\\t\\t\\t\\tguaranteed when they are bought without measuring, and\\n\\t\\t\\t\\tthey cannot be guaranteed when bought by weight until\\n\\t\\t\\t\\tthey are weighed and the deal is completed. This is the\\n\\t\\t\\t\\tbest of what I have heard about all these things. It is\\n\\t\\t\\t\\twhat people continue to do among us.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things among us with what\\n\\t\\t\\t\\tis measured or weighed of things which are not eaten or\\n\\t\\t\\t\\tdrunk, like safflower, date-stones, fodder leaves, indigo\\n\\t\\t\\t\\tdye and the like of that is that there is no harm in\\n\\t\\t\\t\\tbartering all those sort of things two for one, hand to\\n\\t\\t\\t\\thand. Do not take two for one from the same variety with\\n\\t\\t\\t\\tdelayed terms. If the types are clearly different, there\\n\\t\\t\\t\\tis no harm in taking two of one for one of the other with\\n\\t\\t\\t\\tdelayed terms. There is no harm in selling whatever is\\n\\t\\t\\t\\tpurchased of all these sorts, before taking delivery of\\n\\t\\t\\t\\tthem if the price is taken from someone other than the\\n\\t\\t\\t\\tperson from whom they were purchased.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Anything of any variety that profits people,\\n\\t\\t\\t\\tlike gravel and gypsum, one quantity of them for two of\\n\\t\\t\\t\\tits like with delayed terms is usury. One quantity of\\n\\t\\t\\t\\tboth of them for its equal plus any increase with delayed\\n\\t\\t\\t\\tterms, is usury.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "72",
    "sectionHeading": "Prohibition against Two Sales in One Sale",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade two sales in one sale.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "73",
    "sectionHeading": "Prohibition against Two Sales in One Sale",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that a\\n\\t\\t\\t\\tman said to another, \"Buy this camel for me immediately\\n\\t\\t\\t\\tso that I can buy him from you on credit.\" Abdullah ibn\\n\\t\\t\\t\\tUmar was asked about that and he disapproved of it and\\n\\t\\t\\t\\tforbade it.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "74",
    "sectionHeading": "Prohibition against Two Sales in One Sale",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tal-Qasim ibn Muhammad was asked about a man who bought\\n\\t\\t\\t\\tgoods for 10 dinars cash or fifteen dinars on credit. He\\n\\t\\t\\t\\tdisapproved of that and forbade it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that if a man bought goods from a man for\\n\\t\\t\\t\\teither 10 dinars or 15 dinars on credit, that one of the\\n\\t\\t\\t\\ttwo prices was obliged on the buyer. It was not to be\\n\\t\\t\\t\\tdone because if he postponed paying the ten, it would be\\n\\t\\t\\t\\t15 on credit, and if he paid the ten, he would buy with\\n\\t\\t\\t\\tit what was worth fifteen dinars on credit.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that it was disapproved of for a man to buy\\n\\t\\t\\t\\tgoods from someone for either a dinar cash or for a\\n\\t\\t\\t\\tdescribed sheep on credit and that one of the two prices\\n\\t\\t\\t\\twas obliged on him. It was not to be done because the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade two sales in one sale. This was part of\\n\\t\\t\\t\\ttwo sales in the one sale.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man saying to another, \"'I will\\n\\t\\t\\t\\teither buy these fifteen sa of ajwa dates from you, or\\n\\t\\t\\t\\tthese ten sa of sayhani dates or I will buy these fifteen\\n\\t\\t\\t\\tsa of inferior wheat or these ten sa of Syrian wheat for\\n\\t\\t\\t\\ta dinar, and one of them is obliged to me.' Malik said\\n\\t\\t\\t\\tthat it was disapproved of and was not halal. That was\\n\\t\\t\\t\\tbecause he obliged him ten sa of sayhani, and left them\\n\\t\\t\\t\\tand took fifteen sa of ajwa, or he was obliged fifteen sa\\n\\t\\t\\t\\tof inferior wheat and left them and took ten sa of Syrian\\n\\t\\t\\t\\twheat. This was also disapproved of, and was not halal.\\n\\t\\t\\t\\tIt resembled what was prohibited in the way of two sales\\n\\t\\t\\t\\tin one sale. It was also included under the prohibition\\n\\t\\t\\t\\tagainst buying two for one of the same sort of food.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "75",
    "sectionHeading": "Transactions with Uncertainty in Them",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Hazim ibn Dinar\\n\\t\\t\\t\\tfrom Said ibn al-Musayyab that the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, forbade the sale\\n\\t\\t\\t\\twith uncertainty in it.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"An example of one type of uncertain\\n\\t\\t\\t\\ttransaction and risk is that a man intends the price of a\\n\\t\\t\\t\\tstray animal or escaped slave to be fifty dinars. A man\\n\\t\\t\\t\\tsays, 'I will take him from you for twenty dinars.' If\\n\\t\\t\\t\\tthe buyer finds him, thirty dinars goes from the seller,\\n\\t\\t\\t\\tand if he does not find him, the seller takes twenty\\n\\t\\t\\t\\tdinars from the buyer.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is another fault in that. If that\\n\\t\\t\\t\\tstray is found, it is not known whether it will have\\n\\t\\t\\t\\tincreased or decreased in value or what defects may have\\n\\t\\t\\t\\tbefallen it. This transaction is greatly uncertain and\\n\\t\\t\\t\\trisky.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"According to our way of doing things, one\\n\\t\\t\\t\\tkind of uncertain transaction and risk is selling what is\\n\\t\\t\\t\\tin the wombs of females - women and animals - because it\\n\\t\\t\\t\\tis not known whether or not it will come out, and if it\\n\\t\\t\\t\\tdoes come out, it is not known whether it will be\\n\\t\\t\\t\\tbeautiful or ugly, normal or disabled, male or female.\\n\\t\\t\\t\\tAll that is disparate. If it has that, its price is\\n\\t\\t\\t\\tsuch-and-such, and if it has this, its price is\\n\\t\\t\\t\\tsuch-and-such.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Females must not be sold with what is in\\n\\t\\t\\t\\ttheir wombs excluded. That is that, for instance, a man\\n\\t\\t\\t\\tsays to another, 'The price of my sheep which has much\\n\\t\\t\\t\\tmilk is three dinars. She is yours for two dinars while I\\n\\t\\t\\t\\twill have her future offspring.' This is disapproved\\n\\t\\t\\t\\tbecause it is an uncertain transaction and a risk.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is not halal to sell olives for olive oil\\n\\t\\t\\t\\tor sesame for sesame oil, or butter for ghee because\\n\\t\\t\\t\\tmuzabana comes into that, because the person who buys the\\n\\t\\t\\t\\traw product for something specified which comes from it,\\n\\t\\t\\t\\tdoes not know whether more or less will come out of that,\\n\\t\\t\\t\\tso it is an uncertain transaction and a risk.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"A similar case is the selling of ben-nuts\\n\\t\\t\\t\\tfor ben-nut oil. This is an uncertain transaction because\\n\\t\\t\\t\\twhat comes from the ben-nut is ben-oil. There is no harm\\n\\t\\t\\t\\tin selling ben-nuts for perfumed ben because perfumed ben\\n\\t\\t\\t\\thas been perfumed, mixed and changed from the state of\\n\\t\\t\\t\\traw ben-nut oil.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik, speaking about a man who sold goods to a man on\\n\\t\\t\\t\\tthe provision that there was to be no loss for the buyer,\\n\\t\\t\\t\\t(i.e. if the buyer could not re-sell the goods they could\\n\\t\\t\\t\\tgo back to the seller), said, \"This transaction is not\\n\\t\\t\\t\\tpermitted and it is part of risk. The explanation of why\\n\\t\\t\\t\\tit is so, is that it is as if the seller hired the buyer\\n\\t\\t\\t\\tfor the profit if the goods make a profit. If he sells\\n\\t\\t\\t\\tthe stock at a loss, he has nothing, and his efforts are\\n\\t\\t\\t\\tnot compensated. This is not good. In such a transaction,\\n\\t\\t\\t\\tthe buyer should have a wage according to the work that\\n\\t\\t\\t\\the has contributed. Whatever there is of loss or profit\\n\\t\\t\\t\\tin those goods is for and against the seller. This is\\n\\t\\t\\t\\tonly when the goods are gone and sold. If they do not go,\\n\\t\\t\\t\\tthe transaction between them is null and void.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for a man who buys goods from a man and\\n\\t\\t\\t\\the concludes the sale and then the buyer regrets and asks\\n\\t\\t\\t\\tto have the price reduced and the seller refuses and\\n\\t\\t\\t\\tsays, 'Sell it and I will compensate you for any loss.'\\n\\t\\t\\t\\tThere is no harm in this because there is no risk. It is\\n\\t\\t\\t\\tsomething he proposes to him, and their transaction was\\n\\t\\t\\t\\tnot based on that. That is what is done among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "76",
    "sectionHeading": "Al-Mulamasa and al-Munabadha",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Yahya\\n\\t\\t\\t\\tibn Habban and from Abu'z-Zinad from al-Araj from Abu\\n\\t\\t\\t\\tHurayra that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, forbade mulamasa and munabadha.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Mulamasa is when a man can feel a garment\\n\\t\\t\\t\\tbut is not allowed to unfold it or examine what is in it,\\n\\t\\t\\t\\tor he buys by night and does not know what is in it.\\n\\t\\t\\t\\tMunabadha is that a man throws his garment to another,\\n\\t\\t\\t\\tand the other throws his garment without either of them\\n\\t\\t\\t\\tmaking any inspection. Each of them says, 'this is for\\n\\t\\t\\t\\tthis. 'This is what is forbidden of mulamasa and\\n\\t\\t\\t\\tmunabadha.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said that selling bundles with a list of their\\n\\t\\t\\t\\tcontents was different from the sale of the cloak\\n\\t\\t\\t\\tconcealed in a bag or the cloth folded up and such\\n\\t\\t\\t\\tthings. What made it different was that it was a common\\n\\t\\t\\t\\tpractice and it was what people were familiar with, and\\n\\t\\t\\t\\twhat people had done in the past, and it was still among\\n\\t\\t\\t\\tthe permitted transactions and trading of people in which\\n\\t\\t\\t\\tthey saw no harm because in the sale of bundles with a\\n\\t\\t\\t\\tlist of contents without undoing them, an uncertain\\n\\t\\t\\t\\ttransaction was not intended and it did not resemble\\n\\t\\t\\t\\tmulamasa.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "77",
    "sectionHeading": "Al-Mulamasa and al-Munabadha",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me, that Malik said, \"The generally\\n\\t\\t\\t\\tagreed on way of doing things among us about a man buying\\n\\t\\t\\t\\tcloth in one city, and then taking it to another city to\\n\\t\\t\\t\\tsell as a murabaha, is that he is not reckoned to have\\n\\t\\t\\t\\tthe wage of an agent, or any allowance for ironing,\\n\\t\\t\\t\\tfolding, straightening, expenses, or the rent of a house.\\n\\t\\t\\t\\tAs for the cost of transporting the drapery, it is\\n\\t\\t\\t\\tincluded in the basic price, and no share of the profit\\n\\t\\t\\t\\tis allocated to it unless the agent tells all of that to\\n\\t\\t\\t\\tthe investor. If they agree to share the profits\\n\\t\\t\\t\\taccordingly after knowledge of it, there is no harm in\\n\\t\\t\\t\\tthat.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for bleaching, tailoring, dyeing, and\\n\\t\\t\\t\\tsuch things, they are treated in the same way as drapery.\\n\\t\\t\\t\\tThe profit is reckoned in them as it is reckoned in\\n\\t\\t\\t\\tdrapery goods. So if he sells the drapery goods without\\n\\t\\t\\t\\tclarifying the things we named as not getting profit, and\\n\\t\\t\\t\\tif the drapery has already gone, the transport is to be\\n\\t\\t\\t\\treckoned, but no profit is given. If the drapery goods\\n\\t\\t\\t\\thave not gone the transaction between them is null and\\n\\t\\t\\t\\tvoid unless they make a new mutual agreement on what is\\n\\t\\t\\t\\tto be permitted between them .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about an agent who bought goods for gold or\\n\\t\\t\\t\\tsilver, and the exchange rate on the day of purchase was\\n\\t\\t\\t\\tten dirhams to the dinar. He took them to a city to sell\\n\\t\\t\\t\\tmurabaha, or sold them where he purchased them according\\n\\t\\t\\t\\tto the exchange rate of the day on which he sold them. If\\n\\t\\t\\t\\the bought them for dirhams and he sold them for dinars,\\n\\t\\t\\t\\tor he bought them for dinars and he sold them for\\n\\t\\t\\t\\tdirhams, and the goods had not gone then he had a choice.\\n\\t\\t\\t\\tIf he wished, he accepted to sell the goods and if he\\n\\t\\t\\t\\twished, he left them. If the goods had been sold, he had\\n\\t\\t\\t\\tthe price for which the salesman bought them, and the\\n\\t\\t\\t\\tsalesman was reckoned to have the profit on what they\\n\\t\\t\\t\\twere bought for, over what the investor gained as profit.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a man sells goods worth one hundred\\n\\t\\t\\t\\tdinars for one hundred and ten, and he hears after that\\n\\t\\t\\t\\tthey are worth ninety dinars, and the goods have gone,\\n\\t\\t\\t\\tthe seller has a choice. If he likes, he has the price of\\n\\t\\t\\t\\tthe goods on the day they were taken from him unless the\\n\\t\\t\\t\\tprice is more than the price for which he was obliged to\\n\\t\\t\\t\\tsell them in the first place, and he does not have more\\n\\t\\t\\t\\tthan that - and it is one hundred and ten dinars. If he\\n\\t\\t\\t\\tlikes, it is counted as profit against ninety unless the\\n\\t\\t\\t\\tprice his goods reached was less than the value. He is\\n\\t\\t\\t\\tgiven the choice between what his goods fetch and the\\n\\t\\t\\t\\tcapital plus the profit, which is ninety-nine dinars.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If someone sells goods in murabaha and he\\n\\t\\t\\t\\tsays, 'It was valued at one hundred dinars to me.' Then\\n\\t\\t\\t\\the hears later on, that it was worth one hundred and\\n\\t\\t\\t\\ttwenty dinars, the customer is given the choice. If he\\n\\t\\t\\t\\twishes, he gives the salesman the value of the goods on\\n\\t\\t\\t\\tthe day he took them, and if he wishes, he gives the\\n\\t\\t\\t\\tprice for which he bought them according to the reckoning\\n\\t\\t\\t\\tof what profit he gives him, as far as it goes, unless\\n\\t\\t\\t\\tthat is less than the price for which he bought them, for\\n\\t\\t\\t\\the should not give the owner of the goods a loss from the\\n\\t\\t\\t\\tprice for which he bought them because he was satisfied\\n\\t\\t\\t\\twith that. The owner of the goods came to seek extra, so\\n\\t\\t\\t\\tthe buyer has no argument against the salesman in that to\\n\\t\\t\\t\\tmake a reduction from the first price for which he bought\\n\\t\\t\\t\\tit according to the list of contents.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "79",
    "sectionHeading": "Sale according to List of Contents",
    "text": "<p>\\n\\t\\t\\t\\tMalik spoke about what was done among them in the case of\\n\\t\\t\\t\\ta group of people who bought goods, drapery or slaves,\\n\\t\\t\\t\\tand a man heard about it and said to one of the group, \"I\\n\\t\\t\\t\\thave heard the description and situation of the drapery\\n\\t\\t\\t\\tgoods you bought from so-and-so. Shall I give you\\n\\t\\t\\t\\tsuch-and-such profit to take over your portion?\" This\\n\\t\\t\\t\\tperson agreed, and the man gave him the profit and became\\n\\t\\t\\t\\ta partner in his place. When he looked at the purchase,\\n\\t\\t\\t\\the saw that it was ugly and found it too expensive.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is obliged on him and there is no choice\\n\\t\\t\\t\\tin it for him if he bought it according to a list of\\n\\t\\t\\t\\tcontents and the description was well-known.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who had drapery goods sent to\\n\\t\\t\\t\\thim, and salesmen came to him and he read to them his\\n\\t\\t\\t\\tlist of contents and said, \"In each bag is such-and-such\\n\\t\\t\\t\\ta wrap from Basra and such-and-such a light wrap from\\n\\t\\t\\t\\tSabir. Their size is such-and-such,\" and he named to them\\n\\t\\t\\t\\ttypes of drapery goods by their sort, and he said, \"Buy\\n\\t\\t\\t\\tthem from me according to this description.\" They bought\\n\\t\\t\\t\\tthe bags according to what he described to them, and then\\n\\t\\t\\t\\tthey bought them and found them too expensive and\\n\\t\\t\\t\\tregretted it. Malik said, \"The sale is binding on them,\\n\\t\\t\\t\\tif the goods agree with the list of contents on which he\\n\\t\\t\\t\\tsold them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is the way of doing things which people\\n\\t\\t\\t\\tstill use today. They permit the sale among them when the\\n\\t\\t\\t\\tgoods agree with the list of contents and are not\\n\\t\\t\\t\\tdifferent from it. \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "80",
    "sectionHeading": "The Right of Withdrawal (Khiyar)",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Both parties in a business\\n\\t\\t\\t\\ttransaction have the right of withdrawal as long as they\\n\\t\\t\\t\\thave not separated, except in the transaction called\\n\\t\\t\\t\\tkhiyar.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no specified limit nor any matter\\n\\t\\t\\t\\twhich is applied in this case according to us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "81",
    "sectionHeading": "The Right of Withdrawal (Khiyar)",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Abdullah ibn\\n\\t\\t\\t\\tMasud used to relate that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"When two\\n\\t\\t\\t\\tparties dispute about a business transaction, the\\n\\t\\t\\t\\tseller's word is taken, or they make an agreement among\\n\\t\\t\\t\\tthemselves.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about someone who sold goods to a man, and\\n\\t\\t\\t\\tsaid at the contracting of the sale, 'I will sell to you\\n\\t\\t\\t\\tprovided I consult so-and-so. If he is satisfied, the\\n\\t\\t\\t\\tsale is permitted. If he dislikes it, there is no sale\\n\\t\\t\\t\\tbetween us.' They made the transaction on that basis.\\n\\t\\t\\t\\tThen the buyer regretted before the seller consulted the\\n\\t\\t\\t\\tperson.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That sale is binding on them according to\\n\\t\\t\\t\\twhat they described. The buyer has no right of\\n\\t\\t\\t\\twithdrawal, and it is binding on him, if the person whom\\n\\t\\t\\t\\tthe seller stipulated to him, permits it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things among us about a man\\n\\t\\t\\t\\twho buys goods from another and they differ about the\\n\\t\\t\\t\\tprice, and the seller says, 'I sold them to you for ten\\n\\t\\t\\t\\tdinars,' and the buyer says, 'I bought them from you for\\n\\t\\t\\t\\tfive dinars,' is that it is said to the seller, 'If you\\n\\t\\t\\t\\tlike, give them to the buyer for what he said. If you\\n\\t\\t\\t\\tlike, swear by Allah that you only sold your goods for\\n\\t\\t\\t\\twhat you said.' If he swears it is said to the buyer,\\n\\t\\t\\t\\t'Either you take the goods for what the seller said, or\\n\\t\\t\\t\\tyou swear by Allah that you bought them only for what you\\n\\t\\t\\t\\tsaid.' If he swears, he is free to return the goods. That\\n\\t\\t\\t\\tis when each of them testifies against the other.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "82",
    "sectionHeading": "Usury in Debts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from Busr\\n\\t\\t\\t\\tibn Said from Ubayd, Abu Salih, the mawla of as-Saffah\\n\\t\\t\\t\\tthat he said, \"I sold drapery to the people of Dar Nakhla\\n\\t\\t\\t\\ton credit. Then I wanted to go to Kufa, so they proposed\\n\\t\\t\\t\\tthat I reduce the price for them and they would pay me\\n\\t\\t\\t\\timmediately . I asked Zayd ibn Thabit about that, and he\\n\\t\\t\\t\\tsaid, 'I order you not to accept increase or to give to\\n\\t\\t\\t\\tanybody.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "83",
    "sectionHeading": "Usury in Debts",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Uthman ibn Hafs ibn\\n\\t\\t\\t\\tKhalda from Ibn Shihab from Salim ibn Abdullah that\\n\\t\\t\\t\\tAbdullah ibn Umar was asked about a man who took a loan\\n\\t\\t\\t\\tfrom another man for a set term. The creditor reduced the\\n\\t\\t\\t\\tdebt, and the man paid it immediately Abdullah ibn Umar\\n\\t\\t\\t\\tdisliked that, and forbade it.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "84",
    "sectionHeading": "Usury in Debts",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Zayd ibn Aslam said, \"Usury in\\n\\t\\t\\t\\tthe Jahiliyya was that a man would give a loan to a man\\n\\t\\t\\t\\tfor a set term. When the term was due, he would say,\\n\\t\\t\\t\\t'Will you pay it off or increase me?' If the man paid, he\\n\\t\\t\\t\\ttook it. If not, he increased him in his debt and\\n\\t\\t\\t\\tlengthened the term for him .\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The disapproved of way of doing things about\\n\\t\\t\\t\\twhich there is no dispute among us, is that a man should\\n\\t\\t\\t\\tgive a loan to a man for a term, and then the demander\\n\\t\\t\\t\\treduce it and the one from whom it is demanded pay it in\\n\\t\\t\\t\\tadvance. To us that is like someone who delays repaying\\n\\t\\t\\t\\this debt after it is due to his creditor and his creditor\\n\\t\\t\\t\\tincreases his debt.\" Malik said, \"This is nothing else\\n\\t\\t\\t\\tbut usury. No doubt about it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who loaned one hundred dinars to\\n\\t\\t\\t\\ta man for two terms. When it was due, the person who owed\\n\\t\\t\\t\\tthe debt said to him, \"Sell me some goods, whose price is\\n\\t\\t\\t\\tone hundred dinars in cash for one hundred and fifty on\\n\\t\\t\\t\\tcredit.\" Malik said, \"This transaction is not good, and\\n\\t\\t\\t\\tthe people of knowledge still forbid it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is disapproved of because the creditor\\n\\t\\t\\t\\thimself gives the debtor the price of what the man sells\\n\\t\\t\\t\\thim, and he defers repayment of the hundred of the first\\n\\t\\t\\t\\ttransaction for the debtor for the term which is\\n\\t\\t\\t\\tmentioned to him in the second transaction, and the\\n\\t\\t\\t\\tdebtor increases him with fifty dinars for his deferring\\n\\t\\t\\t\\thim. That is disapproved of and it is not good. It also\\n\\t\\t\\t\\tresembles the hadith of Zayd ibn Aslam about the\\n\\t\\t\\t\\ttransactions of the people of the Jahiliyya. When their\\n\\t\\t\\t\\tdebts were due, they said to the person with the debt,\\n\\t\\t\\t\\t'Either you pay in full or you increase it.' If they\\n\\t\\t\\t\\tpaid, they took it, and if not they increased debtors in\\n\\t\\t\\t\\ttheir debts, and extended the term for them.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "85",
    "sectionHeading": "Debts and Transfer Debts in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z-Zinad from al\\n\\t\\t\\t\\tAraj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"Delay in\\n\\t\\t\\t\\tpayment by a rich man is injustice, but when one of you\\n\\t\\t\\t\\tis referred for payment to a wealthy man, let him be\\n\\t\\t\\t\\treferred.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "86",
    "sectionHeading": "Debts and Transfer Debts in General",
    "text": "<p>\\n\\t\\t\\t\\t86 Malik related to me from Musa ibn Maysara that he\\n\\t\\t\\t\\theard a man ask Said ibn al-Musayyab, \"I am a man who\\n\\t\\t\\t\\tsells for a debt.\" Said said, \"Do not sell except for\\n\\t\\t\\t\\twhat you take to your camel.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a person who bought goods from a man\\n\\t\\t\\t\\tprovided that he provide him with those goods by a\\n\\t\\t\\t\\tspecific date, either in time for a market in which he\\n\\t\\t\\t\\thoped for their saleability, or to fulfil a need at the\\n\\t\\t\\t\\ttime he stipulated. Then the seller failed him about the\\n\\t\\t\\t\\tdate, and the buyer wanted to return those goods to the\\n\\t\\t\\t\\tseller. Malik said, \"The buyer cannot do that, and the\\n\\t\\t\\t\\tsale is binding on him. If the seller does bring the\\n\\t\\t\\t\\tgoods before the completion of the term, the buyer cannot\\n\\t\\t\\t\\tbe forced to take them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a person who bought food and measured\\n\\t\\t\\t\\tit. Then some one came to him to buy it and he told him\\n\\t\\t\\t\\tthat he had measured it for himself and taken it in full.\\n\\t\\t\\t\\tThe new buyer wanted to trust him and accept his measure.\\n\\t\\t\\t\\tMalik said, -Whatever is sold in this way for cash has no\\n\\t\\t\\t\\tharm in it but whatever is sold in this way on delayed\\n\\t\\t\\t\\tterms is disapproved of until the new buyer measures it\\n\\t\\t\\t\\tout for himself. The sale with delayed terms is\\n\\t\\t\\t\\tdisapproved of because it leads to usury and it is feared\\n\\t\\t\\t\\tthat it will be circulated in this way without weight or\\n\\t\\t\\t\\tmeasure. If the terms are delayed it is disapproved of\\n\\t\\t\\t\\tand there is no disagreement about that with us.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"One should not buy a debt owed by a man\\n\\t\\t\\t\\twhether present or absent, without the confirmation of\\n\\t\\t\\t\\tthe one who owes the debt, nor should one buy a debt owed\\n\\t\\t\\t\\tto a man by a dead person even if one knows what the\\n\\t\\t\\t\\tdeceased man has left. That is because to buy that is an\\n\\t\\t\\t\\tuncertain transaction and one does not know whether the\\n\\t\\t\\t\\ttransaction will be completed or not completed.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"The explanation of what is disapproved of in\\n\\t\\t\\t\\tbuying a debt owed by someone absent or dead, is that it\\n\\t\\t\\t\\tis not known what unknown debtor may be connected to the\\n\\t\\t\\t\\tdead person. If the dead person is liable for another\\n\\t\\t\\t\\tdebt, the price which the buyer gave on strength of the\\n\\t\\t\\t\\tdebt may become worthless.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is another fault in that as well. He\\n\\t\\t\\t\\tis buying something which is not guaranteed for him, and\\n\\t\\t\\t\\tso if the deal is not completed, what he paid becomes\\n\\t\\t\\t\\tworthless. This is an uncertain transaction and it is not\\n\\t\\t\\t\\tgood.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"One distinguishes between a man who is only\\n\\t\\t\\t\\tselling what he actually has and a man who is being paid\\n\\t\\t\\t\\tin advance for something which is not yet in his\\n\\t\\t\\t\\tpossession. The man advancing the money brings his gold\\n\\t\\t\\t\\twhich he intends to buy with. The seller says, 'This is\\n\\t\\t\\t\\t10 dinars. What do you want me to buy for you with it?'\\n\\t\\t\\t\\tIt is as if he sold 10 dinars cash for 15 dinars to be\\n\\t\\t\\t\\tpaid later. Because of this, it is disapproved of. It is\\n\\t\\t\\t\\tsomething leading to usury and fraud.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "87",
    "sectionHeading": "Partnership, Transferral of Responsibility to an Agent and Revocation",
    "text": "<p>\\n\\t\\t\\t\\tMalik said there was no harm if a man who sold some\\n\\t\\t\\t\\tdrapery and excluded some garments by their markings,\\n\\t\\t\\t\\tstipulated that he chose the marked ones from that. If he\\n\\t\\t\\t\\tdid not stipulate that he would choose from them when he\\n\\t\\t\\t\\tmade the exclusion, I think that he is partner in the\\n\\t\\t\\t\\tnumber of drapery goods which were purchased from him.\\n\\t\\t\\t\\tThat is because two garments can be alike in marking and\\n\\t\\t\\t\\tbe greatly different in price.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The way of doing things among us is that\\n\\t\\t\\t\\tthere is no harm in partnership, transferring\\n\\t\\t\\t\\tresponsibility to an agent, and revocation when dealing\\n\\t\\t\\t\\twith food and other things, whether or not possession was\\n\\t\\t\\t\\ttaken, when the transaction is with cash, and there is no\\n\\t\\t\\t\\tprofit, loss, or deferment of price in it. If profit or\\n\\t\\t\\t\\tloss or deferment of price from one of the two enters any\\n\\t\\t\\t\\tof these transactions, it becomes sale which is made\\n\\t\\t\\t\\thalal by what makes sale halal, and made haram by what\\n\\t\\t\\t\\tmakes sale haram, and it is not partnership, transferring\\n\\t\\t\\t\\tresponsibility to an agent, or revocation.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about some one who bought drapery goods or\\n\\t\\t\\t\\tslaves, and the sale was concluded, then a man asked him\\n\\t\\t\\t\\tto be his partner and he agreed and the new partner paid\\n\\t\\t\\t\\tthe whole price to the seller and then something happened\\n\\t\\t\\t\\tto the goods which removed them from their possession.\\n\\t\\t\\t\\tMalik said, \"The new partner takes the price from the\\n\\t\\t\\t\\toriginal partner and the original partner demands from\\n\\t\\t\\t\\tthe seller the whole price unless the original partner\\n\\t\\t\\t\\tstipulated on the new partner during the sale and before\\n\\t\\t\\t\\tthe transaction with the seller was completed that the\\n\\t\\t\\t\\tseller was responsible to him. If the transaction has\\n\\t\\t\\t\\tended and the seller has gone, the pre-condition of the\\n\\t\\t\\t\\toriginal partner is void, and he has the responsibility.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who asked another man to buy\\n\\t\\t\\t\\tcertain goods to share between them, and he wanted the\\n\\t\\t\\t\\tother man to pay for him and he would sell the goods for\\n\\t\\t\\t\\tthe other man. Malik said, \"That is not good. When he\\n\\t\\t\\t\\tsays, 'Pay for me and I will sell it for you,' it becomes\\n\\t\\t\\t\\ta loan which he makes to him in order that he sell it for\\n\\t\\t\\t\\thim and if those goods are destroyed, or pass, the man\\n\\t\\t\\t\\twho paid the price will demand from his partner what he\\n\\t\\t\\t\\tput in for him. This is part of the advance which brings\\n\\t\\t\\t\\tin profit.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"If a man buys goods, and they are settled\\n\\t\\t\\t\\tfor him, and then a man says to him, 'Share half of these\\n\\t\\t\\t\\tgoods with me, and I will sell them all for you,' that is\\n\\t\\t\\t\\thalal, there is no harm in it. The explanation of that is\\n\\t\\t\\t\\tthat this is a new sale and he sells him half of the\\n\\t\\t\\t\\tgoods provided that he sells the whole lot.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "88",
    "sectionHeading": "Bankruptcy of Debtors",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tBakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Whenever a man sells wares and then the\\n\\t\\t\\t\\tbuyer becomes bankrupt and the seller has not taken any\\n\\t\\t\\t\\tof the price and he finds some of his property intact\\n\\t\\t\\t\\twith the buyer, he is more entitled to it than anyone\\n\\t\\t\\t\\telse. If the buyer dies, then the seller is the same as\\n\\t\\t\\t\\tother creditors with respect to it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "89",
    "sectionHeading": "Bankruptcy of Debtors",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said from Abu Bakr ibn\\n\\t\\t\\t\\tMuhammad ibn Amr ibn Hazm from Umar ibn Abdal-Aziz from\\n\\t\\t\\t\\tAbu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham from\\n\\t\\t\\t\\tAbu Hurayra that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"If anyone goes bankrupt,\\n\\t\\t\\t\\tand a man finds his own property intact with him, he is\\n\\t\\t\\t\\tmore entitled to it than anyone else.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about a man who sold a man wares, and the\\n\\t\\t\\t\\tbuyer went bankrupt. He said, \"The seller takes whatever\\n\\t\\t\\t\\tof his goods he finds. If the buyer has sold some of them\\n\\t\\t\\t\\tand distributed them, the seller of the wares is more\\n\\t\\t\\t\\tentitled to them than the creditors. What the buyer has\\n\\t\\t\\t\\tdistributed does not prevent the seller from taking\\n\\t\\t\\t\\twhatever of it he finds. It is the seller's right if he\\n\\t\\t\\t\\thas received any of the price from the buyer and he wants\\n\\t\\t\\t\\tto return it to take what he finds of his wares, and in\\n\\t\\t\\t\\twhat he does not find, he is like the creditors.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik spoke about some one who bought spun wool or a plot\\n\\t\\t\\t\\tof land, and then did some work on it, like building a\\n\\t\\t\\t\\thouse on the plot of land or weaving the spun wool into\\n\\t\\t\\t\\tcloth. Then he went bankrupt after he had bought it, and\\n\\t\\t\\t\\tthe original owner of the plot said, \"I will take the\\n\\t\\t\\t\\tplot and whatever structure is on it.\" Malik said, \"That\\n\\t\\t\\t\\tstructure is not his. However, the plot and what is in it\\n\\t\\t\\t\\tthat the buyer has improved is appraised. Then one sees\\n\\t\\t\\t\\twhat the price of the plot is and how much of that value\\n\\t\\t\\t\\tis the price of the structure. They are partners in that.\\n\\t\\t\\t\\tThe owner of the plot has as much as his portion, and the\\n\\t\\t\\t\\tcreditors have the amount of the portion of the\\n\\t\\t\\t\\tstructure.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of that is that the value of\\n\\t\\t\\t\\tit all is fifteen hundred dirhams. The value of the plot\\n\\t\\t\\t\\tis five hundred dirhams, and the value of the building is\\n\\t\\t\\t\\tone thousand dirhams. The owner of the plot has a third,\\n\\t\\t\\t\\tand the creditors have two-thirds.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"It is like that with spinning and other\\n\\t\\t\\t\\tthings of the same nature in these circumstances and the\\n\\t\\t\\t\\tbuyer has a debt which he cannot pay. This is the\\n\\t\\t\\t\\tbehaviour in such cases.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for goods which have been sold and which\\n\\t\\t\\t\\tthe buyer does not improve, but those goods sell well and\\n\\t\\t\\t\\thave gone up in price, so their owner wants them and the\\n\\t\\t\\t\\tcreditors also want to seize them, then the creditors\\n\\t\\t\\t\\tchoose between giving the owner of the goods the price\\n\\t\\t\\t\\tfor which he sold them and not giving him any loss and\\n\\t\\t\\t\\tsurrendering his goods to him.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t\"If the price of the goods has gone down, the one who\\n\\t\\t\\t\\tsold them has a choice. If he likes, he can take his\\n\\t\\t\\t\\tgoods and he has no claim to any of his debtor's\\n\\t\\t\\t\\tproperty, and that is his right. If he likes, he can be\\n\\t\\t\\t\\tone of the creditors and take a portion of his due and\\n\\t\\t\\t\\tnot take his goods. That is up to him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about someone who bought a slave-girl or\\n\\t\\t\\t\\tanimal and she gave birth in his possession and the buyer\\n\\t\\t\\t\\twent bankrupt, \"The slave-girl or the animal and the\\n\\t\\t\\t\\toffspring belong to the seller unless the creditors\\n\\t\\t\\t\\tdesire it. In that case they give him his complete due\\n\\t\\t\\t\\tand they take it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "90",
    "sectionHeading": "What is Permitted Of Free Loans",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tAta ibn Yasar that Abu Rafi, the mawla of the Messenger\\n\\t\\t\\t\\tof Allah,  may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"The Messenger of Allah, may Allah bless him and grant\\n\\t\\t\\t\\thim peace, borrowed a young camel and then the camels of\\n\\t\\t\\t\\tsadaqa came to him.\" Abu Rafi said, \"He ordered me to\\n\\t\\t\\t\\trepay the man his young camel. I said, 'I can only find a\\n\\t\\t\\t\\tgood camel in its seventh year in the camels.' The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'Give it to him. The best of people are\\n\\t\\t\\t\\tthose who discharge their debts in the best manner.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "91",
    "sectionHeading": "What is Permitted Of Free Loans",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Humayd ibn Qays al-Makki that\\n\\t\\t\\t\\tMujahid said, \"Abdullah ibn Umar borrowed some dirhams\\n\\t\\t\\t\\tfrom a man, then he discharged his debt with dirhams\\n\\t\\t\\t\\tbetter than them. The man said, 'Abu Abdar-Rahman. These\\n\\t\\t\\t\\tare better than the dirhams which I lent you.' Abdullah\\n\\t\\t\\t\\tibn Umar said, 'I know that. But I am happy with myself\\n\\t\\t\\t\\tabout that.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in a person who has\\n\\t\\t\\t\\tborrowed gold, silver, food, or animals, taking to the\\n\\t\\t\\t\\tperson who lent it, something better than what he lent,\\n\\t\\t\\t\\twhen that is not a stipulation between them nor a custom.\\n\\t\\t\\t\\tIf that is by a stipulation or promise or custom, then it\\n\\t\\t\\t\\tis disapproved, and there is no good in it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"That is because the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, discharged his debt\\n\\t\\t\\t\\twith a good camel in its seventh year in place of a young\\n\\t\\t\\t\\tcamel which he borrowed, and Abdullah ibn Umar borrowed\\n\\t\\t\\t\\tsome dirhams, and repaid them with better ones. If that\\n\\t\\t\\t\\tis from the goodness of the borrower, and it is not by a\\n\\t\\t\\t\\tstipulation, promise, or custom, it is halal and there is\\n\\t\\t\\t\\tno harm in it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "92",
    "sectionHeading": "What Is Not Permitted of Free Loans",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUmar ibn al-Khattab said that he disapproved of one man\\n\\t\\t\\t\\tlending another food on the provision that he gave it\\n\\t\\t\\t\\tback to him in another city. He said, \"Where is the\\n\\t\\t\\t\\ttransport?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "93",
    "sectionHeading": "What Is Not Permitted of Free Loans",
    "text": "<p>\\n\\t\\t\\t\\tAnd Malik related to me that he had heard that a man came\\n\\t\\t\\t\\tto Abdullah ibn Umar and said, \"Abu Abd ar-Rahman, I gave\\n\\t\\t\\t\\ta man a loan and stipulated that he give me better than\\n\\t\\t\\t\\twhat I lent him.\" Abdullah ibn Umar said, \"That is\\n\\t\\t\\t\\tusury.\" Abdullah said, \"Loans are of three types: A free\\n\\t\\t\\t\\tloan which you lend by which you desire the pleasure of\\n\\t\\t\\t\\tAllah, and so you have the pleasure of Allah. A free loan\\n\\t\\t\\t\\twhich you lend by which you desire the pleasure of your\\n\\t\\t\\t\\tcompanion, so you have the pleasure of your companion,\\n\\t\\t\\t\\tand a free loan which you lend by which you take what is\\n\\t\\t\\t\\timpure by what is pure, and that is usury.\" He said,\\n\\t\\t\\t\\t\"What do you order me to do, Abu Abd ar-Rahman?\" He said,\\n\\t\\t\\t\\t\"I think that you should tear up the agreement. If he\\n\\t\\t\\t\\tgives you the like of what you lent him, accept it. If he\\n\\t\\t\\t\\tgives you less than what you lent him, take it and you\\n\\t\\t\\t\\twill be rewarded. If he gives you better than what you\\n\\t\\t\\t\\tlent him, of his own good will, that is his gratitude to\\n\\t\\t\\t\\tyou and you have the wage of the period you gave him the\\n\\t\\t\\t\\tloan.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "94",
    "sectionHeading": "What Is Not Permitted of Free Loans",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that he heard\\n\\t\\t\\t\\tAbdullah ibn Umar say, \"If someone lends something, let\\n\\t\\t\\t\\tthe only condition be that it is repaid.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "95",
    "sectionHeading": "What Is Not Permitted of Free Loans",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he had heard that Abdullah ibn\\n\\t\\t\\t\\tMasud used to say, \"If someone makes a loan, they should\\n\\t\\t\\t\\tnot stipulate better than it. Even if it is a handful of\\n\\t\\t\\t\\tgrass, it is usury.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The generally agreed on way of doing things\\n\\t\\t\\t\\tamong us is that there is no harm in borrowing any\\n\\t\\t\\t\\tanimals with a set description and itemisation, and one\\n\\t\\t\\t\\tmust return the like of them. This is not done in the\\n\\t\\t\\t\\tcase of female slaves. It is feared about that that it\\n\\t\\t\\t\\twill lead to making halal what is not halal, so it is not\\n\\t\\t\\t\\tgood. The explanation of what is disapproved of in that,\\n\\t\\t\\t\\tis that a man borrow a slave-girl and have intercourse\\n\\t\\t\\t\\twith her as seems proper to him. Then he returns her to\\n\\t\\t\\t\\ther owner. That is not good and it is not halal. The\\n\\t\\t\\t\\tpeople of knowledge still forbid it and do not give an\\n\\t\\t\\t\\tindulgence to any one in it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "96",
    "sectionHeading": "What is Forbidden of Haggling and Transactions",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Do not let any of you bid\\n\\t\\t\\t\\tagainst each other.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "97",
    "sectionHeading": "What is Forbidden of Haggling and Transactions",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Abu'z-Zinad from al-Araj from\\n\\t\\t\\t\\tAbu Hurayra that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Do not go out to meet the\\n\\t\\t\\t\\tcaravans for trade, do not bid against each other,\\n\\t\\t\\t\\toutbidding in order to raise the price, and a townsman\\n\\t\\t\\t\\tmust not buy on behalf of a man of the desert, and do not\\n\\t\\t\\t\\ttie up the udders of camels and sheep so that they appear\\n\\t\\t\\t\\tto have a lot of milk, for a person who buys them after\\n\\t\\t\\t\\tthat has two recourses open to him after he milks them.\\n\\t\\t\\t\\tIf he is pleased with them, he keeps them and if he is\\n\\t\\t\\t\\tdispleased with them, he can return them along with a sa\\n\\t\\t\\t\\tof dates.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The explanation of the words of the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, according to what we think - and Allah knows best\\n\\t\\t\\t\\t- 'do not bid against each other,' is that it is\\n\\t\\t\\t\\tforbidden for a man to offer a price over the price of\\n\\t\\t\\t\\this brother when the seller has inclined to the bargainer\\n\\t\\t\\t\\tand made conditions about the weight of the gold and he\\n\\t\\t\\t\\thas declared himself not liable for faults and such\\n\\t\\t\\t\\tthings by which it is recognised that the seller wants to\\n\\t\\t\\t\\tmake a transaction with the bargainer. This is what he\\n\\t\\t\\t\\tforbade, and Allah knows best.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm, however, in more than one\\n\\t\\t\\t\\tperson bidding against each other over goods put up for\\n\\t\\t\\t\\tsale.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe said, \"Were people to leave off haggling when the\\n\\t\\t\\t\\tfirst person started haggling, an unreal price might be\\n\\t\\t\\t\\ttaken and the disapproved would enter into the sale of\\n\\t\\t\\t\\tthe goods. This is still the way of doing things among\\n\\t\\t\\t\\tus.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "98",
    "sectionHeading": "What is Forbidden of Haggling and Transactions",
    "text": "<p>\\n\\t\\t\\t\\tMalik said, from Nafi from Abdullah ibn Umar that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade najsh.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Najsh is to offer a man more than the worth\\n\\t\\t\\t\\tof his goods when you do not mean to buy them and someone\\n\\t\\t\\t\\telse follows you in bidding.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "99",
    "sectionHeading": "Business Transactions in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Dinar\\n\\t\\t\\t\\tfrom Abdullah ibn Umar that a man mentioned to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, that he was always being cheated in business\\n\\t\\t\\t\\ttransactions. The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"When you enter a transaction,\\n\\t\\t\\t\\tsay, 'No trickery.' So whenever that man entered a\\n\\t\\t\\t\\ttransaction, he would say, 'No trickery.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "100",
    "sectionHeading": "Business Transactions in General",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that Yahya ibn Said heard Said ibn\\n\\t\\t\\t\\tal-Musayyab say, \"When you come to a land where they give\\n\\t\\t\\t\\tfull measure and full weight, stay there. When you come\\n\\t\\t\\t\\tto a land where they shorten the measure and weight, then\\n\\t\\t\\t\\tdo not stay there very long.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "101",
    "sectionHeading": "Business Transactions in General",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me from Yahya ibn Said that he heard\\n\\t\\t\\t\\tMuhammad ibn al-Munkadir say, \"Allah loves his slave who\\n\\t\\t\\t\\tis generous when he sells, and generous when he buys,\\n\\t\\t\\t\\tgenerous when he repays, and generous when he is repaid.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who bought camels or sheep or dry\\n\\t\\t\\t\\tgoods or slaves or any goods without measuring precisely,\\n\\t\\t\\t\\t\"There is no buying without measuring precisely in\\n\\t\\t\\t\\tanything which can be counted . \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said about a man who gave a man goods to sell for\\n\\t\\t\\t\\thim and set their price saying, \"If you sell them for\\n\\t\\t\\t\\tthis price as I have ordered you to do, you will have a\\n\\t\\t\\t\\tdinar (or something which he has specified, which they\\n\\t\\t\\t\\tare both satisfied with), if you do not sell them, you\\n\\t\\t\\t\\twill have nothing,\" \"There is no harm in that when he\\n\\t\\t\\t\\tnames a price to sell them at and names a known fee. If\\n\\t\\t\\t\\the sells the goods, he takes the fee, and if he does not\\n\\t\\t\\t\\tsell them, he has nothing.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"This is like saying to another man, 'If you\\n\\t\\t\\t\\tcapture my runaway slave or bring my stray camel, you\\n\\t\\t\\t\\twill have such-and-such.' This is from the category of\\n\\t\\t\\t\\treward, and not from the category of giving a wage. Had\\n\\t\\t\\t\\tit been from the category of giving a wage, it would not\\n\\t\\t\\t\\tbe good.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for a man who is given goods and told\\n\\t\\t\\t\\tthat if he sells them he will have a named percentage for\\n\\t\\t\\t\\tevery dinar, that is not good because whenever he is a\\n\\t\\t\\t\\tdinar less than the price of the goods, he decreases the\\n\\t\\t\\t\\tdue which was named for him. This is an uncertain\\n\\t\\t\\t\\ttransaction. He does not know how much he will be given.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "31",
    "hadithNumber": "102",
    "sectionHeading": "Business Transactions in General",
    "text": "<p>\\n\\t\\t\\t\\tMalik related to me that he asked Ibn Shihab about a man\\n\\t\\t\\t\\twho hired an animal, and then re-hired it out for more\\n\\t\\t\\t\\tthan what he hired it for. He said, \"There is no harm in\\n\\t\\t\\t\\tthat.\"\\n\\t\\t\\t</p>"
  }
]
