[
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "1",
    "sectionHeading": "The Sunna on Hair",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Bakr ibn Nafi\\n\\t\\t\\t\\tfrom his father Nafi from Abdullah ibn Umar that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, ordered the moustache to be trimmed and the beard\\n\\t\\t\\t\\tto be left.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "2",
    "sectionHeading": "The Sunna on Hair",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Humay\\n\\t\\t\\t\\tibn Abd ar-Rahman ibn Awf heard Muawiya ibn Abi Sufyan\\n\\t\\t\\t\\tsay from the mimbar in the year that he performed the\\n\\t\\t\\t\\thajj, holding a lock of hair (i.e. a hairpiece) which he\\n\\t\\t\\t\\ttook from one of his guards, \"People of Madina! Where are\\n\\t\\t\\t\\tyour learned men? I heard the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, forbid the like of\\n\\t\\t\\t\\tthis, saying, 'The Banu Israil were destroyed when their\\n\\t\\t\\t\\twomen started to use this.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "3",
    "sectionHeading": "The Sunna on Hair",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Ziyad ibn Sad heard\\n\\t\\t\\t\\tIbn Shihab say, \"The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, let his hair hang down his\\n\\t\\t\\t\\tforehead as Allah willed, and afterwards he parted it.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"There is no harm in a man's looking at the\\n\\t\\t\\t\\thair of his son's wife or the hair of his wife's mother.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "4",
    "sectionHeading": "The Sunna on Hair",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar disapproved of castration and said, \"The\\n\\t\\t\\t\\tcompleteness of the created form is in the testicles.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "5",
    "sectionHeading": "The Sunna on Hair",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Safwan ibn Sulaym\\n\\t\\t\\t\\theard that the Prophet, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"I and the one who guards the orphan,\\n\\t\\t\\t\\twhether for himself or for someone else, will be like\\n\\t\\t\\t\\tthese two in the Garden, when he has taqwa,\" indicating\\n\\t\\t\\t\\this middle and index fingers.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "6",
    "sectionHeading": "Caring for the Hair",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tAbu Qatada al-Ansari said to the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, \"I have a lot of\\n\\t\\t\\t\\thair which comes down to my shoulders, shall I comb it?''\\n\\t\\t\\t\\tThe Messenger of Allah. may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Yes, and honour it.\" Sometimes Abu Qatada\\n\\t\\t\\t\\toiled it twice in one day because the Messenger of Allah,\\n\\t\\t\\t\\tmay Allah bless him and grant him peace, said to him.\\n\\t\\t\\t\\t\"Honour it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "7",
    "sectionHeading": "Caring for the Hair",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tAta ibn Yasar told him that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, was in the mosque\\n\\t\\t\\t\\twhen a man came in with dishevelled hair and beard. The\\n\\t\\t\\t\\tMessenger of Allah. may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, motioned with his hand that he should be sent out\\n\\t\\t\\t\\tto groom his hair and beard. The man did so and then\\n\\t\\t\\t\\treturned. The Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, said, \"Isn't this better than that one\\n\\t\\t\\t\\tof you should come with his head dishevelled, as if he\\n\\t\\t\\t\\twere a shaytan?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "8",
    "sectionHeading": "Dyeing the Hair",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat Muhammad ibn Ibrahim at-Taymi had informed him that\\n\\t\\t\\t\\tAbu Salama ibn Abd ar-Rahman said -Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Aswad ibn Abdal-Yaghuth used to sit with us and he had\\n\\t\\t\\t\\ta white beard and hair. One day he came to us and he had\\n\\t\\t\\t\\tdyed them red, and the people said to him, 'This is\\n\\t\\t\\t\\tbetter.' He said. 'A'isha the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, sent her slave girl\\n\\t\\t\\t\\tNukhayla to me yesterday. She swore that my hair would be\\n\\t\\t\\t\\tdyed and she informed me that Abu Bakr as-Siddiq used to\\n\\t\\t\\t\\tdye his hair.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say about dyeing the hair\\n\\t\\t\\t\\tblack, 'I have not heard anything certain on that, and\\n\\t\\t\\t\\tother colours than that are preferable to me.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, -Not to dye at all is permitted, Allah\\n\\t\\t\\t\\twilling, and there is no constraint on people concerning\\n\\t\\t\\t\\tit.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say, \"There is no\\n\\t\\t\\t\\tclear indication in this hadith that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, did not\\n\\t\\t\\t\\tdye his hair. Had the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, dyed his hair, A'isha would have\\n\\t\\t\\t\\tsent a message to that effect to Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Aswad.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "9",
    "sectionHeading": "Taking Refuge",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said\\n\\t\\t\\t\\tthat he had heard that Khalid ibn al-Walid said to the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, \"I have nightmares.\" The Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said to him, \"Say,\\n\\t\\t\\t\\t'I seek refuge with the complete words of Allah from His\\n\\t\\t\\t\\tanger and His punishment and the evil of His slaves, and\\n\\t\\t\\t\\tfrom the evil suggestions of the shayatin and from their\\n\\t\\t\\t\\tbeing present (at death).' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAudhu bi kalimati' llahi't-tammati min ghadabihi wa\\n\\t\\t\\t\\tiqabihi wa sharri ibadihi wa min hamazati' sh-shayatin wa\\n\\t\\t\\t\\tan yahdurun.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "10",
    "sectionHeading": "Taking Refuge",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"When the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, was taken on the Night Journey, he saw\\n\\t\\t\\t\\tan evil jinn seeking him with a torch of fire. Whenever\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, turned, he saw him. Jibril said to him, 'Shall I\\n\\t\\t\\t\\tteach you some words to say? When you say them, his torch\\n\\t\\t\\t\\twill be put out and will fall from him.' The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'Yes, indeed.' Jibril said, 'Say, 'I seek refuge with the\\n\\t\\t\\t\\tNoble Face of Allah and with the complete words of Allah\\n\\t\\t\\t\\twhich neither the good person nor the corrupt can exceed,\\n\\t\\t\\t\\tfrom the evil of what descends from the sky and the evil\\n\\t\\t\\t\\tof what ascends in it, and from the evil of what is\\n\\t\\t\\t\\tcreated in the earth and the evil of what comes out of\\n\\t\\t\\t\\tit, and from the trials of the night and day, and from\\n\\t\\t\\t\\tthe visitations of the night and day, except for one that\\n\\t\\t\\t\\tknocks with good, O Merciful!\" \"'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAudhu bi wajhi'llahi' l-karim wa bi\\n\\t\\t\\t\\tkalimati'llahi't-tammati. Allati la yujawazu hunna barra\\n\\t\\t\\t\\twa la fajir, min sharri ma yanzil min as-sama, wa sharri\\n\\t\\t\\t\\tma yaruju fiha, wa sham ma dhara' fi'l-ard, wa sharri ma\\n\\t\\t\\t\\tyakhruju minha, wa min fitani'l-layli wa'n-nahar, wa min\\n\\t\\t\\t\\ttawariqi'l-layli wa'n-nahar illa tariqan yatruq bikhayr\\n\\t\\t\\t\\tya Rahman!\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "11",
    "sectionHeading": "Taking Refuge",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Suhayl ibn Abi Salih\\n\\t\\t\\t\\tfrom his father from Abu Hurayra that a man of the Aslam\\n\\t\\t\\t\\ttribe said, \"I did not sleep last night.\" The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, said\\n\\t\\t\\t\\tto him, \"For what reason?\" He said, \"A scorpion bit me.\"\\n\\t\\t\\t\\tThe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"Had you said in the evening, 'I seek refuge\\n\\t\\t\\t\\twith the complete words of Allah from the evil of what He\\n\\t\\t\\t\\thas created, 'it would not have happened.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAudhu bi kalimati'llahi't-tammati min sharri ma khalaq .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "12",
    "sectionHeading": "Taking Refuge",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Summayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr from al-Qa'qa ibn Hakim that Kab al-Ahbar said,\\n\\t\\t\\t\\t\"Had it not been for some words which I said, the jews\\n\\t\\t\\t\\twould have made me into a donkey.\" Someone asked him what\\n\\t\\t\\t\\tthey were. He said, \"I seek refuge with the immense Face\\n\\t\\t\\t\\tof Allah - there is nothing greater than it - and with\\n\\t\\t\\t\\tthe complete words of Allah which neither the good person\\n\\t\\t\\t\\tnor the corrupt can exceed and with all the most\\n\\t\\t\\t\\tbeautiful names of Allah, what I know of them and what I\\n\\t\\t\\t\\tdo not know, from the evil of what He has created and\\n\\t\\t\\t\\toriginated and multiplied.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAudhu bi wajhi'llahi l-adheem aladhee laysa shay'un adham\\n\\t\\t\\t\\tminh, wa bi kalimati'llahi't-tammati, alatee la yujawizu\\n\\t\\t\\t\\thunna barra wa la fajir, wa bi asma'illahi'l-husna\\n\\t\\t\\t\\tkulliha ma alamtu minha wa ma lam alam, min sharri ma\\n\\t\\t\\t\\tkhalaqa wa bara'a wa dhara'a.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "13",
    "sectionHeading": "Those who Love Each Other in Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abdullah ibn Abd\\n\\t\\t\\t\\tar-Rahman ibn Mamar from Abu'l-Hubab Said ibn Yasar that\\n\\t\\t\\t\\tAbu Hurayra said, \"The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, 'Allah, the Blessed,\\n\\t\\t\\t\\tthe Exalted, will say on the Day of Rising, \"Where are\\n\\t\\t\\t\\tthose who loved each other for My majesty? Today I will\\n\\t\\t\\t\\tshade them in My shade on the day when there is no shade\\n\\t\\t\\t\\texcept My shade.\" \"'\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "14",
    "sectionHeading": "Those who Love Each Other in Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Khubayb ibn Abd\\n\\t\\t\\t\\tar-Rahman al-Ansari from Hafs ibn Asim that either Abu\\n\\t\\t\\t\\tSaid al-Khudri or Abu Hurayra said, \"The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t'There are seven whom Allah will shade in His shade on\\n\\t\\t\\t\\tthe day on which there is no shade except His shade: a\\n\\t\\t\\t\\tjust imam, a youth who grows up worshipping Allah, a man\\n\\t\\t\\t\\twhose heart is attached to the mosque when he leaves it\\n\\t\\t\\t\\tuntil he returns to it, two men who love each other in\\n\\t\\t\\t\\tAllah and meet for that and part for that, a man who\\n\\t\\t\\t\\tremembers Allah when he is alone and his eyes overflow\\n\\t\\t\\t\\twith tears, a man who refuses the approaches of a noble,\\n\\t\\t\\t\\tbeautiful woman, saying \"I fear Allah,\" and a man who\\n\\t\\t\\t\\tgives sadaqa and conceals it so that his left hand does\\n\\t\\t\\t\\tnot know what his right hand gives.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "15",
    "sectionHeading": "Those who Love Each Other in Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Suhayl ibn Abi Salih\\n\\t\\t\\t\\tfrom his father from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, \"If\\n\\t\\t\\t\\tAllah loves a slave, he says to Jibril, 'I love\\n\\t\\t\\t\\tso-and-so, so love him,' so Jibril loves him and then\\n\\t\\t\\t\\tcalls out to the people of heaven, 'Allah loves\\n\\t\\t\\t\\tso-and-so, so love him,' and the people of heaven love\\n\\t\\t\\t\\thim, and then acceptance is placed in the Earth for him.\"\\n\\t\\t\\t\\tWhen Allah is angry with a slave, Malik said, \"I consider\\n\\t\\t\\t\\tthat he says the like of that about His anger.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu Hazim ibn Dinar\\n\\t\\t\\t\\tthat Abu Idris al-Khawlani said, \"I entered the Damascus\\n\\t\\t\\t\\tmosque and there was a young man with a beautiful mouth\\n\\t\\t\\t\\tand white teeth sitting with some people. When they\\n\\t\\t\\t\\tdisagreed about something, they referred it to him and\\n\\t\\t\\t\\tproceeded from his statement. I inquired about him, and\\n\\t\\t\\t\\tit was said, 'This is Muadh ibn Jabal.' The next day I\\n\\t\\t\\t\\twent to the noon-prayer, and I found that he had preceded\\n\\t\\t\\t\\tme to the noon prayer and I found him praying.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Idris continued, \"I waited for him until he had\\n\\t\\t\\t\\tfinished the prayer. Then I came to him from in front of\\n\\t\\t\\t\\thim and greeted him and said, 'By Allah! I love you for\\n\\t\\t\\t\\tAllah!' He said, 'By Allah?' I said, 'By Allah.' He said,\\n\\t\\t\\t\\t'By Allah?' I said, 'By Allah.' He said, 'By Allah?' I\\n\\t\\t\\t\\tsaid, 'By Allah.' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe continued, \"He took me by the upper part of my cloak\\n\\t\\t\\t\\tand pulled me to him and said, 'Rejoice! I heard the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, say, \"Allah, the Blessed and Exalted, said, 'My\\n\\t\\t\\t\\tlove is obliged for those who love each other in Me, and\\n\\t\\t\\t\\tthose who sit with each other in Me, and those who visit\\n\\t\\t\\t\\teach other in Me, and those who give to each other\\n\\t\\t\\t\\tgenerously in Me.' \" ' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "51",
    "hadithNumber": "16",
    "sectionHeading": "Those who Love Each Other in Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tAbdullah ibn Abbas said, \"Equanimity, gentleness, and\\n\\t\\t\\t\\tgood behaviour are one twenty-fifth of prophecy.\"\\n\\t\\t\\t</p>"
  }
]
