[
  {
    "SurahNumber": "33",
    "AyahNumber": "55",
    "NoteID": "3360",
    "Body": "Note how the transition is effected from the happy life\\n\\t\\t\\t\\tof Moses to the new prophetic mission."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "1",
    "NoteID": "3666",
    "Body": "The fifth year A.H. was a critical year in the external\\n\\t\\t\\t\\thistory of early Islam, and this Sura must be read in the\\n\\t\\t\\t\\tlight of the events that then took place. As explained in\\n\\t\\t\\t\\tthe Introduction, the Grand Confederacy against Islam\\n\\t\\t\\t\\tcame and invested Madinah and failed utterly. It\\n\\t\\t\\t\\tconsisted of the Makkan Unbelievers, the desert Arabs of\\n\\t\\t\\t\\tCentral Arabia, the Jews previously expelled for\\n\\t\\t\\t\\ttreachery from Madinah, the Jews remaining in Madinah and\\n\\t\\t\\t\\tthe Hypocrites led by Abdullah ibn Ubi, who have already\\n\\t\\t\\t\\tbeen described in ix. 43-110. Their bond of union was the\\n\\t\\t\\t\\tcommon hatred of Islam, and it snapped under the reverses\\n\\t\\t\\t\\tthey met with. It is important to note three points. (1)\\n\\t\\t\\t\\tThe Jews as a body now lost their last chance of bearing\\n\\t\\t\\t\\tthe standard of Islam: the best of them had already\\n\\t\\t\\t\\taccepted the renewal of Allah's Message. (2) A definite\\n\\t\\t\\t\\tstatus was given to Prophet's household, after the\\n\\t\\t\\t\\tslanders on Hadhrat Aisha had been stilled (xxiv. 11-26),\\n\\t\\t\\t\\tand the true position of the Mothers of the Believers had\\n\\t\\t\\t\\tbeen cleared. (3) A further exposition of the purity of\\n\\t\\t\\t\\tsex relation was given, based on the story of Hadhrat\\n\\t\\t\\t\\tZainab, the \"Mother of the Poor\". These points will be\\n\\t\\t\\t\\treferred to in later notes."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "2",
    "NoteID": "3667",
    "Body": "In the most adverse circumstances, in the midst of the\\n\\t\\t\\t\\tassaults of Evil, the plots of treason and hypocrisy, the\\n\\t\\t\\t\\tdarts of slanders and false charges, and stupid\\n\\t\\t\\t\\tsuperstitions and taboos, the Prophet of Allah should\\n\\t\\t\\t\\tsteer his course steadily according to Allah's Law and\\n\\t\\t\\t\\tnot fear human evil, in whatever form it appears. Men may\\n\\t\\t\\t\\tmisjudge, but Allah knows all. Men may try to overthrow\\n\\t\\t\\t\\tGood, but Wisdom is with Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "3",
    "NoteID": "3668",
    "Body": "We must wholly trust Allah; He is the true and efficient\\n\\t\\t\\t\\tGuardian of all interests. Cf. iv. 81, and n. 600."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "4",
    "NoteID": "3669",
    "Body": "\"Two hearts in his (one) breast\": two inconsistent\\n\\t\\t\\t\\tattitudes: such as serving Allah and Mammon; or\\n\\t\\t\\t\\tsubscribing to both Truth and Superstition; or\\n\\t\\t\\t\\thypocritically pretending one thing and intending\\n\\t\\t\\t\\tanother. Such a thing is against Allah's Law and Will.\\n\\t\\t\\t\\tApart from the condemnation of general hypocrisy, two\\n\\t\\t\\t\\tpagan customs of the Times of Ignorance are mentioned,\\n\\t\\t\\t\\tand their iniquity pointed out. See the notes 3670 and\\n\\t\\t\\t\\t3671."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "4",
    "NoteID": "3670",
    "Body": "This was an evil Arab custom. He pronounced words\\n\\t\\t\\t\\timporting that she was like his mother. See also lviii.\\n\\t\\t\\t\\t1-5. where this is condemned in the strongest terms and\\n\\t\\t\\t\\tpunishment is provided for it. A man sometimes said such\\n\\t\\t\\t\\twords in a fit of anger; they did not affect him, but\\n\\t\\t\\t\\tthey degraded her position."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "4",
    "NoteID": "3671",
    "Body": "If a man called another's son \"his son\", it might create\\n\\t\\t\\t\\tcomplications with natural and normal relationships if\\n\\t\\t\\t\\ttaken too literally. It is pointed out that it is only a\\n\\t\\t\\t\\tfacon de parler in men's mouths, and should not be taken\\n\\t\\t\\t\\tliterally. The truth is the truth and cannot be altered\\n\\t\\t\\t\\tby men's adopting \"sons\". \"Adoption\" in the technical\\n\\t\\t\\t\\tsense is not allowed in Muslim Law. Those who have been\\n\\t\\t\\t\\t\"wives of your sons proceeding from your loins\" are\\n\\t\\t\\t\\twithin the Prohibited Degrees of marriage; iv. 23: but\\n\\t\\t\\t\\tthis does not apply to \"adopted\" sons."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "5",
    "NoteID": "3672",
    "Body": "Freedmen were often called after their master's name as\\n\\t\\t\\t\\tthe \"son of so and so\". When they were slaves, perhaps\\n\\t\\t\\t\\ttheir father's names were lost altogether. It is more\\n\\t\\t\\t\\tcorrect to speak of them as the Maula of so and so. But\\n\\t\\t\\t\\tMaula in Arabic might also imply a close relationship of\\n\\t\\t\\t\\tfriendship: in that case, too, it is better to use the\\n\\t\\t\\t\\tright term instead of the term \"son\". \"Brother\" is not\\n\\t\\t\\t\\tobjectionable because \"Brotherhood\" is used in a wider\\n\\t\\t\\t\\tsense than \"fatherhood\" and is not likely to be\\n\\t\\t\\t\\tmisunderstood."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "5",
    "NoteID": "3673",
    "Body": "What is aimed at is to destroy the superstition of\\n\\t\\t\\t\\terecting false relationships to the detriment or loss of\\n\\t\\t\\t\\ttrue blood relations. It is not intended to penalise an\\n\\t\\t\\t\\tunintentional slip in the matter, and indeed, even if a\\n\\t\\t\\t\\tman deliberately calls another his son or father, who is\\n\\t\\t\\t\\tnot his son or father, out of politeness or affection,\\n\\t\\t\\t\\t\"Allah is Oft- Forgiving, Most Merciful\". It is the\\n\\t\\t\\t\\taction of mischievous parties which is chiefly\\n\\t\\t\\t\\treprehended, if they intend false insinuations. A mere\\n\\t\\t\\t\\tmistake on their part does not matter."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "6",
    "NoteID": "3674",
    "Body": "In human relationship the Prophet is entitled to more\\n\\t\\t\\t\\trespect and consideration than blood-relations. The\\n\\t\\t\\t\\tBelievers should follow him rather than their fathers or\\n\\t\\t\\t\\tmothers or brothers, where there is conflict of duties.\\n\\t\\t\\t\\tHe is even nearer-closer to our real interests-than our\\n\\t\\t\\t\\town selves."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "6",
    "NoteID": "3675",
    "Body": "See last note. This Sura establishes the dignity and\\n\\t\\t\\t\\tposition of the Holy Prophet's wives, who had a special\\n\\t\\t\\t\\tmission and responsibility as Mothers of the Believers.\\n\\t\\t\\t\\tThey were not to be like ordinary women: they had to\\n\\t\\t\\t\\tinstruct women in religious matters visit and minister to\\n\\t\\t\\t\\tthose who were ill or in distress, and do other kindly\\n\\t\\t\\t\\toffices in aid of the Prophet's mission."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "6",
    "NoteID": "3676",
    "Body": "In the early Madinah period, there was a bond of\\n\\t\\t\\t\\tbrotherhood between its inhabitants and the Muslims who\\n\\t\\t\\t\\tmigrated. This bond was the reason for mutual inheritance\\n\\t\\t\\t\\tbetween them. Once the stability of Muslim Ummah was\\n\\t\\t\\t\\testablished, the law of inheritance according to blood\\n\\t\\t\\t\\trelationship was revealed superceding the previous\\n\\t\\t\\t\\tbrotherhood relationship. This verse and verse No. 75 of\\n\\t\\t\\t\\tSura 8 abrogate the earlier arrangement."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "7",
    "NoteID": "3677",
    "Body": "Cf. iii. 81. There is an implied covenant on all created\\n\\t\\t\\t\\tthings to follow Allah's Law, which is the law of their\\n\\t\\t\\t\\tbeing; see v. 1. But there is a special implied convenant\\n\\t\\t\\t\\twith all Prophets, strict and solemn, that they shall\\n\\t\\t\\t\\tcarry out their mission, proclaim Allah's Truth without\\n\\t\\t\\t\\tfear or favour, and be ever ready in His service in all\\n\\t\\t\\t\\tcircumstances. That gives them their position and dignity\\n\\t\\t\\t\\tas explained in the last verse, and their tremendous\\n\\t\\t\\t\\tresponsibility in respect of the people whom they come to\\n\\t\\t\\t\\tinstruct and lead to the right Path."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "8",
    "NoteID": "3678",
    "Body": "The men to whom Allah's Truth has been committed for\\n\\t\\t\\t\\tpromulgation will be asked in the Hereafter as to how the\\n\\t\\t\\t\\tTruth fared in the world-how it was received, who opposed\\n\\t\\t\\t\\tit, and who assisted it. Like all trustees, they will\\n\\t\\t\\t\\thave to give a full account of their trust. Allah knows\\n\\t\\t\\t\\tall, and it will not add to His information. But it will\\n\\t\\t\\t\\tbe evidence for and against those to whom it was\\n\\t\\t\\t\\tpreached, so that the responsibility of those who\\n\\t\\t\\t\\tdishonoured it may be duly enforced. The primary\\n\\t\\t\\t\\tcustodians of spiritual Truth are the Prophets, but in\\n\\t\\t\\t\\tdescending degrees all men to whom Allah's Message comes\\n\\t\\t\\t\\tare included."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "9",
    "NoteID": "3679",
    "Body": "In this verse is summed up the beginning and the end of\\n\\t\\t\\t\\tthe fateful struggle of the Siege of Madinah in A.H. 5.\\n\\t\\t\\t\\tThe composition of the unhallowed Confederacy that came\\n\\t\\t\\t\\tto destroy Islam is referred to in the Introduction. They\\n\\t\\t\\t\\tcame with a force of ten to twelve thousand fighting men,\\n\\t\\t\\t\\tan unprecedented army for that time and country. The\\n\\t\\t\\t\\tbattle is known as the Battle of the Trench."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "9",
    "NoteID": "3680",
    "Body": "After a close investment of two to four weeks, during\\n\\t\\t\\t\\twhich the enemy were disheartened by their ill success,\\n\\t\\t\\t\\tthere was a piercing blast of the cold east wind. It was\\n\\t\\t\\t\\ta severe winter, and February can be a very cold month in\\n\\t\\t\\t\\tMadinah, which is about 3,000 ft. above the sea-level.\\n\\t\\t\\t\\tThe enemy's tents were torn up, their fires were\\n\\t\\t\\t\\textinguished, the sand and rain beat in their faces, and\\n\\t\\t\\t\\tthey were terrified by the portents against them. They\\n\\t\\t\\t\\thad already well nigh fallen out amongst themselves, and\\n\\t\\t\\t\\tbeating a hasty retreat, they melted away. The Madinah\\n\\t\\t\\t\\tfighting strength was no more than 3,000, and the Jewish\\n\\t\\t\\t\\ttribe of the Banu Quraiza who were in their midst was a\\n\\t\\t\\t\\tsource of weakness as they were treacherously intriguing\\n\\t\\t\\t\\twith the enemy. And further there were the Hypocrites:\\n\\t\\t\\t\\tsee n. 3666 above. But there were hidden forces that\\n\\t\\t\\t\\thelped the Muslims. Besides the forces of nature there\\n\\t\\t\\t\\twere angels, though invisible to them, who assisted the\\n\\t\\t\\t\\tMuslims."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "9",
    "NoteID": "3681",
    "Body": "Allah sees everything. Therefore we may conclude that the\\n\\t\\t\\t\\tdiscipline and moral fervour of the Muslims, as well as\\n\\t\\t\\t\\tthe enemy's insincerities, intrigues, and reliance on\\n\\t\\t\\t\\tbrute force, were all contributory causes to his repulse,\\n\\t\\t\\t\\tunder Allah's dispensation. There were many hidden causes\\n\\t\\t\\t\\twhich neither party saw clearly."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "10",
    "NoteID": "3682",
    "Body": "The psychology of the combatants is described with\\n\\t\\t\\t\\tmatchless vigour in the holy Text. The onrush of the\\n\\t\\t\\t\\tenemy was really tremendous. The Trench round Madinah was\\n\\t\\t\\t\\tbetween the defenders and the huge attacking force, which\\n\\t\\t\\t\\thad some high ground behind them \"above you\": when any of\\n\\t\\t\\t\\tthem came through the valley or over the Trench, they\\n\\t\\t\\t\\tseemed to come from below. The showers of arrows and\\n\\t\\t\\t\\tstones on both sides must also have seemed to come from\\n\\t\\t\\t\\tthe air."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "12",
    "NoteID": "3683",
    "Body": "Before this year's mass attack on Madinah the Muslims had\\n\\t\\t\\t\\tsuccessfully reached the Syrian border on the north, and\\n\\t\\t\\t\\tthere were hopes of reaching Yemen in the south. The holy\\n\\t\\t\\t\\tProphet had seen signs of expansion and victory for the\\n\\t\\t\\t\\tMuslims. Now that they were shut in within the Trench on\\n\\t\\t\\t\\tthe defensive, the Hypocrites taunted them with having\\n\\t\\t\\t\\tindulged in delusive hopes. But the event showed that the\\n\\t\\t\\t\\thopes were not delusive. They were realised beyond\\n\\t\\t\\t\\texpectations in a few years."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "13",
    "NoteID": "3684",
    "Body": "All the fighting men of Madinah had come out of the city\\n\\t\\t\\t\\tand camped in the open space between the City and the\\n\\t\\t\\t\\tTrench that had been dug all round. The disaffected\\n\\t\\t\\t\\tHypocrites sowed defeatist rumours and pretended to\\n\\t\\t\\t\\twithdraw for the defence of their homes, though their\\n\\t\\t\\t\\thomes were not exposed, and were fully covered by the\\n\\t\\t\\t\\tvigilant defensive force inside the Trench."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "14",
    "NoteID": "3685",
    "Body": "The brunt of the fighting was on the north side, but the\\n\\t\\t\\t\\twhole Trench was guarded. At one or two points enemy\\n\\t\\t\\t\\twarriors did break in within the circuit of the Trench,\\n\\t\\t\\t\\tbut they were soon disposed off. Hadhrat 'Ali\\n\\t\\t\\t\\tparticularly distinguished himself in many fights,\\n\\t\\t\\t\\twearing the Prophet's own sword and armour. If any of the\\n\\t\\t\\t\\tenemy had been able to penetrate into the City, the\\n\\t\\t\\t\\tdisaffected element, which was only sitting on the fence,\\n\\t\\t\\t\\twould have risen against the Muslims at once-with no\\n\\t\\t\\t\\tdelay except what might have been necessary to put on\\n\\t\\t\\t\\ttheir armour and arms."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "15",
    "NoteID": "3686",
    "Body": "Apparently, after the battle of Uhud, certain men who had\\n\\t\\t\\t\\tthen shown cowardice were forgiven on undertaking that\\n\\t\\t\\t\\tthey would behave better next time. A solemn promise made\\n\\t\\t\\t\\tto the Messenger of Allah is a promise to Allah, and it\\n\\t\\t\\t\\tcannot be broken with impunity."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "16",
    "NoteID": "3687",
    "Body": "The coward in a fight does not usually save himself from\\n\\t\\t\\t\\tdeath. He is subject, after desertion, to the fury both\\n\\t\\t\\t\\tof the enemy and of his own side for cowardice and\\n\\t\\t\\t\\tdesertion. Assuming that he did escape with his life,\\n\\t\\t\\t\\twhere could he go to? The brand of cowardice will be on\\n\\t\\t\\t\\thim, and he will be Subject to the vegeance of his own\\n\\t\\t\\t\\tpeople. In any case, his life would be in ignominy and\\n\\t\\t\\t\\twould be brief, and he would have lost irretrievably the\\n\\t\\t\\t\\tmeed of valour."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "17",
    "NoteID": "3688",
    "Body": "It is still worse if the cowardice or desertion is shown\\n\\t\\t\\t\\tin a Cause, which, because of the high issues of truth\\n\\t\\t\\t\\tand justice, may be called the Cause of Allah. How can\\n\\t\\t\\t\\tany one escape Allah's Punishment? And in the same way,\\n\\t\\t\\t\\thow can any one prevent another from obtaining Allah's\\n\\t\\t\\t\\tMercy by repentance and amendment? The better path,\\n\\t\\t\\t\\ttherefore, is to stand firm in Allah's Way, and if you\\n\\t\\t\\t\\tfail through human weakness, to repent and seek Allah's\\n\\t\\t\\t\\tMercy. Cf. xxxiii. 24, and n. 3698 below."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "19",
    "NoteID": "3689",
    "Body": "Ashihhatan: covetous, grasping, niggardly. Here the\\n\\t\\t\\t\\tmeaning is twofold: (1) they spare themselves in the\\n\\t\\t\\t\\tfight as compared with you; they are niggardly with\\n\\t\\t\\t\\tthemselves as against you: they contribute little either\\n\\t\\t\\t\\tin personal effort or with their money and resources; and\\n\\t\\t\\t\\t(2) they covet any gains made or booty won, on the part\\n\\t\\t\\t\\tof the real fighters."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "19",
    "NoteID": "3690",
    "Body": "In times of danger, they would look to the holy Prophet\\n\\t\\t\\t\\tfor protection, and keep themselves snugly from the\\n\\t\\t\\t\\tfight. When the danger is past, they will come and brag\\n\\t\\t\\t\\tand wrangle and show their covetousness or greed for gain\\n\\t\\t\\t\\tthough they gave of themselves but sparingly."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "19",
    "NoteID": "3691",
    "Body": "Even any good they may have done becomes vain because of\\n\\t\\t\\t\\ttheir motives of envy, greed, and covetousness, and their\\n\\t\\t\\t\\tcowardice."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "19",
    "NoteID": "3692",
    "Body": "It is not surprising that men's deeds fall as it were\\n\\t\\t\\t\\tdead because there is no pure motive behind them. For men\\n\\t\\t\\t\\tit may be difficult to probe motives, but it is easy for\\n\\t\\t\\t\\tAllah, Whom hypocrisy or false show can never deceive."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "20",
    "NoteID": "3693",
    "Body": "This completes the picture of the psychology of the\\n\\t\\t\\t\\tHypocrites, begun at verse 12. Let us analyse it. (1)\\n\\t\\t\\t\\tWhen they first saw the enemy they were already in a\\n\\t\\t\\t\\tdefeatist mood, and thought all was over (verse 12). (2)\\n\\t\\t\\t\\tNot content with disloyalty themselves, they tried to\\n\\t\\t\\t\\tinfect others, who made paltry excuses to withdraw from\\n\\t\\t\\t\\tthe fight (verse 13). (3) They were ready to betray the\\n\\t\\t\\t\\tCity to the enemy if once the enemy had gained entrance\\n\\t\\t\\t\\t(verse 14). (4) They forgot all the promises of fidelity\\n\\t\\t\\t\\twhich they had previously sworn (verse 15). (5) In their\\n\\t\\t\\t\\tpaltry calculations they forgot that cowardice in war\\n\\t\\t\\t\\tdoes not pay (verses 16-17). (6) Without taking much part\\n\\t\\t\\t\\tin the actual defence, they were ready to talk glibly and\\n\\t\\t\\t\\tclaim a lion's share in the fruits of the victory (verses\\n\\t\\t\\t\\t18-19). (7) Even when the enemy had withdrawn, their\\n\\t\\t\\t\\tcowardly minds were still afraid that the enemy would\\n\\t\\t\\t\\treturn, and were already meditating what they would do in\\n\\t\\t\\t\\tthat case: perhaps they would dwell in the deserts and\\n\\t\\t\\t\\tspy on Madinah from a safe distance; and if caught in\\n\\t\\t\\t\\tMadinah they would fight little and intrigue much. It was\\n\\t\\t\\t\\ta miracle that with such men in their midst, the holy\\n\\t\\t\\t\\tProphet and his band won through."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "21",
    "NoteID": "3694",
    "Body": "We now have the psychology of the Believers,-God-fearing\\n\\t\\t\\t\\tmen, led by that pattern of men and of leaders, Muhammad\\n\\t\\t\\t\\tAl-Mustafa."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "21",
    "NoteID": "3695",
    "Body": "Cf. xxvi. 227: see especially the last clause of that\\n\\t\\t\\t\\tverse in a Makkan Sura, which was amply fulfilled in\\n\\t\\t\\t\\tMadinah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "22",
    "NoteID": "3696",
    "Body": "This is in contrast to what the Hypocrites said in verse\\n\\t\\t\\t\\t12 above. The divine promise of help and success is\\n\\t\\t\\t\\tcontigent upon our striving and faith. Nothing comes to\\n\\t\\t\\t\\tthe poltroon and the sceptical idler. Dangers and\\n\\t\\t\\t\\tdifficulties, and conflict with Evil, are foretold us,\\n\\t\\t\\t\\tand we must meet them with fortitude and courage."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "23",
    "NoteID": "3697",
    "Body": "In the fight for truth were (and are) many who sacrificed\\n\\t\\t\\t\\ttheir all-resources, knowledge, influence, life itself-in\\n\\t\\t\\t\\tthe Cause, and never wavered. If they won the crown of\\n\\t\\t\\t\\tmartyrdom, they were blessed. Such a one was Sad ibn\\n\\t\\t\\t\\tMu'az, the chief of the Aus tribe, the intrepid\\n\\t\\t\\t\\tstandard-bearer of Islam, who died of a wound he had\\n\\t\\t\\t\\treceived in the Battle of the Trench. Other heroes fought\\n\\t\\t\\t\\tvaliantly and lived, always ready to lay down their\\n\\t\\t\\t\\tlives. Both classes were staunch: they never changed or\\n\\t\\t\\t\\twavered."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "24",
    "NoteID": "3698",
    "Body": "Before Allah's Mercy there is always room for repentance\\n\\t\\t\\t\\tand forgiveness, even after treason and crime; but the\\n\\t\\t\\t\\tforgiveness will be according to Allah's Will and Plan,\\n\\t\\t\\t\\twhich will judge the penitent's sincerity and capacity\\n\\t\\t\\t\\tfor good to the nicest degree in his favour. Cf. also\\n\\t\\t\\t\\txxxiii. 17 above."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "25",
    "NoteID": "3699",
    "Body": "In spite of the mighty preparations and the great forces\\n\\t\\t\\t\\twhich the Makkans in concert with the Central Arabian\\n\\t\\t\\t\\tBedouins, the discontented Jews, and the treacherous\\n\\t\\t\\t\\tHypocrites, brought to the siege of Madinah, all their\\n\\t\\t\\t\\tplans were frustrated. Their fury availed them nothing.\\n\\t\\t\\t\\tThey departed in hot haste. This was their last and dying\\n\\t\\t\\t\\teffort. The initiative thereafter lay with the forces of\\n\\t\\t\\t\\tIslam."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "25",
    "NoteID": "3700",
    "Body": "For the meaning of Aziz, see n. 2818 to xxii. 40"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "26",
    "NoteID": "3701",
    "Body": "The reference is to the Jewish tribe of the Banu Quraiza.\\n\\t\\t\\t\\tThey counted among the citizens of Madinah and were bound\\n\\t\\t\\t\\tby solemn engagements to help in the defence of the City.\\n\\t\\t\\t\\tBut on the occasion of the Confederate siege by the\\n\\t\\t\\t\\tQuraish and their allies they intrigued with the enemies\\n\\t\\t\\t\\tand treacherously aided them. Immediately after the siege\\n\\t\\t\\t\\twas raised and the Confederates had fled in hot haste,\\n\\t\\t\\t\\tthe Prophet turned his attention to these treacherous\\n\\t\\t\\t\\t\"friends\" who had betrayed his City in the hour of\\n\\t\\t\\t\\tdanger."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "26",
    "NoteID": "3702",
    "Body": "The Banu Quraiza (see last note) were filled with terror\\n\\t\\t\\t\\tand dismay when Madinah was free from the Quraish danger.\\n\\t\\t\\t\\tThey shut themselves up in their castles about three or\\n\\t\\t\\t\\tfour miles to the east (or north east) of Madinah, and\\n\\t\\t\\t\\tsustained a siege of 25 days, after which they\\n\\t\\t\\t\\tsurrendered, stipulating that they would abide by the\\n\\t\\t\\t\\tdecision of their fate at the hands of Sad ibn Mu'az,\\n\\t\\t\\t\\tchief of the Aus tribe, with which they had been in\\n\\t\\t\\t\\talliance."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "26",
    "NoteID": "3703",
    "Body": "Sad applied to them the Jewish Law of the Old Testament,\\n\\t\\t\\t\\tnot as strictly as the case warranted. In Deut. xx.\\n\\t\\t\\t\\t10-18, the treatment of a city \"which is very far off\\n\\t\\t\\t\\tfrom thee\" is prescribed to be comparatively more lenient\\n\\t\\t\\t\\tthan the treatment of a city \"of those people, which the\\n\\t\\t\\t\\tLord thy God does give thee for an inheritance,\" i.e.,\\n\\t\\t\\t\\twhich is near enough to corrupt the religion of the\\n\\t\\t\\t\\tJewish people. The punishment for these is total\\n\\t\\t\\t\\tannihilation: \"thou shalt save alive nothing that\\n\\t\\t\\t\\tbreatheth\" (Deut. xx. 16). The more lenient treatment for\\n\\t\\t\\t\\tfar-off cities is described in the next note. According\\n\\t\\t\\t\\tto the Jewish standard, then, the Banu Quraiza deserved\\n\\t\\t\\t\\ttotal extermination-of men, women, and children. They\\n\\t\\t\\t\\twere in the territory of Madinah itself, and further they\\n\\t\\t\\t\\thad broken their engagements and helped the enemy."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "26",
    "NoteID": "3704",
    "Body": "Sad adjudged them the milder treatment of the \"far-off\"\\n\\t\\t\\t\\tcities which is thus described in the Jewish Law: \"Thou\\n\\t\\t\\t\\tshalt smite every male thereof with the edge of the\\n\\t\\t\\t\\tsword: but the women and the little ones, and the cattle,\\n\\t\\t\\t\\tand all that is in the city, even all the spoil thereof,\\n\\t\\t\\t\\tshalt thou take unto thyself, and thou shalt eat the\\n\\t\\t\\t\\tspoil of thine enemies, which the Lord thy God hath given\\n\\t\\t\\t\\tthee\" (Deut. xx. 13-14). The men of the Quraiza were\\n\\t\\t\\t\\tslain: the women were sold as captives of war; and their\\n\\t\\t\\t\\tlands and properties were divided among the Muhijirs."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "27",
    "NoteID": "3705",
    "Body": "This part of the Sura is considered a prophecy. It may\\n\\t\\t\\t\\trefer to the conquest of Khaibar. Khaibar is a Harrat or\\n\\t\\t\\t\\tvolcanic tract, well-watered with many springs issuing\\n\\t\\t\\t\\tfrom its basaltic rocks. It has a good irrigation system\\n\\t\\t\\t\\tand produces good harvests of grain and dates in its wet\\n\\t\\t\\t\\tvalleys, while the outcrop of rocks in the high ground\\n\\t\\t\\t\\taffords sites for numerous fortresses. In the holy\\n\\t\\t\\t\\tProphet's time there were Jewish colonies settled here,\\n\\t\\t\\t\\tbut they were a source of constant trouble especially\\n\\t\\t\\t\\tafter Siege of Madinah. It became a nest of all the\\n\\t\\t\\t\\thostile Jewish elements expelled for their treachery from\\n\\t\\t\\t\\telsewhere. Its capital, Khaibar, is about 90 miles due\\n\\t\\t\\t\\tnorth of Madinah. Its inhabitants offered some\\n\\t\\t\\t\\tresistance, and Hadhrat 'Ali, though he had just risen\\n\\t\\t\\t\\tfrom a bed of illness, performed prodigies of valour.\\n\\t\\t\\t\\tAfter its surrender, a land settlement was made, which\\n\\t\\t\\t\\tretained the cultivators of the soil on the land, but\\n\\t\\t\\t\\tbrought them under control, so that no further focus of\\n\\t\\t\\t\\tactive hostility should remain near Madinah. The terms of\\n\\t\\t\\t\\tthe settlement will be found in Waqidi."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "28",
    "NoteID": "3706",
    "Body": "We now come to the subject of the position of the\\n\\t\\t\\t\\tConsorts of Purity (azwaj mutahharat), the wives of the\\n\\t\\t\\t\\tholy Prophet. Their position was not like that of\\n\\t\\t\\t\\tordinary women or ordinary wives. They had special duties\\n\\t\\t\\t\\tand responsibilities. The only youthful marriage of the\\n\\t\\t\\t\\tholy Prophet was his first marriage-that with Hadhrat\\n\\t\\t\\t\\tKhadija, the best of women and the best of wives. He\\n\\t\\t\\t\\tmarried her fifteen years before he received his call to\\n\\t\\t\\t\\tProphethood; their married life lasted for twenty-five\\n\\t\\t\\t\\tyears, and their mutual devotion was of the noblest,\\n\\t\\t\\t\\tjudged by spiritual as well as social standards. During\\n\\t\\t\\t\\ther life he had no other wife, which was unusual for a\\n\\t\\t\\t\\tman of his standing among his people. When she died, his\\n\\t\\t\\t\\tage was 50, and but for two considerations, he would\\n\\t\\t\\t\\tprobably never have married again, as he was most\\n\\t\\t\\t\\tabstemious in his physical life. The two considerations\\n\\t\\t\\t\\twhich governed his later marriages were: (1) compassion\\n\\t\\t\\t\\tand clemency, as when he wanted to provide for suffering\\n\\t\\t\\t\\twidows, who could not be provided for in any other way in\\n\\t\\t\\t\\tthat stage of society; some of them, like Sauda, had\\n\\t\\t\\t\\tissue by their former marriage, requiring protection; (2)\\n\\t\\t\\t\\thelp in his duties of leadership, with women, who had to\\n\\t\\t\\t\\tbe instructed and kept together in the large Muslim\\n\\t\\t\\t\\tfamily, where women and men had similar social rights.\\n\\t\\t\\t\\tHadhrat Aisha, daughter of Hadhrat Abu Bakr, was clever\\n\\t\\t\\t\\tand learned, and in Hadith she is an important authority\\n\\t\\t\\t\\ton the life of the Prophet. Hadhrat Zainab, daughter of\\n\\t\\t\\t\\tKhuzaima, was specially devoted to the poor; she was\\n\\t\\t\\t\\tcalled the \"Mother of the Poor\". The other Zainab,\\n\\t\\t\\t\\tdaughter of Jahsh, also worked for the poor, for whom she\\n\\t\\t\\t\\tprovided from the proceeds of her manual work, as she was\\n\\t\\t\\t\\tskillful in leather work. But all the Consorts in their\\n\\t\\t\\t\\thigh position had to work and assist as Mothers of the\\n\\t\\t\\t\\tUmmat. Theirs were not idle lives, like those of\\n\\t\\t\\t\\tOdalisques, either for their own pleasure or the pleasure\\n\\t\\t\\t\\tof their husband. They are told here that they had no\\n\\t\\t\\t\\tplace in the sacred Household if they merely wished for\\n\\t\\t\\t\\tease or worldly glitter. If such were the case, they\\n\\t\\t\\t\\tcould be divorced and amply provided for."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "29",
    "NoteID": "3707",
    "Body": "They were all well-doers. But being in their exalted\\n\\t\\t\\t\\tposition, they had extra responsibility, and they had to\\n\\t\\t\\t\\tbe specially careful to discharge it. In the same way\\n\\t\\t\\t\\ttheir reward would be \"great\", for higher services bring\\n\\t\\t\\t\\thigher spiritual satisfaction, though they were asked to\\n\\t\\t\\t\\tdeny themselves some of the ordinary indulgences of this\\n\\t\\t\\t\\tlife."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "30",
    "NoteID": "3708",
    "Body": "\"Evident unseemly conduct\" i.e., proved misconduct, as\\n\\t\\t\\t\\topposed to false slanders from enemies. Such slanders\\n\\t\\t\\t\\twere of no account, but if any of them had behaved in an\\n\\t\\t\\t\\tunseemly manner, it would have been a worse offence than\\n\\t\\t\\t\\tin the case of ordinary women, on account of their\\n\\t\\t\\t\\tspecial position. Of course none of them were in the\\n\\t\\t\\t\\tleast guilty."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "30",
    "NoteID": "3709",
    "Body": "Cf. xxxiii. 19 and n. 3692. The punishment in this life\\n\\t\\t\\t\\tfor a married woman's unchastity is very severe: for\\n\\t\\t\\t\\tfornication, public flogging with a hundred stripes,\\n\\t\\t\\t\\tunder xxiv. 2; or for lewdness (see iv. 15) imprisonment;\\n\\t\\t\\t\\tor stoning to death for adultery, according to certain\\n\\t\\t\\t\\tprecedents established in Canon Law. But here the\\n\\t\\t\\t\\tquestion is not about this kind of punishment or this\\n\\t\\t\\t\\tkind of offence. Even minor indiscretions, in the case of\\n\\t\\t\\t\\twomen who were patterns of decorum, would have been\\n\\t\\t\\t\\treprehensible; and the punishment in the Hereafter is on\\n\\t\\t\\t\\ta higher plane, which we can scarcely understand."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "31",
    "NoteID": "3710",
    "Body": "Twice, i.e., once as a righteous woman, and again as a\\n\\t\\t\\t\\tMother of the Believers, serving the believing women and\\n\\t\\t\\t\\tthus showing her devotion to Allah and His Apostle."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "31",
    "NoteID": "3711",
    "Body": "Sustenance: all that is necessary to sustain her in\\n\\t\\t\\t\\thappiness in her future life."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "32",
    "NoteID": "3712",
    "Body": "This is the core of the whole passage. The Prophet's\\n\\t\\t\\t\\tConsorts were not like ordinary women, nor was their\\n\\t\\t\\t\\tmarriage an ordinary marriage, in which only personal or\\n\\t\\t\\t\\tsocial considerations enter. They had a special position\\n\\t\\t\\t\\tand special responsibilities, in the matter of guiding\\n\\t\\t\\t\\tand instructing women who came into the fold of Islam.\\n\\t\\t\\t\\tIslam is a Way of Life, and the Muslims are a family:\\n\\t\\t\\t\\twomen have as much place in Islam as men, and their\\n\\t\\t\\t\\tintimate instruction must obviously be through women."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "32",
    "NoteID": "3713",
    "Body": "While they were to be kind and gentle to all, they were\\n\\t\\t\\t\\tto be guarded on account of their special position lest\\n\\t\\t\\t\\tpeople might misunderstand or take advantage of their\\n\\t\\t\\t\\tkindness. They were to make no vulgar worldly displays as\\n\\t\\t\\t\\tin the times of Paganism."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "33",
    "NoteID": "3714",
    "Body": "Obedience to Allah's Law sums up all duties. Regular\\n\\t\\t\\t\\tPrayer (seeking nearness to Allah) and Regular Charity\\n\\t\\t\\t\\t(doing good to fellow-creatures) are mentioned as special\\n\\t\\t\\t\\tfeatures of our Religion."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "33",
    "NoteID": "3715",
    "Body": "Ahl al-Bait: i.e. the household of the Prophet (S.A.S)\\n\\t\\t\\t\\twhich includes his wives as well as his daughter Fatima,\\n\\t\\t\\t\\this son-in-law Ali and his grandsons, Hasan and Husain\\n\\t\\t\\t\\tgenerally in accordance with the narrative of Umm Salama."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "34",
    "NoteID": "3716",
    "Body": "The verb is uzkurna, feminine gender, as referring to the\\n\\t\\t\\t\\tAzwaj again. It means not only \"remember\", but \"recite\",\\n\\t\\t\\t\\t\"teach\", \"make known\", \"publish\", the Message which ye\\n\\t\\t\\t\\tlearn at home from the holy Prophet, the fountain of\\n\\t\\t\\t\\tspiritual knowledge. The \"Signs of Allah\" refer specially\\n\\t\\t\\t\\tto the verses of the Qur-an, and Wisdom to the resulting\\n\\t\\t\\t\\tInstruction derived therefrom."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "34",
    "NoteID": "3717",
    "Body": "Cf. xxii. 63 and n. 2844. Allah's understanding is\\n\\t\\t\\t\\tperfect in every detail, however minute. Therefore use\\n\\t\\t\\t\\tHis Revelation for every phase of life."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "35",
    "NoteID": "3718",
    "Body": "Islam, or submitting our will to Allah's Will, includes\\n\\t\\t\\t\\tall the virtues, as particularly specified in this verse.\\n\\t\\t\\t\\tSee n. 3720."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "35",
    "NoteID": "3719",
    "Body": "A number of Muslim virtues are specified here, but the\\n\\t\\t\\t\\tchief stress is laid on the fact that these virtues are\\n\\t\\t\\t\\tas necessary to women as to men. Both sexes have\\n\\t\\t\\t\\tspiritual as well as human rights and duties in an equal\\n\\t\\t\\t\\tdegree, and the future \"reward\" of the Hereafter."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "35",
    "NoteID": "3720",
    "Body": "The virtues referred to are: (1) Faith, hope, and trust\\n\\t\\t\\t\\tin Allah, and in His benevolent government of the world;\\n\\t\\t\\t\\t(2) devotion and service in practical life; (3) love and\\n\\t\\t\\t\\tpractice of truth, in thought and intention, word and\\n\\t\\t\\t\\tdeed; (4) patience and constancy, in suffering and in\\n\\t\\t\\t\\tright endeavour; (5) humility, the avoidance of an\\n\\t\\t\\t\\tattitude of arrogance and superiority; (6) charity, i.e.,\\n\\t\\t\\t\\thelp to the poor and unfortunate ones in life, a special\\n\\t\\t\\t\\tvirtue arising out of the general duty of service (No.\\n\\t\\t\\t\\t2); (7) self-control, typically in food, but generally in\\n\\t\\t\\t\\tall appetites; (8) chastity, purity in sex life, purity\\n\\t\\t\\t\\tin motive, thought, word, and deed; and (9) constant\\n\\t\\t\\t\\tattention to Allah's Message, and cultivation of the\\n\\t\\t\\t\\tdesire to get nearer to Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "36",
    "NoteID": "3721",
    "Body": "We must not put our own wisdom in competition with\\n\\t\\t\\t\\tAllah's wisdom. Allah's decree is often known to us by\\n\\t\\t\\t\\tthe logic of facts. We must accept it loyally, and do the\\n\\t\\t\\t\\tbest we can to help in our own way to carry it out. We\\n\\t\\t\\t\\tmust make our will consonant to the Allah's Will."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "3722",
    "Body": "This was Zaid son of Haritha, one of the first to accept\\n\\t\\t\\t\\tthe faith of Islam. He was a freedman of the holy\\n\\t\\t\\t\\tProphet, who loved him as a son and gave him in marriage\\n\\t\\t\\t\\this own cousin Zainab. The marriage however turned out to\\n\\t\\t\\t\\tbe unhappy. See next note."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "3723",
    "Body": "Zaid's marriage with the Prophet's cousin Zainab daughter\\n\\t\\t\\t\\tof Jahsh did not turn out happy. Zainab the high-born\\n\\t\\t\\t\\tlooked down upon Zaid the freedman who had been a slave.\\n\\t\\t\\t\\tAnd he was not comely to look at. Both were good people\\n\\t\\t\\t\\tin their own way, and both loved the Prophet, but there\\n\\t\\t\\t\\twas mutual incompatibility and this is fatal to married\\n\\t\\t\\t\\tlife. Zaid wished to divorce her, but the Prophet asked\\n\\t\\t\\t\\thim to hold his hand, and he obeyed. She was closely\\n\\t\\t\\t\\trelated to the Prophet; he had given a handsome marriage\\n\\t\\t\\t\\tgift on her marriage to Zaid; and people would certainly\\n\\t\\t\\t\\ttalk if such a marriage was broken off. But marriages are\\n\\t\\t\\t\\tmade on earth, not in heaven, and it is no part of\\n\\t\\t\\t\\tAllah's Plan to torture people in a bond which should be\\n\\t\\t\\t\\ta source of happiness but actually is a source of misery.\\n\\t\\t\\t\\tZaid's wish-indeed the mutual wish of the couple-was for\\n\\t\\t\\t\\tthe time being put away, but it became eventually an\\n\\t\\t\\t\\testablished fact, and everybody came to know of it."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "3724",
    "Body": "All actual facts are referred to Allah. When the marriage\\n\\t\\t\\t\\tis unhappy, Islam permits the bond to be dissolved,\\n\\t\\t\\t\\tprovided that all interests concerned are safeguarded.\\n\\t\\t\\t\\tApparently there was no issue here to be considered.\\n\\t\\t\\t\\tZainab had to be considered, and she obtained the dearest\\n\\t\\t\\t\\twish of her heart in being raised to be a Mother of the\\n\\t\\t\\t\\tBelievers, with all the dignity and responsibility of\\n\\t\\t\\t\\tthat position. See n. 3706 to xxxiii. 28 above."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "3725",
    "Body": "The Iddat or period of waiting after divorce (ii. 228,\\n\\t\\t\\t\\tand n. 254) was duly completed."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "37",
    "NoteID": "3726",
    "Body": "The Pagan superstition and taboo about adopted sons had\\n\\t\\t\\t\\tto be destroyed. See xxxiii. 4-5 and notes 3671-3672\\n\\t\\t\\t\\tabove."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "38",
    "NoteID": "3727",
    "Body": "See n. 3724 above."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "38",
    "NoteID": "3728",
    "Body": "The next clause is parenthetical. These words then\\n\\t\\t\\t\\tconnect on with verse 39. Among the people of the Book\\n\\t\\t\\t\\tthere was no taboo about adopted sons, as there was in\\n\\t\\t\\t\\tPagan Arabia."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "38",
    "NoteID": "3729",
    "Body": "Allah's ordering of the world is always full of wisdom.\\n\\t\\t\\t\\tEven our unhappiness and misery may actually have a great\\n\\t\\t\\t\\tmeaning for ourselves or others or both. If our first\\n\\t\\t\\t\\tPlan seems to fail, we must not murmur and repine, but\\n\\t\\t\\t\\tretrieve the position by adopting a course which appears\\n\\t\\t\\t\\tto be the best possible in the light of our duties as\\n\\t\\t\\t\\tindicated by Allah. For Allah's Plan is framed on\\n\\t\\t\\t\\tuniversal principles that cannot be altered by human\\n\\t\\t\\t\\taction."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "39",
    "NoteID": "3730",
    "Body": "Our responsibility is to Allah, not to men. Men's\\n\\t\\t\\t\\topinions may have a bearing on our own interpretation of\\n\\t\\t\\t\\tduty, but when that duty is clear, our only course is to\\n\\t\\t\\t\\tobey Allah rather than men."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "40",
    "NoteID": "3731",
    "Body": "When a document is sealed, it is complete, and there can\\n\\t\\t\\t\\tbe no further addition. The holy Prophet Muhammad closed\\n\\t\\t\\t\\tthe long line of Messengers. Allah's teaching is and will\\n\\t\\t\\t\\talways be continuous, but there has been and will be no\\n\\t\\t\\t\\tProphet after Muhammad. The later ages will want thinkers\\n\\t\\t\\t\\tand reformers, not Prophets. This is not an arbitrary\\n\\t\\t\\t\\tmatter. It is a decree full of knowledge and wisdom: \"for\\n\\t\\t\\t\\tAllah has full knowledge of all things.\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "43",
    "NoteID": "3732",
    "Body": "Blessings: good wishes and mercies. Allah wishes well to\\n\\t\\t\\t\\tall His creatures, and His angels carry out His work, for\\n\\t\\t\\t\\ttheir will is in all things His Will. His chief and\\n\\t\\t\\t\\teverlasting blessing is that He gives us a knowledge of\\n\\t\\t\\t\\tthe spiritual world, and helps us towards its attainment."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "43",
    "NoteID": "3733",
    "Body": "His Mercies are for all His creatures, but for those who\\n\\t\\t\\t\\tbelieve and trust in Him, there are special mercies, \"a\\n\\t\\t\\t\\tgenerous Reward\" as in the next verse."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "45",
    "NoteID": "3734",
    "Body": "The Prophet was sent by Allah in five capacities. Three\\n\\t\\t\\t\\tare mentioned in this verse, and the other two in the\\n\\t\\t\\t\\tverse following. (1) He comes as a Witness to all men\\n\\t\\t\\t\\tabout the spiritual truths which had been obscured by\\n\\t\\t\\t\\tignorance or superstition, or by the dust of sectarian\\n\\t\\t\\t\\tcontroversy. He did not come to establish a new religion\\n\\t\\t\\t\\tor sect. He came to teach Religion. He is also a witness\\n\\t\\t\\t\\tto Allah about men's doings and how they receive Allah's\\n\\t\\t\\t\\tMessage: see iv. 41 and n. 560. (2) He comes as a bearer\\n\\t\\t\\t\\tof the Glad Tidings of the Mercy of Allah. No matter how\\n\\t\\t\\t\\tfar men may have transgressed, they have hope if they\\n\\t\\t\\t\\tbelieve, repent, and live a good life. (3) He also comes\\n\\t\\t\\t\\tas a Warner to those who are heedless. This life will not\\n\\t\\t\\t\\tlast. There is a Future Life, and that is all-important.\\n\\t\\t\\t\\tSee next note."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "46",
    "NoteID": "3735",
    "Body": "See last note. The two other capacities in which the\\n\\t\\t\\t\\tProphet was sent are here specified. (4) He comes as one\\n\\t\\t\\t\\twho has a right to invite all men to repentance and the\\n\\t\\t\\t\\tforgiveness of sins: but he does this, not of his own\\n\\t\\t\\t\\tauthority, but by the permission and authority given to\\n\\t\\t\\t\\thim by Allah. This is said lest people may deify the\\n\\t\\t\\t\\tProphet as they did with other Prophets before him. The\\n\\t\\t\\t\\tpersonal responsibility of each individual remains, but\\n\\t\\t\\t\\tthe Prophet can lead him on the Right and help him. (5)\\n\\t\\t\\t\\tThe Prophet also comes as a Light or a Lamp (Siraj) to\\n\\t\\t\\t\\tilluminate the whole world. In lxxi. 16 and elsewhere the\\n\\t\\t\\t\\tsame word (Siraj) is used for the sun. The comparison is\\n\\t\\t\\t\\tapt. When the sun appears, all the lesser lights pale\\n\\t\\t\\t\\tbefore its light. And the Message of Islam, i.e., of the\\n\\t\\t\\t\\tUniversal Religion, is to diffuse Light everywhere."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "47",
    "NoteID": "3736",
    "Body": "The light of Islam is the Biggest Bounty possible and if\\n\\t\\t\\t\\tthey truly understand it, they should glory in it."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "48",
    "NoteID": "3737",
    "Body": "Men of little or no Faith will often lay down the law and\\n\\t\\t\\t\\ttell better men than themselves what to do. In case of\\n\\t\\t\\t\\trefusal they shower insults and injuries. No attention is\\n\\t\\t\\t\\tto be paid to them. It is their way. All will be right\\n\\t\\t\\t\\tunder the government of Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "49",
    "NoteID": "3738",
    "Body": "See n. 254 to ii. 228. The Iddat counts for three monthly\\n\\t\\t\\t\\tcourses, or if there are no courses, for three months:\\n\\t\\t\\t\\tsee lxv. 4."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "49",
    "NoteID": "3739",
    "Body": "This present is held, by some, to be in addition to the\\n\\t\\t\\t\\thalf dower due to them under ii. 237. If the dower had\\n\\t\\t\\t\\tnot yet been fixed, the gift would presumably be larger,\\n\\t\\t\\t\\tand it would absorb the gift prescribed in ii. 236."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "49",
    "NoteID": "3740",
    "Body": "The gifts should be given with good grace, and the\\n\\t\\t\\t\\tfreedom of the woman should not be interfered with in any\\n\\t\\t\\t\\tway. If she chooses to marry again immediately, no\\n\\t\\t\\t\\tobstacle should be placed in her path. On no pretext\\n\\t\\t\\t\\tshould she be allowed to remain doubtful about her\\n\\t\\t\\t\\tfreedom."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "3741",
    "Body": "This introduces no new exemption or privilege. Verses\\n\\t\\t\\t\\t50-52 merely declare the points in which, on account of\\n\\t\\t\\t\\tthe special circumstances (see n. 3706 above), the\\n\\t\\t\\t\\tProphet's marriages differed from those of ordinary\\n\\t\\t\\t\\tMuslims. This is considered under four heads, which we\\n\\t\\t\\t\\tshall examine in the four notes following."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "3742",
    "Body": "Head 1. Marriage with dower (iv. 4): this is the\\n\\t\\t\\t\\tuniversal Muslim marriage. The difference in the\\n\\t\\t\\t\\tProphet's case was that there was no limitation to the\\n\\t\\t\\t\\tnumber of four (iv. 3), and women of the People of the\\n\\t\\t\\t\\tBook (v. 6) were not among his wives, but only Believers.\\n\\t\\t\\t\\tThese points are not expressly mentioned here, but are\\n\\t\\t\\t\\tinferred by his actual practice. Obviously women who are\\n\\t\\t\\t\\texpected to instruct other women in Islam must be\\n\\t\\t\\t\\tMuslims."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "3743",
    "Body": "Head 2. Women Prisoners of War: the same remark as in the\\n\\t\\t\\t\\tlast note."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "3744",
    "Body": "Head 3. These are first cousins, and not within the\\n\\t\\t\\t\\tProhibited Degrees of Marriage (see iv. 23-24). These are\\n\\t\\t\\t\\tspecially mentioned here by way of limitation. None of\\n\\t\\t\\t\\tthem could marry the Prophet unless she had performed the\\n\\t\\t\\t\\tHijrat with him."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "3745",
    "Body": "Head 4. A believing woman who gives herself to the\\n\\t\\t\\t\\tProphet: obviously this case, like the last, is only\\n\\t\\t\\t\\tapplicable to the Prophet, and it is hedged round with\\n\\t\\t\\t\\tthe limitation that the Prophet considers it suitable."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "3746",
    "Body": "The ordinary law of Muslim marriage will be found chiefly\\n\\t\\t\\t\\tin ii. 221-235, iv. 19-25, iv. 34-35, and v. 6."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "3747",
    "Body": "The words \"this only for thee ... right hands possess\"\\n\\t\\t\\t\\tare parenthetical, and the words \"in order that...\"\\n\\t\\t\\t\\tconnect on with the previous clauses beginning with \"O\\n\\t\\t\\t\\tProphet, We have made lawful .... wishes to wed her\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "50",
    "NoteID": "3748",
    "Body": "Marriage is an important relationship not only in our\\n\\t\\t\\t\\tphysical life, but in our moral and spiritual life, and\\n\\t\\t\\t\\tits effects extend not only to the parties themselves but\\n\\t\\t\\t\\tto children and future generations, A number of special\\n\\t\\t\\t\\tproblems arise according to special circumstances. Every\\n\\t\\t\\t\\tman and woman must seriously consider all sides of the\\n\\t\\t\\t\\tquestion and must do the best in his or her power to\\n\\t\\t\\t\\ttemper instincts and inclinations with wisdom and\\n\\t\\t\\t\\tguidance from Allah. Allah wishes to make every one's\\n\\t\\t\\t\\tpath easy, for He is indeed \"Oft-Forgiving, Most\\n\\t\\t\\t\\tMerciful\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "51",
    "NoteID": "3749",
    "Body": "In iv. 3 it is laid down that more than one wife is not\\n\\t\\t\\t\\tpermissible \"if ye fear that ye shall not be able to deal\\n\\t\\t\\t\\tjustly with them\". In a Muslim household there is no room\\n\\t\\t\\t\\tfor a \"favourite wife\" in the sense that such a wife is\\n\\t\\t\\t\\trecipient of favours denied to other wives. In the\\n\\t\\t\\t\\tspecial circumstances of the Prophet there were more than\\n\\t\\t\\t\\tone, and he usually observed the rule of equality with\\n\\t\\t\\t\\tthem, in other things as well as in the rotation of\\n\\t\\t\\t\\tconjugal rights. But considering that his marriages after\\n\\t\\t\\t\\the was invested with the Prophetic office were mainly\\n\\t\\t\\t\\tdictated by other than conjugal or personal\\n\\t\\t\\t\\tconsiderations (see n. 3706. xxxiii. 28), the rotation\\n\\t\\t\\t\\tcould not always be observed, though he observed it as\\n\\t\\t\\t\\tmuch as possible. This verse absolves him from absolute\\n\\t\\t\\t\\tadherence to a fixed rotation. There are other\\n\\t\\t\\t\\tinterpretations, but I agree with most of the\\n\\t\\t\\t\\tCommentators in the view I have explained."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "51",
    "NoteID": "3750",
    "Body": "Where the rotation was for some reason interfered with,\\n\\t\\t\\t\\tit was permissible, by another interference with the\\n\\t\\t\\t\\tusual rotation, to bring satisfaction to one who had been\\n\\t\\t\\t\\tpreviously set aside. This was not only permitted, but\\n\\t\\t\\t\\tcommended, as tending to remove dissatisfaction and cheer\\n\\t\\t\\t\\tand comfort the eyes and hearts of those who were\\n\\t\\t\\t\\tdisappointed in their turn."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "51",
    "NoteID": "3751",
    "Body": "Cooling the eyes: an Arabic idiom for cheering and\\n\\t\\t\\t\\tcomforting eyes which yearn to see those they love. A\\n\\t\\t\\t\\tverse of Zeb-un-nisaa, daughter of the Mugal Emperor\\n\\t\\t\\t\\tAurangzeb, may be rendered thus: \"My heart is glad\\n\\t\\t\\t\\twhenever lover-wise I dwell upon thy beauties and thy\\n\\t\\t\\t\\tgrace! But how can I content my hungry eyes, That ask\\n\\t\\t\\t\\tcontinually to see thy face?\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "51",
    "NoteID": "3752",
    "Body": "There was not much in the way of worldly goods or\\n\\t\\t\\t\\tsatisfaction that the Prophet could give them: see\\n\\t\\t\\t\\txxxiii. 28 above. But he was kind, just, and true;-the\\n\\t\\t\\t\\tbest of men to his family, and they all clung to him."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "51",
    "NoteID": "3753",
    "Body": "Our human hearts, however good on the whole, may yet, in\\n\\t\\t\\t\\ttheir motives, have possibly some baser admixture. The\\n\\t\\t\\t\\tfeminine hearts are not more immune in this respect than\\n\\t\\t\\t\\tthe masculine. But everything is known and understood by\\n\\t\\t\\t\\tAllah, Who will in His mercy make all allowance for our\\n\\t\\t\\t\\thuman weaknesses. His title of \"Most Forbearing\" (Halim)\\n\\t\\t\\t\\talso gives His devoted worshippers the cue: why should we\\n\\t\\t\\t\\tnot also forbear with the faults and weaknesses of our\\n\\t\\t\\t\\tneighbours and fellow-creatures?"
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "52",
    "NoteID": "3754",
    "Body": "This was revealed in A.H. 7. After that the Prophet did\\n\\t\\t\\t\\tnot marry again, except the handmaiden Mary the Copt, who\\n\\t\\t\\t\\twas sent as a present by the Christian Muqauqas of Egypt.\\n\\t\\t\\t\\tShe became the mother of Ibrahim, who died in his\\n\\t\\t\\t\\tinfancy."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "53",
    "NoteID": "3755",
    "Body": "The rules of refined social ethics is as necessary to\\n\\t\\t\\t\\tteach to-day as it was with the rude Arabs whom the holy\\n\\t\\t\\t\\tProphet had to teach in his day. Those mentioned in this\\n\\t\\t\\t\\tverse may be briefly recapitulated thus: (1) Enter not a\\n\\t\\t\\t\\tfriend's house without permission; (2) if invited to\\n\\t\\t\\t\\tdine, don't go too early; you are asked to dine, not to\\n\\t\\t\\t\\twait for the preparation of the food; (3) be there at the\\n\\t\\t\\t\\ttime appointed, so that you enter when you are expected\\n\\t\\t\\t\\tand invited; (4) after the meal, don't get familiar with\\n\\t\\t\\t\\tyour host, especially if there is a great distance\\n\\t\\t\\t\\tbetween him and you; (5) don't waste time in\\n\\t\\t\\t\\ttittle-tattle, causing inconvenience and perhaps\\n\\t\\t\\t\\tannoyance to your host; (6) understand what is proper\\n\\t\\t\\t\\tbehaviour for you: he may be too polite to ask to depart.\\n\\t\\t\\t\\tAll this has a social bearng: respect and delicate\\n\\t\\t\\t\\tconsideration for others are among the highest virtues."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "53",
    "NoteID": "3756",
    "Body": "The actual manner of showing respect to ladies may be\\n\\t\\t\\t\\tdifferent in different circumstances. But it is an\\n\\t\\t\\t\\tessential principle of good society to show the greatest\\n\\t\\t\\t\\tdeference to them. To the \"Mothers of the Believers\" this\\n\\t\\t\\t\\trespect was due in an exceptional degree."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "53",
    "NoteID": "3757",
    "Body": "Considering his position, the holy Prophet deserved to be\\n\\t\\t\\t\\trespected before all other men and nothing should be done\\n\\t\\t\\t\\tto cause him the least harm and annoyance. This applied\\n\\t\\t\\t\\tnot only during his life-time, but it applies now,\\n\\t\\t\\t\\tbecause his teaching and personality are alive to us. It\\n\\t\\t\\t\\twas not fitting that his widows, both for their own\\n\\t\\t\\t\\tposition and for the position of the Prophet, should be\\n\\t\\t\\t\\tmarried by other men after him. And this mark of respect\\n\\t\\t\\t\\twas duly observed in history."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "53",
    "NoteID": "3758",
    "Body": "\"Annoy\": Aza (IV) may equally mean: to vex, to cause hurt\\n\\t\\t\\t\\tor injury, to insult, to ill-treat by slander or unseemly\\n\\t\\t\\t\\tconduct, or hurt the feelings of (some one). The Prophet\\n\\t\\t\\t\\tcame with a divine mission to teach and reclaim the\\n\\t\\t\\t\\tworld, and he is entitied to the respect of all, even of\\n\\t\\t\\t\\tthose who do not consciously acknowledge his mission, for\\n\\t\\t\\t\\this mission works constantly like the forces of nature.\\n\\t\\t\\t\\tIn a minor degree the \"Mothers of the Believers\" are also\\n\\t\\t\\t\\tentitied to respect."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "54",
    "NoteID": "3759",
    "Body": "Respect or opposition may be shown overtly or in devious\\n\\t\\t\\t\\thidden ways. All good and evil are open before Allah, and\\n\\t\\t\\t\\tHe will take due account of everything."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "56",
    "NoteID": "3761",
    "Body": "Allah and His angels honour and bless the holy Prophet as\\n\\t\\t\\t\\tthe greatest of men. We are asked to honour and bless him\\n\\t\\t\\t\\tall the more because he took upon himself to suffer the\\n\\t\\t\\t\\tsorrows and afflictions of this life in order to guide us\\n\\t\\t\\t\\tto Allah's Mercy and the highest inner Life."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "57",
    "NoteID": "3762",
    "Body": "Cf. n. 3758 above."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "58",
    "NoteID": "3763",
    "Body": "Cf. iv. 112. In that passage we were told that any one\\n\\t\\t\\t\\twho was himself guilty but accused an innocent man of his\\n\\t\\t\\t\\tguilt, was obviously placing himself in double jeopardy;\\n\\t\\t\\t\\tfirst, for his own original guilt, and secondly for the\\n\\t\\t\\t\\tguilt of a false accusation. Here we take two classes of\\n\\t\\t\\t\\tmen instead of two individuals. The men and women of\\n\\t\\t\\t\\tfaith (if they deserve the name) and doing all they can\\n\\t\\t\\t\\tto serve Allah and humanity. If they are insulted, hurt,\\n\\t\\t\\t\\tor annoyed by those whose sins they denounce, the latter\\n\\t\\t\\t\\tsuffer the penalties of a double guilt, viz., their sins\\n\\t\\t\\t\\tto start with, and the insults or injuries they offer to\\n\\t\\t\\t\\tthose who correct them. Instead of resenting the\\n\\t\\t\\t\\tpreaching of Truth, they should welcome it and profit by\\n\\t\\t\\t\\tit."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "59",
    "NoteID": "3764",
    "Body": "This is for all Muslim women, those of the Prophet's\\n\\t\\t\\t\\thousehold, as well as the others. They were asked to\\n\\t\\t\\t\\tcover themselves with outer garments when walking out of\\n\\t\\t\\t\\tdoors."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "59",
    "NoteID": "3765",
    "Body": "Jilbab, plural Jalabib: an outer garment; a long gown\\n\\t\\t\\t\\tcovering the whole body, or a cloak covering the neck and\\n\\t\\t\\t\\tbosom."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "59",
    "NoteID": "3766",
    "Body": "The object was not to restrict the liberty of women, but\\n\\t\\t\\t\\tto protect them from harm and molestation. In the East\\n\\t\\t\\t\\tand in the West a distinctive public dress of some sort\\n\\t\\t\\t\\tor another has always been a badge of honour or\\n\\t\\t\\t\\tdistinction, both among men and women. This can be traced\\n\\t\\t\\t\\tback on the earliest civilisations. Assyrian Law in its\\n\\t\\t\\t\\tpalmiest days (say, 7th century B.C.), enjoined the\\n\\t\\t\\t\\tveiling of married women and forbade the veiling of\\n\\t\\t\\t\\tslaves and women of ill fame: see Cambridge Ancient\\n\\t\\t\\t\\tHistory, 111. 107."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "59",
    "NoteID": "3767",
    "Body": "That is, if a Muslim woman sincerely tries to observe\\n\\t\\t\\t\\tthis rule, but owing to human weakness fails short of the\\n\\t\\t\\t\\tideal, then \"Allah is Oft-Forgiving, Most Merciful\"."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "60",
    "NoteID": "3768",
    "Body": "It was necessary to put down all kinds of unseemly\\n\\t\\t\\t\\tconduct in the Prophet's City. And here is the warning in\\n\\t\\t\\t\\tthe plainest terms. And the warning had its effect. The\\n\\t\\t\\t\\t\"Hypocrites\" were men who pretended to be in Islam but\\n\\t\\t\\t\\twhose manners and morals were anti-Islamic. Those \"with\\n\\t\\t\\t\\tdiseased hearts\" may have been the ones that molested\\n\\t\\t\\t\\tinnocent women. \"Those who stiffed up sedition\" put false\\n\\t\\t\\t\\trumours in circulation to excite the crowd. Alas! we must\\n\\t\\t\\t\\task ourselves the question: \"Are these conditions present\\n\\t\\t\\t\\tamong us to-day?\""
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "61",
    "NoteID": "3769",
    "Body": "They will be deprived of the blessing and guidance of\\n\\t\\t\\t\\tAllah. They sought to cause disorder in Allah's\\n\\t\\t\\t\\tworld-moral as well as material; but they will themselves\\n\\t\\t\\t\\tbe destroyed. Those who become outlaws, rebels against\\n\\t\\t\\t\\tthe Law, will themselves be destroyed by the Law."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "62",
    "NoteID": "3770",
    "Body": "The Jewish law was much more severe: see notes 3703 and\\n\\t\\t\\t\\t3704 to xxxiii. 26. That severity is mitigated in Islam.\\n\\t\\t\\t\\tBut it is a universal principle that any element which\\n\\t\\t\\t\\tdeliberately refuses to obey law and aggressively tries\\n\\t\\t\\t\\tto subvert all order in society, secretly and openly,\\n\\t\\t\\t\\tmust be effectively suppressed, for the preservation of\\n\\t\\t\\t\\tthe life and health of the general community."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "63",
    "NoteID": "3771",
    "Body": "Cf. vii. 187 and n. 1159, where the idea is further\\n\\t\\t\\t\\texplained. The knowledge of the Final Hour is with Allah\\n\\t\\t\\t\\talone. The fact of its coming is certain; the exact time\\n\\t\\t\\t\\twhen it will come has not been revealed. If it were, it\\n\\t\\t\\t\\twould disturb our thoughts and life. \"Heavy were its\\n\\t\\t\\t\\tburden through the heavens and the earth.\" But at any\\n\\t\\t\\t\\tgiven moment it cannot be far distant. In theological\\n\\t\\t\\t\\tlanguage, each individual's death is a Final Hour, a\\n\\t\\t\\t\\tQiyamat Sugra (Lesser Day of Judgement). In that sense it\\n\\t\\t\\t\\tis not the same for all individuals, and is certainly\\n\\t\\t\\t\\talways near."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "66",
    "NoteID": "3772",
    "Body": "The face is the expression of their Personality, their\\n\\t\\t\\t\\tSelf; and turning upside down is a sign of degradation\\n\\t\\t\\t\\tand ignominy. When the Retribution comes, the evil ones\\n\\t\\t\\t\\twill be humiliated, and they will wish that they had\\n\\t\\t\\t\\tfollowed right guidance when they had the chance. They\\n\\t\\t\\t\\twill then fall to accusing their leaders who misled them.\\n\\t\\t\\t\\tBut they forget their own personal responsibility."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "68",
    "NoteID": "3773",
    "Body": "Cf. xxv. 69 and n. 3129, and xi. 20 and n. 1515. The\\n\\t\\t\\t\\tdouble Penalty invoked will be because (1) they went\\n\\t\\t\\t\\twrong themselves and (2) they misled others."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "69",
    "NoteID": "3774",
    "Body": "The people of Moses often vexed him and rebelled against\\n\\t\\t\\t\\thim and against God's Law. Here the reference seems to be\\n\\t\\t\\t\\tto Num. xii. 1-13. It is there said that Moses's own\\n\\t\\t\\t\\tsister Miriam and his brother Aaron spoke against Moses\\n\\t\\t\\t\\tbecause Moses had married an Ethiopian woman. God cleared\\n\\t\\t\\t\\tMoses of the charge of having done anything wrong: \"My\\n\\t\\t\\t\\tservant Moses is not so, who is faithful in all mine\\n\\t\\t\\t\\thouse.\" Miriam was afflicted with leprosy for seven days\\n\\t\\t\\t\\tas a punishment, after which she was forgiven, as also\\n\\t\\t\\t\\twas Aaron. This is the Old Testament story. The holy\\n\\t\\t\\t\\tProphet was also attacked because of his marriage with\\n\\t\\t\\t\\tZainab bint Jahsh, but not by his own circle, his motives\\n\\t\\t\\t\\twere of the highest and were completely vindicated as we\\n\\t\\t\\t\\thave seen above."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "70",
    "NoteID": "3775",
    "Body": "We must not only speak the truth as far as we know it,\\n\\t\\t\\t\\tbut we must always try to hit the right point; i.e., we\\n\\t\\t\\t\\tmust not speak unseasonably, and when we do speak, we\\n\\t\\t\\t\\tmust not beat about the bush, but go straight to that\\n\\t\\t\\t\\twhich is right, in deed as well as in word. Then Allah\\n\\t\\t\\t\\twill make our conduct right and cure any defects that\\n\\t\\t\\t\\tthere may be in our knowledge and character. With our\\n\\t\\t\\t\\tendeavour directed straight to the goal, we shall be\\n\\t\\t\\t\\tforgiven our errors, shortcomings, faults, and sins of\\n\\t\\t\\t\\tthe past."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "71",
    "NoteID": "3776",
    "Body": "This is salvation, the attainment of our real spiritual\\n\\t\\t\\t\\tdesire or ambition, as we are on the highway to nearness\\n\\t\\t\\t\\tto Allah."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "72",
    "NoteID": "3777",
    "Body": "The Trust is something given to a person, over which he\\n\\t\\t\\t\\thas a power of disposition; he is expected to use it as\\n\\t\\t\\t\\tdirected or expected, but he has the power to use it\\n\\t\\t\\t\\totherwise. There is no trust if the trustee has no power,\\n\\t\\t\\t\\tand the trust implies that the giver of the trust\\n\\t\\t\\t\\tbelieves and expects that the trustee would use it\\n\\t\\t\\t\\taccording to the wish of the creator of the trust, and\\n\\t\\t\\t\\tnot otherwise."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "72",
    "NoteID": "3778",
    "Body": "Cf. lix. 21, where the hypothetical sending down of the\\n\\t\\t\\t\\tQur-an to the Mountains is mentioned, and it is mentioned\\n\\t\\t\\t\\tthat such Parables are put forth in order to aid men to\\n\\t\\t\\t\\treflection."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "72",
    "NoteID": "3779",
    "Body": "The Heavens, the Earth, and the Mountains, ie., other\\n\\t\\t\\t\\tcreatures of Allah, besides man, refused to undertake a\\n\\t\\t\\t\\tTrust or a responsibility, and may be imagined as happy\\n\\t\\t\\t\\twithout a choice of good or evil being given through\\n\\t\\t\\t\\ttheir will. In saying that they refused, we imply a will,\\n\\t\\t\\t\\tbut we limit it by the statement that they did not\\n\\t\\t\\t\\tundertake to be given a choice between good and evil.\\n\\t\\t\\t\\tThey preferred to submit their will entirely to Allah's\\n\\t\\t\\t\\tWill, which is All-Wise and Perfect, and which would give\\n\\t\\t\\t\\tthem far more happiness than a faculty of choice, with\\n\\t\\t\\t\\ttheir imperfect knowledge. Man was too audacious and\\n\\t\\t\\t\\tignorant to realise this, and the result has been that\\n\\t\\t\\t\\tman as a race has been disrupted: the evil ones have\\n\\t\\t\\t\\tbetrayed the Trust and brought Punishment on themselves,\\n\\t\\t\\t\\tthough the good have been able to rise far above other\\n\\t\\t\\t\\tCreation, to be the muqarrabin, the nearest ones to\\n\\t\\t\\t\\tAllah: lvi. 11 and lvi. 88. What can be higher than this\\n\\t\\t\\t\\tfor any creature? It follows incidentally from this that\\n\\t\\t\\t\\tthe Heavens and the Earth were created before man was\\n\\t\\t\\t\\tcreated and this is in accordance with what we know of\\n\\t\\t\\t\\tthe physical world in science: man came on the scene at a\\n\\t\\t\\t\\tcomparatively late stage."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "72",
    "NoteID": "3780",
    "Body": "Hamala: to undertake, bear, carry (the Trust or\\n\\t\\t\\t\\tresponsibility), to be equal to it. This is the ordinary\\n\\t\\t\\t\\tmeaning, and the majority of Commentators construe so.\\n\\t\\t\\t\\tBut some understand it to mean \"to carry away, run away\\n\\t\\t\\t\\twith, to embezzle (the thing entrusted); hence to be\\n\\t\\t\\t\\tfalse to the Trust, to betray the Trust.\" In that case\\n\\t\\t\\t\\tthe sense of verses 72-73 would be: \"Allah offered the\\n\\t\\t\\t\\tTrust to other creatures, but they refused, lest they\\n\\t\\t\\t\\tshould betray it, being afraid from that point of view:\\n\\t\\t\\t\\tbut man was less fair to himself: in his ignorance he\\n\\t\\t\\t\\taccepted and betrayed the Trust, with the result that\\n\\t\\t\\t\\tsome of his race became Hypocrites and Unbelievers and\\n\\t\\t\\t\\twere punished, though others were faithful to the Trust\\n\\t\\t\\t\\tand received Allah's Mercy\". The resulting conclusion is\\n\\t\\t\\t\\tthe same under both interpretations."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "72",
    "NoteID": "3781",
    "Body": "See ii. 30-34 and notes. Allah intended a very high\\n\\t\\t\\t\\tdestiny for man, and placed him in his uncorrupted state\\n\\t\\t\\t\\teven above the angels, but in his corruption he made\\n\\t\\t\\t\\thimself even lower than the beasts. What was it that made\\n\\t\\t\\t\\tman so high and noble? The differentiating quality which\\n\\t\\t\\t\\tAllah gave man was that Allah breathed something of His\\n\\t\\t\\t\\town spirit into man (xxxii. 9; xv. 29 and n. 1968; and\\n\\t\\t\\t\\tother passages). This meant that man was given a limited\\n\\t\\t\\t\\tchoice of good and evil, and that he was made capable of\\n\\t\\t\\t\\tForbearance, Love, and Mercy. And in himself man summed\\n\\t\\t\\t\\tup Allah's great world: man is in himself a microcosm."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "72",
    "NoteID": "3782",
    "Body": "Zalum (translated \"unjust\") and Jahul (ignorant) are both\\n\\t\\t\\t\\tin the Arabic intensive form; as much as to say, 'man\\n\\t\\t\\t\\tsignally failed to measure his own powers or his own\\n\\t\\t\\t\\tknowledge.' But Allah's Grace came to his assistance.\\n\\t\\t\\t\\tWhere man did his best, he won through by Allah's Grace,\\n\\t\\t\\t\\teven though man's Best was but a poor Good. How did man\\n\\t\\t\\t\\tgenerically undertake this great Responsibility, which\\n\\t\\t\\t\\tmade him Vicegerent on earth (ii. 30)? Here comes in the\\n\\t\\t\\t\\tdoctrine of a Covenant, express or implied, between Allah\\n\\t\\t\\t\\tand Humanity. See vii. 172,73 and notes 1146-48 also v. 1\\n\\t\\t\\t\\tand n. 682. A Covenant (Mithaq) necessarily implies\\n\\t\\t\\t\\tTrust, and its breach necessarily implies Punishment."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "73",
    "NoteID": "3783",
    "Body": "Man's generic Covenant, which flowed from his exercising\\n\\t\\t\\t\\tthe option given him, choosing Will, Forbearance, Love,\\n\\t\\t\\t\\tand Mercy, made it necessary that breach of it should\\n\\t\\t\\t\\tcarry its own punishment. Breach of it is here classed\\n\\t\\t\\t\\tunder two heads: those who betray their Trust act either\\n\\t\\t\\t\\tas Hypocrites or as Unbelievers. Hypocrites are those who\\n\\t\\t\\t\\tprofess Faith but bring not forth the fruits of Faith.\\n\\t\\t\\t\\tUnbelievers are those who openly defy Faith, and from\\n\\t\\t\\t\\twhom therefore no fruits of Faith are to be expected."
  },
  {
    "SurahNumber": "33",
    "AyahNumber": "73",
    "NoteID": "3784",
    "Body": "Those who remain firm to their Faith and their Covenant\\n\\t\\t\\t\\t(see notes 3781-82) will receive the aid of Allah's\\n\\t\\t\\t\\tGrace; their faults and weaknesses will be cured; and\\n\\t\\t\\t\\tthey will be made worthy of their exalted Destiny. For\\n\\t\\t\\t\\tAllah is Oft-Forgiving and Most Merciful. So ends a Sura\\n\\t\\t\\t\\twhich deals with the greatest complications and\\n\\t\\t\\t\\tmisunderstandings in our throbbing life here below, and\\n\\t\\t\\t\\tpoints upwards to the Great Achievement, the highest\\n\\t\\t\\t\\tSalvation."
  }
]
