[
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "1",
    "sectionHeading": "Fulfilling Vows to Walk",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tUbaydullah ibn Abdullah ibn Utba ibn Masud from Abdullah\\n\\t\\t\\t\\tibn Abbas that Sad ibn Ubada questioned the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, and\\n\\t\\t\\t\\tsaid,\"My mother died while she still had a vow which she\\n\\t\\t\\t\\thad not fulfilled.\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Fulfill it for\\n\\t\\t\\t\\ther.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "2",
    "sectionHeading": "Fulfilling Vows to Walk",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbdullah ibn Abi Bakr that his paternal aunt related that\\n\\t\\t\\t\\ther grandmother made a vow to walk to the Quba mosque.\\n\\t\\t\\t\\tShe died, and did not fulfill it, so Abdullah ibn Abbas\\n\\t\\t\\t\\tasked her daughter to walk for her.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say, \"No one walks for\\n\\t\\t\\t\\tanyone else.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "3",
    "sectionHeading": "Fulfilling Vows to Walk",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Abdullah ibn Abi\\n\\t\\t\\t\\tHabiba said, \"I said to a man, when I was young, 'A man\\n\\t\\t\\t\\twho only says that he must walk to the House of Allah and\\n\\t\\t\\t\\tdoes not say that he has vowed to walk, does not have to\\n\\t\\t\\t\\twalk.' A man said, 'Shall I give you this small\\n\\t\\t\\t\\tcucumber?' and he had a small cucumber in his hand and\\n\\t\\t\\t\\tyou will say, 'I must walk to the house of Allah?' I\\n\\t\\t\\t\\tsaid, 'Yes' and I said it, for at that time I was still\\n\\t\\t\\t\\timmature. Then, when I came of age, some one said to me\\n\\t\\t\\t\\tthat I had to fulfill my vow. I went and asked Said ibn\\n\\t\\t\\t\\tal-Musayyab about it, and he said to me, 'You must walk.'\\n\\t\\t\\t\\tSo I walked.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the custom among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "4",
    "sectionHeading": "Making Vows to Walk to the House and Not Succeeding",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Urwa ibn Udhayna\\n\\t\\t\\t\\tal-Laythi said, \"I went out with my grandmother who had\\n\\t\\t\\t\\tvowed to walk to the House of Allah. When we had gone\\n\\t\\t\\t\\tpart of the way, she could not go on. I sent one of her\\n\\t\\t\\t\\tmawlas to question Abdullah ibn Umar and I went with him.\\n\\t\\t\\t\\tHe asked Abdullah ibn Umar, and Abdullah ibn Umar said to\\n\\t\\t\\t\\thim, 'Take her and let her ride, and when she has the\\n\\t\\t\\t\\tstrength let her ride back, and start to walk from the\\n\\t\\t\\t\\tplace from which she was unable to go on.'~\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say, \"I think that she\\n\\t\\t\\t\\tmust sacrifice an animal.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab and Abu Salama ibn Abd ar-Rahman\\n\\t\\t\\t\\tsaid the same as Abdullah ibn Umar.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "5",
    "sectionHeading": "Making Vows to Walk to the House and Not Succeeding",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said said,\\n\\t\\t\\t\\t\"I vowed to walk, but I was struck by a pain in the\\n\\t\\t\\t\\tkidney, so I rode until I came to Makka. I questioned Ata\\n\\t\\t\\t\\tibn Abi Rabah and others, and they said, 'You must\\n\\t\\t\\t\\tsacrifice an animal.' When I came to Madina I questioned\\n\\t\\t\\t\\tthe ulama there, and they ordered me to walk again from\\n\\t\\t\\t\\tthe place from which I was unable to go on. So I walked.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say, \"What is done\\n\\t\\t\\t\\tamong us regarding someone who makes a vow to walk to the\\n\\t\\t\\t\\tHouse of Allah, and then cannot do it and so rides, is\\n\\t\\t\\t\\tthat he must return and walk from the place from which he\\n\\t\\t\\t\\twas unable to go on. If he cannot walk, he should walk\\n\\t\\t\\t\\twhat he can and then ride, and he must sacrifice a camel,\\n\\t\\t\\t\\ta cow, or a sheep if that is all that he can find.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik, when asked about a man who said to another, \"I\\n\\t\\t\\t\\twill carry you to the House of Allah\", answered, \"If he\\n\\t\\t\\t\\tintended to carry him on his shoulder, by that he meant\\n\\t\\t\\t\\thardship and exhaustion to himself, and he does not have\\n\\t\\t\\t\\tto do that. Let him walk by foot and make sacrifice. If\\n\\t\\t\\t\\the did not intend anything, let him do hajj and ride, and\\n\\t\\t\\t\\ttake the man on hajj with him. That is because he said,\\n\\t\\t\\t\\t'I will carry you to the house of Allah.' If the man\\n\\t\\t\\t\\trefuses to do hajj with him, then there is nothing\\n\\t\\t\\t\\tagainst him, and what is demanded of him is cancelled.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether it was enough for\\n\\t\\t\\t\\ta man who had made a vow that he would walk to the House\\n\\t\\t\\t\\tof Allah a certain (large) number of times, or who had\\n\\t\\t\\t\\tforbidden himself from talking to his father and brother,\\n\\t\\t\\t\\tif he did not fulfil a certain vow, and he had taken upon\\n\\t\\t\\t\\thimself, by the oath, something which he was incapable of\\n\\t\\t\\t\\tfulfilling in his lifetime, even though he were to try\\n\\t\\t\\t\\tevery year, to fulfil only one or a (smaller) number of\\n\\t\\t\\t\\tvows by Allah? Malik said, \"The only satisfaction for\\n\\t\\t\\t\\tthat that I know is fulfilling what he has obliged\\n\\t\\t\\t\\thimself to do. Let him walk for as long as he is able and\\n\\t\\t\\t\\tdraw near Allah the Exalted by what he can of good.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "5",
    "sectionHeading": "How to Fulfill the Oath of Walking to the Kaba",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that what he preferred of\\n\\t\\t\\t\\twhat he had heard from the people of knowledge about a\\n\\t\\t\\t\\tman or woman who vowed to walk to the House of Allah, was\\n\\t\\t\\t\\tthat they fulfilled the oath when performing umra, by\\n\\t\\t\\t\\twalking until they had done say between Safa and Marwa.\\n\\t\\t\\t\\tWhen they had done say it was finished. If they vowed to\\n\\t\\t\\t\\twalk in the hajj, they walked until they came to Makka,\\n\\t\\t\\t\\tthen they walked until they had finished all the rites.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Walking is only for hajj or umra.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "6",
    "sectionHeading": "Vows Not Permitted in Disobedience to Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Humayd ibn Qays and\\n\\t\\t\\t\\tThawr ibn Zayd adDili both informed him that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, (and one of them gave more detail than the\\n\\t\\t\\t\\tother),saw a man standing in the sun. The Messenger\\n\\t\\t\\t\\tasked, \"What's wrong with him?\" The people said, \"He has\\n\\t\\t\\t\\tvowed not to speak or to seek shade from the sun or to\\n\\t\\t\\t\\tsit and to fast.\" The Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Go and tell him to speak,\\n\\t\\t\\t\\tseek shade, and sit, but let him complete his fast.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I have not heard that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, ordered\\n\\t\\t\\t\\tthe man in question to do any kaffara. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, only\\n\\t\\t\\t\\tordered him to complete that in which there was obedience\\n\\t\\t\\t\\tto Allah and to abandon that in which there was\\n\\t\\t\\t\\tdisobedience to Allah.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "7",
    "sectionHeading": "Vows Not Permitted in Disobedience to Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Yahya ibn Said heard\\n\\t\\t\\t\\tal-Qasim ibn Muhammad say, \"A woman came to Abdullah ibn\\n\\t\\t\\t\\tAbbas and said, 'I have vowed to sacrifice my son.' Ibn\\n\\t\\t\\t\\tAbbas said, 'Do not sacrifice your son. Do kaffara for\\n\\t\\t\\t\\tyour oath.' An old man with Ibn Abbas said, 'What kaffara\\n\\t\\t\\t\\tis there for this?' Ibn Abbas said, 'Allah the Exalted\\n\\t\\t\\t\\tsaid, \"Those of you who say, regarding their wives.'Be as\\n\\t\\t\\t\\tmy mother's back' (Sura58 ayat 2) and then He went on to\\n\\t\\t\\t\\toblige the kaffara for it as you have seen.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "8",
    "sectionHeading": "Vows Not Permitted in Disobedience to Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Talha ibn Abi\\n\\t\\t\\t\\tal-Malik al-Ayli from al-Qasim ibn Muhammad ibn as-Siddiq\\n\\t\\t\\t\\tfrom A'isha that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, said, \"Whoever vows to obey\\n\\t\\t\\t\\tAllah, let him obey Him. Whoever vows to disobey Allah,\\n\\t\\t\\t\\tlet him not disobey Him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he had heard Malik say, \"The meaning of\\n\\t\\t\\t\\tthe statement of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, 'Whoever vows to disobey Allah, let him\\n\\t\\t\\t\\tnot disobey Him' is that for instance a man who vows\\n\\t\\t\\t\\tthat, if he speaks to such-and-such a person, he will\\n\\t\\t\\t\\twalk to Syria, Egypt, or any other such things which are\\n\\t\\t\\t\\tnot considered as ibada, is not under any obligation by\\n\\t\\t\\t\\tany of that, even if he did speak to the man or did break\\n\\t\\t\\t\\twhatever it was he swore, because Allah does not demand\\n\\t\\t\\t\\tobedience in such things. He should only fulfill those\\n\\t\\t\\t\\tthings in which there is obedience to Allah.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t22.5 Rashness in Oaths\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "9",
    "sectionHeading": "Vows Not Permitted in Disobedience to Allah",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, umm al-muminin said, \"Rashness in\\n\\t\\t\\t\\toaths is that a man says, 'By Allah, No! by Allah!' \"\\n\\t\\t\\t\\ti.e. out of habit.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The best of what I have heard on the matter\\n\\t\\t\\t\\tis that rashness in oaths is that a man take an oath on\\n\\t\\t\\t\\tsomething to show that he is certain that it is like he\\n\\t\\t\\t\\tsaid, only to find that it is other than what he said.\\n\\t\\t\\t\\tThis is rashness.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The binding oath is for example, that a man\\n\\t\\t\\t\\tsays that he will not sell his garment for ten dinars,\\n\\t\\t\\t\\tand then he sells it for that, or that he will beat his\\n\\t\\t\\t\\tyoung slave and then does not beat him, and so on. One\\n\\t\\t\\t\\tdoes kaffara for making such an oath, and there is no\\n\\t\\t\\t\\tkaffara in rashness.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"As for the one who swears to a thing which\\n\\t\\t\\t\\the knows is wicked, and he swears to a lie he knows to be\\n\\t\\t\\t\\ta lie, in order to please someone with it or to excuse\\n\\t\\t\\t\\thimself to someone by it or to gain money by it, no\\n\\t\\t\\t\\tkaffara that he does for it can cover it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "10",
    "sectionHeading": "Oaths for which Kaffara Not Obligatory",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"Whoever swears by Allah and then says,\\n\\t\\t\\t\\t'Allah willing' and then does not do what he has sworn\\n\\t\\t\\t\\tto, has not broken his oath.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The best I have heard on this reservation is\\n\\t\\t\\t\\tthat it belongs to the statement made if the speaker does\\n\\t\\t\\t\\tnot break the normal flow of speech before he is silent.\\n\\t\\t\\t\\tIf he is silent and breaks the flow of speech, he has no\\n\\t\\t\\t\\texception.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said, \"Malik said that a man who said that he had\\n\\t\\t\\t\\tdisbelieved or associated something with Allah and then\\n\\t\\t\\t\\the broke his oath, had no kaffara, and he was not a\\n\\t\\t\\t\\tdisbeliever or one who associated something with Allah\\n\\t\\t\\t\\tunless his heart concealed something of either of those.\\n\\t\\t\\t\\tHe should ask forgiveness of Allah and not return to it -\\n\\t\\t\\t\\tfor what he did was evil.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "11",
    "sectionHeading": "Oaths for Which Kaffara is Obligatory",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Suhayl ibn Abi Salih\\n\\t\\t\\t\\tfrom his father from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Whoever makes an oath and then sees that something else\\n\\t\\t\\t\\twould be better than it, should do kaffara for his oath\\n\\t\\t\\t\\tand do what is better.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that he heard Malik say, \"Anyone who says that\\n\\t\\t\\t\\the has a vow but does not mention the name of Allah, is\\n\\t\\t\\t\\tstill obliged to make the kaffara for an oath (if he\\n\\t\\t\\t\\tbreaks it)\".\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Emphasis is when a man swears one thing\\n\\t\\t\\t\\tseveral times, repeating the oath in his speech time\\n\\t\\t\\t\\tafter time. For instance, the statement, 'By Allah, I\\n\\t\\t\\t\\twill not decrease it from such-and-such,' sworn three\\n\\t\\t\\t\\ttimes or more. The kaffara of that is like the kaffara of\\n\\t\\t\\t\\tone oath. If a man swears, 'I will not eat this food or\\n\\t\\t\\t\\twear these clothes or enter this house,' that is all in\\n\\t\\t\\t\\tone oath, and he is only obliged to do one kaffara. It is\\n\\t\\t\\t\\tthe same for a man who says to his wife, 'You are\\n\\t\\t\\t\\tdivorced if I clothe you in this garment or let you go to\\n\\t\\t\\t\\tthe mosque,' and it is one entire statement in the normal\\n\\t\\t\\t\\tpattern of speech. If he breaks any of that oath, divorce\\n\\t\\t\\t\\tis necessary, and there is no breaking of oath after that\\n\\t\\t\\t\\tin whatever he does. There is only one oath to be broken\\n\\t\\t\\t\\tin that.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"What we do about a woman who makes a vow\\n\\t\\t\\t\\twithout her husband's permission is that she is allowed\\n\\t\\t\\t\\tto do so and she must fulfill it, if it only concerns her\\n\\t\\t\\t\\town person and will not harm her husband. If, however, it\\n\\t\\t\\t\\twill harm her husband, he may forbid her to fulfill it,\\n\\t\\t\\t\\tbut it remains an obligation against her until she has\\n\\t\\t\\t\\tthe opportunity to complete it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "12",
    "sectionHeading": "Behaviour in the Kaffara of the Broken Oath",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar said, \"If someone breaks an oath which he has\\n\\t\\t\\t\\tstressed, he has to free a slave, or clothe ten poor\\n\\t\\t\\t\\tpeople. If someone breaks an oath, but has not stressed\\n\\t\\t\\t\\tit, he only has to feed ten poor people and each poor\\n\\t\\t\\t\\tperson is fed a mudd of wheat. Some one who does not have\\n\\t\\t\\t\\tthe means for that, should fast for three days.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "13",
    "sectionHeading": "Behaviour in the Kaffara of the Broken Oath",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to do kaffara for a broken oath by feeding\\n\\t\\t\\t\\tten poor people. Each person got a mudd of wheat. He\\n\\t\\t\\t\\tsometimes freed a slave if he had repeated the oath.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that\\n\\t\\t\\t\\tSulayman ibn Yasar said, \"I understood from people that\\n\\t\\t\\t\\twhen they made the kaffara for a broken oath, they gave a\\n\\t\\t\\t\\tmudd of wheat according to the smaller mudd. They thought\\n\\t\\t\\t\\tthat that would compensate for them.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"The best of what I have heard about the one\\n\\t\\t\\t\\twho does kaffara for breaking his oath by clothing people\\n\\t\\t\\t\\tis that if he clothes men he clothes them each in one\\n\\t\\t\\t\\tgarment. If he clothes women, he clothes them each in two\\n\\t\\t\\t\\tgarments, a long shift and a long scarf, because that is\\n\\t\\t\\t\\twhat is satisfactory for each of them in the prayer.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "14",
    "sectionHeading": "Oaths in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that one time the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, was speaking to Umar ibn\\n\\t\\t\\t\\tal-Khattab while he was travelling with a troop and Umar\\n\\t\\t\\t\\tswore by his father and he (the Messenger) said, \"Allah\\n\\t\\t\\t\\tforbids you to swear by your fathers. If anyone swears,\\n\\t\\t\\t\\tlet him swear by Allah or keep silent.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "15",
    "sectionHeading": "Oaths in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used tosay, \"No, by the Overturner of hearts.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "16",
    "sectionHeading": "Oaths in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Uthman ibn Hafs ibn\\n\\t\\t\\t\\tUmar ibn Khalda that Ibn Shihab had heard that Abu Lubaba\\n\\t\\t\\t\\tibn Abd al-Mundhir, when Allah turned to him said,\\n\\t\\t\\t\\t\"Messenger of Allah, should I leave my people's house in\\n\\t\\t\\t\\twhich I committed wrong action and keep your company, and\\n\\t\\t\\t\\tgive away all my property as sadaqa for Allah and His\\n\\t\\t\\t\\tMessenger? \"The Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Giving away a third of it is\\n\\t\\t\\t\\tenough for you.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "22",
    "hadithNumber": "17",
    "sectionHeading": "Oaths in General",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ayyub ibn Musa from\\n\\t\\t\\t\\tMansur ibn Abd ar-Rahman al-Hajabi from his mother that\\n\\t\\t\\t\\tA'isha, umm al-muminin, may Allah be pleased with her,\\n\\t\\t\\t\\twas asked about a man who devoted his property to the\\n\\t\\t\\t\\tdoor of Kaba. She said, \"Let him do kaffara for it with\\n\\t\\t\\t\\tthe kaffara of the oath.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, that someone who devoted all his property in\\n\\t\\t\\t\\tthe way of Allah, and then broke his oath, should put a\\n\\t\\t\\t\\tthird of his property in the way of Allah, as that was\\n\\t\\t\\t\\twhat the Messenger of Allah, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, did in the case of Abu Lubaba.\\n\\t\\t\\t</p>"
  }
]
