[
  {
    "SurahNumber": "54",
    "AyahNumber": "1",
    "NoteID": "5127",
    "Body": "See para 2 of the Introduction to S. liii. The idea of\\n\\t\\t\\t\\tthe Judgment being nigh at the beginning of this Sura\\n\\t\\t\\t\\tconnects it with the same idea at the end of the last\\n\\t\\t\\t\\tSara (verse 57), though the actual words used in the two\\n\\t\\t\\t\\tcases are different."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "1",
    "NoteID": "5128",
    "Body": "Three explanations are given in the Mufradat, and perhaps\\n\\t\\t\\t\\tall three apply here: (1) that the moon once appeared\\n\\t\\t\\t\\tcleft asunder in the valley of Makkah within sight of the\\n\\t\\t\\t\\tProphet, his Companions, and some Unbelievers; (2) that\\n\\t\\t\\t\\tthe prophetic past tense indicates the future, the\\n\\t\\t\\t\\tcleaving asunder of the moon being a Sign of the Judgment\\n\\t\\t\\t\\tapproaching; and (3) that the phrase is metaphorical,\\n\\t\\t\\t\\tmeaning that the matter has become clear as the moon.\\n\\t\\t\\t\\tThat the first was noticed by contemporaries, including\\n\\t\\t\\t\\tUnbelievers, is clear from verse 2. The second is an\\n\\t\\t\\t\\tincident of the disruption of the solar system at the New\\n\\t\\t\\t\\tCreation: Cf. lxxv. 8-9."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "2",
    "NoteID": "5129",
    "Body": "Mustamirr: continuous, or powerful; either meaning will\\n\\t\\t\\t\\tapply. The Unbelievers acknowledge the unusual\\n\\t\\t\\t\\tappearance, but call it magic. They do not therefore\\n\\t\\t\\t\\tprofit by the spiritual lesson."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "3",
    "NoteID": "5130",
    "Body": "The prevalence of sin and the persecution of truth may\\n\\t\\t\\t\\thave its day, but it must end at last."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "4",
    "NoteID": "5131",
    "Body": "The stories of the sins of past generations having been\\n\\t\\t\\t\\tvisited with exemplary punishments were already in their\\n\\t\\t\\t\\tpossession, and should, if they had been wise, have\\n\\t\\t\\t\\topened their eyes and checked them in their mad career of\\n\\t\\t\\t\\tsin. Five of these stories are again referred to later in\\n\\t\\t\\t\\tthis Sura by way of illustration."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "6",
    "NoteID": "5132",
    "Body": "For a time godlessness seems to triumph, but the triumph\\n\\t\\t\\t\\tis short-lived, And in any case there is the great\\n\\t\\t\\t\\tReckoning of the Day of Judgment."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "6",
    "NoteID": "5133",
    "Body": "The angel whose voice will call at the Resurrection and\\n\\t\\t\\t\\tdirect all souls. Cf. xx. 108-111."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "7",
    "NoteID": "5134",
    "Body": "At one stage in the invasion of locust swarms, the\\n\\t\\t\\t\\tlocusts are torpid and are scattered abroad all over the\\n\\t\\t\\t\\tground. I have seen them on railway tracks in 'Iraq,\\n\\t\\t\\t\\tcrushed to death in hundreds by passing trains. The\\n\\t\\t\\t\\tsimile is apt for the stunned beings who will rise up in\\n\\t\\t\\t\\tswarms from their graves and say, \"Ah! woe unto us! who\\n\\t\\t\\t\\thas raised us up?\" (xxxvi. 52)."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "9",
    "NoteID": "5135",
    "Body": "The story of Noah and the Flood is frequently referred to\\n\\t\\t\\t\\tin the Qur-an. The passage which best illustrates this\\n\\t\\t\\t\\tpassage will be found in xi. 25-48. Note in that passage\\n\\t\\t\\t\\thow they first insult and abuse him arrogantly; how he\\n\\t\\t\\t\\thumbly argues with them; how they laugh him to scorn, as\\n\\t\\t\\t\\tmuch as to say that he was a madman possessed of some\\n\\t\\t\\t\\tevil spirit; and how the Flood comes and he is saved in\\n\\t\\t\\t\\tthe Ark, and the wicked are doomed to destruction."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "10",
    "NoteID": "5136",
    "Body": "He asked for help in his mission, as he felt himself\\n\\t\\t\\t\\toverpowered by brute force and cast out, which prevented\\n\\t\\t\\t\\tthe fulfilment of his mission. But the wicked generation\\n\\t\\t\\t\\twere past all repentance, and they were wiped out."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "12",
    "NoteID": "5137",
    "Body": "The torrents of rain from above combined with the gush of\\n\\t\\t\\t\\twaters from underground springs, and caused a huge Flood\\n\\t\\t\\t\\twhich inundated the country."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "13",
    "NoteID": "5138",
    "Body": "Dusur, plural of disar, which means the palm-fibre with\\n\\t\\t\\t\\twhich boats are caulked: from dasara, to ram in, to\\n\\t\\t\\t\\tspear. A derived meaning is \"nails\", (which are driven\\n\\t\\t\\t\\tinto planks): this latter meaning also applies, and is\\n\\t\\t\\t\\tpreferred by translators not familiar with the\\n\\t\\t\\t\\tconstruction of simple boats."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "14",
    "NoteID": "5139",
    "Body": "As usual, Allah's Mercy in saving His faithful servants\\n\\t\\t\\t\\ttakes precedence of His Wrath and Penality. And He helps\\n\\t\\t\\t\\tand rewards those whom the world rejects and despises!"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "15",
    "NoteID": "5140",
    "Body": "Cf. xxix. 15, where the Ark (with the salvation it\\n\\t\\t\\t\\tbrought to the righteous) is mentioned as a Sign for all\\n\\t\\t\\t\\tPeoples. So also in xxv, 37 and xxvi. 121, it is a Sign\\n\\t\\t\\t\\tfor men. Similarly the saving of Lot, with the\\n\\t\\t\\t\\tdestruction of the wicked Cities of the Plain, is\\n\\t\\t\\t\\tmentioned as a Sign left for those who would understand:\\n\\t\\t\\t\\txxix. 35, and li. 37."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "15",
    "NoteID": "5141",
    "Body": "A refrain that occurs six times in this Sura: see\\n\\t\\t\\t\\tIntroduction."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "16",
    "NoteID": "5142",
    "Body": "While the Mercy of Allah is always prominently mentioned,\\n\\t\\t\\t\\twe must not forget or minimise the existence of Evil, and\\n\\t\\t\\t\\tthe terrible Penalty it incurs if the Grace of Allah and\\n\\t\\t\\t\\tHis Warning are deliberately rejected."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "17",
    "NoteID": "5143",
    "Body": "While the Qur-an sums up the highest philosophy of the\\n\\t\\t\\t\\tinner life, its simple directions for conduct are plain\\n\\t\\t\\t\\tand easy to understand and act upon. Is this not in\\n\\t\\t\\t\\titself a part of the Grace of Allah? And what excuse is\\n\\t\\t\\t\\tthere for any one to fail in receiving admonition?"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "19",
    "NoteID": "5144",
    "Body": "Cf. xli. 16. How graphic is the description of the\\n\\t\\t\\t\\ttornado that uprooted them! It must indeed be a dreadful\\n\\t\\t\\t\\ttornado that plucks up the palm-trees by their deep\\n\\t\\t\\t\\ttap-roots. The \"Day\" is an indefinite period of time. The\\n\\t\\t\\t\\twind that destroyed the 'Ad people lasted seven nights\\n\\t\\t\\t\\tand eight days: lxix. 7."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "21",
    "NoteID": "5145",
    "Body": "Repeated from verse 18 to heighten the description of the\\n\\t\\t\\t\\tsin, the penalty, and the criminal negligence of the\\n\\t\\t\\t\\tsinners in refusing the warnings on account of their\\n\\t\\t\\t\\tself- complacent confidence in their own strength and\\n\\t\\t\\t\\tstability! It is repeated again as a secondary refrain in\\n\\t\\t\\t\\tliv. 30 and (with slight modification) in liv. 32 and 39."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "24",
    "NoteID": "5146",
    "Body": "The psychology of the Thamud is more searchingly analysed\\n\\t\\t\\t\\there than in xli. 17, to show up the contrast between\\n\\t\\t\\t\\tshallow men's ideas about Revelation, and the real\\n\\t\\t\\t\\tsanity, humanism, social value, and truth of Revelation.\\n\\t\\t\\t\\tTo them the Revelation was brought by Salih."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "24",
    "NoteID": "5147",
    "Body": "Because the Prophet is one among so many, and different\\n\\t\\t\\t\\tfrom them, although brought up among themselves, it is\\n\\t\\t\\t\\tmade a cause of reproach against him, when it should have\\n\\t\\t\\t\\tbeen an index leading to a searching of their hearts and\\n\\t\\t\\t\\tan examination of their ways."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "25",
    "NoteID": "5148",
    "Body": "Pure abuse, as a contrast to Salih's expostulation! See\\n\\t\\t\\t\\txxvi. 141-158, and notes."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "27",
    "NoteID": "5149",
    "Body": "See n. 1044 to vii. 73, for the she-camel as a trial or\\n\\t\\t\\t\\ttest case among selfish people who tried to monopolise\\n\\t\\t\\t\\twater and pasture as against the poor."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "28",
    "NoteID": "5150",
    "Body": "See xxvi. 155-156. All were to have water in due turn. It\\n\\t\\t\\t\\twas to be no one's monopoly. And certainly the gates were\\n\\t\\t\\t\\tnot to be shut against the poor or their cattle."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "31",
    "NoteID": "5151",
    "Body": "See n. 1047 to vii. 78, and Cf. the same phrase \"single\\n\\t\\t\\t\\tBlast\" used for the signal for the Resurrection in xxxvi.\\n\\t\\t\\t\\t53. In the case of the Thamud, the destruction seems to\\n\\t\\t\\t\\thave been by a severe earthquake accompanied with a\\n\\t\\t\\t\\tterrible rumbling noise."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "31",
    "NoteID": "5152",
    "Body": "They became like dry sticks such as are used by herdsmen\\n\\t\\t\\t\\tin making pens or enclosures for their cattle."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "33",
    "NoteID": "5153",
    "Body": "The story of Lot (Lut) and the Cities of the Plain has\\n\\t\\t\\t\\tbeen frequently referred to. See xi. 74-83."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "34",
    "NoteID": "5154",
    "Body": "Hasib: a violent tornado bringing a shower of stones. The\\n\\t\\t\\t\\tword occurs here; in xvii. 68 (without reference to any\\n\\t\\t\\t\\tparticular place); in xxix. 40 (where it seems to refer\\n\\t\\t\\t\\tto Lot's Cities, see n. 3462); and in lxvii. 17 (where\\n\\t\\t\\t\\tagain there is no reference to a particular place). In\\n\\t\\t\\t\\tLot's Cities the shower was of brimstone: see xi. 82."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "35",
    "NoteID": "5155",
    "Body": "\"Giving thanks\" to Allah in Quranic phrase is to obey\\n\\t\\t\\t\\tAllah's Law, to do His Will, to practise righteousness,\\n\\t\\t\\t\\tto use all gifts in His service."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "36",
    "NoteID": "5156",
    "Body": "Cf. xi. 78-79."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "37",
    "NoteID": "5157",
    "Body": "Lot had been preaching to them some time against their\\n\\t\\t\\t\\tiniquities. The crisis of their fate came when the two\\n\\t\\t\\t\\tangels came to Lot in the guise of handsome young men.\\n\\t\\t\\t\\tThe men of the whole City came in an uproar, assaulted\\n\\t\\t\\t\\this house, and tried to snatch away the two handsome men.\\n\\t\\t\\t\\tLot tried to prevent them, but was powerless. Darkness\\n\\t\\t\\t\\tfell on their eyes, as the first stage in their\\n\\t\\t\\t\\tpunishment, and before next morning the wicked cities\\n\\t\\t\\t\\twere buried under a shower of brimstone. Lot and his\\n\\t\\t\\t\\tbelieving household were saved."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "41",
    "NoteID": "5158",
    "Body": "The Egyptian people of old are the last people mentioned\\n\\t\\t\\t\\tin this Sura as an example of iniquity meeting with\\n\\t\\t\\t\\tpunishment. And the moral is driven home to the Pagan\\n\\t\\t\\t\\tQuraish, to warn them of their fate if they persisted in\\n\\t\\t\\t\\ttheir evil lives. The Egyptians had many Signs given\\n\\t\\t\\t\\tthem. They were a gifted people and had made much\\n\\t\\t\\t\\tprogress in the sciences and the arts. They could have\\n\\t\\t\\t\\tlearnt from history that when the highest virtues\\n\\t\\t\\t\\tdisappear, the nation must fall. Moses was brought up\\n\\t\\t\\t\\tamong them and commissioned to give Allah's Message to\\n\\t\\t\\t\\tthem. But they were arrogant; they were unjust to Allah's\\n\\t\\t\\t\\tcreatures; they followed debasing forms of worship; they\\n\\t\\t\\t\\tmocked at Truth; and were at last punished with\\n\\t\\t\\t\\tdestruction in the Red Sea for their arrogant leaders and\\n\\t\\t\\t\\tarmy. See x. 75-90 for a narrative."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "43",
    "NoteID": "5159",
    "Body": "If the Egyptians with all their power and science were\\n\\t\\t\\t\\tunable to resist the punishment of their sins, the Pagan\\n\\t\\t\\t\\tQuraish are asked: how will you fare when you come to a\\n\\t\\t\\t\\ttrial of strength against Allah's Truth? You are not\\n\\t\\t\\t\\tspecially favoured so as to be immune from Allah's Law.\\n\\t\\t\\t\\tAnd if you rely on your numbers, they will be a broken\\n\\t\\t\\t\\treed when the trial comes, as indeed happened at the\\n\\t\\t\\t\\tBattle of Badr."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "46",
    "NoteID": "5160",
    "Body": "The calculations of unjust men-on their science, their\\n\\t\\t\\t\\tresources, their numbers, etc.-will in many cases be\\n\\t\\t\\t\\tfalsified even in this world, as stated in the last two\\n\\t\\t\\t\\tverses, but their real Punishment will come with\\n\\t\\t\\t\\tJudgment, i.e., when they find their real place in the\\n\\t\\t\\t\\tnext world at the restoration of true values. It will\\n\\t\\t\\t\\tthen be a most grievous and bitter experience for them,\\n\\t\\t\\t\\tthrowing into the shade any calamities they may suffer in\\n\\t\\t\\t\\tthis life."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "47",
    "NoteID": "5161",
    "Body": "Cf. liv. 24 above. Note how the tables are turned in the\\n\\t\\t\\t\\targument by the repetition. The unjust think that the\\n\\t\\t\\t\\tgodly are wandering in mind and mad. They will find that\\n\\t\\t\\t\\tit is really they who were wandering in mind, and mad,\\n\\t\\t\\t\\teven when they were in the plenitude of their power and\\n\\t\\t\\t\\tin the enjoyment of all the good things of this life.\\n\\t\\t\\t\\tThese minor echoes heighten the effect of the major\\n\\t\\t\\t\\trefrain mentioned in the Introduction."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "48",
    "NoteID": "5162",
    "Body": "\"On their faces\": the Face is the symbol of Personality.\\n\\t\\t\\t\\tTheir whole Personality will be subverted and degraded-in\\n\\t\\t\\t\\tthe midst of the Fire."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "49",
    "NoteID": "5163",
    "Body": "Allah's Creation is not haphazard. Everything goes by\\n\\t\\t\\t\\tlaw, proportion, and measure. Everything has its\\n\\t\\t\\t\\tappointed time, place, and occasion, as also its definite\\n\\t\\t\\t\\tlimitation. Nothing happens but according to His Plan,\\n\\t\\t\\t\\tand every deed, word, and thought of man has its fullest\\n\\t\\t\\t\\tconsequences, except in so far as the Grace or Mercy of\\n\\t\\t\\t\\tAllah intervenes, and that is according to law and plan."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "50",
    "NoteID": "5164",
    "Body": "While in the life of created things there is \"proportion\\n\\t\\t\\t\\tand measure\", and a lag of time or distance or\\n\\t\\t\\t\\tcircumstance, in Allah's Command, the Design, the Word,\\n\\t\\t\\t\\tthe Execution, and the Consequences are but a single Act.\\n\\t\\t\\t\\tThe simile given is that of the twinkling of an eye,\\n\\t\\t\\t\\twhich is the shortest time that a simple man can think\\n\\t\\t\\t\\tof: the cause which occasions the twinkling, the movement\\n\\t\\t\\t\\tof the muscles connected with it, the closing of the\\n\\t\\t\\t\\teyelids, and their reopening, are all almost like a\\n\\t\\t\\t\\tsimultaneous act. By way of contrast take an illustration\\n\\t\\t\\t\\tlike that of a man writing a book. He must form the\\n\\t\\t\\t\\tdesign in his mind; he must prepare himself by research,\\n\\t\\t\\t\\tcollection of knowledge, or of personal experience; he\\n\\t\\t\\t\\tmust use or acquire the art of writing; he must collect\\n\\t\\t\\t\\tthe materials for writing, viz., paper, ink, pen, etc.,\\n\\t\\t\\t\\tand this will connect with a chain of manufacturing\\n\\t\\t\\t\\tprocesses in which he is dependent upon other people's\\n\\t\\t\\t\\twork and experience; then his book may have to be printed\\n\\t\\t\\t\\tor lightographed or bound, and sold, or taken to a\\n\\t\\t\\t\\tlibrary, or presented to a friend, which will bring into\\n\\t\\t\\t\\tplay numerous other chains of processes, and dependence\\n\\t\\t\\t\\tupon other people's work or skill; and the lag of Time,\\n\\t\\t\\t\\tSpace, and Circumstance will occur at numerous stages. In\\n\\t\\t\\t\\tAllah's Command, the word \"Be\" (kun) includes everything,\\n\\t\\t\\t\\twithout the intervention, of or dependence upon any other\\n\\t\\t\\t\\tbeing or thing whatever. And this is also another phase\\n\\t\\t\\t\\tof the philosophy of Unity."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "51",
    "NoteID": "5165",
    "Body": "Ashyaakum: 'gangs or parties or collection of men like\\n\\t\\t\\t\\tyou.'-addressed to wicked men who arrogantly rely upon\\n\\t\\t\\t\\ttheir own strength or combination, neither of which can\\n\\t\\t\\t\\tstand for a moment against the Will of Allah."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "51",
    "NoteID": "5166",
    "Body": "The cases of Pharaoh's men of old and the Pagan Quraish\\n\\t\\t\\t\\tare considered as parallel, and an appeal is addressed to\\n\\t\\t\\t\\tthe latter from the experience of the former: 'will ye\\n\\t\\t\\t\\tnot learn and repent?'"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "52",
    "NoteID": "5167",
    "Body": "The point is that nothing which men do is lost-good or\\n\\t\\t\\t\\tevil. Everything gives rise to an inevitable chain of\\n\\t\\t\\t\\tconsequences, from which a release is only obtained by\\n\\t\\t\\t\\tthe intervention of Allah's Grace acting on an act, a\\n\\t\\t\\t\\tstriving of the human will to repent and turn to Allah."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "54",
    "NoteID": "5168",
    "Body": "The record, in the case of those who dishonoured and\\n\\t\\t\\t\\tviolated Truth, will lead to their undoing; but in the\\n\\t\\t\\t\\tcase of those who honoured the Truth and adopted it so as\\n\\t\\t\\t\\tto shine in their righteous lives, the result is\\n\\t\\t\\t\\texpressed by four metaphors, in an ascending degree of\\n\\t\\t\\t\\tsublimity: (1) they will be in the midst of Gardens where\\n\\t\\t\\t\\trivers flow; (2) they will be in sure abode; (3) with\\n\\t\\t\\t\\tAllah; (4) Whose sovereignty is omnipotent. \"Gardens\"\\n\\t\\t\\t\\twith Rivers (flowing beneath): this has been explained\\n\\t\\t\\t\\tmore than once already: Cf. n. 4668 to xliii. 70. The\\n\\t\\t\\t\\tGarden suggests all the Bliss we can imagine through our\\n\\t\\t\\t\\tsenses."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "55",
    "NoteID": "5169",
    "Body": "While we possess our bodily senses, the best conceptions\\n\\t\\t\\t\\twe can form are through our sense-perceptions."
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "55",
    "NoteID": "5170",
    "Body": "But there is a higher conception still, something that it\\n\\t\\t\\t\\tcan only be expressed by reference to the Presence of\\n\\t\\t\\t\\tAllah,"
  },
  {
    "SurahNumber": "54",
    "AyahNumber": "55",
    "NoteID": "5171",
    "Body": "Muqtadir, which is translated Omnipotent, implies\\n\\t\\t\\t\\tsomething more: the eighth- declension form denotes not\\n\\t\\t\\t\\tonly complete mastery, but the further idea that the\\n\\t\\t\\t\\tmastery arises from Allah's own nature, and depends on\\n\\t\\t\\t\\tnothing else whatever."
  }
]
