[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/060001",
        "Body":  "O ye who believe! take not My enemies and yours as friends (or\n\t\t\tprotectors) offering them (your) love even though they have\n\t\t\trejected the Truth that has come to you and have (on the\n\t\t\tcontrary) driven out the Prophet and yourselves (from your homes)\n\t\t\t(simply) because ye believe in Allah your Lord! If ye have come\n\t\t\tout to strive in My Way and to seek My Good Pleasure (take them\n\t\t\tnot as friends) holding secret converse of love (and friendship)\n\t\t\twith them: for I know full well all that ye conceal and all that\n\t\t\tye reveal.  And any of you that does this has strayed from the\n\t\t\tStraight Path. \u003cspan class=\u0027fn\u0027\u003e5409\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5410\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/060010",
        "Body":  "O ye who believe! when there come to you believing women refugees\n\t\t\texamine (and test) them: Allah knows best as to their Faith: if\n\t\t\tye ascertain that they are Believers then send them not back to\n\t\t\tthe Unbelievers.  They are not lawful (wives) for the Unbelievers\n\t\t\tnor are the (Unbelievers) lawful (husbands) for them.  But pay\n\t\t\tthe Unbelievers what they have spent (on their dower).\tAnd there\n\t\t\twill be no blame on you if ye marry them on payment of their\n\t\t\tdower to them.\tBut hold not to the guardianship of unbelieving\n\t\t\twomen: ask for what ye have spent on their dowers and let the\n\t\t\t(Unbelievers) ask for what they have spent (on the dowers of\n\t\t\twomen who come over to you).  Such is the command of Allah: He\n\t\t\tjudges (with justice) between you: and Allah is Full of Knowledge\n\t\t\tand Wisdom. \u003cspan class=\u0027fn\u0027\u003e5422\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5423\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5424\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5425\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/060011",
        "Body":  "And if any of your wives deserts you to the Unbelievers and ye\n\t\t\thave an accession (by the coming over of a woman from the other\n\t\t\tside) then pay to those whose wives have deserted the equivalent\n\t\t\tof what they had spent (on their (dower): and fear Allah in Whom\n\t\t\tye believe. \u003cspan class=\u0027fn\u0027\u003e5426\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/060012",
        "Body":  "O Prophet! when believing women come to thee to take the oath of\n\t\t\tfealty to thee that they will not associate in worship any other\n\t\t\tthing whatever with Allah that they will not steal that they will\n\t\t\tnot commit adultery (or fornication) that they will not kill\n\t\t\ttheir children that they will not utter slander intentionally\n\t\t\tforging falsehood and that they will not disobey thee in any just\n\t\t\tmatter\tthen do thou receive their fealty and pray to Allah for\n\t\t\tthe forgiveness (of their sins): for Allah is Oft-Forgiving Most\n\t\t\tMerciful. \u003cspan class=\u0027fn\u0027\u003e5427\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5428\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/060013",
        "Body":  "O ye who believe! turn not (for friendship) to people on whom is\n\t\t\tthe Wrath of Allah.  Of the Hereafter they are already in despair\n\t\t\tjust as the Unbelievers are in despair about those (buried) in\n\t\t\tgraves. \u003cspan class=\u0027fn\u0027\u003e5429\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5430\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/060002",
        "Body":  "If they were to get the better of you they would behave to you as\n\t\t\tenemies and stretch forth their hands and their tongues against\n\t\t\tyou for evil; and they desire that ye should reject the Truth.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5411\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/060003",
        "Body":  "Of no profit to you will be your relatives and your children on\n\t\t\tthe Day of Judgment: He will judge between you: for Allah sees\n\t\t\twell and that ye do. \u003cspan class=\u0027fn\u0027\u003e5412\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/060004",
        "Body":  "There is for you an excellent example (to follow) in Abraham and\n\t\t\tthose with him when they said to their people: \"We are clear of\n\t\t\tyou and of whatever ye worship besides Allah: we have rejected\n\t\t\tyou and there has arisen between us and you enmity and hatred\n\t\t\tforever unless ye believe in Allah and Him alone\": But not when\n\t\t\tAbraham said to his father: \"I will pray for forgiveness for thee\n\t\t\tthough I have no power (to get) aught on thy behalf from Allah.\"\n\t\t\t(They prayed): \"Our Lord! in Thee do we trust and to Thee do we\n\t\t\tturn in repentance: to Thee is (our) final Goal. \u003cspan class=\u0027fn\u0027\u003e5413\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5414\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5415\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5416\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/060005",
        "Body":  "\"Our Lord! Make us not a (test and) trial for the Unbelievers but\n\t\t\tforgive us our Lord! For Thou art the Exalted in Might the Wise.\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5417\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/060006",
        "Body":  "There was indeed in them an excellent example for you to follow\n\t\t\tfor those whose hope is in Allah and in the Last Day.  But if any\n\t\t\tturn away truly Allah is Free of all Wants Worthy of all Praise.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5418\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5419\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/060007",
        "Body":  "It may be that Allah will grant love (and friendship) between you\n\t\t\tand those whom ye (now) hold as enemies: for Allah has power\n\t\t\t(over all things); and Allah is Oft-Forgiving Most Merciful.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5420\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/060008",
        "Body":  "Allah forbids you not with regard to those who fight you not for\n\t\t\t(your) Faith nor drive you out of your homes from dealing kindly\n\t\t\tand justly with them: for Allah loveth those who are just.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5421\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "60",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/060009",
        "Body":  "Allah only forbids you with regard to those who fight you for\n\t\t\t(your) Faith and drive you out of your homes and support (others)\n\t\t\tin driving you out from turning to them (for friendship and\n\t\t\tprotection). It is such as turn to them (in these circumstances)\n\t\t\tthat do wrong."
    }
]
