[
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "1",
        "Recitation":  "Alafasy_128kbps/059001",
        "Body":  "Whatever is in the heavens and on earth let it declare the\n\t\t\tPraises and Glory of Allah: for He is the Exalted in Might the\n\t\t\tWise. \u003cspan class=\u0027fn\u0027\u003e5368\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "10",
        "Recitation":  "Alafasy_128kbps/059010",
        "Body":  "And those who came after them say: \"Our Lord! Forgive us and our\n\t\t\tbrethren who came before us into the Faith and leave not in our\n\t\t\thearts rancor (or sense of injury) against those who have\n\t\t\tbelieved our Lord! Thou art indeed Full of Kindness Most\n\t\t\tMerciful.\" \u003cspan class=\u0027fn\u0027\u003e5384\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5385\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "11",
        "Recitation":  "Alafasy_128kbps/059011",
        "Body":  "Hast thou not observed the Hypocrites say to their misbelieving\n\t\t\tbrethren among the People of the Book?\t\"If ye are expelled We\n\t\t\ttoo will go out with you and we will never hearken to anyone in\n\t\t\tyour affair; and if ye are attacked (in fight) we will help you.\"\n\t\t\tBut Allah is witness that they are indeed liars. \u003cspan class=\u0027fn\u0027\u003e5386\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5387\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "12",
        "Recitation":  "Alafasy_128kbps/059012",
        "Body":  "If they are expelled never will they go out with them; and if\n\t\t\tthey are attacked (in fight) they will never help them; and if\n\t\t\tthey do help them they will turn their backs; so they will\n\t\t\treceive no help. \u003cspan class=\u0027fn\u0027\u003e5388\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "13",
        "Recitation":  "Alafasy_128kbps/059013",
        "Body":  "Of a truth ye are stronger (than they) because of the terror in\n\t\t\ttheir hearts (sent) by Allah.  This is because they are men\n\t\t\tdevoid of understanding. \u003cspan class=\u0027fn\u0027\u003e5389\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "14",
        "Recitation":  "Alafasy_128kbps/059014",
        "Body":  "They will not fight you (even) together except in fortified\n\t\t\ttownships or from behind walls.  Strong is their fighting\n\t\t\t(spirit) amongst themselves: thou wouldst think they were united\n\t\t\tbut their hearts are divided: that is because they are a people\n\t\t\tdevoid of wisdom. \u003cspan class=\u0027fn\u0027\u003e5390\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5391\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "15",
        "Recitation":  "Alafasy_128kbps/059015",
        "Body":  "Like those who lately preceded them they have tasted the evil\n\t\t\tresult of their conduct and (in the Hereafter there is) for them\n\t\t\ta grievous Penalty \u003cspan class=\u0027fn\u0027\u003e5392\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "16",
        "Recitation":  "Alafasy_128kbps/059016",
        "Body":  "(Their allies deceived them) like the Evil One when he says to\n\t\t\tman \"Deny Allah\"; but when (man) denies Allah (the Evil One) says\n\t\t\t\"I am free of thee: I do fear Allah the Lord of the Worlds!\"\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5393\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "17",
        "Recitation":  "Alafasy_128kbps/059017",
        "Body":  "The end of both will be that they will go into the Fire dwelling\n\t\t\ttherein for ever. Such is the reward of wrong-doers."
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "18",
        "Recitation":  "Alafasy_128kbps/059018",
        "Body":  "O ye who believe! Fear Allah and let every soul look to what\n\t\t\t(provision) he has sent forth for the morrow.  Yea fear Allah:\n\t\t\tfor Allah is well-acquainted with (all) that ye do. \u003cspan class=\u0027fn\u0027\u003e5394\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5395\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "19",
        "Recitation":  "Alafasy_128kbps/059019",
        "Body":  "And be ye not like those who forget Allah; and He made them\n\t\t\tforget their own souls! such are the rebellious transgressors!\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5396\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "2",
        "Recitation":  "Alafasy_128kbps/059002",
        "Body":  "It is He who got out the Unbelievers among the People of the Book\n\t\t\tfrom their homes at the first gathering (of the forces).  Little\n\t\t\tdid ye think that they would get out: and they thought that their\n\t\t\tfortresses would defend them from Allah! but the (wrath of) Allah\n\t\t\tcame to them from quarters from which they little expected (it)\n\t\t\tand cast terror into their hearts so that they destroyed their\n\t\t\tdwellings by their own hands and the hands of the Believers. \n\t\t\tTake warning then O ye with eyes (to see)! \u003cspan class=\u0027fn\u0027\u003e5369\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5370\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5371\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5372\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "20",
        "Recitation":  "Alafasy_128kbps/059020",
        "Body":  "Not equal are the Companions of the Fire and the Companions of\n\t\t\tthe Garden: it is the Companions of the Garden that will achieve\n\t\t\tFelicity. \u003cspan class=\u0027fn\u0027\u003e5397\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "21",
        "Recitation":  "Alafasy_128kbps/059021",
        "Body":  "Had We sent down this Qur\u0027an on a mountain verily thou would have\n\t\t\tseen it humble itself and cleave asunder for fear of Allah such\n\t\t\tare the similitudes which We propound to men that they may\n\t\t\treflect. \u003cspan class=\u0027fn\u0027\u003e5398\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5399\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "22",
        "Recitation":  "Alafasy_128kbps/059022",
        "Body":  "Allah is He than whom there is no other god Who knows (all\n\t\t\tthings) both secret and open; He Most Gracious Most Merciful.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5400\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "23",
        "Recitation":  "Alafasy_128kbps/059023",
        "Body":  "Allah is He other than whom there is no other god the sovereign the\r\n\t\t\tHoly One the Source of Peace (and Perfection).\tThe Guardian of\r\n\t\t\tFaith the Preserver of Safety the Exalted in Might the\r\n\t\t\tIrresistible the Supreme: Glory to Allah! (high is He) above the\r\n\t\t\tpartners they attribute to Him. \u003cspan class=\u0027fn\u0027\u003e5401\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5402\u003c/span\u003e\r\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5403\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5404\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "24",
        "Recitation":  "Alafasy_128kbps/059024",
        "Body":  "He is Allah the Creator the Evolver the Bestower of Forms (or\n\t\t\tcolors).  To Him belong the Most Beautiful Names: Whatever is in\n\t\t\tthe heavens and on earth doth declare His Praises and Glory: and\n\t\t\tHe is the exalted in Might the Wise. \u003cspan class=\u0027fn\u0027\u003e5405\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5406\u003c/span\u003e\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5407\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5408\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "3",
        "Recitation":  "Alafasy_128kbps/059003",
        "Body":  "And had it not been that Allah has decreed banishment for them He\n\t\t\twould certainly have punished them in this world: and in the\n\t\t\tHereafter they shall (certainly) have the Punishment of the Fire.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5373\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "4",
        "Recitation":  "Alafasy_128kbps/059004",
        "Body":  "That is because they resisted Allah and His Apostle: and if\n\t\t\tanyone resists Allah verily Allah is severe in Punishment.\n\t\t\t\u003cspan class=\u0027fn\u0027\u003e5374\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "5",
        "Recitation":  "Alafasy_128kbps/059005",
        "Body":  "Whether ye cut down (o ye Muslims!) the tender palm-trees or ye\n\t\t\tleft them standing on their roots it was by leave of Allah and in\n\t\t\torder that He might cover with shame the rebellious\n\t\t\ttransgressors. \u003cspan class=\u0027fn\u0027\u003e5375\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5376\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "6",
        "Recitation":  "Alafasy_128kbps/059006",
        "Body":  "What Allah has bestowed on His Apostle (and taken away) from them\n\t\t\tfor this ye made no expedition with either cavalry or camelry:\n\t\t\tbut Allah gives power to His apostles over any He pleases: and\n\t\t\tAllah has power over all things. \u003cspan class=\u0027fn\u0027\u003e5377\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5378\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "7",
        "Recitation":  "Alafasy_128kbps/059007",
        "Body":  "What Allah has bestowed on His Apostle (and taken away) from the\n\t\t\tpeople of the townships belongs to Allah to His Apostle and to\n\t\t\tkindred and orphans the needy and the wayfarer; in order that it\n\t\t\tmay not (Merely) make a circuit between the wealth among you.  So\n\t\t\ttake what the Apostle assigns to you and deny yourselves that\n\t\t\twhich he withholds from you. And fear Allah; for Allah is strict\n\t\t\tin Punishment. \u003cspan class=\u0027fn\u0027\u003e5379\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5380\u003c/span\u003e \u003cspan class=\u0027fn\u0027\u003e5381\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "8",
        "Recitation":  "Alafasy_128kbps/059008",
        "Body":  "(Some part is due) to the indigent Muhajirs those who were\n\t\t\texpelled from their homes and their property while seeking Grace\n\t\t\tfrom Allah and (His) Good pleasure and aiding Allah and His\n\t\t\tApostle: such are indeed the sincere ones \u003cspan class=\u0027fn\u0027\u003e5382\u003c/span\u003e"
    },
    {
        "BookCode":  "YAT",
        "SurahNumber":  "59",
        "AyahNumber":  "9",
        "Recitation":  "Alafasy_128kbps/059009",
        "Body":  "But those who before them had homes (in Medina) and had adopted\n\t\t\tthe Faith show their affection to such as came to them for refuge\n\t\t\tand entertain no desire in their hearts for things given to the\n\t\t\t(latter) but give them preference over themselves even though\n\t\t\tpoverty was their (own lot).  And those saved from the\n\t\t\tcovetousness of their own souls they are the ones that achieve\n\t\t\tprosperity. \u003cspan class=\u0027fn\u0027\u003e5383\u003c/span\u003e"
    }
]
