[
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "1",
    "sectionHeading": "The Ghusl of the Two Ids, the Call to Prayer for Them, and the Iqama",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard more\\n\\t\\t\\t\\tthan one of their men of knowledge say, \"There has been\\n\\t\\t\\t\\tno call to prayer or iqama for the id al-Fitr or the id\\n\\t\\t\\t\\tal-Adha since the time of the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"That is the sunna about which there is no\\n\\t\\t\\t\\tdisagreement among us.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "2",
    "sectionHeading": "The Ghusl of the Two Ids, the Call to Prayer for Them, and the Iqama",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to do ghusl on the day of Fitr before going\\n\\t\\t\\t\\tto the place of prayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "3",
    "sectionHeading": "The Order to Pray Before the Khutba on the Two Ids",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to pray on the day of Fitr and the day of\\n\\t\\t\\t\\tAdha before the khutba.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "4",
    "sectionHeading": "The Order to Pray Before the Khutba on the Two Ids",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that Abu\\n\\t\\t\\t\\tBakr and Umar used to do that.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "5",
    "sectionHeading": "The Order to Pray Before the Khutba on the Two Ids",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Abu\\n\\t\\t\\t\\tUbayd, the mawla of Ibn Azhar said, \"I was present at an\\n\\t\\t\\t\\tid with Umar ibn al-Khattab. He prayed, and then after he\\n\\t\\t\\t\\thad prayed he gave a khutba to the people and said, 'The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, forbade fasting on these two days - the day you\\n\\t\\t\\t\\tbreak your fast (after Ramadan), and the day you eat from\\n\\t\\t\\t\\tyour sacrifice (after Hajj) .' \"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tAbu Ubaydcontinued,\"Then I was present at an id with\\n\\t\\t\\t\\tUthman ibn Affan. He came and prayed, and when he had\\n\\t\\t\\t\\tfinished he gave a khutba and said, 'Two ids have been\\n\\t\\t\\t\\tjoined together for you on this day of yours. If any of\\n\\t\\t\\t\\tthe people of al-Aliyya (the hills outlying Madina) want\\n\\t\\t\\t\\tto wait for the jumua they can do so, and if any of them\\n\\t\\t\\t\\twant to return, I have given them permission.' Abu Ubayd\\n\\t\\t\\t\\tcontinued, \"Then I was present at an id with AIi ibn Abi\\n\\t\\t\\t\\tTalib (at the time when Uthman was being detained). He\\n\\t\\t\\t\\tcame and prayed, and then after he had prayed he gave a\\n\\t\\t\\t\\tkhutba.\" \\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "6",
    "sectionHeading": "The Order to Eat Before Going Out on the Morning of the Id ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that he used to eat on the day of the id\\n\\t\\t\\t\\tal-Fitr before going out. \\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "7",
    "sectionHeading": "The Order to Eat Before Going Out on the Morning of the Id ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tal-Musayyab told him that people used to be told to eat\\n\\t\\t\\t\\ton the day of Fitr before setting out. Malik said that he\\n\\t\\t\\t\\tdid not consider that people had to do that for Adha. \\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "8",
    "sectionHeading": "The Takbir and the Recitation in the Prayer of the Two Ids ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Damra ibn Said\\n\\t\\t\\t\\tal-Mazini from Ubaydullah ibn Abdullah ibn Utba ibn Masud\\n\\t\\t\\t\\tthat Umar ibn al-Khattab asked Abu Waqid al-Laythi what\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, used to recite in the prayers of Adha and Fitr. He\\n\\t\\t\\t\\tsaid, \"He used to recite Qaf (Sura 50) and al-lnshiqaq\\n\\t\\t\\t\\t(Sura84).\" \\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "9",
    "sectionHeading": "The Takbir and the Recitation in the Prayer of the Two Ids ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Nafi, the mawla of\\n\\t\\t\\t\\tAbdullah ibn Umar said, \"I was at Adha and Fitr with Abu\\n\\t\\t\\t\\tHurayra and he said 'Allah is greater' seven times in the\\n\\t\\t\\t\\tfirst raka, before the recitation, and five times in the\\n\\t\\t\\t\\tsecond, before the recitation.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "10",
    "sectionHeading": "Refraining from Prayer Before and After the Two Id Prayers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar did not pray either before the prayer or after\\n\\t\\t\\t\\tit on the day of Fitr.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "11",
    "sectionHeading": "Refraining from Prayer Before and After the Two Id Prayers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tSaid ibn al-Musayyab used to go to the place of prayer\\n\\t\\t\\t\\tafter praying subh, and before the sun rose.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "12",
    "sectionHeading": "Permission to Pray Before and After the Two Id Prayers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tal-Qasim that his father used to pray four rakas before\\n\\t\\t\\t\\the went to the place of prayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "13",
    "sectionHeading": "Permission to Pray Before and After the Two Id Prayers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Hisham ibn Urwa that his father\\n\\t\\t\\t\\tused to pray on the day of Fitr before the prayer in the\\n\\t\\t\\t\\tmosque.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\t10.7 The Coming of the Imam on the Day of the Id and\\n\\t\\t\\t\\tWaiting for the Khutba\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "10",
    "hadithNumber": "14",
    "sectionHeading": "The Coming of the Imam on the Day of the Id and Waiting for the Khutba",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me that Malik said, \"The sunna\\n\\t\\t\\t\\tconcerning the time of prayer on the ids of Fitr and Adha\\n\\t\\t\\t\\t- and there is no disagreement amongst us about it - is\\n\\t\\t\\t\\tthat the imam leaves his house and as soon as he has\\n\\t\\t\\t\\treached the place of prayer the prayer falls due.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tYahya said that Malik was asked whether a man who prayed\\n\\t\\t\\t\\twith the imam could leave before the khutba, and he said,\\n\\t\\t\\t\\t\"He should not leave until the imam leaves.\" \\n\\t\\t\\t</p>"
  }
]
