[
  {
    "SurahNumber": "35",
    "AyahNumber": "1",
    "NoteID": "3869",
    "Body": "See n. 3785 to xxxiv. 1. When we praise Allah, it means\\n\\t\\t\\t\\tthat we understand and bring to mind that His glory and\\n\\t\\t\\t\\tpower are exercised for the good of His Creation, and\\n\\t\\t\\t\\tthis is the subject-matter of the Sura."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "1",
    "NoteID": "3870",
    "Body": "As man's knowledge of the processes of nature advances,\\n\\t\\t\\t\\the sees how complex is the evolution of matter itself,\\n\\t\\t\\t\\tleaving out the question of the origin of Life and the\\n\\t\\t\\t\\tspiritual forces, which are beyond the ken of\\n\\t\\t\\t\\texperimental science. But this knowledge itself becomes a\\n\\t\\t\\t\\tsort of \"veil of Light\": man becomes so conscious of the\\n\\t\\t\\t\\tproximate causes, that he is apt, in his pride, to forget\\n\\t\\t\\t\\tthe primal Cause, the ultimate hand of Allah in Creation.\\n\\t\\t\\t\\tAnd then, creation is such a complex process: see some of\\n\\t\\t\\t\\tthe ideas involved explained by different words in n. 120\\n\\t\\t\\t\\tto ii. 117. The word fatara here used means the creation\\n\\t\\t\\t\\tof primeval matter, to which further creative processes\\n\\t\\t\\t\\thave to be added by the hand of Allah, or Allah \"adds to\\n\\t\\t\\t\\tHis Creation as He pleases\", not only in quantity, but in\\n\\t\\t\\t\\tqualities, functions, relations and variations in\\n\\t\\t\\t\\tinfinite ways."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "1",
    "NoteID": "3871",
    "Body": "They are Messengers or Instruments of Allah's Will, and\\n\\t\\t\\t\\tmay have a few or numerous Errands entrusted to them. Cf.\\n\\t\\t\\t\\tthe description of the Spirit of Inspiration in xxvi.\\n\\t\\t\\t\\t193, and of the spirits or angels for executing the\\n\\t\\t\\t\\tCommands of Allah in lxxix. 1-5."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "1",
    "NoteID": "3872",
    "Body": "See n. 3870 above, where the complexities of the creative\\n\\t\\t\\t\\tprocesses is referred to Allah's creation did not stop at\\n\\t\\t\\t\\tsome past time: it continues, for He has all power, and\\n\\t\\t\\t\\tHis mercies are ever poured forth without stint."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "2",
    "NoteID": "3873",
    "Body": "As Allah is the Creator and Sustainer of all beings and\\n\\t\\t\\t\\tthings, so does His kindness extend to all Creatures. No\\n\\t\\t\\t\\tone can intercept Allah's mercies and gifts. Whatever is\\n\\t\\t\\t\\tHis Will and Plan and Purpose He can and does carry out.\\n\\t\\t\\t\\tAnd if from any creature He withholds any particular\\n\\t\\t\\t\\tgifts, there is no other person or power that can give\\n\\t\\t\\t\\tthose gifts. But such withholding is not arbitrary. He is\\n\\t\\t\\t\\tfull of wisdom and goodness, and every act of His,\\n\\t\\t\\t\\twhether He withholds or gives, is full of kindness and\\n\\t\\t\\t\\tmercy to His creatures."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "3",
    "NoteID": "3874",
    "Body": "As the primal Cause of all things is Allah, an appeal is\\n\\t\\t\\t\\tmade to man to turn to Allah instead of running after\\n\\t\\t\\t\\tfalse fancies. Allah is not only the source, but the\\n\\t\\t\\t\\tcentre of all life and activity, and all affairs return\\n\\t\\t\\t\\tto Him. The world is sustained, and human life is\\n\\t\\t\\t\\tsustained, by Allah's grace and providence. \"Sustenance\"\\n\\t\\t\\t\\tis to be taken, in Quranic language, for all that helps\\n\\t\\t\\t\\tto maintain and develop every aspect of life, physical\\n\\t\\t\\t\\tand spiritual. It would be the height of folly, then, for\\n\\t\\t\\t\\tman to ignore Allah's gracious Message, as explained in\\n\\t\\t\\t\\tHis Revelation."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "4",
    "NoteID": "3875",
    "Body": "And yet there will be human perversity which will reject\\n\\t\\t\\t\\tthe True and accept the False. The prophet of Allah is\\n\\t\\t\\t\\tnot discouraged by this, as everything ultimately retums\\n\\t\\t\\t\\tto Allah, and we must trust to His Wisdom in His\\n\\t\\t\\t\\tUniversal Plan."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "5",
    "NoteID": "3876",
    "Body": "In verse 3 above the appeal was on the basis of the Past\\n\\t\\t\\t\\tand the Present: now the appeal is on the basis of the\\n\\t\\t\\t\\tFuture. Allah's grace has promised us the Garden of\\n\\t\\t\\t\\tBliss; His justice has promised us the Fire of Suffering.\\n\\t\\t\\t\\tBoth promises are certain to be fulfilled. On which side\\n\\t\\t\\t\\tshall we range ourselves?"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "5",
    "NoteID": "3877",
    "Body": "Cf. xxxi. 33 and n. 3624. The deception of Evil takes two\\n\\t\\t\\t\\tforms. (1) The seductive temptations of this world may\\n\\t\\t\\t\\tdeceive us into forgetting the Hereafter. (2) The\\n\\t\\t\\t\\tArch-Enemy himself may so blind our vision that we may\\n\\t\\t\\t\\tsay with him, \"Evil! be thou my good!\" We may be misled\\n\\t\\t\\t\\tby easy stages. Are we on our guard?"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "6",
    "NoteID": "3878",
    "Body": "Evil is our enemy and should be treated as such. It is\\n\\t\\t\\t\\treally foreign to our nature, however much it may\\n\\t\\t\\t\\tdisguise itself to deceive us as our friend, or a part of\\n\\t\\t\\t\\tour own nature. Personifying the Spirit of Evil, we may\\n\\t\\t\\t\\tsay that he wants us to share in his own damnation. Shall\\n\\t\\t\\t\\twe allow ourselves to fall into his snare?"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "7",
    "NoteID": "3879",
    "Body": "To reject Allah is to reject all the good which He has\\n\\t\\t\\t\\timplanted in our nature. Are we going to be false to the\\n\\t\\t\\t\\ttrue Pattern according to which He created us, and suffer\\n\\t\\t\\t\\tthe consequences? Or are we going to be true to that\\n\\t\\t\\t\\tPattern and achieve the high and noble Destiny intended\\n\\t\\t\\t\\tfor us?"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "8",
    "NoteID": "3880",
    "Body": "Cf. n. 3877 above. When a stage is reached at which a man\\n\\t\\t\\t\\taccepts Evil as his Good, his case is hopeless. Can such\\n\\t\\t\\t\\ta man profit by preaching or guidance? He has himself\\n\\t\\t\\t\\tdeliberately rejected all guidance. Such a man is best\\n\\t\\t\\t\\tleft to stray. Perhaps, even in the paths in which he is\\n\\t\\t\\t\\tstraying, some sudden flash of light may come to him!\\n\\t\\t\\t\\tThat may be as Allah wills in His holy and wise Purpose\\n\\t\\t\\t\\tand Plan. But the prophet of Allah is not to worry or\\n\\t\\t\\t\\tfeel disheartened by such men's attitude. He must go on\\n\\t\\t\\t\\ttilling the soil that is open to him. For Allah's Plan\\n\\t\\t\\t\\tmay work in all sorts of unexpected ways, as in the\\n\\t\\t\\t\\tallegory in the next verse."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "9",
    "NoteID": "3881",
    "Body": "The allegory here is double. (1) Dry, unpromising soil\\n\\t\\t\\t\\tmay seem to all intents and purposes dead; there is no\\n\\t\\t\\t\\tsource of water near; moisture is sucked up by the sun's\\n\\t\\t\\t\\theat in a far-off ocean, and clouds are formed; winds\\n\\t\\t\\t\\tarise; it seems as if the wind \"bloweth as it listeth\",\\n\\t\\t\\t\\tbut it is really Allah's Providence that drives it to the\\n\\t\\t\\t\\tdead land; the rain falls, and behold! there is life and\\n\\t\\t\\t\\tmotion and beauty everywhere! So in the spiritual world,\\n\\t\\t\\t\\tAllah's Revelation is His Mercy and His Rain; there may\\n\\t\\t\\t\\tbe the individual resurrection (Nushur) or unfolding of a\\n\\t\\t\\t\\tsoul. (2) So again, may be the general Resurrection\\n\\t\\t\\t\\t(Nushur), the unfolding of a new World in the Hereafter,\\n\\t\\t\\t\\tout of an old World that is folded up and dead (Takwir,\\n\\t\\t\\t\\tS. lxxxi)."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "10",
    "NoteID": "3882",
    "Body": "Good and Evil are to be distinguished sharply. No good is\\n\\t\\t\\t\\tever lost: it goes up to Allah. The humblest Good, in\\n\\t\\t\\t\\tword or deed, is exalted to high rank. If man seeks for\\n\\t\\t\\t\\tmere glory and power, there is no such thing apart from\\n\\t\\t\\t\\tAllah. But seeking Allah, we attain to the highest glory\\n\\t\\t\\t\\tand power."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "10",
    "NoteID": "3883",
    "Body": "It is the nature of Evil to work underground, to hide\\n\\t\\t\\t\\tfrom the Light, to plot against Righteousness; but Evil\\n\\t\\t\\t\\tinevitably carries its own punishment. Its plots must\\n\\t\\t\\t\\tfail miserably. And eventually Evil itself is to be\\n\\t\\t\\t\\tblotted out."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "11",
    "NoteID": "3884",
    "Body": "Cf. xviii. 37 and n. 2379; xxii. 5 and n. 2773; and xxx.\\n\\t\\t\\t\\t20, and n. 3524. Here the argument is that man's physical\\n\\t\\t\\t\\torigin is lowly: his physical body is but dust; his\\n\\t\\t\\t\\tlife-sperm issues from a part of his body which he hides\\n\\t\\t\\t\\tand considers as a place of shame; and the mystery of sex\\n\\t\\t\\t\\tshows that no one individual among mankind is sufficient\\n\\t\\t\\t\\tin himself. Glory and power and knowledge are not in him,\\n\\t\\t\\t\\tbut in Allah, from Whom alone he derives any glory, or\\n\\t\\t\\t\\tpower, or knowledge that he possesses."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "11",
    "NoteID": "3885",
    "Body": "\"Then\" in this and the following clause refers, not to\\n\\t\\t\\t\\tstages of time, but to stages in the argument. It is\\n\\t\\t\\t\\talmost equivalent to \"further\", \"also\", and \"in\\n\\t\\t\\t\\taddition\"."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "11",
    "NoteID": "3886",
    "Body": "Things that appear most secret and mysterious to man are\\n\\t\\t\\t\\tall known and ordained by Allah. They are all subject to\\n\\t\\t\\t\\tAllah's Laws and Decrees. The mystery of human birth (see\\n\\t\\t\\t\\tn. 3625 to xxxi. 34), the mystery of sex, the mystery of\\n\\t\\t\\t\\tLife and Death and many other things, seem to man\\n\\t\\t\\t\\tinexplicable. But they are all ordained by Allah, and\\n\\t\\t\\t\\ttheir reasons are fully known to Him."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "11",
    "NoteID": "3887",
    "Body": "Man's knowledge may be acquired laboriously and may be a\\n\\t\\t\\t\\tburden to him. Allah's knowledge is different; it is not\\n\\t\\t\\t\\ttask or burden to Him. Cf. xxxiii. 19 and 30."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "12",
    "NoteID": "3888",
    "Body": "See xxv. 53 and notes 3111 and 3112. The great salt Ocean\\n\\t\\t\\t\\twith its seas and gulfs is all one: and the great masses\\n\\t\\t\\t\\tof sweet water in rivers, lakes, ponds, and underground\\n\\t\\t\\t\\tsprings are also one: and each is connected with the\\n\\t\\t\\t\\tother by the constant circulation going on, which sucks\\n\\t\\t\\t\\tup vapours, carries them about in clouds or atmospheric\\n\\t\\t\\t\\tmoisture, and again brings them condensed into water or\\n\\t\\t\\t\\tsnow or hail to mingle with rivers and streams and get\\n\\t\\t\\t\\tback into the Ocean."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "12",
    "NoteID": "3889",
    "Body": "For this whole passage see xvi. 14 and notes 2034 and\\n\\t\\t\\t\\t2035. Both from the sea and from rivers and lakes we get\\n\\t\\t\\t\\tfish, of which some kinds have a flesh particularly fresh\\n\\t\\t\\t\\tand tender, and of a most delicate flavour."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "12",
    "NoteID": "3890",
    "Body": "Such as pearls and coral from the sea, and such\\n\\t\\t\\t\\tdelicately tinted stones as the Aqiq (carnelian), the\\n\\t\\t\\t\\tagate, the goldstone, or other varieties of quartz\\n\\t\\t\\t\\tpebbles found in river-beds, and considered as gems. Many\\n\\t\\t\\t\\tsuch are found in the Ken river in Banda District (in\\n\\t\\t\\t\\tIndia). Some river sands also yield minute quantities of\\n\\t\\t\\t\\tgold. In large navigable rivers and big Lakes like those\\n\\t\\t\\t\\tof North America, as well as in the sea, there are\\n\\t\\t\\t\\thighways for shipping and commerce."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "13",
    "NoteID": "3891",
    "Body": "Cf. xxii. 61. The phases of Light in nature may have\\n\\t\\t\\t\\tother uses. But for man they mark periods of rest and\\n\\t\\t\\t\\tactivity, and have great influence on his physical,\\n\\t\\t\\t\\tmoral, and spiritual life."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "13",
    "NoteID": "3892",
    "Body": "Cf. xiii. 2. The sun and the moon mark phases of light,\\n\\t\\t\\t\\tand serve man during the periods of the day and the\\n\\t\\t\\t\\tnight. The sun marks the seasons, and is the source of\\n\\t\\t\\t\\theat and energy and physical life for the whole solar\\n\\t\\t\\t\\tsystem. The sun and the moon run according to fixed laws,\\n\\t\\t\\t\\tand they will continue to do so, not for ever, but for\\n\\t\\t\\t\\tthe period appointed for their duration by Allah."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "13",
    "NoteID": "3893",
    "Body": "Allah's might and majesty, and Allah's goodness and\\n\\t\\t\\t\\twisdom, having been shown by a few examples, it follows\\n\\t\\t\\t\\tthat it is folly to seek or worship any other power but\\n\\t\\t\\t\\tAllah. It only throws off man into false paths, and takes\\n\\t\\t\\t\\thim farther and farther away from the Truth."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "13",
    "NoteID": "3894",
    "Body": "Qitmir: the thin, white skin that covers the date-stone.\\n\\t\\t\\t\\tIt has neither strength nor texture, and has no value\\n\\t\\t\\t\\twhatever. Any one relying on any power other than that of\\n\\t\\t\\t\\tAllah relies on nothing whatever. The Qitmir is worse\\n\\t\\t\\t\\tthan the proverbial \"broken reed\". Cf. iv. 53 and iv.\\n\\t\\t\\t\\t124, where the word naqir, 'the groove in a date-stone',\\n\\t\\t\\t\\tis used similarly for a thing of no value or\\n\\t\\t\\t\\tsignificance."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "14",
    "NoteID": "3895",
    "Body": "False or imaginary objects of worship serve no purpose\\n\\t\\t\\t\\twhatever. They cannot hear; if they could hear, they\\n\\t\\t\\t\\tcould not grant prayers or petitions. In fact, if they\\n\\t\\t\\t\\tare real creatures, such as angels or deified human\\n\\t\\t\\t\\tbeings, they will very rightly repudiate any such worship\\n\\t\\t\\t\\tas brings them into competition or \"partnership\" with\\n\\t\\t\\t\\tAllah. See next note."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "14",
    "NoteID": "3896",
    "Body": "Cf. x. 28 and n. 1418; also xxxiv. 40-41. No false ideas\\n\\t\\t\\t\\tor false impressions will remain when true values are\\n\\t\\t\\t\\trestored. Why not then accept the Truth now in this life,\\n\\t\\t\\t\\tand get on to the true path of Grace?"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "14",
    "NoteID": "3897",
    "Body": "None can tell you the Truth better than He Who is\\n\\t\\t\\t\\tAll-Wise and All-knowing. Why not accept His Message and\\n\\t\\t\\t\\treceive His guidance?"
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "15",
    "NoteID": "3898",
    "Body": "What is man that Allah should care for him, instruct him,\\n\\t\\t\\t\\tand send him special messengers to warn him of danger and\\n\\t\\t\\t\\tharm? It is man that depends on Allah and has need of Him\\n\\t\\t\\t\\tevery moment of his life. Allah has no need of him, but\\n\\t\\t\\t\\tHe bestows His Grace on him as on all His creatures, out\\n\\t\\t\\t\\tof His unbounded Mercy and loving-kindness. If it were\\n\\t\\t\\t\\tAllah's Will, He could blot out man for his rebellion and\\n\\t\\t\\t\\tcreate an entirely new world."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "17",
    "NoteID": "3899",
    "Body": "There is no limit to Allah's creative power, nor is His\\n\\t\\t\\t\\tcreative energy anything rare or unusual. This is the\\n\\t\\t\\t\\tforce of the word 'aziz here. Allah's creative energy is\\n\\t\\t\\t\\texercised every moment, and it is the normal condition in\\n\\t\\t\\t\\tthe universe."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "18",
    "NoteID": "3900",
    "Body": "Bearer: hamilatun: feminine in Arabic, as referring to\\n\\t\\t\\t\\tthe soul (nafs), as in vi. 164."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "18",
    "NoteID": "3901",
    "Body": "Natural relationship may be considered as a reasonable\\n\\t\\t\\t\\tcause or opportunity for bearing each other's burdens.\\n\\t\\t\\t\\tFor example, a mother or a father might offer to die for\\n\\t\\t\\t\\ther or his child, and vice versa. But this does not apply\\n\\t\\t\\t\\tto spiritual matters. There the responsibility is\\n\\t\\t\\t\\tstrictly personal and cannot be transferred to another.\\n\\t\\t\\t\\tIn xxix. 13 we are told that the misleaders \"will bear\\n\\t\\t\\t\\tother burdens along with their own\"; but the context\\n\\t\\t\\t\\tshows that the \"other\" burdens are the burdens of\\n\\t\\t\\t\\tdeluding others with their falsehoods. Both sins are\\n\\t\\t\\t\\ttheir own, viz., their original sin, and the sin of\\n\\t\\t\\t\\tdeluding the others. But the responsibility will be\\n\\t\\t\\t\\tdoubled."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "18",
    "NoteID": "3902",
    "Body": "Bil-gaibi: unseen in the adverbial sense. The man, who,\\n\\t\\t\\t\\tthough he does not see Allah, so realises Allah's\\n\\t\\t\\t\\tPresence in himself as if he saw Him, is the man of\\n\\t\\t\\t\\tgenuine Faith, and for him Allah's Revelation comes\\n\\t\\t\\t\\tthrough many channels and is always fruitful."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "18",
    "NoteID": "3903",
    "Body": "Prayer is one of the means of purifying ourselves of\\n\\t\\t\\t\\tlower motives in life, for in prayer we seek the Presence\\n\\t\\t\\t\\tof Allah. But the purity which we seek is for our own\\n\\t\\t\\t\\tsouls: we confer no favour on Allah or on any Power in\\n\\t\\t\\t\\tthe spiritual world, as some imagine who make \"gifts\" to\\n\\t\\t\\t\\tAllah. In any case the destination of all is to Allah."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "19",
    "NoteID": "3904",
    "Body": "Now we are offered some contrasts between those who obey\\n\\t\\t\\t\\tAllah's Law and are thus citizens of Allah's Kingdom and\\n\\t\\t\\t\\tthose who are rebels against Allah's Kingdom and are thus\\n\\t\\t\\t\\toutlaws. How can they be considered alike? The godly are\\n\\t\\t\\t\\tlike those who see, as contrasted with those who are\\n\\t\\t\\t\\tblind; and their motives and actions are like the purest\\n\\t\\t\\t\\tand highest Light, contrasted with the depths of\\n\\t\\t\\t\\tdarkness; or, to take another metaphor, their lives are\\n\\t\\t\\t\\tlike the genial and warmth-giving heat of the sun, which\\n\\t\\t\\t\\tbenefits all who come within its influence, contrasted\\n\\t\\t\\t\\twith the chilly shadows of gloom in which no vegetation\\n\\t\\t\\t\\tflourishes."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "22",
    "NoteID": "3905",
    "Body": "The final contrast is between the Living and the Dead;\\n\\t\\t\\t\\tthose whose future has in it the promise of growth and\\n\\t\\t\\t\\tfulfilment, and those who are inert and on the road to\\n\\t\\t\\t\\tperish. With Allah everything is possible: He can give\\n\\t\\t\\t\\tLife to the Dead. But the human Teacher should not expect\\n\\t\\t\\t\\tthat people who are (spiritually) dead and buried will by\\n\\t\\t\\t\\tany chance hear his call."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "23",
    "NoteID": "3906",
    "Body": "The function of a Prophet is to preach Allah's Truth, to\\n\\t\\t\\t\\tpoint out the right Way, to show men the need of\\n\\t\\t\\t\\trepentance, and to warn them against the dangers which\\n\\t\\t\\t\\tthey incur by living a life of evil. He cannot compel\\n\\t\\t\\t\\tthem to accept the Truth or listen to the Message."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "24",
    "NoteID": "3907",
    "Body": "It is Allah Who sends the Revelation. While there is\\n\\t\\t\\t\\twarning in it for the heedless, there is good news for\\n\\t\\t\\t\\tthose who listen and repent. The warning always came to\\n\\t\\t\\t\\tall peoples before punishment."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "25",
    "NoteID": "3908",
    "Body": "The three things here mentioned are also mentioned in\\n\\t\\t\\t\\tiii. 184, where I have explained the meaning in n. 490.\\n\\t\\t\\t\\tAll spiritual teaching centres round the evidences of\\n\\t\\t\\t\\tAllah in our lives, the sublime teaching of Prophets of\\n\\t\\t\\t\\tAllah, and the rules and laws which guide holy living."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "26",
    "NoteID": "3909",
    "Body": "Cf. xxii. 44 and xxxiv. 45. The rejecters of Allah hardly\\n\\t\\t\\t\\trealise the terrible consequences to them individually\\n\\t\\t\\t\\tand collectively, if Allah's grace is withdrawn from them\\n\\t\\t\\t\\tand they are left to perish in their own sins and\\n\\t\\t\\t\\twrong-doing."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "27",
    "NoteID": "3910",
    "Body": "Everyone can see how Allah's artistry produces from rain\\n\\t\\t\\t\\tthe wonderful variety of crops and fruits-golden, green,\\n\\t\\t\\t\\tred, yellow, and showing all the most beautiful tints we\\n\\t\\t\\t\\tcan think of. And each undergoes in nature the gradual\\n\\t\\t\\t\\tshading off in its transformation from the raw stage to\\n\\t\\t\\t\\tthe stage of maturity."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "27",
    "NoteID": "3911",
    "Body": "These wonderful colours and shades of colours are to be\\n\\t\\t\\t\\tfound not only in vegetation but in rocks and mineral\\n\\t\\t\\t\\tproducts. There are the white veins of marble and quartz\\n\\t\\t\\t\\tor of chalk, the red laterite, the blue basaltic rocks,\\n\\t\\t\\t\\tthe ink-black flints, and all the variety, shade, and\\n\\t\\t\\t\\tgradation of colours. Speaking of mountains, we think of\\n\\t\\t\\t\\ttheir \"azure hue\" from a distance, due to atmospheric\\n\\t\\t\\t\\teffects, and these atmospheric effects lead our thoughts\\n\\t\\t\\t\\tto the glories of clouds, sunsets, the zodiacal light,\\n\\t\\t\\t\\tthe aurora borealis, and all kinds of Nature's gorgeous\\n\\t\\t\\t\\tpageantry."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "28",
    "NoteID": "3912",
    "Body": "In the physical shapes of human and animal life, also, we\\n\\t\\t\\t\\tsee variations in shades and gradations of colours of all\\n\\t\\t\\t\\tkinds. But these variations and gradations, marvellous\\n\\t\\t\\t\\tthough they be, are as nothing compared with the\\n\\t\\t\\t\\tvariations and differences in the inner or spiritual\\n\\t\\t\\t\\tworld. See next note."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "28",
    "NoteID": "3913",
    "Body": "In outer nature we can, through colours, understand and\\n\\t\\t\\t\\tappreciate the finest shades and gradations. But in the\\n\\t\\t\\t\\tspiritual world that variation or gradation is even more\\n\\t\\t\\t\\tsubtle and more comprehensive. Who can truly understand\\n\\t\\t\\t\\tit? Only Allah's servants, who know, i.e., who have the\\n\\t\\t\\t\\tinner knowledge which comes through their acquaintance\\n\\t\\t\\t\\twith the spiritual world,-it is such people who truly\\n\\t\\t\\t\\tappreciate the inner world, and it is they who know that\\n\\t\\t\\t\\tthe fear of Allah is the beginning of wisdom. For such\\n\\t\\t\\t\\tfear is akin to appreciation and love,-appreciation of\\n\\t\\t\\t\\tall the marvellous beauties of Allah's outer and inner\\n\\t\\t\\t\\tworld (\"Allah is Exalted in Might\") and love because of\\n\\t\\t\\t\\tHis Grace and Kindness (\"Oft-Forgiving\"). But Allah's\\n\\t\\t\\t\\tforgiveness extends to many who do not truly understand\\n\\t\\t\\t\\tHim."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "29",
    "NoteID": "3914",
    "Body": "The man of God takes Allah's Revelation (\"the Book\") to\\n\\t\\t\\t\\theart, ever seeks to get closer and closer to Allah\\n\\t\\t\\t\\t(\"regular Prayer\"), and in doing so, is moved more and\\n\\t\\t\\t\\tmore to practical Charity for his fellow-creatures. He is\\n\\t\\t\\t\\tnot ashamed of his Charity (\"openly\"), but he does not do\\n\\t\\t\\t\\tit to be seen by men (\"secretly\"): he just does what is\\n\\t\\t\\t\\tnecessary for his fellow-creatures, whether people talk\\n\\t\\t\\t\\tabout it or not."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "29",
    "NoteID": "3915",
    "Body": "Here is a metaphor from commerce. The good man's Charity\\n\\t\\t\\t\\tcomes not merely out of superfluities, but out of \"what\\n\\t\\t\\t\\tAllah has provided\" for him. He therefore recognises two\\n\\t\\t\\t\\tthings: (1) that his wealth (literal and metaphorical) is\\n\\t\\t\\t\\tnot his absolutely, but that it is given to him by Allah;\\n\\t\\t\\t\\tand (2) that he must deny himself the use of some of it,\\n\\t\\t\\t\\tas a merchant puts by some of his wealth to invest as\\n\\t\\t\\t\\tcapital. Only, the godly man's commerce will never fail\\n\\t\\t\\t\\tor fluctuate; because Allah guarantees him the return,\\n\\t\\t\\t\\tand even adds something to the return out of His own\\n\\t\\t\\t\\tBounty. That is, Allah gives more than ever our merits\\n\\t\\t\\t\\tdeserve."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "30",
    "NoteID": "3916",
    "Body": "No man is perfect. Everyone has his fault. But when a man\\n\\t\\t\\t\\ttries his best in the service of Allah, his faults are\\n\\t\\t\\t\\tblotted out, and he is treated as if he had committed no\\n\\t\\t\\t\\tfaults: \"for Allah is Oft-Forgiving, and ready to\\n\\t\\t\\t\\tappreciate service\"."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "30",
    "NoteID": "3917",
    "Body": "Cf. xiv. 5, and n. 2877 for shakur. Allah is ready to\\n\\t\\t\\t\\trecognise, appreciate, and reward the smallest service,\\n\\t\\t\\t\\twithout regard to the defects in that service. His\\n\\t\\t\\t\\tgracious acceptance is compared to \"gratitude\" among men."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "31",
    "NoteID": "3918",
    "Body": "All Revelation is one. The Qur-an therefore confirms the\\n\\t\\t\\t\\tmain and uncorrupted features of previous revelations. It\\n\\t\\t\\t\\tmust be so, because Allah is fully cognisant of the needs\\n\\t\\t\\t\\tof every age and people; and therefore His Message, while\\n\\t\\t\\t\\tit meets those needs, must in essence be the same. His\\n\\t\\t\\t\\tMessengers did not meet each other as men; but their\\n\\t\\t\\t\\tcontact with Allah through inspiration unified their\\n\\t\\t\\t\\tMessage. And He cares for and watches over all men, and\\n\\t\\t\\t\\tHe knows fully what their needs are, even better than\\n\\t\\t\\t\\tthey know themselves."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "32",
    "NoteID": "3919",
    "Body": "The force of \"then\" is that of finality. The Qur-an is\\n\\t\\t\\t\\tthat last Book revealed. Or it may be here to point the\\n\\t\\t\\t\\tcontrast between \"to thee\" in the last verse, i.e., the\\n\\t\\t\\t\\tholy Prophet, in contradistinction to the People of\\n\\t\\t\\t\\tIslam, who inherited the Book after him."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "32",
    "NoteID": "3920",
    "Body": "The custodians of the Qur-an after the holy Prophet were\\n\\t\\t\\t\\tthe People of Islam. They were chosen for the Book, not\\n\\t\\t\\t\\tin any narrow sense, but in the sense that the Book was\\n\\t\\t\\t\\tgiven for their age and they were charged to obey it and\\n\\t\\t\\t\\tpreserve and propagate it, so that all mankind should\\n\\t\\t\\t\\treceive the Message. But it does not follow that they are\\n\\t\\t\\t\\tall true and faithful to their charge, as indeed we see\\n\\t\\t\\t\\ttoo painfully around us to-day. Just as mankind was\\n\\t\\t\\t\\tchosen collectively to be Vicegerents and yet some among\\n\\t\\t\\t\\tmankind fell into evil,-even so, some in the house of\\n\\t\\t\\t\\tIslam fail to follow the Light given to them, and thus\\n\\t\\t\\t\\t\"wrong their own souls\". But some follow a middle course:\\n\\t\\t\\t\\tin their case \"the spirit indeed is willing, but the\\n\\t\\t\\t\\tflesh is weak\": their intentions are good, but they have\\n\\t\\t\\t\\tmuch to learn yet of the true Muslim life and Muslim\\n\\t\\t\\t\\tvirtues. Then there is a third class: they may not indeed\\n\\t\\t\\t\\tbe perfect, but both their intentions and their conduct\\n\\t\\t\\t\\tare sound, and they form an example to other men: they\\n\\t\\t\\t\\tare \"foremost\" in every good deed. They are so, not by\\n\\t\\t\\t\\ttheir own merits, but by the Grace of Allah. And they\\n\\t\\t\\t\\thave reached the highest Achievement,- the salvation."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "33",
    "NoteID": "3921",
    "Body": "\"The Garden\" signifies their environment: all they see\\n\\t\\t\\t\\tabout them will give them comfort, rest, and\\n\\t\\t\\t\\tsatisfaction, and a feeling of beauty and dignity. The\\n\\t\\t\\t\\tjewels and clothes signify their personal external state:\\n\\t\\t\\t\\there, again, everything will give them a sense of beauty\\n\\t\\t\\t\\tand dignity, comfort, rest, and satisfaction. And\\n\\t\\t\\t\\tfinally, most important of all, comes their internal\\n\\t\\t\\t\\tstate, where again they will have the same sense of\\n\\t\\t\\t\\tbeauty, dignity, comfort, rest, and satisfaction: this is\\n\\t\\t\\t\\tindicated by their words of Praise (verses 34-35)."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "33",
    "NoteID": "3922",
    "Body": "Cf. xviii. 31 and xxii. 23."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "34",
    "NoteID": "3923",
    "Body": "Cf. above. xxxv. 30. Note how beautifully the argument is\\n\\t\\t\\t\\trounded off. In verse 30 they were told that \"Allah is\\n\\t\\t\\t\\tOft-Forgiving, Most Ready to appreciate service\". Now\\n\\t\\t\\t\\tthey have reached the Goal, and they have found the\\n\\t\\t\\t\\tPromise profoundly true. All their hopes are fulfilled,\\n\\t\\t\\t\\tand their sorrows ended."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "35",
    "NoteID": "3924",
    "Body": "In case it should be thought that perpetual happiness\\n\\t\\t\\t\\tmight cloy or be dull, as would be the case in this life,\\n\\t\\t\\t\\tit is added-as the experience of those who attain that\\n\\t\\t\\t\\tstate-that it is not so on that plane of existence. Not\\n\\t\\t\\t\\tonly is there Joy, but it remains fresh and leads to no\\n\\t\\t\\t\\tweariness."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "36",
    "NoteID": "3925",
    "Body": "The \"Fire\" is the opposite to the \"Garden\". Instead of\\n\\t\\t\\t\\tthere being comfort, rest, and satisfaction in their\\n\\t\\t\\t\\tenvironment, there will be pain, suffering and anguish.\\n\\t\\t\\t\\tInstead of there being dignity there will be humiliation.\\n\\t\\t\\t\\tAnd there will be no hope of its termination or\\n\\t\\t\\t\\tabatement, not even a hope of annihilation."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "37",
    "NoteID": "3926",
    "Body": "Cf. xxiii 107. Not only will their surroundings be the\\n\\t\\t\\t\\topposite of those in Heaven: their internal state will be\\n\\t\\t\\t\\tone of humiliation, of piteous and fruitless appeals, of\\n\\t\\t\\t\\tvain regrets for a past that cannot be recalled, and vain\\n\\t\\t\\t\\tsights for a future whose gates they have themselves\\n\\t\\t\\t\\tbarred. If they were sent back, they would relapse to\\n\\t\\t\\t\\ttheir sins. Cf. vi. 28."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "37",
    "NoteID": "3927",
    "Body": "Cf. vii. 53. Their hankering after another chance, after\\n\\t\\t\\t\\thaving deliberately rejected all chances, will have no\\n\\t\\t\\t\\tbasis of reason in it."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "37",
    "NoteID": "3928",
    "Body": "They had a long enough respite for repentance and\\n\\t\\t\\t\\tamendment. And moreover, besides all the other sources,\\n\\t\\t\\t\\tin nature, history, and their own hearts, by which they\\n\\t\\t\\t\\tcould learn of the Right, they had the actual teaching\\n\\t\\t\\t\\tand warning of a messenger whose words spoke direct to\\n\\t\\t\\t\\tthem. In the circumstances the Penalty is only the fruit\\n\\t\\t\\t\\tof their own conduct."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "38",
    "NoteID": "3929",
    "Body": "Everything that exists is known to Allah: not only\\n\\t\\t\\t\\tconcrete things, but feelings, motives, plans, and acts\\n\\t\\t\\t\\tof the will in the human breast."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "39",
    "NoteID": "3930",
    "Body": "Inheritors: khalaif. In two senses: (1) as Vicegerents on\\n\\t\\t\\t\\tearth, and (2) as successors to previous people who\\n\\t\\t\\t\\tforfeited their rights by wrong-doing. The honour and\\n\\t\\t\\t\\tdignity of (1) and the examples of the past in (2) should\\n\\t\\t\\t\\thave kept them straight and made them truly grateful. See\\n\\t\\t\\t\\talso vi. 165 and n. 988."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "39",
    "NoteID": "3931",
    "Body": "Their rejection and ingratitude only causes injury to\\n\\t\\t\\t\\tthemselves. They lose all honour and incur odium in the\\n\\t\\t\\t\\tsight of Allah, and they complete their own undoing."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "40",
    "NoteID": "3932",
    "Body": "The people who enthrone in their hearts for worship\\n\\t\\t\\t\\tanything besides Allah may well be asked a few questions.\\n\\t\\t\\t\\tSome of such questions are indicated in the text with\\n\\t\\t\\t\\tterse precision: (1) Have you seen these gods of yours?\\n\\t\\t\\t\\tDo they exist? \"Seeing\" of course does not necessarily\\n\\t\\t\\t\\tmean physical sight. We do not see the air, but no one\\n\\t\\t\\t\\tdoubts that it exists. And the air is a physical\\n\\t\\t\\t\\tsubstance. There are forces that we know exist, but we do\\n\\t\\t\\t\\tnot see them. To us, who have Faith, Allah is a truer\\n\\t\\t\\t\\tReality than anything else that we know, including\\n\\t\\t\\t\\tourselves. Can the false worshippers say that of any of\\n\\t\\t\\t\\ttheir false gods? (2) Have your gods created or\\n\\t\\t\\t\\toriginated anything on earth? You may worship power or\\n\\t\\t\\t\\twealth, but that is a scramble for things as between\\n\\t\\t\\t\\tselfish men. Power or wealth does not create new men or\\n\\t\\t\\t\\tnew worlds. (3) Have they a share in the ordering of the\\n\\t\\t\\t\\theavens? Obviously your false gods fail there. (4) Or\\n\\t\\t\\t\\thave these false gods a book or revelation from the\\n\\t\\t\\t\\tSupreme God, with clear evidence, to give them authority\\n\\t\\t\\t\\tto teach men? The Prophets or Messengers of Allah have\\n\\t\\t\\t\\tsuch authority, and they bring evidence of the One True\\n\\t\\t\\t\\tGod. The fact is that falsehood is falsehood, however\\n\\t\\t\\t\\tmuch one form of it may support another by delusions."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "41",
    "NoteID": "3933",
    "Body": "The universe, as we know it, shows not only evidence of\\n\\t\\t\\t\\tinitial designs, but also the working of the Creator who\\n\\t\\t\\t\\tconstantly sustains it. That is Allah. If you could\\n\\t\\t\\t\\timagine that removed, what is there to keep it going?\\n\\t\\t\\t\\tThere would only be chaos."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "41",
    "NoteID": "3934",
    "Body": "Allah's world goes on according to the laws and decrees\\n\\t\\t\\t\\testablished by Him. There are occasional lapses and\\n\\t\\t\\t\\tdeviations on the part of His creatures. But He does not\\n\\t\\t\\t\\tpunish every petty fault. One of His merciful qualities\\n\\t\\t\\t\\tis that of repeated forbearance and forgiveness."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "42",
    "NoteID": "3935",
    "Body": "Cf. vi. 157. In the first instance this referred to the\\n\\t\\t\\t\\tQuraish. Their attitude to the People of the Book had\\n\\t\\t\\t\\tbeen one of lofty superiority or of insincere excuses.\\n\\t\\t\\t\\tThey twitted the Jews and Christians with deviating from\\n\\t\\t\\t\\ttheir own lights and their own revelations; and for\\n\\t\\t\\t\\tthemselves, they said they had received no direct\\n\\t\\t\\t\\trevelation from Allah, or they would have shown\\n\\t\\t\\t\\tthemselves the most amenable to discipline, the most\\n\\t\\t\\t\\tready to follow Allah's Law. This was before the holy\\n\\t\\t\\t\\tProphet received his mission from Allah. When he received\\n\\t\\t\\t\\tit and announced it, they turned away from it, They fled\\n\\t\\t\\t\\tfrom it and put a greater and greater distance between it\\n\\t\\t\\t\\tand themselves. But this is the way of all sinners. They\\n\\t\\t\\t\\tfind much to carp at in others, and much to excuse in\\n\\t\\t\\t\\tthemselves. But when all grounds for excuse are removed,\\n\\t\\t\\t\\tthey will be found, not nearer, but farther and farther\\n\\t\\t\\t\\taway from truth and righteousness."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "43",
    "NoteID": "3936",
    "Body": "Two causes are mentioned why the Truth is refused\\n\\t\\t\\t\\tacceptance. (1) Unregenerate man is arrogant, and Truth\\n\\t\\t\\t\\tand Righteousness expose all his pretences. (2) He hopes,\\n\\t\\t\\t\\tby underhand plots, to undermine Truth and destroy it;\\n\\t\\t\\t\\tbut he is caught in his own snares, while Truth marches\\n\\t\\t\\t\\tforward triumphant."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "43",
    "NoteID": "3937",
    "Body": "In all history, men who followed evil were dealt with in\\n\\t\\t\\t\\tthree stages by Allah: (1) He was forbearing and\\n\\t\\t\\t\\tmerciful, and gave them respite; (2) He sent them\\n\\t\\t\\t\\tadmonition through His Messengers, or His Signs, or His\\n\\t\\t\\t\\trevelation; (3) He dealt out justice and punishment. At\\n\\t\\t\\t\\tany given moment, those given to iniquity may well be\\n\\t\\t\\t\\tasked: \"Are you going to wait through all these stages or\\n\\t\\t\\t\\tare you going at once to repent, obtain forgiveness, and\\n\\t\\t\\t\\twalk in the ways of righteousness?\""
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "43",
    "NoteID": "3938",
    "Body": "Allah's Laws are fixed, and His ways of dealing with\\n\\t\\t\\t\\tthose who follow iniquity are the same in all ages. Our\\n\\t\\t\\t\\thuman will may falter or turn away from its course, but\\n\\t\\t\\t\\tAllah's Will ever follows its course and cannot be turned\\n\\t\\t\\t\\taway by any cause whatever."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "44",
    "NoteID": "3939",
    "Body": "Cf. xxx. 9. If no other argument will convince men who\\n\\t\\t\\t\\tfollow evil, let them travel through space or time, and\\n\\t\\t\\t\\tlearn from the experience of others. Evil always came to\\n\\t\\t\\t\\tan evil end. Let not any one individual or generation\\n\\t\\t\\t\\tthink that it could escape by some special trick or\\n\\t\\t\\t\\tpower. Far wiser and more powerful men were personally\\n\\t\\t\\t\\tbrought to account for their iniquities."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "45",
    "NoteID": "3940",
    "Body": "Cf. xvi. 61. There would be no salvation for any of us if\\n\\t\\t\\t\\twe went merely on our deserts. It is Allah's mercy that\\n\\t\\t\\t\\tsaves us and helps us to a better and better life until\\n\\t\\t\\t\\twe attain the goal of our existence."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "45",
    "NoteID": "3941",
    "Body": "A single living creature. This may refer to man, the\\n\\t\\t\\t\\tliving crawling creature, with so many possibilities and\\n\\t\\t\\t\\tyet so many weaknesses. But it may mean all creatures\\n\\t\\t\\t\\tliterally, as the life of this planet more or less\\n\\t\\t\\t\\tcentres round the life of man. He has been given dominion\\n\\t\\t\\t\\ton this earth, and in his state of purity he is Allah's\\n\\t\\t\\t\\tvicegerent."
  },
  {
    "SurahNumber": "35",
    "AyahNumber": "45",
    "NoteID": "3942",
    "Body": "Has in His sight all creatures: i.e., to deal with,\\n\\t\\t\\t\\taccording to His laws of Forbearance, Mercy and Justice:\\n\\t\\t\\t\\tsee n. 3937 above. The respite does not mean that any one\\n\\t\\t\\t\\tescapes Hiis vigilant eye. All will be dealt with\\n\\t\\t\\t\\taccording to their deeds, with justice tempered with\\n\\t\\t\\t\\tMercy."
  }
]
