[
  {
    "SurahNumber": "21",
    "AyahNumber": "1",
    "Text": "The Day of Accountability for mankind is getting closer and\\n\\t\\t\\tcloser, yet they are heedless and are turning away from the\\n\\t\\t\\tadmonition."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "2",
    "Text": "They listen with ridicule to each fresh warning that comes to\\n\\t\\t\\tthem from their Rabb and remain engaged in the sports."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "3",
    "Text": "Their hearts are preoccupied with worldly affairs; these\\n\\t\\t\\twrongdoers say to each other in private: \"Is this man (Muhammad)\\n\\t\\t\\tnot a human being like yourselves? Would you follow witchcraft\\n\\t\\t\\twith your eyes open?\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "4",
    "Text": "Tell them: \"My Rabb has knowledge of every word which is spoken\\n\\t\\t\\tin the heavens and the earth, and He hears all and knows all.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "5",
    "Text": "\"Rather,\" some of them say, \"this Qur'an is jumble of dreams!\"\\n\\t\\t\\tOthers say: \"He has made it all up!\" And yet others say: \"He is a\\n\\t\\t\\tpoet!\" Let him bring to us a sign as did the former Rasools.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "6",
    "Text": "The fact, however, is that even though We showed Signs to the\\n\\t\\t\\tprior people, not a single nation before them, which We\\n\\t\\t\\tdestroyed, ever believed. Will they believe?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "7",
    "Text": "The Rasools which We sent before you, O Muhammad, were also human\\n\\t\\t\\tto whom We sent revelation. If you, O objectors, do not know\\n\\t\\t\\tthis, then ask the people of the reminder (Jews and Christians)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "8",
    "Text": "We did not give them bodies which could survive without food, nor\\n\\t\\t\\twere they immortal."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "9",
    "Text": "Then We fulfilled Our promise with them: We saved them and those\\n\\t\\t\\twhom We pleased, and destroyed the transgressors."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "10",
    "Text": "Now, O People, We have sent down to you a Book (The Qur'an) which\\n\\t\\t\\tdeals with matters concerning yourselves; why don't you\\n\\t\\t\\tunderstand?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "11",
    "Text": "How many nations We have destroyed because of their iniquities\\n\\t\\t\\tand replaced them by other nations!"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "12",
    "Text": "When they felt that Our punishment was coming, they took to their\\n\\t\\t\\theels and fled."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "13",
    "Text": "They were told: \"Do not run away. Return to your luxuries of life\\n\\t\\t\\tand to your homes, so that you may be asked questions.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "14",
    "Text": "They replied: \"Woe to us! Indeed we were wrongdoers.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "15",
    "Text": "They kept on repeating that statement till We mowed them down,\\n\\t\\t\\tleaving no spark of life in them."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "16",
    "Text": "Our creation of the heavens and the earth and all that lies\\n\\t\\t\\tbetween them is not a game."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "17",
    "Text": "Had We meant to make it a play ground, We would have done it by\\n\\t\\t\\tOurself, without giving you discretion to do right and wrong, had\\n\\t\\t\\tWe ever done so."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "18",
    "Text": "Nay! We give falsehood a violent blow with the Truth to knock it\\n\\t\\t\\tout and behold! Falsehood vanishes away. Woe be to you, for all\\n\\t\\t\\tthe false gods you have invented."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "19",
    "Text": "To Him belongs all that exist in the heavens and in the earth;\\n\\t\\t\\tand the angels, who are in His very presence, are not too proud\\n\\t\\t\\tto serve Him, nor do they feel wearied of His service."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "20",
    "Text": "They glorify Him night and day; and do not pause."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "21",
    "Text": "Have the earthly deities, that they have taken for worship, the\\n\\t\\t\\tpower to raise the dead?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "22",
    "Text": "If there were other gods in the heavens or in the earth besides\\n\\t\\t\\tAllah, both the heavens and earth would have been in a state of\\n\\t\\t\\tdisorder. Glory be to Allah, the Lord of the Throne, absolutely\\n\\t\\t\\tfree is He from the falsehood that they attribute to Him."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "23",
    "Text": "He is accountable to none about what He does, but they are\\n\\t\\t\\taccountable to Him."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "24",
    "Text": "Even then, have they taken other deities for worship besides Him?\\n\\t\\t\\tAsk them: \"Show us your proof: here is this reminder (Al-Qur'an)\\n\\t\\t\\tfor the people of my time and it also contains the reminder of\\n\\t\\t\\tthose before me.\" But most of them have no knowledge of Reality,\\n\\t\\t\\tand that is why they have turned away."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "25",
    "Text": "The fact is that to every Rasool whom We sent before you, We\\n\\t\\t\\trevealed the same Message: \"there is no god but Me, so worship Me\\n\\t\\t\\tAlone.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "26",
    "Text": "Inspite of receiving that message, they still say: \"The\\n\\t\\t\\tBeneficent (Allah) has offspring!\" Glory be to Him! The angels\\n\\t\\t\\tare but His honored servants."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "27",
    "Text": "They do not precede Him in speaking and they act according to His\\n\\t\\t\\tcommandment."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "28",
    "Text": "He knows what is before them and what is behind them and they do\\n\\t\\t\\tnot intercede except for the one whom He approves, and for fear\\n\\t\\t\\tof Him they tremble."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "29",
    "Text": "If any of them were to say: \"I am also a deity besides Him,\" We\\n\\t\\t\\twould send him to hell, thus shall We reward the wrongdoers."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "30",
    "Text": "Have not the unbelievers ever considered that the skies and the\\n\\t\\t\\tearth were once one mass, then We split them asunder? And We have\\n\\t\\t\\tcreated every living thing from water. Will they still not\\n\\t\\t\\tbelieve?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "31",
    "Text": "And We have planted mountains on earth lest it should tilt to one\\n\\t\\t\\tside with them (the weight of people) and We left between them\\n\\t\\t\\topen passages so that they may find the right direction."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "32",
    "Text": "And We have made the sky a safe canopy: yet they are heedless to\\n\\t\\t\\tthese signs."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "33",
    "Text": "He is the One Who has created the night and the day and the sun\\n\\t\\t\\tand the moon: all (the celestial bodies) move swiftly in an orbit\\n\\t\\t\\tof their own."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "34",
    "Text": "O Muhammad, We have not granted immortality to any human before\\n\\t\\t\\tyou: so if you are to die, will these unbelievers live forever?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "35",
    "Text": "Every soul is bound to have the taste of death. We are putting\\n\\t\\t\\tall of you to a test by passing you through bad and good\\n\\t\\t\\tconditions, and finally you shall return to Us."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "36",
    "Text": "When the unbelievers see you they do not take you but for one to\\n\\t\\t\\tbe scoffed at, saying: \"Is this the one who talks against your\\n\\t\\t\\tgods?\" And they themselves deny the mention of the Compassionate\\n\\t\\t\\t(Allah)."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "37",
    "Text": "Man is a creature of haste (impatience). Soon I will show you My\\n\\t\\t\\tsigns, therefore, you need not be impatient."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "38",
    "Text": "They ask: \"When will this promise be fulfilled if you are telling\\n\\t\\t\\tthe truth?\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "39",
    "Text": "They would not have asked this question if only the unbelievers\\n\\t\\t\\tknew the Day when they will be able to protect neither their\\n\\t\\t\\tfaces from the fire of hell nor their backs, nor will they be\\n\\t\\t\\thelped!"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "40",
    "Text": "Nay, it will come to them all of a sudden and overpower them so\\n\\t\\t\\tabruptly that they shall neither be able to avert it nor shall\\n\\t\\t\\tthey get any respite."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "41",
    "Text": "As for their scoffing, the Rasools before you were also scoffed\\n\\t\\t\\tat; but their scoffers were hemmed in by the very thing at which\\n\\t\\t\\tthey used to scoff."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "42",
    "Text": "Ask them, \"Who is there to protect you by night and by day from\\n\\t\\t\\tthe wrath of the Compassionate?\" Yet they turn away from the\\n\\t\\t\\tadmonition of their Rabb."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "43",
    "Text": "Do they have such gods who can defend them against Us? Their gods\\n\\t\\t\\tcan neither help themselves nor can they protect themselves from\\n\\t\\t\\tUs."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "44",
    "Text": "The fact is that We gave the good things of this life to them and\\n\\t\\t\\ttheir forefathers until they got used to these things because of\\n\\t\\t\\ttheir prolonged lives; can they not see how We gradually reduce\\n\\t\\t\\tthe land which was in their control and curtail it from all\\n\\t\\t\\tsides? Do they still expect to be victorious against Us?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "45",
    "Text": "Tell them, \"I am warning you on the authority of Revelation,\" but\\n\\t\\t\\tthe deaf choose not to listen the call when they are warned!"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "46",
    "Text": "Yet even if a breath from the Wrath of your Rabb was to touch\\n\\t\\t\\tthem, they will certainly say, \"Woe to us! No doubt we were\\n\\t\\t\\twrongdoers.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "47",
    "Text": "On the Day of Judgement We shall set up scales of justice so that\\n\\t\\t\\tno one will be dealt with unjustly in any way; even if someone\\n\\t\\t\\thas an act as small as a grain of a mustard seed, We will bring\\n\\t\\t\\tit to account, and sufficient are We to settle the accounts."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "48",
    "Text": "Certainly, We granted to Musa (Moses) and Haroon (Aaron) the\\n\\t\\t\\tCriterion of right and wrong, a light and a reminder for those\\n\\t\\t\\trighteous people"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "49",
    "Text": "who fear their Rabb though they have not seen Him, and dread the\\n\\t\\t\\tDay of Judgment."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "50",
    "Text": "And now We have revealed this blessed Reminder (The Qur'an). Will\\n\\t\\t\\tyou then deny it?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "51",
    "Text": "Even before that We blessed Ibrahim (Abraham) with rectitude, for\\n\\t\\t\\tWe knew him well."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "52",
    "Text": "Remember that occasion when Ibrahim asked his father and his\\n\\t\\t\\tpeople, \"What are these images to which you are so devoted?\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "53",
    "Text": "They replied, \"We found our forefathers worshipping them.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "54",
    "Text": "He said \"Then certainly both you and your forefathers have been\\n\\t\\t\\tin manifest error.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "55",
    "Text": "They asked, \"Have you brought us the Truth or are you one of the\\n\\t\\t\\ttriflers?\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "56",
    "Text": "He replied, \"Nay! Your Rabb is the Lord of the heavens and the\\n\\t\\t\\tearth. It is He Who has created them; and I am of those who bear\\n\\t\\t\\twitness to this."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "57",
    "Text": "By Allah! I will certainly plan against your idols when you turn\\n\\t\\t\\tand go away.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "58",
    "Text": "So he broke them all in pieces, except the biggest of them, so\\n\\t\\t\\tthat they might turn to it."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "59",
    "Text": "(On their return when they saw the plight of their idols), some\\n\\t\\t\\tasked, \"Who has done this to our gods? He must surely be a wicked\\n\\t\\t\\tperson!\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "60",
    "Text": "Others replied, \"We heard a youth, called Ibrahim, talking about\\n\\t\\t\\tthem.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "61",
    "Text": "They said, \"Then bring him here before the eyes of the people, so\\n\\t\\t\\tthat they may witness how severely he is punished.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "62",
    "Text": "When Ibrahim came, they asked, \"O Ibrahim, are you the one who\\n\\t\\t\\thas done this to our gods?\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "63",
    "Text": "He replied, \"Surely someone has done it; the chief of them, that\\n\\t\\t\\tis! Ask them, if they can speak!\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "64",
    "Text": "Thereupon they turned to search their own consciences, and said\\n\\t\\t\\tto themselves, \"Surely you yourselves are the wrongdoers!\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "65",
    "Text": "Confounded as they were, lowering their heads they said, \"You\\n\\t\\t\\tknow fully well that they cannot speak.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "66",
    "Text": "At this Ibrahim said, \"Do you then worship these deities, instead\\n\\t\\t\\tof Allah, who can neither benefit nor harm you?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "67",
    "Text": "Shame on you and on those deities you worship besides Allah! Have\\n\\t\\t\\tyou no sense at all?\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "68",
    "Text": "They cried, \"Burn him alive and avenge your gods, if you want to\\n\\t\\t\\ttake any action.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "69",
    "Text": "When they threw him in the fire, We commanded, \"O fire! Be cool\\n\\t\\t\\tand comfortable for Ibrahim.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "70",
    "Text": "They sought to harm him, but We made them the big losers."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "71",
    "Text": "We delivered him and his nephew Lut (Lot) and directed them to\\n\\t\\t\\tthe land which We have blessed for all the people of the world."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "72",
    "Text": "We gave him a son Ishaq (Isaac) and then a grandson Ya'qoob\\n\\t\\t\\t(Jacob); and We made each of them a righteous man."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "73",
    "Text": "We made them leaders who guided other people by Our command and\\n\\t\\t\\tWe sent them revelations to do good deeds, establish Salah and\\n\\t\\t\\tpay Zakah. To Us Alone did they serve."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "74",
    "Text": "To Lut (Lot) We gave wisdom and knowledge, and We delivered him\\n\\t\\t\\tfrom the town which practiced abominations - surely its\\n\\t\\t\\tinhabitants were very wicked transgressors"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "75",
    "Text": "- and We admitted him to Our mercy: for he was of the righteous\\n\\t\\t\\tpeople."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "76",
    "Text": "Before them Nuh (Noah) prayed to Us, We accepted his prayer and\\n\\t\\t\\tdelivered him and his family from the great calamity."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "77",
    "Text": "We helped him against those people who had denied Our\\n\\t\\t\\trevelations; surely they were an evil people, so We drowned them\\n\\t\\t\\tall in the Great Flood."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "78",
    "Text": "We also bestowed favors upon Dawood (David) and Sulaiman\\n\\t\\t\\t(Solomon): when the two were judging a case regarding the field\\n\\t\\t\\tinto which the sheep of certain people had strayed by night, and\\n\\t\\t\\tWe were watching them to arrive at judgment,"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "79",
    "Text": "at that time We gave Sulaiman insight to arrive at the right\\n\\t\\t\\tdecision, although We had given wisdom and knowledge to both of\\n\\t\\t\\tthem. We caused the mountains and the birds to celebrate Our\\n\\t\\t\\tpraises with Dawood; it was We Who made this happen."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "80",
    "Text": "We taught him the armor's craft, so that they might protect you\\n\\t\\t\\tin your wars: yet are you ever grateful?"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "81",
    "Text": "We made the raging winds subservient to Sulaiman, pursuing its\\n\\t\\t\\tcourse by his command to the land which We had blessed; and We\\n\\t\\t\\thave knowledge of everything."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "82",
    "Text": "And We had subjected to him many of the shaitans who dived for\\n\\t\\t\\thim into the sea and performed other duties besides this; and We\\n\\t\\t\\twere the One Who had control over them for him."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "83",
    "Text": "Similarly We blessed Ayub, when he prayed to his Rabb saying, \"I\\n\\t\\t\\tam badly afflicted with disease: but of all those who show mercy\\n\\t\\t\\tYou are the most Merciful.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "84",
    "Text": "We accepted his prayer and relieved his affliction, and restored\\n\\t\\t\\tnot only his family but also as many more with them as a favor\\n\\t\\t\\tfrom Us so that it may serve as a reminder to Our worshippers."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "85",
    "Text": "Likewise, We blessed Isma`il (Ishmael), Idris and Zul-kifl, for\\n\\t\\t\\tall of them practised patience."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "86",
    "Text": "We admitted them to Our Mercy, for they were of the righteous\\n\\t\\t\\tpeople."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "87",
    "Text": "We blessed Zun-nun (Yunus / Jonah), when he departed in anger,\\n\\t\\t\\tthinking We would not take him to task for this, but later he\\n\\t\\t\\tprayed to Us from the depths of darkness, \"There is no god but\\n\\t\\t\\tYou, glory be to You! Indeed I was the one who committed wrong.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "88",
    "Text": "We accepted his prayer and delivered him from distress; thus do\\n\\t\\t\\tWe deliver the believers."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "89",
    "Text": "We also blessed Zakariya, when he prayed to his Rabb, \"O my Rabb!\\n\\t\\t\\tDo not let me remain childless even though You are the best of\\n\\t\\t\\tinheritors."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "90",
    "Text": "We accepted his prayer and gave him Yahya (John), curing his wife\\n\\t\\t\\tfor him to bear a child. They were ever quick in emulating good\\n\\t\\t\\tdeeds and called on Us with hope, fear, and submission."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "91",
    "Text": "And We blessed the woman (Maryam), who guarded her chastity, We\\n\\t\\t\\tbreathed into her of Our Spirit and We made her and her son a\\n\\t\\t\\tsign for the whole world."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "92",
    "Text": "Verily this brotherhood of yours is a single brotherhood and I am\\n\\t\\t\\tyour only Rabb, therefore worship Me Alone."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "93",
    "Text": "But the people have divided their religion into sects between\\n\\t\\t\\tthem- to Us they shall all return."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "94",
    "Text": "Whoever shall do good deeds, provided he is a believer, his\\n\\t\\t\\tendeavor will not be rejected: We are recording it all for him."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "95",
    "Text": "It is not possible that a nation which We have destroyed may rise\\n\\t\\t\\tagain."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "96",
    "Text": "Until, when Gog and Magog will be let loose and they will swiftly\\n\\t\\t\\tswarm from every height,"
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "97",
    "Text": "and the time of fulfillment for the True Promise will draw near,\\n\\t\\t\\tthen behold! The eyes of the unbelievers will fixedly stare in\\n\\t\\t\\thorror: \"O woe to us! We were indeed heedless of this warning;\\n\\t\\t\\tnay we were wrongdoers.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "98",
    "Text": "Surely you (O mushrikin) and your deities that you worship\\n\\t\\t\\tbesides Allah shall be the fuel of hell; therein you shall all\\n\\t\\t\\tenter."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "99",
    "Text": "If those deities would have been true gods, they would not have\\n\\t\\t\\tgotten there; but there they shall abide forever."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "100",
    "Text": "In there, sobbing will be their lot, and they will not be able to\\n\\t\\t\\thear anything else."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "101",
    "Text": "Certainly those for whom the good reward from Us has preceded\\n\\t\\t\\tthem will be kept far away from it."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "102",
    "Text": "They shall not hear even its slightest sound, and they shall\\n\\t\\t\\tdwell forever in the midst of whatever their souls desire."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "103",
    "Text": "The time of Great Terror (Day of Judgement) will not grieve them,\\n\\t\\t\\tand the angels will receive them with greetings: \"This is your\\n\\t\\t\\tDay that you were promised.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "104",
    "Text": "On that Day We shall roll up the heavens like a scroll of\\n\\t\\t\\twritings; just as We originated the first creation, so shall We\\n\\t\\t\\tproduce it again - that is Our promise, and We will fulfill it."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "105",
    "Text": "We wrote this in The Zaboor (Psalms xxxvii, 29) after the\\n\\t\\t\\treminder (Torah given to Musa): that as for the land, My\\n\\t\\t\\trighteous servants shall inherit it.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "106",
    "Text": "Surely in this is great news for those people who worship Us."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "107",
    "Text": "O Muhammad, We have not sent you but as a blessing for all the\\n\\t\\t\\tworlds."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "108",
    "Text": "Tell them: \"It has been revealed to me that your God is One God -\\n\\t\\t\\twill you then become Muslims?\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "109",
    "Text": "If they give no heed, tell them: \"I have warned you all alike in\\n\\t\\t\\tcomplete fairness; now I do not know whether what you are\\n\\t\\t\\tthreatened with is near or far."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "110",
    "Text": "It is He Who knows your spoken words and hidden thoughts."
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "111",
    "Text": "I do not know whether this delay is a trial for you or you are\\n\\t\\t\\tbeing given respite for an appointed time.\""
  },
  {
    "SurahNumber": "21",
    "AyahNumber": "112",
    "Text": "Finally the Prophet said: \"O Rabb! Pass Your Judgment with\\n\\t\\t\\tfairness. And O People! Our Rabb is most Compassionate, Whose\\n\\t\\t\\thelp we seek against the blasphemies you utter.\""
  }
]
