[
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "1",
    "sectionHeading": "The Superiority of Prayer in Congregation over Prayer Done Alone",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi from Abdullah\\n\\t\\t\\t\\tibn Umar that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"Prayer in congregation is\\n\\t\\t\\t\\tbetter than the prayer of a man by himself by\\n\\t\\t\\t\\ttwenty-seven degrees.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "2",
    "sectionHeading": "The Superiority of Prayer in Congregation over Prayer Done Alone",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab from Abu Hurayra that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"Prayer in congregation is better than the prayer of one\\n\\t\\t\\t\\tof you on his own by twenty-five parts.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "3",
    "sectionHeading": "The Superiority of Prayer in Congregation over Prayer Done Alone",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'zZinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"By Him in\\n\\t\\t\\t\\twhose hand myself is! I had in mind to order firewood to\\n\\t\\t\\t\\tbe collected, then to order the prayer to be called, and\\n\\t\\t\\t\\tto appoint a man to lead the people in prayer, and then\\n\\t\\t\\t\\tto come up behind certain men and burn their houses down\\n\\t\\t\\t\\tabout them! By Him in whose hand myself is! If one of\\n\\t\\t\\t\\tthem knew that he would find a meaty bone or two good\\n\\t\\t\\t\\tlegs of meat, he would be present at isha.''\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "4",
    "sectionHeading": "The Superiority of Prayer in Congregation over Prayer Done Alone",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'n-Nadr, the mawla\\n\\t\\t\\t\\tof Umar ibn Ubaydullah from Yusr ibn Said that Zayd ibn\\n\\t\\t\\t\\tThabit said, \"The most excellent prayer is your prayer in\\n\\t\\t\\t\\tyour house, except for the prescribed prayers.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "5",
    "sectionHeading": "The Isha and Subh Prayers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abd ar-Rahman ibn\\n\\t\\t\\t\\tHarmala al-Aslami from Said ibn al-Musayyab that the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, \"What separates us from the hypocrites is\\n\\t\\t\\t\\tbeing present at isha and subh. They cannot do it,\" or\\n\\t\\t\\t\\twords to that effect.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "6",
    "sectionHeading": "The Isha and Subh Prayers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Sumayy, the mawla of\\n\\t\\t\\t\\tAbu Bakr ibn Abd ar-Rahman from Abu Salih from Abu\\n\\t\\t\\t\\tHurayra that the Messenger of Allah, may Allah bless him\\n\\t\\t\\t\\tand grant him peace, said, \"If a man who is walking along\\n\\t\\t\\t\\ta road finds a branch of thorns on the road and removes\\n\\t\\t\\t\\tit, Allah thanks him for doing it and forgives him.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe also said, \"Martyrs are five:  the one killed by a\\n\\t\\t\\t\\tplague, the one killed by a disease of the belly, the one\\n\\t\\t\\t\\twho drowns, the one killed by a collapsing building, and\\n\\t\\t\\t\\tthe martyr in the path of Allah.'\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tHe also said, \"If people knew what there was in the call\\n\\t\\t\\t\\tto prayer and the first row, and they could find no other\\n\\t\\t\\t\\tway except to draw lots for it, they would draw lots for\\n\\t\\t\\t\\tit. And if they knew what there was in doing dhuhr at its\\n\\t\\t\\t\\ttime, they would race each other to it. And if they knew\\n\\t\\t\\t\\twhat there was in the prayers of isha and maghrib, they\\n\\t\\t\\t\\twould come to them even if they had to crawl .\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "7",
    "sectionHeading": "The Isha and Subh Prayers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Abu\\n\\t\\t\\t\\tBakr ibn Sulayman ibn Abi Hathma that Umar ibn al-Khattab\\n\\t\\t\\t\\tmissed Sulayman ibn Abi Hathma in the subh prayer. In the\\n\\t\\t\\t\\tmorning he went to the market, and Sulayman's house was\\n\\t\\t\\t\\tbetween the market and the Prophet's mosque. He passed\\n\\t\\t\\t\\tash-Shifa, Sulayman's mother, and said to her, \"I did not\\n\\t\\t\\t\\tsee Sulayman at subh.\" She replied, \"He spent the night\\n\\t\\t\\t\\tin prayer and his eyes overcame him. Umar said, \"I would\\n\\t\\t\\t\\trather be present at subh than stand the whole night in\\n\\t\\t\\t\\tprayer.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "8",
    "sectionHeading": "The Isha and Subh Prayers",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said from\\n\\t\\t\\t\\tMuhammad ibn Ibrahim that Abd ar-Rahman ibn Abi Amra\\n\\t\\t\\t\\tal-Ansari said that Uthman ibn Affan came to the isha\\n\\t\\t\\t\\tprayer and seeing only a few people in the mosque, he lay\\n\\t\\t\\t\\tdown at the back of the mosque to wait for the number of\\n\\t\\t\\t\\tpeople to increase. Ibn Abi Amra went and sat down beside\\n\\t\\t\\t\\thim and Uthman asked him who he was, so he told him.\\n\\t\\t\\t\\tUthman said, \"What have you memorised of the Qur'an?\",\\n\\t\\t\\t\\tand he told him. Uthman said, \"If someone is present at\\n\\t\\t\\t\\tisha, it is as if he had stood in prayer for half a\\n\\t\\t\\t\\tnight, and if some one is present at subh, it is as if he\\n\\t\\t\\t\\thad stood in prayer for a whole night.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "9",
    "sectionHeading": "Doing the Prayer Again with the Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from a\\n\\t\\t\\t\\tman of the Bani'd-Dil called Busr ibn Mihjan from his\\n\\t\\t\\t\\tfather Mihjan that he was in a gathering with the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, and the call to prayer was made. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, rose and\\n\\t\\t\\t\\tprayed and then returned. Mihjan remained sitting and did\\n\\t\\t\\t\\tnot pray with him. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"What prevented you\\n\\t\\t\\t\\tfrom praying with the people? Aren't you a muslim?\" He\\n\\t\\t\\t\\tsaid, \"Of course, Messenger of Allah, but I have already\\n\\t\\t\\t\\tprayed with my family.\" The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"When you come, pray\\n\\t\\t\\t\\twith the people, even if you have prayed already.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "10",
    "sectionHeading": "Doing the Prayer Again with the Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that a man asked\\n\\t\\t\\t\\tAbdullah ibn Umar, \"Sometimes I pray in my house, and\\n\\t\\t\\t\\tthen catch the prayer with the imam. Should I pray with\\n\\t\\t\\t\\thim?\" Abdullah ibn Umar said to him, \"Yes,\" and the man\\n\\t\\t\\t\\tsaid, \"Which of them do I make my prayer?\" Abdullah ibn\\n\\t\\t\\t\\tUmar said, \"Is that up to you? It is up to Allah. He will\\n\\t\\t\\t\\tdecide on whichever of them He wishes.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "11",
    "sectionHeading": "Doing the Prayer Again with the Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that a\\n\\t\\t\\t\\tman asked Said ibn al-Musayyab, \"I pray in my house, and\\n\\t\\t\\t\\tthen I come to the mosque and find the imam praying.\\n\\t\\t\\t\\tShould I pray with him?\" Said said, \"Yes,\" and the man\\n\\t\\t\\t\\tsaid, \"Which of them is my prayer?\" Said said, \"Are you\\n\\t\\t\\t\\tthe one to decide that? That is up to Allah.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "12",
    "sectionHeading": "Doing the Prayer Again with the Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Afif as-Sahmi that a\\n\\t\\t\\t\\tman from the tribe of Bani Asad asked Abu Ayyub\\n\\t\\t\\t\\tal-Ansari. \"Sometimes I pray in my house, and then come\\n\\t\\t\\t\\tto the mosque and find the imam praying. Should I pray\\n\\t\\t\\t\\twith him?\" Abu Ayyub said, \"Yes, pray with him, for some\\n\\t\\t\\t\\tone who does so has the reward of the group, or the\\n\\t\\t\\t\\tequivalent of the reward of the group.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "13",
    "sectionHeading": "Doing the Prayer Again with the Imam",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Nafi that Abdullah\\n\\t\\t\\t\\tibn Umar used to say, \"Someone who prays maghrib or subh\\n\\t\\t\\t\\tand then catches them with the imam should not repeat\\n\\t\\t\\t\\tthem.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"I do not see any harm in someone who has\\n\\t\\t\\t\\talready prayed in his house praying with the imam, except\\n\\t\\t\\t\\tfor maghrib, because if he repeats it, he makes it even.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "14",
    "sectionHeading": "Praying in a Group of People",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Abu'z Zinad from\\n\\t\\t\\t\\tal-Araj from Abu Hurayra that the Messenger of Allah, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"When you lead\\n\\t\\t\\t\\tpeople in the prayer, make it short, because there are\\n\\t\\t\\t\\tamong them some people who are weak, ill and old. But\\n\\t\\t\\t\\twhen you pray on your own, make it as long as you wish.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "15",
    "sectionHeading": "Praying in a Group of People",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that Nafi said, \"I stood\\n\\t\\t\\t\\tbehind Abdullah ibn Umar in one of the prayers when there\\n\\t\\t\\t\\twas no one else with him, and he reached behind with his\\n\\t\\t\\t\\thand and placed me beside him.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "16",
    "sectionHeading": "Praying in a Group of People",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Yahya ibn Said that a\\n\\t\\t\\t\\tman used to lead the people in prayer in al-Aqiq (a place\\n\\t\\t\\t\\tnear Madina), and Umar ibn Abd al-Aziz sent a message to\\n\\t\\t\\t\\thim forbidding him to do so.\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"He only forbade him because his father was\\n\\t\\t\\t\\tnot known.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "17",
    "sectionHeading": "Prayer Behind an Imam when He Prays Sitting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Anas\\n\\t\\t\\t\\tibn Malik that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, fell off his horse when riding,\\n\\t\\t\\t\\tand his right side was scraped, so he did one of the\\n\\t\\t\\t\\tprayers sitting, and we prayed behind him sitting. When\\n\\t\\t\\t\\the left, he said, \"The imam is appointed to be followed.\\n\\t\\t\\t\\tIf he prays standing, then pray standing, and when he\\n\\t\\t\\t\\tgoes into ruku, go into ruku, and when he rises, rise,\\n\\t\\t\\t\\tand when he says, 'Allah hears whoever praises him,' say,\\n\\t\\t\\t\\t'Our Lord, praise belongs to You,' and if he prays\\n\\t\\t\\t\\tsitting, then all of you pray sitting.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "18",
    "sectionHeading": "Prayer Behind an Imam when He Prays Sitting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, said, \"The Messenger\\n\\t\\t\\t\\tof Allah, may Allah bless him and grant him peace, prayed\\n\\t\\t\\t\\twhile he was ill. He prayed sitting, and some people\\n\\t\\t\\t\\tprayed behind him standing, and he indicated to them to\\n\\t\\t\\t\\tsit down. When he left, he said, 'The imam is only\\n\\t\\t\\t\\tappointed to be followed. When he goes into ruku, go into\\n\\t\\t\\t\\truku and when he rises, rise and if he prays sitting,\\n\\t\\t\\t\\tpray sitting .' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "19",
    "sectionHeading": "Prayer Behind an Imam when He Prays Sitting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, came out during his illness, and\\n\\t\\t\\t\\tapproached and found Abu Bakr standing, leading the\\n\\t\\t\\t\\tpeople in prayer. Abu Bakr began to go back, but the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, indicated to him to stay where he was. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, sat by the side of Abu Bakr, and Abu Bakr prayed\\n\\t\\t\\t\\tfollowing the prayer of the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, who was sitting, and the\\n\\t\\t\\t\\tpeople prayed following the prayer of Abu Bakr.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "20",
    "sectionHeading": "The Excellence of the Prayer of Someone Standing over the Prayer of Someone Sitting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ismail ibn Muhammad\\n\\t\\t\\t\\tibn Said ibn Abi Waqqas from a mawla of Amr ibn al-As or\\n\\t\\t\\t\\tof Abdullah ibn Amr ibn al-As that the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said,\\n\\t\\t\\t\\t\"The prayer of one of you sitting down is only equal to\\n\\t\\t\\t\\thalf the prayer of one of you when he is standing.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "21",
    "sectionHeading": "The Excellence of the Prayer of Someone Standing over the Prayer of Someone Sitting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that\\n\\t\\t\\t\\tAbdullah ibn Amr ibn al As said, \"When we arrived at\\n\\t\\t\\t\\tMadina we were struck down by a severe epidemic which\\n\\t\\t\\t\\tdebilitated us greatly. The Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, came out to the people\\n\\t\\t\\t\\twhile they were praying nawafil prayers sitting down. The\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, said, 'The prayer of the one sitting is equal to\\n\\t\\t\\t\\tonly half the prayer of the one standing.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "22",
    "sectionHeading": "Praying Voluntary Prayers (Nawafil) Sitting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from\\n\\t\\t\\t\\tas-Sa'ib ibn Yazid from al Muttalib ibn Abi Wadaa\\n\\t\\t\\t\\tas-Sahmi that Hafsa, the wife of the Prophet, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"I never saw the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace, praying nawafil sitting, until a year before his\\n\\t\\t\\t\\tdeath, when he began to pray them sitting. He would\\n\\t\\t\\t\\trecite the sura with a measured slowness so that it would\\n\\t\\t\\t\\tseem to be longer than other suras which were actually\\n\\t\\t\\t\\tlonger than it.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "23",
    "sectionHeading": "Praying Voluntary Prayers (Nawafil) Sitting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that A'isha, the wife of the Prophet, may\\n\\t\\t\\t\\tAllah bless him and grant him peace, told him that she\\n\\t\\t\\t\\thad never seen the Messenger of Allah, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, doing night prayers sitting down\\n\\t\\t\\t\\tuntil he was getting on in years. He would recite sitting\\n\\t\\t\\t\\tdown until when he wanted to go into ruku, he would stand\\n\\t\\t\\t\\tup and recite about thirty or forty ayats and then go\\n\\t\\t\\t\\tinto ruku.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "24",
    "sectionHeading": "Praying Voluntary Prayers (Nawafil) SittingYahya related to me from Malik from Abdullah ibn Yazid al-Madani and from Abu'n Nadr from Abu Salama ibn Abd ar-Rahman from A'isha, the wife of the Prophet, may Allah bless him and grant him peace, that the Messe",
    "text": ""
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "25",
    "sectionHeading": "Praying Voluntary Prayers (Nawafil) Sitting",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tUrwa ibn az-Zubayr and Said ibn al-Musayyab used to pray\\n\\t\\t\\t\\tvoluntary prayers sitting.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "26",
    "sectionHeading": "The Middle Prayer ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam from\\n\\t\\t\\t\\tal-Qaqa ibn Hakim that Abu Yunus, the mawla of A'isha,\\n\\t\\t\\t\\tumm al-muminin said, ''A'isha ordered  me to write out a\\n\\t\\t\\t\\tQur'an for her. She said, 'When you reach this ayat, let\\n\\t\\t\\t\\tme know, \"Guard the prayers carefully and the middle\\n\\t\\t\\t\\tprayer and stand obedient to Allah.\" ' When I reached it\\n\\t\\t\\t\\tI told her, and she dictated to me, 'Guard the prayers\\n\\t\\t\\t\\tcarefully and the middle prayer and the asr prayer and\\n\\t\\t\\t\\tstand obedient to Allah.'  A'isha said, 'I heard it from\\n\\t\\t\\t\\tthe Messenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "27",
    "sectionHeading": "The Middle Prayer ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Zayd ibn Aslam that\\n\\t\\t\\t\\tAmr ibn Rafi said, \"I was writing a Qur'an for Hafsa, umm\\n\\t\\t\\t\\tal-muminin, and she said, 'When you reach this ayat, let\\n\\t\\t\\t\\tme know, \"Guard the prayers carefully and the middle\\n\\t\\t\\t\\tprayer and stand obedient to Allah.\" When I reached it I\\n\\t\\t\\t\\ttold her and she dictated to me, 'Guard the prayers\\n\\t\\t\\t\\tcarefully and the middle prayer and the asr prayer and\\n\\t\\t\\t\\tstand obedient to Allah.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "28",
    "sectionHeading": "The Middle Prayer ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Da'ud ibn al-Husayn\\n\\t\\t\\t\\tthat Ibn Yarbu al-Makhzumi said, \"I heard Zayd ibn Thabit\\n\\t\\t\\t\\tsay, 'The middle prayer is the prayer of dhuhr.' \"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "29",
    "sectionHeading": "The Middle Prayer ",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that AIi\\n\\t\\t\\t\\tibn Abi Talib and Abdullah ibn Abbas used to say, \"The\\n\\t\\t\\t\\tmiddle prayer is the prayer of subh.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"Out of all that I have heard about the\\n\\t\\t\\t\\tmatter, I prefer what Ali ibn Abi Talib and Abdullah ibn\\n\\t\\t\\t\\tAbbas said.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "30",
    "sectionHeading": "Permission to Pray in One Garment",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that Umar ibn Abi Salama saw the Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, praying\\n\\t\\t\\t\\tin one garment in the house of Umm Salama. He was\\n\\t\\t\\t\\tcompletely covered by it, and had put both ends over his\\n\\t\\t\\t\\tshoulders.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "31",
    "sectionHeading": "Permission to Pray in One Garment",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab from Said\\n\\t\\t\\t\\tibn al-Musayyab from Abu Hurayra that some one asked the\\n\\t\\t\\t\\tMessenger of Allah, may Allah bless him and grant him\\n\\t\\t\\t\\tpeace about praying in one garment. The Messenger of\\n\\t\\t\\t\\tAllah, may Allah bless him and grant him peace, said, \"Do\\n\\t\\t\\t\\tyou all have two garments?\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "32",
    "sectionHeading": "Permission to Pray in One Garment",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Ibn Shihab that Said\\n\\t\\t\\t\\tibn al-Musayyab said that Abu Hurayra was asked, \"May a\\n\\t\\t\\t\\tman pray in one garment?\" He said, \"Yes.\" The man then\\n\\t\\t\\t\\tsaid to him \"Do you do that?\" and he replied, \"Yes, I\\n\\t\\t\\t\\tpray in one garment while my clothes are on the\\n\\t\\t\\t\\tclothes-rack.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "33",
    "sectionHeading": "Permission to Pray in One Garment",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tJabir ibn Abdullah used to pray in one garment.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "34",
    "sectionHeading": "Permission to Pray in One Garment",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Rabia ibn Abi Abd\\n\\t\\t\\t\\tar-Rahman that Muhammad ibn Amr ibn Hazm used to pray in\\n\\t\\t\\t\\ta single long shirt.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "35",
    "sectionHeading": "Permission to Pray in One Garment",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard from\\n\\t\\t\\t\\tJabir ibn Abdullah that the Messenger of Allah, may Allah\\n\\t\\t\\t\\tbless him and grant him peace, said, \"Let anyone who\\n\\t\\t\\t\\tcannot find two garments pray in one garment and wrap\\n\\t\\t\\t\\thimself in it, and if the garment is short, let him wrap\\n\\t\\t\\t\\tit around his waist.\"\\n\\t\\t\\t</p><p>\\n\\t\\t\\t\\tMalik said, \"In my view it is preferable for someone who\\n\\t\\t\\t\\tprays in a single shirt to put a garment or a turban over\\n\\t\\t\\t\\this shoulders.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "36",
    "sectionHeading": "Permission for a Woman to Pray in a Shift and Head-Covering",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik that he had heard that\\n\\t\\t\\t\\tA'isha, the wife of the Prophet, may Allah bless him and\\n\\t\\t\\t\\tgrant him peace, used to pray in a shift and\\n\\t\\t\\t\\thead-covering.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "37",
    "sectionHeading": "Permission for a Woman to Pray in a Shift and Head-Covering",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Muhammad ibn Zayd ibn\\n\\t\\t\\t\\tQunfudh that his mother asked Umm Salama, the wife of the\\n\\t\\t\\t\\tProphet, may Allah bless him and grant him peace, \"What\\n\\t\\t\\t\\tclothes can a woman wear in prayer?\" She said, \"She can\\n\\t\\t\\t\\tpray in a shift that reaches down and covers the top of\\n\\t\\t\\t\\ther feet.\"\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "38",
    "sectionHeading": "Permission for a Woman to Pray in a Shift and Head-Covering",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from a reliable source\\n\\t\\t\\t\\tfrom Bukayr ibn Abdullah ibn al-Ashajj from Busr ibn Said\\n\\t\\t\\t\\tthat when Ubaydullah ibn al-Aswad al-Khawlani was in the\\n\\t\\t\\t\\troom of Maimuna, the wife of the Prophet, may Allah bless\\n\\t\\t\\t\\thim and grant him peace, she used to pray in a shift and\\n\\t\\t\\t\\thead-covering, without a waist-wrapper.\\n\\t\\t\\t</p>"
  },
  {
    "BookCode": "AMH",
    "VolumeNumber": "8",
    "hadithNumber": "39",
    "sectionHeading": "Permission for a Woman to Pray in a Shift and Head-Covering",
    "text": "<p>\\n\\t\\t\\t\\tYahya related to me from Malik from Hisham ibn Urwa from\\n\\t\\t\\t\\this father that a woman asked him for a decision, saying,\\n\\t\\t\\t\\t\"Waist-wrappers are painful to me. Can I pray in a shift\\n\\t\\t\\t\\tand head-covering?\"  He replied, \"Yes, if the shift is\\n\\t\\t\\t\\tlong.\"\\n\\t\\t\\t</p>"
  }
]
